[
    {
        "source_sentence": "根本說一切有部毘奈耶藥事",
        "translation": "Mūlasarvâstivāda-sūtra",
        "source": "T24n1448_008:0033a07_0"
    },
    {
        "source_sentence": "卷第八",
        "translation": "Vol. 8",
        "source": "T24n1448_008:0033a08_0"
    },
    {
        "source_sentence": "大唐三藏義淨奉　制譯",
        "translation": "translated by the Tripiṭaka Master Jīvaka of the Great Tang",
        "source": "T24n1448_008:0033a10_0"
    },
    {
        "source_sentence": "爾時世尊於憍薩羅，人間遊行至增長聚落，住增長林中。",
        "translation": "It was then that the Bhagavān traveled among the people of Kośala to a growing village and stayed in a growing forest.",
        "source": "T24n1448_008:0033a11_0"
    },
    {
        "source_sentence": "時蓮花莖婆羅門為聚落主，是勝軍王所施。",
        "translation": "At the time, the lotus stems were given to the Brāhmaṇa as a village chieftain by King Śrīvardhana.",
        "source": "T24n1448_008:0033a12_1"
    },
    {
        "source_sentence": "有弟子名菴沒羅子，博學多聞，辭峰峻發。",
        "translation": "There was a disciple named Kauśinagaraputra, an erudite and learned man who renounced the householder’s life.",
        "source": "T24n1448_008:0033a13_2"
    },
    {
        "source_sentence": "其蓮花莖常有五百梵行弟子，讀誦四明之典。",
        "translation": "The stems of the lotus flower always had five hundred disciples who practiced Buddhism and recited the scriptures of the four kinds of knowledge.",
        "source": "T24n1448_008:0033a14_3"
    },
    {
        "source_sentence": "聞沙門喬答摩，於釋迦族，剃除鬚髮而被法服，正信出家證無上覺，名稱十方，",
        "translation": "I heard that the śramaṇa Gautama had shaved his hair and beard while wearing the religious robes of the Śākya clan. Having renounced the householder’s life with right faith, he realized highest enlightenment and renowned himself in the ten directions.",
        "source": "T24n1448_008:0033a15_4"
    },
    {
        "source_sentence": "如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "The Tathāgata, Arhat, Perfectly Enlightened One, Perfect in Knowledge and Conduct, Well-gone One, Knower of the World, Unsurpassed One, Tamer of Humans, Teacher of Devas and Humans, Buddha, Bhagavān.",
        "source": "T24n1448_008:0033a17_5"
    },
    {
        "source_sentence": "為諸天人、魔梵沙門、婆羅門說：「我生已盡、梵行已立、不受後有、所作已辦。」",
        "translation": "He told the gods, humans, Māra, Brahmā, ascetics, and brāhmaṇas, I've ended birth, established the religious practice, won't experience later existence, and accomplished what I want.",
        "source": "T24n1448_008:0033a18_6"
    },
    {
        "source_sentence": "初善、中善、後善，其語巧妙，純一無雜，具足清白梵行之相，遊行人間至增上林。",
        "translation": "Good in the beginning, good in the middle, and good in the end, their words are skillful, pure and unadulterated, endowed with the characteristics of pure religious practice, traveling among the people until they reach the superior forest.",
        "source": "T24n1448_008:0033a20_7"
    },
    {
        "source_sentence": "彼蓮花莖念云：「如我經說：『若人有三十二相，彼人當有二趣：一者若在家，",
        "translation": "The stems of the lotus flower thought, As my sūtras say, 'If a person has the thirty-two marks, that person will have two destinies:",
        "source": "T24n1448_008:0033a22_8"
    },
    {
        "source_sentence": "當為轉輪王，正化天下，七寶成就，所謂輪寶、象寶、馬寶、女寶、主兵臣寶、主藏臣寶、摩尼珠寶，",
        "translation": "You will become a universal ruler, lord of the wheel-turning kings, overseeing the affairs of the whole empire. You will be endowed with seven treasures: the wheel treasure, the elephant treasure, the horse treasure, the queen treasure, the military commander treasure, the treasury councilor treasure, and the jewelry treasure.",
        "source": "T24n1448_008:0033a23_9"
    },
    {
        "source_sentence": "具足千子，威德勇猛，相貌端嚴，摧伏他軍，大地山河，盡無賊盜，不加刀杖，",
        "translation": "They had a thousand sons, endowed with great power and courage. Their appearance was dignified and they defeated all the armies of others. All the great mountains and rivers were free from thieves and robbers; they did not put up swords or sticks.",
        "source": "T24n1448_008:0033a26_10"
    },
    {
        "source_sentence": "正法理人。",
        "translation": "A person who correctly understands the principle of the Dharma...",
        "source": "T24n1448_008:0033a27_11"
    },
    {
        "source_sentence": "二者若剃除鬚髮，被福田衣，正信出家，當成正覺。』」",
        "translation": "Second, if someone shaves their hair and beard, puts on the robe of the field of merit, leaves home with right faith, and becomes perfectly enlightened.'",
        "source": "T24n1448_008:0033a28_12"
    },
    {
        "source_sentence": "既聞斯已，便告菴沒羅子曰：「汝今知不？",
        "translation": "After hearing this, he then addressed Kauśinagara and said, Do you know it now?",
        "source": "T24n1448_008:0033a29_13"
    },
    {
        "source_sentence": "我聞喬答摩於釋迦族，剃除鬚髮而被法服，正信出家，乃至成等正覺，",
        "translation": "I've heard that Gautama shaved his hair and beard in the Śākya clan, donned the Dharma robes, left home with right faith, and became perfectly enlightened.",
        "source": "T24n1448_008:0033b01_14"
    },
    {
        "source_sentence": "名稱十方。",
        "translation": "They're called the ten directions.",
        "source": "T24n1448_008:0033b02_15"
    },
    {
        "source_sentence": "遊行人間至增長林。",
        "translation": "He traveled among the people until he reached the growth forest.",
        "source": "T24n1448_008:0033b02_16"
    },
    {
        "source_sentence": "我經中說：『若人有三十二相者，此人當有二趣，乃至成等正覺。",
        "translation": "In my sūtras, it's said, 'If someone has the thirty-two marks, this person will have two destinies until they become perfectly enlightened.",
        "source": "T24n1448_008:0033b03_17"
    },
    {
        "source_sentence": "具如上說。』」",
        "translation": "It's as explained above.'",
        "source": "T24n1448_008:0033b04_18"
    },
    {
        "source_sentence": "告門人曰：「汝可往詣喬答摩所，到已白知，如我言不？」",
        "translation": "He told his disciples, Can you go to Gautama's place and tell them when you arrive, just as I said?",
        "source": "T24n1448_008:0033b05_19"
    },
    {
        "source_sentence": "弟子答曰：「唯然受命。」",
        "translation": "The disciple answered, Yes, I'll accept the order.",
        "source": "T24n1448_008:0033b06_20"
    },
    {
        "source_sentence": "時彼弟子與耆舊諸婆羅門等往詣佛所，到已在一面立。",
        "translation": "That disciple then went to the Buddha with the elderly brāhmaṇas and others, and when they arrived, they stood to one side.",
        "source": "T24n1448_008:0033b06_21"
    },
    {
        "source_sentence": "時諸耆舊婆羅門咸皆起居問訊已，退坐一面。",
        "translation": "The elderly and old brāhmaṇas then all stood up and greeted him, withdrew, and sat to one side.",
        "source": "T24n1448_008:0033b08_22"
    },
    {
        "source_sentence": "爾時世尊與諸耆舊婆羅門等演說妙法，示教利喜。",
        "translation": "It was then that the Bhagavān and the elderly brāhmaṇas explained the wonderful teaching, showing it to benefit and delight them.",
        "source": "T24n1448_008:0033b10_0"
    },
    {
        "source_sentence": "時菴沒羅子著一皮革，以高慢心，往來掉動，不聽佛說，輒來問義。",
        "translation": "At the time, while wearing a leather sandal, Kumārajīva's son was so arrogant and agitated that he wouldn't listen to the Buddha's explanation, so he came to inquire about it.",
        "source": "T24n1448_008:0033b11_1"
    },
    {
        "source_sentence": "如來雖答，猶不存意領納佛語，然於世尊輕慢如此。",
        "translation": "Although the Tathāgata answered, he still didn't retain the intention to accept the Buddha's words, but he despised the Bhagavān like this.",
        "source": "T24n1448_008:0033b12_2"
    },
    {
        "source_sentence": "爾時世尊告菴沒羅子言：「彼耆舊婆羅門等皆具三明，汝今豈可輕慢輒相問難？」",
        "translation": "It was then that the Bhagavān addressed Kumārajīva, saying, Those old and young brāhmaṇas all have three kinds of insight, so how can you now despise them and ask difficult questions?",
        "source": "T24n1448_008:0033b14_0"
    },
    {
        "source_sentence": "時菴沒羅答曰：「喬答摩！",
        "translation": "Kauśinagara then answered, Gautama!",
        "source": "T24n1448_008:0033b15_1"
    },
    {
        "source_sentence": "我有何問？」",
        "translation": "What do I have to ask?",
        "source": "T24n1448_008:0033b16_2"
    },
    {
        "source_sentence": "世尊告曰：「我為上首婆羅門等說諸法要。",
        "translation": "The Bhagavān told them, I'll explain the essentials of the Dharma for the supreme Brahmans and others.",
        "source": "T24n1448_008:0033b16_3"
    },
    {
        "source_sentence": "汝今著一皮革往來眾中，輕舉言問。",
        "translation": "Now, wearing a piece of leather, you'll go among the crowd and ask questions lightly.",
        "source": "T24n1448_008:0033b17_4"
    },
    {
        "source_sentence": "我既答已，汝又不聽。」",
        "translation": "After I've answered, you won't listen.",
        "source": "T24n1448_008:0033b18_5"
    },
    {
        "source_sentence": "菴沒羅答曰：「若是婆羅門類，可與同坐言義。",
        "translation": "Ānanda replied, Suppose there are some Brāhmaṇas who can share the same seat and talk about its meaning.",
        "source": "T24n1448_008:0033b18_6"
    },
    {
        "source_sentence": "汝今既是剃髮沙門，非我婆羅門類往來酬答，亦有何過？",
        "translation": "What's wrong with you now that you're a shaved ascetic and not one of my brāhmaṇas who come and go to answer?",
        "source": "T24n1448_008:0033b19_7"
    },
    {
        "source_sentence": "汝沙門等凡夫，行在惡路，多染惡法。",
        "translation": "You śramaṇas and other worldlings have travelled in evil ways and frequently committed evil deeds.",
        "source": "T24n1448_008:0033b21_8"
    },
    {
        "source_sentence": "如汝之輩，應合輕慢與語，故我如此。」",
        "translation": "Like your group, you should be combined with conceit and speech, so I'm like this.",
        "source": "T24n1448_008:0033b22_9"
    },
    {
        "source_sentence": "爾時世尊告菴沒羅曰：「汝來於此，為求利益。",
        "translation": "It was then that the Bhagavān addressed Kauśinagara, saying, Come here to seek benefit.",
        "source": "T24n1448_008:0033b23_0"
    },
    {
        "source_sentence": "我今觀汝，不曾承事師長。」",
        "translation": "Now, I'll observe that you have never served a teacher or elder.",
        "source": "T24n1448_008:0033b24_0"
    },
    {
        "source_sentence": "時菴沒羅聞佛此言，便生嗔恨，於佛世尊欲有誹謗輕毀，作是言曰：「剎利釋種是大愚癡，",
        "translation": "When Ambaṭṭṭha heard these words of the Buddha, he became angry and hated them. Wishing to criticize and disparage the Buddha Bhagavat, he said:",
        "source": "T24n1448_008:0033b24_1"
    },
    {
        "source_sentence": "梵行勝人不知恭敬。」",
        "translation": "The superior in religious practice doesn't know respect.",
        "source": "T24n1448_008:0033b26_2"
    },
    {
        "source_sentence": "佛告菴沒羅言：「諸釋種等有何過失？」",
        "translation": "The Buddha told Kauśinagara, What's wrong with the Śākyamunis?",
        "source": "T24n1448_008:0033b27_3"
    },
    {
        "source_sentence": "菴沒羅子曰：「我於昔時有事入劫比羅城，諸釋種等在於高樓，咸指我言：『此是蓮花莖弟子。』",
        "translation": "Kumārajīva said, In the past, there was a reason for me to enter Kapilavastu, and the Śākyas in the high building pointed at me and said, 'This is the disciple of the lotus flower stem.'",
        "source": "T24n1448_008:0033b27_4"
    },
    {
        "source_sentence": "輕慢於我，不生恭敬。」",
        "translation": "They despise me and don't give rise to respect.",
        "source": "T24n1448_008:0033c01_0"
    },
    {
        "source_sentence": "佛言：「汝見鷦鷯鳥不？",
        "translation": "The Buddha said, Have you seen the garuḍa?",
        "source": "T24n1448_008:0033c01_1"
    },
    {
        "source_sentence": "在於本窠，猶為自在種種言說，況諸釋種在劫比羅城而得自在。」",
        "translation": "In the original tomb, they're still able to speak freely in various ways, so why wouldn't the Śākyas attain freedom in Kapilavastu?",
        "source": "T24n1448_008:0033c01_2"
    },
    {
        "source_sentence": "菴羅子曰：「人有四等：一者婆羅門、二者剎利、三者薜舍、四者戍達羅。",
        "translation": "Śāriputra said, There are four kinds of people: the first are brāhmaṇas, the second are kṣatriyas, the third are eunuchs, and the fourth are śūdras.",
        "source": "T24n1448_008:0033c03_3"
    },
    {
        "source_sentence": "此四類人，咸皆恭敬諸婆羅門。",
        "translation": "These four kinds of people all respected the brāhmaṇas.",
        "source": "T24n1448_008:0033c04_4"
    },
    {
        "source_sentence": "唯汝釋種愚人，見尊勝者，不解恭敬。」",
        "translation": "Only you, the Śākyamuni, are foolish people who see a venerable person and don't understand respect.",
        "source": "T24n1448_008:0033c05_5"
    },
    {
        "source_sentence": "爾時世尊便自念云：「此菴沒羅子云我釋種，從先世來，父是釋種，母非釋種。」",
        "translation": "It was then that the Bhagavān thought to himself, This son of Kāśyapa said, I'm a Śākyamuni; from a previous life, my father was a Śākyamuni, and my mother wasn't a Śākyamuni.",
        "source": "T24n1448_008:0033c06_6"
    },
    {
        "source_sentence": "爾時世尊觀彼菴沒羅昔世父母，是何種類？",
        "translation": "At the time, the Bhagavān observed what kinds of people were the parents of those Kauśinagara's past lives?",
        "source": "T24n1448_008:0033c09_0"
    },
    {
        "source_sentence": "知是釋迦之婢所生種族，諸釋是其昔主。",
        "translation": "They knew they were the descendants of the Śākya maidservants, and the Śākyas were their lords in the past.",
        "source": "T24n1448_008:0033c10_0"
    },
    {
        "source_sentence": "即問菴沒羅曰：「汝今是何種姓？」",
        "translation": "He asked Kumāra, What's your family name now?",
        "source": "T24n1448_008:0033c11_0"
    },
    {
        "source_sentence": "答曰：「喬答摩！",
        "translation": "He replied, Gautama!",
        "source": "T24n1448_008:0033c11_1"
    },
    {
        "source_sentence": "我是耳輪種。」",
        "translation": "I am the ear-wheel seed.",
        "source": "T24n1448_008:0033c12_2"
    },
    {
        "source_sentence": "世尊告曰：「我尋汝種是釋迦婢所生，諸釋種類是汝之主。」",
        "translation": "The Bhagavān told them, I'll find out that your type is born from the Śākya maidservants, and the Śākya types are your master.",
        "source": "T24n1448_008:0033c12_3"
    },
    {
        "source_sentence": "爾時諸耆舊婆羅門等向佛言曰：「喬答摩！",
        "translation": "It was then that the elderly Brāhmaṇas and others said to the Buddha, Gautama!",
        "source": "T24n1448_008:0033c13_4"
    },
    {
        "source_sentence": "而今不應以婢生種譏謗於彼。",
        "translation": "Now, you shouldn't criticize them with the kindness of a maidservant.",
        "source": "T24n1448_008:0033c14_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1448_008:0033c15_6"
    },
    {
        "source_sentence": "此菴沒羅子，博學多聞，辯才無滯，能與喬答摩共相論難酬答。」",
        "translation": "This kiṃnara-putra is learned and well-versed, has no hindrances in his eloquence, and can argue with Gautama for an answer that's difficult to give.",
        "source": "T24n1448_008:0033c15_7"
    },
    {
        "source_sentence": "佛告諸婆羅門：「汝等意謂菴沒羅子與我言論得者，咸且默然，觀我與彼隨問酬答。",
        "translation": "The Buddha told the Brāhmaṇas, Do you think it's because Kumārajīva and I talked to each other about attaining it? They all remained silent and observed me and him as they asked questions and answered them.",
        "source": "T24n1448_008:0033c16_8"
    },
    {
        "source_sentence": "若彼不能與我立宗問難，當默而住。",
        "translation": "If they can't ask questions about the established doctrine with me, they must remain silent and stay silent.",
        "source": "T24n1448_008:0033c18_9"
    },
    {
        "source_sentence": "汝等諸人！",
        "translation": "You people!",
        "source": "T24n1448_008:0033c19_10"
    },
    {
        "source_sentence": "若能與我立宗言論，便可隨意。」",
        "translation": "If you can establish a doctrine with me, then you can follow it.",
        "source": "T24n1448_008:0033c19_11"
    },
    {
        "source_sentence": "諸婆羅門曰：「彼菴羅子摩納婆，多聞通達，言詞巧妙，堪與喬答摩共為論敵。」",
        "translation": "The Brāhmaṇas said, That Cāraṇī Mānavava is well-versed and skillful in speech, and he's capable of arguing with Gautama as an enemy.",
        "source": "T24n1448_008:0033c20_12"
    },
    {
        "source_sentence": "爾時世尊告菴沒羅曰：「摩納婆！",
        "translation": "It was then that the Bhagavān addressed Kauśinagara, Manabha!",
        "source": "T24n1448_008:0033c23_0"
    },
    {
        "source_sentence": "昔有國王號曰甘蔗。",
        "translation": "In the past, there was a king named sugarcane.",
        "source": "T24n1448_008:0033c23_1"
    },
    {
        "source_sentence": "王有四子：一曰炬面、二曰長耳、三曰象肩、四曰足釧。",
        "translation": "The king had four sons: one, the torch-face; two, the long ear; three, the elephant’s shoulder; and four, the crown of his feet.",
        "source": "T24n1448_008:0033c24_2"
    },
    {
        "source_sentence": "時彼四子因有愆過，被王放逐。",
        "translation": "Those four sons then had a dispute and were expelled by the king.",
        "source": "T24n1448_008:0033c25_3"
    },
    {
        "source_sentence": "時彼四子既被王逐，各將親妹往他國境，近雪山下弶伽河岸邊，去劫比羅仙人住處不遠，",
        "translation": "When the four princes had been driven away by the king, each of them went to another country with their relatives and sisters, near the edge of the Ganges at the foot of the Himalayas, not far from the place where the holy man Kapilavastu lived.",
        "source": "T24n1448_008:0033c26_4"
    },
    {
        "source_sentence": "各剪草菴，互娶別生之妹而為居住，因誕男女。",
        "translation": "Each of them cut grass and weeds, married their separately born sisters, and gave birth to men and women as their dwellers.",
        "source": "T24n1448_008:0033c28_5"
    },
    {
        "source_sentence": "後時甘蔗王念此四子，問群臣曰：『我之四子今何所在？』",
        "translation": "Later, King Ikṣuvāku thought of these four sons and asked the ministers, 'Where are my four sons now?'",
        "source": "T24n1448_008:0033c29_6"
    },
    {
        "source_sentence": "群臣答曰：『王之四子，因犯愆過被王放逐，今在他境大雪山下，弶伽河岸邊，",
        "translation": "The ministers replied, “Three of the king’s four sons were accused of sexual misconduct and expelled by the king.",
        "source": "T24n1448_008:0034a01_7"
    },
    {
        "source_sentence": "乃生男女等。』",
        "translation": "They'll then give birth to men and women.'",
        "source": "T24n1448_008:0034a03_8"
    },
    {
        "source_sentence": "時甘蔗王告群臣曰：『我之四子等，能如是耶？』",
        "translation": "The king of sugarcane then addressed his ministers, saying, 'Can my four sons and so forth do so?'",
        "source": "T24n1448_008:0034a03_9"
    },
    {
        "source_sentence": "答曰：『能。』",
        "translation": "He answered, 'Yes.'",
        "source": "T24n1448_008:0034a04_10"
    },
    {
        "source_sentence": "爾時甘蔗王從容舉其右手唱言：『我兒能、最極能，由大威德人言極能故，",
        "translation": "It was then that King Ikṣuvāku lifted his right hand and said, “My son is capable and most capable.",
        "source": "T24n1448_008:0034a04_11"
    },
    {
        "source_sentence": "因名釋迦(唐言「能」也)。』」",
        "translation": "That's why it's called Śākyamuni (known as 'able' in the Tang).'",
        "source": "T24n1448_008:0034a06_12"
    },
    {
        "source_sentence": "佛告菴沒羅曰：「汝豈別聞有餘生耶？」",
        "translation": "The Buddha told Kauśinagara, Have you heard of any other births?",
        "source": "T24n1448_008:0034a07_0"
    },
    {
        "source_sentence": "答曰：「喬答摩！",
        "translation": "He replied, Gautama!",
        "source": "T24n1448_008:0034a07_1"
    },
    {
        "source_sentence": "我聞古來釋迦之種，從此而生。」",
        "translation": "I've heard that the ancient Śākyamuni lineage arises from this.",
        "source": "T24n1448_008:0034a08_2"
    },
    {
        "source_sentence": "佛告菴沒羅曰：「昔甘蔗王有婢名為織經，形容端正，人所喜見。",
        "translation": "The Buddha told Ambapālī, “Formerly King Ikṣuvāku had a maidservants called weavers who were very handsome and pleasing to be seen.",
        "source": "T24n1448_008:0034a08_3"
    },
    {
        "source_sentence": "時有一仙是摩登伽種，常與此婢一處住故，因遂私通，便生一男。",
        "translation": "At the time, there was a sage of the Mātaṅga family who always lived with this maidservant in one place, so he had a private affair and gave birth to a boy.",
        "source": "T24n1448_008:0034a10_4"
    },
    {
        "source_sentence": "其男生已，即能言語云：『且可揩拭洗濯我身，除去不淨。』",
        "translation": "After that boy, he can then say, 'May I wash my body and remove what's impure.'",
        "source": "T24n1448_008:0034a11_5"
    },
    {
        "source_sentence": "彼時喚鬼為迦尼婆夜那，由斯兒生即能語故，謂是生迦尼婆夜那鬼，因號此兒為迦尼婆夜那。",
        "translation": "The demon then called out for Kānipāyaṇa because the child's name was Kānipāyaṇa, and as a result, this child was called Kānipāyaṇa when he was born.",
        "source": "T24n1448_008:0034a12_6"
    },
    {
        "source_sentence": "從此以來，迦尼婆夜那種。",
        "translation": "From that time forth, Kānipāya’s philosophy has been like this.",
        "source": "T24n1448_008:0034a15_7"
    },
    {
        "source_sentence": "菴沒羅！",
        "translation": "(Skt. kiṃnara)",
        "source": "T24n1448_008:0034a15_8"
    },
    {
        "source_sentence": "汝頗曾聞迦尼婆種從此生耶？」",
        "translation": "Have you ever heard that the Kānivāsa family is born from here?",
        "source": "T24n1448_008:0034a15_9"
    },
    {
        "source_sentence": "佛說此語已，時菴沒羅便即默然。",
        "translation": "After the Buddha spoke these words, Kauśinagara then remained silent.",
        "source": "T24n1448_008:0034a16_10"
    },
    {
        "source_sentence": "第二、第三作如是問，時菴沒羅亦復默然。",
        "translation": "When the second and third questions were asked in this way, Kumārajīva also remained silent.",
        "source": "T24n1448_008:0034a17_11"
    },
    {
        "source_sentence": "爾時執金剛神，手執金剛杵，其焰煇赫、色如猛火，見菴沒羅默然思惟不答世尊，",
        "translation": "At the time, the vajra spirit was holding a vajra pounder in his hand, whose flame was so blazing and its color was like that of fierce fire. Seeing Vimalakīrti, he thought quietly without replying to the World-honored One.",
        "source": "T24n1448_008:0034a18_12"
    },
    {
        "source_sentence": "持杵擬菴沒羅頭，作是念云：「今者世尊三問菴沒羅先世種姓，若菴沒羅不答世尊者，",
        "translation": "He held the pounder in his hand and shaped it like a man’s hair, thinking: “The World-honored One now asks three questions about the kṣatriya Kauśinagara’s family background.",
        "source": "T24n1448_008:0034a20_13"
    },
    {
        "source_sentence": "我當持此火杵碎菴沒羅頭令為七分。」",
        "translation": "I will take this fiery pounder and crush the top of my head into seven parts.",
        "source": "T24n1448_008:0034a22_14"
    },
    {
        "source_sentence": "時菴沒羅，以佛威力故，見彼執金剛杵，即便惶怖身毛皆竪，白佛言：「喬答摩！",
        "translation": "Because of the Buddha's authoritative power, Ānanda then saw him holding the vajra and became frightened, his hair stood on end and said to the Buddha, Gautama!",
        "source": "T24n1448_008:0034a22_15"
    },
    {
        "source_sentence": "我聞迦尼婆夜那從彼而生。」",
        "translation": "I've heard that Kāni-pāyaṇa arises from them.",
        "source": "T24n1448_008:0034a24_16"
    },
    {
        "source_sentence": "時耆舊婆羅門等白佛言：「世尊！",
        "translation": "The elderly brāhmaṇas and others then said to the Buddha, Bhagavān!",
        "source": "T24n1448_008:0034a25_17"
    },
    {
        "source_sentence": "我等昔來不信；",
        "translation": "We did not believe in it in the past.",
        "source": "T24n1448_008:0034a26_0"
    },
    {
        "source_sentence": "世尊所言，方知菴沒羅種是釋迦婢生，其言非謬。」",
        "translation": "The Bhagavān said, Only then did he know that the Kauśina maid was born as a Śākya maid, and his words weren't incorrect.",
        "source": "T24n1448_008:0034a26_1"
    },
    {
        "source_sentence": "爾時世尊告諸婆羅門言：「汝等不應以婢生種譏謗菴沒羅。",
        "translation": "It was then that the Bhagavān addressed the Brāhmaṇas, saying, You shouldn't criticize Kauśinagara for being born as a maid.",
        "source": "T24n1448_008:0034a28_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1448_008:0034a29_1"
    },
    {
        "source_sentence": "彼昔仙人有大神通威德，由甘蔗王於彼仙人曾有過失，彼便以惡呪誓法而訶責之。",
        "translation": "In the past, that sage had great supernormal powers and authoritative virtue, and because King Ikṣuvāku had faults with that sage, he reprimanded him with a bad spell and vowed to reprimand him.",
        "source": "T24n1448_008:0034a29_2"
    },
    {
        "source_sentence": "王既聞已，憂愁惶怖身毛聳竪，便以種種殊珍嚴飾長女，王以左手執女、右手執一金瓶，",
        "translation": "Having heard this, the king was greatly distressed and frightened. His hair stood on end and his body hair stood on end in fear. He adorned the queen’s maiden with various rare treasures. The king held the queen in his left hand and a golden vase in his right hand.",
        "source": "T24n1448_008:0034b02_3"
    },
    {
        "source_sentence": "以與仙人而為其婦。",
        "translation": "He gave her to the sage and made her his wife.",
        "source": "T24n1448_008:0034b04_4"
    },
    {
        "source_sentence": "時彼仙人不受王女。」",
        "translation": "That sage then didn't accept the king's daughter.",
        "source": "T24n1448_008:0034b04_5"
    },
    {
        "source_sentence": "時菴沒羅見世尊說是婢生種故默然憔悴，伏面下視而無威光，思惟而住。",
        "translation": "Seeing the Bhagavān's explanation that this was the maidservant's seed, Kauśinagara remained silent and emaciated, looked down to his face without authority, contemplated, and stayed.",
        "source": "T24n1448_008:0034b05_6"
    },
    {
        "source_sentence": "爾時世尊作是念曰：「由我說彼菴沒羅子，是婢生種故，默然憔悴，身無威光，",
        "translation": "It was then that the World-honored One thought to himself, “Because I told you about this brahman’s son Candracchattra, who had been born in a maidservant’s household, he remained silent and emaciated.",
        "source": "T24n1448_008:0034b08_0"
    },
    {
        "source_sentence": "思惟而住。",
        "translation": "He contemplates and abides.",
        "source": "T24n1448_008:0034b09_1"
    },
    {
        "source_sentence": "我今應與其語。」",
        "translation": "Now, I should give them my words.",
        "source": "T24n1448_008:0034b09_2"
    },
    {
        "source_sentence": "作是念已告菴沒羅曰：「摩納婆！",
        "translation": "After he had this thought, he told Kauśinagara, Manabha!",
        "source": "T24n1448_008:0034b10_3"
    },
    {
        "source_sentence": "猶如剎利童子與婆羅門童女共為婚對，因生一男。",
        "translation": "It's like when a boy from the kṣatriya and a Brāhmaṇa girl were engaged in marriage, and a man was born because of that.",
        "source": "T24n1448_008:0034b11_0"
    },
    {
        "source_sentence": "彼男於婆羅門眾中，得共坐起、得共祭水、得讀典籍不？」",
        "translation": "Will that boy be allowed to sit and rise together among the Brāhmaṇas, offer water together, and read the texts?",
        "source": "T24n1448_008:0034b12_1"
    },
    {
        "source_sentence": "菴沒羅曰：「得耳。",
        "translation": "Kauśinagara said, Yes.",
        "source": "T24n1448_008:0034b13_2"
    },
    {
        "source_sentence": "喬答摩！」",
        "translation": "Gautama!",
        "source": "T24n1448_008:0034b13_3"
    },
    {
        "source_sentence": "佛言：「摩納婆！",
        "translation": "The Buddha said, Manabha!",
        "source": "T24n1448_008:0034b13_4"
    },
    {
        "source_sentence": "彼男得剎利灌頂以不？」",
        "translation": "Will that boy attain the consecration of the kṣatriya?",
        "source": "T24n1448_008:0034b14_5"
    },
    {
        "source_sentence": "答言：「得耳。",
        "translation": "He replied, Yes.",
        "source": "T24n1448_008:0034b14_6"
    },
    {
        "source_sentence": "喬答摩！",
        "translation": "Gautama!",
        "source": "T24n1448_008:0034b15_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1448_008:0034b15_1"
    },
    {
        "source_sentence": "以是婆羅門外甥故，以是剎利姓兒故。」",
        "translation": "It's because he's a nephew of the Brāhmaṇa, and it's because he's a son of the Śāriputra family.",
        "source": "T24n1448_008:0034b15_2"
    },
    {
        "source_sentence": "佛復告菴沒羅：「有婆羅門童子與剎利童女共為夫婦，後生一男。",
        "translation": "Again, the Buddha told Kauśinagara, There was a Brāhmaṇa boy who married with a Śāriputra girl and gave birth to a boy.",
        "source": "T24n1448_008:0034b16_3"
    },
    {
        "source_sentence": "此男於婆羅門眾中，得同坐起、得共祭水、得讀典籍？",
        "translation": "Among the brāhmaṇas, will this boy be allowed to sit and rise up with them, offer water together, and read the texts?",
        "source": "T24n1448_008:0034b17_4"
    },
    {
        "source_sentence": "於剎利眾中得受灌頂不？」",
        "translation": "Is it possible to receive the consecration among the kṣatriyas?",
        "source": "T24n1448_008:0034b18_5"
    },
    {
        "source_sentence": "答言：「得耳，喬答摩！",
        "translation": "He replied, Yes, Gautama!",
        "source": "T24n1448_008:0034b19_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1448_008:0034b19_7"
    },
    {
        "source_sentence": "由是婆羅門姪兒、是剎利外甥故。」",
        "translation": "It's because this is a Brāhmaṇa's nephew and a non-Buddhist's nephew.",
        "source": "T24n1448_008:0034b20_8"
    },
    {
        "source_sentence": "佛言：「如剎利童子因犯愆過，被剎利驅逐。",
        "translation": "The Buddha said, Suppose a boy of the kṣatriyas is expelled by the kṣatriyas because he commits sexual misconduct.",
        "source": "T24n1448_008:0034b20_9"
    },
    {
        "source_sentence": "彼得於婆羅門眾中，共坐起不？",
        "translation": "Does Peter get up while sitting together among the Brāhmaṇas?",
        "source": "T24n1448_008:0034b21_10"
    },
    {
        "source_sentence": "得祭水不？",
        "translation": "Can you offer water for the sacrifice?",
        "source": "T24n1448_008:0034b22_11"
    },
    {
        "source_sentence": "得讀典籍不？」",
        "translation": "Will you be able to read the text?",
        "source": "T24n1448_008:0034b22_12"
    },
    {
        "source_sentence": "答言：「得耳。",
        "translation": "He replied, Yes.",
        "source": "T24n1448_008:0034b23_13"
    },
    {
        "source_sentence": "喬答摩！」",
        "translation": "Gautama!",
        "source": "T24n1448_008:0034b23_14"
    },
    {
        "source_sentence": "「於剎利眾中，得受灌頂不？」",
        "translation": "Among the kṣatriyas, will they receive the consecration?",
        "source": "T24n1448_008:0034b23_15"
    },
    {
        "source_sentence": "答言：「得耳，喬答摩！",
        "translation": "He replied, Yes, Gautama!",
        "source": "T24n1448_008:0034b24_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1448_008:0034b24_17"
    },
    {
        "source_sentence": "以是親故。」",
        "translation": "It's because they're relatives.",
        "source": "T24n1448_008:0034b24_18"
    },
    {
        "source_sentence": "佛言：「摩納婆！",
        "translation": "The Buddha said, Manabha!",
        "source": "T24n1448_008:0034b25_0"
    },
    {
        "source_sentence": "有婆羅門童子，被婆羅門驅逐，得於婆羅門眾中得同坐起、得共祭水、得讀典籍不？」",
        "translation": "Is there a Brāhmaṇa boy who's expelled by a Brāhmaṇa and is allowed to sit together among the Brāhmaṇas, offer water together, and read the texts?",
        "source": "T24n1448_008:0034b25_1"
    },
    {
        "source_sentence": "答言：「不得。",
        "translation": "He replied, They won't.",
        "source": "T24n1448_008:0034b27_2"
    },
    {
        "source_sentence": "喬答摩！」",
        "translation": "Gautama!",
        "source": "T24n1448_008:0034b27_3"
    },
    {
        "source_sentence": "「得於剎利眾中，得受灌頂不？」",
        "translation": "Is it possible to receive the consecration among the kṣatriyas?",
        "source": "T24n1448_008:0034b27_4"
    },
    {
        "source_sentence": "答言：「不得。",
        "translation": "He replied, They won't.",
        "source": "T24n1448_008:0034b28_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1448_008:0034b28_6"
    },
    {
        "source_sentence": "以犯本戒，號為婆羅門旃茶羅故。」",
        "translation": "It's because he violated the original precepts and was called a brāhmaṇa caṇḍāla.",
        "source": "T24n1448_008:0034b28_7"
    },
    {
        "source_sentence": "佛言：「摩納婆！",
        "translation": "The Buddha said, Manabha!",
        "source": "T24n1448_008:0034b29_8"
    },
    {
        "source_sentence": "當知剎利生者，種族姓望，最為尊貴，婆羅門則不如此。",
        "translation": "You should know that the kṣatriyas are born of various castes and clans, being the most noble among them. The brāhmaṇas are not like this.",
        "source": "T24n1448_008:0034b29_9"
    },
    {
        "source_sentence": "「『剎利承嫡者，　　兩足中最尊，",
        "translation": "'The kṣatriya inheritants are the most honored among the two-legged,",
        "source": "T24n1448_008:0034c02_10"
    },
    {
        "source_sentence": "　　明行具圓滿，　　得在天人上。』",
        "translation": "It's clear that the fulfillment of practice is attained above gods and humans.'",
        "source": "T24n1448_008:0034c02_10"
    },
    {
        "source_sentence": "是故梵天娑呵世主說伽他曰：「摩納婆！",
        "translation": "That's why the lord of Brahmā Sāhā said, Manabhadra!",
        "source": "T24n1448_008:0034c02_10"
    },
    {
        "source_sentence": "「『剎利承的者，　　兩足中最尊，",
        "translation": "'The kṣatriya is the most honored among two-legged beings.",
        "source": "T24n1448_008:0034c05_11"
    },
    {
        "source_sentence": "　　明行具圓滿，　　得在天人上。』",
        "translation": "It's clear that the fulfillment of practice is attained above gods and humans.'",
        "source": "T24n1448_008:0034c05_11"
    },
    {
        "source_sentence": "我亦如是重說伽他曰：「摩納婆！",
        "translation": "I, too, repeatedly explained this to the gāthāgata, saying, Manabha!",
        "source": "T24n1448_008:0034c05_11"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T24n1448_008:0034c08_12"
    },
    {
        "source_sentence": "若淨行婆羅門，嫁娶諸婆羅門，得於此中受其祭水及誦其典籍不？」",
        "translation": "If there are purely practicing Brāhmaṇas who marry and marry Brāhmaṇas, will they be allowed to receive the water for offerings and recite the texts here?",
        "source": "T24n1448_008:0034c08_13"
    },
    {
        "source_sentence": "答言：「得。」",
        "translation": "He replied, Yes.",
        "source": "T24n1448_008:0034c09_14"
    },
    {
        "source_sentence": "佛言：「因於嫁娶聚會，便執種姓。",
        "translation": "The Buddha said, As a result of being married and gathered together, they then cling to their castes.",
        "source": "T24n1448_008:0034c10_15"
    },
    {
        "source_sentence": "若有一切執著族姓，自言我是摩納婆者，此人不能見證無上明行足。",
        "translation": "If there are all those who cling to clans and say themselves, 'I am Manabha,' they won't be able to witness the unsurpassed sufficientness of insight and practice.",
        "source": "T24n1448_008:0034c10_16"
    },
    {
        "source_sentence": "若捨離我慢種姓，即能修行，證此無上明行足。」",
        "translation": "If someone abandons the family of self-conceit, they'll be able to cultivate it and realize this unsurpassed sufficient practice of insight.",
        "source": "T24n1448_008:0034c12_17"
    },
    {
        "source_sentence": "時菴沒羅白佛言：「如我狂醉，於世尊前生輕慢者，過去、現在乃至未來，",
        "translation": "Ānanda then said to the Buddha: Just as I am in a state of madness and drunk, so too should those who are disrespectful before the World-honored One. In the past, present, and future...",
        "source": "T24n1448_008:0034c13_18"
    },
    {
        "source_sentence": "亦無此輩願為我說如是勝法，由此令我得悟明行足。」",
        "translation": "Nor are there any of these people who want to teach me such a superior teaching, so that I'll attain the fulfillment of enlightenment and practice.",
        "source": "T24n1448_008:0034c15_19"
    },
    {
        "source_sentence": "佛言：「諦聽！",
        "translation": "The Buddha said, Listen closely!",
        "source": "T24n1448_008:0034c16_20"
    },
    {
        "source_sentence": "極善作意。",
        "translation": "It's extremely well-contemplated.",
        "source": "T24n1448_008:0034c16_21"
    },
    {
        "source_sentence": "摩納婆！",
        "translation": "Mānava-va!",
        "source": "T24n1448_008:0034c16_22"
    },
    {
        "source_sentence": "諸佛出現於世，如來、應、正等覺、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "When the Buddhas appeared in the world, the Tathāgata, Arhat, Perfectly Enlightened One, Perfect in Knowledge and Conduct, Well-gone One, Understander of the World, Unsurpassed One, Tamer of Humans, Teacher of Devas and Humans, Buddha, Bhagavān.",
        "source": "T24n1448_008:0034c17_23"
    },
    {
        "source_sentence": "然彼說法初善、中善、後善，詞義巧妙、純一無雜，具足清白梵行之相。",
        "translation": "Still, they teach the Dharma that's good in the beginning, good in the middle, and good in the end, with subtle words and meanings that are pure and unadulterated, fully endowed with the characteristics of the pure religious practice.",
        "source": "T24n1448_008:0034c19_24"
    },
    {
        "source_sentence": "若居士居士子聞此法者，能生信心。",
        "translation": "If a householder or layman hears this teaching, he'll be able to give rise to faith.",
        "source": "T24n1448_008:0034c20_25"
    },
    {
        "source_sentence": "由信心故，即專修學，能知在家是諸苦惱積集之處，凡是出家趣於空野。",
        "translation": "Because of their faith, they're able to know that at home the accumulation of suffering and distress is a place where all those who leave home are headed for the sky and wilderness.",
        "source": "T24n1448_008:0034c21_26"
    },
    {
        "source_sentence": "若在家者，多被攀緣鉤繅繫縛，乃至盡形，不能修習純一無雜具足清白梵行之相。",
        "translation": "If someone at home, they're often bound by clinging to hooks and ropes, even up to their full form, and they can't cultivate the pure and unadulterated characteristic of the pure and white religious practice.",
        "source": "T24n1448_008:0034c23_27"
    },
    {
        "source_sentence": "然我剃除鬚髮，被服袈裟，以正信心，從家趣於非家，精勤修習，決擇知已，",
        "translation": "Having shaved my hair and beard, donning the yellow robe of a monk’s robe, I proceeded in faith from one householder’s place to another.",
        "source": "T24n1448_008:0034c25_28"
    },
    {
        "source_sentence": "或多財物或少財物，或多眷屬或少眷屬，悉皆捨離棄俗出家，剃除鬚髮，",
        "translation": "They may have many possessions or few possessions, or they may have many retinues or few retinues. All of them abandon the world and leave home, shaving their hair and beards.",
        "source": "T24n1448_008:0034c26_29"
    },
    {
        "source_sentence": "被著袈裟起正信心，從家趣於非家，住於淨戒，披解脫衣，具足行法，",
        "translation": "Putting on the monastic robes, they give rise to right faith, proceeding from home to where there is no home. Abiding in pure morality, they don the clothes of liberation and are fully endowed with the methods of practice.",
        "source": "T24n1448_008:0034c28_30"
    },
    {
        "source_sentence": "縱有小罪，深心怯懼，一切善品，受已修學，捨能殺生，息持刀杖，於諸有情，",
        "translation": "Even if someone commits a minor offense and is deeply frightened, they'll accept all good qualities, cultivate them, abandon the ability to kill sentient beings, and stop holding swords and staves.",
        "source": "T24n1448_008:0035a01_31"
    },
    {
        "source_sentence": "皆起慈悲，乃至蚊蟻，皆無害心(廣如《長阿笈摩戒蘊品》中說於菴婆娑婆羅門事)。」",
        "translation": "They all give rise to compassion, even mosquitoes and ants, and they all have no harmful thoughts (explained in detail in the Longer Chapter of the Sutra on the Sangha of Morality as relating to the affairs of the Brāhmaṇa Upāsaka).",
        "source": "T24n1448_008:0035a02_32"
    },
    {
        "source_sentence": "爾時世尊至葉聚落，為諸四眾廣說四佛坐經已，復至日出聚落，為二姊妹女人：一名賢喜、二名明月，",
        "translation": "At that time the World-honored One came to the village of Ye and extensively taught the sutra on the four buddhas’ seats to the fourfold assembly. Then he returned to the village of Sunetra (i.e., Sāvatthī), where he stayed with two sisters: one was named Bhadravyūha and the other Moon of Knowledge.",
        "source": "T24n1448_008:0035a04_0"
    },
    {
        "source_sentence": "廣說如經。",
        "translation": "It's explained in detail as in the sūtras.",
        "source": "T24n1448_008:0035a06_1"
    },
    {
        "source_sentence": "世尊復於憍薩羅，人間遊行至室羅伐城。",
        "translation": "Again, the Bhagavān traveled among the people of Kośala to the city of Śrāvastī.",
        "source": "T24n1448_008:0035a06_2"
    },
    {
        "source_sentence": "時給孤獨長者往詣佛所，頂禮佛足，退坐一面。",
        "translation": "The orphaned elder Anāthapiṇḍika then went to the Buddha, bowed his head at his feet, withdrew, and sat to one side.",
        "source": "T24n1448_008:0035a07_3"
    },
    {
        "source_sentence": "世尊為說法要，示教利喜已，世尊默然而坐。",
        "translation": "After the Bhagavān taught the essentials of the Dharma and showed them how to benefit and delight, the Bhagavān sat silently.",
        "source": "T24n1448_008:0035a08_4"
    },
    {
        "source_sentence": "時給孤獨長者從座而起，合掌頂禮，而白佛言：「唯願世尊及諸苾芻眾，",
        "translation": "The orphaned householder Anāthapiṇḍika then rose from his seat, joined his palms and bowed his head in respect, and said to the Buddha:",
        "source": "T24n1448_008:0035a09_5"
    },
    {
        "source_sentence": "明日就宅，受我微供。」",
        "translation": "On the next day, he'll go to his house and accept my humble offerings.",
        "source": "T24n1448_008:0035a11_6"
    },
    {
        "source_sentence": "世尊默受。",
        "translation": "The Bhagavān accepted it in silence.",
        "source": "T24n1448_008:0035a11_7"
    },
    {
        "source_sentence": "知佛受已，即辭歸家，於其夜分，嚴淨飲食。",
        "translation": "Knowing that the Buddha had accepted it, he departed and returned home. At night his food and drink were provided in a pure and clean manner.",
        "source": "T24n1448_008:0035a11_8"
    },
    {
        "source_sentence": "至明晨時，遣使迎佛：「唯願世尊，降赴就宅。」",
        "translation": "In the morning, he sent an envoy to meet the Buddha, Please, Bhagavān, descend and go to your house.",
        "source": "T24n1448_008:0035a12_9"
    },
    {
        "source_sentence": "世尊既至，飯食訖，是時長者取一小座，專心而坐。",
        "translation": "When the World-honored One arrived, after he had finished his meal, the householder took a small seat and sat with concentration on it.",
        "source": "T24n1448_008:0035a13_10"
    },
    {
        "source_sentence": "時世尊為給孤獨長者，說諸法要。",
        "translation": "The Bhagavān then taught the essentials of the Dharma for the elder Anāthapiṇḍika.",
        "source": "T24n1448_008:0035a14_11"
    },
    {
        "source_sentence": "示教利喜已，從坐而去。",
        "translation": "After he taught, benefited, and rejoiced, he left his seat and departed.",
        "source": "T24n1448_008:0035a15_12"
    },
    {
        "source_sentence": "諸婆羅門居士，次第供養佛及聖眾。",
        "translation": "The Brāhmaṇas and householders made offerings to the Buddha and the holy ones in order.",
        "source": "T24n1448_008:0035a16_13"
    },
    {
        "source_sentence": "時諸苾芻受食之時，未及自喫，先與貧兒，諸婆羅門居士皆起譏嫌。",
        "translation": "When the monks accepted the food, they didn't have time to eat it themselves and first gave it to the poor child, and the Brāhmaṇas and householders all became angry.",
        "source": "T24n1448_008:0035a17_14"
    },
    {
        "source_sentence": "時諸苾芻以緣白佛，佛言：「應先自食，餘施貧兒。」",
        "translation": "The monks then reported this to the Buddha for his sake, and he said, You should first feed yourself and give the rest to a poor child.",
        "source": "T24n1448_008:0035a18_15"
    },
    {
        "source_sentence": "有二乞兒：一是婆羅門童子、一是剎利童子。",
        "translation": "There were two beggar children: one, a brahman boy and one, a kṣatriya boy.",
        "source": "T24n1448_008:0035a19_16"
    },
    {
        "source_sentence": "其婆羅門童子，不知時事，僧伽未食，先來前乞。",
        "translation": "The Brāhmaṇa boy did not know the proper time and before the meal was over, the monks of the saṃgha came to beg.",
        "source": "T24n1448_008:0035a20_17"
    },
    {
        "source_sentence": "諸苾芻等無與食者；",
        "translation": "The bhikṣus and others did not give food to them.",
        "source": "T24n1448_008:0035a21_18"
    },
    {
        "source_sentence": "剎利童子，食後方乞，眾多施與。",
        "translation": "The kṣatriya boy begged after he ate and gave many gifts.",
        "source": "T24n1448_008:0035a22_19"
    },
    {
        "source_sentence": "剎利童子問彼童子曰：「汝乞食得不？」",
        "translation": "The boy Śāriputra asked the boy, Can you beg for food?",
        "source": "T24n1448_008:0035a23_20"
    },
    {
        "source_sentence": "彼便報曰：「我不得食。」",
        "translation": "They then replied, I won't eat.",
        "source": "T24n1448_008:0035a23_21"
    },
    {
        "source_sentence": "因嗔恨言：「若我自在，釋迦弟子，皆斷其頭，棄之於地。」",
        "translation": "He became angry and said, If I were self-willed, the Śākyamuni disciples would all cut off my head and throw it to the ground.",
        "source": "T24n1448_008:0035a24_22"
    },
    {
        "source_sentence": "剎利童子曰：「若我自在，佛及苾芻，以六種味，日日供養。」",
        "translation": "The kṣatriya boy said, Suppose I were to make offerings to the self-contained buddhas and bhikṣus with six kinds of flavors every day.",
        "source": "T24n1448_008:0035a25_23"
    },
    {
        "source_sentence": "彼二童子各作言已，於一樹下咸自眠睡。",
        "translation": "After each of those two children said this, they all slept under a tree.",
        "source": "T24n1448_008:0035a26_24"
    },
    {
        "source_sentence": "時有一車輅馬驚，碾婆羅門童子，因遂頭斷。",
        "translation": "A chariot and horse were frightened and crushed the brahman’s young boy, who consequently lost his hair.",
        "source": "T24n1448_008:0035a27_25"
    },
    {
        "source_sentence": "「意常為首，　　起業為最，　　心有所恨，",
        "translation": "Mind is always at the foremost, Actions are the most prominent. The mind has feelings of hatred and hostility.",
        "source": "T24n1448_008:0035a28_26"
    },
    {
        "source_sentence": "　速受其報，　　苦來逼身，　　輪斷其頭。」",
        "translation": "You'll quickly experience its retribution, and suffering will come to oppress you, cutting off your head with a wheel.",
        "source": "T24n1448_008:0035a28_26"
    },
    {
        "source_sentence": "爾時世尊由此事故說伽他曰：爾時具壽阿難陀白佛言：「世尊！",
        "translation": "It was then that the Bhagavān spoke to him about this matter, saying, At that point, Kauśinagara Ānanda said to the Buddha, Bhagavān!",
        "source": "T24n1448_008:0035a28_26"
    },
    {
        "source_sentence": "所說此頌，其義云何？」",
        "translation": "What does this verse say, and what does it mean?",
        "source": "T24n1448_008:0035b03_27"
    },
    {
        "source_sentence": "佛告阿難陀曰：「汝今見不？",
        "translation": "The Buddha told Ānanda, Do you see it now?",
        "source": "T24n1448_008:0035b04_28"
    },
    {
        "source_sentence": "彼婆羅門童子，於佛苾芻起不善心、出麁惡語。",
        "translation": "That Brāhmaṇa boy had an unwholesome mind and spoke harshly and badly to the Buddha's monks.",
        "source": "T24n1448_008:0035b04_29"
    },
    {
        "source_sentence": "由此因故，輪碾頭斷。」",
        "translation": "Because of this cause, the wheel-turning head is stopped.",
        "source": "T24n1448_008:0035b05_30"
    },
    {
        "source_sentence": "阿難陀答曰：「我今已見。」",
        "translation": "Ānanda answered, I've seen it now.",
        "source": "T24n1448_008:0035b06_31"
    },
    {
        "source_sentence": "世尊告曰：「我見此事，故說伽他。」",
        "translation": "The Bhagavān told him, I see this matter, so I'll explain it as a verse.",
        "source": "T24n1448_008:0035b06_32"
    },
    {
        "source_sentence": "時室羅伐城有一長者，無子命終。",
        "translation": "At the time, there was an elderly man in Śrāvastī who had no children and died.",
        "source": "T24n1448_008:0035b07_33"
    },
    {
        "source_sentence": "城中婆羅門居士共相議曰：「今此長者，身已亡歿，又無子息，欲令何人繼嗣於後？」",
        "translation": "The Brāhmaṇa householders in the city had a discussion with each other, saying, Now that this elder has died and no children, who will be his successor?",
        "source": "T24n1448_008:0035b08_34"
    },
    {
        "source_sentence": "見前剎利童子在樹下臥，于時日光西傾，樹枝影覆童子上而不移謝。",
        "translation": "When he saw the former kṣatriya boy lying under a tree, the sun was shining westward at that time, and the shadow of a tree branch covered the boy without moving or shrinking.",
        "source": "T24n1448_008:0035b10_35"
    },
    {
        "source_sentence": "眾人見已，便將歸舍，繼嗣長者。",
        "translation": "Seeing this, the people returned home and inherited the wealthy man’s property.",
        "source": "T24n1448_008:0035b11_36"
    },
    {
        "source_sentence": "既嗣已，童子念云：「此由佛法僧力，我今請世尊及苾芻眾，設諸供養。」",
        "translation": "After he had inherited it, the boy thought, It's because of the power of the Buddha, Dharma, and Saṃgha that I now invite the Bhagavān and the monks to make offerings.",
        "source": "T24n1448_008:0035b12_37"
    },
    {
        "source_sentence": "作是念已，往世尊所，頭面禮足，取一小座，一邊而坐。",
        "translation": "Having thought thus, they went to the place where the World-honored One was. After bowing their foreheads and feet at his feet, they took a small seat and sat cross-legged on one side.",
        "source": "T24n1448_008:0035b14_0"
    },
    {
        "source_sentence": "爾時世尊為彼童子說諸法要，童子聞法。",
        "translation": "It was then that the Bhagavān explained the essentials of the Dharma for that boy, and the boy heard the teaching.",
        "source": "T24n1448_008:0035b15_1"
    },
    {
        "source_sentence": "從坐而起，合掌白佛言：「唯願世尊，至明食時，與苾芻眾至我家中，",
        "translation": "He rose from his seat, joined his palms in respect, and said to the Buddha: World-honored One, may your holiness, at the time of tomorrow’s meal, accompanied by a host of bhikṣus, come to my house.",
        "source": "T24n1448_008:0035b16_2"
    },
    {
        "source_sentence": "受我微供。」",
        "translation": "Accept my humble offerings.",
        "source": "T24n1448_008:0035b17_3"
    },
    {
        "source_sentence": "世尊默然受請。",
        "translation": "The Bhagavān accepted the invitation by remaining silent.",
        "source": "T24n1448_008:0035b17_4"
    },
    {
        "source_sentence": "爾時世尊至明食時，與諸苾芻，至童子家。",
        "translation": "When the Bhagavān arrived at dawn, he went to the boy's house with the monks and nuns.",
        "source": "T24n1448_008:0035b18_5"
    },
    {
        "source_sentence": "飯食已，為彼童子稱機說法。",
        "translation": "After he had eaten the rice, he taught the Dharma to that boy according to his ability.",
        "source": "T24n1448_008:0035b19_6"
    },
    {
        "source_sentence": "爾時童子證預流果，獲四諦理，無始已來薩迦邪見，以金剛杵而摧壞之。",
        "translation": "At the time, the boy realized the fruit of pre-flow and attained the principle of the four truths, and since beginningless time, he had cultivated a wrong view of saṃka and destroyed it with a vajra pounder.",
        "source": "T24n1448_008:0035b19_7"
    },
    {
        "source_sentence": "自云：「今我信心，歸依佛法僧，乃至命存永不退轉。」",
        "translation": "He said to himself, Now, I believe in the Buddha, Dharma, and saṃgha, and I'll never turn away from them until my life is preserved.",
        "source": "T24n1448_008:0035b21_8"
    },
    {
        "source_sentence": "世尊為長者子，已說法要，示教利喜。",
        "translation": "The World-honored One taught the essentials of the Dharma to the householder’s children, encouraging, benefiting, and delighting them.",
        "source": "T24n1448_008:0035b22_9"
    },
    {
        "source_sentence": "其長者子即從坐起，頂禮而去。",
        "translation": "The son of the wealthy man rose from his seat, paid homage, and departed.",
        "source": "T24n1448_008:0035b23_10"
    },
    {
        "source_sentence": "「意常為首，　　起業為最，　　心意清淨，",
        "translation": "Mind is always at the foremost, Actions are the most productive. The mind and thought are pure,",
        "source": "T24n1448_008:0035b24_11"
    },
    {
        "source_sentence": "爾時世尊還至本處，於苾芻眾前說此頌曰：　即受善報。」",
        "translation": "It was then that the Bhagavān returned to his original place and spoke this verse in front of the monks, That's when he received a good reward.",
        "source": "T24n1448_008:0035b24_11"
    },
    {
        "source_sentence": "爾時具壽阿難陀白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Ānanda said to the Buddha, Bhagavān!",
        "source": "T24n1448_008:0035b28_0"
    },
    {
        "source_sentence": "所說此頌，其義云何？」",
        "translation": "What does this verse say, and what does it mean?",
        "source": "T24n1448_008:0035b28_1"
    },
    {
        "source_sentence": "佛告阿難陀曰：「汝見彼剎利童子，於佛聖眾發大信心，由此力故，室羅伐城諸婆羅門居士等令繼嗣為長者，",
        "translation": "The Buddha said to Ānanda: You see, O kṣatriya boy, the great faith that you have aroused in the buddhas and holy ones. Because of this great faith, the brahmans and wealthy householders of Śrāvastī and elsewhere succeeded him as their wealthy citizens.",
        "source": "T24n1448_008:0035b29_2"
    },
    {
        "source_sentence": "今受財位。",
        "translation": "Now, he's in the position of receiving possessions.",
        "source": "T24n1448_008:0035c02_3"
    },
    {
        "source_sentence": "「意常為首，　　起業為最，　　心意清淨，",
        "translation": "Mind is always at the foremost, Actions are the most productive. The mind and thought are pure,",
        "source": "T24n1448_008:0035c02_4"
    },
    {
        "source_sentence": "是故我說此伽他曰：　即受善報。」",
        "translation": "That's why I say to this person, 'That's when they receive good rewards.'",
        "source": "T24n1448_008:0035c02_4"
    },
    {
        "source_sentence": "爾時世尊至婆羅羅聚落，於此廣說《四佛座經》。",
        "translation": "At the time, the Bhagavān went to the village of Vārāṇasī and explained the Sutra of the Four Buddha-Seats in detail here.",
        "source": "T24n1448_008:0035c06_0"
    },
    {
        "source_sentence": "復至聚落名曰勝土，於此復說《四佛座經》。",
        "translation": "Again, he went to a village named Vaiśeṣika and preached the Sutra of the Four Seats of the Buddha.",
        "source": "T24n1448_008:0035c07_1"
    },
    {
        "source_sentence": "復至師子聚落，廣說《四佛座經》。",
        "translation": "Again, he went to the village of Siṃhala and extensively taught the Sutra on the Seat of the Four Buddhas.",
        "source": "T24n1448_008:0035c08_0"
    },
    {
        "source_sentence": "復至新聚落，復廣說《四佛座經》。",
        "translation": "He returned to his new village and extensively taught the Sutra of the Four Seats of the Buddha.",
        "source": "T24n1448_008:0035c08_1"
    },
    {
        "source_sentence": "世尊至城，於其城中又說《四佛座經》。",
        "translation": "When the World-honored One arrived at the city, he preached the Sutra of the Four Seats of the Buddha.",
        "source": "T24n1448_008:0035c09_2"
    },
    {
        "source_sentence": "世尊至王舍城，時有二梵志：一名為座、二名高座。",
        "translation": "When the Bhagavān arrived in Rājagṛha, there were two priests: one was a seat and two were called high seats.",
        "source": "T24n1448_008:0035c10_3"
    },
    {
        "source_sentence": "彼二梵志住於摩揭陀池邊，夜分即以釣魚食之。",
        "translation": "Those two priests were staying at the edge of Magadha's pond, and in the evening they ate them with fish.",
        "source": "T24n1448_008:0035c11_4"
    },
    {
        "source_sentence": "「能行正法，　　名為苾芻，　　捨離諸事，",
        "translation": "Those who practice the right teaching are called bhikṣus, Forsaking all things.",
        "source": "T24n1448_008:0035c12_5"
    },
    {
        "source_sentence": "若於晨朝，坐重敷座，常誦伽他曰：　此為禪路。」",
        "translation": "If he sits on a heavy seat in the morning, he always recites the verse that says, This is the path of meditation.",
        "source": "T24n1448_008:0035c12_5"
    },
    {
        "source_sentence": "「汝所說頌，　　應如是證；　　觀汝似善，",
        "translation": "You should thus actualize the verse you uttered, observing that you appear to be good,",
        "source": "T24n1448_008:0035c16_0"
    },
    {
        "source_sentence": "　心懷不淨。　　寂靜調伏，　　勿害眾生；",
        "translation": "Their minds are impure; Be still and subdued, And do not harm sentient beings.",
        "source": "T24n1448_008:0035c16_0"
    },
    {
        "source_sentence": "　捨離諸惡，　　此為禪路。　　若身口意，",
        "translation": "Forsaking evil is the path of meditation.",
        "source": "T24n1448_008:0035c16_0"
    },
    {
        "source_sentence": "　不作諸惡；　　調伏自己，　　此為禪路。」",
        "translation": "Not doing evil and taming yourself is the path of meditation.",
        "source": "T24n1448_008:0035c16_0"
    },
    {
        "source_sentence": "爾時世尊知彼梵志調伏時至，即往其所，說伽他曰：時二梵志聞世尊說頌，",
        "translation": "At that time the World-honored One, knowing that the time for subjugating the brahmin was approaching, went to him and said:",
        "source": "T24n1448_008:0035c16_0"
    },
    {
        "source_sentence": "作是念云：「今喬答摩善知我心。」",
        "translation": "He had this thought, Now, Gautama knows my mind well.",
        "source": "T24n1448_008:0035c22_1"
    },
    {
        "source_sentence": "即便恭敬。",
        "translation": "He even paid respect to them.",
        "source": "T24n1448_008:0035c23_2"
    },
    {
        "source_sentence": "世尊觀彼根性，稱機為說四真諦理。",
        "translation": "The Bhagavān observes the nature of those faculties and praises their abilities to explain the principle of the four true truths.",
        "source": "T24n1448_008:0035c23_3"
    },
    {
        "source_sentence": "時彼梵志無始已來積集煩惱諸邪見山，以智慧金剛杵而摧壞之，證預流果。",
        "translation": "That priest then accumulated the mountains of afflictions and mistaken views since beginningless time, destroyed them with the adamantine vajra of wisdom, and realized the fruit of stream-winner.",
        "source": "T24n1448_008:0035c24_4"
    },
    {
        "source_sentence": "後時諸苾芻見彼梵志重安座具，得預流果，皆悉效之。",
        "translation": "Later, when the monks saw that priest heavily placed his seat mat, they all succeeded in attaining the fruit of stream-winner.",
        "source": "T24n1448_008:0035c26_5"
    },
    {
        "source_sentence": "有一苾芻，在世尊前，重座聽法，而彼苾芻應見諦理，翻不得見。",
        "translation": "There was a monk who was seated in front of the Bhagavān to listen to the teaching, but that monk should see the truth and not see it.",
        "source": "T24n1448_008:0035c27_6"
    },
    {
        "source_sentence": "于時世尊觀彼苾芻合見諦理，云何不見？",
        "translation": "The Bhagavān then observed that monk's combined view of the truth, so why didn't he see it?",
        "source": "T24n1448_008:0035c28_7"
    },
    {
        "source_sentence": "乃知為重座不敬世尊故。",
        "translation": "He then knew that it was because he didn't respect the Bhagavān for his heavy seat.",
        "source": "T24n1448_008:0035c29_8"
    },
    {
        "source_sentence": "世尊念云：「應令諸苾芻，不得重座而坐，多過失故。」",
        "translation": "The Bhagavān thought, You should cause the monks not to sit on a heavy seat because there are so many faults.",
        "source": "T24n1448_008:0036a01_9"
    },
    {
        "source_sentence": "因誡諸苾芻並不應爾。",
        "translation": "That's why he admonished the monks not to do so.",
        "source": "T24n1448_008:0036a02_10"
    },
    {
        "source_sentence": "爾時世尊從王舍城出，至多根樹村，著衣持鉢入村乞食。",
        "translation": "It was then that the Bhagavān left Rājagṛha and went to a village with many roots of trees, put on his robe and bowl, and entered the village to solicit alms.",
        "source": "T24n1448_008:0036a03_11"
    },
    {
        "source_sentence": "劫比羅城中有一女人，在彼村中為婦。",
        "translation": "In Kapilavastu, there was a woman who became a wife in that village.",
        "source": "T24n1448_008:0036a04_12"
    },
    {
        "source_sentence": "時彼女人，見世尊三十二相、八十種好莊嚴其身，圓光一尋繞旋於頂，",
        "translation": "The woman then saw the Bhagavān adorned with the thirty-two marks and eighty kinds of beautiful embellishments on his body, circling around him in a circular radiance.",
        "source": "T24n1448_008:0036a05_13"
    },
    {
        "source_sentence": "如百千日光輝赫奕，猶如寶山。",
        "translation": "It's like a hundred thousand suns shining brightly and brilliantly like a jeweled mountain.",
        "source": "T24n1448_008:0036a06_14"
    },
    {
        "source_sentence": "彼女見已，便作是念：「今此世尊，諸釋種中其為慶喜，於輪王族，捨諸婇女財物庫藏，",
        "translation": "Seeing this, the woman thought: “O Bhagavat! Among the Śākya clanspeople, for the sake of rejoicing I have abandoned the treasury of women’s property to the Cakravartin.",
        "source": "T24n1448_008:0036a07_15"
    },
    {
        "source_sentence": "出家為道。",
        "translation": "Being a renunciant is the path.",
        "source": "T24n1448_008:0036a09_16"
    },
    {
        "source_sentence": "今乃乞食為活，於我乞麨，我當奉施。」",
        "translation": "Now that you're begging for food as your livelihood, I'll give it to you when you beg for my food.",
        "source": "T24n1448_008:0036a09_17"
    },
    {
        "source_sentence": "時世尊知彼心念，持鉢近前就彼而乞，告女人曰：「姊妹！",
        "translation": "Knowing what they thought, the Bhagavān approached them with his bowl and begged for it, telling the woman, Sister!",
        "source": "T24n1448_008:0036a10_18"
    },
    {
        "source_sentence": "汝可捨食滿鉢與我。」",
        "translation": "You may abandon food and give it to me with a full bowl.",
        "source": "T24n1448_008:0036a11_19"
    },
    {
        "source_sentence": "時彼女人見世尊知我心念，倍生恭敬，便施佛麨。",
        "translation": "Seeing that the Bhagavān knew my thoughts, the woman doubled her respect and offered a bowl of rice to the Buddha.",
        "source": "T24n1448_008:0036a12_20"
    },
    {
        "source_sentence": "爾時世尊受已，因即微笑。",
        "translation": "After accepting it, the Bhagavān then smiled.",
        "source": "T24n1448_008:0036a13_21"
    },
    {
        "source_sentence": "諸佛常法，若有微笑，即放青黃赤白種種之光從口而出，其光或上或下。",
        "translation": "The buddhas always teach that if someone smiles, they radiate blue, yellow, red, and white various kinds of light coming out of their mouths, which may be higher or lower.",
        "source": "T24n1448_008:0036a14_22"
    },
    {
        "source_sentence": "下者救地獄苦，等活、黑繩、眾合、大叫、小炎熱、極熱、阿鼻地獄等，",
        "translation": "The lower one saves from the suffering of hell, which is like life, black rope, assembly, screaming, lesser fever, extreme fever, and avīci hell.",
        "source": "T24n1448_008:0036a15_23"
    },
    {
        "source_sentence": "及八寒地獄：有疱地獄、阿吒訶、吒訶婆、呼婆呼、白蓮、青蓮、大蓮花等地獄。",
        "translation": "and the eight cold hells: there are blisters, aṭaha, ṭahāva, hopaho, white lotus, blue lotus, great lotus, and other hells.",
        "source": "T24n1448_008:0036a17_24"
    },
    {
        "source_sentence": "其熱地獄遇此光者皆得清涼，寒地獄者遇佛光明皆溫煖，此等眾生所有苦惱皆蒙捨息。",
        "translation": "Those in the hot hells who see this light will all attain clarity and coolness, those in the cold hells who see the Buddha's light will all become warm and warm, and all of these sentient beings' suffering and distress will be relieved.",
        "source": "T24n1448_008:0036a19_0"
    },
    {
        "source_sentence": "免其苦已，咸作是念：「我等於此捨命，生餘處耶？」",
        "translation": "After they were freed from their suffering, they all thought, Will we abandon our lives here and be born elsewhere?",
        "source": "T24n1448_008:0036a21_1"
    },
    {
        "source_sentence": "爾時世尊愍彼有情故，遣一化身往地獄中，彼等有情見佛化身，咸作是念：「我等不從此滅，",
        "translation": "At that time, out of pity for those sentient beings, the World-honored One sent one magical creation body to hell. Those sentient beings saw the Buddha’s magical body and thought:",
        "source": "T24n1448_008:0036a22_2"
    },
    {
        "source_sentence": "於餘處生。",
        "translation": "It's produced elsewhere.",
        "source": "T24n1448_008:0036a24_3"
    },
    {
        "source_sentence": "由佛威力故，令我等輩息諸苦惱。」",
        "translation": "It's because of the Buddha's authoritative power that we stopped suffering and distress.",
        "source": "T24n1448_008:0036a24_4"
    },
    {
        "source_sentence": "皆發信心，苦業都盡。",
        "translation": "They all give rise to faith, and their painful actions are all ended.",
        "source": "T24n1448_008:0036a25_5"
    },
    {
        "source_sentence": "從地獄滅，於人天界受生；",
        "translation": "After emerging from the hells, they are reborn among humans and gods.",
        "source": "T24n1448_008:0036a25_6"
    },
    {
        "source_sentence": "生人天已，後當遇佛，便證聖果。",
        "translation": "After he's born in humans and gods, he'll later meet the Buddha and realize the noble fruit.",
        "source": "T24n1448_008:0036a26_7"
    },
    {
        "source_sentence": "爾時光至上方者，其光普遍四天王天、三十三天、覩史多天、化樂天、他化自在天、梵摩天、梵輔天、大梵天、少光天、無量光天、極光淨，",
        "translation": "“The light reaches upward”: The light extends to the four heavenly kings, the thirty-three gods, the Tuṣita gods, the Nirmāṇarati gods, the Nirmāṇarati gods, the Paranirmitavaśavartin gods, the Brahma gods, the Brahmaputra gods, the Mahābrahmā",
        "source": "T24n1448_008:0036a27_8"
    },
    {
        "source_sentence": "乃至無色界四天。",
        "translation": "It goes so far as to the four heavens of the formless realm.",
        "source": "T24n1448_008:0036b01_9"
    },
    {
        "source_sentence": "「汝當求出離，　　於佛教勤修；",
        "translation": "You should seek emancipation And diligently practice Buddhism.",
        "source": "T24n1448_008:0036b01_10"
    },
    {
        "source_sentence": "　降伏生死軍，　　如象摧草舍。",
        "translation": "He subdues the armies of birth and death like an elephant destroying a hayloft.",
        "source": "T24n1448_008:0036b01_10"
    },
    {
        "source_sentence": "　於此法律中，　　常為不放逸；",
        "translation": "In this doctrine, they are always uninvolved.",
        "source": "T24n1448_008:0036b01_10"
    },
    {
        "source_sentence": "　能竭煩惱海，　　當盡苦邊際。」",
        "translation": "If you can stop the ocean of afflictions, you'll end the limits of suffering.",
        "source": "T24n1448_008:0036b01_10"
    },
    {
        "source_sentence": "光所至諸處天，皆悉唱言無常苦空，說二伽他曰：其光普遍三千大千世界已，",
        "translation": "The gods wherever Ābhāsvara went said, “Impermanent is the emptiness of suffering and impermanence.",
        "source": "T24n1448_008:0036b01_10"
    },
    {
        "source_sentence": "漸復收卷，隨世尊行。",
        "translation": "He gradually collected the scrolls again and again, following the Bhagavān's example.",
        "source": "T24n1448_008:0036b07_11"
    },
    {
        "source_sentence": "若佛世尊，欲記過去事，光從前沒；",
        "translation": "If the Buddha, the World-honored One, wished to record events of the past, his light would disappear from before.",
        "source": "T24n1448_008:0036b08_12"
    },
    {
        "source_sentence": "欲記未來事，光從後沒；",
        "translation": "They wish to record future events, but the light disappears from them afterward.",
        "source": "T24n1448_008:0036b08_13"
    },
    {
        "source_sentence": "若記地獄事，光從脚下沒；",
        "translation": "If one remembers the deeds of hell, the light disappears beneath his feet.",
        "source": "T24n1448_008:0036b09_14"
    },
    {
        "source_sentence": "若記傍生事，光從踵沒；",
        "translation": "If one remembers the events of animals, light disappears from their heels.",
        "source": "T24n1448_008:0036b10_0"
    },
    {
        "source_sentence": "若記餓鬼事，光從趺沒；",
        "translation": "If one remembers the deeds of hungry ghosts, his light disappears from the sky.",
        "source": "T24n1448_008:0036b10_1"
    },
    {
        "source_sentence": "若記人間事，光從膝沒；",
        "translation": "If he remembers the affairs of the people, his light disappears from his knees.",
        "source": "T24n1448_008:0036b11_2"
    },
    {
        "source_sentence": "若記力輪王事，光從左掌沒；",
        "translation": "If he remembers the deeds of the wheel-turning king, his light disappears from his left palm.",
        "source": "T24n1448_008:0036b11_3"
    },
    {
        "source_sentence": "若記轉輪王事，光從右掌沒；",
        "translation": "If he remembers the deeds of a universal ruler, his light disappears from his right palm.",
        "source": "T24n1448_008:0036b12_4"
    },
    {
        "source_sentence": "若記生天事，光從臍沒；",
        "translation": "If one remembers the deed of rebirth in heaven, the light disappears from his navel.",
        "source": "T24n1448_008:0036b12_5"
    },
    {
        "source_sentence": "若記聲聞菩提事，光從口中沒；",
        "translation": "If they remember the deeds of enlightenment of the hearers, their light disappears from their mouths.",
        "source": "T24n1448_008:0036b13_6"
    },
    {
        "source_sentence": "若記緣覺菩提事，光從眉間沒；",
        "translation": "If one remembers the deeds of enlightenment of pratyekabuddhas, the light disappears from between his eyebrows.",
        "source": "T24n1448_008:0036b14_7"
    },
    {
        "source_sentence": "若記無上正等覺事，光從頂沒。",
        "translation": "If you record the phenomenon of unsurpassed perfect enlightenment, the light disappears from the top of your head.",
        "source": "T24n1448_008:0036b14_8"
    },
    {
        "source_sentence": "于時佛光遶世尊三匝，從眉間沒。",
        "translation": "The Buddha's light then circled the Bhagavān three times and disappeared from between his eyebrows.",
        "source": "T24n1448_008:0036b15_9"
    },
    {
        "source_sentence": "時具壽阿難陀合掌白佛言：「世尊！",
        "translation": "Kauṣṭhila Ānanda then joined his palms and said to the Buddha, Bhagavān!",
        "source": "T24n1448_008:0036b16_10"
    },
    {
        "source_sentence": "如來、應、正等覺，熙怡微笑，非無因緣。」",
        "translation": "The Tathāgata, Arhat, and Completely Awakened One smiled joyfully, not without a reason.",
        "source": "T24n1448_008:0036b17_11"
    },
    {
        "source_sentence": "即說伽他而請佛曰(其伽他如餘)。",
        "translation": "He then explained the verse and invited the Buddha, saying, The verse is as elsewhere.",
        "source": "T24n1448_008:0036b17_12"
    },
    {
        "source_sentence": "爾時世尊告阿難陀曰：「如是，如是！",
        "translation": "It was then that the Bhagavān addressed Ānanda, So it is, so it is!",
        "source": "T24n1448_008:0036b19_0"
    },
    {
        "source_sentence": "阿難，非無因緣如來、應、正等覺輒見微笑。",
        "translation": "Ānanda, it is not that the Tathāgata, Arhat, and Completely Awakened One did not smile when they saw him for no reason.",
        "source": "T24n1448_008:0036b19_1"
    },
    {
        "source_sentence": "汝見彼婆羅門女，以信心施我麨不？」",
        "translation": "Do you see that Brāhmaṇa woman giving me food with faith?",
        "source": "T24n1448_008:0036b20_2"
    },
    {
        "source_sentence": "阿難陀答言：「已見。」",
        "translation": "Ānanda replied, I've seen it.",
        "source": "T24n1448_008:0036b21_3"
    },
    {
        "source_sentence": "佛言：「彼女以此善根，從今已往，於十三劫，不墮惡趣；",
        "translation": "The Buddha said: Because of these roots of goodness, that woman will not fall into evil for thirteen kalpas from now until the future.",
        "source": "T24n1448_008:0036b22_4"
    },
    {
        "source_sentence": "在天人中，輪迴受生，於最後身，證獨覺果，號為善願，其聲普遍。」",
        "translation": "Among gods and humans, they are born in a cycle of rebirth, realize the fruit of pratyekabuddhahood in their final body, and call it good vow whose sound is universal.",
        "source": "T24n1448_008:0036b23_5"
    },
    {
        "source_sentence": "其婆羅門女由生信心，將麨奉如來故，世尊為彼女人授記當來成獨覺菩提。",
        "translation": "Because that Brāhmaṇa woman's faith gave rise to the intention to venerate the Tathāgata, the Bhagavān predicted for her future enlightenment as a solitary realizer.",
        "source": "T24n1448_008:0036b24_6"
    },
    {
        "source_sentence": "其女夫主為採花薪等往林野中，聞我妻施沙門喬答摩麨，得授記成辟支佛。",
        "translation": "That woman's husband went to the forest and fields to gather flowers, firewood, and so forth, and he heard that my wife gave her to the ascetic Gautama and was given assurance of becoming a pratyekabuddha.",
        "source": "T24n1448_008:0036b26_7"
    },
    {
        "source_sentence": "聞已便生忿怒，即詣世尊，作如是言：「汝來向我家中不？」",
        "translation": "After hearing this, he became angry and went to the Bhagavān and said, Have you come to my house?",
        "source": "T24n1448_008:0036b28_8"
    },
    {
        "source_sentence": "世尊報言：「實來。」",
        "translation": "The Bhagavān replied, Really come.",
        "source": "T24n1448_008:0036b29_9"
    },
    {
        "source_sentence": "又言：「我妻施麨，汝為授記作辟支佛不？」",
        "translation": "Again, he said, My wife gave me a bowl of rice for you to give as a pratyekabuddha?",
        "source": "T24n1448_008:0036b29_10"
    },
    {
        "source_sentence": "佛言：「婆羅門，實爾。」",
        "translation": "The Buddha said, Brāhmaṇa, that's true.",
        "source": "T24n1448_008:0036c01_11"
    },
    {
        "source_sentence": "「汝喬答摩！",
        "translation": "You, Gautama!",
        "source": "T24n1448_008:0036c02_12"
    },
    {
        "source_sentence": "從轉輪王種族，捨王位出家，為乞麨故，作大妄語，誰肯信汝以少種子獲大果報？」",
        "translation": "From the caste of the wheel-turning king, who renounced the king's position and left home in order to beg for alms and spoke great falsehoods, who would believe that you were able to obtain great rewards with few seeds?",
        "source": "T24n1448_008:0036c02_13"
    },
    {
        "source_sentence": "佛言：「婆羅門！",
        "translation": "The Buddha said, Brāhmaṇa!",
        "source": "T24n1448_008:0036c04_14"
    },
    {
        "source_sentence": "由是因緣，我今問汝，當隨意說。",
        "translation": "Because of these causes and conditions, I'll now ask you a question, which will be explained as you wish.",
        "source": "T24n1448_008:0036c04_15"
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "O brāhmaṇa!",
        "source": "T24n1448_008:0036c05_16"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T24n1448_008:0036c05_17"
    },
    {
        "source_sentence": "汝見希有法不？」",
        "translation": "Do you see rare dharmas?",
        "source": "T24n1448_008:0036c05_18"
    },
    {
        "source_sentence": "答言：「喬答摩！",
        "translation": "He replied, Gautama!",
        "source": "T24n1448_008:0036c06_19"
    },
    {
        "source_sentence": "且止餘希有法。",
        "translation": "It's just to stop the other rare dharmas.",
        "source": "T24n1448_008:0036c06_20"
    },
    {
        "source_sentence": "我所於此多根樹聚落，見希有事，汝可且聽。",
        "translation": "Here in a village with many roots and trees where I see rare things, you may listen.",
        "source": "T24n1448_008:0036c06_21"
    },
    {
        "source_sentence": "喬答摩！",
        "translation": "Gautama!",
        "source": "T24n1448_008:0036c07_22"
    },
    {
        "source_sentence": "於此聚落東，拏瞿陀樹廣大滋茂，於彼樹下每有五百乘車止住亦無相妨礙。",
        "translation": "To the east of this village, there was a large and luxuriant tree called anguḍa. Under that tree five hundred carriages always stopped and stayed without obstructing each other.",
        "source": "T24n1448_008:0036c08_0"
    },
    {
        "source_sentence": "由此樹故，聚落得名。」",
        "translation": "Because of this tree, the village gets its name.",
        "source": "T24n1448_008:0036c09_1"
    },
    {
        "source_sentence": "佛言：「婆羅門！",
        "translation": "The Buddha said, Brāhmaṇa!",
        "source": "T24n1448_008:0036c10_2"
    },
    {
        "source_sentence": "彼多根樹，子大幾許？",
        "translation": "How many seeds does this tree with many roots have?",
        "source": "T24n1448_008:0036c10_3"
    },
    {
        "source_sentence": "為當如稻畦大，不得共篣籬、碾輪車、牛篋、篣箕、頻螺果、劫畢他果耶？」",
        "translation": "Why wouldn't it be like a rice bed that's as large as a hedge, a cartwheel-turning ox, a cowherd, a duvet bag, a conch fruit, a blistering fruit, or a fruit of the kalpa?",
        "source": "T24n1448_008:0036c11_4"
    },
    {
        "source_sentence": "答言：「不也。",
        "translation": "He replied, No.",
        "source": "T24n1448_008:0036c12_5"
    },
    {
        "source_sentence": "猶如芥子四分之一。」",
        "translation": "It's like the fourth part of a mustard seed.",
        "source": "T24n1448_008:0036c12_6"
    },
    {
        "source_sentence": "佛言：「婆羅門！",
        "translation": "The Buddha said, Brāhmaṇa!",
        "source": "T24n1448_008:0036c13_7"
    },
    {
        "source_sentence": "誰當信汝此之小子能生大樹？」",
        "translation": "Who will believe that this little boy of yours can give rise to a large tree?",
        "source": "T24n1448_008:0036c13_8"
    },
    {
        "source_sentence": "時婆羅門答世尊曰：「任汝信不？",
        "translation": "The Brāhmaṇa then answered the Bhagavān, Do you believe it?",
        "source": "T24n1448_008:0036c14_9"
    },
    {
        "source_sentence": "我自親見。",
        "translation": "I'll see it myself.",
        "source": "T24n1448_008:0036c15_10"
    },
    {
        "source_sentence": "然且彼地，不被傷損，沃潤甜土；",
        "translation": "The land will not be damaged, however, and the soil will be rich and sweet.",
        "source": "T24n1448_008:0036c15_11"
    },
    {
        "source_sentence": "子雖不大，如法安置，依時得雨，是故此樹生長成大。」",
        "translation": "Although the child isn't large, it's placed according to the rules and receives rain at the right time; therefore, this tree grows into a large one.",
        "source": "T24n1448_008:0036c16_12"
    },
    {
        "source_sentence": "「如田及種子，　　汝今親已見；",
        "translation": "Like fields and seeds, you have now seen them.",
        "source": "T24n1448_008:0036c17_13"
    },
    {
        "source_sentence": "　於業及果報，　　如來親自證。",
        "translation": "The Tathāgata himself has realized the results of actions and consequences.",
        "source": "T24n1448_008:0036c17_13"
    },
    {
        "source_sentence": "　如汝之所見，　　小子成大樹；",
        "translation": "As you have seen, the small child grows into a big tree.",
        "source": "T24n1448_008:0036c17_13"
    },
    {
        "source_sentence": "　如是我見此，　　小因成大果。」",
        "translation": "Thus, I see this as a lesser cause that creates a greater result.",
        "source": "T24n1448_008:0036c17_13"
    },
    {
        "source_sentence": "爾時世尊以此因緣說伽他曰：爾時世尊從其面門出廣長舌，遍至髮際，",
        "translation": "It was then that the World-honored One spoke these words to the Buddha: At that moment, the World-honored One emanated from the [bodhisattva’s] face a long, wide tongue extending as far as the space between his eyes.",
        "source": "T24n1448_008:0036c17_13"
    },
    {
        "source_sentence": "告婆羅門曰：「汝意云何？",
        "translation": "He told the Brāhmaṇa, What do you think?",
        "source": "T24n1448_008:0036c22_14"
    },
    {
        "source_sentence": "若能出舌遍覆面者，然彼豈為百千轉輪王位故作妄語？」",
        "translation": "If someone can produce a tongue that covers their face, then wouldn't they say falsely because of the position of a hundred thousand wheel-turning kings?",
        "source": "T24n1448_008:0036c23_15"
    },
    {
        "source_sentence": "婆羅門答言：「不也。",
        "translation": "The Brāhmaṇa replied, No.",
        "source": "T24n1448_008:0036c24_16"
    },
    {
        "source_sentence": "喬答摩！」",
        "translation": "Gautama!",
        "source": "T24n1448_008:0036c25_17"
    },
    {
        "source_sentence": "「我自未曾說妄語，　　舌相皆由誠實增；",
        "translation": "I myself have never uttered falsehood, Yet the characteristics of my tongue are all due to sincerity.",
        "source": "T24n1448_008:0036c25_18"
    },
    {
        "source_sentence": "　汝今宜應如是言，　　幸遇如來蒙覺悟。」",
        "translation": "Now, it's appropriate for you to say so, fortunately encountering the Tathāgata and awakening him.",
        "source": "T24n1448_008:0036c25_18"
    },
    {
        "source_sentence": "爾時世尊說伽他曰：爾時婆羅門既聞是已，生信敬心。",
        "translation": "It was then that the Bhagavān addressed Kāta, After hearing this, the Brāhmaṇa gave rise to faith and respect.",
        "source": "T24n1448_008:0036c25_18"
    },
    {
        "source_sentence": "世尊知彼意樂隨眠，應機為說四聖諦法，廣說如前，無始積集薩迦耶見，",
        "translation": "The World-honored One, knowing the latent tendencies of their inclinations, spoke appropriately and appropriately for them the teachings of the four noble truths. He explained in detail as before:",
        "source": "T24n1448_008:0036c28_19"
    },
    {
        "source_sentence": "以智慧杵而摧破之，現證初果，唱言：「我入預流，我今盡壽歸依佛法僧寶，",
        "translation": "Having destroyed them with the pounder of wisdom, he manifested the first realization. He said, “I entered the stream and now for the rest of my life take refuge in the treasures of buddhahood, doctrine, and Sangha.",
        "source": "T24n1448_008:0037a01_20"
    },
    {
        "source_sentence": "受五學處，為鄔波索迦，願世尊證知。」",
        "translation": "Accepting the five places of training is called upāsaka, so may the Bhagavān realize it.",
        "source": "T24n1448_008:0037a03_21"
    },
    {
        "source_sentence": "時婆羅門聞佛說已，歡喜信受，禮佛而去。",
        "translation": "Having heard the Buddha’s discourse, the brāhmaṇa was delighted and believed it. After venerating the Buddha, he departed.",
        "source": "T24n1448_008:0037a04_22"
    },
    {
        "source_sentence": "爾時世尊到重毘羅聚落林中而住，此經廣說，如《雜阿笈摩》。",
        "translation": "The Bhagavān then went to the forest in the village of Chongpiluo and stayed there, and this sūtra explains it extensively as explained in the Miscellaneous Abhidharma.",
        "source": "T24n1448_008:0037a06_0"
    },
    {
        "source_sentence": "世尊至一邊地聚落，彼有具壽摩訶目乾連舅，於仙人中出家學道，具壽目連而能調伏。",
        "translation": "Bhagavān went to a village on one side of the ground, where there was Kauśāmbī Mahāmaudgalyāyana's uncle, who left home among sages and studied the path, and Kauśāmbī Mahāmaudgalyāyana was able to subdue him.",
        "source": "T24n1448_008:0037a07_1"
    },
    {
        "source_sentence": "爾時世尊告目連曰：「汝當愍念汝舅。」",
        "translation": "It was then that the Bhagavān addressed Maudgalyāyana, You must take pity on your uncle.",
        "source": "T24n1448_008:0037a09_2"
    },
    {
        "source_sentence": "目連白言：「唯然世尊。」",
        "translation": "Maudgalyāyana said, Yes, Bhagavān.",
        "source": "T24n1448_008:0037a10_3"
    },
    {
        "source_sentence": "爾時目連聞佛語已，知調伏時至，即往仙人所住之處。",
        "translation": "After hearing the Buddha's words, Maudgalyāyana knew that the time had come to subdue him and went to where the sage was staying.",
        "source": "T24n1448_008:0037a10_4"
    },
    {
        "source_sentence": "時有仙人告目連曰：「且止莫入，此是婆羅門修道之處。」",
        "translation": "A sage then told Maudgalyāyana, Please stop and don't enter; this is the place where the Brāhmaṇa cultivates his path.",
        "source": "T24n1448_008:0037a11_5"
    },
    {
        "source_sentence": "答言：「我亦是婆羅門。」",
        "translation": "He replied, I'm also a brāhmaṇa.",
        "source": "T24n1448_008:0037a13_6"
    },
    {
        "source_sentence": "「身上無梵線，　　不持祭祀杓；",
        "translation": "On his body there is no religious thread, And he does not carry an almsbowl.",
        "source": "T24n1448_008:0037a13_7"
    },
    {
        "source_sentence": "　禿頭非事火，　　妄說婆羅門。」",
        "translation": "A bald-headed man doesn't serve fire, and he speaks falsely as a brāhmaṇa.",
        "source": "T24n1448_008:0037a13_7"
    },
    {
        "source_sentence": "「慚恥為梵線，　　正惠具祭杓；",
        "translation": "Ashamed of his shame, he offered a ladle for the sake of the religious thread and Right Teaching.",
        "source": "T24n1448_008:0037a13_7"
    },
    {
        "source_sentence": "　常持淨戒水，　　清淨作君持。",
        "translation": "He always observes the water of pure precepts, purely maintaining them as his ruler.",
        "source": "T24n1448_008:0037a13_7"
    },
    {
        "source_sentence": "　實語為然火，　　內心恒寂定；",
        "translation": "True words are like fire, Always remaining still and concentrated in mind.",
        "source": "T24n1448_008:0037a13_7"
    },
    {
        "source_sentence": "　鎮修調伏行，　　斯真事火然。」",
        "translation": "To calmly cultivate the practice of discipline, this is really a fire of service.",
        "source": "T24n1448_008:0037a13_7"
    },
    {
        "source_sentence": "時彼仙人說伽他曰：時大目連亦以伽他答仙人曰：時彼仙人語目連曰：「縱令如此，",
        "translation": "Mahāmaudgalyāyana also replied to the holy man with these verses: The holy man then said to Maudgalyāyana, “Even if it were so,",
        "source": "T24n1448_008:0037a13_7"
    },
    {
        "source_sentence": "亦不容汝禿頭沙門入我住處。」",
        "translation": "Nor can you, bald-headed ascetic, enter my dwelling place.",
        "source": "T24n1448_008:0037a22_8"
    },
    {
        "source_sentence": "于時尊者大目乾連，即以神力起大風雨，往詣池側坐一樹下。",
        "translation": "Venerable Mahāmaudgalyāyana then, using his supernormal powers, raised a great wind and rain and went to sit under a tree by the side of the pond.",
        "source": "T24n1448_008:0037a23_9"
    },
    {
        "source_sentence": "時難陀、鄔波難陀龍王侍者住此池中，而作是念：「聖者大目乾連常為難陀、鄔波難陀龍王之所敬重。",
        "translation": "The attendants of the dragon kings Nanda and Upananda then stayed in this pond and thought, The sage Mahāmaudgalyāyana is always respected by the dragon kings Nanda and Upananda.",
        "source": "T24n1448_008:0037a24_10"
    },
    {
        "source_sentence": "然我於彼亦應供養。」",
        "translation": "Still, I should also make offerings to them.",
        "source": "T24n1448_008:0037a27_11"
    },
    {
        "source_sentence": "時龍侍者從本宮出，至目連所，以身七重，右遶尊者，後以其首，覆目連頭而住。",
        "translation": "The dragon attendants then emerged from their original palace and went to where Maudgalyāyana was staying, circled the Venerable on his right seven times with their bodies, covered his head with maudgalyāyana's hair, and stood there.",
        "source": "T24n1448_008:0037a27_12"
    },
    {
        "source_sentence": "仙人常法，若見眾生苦切逼身，不生救念即退仙道。",
        "translation": "It's always the sage's dharma, and if he sees sentient beings suffering painfully oppressed by their bodies, he doesn't give rise to thoughts of salvation, which means he regresses from the sage path.",
        "source": "T24n1448_008:0037a29_13"
    },
    {
        "source_sentence": "時舊仙人便作是念：「若出家人遭此大雨，便即捨命，我當失其仙道。」",
        "translation": "The old sage then had this thought, If a renunciant is exposed to this great rain, he'll immediately give up his life, and I'll lose the path of that sage.",
        "source": "T24n1448_008:0037b01_14"
    },
    {
        "source_sentence": "生此念已，便從仙人住處而出，覓出家人。",
        "translation": "When he had this thought, he left the place where the sage lived and looked for a renunciant.",
        "source": "T24n1448_008:0037b03_0"
    },
    {
        "source_sentence": "見目連被龍重繞七匝，復以其首覆目連頭，告言：「汝可入此菴中。」",
        "translation": "Seeing Maudgalyāyana wrapped around the dragon seven times, he again covered Maudgalyāyana's head with his head and told him, You may enter this cave.",
        "source": "T24n1448_008:0037b03_1"
    },
    {
        "source_sentence": "目連答曰：「大仙！",
        "translation": "Maudgalyāyana answered, Great sage!",
        "source": "T24n1448_008:0037b05_2"
    },
    {
        "source_sentence": "汝已失其仙道。」",
        "translation": "You've lost your sage path.",
        "source": "T24n1448_008:0037b05_3"
    },
    {
        "source_sentence": "聞語聲已，知是外甥，仙人問曰：「聖者！",
        "translation": "After hearing the sound of his words, he knew that it was a nephew, and the sage asked, Sage!",
        "source": "T24n1448_008:0037b06_4"
    },
    {
        "source_sentence": "汝是目連？」",
        "translation": "Are you Maudgalyāyana?",
        "source": "T24n1448_008:0037b06_5"
    },
    {
        "source_sentence": "目連答曰：「時人號為目連。」",
        "translation": "Maudgalyāyana answered, The people then called him Maudgalyāyana.",
        "source": "T24n1448_008:0037b07_6"
    },
    {
        "source_sentence": "目連報曰：「仙人！",
        "translation": "Maudgalyāyana replied, Sage!",
        "source": "T24n1448_008:0037b07_7"
    },
    {
        "source_sentence": "緣何事來至此？」",
        "translation": "What is the reason for coming here?",
        "source": "T24n1448_008:0037b08_8"
    },
    {
        "source_sentence": "仙人答曰：「見汝苦切逼身，恐損害汝，所以故來。」",
        "translation": "The sage answered, Seeing you being tormented and oppressed, I'm afraid it will harm you; that's why I came.",
        "source": "T24n1448_008:0037b08_9"
    },
    {
        "source_sentence": "爾時具壽目連，即將仙人俱詣佛所，頭面禮足，退坐一面。",
        "translation": "It was then that Gosshou Maudgalyāyana went to the Buddha with his sages, bowed his head and feet, withdrew, and sat to one side.",
        "source": "T24n1448_008:0037b09_10"
    },
    {
        "source_sentence": "目連白佛言：「世尊！",
        "translation": "Mucilin said to the Buddha, Bhagavān!",
        "source": "T24n1448_008:0037b10_11"
    },
    {
        "source_sentence": "此是我舅，於仙道中出家。",
        "translation": "This is my uncle, who renounced the householder’s life in the holy path.",
        "source": "T24n1448_008:0037b11_12"
    },
    {
        "source_sentence": "唯願世尊，哀愍救護。」",
        "translation": "Please, Bhagavān, have mercy and rescue!",
        "source": "T24n1448_008:0037b11_13"
    },
    {
        "source_sentence": "世尊知彼仙人種性隨眠意樂，應機說法，仙人聞已，便證不還果。",
        "translation": "The Bhagavān knew that the sage's proclivities and intentions were latent, so he explained the teaching appropriately. After hearing it, the sage realized the fruit of nonreturning.",
        "source": "T24n1448_008:0037b12_14"
    },
    {
        "source_sentence": "爾時仙人從坐而起，偏袒右肩，合掌恭敬，頂禮白佛言：「唯願世尊攝受，",
        "translation": "The holy man then rose from his seat, bared his right shoulder, joined his palms in respect, bowed his head in homage, and said to the Buddha:",
        "source": "T24n1448_008:0037b13_15"
    },
    {
        "source_sentence": "聽我於善說法律中而為出家受其圓具，成苾芻性，於世尊所而修梵行。」",
        "translation": "Listen to me as a renunciant who well explains the teaching of the Dharma and receives its full set of precepts, becomes a monk, and cultivates the religious practice in the Bhagavān's presence.",
        "source": "T24n1448_008:0037b15_16"
    },
    {
        "source_sentence": "爾時世尊告彼仙人：「善來苾芻！」",
        "translation": "It was then that the Bhagavān addressed the sage, Well come, monk!",
        "source": "T24n1448_008:0037b17_17"
    },
    {
        "source_sentence": "作是言已，鬚髮自落，僧伽胝衣著身，威儀成就。",
        "translation": "After he said this, his hair fell off on its own, the saṃghâvaśeṣa robes touched his body, and his manner was perfect.",
        "source": "T24n1448_008:0037b17_18"
    },
    {
        "source_sentence": "時龍童子見目連去，獨住不安，時彼聚落遂遭亢旱。",
        "translation": "Seeing Maudgalyāyana's departure, the dragon boy was alone and unsettled, and then that village suffered from drought.",
        "source": "T24n1448_008:0037b18_19"
    },
    {
        "source_sentence": "其龍童子，化身為仙人，於彼仙人住處坐禪而住。",
        "translation": "The dragon boy transformed himself into a sage and stayed where the sage lived, sitting in meditation.",
        "source": "T24n1448_008:0037b20_0"
    },
    {
        "source_sentence": "于時聚落人眾，來詣化龍仙所，頂禮白言：「今此聚落，遭其亢旱，我等作何方計？」",
        "translation": "The villagers then came to the transformation dragon sage, bowed their heads and said, Now that this village has suffered from drought, where can we make a calculation?",
        "source": "T24n1448_008:0037b21_1"
    },
    {
        "source_sentence": "仙人報曰：「汝等可共來於此住，即得消災。」",
        "translation": "The sage replied, Come and stay here together, and you'll be able to remove the calamity.",
        "source": "T24n1448_008:0037b22_2"
    },
    {
        "source_sentence": "時諸聚落所有人眾，便來住彼。",
        "translation": "All the people in the villages then came and stayed there.",
        "source": "T24n1448_008:0037b23_3"
    },
    {
        "source_sentence": "由因龍子為大目連頂上持蓋。",
        "translation": "It's because the dragon prince causes the top of Mahāmaudgalyāyana's head to be a canopy.",
        "source": "T24n1448_008:0037b24_4"
    },
    {
        "source_sentence": "時人遂共號為龍持蓋城。",
        "translation": "The people then collectively called it the dragon-holding canopy city.",
        "source": "T24n1448_008:0037b25_5"
    },
    {
        "source_sentence": "於此城中，有信心鄔波索迦，龍持蓋處建立寺舍，具足資物。",
        "translation": "In this city, there was a faithful Upāsaka who built a temple and dwelling at the place where the dragon carried the canopy of enlightenment. He had all the necessary necessities.",
        "source": "T24n1448_008:0037b25_6"
    },
    {
        "source_sentence": "于時世尊又到摩都量城，相應住中，廣說其事。",
        "translation": "The Bhagavān then went back to the city of Mathu and stayed there, speaking extensively about it.",
        "source": "T24n1448_008:0037b27_7"
    },
    {
        "source_sentence": "爾時世尊於俱魯城，人間遊行至大倉聚落，於此廣說《護國蘇怛羅經》。",
        "translation": "At the time, the Bhagavān was traveling among the people in the city of Kauśinagara to a large storehouse and village, where he spoke extensively about the Sutra of the Socetic who Protects the Country.",
        "source": "T24n1448_008:0037b29_0"
    },
    {
        "source_sentence": "根本說一切有部毘奈耶藥事卷第八",
        "translation": "Mūlasarvâstivāda-sāhasvara-sūtra, vol. 8",
        "source": "T24n1448_008:0037c02_0"
    }
]