[
    {
        "source_sentence": "優婆塞五戒威儀經一卷",
        "translation": "Sutra of the Five Precepts for Upāsaka, One Fascicle",
        "source": "T24n1503_001:1116c09_0"
    },
    {
        "source_sentence": "宋罽賓三藏求那跋摩譯",
        "translation": "Song Dynasty Translation of the Tripiṭaka of Kāśmīra, translated by Goṇavarman",
        "source": "T24n1503_001:1116c11_0"
    },
    {
        "source_sentence": "　佛者眾聖尊，　　神通應自在，",
        "translation": "Buddha is the honored one among all sages, With supernormal powers and freedom of action.",
        "source": "T24n1503_001:1116c12_0"
    },
    {
        "source_sentence": "　隨類處身形，　　音聲亦復爾。",
        "translation": "Bodily forms and voices are the same as sound, According to their sphere of influence.",
        "source": "T24n1503_001:1116c13_0"
    },
    {
        "source_sentence": "　見聞獲安隱，　　莫不信向心，",
        "translation": "Seeing and hearing, they attain peace, None of them not believing and dedicating their minds.",
        "source": "T24n1503_001:1116c14_0"
    },
    {
        "source_sentence": "　是故我歸命，　　願普如世尊。",
        "translation": "For this reason I take refuge in the World-honored One, Vowing to be like him.",
        "source": "T24n1503_001:1116c15_0"
    },
    {
        "source_sentence": "　甚深菩薩戒，　　功德難思議，",
        "translation": "The profound enlightening being’s precepts Are of inconceivable virtue:",
        "source": "T24n1503_001:1116c16_0"
    },
    {
        "source_sentence": "　受者獲安隱，　　福慧日夜生。",
        "translation": "Those who receive it will attain peace, and their merits and wisdom will arise day and night.",
        "source": "T24n1503_001:1116c17_0"
    },
    {
        "source_sentence": "　諸佛常護念，　　萬行漸滿盈，",
        "translation": "The Buddhas always guard their thoughts, Gradually filling them with myriad practices.",
        "source": "T24n1503_001:1116c18_0"
    },
    {
        "source_sentence": "　六度四等意，　　普度諸群盲。",
        "translation": "The six perfections and four equal intentions save all the blind.",
        "source": "T24n1503_001:1116c19_0"
    },
    {
        "source_sentence": "　手足初莫犯，　　節言順所行，",
        "translation": "Don't violate it at the beginning with your hands and feet, speak in moderation according to what you're doing.",
        "source": "T24n1503_001:1116c20_0"
    },
    {
        "source_sentence": "　常樂在定意，　　是名真比丘。",
        "translation": "Being always happy in concentration is called a true monk.",
        "source": "T24n1503_001:1116c21_0"
    },
    {
        "source_sentence": "　質直離諂曲，　　常與賢聖俱，",
        "translation": "Their quality is straightforward, free of flattery and dishonesty, Always accompanied by the wise and holy.",
        "source": "T24n1503_001:1116c22_0"
    },
    {
        "source_sentence": "　愛眾猶養已，　　是名真菩薩。",
        "translation": "To love sentient beings and still nourish them is called a true bodhisattva.",
        "source": "T24n1503_001:1116c23_0"
    },
    {
        "source_sentence": "「諸大德！",
        "translation": "“O great virtuous ones!",
        "source": "T24n1503_001:1116c24_0"
    },
    {
        "source_sentence": "一心諦聽諦聽，善思念之。",
        "translation": "He listens with one mind and listens attentively, and he well considers and remembers it.",
        "source": "T24n1503_001:1116c24_1"
    },
    {
        "source_sentence": "我今欲說三世諸佛菩薩成就利益一切眾生功德戒。",
        "translation": "Now, I want to explain the merits of the buddhas and bodhisattvas of the three times who accomplish the precepts for the benefit of all sentient beings.",
        "source": "T24n1503_001:1116c24_2"
    },
    {
        "source_sentence": "如是住菩薩戒者，有四波羅夷法。",
        "translation": "Thus, someone who abides in the bodhisattva precepts has four grave offenses.",
        "source": "T24n1503_001:1116c26_3"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T24n1503_001:1116c26_4"
    },
    {
        "source_sentence": "若菩薩為利養故自讚毀他，是名菩薩波羅夷。",
        "translation": "If a bodhisattva praises himself and disparages others for profit, this is called a bodhisattva's pārājika.",
        "source": "T24n1503_001:1116c27_5"
    },
    {
        "source_sentence": "若菩薩多饒財物，貧苦之人來從乞索，菩薩慳貪無有慈心，乃至不施一錢之物，有求法者乃至不為說於一偈，是名菩薩波羅夷。",
        "translation": "If a bodhisattva has abundant possessions and a poor man comes to ask for them, and the bodhisattva is stingy and greedy with no compassion or even doesn't give a single coin of goods, or if there are people who seek the Dharma or don't speak a single verse for them, this is called a bodhisattva's pārājika.",
        "source": "T24n1503_001:1116c28_6"
    },
    {
        "source_sentence": "若菩薩瞋，於前人惡言罵辱，加以手打及以杖石意猶不息，前人求悔善言懺謝，菩薩猶瞋憤結不解，是名菩薩波羅夷。",
        "translation": "If a bodhisattva becomes angry, speaks harshly and abuses others, beats them with his hand or stone with a stick, and doesn't stop thinking so, and the person before him repents and apologizes in good words, and the bodhisattva remains angry and doesn't understand the bond of anger, this is called a bodhisattva's pārājika.",
        "source": "T24n1503_001:1117a02_7"
    },
    {
        "source_sentence": "若菩薩自謗菩薩法藏，若見人謗善可其言，既自不信反助他言，若心自解或從他受，是名菩薩波羅夷。",
        "translation": "If a bodhisattva denigrates the bodhisattva's store of the Dharma and sees someone who denigrates goodness in their words, then he doesn't believe it himself but instead helps others say it, and if his mind understands it for himself or receives it from others, this is called a bodhisattva's pārājika.",
        "source": "T24n1503_001:1117a04_8"
    },
    {
        "source_sentence": "如是菩薩四波羅夷，菩薩於中不應犯一，何況具犯！",
        "translation": "Thus, these are the four grave offenses for bodhisattvas, and bodhisattvas shouldn't violate one of them, so why would they violate all of them?",
        "source": "T24n1503_001:1117a07_9"
    },
    {
        "source_sentence": "若有犯者，不名菩薩。",
        "translation": "If someone violates it, they aren't called a bodhisattva.",
        "source": "T24n1503_001:1117a08_10"
    },
    {
        "source_sentence": "現身不能莊嚴菩提，亦復不能令心寂靜，是似菩薩非實菩薩。",
        "translation": "They can't adorn enlightenment in their present body, and they can't make their minds quiescent, which seems to be a bodhisattva but not a true bodhisattva.",
        "source": "T24n1503_001:1117a08_11"
    },
    {
        "source_sentence": "犯有三種：有軟、中、上。",
        "translation": "There are three kinds of offenses: minor, middling and excessive.",
        "source": "T24n1503_001:1117a10_12"
    },
    {
        "source_sentence": "若軟、中心犯，是不名失。",
        "translation": "If it's a minor or central offense, it's not called a mistake.",
        "source": "T24n1503_001:1117a10_13"
    },
    {
        "source_sentence": "若是增上心犯，是名為失。",
        "translation": "If it's a violation with an increased mind, this is called a mistake.",
        "source": "T24n1503_001:1117a11_14"
    },
    {
        "source_sentence": "何者是上？",
        "translation": "Which one is superior?",
        "source": "T24n1503_001:1117a11_15"
    },
    {
        "source_sentence": "若犯上四，數數樂犯，心無慚恥、不自悔責，是名上犯。",
        "translation": "If someone violates the above four, repeatedly enjoys violating them, has no shame and doesn't repent for themselves, this is called a higher offense.",
        "source": "T24n1503_001:1117a12_16"
    },
    {
        "source_sentence": "菩薩雖犯於上四事，不即永失。",
        "translation": "Although a bodhisattva violates the above four things, they aren't permanently lost.",
        "source": "T24n1503_001:1117a13_17"
    },
    {
        "source_sentence": "如比丘犯四即為永棄。",
        "translation": "Suppose a monk violates the four, which is to say that he's permanently abandoned.",
        "source": "T24n1503_001:1117a13_18"
    },
    {
        "source_sentence": "菩薩不爾。",
        "translation": "That's not the case for bodhisattvas.",
        "source": "T24n1503_001:1117a14_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1503_001:1117a14_20"
    },
    {
        "source_sentence": "比丘犯四更無受路。",
        "translation": "A monk violates the four precepts and doesn't accept the path.",
        "source": "T24n1503_001:1117a14_21"
    },
    {
        "source_sentence": "菩薩雖犯，脫可更受，是故不同。",
        "translation": "Even though a bodhisattva violates it, he's free to accept it again; therefore, it's different.",
        "source": "T24n1503_001:1117a15_22"
    },
    {
        "source_sentence": "略有二事失菩薩戒，一捨菩提願、二增上惡心。",
        "translation": "In brief, there are two things that lose the bodhisattva precepts: one, abandoning the vow for enlightenment and two, increasing bad thoughts.",
        "source": "T24n1503_001:1117a16_23"
    },
    {
        "source_sentence": "除是二事，若捨此身戒終不失。",
        "translation": "Except for these two things, the precepts won't be lost if he abandons this body.",
        "source": "T24n1503_001:1117a17_24"
    },
    {
        "source_sentence": "從是以後生生之處常有此戒，若不憶念，更遇善友而更受者，不名新得。",
        "translation": "If someone doesn't remember this precept, meets another good friend and receives it again, they won't be called newly attained.",
        "source": "T24n1503_001:1117a17_25"
    },
    {
        "source_sentence": "如是菩薩戒者，應當識知犯不犯事輕重之相、軟中上異。",
        "translation": "Thus, bodhisattvas who adhere to the precepts should know the relative seriousness of offenses and non-violations, the minor, middling, and major differences in their weaknesses.",
        "source": "T24n1503_001:1117a19_26"
    },
    {
        "source_sentence": "「如是住菩薩戒者，日應供養諸佛若塔若像，次供養法若行法人及菩薩藏大乘經典，供養眾僧及十方土住於大地諸菩薩等。",
        "translation": "Thus, someone who abides in the bodhisattva precepts should make daily offerings to the buddhas, whether stūpas or images, and then they should make offerings to Dharma practitioners and bodhisattvas, the great vehicle scriptures of the bodhisattva collection, the saṃgha, the bodhisattvas living on the earth in the lands of the ten directions, and so forth.",
        "source": "T24n1503_001:1117a21_0"
    },
    {
        "source_sentence": "於日夜中供養三寶，隨其力能，乃至一念一禮一四句誦信心供養，勿令有廢。",
        "translation": "Day and night, they make offerings to the Three Treasures, according to their power or strength, up to one thought, one bow, one four-character recitation, and faith in offerings so that there won't be any discrepancies.",
        "source": "T24n1503_001:1117a23_1"
    },
    {
        "source_sentence": "若不恭敬慢墮心者，犯重垢罪。",
        "translation": "If someone doesn't venerate and conceit themselves, they'll commit the serious defiled offense.",
        "source": "T24n1503_001:1117a25_2"
    },
    {
        "source_sentence": "若忘誤者，犯輕垢罪。",
        "translation": "If someone forgets it, they'll commit the minor defiled offense.",
        "source": "T24n1503_001:1117a26_3"
    },
    {
        "source_sentence": "不犯者，若病若狂，若有淨心逮菩薩地、如須陀洹得不壞淨心，常能供養三寶不絕，是名不犯。",
        "translation": "A person who doesn't violate the precepts is called not violating them if he's sick or crazy and has a pure mind that acquires the bodhisattva ground, such as stream entry, and attains an indestructible pure mind that can always make offerings to the Three Treasures without ceasing.",
        "source": "T24n1503_001:1117a26_4"
    },
    {
        "source_sentence": "菩薩不知厭足，貪著利養不制心者，犯重垢罪。",
        "translation": "A bodhisattva who doesn't know disillusionment and craves profit and doesn't restrain his mind, commits the grave defiled offense.",
        "source": "T24n1503_001:1117a29_0"
    },
    {
        "source_sentence": "不犯者，雖貪利養常生悔心：『我當精進斷除是意。』",
        "translation": "A person who doesn't violate the precepts always becomes remorseful even though they crave profit and possessions, saying, 'I will diligently remove this intention.'",
        "source": "T24n1503_001:1117b01_1"
    },
    {
        "source_sentence": "極自制御貪心猶起、若取小利助斷大貪，是名不犯。",
        "translation": "It's called not violating the precept against stopping craving if you are extremely self-contained and still have a mind that produces craving, or if you take small profits to help stop large craving.",
        "source": "T24n1503_001:1117b02_2"
    },
    {
        "source_sentence": "「菩薩，見上座尊長耆宿德同師同學，生憍慢心及瞋惡心，不起承迎禮拜避座，設有言語餘談不聽，若有所問不如實答者，犯重垢罪。",
        "translation": "“When a bodhisattva sees the superior monk's venerable senior colleagues and fellow students of the same teacher, he becomes conceited and angry, doesn't rise to greet them or venerate them, avoids his seat, speaks and doesn't listen to other discussions, and if he asks questions without really answering them, commits the grave defiled offense.",
        "source": "T24n1503_001:1117b04_0"
    },
    {
        "source_sentence": "若無慢瞋恚癡之意，直以懶惰無記散心，犯輕垢罪。",
        "translation": "If someone who lacks conceit, anger, ill-will, and delusion directly disperses their mind because they're lazy and indeterminate, they commit the minor defiled offense.",
        "source": "T24n1503_001:1117b07_1"
    },
    {
        "source_sentence": "不犯者，若病若狂若時睡眠，若聽法說法，若先共他人語，若為調伏滅惡增善，若有僧限護多人意，是名不犯。",
        "translation": "A person who doesn't violate the precepts is called someone who doesn't violate them if he's sick, crazy, sleeps at the time, listens to the teaching of the Dharma, speaks to others beforehand, subdues evil and increases goodness, and protects the minds of many people with a limited number of monks.",
        "source": "T24n1503_001:1117b08_2"
    },
    {
        "source_sentence": "「菩薩，檀越來請，若於自舍、若僧寺內給施所須，菩薩憍慢瞋恚輕賤不往受者，犯重垢罪。",
        "translation": "If a bodhisattva or donor comes and asks for what's needed to be given in his own house or inside a saṃgha's temple, and the bodhisattva is conceited, angry, despised, and doesn't go there to receive it, he commits the grave defiled offense.",
        "source": "T24n1503_001:1117b11_0"
    },
    {
        "source_sentence": "若懶惰不往，犯輕垢罪。",
        "translation": "If he's lazy and doesn't go there, he commits the sin of minor defilement.",
        "source": "T24n1503_001:1117b13_0"
    },
    {
        "source_sentence": "不犯者，若病若狂，若遠若道嶮難，若為調伏滅惡增善，若失受請，若為修善，若聽未聞，若知請主欲相惱故，若有僧限護多人意，是名不犯。",
        "translation": "A person who doesn't violate the precepts if he's sick or crazy, has a distant path or a dangerous path, cultivates goodness in order to subdue evil and increase goodness, fails to accept an invitation, cultivates goodness in order to hear it but doesn't hear it, knows that the inviter wants to harm him, and if there are bound by the saṃgha to protect the mind",
        "source": "T24n1503_001:1117b13_1"
    },
    {
        "source_sentence": "「菩薩，從他人邊得金銀琉璃種種雜寶所須之物，及地中伏藏無主財物，皆應取之，念當轉施。",
        "translation": "A bodhisattva who obtains gold, silver, lapis lazuli, various miscellaneous treasures, and property that's hidden in the ground but has no owner from someone else should all take them, and he'll give them back with mindfulness.",
        "source": "T24n1503_001:1117b17_0"
    },
    {
        "source_sentence": "若惡心瞋故不取者，犯重垢罪。",
        "translation": "If someone doesn't take it because of anger with bad intentions, they commit the grave defiled offense.",
        "source": "T24n1503_001:1117b19_1"
    },
    {
        "source_sentence": "若作是心：『我不與人。』",
        "translation": "If someone thinks, 'I won't give it to anyone.'",
        "source": "T24n1503_001:1117b19_2"
    },
    {
        "source_sentence": "而作因緣，若懶惰心，犯輕垢罪。",
        "translation": "If someone creates causes and conditions for laziness, they'll be guilty of the minor defilement offense.",
        "source": "T24n1503_001:1117b20_3"
    },
    {
        "source_sentence": "不犯者，若是狂心，若為調伏滅惡增善，若知受已必生愛著，若知施已生悔，若知施主施故發狂，若慮施主施已窮苦，若知施物三寶所有，若知施物劫盜所得，若知受已多得苦惱，所謂王難、賊盜、死亡、繫閉、惡聲流布、擯令出境界，是名不犯。",
        "translation": "A person who doesn't violate the precepts if their mind is crazy, and if they cultivate goodness in order to subdue badness and increase goodness, know that attachment will surely arise after accepting it, know that repentance will arise after giving, know that the donor's generosity causes them to become crazy, think that the donor's generosity has ended suffering, know that the gift belongs",
        "source": "T24n1503_001:1117b21_4"
    },
    {
        "source_sentence": "「菩薩，他來求法，以瞋惡心憎嫉他故不與說者，犯重垢罪。",
        "translation": "A bodhisattva who comes from another place to seek the Dharma and doesn't explain it because he hates others with anger and jealousy commits a grave defiled offense.",
        "source": "T24n1503_001:1117b26_5"
    },
    {
        "source_sentence": "若懶惰心不與說者，犯輕垢罪。",
        "translation": "If someone lazy and doesn't explain it, they commit the sin of minor defilement.",
        "source": "T24n1503_001:1117b27_6"
    },
    {
        "source_sentence": "不犯者，若外道求法慮還譏刺，若病若狂，若為調伏滅惡增善，若知前人不解其義，若前人不敬不如法事，若前人鈍根不解深法恐生邪見，若知聞已破失本心壞滅正法，若知聞已必向非器宣說其事，是名不犯。",
        "translation": "A person who doesn't violate the precepts if a non-Buddhist seeks the teaching and then criticizes it, becomes ill or crazy, subdues evil and increases goodness, knows that the person before him or her doesn't understand its meaning, doesn't respect what's not according to the teaching, has dull faculties before him or her that don't understand the profound teaching and",
        "source": "T24n1503_001:1117b28_7"
    },
    {
        "source_sentence": "「菩薩，見惡眾生犯戒毀禁作眾罪行，菩薩自知能化為善，若惡心瞋心捨不教者，犯重垢罪。",
        "translation": "A bodhisattva who sees that bad sentient beings violate precepts and prohibitions and commit various crimes, knows for himself that he can transform them into good, and if he abandons them with anger or doesn't teach them with bad thoughts, he commits the grave defiled offense.",
        "source": "T24n1503_001:1117c05_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1503_001:1117c07_1"
    },
    {
        "source_sentence": "菩薩不於身口意淨持戒人邊起於悲心。",
        "translation": "A bodhisattva doesn't give rise to compassion at the side of someone who purifies body, speech, and mind by observing precepts.",
        "source": "T24n1503_001:1117c07_2"
    },
    {
        "source_sentence": "若見惡人犯戒毀禁作眾罪行，極生悲心，是故有犯。",
        "translation": "If someone sees a bad person violate the precepts or violate prohibitions and commits numerous crimes, they'll become extremely compassionate, which is why it's a violation.",
        "source": "T24n1503_001:1117c08_3"
    },
    {
        "source_sentence": "不犯者，若狂，若為調伏滅惡增善，若有僧限護多人意，是名不犯。",
        "translation": "A person who doesn't violate the precepts is called someone who doesn't violate them if they're crazy or for the purpose of subduing and extinguishing evil and increasing goodness, and if there are saṃgha restrictions that protect the minds of many people, this is called someone who doesn't violate them.",
        "source": "T24n1503_001:1117c09_4"
    },
    {
        "source_sentence": "「菩薩，如佛所制波羅提木叉及結毘尼，欲使不信者信，已信者增，此聲聞戒及菩薩戒等無有異。",
        "translation": "“Bodhisattvas, just as the Buddha established the prātimokṣas and the fetters of the prātimokṣasa and the vinaya in order to cause those who don’t believe to believe and those who have already believed to increase, these śrāvaka precepts and bodhisattva precepts are no different.",
        "source": "T24n1503_001:1117c11_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1503_001:1117c13_1"
    },
    {
        "source_sentence": "聲聞之人順常自為，猶欲學令不信者信、已信者增。",
        "translation": "A śrāvaka follows the eternal self, still wanting to learn so that those who don't believe believe believe and those who already believe will increase.",
        "source": "T24n1503_001:1117c13_2"
    },
    {
        "source_sentence": "何況菩薩所修學，常為眾生，豈不能爾！",
        "translation": "How could it not be that the bodhisattva's cultivation always serves sentient beings?",
        "source": "T24n1503_001:1117c14_3"
    },
    {
        "source_sentence": "是故名同不犯。",
        "translation": "That's why they're called the same as not violating it.",
        "source": "T24n1503_001:1117c15_4"
    },
    {
        "source_sentence": "「如佛所制，聲聞之人應少欲作、少因緣事。",
        "translation": "Just as the Buddha has taught, śrāvakas should do things with few desires and few causes and conditions.",
        "source": "T24n1503_001:1117c16_0"
    },
    {
        "source_sentence": "菩薩不爾。",
        "translation": "That's not the case for bodhisattvas.",
        "source": "T24n1503_001:1117c16_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1503_001:1117c17_2"
    },
    {
        "source_sentence": "順求自利、不為他人，是聲聞好。",
        "translation": "Consistently seeking self-benefit and not for the benefit of others is the goodness of śrāvakas.",
        "source": "T24n1503_001:1117c17_3"
    },
    {
        "source_sentence": "菩薩若爾則不名菩薩。",
        "translation": "If that's the case for bodhisattvas, then they aren't called bodhisattvas.",
        "source": "T24n1503_001:1117c18_4"
    },
    {
        "source_sentence": "為他人故，所可受衣乃至百千，從非親里婆羅門居士盡力所求。",
        "translation": "For the sake of others, they can accept a hundred thousand pieces of clothing or even a hundred thousand pieces of clothing from a Brāhmaṇa householder who lives in a village that's not their own.",
        "source": "T24n1503_001:1117c18_5"
    },
    {
        "source_sentence": "如衣，鉢亦如是。",
        "translation": "As with a garment, so it is with an almsbowl.",
        "source": "T24n1503_001:1117c20_6"
    },
    {
        "source_sentence": "為他人故，及應乞縷教織師織、畜憍奢耶衣、受取金銀乃至百千，如是之事與聲聞異。",
        "translation": "For the sake of others, they should beg for thread, teach a weaver to weave it, store silk robes, accept gold and silver, or even hundreds of thousands of such things that are different from those of the śrāvakas.",
        "source": "T24n1503_001:1117c20_7"
    },
    {
        "source_sentence": "若菩薩本為眾生，而瞋惡心少作、少因緣事，放捨眾生獨居其所者，犯重垢罪。",
        "translation": "If a bodhisattva originally serves sentient beings but angrily acts with few actions and few causes, abandoning sentient beings who live alone in their place, he or she commits the serious defiled offense.",
        "source": "T24n1503_001:1117c22_8"
    },
    {
        "source_sentence": "若懶惰心，少欲少事居其所者，犯輕垢罪。",
        "translation": "If someone with a lazy mind who has few desires and few affairs lives there, they'll be guilty of the sin of minor defilement.",
        "source": "T24n1503_001:1117c24_9"
    },
    {
        "source_sentence": "「菩薩有五非法：一諂、二華、三相、四以利求利、五邪命。",
        "translation": "There are five kinds of unlawfulness for bodhisattvas: 1. flattery, 2. flowers, 3. characteristics, 4. seeking profit because of profit, and 5. wrong livelihood.",
        "source": "T24n1503_001:1117c25_10"
    },
    {
        "source_sentence": "有此五事，以不為愧不制不息者，犯重垢罪。",
        "translation": "With these five things, someone who doesn't act with shame or restrains and doesn't stop because they don't do so commits the grave defiled offense.",
        "source": "T24n1503_001:1117c26_11"
    },
    {
        "source_sentence": "不犯者，覺是非法常欲制之，是名不犯。",
        "translation": "A person who doesn't violate it and always wants to restrain it because he perceives it as unlawful is called not violating it.",
        "source": "T24n1503_001:1117c27_12"
    },
    {
        "source_sentence": "「菩薩，戲笑散亂高聲唱說，作非威儀令他人笑。",
        "translation": "A bodhisattva plays, laughs, scatters, raises a loud voice, and calls out in an uncomfortable manner to make others laugh.",
        "source": "T24n1503_001:1117c29_0"
    },
    {
        "source_sentence": "為眾所輕者，犯重垢罪。",
        "translation": "Those who are despised by the crowd commit a grave and defiled offense.",
        "source": "T24n1503_001:1118a01_1"
    },
    {
        "source_sentence": "若是宿習忘誤作者，犯輕垢罪。",
        "translation": "If this is a person who forgets the author because of past habits, he commits the minor defiled offense.",
        "source": "T24n1503_001:1118a01_2"
    },
    {
        "source_sentence": "不犯者，覺是非法常欲制之，若外人瞋恚欲調伏故，若人苦惱為令釋故，若欲攝取戲笑故，若二人共諍為和合故，是名不犯。",
        "translation": "A person who doesn't violate the precepts realizes that it's unlawful and always wants to restrain it, but if outsiders are angry and want to subdue them, or if they want to cause someone to be liberated because of suffering and distress, or if they want to take in people who play and laugh, or if two people fight together for the sake of harmony, this is called not violating",
        "source": "T24n1503_001:1118a02_3"
    },
    {
        "source_sentence": "「菩薩，如是見、如是語：『菩薩不應樂於涅槃，應背涅槃，不應畏煩惱、不應滅煩惱。",
        "translation": "“The bodhisattva thus sees and thus says, ‘Shouldn’t a bodhisattva delight in nirvana or turn his back on nirvana?",
        "source": "T24n1503_001:1118a05_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1503_001:1118a07_0"
    },
    {
        "source_sentence": "菩薩三阿僧祇往來生死故。』",
        "translation": "It's because the bodhisattvas go to birth and death in three incalculable eons.'",
        "source": "T24n1503_001:1118a07_1"
    },
    {
        "source_sentence": "如是語者，犯重垢罪。",
        "translation": "Someone who speaks like this commits a grave defiled offense.",
        "source": "T24n1503_001:1118a07_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1503_001:1118a08_3"
    },
    {
        "source_sentence": "如菩薩樂於涅槃、畏於煩惱，比於聲聞千萬倍不可為喻。",
        "translation": "It's like a bodhisattva who delights in nirvāṇa and fears afflictions, which are ten thousand times greater than śrāvakas and can't be compared.",
        "source": "T24n1503_001:1118a08_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1503_001:1118a09_5"
    },
    {
        "source_sentence": "聲聞之人順自為己，菩薩常為一切眾故。",
        "translation": "śrāvakas follow themselves for their own sake, and bodhisattvas always serve all the people.",
        "source": "T24n1503_001:1118a09_6"
    },
    {
        "source_sentence": "菩薩雖處有漏，於滅煩惱而得自在，過於羅漢處無漏者上。",
        "translation": "Although the bodhisattva abides in a state of impurity, he attains mastery over the extinction of defilement and goes beyond the sphere of the arhat.",
        "source": "T24n1503_001:1118a10_7"
    },
    {
        "source_sentence": "若菩薩起身口業應自防護，莫使他人慢惰罪。",
        "translation": "If a bodhisattva does physical or verbal actions, he should guard himself and not allow others to be conceited and lazy.",
        "source": "T24n1503_001:1118a12_8"
    },
    {
        "source_sentence": "若故不自護使他惰罪者，犯重垢罪。",
        "translation": "If someone therefore doesn't protect themselves and make others lazy, they commit the grave defiled offense.",
        "source": "T24n1503_001:1118a13_9"
    },
    {
        "source_sentence": "若不作意自護，放散所作生他罪者，犯輕垢罪。",
        "translation": "If someone doesn't contemplate self-protection and discloses the sins that give rise to other sins, they commit the minor defiled sin.",
        "source": "T24n1503_001:1118a14_10"
    },
    {
        "source_sentence": "不犯者，若外道，若隨出家如法所作，若值多瞋惡人，是名不犯。",
        "translation": "A person who doesn't violate the precepts is called someone who doesn't violate them if they're a non-Buddhist or a renunciant who follows what's done according to the teaching and meets many angry people.",
        "source": "T24n1503_001:1118a15_11"
    },
    {
        "source_sentence": "「菩薩，見前眾生須加杖痛然後有利，自護不治者，犯輕垢罪。",
        "translation": "A bodhisattva who sees that previous sentient beings need to be given the pain of a cane and then benefits, and protects himself or doesn't heal it, commits the sin of minor defilement.",
        "source": "T24n1503_001:1118a17_0"
    },
    {
        "source_sentence": "不犯者，若利少苦多，是名不犯。",
        "translation": "A person who doesn't violate it is called someone who doesn't violate it if the benefits are small and the suffering is great.",
        "source": "T24n1503_001:1118a18_1"
    },
    {
        "source_sentence": "「菩薩，以罵報罵、以瞋報瞋、以打報打、以牽挽者，犯重垢罪。",
        "translation": "A bodhisattva who ridicules, scolds, angers, beats, and pulls back with the retribution of abuse commits a grave defiled offense.",
        "source": "T24n1503_001:1118a20_0"
    },
    {
        "source_sentence": "「菩薩，與他共鬪及共相嫌，惡心瞋心、若憍慢心，不如法悔者，犯重垢罪。",
        "translation": "A bodhisattva who fights with others and resents each other, becomes bad-minded, angry, or conceited, and repents in ways that aren't according to the Dharma commits a grave defiled offense.",
        "source": "T24n1503_001:1118a22_0"
    },
    {
        "source_sentence": "若懶惰放逸一不求悔者，犯輕垢罪。",
        "translation": "If someone is lazy and careless and doesn't ask for repentance, they commit the minor defiled offense.",
        "source": "T24n1503_001:1118a23_1"
    },
    {
        "source_sentence": "不犯者，若為調伏滅惡增善，若彼外道要作非法，若彼憙鬪怨更增上，若知彼人終不受悔，若向彼悔起彼重慢，是名不犯。",
        "translation": "A person who doesn't violate the precepts is called someone who doesn't violate them if he wants to subdue badness and increase goodness, or if those non-Buddhists want to do something unlawful, or if their fighting becomes even more intense, knows that they won't regret it in the end, and if he repents to them and gives rise to their heavy pride, this is called someone who",
        "source": "T24n1503_001:1118a24_2"
    },
    {
        "source_sentence": "「菩薩，共他嫌恨，他如法求悔，菩薩惡心不受，為惱他者，犯重垢罪。",
        "translation": "A bodhisattva who shares the hatred of others and asks for their repentance according to the rules, but the bodhisattva doesn't accept it with evil intentions and commits a grave defiled offense if he harms others.",
        "source": "T24n1503_001:1118a28_0"
    },
    {
        "source_sentence": "若無瞋心，不受他悔，犯輕垢罪。",
        "translation": "If someone lacks anger and doesn't accept the repentance of others, they commit a minor misdeed.",
        "source": "T24n1503_001:1118a29_1"
    },
    {
        "source_sentence": "不犯者，若為調伏滅惡增善，若惡非法，是名不犯。",
        "translation": "A person who doesn't violate it is called someone who doesn't violate it if they want to subdue and cease badness and increase goodness, or if badness is unlawful.",
        "source": "T24n1503_001:1118b01_2"
    },
    {
        "source_sentence": "「菩薩，瞋他受者瞋事不休息者，犯重垢罪。",
        "translation": "A bodhisattva who becomes angry with other recipients and doesn't rest from angry things commits the grave defiled offense.",
        "source": "T24n1503_001:1118b03_0"
    },
    {
        "source_sentence": "不犯者，若常制之瞋心猶起，是名不犯。",
        "translation": "A person who doesn't violate the precepts is called not violating them if he always restrains anger that still arises in his mind.",
        "source": "T24n1503_001:1118b03_1"
    },
    {
        "source_sentence": "「菩薩，受畜徒眾，但為給事及與衣食，是名犯。",
        "translation": "A bodhisattva who accepts an animal for the purpose of providing services or food and clothing only is called a violator.",
        "source": "T24n1503_001:1118b05_0"
    },
    {
        "source_sentence": "「菩薩，起懶惰意，樂於非時食，貪著睡眠若倚若臥者，犯重垢罪。",
        "translation": "“A bodhisattva who gives rise to lazy thoughts, enjoys eating at an ungodly hour, and becomes greedy with sleep or lying or lying down, commits the serious defiled offense.",
        "source": "T24n1503_001:1118b06_0"
    },
    {
        "source_sentence": "不犯者，若病若狂無巧便，若道路行極，若常制之，是名不犯。",
        "translation": "A person who doesn't violate the precepts is called not violating them if he's sick or crazy and lacks skillful means of access, travels on a path that's extremely dangerous, and always restrains it.",
        "source": "T24n1503_001:1118b07_1"
    },
    {
        "source_sentence": "「菩薩，以染著心談說世樂事者，犯重垢罪。",
        "translation": "A bodhisattva who talks about worldly pleasures with a mind stained with attachment commits the grave defiled offense.",
        "source": "T24n1503_001:1118b09_0"
    },
    {
        "source_sentence": "若忘誤說，犯輕垢罪。",
        "translation": "If someone forgets to explain it incorrectly, they'll commit the minor defiled offense.",
        "source": "T24n1503_001:1118b09_1"
    },
    {
        "source_sentence": "不犯者，若有人問正心少說，若談異聞，若談論法事，是名不犯。",
        "translation": "A person who doesn't violate the precepts is called not violating them if someone asks a question with a correct mind and speaks little, discusses what's heard differently, or discusses things of the Dharma.",
        "source": "T24n1503_001:1118b10_2"
    },
    {
        "source_sentence": "「菩薩，樂欲坐禪，知他有法，以瞋慢心不能下意從他求受法者，犯重垢罪。",
        "translation": "A bodhisattva who delights in sitting in meditation and knows that others have the Dharma and doesn't seek to receive the Dharma from others with anger or conceit commits the serious defiled offense.",
        "source": "T24n1503_001:1118b11_3"
    },
    {
        "source_sentence": "若懶惰心不求受者，犯輕垢罪。",
        "translation": "If someone's lazy mind doesn't seek to receive it, they commit the sin of minor defilement.",
        "source": "T24n1503_001:1118b13_4"
    },
    {
        "source_sentence": "不犯者，若病若無巧便，若知彼人不順法教，若自有巧便多聞攝其心者，是名不犯。",
        "translation": "A person who doesn't violate the precepts is called not violating them if he's sick or lacks skillful means, knows that person doesn't follow the teaching of the Dharma, and has a skillful means to hear well enough to gather his mind with skillful means.",
        "source": "T24n1503_001:1118b14_5"
    },
    {
        "source_sentence": "「菩薩，起欲界欲，不觀對治疾除滅者，犯重垢罪。",
        "translation": "A bodhisattva who gives rise to desire in the desire realm and doesn't observe the antidote that removes illness and extinguishes it commits a grave defiled offense.",
        "source": "T24n1503_001:1118b17_0"
    },
    {
        "source_sentence": "不犯者，常勤欲滅欲心猶起，是名不犯。",
        "translation": "A person who doesn't violate the precepts because he always exerts effort to cease his mind with desire and still arouses it, this is called not violating them.",
        "source": "T24n1503_001:1118b18_1"
    },
    {
        "source_sentence": "如欲，餘蓋亦爾。",
        "translation": "The same applies to the other forms of sexual passion.",
        "source": "T24n1503_001:1118b18_2"
    },
    {
        "source_sentence": "若菩薩貪味於禪著功德者，犯重垢罪。",
        "translation": "If a bodhisattva craves the taste of meditation and is attached to its merits, he commits the grave defiled offense.",
        "source": "T24n1503_001:1118b19_3"
    },
    {
        "source_sentence": "不犯者，常欲捨著著心猶起，是名不犯。",
        "translation": "A person who doesn't violate the precepts always wants to abandon attachment and still arouses it, which is called not violating them.",
        "source": "T24n1503_001:1118b20_4"
    },
    {
        "source_sentence": "「菩薩，如是見、如是語：『菩薩不應聽受誦學聲聞法藏。",
        "translation": "Bodhisattvas thus see and say, 'Shouldn't bodhisattvas hear and accept the recitation of the śrāvaka dharma store?",
        "source": "T24n1503_001:1118b21_5"
    },
    {
        "source_sentence": "菩薩之人用學是為？』",
        "translation": "What's the use of training for bodhisattvas?'",
        "source": "T24n1503_001:1118b22_6"
    },
    {
        "source_sentence": "作是語者，犯重垢罪。",
        "translation": "Someone who says this is guilty of a grave defiled offense.",
        "source": "T24n1503_001:1118b22_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1503_001:1118b23_8"
    },
    {
        "source_sentence": "菩薩於外道書尚應當學，何況佛語！",
        "translation": "A bodhisattva should still learn from non-Buddhist books, so why wouldn't he learn from the Buddha's words?",
        "source": "T24n1503_001:1118b23_9"
    },
    {
        "source_sentence": "不犯者，為欲調伏聲聞入大乘故，是名不犯。",
        "translation": "A person who doesn't violate it because they want to tame śrāvakas and enter the great vehicle, which is called someone who doesn't violate it.",
        "source": "T24n1503_001:1118b24_10"
    },
    {
        "source_sentence": "「菩薩法藏一向捨置，貪學讀誦聲聞經者，犯輕垢罪。",
        "translation": "A bodhisattva who always abandons the treasury of the Dharma and craves to read and recite śrāvaka sūtras commits the minor defiled offense.",
        "source": "T24n1503_001:1118b26_0"
    },
    {
        "source_sentence": "「菩薩，有佛經藏不能勤學，乃更勤學外道俗典，犯重垢罪。",
        "translation": "A bodhisattva who doesn't diligently train in the store of Buddhist scriptures and then diligently trains in non-Buddhist texts, commits a grave defiled offense.",
        "source": "T24n1503_001:1118b28_0"
    },
    {
        "source_sentence": "不犯者，若極根利一聞能持，同佛語者取用助化，以彼妙辭助明佛法，於佛法於佛經義意不傾動，是名不犯。",
        "translation": "A person who doesn't violate the precepts is called someone who doesn't violate them if their faculties are sharp, and if they can maintain it with a single hearing that's the same as the Buddha's words, take advantage of what he teaches to help clarify the Buddha's teaching by using his marvelous words so that the meaning of the Buddha's teaching doesn't budge from the Buddha's",
        "source": "T24n1503_001:1118b29_1"
    },
    {
        "source_sentence": "「菩薩，欲學外道經典，應如上學。",
        "translation": "A bodhisattva who wants to train in non-Buddhist scriptures should train as above.",
        "source": "T24n1503_001:1118c03_0"
    },
    {
        "source_sentence": "若於中受樂生著心，不如服苦藥者，犯重垢罪。",
        "translation": "If someone experiences pleasure and becomes attached to it but doesn't take painful medicine, they commit the serious defiled offense.",
        "source": "T24n1503_001:1118c03_1"
    },
    {
        "source_sentence": "「菩薩，若聞菩薩法藏，甚深祕密第一實義不思議事，純是諸佛菩薩境界，於此義中生誣謗心言：『此義無益，非佛所說，不能祐利一切眾生。』",
        "translation": "If a bodhisattva hears the profound, esoteric, true, and inconceivable things of the bodhisattva's store of the Dharma, it's only the sphere of buddhas and bodhisattvas who give rise to the misleading thought that these meanings are useless because they aren't taught by the Buddha and can't benefit all sentient beings.",
        "source": "T24n1503_001:1118c04_2"
    },
    {
        "source_sentence": "作是謗者，犯重垢罪。",
        "translation": "Someone who denigrates it commits a grave offense.",
        "source": "T24n1503_001:1118c07_3"
    },
    {
        "source_sentence": "不犯者，若思惟定義，若方便說，是名不犯。",
        "translation": "A person who doesn't violate it is called not violating it if he contemplates the definition or explains it skillfully.",
        "source": "T24n1503_001:1118c08_4"
    },
    {
        "source_sentence": "「菩薩，聞於甚深義時若不生信，以不諂心為生信故應作是念：『我不應爾。",
        "translation": "“When bodhisattvas hear profound meanings, if they don’t give rise to faith, they should think, ‘This is not the case for me.",
        "source": "T24n1503_001:1118c10_0"
    },
    {
        "source_sentence": "我如盲者無有慧眼。",
        "translation": "I'm like a blind man who doesn't have the eye of wisdom.",
        "source": "T24n1503_001:1118c11_1"
    },
    {
        "source_sentence": "佛口所說我云何謗？』",
        "translation": "How can I denigrate what the Buddha says in my mouth?'",
        "source": "T24n1503_001:1118c12_2"
    },
    {
        "source_sentence": "如是菩薩自憤由癡，是佛境界非我所及，若能如是是為正行。",
        "translation": "Such a bodhisattva is self- angered because of delusion, which is the Buddha's sphere and not mine, and if he can do so, this is right practice.",
        "source": "T24n1503_001:1118c12_3"
    },
    {
        "source_sentence": "若意不解不生誹謗，是名不犯。",
        "translation": "If someone's mind doesn't understand and doesn't give rise to criticism, this is called not violating it.",
        "source": "T24n1503_001:1118c14_0"
    },
    {
        "source_sentence": "「菩薩，為飲食故，以瞋惡心自讚毀他，犯重垢罪。",
        "translation": "A bodhisattva who praises himself and disparages others with anger for the sake of food and drink commits the grave defiled offense.",
        "source": "T24n1503_001:1118c15_0"
    },
    {
        "source_sentence": "不犯者，若為伏外道，若伏憍慢增長佛法，若為不信者信、已信者增，是名不犯。",
        "translation": "A person who doesn't violate the precepts is called not violating them if he wants to subdue non-Buddhists, subdues conceit, and increases the buddha-dharma, and if he doesn't believe it for those who believe and those who already believe it.",
        "source": "T24n1503_001:1118c16_1"
    },
    {
        "source_sentence": "「菩薩，有說法家、若說毘尼處、大法會處，瞋嫉慢心不往聽者，犯重垢罪。",
        "translation": "A bodhisattva who teaches the Dharma at a house, explains the vinaya or great dharma assembly places, and doesn't go there with anger and jealousy and conceit and doesn't listen to them commits the serious defiled offense.",
        "source": "T24n1503_001:1118c18_0"
    },
    {
        "source_sentence": "若懶惰心不往聽者，犯輕垢罪。",
        "translation": "If someone with a lazy mind doesn't go to listen, they commit the sin of minor defilement.",
        "source": "T24n1503_001:1118c19_1"
    },
    {
        "source_sentence": "不犯者，若自不聞又無人喚，若病若無巧便，若知彼說法不順義理，若知說者於己有難，若知彼說更無異聞，若得總持自多聞，若勤修善根，是名不犯。",
        "translation": "A person who doesn't violate the precepts if they haven't heard it themselves and no one calls them, are sick or lacking skillful means, know that their explanation of the teaching doesn't follow the meaning and principle, know that the speaker has difficulties with himself, know that there's no difference in what he teaches, attain mastery of his own extensive learning, and diligently cultivate good root",
        "source": "T24n1503_001:1118c20_2"
    },
    {
        "source_sentence": "「菩薩，有人來倩，我有事緣當為營辦，所謂共去共還營佐眾事，有所營了守護財物，和合鬪訟經辦飲食，修福德業。",
        "translation": "“Bodhisattva, someone has come to tell me that I have some business to attend to, which is to say that I am going and returning together to attend to the affairs of the assembly, guarding my belongings, reconciling disputes and controversies, providing food and drink for them, and cultivating meritorious deeds.",
        "source": "T24n1503_001:1118c24_0"
    },
    {
        "source_sentence": "若一二事不為作者，犯重垢罪。",
        "translation": "If one or two things aren't the author, it's a grave defiled offense.",
        "source": "T24n1503_001:1118c26_1"
    },
    {
        "source_sentence": "若懶惰不為，犯輕垢罪。",
        "translation": "If he's lazy and doesn't do it, he commits the minor defiled offense.",
        "source": "T24n1503_001:1118c27_2"
    },
    {
        "source_sentence": "不犯者，若病若無巧便，若自有事，若彼能辦，若不相倩，若無益事，若為調伏滅惡增善，若無他倩，若報他作勤修善根，若自闇鈍恐失業次，若有僧限護多人意，是名不犯。",
        "translation": "A person who doesn't violate the precepts if he's sick or lacks skillful means, has something to do on his own, can do it, doesn't have good intentions for each other, doesn't perform beneficial tasks, subdues evil and increases goodness in order to suppress it, doesn't have an intention for others, diligently cultivates good roots as a reward for someone else",
        "source": "T24n1503_001:1118c27_3"
    },
    {
        "source_sentence": "「若菩薩，見病眾生，以惡心瞋心不瞻養者，犯重垢罪。",
        "translation": "If a bodhisattva sees sick sentient beings and doesn't look after them with bad thoughts and anger, he commits the grave defiled offense.",
        "source": "T24n1503_001:1119a02_4"
    },
    {
        "source_sentence": "若懶惰不養，犯輕垢罪。",
        "translation": "If someone is lazy and doesn't support themselves, they'll be guilty of the minor defilement offense.",
        "source": "T24n1503_001:1119a03_5"
    },
    {
        "source_sentence": "不犯者，若自有病，若無巧便，若倩他看，若彼病者自有屬眷，若知病者能自經給，若久病，若人猶能起止，若欲勤修增上善根，若極自闇鈍恐失黨次，若失看病如病餘，貧窮苦惱亦復如是，是名不犯。",
        "translation": "A person who doesn't violate the precepts if he has a illness on his own, doesn't have skillful means to get rid of it, or asks others to look after it, and if he has dependents for him- or herself when he's sick, knows that he can provide for himself, is ill for a long time, still gives rise to calmness, wants to diligently cultivate superior good roots, is",
        "source": "T24n1503_001:1119a04_6"
    },
    {
        "source_sentence": "「菩薩，見前眾生應有利宜，無有方便而能發起。",
        "translation": "“The bodhisattva, seeing that the former sentient beings should be advantageous and appropriate, has no method to give rise to them.",
        "source": "T24n1503_001:1119a10_0"
    },
    {
        "source_sentence": "菩薩惡心瞋心不教示者，犯重垢罪。",
        "translation": "A bodhisattva who doesn't teach with bad thoughts and angry thoughts commits the grave defiled offense.",
        "source": "T24n1503_001:1119a11_1"
    },
    {
        "source_sentence": "若懶惰不教，犯輕垢罪。",
        "translation": "If someone is lazy and doesn't teach it, they commit the minor defiled offense.",
        "source": "T24n1503_001:1119a11_2"
    },
    {
        "source_sentence": "不犯者，若無方便，若使他教，若彼自有善知識，若為調伏滅惡增善，若示彼方便更瞋反戾，無有敬愛心彊得自用，是名不犯。",
        "translation": "A person who doesn't violate the precepts is called not violating them if he has no skillful means, causes others to teach it, has good friends in his own mind, subdues badness and increases goodness, shows them skillful means to become more angry and resentful, lacks respect and craving, and attains self-use.",
        "source": "T24n1503_001:1119a12_3"
    },
    {
        "source_sentence": "「菩薩，眾生給施所須，應念其恩。",
        "translation": "“Bodhisattvas, sentient beings who give what they need should be mindful of their kindness.",
        "source": "T24n1503_001:1119a15_4"
    },
    {
        "source_sentence": "若惡心瞋心不念恩報恩者，犯重垢罪。",
        "translation": "If someone with bad thoughts and anger doesn't think of kindness as repaying kindness, they commit the grave defiled offense.",
        "source": "T24n1503_001:1119a16_5"
    },
    {
        "source_sentence": "若懶惰不報，犯輕垢罪。",
        "translation": "If he's lazy and doesn't retaliate, he commits the minor defiled offense.",
        "source": "T24n1503_001:1119a16_6"
    },
    {
        "source_sentence": "不犯者，若自無力，若無巧便，若為調伏滅惡增善，若欲念報施主不受，是名不犯。",
        "translation": "A person who doesn't violate the precepts if they lack power, lack skillful means, cease evil and increase goodness in order to subdue it, or want to think of the donor as a reward and not accept it, is called someone who doesn't violate them.",
        "source": "T24n1503_001:1119a17_7"
    },
    {
        "source_sentence": "「菩薩，見人親里死亡，若亡失財物種種憂苦。",
        "translation": "“Bodhisattvas, when they see someone who dies in a nearby village and loses property, they experience various kinds of grief and suffering.",
        "source": "T24n1503_001:1119a20_0"
    },
    {
        "source_sentence": "若惡心瞋心不往慰喻者，犯重垢罪。",
        "translation": "If someone with bad intentions and anger doesn't go to comfort them, they commit the grave defiled offense.",
        "source": "T24n1503_001:1119a21_0"
    },
    {
        "source_sentence": "不犯者，如前倩菩薩中說。",
        "translation": "A person who doesn't violate it is as explained in the previous section on the bodhisattva of enlightenment.",
        "source": "T24n1503_001:1119a21_1"
    },
    {
        "source_sentence": "「菩薩，有人從索飲食，所須不與者，犯重垢罪。",
        "translation": "“Bodhisattva, if someone asks for food and drink but doesn’t give what they need, it’s a grave defiled offense.",
        "source": "T24n1503_001:1119a23_0"
    },
    {
        "source_sentence": "不犯者，若自無物，若索不淨物，若為調伏滅惡增善，若王所制，若護僧限，是名不犯。",
        "translation": "A person who doesn't violate the precepts is called not violating them if he has nothing on his own, asks for impure things, cultivates goodness in order to subdue evil and increase goodness, regulates it by the king, or protects the limits of the saṃgha.",
        "source": "T24n1503_001:1119a24_0"
    },
    {
        "source_sentence": "「菩薩，弟子應隨時教誨。",
        "translation": "“Bodhisattvas, a disciple should teach them at any time.",
        "source": "T24n1503_001:1119a26_0"
    },
    {
        "source_sentence": "若弟子有乏，應從篤信人邊勸索供給。",
        "translation": "If a disciple is lacking, he should be encouraged to make offerings from the side of a devout believer.",
        "source": "T24n1503_001:1119a26_1"
    },
    {
        "source_sentence": "若惡心瞋心不教誨、不供給者，犯重垢罪。",
        "translation": "If someone with bad intentions and anger doesn't teach or offer, they commit the grave defiled offense.",
        "source": "T24n1503_001:1119a27_2"
    },
    {
        "source_sentence": "若懶惰心不教供給，犯輕垢罪。",
        "translation": "If someone's lazy mind doesn't teach offerings, they commit the sin of minor defilement.",
        "source": "T24n1503_001:1119a28_3"
    },
    {
        "source_sentence": "不犯者，若為調伏滅惡增善，若護僧限，若病若無巧便，若倩人教，若弟子福德能致供養，若弟子本是外道無好善心，是名不犯。",
        "translation": "A person who doesn't violate the precepts if he tames and extinguishes badness and increases goodness, protects the limits of the saṃgha, becomes ill or lacks skillful means, teaches it to an eloquent person, makes offerings based on the merits of his disciples, or if his disciples are originally non-Buddhist without good and good intentions",
        "source": "T24n1503_001:1119a29_4"
    },
    {
        "source_sentence": "「菩薩，以瞋心惡心不護他意者，犯重垢罪。",
        "translation": "A bodhisattva who doesn't guard the minds of others with anger and bad intentions commits a grave defiled offense.",
        "source": "T24n1503_001:1119b02_5"
    },
    {
        "source_sentence": "若懶惰放逸不護他意，犯輕垢罪。",
        "translation": "If someone is lazy and careless and doesn't protect others' thoughts, they commit the sin of minor defilement.",
        "source": "T24n1503_001:1119b03_6"
    },
    {
        "source_sentence": "不犯者，若非法事，若病，若有僧限護多人意，若外道，若為調伏滅惡增善，是名不犯。",
        "translation": "A person who doesn't violate the precepts is called someone who doesn't violate them if they do unlawful things, become ill, have a monastic limit to protect the minds of many people, are a non-Buddhist, and cultivate goodness in order to subdue evil and increase goodness.",
        "source": "T24n1503_001:1119b04_7"
    },
    {
        "source_sentence": "「菩薩，見他德行不能稱讚，以惡心瞋心隱藏他善者，犯重垢罪。",
        "translation": "A bodhisattva who sees the virtuous actions of others and doesn't praise them and hides the goodness of others with bad thoughts and anger commits a grave defiled offense.",
        "source": "T24n1503_001:1119b07_0"
    },
    {
        "source_sentence": "若懶惰放逸不稱他善，犯輕垢罪。",
        "translation": "If someone is lazy and careless and doesn't praise the goodness of others, they commit the sin of minor defilement.",
        "source": "T24n1503_001:1119b08_1"
    },
    {
        "source_sentence": "不犯者，若知彼人不樂讚歎，若病若無巧便，若為調伏滅惡增善，護僧限，若知聞讚更生憍慢，若彼無實德，若言似善實無善義，若為外道，若讚時未到，是名不犯。",
        "translation": "A person who doesn't violate the precepts if he knows that person doesn't like to praise them, becomes ill or lacks skillful means, cultivates goodness and increases goodness in order to subdue it, protects the limits of the saṃgha, and becomes conceited when he knows they're praised, has no real virtue, speaks seemingly good without a real meaning",
        "source": "T24n1503_001:1119b09_2"
    },
    {
        "source_sentence": "「菩薩，為多人頭首，見諸眷屬不如法事應呵應擯。",
        "translation": "Bodhisattvas, it's the head of many people who see their followers doing things that aren't according to the teaching and should be rebuked or scolded.",
        "source": "T24n1503_001:1119b13_0"
    },
    {
        "source_sentence": "若瞋心惡心捨不呵治者，犯重垢罪。",
        "translation": "If someone with an angry mind and a bad mind abandons it and doesn't rebuke it, they commit the grave defiled offense.",
        "source": "T24n1503_001:1119b14_1"
    },
    {
        "source_sentence": "若懶惰放逸不教呵者，犯輕垢罪。",
        "translation": "If someone is lazy and careless and doesn't teach or criticize them, they commit the sin of minor defilement.",
        "source": "T24n1503_001:1119b15_0"
    },
    {
        "source_sentence": "不犯者，若知彼人惡性健瞋不受教呵，若待時教呵，若畏破僧，若知彼質直宿習少羞喜數犯悔，是名不犯。",
        "translation": "A person who doesn't violate the precepts if he knows that person's bad-natured and strongly angry, doesn't receive instruction or reprimand, waits for instruction at the right time, fears breaking the saṃgha, and knows that they're straightforward in their past lives with little shame and joy and repeatedly commits repentance, which is called not violating the pre",
        "source": "T24n1503_001:1119b15_1"
    },
    {
        "source_sentence": "「菩薩，有神通變化，應為眾生隨時變現，或方便恐怖令生信心。",
        "translation": "A bodhisattva who has miraculous powers and transformations should manifest them for the sake of sentient beings at any time, or he can skillfully terrify them so that they'll give rise to faith.",
        "source": "T24n1503_001:1119b19_0"
    },
    {
        "source_sentence": "若畏信施不現變化者，犯輕垢罪。",
        "translation": "If someone is afraid of faithful giving and doesn't show transformation, they commit the minor defiled offense.",
        "source": "T24n1503_001:1119b20_1"
    },
    {
        "source_sentence": "不犯者，若人深著惡法邪見，若是外道，若罵賢聖，若著邪見，若狂若病，是名不犯。",
        "translation": "A person who doesn't violate it is called not violating it if someone deeply believes in the wrong view of bad qualities, or if they're a non-Buddhist, scold good and noble people, cling to wrong views, go crazy, or become ill.",
        "source": "T24n1503_001:1119b21_2"
    },
    {
        "source_sentence": "「菩薩，戒聚成就具足無量妙果，以是戒聚因緣力故具足尸波羅蜜。",
        "translation": "Bodhisattvas, the accomplishment of the collection of precepts is replete with measureless marvelous results, and it's because of the causal power of the collection of precepts that they are replete with the perfection of morality.",
        "source": "T24n1503_001:1119b23_3"
    },
    {
        "source_sentence": "受者雖未得阿耨多羅三藐三菩提，以得具足五事功德：一者常為諸佛菩薩所護念；",
        "translation": "Even though they have not yet attained anuttarii samyaksarrzbodhi, the enlightening beings are endowed with five meritorious virtues by attainment:",
        "source": "T24n1503_001:1119b24_4"
    },
    {
        "source_sentence": "二者受常淨樂；",
        "translation": "The second is that they experience permanence, purity, and bliss.",
        "source": "T24n1503_001:1119b26_5"
    },
    {
        "source_sentence": "三者臨終無悔；",
        "translation": "The third is the absence of regret at death.",
        "source": "T24n1503_001:1119b26_6"
    },
    {
        "source_sentence": "四者捨身得生諸佛世界；",
        "translation": "The fourth is that they give up their bodies to be born in the buddha worlds.",
        "source": "T24n1503_001:1119b27_7"
    },
    {
        "source_sentence": "五者莊嚴阿耨多羅三藐三菩提。",
        "translation": "The fifth is to adorn unsurpassed, correct, and complete enlightenment.",
        "source": "T24n1503_001:1119b27_8"
    },
    {
        "source_sentence": "菩薩受持菩薩戒者，不自為身唯為利他，及莊嚴阿耨多羅三藐三菩提。",
        "translation": "A bodhisattva who receives and observes the bodhisattva precepts doesn't do so for his own sake, but only for the benefit of others, and he adorns unsurpassed, correct, and complete enlightenment.",
        "source": "T24n1503_001:1119b28_9"
    },
    {
        "source_sentence": "是菩薩戒，悉是過去未來現在恒河沙等諸佛菩薩之所成就，乃至十方諸佛菩薩亦復如是。",
        "translation": "These bodhisattva precepts are all accomplished by buddhas and bodhisattvas as numerous as the sands of the Ganges River in the past, future, and present, and so it's likewise with the buddhas and bodhisattvas of the ten directions.",
        "source": "T24n1503_001:1119c01_10"
    },
    {
        "source_sentence": "菩薩弘慈普恩，及六道眾生、三塗八難，苦惱十方無不蒙益。」",
        "translation": "The bodhisattva's vast compassionate universal benevolence and the six paths of sentient beings in the three destinies, the three destinies, and the eight difficulties are painful and unbeneficial in ten directions.",
        "source": "T24n1503_001:1119c03_11"
    },
    {
        "source_sentence": "「功德不可計，　　福慧如虛空，",
        "translation": "Their merits cannot be measured, And their virtue and wisdom are like space.",
        "source": "T24n1503_001:1119c05_0"
    },
    {
        "source_sentence": "　略說共要竟，　　歡喜禮奉行。",
        "translation": "Having briefly explained the essentials of the teaching together, they joyfully venerate and respectfully practice it.",
        "source": "T24n1503_001:1119c06_0"
    },
    {
        "source_sentence": "　普發菩提心，　　福慧命得成，",
        "translation": "Awakening the determination for enlightenment everywhere, Their lives of virtue and knowledge are attained.",
        "source": "T24n1503_001:1119c07_0"
    },
    {
        "source_sentence": "　慈悲男女長，　　喜捨次第生。",
        "translation": "The love and compassion of men and women arise successively. Joy and equanimity arise in succession.",
        "source": "T24n1503_001:1119c08_0"
    },
    {
        "source_sentence": "　一切成佛道，　　永盡無有餘，",
        "translation": "All who have attained the path of enlightenment Will be eternally extinguished without remainder.",
        "source": "T24n1503_001:1119c09_0"
    },
    {
        "source_sentence": "　十方同其願，　　巍巍無極尊。」",
        "translation": "The ten directions are the same as their vows, and they're noble and supremely honored.",
        "source": "T24n1503_001:1119c10_0"
    },
    {
        "source_sentence": "「欲為菩薩優婆塞，放逸五戒威儀者，若無師從受處，爾時受者若無師，應向佛像前自誓受。",
        "translation": "Desiring to be a bodhisattva or layman who is careless about the five precepts and their manner, if there's no teacher from where he receives them, then those who receive them at that point should vow to accept them in front of the Buddha's image.",
        "source": "T24n1503_001:1119c11_0"
    },
    {
        "source_sentence": "菩薩優婆塞威儀應如是作禮，偏袒右肩胡跪合掌，應如是言：『我某甲白十方佛及住大地諸菩薩等，今於諸佛前欲受一切戒，學一切菩薩戒、優婆塞五戒威儀，攝一切善法菩薩戒，為利眾生戒。",
        "translation": "The bodhisattvas and laymen should pay homage in this way, bare their right shoulders, kneel down with their palms joined, and say, 'Now, I, a certain person, have told the buddhas of the ten directions and the bodhisattvas who live in the great land that I want to receive all the precepts before the buddhas, study all the bodhisattva precepts, the five",
        "source": "T24n1503_001:1119c13_1"
    },
    {
        "source_sentence": "是戒過去諸菩薩已學，未來諸菩薩當學，現在諸菩薩今學，我亦如是學。』",
        "translation": "These precepts have been studied by bodhisattvas in the past, will be studied by bodhisattvas in the future, and are being studied by bodhisattvas in the present, so I'll also study them likewise.'",
        "source": "T24n1503_001:1119c17_2"
    },
    {
        "source_sentence": "第二第三亦如是說竟。",
        "translation": "The second and third are likewise explained in the end.",
        "source": "T24n1503_001:1119c19_3"
    },
    {
        "source_sentence": "其餘諸事應如前廣說。",
        "translation": "The other things should be explained in detail as before.",
        "source": "T24n1503_001:1119c19_4"
    },
    {
        "source_sentence": "「離欲優婆塞具行五戒，遠離身四惡：一者殺、二者盜、三者婬、四者飲酒。",
        "translation": "An upāsaka who's free of desire observes five precepts and is far removed from the four bad bodily actions: one, killing, two, stealing, three, sexual misconduct, and four, drinking alcohol.",
        "source": "T24n1503_001:1119c21_0"
    },
    {
        "source_sentence": "遠離口五惡：一者妄語、二者惡口、三者兩舌、四者無義語、五者綺語。",
        "translation": "They're free of the five bad verbal actions: 1. lying, 2. harsh speech, 3. divisive speech, 4. meaningless speech, and 5. fancy speech.",
        "source": "T24n1503_001:1119c22_1"
    },
    {
        "source_sentence": "遠離五邪命：一者賣肉、二者沽酒、三者賣毒、四者賣眾生、五者賣兵仗。",
        "translation": "They're free of five wrong livelihoods: first, selling meat, second, selling wine, third, selling poison, fourth, selling sentient beings, and fifth, selling weapons.",
        "source": "T24n1503_001:1119c24_2"
    },
    {
        "source_sentence": "遠離嚴飾五事：一者香、二者花、三者瓔珞、四者香油塗身、五者香熏衣。",
        "translation": "They're free of the five things that adorn themselves: first, fragrance, second, flowers, third, jewelry, fourth, scented oil applied to their bodies, and fifth, perfumed clothing.",
        "source": "T24n1503_001:1119c25_3"
    },
    {
        "source_sentence": "遠離放逸五事：一者歌、二者舞、三者作樂、四者嚴飾樂器、五者不往觀聽。",
        "translation": "They're free of the five kinds of carelessness: 1. singing, 2. dancing, 3. making music, 4. adorning musical instruments, and 5. not going to see or hear.",
        "source": "T24n1503_001:1119c27_4"
    },
    {
        "source_sentence": "此五戒隨力所堪，若能終身具持五為上；",
        "translation": "These five precepts are to be fulfilled according to one’s capacities. The highest of these is that which consists of maintaining them for the rest of one lifetime.",
        "source": "T24n1503_001:1119c29_0"
    },
    {
        "source_sentence": "若不能，隨持多少年月日夜，乃至須臾亦得暫持。",
        "translation": "If they can't, they can maintain it for a number of years, months, days, nights, or even for a moment.",
        "source": "T24n1503_001:1119c29_1"
    },
    {
        "source_sentence": "不但如持全念。",
        "translation": "It's not just like maintaining whole mindfulness.",
        "source": "T24n1503_001:1120a02_2"
    },
    {
        "source_sentence": "佛臨涅槃勅四大聲聞及六應真：『吾滅度後，如是真法之中，若出家二眾淨持禁戒，及在家二眾隨力多少，心次近持上戒者，若造房舍床褥衣服飲食，一切順道資生之具，施四方僧及諸賢聖。",
        "translation": "When the Buddha was about to enter nirvana, he commanded the four great śrāvakas and six arhats, 'After my parinirvāṇa, such is the true teaching that if two groups of renunciant monks who purely observe precepts the precepts and two groups of homeless monks follow each other's strength in their minds and approach those who uphold the higher precepts, they build dwell",
        "source": "T24n1503_001:1120a02_3"
    },
    {
        "source_sentence": "汝等盡應受請；",
        "translation": "All of you should accept this invitation.",
        "source": "T24n1503_001:1120a06_4"
    },
    {
        "source_sentence": "若不受者得罪。』",
        "translation": "If someone doesn't accept it, they'll be guilty.'",
        "source": "T24n1503_001:1120a07_5"
    },
    {
        "source_sentence": "以此觀之，賢聖不遠感至則應。",
        "translation": "Because of this observation, good and noble people aren't far from it, and the response is appropriate.",
        "source": "T24n1503_001:1120a07_6"
    },
    {
        "source_sentence": "若作功德，先當竭力受持上戒，然後至心請四方僧及諸賢聖。",
        "translation": "If they do so, they must first make every effort to uphold the higher precepts and then wholeheartedly invite the saṃgha and the good men and sages of the four directions.",
        "source": "T24n1503_001:1120a08_7"
    },
    {
        "source_sentence": "若不能終身，至一日一夕者善。",
        "translation": "If you can't spend the rest of your life, it's good if you don't do so for a day and a night.",
        "source": "T24n1503_001:1120a09_8"
    },
    {
        "source_sentence": "若不能者，設供之時便受，罷便止。",
        "translation": "If he can't, he accepts it when he makes an offering and stops after finishing it.",
        "source": "T24n1503_001:1120a10_9"
    },
    {
        "source_sentence": "此諸賢聖皆來受請，若有所犯即如法悔。",
        "translation": "These good men and sages all come to accept the invitation, and if they violate it, they repent according to the rules.",
        "source": "T24n1503_001:1120a11_10"
    },
    {
        "source_sentence": "此一切菩薩犯，當突吉羅罪。",
        "translation": "If all these bodhisattvas commit crimes, they'll be guilty of a grave offense.",
        "source": "T24n1503_001:1120a12_0"
    },
    {
        "source_sentence": "當向大小乘人能解說、能受悔者如法懺悔。",
        "translation": "You should explain it to people of the greater and lesser vehicles who can understand it and those who can receive repentance and repent in accordance with the teaching.",
        "source": "T24n1503_001:1120a12_1"
    },
    {
        "source_sentence": "「若菩薩，以增上煩惱犯波羅夷處法者，失律儀戒，應當更受。",
        "translation": "If a bodhisattva violates the pārājika precepts with increased afflictions, he'll lose the precepts of restraint and should accept them again.",
        "source": "T24n1503_001:1120a14_0"
    },
    {
        "source_sentence": "若中煩惱犯波羅夷處法者，當向三人若過三人長跪合掌，作突吉羅懺悔。",
        "translation": "If someone in the midst of affliction violates the pārājika precepts, they should kneel down to three people or more than three people with their palms joined and make a repentance of purgatory.",
        "source": "T24n1503_001:1120a15_1"
    },
    {
        "source_sentence": "所犯罪多，作是說言：『大德憶念！",
        "translation": "They committed many crimes and said, 'Remember, Mañjuśrī!'",
        "source": "T24n1503_001:1120a17_2"
    },
    {
        "source_sentence": "我某甲捨菩薩毘尼。』",
        "translation": "I, Mr. A., will abandon the bodhisattva's vinaya.'",
        "source": "T24n1503_001:1120a17_3"
    },
    {
        "source_sentence": "如所稱事，犯突吉羅罪。",
        "translation": "If they do so, they'll commit the sin of purgatory.",
        "source": "T24n1503_001:1120a18_4"
    },
    {
        "source_sentence": "餘如比丘突吉羅罪懺悔法說。",
        "translation": "The rest is as explained in the rules for repenting sins of monks and nuns.",
        "source": "T24n1503_001:1120a18_5"
    },
    {
        "source_sentence": "「若下煩惱犯波羅夷處法及餘所犯，向一人懺。」",
        "translation": "If someone undergoes the afflictions, violates the pārājika precepts, or commits any other offense, they'll repent to one person.",
        "source": "T24n1503_001:1120a20_0"
    },
    {
        "source_sentence": "三禮文。",
        "translation": "The text of the three rituals.",
        "source": "T24n1503_001:1120a21_1"
    },
    {
        "source_sentence": "「願十方法界世性六道，三業罪障垢惑眾生，崩顛倒山竭四流濟，登平等道入無為國。",
        "translation": "May the worldly nature of the six destinies in the ten directions, the three karmic hindrances of sin and affliction afflict sentient beings, crumble the perverted mountain that exhausts the four streams to rescue them, ascend the path of equality, and enter the state of nothingness.",
        "source": "T24n1503_001:1120a22_0"
    },
    {
        "source_sentence": "歸命敬禮七處八會盧舍那佛，盡十方國諸妙覺尊。",
        "translation": "He paid homage to the buddha Rocana Buddha in seven places and eight assemblies, and all the wonderfully enlightened honored ones of the ten directions.",
        "source": "T24n1503_001:1120a23_1"
    },
    {
        "source_sentence": "「願十方法界世性六道，沈淪諸有長沒眾生，摧破戒林殄滅邪照。",
        "translation": "May the worldly nature of the six destinies of the ten directions be destroyed, and sentient beings who are submerged in existence and long-abiding will destroy the forest of precepts and cease wrong illumination.",
        "source": "T24n1503_001:1120a26_0"
    },
    {
        "source_sentence": "歸命敬禮七處八會佛華嚴藏，盡十方國修多羅海。",
        "translation": "He paid homage to the Buddha's Flower Ornament Treasury in seven places and eight assemblies, reaching as far as the sea of sutras in the ten directions.",
        "source": "T24n1503_001:1120a27_1"
    },
    {
        "source_sentence": "「願十方法界世性六道，小心膠固顛倒眾生，頓絕偏照須證住想，永附大乘盡未來際。",
        "translation": "May the worldly nature of the six destinies of the ten dharmas be guarded against mistaken sentient beings who are firmly attached to the great vehicle for the rest of the future, and may they suddenly become free of partial illumination and realize the perception of abiding in it.",
        "source": "T24n1503_001:1120a28_2"
    },
    {
        "source_sentence": "歸命敬禮七處八會普賢眾等，盡十方國諸賢聖僧。",
        "translation": "They pay homage to the seven places and eight assemblies of Samantabhadra and so forth, all the good and noble saṃgha in the ten directions.",
        "source": "T24n1503_001:1120b01_3"
    },
    {
        "source_sentence": "「若欲發心去時當立五願：一者願令我早棄此身。",
        "translation": "“When you want to give rise to the intention to leave, you should make five vows: first, I wish to cause me to abandon this body soon.",
        "source": "T24n1503_001:1120b03_0"
    },
    {
        "source_sentence": "二者願師僧父母使不愁惱，令我身命疾至菩提。",
        "translation": "Second, I pray that my teachers, monks, parents, and other members of the sangha will not be grieved and cause me to reach enlightenment quickly in body and life.",
        "source": "T24n1503_001:1120b04_1"
    },
    {
        "source_sentence": "三者願至阿蘭若處行，若有虎狼惡毒虫獸來欲噉我，我不恐怖，猶如比丘得第三禪樂。",
        "translation": "Third, may you go to the forest and practice there. If any tiger, wolf, or vicious animal with poisonous insects comes along and wants to attack me, I am not afraid, just as a bhikṣu attains the bliss of the third meditative state of absorption.",
        "source": "T24n1503_001:1120b05_2"
    },
    {
        "source_sentence": "四者若我至阿蘭若處，若天雨風起，或有惡鬼毒龍來欲螫我，我心安隱亦不恐怖。",
        "translation": "Fourth, if I go to a place in Araṇya, or if the gods rain down and wind blows, or if bad spirits, poisonous dragons, or ghosts come and want to sting me, my mind will be peaceful and not fearful.",
        "source": "T24n1503_001:1120b07_3"
    },
    {
        "source_sentence": "猶如有人欲度大海，到水中央天忽風起，波浪甚大度者恐怖，天風即定，度到彼岸心大歡喜。",
        "translation": "It's like a person who wants to cross the great ocean and goes to the center of the water, but suddenly a wind rises in the sky and the waves are so great that they frighten him. The heavenly wind is concentration, and he crosses over to the other shore with great joy.",
        "source": "T24n1503_001:1120b09_4"
    },
    {
        "source_sentence": "願我亦爾，疾到菩提無上彼岸。",
        "translation": "May I also quickly reach enlightenment without rising to the other shore.",
        "source": "T24n1503_001:1120b11_5"
    },
    {
        "source_sentence": "五者願我到阿蘭若處，若當病時，願得諸天來至我所，教導我等使心不悔。",
        "translation": "Fifth, may I go to the place of a forest retreat. If you are ill with illness, may heavenly beings come to me and teach us so that we will not regret it.",
        "source": "T24n1503_001:1120b11_6"
    },
    {
        "source_sentence": "我復念言：『我此身中有四毒蛇同俱止中，猶如四蛇同共一窟。",
        "translation": "Again, I think, 'In this body of mine, there are four poisonous snakes in the same place as me, just like four snakes sharing the same cave.",
        "source": "T24n1503_001:1120b13_7"
    },
    {
        "source_sentence": "蛇欲出時，各相謂言我前去，諍窟不出死在窟中，猶瞋諍故四俱滅亡。",
        "translation": "When the snake was about to emerge, each said to the other, I'll go ahead, and the cowherd didn't leave the cave but died in the cave, just as if he were angry, so all four of them perished.",
        "source": "T24n1503_001:1120b15_0"
    },
    {
        "source_sentence": "我今身中有四毒蛇，鬪諍瞋恚在我身中。』",
        "translation": "Now, there are four poisonous snakes in my body, and fighting and anger are in my body.'",
        "source": "T24n1503_001:1120b16_1"
    },
    {
        "source_sentence": "作如是念，病得即除菩提心起，令心得安六識不亂，安心蘭若四行具足，安心禪定制伏六情。",
        "translation": "When he thinks thus, his illness and attainment are immediately removed from the mind of enlightenment, causing his mind to be peaceful in the six consciousnesses without disturbance, calming his mind with the four practices of prajñāpāramitā that are complete, calming his meditation, and subduing the six emotions.",
        "source": "T24n1503_001:1120b17_2"
    },
    {
        "source_sentence": "是第五願。",
        "translation": "This is the fifth vow.",
        "source": "T24n1503_001:1120b19_3"
    },
    {
        "source_sentence": "「發此願已禮四方佛，乃有十拜，作如是言：『諸佛世尊！",
        "translation": "Having made this vow, he bowed to the buddhas of the four directions with ten prostrations and said these words:",
        "source": "T24n1503_001:1120b19_4"
    },
    {
        "source_sentence": "哀愍我等、覆護我等，使我得無上道疾至菩提。",
        "translation": "They pity us and cover us so that we can attain the unsurpassed path and quickly reach enlightenment.",
        "source": "T24n1503_001:1120b21_5"
    },
    {
        "source_sentence": "我今懺悔。",
        "translation": "Now, I'll repent.",
        "source": "T24n1503_001:1120b22_6"
    },
    {
        "source_sentence": "我某甲，歸依佛、歸依法、歸依僧，十地菩薩、辟支、羅漢諸賢聖等。",
        "translation": "I, Mr. A., take refuge in the Buddha, the Dharma, the saṃgha, the tenth-stage bodhisattvas, pratyekabuddhas, arhats, good men and sages, and so forth.",
        "source": "T24n1503_001:1120b22_7"
    },
    {
        "source_sentence": "我從無數劫以來流轉生死，百生千生無量億生，或墮六趣受生異報，或作餓鬼畜生，受如此苦常不得樂。",
        "translation": "I've been transmigrating through birth and death for countless eons, a hundred births, a thousand births, measureless millions of births, or falling into the six destinies to receive different rewards from birth, or becoming a hungry ghost or animal, and suffering such pain and always not getting happiness.",
        "source": "T24n1503_001:1120b23_8"
    },
    {
        "source_sentence": "我自尋思過惑自纏，不覩聖道，障涅槃門、閉甘露戶，塞眾善道不聞正法，沈沒大海有如此苦罪。",
        "translation": "I myself investigate the faults and afflictions that are self-contained, don't seek the noble path, obstruct the gate to nirvāṇa, close the door of ambrosia, hinder the good path, and don't hear the right teaching, sinking into the ocean with such a painful offense.",
        "source": "T24n1503_001:1120b26_9"
    },
    {
        "source_sentence": "今悉懺悔五體投地。』",
        "translation": "Now, we'll all repent and throw our five bodies to the ground.'",
        "source": "T24n1503_001:1120b28_10"
    },
    {
        "source_sentence": "如此投地七遍亦然。",
        "translation": "It's likewise when he throws himself to the ground seven times.",
        "source": "T24n1503_001:1120b28_11"
    },
    {
        "source_sentence": "當投地時發如此言：『願去我身無量眾毒，拔出邪愚無量眾毒，拔出邪愚無量塵惑，心意清淨六念成就。",
        "translation": "When he throws himself to the ground, he says, 'May I be rid of measureless poison from my body, remove measureless poison from wickedness and delusion, remove measureless poison from wickedness and delusion, remove measureless defilement from wickedness and delusion, purify my mind with six moments of accomplishment.'",
        "source": "T24n1503_001:1120b29_12"
    },
    {
        "source_sentence": "使我到阿蘭若處，心無恐怖疾到菩提，開涅槃門啟甘露戶，塞地獄門閉三惡道，拔三毒根出三界網，得三樂證三果真，超生死危當得智慧，離最後身疾至菩提。』",
        "translation": "If I go to the forest, my mind isn't frightened and quickly reaches enlightenment, opens the gate of nirvāṇa, opens the door of ambrosia, closes the gate of hell, closes the three bad destinies, pulls out the three poisonous roots from the three worldly networks, attains the three pleasures, realizes the true nature of the three fruits,",
        "source": "T24n1503_001:1120c02_13"
    },
    {
        "source_sentence": "發此願已從地而起，禮十方佛訖竟，合掌立住心懷歡喜，作如是念：『我罪永除。』",
        "translation": "After making this vow, he rose from the earth, bowed to the buddhas of the ten directions, saluted them, joined his palms, stood there, rejoiced, and thought, 'My sins will be permanently removed.'",
        "source": "T24n1503_001:1120c06_14"
    },
    {
        "source_sentence": "「受繩床法四種：一者請佛；",
        "translation": "“There are four ways to receive a rope-bed:",
        "source": "T24n1503_001:1120c08_15"
    },
    {
        "source_sentence": "二者請師；",
        "translation": "The second is to invite a teacher.",
        "source": "T24n1503_001:1120c08_16"
    },
    {
        "source_sentence": "三脫革屣偏袒右肩清淨；",
        "translation": "The third is the purity of dismounting from the leather sandals and bare your right shoulder.",
        "source": "T24n1503_001:1120c09_0"
    },
    {
        "source_sentence": "四右膝著地胡跪佛前。",
        "translation": "Fourth, he knelt with his right knee on the ground and knelt down in front of the Buddha.",
        "source": "T24n1503_001:1120c09_1"
    },
    {
        "source_sentence": "請師作如是白：『十方諸佛及大迦葉，親於佛前受阿蘭若法，佛為作證明、師為作證知。",
        "translation": "He asked the master to make this kind of statement, saying, 'The buddhas in the ten directions and Mahākāśyapa personally accepted the teaching of the aāraṇḍika before the Buddha, so that the Buddha would prove it for him and the teacher would realize it for him.",
        "source": "T24n1503_001:1120c10_2"
    },
    {
        "source_sentence": "若我四十五日，行於苦行志不退轉，若生退心我即妄語，誑於諸天不到彼岸。",
        "translation": "If on the forty-fifth day I practice austerities and don't retreat, and if I give rise to a retreating mind, I'll speak falsely, pitying the gods who won't reach the other side.",
        "source": "T24n1503_001:1120c12_3"
    },
    {
        "source_sentence": "大德當證！』",
        "translation": "The great virtuous one will realize it!'",
        "source": "T24n1503_001:1120c13_4"
    },
    {
        "source_sentence": "請師復作是言：『長老一心念！",
        "translation": "He asked the teacher to again say, 'Elder, have one thought!'",
        "source": "T24n1503_001:1120c14_5"
    },
    {
        "source_sentence": "今於佛前發此誓言，請大德為證。』",
        "translation": "Now, I'll make this vow in front of the Buddha and ask the great virtuous one to realize it.'",
        "source": "T24n1503_001:1120c14_6"
    },
    {
        "source_sentence": "「『汝若退者誑於他人，自墮地獄不免苦也。",
        "translation": "'If you retreat and pity others, you'll fall into hell on your own and not escape suffering.",
        "source": "T24n1503_001:1120c15_7"
    },
    {
        "source_sentence": "汝當真成行阿蘭若行，得蘭若智。",
        "translation": "You must truly practice the practice of forest dwelling and attain the knowledge of forest dwelling.",
        "source": "T24n1503_001:1120c17_0"
    },
    {
        "source_sentence": "如是受持。』",
        "translation": "Thus, he receives and upholds it.'",
        "source": "T24n1503_001:1120c17_1"
    },
    {
        "source_sentence": "答言：『如是。』",
        "translation": "He replied, 'So it is.'",
        "source": "T24n1503_001:1120c18_2"
    },
    {
        "source_sentence": "三說。",
        "translation": "Three, it's explained.",
        "source": "T24n1503_001:1120c18_3"
    },
    {
        "source_sentence": "「受錫杖法。",
        "translation": "He received the teaching of the pewter staff.",
        "source": "T24n1503_001:1120c19_0"
    },
    {
        "source_sentence": "長跪大德前，如是三白：『大德一心念！",
        "translation": "Kneeling down long before the great virtuous one, he said these three things: 'The great virtuous one is mindful!'",
        "source": "T24n1503_001:1120c19_1"
    },
    {
        "source_sentence": "今請大德師。』",
        "translation": "Now, I'll invite the great virtuous teacher.'",
        "source": "T24n1503_001:1120c20_2"
    },
    {
        "source_sentence": "如是三白。",
        "translation": "These are the three kinds of white.",
        "source": "T24n1503_001:1120c20_3"
    },
    {
        "source_sentence": "大德作如是言：『長老一心念！",
        "translation": "The great virtuous man said, 'Elder, have one thought!'",
        "source": "T24n1503_001:1120c20_4"
    },
    {
        "source_sentence": "汝今發無上心，受持如法用。",
        "translation": "Now, you must give rise to the unsurpassed mind and accept and uphold it according to the teaching.",
        "source": "T24n1503_001:1120c21_5"
    },
    {
        "source_sentence": "不得不淨手捉入僧房，應當脫樓纂，不得近地。",
        "translation": "You must enter the monastery with your pure hands and don't touch the ground; you must leave the tower and not go near it.",
        "source": "T24n1503_001:1120c21_6"
    },
    {
        "source_sentence": "若入白衣舍，應纂在後。",
        "translation": "If he enters a white-robed dwelling, he should compile it at the back.",
        "source": "T24n1503_001:1120c23_0"
    },
    {
        "source_sentence": "若中前須詣白衣舍，或受中食，種種因緣當三喚，三若不來者乃至五，五若不來者乃至七。",
        "translation": "If someone goes to a white-robed dwelling before the midday and takes a midday meal, they'll be called three times for various reasons, three times when they don't come, up to five times, and five times when they don't come, up to seven times.",
        "source": "T24n1503_001:1120c23_1"
    },
    {
        "source_sentence": "七若不來更至餘家。",
        "translation": "7. If he doesn't come back, he goes to another house.",
        "source": "T24n1503_001:1120c25_2"
    },
    {
        "source_sentence": "乃至七家，七家不得。』",
        "translation": "Up to seven houses, seven houses won't get it.'",
        "source": "T24n1503_001:1120c26_3"
    },
    {
        "source_sentence": "於是中第二第三亦如是說。",
        "translation": "The second and third of these are likewise explained.",
        "source": "T24n1503_001:1120c26_4"
    },
    {
        "source_sentence": "「捨法戒。",
        "translation": "He renounces the precepts of the Dharma.",
        "source": "T24n1503_001:1120c28_0"
    },
    {
        "source_sentence": "「『長老一心念！",
        "translation": "'Elder, one thought!",
        "source": "T24n1503_001:1120c29_0"
    },
    {
        "source_sentence": "比丘某甲，優婆塞五戒威儀者，何緣而生日滿後不死，不墮地獄中間。",
        "translation": "What's the reason a certain monk, a layman with five precepts and authority, doesn't die after his birthday is over and doesn't fall into the middle of hell?",
        "source": "T24n1503_001:1120c29_1"
    },
    {
        "source_sentence": "白十方佛及大迦葉，皆當善聽。",
        "translation": "To the buddhas of the ten directions and Mahākāśyapa, listen attentively.",
        "source": "T24n1503_001:1121a01_2"
    },
    {
        "source_sentence": "某甲竪標如是。』",
        "translation": "I'll mark it like this.'",
        "source": "T24n1503_001:1121a02_3"
    },
    {
        "source_sentence": "三白已訖，捉標竪樹竟，復作如是白：『十方諸佛、四方淨行大德悉為證知：某不欺，誑於諸天，不到彼岸。",
        "translation": "After finishing these three statements, he grasped the mulberry tree and made another statement, saying, 'The buddhas of the ten directions and the great virtuous practitioners of pure practice in the four directions all know for themselves that I won't lie to the gods or go beyond the other shore.",
        "source": "T24n1503_001:1121a02_4"
    },
    {
        "source_sentence": "今齎法床及如法杖，悉皆具足。",
        "translation": "Now, he's carrying a Dharma bed and a Dharma staff, all fully equipped.",
        "source": "T24n1503_001:1121a05_5"
    },
    {
        "source_sentence": "今以結坐，一切行蘭若比丘亦皆結坐。』",
        "translation": "Now, because they're sitting cross-legged, all the monks who practice laṇḍa also sit cross-legged.'",
        "source": "T24n1503_001:1121a06_0"
    },
    {
        "source_sentence": "如是三白，作禮六拜，合掌一心如是念：『念十方諸佛及大迦葉！",
        "translation": "Thus, he made these three statements, bowed six prostrations, joined his palms together, and with one mind, he thought, 'Mindful of the buddhas in the ten directions and Mahākāśyapa!'",
        "source": "T24n1503_001:1121a06_1"
    },
    {
        "source_sentence": "比丘某甲，優婆塞某甲，眾念成就。",
        "translation": "A certain monk, a certain layman, and a certain layman have accomplished the accomplishment of many thoughts.",
        "source": "T24n1503_001:1121a08_2"
    },
    {
        "source_sentence": "今解坐向餘處還結。』",
        "translation": "Now, I'll untie my seat and return it to another place.'",
        "source": "T24n1503_001:1121a09_3"
    },
    {
        "source_sentence": "若欲捉繩床時，應作四念。",
        "translation": "When you want to grasp a rope bed, you should have four thoughts.",
        "source": "T24n1503_001:1121a09_4"
    },
    {
        "source_sentence": "第一念者，念我身中皆是無常，應當苦之。",
        "translation": "The first thought is to think that everything in my body is impermanent and should be painful.",
        "source": "T24n1503_001:1121a10_5"
    },
    {
        "source_sentence": "二者苦身修習空智自至，宜當修之。",
        "translation": "Second, the body of suffering cultivates the self-accomplishment of the knowledge of emptiness, which should be cultivated.",
        "source": "T24n1503_001:1121a11_6"
    },
    {
        "source_sentence": "三者當起忍心，莫生瞋怒。",
        "translation": "Third, the bhikṣu should generate a mind of forbearance and not become angry.",
        "source": "T24n1503_001:1121a12_7"
    },
    {
        "source_sentence": "四生歡喜心，若生歡喜心疾至菩提。",
        "translation": "The fourth gives rise to a joyous mind, and if he gives rise to a joyous mind, he'll quickly reach enlightenment.",
        "source": "T24n1503_001:1121a12_8"
    },
    {
        "source_sentence": "作此念已，向彼放牛虎狼、大聲小聲、婬聲及迫迮，悉皆遠離。",
        "translation": "After he had this thought, he pointed out to the other ox, tiger, wolf, large and small sounds, coarse sounds, and oppressive sounds, all far away.",
        "source": "T24n1503_001:1121a13_9"
    },
    {
        "source_sentence": "離此聲已安心端念。",
        "translation": "After he's free of this sound, he calms his mind with mindfulness.",
        "source": "T24n1503_001:1121a14_10"
    },
    {
        "source_sentence": "欲去諸塵時，當作二念言：『一者令我身中得安隱定，不生疲極疾到菩提。",
        "translation": "When they want to remove the dust, they should have two thoughts, saying, 'First, let me attain peaceful concentration in my body that doesn't give rise to fatigue and quickly reach enlightenment.",
        "source": "T24n1503_001:1121a15_11"
    },
    {
        "source_sentence": "二者當得閑靜心無錯亂，六識安隱得滅盡定。』",
        "translation": "Second, he'll attain a quiet mind without confusion, and the six consciousnesses will be peaceful and attain the concentration of cessation.'",
        "source": "T24n1503_001:1121a17_0"
    },
    {
        "source_sentence": "安詳放床，立住禮佛乃至十拜。",
        "translation": "He quietly set down his bed and stood up to pay homage to the Buddha for ten bows.",
        "source": "T24n1503_001:1121a18_1"
    },
    {
        "source_sentence": "立住合掌便作三念：一者念佛、二者念戒、三者念禪定。",
        "translation": "He then joined his palms and made three thoughts: first, mindfulness of the Buddha, second, mindfulness of precepts, and third, mindfulness of meditation.",
        "source": "T24n1503_001:1121a18_2"
    },
    {
        "source_sentence": "作此念已，便向繩床安詳而坐。",
        "translation": "After he had this thought, he went to the rope bed and sat quietly on it.",
        "source": "T24n1503_001:1121a20_0"
    },
    {
        "source_sentence": "復作六念：一者念諸佛護念我念成就。",
        "translation": "Again, he had six thoughts: first, mindfulness of the buddhas protecting self and accomplishing mindfulness.",
        "source": "T24n1503_001:1121a20_1"
    },
    {
        "source_sentence": "二者念我戒身清淨，戒者謂波羅提木叉，念者是名不犯。",
        "translation": "The second is that mindfulness of self and the body of precepts are purified by mindfulness of self, which is called prātimokṣa, and mindfulness is called non-violation.",
        "source": "T24n1503_001:1121a21_2"
    },
    {
        "source_sentence": "從序至偈四事思得至於十三，念此十三，成就二不定，三十、九十四波羅提舍尼、眾多學法、七滅諍法，從上至下皆應實念。",
        "translation": "From the preface to the verse, these four things can be thought of up to 13 times, and mindfulness of these 13 accomplishes two uncertainties, 30, 34 prātisāyanīyas, many ways to train, and seven ways to extinguish anger, from the top to the bottom, should all be truly thought of.",
        "source": "T24n1503_001:1121a22_3"
    },
    {
        "source_sentence": "三者念報父母師僧之恩。",
        "translation": "Three, he's mindful of the kindnesses of his parents, teachers, and saṃgha.",
        "source": "T24n1503_001:1121a25_4"
    },
    {
        "source_sentence": "四者念五欲皆是無常，大患之根本，昏網之元首。",
        "translation": "Fourth, mindfulness that the five desires are all impermanent is the root of great distress and the root of the web of ignorance.",
        "source": "T24n1503_001:1121a26_5"
    },
    {
        "source_sentence": "五者念地獄之苦惱，當勤修善遠離此苦。",
        "translation": "The fifth is to be mindful of the suffering and distress of hell, diligently cultivate goodness, and part with this suffering.",
        "source": "T24n1503_001:1121a27_6"
    },
    {
        "source_sentence": "我已出家，宜應謹慎棄惡修善。",
        "translation": "I have renounced the householder’s life. It is advisable for me to discard evil and practice what is wholesome.",
        "source": "T24n1503_001:1121a28_7"
    },
    {
        "source_sentence": "六者念慧，若我有慧則應憶持，慧具足無事不辦者，得無上道。",
        "translation": "Sixth, mindfulness of wisdom. If I have wisdom, then I should remember and retain it. Those who are endowed with wisdom without doing anything but do so will attain the unsurpassed path.",
        "source": "T24n1503_001:1121a29_0"
    },
    {
        "source_sentence": "六念具足安心而坐。",
        "translation": "Sixth, he's mindful, fully concentrated, and sits calmly.",
        "source": "T24n1503_001:1121b01_1"
    },
    {
        "source_sentence": "依禪法觀。",
        "translation": "He relies on meditation and Dharma contemplation.",
        "source": "T24n1503_001:1121b01_2"
    },
    {
        "source_sentence": "「優婆塞若欲移時，當作三念：一者念我行時，地上蠢蠢多有虫蟻，我若誤殺時得何罪、死者生天。",
        "translation": "When an upāsaka wants to move, he should think three things: first, when he's mindful of me walking, there are dumb insects and ants on the ground; what sin will I commit if I mistakenly kill them? The dead will be born in heaven.",
        "source": "T24n1503_001:1121b02_3"
    },
    {
        "source_sentence": "二者當念如法行，如法仰手捉杖在身，威儀齊整安詳而行。",
        "translation": "Second, they should be mindful of following the Dharma. They should follow the Dharma with their arms raised upward and holding a staff in their bodies, walking with proper demeanor and calmness.",
        "source": "T24n1503_001:1121b04_4"
    },
    {
        "source_sentence": "三者行不反顧，亦不搖頭動手。",
        "translation": "Third, the bhikṣu moves without turning his back or moving his head or hands.",
        "source": "T24n1503_001:1121b05_5"
    },
    {
        "source_sentence": "是名三念成就。",
        "translation": "These are called the accomplishment of the three kinds of mindfulness.",
        "source": "T24n1503_001:1121b06_6"
    },
    {
        "source_sentence": "「如法行來優婆塞，威儀篤信持食來時，當淨受之。",
        "translation": "When a layman who practices in accordance with the teaching and is imposingly faithful, he'll accept it purely when he comes along with food.",
        "source": "T24n1503_001:1121b06_7"
    },
    {
        "source_sentence": "受得訖已結加趺坐，復作四念：一者念我身中有八萬戶虫，虫得此食即皆安隱。",
        "translation": "After he had received it, he sat cross-legged and made another four thoughts: first, he thought of the 80,000 household worms in my body, and they all became peaceful when they got this food.",
        "source": "T24n1503_001:1121b07_8"
    },
    {
        "source_sentence": "二者念我得食當少食之，若少食者令我身輕，若身輕眾欲亦少，若欲少者疾至菩提。",
        "translation": "Second, he thinks of gaining food for himself and eating it sparingly. If he eats sparingly, this will make his body lighter; if his body is lighter, his desires are also fewer; and if his desires are fewer, he will quickly attain enlightenment.",
        "source": "T24n1503_001:1121b09_9"
    },
    {
        "source_sentence": "三者我不為美故，但為活命者，諸善成就；",
        "translation": "The third is that I do not strive for beauty but rather for the sake of living, accomplishing all good deeds.",
        "source": "T24n1503_001:1121b11_10"
    },
    {
        "source_sentence": "善若成就，成無上智。",
        "translation": "If they accomplish goodness, they'll attain unsurpassed cognition.",
        "source": "T24n1503_001:1121b12_11"
    },
    {
        "source_sentence": "四者我食時，十方餓者悉令飽滿，皆悉奉行。」",
        "translation": "Fourth, when I eat, I will satisfy the hungry people in the ten directions and serve them all.",
        "source": "T24n1503_001:1121b13_12"
    },
    {
        "source_sentence": "優婆塞五戒威儀經一卷",
        "translation": "Sutra of the Five Precepts for Upāsaka, One Fascicle",
        "source": "T24n1503_001:1121b15_0"
    }
]