[
    {
        "source_sentence": "寂調音所問經(一名如來所說清淨調伏)宋三藏法師法海奉　詔譯如是我聞：一時婆伽婆遊王舍城耆闍崛山，與大比丘僧八百人俱，菩薩摩訶薩萬二千人，及欲界色界淨居諸天子等。",
        "translation": "The Sutra of the Questions Asked by the Sound of Silent Meditation (a pure discipline taught by the Tathāgata) Song Dynasty Translated by the imperial edict of the Tripiṭaka Master Dharma海奉 Thus have I heard. At one time, Bhagavān was staying at Mount Gṛdhrakūṭa in Rājagṛha, accompanied by eight hundred great bhikṣus and",
        "source": "T24n1490_001:1081a15_0"
    },
    {
        "source_sentence": "爾時世尊與無量百千之眾恭敬圍遶而為說法。",
        "translation": "It was then that the Bhagavān and measureless hundreds of thousands of other people surrounded him with respect and preached the Dharma.",
        "source": "T24n1490_001:1081a20_1"
    },
    {
        "source_sentence": "爾時眾中有一天子，名寂調音，承佛威神從坐而起，偏袒右肩右膝著地，合掌向佛而白佛言：「世尊！",
        "translation": "At the time, there was a celestial being in the congregation named Silent Sound, who rose from his seat with the Buddha's authoritative power, bared his right shoulder, knelt with his right knee on the ground, joined his palms and faced the Buddha, said to him, Bhagavān!",
        "source": "T24n1490_001:1081a21_2"
    },
    {
        "source_sentence": "文殊師利法王子今在何所？",
        "translation": "Where is Mañjuśrī, the prince of the Dharma, now?",
        "source": "T24n1490_001:1081a24_3"
    },
    {
        "source_sentence": "此諸大眾為聞法故，渴仰欲得見彼賢士。」",
        "translation": "Because they heard the teaching, these people in the assembly longed to see that good man.",
        "source": "T24n1490_001:1081a24_4"
    },
    {
        "source_sentence": "爾時世尊告寂調音：「東方去此過萬佛土，有世界名曰寶住，佛號寶相如來、應供、正遍知，今現在。",
        "translation": "It was then that the Bhagavān addressed Jīvaka, Beyond these ten thousand buddha-lands in the east, there's a world named Jewel Abode, which is now present to the Tathāgata, Worthy of Offerings, and Perfectly Enlightened.",
        "source": "T24n1490_001:1081a25_5"
    },
    {
        "source_sentence": "文殊師利法王子為彼諸菩薩摩訶薩如應說法。」",
        "translation": "Mañjuśrī, the Dharma Prince Mañjuśrī, explains the teaching to those bodhisattvas and mahāsattvas as they should be taught.",
        "source": "T24n1490_001:1081a27_6"
    },
    {
        "source_sentence": "時寂調音天子白佛言：「世尊！",
        "translation": "The celestial son of Silent Sound then said to the Buddha, Bhagavān!",
        "source": "T24n1490_001:1081a28_7"
    },
    {
        "source_sentence": "願現微相，令彼賢士而來會此。",
        "translation": "May they show subtle signs and cause those good men to come here.",
        "source": "T24n1490_001:1081a29_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1490_001:1081b01_9"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T24n1490_001:1081b01_10"
    },
    {
        "source_sentence": "唯除如來，一切聲聞辟支佛，無能說法如彼文殊師利法王子者。",
        "translation": "Except for the Tathāgata, there are no śrāvakas or pratyekbuddhas who can teach the Dharma like Mañjuśrī, the Dharma prince of Mañjuśrī.",
        "source": "T24n1490_001:1081b01_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1490_001:1081b03_12"
    },
    {
        "source_sentence": "以世尊、文殊師利法王子說法力故魔不得便，令諸魔宮隱蔽不現，悉能降伏群邪異學，增上慢者離於慢心，未發菩提心者令其發心，已發心者得不退轉，可攝受者即便攝受，未任攝受方便調伏，令佛正法得久住世。」",
        "translation": "Because of the power of the teachings of the Bhagavān and Mañjuśrī, the prince of the Dharma taught by the Bhagavān and Mañjuśrī, Māra didn't get an advantage over them, caused the demonic palaces to be hidden and unmanifest, was able to subdue the many heretics who were arrogant and freed themselves from conceit, made those who hadn't yet developed",
        "source": "T24n1490_001:1081b03_13"
    },
    {
        "source_sentence": "爾時世尊受寂調音天子請已，於大丈夫白毫相中放一光明，此勝光明遍照三千大千世界，徹照萬佛剎已遍照寶住世界。",
        "translation": "After the Bhagavān had accepted the invitation of the goddess Silent Sound, the Bhagavān radiated a ray of light from the white-haired features of the great man, which shone brightly throughout 3,000 great one-thousand worlds and penetrated all the ten thousand buddha-lands that had already been illuminated by the jeweled abode world.",
        "source": "T24n1490_001:1081b08_14"
    },
    {
        "source_sentence": "彼諸菩薩摩訶薩見此光已，白寶相佛言：「是何瑞相，令此世界大光普照。」",
        "translation": "Seeing this light, those bodhisattvas and mahāsattvas said to the Buddha Jewel-Shaped Buddha, What's the sign of a great ray of light that causes this world to be universally illuminated?",
        "source": "T24n1490_001:1081b11_15"
    },
    {
        "source_sentence": "彼佛告言：「善男子等！",
        "translation": "The Buddha told them, Good sons!",
        "source": "T24n1490_001:1081b12_16"
    },
    {
        "source_sentence": "西方去此過萬佛土，有世界名曰娑婆，彼有如來名釋迦牟尼應供正遍知，今現在說法。",
        "translation": "In the west, beyond these ten thousand buddha-lands, there's a world named Sahā, where there's a Tathāgata named Śākyamuni Worthy of Offerings and Perfectly Enlightened One who teaches the Dharma now.",
        "source": "T24n1490_001:1081b13_17"
    },
    {
        "source_sentence": "是彼如來所放白毫相光，此光徹過萬佛剎已來照此世界。」",
        "translation": "It's the white-haired ray of light emanated by that Tathāgata, and this light has illuminated this world since it penetrated more than ten thousand buddha-lands.",
        "source": "T24n1490_001:1081b15_18"
    },
    {
        "source_sentence": "彼諸菩薩白其佛言：「釋迦牟尼如來以何緣故放此光明？」",
        "translation": "The bodhisattvas said to the Buddha, For what reason does the Tathāgata Śākyamuni give this light?",
        "source": "T24n1490_001:1081b16_19"
    },
    {
        "source_sentence": "彼佛告大眾言：「善男子等！",
        "translation": "The Buddha told the crowd, Good men!",
        "source": "T24n1490_001:1081b17_20"
    },
    {
        "source_sentence": "釋迦如來與無量百千億菩薩、釋梵護世、比丘、比丘尼、優婆塞、優婆夷眾，為聽法故渴仰欲見文殊師利聞其說法，是故彼佛放此光明。」",
        "translation": "The Śākyamuni Tathāgata and measureless hundreds of thousands of billions of bodhisattvas, the Śa Brahma world protectors, monks, bhikṣus, bhikṣuṇīs, laymen, and laymen who long to see Mañjuśrī hear his teaching for the sake of hearing it, so that's why that Buddha radiates this light.",
        "source": "T24n1490_001:1081b18_21"
    },
    {
        "source_sentence": "爾時寶相如來、應、正遍知告文殊師利法王子言：「善男子！",
        "translation": "It was then that the Jeweled Form Tathāgata, Worthy of Offerings, and Perfectly Enlightened One addressed Mañjuśrī the Dharma Prince, saying, Good man!",
        "source": "T24n1490_001:1081b21_22"
    },
    {
        "source_sentence": "汝詣娑婆世界。",
        "translation": "Go to the sahā world.",
        "source": "T24n1490_001:1081b22_23"
    },
    {
        "source_sentence": "彼釋迦牟尼如來及諸大眾，遲欲見汝聞所說法。」",
        "translation": "That Śākyamuni Tathāgata and the masses of people rarely want to see you hear what he teaches.",
        "source": "T24n1490_001:1081b23_24"
    },
    {
        "source_sentence": "時文殊師利白彼佛言：「唯然世尊！",
        "translation": "Mañjuśrī then said to the Buddha, Yes, Bhagavān!",
        "source": "T24n1490_001:1081b24_25"
    },
    {
        "source_sentence": "已見光明。」",
        "translation": "I've seen the light.",
        "source": "T24n1490_001:1081b25_26"
    },
    {
        "source_sentence": "時文殊師利法王子即與萬菩薩俱，頂禮彼佛右遶三匝已，猶如力士屈申臂頃，與萬菩薩於彼世界忽然不現，至娑婆界住於空中，為供佛故即雨第一淨花，其花香氣普遍大眾，積至于膝。",
        "translation": "The Dharma prince Mañjuśrī then, accompanied by the ten thousand bodhisattvas, bowed his head to the Buddha and circumambulated him three times to his right, just as if he were a strong man flexing his armpits, and with the ten thousand bodhisattvas suddenly disappeared from that world. They went up into the sky in the realm of sahā and rained down the first pure flower",
        "source": "T24n1490_001:1081b25_27"
    },
    {
        "source_sentence": "是時大眾怪未曾有，而白佛言：「世尊！",
        "translation": "The crowd wondered at this unprecedented thing and said to the Buddha, Bhagavān!",
        "source": "T24n1490_001:1081b29_28"
    },
    {
        "source_sentence": "是誰神力雨此妙花」佛告大眾：「此是文殊師利法王子與萬菩薩，從寶住世界來至娑婆，為供佛故於上空中雨此妙花」寂調音天子白佛言：「世尊！",
        "translation": "Who is it that rains this marvelous flower with supernormal powers? the Buddha told the crowd, This is Mañjuśrī, the prince of the Dharma and myriad bodhisattvas, who came from the jeweled abode world to sahā for the sake of making offerings to the Buddha by raining this marvelous flower in the sky above.",
        "source": "T24n1490_001:1081c01_29"
    },
    {
        "source_sentence": "願樂欲見文殊師利及彼菩薩摩訶薩眾。",
        "translation": "May they wish to see Mañjuśrī and the other bodhisattvas, mahāsattvas, and others.",
        "source": "T24n1490_001:1081c04_30"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T24n1490_001:1081c05_31"
    },
    {
        "source_sentence": "彼善丈夫是無救者救。」",
        "translation": "That good man is the rescue of those who lack salvation.",
        "source": "T24n1490_001:1081c05_32"
    },
    {
        "source_sentence": "作是語已，即時文殊師利法王子與萬菩薩從上空中忽然而下，頂禮佛足遶七匝已，文殊師利即坐己力所化蓮花師子座上，及萬菩薩亦頂禮佛足右遶七匝，於世尊前合掌向佛而作是言：「世尊！",
        "translation": "After he had said this, Mañjuśrī the Dharma Prince and myriad bodhisattvas suddenly descended from the sky above them, bowed their heads at the Buddha's feet seven times, sat on the lotus-flower lion throne transformed by their own power, and myriad bodhisattvas bowed their heads at the Buddha's feet seven times to his right, joined their palms in front of",
        "source": "T24n1490_001:1081c06_33"
    },
    {
        "source_sentence": "寶相如來、應、正遍知敬問世尊：少病少惱氣力康耶？」",
        "translation": "The Tathāgata of Jeweled Characteristics, Arhat, and Perfectly Enlightened One respectfully asked the Bhagavān, Is he well with few illnesses and few afflictions?",
        "source": "T24n1490_001:1081c11_0"
    },
    {
        "source_sentence": "時彼菩薩作是語已，各坐己力所化座上。",
        "translation": "After he said these words, the bodhisattvas each sat on a seat transformed by their own power.",
        "source": "T24n1490_001:1081c12_1"
    },
    {
        "source_sentence": "是時寂調音天子白佛言：「世尊！",
        "translation": "The celestial son of Silent Sound then said to the Buddha, Bhagavān!",
        "source": "T24n1490_001:1081c13_2"
    },
    {
        "source_sentence": "今此大眾渴仰欲聞文殊師利法王子所說妙法。",
        "translation": "Now, this great multitude of people long to hear the marvelous teaching taught by Mañjuśrī, the prince of the Dharma.",
        "source": "T24n1490_001:1081c13_3"
    },
    {
        "source_sentence": "唯願世尊聽我少問。」",
        "translation": "Please, Bhagavān, listen to me as I ask a few questions.",
        "source": "T24n1490_001:1081c15_0"
    },
    {
        "source_sentence": "佛告天子：「有所疑者，恣聽汝問。」",
        "translation": "The Buddha told the celestial son, If you have doubts, listen freely to your questions.",
        "source": "T24n1490_001:1081c15_1"
    },
    {
        "source_sentence": "時寂調音天子以恭敬心向文殊師利作是問言：「寶相如來世界以何說法？",
        "translation": "With respect to Mañjuśrī, the celestial son of silent and harmonious voice then asked Mañjuśrī, What's the way to teach the Dharma in the world of the jeweled-character Tathāgata?",
        "source": "T24n1490_001:1081c16_2"
    },
    {
        "source_sentence": "仁者樂彼。」",
        "translation": "That's a kind person who enjoys them.",
        "source": "T24n1490_001:1081c17_3"
    },
    {
        "source_sentence": "文殊師利言：「天子！",
        "translation": "Mañjuśrī said, My lord!",
        "source": "T24n1490_001:1081c18_4"
    },
    {
        "source_sentence": "彼所說法，不為生貪欲故、不為盡貪欲故，不為生瞋恚故、不為盡瞋恚故，不為生愚癡故、不為盡愚癡故，不為生煩惱故、不為盡煩惱故。",
        "translation": "It's because they don't give rise to craving and don't end craving, don't give rise to anger and don't end anger, don't give rise to delusion and don't end delusion, and don't give rise to afflictions and don't end afflictions.",
        "source": "T24n1490_001:1081c18_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1490_001:1081c21_6"
    },
    {
        "source_sentence": "夫法無生則無有盡。」",
        "translation": "If dharmas are unarisen, then there's no end.",
        "source": "T24n1490_001:1081c22_7"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1081c22_8"
    },
    {
        "source_sentence": "彼土眾生無貪欲等諸結使生與滅耶？」",
        "translation": "Are the sentient beings in those lands free of the bonds of desire and so forth that cause birth and cessation?",
        "source": "T24n1490_001:1081c22_9"
    },
    {
        "source_sentence": "文殊師利言：「如是。」",
        "translation": "Mañjuśrī said, So it is.",
        "source": "T24n1490_001:1081c23_10"
    },
    {
        "source_sentence": "天子言：「若如是者，彼佛說法為何所斷？」",
        "translation": "The celestial son said, If that's the case, what is stopped by that Buddha teaching?",
        "source": "T24n1490_001:1081c24_11"
    },
    {
        "source_sentence": "文殊師利言：「法本無生，為何所盡？",
        "translation": "Mañjuśrī said, The Dharma originally has no arising, so why is it exhausted?",
        "source": "T24n1490_001:1081c25_12"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1490_001:1081c25_13"
    },
    {
        "source_sentence": "彼佛世界眾生無知無斷、無修無證。",
        "translation": "Those sentient beings in the Buddha's world have no knowledge, no cessation, no cultivation, and no realization.",
        "source": "T24n1490_001:1081c26_14"
    },
    {
        "source_sentence": "彼界眾生貴第一義諦，不貴方便諦。」",
        "translation": "Those sentient beings in that realm value the ultimate truth and not the truth of skillful means.",
        "source": "T24n1490_001:1081c26_15"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1081c27_16"
    },
    {
        "source_sentence": "何者第一義諦？",
        "translation": "What's the ultimate truth?",
        "source": "T24n1490_001:1081c28_17"
    },
    {
        "source_sentence": "何者方便諦？」",
        "translation": "What's the truth of skillful means?",
        "source": "T24n1490_001:1081c28_18"
    },
    {
        "source_sentence": "文殊師利言：「天子！",
        "translation": "Mañjuśrī said, My lord!",
        "source": "T24n1490_001:1081c28_19"
    },
    {
        "source_sentence": "義者不以生故得稱、不以壞故得稱，無處所相無非處相、非一相非無相、無影響相、不可相非不可相、不可盡非不可盡、非墮落非不墮落，是名第一義諦。",
        "translation": "The meaning is that it can't be called because of arising and not because of disintegration, has neither place nor non-place characteristics, doesn't have one characteristic nor no characteristic, has no influenced characteristic, has neither characteristic nor non-character, doesn't become inexhaustible or inexhaustible, doesn't fall or don't fall, and is called the",
        "source": "T24n1490_001:1081c29_20"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T24n1490_001:1082a04_0"
    },
    {
        "source_sentence": "義者無心無心相續、非跡非不跡、非此岸非彼岸非中流，是名第一義諦。",
        "translation": "The meaning is that there's no mind and no mental continuity, neither traces nor non-tracts, neither this shore nor the other shore, and neither midstream, which is called the cardinal truth.",
        "source": "T24n1490_001:1082a04_1"
    },
    {
        "source_sentence": "無名稱無文字處，是名第一義。",
        "translation": "The absence of names and the absence of words is called the first meaning.",
        "source": "T24n1490_001:1082a05_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1490_001:1082a06_3"
    },
    {
        "source_sentence": "世尊說一切音聲悉皆虛妄。」",
        "translation": "The Bhagavān teaches that all sounds are completely false.",
        "source": "T24n1490_001:1082a06_4"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1082a07_5"
    },
    {
        "source_sentence": "世尊所說亦盡虛妄耶？」",
        "translation": "Is what the Bhagavān teaches completely false?",
        "source": "T24n1490_001:1082a07_6"
    },
    {
        "source_sentence": "文殊師利言：「世尊不說實不說虛妄。",
        "translation": "Mañjuśrī said, Bhagavān, the Bhagavān doesn't say what's real and doesn't say what's false.",
        "source": "T24n1490_001:1082a08_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1490_001:1082a09_8"
    },
    {
        "source_sentence": "世尊住離二邊離心意言，說於有為無為法中，不說實不說虛，是故無二。",
        "translation": "The World-honoured One abides in nonduality, being free from the two extremes. He does not speak of conditioned or unconditioned factors as real and he does not speak of them as false. That is why they are nondual.",
        "source": "T24n1490_001:1082a09_9"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T24n1490_001:1082a11_10"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T24n1490_001:1082a11_11"
    },
    {
        "source_sentence": "如來所化化人若有所說，為實為虛？」",
        "translation": "If the Tathāgata teaches and transforms people, is anything he teaches true or false?",
        "source": "T24n1490_001:1082a11_12"
    },
    {
        "source_sentence": "天子言：「二俱無也。",
        "translation": "The celestial prince said, Neither is there.",
        "source": "T24n1490_001:1082a12_13"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1490_001:1082a12_14"
    },
    {
        "source_sentence": "如來所化化人，無身無成就。」",
        "translation": "The Tathāgata transforms people without a body or accomplishment.",
        "source": "T24n1490_001:1082a13_15"
    },
    {
        "source_sentence": "文殊師利言：「如是天子！",
        "translation": "Mañjuśrī said, So it is, my lord!",
        "source": "T24n1490_001:1082a13_16"
    },
    {
        "source_sentence": "如來說一切法同於化性，不說實不說虛，是故無二。」",
        "translation": "The Tathāgata teaches that all dharmas are the same as the nature of transformation, and they aren't described as real or false; therefore, there are no two.",
        "source": "T24n1490_001:1082a14_17"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1082a15_18"
    },
    {
        "source_sentence": "如來云何說第一義諦？」",
        "translation": "How does the Tathāgata explain the ultimate truth?",
        "source": "T24n1490_001:1082a16_0"
    },
    {
        "source_sentence": "文殊師利言：「天子！",
        "translation": "Mañjuśrī said, My lord!",
        "source": "T24n1490_001:1082a16_1"
    },
    {
        "source_sentence": "第一義諦不可言說。",
        "translation": "The ultimate truth cannot be explained in words.",
        "source": "T24n1490_001:1082a16_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1490_001:1082a17_3"
    },
    {
        "source_sentence": "不可言說。",
        "translation": "It can't be explained in words.",
        "source": "T24n1490_001:1082a17_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1490_001:1082a17_5"
    },
    {
        "source_sentence": "不可喻、不可說、不可名，是名第一義諦。」",
        "translation": "To be incapable of metaphor, incapable of explanation, and incapable of name is called the cardinal truth.",
        "source": "T24n1490_001:1082a18_0"
    },
    {
        "source_sentence": "說此第一義諦時，五百比丘遠塵離垢，於諸法中得法眼淨；",
        "translation": "When this ultimate truth of meaning was taught, the five hundred bhikṣus were far removed from defilement and attained purity of the Dharma eye in all doctrines.",
        "source": "T24n1490_001:1082a18_1"
    },
    {
        "source_sentence": "二百天子得無生法忍。",
        "translation": "Two hundred celestial beings attain the forbearance of the nonarising of the Dharma.",
        "source": "T24n1490_001:1082a20_2"
    },
    {
        "source_sentence": "寂調音天子復問文殊師利：「第一義者難可究盡。」",
        "translation": "The celestial son of Silent Sound Again asked Mañjuśrī, It's difficult to fathom the ultimate truth.",
        "source": "T24n1490_001:1082a21_0"
    },
    {
        "source_sentence": "文殊師利言：「如是天子！",
        "translation": "Mañjuśrī said, So it is, my lord!",
        "source": "T24n1490_001:1082a22_1"
    },
    {
        "source_sentence": "第一義諦，不正精進者難可究盡。」",
        "translation": "The ultimate truth is difficult to fathom if someone doesn't correctly exert effort.",
        "source": "T24n1490_001:1082a22_2"
    },
    {
        "source_sentence": "天子言：「云何菩薩正精進耶？」",
        "translation": "The celestial prince said, What is a bodhisattva's correct effort?",
        "source": "T24n1490_001:1082a23_3"
    },
    {
        "source_sentence": "文殊師利言：「若菩薩不為知、不為斷、不為修、不為證而精進者，是名正精進。",
        "translation": "Mañjuśrī said, If a bodhisattva doesn't make effort without knowing, stopping, cultivating, and realizing it, this is called right effort.",
        "source": "T24n1490_001:1082a24_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1490_001:1082a25_5"
    },
    {
        "source_sentence": "若謂此應知、此應斷、此應修、此應證者，此則有相、此則取著、此則戲論、此則有作。",
        "translation": "If someone says this should be known, this should be stopped, this should be cultivated, and this should be realized, then this has characteristics, this is attachment, this is conceptual elaboration, and this is action.",
        "source": "T24n1490_001:1082a26_0"
    },
    {
        "source_sentence": "若如是行，不名正精進。」",
        "translation": "If someone does so, they won't be called right effort.",
        "source": "T24n1490_001:1082a27_1"
    },
    {
        "source_sentence": "天子言：「若如是者，復云何名正精進耶？」",
        "translation": "The celestial son said, If that's the case, then how is it called right effort?",
        "source": "T24n1490_001:1082a28_2"
    },
    {
        "source_sentence": "文殊師利言：「如如等、法界等，即與無聞等。",
        "translation": "Mañjuśrī said, Like thusness and so forth, the Dharma realm and so forth are the same as having no hearing and so forth.",
        "source": "T24n1490_001:1082a29_3"
    },
    {
        "source_sentence": "如如等、法界等，即與見等。",
        "translation": "Such as thusness and so forth, the Dharma realm and so forth, which are views and so forth.",
        "source": "T24n1490_001:1082b01_4"
    },
    {
        "source_sentence": "凡夫法等、學法無學法、聲聞法、緣覺法、菩薩法、佛法等，即諸行等、涅槃等、垢等淨等。",
        "translation": "Ordinary dharmas and so forth, training dharmas, post-learning dharmas, śrāvaka dharmas, pratyekabuddha dharmas, bodhisattva dharmas, buddha dharmas, and so forth are the practices and so forth, nirvāṇa and so forth, defilement and so forth, and purity and so forth.",
        "source": "T24n1490_001:1082b01_5"
    },
    {
        "source_sentence": "如是平等精進者，名正精進。」",
        "translation": "Such equal effort is called right effort.",
        "source": "T24n1490_001:1082b03_6"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1082b04_7"
    },
    {
        "source_sentence": "何等如與垢淨等？」",
        "translation": "What are they like, such as dirt and purity?",
        "source": "T24n1490_001:1082b04_8"
    },
    {
        "source_sentence": "文殊師利言：「空、無相、無願如。",
        "translation": "Mañjuśrī said, Emptiness, signlessness, and wishlessness are thus.",
        "source": "T24n1490_001:1082b05_9"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1490_001:1082b05_10"
    },
    {
        "source_sentence": "涅槃空故。",
        "translation": "It's because nirvāṇa is empty.",
        "source": "T24n1490_001:1082b06_11"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T24n1490_001:1082b06_12"
    },
    {
        "source_sentence": "如瓦器中空、寶器中空，無二無別。",
        "translation": "It's like emptiness in a tile vessel and emptiness in a jeweled vessel, which are neither two nor distinct.",
        "source": "T24n1490_001:1082b06_13"
    },
    {
        "source_sentence": "如是天子！",
        "translation": "So it is, my lord!",
        "source": "T24n1490_001:1082b07_14"
    },
    {
        "source_sentence": "垢空淨空俱同一空，無二無別。」",
        "translation": "Both defiled emptiness and pure emptiness are the same as emptiness, without duality or distinction.",
        "source": "T24n1490_001:1082b07_15"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1082b08_16"
    },
    {
        "source_sentence": "菩薩於諸聖諦應精進不？」",
        "translation": "Do bodhisattvas should exert effort in the noble truths?",
        "source": "T24n1490_001:1082b08_17"
    },
    {
        "source_sentence": "文殊師利言：「天子！",
        "translation": "Mañjuśrī said, My lord!",
        "source": "T24n1490_001:1082b09_18"
    },
    {
        "source_sentence": "若菩薩不於諸諦起精進者，云何當為聲聞說法？",
        "translation": "If a bodhisattva doesn't make effort in regard to the truths, how will he teach the Dharma for śrāvakas?",
        "source": "T24n1490_001:1082b09_19"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1490_001:1082b10_20"
    },
    {
        "source_sentence": "菩薩修諦必有所為，聲聞修諦則無所為。",
        "translation": "A bodhisattva cultivates the truth that there must be something, but a śrāvaka cultivates the truth that there's nothing.",
        "source": "T24n1490_001:1082b10_21"
    },
    {
        "source_sentence": "菩薩修諦有善方便，聲聞修諦無善方便。",
        "translation": "Bodhisattvas cultivate the truth with good skillful means, but śrāvakas cultivate the truth without good skillful means.",
        "source": "T24n1490_001:1082b11_22"
    },
    {
        "source_sentence": "菩薩修諦有所觀察，聲聞修諦無所觀察。",
        "translation": "A bodhisattva cultivates the truth and observes it, but a śrāvaka cultivates the truth and observes nothing.",
        "source": "T24n1490_001:1082b12_23"
    },
    {
        "source_sentence": "菩薩修諦為一切眾生而不證實際；",
        "translation": "Enlightening beings cultivate truth for the sake of all sentient beings, yet they do not realize reality.",
        "source": "T24n1490_001:1082b13_24"
    },
    {
        "source_sentence": "菩薩修諦方便堅固而不捨生死及涅槃門；",
        "translation": "Enlightening beings cultivate the means of truth and are steadfast without abandoning the paths of birth and death or nirvana.",
        "source": "T24n1490_001:1082b14_25"
    },
    {
        "source_sentence": "菩薩修諦為一切佛法故。",
        "translation": "It's because the bodhisattva cultivates the truth for all the buddha-teachings.",
        "source": "T24n1490_001:1082b15_26"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T24n1490_001:1082b16_27"
    },
    {
        "source_sentence": "喻如有人離大商主獨度曠野，心懷驚怖劣乃得過。",
        "translation": "It's a metaphor for someone who leaves the great merchant lord and goes alone into the wilderness, but their mind is frightened and they attain error.",
        "source": "T24n1490_001:1082b16_28"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T24n1490_001:1082b17_29"
    },
    {
        "source_sentence": "聲聞之人亦復如是，畏懼生死心懷驚怖，於此世界無有還心，亦復無有為眾生心觀生死曠遠，於諸佛法無有方便，獨一無二而修諸諦。",
        "translation": "Similarly, śrāvakas are frightened by fear of birth and death, harbor fear in their minds, have no thoughts of returning to this world, don't have thoughts of contemplation of birth and death as distant in the minds of conditioned sentient beings, don't have skillful means for the Buddha's teachings, and cultivate the truths alone.",
        "source": "T24n1490_001:1082b17_30"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T24n1490_001:1082b20_31"
    },
    {
        "source_sentence": "如彼商主多諸財寶資產豐實，度曠野已廣利眾生。",
        "translation": "Suppose that merchant owner has a large amount of wealth and possessions, abundant in property, and liberated from the wilderness to widely benefit sentient beings.",
        "source": "T24n1490_001:1082b20_32"
    },
    {
        "source_sentence": "如是天子！",
        "translation": "So it is, my lord!",
        "source": "T24n1490_001:1082b21_33"
    },
    {
        "source_sentence": "菩薩之人如大商主，具足大慈大悲，成就法利具於寂滅，善御巧便調伏資產，乘六度船、執四攝弓箭成就方便，為於佛法而修諸諦。",
        "translation": "Suppose a bodhisattva is like a great merchant lord who possesses great kindness and compassion, accomplishes the benefits of the Dharma and fulfills tranquility, skillfully tames his assets, rides the boat of the six perfections, carries the four gathering bows and arrows, accomplishes skillful means, cultivates the truths for the sake of the Buddha's teachings, and cultivates the",
        "source": "T24n1490_001:1082b22_34"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T24n1490_001:1082b25_35"
    },
    {
        "source_sentence": "喻如狗皮，以須漫瞻蔔婆師迦而用熏之，雖變為香，一切人天所不愛樂。",
        "translation": "It's like the metaphor of a dog skin that's perfumed with śāman campaka and turned into an odor that all humans and gods don't like.",
        "source": "T24n1490_001:1082b25_36"
    },
    {
        "source_sentence": "聲聞修諦亦復如是，願不滿足中般涅槃，不能出生多聞、定、慧、解脫、知見之香，亦不能斷依煩惱習緒，不為人天之所愛樂。",
        "translation": "Similarly, śrāvakas cultivate the truth because they don't fulfill their vow to attain parinirvāṇa in the interim, won't produce the fragrance of well-versedness, concentration, wisdom, liberation, and knowing and seeing, won't be able to stop the habituated tendencies of affliction that are based on afflictions, and won't be loved by humans and gods.",
        "source": "T24n1490_001:1082b26_37"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T24n1490_001:1082b29_38"
    },
    {
        "source_sentence": "喻如天迦尸迦衣，以多竭流阿竭流旃檀婆師迦等百千種淨香常以熏之，一切人天之所愛樂。",
        "translation": "It's a metaphor like the heavenly Kāśika robe, which is always perfumed with a hundred thousand kinds of pure fragrance such as tathāgata-fumikā and a hundred thousand other kinds of pure fragrances that are loved by all humans and gods.",
        "source": "T24n1490_001:1082b29_39"
    },
    {
        "source_sentence": "菩薩亦復如是，於百千億那由他阿僧祇劫，以修諦法而自熏修，於其中間不般涅槃，諸願滿足，廣能出生無上淨香多聞、定、慧、解脫、知見功德之香，斷依煩惱習緒，一切人天阿修羅等之所愛樂。」",
        "translation": "Similarly, bodhisattvas permeate themselves with the cultivation of the truths for hundreds of thousands of millions of koṭis of nayutas of incalculable eons, don't enter parinirvāṇa in between, fulfill their vows, produce extensively the unsurpassed pure fragrance of wisdom, concentration, wisdom, liberation, and the fragrance of knowledge and virtue, cut off the accumula",
        "source": "T24n1490_001:1082c03_40"
    },
    {
        "source_sentence": "寂調音天子復謂文殊師利法王子言：「文殊師利！",
        "translation": "The silent and harmonious celestial son again addressed Mañjuśrī, the prince of the Dharma, saying, Mañjuśrī!",
        "source": "T24n1490_001:1082c08_0"
    },
    {
        "source_sentence": "彼寶相如來世界諸聲聞眾德行云何？",
        "translation": "What's the virtuous conduct of the śrāvakas in that jeweled-form tathāgata world?",
        "source": "T24n1490_001:1082c09_1"
    },
    {
        "source_sentence": "仁能與其俱共樂彼。」",
        "translation": "You're kind enough to share their happiness with them.",
        "source": "T24n1490_001:1082c10_0"
    },
    {
        "source_sentence": "文殊師利言：「彼聲聞眾非堅信非不隨他信、非堅法非異法界、非八人而度八邪、非須陀洹而離一切惡道畏、非斯陀含為化眾生示有去來、非阿那含去至過去一切法中、非阿羅漢應受三千世界利養實、非聲聞而能解了諸佛所說，不離欲染然復不為欲火所熱，於取著處離諸希望；",
        "translation": "Mañjuśrī said: Those śrāvakas do not have firm faith; they do not follow the faith of others; they do not have firm doctrine; they do not differ from the realm of reality; they do not liberate eight kinds of wickedness by means of eight people; they do not leave all the fears of woeful states in stream-enterers’ minds and bodies; they do not show",
        "source": "T24n1490_001:1082c10_1"
    },
    {
        "source_sentence": "不離瞋恚不為恚惱所惱，於一切眾生不起恚礙；",
        "translation": "They are not free from anger and resentment, they are not tormented by hatred. They do not give rise to disputes or barriers among all sentient beings.",
        "source": "T24n1490_001:1082c17_2"
    },
    {
        "source_sentence": "不離愚癡不為愚癡所蔽，於一切法離諸暗冥；",
        "translation": "They do not belong to ignorance and are not hindered by ignorance. They are free from the darkness of all things.",
        "source": "T24n1490_001:1082c18_3"
    },
    {
        "source_sentence": "不離煩惱勤為眾生斷諸煩惱。",
        "translation": "He doesn't part with the afflictions and diligently stops the afflictions for sentient beings.",
        "source": "T24n1490_001:1082c19_4"
    },
    {
        "source_sentence": "未昇決定而不受生，化度眾生而無我相，無所受取而畢報施恩，無恩無念而修諸念處，無生無滅而修諸正勤，離於身心而起諸神足，為滿足一切眾生神通故而修諸通，為增長一切眾生根故而修諸根，為摧滅一切煩惱故而修諸力，為覺了平等智故而修諸覺，為度一切邪徑故而修諸道，為得道故而證無為，為入實際故而修於通，為入法界故而起知見，為盡無明故而起於明，為離二邊故而修解脫。",
        "translation": "They cultivate right effort without arising or ceasing, they develop miraculous abilities apart from body and mind; they develop spiritual powers in order to fulfill the spiritual capacities of all sentient beings; they develop faculties in order to increase the faculties of all sentient beings; they develop faculties in order to extinguish all afflictions; they develop powers in order to eliminate all afflictions;",
        "source": "T24n1490_001:1082c20_0"
    },
    {
        "source_sentence": "能以肉眼悉見諸佛及世界世界眾生，以天眼見一切眾生生死，以慧眼領知一切眾生心行，以法眼見諸法平等、觀三世一切眾生平等，以佛眼照明佛法。",
        "translation": "They can see all buddhas and sentient beings in worlds with their physical eyes, see the births and deaths of all sentient beings with their divine eyes, know the minds and actions of all sentient beings with their eye of wisdom, see the equality of all dharmas with the Dharma eye, observe the equality of all sentient beings in the three times with the Dharma eye, illuminate the Buddha's",
        "source": "T24n1490_001:1082c29_1"
    },
    {
        "source_sentence": "以天耳解一切佛所說，以一心知一切眾生心行，以憶念智念過去劫際，以神足過無邊佛剎，諸漏已盡而於無生心得解脫。",
        "translation": "With the divine ear they understand what all buddhas teach; with one mind they know the mental patterns of all sentient beings; by recollection and knowledge they remember past eons; with spiritual powers they go beyond boundless buddha-lands; having extinguished their contaminants, they are liberated in the uncreated state of mind.",
        "source": "T24n1490_001:1083a03_2"
    },
    {
        "source_sentence": "雖復可見而不成就色身，雖有文字而無言說，心不思議言辭無礙，顏色端嚴善可樂見，具諸相好功德莊嚴，威德難視名聞高遠，體具稱譽世法不染，不為眾惱所惱、不為惡言所污，遊戲諸通多聞應辯，智見誦悅滅暗冥黑，熾然智慧說法無礙，深入總持諸佛顧念。",
        "translation": "Even though it can be seen, it doesn't develop a form body, even though it has words and no words, its mind isn't unobstructed in speech, its appearance is graceful and well-pleasant to see, possesses the adornment of characteristics and virtues, its authority is difficult to see and reputation is high, its body fully praises worldly dharmas without staining them, isn't",
        "source": "T24n1490_001:1083a06_3"
    },
    {
        "source_sentence": "非聲聞辟支佛所見，念如大海、定如須彌、堪任如地、神足變現如因陀羅、心得自在喻如梵王、無等等與空等，遍一切處入一切處。",
        "translation": "They aren't seen by śrāvakas or pratyekbuddhas, whose mindfulness is like the ocean, concentration is like Mount Sumeru, abilities are like the ground, miraculous transformations are like Indra, the self-dependence metaphor of mind is like Brahma King, unequal to space, and so forth, pervading all places and entering all places.",
        "source": "T24n1490_001:1083a12_4"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T24n1490_001:1083a15_5"
    },
    {
        "source_sentence": "彼寶相如來世界諸聲聞眾德皆如是，復更成就無量功德。」",
        "translation": "The virtues of the śrāvakas in that Jewel-Shaped Tathāgata's world are all like this, and they furthermore achieve measureless merit.",
        "source": "T24n1490_001:1083a16_0"
    },
    {
        "source_sentence": "說此法時，五百比丘、五百比丘尼、五百優婆塞、五百優婆夷、五千天子等未昇決定者，各作是言：「我等願欲樂往彼土寶相如來諸聲聞眾。」",
        "translation": "When he taught this teaching, the five hundred monks, five hundred bhikṣus, five hundred nuns, five hundred laymen, five hundred laymen, and 5,000 celestial beings who hadn't yet ascended to certainty each said, We wish to delight in traveling to that land with the śrāvakas of the Tathāgata Jewel-Shaped Tathāgata.",
        "source": "T24n1490_001:1083a17_1"
    },
    {
        "source_sentence": "文殊師利言：「善男子等！",
        "translation": "Mañjuśrī said, Good men!",
        "source": "T24n1490_001:1083a20_2"
    },
    {
        "source_sentence": "不可以聲聞心得生彼土。",
        "translation": "They can't be born in another land with the minds of śrāvakas.",
        "source": "T24n1490_001:1083a21_0"
    },
    {
        "source_sentence": "是故汝等宜應發阿耨多羅三藐三菩提心，乃可得生。」",
        "translation": "Therefore, it's advisable for you to give rise to the mind of unsurpassed, correct, and complete enlightenment so that you can be born.",
        "source": "T24n1490_001:1083a21_1"
    },
    {
        "source_sentence": "時諸大眾為生彼故，發阿耨多羅三藐三菩提心願生彼土。",
        "translation": "In order to be born there, the masses then aroused the mind of unsurpassed, correct, and complete enlightenment and vowed to be born there.",
        "source": "T24n1490_001:1083a22_2"
    },
    {
        "source_sentence": "世尊即說當得往生。",
        "translation": "The Bhagavān then explained that he'll be reborn.",
        "source": "T24n1490_001:1083a24_3"
    },
    {
        "source_sentence": "寂調音天子復謂文殊師利法王子言：「文殊師利！",
        "translation": "The silent and harmonious celestial son again addressed Mañjuśrī, the prince of the Dharma, saying, Mañjuśrī!",
        "source": "T24n1490_001:1083a25_0"
    },
    {
        "source_sentence": "彼土以何法調伏聲聞、調伏菩薩？」",
        "translation": "What teaching does that land use to subdue śrāvakas and bodhisattvas?",
        "source": "T24n1490_001:1083a26_1"
    },
    {
        "source_sentence": "文殊師利言：「天子！",
        "translation": "Mañjuśrī said, My lord!",
        "source": "T24n1490_001:1083a26_2"
    },
    {
        "source_sentence": "以三乘性調伏聲聞，以攝無量生死等安慰一切眾生故受身調伏菩薩。",
        "translation": "The bodhisattva who subdues śrāvakas by the nature of the three-vehicle teachings and takes in measureless births and deaths and so forth to comfort all sentient beings because they subdue bodhisattvas.",
        "source": "T24n1490_001:1083a27_3"
    },
    {
        "source_sentence": "以毀呰功德資產調伏聲聞，以不厭廣積功德資產利益眾生調伏菩薩。",
        "translation": "They subdue śrāvakas with the wealth of disparaging merit, and they tame bodhisattvas who don't tire of the wealth of extensive accumulation of merit for the benefit of sentient beings.",
        "source": "T24n1490_001:1083a29_0"
    },
    {
        "source_sentence": "以不願斷一切眾生煩惱調伏聲聞，以樂斷一切眾生煩惱調伏菩薩。",
        "translation": "Because they don't want to end the afflictions of all sentient beings and tame śrāvakas, they delight in ending the afflictions of all sentient beings and tame bodhisattvas.",
        "source": "T24n1490_001:1083b01_1"
    },
    {
        "source_sentence": "以捨一切眾生不為成就一切佛法調伏聲聞，以大悲心念一切眾生為成就諸佛之法調伏菩薩。",
        "translation": "They abandon all sentient beings and don't cultivate all the Buddha's teachings to tame śrāvakas, and with great compassion for all sentient beings they cultivate the Buddha's teachings to tame bodhisattvas.",
        "source": "T24n1490_001:1083b03_2"
    },
    {
        "source_sentence": "以少分行調伏聲聞，以遍一切世間行調伏菩薩。",
        "translation": "They subdue śrāvakas with a small part of their practice, and they subdue bodhisattvas with all worldly practices throughout the world.",
        "source": "T24n1490_001:1083b05_3"
    },
    {
        "source_sentence": "以捨眾魔調伏聲聞，以怖一切世界眾魔摧伏異論調伏菩薩。",
        "translation": "He subdues śrāvakas by abandoning the Māras and taming them, and he subdues the bodhisattvas who are disciplined by fear of all the Māras in all the worlds to subdue heretical theories.",
        "source": "T24n1490_001:1083b06_4"
    },
    {
        "source_sentence": "以成就己心調伏聲聞，以成就無上菩提心調伏菩薩。",
        "translation": "He subdues the śrāvakas by accomplishing his own mind, and he subdues the bodhisattvas by accomplishing the unsurpassed mind of enlightenment.",
        "source": "T24n1490_001:1083b08_0"
    },
    {
        "source_sentence": "以照明已照調伏聲聞，以照明一切世界眾生身及佛法調伏菩薩。",
        "translation": "They illuminate the bodies of all sentient beings in all worlds and the buddhas, dharmas, and disciplined bodhisattvas.",
        "source": "T24n1490_001:1083b09_1"
    },
    {
        "source_sentence": "以次第方便調伏聲聞，以一剎那心方便調伏菩薩。",
        "translation": "He disciplines the śrāvakas with sequential skillful means and disciplines the bodhisattvas with a single moment of thought.",
        "source": "T24n1490_001:1083b10_2"
    },
    {
        "source_sentence": "以斷三寶種調伏聲聞，以長養三寶種調伏菩薩。",
        "translation": "They subdue the śrāvakas by eliminating the seeds of the three treasures and nurturing the bodhisattvas who are subdued by the seeds of the three treasures.",
        "source": "T24n1490_001:1083b11_3"
    },
    {
        "source_sentence": "以治破瓦石器調伏聲聞，以治破金銀器調伏菩薩。",
        "translation": "He subdues śrāvakas by treating broken tile and stone vessels, and he subdues bodhisattvas by treating broken gold and silver vessels.",
        "source": "T24n1490_001:1083b13_4"
    },
    {
        "source_sentence": "以不成就十力、四無所畏、佛十八不共法調伏聲聞，以成就十力、四無所畏、佛十八不共法調伏菩薩。",
        "translation": "He subdues śrāvakas by accomplishing the ten powers, four fearlessnesses, and 18 distinctive qualities of the Buddha's teachings that are not accomplished, and he subdues bodhisattvas by accomplishing the ten powers, four fearlessnesses, and 18 distinctive qualities of the Buddha's teachings that are not accomplished.",
        "source": "T24n1490_001:1083b14_5"
    },
    {
        "source_sentence": "以不成就六波羅蜜方便四攝調伏聲聞，以成就六波羅蜜方便四攝調伏菩薩。",
        "translation": "They don't accomplish the four ways to tame śrāvakas with the method of the six perfections, and they accomplish the four ways to tame bodhisattvas with the method of the six perfections.",
        "source": "T24n1490_001:1083b16_6"
    },
    {
        "source_sentence": "以獨處林藪樂於遠離調伏聲聞，以樂園林臺觀樂於法樂調伏菩薩。",
        "translation": "Because he's alone in a forest, he enjoys the pleasure of being far removed and tames the śrāvakas, and he enjoys the pleasure of cultivating bodhisattvas who are disciplined by the Dharma.",
        "source": "T24n1490_001:1083b18_7"
    },
    {
        "source_sentence": "以斷煩惱習調伏聲聞，以不斷煩惱習調伏菩薩。",
        "translation": "They subdue śrāvakas by stopping the afflictive habits, and they subdue bodhisattvas by stopping the afflictive habits.",
        "source": "T24n1490_001:1083b19_8"
    },
    {
        "source_sentence": "以有量、有思議、有等、有數調伏聲聞，以無量、不思議、無等、無數調伏菩薩。",
        "translation": "They subdue śrāvakas with measurement, contemplation, suchness, and number by means of measureless, inconceivable, peerless, and countless disciplined bodhisattvas.",
        "source": "T24n1490_001:1083b21_9"
    },
    {
        "source_sentence": "是名調伏。」",
        "translation": "This is called discipline.",
        "source": "T24n1490_001:1083b22_10"
    },
    {
        "source_sentence": "爾時世尊嘆文殊師利法王子言：「善哉善哉！",
        "translation": "It was then that the Bhagavān praised Mañjuśrī, the prince of the Dharma, saying, Good, good!",
        "source": "T24n1490_001:1083b23_0"
    },
    {
        "source_sentence": "汝善說此菩薩調伏。",
        "translation": "You well explain this bodhisattva's submission.",
        "source": "T24n1490_001:1083b24_0"
    },
    {
        "source_sentence": "汝今聽我說喻更明此義。",
        "translation": "Now, listen as I explain this metaphor to further clarify its meaning.",
        "source": "T24n1490_001:1083b24_1"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T24n1490_001:1083b25_2"
    },
    {
        "source_sentence": "喻如一人終身嘆說牛跡中水，復有一人嘆大海水。",
        "translation": "It's like a person who praises the water in the footprints of an ox for their whole life, and another person praises the great ocean water.",
        "source": "T24n1490_001:1083b25_3"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T24n1490_001:1083b26_4"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T24n1490_001:1083b26_5"
    },
    {
        "source_sentence": "如此二水可相比不？」",
        "translation": "Are these two kinds of water to be compared?",
        "source": "T24n1490_001:1083b27_0"
    },
    {
        "source_sentence": "文殊師利白佛言：「世尊！",
        "translation": "Mañjuśrī said to the Buddha, Bhagavān!",
        "source": "T24n1490_001:1083b27_1"
    },
    {
        "source_sentence": "牛跡甚少，其歎亦少；",
        "translation": "The traces of the ox are scarce and the praiseworthy features are few.",
        "source": "T24n1490_001:1083b28_0"
    },
    {
        "source_sentence": "大海無量，歎亦無量。」",
        "translation": "The great ocean is immeasurable, and praise is immeasurable.",
        "source": "T24n1490_001:1083b28_1"
    },
    {
        "source_sentence": "佛言：「如是。",
        "translation": "The Buddha said, So it is.",
        "source": "T24n1490_001:1083b28_2"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T24n1490_001:1083b29_3"
    },
    {
        "source_sentence": "喻如牛跡水，少其歎亦少，聲聞調伏亦復如是。",
        "translation": "It's a metaphor like the water at the footprint of an ox, which has little praise and little admiration, and so it is with the submission of śrāvakas.",
        "source": "T24n1490_001:1083b29_4"
    },
    {
        "source_sentence": "喻如大海水既無量，歎亦無量，菩薩調伏亦復如是。」",
        "translation": "It's a metaphor like the great water of the ocean is immeasurable, and praise is immeasurable, and so is the bodhisattva's discipline.",
        "source": "T24n1490_001:1083c01_5"
    },
    {
        "source_sentence": "說是法時，萬二千天子發阿耨多羅三藐三菩提心，而作是言：「世尊！",
        "translation": "When he taught this teaching, 12,000 celestial beings aroused the mind of unsurpassed, correct, and complete enlightenment and said, Bhagavān!",
        "source": "T24n1490_001:1083c02_6"
    },
    {
        "source_sentence": "我等亦欲學菩薩調伏，當以調伏無量眾生。」",
        "translation": "We also want to train in the bodhisattva's submission, and we will subdue measureless sentient beings with it.",
        "source": "T24n1490_001:1083c04_7"
    },
    {
        "source_sentence": "寂調音天子復謂文殊師利法王子言：「文殊師利！",
        "translation": "The silent and harmonious celestial son again addressed Mañjuśrī, the prince of the Dharma, saying, Mañjuśrī!",
        "source": "T24n1490_001:1083c05_8"
    },
    {
        "source_sentence": "仁者學何調伏？",
        "translation": "How do you, my dear friend, train in discipline?",
        "source": "T24n1490_001:1083c06_9"
    },
    {
        "source_sentence": "為學聲聞調伏、緣覺調伏、菩薩調伏耶？」",
        "translation": "Do you want to train in the discipline of śrāvakas, the discipline of pratyekbuddhas, and the discipline of bodhisattvas?",
        "source": "T24n1490_001:1083c06_10"
    },
    {
        "source_sentence": "文殊師利言：「天子！",
        "translation": "Mañjuśrī said, My lord!",
        "source": "T24n1490_001:1083c07_11"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T24n1490_001:1083c07_12"
    },
    {
        "source_sentence": "頗有大海不受眾流者不？」",
        "translation": "Could it be that there's a great ocean that doesn't accept the many streams?",
        "source": "T24n1490_001:1083c08_13"
    },
    {
        "source_sentence": "天子言：「無也。」",
        "translation": "The celestial prince said, No.",
        "source": "T24n1490_001:1083c08_14"
    },
    {
        "source_sentence": "文殊師利言：「如是天子！",
        "translation": "Mañjuśrī said, So it is, my lord!",
        "source": "T24n1490_001:1083c09_15"
    },
    {
        "source_sentence": "諸菩薩調伏喻如大海，於諸調伏勤作方便，修聲聞調伏、緣覺調伏、菩薩調伏。」",
        "translation": "The discipline of bodhisattvas is like the great ocean, and they diligently cultivate skillful means to discipline śrāvakas, pratyekbuddhas, and bodhisattvas.",
        "source": "T24n1490_001:1083c09_16"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1083c11_17"
    },
    {
        "source_sentence": "調伏句者是何義耶？」",
        "translation": "What's the meaning of the phrase that subdues?",
        "source": "T24n1490_001:1083c11_18"
    },
    {
        "source_sentence": "文殊師利言：「若知煩惱斷煩惱者，謂是調伏。」",
        "translation": "Mañjuśrī said, If someone knows the afflictions and stops the afflictions, they're called being disciplined.",
        "source": "T24n1490_001:1083c12_19"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1083c13_20"
    },
    {
        "source_sentence": "云何調伏煩惱？",
        "translation": "How do they subdue the afflictions?",
        "source": "T24n1490_001:1083c13_21"
    },
    {
        "source_sentence": "云何知煩惱？」",
        "translation": "How do we know the afflictions?",
        "source": "T24n1490_001:1083c14_0"
    },
    {
        "source_sentence": "文殊師利言：「若妄想分別憶想，不善順思惟，計有彼我斷俱行見纏顛倒、無明等，如是為煩惱縛著。",
        "translation": "Mañjuśrī said, If someone deludedly conceptualizes, discriminates, recollects, doesn't well contemplate, and imagines that there's a self that's free of the afflictions of co-arising views, mistakenness, ignorance, and so forth, this is the afflictive attachment.",
        "source": "T24n1490_001:1083c14_1"
    },
    {
        "source_sentence": "若不妄想、不分別、不憶想，善順思惟，不計彼我俱行見纏顛倒，離無明等，是名滅煩惱無憶想及究竟調伏。",
        "translation": "If they don't have deluded conceptions, don't discriminate, and don't recall conceptions, well contemplate them, don't conceptualize them as self, and become free of the afflictive tendencies of views that are accompanied by mistakenness, and part with ignorance and so forth, this is called cessation of affliction, no thoughts of recollection, and ultimately subduing",
        "source": "T24n1490_001:1083c16_2"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T24n1490_001:1083c19_0"
    },
    {
        "source_sentence": "是名究竟調伏。",
        "translation": "This is called the ultimate discipline.",
        "source": "T24n1490_001:1083c19_1"
    },
    {
        "source_sentence": "菩薩若復以智如是知煩惱微小、虛誑不堅牢、空無主無我無所屬、無所從來去無所至無方處、非內非外非兩中間、非積聚物、無色無形無相無貌無處所，如是煩惱究竟滅。",
        "translation": "If another bodhisattva thus knows with knowledge that the afflictions are subtle, false and insubstantial, emptiness has no owner, no self, no attachment, no origin or departure, no place or direction, neither internal nor external, neither between two or more, neither accumulated things, formless, formless, formless, formless, shapeless, and locationless, then such afflict",
        "source": "T24n1490_001:1083c19_2"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T24n1490_001:1083c23_3"
    },
    {
        "source_sentence": "喻如有人能識毒蛇種性所生，則能滅毒。",
        "translation": "It's like a person who can recognize the poison that comes from the seed nature of a venomous snake and then be able to extinguish the poison.",
        "source": "T24n1490_001:1083c23_4"
    },
    {
        "source_sentence": "如是天子！",
        "translation": "So it is, my lord!",
        "source": "T24n1490_001:1083c24_5"
    },
    {
        "source_sentence": "若知煩惱種性所生，能滅煩惱。」",
        "translation": "If they know that the afflictions are produced by the seed nature of afflictions, they'll be able to extinguish afflictions.",
        "source": "T24n1490_001:1083c24_6"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1083c25_7"
    },
    {
        "source_sentence": "云何為煩惱種性所生？」",
        "translation": "How are they produced by the seed nature of affliction?",
        "source": "T24n1490_001:1083c25_8"
    },
    {
        "source_sentence": "文殊師利言：「天子！",
        "translation": "Mañjuśrī said, My lord!",
        "source": "T24n1490_001:1083c26_9"
    },
    {
        "source_sentence": "從妄想生煩惱，若無妄想則無煩惱，無煩惱故則無禪窟，無禪窟故則無所住，無所住故則無惱害，無惱害故則究竟調伏。」",
        "translation": "If there are no deluded thoughts, then there are no afflictions; if there are no afflictions, then there are no meditation caves; if there are no meditation caves, then there are no dwelling places; if there are no dwelling places, then there are no harmful feelings; and if there are no harmful feelings, then they are ultimately subdued.",
        "source": "T24n1490_001:1083c26_10"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1083c29_11"
    },
    {
        "source_sentence": "為有煩惱故調伏？",
        "translation": "Is it because of the presence of defilement that they are disciplined?",
        "source": "T24n1490_001:1084a01_12"
    },
    {
        "source_sentence": "為無煩惱故調伏？」",
        "translation": "Is it because of the absence of afflictions that they are disciplined?",
        "source": "T24n1490_001:1084a01_13"
    },
    {
        "source_sentence": "文殊師利言：「天子！",
        "translation": "Mañjuśrī said, My lord!",
        "source": "T24n1490_001:1084a01_14"
    },
    {
        "source_sentence": "喻如有人夢為毒蛇所螫，此人為苦所逼，即於夢中而服解藥，以服藥故毒氣得除。",
        "translation": "It's like when a person is stung by a poisonous snake in a dream and this person is tormented by suffering, so they take the medicine of liberation in a dream and because they take the medicine, the poisonous gas gets rid of it.",
        "source": "T24n1490_001:1084a02_15"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T24n1490_001:1084a04_16"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T24n1490_001:1084a04_17"
    },
    {
        "source_sentence": "此人實為蛇所螫不耶？」",
        "translation": "Is this person really stung by a snake?",
        "source": "T24n1490_001:1084a04_18"
    },
    {
        "source_sentence": "天子言：「不也。」",
        "translation": "The celestial prince said, No.",
        "source": "T24n1490_001:1084a05_19"
    },
    {
        "source_sentence": "文殊師利言：「彼毒實為除不耶？」",
        "translation": "Mañjuśrī said, Is that poisonous and real removal?",
        "source": "T24n1490_001:1084a05_20"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1084a06_21"
    },
    {
        "source_sentence": "如實不被螫，除亦如是。」",
        "translation": "As it is, they won't be stung, and so are the exceptions.",
        "source": "T24n1490_001:1084a06_22"
    },
    {
        "source_sentence": "文殊師利言：「天子！",
        "translation": "Mañjuśrī said, My lord!",
        "source": "T24n1490_001:1084a07_23"
    },
    {
        "source_sentence": "一切賢聖調伏亦復如是。",
        "translation": "It's likewise with all the good and noble disciplines.",
        "source": "T24n1490_001:1084a07_24"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T24n1490_001:1084a08_25"
    },
    {
        "source_sentence": "汝作是言：『為有煩惱故調伏、無故調伏？』",
        "translation": "You say, 'Is it because of the afflictions that you're disciplined and because of the absence of them that you're disciplined?'",
        "source": "T24n1490_001:1084a08_26"
    },
    {
        "source_sentence": "者，天子！",
        "translation": "That's, my lord!",
        "source": "T24n1490_001:1084a09_27"
    },
    {
        "source_sentence": "如我與無我，有煩惱無煩惱亦如是。",
        "translation": "Just as self and selflessness have afflictions and no afflictions, so too do they have afflictions and no afflictions.",
        "source": "T24n1490_001:1084a09_28"
    },
    {
        "source_sentence": "如我無我亦無，如是有煩惱無煩惱亦爾，以我即無我故。",
        "translation": "Just as the self is without self and also without self, so are the afflictions and the absence of afflictions in this way: because self means selflessness.",
        "source": "T24n1490_001:1084a10_29"
    },
    {
        "source_sentence": "有煩惱無煩惱，此處餘處無有煩惱可調伏。",
        "translation": "There are afflictions and no afflictions, and there are no afflictions to be subdued here or anywhere else.",
        "source": "T24n1490_001:1084a11_30"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1490_001:1084a12_31"
    },
    {
        "source_sentence": "一切法寂靜，不可愛故。",
        "translation": "All dharmas are quiescent because they aren't desirable.",
        "source": "T24n1490_001:1084a12_32"
    },
    {
        "source_sentence": "一切法寂靜，不可取故。",
        "translation": "All dharmas are quiescent because they cannot be grasped.",
        "source": "T24n1490_001:1084a13_33"
    },
    {
        "source_sentence": "一切法究竟寂靜，不可生故。",
        "translation": "All dharmas are ultimately quiescent, because they can't arise.",
        "source": "T24n1490_001:1084a14_0"
    },
    {
        "source_sentence": "一切法無盡，以不生故。",
        "translation": "All dharmas are inexhaustible because they don't arise.",
        "source": "T24n1490_001:1084a14_1"
    },
    {
        "source_sentence": "一切法無生，無成就故。",
        "translation": "All dharmas lack arising because they lack accomplishment.",
        "source": "T24n1490_001:1084a15_2"
    },
    {
        "source_sentence": "一切法無成就，無作者故。",
        "translation": "All dharmas lack accomplishment because there are no authors.",
        "source": "T24n1490_001:1084a15_3"
    },
    {
        "source_sentence": "一切法無我作者，以無我故。",
        "translation": "All dharmas lack self as author because they lack self.",
        "source": "T24n1490_001:1084a16_4"
    },
    {
        "source_sentence": "一切法無我，以無主故。",
        "translation": "All dharmas lack self because there's no owner.",
        "source": "T24n1490_001:1084a16_5"
    },
    {
        "source_sentence": "一切法無主，與虛空等故。",
        "translation": "All dharmas have no subject, because they are the same as space.",
        "source": "T24n1490_001:1084a17_6"
    },
    {
        "source_sentence": "一切法無來，無所依故。",
        "translation": "All dharmas have no origin, because they have no basis.",
        "source": "T24n1490_001:1084a18_7"
    },
    {
        "source_sentence": "一切法無去，無禪窟故。",
        "translation": "All dharmas have no going, because there's no meditation cave.",
        "source": "T24n1490_001:1084a18_8"
    },
    {
        "source_sentence": "一切法無住，無所安立故。",
        "translation": "All dharmas lack abiding, because there's nothing to establish.",
        "source": "T24n1490_001:1084a19_9"
    },
    {
        "source_sentence": "一切法無安立，生即滅故。",
        "translation": "All dharmas lack stability, because arising is cessation.",
        "source": "T24n1490_001:1084a19_10"
    },
    {
        "source_sentence": "一切法無為，以無漏故。",
        "translation": "All dharmas are nonexistent because they are uncontaminated.",
        "source": "T24n1490_001:1084a20_11"
    },
    {
        "source_sentence": "一切法無受，究竟調伏故。」",
        "translation": "All dharmas lack sensation because they are ultimately subdued.",
        "source": "T24n1490_001:1084a20_12"
    },
    {
        "source_sentence": "寂調音天子復謂文殊師利法王子言：「諸法以何為最？」",
        "translation": "Again, the celestial son of silent and harmonious voice said to Mañjuśrī, Prince of the Dharma, What's the best among all dharmas?",
        "source": "T24n1490_001:1084a22_0"
    },
    {
        "source_sentence": "文殊師利言：「生死所習，不善順為最；",
        "translation": "Mañjuśrī said, Among the things conditioned by birth and death, unwholesome conformity is the greatest.",
        "source": "T24n1490_001:1084a23_1"
    },
    {
        "source_sentence": "趣涅槃界，善順為最。",
        "translation": "The realm of nirvana is the highest, being good and agreeable.",
        "source": "T24n1490_001:1084a24_2"
    },
    {
        "source_sentence": "於障礙中不精進為最，於正覺中精進為最。",
        "translation": "Among the obstacles, non-effort is the highest; among the meditative attainments, effort is the highest.",
        "source": "T24n1490_001:1084a24_3"
    },
    {
        "source_sentence": "於諸蓋中疑網為最，種種相中得解觀為最。",
        "translation": "Among the hindrances, the web of doubt is the greatest, and among the various characteristics, attaining understanding and contemplation is the greatest.",
        "source": "T24n1490_001:1084a25_4"
    },
    {
        "source_sentence": "諸煩惱中妄想為最，無煩惱中不妄想為最。",
        "translation": "Among the defilements, deluded conceptual thought is the highest; among the absence of defilement, no deluded conceptual thought is the highest.",
        "source": "T24n1490_001:1084a26_5"
    },
    {
        "source_sentence": "於諸覺中多事為最，於滅心中禪定為最。",
        "translation": "Among all feelings, many things are the greatest and meditation in cessation is the greatest.",
        "source": "T24n1490_001:1084a27_6"
    },
    {
        "source_sentence": "於諸見中增上慢為最，於空法中無增上慢為最。",
        "translation": "Among views, overweening conceit is the highest, and among the dharmas of emptiness, there's no overweening conceit as the highest.",
        "source": "T24n1490_001:1084a28_7"
    },
    {
        "source_sentence": "諸不善法中惡知識為最，諸善法中善知識為最。",
        "translation": "Among the unwholesome dharmas, bad friends are the best, and among the wholesome dharmas, good friends are the best.",
        "source": "T24n1490_001:1084a29_8"
    },
    {
        "source_sentence": "一切苦法中邪見為最，一切樂法中正見為最。",
        "translation": "Among all the factors of suffering, false view is the highest; among all the factors of satisfaction, right view is the highest.",
        "source": "T24n1490_001:1084b01_9"
    },
    {
        "source_sentence": "於貧窮中慳貪為最，於大富中布施為最。",
        "translation": "Among the poor, avarice and greed are the highest; among the rich, giving is the highest.",
        "source": "T24n1490_001:1084b02_10"
    },
    {
        "source_sentence": "於惡趣中破戒為最，於勝趣中持戒為最。",
        "translation": "Among the bad destinies, breaking the precepts is the highest; among the superior destinies, keeping the precepts is the highest.",
        "source": "T24n1490_001:1084b03_11"
    },
    {
        "source_sentence": "於垢心中瞋恚為最，於淨心中忍辱為最。",
        "translation": "Among the defiled mind, anger is the greatest, and among the pure minds, forbearance is the greatest.",
        "source": "T24n1490_001:1084b04_12"
    },
    {
        "source_sentence": "於退善法中懈怠為最，於修善法中精進為最。",
        "translation": "Among those who regress from good states, laziness is the greatest; among those who cultivate good states, energy is the greatest.",
        "source": "T24n1490_001:1084b05_13"
    },
    {
        "source_sentence": "於散亂中諸覺為最，於一心中禪定為最。",
        "translation": "Among the distractions, feelings are the greatest among all forms of perception, while meditation in one thought is the greatest.",
        "source": "T24n1490_001:1084b06_14"
    },
    {
        "source_sentence": "無智慧中愚癡為最，於三十七助道法中般若為最。",
        "translation": "Among the thirty-seven factors that aid in the path, prajñā is the greatest.",
        "source": "T24n1490_001:1084b07_15"
    },
    {
        "source_sentence": "於慈心中無礙為最，於悲心中專念不諂為最，於喜心中樂法樂為最，於捨心中離愛憎為最。",
        "translation": "In the mind of kindness, unobstructed is the greatest; in the mind of compassion, concentrating on mindfulness without flattery is the greatest; in the mind of joy, delight in the happiness of the Dharma is the greatest; and in the mind of equanimity, being free from craving and hatred is the greatest.",
        "source": "T24n1490_001:1084b08_16"
    },
    {
        "source_sentence": "於念處中不忘宿善根為最，於正勤中正方便為最，於如意足中身心輕為最，於諸根中信首為最，於諸力中摧伏煩惱為最，於諸覺中悟平等為最，於八聖道度一切邪道為最，於佛法中菩提心為最。",
        "translation": "In the state of mindfulness, not forgetting past roots of goodness is the best, right effort is the best in right effort, body and mind are the best in supernormal abilities, faith is the best in faculties, overpowering afflictions is the best in powers, realizing equality among feelings is the best, liberating all wrong paths by the eight noble paths is the best, and the mind of en",
        "source": "T24n1490_001:1084b10_17"
    },
    {
        "source_sentence": "於攝法中財法為最，導化眾生中說法為最，於方便中處非處智為最。",
        "translation": "Among the methods of gathering in dharmas, possessions and dharmas are the best, teaching the Dharma to guide sentient beings is the best, and knowledge of where and what's not a place for skillful means is the best.",
        "source": "T24n1490_001:1084b15_18"
    },
    {
        "source_sentence": "於般若波羅蜜中知一切眾生心行相續到彼岸為最，於六波羅蜜中大乘為最。",
        "translation": "In the perfection of wisdom, knowing the minds and actions of all sentient beings continue to reach the other shore is the highest, and in the six perfections, the great vehicle is the highest.",
        "source": "T24n1490_001:1084b16_19"
    },
    {
        "source_sentence": "於求空中慧明為最，於法忍出離中不由他為最。」",
        "translation": "In seeking space, wisdom and insight are the best, and in tolerating the escape of phenomena without relying on others is the best.",
        "source": "T24n1490_001:1084b18_20"
    },
    {
        "source_sentence": "寂調音天子復謂文殊師利法王子言：「文殊師利！",
        "translation": "The silent and harmonious celestial son again addressed Mañjuśrī, the prince of the Dharma, saying, Mañjuśrī!",
        "source": "T24n1490_001:1084b20_0"
    },
    {
        "source_sentence": "法界以何為最？」",
        "translation": "What's the greatest in the Dharma realm?",
        "source": "T24n1490_001:1084b21_1"
    },
    {
        "source_sentence": "文殊師利言：「天子！",
        "translation": "Mañjuśrī said, My lord!",
        "source": "T24n1490_001:1084b21_2"
    },
    {
        "source_sentence": "法界以平等為最。」",
        "translation": "The Dharma realm of equality is the highest.",
        "source": "T24n1490_001:1084b21_3"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1084b22_4"
    },
    {
        "source_sentence": "法界以何為界？」",
        "translation": "What is the realm of the Dharma realm?",
        "source": "T24n1490_001:1084b22_5"
    },
    {
        "source_sentence": "文殊師利言：「法界以一切眾生界為界。」",
        "translation": "Mañjuśrī said, The Dharma realm takes the realm of all sentient beings as the realm.",
        "source": "T24n1490_001:1084b23_6"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1084b24_0"
    },
    {
        "source_sentence": "法界頗有分齊不？」",
        "translation": "Is there a distinctive characteristic of the Dharma realm?",
        "source": "T24n1490_001:1084b24_1"
    },
    {
        "source_sentence": "文殊師利言：「天子！",
        "translation": "Mañjuśrī said, My lord!",
        "source": "T24n1490_001:1084b24_2"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T24n1490_001:1084b25_3"
    },
    {
        "source_sentence": "空界頗有分齊不？」",
        "translation": "Is the realm of emptiness quite distinct?",
        "source": "T24n1490_001:1084b25_4"
    },
    {
        "source_sentence": "天子言：「無也。」",
        "translation": "The celestial prince said, No.",
        "source": "T24n1490_001:1084b26_0"
    },
    {
        "source_sentence": "文殊師利言：「天子！",
        "translation": "Mañjuśrī said, My lord!",
        "source": "T24n1490_001:1084b26_1"
    },
    {
        "source_sentence": "如空界無分齊，法界亦如是無有分齊。」",
        "translation": "Just as the realm of emptiness has no distinctive characteristics, so too does the Dharma realm have no distinctive characteristics.",
        "source": "T24n1490_001:1084b26_2"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1084b27_3"
    },
    {
        "source_sentence": "法界若爾，仁者云何知法界耶？」",
        "translation": "If that's the Dharma realm, how do you know the Dharma realm, sir?",
        "source": "T24n1490_001:1084b28_4"
    },
    {
        "source_sentence": "文殊師利言：「法界即無法界，法界不知法界。」",
        "translation": "Mañjuśrī said, The Dharma realm is the Dharma realm that's not the Dharma realm, and the Dharma realm doesn't know the Dharma realm.",
        "source": "T24n1490_001:1084b28_5"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1084b29_6"
    },
    {
        "source_sentence": "若如是者，仁知何法辯乃如是？」",
        "translation": "If it's like this, what do you kindly know that such is the way to explain the teaching?",
        "source": "T24n1490_001:1084c01_7"
    },
    {
        "source_sentence": "文殊師利言：「天子！",
        "translation": "Mañjuśrī said, My lord!",
        "source": "T24n1490_001:1084c02_8"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T24n1490_001:1084c02_9"
    },
    {
        "source_sentence": "呼聲響為知何法而有應聲？」",
        "translation": "The sound of the call is to know what teaching and have an answering sound?",
        "source": "T24n1490_001:1084c02_10"
    },
    {
        "source_sentence": "天子言：「呼聲響無所知，但以因緣合故便有聲出。」",
        "translation": "The celestial son said, The sound of the call has no knowing, but it's because of the conjunction of causes and conditions that sound comes out.",
        "source": "T24n1490_001:1084c03_11"
    },
    {
        "source_sentence": "文殊師利言：「如是天子！",
        "translation": "Mañjuśrī said, So it is, my lord!",
        "source": "T24n1490_001:1084c04_12"
    },
    {
        "source_sentence": "以緣眾生為境界故，諸菩薩便有應辯。」",
        "translation": "Because sentient beings are conditioned by the objective realm, the bodhisattvas then have the appropriate eloquence.",
        "source": "T24n1490_001:1084c05_13"
    },
    {
        "source_sentence": "天子言：「仁者為住何處而說法耶？」",
        "translation": "The celestial prince said, Sir, where are you staying to teach the Dharma?",
        "source": "T24n1490_001:1084c06_0"
    },
    {
        "source_sentence": "文殊師利言：「天子！",
        "translation": "Mañjuśrī said, My lord!",
        "source": "T24n1490_001:1084c06_1"
    },
    {
        "source_sentence": "如如來所作化人所住說法，我所說法亦復如是。」",
        "translation": "Just as the Tathāgata teaches the Dharma that's created by transforming people and where they live, so too does what I teach.",
        "source": "T24n1490_001:1084c07_2"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1084c08_3"
    },
    {
        "source_sentence": "如來所化無所住故而有所說。」",
        "translation": "The Tathāgata's teaching has nothing to abide in, so he explains it.",
        "source": "T24n1490_001:1084c08_4"
    },
    {
        "source_sentence": "文殊師利言：「我亦如是，無所住故而有所說。」",
        "translation": "Mañjuśrī said, So it is with me, who explains something because there's nothing to abide in.",
        "source": "T24n1490_001:1084c09_5"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1084c10_6"
    },
    {
        "source_sentence": "若一切處無所住者，仁住何處當得阿耨多羅三藐三菩提？」",
        "translation": "If there's nothing to abide in in in all places, where will you attain supreme perfect enlightenment if you kindly abide?",
        "source": "T24n1490_001:1084c10_7"
    },
    {
        "source_sentence": "文殊師利言：「我住無間當得阿耨多羅三藐三菩提。」",
        "translation": "Mañjuśrī said, I'll abide without interruption and attain supreme perfect enlightenment.",
        "source": "T24n1490_001:1084c12_8"
    },
    {
        "source_sentence": "天子言：「彼無間復何所住？」",
        "translation": "The celestial son said, Where will they live without interruption?",
        "source": "T24n1490_001:1084c13_9"
    },
    {
        "source_sentence": "文殊師利言：「天子！",
        "translation": "Mañjuśrī said, My lord!",
        "source": "T24n1490_001:1084c13_10"
    },
    {
        "source_sentence": "無間者，無根本、無所住。」",
        "translation": "Without interruption, there's no root and nothing to abide in.",
        "source": "T24n1490_001:1084c14_11"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1084c14_12"
    },
    {
        "source_sentence": "成就無間業者，如來不說趣無間獄耶？」",
        "translation": "Accomplishing unremitting karma, doesn't the Tathāgata say that they'll go to an unremitting hell?",
        "source": "T24n1490_001:1084c15_13"
    },
    {
        "source_sentence": "文殊師利言：「天子！",
        "translation": "Mañjuśrī said, My lord!",
        "source": "T24n1490_001:1084c16_14"
    },
    {
        "source_sentence": "有無間業者，如來說趣無間獄。",
        "translation": "With unremitting karma, the Tathāgata teaches that they'll go to an unremitting hell.",
        "source": "T24n1490_001:1084c16_15"
    },
    {
        "source_sentence": "如是天子！",
        "translation": "So it is, my lord!",
        "source": "T24n1490_001:1084c17_16"
    },
    {
        "source_sentence": "菩薩住五無間，速得阿耨多羅三藐三菩提。",
        "translation": "The bodhisattva abides in five kinds of unremittingness, and he quickly attains unsurpassed, correct, and complete enlightenment.",
        "source": "T24n1490_001:1084c17_17"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T24n1490_001:1084c18_18"
    },
    {
        "source_sentence": "若菩薩專念發阿耨多羅三藐三菩提心時，於其中間不墮聲聞辟支佛地。",
        "translation": "If a bodhisattva focuses his mind on arousing the mind of unsurpassed, correct, and complete enlightenment, he won't fall into the stages of śrāvakas or pratyekbuddhas among them.",
        "source": "T24n1490_001:1084c19_0"
    },
    {
        "source_sentence": "復次若廢捨一切所有心時，於其中間不與慳垢心俱。",
        "translation": "Furthermore, when they abandon all their minds, they aren't accompanied by the mind of stinginess and defilement among them.",
        "source": "T24n1490_001:1084c20_1"
    },
    {
        "source_sentence": "復次我應當救一切眾生，於其中間不生下劣心。",
        "translation": "Furthermore, I should save all sentient beings and not give rise to inferior thoughts among them.",
        "source": "T24n1490_001:1084c21_2"
    },
    {
        "source_sentence": "復次知一切法無生已，我生法中得忍，於其中間不與諸見俱。",
        "translation": "Furthermore, after knowing that all dharmas are unarisen, they attain forbearance in the self-arisen dharmas and aren't accompanied by views among them.",
        "source": "T24n1490_001:1084c23_3"
    },
    {
        "source_sentence": "復次所應知應見應證處應正覺了，如是一切悉以一心一剎那勤方便慧正覺了至得一切智，於其中間終不懈廢。",
        "translation": "Furthermore, what should be known, seen, and realized should be comprehended by the correctly awakened, and so forth, all of these things are comprehended by the correctly awakened with one mind and one moment of effort and wisdom to attain omniscience, which is never abandoned in between.",
        "source": "T24n1490_001:1084c24_4"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T24n1490_001:1084c27_5"
    },
    {
        "source_sentence": "是名五無間。",
        "translation": "These are called the five kinds of unremitting.",
        "source": "T24n1490_001:1084c27_6"
    },
    {
        "source_sentence": "菩薩住是無間，速得阿耨多羅三藐三菩提。」",
        "translation": "When a bodhisattva abides in this kind of unremitting, he quickly attains unsurpassed, correct enlightenment.",
        "source": "T24n1490_001:1084c27_7"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1084c28_8"
    },
    {
        "source_sentence": "頗有凡夫愚人住無間罪趣無間獄，菩薩即住是無間可證阿耨多羅三藐三菩提不耶？」",
        "translation": "Could it be that there are ordinary foolish people who live in an unremitting sin and go to an unremitting hell, and bodhisattvas who abide in this unremitting can realize unsurpassed, correct, and complete enlightenment?",
        "source": "T24n1490_001:1084c29_9"
    },
    {
        "source_sentence": "文殊師利言：「有。」",
        "translation": "Mañjuśrī said, Yes.",
        "source": "T24n1490_001:1085a02_10"
    },
    {
        "source_sentence": "天子言：「以何方便？」",
        "translation": "The celestial prince said, What's the method?",
        "source": "T24n1490_001:1085a02_11"
    },
    {
        "source_sentence": "文殊師利言：「天子！",
        "translation": "Mañjuśrī said, My lord!",
        "source": "T24n1490_001:1085a02_12"
    },
    {
        "source_sentence": "一切法以諸入空空故，空無相無願、無生無起、無作無為，順緣起故則是菩提。」",
        "translation": "Because all dharmas are empty because they enter emptiness and emptiness, emptiness has no marks, no wishes, no arising, no production, and nothing that's done or done, and it's enlightenment because it follows conditioned arising.",
        "source": "T24n1490_001:1085a03_13"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1085a05_14"
    },
    {
        "source_sentence": "此法不可見。",
        "translation": "This teaching can't be seen.",
        "source": "T24n1490_001:1085a05_15"
    },
    {
        "source_sentence": "誰當信耶？」",
        "translation": "Who will believe it?",
        "source": "T24n1490_001:1085a05_16"
    },
    {
        "source_sentence": "文殊師利言：「若不信順如來者，云何當信聲聞耶？」",
        "translation": "Mañjuśrī said, If someone doesn't believe in following the Tathāgata, how will they believe in śrāvakas?",
        "source": "T24n1490_001:1085a06_17"
    },
    {
        "source_sentence": "天子言：「若如是者，云何當得解脫耶？」",
        "translation": "The celestial prince said, If that's the case, how will you attain liberation?",
        "source": "T24n1490_001:1085a07_18"
    },
    {
        "source_sentence": "文殊師利言：「若不行我者、若不受一切煩惱者、若復受持如是經典者、若以大悲授一切眾生法手者。」",
        "translation": "Mañjuśrī said, If someone doesn't practice self, if they don't accept all afflictions, if they further accept and uphold such a scripture, or if they give the Dharma hand to all sentient beings with great compassion.",
        "source": "T24n1490_001:1085a08_19"
    },
    {
        "source_sentence": "曰：「彼等有何相貌？」",
        "translation": "He said, What's their appearance?",
        "source": "T24n1490_001:1085a10_20"
    },
    {
        "source_sentence": "曰：「彼等當有相貌，陰界入相貌。」",
        "translation": "He said, They will have appearances, and the aggregates, elements, and sense-fields will have appearances.",
        "source": "T24n1490_001:1085a10_21"
    },
    {
        "source_sentence": "曰：「彼等當有何行？」",
        "translation": "He said, What will they do?",
        "source": "T24n1490_001:1085a11_22"
    },
    {
        "source_sentence": "曰：「當有空無相無願行。」",
        "translation": "He said, There will be emptiness, signlessness, and wishlessness in the practice.",
        "source": "T24n1490_001:1085a11_23"
    },
    {
        "source_sentence": "曰：「彼等當何所趣？」",
        "translation": "He said, Where will they go?",
        "source": "T24n1490_001:1085a12_24"
    },
    {
        "source_sentence": "曰：「彼等當趣一切智，當趣一切眾生心行。」",
        "translation": "He said, They will abide in omniscience and will abide in the minds and actions of all sentient beings.",
        "source": "T24n1490_001:1085a12_25"
    },
    {
        "source_sentence": "曰：「文殊師利！",
        "translation": "He said, Mañjuśrī!",
        "source": "T24n1490_001:1085a13_26"
    },
    {
        "source_sentence": "退轉菩薩云何？」",
        "translation": "What's the bodhisattva who regresses?",
        "source": "T24n1490_001:1085a14_27"
    },
    {
        "source_sentence": "曰：「天子！",
        "translation": "He said, Son of the god!",
        "source": "T24n1490_001:1085a14_28"
    },
    {
        "source_sentence": "若退轉菩薩得阿耨多羅三藐三菩提者，無有是處。」",
        "translation": "If a retrogressing bodhisattva attains supreme perfect enlightenment, there's no place for it.",
        "source": "T24n1490_001:1085a14_29"
    },
    {
        "source_sentence": "曰：「於何退轉？」",
        "translation": "He said, Where does he retreat?",
        "source": "T24n1490_001:1085a15_30"
    },
    {
        "source_sentence": "曰：「於一切煩惱及聲聞辟支佛地。」",
        "translation": "He said, In all the afflictions and the stages of śrāvakas and pratyekbuddhas.",
        "source": "T24n1490_001:1085a16_31"
    },
    {
        "source_sentence": "曰：「云何不退？」",
        "translation": "He said, How is it not retrogressing?",
        "source": "T24n1490_001:1085a16_32"
    },
    {
        "source_sentence": "曰：「若與平等等。」",
        "translation": "He said, Suppose it's equal to equality.",
        "source": "T24n1490_001:1085a17_33"
    },
    {
        "source_sentence": "曰：「文殊師利！",
        "translation": "He said, Mañjuśrī!",
        "source": "T24n1490_001:1085a17_34"
    },
    {
        "source_sentence": "平等句者有何義？」",
        "translation": "What's the meaning of the phrase equality?",
        "source": "T24n1490_001:1085a17_35"
    },
    {
        "source_sentence": "曰：「此是不異之說。」",
        "translation": "He said, This is a teaching that's not different.",
        "source": "T24n1490_001:1085a18_36"
    },
    {
        "source_sentence": "曰：「文殊師利！",
        "translation": "He said, Mañjuśrī!",
        "source": "T24n1490_001:1085a18_37"
    },
    {
        "source_sentence": "若如是者，云何知一切法差別？」",
        "translation": "If this is the case, how do we know the distinctions in all dharmas?",
        "source": "T24n1490_001:1085a19_38"
    },
    {
        "source_sentence": "曰：「天子！",
        "translation": "He said, Son of the god!",
        "source": "T24n1490_001:1085a19_39"
    },
    {
        "source_sentence": "不知平等者於平等中生差別，行差別故趣於差別。",
        "translation": "Those who don't know equality will give rise to distinctions in equality, and because they practice distinctions, they'll aim for distinctions.",
        "source": "T24n1490_001:1085a19_40"
    },
    {
        "source_sentence": "若知平等者則不行差別，以不行差別故即趣平等，謂趣無差別。」",
        "translation": "If someone knows equality, they won't practice distinctions, and because they don't practice distinctions, their destinies will be equal, meaning there are no distinctions in their destinies.",
        "source": "T24n1490_001:1085a21_41"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1085a22_42"
    },
    {
        "source_sentence": "頗有有煩惱菩薩有菩提不？」",
        "translation": "Could it be that there are afflicted bodhisattvas who have enlightenment?",
        "source": "T24n1490_001:1085a23_43"
    },
    {
        "source_sentence": "曰：「有。」",
        "translation": "He said, Yes.",
        "source": "T24n1490_001:1085a23_44"
    },
    {
        "source_sentence": "曰：「以何方便？」",
        "translation": "He said, What's the method?",
        "source": "T24n1490_001:1085a23_45"
    },
    {
        "source_sentence": "文殊師利言：「若菩薩無煩惱如聲聞者，則無受生。",
        "translation": "Mañjuśrī said, If a bodhisattva has no afflictions like śrāvakas, then there's no sensation or birth.",
        "source": "T24n1490_001:1085a24_46"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T24n1490_001:1085a25_47"
    },
    {
        "source_sentence": "菩薩為斷一切眾生煩惱故，起大悲發菩提心，名有菩提。」",
        "translation": "A bodhisattva who arouses great compassion and gives rise to the mind of enlightenment for the sake of ending the afflictions of all sentient beings is called having enlightenment.",
        "source": "T24n1490_001:1085a25_48"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T24n1490_001:1085a26_49"
    },
    {
        "source_sentence": "頗有菩薩有慳有菩提不耶？」",
        "translation": "Could it be that there are bodhisattvas who have stinginess and enlightenment?",
        "source": "T24n1490_001:1085a26_50"
    },
    {
        "source_sentence": "曰：「有。」",
        "translation": "He said, Yes.",
        "source": "T24n1490_001:1085a27_51"
    },
    {
        "source_sentence": "天子言：「以何方便？」",
        "translation": "The celestial prince said, What's the method?",
        "source": "T24n1490_001:1085a27_52"
    },
    {
        "source_sentence": "文殊師利言：「若菩薩不捨菩提心而化度眾生攝受諸法，是菩薩有慳成就檀波羅蜜。」",
        "translation": "Mañjuśrī said, If a bodhisattva doesn't abandon the mind of enlightenment and transform sentient beings to receive dharmas, this is a bodhisattva who has stinginess and accomplishes the perfection of giving.",
        "source": "T24n1490_001:1085a28_53"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1085b01_54"
    },
    {
        "source_sentence": "頗有菩薩捨戒成就尸波羅蜜不？」",
        "translation": "Could it be that there's a bodhisattva who abandons the precepts and accomplishes the perfection of morality?",
        "source": "T24n1490_001:1085b01_55"
    },
    {
        "source_sentence": "曰：「有。」",
        "translation": "He said, Yes.",
        "source": "T24n1490_001:1085b02_56"
    },
    {
        "source_sentence": "天子言：「以何方便？」",
        "translation": "The celestial prince said, What's the method?",
        "source": "T24n1490_001:1085b02_57"
    },
    {
        "source_sentence": "文殊師利言：「若菩薩以化度眾生故為於眾生，是菩薩無戒成就尸波羅蜜。」",
        "translation": "Mañjuśrī said, If a bodhisattva creates sentient beings for the sake of transforming sentient beings, this is a bodhisattva who accomplishes the perfection of morality without precepts.",
        "source": "T24n1490_001:1085b02_58"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1085b04_59"
    },
    {
        "source_sentence": "頗有菩薩捨忍成就羼提波羅蜜不？」",
        "translation": "Could it be that there's a bodhisattva who abandons the perfection of forbearance and accomplishes the perfection of kṣatriya?",
        "source": "T24n1490_001:1085b05_0"
    },
    {
        "source_sentence": "曰：「有。」",
        "translation": "He said, Yes.",
        "source": "T24n1490_001:1085b05_1"
    },
    {
        "source_sentence": "天子言：「以何方便？」",
        "translation": "The celestial prince said, What's the method?",
        "source": "T24n1490_001:1085b05_2"
    },
    {
        "source_sentence": "文殊師利言：「若菩薩捨一切異道忍修佛法忍，是菩薩捨忍成就羼提波羅蜜。」",
        "translation": "Mañjuśrī said, If a bodhisattva abandons the forbearance of all heretics and cultivates the forbearance of the Buddha's teachings, this is a bodhisattva who abandons forbearance and accomplishes the perfection of kṣatriya.",
        "source": "T24n1490_001:1085b06_3"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1085b08_4"
    },
    {
        "source_sentence": "頗有菩薩捨於精進成就毘梨耶波羅蜜不？」",
        "translation": "Could it be that there are bodhisattvas who abandon effort and accomplish the perfection of vīrya-pāramitā?",
        "source": "T24n1490_001:1085b08_5"
    },
    {
        "source_sentence": "曰：「有。」",
        "translation": "He said, Yes.",
        "source": "T24n1490_001:1085b09_6"
    },
    {
        "source_sentence": "天子言：「以何方便？」",
        "translation": "The celestial prince said, What's the method?",
        "source": "T24n1490_001:1085b09_7"
    },
    {
        "source_sentence": "文殊師利言：「若菩薩捨聲聞辟支佛精進趣等正覺菩提，是菩薩捨精進成就毘梨耶波羅蜜。」",
        "translation": "Mañjuśrī said, If a bodhisattva abandons the śrāvakas and pratyekbuddhas' effort to attain the enlightenment of perfect enlightenment, this is a bodhisattva who abandons effort and accomplishes the perfection of vīrya-pāramitā.",
        "source": "T24n1490_001:1085b10_8"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1085b12_9"
    },
    {
        "source_sentence": "頗有菩薩忘念成就禪波羅蜜不？」",
        "translation": "Could it be that there are bodhisattvas who forget the accomplishment of the perfection of meditation?",
        "source": "T24n1490_001:1085b12_10"
    },
    {
        "source_sentence": "曰：「有。」",
        "translation": "He said, Yes.",
        "source": "T24n1490_001:1085b13_11"
    },
    {
        "source_sentence": "天子言：「以何方便？」",
        "translation": "The celestial prince said, What's the method?",
        "source": "T24n1490_001:1085b13_12"
    },
    {
        "source_sentence": "文殊師利言：「若菩薩乃至夢中不生聲聞辟支佛念，常定不捨等正覺心，是菩薩忘念成就禪波羅蜜。」",
        "translation": "Mañjuśrī said, If a bodhisattva doesn't give rise to the mindfulness of śrāvakas and pratyekbuddhas even in a dream and always concentrates on not abandoning the mind of perfect enlightenment, this is a bodhisattva forgetting to accomplish the perfection of meditation.",
        "source": "T24n1490_001:1085b14_0"
    },
    {
        "source_sentence": "天子言：「文殊師利！",
        "translation": "The celestial prince said, Mañjuśrī!",
        "source": "T24n1490_001:1085b16_1"
    },
    {
        "source_sentence": "頗有菩薩無智慧成就般若波羅蜜不？」",
        "translation": "Could it be that there are bodhisattvas who lack wisdom and accomplish the perfection of prajñāpāramitā?",
        "source": "T24n1490_001:1085b16_2"
    },
    {
        "source_sentence": "曰：「有。」",
        "translation": "He said, Yes.",
        "source": "T24n1490_001:1085b17_3"
    },
    {
        "source_sentence": "天子言：「以何方便？」",
        "translation": "The celestial prince said, What's the method?",
        "source": "T24n1490_001:1085b17_4"
    },
    {
        "source_sentence": "文殊師利言：「若菩薩一切世間蠱道起尸諸惡呪術，於中無慧，唯為成就攝一切智，是菩薩無慧成就般若波羅蜜。」",
        "translation": "Mañjuśrī said, If a bodhisattva engages in the bad spells of all the world's demonic paths and creates corpses that lack wisdom but only want to achieve omniscience, this is a bodhisattva who accomplishes the perfection of prajñāpāramitā without wisdom because he doesn't have wisdom.",
        "source": "T24n1490_001:1085b18_5"
    },
    {
        "source_sentence": "爾時世尊嘆文殊師利法王子言：「善哉善哉！",
        "translation": "It was then that the Bhagavān praised Mañjuśrī, the prince of the Dharma, saying, Good, good!",
        "source": "T24n1490_001:1085b21_0"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T24n1490_001:1085b22_0"
    },
    {
        "source_sentence": "善說菩薩摩訶薩所應行、所不應行。",
        "translation": "He well explains what the bodhisattva-mahāsattva should and shouldn't practice.",
        "source": "T24n1490_001:1085b22_1"
    },
    {
        "source_sentence": "又文殊師利！",
        "translation": "Also, Mañjuśrī!",
        "source": "T24n1490_001:1085b23_2"
    },
    {
        "source_sentence": "吾當為汝說喻重明此義。",
        "translation": "I will explain this meaning again for you, using metaphors.",
        "source": "T24n1490_001:1085b23_3"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T24n1490_001:1085b24_0"
    },
    {
        "source_sentence": "譬如有人飢渴羸瘦，彼人寧忍飢渴終不食於雜毒之食。",
        "translation": "It's like a person who suffers from hunger, thirst, and weakness, but they tolerate hunger and thirst and never eat food that's mixed with poison.",
        "source": "T24n1490_001:1085b24_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1490_001:1085b25_2"
    },
    {
        "source_sentence": "食可畏故。",
        "translation": "It's because food is fearsome.",
        "source": "T24n1490_001:1085b25_3"
    },
    {
        "source_sentence": "如是文殊師利！",
        "translation": "Thus, Mañjuśrī!",
        "source": "T24n1490_001:1085b25_4"
    },
    {
        "source_sentence": "菩薩寧慳嫉破戒惡名懶惰忘念無慧，終不希求聲聞辟支佛地。",
        "translation": "Rather, the bodhisattva becomes stingy and jealous, breaks the precepts, is badly known as lazy, forgetful, and lacks wisdom, and never wants to seek the stage of śrāvaka or pratyekabuddha.",
        "source": "T24n1490_001:1085b26_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1490_001:1085b27_6"
    },
    {
        "source_sentence": "以可畏故。」",
        "translation": "It's because it's fearsome.",
        "source": "T24n1490_001:1085b28_7"
    },
    {
        "source_sentence": "天子白佛言：「世尊！",
        "translation": "The celestial prince said to the Buddha, Bhagavān!",
        "source": "T24n1490_001:1085b28_8"
    },
    {
        "source_sentence": "諸菩薩不畏煩惱耶？」",
        "translation": "Are the bodhisattvas not afraid of afflictions?",
        "source": "T24n1490_001:1085b28_9"
    },
    {
        "source_sentence": "佛告天子：「應畏煩惱，畏聲聞辟支佛地復過於彼。",
        "translation": "The Buddha told the celestial son, You should fear afflictions and fear the stages of śrāvakas and pratyekbuddhas that are even greater than those.",
        "source": "T24n1490_001:1085b29_10"
    },
    {
        "source_sentence": "又天子！",
        "translation": "Again, my lord!",
        "source": "T24n1490_001:1085c01_11"
    },
    {
        "source_sentence": "我今問汝，隨汝意答。",
        "translation": "I will now question you, and answer as you wish.",
        "source": "T24n1490_001:1085c01_12"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T24n1490_001:1085c02_13"
    },
    {
        "source_sentence": "於汝云何？",
        "translation": "What about you?",
        "source": "T24n1490_001:1085c02_14"
    },
    {
        "source_sentence": "樂生之人當畏何處，為畏斬首、斬支節耶？」",
        "translation": "Where should a person who enjoys birth be afraid, fearing cutting off their head and limbs?",
        "source": "T24n1490_001:1085c02_15"
    },
    {
        "source_sentence": "天子白佛言：「世尊！",
        "translation": "The celestial prince said to the Buddha, Bhagavān!",
        "source": "T24n1490_001:1085c03_16"
    },
    {
        "source_sentence": "畏於斬首。",
        "translation": "I'm afraid of cutting off my head.",
        "source": "T24n1490_001:1085c03_17"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1490_001:1085c04_18"
    },
    {
        "source_sentence": "斬支節能修福業生於勝處，其斬首者無有壽命不能修福。」",
        "translation": "A person who cuts off a branch and cultivates meritorious actions will be born in a superior place, but those who cut off their heads have no life span and can't cultivate virtue.",
        "source": "T24n1490_001:1085c04_19"
    },
    {
        "source_sentence": "佛告天子：「如是。",
        "translation": "The Buddha told the celestial being, So it is.",
        "source": "T24n1490_001:1085c05_20"
    },
    {
        "source_sentence": "菩薩寧毀禁戒終不捨見，寧有煩惱終不昇於聲聞決定。」",
        "translation": "A bodhisattva would rather disparage the precepts than abandon views, and he'd rather have afflictions than ascend to the śrāvaka stage of certainty.",
        "source": "T24n1490_001:1085c06_21"
    },
    {
        "source_sentence": "天子白佛言：「希有世尊！",
        "translation": "The celestial prince said to the Buddha, Rarely, Bhagavān!",
        "source": "T24n1490_001:1085c07_22"
    },
    {
        "source_sentence": "菩薩所行世所難信。",
        "translation": "It's difficult to believe in what the bodhisattva does in the world.",
        "source": "T24n1490_001:1085c07_23"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1490_001:1085c08_24"
    },
    {
        "source_sentence": "聲聞之人持戒精進，乃是菩薩破戒懶惰。」",
        "translation": "A śrāvaka who observes the precepts and makes effort is a bodhisattva who breaks the precepts and lazy.",
        "source": "T24n1490_001:1085c08_25"
    },
    {
        "source_sentence": "佛告天子：「如汝所言，如貧人食是轉輪王毒。",
        "translation": "The Buddha told the celestial being, Just as you said, it's like a poor man who eats the poison of the wheel-turning king.",
        "source": "T24n1490_001:1085c09_26"
    },
    {
        "source_sentence": "如是天子！",
        "translation": "So it is, my lord!",
        "source": "T24n1490_001:1085c10_27"
    },
    {
        "source_sentence": "聲聞之人持戒精進，即是菩薩破戒懶惰。",
        "translation": "A śrāvaka who observes the precepts and makes effort is a bodhisattva who breaks the precepts and lazy.",
        "source": "T24n1490_001:1085c10_28"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T24n1490_001:1085c11_29"
    },
    {
        "source_sentence": "喻如有人庸作自活，其人尚自不能資眾眷屬令得快樂，況復餘人。",
        "translation": "It's a metaphor for someone who makes their own living in vain, but they can't yet support themselves and their dependents to attain happiness, so why wouldn't others?",
        "source": "T24n1490_001:1085c11_30"
    },
    {
        "source_sentence": "如是天子！",
        "translation": "So it is, my lord!",
        "source": "T24n1490_001:1085c13_31"
    },
    {
        "source_sentence": "聲聞精進為自斷結以此精進，不能令閻浮提人得樂，況餘一切。",
        "translation": "Because śrāvakas' exertion is to cut the bond of self-discipline, this exertion can't cause people in Jambudvīpa to attain happiness, much less all the others.",
        "source": "T24n1490_001:1085c13_32"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T24n1490_001:1085c15_33"
    },
    {
        "source_sentence": "如大商主多饒財寶，常樂賑給精進不息，則能利益一切眾生。",
        "translation": "It's like a great merchant lord who has abundant wealth and treasure, always happy to provide them with energy and effort without cease, then he can benefit all sentient beings.",
        "source": "T24n1490_001:1085c15_34"
    },
    {
        "source_sentence": "如是天子！",
        "translation": "So it is, my lord!",
        "source": "T24n1490_001:1085c16_35"
    },
    {
        "source_sentence": "菩薩專心精進成就悲愍，則能利益一切眾生，為無量眾生而作樂因，能授世間出世間之樂。」",
        "translation": "When a bodhisattva focuses his mind on effort and accomplishes compassion, he's able to benefit all sentient beings, create causes of happiness for measureless sentient beings, and give them worldly and transmundane happiness.",
        "source": "T24n1490_001:1085c17_0"
    },
    {
        "source_sentence": "爾時長老摩訶迦葉白佛言：「世尊！",
        "translation": "It was then that the elder Mahākāśyapa said to the Buddha, Bhagavān!",
        "source": "T24n1490_001:1085c20_0"
    },
    {
        "source_sentence": "聲聞之人證無為法，菩薩之人到於有為。",
        "translation": "A śrāvaka person realizes the principle of nonexistence, and a bodhisattva person arrives at existence.",
        "source": "T24n1490_001:1085c20_1"
    },
    {
        "source_sentence": "到有為者，云何輕蔑到無為者？」",
        "translation": "If someone arrives at the conditioned, how can they despise those who arrive at the unconditioned?",
        "source": "T24n1490_001:1085c21_2"
    },
    {
        "source_sentence": "佛告迦葉：「吾當為汝說喻以明此義。",
        "translation": "The Buddha told Kāśyapa, I will explain this meaning by speaking a metaphor for you.",
        "source": "T24n1490_001:1085c22_3"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T24n1490_001:1085c23_4"
    },
    {
        "source_sentence": "喻四大海滿中生酥，有人析於一毛以為百分，以一分毛取酥一渧。",
        "translation": "It's a metaphor for the four great oceans full of butter that grow in the middle, where someone divides a hair into a hundred parts and takes a grain of butter with one hair.",
        "source": "T24n1490_001:1085c23_5"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T24n1490_001:1085c25_0"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T24n1490_001:1085c25_1"
    },
    {
        "source_sentence": "一分毛渧能輕滿四海生酥不？」",
        "translation": "Can a part of the hair that covers the four seas and gives rise to butter?",
        "source": "T24n1490_001:1085c25_2"
    },
    {
        "source_sentence": "迦葉白佛言：「世尊！",
        "translation": "Kāśyapa said to the Buddha, Bhagavān!",
        "source": "T24n1490_001:1085c26_3"
    },
    {
        "source_sentence": "不能輕也。」",
        "translation": "They can't despise it.",
        "source": "T24n1490_001:1085c26_4"
    },
    {
        "source_sentence": "佛告迦葉：「於汝意云何？",
        "translation": "The Buddha told Kāśyapa, What do you think?",
        "source": "T24n1490_001:1085c26_5"
    },
    {
        "source_sentence": "此二酥中何者為多？",
        "translation": "Which of these two kinds of butter is abundant?",
        "source": "T24n1490_001:1085c27_6"
    },
    {
        "source_sentence": "何者價貴？」",
        "translation": "What's the value?",
        "source": "T24n1490_001:1085c27_7"
    },
    {
        "source_sentence": "迦葉復白佛言：「世尊！",
        "translation": "Kāśyapa again said to the Buddha, Bhagavān!",
        "source": "T24n1490_001:1085c28_8"
    },
    {
        "source_sentence": "一大海生酥億百千分之一尚多尚勝，況復四海。」",
        "translation": "A hundred million parts of the butter produced from one great ocean is still superior, so why wouldn't it be like the four seas?",
        "source": "T24n1490_001:1085c28_9"
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "Kasyapa!",
        "source": "T24n1490_001:1085c29_10"
    },
    {
        "source_sentence": "如百分毛一所舉酥渧，當知聲聞無為智亦爾。",
        "translation": "It should be known that the same applies to the unconditioned knowledge of the sravakas as to the one hundredth part of a hair which lifts up a loaf of butter.",
        "source": "T24n1490_001:1085c29_11"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T24n1490_001:1086a02_0"
    },
    {
        "source_sentence": "如四大海生酥，當知菩薩有為善根百千阿僧祇劫迴向一切智亦復如是。",
        "translation": "Just as the four great oceans produce butter, you should know that bodhisattvas dedicate hundreds of thousands of incalculably long eons of conditioned good roots to omniscience are likewise.",
        "source": "T24n1490_001:1086a02_1"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T24n1490_001:1086a03_2"
    },
    {
        "source_sentence": "喻如蟻子取一粒穀，比秋月穀成熟之時一切大地所有諸穀。",
        "translation": "It's like an ant child who takes a grain of grain and compares it to all the grains on the earth that exist in the autumn moon when the grain matures.",
        "source": "T24n1490_001:1086a03_3"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T24n1490_001:1086a05_4"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T24n1490_001:1086a05_5"
    },
    {
        "source_sentence": "如此二穀何者多勝？」",
        "translation": "Which of these two grains is the most superior?",
        "source": "T24n1490_001:1086a05_6"
    },
    {
        "source_sentence": "迦葉白佛言：「世尊！",
        "translation": "Kāśyapa said to the Buddha, Bhagavān!",
        "source": "T24n1490_001:1086a06_7"
    },
    {
        "source_sentence": "秋月熟時無量眾生各得受用，此為多勝。」",
        "translation": "When the autumn months are ripe, measureless sentient beings each get to experience it, which is often superior.",
        "source": "T24n1490_001:1086a06_8"
    },
    {
        "source_sentence": "「如是迦葉！",
        "translation": "So it is, Kāśyapa!",
        "source": "T24n1490_001:1086a07_9"
    },
    {
        "source_sentence": "如蟻子所取一粒之穀，當知聲聞解脫果亦復如是。",
        "translation": "Just as the ants take a grain of grain taken by an ant, you should know that the fruit of śrāvaka liberation is likewise.",
        "source": "T24n1490_001:1086a07_10"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T24n1490_001:1086a08_11"
    },
    {
        "source_sentence": "猶如秋月一切大地苗稼成熟，當知菩薩具六波羅蜜四攝善根此成熟已，則能利益無量眾生，亦復如是。",
        "translation": "Just as in the autumn months, when all the seedlings and crops of the earth are ripened, it should be known that bodhisattvas who possess the four good roots of the six perfections and accomplish these maturations can then benefit measureless sentient beings, just as they do.",
        "source": "T24n1490_001:1086a09_12"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T24n1490_001:1086a11_13"
    },
    {
        "source_sentence": "喻如百千駄水精器來入城邑；",
        "translation": "It is as if a hundred thousand jars of water spirits had come and gone into the city.",
        "source": "T24n1490_001:1086a11_14"
    },
    {
        "source_sentence": "復有一無價琉璃寶珠，於大海中載船舫上，安隱得至閻浮提界，到已則能除人貧乏窮患。",
        "translation": "There was also a priceless lapis lazuli jewel that could be carried on a boatboat in the ocean and safely reached the Jambudvīpa realm. On arriving there, it would remove the poverty and misery of the poor and impoverished people.",
        "source": "T24n1490_001:1086a12_15"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T24n1490_001:1086a14_16"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T24n1490_001:1086a14_17"
    },
    {
        "source_sentence": "諸水精器頗能輕此無價琉璃寶不？」",
        "translation": "Could the water spirit vessels despise this priceless lapis lazuli treasure?",
        "source": "T24n1490_001:1086a14_18"
    },
    {
        "source_sentence": "迦葉白佛言：「不敢輕也。」",
        "translation": "Kāśyapa said to the Buddha, I wouldn't dare to despise him.",
        "source": "T24n1490_001:1086a15_19"
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "Kasyapa!",
        "source": "T24n1490_001:1086a16_20"
    },
    {
        "source_sentence": "如水精駄入城邑者，當知聲聞無為亦復如是。",
        "translation": "Like a water spirit that enters a city, you should know that śrāvakas and non-being are likewise.",
        "source": "T24n1490_001:1086a16_21"
    },
    {
        "source_sentence": "如無價琉璃大寶，當知菩薩紹三寶種使不斷絕、生一切智寶心，亦復如是。」",
        "translation": "Like the priceless great lapis lazuli treasure, you should know that the bodhisattva's cultivation of the seeds of the three treasures doesn't stop or give rise to the mind of all the treasures of wisdom, and so it is likewise.",
        "source": "T24n1490_001:1086a17_22"
    },
    {
        "source_sentence": "爾時長老摩訶迦葉白佛言：「希有世尊！",
        "translation": "It was then that the elder Mahākāśyapa said to the Buddha, Rarely, Bhagavān!",
        "source": "T24n1490_001:1086a20_0"
    },
    {
        "source_sentence": "如來善說！",
        "translation": "The Tathāgata well explains!",
        "source": "T24n1490_001:1086a20_1"
    },
    {
        "source_sentence": "一薩婆若心寶菩薩，則勝一切聲聞辟支佛。」",
        "translation": "One is the bodhisattva of the mind treasure of sarvajña, which is superior to all śrāvakas and pratyekbuddhas.",
        "source": "T24n1490_001:1086a21_2"
    },
    {
        "source_sentence": "爾時寶相如來剎土諸來菩薩，聞說此法已咸懷希有，白佛言：「世尊！",
        "translation": "It was then that the buddhas and bodhisattvas of the Jewel-Shaped Tathāgata's land heard this teaching, and they all harbored a rare treasure and said to the Buddha, Bhagavān!",
        "source": "T24n1490_001:1086a22_3"
    },
    {
        "source_sentence": "此諸所說皆是戲論，有種種垢淨起諸異說。",
        "translation": "These explanations are all conceptual elaborations, with various kinds of defilement and purity that give rise to different explanations.",
        "source": "T24n1490_001:1086a23_4"
    },
    {
        "source_sentence": "彼寶相如來剎土，唯說菩薩不退轉法，無煩惱纏。",
        "translation": "The buddha land of the Jewel-Shaped Tathāgata only explains the bodhisattva's principle of nonretrogression, which has no afflictive fetters.",
        "source": "T24n1490_001:1086a24_5"
    },
    {
        "source_sentence": "希有難及！",
        "translation": "It's rare and difficult to reach!",
        "source": "T24n1490_001:1086a25_6"
    },
    {
        "source_sentence": "釋迦如來、應、正遍知乃能堪忍如是煩惱，於無分別一味法中說上中下，顯示三乘差別之異。」",
        "translation": "The Śākyamuni Tathāgata, Arhat, and Perfectly Enlightened One are able to tolerate such afflictions, explaining the superior, middle, and inferior in the single flavor of nondiscriminating dharmas to show the differences between the three vehicles.",
        "source": "T24n1490_001:1086a26_7"
    },
    {
        "source_sentence": "爾時諸菩薩以諸天花供養如來已，謂文殊師利法王子言：「文殊師利！",
        "translation": "After they had offered heavenly flowers to the Tathāgata, the bodhisattvas addressed Mañjuśrī, the prince of the Dharma, saying, Mañjuśrī!",
        "source": "T24n1490_001:1086a28_8"
    },
    {
        "source_sentence": "我等欲還寶住世界。」",
        "translation": "We want to return to the world of the treasure-abiding world.",
        "source": "T24n1490_001:1086a29_9"
    },
    {
        "source_sentence": "文殊師利言：「善男子等！",
        "translation": "Mañjuśrī said, Good men!",
        "source": "T24n1490_001:1086b01_10"
    },
    {
        "source_sentence": "宜知是時。」",
        "translation": "It's better to know when it's the right time.",
        "source": "T24n1490_001:1086b01_11"
    },
    {
        "source_sentence": "諸菩薩言：「仁者不俱去耶？」",
        "translation": "The bodhisattvas said, Sir, won't you both leave?",
        "source": "T24n1490_001:1086b02_12"
    },
    {
        "source_sentence": "文殊師利言：「善男子！",
        "translation": "Mañjuśrī said, Good man!",
        "source": "T24n1490_001:1086b02_13"
    },
    {
        "source_sentence": "剎土平等、佛法及眾生平等處，我欲樂是當趣是處。」",
        "translation": "The equality of the buddha-lands, the Buddha's teachings, and the equality of sentient beings are the places where I want to be happy, so I'll go there.",
        "source": "T24n1490_001:1086b03_14"
    },
    {
        "source_sentence": "諸菩薩曰：「文殊師利！",
        "translation": "The bodhisattvas said, Mañjuśrī!",
        "source": "T24n1490_001:1086b04_15"
    },
    {
        "source_sentence": "以何方便？」",
        "translation": "What's the method?",
        "source": "T24n1490_001:1086b04_16"
    },
    {
        "source_sentence": "文殊師利言：「一切剎土平等無盡故，諸佛等正覺不可思議，一切法空，眾生自性無我。",
        "translation": "Mañjuśrī said, Because all buddha lands are equal and inexhaustible, the buddhas and other perfectly enlightened ones are inconceivable, all dharmas are empty, and sentient beings have no self in their own nature.",
        "source": "T24n1490_001:1086b05_17"
    },
    {
        "source_sentence": "諸善男子！",
        "translation": "“O sons of the virtuous!",
        "source": "T24n1490_001:1086b07_18"
    },
    {
        "source_sentence": "我觀平等性如是，故作是說，言一切剎土平等、一切佛法眾生平等故，我趣是處。」",
        "translation": "Because I observe the equality of equality as such, I say this, saying that it's because all buddha-lands are equal and all buddha-dharma sentient beings are equal, and my destinies are the same place.",
        "source": "T24n1490_001:1086b07_19"
    },
    {
        "source_sentence": "於是文殊師利即入三昧，變此世界如寶住世界，一切大眾咸悉得見無增無減，亦見世尊釋迦牟尼色貌形體如寶相如來，諸聲聞眾皆如彼菩薩形色相貌。",
        "translation": "Mañjuśrī then entered samādhi and transformed this world into a world like the jeweled abode, where all the masses saw nothing increase or decrease, and they also saw the Bhagavān Śākyamuni's form and body as the Jewel-Shaped Tathāgata, and the śrāvakas all looked like that bodhisattva's form and shape.",
        "source": "T24n1490_001:1086b09_20"
    },
    {
        "source_sentence": "時彼菩薩見是相已，皆謂已到寶住世界，咸謂釋迦牟尼佛即是寶相如來，而白佛言：「世尊！",
        "translation": "Seeing these marks, the bodhisattvas all said they had arrived at the world of the jeweled abode, and they all said that Śākyamuni Buddha was the Jeweled Tathāgata. They said to the Buddha, Bhagavān!",
        "source": "T24n1490_001:1086b12_21"
    },
    {
        "source_sentence": "誰將我等還此世界？」",
        "translation": "Who will take us back to this world?",
        "source": "T24n1490_001:1086b14_22"
    },
    {
        "source_sentence": "佛告諸菩薩：「善男子等！",
        "translation": "The Buddha told the bodhisattvas, Good sons!",
        "source": "T24n1490_001:1086b15_23"
    },
    {
        "source_sentence": "云汝等去時誰將汝去？」",
        "translation": "When you leave, who will take you away?",
        "source": "T24n1490_001:1086b15_24"
    },
    {
        "source_sentence": "諸菩薩言：「文殊師利法王子。」",
        "translation": "The bodhisattvas said, Mañjuśrī, the Dharma prince Mañjuśrī.",
        "source": "T24n1490_001:1086b16_25"
    },
    {
        "source_sentence": "佛告諸菩薩：「亦彼將還。」",
        "translation": "The Buddha told the bodhisattvas, So will they return.",
        "source": "T24n1490_001:1086b17_26"
    },
    {
        "source_sentence": "時文殊師利從三昧出，謂諸菩薩言：「善男子！",
        "translation": "Mañjuśrī then emerged from samādhi and said to the bodhisattvas, Good sons!",
        "source": "T24n1490_001:1086b17_27"
    },
    {
        "source_sentence": "各念三昧。」",
        "translation": "Each one is mindful of the samādhi.",
        "source": "T24n1490_001:1086b18_28"
    },
    {
        "source_sentence": "時諸菩薩各各念已，所得三昧現在前已，而作是念：「希有希有！",
        "translation": "After each thought, the bodhisattvas each had their own samādhi that they had attained now in front of them, and they thought, Rarely rare!",
        "source": "T24n1490_001:1086b18_29"
    },
    {
        "source_sentence": "我等今者猶在於此，乃謂已到寶住世界。」",
        "translation": "We're still here now, saying that we've arrived at the world where the treasures live.",
        "source": "T24n1490_001:1086b20_30"
    },
    {
        "source_sentence": "時諸菩薩怪未曾有，而白佛言：「甚奇世尊！",
        "translation": "The bodhisattvas wondered at this unprecedented thing and said to the Buddha, How marvelous, Bhagavān!",
        "source": "T24n1490_001:1086b21_31"
    },
    {
        "source_sentence": "文殊師利法王子乃能有是不可思議神通定力。",
        "translation": "Mañjuśrī, the prince of the Dharma, is capable of possessing this inconceivable power of supernormal concentration.",
        "source": "T24n1490_001:1086b22_32"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T24n1490_001:1086b23_33"
    },
    {
        "source_sentence": "願諸眾生得神通力，如文殊師利。」",
        "translation": "May all sentient beings attain the power of supernormal abilities like Mañjuśrī.",
        "source": "T24n1490_001:1086b23_34"
    },
    {
        "source_sentence": "佛告諸菩薩言：「善男子等！",
        "translation": "The Buddha told the bodhisattvas, Good sons!",
        "source": "T24n1490_001:1086b24_35"
    },
    {
        "source_sentence": "喻如金銀、頗梨、金剛、栴檀等寶器及瓦器等，是諸器等皆受空界。",
        "translation": "It's a metaphor like gold, silver, pāri, adamantine, sandalwood, other precious vessels, and tile vessels, which are all subject to the realm of emptiness.",
        "source": "T24n1490_001:1086b24_36"
    },
    {
        "source_sentence": "空界遍在諸器，以空界平等故。",
        "translation": "The realm of emptiness pervades all containers because the realm of emptiness is equal.",
        "source": "T24n1490_001:1086b26_37"
    },
    {
        "source_sentence": "如是善男子等！",
        "translation": "So it is, good men!",
        "source": "T24n1490_001:1086b27_38"
    },
    {
        "source_sentence": "若法、如、際及空，此等諸法即一無差，入第一義空故。",
        "translation": "If there are dharmas, thusness, limits, and emptiness, these dharmas are one and the same without distinction, because they enter into the emptiness of the ultimate truth.",
        "source": "T24n1490_001:1086b27_39"
    },
    {
        "source_sentence": "而彼眾生以作種種行故，受種種生、示現千種我，分化成若干千色，所受地獄、畜生、餓鬼、人、天色，聲聞、辟支佛、菩薩、佛色。",
        "translation": "Because of their various actions, those sentient beings are subject to various births and show a thousand kinds of self, which are transformed into thousands of forms that are received by hells, animals, hungry ghosts, humans, gods, śrāvakas, pratyekbuddhas, bodhisattvas, and buddha forms.",
        "source": "T24n1490_001:1086b28_40"
    },
    {
        "source_sentence": "此等諸色雖皆可見，平等、色如、色空，等一無差、無有別異。",
        "translation": "Although these forms are all visible, equality, form, suchness, and form and emptiness are the same without difference or distinction.",
        "source": "T24n1490_001:1086c02_41"
    },
    {
        "source_sentence": "善男子等！",
        "translation": "Good sons and so forth!",
        "source": "T24n1490_001:1086c03_42"
    },
    {
        "source_sentence": "以是義故當如是知。」",
        "translation": "Because of this meaning, you should thus know it.",
        "source": "T24n1490_001:1086c03_43"
    },
    {
        "source_sentence": "文殊師利法王子言：「一切剎土等無別異故，一切佛等，一切法等、一切眾生等，無差別故。」",
        "translation": "Mañjuśrī the Dharma prince said, All buddha-lands and so forth are without distinctions, because all buddhas and so forth, all dharmas and so forth, and all sentient beings and so forth are without distinctions.",
        "source": "T24n1490_001:1086c04_44"
    },
    {
        "source_sentence": "時諸菩薩受世尊如法教法，深生厭離心得喜悅，頂禮佛足右遶三匝。",
        "translation": "The bodhisattvas then accepted the Bhagavān's teaching according to the Dharma, became deeply disillusioned and joyous, bowed their heads at the Buddha's feet, circled him three times to his right, and circumambulated him.",
        "source": "T24n1490_001:1086c06_45"
    },
    {
        "source_sentence": "離世尊已，即於娑婆世界不現，還至寶住世界。",
        "translation": "After leaving the Bhagavān, he didn't appear in the sahā world and returned to the Jewel-abiding World.",
        "source": "T24n1490_001:1086c08_0"
    },
    {
        "source_sentence": "爾時世尊告慧命阿難言：「阿難！",
        "translation": "It was then that the Bhagavān addressed Huiwei Ānanda, saying, Ānanda!",
        "source": "T24n1490_001:1086c09_1"
    },
    {
        "source_sentence": "此勝經典汝當受持讀誦廣令通利。",
        "translation": "You should memorize and recite this excellent sūtra to make it widely known.",
        "source": "T24n1490_001:1086c09_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1490_001:1086c10_3"
    },
    {
        "source_sentence": "若能以此經典廣為人說，若能故聽受者，則得無量福聚。」",
        "translation": "If someone can explain this sūtra extensively for others, and if they can listen and accept it for that reason, they'll attain an immeasurable stock of merit.",
        "source": "T24n1490_001:1086c10_4"
    },
    {
        "source_sentence": "阿難白佛言：「唯然世尊！",
        "translation": "Ānanda said to the Buddha, Yes, Bhagavān!",
        "source": "T24n1490_001:1086c12_5"
    },
    {
        "source_sentence": "我已受持。",
        "translation": "I've accepted and upheld it.",
        "source": "T24n1490_001:1086c12_6"
    },
    {
        "source_sentence": "當何名此經？",
        "translation": "What is the name of this sutra?",
        "source": "T24n1490_001:1086c12_7"
    },
    {
        "source_sentence": "云何奉持？」",
        "translation": "How do you consecrate it?",
        "source": "T24n1490_001:1086c13_8"
    },
    {
        "source_sentence": "佛告阿難：「此經當名『寂調音所問』，如是受持；",
        "translation": "The Buddha said to Ānanda: This sutra should be called the Questions Asked by Silently Harmonizing Sound.",
        "source": "T24n1490_001:1086c13_9"
    },
    {
        "source_sentence": "又名『如來所說清淨調伏受持』。」",
        "translation": "It's also called the pure discipline and acceptance of what the Tathāgata teaches.",
        "source": "T24n1490_001:1086c14_10"
    },
    {
        "source_sentence": "佛說經竟，寂調音天子、文殊師利法王子，長老摩訶迦葉、慧命阿難，及諸時會大眾，天、龍、夜叉、乾闥婆、阿修羅、護世等，聞佛所說，歡喜奉行。",
        "translation": "When the Buddha finished speaking the sūtra, the god Śikhin and Mañjuśrī, the Dharma prince Mañjuśrī, the elder Mahākāśyapa, Wisdom Life Ānanda, as well as the assembly of gods, dragons, yakṣas, gandharvas, asuras, world protectors, and so forth heard what the Buddha taught and rejoiced and carried it out.",
        "source": "T24n1490_001:1086c15_11"
    },
    {
        "source_sentence": "寂調音所問經",
        "translation": "Sutra of the Questions Asked by Silently Harmonizing Sound",
        "source": "T24n1490_001:1086c19_0"
    }
]