[
    {
        "source_sentence": "根本說一切有部毘奈耶雜事",
        "translation": "Mūlasarvâstivāda-vinaya miscellaneous matters",
        "source": "T24n1451_031:0357c14_0"
    },
    {
        "source_sentence": "卷第三十一",
        "translation": "(Skt. 31).",
        "source": "T24n1451_031:0357c15_0"
    },
    {
        "source_sentence": "三藏法師義淨奉　制譯",
        "translation": "translated by the Tripiṭaka Master Yogâcārabhūmi in Sanskrit",
        "source": "T24n1451_031:0357c17_0"
    },
    {
        "source_sentence": "　尼不在前行、　　見僧應起敬、",
        "translation": "A nun who doesn't go before a monk, sees the saṃgha and should show respect.",
        "source": "T24n1451_031:0357c18_0"
    },
    {
        "source_sentence": "　白僧半加坐、　　歸俗詰無緣。",
        "translation": "He said to the saṃgha that he was half-sitting, returning to secular life without a reason.",
        "source": "T24n1451_031:0357c18_0"
    },
    {
        "source_sentence": "第六門第七子攝頌曰：緣處同前。",
        "translation": "The sixth aspect, the seventh son, gathers a verse that says, Conditioned places are the same as the previous one.",
        "source": "T24n1451_031:0357c18_0"
    },
    {
        "source_sentence": "爾時具壽大迦攝波，在鹿子母東林住處，於小食時著衣持鉢入城乞食。",
        "translation": "It was then that the long-lived Kāśyapa Mahākāśyapa, who lived in the deer's mother's east forest dwelling place, put on his robe and bowl at the time of a small meal and entered the city to solicit alms.",
        "source": "T24n1451_031:0357c21_1"
    },
    {
        "source_sentence": "吐羅難陀尼亦復乞食，遙見大迦攝波便作是念：「我今宜可治此愚人。」",
        "translation": "Tārānandaṇi also begged for food, and when he saw Mahākāśyapa from a distance, he thought, Now, it's appropriate for me to treat this foolish man.",
        "source": "T24n1451_031:0357c22_2"
    },
    {
        "source_sentence": "若迦攝波次第至家，吐羅難陀即先入其舍，在門扇後立。",
        "translation": "If Kāśyapa goes home one by one, Tūrananda enters his house first and stands behind the door and fan.",
        "source": "T24n1451_031:0357c24_3"
    },
    {
        "source_sentence": "迦攝波來，告言：「聖者！",
        "translation": "Kāśyapa came and told him, Sage!",
        "source": "T24n1451_031:0357c25_4"
    },
    {
        "source_sentence": "宜過家，無熟食。」",
        "translation": "It's better to leave home and have no cooked food.",
        "source": "T24n1451_031:0357c26_5"
    },
    {
        "source_sentence": "尊者即去。",
        "translation": "The venerable then departed.",
        "source": "T24n1451_031:0357c26_6"
    },
    {
        "source_sentence": "作是語已還至餘家，迦攝波來同前言告。",
        "translation": "After he said these words, he returned to his home, where Kāśyapa came and told him as before.",
        "source": "T24n1451_031:0357c26_7"
    },
    {
        "source_sentence": "如是展轉乃至多家，皆聞斯語情生怪異。",
        "translation": "They all heard these words and wondered at their feelings.",
        "source": "T24n1451_031:0357c27_8"
    },
    {
        "source_sentence": "若阿羅漢不豫觀者於事不知，便即入定觀誰惱我？",
        "translation": "If an arhat doesn't prepare for contemplation and doesn't know the matter, then he enters into meditation to contemplate who disturbs me?",
        "source": "T24n1451_031:0357c28_9"
    },
    {
        "source_sentence": "見吐羅難陀苾芻尼，告言：「姊妹！",
        "translation": "Seeing the Tūrananda bhikṣuṇī, he told her, Sister!",
        "source": "T24n1451_031:0357c29_10"
    },
    {
        "source_sentence": "汝今無愆，然是具壽阿難陀作斯過失，強請世尊令如是等惡行女類出家近圓。」",
        "translation": "Now, you're not angry, but this is the long-lived Ānanda who did this mistake and forcibly asked the Bhagavān to cause such badly practicing women to leave home and become intimate with him.",
        "source": "T24n1451_031:0358a01_11"
    },
    {
        "source_sentence": "諸苾芻聞以緣白佛，佛作是念：「由苾芻尼多有過患，苾芻乞食處苾芻尼不應前行。」",
        "translation": "When the monks heard this, they reported it to the Buddha for his sake, and he thought, Because there are so many faults with monks and nuns, monks and nuns who begging for food shouldn't go forward.",
        "source": "T24n1451_031:0358a03_12"
    },
    {
        "source_sentence": "作是念已告諸苾芻：「迦攝波善說其事，是故我今制諸苾芻尼，苾芻乞食尼不前行。」",
        "translation": "After he had this thought, he told the monks, Kāśyapa well explained these things; therefore, I now impose a rule for monks and nuns, so that monks and nuns who are begging for food won't go forward.",
        "source": "T24n1451_031:0358a05_13"
    },
    {
        "source_sentence": "諸苾芻尼便不敢行，因此乞求難得。",
        "translation": "The monks and nuns then didn't dare to go, so it was difficult to ask for alms.",
        "source": "T24n1451_031:0358a07_14"
    },
    {
        "source_sentence": "向苾芻說，苾芻以緣白佛，佛言：「苾芻乞處，苾芻尼避應行。」",
        "translation": "He told the monk, and the monk said to the Buddha for his sake, The Buddha said, A monk who begs a monk or nun avoids what should be done.",
        "source": "T24n1451_031:0358a08_0"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T24n1451_031:0358a10_0"
    },
    {
        "source_sentence": "時吐羅難陀苾芻尼，在無量百千大眾之中而為說法。",
        "translation": "The monks and nuns of Tūrananda then taught the Dharma to measureless hundreds of thousands of people.",
        "source": "T24n1451_031:0358a10_1"
    },
    {
        "source_sentence": "爾時具壽大迦攝波，因行至彼，眾見皆起，吐羅難陀端坐不動。",
        "translation": "It was then that the long-lived Kāśyapa Mahākāśyapa went there, and many views arose in him, while Tūrananda sat cross-legged without moving.",
        "source": "T24n1451_031:0358a11_2"
    },
    {
        "source_sentence": "眾人即白吐羅難陀曰：「聖者！",
        "translation": "The crowd then said to Tūrananda, Sage!",
        "source": "T24n1451_031:0358a12_3"
    },
    {
        "source_sentence": "大迦攝波人天恭敬，我等遙見咸悉驚起，聖者端然不移於座，極為不善。」",
        "translation": "The great Kāśyapa is respected by humans and gods, and we're all startled when we see him from a distance; the noble man stands straight up without moving his seat, which is extremely unwholesome.",
        "source": "T24n1451_031:0358a13_4"
    },
    {
        "source_sentence": "答曰：「彼乃元是外道邪徒，極愚極鈍而來出家，我是釋女從佛出家，博通三藏善閑說法，契合真理問答無滯，何合見彼從坐起焉？」",
        "translation": "He answered, It's because they were originally non-Buddhist and wrong-minded people who are extremely ignorant and dull and came to leave home. This is a Śākyamuni woman who left home from the Buddha and became well versed in the teachings of the Tripiṭaka and well-versed in the three collections, which accord with the truth and answer questions without obstruction, so why would it be fitting",
        "source": "T24n1451_031:0358a15_5"
    },
    {
        "source_sentence": "時眾聞已皆悉譏嫌。",
        "translation": "After the crowd heard this, they all criticized it.",
        "source": "T24n1451_031:0358a18_6"
    },
    {
        "source_sentence": "苾芻以緣白佛，佛言：「信心長者婆羅門等善作譏嫌，從今已後苾芻尼遙見苾芻應從坐起。",
        "translation": "The monks told the Buddha for this reason, and he said, Sir, the faithful elders, Brāhmaṇas, and others well criticized him, and from now on, the monks and nuns who saw the monks from a distance should get up from their seats.",
        "source": "T24n1451_031:0358a18_7"
    },
    {
        "source_sentence": "若有犯者得越法罪。」",
        "translation": "If someone violates it, they'll be guilty of transgressing the Dharma.",
        "source": "T24n1451_031:0358a20_8"
    },
    {
        "source_sentence": "如世尊說若見苾芻從坐起者，後於異時蓮華色苾芻尼，於寺門首為諸大眾演說法要。",
        "translation": "As the Bhagavān said, if he sees a monk rising from his seat, then at another time, the lotus-colored monks and nuns at the head of the monastery explain the essentials of the Dharma to the masses at the entrance of the monastery.",
        "source": "T24n1451_031:0358a21_9"
    },
    {
        "source_sentence": "時具壽阿難陀因行乞食至尼住處，蓮華色尼遙見彼來急從座起。",
        "translation": "Kauṣṭhila Ānanda then went to the nun's dwelling place for almsround, and the lotus-colored nun saw him from a distance and quickly got up from her seat.",
        "source": "T24n1451_031:0358a23_10"
    },
    {
        "source_sentence": "阿難陀來即坐其座，問言：「姊妹！",
        "translation": "Ānanda came and sat on his seat, asked, Sister!",
        "source": "T24n1451_031:0358a24_11"
    },
    {
        "source_sentence": "汝為大眾說何教法？」",
        "translation": "What teaching did you teach the masses?",
        "source": "T24n1451_031:0358a25_12"
    },
    {
        "source_sentence": "報言：「演說某經。」",
        "translation": "He replied, I'll explain a certain sūtra.",
        "source": "T24n1451_031:0358a25_13"
    },
    {
        "source_sentence": "于時具壽阿難陀即為大眾廣說其義，蓮華色尼一心佇立聽其說法。",
        "translation": "Kauśāmbī Ānanda then explained the meaning of this extensively for the masses, and the lotus-colored nun with one mind stood there to hear him teach.",
        "source": "T24n1451_031:0358a26_14"
    },
    {
        "source_sentence": "阿難陀為貪說法不令尼坐，久立疲倦被日照身熱悶倒地。",
        "translation": "Ānanda taught the Dharma for craving and didn't allow the nuns to sit, and after standing there for a long time, he was exhausted and sun-shrouded, his body feverish and downright.",
        "source": "T24n1451_031:0358a27_15"
    },
    {
        "source_sentence": "是時眾中無信心者共相議曰：「我聞蓮華色尼無諸染欲，今見阿難陀美貌容儀遂生異念，欲火燒心便即倒地。」",
        "translation": "Those in the crowd who had no faith then argued with each other, saying, I've heard that the lotus-colored nuns have no defiled desires, but now that they see Ānanda's beautiful appearance and demeanor give rise to a strange thought, and their minds are burned by the fire of desire and they fall to the ground.",
        "source": "T24n1451_031:0358a29_16"
    },
    {
        "source_sentence": "諸苾芻聞以緣白佛，佛言：「汝等苾芻！",
        "translation": "When the monks heard this, they reported it to the Buddha for his sake, and he said, You monks!",
        "source": "T24n1451_031:0358b02_17"
    },
    {
        "source_sentence": "諸長者婆羅門善說其過，從今已後若苾芻尼於苾芻處來聽法時，應言：『姊妹！",
        "translation": "The elders and brāhmaṇas well explain their faults, and from now on, if a monk or nun comes to the monk's place to listen to the teaching, they should say, 'Sister!'",
        "source": "T24n1451_031:0358b03_18"
    },
    {
        "source_sentence": "就座而坐。』",
        "translation": "He took his seat and sat down.'",
        "source": "T24n1451_031:0358b05_19"
    },
    {
        "source_sentence": "苾芻若為說法忘命令坐，苾芻尼應可白知，隨處安坐。」",
        "translation": "If a monk teaches the Dharma for them and forgets to order them to sit, the monks and nuns should tell him or her that they'll be seated wherever they are.",
        "source": "T24n1451_031:0358b05_20"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T24n1451_031:0358b07_0"
    },
    {
        "source_sentence": "如世尊說：「汝等苾芻！",
        "translation": "As the Bhagavān said, You monks!",
        "source": "T24n1451_031:0358b07_1"
    },
    {
        "source_sentence": "由此譬喻能解其義，汝等應聽我略教誨。",
        "translation": "Because these metaphors can understand their meaning, you should listen to my brief instruction.",
        "source": "T24n1451_031:0358b07_2"
    },
    {
        "source_sentence": "言日出者，謂是如來出現於世，喻如日出放大光明。",
        "translation": "The expression sun rising refers to the Tathāgata appearing in the world, which is a metaphor for the great ray of light emanating from the sun.",
        "source": "T24n1451_031:0358b08_3"
    },
    {
        "source_sentence": "眾鳥皆鳴者，謂說法人挍量義理。",
        "translation": "The sound that all the birds sing refers to the meaning and principle of the Dharma preacher's grossness.",
        "source": "T24n1451_031:0358b09_4"
    },
    {
        "source_sentence": "農夫耕作者，謂是諸餘信施檀越，於我弟子營福智田。",
        "translation": "The farmer and plower are the other faithful donors who provide for my disciples with a field of merit and wisdom.",
        "source": "T24n1451_031:0358b10_5"
    },
    {
        "source_sentence": "群賊皆散者，謂是魔軍及諸外道悉皆逃迸。",
        "translation": "Abandonment means that the armies of Māra and non-Buddhists all flee and burst into flames.",
        "source": "T24n1451_031:0358b11_6"
    },
    {
        "source_sentence": "如是苾芻，如來大師於諸聲聞弟子所應作者教令疾作，為欲哀愍以大悲心成就利益，所應作事我已作訖，汝等作者自可修行，當離諠鬧獨處閑居，往空林中在一樹下，或空室內或在山崖或依坎窟，或在草積，或於露地，或向塚間，或屍林處，隨宜臥具趣得支身。",
        "translation": "Thus, monks, the Tathāgata's great teacher instructed śrāvaka disciples to quickly do whatever they should do and ordered them to do it because he wanted to compassionately accomplish the benefit with a mind of great compassion, and I've done what should be done, so you authors can cultivate it for yourselves. You should leave the hustle and noise and live alone in a secluded",
        "source": "T24n1451_031:0358b12_7"
    },
    {
        "source_sentence": "如是等處當可端心，勤修靜慮莫為放逸，勿於後時情生悔恨。",
        "translation": "Such places should be well-maintained, diligently cultivating meditation and not being careless, and not having feelings of regret or resentment at later times.",
        "source": "T24n1451_031:0358b18_8"
    },
    {
        "source_sentence": "此則是我之所教誡。」",
        "translation": "This is what I've taught.",
        "source": "T24n1451_031:0358b20_9"
    },
    {
        "source_sentence": "時諸苾芻聞佛說已，便往山林坎窟之中，茂林清沼華果勝處，一心靜慮遠離放逸。",
        "translation": "After hearing the Buddha's teaching, the monks went to a mountain forest cave in a dense forest or clear marshes with flowers and fruit, singlemindedly meditating and free of carelessness.",
        "source": "T24n1451_031:0358b20_10"
    },
    {
        "source_sentence": "諸苾芻尼亦近王園，於闇林中或在餘處，受用隨時供身臥具加趺而坐宴默思惟。",
        "translation": "The bhikṣuṇīs also approached the king's park, sat in a dark forest or elsewhere, accepted the bedding and bedding offered to them at any time, and meditated in meditation in silence.",
        "source": "T24n1451_031:0358b22_11"
    },
    {
        "source_sentence": "遂有蟲來入小便處，因生苦惱。",
        "translation": "A worm then came into the place where he urinated and caused pain and distress.",
        "source": "T24n1451_031:0358b24_12"
    },
    {
        "source_sentence": "世尊聞已告諸苾芻：「諸尼不應加趺而坐，以修寂定應半加坐。」",
        "translation": "After the Bhagavān heard this, he told the monks, The nuns shouldn't sit cross-legged; they should add half a seat to cultivate quiescence.",
        "source": "T24n1451_031:0358b25_13"
    },
    {
        "source_sentence": "是時諸尼奉教而作，尚有細蟲入身相惱，佛言：「應以故破衣及以軟葉而為掩蔽，方始半加當修寂定。」",
        "translation": "When the nuns followed the instructions and did so, there were still small insects entering their bodies that disturbed each other, and the Buddha said, You should cover it with an old broken robe or a soft leaf to cover it; only then will you cultivate the meditative absorption of quiescence for the first half of the day.",
        "source": "T24n1451_031:0358b26_14"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T24n1451_031:0358c01_0"
    },
    {
        "source_sentence": "具壽鄔波離請世尊曰：「大德！",
        "translation": "Kauṣṭhila Upāli asked the Bhagavān, Mañjuśrī!",
        "source": "T24n1451_031:0358c01_1"
    },
    {
        "source_sentence": "若苾芻尼捨戒歸俗重求出家，得與出家近圓不？」",
        "translation": "If a bhikṣuṇī renounces the precepts and returns to secularism in order to seriously seek renunciation, will he or she be allowed to leave home near completion?",
        "source": "T24n1451_031:0358c01_2"
    },
    {
        "source_sentence": "佛言：「鄔波離！",
        "translation": "The Buddha said, Upāli!",
        "source": "T24n1451_031:0358c03_0"
    },
    {
        "source_sentence": "一經捨戒更不應出家。」",
        "translation": "A monk who abandons the precepts in a single sūtra shouldn't leave home.",
        "source": "T24n1451_031:0358c03_1"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T24n1451_031:0358c04_0"
    },
    {
        "source_sentence": "具壽鄔波離請世尊曰：「大德！",
        "translation": "Kauṣṭhila Upāli asked the Bhagavān, Mañjuśrī!",
        "source": "T24n1451_031:0358c04_1"
    },
    {
        "source_sentence": "先制苾芻尼不得詰問苾芻所有過失，所謂破戒、破見、破威儀、破正命者，頗有餘緣，諸苾芻尼得請問苾芻諸過失不？」",
        "translation": "First, it's forbidden for a bhikṣuṇī to question a bhikṣu about the faults of a bhikṣu, which are called breaking the precepts, breaking views, breaking mannerisms, and breaking right livelihood. Is there any other reason why the bhikṣuṇīs can question the bhikṣu about his faults?",
        "source": "T24n1451_031:0358c04_2"
    },
    {
        "source_sentence": "佛告鄔波離：「必無因緣，諸苾芻尼得有詰責苾芻如前罪類所有過失。」",
        "translation": "The Buddha told Upāli, There must be no reason why the monks and nuns would have to criticize a monk for whatever faults he or she has committed in the past.",
        "source": "T24n1451_031:0358c07_3"
    },
    {
        "source_sentence": "　長者與殘食、　　殘觸不相避、",
        "translation": "The wealthy man and the leftover food don't avoid each other with leftover contact,",
        "source": "T24n1451_031:0358c10_0"
    },
    {
        "source_sentence": "　不問隱屑事、　　近圓座應知。",
        "translation": "He doesn't ask about the matter of hidden dust, but he should know it when he approaches the perfect seat.",
        "source": "T24n1451_031:0358c10_0"
    },
    {
        "source_sentence": "第六門第八子攝頌曰：緣處同前。",
        "translation": "The sixth aspect and eighth son gather the verse, saying, Conditioned places are the same as the previous one.",
        "source": "T24n1451_031:0358c10_0"
    },
    {
        "source_sentence": "有一長者大富多財，娶妻已久不生男女，後時財物悉皆散盡，告其婦曰：「我今年老不能求財，欲往逝多林為出家事。」",
        "translation": "An elderly man of great wealth and possessions had married a woman who hadn't given birth to a son or daughter for a long time. Later, all his possessions were dispersed, and he told her, I'm too old to ask for property this year; I want to go to Jeta's Grove for the purpose of leaving home.",
        "source": "T24n1451_031:0358c13_1"
    },
    {
        "source_sentence": "妻言：「聖子！",
        "translation": "The wife said, Holy child!",
        "source": "T24n1451_031:0358c15_2"
    },
    {
        "source_sentence": "君若出家，我何依託，亦去出家。」",
        "translation": "If you leave home, why would I rely on you to leave home?",
        "source": "T24n1451_031:0358c16_3"
    },
    {
        "source_sentence": "夫言：「賢首！",
        "translation": "The husband said, Good man!",
        "source": "T24n1451_031:0358c16_4"
    },
    {
        "source_sentence": "可共同去。」",
        "translation": "Let's go together.",
        "source": "T24n1451_031:0358c17_5"
    },
    {
        "source_sentence": "長者將妻往大世主喬答彌處，頂禮雙足白言：「聖者！",
        "translation": "The elder took his wife to the place of Mahāprajāpatī, bowed his head at their feet, and said, Sage!",
        "source": "T24n1451_031:0358c17_6"
    },
    {
        "source_sentence": "此是我婦，樂於善說法律之中而為出家，願慈納受。",
        "translation": "This is my wife, who delights in explaining the Dharma well and leaves home because she wishes to accept it with kindness.",
        "source": "T24n1451_031:0358c18_7"
    },
    {
        "source_sentence": "我今亦往逝多林所而求出家。」",
        "translation": "Now, I'll also go to Jeta's Grove and seek to leave home.",
        "source": "T24n1451_031:0358c19_8"
    },
    {
        "source_sentence": "答曰：「善哉男子！",
        "translation": "He replied, Good man!",
        "source": "T24n1451_031:0358c20_9"
    },
    {
        "source_sentence": "夫妻能發此勝妙心，俱共出家斯為好事。",
        "translation": "A husband and wife can give rise to this wonderful mind, and it's good for them to leave home together.",
        "source": "T24n1451_031:0358c20_10"
    },
    {
        "source_sentence": "如世尊說：『出家之人有五勝利，功德無邊聖所稱歎。",
        "translation": "As the Bhagavān said, 'There are five benefits that a renunciant has, whose merits are limitless and praised by the noble ones.",
        "source": "T24n1451_031:0358c21_11"
    },
    {
        "source_sentence": "五勝利者如前廣說。』",
        "translation": "The five benefits are as explained in detail above.'",
        "source": "T24n1451_031:0358c22_12"
    },
    {
        "source_sentence": "汝今可去，我與出家。」",
        "translation": "Now, you can go; I'll leave home with you.",
        "source": "T24n1451_031:0358c23_13"
    },
    {
        "source_sentence": "時大世主喬答彌即與落髮。",
        "translation": "The great world lord Gautama then gave it to him.",
        "source": "T24n1451_031:0358c23_14"
    },
    {
        "source_sentence": "長者即往逝多林處，求一苾芻為作出家。",
        "translation": "The elder then went to Jeta's forest and asked a monk to make a home for him.",
        "source": "T24n1451_031:0358c24_15"
    },
    {
        "source_sentence": "于時城中遠近咸聞皆言：「長者有福今得出家，多獲勝妙四事供食。」",
        "translation": "Everyone in the city then heard it from afar and near, saying, The elder is blessed to have left home now, and he's often won the most excellent of the four kinds of food for offerings.",
        "source": "T24n1451_031:0358c25_16"
    },
    {
        "source_sentence": "後於異時入城乞食，妻苾芻尼亦來乞食，時世飢饉乞求難得，遇見其妻，問言：「仁者！",
        "translation": "Later, on another occasion, he entered the city to solicit alms, and his wife and nuns also came to solicit alms.",
        "source": "T24n1451_031:0358c26_17"
    },
    {
        "source_sentence": "若為存濟？」",
        "translation": "If it's for the sake of preserving?",
        "source": "T24n1451_031:0358c28_18"
    },
    {
        "source_sentence": "妻曰：「時世飢饉乞求難得辛苦存生。」",
        "translation": "The wife said, At the time, there was a hunger and thirst in the world that made it difficult to earnestly survive.",
        "source": "T24n1451_031:0358c29_19"
    },
    {
        "source_sentence": "便即告言：「我今多得飲食供養，若佛聽者減半相與。」",
        "translation": "He then told them, Now, I'll get a lot of food and drink to offer as an offering, and if the Buddha hears it, he'll give it to me by reducing it by half.",
        "source": "T24n1451_031:0358c29_20"
    },
    {
        "source_sentence": "時苾芻尼還至本處，向諸尼眾具陳其事。",
        "translation": "The bhikṣuṇīs then returned to their original place and told the nuns about it in detail.",
        "source": "T24n1451_031:0359a02_21"
    },
    {
        "source_sentence": "尼既聞已向苾芻說，苾芻白佛，佛言：「若諸苾芻有如此苾芻尼，時世飢饉乞求難得者，苾芻有食應可相與，勿致疑惑。」",
        "translation": "After hearing this, the nuns explained it to the monks, and the monks said to the Buddha, If monks and nuns have such monks and nuns who are hungry and beg for food that's difficult to obtain in the world, the monks should give it to each other if they have food, so don't doubt it.",
        "source": "T24n1451_031:0359a03_22"
    },
    {
        "source_sentence": "如世尊說，若苾芻有如此苾芻尼，時世飢饉乞求難得，有食相與勿致疑惑者，苾芻乞食得已，便即減半與，苾芻尼恒來就食。",
        "translation": "As the Bhagavān explains, if a monk or nun has such a monk or nun who is hungry in the world and begs for food that's difficult to obtain and doesn't have doubts when he gives it to them, then the monk or nun who asks for food and gets it will give it by reducing it by half, and the monk or nun will always come to eat.",
        "source": "T24n1451_031:0359a05_23"
    },
    {
        "source_sentence": "乃於他日，其苾芻尼別處得食而不來就，苾芻作念：「尼應餘處得食，為此不來，何勞留分？」",
        "translation": "On another day, that monk or nun got food from another place and didn't come to it, and the monk thought, A nun should get food from another place; why would she have to stay if she doesn't come?",
        "source": "T24n1451_031:0359a08_24"
    },
    {
        "source_sentence": "思惟是已便不出分。",
        "translation": "After contemplating this, he doesn't leave the part.",
        "source": "T24n1451_031:0359a10_25"
    },
    {
        "source_sentence": "尼於明日遂來覓食，報言：「仁者！",
        "translation": "On the morning, the nun then came to search for food and reported, Sir!",
        "source": "T24n1451_031:0359a11_26"
    },
    {
        "source_sentence": "昨不見來遂不出食，今雖有者已成殘宿惡觸，不堪受用。」",
        "translation": "Yesterday, when I didn't see him, he didn't come out to eat, and even though he has it now, it's already been a bad touch from the past, so it's unworthy of being used.",
        "source": "T24n1451_031:0359a11_27"
    },
    {
        "source_sentence": "尼聞斯語禮足而還，至尼住處具說其事。",
        "translation": "When the nun heard these words, she bowed her head at her feet and returned home. She went to where the nun lived and told him all about it.",
        "source": "T24n1451_031:0359a13_28"
    },
    {
        "source_sentence": "尼白苾芻，苾芻白佛，佛言：「從今已後，苾芻殘觸苾芻尼得食，苾芻尼殘苾芻得食。」",
        "translation": "The nuns told the monks, and the monks told the Buddha, who said, From now on, a monk or nun who touches a monk or nun gets to eat, and a monk or nun who touches a monk gets to eat.",
        "source": "T24n1451_031:0359a14_29"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T24n1451_031:0359a16_0"
    },
    {
        "source_sentence": "時有苾芻於僧眾中，問苾芻尼與僧不同隱屑之事，尼聞羞恥俯面而住。",
        "translation": "When a monk was among the saṃgha, he asked the monks and nuns about the differences between the saṃgha and the saṃgha's hidden defilements, and the nuns heard them with shame bowed their faces and stayed there.",
        "source": "T24n1451_031:0359a16_1"
    },
    {
        "source_sentence": "時諸苾芻以緣白佛，佛言：「苾芻不應問苾芻尼所有隱屑之事，然苾芻尼自可相問。",
        "translation": "The monks then reported the reason to the Buddha, who said, A monk or nun shouldn't ask a monk or nun about the hidden objects of a monk or nun, but a monk or nun can ask each other questions.",
        "source": "T24n1451_031:0359a17_2"
    },
    {
        "source_sentence": "苾芻若問得越法罪。」",
        "translation": "If a monk asks questions, he'll be guilty of transgressing the Dharma.",
        "source": "T24n1451_031:0359a19_3"
    },
    {
        "source_sentence": "苾芻又問同戒隱事，彼復羞慚，佛言：「可令尼隔方問彼尼，彼以其事告彼隔者，隔尼聞已方報苾芻。",
        "translation": "Again, the monk asked about the same secret matter as the precepts, and he was further embarrassed. The Buddha said, You can make a nun ask another nun at a distance to tell him or her about it; he who tells that person at a distance with respect to this matter will then report back to the monk after the nun has heard it.",
        "source": "T24n1451_031:0359a20_4"
    },
    {
        "source_sentence": "由不對言少羞慚故。」",
        "translation": "It's because they don't speak with little shame.",
        "source": "T24n1451_031:0359a22_5"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T24n1451_031:0359a23_0"
    },
    {
        "source_sentence": "「汝於最勝教，　　具足受尸羅，",
        "translation": "In the supreme teaching, you are fully endowed with accepting morality.",
        "source": "T24n1451_031:0359a23_1"
    },
    {
        "source_sentence": "　至心當奉持，　　無障身難得。",
        "translation": "They should wholeheartedly uphold it, for which the unobstructed body is difficult to attain.",
        "source": "T24n1451_031:0359a23_1"
    },
    {
        "source_sentence": "　端正者出家，　　清淨者圓具，",
        "translation": "The handsome one renounces the householder’s life, The pure one is fully endowed.",
        "source": "T24n1451_031:0359a23_1"
    },
    {
        "source_sentence": "　實語者所說，　　正覺之所知。」",
        "translation": "What's spoken by someone who speaks the truth, known by the right awakening.",
        "source": "T24n1451_031:0359a23_1"
    },
    {
        "source_sentence": "具壽舍利子等，與一苾芻尼受近圓已，說頌告言：說是語已，時苾芻尼月期忽下，舍利子告言：「姊妹！",
        "translation": "Kauṣṭhila Śāriputra and others, having received the near-complete precepts with a bhikṣuṇī, spoke a verse to him, saying, After speaking these words, the monks and nuns suddenly went down for a month, and Śāriputra told them, Sister!",
        "source": "T24n1451_031:0359a23_1"
    },
    {
        "source_sentence": "汝可起去。」",
        "translation": "You may rise and leave.",
        "source": "T24n1451_031:0359b01_2"
    },
    {
        "source_sentence": "尼為羞恥便不肯起，時舍利子觀知所以，即便起去。",
        "translation": "Because of embarrassment, the nun refused to get up. Knowing this, Śāriputra got up and departed.",
        "source": "T24n1451_031:0359b01_3"
    },
    {
        "source_sentence": "諸苾芻尼曰：「姊妹！",
        "translation": "The monks and nuns said, Sister!",
        "source": "T24n1451_031:0359b02_4"
    },
    {
        "source_sentence": "纔受近圓未離壇場，豈合惱亂阿遮利耶，令起不起。」",
        "translation": "How could it be that someone who's just about to receive the precepts and hasn't yet left the altar site doesn't comply with the afflictive acala and cause them to get up or not get up?",
        "source": "T24n1451_031:0359b03_0"
    },
    {
        "source_sentence": "答言：「姊妹！",
        "translation": "He replied, Sister!",
        "source": "T24n1451_031:0359b04_1"
    },
    {
        "source_sentence": "彼是大人，不容見我猥屑之事，仁等可不自知更責於我，我為蹲踞於前而坐，月期忽下云何起去？」",
        "translation": "That's a great man who won't allow me to see my indecent deeds, so why don't you know for yourself and blame me? I sat down in front of him while crouching, and how will I get up and leave when the moon suddenly goes down?",
        "source": "T24n1451_031:0359b04_2"
    },
    {
        "source_sentence": "諸尼聞已向苾芻說，苾芻白佛，佛言：「自今已後與女近圓，勿令蹲踞可坐甎上，或坐草座或復小褥子上，由諸女人身柔軟故。」",
        "translation": "After the nuns heard this, they told it to the monks, and the monks said to the Buddha, From now on, you mustn't allow the woman to sit cross-legged or sit on a grass seat or on a small cushion because of the women's softness in body.",
        "source": "T24n1451_031:0359b06_3"
    },
    {
        "source_sentence": "　苾芻餘臥具，　　應與苾芻尼；",
        "translation": "The rest bedding for the bhikṣu should be given to the bhikṣuṇī.",
        "source": "T24n1451_031:0359b10_0"
    },
    {
        "source_sentence": "　尼不蹋橋板，　　不著裝身物。",
        "translation": "The nuns don't step on a bridge or board, and they don't wear anything to adorn themselves.",
        "source": "T24n1451_031:0359b10_0"
    },
    {
        "source_sentence": "第六門第九子攝頌曰：緣處同前。",
        "translation": "The ninth verse in the sixth aspect of the nineteenth son gathers the verse, saying, Conditioned places are the same as the previous one.",
        "source": "T24n1451_031:0359b10_0"
    },
    {
        "source_sentence": "爾時大世主喬答彌，與五百苾芻尼遊行人間，日將欲暮到逝多林，作如是念：「時今已過日既將暮不暇入城，我等宜共隨時居止，待至天曉方可入城。」",
        "translation": "It was then that the great world lord Gautama and his five hundred monks and nuns traveled among the people, and when the sun was about to set, they went to Jeta's Grove and had this thought, Now that the sun was going to go down at night, I won't have time to enter the city; it's better for us to live together at the right time and wait until dawn before entering the city.",
        "source": "T24n1451_031:0359b13_1"
    },
    {
        "source_sentence": "即於寺中露地而眠，所有衣服為塵土所污。",
        "translation": "He then went to sleep in the open air in the monastery, and his clothes were soiled by dust.",
        "source": "T24n1451_031:0359b16_2"
    },
    {
        "source_sentence": "至天曉已復作是念：「若不頂禮大師，至城還須重來。」",
        "translation": "After dawn, he again thought, If you don't bow your head to the great master, you'll have to come back when you reach the city.",
        "source": "T24n1451_031:0359b17_3"
    },
    {
        "source_sentence": "即詣佛所，頂禮佛足在一面坐。",
        "translation": "He went to the Buddha, bowed his head at his feet, and sat to one side.",
        "source": "T24n1451_031:0359b18_4"
    },
    {
        "source_sentence": "佛見衣服塵土所污，知而故問喬答彌曰：「衣服何因被塵土污？」",
        "translation": "Seeing that his clothes were stained by dirt, the Buddha knew and therefore asked Gautama, Why are my clothes stained by dirt?",
        "source": "T24n1451_031:0359b19_5"
    },
    {
        "source_sentence": "即以事具白。",
        "translation": "He then explained the matter in detail.",
        "source": "T24n1451_031:0359b20_6"
    },
    {
        "source_sentence": "于時佛告具壽阿難陀曰：「苾芻所有餘長臥具，不與苾芻尼耶？」",
        "translation": "The Buddha then addressed Kauṣṭhila Ānanda, What's the rest of the long bedding that a monk has, and won't he give it to a monk or nun?",
        "source": "T24n1451_031:0359b21_7"
    },
    {
        "source_sentence": "白言：「不與。」",
        "translation": "He said, Don't give it to him.",
        "source": "T24n1451_031:0359b22_8"
    },
    {
        "source_sentence": "佛告阿難陀：「從今已後苾芻受用餘殘臥具，應與苾芻尼，勿致疑惑。」",
        "translation": "The Buddha told Ānanda, From now on, the monks who accept the rest of the remaining bedding should give it to the monks and nuns so that they don't have doubts.",
        "source": "T24n1451_031:0359b22_9"
    },
    {
        "source_sentence": "如世尊說：應與苾芻尼臥具者，時諸苾芻分臥具時皆取下惡，留上好者與苾芻尼，佛言：「不應好者留與苾芻尼，應與麁者，隨時供給勿令闕事。",
        "translation": "As the Bhagavān said, Those who should give bedding to a bhikṣuṇī should always take what's inferior when the bhikṣus share their bedding and leave what's superior for the bhikṣuṇī. The Buddha said, If it's not good enough, you should give it to the bhikṣuṇī; those who are coarse should give it to the coarse, making offerings",
        "source": "T24n1451_031:0359b24_10"
    },
    {
        "source_sentence": "須食應與。」",
        "translation": "What's needed to eat should be given.",
        "source": "T24n1451_031:0359b27_11"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T24n1451_031:0359b28_0"
    },
    {
        "source_sentence": "爾時具壽大迦攝波，於小食時著衣持鉢入城乞食。",
        "translation": "It was then that the long-lived Kāśyapa Mahākāśyapa put on his robe and bowl at the time of a small meal and went into the city to solicit alms.",
        "source": "T24n1451_031:0359b28_1"
    },
    {
        "source_sentence": "時吐羅難陀苾芻尼，從外而來欲入住處，遇河水泛溢，見迦攝波在板橋上，吐羅難陀作如是念：「此愚鈍物今可治之。」",
        "translation": "When the Tūrananda bhikṣuṇī came from outside and wanted to enter the place where he was staying, she met a river overflowing with water and saw Kāśyapa on top of a pine forest, and Tūrananda thought, This foolish thing can now be treated.",
        "source": "T24n1451_031:0359b29_2"
    },
    {
        "source_sentence": "速往橋邊用力踏板，時迦攝波遂即落河，衣服並濕鉢沈水底錫杖隨流。",
        "translation": "He quickly went to the side of the bridge and stepped onto the board with his strength, and Kāśyapa then fell into the river; his clothes were covered with wet bowls, sinking into the water, and his pewter staff followed him.",
        "source": "T24n1451_031:0359c03_3"
    },
    {
        "source_sentence": "迦攝波曰：「姊妹！",
        "translation": "Kāśyapa said, Sister!",
        "source": "T24n1451_031:0359c04_4"
    },
    {
        "source_sentence": "汝無過犯，乃是具壽阿難陀作斯過失，強請世尊度如斯類惡行之女，於佛法內出家為尼。」",
        "translation": "You're not guilty; it's because Kauśina Ānanda did this mistake and forcibly asked the Bhagavān to save these kinds of bad-practicing women who leave home as nuns within the Buddha's teaching.",
        "source": "T24n1451_031:0359c05_5"
    },
    {
        "source_sentence": "苾芻聞已以緣白佛，佛作是念：「由苾芻尼多生過失。」",
        "translation": "After the monks heard this, they reported it to the Buddha for his sake, and he thought, It's because there are so many faults that monks and nuns give rise to them.",
        "source": "T24n1451_031:0359c07_6"
    },
    {
        "source_sentence": "告言：「自今已後，苾芻尼不應共苾芻同橋上行，若行得越法罪。」",
        "translation": "He told them, From now on, monks and nuns shouldn't walk up the bridge with monks; if they do so, they'll be guilty of transgressing the law.",
        "source": "T24n1451_031:0359c08_7"
    },
    {
        "source_sentence": "如世尊說：苾芻尼不得共苾芻同橋行者，時有大橋安隱廣大，諸苾芻尼不敢共行，佛言：「如是寬廣大橋共行無過。」",
        "translation": "As the Bhagavān said, When a monk or nun can't walk on the same bridge with a monk or nun, then there's a large bridge that's peaceful and vast, and the monks and nuns won't dare to walk together, and the Buddha says, Thus, such a broad and wide bridge is not wrong to walk together.",
        "source": "T24n1451_031:0359c09_8"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T24n1451_031:0359c13_0"
    },
    {
        "source_sentence": "爾時吐羅難陀苾芻尼，於小食時著衣持鉢入城乞食，次第行至勝鬘夫人處。",
        "translation": "It was then that the monks and nuns of Tūrananda, wearing their robes and bowls at the time of a small meal, entered the city to solicit alms and went one by one to the place where Lady Śrīmālā was staying.",
        "source": "T24n1451_031:0359c13_1"
    },
    {
        "source_sentence": "夫人見已唱言：「善來！」",
        "translation": "Seeing this, the lady called out, Good coming!",
        "source": "T24n1451_031:0359c15_0"
    },
    {
        "source_sentence": "即敷座令坐共為言議。",
        "translation": "He then spread out his seat and ordered them to sit together for discussion.",
        "source": "T24n1451_031:0359c15_1"
    },
    {
        "source_sentence": "時吐羅難陀尼問勝鬘曰：「姊妹！",
        "translation": "Tūranandaṇi then asked Śrīmālā, Sister!",
        "source": "T24n1451_031:0359c16_0"
    },
    {
        "source_sentence": "何故骻麁腰細耶？」",
        "translation": "Why is the waist so small?",
        "source": "T24n1451_031:0359c16_1"
    },
    {
        "source_sentence": "答言：「聖者！",
        "translation": "He replied, Sage!",
        "source": "T24n1451_031:0359c17_2"
    },
    {
        "source_sentence": "何須問此？",
        "translation": "Why is it necessary to ask this question?",
        "source": "T24n1451_031:0359c17_3"
    },
    {
        "source_sentence": "我但以物結束，為悅王意。」",
        "translation": "I simply end things in order to please the king's mind.",
        "source": "T24n1451_031:0359c17_4"
    },
    {
        "source_sentence": "尼曰：「我今等閑且問。」",
        "translation": "The nun said, Now, let's take a moment to ask questions.",
        "source": "T24n1451_031:0359c18_5"
    },
    {
        "source_sentence": "答言：「聖者！",
        "translation": "He replied, Sage!",
        "source": "T24n1451_031:0359c18_6"
    },
    {
        "source_sentence": "我用物纏是故麁也。」",
        "translation": "It's because I use the binding of things as fetters, which is why I'm angry.",
        "source": "T24n1451_031:0359c18_7"
    },
    {
        "source_sentence": "尼曰：「由此眾人見者相愛。」",
        "translation": "The nun said, Because of this, the people who see each other love each other.",
        "source": "T24n1451_031:0359c19_8"
    },
    {
        "source_sentence": "勝鬘默爾。",
        "translation": "Vaiśravaṇa is silent.",
        "source": "T24n1451_031:0359c19_9"
    },
    {
        "source_sentence": "尼至住處亦著此衣，諸尼問曰：「此非法衣豈合尼畜？」",
        "translation": "When the nuns arrived at their dwelling place, they also put on these robes, and the nuns asked, Is this unlawful robe fit for a nun to store?",
        "source": "T24n1451_031:0359c20_10"
    },
    {
        "source_sentence": "白諸苾芻，苾芻白佛，佛言：「此非法衣，著者得越法罪。」",
        "translation": "He told the monks, and the monks told the Buddha, who said, This is an unlawful robe that anyone wearing will be guilty of transgressing the Dharma.",
        "source": "T24n1451_031:0359c21_11"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T24n1451_031:0359c23_0"
    },
    {
        "source_sentence": "爾時吐羅難陀苾芻尼，又見夫人乳房圓正，問答同前，夫人曰：「我著覆乳房衣。」",
        "translation": "It was then that the Tūrananda bhikṣuṇī again saw that the woman's breasts were perfectly round and correct, and she asked and answered as before, I'm wearing a robe to cover my breasts.",
        "source": "T24n1451_031:0359c23_1"
    },
    {
        "source_sentence": "又見夫人著承乳房衣、又見著勒腰衣，吐羅難陀見皆借問，如上具答，尼即學作著用此衣。",
        "translation": "When he saw that the lady was wearing a woman's undergarment, or another woman wearing a leather waistcoat, Tūrananda asked questions to borrow it and answered them as above, and the nun then learned to make and wear this robe.",
        "source": "T24n1451_031:0359c25_2"
    },
    {
        "source_sentence": "佛言：「皆不合，著用者得越法罪。」",
        "translation": "The Buddha said, They all don't fit together, and those who use them will be guilty of transgressing the Dharma.",
        "source": "T24n1451_031:0359c27_3"
    },
    {
        "source_sentence": "　不灒水污衣、　　不持死胎子、",
        "translation": "They don't wash their clothes with water, don't carry a dead fetus, and don't eat it.",
        "source": "T24n1451_031:0359c28_0"
    },
    {
        "source_sentence": "　不吞於不淨、　　觸己子非他。",
        "translation": "He doesn't swallow what's impure and touches his own child instead of others.",
        "source": "T24n1451_031:0359c28_0"
    },
    {
        "source_sentence": "第六門第十子攝頌曰：緣處同前。",
        "translation": "The sixth aspect of the tenth son's collection of verses says, Conditioned places are the same as the previous one.",
        "source": "T24n1451_031:0359c28_0"
    },
    {
        "source_sentence": "爾時吐羅難陀苾芻尼入城乞食。",
        "translation": "It was then that the monks and nuns of Tūrananda entered the city to solicit alms.",
        "source": "T24n1451_031:0360a02_1"
    },
    {
        "source_sentence": "時大迦攝波在城乞食臨渠塹行，吐羅尼見便作是念：「我今宜可治此愚人。」",
        "translation": "When Mahākāśyapa was in the city begging for food and walking along a ditch or moat, Tūroni saw him and thought, Now, it's better for me to treat this foolish man.",
        "source": "T24n1451_031:0360a03_0"
    },
    {
        "source_sentence": "遂持大塼速至傍邊遙擲塹內，穢惡臭水污其衣服，迦攝波曰：「汝無愆犯，然是阿難陀作斯過失。」",
        "translation": "So he quickly reached the side and tossed it into the moat from a distance, and his clothes stained with foul-smelling water. Kāśyapa said, You don't commit sexual misconduct, but this is what Ānanda did wrong.",
        "source": "T24n1451_031:0360a04_1"
    },
    {
        "source_sentence": "具說如上。",
        "translation": "It's explained in detail as above.",
        "source": "T24n1451_031:0360a06_2"
    },
    {
        "source_sentence": "諸苾芻聞，以緣白佛，佛言：「苾芻尼不應以穢惡水污苾芻衣服，若犯者得越法罪。」",
        "translation": "When the monks heard this, they reported it to the Buddha for his sake, who said, A monk or nun shouldn't stain a monk's clothing with filthy water; if he does so, he'll be guilty of transgressing the law.",
        "source": "T24n1451_031:0360a07_3"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T24n1451_031:0360a09_0"
    },
    {
        "source_sentence": "爾時有一長者，大富多財娶妻未久，將諸財貨出外興易。",
        "translation": "At the time, there was an elderly man of great wealth and possessions who hadn't long since married his wife, and he took his possessions out for external exchange.",
        "source": "T24n1451_031:0360a09_1"
    },
    {
        "source_sentence": "妻噉好食著妙衣裳，欲心熾盛，遂共一男而作私通，因即有娠。",
        "translation": "His wife ate good food and wore beautiful clothes, and her desires were so strong that she shared the same man with him to have sexual intercourse. As a result, she became pregnant.",
        "source": "T24n1451_031:0360a10_2"
    },
    {
        "source_sentence": "既經多月而作是念：「我宜墮胎，若不落者，夫到之日必當害我。」",
        "translation": "After many months, he thought, It's advisable for me to fall into the womb; if I don't fall down, I'll surely be harmed on the day they come.",
        "source": "T24n1451_031:0360a11_3"
    },
    {
        "source_sentence": "遂即墮胎。",
        "translation": "He then fell into the womb.",
        "source": "T24n1451_031:0360a13_4"
    },
    {
        "source_sentence": "情懷憂念：「我今落訖，何處安置？」",
        "translation": "He was grieved and thought, Now that I've finished, where will I place it?",
        "source": "T24n1451_031:0360a13_5"
    },
    {
        "source_sentence": "時吐羅難陀苾芻尼，因乞食入其舍，告言：「妙相！",
        "translation": "The Tūrananda bhikṣuṇī then entered his dwelling because she was begging for food and told her, Marvelous appearance!",
        "source": "T24n1451_031:0360a14_6"
    },
    {
        "source_sentence": "可與鉢食。」",
        "translation": "You can give it to the bowl for food.",
        "source": "T24n1451_031:0360a15_7"
    },
    {
        "source_sentence": "答言：「聖者！",
        "translation": "He replied, Sage!",
        "source": "T24n1451_031:0360a15_8"
    },
    {
        "source_sentence": "可去，無授食人，我懷憂惱。」",
        "translation": "You can leave, for there's no one to give you food; I'm sad and distressed.",
        "source": "T24n1451_031:0360a15_9"
    },
    {
        "source_sentence": "報言：「妙相！",
        "translation": "He replied, Marvelous!",
        "source": "T24n1451_031:0360a16_10"
    },
    {
        "source_sentence": "可有人亡？」",
        "translation": "Can someone die?",
        "source": "T24n1451_031:0360a16_11"
    },
    {
        "source_sentence": "答言：「無有人亡，然我墮胎不知欲棄何處？」",
        "translation": "He replied, No one died, but I fell into the womb and didn't know where to abandon it.",
        "source": "T24n1451_031:0360a17_0"
    },
    {
        "source_sentence": "報言：「妙相！",
        "translation": "He replied, Marvelous!",
        "source": "T24n1451_031:0360a17_1"
    },
    {
        "source_sentence": "我若為棄，頗能常供乞鉢食不？」",
        "translation": "If I abandon it, will I always be able to offer alms bowls and food?",
        "source": "T24n1451_031:0360a18_2"
    },
    {
        "source_sentence": "答言：「我與。」",
        "translation": "He replied, I'll give it to you.",
        "source": "T24n1451_031:0360a18_3"
    },
    {
        "source_sentence": "「我之侍者及知事人亦能與不？」",
        "translation": "Can I give it to my attendants and wise people?",
        "source": "T24n1451_031:0360a19_4"
    },
    {
        "source_sentence": "答言：「並與。」",
        "translation": "He replied, They'll give it to you.",
        "source": "T24n1451_031:0360a19_5"
    },
    {
        "source_sentence": "即以大鉢盛彼死胎，向空舍中而為棄擲。",
        "translation": "He then put his large bowl into the dead womb, went to an empty dwelling, and threw it away.",
        "source": "T24n1451_031:0360a20_6"
    },
    {
        "source_sentence": "時彼舍內先有眾多漫行男子，室中聚立見而問曰：「禿頭釋女欲何所作答？」",
        "translation": "When there were many men walking around in the house, they stood up and asked, What does the bald-headed Śākyamuni woman want to answer?",
        "source": "T24n1451_031:0360a21_0"
    },
    {
        "source_sentence": "曰：「只由汝等無賴狂夫通他婦女，造斯過失令我棄胎。」",
        "translation": "He said, It's simply because you don't rely on crazy men who pass through other women and create these faults to cause me to abandon the womb.",
        "source": "T24n1451_031:0360a22_1"
    },
    {
        "source_sentence": "男子聞已惡罵而去。",
        "translation": "After hearing this, the man scolded him and departed.",
        "source": "T24n1451_031:0360a23_2"
    },
    {
        "source_sentence": "時彼男子路逢諸尼，報言：「罪過物！",
        "translation": "That man then met the nuns on the road and reported, It's a sin!",
        "source": "T24n1451_031:0360a24_3"
    },
    {
        "source_sentence": "汝吐羅難陀尼，現作如是棄胎惡業。」",
        "translation": "You, Tūranandi, have done such a bad action of abandoning the womb in this way.",
        "source": "T24n1451_031:0360a25_4"
    },
    {
        "source_sentence": "諸尼默爾。",
        "translation": "The nuns remained silent.",
        "source": "T24n1451_031:0360a26_5"
    },
    {
        "source_sentence": "尼白苾芻，苾芻白佛，佛作是念：「尼畜大鉢有如是過，是故諸尼不持大鉢。」",
        "translation": "The nuns said to the monks, and the monks said to the Buddha, who thought, This is why the nuns don't carry a large bowl.",
        "source": "T24n1451_031:0360a26_6"
    },
    {
        "source_sentence": "告諸苾芻：「吐羅難陀作非沙門行，當知諸尼不應作此非法之事，不持大鉢。",
        "translation": "He told the monks, Tārānanda does what's not the practice of an ascetic, so you should know that nuns shouldn't do this unlawful thing and don't carry a large bowl.",
        "source": "T24n1451_031:0360a28_0"
    },
    {
        "source_sentence": "若尼持大鉢作如是事者，得越法罪。」",
        "translation": "If a nun carries a large bowl and does such a thing, she'll be guilty of transgressing the Dharma.",
        "source": "T24n1451_031:0360a29_1"
    },
    {
        "source_sentence": "如佛所制尼不持大鉢者，諸尼不知持何等鉢？",
        "translation": "As the Buddha had instructed nuns who didn't carry a large bowl, the nuns didn't know what kind of bowl they carried.",
        "source": "T24n1451_031:0360b01_2"
    },
    {
        "source_sentence": "佛言：「苾芻小鉢是尼大鉢。」",
        "translation": "The Buddha said, A monk's small bowl is a nun's large bowl.",
        "source": "T24n1451_031:0360b02_3"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T24n1451_031:0360b04_0"
    },
    {
        "source_sentence": "時笈多尼既將一渧不淨置在口中，復將一渧置下根內，眾生業報難可思議，遂即懷娠生童子迦攝波。",
        "translation": "The Guptani then put a bowlful of impure food into her mouth and another bowlful into her lower faculties, and the karmic rewards of sentient beings' actions were inconceivable, so she gave birth to a boy Kāśyapa who was pregnant.",
        "source": "T24n1451_031:0360b04_1"
    },
    {
        "source_sentence": "時笈多尼不敢手觸，兒便啼哭。",
        "translation": "Gṛdhrakūṭa then didn't dare touch it with his hand, and the child cried in tears.",
        "source": "T24n1451_031:0360b06_2"
    },
    {
        "source_sentence": "諸親問言：「何故兒哭？」",
        "translation": "The relatives asked, Why are you crying?",
        "source": "T24n1451_031:0360b07_3"
    },
    {
        "source_sentence": "尼聞默爾。",
        "translation": "The nun heard it and remained silent.",
        "source": "T24n1451_031:0360b07_4"
    },
    {
        "source_sentence": "餘尼答曰：「世尊制戒不許觸男，故不敢近，為此啼哭。」",
        "translation": "The other nuns replied, The Bhagavān precept forbids touching men; therefore, he doesn't dare to approach them and weeps for their sake.",
        "source": "T24n1451_031:0360b08_5"
    },
    {
        "source_sentence": "彼即答言：「世尊大悲，云何己子不聽手觸？",
        "translation": "He then answered, Bhagavān, what's the great compassion of your son who doesn't hear his hands touching him?",
        "source": "T24n1451_031:0360b09_6"
    },
    {
        "source_sentence": "母不觸者豈可命存？」",
        "translation": "How can a mother who doesn't touch it live?",
        "source": "T24n1451_031:0360b10_7"
    },
    {
        "source_sentence": "尼聞稱善，往告苾芻。",
        "translation": "When the nun heard that it was called good, she went to the monk and told him.",
        "source": "T24n1451_031:0360b10_8"
    },
    {
        "source_sentence": "苾芻白佛，佛言：「己子應觸，長養抱持無有過失。」",
        "translation": "The monks said to the Buddha, who said, There's nothing wrong with touching your own child and nurturing it.",
        "source": "T24n1451_031:0360b11_9"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T24n1451_031:0360b13_0"
    },
    {
        "source_sentence": "佛言：己子應觸長養抱持者，女人多愛便捉此兒，從肩至肩競共抱持，其兒便瘦。",
        "translation": "The Buddha said, 'You should touch your own child to nourish him and embrace him.' When a woman with many loves grabs this child, running from shoulder to shoulder in competition to embrace it, the child becomes thin.",
        "source": "T24n1451_031:0360b13_1"
    },
    {
        "source_sentence": "諸親見問：「何意如是？」",
        "translation": "The relatives saw him and asked, What's the meaning of this?",
        "source": "T24n1451_031:0360b15_2"
    },
    {
        "source_sentence": "彼遂具說，咸共譏嫌。",
        "translation": "They then explained it in detail, and they all criticized it.",
        "source": "T24n1451_031:0360b15_3"
    },
    {
        "source_sentence": "以緣白佛，佛言：「諸尼不應觸他孩子，若觸得越法罪。」",
        "translation": "He told the Buddha for this reason, and he said, The nuns shouldn't touch other children; if they touch them, they'll be guilty of transgressing the Dharma.",
        "source": "T24n1451_031:0360b16_4"
    },
    {
        "source_sentence": "　笈多尼不住、　　僧脚崎二形、",
        "translation": "The gandharvas don't abide, the two forms of the saṃghâvaśeṣa and the two forms of the monks' feet.",
        "source": "T24n1451_031:0360b18_0"
    },
    {
        "source_sentence": "　道小羯磨時、　　沽酒尼根轉、",
        "translation": "At the time of the minor ordination on the path, When selling wine and nuns' faculties are transformed,",
        "source": "T24n1451_031:0360b18_0"
    },
    {
        "source_sentence": "　寺外不以骨，　　第七攝應知。",
        "translation": "The bones are not preserved outside the monastery: This should be known as the seventh.",
        "source": "T24n1451_031:0360b18_0"
    },
    {
        "source_sentence": "　笈多與兒宿，　　王舍藥叉神，",
        "translation": "Gupta and Zi, the yakṣa spirit Rājagṛha.",
        "source": "T24n1451_031:0360b18_0"
    },
    {
        "source_sentence": "　施兒衣繫項，　　稱名與祭食。",
        "translation": "He gives his children cloth, ties it around their necks, calls them by name, and feeds them with offerings.",
        "source": "T24n1451_031:0360b18_0"
    },
    {
        "source_sentence": "第七門總攝頌曰：第七門第一子攝頌曰：緣處同前。",
        "translation": "The seventh aspect summarizes the verse, saying, The first son of the seventh aspect summarizes the verse, which says, Conditioned places are the same as the previous one.",
        "source": "T24n1451_031:0360b18_0"
    },
    {
        "source_sentence": "如世尊說：「苾芻尼不得與男同一室宿。」",
        "translation": "As the Bhagavān said, A monk or nun can't sleep in the same room as a man.",
        "source": "T24n1451_031:0360b25_1"
    },
    {
        "source_sentence": "時笈多苾芻尼，遣童子迦攝波出外令宿，子即啼哭。",
        "translation": "The Gupta bhikṣuṇī then sent the boy Kāśyapa out to stay overnight, and the boy cried.",
        "source": "T24n1451_031:0360b26_2"
    },
    {
        "source_sentence": "諸親聞已問笈多曰：「童子迦攝波小兒夜何啼哭？」",
        "translation": "After the relatives heard this, they asked Gupta, Why are you crying and wailing at night, boy Kāśyapa?",
        "source": "T24n1451_031:0360b27_3"
    },
    {
        "source_sentence": "尼默不對。",
        "translation": "The nun remained silent and didn't answer.",
        "source": "T24n1451_031:0360b28_4"
    },
    {
        "source_sentence": "諸尼報曰：「世尊不令苾芻尼與男子同一室宿，為此令出，由是夜啼。」",
        "translation": "The nuns replied, Bhagavān, the Bhagavān didn't allow the monks and nuns to sleep in the same room as men; he caused them to leave because of this, and so they cried out at night.",
        "source": "T24n1451_031:0360b28_5"
    },
    {
        "source_sentence": "諸親曰：「世尊大悲，若童子小兒不與母宿當招禍患。",
        "translation": "The relatives said, Bhagavān, with great compassion, that if a boy or child doesn't sleep with his mother, it will cause misfortune.",
        "source": "T24n1451_031:0360c01_6"
    },
    {
        "source_sentence": "可白世尊。」",
        "translation": "You may tell the Bhagavān.",
        "source": "T24n1451_031:0360c02_7"
    },
    {
        "source_sentence": "諸尼向苾芻說。",
        "translation": "The nuns told the monks.",
        "source": "T24n1451_031:0360c02_8"
    },
    {
        "source_sentence": "苾芻白佛，佛言：「笈多尼應從僧伽乞與子同室宿羯磨。",
        "translation": "The monks said to the Buddha, who said, Guptaṇī, You should ask permission from the saṃgha to spend the night in the same room as your son for the karman.",
        "source": "T24n1451_031:0360c03_9"
    },
    {
        "source_sentence": "應如是乞，敷坐、鳴揵稚、尼眾集已，笈多合掌隨應致禮，於上座前，或於草坐、塼上或褥上坐，合掌而住作如是白：『大德尼僧伽聽！",
        "translation": "You should thus beg, spread out your seat, ring the bell and assemble the congregation of nuns. When they have assembled, the Gupta joins his palms in accordance with what is proper, pays homage before the superior monk or nun, either by sitting on a piece of grass, a bamboo mat, or on a cushioned mat. He joins his palms and stands upright, saying:",
        "source": "T24n1451_031:0360c04_10"
    },
    {
        "source_sentence": "我笈多苾芻尼生男，欲與子同一室宿。",
        "translation": "I, the bhikṣuṇī Gupta, gave birth to a boy and wanted to sleep in the same room as my son.",
        "source": "T24n1451_031:0360c07_11"
    },
    {
        "source_sentence": "今從尼僧伽乞與子同一室宿羯磨。",
        "translation": "Now, I'm begging from the nuns and saṃgha to share the same room with my son for the nightly karma.",
        "source": "T24n1451_031:0360c08_12"
    },
    {
        "source_sentence": "願尼僧伽與我與子同室宿羯磨，憐愍故。』",
        "translation": "May the nun Saṃgha give me and my children the same room to spend the night in a monastic retreat, out of pity for them.'",
        "source": "T24n1451_031:0360c09_0"
    },
    {
        "source_sentence": "如是三說已，次令笈多尼離聞處著見處，須一苾芻尼作白羯磨，應如是作：「『大德尼僧伽聽！",
        "translation": "After these three explanations have been given, the next step is to cause a bhikṣuṇī to part with the place of hearing and attach to the place of seeing, and one bhikṣuṇī who needs to make a confession should thus say, 'Listen, Mañjuśrī!",
        "source": "T24n1451_031:0360c09_1"
    },
    {
        "source_sentence": "此笈多苾芻尼，為自生男。",
        "translation": "This Gupta bhikṣuṇī is a man born for her own sake.",
        "source": "T24n1451_031:0360c12_2"
    },
    {
        "source_sentence": "此笈多今從僧伽乞與子同室宿羯磨。",
        "translation": "Now, this Gupta begs from the saṃgha to spend the night in the same room as his son.",
        "source": "T24n1451_031:0360c12_3"
    },
    {
        "source_sentence": "若僧伽時至聽者，苾芻尼僧伽應許苾芻尼僧伽今與笈多與子同室宿羯磨。",
        "translation": "If the saṃgha arrives at the time of the saṃgha, the bhikṣuṇī saṃgha should allow the bhikṣuṇī saṃgha to share the same room with Gupta and his son for the nightly karma.",
        "source": "T24n1451_031:0360c13_4"
    },
    {
        "source_sentence": "白如是。』",
        "translation": "He said, 'So it is.'",
        "source": "T24n1451_031:0360c15_5"
    },
    {
        "source_sentence": "次作羯磨：『大德尼僧伽聽！",
        "translation": "Next, he performs the ritual, 'Listen, Mañjuśrī!",
        "source": "T24n1451_031:0360c15_6"
    },
    {
        "source_sentence": "此笈多苾芻尼，為自生男。",
        "translation": "This Gupta bhikṣuṇī is a man born for her own sake.",
        "source": "T24n1451_031:0360c16_7"
    },
    {
        "source_sentence": "此笈多今從苾芻尼僧伽乞與子同室宿羯磨。",
        "translation": "Now, this Gupta begs from the bhikṣuṇī saṃgha to spend the night in the same room as his son.",
        "source": "T24n1451_031:0360c17_0"
    },
    {
        "source_sentence": "苾芻尼僧伽今與笈多與子同室宿羯磨。",
        "translation": "The bhikṣuṇīs and saṃgha now share the same room with Gupta and their sons for the nightly karma.",
        "source": "T24n1451_031:0360c18_1"
    },
    {
        "source_sentence": "若諸苾芻尼僧伽聽與笈多與子同室宿者默然，若不許者說。』",
        "translation": "If the monks, nuns, and saṃgha hear that they're staying in the same room as Gupta and their children, they'll be silent, and if they don't approve, they'll say so.'",
        "source": "T24n1451_031:0360c19_0"
    },
    {
        "source_sentence": "『苾芻尼僧伽已與笈多與子同室宿羯磨竟，苾芻尼僧伽已聽許，由其默然故，我今如是持。』",
        "translation": "'After the bhikṣuṇīs and saṃgha had completed the karma of staying in the same room as Gupta and his son, the bhikṣuṇīs and saṃgha had listened to it because they were silent, so now I'm holding it this way.'",
        "source": "T24n1451_031:0360c20_1"
    },
    {
        "source_sentence": "「若苾芻尼已蒙僧伽作與子同室宿羯磨竟，宜應與子同室而宿，勿致疑惑。」",
        "translation": "If a bhikṣuṇī has been given the saṃgha to perform the karma of staying in the same room with her child, it's advisable to stay in the same room with him or her without doubt.",
        "source": "T24n1451_031:0360c23_0"
    },
    {
        "source_sentence": "其笈多伴尼亦共同宿，尼白苾芻，苾芻白佛，佛言：「其有子尼應與子宿，非是餘人。",
        "translation": "The Gupta companions and nuns also shared the same night. The nuns said to the bhikṣus, and the bhikṣus told the Buddha, who said, If there's a son or nun, you should give her to him; it's not someone else.",
        "source": "T24n1451_031:0360c24_1"
    },
    {
        "source_sentence": "共餘人宿者得越法罪。」",
        "translation": "Those who sleep with other people will be guilty of transgressing the Dharma.",
        "source": "T24n1451_031:0360c26_2"
    },
    {
        "source_sentence": "是時笈多子年長大猶共同宿，尼白苾芻，苾芻白佛，佛言：「尼若子大不應同宿。」",
        "translation": "When the Gupta's son was still old enough to sleep together, the nun said to the monk, and the monk said to the Buddha, If you're a nun, you shouldn't sleep together.",
        "source": "T24n1451_031:0360c27_3"
    },
    {
        "source_sentence": "佛在王舍城竹林園住。",
        "translation": "The Buddha was staying at the bamboo grove in Rājagṛha.",
        "source": "T24n1451_031:0360c29_0"
    },
    {
        "source_sentence": "時此城內於一山邊，有藥叉神而為居止名曰娑多，此常擁護影勝大王、中宮妃后、王臣、宰輔及諸人眾。",
        "translation": "Within this city, there's a yakṣa spirit named Sadā who lives on the edge of a mountain and is called Sadā. This always embraces the shadow-protecting great king, the middle palace queen, the king's ministers, the prime ministers, and other people.",
        "source": "T24n1451_031:0360c29_1"
    },
    {
        "source_sentence": "由彼力故，王及諸人悉皆安樂，時降甘雨苗稼善成，華果泉池在處充滿，常無飢儉乞求易得。",
        "translation": "Because of their power, the king and his people are all at ease, with sweet rain falling in season, crops that are well planted, flowers and fruit ponds filled everywhere, and there's always no hunger or thirst, begging for easy access.",
        "source": "T24n1451_031:0361a02_2"
    },
    {
        "source_sentence": "諸有沙門婆羅門、貧窮孤獨、商估之類，悉皆來湊摩揭陀國，時此藥叉亦皆覆護。",
        "translation": "All the śramaṇas, brāhmaṇas, poor, orphaned, and merchants came to live in the country of Magadha. At that time the yakṣa also protected them all.",
        "source": "T24n1451_031:0361a05_0"
    },
    {
        "source_sentence": "娑多遂於自類族中娶妻同住。",
        "translation": "So Sāta then married and lived together among his own kinds of people.",
        "source": "T24n1451_031:0361a06_1"
    },
    {
        "source_sentence": "是時北方健陀羅國，復有藥叉名半遮羅，恒住於彼亦常能擁護，令彼國中安隱豐樂，與摩揭陀境事無差異，時彼藥叉亦於同類娶妻共居。",
        "translation": "At the time, there was another yakṣa named Pāṇḍara in the northern kingdom of Gandhāra, who always stayed there and could always protect it so that his country would be peaceful and prosperous and not different from the affairs of Magadha, and then that yakṣa would also marry and live together with their wives in the same kind.",
        "source": "T24n1451_031:0361a07_2"
    },
    {
        "source_sentence": "後於異時諸方藥叉共為聚會，此二藥叉得申歡愛共為親友，執別之後各還故居。",
        "translation": "Later, at another time, the yakṣas in different directions gathered together for a meeting, and these two yakṣas were able to express their joy and become intimate with each other. After they had parted company, they each returned home.",
        "source": "T24n1451_031:0361a10_3"
    },
    {
        "source_sentence": "娑多藥叉取摩揭陀上妙華果送與半遮羅，彼以北方所出華果送與娑多，如是多時共申情好。",
        "translation": "The sata yakṣa takes the marvelous flowers and fruits of Magadha and sends them to half a bowl, and he sends the flowers and fruits that come from the north to the sata, thus often expressing his good feelings together.",
        "source": "T24n1451_031:0361a12_4"
    },
    {
        "source_sentence": "復因聚會重得交歡，是時娑多語半遮羅曰：「作何方便？",
        "translation": "Again, as a result of the gathering, they'll be able to exchange resentment, and then Sadāparibhūta said to Bimbisāra, What method will you use?",
        "source": "T24n1451_031:0361a14_5"
    },
    {
        "source_sentence": "我等歿後所有子孫，共為親愛不相疎隔。」",
        "translation": "All of our children and grandchildren will be loved by us after we die, not separated from each other.",
        "source": "T24n1451_031:0361a16_6"
    },
    {
        "source_sentence": "半遮羅曰：「善哉斯語！",
        "translation": "Pāṇḍara said, Good, that's what you say!",
        "source": "T24n1451_031:0361a17_7"
    },
    {
        "source_sentence": "我意同爾。」",
        "translation": "I think it's the same as that.",
        "source": "T24n1451_031:0361a17_8"
    },
    {
        "source_sentence": "娑多曰：「今可共作指腹之親，我等二門若生男女，共為婚媾。」",
        "translation": "Sāta said, Now, we can be the relatives of each other's fingers and abdomen, and if we give birth to a man or woman in both ways, we'll be married together.",
        "source": "T24n1451_031:0361a17_9"
    },
    {
        "source_sentence": "彼言：「可爾。」",
        "translation": "They said, That's right.",
        "source": "T24n1451_031:0361a19_10"
    },
    {
        "source_sentence": "時娑多妻未經多時，遂有娠體，月滿生女，容貌端嚴見者愛樂，其女生時諸藥叉眾咸皆歡慶，諸親立字名曰歡喜。",
        "translation": "Not long after that, Sodha's wife became pregnant and gave birth to a woman in the full moon whose appearance was pleasing to those who saw her. The yakṣas all rejoiced when she was born, and their relatives named her joyous.",
        "source": "T24n1451_031:0361a19_11"
    },
    {
        "source_sentence": "于時半遮羅聞彼生女，情甚歡悅便作是念：「娑多藥叉是我親友，今既生女我當生男，彼即是我所愛新婦，可作嚴身瓔珞衣服。」",
        "translation": "When Pāṇḍara heard that the woman gave birth, he was overjoyed and thought, That sata yakṣa is my close friend, and now that she's born, I will give birth to a boy, which is my beloved new wife, so you can make an ornate diadem robe for her.",
        "source": "T24n1451_031:0361a22_12"
    },
    {
        "source_sentence": "令使送去并持書曰：「聞君生女情甚歡悅，今送衣服願垂納受。」",
        "translation": "He ordered his envoy to send it away and took a letter with him, saying, I've heard you give birth to a woman with great joy, so now I'll send you my clothes and wish to accept them.",
        "source": "T24n1451_031:0361a25_0"
    },
    {
        "source_sentence": "時娑多得書領信還以書答。",
        "translation": "When he received the letter, Sadā returned with a letter and reply.",
        "source": "T24n1451_031:0361a26_1"
    },
    {
        "source_sentence": "然半遮羅意唯求男子，未久之頃婦遂有娠，月滿生兒與其立字，既是半遮羅子應號半支迦。",
        "translation": "Soon afterward, the woman became pregnant and gave birth to a child at the end of the month. Since he was half-Cāra’s child, his name should have been Half-Cāra.",
        "source": "T24n1451_031:0361a27_2"
    },
    {
        "source_sentence": "時娑多藥叉聞半遮羅生一男子，便作是念：「我友生男豈得徒然，可寄衣瓔用申歡慶，彼即是我女夫何疑？」",
        "translation": "When Sāta Yakṣa heard that a man named Pāṇḍara gave birth to a man, he thought, How could my friend give birth to a man in vain who can send his robe and jewelry to express his joy?",
        "source": "T24n1451_031:0361a29_3"
    },
    {
        "source_sentence": "遂裁書曰：「聞君誕子，慶喜交懷，聊寄衣纓用申欣賀，幸當為受冀表不空。」",
        "translation": "He then wrote a letter, saying, I'm happy to hear that your birthday is celebrated, and I'll send you my robe in order to express my congratulations, so fortunately, I'll accept it for you.",
        "source": "T24n1451_031:0361b02_4"
    },
    {
        "source_sentence": "彼覽書已，報書答曰：「許作交親今皆遂願，各待成立共作婚姻。」",
        "translation": "After reading the book, he replied in reply, I'll allow you to make a gift to my relatives, and now they've all fulfilled their vows, so we'll each wait until it's settled and married together.",
        "source": "T24n1451_031:0361b04_5"
    },
    {
        "source_sentence": "時娑多藥叉婦還有娠，其時諸山出聲如大象吼，月滿生時其山復吼，諸親議曰：「此之孩子，託胎之日及以生時山皆鳴吼，既是娑多之子，應名娑多山。」",
        "translation": "When the sata yakṣa woman was still pregnant, the sounds of the mountains rose up like an elephant's roar, and when she was born at the end of the moon, the mountains roared again, and their relatives said, On the day she entered the womb and when she was born, the mountains all roared, and since this is the son of sata, it should be called Sata Mountain.",
        "source": "T24n1451_031:0361b05_6"
    },
    {
        "source_sentence": "既長大已父遂身亡，自為家主，是時歡喜年既長成，報其弟曰：「我今欲得遊王舍城，現有諸人所生男女悉皆取食。」",
        "translation": "When he grew up, his father died and became the head of his family, and when he was old enough to rejoice, he reported to his younger brother, Now that I want to travel to Rājagṛha, there are men and women born by people who all take food.",
        "source": "T24n1451_031:0361b09_7"
    },
    {
        "source_sentence": "弟言：「大姊！",
        "translation": "The younger brother said, Great sister!",
        "source": "T24n1451_031:0361b11_8"
    },
    {
        "source_sentence": "曾聞我父於此城主及諸人眾常皆擁護，令得安樂離諸憂惱，我今宜可更加守衛，此則是我所防境界，若有餘人為損害者我應遮護。",
        "translation": "I've heard that my father always protected the lord of this city and the people there, so they'll attain peace and freedom from sorrow. Now, it's appropriate for me to guard them again. This is my sphere of protection, and if there are any other people who harm me, I should protect them.",
        "source": "T24n1451_031:0361b12_9"
    },
    {
        "source_sentence": "爾今何得生此惡心？",
        "translation": "How could you now give rise to this bad thought?",
        "source": "T24n1451_031:0361b15_10"
    },
    {
        "source_sentence": "宜除此念。」",
        "translation": "It's advisable to remove this thought.",
        "source": "T24n1451_031:0361b15_11"
    },
    {
        "source_sentence": "然藥叉女由於前身發惡邪願習氣力故，復告其弟說如前事。",
        "translation": "Still, it was because of the power of the karmic impressions of bad and evil vows in her previous life that the yakṣa woman again told her younger brother to tell him as before.",
        "source": "T24n1451_031:0361b15_12"
    },
    {
        "source_sentence": "弟知姊意事難迴改，作如是念：「我力不能遮其惡念，然父在日許嫁與他，我今宜可作婚姻事。」",
        "translation": "Knowing that his sister's intention was difficult to change, the younger brother thought, I couldn't stop her bad thoughts with my strength, but my father agreed to marry me to him on the day, so now it's appropriate for me to perform a marriage ceremony.",
        "source": "T24n1451_031:0361b17_13"
    },
    {
        "source_sentence": "即便裁書與半遮羅藥叉曰：「我姊歡喜年既長成，宜可為親當速來此。」",
        "translation": "He then cut the book and gave it to Pāṇḍara Yakṣa, saying, My sister is so elderly that she'll quickly come here as a relative.",
        "source": "T24n1451_031:0361b19_14"
    },
    {
        "source_sentence": "彼得書已便為盛禮，至王舍城娶婦歸故。",
        "translation": "After he had written this letter, Peter paid his respects and went to the city of Rājagṛha to take his wife back home.",
        "source": "T24n1451_031:0361b20_15"
    },
    {
        "source_sentence": "既至本城經多時已，與其夫主情義相得，作如是語：「仁者當知！",
        "translation": "After arriving in his hometown for a long time, he met with the husband's lord and said, You should know this, sir!",
        "source": "T24n1451_031:0361b21_16"
    },
    {
        "source_sentence": "我意欲得王舍城中現在人眾所生男女皆取食之。」",
        "translation": "I want to get the men and women born in the city of Rājagṛha who are present in the human world to eat them.",
        "source": "T24n1451_031:0361b23_17"
    },
    {
        "source_sentence": "答言：「賢首！",
        "translation": "He replied, Good man!",
        "source": "T24n1451_031:0361b24_18"
    },
    {
        "source_sentence": "彼皆是汝家族住處，餘來侵害尚欲相遮，寧容汝今輒為酷虐興斯惡念？",
        "translation": "They are all your family's dwelling places, and the others who attack them still want to hide from each other. How could you now often be subjected to torture and give rise to this bad thought?",
        "source": "T24n1451_031:0361b24_19"
    },
    {
        "source_sentence": "勿更再言。」",
        "translation": "Don't say it again.",
        "source": "T24n1451_031:0361b26_20"
    },
    {
        "source_sentence": "由彼前身所發邪願熏習力故，作不忍聲懷瞋且默。",
        "translation": "Because of the permeation power of the evil vows they had undertaken in their previous lives, they made an unbearable voice, harbored anger, and remained silent.",
        "source": "T24n1451_031:0361b26_21"
    },
    {
        "source_sentence": "後於異時便生一子，如是次第更生五百，其最小者名曰愛兒。",
        "translation": "At another time, a child will be born. In this way, five hundred children will successively be born one after the other. The smallest of these five hundred children will be called Fancy Children.",
        "source": "T24n1451_031:0361b27_22"
    },
    {
        "source_sentence": "時五百兒威勢成立，母恃豪強欲行非法，夫頻勸誨竟不受言，夫知彼心默爾而住。",
        "translation": "When the five hundred children's authority was established, their mother became powerful and wanted to do something unlawful, but after frequently admonishing them, she didn't say anything, knowing that they were silent in their minds and stayed.",
        "source": "T24n1451_031:0361b29_23"
    },
    {
        "source_sentence": "是時歡喜便於王舍城中隨來去處，現在人眾所生男女為次食之。",
        "translation": "They then rejoiced and went to the city of Rājagṛha wherever they came and went, and the men and women born in the human world now ate them next.",
        "source": "T24n1451_031:0361c02_24"
    },
    {
        "source_sentence": "爾時城中既失男女，所有人眾皆共白王：「臣等男女皆被盜將，不知是誰作斯巨害？",
        "translation": "It was then that the men and women in the city lost their men and women, and everyone in the assembly said to the king, The ministers and men were all robbed by thieves, not knowing who did this great harm.",
        "source": "T24n1451_031:0361c03_25"
    },
    {
        "source_sentence": "痛惱中極欲遣如何？",
        "translation": "What's the dismissal of extreme desire in pain and distress?",
        "source": "T24n1451_031:0361c05_26"
    },
    {
        "source_sentence": "願王慈悲善為尋察。」",
        "translation": "May the king have mercy and compassion and investigate it well.",
        "source": "T24n1451_031:0361c06_0"
    },
    {
        "source_sentence": "王即勅令諸處街衢，四面城門令兵守捉。",
        "translation": "The king then ordered his troops to guard the streets and gates on all four sides of the city.",
        "source": "T24n1451_031:0361c06_1"
    },
    {
        "source_sentence": "時諸兵士亦被偷將，日覺少人不知去處？",
        "translation": "The soldiers were also stolen, and when the day dawned, few of them didn't know where to go.",
        "source": "T24n1451_031:0361c07_2"
    },
    {
        "source_sentence": "婦人懷娠者咸亦被偷，將向餘處。",
        "translation": "The pregnant women were all stolen, and they were about to go somewhere else.",
        "source": "T24n1451_031:0361c08_3"
    },
    {
        "source_sentence": "于時王舍城中大災盛起，諸王臣佐重啟大王：「今此國中生大災難，具說上事。」",
        "translation": "When a great calamity occurred in the city of Rājagṛha, the king's ministers asked the great king again, Now that there's a great calamity in this country, I'll explain the above.",
        "source": "T24n1451_031:0361c09_4"
    },
    {
        "source_sentence": "王聞驚怪即喚卜師問其所以，答曰：「斯之災橫皆是藥叉所作，宜可速辦諸妙飲食而為祭祀。」",
        "translation": "Surprised, the king heard this and summoned the potter to ask him why, and he answered, All of these calamities are caused by yakṣas; it's better to quickly prepare wonderful food and drink for an offering.",
        "source": "T24n1451_031:0361c10_5"
    },
    {
        "source_sentence": "王下明勅擊鼓宣令，告諸人曰：「無問主客在我境者，皆須備辦飲食香華，掃灑街衢城隍聚落，種種嚴飾鼓樂音聲鈴鐸幡幢。」",
        "translation": "The king then instructed the emperor to strike the drum and proclaimed the order, telling the people, No matter how many hosts and guests are in my realm, they must prepare food, drink, incense, flowers, sweep streets, roads, cities, gods, and villages, variously adorned with drums, music, sounds, bells, chimes, dots, banners, and banners.",
        "source": "T24n1451_031:0361c13_6"
    },
    {
        "source_sentence": "于時王舍城人既奉王勅，各以精心備辦飲食香華等物，嚴飾街衢如歡喜園處處祭祀。",
        "translation": "The people of Rājagṛha then obeyed the king's command, each prepared a special offering of food, drink, incense, flowers, and other things to adorn the streets and thoroughfares like joyful parks and places for sacrifice.",
        "source": "T24n1451_031:0361c15_7"
    },
    {
        "source_sentence": "雖勞備設災橫不除，苦惱憂惶莫知所計。",
        "translation": "Even though it's hard to prepare, the disaster won't be removed, and no one knows what to reckon with pain and distress.",
        "source": "T24n1451_031:0361c17_8"
    },
    {
        "source_sentence": "于時守護王舍城天神，於睡夢中告諸人曰：「汝等男女咸被歡喜藥叉之所食噉，汝等宜可往世尊處，所有災苦佛當調伏。」",
        "translation": "The guardian goddess of Rājagṛha then told the people in a sleepy dream, All of you men and women will be eaten by joyful yakṣas; you should go to the Bhagavān's place, for all the calamities and sufferings of the Buddha will be subdued.",
        "source": "T24n1451_031:0361c18_9"
    },
    {
        "source_sentence": "諸人報神曰：「此既取我男女充食，則是惡賊藥叉，何名歡喜？」",
        "translation": "The people answered the gods and said, Since this is taking my men and women to fill their mouths with food, what's the name of that bad thief or yakṣa who rejoices?",
        "source": "T24n1451_031:0361c21_10"
    },
    {
        "source_sentence": "因此諸人皆喚為訶利底藥叉女。",
        "translation": "That's why all the people called her Hāritī, the yakṣa woman.",
        "source": "T24n1451_031:0361c22_11"
    },
    {
        "source_sentence": "王舍城人聞是事已，皆往佛所頂禮佛足，白言：「世尊！",
        "translation": "When the people of Rājagṛha heard this, they all went to the Buddha, bowed their heads at his feet, and said, Bhagavān!",
        "source": "T24n1451_031:0361c23_12"
    },
    {
        "source_sentence": "此訶利底藥叉女，於王舍城所居人眾，便於長夜作不饒益。",
        "translation": "For a long time, this Hāritī Yakṣa woman was unbeneficial to the people living in Rājagṛha.",
        "source": "T24n1451_031:0361c24_13"
    },
    {
        "source_sentence": "我等於彼先無惡念，然彼於我懷毒害心，所生男女咸悉盜去以充飲食。",
        "translation": "We didn't have bad thoughts about them before, but they harbored poisonous thoughts about me, and the men and women who gave rise to them all stole away to feed and drink.",
        "source": "T24n1451_031:0361c26_14"
    },
    {
        "source_sentence": "唯願世尊憐愍我等為作調伏。」",
        "translation": "Please have mercy on us, Bhagavān, and discipline us for our sake.",
        "source": "T24n1451_031:0361c27_15"
    },
    {
        "source_sentence": "爾時世尊默然受請。",
        "translation": "It was then that the Bhagavān accepted the invitation by remaining silent.",
        "source": "T24n1451_031:0361c28_16"
    },
    {
        "source_sentence": "彼等咸知佛受請已，頂禮雙足奉辭而去。",
        "translation": "Knowing that the Buddha had accepted their invitation, they bowed their heads and feet, made obeisance, and departed.",
        "source": "T24n1451_031:0361c29_17"
    },
    {
        "source_sentence": "至明清旦，佛即著衣持鉢入城乞食，次第乞已還至本處，飯食訖即往訶利底藥叉住處。",
        "translation": "On the morning, at dawn, the Buddha then put on his robes, took his bowl, entered the city to solicit alms, returned to his original place after begging in order, and went to the dwelling place of Hāritī Yakṣa when he had finished eating.",
        "source": "T24n1451_031:0362a01_18"
    },
    {
        "source_sentence": "時藥叉女出行不在，小子愛兒留在家內，世尊即以鉢覆其上。",
        "translation": "When the yakṣa woman was traveling and not present, the boy's beloved child stayed at home, and the Bhagavān covered him with his bowl.",
        "source": "T24n1451_031:0362a03_19"
    },
    {
        "source_sentence": "如來威力令兄不見弟、弟見諸兄。",
        "translation": "The Tathāgata's authoritative power causes brothers not to see their younger brothers, and the younger brothers see their brothers.",
        "source": "T24n1451_031:0362a04_20"
    },
    {
        "source_sentence": "時藥叉女迴至住處不見小兒，即大驚忙觸處尋覓，及問諸子愛兒何在？",
        "translation": "The yakṣa woman then returned to her dwelling place and didn't see the small child, so she was terrified and searched for a place to touch him, and asked where the beloved child was.",
        "source": "T24n1451_031:0362a05_21"
    },
    {
        "source_sentence": "答言：「我等並皆不見。」",
        "translation": "They replied, We don't see them either.",
        "source": "T24n1451_031:0362a06_22"
    },
    {
        "source_sentence": "便自搥胸悲泣交流，脣口乾燋精神迷亂，情懷痛切速趣王城，遍行諸坊康莊道路，園林池沼天廟神堂，客舍空房皆求不得。",
        "translation": "He then beat his own chest, wept and cried in sorrow, and with dryness of mind and confusion, he hastened to the king's city with grief and pain, traveled through all the monasteries, quietly adorned roads, parks, forests, ponds, deva shrines, and holy halls, and couldn't find guesthouses or vacant dwellings.",
        "source": "T24n1451_031:0362a07_23"
    },
    {
        "source_sentence": "更加痛切便即癲狂，脫去衣裳大聲號叫，唱言：「愛兒！",
        "translation": "He became even more painful and then cried out in distress, took off his robes and clothes, shouted loudly, and called out, My dear child!",
        "source": "T24n1451_031:0362a10_24"
    },
    {
        "source_sentence": "汝今何在？」",
        "translation": "Where are you now?",
        "source": "T24n1451_031:0362a11_25"
    },
    {
        "source_sentence": "遂出城外巡歷村莊，大聚落中皆覓不得，即往四方乃至四海亦皆不見，被髮露形宛轉於地，肘行膝步蹲踞而坐，如是漸次到贍部洲、七大黑山、七大金山、七大雪山、無熱池、香醉山覓皆不得，情懷苦惱氣咽不通。",
        "translation": "He then left the city and traveled to villages, but he couldn't find them in large villages, so he went to the four directions or even the four seas, sat cross-legged with his elbows facing the ground and kneels down, and gradually reached Jambudvīpa, seven great black mountains, seven great gold mountains, seven great snowy mountains, a lack of hot water pond,",
        "source": "T24n1451_031:0362a11_26"
    },
    {
        "source_sentence": "又往東方毘提訶、西瞿陀尼、北俱盧洲亦皆不見。",
        "translation": "Further to the east, they don't see it in Videha, west of Godānī, or north of Kauṇḍinya.",
        "source": "T24n1451_031:0362a16_27"
    },
    {
        "source_sentence": "便往等活、黑繩、眾合、叫喚、大叫喚、熱、極熱、阿鼻止、頞部陀、尼剌部陀、阿吒吒、呵呵、婆呼呼婆、青蓮花、紅蓮花、大紅蓮花，如是等十六大地獄皆亦不見。",
        "translation": "They'll go to the sixteen great hells like this, such as alive, black cord, congregation, screaming, wailing, great wailing, heat, extreme heat, abhidharma, arbuda, nirarbuda, aṭṭa, heṣa, bodhisattva, blue lotus, red lotus, and great red lotus, and they won't see them either.",
        "source": "T24n1451_031:0362a17_28"
    },
    {
        "source_sentence": "又往妙高山處先登下層、次登第二、第三層，直過多聞天宮，至妙高山頂，先入眾車園、次入雜麁歡喜皆覓不見，即往圓生樹下乃至善法堂中。",
        "translation": "He ascended first to the lower, second and third stories at the place where the wonderful high mountain was located. After going straight beyond the palace of the well-versed celestial beings, he reached the top of the summit of the wonderful high mountain. Having entered the chariot park and the mixed carriages, he looked for them all with delight but could not find them. So he proceeded to the foot of the round",
        "source": "T24n1451_031:0362a20_29"
    },
    {
        "source_sentence": "入善見城欲入帝釋最勝殿中，時有金剛大神，與無量藥叉守門而住。",
        "translation": "When he entered the city of Sudarśana and wanted to enter the most distinguished hall of Indra, there was a great vajra deity standing guard at the gate with measureless yakṣas.",
        "source": "T24n1451_031:0362a24_30"
    },
    {
        "source_sentence": "見彼來入便即驅出善見城外，情加痛切。",
        "translation": "Seeing them coming and entering, he immediately expelled Sunetra outside the city, feeling even more painful.",
        "source": "T24n1451_031:0362a25_31"
    },
    {
        "source_sentence": "至多聞天處，於大石上投身躄地，悲啼號哭。",
        "translation": "When he arrived at the place of the well-versed celestial, he threw himself to the ground on a large rock and cried out in sorrow.",
        "source": "T24n1451_031:0362a26_32"
    },
    {
        "source_sentence": "白言：「大將軍！",
        "translation": "He said, Great general!",
        "source": "T24n1451_031:0362a27_33"
    },
    {
        "source_sentence": "我小子愛兒被他盜去，莫知何在？",
        "translation": "My beloved child has been stolen away by someone else, and I don't know where he is.",
        "source": "T24n1451_031:0362a28_0"
    },
    {
        "source_sentence": "願見施我。」",
        "translation": "May you see me and give it to me.",
        "source": "T24n1451_031:0362a28_1"
    },
    {
        "source_sentence": "多聞天曰：「姊妹！",
        "translation": "The well-versed gods said, Sister!",
        "source": "T24n1451_031:0362a29_0"
    },
    {
        "source_sentence": "不須憂惱自作癲狂，汝今且觀近汝家室，晝日遊處誰來居止？」",
        "translation": "You don't need to worry and become a madman yourself, so now look around near your house; who comes and stays at the place where you wander day and night?",
        "source": "T24n1451_031:0362a29_1"
    },
    {
        "source_sentence": "答言：「大將軍！",
        "translation": "He replied, General!",
        "source": "T24n1451_031:0362b01_2"
    },
    {
        "source_sentence": "沙門喬答摩在彼而住。」",
        "translation": "The ascetic Gautama stayed there.",
        "source": "T24n1451_031:0362b02_3"
    },
    {
        "source_sentence": "報曰：「若如是者，宜可速往彼世尊所而作歸向，彼當令汝得見愛兒。」",
        "translation": "He replied, If that's the case, it's advisable to quickly go to that Bhagavān and make a dedication of merit, and he will cause you to see your beloved child.",
        "source": "T24n1451_031:0362b02_4"
    },
    {
        "source_sentence": "彼聞斯語情生歡喜，如死再生還來本處。",
        "translation": "When they hear these words, their feelings become joyous, just like death and rebirth returning to their original place.",
        "source": "T24n1451_031:0362b04_5"
    },
    {
        "source_sentence": "遙見世尊三十二相，八十種好莊嚴其身，圓明赫奕超日千光如妙寶山，深生渴仰憂惱悉除情同得子。",
        "translation": "From a distance, he saw the thirty-two marks of the Bhagavān, his body adorned with eighty kinds of beauty, perfectly luminous and brilliant, surpassing the sun and thousand rays of light like a marvelous jeweled mountain, and he became deeply attached to it, relieved of all his grief and sorrow, and had the same feeling as if he had gained a child.",
        "source": "T24n1451_031:0362b05_6"
    },
    {
        "source_sentence": "既至佛所頂禮佛足，退坐一面白言：「世尊！",
        "translation": "When he arrived at the Buddha's place, he bowed his head at his feet, withdrew to one side, and said, Bhagavān!",
        "source": "T24n1451_031:0362b07_7"
    },
    {
        "source_sentence": "我久離別小子愛兒，唯願慈悲令我得見。」",
        "translation": "I've been separated from my beloved child for a long time, so please have mercy and compassion and let me see him.",
        "source": "T24n1451_031:0362b08_8"
    },
    {
        "source_sentence": "佛告訶利底藥叉女：「汝有幾子？」",
        "translation": "The Buddha told Hāritī the Yakṣa woman, How many children do you have?",
        "source": "T24n1451_031:0362b09_9"
    },
    {
        "source_sentence": "答言：「我有五百兒。」",
        "translation": "He replied, I have five hundred children.",
        "source": "T24n1451_031:0362b10_10"
    },
    {
        "source_sentence": "佛言：「訶利底！",
        "translation": "The Buddha said, Hāritī!",
        "source": "T24n1451_031:0362b10_11"
    },
    {
        "source_sentence": "五百子中一子若無，有何所苦？」",
        "translation": "If one of the five hundred children were absent, what would be painful?",
        "source": "T24n1451_031:0362b10_12"
    },
    {
        "source_sentence": "答言：「世尊！",
        "translation": "He replied, Bhagavān!",
        "source": "T24n1451_031:0362b11_13"
    },
    {
        "source_sentence": "我若今日不見愛兒，必吐熱血而取命終。」",
        "translation": "If I don't see my beloved child today, I'll surely spit out hot blood and die.",
        "source": "T24n1451_031:0362b11_14"
    },
    {
        "source_sentence": "佛言：「訶利底！",
        "translation": "The Buddha said, Hāritī!",
        "source": "T24n1451_031:0362b12_15"
    },
    {
        "source_sentence": "五百子中不見一兒受如是苦，況他一子汝偷取食，此苦如何？」",
        "translation": "Among the five hundred children, there's not a single child who suffers such pain, so why wouldn't you steal food from another child? What's this pain?",
        "source": "T24n1451_031:0362b13_16"
    },
    {
        "source_sentence": "答言：「此苦倍多於我。」",
        "translation": "He replied, This pain is twice as great as mine.",
        "source": "T24n1451_031:0362b14_17"
    },
    {
        "source_sentence": "佛言：「訶利底！",
        "translation": "The Buddha said, Hāritī!",
        "source": "T24n1451_031:0362b14_18"
    },
    {
        "source_sentence": "汝既審知愛別離苦，云何食他男女耶？」",
        "translation": "Since you know the pain of separation from craving, how can you eat other men and women?",
        "source": "T24n1451_031:0362b15_19"
    },
    {
        "source_sentence": "答言：「唯願世尊示誨於我。」",
        "translation": "He replied, Please, Bhagavān, show me the way.",
        "source": "T24n1451_031:0362b16_20"
    },
    {
        "source_sentence": "佛言：「訶利底！",
        "translation": "The Buddha said, Hāritī!",
        "source": "T24n1451_031:0362b16_21"
    },
    {
        "source_sentence": "可受我戒，王舍城中現在人眾皆施無畏。",
        "translation": "Accept my precepts, and all the people in Rājagṛha now give them without fear.",
        "source": "T24n1451_031:0362b17_22"
    },
    {
        "source_sentence": "若能如是，不起此坐得見愛兒。」",
        "translation": "If you can do so, don't get up from this seat and see your beloved child.",
        "source": "T24n1451_031:0362b18_23"
    },
    {
        "source_sentence": "答言：「世尊！",
        "translation": "He replied, Bhagavān!",
        "source": "T24n1451_031:0362b18_24"
    },
    {
        "source_sentence": "我從今已去依佛教勅，王舍城中現在諸人皆施無畏。」",
        "translation": "From now on, I'll follow the Buddha's instructions and give fearlessly to all the people in the present in Rājagṛha.",
        "source": "T24n1451_031:0362b19_0"
    },
    {
        "source_sentence": "作是語已，時佛令彼得見愛兒，于時訶利底歸依如來請受禁戒，城中人眾皆得安樂離諸憂惱。",
        "translation": "After he said this, the Buddha then told Peter to see his beloved child, and then Hāritī relied on the Tathāgata to ask him to accept the forbidden precepts, so the people in the city were all made comfortable and freed from their grief.",
        "source": "T24n1451_031:0362b20_1"
    },
    {
        "source_sentence": "時訶利底母親於佛所受三歸依并五學處，不殺生乃至不飲酒，前白佛言：「世尊！",
        "translation": "Hāritī's mother then accepted the three refuges and five places of training at the Buddha's place, didn't kill or even drank alcohol, and went to the Buddha and said, Bhagavān!",
        "source": "T24n1451_031:0362b22_2"
    },
    {
        "source_sentence": "我及諸兒從今已去何所食噉？」",
        "translation": "What will I and my children eat from now on?",
        "source": "T24n1451_031:0362b24_3"
    },
    {
        "source_sentence": "佛言：「善女！",
        "translation": "The Buddha said, Good girl!",
        "source": "T24n1451_031:0362b24_4"
    },
    {
        "source_sentence": "汝不須憂，於贍部洲所有我諸聲聞弟子，每於食次出眾生食，并於行末設食一盤，呼汝名字并諸兒子，皆令飽食永無飢苦。",
        "translation": "All the śrāvaka disciples of mine who live in Jambudvfpa give food to sentient beings at mealtimes, and set up a dining-table for their subsistence. Calling out your name and addressing your children, they will all be provided with food without hunger or suffering.",
        "source": "T24n1451_031:0362b25_5"
    },
    {
        "source_sentence": "若復有餘現在眾生，及江山海處諸鬼神等而應食者，皆悉運心令其飽足。」",
        "translation": "If there are any other sentient beings in the present, or ghosts and spirits in rivers, mountains, seas, and so forth who should eat them, they'll all move their minds to satisfy them.",
        "source": "T24n1451_031:0362b28_6"
    },
    {
        "source_sentence": "佛告訶利底：「又復我今付囑於汝，於我法中若諸伽藍僧尼住處，汝及諸兒常於晝夜勤心擁護，勿令衰損令得安樂。",
        "translation": "The Buddha told Hāritī, Furthermore, I now entrust to you that in my teaching, wherever the Kālāma monks and nuns live, you and your children should always guard them with diligence day and night so that they don't weaken and attain well-being.",
        "source": "T24n1451_031:0362b29_7"
    },
    {
        "source_sentence": "乃至我法未滅已來，於贍部洲應如是作。」",
        "translation": "Even after my teaching has ceased, I should do so in Jambudvīpa.",
        "source": "T24n1451_031:0362c03_8"
    },
    {
        "source_sentence": "爾時世尊說是語已，時訶利底母五百諸兒，及以諸來藥叉等眾，皆大歡喜頂禮奉行。",
        "translation": "After the Bhagavān had spoken these words, the five hundred children of Hāritī's mother and the other yakṣas who came along with them all rejoiced and bowed their heads in respect.",
        "source": "T24n1451_031:0362c04_9"
    },
    {
        "source_sentence": "時諸苾芻聞佛說已，咸皆有疑，請世尊曰：「訶利底母先作何業？",
        "translation": "When the monks heard what the Buddha taught, they all had doubts and asked the Bhagavān, What did Hāritī's mother do first?",
        "source": "T24n1451_031:0362c06_10"
    },
    {
        "source_sentence": "生五百兒吸人精氣，食王舍城人所生男女。」",
        "translation": "He gave birth to five hundred children who sucked human energy and ate the men and women born from the people of Rājagṛha.",
        "source": "T24n1451_031:0362c07_11"
    },
    {
        "source_sentence": "佛告諸苾芻：「汝等諦聽！",
        "translation": "The Buddha told the monks, Listen closely!",
        "source": "T24n1451_031:0362c08_12"
    },
    {
        "source_sentence": "此藥叉女及此城人，先所作業還須自受。",
        "translation": "This yakṣa woman and the people of this city must themselves accept what they did before.",
        "source": "T24n1451_031:0362c09_13"
    },
    {
        "source_sentence": "「汝等苾芻！",
        "translation": "You monks!",
        "source": "T24n1451_031:0362c11_0"
    },
    {
        "source_sentence": "乃往過去王舍城中有牧牛人，娶妻未久遂即有娠，是時無佛但有獨覺出現人間，樂居寂靜，受用隨宜邊際臥具，世間唯有此一福田。",
        "translation": "In the past, there was a cowherd in the city of Rājagṛha who became pregnant soon after he had married his wife. There were no buddhas but only pratyekabuddhas appearing in the human world at that time. They lived happily in seclusion and used bedding as appropriate for their sleep.",
        "source": "T24n1451_031:0362c11_1"
    },
    {
        "source_sentence": "時此獨覺遊行人間至王舍城，為大設會，有五百人各各嚴身，咸持飲食并將音樂共詣芳園。",
        "translation": "The pratyekabuddha then traveled among the people to the city of Rājagṛha and set up a great assembly, in which five hundred people each adorned themselves with their bodies, all bringing food and drink and music to the fragrant grove.",
        "source": "T24n1451_031:0362c14_2"
    },
    {
        "source_sentence": "於其路中，逢見懷娠牧牛之女持酪漿瓶，諸人告言：『姊妹！",
        "translation": "On the roadway, he met a pregnant cowherd holding a jar of cream and juice, and they told him, 'Sister!'",
        "source": "T24n1451_031:0362c16_3"
    },
    {
        "source_sentence": "可來舞蹈共為歡樂。』",
        "translation": "You can come and dance together to enjoy it.'",
        "source": "T24n1451_031:0362c17_4"
    },
    {
        "source_sentence": "女見相喚便起欲心，舉目揚眉共為舞蹈。",
        "translation": "Seeing each other's cries, the woman then arouses a mind of desire and raises her eyebrows to dance together.",
        "source": "T24n1451_031:0362c18_5"
    },
    {
        "source_sentence": "由其疲頓遂即墮胎。",
        "translation": "As a result of his exhaustion, he then fell into the womb.",
        "source": "T24n1451_031:0362c19_6"
    },
    {
        "source_sentence": "城中諸人皆向園內，女懷憂惱掌頰而住，便以酪漿買得五百菴沒羅果。",
        "translation": "The people in the city all went inside the garden, and the woman stayed there with grieved palms and cheeks, so she bought 500 grapes of ambrosia with cream and juice.",
        "source": "T24n1451_031:0362c19_7"
    },
    {
        "source_sentence": "時彼獨覺來至女傍，其女遙見身心寂定，威儀庠序在路而行，情生敬仰遂即近前，頂禮雙足持香美果奉施聖人。",
        "translation": "The pratyekabuddha then came to the woman's side, saw her body and mind quiescent from a distance, behaved in a dignified manner, walked along the road, became respectful, bowed his head at both feet, offered incense and fruit to the sage.",
        "source": "T24n1451_031:0362c21_8"
    },
    {
        "source_sentence": "諸獨覺者但以身化口不說法，欲饒益彼女人故，如大鵝王開舒兩翼，上昇虛空現諸神變。",
        "translation": "The solitary realizers simply use their bodies to transform themselves and don't teach, and because they want to benefit those women, they're like a great goose king who opens and spreads its two wings and ascends up into space to show miraculous transformations.",
        "source": "T24n1451_031:0362c23_9"
    },
    {
        "source_sentence": "凡夫之人見神通時，心便歸向如大樹崩，投身于地合掌發願：『我今於此真實福田所施功德，願我當來生王舍城，於此城中現在人眾所生男女我皆取食。』",
        "translation": "When ordinary people see the miraculous powers, their minds return to them like a great tree that falls down and they throw themselves into the ground with their palms joined and give rise to the vow, 'Now, may I be born in the city of Rājagṛha in the future, where all the men and women who are born in this city by the present multitude of people take food for me.'",
        "source": "T24n1451_031:0362c26_0"
    },
    {
        "source_sentence": "汝等苾芻於意云何？",
        "translation": "What do you monks think?",
        "source": "T24n1451_031:0362c29_1"
    },
    {
        "source_sentence": "彼牧牛女豈異人乎？",
        "translation": "Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is",
        "source": "T24n1451_031:0363a01_0"
    },
    {
        "source_sentence": "即訶利底藥叉女是，由彼往昔奉施獨覺五百菴沒羅果發惡願故，今生王舍城作藥叉女生五百子，吸人精氣食噉城中所有男女。",
        "translation": "That woman named Hāritī Yakṣa was born in Rājagṛha because of the bad vow she had made in the past to give five hundred saṃgara fruits to the five hundred pratyekabuddhas who were solitary realizers, and now she's born in Rājagṛha as a yakṣa girl with five hundred children, sucking human energy and feeding all the men and women in Rājagṛha",
        "source": "T24n1451_031:0363a01_1"
    },
    {
        "source_sentence": "汝等苾芻！",
        "translation": "You monks!",
        "source": "T24n1451_031:0363a04_2"
    },
    {
        "source_sentence": "我常宣說：黑業黑報、雜業雜報、白業白報。",
        "translation": "I always proclaim that black karma has black retribution, mixed karma has mixed retribution, and white karma has white retribution.",
        "source": "T24n1451_031:0363a04_3"
    },
    {
        "source_sentence": "汝等應當勤修白業離黑雜業，乃至果報還其自受。」",
        "translation": "You should diligently cultivate white karma, part with black and mixed karma, and return it to yourself as a result.",
        "source": "T24n1451_031:0363a05_4"
    },
    {
        "source_sentence": "時諸苾芻聞佛說已，心大歡喜，頂禮佛足，奉辭而去。",
        "translation": "Having heard the Buddha’s exhortation, the bhikṣus were greatly delighted. They bowed their heads at the Buddha’s feet and departed.",
        "source": "T24n1451_031:0363a06_5"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T24n1451_031:0363a08_0"
    },
    {
        "source_sentence": "時訶利底既受如來三歸五戒已，遂被諸餘藥叉神等而作災難，即將諸子施與眾僧。",
        "translation": "After he had received the three refuges and five precepts of the Tathāgata, Hāritī then became afflicted by the other yakṣa spirits and so forth, who gave his children to the saṃgha.",
        "source": "T24n1451_031:0363a08_1"
    },
    {
        "source_sentence": "若見苾芻行乞食時，皆化作小兒隨後而去。",
        "translation": "If they see a monk walking around begging for food, they'll all transform into children and leave.",
        "source": "T24n1451_031:0363a10_2"
    },
    {
        "source_sentence": "王舍城中女人見時，多生憐愛即來抱持，彼便隱沒。",
        "translation": "When the women in the city of Rājagṛha saw him, they became so compassionate that they came to embrace him and he went into hiding.",
        "source": "T24n1451_031:0363a11_3"
    },
    {
        "source_sentence": "時諸女人白苾芻曰：「此是誰子？」",
        "translation": "The women then said to the monk, Who's this child?",
        "source": "T24n1451_031:0363a12_4"
    },
    {
        "source_sentence": "答言：「訶利底兒。」",
        "translation": "He replied, Hāritī.",
        "source": "T24n1451_031:0363a13_0"
    },
    {
        "source_sentence": "女人報曰：「此是怨家毒害藥叉所生子耶？」",
        "translation": "The woman replied, Is this the child born by a hostile family of poisonous yakṣas?",
        "source": "T24n1451_031:0363a13_1"
    },
    {
        "source_sentence": "苾芻報曰：「彼已皆捨毒害之心，為諸藥叉與作災難，為此將來施與我等。」",
        "translation": "The monks replied, They've all abandoned poisonous thoughts and created disasters for the yakṣas, and they'll give them to us in the future for this.",
        "source": "T24n1451_031:0363a14_2"
    },
    {
        "source_sentence": "女人作念：「藥叉之女，能捨惡心將子奉施，我等諸子何不施與？」",
        "translation": "The woman thought, Yakṣa's daughter can abandon bad thoughts and give her child to him, so why don't we children give it to him?",
        "source": "T24n1451_031:0363a15_3"
    },
    {
        "source_sentence": "遂將男女施與僧伽，僧伽不受。",
        "translation": "He then gave the man and woman to the saṃgha, but the saṃgha didn't accept it.",
        "source": "T24n1451_031:0363a17_4"
    },
    {
        "source_sentence": "女人白言：「聖者！",
        "translation": "The woman said, Sage!",
        "source": "T24n1451_031:0363a18_5"
    },
    {
        "source_sentence": "尚能納受毒害藥叉女兒，何故不受我等男女？」",
        "translation": "Why wouldn't you accept the poisonous and harmful yakṣa-daughter, why wouldn't you accept us men and women?",
        "source": "T24n1451_031:0363a18_6"
    },
    {
        "source_sentence": "時諸苾芻以緣白佛，佛言：「應受。」",
        "translation": "The monks then reported this to the Buddha for his sake, and he said, You should accept it.",
        "source": "T24n1451_031:0363a19_7"
    },
    {
        "source_sentence": "諸苾芻奉教雖受，不為守護，縱其自意隨處遊行。",
        "translation": "Although the monks accepted the teaching, they didn't guard it, and even though they did so with their own minds, they traveled around.",
        "source": "T24n1451_031:0363a20_8"
    },
    {
        "source_sentence": "諸苾芻白佛，佛言：「若將一男施與僧伽，一苾芻為受，以故袈裟片繫其頂上而為守護。",
        "translation": "The monks said to the Buddha, who said, Suppose you were to give a man to the saṃgha, and one monk accepts it because he's wearing an old piece of his robe tied around his head as a guard.",
        "source": "T24n1451_031:0363a21_9"
    },
    {
        "source_sentence": "若多施與，於上中下座隨意受之，同前守護勿致疑惑。」",
        "translation": "If you give much, the superior, middle, and inferior seats will accept it as they wish, just like the previous one, guarding it without doubt.",
        "source": "T24n1451_031:0363a23_10"
    },
    {
        "source_sentence": "時諸父母遂將財物，還來贖取，諸苾芻不受，佛言：「應受。」",
        "translation": "The parents then returned to redeem their possessions, and the monks didn't accept them, but the Buddha said, You should accept them.",
        "source": "T24n1451_031:0363a24_11"
    },
    {
        "source_sentence": "彼於後時情生愛戀，復將衣物施與苾芻希報恩故，苾芻知心而不為受，佛言：「應受。」",
        "translation": "At a later time, his feelings became affectionate and he gave his clothing and property to the monk because he wanted to repay his kindness, but the monk knew his mind and didn't accept it; the Buddha said, Accept it.",
        "source": "T24n1451_031:0363a25_12"
    },
    {
        "source_sentence": "如世尊說應受贖兒財物者，時六眾苾芻遂從父母要索全價，佛言：「不應索價，應隨彼意知足受取。」",
        "translation": "As the Bhagavān said, Those who should accept the property to redeem their children's possessions, then the six monks asked for the full price from their parents, and the Buddha said, You shouldn't ask for the price; you should accept it according to their wishes.",
        "source": "T24n1451_031:0363a27_13"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T24n1451_031:0363b01_0"
    },
    {
        "source_sentence": "時訶利底藥叉女，既將諸子施與僧伽，夜臥患飢啼泣至曉。",
        "translation": "The Hāritī Yakṣa woman then gave her children to the saṃgha and lay down in distress at night, hungry and weeping until dawn.",
        "source": "T24n1451_031:0363b01_1"
    },
    {
        "source_sentence": "時諸苾芻以緣白佛，佛言：「晨朝應持飲食，稱其名字而祭祀之。」",
        "translation": "The monks then reported this to the Buddha for his sake, and he said, In the morning, you should take food and drink and name it by offering it to him.",
        "source": "T24n1451_031:0363b02_2"
    },
    {
        "source_sentence": "或有欲得齋時而食，佛言：「應與。」",
        "translation": "If someone wants to eat at the time of purification, the Buddha says, Give it to them.",
        "source": "T24n1451_031:0363b04_0"
    },
    {
        "source_sentence": "或有非時欲得飲食，佛言：「應與。」",
        "translation": "If someone wants to obtain food and drink at an ungodly hour, the Buddha says, Give it to them.",
        "source": "T24n1451_031:0363b04_1"
    },
    {
        "source_sentence": "或有欲得食苾芻鉢中殘食，佛言：「應與。」",
        "translation": "If someone wants to eat the leftover food in a monk's bowl, the Buddha says, Give it to them.",
        "source": "T24n1451_031:0363b05_2"
    },
    {
        "source_sentence": "或有欲得食諸不淨，佛言：「應與。」",
        "translation": "If someone wants to eat impure things, the Buddha says, They should be given.",
        "source": "T24n1451_031:0363b06_3"
    },
    {
        "source_sentence": "根本說一切有部毘奈耶雜事卷第三十一",
        "translation": "Mūlasarvâstivāda-vinaya miscellaneous works of the Sarvâstivāda school, vol. 31",
        "source": "T24n1451_031:0363b08_0"
    }
]