[
    {
        "source_sentence": "優婆塞戒經卷第四",
        "translation": "Upāsaka Precepts Sutra, Volume 4",
        "source": "T24n1488_004:1052b20_0"
    },
    {
        "source_sentence": "北涼中印度三藏曇無讖譯",
        "translation": "Northern Liang, Central India, translated by the Tripiṭaka Master Dharmakṣema",
        "source": "T24n1488_004:1052b22_0"
    },
    {
        "source_sentence": "六波羅蜜品第十八",
        "translation": "Chapter 18 of the Six Perfections",
        "source": "T24n1488_004:1052b23_0"
    },
    {
        "source_sentence": "善生言：「世尊！",
        "translation": "Sunetra said, Bhagavān!",
        "source": "T24n1488_004:1052b24_0"
    },
    {
        "source_sentence": "如佛先說供養六方，六方即是六波羅蜜，是人則能增長財、命，如是之人有何等相？」",
        "translation": "As the Buddha first explained, making offerings to the six directions are the six perfections in six directions, and these people can then increase their wealth and life, so what kind of characteristics does such a person have?",
        "source": "T24n1488_004:1052b24_1"
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, Good man!",
        "source": "T24n1488_004:1052b26_2"
    },
    {
        "source_sentence": "若能不惜一切財物，常於他人作利益事，念於布施，樂行布施，隨有隨施，不問多少。",
        "translation": "If they can not cherish all their possessions and always work for the benefit of others, they'll be mindful of generosity, happily practice generosity, give accordingly as they have it, and don't ask how much.",
        "source": "T24n1488_004:1052b26_3"
    },
    {
        "source_sentence": "當行施時，於身財物不生輕想；",
        "translation": "When they practice giving, they do not think lightly of their physical possessions.",
        "source": "T24n1488_004:1052b28_4"
    },
    {
        "source_sentence": "淨施不擇持戒、毀戒；",
        "translation": "Pure giving does not discriminate between observing and violating the precepts.",
        "source": "T24n1488_004:1052b29_5"
    },
    {
        "source_sentence": "讚歎布施，見行布施歡喜不妬；",
        "translation": "They praised giving and were joyful and not jealous when they saw the practice of giving.",
        "source": "T24n1488_004:1052b29_6"
    },
    {
        "source_sentence": "見有求者心則悅樂，起迎禮拜，施床命坐；",
        "translation": "When they saw those who asked for alms food, their hearts were joyful. They rose to greet and venerate the beggar, offered him a seat, and ordered him to sit down.",
        "source": "T24n1488_004:1052c01_7"
    },
    {
        "source_sentence": "前人諮問若不諮問，輒為讚歎布施之果。",
        "translation": "If someone before them asks questions or doesn't, they'll often praise the fruit of generosity.",
        "source": "T24n1488_004:1052c02_8"
    },
    {
        "source_sentence": "見恐怖者，能為救護，處飢饉世，樂施飲食，雖作是施，不為果報，不求恩報施。",
        "translation": "Seeing someone in fear, they're able to rescue them and protect them, and they're happy to give food and drink in a hungry world, even though they make this gift without seeking reward or repayment.",
        "source": "T24n1488_004:1052c03_9"
    },
    {
        "source_sentence": "不誑眾生，能讚三寶所有功德。",
        "translation": "They don't pity sentient beings, and they can praise the merits of the Three Treasures.",
        "source": "T24n1488_004:1052c04_10"
    },
    {
        "source_sentence": "不以斗稱雜餘異賤欺誑於人，不樂酒博貪欲之心，常修慚羞愧恥之德，雖復巨富，心不放逸，多行惠施，不生憍慢。",
        "translation": "They don't deceive others by mixing words with different and inferior names, don't enjoy wine and have a mind that's addicted to desire, always cultivate the virtue of shame and shame, and though they're very wealthy, their minds aren't lazy, often practice generosity, don't become arrogant, and don't become conceited.",
        "source": "T24n1488_004:1052c05_11"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1052c08_12"
    },
    {
        "source_sentence": "有是相者，當知是人則能供養施波羅蜜。",
        "translation": "If someone has these characteristics, you should know that they can then make offerings to the perfection of generosity.",
        "source": "T24n1488_004:1052c08_13"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1052c09_14"
    },
    {
        "source_sentence": "若有人能淨身、口、意，常修軟心，不作罪過，設誤作者，常生愧悔，信是罪業，得惡果報，所修善事，心生歡喜；",
        "translation": "Suppose there is a person who can purify body, speech, and mind. He should always cultivate a gentle state of mind that refrains from committing any offense or transgression, and if the perpetrator does so, he should always feel shame and regret. Believing this to be an act of a sinful nature, he will attain evil retribution for it. The good deeds he practices",
        "source": "T24n1488_004:1052c09_15"
    },
    {
        "source_sentence": "於小罪中生極重想，設其作已，恐怖憂悔。",
        "translation": "They give rise to extremely serious thoughts about minor sins, and if they do them, they'll be terrified and grieved.",
        "source": "T24n1488_004:1052c11_16"
    },
    {
        "source_sentence": "終不打罵瞋惱眾生。",
        "translation": "They never scold or anger sentient beings.",
        "source": "T24n1488_004:1052c12_17"
    },
    {
        "source_sentence": "先意語言，言輒柔軟。",
        "translation": "First, he speaks with his mind and words are gentle and flexible.",
        "source": "T24n1488_004:1052c13_18"
    },
    {
        "source_sentence": "見眾生已，生愛念心，知恩報恩，心不慳悋，不誑眾生。",
        "translation": "When they see sentient beings, they give rise to thoughts of love and knowledge of kindness and repay kindness, their minds aren't stingy or stingy with sentient beings.",
        "source": "T24n1488_004:1052c13_19"
    },
    {
        "source_sentence": "如法求財，樂作福德，所作功德常以化人。",
        "translation": "They seek wealth in accordance with the Dharma and delight in performing meritorious deeds. The virtues they perform are always intended to transform people.",
        "source": "T24n1488_004:1052c15_20"
    },
    {
        "source_sentence": "見窮苦者，身代受之，常修慈心，憐愍一切。",
        "translation": "Seeing extreme suffering, they accept it for their own sake and always cultivate a compassionate mind with pity for all.",
        "source": "T24n1488_004:1052c16_21"
    },
    {
        "source_sentence": "見作惡者，能為遮護；",
        "translation": "Those who commit evil deeds are able to shield them.",
        "source": "T24n1488_004:1052c17_22"
    },
    {
        "source_sentence": "見作善者，讚德說果，復以身力往營佐之。",
        "translation": "Seeing someone who does good deeds, he praises their virtue and explains the result, and he also goes to assist them with his physical strength.",
        "source": "T24n1488_004:1052c17_23"
    },
    {
        "source_sentence": "身不自由，令他自在。",
        "translation": "Their bodies aren't free, allowing others to be at ease.",
        "source": "T24n1488_004:1052c18_24"
    },
    {
        "source_sentence": "常修遠離瞋恚之心，或時暫起，覺生愧悔。",
        "translation": "He always cultivates a mind that's free of anger and sometimes produces it momentarily, feeling shame and remorse.",
        "source": "T24n1488_004:1052c18_25"
    },
    {
        "source_sentence": "實語、軟語，遠離兩舌及無義語。",
        "translation": "True speech and soft speech are free of duplicitous speech and meaningless speech.",
        "source": "T24n1488_004:1052c19_26"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1052c20_27"
    },
    {
        "source_sentence": "有是相者，當知是人則能供養戒波羅蜜。",
        "translation": "If someone has these characteristics, you should know that they'll be able to make offerings to the perfection of morality.",
        "source": "T24n1488_004:1052c20_28"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1052c21_29"
    },
    {
        "source_sentence": "若人能淨身、口、意業，眾生設以大惡事加，乃至不生一念瞋心，終不惡報；",
        "translation": "If someone is able to purify bodily, verbal, and mental actions, even if great evil deeds are done by sentient beings, not even a thought of anger will arise in them. They will never experience bad retribution.",
        "source": "T24n1488_004:1052c22_0"
    },
    {
        "source_sentence": "若來悔謝，即時受之。",
        "translation": "If someone comes to repent and apologize, they'll immediately accept it.",
        "source": "T24n1488_004:1052c23_1"
    },
    {
        "source_sentence": "見眾生時，心常歡喜，見作惡者，生憐愍心。",
        "translation": "When he sees sentient beings, his mind always rejoices, and when he sees evil, he becomes compassionate.",
        "source": "T24n1488_004:1052c24_2"
    },
    {
        "source_sentence": "讚歎忍果，呵責瞋恚，說瞋果報多有苦毒。",
        "translation": "They praise the fruit of forbearance, rebuke anger, and say that the result of anger is often painful and poisonous.",
        "source": "T24n1488_004:1052c25_3"
    },
    {
        "source_sentence": "修施忍時，先及怨家。",
        "translation": "When cultivating the forbearance of generosity, it's preceded by enemies and resentful people.",
        "source": "T24n1488_004:1052c26_0"
    },
    {
        "source_sentence": "正觀五陰眾緣合和，若和合成，何故生瞋？",
        "translation": "He correctly observes that the five aggregates are combined by various conditions, and if they are combined, why does anger arise?",
        "source": "T24n1488_004:1052c26_1"
    },
    {
        "source_sentence": "深觀瞋恚乃是未來無量惡道受苦因緣，若暫生瞋，則生慚愧恐怖悔心。",
        "translation": "He deeply observes that anger is the cause and condition for suffering in measureless bad destinies in the future, and if anger arises momentarily, then he becomes ashamed and fearful and repents.",
        "source": "T24n1488_004:1052c27_2"
    },
    {
        "source_sentence": "見他忍勝，不生妬嫉。",
        "translation": "Seeing the tolerance of others is superior, they don't become jealous.",
        "source": "T24n1488_004:1052c29_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1052c29_4"
    },
    {
        "source_sentence": "有是相者，當知是人則能供養忍波羅蜜。",
        "translation": "If someone has these characteristics, you should know that they can then make offerings to the perfection of forbearance.",
        "source": "T24n1488_004:1052c29_5"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1053a01_6"
    },
    {
        "source_sentence": "若有人能不作懈怠，不受不貪坐臥等樂，如作大事功德力時，及營小事心亦如是。",
        "translation": "If someone can be neither lazy nor lazy and doesn't experience pleasures like sitting or lying down without craving, it's likewise when they do great things, such as the power of merit and the mind that undertakes minor tasks.",
        "source": "T24n1488_004:1053a01_7"
    },
    {
        "source_sentence": "凡所作業，要令畢竟。",
        "translation": "Whatever works, it's necessary to make it complete.",
        "source": "T24n1488_004:1053a03_8"
    },
    {
        "source_sentence": "作時不觀飢渴、寒熱、時與非時。",
        "translation": "When he does so, he doesn't observe hunger and thirst, cold and heat, time and non-time.",
        "source": "T24n1488_004:1053a04_9"
    },
    {
        "source_sentence": "不輕自身。",
        "translation": "He doesn't despise himself.",
        "source": "T24n1488_004:1053a04_10"
    },
    {
        "source_sentence": "大事未訖，不生悔心；",
        "translation": "They do not give rise to remorse before the great work has been done.",
        "source": "T24n1488_004:1053a05_11"
    },
    {
        "source_sentence": "作既終訖，自慶能辦。",
        "translation": "When the work was finished, he rejoiced to be able to do it.",
        "source": "T24n1488_004:1053a05_12"
    },
    {
        "source_sentence": "讚歎精進所得果報。",
        "translation": "They praise the results of their effort.",
        "source": "T24n1488_004:1053a06_13"
    },
    {
        "source_sentence": "如法得財，用皆以理。",
        "translation": "They obtain wealth according to the Dharma and use it in accordance with principles.",
        "source": "T24n1488_004:1053a06_14"
    },
    {
        "source_sentence": "見邪進者，為說惡果。",
        "translation": "Someone who sees wrong effort and explains bad consequences for them.",
        "source": "T24n1488_004:1053a07_15"
    },
    {
        "source_sentence": "善教眾生令修精進，所作未竟，不中休息。",
        "translation": "He teaches sentient beings well and causes them to cultivate effort, but he doesn't rest until what he's done.",
        "source": "T24n1488_004:1053a07_16"
    },
    {
        "source_sentence": "修善法時，不隨他語。",
        "translation": "When cultivating good qualities, they don't follow the words of others.",
        "source": "T24n1488_004:1053a08_17"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1053a08_18"
    },
    {
        "source_sentence": "有是相者，當知是人則能供養進波羅蜜。",
        "translation": "If someone has these characteristics, you should know that they can then make offerings to the perfection of advancement.",
        "source": "T24n1488_004:1053a09_19"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1053a10_20"
    },
    {
        "source_sentence": "若有人能淨身、口、意，樂處空閑若窟、若山、樹林、空舍，不樂憒鬧、貪著臥具，不樂聽說世間之事，不樂貪欲、瞋恚、愚癡。",
        "translation": "Suppose there's a person who can purify body, speech, and thought, delighting in an empty place like a cave, a mountain, a forest, or an empty dwelling, not enjoying noisy noise, craving bedding, not listening to worldly affairs, and not indulging in desire, anger, or folly.",
        "source": "T24n1488_004:1053a10_21"
    },
    {
        "source_sentence": "先語、軟語，常樂出家教化眾生，所有煩惱輕微軟薄，離惡覺觀，見怨修慈，樂說定報，心若逸亂，生怖愧悔，見邪定者，為說罪過，善化眾生置正定中。",
        "translation": "They always delight in leaving home and teaching sentient beings, their afflictions are light and weak, they're free of bad feelings and contemplation, see enemies and cultivate kindness, enjoy the rewards of concentration and speak pleasantly, become frightened and remorseful when their minds are distracted, say faults for those who see wrong concentration, and skillfully transform sentient beings into right concentration.",
        "source": "T24n1488_004:1053a12_22"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1053a16_23"
    },
    {
        "source_sentence": "有是相者，當知是人則能供養禪波羅蜜。",
        "translation": "If someone has these characteristics, you should know that they'll be able to make offerings to the perfection of meditation.",
        "source": "T24n1488_004:1053a16_24"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1053a17_25"
    },
    {
        "source_sentence": "若有人能淨、身、口、意，悉學一切世間之事，於貪、瞋、癡心不貪樂，不狂、不亂。",
        "translation": "If someone can purify body, speech, and mind and fully train in all worldly affairs, they won't crave or enjoy the mind of greed, anger, or delusion, and they won't be crazy or disturbed.",
        "source": "T24n1488_004:1053a17_26"
    },
    {
        "source_sentence": "憐愍眾生，善能供養父母、師長、和上、長老、耆舊有德，修不放逸。",
        "translation": "They have compassion for sentient beings and are able to skillfully support their parents, teachers, elders, monks, elders, and senior citizens of virtue who cultivate nonfrivolity.",
        "source": "T24n1488_004:1053a19_27"
    },
    {
        "source_sentence": "先語、軟語，不誑眾生，能分別說邪道、正道及善惡報，常樂寂靜出家修道，能以世事用教眾生，見學勝己，不生妬心，自勝他人，不生憍慢。",
        "translation": "They speak eloquently and gently, without anger toward sentient beings. They can teach the wrong path, the right path, and the results of wholesome and unwholesome [practices]. They always delight in quiescence and renounce domestic life to practice Buddhism. They can teach sentient beings by means of worldly affairs. Seeing and training others, they do not become jealo",
        "source": "T24n1488_004:1053a20_28"
    },
    {
        "source_sentence": "受苦不憂，受樂不喜。",
        "translation": "They experience pain without sorrow and experience pleasure without joy.",
        "source": "T24n1488_004:1053a23_29"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1053a24_30"
    },
    {
        "source_sentence": "有是相者，當知是人則能供養般若波羅蜜。",
        "translation": "If someone has these characteristics, you should know that they can then make offerings to the prajñāpāramitā.",
        "source": "T24n1488_004:1053a24_31"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1053a25_32"
    },
    {
        "source_sentence": "一一方中各有四事，施方四者：一者：調伏眾生，二者、離對，三者、自利，四者、利他。",
        "translation": "In one direction, each has four things, and in the direction of giving, there are four: 1. subduing sentient beings, 2. freedom from opposition, 3. self-benefiting, and 4. benefiting others.",
        "source": "T24n1488_004:1053a25_33"
    },
    {
        "source_sentence": "若人於財不生慳惜，亦不分別怨親之相、時與非時，是人則能調伏眾生。",
        "translation": "If someone doesn't become stingy with their possessions and doesn't discriminate between the characteristics of enemies and relatives and the right and wrong times, that person will be able to tame sentient beings.",
        "source": "T24n1488_004:1053a27_34"
    },
    {
        "source_sentence": "於財不惜，故能行施，是故得離慳悋之惡，是名離對。",
        "translation": "Being able to practice generosity because they don't cherish possessions and thus attain freedom from the badness of stinginess, this is called being free of opposition.",
        "source": "T24n1488_004:1053a29_0"
    },
    {
        "source_sentence": "欲施、施時、施已、歡喜，不生悔心，是故未來受人天樂至無上樂，是名自利。",
        "translation": "Desiring to give, when giving, after giving, and rejoicing without regret, he'll experience the happiness of humans and gods in the future up to the unsurpassed happiness, which is called self-benefiting.",
        "source": "T24n1488_004:1053b01_1"
    },
    {
        "source_sentence": "能令他人離於飢渴苦切之惱，故名利他。",
        "translation": "It's called benefiting others because it causes others to be freed from hunger, thirst, pain, and suffering.",
        "source": "T24n1488_004:1053b02_2"
    },
    {
        "source_sentence": "「戒方四者：一者、莊嚴菩提，二者、離對，三者、自利，四者、利他。",
        "translation": "The four aspects of the precepts are: 1. adorning enlightenment, 2. freedom from opposition, 3. self-benefiting, and 4. benefiting others.",
        "source": "T24n1488_004:1053b03_3"
    },
    {
        "source_sentence": "莊嚴菩提者，優婆塞戒至菩薩戒，能為阿耨多羅三藐三菩提初地根基，是名莊嚴。",
        "translation": "Adornment of enlightenment means that the layman's precepts up to the bodhisattva's precepts can serve as the foundation of the first ground of unsurpassed, correct, and complete enlightenment, which is called adornment.",
        "source": "T24n1488_004:1053b05_4"
    },
    {
        "source_sentence": "既受戒已，復得遠離惡戒、無戒，是名離對。",
        "translation": "Having received the precepts, they'll again be free of bad precepts and no precepts, which is called being free of opposition.",
        "source": "T24n1488_004:1053b07_0"
    },
    {
        "source_sentence": "受持戒已，得人天樂至無上樂，是名自利。",
        "translation": "After observing the precepts, they attain the happiness of humans and gods up to the peerless happiness, which is called self-benefiting.",
        "source": "T24n1488_004:1053b07_1"
    },
    {
        "source_sentence": "既受戒已，施諸眾生無恐無畏，咸令一切離苦獲安，是名利他。",
        "translation": "Once they have received the precepts, they give them to sentient beings without fear or fear and cause all to be freed from suffering and attain peace, which is called benefiting others.",
        "source": "T24n1488_004:1053b08_2"
    },
    {
        "source_sentence": "「忍方四者：一者、莊嚴菩提，二者、離對，三者、自利，四者、利他。",
        "translation": "The four aspects of forbearance are: 1. adorning enlightenment, 2. freedom from opposition, 3. self-benefiting, and 4. benefiting others.",
        "source": "T24n1488_004:1053b10_3"
    },
    {
        "source_sentence": "莊嚴菩提者，因忍故得修善，修善故得初地乃至阿耨多羅三藐三菩提，是名莊嚴。",
        "translation": "Adorned enlightenment means that it's because of forbearance that they cultivate goodness and attain the first ground up to unsurpassed, correct, and complete enlightenment because of cultivating goodness, which is called adornment.",
        "source": "T24n1488_004:1053b11_4"
    },
    {
        "source_sentence": "既修忍已，能離瞋惡，是名離對。",
        "translation": "Having cultivated forbearance, he's able to part with anger and badness, which is called parting with opposition.",
        "source": "T24n1488_004:1053b13_5"
    },
    {
        "source_sentence": "忍因緣故，得人天樂至無上樂，是名自利。",
        "translation": "Because of the cause and condition of forbearance, they attain the happiness of humans and gods up to the unsurpassed happiness, which is called self-benefiting.",
        "source": "T24n1488_004:1053b14_6"
    },
    {
        "source_sentence": "忍因緣故，人生喜心、善心、調心，是名利他。",
        "translation": "Because of the causes and conditions of forbearance, a joyful mind, good mind, and tempered mind are produced, which is called benefiting others.",
        "source": "T24n1488_004:1053b15_7"
    },
    {
        "source_sentence": "「進方四者：一者、莊嚴菩提，二者、離對，三者、自利，四者、利他。",
        "translation": "The four directions of advancement are: 1. adorning enlightenment, 2. freedom from opposition, 3. self-benefiting, and 4. benefiting others.",
        "source": "T24n1488_004:1053b16_8"
    },
    {
        "source_sentence": "莊嚴菩提者，因精進故得修善，修善法故得初地乃至阿耨多羅三藐三菩提，是名莊嚴。",
        "translation": "Adorned enlightenment means that it's because of effort that they cultivate goodness and cultivate good qualities that they attain the first ground up to unsurpassed, correct, and complete enlightenment, which is called adornment.",
        "source": "T24n1488_004:1053b17_9"
    },
    {
        "source_sentence": "修善法時，離惡懈怠，是名離對。",
        "translation": "When cultivating good qualities, he's free of badness and lazy, which is called being free of opposition.",
        "source": "T24n1488_004:1053b19_10"
    },
    {
        "source_sentence": "因是善法，得人天樂至無上樂，是名自利。",
        "translation": "Because of these good qualities, they attain the happiness of humans and gods up to the unsurpassed happiness, which is called self-benefiting.",
        "source": "T24n1488_004:1053b20_11"
    },
    {
        "source_sentence": "教眾生修善，令離惡法，是名利他。",
        "translation": "Teaching sentient beings to cultivate goodness and make them part with bad qualities is called benefiting others.",
        "source": "T24n1488_004:1053b21_12"
    },
    {
        "source_sentence": "「禪方四者：一者、莊嚴菩提，二者、離對，三者、自利，四者、利他。",
        "translation": "The four directions of meditation are: 1. adorning enlightenment, 2. freedom from opposition, 3. self-benefiting, and 4. benefiting others.",
        "source": "T24n1488_004:1053b22_0"
    },
    {
        "source_sentence": "莊嚴菩提者，因修如是禪定力故，獲得初地乃至阿耨多羅三藐三菩提，是名莊嚴。",
        "translation": "Adorned enlightenment means that because of cultivating the power of such meditation, they attain the first ground up to unsurpassed, correct, and complete enlightenment, which is called adornment.",
        "source": "T24n1488_004:1053b23_1"
    },
    {
        "source_sentence": "因是禪定修無量善，離惡覺觀，是名離對。",
        "translation": "Because of this meditation, they cultivate measureless goodness and part with bad perception and contemplation, which is called parting with opposition.",
        "source": "T24n1488_004:1053b25_2"
    },
    {
        "source_sentence": "修舍摩他因緣力故，常樂寂靜，得人天樂至無上樂，是名自利。",
        "translation": "Because of the power of the causes and conditions for cultivating śamatha, he always delights in quiescence and attains the happiness of humans and gods up to the unsurpassed happiness, which is called self-benefit.",
        "source": "T24n1488_004:1053b26_3"
    },
    {
        "source_sentence": "斷諸眾生貪欲、瞋恚、狂癡之心，是名利他。",
        "translation": "To stop sentient beings' minds from craving, anger, and delusion is called benefiting others.",
        "source": "T24n1488_004:1053b27_4"
    },
    {
        "source_sentence": "「智方四者：一者、莊嚴菩提，二者、離對，三者、自利，四者、利他。",
        "translation": "The four directions of knowledge are: 1. adorning enlightenment, 2. freedom from opposition, 3. self-benefiting, and 4. benefiting others.",
        "source": "T24n1488_004:1053b28_5"
    },
    {
        "source_sentence": "莊嚴菩提者，因修智慧獲得初地乃至阿耨多羅三藐三菩提，是名莊嚴。",
        "translation": "Adorned enlightenment is called adorned because it's the result of cultivating wisdom that attains the first ground up to unsurpassed, correct, and complete enlightenment.",
        "source": "T24n1488_004:1053b29_6"
    },
    {
        "source_sentence": "修智慧故，遠離無明，令諸煩惱不得自在，是名離對。",
        "translation": "Because they cultivate wisdom, they're free of ignorance and cause the afflictions to attain mastery, which is called freedom from opposition.",
        "source": "T24n1488_004:1053c02_7"
    },
    {
        "source_sentence": "除煩惱障及智慧障，是名自利。",
        "translation": "Removing the hindrance of affliction and the hindrance of wisdom is called self-benefiting.",
        "source": "T24n1488_004:1053c03_8"
    },
    {
        "source_sentence": "教化眾生令得調伏，是名利他。",
        "translation": "Teaching and transforming sentient beings so they can be disciplined is called benefiting others.",
        "source": "T24n1488_004:1053c04_9"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1053c05_10"
    },
    {
        "source_sentence": "或有說言：離戒無忍，離智無定，是故說有四波羅蜜。",
        "translation": "Some say: Being free from moral precepts, there is no patience. Being free from knowledge, there is no fixed one. That is why it is said to have four perfections.",
        "source": "T24n1488_004:1053c05_11"
    },
    {
        "source_sentence": "若能忍惡不還報者，即名為戒；",
        "translation": "If one can tolerate evil and not repay it back, this is what I call morality.",
        "source": "T24n1488_004:1053c06_12"
    },
    {
        "source_sentence": "若修禪定心不放逸，即是智慧；",
        "translation": "If one cultivates meditation without laxity of mind, that is wisdom.",
        "source": "T24n1488_004:1053c07_13"
    },
    {
        "source_sentence": "是故戒即是忍，慧即是定。",
        "translation": "Therefore, precepts are patience and wisdom is samdhi.",
        "source": "T24n1488_004:1053c07_14"
    },
    {
        "source_sentence": "離慧無定，離定無慧，是故慧即是定，定即是慧。",
        "translation": "Being free from wisdom, there is no concentration; being free from concentration, there is no wisdom. That is why wisdom exactly is concentration and concentration exactly is wisdom.",
        "source": "T24n1488_004:1053c08_15"
    },
    {
        "source_sentence": "離戒無進，離進無戒，是故戒即精進，精進即戒。",
        "translation": "Being free of precepts, there's no advancement, and being free of advancement, there's no precept. That's why precepts are called effort, and effort is the precepts.",
        "source": "T24n1488_004:1053c09_16"
    },
    {
        "source_sentence": "離施無進，離進無施，是故施即精進，精進即施。",
        "translation": "Free from giving, there is no effort; free from effort, there is no giving. That is why giving exactly is zeal and zeal exactly is giving.",
        "source": "T24n1488_004:1053c10_17"
    },
    {
        "source_sentence": "故知無有六波羅蜜者。",
        "translation": "Therefore, it's known that there are no six perfections.",
        "source": "T24n1488_004:1053c11_18"
    },
    {
        "source_sentence": "是義不然！",
        "translation": "That doesn't make sense!",
        "source": "T24n1488_004:1053c12_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1053c12_20"
    },
    {
        "source_sentence": "智慧是因，布施是果；",
        "translation": "Wisdom is the cause, while generosity is the effect.",
        "source": "T24n1488_004:1053c12_21"
    },
    {
        "source_sentence": "精進是因，持戒是果；",
        "translation": "Diligence is the cause; observance of precepts is the effect.",
        "source": "T24n1488_004:1053c13_22"
    },
    {
        "source_sentence": "三昧是因，忍辱是果。",
        "translation": "Samādhi is the cause, and forbearance is the result.",
        "source": "T24n1488_004:1053c13_23"
    },
    {
        "source_sentence": "然因與果，不得為一，是故應有六波羅蜜。",
        "translation": "However, the cause and the result cannot be one and the same: that is why there should be six perfections.",
        "source": "T24n1488_004:1053c14_24"
    },
    {
        "source_sentence": "若有說言：戒即是忍，忍即是戒。",
        "translation": "If someone says, 'Prajñā is patience, and forbearance is morality.'",
        "source": "T24n1488_004:1053c15_25"
    },
    {
        "source_sentence": "是義不然！",
        "translation": "That doesn't make sense!",
        "source": "T24n1488_004:1053c15_26"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1053c16_27"
    },
    {
        "source_sentence": "戒從他得，忍不如是；",
        "translation": "The precepts are obtained from others, but the tolerance is not like this.",
        "source": "T24n1488_004:1053c16_28"
    },
    {
        "source_sentence": "有不受戒而能忍惡，為眾修善忍無數苦，無量世中代諸眾生受大苦惱，心不悔退，是故離戒應有忍辱。",
        "translation": "If someone who doesn't accept the precepts and can tolerate badness, cultivates good forbearance for sentient beings to endure countless painful sufferings, and in measureless worlds, sentient beings experience great suffering and distress on their behalf without regret or retrogression in their minds, then there should be forbearance when they part with the precepts.",
        "source": "T24n1488_004:1053c16_29"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1053c19_30"
    },
    {
        "source_sentence": "三昧即是舍摩他也，智慧即是毘婆舍那；",
        "translation": "Samādhi is the other characteristic of sramana, and wisdom is vipaśyanā.",
        "source": "T24n1488_004:1053c19_31"
    },
    {
        "source_sentence": "舍摩他名緣一不亂，毘婆舍那名能分別；",
        "translation": "The name śamatha has one supporting object and is not disturbed; the name vipaśyanā discerns.",
        "source": "T24n1488_004:1053c20_32"
    },
    {
        "source_sentence": "是故我於十二部經說定、慧異，當知定有六波羅蜜。",
        "translation": "Consequently, the twelvefold scriptural texts I teach that there is a difference between meditative absorption and wisdom. You should know that there are six transcendent ways of concentration.",
        "source": "T24n1488_004:1053c21_33"
    },
    {
        "source_sentence": "如來所以最初先說檀波羅蜜，為調眾生。",
        "translation": "That's why the Tathāgata first explained the perfection of giving in order to tame sentient beings.",
        "source": "T24n1488_004:1053c22_34"
    },
    {
        "source_sentence": "施時離貪，是故次說尸波羅蜜。",
        "translation": "Being free of craving at the time of giving, it's therefore explained next as the perfection of morality.",
        "source": "T24n1488_004:1053c23_35"
    },
    {
        "source_sentence": "施時能忍捨離之心，是故次說忍波羅蜜。",
        "translation": "When giving, he's able to tolerate the mind of equanimity, so he explains the perfection of forbearance next.",
        "source": "T24n1488_004:1053c24_36"
    },
    {
        "source_sentence": "施時心樂，不觀時節，是故次說進波羅蜜。",
        "translation": "The mind is satisfaction at the moment of giving: because it does not observe the seasons. That is why the perfection of effort is spoken of in succession.",
        "source": "T24n1488_004:1053c25_0"
    },
    {
        "source_sentence": "施時心一，無有亂相，是故次說定波羅蜜。",
        "translation": "The mind at the moment of giving is one: because there is no distraction. That is why it is said to be the perfection of meditative absorption next.",
        "source": "T24n1488_004:1053c25_1"
    },
    {
        "source_sentence": "施時不為受生死樂，是故次說智波羅蜜。",
        "translation": "When giving, it's not for the pleasure of birth-and-death; therefore, it's next explained as the perfection of wisdom.",
        "source": "T24n1488_004:1053c26_2"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1053c27_3"
    },
    {
        "source_sentence": "云何名為波羅蜜耶？",
        "translation": "What's called the perfection?",
        "source": "T24n1488_004:1053c28_4"
    },
    {
        "source_sentence": "施時不求內外果報，不觀福田及非福田，施一切財，心不悋惜，不擇時節，是故名為施波羅蜜。",
        "translation": "When they give, they don't seek internal and external rewards, don't contemplate what's a field of merit or what's not a field of merit, give all their possessions, don't cherish them in mind, and don't discriminate time and season; this is therefore called the perfection of giving.",
        "source": "T24n1488_004:1053c28_5"
    },
    {
        "source_sentence": "乃至小罪，雖為身命尚不毀犯，是故名為戒波羅蜜。",
        "translation": "Even minor offenses are still not violated even for the sake of body and life, so they're called the perfection of morality.",
        "source": "T24n1488_004:1054a01_6"
    },
    {
        "source_sentence": "乃至惡人來割其身，忍而不瞋，是故名為忍波羅蜜。",
        "translation": "Even when bad people come to cut their bodies, they tolerate and aren't angry, which is therefore called the perfection of forbearance.",
        "source": "T24n1488_004:1054a02_7"
    },
    {
        "source_sentence": "三月之中一偈讚佛，不休不息，是故名為進波羅蜜。",
        "translation": "In the course of three months, one verse praises the Buddha without ceasing or stopping, which is therefore called the perfection of advancement.",
        "source": "T24n1488_004:1054a03_8"
    },
    {
        "source_sentence": "具足獲得金剛三昧，是故名為禪波羅蜜。",
        "translation": "To fully attain the adamantine samādhi is therefore called the perfection of meditation.",
        "source": "T24n1488_004:1054a05_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1054a06_10"
    },
    {
        "source_sentence": "得阿耨多羅三藐三菩提時，具足成就六波羅蜜，是故名為智波羅蜜。",
        "translation": "When he attains supreme perfect enlightenment, he fully accomplishes the six perfections, which is therefore called the perfection of wisdom.",
        "source": "T24n1488_004:1054a06_11"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1054a07_12"
    },
    {
        "source_sentence": "菩薩有二：一者、在家，二者、出家。",
        "translation": "There are two kinds of bodhisattvas: 1. those who remain householders and 2. those who leave home.",
        "source": "T24n1488_004:1054a08_0"
    },
    {
        "source_sentence": "出家能淨六波羅蜜，是不為難；",
        "translation": "It is no difficulty for a renunciant to be able to purify the six transcendent ways.",
        "source": "T24n1488_004:1054a08_1"
    },
    {
        "source_sentence": "在家能淨，是乃為難。",
        "translation": "To be able to purify it at home is a difficulty.",
        "source": "T24n1488_004:1054a09_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1054a09_3"
    },
    {
        "source_sentence": "在家之人多惡因緣所纏繞故。」",
        "translation": "It's because laypeople are often tethered by bad causes and conditions.",
        "source": "T24n1488_004:1054a10_4"
    },
    {
        "source_sentence": "優婆塞戒經雜品第十九",
        "translation": "Upāsaka Precepts Sutra, Miscellaneous Chapter 19",
        "source": "T24n1488_004:1054a11_0"
    },
    {
        "source_sentence": "善生言：「世尊！",
        "translation": "Sunetra said, Bhagavān!",
        "source": "T24n1488_004:1054a12_0"
    },
    {
        "source_sentence": "菩薩已修六波羅蜜，能為眾生作何等事？」",
        "translation": "What can a bodhisattva do for sentient beings after cultivating the six perfections?",
        "source": "T24n1488_004:1054a12_1"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1054a13_2"
    },
    {
        "source_sentence": "如是菩薩能拔沈沒苦海眾生。",
        "translation": "Thus, the bodhisattva can rescue sentient beings who are submerged in the ocean of suffering.",
        "source": "T24n1488_004:1054a13_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1054a14_4"
    },
    {
        "source_sentence": "若有於財法食生慳，當知是人於無量世得癡貧報，是故菩薩修行布施波羅蜜時，要作自利及利益他。",
        "translation": "If someone becomes stingy with their possessions and food, you should know that they'll attain the reward of delusion and poverty for an immeasurable number of years. Therefore, when a bodhisattva cultivates the perfection of generosity, he or she must do so for self-benefiting and benefiting others.",
        "source": "T24n1488_004:1054a14_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1054a16_6"
    },
    {
        "source_sentence": "若人樂施，一切怨讎悉生親想，不自在者皆得自在。",
        "translation": "If someone enjoys generosity, all enemies and resentments will all give rise to feelings of intimacy, and those who aren't self-contained will attain mastery.",
        "source": "T24n1488_004:1054a16_7"
    },
    {
        "source_sentence": "信施因果，信戒因果，是人則得成就施果。",
        "translation": "A person who believes in the cause and effect of generosity and believes in the cause and effect of morality will attain the fruit of generosity.",
        "source": "T24n1488_004:1054a18_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1054a18_1"
    },
    {
        "source_sentence": "有人說言：施即是意。",
        "translation": "Some people say: Giving is manas.",
        "source": "T24n1488_004:1054a19_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1488_004:1054a19_3"
    },
    {
        "source_sentence": "意是施根故。",
        "translation": "It's because the mind is the faculty of giving.",
        "source": "T24n1488_004:1054a19_4"
    },
    {
        "source_sentence": "是義不然！",
        "translation": "That doesn't make sense!",
        "source": "T24n1488_004:1054a20_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1054a20_6"
    },
    {
        "source_sentence": "施即五陰。",
        "translation": "Giving is the five aggregates.",
        "source": "T24n1488_004:1054a20_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1488_004:1054a20_8"
    },
    {
        "source_sentence": "由身、口、意具足施故。",
        "translation": "It's because the body, speech, and mind are replete with generosity.",
        "source": "T24n1488_004:1054a21_9"
    },
    {
        "source_sentence": "布施若為自利他利及自他利，則具五陰，如是布施，即能莊嚴菩提之道。",
        "translation": "If generosity is for self-benefiting, other-benefiting, and self-benefiting, then it's endowed with the five aggregates, and such generosity can adorn the path to enlightenment.",
        "source": "T24n1488_004:1054a21_10"
    },
    {
        "source_sentence": "遠離煩惱，多財巨富，名施正果；",
        "translation": "Being free from afflictions and abundant in possessions and greatly wealthy is called the right fruit of giving.",
        "source": "T24n1488_004:1054a23_11"
    },
    {
        "source_sentence": "壽命、色、力、安樂、辯才，名施餘果。",
        "translation": "The other fruits of giving are life, form, power, peace and bliss, and eloquence.",
        "source": "T24n1488_004:1054a23_12"
    },
    {
        "source_sentence": "施果三種：有勝財故獲得勝果，有田勝故獲得勝果，施主勝故獲得勝果。",
        "translation": "There are three kinds of fruits of donation: the acquisition of a superior fruit because of having superior possessions; the acquisition of a superior fruit because of having a superior field; and the acquisition of a superior fruit because of the superiority of the donor.",
        "source": "T24n1488_004:1054a24_13"
    },
    {
        "source_sentence": "向須陀洹至後身菩薩乃至成佛，是名勝田，施如是田，故得勝果。",
        "translation": "A bodhisattva who's headed toward stream entry until the latter body or becomes a buddha is called a superior field, and giving such a field will therefore attain a superior result.",
        "source": "T24n1488_004:1054a26_14"
    },
    {
        "source_sentence": "若有施物，具足妙好色、香、味、觸，是名財勝，以是物施，故得勝果。",
        "translation": "If someone gives a gift that's endowed with marvelous form, odor, taste, and touch, this is called the superiority of possessions, and it's because they give these things that they attain their superior result.",
        "source": "T24n1488_004:1054a27_15"
    },
    {
        "source_sentence": "若有施主信心淳濃，施、戒、聞、慧，則得勝果。",
        "translation": "If the donor’s faith is pure and genuine, then generosity, morality, learning, and wisdom will attain a superior result.",
        "source": "T24n1488_004:1054a29_16"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1054b01_17"
    },
    {
        "source_sentence": "有智之人，施有五種：一者、至心施，二者、自手施，三者、信心施，四者、時節施，五者、如法求物施。",
        "translation": "There are five kinds of generosity for wise people: 1. giving with sincerity, 2. giving with one's own hands, 3. giving with faith, 4. giving at the right time and place, and 5. giving seeking things according to the teaching.",
        "source": "T24n1488_004:1054b01_18"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1054b03_19"
    },
    {
        "source_sentence": "至心施者，得何等果？",
        "translation": "What's the result of giving with sincerity?",
        "source": "T24n1488_004:1054b03_20"
    },
    {
        "source_sentence": "若至心施者，是人則得多財饒寶，金銀、琉璃、車渠、馬瑙、真珠、珊瑚，象、馬、牛、羊，田、宅、奴、婢，多饒眷屬，至心施者，得如是果。",
        "translation": "If someone gives with sincerity, they'll attain a great deal of possessions and treasures, such as gold, silver, lapis lazuli, chariots, agate, genuine pearls, coral, elephants, horses, cattle, sheep, fields, homes, slaves, and maidservants, and many members of their retinues, and those who give with sincerity will attain such",
        "source": "T24n1488_004:1054b04_21"
    },
    {
        "source_sentence": "自手施者，得何等果？",
        "translation": "What's the result of giving with one's own hand?",
        "source": "T24n1488_004:1054b06_22"
    },
    {
        "source_sentence": "自手施已，所得果報，如上所說，得已能用，自手施者得如是報。",
        "translation": "The fruit of giving with one’s own hand is as has been said above: after acquiring it, one can use it. Giving with one’s own hand acquires such a fruit.",
        "source": "T24n1488_004:1054b07_23"
    },
    {
        "source_sentence": "信心施者，得何等果？",
        "translation": "What's the result of giving with faith?",
        "source": "T24n1488_004:1054b08_24"
    },
    {
        "source_sentence": "信心施已，所得果報，如上所說，常為父母、兄弟、宗親、一切眾生之所愛念，信心施者，加如是報。",
        "translation": "The fruit of giving with faith is as has been said above: always beloved by parents, brothers, sisters, relatives and all living beings. Giving with faith is the added retribution in this way.",
        "source": "T24n1488_004:1054b09_25"
    },
    {
        "source_sentence": "時節施者得何等果？",
        "translation": "What's the result of giving from time to time?",
        "source": "T24n1488_004:1054b11_26"
    },
    {
        "source_sentence": "時節施者所得果報，如上所說，所須之物隨時而得，時節施者，兼如是果。",
        "translation": "The fruit of occasional donation is as has been said above: the things that are needed are acquired at any moment.",
        "source": "T24n1488_004:1054b11_27"
    },
    {
        "source_sentence": "如法財施，得何等果？",
        "translation": "What's the result of giving according to the wealth of the Dharma?",
        "source": "T24n1488_004:1054b13_28"
    },
    {
        "source_sentence": "如法財施所得果報，如先所說，得是財已，王、賊、水、火所不能侵。",
        "translation": "The reward of giving the Dharma treasure is as has been said previously. Having obtained this treasure, kings, thieves, water and fire cannot attack it.",
        "source": "T24n1488_004:1054b14_29"
    },
    {
        "source_sentence": "「若好色施，以是因緣，是人獲得微妙上色。",
        "translation": "“If someone gives with good form, it’s because of these causes and conditions that they attain subtle and superior form.",
        "source": "T24n1488_004:1054b15_30"
    },
    {
        "source_sentence": "若以香施，是人因是名稱遠聞。",
        "translation": "If someone gives incense, that person's name will be heard far and wide because of it.",
        "source": "T24n1488_004:1054b16_31"
    },
    {
        "source_sentence": "若以味施，是人因是眾樂見聞，既見聞已生愛重心。",
        "translation": "If someone gives it with taste, they'll be delighted to see and hear because of these things, and after seeing and hearing them, they'll become attached to them.",
        "source": "T24n1488_004:1054b17_32"
    },
    {
        "source_sentence": "若好觸施，是人因是得上妙觸；",
        "translation": "If someone is fond of giving by means of tangible things, it is because of this that they attain the highest form of subtle touch.",
        "source": "T24n1488_004:1054b18_33"
    },
    {
        "source_sentence": "受者受已，則能獲得壽命、色、力、安樂、辯才。",
        "translation": "Those who accept it and receive it will then be able to attain longevity, form, strength, well-being, and eloquence.",
        "source": "T24n1488_004:1054b19_34"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1054b20_0"
    },
    {
        "source_sentence": "有人說言：施於塔、像，不得壽命、色、力、安、辯，無受者故。",
        "translation": "Some people say that giving to a stūpa or an image doesn't obtain life, form, strength, peace, and eloquence because there's no recipient.",
        "source": "T24n1488_004:1054b20_1"
    },
    {
        "source_sentence": "是義不然！",
        "translation": "That doesn't make sense!",
        "source": "T24n1488_004:1054b21_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1054b21_3"
    },
    {
        "source_sentence": "有信心故，施主信心而行布施，是故應得如是五報。",
        "translation": "Because of faith, the donor's faith and generosity are practiced; therefore, these five rewards should be obtained.",
        "source": "T24n1488_004:1054b21_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1054b23_5"
    },
    {
        "source_sentence": "譬如比丘修集慈心，如是慈心實無受者，而亦獲得無量果報。",
        "translation": "It's like a monk who cultivates the mind of kindness, such a mind of kindness that really has no recipient and yet attains measureless rewards.",
        "source": "T24n1488_004:1054b23_6"
    },
    {
        "source_sentence": "施塔、像等亦應如是，得五果報。",
        "translation": "Giving to a stūpa or an image should also be like this, which will attain the five fruits.",
        "source": "T24n1488_004:1054b24_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1054b25_8"
    },
    {
        "source_sentence": "如人種穀，終不生苽，施於塔、像，亦復如是；",
        "translation": "Good man, it is like someone planting grain but never giving it to a stūpa or an apparitional image.",
        "source": "T24n1488_004:1054b25_9"
    },
    {
        "source_sentence": "以福田故，得種種果。",
        "translation": "Because it's a field of merit, they attain various fruits.",
        "source": "T24n1488_004:1054b26_10"
    },
    {
        "source_sentence": "是故我說田得果報，物得果報，主得果報。",
        "translation": "That is why I say that the field acquires its fruit. The goods acquire their fruit and the owner acquires their fruit.",
        "source": "T24n1488_004:1054b27_11"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1054b28_12"
    },
    {
        "source_sentence": "施有二種：一者、法施，二者、財施。",
        "translation": "There are two kinds of giving: 1. giving the Dharma and 2. giving financially.",
        "source": "T24n1488_004:1054b28_13"
    },
    {
        "source_sentence": "法施則得財、法二報，財施唯還得財寶報。",
        "translation": "A gift of the Dharma obtains possessions and a gift of the Dharma have two rewards, whereas a gift of possessions only has the reward of possessions and treasures.",
        "source": "T24n1488_004:1054b29_0"
    },
    {
        "source_sentence": "菩薩修行如是二施，為二事故：一、令眾生遠離苦惱，二、令眾生心得調伏。",
        "translation": "The bodhisattva cultivates these two kinds of giving for two reasons: 1. to cause sentient beings to be freed from suffering and distress, and 2. to cause sentient beings to be disciplined in their minds.",
        "source": "T24n1488_004:1054b29_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1054c02_2"
    },
    {
        "source_sentence": "復有三施：一、以法施，二、無畏施，三、財物施。",
        "translation": "Again, there are three kinds of giving: 1. giving with the Dharma, 2. giving without fear, and 3. giving with possessions.",
        "source": "T24n1488_004:1054c02_3"
    },
    {
        "source_sentence": "以法施者，教他受戒、出家、修道、白四羯磨，為壞邪見說於正法，能分別說實非實等，宣說四倒及不放逸，是名法施。",
        "translation": "Giving the Dharma by teaching others to receive the precepts, leave home, cultivate and explain the four karmas, teach the right teaching for the sake of destroying wrong views, discerning what's true and what's not true, and proclaiming the four errors and nonfrivolity are called giving the Dharma.",
        "source": "T24n1488_004:1054c03_4"
    },
    {
        "source_sentence": "若有眾生怖畏王者、師子、虎、狼、水、火、盜賊，菩薩見已，能為救濟，名無畏施。",
        "translation": "If there are sentient beings fearful of kings, lions, tigers, wolves, water, fire, thieves, and thieves, the bodhisattva sees them and can rescue them, which is called fearless giving.",
        "source": "T24n1488_004:1054c06_5"
    },
    {
        "source_sentence": "自於財寶破慳不悋，若好若醜，若多若少，牛、羊、象、馬，房舍、臥具、樹林、泉井，奴婢、僕使，水牛、駝驢，車乘、輦輿，瓶瓮、釜鑊，繩床、坐具，銅鐵、瓦器，衣服、瓔珞，燈明、香、花，扇、蓋、帽、履，机杖、繩索，犁、鎒、斧、鑿，草、木、水、石，如是等物，稱求者意，隨所須與，是名財施。",
        "translation": "They themselves are not stingy or stingy with regard to property, whether good or bad, abundant or scarce, cattle, sheep, elephants, horses, dwellings, bedding, trees, forests, springs, slaves, servants, water buffaloes, camels, mules, chariots, carriages, palanquins, potted vessels, kettles,",
        "source": "T24n1488_004:1054c08_6"
    },
    {
        "source_sentence": "若起僧坊及起別房，如上施與出家之人，唯除象、馬。",
        "translation": "If he builds a monastic hall or another room, give it to someone who leaves home as above, except for elephants and horses.",
        "source": "T24n1488_004:1054c13_7"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1054c14_8"
    },
    {
        "source_sentence": "施有四累：一、慳貪心，二、不修施，三、輕小物，四、求世報。",
        "translation": "Giving has four hindrances: 1. the mind of stinginess and greed, 2. not cultivating generosity, 3. despising small things, and 4. seeking worldly rewards.",
        "source": "T24n1488_004:1054c14_9"
    },
    {
        "source_sentence": "如是四累，二法能壞：一、修無我，二、修無常。",
        "translation": "Thus, these four kinds of fetters can be broken by two things: 1. cultivating selflessness and 2. cultivating impermanence.",
        "source": "T24n1488_004:1054c16_10"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1054c17_11"
    },
    {
        "source_sentence": "若欲樂施，當破五事：一者、瞋心，二者、慳心，三者、妬心，四者、惜身命，五者、不信因果；",
        "translation": "If you want to enjoy giving, you should dispel five things: 1. anger; 2. stinginess; 3. jealousy; 4. cherishing one’s life; and 5. not believing in the law of cause and effect.",
        "source": "T24n1488_004:1054c17_12"
    },
    {
        "source_sentence": "破是五事，常樂布施。",
        "translation": "To refute these five things, they always delight in generosity.",
        "source": "T24n1488_004:1054c19_13"
    },
    {
        "source_sentence": "樂施之人，獲得五事：一者、終不遠離一切聖人，二者、一切眾生樂見、樂聞，三者、入大眾時不生怖畏，四者、得好名稱，五者、莊嚴菩提。",
        "translation": "Those who delight in generosity will attain five things: 1. never being separated from all the noble people; 2. that all sentient beings are happy to see and hear; 3. not becoming frightened when they enter the masses; 4. gaining good reputation; and 5. adorning enlightenment.",
        "source": "T24n1488_004:1054c19_14"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1054c22_15"
    },
    {
        "source_sentence": "菩薩之人名一切施，云何名為一切施也？",
        "translation": "A bodhisattva's person is called all-giving, so what are they called all-giving?",
        "source": "T24n1488_004:1054c22_16"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1054c23_17"
    },
    {
        "source_sentence": "菩薩摩訶薩如法求物，持以布施，名一切施；",
        "translation": "“Great enlightening beings who seek things in accordance with the Teaching and keep them as gifts are called giving everything.",
        "source": "T24n1488_004:1054c24_18"
    },
    {
        "source_sentence": "恒以淨心施於受者，名一切施；",
        "translation": "Giving always with a pure mind to those who receive is called giving everything.",
        "source": "T24n1488_004:1054c25_19"
    },
    {
        "source_sentence": "少物能施，名一切施；",
        "translation": "Giving to a limited number of things is called giving everything.",
        "source": "T24n1488_004:1054c25_20"
    },
    {
        "source_sentence": "所愛之物，破慳能捨，名一切施；",
        "translation": "The things that one loves, which dispels stinginess and is able to relinquish them, are called giving everything.",
        "source": "T24n1488_004:1054c26_21"
    },
    {
        "source_sentence": "施不求報，名一切施；",
        "translation": "Giving without seeking reward is called giving of everything.",
        "source": "T24n1488_004:1054c27_0"
    },
    {
        "source_sentence": "施時不觀田以非田，名一切施；",
        "translation": "When giving, one does not contemplate a field because it is not a field. This is called ‘giving of everything’.",
        "source": "T24n1488_004:1054c27_1"
    },
    {
        "source_sentence": "怨親等施，名一切施。",
        "translation": "Giving to enemies, relatives, etc., is called all-giving.",
        "source": "T24n1488_004:1054c28_2"
    },
    {
        "source_sentence": "菩薩施財，凡有二種：一者、眾生，二者、非眾生，於是二中乃至自身都不悋惜，名一切施；",
        "translation": "There are two kinds of enlightening beings’ gifts of goods: first, to sentient beings; second, not to sentient beings—they do not cherish any of these two or even their own possessions—and they are called giving everything.",
        "source": "T24n1488_004:1054c28_3"
    },
    {
        "source_sentence": "菩薩布施，由憐愍心，名一切施；",
        "translation": "Enlightening beings’ generosity is called giving everything because of their compassion.",
        "source": "T24n1488_004:1055a01_4"
    },
    {
        "source_sentence": "欲施、施時、施已不悔，名一切施。",
        "translation": "Giving with desire, giving at the time of giving, and not repenting after giving is called all-giving.",
        "source": "T24n1488_004:1055a02_5"
    },
    {
        "source_sentence": "或時設以不淨物施，為令前人生喜心故。",
        "translation": "Sometimes he gives an impure thing to someone in order to cause them to give it to him or her with joy.",
        "source": "T24n1488_004:1055a03_6"
    },
    {
        "source_sentence": "酒、毒、刀、杖、枷鎖等物，若得自在、若不自在，終不以施；",
        "translation": "If they obtain mastery over such things as wine, poison, swords, canes, sticks, fetters, etc., or if they do not, they will never give them away.",
        "source": "T24n1488_004:1055a04_7"
    },
    {
        "source_sentence": "不施病人不淨食藥；",
        "translation": "They do not give medicine to the sick and impure food.",
        "source": "T24n1488_004:1055a05_8"
    },
    {
        "source_sentence": "不劫他物乃至一錢持以布施。",
        "translation": "He doesn't steal another's property or even a coin to give it as a gift.",
        "source": "T24n1488_004:1055a05_9"
    },
    {
        "source_sentence": "菩薩施時雖得自在，終不罵打令諸僕使生瞋苦惱。",
        "translation": "Although the bodhisattva attains mastery when he gives alms, he never scolds or beats his servants and causes them to become angry and pained.",
        "source": "T24n1488_004:1055a06_10"
    },
    {
        "source_sentence": "如法財施，不求現在後世果報。",
        "translation": "It's like giving the wealth of the Dharma that doesn't seek rewards in the present or future lives.",
        "source": "T24n1488_004:1055a07_11"
    },
    {
        "source_sentence": "施已常觀煩惱罪過，深觀涅槃功德微妙，除菩提已更無所求。",
        "translation": "After giving, he always observes the sins of affliction and deeply observes the subtlety of the merits of nirvāṇa, and after attaining enlightenment, he doesn't seek anything more.",
        "source": "T24n1488_004:1055a08_12"
    },
    {
        "source_sentence": "施貧窮時，起悲愍心；",
        "translation": "When they give to the poor, they develop compassion and pity.",
        "source": "T24n1488_004:1055a09_13"
    },
    {
        "source_sentence": "施福田時，生喜敬心；",
        "translation": "When they give to the field of blessings, they become joyful and respectful.",
        "source": "T24n1488_004:1055a10_14"
    },
    {
        "source_sentence": "施親友時，不生放捨心。",
        "translation": "When they give to their friends and relatives, they don't give with a mind of indifference.",
        "source": "T24n1488_004:1055a10_15"
    },
    {
        "source_sentence": "若見乞者，則知所須隨相給與，不令發言。",
        "translation": "If they see a beggar, then they'll know what they need and give it to him or her accordingly, not letting him or her say anything.",
        "source": "T24n1488_004:1055a11_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1055a12_17"
    },
    {
        "source_sentence": "不待求施，得無量果。",
        "translation": "They don't need to seek generosity, and they attain measureless results.",
        "source": "T24n1488_004:1055a12_18"
    },
    {
        "source_sentence": "「◎善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1055a13_0"
    },
    {
        "source_sentence": "施主有三：謂下、中、上。",
        "translation": "There are three kinds of donors: inferior, middle and superior.",
        "source": "T24n1488_004:1055a13_1"
    },
    {
        "source_sentence": "不信業果，深著慳悋，恐財有盡，見來求者生瞋礙想，是名為下。",
        "translation": "They don't believe in the results of their actions, are deeply attached to stinginess, fear that their possessions will run out, and become angry at those who come to ask for them, which is called inferior.",
        "source": "T24n1488_004:1055a13_2"
    },
    {
        "source_sentence": "雖信業果，於財生慳，恐有空竭，見來求者生於捨心，是名為中。",
        "translation": "Even though he believes in the results of actions, he becomes stingy with possessions and fears emptiness, and when he sees people who come to ask for them, he gives rise to a mind of equanimity, which is called middle.",
        "source": "T24n1488_004:1055a15_3"
    },
    {
        "source_sentence": "深信業果，於財物所不生慳悋，觀諸財物是無常想，見來求者，有與則喜、無與則惱，以身[貝*致]物而用與之，是名為上。",
        "translation": "Being deeply convinced of the fruit of karma, they don't become stingy with property, observe that property is impermanent and perceives those who come to ask for it, rejoice when they give it and anger when they don't give it, and give it as a body [pudgala*citation].",
        "source": "T24n1488_004:1055a16_4"
    },
    {
        "source_sentence": "復有下者，見來求者，[卑*頁]面不看，惡罵毀辱。",
        "translation": "Again, there's the next person who sees someone coming to ask for it, doesn't look at their [lower*page] face and speaks harshly and disparagingly.",
        "source": "T24n1488_004:1055a19_5"
    },
    {
        "source_sentence": "復有中者，雖復施與，輕賤不敬。",
        "translation": "Again, there are those in the middle who, even though they give alms, despise and disrespect them.",
        "source": "T24n1488_004:1055a20_6"
    },
    {
        "source_sentence": "復有上者，未求便施，敬心而與。",
        "translation": "Again, there's another superior person who gives without asking and gives with respect.",
        "source": "T24n1488_004:1055a21_7"
    },
    {
        "source_sentence": "復有下者，為現報施；",
        "translation": "The next one is a donation for the sake of present retribution.",
        "source": "T24n1488_004:1055a21_8"
    },
    {
        "source_sentence": "復有中者，為後報施；",
        "translation": "Again, there is another middle one: giving for the sake of later retribution.",
        "source": "T24n1488_004:1055a22_9"
    },
    {
        "source_sentence": "復有上者，憐愍故施。",
        "translation": "Again, there's the higher one who gives because of pity.",
        "source": "T24n1488_004:1055a22_10"
    },
    {
        "source_sentence": "復有下者，為報恩施；",
        "translation": "There are also inferior ones who give in order to repay kindness.",
        "source": "T24n1488_004:1055a23_11"
    },
    {
        "source_sentence": "復有中者，為業故施；",
        "translation": "“Furthermore, there is another middle one: giving because of action.",
        "source": "T24n1488_004:1055a23_12"
    },
    {
        "source_sentence": "復有上者，為法藏施。",
        "translation": "Again, there's the higher one who gives as a gift for the Dharma store.",
        "source": "T24n1488_004:1055a24_13"
    },
    {
        "source_sentence": "復有下者，畏勝故施；",
        "translation": "“Furthermore, there is another inferior one: giving because of fear for the superior.",
        "source": "T24n1488_004:1055a24_14"
    },
    {
        "source_sentence": "復有中者，等己故施；",
        "translation": "“Furthermore, there is another middle one: giving because it is equal to oneself.",
        "source": "T24n1488_004:1055a25_15"
    },
    {
        "source_sentence": "復有上者，不擇怨親。",
        "translation": "Again, there's the higher one who doesn't choose enemies and relatives.",
        "source": "T24n1488_004:1055a25_16"
    },
    {
        "source_sentence": "又復下者，有財言無；",
        "translation": "Again, the following is a metaphor for having possessions but not saying that they are nonexistent.",
        "source": "T24n1488_004:1055a26_17"
    },
    {
        "source_sentence": "又復中者，多財言少；",
        "translation": "Again, those in the middle have a lot of wealth but say little.",
        "source": "T24n1488_004:1055a26_18"
    },
    {
        "source_sentence": "又復上者，少索多與。",
        "translation": "Again, the higher one asks for a little and gives it to many.",
        "source": "T24n1488_004:1055a27_19"
    },
    {
        "source_sentence": "施者無財，亦復三種：最下之人，見來求者，惡心瞋責；",
        "translation": "The donor is without property. There are also three more kinds: the lowest, when seeing someone who comes to ask for something, feels angry and resentful.",
        "source": "T24n1488_004:1055a27_20"
    },
    {
        "source_sentence": "中品之人，見來求者，直言無物；",
        "translation": "People of middle class, seeing those who come to ask for almsfood, simply say nothing.",
        "source": "T24n1488_004:1055a28_21"
    },
    {
        "source_sentence": "上品之人，見來求者，自鄙無物，心生愁惱。",
        "translation": "People of a higher caste see those who come to ask for alms, despise themselves as nothing but things, and become sad at heart.",
        "source": "T24n1488_004:1055a29_22"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1055b01_23"
    },
    {
        "source_sentence": "又復下者，常為聖賢之所呵責；",
        "translation": "Further downward, they are always blamed by the saints and wise.",
        "source": "T24n1488_004:1055b01_24"
    },
    {
        "source_sentence": "又復中者，常為賢聖之所憐愍；",
        "translation": "Again, the middle is always pitied by the wise and saintly.",
        "source": "T24n1488_004:1055b02_25"
    },
    {
        "source_sentence": "又復上者，賢聖見已心生歡喜。",
        "translation": "Furthermore, above that, when the good and noble people see it, their minds become joyous.",
        "source": "T24n1488_004:1055b03_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1055b03_1"
    },
    {
        "source_sentence": "智人行施，為自他利，知財寶物是無常故，為令眾生生喜心故，為憐愍故，為壞慳故，為不求索後果報故，為欲莊嚴菩提道故。",
        "translation": "A wise person's practice of generosity is for the benefit of self and others because they know that possessions are impermanent, for the sake of causing sentient beings to become joyous, for the sake of pity, for the sake of destroying stinginess, for the sake of not seeking subsequent rewards, and for the sake of wanting to adorn the path of enlightenment.",
        "source": "T24n1488_004:1055b03_2"
    },
    {
        "source_sentence": "是故菩薩一切施已，不生悔心，不慮財盡，不輕財物，不輕自身，不觀時節，不觀求者，常念乞者如飢思食。",
        "translation": "Therefore, after giving everything, the bodhisattva doesn't become remorseful, doesn't worry about exhaustion of possessions, doesn't despise possessions, doesn't despise himself, doesn't look at seasons and seasons, doesn't look to those who ask, and always thinks of beggars as hungry and thinking about food.",
        "source": "T24n1488_004:1055b06_3"
    },
    {
        "source_sentence": "親近善友，諮受正教，見來求者，心生歡喜，如失火家得出財物，歡喜讚歎，說財多過。",
        "translation": "Being intimate with good friends and advising them on the right teaching, they become joyous when they see those who come to ask for it. Like a man who loses his property in a burning house and obtains it, they rejoice and praise him, saying that he has plenty of possessions.",
        "source": "T24n1488_004:1055b09_4"
    },
    {
        "source_sentence": "施已生喜，如寄善人；",
        "translation": "The joy that arises from giving is like sending something to a good person.",
        "source": "T24n1488_004:1055b11_0"
    },
    {
        "source_sentence": "復語乞者：『汝今真是我功德因！",
        "translation": "Again, he said to the beggar, 'Now, you are really the cause of my merit!'",
        "source": "T24n1488_004:1055b11_1"
    },
    {
        "source_sentence": "我今遠離慳貪之心，皆由於汝來乞因緣。』",
        "translation": "Now, I'm far removed from the mind of stinginess and greed because of the causes and conditions for your request.'",
        "source": "T24n1488_004:1055b12_2"
    },
    {
        "source_sentence": "即於求者生親愛心。",
        "translation": "That is, they give rise to a feeling of affection for those who seek.",
        "source": "T24n1488_004:1055b13_3"
    },
    {
        "source_sentence": "既施與已，復教乞者如法守護，勤修供養佛、法、僧寶。",
        "translation": "After giving it away, he also teaches the beggar to guard it according to the teaching and diligently cultivates offerings to the treasures of the Buddha, Dharma, and Saṃgha.",
        "source": "T24n1488_004:1055b13_4"
    },
    {
        "source_sentence": "菩薩如是樂行施已，則得遠離一切放逸，雖以身分施於乞者，終不生於一念惡心，因是更增慈、悲、喜、捨。",
        "translation": "A bodhisattva who thus happily practices generosity in this way will then be freed from all kinds of carelessness, and even though he gives to a beggar with his identity, he doesn't give it to him or her with a single thought of evil, which increases his kindness, pity, joy, or equanimity.",
        "source": "T24n1488_004:1055b14_5"
    },
    {
        "source_sentence": "不輕受者，亦不自高，自慶有財稱求者意，增長信心，不疑業果。",
        "translation": "He who doesn't despise those who receive it and doesn't elevate himself, rejoices in the intention of those who have possessions and praise them, increases faith, and doesn't doubt the results of actions.",
        "source": "T24n1488_004:1055b17_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1055b18_7"
    },
    {
        "source_sentence": "若能觀財是無常相，觀諸眾生作一子想，是人乃能施於乞者。",
        "translation": "If someone can observe that possessions are impermanent and contemplate sentient beings as one child, then they'll be able to give them to a beggar.",
        "source": "T24n1488_004:1055b18_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1055b20_9"
    },
    {
        "source_sentence": "是人不為慳結所動，如須彌山風不能動。",
        "translation": "That person isn't moved by the fetter of stinginess, like the wind on Mount Sumeru that can't move.",
        "source": "T24n1488_004:1055b20_10"
    },
    {
        "source_sentence": "如是之人，能為眾生而作歸依，是人能具檀波羅蜜。",
        "translation": "If someone like this can make a refuge for sentient beings, they'll be able to attain the perfection of giving.",
        "source": "T24n1488_004:1055b21_11"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1055b22_12"
    },
    {
        "source_sentence": "有智之人，為四事故，樂行惠施：一者、因施能破煩惱，二者、因施發種種願，三者、因施得受安樂，四者、因施多饒財寶。",
        "translation": "A wise person who delights in practicing generosity for four reasons: 1. because generosity destroys afflictions; 2. because of generosity, they make various vows; 3. because of generosity, they attain well-being; and 4. because of generosity, they have abundant possessions.",
        "source": "T24n1488_004:1055b22_13"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1055b25_14"
    },
    {
        "source_sentence": "無貪之心，名之為施。",
        "translation": "A mind free of craving is called giving.",
        "source": "T24n1488_004:1055b25_15"
    },
    {
        "source_sentence": "云何無貪？",
        "translation": "What is the absence of greed?",
        "source": "T24n1488_004:1055b26_16"
    },
    {
        "source_sentence": "施即是業，物即是作，為業、為作具足布施，名為無貪。",
        "translation": "Giving is action, and things are doing. Making offerings that are accompanied by action and those that are done is called ‘without craving’.",
        "source": "T24n1488_004:1055b26_17"
    },
    {
        "source_sentence": "因於布施破煩惱者，既行惠施，破慳貪、嫉妬、瞋恚、愚癡。",
        "translation": "Those who break down afflictions because of generosity, then they'll practice generosity and break through stinginess, greed, jealousy, anger, and folly.",
        "source": "T24n1488_004:1055b27_18"
    },
    {
        "source_sentence": "云何因施發種種願？",
        "translation": "What are the various kinds of vows that arise from giving?",
        "source": "T24n1488_004:1055b28_19"
    },
    {
        "source_sentence": "因是施已，能發種種善惡等願，因善惡願得善惡果。",
        "translation": "As a result of this gift, they can give various kinds of vows such as good and bad, and the results of good and bad vows attain good and bad results.",
        "source": "T24n1488_004:1055b29_20"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1055c01_21"
    },
    {
        "source_sentence": "誓願力故。",
        "translation": "It's because of the power of the vow.",
        "source": "T24n1488_004:1055c01_22"
    },
    {
        "source_sentence": "云何因施得受安樂？",
        "translation": "What is the reason for receiving peace and comfort through generosity?",
        "source": "T24n1488_004:1055c01_23"
    },
    {
        "source_sentence": "因是施故受人天樂，至無上樂。",
        "translation": "Because of this gift, he receives the happiness of humans and gods up to the peerless happiness.",
        "source": "T24n1488_004:1055c02_24"
    },
    {
        "source_sentence": "云何因施多饒財寶？",
        "translation": "What's the reason for giving so much wealth and possessions?",
        "source": "T24n1488_004:1055c03_25"
    },
    {
        "source_sentence": "因是施故，所求金、銀乃至畜生，如意即得。",
        "translation": "Because of this gift, whatever gold, silver, or even an animal he desires will be obtained as he wishes.",
        "source": "T24n1488_004:1055c03_26"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1055c04_27"
    },
    {
        "source_sentence": "若人樂施，是人即壞五弊惡法：一者、邪見，二者、無信，三者、放逸，四者、慳悋，五者、瞋礙。",
        "translation": "If someone delights in giving, that person destroys five bad and bad qualities: 1. wrong views, 2. lack of faith, 3. carelessness, 4. stinginess, and 5. anger obstruction.",
        "source": "T24n1488_004:1055c04_28"
    },
    {
        "source_sentence": "離是惡已，心生歡喜，因歡喜故，乃至獲得真正解脫。",
        "translation": "Being freed from this evil, his mind becomes joyous, and because of that joy he attains true liberation.",
        "source": "T24n1488_004:1055c06_29"
    },
    {
        "source_sentence": "是人現在得四果報：一者、一切樂見乃至怨家，二者、善名流布遍於四方，三者、入大眾時心無怖畏，四者、一切善人樂來親附。",
        "translation": "That person now attains four results: 1. All kinds of pleasant views and even enemies, 2. good names that spread in the four directions, 3. no fear in their minds when they enter the masses, and 4. all kinds of good people who are happy to come and associate with them.",
        "source": "T24n1488_004:1055c07_30"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1055c10_31"
    },
    {
        "source_sentence": "修行施已，其心無悔。",
        "translation": "After cultivating generosity, his mind has no regrets.",
        "source": "T24n1488_004:1055c10_32"
    },
    {
        "source_sentence": "是人若以客塵煩惱故墮於地獄，雖處惡處，不飢不渴，以是因緣離二種苦：一、鐵丸苦，二、鐵漿苦。",
        "translation": "If this person falls into hell because of the afflictions of adventitious dust, even though they're in a bad place, they don't hunger or thirst, and it's because of these causes and conditions that they part with two kinds of suffering: 1. the pain of iron balls and 2. the pain of iron juice.",
        "source": "T24n1488_004:1055c11_33"
    },
    {
        "source_sentence": "若畜生身，所須易得，無所匱乏。",
        "translation": "If an animal's body is easy to obtain, there's nothing to lack.",
        "source": "T24n1488_004:1055c13_34"
    },
    {
        "source_sentence": "若餓鬼身，不受飢渴，常得飽滿。",
        "translation": "If a hungry ghost doesn't experience hunger and thirst in his body, he'll always be able to satisfy it.",
        "source": "T24n1488_004:1055c14_35"
    },
    {
        "source_sentence": "若得人身，壽命、色、力、安樂、辯才，及信、戒、施、多聞、智慧，勝於一切；",
        "translation": "If they were to obtain a human body, their life span, physical appearance, strength, well-being, peace and happiness, eloquence, as well as faith, morality, charity, learning, and wisdom would be superior to all.",
        "source": "T24n1488_004:1055c15_0"
    },
    {
        "source_sentence": "雖處惡世，不為惡事，惡法生時，終不隨受，於怖畏處不生恐怖。",
        "translation": "Even though he's in a bad world, he doesn't do bad things, and when bad qualities arise, he never follows them, and he doesn't become frightened where there's fear.",
        "source": "T24n1488_004:1055c16_1"
    },
    {
        "source_sentence": "若受天身，十事殊勝。",
        "translation": "If he receives a heavenly body, the ten things are superior.",
        "source": "T24n1488_004:1055c17_2"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1055c18_3"
    },
    {
        "source_sentence": "有智之人，為二事故，能行布施：一者、調伏自心，二者、壞怨瞋心；",
        "translation": "A wise person is able to practice giving for two reasons: first, to pacify one’s own mind and second, to dispel enemies and angers.",
        "source": "T24n1488_004:1055c18_4"
    },
    {
        "source_sentence": "如來因是名無上尊。",
        "translation": "Because of this, the Tathāgata is called the unsurpassed honored one.",
        "source": "T24n1488_004:1055c19_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1055c20_6"
    },
    {
        "source_sentence": "智者施已，不求受者愛念之心，不求名稱免於怖畏，不求善人來見親附，亦不求望天人果報。",
        "translation": "When a wise person gives alms, they don't seek to be loved by those who receive it, don't seek fame to escape fear, don't seek good people who come to see and become intimate with them, and don't expect the rewards of gods or humans.",
        "source": "T24n1488_004:1055c20_7"
    },
    {
        "source_sentence": "觀於二事：一者、以不堅財易於堅財，二者、終不隨順慳悋之心。",
        "translation": "They observe two things: first, they exchange indeterminate possessions for steady possessions and second, they never follow the mind of stinginess.",
        "source": "T24n1488_004:1055c22_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1055c24_9"
    },
    {
        "source_sentence": "如是財物，我若終沒，不隨我去，是故應當自手施與，我今不應隨失生惱，應當隨施生於歡喜。",
        "translation": "If I were to end up losing this kind of property, I wouldn't follow myself; therefore, I should give it to you with my own hands. Now, I won't be disturbed by what I lose, and I should give it to you with joy.",
        "source": "T24n1488_004:1055c24_10"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1055c26_11"
    },
    {
        "source_sentence": "施者先當自試其心，以外物施；",
        "translation": "A donor should first test his or her own mind and give to others.",
        "source": "T24n1488_004:1055c26_12"
    },
    {
        "source_sentence": "知心調已，次施內物。",
        "translation": "Knowing that his mind has been tempered, he then gives it to the inside things.",
        "source": "T24n1488_004:1055c27_13"
    },
    {
        "source_sentence": "因是二施，獲得二法：一者、永離諸有，二者、得正解脫。",
        "translation": "Because of these two kinds of giving, they attain two things: 1. permanently leaving existence and 2. attaining right liberation.",
        "source": "T24n1488_004:1055c28_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1055c29_1"
    },
    {
        "source_sentence": "如人遠行，身荷重擔，疲苦勞極，捨之則樂。",
        "translation": "Suppose a person travels far and wide, carrying a heavy burden in his body. Being exhausted and overcome with extreme pain and suffering, he feels happy when he lets it go.",
        "source": "T24n1488_004:1055c29_2"
    },
    {
        "source_sentence": "行施之人，見來求者，捨財與之，心生喜樂，亦復如是。",
        "translation": "When a donor sees someone who comes to ask for something, he gives them his property and gives it to them, and the donor's mind becomes joyous and happy, just likewise.",
        "source": "T24n1488_004:1056a01_3"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1056a02_4"
    },
    {
        "source_sentence": "智者常作如是思惟：『欲令此物隨逐我身至後世者，莫先於施。』",
        "translation": "A wise person always thinks, 'If you want to cause this thing to follow me to a later life, don't give it first.'",
        "source": "T24n1488_004:1056a02_5"
    },
    {
        "source_sentence": "復當深觀貧窮之苦，豪貴快樂，是故繫心常樂行施。",
        "translation": "Again, you should deeply observe the suffering of poverty and the happiness of wealth and prosperity. Therefore, you should always practice generosity with a concentrated mind and always delight in it.",
        "source": "T24n1488_004:1056a04_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1056a05_7"
    },
    {
        "source_sentence": "若人有財，見有求者，言無言懅，當知是人已說來世貧窮薄德，如是之人名為放逸。",
        "translation": "If a person has possessions and sees someone seeking them, saying nothing is said to be stingy, you should know that they've been described as poor and lacking virtue in future lives, and such a person is called careless.",
        "source": "T24n1488_004:1056a05_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1056a07_9"
    },
    {
        "source_sentence": "無財之人，自說無財，是義不然。",
        "translation": "A person with no possessions says he has no possessions, but that doesn't make sense.",
        "source": "T24n1488_004:1056a07_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1056a08_11"
    },
    {
        "source_sentence": "一切水草人無不有，雖是國主，不必能施，雖是貧窮，非不能施。",
        "translation": "All the water and grass people have nothing that they can't give, even though they are lords of their country, so they don't need to be able to give. Even though they're poor, it's not because they can't give.",
        "source": "T24n1488_004:1056a08_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1056a09_13"
    },
    {
        "source_sentence": "貧窮之人亦有食分，食已洗器，棄蕩滌汁，施應食者，亦得福德。",
        "translation": "A poor man who also has a portion of food, washes his dish after he eats it, discards the juice, and gives it to someone who should eat it, which will also attain merit.",
        "source": "T24n1488_004:1056a10_14"
    },
    {
        "source_sentence": "若以塵麨施於蟻子，亦得無量福德果報。",
        "translation": "If you give a dust bowl to an ant child, it will also bring measureless rewards of merit.",
        "source": "T24n1488_004:1056a11_15"
    },
    {
        "source_sentence": "天下極貧，誰當無此塵許麨也？",
        "translation": "The world is extremely poor, so who wouldn't have this dust and allow it to be eaten?",
        "source": "T24n1488_004:1056a12_16"
    },
    {
        "source_sentence": "誰有一日食三揣麨，命不全者？",
        "translation": "Who has a day when he eats three tathāgatas and his life isn't complete?",
        "source": "T24n1488_004:1056a13_17"
    },
    {
        "source_sentence": "是故諸人應以食半施於乞者。",
        "translation": "That's why people should give half of their food to a beggar.",
        "source": "T24n1488_004:1056a14_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1056a14_1"
    },
    {
        "source_sentence": "極貧之人，誰有赤裸無衣服者？",
        "translation": "Who among the extremely poor will have a red-naked man with no clothes?",
        "source": "T24n1488_004:1056a14_2"
    },
    {
        "source_sentence": "若有衣服，豈無一綖施人繫瘡，一指許財作燈炷耶？",
        "translation": "If there's clothing, isn't there a single piece of giving that binds the sores and creates a lamp or wick with about one finger?",
        "source": "T24n1488_004:1056a15_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1056a16_4"
    },
    {
        "source_sentence": "天下之人，誰有貧窮當無身者？",
        "translation": "Who among the people of the world will be poor and without a body?",
        "source": "T24n1488_004:1056a17_5"
    },
    {
        "source_sentence": "如其有身，見他作福，身應往助，歡喜無厭，亦名施主，亦得福德，或時有分，或有與等，或有勝者。",
        "translation": "If there's a body that sees others performing good deeds, the body should go and help them, rejoicing without tire. It's also called a donor, which also attains merit, sometimes with parts, sometimes equal, or sometimes superior.",
        "source": "T24n1488_004:1056a17_6"
    },
    {
        "source_sentence": "以是因緣，我受波斯匿王食時，亦呪願王及貧窮人所得福德等無差別。",
        "translation": "Because of these causes and conditions, when I accepted the food of King Prasenajit, I also prayed to the king and the merits gained by poor people are no different.",
        "source": "T24n1488_004:1056a19_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1056a21_8"
    },
    {
        "source_sentence": "如人買香，塗香、末香、散香、燒香，如是四香，有人觸者，買者、量者等聞無異，而是諸香不失毫釐。",
        "translation": "Suppose a person buys an incense, and when someone touches one of these four kinds of incense—an ointment, a powdered incense, a dispersed incense, or a burning incense—the buyer and the measurer hear them equally without any difference, but the incense doesn't lose even a tiny bit.",
        "source": "T24n1488_004:1056a21_9"
    },
    {
        "source_sentence": "修施之德，亦復如是；",
        "translation": "The same applies to the virtue of giving.",
        "source": "T24n1488_004:1056a23_10"
    },
    {
        "source_sentence": "若多若少，若麁若細，若隨喜心，身往佐助，若遙見聞心生歡喜，其心等故，所得果報無有差別。",
        "translation": "Whether it's large or small, crude or fine, or accompanied by a mind that follows joy, his body goes to assist him, and if he sees and hears from a distance, his mind becomes joyous because their minds are equal, so there's no difference in the results they attain.",
        "source": "T24n1488_004:1056a24_11"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1056a26_12"
    },
    {
        "source_sentence": "若無財物，見他施已心不喜信，疑於福田，是名貧窮。",
        "translation": "If someone lacks property, doesn't rejoice in faith after seeing others give it, and doubts the field of merit, this is called poor.",
        "source": "T24n1488_004:1056a26_13"
    },
    {
        "source_sentence": "若多財寶，自在無礙，有良福田，內無信心，不能奉施，亦名貧窮。",
        "translation": "If someone possesses a great deal of wealth and possessions but is unimpeded, has good fields of merit, lacks faith inside, and can't offer them, they're also called poor.",
        "source": "T24n1488_004:1056a27_14"
    },
    {
        "source_sentence": "是故智者，隨有多少，任力施與，除布施已，無有能得人天之樂至無上樂。",
        "translation": "That's why wise people, according to their number, give freely and effortlessly, and except for generosity, there's no one who can attain the happiness of humans and gods up to the unsurpassed happiness.",
        "source": "T24n1488_004:1056a29_15"
    },
    {
        "source_sentence": "是故我於契經中說：『智者自觀餘一揣食，自食則生，施他則死，猶應施與，況復多耶！』",
        "translation": "That's why I say in the sūtras, 'A wise person observes for themselves the remaining food that he eats, and when he eats it himself, he gives it to others who die; he should still give it to them, so why wouldn't he give more?'",
        "source": "T24n1488_004:1056b01_16"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1056b03_17"
    },
    {
        "source_sentence": "智者當觀財是無常，是無常故，於無量世失壞秏減，不得利益；",
        "translation": "A wise person should observe that wealth is impermanent. Because it is impermanent, they lose and perish in measureless ages without gain or loss.",
        "source": "T24n1488_004:1056b04_18"
    },
    {
        "source_sentence": "雖是無常，而能施作無量利益，云何慳惜不布施也？",
        "translation": "Even though it's impermanent, they can give for measureless benefits, so why wouldn't they be stingy and not give?",
        "source": "T24n1488_004:1056b05_19"
    },
    {
        "source_sentence": "智者復觀世間，若有持戒、多聞，持戒、多聞因緣力故，乃至獲得阿羅漢果，雖得是果，不能遮斷飢渴等苦。",
        "translation": "A wise person also observes in the world that if someone observes precepts and is well-versed, it's because of the power of observing precepts and being well-versed causes and conditions that they attain the fruit of arhatship, but even though they attain this fruit, they can't stop the suffering of hunger and thirst.",
        "source": "T24n1488_004:1056b06_20"
    },
    {
        "source_sentence": "若阿羅漢難得房舍、衣服、飲食、臥具、病藥，皆由先世不施因緣。",
        "translation": "If it's difficult for an arhat to obtain a dwelling, clothing, food and drink, bedding, or medicine for illnesses, it's because of the causes and conditions of not giving in previous lives.",
        "source": "T24n1488_004:1056b09_21"
    },
    {
        "source_sentence": "破戒之人若樂行施，是人雖墮餓鬼、畜生，常得飽滿，無所乏少。",
        "translation": "If someone who breaks the precepts likes to practice generosity, then even though they've fallen into hungry ghosts or animals, they'll always be satisfied and not lack anything.",
        "source": "T24n1488_004:1056b10_22"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1056b11_23"
    },
    {
        "source_sentence": "除布施已，不得二果：一者、自在，二者、解脫。",
        "translation": "Except for generosity, they won't attain two fruits: one, self-dependence and two, liberation.",
        "source": "T24n1488_004:1056b12_24"
    },
    {
        "source_sentence": "若持戒人，雖得生天，不修施故，不得上食，微妙瓔珞。",
        "translation": "If someone observes the precepts, even though they'll be born in heaven, they won't cultivate generosity and won't get an upper food or a subtle necklace.",
        "source": "T24n1488_004:1056b13_25"
    },
    {
        "source_sentence": "若人欲求世間之樂及無上樂，應當樂施。",
        "translation": "If someone wants worldly happiness and unsurpassed happiness, they should happily give.",
        "source": "T24n1488_004:1056b14_26"
    },
    {
        "source_sentence": "智者當觀生死無邊，受樂亦爾，是故應為斷生死施，不求受樂。",
        "translation": "A wise person should observe that birth and death have no limit, and so should the experience of pleasure. That is why they should stop giving birth and death and not seek to experience pleasure.",
        "source": "T24n1488_004:1056b15_27"
    },
    {
        "source_sentence": "復作是觀：雖復富有四天下地，受無量樂，猶不知足，是故我應為無上樂而行布施，不為人天。",
        "translation": "Again, he observes that even though he's wealthy in the four continents and receives measureless happiness, he still doesn't know how to fulfill it; therefore, I should practice generosity for the sake of unsurpassed happiness and not for the sake of humans or gods.",
        "source": "T24n1488_004:1056b16_28"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1056b18_29"
    },
    {
        "source_sentence": "無常故，有邊故。",
        "translation": "Because it is impermanent, because it has limits.",
        "source": "T24n1488_004:1056b19_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1056b19_1"
    },
    {
        "source_sentence": "若有說言：施主、受者及受樂者皆是五陰，如是五陰即是無常，捨施五陰，誰於彼受？",
        "translation": "If someone says, 'The donor, the recipient and the one who experiences pleasure are all five aggregates,' these five aggregates are impermanent, and they abandon the five aggregates of giving, so who will experience them?",
        "source": "T24n1488_004:1056b19_2"
    },
    {
        "source_sentence": "雖無受者，善果不滅，是故無有施者、受者。",
        "translation": "Even though there's no recipient, the good fruit doesn't cease; therefore, there's no donor or recipient.",
        "source": "T24n1488_004:1056b21_3"
    },
    {
        "source_sentence": "應反問言：有施、受不？",
        "translation": "You should ask again, Is there generosity and acceptance?",
        "source": "T24n1488_004:1056b22_4"
    },
    {
        "source_sentence": "若言施即是施，受即我者。",
        "translation": "If someone says that generosity is generosity and sensation is self, then they're saying that it's self.",
        "source": "T24n1488_004:1056b22_5"
    },
    {
        "source_sentence": "復應語言：我亦如是，施即是施，我即五陰。",
        "translation": "Again, you should say, So it is with me. Giving is giving, and I am the five aggregates.",
        "source": "T24n1488_004:1056b23_6"
    },
    {
        "source_sentence": "若言：施陰，此處無常，誰於彼受？",
        "translation": "If it's said that the aggregate of giving is impermanent here, who will receive it there?",
        "source": "T24n1488_004:1056b24_7"
    },
    {
        "source_sentence": "諦聽！",
        "translation": "Listen attentively!",
        "source": "T24n1488_004:1056b25_8"
    },
    {
        "source_sentence": "諦聽！",
        "translation": "Listen attentively!",
        "source": "T24n1488_004:1056b25_9"
    },
    {
        "source_sentence": "當為汝說。",
        "translation": "I will explain it for you.",
        "source": "T24n1488_004:1056b25_10"
    },
    {
        "source_sentence": "種子常耶？",
        "translation": "Are the seeds permanent?",
        "source": "T24n1488_004:1056b25_11"
    },
    {
        "source_sentence": "是無常乎？",
        "translation": "Is it impermanent?",
        "source": "T24n1488_004:1056b25_12"
    },
    {
        "source_sentence": "若言常者，云何子滅而生於芽？",
        "translation": "If it's said to be permanent, then how does the seed cease and the sprout arise?",
        "source": "T24n1488_004:1056b26_13"
    },
    {
        "source_sentence": "若見是過，復言無常，復當語言：若無常者，子時與糞、水、土等功，云何而令芽得增長？",
        "translation": "If someone sees this error and then says impermanent, they should also say, If it's impermanent, how will the sprouts grow when the child gives dung, water, dirt, and so forth?",
        "source": "T24n1488_004:1056b26_14"
    },
    {
        "source_sentence": "若言子雖無常，以功業故而得芽果，應言五陰亦復如是。",
        "translation": "If someone says that although the seeds are impermanent, they attain sprouts and fruits because of their meritorious actions, you should say that the five aggregates are likewise.",
        "source": "T24n1488_004:1056b28_15"
    },
    {
        "source_sentence": "若言子中先已有芽，人、功、水、糞為作了因。",
        "translation": "If it's said that there was already a sprout in the seed, human beings, effort, water, and dung are the causes of understanding.",
        "source": "T24n1488_004:1056c01_16"
    },
    {
        "source_sentence": "是義不然！",
        "translation": "That doesn't make sense!",
        "source": "T24n1488_004:1056c02_17"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1056c02_18"
    },
    {
        "source_sentence": "了因所了，物無增減，多則多住，少則少住。",
        "translation": "What is perceived by the perception cause and what is perceived by the perception of things has no increase or decrease: when many, then much abides; when few, then little abides.",
        "source": "T24n1488_004:1056c02_19"
    },
    {
        "source_sentence": "而今水、糞芽則增長，是故本無今有。",
        "translation": "The water and dung sprouts now grow, which is why they didn't exist in the past and are present now.",
        "source": "T24n1488_004:1056c03_20"
    },
    {
        "source_sentence": "若言了因二種：一、多，二、少。",
        "translation": "If it's said that there are two kinds of understood causes: 1. many and 2. few.",
        "source": "T24n1488_004:1056c04_21"
    },
    {
        "source_sentence": "多則見大，少則見小；",
        "translation": "When there are many, they see the big; when few, they see the small.",
        "source": "T24n1488_004:1056c04_22"
    },
    {
        "source_sentence": "猶如然燈，明多見大，明少見小。",
        "translation": "It's like a bright lamp that sees large for the many and sees small for the few.",
        "source": "T24n1488_004:1056c05_23"
    },
    {
        "source_sentence": "是義不然，何以故？",
        "translation": "This does not make sense. Why is this?",
        "source": "T24n1488_004:1056c06_24"
    },
    {
        "source_sentence": "猶如一種，多與水糞，不能一時一日增長人等過人。",
        "translation": "It's like a kind of man who often gives water and excrement, but he can't grow human beings or so forth in a single day at one time.",
        "source": "T24n1488_004:1056c06_25"
    },
    {
        "source_sentence": "若言了因雖有二種，要待時節，物少了少，物多了多，是故我言了因不增。",
        "translation": "If you say that there are two kinds of understood causes, even though it depends on time and season, things are few and things are abundant, so I say that the understanding cause doesn't increase.",
        "source": "T24n1488_004:1056c07_26"
    },
    {
        "source_sentence": "是義不然！",
        "translation": "That doesn't make sense!",
        "source": "T24n1488_004:1056c09_27"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1056c09_28"
    },
    {
        "source_sentence": "汝法時常，是故不應作如是說。",
        "translation": "Your teaching is eternal at all times. Therefore you should not make such a statement.",
        "source": "T24n1488_004:1056c09_29"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1056c10_30"
    },
    {
        "source_sentence": "子異、芽異，雖作得異，相似不斷，五陰亦爾。",
        "translation": "Although the seeds are different and the sprouts are different, despite being different in forming and attaining them, their similarity doesn't stop. The same applies to the five aggregates.",
        "source": "T24n1488_004:1056c10_31"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1056c11_32"
    },
    {
        "source_sentence": "如子業增芽，芽業增莖，莖業增葉，葉業增花，花業增果；",
        "translation": "Just as the action of a seed produces more and more shoots, the action of a shoot produces more and more stems, the action of a stem produces more and more leaves, the action of a leaf produces more and more flowers, and the action of a flower produces more and more fruit.",
        "source": "T24n1488_004:1056c11_33"
    },
    {
        "source_sentence": "一道五陰，增五道陰，亦復如是。",
        "translation": "The same applies to the five aggregates of one path and to the aggregate of accumulation of the five paths.",
        "source": "T24n1488_004:1056c13_34"
    },
    {
        "source_sentence": "若言如是異作異受，是義汝有，非我所說。",
        "translation": "If someone says thus that there are different actions and different feelings, this means you have them; it's not what I say.",
        "source": "T24n1488_004:1056c13_35"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1056c14_36"
    },
    {
        "source_sentence": "如汝法中，作者是我，受者是身，而復不說異作異受；",
        "translation": "In accordance with your doctrine, the author is self and the experiencer is the body. Yet you do not say that it is different from what has been done or experienced.",
        "source": "T24n1488_004:1056c14_37"
    },
    {
        "source_sentence": "受不殺戒，即是我也，以是因緣身得妙色，是故汝法受者無因，作者無果，有如是過。",
        "translation": "Accepting the precept against not killing is self, and it's because of these causes and conditions that the body attains marvelous form; therefore, there's a mistake in your teaching that accepters have no cause and authors have no effect, which is like this.",
        "source": "T24n1488_004:1056c16_38"
    },
    {
        "source_sentence": "若言我作身受，我亦如是，此作彼受。",
        "translation": "If it's said that self creates bodily sensation as self, so is self; this creates other sensations.",
        "source": "T24n1488_004:1056c17_39"
    },
    {
        "source_sentence": "復應問言：汝身、我異，身受飲食，被服、瓔珞、妙食因緣得好色力，惡食因緣得弊色力，是好、惡色若屬因緣，我何所得？",
        "translation": "Again, you should ask, 'Your body and self are different, and your body receives food and drink, clothing, jewelry, and wonderful food for the sake of good form, and bad food for the sake of bad form for the sake of bad form. If this good or bad form belongs to the causes and conditions, what will I attain?'",
        "source": "T24n1488_004:1056c18_40"
    },
    {
        "source_sentence": "若言我得憂愁歡喜，云何不是異作、異受？",
        "translation": "If someone says, 'I'll be grieved and joyous,' why isn't it differently created or experienced?",
        "source": "T24n1488_004:1056c21_41"
    },
    {
        "source_sentence": "譬如有人，為力服酥，是人久服身得大力、上妙好色；",
        "translation": "Suppose there is a man who eats butter for the sake of power. Having eaten it for a long time, that man gains great strength and an extremely beautiful appearance.",
        "source": "T24n1488_004:1056c22_42"
    },
    {
        "source_sentence": "有人羸瘦，見之心喜，是人即得大色力不？",
        "translation": "If someone is weak and greedy, will they attain great physical strength if they see it?",
        "source": "T24n1488_004:1056c23_43"
    },
    {
        "source_sentence": "若言不得，我亦如是；",
        "translation": "If you say it cannot be obtained, I am likewise.",
        "source": "T24n1488_004:1056c24_44"
    },
    {
        "source_sentence": "身所作事，我云何得？",
        "translation": "What is the acquisition of a bodily action?",
        "source": "T24n1488_004:1056c25_45"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1056c25_46"
    },
    {
        "source_sentence": "不相似故。",
        "translation": "It's because they aren't similar.",
        "source": "T24n1488_004:1056c25_47"
    },
    {
        "source_sentence": "我法不爾，陰作、陰受，相似不斷。",
        "translation": "This is not the case for self and dharmas. The same applies to what is manifested by the aggregates and to what is felt by the aggregates:",
        "source": "T24n1488_004:1056c25_48"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_004:1056c26_49"
    },
    {
        "source_sentence": "若言五陰無常，此不至彼而得受報。",
        "translation": "If it's said that the five aggregates are impermanent, this person won't reach them and receive their reward.",
        "source": "T24n1488_004:1056c26_50"
    },
    {
        "source_sentence": "是義不然！",
        "translation": "That doesn't make sense!",
        "source": "T24n1488_004:1056c27_51"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1056c27_52"
    },
    {
        "source_sentence": "我法或有即作即受，或有異作異受，無作無受。",
        "translation": "The self and dharmas sometimes have that which is conditioned exactly as sensation, sometimes differently conditioned and differently experienced, and sometimes unconditioned and un受.",
        "source": "T24n1488_004:1056c28_53"
    },
    {
        "source_sentence": "即作即受者，陰作陰受；",
        "translation": "“That which exactly is manifesting and that which exactly is receiving”: The aggregates make the aggregates manifest and receive.",
        "source": "T24n1488_004:1056c29_54"
    },
    {
        "source_sentence": "異作異受者，人作天受；",
        "translation": "What is different forming and what is different forming receiver, is human forming and divine feeling.",
        "source": "T24n1488_004:1056c29_55"
    },
    {
        "source_sentence": "無作無受者，作業因緣和合而有，本無自性，何有作受？",
        "translation": "The absence of action and the absence of feeling are conditioned by the conjunction of causes and conditions for action. If there were no self-nature in the first place, how could there be a sensation that is conditioned?",
        "source": "T24n1488_004:1057a01_56"
    },
    {
        "source_sentence": "汝意若謂：異作異受，云何復言相續不斷？",
        "translation": "What do you think? If you say that there are dissimilar actions and dissimilar sensations, how can you further claim that the stream is unceasing?",
        "source": "T24n1488_004:1057a02_57"
    },
    {
        "source_sentence": "是義不然！",
        "translation": "That doesn't make sense!",
        "source": "T24n1488_004:1057a03_58"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1057a03_59"
    },
    {
        "source_sentence": "譬如置毒乳中，至醍醐時故能殺人，乳時異故，醍醐亦異，雖復有異次第而生，相似不斷，故能害人。",
        "translation": "Good man, this is analogous to the case of placing poisonous milk in salted milk and being able to kill a human being at the moment when it reaches clarified butter. Because there is a difference between the moments of milk and so forth, the clarified milk is also different. Even though there may be a difference, they are produced one after the other; their similarity does not cease. That is why they can harm humans",
        "source": "T24n1488_004:1057a03_60"
    },
    {
        "source_sentence": "五陰亦爾，雖復有異，次第而生，相似不斷，是故可言異作異受，即作即受、無作無受者，若離五陰者，無我我所。",
        "translation": "The same applies to the five aggregates. Although there are differences, they arise successively and similarities are not abandoned. That is why it can be said that di›erences make di›erent feelings possible: “That which is made exactly is felt; that which is unmanifesting has no feeling”:",
        "source": "T24n1488_004:1057a06_61"
    },
    {
        "source_sentence": "一切眾生顛倒覆心，或說色即是我，乃至識即是我。",
        "translation": "All sentient beings mistakenly cover their minds and sometimes say form is the self, or even consciousness is the self.",
        "source": "T24n1488_004:1057a08_62"
    },
    {
        "source_sentence": "或有說言：色即是我，其餘四陰即是我所，乃至識亦如是。",
        "translation": "Some say: Form is the self; the other four aggregates are what belong to me. The same applies up to consciousness.",
        "source": "T24n1488_004:1057a09_63"
    },
    {
        "source_sentence": "若有說言：離五陰已別有我者，無有是處。",
        "translation": "If someone were to say that there is a separate self apart from the five aggregates, this would be unreasonable.",
        "source": "T24n1488_004:1057a11_64"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1057a12_65"
    },
    {
        "source_sentence": "我佛法中色非我也。",
        "translation": "'In the self and buddha-dharma, form is not self.'",
        "source": "T24n1488_004:1057a12_66"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1488_004:1057a12_67"
    },
    {
        "source_sentence": "無常、無作、不自在故，是故四陰，不名我所；",
        "translation": "Because they are impermanent, unmanifest, and not self-willed. That is why the four aggregates are not named what belongs to me.",
        "source": "T24n1488_004:1057a13_0"
    },
    {
        "source_sentence": "乃至識亦如是。",
        "translation": "It's likewise with consciousness.",
        "source": "T24n1488_004:1057a13_1"
    },
    {
        "source_sentence": "眾緣和合，異法出生，故名為作，實無異作；",
        "translation": "When the conditions are combined, dissimilar factors arise: that is why it is called ‘manifesting’. There really is no different manifesting in reality.",
        "source": "T24n1488_004:1057a14_2"
    },
    {
        "source_sentence": "眾緣和合，異法出生，名為受者，實無異受；",
        "translation": "When various conditions are combined, dissimilar factors arise. This is called ‘sensation’ because there really is no dissimilar feeling.",
        "source": "T24n1488_004:1057a15_3"
    },
    {
        "source_sentence": "是故名為無作無受。",
        "translation": "Therefore, it's called having no action and no sensation.",
        "source": "T24n1488_004:1057a16_4"
    },
    {
        "source_sentence": "若汝意謂：異作異受，何故此人作業不彼人受？",
        "translation": "If you think, What do you mean by different actions and different feelings? Why is the action of this person not felt by that person?",
        "source": "T24n1488_004:1057a16_5"
    },
    {
        "source_sentence": "俱有五陰！",
        "translation": "Both have the five aggregates!",
        "source": "T24n1488_004:1057a17_6"
    },
    {
        "source_sentence": "是義不然。",
        "translation": "This doesn't make sense.",
        "source": "T24n1488_004:1057a17_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1057a18_8"
    },
    {
        "source_sentence": "異有二種：一者、身異，二者、名異。",
        "translation": "There are two kinds of dissimilarity: 1. dissimilarity in body and 2. dissimilarity in name.",
        "source": "T24n1488_004:1057a18_9"
    },
    {
        "source_sentence": "一者、佛得，二者、天得。",
        "translation": "1. attained by the Buddha, and 2. attained by gods.",
        "source": "T24n1488_004:1057a19_10"
    },
    {
        "source_sentence": "佛得、天得身名各異，是因緣故身口應異；",
        "translation": "The names of the bodies acquired by buddhas and those acquired by celestial beings are different. Because of these causes and conditions, body and speech should be different.",
        "source": "T24n1488_004:1057a19_11"
    },
    {
        "source_sentence": "身口異故造業亦異；",
        "translation": "Because bodily and verbal action are different, the act of creating is also different.",
        "source": "T24n1488_004:1057a20_12"
    },
    {
        "source_sentence": "造業異故壽命、色力、安、辯、亦異，是故不得佛得作業，天得受果。",
        "translation": "Because the creation of karma is different, longevity, form, power, peace, eloquence, and also are different; therefore, it's not possible for a Buddha to attain action, and heavenly beings will attain its fruit.",
        "source": "T24n1488_004:1057a21_0"
    },
    {
        "source_sentence": "雖俱五陰，色名是一，受、想、行異。",
        "translation": "Although they are both with five aggregates, the name matter is one: feeling, conceptual identification and conditioning factors are different.",
        "source": "T24n1488_004:1057a22_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1057a23_2"
    },
    {
        "source_sentence": "佛得受樂，天得受苦，佛得生貪，天得生瞋，是故不得名為相似。",
        "translation": "The Buddha receives pleasure, the gods receive pain, the Buddha becomes greedy, and the gods become angry; therefore, they can't be called similar.",
        "source": "T24n1488_004:1057a23_3"
    },
    {
        "source_sentence": "色名雖一，其實有異，或有佛得白色，天得黑色。",
        "translation": "Although the colors and names may be the same, there are differences in fact. Some buddhas may get white while gods get black.",
        "source": "T24n1488_004:1057a24_4"
    },
    {
        "source_sentence": "若以名同為一義者，一人生時應一切生，一人死時應一切死！",
        "translation": "If names are the same as one meaning, then when one person is born, all should be born, and when one person dies, all die!",
        "source": "T24n1488_004:1057a25_5"
    },
    {
        "source_sentence": "汝若不欲然此義者，是故不得異作異受。",
        "translation": "If you don't want this to be the case, it's because you can't create or experience different things differently.",
        "source": "T24n1488_004:1057a27_6"
    },
    {
        "source_sentence": "汝意若謂：汝亦異作異受，我亦如是異作異受；",
        "translation": "What do you think? If you say, “You also experience dissimilar actions and dissimilar feelings,” then so too I experience dissimilar actions and dissimilar feelings.",
        "source": "T24n1488_004:1057a28_7"
    },
    {
        "source_sentence": "若異作異受，應同我過，何故不見自過而責我者！",
        "translation": "If dissimilar actions and dissimilar sensations are the same as self and faults, why doesn't he see his own faults and blame me?",
        "source": "T24n1488_004:1057a29_8"
    },
    {
        "source_sentence": "是義不然。",
        "translation": "This doesn't make sense.",
        "source": "T24n1488_004:1057b01_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1057b01_10"
    },
    {
        "source_sentence": "我異二種：一、次第生亦次第滅，二者、次第生不次第滅。",
        "translation": "The difference in self is twofold: 1. sequential arising and also sequential cessation; 2. sequential arising and not sequential cessation.",
        "source": "T24n1488_004:1057b01_11"
    },
    {
        "source_sentence": "是生異故，滅亦復異，是故我言：異作異受，此作此受，不同汝過。",
        "translation": "Because the arising is different, the cessation is also different. That is why I say that what is different produces what is different and receives what is received. What this produces does not differ from what you have said.",
        "source": "T24n1488_004:1057b03_12"
    },
    {
        "source_sentence": "「譬如有人欲燒聚落，於乾草中放一粒火，是火次第生因緣故，能燒百里至二百里。",
        "translation": "“Suppose a person wants to burn a village and puts a grain of fire in dry grass. Because the fire is the cause for its sequential arising, it can burn anything from a hundred li to two hundred li.",
        "source": "T24n1488_004:1057b04_13"
    },
    {
        "source_sentence": "村主求得，即便問之：『汝弊惡人，何因緣故燒是大村？』",
        "translation": "Seeking to get it, the owner of the village asked him, 'You bad man, why are you burning this large village for what reason?'",
        "source": "T24n1488_004:1057b06_14"
    },
    {
        "source_sentence": "彼人答言：『實非我燒。",
        "translation": "They replied, 'It's really not self that burns.",
        "source": "T24n1488_004:1057b07_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1057b08_16"
    },
    {
        "source_sentence": "我所放火，尋已滅盡，所燒之處一把草耳，我今當還償汝二把，其餘之物我不應償。』",
        "translation": "When the fire that I set has burned out, a handful of grass and ears have been burned, so now I will repay you two hands; the rest won't be paid.'",
        "source": "T24n1488_004:1057b08_17"
    },
    {
        "source_sentence": "是時村主，復作是言：『癡人！",
        "translation": "The village owner then again said, 'Foolish man!",
        "source": "T24n1488_004:1057b10_18"
    },
    {
        "source_sentence": "因汝小火，次第生火，遂燒百里至二百里。",
        "translation": "Because of your small fire, a fire arises one after the other, and it burns everything from a hundred li to two hundred li.",
        "source": "T24n1488_004:1057b10_19"
    },
    {
        "source_sentence": "辜由於汝，云何不償？』",
        "translation": "If it's because of you, why don't you repay it?'",
        "source": "T24n1488_004:1057b11_20"
    },
    {
        "source_sentence": "雖知是火異作異燒，相續不斷，故彼得罪。",
        "translation": "Even though they know that this fire is differently created and differently burned, it doesn't continue in a series; therefore, Peter sins.",
        "source": "T24n1488_004:1057b12_21"
    },
    {
        "source_sentence": "善惡五陰亦復如是，受報時陰雖言不作，以其次第相續而生，是故受報。",
        "translation": "Good and bad five aggregates are also in this way: although the aggregate at the moment of experiencing retribution is said to be unmanifesting, it arises successively because of their succession. That is why there is retribution.",
        "source": "T24n1488_004:1057b13_22"
    },
    {
        "source_sentence": "「譬如有人與他共[貝*為]，執炬遠行至百里外，若不至者當輸罰負，如其到者汝當輸我。",
        "translation": "“Suppose there is a man who shares the same [shell*for] as others, carrying a torch and going from place to place for a hundred li. If he does not reach it, he will be charged with a fine; if he does reach it, you should pass it on to me.",
        "source": "T24n1488_004:1057b14_23"
    },
    {
        "source_sentence": "執炬之人至百里已，即從責物。",
        "translation": "When the torch bearer reached a hundred li, he went to reprimand the object.",
        "source": "T24n1488_004:1057b16_24"
    },
    {
        "source_sentence": "他言：『汝炬發跡已滅，云何於此從我索物？』",
        "translation": "Others say, 'You torch has ceased after its traces have been produced, so why would you ask for something from me here?'",
        "source": "T24n1488_004:1057b17_25"
    },
    {
        "source_sentence": "執炬者言：『彼火雖滅，次第相續生來至此。』",
        "translation": "The torch-holder says, 'Although that fire goes out, it's produced in sequence and comes here.'",
        "source": "T24n1488_004:1057b18_26"
    },
    {
        "source_sentence": "如是二人，說俱得理。",
        "translation": "Thus, these two people teach that both attain the principle.",
        "source": "T24n1488_004:1057b19_27"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1057b19_28"
    },
    {
        "source_sentence": "如是義者，亦即亦異，是故二人俱無過失。",
        "translation": "The meaning of thus is that they are also the same as and different from each other. That is why there is no error in both cases.",
        "source": "T24n1488_004:1057b20_29"
    },
    {
        "source_sentence": "若有說言：五陰亦爾，即作即受，異作異受，俱無過失。",
        "translation": "If one says, The same applies to the five aggregates: that is, action exactly is feeling; difference in action and difference in feeling are both without fault.",
        "source": "T24n1488_004:1057b21_0"
    },
    {
        "source_sentence": "譬如此彼二岸、中流，總名恒河，夏時二岸相去甚遠，秋時二岸相去則近，無常定相，或大或小，雖復增減，人皆謂河。",
        "translation": "For example, the two banks and the middle part of the river are collectively called the Ganges River. In summer the two banks are very distant from each other; in autumn the two banks are close to each other. Their characteristics are impermanent and determined, either large or small. Although they increase and decrease, everyone calls them rivers.",
        "source": "T24n1488_004:1057b22_1"
    },
    {
        "source_sentence": "或有說言：此不是河，智人亦說有異、不異。",
        "translation": "Some say: This is not a river. The wise man also says that there is difference and there is no difference.",
        "source": "T24n1488_004:1057b24_2"
    },
    {
        "source_sentence": "五陰亦爾，智人亦說即作即受，異作異受。",
        "translation": "The same applies to five aggregates. Also the wise person has said that what is manifesting exactly is feeling: different manifesting and different feeling.",
        "source": "T24n1488_004:1057b25_3"
    },
    {
        "source_sentence": "汝意若謂：二岸是土，中流是水，河神是河。",
        "translation": "What do you think? If you say that the two banks are soil, the middle part is water, and the river gods are rivers.",
        "source": "T24n1488_004:1057b26_4"
    },
    {
        "source_sentence": "是義不然！",
        "translation": "That doesn't make sense!",
        "source": "T24n1488_004:1057b27_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1057b27_6"
    },
    {
        "source_sentence": "若神是河，何故復言河清、河濁，有此岸、彼岸、中流深淺，到於大海，可度、不度！",
        "translation": "If the gods are rivers, why do they also say that the rivers are clear and the rivers are turbid? There is this shore, another shore, a middle course, deep and shallow, which reaches the great sea but can be crossed or not!",
        "source": "T24n1488_004:1057b28_7"
    },
    {
        "source_sentence": "譬如有樹，則有神居，若無樹者，神何所居？",
        "translation": "It's like a tree that has a soul dwelling there, but if there are no trees, where will the soul live?",
        "source": "T24n1488_004:1057b29_8"
    },
    {
        "source_sentence": "河之與神，亦應如是。",
        "translation": "The river and the gods should be likewise.",
        "source": "T24n1488_004:1057c01_9"
    },
    {
        "source_sentence": "是故彼此二岸、中流，次第不斷，總名為河。",
        "translation": "Because of this, the two banks and the middle part of the river do not flow together in order. They are collectively called a river.",
        "source": "T24n1488_004:1057c02_10"
    },
    {
        "source_sentence": "是故可言即之與異，五陰亦爾。",
        "translation": "Therefore, it can be said that they are the same as and different from each other. The same applies to the five aggregates.",
        "source": "T24n1488_004:1057c03_11"
    },
    {
        "source_sentence": "「譬如有人罵辱貴勝，因惡口故，脚被鎖械，是脚實無惡口之罪而被鎖械，是故不得決定說言：異作異受，即作即受。",
        "translation": "“Suppose a person ridicules someone who is superior because of their bad speech and puts his feet in chains or fetters, and that person’s feet really aren’t subject to the sin of bad speech. Because of this, they can’t say with certainty:",
        "source": "T24n1488_004:1057c04_0"
    },
    {
        "source_sentence": "唯有智者可得說言：即作即受，異作異受。",
        "translation": "Only the wise one can say: That which is manifesting exactly is feeling, and that which is di›erentiated is di›erentiated.",
        "source": "T24n1488_004:1057c06_1"
    },
    {
        "source_sentence": "譬如器、油、炷火、人護，眾緣和合乃名燈明。",
        "translation": "It's like when a container, oil, a burner, a fire, or someone protects it, and the combination of many conditions is called a lamp.",
        "source": "T24n1488_004:1057c07_2"
    },
    {
        "source_sentence": "汝意若謂燈明增減。",
        "translation": "What do you think? Suppose you say that the light of the lamp increases and decreases.",
        "source": "T24n1488_004:1057c08_3"
    },
    {
        "source_sentence": "是義不然！",
        "translation": "That doesn't make sense!",
        "source": "T24n1488_004:1057c09_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1057c09_5"
    },
    {
        "source_sentence": "滅故不增，來故無減，以次第生故言燈增減。",
        "translation": "Because of cessation, it does not increase; because of coming, it does not decrease: because of successively arising, the lamp is said to increase and decrease.",
        "source": "T24n1488_004:1057c09_6"
    },
    {
        "source_sentence": "汝意若謂：燈是無常，油即是常，油多明多，油少明少者。",
        "translation": "What do you think? Suppose you say that a lamp is impermanent, oil is permanent, much oil clarifies much, and little oil clarifies little.",
        "source": "T24n1488_004:1057c10_7"
    },
    {
        "source_sentence": "是義不然！",
        "translation": "That doesn't make sense!",
        "source": "T24n1488_004:1057c11_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1057c12_0"
    },
    {
        "source_sentence": "油無常故，有盡、有燒，如其常者，應二念住；",
        "translation": "Because oil is impermanent, there is exhaustion and burning. If it were permanent, it would abide in two moments of thought:",
        "source": "T24n1488_004:1057c12_1"
    },
    {
        "source_sentence": "若二念住，誰能燒盡？",
        "translation": "If there are two abodes of mindfulness, who can burn them up?",
        "source": "T24n1488_004:1057c13_2"
    },
    {
        "source_sentence": "是故智人亦復說言：燈明即異，五陰亦爾。",
        "translation": "That is why the wise person also said: The light of a lamp means difference, and so are the five aggregates.",
        "source": "T24n1488_004:1057c13_3"
    },
    {
        "source_sentence": "明即六入，油即是業，油業因緣故令五陰有增有減，有彼有此。",
        "translation": "It means the six sense consciousnesses: oil is action. Because of the causes and conditions of oil action, the five aggregates are made to have increase and decrease; there is this and that which has this.",
        "source": "T24n1488_004:1057c14_4"
    },
    {
        "source_sentence": "如有人說阿坻耶語，是阿坻耶久已過去，不在今日，世人相傳，次第不滅，故得稱為阿坻耶語。",
        "translation": "Good man, it is like someone who speaks the aya language. The aya has been in existence for a long time but does not exist today. It is transmitted from generation to generation by human beings and will not be extinguished. Therefore, it can be called an aya.",
        "source": "T24n1488_004:1057c16_5"
    },
    {
        "source_sentence": "智者亦說是阿坻耶語，非阿坻耶語，雖復是非，俱不失理。",
        "translation": "A wise person also says that it's an abhidharma, not an abhidharma, and even though it's right or wrong, they don't lose their principle.",
        "source": "T24n1488_004:1057c18_6"
    },
    {
        "source_sentence": "五陰亦爾，亦可說言即作即受，異作異受。",
        "translation": "The same applies to the five aggregates. It can also be said that what is manifesting exactly is feeling and that what is di›erentiated is di›erentiated sensation.",
        "source": "T24n1488_004:1057c19_7"
    },
    {
        "source_sentence": "「有人巨富，繼嗣中斷，身復喪沒，財當入官。",
        "translation": "“Some people are very wealthy, and their heirs are in the midst of a disaster. Their bodies will again perish, and their riches will go to officials.",
        "source": "T24n1488_004:1057c20_8"
    },
    {
        "source_sentence": "有人言曰：『如是財物，應當屬我。』",
        "translation": "Some people say, 'Such possessions should belong to me.'",
        "source": "T24n1488_004:1057c21_9"
    },
    {
        "source_sentence": "官人語言：『是財云何異作異屬？』",
        "translation": "The officials said, 'How are these possessions differently made and differently belonging?'",
        "source": "T24n1488_004:1057c22_10"
    },
    {
        "source_sentence": "是人復言：『我是亡者第七世孫，次第不斷，云何是財不屬我耶？』",
        "translation": "Again, that person says, 'This is the seventh descendant of a deceased person who doesn't cease in order, so why isn't this property mine?'",
        "source": "T24n1488_004:1057c22_11"
    },
    {
        "source_sentence": "官人即言：『如是如是，如汝所說。』",
        "translation": "The officials then said, 'So it is, so it is, just as you say.'",
        "source": "T24n1488_004:1057c24_12"
    },
    {
        "source_sentence": "智者說言：五陰亦爾，即作即受。",
        "translation": "The wise one says: So it is with the five aggregates. That which is made and that which is received.",
        "source": "T24n1488_004:1057c24_13"
    },
    {
        "source_sentence": "異作異受。",
        "translation": "They are differently created and differently received.",
        "source": "T24n1488_004:1057c25_14"
    },
    {
        "source_sentence": "「汝意若謂：五陰作業，成已便過，是身猶在，業無所依，業若無依，便是無業，捨是身已，云何得報？",
        "translation": "“If you say, ‘The five aggregates are conditioned by action and pass away after having been formed,’ then the body is still there. Action has no basis; if action has no basis, it means there is no action. If you abandon this body, how will you repay it?",
        "source": "T24n1488_004:1057c25_15"
    },
    {
        "source_sentence": "是義不然。",
        "translation": "This doesn't make sense.",
        "source": "T24n1488_004:1057c27_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_004:1057c28_17"
    },
    {
        "source_sentence": "一切過業，待體待時。",
        "translation": "All faulty actions await their essence and await the time.",
        "source": "T24n1488_004:1057c28_18"
    },
    {
        "source_sentence": "譬如橘子因橘而生，從酢而甜。",
        "translation": "It's like an orange that arises from an orange and is sweetened by vinegar.",
        "source": "T24n1488_004:1057c28_19"
    },
    {
        "source_sentence": "人為橘故種殖是子，是子、根、莖、葉、花、生果，皆悉不酢，時到果熱酢味則發；",
        "translation": "People plant these seeds for the sake of their oranges. These seeds, roots, stems, stalks, leaves, flowers, and growing fruits are all without vinegar. When the time comes [to harvest] they will give rise to the taste of hot vinegar when the fruit is ripe.",
        "source": "T24n1488_004:1057c29_20"
    },
    {
        "source_sentence": "如是酢味非本無今有，亦非無緣，乃是過去本果因緣。",
        "translation": "Thus, the taste of vinegar isn't originally nonexistent but now exists, and it's not without conditions; it's the cause and condition of past past results.",
        "source": "T24n1488_004:1058a02_21"
    },
    {
        "source_sentence": "身、口、意業，亦復如是。",
        "translation": "So it is with bodily, verbal, and mental actions.",
        "source": "T24n1488_004:1058a03_22"
    },
    {
        "source_sentence": "若言是業住何處者，是業住於過去世中，待時、待器、得受果報。",
        "translation": "If someone asks, Where does this action abide?, it's an action that abided in a past life, waited for the time, waited for the container, and received its fruit.",
        "source": "T24n1488_004:1058a04_0"
    },
    {
        "source_sentence": "如人服藥，經於時節，藥雖銷滅，時到則發好力、好色；",
        "translation": "Good man, it is like someone who takes a medicine at the appropriate time and season. Even though the medicine disappears when the season arrives, good strength and good complexion are produced when the proper time comes.",
        "source": "T24n1488_004:1058a05_1"
    },
    {
        "source_sentence": "身、口、意業，亦復如是，雖復過滅，時到則受。",
        "translation": "The same applies to bodily, verbal and mental action: even though it is further than cessation, it is felt at the moment of arrival.",
        "source": "T24n1488_004:1058a06_2"
    },
    {
        "source_sentence": "譬如小兒初所學事，雖念念滅，無有住處，然至百年亦不亡失；",
        "translation": "Good man, it is analogous to a small child who for the first time learns what he has learned. Even though his thoughts are not extinguished and there is no place to stay, they do not perish even up to one hundred years from now.",
        "source": "T24n1488_004:1058a07_3"
    },
    {
        "source_sentence": "是過去業亦復如是，雖無住處，時到自受。",
        "translation": "The same applies to past action: although there is no abiding place, at the moment it reaches self-accompaniment.",
        "source": "T24n1488_004:1058a09_4"
    },
    {
        "source_sentence": "是故言：非陰作陰受，亦復不得非陰受也。",
        "translation": "That's why it's said, It's not the aggregate that creates aggregate sensation, and it also doesn't obtain feeling that's not the aggregate.",
        "source": "T24n1488_004:1058a10_0"
    },
    {
        "source_sentence": "若能了了通達是事，是人則能獲無上果。",
        "translation": "If someone can understand and comprehend these things, they'll attain the unsurpassed fruit.",
        "source": "T24n1488_004:1058a10_1"
    },
    {
        "source_sentence": "◎優婆塞戒經卷第四",
        "translation": "*Upāsaka Precepts Sutra, Volume 4",
        "source": "T24n1488_004:1058a11_2"
    }
]