[
    {
        "source_sentence": "根本說一切有部毘奈耶雜事",
        "translation": "Mūlasarvâstivāda-vinaya miscellaneous matters",
        "source": "T24n1451_029:0345c18_0"
    },
    {
        "source_sentence": "卷第二十九",
        "translation": "Fascicle 29.",
        "source": "T24n1451_029:0345c19_0"
    },
    {
        "source_sentence": "三藏法師義淨奉　制譯",
        "translation": "translated by the Tripiṭaka Master Yogâcārabhūmi in Sanskrit",
        "source": "T24n1451_029:0345c21_0"
    },
    {
        "source_sentence": "第六門第四子攝之餘明佛從天下等事爾時佛在室羅伐城，既現大神通降伏諸外道，利益無量眾隨類悉歸依，一切人天咸令歡喜，遠近城邑婆羅門等及工巧人，並皆來集室羅伐城，於世尊處而為出家。",
        "translation": "The Buddha then stayed in the city of Śrāvastī, manifested great supernormal powers to subdue the non-Buddhists, benefited measureless multitudes and all kinds of people who relied on him, and all the gods and humans were joyous, with brahmans and other craftsmen from distant and near cities as well as skillful people coming to assemble in the city of Śrāvastī, leaving",
        "source": "T24n1451_029:0345c22_0"
    },
    {
        "source_sentence": "時彼諸人所有眷屬，皆來尋覓至此城中，見已告曰：「仁等捨俗而來出家，欲令我等若為存活？」",
        "translation": "All of those people and their retinues then came to this city to search for them, and when they saw them, they told them, Sirs, you abandoned the secular world and left home, wanting to make us survive?",
        "source": "T24n1451_029:0345c26_1"
    },
    {
        "source_sentence": "答曰：「汝若愛者，可住於斯當受其法。」",
        "translation": "He answered, If you love it, you can stay here and receive its teaching.",
        "source": "T24n1451_029:0345c28_2"
    },
    {
        "source_sentence": "彼曰：「善哉！",
        "translation": "They said, Good!",
        "source": "T24n1451_029:0345c29_3"
    },
    {
        "source_sentence": "我當修學。」",
        "translation": "I will cultivate it.",
        "source": "T24n1451_029:0346a01_0"
    },
    {
        "source_sentence": "即皆出家。",
        "translation": "They all renounced the world.",
        "source": "T24n1451_029:0346a01_1"
    },
    {
        "source_sentence": "時婆羅門等見已譏嫌：「此等工人出家捨俗，我有作務欲使何人？」",
        "translation": "When the Brāhmaṇas and others saw this, they ridiculed it, saying, These workers leave home and renounce the secular world, and who do I want to work for?",
        "source": "T24n1451_029:0346a01_2"
    },
    {
        "source_sentence": "時諸苾芻以緣白佛，佛作是念：「工巧之人來出家後，還畜昔時所有作具，由是因緣致生譏醜。」",
        "translation": "The monks then reported this to the Buddha for his sake, and he thought, After a skillful man leaves home, he returns to store what he made in the past, and because of these causes and conditions, he gives rise to criticism.",
        "source": "T24n1451_029:0346a02_3"
    },
    {
        "source_sentence": "告諸苾芻曰：「既出家後不應更畜工巧之具，若仍畜者得惡作罪。」",
        "translation": "He told the monks, After leaving home, you shouldn't store any more skillful implements; if you do, you'll be guilty of misdeeds.",
        "source": "T24n1451_029:0346a05_4"
    },
    {
        "source_sentence": "佛制戒後，時有醫人既出家已，隨處遊行至室羅伐。",
        "translation": "After the Buddha established the precepts, there was a physician who left home and traveled from place to Śrāvastī after leaving home.",
        "source": "T24n1451_029:0346a06_5"
    },
    {
        "source_sentence": "有舊苾芻身嬰苦病，見客苾芻來，報言：「具壽！",
        "translation": "An old monk was suffering from a painful illness in his body, and when he saw the guest monk coming, he reported, Kauṣṭhila!",
        "source": "T24n1451_029:0346a07_6"
    },
    {
        "source_sentence": "可為我治。」",
        "translation": "You can treat it for me.",
        "source": "T24n1451_029:0346a08_7"
    },
    {
        "source_sentence": "答曰：「佛不許我先是醫人更畜醫具，欲將何物而療病耶？」",
        "translation": "He answered, The Buddha won't allow me to store the doctor's goods and what things I want to use to treat my illness?",
        "source": "T24n1451_029:0346a09_8"
    },
    {
        "source_sentence": "以緣白佛，佛言：「我今聽許諸苾芻輩，先是醫人得持針刺物，若是書吏得持筆墨，若剃髮人得畜剪刀子。」",
        "translation": "He told the Buddha for this reason, and he said, Now, I'll listen to the bhikṣus as they say, First, if a doctor obtains something to carry needles and thorns, or if a clergyman obtains writing brushes and ink, or if a shaver obtains a cut sword.",
        "source": "T24n1451_029:0346a10_9"
    },
    {
        "source_sentence": "緣處同前，現神變後人天歡悅，佛及苾芻多獲利養。",
        "translation": "The causal conditions are the same as before, and after the manifestation of the miraculous transformation, humans and gods rejoice, and buddhas and monks often benefit from it.",
        "source": "T24n1451_029:0346a13_0"
    },
    {
        "source_sentence": "爾時世尊為欲斷其利養過故，遂昇三十三天，於玉石殿上三月安居，近圓生樹為母說法，并餘天眾。",
        "translation": "It was then that the Bhagavān, wanting to end their gains and losses, ascended to the Trāyastriṃśa gods and stayed in the jade-stone hall for three months, preached the Dharma to his mother at the nearby circumscribed tree, along with the other heavenly beings.",
        "source": "T24n1451_029:0346a14_1"
    },
    {
        "source_sentence": "具壽大目連在逝多林而作安居。",
        "translation": "Guoshou Mahāmaudgalyāyana stayed at Jeta’s Grove and made his lodging there.",
        "source": "T24n1451_029:0346a16_2"
    },
    {
        "source_sentence": "是時四眾既無世尊，咸悉共詣大目連所，頭面禮足在一面坐。",
        "translation": "Without the Bhagavān, the fourfold assembly then all went to Mahāmaudgalyāyana and bowed their foreheads and feet while sitting at one side.",
        "source": "T24n1451_029:0346a17_3"
    },
    {
        "source_sentence": "尊者見來即為說法，隨機演暢示教利喜默然而住。",
        "translation": "Seeing the attendant, the venerable preached the Dharma for him and remained silent, explaining it as he wished.",
        "source": "T24n1451_029:0346a18_4"
    },
    {
        "source_sentence": "是時四眾各從座起，偏袒右肩合掌恭敬，白尊者曰：「大德頗聞，如來大師今於何處而作安居？」",
        "translation": "The fourfold assembly then rose from their seats, bared their right shoulders, joined their palms in respect, and said to the venerable, Great virtuous man, well-versed, where will the Tathāgata's great teacher now make his retreat?",
        "source": "T24n1451_029:0346a19_5"
    },
    {
        "source_sentence": "尊者答曰：「我聞佛往三十三天，於玉石殿上而作安居，近圓生樹為母說法。」",
        "translation": "The Venerable answered, I've heard that the Buddha went to the Trāyastriṃśa gods and made his retreat in the jade-stone hall of the thirty-three.",
        "source": "T24n1451_029:0346a21_6"
    },
    {
        "source_sentence": "是時四眾既得聞法，知世尊所在深生歡喜，禮足而去。",
        "translation": "Knowing where the World-honored One was, the fourfold assembly of bhikṣus were deeply delighted. Having heard the Dharma, they bowed their heads at his feet and departed.",
        "source": "T24n1451_029:0346a23_7"
    },
    {
        "source_sentence": "至安居竟四眾還來，禮尊者足在一面坐。",
        "translation": "When the fourfold assembly returned at the end of the retreat, they bowed their heads at the Venerable’s feet and sat to one side.",
        "source": "T24n1451_029:0346a24_8"
    },
    {
        "source_sentence": "尊者為說法已，大眾各起禮足白言：「大德！",
        "translation": "After the Bhagavān had taught the Dharma, the assembled people bowed their heads at their feet and said, Mañjuśrī!",
        "source": "T24n1451_029:0346a25_9"
    },
    {
        "source_sentence": "諸人久不見佛咸生渴仰，我等願欲奉見世尊。",
        "translation": "People have not seen the Buddha for a long time, and they all yearn to see him. We entreat you, O World-honored One!",
        "source": "T24n1451_029:0346a26_10"
    },
    {
        "source_sentence": "善哉大德！",
        "translation": "Excellent, great virtuous one!",
        "source": "T24n1451_029:0346a27_11"
    },
    {
        "source_sentence": "不憚勞者，願為我等至世尊處，傳我等言頂禮佛足，伏惟大師自一夏來，起居輕利無病少惱安樂住不？",
        "translation": "Those who don't have to worry, may they go to the Bhagavān's place for us and transmit our words to him, bowing their heads at the Buddha's feet. Suppose the great teacher has been here since one summer, so that he rises and lives in a light and peaceful place with no illness or affliction?",
        "source": "T24n1451_029:0346a28_12"
    },
    {
        "source_sentence": "復更為白贍：『部洲內所有四眾，久違聖顏咸希親奉。",
        "translation": "Again, he said to Jambudvīpa, 'All the four groups of people on the continent long disagreed with the noble appearance and wanted to serve them.",
        "source": "T24n1451_029:0346b01_13"
    },
    {
        "source_sentence": "我等四眾無有神通，能至三十三天禮世尊足親覲供養；",
        "translation": "We, the fourfold assembly, lacking supernatural powers, can go to the thirty-three celestial kingdoms to worship the World-honored One by bowing our foreheads at his feet.",
        "source": "T24n1451_029:0346b02_14"
    },
    {
        "source_sentence": "然彼天眾得來至此。",
        "translation": "Still, the gods can come here.",
        "source": "T24n1451_029:0346b03_15"
    },
    {
        "source_sentence": "願佛慈悲哀愍我等。』」",
        "translation": "May the Buddha have mercy and compassion for us.'",
        "source": "T24n1451_029:0346b04_16"
    },
    {
        "source_sentence": "時大目連默許其請，眾知許已禮辭而去。",
        "translation": "Mahāmaudgalyāyana then consented to his request by remaining silent, and the crowd knew they had accepted it, bowed their heads in respect, and departed.",
        "source": "T24n1451_029:0346b04_17"
    },
    {
        "source_sentence": "尊者觀知大眾去已，即入勝定，猶如壯士屈申臂頃，即於此沒至三十三天現，遙見世尊於玉石殿，為諸天眾無量無邊說微妙法。",
        "translation": "Knowing that the crowd had departed, the Venerable entered a superior concentration, just as if a strong man were to bend his arm and show up in the Trāyastriṃśa gods from this place. From a distance he saw the World-honored One teaching the subtle Dharma for the gods of the heavenly beings, without measure or limit, from the thirty-three:",
        "source": "T24n1451_029:0346b05_18"
    },
    {
        "source_sentence": "時大目連不覺微笑作如是念：「世尊至此諸天圍繞，猶如贍部四眾無邊。」",
        "translation": "Unconscious and smiling, Mahāmaudgalyāyana then had this thought, The Bhagavān arrives here surrounded by gods like the fourfold assembly of Jambudvīpa that has no limit.",
        "source": "T24n1451_029:0346b08_19"
    },
    {
        "source_sentence": "爾時世尊知大目連心之所念，告言：「目連！",
        "translation": "Knowing what Mahāmaudgalyāyana thought, the Bhagavān then addressed him, saying, Maudgalyāyana!",
        "source": "T24n1451_029:0346b10_20"
    },
    {
        "source_sentence": "此之大眾非自能來，皆由我力而有來去。」",
        "translation": "These masses of people can't come by themselves; they all come and go because of my power.",
        "source": "T24n1451_029:0346b11_21"
    },
    {
        "source_sentence": "是時目連既至佛所，禮雙足已退坐一面，普觀大眾白言：「世尊！",
        "translation": "When Maudgalyāyana arrived at the Buddha's place, he bowed his feet, withdrew, sat to one side, and surveyed the whole group of people, saying, Bhagavān!",
        "source": "T24n1451_029:0346b12_22"
    },
    {
        "source_sentence": "念此大眾甚奇希有，悉皆雲集。",
        "translation": "They thought that this assembly of monks was so extraordinary and rare that they all gathered together like clouds.",
        "source": "T24n1451_029:0346b13_23"
    },
    {
        "source_sentence": "由彼前身於佛、法、僧、清淨聖戒生不壞信深心成就，於彼命過來生於此。」",
        "translation": "It's because they had previously cultivated a profound faith in the Buddha, Dharma, saṃgha, and pure and noble precepts in their minds that they were born here.",
        "source": "T24n1451_029:0346b14_24"
    },
    {
        "source_sentence": "佛告目連：「如是，如是！",
        "translation": "The Buddha told Maudgalyāyana, So it is, so it is!",
        "source": "T24n1451_029:0346b16_25"
    },
    {
        "source_sentence": "此諸大眾，由彼前身於佛、法、僧、清淨聖戒起不壞信深心成就，於彼命過得來生此。」",
        "translation": "These masses of people will be born here because they had previously developed strong faith in the Buddha, Dharma, Saṃgha, and pure and noble precepts about the Buddha, Dharma, and Saṃgha.",
        "source": "T24n1451_029:0346b16_26"
    },
    {
        "source_sentence": "時天帝釋見佛世尊與大目連有所論說，即於佛前告大目連：「重敘其事，由其敬信三寶、清淨聖戒，廣說乃至得來生此。」",
        "translation": "Seeing what the Bhagavān and Mahāmaudgalyāyana had to discuss, Śakra Devānām-Indra addressed Mahāmaudgalyāyana in front of the Buddha, I'll recount this story because they respectfully believed in the Three Treasures and the pure and noble precepts, explaining them in detail until they were born here.",
        "source": "T24n1451_029:0346b18_27"
    },
    {
        "source_sentence": "復有天子告大目連：「重敘其事，廣說乃至來生於此。」",
        "translation": "Again, there was a celestial prince who told Mahāmaudgalyāyana, Recount this story and explain it in detail until he's born here in the future.",
        "source": "T24n1451_029:0346b21_28"
    },
    {
        "source_sentence": "復有天子從座而起，偏袒右肩合掌恭敬，白佛言：「世尊！",
        "translation": "Again, there was a celestial prince who rose from his seat, bared his right shoulder, joined his palms in respect, and said to the Buddha, Bhagavān!",
        "source": "T24n1451_029:0346b23_0"
    },
    {
        "source_sentence": "我由前身於佛深信，於彼命過來生於此。」",
        "translation": "It's because I had faith in the Buddha in my prior life that I was born here by relying on his life.",
        "source": "T24n1451_029:0346b24_1"
    },
    {
        "source_sentence": "復有餘天作如是語：「我由前身於法、於僧、於清淨聖戒深生淨信具足受持，於彼命過來生於此。」",
        "translation": "Again, there are other gods who say, In my previous life, I had deeply developed pure faith in the Dharma, the saṃgha, and the pure and noble precepts, fully upheld them, and was born here because of their lives.",
        "source": "T24n1451_029:0346b25_2"
    },
    {
        "source_sentence": "時有無量百千天眾，親於佛前悉皆證得預流果，各禮佛足隱而不現。",
        "translation": "Measureless hundreds of thousands of celestial beings then bowed at the Buddha's feet and remained hidden.",
        "source": "T24n1451_029:0346b27_3"
    },
    {
        "source_sentence": "爾時目連見眾去已，即從座起偏袒右肩，合掌向佛白言：「世尊！",
        "translation": "Seeing the crowd leaving, Maudgalyāyana rose from his seat, bared his right shoulder, joined his palms and said to the Buddha, Bhagavān!",
        "source": "T24n1451_029:0346b29_0"
    },
    {
        "source_sentence": "贍部洲中所有四眾，各並虔誠來至我所作如是語：『大德！",
        "translation": "The four groups of people in Jambudvīpa each came to me with devotion and said, 'O great virtuous one!",
        "source": "T24n1451_029:0346c01_1"
    },
    {
        "source_sentence": "我等久不見佛咸生渴仰，我等願欲奉見世尊。",
        "translation": "We haven't seen the Buddha for a long time, and we all become thirsty and yearn to see him.",
        "source": "T24n1451_029:0346c02_2"
    },
    {
        "source_sentence": "善哉大德！",
        "translation": "Excellent, great virtuous one!",
        "source": "T24n1451_029:0346c03_3"
    },
    {
        "source_sentence": "不憚勞者，願為我等至世尊處，傳我等言頂禮佛足，伏惟大師自一夏來，起居輕利無病少惱安樂住不？",
        "translation": "Those who don't have to worry, may they go to the Bhagavān's place for us and transmit our words to him, bowing their heads at the Buddha's feet. Suppose the great teacher has been here since one summer, so that he rises and lives in a light and peaceful place with no illness or affliction?",
        "source": "T24n1451_029:0346c04_0"
    },
    {
        "source_sentence": "我等四眾無有神通能往三十三天禮世尊足親覲供養，然彼諸天能來至此。』",
        "translation": "We four groups of people have no supernormal powers to go to the Trāyastriṃśa gods to venerate the Bhagavān's feet and make offerings to him, but those gods can come here.'",
        "source": "T24n1451_029:0346c06_1"
    },
    {
        "source_sentence": "善哉世尊！",
        "translation": "Excellent, Bhagavān!",
        "source": "T24n1451_029:0346c08_2"
    },
    {
        "source_sentence": "慈悲哀愍，從彼天處下贍部洲。」",
        "translation": "With compassion and pity, he descended from that heaven down to Jambudvīpa.",
        "source": "T24n1451_029:0346c08_3"
    },
    {
        "source_sentence": "作此白已，爾時世尊告目連曰：「汝今可往贍部洲中告諸四眾，滿彼七日已，佛從天處向贍部洲，於僧羯奢城清淨曠野烏曇跋羅樹邊而下。」",
        "translation": "After making this confession, the Bhagavān then addressed Maudgalyāyana, Now, you may go to Jambudvīpa and tell the four groups of people that after seven days had passed, the Buddha went from heaven to Jambudvīpa and came down by the side of the uḍumbara tree in the pure wilderness of the city of Saṃghâvāsa.",
        "source": "T24n1451_029:0346c09_4"
    },
    {
        "source_sentence": "時大目連聞佛語已，頂禮佛足即還入定，猶如壯士屈申臂頃，於三十三天沒贍部洲中出，告諸四眾：「滿此七日已，佛從天處來贍部洲烏曇跋羅樹邊而下。」",
        "translation": "After hearing the Buddha's words, Mahāmaudgalyāyana bowed his head at his feet and then returned to concentration, just as when a strong man bends his arm, he emerged from Jambudvīpa in the thirty-three gods and told the four groups of people, After seven days have passed, the Buddha came down from heaven on the side of the uḍumbara tree in Jambudvīpa.",
        "source": "T24n1451_029:0346c12_5"
    },
    {
        "source_sentence": "時諸四眾各持香花，往僧羯奢城。",
        "translation": "The fourfold assembly then each carried an incense flower and went to the city of Siṃhala.",
        "source": "T24n1451_029:0346c15_6"
    },
    {
        "source_sentence": "時彼城中所有人眾，聞佛將至皆大歡喜，淨除諸穢掃飾街衢，灑以香水名花遍布，幢旛繒蓋處處莊嚴，如歡喜園誠可愛樂，於一勝處敷妙高座企想如來。",
        "translation": "When all the people in that city heard that the Buddha was about to arrive, they all rejoiced greatly, purified themselves from their defilements, swept the streets and thoroughfares, sprinkled perfume with flowers named flowers, adorned everywhere with banners, pennants, canopies, and decorations, like the joyful park that's truly desirable, and spread out a marvelous high seat",
        "source": "T24n1451_029:0346c16_7"
    },
    {
        "source_sentence": "是時如來為三十三天眾，說當機法示教利喜已，即於此沒，將諸天眾至夜摩天為說法已，即於此沒，復將天眾至覩史多天為其說法，如是至於化樂、他化、自在、梵眾、梵輔、大梵、少光、無量光、光音、少淨、無量淨、遍淨、無雲、福生、廣果、無煩、無熱、善見、善現，至色究竟天皆為說法示教利喜已，即於此沒至善現天，如是向下乃至三十三天。",
        "translation": "The Tathāgata then taught the Dharma to the thirty-three gods, revealing it to them according to their capacities and enabling them to benefit and rejoice. Having thus taught the Dharma to these gods, the Tathāgata descended from this world and led the heavenly beings up to Yama Heaven to preach the Dharma for them. Having departed there, he also led the heavenly beings up",
        "source": "T24n1451_029:0346c20_8"
    },
    {
        "source_sentence": "是時帝釋白佛言：「世尊！",
        "translation": "Śakra then said to the Buddha, Bhagavān!",
        "source": "T24n1451_029:0346c27_9"
    },
    {
        "source_sentence": "今欲詣贍部洲？」",
        "translation": "Do you want to go to Jambudvīpa now?",
        "source": "T24n1451_029:0346c28_10"
    },
    {
        "source_sentence": "答言：「我去。」",
        "translation": "He replied, I'll go.",
        "source": "T24n1451_029:0346c28_11"
    },
    {
        "source_sentence": "白言：「為作神通？",
        "translation": "He said, For the sake of doing miraculous powers?",
        "source": "T24n1451_029:0346c28_12"
    },
    {
        "source_sentence": "為以足步？」",
        "translation": "Why do you walk with your feet?",
        "source": "T24n1451_029:0346c29_13"
    },
    {
        "source_sentence": "答言：「足步。」",
        "translation": "He replied, Step by step.",
        "source": "T24n1451_029:0346c29_14"
    },
    {
        "source_sentence": "帝釋即命巧匠天子曰：「汝應化作三道寶階，黃金、吠琉璃、蘇頗胝迦。」",
        "translation": "Śakra then summoned the skillful craftsman Devānām-Indra and said, You should transform yourself into a jeweled staircase of the three destinies, made of gold, vaiḍūrya, and sapphire.",
        "source": "T24n1451_029:0346c29_15"
    },
    {
        "source_sentence": "答言：「大善！」",
        "translation": "He replied, Very good!",
        "source": "T24n1451_029:0347a02_16"
    },
    {
        "source_sentence": "即便化作三種寶階。",
        "translation": "He then transformed himself into the three kinds of treasure staircases.",
        "source": "T24n1451_029:0347a02_17"
    },
    {
        "source_sentence": "世尊處中躡琉璃道，索訶世界主大梵天王於其右邊蹈黃金道，手執微妙白拂價直百千兩金，并色界諸天而為侍從。",
        "translation": "The Bhagavān was in the middle of the lapis lazuli path, and the great Brahmā king, lord of the sahā world, walked on the golden path to his right, holding a subtle white whisk worth hundreds of thousands of taels of gold in his hand, accompanied by the gods of the form realm.",
        "source": "T24n1451_029:0347a02_18"
    },
    {
        "source_sentence": "天帝釋於其左邊蹈頗胝迦道，手擎百支傘蓋價直百千兩金而覆世尊，并欲界諸天而為侍從。",
        "translation": "Śakra Devānām-Indra stepped to his left side on the path of the pāṭika, holding in his hand a hundred canopies worth one hundred thousand taels of gold that covered the Bhagavān and the gods of the realm of desire as their attendants.",
        "source": "T24n1451_029:0347a05_19"
    },
    {
        "source_sentence": "佛作是念：「我但步去者，恐外道見議：『沙門喬答摩以神通力往三十三天，見彼妙色心生愛著，神通即失足步而還。』",
        "translation": "The Buddha thought, I'm afraid a non-Buddhist would say, 'The ascetic Gautama goes to the Trāyastriṃśa gods with supernormal powers to see their marvelous form and becomes attached to it, and he loses his footing and returns back with supernormal powers.'",
        "source": "T24n1451_029:0347a07_20"
    },
    {
        "source_sentence": "若以神通徒煩天匠。",
        "translation": "Suppose he uses his supernormal powers to trouble the heavenly craftsman.",
        "source": "T24n1451_029:0347a10_21"
    },
    {
        "source_sentence": "我今宜可半以神通半為足步往贍部洲。」",
        "translation": "Now, it's better for me to use half a footstep of my supernormal powers to go to Jambudvīpa.",
        "source": "T24n1451_029:0347a10_22"
    },
    {
        "source_sentence": "爾時世尊循寶階下，去此十二踰善那，人氣上薰如死屍臭，令彼諸天不能鼻嗅。",
        "translation": "At the time, the Bhagavān was walking down the steps of the jeweled staircase twelve yojanas away from here, smelling like a dead corpse and causing the gods there to be unable to smell it with their noses.",
        "source": "T24n1451_029:0347a11_23"
    },
    {
        "source_sentence": "世尊知已化作牛頭旃檀香林，令氣芬馥聞者歡喜。",
        "translation": "The Bhagavān knew that he had transformed himself into an ox-head sandalwood forest of fragrance, causing his breath to be fragrant and those who heard it to rejoice.",
        "source": "T24n1451_029:0347a13_24"
    },
    {
        "source_sentence": "佛作是念：「若贍部洲男見天女、女見天男，情生愛染，由婬欲心極熾盛故，便毆熱血悶絕命終。",
        "translation": "The Buddha had this thought, Suppose a man in Jambudvīpa sees a goddess or a woman and a man in Jambudvīpa, and his feelings become defiled by craving, and because the mind of sexual desire is so intense that he beats, screams, burns, and dies.",
        "source": "T24n1451_029:0347a14_25"
    },
    {
        "source_sentence": "我今宜可以神通力令男見天男、女觀天女。",
        "translation": "Now, it's appropriate for me to use my supernormal powers to cause men to see the gods and women to observe the goddesses.",
        "source": "T24n1451_029:0347a16_26"
    },
    {
        "source_sentence": "如是作已，不令染愛擾嬈其心。」",
        "translation": "After doing so, he won't allow defilement and craving to disturb his mind.",
        "source": "T24n1451_029:0347a17_27"
    },
    {
        "source_sentence": "爾時具壽須菩提，在一樹下晝日閑居，遙見世尊諸天大眾恭敬圍遶，威德尊重從三十三天而來至此，便作是念：「所有此等大德諸天，悉皆辭佛當往天處，此諸人眾百年之中，並皆身死。",
        "translation": "It was then that Kauṣṭhila-Subhūti stayed at a tree and spent his days in seclusion. Seeing the Worldhonored One from afar, surrounded by an assembly of celestial beings respectfully surrounding him, with great dignity and veneration, coming from the thirty-three heavens to this place, he thought: All these gods of great virtue will leave the Buddha and go",
        "source": "T24n1451_029:0347a19_0"
    },
    {
        "source_sentence": "佛化緣盡亦復涅槃，斯等威嚴無不磨滅。",
        "translation": "When the conditions for Buddha's transformation are ended, he also returns to nirvāṇa, which is so authoritative that it doesn't cease without decay.",
        "source": "T24n1451_029:0347a23_1"
    },
    {
        "source_sentence": "善哉世尊！",
        "translation": "Excellent, Bhagavān!",
        "source": "T24n1451_029:0347a24_2"
    },
    {
        "source_sentence": "處處慇懃作如是語：『諸行無常，體恒變易。",
        "translation": "Everywhere they say, 'All conditioned things are impermanent, and their essence is constantly changing.",
        "source": "T24n1451_029:0347a24_3"
    },
    {
        "source_sentence": "生滅之法是可惡事。』",
        "translation": "The law of arising and ceasing is a bad thing.'",
        "source": "T24n1451_029:0347a25_4"
    },
    {
        "source_sentence": "我今於此深起厭心，於五取蘊觀察無常苦空無我。」",
        "translation": "Now, I've become deeply disillusioned with these and observed that the five aggregates of attachment are impermanent, painful, empty, and selfless.",
        "source": "T24n1451_029:0347a25_5"
    },
    {
        "source_sentence": "如是知已，以智金剛杵摧二十種有身見山，獲預流果得不壞信，即便速疾捨加趺坐，右膝著地合掌恭敬，遙禮世尊瞻仰而住。",
        "translation": "Known in this way, he struck down twenty kinds of mountains with the vajra of wisdom that looked like bodies. Having attained the fruit of stream-entry and gained unshakable faith, he quickly relinquished his cross-legged seat, knelt with his right knee on the ground, joined his palms in reverence, paid homage to the World-honored One from a distance,",
        "source": "T24n1451_029:0347a27_0"
    },
    {
        "source_sentence": "爾時嗢鉢羅苾芻尼作如是念：「佛從天上下贍部洲，作何方便我得最初禮世尊足？",
        "translation": "It was then that the monks and nuns of Kapilavastu thought, What method did the Buddha use to first bow his head at the feet of the Bhagavān from heaven down to Jambudvīpa?",
        "source": "T24n1451_029:0347b01_0"
    },
    {
        "source_sentence": "大眾皆集無地旋踵，若其直爾作苾芻尼形者，人皆見輕莫由進路，我今宜可現大神通。」",
        "translation": "The masses all gathered together without the ground following them, and if they straightforwardly took the form of a bhikṣuṇī, everyone would see that it's light and wouldn't have any way to advance, so now it's appropriate for me to show great supernormal abilities.",
        "source": "T24n1451_029:0347b02_1"
    },
    {
        "source_sentence": "即以自身化為輪王，七寶前導，九十九億軍眾圍遶，千子具足，微妙莊嚴如半月形，詣世尊處。",
        "translation": "He then transformed himself into a wheel-turning king, guided by the seven treasures, surrounded by an army of 9,900,000,000 troops, endowed with a thousand sons, subtly adorned in the shape of a crescent moon, he went to the place where the Worldhonored One was.",
        "source": "T24n1451_029:0347b04_2"
    },
    {
        "source_sentence": "時有無量億眾沙門婆羅門外道內道無邊四眾，悉皆影附，歎未曾有。",
        "translation": "At the time, there were measureless millions of ascetics, priests, non-Buddhists, and innumerable other groups of Buddhist practitioners, all cast their shadows and admired this unprecedented phenomenon.",
        "source": "T24n1451_029:0347b07_0"
    },
    {
        "source_sentence": "上持白蓋翊從雲奔，猶如白日放千光明，朗月澄輝出於星漢。",
        "translation": "The above-mentioned white canopy rises up from the clouds like the white sun shining a thousand rays of light, and the bright moon shines brilliantly as far as the starry sky.",
        "source": "T24n1451_029:0347b08_1"
    },
    {
        "source_sentence": "如是嚴飾壯麗難思至世尊所，大眾見已皆生希有，瞻仰忘疲各生異念：「何處得有如是國王軍容可愛，多是他方輪王帝主？」",
        "translation": "When he arrived at the Bhagavān's place with such adornment and beauty that was inconceivable, the masses saw him and all became rare, looked up to him and forgot, and each had this strange thought, Where could there be such a desirable appearance of a king or army of kings who were mostly other-worldly wheel-turning kings?",
        "source": "T24n1451_029:0347b10_0"
    },
    {
        "source_sentence": "既見是已各生求願：「如何令我得受斯樂？」",
        "translation": "Having seen this, they each made a request, How will I be able to experience this happiness?",
        "source": "T24n1451_029:0347b12_1"
    },
    {
        "source_sentence": "大眾開路令彼近前。",
        "translation": "The masses opened the road and caused them to approach him.",
        "source": "T24n1451_029:0347b13_2"
    },
    {
        "source_sentence": "爾時鄔陀夷苾芻在斯眾會，告諸人曰：「此非輪王，乃是嗢鉢羅苾芻尼，自現神通來禮佛足。」",
        "translation": "It was then that the monk Udayana, who was present in this congregation, told the people, This isn't a wheel-turning king; it's a nun named Upāli who shows her supernormal powers and comes to pay homage at the Buddha's feet.",
        "source": "T24n1451_029:0347b14_3"
    },
    {
        "source_sentence": "時眾問曰：「大德！",
        "translation": "The crowd then asked, Mañjuśrī!",
        "source": "T24n1451_029:0347b16_4"
    },
    {
        "source_sentence": "云何知是嗢鉢羅尼耶？」",
        "translation": "How do you know that it's a patched-robe?",
        "source": "T24n1451_029:0347b16_5"
    },
    {
        "source_sentence": "答曰：「嗢鉢羅花香氣芬馥，嗢鉢羅色舉眾同然，故知是彼現斯神變。」",
        "translation": "He answered, The fragrance of the blue lotus flower is so fragrant that the color of blue lotus raises the crowd in the same way, so it's known that this is the manifestation of their miraculous transformation.",
        "source": "T24n1451_029:0347b17_6"
    },
    {
        "source_sentence": "時苾芻尼既至佛所便攝神通，前禮佛足在一面住。",
        "translation": "When the bhikṣuṇī arrived at the Buddha's place, she then gathered her supernormal powers and bowed to his feet before she stood to one side.",
        "source": "T24n1451_029:0347b18_7"
    },
    {
        "source_sentence": "爾時世尊既安坐已，告嗢鉢羅尼曰：「汝今可去！",
        "translation": "After he had settled down, the Bhagavān then addressed Upāli, saying, Now, you may go!",
        "source": "T24n1451_029:0347b20_0"
    },
    {
        "source_sentence": "勿苾芻尼當我前立。",
        "translation": "Don't, bhikṣuṇī, stand in front of me.",
        "source": "T24n1451_029:0347b21_1"
    },
    {
        "source_sentence": "尼對大師現神通者是非理事。」",
        "translation": "The nun confronts the great master who shows his supernormal powers, which are neither right nor wrong.",
        "source": "T24n1451_029:0347b21_2"
    },
    {
        "source_sentence": "被佛訶已便詣一邊。",
        "translation": "After being reprimanded by the Buddha, he then went to one side.",
        "source": "T24n1451_029:0347b22_3"
    },
    {
        "source_sentence": "佛作是念：「尼對佛前現神通者，有如是過。",
        "translation": "The Buddha thought, This is what's wrong with a nun who manifests supernormal powers in front of the Buddha.",
        "source": "T24n1451_029:0347b22_4"
    },
    {
        "source_sentence": "彼制諸尼於大師前不現神力。」",
        "translation": "They restrain the nuns from manifesting their supernormal powers in front of the great master.",
        "source": "T24n1451_029:0347b23_5"
    },
    {
        "source_sentence": "告諸苾芻曰：「從今已後諸苾芻尼，不應於大師前而現神通，作者得越法罪。」",
        "translation": "He told the monks, From now on, the monks and nuns shouldn't show their supernormal powers in front of the great teacher; the author will be guilty of transgressing the Dharma.",
        "source": "T24n1451_029:0347b24_6"
    },
    {
        "source_sentence": "爾時大眾見此輪王有大威勢，心生願樂求生人道；",
        "translation": "At that time the great multitude of people saw this universal ruler with great power, and their hearts were filled with aspiration for enlightenment.",
        "source": "T24n1451_029:0347b27_0"
    },
    {
        "source_sentence": "或見諸天光明可愛，皆生願樂求往天中。",
        "translation": "Sometimes they see the gods' radiance delightful, and they all give rise to the desire to go to heaven.",
        "source": "T24n1451_029:0347b28_1"
    },
    {
        "source_sentence": "爾時世尊見斯事已，為欲遮其人天願故，隨彼機緣為說妙法，彼聞法已得豫流果，或一來果及不還果，或有出家斷諸煩惱獲阿羅漢果，或發聲聞菩提心者，或發獨覺菩提心者，或發無上大菩提心者，或發煗頂所有善根，或發中下忍心，皆令大眾歸信三寶。",
        "translation": "Seeing this, the Bhagavān wanted to obstruct their human and divine vows, so he taught the wonderful Dharma for them according to their abilities. Those who heard the teaching had already attained the fruit of stream-winner, or the fruit of once-returning and nonreturner, or those who renounced home and cut off all afflictions and obtained the fruit of arhatship. Some aroused the mind",
        "source": "T24n1451_029:0347b29_2"
    },
    {
        "source_sentence": "「設作轉輪王，　　或復生天上，",
        "translation": "“Suppose someone becomes a wheel-turning king or is reborn in heaven.",
        "source": "T24n1451_029:0347c06_0"
    },
    {
        "source_sentence": "　雖得於勝定，　　不如預流果。」",
        "translation": "Even though they attain superior concentration, they aren't as good as the fruit of stream-winner.",
        "source": "T24n1451_029:0347c06_0"
    },
    {
        "source_sentence": "爾時世尊即以此緣而說頌曰：爾時世尊為諸大眾示教利喜說妙法已，時諸苾芻咸皆有疑，請世尊曰：「何意具壽鄔陀夷聞嗢鉢羅香氣知是彼尼？」",
        "translation": "It was then that the Bhagavān spoke a verse for this reason, saying, After the Bhagavān had shown the masses the wonderful Dharma and taught it to benefit and delight them, the monks all had doubts and asked the Bhagavān, Why did Kauṣṭhila Udayana hear the fragrance of ambrosia and know that it was that nun?",
        "source": "T24n1451_029:0347c06_0"
    },
    {
        "source_sentence": "佛告諸苾芻：「非但今日聞香得知，於過去時亦曾聞香而知其事。",
        "translation": "The Buddha told the monks, Not only did he hear a fragrance today and know it, but he also heard a fragrance in the past and knew it.",
        "source": "T24n1451_029:0347c11_1"
    },
    {
        "source_sentence": "汝等應聽。",
        "translation": "You should listen.",
        "source": "T24n1451_029:0347c13_2"
    },
    {
        "source_sentence": "於過去世婆羅痆斯城有一商主，娶妻未久便即有娠。",
        "translation": "In a past life, there was a merchant lord in the city of Vārāṇasī who became pregnant soon after he married his wife.",
        "source": "T24n1451_029:0347c13_3"
    },
    {
        "source_sentence": "是時商主欲入大海求覓珍寶，告其妻曰：『賢首！",
        "translation": "The merchant lord then wanted to go into the ocean to search for treasures and told his wife, 'Good man!",
        "source": "T24n1451_029:0347c14_4"
    },
    {
        "source_sentence": "我向他方求妙寶貨，汝看家室宜可用心。』",
        "translation": "I'll go to another place to ask for a wonderful treasure, so please look at my house and pay attention.'",
        "source": "T24n1451_029:0347c15_5"
    },
    {
        "source_sentence": "答曰：『聖子！",
        "translation": "He replied, 'Noble child!",
        "source": "T24n1451_029:0347c16_6"
    },
    {
        "source_sentence": "若如是者我亦隨去。』",
        "translation": "If that's the case, I'll go along with them.'",
        "source": "T24n1451_029:0347c16_7"
    },
    {
        "source_sentence": "答曰：『誰當與汝共相供給？』",
        "translation": "He answered, 'Who will make offerings to you together?'",
        "source": "T24n1451_029:0347c17_8"
    },
    {
        "source_sentence": "彼便啼泣。",
        "translation": "He then cried out in tears.",
        "source": "T24n1451_029:0347c17_9"
    },
    {
        "source_sentence": "徒伴見悲，問言：『何故？』",
        "translation": "Seeing pity, the companions asked, 'Why is that?'",
        "source": "T24n1451_029:0347c18_10"
    },
    {
        "source_sentence": "答曰：『欲得共我一處同行，我不見隨為此渧淚。』",
        "translation": "He answered, 'If you want to be accompanied by me in one place, I won't see you weeping and wailing for this.'",
        "source": "T24n1451_029:0347c18_11"
    },
    {
        "source_sentence": "伴曰：『彼意欲去，何不隨之？』",
        "translation": "The companion said, 'That man wants to leave, so why don't you follow him?'",
        "source": "T24n1451_029:0347c19_12"
    },
    {
        "source_sentence": "答曰：『誰相供給？』",
        "translation": "He answered, 'Who will make offerings to you?'",
        "source": "T24n1451_029:0347c20_13"
    },
    {
        "source_sentence": "伴曰：『但令共去，我為相供。』",
        "translation": "The companion said, 'Let's just go together, and I'll make offerings to each other.'",
        "source": "T24n1451_029:0347c20_14"
    },
    {
        "source_sentence": "即便將去。",
        "translation": "He was about to leave.",
        "source": "T24n1451_029:0347c21_15"
    },
    {
        "source_sentence": "既入大海，被摩竭魚破其船舶。",
        "translation": "Having entered the great ocean, he was struck by a Maghā fish and destroyed his ship.",
        "source": "T24n1451_029:0347c21_16"
    },
    {
        "source_sentence": "是時商主因此命終，餘人亦死，其婦伶俜，遇得一版，幸因風便飄至海洲。",
        "translation": "As a consequence, the merchant lord died and all the other people also died. Their wives were so eloquent that they found a copy of the scripture; fortunately it was blown by wind and flowed to the sea island.",
        "source": "T24n1451_029:0347c22_17"
    },
    {
        "source_sentence": "有金翅鳥王於此居住，遂將此女以充妻室。",
        "translation": "A king of the garuḍas lived here, so they took this woman to be their wife.",
        "source": "T24n1451_029:0347c23_18"
    },
    {
        "source_sentence": "未久之間昔所懷娠，誕生一子顏貌端正。",
        "translation": "Soon afterward a prince, who had been pregnant in the past, gave birth to a handsome appearance.",
        "source": "T24n1451_029:0347c24_19"
    },
    {
        "source_sentence": "後於異時復生鳥子，形如金翅，其父遂亡。",
        "translation": "Then, at another time, a bird-child was born again, shaped like a golden wing, and its father died.",
        "source": "T24n1451_029:0347c25_20"
    },
    {
        "source_sentence": "是時眾鳥立子為王，母告子曰：『汝承父族身得為王。",
        "translation": "The birds then appointed the prince as king, and his mother told him, 'Inherit your father's family to become king.",
        "source": "T24n1451_029:0347c26_21"
    },
    {
        "source_sentence": "此是汝兄，今可將去向婆羅痆斯，於眾人中立為國主。』",
        "translation": "This is your brother, so now you can go to Vārāṇasī and establish yourself as the king among the people.'",
        "source": "T24n1451_029:0347c28_22"
    },
    {
        "source_sentence": "答言：『國母！",
        "translation": "He replied, 'Mother of the country!",
        "source": "T24n1451_029:0347c29_23"
    },
    {
        "source_sentence": "我當為立。』",
        "translation": "I will establish it for you.'",
        "source": "T24n1451_029:0347c29_24"
    },
    {
        "source_sentence": "時婆羅痆斯城現有國王名曰梵授，以法化世安隱豐樂，廣如餘說。",
        "translation": "At the time, there was a king named Brahmadatta in the city of Vārāṇasī who transformed the world with the Dharma and made it peaceful and prosperous, as explained in detail elsewhere.",
        "source": "T24n1451_029:0347c29_25"
    },
    {
        "source_sentence": "王於朝集在眾中坐，時金翅鳥王以雙足爪，擒其兩臂棄於大海，諸妙瓔珞莊嚴其兄，將至王城置師子座上。",
        "translation": "When the king was assembled in the morning and seated among the crowd, the king of the garuḍa birds grabbed his two arms with their feet and clasped them to the ocean. Adorned with exquisitely decorated jewelry, they were about to go to the royal city and place them on a lion's seat.",
        "source": "T24n1451_029:0348a02_26"
    },
    {
        "source_sentence": "告諸臣曰：『此是汝王，好當伏事，如有相違，還令汝等俱淪大海。』",
        "translation": "He told his ministers, 'This is your king, and you should well subdue him; if there's a contradiction, he'll cause you all to sink into the ocean.'",
        "source": "T24n1451_029:0348a04_27"
    },
    {
        "source_sentence": "人皆畏懼奉教而行，臣亦不敢告令斯事，眾人皆謂是梵授王。",
        "translation": "The people were all afraid and fearful to follow the instruction, and their ministers didn't dare tell them about this matter, and everyone thought it was King Brahmadatta.",
        "source": "T24n1451_029:0348a06_28"
    },
    {
        "source_sentence": "時王報金翅鳥曰：『於時時間，與我相見。』",
        "translation": "The king then reported to the garuḍa, saying, 'At the time, you were seeing me.'",
        "source": "T24n1451_029:0348a07_29"
    },
    {
        "source_sentence": "答言：『我來！』",
        "translation": "He replied, 'I'll come!'",
        "source": "T24n1451_029:0348a08_30"
    },
    {
        "source_sentence": "後於異時，王有母象月滿生兒，但現其頭身不能出，臣白王知，王曰：『牽入後宮，令諸宮人作實語盟，要使其速出應如是呪：「若除王外無男子者，宜令象子安隱生出。」』",
        "translation": "At another time, the king had a mother elephant whose moon was full and gave birth to a child, but she simply showed her head and body and couldn't get out; his ministers told the king who knew, 'The king said, 'Take it into the rear palace and cause the palace officials to make a true alliance, and if you want him to quickly escape, you should spell it this way: If there",
        "source": "T24n1451_029:0348a08_31"
    },
    {
        "source_sentence": "即便牽入。",
        "translation": "He then led them into it.",
        "source": "T24n1451_029:0348a12_32"
    },
    {
        "source_sentence": "時諸內人皆作盟誓：『若我除王更無人者，象子宜出。』",
        "translation": "The people inside the monastery then all made an alliance, saying, 'If I remove the king and there's no one else, it's better for the elephant to come out.'",
        "source": "T24n1451_029:0348a12_33"
    },
    {
        "source_sentence": "雖作此誓象極辛苦兒不能生，人皆大叫不知如何？",
        "translation": "Even though he made this vow, the elephant couldn't give birth to a child of extreme hardship, and everyone cried out in wonder.",
        "source": "T24n1451_029:0348a13_34"
    },
    {
        "source_sentence": "時有牧牛女宅去斯不遠，聞人叫聲問其所以：『何故宮內有大叫聲？』",
        "translation": "Not far from here, there was a cowherd's daughter who heard someone screaming and asked her why, 'Why is there a loud screaming sound inside the palace?'",
        "source": "T24n1451_029:0348a15_35"
    },
    {
        "source_sentence": "諸人具告，牧牛女曰：『我為盟要能使象兒安隱得出。』",
        "translation": "The people told him in detail, and the cowherd woman said, 'I'm an alliance that will enable the elephant to escape safely.'",
        "source": "T24n1451_029:0348a16_36"
    },
    {
        "source_sentence": "諸人聞已具告大臣，大臣白王遂喚入內，女即便以實語象前為要：『我從生來除一夫外無別男子，此事實者即願象子安隱產生。』",
        "translation": "After the people heard this, they told the ministers in detail, and the ministers then called the king into the palace, and the woman said to the elephant as a matter of principle, 'From my birth up until now, there's no separate man outside of me except for one husband; this is really true, so may the elephant-child peacefully be born.'",
        "source": "T24n1451_029:0348a17_37"
    },
    {
        "source_sentence": "作是語已象便生子而尾不出，女見微笑作如是語：『此之小過亦不相容。』",
        "translation": "After he said this, the elephant then gave birth to a child whose tail didn't come out, and when the woman saw it, she smiled and said, 'This minor flaw doesn't go together either.'",
        "source": "T24n1451_029:0348a20_38"
    },
    {
        "source_sentence": "內人問曰：『爾有何過？』",
        "translation": "The people inside asked, 'What's wrong with that?'",
        "source": "T24n1451_029:0348a22_39"
    },
    {
        "source_sentence": "答曰：『我於先時抱他孩子，其兒失尿流入我陰，當爾之時似如受樂，緣此小過尾不隨身。』",
        "translation": "He answered, 'In the past, when I was carrying another child, that child lost his urine and flowed into my aggregates, and at that point it looked like he was experiencing happiness because of this small error in his tail that didn't go along with him.'",
        "source": "T24n1451_029:0348a22_40"
    },
    {
        "source_sentence": "由斯實語尾亦隨出。",
        "translation": "As a result, the tail of this true teaching also follows.",
        "source": "T24n1451_029:0348a24_41"
    },
    {
        "source_sentence": "臣報王曰：『象子已生。』",
        "translation": "The minister reported to the king, 'The elephant boy has been born.'",
        "source": "T24n1451_029:0348a25_42"
    },
    {
        "source_sentence": "王曰：『誰能令出？』",
        "translation": "The king said, 'Who will allow him to leave?'",
        "source": "T24n1451_029:0348a25_43"
    },
    {
        "source_sentence": "于時大臣以事具白。",
        "translation": "The minister then explained the matter in detail.",
        "source": "T24n1451_029:0348a26_44"
    },
    {
        "source_sentence": "王遂傷曰：『我之宮女咸不貞良，唯牧牛人獨見清白。』",
        "translation": "The king then wound him, saying, 'None of my palace's women are pure and good; only the cowherd alone sees whiteness.'",
        "source": "T24n1451_029:0348a26_45"
    },
    {
        "source_sentence": "王曰：『喚牛女來我須自問。』",
        "translation": "The king said,'summoned the cow-maiden to come and ask me questions.'",
        "source": "T24n1451_029:0348a27_46"
    },
    {
        "source_sentence": "女至，王問：『汝以實言令象生子耶？』",
        "translation": "When the woman arrived, the king asked, 'Did you tell the elephant to give birth to a child with true words?'",
        "source": "T24n1451_029:0348a28_47"
    },
    {
        "source_sentence": "答曰：『如是。』",
        "translation": "He answered, 'So it is.'",
        "source": "T24n1451_029:0348a29_48"
    },
    {
        "source_sentence": "王作是念：『母既賢善，女亦應然。",
        "translation": "The king thought, 'Since my mother is good and good, so should she be.'",
        "source": "T24n1451_029:0348a29_49"
    },
    {
        "source_sentence": "我試問之。』",
        "translation": "I'll test him.'",
        "source": "T24n1451_029:0348b01_50"
    },
    {
        "source_sentence": "『汝有女不？』",
        "translation": "'Do you have a woman?'",
        "source": "T24n1451_029:0348b01_51"
    },
    {
        "source_sentence": "答王言：『有。』",
        "translation": "The king answered, 'Yes.'",
        "source": "T24n1451_029:0348b01_52"
    },
    {
        "source_sentence": "『其字如何？』",
        "translation": "'What's the word for that?'",
        "source": "T24n1451_029:0348b01_53"
    },
    {
        "source_sentence": "答名：『妙容。』",
        "translation": "The answer is called, 'A wonderful appearance.'",
        "source": "T24n1451_029:0348b02_54"
    },
    {
        "source_sentence": "『曾與人未？』",
        "translation": "'Haven't you ever given it to someone?'",
        "source": "T24n1451_029:0348b02_55"
    },
    {
        "source_sentence": "答：『未曾與。』",
        "translation": "Answer, 'I've never given it to you.'",
        "source": "T24n1451_029:0348b02_56"
    },
    {
        "source_sentence": "『阿母！",
        "translation": "'Ama!",
        "source": "T24n1451_029:0348b02_57"
    },
    {
        "source_sentence": "若如是者，當可與我。』",
        "translation": "If you do so, you can give it to me.'",
        "source": "T24n1451_029:0348b02_58"
    },
    {
        "source_sentence": "答：『隨王意。』",
        "translation": "Answer, 'Follow the king's wishes.'",
        "source": "T24n1451_029:0348b03_59"
    },
    {
        "source_sentence": "即辦儀禮娶入宮中。",
        "translation": "He then arranged his rituals and took him into the palace.",
        "source": "T24n1451_029:0348b03_60"
    },
    {
        "source_sentence": "王復念曰：『宮女非貞已虧盟誓，若令住此必行非法。』",
        "translation": "Again, the king thought, 'The palace ladies aren't chaste and have violated their promises; if they were to stay here, they would surely do something unlawful.'",
        "source": "T24n1451_029:0348b04_61"
    },
    {
        "source_sentence": "後因金翅鳥來，王即具告其事：『弟宜晝日將我婦去安海洲上，夜可持來。』",
        "translation": "Later, a golden-winged bird came and the king told him all about it, saying, 'Should you take my wife to Anāthapiṇḍada by day and bring her here at night?'",
        "source": "T24n1451_029:0348b05_62"
    },
    {
        "source_sentence": "答言：『善好。』",
        "translation": "He replied, 'Good and good.'",
        "source": "T24n1451_029:0348b06_63"
    },
    {
        "source_sentence": "遂便以婦付與金翅，如其言契晝去夜來。",
        "translation": "He then gave his wife to him as a gift of the golden wing, and according to his promise, he came back and forth day and night.",
        "source": "T24n1451_029:0348b07_64"
    },
    {
        "source_sentence": "「時彼海洲有好香花名曰去醫，婦便日日結此花鬘送與梵授。",
        "translation": "“At the time, there was a good fragrant flower in that ocean island named going to the doctor, and the woman then tied this flower together day after day and sent it to Brahmā.",
        "source": "T24n1451_029:0348b08_65"
    },
    {
        "source_sentence": "時婆羅痆斯有婆羅門子，因取樵木須往山林，見緊那羅神女，遂將婆羅門子入石龕中，便與交通共相得意。",
        "translation": "At the time, there was a Brāhmaṇa boy in Vārāṇasī who took the wood for firewood and had to go to the mountain forest. When he saw the goddess Kiṃnara, he led the Brāhmaṇa boy into a stone niche and sat cross-legged with her.",
        "source": "T24n1451_029:0348b09_66"
    },
    {
        "source_sentence": "其女若出求花果時，自既出已便將大石掩閉其門，人不能動。",
        "translation": "When the woman goes out to search for flowers and fruits, she puts a large rock in front of her door after emerging, but people won't move.",
        "source": "T24n1451_029:0348b12_0"
    },
    {
        "source_sentence": "後經多時誕生一子，其子行時身形速疾，遂與立字名為速疾。",
        "translation": "After a long period of time, a son was born, whose body and form were swift when he was walking, so he gave him the Sanskrit name quickly.",
        "source": "T24n1451_029:0348b13_1"
    },
    {
        "source_sentence": "父於子前每常歎說：『婆羅痆斯是好住處，汝今應知。』",
        "translation": "The father always praised his son in front of him, saying, 'The Vārāṇasī is a good place to live, as you should now know.'",
        "source": "T24n1451_029:0348b14_2"
    },
    {
        "source_sentence": "子問父曰：『父何處生？』",
        "translation": "The son asked his father, 'Where will he be born?'",
        "source": "T24n1451_029:0348b16_0"
    },
    {
        "source_sentence": "答曰：『婆羅痆斯是本生處。』",
        "translation": "He answered, 'The Vārāṇasī is the place where I was born in my previous life.'",
        "source": "T24n1451_029:0348b16_1"
    },
    {
        "source_sentence": "答曰：『若爾，何不還鄉？』",
        "translation": "He replied, 'If that's the case, why don't you return to your hometown?'",
        "source": "T24n1451_029:0348b17_2"
    },
    {
        "source_sentence": "父曰：『汝母若出求花果時，必將大石掩其穴口，我不能動，欲逃無路。』",
        "translation": "The father said, 'When your mother goes out to search for flowers and fruits, she'll surely cover her mouth with a large rock; I won't move, and there's no way to escape.'",
        "source": "T24n1451_029:0348b17_3"
    },
    {
        "source_sentence": "答曰：『我當為開。』",
        "translation": "He replied, 'I will open it for you.'",
        "source": "T24n1451_029:0348b19_4"
    },
    {
        "source_sentence": "父言：『大善！』",
        "translation": "The father said, 'Very good!'",
        "source": "T24n1451_029:0348b19_5"
    },
    {
        "source_sentence": "子便數數取石試之，乃至力成能排大石，報其父曰：『戶既得開共父逃走。』",
        "translation": "The son then repeatedly took the stone and tested it, up to the point where he was able to forcefully remove the large stone and reported to his father, saying, 'Now that the door has been opened, I'll run away with my father.'",
        "source": "T24n1451_029:0348b19_6"
    },
    {
        "source_sentence": "父曰：『汝母暫為花果須出，急即還來無由得去。",
        "translation": "The father said, 'For a moment, your mother needs to go out for flowers and fruits.",
        "source": "T24n1451_029:0348b21_7"
    },
    {
        "source_sentence": "若其於路逢見我者必定相害。』",
        "translation": "If they meet me on the road, they'll surely harm each other.'",
        "source": "T24n1451_029:0348b22_8"
    },
    {
        "source_sentence": "答曰：『我作方便令彼遲來。』",
        "translation": "He answered, 'I'll do my best to cause them to come late.'",
        "source": "T24n1451_029:0348b23_9"
    },
    {
        "source_sentence": "父言：『好事。』",
        "translation": "The father said, 'That's good.'",
        "source": "T24n1451_029:0348b23_10"
    },
    {
        "source_sentence": "母持果至，子便取噉嚼而吐出，母曰：『何意如是，豈不美耶？』",
        "translation": "When the mother came and brought the fruit, the child took it, chewed it, and vomited it out, and the mother said, 'What's the meaning of this, isn't it good?'",
        "source": "T24n1451_029:0348b23_11"
    },
    {
        "source_sentence": "答曰：『母懶遠去近覓苦果，誰復能飡？",
        "translation": "He replied, 'Mother Lazy is far away and near to search for the fruit of suffering, so who else can see it?'",
        "source": "T24n1451_029:0348b25_12"
    },
    {
        "source_sentence": "故須棄却。』",
        "translation": "Therefore, it must be discarded.'",
        "source": "T24n1451_029:0348b26_13"
    },
    {
        "source_sentence": "母曰：『若爾，我當遠去覓好果來。』",
        "translation": "The mother said, 'If that's the case, I'll go far away to find good fruit.'",
        "source": "T24n1451_029:0348b26_14"
    },
    {
        "source_sentence": "答曰：『善哉！』",
        "translation": "He replied, 'Good!'",
        "source": "T24n1451_029:0348b27_15"
    },
    {
        "source_sentence": "為覓好者，母至明日即便遠去，子報父曰：『今是走時，無宜更晚。』",
        "translation": "When he searched for a good place, his mother went away on the morning and the child reported to his father, 'Now is the time to leave; it's not advisable to go any further.'",
        "source": "T24n1451_029:0348b27_16"
    },
    {
        "source_sentence": "遂去其石父子俱逃，至婆羅痆斯父生之處。",
        "translation": "He then left the stone and fled with his father and son, arriving at the place where Vārāṇasī’s father had been born.",
        "source": "T24n1451_029:0348b28_17"
    },
    {
        "source_sentence": "其母來至見石室空虛，椎胸大哭。",
        "translation": "When his mother came, she saw the stone chamber empty in space and cried out in tears.",
        "source": "T24n1451_029:0348b29_18"
    },
    {
        "source_sentence": "隣人問曰：『何意啼耶？』",
        "translation": "The neighbor asked, 'What do you mean by wailing?'",
        "source": "T24n1451_029:0348c01_19"
    },
    {
        "source_sentence": "即以事具答。",
        "translation": "That is, he answers with a detailed explanation of the matter.",
        "source": "T24n1451_029:0348c02_0"
    },
    {
        "source_sentence": "隣人曰：『彼是人類走向人間，亦何事憂苦？』",
        "translation": "The neighbors said, 'That's a human being who walks among humans, so what's the matter of grief and suffering?'",
        "source": "T24n1451_029:0348c02_1"
    },
    {
        "source_sentence": "母曰：『我不憂此相與別離，但恨未曾教其一伎令得活命。』",
        "translation": "The mother said, 'I don't worry about separation from this characteristic, but I hate that I haven't taught him a trick to keep him alive.'",
        "source": "T24n1451_029:0348c03_2"
    },
    {
        "source_sentence": "彼便答曰：『我亦數向婆羅痆斯，若有活緣汝可與我，我若見時轉授於子。』",
        "translation": "He then answered, 'I've also repeatedly addressed the Vārāṇasī, saying, 'If there are living conditions, you can give it to me; if I see it, I'll turn it over to my child.'",
        "source": "T24n1451_029:0348c04_3"
    },
    {
        "source_sentence": "其母即以箜篌授之，報言：『姊妹！",
        "translation": "The mother then gave it to him with a bowl and reported, 'Sister!",
        "source": "T24n1451_029:0348c06_4"
    },
    {
        "source_sentence": "若見我兒面親付與。",
        "translation": "If you see my child's face, give it to him in person.",
        "source": "T24n1451_029:0348c07_0"
    },
    {
        "source_sentence": "語言：「汝可彈此箜篌以自活命，其第一絃指不應觸，若觸著者必有損害。」』",
        "translation": "He said, You can play this bowl for your own living, and the first string of fingers won't touch it; if you touch it, it will surely harm you.",
        "source": "T24n1451_029:0348c07_1"
    },
    {
        "source_sentence": "彼即持去。",
        "translation": "He then took it and departed.",
        "source": "T24n1451_029:0348c09_2"
    },
    {
        "source_sentence": "時婆羅門將兒速疾付師受學，師即教詔。",
        "translation": "The Brāhmaṇa then quickly entrusted the boy to his teacher and accepted him as a student, who instructed him.",
        "source": "T24n1451_029:0348c09_3"
    },
    {
        "source_sentence": "兒因暇日即疾入山採取薪木，遇見隣人，問速疾曰：『汝比何如？』",
        "translation": "When he had some spare time, the boy quickly went into the mountains to gather firewood and saw a neighbor who asked him quickly, 'What do you think?'",
        "source": "T24n1451_029:0348c10_4"
    },
    {
        "source_sentence": "答曰：『常受飢苦，知欲如何？』",
        "translation": "He answered, 'I'll always suffer from hunger and suffering, so what do you know about desire?'",
        "source": "T24n1451_029:0348c11_5"
    },
    {
        "source_sentence": "報曰：『汝母相憶泣涕恒流，何不往彼？』",
        "translation": "He replied, 'Your mother remembers that weeping tears always flow, so why don't you go there?'",
        "source": "T24n1451_029:0348c12_6"
    },
    {
        "source_sentence": "答曰：『彼是藥叉，誰能共住？』",
        "translation": "He answered, 'That's a yakṣa, so who can live together?'",
        "source": "T24n1451_029:0348c13_7"
    },
    {
        "source_sentence": "答曰：『若不能去，我今與汝活命之物，不得與他。』",
        "translation": "He answered, 'If you can't leave, I'll give you the property of your livelihood now; I won't give it to others.'",
        "source": "T24n1451_029:0348c13_8"
    },
    {
        "source_sentence": "答言：『不與。』",
        "translation": "He replied, 'I won't give it to you.'",
        "source": "T24n1451_029:0348c14_9"
    },
    {
        "source_sentence": "即授箜篌，報言：『彈此而為活命，其第一絃指不應觸，若觸著者必有損害。』",
        "translation": "He then gave it to the monk, who replied, 'Shouldn't touch this for his livelihood, or shouldn't touch the first string of fingers; if he touches it, there will surely be harm.'",
        "source": "T24n1451_029:0348c15_10"
    },
    {
        "source_sentence": "答曰：『善哉！",
        "translation": "He replied, 'Good!",
        "source": "T24n1451_029:0348c16_11"
    },
    {
        "source_sentence": "我如是作。』",
        "translation": "I thus did it.'",
        "source": "T24n1451_029:0348c17_12"
    },
    {
        "source_sentence": "即持箜篌至學堂處見諸同侶，彼便問曰：『汝來何遲？』",
        "translation": "When he went to the study hall and saw his fellow practitioners, he asked, 'Why are you late?'",
        "source": "T24n1451_029:0348c17_13"
    },
    {
        "source_sentence": "答曰：『見我母友授此箜篌。』",
        "translation": "He replied, 'See my mother's friend giving me this bowl.'",
        "source": "T24n1451_029:0348c18_14"
    },
    {
        "source_sentence": "諸人問曰：『汝能彈不？』",
        "translation": "The people asked, 'Can you snap it?'",
        "source": "T24n1451_029:0348c19_15"
    },
    {
        "source_sentence": "答言：『我能。』",
        "translation": "He replied, 'I can.'",
        "source": "T24n1451_029:0348c19_16"
    },
    {
        "source_sentence": "『汝可為彈，我等共聽。』",
        "translation": "'You may play it for us, and we'll listen together.'",
        "source": "T24n1451_029:0348c19_17"
    },
    {
        "source_sentence": "彼即為彈，初絃不觸，彼言：『何故不觸初絃？』",
        "translation": "That's when he plays and doesn't touch the first string, and he says, 'Why doesn't he touch the first string?'",
        "source": "T24n1451_029:0348c20_18"
    },
    {
        "source_sentence": "答言：『觸者必生過患。』",
        "translation": "He replied,'touches will surely give rise to faults and distress.'",
        "source": "T24n1451_029:0348c21_19"
    },
    {
        "source_sentence": "『汝今但觸，何過之有？』",
        "translation": "'Now, you're only touching, so what's wrong with that?'",
        "source": "T24n1451_029:0348c21_20"
    },
    {
        "source_sentence": "即便指觸，時諸學生不能自持，悉皆起舞，緣斯日晚至先生處。",
        "translation": "Even when he touched it, the students couldn't hold it themselves, and they all got up to dance, so they went to the teacher's place late at night.",
        "source": "T24n1451_029:0348c22_21"
    },
    {
        "source_sentence": "問曰：『何遲？』",
        "translation": "He asked, 'Why is it so late?'",
        "source": "T24n1451_029:0348c23_22"
    },
    {
        "source_sentence": "彼即具答，先生問曰：『汝能彈不？』",
        "translation": "He answered in detail, and the man asked, 'Can you snap it?'",
        "source": "T24n1451_029:0348c23_23"
    },
    {
        "source_sentence": "答曰：『我能。』",
        "translation": "He replied, 'I can.'",
        "source": "T24n1451_029:0348c24_24"
    },
    {
        "source_sentence": "『若爾，為彈一曲。』",
        "translation": "'If that's the case, it's for the sake of playing a song.'",
        "source": "T24n1451_029:0348c24_25"
    },
    {
        "source_sentence": "彼即為彈，初絃不觸，先生曰：『何意初絃不以指觸？』",
        "translation": "He then snapped it and didn't touch the first string, and the man said, 'Why doesn't the first string touch it with his fingers?'",
        "source": "T24n1451_029:0348c25_26"
    },
    {
        "source_sentence": "答言：『若觸恐有過生。』",
        "translation": "He replied, 'If I touch it, I'm afraid there's a mistake to be produced.'",
        "source": "T24n1451_029:0348c26_27"
    },
    {
        "source_sentence": "『汝但指觸，斯有何過？』",
        "translation": "'You simply point to touch, but what's wrong with that?'",
        "source": "T24n1451_029:0348c26_28"
    },
    {
        "source_sentence": "即便彈觸，先生及婦悉皆起舞不能自持，所居屋舍悉皆崩倒，瓮器之屬盡破無遺。",
        "translation": "Even when he touched it, the men and women all got up to dance and couldn't hold themselves; the houses where they lived collapsed, and all the parts of the pot and vessel were completely destroyed without remainder.",
        "source": "T24n1451_029:0348c27_29"
    },
    {
        "source_sentence": "先生大瞋，即扼其項驅出村外。",
        "translation": "With great anger, he grabbed his neck and drove him out of the village.",
        "source": "T24n1451_029:0348c29_30"
    },
    {
        "source_sentence": "既被斥逐隨處孤遊，唯彈箜篌而自活命。",
        "translation": "Having been driven away, they wandered about in  solitude and lived on their own.",
        "source": "T24n1451_029:0349a01_0"
    },
    {
        "source_sentence": "「時有五百商人齎持貨物欲入大海，諸人議曰：『眾事皆有，但無音樂，何以自娛？",
        "translation": "At the time, there were five hundred merchants carrying goods and wanting to enter the ocean, and the people agreed, saying, 'All things exist but there's no music, so why should we entertain ourselves?'",
        "source": "T24n1451_029:0349a02_0"
    },
    {
        "source_sentence": "至大海中誰解憂悶？』",
        "translation": "Who in the great ocean will be freed from sorrow and confusion?'",
        "source": "T24n1451_029:0349a03_1"
    },
    {
        "source_sentence": "一人報曰：『速疾婆羅門子解擘箜篌，可相隨去。』",
        "translation": "One person replied, 'Quickly, the Brāhmaṇa boy who dismounted from his robes can go along with you.'",
        "source": "T24n1451_029:0349a04_2"
    },
    {
        "source_sentence": "即將速疾共至舶中。",
        "translation": "They quickly went to the ship together.",
        "source": "T24n1451_029:0349a05_3"
    },
    {
        "source_sentence": "於大海內諸人告曰：『汝擘箜篌，共相娛樂。』",
        "translation": "The people inside the ocean told him, 'You break up a pot and enjoy it together.'",
        "source": "T24n1451_029:0349a05_4"
    },
    {
        "source_sentence": "即便為彈初弦不觸，諸人問曰：『何不觸弦。』",
        "translation": "He even played the first string without touching it, and people asked, 'Why don't you touch the string?'",
        "source": "T24n1451_029:0349a06_5"
    },
    {
        "source_sentence": "答曰：『若觸有過。』",
        "translation": "He answered, 'If there's a mistake in touching it.'",
        "source": "T24n1451_029:0349a07_6"
    },
    {
        "source_sentence": "彼言：『但觸，能作何過？』",
        "translation": "They say, 'What's wrong with touching only, and what's wrong with doing it?'",
        "source": "T24n1451_029:0349a08_7"
    },
    {
        "source_sentence": "即為彈觸，其時船舶跳躑海中遂便破碎，所有商人悉皆漂沒同時命過。",
        "translation": "The ship then jumped into the ocean and broke up, and all the merchants were floating and dying at the same time.",
        "source": "T24n1451_029:0349a08_8"
    },
    {
        "source_sentence": "唯有速疾一人得存，遇版逢風天緣命活，遂便吹至金翅鳥洲。",
        "translation": "Only a man with swift speed could survive, and when he encountered the wind gods and died, they blew up to the continent of the garuḍa.",
        "source": "T24n1451_029:0349a10_9"
    },
    {
        "source_sentence": "於一園中更無男子，唯見梵授王婦妙容女人，因與言交共行綢密。",
        "translation": "In one park, there were no men but the Brahmadatta king's wife and beautiful-looking woman, so they talked to each other and shared a secret conversation.",
        "source": "T24n1451_029:0349a11_10"
    },
    {
        "source_sentence": "晝日相見夜即別離。",
        "translation": "They see each other day and night, and they part at night.",
        "source": "T24n1451_029:0349a13_11"
    },
    {
        "source_sentence": "問言：『汝每於夜何處去來？』",
        "translation": "He asked, 'Where do you go and come at night?'",
        "source": "T24n1451_029:0349a13_12"
    },
    {
        "source_sentence": "彼既通懷悉皆具告，答言：『賢首！",
        "translation": "Having shared all of them in his mind, he told them all, and answered, Good man!",
        "source": "T24n1451_029:0349a14_13"
    },
    {
        "source_sentence": "若如是者，何不將我共至波羅痆斯？』",
        "translation": "If that's the case, why don't you take me to Vārāṇasī with you?'",
        "source": "T24n1451_029:0349a14_14"
    },
    {
        "source_sentence": "女答言：『好！",
        "translation": "The woman replied, 'Good!",
        "source": "T24n1451_029:0349a15_15"
    },
    {
        "source_sentence": "共汝俱行。』",
        "translation": "Together with you, we'll practice together.'",
        "source": "T24n1451_029:0349a16_16"
    },
    {
        "source_sentence": "問男：『何字？』",
        "translation": "He asked the man, 'What's the word?'",
        "source": "T24n1451_029:0349a16_17"
    },
    {
        "source_sentence": "『我名速疾。",
        "translation": "'I'm called quick and fast.",
        "source": "T24n1451_029:0349a16_18"
    },
    {
        "source_sentence": "汝復何名？』",
        "translation": "What's your name again?'",
        "source": "T24n1451_029:0349a16_19"
    },
    {
        "source_sentence": "『我字妙容。』",
        "translation": "'My name is Miaorong.'",
        "source": "T24n1451_029:0349a17_0"
    },
    {
        "source_sentence": "其女即便漸持小石，乃至與人輕重相似，斟酌得去即喚速疾，同乘金翅向婆羅痆斯。",
        "translation": "The woman then gradually carried a small stone, resembling the weight of a man's carriage, and as soon as she was judged to be able to leave, she called for an urgent call. They rode together with the golden-winged one toward Vārāṇasī.",
        "source": "T24n1451_029:0349a17_1"
    },
    {
        "source_sentence": "女曰：『爾可合眼，開即損睛。』",
        "translation": "The woman said, 'You can close your eyes and lose your eyesight if you open them.'",
        "source": "T24n1451_029:0349a19_2"
    },
    {
        "source_sentence": "欲至城邊聞人叫嚮，遂作是念：『髣髴欲至。』",
        "translation": "When he wanted to go to the city, he heard people wailing and thought, 'I'm about to reach it.'",
        "source": "T24n1451_029:0349a19_3"
    },
    {
        "source_sentence": "開眼瞻望，鳥急[夌*欠]風兩目便瞎。",
        "translation": "When he opened his eyes to look around, the bird suddenly [woke*owed] a gust of wind and both eyes went blind.",
        "source": "T24n1451_029:0349a20_4"
    },
    {
        "source_sentence": "于時妙容置之園內，自向王邊。",
        "translation": "The marvelous appearance was then placed inside the park and faced the king's side.",
        "source": "T24n1451_029:0349a21_5"
    },
    {
        "source_sentence": "後至春時名花盡發眾鳥哀鳴，王與宮人入園遊觀。",
        "translation": "In late spring the flower was called ‘depleted’ and all the birds cried in distress. The king and his courtiers entered the garden to enjoy a pleasure trip.",
        "source": "T24n1451_029:0349a22_6"
    },
    {
        "source_sentence": "「『風吹去醫花，　　芳香真可愛；",
        "translation": "The wind blows away the healing flower And its fragrance is truly lovely.",
        "source": "T24n1451_029:0349a23_7"
    },
    {
        "source_sentence": "　　猶如海洲上，　　與妙容同居。』",
        "translation": "It's like living on the ocean island with a marvelous appearance.'",
        "source": "T24n1451_029:0349a23_7"
    },
    {
        "source_sentence": "時妙容女亦在其中，速疾聞彼去醫花香，即為頌曰：「時梵授王聞此頌聲，勅內人曰：『遍可觀察誰作此聲？』",
        "translation": "When the woman of marvelous appearance was also there, she quickly heard the fragrance of the flowers from the doctor's flower and immediately composed a verse for him, saying, When King Brahmadatta heard the sound of this verse, he commanded the people inside to say, 'Perhaps you can examine who made this sound.'",
        "source": "T24n1451_029:0349a23_7"
    },
    {
        "source_sentence": "諸人答曰：『有患眼人作斯聲嚮。』",
        "translation": "The people answered, 'There's someone with troubled eyes who makes such a noise like this.'",
        "source": "T24n1451_029:0349a28_8"
    },
    {
        "source_sentence": "王便喚至問曰：『汝作頌聲？』",
        "translation": "The king then summoned him and asked, 'Have you composed a verse?'",
        "source": "T24n1451_029:0349a28_9"
    },
    {
        "source_sentence": "答言：『我作。』",
        "translation": "He replied, 'I did it.'",
        "source": "T24n1451_029:0349a29_10"
    },
    {
        "source_sentence": "『汝應更作，我試聽之。』",
        "translation": "'You should do it again, and I'll try to hear it.'",
        "source": "T24n1451_029:0349a29_11"
    },
    {
        "source_sentence": "便作是念：『豈非雅頌王樂聽聞，我為作之或容賞賜。』",
        "translation": "He then thought, 'Isn't that a fine verse that the king enjoys listening to? I might make it for him or allow him to be rewarded.'",
        "source": "T24n1451_029:0349b01_12"
    },
    {
        "source_sentence": "「『風吹去醫花，　　芳香真可愛；",
        "translation": "The wind blows away the healing flower And its fragrance is truly lovely.",
        "source": "T24n1451_029:0349b02_13"
    },
    {
        "source_sentence": "　　猶如海洲上，　　與妙容同居。』",
        "translation": "It's like living on the ocean island with a marvelous appearance.'",
        "source": "T24n1451_029:0349b02_13"
    },
    {
        "source_sentence": "即還說頌「時王問曰：『言海洲者，去斯遠近？』",
        "translation": "He then returned and spoke the verse, The king asked, 'When you say sea island, is it far away or near?'",
        "source": "T24n1451_029:0349b02_13"
    },
    {
        "source_sentence": "「『妙容所居處，　　去斯有百驛，",
        "translation": "'There are a hundred envoys leaving here from the place where Miaojong lives,",
        "source": "T24n1451_029:0349b05_14"
    },
    {
        "source_sentence": "　　超過於大海，　　有洲真可愛。』",
        "translation": "Beyond the ocean, there's a continent that's truly desirable.'",
        "source": "T24n1451_029:0349b05_14"
    },
    {
        "source_sentence": "「『汝頗曾聞見，　　我所愛樂者，",
        "translation": "Have you ever heard and seen that which pleases me?",
        "source": "T24n1451_029:0349b05_14"
    },
    {
        "source_sentence": "　　若是妙容身，　　汝可說其相。』",
        "translation": "If this is a body of marvelous appearance, you can explain its characteristics.'",
        "source": "T24n1451_029:0349b05_14"
    },
    {
        "source_sentence": "「『腰間有萬字，　　胸前有一旋，",
        "translation": "'There are ten thousand words between the waist, and there's a circle in front of your chest.",
        "source": "T24n1451_029:0349b05_14"
    },
    {
        "source_sentence": "　　常結去醫花，　　寄來與人主。』",
        "translation": "He always binds away the medicine flower and sends it to the owner of the person.'",
        "source": "T24n1451_029:0349b05_14"
    },
    {
        "source_sentence": "以頌答曰：「王既聞已，以頌答曰：「是時盲人以頌答曰：「王聞語已便作是念：『此人惡行，雖安海島亦復通私，既無所用，宜應與此忿恨居懷。』",
        "translation": "He answered in verse, After hearing this, the king answered in verse, The blind man then answered in verse, After hearing these words, the king thought, 'This person's bad behavior is such that even though he lives on a sea island, he can also be private, and since there's nothing to use, it's better to give them to this angry man.'",
        "source": "T24n1451_029:0349b05_14"
    },
    {
        "source_sentence": "「『妙容具瓔珞，　　付與此盲人，",
        "translation": "'The jewelry of marvelous features and ornaments, entrusted to this blind man,",
        "source": "T24n1451_029:0349b15_15"
    },
    {
        "source_sentence": "　　宜可遣乘驢，　　驅之出城郭。』",
        "translation": "It's advisable to send a donkey and drive it out of the city.'",
        "source": "T24n1451_029:0349b15_15"
    },
    {
        "source_sentence": "乃為頌曰：「于時二人被王擯出，盲人將婦隨處棲遑，至日暮時投大聚落，於空天廟權且居停。",
        "translation": "He composed a verse for them, saying: At that time the two men were driven out by the king’s anger. The blind men and their wives went to live in clusion; they entered a large village at sunset and stayed temporarily in the hollow shrine of the heavenly realm.",
        "source": "T24n1451_029:0349b15_15"
    },
    {
        "source_sentence": "時有群賊五百夜入此村，諸人覺知悉皆除剪，唯有賊帥一人，走入天廟反閉其戶。",
        "translation": "At the time, a group of thieves entered this village for five hundred nights, and when they realized that they had all been cleared away, only one of the thief's commanders went into the celestial shrine and closed its door.",
        "source": "T24n1451_029:0349b20_16"
    },
    {
        "source_sentence": "村人來問：『廟中者誰？』",
        "translation": "The villagers came and asked, 'Who's in the temple?'",
        "source": "T24n1451_029:0349b22_17"
    },
    {
        "source_sentence": "盲人答曰：『我是客人，非關賊類。』",
        "translation": "The blind man answered, 'I'm a guest, not a border thief.'",
        "source": "T24n1451_029:0349b23_18"
    },
    {
        "source_sentence": "諸人告曰：『若有賊者即宜遣出。』",
        "translation": "The people told him, 'If there are thieves, it's better to send them out.'",
        "source": "T24n1451_029:0349b24_0"
    },
    {
        "source_sentence": "是時賊帥報妙容曰：『汝何用此盲瞎人乎？",
        "translation": "The thief commander then reported to Miaorong, saying, 'Why are you using this blind man?'",
        "source": "T24n1451_029:0349b24_1"
    },
    {
        "source_sentence": "宜可出之與我同活。』",
        "translation": "It's better to leave it and live with me.'",
        "source": "T24n1451_029:0349b25_2"
    },
    {
        "source_sentence": "妙容便許，推出盲人。",
        "translation": "Marvelous features then agreed, pushing the blind man out.",
        "source": "T24n1451_029:0349b26_3"
    },
    {
        "source_sentence": "村人見之，遂斬其首。",
        "translation": "When the villagers saw him, they cut off his head.",
        "source": "T24n1451_029:0349b26_4"
    },
    {
        "source_sentence": "既至天曉，賊帥便將妙容而去，至一河邊無有船栰不能得渡。",
        "translation": "When dawn came, the thief's commander departed with his marvelous appearance and went to the edge of a river where there was no boat or bridge to cross.",
        "source": "T24n1451_029:0349b27_5"
    },
    {
        "source_sentence": "賊報婦曰：『賢首！",
        "translation": "The thief reported to the woman, 'Good man!",
        "source": "T24n1451_029:0349b28_6"
    },
    {
        "source_sentence": "河既汎漲無由共過。",
        "translation": "Since the river flourishes so widely, there's no way to share it.",
        "source": "T24n1451_029:0349b28_7"
    },
    {
        "source_sentence": "汝且住此洗浴身體，所有瓔珞我先將過，安彼岸已還來相取。』",
        "translation": "You must stay here to wash and bathe your body, and I'll first pass you the necklace that I have, and after settling on the other side, I'll come back and take it from you.'",
        "source": "T24n1451_029:0349b29_8"
    },
    {
        "source_sentence": "婦言：『隨意。』",
        "translation": "The woman said, 'As you wish.'",
        "source": "T24n1451_029:0349c01_9"
    },
    {
        "source_sentence": "便脫衣裳及諸瓔珞與其賊帥，入水而坐，即作是念：『豈不此人將我物走？』",
        "translation": "He then took off his robes, jewelry, and other jewelry, went to the thief's commander, entered the water, and sat down, and thought, 'Didn't this person walk with my things?'",
        "source": "T24n1451_029:0349c02_10"
    },
    {
        "source_sentence": "「『大河今汎漲，　　瓔珞汝持將；",
        "translation": "'Now that the great river is floating broadly, Yingluo, you bearer of the jewelry.",
        "source": "T24n1451_029:0349c03_11"
    },
    {
        "source_sentence": "　　我生如是心，　　恐汝今偷去。』",
        "translation": "I give rise to such a mind, and I'm afraid you'll steal it now.'",
        "source": "T24n1451_029:0349c03_11"
    },
    {
        "source_sentence": "「『汝夫無過令他殺，　　誰信於我有親心？",
        "translation": "'It's not wrong for you to cause others to kill, but who believes in my intimacy?",
        "source": "T24n1451_029:0349c03_11"
    },
    {
        "source_sentence": "　　所有瓔珞我持行，　　恐汝得便還傷我。』",
        "translation": "I'll carry the necklace in my hand, and I'm afraid you'll hurt me back if you get it.'",
        "source": "T24n1451_029:0349c03_11"
    },
    {
        "source_sentence": "遙告彼曰：「賊帥聞已以頌遙報「是時賊帥即便將物棄婦而行，其女遂即露體出河入草而住。",
        "translation": "From a distance, he told them, After hearing this, the thief's commander reported in verse from a distance, The thief's commander then abandoned his property and departed, and the woman then left the river with her body exposed, went into the grass, and stayed there.",
        "source": "T24n1451_029:0349c03_11"
    },
    {
        "source_sentence": "去此不遠有老野干，口銜肉臠循河而去。",
        "translation": "Not far from here there was an old wild boar not far away, carrying a load of flesh and bones in their mouths along the river.",
        "source": "T24n1451_029:0349c10_12"
    },
    {
        "source_sentence": "時有一魚從水踊出擲身岸上，野干見已棄所銜肉欲取其魚，魚入水中肉被鵄撥，兩事俱失垂耳而愁。",
        "translation": "A fish then emerged from the water and tossed its body onto the shore. Seeing this, the wild boar abandoned the meat it was carrying and wanted to take the fish.",
        "source": "T24n1451_029:0349c11_13"
    },
    {
        "source_sentence": "「『肉被鵄將去，　　魚復入河中；",
        "translation": "'The meat is about to be eaten, and the fish goes back into the river.",
        "source": "T24n1451_029:0349c13_14"
    },
    {
        "source_sentence": "　　兩事並皆亡，　　愁苦知何益？』",
        "translation": "Both things will all die, so what good is it to be sad and painful to know?'",
        "source": "T24n1451_029:0349c13_14"
    },
    {
        "source_sentence": "「『我不為歡笑，　　亦不作歌舞；",
        "translation": "'I won't laugh, and I won't sing or dance.",
        "source": "T24n1451_029:0349c13_14"
    },
    {
        "source_sentence": "　　誰在草叢中，　　以言相調戲？』",
        "translation": "Who's in a grass bush, playing with words and characteristics?'",
        "source": "T24n1451_029:0349c13_14"
    },
    {
        "source_sentence": "于時妙容於草叢內，遙見野干即說頌曰：「是時野干聞頌聲已，四顧而望不見一人，乃為頌曰：「妙容聞已，在草叢中報野干曰：『我是妙容。』",
        "translation": "When Miaorong was in the grass, he saw Nāgasena from a distance and spoke this verse, saying, After hearing the sound of the verse, Nāgasena looked around but didn't see anyone else, so he composed a verse for him, saying, After hearing it, Miaorong reported to Nāgasena in the grass, 'I am Miaorong.'",
        "source": "T24n1451_029:0349c13_14"
    },
    {
        "source_sentence": "野干聞聲即瞋罵曰：『汝罪過物，不自羞恥及來相調。』",
        "translation": "When the wild boar heard the sound, he became angry and scolded him, saying, 'Your sins are so great that you won't be ashamed of yourself or change your appearance.'",
        "source": "T24n1451_029:0349c21_15"
    },
    {
        "source_sentence": "「『舊聟已殺却，　　新夫將物行；",
        "translation": "'The old monk has already been killed, and the new one is about to leave.",
        "source": "T24n1451_029:0349c23_16"
    },
    {
        "source_sentence": "　　彼此無歸伏，　　愁怨草中鳴。』",
        "translation": "They don't subdue each other, and their grief and enmity are heard in the grass.'",
        "source": "T24n1451_029:0349c23_16"
    },
    {
        "source_sentence": "「『我今還本舍，　　貞心事一夫；",
        "translation": "'Now that I return to my original dwelling, I serve one man with a pure mind.",
        "source": "T24n1451_029:0349c23_16"
    },
    {
        "source_sentence": "　　恐損於宗族，　　不復作狂愚。』",
        "translation": "I'm afraid they'll harm their clan and won't again become crazy.'",
        "source": "T24n1451_029:0349c23_16"
    },
    {
        "source_sentence": "「『假使弶伽水，　　逆流烏鳥白；",
        "translation": "'Suppose the water of the Ganges River is turned against the flow of crows and birds.",
        "source": "T24n1451_029:0349c23_16"
    },
    {
        "source_sentence": "　　贍部生多羅，　　汝能專守一。",
        "translation": "Jambudvīpa and Uttarakuru, you can focus on maintaining one.",
        "source": "T24n1451_029:0349c23_16"
    },
    {
        "source_sentence": "　　烏與鵂鶹鳥，　　同共一樹棲；",
        "translation": "A crow and a bird of prey live together in the same tree.",
        "source": "T24n1451_029:0349c23_16"
    },
    {
        "source_sentence": "　　彼此相順從，　　汝能專守一。",
        "translation": "They are mutually compliant, so you can focus on one.",
        "source": "T24n1451_029:0349c23_16"
    },
    {
        "source_sentence": "　　假使蛇鼠狼，　　共在一穴遊；",
        "translation": "Suppose there are snakes, rats, and wolves roaming in the same cave.",
        "source": "T24n1451_029:0349c23_16"
    },
    {
        "source_sentence": "　　二物情相愛，　　汝能專守一。",
        "translation": "Two things are loved by emotions and characteristics, so you can focus on one.",
        "source": "T24n1451_029:0349c23_16"
    },
    {
        "source_sentence": "　　假使用龜毛，　　織成上妙服，",
        "translation": "If you use the hair of a tortoise, You'll wove a wonderful garment made of cloth.",
        "source": "T24n1451_029:0349c23_16"
    },
    {
        "source_sentence": "　　寒時可披著，　　汝乃有貞一。",
        "translation": "You should wear it when it's cold, for you have the same chastity.",
        "source": "T24n1451_029:0349c23_16"
    },
    {
        "source_sentence": "　　假使蚊蚋足，　　可使成樓觀，",
        "translation": "Suppose a gnatsnake with legs is allowed to become a tower.",
        "source": "T24n1451_029:0349c23_16"
    },
    {
        "source_sentence": "　　堅固不搖動，　　汝能專守一。",
        "translation": "Being firm and unshakable, you can concentrate on one.",
        "source": "T24n1451_029:0349c23_16"
    },
    {
        "source_sentence": "　　假使蓮花莖，　　作橋令眾渡，",
        "translation": "Suppose you were to make a bridge of lotus stems And cause the crowd to cross it.",
        "source": "T24n1451_029:0349c23_16"
    },
    {
        "source_sentence": "　　大象亦能過，　　汝能專守一。",
        "translation": "The great elephant can also pass, and you can guard only one of them.",
        "source": "T24n1451_029:0349c23_16"
    },
    {
        "source_sentence": "　　假使大海中，　　水中生火聚；",
        "translation": "Suppose a cluster of fire were to grow in the ocean water.",
        "source": "T24n1451_029:0349c23_16"
    },
    {
        "source_sentence": "　　諸人皆共向，　　汝能專守一。』",
        "translation": "All people are together headed for it, and you can focus on maintaining one.'",
        "source": "T24n1451_029:0349c23_16"
    },
    {
        "source_sentence": "以頌答曰：「妙容聞已即以頌答：「是時野干亦以頌答：「是時野干說是頌已告妙容曰：『我且作斯戲調之語，我能令汝還得依舊為國夫人，將何酬報？』",
        "translation": "He answered in verse, After hearing this, Miaorong answered in verse: At the time, Nāgârjuna also answered in verse, After saying this verse, Nāgârjuna told Miaorong, 'I'll make this kind of playful speech, and I can cause you to return to your status as a wife of the kingdom, so what will be the reward?'",
        "source": "T24n1451_029:0349c23_16"
    },
    {
        "source_sentence": "答曰：『知識若能令我還如昔者，我當日日供給肉食不使乏少。』",
        "translation": "He answered, 'Knower, if you can cause me to return as before, I'll offer me food and flesh every day so that I don't run short.'",
        "source": "T24n1451_029:0350a17_17"
    },
    {
        "source_sentence": "野干曰：『若如是者當用我言，應入弶伽河內令水至咽，合掌向日念天而住，我為報王。』",
        "translation": "The wild boar said, 'If that's the case, use my words to enter the Ganges River so that water reaches your throat and stands with joined palms facing the sun and mindful of the gods; I'll be the king of retribution.'",
        "source": "T24n1451_029:0350a18_18"
    },
    {
        "source_sentence": "野干便去，至王聞處出大叫聲，作如是語：『妙容今在弶伽河中洗心練行，宜疾喚取還入後宮。』",
        "translation": "When Nāgârjuna departed, the king heard a great wailing sound and said, 'Now that you've washed your mind and trained in the Ganges River, it's better to quickly summon him back to the rear palace.'",
        "source": "T24n1451_029:0350a20_19"
    },
    {
        "source_sentence": "王先曾學野干之語，既聞其事告大臣曰：『卿今宜往弶伽河邊，我聞妙容在彼勤苦改心易操，即可將來與我相見。』",
        "translation": "Formerly, the king had studied the words of a wild boar and when he heard them, he told his ministers, 'Now, why don't you go to the edge of the Ganges? I've heard that Marvelous Being is there, which is painful and easy to change your mind, so you can see me in the near future.'",
        "source": "T24n1451_029:0350a22_20"
    },
    {
        "source_sentence": "時諸大臣既見妙容，即以瓔珞衣服嚴身，將至王所。",
        "translation": "When the ministers saw his marvelous appearance, they adorned themselves with jewelry and clothing and went to the king.",
        "source": "T24n1451_029:0350a25_21"
    },
    {
        "source_sentence": "王見歡悅，還依昔日為大夫人，遂日日中常以好肉供給野干，後便即絕。",
        "translation": "Rejoicing at the sight, the king relied on what he had done in the past as his first wife and always offered good flesh to the wild boars day after day. Soon thereafter they were starved.",
        "source": "T24n1451_029:0350a26_22"
    },
    {
        "source_sentence": "是時野干還伺王宮相近之處，叫聲告曰：『妙容！",
        "translation": "The wild boar then returned to the nearby part of the king's palace and called out, 'Splendid appearance!",
        "source": "T24n1451_029:0350a28_23"
    },
    {
        "source_sentence": "汝不以肉共相供者，我當令王熟打於汝與舊不殊。』",
        "translation": "If you don't make offerings to each other with meat, I will cause the king to cook and beat you up like the old one.'",
        "source": "T24n1451_029:0350a29_24"
    },
    {
        "source_sentence": "夫人聞怖，即還給與野干之肉。",
        "translation": "The queen was frightened, so she gave him the flesh of a wild boar.",
        "source": "T24n1451_029:0350b01_25"
    },
    {
        "source_sentence": "汝等苾芻！",
        "translation": "You monks!",
        "source": "T24n1451_029:0350b02_26"
    },
    {
        "source_sentence": "勿作餘念。",
        "translation": "Don't think otherwise.",
        "source": "T24n1451_029:0350b02_27"
    },
    {
        "source_sentence": "往時妙容者即嗢鉢羅苾芻尼是，彼時速疾者即鄔陀夷是。",
        "translation": "The marvelous appearance of the past is Upāli Bhikṣuṇī, and the one who quickly arrives at that time is Udayana.",
        "source": "T24n1451_029:0350b02_28"
    },
    {
        "source_sentence": "往時聞去醫花香氣知是妙容，今聞嗢鉢花香知是彼尼。",
        "translation": "In the past, he heard the fragrance of a doctor's flower and knew it to be a marvelous appearance, but now he hears the fragrance of a bowl-shaped flower and knows it to be that nun.",
        "source": "T24n1451_029:0350b03_29"
    },
    {
        "source_sentence": "汝等苾芻如是應知，一切事業皆是串習以為因緣。」",
        "translation": "You monks, you should thus know that all things are conditioned by accumulation as causes and conditions.",
        "source": "T24n1451_029:0350b05_30"
    },
    {
        "source_sentence": "大眾聞已歡喜奉行。",
        "translation": "The great multitude of people who heard it rejoiced and carried it out.",
        "source": "T24n1451_029:0350b06_31"
    },
    {
        "source_sentence": "　度尼八敬法，　　尼欲依次坐；",
        "translation": "To liberate nuns from the eight kinds of reverence, The nuns want to take their seats in order.",
        "source": "T24n1451_029:0350b07_0"
    },
    {
        "source_sentence": "　二部事各殊，　　還俗尼不度。",
        "translation": "The affairs of the two sects are different, but the laymen and nuns aren't liberated.",
        "source": "T24n1451_029:0350b07_0"
    },
    {
        "source_sentence": "第六門第五子攝頌曰：佛在劫比羅城多根樹園。",
        "translation": "The fifth verse of the sixth aspect, the fifth son's collected verse, says, The Buddha was in the palm tree park with many roots in Kapilavastu.",
        "source": "T24n1451_029:0350b07_0"
    },
    {
        "source_sentence": "時大世主與五百釋女往詣佛所，禮雙足已退坐一面，佛即為說種種妙法示教利喜。",
        "translation": "The great lord of the world then went to the Buddha with five hundred Śākya maidens, bowed his head at his feet, and withdrew to sit at one side.",
        "source": "T24n1451_029:0350b10_1"
    },
    {
        "source_sentence": "爾時大世主既聞法已，深心歡慶從座而起，合掌向佛白言：「世尊！",
        "translation": "After hearing the teaching, the great lord of the world rose from his seat with profound joy and heart, joined his palms in respect, faced the Buddha, and said, Bhagavān!",
        "source": "T24n1451_029:0350b12_2"
    },
    {
        "source_sentence": "頗有女人於佛法中出家近圓成苾芻尼性，堅修梵行得第四沙門果不？」",
        "translation": "Could it be that a woman who leaves home in the Buddha's teaching and becomes a bhikṣuṇī by cultivating religious practice will attain the fruit of the fourth ascetic?",
        "source": "T24n1451_029:0350b14_3"
    },
    {
        "source_sentence": "佛言：「大世主！",
        "translation": "The Buddha said, Great lord of the world!",
        "source": "T24n1451_029:0350b15_4"
    },
    {
        "source_sentence": "汝應在家著白衣服，修諸梵行純一圓滿清淨無染，此能獲得長夜安隱利益快樂。」",
        "translation": "You should put on white clothes at home and cultivate the religious practices that are pure, perfect, pure, and undefiled, which will enable you to attain peace and happiness for a long time.",
        "source": "T24n1451_029:0350b16_5"
    },
    {
        "source_sentence": "如是三請佛皆不許，頂禮佛足奉辭而去。",
        "translation": "They bowed their heads at the Buddha’s feet, greeted him, and departed.",
        "source": "T24n1451_029:0350b17_6"
    },
    {
        "source_sentence": "爾時世尊著衣持鉢，出劫比羅城往販葦聚落。",
        "translation": "It was then that the Bhagavān put on his robes, took his bowl, left Kapilavastu, and went to the reed-selling village.",
        "source": "T24n1451_029:0350b19_0"
    },
    {
        "source_sentence": "時大世主聞佛去已，與五百釋女自剃頭髮，皆著赤色僧伽胝衣，常隨佛後隔宿而去。",
        "translation": "When the great lord of the world heard that the Buddha had departed, he shaved his hair and hair on his own with five hundred Śākya maidens, all wearing red-colored saṃghâṭī robes, always followed the Buddha's trail to the other side of the night.",
        "source": "T24n1451_029:0350b20_1"
    },
    {
        "source_sentence": "世尊到彼住相思林中，時大世主涉路疲極塵土蒙身，便詣佛所禮佛足已退坐一面。",
        "translation": "When the Bhagavān arrived there and stayed in the forest of Xiangsi, the great world lord was so exhausted that his body was covered with dust and dirt that he went to the Buddha, bowed at his feet, withdrew, and sat to one side.",
        "source": "T24n1451_029:0350b22_0"
    },
    {
        "source_sentence": "爾時世尊為說妙法示教利喜。",
        "translation": "It was then that the Bhagavān explained the marvelous teaching for them and showed them how to benefit and rejoice.",
        "source": "T24n1451_029:0350b23_1"
    },
    {
        "source_sentence": "時大世主既聞法已，從座而起合掌白言：「世尊！",
        "translation": "After hearing the teaching, the great lord of the world rose from his seat and joined his palms and said, Bhagavān!",
        "source": "T24n1451_029:0350b24_2"
    },
    {
        "source_sentence": "頗有女人於佛善說法律之中出家受近圓成苾芻尼性，堅修梵行證得第四沙門果不？」",
        "translation": "Could it be that a woman leaves home in the midst of the Buddha's well-explained teaching of the Dharma and receives the near perfect bhikṣuṇī nature, cultivates religious practice steadfastly, and realizes the fruit of the fourth ascetic?",
        "source": "T24n1451_029:0350b25_3"
    },
    {
        "source_sentence": "佛言：「大世主！",
        "translation": "The Buddha said, Great lord of the world!",
        "source": "T24n1451_029:0350b27_4"
    },
    {
        "source_sentence": "宜應剃髮著縵條衣，乃至盡形堅修梵行，純一圓滿清淨無染，此能獲得長夜安隱利益快樂。」",
        "translation": "It's advisable to shave your hair and put on a patched robe, cultivate the religious practice as firmly as you are in full bloom and pure and undefiled, and this will enable you to attain peace and happiness for a long time.",
        "source": "T24n1451_029:0350b28_0"
    },
    {
        "source_sentence": "如是三請佛皆不許。",
        "translation": "None of these three requests were accepted by the Buddha.",
        "source": "T24n1451_029:0350c01_1"
    },
    {
        "source_sentence": "時大世主知佛世尊頻請不許，遂於門外啼淚而立。",
        "translation": "Knowing that the Bhagavān had frequently invited but didn't allow them, the great lord of the world then stood outside the door with tears and weeping.",
        "source": "T24n1451_029:0350c01_2"
    },
    {
        "source_sentence": "時具壽阿難陀見已問言：「喬答彌！",
        "translation": "When Kauśāmbī Ānanda saw him, he asked, Gautama!",
        "source": "T24n1451_029:0350c02_3"
    },
    {
        "source_sentence": "因何啼泣而立？」",
        "translation": "Why did you stand up in tears?",
        "source": "T24n1451_029:0350c03_4"
    },
    {
        "source_sentence": "答言：「尊者！",
        "translation": "He replied, Venerable!",
        "source": "T24n1451_029:0350c03_5"
    },
    {
        "source_sentence": "我等女人，世尊不許出家作苾芻尼，是故啼泣。」",
        "translation": "We women, the Bhagavān won't allow us to leave home and become nuns, so weep.",
        "source": "T24n1451_029:0350c04_6"
    },
    {
        "source_sentence": "阿難陀報言：「喬答彌！",
        "translation": "Ānanda replied, Gautama!",
        "source": "T24n1451_029:0350c05_7"
    },
    {
        "source_sentence": "可住於此，我問如來。」",
        "translation": "You can stay here, and I'll ask the Tathāgata.",
        "source": "T24n1451_029:0350c05_8"
    },
    {
        "source_sentence": "爾時阿難陀詣世尊所，頂禮足已在一面立，白佛言：「世尊！",
        "translation": "Ānanda then went to the Bhagavān, bowed his head at his feet, stood to one side, and said to the Buddha, Bhagavān!",
        "source": "T24n1451_029:0350c06_9"
    },
    {
        "source_sentence": "頗有女人於佛善說法律中出家近圓成苾芻尼，堅修梵行證得第四沙門果不？」",
        "translation": "Could it be that a woman who leaves home in the Buddha's well-explained teaching of the Dharma and becomes a fully formed bhikṣuṇī by cultivating religious practice will attain the fruit of the fourth ascetic?",
        "source": "T24n1451_029:0350c07_10"
    },
    {
        "source_sentence": "佛言：「得有。」",
        "translation": "The Buddha said, It's possible.",
        "source": "T24n1451_029:0350c09_11"
    },
    {
        "source_sentence": "「若如是者，願許女人出家。」",
        "translation": "If that's the case, may a woman be allowed to leave home.",
        "source": "T24n1451_029:0350c09_12"
    },
    {
        "source_sentence": "佛言：「阿難陀！",
        "translation": "The Buddha said, Ānanda!",
        "source": "T24n1451_029:0350c10_13"
    },
    {
        "source_sentence": "汝今勿請女人於我善說法律之中出家近圓成苾芻尼性。",
        "translation": "'Now, don't invite a woman to leave home and become a bhikṣuṇī within me who well explains the teaching of the Dharma.",
        "source": "T24n1451_029:0350c10_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1451_029:0350c11_15"
    },
    {
        "source_sentence": "若許女人為出家者，佛法不久住。",
        "translation": "If a woman is allowed to leave home, the Buddha's teaching won't last long.",
        "source": "T24n1451_029:0350c12_16"
    },
    {
        "source_sentence": "譬如人家男少女多，即被惡賊破其家宅。",
        "translation": "It's like a house full of men and women who are attacked by bad thieves and break into their homes.",
        "source": "T24n1451_029:0350c12_17"
    },
    {
        "source_sentence": "女人出家破壞正法，亦復如是。",
        "translation": "So it is with a woman who leaves home and disrupts the right teaching.",
        "source": "T24n1451_029:0350c13_18"
    },
    {
        "source_sentence": "又復阿難陀！",
        "translation": "Again, Ānanda!",
        "source": "T24n1451_029:0350c14_19"
    },
    {
        "source_sentence": "如作田家苗稼成熟，忽被風雨霜雹所損。",
        "translation": "It's like when a crop grows at a farm and its seeds are ripened but suddenly damaged by wind, rain, frost, hail, and hail.",
        "source": "T24n1451_029:0350c14_20"
    },
    {
        "source_sentence": "女人出家損壞正法，亦復如是。",
        "translation": "So it is with a woman who leaves home and damages the right teaching.",
        "source": "T24n1451_029:0350c15_21"
    },
    {
        "source_sentence": "又復阿難陀！",
        "translation": "Again, Ānanda!",
        "source": "T24n1451_029:0350c16_22"
    },
    {
        "source_sentence": "如甘蔗田成熟之時，遭赤節病便被損壞無有遺餘。",
        "translation": "It's like a sugarcane field that's ripe when it's afflicted with a disease of the red knuckle and then damaged without remainder.",
        "source": "T24n1451_029:0350c16_23"
    },
    {
        "source_sentence": "若聽女人出家，損壞正法不得久住速當滅盡，亦復如是。」",
        "translation": "If someone hears a woman leave home and breaks the right teaching, they won't be allowed to stay for a long time or quickly cease, so it's likewise.",
        "source": "T24n1451_029:0350c17_24"
    },
    {
        "source_sentence": "具壽阿難陀復白佛言：「是大世主於世尊處誠有大恩，佛母命終乳養至大，豈不世尊慈悲攝受？」",
        "translation": "Again, Kauṣṭhila Ānanda said to the Buddha, Didn't the Bhagavān truly have great kindness in the place of the Bhagavān when the Buddha's mother died and nursed him as a great milk bearer, or did he not receive it with compassion from the Bhagavān?",
        "source": "T24n1451_029:0350c19_25"
    },
    {
        "source_sentence": "佛告阿難陀：「實有斯事，於我有恩我已報訖，由因我故得知三寶，歸佛法僧受五學處，於四諦理無復疑惑，得預流果當盡苦際證會無生。",
        "translation": "The Buddha told Ānanda, It's true that there's a case where I've shown kindness to me and I've already repaid it, because of which I've learned the three treasures, returned to the Buddha, Dharma, and saṃgha, accepted the five places of training, had no doubts about the principle of the four truths, and attained the fruit of pre-flow, which will end suffering",
        "source": "T24n1451_029:0350c21_26"
    },
    {
        "source_sentence": "如是之恩更為難報，非衣食等可相比喻。」",
        "translation": "Such kindness is even more difficult to repay, and it's not comparable to such things as clothing and food.",
        "source": "T24n1451_029:0350c24_27"
    },
    {
        "source_sentence": "爾時世尊告阿難陀曰：「汝為女人，求請出家成苾芻尼者，我今為制八尊敬法，盡壽修行不得違越。",
        "translation": "It was then that the Bhagavān addressed Ānanda, You're a woman who asks to leave home and become a bhikṣuṇī, and now I've established eight rules of veneration for you, so you won't violate them when you cultivate it for the rest of your life.",
        "source": "T24n1451_029:0350c25_28"
    },
    {
        "source_sentence": "我此所制如種田人，夏末秋初河渠之處，堅修隄堰不使水流，溉灌田苗隨處充足，八尊敬法亦復如是。",
        "translation": "I regulate it like a sower. At the end of summer and at the beginning of autumn, wherever there is a river or ditch, I firmly construct an irrigation system that keeps water from flowing; irrigate and irrigate all the fields with plenty of seedlings in every place. The same applies to the eight kinds of reverence for the Dharma.",
        "source": "T24n1451_029:0350c27_29"
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T24n1451_029:0351a01_0"
    },
    {
        "source_sentence": "阿難陀！",
        "translation": "Ānanda!",
        "source": "T24n1451_029:0351a01_1"
    },
    {
        "source_sentence": "諸苾芻尼，當從苾芻求出家受近圓成苾芻尼性，此是最初敬法。",
        "translation": "A bhikṣuṇī should seek to leave home from a bhikṣu and accept the near-complete bhikṣuṇī-nature, which is the first method of reverence.",
        "source": "T24n1451_029:0351a01_2"
    },
    {
        "source_sentence": "事不應違，乃至盡形諸苾芻尼當勤修學。",
        "translation": "The matter shouldn't be disobeyed, and even monks and nuns in full form should diligently cultivate it.",
        "source": "T24n1451_029:0351a02_3"
    },
    {
        "source_sentence": "「阿難陀！",
        "translation": "Ānanda!",
        "source": "T24n1451_029:0351a04_0"
    },
    {
        "source_sentence": "半月半月當從苾芻求請教授，此是第二敬法。",
        "translation": "For half a month or half a month, he'll ask the monk to teach him, which is the second method of reverence.",
        "source": "T24n1451_029:0351a04_1"
    },
    {
        "source_sentence": "事不應違，乃至盡形當勤修學。",
        "translation": "The matter shouldn't be disobeyed, and he should diligently cultivate it up to the end of his life.",
        "source": "T24n1451_029:0351a05_2"
    },
    {
        "source_sentence": "「阿難陀！",
        "translation": "Ānanda!",
        "source": "T24n1451_029:0351a05_3"
    },
    {
        "source_sentence": "無苾芻處不得安居，此是第三敬法。",
        "translation": "The absence of a monk's place where he can't live in peace is the third method of reverence.",
        "source": "T24n1451_029:0351a06_4"
    },
    {
        "source_sentence": "事不應違，乃至盡形當勤修學。",
        "translation": "The matter shouldn't be disobeyed, and he should diligently cultivate it up to the end of his life.",
        "source": "T24n1451_029:0351a06_5"
    },
    {
        "source_sentence": "「阿難陀！",
        "translation": "Ānanda!",
        "source": "T24n1451_029:0351a08_0"
    },
    {
        "source_sentence": "苾芻尼不得詰問苾芻，憶念苾芻所有過失，謂毀戒、見、威儀、正命。",
        "translation": "A monk or nun who doesn't question a monk and remembers the monk's faults, which are violations of the precepts, views, mannerisms, and right livelihood.",
        "source": "T24n1451_029:0351a08_1"
    },
    {
        "source_sentence": "阿難陀！",
        "translation": "Ānanda!",
        "source": "T24n1451_029:0351a09_2"
    },
    {
        "source_sentence": "若苾芻尼見苾芻戒見儀命有毀犯處，不應詰責，苾芻見尼有毀犯處應為詰責。",
        "translation": "If a monk or nun sees that there's a violation of the monk's precepts and conduct, they shouldn't be disciplined, and a monk or nun sees that there's a violation of the nun's precepts and conduct, he or she should be disciplined.",
        "source": "T24n1451_029:0351a09_3"
    },
    {
        "source_sentence": "阿難陀！",
        "translation": "Ānanda!",
        "source": "T24n1451_029:0351a11_4"
    },
    {
        "source_sentence": "此是第四敬法。",
        "translation": "This is the fourth method of reverence.",
        "source": "T24n1451_029:0351a11_5"
    },
    {
        "source_sentence": "事不應違，乃至盡形當勤修學。",
        "translation": "The matter shouldn't be disobeyed, and he should diligently cultivate it up to the end of his life.",
        "source": "T24n1451_029:0351a12_6"
    },
    {
        "source_sentence": "「阿難陀！",
        "translation": "Ānanda!",
        "source": "T24n1451_029:0351a12_7"
    },
    {
        "source_sentence": "苾芻尼不得罵詈瞋恚訶責苾芻，苾芻於尼得為此事，此是第五敬法。",
        "translation": "A bhikṣuṇī mustn't scold or angrily rebuke a bhikṣu, and a bhikṣu can do so for a bhikṣuṇī; this is the fifth method of respect.",
        "source": "T24n1451_029:0351a13_8"
    },
    {
        "source_sentence": "事不應違，乃至盡形當勤修學。",
        "translation": "The matter shouldn't be disobeyed, and he should diligently cultivate it up to the end of his life.",
        "source": "T24n1451_029:0351a14_9"
    },
    {
        "source_sentence": "「阿難陀！",
        "translation": "Ānanda!",
        "source": "T24n1451_029:0351a16_0"
    },
    {
        "source_sentence": "若苾芻尼，雖受近圓已經百歲，若見新受近圓苾芻，應當尊重合掌迎接恭敬頂禮，此是第六敬法。",
        "translation": "If a bhikṣuṇī has received the near-complete precepts for a hundred years, and if he sees a newly received near-complete preceptor, he or she should venerate, join their palms, greet, respect, and bow in homage. This is the sixth method of reverence.",
        "source": "T24n1451_029:0351a16_1"
    },
    {
        "source_sentence": "事不應違，乃至盡形當勤修學。",
        "translation": "The matter shouldn't be disobeyed, and he should diligently cultivate it up to the end of his life.",
        "source": "T24n1451_029:0351a18_2"
    },
    {
        "source_sentence": "「阿難陀！",
        "translation": "Ānanda!",
        "source": "T24n1451_029:0351a20_0"
    },
    {
        "source_sentence": "苾芻尼若犯眾教法者，應二眾中半月行摩那[卑*也]，此是第七敬法。",
        "translation": "If a monk or nun violates the teaching of the congregation, he or she should practice manas [pi*ya] for half a month among the two congregations, which is the seventh method of reverence.",
        "source": "T24n1451_029:0351a20_1"
    },
    {
        "source_sentence": "事不應違，乃至盡形當勤修學。",
        "translation": "The matter shouldn't be disobeyed, and he should diligently cultivate it up to the end of his life.",
        "source": "T24n1451_029:0351a21_2"
    },
    {
        "source_sentence": "「阿難陀！",
        "translation": "Ānanda!",
        "source": "T24n1451_029:0351a23_0"
    },
    {
        "source_sentence": "若苾芻尼夏安居已，於二眾中以三事見聞疑作隨意事，此是第八敬法。",
        "translation": "If a monk or nun, after the summer retreat, does anything he or she wishes to do with three things in two groups of people who see or hear doubts, this is the eighth method of reverence.",
        "source": "T24n1451_029:0351a23_1"
    },
    {
        "source_sentence": "事不應違，乃至盡形當勤修學。」",
        "translation": "The things shouldn't be disobeyed, and they should diligently cultivate them up to the end of their form.",
        "source": "T24n1451_029:0351a24_2"
    },
    {
        "source_sentence": "根本說一切有部毘奈耶雜事卷第二十九",
        "translation": "Mūlasarvâstivāda-vinaya miscellaneous works of the Sarvâstivāda school, vol. 29",
        "source": "T24n1451_029:0351a26_0"
    }
]