[
    {
        "source_sentence": "毘尼母經卷第一",
        "translation": "*Mother of the Vinaya, Volume 1",
        "source": "T24n1463_001:0801a03_0"
    },
    {
        "source_sentence": "失譯人名今附秦錄",
        "translation": "The names of the lost translators are now appended to the Qin records.",
        "source": "T24n1463_001:0801a05_0"
    },
    {
        "source_sentence": "　母義今當說，　　汝等善聽之，",
        "translation": "The meaning of mother shall now be explained. Listen attentively!",
        "source": "T24n1463_001:0801a06_0"
    },
    {
        "source_sentence": "　是中文雖略，　　廣攝毘尼義。",
        "translation": "Although the Chinese is abbreviated, it broadly includes the meaning of vinaya.",
        "source": "T24n1463_001:0801a07_0"
    },
    {
        "source_sentence": "　依初事演說，　　智慧者當知，",
        "translation": "The exposition of the first thing that is relied upon, should be known by the wise.",
        "source": "T24n1463_001:0801a08_0"
    },
    {
        "source_sentence": "　一切經要藏，　　皆總在此中。",
        "translation": "All the essential collections of scriptures Are collected here.",
        "source": "T24n1463_001:0801a09_0"
    },
    {
        "source_sentence": "　律藏外諸義，　　母經中可得，",
        "translation": "The meanings outside the Vinaya can be found in the mother scriptures.",
        "source": "T24n1463_001:0801a10_0"
    },
    {
        "source_sentence": "　律義入此經，　　如眾流入海。",
        "translation": "The meaning of the Vinaya enters this sūtra, just as the many streams enter the ocean.",
        "source": "T24n1463_001:0801a11_0"
    },
    {
        "source_sentence": "　毘尼外諸義，　　如母經中得，",
        "translation": "The meanings outside the Vinaya are found in the mother sūtra.",
        "source": "T24n1463_001:0801a12_0"
    },
    {
        "source_sentence": "　一切諸經義，　　隨意皆能解。",
        "translation": "The meanings of all the scriptures They can understand as they wish.",
        "source": "T24n1463_001:0801a13_0"
    },
    {
        "source_sentence": "　律能滅疑惑，　　如眾經定說，",
        "translation": "Vinaya is able to extinguish doubt and perplexity. As the scriptures definitely say:",
        "source": "T24n1463_001:0801a14_0"
    },
    {
        "source_sentence": "　佛所制諸戒，　　皆在此經中。",
        "translation": "All the precepts established by the Buddha Are found in this sutra.",
        "source": "T24n1463_001:0801a15_0"
    },
    {
        "source_sentence": "問曰：「何故名母經？」",
        "translation": "He asked, Why is it called the mother sūtra?",
        "source": "T24n1463_001:0801a16_0"
    },
    {
        "source_sentence": "智者說曰：「此經能滅憍慢解煩惱縛，能使眾生盡諸苦際畢竟涅槃，故名母經。",
        "translation": "Zhizhe said, This sūtra can extinguish the afflictive bond of conceit and liberate sentient beings from the bond of affliction and cause them to end all suffering and ultimately attain nirvāṇa, which is why it's called the mother sūtra.",
        "source": "T24n1463_001:0801a16_1"
    },
    {
        "source_sentence": "毘尼者，名滅滅諸惡法，故名毘尼。",
        "translation": "Vinaya refers to the cessation of bad dharmas, which is why it's called vinaya.",
        "source": "T24n1463_001:0801a18_2"
    },
    {
        "source_sentence": "今當說母經義。",
        "translation": "Now, we'll explain the meaning of the mother sūtra.",
        "source": "T24n1463_001:0801a19_0"
    },
    {
        "source_sentence": "母經義者，能決了定義，不違諸經所說，名為母經。",
        "translation": "The meaning of the mother sūtra is that it can be defined with certainty and doesn't contradict what the sūtras say, which is called the mother sūtra.",
        "source": "T24n1463_001:0801a19_1"
    },
    {
        "source_sentence": "此中解二種經：一比丘經、二比丘尼經，一切諸聚後當廣說。",
        "translation": "Here, we'll explain two kinds of sūtras: one monk's sūtra and two bhikṣuṇīs' sūtras, which will be explained in detail later in all the categories.",
        "source": "T24n1463_001:0801a20_2"
    },
    {
        "source_sentence": "「初十人制戒因緣增一中義，皆入此經中。",
        "translation": "The meaning of the first ten people's precepts are all included in this sūtra because they regulate the causes and conditions for the augmentation of the precepts.",
        "source": "T24n1463_001:0801a21_3"
    },
    {
        "source_sentence": "因初因緣得知初事斷人疑心，眾經中義不復惑也。",
        "translation": "Because of the first cause and condition, he knows that the first thing stops people's doubtful thoughts, and the meaning in the sūtras no longer confuses them.",
        "source": "T24n1463_001:0801a22_4"
    },
    {
        "source_sentence": "若比丘欲善持毘尼母經中定解，能速除生死亦勝犯戒賊。",
        "translation": "If a monk wants to well maintain the concentration in the Vinaya master's sūtra, he can quickly remove birth-and-death and also overcome the thief who violates the precepts.",
        "source": "T24n1463_001:0801a23_5"
    },
    {
        "source_sentence": "「受具足義今當說。",
        "translation": "“The meaning of receiving the full set of precepts will now be explained.",
        "source": "T24n1463_001:0801a25_6"
    },
    {
        "source_sentence": "何故名受具足？",
        "translation": "Why is it called ‘accompanied by satisfaction’?",
        "source": "T24n1463_001:0801a25_7"
    },
    {
        "source_sentence": "智慧人受具足已不犯，所求成就，故言受具。",
        "translation": "A wise person who receives the full set of precepts and doesn't violate them, and what he seeks is accomplished, so he's called receiving the full set.",
        "source": "T24n1463_001:0801a26_8"
    },
    {
        "source_sentence": "能成就義名為受具。",
        "translation": "The meaning of being able to accomplish is called receiving the fulfillment.",
        "source": "T24n1463_001:0801a27_9"
    },
    {
        "source_sentence": "以是義故，成就眾善名為受具。",
        "translation": "Because of this meaning, the accomplishment of all good qualities is called being fully ordained.",
        "source": "T24n1463_001:0801a27_10"
    },
    {
        "source_sentence": "復次能專心持戒，故言受具。",
        "translation": "Furthermore, because they can concentrate their minds on observing precepts, they're called fully ordained.",
        "source": "T24n1463_001:0801a28_11"
    },
    {
        "source_sentence": "能使成沙門義，故名受具。",
        "translation": "Being able to cause someone to become an ascetic is therefore called receiving the full set of precepts.",
        "source": "T24n1463_001:0801a28_12"
    },
    {
        "source_sentence": "能使人成就意淨法故，名為受具。",
        "translation": "Because they can cause people to accomplish the pure dharma of mind, they're called fully ordained.",
        "source": "T24n1463_001:0801a29_13"
    },
    {
        "source_sentence": "能成就寂滅法，故名受具。",
        "translation": "Being able to accomplish the dharma of extinction, it's therefore called being fully ordained.",
        "source": "T24n1463_001:0801b01_14"
    },
    {
        "source_sentence": "又成就比丘法，故名受具。",
        "translation": "It also accomplishes the monk's teaching, so it's called receiving the full set of precepts.",
        "source": "T24n1463_001:0801b01_15"
    },
    {
        "source_sentence": "於此律中，知見達解觸證得知，名為受具。",
        "translation": "In this vinaya, knowing, seeing, comprehending, understanding, touching, and realizing are called receiving the full set of precepts.",
        "source": "T24n1463_001:0801b02_16"
    },
    {
        "source_sentence": "「有能成就比丘五種受具，名為受具。",
        "translation": "“There are five ways a monk who can accomplish the five kinds of acquired possessions is called an acquired possession.",
        "source": "T24n1463_001:0801b03_17"
    },
    {
        "source_sentence": "何者五？",
        "translation": "What are these five?",
        "source": "T24n1463_001:0801b04_18"
    },
    {
        "source_sentence": "一者善來比丘即得受具；",
        "translation": "The first is that a well-come bhikṣu immediately receives the ordination.",
        "source": "T24n1463_001:0801b04_19"
    },
    {
        "source_sentence": "二者三語即得受具；",
        "translation": "The second is to receive the ordination in three words.",
        "source": "T24n1463_001:0801b04_20"
    },
    {
        "source_sentence": "三者白四羯磨受戒名為受具；",
        "translation": "The third is to tell the fourfold assembly that accepting the precepts is called ‘accompaniment of enlightenment.",
        "source": "T24n1463_001:0801b05_21"
    },
    {
        "source_sentence": "四者佛勅聽受具即得受具；",
        "translation": "The fourth is that the Buddha commands those who listen to receive the precepts, and they attain them.",
        "source": "T24n1463_001:0801b06_22"
    },
    {
        "source_sentence": "五者上受具。",
        "translation": "The fifth is the above-mentioned one who receives the precepts.",
        "source": "T24n1463_001:0801b06_23"
    },
    {
        "source_sentence": "何故名為上受具？",
        "translation": "Why is it called the higher ordination?",
        "source": "T24n1463_001:0801b07_24"
    },
    {
        "source_sentence": "佛在世時不受戒，直在佛邊聽法得阿羅漢，名上受具。",
        "translation": "When the Buddha was in the world, he didn't accept the precepts and listened directly to the teaching at the Buddha's side to attain arhatship, which is called receiving the higher ordination.",
        "source": "T24n1463_001:0801b07_25"
    },
    {
        "source_sentence": "是名比丘五種受具。",
        "translation": "These are called the five kinds of bhikṣus who receive the precepts.",
        "source": "T24n1463_001:0801b08_26"
    },
    {
        "source_sentence": "比丘尼亦有五種受具：一者隨師教而行名為受具；",
        "translation": "“Furthermore, bhikṣus and nuns have five kinds of accepting the ordination:",
        "source": "T24n1463_001:0801b09_27"
    },
    {
        "source_sentence": "二者白四羯磨而得受具；",
        "translation": "The second is to announce the four kinds of ordination and attain enlightenment.",
        "source": "T24n1463_001:0801b10_28"
    },
    {
        "source_sentence": "三者遣使現前而得受具；",
        "translation": "The third is that they send envoys to manifest themselves and receive their provisions.",
        "source": "T24n1463_001:0801b11_0"
    },
    {
        "source_sentence": "四者善來而得受具；",
        "translation": "The fourth is that they are well-come and receive their provisions.",
        "source": "T24n1463_001:0801b11_1"
    },
    {
        "source_sentence": "五者上受具。",
        "translation": "The fifth is the above-mentioned one who receives the precepts.",
        "source": "T24n1463_001:0801b12_2"
    },
    {
        "source_sentence": "能成就不作一切諸惡，是名受具。",
        "translation": "Being able to accomplish all the bad things that are not done is called being fully ordained.",
        "source": "T24n1463_001:0801b12_3"
    },
    {
        "source_sentence": "「又於毘尼藏中選擇是非能信行故，名為受具。",
        "translation": "Also, in the Vinaya, it's called receiving the full set of precepts because it's able to choose what's right and wrong and faithfully practice it.",
        "source": "T24n1463_001:0801b13_4"
    },
    {
        "source_sentence": "又能成就斷五蓋法，名為受具。",
        "translation": "They can also accomplish the five hindrances that are eliminated, which is called receiving the full set of precepts.",
        "source": "T24n1463_001:0801b14_5"
    },
    {
        "source_sentence": "有能除覺觀亦名受具，能捨愛著禪心亦名受具，苦樂憂喜以能捨故名為受具，能過四空定故亦為受具，能知諸相滅亦名受具。",
        "translation": "If someone can remove feelings and contemplations, they're also called fully endowed; if they can abandon craving and attachment in the mind of meditation, they're also called fully endowed; suffering, pleasure, sorrow, and joy are called fully endowed because they can abandon them; being able to go beyond the four concentrations of emptiness is also called fully endowed; knowing the cessation of character",
        "source": "T24n1463_001:0801b14_6"
    },
    {
        "source_sentence": "又受三歸五戒亦名受具，又受八齋法亦名受具，又受沙彌十戒亦名受具，又分受戒名為受具。",
        "translation": "Also, accepting the three refuges and five precepts is also called receiving provisions, accepting the eight rules of purification is also called receiving provisions, and accepting the ten precepts for novices is also called receiving provisions, and the partly received precepts are called receiving provisions.",
        "source": "T24n1463_001:0801b17_7"
    },
    {
        "source_sentence": "又能白業觀者亦名受具，成就種性地故名為受具。",
        "translation": "Those who can also observe white karma are also called recipients of the precepts, because they've accomplished the stage of seed nature.",
        "source": "T24n1463_001:0801b20_0"
    },
    {
        "source_sentence": "云何名種性地？",
        "translation": "What's called the ground of seed nature?",
        "source": "T24n1463_001:0801b21_1"
    },
    {
        "source_sentence": "有人在佛邊聽法，身心不懈念念成就，因此心故豁然自悟得須陀洹。",
        "translation": "A person who listens to the teaching at the Buddha's side and doesn't rely on it in body or mind, and because of that mind, they suddenly awaken to the stream entry by themselves.",
        "source": "T24n1463_001:0801b21_2"
    },
    {
        "source_sentence": "須陀洹者，善法之種性也。",
        "translation": "The stream-winner is the seed nature of good dharmas.",
        "source": "T24n1463_001:0801b23_3"
    },
    {
        "source_sentence": "四果四向第八地見諦地、薄地、離欲地、已作地，乃至無師獨覺，皆名受具。",
        "translation": "The four fruits, the four dedications, the eighth ground of seeing the truths, the thin ground, the ground of freedom from desire, the ground of having done so, and even the ground of teacherless pratyekabuddha are all called acquired.",
        "source": "T24n1463_001:0801b23_4"
    },
    {
        "source_sentence": "成就六度亦名受具，善語亦名受具。",
        "translation": "Accomplishment of the six perfections is also called ‘accompanied by what is acquired’. Good speech is also called ‘accompanied by what is acquired’.",
        "source": "T24n1463_001:0801b25_5"
    },
    {
        "source_sentence": "從智慧受具乃至善語受具，皆名受具。",
        "translation": "The endowment of wisdom and the endowment of good speech are all called ‘endowment’.",
        "source": "T24n1463_001:0801b26_6"
    },
    {
        "source_sentence": "「復欲廣說何等人應得受具？",
        "translation": "Again, I want to explain in detail what kinds of people should be allowed to receive the ordination.",
        "source": "T24n1463_001:0801b27_0"
    },
    {
        "source_sentence": "若有善男子善女人，無障清淨，皆得受具。",
        "translation": "If there are good men and good women who are unobstructed and pure, they'll all be able to receive the full set of precepts.",
        "source": "T24n1463_001:0801b27_1"
    },
    {
        "source_sentence": "夫障有三種：業障、報障、煩惱障。",
        "translation": "The obstacles are threefold: the obstacle of action, the obstacle of retribution and the obstacle of defilement.",
        "source": "T24n1463_001:0801b28_2"
    },
    {
        "source_sentence": "清淨人者，聽其出家，剃除鬚髮、著法服，受三自歸十戒，乃至白四羯磨受具。",
        "translation": "A pure person who leaves home, shaves their hair and beard, puts on the Dharma robes, receives the three self-refuges and ten precepts, and explains the four rituals to receive the necessities.",
        "source": "T24n1463_001:0801b29_3"
    },
    {
        "source_sentence": "當使出家者知四墮法不可犯也，依四依止盡形壽受行，乃至梵行營事得出家法，得法證果受樂，大功德成就。",
        "translation": "You should make sure that renunciants know that the four kinds of falling into the Dharma are not to be violated, rely on the four supports to receive and practice them for the rest of their lives up to the end of their physical life, even up to the point where they cultivate religious practice in order to serve as a renunciant of the Dharma, attain the fruit of realizing the Dharma and experience happiness, and achieve great merit.",
        "source": "T24n1463_001:0801c02_0"
    },
    {
        "source_sentence": "是餘眾事應問和上阿闍梨。",
        "translation": "These are the other things that should be asked by the superior preceptor.",
        "source": "T24n1463_001:0801c04_1"
    },
    {
        "source_sentence": "和上阿闍梨應教毘尼中所應作不應作，又復勸與諸同學同業同行一切善法莫相違反。",
        "translation": "Vātsīputrīya should teach what should be done and what shouldn't be done in the Vinaya, and he also encourages fellow students who work together with him to practice all good qualities without violating each other.",
        "source": "T24n1463_001:0801c05_2"
    },
    {
        "source_sentence": "「何故與受具者？",
        "translation": "Why is it given to those who receive the full set of precepts?",
        "source": "T24n1463_001:0801c07_3"
    },
    {
        "source_sentence": "欲使得五通樂，見苦不怖少欲知足得大人覺。",
        "translation": "They want to make the five supernormal powers happy, see suffering and aren't afraid of it, have few desires and contentment, and attain great awakening.",
        "source": "T24n1463_001:0801c07_4"
    },
    {
        "source_sentence": "云何名為得於大覺？",
        "translation": "What's called attaining great awakening?",
        "source": "T24n1463_001:0801c08_5"
    },
    {
        "source_sentence": "如佛所受行於毘尼，故名為覺。",
        "translation": "It's called awakening because it's like the Vinaya received and practiced by the Buddha.",
        "source": "T24n1463_001:0801c09_6"
    },
    {
        "source_sentence": "「云何名欲？",
        "translation": "What's called desire?",
        "source": "T24n1463_001:0801c10_0"
    },
    {
        "source_sentence": "如佛翹勤不惓，故名為欲。",
        "translation": "It's called desire because it's like the Buddha who is diligent and doesn't coarse, so he's called desire.",
        "source": "T24n1463_001:0801c10_1"
    },
    {
        "source_sentence": "又復明欲繫念在前，如佛覺無異，以是義故名為欲也。",
        "translation": "It also explains that the mindfulness of desire comes first, just like the Buddha's awakening without distinction, which is why it's called desire.",
        "source": "T24n1463_001:0801c10_2"
    },
    {
        "source_sentence": "何故名觸？",
        "translation": "Why is it called contact?",
        "source": "T24n1463_001:0801c12_3"
    },
    {
        "source_sentence": "得定故名觸；",
        "translation": "Because of attaining samdhi, it is called ‘contact’.",
        "source": "T24n1463_001:0801c12_4"
    },
    {
        "source_sentence": "得善得惡亦名為觸。",
        "translation": "Attaining good and attaining evil is also called touch.",
        "source": "T24n1463_001:0801c12_5"
    },
    {
        "source_sentence": "云何名證？",
        "translation": "What's called realization?",
        "source": "T24n1463_001:0801c13_6"
    },
    {
        "source_sentence": "不放逸故名為證。",
        "translation": "Because it's not careless, it's called realization.",
        "source": "T24n1463_001:0801c13_7"
    },
    {
        "source_sentence": "證言知義，如佛覺也。",
        "translation": "He realizes that the meaning of knowing words is like the Buddha's awakening.",
        "source": "T24n1463_001:0801c13_8"
    },
    {
        "source_sentence": "「此中何者是善來比丘受具？",
        "translation": "Which of these is the well-come bhikṣu who receives the ordination?",
        "source": "T24n1463_001:0801c14_9"
    },
    {
        "source_sentence": "如尊者阿若憍陳如。",
        "translation": "It's like the venerable Ājñāta-kauṇḍinya.",
        "source": "T24n1463_001:0801c14_10"
    },
    {
        "source_sentence": "當爾之時世尊遊波羅[木*奈]，尊者阿若憍陳如見法得法證法、深解法性，即從座起，整衣服偏袒右肩，右膝著地合掌作禮，白佛言：『世尊！",
        "translation": "At the time, the Bhagavān was traveling to Benares, and Venerable Ājñāta Kauṇḍinya, who had thus seen the teaching, realized the teaching, deeply understood the nature of the teaching, rose from his seat, adjusted his clothes, bared his right shoulder, knelt with his right knee on the ground, joined his palms in salute, and said to the Buddha, '",
        "source": "T24n1463_001:0801c15_11"
    },
    {
        "source_sentence": "唯願如來聽我出家修於梵行。』",
        "translation": "May the Tathāgata only allow me to leave home and cultivate the religious practice.'",
        "source": "T24n1463_001:0801c18_12"
    },
    {
        "source_sentence": "世尊告曰：『善來比丘。",
        "translation": "The Bhagavān told him, 'Well-come monk!",
        "source": "T24n1463_001:0801c18_13"
    },
    {
        "source_sentence": "聽汝於我法中修於梵行盡於苦際。』",
        "translation": "Listen to me and cultivate the religious practice in my teaching for as long as it's painful.'",
        "source": "T24n1463_001:0801c19_14"
    },
    {
        "source_sentence": "此阿若憍陳如即得出家、即得具足。",
        "translation": "This Ājñāta Kauṇḍinya thus becomes a renunciant and attains endowment.",
        "source": "T24n1463_001:0801c20_15"
    },
    {
        "source_sentence": "如來言已，身上所著婆羅門服乃至鬚髮即皆墮落，沙門法服自然在身，威儀庠序手執應器，如二十年學法者也。",
        "translation": "After the Tathāgata had said this, all the Brāhmaṇa robes he wore on his body and even his beard fell off, and the ascetic's religious robe naturally remained in his body, with a dignified demeanor like someone who had studied the Dharma for 20 years.",
        "source": "T24n1463_001:0801c21_16"
    },
    {
        "source_sentence": "尊者阿鉢祇婆犯、跋提伽、摩訶男等，亦如阿若憍陳如也。",
        "translation": "Venerable abhijīva, pratyekabuddha, mahānāga, and so forth are likewise like Ājñāta-kauṇḍinya.",
        "source": "T24n1463_001:0801c23_17"
    },
    {
        "source_sentence": "耶修陀同侶四人；",
        "translation": "Yasodha was accompanied by four companions:",
        "source": "T24n1463_001:0801c25_0"
    },
    {
        "source_sentence": "毘摩羅修婆、侯富那伽、憍梵跋提、耶奢童子同侶有五十人；",
        "translation": "There were fifty companions in the assembly, led by such as Vimala修婆,侯富那伽,梵跋提,童子耶奢童子。",
        "source": "T24n1463_001:0801c25_1"
    },
    {
        "source_sentence": "彌低同侶亦五十人；",
        "translation": "Maitreya also had fifty companions.",
        "source": "T24n1463_001:0801c26_2"
    },
    {
        "source_sentence": "那羅陀、摩那婆、跋陀、跋期同侶五十人；",
        "translation": "Nārada, Manabha, Bhadra and Upagupta had fifty companions.",
        "source": "T24n1463_001:0801c27_3"
    },
    {
        "source_sentence": "優樓頻蠡迦葉、那提迦葉、伽耶迦葉，此等徒眾千人；",
        "translation": "Uruvilvā-Kāśyapa, Nadī-Kāśyapa, and Gayā-Kāśyapa had a thousand disciples.",
        "source": "T24n1463_001:0801c28_4"
    },
    {
        "source_sentence": "優波提舍、駒律陀而為上首，徒眾二百五十人。",
        "translation": "Upotiṣa and Kauṣṭhila were the leaders of the assembly, with two hundred and fifty disciples.",
        "source": "T24n1463_001:0801c29_5"
    },
    {
        "source_sentence": "「如此等皆豪貴巨富，本是外道出家。",
        "translation": "“Such people are all noble and very wealthy, originally non-Buddhist renunciants.",
        "source": "T24n1463_001:0802a02_0"
    },
    {
        "source_sentence": "佛已出世受悟時至，皆來詣佛求欲出家。",
        "translation": "When the Buddha had left the world and entered enlightenment, they all came to the Buddha and asked him to leave home.",
        "source": "T24n1463_001:0802a02_1"
    },
    {
        "source_sentence": "最後須跋陀羅如此人等，皆是善來比丘也。",
        "translation": "Such people as the last one, Subhadra, are all well-come bhikṣus.",
        "source": "T24n1463_001:0802a03_2"
    },
    {
        "source_sentence": "其所得果，皆是無學後邊身者。",
        "translation": "The fruits that they attain are all post-learning bodies.",
        "source": "T24n1463_001:0802a04_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1463_001:0802a05_4"
    },
    {
        "source_sentence": "如來自神口所說故爾，餘人邊不能得也。」",
        "translation": "That's because it's what the Tathāgata explains in his supernormal mouth, and other people can't attain it.",
        "source": "T24n1463_001:0802a05_5"
    },
    {
        "source_sentence": "問曰：「世尊何以不與神力加波羅伽至婆梨伽富迦羅婆利伽使善來出家？」",
        "translation": "He asked, Bhagavān, Why didn't you give the Bhagavān the miraculous powers of Kapotaka to Śāriputra-pālīka so that he could well come and leave home?",
        "source": "T24n1463_001:0802a06_6"
    },
    {
        "source_sentence": "答：「意如此婆醯有障道業，是故不得善來出家。",
        "translation": "Answer: It means that such a Bhagavān has an obstructive path of action, so he can't well-come and leave home.",
        "source": "T24n1463_001:0802a08_7"
    },
    {
        "source_sentence": "富伽羅婆利伽者，此人現身無學因緣故，不得善來出家。",
        "translation": "Pukkuṭapālīka: Because this person's present body has no training causes and conditions, they won't be allowed to well-come and leave home.",
        "source": "T24n1463_001:0802a09_8"
    },
    {
        "source_sentence": "以是義故，雖俱在佛邊，不得一切善來出家也。",
        "translation": "Because of this, even though they're both at the Buddha's side, they won't be allowed to leave home by all good people.",
        "source": "T24n1463_001:0802a10_9"
    },
    {
        "source_sentence": "「三語受具者，爾時世尊告諸比丘：『吾於人天羅網皆得解脫。",
        "translation": "At the time, the Bhagavān addressed the monks, 'I've been liberated from the net of humans and gods.",
        "source": "T24n1463_001:0802a11_10"
    },
    {
        "source_sentence": "汝等於此網中皆得解脫。』",
        "translation": "You'll all attain liberation in this net.'",
        "source": "T24n1463_001:0802a13_11"
    },
    {
        "source_sentence": "爾時惡魔聞佛此言，即語佛言：『汝於人天羅網不得解脫，諸比丘亦不得解脫。』",
        "translation": "When the evil demon then heard these words of the Buddha, he said to the Buddha, 'You won't be liberated from the net of humans and gods, and the monks won't be liberated either.'",
        "source": "T24n1463_001:0802a13_12"
    },
    {
        "source_sentence": "「『世人於五欲，　　第六意識受，",
        "translation": "'People in the world experience the sensations of the five desires, the sixth consciousness,",
        "source": "T24n1463_001:0802a15_13"
    },
    {
        "source_sentence": "　　吾已離諸欲，　　惡魔汝自墮。』",
        "translation": "I've parted with all desires, and you yourself have fallen into the evil demon.'",
        "source": "T24n1463_001:0802a15_13"
    },
    {
        "source_sentence": "佛即說偈答曰：「惡魔聞此言已，知佛達其未離欲故，慚愧憂愁不樂，忽自滅去。",
        "translation": "The Buddha then spoke a verse in reply, After hearing these words, the evil demon knew that the Buddha realized that he hadn't yet parted with desire, so he was embarrassed and distressed and suddenly disappeared on his own.",
        "source": "T24n1463_001:0802a15_13"
    },
    {
        "source_sentence": "佛告諸比丘：『汝各各二人共詣諸方教化，莫獨去也。』",
        "translation": "The Buddha told the monks, 'Each of you two, go in all directions together to teach and transform yourself; don't go by yourself.'",
        "source": "T24n1463_001:0802a19_14"
    },
    {
        "source_sentence": "諸比丘即去。",
        "translation": "The monks then departed.",
        "source": "T24n1463_001:0802a20_15"
    },
    {
        "source_sentence": "彼土諸人聞比丘說法，皆來詣佛。",
        "translation": "The people of that land heard the monk teach the Dharma, and they all came to the Buddha.",
        "source": "T24n1463_001:0802a20_16"
    },
    {
        "source_sentence": "於其中路有生悔心者，即還歸家。",
        "translation": "Those who have regrets on the way there will return home.",
        "source": "T24n1463_001:0802a21_17"
    },
    {
        "source_sentence": "以是因緣，諸比丘來白世尊。",
        "translation": "Because of these causes and conditions, the monks came to tell the Bhagavān.",
        "source": "T24n1463_001:0802a22_18"
    },
    {
        "source_sentence": "佛即教使就彼三語受戒，語諸比丘：『汝等各各還去。",
        "translation": "The Buddha then instructed the envoy to accept the precepts in terms of those three words and said to the monks, 'You each go home.",
        "source": "T24n1463_001:0802a23_19"
    },
    {
        "source_sentence": "彼方若有求出家者，當為剃除鬚髮、教著法服、與三語受戒：「歸依佛、歸依法、歸依僧。",
        "translation": "If someone there asks to leave home, they must shave their hair and beard, teach them to wear the Dharma robe, and receive the precepts in three words: taking refuge in the Buddha, the Dharma, and the saṃgha.",
        "source": "T24n1463_001:0802a24_20"
    },
    {
        "source_sentence": "如來應正覺是我師。」』",
        "translation": "The Tathāgata Worthy of Correct Enlightenment is my teacher.'",
        "source": "T24n1463_001:0802a26_21"
    },
    {
        "source_sentence": "此即三語受戒法也。",
        "translation": "These are the three ways to receive the precepts in words.",
        "source": "T24n1463_001:0802a26_22"
    },
    {
        "source_sentence": "爾時諸比丘生疑：『云何三語即是出家、即是具足？』",
        "translation": "It was then that the monks had doubts, saying, 'What are the three words that are renunciant and fully endowed?'",
        "source": "T24n1463_001:0802a27_0"
    },
    {
        "source_sentence": "佛為說曰：『歸依佛、歸依法、歸依僧即是出家。",
        "translation": "The Buddha spoke for them, saying, 'Relying on the Buddha, the Dharma, and the saṃgha is to leave home.",
        "source": "T24n1463_001:0802a28_1"
    },
    {
        "source_sentence": "第二歸依佛竟、歸依法竟、歸依僧竟即是受具。",
        "translation": "The second is the completion of taking refuge in the Buddha, the completion of taking refuge in the Dharma, and the completion of taking refuge in the saṃgha, which are the appropriated implements.",
        "source": "T24n1463_001:0802a29_2"
    },
    {
        "source_sentence": "以是義故出家受具成就也。』",
        "translation": "Because of this meaning, he leaves home and receives the full set of accomplishments.'",
        "source": "T24n1463_001:0802b01_3"
    },
    {
        "source_sentence": "有人復更生疑：『何故優婆塞受三自歸，及以沙彌乃至八戒皆受三語，何故不名受具也？』",
        "translation": "Again, some people wondered, 'Why is it that the layman who receives the three self-refuges and the śrāmaṇer or even the eight precepts all receive the three words, so why isn't it called receiving the full set of precepts?'",
        "source": "T24n1463_001:0802b01_4"
    },
    {
        "source_sentence": "佛說曰：『此二義各異。",
        "translation": "The Buddha said, 'These two meanings are different.",
        "source": "T24n1463_001:0802b03_5"
    },
    {
        "source_sentence": "優婆塞者，不止在三歸，更加五戒，始得名為優婆塞也。",
        "translation": "Upāsaka is someone who doesn't stop at the three refuges and adds five precepts, and then they'll be called upāsaka.",
        "source": "T24n1463_001:0802b04_6"
    },
    {
        "source_sentence": "沙彌乃至八戒亦復如是。",
        "translation": "It's likewise with the eight precepts for novices and even the eight precepts.",
        "source": "T24n1463_001:0802b05_7"
    },
    {
        "source_sentence": "三語受具者，與此為足，更無所加，故言受具。』",
        "translation": "The three words that receive the full set of precepts are sufficient, and there's nothing further to add, so they're called receiving the full set.'",
        "source": "T24n1463_001:0802b06_8"
    },
    {
        "source_sentence": "所以無所加者，三歸有二種：一者為受五戒、十戒、八齋故受三歸，乃至為受二百五十戒故受三歸。",
        "translation": "There are two kinds of the three refuges: first, accepting the three refuges because they receive the five precepts, the ten precepts, and the eightfold purification, up to accepting the three refuges because they receive the 250 precepts.",
        "source": "T24n1463_001:0802b07_9"
    },
    {
        "source_sentence": "二者直受三歸。",
        "translation": "The second is to directly receive the three refuges.",
        "source": "T24n1463_001:0802b09_10"
    },
    {
        "source_sentence": "所以爾者，當爾之時，佛未制二百五十戒乃至八齋。",
        "translation": "The reason for this is that at the time, the Buddha didn't establish the 250 precepts or even the eighth day of purification.",
        "source": "T24n1463_001:0802b09_11"
    },
    {
        "source_sentence": "以是義故，直說三歸得受具也。",
        "translation": "Because of this meaning, it's straightforward to say that the three refuges will receive the full set of precepts.",
        "source": "T24n1463_001:0802b10_12"
    },
    {
        "source_sentence": "佛制不聽三語受戒已後，雖有三語不成就也。",
        "translation": "The Buddha's rule is that he won't listen to three words after receiving the precepts, even though there are three words that aren't accomplished.",
        "source": "T24n1463_001:0802b11_13"
    },
    {
        "source_sentence": "佛所以後斷三語受戒者，因一病比丘是故斷也。",
        "translation": "The reason the Buddha later stops the three statements and receives the precepts is because a sick monk stops them because of this.",
        "source": "T24n1463_001:0802b12_14"
    },
    {
        "source_sentence": "於時阿若憍陳如即從座起，整衣服偏袒右肩，右膝著地合掌向佛，白佛言：『世尊！",
        "translation": "Ājñātakauṇḍinya then rose from his seat, straightened his clothes, bared his right shoulder, knelt with his right knee on the ground and joined his palms to face the Buddha, said to him, 'Bhagavān!",
        "source": "T24n1463_001:0802b13_15"
    },
    {
        "source_sentence": "我等云何得知三歸、三語受具？』",
        "translation": "How can we know the three refuges and the three ways to receive them?'",
        "source": "T24n1463_001:0802b15_16"
    },
    {
        "source_sentence": "佛告憍陳如：『若人求出家者，當剃除鬚髮，教作如是言：「我今盡形壽歸依佛法僧。",
        "translation": "The Buddha told Kauṇḍinya, 'If someone asks to leave home, they must shave their hair and beard and teach them to say, 'Now, for the rest of my life, I'll rely on the Buddha, Dharma, and Saṃgha.",
        "source": "T24n1463_001:0802b16_17"
    },
    {
        "source_sentence": "乃至說，我今依佛出家，婆伽婆是我師也。」』",
        "translation": "It's even said, 'Now that I rely on the Buddha to leave home, Bhagavān is my teacher.'",
        "source": "T24n1463_001:0802b18_0"
    },
    {
        "source_sentence": "佛告憍陳如：『三語受戒，如我所說解也。』",
        "translation": "The Buddha told Kauṇḍinya, 'The three words of accepting the precepts are understood as I've explained them.'",
        "source": "T24n1463_001:0802b18_1"
    },
    {
        "source_sentence": "尊者憍陳如聞佛所說三語受戒，心開意解，即退坐禮佛而去。",
        "translation": "Venerable Kauṇḍinya accepted the precepts in three words as he heard what the Buddha taught, and his mind was enlightened, so he withdrew, sat down, venerated the Buddha, and departed.",
        "source": "T24n1463_001:0802b19_2"
    },
    {
        "source_sentence": "尊者阿若憍陳如遊行到毘利耆國，展轉復到毘舍離。",
        "translation": "Venerable Ājñātakauṇḍinya thus traveled to the country of Pilinda and returned in turn to Vaiśālī.",
        "source": "T24n1463_001:0802b21_3"
    },
    {
        "source_sentence": "毘舍離中有毘梨耆人，二國族姓子合在一處，一名羯羯帶遮、二名羯倫伽、三名毘斤帶遮、四名羯遲遮、五名遮賴遮、六名毘陀跋遮、七名跋陀、八名修跋陀遮、九名(本闕)、十名耶奢、十一名移須多羅、十二名阿梨耶。",
        "translation": "In Vaiśālī, there were the people of Vaiśālī, two nations and clansmen who lived together in one place. The first name was Kapilavastu; the second name was Kaluntaka; the third name was Vijiputra; the fourth name was Kacika; the fifth name was Cāraṭṭika; the sixth name was Videha; the seventh name was Bhadra; the eight",
        "source": "T24n1463_001:0802b22_4"
    },
    {
        "source_sentence": "此諸人等皆生念言：『阿若憍陳如於大沙門法中出家行於梵行。",
        "translation": "These people all had this thought, saying, 'Ajñāta Kauṇḍinya is like leaving home and practicing the religious life in the great ascetic's teaching.",
        "source": "T24n1463_001:0802b27_5"
    },
    {
        "source_sentence": "此是大智見者乃能隨學，必有妙法。",
        "translation": "This is the view of great wisdom that only those who can follow it will surely have marvelous qualities.",
        "source": "T24n1463_001:0802b28_6"
    },
    {
        "source_sentence": "我等何為不就其出家學妙法也。",
        "translation": "Why don't we train in the wonderful Dharma with respect to that renunciant?",
        "source": "T24n1463_001:0802b29_7"
    },
    {
        "source_sentence": "彼所修行，我等亦共修行。』",
        "translation": "What they cultivate, we also cultivate it together.'",
        "source": "T24n1463_001:0802c01_8"
    },
    {
        "source_sentence": "爾時族姓子共論議已，即便相將詣憍陳如所，頭面禮足却住一面，白尊者言：『惟願大德！",
        "translation": "After they had discussed it together, the clansmen went to Kauṇḍinya as before, bowed their heads and feet, withdrew to one side, and said to the venerable, 'May you, great virtuous one!'",
        "source": "T24n1463_001:0802c02_9"
    },
    {
        "source_sentence": "聽我等於如來法中出家修於梵行。』",
        "translation": "Listen to us as we leave home and cultivate the religious practice in the Tathāgata's teaching.'",
        "source": "T24n1463_001:0802c04_10"
    },
    {
        "source_sentence": "阿若憍陳如即受其言聽其出家，為說三語受戒。",
        "translation": "Ājñāta Kauṇḍinya Tathāgata then accepted his words and listened to his renunciation, speaking three words for him to receive the precepts.",
        "source": "T24n1463_001:0802c05_0"
    },
    {
        "source_sentence": "受戒已，即共相隨詣於佛所，頭面禮足却住一面。",
        "translation": "After they had received the precepts, they all went to the Buddha together, bowed their heads and feet, withdrew, and stayed off to one side.",
        "source": "T24n1463_001:0802c06_1"
    },
    {
        "source_sentence": "尊者憍陳如即白佛言：『此諸族姓子等求欲出家，為其三語受戒為，得戒不？』",
        "translation": "Venerable Kauṇḍinya then said to the Buddha, 'Did these clansmen and others who seek to leave home receive the precepts in three words for their sake, or did they attain them?'",
        "source": "T24n1463_001:0802c07_2"
    },
    {
        "source_sentence": "佛告憍陳如：『此諸人等三語受戒，具足成就，善得具戒。",
        "translation": "The Buddha told Kauṇḍinya thus, 'These people receive the precepts in these three words, fully accomplish them, and well attain their full set of precepts.",
        "source": "T24n1463_001:0802c08_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1463_001:0802c10_4"
    },
    {
        "source_sentence": "過去諸佛亦曾與此三語受戒，未來諸佛亦當與此三語受戒，我今現在亦同彼也。』",
        "translation": "The buddhas of the past also gave these three words to receive the precepts, and the buddhas of the future will also give these three words to receive the precepts, and I'll be the same as them now.'",
        "source": "T24n1463_001:0802c10_5"
    },
    {
        "source_sentence": "是故得有三語受戒。",
        "translation": "Therefore, it's possible to receive the precepts in three ways.",
        "source": "T24n1463_001:0802c12_6"
    },
    {
        "source_sentence": "「白四羯磨者，何以要現前白四羯磨而受具者？",
        "translation": "To explain the four karmas, why does he need to present the four white karmas before he receives them?",
        "source": "T24n1463_001:0802c12_7"
    },
    {
        "source_sentence": "解云：當於爾時，佛住王舍城。",
        "translation": "The explanation says, At the time, the Buddha was staying in Rājagṛha.",
        "source": "T24n1463_001:0802c13_8"
    },
    {
        "source_sentence": "優樓頻螺迦葉等師徒已出家竟。",
        "translation": "Uruvilvā-Kāśyapa and other masters have left home.",
        "source": "T24n1463_001:0802c14_9"
    },
    {
        "source_sentence": "有一病比丘無供養者，病困篤已即便命終。",
        "translation": "If there's a sick monk who doesn't have an offering, his illness becomes so serious that he dies.",
        "source": "T24n1463_001:0802c15_10"
    },
    {
        "source_sentence": "諸比丘等見此比丘病篤命終，一無看病者、二無弟子，二俱無故苦惱如是，往白世尊。",
        "translation": "When the monks and others saw that this monk was seriously ill and died, they said to the Bhagavān, One, there's no care for the sick man, two have no disciples, and two are both suffering from such kinds of pain and suffering.",
        "source": "T24n1463_001:0802c16_11"
    },
    {
        "source_sentence": "佛即集諸比丘僧：『從今已去，斷三語羯磨。",
        "translation": "The Buddha then gathered the monks and nuns together, saying, 'From now on, cut off the three-word karma.",
        "source": "T24n1463_001:0802c18_12"
    },
    {
        "source_sentence": "於十僧中白四羯磨聽使受具。』",
        "translation": "In the ten saṃgha, he'll tell the four karmas to listen and receive the full set of precepts.'",
        "source": "T24n1463_001:0802c19_13"
    },
    {
        "source_sentence": "如是一一受戒皆如上廣說，應當知。",
        "translation": "Each of these precepts should be understood as explained in detail above.",
        "source": "T24n1463_001:0802c19_14"
    },
    {
        "source_sentence": "爾時有一惡比丘度人出家，出家者即於師邊生疑，往白世尊。",
        "translation": "At the time, there was a bad monk who converted someone to leave home, and those who left home then had doubts at the teacher's side and went to the Bhagavān.",
        "source": "T24n1463_001:0802c20_15"
    },
    {
        "source_sentence": "世尊問言：『汝先未受戒時生疑不？』",
        "translation": "The Bhagavān asked, 'Did you have doubts when you first received the precepts?'",
        "source": "T24n1463_001:0802c21_16"
    },
    {
        "source_sentence": "答言：『不也。』",
        "translation": "He replied, 'No.'",
        "source": "T24n1463_001:0802c22_17"
    },
    {
        "source_sentence": "佛言：『汝已得具足戒也。』",
        "translation": "The Buddha said, 'You've already attained the full set of precepts.'",
        "source": "T24n1463_001:0802c22_18"
    },
    {
        "source_sentence": "復有一人求師出家受具足戒，得受具已心中生疑，疑師不清淨為得戒不？",
        "translation": "Suppose another person asks a teacher to leave home and receive the full set of precepts, and after receiving them, they have doubts in their minds that the teacher's impurity is the result of attaining the precepts?",
        "source": "T24n1463_001:0802c23_19"
    },
    {
        "source_sentence": "往白世尊。",
        "translation": "He went to the Bhagavān and said.",
        "source": "T24n1463_001:0802c25_20"
    },
    {
        "source_sentence": "世尊問言：『汝先知師不清淨不？』",
        "translation": "The Bhagavān asked, 'Have you ever known that the teacher isn't pure?'",
        "source": "T24n1463_001:0802c25_21"
    },
    {
        "source_sentence": "受戒者言：『不知也。』",
        "translation": "Those who receive the precepts say, 'I don't know.'",
        "source": "T24n1463_001:0802c26_22"
    },
    {
        "source_sentence": "又復問言：『汝先知不清淨師邊受戒不得戒不？』",
        "translation": "Again, he asked, 'Did you know that you didn't accept the precepts at the side of the teacher Śākyamuni and didn't receive the precepts?'",
        "source": "T24n1463_001:0802c26_23"
    },
    {
        "source_sentence": "答言：『不知。』",
        "translation": "He replied, 'I don't know.'",
        "source": "T24n1463_001:0802c27_24"
    },
    {
        "source_sentence": "佛言：『汝便是得具足戒也。』",
        "translation": "The Buddha said, 'You've attained the full set of precepts.'",
        "source": "T24n1463_001:0802c27_25"
    },
    {
        "source_sentence": "復有一人求師出家，師即為受具足。",
        "translation": "Again, there was a man who asked his teacher to leave home, and he accepted the full set of precepts.",
        "source": "T24n1463_001:0802c28_26"
    },
    {
        "source_sentence": "後心生疑，往白世尊。",
        "translation": "Later, he had doubts in his mind and went to the Bhagavān.",
        "source": "T24n1463_001:0802c29_27"
    },
    {
        "source_sentence": "世尊問言：『汝先知汝師破戒不？』",
        "translation": "The Bhagavān asked, 'Did you know that your teacher broke the precepts?'",
        "source": "T24n1463_001:0802c29_28"
    },
    {
        "source_sentence": "答言：『知也。』",
        "translation": "He replied, 'I know it.'",
        "source": "T24n1463_001:0803a01_29"
    },
    {
        "source_sentence": "又復問言：『汝先知不清淨師邊受戒不得戒不？』",
        "translation": "Again, he asked, 'Did you know that you didn't accept the precepts at the side of the teacher Śākyamuni and didn't receive the precepts?'",
        "source": "T24n1463_001:0803a01_30"
    },
    {
        "source_sentence": "答言：『知也。』",
        "translation": "He replied, 'I know it.'",
        "source": "T24n1463_001:0803a02_31"
    },
    {
        "source_sentence": "復更問言：『汝先知汝師受戒時得戒不？』",
        "translation": "Again, he asked, 'Did you know that your teacher received the precepts when he received them?'",
        "source": "T24n1463_001:0803a03_32"
    },
    {
        "source_sentence": "答言：『不知也。』",
        "translation": "He replied, 'I don't know.'",
        "source": "T24n1463_001:0803a03_33"
    },
    {
        "source_sentence": "佛言：『汝便得具足戒也。』",
        "translation": "The Buddha said, 'You'll then attain the full set of precepts.'",
        "source": "T24n1463_001:0803a04_34"
    },
    {
        "source_sentence": "又復一人求師出家，師即與受具足。",
        "translation": "Another man asked his teacher to leave home, and he gave him the full set of precepts.",
        "source": "T24n1463_001:0803a04_35"
    },
    {
        "source_sentence": "後心生疑，往白世尊。",
        "translation": "Later, he had doubts in his mind and went to the Bhagavān.",
        "source": "T24n1463_001:0803a05_36"
    },
    {
        "source_sentence": "世尊問言：『汝先知不清淨師邊受戒不得戒不？』",
        "translation": "The Bhagavān asked, 'Have you ever known a teacher who doesn't observe the precepts and doesn't observe them?'",
        "source": "T24n1463_001:0803a06_37"
    },
    {
        "source_sentence": "答言：『先知。』",
        "translation": "He replied, 'I'll know it first.'",
        "source": "T24n1463_001:0803a07_38"
    },
    {
        "source_sentence": "復更問言：『汝先知汝師師邊受戒不得戒不？』",
        "translation": "Again, he asked, 'Have you ever known your teacher who received the precepts at the side of the master and didn't receive them?'",
        "source": "T24n1463_001:0803a07_39"
    },
    {
        "source_sentence": "答言：『知也。』",
        "translation": "He replied, 'I know it.'",
        "source": "T24n1463_001:0803a08_40"
    },
    {
        "source_sentence": "佛言：『三事皆知，受戒不得也。』",
        "translation": "The Buddha said, 'Knowing all three things, they won't receive the precepts.'",
        "source": "T24n1463_001:0803a08_41"
    },
    {
        "source_sentence": "以是義故，名為白四羯磨。",
        "translation": "Because of this meaning, they're called the four white karmas.",
        "source": "T24n1463_001:0803a09_42"
    },
    {
        "source_sentence": "「云何名為勅聽受具？",
        "translation": "What's called an order to hear and accept the requisites?",
        "source": "T24n1463_001:0803a09_43"
    },
    {
        "source_sentence": "當於爾時。",
        "translation": "At that point, then.",
        "source": "T24n1463_001:0803a10_44"
    },
    {
        "source_sentence": "佛在舍衛國比舍佉鹿母園中堂上，問蘇陀耶沙彌義、沙彌解義。",
        "translation": "The Buddha was in the middle hall of the Deer Mother's Park in Bimbisāra in Sāvatthī, asking about the meaning of the śrāmaṇer Sudarśana and the meaning of the śrāmaṇer's understanding.",
        "source": "T24n1463_001:0803a10_45"
    },
    {
        "source_sentence": "如佛所解，稱如來意，佛即告言：『汝從今已往若有疑惑，恣汝來問。』",
        "translation": "As the Buddha understands it, he praises the Tathāgata's wishes, and the Buddha then tells them, 'From now on, if you have doubts, ask as freely as you like.'",
        "source": "T24n1463_001:0803a12_46"
    },
    {
        "source_sentence": "亦即與戒即得具足，故名勅聽受具。",
        "translation": "That's why it's called an order to hear and receive the full set of precepts.",
        "source": "T24n1463_001:0803a13_47"
    },
    {
        "source_sentence": "「云何上受具？",
        "translation": "What are the above-mentioned ways to receive the precepts?",
        "source": "T24n1463_001:0803a14_48"
    },
    {
        "source_sentence": "如有一人盡一切漏，未滿二十已受具足，即於比丘法中自生疑心。",
        "translation": "Suppose there's a person who has ended all the contaminants and under 20 years of age to receive their full ordination, which means they have doubts about the monk's teachings themselves.",
        "source": "T24n1463_001:0803a14_49"
    },
    {
        "source_sentence": "同住諸比丘知其生疑，往白世尊。",
        "translation": "Knowing their doubts, the monks living together went to the Bhagavān.",
        "source": "T24n1463_001:0803a16_50"
    },
    {
        "source_sentence": "世尊語此漏盡比丘：『汝數胎中年乃至閏月皆數，滿不？』",
        "translation": "The Bhagavān said to this monk who had ended the contaminants, 'Do you count the years in the womb up to the intercalary months that are all numbered, and are they complete?'",
        "source": "T24n1463_001:0803a17_0"
    },
    {
        "source_sentence": "答言：『不滿。』",
        "translation": "He replied, 'It's not complete.'",
        "source": "T24n1463_001:0803a18_1"
    },
    {
        "source_sentence": "佛即問諸比丘：『此比丘得阿羅漢耶？』",
        "translation": "The Buddha then asked the monks, 'Has this monk attained arhatship?'",
        "source": "T24n1463_001:0803a18_2"
    },
    {
        "source_sentence": "諸比丘白佛：『得阿羅漢。』",
        "translation": "The monks said to the Buddha, 'I'll attain arhatship.'",
        "source": "T24n1463_001:0803a19_3"
    },
    {
        "source_sentence": "佛言：『此是上受具也。』",
        "translation": "The Buddha said, 'This is the above-mentioned ordination.'",
        "source": "T24n1463_001:0803a19_4"
    },
    {
        "source_sentence": "又復告言：『後受戒者聽數胎中年。』",
        "translation": "Again, he told them, 'After you receive the precepts, you'll hear the number of years in the womb.'",
        "source": "T24n1463_001:0803a20_5"
    },
    {
        "source_sentence": "「云何比丘尼五種受具？",
        "translation": "What are the five kinds of ordination for monks and nuns?",
        "source": "T24n1463_001:0803a21_6"
    },
    {
        "source_sentence": "隨師教而行名為師法受具。",
        "translation": "He follows the teacher's instructions and practices them, which is called the master's method of receiving the precepts.",
        "source": "T24n1463_001:0803a21_7"
    },
    {
        "source_sentence": "當於爾時，佛住釋種園中。",
        "translation": "At the time, the Buddha was staying at the Śākyamuni's Park.",
        "source": "T24n1463_001:0803a22_8"
    },
    {
        "source_sentence": "時摩訶波闍波提憍曇彌與五百釋種女來詣佛所，到已頭面著地禮佛足，白佛言：『世尊！",
        "translation": "Mahāprajāpatī Bodhidharma and the five hundred Śākya maidens then came to the Buddha, bowed their heads and feet at his feet, and said to him, 'Bhagavān!",
        "source": "T24n1463_001:0803a22_9"
    },
    {
        "source_sentence": "我等女人於佛法中得出家不？』",
        "translation": "Do we women leave home in the Buddha's teaching?'",
        "source": "T24n1463_001:0803a24_10"
    },
    {
        "source_sentence": "佛言：『吾不欲聽女人出家。』",
        "translation": "The Buddha said, 'I won't allow a woman to leave home.'",
        "source": "T24n1463_001:0803a25_11"
    },
    {
        "source_sentence": "聞此語已低頭泣淚而去。",
        "translation": "After hearing these words, he bowed his head in tears and departed.",
        "source": "T24n1463_001:0803a26_12"
    },
    {
        "source_sentence": "世尊後時從釋種園向舍衛國祇桓精舍。",
        "translation": "At a later time, the Bhagavān went from the park of the Śākyamuni clan to the Jetavana monastery in Śrāvastī.",
        "source": "T24n1463_001:0803a26_13"
    },
    {
        "source_sentence": "憍曇彌五百女等聞佛向祇桓精舍，心懷悲惱自慨其身不在佛法之次，各自剃頭著法服，隨佛後而去。",
        "translation": "When the five hundred women of Kātyāmī heard that the Buddha was heading for the Jetavana monastery, they grieved in their hearts and lamented to themselves that their bodies weren't following the Buddha's teaching, shaved their hair and put on their Dharma robes, followed him behind them, and departed.",
        "source": "T24n1463_001:0803a27_14"
    },
    {
        "source_sentence": "到祇桓精舍在外而立，見尊者阿難。",
        "translation": "When he arrived at the Jetavana monastery and stood outside, he saw Venerable Ānanda.",
        "source": "T24n1463_001:0803b01_15"
    },
    {
        "source_sentence": "阿難即問母及諸女言：『優婆夷等何為剃髮自著法衣，顏色憔悴而不悅乎？』",
        "translation": "Ānanda then asked his mother and the other women, 'Why are you, Upāsikā, shaving yourselves and putting on your religious robes, so emaciated and unhappy in appearance?'",
        "source": "T24n1463_001:0803b02_0"
    },
    {
        "source_sentence": "母及諸女即答言：『所以不悅者，但世尊不聽女人出家，是故憂色也。』",
        "translation": "The mother and the women then replied, 'That's why they aren't pleased, but the Bhagavān won't allow a woman to leave home; that's why they're sad.'",
        "source": "T24n1463_001:0803b03_1"
    },
    {
        "source_sentence": "阿難言：『且止。",
        "translation": "Ānanda said, 'Wait a minute.",
        "source": "T24n1463_001:0803b05_2"
    },
    {
        "source_sentence": "當為白世尊。』",
        "translation": "I will tell the Bhagavān.'",
        "source": "T24n1463_001:0803b05_3"
    },
    {
        "source_sentence": "阿難尋入即啟世尊：『是優婆夷等求欲出家。",
        "translation": "Ānanda went in and asked the Bhagavān, 'That's Upāsikā and others who wanted to leave home.",
        "source": "T24n1463_001:0803b05_4"
    },
    {
        "source_sentence": "願世尊聽許。』",
        "translation": "May the Bhagavān allow it.'",
        "source": "T24n1463_001:0803b06_5"
    },
    {
        "source_sentence": "佛告阿難：『吾所以不聽女人出家者，如世人家男少女多家業必壞。",
        "translation": "The Buddha told Ānanda, 'That's why I won't allow a woman to leave home because it's like the worldly family of men and girls whose many activities will surely break down.",
        "source": "T24n1463_001:0803b07_6"
    },
    {
        "source_sentence": "出家法中若有女人，必壞正法不得久住。』",
        "translation": "If there's a woman who leaves home in the Dharma, she will surely destroy the right Dharma and won't be able to stay for a long time.'",
        "source": "T24n1463_001:0803b08_7"
    },
    {
        "source_sentence": "阿難重白佛言：『女人於佛法中修梵行得四果不？』",
        "translation": "Ānanda repeatedly said to the Buddha, 'Has a woman cultivated the religious practice in the Buddha's teachings and attained the four fruits?'",
        "source": "T24n1463_001:0803b09_8"
    },
    {
        "source_sentence": "佛告阿難：『能修梵行其志不退亦可得耳。』",
        "translation": "The Buddha told Ānanda, 'Anyone who cultivates the religious practice and doesn't retreat from it can still attain it.'",
        "source": "T24n1463_001:0803b10_9"
    },
    {
        "source_sentence": "阿難復白佛言：『惟願世尊聽女人在佛法之次。』",
        "translation": "Ānanda then said to the Buddha, 'May the Bhagavān hear that women are next to the Buddha's teaching.'",
        "source": "T24n1463_001:0803b11_10"
    },
    {
        "source_sentence": "佛告阿難：『女人能行八敬法者聽其出家，若不能者不聽在道。",
        "translation": "The Buddha told Ānanda, 'If a woman can practice the eight kinds of reverence, she'll be allowed to leave home; if she can't, she won't be allowed to stay on the path.",
        "source": "T24n1463_001:0803b12_11"
    },
    {
        "source_sentence": "所以為女人制八敬者，如人欲渡水先造橋船，後時雖有大水必能得渡。",
        "translation": "That's why the eight kinds of reverence are established for women, like a person who wants to cross water and first build a bridge or boat before they cross it, and then even though there's a large river at some point later, they'll surely be able to cross it.",
        "source": "T24n1463_001:0803b14_12"
    },
    {
        "source_sentence": "八敬法亦如是，怖後時壞正法故為其制耳。』",
        "translation": "The eight kinds of reverence are likewise, and because they fear the subsequent disintegration of the right teaching, they're disciplined by it.'",
        "source": "T24n1463_001:0803b15_13"
    },
    {
        "source_sentence": "佛告阿難：『汝今為女人求出家，後當減吾五百世正法。』",
        "translation": "The Buddha told Ānanda, 'Now, you're seeking to leave home for women, and later you'll decrease my five hundred worldly right teachings.'",
        "source": "T24n1463_001:0803b16_14"
    },
    {
        "source_sentence": "阿難聞此之言憂愁不樂，即出外問諸優婆夷等：『佛說八敬之法能奉行不？』",
        "translation": "When Ānanda heard these words, he became sad and unhappy, and went out to ask the laymen and others, 'Did the Buddha teach the eight kinds of respectful dharmas that can be practiced?'",
        "source": "T24n1463_001:0803b18_0"
    },
    {
        "source_sentence": "諸女聞此語已內懷歡喜，即請阿難還白世尊：『我等今日蒙世尊施法，當奉行之。",
        "translation": "Having heard these words, the women were overjoyed within themselves. They immediately invited Ānanda to return and said to the World-honored One: Today we have been entrusted by the World-honored One with the Dharma that we should practice.",
        "source": "T24n1463_001:0803b19_1"
    },
    {
        "source_sentence": "譬如有人沐浴香湯莊飾已竟，更有人來以華鬘莊其頂上。",
        "translation": "It's like a person who has finished adorning themselves with bathing in scented hot water, and another person comes to adorn their head with flowers and garlands.",
        "source": "T24n1463_001:0803b21_2"
    },
    {
        "source_sentence": "我等今日亦復如是。』",
        "translation": "So it is with us today.'",
        "source": "T24n1463_001:0803b22_3"
    },
    {
        "source_sentence": "阿難以此之言即啟世尊。",
        "translation": "Ānanda, this is the words that inspire the Bhagavān.",
        "source": "T24n1463_001:0803b23_4"
    },
    {
        "source_sentence": "世尊言：『此等已得受具。』",
        "translation": "The Bhagavān said, 'These have already received the full set of precepts.'",
        "source": "T24n1463_001:0803b24_0"
    },
    {
        "source_sentence": "是名師法受具。",
        "translation": "This is called the master's method of receiving the precepts.",
        "source": "T24n1463_001:0803b24_1"
    },
    {
        "source_sentence": "「白四羯磨受具者，如上病比丘經中所說。",
        "translation": "The person who explains the four karmas and receives the full set of precepts is as explained in the above-mentioned sūtra for sick monks.",
        "source": "T24n1463_001:0803b24_2"
    },
    {
        "source_sentence": "「遣使受具者，亦如比丘尼經中所說。",
        "translation": "Those who send envoys to receive the full set of precepts are likewise as explained in the bhikṣuṇī sūtras.",
        "source": "T24n1463_001:0803b25_3"
    },
    {
        "source_sentence": "「云何名善來比丘尼受具？",
        "translation": "What's called a well-come bhikṣuṇī who receives the precepts?",
        "source": "T24n1463_001:0803b26_4"
    },
    {
        "source_sentence": "當於爾時，世尊在舍衛國。",
        "translation": "At the time, the Bhagavān was in Śrāvastī.",
        "source": "T24n1463_001:0803b27_5"
    },
    {
        "source_sentence": "摩登祇女來到佛所，頭面著地禮世尊足，退坐一面。",
        "translation": "The goddess Mātaṅgī came to the Buddha, bowed her head and feet at his feet, withdrew, and sat to one side.",
        "source": "T24n1463_001:0803b27_6"
    },
    {
        "source_sentence": "佛即為說法。",
        "translation": "The Buddha then taught the Dharma for them.",
        "source": "T24n1463_001:0803b29_7"
    },
    {
        "source_sentence": "深悟法性，得須陀洹果，求佛出家。",
        "translation": "Deeply awakened to the essence of the Dharma, he attained the fruit of stream entry and left home in search of Buddhahood.",
        "source": "T24n1463_001:0803b29_8"
    },
    {
        "source_sentence": "世尊告曰：『聽汝於我法中善修梵行盡諸苦際。』",
        "translation": "The Bhagavān told them, 'Listen and listen to me as you skillfully cultivate the religious practice in my teachings to end the limits of suffering.'",
        "source": "T24n1463_001:0803c01_9"
    },
    {
        "source_sentence": "佛言已訖，頭髮自落，法服應器忽然在身，威儀庠序如久服法者。",
        "translation": "After the Buddha had finished speaking, his hair fell off on its own, and the Dharma robes and vessels suddenly appeared in his body, with the manner and demeanor of a long-abiding devotee of the Dharma.",
        "source": "T24n1463_001:0803c02_10"
    },
    {
        "source_sentence": "是故名為善來受具。",
        "translation": "That's why they're called well-come and fully ordained.",
        "source": "T24n1463_001:0803c03_11"
    },
    {
        "source_sentence": "「上受具者，盡諸有漏成阿羅漢。",
        "translation": "“The above-mentioned person who receives the full set of precepts ends the contaminants and becomes an arhat.",
        "source": "T24n1463_001:0803c05_0"
    },
    {
        "source_sentence": "如上沙彌，雖未滿二十，得阿羅漢故，名為上受具。",
        "translation": "Suppose the above-mentioned śrāmaṇer attains arhatship even though he hasn't reached 20 years old, which is called the higher ordination.",
        "source": "T24n1463_001:0803c05_1"
    },
    {
        "source_sentence": "此比丘尼亦復如是，是名上受具。",
        "translation": "This bhikṣuṇī is likewise, which is called the higher ordination.",
        "source": "T24n1463_001:0803c06_2"
    },
    {
        "source_sentence": "比丘尼五種受具竟。",
        "translation": "After the five kinds of bhikṣuṇīs receive the full set of precepts are complete, he or she gives them to a monk or nun.",
        "source": "T24n1463_001:0803c07_3"
    },
    {
        "source_sentence": "「立善法上受具者，爾時王舍城中有婆羅門，名尼駒陀，錢財珍寶巨億無量。",
        "translation": "At the time, there was a Brāhmaṇa named Nirgrantha in Rājagṛha, with millions of money and treasures that were immeasurable.",
        "source": "T24n1463_001:0803c08_4"
    },
    {
        "source_sentence": "此婆羅門家生一子，字畢波羅延。",
        "translation": "This Brāhmaṇa family had a son born to them, named Upāliyana.",
        "source": "T24n1463_001:0803c09_5"
    },
    {
        "source_sentence": "父母種姓清淨，諸婆羅門所有經書無不悉達，乃至大人之相亦能達之。",
        "translation": "Their parents and clans are pure, and all the sūtras and books of the brāhmaṇas can comprehend them without fail, even to the point where they can comprehend the characteristics of a great man.",
        "source": "T24n1463_001:0803c10_6"
    },
    {
        "source_sentence": "此畢波羅延童子，父命終後，家中有碎金九十六斛，錢有八十億勒沙，十萬一勒沙也。",
        "translation": "After his father’s death, the boy Pippalyan had ninety-six hu units of broken gold in his house. Eighty koṭis of riyas and one hundred thousand [ten] myriads of] riyas were spent on this treasure.",
        "source": "T24n1463_001:0803c12_7"
    },
    {
        "source_sentence": "奴婢僕使有千聚落。",
        "translation": "There are a thousand villages of slaves, maids, and servants.",
        "source": "T24n1463_001:0803c14_8"
    },
    {
        "source_sentence": "其婦字跋陀，顏貌殊特世之無類，故能割愛斷貪捨之而去。",
        "translation": "The woman's name was Bhadra, and her appearance was extraordinary and worldly without similarities, so she was able to cut off craving, stop craving, abandon it, and leave him.",
        "source": "T24n1463_001:0803c14_9"
    },
    {
        "source_sentence": "默生此念：『世間若有應真羅漢者就之出家，詣彼苦行仙人林中修於梵行。』",
        "translation": "He had this thought in silence, 'If there are truly arhats in the world who should leave home with them, they'll go to that forest of ascetic sages and cultivate the religious practice.'",
        "source": "T24n1463_001:0803c16_0"
    },
    {
        "source_sentence": "作是念已，故能割愛斷貪捨之而去，詣彼苦行仙人林中，十二年茹菜食菓飲清流泉修於梵行，得諸禪心成就五通。",
        "translation": "Having thought thus, he was able to cut off craving and abandon it, went to that forest of ascetic sages who practiced austerities, cultivated religious practice for 12 years, boiled vegetables, ate fruitful food, drank from the clear flowing fountain, and achieved the five supernormal powers by attaining the mind of meditation and the five supernormal abilities.",
        "source": "T24n1463_001:0803c17_1"
    },
    {
        "source_sentence": "世尊爾時現出於世，在鹿野苑初轉法輪，僧已成就。",
        "translation": "At the time, the Bhagavān appeared in the world and turned the wheel of the Dharma at the beginning of his deer's wilderness park, where the saṃgha had accomplished it.",
        "source": "T24n1463_001:0803c20_2"
    },
    {
        "source_sentence": "與大比丘眾千人俱，如此人等，皆是耆舊長宿國之所重，諸根寂靜皆是漏盡解脫者也。",
        "translation": "He was accompanied by a large group of thousands of monks, all of whom were valued by the country of Jīvaka Changshou and whose faculties were tranquil because they were liberated from the contaminants.",
        "source": "T24n1463_001:0803c21_3"
    },
    {
        "source_sentence": "世尊與諸比丘展轉遊行到摩竭提國，入若致林中，在尼駒樹王下住。",
        "translation": "The Bhagavān and the monks traveled in turn to the country of Magadha, entered the forest where he was staying at the foot of King Nirmāṇarati's tree.",
        "source": "T24n1463_001:0803c23_4"
    },
    {
        "source_sentence": "爾時世尊以佛眼觀於世間，何等眾生生於世間，少諸煩惱有大神力，能堪聽受吾所說法？",
        "translation": "At the time, the Bhagavān observed the world with the Buddha's eye and asked, Which sentient beings are born in the world that have few afflictions and great supernormal powers to be able to hear my teaching?",
        "source": "T24n1463_001:0803c25_5"
    },
    {
        "source_sentence": "如來見畢波羅延童子在優吒林中，見已即生此念：『是人堪受吾之正法。』",
        "translation": "When the Tathāgata saw the boy Upālian in the forest of Uḍa and saw him, he thought, 'That person is capable of accepting my right teaching.'",
        "source": "T24n1463_001:0803c27_6"
    },
    {
        "source_sentence": "爾時世尊欲度畢波羅延童子故，與千比丘俱，從摩竭提國向多子塔，到已在樹下止住。",
        "translation": "At the time, the Bhagavān wanted to save the boy Upāliyana, so he went with a thousand monks from the country of Magadha to the stūpa of many sons and stayed under a tree when he arrived.",
        "source": "T24n1463_001:0803c28_7"
    },
    {
        "source_sentence": "一日於此林中，佛神力故，光明照曜林樹焰赫而皆大明。",
        "translation": "One day, in this forest, the Buddha's miraculous power shone brightly and illuminated the forest with a blazing flame that made it all become very bright.",
        "source": "T24n1463_001:0804a01_8"
    },
    {
        "source_sentence": "譬如秋月無雲翳日，如來光明亦復如是。",
        "translation": "Just as the autumn moon is free of clouds and sunlight, so is the Tathāgata’s ray of light likewise.",
        "source": "T24n1463_001:0804a03_9"
    },
    {
        "source_sentence": "此童子十二年已，自然生心欲向多子塔，經涉嶮難山谷林藪到多子塔。",
        "translation": "For twelve years, this boy's mind naturally arisen with the intention to go to the many-seed stūpa, and he traveled up a dangerous path through mountains, valleys, forests, and dense forests until he reached the many-seed stūpa.",
        "source": "T24n1463_001:0804a04_10"
    },
    {
        "source_sentence": "到已見此林中光明殊特與世超絕，默自生念：『此中或有諸天釋梵、大力神仙、師子王等，是故此林有異瑞相。』",
        "translation": "When he arrived, he saw that the light in this forest was extraordinary and unsurpassed by the world, and quietly thought to himself, 'There may be gods, Śākyamuni Brahmā, great sages, lion kings, and so forth here; therefore, this forest has a different appearance of auspiciousness.'",
        "source": "T24n1463_001:0804a05_11"
    },
    {
        "source_sentence": "畢波羅延童子漸漸前行，見如來足跡有千輻相輪具足分明，即尋跡前行。",
        "translation": "When the boy Upāliyana gradually advanced, he saw that the Tathāgata's footprints had a thousand-spoked wheel with distinctive characteristics, and he went ahead in search of them.",
        "source": "T24n1463_001:0804a08_12"
    },
    {
        "source_sentence": "遙見如來諸根明淨顏貌殊特眾相具足儼然而坐，童子即時衣毛皆竪生於信心，內自默念：『本出家時心中所期，今此是也。』",
        "translation": "Seeing from a distance that the Tathāgata's faculties are clear and pure, his appearance is extraordinary, and his features are complete, he sits calmly. The boy immediately feels hair on his clothes and gives rise to faith, and he thinks quietly inside himself, 'This is what I hoped for in my mind when I left home.'",
        "source": "T24n1463_001:0804a09_13"
    },
    {
        "source_sentence": "諸天即復唱告語言：『不須疑也。』",
        "translation": "The gods then again called out and told them, 'There's no need to doubt it.'",
        "source": "T24n1463_001:0804a12_14"
    },
    {
        "source_sentence": "此童子復見諸比丘繫念坐禪，即生念言：『本所求者，今乃得見。』",
        "translation": "Again, this boy saw the monks sitting in meditation bound to mindfulness, and he thought, 'That's what I originally asked for, but now I can see it.'",
        "source": "T24n1463_001:0804a13_15"
    },
    {
        "source_sentence": "直前詣佛，到已頭面著地，以兩手摩佛足，口復鳴之，自云：『我姓迦葉，字畢波羅延童子。』",
        "translation": "He went straight ahead to the Buddha, bowed his head and face to the ground, touched him with both hands at his feet, and again called out to him, saying, 'My name is Kāśyapa, and my name is Boy Upāliyāyana.'",
        "source": "T24n1463_001:0804a14_16"
    },
    {
        "source_sentence": "如是三稱。",
        "translation": "These are the three names.",
        "source": "T24n1463_001:0804a16_17"
    },
    {
        "source_sentence": "爾時世尊告諸比丘：『若有煩惱結漏未盡，非一切智亦非人師，受成就善法人禮者，頭破作七分。",
        "translation": "It was then that the Bhagavān addressed the monks, saying, 'If there are afflictive bonds and contaminants that haven't ended, they aren't omniscience or a teacher of men, and if someone who has accomplished the veneration of good people breaks their head into seven parts.",
        "source": "T24n1463_001:0804a16_18"
    },
    {
        "source_sentence": "吾今實是煩惱結漏盡者、為一切人作福田者、慈愍眾生者亦是一切智者，是故受此童子禮也。』",
        "translation": "Now, I am really someone who has ended the bond of affliction, created a field of merit for all people, and compassionate sentient beings are also omniscience; therefore, I'm paying homage to this boy.'",
        "source": "T24n1463_001:0804a19_19"
    },
    {
        "source_sentence": "爾時世尊告童子言：『汝今已具足供養信心成就，可退坐一面。』",
        "translation": "It was then that the Bhagavān addressed the boy, saying, 'Now that you've fulfilled your offerings and accomplished faith, you can retreat and sit to one side.'",
        "source": "T24n1463_001:0804a21_20"
    },
    {
        "source_sentence": "童子即受告勅，禮佛足已退坐一面。",
        "translation": "The boy then accepted the instruction, bowed his head at the Buddha's feet, withdrew, and sat to one side.",
        "source": "T24n1463_001:0804a22_21"
    },
    {
        "source_sentence": "爾時世尊為彼童子種種因緣巧說諸法示教利喜。",
        "translation": "It was then that the Bhagavān skillfully explained the teachings and showed them to the boy for various reasons.",
        "source": "T24n1463_001:0804a23_22"
    },
    {
        "source_sentence": "童子即悟法得道，獲須陀洹果。",
        "translation": "The boy then awakened to the teaching and attained enlightenment, and he attained the fruit of stream entry.",
        "source": "T24n1463_001:0804a24_23"
    },
    {
        "source_sentence": "即從座起，合掌作禮前白佛言：『世尊是我師，我是聲聞弟子。』",
        "translation": "He rose from his seat, joined his palms and saluted the Buddha in front of him, saying, 'Bhagavān, this is my teacher; I am a śrāvaka disciple.'",
        "source": "T24n1463_001:0804a25_24"
    },
    {
        "source_sentence": "佛即為童子說如是言：『當於四念處親近修行。",
        "translation": "The Buddha then spoke to the boy in this way, saying, 'You must cultivate these four abodes of mindfulness intimately.",
        "source": "T24n1463_001:0804a26_25"
    },
    {
        "source_sentence": "廣演乃至八聖道亦如是。』",
        "translation": "So it is with the extensive explanation up to the eight noble paths.'",
        "source": "T24n1463_001:0804a27_26"
    },
    {
        "source_sentence": "佛告童子言：『汝入諸族姓子聚落心莫染著，猶如月照世間無所染著，汝入諸聚落心無染著亦復如是。",
        "translation": "The Buddha told the boy, 'You enter into the minds of clansmen and villagers without defiled attachment, just as the moon shines in the world without defiled attachment, so you enter into the minds of villagers without defiled attachment.",
        "source": "T24n1463_001:0804a28_27"
    },
    {
        "source_sentence": "如蜂採花，入諸聚落亦應如是。",
        "translation": "It's like a bee gathering flowers and entering villages in the same way.",
        "source": "T24n1463_001:0804b01_28"
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T24n1463_001:0804b02_29"
    },
    {
        "source_sentence": "如真陀羅童子喻，當捨恃姓財德之心，應當謙下入於聚落。",
        "translation": "It's like the metaphor for the true dhāraṇī boy, who should abandon the mind of relying on his family name and wealth and virtue and enter the village humbly.",
        "source": "T24n1463_001:0804b02_30"
    },
    {
        "source_sentence": "如牛群中大牛自恃角峯慢於餘者，當時刖角慢心都息，汝入聚落心無染著亦應如是。』",
        "translation": "It's like when a large cow among the herd of cattle prides itself in horns and peaks and conceits about others, the horns and horns at that point stop conceit, and so it should be with you entering a village whose mind isn't stained by attachment.'",
        "source": "T24n1463_001:0804b03_31"
    },
    {
        "source_sentence": "佛告童子：『內六入莫取想，封著繫縛心也。",
        "translation": "The Buddha told the boy, 'Don't think of the six internal sense-fields as being bound to the mind that's fettered.",
        "source": "T24n1463_001:0804b05_32"
    },
    {
        "source_sentence": "外六入乃至中六識亦如是，色陰亦不應封著取想，乃至識陰亦如是。",
        "translation": "The same applies to the six external sense-fields and up to the six forms of consciousness in the intermediate one. Nor should the aggregate matter also be attached to grasping and conceptual identification. The same applies up to the aggregate consciousness.",
        "source": "T24n1463_001:0804b06_33"
    },
    {
        "source_sentence": "眼耳鼻舌身意及外六塵，得覺觀意觀亦應如是不取想也。",
        "translation": "The eyes, ears, nose, tongue, body, mind, and the six external objects of perception, contemplation, and thought should also thus be perceived as not grasping perceptions.",
        "source": "T24n1463_001:0804b08_34"
    },
    {
        "source_sentence": "譬如空中水渧，渧渧相尋無有滯礙。",
        "translation": "It's like a drop of water in the sky, and there's no obstruction when you look at it.",
        "source": "T24n1463_001:0804b09_35"
    },
    {
        "source_sentence": "觀十八界、十二入、五陰等不取著，心無罣礙亦復如是。",
        "translation": "Observing the 18 realms, 12 sense-fields, five aggregates, and so forth without clinging, and mind without obstruction is likewise.",
        "source": "T24n1463_001:0804b10_36"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1463_001:0804b11_37"
    },
    {
        "source_sentence": "汝如此應學。』",
        "translation": "You should train like this.'",
        "source": "T24n1463_001:0804b12_38"
    },
    {
        "source_sentence": "童子白佛言：『奉世尊教。』",
        "translation": "The boy said to the Buddha, 'Follow the Bhagavān's teaching.'",
        "source": "T24n1463_001:0804b12_39"
    },
    {
        "source_sentence": "爾時童子聞佛世尊引諸譬喻種種說法，即悟取解。",
        "translation": "It was then that the boy heard the Bhagavān cite various metaphors and explanations of the Buddha's teaching, and he awakened to their understanding.",
        "source": "T24n1463_001:0804b12_40"
    },
    {
        "source_sentence": "童子受法已，即從座起遶佛三匝禮佛而去。",
        "translation": "After he had received the teaching, the boy rose from his seat, circumambulated the Buddha three times, saluted him three times, and departed.",
        "source": "T24n1463_001:0804b14_41"
    },
    {
        "source_sentence": "到一樹下端身繫念佛所說法七日七夜，至八日朝，諸漏已盡、三明六通、具八解脫、證阿羅漢果。",
        "translation": "On the seventh day and night, on the eighth day of the month, he sat under a tree with his palms joined in remembrance of the Buddha’s teaching for seven days and nights. On the eighth day at dawn, all the contaminants had been extinguished, the three sciences and six supernatural knowledges were completed, the eight liberations were complete, and he realized the fruit of arhatship.",
        "source": "T24n1463_001:0804b15_42"
    },
    {
        "source_sentence": "得阿羅漢果已，往至佛所，頭面著地禮佛已却坐一面，白佛言：『世尊！",
        "translation": "Having attained the quality of arhatship, he went to the Buddha, bowed his head and face to the ground, withdrew to sit at one side, and said to the Buddha, 'Bhagavān!",
        "source": "T24n1463_001:0804b17_43"
    },
    {
        "source_sentence": "我先聞如來所說法，七日七夜至八日朝，諸漏已盡心得解脫，得三明六通獲阿羅漢果。",
        "translation": "I've previously heard the Tathāgata teach the Dharma for seven days, seven nights, seven nights, until the eighth day in the morning, and my contaminants have ended, my mind has been liberated, and I've attained the three insights and six supernormal powers to attain the fruit of arhatship.",
        "source": "T24n1463_001:0804b18_44"
    },
    {
        "source_sentence": "譬如有人說言：「有一大象高於七肘，復有一樹高六肘半。」",
        "translation": "It's like someone who says, There's a large elephant seven feet high and another tree six and a half feet high.",
        "source": "T24n1463_001:0804b20_45"
    },
    {
        "source_sentence": "說言此樹能蔭象者，無有是處。",
        "translation": "There's no place to say that this tree can shade an elephant.",
        "source": "T24n1463_001:0804b22_46"
    },
    {
        "source_sentence": "若有得羅漢果，三明六通具八解脫，能過我者無有是處。』",
        "translation": "If someone has attained the fruit of the arhat, the three insights and six supernormal powers are endowed with the eight liberations, and there's no place for someone who can surpass me.'",
        "source": "T24n1463_001:0804b22_47"
    },
    {
        "source_sentence": "佛告迦葉：『善哉善哉！",
        "translation": "The Buddha told Kāśyapa, 'Good, good!'",
        "source": "T24n1463_001:0804b24_48"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T24n1463_001:0804b24_49"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T24n1463_001:0804b24_50"
    },
    {
        "source_sentence": "汝於我所說法中種種諸喻，深悟無生，得阿羅漢果。』",
        "translation": "In the various metaphors in my explanation of the teaching, you've deeply realized nonarising and attained the fruit of arhatship.'",
        "source": "T24n1463_001:0804b25_0"
    },
    {
        "source_sentence": "即是受具足戒也。",
        "translation": "That's when he receives the full set of precepts.",
        "source": "T24n1463_001:0804b26_1"
    },
    {
        "source_sentence": "「爾時世尊因是事故集諸比丘告言：『我先為迦葉說如此法，汝等今日皆修行之。』",
        "translation": "It was then that the Bhagavān gathered the monks for this reason and told them, 'First, I explained this teaching to Kāśyapa, so you must all cultivate it today.'",
        "source": "T24n1463_001:0804b27_0"
    },
    {
        "source_sentence": "佛復告諸比丘：『從今已去，聽汝等立善根上受具。』",
        "translation": "Again, the Buddha told the monks, 'From now on, I'll listen to you as you establish good roots and receive their provisions.'",
        "source": "T24n1463_001:0804b28_1"
    },
    {
        "source_sentence": "佛告諸比丘：『過去諸佛、未來諸佛皆立善根上受具，我今亦復如是。』",
        "translation": "The Buddha told the monks, 'All the buddhas of the past and future buddhas established good roots to receive their provisions, and so am I now.'",
        "source": "T24n1463_001:0804b29_2"
    },
    {
        "source_sentence": "是名立善根上受具也。",
        "translation": "This is called establishing the accumulation of good roots that are received above.",
        "source": "T24n1463_001:0804c02_3"
    },
    {
        "source_sentence": "「爾時尊者迦葉即從座起，偏袒右肩右膝著地合掌禮佛，白佛言：『世尊！",
        "translation": "At that point, Venerable Kāśyapa rose from his seat, bared his right shoulder, knelt with his right knee on the ground, joined his palms and saluted the Buddha, said to him, 'Bhagavān!",
        "source": "T24n1463_001:0804c03_0"
    },
    {
        "source_sentence": "我等於如來法中，住何等法？",
        "translation": "Among the teachings of the Tathāgata, what should we abide in?",
        "source": "T24n1463_001:0804c04_1"
    },
    {
        "source_sentence": "修何等法？",
        "translation": "What kinds of dharmas are cultivated?",
        "source": "T24n1463_001:0804c05_2"
    },
    {
        "source_sentence": "行法之人有何差別？』",
        "translation": "What's the difference between those who practice the Dharma and those who do so?'",
        "source": "T24n1463_001:0804c05_3"
    },
    {
        "source_sentence": "佛言：『善哉善哉！",
        "translation": "The Buddha said, 'Good, good!",
        "source": "T24n1463_001:0804c05_4"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T24n1463_001:0804c06_5"
    },
    {
        "source_sentence": "汝之所問甚善，如泉涌出不可窮盡。",
        "translation": "Your question is as good as a fountain that wells up and flows out without limit.",
        "source": "T24n1463_001:0804c06_6"
    },
    {
        "source_sentence": "所問住修乃至差別，言辭義理所問無滯。』",
        "translation": "What's asked about abiding, cultivating, and even differentiating, words, meanings, and principles are asked without obstruction.'",
        "source": "T24n1463_001:0804c07_7"
    },
    {
        "source_sentence": "佛告迦葉：『四聖種是住處，十二頭陀名為行處，盡諸有漏名為差別。』",
        "translation": "The Buddha told Kāśyapa, 'The four noble seeds are the dwelling places, the twelve ascetics are called the place of practice, and the extinction of contaminants is called distinction.'",
        "source": "T24n1463_001:0804c08_8"
    },
    {
        "source_sentence": "「迦葉白佛言：『四聖種、十二頭陀乃至漏盡解脫，當頂戴奉行。",
        "translation": "Kāśyapa said to the Buddha, 'The four noble types, the twelve ascetics, and even the liberation from the contaminants will be carried out on their heads.",
        "source": "T24n1463_001:0804c10_0"
    },
    {
        "source_sentence": "若長者若長者子，沐浴香湯以上衣服而自莊飾，更有人來以好花鬘繫其頂上。",
        "translation": "If an elder or a son of an elder bathes in scented hot water, he adorns himself with his upper garments and clothes, and another person comes to tie them around his head with a flower garland of good flowers.",
        "source": "T24n1463_001:0804c11_1"
    },
    {
        "source_sentence": "我等亦復如是，頂戴如來所告勅法。』",
        "translation": "We're likewise, carrying the Tathāgata's instructions on our heads.'",
        "source": "T24n1463_001:0804c13_2"
    },
    {
        "source_sentence": "佛告迦葉：『汝云何復住四聖種中？』",
        "translation": "The Buddha told Kāśyapa, 'How do you further abide in the four noble seeds?'",
        "source": "T24n1463_001:0804c14_0"
    },
    {
        "source_sentence": "迦葉白佛：『一者隨前所得糞掃衣以為足想；",
        "translation": "Kāśyapa said to the Buddha:",
        "source": "T24n1463_001:0804c14_1"
    },
    {
        "source_sentence": "二者見前人所著糞掃衣亦讚歎之；",
        "translation": "The second is to praise the garbage and sweeping clothes worn by those who have gone before them.",
        "source": "T24n1463_001:0804c15_2"
    },
    {
        "source_sentence": "三者自見所著糞掃衣，不自恃譏彼；",
        "translation": "The third is the principle of self-restraint, not relying on others or criticizing oneself for wearing robes made of rags.",
        "source": "T24n1463_001:0804c16_3"
    },
    {
        "source_sentence": "四者得飲食乃至病瘦湯藥，隨所得以為足想，又復不自恃譏彼。",
        "translation": "Fourth, he obtains food and drink or even medicine for illnesses that are thin, thinks of whatever he gets as sufficient, and doesn't rely on himself to criticize them.",
        "source": "T24n1463_001:0804c17_4"
    },
    {
        "source_sentence": "又於他人不生此念：「彼人勝我、彼人不如我。」",
        "translation": "Again, he doesn't think to others, That person is superior to me and that person isn't like me.",
        "source": "T24n1463_001:0804c18_5"
    },
    {
        "source_sentence": "復不念言：「彼人似我、此人不似我。」",
        "translation": "Again, he doesn't think, That person resembles me and this person doesn't resemble me.",
        "source": "T24n1463_001:0804c19_6"
    },
    {
        "source_sentence": "復不生心：「此人卑我、彼人不卑我。」",
        "translation": "Again, he doesn't give rise to the thought, This person despises me and that person doesn't despise me.",
        "source": "T24n1463_001:0804c20_7"
    },
    {
        "source_sentence": "復不念言：「彼人妙我、彼人不妙我。」",
        "translation": "Again, he doesn't think, That person is a marvelous self and that person isn't a marvelous self.",
        "source": "T24n1463_001:0804c21_8"
    },
    {
        "source_sentence": "世人皆與上相違，而我如上也。』",
        "translation": "The people of the world are all at odds with the above, but I am like the above.'",
        "source": "T24n1463_001:0804c22_9"
    },
    {
        "source_sentence": "佛告迦葉：『四聖種住應如是學。",
        "translation": "The Buddha told Kāśyapa, 'The four noble types of people who live should thus train.",
        "source": "T24n1463_001:0804c22_10"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T24n1463_001:0804c23_11"
    },
    {
        "source_sentence": "云何復欲行十二頭陀？』",
        "translation": "How do you further want to practice the twelve ascetics?'",
        "source": "T24n1463_001:0804c23_12"
    },
    {
        "source_sentence": "迦葉白佛言：『一者常自行空閑靜處，亦當讚彼閑靜之處；",
        "translation": "Kāśyapa said to the Buddha: First, if one always practices self-discipline in an empty and secluded place, one should also praise that quiet spot.",
        "source": "T24n1463_001:0804c24_13"
    },
    {
        "source_sentence": "二者乞食；",
        "translation": "The second is begging for food.",
        "source": "T24n1463_001:0804c25_14"
    },
    {
        "source_sentence": "三者糞掃衣；",
        "translation": "The third is the robe made of rags.",
        "source": "T24n1463_001:0804c25_15"
    },
    {
        "source_sentence": "四者若有瞋心止不食，滅已乃食；",
        "translation": "The fourth is that if an angry person stops eating and does not eat, he eats after having eliminated it.",
        "source": "T24n1463_001:0804c26_16"
    },
    {
        "source_sentence": "五者一坐食；",
        "translation": "The fifth is the food of one seat.",
        "source": "T24n1463_001:0804c26_17"
    },
    {
        "source_sentence": "六者一時受取；",
        "translation": "The sixth is that they receive and grasp at one time.",
        "source": "T24n1463_001:0804c27_18"
    },
    {
        "source_sentence": "七者常塚間行；",
        "translation": "The seventh is always traveling among the tomb mounds.",
        "source": "T24n1463_001:0804c27_19"
    },
    {
        "source_sentence": "八者露地坐；",
        "translation": "The eighth is sitting in the open air.",
        "source": "T24n1463_001:0804c27_20"
    },
    {
        "source_sentence": "九者樹下坐；",
        "translation": "The ninth is to sit under a tree.",
        "source": "T24n1463_001:0804c28_21"
    },
    {
        "source_sentence": "十者常坐不臥；",
        "translation": "The tenth is that they always sit and do not lie down.",
        "source": "T24n1463_001:0804c28_22"
    },
    {
        "source_sentence": "十一者隨得敷具；",
        "translation": "The eleventh is to provide provisions as they are obtained.",
        "source": "T24n1463_001:0804c28_23"
    },
    {
        "source_sentence": "十二者齊三衣。",
        "translation": "The twelveth is the same as the three garments.",
        "source": "T24n1463_001:0804c29_24"
    },
    {
        "source_sentence": "如此等法皆應讚歎，亦不自恃譏彼，乃至少欲，眾具知足、眾具廣示於人。』",
        "translation": "Such things should all be praised, and they don't rely on themselves or criticize them, even to the point where they have few desires, are well endowed with knowledge and shown to people.'",
        "source": "T24n1463_001:0804c29_25"
    },
    {
        "source_sentence": "佛告迦葉：『善哉善哉！",
        "translation": "The Buddha told Kāśyapa, 'Good, good!'",
        "source": "T24n1463_001:0805a02_26"
    },
    {
        "source_sentence": "如汝所言，行十二頭陀正應如是。』",
        "translation": "As you say, the twelve ascetic practices should be exactly like this.'",
        "source": "T24n1463_001:0805a02_27"
    },
    {
        "source_sentence": "佛復告迦葉：『汝可隨吾按行林藪。』",
        "translation": "Again, the Buddha told Kāśyapa, 'Follow me and follow me to the forest.'",
        "source": "T24n1463_001:0805a03_28"
    },
    {
        "source_sentence": "迦葉答言：『奉世尊告。』",
        "translation": "Kāśyapa replied, 'Follow the Bhagavān's instructions.'",
        "source": "T24n1463_001:0805a04_29"
    },
    {
        "source_sentence": "佛起而去，迦葉即捉坐具著肩頭隨世尊後。",
        "translation": "When the Buddha rose and departed, Kāśyapa grabbed his sitting cloth and put it on his shoulder, following behind the Bhagavān.",
        "source": "T24n1463_001:0805a04_30"
    },
    {
        "source_sentence": "迦葉隨佛，如師子子隨大師子。",
        "translation": "Kāśyapa follows the Buddha, just as a lion follows a great teacher.",
        "source": "T24n1463_001:0805a05_31"
    },
    {
        "source_sentence": "爾時世尊隨道而行到一樹下，告迦葉言：『汝可為吾於此樹下敷座。』",
        "translation": "It was then that the Bhagavān, following his path, went to a tree and told Kāśyapa, 'Should you spread out your seat under this tree for me?'",
        "source": "T24n1463_001:0805a06_32"
    },
    {
        "source_sentence": "迦葉即奉告，揲僧伽梨四揲敷座。",
        "translation": "Kāśyapa then instructed him to prepare a four-cornered monk's seat on the four sides of his robe.",
        "source": "T24n1463_001:0805a07_33"
    },
    {
        "source_sentence": "如來就坐，迦葉禮佛足。",
        "translation": "The Tathāgata took his seat, and Kāśyapa bowed at the Buddha’s feet.",
        "source": "T24n1463_001:0805a08_34"
    },
    {
        "source_sentence": "世尊以右手按坐，告迦葉言：『此坐甚柔軟。』",
        "translation": "The Bhagavān pressed his seat with his right hand and told Kāśyapa, 'This seat is very soft.'",
        "source": "T24n1463_001:0805a09_35"
    },
    {
        "source_sentence": "迦葉言：『世尊！",
        "translation": "Kāśyapa said, 'Bhagavān!",
        "source": "T24n1463_001:0805a10_36"
    },
    {
        "source_sentence": "此坐實柔軟。",
        "translation": "This seat is really soft and gentle.",
        "source": "T24n1463_001:0805a10_37"
    },
    {
        "source_sentence": "此衣是弟子初出家時衣，此衣新時價直迦尸一國，今價已退可直半國，唯願如來納受此衣。』",
        "translation": "This robe is the robe of the time when the disciple first left home, and this robe was valued as one country in Kāśi when it was new; now that it's worth half a country, I hope the Tathāgata will accept this robe.'",
        "source": "T24n1463_001:0805a10_38"
    },
    {
        "source_sentence": "佛告迦葉：『吾憐愍汝故受此衣。",
        "translation": "The Buddha told Kāśyapa, 'I had pity for you and therefore accepted this robe.",
        "source": "T24n1463_001:0805a12_39"
    },
    {
        "source_sentence": "汝受持何等？』",
        "translation": "What do you accept and uphold?'",
        "source": "T24n1463_001:0805a13_40"
    },
    {
        "source_sentence": "即白佛言：『我當取迦尸迦草糞掃衣中最下者求覓受持。』",
        "translation": "He then said to the Buddha, 'Should I take the lowest of Kāśika's grass dung and sweeping robes and search for and accept them?'",
        "source": "T24n1463_001:0805a13_41"
    },
    {
        "source_sentence": "佛告迦葉：『善哉善哉！",
        "translation": "The Buddha told Kāśyapa, 'Good, good!'",
        "source": "T24n1463_001:0805a15_42"
    },
    {
        "source_sentence": "汝受持迦尸迦草糞掃衣者，多所利益多所安隱。』",
        "translation": "If you accept the robe made of Kāśika's grass and sweeping clothes, they'll bring much benefit and much peace.'",
        "source": "T24n1463_001:0805a15_43"
    },
    {
        "source_sentence": "「爾時世尊與大比丘僧千二百五十人俱，次復遊行摩竭提國，在林中善立摩拘陀樹王下坐。",
        "translation": "“Then the Bhagavat, accompanied by one thousand two hundred and fifty members of the great assembly of monks and bhikṣus, next proceeded on his excursion to the country of Magadha. He was seated at the foot of the king mokoṭa tree in the forest.",
        "source": "T24n1463_001:0805a16_44"
    },
    {
        "source_sentence": "爾時六群比丘於靜房中共談：『迦葉不如阿若憍陳如等善來受具，亦不如毘舍離拔祇子比丘三語受具，亦不如婆盧波斯那比丘白四羯磨受具，此非受具者也。",
        "translation": "It was then that six groups of monks spoke together in the quiet room, saying,'Kāśyapa isn't as good as Ājñāta-kauṇḍinya and so forth to receive the full set of precepts, nor is he as good as Vaiśāriputra, the monk who received the full set of precepts in three words from the monk Vaiśravaṇa, nor is he as good as the",
        "source": "T24n1463_001:0805a18_45"
    },
    {
        "source_sentence": "云何與諸比丘同共布薩羯磨？』",
        "translation": "How do you and the monks share the same upāsaka karma?'",
        "source": "T24n1463_001:0805a23_0"
    },
    {
        "source_sentence": "世尊爾時在樹下，以天耳聞諸比丘在屏處論。",
        "translation": "The Bhagavān was then under a tree, and he heard the monks discussing in a secluded place with his divine ears.",
        "source": "T24n1463_001:0805a23_1"
    },
    {
        "source_sentence": "佛告迦葉：『為吾取水。』",
        "translation": "The Buddha told Kāśyapa, 'Take some water for me.'",
        "source": "T24n1463_001:0805a24_2"
    },
    {
        "source_sentence": "迦葉即持鉢向池取水。",
        "translation": "Kāśyapa then took his bowl and went to the pond to collect water.",
        "source": "T24n1463_001:0805a25_3"
    },
    {
        "source_sentence": "六群比丘見迦葉來到，六群即逆語言：『汝非如五人憍陳如等善來受具，亦不如毘舍離子三語受具，亦不如婆盧波斯那白四羯磨受具。",
        "translation": "When the six groups of monks saw Kāśyapa coming, the six groups spoke in disobedience, saying, 'You're not like the five men Kauṇḍinya and others who came to receive the full set of precepts, nor is it like the three statements received by Vaiśāriputra, nor is it like the four karmas received by Bālāpāsena.",
        "source": "T24n1463_001:0805a25_4"
    },
    {
        "source_sentence": "汝非受具，云何與諸比丘同共布薩羯磨？』",
        "translation": "If you haven't received the full set of precepts, how can you and the monks share the same布薩羯磨?'",
        "source": "T24n1463_001:0805a28_5"
    },
    {
        "source_sentence": "迦葉即答諸比丘言：『世尊為我在多子塔建立善法上受具竟。』",
        "translation": "Kāśyapa then answered the monks, saying, 'Bhagavān, Bhagavān, I've built a good dharma for my many sons in the stūpa to receive the full set of precepts.'",
        "source": "T24n1463_001:0805a29_6"
    },
    {
        "source_sentence": "說此言已，即持水來到佛所奉佛鉢水。",
        "translation": "After he said these words, he came to the Buddha with water and offered him a bowlful of water.",
        "source": "T24n1463_001:0805b02_7"
    },
    {
        "source_sentence": "佛飲已，餘殘持與迦葉。",
        "translation": "After the Buddha had drunk it, he gave the rest to Kāśyapa.",
        "source": "T24n1463_001:0805b03_8"
    },
    {
        "source_sentence": "迦葉取水已，整衣服偏袒右肩，頭面著地禮佛足，合掌白佛言：『六群比丘見向說言：「汝非善來受具，復非三語受具，亦非羯磨受具。",
        "translation": "After he had taken the water, Kāśyapa straightened his clothes, bared his right shoulder, bowed his head and face to the ground at the Buddha's feet, joined his palms, and said to the Buddha, 'The six groups of monks saw him and said, 'You aren't well-come to receive the full set; it's not because you didn't receive the full set in three words or",
        "source": "T24n1463_001:0805b03_9"
    },
    {
        "source_sentence": "云何同僧法事？」",
        "translation": "What's the same as the Dharma service of the saṃgha?",
        "source": "T24n1463_001:0805b06_10"
    },
    {
        "source_sentence": "弟子答諸比丘：「世尊為我在多子塔建立善法上受具。",
        "translation": "The disciples answered the monks, Bhagavān, for my sake, I built a good stūpa of many children and accepted the offerings on top of it.",
        "source": "T24n1463_001:0805b06_11"
    },
    {
        "source_sentence": "汝等當詣佛諮啟取足得與不得？",
        "translation": "Will you go to the Buddha and consult with him, taking what's sufficient and giving what's not?",
        "source": "T24n1463_001:0805b08_12"
    },
    {
        "source_sentence": "隨佛所說當受行之。」』",
        "translation": "Whatever the Buddha teaches, he'll accept and practice it.'",
        "source": "T24n1463_001:0805b08_13"
    },
    {
        "source_sentence": "爾時世尊為欲斷未來諸比丘謗毀心故，告阿難言：『汝往到王舍城，此城中若有諸比丘盡集在大僧坊中。』",
        "translation": "It was then that the Bhagavān, wanting to stop the future monks' slanderous thoughts, told Ānanda, 'Go to the city of Rājagṛha, and if there are all the monks in this city who have gathered here in the great saṃgha hall.'",
        "source": "T24n1463_001:0805b09_14"
    },
    {
        "source_sentence": "阿難即受教而去，至彼即集諸比丘在大僧坊。",
        "translation": "Ānanda then accepted the teaching and departed, and when he arrived there, he gathered the monks in the great saṃgha hall.",
        "source": "T24n1463_001:0805b11_15"
    },
    {
        "source_sentence": "眾僧集已即來白佛：『僧已集竟。",
        "translation": "After the saṃgha had gathered, he came and said to the Buddha, 'The saṃgha has gathered.",
        "source": "T24n1463_001:0805b12_16"
    },
    {
        "source_sentence": "世尊自當知時。』",
        "translation": "Bhagavān, you should know the time for yourself.'",
        "source": "T24n1463_001:0805b13_17"
    },
    {
        "source_sentence": "爾時世尊即詣僧坊，安庠就座右脇而臥，如象王觀諦視迦葉。",
        "translation": "It was then that the Bhagavān approached the saṃgha hall, sat cross-legged on his right side of the seat, and lay down like an elephant king observing Kāśyapa.",
        "source": "T24n1463_001:0805b13_18"
    },
    {
        "source_sentence": "爾時迦葉從座而起，右膝著地頭面禮佛，胡跪合掌白世尊言：『本在家時父終亡後，粟金有九十六斛，金錢有八十億勒沙，自妻顏容璝瑋世之無匹。",
        "translation": "It was then that Kāśyapa rose from his seat, knelt with his right knee touching the ground and faced the Buddha. He bowed to pay respect to him. Kneeling on his knees, he joined his palms and said to the World-honored One: When I was still living at home, when my father passed away, there were ninety-six hu [ounces of gold] worth",
        "source": "T24n1463_001:0805b15_19"
    },
    {
        "source_sentence": "內自思惟：「若有真阿羅漢者當受之出家。」",
        "translation": "He thought to himself, If there's a true arhat, he'll accept it and leave home.",
        "source": "T24n1463_001:0805b18_20"
    },
    {
        "source_sentence": "思惟已，即捨愛斷貪出家求道。",
        "translation": "After contemplating this, he abandons craving and stops craving and leaves home to seek the path.",
        "source": "T24n1463_001:0805b19_21"
    },
    {
        "source_sentence": "世間若有弟子師者，唯佛是也。",
        "translation": "If there are disciples and teachers in the world, it's only the Buddha.",
        "source": "T24n1463_001:0805b20_22"
    },
    {
        "source_sentence": "云何六群謗言不受具也。』",
        "translation": "What are the six groups of people who denigrate and say they won't accept the precepts?'",
        "source": "T24n1463_001:0805b21_0"
    },
    {
        "source_sentence": "又復更言：『世間若有奇色妙寶，不出已有。",
        "translation": "Again, he said, 'If there are extraordinary forms and marvelous treasures in the world, they don't exist.",
        "source": "T24n1463_001:0805b21_1"
    },
    {
        "source_sentence": "非貪財視色，久已捨之，云何方被謗？",
        "translation": "If someone doesn't crave possessions and looks at form, how can they be denigrated after abandoning it for a long time?",
        "source": "T24n1463_001:0805b22_2"
    },
    {
        "source_sentence": "從出家已來，在彼林中十二年，得四禪心乃至五通，未有一念亂心在前。",
        "translation": "For twelve years after leaving home, he stayed in that forest and attained the fourth meditative state of absorption up to the fifth supernormal power. Not a single thought of confusion occurred before him.",
        "source": "T24n1463_001:0805b23_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1463_001:0805b25_0"
    },
    {
        "source_sentence": "見此生死諸行可怖畏故。』",
        "translation": "It's because they see that these births and deaths are terrifying.'",
        "source": "T24n1463_001:0805b25_1"
    },
    {
        "source_sentence": "復次言：『家父在時，用二十億金錢娉妻。",
        "translation": "Furthermore, they say, 'When the father of the family was alive, he used 2 billion to bridle his wife with money.",
        "source": "T24n1463_001:0805b25_2"
    },
    {
        "source_sentence": "一日三時隨時易服，未曾有乏。",
        "translation": "It is easy to drink at any time during the day and three times of the day, never deficient.",
        "source": "T24n1463_001:0805b26_3"
    },
    {
        "source_sentence": "乃至病瘦醫藥及離世八法，恃姓豪貴不曾經心。",
        "translation": "Up to the point where he relies on his family name and wealth, thin medicine for illness, and the eight secular dharmas, he doesn't change his mind.",
        "source": "T24n1463_001:0805b27_4"
    },
    {
        "source_sentence": "雖娉其妻，各修梵行未曾有毀。』",
        "translation": "Even though they marry their wives, each cultivates religious practice without ever disparaging it.'",
        "source": "T24n1463_001:0805b28_5"
    },
    {
        "source_sentence": "迦葉白佛言：『世尊！",
        "translation": "Kāśyapa said to the Buddha, 'Bhagavān!",
        "source": "T24n1463_001:0805b29_6"
    },
    {
        "source_sentence": "我過去世緣以食施辟支佛故，從是以來常樂出家求涅槃解脫。",
        "translation": "In a past life, it was because I gave food to the pratyekabuddhas that I always delighted in leaving home and seeking nirvāṇa and liberation.",
        "source": "T24n1463_001:0805b29_7"
    },
    {
        "source_sentence": "佛自證知。",
        "translation": "The Buddha himself knows it.",
        "source": "T24n1463_001:0805c02_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1463_001:0805c02_9"
    },
    {
        "source_sentence": "心中常自怖畏流轉五道受於生死。",
        "translation": "In his mind, he always fears the five destinies of birth and death.",
        "source": "T24n1463_001:0805c02_10"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T24n1463_001:0805c03_11"
    },
    {
        "source_sentence": "我初至多子塔林中見如來，即生此念：「此即是本出家時所求師也。」",
        "translation": "When I first went to see the Tathāgata in the forest of many children's stūpas, I had this thought, This is the teacher I originally sought when I left home.",
        "source": "T24n1463_001:0805c03_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1463_001:0805c05_13"
    },
    {
        "source_sentence": "我於過去諸佛生於信心，今見世尊生於信心，等無有異。』",
        "translation": "I gave rise to faith in the buddhas of the past, and now I've seen the Bhagavān give rise to faith, which is no different than that.'",
        "source": "T24n1463_001:0805c05_14"
    },
    {
        "source_sentence": "爾時世尊告諸比丘：『若有煩惱結漏未盡，非一切智、復非人師，受此成就大士禮者，頭破作七分。",
        "translation": "It was then that the Bhagavān addressed the monks, saying, 'If someone hasn't ended the bonds of affliction and contaminants, isn't omniscience, and isn't a human teacher, and receives this accomplished bodhisattva homage, their head will be broken into seven parts.",
        "source": "T24n1463_001:0805c06_15"
    },
    {
        "source_sentence": "吾實是煩惱惑累無明闇障皆已永斷、知一切法、為人作師，是故受此人禮。』",
        "translation": "I really am someone who has permanently eliminated the afflictive afflictions, the heavy burden of ignorance and the darkness of affliction, knows all dharmas, and serves as a teacher for others, so I'll accept this person's veneration.'",
        "source": "T24n1463_001:0805c08_16"
    },
    {
        "source_sentence": "「爾時迦葉即白佛言：『諸比丘雖如此謗，亦無憂惱。",
        "translation": "It was then that Kāśyapa said to the Buddha, 'Even though monks denigrate themselves like this, they don't have any grief.",
        "source": "T24n1463_001:0805c10_17"
    },
    {
        "source_sentence": "世尊今時雖復種種讚歎之德，亦不欣悅。",
        "translation": "Although the Bhagavān now praises various virtues, he doesn't delight in them.",
        "source": "T24n1463_001:0805c11_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1463_001:0805c12_19"
    },
    {
        "source_sentence": "我觀能讚所讚是二皆空。",
        "translation": "I observe that what's praised and what's praised are both empty.",
        "source": "T24n1463_001:0805c12_20"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1463_001:0805c13_21"
    },
    {
        "source_sentence": "我得一切無我無人諸法空觀故。",
        "translation": "It's because I attained the contemplation that all things lack self and there's no emptiness of dharmas.",
        "source": "T24n1463_001:0805c13_22"
    },
    {
        "source_sentence": "從爾時世尊在多子塔為我說月光喻、水渧喻已來，心心相續常念此法更無餘想。",
        "translation": "From that time on, the Bhagavān had taught me the metaphor of the moonlight and the water element in the stūpa of many sons, and his mind was always mindful of this teaching without any other thought.",
        "source": "T24n1463_001:0805c14_23"
    },
    {
        "source_sentence": "所以爾者，常繫心在於善法不隨餘念。",
        "translation": "That's why it's so, because the mind is always tied to good qualities and doesn't follow other thoughts.",
        "source": "T24n1463_001:0805c16_24"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T24n1463_001:0805c17_0"
    },
    {
        "source_sentence": "我未見佛時，十二年中常觀地水火風及與三界皆作空想，況於今日遇世尊說法有餘心想？",
        "translation": "When I hadn't seen the Buddha for 12 years, I always contemplated earth, water, fire, wind, and the three realms as emptiness, so why wouldn't I have any other thoughts of mind today when I met the Bhagavān who taught the Dharma?",
        "source": "T24n1463_001:0805c17_1"
    },
    {
        "source_sentence": "亦復無有三世見聞覺知，豈於六群生異念乎？",
        "translation": "Again, there are no three worlds of seeing, hearing, apprehending, and knowing, so why would the six groups of sentient beings have different thoughts?",
        "source": "T24n1463_001:0805c19_2"
    },
    {
        "source_sentence": "世尊為我說四聖種已來，我亦不取味觸之想，見此陰身如四毒蛇，行四威儀心不與俱。",
        "translation": "Since the Bhagavān has explained the four noble seeds for me, I don't take the perception of taste or touch, and I see this aggregate body like four poisonous snakes that act in four manners and aren't accompanied by my mind.",
        "source": "T24n1463_001:0805c20_3"
    },
    {
        "source_sentence": "何以故爾，久知此是過患之本。",
        "translation": "For a long time I have known that this is the root of all these faults and distress.",
        "source": "T24n1463_001:0805c22_4"
    },
    {
        "source_sentence": "觀此五陰念念生滅，亦如五拔刀賊。",
        "translation": "Observing these five aggregates that arise and cease in each thought is like the five pulling out of a thief's sword.",
        "source": "T24n1463_001:0805c23_0"
    },
    {
        "source_sentence": "觀色集色滅、受想行識識集識滅，觀六入空聚落中五拔刀賊，觀於無我。",
        "translation": "He observes the cessation of form that accumulates form, feelings, perception, volition, consciousness, and consciousness that accumulate consciousness, observes the cessation of consciousness, observes the sixth entry into an empty village where five thieves pull out a sword, and observes selflessness.",
        "source": "T24n1463_001:0805c23_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T24n1463_001:0805c25_2"
    },
    {
        "source_sentence": "我觀此身，如器盛不淨流出於外，身隨身觀。",
        "translation": "I observe this body, like a container full of impure water that flows outward and my body observing itself.",
        "source": "T24n1463_001:0805c25_3"
    },
    {
        "source_sentence": "世尊。",
        "translation": "Bhagavān!",
        "source": "T24n1463_001:0805c26_4"
    },
    {
        "source_sentence": "我觀此心，無常迅速如野馬疾風，心隨心觀。",
        "translation": "I observe this mind, which is impermanent and swift like a wild horse with a sudden breeze, and I follow my mind to observe it.",
        "source": "T24n1463_001:0805c26_5"
    },
    {
        "source_sentence": "我觀受苦，生滅代謝如水流燈焰，受隨受觀。",
        "translation": "The self observes the feeling of suffering, and birth and cessation are like water flowing from a flame in a lamp.",
        "source": "T24n1463_001:0805c27_6"
    },
    {
        "source_sentence": "我觀法無我，屬諸因緣，法隨法觀。",
        "translation": "Self observes that dharmas lack self, belong to causes and conditions, and contemplates dharmas according to dharmas.",
        "source": "T24n1463_001:0805c28_7"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T24n1463_001:0805c29_8"
    },
    {
        "source_sentence": "我於如來所說法中，無有錯謬當頂戴奉行。",
        "translation": "In the teachings of the Tathāgata, there's nothing wrong with me carrying them on my head and venerating them.",
        "source": "T24n1463_001:0805c29_9"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T24n1463_001:0806a01_10"
    },
    {
        "source_sentence": "我於爾時王舍城千二百五十僧中，眾僧行籌唱言：「誰是應真可捉此籌。」",
        "translation": "At the time, among the one thousand two hundred and fifty monks in Rājagṛha, the saṃgha gathered their chips and called out, Who is it that should really be able to grasp this chip?",
        "source": "T24n1463_001:0806a01_11"
    },
    {
        "source_sentence": "我於爾時即拔此籌。",
        "translation": "At that point, I'll pull out this chip.",
        "source": "T24n1463_001:0806a03_12"
    },
    {
        "source_sentence": "若不遇如來出世，應得辟支佛而入涅槃。",
        "translation": "If someone doesn't meet the Tathāgata appearing in the world, they should attain pratyekabuddha and enter nirvāṇa.",
        "source": "T24n1463_001:0806a03_13"
    },
    {
        "source_sentence": "所以爾者，曾於諸佛久種善根。",
        "translation": "That's because they've planted good roots in the buddhas for a long time.",
        "source": "T24n1463_001:0806a04_14"
    },
    {
        "source_sentence": "我於爾時在畢波羅石窟中卒遇小患，世尊故來問疾。",
        "translation": "At the time, I was suddenly suffering from a minor illness in the stone cave of Pippala, and the Bhagavān had come to ask about my illness.",
        "source": "T24n1463_001:0806a05_15"
    },
    {
        "source_sentence": "但窟小身大，我即以手舉此石窟令大。",
        "translation": "It's just that the cave is small and the body is large, so I lifted this rock cave with my hand and made it big.",
        "source": "T24n1463_001:0806a06_16"
    },
    {
        "source_sentence": "世尊即入為我說苦空法也。",
        "translation": "Bhagavān, that's when he entered into the teaching of suffering and emptiness for me.",
        "source": "T24n1463_001:0806a07_17"
    },
    {
        "source_sentence": "爾時我在畢波羅窟中入火光三昧，是時帝釋梵王來禮我足，復有一人捉刀欲害。",
        "translation": "At the time, I was entering the fire-light samādhi in the cave of Pippala, and then Indra Brahmā came to pay homage at my feet, and another person grabbed a sword and wanted to harm me.",
        "source": "T24n1463_001:0806a09_0"
    },
    {
        "source_sentence": "我從定出，觀此二人平等無異。』",
        "translation": "I'll emerge from concentration and observe that these two people are equal and not different.'",
        "source": "T24n1463_001:0806a10_1"
    },
    {
        "source_sentence": "復言：『我在大眾及與私房威儀無異。",
        "translation": "Again, he said, 'There's no difference between my demeanor in the assembled crowd and that of my private dwelling.",
        "source": "T24n1463_001:0806a11_2"
    },
    {
        "source_sentence": "佛告諸比丘：「威儀進止當如迦葉。」",
        "translation": "The Buddha told the monks, Your manner and conduct will be like Kāśyapa.",
        "source": "T24n1463_001:0806a12_3"
    },
    {
        "source_sentence": "我雖聞此言不以喜悅。』",
        "translation": "Even though I hear these words, I don't rejoice with joy.'",
        "source": "T24n1463_001:0806a13_4"
    },
    {
        "source_sentence": "「迦葉復言：『我夜經行及中時乞食，意中生念：「夜短中逼。」",
        "translation": "Kāśyapa again said, 'When I walk through the night and beg for food in the middle of the day, I have this thought in my mind, The night is short and the midnight is hard.'",
        "source": "T24n1463_001:0806a13_5"
    },
    {
        "source_sentence": "舉目上看日月皆住不行，諸天變為人身，前後圍繞供養於我。",
        "translation": "He raised his eyes and looked upward to see the sun and moon, neither standing nor moving, and the gods transformed themselves into human bodies, surrounded me in front and behind him as offerings.",
        "source": "T24n1463_001:0806a14_6"
    },
    {
        "source_sentence": "我於爾時於此事中都無喜歡奇特之心。",
        "translation": "At the time, I didn't have a mind that liked this extraordinary thing.",
        "source": "T24n1463_001:0806a16_7"
    },
    {
        "source_sentence": "我於王舍城中，與千二百五十比丘俱集一處，行籌唱言：「如來滅後，誰能持佛法？」",
        "translation": "In the city of Rājagṛha, I assembled with a thousand two hundred and fifty monks in one place, played chess, and called out, Who will be able to uphold the Buddha's teaching after the Tathāgata's death?",
        "source": "T24n1463_001:0806a17_8"
    },
    {
        "source_sentence": "我於爾時即拔此籌。",
        "translation": "At that point, I'll pull out this chip.",
        "source": "T24n1463_001:0806a19_9"
    },
    {
        "source_sentence": "所以爾者，於論中辯才無制御者，是故拔籌。",
        "translation": "That's why it's so, because there's no control of the eloquence in the treatise, so he pulls out the chip.",
        "source": "T24n1463_001:0806a19_10"
    },
    {
        "source_sentence": "若有正問：「於五欲中誰不重染？」",
        "translation": "Suppose someone asks, Who among the five desires isn't heavily stained?",
        "source": "T24n1463_001:0806a20_11"
    },
    {
        "source_sentence": "應說我是。",
        "translation": "You should say that it's self.",
        "source": "T24n1463_001:0806a21_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1463_001:0806a21_13"
    },
    {
        "source_sentence": "於三有中善得解脫故。",
        "translation": "It's because they well attain liberation in the three existences.",
        "source": "T24n1463_001:0806a21_14"
    },
    {
        "source_sentence": "若有人問：「於根力覺道，誰能成就？」",
        "translation": "Suppose someone asks, Who can accomplish the awakening path of faculties and powers?",
        "source": "T24n1463_001:0806a22_15"
    },
    {
        "source_sentence": "我於此中能師子吼。",
        "translation": "Here, I can give a lion's roar.",
        "source": "T24n1463_001:0806a23_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1463_001:0806a23_1"
    },
    {
        "source_sentence": "於一切苦集，滅、出離、知味知過，如實見之。",
        "translation": "They truly see all the accumulations of suffering, their cessation, escape, and knowledge of taste and faults as they really are.",
        "source": "T24n1463_001:0806a23_2"
    },
    {
        "source_sentence": "欲如火坑乃至喻於牟戟，欲之過患亦復如是。",
        "translation": "Desire is like a fire pit or even a metaphor for a halberd, and so are the faults and distress of desire.",
        "source": "T24n1463_001:0806a24_3"
    },
    {
        "source_sentence": "我無愛貪永已絕矣。",
        "translation": "The craving for self and the absence of craving for self have been permanently eliminated.",
        "source": "T24n1463_001:0806a25_4"
    },
    {
        "source_sentence": "心緣解脫涅槃，速疾如山頂水，捨於有漏如棄涕唾。",
        "translation": "The mind is conditioned by liberation and nirvāṇa, which is as fast as the water at the top of a mountain and abandons contaminants like throwing away tears and spittle.",
        "source": "T24n1463_001:0806a26_5"
    },
    {
        "source_sentence": "我以廣修四念處乃至八聖道，於八解脫定自在出入，我於神通自在無礙。",
        "translation": "With extensive cultivation of the four abodes of mindfulness up to the eightfold noble path, I freely enter and emerge from the eight liberations in concentration, and I have unimpeded supernormal powers that are unobstructed.",
        "source": "T24n1463_001:0806a27_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T24n1463_001:0806a28_7"
    },
    {
        "source_sentence": "我於眾生有漏無漏種種諸心皆能悉達，我知眾生過去無量宿命。",
        "translation": "I'm able to comprehend the various mental states of sentient beings that are contaminated and uncontaminated, and I know the measureless past lives of sentient beings.",
        "source": "T24n1463_001:0806a29_8"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T24n1463_001:0806b01_9"
    },
    {
        "source_sentence": "我以天眼過於人眼，見眾生生彼死此皆悉見之。",
        "translation": "With my divine eye, which is superior to the human eye, I see all sentient beings born and dying here and there.",
        "source": "T24n1463_001:0806b01_10"
    },
    {
        "source_sentence": "我盡諸有漏，心得解脫慧得解脫。』",
        "translation": "When I exhaust all the contaminants, my mind is liberated and my wisdom attains liberation.'",
        "source": "T24n1463_001:0806b02_11"
    },
    {
        "source_sentence": "「迦葉言：『諸比丘及餘六群大德！",
        "translation": "Kāśyapa said, 'Monks and the other six groups of great virtues!",
        "source": "T24n1463_001:0806b03_12"
    },
    {
        "source_sentence": "莫謂我自歎其德。",
        "translation": "Don't say that I myself praise their virtue.",
        "source": "T24n1463_001:0806b04_13"
    },
    {
        "source_sentence": "所有功德皆已捨之，況復其餘虛假之名。",
        "translation": "All the merits that exist have been abandoned, so why wouldn't they be given to other false names?",
        "source": "T24n1463_001:0806b04_14"
    },
    {
        "source_sentence": "所以說者，為欲利益長夜諸眾生故。』",
        "translation": "That's why they say it because they want to benefit sentient beings for a long time.'",
        "source": "T24n1463_001:0806b05_15"
    },
    {
        "source_sentence": "「佛告迦葉：『善哉善哉！",
        "translation": "The Buddha told Kāśyapa, 'Good, good!",
        "source": "T24n1463_001:0806b06_16"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T24n1463_001:0806b06_17"
    },
    {
        "source_sentence": "汝所利益事，除吾一人，其餘聲聞無能及者。",
        "translation": "The benefits you've offered are beyond those of me alone, and there's no other śrāvaka who can match them.",
        "source": "T24n1463_001:0806b07_18"
    },
    {
        "source_sentence": "汝可為諸六群，愍其癡故，當與懺悔。』",
        "translation": "You may pity the six groups of people for their delusion and give them repentance.'",
        "source": "T24n1463_001:0806b08_19"
    },
    {
        "source_sentence": "「爾時優波離即從座起，偏袒右肩右膝著地合掌禮佛，問世尊言：『一切諸佛皆建立善法上受具不？』",
        "translation": "Upāli then rose from his seat, bared his right shoulder, knelt with his right knee on the ground, joined his palms together, saluted the Buddha, and asked the Bhagavān, 'Have all the buddhas established the good qualities that are received up there?'",
        "source": "T24n1463_001:0806b09_0"
    },
    {
        "source_sentence": "佛告優波離：『非一切諸佛皆建立之。",
        "translation": "The Buddha told Upāli, 'None of the buddhas establish them.",
        "source": "T24n1463_001:0806b11_1"
    },
    {
        "source_sentence": "所以立者，為五濁眾生建立之耳。",
        "translation": "The reason it's established is because it's established for the sake of the five turbid sentient beings.",
        "source": "T24n1463_001:0806b12_2"
    },
    {
        "source_sentence": "五濁者，所謂劫濁、命濁、眾生濁、業濁、煩惱濁。",
        "translation": "The five turbidities are the so-called turbidity of the kalpa, the turbidity of life, the turbidity of sentient beings, the turbidity of karma, and the turbidity of affliction.",
        "source": "T24n1463_001:0806b12_3"
    },
    {
        "source_sentence": "過去未來諸佛亦復如是。",
        "translation": "So it will be with the buddhas of the past and future.",
        "source": "T24n1463_001:0806b13_4"
    },
    {
        "source_sentence": "我今五濁惡世，是故制之。』",
        "translation": "Now, I'm in the five turbid and bad worlds, so I'll restrain them.'",
        "source": "T24n1463_001:0806b14_5"
    },
    {
        "source_sentence": "優波離問佛：『幾處得建立善法上受具滿足？』",
        "translation": "Upāli asked the Buddha, 'How many places can establish good qualities and receive their full fulfillment?'",
        "source": "T24n1463_001:0806b15_0"
    },
    {
        "source_sentence": "佛告優波離：『五處滿足。",
        "translation": "The Buddha told Upāli, 'The five places are fulfilled.",
        "source": "T24n1463_001:0806b16_0"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T24n1463_001:0806b16_1"
    },
    {
        "source_sentence": "一者最後邊身；",
        "translation": "The first is the final, extreme body.",
        "source": "T24n1463_001:0806b16_2"
    },
    {
        "source_sentence": "二者婆醯破羅伽至婆勒伽，先得須陀洹果者是；",
        "translation": "The second is the acquisition of the state of Vṛjiputra up to the state of Vārāṇasī. This is the case when one has previously attained the fruit of stream-entry.",
        "source": "T24n1463_001:0806b17_3"
    },
    {
        "source_sentence": "三者隨順蘇陀夷，諸漏已盡心得解脫；",
        "translation": "The third is to follow Sudarśana and attain liberation of mind after having extinguished all the defilements.",
        "source": "T24n1463_001:0806b18_4"
    },
    {
        "source_sentence": "四者難陀放牛兒；",
        "translation": "The fourth was the cattle herding boy Nanda.",
        "source": "T24n1463_001:0806b19_5"
    },
    {
        "source_sentence": "五者今迦葉。",
        "translation": "Five, the present-day Kāśyapa.",
        "source": "T24n1463_001:0806b19_6"
    },
    {
        "source_sentence": "如來受具戒，非餘聲聞。",
        "translation": "The Tathāgata receives the full set of precepts, not the other śrāvakas.",
        "source": "T24n1463_001:0806b19_7"
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T24n1463_001:0806b20_8"
    },
    {
        "source_sentence": "此五處建立善法上受具而得滿足。』",
        "translation": "These five places establish good qualities and receive the full set of precepts above them and attain their fulfillment.'",
        "source": "T24n1463_001:0806b20_9"
    },
    {
        "source_sentence": "『世尊！",
        "translation": "'Bhagavān!",
        "source": "T24n1463_001:0806b21_10"
    },
    {
        "source_sentence": "有幾處白四羯磨受具而得滿足？』",
        "translation": "How many places did the four white karmas receive the full set of precepts and attain their fulfillment?'",
        "source": "T24n1463_001:0806b21_11"
    },
    {
        "source_sentence": "佛言：『有五處而得滿足。",
        "translation": "The Buddha said, 'There are five places where it's fulfilled.",
        "source": "T24n1463_001:0806b22_12"
    },
    {
        "source_sentence": "一者和上如法；",
        "translation": "The first is that they are harmonious and upright according to the Dharma.",
        "source": "T24n1463_001:0806b22_13"
    },
    {
        "source_sentence": "二者二阿闍梨如法；",
        "translation": "The second is that the two preceptors should follow the Dharma.",
        "source": "T24n1463_001:0806b23_14"
    },
    {
        "source_sentence": "三者七僧清淨；",
        "translation": "The third is the purity of the seven groups of monks.",
        "source": "T24n1463_001:0806b23_15"
    },
    {
        "source_sentence": "四者羯磨成就；",
        "translation": "The fourth is the accomplishment of religious service.",
        "source": "T24n1463_001:0806b23_16"
    },
    {
        "source_sentence": "五者眾僧和合與欲。",
        "translation": "The fifth is the union of all the saṃgha with desire.",
        "source": "T24n1463_001:0806b24_17"
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T24n1463_001:0806b24_18"
    },
    {
        "source_sentence": "此五處不成就，不名滿足。",
        "translation": "These five places are not accomplished, and they aren't called fulfillment.",
        "source": "T24n1463_001:0806b24_19"
    },
    {
        "source_sentence": "此中有四種受具，從善來乃至白四是也。",
        "translation": "Here, there are four kinds of recipients, which are the four that come from goodness up to whiteness.",
        "source": "T24n1463_001:0806b25_20"
    },
    {
        "source_sentence": "「『比丘尼亦有四種受具：一者如摩登祇女是；",
        "translation": "'There are also four kinds of bhikṣuṇīs who receive ordination:",
        "source": "T24n1463_001:0806b27_0"
    },
    {
        "source_sentence": "二者師法是；",
        "translation": "The second is teacher-teaching.",
        "source": "T24n1463_001:0806b28_0"
    },
    {
        "source_sentence": "三者遣使現前是；",
        "translation": "The third is the actuality of sending envoys.",
        "source": "T24n1463_001:0806b28_1"
    },
    {
        "source_sentence": "四者白四羯磨是。",
        "translation": "Fourth, it's the four white karmas.",
        "source": "T24n1463_001:0806b28_2"
    },
    {
        "source_sentence": "勅聽受具、上受具，此二皆作建立善法上受具名說，比丘尼上受具亦建立善法上受具名說。",
        "translation": "These two make the names and explanations of what's received above those who establish good qualities, and the names and explanations of what's received by monks and nuns above those who also establish good qualities above those who receive it.",
        "source": "T24n1463_001:0806b29_3"
    },
    {
        "source_sentence": "是名受具。",
        "translation": "This is called being fully ordained.",
        "source": "T24n1463_001:0806c02_4"
    },
    {
        "source_sentence": "不受具者，異於上受具，名不受具。",
        "translation": "Those who don't accept the full set of precepts are called those who don't accept the full set of precepts, which are different from the above-mentioned ones who accept the full set of precepts.",
        "source": "T24n1463_001:0806c02_5"
    },
    {
        "source_sentence": "若聲聞用善來語授人戒者，不成受具。",
        "translation": "If a śrāvaka uses the words of a good person to confer the precepts on someone, they won't be able to receive them.",
        "source": "T24n1463_001:0806c03_6"
    },
    {
        "source_sentence": "用三語授人戒，亦不得受具。",
        "translation": "He gave the precepts to someone in three words, but he also didn't receive the full set.",
        "source": "T24n1463_001:0806c04_7"
    },
    {
        "source_sentence": "白四羯磨唱不成就者，亦不得受具。",
        "translation": "Those who say the four karmas are not accomplished by chanting them won't be allowed to receive the full set of precepts.",
        "source": "T24n1463_001:0806c04_8"
    },
    {
        "source_sentence": "非法僧，亦不得受具。",
        "translation": "An unlawful monk can't accept the full set of precepts either.",
        "source": "T24n1463_001:0806c05_9"
    },
    {
        "source_sentence": "何者名非法僧？",
        "translation": "What's called an unlawful monk?",
        "source": "T24n1463_001:0806c06_10"
    },
    {
        "source_sentence": "不就戒場、先羯磨後白，又復更作餘羯磨，皆名非法僧。",
        "translation": "If someone doesn't go to the precepts site, first explain the karma before it's explained, or furthermore perform other karmas, they'll all be called an unlawful monk.",
        "source": "T24n1463_001:0806c06_11"
    },
    {
        "source_sentence": "離佛離法離毘尼受具，亦不得具。",
        "translation": "They're free of the Buddha, free of the Dharma, free of the vinaya, and they're also not allowed to receive the full set.",
        "source": "T24n1463_001:0806c07_12"
    },
    {
        "source_sentence": "年不滿二十，不得受具，若受亦不得具。",
        "translation": "If he's under 20 years old, he won't be allowed to receive the requisites, and if he receives them, he won't have the requisites.",
        "source": "T24n1463_001:0806c08_13"
    },
    {
        "source_sentence": "若無和上、若二和上、若三乃至眾多作和上，亦不得受具。",
        "translation": "If there's no superior, or if there are two superiors, or if three or more of them make a superior, they won't be allowed to receive the precepts.",
        "source": "T24n1463_001:0806c09_14"
    },
    {
        "source_sentence": "「『若受戒者、若和上隱身不現，亦不得受具。",
        "translation": "'If someone who has received the precepts or if their superior is concealed and doesn't show them, they won't be allowed to receive the necessities.",
        "source": "T24n1463_001:0806c11_0"
    },
    {
        "source_sentence": "十數眾僧雖滿，若一隱不現、若受戒者不現，亦不得受具。",
        "translation": "Even though there are ten numbers of saṃgha who have fulfilled them, if one is hidden and doesn't appear, or if someone who receives the precepts doesn't appear, they won't be allowed to receive the full set.",
        "source": "T24n1463_001:0806c11_1"
    },
    {
        "source_sentence": "外更不結大界，直結小界，亦不得受具。",
        "translation": "They won't bind the large boundary or directly bind the small boundary, and they won't be allowed to receive the precepts.",
        "source": "T24n1463_001:0806c13_2"
    },
    {
        "source_sentence": "若和上、眾僧、受戒人互在界內外，亦不得受具。",
        "translation": "If the superior, the saṃgha, or the person who receives the precepts are both inside and outside the boundary, they can't accept the necessities either.",
        "source": "T24n1463_001:0806c14_3"
    },
    {
        "source_sentence": "有十三種人，不得作和上、受具：若在家受優婆塞戒若毀破一，有受八齋毀一，若受沙彌十戒毀一，如此人者，後出家亦不得戒，亦不得作和上。",
        "translation": "There are 13 kinds of people who won't be allowed to become a monk or receive the precepts: those at home who accept the layman's precepts and disparage one, those who accept the eight precepts and disparage one, and those who accept the ten precepts and disparage one.",
        "source": "T24n1463_001:0806c15_4"
    },
    {
        "source_sentence": "二者若出家在家破比丘尼淨行，亦不得作和上。",
        "translation": "Second, if a renunciant breaks the monk's or nun's pure practice at home and doesn't do so, he or she won't be allowed to become a monk.",
        "source": "T24n1463_001:0806c18_5"
    },
    {
        "source_sentence": "三者為衣食故，自剃頭著袈裟詐入僧中與僧同法事，此亦不得作和上。",
        "translation": "3. For the sake of food and clothing, he shaves his hair, puts on his reddish-brown robes, and fraudulently enters the saṃgha to perform the same religious duties as the saṃgha, but this doesn't allow him to become a monk.",
        "source": "T24n1463_001:0806c19_6"
    },
    {
        "source_sentence": "四者若有外道人於佛法中出家，後時厭道，不捨戒而去，從外道中還來欲在法中，佛不聽此人在於僧中，亦不得作和上。",
        "translation": "4. If a non-Buddhist renunciant leaves home in the Buddha's teaching and later becomes disillusioned with the teaching, doesn't abandon the precepts and leaves, and returns back from among non-Buddhists to want to stay in the teaching, the Buddha won't allow that person to be heard by the saṃgha, nor will he be allowed to make a monk.",
        "source": "T24n1463_001:0806c21_7"
    },
    {
        "source_sentence": "五者黃門不得作和上。",
        "translation": "Five, the yellow gate mustn't be made into a monk.",
        "source": "T24n1463_001:0806c23_8"
    },
    {
        "source_sentence": "六者殺父。",
        "translation": "Sixth, killing one's father.",
        "source": "T24n1463_001:0806c24_9"
    },
    {
        "source_sentence": "七者殺母。",
        "translation": "The seventh is killing one's mother.",
        "source": "T24n1463_001:0806c24_10"
    },
    {
        "source_sentence": "八者出佛身血。",
        "translation": "Eight, it's the blood that comes out of the Buddha's body.",
        "source": "T24n1463_001:0806c24_11"
    },
    {
        "source_sentence": "九者殺真人羅漢。",
        "translation": "Nine, he kills a true arhat.",
        "source": "T24n1463_001:0806c25_12"
    },
    {
        "source_sentence": "十者破和合僧。",
        "translation": "Ten, it destroys the unity of the saṃgha.",
        "source": "T24n1463_001:0806c25_13"
    },
    {
        "source_sentence": "十一者若非人變形為人者名為非人。",
        "translation": "Eleventh, if someone who isn't a human being transforms into a human being, they're called not a human being.",
        "source": "T24n1463_001:0806c26_14"
    },
    {
        "source_sentence": "十二者若畜生道變形為人者。",
        "translation": "12. If he transforms his form into a human being in the path of animals, then he'll become a human being.",
        "source": "T24n1463_001:0806c26_15"
    },
    {
        "source_sentence": "十三者二根人。",
        "translation": "The thirteenth is a person of the two faculties.",
        "source": "T24n1463_001:0806c27_16"
    },
    {
        "source_sentence": "如是十三種，不任作和上。",
        "translation": "These are the thirteen kinds that can't be made into a monk.",
        "source": "T24n1463_001:0806c28_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1463_001:0806c28_1"
    },
    {
        "source_sentence": "是人無戒故。』」",
        "translation": "That person has no precepts.'",
        "source": "T24n1463_001:0806c28_2"
    },
    {
        "source_sentence": "毘尼母經卷第一",
        "translation": "*Mother of the Vinaya, Volume 1",
        "source": "T24n1463_001:0807a01_0"
    }
]