[
    {
        "source_sentence": "優婆塞戒經卷第三",
        "translation": "Upāsaka Precepts Sutra, Volume 3",
        "source": "T24n1488_003:1046a16_0"
    },
    {
        "source_sentence": "北涼中印度三藏曇無讖譯",
        "translation": "Northern Liang, Central India, translated by the Tripiṭaka Master Dharmakṣema",
        "source": "T24n1488_003:1046a18_0"
    },
    {
        "source_sentence": "攝取品第十三",
        "translation": "Chapter Thirteen: Taking Involvement",
        "source": "T24n1488_003:1046a19_0"
    },
    {
        "source_sentence": "善生言：「世尊！",
        "translation": "Sunetra said, Bhagavān!",
        "source": "T24n1488_003:1046a20_0"
    },
    {
        "source_sentence": "菩薩具足二莊嚴已，云何得畜徒眾弟子？」",
        "translation": "After the bodhisattva is fully endowed with these two adornments, how can he keep his disciples?",
        "source": "T24n1488_003:1046a20_1"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1046a21_2"
    },
    {
        "source_sentence": "應以四攝而攝取之，令離諸惡，增諸善法，至心教詔，猶如一子。",
        "translation": "You should take them in by means of the four methods of salvation, so that they will be freed from evil and increase good qualities. With utmost effort you should teach them like a child.",
        "source": "T24n1488_003:1046a21_3"
    },
    {
        "source_sentence": "不求恩報，不為名稱，不為利養，不求自樂。",
        "translation": "They don’t seek rewards for kindness, don’t seek fame, don’t seek profit and support, and don’t seek self-enjoyment.",
        "source": "T24n1488_003:1046a22_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1046a23_5"
    },
    {
        "source_sentence": "菩薩若無如是等事畜弟子者，名弊惡人，假名菩薩，非義菩薩；",
        "translation": "If an enlightening being does not keep disciples in such a way, they will be called “unworthy and evil people.” They may be called bodhisattvas but that is not meaningful enlightening being.",
        "source": "T24n1488_003:1046a24_0"
    },
    {
        "source_sentence": "名旃陀羅，臭穢不淨，破壞佛法，是人不為十方諸佛之所憐念。",
        "translation": "They're called caṇḍāla, which smells foul and impure and destroys the Buddha's teachings, and these people aren't pitied by the buddhas of the ten directions.",
        "source": "T24n1488_003:1046a25_1"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1046a26_2"
    },
    {
        "source_sentence": "菩薩若能隨時教戒，所言時者，貪、恚、癡時。",
        "translation": "If a bodhisattva can teach the precepts at any time, and what he says is the right time, it's when he's craving, anger, and delusion.",
        "source": "T24n1488_003:1046a27_0"
    },
    {
        "source_sentence": "起貪結時，當為種種說對治法令得除貪；",
        "translation": "When forming the fetter of greed, they should teach various antidotes and enable beings to get rid of greed.",
        "source": "T24n1488_003:1046a27_1"
    },
    {
        "source_sentence": "餘二亦爾。",
        "translation": "The other two are likewise.",
        "source": "T24n1488_003:1046a28_2"
    },
    {
        "source_sentence": "次當教學十二部經，禪定、三昧，分別深義，調其身心，令修六念、不放逸法，",
        "translation": "Next, you should teach them the twelvefold doctrines of the twelve kinds of scriptures: meditation, concentration, and absorption; analyzing their profound meanings, you should tame body and mind so that they cultivate the practice of",
        "source": "T24n1488_003:1046a29_3"
    },
    {
        "source_sentence": "瞻養病苦不生厭心，能忍惡口誹謗罵辱，苦加身心亦當堪忍，設其有苦能為救解，",
        "translation": "Being able to tolerate the pain of nurturing illness and being sick, they won’t become disillusioned. They will be able to endure harsh words, slander, and abuse.",
        "source": "T24n1488_003:1046b01_4"
    },
    {
        "source_sentence": "除其弊惡疑網之心，善知利根、中根、鈍根，教鈍根人令生信心，中根之人能令純淑，",
        "translation": "He rids them of the web of bad thoughts and doubt, knowing well the sharp faculties, the middle faculties, and the dull faculties. He teaches the dull faculties to engender faith, and the middle faculties can make",
        "source": "T24n1488_003:1046b03_5"
    },
    {
        "source_sentence": "利根之人令得解脫。",
        "translation": "A person with sharp faculties causes them to attain liberation.",
        "source": "T24n1488_003:1046b05_6"
    },
    {
        "source_sentence": "若能如是勤教詔者，名義菩薩，是名善人，分陀利花，人中香象，調御丈夫，",
        "translation": "If someone can thus diligently teach and instruct, they're called a bodhisattva of meaning, which is called a good person, the puṇḍarīka flower among men, the fragrant elephant among men, and the tamer",
        "source": "T24n1488_003:1046b06_0"
    },
    {
        "source_sentence": "名大船師。",
        "translation": "He's called the great boat captain.",
        "source": "T24n1488_003:1046b07_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1046b08_0"
    },
    {
        "source_sentence": "寧受惡戒，一日中斷無量命根，終不養畜弊惡弟子不能調伏。",
        "translation": "They'd rather receive bad precepts that cut off measureless life roots in a single day, never feeding or harming bad disciples who can't be disciplined.",
        "source": "T24n1488_003:1046b08_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_003:1046b09_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1046b09_3"
    },
    {
        "source_sentence": "是惡律儀殃齊自身，畜惡弟子不能教誨，乃令無量眾生作惡，能謗無量善妙之法，",
        "translation": "Because these bad forms of restraint and evil deeds are limited to themselves, while the wicked disciples do not teach them. They cause innumerable sentient beings to do evil and they slander innumerable good and",
        "source": "T24n1488_003:1046b10_0"
    },
    {
        "source_sentence": "破和合僧，令多眾生作五無間，是故劇於惡律儀罪。",
        "translation": "To break the harmony of the saṃgha causes many sentient beings to create five kinds of unremittingness, which is why they're subject to the sin of bad restraint.",
        "source": "T24n1488_003:1046b11_1"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1046b13_2"
    },
    {
        "source_sentence": "菩薩二種：一者、在家，二者、出家。",
        "translation": "There are two kinds of bodhisattvas: 1. those who remain householders and 2. those who leave home.",
        "source": "T24n1488_003:1046b13_3"
    },
    {
        "source_sentence": "出家菩薩有二弟子：一者、出家，二者、在家。",
        "translation": "A renunciant bodhisattva has two disciples: one, a renunciant and two, a householder.",
        "source": "T24n1488_003:1046b14_0"
    },
    {
        "source_sentence": "在家菩薩有一弟子，所謂在家。",
        "translation": "Laymen bodhisattvas have one disciple, which is called a layman.",
        "source": "T24n1488_003:1046b14_1"
    },
    {
        "source_sentence": "「出家菩薩教出家者十二部經，隨所犯罪，諭令懺悔。",
        "translation": "A renunciant bodhisattva teaches those who leave home the twelve kinds of scriptures, which instruct and make them repent according to their crimes.",
        "source": "T24n1488_003:1046b15_2"
    },
    {
        "source_sentence": "教習八智，何等為八？",
        "translation": "What are the eight kinds of knowledge?",
        "source": "T24n1488_003:1046b16_3"
    },
    {
        "source_sentence": "一者、法智，二者、義智，三者、時智，四者、知足智，五者、自智，",
        "translation": "1. knowledge of the teaching, 2. knowledge of its meaning, 3. knowledge of the time, 4. knowledge of contentment, and 5. knowledge of one’s own mind.",
        "source": "T24n1488_003:1046b17_4"
    },
    {
        "source_sentence": "六者、眾智，七者、根智，八者、分別智。",
        "translation": "The sixth is knowledge of the multitude, the seventh is knowledge of faculties, and the eighth is discriminating knowledge.",
        "source": "T24n1488_003:1046b18_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1046b19_6"
    },
    {
        "source_sentence": "菩薩摩訶薩若能如是教詔調伏出家弟子，是師弟子二人俱得無量利益，",
        "translation": "If the bodhisattva Mahāsattva can thus instruct and discipline renunciant disciples, these two teachers and disciples will attain immeasurable benefits.",
        "source": "T24n1488_003:1046b19_7"
    },
    {
        "source_sentence": "如是師徒能增三寶。",
        "translation": "Thus, the teacher and disciples can increase the Three Treasures.",
        "source": "T24n1488_003:1046b21_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_003:1046b21_9"
    },
    {
        "source_sentence": "如是弟子知八智已，能勤供養師長和上耆舊有德，能受善語，能勤讀誦，",
        "translation": "Thus, knowing the eight kinds of wisdom, a disciple can diligently offer support to teachers, elders, and senior monks who are virtuous, receive good words, and diligently recite them.",
        "source": "T24n1488_003:1046b21_10"
    },
    {
        "source_sentence": "兼為法施，心不放逸，調伏眾生，能瞻病苦，給施貧乏。",
        "translation": "They are also generous to the Dharma, not lax in their minds. They tame sentient beings and provide for the suffering of sickness and poverty by assisting the poor.",
        "source": "T24n1488_003:1046b23_11"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1046b24_12"
    },
    {
        "source_sentence": "出家菩薩若有在家弟子，亦當先教不放逸法。",
        "translation": "If a renunciant bodhisattva has a homeless disciple, he or she should also first teach the principle of nonfrivolity.",
        "source": "T24n1488_003:1046b24_13"
    },
    {
        "source_sentence": "不放逸者，即是法行；",
        "translation": "The practice of nonfrivolity means the practice of the Dharma.",
        "source": "T24n1488_003:1046b26_0"
    },
    {
        "source_sentence": "供養父母、諸師和上、耆舊有德，施於安樂；",
        "translation": "Making offerings to their parents, teachers, superiors, and senior citizens who are virtuous, they give them peace and comfort.",
        "source": "T24n1488_003:1046b26_1"
    },
    {
        "source_sentence": "至心受戒，不妄毀犯；",
        "translation": "They wholeheartedly receive the precepts and do not falsely violate them.",
        "source": "T24n1488_003:1046b27_2"
    },
    {
        "source_sentence": "受寄不抵；",
        "translation": "They receive and send without resisting.",
        "source": "T24n1488_003:1046b27_3"
    },
    {
        "source_sentence": "見恚能忍；",
        "translation": "They are able to tolerate the anger of views.",
        "source": "T24n1488_003:1046b28_4"
    },
    {
        "source_sentence": "惡口、惡語及無義語，終不為之；",
        "translation": "They never speak harsh words, harsh words, or meaningless words.",
        "source": "T24n1488_003:1046b28_5"
    },
    {
        "source_sentence": "憐愍眾生，於諸國王、長者、大臣，恒生恭敬怖畏之心；",
        "translation": "With compassion for sentient beings, they always have respect and fear toward kings, wealthy people, and ministers.",
        "source": "T24n1488_003:1046b29_6"
    },
    {
        "source_sentence": "能自調伏妻子眷屬，分別怨親，不輕眾生；",
        "translation": "They are able to self-discipline their wives, children, and dependents. Discriminating enemies and friends, they do not despise sentient beings.",
        "source": "T24n1488_003:1046c01_7"
    },
    {
        "source_sentence": "除去憍慢，不親惡友；",
        "translation": "They will rid themselves of arrogance and not associate with bad companions.",
        "source": "T24n1488_003:1046c02_8"
    },
    {
        "source_sentence": "節食、除貪、少欲、知足；",
        "translation": "They eat sparingly, getting rid of craving, having few desires, and being content.",
        "source": "T24n1488_003:1046c02_9"
    },
    {
        "source_sentence": "鬪諍之處，身不往中，乃至戲笑不說惡語，是則名為不放逸法。",
        "translation": "Where there's a fight, his body doesn't go in it, and he doesn't say bad words even when he's laughing, which is called the method of not being careless.",
        "source": "T24n1488_003:1046c03_10"
    },
    {
        "source_sentence": "出家菩薩若畜在家弟子，先當教造不放逸法。",
        "translation": "If a renunciant bodhisattva keeps a homeless disciple, he or she will first teach and create the practice of nonfrivolity.",
        "source": "T24n1488_003:1046c04_11"
    },
    {
        "source_sentence": "受苦樂時，常當共俱。",
        "translation": "When they experience pain and pleasure, they'll always be together.",
        "source": "T24n1488_003:1046c05_12"
    },
    {
        "source_sentence": "設在窮乏有所須者，六物之外有不應惜。",
        "translation": "Suppose someone is in need and needs something, and there's something beyond the six things that shouldn't be spared.",
        "source": "T24n1488_003:1046c06_13"
    },
    {
        "source_sentence": "病時當為求覓所須，瞻病之時不應生厭。",
        "translation": "When he's ill, he should look for what's needed, and when he looks after his illness, he shouldn't become disillusioned.",
        "source": "T24n1488_003:1046c07_14"
    },
    {
        "source_sentence": "若自無物，應四出求；",
        "translation": "If you do not have property yourself, you should seek it out in four ways:",
        "source": "T24n1488_003:1046c08_15"
    },
    {
        "source_sentence": "求不能得，貸三寶物，差已依俗十倍償之，如波斯匿王國之正法。",
        "translation": "When they asked for it but couldn't get it, they lent a gift of the Three Treasures and made a difference to pay it ten times by custom, just like the proper rules of the kingdom of Prasenajit.",
        "source": "T24n1488_003:1046c08_16"
    },
    {
        "source_sentence": "若不能償，復當教言：『汝今多負三寶之物，不能得償，應當勤修得須陀洹果至阿羅漢果。",
        "translation": "If you can't pay it back, you should also tell them, 'Now that you've owen so much to the Three Treasures that you can't pay it back, you should diligently cultivate the attainment of the fruit of stream entry and",
        "source": "T24n1488_003:1046c10_0"
    },
    {
        "source_sentence": "若能至心發菩提心，若教千人於佛法中生清淨信，若壞一人慇重邪見。』",
        "translation": "If someone can arouse the mind of enlightenment with sincerity, teach a thousand people to give rise to pure faith in the Buddha's teachings, and destroy one person's debilitating mistaken view.'",
        "source": "T24n1488_003:1046c12_0"
    },
    {
        "source_sentence": "出家菩薩能教在家如是等事，是師弟子二人俱得無量利益。",
        "translation": "If a renunciant bodhisattva can teach such things at home, these two teachers and disciples will both attain measureless benefits.",
        "source": "T24n1488_003:1046c13_1"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1046c15_0"
    },
    {
        "source_sentence": "在家菩薩若畜在家弟子，亦當先教不放逸法。",
        "translation": "If a layman bodhisattva keeps a layman disciple at home, he or she should also first teach him or her the principle of nonfrivolity.",
        "source": "T24n1488_003:1046c15_1"
    },
    {
        "source_sentence": "不放逸者，供養父母、師長、和上、耆舊、有德，復當供給兄弟、妻子、親友、眷屬、欲行之人及遠至者，",
        "translation": "Those who aren't careless should make offerings to their parents, teachers, elders, superiors, senior citizens, and virtuous people, and they should also make offerings to brothers, wife, friends, relatives, retinues, travelers, and",
        "source": "T24n1488_003:1046c16_2"
    },
    {
        "source_sentence": "所有僮僕作使之人，先給飲食，然後自用。",
        "translation": "The servants who serve the messengers first give food and drink, and then they use it for themselves.",
        "source": "T24n1488_003:1046c18_3"
    },
    {
        "source_sentence": "又復教令信向三寶，苦樂共俱，終不偏獨，隨時賞賜，不令飢寒，終不打罵鞭撻苦楚，",
        "translation": "He also instructed them to believe in the Three Treasures. They were neither mixed up with pain and pleasure nor separated from each other; they would be rewarded at appropriate times, not allowed to suffer hunger or cold, being never beaten or whipped",
        "source": "T24n1488_003:1046c19_4"
    },
    {
        "source_sentence": "應當軟言敦諭教詔。",
        "translation": "They should be gently instructed and instructed.",
        "source": "T24n1488_003:1046c21_5"
    },
    {
        "source_sentence": "設有病者，應當瞻療，隨所乏少，當為求索。",
        "translation": "If there's a sick person, they should be treated, and whatever is lacking, they should ask for it.",
        "source": "T24n1488_003:1046c21_6"
    },
    {
        "source_sentence": "世間之事，悉以教之，婚姻求對無求卑下。",
        "translation": "He teaches them all worldly affairs, seeking to be married and oppressed without seeking inferiority.",
        "source": "T24n1488_003:1046c22_7"
    },
    {
        "source_sentence": "教以如來五部經典，見離壞者，能為和合，既和合已，令增善心。",
        "translation": "The teaching is that when the five scriptures of the Tathāgata are seen to be free from decay and destruction, they can be combined, and once combined, they will cause good thoughts to increase.",
        "source": "T24n1488_003:1046c23_8"
    },
    {
        "source_sentence": "一切出家內外諸道，隨意供養，終不選擇。",
        "translation": "All renunciants of the householder’s paths, both Buddhist and heretical, may make offerings to them as they wish. They will never choose one or the other.",
        "source": "T24n1488_003:1046c25_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_003:1046c26_0"
    },
    {
        "source_sentence": "先以施攝，後當調故，以六和敬而教詔之。",
        "translation": "Because they were first collected by giving and later disciplined, they were instructed to do so with the six kinds of harmonious respect.",
        "source": "T24n1488_003:1046c26_1"
    },
    {
        "source_sentence": "若求財物、商賈、農作、奉事王者，常當至心如法而作。",
        "translation": "If someone asks for property, merchandise, goods, farm produce, or serves the king, they should always do so with sincerity and according to the teaching.",
        "source": "T24n1488_003:1046c27_2"
    },
    {
        "source_sentence": "既得財已，如法守護。",
        "translation": "Having obtained the property, he guards it according to the rules.",
        "source": "T24n1488_003:1046c28_3"
    },
    {
        "source_sentence": "樂為福德，見他作時心生歡喜，是則名為不放逸法。",
        "translation": "Joy is merit, and when he sees others doing it, his mind becomes joyous, which is called the method of not being careless.",
        "source": "T24n1488_003:1046c28_4"
    },
    {
        "source_sentence": "在家菩薩若能教誨在家菩薩如是事者，是師弟子二人俱得無量利益。",
        "translation": "If a layman bodhisattva can teach such things to a layman bodhisattva, these two masters and disciples will both attain measureless benefits.",
        "source": "T24n1488_003:1046c29_5"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1047a02_6"
    },
    {
        "source_sentence": "在家菩薩若得自在，為大國主，擁護民庶猶如一子。",
        "translation": "If a layman bodhisattva attains mastery, he'll be the lord of a great kingdom and embrace the people like a child.",
        "source": "T24n1488_003:1047a02_7"
    },
    {
        "source_sentence": "教離諸惡，修行善法。",
        "translation": "He teaches them to part with evil and cultivate good qualities.",
        "source": "T24n1488_003:1047a03_8"
    },
    {
        "source_sentence": "見作惡者，撾打罵辱，終不斷命。",
        "translation": "When they see evil, they'll be beaten and abused, and their lives won't be cut off.",
        "source": "T24n1488_003:1047a04_9"
    },
    {
        "source_sentence": "財物六分，稅取其一。",
        "translation": "The property was divided into six parts and one part to be collected as a duty.",
        "source": "T24n1488_003:1047a05_10"
    },
    {
        "source_sentence": "見瞋惡者，教修忍辱及不放逸。",
        "translation": "Those who see anger and badness are taught to cultivate patience and nonfrivolity.",
        "source": "T24n1488_003:1047a05_11"
    },
    {
        "source_sentence": "經言柔軟，又能分別善惡之人，見有罪者，忍而不問。",
        "translation": "The sūtras say it's gentle, but it can also discern good and bad people. If they see a sinful person, they tolerate it and don't ask questions.",
        "source": "T24n1488_003:1047a06_12"
    },
    {
        "source_sentence": "隨有財物，常行慧施。",
        "translation": "Wherever he has property, he always practices giving with wisdom.",
        "source": "T24n1488_003:1047a07_13"
    },
    {
        "source_sentence": "任力讀誦五部經典，善能守護身命財物，能化眾生不令作惡。",
        "translation": "They can freely recite the five kinds of scriptures and are well able to guard their bodies, lives, possessions, and property, transforming sentient beings so that they won't do evil.",
        "source": "T24n1488_003:1047a07_14"
    },
    {
        "source_sentence": "見貧窮者，生大憐愍，自於國土常修知足，惡人讒謗終不信受，不以非法求覓財物。",
        "translation": "Seeing the poor, they become greatly compassionate and always cultivate self-control in their own land with knowledge and contentment, and bad people who slander them never believe or accept them, so they don't look for property because of unlawfulness.",
        "source": "T24n1488_003:1047a09_15"
    },
    {
        "source_sentence": "如法護國，遠七種惡：一者、不樂樗蒲圍碁六博，二者、不樂射獵，三者、不樂飲酒，",
        "translation": "They protect their country according to the Dharma and are far removed from seven kinds of evil: first, they don't delight in bowling, gambling, or six-squared chess; second, they don't delight in shooting and hunting;",
        "source": "T24n1488_003:1047a11_16"
    },
    {
        "source_sentence": "四者、不樂欲心，五者、不樂惡口，六者、不樂兩舌，七者、不樂非法取財。",
        "translation": "4. they don't delight in the mind of desire, 5. they don't delight in harsh words, 6. they don't delight in divisive speech, and 7. they don't delight in taking property that's unlawful.",
        "source": "T24n1488_003:1047a13_17"
    },
    {
        "source_sentence": "常樂供養出家之人，能令國人常於王所生父母想，信因信果，見有勝己不生嫉妬，",
        "translation": "They always delight in offering support to renunciant practitioners. They are able to cause the people of their countries to always give rise to thoughts of father and mother at the king’s place, believing in the principle of faith and so forth,",
        "source": "T24n1488_003:1047a14_18"
    },
    {
        "source_sentence": "見己勝他不生憍慢，知恩報恩，小恩大報。",
        "translation": "Seeing themselves superior to others, they don't become conceited, knowing that kindness rewards kindness and lesser kindnesses give greater rewards.",
        "source": "T24n1488_003:1047a16_19"
    },
    {
        "source_sentence": "能伏諸根，淨於三業。",
        "translation": "He can subdue the faculties and purify the three actions.",
        "source": "T24n1488_003:1047a17_20"
    },
    {
        "source_sentence": "讚歎善人，呵責惡人，先意發言，言則柔軟。",
        "translation": "Praising good people and rebuking bad people, he speaks with his mind first, and his words are gentle.",
        "source": "T24n1488_003:1047a17_21"
    },
    {
        "source_sentence": "自無力勢，如法屬他，取他國時，不舉四兵。",
        "translation": "They themselves lack the strength to do so and belong to others in accordance with the Dharma. When they take another country, they do not raise any of the four kinds of troops.",
        "source": "T24n1488_003:1047a18_22"
    },
    {
        "source_sentence": "眾生恐怖，能為救解，常以四攝而攝取之。",
        "translation": "Being frightened, sentient beings are able to rescue and liberate them, always taking care of them with the four refuges.",
        "source": "T24n1488_003:1047a19_23"
    },
    {
        "source_sentence": "善能分別種種法相，不受法者，軟言調之。",
        "translation": "He's good at discerning various characteristics of dharmas, and those who don't accept the teachings are gently disciplined by speaking softly.",
        "source": "T24n1488_003:1047a20_24"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1047a21_25"
    },
    {
        "source_sentence": "菩薩有二種：一者、在家，二者、出家。",
        "translation": "There are two kinds of bodhisattvas: 1. those who remain householders and 2. those who leave home.",
        "source": "T24n1488_003:1047a21_26"
    },
    {
        "source_sentence": "出家菩薩畜二弟子，是不為難；",
        "translation": "It is not difficult for a renunciant bodhisattva to keep two disciples.",
        "source": "T24n1488_003:1047a22_27"
    },
    {
        "source_sentence": "在家菩薩畜一弟子，是乃為難。",
        "translation": "It's difficult for a layman bodhisattva to keep one disciple.",
        "source": "T24n1488_003:1047a23_28"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_003:1047a24_0"
    },
    {
        "source_sentence": "在家之人多惡因緣所纏繞故。」",
        "translation": "It's because laypeople are often tethered by bad causes and conditions.",
        "source": "T24n1488_003:1047a24_1"
    },
    {
        "source_sentence": "優婆塞戒經受戒品第十四",
        "translation": "Upāsaka Precepts Sutra on the Acceptance of the Precepts, Chapter 14",
        "source": "T24n1488_003:1047a25_0"
    },
    {
        "source_sentence": "善生言：「世尊！",
        "translation": "Sunetra said, Bhagavān!",
        "source": "T24n1488_003:1047a26_0"
    },
    {
        "source_sentence": "在家菩薩云何得受優婆塞戒？」",
        "translation": "How can a layman bodhisattva receive the upāsaka precepts?",
        "source": "T24n1488_003:1047a26_1"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1047a27_0"
    },
    {
        "source_sentence": "在家菩薩若欲受持優婆塞戒，先當次第供養六方：東方、南方、西方、北方、下方、上方。",
        "translation": "Laymen bodhisattvas who want to uphold the layman precepts should first make offerings in order to the six directions: east, south, west, north, down, and up.",
        "source": "T24n1488_003:1047a27_1"
    },
    {
        "source_sentence": "言東方者，即是父母，若人有能供養父母衣服、飲食、臥具、湯藥、房舍、財寶，",
        "translation": "If someone is able to support their parents with clothing, food and drink, bedding, bathing water, medicine, dwellings, and property,",
        "source": "T24n1488_003:1047a29_2"
    },
    {
        "source_sentence": "恭敬、禮拜、讚歎、尊重，是人則能供養東方。",
        "translation": "Respect, veneration, veneration, praise, and reverence are the people who can make offerings to the east.",
        "source": "T24n1488_003:1047b01_3"
    },
    {
        "source_sentence": "父母還以五事報之：一者、至心愛念，二者、終不欺誑，三者、捨財與之，",
        "translation": "Their parents also retaliated by five things: 1. affection with sincerity, 2. never deceitful, and 3. giving up their possessions.",
        "source": "T24n1488_003:1047b02_4"
    },
    {
        "source_sentence": "四者、為娉上族，五者、教以世事。",
        "translation": "4. for the sake of a superior family, and 5. to teach worldly affairs.",
        "source": "T24n1488_003:1047b04_5"
    },
    {
        "source_sentence": "「言南方者，即是師長，若有人能供養師長衣服、飲食、臥具、湯藥，",
        "translation": "If someone can make offerings to the teacher in terms of clothing, food and drink, bedding, bathing water, and medicine,",
        "source": "T24n1488_003:1047b05_0"
    },
    {
        "source_sentence": "尊重、讚歎、恭敬禮拜，早起晚臥，受行善教，是人則能供養南方。",
        "translation": "Those who are revered, praised, venerated, respected and venerated, get up early in the morning and lie down late at night, and receive good instruction can then make offerings to the south.",
        "source": "T24n1488_003:1047b06_1"
    },
    {
        "source_sentence": "是師復以五事報之：一者、速教不令失時，二者、盡教不令不盡，三者、勝己不生妬嫉，",
        "translation": "The teacher further reported to him in five ways: first, he quickly taught them not to lose time; second, he taught them all without fail; third, he didn't become jealous of overpowering himself.",
        "source": "T24n1488_003:1047b07_2"
    },
    {
        "source_sentence": "四者、將付嚴師善友，五者、臨終捨財與之。",
        "translation": "Fourth, he'll be entrusted to the good friend of his teacher, and fifth, he'll give him his wealth at the end of his life.",
        "source": "T24n1488_003:1047b09_3"
    },
    {
        "source_sentence": "「言西方者，即是妻子，若有人能供給妻子衣服、飲食、臥具、湯藥、瓔珞、服飾、嚴身之具，",
        "translation": "If someone were to provide his wife with clothing, food and drink, bedding, bathing powder, medicine, jewelry, ornaments, and other necessities of adornment,",
        "source": "T24n1488_003:1047b10_4"
    },
    {
        "source_sentence": "是人則是供養西方。",
        "translation": "That person is an offering to the West.",
        "source": "T24n1488_003:1047b12_5"
    },
    {
        "source_sentence": "妻子復以十四事報之：一者、所作盡心營之，二者、常作終不懈慢，三者、所作必令終竟，",
        "translation": "Their wives and children are further rewarded in fourteen ways: first, they do whatever they want with all their hearts; second, they never become conceited at the end of what they always do; third, they make sure that whatever they do will be done",
        "source": "T24n1488_003:1047b13_6"
    },
    {
        "source_sentence": "四者、疾作不令失時，五者、常為瞻視賓客，六者、淨其房舍臥具，七者、愛敬言則柔軟，",
        "translation": "The fourth is to do so at the time of illness and not let it be lost. The fifth is to always look after their guests; the sixth is to clean their living quarters and bedding, and the seventh is to speak affectionately and",
        "source": "T24n1488_003:1047b15_7"
    },
    {
        "source_sentence": "八者、僮使軟言教詔，九者、善能守護財物，十者、晨起夜寐，十一者、能設淨食，",
        "translation": "The eighth is that the servants are gently instructed by their messengers, and the ninth is that they are well able to guard their possessions.",
        "source": "T24n1488_003:1047b17_8"
    },
    {
        "source_sentence": "十二者、能忍教誨，十三者、能覆惡事，十四者、能瞻病苦。",
        "translation": "12. Being able to tolerate and teach, 13. being able to cover bad things, and 14. being able to look after the suffering of illness.",
        "source": "T24n1488_003:1047b18_9"
    },
    {
        "source_sentence": "「言北方者，即善知識，若有人能供施善友，任力與之，恭敬軟言，禮拜讚歎，",
        "translation": "To the north is to say that it’s a good friend. If there are people who can make offerings to good friends, give them as much power as they can, honoring and speaking softly, venerating and praising them.",
        "source": "T24n1488_003:1047b20_10"
    },
    {
        "source_sentence": "是人則能供養北方。",
        "translation": "That person then can make offerings to the north.",
        "source": "T24n1488_003:1047b21_11"
    },
    {
        "source_sentence": "是善知識復以四事而還報之：一者、教修善法，二者、令離惡法，三者、有恐怖時能為救解，",
        "translation": "Again, the spiritual benefactor answered them in four ways: first, by exhorting them to cultivate good qualities; second, by enabling them to divorce evil qualities; and third, by being able to rescue those who were afraid.",
        "source": "T24n1488_003:1047b22_12"
    },
    {
        "source_sentence": "四者、放逸之時能令除捨。",
        "translation": "4. When he's careless, he can be freed from equanimity.",
        "source": "T24n1488_003:1047b24_13"
    },
    {
        "source_sentence": "「言下方者，即是奴婢，若有人能供給奴婢衣服、飲食、病瘦醫藥，不罵不打，",
        "translation": "Suppose someone were to offer clothing, food and drink, medicine for sickness and thinness, without scolding or beating them.",
        "source": "T24n1488_003:1047b24_14"
    },
    {
        "source_sentence": "是人則能供給下方。",
        "translation": "That person then can make offerings down below.",
        "source": "T24n1488_003:1047b26_15"
    },
    {
        "source_sentence": "奴婢復以十事報之：一者、不作罪過，二者、不待教作，三者、作必令竟，",
        "translation": "Again, the male and female servants should be disciplined in ten ways: first, not committing crimes; second, not waiting for instructions to be done; and third, being bound to finish doing so.",
        "source": "T24n1488_003:1047b27_16"
    },
    {
        "source_sentence": "四者、疾作不令失時，五者、主雖貧窮終不捨離，六者、早起，七者、守物，",
        "translation": "4. When he's sick, he doesn't let it go; 5. although the owner is poor, he never abandons it; 6. rises early; and 7. guards his possessions.",
        "source": "T24n1488_003:1047b28_17"
    },
    {
        "source_sentence": "八者、少恩多報，九者、至心敬念，十者、善覆惡事。",
        "translation": "Eight, few kindnesses are rewarded with many rewards, nine, wholehearted respect, and ten, well-covered bad actions.",
        "source": "T24n1488_003:1047c01_18"
    },
    {
        "source_sentence": "「言上方者，即是沙門、婆羅門等，若有供養沙門、婆羅門衣服、飲食、房舍、臥具、病痛醫藥，",
        "translation": "“The expression ‘upward’ refers to the ascetics and priests. If they make offerings to ascetics and priests, such as clothing, food and drink, dwellings, bedding, and medicine for illness and pain,",
        "source": "T24n1488_003:1047c02_19"
    },
    {
        "source_sentence": "怖時能救，饉世施食，聞惡能遮，禮拜恭敬，尊重讚歎，是人則能供養上方。",
        "translation": "When they're frightened, they can rescue them, offer food to the world, hear evil, obstruct it, venerate it, respect it, honor it, and praise it, and those people are able to make offerings upward.",
        "source": "T24n1488_003:1047c04_20"
    },
    {
        "source_sentence": "是出家人以五種事報：一者、教令生信，二者、教生智慧，三者、教令行施，",
        "translation": "This renunciant is rewarded in five ways: first, by teaching to cause faith to arise; second, by teaching wisdom to arise; and third, by encouraging generosity.",
        "source": "T24n1488_003:1047c05_21"
    },
    {
        "source_sentence": "四者、教令持戒，五者、教令多聞。",
        "translation": "The fourth is to teach and cause them to observe precepts, and the fifth is to teach and cause them to become well-versed.",
        "source": "T24n1488_003:1047c07_22"
    },
    {
        "source_sentence": "「若有供養是六方者，是人則得增長財命，能得受持優婆塞戒。",
        "translation": "If someone makes offerings in these six directions, that person will grow in wealth and livelihood and be able to uphold the lay precepts.",
        "source": "T24n1488_003:1047c08_23"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1047c09_24"
    },
    {
        "source_sentence": "若人欲受優婆塞戒，增長財命，先當諮啟所生父母。",
        "translation": "If someone wants to receive the layman precepts and increase their wealth and life, they must first consult their parents who are born.",
        "source": "T24n1488_003:1047c09_25"
    },
    {
        "source_sentence": "父母若聽，次報妻子，奴婢僮僕。",
        "translation": "If their parents hear it, they'll next report to their wives, servants, and servants.",
        "source": "T24n1488_003:1047c11_0"
    },
    {
        "source_sentence": "此輩若聽，次白國主。",
        "translation": "If these people listen, they'll next tell the king of the country.",
        "source": "T24n1488_003:1047c11_1"
    },
    {
        "source_sentence": "國主聽已，誰有出家發菩提心者，便往其所頭面作禮，軟言問訊，作如是言：『大德！",
        "translation": "After the king heard this, whoever renunciants aroused the mind of enlightenment went to their place, bowed their heads and faces, exchanged soft greetings, and said, 'O great virtuous one!'",
        "source": "T24n1488_003:1047c12_2"
    },
    {
        "source_sentence": "我是丈夫，具男子身，欲受菩薩優婆塞戒，惟願大德愍憐故聽受！』",
        "translation": "I am a man who possesses the body of a man and wants to receive the bodhisattva or layman precepts, so please have mercy on me and listen!'",
        "source": "T24n1488_003:1047c14_0"
    },
    {
        "source_sentence": "是時比丘應作是言：『汝之父母、妻子、奴婢、國主、聽不？』",
        "translation": "The monk then should say, 'Your parents, wives, servants, lords of states, and listeners?'",
        "source": "T24n1488_003:1047c15_1"
    },
    {
        "source_sentence": "若言聽者，復應問言：『汝不曾負佛法僧物及他物也？』",
        "translation": "If someone says they're listening, they should also ask, 'Haven't you ever owe anything to the Buddha, Dharma, Saṃgha, or anyone else?'",
        "source": "T24n1488_003:1047c16_2"
    },
    {
        "source_sentence": "若言不負，復應問言：『汝今身中將無內外身心病也？』",
        "translation": "If you say it's not negative, you should also ask, 'Now, won't you have internal and external illnesses in your body?'",
        "source": "T24n1488_003:1047c18_0"
    },
    {
        "source_sentence": "若言無者，復應問言：『汝不於比丘、比丘尼所作非法耶？』",
        "translation": "If you say it's nonexistent, you should also ask, 'Didn't you do anything unlawful to monks and nuns?'",
        "source": "T24n1488_003:1047c19_1"
    },
    {
        "source_sentence": "若言不作，復應問言：『汝將不作五逆罪耶？』",
        "translation": "If you say you won't do it, you should also ask,'Won't you commit the five heinous crimes?'",
        "source": "T24n1488_003:1047c20_2"
    },
    {
        "source_sentence": "若言不作，復應問言：『汝將不作盜法人不？』",
        "translation": "If you say you won't do it, you should also ask,'Won't you do stealing?'",
        "source": "T24n1488_003:1047c21_3"
    },
    {
        "source_sentence": "若言不作，復應問言：『汝非二根、無根人，壞八戒齋，父母師病不棄去耶？",
        "translation": "If you say you won't do it, you should also ask, 'Are you a person with two faculties or someone without faculties who breaks the eight precepts and doesn't abandon their parents and teachers who are sick?'",
        "source": "T24n1488_003:1047c22_4"
    },
    {
        "source_sentence": "將不殺發菩提心人，盜現前僧物，兩舌惡口，於母、姊妹作非法耶？",
        "translation": "Wouldn't you kill someone who arouses the mind of enlightenment, steal property belonging to the saṃgha in front of you, speak harshly with two tongues, and do something unlawful to your mother or sister?",
        "source": "T24n1488_003:1047c24_5"
    },
    {
        "source_sentence": "不於大眾作妄語乎？』",
        "translation": "Isn't he speaking falsely to the masses?'",
        "source": "T24n1488_003:1047c25_6"
    },
    {
        "source_sentence": "若言無者，復應語言：『善男子！",
        "translation": "If you say it's nonexistent, you should also say, 'Good man!",
        "source": "T24n1488_003:1047c26_7"
    },
    {
        "source_sentence": "優婆塞戒極為甚難！",
        "translation": "It's extremely difficult for a layman to observe the precepts!",
        "source": "T24n1488_003:1047c26_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_003:1047c27_9"
    },
    {
        "source_sentence": "是戒能為沙彌十戒、大比丘戒及菩薩戒，乃至阿耨多羅三藐三菩提而作根本。",
        "translation": "These precepts can serve as the foundation for the ten śrāmaṇer precepts, the great monk precepts, and the bodhisattva precepts, up to unsurpassed, correct, and complete enlightenment.",
        "source": "T24n1488_003:1047c27_10"
    },
    {
        "source_sentence": "至心受持優婆塞戒，則能獲得如是等戒無量利益。",
        "translation": "If someone wholeheartedly accepts and observes the lay precepts, they'll be able to attain measureless benefits from such precepts.",
        "source": "T24n1488_003:1047c29_11"
    },
    {
        "source_sentence": "若有毀破如是戒者，則於無量無邊世中處三惡道，受大苦惱。",
        "translation": "If someone disparages and breaks these precepts, they'll be in the three bad destinies in measureless and limitless worlds and experience great suffering and distress.",
        "source": "T24n1488_003:1048a01_12"
    },
    {
        "source_sentence": "汝今欲得無量利益，能至心受不？』",
        "translation": "Do you now want to attain measureless benefits, can you accept them with sincerity?'",
        "source": "T24n1488_003:1048a02_13"
    },
    {
        "source_sentence": "若言能者，復應語言：『優婆塞戒極為甚難！",
        "translation": "If someone says they can, they should also say, 'The layman's precepts are extremely difficult!'",
        "source": "T24n1488_003:1048a03_14"
    },
    {
        "source_sentence": "若歸佛已，寧捨身命終不依於自在天等；",
        "translation": "If they return to buddhahood, they would rather give up their bodies at death and not rely on the independent gods.",
        "source": "T24n1488_003:1048a04_15"
    },
    {
        "source_sentence": "若歸法已，寧捨身命終不依於外道典籍；",
        "translation": "If they had renounced the householder’s life after having returned to the religion, they would have given up their bodies at death and not relied on non-Buddhist scriptures.",
        "source": "T24n1488_003:1048a05_16"
    },
    {
        "source_sentence": "若歸僧已，寧捨身命終不依於外道邪眾。",
        "translation": "If someone returns to the saṃgha, they'd rather abandon their body and life than rely on a wrong group of non-Buddhists at the end of their life.",
        "source": "T24n1488_003:1048a06_17"
    },
    {
        "source_sentence": "汝能如是至心歸依於三寶不？』",
        "translation": "Can you thus wholeheartedly rely on the Three Treasures?'",
        "source": "T24n1488_003:1048a07_18"
    },
    {
        "source_sentence": "若言能者，復應語言：『善男子！",
        "translation": "If someone says they can, they should also say, 'Good man!",
        "source": "T24n1488_003:1048a08_19"
    },
    {
        "source_sentence": "優婆塞戒極為甚難！",
        "translation": "It's extremely difficult for a layman to observe the precepts!",
        "source": "T24n1488_003:1048a08_20"
    },
    {
        "source_sentence": "若人歸依於三寶者，是人則為施諸眾生無怖畏已；",
        "translation": "If someone relies on the Three Treasures, that person has given them to sentient beings without fear.",
        "source": "T24n1488_003:1048a09_21"
    },
    {
        "source_sentence": "若人能施無怖畏者，是人則得優婆塞戒乃至阿耨多羅三藐三菩提，汝能如是施諸眾生無怖畏不？』",
        "translation": "If someone can give without fear, then they'll attain the layman's precepts up to unsurpassed, correct, and complete enlightenment; can you thus give to sentient beings without fear?'",
        "source": "T24n1488_003:1048a10_22"
    },
    {
        "source_sentence": "若言能者，復應語言：『人有五事現在不能增長財命：何等為五？",
        "translation": "If someone says they're capable, they should also say, 'There are five things that people can't increase their wealth and livelihood in the present:",
        "source": "T24n1488_003:1048a12_23"
    },
    {
        "source_sentence": "一者、樂殺，二者、樂盜，三者、邪婬，四者、妄語，五者、飲酒。",
        "translation": "1. the pleasure of killing, 2. the pleasure of stealing, 3. sexual misconduct, 4. false speech, and 5. drinking alcohol.",
        "source": "T24n1488_003:1048a14_24"
    },
    {
        "source_sentence": "一切眾生因殺生故，現在獲得惡色、惡力、惡名、短命、財物秏減，眷屬分離，",
        "translation": "All sentient beings now attain bad form, bad power, bad reputation, short life, and decreasing possessions because of killing, and their retinues are separated.",
        "source": "T24n1488_003:1048a15_25"
    },
    {
        "source_sentence": "賢聖呵責，人不信用，他人作罪橫羅其殃，是名現在惡業之果。",
        "translation": "Good men and sages rebuke people who don't trust others and blame them for crimes committed by others, which is called the result of bad karma in the present.",
        "source": "T24n1488_003:1048a17_26"
    },
    {
        "source_sentence": "捨此身已，當墮地獄，多受苦惱飢渴長命，惡色、惡力、惡名等事，是名後世惡業之果。",
        "translation": "After abandoning this body, they'll fall into hell, where they'll often experience suffering, hunger, thirst, long life, bad form, bad strength, bad reputation, and so forth, which are called the results of bad actions in later lives.",
        "source": "T24n1488_003:1048a18_27"
    },
    {
        "source_sentence": "若得人身，復受惡色、短命、貧窮。",
        "translation": "If they obtain a human body, they'll again experience bad form, short life, and poverty.",
        "source": "T24n1488_003:1048a20_28"
    },
    {
        "source_sentence": "是一惡人因緣力故，令外一切五穀果蓏悉皆減少，是人殃流，及一天下。",
        "translation": "Because of the power of causes and conditions, one bad person causes all the five grains and fruits that grow externally to decrease, and this person's misfortune flows downward for a day and a night.",
        "source": "T24n1488_003:1048a21_29"
    },
    {
        "source_sentence": "若人樂偷，是人亦得惡色、惡力、惡名、短命、財物秏減，眷屬分離，",
        "translation": "If someone enjoys stealing, they'll also attain bad form, bad strength, bad reputation, short life, and a decreasing amount of possessions, and their followers will be separated.",
        "source": "T24n1488_003:1048a22_30"
    },
    {
        "source_sentence": "他人失物於己生疑，雖親附人人不見信，常為賢聖之所呵責，是名現在惡業之果。",
        "translation": "When another person loses something and doubts about themselves, even though they're closely attached to someone who doesn't believe it, and they're always criticized by good men and sages, this is called the result of bad karma in the present.",
        "source": "T24n1488_003:1048a24_31"
    },
    {
        "source_sentence": "捨此身已，墮於地獄，受得惡色、惡力、惡名、飢渴、苦惱、壽命長遠，",
        "translation": "Having abandoned this body, they'll fall into hell, where they'll experience bad form, bad power, bad reputation, hunger and thirst, pain and suffering, and a long life.",
        "source": "T24n1488_003:1048a26_32"
    },
    {
        "source_sentence": "是名後世惡業之果。",
        "translation": "This is called the result of bad karma in later lifetimes.",
        "source": "T24n1488_003:1048a27_33"
    },
    {
        "source_sentence": "若得人身，貧於財物，雖得隨失，不為父母、兄弟、妻子之所愛念，身常受苦，",
        "translation": "If someone obtains a human body and is poor in possessions, even if they gain or lose whatever they have, they won’t be loved by their parents, brothers, or wives, and their bodies will always experience suffering.",
        "source": "T24n1488_003:1048a28_0"
    },
    {
        "source_sentence": "心懷愁惱。",
        "translation": "He harbored sorrow in his heart.",
        "source": "T24n1488_003:1048a29_1"
    },
    {
        "source_sentence": "是一惡人因緣力故，一切人民凡所食噉，不得色力，是人惡果殃流萬姓。",
        "translation": "Because of the power of causes and conditions, all the people who eat food that they see can't attain physical strength, and this person's bad retribution and misfortune will flow through myriad castes.",
        "source": "T24n1488_003:1048a29_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1048b02_3"
    },
    {
        "source_sentence": "若復有人，樂於妄語，是人現得惡口、惡色，所言雖實，人不信受，眾皆憎惡，",
        "translation": "“Furthermore, suppose there is another person who delights in lying. Such a person now experiences harsh words and bad forms that people will not believe or accept even though what they say, and all the people will hate them.",
        "source": "T24n1488_003:1048b02_4"
    },
    {
        "source_sentence": "不喜見之，是名現世惡業之報。",
        "translation": "Being unhappy to see them is called the result of bad actions in the present life.",
        "source": "T24n1488_003:1048b04_5"
    },
    {
        "source_sentence": "捨此身已，入於地獄，受大苦楚，飢渴熱惱，是名後世惡業之報。",
        "translation": "After abandoning this body, they'll go to hell and experience great pain and suffering, hunger, thirst, heat, and torment. This is called the result of bad karma in later lives.",
        "source": "T24n1488_003:1048b05_6"
    },
    {
        "source_sentence": "若得人身，口不具足，所說雖實，人不信受，見者不樂，雖說正法，人不樂聞。",
        "translation": "If he obtains a human body, his mouth isn't complete, and even though what he teaches is true, people don't believe it or accept it, and those who see it don't delight in it. Even though he teaches the right teaching,",
        "source": "T24n1488_003:1048b06_7"
    },
    {
        "source_sentence": "是一惡人因緣力故，外物一切資產減少。",
        "translation": "Because of the power of one bad person's causes and conditions, all his external possessions will decrease.",
        "source": "T24n1488_003:1048b08_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1048b09_9"
    },
    {
        "source_sentence": "若復有人樂飲酒者，是人現世喜失財物，身心多病，常樂鬪諍，惡名遠聞，",
        "translation": "“Furthermore, if someone enjoys drinking alcohol, they’ll be delighted to lose their possessions in the present life, suffer from many illnesses in body and mind, always enjoy fighting, and have a bad reputation that’s far-reach",
        "source": "T24n1488_003:1048b09_10"
    },
    {
        "source_sentence": "喪失智慧，心無慚愧，得惡色力，常為一切之所呵責，人不樂見，不能修善，",
        "translation": "They lose their wisdom, have no shame in their minds, and attain the power of bad form. They are constantly criticized by everyone. People do not delight in seeing them and cannot cultivate goodness.",
        "source": "T24n1488_003:1048b10_11"
    },
    {
        "source_sentence": "是名飲酒現在惡報。",
        "translation": "This is called drinking alcohol that presents bad retribution in the present.",
        "source": "T24n1488_003:1048b12_12"
    },
    {
        "source_sentence": "捨此身已，處在地獄，受飢渴等無量苦惱，是名後世惡業之果。",
        "translation": "After abandoning this body, they'll be in hell and experience measureless sufferings like hunger and thirst, which are called the results of bad actions in later lives.",
        "source": "T24n1488_003:1048b13_13"
    },
    {
        "source_sentence": "若得人身，心常狂亂，不能繫念思惟善法。",
        "translation": "If he obtains a human body, his mind is always disturbed, and he can't fix his thoughts on or contemplate the good Dharma.",
        "source": "T24n1488_003:1048b14_14"
    },
    {
        "source_sentence": "是一惡人因緣力故，一切外物資產臭爛。",
        "translation": "Because of the power of one bad person's causes and conditions, all his external possessions smell bad and rotten.",
        "source": "T24n1488_003:1048b15_15"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1048b16_16"
    },
    {
        "source_sentence": "若復有人，樂為邪婬，是人不能護自他身，一切眾生見皆生疑，所作之事，",
        "translation": "“Furthermore, if someone enjoys sexual misconduct and is unable to protect themselves or others, all sentient beings will have doubts when they see them.",
        "source": "T24n1488_003:1048b16_17"
    },
    {
        "source_sentence": "妄語在先，於一切時常受苦惱，心常散亂，不能修善，喜失財物，所有妻子心不戀慕，",
        "translation": "They speak falsehood first, always suffering pain and distress at all times. Their minds are always distracted, unable to perform good deeds, happy when they lose their possessions, and not longing for the wife or children they have.",
        "source": "T24n1488_003:1048b18_18"
    },
    {
        "source_sentence": "壽命短促，是名邪婬現在惡果。",
        "translation": "A short life span is called a bad result of sexual misconduct in the present.",
        "source": "T24n1488_003:1048b20_19"
    },
    {
        "source_sentence": "捨此身已，處在地獄，受惡色力，飢渴長命，無量苦惱，是名後世惡業果報。",
        "translation": "After abandoning this body, they'll be in hell and experience the results of bad form powers, hunger, thirst, long life, and measureless suffering and distress.",
        "source": "T24n1488_003:1048b20_20"
    },
    {
        "source_sentence": "若得人身，惡色、惡口，人不喜見，不能守護妻妾男女。",
        "translation": "If he obtains a human body with bad form and bad words, people won't like to see it, and they can't guard their wives, concubines, or men.",
        "source": "T24n1488_003:1048b22_21"
    },
    {
        "source_sentence": "是一惡人因緣力故，一切外物不得自在。",
        "translation": "Because of the power of one bad person's causes and conditions, all external things won't attain mastery.",
        "source": "T24n1488_003:1048b23_22"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1048b24_23"
    },
    {
        "source_sentence": "是五惡法，汝今真實能遠離不？』",
        "translation": "Are these the five bad qualities that you can really get rid of now?'",
        "source": "T24n1488_003:1048b24_24"
    },
    {
        "source_sentence": "若言能者，復應語言：『善男子！",
        "translation": "If someone says they can, they should also say, 'Good man!",
        "source": "T24n1488_003:1048b25_25"
    },
    {
        "source_sentence": "受優婆塞戒，有四事法所不應作！",
        "translation": "Accepting the lay precepts, there are four things you shouldn't do!",
        "source": "T24n1488_003:1048b26_26"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T24n1488_003:1048b26_27"
    },
    {
        "source_sentence": "為貪因緣不應虛妄，為瞋恚、癡、恐怖因緣，不應虛妄；",
        "translation": "It should not be false because it is the cause of craving. It should not be false because it is the cause of hatred, delusion, and fear.",
        "source": "T24n1488_003:1048b27_28"
    },
    {
        "source_sentence": "是四惡法汝能離不？』",
        "translation": "Can you be free of these four bad qualities?'",
        "source": "T24n1488_003:1048b28_29"
    },
    {
        "source_sentence": "若言能者，復應語言：『善男子！",
        "translation": "If someone says they can, they should also say, 'Good man!",
        "source": "T24n1488_003:1048b28_30"
    },
    {
        "source_sentence": "受優婆塞戒，有五處所所不應遊：屠兒、婬女、酒肆、國王、旃陀羅舍，",
        "translation": "Accepting the lay precepts, there are five places where they shouldn't travel: butchers, promiscuous women, wine shops, kings, and caṇḍāla houses.",
        "source": "T24n1488_003:1048b29_31"
    },
    {
        "source_sentence": "如是五處，汝能離不？』",
        "translation": "Can you be free of these five places?'",
        "source": "T24n1488_003:1048c01_32"
    },
    {
        "source_sentence": "若言能者，復應語言：『善男子！",
        "translation": "If someone says they can, they should also say, 'Good man!",
        "source": "T24n1488_003:1048c02_33"
    },
    {
        "source_sentence": "受優婆塞戒，復有五事所不應作：一者、不賣生命，二者、不賣刀劍，",
        "translation": "There are another five things you shouldn't do when you receive the lay precepts: 1. not selling life; 2. not selling swords and swords;",
        "source": "T24n1488_003:1048c03_0"
    },
    {
        "source_sentence": "三者、不賣毒藥，四者、不得沽酒，五者、不得壓油；",
        "translation": "The third is that they should not sell poisonous medicines. The fourth is that they should not sell alcohol and the fifth is that they should not press oil.",
        "source": "T24n1488_003:1048c04_1"
    },
    {
        "source_sentence": "如事五事，汝能離不？』",
        "translation": "As for these five things, can you get rid of them?'",
        "source": "T24n1488_003:1048c05_2"
    },
    {
        "source_sentence": "若言能者，復應語言：『善男子！",
        "translation": "If someone says they can, they should also say, 'Good man!",
        "source": "T24n1488_003:1048c06_3"
    },
    {
        "source_sentence": "受優婆塞戒，復有三事所不應為：一者、不作羅網，二者、不作藍染，",
        "translation": "There are another three things that shouldn't be done by those who receive the lay precepts: 1. they won't become a net, and 2. they won't become blue.",
        "source": "T24n1488_003:1048c06_4"
    },
    {
        "source_sentence": "三者、不作釀皮；",
        "translation": "The third is that they do not harvest skin.",
        "source": "T24n1488_003:1048c08_5"
    },
    {
        "source_sentence": "如是三事，汝能離不？』",
        "translation": "Can you get rid of these three things?'",
        "source": "T24n1488_003:1048c08_6"
    },
    {
        "source_sentence": "若言能者，復應語言：『善男子！",
        "translation": "If someone says they can, they should also say, 'Good man!",
        "source": "T24n1488_003:1048c09_7"
    },
    {
        "source_sentence": "受優婆塞戒，復有二事所不應為：一者、摴蒱圍碁六博，二者、種種歌舞伎樂；",
        "translation": "There are again two things that should not be done by those who receive the precepts as laymen:",
        "source": "T24n1488_003:1048c09_8"
    },
    {
        "source_sentence": "如是二事，汝能離不？』",
        "translation": "Can you be free of these two things?'",
        "source": "T24n1488_003:1048c11_9"
    },
    {
        "source_sentence": "若言能者，復應語言：『善男子！",
        "translation": "If someone says they can, they should also say, 'Good man!",
        "source": "T24n1488_003:1048c12_10"
    },
    {
        "source_sentence": "受優婆塞戒，有四種人不應親近：一者、碁博，二者、飲酒，三者、欺誑，",
        "translation": "There are four kinds of people who shouldn't be intimate with those who receive the lay precepts: 1. cheating, 2. gambling, 2. drinking alcohol, and 3. deceit.",
        "source": "T24n1488_003:1048c12_11"
    },
    {
        "source_sentence": "四者、喜酤酒；",
        "translation": "The fourth is the licentiousness of liquor.",
        "source": "T24n1488_003:1048c14_12"
    },
    {
        "source_sentence": "如是四人，汝能離不？』",
        "translation": "Are these four people like you able to part with them?'",
        "source": "T24n1488_003:1048c14_13"
    },
    {
        "source_sentence": "若言能者，復應語言：『善男子！",
        "translation": "If someone says they can, they should also say, 'Good man!",
        "source": "T24n1488_003:1048c15_14"
    },
    {
        "source_sentence": "受優婆塞戒，有法放逸所不應作。",
        "translation": "Accepting the precepts for laymen, there are rules that shouldn't be done by carelessness.",
        "source": "T24n1488_003:1048c15_15"
    },
    {
        "source_sentence": "何等放逸？",
        "translation": "What's carelessness?",
        "source": "T24n1488_003:1048c16_16"
    },
    {
        "source_sentence": "寒時、熱時、飢時、渴時、多食飽時，清旦、暮時、懅時，作時，初欲作時，",
        "translation": "When it’s cold, when it’s hot, when it’s hungry, when it’s thirsty, and when it’s full with plenty of food, at dawn, at dusk, at night, and in the morning, he does so",
        "source": "T24n1488_003:1048c16_17"
    },
    {
        "source_sentence": "失時、得時，怖時、喜時，賊難穀貴，病苦、壯少、年衰老時，富時、貧時，",
        "translation": "At the time of loss and at the time of gain, at the time of fear and at the time of joy, when thieves are in distress and grain is valuable, when sickness is painful, when youth is strong, when old age is decreasing",
        "source": "T24n1488_003:1048c18_18"
    },
    {
        "source_sentence": "為命求財時；",
        "translation": "When they seek wealth for their livelihood, they do so in order to save sentient beings.",
        "source": "T24n1488_003:1048c19_19"
    },
    {
        "source_sentence": "如是時中不修善法，汝能離不？』",
        "translation": "If you don't cultivate good qualities at the time like this, can you part with them?'",
        "source": "T24n1488_003:1048c20_0"
    },
    {
        "source_sentence": "若言能者，復應語言：『善男子！",
        "translation": "If someone says they can, they should also say, 'Good man!",
        "source": "T24n1488_003:1048c20_1"
    },
    {
        "source_sentence": "受優婆塞戒，先學世事，既學通達，如法求財，若得財物，應作四分：一分應供養父母、己身、妻子、眷屬，",
        "translation": "If you receive the lay precepts, you must first learn worldly affairs. Having learned and mastered them, you should seek property in accordance with the Dharma. If you obtain property, you should divide it into four parts:",
        "source": "T24n1488_003:1048c21_2"
    },
    {
        "source_sentence": "二分應作如法販博，留餘一分藏積擬用；",
        "translation": "The second part is to be done in accordance with the law as a trader, while the remaining part is to be stored and intended for use.",
        "source": "T24n1488_003:1048c23_3"
    },
    {
        "source_sentence": "如是四事，汝能作不？』",
        "translation": "Can you do these four things like this?'",
        "source": "T24n1488_003:1048c24_4"
    },
    {
        "source_sentence": "若言能者，復應語言：『善男子！",
        "translation": "If someone says they can, they should also say, 'Good man!",
        "source": "T24n1488_003:1048c25_5"
    },
    {
        "source_sentence": "財物不應寄付四處：一者、老人，二者、遠處，三者、惡人，四者、大力；",
        "translation": "Goods should not be entrusted to four places: 1. an old man, 2. a distant place, 3. evil people, and 4. great power.",
        "source": "T24n1488_003:1048c25_6"
    },
    {
        "source_sentence": "如是四處不應寄付，汝能離不？』",
        "translation": "These four places shouldn't be entrusted, so can you get rid of them?'",
        "source": "T24n1488_003:1048c27_7"
    },
    {
        "source_sentence": "若言能者，復應語言：『善男子！",
        "translation": "If someone says they can, they should also say, 'Good man!",
        "source": "T24n1488_003:1048c27_8"
    },
    {
        "source_sentence": "受優婆塞戒，有四惡人常應離之：一者、樂說他過，二者、樂說邪見，",
        "translation": "Accepting the lay precepts, there are four bad people who should always be freed: 1. those who delight in telling others about their faults and 2. those who delight in telling wrong views",
        "source": "T24n1488_003:1048c28_9"
    },
    {
        "source_sentence": "三者、口軟心惡，四者、少作多說；",
        "translation": "The third is the evil of verbal and mental weakness. The fourth is that they often speak little and often.",
        "source": "T24n1488_003:1049a01_0"
    },
    {
        "source_sentence": "是四惡人汝能離不？』",
        "translation": "Can you get rid of these four bad people?'",
        "source": "T24n1488_003:1049a01_1"
    },
    {
        "source_sentence": "若言能者，應令是人滿六月日，親近承事出家智者，智者復應至心觀其身四威儀。",
        "translation": "If he says he's capable, he should cause that person to become intimate with the renunciant wise one on the full sixth day of the month and serve him, and the wise one should also wholeheartedly observe his four comportments.",
        "source": "T24n1488_003:1049a02_2"
    },
    {
        "source_sentence": "「若知是人能如教作，過六月已，和合眾僧滿二十人，作白羯磨：『大德僧聽！",
        "translation": "If you know that person's ability to do so as instructed, then after six months have passed, the congregation of the saṃgha has gathered 20 people and made a confession, saying, 'Listen, great virtuous monks!'",
        "source": "T24n1488_003:1049a04_3"
    },
    {
        "source_sentence": "是某甲今於僧中乞受優婆塞戒，已滿六月中淨四威儀，至心受持淨莊嚴地，",
        "translation": "Now, that certain person has begged the saṃgha to accept the layman’s precepts. For six months after having fulfilled these precepts, he keeps the four kinds of deportment in a pure and genuinely pure manner and whole",
        "source": "T24n1488_003:1049a05_4"
    },
    {
        "source_sentence": "是人丈夫，具男子身，若僧聽者，僧皆默然，不聽者，說。』",
        "translation": "That person's husband is endowed with a man's body, and if the saṃgha hears it, the saṃgha remains silent, but those who don't hear it say so.'",
        "source": "T24n1488_003:1049a07_5"
    },
    {
        "source_sentence": "僧若聽者，智者復應作如是言：『善男子！",
        "translation": "If the saṃgha listens, the wise person should again say, 'Good man!",
        "source": "T24n1488_003:1049a08_6"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T24n1488_003:1049a09_7"
    },
    {
        "source_sentence": "僧已和合聽汝受持優婆塞戒，是戒即是一切善法之根本也，若有成就如是戒者，",
        "translation": "The saṃgha has harmonized and listened to you as you observe the upāsaka precepts, which are the foundation of all good qualities. If you have fulfilled these precepts,",
        "source": "T24n1488_003:1049a09_8"
    },
    {
        "source_sentence": "當得須陀洹果乃至阿那含果，若破是戒，命終當墮三惡道中。",
        "translation": "They'll attain the fruit of stream entry or even the fruit of non-returning, and if they break this precept, they'll fall into the three bad destinies at the end of their life.",
        "source": "T24n1488_003:1049a11_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1049a13_10"
    },
    {
        "source_sentence": "優婆塞戒，不可思議。",
        "translation": "The laymen's precepts are inconceivable.",
        "source": "T24n1488_003:1049a13_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_003:1049a13_12"
    },
    {
        "source_sentence": "受是戒已，雖受五欲，而不能障須陀洹果至阿那含果，是故名為不可思議。",
        "translation": "After accepting these precepts, even though they experience the five desires, they can't obstruct the fruit of stream entry up to the fruit of non-returning, which is therefore called inconceivable.",
        "source": "T24n1488_003:1049a14_13"
    },
    {
        "source_sentence": "汝能憐愍諸眾生故，受是戒不？』",
        "translation": "Can you have compassion for sentient beings and accept this precept?'",
        "source": "T24n1488_003:1049a15_14"
    },
    {
        "source_sentence": "若言能受，爾時智者次應為說三歸依法，第二、第三、亦如是說。",
        "translation": "If it's said that they can receive, then the wise person should next explain the three refuges for them according to the Dharma, and the second, third, and so forth are likewise explained.",
        "source": "T24n1488_003:1049a16_15"
    },
    {
        "source_sentence": "受三歸已，名優婆塞。",
        "translation": "After accepting the three refuges, he's called a layman.",
        "source": "T24n1488_003:1049a17_16"
    },
    {
        "source_sentence": "「爾時、智者復應語言：『善男子！",
        "translation": "At that point, the wise person should again say, 'Good sons!",
        "source": "T24n1488_003:1049a18_17"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T24n1488_003:1049a19_18"
    },
    {
        "source_sentence": "如來正覺說優婆塞戒，或有一分，或有半分，或有無分，或有多分，或有滿分。",
        "translation": "The Tathāgata the Perfectly Enlightened One teaches the layman precepts, sometimes with one part, sometimes with half a part, sometimes without a part, sometimes with many parts, sometimes with all parts.",
        "source": "T24n1488_003:1049a19_19"
    },
    {
        "source_sentence": "若優婆塞受三歸已，不受五戒，名優婆塞。",
        "translation": "If a layman receives the three refuges and doesn't accept the five precepts, he's called a layman.",
        "source": "T24n1488_003:1049a21_20"
    },
    {
        "source_sentence": "若受三歸，受持一戒，是名一分；",
        "translation": "If one receives the three refuges and keeps one precept, this is called ‘one part’.",
        "source": "T24n1488_003:1049a22_21"
    },
    {
        "source_sentence": "受三歸已，受持二戒，是名少分；",
        "translation": "Accepting the three refuges and upholding the two moral precepts after accepting them is called ‘minor’.",
        "source": "T24n1488_003:1049a22_22"
    },
    {
        "source_sentence": "若受三歸，持二戒已，若破一戒，是名無分；",
        "translation": "If one receives the three refuges, observes two precepts, and breaks one precept, this is called having no part.",
        "source": "T24n1488_003:1049a23_23"
    },
    {
        "source_sentence": "若受三歸，受持三、四戒，是名多分；",
        "translation": "If one receives the three refuges and keeps the three or four precepts, this is called ‘mutual parts’.",
        "source": "T24n1488_003:1049a24_24"
    },
    {
        "source_sentence": "若受三歸，受持五戒，是名滿分。",
        "translation": "If someone receives the three refuges and observes the five precepts, this is called a full set.",
        "source": "T24n1488_003:1049a25_25"
    },
    {
        "source_sentence": "汝今欲作一分優婆塞？",
        "translation": "Do you now want to become a partial layman?",
        "source": "T24n1488_003:1049a26_26"
    },
    {
        "source_sentence": "作滿分耶？』",
        "translation": "Does it make a full section?'",
        "source": "T24n1488_003:1049a26_27"
    },
    {
        "source_sentence": "若隨意說，爾時智者當隨意授。",
        "translation": "If he teaches it as he wishes, then the wise person will give it as he wishes.",
        "source": "T24n1488_003:1049a26_28"
    },
    {
        "source_sentence": "「既授戒已，復作是言：『優婆塞者有六重法。",
        "translation": "Having conferred the precepts, he also said, 'There are six grave dharmas for a layman.",
        "source": "T24n1488_003:1049a27_29"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1049a28_30"
    },
    {
        "source_sentence": "優婆塞受持戒已，雖為天女乃至蟻子，悉不應殺。",
        "translation": "Even though it's a goddess or even an ant, the layman who observes the precepts won't kill them even if they're goddesses or ants.",
        "source": "T24n1488_003:1049a28_31"
    },
    {
        "source_sentence": "若受戒已，若口教殺、若身自殺，是人即失優婆塞戒，是人尚不能得煖法，",
        "translation": "If someone who has received the precepts and is verbally instructed to kill or commits suicide, that person will immediately lose the layman's precepts. That person still won't be able to attain the method of Nun.",
        "source": "T24n1488_003:1049a29_32"
    },
    {
        "source_sentence": "況須陀洹至阿那含？",
        "translation": "How much more so when he reaches the stage of stream entry up to non-returner?",
        "source": "T24n1488_003:1049b02_33"
    },
    {
        "source_sentence": "是名破戒優婆塞、臭優婆塞、旃陀羅優婆塞、垢優婆塞、結優婆塞，是名初重。",
        "translation": "This is called a layman who breaks the precepts, an odorless layman, a caṇḍāla layman, a defiled layman, and a knotted layman.",
        "source": "T24n1488_003:1049b03_34"
    },
    {
        "source_sentence": "優婆塞戒，雖為身命，不得偷盜乃至一錢，若破是戒，是人即失優婆塞戒，",
        "translation": "Even though it's for the sake of body and life, they won't be allowed to steal or even a penny. If someone breaks these precepts, that person will lose the upāsaka precepts.",
        "source": "T24n1488_003:1049b04_35"
    },
    {
        "source_sentence": "是人尚不能得煖法，況須陀洹至阿那含？",
        "translation": "That person still can't attain the Dharma of warmth, so why wouldn't he attain stream entry up to non-returner?",
        "source": "T24n1488_003:1049b06_36"
    },
    {
        "source_sentence": "是名破戒優婆塞，臭、旃陀羅、垢、結優婆塞，是名二重。",
        "translation": "These are called the upāsaka who breaks the precepts, and these are called the twofold upāsaka who smell bad odor, caṇḍāla, defilement, and fetters.",
        "source": "T24n1488_003:1049b07_37"
    },
    {
        "source_sentence": "優婆塞戒，雖為身命，不得虛說我得不淨觀至阿那含。",
        "translation": "Even though the layman precepts are for body and life, they can't falsely say that I've attained the contemplation of impurity up to non-returner.",
        "source": "T24n1488_003:1049b08_38"
    },
    {
        "source_sentence": "若破是戒，是人即失優婆塞戒，是人尚不能得煖法，況須陀洹至阿那含？",
        "translation": "If someone breaks these precepts, that person will immediately lose the layman's precepts, and they won't be able to attain the Dharma of warmth, so why wouldn't they attain stream entry up to non-returner",
        "source": "T24n1488_003:1049b09_39"
    },
    {
        "source_sentence": "是名破戒優婆塞，臭、旃陀羅、垢、結優婆塞，是名三重。",
        "translation": "These are called upāsaka who breaks the precepts, and these are called the three kinds of upāsaka who smell bad odor, caṇḍāla, dirt, and fetters.",
        "source": "T24n1488_003:1049b11_40"
    },
    {
        "source_sentence": "優婆塞戒，雖為身命，不得邪婬。",
        "translation": "Even though it's for the sake of body and life, the layman precepts don't allow sexual misconduct.",
        "source": "T24n1488_003:1049b12_41"
    },
    {
        "source_sentence": "若破是戒，是人即失優婆塞戒，是人尚不能得煖法，況須陀洹至阿那含？",
        "translation": "If someone breaks these precepts, that person will immediately lose the layman's precepts, and they won't be able to attain the Dharma of warmth, so why wouldn't they attain stream entry up to non-returner",
        "source": "T24n1488_003:1049b13_42"
    },
    {
        "source_sentence": "是名破戒優婆塞，臭、旃陀羅、垢、結優婆塞，是名四重。",
        "translation": "These are called upāsaka who breaks the precepts, and these are called the fourfold upāsaka who smell bad odor, caṇḍāla, defilement, and fetters.",
        "source": "T24n1488_003:1049b14_43"
    },
    {
        "source_sentence": "優婆塞戒，雖為身命，不得宣說比丘、比丘尼、優婆塞、優婆夷所有過罪。",
        "translation": "Although the laymen's precepts are for body and life, they can't proclaim the faults of monks, monks, nuns, laymen, or laywomen.",
        "source": "T24n1488_003:1049b16_44"
    },
    {
        "source_sentence": "若破是戒，是人即失優婆塞戒，是人尚不能得煖法，況須陀洹至阿那含？",
        "translation": "If someone breaks these precepts, that person will immediately lose the layman's precepts, and they won't be able to attain the Dharma of warmth, so why wouldn't they attain stream entry up to non-returner",
        "source": "T24n1488_003:1049b17_45"
    },
    {
        "source_sentence": "是名破戒優婆塞，臭、旃陀羅，垢、結優婆塞，是名五重。",
        "translation": "These are called the five kinds of upāsaka who break the precepts, which are bad odor, caṇḍāla, defilement, and fetters.",
        "source": "T24n1488_003:1049b19_46"
    },
    {
        "source_sentence": "優婆塞戒，雖為身命，不得酤酒，若破是戒，是人即失優婆塞戒，是人尚不能得煖法，",
        "translation": "Even though it is for the sake of body and life, a layman should not drink alcohol. If he breaks these precepts, that person will immediately lose the layman’s precepts. Such a person cannot acquire the dharma of warmth",
        "source": "T24n1488_003:1049b20_47"
    },
    {
        "source_sentence": "況須陀洹至阿那含？",
        "translation": "How much more so when he reaches the stage of stream entry up to non-returner?",
        "source": "T24n1488_003:1049b22_48"
    },
    {
        "source_sentence": "是名破戒優婆塞，臭、旃陀羅、垢、結優婆塞，是名六重。",
        "translation": "These are called upāsaka who breaks the precepts, and these are called the sixfold upāsaka who smell bad odor, caṇḍāla, dirt, and fetters.",
        "source": "T24n1488_003:1049b22_49"
    },
    {
        "source_sentence": "「『善男子！",
        "translation": "'Good sons!",
        "source": "T24n1488_003:1049b24_50"
    },
    {
        "source_sentence": "若受如是優婆塞戒，能至心持不令毀犯，則能獲得如是戒果。",
        "translation": "If someone who receives such an upāsaka precept and can wholeheartedly maintain it without violating it, then they'll attain the fruit of such a precept.",
        "source": "T24n1488_003:1049b24_51"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1049b25_52"
    },
    {
        "source_sentence": "優婆塞戒名為瓔珞，名為莊嚴，其香微妙，熏無邊界，遮不善法，為善法律，",
        "translation": "The precepts of the upāsaka are called a necklace, which is called adornment. Its fragrance is subtle and permeates the boundless realms, obstructing unwholesome states and making them wholesome states.",
        "source": "T24n1488_003:1049b25_53"
    },
    {
        "source_sentence": "即是無上妙寶之藏，上族種姓，大寂靜處，是甘露味，生善法地。",
        "translation": "That is, it is the storehouse of the highest and most wonderful treasure. It is a place of great quiescence where beings of superior clans and castes are born in the land of the true Dharma with the taste of immortality.",
        "source": "T24n1488_003:1049b27_54"
    },
    {
        "source_sentence": "直發是心尚得如是無量利益，況復一心受持不毀！",
        "translation": "Even if you simply give rise to this mind, you'll still attain such measureless benefits, so why wouldn't you singlemindedly accept and uphold it without disparaging it?",
        "source": "T24n1488_003:1049b29_0"
    },
    {
        "source_sentence": "「『善男子！",
        "translation": "'Good sons!",
        "source": "T24n1488_003:1049c01_1"
    },
    {
        "source_sentence": "如佛說言：若優婆塞受持戒已，不能供養父母、師長，是優婆塞得失意罪，",
        "translation": "As the Buddha has said: If a layman, having observed the precepts, is unable to support his parents and teachers, this is a sin committed by that layman.",
        "source": "T24n1488_003:1049c01_2"
    },
    {
        "source_sentence": "不起墮落，不淨有作。",
        "translation": "They don't arise or fall, and what's impure is created.",
        "source": "T24n1488_003:1049c02_3"
    },
    {
        "source_sentence": "若優婆塞受持戒已，耽樂飲酒，是優婆塞得失意罪，不起墮落，不淨有作。",
        "translation": "If an upāsaka takes the precepts and indulges in drinking alcohol, it's because the upāsaka has gained the sin of losing control of his mind that they won't fall down or become impure and do something.",
        "source": "T24n1488_003:1049c03_4"
    },
    {
        "source_sentence": "若優婆塞受持戒已，污惡不能瞻視病苦，是優婆塞得失意罪，不起墮落，",
        "translation": "If a layman observes the precepts but defiles evil and can't look after illness and suffering, this is a layman who commits the sin of negligence and doesn't fall into it.",
        "source": "T24n1488_003:1049c05_5"
    },
    {
        "source_sentence": "不淨有作。",
        "translation": "What's impure has actions.",
        "source": "T24n1488_003:1049c06_6"
    },
    {
        "source_sentence": "若優婆塞受持戒已，見有乞者，不能多少隨宜分與，空遣還者，是優婆塞得失意罪，",
        "translation": "If a layman observes the precepts and sees a beggar who doesn't give them as much or as little as he wishes, but sends it back in vain, then that layman is guilty of losing his intention.",
        "source": "T24n1488_003:1049c07_0"
    },
    {
        "source_sentence": "不起墮落，不淨有作。",
        "translation": "They don't arise or fall, and what's impure is created.",
        "source": "T24n1488_003:1049c08_1"
    },
    {
        "source_sentence": "若優婆塞受持戒已，若見比丘、比丘尼、長老，先宿諸優婆塞、優婆夷等，",
        "translation": "If an upāsaka observes the precepts, and if he sees a monk, a bhikṣu, a bhikṣuṇī, an elder, Upāsaka or Upāsikā who was previously staying there,",
        "source": "T24n1488_003:1049c09_2"
    },
    {
        "source_sentence": "不起承迎、禮拜、問訊，是優婆塞得失意罪，不起墮落，不淨有作。",
        "translation": "Not rising up to receive, venerate, and greet them is the sin of a layman who commits the sin of losing his mind, not rising up or falling down, which is an impure act.",
        "source": "T24n1488_003:1049c11_0"
    },
    {
        "source_sentence": "若優婆塞受持戒已，若見比丘、比丘尼、優婆塞、優婆夷，毀所受戒，",
        "translation": "If an upāsaka observes the precepts and sees a monk, a bhikṣu, a bhikṣuṇī, a layman, or a laywoman who disparages the precepts he has received,",
        "source": "T24n1488_003:1049c12_1"
    },
    {
        "source_sentence": "心生憍慢，言我勝彼，彼不如我，是優婆塞得失意罪，不起墮落，不淨有作。",
        "translation": "When a layman becomes conceited and says, 'I'm superior to them, they're not like me,' this is because the layman commits the sin of losing his mind, doesn't fall into it, and doesn'",
        "source": "T24n1488_003:1049c13_2"
    },
    {
        "source_sentence": "若優婆塞受持戒已，月月之中，不能六日受持八戒，供養三寶，是優婆塞得失意罪，",
        "translation": "If a layman receives the eight precepts and doesn't observe them for six days in a month, offering support to the Three Treasures, this is a layman who commits the sin of losing his mind.",
        "source": "T24n1488_003:1049c15_3"
    },
    {
        "source_sentence": "不起墮落，不淨有作。",
        "translation": "They don't arise or fall, and what's impure is created.",
        "source": "T24n1488_003:1049c17_4"
    },
    {
        "source_sentence": "若優婆塞受持戒已，四十里中有講法處，不能往聽，是優婆塞得失意罪，",
        "translation": "If an upāsaka receives the precepts but is unable to go and hear the Dharma preached at a place forty li away from them, he commits the sin of negligence.",
        "source": "T24n1488_003:1049c17_5"
    },
    {
        "source_sentence": "不起墮落，不淨有作。",
        "translation": "They don't arise or fall, and what's impure is created.",
        "source": "T24n1488_003:1049c19_6"
    },
    {
        "source_sentence": "若優婆塞受持戒已，受招提僧臥具床座，是優婆塞得失意罪，不起墮落，",
        "translation": "If an upāsaka who has received the precepts and accepted a bedding, seat, or bed for the saṃgha of Kātyāyapaṇeśa is guilty of negligence and doesn't fall into it.",
        "source": "T24n1488_003:1049c20_0"
    },
    {
        "source_sentence": "不淨有作。",
        "translation": "What's impure has actions.",
        "source": "T24n1488_003:1049c21_1"
    },
    {
        "source_sentence": "若優婆塞受持戒已，疑水有虫，故便飲之，是優婆塞得失意罪，不起墮落，",
        "translation": "If a layman, having observed the precepts, doubts that water has worms in it and therefore drinks it, this is a case where a layman commits the sin of negligence and doesn't fall back.",
        "source": "T24n1488_003:1049c21_2"
    },
    {
        "source_sentence": "不淨有作。",
        "translation": "What's impure has actions.",
        "source": "T24n1488_003:1049c23_3"
    },
    {
        "source_sentence": "若優婆塞受持戒已，嶮難之處無伴獨行，是優婆塞得失意罪，不起墮落，",
        "translation": "If an upāsaka receives the precepts and doesn't walk alone in a dangerous place without companions after they've received them, that upāsaka will be guilty of negligence and won't fall back.",
        "source": "T24n1488_003:1049c23_4"
    },
    {
        "source_sentence": "不淨有作。",
        "translation": "What's impure has actions.",
        "source": "T24n1488_003:1049c25_5"
    },
    {
        "source_sentence": "若優婆塞受持戒已，獨宿尼寺，是優婆塞得失意罪，不起墮落，不淨有作。",
        "translation": "If an upāsaka receives the precepts and stays alone at a nun's monastery after observing them, this is an upāsaka who acquires the sin of losing his mind and doesn't fall into it, which is impure and",
        "source": "T24n1488_003:1049c25_6"
    },
    {
        "source_sentence": "若優婆塞受持戒已，為於財命，打罵奴婢、僮僕、外人，是優婆塞得失意罪，",
        "translation": "If a layman observes the precepts and, out of concern for his livelihood, slanders male and female servants, hired men, or outsiders, this is a sin that the layman commits.",
        "source": "T24n1488_003:1049c27_7"
    },
    {
        "source_sentence": "不起墮落，不淨有作。",
        "translation": "They don't arise or fall, and what's impure is created.",
        "source": "T24n1488_003:1049c28_8"
    },
    {
        "source_sentence": "若優婆塞受持戒已，若以殘食施於比丘、比丘尼、優婆塞、優婆夷，是優婆塞得失意罪，",
        "translation": "If an upāsaka who has received the precepts and gives leftover food to a monk, bhikṣuṇī, upāsaka, or upāsikā is guilty of negligence if he gives it to a monk, bhikṣuṇ",
        "source": "T24n1488_003:1049c29_9"
    },
    {
        "source_sentence": "不起墮落，不淨有作。",
        "translation": "They don't arise or fall, and what's impure is created.",
        "source": "T24n1488_003:1050a02_10"
    },
    {
        "source_sentence": "若優婆塞受持戒已，若畜猫狸，是優婆塞得失意罪，不起墮落，不淨有作。",
        "translation": "If a layman observes the precepts and keeps cats and beavers, that's a layman who commits the sin of losing control of his mind and doesn't fall into it, which is impure and created.",
        "source": "T24n1488_003:1050a02_11"
    },
    {
        "source_sentence": "若優婆塞受持戒已，畜養象、馬、牛、羊、駝、驢一切畜獸，不作淨，",
        "translation": "If a layman observes the precepts, he keeps elephants, horses, cattle, sheep, goats, camels, mules, and all other animals that are kept as animals without making them pure.",
        "source": "T24n1488_003:1050a04_12"
    },
    {
        "source_sentence": "施未受戒者，是優婆塞得失意罪，不起墮落，不淨有作。",
        "translation": "A donor who hasn't received the precepts is a layman who acquires the sin of losing his mind and doesn't fall into it, which is impure and created.",
        "source": "T24n1488_003:1050a05_13"
    },
    {
        "source_sentence": "若優婆塞受持戒已，若不儲畜僧伽梨衣、鉢盂、錫杖，是優婆塞得失意罪，",
        "translation": "If a layman observes the precepts and doesn't store his saṃghāṭi robe, bowl, or pewter staff, this is a layman who commits the sin of losing his mind.",
        "source": "T24n1488_003:1050a07_14"
    },
    {
        "source_sentence": "不起墮落，不淨有作。",
        "translation": "They don't arise or fall, and what's impure is created.",
        "source": "T24n1488_003:1050a08_15"
    },
    {
        "source_sentence": "若優婆塞受持戒已，若為身命須田作者，不求淨水及陸稼處，是優婆塞得失意罪，",
        "translation": "If a layman observes the precepts and doesn't seek clean water or land to produce crops for his body or life, it's a sin for that layman to lose control of his mind.",
        "source": "T24n1488_003:1050a09_16"
    },
    {
        "source_sentence": "不起墮落，不淨有作。",
        "translation": "They don't arise or fall, and what's impure is created.",
        "source": "T24n1488_003:1050a11_17"
    },
    {
        "source_sentence": "若優婆塞受持戒已，為於身命，若作市易斗秤賣物，一說價已，不得前却捨賤趣貴；",
        "translation": "If a layman observes the precepts and, in order to protect his body and life, makes a bargain or sells goods on a scale with an ounce of gold he says once the price is offered, he cannot give up what is low and",
        "source": "T24n1488_003:1050a11_18"
    },
    {
        "source_sentence": "斗秤量物任前平用，如其不平，應語令平，若不如是，是優婆塞得失意罪，",
        "translation": "If he allows the measure of a sheng to be used equally as before, and if it's uneven, he should tell them to be even. If he doesn't do so, that's an upāsaka who commits the sin of losing",
        "source": "T24n1488_003:1050a13_19"
    },
    {
        "source_sentence": "不起墮落，不淨有作。",
        "translation": "They don't arise or fall, and what's impure is created.",
        "source": "T24n1488_003:1050a15_0"
    },
    {
        "source_sentence": "若優婆塞受持戒已，若於非處、非時行欲，是優婆塞得失意罪，不起墮落，",
        "translation": "If a layman observes the precepts and if he acts with desire in an unwholesome place or at an unwholesome time, that layman commits the sin of negligence and doesn't fall into it.",
        "source": "T24n1488_003:1050a15_1"
    },
    {
        "source_sentence": "不淨有作。",
        "translation": "What's impure has actions.",
        "source": "T24n1488_003:1050a17_2"
    },
    {
        "source_sentence": "若優婆塞受持戒已，商估販賣，不輸官稅，盜棄去者，是優婆塞得失意罪，",
        "translation": "If an upāsaka, having observed the precepts, trades, sells, doesn't pay official duties, steals, and abandons them, this is a violation of the upāsaka's sin of losing control of his mind.",
        "source": "T24n1488_003:1050a17_3"
    },
    {
        "source_sentence": "不起墮落，不淨有作。",
        "translation": "They don't arise or fall, and what's impure is created.",
        "source": "T24n1488_003:1050a19_0"
    },
    {
        "source_sentence": "若優婆塞受持戒已，若犯國制，是優婆塞得失意罪，不起墮落，不淨有作。",
        "translation": "If an upāsaka who has received the precepts and violates the national rules is guilty of a negligence offense, doesn't fall into it, and does something impure that's done.",
        "source": "T24n1488_003:1050a19_1"
    },
    {
        "source_sentence": "若優婆塞受持戒已，若得新穀，果苽菜茹，不先奉獻供養三寶先自受者，",
        "translation": "Suppose an upāsaka receives the precepts after they've received them, and if he obtains new grains, fruits, vegetables, and cooked rice, he doesn't offer them first to make offerings to the Three Treasures or accept them himself",
        "source": "T24n1488_003:1050a21_2"
    },
    {
        "source_sentence": "是優婆塞得失意罪，不起墮落，不淨有作。",
        "translation": "This is an upāsaka who acquires the sin of losing his mind and doesn't arise or fall into it, which is impure and created.",
        "source": "T24n1488_003:1050a22_3"
    },
    {
        "source_sentence": "若優婆塞受持戒已，僧若不聽說法讚歎，輒自作者，是優婆塞得失意罪，",
        "translation": "If a layman observes the precepts, and if the saṃgha doesn't listen to the teaching and praise it after hearing it, he or she will often do so himself, this is a layman who commits the sin of losing",
        "source": "T24n1488_003:1050a23_4"
    },
    {
        "source_sentence": "不起墮落，不淨有作。",
        "translation": "They don't arise or fall, and what's impure is created.",
        "source": "T24n1488_003:1050a25_5"
    },
    {
        "source_sentence": "若優婆塞受持戒已，道路若在諸比丘前、沙彌前行，是優婆塞得失意罪，",
        "translation": "If an upāsaka who has received the precepts and is on the road or walking in front of monks or śrāmaṇeras commits the sin of losing his mind, that upāsaka will be condemned.",
        "source": "T24n1488_003:1050a25_6"
    },
    {
        "source_sentence": "不起墮落，不淨有作。",
        "translation": "They don't arise or fall, and what's impure is created.",
        "source": "T24n1488_003:1050a27_7"
    },
    {
        "source_sentence": "若優婆塞受持戒已，僧中賦食，若偏為師選擇美好過分與之，是優婆塞得失意罪，",
        "translation": "If an upāsaka who has received the precepts and is paying food to the saṃgha, or if he gives it partially to a teacher who chooses good and faulty parts for him, then that upāsaka will be guilty of the sin of losing",
        "source": "T24n1488_003:1050a28_8"
    },
    {
        "source_sentence": "不起墮落，不淨有作。",
        "translation": "They don't arise or fall, and what's impure is created.",
        "source": "T24n1488_003:1050b01_0"
    },
    {
        "source_sentence": "若優婆塞受持戒已，若養蠶者，是優婆塞得失意罪，不起墮落，不淨有作。",
        "translation": "If an upāsaka observes the precepts and raises silkworms, it's because the upāsaka has gained the sin of losing his mind that they won't fall down or become impure and do something.",
        "source": "T24n1488_003:1050b01_1"
    },
    {
        "source_sentence": "若優婆塞受持戒已，行路之時，遇見病者，不住瞻視，為作方便付囑所在而捨去者，",
        "translation": "If an upāsaka observes the precepts and meets a sick person on his way there, he doesn't look around or look at them, but leaves them for the sake of expediently entrusting their whereabouts.",
        "source": "T24n1488_003:1050b03_2"
    },
    {
        "source_sentence": "是優婆塞得失意罪，不起墮落，不淨有作。",
        "translation": "This is an upāsaka who acquires the sin of losing his mind and doesn't arise or fall into it, which is impure and created.",
        "source": "T24n1488_003:1050b05_3"
    },
    {
        "source_sentence": "「『善男子！",
        "translation": "'Good sons!",
        "source": "T24n1488_003:1050b06_0"
    },
    {
        "source_sentence": "若優婆塞至心能受持如是戒，是人名為優婆塞中分陀利花，優婆塞中微妙上香，",
        "translation": "If a layman wholeheartedly accepts and upholds these precepts, that person is called the flower puṇḍarīka among laymen. The subtle and supreme fragrance among laymen",
        "source": "T24n1488_003:1050b06_1"
    },
    {
        "source_sentence": "優婆塞中清淨蓮花，優婆塞中真實珍寶，優婆塞中丈夫之人！",
        "translation": "Among the laymen, there's the pure lotus flower, and among the laymen, there's the true treasure treasure, and among the laymen, there's the man!",
        "source": "T24n1488_003:1050b08_2"
    },
    {
        "source_sentence": "「『善男子！",
        "translation": "'Good sons!",
        "source": "T24n1488_003:1050b09_3"
    },
    {
        "source_sentence": "如佛所說菩薩二種：一者、在家，二者、出家。",
        "translation": "As the Buddha teaches, there are two kinds of bodhisattvas: 1. those at home and 2. those who leave home.",
        "source": "T24n1488_003:1050b09_4"
    },
    {
        "source_sentence": "出家菩薩名為比丘，在家菩薩名優婆塞。",
        "translation": "A renunciant bodhisattva is called a monk, and a homebound bodhisattva is called an upāsaka.",
        "source": "T24n1488_003:1050b10_5"
    },
    {
        "source_sentence": "出家菩薩持出家戒，是不為難；",
        "translation": "It is no difficulty for renunciant enlightening beings to keep the precepts of renunciation.",
        "source": "T24n1488_003:1050b11_6"
    },
    {
        "source_sentence": "在家菩薩持在家戒，是乃為難。",
        "translation": "It's difficult for a layman bodhisattva to observe the layman precepts.",
        "source": "T24n1488_003:1050b12_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_003:1050b12_8"
    },
    {
        "source_sentence": "在家之人多惡因緣所纏繞故。』」",
        "translation": "It's because people at home are often tethered by bad causes and conditions.'",
        "source": "T24n1488_003:1050b13_9"
    },
    {
        "source_sentence": "優婆塞戒經淨戒品第十五",
        "translation": "Purifying Precepts, Chapter 15 of the Upāsaka Precepts Sutra",
        "source": "T24n1488_003:1050b14_0"
    },
    {
        "source_sentence": "善生言：「世尊！",
        "translation": "Sunetra said, Bhagavān!",
        "source": "T24n1488_003:1050b15_0"
    },
    {
        "source_sentence": "有人受持如是戒已，云何當令是戒淨耶？」",
        "translation": "After someone has received and upheld such a precept, how will they make it pure?",
        "source": "T24n1488_003:1050b15_1"
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, Good man!",
        "source": "T24n1488_003:1050b16_2"
    },
    {
        "source_sentence": "有三法能淨是戒：一者、信佛、法、僧，二者、深信因果，三者、解心。",
        "translation": "There are three things that can purify these precepts: 1. faith in the Buddha, Dharma, and Saṃgha; 2. deep faith in causes and effects; and 3. the mind of understanding.",
        "source": "T24n1488_003:1050b16_3"
    },
    {
        "source_sentence": "復有四法：一者、慈心，二者、悲心，三者、無貪心，四者、未有恩處先以恩加。",
        "translation": "Again, there are four things: 1. a mind of kindness; 2. a mind of compassion; 3. a mind free of craving; and 4. an act of giving to someone who doesn't have a place of benevolence.",
        "source": "T24n1488_003:1050b17_4"
    },
    {
        "source_sentence": "復有五法：一者、先於怨所以善益之，二者、見怖懅者能為救護，三者、求者未索先開心與，",
        "translation": "Again, there are five things: 1. first, benefiting those who have previously been harmed by an enemy because of their goodness; 2. being able to rescue those who are frightened when they see a grudge; and 3. providing relief for those who",
        "source": "T24n1488_003:1050b19_5"
    },
    {
        "source_sentence": "四者、凡所施處平等無二，五者、普慈一切不依因緣。",
        "translation": "4. equality and nonduality in the place where they give, and 5. universal compassion for all without relying on causes or conditions.",
        "source": "T24n1488_003:1050b21_6"
    },
    {
        "source_sentence": "復有四法：一者、終不自輕言我不能得菩提果，二者、趣菩提時其心堅固，",
        "translation": "There are another four things: 1. They never despise themselves and say, 'I can't attain the fruit of enlightenment.' 2.",
        "source": "T24n1488_003:1050b22_7"
    },
    {
        "source_sentence": "三者、精進勤修一切善法，四者、造作大事心不疲悔。",
        "translation": "3. exerting themselves to diligently cultivate all good qualities, and 4. creating great works without weariness of mind.",
        "source": "T24n1488_003:1050b24_8"
    },
    {
        "source_sentence": "復有四事：一者、自學善法，學已教人；",
        "translation": "Again, there are four kinds of things. The first is to learn the true Dharma for oneself and teach others after learning it.",
        "source": "T24n1488_003:1050b25_9"
    },
    {
        "source_sentence": "二者、自離惡法，教人令離；",
        "translation": "The second is that they themselves should abstain from evil deeds, and they should teach others to do so.",
        "source": "T24n1488_003:1050b26_10"
    },
    {
        "source_sentence": "三者、善能分別善惡之法；",
        "translation": "The third is that they are skillful in discerning good and evil dharmas.",
        "source": "T24n1488_003:1050b27_0"
    },
    {
        "source_sentence": "四者、於一切法不取不著。",
        "translation": "4. They don't grasp or attach to all dharmas.",
        "source": "T24n1488_003:1050b27_1"
    },
    {
        "source_sentence": "復有四法：一者、知有為法無我我所，二者、知一切業悉有果報，三者、知有為法皆是無常，",
        "translation": "4.5.29 Again, there is another fourfold doctrine that explains four kinds of causality:",
        "source": "T24n1488_003:1050b28_2"
    },
    {
        "source_sentence": "四者、知從苦生樂，從樂生苦。",
        "translation": "4. They know that pleasure arises from suffering and that pain arises from pleasure.",
        "source": "T24n1488_003:1050c01_3"
    },
    {
        "source_sentence": "復有三法：一者、於諸眾生心無取著，二者、施眾生樂其心平等，三者、如說而行。",
        "translation": "Again, there are three things: 1. the mind has no attachment to sentient beings; 2. it gives equanimity to sentient beings and enjoys their minds equally; and 3. it acts as explained.",
        "source": "T24n1488_003:1050c01_4"
    },
    {
        "source_sentence": "復有三法：一者、能施眾生樂因，二者、所作不求恩報，三者、自知定當得成阿耨多羅三藐三菩提。",
        "translation": "Again, there are three things: 1. the cause of being able to give happiness to sentient beings; 2. that which is done without seeking reward for kindness; and 3. knowing for themselves that they will surely attain unsurpassed, correct, and complete enlighten",
        "source": "T24n1488_003:1050c03_5"
    },
    {
        "source_sentence": "復有三法：一者、為諸眾生受大苦惱，二者、次第受之，三者、中間不息，",
        "translation": "Again, there are three kinds of dharmas: 1. They experience great suffering and distress for the sake of sentient beings; 2. they experience it in sequence; 3. they don't stop between them.",
        "source": "T24n1488_003:1050c05_6"
    },
    {
        "source_sentence": "雖受是苦心終不悔。",
        "translation": "Even though they experience this kind of suffering, they never regret it.",
        "source": "T24n1488_003:1050c07_7"
    },
    {
        "source_sentence": "復有三法：一者、未除愛心、能捨所愛施與他人，二者、未除瞋恚、有惡來加而能忍之，",
        "translation": "Again, there are three things: 1. they can tolerate anger without removing their cravings and give what they love to others without being rid of it; 2. they can tolerate anger without removing anger and harmful feelings that come",
        "source": "T24n1488_003:1050c07_8"
    },
    {
        "source_sentence": "三者、未除癡心、而能分別善惡之法。",
        "translation": "3. They haven't yet removed the mind of delusion and are able to discern good and bad dharmas.",
        "source": "T24n1488_003:1050c09_9"
    },
    {
        "source_sentence": "復有三法：一者、善知方便能教眾生遠離惡法，二者、知善方便能教眾生令修善法，",
        "translation": "4.5.29 Again, there is another triple doctrine that explains three kinds of principles:",
        "source": "T24n1488_003:1050c10_10"
    },
    {
        "source_sentence": "三者、化眾生時心無疲悔。",
        "translation": "3. The mind doesn't tire when transforming sentient beings.",
        "source": "T24n1488_003:1050c12_11"
    },
    {
        "source_sentence": "復有三法：一者、為令眾生離身苦時，自於身命心不悋惜，二者、為令眾生離心苦時，",
        "translation": "“Furthermore, there are three kinds of causality: first, in order to cause sentient beings to be free from the suffering of physical pain, they do not cherish body, life, or mind.",
        "source": "T24n1488_003:1050c13_12"
    },
    {
        "source_sentence": "自於身命心不悋惜；",
        "translation": "They do not cherish body, life, or mind.",
        "source": "T24n1488_003:1050c14_13"
    },
    {
        "source_sentence": "三者、教化眾生修善法時，自於身命心不悋惜。",
        "translation": "3. When he teaches sentient beings to cultivate good qualities, he doesn't spare his own body, life, or mind when he cultivates them.",
        "source": "T24n1488_003:1050c15_14"
    },
    {
        "source_sentence": "復有三法：一者、自捨己事先營他事，二者、營他事時不擇時節，三者、終不顧慮辛苦憂惱。",
        "translation": "Again, there are three things: 1. self-abandonment and prior preparation for other affairs; 2. not discriminating time and season when doing other affairs; and 3. never worrying about hardships and distress.",
        "source": "T24n1488_003:1050c16_15"
    },
    {
        "source_sentence": "復有三法：一者、心無妬嫉，二者、見他受樂心生歡喜，三者、善心相續間無斷絕。",
        "translation": "Again, there are three things: 1. a mind that's free of jealousy; 2. a mind that becomes joyous when it sees the happiness of others; and 3. a good mind that continues without break.",
        "source": "T24n1488_003:1050c18_16"
    },
    {
        "source_sentence": "復有三事：一者、見他少善，心初不忘；",
        "translation": "“Furthermore, there are three things:",
        "source": "T24n1488_003:1050c20_17"
    },
    {
        "source_sentence": "二者、毫末之慧，輒思多報；",
        "translation": "The second is that the wisdom of the slightest ounce of knowledge can easily think of many rewards.",
        "source": "T24n1488_003:1050c21_18"
    },
    {
        "source_sentence": "三者、於無量世受無量苦，其心堅固無退轉想。",
        "translation": "3. They experience measureless suffering in measureless worlds, and their minds are resolute without the perception of retrogression.",
        "source": "T24n1488_003:1050c21_19"
    },
    {
        "source_sentence": "復有三法：一者、深知生死多諸過咎，猶故不捨一切作業；",
        "translation": "Again, there are three kinds of dharmas:",
        "source": "T24n1488_003:1050c22_20"
    },
    {
        "source_sentence": "二者、見諸眾生無歸依者為作歸依，三者、見惡眾生心生憐愍，不責其過。",
        "translation": "2. they take refuge in those who see that sentient beings lack refuge, and 3. they become compassionate to bad sentient beings and don't blame them for their faults.",
        "source": "T24n1488_003:1050c24_21"
    },
    {
        "source_sentence": "復有三法：一者、親近善友，二者、聞法無厭，三者、至心諮受善知識教。",
        "translation": "Again, there are three things: 1. Being close to good friends; 2. not getting tired of hearing the Dharma; and 3. wholeheartedly consulting with a good teacher.",
        "source": "T24n1488_003:1050c25_22"
    },
    {
        "source_sentence": "復有九法：遠離三法，三時不悔，平等慧施三種眾生。",
        "translation": "Again, there are nine dharmas: being free of the three dharmas, not repenting at three times, and giving equal wisdom to three kinds of sentient beings.",
        "source": "T24n1488_003:1050c27_23"
    },
    {
        "source_sentence": "復有四法：所謂慈、悲、喜、捨。",
        "translation": "Again, there are four dharmas: so-called kindness, pity, compassion, joy and equanimity.",
        "source": "T24n1488_003:1050c28_24"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1050c29_25"
    },
    {
        "source_sentence": "菩薩若以淨法淨心，要在二時：一、佛出世時，二、緣覺出時。",
        "translation": "If a bodhisattva uses pure dharmas and pure minds, it's at two times: 1. when the Buddha emerges in the world and 2. when the pratyekabuddha emerges.",
        "source": "T24n1488_003:1050c29_26"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1051a01_27"
    },
    {
        "source_sentence": "眾生善法有三種生：一、從聞生，二、從思生，三、從修生。",
        "translation": "There are three kinds of good qualities that arise in sentient beings: 1. they arise from hearing, 2. they arise from thinking, and 3. they arise from cultivating.",
        "source": "T24n1488_003:1051a01_28"
    },
    {
        "source_sentence": "聞思二種在二時中，從修生者，不必爾也。",
        "translation": "The two kinds of hearing and thinking arise at two moments: the one who arises through personal realisation. It is not necessary to do so.",
        "source": "T24n1488_003:1051a03_29"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1051a04_30"
    },
    {
        "source_sentence": "菩薩二種：一者、在家，二者、出家。",
        "translation": "There are two kinds of bodhisattvas: 1. those who remain householders and 2. those who leave home.",
        "source": "T24n1488_003:1051a04_31"
    },
    {
        "source_sentence": "出家菩薩如是淨戒，是不為難；",
        "translation": "It is no difficulty for a renunciant bodhisattva to keep the pure precepts like this.",
        "source": "T24n1488_003:1051a05_32"
    },
    {
        "source_sentence": "在家淨戒是乃為難。",
        "translation": "This is the difficulty of purifying precepts at home.",
        "source": "T24n1488_003:1051a05_33"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_003:1051a06_34"
    },
    {
        "source_sentence": "在家之人多惡因緣所纏繞故。」",
        "translation": "It's because laypeople are often tethered by bad causes and conditions.",
        "source": "T24n1488_003:1051a06_35"
    },
    {
        "source_sentence": "優婆塞戒經息惡品第十六",
        "translation": "Upāsaka Precepts Sutra on Cessation of Evil, Chapter 16",
        "source": "T24n1488_003:1051a08_0"
    },
    {
        "source_sentence": "善生言：「世尊！",
        "translation": "Sunetra said, Bhagavān!",
        "source": "T24n1488_003:1051a09_0"
    },
    {
        "source_sentence": "菩薩已受優婆塞戒，若有內外諸惡不淨因緣，云何得離？」",
        "translation": "After the bodhisattva has received the layman's precepts, if there are bad and impure internal and external causes and conditions, how can he be freed?",
        "source": "T24n1488_003:1051a09_1"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1051a10_2"
    },
    {
        "source_sentence": "菩薩若有內外諸惡不淨因緣，是人應當修念佛心。",
        "translation": "If a bodhisattva has internal and external bad and impure causes and conditions, that person should cultivate mindfulness of the Buddha's mind.",
        "source": "T24n1488_003:1051a10_3"
    },
    {
        "source_sentence": "若有至心修念佛者，是人則得離內外惡不淨因緣，增長悲慧。」",
        "translation": "If someone sincerely cultivates mindfulness of the Buddha, they'll be freed from internal and external bad and impure causes and conditions and grow in compassion and wisdom.",
        "source": "T24n1488_003:1051a11_4"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T24n1488_003:1051a13_5"
    },
    {
        "source_sentence": "當云何修？」",
        "translation": "How will it be cultivated?",
        "source": "T24n1488_003:1051a13_6"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1051a13_7"
    },
    {
        "source_sentence": "當觀如來有七勝事：一者、身勝，二者、如法住勝，三者、智勝，四者、具足勝，",
        "translation": "You should observe that the Tathāgata has seven superior qualities: 1. superiority in body, 2. superiority in abiding according to the teachings, 3. superiority in knowledge, and 4. superiority in fulfillment.",
        "source": "T24n1488_003:1051a13_8"
    },
    {
        "source_sentence": "五者、行處勝，六者、不可思議勝，七者、解脫勝。",
        "translation": "The fifth is the superiority of the place of practice, the sixth is the superiority of inconceivability, and the seventh is the superiority of liberation.",
        "source": "T24n1488_003:1051a15_9"
    },
    {
        "source_sentence": "云何身勝？",
        "translation": "What is the superiority of the body?",
        "source": "T24n1488_003:1051a16_10"
    },
    {
        "source_sentence": "如來身為三十二相、八十種好之所嚴飾，一一節力敵萬八十伊羅鉢那香象之力，",
        "translation": "The body of the Buddha was adorned with the thirty-two marks and eighty kinds of beautiful embellishments, each bodily force equaling the power of one thousand eighty-eight myriad elephants in the form of Airāvana",
        "source": "T24n1488_003:1051a16_11"
    },
    {
        "source_sentence": "眾生樂見無有厭足，是名身勝。",
        "translation": "Sentient beings who are happy to see and don't tire of it, which is called the superiority of the body.",
        "source": "T24n1488_003:1051a18_12"
    },
    {
        "source_sentence": "云何如法住勝？",
        "translation": "What's the superiority of abiding according to the teaching?",
        "source": "T24n1488_003:1051a19_13"
    },
    {
        "source_sentence": "如來既自得利益已，復能憐愍救濟利益無量眾生，是名如法住勝。",
        "translation": "Once the Tathāgata has gained benefits for himself, he's also able to pity and save measureless sentient beings, which is called abiding in the superiority of following the Dharma.",
        "source": "T24n1488_003:1051a19_14"
    },
    {
        "source_sentence": "云何智勝？",
        "translation": "What is the superiority of knowledge?",
        "source": "T24n1488_003:1051a21_15"
    },
    {
        "source_sentence": "如來所有四無礙智，非諸聲聞、緣覺所及，是名智勝。",
        "translation": "The four kinds of unhindered cognition possessed by the Tathāgata that aren't available to śrāvakas and pratyekbuddhas are called superior in terms of wisdom.",
        "source": "T24n1488_003:1051a21_16"
    },
    {
        "source_sentence": "云何具足勝？",
        "translation": "What is the superiority of being fully endowed?",
        "source": "T24n1488_003:1051a22_17"
    },
    {
        "source_sentence": "如來具足行、命、戒、見，是名具足勝。",
        "translation": "The Tathāgata is endowed with practice, life, precepts, and views, which are called being endowed with superiority.",
        "source": "T24n1488_003:1051a22_18"
    },
    {
        "source_sentence": "云何行處勝？",
        "translation": "What's the superiority of the place of practice?",
        "source": "T24n1488_003:1051a23_19"
    },
    {
        "source_sentence": "如來世尊修三三昧、九次第等，非諸聲聞、緣覺所及，是名行處勝。",
        "translation": "The Tathāgata Bhagavān cultivates the three samādhis, nine sequential sequences, and so forth, which are beyond the ability of śrāvakas and pratyekbuddhas, and this is called the superiority of the practice",
        "source": "T24n1488_003:1051a24_0"
    },
    {
        "source_sentence": "云何不可思議勝？",
        "translation": "What's inconceivable superiority?",
        "source": "T24n1488_003:1051a25_1"
    },
    {
        "source_sentence": "如來所有六種神通，亦非聲聞，緣覺所及；",
        "translation": "The six kinds of spiritual powers possessed by buddhas are beyond the ability of śrāvakas or pratyekabuddhas.",
        "source": "T24n1488_003:1051a25_2"
    },
    {
        "source_sentence": "如來十力、四無所畏、大悲、三念處，是名不可思議勝。",
        "translation": "The Tathāgata's ten powers, four fearlessnesses, great compassion, and three abodes of mindfulness are called inconceivable excellence.",
        "source": "T24n1488_003:1051a26_3"
    },
    {
        "source_sentence": "云何解脫勝？",
        "translation": "What's the superiority of liberation?",
        "source": "T24n1488_003:1051a28_0"
    },
    {
        "source_sentence": "如來具足二種解脫勝，除智慧障及煩惱障，永斷一切煩惱習氣，智緣二事俱得自在，",
        "translation": "The Tathagata is endowed with two kinds of liberation superiority: exception made for the obstacle wisdom-obstruction and the obstacle to defilement, he permanently eliminates all habit energy of defilement. He acquires mastery over",
        "source": "T24n1488_003:1051a28_1"
    },
    {
        "source_sentence": "是名解脫勝。",
        "translation": "This is called the superiority of liberation.",
        "source": "T24n1488_003:1051b01_2"
    },
    {
        "source_sentence": "是故舍利弗於契經中讚歎如來具七勝法，如來從觀不淨乃至得阿耨多羅三藐三菩提，",
        "translation": "That is why Śāriputra praised in the scriptures that the Tathāgata possesses seven superior qualities. The Tathāgata observes impurity and attains highest, complete enlightenment.",
        "source": "T24n1488_003:1051b01_3"
    },
    {
        "source_sentence": "從莊嚴地至解脫地，勝於聲聞、辟支佛等，是故如來名無上尊。",
        "translation": "From the stage of adornment up to the stage of liberation, he's superior to śrāvakas and pratyekbuddhas, so the Tathāgata is called the unsurpassed honored one.",
        "source": "T24n1488_003:1051b03_4"
    },
    {
        "source_sentence": "如來世尊修空三昧，滅定三昧，四禪慈悲，觀十二因緣，皆悉為利諸眾生故。",
        "translation": "The Tathāgata, the Bhagavān, cultivates the samādhi of emptiness, the samādhi of cessation, the fourth meditation with compassion, and observes 12 causes and conditions for the benefit of all sentient beings.",
        "source": "T24n1488_003:1051b05_5"
    },
    {
        "source_sentence": "如來正覺，發言無二，故名如來。",
        "translation": "The Tathāgata is a perfectly enlightened one, and the words he utters are not two; therefore, he's called the Tathāgata.",
        "source": "T24n1488_003:1051b06_6"
    },
    {
        "source_sentence": "如往先佛從莊嚴地出，得阿耨多羅三藐三菩提，故名如來。",
        "translation": "Just as in the past buddhas emerged from the stage of adornment and attained anuttarii samyaksarrzbodhi, so they're called tathāgatas.",
        "source": "T24n1488_003:1051b07_7"
    },
    {
        "source_sentence": "具足獲得微妙正法，名阿羅呵。",
        "translation": "Being fully endowed with the attainment of the subtle right teaching is called arhatship.",
        "source": "T24n1488_003:1051b08_8"
    },
    {
        "source_sentence": "能受一切人天供養，名阿羅呵。",
        "translation": "He's able to receive the offerings of all humans and gods, which are called arāha.",
        "source": "T24n1488_003:1051b09_9"
    },
    {
        "source_sentence": "覺了二諦——世諦、真諦——名三藐三佛陀。",
        "translation": "To perceive the two truths - the conventional truth and the true truth - is called samyak-saṃbuddha.",
        "source": "T24n1488_003:1051b10_10"
    },
    {
        "source_sentence": "修持淨戒，具足三明，名明行足。",
        "translation": "Cultivating pure precepts that are fully endowed with the three kinds of insight is called the sufficientness of insight and practice.",
        "source": "T24n1488_003:1051b11_11"
    },
    {
        "source_sentence": "更不復生諸有之中，故名善逝。",
        "translation": "They won't be born again among existences, so they're called well gone.",
        "source": "T24n1488_003:1051b11_12"
    },
    {
        "source_sentence": "知二世界——眾生世界、國土世界——名世間解。",
        "translation": "Knowing the two worlds - the world of sentient beings and the world of lands - is called worldly understanding.",
        "source": "T24n1488_003:1051b12_13"
    },
    {
        "source_sentence": "善知方便調伏眾生，名調御丈夫。",
        "translation": "Knowing well how to skillfully tame sentient beings is called taming the husband.",
        "source": "T24n1488_003:1051b13_14"
    },
    {
        "source_sentence": "能令眾生不生怖畏，方便教化離苦受樂，是名天人師。",
        "translation": "Being able to cause sentient beings not to become frightened and skillfully teaching them to part with suffering and experience pleasure is called the teacher of gods and humans.",
        "source": "T24n1488_003:1051b14_15"
    },
    {
        "source_sentence": "知一切法及一切行，故名為佛。",
        "translation": "Knowing all dharmas and all practices, they're called buddhas.",
        "source": "T24n1488_003:1051b15_16"
    },
    {
        "source_sentence": "能破四魔，名婆伽婆。",
        "translation": "Being able to destroy the four demons, it's called a Bhagavān.",
        "source": "T24n1488_003:1051b16_17"
    },
    {
        "source_sentence": "復觀如來行戒定慧，為益眾生。",
        "translation": "Again, he observes the Tathāgata's practice of morality, concentration, and wisdom for the benefit of sentient beings.",
        "source": "T24n1488_003:1051b16_18"
    },
    {
        "source_sentence": "久於無量無數世中，怨親等利，無有差別。",
        "translation": "For a long time, in measureless and countless worlds, there's no distinction between such benefits as enemies and relatives.",
        "source": "T24n1488_003:1051b17_19"
    },
    {
        "source_sentence": "悉斷一切無量煩惱，一一皆知，一一眾生為一煩惱無量世中受大苦惱。",
        "translation": "They completely eliminate all the measureless afflictions, each knowing that each sentient being is a single affliction that experiences great suffering and distress in an immeasurable number of worlds.",
        "source": "T24n1488_003:1051b18_20"
    },
    {
        "source_sentence": "如來世尊為眾生故，難施能施，難忍能忍。",
        "translation": "The Bhagavān, the Tathāgata, for the sake of sentient beings, is difficult to give and able to give, and he's difficult to tolerate and able to tolerate.",
        "source": "T24n1488_003:1051b20_21"
    },
    {
        "source_sentence": "佛有二淨：一、莊嚴淨，二、果報淨。",
        "translation": "The Buddha has two kinds of purity: 1. the purity of adornment and 2. the purity of retribution.",
        "source": "T24n1488_003:1051b21_22"
    },
    {
        "source_sentence": "如是二淨因緣力故，從初十十至後十十，無有人天能說其過。",
        "translation": "Thus, because of the power of these two pure causes and conditions, there are no humans or gods who can explain their faults from the first ten to the last ten.",
        "source": "T24n1488_003:1051b21_23"
    },
    {
        "source_sentence": "如來具足八萬音聲，眾生聞之不生厭離，以是因緣，如來出勝一切聲聞、辟支佛等。",
        "translation": "The Tathāgata has 80,000 sounds that sentient beings hear and don't become disillusioned when they hear them, and because of these causes and conditions, the Tathāgata emerges as superior to all śrāvakas and pratyekbuddhas.",
        "source": "T24n1488_003:1051b23_24"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1051b25_25"
    },
    {
        "source_sentence": "若人受持優婆塞戒欲淨戒者，當作如是修念佛心。",
        "translation": "If someone receives and observes the pure precepts of the layman's precepts, they should thus cultivate mindfulness of the Buddha's mind.",
        "source": "T24n1488_003:1051b25_26"
    },
    {
        "source_sentence": "若修念佛，是人則離內外諸惡不淨因緣，增長悲慧，貪、瞋、癡斷，具足成就一切善法。",
        "translation": "If someone cultivates mindfulness of the Buddha, they'll be freed from internal and external bad and impure causes and conditions, increase compassion and wisdom, stop craving, anger, and delusion, and fully accomplish all good qualities.",
        "source": "T24n1488_003:1051b26_27"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1051b28_28"
    },
    {
        "source_sentence": "菩薩二種：一者、在家，二者、出家。",
        "translation": "There are two kinds of bodhisattvas: 1. those who remain householders and 2. those who leave home.",
        "source": "T24n1488_003:1051b28_29"
    },
    {
        "source_sentence": "出家菩薩修念佛心，是不為難；",
        "translation": "It is no difficulty for renunciant enlightening beings to cultivate mindfulness of buddhas.",
        "source": "T24n1488_003:1051b29_30"
    },
    {
        "source_sentence": "在家修集，是乃為難。",
        "translation": "This is the difficulty of cultivating collections at home.",
        "source": "T24n1488_003:1051c01_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_003:1051c01_1"
    },
    {
        "source_sentence": "在家之人多惡因緣所纏繞故。」",
        "translation": "It's because laypeople are often tethered by bad causes and conditions.",
        "source": "T24n1488_003:1051c01_2"
    },
    {
        "source_sentence": "優婆塞戒經供養三寶品第十七",
        "translation": "Upāsaka Precepts Sutra on Making Offerings to the Three Treasures, Chapter XVII",
        "source": "T24n1488_003:1051c03_0"
    },
    {
        "source_sentence": "善生言：「世尊！",
        "translation": "Sunetra said, Bhagavān!",
        "source": "T24n1488_003:1051c04_0"
    },
    {
        "source_sentence": "菩薩已受優婆塞戒，復當云何供養三寶？」",
        "translation": "After the bodhisattva has received the layman's precepts, how will he again make offerings to the Three Treasures?",
        "source": "T24n1488_003:1051c04_1"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1051c05_2"
    },
    {
        "source_sentence": "世間福田凡有三種：一、報恩田，二、功德田，三、貧窮田。",
        "translation": "There are three kinds of fields of worldly merit: 1. the field of repaying kindness, 2. the field of merit, and 3. the field of poverty.",
        "source": "T24n1488_003:1051c05_3"
    },
    {
        "source_sentence": "報恩田者：所謂父母、師長、和上。",
        "translation": "The field of repaying kindness refers to the so-called parents, teachers, elders, and monks.",
        "source": "T24n1488_003:1051c06_4"
    },
    {
        "source_sentence": "功德田者：從得煖法乃至得阿耨多羅三藐三菩提。",
        "translation": "The field of merit: from attaining the Dharma of warmth up to attaining unsurpassed, correct enlightenment.",
        "source": "T24n1488_003:1051c07_5"
    },
    {
        "source_sentence": "貧窮田者：一切窮苦困厄之人。",
        "translation": "The field of the poor: All those who are poor, suffering, and in distress.",
        "source": "T24n1488_003:1051c08_6"
    },
    {
        "source_sentence": "如來世尊是二種福田：一者、報恩田，二、功德田。",
        "translation": "Bhagavān, the Tathāgata is a field of two kinds of blessings: 1. a field of repaying kindness and 2. a field of merit.",
        "source": "T24n1488_003:1051c09_7"
    },
    {
        "source_sentence": "法亦如是，是二種田。",
        "translation": "The same applies to the doctrine: these are two kinds of field.",
        "source": "T24n1488_003:1051c10_8"
    },
    {
        "source_sentence": "眾僧三種：一、報恩田，二、功德田，三、貧窮田。",
        "translation": "There are three kinds of saṃgha: 1. the field of repaying kindness, 2. the field of merit, and 3. the field of the poor.",
        "source": "T24n1488_003:1051c10_9"
    },
    {
        "source_sentence": "以是因緣，菩薩已受優婆塞戒，應當至心勤供養三寶。",
        "translation": "Because of these causes and conditions, the bodhisattva who has received the layman's precepts should wholeheartedly and diligently make offerings to the Three Treasures.",
        "source": "T24n1488_003:1051c11_10"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1051c13_11"
    },
    {
        "source_sentence": "如來即是一切法藏，是故智者應當至心勤心供養生身、滅身、形像、塔廟！",
        "translation": "The Tathāgata is the store of all dharmas, so wise people should wholeheartedly and diligently make offerings to nourish body, cease body, form, and stūpa!",
        "source": "T24n1488_003:1051c13_12"
    },
    {
        "source_sentence": "若於空野無塔像處，常當繫念尊重讚歎，若自力作，若勸人作；",
        "translation": "If there are no stupas or images in the open space or in the wilderness, they should always be remembered and honored and praised. They may do so by themselves or encourage others to do so.",
        "source": "T24n1488_003:1051c14_13"
    },
    {
        "source_sentence": "見人作時，心生歡喜；",
        "translation": "When they see someone doing it, their hearts are overjoyed.",
        "source": "T24n1488_003:1051c16_14"
    },
    {
        "source_sentence": "如其自有功德力者，要當廣教眾多之人而共作之。",
        "translation": "If they themselves have the power of merit, they must teach it widely to many people and make it together.",
        "source": "T24n1488_003:1051c16_15"
    },
    {
        "source_sentence": "既供養已，於己身中莫生輕想，於三寶所亦應如是。",
        "translation": "Having made offerings, don't give rise to despise thoughts in your own body, and so it should be likewise with the Three Treasures.",
        "source": "T24n1488_003:1051c18_0"
    },
    {
        "source_sentence": "凡所供養，不使人作，不為勝他，作時不悔，心不愁惱，合掌讚歎，恭敬尊重。",
        "translation": "Whenever he makes an offering, he doesn't cause others to do it, doesn't overpower others, doesn't regret it when he does it, doesn't become sad in mind, joins his palms in praise, and venerates it with respect",
        "source": "T24n1488_003:1051c19_1"
    },
    {
        "source_sentence": "若以一錢至無量寶，若以一綖至無量綖，若以一花至無量花，若以一香至無量香，",
        "translation": "If he takes a coin and reaches measureless treasures, or if he takes a bowl and reaches measureless bowls with a bowl, or if he takes one flower and reaches measureless flowers, or if he takes one fragrance and reaches measureless",
        "source": "T24n1488_003:1051c20_2"
    },
    {
        "source_sentence": "若以一偈讚至無量偈讚，若以一禮至無量禮，若遶一匝至無量匝，若一時中乃至無量時，",
        "translation": "If he praises it with a single verse up to an infinite number of verses, or if he praises it with a single salutation up to an infinite number of salutations, or if he circumambulates it one time up to an infinite number of times",
        "source": "T24n1488_003:1051c22_3"
    },
    {
        "source_sentence": "若自獨作若共人作，善男子！",
        "translation": "Whether it's self-made or shared with someone else, good man!",
        "source": "T24n1488_003:1051c24_4"
    },
    {
        "source_sentence": "若能如是至心供養佛、法、僧者，若我現在及涅槃後，等無差別。",
        "translation": "If someone can thus wholeheartedly make offerings to the Buddha, Dharma, and Saṃgha, there's no distinction between self in the present and after nirvāṇa.",
        "source": "T24n1488_003:1051c25_5"
    },
    {
        "source_sentence": "見塔廟時，應以金、銀、銅、鐵、繩鎖、幡蓋、伎樂、香油、燈明而供養之。",
        "translation": "When they see a stūpa or shrine, they should make offerings of gold, silver, copper, iron, rope chains, banners, canopies, music, scented oil, and lamps.",
        "source": "T24n1488_003:1051c26_6"
    },
    {
        "source_sentence": "若見鳥獸踐蹋毀壞，要當塗治掃除令淨；",
        "translation": "If you see birds and beasts trampling on your property, you must clean it and make it pure.",
        "source": "T24n1488_003:1051c28_7"
    },
    {
        "source_sentence": "暴風水火之所壞處，亦當自治。",
        "translation": "Where a storm, wind, water, or fire breaks down, they'll also be free to do so.",
        "source": "T24n1488_003:1051c29_8"
    },
    {
        "source_sentence": "自若無力，當勸人治。",
        "translation": "If you yourself lack the strength, you should encourage others to treat it.",
        "source": "T24n1488_003:1052a01_9"
    },
    {
        "source_sentence": "或以金、銀、銅、鐵、土、木。",
        "translation": "Or it might be made of gold, silver, copper, iron, earthenware, or wood.",
        "source": "T24n1488_003:1052a01_10"
    },
    {
        "source_sentence": "若有塵土，灑掃除拂，若有垢污，以香水洗。",
        "translation": "If there's dirt or dirt, sprinkle it and sweep it; if there's dirt or dirt, wash it with perfume.",
        "source": "T24n1488_003:1052a02_11"
    },
    {
        "source_sentence": "若作寶塔及作寶像，作訖當以種種幡、蓋、香、花奉上。",
        "translation": "If you make a jeweled stūpa or an image, after making it, you'll offer various kinds of banners, canopies, incense, and flowers to them.",
        "source": "T24n1488_003:1052a03_0"
    },
    {
        "source_sentence": "若無真寶，力不能辦，次以土木而造成之，成訖亦當幡、蓋、香、花、種種伎樂而供養之。",
        "translation": "If there's no true treasure, the power can't make it; next, he creates it with dirt and wood, and after completing it, he or she will also offer banners, canopies, incense, flowers, and various kinds of",
        "source": "T24n1488_003:1052a04_1"
    },
    {
        "source_sentence": "若是塔中草木不淨，鳥獸死尸及其糞穢、萎花臭爛、悉當除去，蛇、鼠孔穴，",
        "translation": "If the grass and trees in a stūpa are impure, birds, animals, dead corpses, dung, shrimps, withered flowers that smell bad and rotten, all will be removed, and snakes, rats, holes,",
        "source": "T24n1488_003:1052a06_2"
    },
    {
        "source_sentence": "當塞治之。",
        "translation": "He'll be purged and treated.",
        "source": "T24n1488_003:1052a07_3"
    },
    {
        "source_sentence": "銅像、木像、石像、泥像、金、銀、琉璃、頗梨等像，常當洗治，任力香塗。",
        "translation": "Copper images, wooden images, stone images, mud images, gold, silver, lapis lazuli, and crystal images should always be cleansed and treated with the power of fragrance and odor.",
        "source": "T24n1488_003:1052a07_4"
    },
    {
        "source_sentence": "隨力造作種種瓔珞，乃至猶如轉輪聖王塔。",
        "translation": "He makes various jewelry as he wishes, just like a universal sage-turning king’s tower.",
        "source": "T24n1488_003:1052a09_5"
    },
    {
        "source_sentence": "精舍內當以香塗。",
        "translation": "Inside the monastery, it should be coated with incense.",
        "source": "T24n1488_003:1052a10_6"
    },
    {
        "source_sentence": "若白土泥作塔像已，當以琉璃、頗梨、真珠、綾絹、綵綿、鈴磬、繩鎖而供養之。",
        "translation": "If he makes a stūpa of white clay, he'll make an image of it with lapis lazuli, pāri, genuine pearls, silk, woven silk, cotton, bells, chimes, and cords to",
        "source": "T24n1488_003:1052a10_7"
    },
    {
        "source_sentence": "畫佛像時，綵中不雜膠乳雞子，應以種種花貫、散花、妙紼、明鏡、末香、塗香、散香、燒香、種種伎樂，",
        "translation": "When he paints an image of the Buddha, he should embroiderate it without mixing glue or milk fowl with various kinds of flowers, scatter flowers, exquisitely fragrant silks, bright mirrors, powdered incense, oint",
        "source": "T24n1488_003:1052a12_8"
    },
    {
        "source_sentence": "歌舞供養。",
        "translation": "They sang and danced to make offerings.",
        "source": "T24n1488_003:1052a14_9"
    },
    {
        "source_sentence": "如晝，夜亦如是；",
        "translation": "As during the day, so at night.",
        "source": "T24n1488_003:1052a14_10"
    },
    {
        "source_sentence": "如夜，晝亦如是。",
        "translation": "As it is at night, so it is during the day.",
        "source": "T24n1488_003:1052a15_11"
    },
    {
        "source_sentence": "不如外道燒酥、大麥而供養之。",
        "translation": "It's not like a non-Buddhist who burns butter or wheat and makes offerings to it.",
        "source": "T24n1488_003:1052a15_12"
    },
    {
        "source_sentence": "終不以酥塗塔像身，亦不乳洗。",
        "translation": "They never smeared the statue’s body with butter and did not wash it with milk.",
        "source": "T24n1488_003:1052a16_13"
    },
    {
        "source_sentence": "不應造作半身佛像；",
        "translation": "You should not make a half-bodied buddha image.",
        "source": "T24n1488_003:1052a17_14"
    },
    {
        "source_sentence": "若有形像身不具足，當密覆藏，勸人令治，治已具足，然後顯示。",
        "translation": "If there's an image whose body isn't complete, it should be hidden and encouraged to be healed, and after healing it is complete, it will then be revealed.",
        "source": "T24n1488_003:1052a17_15"
    },
    {
        "source_sentence": "見像毀壞，應當至心供養恭敬，如完無別。",
        "translation": "When you see an image destroyed, you should wholeheartedly offer support and respect, just as if it were complete without distinction.",
        "source": "T24n1488_003:1052a19_16"
    },
    {
        "source_sentence": "如是供養要身自作，若自無力，當為他使，亦勸他人令佐助之。",
        "translation": "Such an offering is made on one's own, and if they lack the strength to do so, they should be messengers for others and encourage others to help them.",
        "source": "T24n1488_003:1052a20_17"
    },
    {
        "source_sentence": "「若人能以四天下寶供養如來，有人直以種種功德尊重讚歎，至心恭敬，",
        "translation": "“Suppose someone were to offer the Tathāgata treasures of the four quarters of the earth as an offering, and someone venerates and praises him with various merits, wholeheartedly honoring and venerating him.",
        "source": "T24n1488_003:1052a21_18"
    },
    {
        "source_sentence": "是二福德等無差別。",
        "translation": "These are the two kinds of merit and so forth without distinction.",
        "source": "T24n1488_003:1052a23_19"
    },
    {
        "source_sentence": "所謂如來身心具足，身有微妙三十二相、八十種好、具足大力，心有十力、四無所畏、大悲、三念、五智三昧、三種法門、十一種空、觀十二緣智、無量禪定、具足七智、已能度到六波羅蜜岸。",
        "translation": "The Tathāgata's body and mind are endowed with the thirty-two subtle marks, eighty kinds of beauty, and great strength, and his mind has ten powers, four fearlessnesses, great compassion, three thoughts,",
        "source": "T24n1488_003:1052a23_20"
    },
    {
        "source_sentence": "若人能以如是等法讚歎佛者，是人則名真供養佛。",
        "translation": "If someone can praise the Buddha with such teachings, that person is called a true offering to the Buddha.",
        "source": "T24n1488_003:1052a27_21"
    },
    {
        "source_sentence": "「云何名為供養於法？",
        "translation": "What's called making offerings to the Dharma?",
        "source": "T24n1488_003:1052a28_22"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1052a29_23"
    },
    {
        "source_sentence": "若能供養十二部經，名供養法。",
        "translation": "If someone can make offerings to the twelve scriptures, they're called an offering dharma.",
        "source": "T24n1488_003:1052a29_24"
    },
    {
        "source_sentence": "云何供養十二部經？",
        "translation": "What are the twelve kinds of offerings to the scriptures?",
        "source": "T24n1488_003:1052b01_25"
    },
    {
        "source_sentence": "若能至心信樂受持、讀誦、解說、如說而行，既自為己，復勸人行，是名供養十二部經。",
        "translation": "If someone can wholeheartedly believe and happily memorize, recite, explain, and practice the teachings as they are taught, and if they do so for themselves and then encourage others to practice them, this is called making offerings to the twelve scriptures",
        "source": "T24n1488_003:1052b01_26"
    },
    {
        "source_sentence": "若能書寫十二部經，既書寫已，種種供養，如供養佛，唯除洗浴。",
        "translation": "If someone can write twelve kinds of scriptures, and after writing them, they'll make various offerings, such as making offerings to the Buddha, except for bathing.",
        "source": "T24n1488_003:1052b03_27"
    },
    {
        "source_sentence": "若有供養、受持、讀誦如是經者，是則名為供養法也。",
        "translation": "If someone makes offerings, receives, retains, and recites such a sūtra, this is called the method of making offerings.",
        "source": "T24n1488_003:1052b05_28"
    },
    {
        "source_sentence": "供養法時，如供養佛。",
        "translation": "When they make offerings to the Dharma, they're like making offerings to the Buddha.",
        "source": "T24n1488_003:1052b06_29"
    },
    {
        "source_sentence": "又復有法，謂菩薩一根，辟支佛人三根、三諦，若信是者，名供養法。",
        "translation": "(2) Again there is another doctrine that explains the bodhisattva’s one faculty: a pratyekabuddha believes in the three faculties and three truths of buddhahood. If he believes these [teachings],",
        "source": "T24n1488_003:1052b06_30"
    },
    {
        "source_sentence": "若有供養發菩提心受持戒者出家之人，向須陀洹至阿羅漢果，名供養僧。",
        "translation": "If someone makes offerings to a renunciant who arouses the mind of enlightenment and observes the precepts, they'll be called an offering to the saṃgha if they go to stream entry or attain the fruit of the arhat.",
        "source": "T24n1488_003:1052b08_31"
    },
    {
        "source_sentence": "若有人能如是供養佛、法、僧寶，當知是人終不遠離十方如來，常與諸佛行住坐臥。",
        "translation": "If someone can thus make offerings to the treasures of the Buddha, Dharma, and Saṃgha, you should know that person will never be far from the Tathāgatas of the ten directions, always walking, standing, sitting, or lying with the buddh",
        "source": "T24n1488_003:1052b09_32"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1052b11_33"
    },
    {
        "source_sentence": "若有人能如說多少供養如是三福田者，當知是人於無量世多受利益。",
        "translation": "If someone can thus explain how much to make offerings to these three fields of merit, you should know that person will often receive benefits in measureless worlds.",
        "source": "T24n1488_003:1052b12_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T24n1488_003:1052b13_1"
    },
    {
        "source_sentence": "菩薩二種：一者、在家，二者、出家。",
        "translation": "There are two kinds of bodhisattvas: 1. those who remain householders and 2. those who leave home.",
        "source": "T24n1488_003:1052b13_2"
    },
    {
        "source_sentence": "出家菩薩供養三寶，是不為難；",
        "translation": "It is not difficult for renunciant enlightening beings to make offerings to the Three Treasures.",
        "source": "T24n1488_003:1052b14_3"
    },
    {
        "source_sentence": "在家供養，是乃為難。",
        "translation": "It's difficult to make offerings at home.",
        "source": "T24n1488_003:1052b15_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1488_003:1052b15_5"
    },
    {
        "source_sentence": "在家之人多惡因緣所纏繞故。」",
        "translation": "It's because laypeople are often tethered by bad causes and conditions.",
        "source": "T24n1488_003:1052b15_6"
    },
    {
        "source_sentence": "優婆塞戒經卷第三",
        "translation": "Upāsaka Precepts Sutra, Volume 3",
        "source": "T24n1488_003:1052b17_0"
    }
]