[
    {
        "source_sentence": "根本說一切有部毘奈耶破僧事",
        "translation": "Mūlasarvâstivāda's Vinaya that breaks the saṃgha",
        "source": "T24n1450_014:0169c04_0"
    },
    {
        "source_sentence": "卷第十四",
        "translation": "Vol. 14",
        "source": "T24n1450_014:0169c05_0"
    },
    {
        "source_sentence": "大唐三藏法師義淨奉　詔譯",
        "translation": "Great Tang Dynasty Translation by imperial edict of the Tripiṭaka Master Yijingfeng",
        "source": "T24n1450_014:0169c07_0"
    },
    {
        "source_sentence": "爾時提婆達多，遂出懊聲點頭三迴，便起而去。",
        "translation": "At the time, Devadatta then produced a remorseful nod of his head three times and rose up and departed.",
        "source": "T24n1450_014:0169c08_0"
    },
    {
        "source_sentence": "是時阿難陀，在佛左右搖扇而立。",
        "translation": "Ānanda then stood to the Buddha's left and right, shaking his fan.",
        "source": "T24n1450_014:0169c09_1"
    },
    {
        "source_sentence": "爾時世尊告阿難陀曰：「汝今可於此竹林園內喚諸苾芻集此食堂。」",
        "translation": "It was then that the Bhagavān addressed Ānanda, Now, you may call the monks here in this bamboo grove and gather them into this dining hall.",
        "source": "T24n1450_014:0169c09_2"
    },
    {
        "source_sentence": "是時阿難陀奉命，巡喚總集食堂。",
        "translation": "Ānanda then complied with the order and called out to the general assembly at the dining hall.",
        "source": "T24n1450_014:0169c11_3"
    },
    {
        "source_sentence": "是時阿難陀往詣佛所，頂禮雙足而白佛言：「眾今已集。」",
        "translation": "Ānanda then went to the Buddha, bowed his head at his feet, and said to him, The congregation has now assembled.",
        "source": "T24n1450_014:0169c12_4"
    },
    {
        "source_sentence": "爾時世尊即往食堂敷座而坐，告諸苾芻：「此世間中有五種教師。",
        "translation": "It was then that the Bhagavān went to the dining hall, spread out his seat, and said to the monks, There are five kinds of teachers in this world.",
        "source": "T24n1450_014:0169c13_5"
    },
    {
        "source_sentence": "何者為五？",
        "translation": "What are these five?",
        "source": "T24n1450_014:0169c14_6"
    },
    {
        "source_sentence": "第一、有教師自不具戒稱已具戒，彼有弟子久共一處，即知我師不能具戒。",
        "translation": "First, if there's a teacher who doesn't have the precepts for himself and calls them complete, and his disciples have been together in one place for a long time, then he knows that my teacher can't have the precepts.",
        "source": "T24n1450_014:0169c15_7"
    },
    {
        "source_sentence": "共相謂曰：『我若告向餘人，外既聞已，我之教師即被輕賤，我等於後，云何見師共住承事？",
        "translation": "They all said to each other, 'If I tell them to the others, then after they hear it outside, my teacher will be despised. How can we later see him living together and serving?'",
        "source": "T24n1450_014:0169c16_8"
    },
    {
        "source_sentence": "教師自知好惡，我等應可覆護，勿向人說。",
        "translation": "If the teacher knows for himself whether it's good or bad, we should cover and protect him so that he doesn't tell anyone.",
        "source": "T24n1450_014:0169c18_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1450_014:0169c19_10"
    },
    {
        "source_sentence": "我此教師，時時供我衣服飲食湯藥臥具。』",
        "translation": "From time to time, this teacher of mine will provide me with clothing, food, drink, medicine, and bedding.'",
        "source": "T24n1450_014:0169c19_11"
    },
    {
        "source_sentence": "是時弟子貪此供給，覆護教師，不向人說令知破戒。",
        "translation": "The disciple then craved this offering, covered his teacher, and didn't tell anyone to know that he had broken the precepts.",
        "source": "T24n1450_014:0169c20_12"
    },
    {
        "source_sentence": "時彼教師應須弟子覆護於我。",
        "translation": "That teacher then asked the disciple to cover and protect me.",
        "source": "T24n1450_014:0169c22_0"
    },
    {
        "source_sentence": "如上所說，此世間中第一教師。",
        "translation": "As explained above, he's the first teacher in this world.",
        "source": "T24n1450_014:0169c22_1"
    },
    {
        "source_sentence": "復次第二教師，世間有一教師，用不淨之物以將充命，自將清淨之活，亦非罪失。",
        "translation": "Furthermore, the second teacher, there's a teacher in the world who uses impure things to nourish his life and takes up pure livelihood for himself, which isn't a mistake.",
        "source": "T24n1450_014:0169c23_2"
    },
    {
        "source_sentence": "彼有弟子久居一處，後乃得知我之教師，用不淨物以將充活，自將清淨亦當有罪。",
        "translation": "That disciple has lived in one place for a long time and then learned that my teacher uses impure things to support himself, and it would be a sin if he makes them pure on his own.",
        "source": "T24n1450_014:0169c25_3"
    },
    {
        "source_sentence": "『我弟子等，若說教師此事，外將輕賤。",
        "translation": "'If we disciples and so forth talk about this matter of teachers, we'll be despised by the outside world.",
        "source": "T24n1450_014:0169c27_4"
    },
    {
        "source_sentence": "此等之緣，我諸弟子若為可活，此教師作諸種不淨罪可自知，然不關我諸弟子事。』",
        "translation": "If these are the conditions for my disciples to be able to live, this teacher commits various kinds of impure crimes that can be known for himself, but they aren't related to the affairs of my disciples.'",
        "source": "T24n1450_014:0169c27_5"
    },
    {
        "source_sentence": "又此教師常念：『我等時時供給衣服飲食湯藥臥具。』",
        "translation": "Furthermore, this teacher always thinks, 'We provide clothing, food, drink, hot water, medicine, and bedding at the right time.'",
        "source": "T24n1450_014:0169c29_6"
    },
    {
        "source_sentence": "時諸弟子貪著供給覆護教師，教師常思念：『此弟子便覆於我。』",
        "translation": "The disciples then became greedy with offerings to cover the teacher, and the teacher always thought, 'This disciple will cover me.'",
        "source": "T24n1450_014:0170a01_7"
    },
    {
        "source_sentence": "此是世間中第二教師。",
        "translation": "This is the second teacher in the world.",
        "source": "T24n1450_014:0170a03_8"
    },
    {
        "source_sentence": "復次第三教師者，又世間中有如是教師：智見不淨，教師自將智淨無過。",
        "translation": "Furthermore, the third teacher: Again, there's a teacher in the world who says, Wisdom and views are impure, and the teacher himself maintains that wisdom is pure without error.",
        "source": "T24n1450_014:0170a03_9"
    },
    {
        "source_sentence": "彼有弟子久居一處，乃見教師智見不淨。",
        "translation": "There was a disciple there who had lived in one place for a long time and saw the teacher's wisdom as impure.",
        "source": "T24n1450_014:0170a05_10"
    },
    {
        "source_sentence": "『教師自將智淨無過，我等今向外人說陳，教師外將輕賤無禮。",
        "translation": "'The teacher himself regards wisdom as pure and faultless, so now we'll explain it to people outsiders, but the teacher will despise those outsiders without propriety.",
        "source": "T24n1450_014:0170a06_11"
    },
    {
        "source_sentence": "我等得如是教師，若為堪活，此教師作智見不淨罪可自知，然不關我諸弟子事。』",
        "translation": "If we attain such a teacher and make it possible for us to live, this teacher commits the sin of knowing and seeing what's impure that we can know for ourselves, but he doesn't care about the affairs of our disciples.'",
        "source": "T24n1450_014:0170a07_12"
    },
    {
        "source_sentence": "又此教師常念：『我等時時供給飲食衣服湯藥臥具。』",
        "translation": "Furthermore, this teacher always thinks, 'We offer food, drink, clothing, bathing, medicine, and bedding at the right time.'",
        "source": "T24n1450_014:0170a09_13"
    },
    {
        "source_sentence": "時諸弟子貪著供給覆護教師，教師常思念：『此弟子可令覆護於我。』",
        "translation": "The disciples then became greedy and offered protection to the teacher, who always thought, 'This disciple can be made to cover me.'",
        "source": "T24n1450_014:0170a10_14"
    },
    {
        "source_sentence": "此世間中第三教師。",
        "translation": "This is the third teacher in the world.",
        "source": "T24n1450_014:0170a12_15"
    },
    {
        "source_sentence": "復次第四教師者，又世間中有如是教師：妄與人授種種記，自將不妄，我與授記皆悉真實。",
        "translation": "Furthermore, the fourth teacher: Again, there's a teacher in the world who falsely gives various assurances to people and makes sure they aren't false, and I give them all true assurances.",
        "source": "T24n1450_014:0170a12_16"
    },
    {
        "source_sentence": "彼有弟子久居一處，見師妄與諸人種種授記，自將不妄：『我與授記悉皆真實。』",
        "translation": "That disciple had lived in one place for a long time and saw that the teacher falsely gave various instructions to people, but he himself didn't say falsely, 'My instructions and my instructions are all true.'",
        "source": "T24n1450_014:0170a14_17"
    },
    {
        "source_sentence": "弟子等云：『我向外人陳說，教師必將輕賤無禮，我等得如是教師，若為同活，此教師妄與授記之罪，師可自知，然不關我弟子之事。』",
        "translation": "The disciples said, 'I told the outsiders, 'The teacher will surely despise us and dishonor us. If we were to live together as teachers like this, this teacher would falsely give us a prediction about the offense of giving instruction; the teacher can know for himself, but it doesn't concern the affairs of our disciples.'",
        "source": "T24n1450_014:0170a16_18"
    },
    {
        "source_sentence": "此教師念：『我等悉令覆護。』",
        "translation": "This teacher thought, 'We'll make them all be covered and protected.'",
        "source": "T24n1450_014:0170a19_19"
    },
    {
        "source_sentence": "此教師時時常念：『我等弟子供給衣服飲食湯藥臥具。』",
        "translation": "At the time, this teacher always thought, 'We disciples offer clothing, food, drink, hot water, medicine, and bedding.'",
        "source": "T24n1450_014:0170a20_20"
    },
    {
        "source_sentence": "時弟子等貪著供給覆護教師，教師自念：『我妄與授記，弟子可令覆護，於我常憶此念。』",
        "translation": "The disciples then became greedy and offered protection to the teacher, who thought to himself, 'I've given you a false prediction that the disciple will be able to cover it up and always remember this thought for me.'",
        "source": "T24n1450_014:0170a21_21"
    },
    {
        "source_sentence": "此世間中第四教師。",
        "translation": "This is the fourth teacher in the world.",
        "source": "T24n1450_014:0170a23_22"
    },
    {
        "source_sentence": "復次第五教師者，又世間中有如是教師：常虛妄說法，自將是實。",
        "translation": "Furthermore, the fifth teacher: Again, there's a teacher in the world who always falsely explains the teaching that it's true on its own.",
        "source": "T24n1450_014:0170a23_23"
    },
    {
        "source_sentence": "彼有弟子久居一處，見師常虛妄說法，自將為實。",
        "translation": "That disciple had lived in one place for a long time and saw that his teacher always taught falsely, claiming to be the truth.",
        "source": "T24n1450_014:0170a25_24"
    },
    {
        "source_sentence": "『我等弟子向外人說，必將輕賤不禮，我等得如是教師，若為同活，此教師妄與說法之罪，師自得知，然不關我弟子之事。』",
        "translation": "'Our disciples say to outsiders that they'll surely despise and disrespect them, and if we attain such a teacher for the sake of living together, this teacher will falsely accuse us of preaching the Dharma; the teacher himself knows it, but he doesn't care about the affairs of our disciples.'",
        "source": "T24n1450_014:0170a26_25"
    },
    {
        "source_sentence": "教師常念：『我等弟子供給衣服飲食湯藥臥具。』",
        "translation": "The teacher always thought, 'We disciples offer clothing, food, drink, medicine, and bedding.'",
        "source": "T24n1450_014:0170a29_26"
    },
    {
        "source_sentence": "其弟子等貪著供給覆護教師，教師亦常念：『我雖虛妄說法，弟子可令覆護於我。』",
        "translation": "Those disciples and others were addicted to offering protection to the teacher, and the teacher always thought, 'Even though I teach falsely, the disciple can protect me.'",
        "source": "T24n1450_014:0170b01_27"
    },
    {
        "source_sentence": "此世間中第五教師。」",
        "translation": "This is the fifth teacher in the world.",
        "source": "T24n1450_014:0170b03_28"
    },
    {
        "source_sentence": "佛告諸苾芻：「我受持戒清淨，我自將實戒清淨，自知亦無穢故，亦教諸弟子清淨戒奉行故，不用弟子為戒常覆護，我無憂此怖，我用清淨之物以將充活，我將是實淨之物故，不用諸弟子常覆護，我無憂此怖。",
        "translation": "The Buddha told the monks, I accept the purity of observing precepts because I myself maintain the purity of the true precepts, know for myself that they are also without defilement, and teach my disciples to observe pure precepts; I don't need my disciples to always cover and protect them as precepts, and I don't worry about this fear.",
        "source": "T24n1450_014:0170b04_0"
    },
    {
        "source_sentence": "諸苾芻！",
        "translation": "Monks!",
        "source": "T24n1450_014:0170b08_1"
    },
    {
        "source_sentence": "我智見實相亦將是實，我無憂此怖，不應令弟子為智見故覆護我。」",
        "translation": "Seeing the true characteristics of self with wisdom is also going to be real, and I have no sorrow or fear, so I shouldn't cause my disciples to cover me up for the sake of seeing them with wisdom.",
        "source": "T24n1450_014:0170b08_2"
    },
    {
        "source_sentence": "佛告諸苾芻：「我所授記一將是實，我念實故無憂此怖，不應令諸弟子為授記故令覆護我。」",
        "translation": "The Buddha told the monks, One of my predictions will be true, and because I'm mindful of what's true, I don't worry about this fear; I shouldn't allow my disciples to cover me up for the sake of prediction.",
        "source": "T24n1450_014:0170b10_3"
    },
    {
        "source_sentence": "佛告諸苾芻：「我說法如實，亦將是如實故，無憂此怖，不應令弟子為法故令覆護我。」",
        "translation": "The Buddha told the monks, I teach the Dharma as it really is, and it's because of this as it really is that I don't worry about this fear; I shouldn't allow my disciples to cover me for the sake of the Dharma.",
        "source": "T24n1450_014:0170b12_4"
    },
    {
        "source_sentence": "佛告諸苾芻：「當知世間五種妄教師，自有過失故令弟子覆護。",
        "translation": "The Buddha told the monks, You should know that there are five kinds of false teachers in the world who cause their disciples to cover and protect themselves because they have faults.",
        "source": "T24n1450_014:0170b14_5"
    },
    {
        "source_sentence": "我不應如是，不應憂怖，亦不應於汝弟子等勢力可住，常責汝等苾芻。",
        "translation": "I shouldn't do so, and I shouldn't be sad or frightened, and I shouldn't allow you disciples to stay with their power. I'll always rebuke you monks.",
        "source": "T24n1450_014:0170b15_6"
    },
    {
        "source_sentence": "若有苾芻受我嗔責，可令近住我法。",
        "translation": "If a monk receives an angry rebuke from me, he can cause them to become intimate with my teaching.",
        "source": "T24n1450_014:0170b17_7"
    },
    {
        "source_sentence": "若不能受我嗔責者，自令退散。",
        "translation": "If someone can't be rebuked by self and anger, they will cause themselves to retreat.",
        "source": "T24n1450_014:0170b18_8"
    },
    {
        "source_sentence": "譬如瓦師未燋之器以將入火，好者自現真牢，惡者自然破裂。",
        "translation": "It's like a tile master who doesn't eat a container that's about to go into the fire, and the good one shows himself as a true prison, while the bad one naturally breaks it open.",
        "source": "T24n1450_014:0170b19_0"
    },
    {
        "source_sentence": "瓦師不起惜心，亦不怖畏，善惡自現，應以可住。",
        "translation": "The tile-worker did not give up his cherished intention, nor was he frightened. Good and evil manifested on their own, so they should be able to live.",
        "source": "T24n1450_014:0170b20_1"
    },
    {
        "source_sentence": "我亦如是，受學我法，常嗔責汝。",
        "translation": "So it is with me, who receives my teaching and always angrily rebukes you.",
        "source": "T24n1450_014:0170b21_2"
    },
    {
        "source_sentence": "好者可自習真，惡者任自退散。",
        "translation": "Good people can cultivate the truth for themselves, and bad people can retreat on their own.",
        "source": "T24n1450_014:0170b22_3"
    },
    {
        "source_sentence": "我所說法清淨故，不應怖畏。",
        "translation": "Because the teaching I teach is pure, they shouldn't be frightened.",
        "source": "T24n1450_014:0170b23_0"
    },
    {
        "source_sentence": "汝等當知！」",
        "translation": "You should know!",
        "source": "T24n1450_014:0170b23_1"
    },
    {
        "source_sentence": "說此言已，即從坐起入自微訶羅中。",
        "translation": "After he spoke these words, he rose from his seat and entered the inner chamber of his own body.",
        "source": "T24n1450_014:0170b23_2"
    },
    {
        "source_sentence": "爾時天授苾芻語四苾芻：一名孤迦利迦、二名騫茶達驃、三名羯吒謨洛迦、四名三沒達羅達多言：「汝等可來與我同伴，彼喬答摩沙門，見今在世，我等五人同意，破大眾及破法輪。",
        "translation": "It was then that the monk Devadatta said to four monks, one named Anāthapiṇḍika, two named Kauṣṭhiladatta, three named Kāṭapālīka, and four named Sambuddhadatta, Come along with my companions, saying, That Gautama-śrāmaṇer is in the world now, and we five of us agreed, destroying the masses and the wheel",
        "source": "T24n1450_014:0170b24_3"
    },
    {
        "source_sentence": "我等滅後名稱後世，我得如是名出：『具壽提婆達多等，昔沙門喬答摩在世，多有神通威力。",
        "translation": "After our cessation, we'll be called the afterlife, and I'll get such a name: Kauṣṭhila Devadatta and so forth. In the past, when the ascetic Gautama was in the world, many of them had supernormal powers and authority.",
        "source": "T24n1450_014:0170b29_0"
    },
    {
        "source_sentence": "提婆達多等五人，得破眾僧法輪。』",
        "translation": "Devadatta and the five others were able to break the Dharma wheel of the saṃgha.'",
        "source": "T24n1450_014:0170c02_1"
    },
    {
        "source_sentence": "我名傳流四方。」",
        "translation": "My name spreads to the four directions.",
        "source": "T24n1450_014:0170c02_2"
    },
    {
        "source_sentence": "彼孤迦利迦報提婆達多曰：「我等不能破於佛世尊弟子眾和合住，及彼法輪亦不能破。",
        "translation": "The orphaned Kālīyaka replied to Devadatta, saying, We can't break through the harmonious abode of the Bhagavān's disciples and the Dharma wheel, and they can't break it either.",
        "source": "T24n1450_014:0170c03_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1450_014:0170c05_4"
    },
    {
        "source_sentence": "天授！",
        "translation": "Devadatta!",
        "source": "T24n1450_014:0170c05_5"
    },
    {
        "source_sentence": "又世尊聲聞弟子，多有神通威力，及有天眼，遠知我心，若我等平章事，他悉具知。",
        "translation": "Also, the Bhagavān, a śrāvaka disciple of the Bhagavān, many of whom have supernormal powers and authority as well as divine eyes that know my mind from afar. If we do so, they will all know it.",
        "source": "T24n1450_014:0170c05_6"
    },
    {
        "source_sentence": "為此者故，我等不能破其和合僧。」",
        "translation": "Because of this, we won't be able to break through the unity of the saṃgha.",
        "source": "T24n1450_014:0170c07_7"
    },
    {
        "source_sentence": "天授報孤迦利迦等言：「我有一好方便，我等往諸老宿苾芻邊啟請供養：『汝等所須一切之物，我等供給不令闕少。』",
        "translation": "The gods gave a reward to the solitary Kālīyaka and others, saying, 'There's a good method for us to go to the old monks and ask them to make offerings, 'All of your necessities will be provided by us so that they won't lack.'",
        "source": "T24n1450_014:0170c08_8"
    },
    {
        "source_sentence": "更往於年少苾芻邊供給，無鉢者施鉢、無衣服者與衣服，所須者我即具給，及求法者賜法，及求教者我教之，令悉成就。」",
        "translation": "Suppose you go to the side of a young monk who doesn't have a bowl, gives him a bowl if he doesn't have a bowl, give him clothing if he doesn't have clothes, and I give whatever he needs, give it to those who seek the Dharma, teach them to those who seek the Dharma, and teach them to those who seek the teaching so that they'll accomplish it.",
        "source": "T24n1450_014:0170c10_9"
    },
    {
        "source_sentence": "孤迦利迦等報天授曰：「此之方便亦得成事。」",
        "translation": "The solitary Kālīyaka and others replied to the gods, This method can also accomplish things.",
        "source": "T24n1450_014:0170c13_10"
    },
    {
        "source_sentence": "爾時提婆達多，為破和合僧眾故，即往詣諸老宿苾芻說陳事意。",
        "translation": "It was then that Devadatta, out of desire to disrupt the unity of the saṃgha, went to the old monks and explained their business.",
        "source": "T24n1450_014:0170c14_11"
    },
    {
        "source_sentence": "老宿等苾芻，即知提婆達多欲破和合僧伽作如是方便。",
        "translation": "That's when the old monks and others knew that Devadatta wanted to break up the combined saṃgha and do this kind of skillful means.",
        "source": "T24n1450_014:0170c16_0"
    },
    {
        "source_sentence": "老宿等知已遞相告曰：「提婆達多欲作方便故破僧伽事。」",
        "translation": "Knowing this, the old men and women told each other, Devadatta wants to do something to break up the saṃgha because of his skillful means.",
        "source": "T24n1450_014:0170c17_1"
    },
    {
        "source_sentence": "見此因故，諸苾芻往詣佛所，說提婆達多欲破和合僧及以法輪，以此因緣具白世尊：「天授有意欲破僧輪。」",
        "translation": "Seeing this cause, the monks went to the Buddha and told Devadatta that Devadatta wanted to break the harmonious saṃgha and use the wheel of the Dharma, and for this reason they all told the Bhagavān, Tendai intends to break the wheel of the saṃgha.",
        "source": "T24n1450_014:0170c18_2"
    },
    {
        "source_sentence": "爾時世尊告諸苾芻等曰：「汝等宜應別諫天授，若更有作如是流類。",
        "translation": "It was then that the Bhagavān addressed the monks and others, You should admonish the gods separately, saying, 'Should there be another such-and-such type of practice?'",
        "source": "T24n1450_014:0170c21_0"
    },
    {
        "source_sentence": "應可諫曰：『天授！",
        "translation": "You should be remonstrated, saying, 'Devadatta!",
        "source": "T24n1450_014:0170c22_1"
    },
    {
        "source_sentence": "汝莫破和合僧伽作鬪諍事執受而住。",
        "translation": "Don't break the harmony of the saṃgha, create disputes, and cling to and abide.",
        "source": "T24n1450_014:0170c22_2"
    },
    {
        "source_sentence": "天授！",
        "translation": "Devadatta!",
        "source": "T24n1450_014:0170c23_3"
    },
    {
        "source_sentence": "應與和合僧伽歡喜無諍，同心一說如水乳合，大師教法令得光顯安樂而住。",
        "translation": "They should be united with the combined saṃgha, rejoicing without anger, speaking with one mind and one voice like water and milk coming together, and the great teacher teaches them to attain light and show well-being and abide.",
        "source": "T24n1450_014:0170c23_4"
    },
    {
        "source_sentence": "天授！",
        "translation": "Devadatta!",
        "source": "T24n1450_014:0170c25_5"
    },
    {
        "source_sentence": "汝等今應捨作破僧伽事。』」",
        "translation": "Now, you should abandon the task of destroying the saṃgha.'",
        "source": "T24n1450_014:0170c25_6"
    },
    {
        "source_sentence": "時諸苾芻奉佛教已，尋即別諫提婆達多告言：「天授！",
        "translation": "After they had received the Buddha's teaching, the monks immediately remonstrated with Devadatta and told him, Tendai!",
        "source": "T24n1450_014:0170c26_7"
    },
    {
        "source_sentence": "汝莫破和合僧伽作鬪諍事非法而住。",
        "translation": "Don't break the harmony of the saṃgha and create disputes that are unlawful and stay there.",
        "source": "T24n1450_014:0170c27_8"
    },
    {
        "source_sentence": "天授！",
        "translation": "Devadatta!",
        "source": "T24n1450_014:0170c28_9"
    },
    {
        "source_sentence": "應與和合僧伽歡喜無諍，同心一說如水乳合，大師教法令得光顯安樂而住。",
        "translation": "They should be united with the combined saṃgha, rejoicing without anger, speaking with one mind and one voice like water and milk coming together, and the great teacher teaches them to attain light and show well-being and abide.",
        "source": "T24n1450_014:0170c28_10"
    },
    {
        "source_sentence": "天授！",
        "translation": "Devadatta!",
        "source": "T24n1450_014:0171a01_11"
    },
    {
        "source_sentence": "汝今應捨作破僧伽事。」",
        "translation": "Now, you should abandon the task of destroying the saṃgha.",
        "source": "T24n1450_014:0171a01_12"
    },
    {
        "source_sentence": "時諸苾芻別諫之時，提婆達多堅執其事，無心棄捨，云：「此事真實，餘皆虛妄。」",
        "translation": "When the monks separately remonstrated with him, Devadatta held firmly to that thing and didn't mindfully abandon it, saying, This is true; the rest are false.",
        "source": "T24n1450_014:0171a01_13"
    },
    {
        "source_sentence": "時諸苾芻具以此緣而白世尊：「大德！",
        "translation": "The monks then told the Bhagavān for this reason, Mañjuśrī!",
        "source": "T24n1450_014:0171a03_14"
    },
    {
        "source_sentence": "我已別諫提婆達多，我等為作別諫之時，提婆達多堅執不捨，而此事真實餘皆虛妄。」",
        "translation": "I've separately remonstrated with Devadatta, and when we made a separate remonstrance, Devadatta held it firmly and didn't abandon it, but this matter was real and the rest were false.",
        "source": "T24n1450_014:0171a04_15"
    },
    {
        "source_sentence": "爾時佛告諸苾芻：「汝等應與提婆達多作白四羯磨對眾諫之，若更有餘如是流類，應如是諫。",
        "translation": "It was then that the Buddha addressed the monks, You and Devadatta should make a statement of four karmas to remonstrate with the crowd, and if there are any other such-and-such kinds of people, they should be remonstrated like this.",
        "source": "T24n1450_014:0171a06_16"
    },
    {
        "source_sentence": "當敷座具次鳴健椎應先白言，復總集僧伽。",
        "translation": "You should prepare a seat, make an announcement in order, and then assemble the saṃgha.",
        "source": "T24n1450_014:0171a08_17"
    },
    {
        "source_sentence": "集已令一苾芻作白羯磨，應如是作：『大德僧伽聽！",
        "translation": "After the assembly has been assembled, one monk should make a statement of karma, saying, 'Listen, Mañjuśrī!'",
        "source": "T24n1450_014:0171a09_18"
    },
    {
        "source_sentence": "此提婆達多，欲破和合僧伽作鬪諍事非法而住。",
        "translation": "This Devadatta wants to break the harmonious saṃgha and create disputes that are unlawful and stay here.",
        "source": "T24n1450_014:0171a10_19"
    },
    {
        "source_sentence": "時諸苾芻已作別諫，別諫之時堅執其事，不肯棄捨，云：「此真實餘皆虛妄。」",
        "translation": "The monks then had made a specific remonstrance, and when they were remonstrating with it, they held firmly to the matter and refused to abandon it, saying, This is true; the rest are false.",
        "source": "T24n1450_014:0171a11_20"
    },
    {
        "source_sentence": "若僧伽時至聽者，僧伽應許僧伽今與提婆達多作白四羯磨曉諫其事：「汝提婆達多莫欲破和合僧伽，作鬪諍事執受而住。",
        "translation": "If the saṃgha arrives at the time of the saṃgha and listens, the saṃgha should allow the saṃgha to give Devadatta a four-fold karman to admonish him for his actions, saying, Don't you, Devadatta, want to break the harmony of the saṃgha and stay here with Devadatta, holding on to something that's a fight.",
        "source": "T24n1450_014:0171a13_21"
    },
    {
        "source_sentence": "提婆達多應與和合僧伽歡喜無諍，同心一說如水乳合，大師教法令得光顯安樂而住。",
        "translation": "Devadatta should rejoice with the combined saṃgha and be joyful without anger, speak with one mind like water and milk together, and the great teacher teaches them to attain illumination, show comfort, and abide.",
        "source": "T24n1450_014:0171a16_22"
    },
    {
        "source_sentence": "汝提婆達多應捨破僧伽事。」",
        "translation": "You Devadatta should abandon the task of destroying the saṃgha.",
        "source": "T24n1450_014:0171a18_23"
    },
    {
        "source_sentence": "白如是。』",
        "translation": "He said, 'So it is.'",
        "source": "T24n1450_014:0171a18_24"
    },
    {
        "source_sentence": "次作羯磨：『大德僧伽聽！",
        "translation": "Next, he performs the ritual, 'Listen, great virtuous monks!'",
        "source": "T24n1450_014:0171a19_25"
    },
    {
        "source_sentence": "此提婆達多欲破和合僧伽作鬪諍事執受而住。",
        "translation": "This Devadatta wants to break the unity of the saṃgha, create disputes, and cling to and abide.",
        "source": "T24n1450_014:0171a19_26"
    },
    {
        "source_sentence": "諸苾芻已作別諫，別諫之時堅執其事，不肯棄捨，云：「此事真實，餘皆虛妄。」",
        "translation": "The monks had already made a specific remonstrance, but when they were remonstrating with it, they held firmly to the matter and refused to abandon it, saying, This is true; the rest are false.",
        "source": "T24n1450_014:0171a20_27"
    },
    {
        "source_sentence": "僧伽今與提婆達多作白四羯磨曉諫其事：「汝提婆達多莫欲破和合僧伽作鬪諍事執受而住。",
        "translation": "Now, the saṃgha and Devadatta have made a statement to the four karmas about remonstrating with each other, saying, You Devadatta, don't want to break up the reconciled saṃgha or engage in disputes that will cause you to accept and stay.",
        "source": "T24n1450_014:0171a22_28"
    },
    {
        "source_sentence": "提婆達多應與和合僧伽歡喜無諍，同心一說如水乳合，大師教法令得光顯安樂而住。",
        "translation": "Devadatta should rejoice with the combined saṃgha and be joyful without anger, speak with one mind like water and milk together, and the great teacher teaches them to attain illumination, show comfort, and abide.",
        "source": "T24n1450_014:0171a24_29"
    },
    {
        "source_sentence": "汝提婆達多應捨破僧伽事。」",
        "translation": "You Devadatta should abandon the task of destroying the saṃgha.",
        "source": "T24n1450_014:0171a26_30"
    },
    {
        "source_sentence": "若諸具壽忍許與提婆達多作白四羯磨曉諫其事：「汝提婆達多莫欲破和合僧伽作鬪諍事執受而住。",
        "translation": "If the long-lived tolerance allows him to make a confession with Devadatta, he'll explain the four karmas and admonish him for his actions, saying, You Devadatta, don't want to break the harmony of the saṃgha or engage in fights, take it up, and stay there.",
        "source": "T24n1450_014:0171a27_31"
    },
    {
        "source_sentence": "汝提婆達多應與和合僧伽歡喜無諍，同心一說如水乳合，大師教法令得光顯安樂而住。",
        "translation": "You Devadatta should rejoice with the combined saṃgha and be joyful without anger, speak with one mind like water and milk coming together, and the great teacher teaches you to attain radiance, show comfort, and abide.",
        "source": "T24n1450_014:0171a29_32"
    },
    {
        "source_sentence": "汝提婆達多應捨如是破僧伽事。」",
        "translation": "You, Devadatta, should abandon such a thing that breaks the saṃgha.",
        "source": "T24n1450_014:0171b02_33"
    },
    {
        "source_sentence": "者默然；",
        "translation": "The monk remained silent.",
        "source": "T24n1450_014:0171b03_34"
    },
    {
        "source_sentence": "若不許者說。",
        "translation": "If someone doesn't approve, they say.",
        "source": "T24n1450_014:0171b03_35"
    },
    {
        "source_sentence": "此是初羯磨。』",
        "translation": "This is the first karma.'",
        "source": "T24n1450_014:0171b03_36"
    },
    {
        "source_sentence": "第二、第三亦如是說。",
        "translation": "The second and third are likewise explained.",
        "source": "T24n1450_014:0171b04_37"
    },
    {
        "source_sentence": "『僧伽今已作白四羯磨諫提婆達多竟，僧伽已聽許，由其默然故，我今如是持。』」",
        "translation": "'Now that the saṃgha has made a confession to the four karmas and remonstrated with Devadatta, the saṃgha has heard it approved, and because he's been silent, I now hold it this way.'",
        "source": "T24n1450_014:0171b04_38"
    },
    {
        "source_sentence": "時諸苾芻既奉佛教已，即以白四羯磨諫彼提婆達多。",
        "translation": "After they had received the Buddha's teaching, the monks then told the four karmas and remonstrated with Devadatta.",
        "source": "T24n1450_014:0171b06_39"
    },
    {
        "source_sentence": "時提婆達多堅執不捨，云：「此真實，餘皆虛妄。」",
        "translation": "Devadatta then held it firmly and didn't abandon it, saying, This is true; the rest are false.",
        "source": "T24n1450_014:0171b07_40"
    },
    {
        "source_sentence": "時提婆達多有助伴四人，共相隨順說破僧伽事，告諸苾芻曰：「大德！",
        "translation": "Devadatta had four companions, and they all complied with each other in explaining the disruption of the saṃgha, telling the monks, Mañjuśrī!",
        "source": "T24n1450_014:0171b08_41"
    },
    {
        "source_sentence": "莫共彼苾芻所有言說若善若惡。",
        "translation": "Don't share what that monk says, whether it's good or bad.",
        "source": "T24n1450_014:0171b10_42"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1450_014:0171b10_43"
    },
    {
        "source_sentence": "然彼苾芻是法語者、是律語者，依於法律方為言說，知而說、非不知說。",
        "translation": "That monk, however, is someone who speaks the Dharma or a person who speaks the vinaya, and he speaks for them in words based on the Dharma, knowing it and not without knowing it.",
        "source": "T24n1450_014:0171b11_44"
    },
    {
        "source_sentence": "彼愛樂者，我亦愛樂。」",
        "translation": "Those who delight in them, I also delight in them.",
        "source": "T24n1450_014:0171b12_45"
    },
    {
        "source_sentence": "時諸苾芻以此因緣具白世尊，廣說如上，乃至我亦愛樂。",
        "translation": "The monks then explained this cause and condition to the Bhagavān, explaining it in detail as above, even up to the point where they said, 'I'm also delighted.'",
        "source": "T24n1450_014:0171b13_46"
    },
    {
        "source_sentence": "世尊告曰：「汝等苾芻！",
        "translation": "The Bhagavān told them, You monks!",
        "source": "T24n1450_014:0171b14_47"
    },
    {
        "source_sentence": "當與助伴四人作別諫法，若更有餘如是流類，亦應呵諫，應如是作：『汝孤迦里迦、褰荼達驃、羯吒謨洛迦、底灑三沒達羅達多。",
        "translation": "If there are other such kinds of followers, they should also be reprimanded and admonished, saying, 'You're alone with Kālīyaka, Candradatta, Kāṭṭakūṭa-kṣāraka, and Tiṣya-saṃdarśana.",
        "source": "T24n1450_014:0171b14_48"
    },
    {
        "source_sentence": "知彼苾芻欲破和合僧伽作鬪諍事執受而住，汝等共為助伴，莫相隨順說破僧伽事，莫向諸苾芻作如是語：「諸大德！",
        "translation": "Knowing that monk's intention to break the harmonious saṃgha is to engage in fighting and taking it, you must all become assistants, not following each other and telling him about breaking the saṃgha, or saying this to the monks, Dear friends!",
        "source": "T24n1450_014:0171b17_49"
    },
    {
        "source_sentence": "莫共彼苾芻所有言說若好若惡。",
        "translation": "Don't share what that monk says, whether good or bad.",
        "source": "T24n1450_014:0171b20_50"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1450_014:0171b21_51"
    },
    {
        "source_sentence": "而彼苾芻是法語者、是律語者，依於法律方為言說若好若惡。",
        "translation": "Those monks who speak the Dharma and those who speak the vinaya rely on the Dharma to explain what's good or bad, whether it's good or bad.",
        "source": "T24n1450_014:0171b21_52"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1450_014:0171b22_53"
    },
    {
        "source_sentence": "而彼苾芻是法語者、是律語者，依於法律方為言說，知而說、非不知說，彼愛樂者我亦愛樂。」",
        "translation": "That monk who speaks the Dharma and speaks the precepts relies on the Dharma to speak, knowing it and speaking it rather than not knowing it, and those who delight in them also delight in me.",
        "source": "T24n1450_014:0171b22_54"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1450_014:0171b24_55"
    },
    {
        "source_sentence": "具壽！",
        "translation": "Guoshou!",
        "source": "T24n1450_014:0171b25_56"
    },
    {
        "source_sentence": "而彼苾芻，非法律語，不依法律而作言說，不知而說，非是知說，堅執而住。",
        "translation": "That monk doesn't speak the Dharma, doesn't speak words based on the Dharma, speaks without knowing it, doesn't know it, doesn't speak with knowledge, and abides steadfastly clings to it.",
        "source": "T24n1450_014:0171b25_57"
    },
    {
        "source_sentence": "汝莫愛樂破和合僧伽，當樂和合僧伽，應與僧伽和合歡喜無諍，同心一說如水乳合，大師教法令得光顯安樂而住。",
        "translation": "Don't delight in refuting the reconciled saṃgha, and you should delight in reconciling the saṃgha; you should harmonize with the saṃgha, rejoice without anger, share the same mind and one teaching as water and milk combine, and abide by the great teacher's instructions to attain radiance and show well-being.",
        "source": "T24n1450_014:0171b26_58"
    },
    {
        "source_sentence": "具壽！",
        "translation": "Guoshou!",
        "source": "T24n1450_014:0171b29_59"
    },
    {
        "source_sentence": "汝今可捨隨順破僧伽不和合事。』」",
        "translation": "Now, you can abandon the matter of following and violating the inconsistent saṃgha.'",
        "source": "T24n1450_014:0171b29_60"
    },
    {
        "source_sentence": "時諸苾芻奉教而作，即以別諫諫彼四人作如是說：「汝孤迦里迦等四人，知彼苾芻欲破和合僧伽作鬪諍事堅執而住，莫共為伴順邪違正。",
        "translation": "The monks then followed their instructions and remonstrated with the four men, saying, You are alone, Kālīyaka, and so forth, knowing that monk's desire to break the harmony of the saṃgha and engage in a dispute is firmly held by him, so don't be his companions who follow what's wrong and disobey what's right.",
        "source": "T24n1450_014:0171c01_61"
    },
    {
        "source_sentence": "諸具壽！",
        "translation": "Guoshou!",
        "source": "T24n1450_014:0171c04_62"
    },
    {
        "source_sentence": "汝等勿於諸苾芻作如是語：『諸大德！",
        "translation": "Don't say this to the monks, 'O great virtuous ones!",
        "source": "T24n1450_014:0171c04_63"
    },
    {
        "source_sentence": "莫共彼苾芻論好論惡。",
        "translation": "Don't discuss good and bad with that monk.",
        "source": "T24n1450_014:0171c05_64"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1450_014:0171c06_65"
    },
    {
        "source_sentence": "而彼苾芻是法律語，依於法律而作言說，知而說、非不知說，彼愛樂者我亦愛樂。』",
        "translation": "That monk speaks the words of the Dharma, speaks according to the Dharma and speaks according to the Dharma, knows what he teaches and doesn't know what he teaches, and those who delight in them are also delighted by me.'",
        "source": "T24n1450_014:0171c06_66"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1450_014:0171c08_67"
    },
    {
        "source_sentence": "具壽！",
        "translation": "Guoshou!",
        "source": "T24n1450_014:0171c08_68"
    },
    {
        "source_sentence": "然彼苾芻非法律語，不依律而作言說，不知而說，非是知說。",
        "translation": "That monk, however, doesn't speak according to the rules of the Dharma and doesn't speak in words that rely on the precepts, but speaks without knowing them, which is not a statement of knowing.",
        "source": "T24n1450_014:0171c08_69"
    },
    {
        "source_sentence": "具壽！",
        "translation": "Guoshou!",
        "source": "T24n1450_014:0171c09_70"
    },
    {
        "source_sentence": "汝莫愛樂破僧迦事，當樂和合僧伽，應共和合僧伽歡喜無諍，同心一說如水乳合，大師教法令得光顯安樂而住。",
        "translation": "Don't delight in things that break the saṃgha, and you should delight in harmonizing the saṃgha. You should harmonize the saṃgha together, rejoice without anger, share the same mind and one teaching like water and milk coming together, and live by the great teacher's instructions to attain radiance and show well-being.",
        "source": "T24n1450_014:0171c09_71"
    },
    {
        "source_sentence": "具壽！",
        "translation": "Guoshou!",
        "source": "T24n1450_014:0171c12_72"
    },
    {
        "source_sentence": "汝今應捨隨順破僧伽不和合事。」",
        "translation": "Now, you should abandon the matter of following and violating the saṃgha's disharmony.",
        "source": "T24n1450_014:0171c12_73"
    },
    {
        "source_sentence": "時諸苾芻別諫之時，彼助伴人不肯受語，堅執不捨，云：「此真實，餘皆虛妄。」",
        "translation": "When the monks separately remonstrated with him, those assistants refused to accept his words, held firmly and didn't give up, saying, This is true; the rest are false.",
        "source": "T24n1450_014:0171c13_74"
    },
    {
        "source_sentence": "時諸苾芻以此因緣具白世尊：「大德！",
        "translation": "The monks then explained these causes and conditions to the Bhagavān, Mañjuśrī!",
        "source": "T24n1450_014:0171c15_0"
    },
    {
        "source_sentence": "我已別諫孤迦里迦等，我等為作別諫之時，孤迦里迦等堅執其事，無心棄捨而云：『此事真實，餘皆虛妄。』」",
        "translation": "I've separately remonstrated with the solitary realizers and so forth, and when we make a separate remonstrance, the solitary realizers and so forth firmly cling to their things without mind and abandon them, saying, 'This is true; the rest are false.'",
        "source": "T24n1450_014:0171c15_1"
    },
    {
        "source_sentence": "佛告諸苾芻：「汝等應與孤迦里迦等作白四羯磨對眾諫之。",
        "translation": "The Buddha told the monks, You should make a confession to the four karmas and remonstrate with the solitary Kālīyaka and others in order to admonish them.",
        "source": "T24n1450_014:0171c18_2"
    },
    {
        "source_sentence": "若更有餘如是流類，同前集眾作白羯磨，應如是作。",
        "translation": "If there are other such streams, they're the same as the previous one that gathered the crowd to perform the white karma and should be done like this.",
        "source": "T24n1450_014:0171c19_3"
    },
    {
        "source_sentence": "『大德僧伽聽！",
        "translation": "'Listen, great virtuous monks!",
        "source": "T24n1450_014:0171c21_0"
    },
    {
        "source_sentence": "此孤迦里迦、褰茶達驃、羯吒謨洛迦底灑、三沒達羅達多，知彼苾芻欲破和合僧伽作鬪諍事執受而住，隨順於彼不和合事。",
        "translation": "Knowing that monk's desire to break with the harmonious saṃgha and engage in a dispute, he or she takes it up and abides there, following those who aren't harmonious.",
        "source": "T24n1450_014:0171c21_1"
    },
    {
        "source_sentence": "諸苾芻作如是諫時：「汝等莫向諸苾芻作如是語：『諸大德！",
        "translation": "When the monks made this remonstrance, they said, Don't say to the monks like this: 'O great virtuous ones!",
        "source": "T24n1450_014:0171c24_2"
    },
    {
        "source_sentence": "莫共彼苾芻所有言說若好若惡。",
        "translation": "Don't share what that monk says, whether good or bad.",
        "source": "T24n1450_014:0171c25_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1450_014:0171c26_4"
    },
    {
        "source_sentence": "而彼苾芻，是法語者，是律語者，依於法律而作言說，知而說、非不知說，彼愛樂者我亦愛樂。』」",
        "translation": "That monk, who speaks the Dharma and speaks the vinaya, speaks words based on the Dharma and speaks according to the Dharma, knows what he speaks and doesn't say what he doesn't know, and those who delight in them also delight in me.'",
        "source": "T24n1450_014:0171c26_5"
    },
    {
        "source_sentence": "時諸苾芻為作別諫。",
        "translation": "The monks then made a special remonstrance for him.",
        "source": "T24n1450_014:0171c28_6"
    },
    {
        "source_sentence": "別諫之時，彼於其事堅執而住，作如是語：「此事真實，餘皆虛妄。」",
        "translation": "When he admonished them separately, they held firmly to their things and said, This is true; the rest are false.",
        "source": "T24n1450_014:0171c28_7"
    },
    {
        "source_sentence": "若僧伽時至，僧伽應許僧伽今以白四羯磨諫孤迦里迦等四人：「汝孤迦里迦等，知彼苾芻欲破和合僧伽作鬪諍事執受而住，隨順於彼不和合事。",
        "translation": "If it's time for the saṃgha to arrive, the saṃgha should allow the saṃgha to now admonish the four orphaned Kālīyakas and so forth by telling them in four karmas, You orphaned Kālīyakas, you know that monk who wants to break the harmony of the saṃgha and engages in a dispute, takes it up and stays there, and follows their",
        "source": "T24n1450_014:0172a01_8"
    },
    {
        "source_sentence": "諸苾芻作如是諫時：『汝等莫向諸苾芻等作如是語：「大德！",
        "translation": "When the monks made this remonstrance, they said, 'Don't make such a statement to the monks, saying, Mañjuśrī!",
        "source": "T24n1450_014:0172a04_9"
    },
    {
        "source_sentence": "彼苾芻所有言說若好若惡。",
        "translation": "That monk's words are good or bad.",
        "source": "T24n1450_014:0172a05_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1450_014:0172a06_11"
    },
    {
        "source_sentence": "而彼苾芻是法語者，是律語者，依於法律而作言說，知而說、非不知而說，彼愛樂者我亦愛樂。」",
        "translation": "That monk is a Dharma speaker, and this is a vinaya speaker who speaks words based on the Dharma and speaks according to the Dharma, knowing and speaking without knowing, and those who delight in them are also delighted by me.",
        "source": "T24n1450_014:0172a06_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1450_014:0172a08_13"
    },
    {
        "source_sentence": "彼苾芻非法語者，非律語者，而彼苾芻，於非法律執受而住，不知而說，非是知說。",
        "translation": "That monk speaks what's unlawful and doesn't speak what's not according to the precepts, but that monk abides in attachment to what's not according to the precepts and doesn't know it and speaks it, which is not knowing and speaking it.",
        "source": "T24n1450_014:0172a09_14"
    },
    {
        "source_sentence": "諸具壽！",
        "translation": "Guoshou!",
        "source": "T24n1450_014:0172a10_15"
    },
    {
        "source_sentence": "莫樂破僧伽事，當樂和合僧伽，應共僧伽和合歡喜無諍，同心一說如水乳合，大師教法令得光顯安樂而住。",
        "translation": "Don't delight in things that break the saṃgha, and you should delight in reconciling the saṃgha; you should be harmonious with the saṃgha, rejoice without anger, speak with one mind like water and milk coming together, and abide by the teachings of the great teacher to attain radiance and show well-being.",
        "source": "T24n1450_014:0172a11_16"
    },
    {
        "source_sentence": "諸具壽！",
        "translation": "Guoshou!",
        "source": "T24n1450_014:0172a13_17"
    },
    {
        "source_sentence": "汝今應捨隨伴破僧伽不和合事。』」",
        "translation": "Now, you should abandon the task of following companions and disrupting the saṃgha's disharmony.'",
        "source": "T24n1450_014:0172a13_18"
    },
    {
        "source_sentence": "白如是。』",
        "translation": "He said, 'So it is.'",
        "source": "T24n1450_014:0172a14_19"
    },
    {
        "source_sentence": "次作羯磨，准白應為。」",
        "translation": "Next, he'll perform the karma, which should be done according to the explanation.",
        "source": "T24n1450_014:0172a14_20"
    },
    {
        "source_sentence": "諸苾芻既奉教已，白言：「如是。",
        "translation": "After they had taught it, the monks said, So it is.",
        "source": "T24n1450_014:0172a15_21"
    },
    {
        "source_sentence": "我等當諫。」",
        "translation": "We will remonstrate.",
        "source": "T24n1450_014:0172a15_22"
    },
    {
        "source_sentence": "即以白四羯磨諫彼孤迦里迦等。",
        "translation": "He then remonstrated with the four white karmas and admonished those solitary Kālīyakas.",
        "source": "T24n1450_014:0172a16_23"
    },
    {
        "source_sentence": "時彼四人堅執不捨，云：「此真實，餘皆虛妄。」",
        "translation": "Those four people then held it firmly and didn't abandon it, saying, This is true; the rest are false.",
        "source": "T24n1450_014:0172a16_24"
    },
    {
        "source_sentence": "時諸苾芻以緣白佛：「大德！",
        "translation": "The monks then said to the Buddha for this reason, Mañjuśrī!",
        "source": "T24n1450_014:0172a17_25"
    },
    {
        "source_sentence": "我等以白四羯磨，諫彼孤迦里迦等時，堅執其事無心棄捨，云：『此真實，餘皆虛妄。』」",
        "translation": "When we remonstrate with the four white karmas and admonish those solitary Kālīyakas and others, we firmly cling to their affairs without mind and abandon them, saying, 'This is true; the rest are false.'",
        "source": "T24n1450_014:0172a18_26"
    },
    {
        "source_sentence": "佛告諸苾芻：「提婆達多共伴四人，順邪違正。",
        "translation": "The Buddha told the monks, Devadatta and his four companions are following what's wrong and distancing themselves from what's right.",
        "source": "T24n1450_014:0172a20_27"
    },
    {
        "source_sentence": "從今已去，破我弟子和合僧伽，并破法輪，有大勢力。」",
        "translation": "From now on, it will break my disciples' harmonious saṃgha and break the wheel of the Dharma, which has great power.",
        "source": "T24n1450_014:0172a21_28"
    },
    {
        "source_sentence": "時提婆達多聞是語已便作是說：「沙門喬答磨與我授記，告諸苾芻曰：『提婆達多共伴四人順邪違正。",
        "translation": "After hearing these words, Devadatta said, The ascetic Gautama gave me the prediction and told the monks, 'Devadatta and his four companions are following what's wrong and distancing themselves from what's right.",
        "source": "T24n1450_014:0172a23_0"
    },
    {
        "source_sentence": "從今已去，破我弟子和合僧伽，并破法輪，有大勢力。』」",
        "translation": "From now on, it will break my disciples' harmonious saṃgha and break the wheel of the Dharma, which has great power.'",
        "source": "T24n1450_014:0172a25_1"
    },
    {
        "source_sentence": "即告孤迦里迦等：「當知沙門喬答磨與我授記：『提婆達多共伴四人，順邪違正。",
        "translation": "They then told the solitary Kālīyaka and others, You should know that the ascetic Gautama gave me a prediction to Devadatta, 'Devadatta's four companions are following what's wrong and distancing themselves from what's right.",
        "source": "T24n1450_014:0172a26_2"
    },
    {
        "source_sentence": "從今已去，破我弟子和合僧伽，并破法輪，有大勢力。』」",
        "translation": "From now on, it will break my disciples' harmonious saṃgha and break the wheel of the Dharma, which has great power.'",
        "source": "T24n1450_014:0172a28_3"
    },
    {
        "source_sentence": "時提婆達多，於破僧事更增勇猛。",
        "translation": "Devadatta then became even more courageous in the task of destroying the saṃgha.",
        "source": "T24n1450_014:0172a29_4"
    },
    {
        "source_sentence": "諸苾芻聞，具白世尊。",
        "translation": "The monks heard this and reported it to the Bhagavān.",
        "source": "T24n1450_014:0172b01_5"
    },
    {
        "source_sentence": "爾時世尊以此因緣集苾芻僧伽，廣說如前，乃至世尊問提婆達多苾芻曰：「汝實欲破和合僧伽作鬪諍事堅執而住。」",
        "translation": "It was then that the Bhagavān gathered the monks' saṃgha for this reason and explained it in detail as before, up to the point where the Bhagavān asked the monk Devadatta, Do you really want to break the harmony of the saṃgha and make a fight?",
        "source": "T24n1450_014:0172b01_6"
    },
    {
        "source_sentence": "提婆達多白言：「大德！",
        "translation": "Devadatta said, Great virtuous one!",
        "source": "T24n1450_014:0172b04_7"
    },
    {
        "source_sentence": "實爾。」",
        "translation": "It's true.",
        "source": "T24n1450_014:0172b04_8"
    },
    {
        "source_sentence": "爾時世尊告提婆達多曰：「汝非沙門、非隨順，不清淨、不應為，非出家人之所作事。",
        "translation": "It was then that the Bhagavān addressed Devadatta, saying, You're not an ascetic or a follower, impure and shouldn't do anything, and you're not a renunciant.",
        "source": "T24n1450_014:0172b04_9"
    },
    {
        "source_sentence": "若苾芻興方便欲破僧伽，皆得惡作罪。",
        "translation": "If a monk gives rise to the intention to break the saṃgha with skillful means, they'll all be guilty of misdeeds.",
        "source": "T24n1450_014:0172b06_10"
    },
    {
        "source_sentence": "若別諫時事不捨者，皆得麁罪。",
        "translation": "If someone doesn't abandon the matter when they're separately admonished, they'll all be guilty of sexual misconduct.",
        "source": "T24n1450_014:0172b07_11"
    },
    {
        "source_sentence": "若作白四羯磨，如法如律如佛所教諫誨之時，捨者善。",
        "translation": "It's good if you perform the four white karmas, which are according to the Dharma, according to the precepts, and according to what the Buddha teaches and admonishes when you abandon them.",
        "source": "T24n1450_014:0172b08_12"
    },
    {
        "source_sentence": "若不捨者，白了之時得麁罪。",
        "translation": "If someone doesn't abandon it, they'll be guilty of sexual misconduct when they confess it.",
        "source": "T24n1450_014:0172b09_13"
    },
    {
        "source_sentence": "作初番了時，亦得麁罪。",
        "translation": "When he does the first offense, he'll also be guilty of sexual misconduct.",
        "source": "T24n1450_014:0172b10_14"
    },
    {
        "source_sentence": "若第三番羯磨結了之時而不捨者，得僧伽伐尸沙。」",
        "translation": "If he doesn't abandon it when the third karma is concluded, he'll attain crimes against the saṃgha.",
        "source": "T24n1450_014:0172b10_15"
    },
    {
        "source_sentence": "爾時世尊即於本座，為諸聲聞弟子，欲制破僧隨伴學處，告諸苾芻曰：「汝諸苾芻且未須起，僧伽有少事業。」",
        "translation": "At the time, the Bhagavān then took his seat in his own place and wanted to restrain the śrāvaka disciples from violating the saṃgha's accompanying training places, telling the monks, You monks, you don't need to get up; the saṃgha has little business.",
        "source": "T24n1450_014:0172b12_0"
    },
    {
        "source_sentence": "世尊知而故問，廣說如前。",
        "translation": "Knowing this, the World-honored One asked in detail as before.",
        "source": "T24n1450_014:0172b14_1"
    },
    {
        "source_sentence": "世尊即便問孤迦里迦等四人曰：「汝等實知提婆達多欲破和合僧伽，作破僧伽方便，勸作諍事堅執而住，汝共為伴順邪違正。",
        "translation": "The Bhagavān then asked the four people of Aṅgulikālya and so forth, Do you really know that Devadatta wants to break the harmonious saṃgha, does what's necessary to break the saṃgha, encourages them to do deeds that are contrary to it, firmly clings to it, and abides there?",
        "source": "T24n1450_014:0172b15_0"
    },
    {
        "source_sentence": "告諸苾芻曰：『大德！",
        "translation": "He told the monks, 'O great virtuous one!",
        "source": "T24n1450_014:0172b17_1"
    },
    {
        "source_sentence": "共彼苾芻有所論說，若好若惡』等，乃至非出家人之所應作，廣說如前。」",
        "translation": "What's discussed with that monk, whether it's good or bad, etc., up to what's not something a renunciant should do, is explained in detail as before.",
        "source": "T24n1450_014:0172b18_2"
    },
    {
        "source_sentence": "爾時具壽十力迦攝波，教提婆達多神通道法，當時諸苾芻告十力迦攝波曰：「何故上座教惡人提婆達多神通道法？」",
        "translation": "It was then that Kauṣṭhila the Ten-Powered Kāśyapa taught Devadatta the method of the divine path, and the monks at the time addressed the Ten-Powered Kāśyapa, Why did the superior monk teach the bad man Devadatta the method of the divine path?",
        "source": "T24n1450_014:0172b19_3"
    },
    {
        "source_sentence": "十力迦攝答曰：「具壽！",
        "translation": "The ten-powerful Kāśyapa answered, Kauṣṭhila!",
        "source": "T24n1450_014:0172b22_4"
    },
    {
        "source_sentence": "我當不知此惡行人，我若知此人惡行，不教神字，何論教通道法？」",
        "translation": "If I don't know this person's bad actions and don't teach the divine word, why would I discuss teaching the path?",
        "source": "T24n1450_014:0172b23_0"
    },
    {
        "source_sentence": "爾時眾多苾芻告提婆達多曰：「汝得利益供養，悉是上座十力迦攝之德。",
        "translation": "It was then that many monks told Devadatta, You've gained benefits and offerings, which are all the virtues of the ten powers of the superior monk Kāśyapa.",
        "source": "T24n1450_014:0172b24_1"
    },
    {
        "source_sentence": "汝得如是，應往供養十力迦攝。」",
        "translation": "If you attain it like this, you should go and make offerings to the ten powers of Kāśyapa.",
        "source": "T24n1450_014:0172b26_2"
    },
    {
        "source_sentence": "其大眾作此語方便，以提婆達多往十力迦攝，令教提婆達多捨此惡心，得令行善，為說此事故。",
        "translation": "The masses of people who spoke these words skillfully, using Devadatta's ten powers to gather in the ten powers, taught Devadatta to abandon this bad mind and get him to do good, explaining this matter for them.",
        "source": "T24n1450_014:0172b26_3"
    },
    {
        "source_sentence": "時提婆達多告諸苾芻：「彼十力迦攝與我何力？",
        "translation": "Devadatta then addressed the monks, What power does that ten-powered Kāśyapa give me?",
        "source": "T24n1450_014:0172b29_0"
    },
    {
        "source_sentence": "我自日夜常求精進苦行，得第一禪定力，是我自求，不關十力迦攝事。」",
        "translation": "From day and night, I've always pursued diligently practicing austerities and attained the power of the first dhyāna; this is what I seek for myself, which isn't related to the ten powers Kāśyapa.",
        "source": "T24n1450_014:0172c01_1"
    },
    {
        "source_sentence": "時提婆達多作此無恩之語，所有神通皆悉退散。",
        "translation": "Devadatta then spoke these kindless words, and all his supernormal powers withdrew.",
        "source": "T24n1450_014:0172c02_2"
    },
    {
        "source_sentence": "時諸苾芻，知提婆達多無恩故神通退散。",
        "translation": "The monks then knew that Devadatta had no kindness, so their supernormal powers withdrew.",
        "source": "T24n1450_014:0172c03_3"
    },
    {
        "source_sentence": "爾時諸苾芻有疑，詣世尊所，頂禮佛足白世尊曰：「提婆達多，於十力迦攝無恩故，所有神通皆悉退散。」",
        "translation": "It was then that the monks had doubts and went to the Bhagavān, bowed their heads at the Buddha's feet, and said to the Bhagavān, Devadatta, because he has no kindness for the ten powers of Kāśyapa, all his supernormal abilities are completely dispersed.",
        "source": "T24n1450_014:0172c04_4"
    },
    {
        "source_sentence": "佛告諸苾芻：「其提婆達多，非是今時無恩，為此失却神通，亦是往昔無恩之語，失却神通，所學之法皆悉退散。",
        "translation": "The Buddha told the monks, That Devadatta isn't someone who doesn't have kindness at the present time and loses his supernormal powers because of this, nor is he someone who didn't speak kindly in the past and lost his supernormal powers, and all the things he studied are completely scattered.",
        "source": "T24n1450_014:0172c07_0"
    },
    {
        "source_sentence": "汝等諦聽！」",
        "translation": "Listen closely!",
        "source": "T24n1450_014:0172c09_1"
    },
    {
        "source_sentence": "佛告諸苾芻：「此波羅痆斯城，昔有國王名曰梵授。",
        "translation": "The Buddha told the monks, This is the city of Vārāṇasī, where there was once a king named Brahmadatta.",
        "source": "T24n1450_014:0172c09_2"
    },
    {
        "source_sentence": "時彼城中有一旃茶羅，善明健陀羅呪禁之法，承彼呪力飛騰虛空，詣香山中採得非時奇妙花果，持還城內奉獻國王。",
        "translation": "In that city, there was a caṇḍāla who well explained the forbidden spell of the kiṃnara dhāraṇī and flew up into the sky by the power of that spell to gather extraordinary flowers and fruits at an ungodly hour on a mountain of fragrance and bring them back inside the city to present to the king.",
        "source": "T24n1450_014:0172c10_3"
    },
    {
        "source_sentence": "王見恭敬心生歡喜，即以聚落賞旃茶羅。",
        "translation": "When the king saw this respect, he became delighted and rewarded Kauṣṭhila with a village.",
        "source": "T24n1450_014:0172c13_4"
    },
    {
        "source_sentence": "爾時南天竺有一摩納婆，為學呪故，往波羅痆斯城，問諸人眾：『誰善呪法？』",
        "translation": "At the time, there was a man named Manabha in southern India who went to the city of Vārāṇasī for the purpose of studying the spell and asked the crowd of people, 'Who is good at the teaching of the spell?'",
        "source": "T24n1450_014:0172c14_5"
    },
    {
        "source_sentence": "諸人見問，報摩納婆：『今此國內有旃茶羅，善能治呪。』",
        "translation": "Seeing them, the people asked and reported to Mānava, 'Now there's a gandharva in this country who can skillfully treat spells.'",
        "source": "T24n1450_014:0172c16_6"
    },
    {
        "source_sentence": "摩納聞已，便詣旃茶羅處合掌白言：『我今來此奉侍親教。』",
        "translation": "After hearing this, Mānava went to Cūḍāla and joined his palms and said, 'Now, I'm here to serve my relatives and teach them.'",
        "source": "T24n1450_014:0172c17_7"
    },
    {
        "source_sentence": "旃茶羅問曰：『為求何事而云供養？』",
        "translation": "Kauṣṭhila asked, 'What do you ask for an offering?'",
        "source": "T24n1450_014:0172c18_8"
    },
    {
        "source_sentence": "答曰：『為學呪故。』",
        "translation": "He answered, 'It's for the sake of training in the dhāraṇī.'",
        "source": "T24n1450_014:0172c19_9"
    },
    {
        "source_sentence": "「『明呪不惠人，　　以呪換方與，",
        "translation": "'It's clear that the spell doesn't benefit people, but it's given to them in exchange for the spell.",
        "source": "T24n1450_014:0172c19_10"
    },
    {
        "source_sentence": "　　或時得承事，　　或復獲珍財；",
        "translation": "Sometimes they may be able to serve, Or else they may obtain rare treasures.",
        "source": "T24n1450_014:0172c19_10"
    },
    {
        "source_sentence": "　　若不如是者，　　縱死不傳授。』",
        "translation": "If someone doesn't do so, they won't transmit it even if they die.'",
        "source": "T24n1450_014:0172c19_10"
    },
    {
        "source_sentence": "旃茶羅即說頌曰：「時摩納婆報親教曰：『我無珍物，唯空承事供養，幾時可得此呪？』",
        "translation": "Kauṣṭhila then spoke a verse, saying, Manabha then reported to his relatives and taught them, 'I don't have treasures; only emptiness serves and makes offerings, so how long will I be able to attain this spell?'",
        "source": "T24n1450_014:0172c19_10"
    },
    {
        "source_sentence": "旃茶羅曰：『十二年中承事供養我者由知得不？』",
        "translation": "Kauṣṭhila said, 'Did you know who served and made offerings to me for 12 years?'",
        "source": "T24n1450_014:0172c25_11"
    },
    {
        "source_sentence": "摩納婆為學呪故，一心承事供養，漸至一年。",
        "translation": "Because Mānava had studied the spell, he wholeheartedly offered support and offerings to him for a year.",
        "source": "T24n1450_014:0172c26_12"
    },
    {
        "source_sentence": "爾時旃茶羅，為親會故，身飲酒醉夜至家中，弟子摩納婆見即作是念：『今親教身醉，我於今夜，可重加親近侍衛。』",
        "translation": "It was then that Kauṣṭhila, for the sake of his relatives' assembly, drank alcohol and went home late at night to drink it, and when his disciple Manabha saw him, he thought, 'Now, I'll personally teach my body to be drunk; tonight, I can reinforce my relatives and attendants to guard it.'",
        "source": "T24n1450_014:0172c27_13"
    },
    {
        "source_sentence": "即與敷設床席，臥著親教得令安隱。",
        "translation": "He then spread out a bed and seat, lay down on it, and taught it to his relatives so that he could be comfortable.",
        "source": "T24n1450_014:0173a01_14"
    },
    {
        "source_sentence": "爾時親教床上轉動，當即床桄忽折。",
        "translation": "At that point, he personally instructed the bed to turn and move, and then the bed suddenly broke.",
        "source": "T24n1450_014:0173a01_15"
    },
    {
        "source_sentence": "聞床桄折聲，摩納婆自起，作如是念：『親教床桄摧折，臥不安隱。",
        "translation": "When he heard the sound of the broken bed being broken, Mānava arose on his own and thought: I myself taught you how to break the bed.",
        "source": "T24n1450_014:0173a02_16"
    },
    {
        "source_sentence": "我於床下脊替床桄，不令墮地。』",
        "translation": "I'll fold my back under the bed and replace it with a seat, not letting it fall to the ground.'",
        "source": "T24n1450_014:0173a04_17"
    },
    {
        "source_sentence": "作此念已，即於床下替桄而著，不令墮地。",
        "translation": "After he had this thought, he sat cross-legged under his bed and didn't fall to the ground.",
        "source": "T24n1450_014:0173a04_18"
    },
    {
        "source_sentence": "醉人常法，可有身力，盛者二更醒悟。",
        "translation": "A drunken person's eternal dharma allows him to have physical strength, and the strong one awakens twice more.",
        "source": "T24n1450_014:0173a05_19"
    },
    {
        "source_sentence": "其親教飲酒多，至於初夜不醒，嘔變變於摩納身上。",
        "translation": "His relatives taught him to drink a lot of wine, and when he didn't wake up in the first watch of the night, his vomit transformed into manas on his body.",
        "source": "T24n1450_014:0173a06_20"
    },
    {
        "source_sentence": "摩納婆自見身上變吐狼藉，即作是念：『我若為變出言，親教聞已不能得睡。』",
        "translation": "Mānava saw for himself that his body was transformed into a wolf, and he thought, 'If I change words for my own sake, I won't be able to sleep after hearing them personally.'",
        "source": "T24n1450_014:0173a07_21"
    },
    {
        "source_sentence": "作此念已，桄下不言默然而住。",
        "translation": "After he had this thought, he sat cross-legged and remained silent without saying anything.",
        "source": "T24n1450_014:0173a09_22"
    },
    {
        "source_sentence": "即至半夜親教醒覺，見摩納婆於床下，身上嘔變極以狼藉，親教即問：『床下是誰？』",
        "translation": "When he arrived at midnight, he personally awoke and saw Mānava under his bed, vomiting all over his body like a wolf, and he asked, 'Who's there under the bed?'",
        "source": "T24n1450_014:0173a10_23"
    },
    {
        "source_sentence": "弟子答曰：『我摩納婆。』",
        "translation": "The disciple answered, 'I Manabha.'",
        "source": "T24n1450_014:0173a12_24"
    },
    {
        "source_sentence": "親教問曰：『云何在於床下？』",
        "translation": "He personally asked, 'What's under the bed?'",
        "source": "T24n1450_014:0173a12_25"
    },
    {
        "source_sentence": "弟子即如上總說。",
        "translation": "The disciple then explains it in general as above.",
        "source": "T24n1450_014:0173a13_26"
    },
    {
        "source_sentence": "親教聞此語已生大歡喜，喚摩納婆子：『我於汝處甚大歡喜，起離於床下，洗浴清淨來，賜汝法。』",
        "translation": "After hearing these words, his relatives rejoiced greatly and called out to Mānavaputra, 'I'm overjoyed at your place, got up and left my bed, washed and bathed purely, and gave you the teaching.'",
        "source": "T24n1450_014:0173a13_27"
    },
    {
        "source_sentence": "時摩納婆即洗衣裳平旦來至，親教見已即賜呪法。",
        "translation": "Mānava then came to his washing clothes at sunrise, and when he saw them, he taught them the spell.",
        "source": "T24n1450_014:0173a15_28"
    },
    {
        "source_sentence": "時弟子依法學得呪已，其弟子為急心故，即作是念：『我得此呪，宜於城中作其呪法自試神通。』",
        "translation": "After the disciple had studied the dhāraṇī according to the teaching and attained it, that disciple became anxious and thought, 'I've attained this dhāraṇī, so why wouldn't I try my own supernormal powers in the city?'",
        "source": "T24n1450_014:0173a16_29"
    },
    {
        "source_sentence": "念已即騰虛空，往香山取非時花果，來至波羅痆斯，獻奉國內大臣。",
        "translation": "After he thought this, he rose up into the sky and went to the mountain of fragrance to collect flowers and fruits at an ungodly hour and came to Benares to present them to the king's ministers.",
        "source": "T24n1450_014:0173a18_30"
    },
    {
        "source_sentence": "大臣得已却獻國王，國王問大臣曰：『卿何處得此非時好花？』",
        "translation": "After the minister had obtained it, he withdrew and presented it to the king, and the king asked the minister, 'Where did you get this untimely flower?'",
        "source": "T24n1450_014:0173a20_31"
    },
    {
        "source_sentence": "大臣報曰：『南天竺國摩納婆將來與臣，臣即奉獻大王。",
        "translation": "The minister reported, 'The king of southern India, Manabha, was about to give it to his ministers, and the ministers offered it to the king.",
        "source": "T24n1450_014:0173a21_32"
    },
    {
        "source_sentence": "彼摩納婆極明呪法，族姓亦大，唯願大王留此呪師摩納婆；",
        "translation": "The great king wishes that the great king may allow this magician Manabha to stay, sir.",
        "source": "T24n1450_014:0173a23_33"
    },
    {
        "source_sentence": "用此旃茶羅作勿，此旃茶羅是不淨行，願即趂却，所有聚落迴與摩納婆。』",
        "translation": "Don't make use of this caṇḍāla, for this caṇḍāla is an impure act; may it be cut off immediately and all the villages that are there be returned to Mānava.'",
        "source": "T24n1450_014:0173a24_34"
    },
    {
        "source_sentence": "既作語已，爾時國王依臣所請，趂却旃茶羅，安置摩納婆，亦迴聚落訖。",
        "translation": "After he had spoken these words, the king then complied with the request of his ministers, removed Caṇḍāla, placed him in Mānava, and returned to his village.",
        "source": "T24n1450_014:0173a26_35"
    },
    {
        "source_sentence": "其旃茶羅報國王曰：『此摩納婆是我弟子，呪法可過勝我？』",
        "translation": "The king of Kaṇḍāla replied to the king, 'This is my disciple Manabha, so can he outshine me in terms of his spell?'",
        "source": "T24n1450_014:0173a27_36"
    },
    {
        "source_sentence": "時國王問摩納婆：『汝今呪法，可是旃茶羅教不？』",
        "translation": "The king of that country then asked Mānava, 'Now, are you teaching the dhāraṇī, but what's the teaching of caṇḍāla?'",
        "source": "T24n1450_014:0173a29_0"
    },
    {
        "source_sentence": "時摩納婆答大王曰：『我自苦行一年，日夜不絕求得此法，旃茶羅可虛與我。』",
        "translation": "Mānava replied to the great king, 'I've been practicing austerities for a year, and day and night I've never stopped seeking this teaching; Kauṣṭhila can give it to me.'",
        "source": "T24n1450_014:0173b01_1"
    },
    {
        "source_sentence": "時摩納婆無恩於親教故，當即失其呪驗，後所作法皆悉不成。」",
        "translation": "Because Mānava then had no kindness for his relatives, he would immediately lose the spell's testimony, and whatever he did later wouldn't work.",
        "source": "T24n1450_014:0173b02_2"
    },
    {
        "source_sentence": "佛告諸苾芻：「彼摩納婆學得神呪，為無恩故呪力退散，今提婆達多身是也，為無恩故，神通退散。",
        "translation": "The Buddha told the monks, That Manabha had studied the dhāraṇī and retreated because he didn't have the power of the dhāraṇī for lack of kindness, and this is Devadatta in his present form, who retreated because he didn't have the power of the dhāraṇī for lack of kindness.",
        "source": "T24n1450_014:0173b04_3"
    },
    {
        "source_sentence": "諸苾芻當知：所學法親教不合無恩，自今已後，無恩者獲越法罪。」",
        "translation": "You should know, monks, that the teachings of the Dharma you've studied don't fit and lack kindness, and from now on, those who lack kindness will be guilty of transgressing the Dharma.",
        "source": "T24n1450_014:0173b06_4"
    },
    {
        "source_sentence": "爾時世尊從王舍城詣伽耶山，時提婆達多共五百苾芻於人間行。",
        "translation": "It was then that the Bhagavān went from Rājagṛha to Mount Gayā, and Devadatta traveled among the people with five hundred monks.",
        "source": "T24n1450_014:0173b08_0"
    },
    {
        "source_sentence": "阿闍世王愛樂提婆達多，即與五百車粟，奉上提婆達多，令作路糧，至於中路逢諸苾芻。",
        "translation": "The king Ajātaśatru, delighted in Devadatta, gave him five hundred carts of millet and offered it to Devadatta to make provisions for the journey. On the way he met the bhikṣus on the way.",
        "source": "T24n1450_014:0173b09_1"
    },
    {
        "source_sentence": "苾芻問將車人曰：「此是誰車？」",
        "translation": "The monk asked the general's charioteer, Whose chariot is this?",
        "source": "T24n1450_014:0173b11_2"
    },
    {
        "source_sentence": "車人報曰：「此是阿闍世王奉與提婆達多。」",
        "translation": "The charioteer replied, This is the king of Ajātaśatru who gave it to Devadatta.",
        "source": "T24n1450_014:0173b12_3"
    },
    {
        "source_sentence": "苾芻聞此語已，即至佛所而說其言：「時阿闍世王無智，將五百車粟與提婆達多，以為供養，不與世尊。」",
        "translation": "After hearing these words, the monk went to the Buddha and said, At the time, King Ajātaśatru had no knowledge and gave five hundred chariots of grains to Devadatta as an offering that he didn't give to the Bhagavān.",
        "source": "T24n1450_014:0173b13_4"
    },
    {
        "source_sentence": "世尊告諸苾芻：「其阿闍世王，非是今世無智亦供養無智人，往昔先世亦乃如是。",
        "translation": "The Bhagavān addressed the monks, That Ajātaśatru wasn't a king of the world who didn't have knowledge in the present life and offered support to someone who didn't have knowledge, nor did he do so in previous lives.",
        "source": "T24n1450_014:0173b15_5"
    },
    {
        "source_sentence": "汝等諦聽！",
        "translation": "Listen attentively!",
        "source": "T24n1450_014:0173b17_6"
    },
    {
        "source_sentence": "乃往古昔東天竺有一村，去村不遠有一林，其林種種花菓茂盛流泉浴池。",
        "translation": "In the ancient past there was a village in eastern India not far from this village. Not far from it was a forest, with plenty of flowers and fruit that flowed down like rivers and bathing ponds.",
        "source": "T24n1450_014:0173b17_7"
    },
    {
        "source_sentence": "有五百仙住彼林中，常食自落之菓，及取樹根以為飲食，亦取樹皮以為衣服。",
        "translation": "Five hundred sages lived in that forest, always eating their own fruit and taking the roots of the tree as food and drink, and they also took bark from the tree to make clothing.",
        "source": "T24n1450_014:0173b19_8"
    },
    {
        "source_sentence": "爾時有一阿摩菓樹，枝菓垂地極將豐熟。",
        "translation": "At the time, there was an amala fruit tree with branches and fruits hanging down to the ground that were extremely plentiful.",
        "source": "T24n1450_014:0173b20_9"
    },
    {
        "source_sentence": "彼五百仙人至於樹邊隨樹乞菓，其樹神心貪悋菓故，不令落地。",
        "translation": "The five hundred sages went to the side of the tree and followed the tree to solicit fruit, but the tree goddess didn't allow it to land because she was craving fruit.",
        "source": "T24n1450_014:0173b21_10"
    },
    {
        "source_sentence": "是時仙眾見菓不落，復留一仙令看所住之處，餘者往於餘樹更重求菓。",
        "translation": "Seeing that the fruit didn't fall, the saṃgha then left another saṃgha to see where he was staying, and the rest went to another tree to solicit more fruit.",
        "source": "T24n1450_014:0173b23_11"
    },
    {
        "source_sentence": "仙眾去後，有五百賊來至林中，到彼樹邊見菓豐盛，遞相議曰：『我等作何方便食此樹菓？』",
        "translation": "After the sages departed, five hundred thieves came to the forest and went to the side of the tree. Seeing a large amount of fruit, they said among themselves, 'What method will we use to eat this fruit?'",
        "source": "T24n1450_014:0173b25_0"
    },
    {
        "source_sentence": "尊者告曰：『汝等取斧截割此樹，令菓落地，汝等可以食足。』",
        "translation": "The venerable told them, 'Take an axe and cut down this tree so that the fruit will fall to the ground; you can eat it.'",
        "source": "T24n1450_014:0173b27_0"
    },
    {
        "source_sentence": "樹神聞尊者此語，心生悲怖悋惜其樹。",
        "translation": "The tree god heard these words of the Venerable, and his heart became sad and fearful because he cherished the tree.",
        "source": "T24n1450_014:0173b28_1"
    },
    {
        "source_sentence": "時樹神搖動其身，菓悉落地，其時賊眾俱共食菓。",
        "translation": "The tree spirit then shook his body and all the fruit fell to the ground, and the thieves all ate the fruit together.",
        "source": "T24n1450_014:0173b29_2"
    },
    {
        "source_sentence": "食菓既已，時仙即至，見樹摧菓悉落盡。",
        "translation": "After he had eaten the fruit, the sage then arrived and saw that the tree was destroyed and all the fruit fell away.",
        "source": "T24n1450_014:0173c01_3"
    },
    {
        "source_sentence": "仙眾即問彼守林仙人：『今此樹菓是誰食盡？』",
        "translation": "The sages then asked the sage who guarded the forest, 'Who is this fruit of the tree now that it's eaten up?'",
        "source": "T24n1450_014:0173c02_4"
    },
    {
        "source_sentence": "彼守仙人即以上事具答諸仙。",
        "translation": "That guardian sage answered the above questions in detail to the sages.",
        "source": "T24n1450_014:0173c03_5"
    },
    {
        "source_sentence": "爾時諸仙人即責樹神：『是汝無智憎善愛惡，不與善人果，與惡人果。』」",
        "translation": "It was then that the sages reprimanded the tree god, saying, 'This is because you have no knowledge of hating good and loving evil and not giving the fruit of good people and the fruit of bad people.'",
        "source": "T24n1450_014:0173c04_0"
    },
    {
        "source_sentence": "佛告諸苾芻：「昔無智樹神者，今阿闍世王是。",
        "translation": "The Buddha told the monks, In the past, there was no Wisdom Tree Deity, but this is Ajātaśatru now.",
        "source": "T24n1450_014:0173c05_1"
    },
    {
        "source_sentence": "賊中尊者，今提婆達多是。",
        "translation": "Venerable among the thieves is Devadatta now.",
        "source": "T24n1450_014:0173c06_2"
    },
    {
        "source_sentence": "此阿闍世王，先時無智施惡人菓，不供養好人，今無智與提婆達多物，不供養清淨苾芻。」",
        "translation": "This Ajātaśatru king had previously given fruit to bad people without knowledge and didn't offer it to good people, but now he doesn't know the property of Devadatta and doesn't offer it to pure monks.",
        "source": "T24n1450_014:0173c07_3"
    },
    {
        "source_sentence": "爾時世尊從摩揭陀往至王舍城羯蘭鐸迦竹林園中，與大苾芻同住前後圍遶。",
        "translation": "It was then that the Bhagavān departed from Magadha and went to the Kalandaka Bamboo Grove Park in Rājagṛha, where he lived together with a large monk, surrounded by him before and after.",
        "source": "T24n1450_014:0173c09_4"
    },
    {
        "source_sentence": "爾時提婆達多在王舍城，於人間常行非法不善。",
        "translation": "At the time, Devadatta was in Rājagṛha, always acting unlawfully and unskillfully among the people.",
        "source": "T24n1450_014:0173c10_5"
    },
    {
        "source_sentence": "是時城內眾人皆往白佛：「是時提婆達多作諸惡不善。」",
        "translation": "The people in the city then all went to the Buddha and said, At the time, Devadatta did evil and unwholesome things.",
        "source": "T24n1450_014:0173c12_6"
    },
    {
        "source_sentence": "世尊既聞此語告阿難陀曰：「汝將一苾芻隨行，入王舍城街街曲曲，人間若見婆羅門及長者居士，說如是語：『提婆達多及同伴，若作非法罪惡人，不須謗佛法僧。",
        "translation": "When the Bhagavān heard these words, he told Ānanda, Suppose you were to take a monk and go along with him into the city of Rājagṛha, enter the streets in a winding curve, and if the people see Brāhmaṇas and wealthy householders among them, say this, 'Devadatta and his companions, if they commit an unlawful offense or bad person",
        "source": "T24n1450_014:0173c13_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1450_014:0173c16_8"
    },
    {
        "source_sentence": "此人非行佛法行人。』",
        "translation": "This person isn't a practitioner who practices the Buddha's teaching.'",
        "source": "T24n1450_014:0173c17_9"
    },
    {
        "source_sentence": "若有人說提婆達多有神通威德，汝報彼：『提婆達多先有神通，今悉退失，無一神驗。』」",
        "translation": "If someone says Devadatta has supernormal powers and authoritative qualities, you should report to them, 'Devadatta had supernormal powers in the past, but now they've all regressed, not a single one of them.'",
        "source": "T24n1450_014:0173c17_10"
    },
    {
        "source_sentence": "爾時阿難陀受佛教已，即入王舍城說如上語，若後提婆達多，更作不善惡業，勿更來佛邊恥說其過。",
        "translation": "After he had received the Buddha's teaching, Ānanda then entered Rājagṛha and spoke as above, saying, If Devadatta later did another unwholesome or bad action, don't come back to the Buddha and shamefully explain his faults.",
        "source": "T24n1450_014:0173c19_11"
    },
    {
        "source_sentence": "爾時世尊，為慈悲故現其身患。",
        "translation": "It was then that the Bhagavān manifested his physical affliction out of compassion.",
        "source": "T24n1450_014:0173c21_12"
    },
    {
        "source_sentence": "時醫王活命，為佛合煎酥藥，藥名那羅若藥。",
        "translation": "When the king of doctors was alive, he combined the decoction of ghee medicine for the Buddha and named it Nārāyaṇa medicine.",
        "source": "T24n1450_014:0173c22_13"
    },
    {
        "source_sentence": "佛問醫王：「此藥不可思議。」",
        "translation": "The Buddha asked the king of doctors, This medicine is inconceivable.",
        "source": "T24n1450_014:0173c23_14"
    },
    {
        "source_sentence": "醫王答世尊曰：「實不可思議。」",
        "translation": "The king of doctors answered the Bhagavān, It's really inconceivable.",
        "source": "T24n1450_014:0173c24_15"
    },
    {
        "source_sentence": "佛復告醫王：「極不可思議。」",
        "translation": "Again, the Buddha told the king of doctors, It's extremely inconceivable.",
        "source": "T24n1450_014:0173c24_16"
    },
    {
        "source_sentence": "答曰：「實極不可思議。」",
        "translation": "He replied, It's really inconceivable.",
        "source": "T24n1450_014:0173c25_17"
    },
    {
        "source_sentence": "世尊復問醫王：「汝可知不？」",
        "translation": "The Bhagavān again asked the king of doctors, Do you know?",
        "source": "T24n1450_014:0173c25_18"
    },
    {
        "source_sentence": "答曰：「我知。」",
        "translation": "He replied, I know.",
        "source": "T24n1450_014:0173c26_19"
    },
    {
        "source_sentence": "世尊佛復告醫王：「汝實不知。」",
        "translation": "Bhagavān again addressed the king of doctors, You really don't know.",
        "source": "T24n1450_014:0173c26_20"
    },
    {
        "source_sentence": "答曰：「我實不知。」",
        "translation": "He replied, I really don't know.",
        "source": "T24n1450_014:0173c27_21"
    },
    {
        "source_sentence": "佛復告醫王：「何者是不可思議？」",
        "translation": "Again, the Buddha told the king of doctors, What's inconceivable?",
        "source": "T24n1450_014:0173c27_22"
    },
    {
        "source_sentence": "答曰：「牛食水草能出甘露，此酥合煎成此妙那羅若藥。」",
        "translation": "He answered, A cow that eats water and grass can produce ambrosia, and this butter combines to make this wonderful Nārajñā medicine.",
        "source": "T24n1450_014:0173c28_23"
    },
    {
        "source_sentence": "佛復問醫王：「何者極不可思議？」",
        "translation": "Again, the Buddha asked the king of doctors, What's most inconceivable?",
        "source": "T24n1450_014:0173c29_24"
    },
    {
        "source_sentence": "答曰：「佛出於世能說妙法，能令僧眾依教而行，此是極不可思議。」",
        "translation": "He answered, The Buddha comes out in the world to teach the wonderful Dharma and causes the saṃgha to follow it, which is extremely inconceivable.",
        "source": "T24n1450_014:0174a01_25"
    },
    {
        "source_sentence": "佛復問醫王：「何者是汝可知耶？」",
        "translation": "Again, the Buddha asked the king of doctors, What is it that you can know?",
        "source": "T24n1450_014:0174a02_26"
    },
    {
        "source_sentence": "答曰：「一切皆歸死，除佛之外無有得脫者。」",
        "translation": "He answered, All of them return to death, and there's no one other than the Buddha who can be liberated.",
        "source": "T24n1450_014:0174a03_27"
    },
    {
        "source_sentence": "佛復問醫王：「何者汝實不知？」",
        "translation": "Again, the Buddha asked the king of doctors, What do you really don't know?",
        "source": "T24n1450_014:0174a04_28"
    },
    {
        "source_sentence": "答曰：「我知人滅，不知去處。」",
        "translation": "He replied, I know the person's extinction and don't know where they're going.",
        "source": "T24n1450_014:0174a05_29"
    },
    {
        "source_sentence": "爾時諸苾芻，聞此語已心生疑惑，遞相問曰：「此侍縛迦善解佛意。」",
        "translation": "After hearing these words, the monks had doubts in their minds and asked each other questions, This attendant Śākyamuni well understands the Buddha's meaning.",
        "source": "T24n1450_014:0174a05_30"
    },
    {
        "source_sentence": "爾時諸苾芻即問世尊：「看此侍縛迦善知佛意？」",
        "translation": "It was then that the monks asked the Bhagavān, Do you know what the Buddha meant by this attendant Śākyamuni?",
        "source": "T24n1450_014:0174a08_0"
    },
    {
        "source_sentence": "佛即告諸苾芻：「此侍縛迦非是今世善知佛意，亦前世之中善知佛意。",
        "translation": "The Buddha then addressed the monks, This attendant Śākyamuni wasn't someone who well knew the Buddha's intention in this life and was also well aware of the Buddha's intention in a previous life.",
        "source": "T24n1450_014:0174a09_1"
    },
    {
        "source_sentence": "汝等諦聽！」",
        "translation": "Listen closely!",
        "source": "T24n1450_014:0174a10_2"
    },
    {
        "source_sentence": "佛告諸苾芻：「往昔一村落中有一長者名曰善有，其家極富，後娶一妻，妊至十月乃生一女，至二十一日，集諸眷屬乞立名字，其眷屬等即與此孩女名曰善行。",
        "translation": "The Buddha told the monks, Once upon a time, there was an elderly man named Sunetra in a village whose family was extremely wealthy and later married a woman who became pregnant for ten months before she gave birth to a daughter on the twenty-first day.",
        "source": "T24n1450_014:0174a10_3"
    },
    {
        "source_sentence": "乃至復生一子，集諸眷屬乞立名字，其眷屬等與名曰善德。",
        "translation": "When another child is born, he gathers his retinues and begs to establish a name, and his retinues and so forth are given the name Shande.",
        "source": "T24n1450_014:0174a14_4"
    },
    {
        "source_sentence": "其長者作如是念：『我今有子，將諸財寶可往興生。』",
        "translation": "The elder thought, 'Now that I have a child, I can go and give birth to him with all my possessions.'",
        "source": "T24n1450_014:0174a15_5"
    },
    {
        "source_sentence": "更作思念：『我若興生，於後多留財物，恐畏我妻用我財却。』",
        "translation": "Again, he thought, 'If I were to give birth, I'd keep a lot of my possessions in the future, and I'd be afraid that my wife would use them for me.'",
        "source": "T24n1450_014:0174a17_0"
    },
    {
        "source_sentence": "作此念已便少留財，自餘貴寶於金瓶中而滿盛之，復以真珠珓珞瓶項蓋其瓶口，將至寒林馬耳樹下，掘坑埋之。",
        "translation": "After he had this thought, he saved up a small amount of money and filled it with his remaining treasures in a golden vase, covered its mouth with the neck with a genuine pearl necklace, went to the foot of a horse-eared tree in the cold forest, dug a pit, and buried it.",
        "source": "T24n1450_014:0174a18_1"
    },
    {
        "source_sentence": "別取資財即往興易，至他同所倍加得利，便更娶妻，乃至又誕多子。",
        "translation": "They separately take their possessions and go on to prosper, and when they reach the same place as others and double their profits, they then marry another wife or give birth to many more children.",
        "source": "T24n1450_014:0174a20_2"
    },
    {
        "source_sentence": "其前妻子漸為長大，而問母言：『我父何在？』",
        "translation": "His former wife gradually grew up and asked her mother, 'Where's my father?'",
        "source": "T24n1450_014:0174a22_3"
    },
    {
        "source_sentence": "母曰：『承聞汝父今在某城，多饒財貨甚得安寧。",
        "translation": "The mother said, 'I've heard that your father is now in a certain city with plenty of wealth and goods, and he's very peaceful.",
        "source": "T24n1450_014:0174a23_4"
    },
    {
        "source_sentence": "汝可往彼，父若見汝應相濟及。』",
        "translation": "You may go there; if your father sees you, he'll rescue you.'",
        "source": "T24n1450_014:0174a24_5"
    },
    {
        "source_sentence": "子聞此語便詣父處，入於市內父子相見。",
        "translation": "When the son heard these words, he went to his father's place and entered the marketplace where his father and son met.",
        "source": "T24n1450_014:0174a25_6"
    },
    {
        "source_sentence": "父見子面即便識之，喚言：『汝從何來？",
        "translation": "Seeing his son's face, the father recognized him and called out, 'Where are you coming from?'",
        "source": "T24n1450_014:0174a26_7"
    },
    {
        "source_sentence": "欲何所至？』",
        "translation": "Where do you want to go?'",
        "source": "T24n1450_014:0174a26_8"
    },
    {
        "source_sentence": "其子具陳上事，父知己子將歸住處，告言：『汝實莫向他言為是我子。』",
        "translation": "Knowing that his son was about to return to his place of residence, the father told him, 'Don't really say to someone else that he's my child.'",
        "source": "T24n1450_014:0174a27_9"
    },
    {
        "source_sentence": "至於住處心生怜愛，洗浣衣服重加情念，自餘妻息而問之言：『此是何人？』",
        "translation": "As for the place where he lived, his mind became compassionate, washed his clothes and garments with deep thoughts of affection, and asked the rest of his wife, 'Who is this person?'",
        "source": "T24n1450_014:0174a28_10"
    },
    {
        "source_sentence": "父言：『此是我友之子。』",
        "translation": "The father said, 'This is my friend's son.'",
        "source": "T24n1450_014:0174b01_11"
    },
    {
        "source_sentence": "其餘子等見父加怜，而作是念：『此必是子，侵我等財。』",
        "translation": "Seeing their father's compassion, the other children think, 'This must be a child who steals our property.'",
        "source": "T24n1450_014:0174b01_12"
    },
    {
        "source_sentence": "父便作念：『我今宜可與彼財本令還所住。",
        "translation": "The father then thought, 'Now, it's advisable for me to give that treasured man the original property and return it to where he lives.",
        "source": "T24n1450_014:0174b03_0"
    },
    {
        "source_sentence": "若不如此，自餘子等定有妬心而傷害之。』",
        "translation": "If they don't do so, their other children will certainly have jealousy and harm them.'",
        "source": "T24n1450_014:0174b03_1"
    },
    {
        "source_sentence": "父復作念：『若與彼財，為其物故，在此親戚恐殺害之。』",
        "translation": "Again, the father thinks, 'If you give that person's property for their sake, this relative is afraid of killing him.'",
        "source": "T24n1450_014:0174b04_2"
    },
    {
        "source_sentence": "即作書頌而與其子，作書頌已與子遣還。",
        "translation": "He then composed a verse and gave it to his son, and after he composed the verse, he sent it back to him.",
        "source": "T24n1450_014:0174b06_3"
    },
    {
        "source_sentence": "諸親在道即捉問言：『汝父與何等物？』",
        "translation": "The relatives on the road then grabbed it and asked, 'What's your father's property?'",
        "source": "T24n1450_014:0174b07_0"
    },
    {
        "source_sentence": "答曰：『唯與一書。』",
        "translation": "He replied, 'I'll give you only one book.'",
        "source": "T24n1450_014:0174b07_1"
    },
    {
        "source_sentence": "諸人等曰：『必以方便令彼歸還。』",
        "translation": "The people said, 'I'll surely cause them to return with skillful means.'",
        "source": "T24n1450_014:0174b08_2"
    },
    {
        "source_sentence": "隨意放之。",
        "translation": "He released them as he wished.",
        "source": "T24n1450_014:0174b08_3"
    },
    {
        "source_sentence": "便達本國，見母啟拜，母問：『汝於父邊得何等物？』",
        "translation": "When he arrived in his native land, he saw his mother and paid homage to her, and she asked, 'What did you get by your father's side?'",
        "source": "T24n1450_014:0174b09_4"
    },
    {
        "source_sentence": "答曰：『更不得物，唯與此書。』",
        "translation": "He replied, 'I won't get anything else; I'll give it to this book.'",
        "source": "T24n1450_014:0174b10_5"
    },
    {
        "source_sentence": "母曰：『汝父欺篾徒獲辛苦。』",
        "translation": "The mother said, 'Your father deceived me into suffering.'",
        "source": "T24n1450_014:0174b10_6"
    },
    {
        "source_sentence": "子言：『我父甚為智慧，實不輕篾。』",
        "translation": "The son said, 'My father is so wise that he really doesn't despise it.'",
        "source": "T24n1450_014:0174b11_7"
    },
    {
        "source_sentence": "即讀其頌思惟句義，而解釋之。",
        "translation": "He reads the verse, contemplates its meaning, and explains it.",
        "source": "T24n1450_014:0174b12_8"
    },
    {
        "source_sentence": "既了知已，即詣瓶處方掘取之，將至家中成大富貴。」",
        "translation": "After knowing this, he went to the place where the vase was dug and took it, and when he arrived home, he became very wealthy.",
        "source": "T24n1450_014:0174b12_9"
    },
    {
        "source_sentence": "佛言：「苾芻！",
        "translation": "The Buddha said, Monks!",
        "source": "T24n1450_014:0174b13_10"
    },
    {
        "source_sentence": "過去父者，即我身是。",
        "translation": "The father of the past is me.",
        "source": "T24n1450_014:0174b14_11"
    },
    {
        "source_sentence": "彼其子者，今侍縛迦是。",
        "translation": "That's the son, and now he's侍縛迦.",
        "source": "T24n1450_014:0174b14_12"
    },
    {
        "source_sentence": "我以方便而教訓之，便知我意；",
        "translation": "As soon as I teach them with skillful means, they know my thoughts.",
        "source": "T24n1450_014:0174b15_13"
    },
    {
        "source_sentence": "今亦如是。」",
        "translation": "So it is now.",
        "source": "T24n1450_014:0174b15_14"
    },
    {
        "source_sentence": "爾時侍縛迦而作是念：「如來大金剛體，微少酥膏何以為足？",
        "translation": "It was then that the attendant bound Kāśyapa thought, The Tathāgata's great adamantine body has a little bit of butter and cream to make up for it.",
        "source": "T24n1450_014:0174b16_15"
    },
    {
        "source_sentence": "應用二斤。」",
        "translation": "You should use two catties.",
        "source": "T24n1450_014:0174b17_16"
    },
    {
        "source_sentence": "作是念已，即量取二斤熟酥膏，置佛鉢中。",
        "translation": "After he had this thought, he took two pounds of cooked butter and placed it in the Buddha's bowl.",
        "source": "T24n1450_014:0174b17_17"
    },
    {
        "source_sentence": "世尊食已而殘少許與諸苾芻，苾芻禮謝世尊。",
        "translation": "After the Bhagavān had eaten, he gave a small amount of what was left over to the monks, and the monks paid homage to the Bhagavān.",
        "source": "T24n1450_014:0174b18_18"
    },
    {
        "source_sentence": "于時提婆達多見此事已，而作是念：「我應食酥。」",
        "translation": "Seeing this, Devadatta thought, I should eat butter.",
        "source": "T24n1450_014:0174b19_19"
    },
    {
        "source_sentence": "而問侍縛迦言：「沙門喬答摩蘇食幾多？」",
        "translation": "He asked the attendant Śākyamuni, How much food does the ascetic Gautama eat?",
        "source": "T24n1450_014:0174b20_20"
    },
    {
        "source_sentence": "侍縛迦答曰：「正有二斤。」",
        "translation": "The attendant Bimbisāra replied, There are exactly two pounds.",
        "source": "T24n1450_014:0174b21_21"
    },
    {
        "source_sentence": "告言：「我亦欲食二斤。」",
        "translation": "He told them, I also want to eat two pounds.",
        "source": "T24n1450_014:0174b22_22"
    },
    {
        "source_sentence": "侍縛迦曰：「如來世尊大金剛體，所食酥量能使消化，非汝所及。」",
        "translation": "The attendant monk said, Bhagavān, the Tathāgata has a great adamantine body, and the amount of butter he eats can cause it to be digested, which is beyond your ability.",
        "source": "T24n1450_014:0174b22_23"
    },
    {
        "source_sentence": "提婆達多曰：「我今亦是大金剛體，何不能消？」",
        "translation": "Devadatta said, Now that I'm also the body of a great vajra, why can't I eat it?",
        "source": "T24n1450_014:0174b24_24"
    },
    {
        "source_sentence": "即取二斤而便食之。",
        "translation": "He then took two catties and ate it.",
        "source": "T24n1450_014:0174b25_25"
    },
    {
        "source_sentence": "至明清旦，佛所食酥皆悉消化，侍縛迦持粥來奉世尊，如來即食。",
        "translation": "On the morning, at dawn, all the butter eaten by the Buddha was completely digested. The attendant khadira brought the gruel and presented it to the World-honored One, who ate immediately.",
        "source": "T24n1450_014:0174b25_26"
    },
    {
        "source_sentence": "提婆達多酥猶在腹，亦食其粥，腹即大痛，旋轉叫喚晝夜不安。",
        "translation": "Devadatta's butter is still in his belly, and he also eats its gruel. His belly experiences great pain, screaming and wailing day and night unsettled.",
        "source": "T24n1450_014:0174b27_27"
    },
    {
        "source_sentence": "阿難陀於自親族心有顧戀，聞其受痛情生悲愍，詣世尊所而白佛言：「提婆達多為多食酥未消喫粥，腹痛不安。」",
        "translation": "Ānanda had affection for his own relatives, and when he heard their painful feelings of pity, he went to the Bhagavān and said to the Buddha, Devadatta has eaten so much butter that he won't eat gruel, and his belly aches and pains are unsettled.",
        "source": "T24n1450_014:0174b28_28"
    },
    {
        "source_sentence": "爾時如來即舒百福莊嚴功德千輻輪臂無畏相手，通徹山壁按提婆達多頂，告諸苾芻曰：「我於提婆達多及羅怙羅，心生平等更無有異。",
        "translation": "The Tathāgata then spread out a hundred merits, adorned with a thousand-spoked wheel and armless arms of merit, penetrated the mountain wall, touched Devadatta's head, and told the monks, I am equal in mind to Devadatta and Rāhula, without any difference.",
        "source": "T24n1450_014:0174c02_29"
    },
    {
        "source_sentence": "提婆達多諸痛苦劇皆悉除滅。」",
        "translation": "The pain and suffering of Devadatta are all removed.",
        "source": "T24n1450_014:0174c05_30"
    },
    {
        "source_sentence": "作是語已，時提婆達多眾苦頓除，從死得蘇，即觀其手方知佛臂，而作是念：「此是沙門喬答摩臂。」",
        "translation": "After he said this, Devadatta was suddenly freed from all his sufferings and revived after death. He looked at his hand to see the Buddha's arm and thought, This is the arm of the ascetic Gautama.",
        "source": "T24n1450_014:0174c06_31"
    },
    {
        "source_sentence": "為提婆達多由無量劫來懷惡毒故，雖知承以佛威得脫劇苦，便作是語：「其悉達多善能學得如是醫療，以因此法能自濟人。」",
        "translation": "Because Devadatta harbored bad poison for an immeasurable number of eons, even though he knew that he had been liberated from suffering by the Buddha's authority, he said, That Siddhārtha is well able to train and attain this kind of medicine, and it's because of this teaching that he can help himself.",
        "source": "T24n1450_014:0174c08_32"
    },
    {
        "source_sentence": "于是四面而出大聲：「如來世尊以誠實語，救提婆達多劇苦痛惱。」",
        "translation": "He then emerged from the four sides in a loud voice, The Bhagavān, the Tathāgata, spoke with sincerity to save Devadatta from suffering and pain.",
        "source": "T24n1450_014:0174c11_33"
    },
    {
        "source_sentence": "提婆達多眾及諸人，聞此聲時無不慶喜，皆共稱讚：「世尊神力不可思議，甚為奇特。」",
        "translation": "When the Devadatta crowd and others heard this sound, they all rejoiced and praised it, The Bhagavān's miraculous power is inconceivable; it's extraordinary.",
        "source": "T24n1450_014:0174c12_34"
    },
    {
        "source_sentence": "時諸苾芻詣提婆達多處告曰：「佛若不救，當死無疑。」",
        "translation": "The monks then went to Devadatta and told him, If the Buddha doesn't save them, they'll die without doubt.",
        "source": "T24n1450_014:0174c14_35"
    },
    {
        "source_sentence": "提婆達多曰：「佛知善術，方欲眾人皆隨己故，而作斯法。」",
        "translation": "Devadatta said, Knowing good skillful means, the Buddha wants all people to follow themselves and do such things.",
        "source": "T24n1450_014:0174c15_36"
    },
    {
        "source_sentence": "諸苾芻曰：「提婆達多勿出此語，宜速默然當自心觀，豈非佛救耶？」",
        "translation": "The monks said, Devadatta, don't make such a statement; it's better to quickly remain silent and contemplate for yourself, isn't that the Buddha's rescue?",
        "source": "T24n1450_014:0174c16_37"
    },
    {
        "source_sentence": "提婆達多曰：「何關彼能救我？",
        "translation": "Devadatta said, What's the matter with whether they can save me?",
        "source": "T24n1450_014:0174c18_38"
    },
    {
        "source_sentence": "腹內酥消痛苦自除。」",
        "translation": "The butter in his belly disappears and the pain he suffers is removed on its own.",
        "source": "T24n1450_014:0174c19_0"
    },
    {
        "source_sentence": "時諸苾芻既聞此語知無恩報，詣世尊所而白佛言：「唯願如來視聽提婆達多。",
        "translation": "When the monks heard these words, they knew there was no reward for their kindness and went to the Bhagavān and said to the Buddha, Please, Tathāgata, let's just ask the Tathāgata to examine Devadatta.",
        "source": "T24n1450_014:0174c19_1"
    },
    {
        "source_sentence": "世尊於彼有大慈悲，彼今無恩無報。」",
        "translation": "Bhagavān, the Bhagavān has great compassion for them, and now they lack kindness and repayment.",
        "source": "T24n1450_014:0174c21_2"
    },
    {
        "source_sentence": "根本說一切有部毘奈耶破僧事卷第十四",
        "translation": "Mūlasarvâstivāda-sūtra, Vinaya that breaks the saṃgha's business, vol. 14",
        "source": "T24n1450_014:0174c23_0"
    }
]