[
    {
        "source_sentence": "根本說一切有部毘奈耶雜事",
        "translation": "Mūlasarvâstivāda-vinaya miscellaneous matters",
        "source": "T24n1451_012:0256b13_0"
    },
    {
        "source_sentence": "卷第十二",
        "translation": "Fascicle 12.",
        "source": "T24n1451_012:0256b14_0"
    },
    {
        "source_sentence": "三藏法師義淨奉　制譯",
        "translation": "translated by the Tripiṭaka Master Yogâcārabhūmi in Sanskrit",
        "source": "T24n1451_012:0256b16_0"
    },
    {
        "source_sentence": "第二門第十子攝頌難陀因緣之餘",
        "translation": "The second aspect of the tenth disciple's verse summarizes the rest of the causes and conditions for Nanda's death",
        "source": "T24n1451_012:0256b17_0"
    },
    {
        "source_sentence": "佛告難陀：「凡胎生者是極苦惱，初生之時或男或女墮人手內，或以衣裹安在日中，",
        "translation": "The Buddha said to Nanda: All those who are born in the womb experience extreme pain and suffering. At the time of their first birth some men or women may fall into someone’s hands, while others wrap their clothes around them and place them in the sun.",
        "source": "T24n1451_012:0256b18_0"
    },
    {
        "source_sentence": "或在陰處或置搖車，或居床席懷抱之內，由是因緣皆受酸辛楚毒極苦。",
        "translation": "Because of these causes and conditions, they'll all experience painful, punishing, and extremely painful suffering.",
        "source": "T24n1451_012:0256b19_1"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0256b21_2"
    },
    {
        "source_sentence": "如牛剝皮近牆而住被牆蟲所食，若近樹草樹草蟲食，若居空處諸蟲唼食，",
        "translation": "It's like an ox skinning its skin and standing near a wall that's eaten by a wall bug. If it's near a tree or grass, the worms will eat it; if it lives in an empty place, the insects will eat it.",
        "source": "T24n1451_012:0256b21_3"
    },
    {
        "source_sentence": "皆受苦惱初生亦爾。",
        "translation": "So it is with the first birth that they all experience suffering and distress.",
        "source": "T24n1451_012:0256b23_4"
    },
    {
        "source_sentence": "以煖水洗受大苦惱，如癩病人皮膚潰爛膿血橫流，加之杖捶極受楚切。",
        "translation": "It's like when a leprosy patient's skin breaks up and pus and blood flows across their skin, and they're beaten with a cane to experience extreme pain.",
        "source": "T24n1451_012:0256b23_5"
    },
    {
        "source_sentence": "生身之後飲母血垢而得長大，言血垢者於聖法律中即乳汁是。",
        "translation": "After he's born, he drinks the stain of his mother's blood and grows into a man who says that the stain of blood is milk juice according to the noble law.",
        "source": "T24n1451_012:0256b25_6"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0256b27_0"
    },
    {
        "source_sentence": "既有如是無邊極苦無一可樂，誰有智者於斯苦海而生愛戀，常為流轉無有休息？",
        "translation": "Since there's such an infinite ocean of extreme suffering and no one to be enjoyed, who has the knowledge to give rise to craving for this ocean of suffering that always flows along with it without resting?",
        "source": "T24n1451_012:0256b27_1"
    },
    {
        "source_sentence": "生七日己身內即有八萬戶虫縱橫噉食。",
        "translation": "On the seventh day he was born, there were 80,000 household worms inside his body that ate horizontally and vertically.",
        "source": "T24n1451_012:0256b29_0"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0256b29_1"
    },
    {
        "source_sentence": "有一戶蟲名曰食髮，依髮根住常食其髮。",
        "translation": "There's a household worm named food that always feeds on it depending on its roots.",
        "source": "T24n1451_012:0256c01_2"
    },
    {
        "source_sentence": "有二戶蟲：一名杖藏、二名麁頭，依頭而住常食其頭。",
        "translation": "There are two household worms: one is a cane-store and two are called gnats, which live on their heads and always eat their heads.",
        "source": "T24n1451_012:0256c02_0"
    },
    {
        "source_sentence": "有一戶蟲名曰繞眼，依眼而住常食於眼。",
        "translation": "There's a household worm named circumambulating the eye, which relies on the eye and always feeds on it.",
        "source": "T24n1451_012:0256c03_1"
    },
    {
        "source_sentence": "有四戶蟲：一名驅逐、二名奔走、三名屋宅、四名圓滿，依腦而住常食於腦。",
        "translation": "There are four household worms: one that drives out, two that run away, three that live in a house, and four that are complete. They live by their brains and always feed on the brains.",
        "source": "T24n1451_012:0256c04_2"
    },
    {
        "source_sentence": "有一戶蟲名曰稻葉，依耳食耳。",
        "translation": "There's a household worm named rice leaf, which feeds on ears depending on their ears.",
        "source": "T24n1451_012:0256c05_3"
    },
    {
        "source_sentence": "有一戶蟲名曰藏口，依鼻食鼻。",
        "translation": "There's a household worm named hidden mouth that relies on its nose to eat its nose.",
        "source": "T24n1451_012:0256c06_4"
    },
    {
        "source_sentence": "有二戶蟲：一名遙擲、二名遍擲，依脣食脣。",
        "translation": "There are two household worms: one that throws from a distance and two that toss it all over, relying on the lips to feed on the lips.",
        "source": "T24n1451_012:0256c07_5"
    },
    {
        "source_sentence": "有一戶蟲名曰蜜葉，依齒食齒。",
        "translation": "There was a household worm named honey leaf that relied on its teeth to eat the teeth.",
        "source": "T24n1451_012:0256c08_6"
    },
    {
        "source_sentence": "有一戶蟲名曰木口，依齒根食齒根。",
        "translation": "There's a household worm named wood mouth that relies on the teeth faculty to feed on the teeth faculty.",
        "source": "T24n1451_012:0256c09_0"
    },
    {
        "source_sentence": "有一戶蟲名曰針口，依舌食舌。",
        "translation": "There's a household worm named needle mouth that relies on its tongue to eat its tongue.",
        "source": "T24n1451_012:0256c09_1"
    },
    {
        "source_sentence": "依一戶蟲名曰利口，依舌根食舌根。",
        "translation": "Relying on one household worm, it's called sharp mouth and relying on the tongue faculty to eat the tongue faculty.",
        "source": "T24n1451_012:0256c10_2"
    },
    {
        "source_sentence": "有一戶蟲名曰手圓，依腭食腭。",
        "translation": "There's a household worm named hand-complete, which relies on its palate to eat the palate.",
        "source": "T24n1451_012:0256c11_3"
    },
    {
        "source_sentence": "復有二戶蟲：一名手網、二名半屈，依手掌食手掌。",
        "translation": "Again, there are two household worms: one is a hand net and two are called half-bent, which rely on the palm of their hand to feed on the palm of their hand.",
        "source": "T24n1451_012:0256c12_4"
    },
    {
        "source_sentence": "有二戶蟲：一名短懸、二名長懸，依腕食腕。",
        "translation": "There are two household worms: one that hangs short and two that hang long, relying on the wrist to feed on the wrist.",
        "source": "T24n1451_012:0256c13_5"
    },
    {
        "source_sentence": "有二戶蟲：一名遠臂、二名近臂，依臂食臂。",
        "translation": "There are two household worms: one with a distant arm and two with a near arm, relying on the arm to eat the arm.",
        "source": "T24n1451_012:0256c14_6"
    },
    {
        "source_sentence": "有二戶蟲：一名欲吞、二名已吞，依喉食喉，有二戶蟲：一名有怨、二名大怨，",
        "translation": "There are two household worms: one that wants to swallow and two that have swallowed, and there are two household worms that rely on their throats to eat their throats. One is enemies and two are called great enemies.",
        "source": "T24n1451_012:0256c15_7"
    },
    {
        "source_sentence": "依胸食胸。",
        "translation": "They rely on the chest to nourish the chest.",
        "source": "T24n1451_012:0256c16_8"
    },
    {
        "source_sentence": "有二戶蟲：一名螺貝、二名螺口，依肉食肉。",
        "translation": "There are two household worms: one is called a conch shell and two are called a conch mouth, which rely on flesh to eat flesh.",
        "source": "T24n1451_012:0256c17_9"
    },
    {
        "source_sentence": "有二戶蟲：一名有色、二名有力，依血食血。",
        "translation": "There are two household worms: one with color and two powerful names, which rely on blood to eat blood.",
        "source": "T24n1451_012:0256c18_0"
    },
    {
        "source_sentence": "有二戶蟲：一名勇健、二名香口，依筋食筋。",
        "translation": "There are two household worms: one is courageous and two are called fragrant mouths, which rely on the tendons to eat the tendons.",
        "source": "T24n1451_012:0256c18_1"
    },
    {
        "source_sentence": "有二戶蟲：一名不高、二名下口，依脊食脊。",
        "translation": "There are two household worms: one that isn't tall and two that have lower mouths, relying on the ridges to eat the ridges.",
        "source": "T24n1451_012:0256c19_2"
    },
    {
        "source_sentence": "有二戶蟲俱名脂色，依脂食脂。",
        "translation": "There are two household worms that are both called greasy-colored, which rely on fat and eat fat.",
        "source": "T24n1451_012:0256c20_3"
    },
    {
        "source_sentence": "有一戶蟲名曰黃色，依黃食黃。",
        "translation": "There's a household worm named yellow-colored, which relies on the yellow and eats the yellow.",
        "source": "T24n1451_012:0256c21_4"
    },
    {
        "source_sentence": "有一戶蟲名曰真珠，依腎食腎。",
        "translation": "There was a household worm named Zhenzhu, which relied on kidneys to feed on kidneys.",
        "source": "T24n1451_012:0256c22_5"
    },
    {
        "source_sentence": "有一戶蟲名曰大真珠，依腰食腰。",
        "translation": "There was a household worm named Great Pure Jewel, which lived at the waist and ate at the waist.",
        "source": "T24n1451_012:0256c23_6"
    },
    {
        "source_sentence": "有一戶蟲名曰未至，有脾食脾。",
        "translation": "There's a household worm named Upāsaka, which has spleen that feeds on spleen.",
        "source": "T24n1451_012:0256c23_7"
    },
    {
        "source_sentence": "有四戶蟲：一名水命、二名大水命、三名針口、四名刀口，依腸食腸。",
        "translation": "There are four household worms: one is called water life, two are called great water life, three are called needle mouths, and four are called sword mouths, which feed on intestines depending on the intestines.",
        "source": "T24n1451_012:0256c24_8"
    },
    {
        "source_sentence": "有五戶蟲：一名月滿、二名月面、三名暉耀、四名暉面、五名別住，依右脇食其脇。",
        "translation": "There are five household worms: one is called the full moon, two are called the moon-face, three are called Huiyao, four are called Hui-face, and five are separately resident, relying on their right side to feed on their left side.",
        "source": "T24n1451_012:0256c26_9"
    },
    {
        "source_sentence": "復有五蟲，名同於上，依左脇食其脇。",
        "translation": "Again, there are five insects whose names are the same as those above, which feed on their left side and support themselves on their right side.",
        "source": "T24n1451_012:0256c27_10"
    },
    {
        "source_sentence": "復有四蟲：一名穿前、二名穿後、三名穿堅、四名穿住，依骨食骨。",
        "translation": "Again, there are four worms: one that penetrates before, two that penetrate after, three that penetrate firmly, and four that penetrate and abide depending on the bones to eat the bones.",
        "source": "T24n1451_012:0256c28_11"
    },
    {
        "source_sentence": "有四戶蟲：一名大白、二名小白、三名重雲、四名臭氣，依脈食脈。",
        "translation": "There are four household worms: one large white, two small white, three heavy clouds, and four foul odor, which feed on the veins depending on the veins.",
        "source": "T24n1451_012:0257a01_12"
    },
    {
        "source_sentence": "有四戶蟲：一名師子、二名備力、三名急箭、四名蓮花，依生藏食生藏。",
        "translation": "There are four household worms: one is called a lion, two are called arbudas, three are called sharp arrows, and four are called lotus blossoms, which rely on the growing store to nourish the growing store.",
        "source": "T24n1451_012:0257a02_13"
    },
    {
        "source_sentence": "有二戶蟲：一名安志、二名近志，依熟藏食熟藏。",
        "translation": "There are two household worms: one named Anzhi and two named近志, which rely on cooked stores to nourish the cooked store.",
        "source": "T24n1451_012:0257a04_14"
    },
    {
        "source_sentence": "有四戶蟲：一名鹽口、二名蘊口、三名網口、四名雀口，依小便道食尿而住。",
        "translation": "There are four household worms: one is the mouth of salt, two are the mouths of the aggregates, three are the mouths of nets, and four are the mouths of birds that live on urine from the excretory passage.",
        "source": "T24n1451_012:0257a05_15"
    },
    {
        "source_sentence": "有四戶蟲：一名應作、二名大作、三名小形、四名小束，依大便道食糞而住。",
        "translation": "There are four household worms: one that should be made, two that are made large, three that are small-shaped, and four that are small- bunched, which live relying on the excrement in the toilet to eat dung.",
        "source": "T24n1451_012:0257a07_16"
    },
    {
        "source_sentence": "有二戶蟲：一名黑口、二名大口，依髀食髀。",
        "translation": "There are two household worms: one with a black mouth and two with a large mouth, which feed on the thighs depending on the thighs.",
        "source": "T24n1451_012:0257a08_17"
    },
    {
        "source_sentence": "有二戶蟲：一名癩、二名小癩、依膝食膝。",
        "translation": "There are two household worms: one with leprosy and two with minor leprosy, who feed on their knees by relying on their knees.",
        "source": "T24n1451_012:0257a09_18"
    },
    {
        "source_sentence": "有一戶蟲名曰愚根，依脛食脛。",
        "translation": "There's a household worm named Foolish Root, which feeds on shins and bases itself on shins.",
        "source": "T24n1451_012:0257a10_19"
    },
    {
        "source_sentence": "有一戶蟲名曰黑項，依脚食脚。",
        "translation": "There's a household worm named black-headed, which relies on its feet to eat its feet.",
        "source": "T24n1451_012:0257a11_20"
    },
    {
        "source_sentence": "「難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0257a11_21"
    },
    {
        "source_sentence": "如此之身甚可厭患，如斯色類常有八萬戶蟲日夜噉食，由此令身熱惱羸瘦疲困飢渴。",
        "translation": "Such a body is so disgusting that it's always accompanied by 80,000 household worms who eat day and night, which causes their bodies to become feverish, weak, exhausted, hungry, and thirsty.",
        "source": "T24n1451_012:0257a12_22"
    },
    {
        "source_sentence": "又復心有種種苦惱憂愁悶絕，眾病現前，無有良醫能為除療。",
        "translation": "Again, there are various kinds of pain and distress in their minds, and many illnesses appear before them, with no good doctor to remove or treat them.",
        "source": "T24n1451_012:0257a14_23"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0257a15_24"
    },
    {
        "source_sentence": "於大有海生死之中有如是苦，云何於此而生愛樂？",
        "translation": "In the great ocean of existence, there's such suffering in birth-and-death, so how can we give rise to desire and pleasure here?",
        "source": "T24n1451_012:0257a15_25"
    },
    {
        "source_sentence": "復為諸神諸病之所執持，所謂天神龍神八部所持，及諸鬼神乃至羯吒布單那，",
        "translation": "Again, they're held by the gods and sicknesses, which are called heavenly spirits, dragon spirits, the eight kinds of spirits, ghost spirits, and so forth, up to Kāṭapātana.",
        "source": "T24n1451_012:0257a16_26"
    },
    {
        "source_sentence": "及餘禽獸諸鬼所持，或為日月星辰所厄，此等鬼神作諸病患，逼惱身心難可具說。」",
        "translation": "It's difficult to describe the illnesses that are caused by other birds, animals, ghosts, or the sun, moon, stars, and other things that are harmed by these ghosts and spirits, which oppress body and mind.",
        "source": "T24n1451_012:0257a18_27"
    },
    {
        "source_sentence": "佛告難陀：「誰於生死樂入母胎受極辛苦？",
        "translation": "The Buddha told Nanda, Who enters the mother's womb with great suffering in birth-and-death bliss?",
        "source": "T24n1451_012:0257a21_0"
    },
    {
        "source_sentence": "如是生成如是增長，飲母乳血妄生美想，及諸飲長漸至長成。",
        "translation": "Thus produced and thus grown, they drink their breast milk and blood to falsely give rise to perceptions of beauty, and they drink it gradually until it's formed.",
        "source": "T24n1451_012:0257a21_1"
    },
    {
        "source_sentence": "假令身得安樂無病衣食恣情壽滿百歲，於此生中睡眠減半。",
        "translation": "Suppose he were to attain physical well-being without illness, eat and drink freely, and have a life span of one hundred years, and then sleep for half the duration of his life in this birth.",
        "source": "T24n1451_012:0257a23_2"
    },
    {
        "source_sentence": "初為嬰兒次為童子，漸至成長，憂悲患難眾病所逼，無量百苦觸惱其身難可說盡，",
        "translation": "They were first to be born as children and then as children, gradually growing up into the forms of great compassion and distress, overcome by various illnesses. Their bodies suffered innumerable hundreds of thousands of painful sensations that could not be described exhaustively.",
        "source": "T24n1451_012:0257a24_3"
    },
    {
        "source_sentence": "身內諸苦難忍受時，不願存生意便求死。",
        "translation": "When the pain in his body is unbearable, he doesn't want to keep his business alive and then seeks death.",
        "source": "T24n1451_012:0257a26_4"
    },
    {
        "source_sentence": "如是之身苦多樂少，雖復暫住必當謝滅。",
        "translation": "Such a body has much suffering and little pleasure, but even if it temporarily abides, it will surely wither and cease.",
        "source": "T24n1451_012:0257a27_5"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0257a28_6"
    },
    {
        "source_sentence": "生者皆死無有常存。",
        "translation": "Those who are born are all dead, and there's no eternal existence.",
        "source": "T24n1451_012:0257a28_7"
    },
    {
        "source_sentence": "假使藥食資養壽命得延年歲，終歸不免死王所殺送往空田。",
        "translation": "Suppose he were to take medicine and food to sustain his life for a long time, but then he'll never be spared the king's death and be killed by him and sent to an empty field.",
        "source": "T24n1451_012:0257a29_8"
    },
    {
        "source_sentence": "是故當知生無可樂，來世資糧應勤積集勿作放逸，策修梵行莫為嬾惰，",
        "translation": "Because of this, you should know that birth is unworthy of pleasure. You should accumulate future provisions and accumulate them diligently so as not to be lazy, and cultivate the holy life without becoming idle.",
        "source": "T24n1451_012:0257b01_9"
    },
    {
        "source_sentence": "於諸利行、法行、功德行、純善行常樂修習。",
        "translation": "He always delights in cultivating beneficial practices, Dharma practices, meritorious practices, and purely good practices.",
        "source": "T24n1451_012:0257b03_10"
    },
    {
        "source_sentence": "恒觀自身善惡二業，繫在於心，勿令後時生大追悔。",
        "translation": "He always observes that his own good and bad actions are bound to the mind, so that no great remorse will arise later.",
        "source": "T24n1451_012:0257b04_11"
    },
    {
        "source_sentence": "一切所有愛樂之事皆悉別離，隨善惡業趣於後世。",
        "translation": "All the things they enjoy are completely distinct, and they'll follow the destinies of good and bad actions in subsequent lives.",
        "source": "T24n1451_012:0257b05_12"
    },
    {
        "source_sentence": "「難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0257b06_13"
    },
    {
        "source_sentence": "壽命百年有其十位，初謂嬰兒位，臥於襁褓。",
        "translation": "The duration of life is one hundred years. There are ten states:",
        "source": "T24n1451_012:0257b06_14"
    },
    {
        "source_sentence": "二謂童子，樂為兒戲。",
        "translation": "The second is a boy who enjoys playing for his children.",
        "source": "T24n1451_012:0257b07_15"
    },
    {
        "source_sentence": "三謂少年，受諸欲樂。",
        "translation": "The third refers to youthful people who experience desires and pleasures.",
        "source": "T24n1451_012:0257b08_16"
    },
    {
        "source_sentence": "四謂少壯，勇健多力。",
        "translation": "The fourth is called having little vigor and being courageous and strong.",
        "source": "T24n1451_012:0257b08_17"
    },
    {
        "source_sentence": "五謂盛年，有智談論。",
        "translation": "The fifth refers to the flourishing years when there are wise discussions.",
        "source": "T24n1451_012:0257b09_0"
    },
    {
        "source_sentence": "六謂成就，能善思量巧為計策。",
        "translation": "The sixth is the accomplishment of skillful deliberation as a means of calculation.",
        "source": "T24n1451_012:0257b09_1"
    },
    {
        "source_sentence": "七謂漸衰，善知法式。",
        "translation": "The seventh is the gradual declining, which is to know well the pattern of the Dharma.",
        "source": "T24n1451_012:0257b10_2"
    },
    {
        "source_sentence": "八謂朽邁，眾事衰弱。",
        "translation": "The eighth is called decrepitude, which is the weakness of all things.",
        "source": "T24n1451_012:0257b10_3"
    },
    {
        "source_sentence": "九謂極老，無所能為。",
        "translation": "The ninth is the extreme old age, for which there is nothing to be done.",
        "source": "T24n1451_012:0257b11_4"
    },
    {
        "source_sentence": "十謂百年，是當死位。",
        "translation": "Ten means a hundred years, which is when he's about to die.",
        "source": "T24n1451_012:0257b11_5"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0257b12_6"
    },
    {
        "source_sentence": "梗概大位略說如是。",
        "translation": "The outline and the major stages are briefly explained like this.",
        "source": "T24n1451_012:0257b12_7"
    },
    {
        "source_sentence": "計准四月以為一時，百年之中有三百時，於春夏冬各有其百，一年十二月總有一千二百月。",
        "translation": "The fourth month is calculated to be a unit of time. Within one hundred years, there are three hundred seasons; in spring, summer, and winter, there are one hundred; the twelve months of a year have altogether one thousand two hundred months.",
        "source": "T24n1451_012:0257b12_8"
    },
    {
        "source_sentence": "若半月為數，總有二千四百半月。",
        "translation": "The total is two thousand four hundred and one-half months.",
        "source": "T24n1451_012:0257b14_9"
    },
    {
        "source_sentence": "於三時中各有八百半月，總有三萬六千晝夜，一日再食總有七萬二千度食。",
        "translation": "In each of the three seasons there are eighty-five thousand days and a half months, altogether thirty-six thousand days and nights. The duration of one day’s rebirth is altogether seventy-thousand and twenty-two thousand days in all.",
        "source": "T24n1451_012:0257b15_10"
    },
    {
        "source_sentence": "雖有緣不食亦在其數，不食緣者所謂瞋恨不食、遭苦不食，或求索不得，",
        "translation": "Even though there are reasons for not eating, it is also counted among them. The reason for not eating is so-called because of being with an angry feeling and not eating when experiencing frustration; sometimes one asks for something but does not get it.",
        "source": "T24n1451_012:0257b17_11"
    },
    {
        "source_sentence": "睡眠、持齋、掉戲不食，事務不食。",
        "translation": "They don't eat when they sleep, observe purification, engage in agitation and play, and don't eat during business.",
        "source": "T24n1451_012:0257b18_12"
    },
    {
        "source_sentence": "食與不食而共合集數有爾許，并飲母乳，人命百年。",
        "translation": "There were so many such people who ate and didn't eat together, and they gathered together to drink their milk and human life for a hundred years.",
        "source": "T24n1451_012:0257b19_13"
    },
    {
        "source_sentence": "我已具說年月晝夜及飲食數，汝應生厭。",
        "translation": "I've already explained the number of years, days, nights, and food and drink, so you should become disillusioned.",
        "source": "T24n1451_012:0257b20_14"
    },
    {
        "source_sentence": "「難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0257b21_15"
    },
    {
        "source_sentence": "如是生成長大，身有眾病，所謂頭目、耳鼻、舌齒、咽喉、胸腹、手足、疥癩、癲狂、水腫、欬嗽、風黃、熱癊，",
        "translation": "In the same way, when a bodhisattva grows into an adult, his body is afflicted by various illnesses such as hair, eyes, ears, nose, tongue, teeth, throat, chest, abdomen, hands, feet, scabies, leprosy, epilepsy, edema, blisters, abscesses, yellow fever, and",
        "source": "T24n1451_012:0257b21_16"
    },
    {
        "source_sentence": "眾多瘧病支節痛苦。",
        "translation": "Many members of the malaria epidemic are painful.",
        "source": "T24n1451_012:0257b24_0"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0257b24_1"
    },
    {
        "source_sentence": "人身有如是病苦。",
        "translation": "A person's body has this kind of illness and suffering.",
        "source": "T24n1451_012:0257b24_2"
    },
    {
        "source_sentence": "復有百一風病、百一黃病、百一痰癊病、百一總集病，總有四百四病，",
        "translation": "There were also a hundred and one cases of wind sickness, a hundred and one cases of yellow sickness, a hundred and one cases of phlegm sickness, and a hundred and one cases of the disease of accumulation sickness. Altogether there were four hundred and four such cases.",
        "source": "T24n1451_012:0257b25_3"
    },
    {
        "source_sentence": "從內而生。",
        "translation": "They arise from within.",
        "source": "T24n1451_012:0257b26_4"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0257b26_5"
    },
    {
        "source_sentence": "身如癰箭眾病所成，無暫時停念念不住，體是無常、苦、空、無我，恆近於死敗壞之法，",
        "translation": "Their bodies are like arrowheads, formed by the sicknesses of hunger and thirst. Without a moment’s thought or thought-thought they do not abide. Their essence is impermanent, painful, empty, and without self. They cling to the law of death and decay.",
        "source": "T24n1451_012:0257b27_0"
    },
    {
        "source_sentence": "不可保愛。",
        "translation": "They can't be treasured.",
        "source": "T24n1451_012:0257b28_1"
    },
    {
        "source_sentence": "「難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0257b29_2"
    },
    {
        "source_sentence": "凡諸眾生復有如是生受苦痛，謂截手足、眼、耳、鼻、舌頭及支分。",
        "translation": "Ordinary sentient beings also have this kind of birth that brings pain and suffering, which is when they cut off their hands, feet, eyes, ears, ears, nose, tongue, head, and limbs.",
        "source": "T24n1451_012:0257b29_3"
    },
    {
        "source_sentence": "復受獄囚、枷鎖、杻械、鞭打、拷楚、飢渴、因苦、寒熱、雨雪、蚊虻、蟻子、風塵、猛獸，",
        "translation": "Again, they're imprisoned, chained, beaten, whipped, tortured, hungry and thirsty, suffering from pain, cold and heat, rain and snow, gnats, gadflies, ants, dust of the wind, and fierce animals.",
        "source": "T24n1451_012:0257c01_4"
    },
    {
        "source_sentence": "及諸惡觸種種諸惱無量無邊難可具說。",
        "translation": "It's difficult to explain in detail about the various kinds of bad touches and afflictions that are immeasurable and limitless.",
        "source": "T24n1451_012:0257c03_5"
    },
    {
        "source_sentence": "有情之類常在如是堅鞕苦中愛樂沈沒，諸有所欲苦為根本，不知棄捨更復追求，",
        "translation": "Sentient beings are constantly tormented by this kind of craving and pleasure. The suffering of desire is their root cause, but they do not abandon it or pursue it again.",
        "source": "T24n1451_012:0257c04_6"
    },
    {
        "source_sentence": "日夜煎迫身心被惱，內起燒然無有休息。",
        "translation": "Day and night, they're tormented, tormented in body and mind, and internally burned without resting.",
        "source": "T24n1451_012:0257c06_7"
    },
    {
        "source_sentence": "如是生苦、老苦、病苦、死苦、愛別離苦、怨憎會苦、求不得苦、五取陰苦，",
        "translation": "Thus, the suffering of birth is painful, the suffering of old age is painful, the suffering of illness is painful, the suffering of death is painful, the suffering of separation from loved ones is painful, the suffering of association with one’s enemies is painful, the suffering of not getting what one wishes is painful, and the suffering of the five aggregates of gras",
        "source": "T24n1451_012:0257c07_8"
    },
    {
        "source_sentence": "四威儀中行立坐臥亦皆是苦。",
        "translation": "The four comportments of walking, standing, sitting, and lying down are all painful.",
        "source": "T24n1451_012:0257c08_9"
    },
    {
        "source_sentence": "若常行時不立坐臥即受苦無樂，若常立時不行坐臥、若坐不行立臥、若臥不行立坐，",
        "translation": "If someone doesn't stand up and sit or lie down when they're always walking, they'll experience pain and no pleasure; if they stand up and don't sit or lie down when they're always standing, don't stand or lie down when they're sitting, don't stand or lie down when they're lying, and don't stand or sit when they're lying",
        "source": "T24n1451_012:0257c09_10"
    },
    {
        "source_sentence": "皆受極苦而無安樂。",
        "translation": "They all experience extreme pain but have no peace and comfort.",
        "source": "T24n1451_012:0257c11_11"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0257c11_12"
    },
    {
        "source_sentence": "此等皆是捨苦求苦，唯是苦生、唯是苦滅。",
        "translation": "These are all abandoning suffering and seeking suffering, only the arising of suffering and only the cessation of suffering.",
        "source": "T24n1451_012:0257c11_13"
    },
    {
        "source_sentence": "諸行因緣相續而起，如來了知，故說有情生死之法。",
        "translation": "Because conditioned forces arise in succession as causes and conditions, the Tathāgata knows them, so he explains the law of birth-and-death for sentient beings.",
        "source": "T24n1451_012:0257c12_14"
    },
    {
        "source_sentence": "諸行無常非真究竟，是變壞法不可保守，當求知足深生厭患勤求解脫。",
        "translation": "Conditions are impermanent and not truly perfect, which are dharmas that change and disintegrate and can't be guarded, so you should seek knowledge and fulfillment and deeply become disillusioned with them and diligently seek liberation.",
        "source": "T24n1451_012:0257c13_15"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0257c15_16"
    },
    {
        "source_sentence": "於善趣中有情之類，生處不淨苦劇如是，種種虛誑說不可盡，何況具說？",
        "translation": "Such are the kinds of sentient beings in good destinies who are born in places that are impure and painful, and these kinds of falsehoods can't be described in detail, so why wouldn't they be described in detail?",
        "source": "T24n1451_012:0257c15_17"
    },
    {
        "source_sentence": "於三惡趣餓鬼、傍生、地獄有情，所受楚毒難忍之苦。",
        "translation": "Sentient beings in the three evil destinies of hungry ghosts, unenlightened animals, and hells experience pain and suffering that's intolerable.",
        "source": "T24n1451_012:0257c17_18"
    },
    {
        "source_sentence": "「復次難陀！",
        "translation": "Furthermore, Nanda!",
        "source": "T24n1451_012:0257c19_0"
    },
    {
        "source_sentence": "有其四種入於母胎。",
        "translation": "There are four ways to enter the mother's womb.",
        "source": "T24n1451_012:0257c19_1"
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T24n1451_012:0257c19_2"
    },
    {
        "source_sentence": "一者有情正念入、正念住、正念出，二者正念入、正念住、不正念出，",
        "translation": "The first is that sentient beings enter with correct mindfulness, abide with correct mindfulness, and emerge with correct mindfulness. The second is that they enter with correct mindfulness, abide with correct mindfulness, and emerge without correct mindfulness.",
        "source": "T24n1451_012:0257c19_3"
    },
    {
        "source_sentence": "三者正念入、不正念住出，四者三皆不正念。",
        "translation": "Three, right mindfulness enters and doesn't abide in right mindfulness, and four, three, they all lack right mindfulness.",
        "source": "T24n1451_012:0257c21_4"
    },
    {
        "source_sentence": "誰是正念入、住、出？",
        "translation": "Who is this right mindfulness that enters, abides, and exits?",
        "source": "T24n1451_012:0257c22_5"
    },
    {
        "source_sentence": "如有一類凡夫有情，性愛持戒數習善品，樂為勝事作諸福行，極善防護恒思質直，",
        "translation": "Suppose there is a certain group of ordinary sentient beings who are naturally fond of observing precepts, repeatedly cultivating good qualities, delighting in performing meritorious deeds for superior reasons, being extremely well guarded and always thinking straightforwardly.",
        "source": "T24n1451_012:0257c22_6"
    },
    {
        "source_sentence": "不為放逸有大智慧，臨終無悔即更受生，或是七生預流、或是家家、或是一來、或是一間。",
        "translation": "Not because they're lazy and have great wisdom, they'll be born again without regret at the end of their life, whether it's a seven-birth stream or a family, a single coming, or a single room.",
        "source": "T24n1451_012:0257c24_7"
    },
    {
        "source_sentence": "此人由先修善行故，臨命過時雖苦來逼受諸痛惱，心不散亂正念而終。",
        "translation": "Because of having previously cultivated wholesome practices, that person's mind isn't distracted by right mindfulness and ends up suffering painful and distressing pain when he's approaching death, even though it's painful.",
        "source": "T24n1451_012:0257c26_8"
    },
    {
        "source_sentence": "復還正念入母胎內，了知諸法由業而生，皆從因緣而得生起，常與諸病作居止處。",
        "translation": "Again, when he enters his mother's womb with right mindfulness, he knows that all dharmas arise because of actions, are produced from causes and conditions, and always serve as a dwelling place for illnesses.",
        "source": "T24n1451_012:0257c28_9"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0258a01_10"
    },
    {
        "source_sentence": "應知此身恒是一切不淨窟宅，體非常住是愚癡物誘誑迷人，此身以骨而作機關，",
        "translation": "You should know that this body is always the abode of all impure caves. Their bodies do not abide permanently, but they belong to the ignorant and deluded. This body acts like a mechanical link with their bones.",
        "source": "T24n1451_012:0258a01_11"
    },
    {
        "source_sentence": "筋脈相連通諸孔穴，脂肉骨髓共相纏縛，以皮覆上不見其過，於熱窟中不淨充滿，",
        "translation": "Their tendons and veins are continuous, penetrating all the pores. fat, flesh, bones, and marrow are bound together, covered with skin that doesn’t show any sign of fault. It’s like a holy cave filled with impure water.",
        "source": "T24n1451_012:0258a03_12"
    },
    {
        "source_sentence": "髮毛爪齒分位差別，執我我所故恒被拘牽不得自在，常出涕唾穢污流汗，",
        "translation": "The hair, nails, teeth, and parts of the body are differentiated. Because they cling to self and what belongs to self, they are constantly bound and unable to master themselves. They always emit tears, spittle, filthy snot, and sweat.",
        "source": "T24n1451_012:0258a05_13"
    },
    {
        "source_sentence": "黃水痰癊爛壞脂膩，腎膽肝肺大腸小腸屎尿可惡，及諸虫類周遍充滿，",
        "translation": "It's filled with yellow water, phlegm, abscesses, rotten fat, decaying fat, kidneys, bile, liver, lungs, large intestines, small intestines, bad excrement, urine, and all kinds of insects.",
        "source": "T24n1451_012:0258a06_14"
    },
    {
        "source_sentence": "上下諸孔常流臭穢，生熟二藏蓋以薄皮，是謂行廁。",
        "translation": "The upper and lower pores always flow with foul odor, and the two stores of birth and maturation are covered with thin skin. This is called a walking toilet.",
        "source": "T24n1451_012:0258a08_15"
    },
    {
        "source_sentence": "汝應觀察！",
        "translation": "You should observe it!",
        "source": "T24n1451_012:0258a09_16"
    },
    {
        "source_sentence": "凡食噉時牙齒咀嚼，濕以涎唾咽入喉中，髓腦相和流津腹內，如犬咬枯骨妄生美想，",
        "translation": "Whenever he eats food, his teeth chew and chews it with their teeth; moisture enters his throat with saliva and spittle, and his marrow and brain are mixed together in his abdomen like a dog biting dry bones.",
        "source": "T24n1451_012:0258a09_17"
    },
    {
        "source_sentence": "食至臍間嘔逆覆上還復却咽。",
        "translation": "He eats it up to the navel and vomits, covers it upward, and then goes back down again.",
        "source": "T24n1451_012:0258a11_18"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0258a12_19"
    },
    {
        "source_sentence": "此身元從羯羅藍、頞部陀、閉尸、健南、鉢羅奢佉不淨穢物而得生長，",
        "translation": "This body grows from the unclean and filthy things of kalala, arbuda, kṣatriya, kiṃnara, and palāśaṭika.",
        "source": "T24n1451_012:0258a12_20"
    },
    {
        "source_sentence": "嬰兒流轉乃至老死輪迴繫縛，如黑闇坑如臭壞井，常以醎淡苦辛酸等食味而為資養。",
        "translation": "An infant that's bound by the transmigration of old age and death is like a pit in darkness or a foul-smelling well, which always feeds on such food flavors as salty, mild, painful, pungent, and so forth.",
        "source": "T24n1451_012:0258a14_21"
    },
    {
        "source_sentence": "又母腹火燒煮身根，不淨糞鍋常嬰熱苦，母若行立坐臥之時，如被五縛亦如火炙，",
        "translation": "Also, when the mother's womb is burned by fire and her body faculties are cooked, an impure pot of dung always suffers from feverish pain. When the mother walks, stands, sits, and lies down, it's like being bound by the five bonds or being roasted by fire.",
        "source": "T24n1451_012:0258a16_22"
    },
    {
        "source_sentence": "難可堪忍無能為喻。",
        "translation": "It's difficult to tolerate, and there's no metaphor for being able to do so.",
        "source": "T24n1451_012:0258a18_23"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0258a18_24"
    },
    {
        "source_sentence": "彼胎雖在如是糞穢坑中眾多苦切，由利根故心不散亂。",
        "translation": "Even though that fetus is in such a pit of excrement, it's full of pain and suffering, and because its faculties are sharp, its mind isn't distracted.",
        "source": "T24n1451_012:0258a18_25"
    },
    {
        "source_sentence": "復有一類薄福有情，在母腹內或橫或倒，由其先業因緣力故，或由母食冷熱、醎酸、甘辛、苦味不善調故，",
        "translation": "“Furthermore, some sentient beings with little virtue are lying in their mother’s womb, either horizontally or vertically, due to the power of the causes and conditions created by previous deeds. Or they may be feeding on food that is cold and hot, salty and pungent, sweet and pungent, and has a painful taste but not well controlled.",
        "source": "T24n1451_012:0258a20_26"
    },
    {
        "source_sentence": "或飲漿水過量、或多行婬欲、或饒疾病、或懷愁惱、或時倒地、或被打拍。",
        "translation": "Sometimes they drink too much water, sometimes they indulge in sexual desire, sometimes they become ill, sometimes they harbor sorrow, sometimes they fall to the ground, sometimes they are beaten and beaten.",
        "source": "T24n1451_012:0258a22_27"
    },
    {
        "source_sentence": "由是等緣母身壯熱，由身熱故胎亦燒然，由燒然故受諸苦惱，由有苦故便即動轉，",
        "translation": "Because of these conditions, the mother’s body becomes intensely hot. Because of this heat, the embryo is also burned; because of being burned, it experiences various painful and unpleasant sensations.",
        "source": "T24n1451_012:0258a23_28"
    },
    {
        "source_sentence": "由動轉故或身橫覆不能得出。",
        "translation": "It's because they move, or their bodies may be covered and unable to escape.",
        "source": "T24n1451_012:0258a25_29"
    },
    {
        "source_sentence": "有善解女人以酥油塗手內穢孔中，緩緩觸胎令安本處。",
        "translation": "Suppose there's a woman of good understanding who rubs her hand with butter and oil into a dirty pore, touches the womb slowly and gently, and makes it settle in its original place.",
        "source": "T24n1451_012:0258a26_30"
    },
    {
        "source_sentence": "手觸著時胎子即便受大苦惱。",
        "translation": "When he touches it with his hand, the fetus will experience great pain and suffering.",
        "source": "T24n1451_012:0258a27_31"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0258a28_32"
    },
    {
        "source_sentence": "譬如幼小男女，人以利刀削破皮肉、散灰於上，由斯便有大苦惱生。",
        "translation": "It's like a young man or woman who uses a sharp sword to cut through skin and flesh and scatter ashes on top of it, which causes great pain and suffering to arise.",
        "source": "T24n1451_012:0258a28_33"
    },
    {
        "source_sentence": "胎子楚毒亦復如是，雖受此痛由利根故正念不散。",
        "translation": "The foetal pain and poison are also like this: although they experience this pain, due to their sharp faculties right mindfulness does not disperse.",
        "source": "T24n1451_012:0258b01_34"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0258b02_35"
    },
    {
        "source_sentence": "此胎如是住母腹中受如斯苦。",
        "translation": "This womb thus abides in its mother's womb and experiences such pain.",
        "source": "T24n1451_012:0258b02_36"
    },
    {
        "source_sentence": "又欲產時辛苦而出，由彼業風令手交合，支節拳縮受大劇苦，欲出母胎身體青瘀，",
        "translation": "Also, when they want to give birth, they must go out in pain. Because the wind of karma causes their hands to interlock with each other, and as their limbs and fists contract, they experience great pain.",
        "source": "T24n1451_012:0258b03_37"
    },
    {
        "source_sentence": "猶如初腫難可觸著，飢渴逼迫心懸熱惱。",
        "translation": "It's like the first swelling that's difficult to touch, which is oppressed by hunger and thirst and hung in the mind with feverish distress.",
        "source": "T24n1451_012:0258b05_38"
    },
    {
        "source_sentence": "由業因緣被風推出，既出胎已被外風觸如割塗灰，手衣觸時皆受極苦。",
        "translation": "Because of the causes and conditions of karma, they are driven out by wind. Having emerged from the womb and been touched by an external wind, they are like cutting off coated ashes; and when their hands and clothes are touched, they all experience extreme pain.",
        "source": "T24n1451_012:0258b06_39"
    },
    {
        "source_sentence": "雖受此苦，由上利根故正念不亂，於母腹中知入、住、出悉皆是苦。",
        "translation": "Even though they experience this pain, because of their sharp faculties, they correctly think and aren't disturbed, and in their mother's womb they know that entry, abiding, and exit are all painful.",
        "source": "T24n1451_012:0258b07_40"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0258b09_41"
    },
    {
        "source_sentence": "誰當樂入如是胎中？",
        "translation": "Who will be happy to enter such a womb?",
        "source": "T24n1451_012:0258b09_42"
    },
    {
        "source_sentence": "「難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0258b10_0"
    },
    {
        "source_sentence": "誰是於母腹正念入住、不正念出？",
        "translation": "Who is it that enters in the mother's womb with right mindfulness and exits without right mindfulness?",
        "source": "T24n1451_012:0258b10_1"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0258b10_2"
    },
    {
        "source_sentence": "如有一類凡夫有情，性樂持戒修習善品，常為勝事作諸福行，其心質直不為放逸，",
        "translation": "Suppose there is a certain group of ordinary sentient beings who are naturally delighted with observing precepts and cultivating good qualities, always doing meritorious deeds for superior reasons. Their minds are honest and straightforward, without laxity.",
        "source": "T24n1451_012:0258b11_0"
    },
    {
        "source_sentence": "少有智慧臨終無悔，或是七生預流、或是家家、或是一來、或是一間。",
        "translation": "They have little wisdom and no regrets at the end of their life, whether they're born in seven pre-flows, or at home, or once-returner, or a single person.",
        "source": "T24n1451_012:0258b12_1"
    },
    {
        "source_sentence": "此人先修善行，臨命終時雖苦來逼，受諸痛惱心不散亂。",
        "translation": "When this person first cultivates good conduct, even though they're tormented by suffering at the time of their death, they experience pain and distress and don't have a distracted mind.",
        "source": "T24n1451_012:0258b14_2"
    },
    {
        "source_sentence": "復還正念入母胎中，了知諸法由業而生，皆從因緣而得生起，廣說如上。",
        "translation": "Again, when he enters his mother's womb with right mindfulness, he knows that all dharmas arise because of actions, and they all arise from causes and conditions, as explained above.",
        "source": "T24n1451_012:0258b15_3"
    },
    {
        "source_sentence": "乃至出胎，雖受如是諸極苦楚，由是中利根故，入住正念、不正念出，",
        "translation": "Even though he leaves the womb, even though he experiences such extreme pain and suffering, it's because of his sharp faculties that he enters right mindfulness and doesn't exit right mindfulness.",
        "source": "T24n1451_012:0258b17_4"
    },
    {
        "source_sentence": "廣說如上。",
        "translation": "It's explained in detail as above.",
        "source": "T24n1451_012:0258b18_5"
    },
    {
        "source_sentence": "乃至誰當樂入如是胎中？",
        "translation": "Who will be happy to enter such a womb?",
        "source": "T24n1451_012:0258b19_6"
    },
    {
        "source_sentence": "「難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0258b20_0"
    },
    {
        "source_sentence": "誰是正念入胎、不正住出？",
        "translation": "Who is it that enters the womb with right mindfulness and exits without right abode?",
        "source": "T24n1451_012:0258b20_1"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0258b20_2"
    },
    {
        "source_sentence": "如有一類凡夫有情，性樂持戒修習善品，常為勝事作諸福行，廣說如上。",
        "translation": "Suppose there's a certain type of ordinary sentient being who naturally enjoys observing precepts and cultivating good qualities, always doing meritorious actions for superior things, as explained above.",
        "source": "T24n1451_012:0258b20_3"
    },
    {
        "source_sentence": "乃至臨終無悔，或是七生預流等，臨命終時眾苦來逼，雖受痛苦心不散亂，",
        "translation": "At the moment of dying, various pains come and oppress them. Although they experience pain, their awarenesses are not disturbed:",
        "source": "T24n1451_012:0258b22_4"
    },
    {
        "source_sentence": "復還正念入母胎中。",
        "translation": "Again, he entered his mother's womb with correct mindfulness.",
        "source": "T24n1451_012:0258b24_5"
    },
    {
        "source_sentence": "由是下利根故，入胎時知、住出不知，廣說如上。",
        "translation": "Because of these minor sharp faculties, they are known when entering the womb and do not know when abiding in or emerging from it: as explained above.",
        "source": "T24n1451_012:0258b24_6"
    },
    {
        "source_sentence": "乃至誰當樂入如是胎中？",
        "translation": "Who will be happy to enter such a womb?",
        "source": "T24n1451_012:0258b25_7"
    },
    {
        "source_sentence": "「難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0258b27_0"
    },
    {
        "source_sentence": "誰是入住出俱不正念？",
        "translation": "Who is neither entering nor leaving without right mindfulness?",
        "source": "T24n1451_012:0258b27_1"
    },
    {
        "source_sentence": "如有一類凡夫有情，樂毀淨戒不修善品，常為惡事作諸惡行，心不質直多行放逸，",
        "translation": "Suppose there is a certain group of ordinary sentient beings who delight in disparaging the pure precepts and not cultivating good qualities, always engaging in bad actions for evil purposes, their minds not being honest and often indulging in laziness.",
        "source": "T24n1451_012:0258b27_2"
    },
    {
        "source_sentence": "無有智慧貪財慳悋，手常拳縮不能舒展濟惠於人，恒有希望心不調順，",
        "translation": "They have no wisdom, are greedy for property and stingy with  avarice; their hands always clenched in folded fist. They cannot extend assistance to others. They always have hopes but do not follow them.",
        "source": "T24n1451_012:0258b29_3"
    },
    {
        "source_sentence": "見行顛倒。",
        "translation": "views and practices are mistaken.",
        "source": "T24n1451_012:0258c02_4"
    },
    {
        "source_sentence": "臨終悔恨，諸不善業皆悉現前。",
        "translation": "At the end of his life, he repents and resented, and all unwholesome actions are fully manifested.",
        "source": "T24n1451_012:0258c02_5"
    },
    {
        "source_sentence": "當死之時猛利楚毒，痛惱逼切其心散亂，由諸苦惱不自憶識：我是何人？",
        "translation": "At the time of death, they're intensely painful and vexing, tormented by pain and distress, and their minds are distracted, and because of these pains and distress, they don't remember for themselves who I am.",
        "source": "T24n1451_012:0258c03_6"
    },
    {
        "source_sentence": "從何而來？",
        "translation": "Where did it come from?",
        "source": "T24n1451_012:0258c04_7"
    },
    {
        "source_sentence": "今何處去？",
        "translation": "Where are you going now?",
        "source": "T24n1451_012:0258c05_0"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0258c05_1"
    },
    {
        "source_sentence": "是謂三時皆無正念，廣說如上。",
        "translation": "These are said to be the three moments when there is no right mindfulness at all:",
        "source": "T24n1451_012:0258c05_2"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0258c06_3"
    },
    {
        "source_sentence": "此諸有情生在人中，雖有如是無量苦惱，然是勝處，於無量百千俱胝劫中人身難得。",
        "translation": "Although these sentient beings are born among humans and experience such measureless suffering, this is a superior place where it's difficult to obtain a human body for measureless hundreds of thousands of koṭis of eons.",
        "source": "T24n1451_012:0258c06_4"
    },
    {
        "source_sentence": "若生天上常畏墜墮有愛別離苦，命欲終時餘天告言：『願汝當生世間善趣。』",
        "translation": "If someone is born in heaven, they're always afraid of falling into the pain of separation from craving and separation, and when their life wants to end, other gods tell them, 'May you be born in a good destiny in the world.'",
        "source": "T24n1451_012:0258c08_5"
    },
    {
        "source_sentence": "云何世間善趣？",
        "translation": "What are the worldly good destinies?",
        "source": "T24n1451_012:0258c09_6"
    },
    {
        "source_sentence": "謂是人天。",
        "translation": "It means it's humans and gods.",
        "source": "T24n1451_012:0258c10_7"
    },
    {
        "source_sentence": "人趣難得，遠離難處更復是難。",
        "translation": "The human destinies are difficult to attain, and it's even more difficult to be far from the difficult places.",
        "source": "T24n1451_012:0258c10_8"
    },
    {
        "source_sentence": "云何惡趣？",
        "translation": "What are the evil destinies?",
        "source": "T24n1451_012:0258c11_9"
    },
    {
        "source_sentence": "謂三惡道。",
        "translation": "They are the three bad destinies.",
        "source": "T24n1451_012:0258c11_10"
    },
    {
        "source_sentence": "地獄趣者常受苦切極不如意，猛利楚毒難可譬喻。",
        "translation": "The rebirth in hell is always painful and extremely unwholesome, intense and difficult to describe.",
        "source": "T24n1451_012:0258c11_11"
    },
    {
        "source_sentence": "餓鬼趣者性多瞋恚無柔軟心，諂誑殺害以血塗手無有慈悲，形容醜陋見者恐怖，",
        "translation": "The realm of hungry ghosts is by nature filled with hatred and wickedness. They have no compassion for flattery, cruelty, killing, or rubbing blood on their hands. They look ugly but those who see them are afraid.",
        "source": "T24n1451_012:0258c12_12"
    },
    {
        "source_sentence": "設近於人受飢渴苦恒被障礙。",
        "translation": "Suppose he's near a person who suffers from hunger and thirst and is constantly hindered.",
        "source": "T24n1451_012:0258c14_13"
    },
    {
        "source_sentence": "傍生趣者無量無邊作無義行、無福行、無法行、無善行、無淳質行，互相食噉強者[夌*欠]弱，",
        "translation": "The destinies of animals are infinite and boundless, engaged in meaningless actions, without good actions, without virtuous actions, without non-existent actions, without good actions, without simple and substantial actions. They feed on each other with coarseness and weakness, while the strong [coarse*deficiency] is weak.",
        "source": "T24n1451_012:0258c15_14"
    },
    {
        "source_sentence": "有諸傍生若生、若長、若死，皆在闇中不淨糞屎垢穢之處，或時暫明，",
        "translation": "If there are animals that arise, grow long, and die, they're all in the darkness, where impure dung and excrement stain them, or sometimes it's temporarily clear.",
        "source": "T24n1451_012:0258c17_15"
    },
    {
        "source_sentence": "所謂蜂蝶、蚊蟻、蚤虱、蛆蟲之類，自餘復有無量無邊生長常闇。",
        "translation": "The so-called bees, butterflies, mosquitoes, ants, fleas, lice, maggots, and other kinds of insects are also immeasurable and limitless, growing in constant darkness.",
        "source": "T24n1451_012:0258c18_16"
    },
    {
        "source_sentence": "由彼先世是愚癡人，不聽經法恣身語意，貪著五欲造眾惡事，生此類中受愚迷苦。",
        "translation": "Because in a previous life, they were ignorant people who didn't listen to the sūtras and dharmas, indulged in bodily or verbal actions, became attached to the five desires, created numerous bad things, and were born among these kinds of people who suffered from ignorance and delusion.",
        "source": "T24n1451_012:0258c20_17"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0258c22_18"
    },
    {
        "source_sentence": "復有無量無邊傍生有情，生長及死皆在水中，所謂魚鼈、黿鼉、鱓蛭、蚌蛤、蝦蟇之類，",
        "translation": "Again, there are measureless and limitless sentient beings in the water who grow up and die—the so-called sea turtles, crocodiles, leech moths, frogs, and frogs.",
        "source": "T24n1451_012:0258c22_19"
    },
    {
        "source_sentence": "由先世業身語意惡如上廣說。",
        "translation": "It's because of the badness of past actions, body, speech, and thought as explained above.",
        "source": "T24n1451_012:0258c24_20"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0258c24_21"
    },
    {
        "source_sentence": "復有無量無邊傍生有情，聞屎尿香速往其處以為食飲，所謂猪羊、雞犬、狐狢、鵰鷲、烏蠅、蜣蜋、禽獸之類，",
        "translation": "Also, there are countless and limitless sentient beings who hear the fragrance of excrement and urine and quickly go to that place for food and drink, such as pigs, sheep, chickens, dogs, foxes, eagles, eagles, crows, flies, ducks, birds, and other animals.",
        "source": "T24n1451_012:0258c25_22"
    },
    {
        "source_sentence": "皆由先世惡業所招受如是報。",
        "translation": "It's all the result of bad actions in previous lives that brought about such rewards.",
        "source": "T24n1451_012:0258c27_23"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0258c28_24"
    },
    {
        "source_sentence": "復有無量無邊傍生之類，常以草木及諸不淨充其飲食，所謂象馬、駝牛、驢騾之屬，",
        "translation": "There are also innumerable and limitless animals that feed on grass, trees, and other impure things like elephants, horses, camels, cattle, mules, and the like.",
        "source": "T24n1451_012:0258c28_25"
    },
    {
        "source_sentence": "乃至命終，由先惡業受如是報。",
        "translation": "At the end of their life, they'll experience such a retribution because of bad actions in previous lives.",
        "source": "T24n1451_012:0259a01_26"
    },
    {
        "source_sentence": "「復次難陀！",
        "translation": "Furthermore, Nanda!",
        "source": "T24n1451_012:0259a02_0"
    },
    {
        "source_sentence": "生死有海苦哉！",
        "translation": "There's an ocean of suffering in birth and death!",
        "source": "T24n1451_012:0259a02_1"
    },
    {
        "source_sentence": "痛哉！",
        "translation": "That's painful!",
        "source": "T24n1451_012:0259a02_2"
    },
    {
        "source_sentence": "猛焰燒然極大炎熱，無一眾生不被燒煮，斯等皆由眼耳鼻舌身意熾盛猛火，",
        "translation": "No sentient being is left to be burned or cooked by that intense fire. All this is due to the blazing fire of the eyes, ears, nose, tongue, body, and mind.",
        "source": "T24n1451_012:0259a02_3"
    },
    {
        "source_sentence": "貪求前境色聲香味觸法。",
        "translation": "They crave the prior objects, form, sound, odor, taste, and tactile dharmas.",
        "source": "T24n1451_012:0259a04_4"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0259a05_5"
    },
    {
        "source_sentence": "云何名為熾盛猛火？",
        "translation": "What's called a blazing, fierce fire?",
        "source": "T24n1451_012:0259a05_6"
    },
    {
        "source_sentence": "謂是貪瞋癡火、生老病死火、憂悲苦惱毒害之火，常自燒然無一得免。",
        "translation": "It means that the fire of greed, anger, delusion, birth, old age, illness, and death, grief, sorrow, pain, vexation, and poisonousness are always burned by themselves, but there's no one to be spared.",
        "source": "T24n1451_012:0259a05_7"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0259a07_8"
    },
    {
        "source_sentence": "懈怠之人多受眾苦，煩惱嬰纏作不善法，輪迴不息生死無終。",
        "translation": "Lazy people often experience various kinds of suffering, are tethered by afflictions and unwholesome dharmas, and transmigrate in birth-and-death without cessation with no end.",
        "source": "T24n1451_012:0259a07_9"
    },
    {
        "source_sentence": "勤策之人多受安樂，發勇猛心斷除煩惱，修習善法不捨善軛無休息時。",
        "translation": "A diligent person often experiences well-being, arouses a courageous mind to remove afflictions, cultivates good qualities, doesn't abandon good deeds, and doesn't rest at the right time.",
        "source": "T24n1451_012:0259a08_10"
    },
    {
        "source_sentence": "是故汝今應觀此身，皮肉筋骨血脈及髓不久散壞，常當一心勿為懈息，",
        "translation": "That is why you should now observe that this body, skin, flesh, tendons, bones, blood vessels, and marrow will soon disintegrate. You should always be singleminded and not lazy.",
        "source": "T24n1451_012:0259a10_11"
    },
    {
        "source_sentence": "未證得者勤求證悟，如是應學。",
        "translation": "Those who haven't yet realized it should diligently seek to realize awakening, and they should train in this way.",
        "source": "T24n1451_012:0259a12_12"
    },
    {
        "source_sentence": "「難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0259a12_13"
    },
    {
        "source_sentence": "我不共世間作諸諍論，然而世間於我強為諍論。",
        "translation": "I don't make arguments with the world, but the world forcibly creates arguments against me.",
        "source": "T24n1451_012:0259a13_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1451_012:0259a14_1"
    },
    {
        "source_sentence": "諸知法者不與他諍，離我我所共誰為諍？",
        "translation": "Those who know the teaching don't argue with others, and who argues with them apart from self and what belongs to self?",
        "source": "T24n1451_012:0259a14_2"
    },
    {
        "source_sentence": "由無見解起妄執故，我證正覺作如是語：『我於諸法無不了知。』",
        "translation": "Because of the absence of views and understanding that give rise to deluded attachment, I realize right awakening and say, 'I don't know anything about things.'",
        "source": "T24n1451_012:0259a15_3"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0259a16_4"
    },
    {
        "source_sentence": "我所言說有差異不？」",
        "translation": "Is there a difference between what I say and what I teach?",
        "source": "T24n1451_012:0259a16_5"
    },
    {
        "source_sentence": "難陀言：「不也。",
        "translation": "Nanda said, No.",
        "source": "T24n1451_012:0259a17_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T24n1451_012:0259a17_7"
    },
    {
        "source_sentence": "如來說者無有差異。」",
        "translation": "The Tathāgata teaches that there's no difference.",
        "source": "T24n1451_012:0259a17_8"
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T24n1451_012:0259a18_9"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0259a18_10"
    },
    {
        "source_sentence": "如來所說必無差異，如來是真語者、實語者、如語者、不異語者、不誑語者，",
        "translation": "Whatever the Tathāgata teaches, there must be no difference. The Tathāgata is someone who speaks what is true, someone who speaks what is true, someone who speaks what is true, someone who speaks what is true, someone who speaks what is true, someone who speaks what is not different, and someone who speaks what is not false.",
        "source": "T24n1451_012:0259a18_11"
    },
    {
        "source_sentence": "欲令世間長夜安樂獲大勝利，是知道者、是識道者、是說道者、是開道者、是大導師，",
        "translation": "Those who want to cause the world to live in peace and attain great benefit for a long time will be those who know, those who are on the path of consciousness, those who teach the path, those who initiate the path, and those who are great leaders.",
        "source": "T24n1451_012:0259a20_12"
    },
    {
        "source_sentence": "如來、應、正等覺、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "The Tathāgata, Arhat, Completely Awakened One, Perfect in Knowledge and Conduct, Well-gone One, Knower of the World, Unsurpassed One, Tamer of Humans, Teacher of Devas and Humans, Buddha, Bhagavān.",
        "source": "T24n1451_012:0259a22_13"
    },
    {
        "source_sentence": "世間之人無知無信，常與諸根而為奴僕，唯見掌中不觀大利，易事不修難者恒作。",
        "translation": "People in the world lack knowledge and faith, always giving their faculties as slaves, only seeing what's in their palms doesn't contemplate great benefits, and those who do easy things and don't cultivate difficulties are always doing them.",
        "source": "T24n1451_012:0259a23_14"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0259a25_15"
    },
    {
        "source_sentence": "且止如斯智慧境界，汝今應以肉眼所見而觀察之，知所見者皆是虛妄即名解脫。",
        "translation": "If you stop at such a sphere of wisdom, you should now observe it with the physical eye and see it, knowing that whatever you see is false, which is called liberation.",
        "source": "T24n1451_012:0259a25_16"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0259a27_17"
    },
    {
        "source_sentence": "汝莫信我、莫隨我欲、莫依我語、莫觀我相、莫隨沙門所有見解、莫於沙門而生恭敬、莫作是語：『沙門喬答摩是我大師。』",
        "translation": "Don't believe in me, don't follow my desires, don't rely on my words, don't contemplate my characteristics, don't follow the views and understandings of ascetics, don't give respect to ascetics, and don't say, 'The ascetic Gautama is my teacher.'",
        "source": "T24n1451_012:0259a27_18"
    },
    {
        "source_sentence": "然而但可於我自證所得之法，獨在靜處思量觀察，常多修習，隨於用心所觀之法，",
        "translation": "They can, however, think and contemplate about the teachings they themselves have attained through their own realization in a quiet place. They should always cultivate practice of those teachings according to what they are perceived by their minds.",
        "source": "T24n1451_012:0259b01_19"
    },
    {
        "source_sentence": "即於彼法觀想成就正念而住。",
        "translation": "That is, he observes and perceives those dharmas and accomplishes right mindfulness while abiding there.",
        "source": "T24n1451_012:0259b03_20"
    },
    {
        "source_sentence": "自為洲渚、自為歸處，法為洲渚、法為歸處，無別洲渚無別歸處。",
        "translation": "The self is a continent and a place of refuge, the Dharma is a continent and the Dharma is a place of refuge, and there's no separate continent or island and no separate place of refuge.",
        "source": "T24n1451_012:0259b04_0"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0259b05_1"
    },
    {
        "source_sentence": "云何苾芻自為洲渚、自為歸處，法為洲渚、法為歸處，無別洲渚無別歸處，",
        "translation": "How does a monk make his own continents and bases of refuge for himself? The Dharma is what makes his continents and bases of refuge, and the Dharma is what makes his bases of refuge. There are no separate continents or bases of refuge for him.",
        "source": "T24n1451_012:0259b05_2"
    },
    {
        "source_sentence": "如是難陀！",
        "translation": "So it is, Nanda!",
        "source": "T24n1451_012:0259b07_3"
    },
    {
        "source_sentence": "若有苾芻，於自內身隨觀而住，勤勇繫念得正解了，於諸世間所有恚惱常思調伏，",
        "translation": "“Suppose there is a monk who, while observing his own internal body, diligently and courageously keeps it in mind and attains right understanding. He always reflects on and subdues all worldly disputes and controversies.",
        "source": "T24n1451_012:0259b07_4"
    },
    {
        "source_sentence": "是謂隨觀內身是苦。",
        "translation": "This is called following the contemplation that the internal body is painful.",
        "source": "T24n1451_012:0259b09_5"
    },
    {
        "source_sentence": "若觀外身及內外身亦復如是。",
        "translation": "If he observes the external body and the internal and external bodies, it's likewise.",
        "source": "T24n1451_012:0259b09_6"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0259b10_7"
    },
    {
        "source_sentence": "次於集法觀身而住、觀滅而住，復於集滅二法觀身而住，即於此身能為正念，",
        "translation": "“Furthermore, he dwells in contemplation of the body regarding the law in relation to accumulation and in contemplation of cessation. He also dwells in contemplation of the body regarding the twofold doctrine in relation to accumulation and cessation. In this very body he is able to act with right mindfulness.",
        "source": "T24n1451_012:0259b10_8"
    },
    {
        "source_sentence": "或但有智、或但有見、或但有念，無依而住，於此世間知無可取。",
        "translation": "They may only have knowledge, or they may only have views, or they may only have thoughts, and they abide without support, knowing that there's nothing to grasp in this world.",
        "source": "T24n1451_012:0259b12_9"
    },
    {
        "source_sentence": "如是難陀！",
        "translation": "So it is, Nanda!",
        "source": "T24n1451_012:0259b13_10"
    },
    {
        "source_sentence": "是謂苾芻於自內身隨觀而住。",
        "translation": "This is called a monk who follows the contemplation of his own internal body.",
        "source": "T24n1451_012:0259b14_11"
    },
    {
        "source_sentence": "外身、內外身為觀亦爾。",
        "translation": "So it is with the contemplation of the external body and the internal and external bodies.",
        "source": "T24n1451_012:0259b14_12"
    },
    {
        "source_sentence": "次觀內受、外受及內外受而住，觀內心、外心及內外心而住，觀內法、外法及內外法而住。",
        "translation": "Next, he observes internal feelings, external feelings, and internal and external feelings that abide, observes internal feelings, external feelings, and internal and external feelings that abide, observes internal feelings, external feelings, and internal and external feelings that abide, and observes internal dharmas, external dharmas, and internal and external dharmas that abide.",
        "source": "T24n1451_012:0259b15_13"
    },
    {
        "source_sentence": "勤勇繫念得正解了，於諸世間所有恚惱常思調伏，觀集法住、觀滅法住，",
        "translation": "“Great enlightening beings practice dedication and resolve, concentrating their thoughts on attaining right understanding. They always contemplate and subdue all worldly disputes and controversies, observing the principles of accumulation and the principles of cessation.",
        "source": "T24n1451_012:0259b17_14"
    },
    {
        "source_sentence": "復於集滅二法觀法而住，即於此身能為正念，或但有智、或但有見、或但有念，",
        "translation": "“Furthermore, when he dwells on the two kinds of dharmas of accumulation and cessation and contemplates those dharmas, that person’s body is capable of right mindfulness, whether only with knowledge, or with insight, or with mindfulness.",
        "source": "T24n1451_012:0259b19_15"
    },
    {
        "source_sentence": "於此世間知無可取。",
        "translation": "In this world, they know there's nothing to grasp.",
        "source": "T24n1451_012:0259b20_16"
    },
    {
        "source_sentence": "如是難陀！",
        "translation": "So it is, Nanda!",
        "source": "T24n1451_012:0259b21_17"
    },
    {
        "source_sentence": "是謂苾芻自為洲渚、自為歸處，法為洲渚、法為歸處，無別洲渚無別歸處。",
        "translation": "This is to say that a monk makes his own islands and bases of refuge for himself, the Dharma as an island and the Dharma as a base of refuge, and there are no separate islands or bases of refuge for him.",
        "source": "T24n1451_012:0259b21_18"
    },
    {
        "source_sentence": "「難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0259b23_19"
    },
    {
        "source_sentence": "若有丈夫稟性質直遠離諂誑，於晨朝時來至我所，我以善法隨機教示，",
        "translation": "Suppose there’s a man of noble character who is free from hypocrisy and deceitfulness. In the morning he comes to me, and I teach him the Dharma according to his capacities by means of skillful means.",
        "source": "T24n1451_012:0259b23_20"
    },
    {
        "source_sentence": "彼至暮時自陳所得；",
        "translation": "At dusk they present what they have obtained.",
        "source": "T24n1451_012:0259b25_21"
    },
    {
        "source_sentence": "暮以法教、旦陳所得。",
        "translation": "In the evening, it's because of the Dharma teachings and the attainments of Dan Chen.",
        "source": "T24n1451_012:0259b25_22"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0259b26_23"
    },
    {
        "source_sentence": "我之善法現得證悟，能除熱惱善應時機，易為方便是自覺法，善為覆護親對我前，",
        "translation": "My good qualities are now realized, and I am able to remove feverish feelings. Good deeds can be done according to the [proper] opportunity. This is my method of self-realization (i.e., enlightenment).",
        "source": "T24n1451_012:0259b26_24"
    },
    {
        "source_sentence": "聞所說法順於寂靜，能趣菩提是我所知。",
        "translation": "I've heard the teaching that follows quiescence and can lead to enlightenment, which is known to me.",
        "source": "T24n1451_012:0259b28_25"
    },
    {
        "source_sentence": "是故汝今見有自利、見有他利及二俱利，如是等法應常修學，於出家法謹慎行之勿令空過，",
        "translation": "Therefore, you now see that there is benefit for yourself, benefit for others, and both benefits for both. Such things should always be cultivated by you. Be careful not to neglect the practice of renunciant monasticism.",
        "source": "T24n1451_012:0259b29_0"
    },
    {
        "source_sentence": "當獲勝果無為安樂，受他供給衣食臥具病藥等物，令其施主獲大福利，",
        "translation": "They'll attain the ultimate realization of unconstructed peace and comfort, accepting other people's offerings of clothing, food, bedding, medicine for illness, and other things that will cause their donor to attain great benefit.",
        "source": "T24n1451_012:0259c02_1"
    },
    {
        "source_sentence": "得勝果報尊貴廣大。",
        "translation": "The reward for attaining superiority is so great that it's noble and vast.",
        "source": "T24n1451_012:0259c03_2"
    },
    {
        "source_sentence": "如是難陀！",
        "translation": "So it is, Nanda!",
        "source": "T24n1451_012:0259c04_3"
    },
    {
        "source_sentence": "應當修學。",
        "translation": "You should cultivate it.",
        "source": "T24n1451_012:0259c04_4"
    },
    {
        "source_sentence": "「復次難陀！",
        "translation": "Furthermore, Nanda!",
        "source": "T24n1451_012:0259c05_0"
    },
    {
        "source_sentence": "未有一色是可愛樂，能於後時不變壞者，無有是處；",
        "translation": "There is no such thing as a form that is delightful and capable of not changing or disintegrating at any time later.",
        "source": "T24n1451_012:0259c05_1"
    },
    {
        "source_sentence": "不起憂悲不生煩惱者，亦無是處。",
        "translation": "Nor is there a place for someone who doesn't give rise to grief and pity and doesn't give rise to afflictions.",
        "source": "T24n1451_012:0259c06_2"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0259c07_3"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T24n1451_012:0259c07_4"
    },
    {
        "source_sentence": "此色是常為是無常？」",
        "translation": "Is this form permanent or impermanent?",
        "source": "T24n1451_012:0259c07_5"
    },
    {
        "source_sentence": "「大德！",
        "translation": "“O great virtuous one!",
        "source": "T24n1451_012:0259c08_6"
    },
    {
        "source_sentence": "體是無常。」",
        "translation": "The essence is impermanent.",
        "source": "T24n1451_012:0259c08_7"
    },
    {
        "source_sentence": "「難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0259c08_8"
    },
    {
        "source_sentence": "體既無常，為是苦不？」",
        "translation": "Since the essence is impermanent, is it painful?",
        "source": "T24n1451_012:0259c08_9"
    },
    {
        "source_sentence": "「大德！",
        "translation": "“O great virtuous one!",
        "source": "T24n1451_012:0259c09_10"
    },
    {
        "source_sentence": "是苦。」",
        "translation": "It's painful.",
        "source": "T24n1451_012:0259c09_11"
    },
    {
        "source_sentence": "「若無常苦，即變壞法。",
        "translation": "“If impermanent suffering is painful, it’s the law of change and disintegration.",
        "source": "T24n1451_012:0259c09_12"
    },
    {
        "source_sentence": "我諸多聞聖弟子眾，計色是我、我有諸色、色屬於我、我在色中不？」",
        "translation": "Among the well-versed noble disciples of mine, do you think that form is self, that I have forms, that form belongs to me, and that I am in form?",
        "source": "T24n1451_012:0259c09_13"
    },
    {
        "source_sentence": "白言：「不也。",
        "translation": "He said, No.",
        "source": "T24n1451_012:0259c11_14"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T24n1451_012:0259c11_15"
    },
    {
        "source_sentence": "「於汝意云何？",
        "translation": "“What do you think?",
        "source": "T24n1451_012:0259c11_16"
    },
    {
        "source_sentence": "受想行識是常無常？」",
        "translation": "Is feeling, perception, volition, and consciousness permanent and impermanent?",
        "source": "T24n1451_012:0259c11_17"
    },
    {
        "source_sentence": "「大德！",
        "translation": "“O great virtuous one!",
        "source": "T24n1451_012:0259c12_18"
    },
    {
        "source_sentence": "皆是無常。」",
        "translation": "They are all impermanent.",
        "source": "T24n1451_012:0259c12_19"
    },
    {
        "source_sentence": "「難陀！",
        "translation": "Nanda!",
        "source": "T24n1451_012:0259c12_20"
    },
    {
        "source_sentence": "體既無常，為是苦不？」",
        "translation": "Since the essence is impermanent, is it painful?",
        "source": "T24n1451_012:0259c12_21"
    },
    {
        "source_sentence": "「大德！",
        "translation": "“O great virtuous one!",
        "source": "T24n1451_012:0259c13_22"
    },
    {
        "source_sentence": "是苦。」",
        "translation": "It's painful.",
        "source": "T24n1451_012:0259c13_23"
    },
    {
        "source_sentence": "「若無常苦，即變壞法。",
        "translation": "“If impermanent suffering is painful, it’s the law of change and disintegration.",
        "source": "T24n1451_012:0259c13_24"
    },
    {
        "source_sentence": "我諸多聞聖弟子眾，計受等是我、我有受等、受等屬我、我在受等中不？」",
        "translation": "Among the well-versed noble disciples of mine, do they think that feelings and so forth are self, self, feelings and so forth, feelings and so forth belong to me, or am I in feelings and so forth?",
        "source": "T24n1451_012:0259c14_25"
    },
    {
        "source_sentence": "「不也。",
        "translation": "“No, they won’t.",
        "source": "T24n1451_012:0259c15_26"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T24n1451_012:0259c15_27"
    },
    {
        "source_sentence": "「是故應知凡是諸色，若過去、若未來、若現在，若內、若外、若麁、若細，",
        "translation": "“Therefore, you should know that all things are forms, whether past, future, or present, internal, external, coarse, or fine.",
        "source": "T24n1451_012:0259c15_28"
    },
    {
        "source_sentence": "若勝、若劣、若遠、若近，所有諸色皆非是我，我不有色、色不屬我、我不在色中，",
        "translation": "Whatever forms exist, whether superior, inferior, distant, or near, are not self; I have no form, form doesn’t belong to me, and I don’t abide in form.",
        "source": "T24n1451_012:0259c17_29"
    },
    {
        "source_sentence": "如是應以正念正慧而審觀察；",
        "translation": "In the same way, they should be judged and observed with right mindfulness and right attentiveness.",
        "source": "T24n1451_012:0259c19_30"
    },
    {
        "source_sentence": "受想行識，若過去、若未來、若現在，若內、若外、若麁、若細，若勝、若劣、若遠、若近，",
        "translation": "Feeling, perception, volition, and consciousness are either past, future, or present, internal, external, crude, or fine, superior, inferior, distant, or near.",
        "source": "T24n1451_012:0259c19_31"
    },
    {
        "source_sentence": "此等亦非是我、我亦非有此等、我亦非在此中，如是應以正念正慧而審觀察。",
        "translation": "These are also not the self, and neither is the self that has these things. Nor is the self here; thus one should examine and observe with right mindfulness and right attentiveness.",
        "source": "T24n1451_012:0259c21_32"
    },
    {
        "source_sentence": "若我多聞聖弟子眾如是觀察，於色厭患，復於受想行識亦生厭患，若厭患已即不染著，",
        "translation": "“World-honored One, if my learned noble disciples observe me in this way, they will become disgusted with material forms and also become disgusted with feelings, thoughts, volitions, and consciousnesses. And if they become disgusted with them, they will not be affected by or attached to them.",
        "source": "T24n1451_012:0259c23_33"
    },
    {
        "source_sentence": "既無染著即得解脫，既解脫已自知解脫，作如是言：『我生已盡、梵行已立、所作已辦、不受後有。』」",
        "translation": "Since he's free of defiled attachment, he then attains liberation, and knowing his own liberation after liberation, he says, 'My birth has ended, the religious practice has been established, what I've done has been done, and I won't be subject to future existence.'",
        "source": "T24n1451_012:0259c25_34"
    },
    {
        "source_sentence": "爾時世尊說此法已，時具壽難陀遠塵離垢得法眼淨，五百苾芻於諸有漏心得解脫。",
        "translation": "After the Bhagavān had explained this teaching, Kauśinanda then attained purification of the Dharma eye by being far removed from dust and dirt and attained purification of the Dharma eye, and five hundred monks were liberated in their minds to the contaminants.",
        "source": "T24n1451_012:0259c27_35"
    },
    {
        "source_sentence": "「若人無定心，　　即無清淨智，",
        "translation": "“If someone has no concentrated mind, That is to say, they lack pure knowledge.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　不能斷諸漏，　　是故汝勤修。",
        "translation": "You can't stop the contaminants; therefore, you diligently cultivate it.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　汝常修妙觀，　　知諸蘊生滅，",
        "translation": "You should always practice subtle contemplation, Knowing the arising and ceasing of all aggregates.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　清淨若圓滿，　　諸天悉欣慶。",
        "translation": "If it's pure and perfect, the gods will all rejoice.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　親友共交歡，　　往來相愛念，",
        "translation": "My friends and relatives are engaged in conversation, And I am fond of each other.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　貪名著利養，　　難陀汝應捨！",
        "translation": "Desire is called attachment to profit, but you should abandon it, Nanda!",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　勿親近在家，　　及於出家者，",
        "translation": "Don't become intimate with those who live at home or leave home.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　念起生死海，　　窮盡苦邊際。",
        "translation": "Mindfulness gives rise to the ocean of birth and death, which ends at the limit of suffering.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　初從羯羅藍，　　吹生於肉疱，",
        "translation": "First, from the kalala, flesh blisters are blown into existence.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　肉疱生閉尸，　　閉尸生健南。",
        "translation": "A blister of flesh gives rise to a closed corpse, and a closed corpse gives rise to a gandharva.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　健南漸轉變，　　生頭及四支，",
        "translation": "The gandharva gradually transforms, giving rise to the head and four limbs.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　眾骨聚成身，　　皆從業因有。",
        "translation": "All the bones that make up a body Are all conditioned by the causes of action.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　頂骨合九片，　　頷車兩骨連，",
        "translation": "The skull bone is composed of nine pieces; The two parts of the jaw and the one part of the chariot bone are connected.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　齒有三十二，　　其根亦如是。",
        "translation": "The teeth are thirty-two in number. The same applies to their faculties.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　耳根及頸骨，　　腭骨并鼻梁，",
        "translation": "The oṟgan of hearing and the bones of the neck, as well as the bones of the palate and the parts of the organ of smell.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　胸臆與咽喉，　　總有十二骨。",
        "translation": "In all twelve bones are the chest, abdomen, and throat.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　眼眶有四骨，　　肩髃亦兩雙，",
        "translation": "The eye socket has four bones, and the shoulder blade is also twofold.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　兩臂及指頭，　　總有五十骨。",
        "translation": "The two arms and the tip of the toes had fifty bones in all.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　項後有八骨，　　脊梁三十二，",
        "translation": "Behind his neck were eight bones, and behind his back there were thirty-two.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　此各有根本，　　其數亦四八。",
        "translation": "Each of these has its own root, Also four or eight in number.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　右脇邊肋骨，　　相連有十三，",
        "translation": "The ribs at the side of the right hypochondrium are thirteen in number.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　左脇相連生，　　亦有十三骨。",
        "translation": "The left hypochondrium was linked, And there were also thirteen bones.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　此等諸骨鎖，　　三三相續連，",
        "translation": "These chains of bones are three and three, one after the other.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　二二相鉤牽，　　其餘不相續。",
        "translation": "The other dharmas are not continuous.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　左右兩腿足，　　合有五十骨，",
        "translation": "His left and right legs and feet had fifty bones in all.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　總三百十六，　　支拄於身內。",
        "translation": "The whole is three hundred and sixty-six inches long, resting within the body.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　骨節相鉤綴，　　合成眾生體，",
        "translation": "The bones and joints are joined together to form the bodies of sentient beings.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　實語者記說，　　正覺之所知。",
        "translation": "The one who speaks the truth remembers and explains it, which is known by the right awakening.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　從足至於頂，　　雜穢不堅牢，",
        "translation": "From the feet to the top of their heads, they’re dirty and not firm.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　由此共成身，　　脆危如葦舍。",
        "translation": "As a result, they all form a body that's as fragile and perilous as a reed-house.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　無榍唯骨立，　　血肉遍塗治，",
        "translation": "There is no abscess, just bones standing; blood and flesh are all coated and healed.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　同機關木人，　　亦如幻化像。",
        "translation": "It's the same as an illusion-transforming image like a wooden man with a mechanical body.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　應觀於此身，　　筋脈更纏繞，",
        "translation": "You should observe that this body Is further enclosed by tendons and veins.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　濕皮相裹覆，　　九處有瘡門。",
        "translation": "Their skin is covered by moisture, and there's the door of sores in nine places.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　周遍常流溢，　　屎尿諸不淨，",
        "translation": "Everywhere it always overflows, Filled with filthy excrement and urine.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　譬如倉與篅，　　盛諸穀麥等。",
        "translation": "It's like a storehouse full of grain and millet, Filled with grain and wheat.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　此身亦如是，　　雜穢滿其中，",
        "translation": "This body is also like this, Filled with filth.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　運動骨機關，　　危脆非堅實。",
        "translation": "It moves like a skeleton, which is fragile and not strong.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　愚夫常愛樂，　　智者無染著，",
        "translation": "Foolish people always delight in it, but wise people are not attached to it.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　洟唾污常流，　　膿血恒充滿。",
        "translation": "Pus and spittle always flow, Always filled with pus and blood.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　黃脂雜乳汁，　　腦滿髑髏中，",
        "translation": "Their brains are covered with the juice of butter, blended with milk and curds, Filling their skulls.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　胸膈痰癊流，　　內有生熟藏。",
        "translation": "The chest, the diaphragm, phlegm, and abscesses flow inward; Within them there is the store of birth and maturation.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　肪膏與皮膜，　　五藏諸腸胃，",
        "translation": "fat, ointment, skin and membranes, the five stores of intestines and stomach.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　如是臭爛等，　　諸不淨居同。",
        "translation": "Such things as smell and rotten, etc., Are the same as impure dharmas.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　罪身深可畏，　　此即是怨家，",
        "translation": "The sinful body is deep and fearsome. This is the enemy’s home.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　無識耽欲人，　　愚癡常保護。",
        "translation": "A person without consciousness who's addicted to desire is always protected by delusion.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　如是臭穢身，　　猶如朽城郭，",
        "translation": "Such a foul-smelling body is like a rotten castle.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　日夜煩惱逼，　　遷流無暫停。",
        "translation": "Day and night, oppressed by afflictions, they move and flow without stopping.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　身城骨牆壁，　　血肉作塗泥，",
        "translation": "Their bodies are walled by bones and walls, And their flesh is covered with mud.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　畫綵貪、瞋、癡，　　隨處而莊飾。",
        "translation": "They are painted with the colors of greed, anger, and delusion, Adorned everywhere.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　可惡骨身城，　　血肉相連合，",
        "translation": "It's a city of bad bones and bodies, with blood and flesh coming together.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　常被惡知識，　　內外苦相煎。",
        "translation": "They're always under the influence of bad friends, and internal and external suffering are burned.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　難陀汝當知，　　如我之所說，",
        "translation": "Nanda, you should know as I explain:",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　晝夜常繫念，　　勿思於欲境。",
        "translation": "Day and night, always mindful, Don’t think about objects of desire.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　若欲遠離者，　　常作如是觀，",
        "translation": "If someone wants to be far removed, they always observe it this way:",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "　勤求解脫處，　　速超生死海。」",
        "translation": "They diligently seek the place of liberation and quickly transcend the ocean of birth and death.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "爾時世尊重說伽他告難陀曰：爾時世尊說是入胎經已，具壽難陀及五百苾芻，",
        "translation": "It was then that the World-honored One said to Nanda: Having thus taught this sutra on entering the mother’s womb, the Blessed One extended his life span to Nanda and the five hundred bhikṣus.",
        "source": "T24n1451_012:0259c29_36"
    },
    {
        "source_sentence": "皆大歡喜信受奉行。",
        "translation": "They all rejoiced greatly and believed it, accepted it, and upheld it.",
        "source": "T24n1451_012:0260c01_37"
    },
    {
        "source_sentence": "「敬心奉澡浴，　　淨水及塗香；",
        "translation": "I respectfully offer bathing, clean water, and ointment with fragrance.",
        "source": "T24n1451_012:0260c02_0"
    },
    {
        "source_sentence": "　并修諸福因，　　獲斯殊勝報。」",
        "translation": "By cultivating the causes of merit, they'll attain this extraordinary reward.",
        "source": "T24n1451_012:0260c02_0"
    },
    {
        "source_sentence": "難陀苾芻越生死海險難之處，能至安隱究竟涅槃，獲阿羅漢果，說自慶頌曰：時諸苾芻聞是說已，",
        "translation": "The bhikṣu Nanda, having crossed the great danger of the sea of birth and death, was able to attain peace and ultimately enter nirvana and obtained the quality of arhatship. He then composed the following verse in praise: Having heard this discourse, the bhikṣus were filled with joy.",
        "source": "T24n1451_012:0260c02_0"
    },
    {
        "source_sentence": "咸皆有疑，為斷疑故請大師曰：「大德！",
        "translation": "They all had doubts, so they asked the great teacher to end their doubts and said, Mañjuśrī!",
        "source": "T24n1451_012:0260c06_1"
    },
    {
        "source_sentence": "難陀苾芻先作何業，由彼報得金色之身，具三十相以自嚴飾，望世尊身但少四指，",
        "translation": "What action did the bhikṣu Nanda perform in the past that gave rise to his golden body, which was decorated with thirty distinctive marks and only four fingers short of the World-honored One’s body?",
        "source": "T24n1451_012:0260c07_2"
    },
    {
        "source_sentence": "於婬欲境極生愛著。",
        "translation": "They become extremely attached to the object of sexual desire.",
        "source": "T24n1451_012:0260c09_3"
    },
    {
        "source_sentence": "大師哀愍，於生死海強拔令出，方便安置究竟涅槃？",
        "translation": "With pity, did the great teacher forcibly pull them out of the sea of birth and death and skillfully place them in ultimate nirvāṇa?",
        "source": "T24n1451_012:0260c09_4"
    },
    {
        "source_sentence": "唯願為說。」",
        "translation": "Please explain it for me.",
        "source": "T24n1451_012:0260c10_5"
    },
    {
        "source_sentence": "佛告諸苾芻：「難陀苾芻先所作業，果報成熟皆悉現前，廣說如上。」",
        "translation": "The Buddha told the monks, The rewards and ripening effects of the previous actions of the monk Nanda are all present, as explained in detail above.",
        "source": "T24n1451_012:0260c11_6"
    },
    {
        "source_sentence": "「假令經百劫，　　所作業不亡；",
        "translation": "Even if it were to pass for a hundred eons, Their deeds wouldn’t perish.",
        "source": "T24n1451_012:0260c12_7"
    },
    {
        "source_sentence": "　因緣會遇時，　　果報還自受。",
        "translation": "When the causes and conditions meet, the result is returned to be experienced on its own.",
        "source": "T24n1451_012:0260c12_7"
    },
    {
        "source_sentence": "即說頌曰：「汝等諸苾芻！",
        "translation": "He then spoke a verse, saying, You monks!",
        "source": "T24n1451_012:0260c12_7"
    },
    {
        "source_sentence": "過去世時九十一劫人壽八萬歲，有毘鉢尸佛如來、應供、正等覺、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊出現於世，",
        "translation": "In a past world, when the human life span was eighty thousand years in ninety-one world ages, Vipaśyin Buddha, the Tathāgata, Arhat, Completely Enlightened One, Perfect in Knowledge and Conduct, Well-gone One, Knower of the World, Unsurpassed One, Tamer of Humans, Teacher of Devas and Humans, Teacher of",
        "source": "T24n1451_012:0260c15_8"
    },
    {
        "source_sentence": "與六萬二千苾芻遊行人間，至親慧城王所都處，往親慧林，即於此住。",
        "translation": "He traveled among the people with sixty-thousand and two thousand bhikṣus. When he arrived at the royal capital of the city of Samantabhadra, he went to the forest of Samantabhadra and stayed there.",
        "source": "T24n1451_012:0260c18_9"
    },
    {
        "source_sentence": "時彼世尊有異母弟，於婬欲境極生愛著，其毘鉢尸如來、應、正等覺，",
        "translation": "At the time, that Bhagavān had a different mother and younger brother who became extremely attached to the object of sexual desire. The Tathāgata Vipaśyin, Arhat, Perfectly Enlightened One,",
        "source": "T24n1451_012:0260c19_10"
    },
    {
        "source_sentence": "於生死海勸令出家，方便安置究竟涅槃。",
        "translation": "In the sea of birth and death, he encourages renunciation and skillfully establishes it in ultimate nirvāṇa.",
        "source": "T24n1451_012:0260c21_11"
    },
    {
        "source_sentence": "時彼國主名曰有親，以法化世，人民熾盛豐樂安隱，無諸詐偽賊盜疾疫，",
        "translation": "The lord of that kingdom, named Axian (Aniruddha), transformed the world by means of the teachings of the Dharma. The people prospered and enjoyed peace and happiness; there were no fraudulent thieves or robbers, nor did the epidemic of pestilence occur.",
        "source": "T24n1451_012:0260c22_12"
    },
    {
        "source_sentence": "牛羊稻蔗在處充滿。",
        "translation": "Cattle, sheep, rice, and sugarcane are filled everywhere.",
        "source": "T24n1451_012:0260c23_13"
    },
    {
        "source_sentence": "王異母弟極耽婬染，王聞佛眾住親慧林，將諸王子、親侍大臣及內宮女，",
        "translation": "When the king heard that the Buddha’s disciples were staying in the intimate forest of wisdom, he summoned the princes, their attendants, ministers, and court ladies of the inner palace.",
        "source": "T24n1451_012:0260c24_14"
    },
    {
        "source_sentence": "人民翊從往詣佛所，頂禮佛足退坐一面。",
        "translation": "The people went to the Buddha, bowed their heads at his feet, withdrew, and sat to one side.",
        "source": "T24n1451_012:0260c26_0"
    },
    {
        "source_sentence": "爾時世尊為彼王眾，宣揚妙法示教利喜得殊勝解。",
        "translation": "It was then that the Bhagavān proclaimed the marvelous teaching for those kings, showed it to them, benefited them, and delighted in attaining extraordinary understanding.",
        "source": "T24n1451_012:0260c26_1"
    },
    {
        "source_sentence": "其弟耽欲不肯出門。",
        "translation": "His younger brother was addicted and refused to leave the house.",
        "source": "T24n1451_012:0260c28_2"
    },
    {
        "source_sentence": "時大臣子及餘知友撫塵之類詣而告曰：『善友知不？",
        "translation": "The ministers and other well-known friends who caressed the dust went to him and told him, 'Do you know that, good friend?'",
        "source": "T24n1451_012:0260c28_3"
    },
    {
        "source_sentence": "王及王子并諸內宮大臣人眾，往毘鉢尸佛所躬行禮敬，聽受妙法獲殊勝解。",
        "translation": "The king and his princes, as well as the ministers of the inner palace and other officials, went to Vipaśyin Buddha in person to pay their respects and listened to him. They received the wonderful Dharma and attained extraordinary understanding.",
        "source": "T24n1451_012:0260c29_4"
    },
    {
        "source_sentence": "人身難得汝已得之，如何今時耽著婬欲不肯出門？』",
        "translation": "It's difficult to obtain a human body; how could you be so attached to sexual desire at the present time that you won't leave?'",
        "source": "T24n1451_012:0261a02_5"
    },
    {
        "source_sentence": "彼聞責已心生愧恥，俛仰相隨同行而去。",
        "translation": "After hearing the rebuke, they felt ashamed and looked up in disgrace, followed each other along with their companions, and departed.",
        "source": "T24n1451_012:0261a03_6"
    },
    {
        "source_sentence": "時佛弟苾芻見諸徒侶共行而去，問曰：『何故君等將此一人共伴而去？』",
        "translation": "When the Buddha's younger brother monk saw his disciples walking together and departed, he asked, 'Why are you leaving with this one of your companions?'",
        "source": "T24n1451_012:0261a04_7"
    },
    {
        "source_sentence": "時彼同伴具以事白，苾芻曰：『我是佛弟，昔在家時於諸欲境極生耽著，",
        "translation": "The companions then reported this to the Buddha in detail. The bhikṣu said, “I am the younger brother of the Buddha. Formerly when I was living at home I became addicted to all kinds of objects of desire.",
        "source": "T24n1451_012:0261a06_8"
    },
    {
        "source_sentence": "幸蒙大師強牽令出，安隱將趣究竟涅槃。",
        "translation": "Fortunately, I've been forcibly led out by the great teacher, and I'm about to enter final nirvāṇa in peace.",
        "source": "T24n1451_012:0261a07_9"
    },
    {
        "source_sentence": "更有如是愚癡之輩與我相似，仁等慈悲強共將去誠為大善。",
        "translation": "There are other foolish people like me, and it's really great good that you kindly and compassionately forcibly remove them together.",
        "source": "T24n1451_012:0261a08_10"
    },
    {
        "source_sentence": "今可往詣無上大師，得至佛所必生深信。』",
        "translation": "Now, you can go to the unsurpassed great teacher and attain a place where the Buddha will surely give rise to deep faith.'",
        "source": "T24n1451_012:0261a10_11"
    },
    {
        "source_sentence": "時彼同伴共至佛所，佛觀彼類稱根欲性而為說法。",
        "translation": "The companions then went to the Buddha together, observed their faculties and desires, and he taught them the Dharma.",
        "source": "T24n1451_012:0261a11_12"
    },
    {
        "source_sentence": "既得聞已深起信心，從座而起偏袒右肩，合掌向佛白言：『世尊！",
        "translation": "Having heard this, he had deep faith and rose from his seat, bared his right shoulder, joined his palms together, and said to the Buddha, 'Bhagavān!",
        "source": "T24n1451_012:0261a12_13"
    },
    {
        "source_sentence": "唯願大師及諸聖眾，明至我家入溫室澡浴。』",
        "translation": "May the great teacher and the holy ones explain that they'll go to my house and enter the warm room to bathe.'",
        "source": "T24n1451_012:0261a13_14"
    },
    {
        "source_sentence": "佛默然受。",
        "translation": "The Buddha accepted it in silence.",
        "source": "T24n1451_012:0261a14_15"
    },
    {
        "source_sentence": "彼知受已禮佛雙足奉辭而去，遂至王所申恭敬已，白言：『大王！",
        "translation": "Knowing that they had accepted it, they bowed their heads at the Buddha's feet, saluted him, and departed. They then went to the king's place and said, 'Great king!",
        "source": "T24n1451_012:0261a15_0"
    },
    {
        "source_sentence": "我詣佛所聞法生信，於婬欲境起厭離心，奉請佛僧明至我家入溫室浴，",
        "translation": "I went to the Buddha, heard of the Dharma from him, and became convinced. Having become disgusted with sensual desires, I invited the Buddha and the sangha to come to my house to bathe in a warm room or monastery.",
        "source": "T24n1451_012:0261a16_1"
    },
    {
        "source_sentence": "如來大師慈悲為受，佛是人天所應供養，王今宜可灑掃街衢嚴飾城郭。』",
        "translation": "The Tathāgata's great teacher compassionately accepts that the Buddha is worthy of offerings from humans and gods, so now it's appropriate for the king to sweep away the streets and thoroughfares and adorn the city.'",
        "source": "T24n1451_012:0261a18_2"
    },
    {
        "source_sentence": "王作是念：『佛來入城我當嚴飾，然我之弟耽欲難諫，佛今調伏實誠希有。』",
        "translation": "The king thought, 'When the Buddha comes into the city, I'll adorn it; but my younger brother is addicted to desire and has difficulty remonstrating with it, so now that he's subduing it, it's really rare for him to do so.'",
        "source": "T24n1451_012:0261a19_3"
    },
    {
        "source_sentence": "答言：『甚善！",
        "translation": "He replied, 'Very good!",
        "source": "T24n1451_012:0261a21_4"
    },
    {
        "source_sentence": "汝今可去營辦澡浴所須之物，我當隨力嚴飾城隍。』",
        "translation": "Now, you may go and prepare the things you need for bathing, and I will adorn the city gods with my strength.'",
        "source": "T24n1451_012:0261a21_5"
    },
    {
        "source_sentence": "弟生大喜辭王而去。",
        "translation": "The younger brother gave rise to great joy and departed, leaving the king.",
        "source": "T24n1451_012:0261a22_6"
    },
    {
        "source_sentence": "王告諸臣曰：『當可唱令普告諸人：「明日世尊將入城內，諸舊住者及遠方來，",
        "translation": "The king said to his ministers, “May your majesty, please tell them: tomorrow the World-honored One is about to enter the city.",
        "source": "T24n1451_012:0261a23_7"
    },
    {
        "source_sentence": "汝等諸人咸當隨力，嚴飾城郭灑掃街衢，持諸香華迎大師入。」』",
        "translation": "All of you people should follow your strength, adorn the city walls, sweep the streets, and carry incense and flowers to welcome the great teacher into it.'",
        "source": "T24n1451_012:0261a25_8"
    },
    {
        "source_sentence": "臣奉王教普告令知具宣王勅，時諸人眾於彼城中，除去瓦礫遍灑香水，",
        "translation": "The ministers, following the king's instruction, told the whole group to know exactly what the king had ordered. Then the people in that city removed the rubble and poured perfume all over it.",
        "source": "T24n1451_012:0261a26_9"
    },
    {
        "source_sentence": "燒諸妙香懸眾旛蓋散花供養，如天帝釋歡喜之園。",
        "translation": "He burns incense, hangs canopies, spreads flowers, and makes offerings like Indra the lord of gods rejoicing in the park.",
        "source": "T24n1451_012:0261a28_10"
    },
    {
        "source_sentence": "時彼王弟辦諸香湯及香油等，莊嚴浴室敷置床座。",
        "translation": "The king's younger brother then prepared incense, hot water, scented oil, and so forth, adorned the bathhouse, spread out a bed, and set up a seat.",
        "source": "T24n1451_012:0261a29_11"
    },
    {
        "source_sentence": "毘鉢尸佛漸欲至城，王及諸臣太子后妃宮人婇女及諸人眾，咸出奉迎遙禮佛足隨從入城。",
        "translation": "When Vipaśyin Buddha gradually approached the city, the king and his ministers, princes, queens, palace officials, women, and other people came out to greet him. They bowed at his feet from a distance and followed him into the city.",
        "source": "T24n1451_012:0261b01_12"
    },
    {
        "source_sentence": "時彼王弟引佛世尊，入溫室內授香水等以充澡浴，見佛世尊身如金色，",
        "translation": "The king's younger brother then led the Bhagavān, entered a warm room and gave him some perfume to bathe in. He saw that the Bhagavān's body was golden-colored",
        "source": "T24n1451_012:0261b03_13"
    },
    {
        "source_sentence": "三十二相八十種好周遍莊嚴。",
        "translation": "The thirty-two marks and eighty kinds of beauty are pervasively adorned.",
        "source": "T24n1451_012:0261b05_14"
    },
    {
        "source_sentence": "見已歡喜生深信心，洗浴既竟著衣服已，即便頂禮世尊雙足，發是願言：『我今幸遇最上福田微申供養，",
        "translation": "Having washed his clothes, he bowed down at the feet of the World-honored One and made the following vow:",
        "source": "T24n1451_012:0261b05_15"
    },
    {
        "source_sentence": "願此善因於未來世，身得金色與佛無異。",
        "translation": "I pray that this good cause will cause my body to attain golden color in the future, no different from the Buddha's.",
        "source": "T24n1451_012:0261b08_16"
    },
    {
        "source_sentence": "如世尊弟，於欲境中深生耽著強拔令出，得趣安隱究竟涅槃。",
        "translation": "Suppose the Bhagavān's disciple is deeply addicted to the object of desire and forcibly pulls it out, and he attains the goal of peace and ultimate nirvāṇa.",
        "source": "T24n1451_012:0261b09_17"
    },
    {
        "source_sentence": "願我當來得為佛弟，獲金色身亦復如是，我於欲境生耽著時，強牽令出愛染深河，",
        "translation": "I pray that in the future I may become a disciple of the Buddha and have golden bodies likewise. When I am attached to sensual desires, I forcibly draw them out of the deep river of craving.",
        "source": "T24n1451_012:0261b10_18"
    },
    {
        "source_sentence": "得趣涅槃安隱之處。』",
        "translation": "He'll attain the peaceful place of nirvāṇa.'",
        "source": "T24n1451_012:0261b12_19"
    },
    {
        "source_sentence": "汝等苾芻勿生異念，彼親慧王耽欲之弟，即難陀苾芻是。",
        "translation": "You monks, don't give rise to dissimilar thoughts, for the younger brother of King Prajñāpāramitā who was addicted to desire is the monk Nanda.",
        "source": "T24n1451_012:0261b13_20"
    },
    {
        "source_sentence": "由於昔時請毘鉢尸佛入浴室中香湯澡浴，淨心發願彼之善因，今為佛弟身作金色。",
        "translation": "In the past, he invited Vipaśyin Buddha to enter the bathhouse and wash his body in scented warm water, and with a pure heart he made a vow for their good cause, which is now golden-colored for the Buddha's younger brother.",
        "source": "T24n1451_012:0261b14_21"
    },
    {
        "source_sentence": "我於耽著婬欲之境，強拔令出捨俗出家，究竟涅槃至安隱處。」",
        "translation": "In the realm of attachment to sexual desire, I forcibly remove it and cause it to leave the secular world and leave home, ultimately attaining nirvāṇa in a peaceful place.",
        "source": "T24n1451_012:0261b16_22"
    },
    {
        "source_sentence": "時諸苾芻更復有疑，請世尊曰：「大德！",
        "translation": "The monks then had further doubts, and asked the Bhagavān, Mañjuśrī!",
        "source": "T24n1451_012:0261b18_0"
    },
    {
        "source_sentence": "難陀苾芻曾作何業，今身感得三十大丈夫相？」",
        "translation": "What actions did the monk Nanda once do that now bring about the appearance of 30 great men in his body?",
        "source": "T24n1451_012:0261b18_1"
    },
    {
        "source_sentence": "佛告諸苾芻：「彼所作業廣說如前。",
        "translation": "The Buddha told the monks, What they do is explained in detail as before.",
        "source": "T24n1451_012:0261b19_2"
    },
    {
        "source_sentence": "乃往過去於聚落中，有一長者大富多財資生無乏，有一苑園花菓茂盛，",
        "translation": "In the past in a village there was an elderly man of great wealth who possessed abundant means of subsistence. There was also a park with plenty of flowers and fruit,",
        "source": "T24n1451_012:0261b20_3"
    },
    {
        "source_sentence": "流泉浴池林木森竦，堪出家人棲隱之處。",
        "translation": "There are streams, springs, bathing ponds, forests, and trees that provide shelter for renunciant monks.",
        "source": "T24n1451_012:0261b22_4"
    },
    {
        "source_sentence": "時有獨覺出現於世，哀愍眾生樂處閑靜，世間無佛唯此福田。",
        "translation": "An pratyekabuddha then appeared in the world, pitying sentient beings for their happiness in a peaceful place where there are no buddhas in the world but this is the only field of merit.",
        "source": "T24n1451_012:0261b23_5"
    },
    {
        "source_sentence": "于時有一獨覺尊者，遊行人間至斯聚落，周旋觀察屆彼園中，其守園人既見尊者，",
        "translation": "At that time a certain solitary realizer came to this village on a journey among the people. He circumambulated it and entered the park. Seeing the solitary realizer, the park keepers saw him.",
        "source": "T24n1451_012:0261b24_6"
    },
    {
        "source_sentence": "告言：『善來！",
        "translation": "He told them, 'Well come!",
        "source": "T24n1451_012:0261b26_7"
    },
    {
        "source_sentence": "為解勞倦，尊者住此。』",
        "translation": "In order to understand the weariness, the venerable is staying here.'",
        "source": "T24n1451_012:0261b26_8"
    },
    {
        "source_sentence": "即於中夜入火光定，園人見已作如是念：『此之大德成斯勝行。』",
        "translation": "He then entered the concentration of firelight in the middle of the night, and when the park's people saw him, they thought, 'This great virtuous man has accomplished this excellent practice.'",
        "source": "T24n1451_012:0261b27_9"
    },
    {
        "source_sentence": "即便夜起往就家尊，告言：『大家！",
        "translation": "He rose at night and went to the house honored one, telling him, 'Householders!",
        "source": "T24n1451_012:0261b28_10"
    },
    {
        "source_sentence": "宜於今者生慶喜心，於花園中有一大德來投我宿，成就妙行具足神通，",
        "translation": "It befits you to give rise to a feeling of joy and bliss. There is a great virtuous one in the garden that has come to stay with me for the night, having perfected his marvelous deeds and endowed himself with supernormal powers.",
        "source": "T24n1451_012:0261b29_11"
    },
    {
        "source_sentence": "放大光明遍照園內。』",
        "translation": "It emanates a great ray of light that shines everywhere in the garden.'",
        "source": "T24n1451_012:0261c02_12"
    },
    {
        "source_sentence": "長者聞已疾往園中，禮雙足已作如是言：『聖者！",
        "translation": "After hearing this, the elder quickly went to the park, bowed his head at their feet, and said, 'Noble one!",
        "source": "T24n1451_012:0261c02_13"
    },
    {
        "source_sentence": "仁為求食、我為福因，幸住此園我常施食。』",
        "translation": "If you're kind enough to ask for food and I'm the cause of merit, fortunately staying in this park, I'll always give food.'",
        "source": "T24n1451_012:0261c03_14"
    },
    {
        "source_sentence": "彼見慇懃即便為受，住此園內入勝妙定解脫之樂。",
        "translation": "Seeing it, they'll even accept it and stay inside this park to enter the bliss of liberation in a wonderful concentration.",
        "source": "T24n1451_012:0261c04_15"
    },
    {
        "source_sentence": "復作是念：『我此臭身輪迴生死，所應作者並已獲得，宜入圓寂永證無生。』",
        "translation": "Again, he thinks, 'This stinking body of mine is transmigrating through birth and death in birth-and-death, the author of which should have been attained, so it's better to enter perfect quiescence and permanently realize nonproduction.'",
        "source": "T24n1451_012:0261c05_16"
    },
    {
        "source_sentence": "作是念已即昇虛空，入火光定現諸神變，放大光明上燭紅輝下流清水，",
        "translation": "Having thought thus, he ascended up into the sky and entered the concentration of firelight. He manifested miraculous signs, emanating great beams of light that shone brightly in the sky with a red glow shining above and flowing down streams of clear water below.",
        "source": "T24n1451_012:0261c07_17"
    },
    {
        "source_sentence": "捨此身已神識不生，永證無餘妙涅槃界。",
        "translation": "After abandoning this body, his spirit and consciousness don't arise, and he permanently realizes the marvelous realm of nirvāṇa without remainder.",
        "source": "T24n1451_012:0261c09_18"
    },
    {
        "source_sentence": "時彼長者取其屍骸，焚以香木復持乳汁而滅其火，收餘身骨置新瓶中，",
        "translation": "The wealthy man then took the corpse, burned it with scented wood and milk juice, extinguished the fire, stored the remaining bones in a new pot,",
        "source": "T24n1451_012:0261c10_0"
    },
    {
        "source_sentence": "造窣堵波懸諸旛蓋，深生敬信灑三十種眾妙香水，并發大願求諸相好。",
        "translation": "He built a stupa, hung canopies on it, and with deep respect and faith he sprinkled thirty kinds of wonderful fragrant water and made a great vow to seek the marks.",
        "source": "T24n1451_012:0261c11_1"
    },
    {
        "source_sentence": "汝等苾芻勿生異念，往時長者即難陀是，由以勝妙供養敬信業故，今受果報感得三十殊妙勝相。」",
        "translation": "You monks, don't give rise to different thoughts, for the elder was named Nanda in the past, and because of his excellent offerings of respect and faith, he now receives the 30 marvelous and superior characteristics as a result of his fruition.",
        "source": "T24n1451_012:0261c13_2"
    },
    {
        "source_sentence": "時諸苾芻更有疑念，重請世尊：「大德！",
        "translation": "The monks then had another doubtful thought and again asked the Bhagavān, Mañjuśrī!",
        "source": "T24n1451_012:0261c15_3"
    },
    {
        "source_sentence": "難陀苾芻曾作何業，若不出家棄塵俗者，必當紹繼力輪王位？」",
        "translation": "What actions did the monk Nanda once perform that will surely enable him to succeed to the throne of the wheel-turning king if he doesn't leave home and abandon the world?",
        "source": "T24n1451_012:0261c16_4"
    },
    {
        "source_sentence": "佛告諸苾芻：「難陀先世所造之業，果報熟時必當自受。",
        "translation": "The Buddha told the monks, An action created by Nanda in a previous life will surely be self-accompanied when its fruit ripens.",
        "source": "T24n1451_012:0261c17_5"
    },
    {
        "source_sentence": "廣如上說。",
        "translation": "It's explained in detail as above.",
        "source": "T24n1451_012:0261c19_6"
    },
    {
        "source_sentence": "過去世時此賢劫中人壽二萬歲，有迦攝波佛出現世間，十號具足，在婆羅痆斯仙人墮處施鹿林中依止而住。",
        "translation": "In a past world, when the human life span was twenty thousand years in this good eon, there was Kāśyapa Buddha who appeared in the world and possessed the ten names, lived supported by the saṃgha of Vārāṇasī as he fell into the Deer Forest of generosity.",
        "source": "T24n1451_012:0261c19_7"
    },
    {
        "source_sentence": "時彼城中王名訖栗枳，以法化世為大法王，廣如上說。",
        "translation": "The king in that city at the time was named Kṛttiya, and he transformed the world into a great king of the Dharma by teaching the Dharma, as explained above.",
        "source": "T24n1451_012:0261c21_8"
    },
    {
        "source_sentence": "王有三子謂大中小。",
        "translation": "The king had three sons, which were called the large, middle, and small.",
        "source": "T24n1451_012:0261c23_9"
    },
    {
        "source_sentence": "彼迦攝波佛施化事畢，猶如火盡入大涅槃。",
        "translation": "After that Kāśyapa Buddha finished his task of teaching, he entered great nirvāṇa like a fire burning out.",
        "source": "T24n1451_012:0261c23_10"
    },
    {
        "source_sentence": "其王信敬取佛餘身，以諸香木栴檀沈水海岸牛頭天木香等，焚燒既訖滅以香乳，",
        "translation": "The king respectfully believed and took the rest of the Buddha’s body. He burned all the incense, such as wood, sandalwood, water, seacoast oxhead heavenly wood, etc., which had been burned away with scented milk.",
        "source": "T24n1451_012:0261c24_11"
    },
    {
        "source_sentence": "收其舍利置金寶瓶，造大宰堵波皆用四寶，縱廣正等一踰繕那、高半踰繕那，",
        "translation": "He collected the relics, placed them in a golden-jeweled pot, and built a stupa of four jewels for the deceased’s rebirth. The width and height of this stupa were exactly one yojana long and half a yojana high.",
        "source": "T24n1451_012:0261c26_12"
    },
    {
        "source_sentence": "安相輪時王之中子親上中蓋。",
        "translation": "When he places the wheel of marks, the king's middle child is intimate with the middle lid above.",
        "source": "T24n1451_012:0261c28_13"
    },
    {
        "source_sentence": "汝等苾芻勿生異念，時王中子者即難陀是。",
        "translation": "You monks, don't give rise to different thoughts, for the prince of the king at the time was Nanda.",
        "source": "T24n1451_012:0261c28_14"
    },
    {
        "source_sentence": "由於昔時敬心供養安置中蓋，斯之善業，於二千五百生中常為力輪王化一洲內，",
        "translation": "As a result of these virtuous deeds, for two thousand five hundred lifetimes he has always been the wheel-turning king (cakravartin), teaching in one continent.",
        "source": "T24n1451_012:0261c29_15"
    },
    {
        "source_sentence": "今此生中若不出家者，還作力輪王得大自在。」",
        "translation": "If someone doesn't leave home in this life, they'll return to become the wheel-turning king of power and attain great freedom.",
        "source": "T24n1451_012:0262a02_16"
    },
    {
        "source_sentence": "時諸苾芻更復有疑，請問世尊：「大德！",
        "translation": "The monks then again had doubts, and asked the Bhagavān, Mañjuśrī!",
        "source": "T24n1451_012:0262a04_0"
    },
    {
        "source_sentence": "難陀苾芻曾作何業，於佛弟子善護根門最為第一？」",
        "translation": "What actions did the monk Nanda ever perform that are the best among the Buddha's disciples in terms of guarding their faculties?",
        "source": "T24n1451_012:0262a04_1"
    },
    {
        "source_sentence": "佛言：「此由願力。",
        "translation": "The Buddha said, This is the result of the power of the vow.",
        "source": "T24n1451_012:0262a06_0"
    },
    {
        "source_sentence": "難陀苾芻於迦攝波佛時捨俗出家，其親教師彼佛法中善護根門稱為第一，",
        "translation": "When the monk Nanda renounced secularism and left home at the time of Kāśyapa Buddha, his relatives and teachers were said to be the best among those who guarded their faculties well in the Buddha's teaching.",
        "source": "T24n1451_012:0262a06_1"
    },
    {
        "source_sentence": "盡其形壽梵行自持，然於現身竟無證悟。",
        "translation": "Throughout his physical life, he maintained the practice of celibacy on his own, but he didn't realize enlightenment in his present body.",
        "source": "T24n1451_012:0262a08_2"
    },
    {
        "source_sentence": "於命終時便發誓願：『我於佛所盡斯形壽梵行自持，然於現身竟無所證。",
        "translation": "At the end of his life, he then made a vow, 'I will maintain this form and religious practice for as long as I live at the Buddha's place, but I won't realize it in my present body.",
        "source": "T24n1451_012:0262a09_3"
    },
    {
        "source_sentence": "願我以此修行善根，此佛世尊記未來世有摩納婆當成正覺號釋迦牟尼，",
        "translation": "“World-honored One, through these roots of virtue which I cultivate, may this buddha remember that in the future there will be a manasattva who will become perfectly enlightened called Sakkamuni,",
        "source": "T24n1451_012:0262a10_4"
    },
    {
        "source_sentence": "我於彼佛教法之中，出家離俗斷諸煩惱，獲阿羅漢，如親教師於斯佛所善護根門最為第一，",
        "translation": "Among the teachings of Buddhism, I renounced domestic life, became a renunciant, abandoned all worldly afflictions, and attained arhatship. Like my teachers, I am the foremost among those who practice the path of protecting their faculties in the presence of this buddha.",
        "source": "T24n1451_012:0262a12_5"
    },
    {
        "source_sentence": "我亦如是，於彼教中守護根門最為第一。』",
        "translation": "I'm likewise, foremost among those teachings in guarding the faculties.'",
        "source": "T24n1451_012:0262a14_6"
    },
    {
        "source_sentence": "由彼願力，今於我所諸弟子中善護根門最為第一。",
        "translation": "Because of the power of their vow, they're now the best among my disciples who skillfully guard their faculties.",
        "source": "T24n1451_012:0262a15_7"
    },
    {
        "source_sentence": "如是苾芻！",
        "translation": "So it is, monk!",
        "source": "T24n1451_012:0262a16_8"
    },
    {
        "source_sentence": "若純黑業得純黑報，若純白業得純白報，若雜業者當受雜報。",
        "translation": "If pure black karma has pure black rewards, pure white karma has pure white rewards, and if there are mixed karmas, they'll experience mixed rewards.",
        "source": "T24n1451_012:0262a16_9"
    },
    {
        "source_sentence": "是故汝等離純黑雜業，修純白業，如是應修。」",
        "translation": "Therefore, you're free of pure black and mixed karma and cultivate pure white karma; thus should you cultivate it.",
        "source": "T24n1451_012:0262a18_10"
    },
    {
        "source_sentence": "根本說一切有部毘奈耶雜事卷第十二",
        "translation": "Mūlasarvâstivāda-vinaya miscellaneous works of the Sarvāstivāda school, vol. 12",
        "source": "T24n1451_012:0262a20_0"
    }
]