[
    {
        "source_sentence": "善見律毘婆沙卷第十五",
        "translation": "Shanjian lu vibhāṣa, vol. 15",
        "source": "T24n1462_015:0775a25_0"
    },
    {
        "source_sentence": "蕭齊外國三藏僧伽跋陀羅譯",
        "translation": "Xiaoqi's translation of the foreign translation of the Tripiṭaka Saṃghâvardhana",
        "source": "T24n1462_015:0775a27_0"
    },
    {
        "source_sentence": "「爾時佛住舍衛國祇樹給孤獨園精舍。",
        "translation": "It was then that the Buddha stayed at the Anāthapiṇḍada Park monastery in Jeta Grove in Śrāvastī.",
        "source": "T24n1462_015:0775a28_0"
    },
    {
        "source_sentence": "多將衣者，檀越聞比丘失衣，人人與衣。",
        "translation": "A donor hears that a monk loses his robe, and everyone gives it to him.",
        "source": "T24n1462_015:0775a28_1"
    },
    {
        "source_sentence": "自恣請者，檀越語比丘言：『若有所須，隨意取是。』",
        "translation": "When someone asks for self-restraint, the donor says to the monk, 'If you need anything, take it as you like.'",
        "source": "T24n1462_015:0775a29_2"
    },
    {
        "source_sentence": "名自恣請。",
        "translation": "It's called self-invitation.",
        "source": "T24n1462_015:0775b02_0"
    },
    {
        "source_sentence": "上下衣者，安陀會、欝多羅僧，受僧伽梨。",
        "translation": "The upper and lower robes are accepted by the undergarments of the saṃgha at the Anāthapiṇḍika and Uttarāśapāda assemblies.",
        "source": "T24n1462_015:0775b02_1"
    },
    {
        "source_sentence": "是故律本中說，若比丘失三衣，得受上下衣，餘一衣餘處乞；",
        "translation": "That is why the text of the Vinaya says: If a monk loses three garments, he can accept the upper and lower garments. The other garments are to be begged for elsewhere.",
        "source": "T24n1462_015:0775b03_2"
    },
    {
        "source_sentence": "若失二衣，得受一衣；",
        "translation": "If they lose two garments, they are given one garment.",
        "source": "T24n1462_015:0775b04_3"
    },
    {
        "source_sentence": "若失一衣不得受。",
        "translation": "If he loses a single piece of clothing, he won't accept it.",
        "source": "T24n1462_015:0775b05_4"
    },
    {
        "source_sentence": "若比丘尼失五衣，得受二衣；",
        "translation": "If a bhikṣuṇī loses five garments, she is allowed to accept two.",
        "source": "T24n1462_015:0775b05_5"
    },
    {
        "source_sentence": "若失四衣，得受一衣；",
        "translation": "If they lose four garments, they are given one garment.",
        "source": "T24n1462_015:0775b06_6"
    },
    {
        "source_sentence": "若失三衣不得受。",
        "translation": "If he loses the three garments, he won't accept them.",
        "source": "T24n1462_015:0775b06_7"
    },
    {
        "source_sentence": "若親友、若自恣請檀越、若自己物，隨意受。",
        "translation": "Whether it's a friend, a self-invited donor, or one's own property, he accepts it as he wishes.",
        "source": "T24n1462_015:0775b07_8"
    },
    {
        "source_sentence": "此戒具六事，非想得脫，此是制戒，身業口業具三受。",
        "translation": "These precepts are supplied with six things: not the acquisition by conceptual identification of being disjunctioned. This is the limited precepts*!°; bodily action and verbal action®”’ are supplied with three feelings.",
        "source": "T24n1462_015:0775b08_9"
    },
    {
        "source_sentence": "上下衣廣說竟。",
        "translation": "The upper and lower garments are explained in detail.",
        "source": "T24n1462_015:0775b09_10"
    },
    {
        "source_sentence": "「爾時佛住舍衛國祇樹給孤獨園精舍。",
        "translation": "It was then that the Buddha stayed at the Anāthapiṇḍada Park monastery in Jeta Grove in Śrāvastī.",
        "source": "T24n1462_015:0775b10_0"
    },
    {
        "source_sentence": "衣直者，金銀錢，若檀越檀越婦，欲持直為比丘買衣，比丘知已即往勸言：『若為我作衣者，",
        "translation": "If a donor or donor’s wife wants to buy robes for the bhikṣu with gold or silver coins, and after knowing this, the bhikṣu immediately goes there and exhorts her, “If you make robes for me,",
        "source": "T24n1462_015:0775b10_1"
    },
    {
        "source_sentence": "當使細緻長廣。』",
        "translation": "I'll make it grow long and wide.'",
        "source": "T24n1462_015:0775b13_0"
    },
    {
        "source_sentence": "教益直者，下至十六分之一，教緻織者，下至增一綖，若得此衣，尼薩耆罪。",
        "translation": "The one who teaches to benefit those who are straight will go down to one-sixteenth of a degree, and the one who teaches those who are finely woven will go down to an additional ounce; if they get this robe, it's a sin for a nun to commit crimes.",
        "source": "T24n1462_015:0775b13_1"
    },
    {
        "source_sentence": "若檀越欲作大，勸使小，欲多直買，勸令少直，若隨檀越作，如是得衣無罪。",
        "translation": "If a donor wants to make a large one, encourages a small one, wants to buy a large one straight up and encourages a small one to be straight up, and if he follows the donor's example, it's no offense to obtain a robe in this way.",
        "source": "T24n1462_015:0775b15_2"
    },
    {
        "source_sentence": "若親里、若自恣請檀越，如是勸作不犯，若為他勸益不犯。」",
        "translation": "If a relative or self-invited donor invites someone to do so and encourages them not to violate it, or if he encourages others not to violate it.",
        "source": "T24n1462_015:0775b16_3"
    },
    {
        "source_sentence": "法師曰：「次第文句易可解耳，不須廣說。",
        "translation": "The Master said, “It is easy to understand the successive syllables and phrases. There is no need to explain them in detail.",
        "source": "T24n1462_015:0775b18_4"
    },
    {
        "source_sentence": "第二非親里居士，為比丘辦衣價，多居士為異，餘文句如前戒說。",
        "translation": "The second is not the price of a monk's robe prepared for a monk by a layman who doesn't belong to his family, and many laymen are different.",
        "source": "T24n1462_015:0775b19_5"
    },
    {
        "source_sentence": "「爾時佛住舍衛國祇樹給孤獨園精舍，語居士言：『汝可持此衣直買衣與某甲比丘。』",
        "translation": "It was then that the Buddha stayed at the Anāthapiṇḍada Park monastery in Jeta's Grove in Śrāvastī and said to the householder, 'Take this robe and buy it for a certain monk.'",
        "source": "T24n1462_015:0775b21_0"
    },
    {
        "source_sentence": "如是語已，五十伐者，伐五十迦梨娑槃直。",
        "translation": "After he spoke these words, the fifty thieves cut down fifty kārṣapāṇis and straightened them.",
        "source": "T24n1462_015:0775b23_1"
    },
    {
        "source_sentence": "待大德者，『大德！",
        "translation": "Those who await the great virtue, 'Great virtue!",
        "source": "T24n1462_015:0775b24_2"
    },
    {
        "source_sentence": "我今日有事，願大德待過今日，明日當與。』",
        "translation": "I have something to attend to today, so may the great virtuous one wait until tomorrow to give it to me.'",
        "source": "T24n1462_015:0775b24_3"
    },
    {
        "source_sentence": "王臣者，食王俸祿，是名王臣。",
        "translation": "A king's minister is someone who eats the king's salary, which is called a king's minister.",
        "source": "T24n1462_015:0775b25_4"
    },
    {
        "source_sentence": "遣使者，遣人送也。",
        "translation": "A messenger is sent by someone who sends it.",
        "source": "T24n1462_015:0775b26_5"
    },
    {
        "source_sentence": "將者，將至比丘所。",
        "translation": "The general is about to go to the monk's place.",
        "source": "T24n1462_015:0775b26_6"
    },
    {
        "source_sentence": "取淨者，若得淨物我當受也。",
        "translation": "The one who takes the pure means that if he obtains a pure thing, I will accept it.",
        "source": "T24n1462_015:0775b27_7"
    },
    {
        "source_sentence": "淨物者，衣服湯藥，是名淨物。",
        "translation": "A pure thing is clothing, bathing, and medicine, which are called a pure thing.",
        "source": "T24n1462_015:0775b27_8"
    },
    {
        "source_sentence": "若守僧房者，為僧驅使人也。",
        "translation": "If someone guards the saṃgha's room, they'll be expelled by the saṃgha.",
        "source": "T24n1462_015:0775b28_9"
    },
    {
        "source_sentence": "已令知者，我已語守房人：『若大德須衣，往其所，當與大德衣。』",
        "translation": "Those who have been told to know it, I'll tell the roomkeeper, 'If a great virtuous man needs his robe, go to him and give him the great virtuous man's robe.'",
        "source": "T24n1462_015:0775b29_10"
    },
    {
        "source_sentence": "居士我須衣者，告令知也，隨解語知也。",
        "translation": "The householder, I need my robe, tell me to let him know, and he knows it as he understands it.",
        "source": "T24n1462_015:0775c01_11"
    },
    {
        "source_sentence": "第二第三亦如是索。",
        "translation": "The second and third are likewise asked.",
        "source": "T24n1462_015:0775c02_12"
    },
    {
        "source_sentence": "若得者善，若不得者，第一第二第三，乃至第六，在前默然。",
        "translation": "If he attains it, it's good; if he doesn't attain it, the first, second, third, or even sixth are silent in front of him.",
        "source": "T24n1462_015:0775c03_13"
    },
    {
        "source_sentence": "云何默然者？",
        "translation": "What's silent?",
        "source": "T24n1462_015:0775c04_14"
    },
    {
        "source_sentence": "口不語、立不坐。",
        "translation": "He doesn't speak or stand or sit with his mouth shut.",
        "source": "T24n1462_015:0775c04_15"
    },
    {
        "source_sentence": "若檀越喚教坐，不得坐，若與飲食，亦不得受，乃至飲亦爾，若請說法呪願，",
        "translation": "If a donor summons someone to teach them to sit, they won't be allowed to sit, give food or drink, or accept it, or even drink it, and if they are asked to recite the dhāraṇī of the teaching, they won't take it.",
        "source": "T24n1462_015:0775c05_16"
    },
    {
        "source_sentence": "悉不得為說。",
        "translation": "They can't all be explained for them.",
        "source": "T24n1462_015:0775c07_17"
    },
    {
        "source_sentence": "若檀越問言：『以何因緣來至此？』",
        "translation": "If the donor asks, 'What's the reason you came here?'",
        "source": "T24n1462_015:0775c07_18"
    },
    {
        "source_sentence": "答言：『居士自當知。』",
        "translation": "He replied, 'Should you know for yourself, householder?'",
        "source": "T24n1462_015:0775c08_19"
    },
    {
        "source_sentence": "若得者善，若不口語索，得十二默然求。",
        "translation": "If he attains it, it's good; if he doesn't verbally ask for it, he'll attain twelve silent requests.",
        "source": "T24n1462_015:0775c08_20"
    },
    {
        "source_sentence": "若一語索，破二默然，二語索，破四默然，若三語索，破六默然，乃至六語索，",
        "translation": "If he asks with one word, breaks two silences and is silent; if he asks with two words, breaks four silences and is silent; if he asks with three words, breaks six silences and is silent; or if he asks with six words.",
        "source": "T24n1462_015:0775c09_21"
    },
    {
        "source_sentence": "破十二默然，若更往索，得衣者尼薩耆。",
        "translation": "If he breaks the twelve precepts and remains silent, or if he goes to ask for more, he'll get his robe from a nun.",
        "source": "T24n1462_015:0775c11_22"
    },
    {
        "source_sentence": "若一日一往一索，如是得六日往。",
        "translation": "If he goes back and forth once every day, he'll thus get six days to go back.",
        "source": "T24n1462_015:0775c12_23"
    },
    {
        "source_sentence": "若一日一往六語索，後不得更往索，亦不得默然。",
        "translation": "If he asks for it once every day in six words, he won't be allowed to ask for it again after that, and he won't be allowed to remain silent.",
        "source": "T24n1462_015:0775c13_24"
    },
    {
        "source_sentence": "若不得衣，隨衣價來處，往語言：『我於汝財竟不得用，汝自知，莫使失。』",
        "translation": "If you don't obtain a garment, follow the price of the garment to where it comes from and say, 'I won't use your possessions; you know for yourself that you won't lose them.'",
        "source": "T24n1462_015:0775c14_25"
    },
    {
        "source_sentence": "若不得衣，應自往報衣主，不得使人往報，若使人報犯突吉羅罪。」",
        "translation": "If he doesn't obtain the robe, he should go and report it to the owner of the robe; if he doesn't send someone else to report it, or if he sends someone else to report it, he'll be guilty of a grave offense.",
        "source": "T24n1462_015:0775c16_0"
    },
    {
        "source_sentence": "法師曰：「執事人有二種：一者指示，二者不指示。",
        "translation": "The teacher of the Dharma said, There are two kinds of people who administer things: those who instruct and those who don't instruct.",
        "source": "T24n1462_015:0775c17_1"
    },
    {
        "source_sentence": "指示有二種。",
        "translation": "There are two kinds of instructions.",
        "source": "T24n1462_015:0775c18_2"
    },
    {
        "source_sentence": "何者二種？",
        "translation": "What are these two kinds?",
        "source": "T24n1462_015:0775c19_3"
    },
    {
        "source_sentence": "一者比丘指示，二者使者指示。",
        "translation": "One is to instruct the monk, and the other is to instruct the messenger.",
        "source": "T24n1462_015:0775c19_4"
    },
    {
        "source_sentence": "不指示者，復有二種：一者自不現前，二者他不現前。",
        "translation": "There are also two kinds of those who aren't instructed: first, they don't show themselves, and second, they don't show others.",
        "source": "T24n1462_015:0775c20_0"
    },
    {
        "source_sentence": "是名四執事人。」",
        "translation": "These are called the four kinds of clerks.",
        "source": "T24n1462_015:0775c21_1"
    },
    {
        "source_sentence": "法師曰：「云何使者指示？」",
        "translation": "The teacher of the Dharma said, What's the messenger's instructions?",
        "source": "T24n1462_015:0775c21_2"
    },
    {
        "source_sentence": "答曰：「若有居士為比丘買衣，使者往至比丘所，使者到已語比丘言：『大德！",
        "translation": "Answer: If a householder buys clothing for a monk, the messenger goes to the monk's place, and when the messenger arrives, he says to the monk, 'Mañjuśrī!",
        "source": "T24n1462_015:0775c22_3"
    },
    {
        "source_sentence": "某居士遣我送衣價，願大德受。』",
        "translation": "A certain householder sent me the price of my robe, and I'd like to accept it, Mañjuśrī.'",
        "source": "T24n1462_015:0775c23_4"
    },
    {
        "source_sentence": "比丘答言：『此是不淨物，比丘不得受。』",
        "translation": "The monk answered, 'This is an impure thing that a monk can't accept.'",
        "source": "T24n1462_015:0775c24_5"
    },
    {
        "source_sentence": "使者復言：『大德！",
        "translation": "The messenger again said, 'O great virtuous one!",
        "source": "T24n1462_015:0775c25_6"
    },
    {
        "source_sentence": "有執事人不？』",
        "translation": "Is there an appropriator?'",
        "source": "T24n1462_015:0775c25_7"
    },
    {
        "source_sentence": "比丘答言：『無。』",
        "translation": "The monk replied, 'No.'",
        "source": "T24n1462_015:0775c26_8"
    },
    {
        "source_sentence": "使者自覓執事人，得已將至比丘所，語比丘言：『此人能為大德作執事人。』",
        "translation": "The messenger searched for someone to serve him, and when he found them, he went to the monk's place and said to the monk, 'This person can be a servant for the great virtuous one.'",
        "source": "T24n1462_015:0775c26_9"
    },
    {
        "source_sentence": "即持直付執事人，使者對比丘前語執事人：『汝可持此直買衣與比丘。』",
        "translation": "He then took it and handed it directly to the keeper, who said to the monk in front of him, 'Take this and buy his robes and give them to the monk.'",
        "source": "T24n1462_015:0775c28_10"
    },
    {
        "source_sentence": "若有執事人，比丘語使者言：『執事人在某村某處，名某甲。』",
        "translation": "If there's an appropriator, the monk says to the messenger, 'The appropriator is in a certain village or place named so-and-so.'",
        "source": "T24n1462_015:0776a01_11"
    },
    {
        "source_sentence": "使者往至執事人所，語執事人言：『汝可持此直買衣與某甲比丘。』",
        "translation": "The messenger went to the person in charge and said to the person in charge, 'Take this straightforward robe and give it to a certain monk.'",
        "source": "T24n1462_015:0776a02_12"
    },
    {
        "source_sentence": "付已還至比丘所，語言：『大德所示執事人，我已付衣直，大德須衣往取。』",
        "translation": "After he had given it, he returned to the monk and said, 'The great virtuous man showed me the person who was in charge, saying, 'I've given my robe straight away, and the great virtuous man needs his robe to go and get it.'",
        "source": "T24n1462_015:0776a04_0"
    },
    {
        "source_sentence": "使者付衣直已，若不自來報比丘，遣人來報語比丘言：『大德所示執事人，",
        "translation": "If the messenger had given his robes straight away, and if he hadn't reported back to the monk himself, he sent someone to report back to the monk, saying, 'The great virtuous man showed me the servant who was in charge.",
        "source": "T24n1462_015:0776a05_1"
    },
    {
        "source_sentence": "已付衣直。",
        "translation": "I've already paid for my robe and straightened it.",
        "source": "T24n1462_015:0776a07_2"
    },
    {
        "source_sentence": "大德須衣往取，當與大德衣。』",
        "translation": "The great virtuous one needs the robe and goes to get it, and he'll give it to the great virtuous one.'",
        "source": "T24n1462_015:0776a07_3"
    },
    {
        "source_sentence": "是名四種執事人。",
        "translation": "These are called the four kinds of people who cling to things.",
        "source": "T24n1462_015:0776a08_4"
    },
    {
        "source_sentence": "是故律本中說，比丘若有執事人，信心敬法，可以直付之，若汝等須衣，",
        "translation": "That is why the text of the Vinaya says: If a bhikṣu has an attendant, he should pay it directly to him with faith and reverence for the dharma.",
        "source": "T24n1462_015:0776a08_5"
    },
    {
        "source_sentence": "當往取，當取淨物，不受金銀，以此因緣方便，可得受金銀，除此無受金銀法。",
        "translation": "You should go and get it, take the pure things, and not accept gold or silver. Because of these causes and conditions, through skillful means you can accept gold and silver; except for this, you won't accept gold or silver as a dharma.",
        "source": "T24n1462_015:0776a10_6"
    },
    {
        "source_sentence": "若使者語執事人：『可持此直買衣與某甲比丘。』",
        "translation": "Suppose an envoy says to the person in charge, 'Take this straightforward robe and give it to a certain monk.'",
        "source": "T24n1462_015:0776a12_7"
    },
    {
        "source_sentence": "比丘付執事人衣直已，不報比丘，比丘不得就執事人求衣，若求得衣突吉羅罪。",
        "translation": "After a monk gives his robe to the person holding it straight away and doesn't report it to the monk, the monk mustn't go to the person holding it to ask for his robe, or he'll be guilty of the grave offense of purgatory if he asks for his robe.",
        "source": "T24n1462_015:0776a13_8"
    },
    {
        "source_sentence": "若有居士，持金銀往比丘所，語比丘言：『持此金銀與眾僧，願大德受，",
        "translation": "Suppose there is a householder who, carrying gold and silver, goes to the place where the bhikṣu resides. He says to the bhikṣus: “Take this gold and silver and give it to the sangha.",
        "source": "T24n1462_015:0776a15_9"
    },
    {
        "source_sentence": "為作僧伽藍，作食堂若園田。』",
        "translation": "It's for the sake of making a saṃghârāma or a dining hall or a garden.'",
        "source": "T24n1462_015:0776a17_10"
    },
    {
        "source_sentence": "比丘不得受，若受得突吉羅罪。",
        "translation": "A monk who doesn't allow it is guilty of a grave offense if he receives it.",
        "source": "T24n1462_015:0776a18_0"
    },
    {
        "source_sentence": "教令付淨人，後得為處分料理。",
        "translation": "He teaches to entrust it to the pure person, who will then be able to take care of it as a part of his place.",
        "source": "T24n1462_015:0776a18_1"
    },
    {
        "source_sentence": "若使人不解，比丘得教淨人為受，後得隨處處用。",
        "translation": "If an envoy doesn't understand it, the monk can teach the pure person to accept it and then use it anywhere.",
        "source": "T24n1462_015:0776a19_2"
    },
    {
        "source_sentence": "「若居士持金銀布施眾僧，教作飲食、衣服、湯藥、臥具，不得自受。",
        "translation": "Suppose a householder takes gold and silver cloth to give it to the saṃgha and teaches them to make food, drink, clothing, hot water, medicine, and bedding, but they won't accept it for themselves.",
        "source": "T24n1462_015:0776a20_3"
    },
    {
        "source_sentence": "若眾僧受金銀，後得飲食、衣服受用，得突吉羅罪。",
        "translation": "If the saṃgha accepts gold and silver and later receives food, drink, clothing, and other things that are used by the saṃgha, it's a grave offense.",
        "source": "T24n1462_015:0776a22_4"
    },
    {
        "source_sentence": "若眾僧不受，居士不解將還，知律比丘路見語言：『汝與眾僧，何以將歸？』",
        "translation": "If the saṃgha doesn't accept it, and the householder doesn't understand that he's about to return, the monk who knows the rules of the precepts sees a monk on the road and says, 'Why are you going back with the saṃgha?'",
        "source": "T24n1462_015:0776a23_5"
    },
    {
        "source_sentence": "居士聞已解，即還付與淨人。",
        "translation": "When the householder heard this, he understood it and returned it to the pure man.",
        "source": "T24n1462_015:0776a25_6"
    },
    {
        "source_sentence": "若居士布施隨處用，比丘不得迴換，若迴換餘用者，突吉羅罪。",
        "translation": "If a householder gives alms and uses it anywhere, the monk won't be allowed to exchange it; if he exchanges it for another use, it's a grave offense.",
        "source": "T24n1462_015:0776a25_7"
    },
    {
        "source_sentence": "若施作房舍住處無食，眾僧各欲散去，無人守護，得減房直糴食，以供守房舍人食，",
        "translation": "If you donate to make a dwelling and live in a place where there's no food, and each of the saṃgha wants to disperse and leave it without someone to guard it, you'll be allowed to reduce your living quarters and provide food for the person guarding the dwelling.",
        "source": "T24n1462_015:0776a27_8"
    },
    {
        "source_sentence": "若如此迴換用者無罪。",
        "translation": "It's no offense if someone uses it for this kind of exchange.",
        "source": "T24n1462_015:0776a29_9"
    },
    {
        "source_sentence": "若四方眾僧房舍物，若住處無食，眾僧欲散去，得減房物以供食用得。",
        "translation": "If the property of the saṃgha's living quarters in the four directions, or if there's no food where they live, and the saṃgha wants to disperse it, they can reduce their living quarters to be used for food.",
        "source": "T24n1462_015:0776a29_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1462_015:0776b02_11"
    },
    {
        "source_sentence": "為守護住處故。",
        "translation": "It's because they guard their dwelling place.",
        "source": "T24n1462_015:0776b02_12"
    },
    {
        "source_sentence": "雖爾不得盡用。",
        "translation": "Even so, it can't be used up.",
        "source": "T24n1462_015:0776b03_13"
    },
    {
        "source_sentence": "若居士布施田池，比丘不得受。",
        "translation": "If a householder gives alms to a field or pond, the monk won't accept it.",
        "source": "T24n1462_015:0776b03_14"
    },
    {
        "source_sentence": "云何不得受？",
        "translation": "How can it not be received?",
        "source": "T24n1462_015:0776b04_15"
    },
    {
        "source_sentence": "比丘語居士言：『比丘法不得受田池。』",
        "translation": "The monk said to the householder, 'The monk's teaching is that a monk mustn't accept a field or pond.'",
        "source": "T24n1462_015:0776b04_16"
    },
    {
        "source_sentence": "居士語比丘言：『此田池中能生四種淨物，用供養眾僧。』",
        "translation": "The householder said to the monk, 'The four kinds of pure things that can be produced in this field or pond are used to support the saṃgha.'",
        "source": "T24n1462_015:0776b05_17"
    },
    {
        "source_sentence": "若如是者得受。",
        "translation": "If it's like this, they'll receive it.",
        "source": "T24n1462_015:0776b06_18"
    },
    {
        "source_sentence": "若居士言：『以池布施眾僧，使洗浴浣濯，及一切眾生飲隨意用。』",
        "translation": "Suppose a householder says, 'I give a pond to the saṃgha to wash, bathe, and rinse it out, and all sentient beings drink it as they wish.'",
        "source": "T24n1462_015:0776b07_19"
    },
    {
        "source_sentence": "若如是施池得受。",
        "translation": "If someone thus gives to a pond, they'll be able to receive it.",
        "source": "T24n1462_015:0776b08_20"
    },
    {
        "source_sentence": "若居士不解語，但言施池，比丘答言：『出家人法不聽受池，若布施淨水當受。』",
        "translation": "If a householder doesn't understand the words but says, 'Give alms to the pond, and the monk replies, 'The renunciant won't listen to the rules for accepting the pond; if he gives alms with pure water, he'll accept it.'",
        "source": "T24n1462_015:0776b09_21"
    },
    {
        "source_sentence": "居士答言：『善哉大德！",
        "translation": "The householder replied, 'Good, Mañjuśrī!",
        "source": "T24n1462_015:0776b11_22"
    },
    {
        "source_sentence": "本施水。』",
        "translation": "He originally gave water.'",
        "source": "T24n1462_015:0776b11_23"
    },
    {
        "source_sentence": "如此言得受。",
        "translation": "Thus, it's said to be received.",
        "source": "T24n1462_015:0776b11_24"
    },
    {
        "source_sentence": "若居士猶不解語，但言布施而已，於後命過，比丘不得受用。",
        "translation": "If a householder still doesn't understand words and simply says generosity, then the monk won't be allowed to accept it because of his fault in later life.",
        "source": "T24n1462_015:0776b12_25"
    },
    {
        "source_sentence": "若居士有兒孫，比丘應教兒孫布施，若斷種無兒孫，可向聚落老宿言：『此居士不解布施，",
        "translation": "If a householder has children and grandchildren, the monk should teach them to give almsgiving. If they cut off their seeds and have no children or grandchildren, they can address the village elders and tell them, “This householder doesn’t understand generosity.",
        "source": "T24n1462_015:0776b13_26"
    },
    {
        "source_sentence": "命已過，比丘不得受用。",
        "translation": "After his life has passed, the monk won't be allowed to use it.",
        "source": "T24n1462_015:0776b15_27"
    },
    {
        "source_sentence": "長者自知。』",
        "translation": "The elder knows for himself.'",
        "source": "T24n1462_015:0776b16_28"
    },
    {
        "source_sentence": "長者語比丘言：『弟子以水布施眾僧。』",
        "translation": "The elder said to the monk, 'My disciple gave water to the saṃgha.'",
        "source": "T24n1462_015:0776b16_29"
    },
    {
        "source_sentence": "若如是布施者，比丘得受用無罪，不得受金銀錢。",
        "translation": "If someone gives in this way, the monk is not guilty if he receives and uses it, and he won't receive gold or silver coins.",
        "source": "T24n1462_015:0776b17_30"
    },
    {
        "source_sentence": "若居士持米布施，及甘果衣服飲食，一切得受。",
        "translation": "Suppose a householder takes rice as an offering, and he receives it with sweet fruits, clothing, food, and drink.",
        "source": "T24n1462_015:0776b18_31"
    },
    {
        "source_sentence": "若居士自施淨食得受，不得自為身，教居士及請人作飲食，若得亦不得食。」",
        "translation": "If a householder gives pure food for himself and obtains it, he mustn't accept it for his own sake; he teaches the householder or someone who asks him to make food and drink, and if he gets it, he won't eat it.",
        "source": "T24n1462_015:0776b19_32"
    },
    {
        "source_sentence": "法師曰：「往昔有一比丘，在質多羅山住，欲得䴵食，出庭前見諸居士，",
        "translation": "The Master said, “Once long ago there was a bhikṣu living on Mount Citrā who wished to obtain some delicious food. He came out of the court and saw the householders in front of him.",
        "source": "T24n1462_015:0776b21_33"
    },
    {
        "source_sentence": "以水泥地現為䴵相，發口言：『云何得如是䴵明日供眾僧？』",
        "translation": "Using the manifestation of the earth as a crude characteristic, he spoke out, saying, 'How can such crudeness be offered to the saṃgha tomorrow?'",
        "source": "T24n1462_015:0776b23_34"
    },
    {
        "source_sentence": "居士即解已，便還家中作如是䴵，明朝持來供養眾僧。",
        "translation": "The householder then got rid of it, returned home, made such a bowl, and presented it to the saṃgha in the morning as an offering.",
        "source": "T24n1462_015:0776b24_35"
    },
    {
        "source_sentence": "上座知不受，諸下座見上座不受，亦各不受。",
        "translation": "The superior monks know they won't accept it, but the inferior monks see the superior monks who won't accept it, and each doesn't accept it either.",
        "source": "T24n1462_015:0776b26_36"
    },
    {
        "source_sentence": "往昔知足比丘，現相如是，猶不得食，況今為身求而得食也！",
        "translation": "In the past, such was the appearance of a well- satisfied monk who still couldn't eat, so why wouldn't he get food if he were seeking it for his own sake?",
        "source": "T24n1462_015:0776b27_37"
    },
    {
        "source_sentence": "布施園不得受，如前說無異。",
        "translation": "The grove of generosity won't be accepted, just as explained above.",
        "source": "T24n1462_015:0776b28_38"
    },
    {
        "source_sentence": "若布施阿蘭若處及林得受。",
        "translation": "If he gives alms to a place or forest in a forest, he'll be able to receive it.",
        "source": "T24n1462_015:0776b29_39"
    },
    {
        "source_sentence": "後人破林為田，得米甘果飲食得受，若不與不得強責。",
        "translation": "If someone later breaks down a forest into fields and obtains rice, sweet fruit, food, and drink, they can accept it; if they don't give it to them, they won't be punished.",
        "source": "T24n1462_015:0776c01_40"
    },
    {
        "source_sentence": "若前破林為田人罷，後人來作，應責直。",
        "translation": "If someone breaks down a forest in front of you and stops it as a farmer, and someone comes after him to do so, they should be reprimanded.",
        "source": "T24n1462_015:0776c02_41"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1462_015:0776c03_42"
    },
    {
        "source_sentence": "為己成田故。",
        "translation": "It's because they form their own field for themselves.",
        "source": "T24n1462_015:0776c03_43"
    },
    {
        "source_sentence": "若有人欲賃田，不得受金銀，淨物得受。",
        "translation": "If someone wants to lease land, they mustn't accept gold or silver, and the pure things can be accepted.",
        "source": "T24n1462_015:0776c03_44"
    },
    {
        "source_sentence": "若賃田人不知處所問比丘，若有知畔齊，應示處所，若不知勿妄示也。",
        "translation": "If a leaseholder doesn't know where to ask the monk, and if he knows the shore, he should show him where to go; if he doesn't know it, don't show it falsely.",
        "source": "T24n1462_015:0776c04_45"
    },
    {
        "source_sentence": "若有人布施眾僧奴，不得受，若言施淨人或言執事人得受。",
        "translation": "If someone gives alms to the saṃgha as a slave, they can't accept it, and if they say they give it to a pure person or to a servant who serves them, they can accept it.",
        "source": "T24n1462_015:0776c06_46"
    },
    {
        "source_sentence": "若眾僧淨人，若朝為眾僧作食，中後自營覓，中前得與食，中後不得與食；",
        "translation": "If the members of the sangha are pure persons and if they cook food for the sangha in the morning, they should make their own offerings at midday or at night. They may be given food before noon but not after noon.",
        "source": "T24n1462_015:0776c08_47"
    },
    {
        "source_sentence": "衣一切不得與。",
        "translation": "All the robes can't be given.",
        "source": "T24n1462_015:0776c09_48"
    },
    {
        "source_sentence": "若半月為眾僧驅使，得與衣食，半月自作，眾僧不得與衣食。",
        "translation": "If he is expelled by the saṃgha for half a month and given food and clothing, or if he does so himself for half a month, the saṃgha won't be allowed to give food and clothing.",
        "source": "T24n1462_015:0776c10_49"
    },
    {
        "source_sentence": "若都不為眾僧執作驅使，自為己營覓，後得直與眾僧得受，若不與不得就責也。",
        "translation": "If they don't make an envoy for the saṃgha and look for it for themselves, then they'll be given directly to the saṃgha to receive it, and if they don't give it, they won't be able to reprimand them.",
        "source": "T24n1462_015:0776c11_50"
    },
    {
        "source_sentence": "若施牛羊不得受，若言施乳酪等五味得受，餘一切畜生亦爾。」",
        "translation": "If he gives to cattle and sheep, they won't accept it; if he says he gives five flavors like milk and cheese, the same goes for all other animals.",
        "source": "T24n1462_015:0776c13_51"
    },
    {
        "source_sentence": "法師曰：「次第文句易解耳。",
        "translation": "The teacher of the Dharma said, sequential texts and phrases are easy to understand.",
        "source": "T24n1462_015:0776c15_52"
    },
    {
        "source_sentence": "王臣戒因緣本起，身心口業三受，此是制罪，不以不知故得脫。",
        "translation": "The king's ministers and precepts are originally produced by the causes and conditions for the three sensations of body, mind, and speech, which are punishable by being freed because they don't know.",
        "source": "T24n1462_015:0776c15_53"
    },
    {
        "source_sentence": "「爾時佛住阿羅毘城。",
        "translation": "At the time, the Buddha was staying in the city of Ārāvarī.",
        "source": "T24n1462_015:0776c18_0"
    },
    {
        "source_sentence": "憍賒耶敷具者，平地布置。",
        "translation": "A bed of woolen cloth is arranged on a level surface.",
        "source": "T24n1462_015:0776c18_1"
    },
    {
        "source_sentence": "以酢漿灑雜者，乃至雜憍賒耶一毛尼薩耆。",
        "translation": "It's sprinkled with vinegar and juice, up to the point where it's mixed with a hair of miscellaneous woolen silk.",
        "source": "T24n1462_015:0776c19_2"
    },
    {
        "source_sentence": "憍賒耶毛者，糸中微細者是也，此敷具是氈作，非織物也。」",
        "translation": "The woolen hairs are the subtleties in the silk, and these cloths are made of felt and not woven.",
        "source": "T24n1462_015:0776c20_3"
    },
    {
        "source_sentence": "法師曰：「次第文句易解耳。」",
        "translation": "The teacher of the Dharma said, It's easy to understand the sequential text and phrases.",
        "source": "T24n1462_015:0776c21_4"
    },
    {
        "source_sentence": "「爾時佛在毘舍離城於高閣講堂。",
        "translation": "At the time, the Buddha was in Vaiśālī's city in a high pavilion and lecture hall.",
        "source": "T24n1462_015:0776c23_0"
    },
    {
        "source_sentence": "純黑羺羊毛者，不雜餘毛。",
        "translation": "A pure black woolen sheep hair is not mixed with other hairs.",
        "source": "T24n1462_015:0776c23_1"
    },
    {
        "source_sentence": "次第文句易可解耳，不須廣說。",
        "translation": "The sequential text and phrases are easy to understand, so there's no need to explain them in detail.",
        "source": "T24n1462_015:0776c24_2"
    },
    {
        "source_sentence": "純黑羺羊毛竟。",
        "translation": "It's pure black and covered with woolen hair.",
        "source": "T24n1462_015:0776c25_3"
    },
    {
        "source_sentence": "「爾時佛住舍衛國祇樹給孤獨園精舍。",
        "translation": "It was then that the Buddha stayed at the Anāthapiṇḍada Park monastery in Jeta Grove in Śrāvastī.",
        "source": "T24n1462_015:0776c26_0"
    },
    {
        "source_sentence": "安邊者，以少白毛置邊也。",
        "translation": "An edge is placed by placing a little white hair at the edge.",
        "source": "T24n1462_015:0776c26_1"
    },
    {
        "source_sentence": "律中已解，不須廣說。",
        "translation": "The explanation is already given in the Vinaya. It need not be explained in detail.",
        "source": "T24n1462_015:0776c27_2"
    },
    {
        "source_sentence": "「爾時佛住舍衛國祇樹給孤獨園。",
        "translation": "It was then that the Buddha stayed at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1462_015:0776c29_0"
    },
    {
        "source_sentence": "除病比丘者，若病比丘欲往餘處，嫌臥具重不能將行，眾僧為羯磨，得作新臥具。",
        "translation": "If a sick monk wishes to go to another place and dislikes bedding that's heavy and can't walk, the saṃgha will make new bedding for him as a karman for the monks.",
        "source": "T24n1462_015:0776c29_1"
    },
    {
        "source_sentence": "若病未差得隨意作，若病差已更發，不須更羯磨，得用先羯磨。」",
        "translation": "If the illness isn't yet healed, they can do it as they wish, and if the illness has healed and is healed again, they don't need to perform another karma; they can use the previous karma.",
        "source": "T24n1462_015:0777a02_2"
    },
    {
        "source_sentence": "法師曰：「次第文句易可解，不須廣說。",
        "translation": "The Master said, “The sequential order of syllables is easy to understand. It need not be explained in detail.",
        "source": "T24n1462_015:0777a04_3"
    },
    {
        "source_sentence": "「爾時佛住舍衛國祇樹給孤獨園精舍，尼師檀戒中，諸比丘我欲入靜處三月日。」",
        "translation": "At the time, the Buddha was staying at the Anāthapiṇḍada Park monastery in Jeta's Grove in Śrāvastī, and on the three-monthly day, monks, I want to enter a quiet place for three months.",
        "source": "T24n1462_015:0777a06_0"
    },
    {
        "source_sentence": "法師曰：「世尊何以入靜處三月日？",
        "translation": "The teacher of the Dharma said, Bhagavān, why did you enter a quiet place for three months?",
        "source": "T24n1462_015:0777a07_1"
    },
    {
        "source_sentence": "世尊遍觀眾生，於三月中無得道者，是以入靜處三月。",
        "translation": "The Bhagavān universally observes that there's no one who attains enlightenment in three months, so he enters a quiet place for three months.",
        "source": "T24n1462_015:0777a08_2"
    },
    {
        "source_sentence": "『我入後當有如是事，比丘既聞我語已，必立非法制，優波斯那朋健陀子，",
        "translation": "'After I enter, there will be such a thing. If a monk hears my words, he must posit an unlawful restraints. Upāsena Pūrgaṃdharaputra,",
        "source": "T24n1462_015:0777a10_3"
    },
    {
        "source_sentence": "當破此制入至我處，我見已當得讚歎。",
        "translation": "You will break this rule and enter my place, and after you see me, you'll be praised.",
        "source": "T24n1462_015:0777a11_4"
    },
    {
        "source_sentence": "因優波斯那朋健陀子，多比丘受頭陀法，來得見我，我靜處三月竟，將諸比丘按行諸房，",
        "translation": "Because of this, Upāsanna Pāṇgaṃdharaputra, a son of many monks who had undergone the ascetic practices, came to see me. I remained in seclusion for three months and led the monks on their way to my quarters.",
        "source": "T24n1462_015:0777a12_5"
    },
    {
        "source_sentence": "見尼師檀處處狼藉，因尼師檀，我當為比丘結戒。』",
        "translation": "Seeing that the nun's sandalwood is everywhere in disarray, I will conclude the precepts for the monk because of the nun's sandalwood.'",
        "source": "T24n1462_015:0777a14_6"
    },
    {
        "source_sentence": "世尊作是念已，即靜處三月日。",
        "translation": "After the Bhagavān had this thought, it was the third month's day in a quiet place.",
        "source": "T24n1462_015:0777a16_7"
    },
    {
        "source_sentence": "於是優波斯那朋健陀子佛至往所者，長老優波斯那，與弟子年未滿二十受具足戒，",
        "translation": "When Upāsena, the son of Pāṇgaṃdhara, the Buddha, arrived at that place, the elder Upāsena and his disciples, under twenty years old, received the full set of precepts.",
        "source": "T24n1462_015:0777a16_8"
    },
    {
        "source_sentence": "得突吉羅罪，於騫陀迦中呵責言：『汝癡人，汝未滿十臘，云何而輒與未滿二十年人受具足戒？』",
        "translation": "Attaining the offense of purgatory, he was reprimanded in Gandhāra and said, 'You foolish man, why would you so easily accept the full precepts for someone under 20 years old if you hadn't fulfilled them?'",
        "source": "T24n1462_015:0777a19_0"
    },
    {
        "source_sentence": "復不解教授，乃遣餘人教授，優波斯那得呵責已，禮佛而去，心自念言：『我是善男子出家，",
        "translation": "Upāsna, having been reprimanded, venerated the Buddha and departed. He thought to himself, “I am a son of a virtuous family who renounced domestic life.",
        "source": "T24n1462_015:0777a21_1"
    },
    {
        "source_sentence": "非惡心出家，云何為弟子故，而得呵責？",
        "translation": "If someone doesn't leave home with bad intentions, how can they be reprimanded for the sake of their disciples?",
        "source": "T24n1462_015:0777a23_2"
    },
    {
        "source_sentence": "我當去十由旬住，教授弟子令威儀齊整，如我無異。』",
        "translation": "I will go and stay ten yojanas away, teaching my disciples to be correct in their manner, just as I am.'",
        "source": "T24n1462_015:0777a24_3"
    },
    {
        "source_sentence": "然後往問訊世尊，因弟子威儀如法故，而得讚歎。",
        "translation": "He then went to the Bhagavān and greeted him. Because of his disciples' manner in accordance with the Dharma, he was praised.",
        "source": "T24n1462_015:0777a25_4"
    },
    {
        "source_sentence": "是故律本中說，佛問比丘：『汝心樂著納衣不？』",
        "translation": "That's why it's said in the text of the Vinaya, 'The Buddha asked the monk, 'Does your mind delight in wearing undergarments?'",
        "source": "T24n1462_015:0777a26_5"
    },
    {
        "source_sentence": "比丘答言：『實不樂著，為隨師故著。』",
        "translation": "The monk answered, 'I really don't delight in attachment; I'm addicted for the sake of following my teacher.'",
        "source": "T24n1462_015:0777a27_6"
    },
    {
        "source_sentence": "佛即讚言：『善哉，善哉！",
        "translation": "The Buddha then praised him, saying, 'Good, good!'",
        "source": "T24n1462_015:0777a28_7"
    },
    {
        "source_sentence": "優波斯那！",
        "translation": "Upāsena!",
        "source": "T24n1462_015:0777a29_8"
    },
    {
        "source_sentence": "善能教授弟子威儀具足。』",
        "translation": "He's well able to teach the disciples with proper demeanor.'",
        "source": "T24n1462_015:0777a29_9"
    },
    {
        "source_sentence": "佛告諸比丘者：『佛見尼師檀處處狼藉。』",
        "translation": "The Buddha told the monks, 'The Buddha saw that the nun Shitan's place was in disarray.'",
        "source": "T24n1462_015:0777a29_10"
    },
    {
        "source_sentence": "佛告諸比丘：『信心布施使得受用，莫令損失。』",
        "translation": "The Buddha told the monks, 'believe in generosity so that they'll receive it and don't lose it.'",
        "source": "T24n1462_015:0777b01_11"
    },
    {
        "source_sentence": "佛已種種方便者，佛已無數方便為諸比丘說法。",
        "translation": "The Buddha has taught the Dharma to the monks with various skillful means, and the Buddha has taught the Dharma for the monks with countless skillful means.",
        "source": "T24n1462_015:0777b02_12"
    },
    {
        "source_sentence": "故尼師檀者，下至一經坐，是名故也。",
        "translation": "That's why it's called a nun sitting down to one sūtra seat.",
        "source": "T24n1462_015:0777b04_13"
    },
    {
        "source_sentence": "取少許者，四邊隨取一邊，或方或圓取帖新者上，若不能帖，細擘雜新者作亦得。」",
        "translation": "Someone who takes a little bit of it takes one side at each of the four sides, or they may take what's new in either direction or roundness and place it on top of the new one; if they can't place it, finely break it up and mix it with the new one to make it, and they'll get it as well.",
        "source": "T24n1462_015:0777b05_0"
    },
    {
        "source_sentence": "法師曰：「餘次第文句在律中，不須廣說。",
        "translation": "The teacher of the Dharma said, The rest of the sentences in order are found in the vinaya, so there's no need to explain them in detail.",
        "source": "T24n1462_015:0777b06_1"
    },
    {
        "source_sentence": "因緣本起如前。",
        "translation": "The causes and conditions that originally arise are as before.",
        "source": "T24n1462_015:0777b07_2"
    },
    {
        "source_sentence": "尼師檀戒竟。",
        "translation": "After finishing the precepts for nuns and masters, he said.",
        "source": "T24n1462_015:0777b08_3"
    },
    {
        "source_sentence": "「爾時佛住舍衛國祇樹給孤獨精舍，擔羊毛戒。",
        "translation": "It was then that the Buddha stayed at the Anāthapiṇḍada monastery in Jeta Grove in Śrāvastī and carried the sheep-hair precepts.",
        "source": "T24n1462_015:0777b09_0"
    },
    {
        "source_sentence": "弄者，居士道路逢見比丘擔羊毛，問言：『大德！",
        "translation": "When he was playing, the householder met a monk on the road who was carrying sheep's hair and asked, 'Mañjuśrī!",
        "source": "T24n1462_015:0777b10_1"
    },
    {
        "source_sentence": "擔此羊毛何處去？",
        "translation": "Where will you carry this woolen hair?",
        "source": "T24n1462_015:0777b11_2"
    },
    {
        "source_sentence": "何處販賣也？",
        "translation": "Where is it sold?",
        "source": "T24n1462_015:0777b11_3"
    },
    {
        "source_sentence": "賣堪幾直？』",
        "translation": "How much more straightforward is it to sell?'",
        "source": "T24n1462_015:0777b11_4"
    },
    {
        "source_sentence": "比丘聞諸居士戲笑弄已，比丘行至寺已瞋恚擲地，諸比丘問言：『大德！",
        "translation": "After the monks heard the householders laugh and play, the monks went to the monastery and threw their anger on the ground. The monks asked, 'O great virtuous one!",
        "source": "T24n1462_015:0777b12_5"
    },
    {
        "source_sentence": "何處將此羊毛來而瞋恚擲地？』",
        "translation": "Where did you bring this sheep's hair and tosss it on the ground with anger?'",
        "source": "T24n1462_015:0777b13_6"
    },
    {
        "source_sentence": "比丘答言：『我為此羊毛故，為諸居士之所調弄，是以瞋恚擲地。』",
        "translation": "The monk answered, 'It's because of these woolen hair that I'm being tamed by the householders, so I threw it to the ground with anger.'",
        "source": "T24n1462_015:0777b14_7"
    },
    {
        "source_sentence": "自擔者，以欝多羅僧裹而自擔也。",
        "translation": "Self-carrying means to wrap it in a sandalwood monk and carry it on one's own.",
        "source": "T24n1462_015:0777b16_8"
    },
    {
        "source_sentence": "過三由旬者，自擔過三由旬，無人代也，隨毛多少，一一犯尼薩耆罪。",
        "translation": "A person who goes beyond three yojanas commits the misdeed of being a nun if he carries more than three yojanas on his own, and there's no one to replace him, according to the amount of hair they have.",
        "source": "T24n1462_015:0777b16_9"
    },
    {
        "source_sentence": "至三由旬已放地，若以杖撥，或以脚轉，過三由旬，皆尼薩耆罪。",
        "translation": "If he leaves the ground after reaching three yojanas, and if he stops it with a staff or turns it around with his feet more than three yojanas away, it's a misdeed of a nun.",
        "source": "T24n1462_015:0777b18_10"
    },
    {
        "source_sentence": "至三由旬，若虎狼賊難擔出三由旬，悉尼薩耆罪。",
        "translation": "When it reaches three yojanas, if a tiger or wolf or thief is unable to carry it out for three yojanas, they'll be guilty of the sin of siddhârtha.",
        "source": "T24n1462_015:0777b20_0"
    },
    {
        "source_sentence": "若三由旬內為賊劫奪，劫奪已後還比丘，比丘復得擔三由旬不犯。",
        "translation": "If a thief robs the monk within three yojanas and returns to the monk after he robs it, the monk will again be able to bear the burden for three yojanas without violating the precept.",
        "source": "T24n1462_015:0777b21_1"
    },
    {
        "source_sentence": "無罪者，欽婆羅尼師檀已成氈不犯，三由旬內不犯，至三由旬已，有人代擔過三由旬不犯。",
        "translation": "It's not a violation if someone carries a burden for more than three yojanas after it reaches three yojanas and doesn't violate it.",
        "source": "T24n1462_015:0777b22_2"
    },
    {
        "source_sentence": "擔羊毛者，下至塞耳，過三由旬犯罪。」",
        "translation": "A person who carries woolen hair down to their ears and goes beyond three yojanas commits a crime.",
        "source": "T24n1462_015:0777b25_0"
    },
    {
        "source_sentence": "法師曰：「餘次第文句易可解耳，不須廣說。",
        "translation": "The Master said, “The rest of the sentences in order are easy to understand. There is no need to explain them in detail.",
        "source": "T24n1462_015:0777b25_1"
    },
    {
        "source_sentence": "此戒從身心起，不以不知故得脫。",
        "translation": "These precepts arise from body and mind, not because they don't know them or attain liberation.",
        "source": "T24n1462_015:0777b26_2"
    },
    {
        "source_sentence": "羊毛戒廣說竟。",
        "translation": "The womb hair precepts are explained in detail.",
        "source": "T24n1462_015:0777b27_3"
    },
    {
        "source_sentence": "「爾時佛在釋翅瘦迦維羅衛尼拘律園。",
        "translation": "It was then that the Buddha was staying at the Śākyamuni's retreat in Kapilavastu, Kapilavastu and Kauṇḍinya.",
        "source": "T24n1462_015:0777b29_0"
    },
    {
        "source_sentence": "浣羊毛戒者，妨廢坐禪誦經者，比丘尼由為六群比丘浣染擘羊毛故，是以妨廢。",
        "translation": "The precept against washing womb hair is to obstruct those who sit in meditation and recite the sūtras because the bhikṣuṇīs wash, dye, and break sheep hair for six groups of monks, which is why they obstruct them.",
        "source": "T24n1462_015:0777b29_1"
    },
    {
        "source_sentence": "餘文句易可解耳。",
        "translation": "The rest of the sentences are easy to understand.",
        "source": "T24n1462_015:0777c02_2"
    },
    {
        "source_sentence": "浣染擘羊毛戒竟。",
        "translation": "After washing, dyeing, and breaking the sheep hair precepts.",
        "source": "T24n1462_015:0777c03_3"
    },
    {
        "source_sentence": "「爾時佛在羅閱城耆闍崛山中。",
        "translation": "It was then that the Buddha was staying at Mount Gṛdhrakūṭa in Rājagṛha.",
        "source": "T24n1462_015:0777c04_0"
    },
    {
        "source_sentence": "金銀戒者，金者，珂琉璃、珊瑚、一切諸寶及販賣之物，是金銀種類。",
        "translation": "The precept against gold and silver is that gold refers to lapis lazuli, coral, all the treasures, and goods for sale, which are types of gold and silver.",
        "source": "T24n1462_015:0777c04_1"
    },
    {
        "source_sentence": "是故律本中說，下至樹膠錢，國土所用，皆不得捉，亦不得教人捉，悉犯。",
        "translation": "That's why it's said in the text of the vinaya that they can't grasp or teach someone to grasp money from trees up to glue money, and whatever they use in their land is a violation.",
        "source": "T24n1462_015:0777c06_2"
    },
    {
        "source_sentence": "若為身捉，尼薩耆。",
        "translation": "If he takes it for his own sake, it's a kṣatriya.",
        "source": "T24n1462_015:0777c07_3"
    },
    {
        "source_sentence": "若為僧、若為眾乃至一人、若為像捉，悉突吉羅罪。",
        "translation": "If he takes it for the sake of the saṃgha, or for the sake of the congregation up to one person, or for the sake of an image, it's a grave offense.",
        "source": "T24n1462_015:0777c08_4"
    },
    {
        "source_sentence": "無罪者，不自受、不教人受。",
        "translation": "The blameless one doesn't accept it for himself and doesn't teach others to accept it.",
        "source": "T24n1462_015:0777c09_5"
    },
    {
        "source_sentence": "若居士持金銀布施比丘，比丘答言：『不得受。』",
        "translation": "If a householder gives gold and silver to a monk who gives it to him, the monk replies, 'You mustn't accept it.'",
        "source": "T24n1462_015:0777c10_6"
    },
    {
        "source_sentence": "居士復言：『大德！",
        "translation": "The householder again said, 'O great virtuous one!",
        "source": "T24n1462_015:0777c11_7"
    },
    {
        "source_sentence": "我捨心布施已定，不得將還。』",
        "translation": "I've abandoned my mind and given alms, but I won't be allowed to return.'",
        "source": "T24n1462_015:0777c11_8"
    },
    {
        "source_sentence": "放地而去，比丘見居士去已，比丘留守看，又有居士見比丘住此，往問言：『大德！",
        "translation": "When he released the earth and departed, the monk saw that the householder had departed. The monk remained there to watch over him. Another householder saw the monk staying here and went inquiring:",
        "source": "T24n1462_015:0777c12_9"
    },
    {
        "source_sentence": "何以住此？』",
        "translation": "Why are you staying here?'",
        "source": "T24n1462_015:0777c14_10"
    },
    {
        "source_sentence": "比丘答言：『有居士布施此金銀，比丘法不得受此。』",
        "translation": "The monk answered, 'There's a householder who gives this gold and silver as alms, but the monk's teaching doesn't allow him to accept it.'",
        "source": "T24n1462_015:0777c14_11"
    },
    {
        "source_sentence": "居士向比丘言：『大德！",
        "translation": "The householder said to the monk, 'O great virtuous one!",
        "source": "T24n1462_015:0777c15_12"
    },
    {
        "source_sentence": "大德既不得受，布施弟子。』",
        "translation": "Since the great virtuous man can't accept it, he gives it to the disciple.'",
        "source": "T24n1462_015:0777c16_13"
    },
    {
        "source_sentence": "比丘默然，居士承取持去，後居士以此金銀，易飲食衣服淨物與比丘，",
        "translation": "The monks remained silent. The householder took the gold and silver, gave it to the monks for food, drink, clothing, and other goods.",
        "source": "T24n1462_015:0777c16_14"
    },
    {
        "source_sentence": "比丘得受。",
        "translation": "The monks were allowed to receive it.",
        "source": "T24n1462_015:0777c18_15"
    },
    {
        "source_sentence": "若無解法人，金銀在屋中閉戶莫使失，若有賣衣鉢人，比丘喚來示金銀，",
        "translation": "If there are people who don't understand, gold and silver should be kept inside the door without losing it. Suppose there's a man selling robes and bowls, and the monk summons them to show him gold and silver.",
        "source": "T24n1462_015:0777c18_16"
    },
    {
        "source_sentence": "語賣衣鉢人言：『貧道須此衣鉢，有此金銀。",
        "translation": "He said to the merchant of robes and bowls, 'The poor man needed this robe and bowl; there was this gold and silver.",
        "source": "T24n1462_015:0777c20_17"
    },
    {
        "source_sentence": "居士自知。』",
        "translation": "The householder knows for himself.'",
        "source": "T24n1462_015:0777c21_18"
    },
    {
        "source_sentence": "若無賣衣鉢人，有賣非時漿七日藥盡形壽藥，將來至金銀所，語言：『有此金銀，",
        "translation": "If there are no people selling robes and bowls, or if someone sells wine at an ungodly hour, a seven-day medicine for the rest of life that lasts until the end of life, they'll come to gold and silver and say, 'There's this gold and silver.",
        "source": "T24n1462_015:0777c21_19"
    },
    {
        "source_sentence": "眾僧須此藥。",
        "translation": "The saṃgha needed this medicine.",
        "source": "T24n1462_015:0777c23_20"
    },
    {
        "source_sentence": "居士自知。』",
        "translation": "The householder knows for himself.'",
        "source": "T24n1462_015:0777c23_21"
    },
    {
        "source_sentence": "得藥已，眾僧得食用。",
        "translation": "After obtaining the medicine, the monks were allowed to eat it.",
        "source": "T24n1462_015:0777c24_0"
    },
    {
        "source_sentence": "金銀主比丘不得食用，餘白衣淨人乃至畜生，悉不得食。",
        "translation": "A monk who owns gold and silver won't be allowed to eat it, and the other white-robed pure people or even animals won't be allowed to eat it.",
        "source": "T24n1462_015:0777c24_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1462_015:0777c25_2"
    },
    {
        "source_sentence": "為眾僧物故。",
        "translation": "It's because it's for the sake of the property of the saṃgha.",
        "source": "T24n1462_015:0777c26_3"
    },
    {
        "source_sentence": "若不得藥，金銀主置而去，更無方便得受。",
        "translation": "If he doesn't obtain the medicine, the gold and silver owner puts it away and leaves it; there's no way to get it.",
        "source": "T24n1462_015:0777c26_4"
    },
    {
        "source_sentence": "若見優婆塞，喚來教擲去，優婆塞言：『此金銀何以擲去，我當拾取。』",
        "translation": "If he sees an Upāsaka who summons him and teaches him to to toss it away, the Upāsaka says, 'Why are these gold and silver tossed away? I will pick them up.'",
        "source": "T24n1462_015:0777c27_5"
    },
    {
        "source_sentence": "比丘答言：『隨意。』",
        "translation": "The monk answered, 'As you wish.'",
        "source": "T24n1462_015:0777c28_6"
    },
    {
        "source_sentence": "若優婆塞解法，持易衣鉢來與眾僧得受。",
        "translation": "If an upāsaka understands the teaching, he brings his change of robes and bowl to the saṃgha to accept it.",
        "source": "T24n1462_015:0777c29_7"
    },
    {
        "source_sentence": "若無優婆塞可教擲去，眾僧應白二羯磨，一比丘知五法者，將此金銀使閉目擲去，",
        "translation": "If there are no laymen who can teach the tossling away, the saṃgha should report to the two karmas. One monk who knows the five teachings will cause this gold and silver to be tossed away with closed eyes.",
        "source": "T24n1462_015:0778a01_8"
    },
    {
        "source_sentence": "莫記處所，若記處所突吉羅罪。",
        "translation": "Don't remember where you are, or if you remember where you are, it's a grave offense.",
        "source": "T24n1462_015:0778a03_9"
    },
    {
        "source_sentence": "受施用有四種法。",
        "translation": "There are four kinds of ways to receive and use generosity.",
        "source": "T24n1462_015:0778a04_10"
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T24n1462_015:0778a04_11"
    },
    {
        "source_sentence": "一者盜用，二者負債用，三者親友用，四者主用。」",
        "translation": "One is for the use of stealing, two are for the use of debt, three are for the use of friends and relatives, and four are for the use of the owner.",
        "source": "T24n1462_015:0778a04_12"
    },
    {
        "source_sentence": "問曰：「云何盜用？」",
        "translation": "He asked, What's stealing?",
        "source": "T24n1462_015:0778a05_13"
    },
    {
        "source_sentence": "答曰：「若比丘無戒，依僧次受施飲食，是名盜用。」",
        "translation": "He answered, If a monk lacks the precepts and follows the order of the saṃgha to receive food and drink accordingly, this is called stealing.",
        "source": "T24n1462_015:0778a06_14"
    },
    {
        "source_sentence": "「云何負債用？」",
        "translation": "What's the use of debt?",
        "source": "T24n1462_015:0778a07_15"
    },
    {
        "source_sentence": "「若比丘受人飲食衣服，應先作念，若不先作念而受衣食，是名負債用。",
        "translation": "If a monk accepts food, drink, and clothing from someone else, he should first think about it; if he doesn't think about it first but accepts clothing and food, this is called the use of the debt.",
        "source": "T24n1462_015:0778a07_16"
    },
    {
        "source_sentence": "若有聰明智慧信心出家比丘，至受食時，口口作念，若鈍根者，未食時先作一念，",
        "translation": "Suppose there is a bhikṣu who, being intelligent, wise, and faithful, renounces the householder’s life. When he receives food, he keeps this thought in his mouth; if he is dull-witted, he first thinks when he has not yet eaten:",
        "source": "T24n1462_015:0778a09_17"
    },
    {
        "source_sentence": "若鈍根比丘受用衣時，應朝先作一念，利根者著著作念，房舍床席臥具一切受用信施，",
        "translation": "If a dull-rooted monk receives robes for use, he should first think of it with one thought in the morning, and those with sharp roots are mindful of writing, sleeping quarters, beds, seats, bedding, and all the other things he receives as a faith offering.",
        "source": "T24n1462_015:0778a11_18"
    },
    {
        "source_sentence": "應先作念，若不先作念，是名負債用者。",
        "translation": "You should first think about it, and if you don't think about it first, this is called the use of debt.",
        "source": "T24n1462_015:0778a13_19"
    },
    {
        "source_sentence": "若不為障寒障熱及障慚恥而用衣，若不為飢渴疾病而受飲食湯藥，亦名負債。",
        "translation": "If someone doesn't use their robes for the sake of hindrances, coldness, heat, and shame, or if they don't accept food, drink, hot water, and medicine for hunger, thirst, thirst, and illness, it's also called a debt.",
        "source": "T24n1462_015:0778a14_20"
    },
    {
        "source_sentence": "若受飲食衣服，不先作念突吉羅。」",
        "translation": "If he receives food, drink, clothing, and so forth, he doesn't first think of it as a grave offense.",
        "source": "T24n1462_015:0778a16_21"
    },
    {
        "source_sentence": "「云何親友用？」",
        "translation": "What's the use of a friend?",
        "source": "T24n1462_015:0778a17_22"
    },
    {
        "source_sentence": "「七學人受用施物，如子受父物無異，是名親友用。」",
        "translation": "Seven, when a trainee receives and uses something as a gift, just as a child receives the father's property without difference, this is called using it for friends and relatives.",
        "source": "T24n1462_015:0778a17_23"
    },
    {
        "source_sentence": "「云何主用？」",
        "translation": "What's the main function?",
        "source": "T24n1462_015:0778a18_24"
    },
    {
        "source_sentence": "「真人羅漢受用施物。」",
        "translation": "A true arhat receives and uses the things he gives.",
        "source": "T24n1462_015:0778a18_25"
    },
    {
        "source_sentence": "法師曰：「於四種受用中，盜用最惡。",
        "translation": "The Master said, Among the four kinds of enjoyment, stealing is the worst.",
        "source": "T24n1462_015:0778a19_26"
    },
    {
        "source_sentence": "復有四種受用。",
        "translation": "Again, there are four kinds of sensation.",
        "source": "T24n1462_015:0778a20_27"
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T24n1462_015:0778a20_28"
    },
    {
        "source_sentence": "一者有慚愧用，二者無慚愧用，三者有法用，四者無法用。」",
        "translation": "One has the function of being ashamed, two have no function of being ashamed, three have the function of teaching, and four don't have the function of teaching.",
        "source": "T24n1462_015:0778a20_29"
    },
    {
        "source_sentence": "「云何有慚愧用？」",
        "translation": "What's the function of having shame?",
        "source": "T24n1462_015:0778a22_30"
    },
    {
        "source_sentence": "「無慚愧人親近有慚愧人受用無罪，是名有慚愧用。」",
        "translation": "A person without shame who's intimate with a person with shame and experiences no offense when they're used is called having shameful use.",
        "source": "T24n1462_015:0778a22_31"
    },
    {
        "source_sentence": "「云何無慚愧用？」",
        "translation": "What's the use of having no shame?",
        "source": "T24n1462_015:0778a23_32"
    },
    {
        "source_sentence": "「有慚愧人親近無慚愧人受用得罪，是名無慚愧用。",
        "translation": "An ashamed person who's intimate with an ashamed person and takes advantage of someone who's not ashamed to commit a sin is called the use of shamelessness.",
        "source": "T24n1462_015:0778a24_33"
    },
    {
        "source_sentence": "有慚愧人親近無慚愧人，後必當隨其作惡，故名無慚愧人。",
        "translation": "A person with shame who becomes intimate with someone without shame will surely do evil in the future, so he's called a person without shame.",
        "source": "T24n1462_015:0778a25_34"
    },
    {
        "source_sentence": "無慚愧人親近有慚愧人，後必當改惡修善，是名有慚愧人。」",
        "translation": "A person without shame who's intimate with a person with shame and who will surely change what's bad and cultivate what's good afterwards is called a person with shame.",
        "source": "T24n1462_015:0778a26_35"
    },
    {
        "source_sentence": "「云何有法用？」",
        "translation": "How does it have the function of teaching?",
        "source": "T24n1462_015:0778a28_36"
    },
    {
        "source_sentence": "「若有慚愧人用法而得，是名有法用。」",
        "translation": "If there's a shameful person who uses the Dharma to attain it, this is called having the function of the Dharma.",
        "source": "T24n1462_015:0778a28_37"
    },
    {
        "source_sentence": "「云何無法用？」",
        "translation": "How is it useless?",
        "source": "T24n1462_015:0778a29_38"
    },
    {
        "source_sentence": "「無慚愧人不用法而得，若得此物，如得毒藥無異，是名無法用。」",
        "translation": "A person without shame doesn't use the Dharma to obtain it, and if he obtains this thing, it's no different from getting a poisonous medicine, which is called useless.",
        "source": "T24n1462_015:0778a29_39"
    },
    {
        "source_sentence": "法師曰：「餘次第文句已在律中，不須廣說。",
        "translation": "The teacher of the Dharma said, The rest of the sequential sentences are already in the vinaya, so there's no need to explain them in detail.",
        "source": "T24n1462_015:0778b02_40"
    },
    {
        "source_sentence": "此是制罪，身口心業三受，受寶戒廣說竟。",
        "translation": "These are the three forms of restraint: bodily, verbal and mental action is with three forms of acquisition. The one who receives the precept against sexual misconduct has already spoken elaborately.",
        "source": "T24n1462_015:0778b03_41"
    },
    {
        "source_sentence": "「販賣寶戒者，非一種作者，或已成器或未成器。",
        "translation": "The precept against selling jewels is not a type of author, whether it's a vessel that's already made or a vessel that's not yet made.",
        "source": "T24n1462_015:0778b04_42"
    },
    {
        "source_sentence": "頭物者，華釵一切頭所用，悉是頭物。",
        "translation": "A head object is a flower hairpin that's used for all kinds of head hair, which are all head objects.",
        "source": "T24n1462_015:0778b05_43"
    },
    {
        "source_sentence": "鐶釧鉗鎖種種身所裝束，是名成器。",
        "translation": "These are called the formed containers, which are decorated with various kinds of bodies such as patches, bracelets, and fetters.",
        "source": "T24n1462_015:0778b06_44"
    },
    {
        "source_sentence": "已成器易未成器，以未成器易已成器，以突吉羅易尼薩耆波夜提，以尼薩耆波夜提易突吉羅。」",
        "translation": "It's easy to change what's formed into a vessel and what's not formed into a vessel, and it's easy to change what's formed into a vessel with what's not formed into a vessel and what's formed into a vessel with what's formed into a vessel, and it's easy to change what's formed",
        "source": "T24n1462_015:0778b07_45"
    },
    {
        "source_sentence": "問曰：「云何以突吉羅易尼薩耆波夜提？」",
        "translation": "He asked, How do you say it's because of the prātimokṣatriya-paripṛcchā?",
        "source": "T24n1462_015:0778b09_46"
    },
    {
        "source_sentence": "答曰：「以銅錢易金錢，亦得尼薩耆波夜提，是名突吉羅易尼薩耆波夜提。",
        "translation": "He answered, If you exchange money for copper coins and also get a nisajipāyatti with the same amount of money, this is called a tukhāra-paripṛcchāṇḍi.",
        "source": "T24n1462_015:0778b10_47"
    },
    {
        "source_sentence": "以金錢易銅錢，是名尼薩耆波夜提易突吉羅。",
        "translation": "To exchange copper coins for money with gold is called a nisajipāyattika, which is called a tukhāra.",
        "source": "T24n1462_015:0778b12_0"
    },
    {
        "source_sentence": "若以寶易鐵，以此鐵作鉢作斧，隨作一一作器，悉不得用，若用突吉羅罪。」",
        "translation": "If someone exchanges an iron for a bowl made of treasure and makes an axe out of this iron, or makes a container with each one made, they can't use it; it's a grave offense if they use purgatory.",
        "source": "T24n1462_015:0778b13_1"
    },
    {
        "source_sentence": "法師曰：「餘次第文句易可解耳。",
        "translation": "The teacher of the Dharma said, The rest of the sentences in order are easy to understand.",
        "source": "T24n1462_015:0778b14_2"
    },
    {
        "source_sentence": "因緣本起如前戒無異。",
        "translation": "The causes and conditions that originally arise are no different from the previous precepts.",
        "source": "T24n1462_015:0778b15_3"
    },
    {
        "source_sentence": "種種販賣戒，律中已解，更無異義，不復重出。",
        "translation": "The various precepts for selling and selling have been explained in the Vinaya, but there's no different meaning to them, so they won't be repeated.",
        "source": "T24n1462_015:0778b16_4"
    },
    {
        "source_sentence": "若畜長鉢過十日，尼薩耆波夜提。",
        "translation": "If he keeps a long bowl for more than ten days, it's up to Nirvāṇarati.",
        "source": "T24n1462_015:0778b17_5"
    },
    {
        "source_sentence": "尼薩耆鉢，不捨不懺悔，若用突吉羅罪。",
        "translation": "A nun who doesn't abandon or repent of a bhikṣuṇī bowl and doesn't use it commits the sin of purgatory.",
        "source": "T24n1462_015:0778b18_6"
    },
    {
        "source_sentence": "無罪者，未滿十日、若說淨、若受持。」",
        "translation": "A person who doesn't commit a sin doesn't have ten days to say it's pure or accept and uphold it.",
        "source": "T24n1462_015:0778b19_7"
    },
    {
        "source_sentence": "法師曰：「新鉢幾薰堪受持？」",
        "translation": "The teacher of the Dharma said, How many new bowls are capable of being accepted and maintained?",
        "source": "T24n1462_015:0778b20_0"
    },
    {
        "source_sentence": "答曰：「若鐵鉢五薰堪用，若土鉢二薰堪用，若買他鉢，未還直不得受持。",
        "translation": "He answered, If an iron bowl is capable of being used in five ways, if an earthen bowl is capable of being used in two ways, or if he buys another bowl and doesn't return it, he won't be allowed to take it.",
        "source": "T24n1462_015:0778b20_1"
    },
    {
        "source_sentence": "若鉢主言：『但用，然後還直。』",
        "translation": "If the bowl owner says, 'Just use it, and then return straight back.'",
        "source": "T24n1462_015:0778b22_2"
    },
    {
        "source_sentence": "鉢主雖作此語，亦不得受持，還直然後受持。",
        "translation": "Even though the bowl owner made these words, he couldn't accept them, returned straight back, and then accepted them.",
        "source": "T24n1462_015:0778b22_3"
    },
    {
        "source_sentence": "若買鉢已度直竟，鉢主為薰竟報比丘，比丘不往取，過十日犯捨墮。",
        "translation": "If the owner of the bowl has finished purchasing the bowl and straightened it, then he rewards the monk who finishes perfuming it for the sake of the master, and the monk doesn't go there to take it; after ten days, he commits the offense of abandoning it.",
        "source": "T24n1462_015:0778b23_4"
    },
    {
        "source_sentence": "若鉢主薰竟，人知薰竟，傳向比丘道，比丘雖聞語過十日不犯。",
        "translation": "If the owner of the bowl has finished perfuming it, and someone knows that he has finished perfuming it, they'll transmit it to the monk for his instructions, and even though the monk hears the words for more than ten days, he won't violate the precept.",
        "source": "T24n1462_015:0778b25_5"
    },
    {
        "source_sentence": "要聽鉢主報，後過十日對人說受，若無人得獨說受。",
        "translation": "If he wants to hear the bowl owner's reward, he explains it to someone ten days later, and if there's no one else who can do so, he explains it to them alone.",
        "source": "T24n1462_015:0778b27_6"
    },
    {
        "source_sentence": "若失受持者，罷道、死、轉根、捨、穿，是名失受持。",
        "translation": "If someone loses the precepts, they abandon the path, die, change their faculties, equanimity, and penetration, which are called losing the precepts.",
        "source": "T24n1462_015:0778b28_7"
    },
    {
        "source_sentence": "破穿如粟米大，失受持，若以鐵屑補得受持。",
        "translation": "It's as big as a grain of millet that breaks through and loses its support if it's replaced with iron dust.",
        "source": "T24n1462_015:0778b29_8"
    },
    {
        "source_sentence": "因緣本起如前無異。",
        "translation": "The originally arisen causes and conditions are the same as the previous ones.",
        "source": "T24n1462_015:0778c01_9"
    },
    {
        "source_sentence": "長鉢戒廣說竟。",
        "translation": "After explaining the long bowl precepts in detail, he said.",
        "source": "T24n1462_015:0778c02_10"
    },
    {
        "source_sentence": "「舍衛國五種藥者，生酥、熟酥、油、蜜、石蜜。",
        "translation": "“The five kinds of medicine used in Sāvatthī are uncooked butter, cooked butter, oil, honey, and rock honey.",
        "source": "T24n1462_015:0778c02_11"
    },
    {
        "source_sentence": "酥者，一切淨肉乳亦可飲，酥亦中作藥。」",
        "translation": "Goodness means that all pure flesh and milk can also be drunk, and goodness makes medicine in it.",
        "source": "T24n1462_015:0778c03_12"
    },
    {
        "source_sentence": "問曰：「七日藥蠅蟻落中，得服不？」",
        "translation": "He asked, Can I take it for seven days when the medicine flies and ants fall into my mouth?",
        "source": "T24n1462_015:0778c04_13"
    },
    {
        "source_sentence": "答曰：「漉去得服，若今日受酪說。」",
        "translation": "He answered, They'll be able to take it if they dry it away and accept the cheese today.",
        "source": "T24n1462_015:0778c05_14"
    },
    {
        "source_sentence": "「酪中酥為七日藥不？」",
        "translation": "Is the butter in the cream a seven-day medicine?",
        "source": "T24n1462_015:0778c05_15"
    },
    {
        "source_sentence": "「即攢酥至第七日攢得酥，此第七日得服，若至第八日尼薩耆，油、石蜜亦如是。",
        "translation": "On the seventh day he eats butter, and on the seventh day he eats butter. If he eats it on the seventh day, he'll be able to take it; if he reaches nisaji on the eighth day, so too will oil and rock honey.",
        "source": "T24n1462_015:0778c06_16"
    },
    {
        "source_sentence": "若非時受酪、非時攢，若非時受酥，不得服，油、石蜜亦如是。",
        "translation": "If he receives curds at an ungodly hour and butter at an ungodly hour, or if he receives butter at an ungodly hour, he mustn't take them, and so it is with oil and rock honey.",
        "source": "T24n1462_015:0778c08_17"
    },
    {
        "source_sentence": "若鬼病須生肉生血得差，聽服，唯除人血不得服。",
        "translation": "If a ghost's illness requires the production of flesh and blood to be cured, they'll be allowed to take it, but except for human blood, they won't take it.",
        "source": "T24n1462_015:0778c09_18"
    },
    {
        "source_sentence": "若得酥已說，內置器中，此器已盛酥，器中有酥出，與新酥共合，應更說。",
        "translation": "If he has obtained the butter, he explains it and puts it inside a pot that's already filled with butter, produces butter in the pot, and combines it with new butter, he should explain it again.",
        "source": "T24n1462_015:0778c11_19"
    },
    {
        "source_sentence": "若酥至第七日若失，若與白衣、沙彌，若還與酥，若沙彌布施，得食無罪。",
        "translation": "If the butter reaches the seventh day and is lost, it's no offense if he gives it to a white-robed monk or a śrāmaṇer, or if he returns it with the butter, or if he gives it to a śrāmaṇer as a gift, then he'll be allowed to eat it.",
        "source": "T24n1462_015:0778c12_20"
    },
    {
        "source_sentence": "未滿七日布施沙彌，至第八日若有急須用，得就沙彌乞食無罪。」",
        "translation": "If you don't give alms to a novice for less than seven days, and if you have an urgent need on the eighth day, it's no offense to go to the novice to solicit alms.",
        "source": "T24n1462_015:0778c14_21"
    },
    {
        "source_sentence": "法師曰：「餘文句已在律中，不須廣說。",
        "translation": "The teacher of the Dharma said, The rest of the text is already in the Vinaya, so there's no need to explain it in detail.",
        "source": "T24n1462_015:0778c16_22"
    },
    {
        "source_sentence": "此七日藥戒廣說竟。",
        "translation": "This seven-day precept for the prescription of medicine has been extensively explained.",
        "source": "T24n1462_015:0778c17_23"
    },
    {
        "source_sentence": "此是制罪非性罪，從身心起。",
        "translation": "These are the sins of restraint that are not sins by nature, but which arise from body and mind.",
        "source": "T24n1462_015:0778c17_24"
    },
    {
        "source_sentence": "「舍衛國佛聽雨浴衣者，於騫陀迦，因毘舍佉母故，聽受雨衣。",
        "translation": "“The Buddha of Sāvatthī listened to rain and bathing robes, and because of the Vaiśravaṇa mother in Kāṇḍika, he listened to receiving rain robes.",
        "source": "T24n1462_015:0778c18_25"
    },
    {
        "source_sentence": "餘一月未至夏者，應作雨浴衣浣染縫治，四月十六日雨浴衣浣染裁縫，",
        "translation": "For the remaining one month, before the summer, he should make raincoats, bathing robes, washing and dyeing clothes for dry cleansing. On the sixteenth day of the fourth month, he should wash, dye, and sew clothes for dry bathing on the sixteenth day of the fourth month.",
        "source": "T24n1462_015:0778c19_26"
    },
    {
        "source_sentence": "不須說淨亦不得用。",
        "translation": "It doesn't need to be described as pure, and it can't be used either.",
        "source": "T24n1462_015:0778c21_27"
    },
    {
        "source_sentence": "五月一日受持用竟，雨時四月合春末十五日，一百三十五日用，若春末月不得雨浴衣，",
        "translation": "On the fifteenth day of the fifth month, when it rains on the fifteenth day in the fourth month and uses it on the one hundred and thirty-fifth day at the end of spring, if he doesn't receive a bathing robe with rain for the last month of spring,",
        "source": "T24n1462_015:0778c22_0"
    },
    {
        "source_sentence": "又夏方得，即受持用。",
        "translation": "It's also attained only in the summer, which is when it's received and used.",
        "source": "T24n1462_015:0778c24_1"
    },
    {
        "source_sentence": "非求雨浴衣時者，從九月半至四月半以還，此非求雨浴衣時，若求尼薩耆。",
        "translation": "It's not the time to ask for rain and bathing robes, which are returned from mid-nineteenth month to mid-fourth month, but it's not the time to ask for rain and bathing robes when someone asks for a nun's robe.",
        "source": "T24n1462_015:0778c24_2"
    },
    {
        "source_sentence": "若有雨浴衣不用，裸形洗浴突吉羅罪。",
        "translation": "If there's rain and bathing clothes that aren't used, it's a grave offense to wash and bathe naked.",
        "source": "T24n1462_015:0778c26_3"
    },
    {
        "source_sentence": "四月十六日求雨浴衣，不足，若有望得處得停置，為足故，若得足者應受持，",
        "translation": "On the sixteenth day of the fourth month, he asks for rain and bathing clothes that aren't sufficient. If he hopes to obtain them, he can stop them because they are sufficient; if he gets sufficient, he should accept and uphold them.",
        "source": "T24n1462_015:0778c27_4"
    },
    {
        "source_sentence": "若不足得停置，乃至九月半不須說淨。",
        "translation": "If it's not enough to be stopped, it doesn't need to be described as pure until the ninth and a half months.",
        "source": "T24n1462_015:0778c29_5"
    },
    {
        "source_sentence": "若受迦絺那衣，得停至正月半，不須說淨。",
        "translation": "If he accepts a kaṭhina robe and stops it until the first half of the month, he doesn't need to say that it's pure.",
        "source": "T24n1462_015:0779a01_6"
    },
    {
        "source_sentence": "若三衣不足，迴用作袈裟，若少不足，有望得處，得停至一月。",
        "translation": "If the three garments are insufficient, he returns to make a reddish-brown robe; if they aren't enough, he hopes to get a place and can stay there for one month.",
        "source": "T24n1462_015:0779a02_7"
    },
    {
        "source_sentence": "若足者作衣，若不足，應說淨若受持，若不說淨不受持，至三十一日尼薩耆。",
        "translation": "If someone with legs makes a robe or doesn't have enough, they should say it's pure or accepted and uphold it, or if they don't say it's pure and not accepted and up to the thirty-first day of Nirvāṇa.",
        "source": "T24n1462_015:0779a03_8"
    },
    {
        "source_sentence": "無罪者，若少者從親里乞，若自恣請檀越乞不犯。」",
        "translation": "A person who doesn't commit a sin is not guilty if he begs from his relatives or asks for almsfood with self-restraint and don't violate it.",
        "source": "T24n1462_015:0779a05_9"
    },
    {
        "source_sentence": "法師曰：「餘次第文句，律中當廣解，不須重說。",
        "translation": "The Master said, “The rest of the sentences in order will be explained in detail in the Vinaya. There is no need to explain them again.",
        "source": "T24n1462_015:0779a06_10"
    },
    {
        "source_sentence": "「恐怖戒者，住阿蘭若處有二種：一者長在阿蘭若處，二者三月在阿蘭若處。",
        "translation": "There are two kinds of fearful precepts: those who live in a forest dwelling place: first, those who grow up in the forest dwelling place and those who stay in the forest dwelling place for three months.",
        "source": "T24n1462_015:0779a07_11"
    },
    {
        "source_sentence": "比丘阿蘭若處住，衣服敗壞，得還聚落僧房住，為治護衣故。",
        "translation": "A monk who lives in a forest dwelling place with his clothes worn out and destroyed may return to the living quarters of the saṃgha's quarters in the village to guard his robes.",
        "source": "T24n1462_015:0779a09_12"
    },
    {
        "source_sentence": "若治護竟，還復阿蘭若處住得。",
        "translation": "If they finish healing and protecting, they'll return to the abode of abiding in a forest retreat.",
        "source": "T24n1462_015:0779a11_13"
    },
    {
        "source_sentence": "迦提月賊者，迦提月無雨秋賊起。",
        "translation": "The caitya moon thief means that there's no rain in the month of caitya and thieves arise in the autumn.",
        "source": "T24n1462_015:0779a11_14"
    },
    {
        "source_sentence": "見諸賊殺人奪物，比丘恐怖者，畏失三衣，三衣中隨一一衣寄聚落中。",
        "translation": "Seeing thieves killing people and stealing things, the monks become frightened because they're afraid to lose the three garments, and each of the three garments is sent to a village one by one.",
        "source": "T24n1462_015:0779a12_15"
    },
    {
        "source_sentence": "恐怖者，若自見賊、若聞人道，是名恐怖。",
        "translation": "A fearful person is called a fearful person if he sees thieves or hears the words of others.",
        "source": "T24n1462_015:0779a14_16"
    },
    {
        "source_sentence": "若阿蘭若處眾多房舍堅密，不須寄衣聚落，寄衣已六夜一往看，見衣已還阿蘭若處，",
        "translation": "If there are many large and dense dwellings in a forest, they don't need to send their robes to a village; after sending the robes, they go to see them once every six night and return to the forest after seeing the robes.",
        "source": "T24n1462_015:0779a15_17"
    },
    {
        "source_sentence": "除僧羯磨。」",
        "translation": "It's except for the saṃgha karma.",
        "source": "T24n1462_015:0779a17_18"
    },
    {
        "source_sentence": "法師曰：「餘次第文句，律中已說，不須廣解。",
        "translation": "The Master said, “The rest of the sentences in order have already been explained in the Vinaya. There is no need to explain them in detail.",
        "source": "T24n1462_015:0779a17_19"
    },
    {
        "source_sentence": "迴施者，檀越飯佛及僧，欲施衣，比丘自迴向已，初教迴向已突吉羅罪，",
        "translation": "Giving back means that when a donor gives food to the Buddha and the saṃgha or wants to give robes, the monk dedicates them back to them for himself; after he first teaches dedication back, it's a grave offense.",
        "source": "T24n1462_015:0779a18_20"
    },
    {
        "source_sentence": "得物入手尼薩耆波夜提罪。",
        "translation": "They obtained things and committed the sin of crimes against Nirgrantha-pāyattika.",
        "source": "T24n1462_015:0779a20_21"
    },
    {
        "source_sentence": "若迴施與他乃至畜生，欲與此畜生，迴與彼畜生，得突吉羅罪。",
        "translation": "If someone returns a gift to another or even an animal, wants to give it to this animal and returns it to that animal, they'll be guilty of the grave offense of purgatory.",
        "source": "T24n1462_015:0779a21_22"
    },
    {
        "source_sentence": "欲供養此像，迴與彼像，悉突吉羅罪。",
        "translation": "If someone wants to make an offering to this image and returns it to that image, they'll be guilty of the sin of pratyekabuddha.",
        "source": "T24n1462_015:0779a22_23"
    },
    {
        "source_sentence": "無罪者，若不知與僧。」",
        "translation": "It's no offense if you don't know how to give it to the saṃgha.",
        "source": "T24n1462_015:0779a23_24"
    },
    {
        "source_sentence": "法師曰：「三十事廣說，究竟無遺餘。",
        "translation": "The Master said, “I will explain these thirty matters in detail. There is nothing left of them after all.",
        "source": "T24n1462_015:0779a23_25"
    },
    {
        "source_sentence": "次至九十事，汝等一心聽。",
        "translation": "Next, up to the ninety matters, you should listen with one mind.",
        "source": "T24n1462_015:0779a24_26"
    },
    {
        "source_sentence": "妄語戒中，訶多者，此是大德名也。",
        "translation": "Among the precepts of false speech and rebuke, this is the name of a great virtuous person.",
        "source": "T24n1462_015:0779a25_27"
    },
    {
        "source_sentence": "釋種出家有八萬人，訶多亦在其中，性好談論，與外道論義時自知理屈，",
        "translation": "Among the eighty thousand renunciants of the Śākya clan, most of whom were well versed in both Buddhist teachings and heretical theories. They were fond of debating with non-Buddhist theories but they always knew that their theories differed from those of others.",
        "source": "T24n1462_015:0779a26_28"
    },
    {
        "source_sentence": "便違反前語，若外道好語時，便迴為己語，自知理僻，言是外道語。",
        "translation": "If a non-Buddhist speaks well, then he turns back to his own words and knows for himself that the principle is false and says it's the speech of a non-Buddhist.",
        "source": "T24n1462_015:0779a27_29"
    },
    {
        "source_sentence": "若剋時與外道論議，語外道言：『中後當論議，自中前來。』",
        "translation": "If he discusses with a non-Buddhist when he's angry, he says to the non-Buddhist, 'We'll discuss it later in the middle and come back from the middle.'",
        "source": "T24n1462_015:0779a29_30"
    },
    {
        "source_sentence": "語諸檀越言：『即時論議。』",
        "translation": "He said to the donors, 'We'll discuss it immediately.'",
        "source": "T24n1462_015:0779b01_31"
    },
    {
        "source_sentence": "自上高座，語諸檀越言：『外道那得不來，必當畏我，是故不來。』",
        "translation": "From his high seat, he said to the donors, 'If non-Buddhists don't come, they'll surely fear me; therefore, they won't come.'",
        "source": "T24n1462_015:0779b02_32"
    },
    {
        "source_sentence": "自下高座而去。",
        "translation": "He descended from his high seat and departed.",
        "source": "T24n1462_015:0779b04_0"
    },
    {
        "source_sentence": "中後外道來，覓比丘不得，便呵責言：『沙門釋子言知正法，云何故妄語？』",
        "translation": "When non-Buddhist monks came after him in the middle, they looked for a monk who couldn't find him and reprimanded him, saying, 'The ascetic or Śākyamuni says he knows the right teaching, so why is he lying?'",
        "source": "T24n1462_015:0779b04_1"
    },
    {
        "source_sentence": "妄語者，口與心相違，亦名空語也。",
        "translation": "False speech means that words are at odds with mind, and it's also called empty speech.",
        "source": "T24n1462_015:0779b06_2"
    },
    {
        "source_sentence": "不犯者，欲說此誤說彼，妄語戒廣說竟。",
        "translation": "A person who doesn't violate the precepts wants to explain this and mistakenly explains them, and he falsely speaks after explaining the precepts in detail.",
        "source": "T24n1462_015:0779b06_3"
    },
    {
        "source_sentence": "此是性罪。",
        "translation": "This is a sin by nature.",
        "source": "T24n1462_015:0779b07_4"
    },
    {
        "source_sentence": "毀訾語者，欲令彼羞也。",
        "translation": "Someone who disparages someone's words want to make them ashamed.",
        "source": "T24n1462_015:0779b08_5"
    },
    {
        "source_sentence": "無罪者，唯除教授，此是性罪，毀訾語廣說竟。",
        "translation": "The blameless one only excludes the instruction, which is a sin by nature and has been extensively explained in disparaging words.",
        "source": "T24n1462_015:0779b08_6"
    },
    {
        "source_sentence": "「兩舌者，若兩舌鬪亂比丘、比丘尼波夜提，餘三眾突吉羅，白衣亦突吉羅，",
        "translation": "“Two tongues means that if two tongues fight and disturb a monk or a bhikṣuṇī, then the other three groups of monks will be disciplined, and the white robes will also be disciplined.",
        "source": "T24n1462_015:0779b10_0"
    },
    {
        "source_sentence": "此是性罪，兩舌廣說竟。",
        "translation": "This is a sin by nature, which has been extensively explained in terms of duplicity.",
        "source": "T24n1462_015:0779b11_1"
    },
    {
        "source_sentence": "同誦句者，有四種。",
        "translation": "There are four kinds of people who recite the same phrase together.",
        "source": "T24n1462_015:0779b12_2"
    },
    {
        "source_sentence": "何者為四？",
        "translation": "What are these four?",
        "source": "T24n1462_015:0779b12_3"
    },
    {
        "source_sentence": "一者句，二者隨句，三者隨字，四者隨味。",
        "translation": "The first is phrases, the second follows phrases, the third follows words, and the fourth follows taste.",
        "source": "T24n1462_015:0779b12_4"
    },
    {
        "source_sentence": "何者為句？",
        "translation": "What's a phrase?",
        "source": "T24n1462_015:0779b13_5"
    },
    {
        "source_sentence": "偈中句一句，是名一句。",
        "translation": "A phrase in a verse is called a phrase.",
        "source": "T24n1462_015:0779b14_6"
    },
    {
        "source_sentence": "何者隨句？",
        "translation": "What's the follow-on phrase?",
        "source": "T24n1462_015:0779b14_7"
    },
    {
        "source_sentence": "次第二句，是名隨句。",
        "translation": "The next second phrase is called a follow-on phrase.",
        "source": "T24n1462_015:0779b14_8"
    },
    {
        "source_sentence": "何者隨字？",
        "translation": "What's the word follower?",
        "source": "T24n1462_015:0779b15_9"
    },
    {
        "source_sentence": "隨文字而說是名隨文字。",
        "translation": "To speak according to words is called following words.",
        "source": "T24n1462_015:0779b15_10"
    },
    {
        "source_sentence": "何者隨味？",
        "translation": "What's the flavor that follows?",
        "source": "T24n1462_015:0779b16_11"
    },
    {
        "source_sentence": "同字異義，是名隨味。",
        "translation": "The same words have different meanings, which is called following taste.",
        "source": "T24n1462_015:0779b16_12"
    },
    {
        "source_sentence": "有字義味，是名為句。",
        "translation": "When there's a word with meaning and taste, this is called a phrase.",
        "source": "T24n1462_015:0779b17_0"
    },
    {
        "source_sentence": "若教未受具戒人諸惡莫作，未受具足戒人同聲而誦，波夜提。",
        "translation": "If someone teaches those who haven't yet received the full set of precepts not to do evil, and those who haven't yet received the full set of precepts recite it together in unison, pāyattika.",
        "source": "T24n1462_015:0779b17_1"
    },
    {
        "source_sentence": "若師言諸惡莫作，未受具足人抄前，而誦諸善奉行，同聲而誦，師得罪。",
        "translation": "If the teacher says, Don't do anything bad, and someone who hasn't yet received the full set of precepts copies it in front of him or her, recites good practices, and recites them together with one voice, he or she will be guilty.",
        "source": "T24n1462_015:0779b18_2"
    },
    {
        "source_sentence": "師言諸行無常，弟子言無常，亦得波夜提。",
        "translation": "The teacher says that conditioned phenomena are impermanent, and the disciple says impermanent, which also obtains pāyatti.",
        "source": "T24n1462_015:0779b20_3"
    },
    {
        "source_sentence": "若長行同者，隨字得罪。",
        "translation": "If someone's long practice is the same, they'll be guilty of crimes according to their words.",
        "source": "T24n1462_015:0779b21_4"
    },
    {
        "source_sentence": "佛語者，一切律藏、阿毘曇藏、修多羅，此是佛語。",
        "translation": "The Buddha's words are all the vinaya, abhidharma, and sūtra collections; these are the Buddha's words.",
        "source": "T24n1462_015:0779b22_5"
    },
    {
        "source_sentence": "聲聞語者，阿能伽那正見經，阿[少\\/兔]摩那經，周羅卑陀羅，摩訶卑陀羅，",
        "translation": "The words of the śrāvakas are the āyatana-paripṛcchā sūtra, the a[lesser\\/rabbit] manas sūtra, the pārājika-paripṛcchā(sūtra), and the mahāpiṇḍāra.",
        "source": "T24n1462_015:0779b23_6"
    },
    {
        "source_sentence": "是名聲聞語。",
        "translation": "This is called śrāvaka speech.",
        "source": "T24n1462_015:0779b24_7"
    },
    {
        "source_sentence": "梵志語者，一切外道梵志一品，是名梵志語。",
        "translation": "The words of the priests refer to all non-Buddhist priests in one class, which are called the words of the priests.",
        "source": "T24n1462_015:0779b25_8"
    },
    {
        "source_sentence": "天人語者，魔王、梵王、帝釋、一切天人所語，是名天人語。",
        "translation": "The words of gods and humans are called the words of gods and humans when they're spoken by Māra, Brahmā, Indra, and all gods and humans.",
        "source": "T24n1462_015:0779b26_9"
    },
    {
        "source_sentence": "同誦不犯。」",
        "translation": "They recite it together and don't violate it.",
        "source": "T24n1462_015:0779b27_10"
    },
    {
        "source_sentence": "法師曰：「若佛涅槃後，迦葉為上座，五百羅漢所集三藏，若共未受具戒人同誦此法者，",
        "translation": "The Master said: After the nirvana of the Buddha, Kāśyapa will be the supreme seat. There are five hundred arhats who have collected the Tripiṭaka in three collections. If they recite this Dharma together with those who have not received the full set of precepts,",
        "source": "T24n1462_015:0779b27_11"
    },
    {
        "source_sentence": "得波夜提罪。",
        "translation": "He'll be guilty of the sin of pāyatti.",
        "source": "T24n1462_015:0779b29_12"
    },
    {
        "source_sentence": "若法師所撰文字，共同誦者不犯。」",
        "translation": "If the words written by the master of the Dharma are recited together, it's not a violation.",
        "source": "T24n1462_015:0779c02_0"
    },
    {
        "source_sentence": "法師曰：「同誦戒廣說竟。",
        "translation": "The teacher of the Dharma said, After reciting the precepts together and explaining them in detail, he said.",
        "source": "T24n1462_015:0779c02_1"
    },
    {
        "source_sentence": "不前作念者，臨欲眠時，應先念佛、念法、念僧、念戒、念天、念無常，",
        "translation": "Those who aren’t mindful before should first be mindful of the Buddha, Dharma, Sangha, precepts, gods, and impermanence when they’re about to go to sleep.",
        "source": "T24n1462_015:0779c03_2"
    },
    {
        "source_sentence": "於六念中隨一一念，若不如是念，是名不前念。",
        "translation": "If he follows each of the six kinds of mindfulness and doesn't think it like this, this is called not thinking beforehand.",
        "source": "T24n1462_015:0779c04_3"
    },
    {
        "source_sentence": "露身者，臨眠不先作念，心即散亂，是故露身種種音聲，或如鳥聲或如牛馬聲，",
        "translation": "Revealing one’s body means that when going to sleep, one does not think first and the mind immediately becomes distracted. That is why the various sounds that reveal one’s body are sometimes like birds or sometimes like cattle and horses.",
        "source": "T24n1462_015:0779c06_0"
    },
    {
        "source_sentence": "諸優婆塞聞已皆生譏嫌：『云何出家人作如是眠！』",
        "translation": "After the laymen heard this, they all became angry and criticized him, saying, 'How did a renunciant do such a sleep?'",
        "source": "T24n1462_015:0779c07_1"
    },
    {
        "source_sentence": "佛因是事，為諸比丘結戒，自今以後，不得與未受具足戒人同房宿。",
        "translation": "Because of this, the Buddha formed the precepts for the monks, and from now on, he won't be allowed to sleep in the same room with someone who hasn't received the full set of precepts.",
        "source": "T24n1462_015:0779c09_2"
    },
    {
        "source_sentence": "時羅睺羅聞佛結戒，護持不犯，是故羅睺羅入佛廁，以袈裟敷地而眠，",
        "translation": "Rāhula then listened to the Buddha's binding precepts and observed them without violating them. That's why Rāhula entered the Buddha's toilet, spread his reddish-brown robe on the floor, and slept.",
        "source": "T24n1462_015:0779c10_3"
    },
    {
        "source_sentence": "羅睺羅所以入佛廁屋者，以淨潔、多人以香華供養，是故入中而眠。",
        "translation": "Rāhula's reason for entering the Buddha's restroom is to make offerings of purity and flowers with fragrance, so he enters it and sleeps.",
        "source": "T24n1462_015:0779c12_4"
    },
    {
        "source_sentence": "明相未出，如來上廁先謦欬作聲，羅睺羅在內亦謦欬作聲，佛知而故問：『汝是誰？』",
        "translation": "Before the luminous characteristics had emerged, the Tathāgata went up to the toilet and made a noise before he did so, and Rāhula inside also made a noise. Knowing this, the Buddha asked, 'Who are you?'",
        "source": "T24n1462_015:0779c14_0"
    },
    {
        "source_sentence": "答言：『我是羅睺羅。』",
        "translation": "He replied, 'I am Rāhula.'",
        "source": "T24n1462_015:0779c15_1"
    },
    {
        "source_sentence": "佛因羅睺羅故，念諸沙彌開得二宿。」",
        "translation": "Because of Rāhula, the Buddha thought that the śrāmaṇeras would give rise to two nights.",
        "source": "T24n1462_015:0779c16_2"
    },
    {
        "source_sentence": "法師曰：「云何房不得共宿？」",
        "translation": "The teacher of the Dharma said, How can we sleep together in a room?",
        "source": "T24n1462_015:0779c17_3"
    },
    {
        "source_sentence": "「一切覆一切障，乃至以衣幔作屋亦犯。",
        "translation": "It's also a violation to cover all the hindrances and even make a room with a robe curtain.",
        "source": "T24n1462_015:0779c17_4"
    },
    {
        "source_sentence": "壁者，乃至高一肘半，亦名為壁。",
        "translation": "A wall, even an elbow and a half in height, is also called a wall.",
        "source": "T24n1462_015:0779c18_5"
    },
    {
        "source_sentence": "共宿犯，若多房共一戶亦犯，除別有戶不犯。",
        "translation": "If it's a violation to sleep together, it's also a violation if many rooms share one door, except for those with separate doors that aren't violated.",
        "source": "T24n1462_015:0779c19_6"
    },
    {
        "source_sentence": "第三明相未出避去，若不避者全三宿亦不犯。",
        "translation": "The third clarification is that the characteristic doesn't yet emerge and avoids going, and if he doesn't avoid it, all three constellations won't be violated.",
        "source": "T24n1462_015:0779c20_7"
    },
    {
        "source_sentence": "第四宿初夜不得，若脇著床波夜提罪。",
        "translation": "On the first night of the fourth lunar station, if he doesn't get it, he'll be guilty of the offense of lying on a bed or pāyatti.",
        "source": "T24n1462_015:0779c21_8"
    },
    {
        "source_sentence": "若屋少覆多障不犯，多覆少障亦不犯。",
        "translation": "It's not a violation if the house is small and covered by many hindrances, and it's not a violation if the house is large and covered by few hindrances.",
        "source": "T24n1462_015:0779c22_9"
    },
    {
        "source_sentence": "若四周屋各向裏開戶，共一大戶出入亦犯，若別有戶不犯。",
        "translation": "If a door opens inside each of the four surrounding houses and shares one large door, it's also a violation to enter or leave it; if there's another door, it's not a violation.",
        "source": "T24n1462_015:0779c23_10"
    },
    {
        "source_sentence": "若過三宿比丘眠、未受具戒人眠，得波夜提罪。",
        "translation": "If a monk sleeps for more than three nights and a person who sleeps for someone who hasn't received the full set of precepts goes to sleep, he'll be guilty of the offense of pāyattika.",
        "source": "T24n1462_015:0779c24_11"
    },
    {
        "source_sentence": "若未受具戒人眠已起更眠，隨眠多少得波夜提罪。",
        "translation": "If someone who hasn't yet received the full set of precepts goes to sleep and then starts again after sleeping, they'll be guilty of the offense of pāyattika for a number of latencies.",
        "source": "T24n1462_015:0780a01_12"
    },
    {
        "source_sentence": "若未受具戒人過三宿，未受具戒人眠、比丘眠，俱波夜提罪。",
        "translation": "If someone who hasn't received the full set of precepts goes beyond three nights, and someone who hasn't received the full set of precepts sleeps or a monk sleeps, it's a grave offense.",
        "source": "T24n1462_015:0780a02_13"
    },
    {
        "source_sentence": "若比丘起已更眠，隨眠多少，眾多波夜提罪。",
        "translation": "If a monk wakes up and goes to sleep again after rising, and there are many pāyattika sins that follow the amount of sleep he's sleeping, then he'll be guilty of many pāyattika sins.",
        "source": "T24n1462_015:0780a03_14"
    },
    {
        "source_sentence": "若屋相連接大，乃至一由旬，同一戶出入亦犯。",
        "translation": "If the houses are connected and large, up to one yojana in size, it's also a violation if they come out and go in with the same door.",
        "source": "T24n1462_015:0780a04_15"
    },
    {
        "source_sentence": "屋若有龜鱓窟，止穿外邊、裏邊不通，不犯。",
        "translation": "If a house has a tortoise cave, and if it doesn't enter through the outside or inside, it won't be a violation.",
        "source": "T24n1462_015:0780a05_16"
    },
    {
        "source_sentence": "若屋多覆半障突吉羅罪，多障半覆亦突吉羅罪。」",
        "translation": "If a house that's often covered and half-covered is a grave offense, and many obstructions and half-covered are also a grave offense.",
        "source": "T24n1462_015:0780a06_17"
    },
    {
        "source_sentence": "法師曰：「餘次第文句易解，不須廣說。",
        "translation": "The Master said, “The rest of the sentences are easy to understand in order and need not be explained in detail.",
        "source": "T24n1462_015:0780a07_18"
    },
    {
        "source_sentence": "同宿戒廣說竟。",
        "translation": "It's the same as the end of the extensive explanation of the past precepts.",
        "source": "T24n1462_015:0780a08_19"
    },
    {
        "source_sentence": "「共女人同屋宿戒者，作福德舍，擬去來人止宿也。",
        "translation": "A person who shares the same dwelling place with a woman and observes the precepts creates a house of merit, intending to stay overnight with people coming and going.",
        "source": "T24n1462_015:0780a09_0"
    },
    {
        "source_sentence": "共女人同屋宿戒，已在律中，不須廣說。",
        "translation": "The precept for sleeping with a woman in the same dwelling place is already stated in the Vinaya. It need not be explained in detail.",
        "source": "T24n1462_015:0780a10_1"
    },
    {
        "source_sentence": "為說法者，或說三歸五戒，或說天堂地獄，除有知男子者，是人男、非鬼畜生，",
        "translation": "Those who preach the Dharma for others may teach the three refuges and five precepts, or they may teach heavenly hells. Except for those who know men, these are humans, men, non-ghosts, animals, and so on.",
        "source": "T24n1462_015:0780a11_2"
    },
    {
        "source_sentence": "若有知男子過五六語亦不犯。",
        "translation": "If someone knows that a man's five or six words are wrong, they won't violate it.",
        "source": "T24n1462_015:0780a13_3"
    },
    {
        "source_sentence": "五六語者，若比丘為說五六語無罪。",
        "translation": "Five or six words means that if a monk speaks five or six words for them, it's no offense.",
        "source": "T24n1462_015:0780a13_4"
    },
    {
        "source_sentence": "五六語者，一偈一句若聲相連不斷，一波夜提，若句句斷，句句波夜提。",
        "translation": "The five or six words are one verse and one phrase if the sound doesn't continue to be continuous, pāyatti; if the sentence is cut off, the sentence is pāyatti.",
        "source": "T24n1462_015:0780a14_5"
    },
    {
        "source_sentence": "一句經文、五句義疏，合成六句不犯，若過波夜提。",
        "translation": "A single phrase of the sūtra, a five-sentence commentary, or a combination of six phrases doesn't violate it if it goes beyond pāyatti.",
        "source": "T24n1462_015:0780a16_6"
    },
    {
        "source_sentence": "有眾多女人，為一女人說法竟，復為第二第三女人說，第一女人復來聽，",
        "translation": "There were many women who, having preached the Dharma to one woman, then taught it to the second and third women. The first woman came and listened.",
        "source": "T24n1462_015:0780a17_7"
    },
    {
        "source_sentence": "雖過五六語不犯。",
        "translation": "Even though it goes beyond five or six words, it's not a violation.",
        "source": "T24n1462_015:0780a19_8"
    },
    {
        "source_sentence": "答問者，若女人問《長阿含》中事，比丘隨問而答，乃至盡阿含亦不犯。」",
        "translation": "Answering a question means that if a woman asks questions about something in the Longer Āgamas, the monk follows their questions and answers them, even up to the end of the Āgamas, it's not a violation.",
        "source": "T24n1462_015:0780a19_9"
    },
    {
        "source_sentence": "法師曰：「餘次第文句易可解耳，不須廣說。",
        "translation": "The Master said, “The rest of the sentences in order are easy to understand. There is no need to explain them in detail.",
        "source": "T24n1462_015:0780a21_10"
    },
    {
        "source_sentence": "因緣本起如前戒。",
        "translation": "The causes and conditions that originally arise are as before in the precepts.",
        "source": "T24n1462_015:0780a22_11"
    },
    {
        "source_sentence": "為女人說法廣說竟。",
        "translation": "After teaching the Dharma for women and explaining it in detail, he said.",
        "source": "T24n1462_015:0780a22_12"
    },
    {
        "source_sentence": "此聖制戒前，第四波羅夷已廣說竟，此中不異，實得過人法，向未受具戒人說故，",
        "translation": "The fourth pārājika has already been spoken of elaborately. This is no different: because in reality one acquires the superhuman faculty by teaching it to those who have not received the full set of precepts.",
        "source": "T24n1462_015:0780a23_13"
    },
    {
        "source_sentence": "得波夜提。",
        "translation": "He attains pāyatti.",
        "source": "T24n1462_015:0780a25_14"
    },
    {
        "source_sentence": "過人法向未受具戒人說竟。",
        "translation": "It's beyond the ability of someone who teaches the Dharma to someone who hasn't received the full set of precepts.",
        "source": "T24n1462_015:0780a25_15"
    },
    {
        "source_sentence": "麁罪者，四重十三，是名麁罪。",
        "translation": "The sin of sexual misconduct, which is fourfold and thirteenfold, is called the sin of sexual misconduct.",
        "source": "T24n1462_015:0780a26_0"
    },
    {
        "source_sentence": "除比丘、比丘尼，向未受具戒人說，波夜提。",
        "translation": "Except for monks and nuns who speak to someone who hasn't received the full set of precepts, pāyattika.",
        "source": "T24n1462_015:0780a26_1"
    },
    {
        "source_sentence": "除僧羯磨者，羯磨在某處某處說，若非所羯磨處說，波夜提。",
        "translation": "Except for the saṃgha's karma, the karma is explained in a certain place and a certain place; if it's not explained in a place where the karma is given, pāyattika.",
        "source": "T24n1462_015:0780a27_2"
    },
    {
        "source_sentence": "除四重十三，若說餘篇罪突吉羅。」",
        "translation": "Except for the four grave thirteen, if he teaches the other parts of the sutra, he'll be guilty of a grave offense.",
        "source": "T24n1462_015:0780b01_3"
    },
    {
        "source_sentence": "法師曰：「餘次第文句已在律中，不須廣說。",
        "translation": "The teacher of the Dharma said, The rest of the sequential sentences are already in the vinaya, so there's no need to explain them in detail.",
        "source": "T24n1462_015:0780b01_4"
    },
    {
        "source_sentence": "麁罪戒竟。",
        "translation": "After finishing the precept against sexual misconduct, he said.",
        "source": "T24n1462_015:0780b02_5"
    },
    {
        "source_sentence": "掘地戒者，真地非真地今當分別，真地者，無有沙石瓦礫，純土，是名真地。",
        "translation": "The precept for digging the ground is that what's true and what's not true will now be discerned, and what's true is that there's no sand, stones, or rubble, pure soil, which is called true ground.",
        "source": "T24n1462_015:0780b03_6"
    },
    {
        "source_sentence": "非真地者，多有沙石瓦礫沙土，是名非真地。",
        "translation": "A ground that's not true because there are so many sand, rocks, rubble, and dirt, which is called a ground that's not true.",
        "source": "T24n1462_015:0780b04_7"
    },
    {
        "source_sentence": "若地被燒，亦名非真地。",
        "translation": "If the earth is burned, it's also called a ground that's not true.",
        "source": "T24n1462_015:0780b05_8"
    },
    {
        "source_sentence": "若地有沙石，云何知？",
        "translation": "If there's sand and stone on the ground, how do we know?",
        "source": "T24n1462_015:0780b06_9"
    },
    {
        "source_sentence": "可得掘？",
        "translation": "Can I dig it up?",
        "source": "T24n1462_015:0780b07_0"
    },
    {
        "source_sentence": "應取少土以水淘看，若四分石一分土可得掘，若石上土厚四寸燥得取，",
        "translation": "You should pick up a little bit of dirt and scrape it with water. If you find one-sixth of the dirt on the four sides of the rock, you can dig it; if the dirt on top of the rock is four inches thick, then dry dirt will be able to pick it up.",
        "source": "T24n1462_015:0780b07_1"
    },
    {
        "source_sentence": "若雨已經四月不得取，若比丘掘生地，掘掘波夜提。",
        "translation": "If he doesn't get it after four months of rain, or if a monk digs up the land that grows, he digs up pāyattika.",
        "source": "T24n1462_015:0780b09_2"
    },
    {
        "source_sentence": "若比丘語淨人言：『汝為眾僧掘地及斫木。』",
        "translation": "Suppose a monk says to the pure person, 'Excavate earth and charcoal wood for the sake of the saṃgha.'",
        "source": "T24n1462_015:0780b10_3"
    },
    {
        "source_sentence": "不犯。",
        "translation": "It's not a violation.",
        "source": "T24n1462_015:0780b11_4"
    },
    {
        "source_sentence": "若指示教掘是、斫是，波夜提。",
        "translation": "If someone instructs them to dig it up and chop it down, pratyekabuddha.",
        "source": "T24n1462_015:0780b11_5"
    },
    {
        "source_sentence": "若畫地或作字，波夜提。",
        "translation": "If he paints the ground or makes words, it's pāyatti.",
        "source": "T24n1462_015:0780b12_6"
    },
    {
        "source_sentence": "若把火燒手擲地不犯。",
        "translation": "It's not a violation if he puts his hand on fire and throws it to the ground.",
        "source": "T24n1462_015:0780b12_7"
    },
    {
        "source_sentence": "餘文句在律中，不須廣說。",
        "translation": "The rest of the sentences are found in the Vinaya and do not need to be explained in detail.",
        "source": "T24n1462_015:0780b13_8"
    },
    {
        "source_sentence": "掘地戒廣說竟。",
        "translation": "After extensively explaining the extensive explanation of the precepts for digging the ground, he said.",
        "source": "T24n1462_015:0780b14_0"
    },
    {
        "source_sentence": "此是制罪，從身心起。",
        "translation": "This is a restraining offense that arises from body and mind.",
        "source": "T24n1462_015:0780b14_1"
    },
    {
        "source_sentence": "不受語，是曠野比丘不受鬼神語，因斫樹故，傷鬼子臂，鬼作是念：『不應專輒殺出家人，",
        "translation": "This monk in the wilderness did not listen to the ghostly spirits’ words. He was hurt on the arm of a ghostly child by falling into a tree. The ghost thought:",
        "source": "T24n1462_015:0780b14_2"
    },
    {
        "source_sentence": "當往白佛，佛聞此事當為比丘制戒。』",
        "translation": "You must go to the Buddha and tell him, and when he hears about this matter, he'll establish precepts for the monks.'",
        "source": "T24n1462_015:0780b17_0"
    },
    {
        "source_sentence": "往至佛所具白此事。",
        "translation": "He went to the Buddha and told him about this matter.",
        "source": "T24n1462_015:0780b17_1"
    },
    {
        "source_sentence": "「『若人瞋心起，　　譬如車奔逸，",
        "translation": "'If someone's angry mind arises, it's like a chariot running away.",
        "source": "T24n1462_015:0780b18_2"
    },
    {
        "source_sentence": "　　車士能制止，　　不足以為難，",
        "translation": "The charioteer can stop it, but he doesn't think it's a difficulty.",
        "source": "T24n1462_015:0780b18_2"
    },
    {
        "source_sentence": "　　人能制瞋心，　　此事最為難。』",
        "translation": "People can restrain their anger, and this is the most difficult thing to do.'",
        "source": "T24n1462_015:0780b18_2"
    },
    {
        "source_sentence": "世尊聞已即說偈言：「佛說偈已，此樹神即得須陀洹道。",
        "translation": "After hearing it, the Bhagavān spoke a verse, saying, After the Buddha spoke the verse, this tree goddess then attained the stream entry path.",
        "source": "T24n1462_015:0780b18_2"
    },
    {
        "source_sentence": "佛知樹神無住處，以天眼觀見樹無主者，語樹神言：『汝可依此樹住。』」",
        "translation": "Knowing that the tree god has no dwelling place, the Buddha observes with his divine eye that the tree has no owner and says to the tree god, 'You can rely on this tree to live.'",
        "source": "T24n1462_015:0780b22_3"
    },
    {
        "source_sentence": "問曰：「此樹在何處？」",
        "translation": "He asked, Where is this tree?",
        "source": "T24n1462_015:0780b24_4"
    },
    {
        "source_sentence": "答曰：「此樹在給孤獨園。",
        "translation": "He answered, This tree is in Anāthapiṇḍada Park.",
        "source": "T24n1462_015:0780b25_0"
    },
    {
        "source_sentence": "樹神得住止處，心自念言：『世尊大慈賜我宮殿，自今以後供養世尊。』",
        "translation": "When the tree gods found a place to stay, they thought to themselves, 'The Bhagavān has given me my palace with great compassion and will make offerings to the Bhagavān from now on.'",
        "source": "T24n1462_015:0780b25_1"
    },
    {
        "source_sentence": "爾時佛為天人說法，若有大天人後來，前小天人次第退坐，乃至海際。",
        "translation": "At the time, the Buddha taught the Dharma for gods and humans, and if there are large gods and humans who come after them, the small gods and humans before them will retreat in order up to the limit of the sea.",
        "source": "T24n1462_015:0780b27_2"
    },
    {
        "source_sentence": "爾時得道樹神退，依樹而住聽佛說法，佛晝日為四部眾說法，初夜為比丘說法，",
        "translation": "At that time the tree of enlightenment, having attained buddhahood, withdrew and stood supported itself from the tree to listen to the Buddha’s discourse. The Buddha taught the Dharma day and night to the fourfold assembly, and on the first watch of the night he taught the Dharma to the monks.",
        "source": "T24n1462_015:0780b28_3"
    },
    {
        "source_sentence": "中夜為天人說法，後夜為龍王說法。",
        "translation": "In the middle of the night, he taught the Dharma to gods and humans, and in the latter night, he taught the Dharma to the dragon king.",
        "source": "T24n1462_015:0780c02_4"
    },
    {
        "source_sentence": "云何知之？",
        "translation": "How do we know it?",
        "source": "T24n1462_015:0780c03_5"
    },
    {
        "source_sentence": "中夜天人來打戶扇上頭，後夜龍王來打戶扇下頭，是故天龍之異。",
        "translation": "In the middle of the night, gods and humans come to beat their heads at the top of a door or fan, and in the latter part of the night, dragon kings come to beat their heads at the bottom of the door or fan; this is why it's different from that of heavenly dragons.",
        "source": "T24n1462_015:0780c03_6"
    },
    {
        "source_sentence": "樹者，生樹也。",
        "translation": "A tree is a growing tree.",
        "source": "T24n1462_015:0780c05_7"
    },
    {
        "source_sentence": "村者，此樹八微合成，名之為村。",
        "translation": "A village is called a village when these eight subtle combinations of trees are called a village.",
        "source": "T24n1462_015:0780c05_8"
    },
    {
        "source_sentence": "樹有五種，阿梨陀者，黃薑也；",
        "translation": "There are five kinds of trees:",
        "source": "T24n1462_015:0780c06_9"
    },
    {
        "source_sentence": "憂尸羅者，香荽也；",
        "translation": "A mustard seed is a herb of fragrant grapes.",
        "source": "T24n1462_015:0780c07_10"
    },
    {
        "source_sentence": "貿他致吒者，是雀頭香；",
        "translation": "The characteristic of this trade is the fragrance of a bird’s hair.",
        "source": "T24n1462_015:0780c07_11"
    },
    {
        "source_sentence": "盧揵者，黃連也；",
        "translation": "Lumbinī is a native of Hualiputra.",
        "source": "T24n1462_015:0780c08_12"
    },
    {
        "source_sentence": "陀盧者，外國草名也。",
        "translation": "Dhāraṇī is the name of a foreign plant.",
        "source": "T24n1462_015:0780c08_13"
    },
    {
        "source_sentence": "舍摩者，是菩提樹也。",
        "translation": "Śāma is the bodhi tree.",
        "source": "T24n1462_015:0780c09_14"
    },
    {
        "source_sentence": "婆羅醯者，貝多樹也。",
        "translation": "Vārāṇasī is the 貝多 tree.",
        "source": "T24n1462_015:0780c09_15"
    },
    {
        "source_sentence": "此二種，樹唯見交廣有，餘方不見。",
        "translation": "These two kinds of trees are only seen at the intersection and exist widely; they are not seen in other directions.",
        "source": "T24n1462_015:0780c10_16"
    },
    {
        "source_sentence": "穌摩那華者，其華香氣，與末利相似。",
        "translation": "The fragrance of this flower is similar to that of the māli tree.",
        "source": "T24n1462_015:0780c10_17"
    },
    {
        "source_sentence": "末利華者，廣州有，其華騰生也。",
        "translation": "The Malli flower is found in the capital city, where it grows and prospers.",
        "source": "T24n1462_015:0780c11_18"
    },
    {
        "source_sentence": "穌羅婆者，不得此草名也。",
        "translation": "It's called śāla because it doesn't get the name of this grass.",
        "source": "T24n1462_015:0780c12_19"
    },
    {
        "source_sentence": "菩醯那，是外國草名也。",
        "translation": "Bodhāna is the name of a foreign plant.",
        "source": "T24n1462_015:0780c13_20"
    },
    {
        "source_sentence": "樹有二種，一者水生，二者陸生。",
        "translation": "There are two kinds of trees: those that grow in water and those that grow on land.",
        "source": "T24n1462_015:0780c13_21"
    },
    {
        "source_sentence": "優鉢羅花、蓮華、浮蓱水生，若水中翻覆得突吉羅，若離水波夜提。",
        "translation": "Upāla flowers, lotus blossoms, and floating water arise, and if they are covered in water, they'll attain purgatory, or if they're free of water, they'll become pāyattika.",
        "source": "T24n1462_015:0780c14_22"
    },
    {
        "source_sentence": "若須華果，得攀樹枝下使淨人取，不犯，不得令枝折。",
        "translation": "If they need flowers and fruits, they can climb under a tree's branch and make a pure person take them; it's not a violation to cause the branch to break.",
        "source": "T24n1462_015:0780c16_23"
    },
    {
        "source_sentence": "若樹高，淨人不及，比丘得抱淨人取，不犯。",
        "translation": "If the tree is high and the pure person doesn't reach it, a monk who can embrace the pure person and take it won't violate the precepts.",
        "source": "T24n1462_015:0780c17_24"
    },
    {
        "source_sentence": "若樹壓比丘，得斫樹掘地以救其命，不犯。",
        "translation": "It's not a violation if a tree crushes a monk and he attains salvation by cutting down a tree or digging into the ground to save his life.",
        "source": "T24n1462_015:0780c18_25"
    },
    {
        "source_sentence": "傷草木戒廣說竟。",
        "translation": "The precept against harming grass and trees has been explained in detail.",
        "source": "T24n1462_015:0780c19_26"
    },
    {
        "source_sentence": "此是制罪，從身心起。",
        "translation": "This is a restraining offense that arises from body and mind.",
        "source": "T24n1462_015:0780c19_27"
    },
    {
        "source_sentence": "餘語戒者，以作惡行者，不應作以作，身口得罪。",
        "translation": "The rest of the precepts say that someone who does bad actions because they do them shouldn't do them because they do them, and they'll be guilty of crimes in body and speech.",
        "source": "T24n1462_015:0780c20_28"
    },
    {
        "source_sentence": "覆者，不欲令人知。",
        "translation": "A covering is someone who doesn't want to let others know.",
        "source": "T24n1462_015:0780c21_29"
    },
    {
        "source_sentence": "誰得罪者？」",
        "translation": "Who will be condemned?",
        "source": "T24n1462_015:0780c22_30"
    },
    {
        "source_sentence": "法師曰：「今當釋其義。",
        "translation": "The teacher of the Dharma said, Now, we'll explain its meaning.",
        "source": "T24n1462_015:0780c22_31"
    },
    {
        "source_sentence": "若有餘比丘問長老得罪，將至僧前共判此事，於僧前答言：『誰得罪？』",
        "translation": "If another monk asks the elder about the offense and goes to the saṃgha to judge it together, he answers in front of the saṃgha, 'Who will be charged?'",
        "source": "T24n1462_015:0780c22_32"
    },
    {
        "source_sentence": "餘比丘語言：『長老得罪。』",
        "translation": "The other monks said, 'Elder, you've committed a sin.'",
        "source": "T24n1462_015:0780c24_33"
    },
    {
        "source_sentence": "答言：『我得何罪？』",
        "translation": "He replied, 'What sin did I get?'",
        "source": "T24n1462_015:0780c25_34"
    },
    {
        "source_sentence": "比丘言：『或言波夜提，或言突吉羅。』",
        "translation": "The monks said, 'Some say pāyattika, or some say pratyekabuddha.'",
        "source": "T24n1462_015:0780c25_35"
    },
    {
        "source_sentence": "問：『我何時得罪？』",
        "translation": "He asked, 'When did I commit a sin?'",
        "source": "T24n1462_015:0780c26_36"
    },
    {
        "source_sentence": "語言：『汝某時某時得罪。』",
        "translation": "They say, 'You've been guilty of a certain offense at a certain time and a certain time.'",
        "source": "T24n1462_015:0780c26_37"
    },
    {
        "source_sentence": "『我作何事得罪？』",
        "translation": "'What did I do to get a sin?'",
        "source": "T24n1462_015:0780c27_38"
    },
    {
        "source_sentence": "『汝作某事得罪。』",
        "translation": "'You did a certain thing and you'll be condemned.'",
        "source": "T24n1462_015:0780c27_39"
    },
    {
        "source_sentence": "答言：『汝道何事？』",
        "translation": "He replied, 'What do you say?'",
        "source": "T24n1462_015:0780c27_40"
    },
    {
        "source_sentence": "如是不隨問答，是名餘語。",
        "translation": "Thus, they don't follow questions and answers, which are called other words.",
        "source": "T24n1462_015:0780c28_41"
    },
    {
        "source_sentence": "若比丘見闡那捉銀錢，比丘語言：『何以捉銀錢？』",
        "translation": "If a monk sees Cunda holding a silver coin, the monk says, 'Why are you holding a silver coin?'",
        "source": "T24n1462_015:0780c28_42"
    },
    {
        "source_sentence": "答言：『我捉錫錢非銀錢。』",
        "translation": "He replied, 'I'll take the tin money and not the silver money.'",
        "source": "T24n1462_015:0781a02_43"
    },
    {
        "source_sentence": "或見飲酒。",
        "translation": "Perhaps they see someone drinking alcohol.",
        "source": "T24n1462_015:0781a02_44"
    },
    {
        "source_sentence": "語言：『汝何以飲酒？』",
        "translation": "He said, 'Why are you drinking wine?'",
        "source": "T24n1462_015:0781a02_45"
    },
    {
        "source_sentence": "答言：『我水。』",
        "translation": "He replied, 'I water.'",
        "source": "T24n1462_015:0781a03_46"
    },
    {
        "source_sentence": "語言：『汝何以與女人獨坐屏處？』",
        "translation": "He said, 'Why are you sitting alone with a woman in a seat?'",
        "source": "T24n1462_015:0781a03_47"
    },
    {
        "source_sentence": "答言：『有智男子。』",
        "translation": "He replied, 'There's a wise man.'",
        "source": "T24n1462_015:0781a04_48"
    },
    {
        "source_sentence": "是名餘語，或時默然不答。",
        "translation": "This is called saying something else, or sometimes being silent and not answering.",
        "source": "T24n1462_015:0781a04_49"
    },
    {
        "source_sentence": "若知是非法，作餘語答僧，得波夜提。",
        "translation": "If someone knows it's unlawful and answers the saṃgha with something else, they'll be given a pāyatti.",
        "source": "T24n1462_015:0781a05_50"
    },
    {
        "source_sentence": "若狐疑是法非法，作餘語答僧，得波夜提。",
        "translation": "If someone doubts that it's a teaching or an unlawful one and answers the saṃgha with something else, they'll attain pāyatti.",
        "source": "T24n1462_015:0781a06_51"
    },
    {
        "source_sentence": "若實知，答僧言我不知，得波夜提。",
        "translation": "If he really knows it, the saṃgha answers, I don't know it, and he attains pāyatti.",
        "source": "T24n1462_015:0781a07_52"
    },
    {
        "source_sentence": "畏成鬪僧，默然不犯。",
        "translation": "Fearful of becoming a fighting monk, he remained silent and didn't violate it.",
        "source": "T24n1462_015:0781a08_53"
    },
    {
        "source_sentence": "餘文句易可解，不須廣說。",
        "translation": "The rest of the text is easy to understand, so there's no need to explain it in detail.",
        "source": "T24n1462_015:0781a08_54"
    },
    {
        "source_sentence": "此是性罪，從身心口業起，不隨問答廣說竟。",
        "translation": "This is a sin by nature that arises from bodily or verbal action, and it doesn't follow questions and answers to explain them in detail.",
        "source": "T24n1462_015:0781a09_55"
    },
    {
        "source_sentence": "「若譏嫌被僧差人波夜提，若譏嫌餘人突吉羅。",
        "translation": "Suppose someone criticizes a person who's sent by the saṃgha to Pāṇḍinī, and if they criticize another person as a tukhila.",
        "source": "T24n1462_015:0781a10_56"
    },
    {
        "source_sentence": "此是性罪，身口業起，譏嫌戒竟。",
        "translation": "This is a sin by nature that arises from bodily or verbal action and ends with the remonstrant precepts.",
        "source": "T24n1462_015:0781a11_57"
    },
    {
        "source_sentence": "「若露地敷僧臥具戒，冬時者，霜雪時也。",
        "translation": "“If someone spreads a monk’s bedding out in the open air and observes the precepts, it is at the time of winter when there is frost and snow.",
        "source": "T24n1462_015:0781a12_58"
    },
    {
        "source_sentence": "已曝身者，寒月取眾僧床席逐日曝身。",
        "translation": "Someone who has been exposed to the body means that in the cold moon, he takes a seat of the saṃgha's bed and exposes his body day after day.",
        "source": "T24n1462_015:0781a13_59"
    },
    {
        "source_sentence": "知時者，若淨人喚不舉眾僧臥具，不教他舉犯。」",
        "translation": "Knowing the time, if a pure person calls someone who doesn't lift the bedding for the saṃgha and doesn't teach others to lift it, that's a violation.",
        "source": "T24n1462_015:0781a14_60"
    },
    {
        "source_sentence": "法師曰：「冬日時有四月，熱時有四月，若不雨時，得敷眾僧臥具，若雨時不得敷。",
        "translation": "The Master said: There are four months in winter when the sun is hot and there are four months in autumn. If it is not raining, you may provide bedding for the monks; but if it rains, you cannot provide them.",
        "source": "T24n1462_015:0781a15_61"
    },
    {
        "source_sentence": "樹下者，若樹葉厚密，上無眾鳥聚集，得敷眾僧臥具，不犯。",
        "translation": "It's not a violation if the leaves of a tree are thick and dense, and there aren't any birds gathered above it, and they can spread out bedding for the saṃgha to use.",
        "source": "T24n1462_015:0781a17_62"
    },
    {
        "source_sentence": "若比丘受上頭陀法，若在樹下、若在空地，乃至不得袈裟為屋，不得將眾僧臥具在外受用，",
        "translation": "Suppose a monk who receives the higher ascetic precepts, whether under a tree or in an empty place, doesn't obtain a monk's robe to make a room, and doesn't allow the resting cloth of the saṃgha to be used externally.",
        "source": "T24n1462_015:0781a18_63"
    },
    {
        "source_sentence": "若能賞護乃至袈裟覆莫令濕，得受用。",
        "translation": "If they can reward and protect it up to cover their robes and don't allow them to get wet, they'll be able to enjoy it.",
        "source": "T24n1462_015:0781a20_64"
    },
    {
        "source_sentence": "若受中頭陀法，無雨時露地，雨時屋下、若入屋下，得受僧臥具。",
        "translation": "If he accepts the ascetic's teaching, he'll be exposed to the ground when there's no rain, and if he goes under a roof or enters it when it rains, he'll be allowed to accept the saṃgha's bedding.",
        "source": "T24n1462_015:0781a21_65"
    },
    {
        "source_sentence": "若檀越見比丘露住，為作眾僧臥具，比丘受已，若有比丘應付囑，若無比丘付囑，",
        "translation": "If a donor sees a monk living in public and makes bedding for the sake of the saṃgha, and after accepting it for the monks, if there's a monk who should entrust it to him, or if there's no monk who entrusts it to him,",
        "source": "T24n1462_015:0781a23_66"
    },
    {
        "source_sentence": "與近住處，若無近住，若空屋舉置，若無空屋，若厚密樹下，可縛舉已去，",
        "translation": "If there’s no nearby dwelling place, or if there’s an empty house to be lifted up, or if there’s no empty house, or if it’s under a thick and dense tree, they can be bound and lifted up and then removed.",
        "source": "T24n1462_015:0781a25_67"
    },
    {
        "source_sentence": "若不舉、若去時先作念：『我入聚落不久當還。』",
        "translation": "When he doesn't lift it or leaves it, he first thinks, 'I'll soon return when I enter a village or town.'",
        "source": "T24n1462_015:0781a26_68"
    },
    {
        "source_sentence": "如此去者無罪。",
        "translation": "It's no offense for someone to leave like this.",
        "source": "T24n1462_015:0781a28_0"
    },
    {
        "source_sentence": "若入聚落已，有八難因緣不得來，付囑無罪。",
        "translation": "If there are eight difficult reasons why they can't come after entering a village, it's no offense to entrust it.",
        "source": "T24n1462_015:0781a28_1"
    },
    {
        "source_sentence": "若實雨，言不雨而去，突吉羅。",
        "translation": "If it really rains, he says it doesn't rain and leaves, tukhila.",
        "source": "T24n1462_015:0781a29_2"
    },
    {
        "source_sentence": "床有四種。",
        "translation": "There are four kinds of beds.",
        "source": "T24n1462_015:0781b01_3"
    },
    {
        "source_sentence": "何謂為四？",
        "translation": "What are these four?",
        "source": "T24n1462_015:0781b01_4"
    },
    {
        "source_sentence": "一者波摩遮羅伽脚，二者文蹄脚，三者句利羅脚，四者阿遏遮脚。",
        "translation": "One is the foot of Padmasara, two are the feet of Mañjuśrī, three are the feet of Kauśinagara, and four are the feet of Ajñātaśatru.",
        "source": "T24n1462_015:0781b01_5"
    },
    {
        "source_sentence": "波摩遮羅床者，梐入脚。",
        "translation": "Padmacara's bed is a leg-enterer.",
        "source": "T24n1462_015:0781b03_6"
    },
    {
        "source_sentence": "文蹄脚床者，梐與脚相連成也。",
        "translation": "The footstool is made by joining the feet with the base.",
        "source": "T24n1462_015:0781b03_7"
    },
    {
        "source_sentence": "句利羅床者，或作馬蹄脚，或作羊蹄脚、虎狼師子，如是是名句利羅脚。",
        "translation": "The Kukkuṭika's feet may be made with horse hooves, sheep hooves, or tigers, wolves, lions, and so forth, which are called the Kukkuṭika's feet.",
        "source": "T24n1462_015:0781b04_8"
    },
    {
        "source_sentence": "阿遏遮脚者，脚入梐。",
        "translation": "An abhidharma that covers the feet is when the feet enter the abscess.",
        "source": "T24n1462_015:0781b06_9"
    },
    {
        "source_sentence": "如是床在露地敷已，離中人擲石外，波夜提。",
        "translation": "Such a bed that's spread out in the open air and tossed by someone outside the stone apart from it, pāyattika.",
        "source": "T24n1462_015:0781b06_10"
    },
    {
        "source_sentence": "若上座囑下座教敷床已，若上座置衣著床上，下座得去，若不置一物，",
        "translation": "If the superior seat asks the inferior seat to teach him to prepare a bed, or if the superior seat puts his robe on the bed and the inferior seat leaves it, then he'll be allowed to go; but if he doesn't place anything,",
        "source": "T24n1462_015:0781b07_11"
    },
    {
        "source_sentence": "下座應為併譡，若不併擋，囑上座已去無罪。",
        "translation": "The lower seat should be combined, but if he doesn't combine and block it, it's no offense to ask the higher seat to leave after entrusting it.",
        "source": "T24n1462_015:0781b09_12"
    },
    {
        "source_sentence": "若敷已未坐，更有比丘坐語已去無罪。",
        "translation": "If there's another monk who doesn't sit after spreading the mat, it's no offense to say that he's gone away after sitting.",
        "source": "T24n1462_015:0781b10_13"
    },
    {
        "source_sentence": "若為法師敷高座，若法師未來，敷者應守護，若法師坐已，得去無罪。",
        "translation": "If a high seat is spread out for the teacher of the Dharma, and if the teacher of the Dharma comes in the future, the spreader should guard it. If the teacher of the Dharma has sat down, it's no offense to go away.",
        "source": "T24n1462_015:0781b11_14"
    },
    {
        "source_sentence": "若先提坐蹬下至木椯，去時不自舉、不教人舉突吉羅。",
        "translation": "If Śāriputra sits and steps down to the wooden platform, he doesn't lift himself up or teach others to lift a tukhila when he leaves it.",
        "source": "T24n1462_015:0781b13_15"
    },
    {
        "source_sentence": "若眾僧染瓫水觚灑繩，去時應舉置常處而去，若不舉而去突吉羅。",
        "translation": "If the saṃgha dyes a stream of water and sprinkles a rope, he should lift it up and leave it at the usual place when he leaves it, or if he doesn't lift it, he'll leave it in a tukhāra.",
        "source": "T24n1462_015:0781b14_16"
    },
    {
        "source_sentence": "若他人私物，不舉亦突吉羅。",
        "translation": "If another person's private property isn't raised, it's also a grave offense.",
        "source": "T24n1462_015:0781b16_0"
    },
    {
        "source_sentence": "自己物去時不舉亦突吉羅。",
        "translation": "When his own things go away, he doesn't lift them up, which is also a grave offense.",
        "source": "T24n1462_015:0781b16_1"
    },
    {
        "source_sentence": "若有八難因緣，去時不舉不犯。」",
        "translation": "If there are eight difficult causes and conditions, they won't lift or violate them when they leave.",
        "source": "T24n1462_015:0781b17_2"
    },
    {
        "source_sentence": "法師曰：「餘文句易可解，不須廣說。",
        "translation": "The Master said, “The rest of the text is easy to understand and need not be explained in detail.",
        "source": "T24n1462_015:0781b18_3"
    },
    {
        "source_sentence": "此戒是制罪，從身心口起。",
        "translation": "These precepts are disciplined offenses that arise from body, mind, and speech.",
        "source": "T24n1462_015:0781b18_4"
    },
    {
        "source_sentence": "房內敷僧臥具，或比次者，若皮作比次。",
        "translation": "A monk's bedding is spread inside his room, or it's arranged in order if he makes a comparison with the leather.",
        "source": "T24n1462_015:0781b19_5"
    },
    {
        "source_sentence": "比次者，是枕囊或坐囊。",
        "translation": "In order, it's a sleeping bag or sitting bag.",
        "source": "T24n1462_015:0781b20_6"
    },
    {
        "source_sentence": "若薦席下至草敷，去時自不舉、不教人舉，若無籬障，去離一擲石外還，",
        "translation": "If he recommends a seat down to the grass and doesn't lift it when he leaves it, or doesn't tell others to lift it, or if there's no hedge obstruction, he removes it and throws it back out of the rock.",
        "source": "T24n1462_015:0781b21_7"
    },
    {
        "source_sentence": "突吉羅，二擲石外還波夜提。",
        "translation": "A tukhila returns to pāyatti with two tosses outside the stone.",
        "source": "T24n1462_015:0781b22_8"
    },
    {
        "source_sentence": "若有籬，出籬外便犯。",
        "translation": "If there's a hedge, it's a violation to go outside the hedge.",
        "source": "T24n1462_015:0781b23_9"
    },
    {
        "source_sentence": "僧房內敷僧臥具戒廣說竟。",
        "translation": "He spreads out the monk's bedding inside the saṃgha's room and explains the precepts in detail.",
        "source": "T24n1462_015:0781b24_10"
    },
    {
        "source_sentence": "「知他比丘敷臥具竟，後來惱他比丘波夜提，若不知、若疑，亦波夜提，",
        "translation": "Knowing that another monk has finished spreading out his bedding, he later disturbs another monk pāyattika. If he doesn’t know or doubts it, he also becomes pāyattika.",
        "source": "T24n1462_015:0781b24_11"
    },
    {
        "source_sentence": "若八難因緣不犯。",
        "translation": "If the causes and conditions of the eight difficulties don't violate it.",
        "source": "T24n1462_015:0781b26_12"
    },
    {
        "source_sentence": "惱他戒廣說竟，是性罪。",
        "translation": "When the precept against harming others has been extensively explained, it's a sin by nature.",
        "source": "T24n1462_015:0781b26_13"
    },
    {
        "source_sentence": "「重閣者，下至倚立，不著頭無罪。",
        "translation": "It's no offense for a heavy pavilion to go down and stand upright without touching its head.",
        "source": "T24n1462_015:0781b27_14"
    },
    {
        "source_sentence": "無罪者，非重閣者不犯。",
        "translation": "A person who isn't guilty doesn't violate the precepts if it's not a heavy pavilion.",
        "source": "T24n1462_015:0781b28_15"
    },
    {
        "source_sentence": "重閣戒廣說竟。",
        "translation": "The precepts of the heavy pavilion have been explained in detail.",
        "source": "T24n1462_015:0781b28_16"
    },
    {
        "source_sentence": "「若重泥者，若戶兩邊及上頭，得二肘半重泥，若戶高下有壁，亦得重泥，",
        "translation": "“If there’s heavy mud, two and a half ounces of mud at both ends of the door and its top will be obtained. If the door is high and low but has a wall, it also gets heavy mud.",
        "source": "T24n1462_015:0781b29_17"
    },
    {
        "source_sentence": "窓四面亦得重泥。",
        "translation": "The four sides of the windows are also covered with heavy mud.",
        "source": "T24n1462_015:0781c01_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1462_015:0781c02_19"
    },
    {
        "source_sentence": "為開閉窓戶故。",
        "translation": "It's because they open and close the windows and doors.",
        "source": "T24n1462_015:0781c02_20"
    },
    {
        "source_sentence": "覆者，覆有二種：一者圓覆，二者縱覆。",
        "translation": "Covering: There are two kinds of covering: one is covered by circumference, and two are covered by vertical.",
        "source": "T24n1462_015:0781c02_21"
    },
    {
        "source_sentence": "若一教罷不犯，若瓦覆過三節，得波夜提。",
        "translation": "If he stops one teaching and doesn't violate it, or if the tile covers more than three sections, he'll attain pāyattika.",
        "source": "T24n1462_015:0781c03_22"
    },
    {
        "source_sentence": "若過三節，隨用瓦多少，一一波夜提。",
        "translation": "If he goes beyond three sections, he uses as many tiles as he wants, one pāyatti.",
        "source": "T24n1462_015:0781c04_23"
    },
    {
        "source_sentence": "若石灰覆過三節，隨用搏摶得波夜提。",
        "translation": "If a piece of ashes covers more than three knuckles, he'll use it to wrestle and attain pāyatti.",
        "source": "T24n1462_015:0781c05_24"
    },
    {
        "source_sentence": "若草覆過三節，隨用草，把把得波夜提。",
        "translation": "If grass covers more than three knuckles, he uses grass as he takes it and attains pāyattika with his hand.",
        "source": "T24n1462_015:0781c06_25"
    },
    {
        "source_sentence": "若覆不好、壞更覆，不犯。",
        "translation": "It's not a violation if the cover isn't good or when it breaks down and is covered again.",
        "source": "T24n1462_015:0781c07_26"
    },
    {
        "source_sentence": "無罪者，語已去不犯。",
        "translation": "A person who isn't guilty doesn't violate the precept after speaking it.",
        "source": "T24n1462_015:0781c08_27"
    },
    {
        "source_sentence": "若空處作屋過三節，覆突吉羅，此是制罪。",
        "translation": "If someone builds a house in an empty place and goes beyond the three sections to cover a grave offense, this is a restraining offense.",
        "source": "T24n1462_015:0781c08_28"
    },
    {
        "source_sentence": "「知水有蟲者，隨因緣知也。",
        "translation": "Knowing that water has worms, he knows them according to causes and conditions.",
        "source": "T24n1462_015:0781c09_29"
    },
    {
        "source_sentence": "若自澆若教他澆，自澆者，隨息一一得波夜提；",
        "translation": "If someone pours water for themselves or teaches others to pour, and if they pour it for themselves, one by one they attain pāyattiness.",
        "source": "T24n1462_015:0781c10_30"
    },
    {
        "source_sentence": "若教他澆，隨語語得波夜提。",
        "translation": "If someone teaches others to pour water, they'll follow their words and attain pāyatti.",
        "source": "T24n1462_015:0781c11_31"
    },
    {
        "source_sentence": "此是性罪，從身心口起。",
        "translation": "These are sins by nature, which arise from body, mind, and speech.",
        "source": "T24n1462_015:0781c12_32"
    },
    {
        "source_sentence": "用蟲水戒廣說竟。",
        "translation": "Using insect water precepts, he explains them in detail.",
        "source": "T24n1462_015:0781c12_33"
    },
    {
        "source_sentence": "「教誡比丘尼者，大得供養者，諸大德為教誡比丘尼故，大得利養，非比丘尼與，",
        "translation": "“Instructing bhikṣus and nuns: Those who are greatly rewarded with offerings—the great virtuous ones, for the sake of instructing bhikṣus and nuns, attain great rewards and benefits, not those given by bhikṣus and nuns.",
        "source": "T24n1462_015:0781c14_0"
    },
    {
        "source_sentence": "亦非比丘尼教與，此諸比丘尼，有是國王女、大臣女，或是大富長者女，",
        "translation": "These bhikṣus and nuns are either the daughters of kings, queens, ministers, or women of wealthy families.",
        "source": "T24n1462_015:0781c15_1"
    },
    {
        "source_sentence": "各自還家，父母問言：『誰為教授比丘尼？』",
        "translation": "Each returned home, and their parents asked, 'Who taught the monks and nuns?'",
        "source": "T24n1462_015:0781c17_2"
    },
    {
        "source_sentence": "答言：『諸大德教授我等。』",
        "translation": "He replied, 'The great virtuous ones teach us.'",
        "source": "T24n1462_015:0781c18_3"
    },
    {
        "source_sentence": "父母聞已發歡喜心，即以四事飲食、衣服、湯藥、臥具，供養諸大德。",
        "translation": "Having heard this, the parents rejoiced and offered four kinds of food, drink, clothing, hot water, medicine, and bedding to the great virtuous ones.",
        "source": "T24n1462_015:0781c19_0"
    },
    {
        "source_sentence": "有比丘尼還家，說諸大德持戒、精進、學問、忍辱、貴姓，父母聞已增加供養。",
        "translation": "A bhikṣuṇī returned home and told the great virtuous ones about observing precepts, exerting effort, training, forbearance, and noble family names, and after hearing them, his parents increased their offerings.",
        "source": "T24n1462_015:0781c20_1"
    },
    {
        "source_sentence": "以三種因緣，諸大德大得利養。",
        "translation": "Because of these three kinds of causes and conditions, the great virtues are greatly benefited.",
        "source": "T24n1462_015:0781c22_2"
    },
    {
        "source_sentence": "六群比丘，見諸大德大得利養，便語比丘尼言：『我等亦能教授比丘尼。』",
        "translation": "Seeing that the six groups of monks were greatly benefited by the great virtues, they said to the monks and nuns, 'We can also teach the monks and nuns.'",
        "source": "T24n1462_015:0781c22_3"
    },
    {
        "source_sentence": "比丘尼聞已，往六群比丘所求教授。",
        "translation": "After the bhikṣuṇīs heard this, they went to the six groups of monks who were seeking instruction.",
        "source": "T24n1462_015:0781c24_4"
    },
    {
        "source_sentence": "六群比丘，為比丘尼說少法已，便多說世間國土治化飢儉豐熟城邑聚落，",
        "translation": "Six groups of monks, having taught a little doctrine to the bhikṣus and nuns, then explained much about worldly lands governed by hunger, frugality, and plenty, cities, towns, and villages.",
        "source": "T24n1462_015:0781c25_5"
    },
    {
        "source_sentence": "此等皆是三惡道語。",
        "translation": "These are all the words of the three bad destinies.",
        "source": "T24n1462_015:0781c27_6"
    },
    {
        "source_sentence": "是故律本中說，若比丘有八法堪教誡比丘尼。",
        "translation": "That's why it's said in the text of the vinaya that if a monk has eight dharmas, he's capable of admonishing monks and nuns.",
        "source": "T24n1462_015:0781c27_7"
    },
    {
        "source_sentence": "何者為八？",
        "translation": "What are the eight?",
        "source": "T24n1462_015:0781c28_8"
    },
    {
        "source_sentence": "一者持戒，二者守護波羅提木叉，三者威儀具足，四者見小罪生怖畏心，",
        "translation": "They are (1) observing the precepts, (2) guarding the prātimokṣa, (3) endowed with proper deportment, and (4) being frightened by minor offenses.",
        "source": "T24n1462_015:0781c29_0"
    },
    {
        "source_sentence": "五者堅持，六者多聞，七者多聞堅固，八者分別說法初中後善，純一清白梵行具足，",
        "translation": "The fifth is resolute, the sixth well-versed, the seventh well-versed steadfast, and the eighth discerns what’s good in the beginning, middle, and end of discourse, fully endowed with pure and genuine religious practice.",
        "source": "T24n1462_015:0782a01_1"
    },
    {
        "source_sentence": "正見無邪誦二部波羅提木叉，義字分明音聲流利為比丘尼恭敬貴重，善能隨順說法，",
        "translation": "The two parts of the Abhidharma-mahāviśeṣa (i.e., the true doctrine) and the two parts of the Abhidharma-mahāviśeṣa (the correct doctrine) are recited without error; their meanings are clearly expressed in syllables that flow with respect and reverence from bhikṣuṇī to bhik",
        "source": "T24n1462_015:0782a03_2"
    },
    {
        "source_sentence": "是名八法。",
        "translation": "These are called the eight dharmas.",
        "source": "T24n1462_015:0782a05_3"
    },
    {
        "source_sentence": "「持戒者，或言戒在身，或言持戒不犯，是名持戒。",
        "translation": "A person who observes the precepts sometimes says the precepts are present in his body and sometimes says he observes the precepts without violating them, which is called observing the precepts.",
        "source": "T24n1462_015:0782a05_4"
    },
    {
        "source_sentence": "護持者，身口意業不犯，或言行無上法，或言受具足波羅提木叉法，是名守護持。",
        "translation": "A guardian is someone who doesn't violate physical, verbal, or mental actions and sometimes says they practice the unsurpassed Dharma or receive the full prātimokṣa dharma, which is called a guardian.",
        "source": "T24n1462_015:0782a07_0"
    },
    {
        "source_sentence": "威儀具足者，不邪命自活，不往五處：一者婬女、二者寡婦、三者比丘尼寺、四者大童女家、五者黃門，",
        "translation": "Those who are endowed with deportment will not take up wrong livelihood, and they won't go to five places: first, a promiscuous woman, second, a widow, third, a bhikṣuṇī temple, fourth, a house of a great girl, and fifth, the yellow gate.",
        "source": "T24n1462_015:0782a08_1"
    },
    {
        "source_sentence": "亦不往信心優婆夷家，是名威儀具足。",
        "translation": "Nor does he go to the house of a faithful Upāsikā, which is called being fully endowed with deportment.",
        "source": "T24n1462_015:0782a11_2"
    },
    {
        "source_sentence": "見小罪生怖畏者，若見小罪如見大毒蛇無異，是名怖畏。",
        "translation": "A person who sees minor sins and becomes frightened is called fearful if he sees minor sins like a large poisonous snake that's no different from them.",
        "source": "T24n1462_015:0782a12_3"
    },
    {
        "source_sentence": "堅持不犯者，於持戒中不生退心，是名堅持。",
        "translation": "Someone who adheres to and doesn't violate the precepts and doesn't give rise to retrogressive thoughts in observing the precepts is called adherent.",
        "source": "T24n1462_015:0782a13_4"
    },
    {
        "source_sentence": "多聞者，解一阿含或言二阿含，是名多聞。",
        "translation": "A well-versed person who understands one or says two abhidharmas, which is called well-versed.",
        "source": "T24n1462_015:0782a14_5"
    },
    {
        "source_sentence": "堅固者，所解阿含堅固不失，是名多聞堅固。",
        "translation": "Being resolute means that the learned Āgamas are resolute and not lost, which is called well-versed being resolute.",
        "source": "T24n1462_015:0782a15_6"
    },
    {
        "source_sentence": "初中後善者。」",
        "translation": "The first is good, and the second is good.",
        "source": "T24n1462_015:0782a16_7"
    },
    {
        "source_sentence": "法師曰：「於毘蘭若婆羅門品以說。",
        "translation": "The teacher of the Dharma said, It's explained in the Vaiśravaṇa- brāhmaṇa class.",
        "source": "T24n1462_015:0782a17_0"
    },
    {
        "source_sentence": "義字分明者，為人解說無疑亂。",
        "translation": "The word clarity of meaning means to explain it for people without doubt and confusion.",
        "source": "T24n1462_015:0782a17_1"
    },
    {
        "source_sentence": "音聲流利者，言辭辯了亦不謇吃。",
        "translation": "A sound that's continuous is when it's spoken and eloquent, and it doesn't eat.",
        "source": "T24n1462_015:0782a18_2"
    },
    {
        "source_sentence": "反復流利者，誦二部波羅提木叉，無有滯礙，半月半月盡布薩，悉知六齋日，",
        "translation": "Those who recite the two parts of the prātimokṣasa without obstruction can know the full duration of the six days of fast for one-half month and half a month.",
        "source": "T24n1462_015:0782a19_3"
    },
    {
        "source_sentence": "能為人說法；",
        "translation": "They are able to teach the Dharma for others.",
        "source": "T24n1462_015:0782a21_4"
    },
    {
        "source_sentence": "若誦一阿含二阿含亦知無礙，知沙門禪定法，乃至阿羅漢果悉知無礙。",
        "translation": "If someone recites one or two abhidharmas, they'll also know them without obstruction and know the ascetic's method of meditation up to the fruit of arhatship without obstruction.",
        "source": "T24n1462_015:0782a21_5"
    },
    {
        "source_sentence": "若滿二十歲，能為人受具足戒。」",
        "translation": "If he reaches 20 years old, he'll be able to receive the full set of precepts for someone.",
        "source": "T24n1462_015:0782a23_6"
    },
    {
        "source_sentence": "法師曰：「何以不言知阿毘曇？」",
        "translation": "The teacher of the Dharma said, Why doesn't he say he knows the abhidharma?",
        "source": "T24n1462_015:0782a23_7"
    },
    {
        "source_sentence": "答曰：「若能知阿毘曇最善，若下根者，知律及修多羅，亦得教授。」",
        "translation": "He answered, If someone can know the supreme goodness of the abhidharma and those with lower faculties know the vinaya and sūtra, they'll also be taught.",
        "source": "T24n1462_015:0782a24_8"
    },
    {
        "source_sentence": "「音聲流利女人樂聞，何以言音聲流利教授比丘尼？」",
        "translation": "How can a woman who enjoys listening to the sounds and sounds of Śāriputra say that she teaches the monks and nuns by speaking the sounds and sounds of Śāriputra?",
        "source": "T24n1462_015:0782a26_0"
    },
    {
        "source_sentence": "答曰：「女人多貪著音聲，然後聽法。",
        "translation": "He answered, Many women cling to sounds and then listen to the teachings.",
        "source": "T24n1462_015:0782a27_1"
    },
    {
        "source_sentence": "為比丘尼敬重者，此比丘有道德故，為比丘尼所貴重，不污三眾。",
        "translation": "Because this monk has morality, he's valued by the bhikṣuṇīs and doesn't defile the three groups of people.",
        "source": "T24n1462_015:0782a28_0"
    },
    {
        "source_sentence": "何以言污三眾不得教授？",
        "translation": "Why do you say that you defile the three groups of people and won't teach them?",
        "source": "T24n1462_015:0782a29_1"
    },
    {
        "source_sentence": "若教授者，此尼見者不生敬重心。",
        "translation": "If someone teaches, this nun's view doesn't give rise to respect.",
        "source": "T24n1462_015:0782b01_2"
    },
    {
        "source_sentence": "滿二十歲者，若滿二十歲，持法堅固少有退敗，年少輕躁易可退敗，是故制滿二十臘，",
        "translation": "The one who is over twenty years old: when he is over twenty years old, the doctrine of adherence is steadfast and there is little regression. It is easy to fall away from youthfulness and frivolity. That is why it is limited to twenty years.",
        "source": "T24n1462_015:0782b02_0"
    },
    {
        "source_sentence": "堪教誡比丘尼。",
        "translation": "He's capable of admonishing monks and nuns.",
        "source": "T24n1462_015:0782b04_1"
    },
    {
        "source_sentence": "掃灑房舍灑水者，所以掃灑辦水者，比丘既從遠來，宜應供給床席水漿，",
        "translation": "Because the monks come from a distant land, it is advisable for them to provide seats, beds, water, and juice.",
        "source": "T24n1462_015:0782b04_2"
    },
    {
        "source_sentence": "若無薦席，下至草敷。",
        "translation": "If you don't have a recommended seat, go down to the grass and spread it out.",
        "source": "T24n1462_015:0782b06_3"
    },
    {
        "source_sentence": "若為尼說法，應須一伴，不得房中說，若比丘尼於路見比丘，遠則合掌、近應和南，",
        "translation": "If he teaches the Dharma to a nun, he must have one companion who doesn't allow him to teach it in his room. If a monk or nun sees a monk on the roadway, they should join their palms at a distance and pay homage when approaching him.",
        "source": "T24n1462_015:0782b06_4"
    },
    {
        "source_sentence": "乃至王難路濕，亦應問訊。",
        "translation": "Even if the king's road is difficult and wet, he should also exchange greetings.",
        "source": "T24n1462_015:0782b08_5"
    },
    {
        "source_sentence": "夏安居，去比丘寺半由旬得安居，過半由旬不得。",
        "translation": "On the summer retreat, he leaves a monk's monastery for half a yojana to gain his retreat and doesn't get more than half a yojana.",
        "source": "T24n1462_015:0782b09_6"
    },
    {
        "source_sentence": "若檀越請比丘尼夏坐，無比丘依，安居比丘尼欲去，檀越語言：『但住，",
        "translation": "If the donor invites a bhikṣuṇī to spend the rains retreat and there is no bhikṣu or bhikṣuṇī living with him, and if the bhikṣuṇī who lives in dependence wishes to depart, the donor says:",
        "source": "T24n1462_015:0782b10_7"
    },
    {
        "source_sentence": "弟子為請比丘來。』",
        "translation": "The disciple invited the monk to come.'",
        "source": "T24n1462_015:0782b12_8"
    },
    {
        "source_sentence": "若請未得，至後安居，有比丘得住。",
        "translation": "If he invites someone who hasn't yet attained it and goes to a later retreat, that monk will be allowed to stay.",
        "source": "T24n1462_015:0782b12_9"
    },
    {
        "source_sentence": "若為請不得，應去。",
        "translation": "If you won't accept the invitation, you should leave.",
        "source": "T24n1462_015:0782b13_10"
    },
    {
        "source_sentence": "若道路有命難、有梵行難，無比丘得安居不犯。",
        "translation": "If there's a difficulty with life on the road and a difficulty with religious practice, it's not a violation if no monk can live in peace.",
        "source": "T24n1462_015:0782b13_11"
    },
    {
        "source_sentence": "若初安居有比丘，結安居竟。",
        "translation": "Suppose there's a monk at the beginning of his retreat who ends his retreat after he concludes it.",
        "source": "T24n1462_015:0782b14_12"
    },
    {
        "source_sentence": "若比丘有因緣去，若罷道若病，比丘尼不知後知，以結安居不得移住，",
        "translation": "If a monk or nun leaves the path for some reason, or becomes ill, and doesn't know the latter, that monk or nun won't be allowed to move or stay because of the bond of peace.",
        "source": "T24n1462_015:0782b15_13"
    },
    {
        "source_sentence": "無罪。",
        "translation": "It's no offense.",
        "source": "T24n1462_015:0782b17_14"
    },
    {
        "source_sentence": "若安居竟，不得無比丘自恣，應覓，半月半月應往大僧中請二法。",
        "translation": "If he finishes his retreat, he mustn't go without a monk to perform the ceremony himself; he should search for it and go to the great saṃgha for half a month or half a month to ask for two things.",
        "source": "T24n1462_015:0782b17_15"
    },
    {
        "source_sentence": "何者二法？",
        "translation": "What are these two things?",
        "source": "T24n1462_015:0782b19_16"
    },
    {
        "source_sentence": "一者問布薩日，二者請教誡。」",
        "translation": "One asks about the day of the upāsāda, and two ask for instructions.",
        "source": "T24n1462_015:0782b19_17"
    },
    {
        "source_sentence": "法師曰：「如來何故慇懃囑授比丘尼？",
        "translation": "The teacher of the Dharma said, Why did the Tathāgata entrust it to the monks and nuns?",
        "source": "T24n1462_015:0782b20_18"
    },
    {
        "source_sentence": "為比丘尼女人鈍根故，是時比丘尼僧，盡往比丘所受教誡，諸人譏嫌比丘尼，",
        "translation": "It was because the bhikṣuṇīs and women had dull faculties. At that time, all the bhikṣuṇīs and monks in the assembly were instructed by the bhikṣus who had gone before them, and everyone resented those bhikṣuṇīs.",
        "source": "T24n1462_015:0782b20_19"
    },
    {
        "source_sentence": "往白比丘，比丘往白佛，佛因此制。",
        "translation": "He went to the monk and told him, and the monk went to tell the Buddha, who ordered him to do so.",
        "source": "T24n1462_015:0782b22_20"
    },
    {
        "source_sentence": "自今以去，不得多比丘尼往請教誡，聽五人往。",
        "translation": "From now on, they won't allow many bhikṣus and nuns to go there to ask for instructions or listen to the five people who will go there.",
        "source": "T24n1462_015:0782b23_21"
    },
    {
        "source_sentence": "由致譏嫌，佛言：『聽二三人往，比丘尼僧，應羯磨差二三人，往大僧中請教誡；",
        "translation": "Because of this criticism, the Buddha said to them, “The bhikṣus and nuns should send two or three members of the assembly to the great assembly to instruct and admonish each other.",
        "source": "T24n1462_015:0782b24_22"
    },
    {
        "source_sentence": "乃至阿蘭若比丘，亦應教誡比丘尼。』",
        "translation": "Even monks and nuns in a forest should also admonish monks and nuns.'",
        "source": "T24n1462_015:0782b26_23"
    },
    {
        "source_sentence": "云何教誡？",
        "translation": "What's the instruction?",
        "source": "T24n1462_015:0782b27_24"
    },
    {
        "source_sentence": "應作期，若樹下、若客舍中，比丘尼期往不往，得突吉羅。",
        "translation": "If a monk or nun goes under a tree or in a guest's dwelling at the right time and doesn't go there when the time is up, he or she will be given a grave offense.",
        "source": "T24n1462_015:0782b27_25"
    },
    {
        "source_sentence": "若比丘不至期處待，亦得突吉羅。",
        "translation": "If a monk doesn't arrive at the right place to wait, he'll also be given a grave offense.",
        "source": "T24n1462_015:0782b28_26"
    },
    {
        "source_sentence": "比丘尼十四日自恣，比丘僧十五日自恣，若比丘尼請說，若不說八敬先說餘法，",
        "translation": "If a monk or nun asks for an explanation, and if he or she doesn't explain the eight kinds of reverence, he or she first explains the other teachings.",
        "source": "T24n1462_015:0782b29_27"
    },
    {
        "source_sentence": "突吉羅。",
        "translation": "Tukhāra.",
        "source": "T24n1462_015:0782c02_28"
    },
    {
        "source_sentence": "若說八敬已後說餘法不犯，除答問不犯，除為他說尼聽不犯，為式叉摩尼沙彌尼說不犯。」",
        "translation": "If someone explains the other rules after speaking the eight kinds of reverence and doesn't violate them, they won't violate them except by answering a question, or they won't violate them unless they listen to the bhikṣuṇīs who teach them for others, or they won't violate them if they say they won't violate them to the Śākyamuni",
        "source": "T24n1462_015:0782c02_29"
    },
    {
        "source_sentence": "法師曰：「餘文句易可解，不須廣說。",
        "translation": "The Master said, “The rest of the text is easy to understand and need not be explained in detail.",
        "source": "T24n1462_015:0782c05_30"
    },
    {
        "source_sentence": "此是制罪，從心口起三受。",
        "translation": "These are the three offenses of restraint, which arise from mind and mouth.",
        "source": "T24n1462_015:0782c05_31"
    },
    {
        "source_sentence": "若比丘僧不差，若往比丘尼寺教誡，波夜提。",
        "translation": "If a monk or saṃgha doesn't leave, and if he goes to a monk's nun's temple to admonish them, it's pāyattika.",
        "source": "T24n1462_015:0782c06_32"
    },
    {
        "source_sentence": "善見律毘婆沙卷第十五",
        "translation": "Shanjian lu vibhāṣa, vol. 15",
        "source": "T24n1462_015:0782c08_0"
    }
]