[
    {
        "source_sentence": "大智度初品總說如是我聞釋論",
        "translation": "Dazhiduo lun, the first chapter of the Mahāprajñāpāramitā-sūtra",
        "source": "T25n1509_002:0066a21_0"
    },
    {
        "source_sentence": "第三(卷第二)",
        "translation": "3. (Skt. vol. 2)",
        "source": "T25n1509_002:0066a22_0"
    },
    {
        "source_sentence": "龍樹菩薩造",
        "translation": "created by Nāgârjuna Bodhisattva",
        "source": "T25n1509_002:0066a24_0"
    },
    {
        "source_sentence": "後秦龜茲國三藏法師鳩摩羅什",
        "translation": "Kumārajīva, the Tripiṭaka Master of the Later Qin state of Kucha",
        "source": "T25n1509_002:0066a25_0"
    },
    {
        "source_sentence": "奉　詔譯",
        "translation": "translated by imperial edict",
        "source": "T25n1509_002:0066a26_0"
    },
    {
        "source_sentence": "「如是我聞：一時」，今當總說。",
        "translation": "Thus have I heard: one time, which will now be explained in a general way.",
        "source": "T25n1509_002:0066a27_0"
    },
    {
        "source_sentence": "問曰：若諸佛一切智人，自然無師，不隨他教，不受他法，不用他道，不從他聞而說法，何以言「如是我聞」？",
        "translation": "Q: If all buddhas and omniscience people naturally lack teachers, don't follow the teachings of others, don't accept the teachings of others, don't use the teachings of others, and don't teach the Dharma from what they hear, why would they say, Thus have I heard?",
        "source": "T25n1509_002:0066a27_1"
    },
    {
        "source_sentence": "答曰：如汝所言，佛一切智人，自然無師，不應從他聞法而說。",
        "translation": "Answer: As you say, the buddhas and omniscience people naturally have no teacher, so they shouldn't hear the teaching from others and explain it.",
        "source": "T25n1509_002:0066b01_2"
    },
    {
        "source_sentence": "佛法非但佛口說者是，一切世間真實善語、微妙好語，皆出佛法中。",
        "translation": "The Buddha's teaching isn't just what the Buddha teaches, but it's true that all the real good words and subtle and beautiful words in all the worlds come from the Buddha's teaching.",
        "source": "T25n1509_002:0066b02_3"
    },
    {
        "source_sentence": "如佛毘尼中說：「何者是佛法？",
        "translation": "As the Buddha said in the Vinaya, What's the Buddha's teaching?",
        "source": "T25n1509_002:0066b04_4"
    },
    {
        "source_sentence": "佛法有五種人說：一者、佛自口說，二者、佛弟子說，三者、仙人說，四者、諸天說，五者、化人說。」",
        "translation": "There are five kinds of people who say the Buddha's teaching: 1. the Buddha speaks it himself, 2. the Buddha's disciples speak it, 3. the sage speaks it, 4. the gods speak it, and 5. the transformation person speaks it.",
        "source": "T25n1509_002:0066b04_5"
    },
    {
        "source_sentence": "復次，如《釋提桓因得道經》，佛告憍尸迦：「世間真實善語、微妙好語，皆出我法中。」",
        "translation": "Furthermore, as in the Sutra on the Attainment of the Way by Śakra Devānām-Indra, the Buddha told Kauśika, The true good words and subtle and nice words of the world are all found in my teaching.",
        "source": "T25n1509_002:0066b06_6"
    },
    {
        "source_sentence": "　「諸世善語，　　皆出佛法；　　善說無失，",
        "translation": "The good words of all the worlds All reveal the buddha-dharma; They speak well, without error.",
        "source": "T25n1509_002:0066b08_7"
    },
    {
        "source_sentence": "　　無過佛語。　　餘處雖有，　　善無過語，",
        "translation": "The Buddha’s words are not false, for in all the other buddha-fields there are good and faultless sayings.",
        "source": "T25n1509_002:0066b08_7"
    },
    {
        "source_sentence": "　　一切皆是，　　佛法之餘。　　諸外道中，",
        "translation": "All of them are the exceptions for the buddha-dharma.",
        "source": "T25n1509_002:0066b08_7"
    },
    {
        "source_sentence": "　　設有好語，　　如虫食木，　　偶得成字。",
        "translation": "If there's good speech, it's like an insect eating wood that occasionally gets the word for form.",
        "source": "T25n1509_002:0066b08_7"
    },
    {
        "source_sentence": "　　初中下法，　　自共相破，　　如鐵出金，",
        "translation": "The first, middle, and lower dharmas are separated by their own distinctive characteristics, like iron producing gold.",
        "source": "T25n1509_002:0066b08_7"
    },
    {
        "source_sentence": "　　誰當信者？　　如伊蘭中，　　牛頭栴檀；",
        "translation": "Who will believe it? It is like the sandalwood ox-head sandalwood found in the forest.",
        "source": "T25n1509_002:0066b08_7"
    },
    {
        "source_sentence": "　　如苦種中，　　甘善美果。　　設能信者，",
        "translation": "In the seeds of suffering there are sweet, good, and delicious fruits.",
        "source": "T25n1509_002:0066b08_7"
    },
    {
        "source_sentence": "　　是人則信，　　外經書中，　　自出好語。",
        "translation": "That person then believes that good words are found in external sūtras and books.",
        "source": "T25n1509_002:0066b08_7"
    },
    {
        "source_sentence": "　　諸好實語，　　皆從佛出；　　如栴檀香，",
        "translation": "The good and true words All come from the Buddha, Like the fragrance of sandalwood.",
        "source": "T25n1509_002:0066b08_7"
    },
    {
        "source_sentence": "　　出摩梨山。　　除摩梨山，　　無出栴檀；",
        "translation": "With the exception of Mount Māra, there is no sandalwood that grows out of it.",
        "source": "T25n1509_002:0066b08_7"
    },
    {
        "source_sentence": "　　如是除佛，　　無出實語。」",
        "translation": "Thus, except for the Buddha, there's no true saying.",
        "source": "T25n1509_002:0066b08_7"
    },
    {
        "source_sentence": "如〈讚佛偈〉中說：復次，「如是我聞」，是阿難等佛大弟子輩說，入佛法相故，名為佛法。",
        "translation": "As it's said in the Praise of the Buddha Verse, Furthermore, Thus have I heard. This is what Ānanda and other great disciples of the Buddha taught, which is called the Buddha-dharma because they enter into the characteristics of the Buddha-dharma.",
        "source": "T25n1509_002:0066b08_7"
    },
    {
        "source_sentence": "如佛般涅槃時，於俱夷那竭國薩羅雙樹間，北首臥，將入涅槃。",
        "translation": "It's like when the Buddha was about to enter nirvāṇa, he was lying with his head facing north among the two śāla trees in the country of Kuśinagara and was about to enter nirvāṇa.",
        "source": "T25n1509_002:0066b22_8"
    },
    {
        "source_sentence": "爾時，阿難親屬愛未除，未離欲故，心沒憂海，不能自出。",
        "translation": "At the time, Ānanda's craving for his relatives hadn't yet been removed, and because he wasn't free of desire, his mind sank into the sea of grief and couldn't get out on its own.",
        "source": "T25n1509_002:0066b24_9"
    },
    {
        "source_sentence": "爾時，長老阿泥盧豆語阿難：「汝守佛法藏人，不應如凡人自沒憂海！",
        "translation": "At the time, the elder Aniruddha said to Ānanda, You people who guard the Buddha's store of the Dharma, you shouldn't be like ordinary people who sink into the sea of sorrow on their own!",
        "source": "T25n1509_002:0066b25_10"
    },
    {
        "source_sentence": "一切有為法，是無常相，汝莫愁憂！",
        "translation": "All conditioned dharmas are impermanent, so don't be sad!",
        "source": "T25n1509_002:0066b27_11"
    },
    {
        "source_sentence": "又佛手付汝法，汝今愁悶，失所受事。",
        "translation": "Again, the Buddha handed down this teaching to you. You are now in distress and have lost what you should receive.",
        "source": "T25n1509_002:0066b27_12"
    },
    {
        "source_sentence": "汝當問佛：『佛般涅槃後，我曹云何行道？",
        "translation": "You should ask the Buddha, 'After the Buddha's parinirvāṇa, how will we practice the path?'",
        "source": "T25n1509_002:0066b28_13"
    },
    {
        "source_sentence": "誰當作師？",
        "translation": "Who will be the teacher?",
        "source": "T25n1509_002:0066b29_14"
    },
    {
        "source_sentence": "惡口車匿，云何共住？",
        "translation": "How can we live together if we speak harshly to Chanda?",
        "source": "T25n1509_002:0066b29_15"
    },
    {
        "source_sentence": "佛經初作何等語？』",
        "translation": "What did the Buddha's sūtra say at the beginning?'",
        "source": "T25n1509_002:0066c01_16"
    },
    {
        "source_sentence": "如是種種未來事，應問佛。」",
        "translation": "Such are the various things that will be asked of the Buddha in the future.",
        "source": "T25n1509_002:0066c01_17"
    },
    {
        "source_sentence": "阿難聞是事，悶心小醒，得念道力助，於佛末後臥床邊，以此事問佛。",
        "translation": "When he heard this, Ānanda was overcome with distress and awoke after a little waking. Having benefited from the power of mindfulness of the path, he lay down at the side of his bed at the foot of the Buddha’s feet to ask the Buddha about this matter.",
        "source": "T25n1509_002:0066c02_18"
    },
    {
        "source_sentence": "佛告阿難：「若今現前，若我過去後，自依止，法依止，不餘依止。",
        "translation": "The Buddha told Ānanda, Suppose I were to rely on myself now or in the past and future, and the Dharma is relied upon, and there's no other basis.",
        "source": "T25n1509_002:0066c04_19"
    },
    {
        "source_sentence": "云何比丘自依止、法依止、不餘依止？",
        "translation": "How does a monk rely on himself, the Dharma and nothing else?",
        "source": "T25n1509_002:0066c05_20"
    },
    {
        "source_sentence": "於是比丘內觀身，常當一心智慧，勤修精進，除世間貪憂；",
        "translation": "The bhikṣu observed his body internally and always concentrated his mind on wisdom. He exerted himself with energy to remove worldly desires and cravings.",
        "source": "T25n1509_002:0066c06_21"
    },
    {
        "source_sentence": "外身、內外身觀，亦如是；",
        "translation": "The same applies to the contemplation on the outward body and to the inward and outward bodies.",
        "source": "T25n1509_002:0066c08_0"
    },
    {
        "source_sentence": "受、心、法念處，亦復如是。",
        "translation": "The same applies to feeling, to awarenesses and to the application of mindfulness on factors.",
        "source": "T25n1509_002:0066c08_1"
    },
    {
        "source_sentence": "是名比丘自依止、法依止、不餘依止。",
        "translation": "This is called a monk who relies on himself, relies on the Dharma and doesn't rely on anything else.",
        "source": "T25n1509_002:0066c09_2"
    },
    {
        "source_sentence": "從今日，解脫戒經即是大師；",
        "translation": "From this day on, the code of precepts for liberation is the great teacher.",
        "source": "T25n1509_002:0066c09_3"
    },
    {
        "source_sentence": "如解脫戒經說身業、口業，應如是行。",
        "translation": "As the sutra on liberating precepts explains, bodily action and verbal action should be done in this way.",
        "source": "T25n1509_002:0066c10_4"
    },
    {
        "source_sentence": "車匿比丘，我涅槃後，如梵法治；",
        "translation": "O monk Chanda, after my nirvana I will follow the Dharma as taught in Brahmā’s teaching.",
        "source": "T25n1509_002:0066c11_5"
    },
    {
        "source_sentence": "若心濡伏者，應教《刪陀迦旃延經》，即可得道。",
        "translation": "If someone's mind is wet and subdued, they should teach the Saṃdhinirmocana-sūtra, which will enable them to attain the Way.",
        "source": "T25n1509_002:0066c12_6"
    },
    {
        "source_sentence": "復次，我三阿僧祇劫所集法寶藏，是藏初應作是說：『如是我聞：一時，佛在某方、某國土、某處樹林中。』",
        "translation": "Furthermore, the treasury of the Dharma treasures that I've accumulated over three incalculably long eons should be explained like this at the beginning of the store, 'Thus have I heard: One time, the Buddha was staying in a certain place, a certain land, or a certain forest.'",
        "source": "T25n1509_002:0066c13_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_002:0066c15_8"
    },
    {
        "source_sentence": "過去諸佛經初皆稱是語，未來諸佛經初亦稱是語，現在諸佛末後般涅槃時亦教稱是語。",
        "translation": "At the beginning of all the buddhas' sutras in the past, they all called this statement; at the beginning of future buddhas' sutras, they also called this statement; and now, when the buddhas are parinirvāṇa at the end of their lives, they'll also teach to call it that.",
        "source": "T25n1509_002:0066c16_9"
    },
    {
        "source_sentence": "今我般涅槃後，經初亦應稱『如是我聞：一時』。」",
        "translation": "Now, after my parinirvāṇa, the first part of the sūtra should also say, Thus have I heard: One time.",
        "source": "T25n1509_002:0067a02_10"
    },
    {
        "source_sentence": "是故當知是佛所教，非佛自言「如是我聞」。",
        "translation": "Therefore, you should know that it's taught by the Buddha, not by the Buddha himself who says, Thus have I heard.",
        "source": "T25n1509_002:0067a03_11"
    },
    {
        "source_sentence": "佛一切智人，自然無師故，不應言「我聞」。",
        "translation": "Because the Buddha's all-wise person naturally has no teacher, they shouldn't say, I've heard it.",
        "source": "T25n1509_002:0067a04_12"
    },
    {
        "source_sentence": "若佛自說「如是我聞」，有所不知者，可有此難。",
        "translation": "If the Buddha himself says, Thus have I heard, and there's something he doesn't know, this difficulty could arise.",
        "source": "T25n1509_002:0067a05_13"
    },
    {
        "source_sentence": "阿難問佛，佛教是語，是弟子所言「如是我聞」，無有咎。",
        "translation": "Ānanda asked the Buddha, saying this is what Buddhism says, and the disciple said, Thus have I heard, so there's no blame.",
        "source": "T25n1509_002:0067a06_14"
    },
    {
        "source_sentence": "復次，欲令佛法久住世間故，長老摩訶迦葉等諸阿羅漢問阿難：「佛初何處說法？",
        "translation": "Again, in order to cause the Buddha's teaching to remain in the world for a long time, the elders Mahākāśyapa and other arhats asked Ānanda, Where did the Buddha first teach the Dharma?",
        "source": "T25n1509_002:0067a07_15"
    },
    {
        "source_sentence": "說何等法？」",
        "translation": "What teaching is it?",
        "source": "T25n1509_002:0067a09_16"
    },
    {
        "source_sentence": "阿難答：「如是我聞：一時，佛在波羅捺國仙人鹿林中，為五比丘說是苦聖諦。",
        "translation": "Ānanda answered, Thus I have heard: One time, the Buddha was staying at Deer Park among the Sages of Vārāṇasī in the country of Vārāṇasī, teaching this noble truth of suffering to five monks.",
        "source": "T25n1509_002:0067a09_17"
    },
    {
        "source_sentence": "我本不從他聞，法中正憶念得眼、智、明、覺。」",
        "translation": "I didn't hear it from others in the past, and I correctly remembered the teaching to attain eyes, knowledge, insight, and awakening.",
        "source": "T25n1509_002:0067a11_18"
    },
    {
        "source_sentence": "是經，是中應廣說。",
        "translation": "This sūtra should be explained in detail here.",
        "source": "T25n1509_002:0067a12_19"
    },
    {
        "source_sentence": "如《集法經》中廣說：佛入涅槃時，地六種動，諸河反流，疾風暴發，黑雲四起，惡雷掣電，雹雨驟墮，處處星流，師子惡獸哮吼喚呼，諸天、世人皆大號咷。",
        "translation": "As it's explained in detail in the Sutra on the Collection of the Dharma, when the Buddha enters nirvāṇa, the earth moves in six ways, rivers flow back and forth, swift wind arises, black clouds arise in four ways, bad thunder shakes lightning, hail storms rain down quickly, stars flow everywhere, lion demons roar and wail, and gods and",
        "source": "T25n1509_002:0067a12_20"
    },
    {
        "source_sentence": "諸天、人等皆發是言：「佛取涅槃，一何疾哉！",
        "translation": "The gods and humans all said, What's so urgent about the Buddha taking nirvāṇa?",
        "source": "T25n1509_002:0067a16_21"
    },
    {
        "source_sentence": "世間眼滅！」",
        "translation": "The worldly eye ceases!",
        "source": "T25n1509_002:0067a17_22"
    },
    {
        "source_sentence": "當是時間，一切草木、藥樹，華葉一時剖裂；",
        "translation": "At that time all the grass, trees, and medicinal trees with flowers and leaves would suddenly split apart at once.",
        "source": "T25n1509_002:0067a17_23"
    },
    {
        "source_sentence": "諸須彌山王盡皆傾搖，海水波揚，地大震動，山崖崩落；",
        "translation": "The kings of the polar mountains all swayed, and the water in the ocean rose high. The earth trembled greatly and the cliffs collapsed.",
        "source": "T25n1509_002:0067a18_24"
    },
    {
        "source_sentence": "諸樹摧折，四面煙起，甚大可畏。",
        "translation": "The trees shattered and broke down, and smoke rose from the four sides. It was terrifyingly large and fearsome.",
        "source": "T25n1509_002:0067a19_25"
    },
    {
        "source_sentence": "陂池江河盡皆嬈濁，彗星晝出。",
        "translation": "All the ponds and rivers are completely polluted, and meteors appear in the daytime.",
        "source": "T25n1509_002:0067a20_26"
    },
    {
        "source_sentence": "諸人啼哭，諸天憂愁，諸天女等郁伊哽咽，涕淚交流。",
        "translation": "The people cried in distress, and the gods grieved. All the heavenly maidens were overcome with sadness and sobbing in tears.",
        "source": "T25n1509_002:0067a21_0"
    },
    {
        "source_sentence": "諸學人等默然不樂，諸無學人念有為諸法一切無常。",
        "translation": "The students and others were silent and unhappy, and those who didn't study it thought that all conditioned dharmas are impermanent.",
        "source": "T25n1509_002:0067a22_1"
    },
    {
        "source_sentence": "如是天、人、夜叉、羅剎、犍闥婆、甄陀羅、摩睺羅伽及諸龍等，皆大憂愁。",
        "translation": "Such gods, humans, yakṣas, rājas, gandharvas, kinnaras, mahoragas, and dragons are all greatly grieved.",
        "source": "T25n1509_002:0067a23_2"
    },
    {
        "source_sentence": "　「已渡凡夫恩愛河，　　老病死券已裂破；",
        "translation": "Having crossed the river of benevolence and affection for worldlings, The bonds of old age, sickness, and death have been broken.",
        "source": "T25n1509_002:0067a25_0"
    },
    {
        "source_sentence": "　　見身篋中四大蛇，　　今入無餘滅涅槃！」",
        "translation": "Seeing the four major snakes in your body, he enters nirvāṇa without remainder!",
        "source": "T25n1509_002:0067a25_0"
    },
    {
        "source_sentence": "諸阿羅漢度老病死海，心念言：諸大阿羅漢各各隨意，於諸山林流泉谿谷，處處捨身而般涅槃；",
        "translation": "The arhats, crossing the sea of old age, sickness, and death, thought to themselves, “Each of the great arhats has his or her own wishes. In mountains, forests, streams, fountains, and valleys, he or she will attain nirvana by abandoning body everywhere.",
        "source": "T25n1509_002:0067a25_0"
    },
    {
        "source_sentence": "更有諸阿羅漢於虛空中飛騰而去，譬如鴈王現種種神力，令眾人心信清淨，然後般涅槃。",
        "translation": "Good man, there are also arhats flying up and down in midair. It is like the analogy of a garuḍa king manifesting various kinds of magical powers that purify the minds of sentient beings and enable them to attain parinirvāṇa after having done so.",
        "source": "T25n1509_002:0067a29_1"
    },
    {
        "source_sentence": "六欲天乃至遍淨天等，見諸阿羅漢皆取滅度，各心念言：「佛日既沒，種種禪定解脫智慧弟子光亦滅。",
        "translation": "The six heavens of desire and even the pervasively pure heavens saw that all the arhats had entered nirvāṇa, and each thought, Since the Buddha's day has passed, the light of the disciples of various meditations, liberations, and wisdom ceased as well.",
        "source": "T25n1509_002:0067b02_2"
    },
    {
        "source_sentence": "是諸眾生有種種婬怒癡病，是法藥師輩今疾滅度，誰當治者？",
        "translation": "These sentient beings have various kinds of lust, anger, and delusion, and this is the Dharma Medicine Master's group who are now sick and liberated, so who will treat them?",
        "source": "T25n1509_002:0067b05_0"
    },
    {
        "source_sentence": "無量智慧大海中生弟子蓮華，今已乾枯；",
        "translation": "In the great ocean of boundless knowledge and wisdom there grew the disciples’ lotus blossoms, which have now withered.",
        "source": "T25n1509_002:0067b06_1"
    },
    {
        "source_sentence": "法樹摧折，法雲散滅；",
        "translation": "The tree of enlightenment is broken down, and the cloud of enlightenment disappears.",
        "source": "T25n1509_002:0067b07_2"
    },
    {
        "source_sentence": "大智象王既逝，象子亦隨去；",
        "translation": "When the great elephant king Mahāprajñāpāramitā had passed away, the son of the elephant also departed with him.",
        "source": "T25n1509_002:0067b07_3"
    },
    {
        "source_sentence": "法商人過去，從誰求法寶？」",
        "translation": "Where did the Dharma merchants come from to seek the treasure of the Dharma?",
        "source": "T25n1509_002:0067b08_4"
    },
    {
        "source_sentence": "　「佛已永寂入涅槃，　　諸滅結眾亦過去；",
        "translation": "The Buddha has entered nirvana in eternal quiescence, And the assemblies to extinguish fetters have also passed away.",
        "source": "T25n1509_002:0067b09_5"
    },
    {
        "source_sentence": "　　世界如是空無智，　　癡冥遂增智燈滅！」",
        "translation": "The world is thus empty and lacks wisdom, and the lamp of wisdom ceases in the darkness of delusion!",
        "source": "T25n1509_002:0067b09_5"
    },
    {
        "source_sentence": "　「耆年欲恚慢已除，　　其形譬如紫金柱，",
        "translation": "An elderly man's desire for conceit has been removed, and its shape is like a purple-gold pillar.",
        "source": "T25n1509_002:0067b09_5"
    },
    {
        "source_sentence": "　　上下端嚴妙無比，　　目明清淨如蓮華！」",
        "translation": "Their superior and inferior are incomparably beautiful, and their eyes are as clear and pure as lotus flowers!",
        "source": "T25n1509_002:0067b09_5"
    },
    {
        "source_sentence": "如偈說：爾時，諸天禮摩訶迦葉足，說偈言：如是讚已，白大迦葉言：「大德迦葉！",
        "translation": "As a verse says, At that point, the gods bowed at Mahākāśyapa's feet and spoke in verse, saying, After praising him like this, they said to Mahākāśyapa, Mañjuśrī Kāśyapa!",
        "source": "T25n1509_002:0067b09_5"
    },
    {
        "source_sentence": "仁者知不？",
        "translation": "Do you know this, sir?",
        "source": "T25n1509_002:0067b15_6"
    },
    {
        "source_sentence": "法船欲破，法城欲頹，法海欲竭，法幢欲倒，法燈欲滅；",
        "translation": "The ship of the Teaching is about to break down; the city of the Teaching is about to decline; the ocean of the Teaching is about to dry up; the banner of the Teaching is about to overturn; the lamp of the Teaching is about to go out.",
        "source": "T25n1509_002:0067b16_7"
    },
    {
        "source_sentence": "說法人欲去，行道人漸少，惡人力轉盛，當以大慈建立佛法！」",
        "translation": "When the Dharma preacher wants to leave, the number of practitioners of the Way will gradually decrease and bad people will grow in strength, so you must establish the Buddha's teaching with great compassion!",
        "source": "T25n1509_002:0067b17_8"
    },
    {
        "source_sentence": "爾時，大迦葉心如大海，澄靜不動，良久而答：「汝等善說！",
        "translation": "At that point, Mahākāśyapa's mind was like a great ocean, clear and unmoving, and after a long time, he answered, Good, you say!",
        "source": "T25n1509_002:0067b19_0"
    },
    {
        "source_sentence": "實如所言，世間不久，無智盲冥。」",
        "translation": "As you really say, it won't be long before the world becomes ignorant and blind.",
        "source": "T25n1509_002:0067b20_1"
    },
    {
        "source_sentence": "於是大迦葉默然受請。",
        "translation": "Mahākāśyapa then accepted the invitation by remaining silent.",
        "source": "T25n1509_002:0067b21_0"
    },
    {
        "source_sentence": "爾時，諸天禮大迦葉足，忽然不現，各自還去。",
        "translation": "At the time, the gods bowed at Mahākāśyapa's feet, suddenly disappeared, and each returned.",
        "source": "T25n1509_002:0067b21_1"
    },
    {
        "source_sentence": "是時，大迦葉思惟：「我今云何使是三阿僧祇劫難得佛法而得久住？」",
        "translation": "At that point, Mahākāśyapa thought, Now, how can I make these three incalculable eons become long-lasting because it's difficult to attain the Buddha's teaching?",
        "source": "T25n1509_002:0067b22_2"
    },
    {
        "source_sentence": "如是思惟竟，「我知是法可使久住，應當結集修妬路、阿毘曇、毘尼，作三法藏。",
        "translation": "After this thought, he said, I know that this teaching can be made to last for a long time, so I should compile the sūtra, abhidharma, and vinaya into three collections of teachings.",
        "source": "T25n1509_002:0067b24_3"
    },
    {
        "source_sentence": "如是佛法可得久住，未來世人可得受行。",
        "translation": "Thus, the Buddha's teaching can be abided for a long time, and future generations will be able to receive it.",
        "source": "T25n1509_002:0067b25_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_002:0067b26_5"
    },
    {
        "source_sentence": "佛世世勤苦慈愍眾生故，學得是法，為人演說；",
        "translation": "Because of the Buddha’s compassionate kindness toward suffering beings, he studied and mastered this teaching from generation to generation and taught it for others.",
        "source": "T25n1509_002:0067b27_6"
    },
    {
        "source_sentence": "我曹亦應承用佛教，宣揚開化。」",
        "translation": "I, Cao, should also use Buddhism to proclaim enlightenment.",
        "source": "T25n1509_002:0067b28_7"
    },
    {
        "source_sentence": "　「佛諸弟子！　　若念於佛，　　當報佛恩，",
        "translation": "“Buddhist disciples, if you are mindful of the Buddha, You should repay the Buddha’s kindness.",
        "source": "T25n1509_002:0067b29_8"
    },
    {
        "source_sentence": "　　莫入涅槃！」",
        "translation": "Don't enter nirvāṇa!",
        "source": "T25n1509_002:0067b29_8"
    },
    {
        "source_sentence": "是時，大迦葉作是語竟，住須彌山頂，撾銅揵稚，說此偈言：是揵稚音、大迦葉語聲，遍至三千大千世界，皆悉聞知；",
        "translation": "At that time Mahākāśyapa, having made these utterances, remained at the summit of the polar mountain and lay to rest in a copper cauldron. He spoke these verses: The sound of this cauldron and the sounds of Mahākāśyapa’s words pervade as many worlds as there are atoms in the manifold cosmos; they can all be heard.",
        "source": "T25n1509_002:0067b29_8"
    },
    {
        "source_sentence": "諸有弟子得神力者，皆來集會大迦葉所。",
        "translation": "All the disciples who had attained supernatural powers assembled at Mahākāśyapa’s place.",
        "source": "T25n1509_002:0067c05_9"
    },
    {
        "source_sentence": "爾時，大迦葉告諸會者：「佛法欲滅，佛從三阿僧祇劫種種勤苦，慈愍眾生，學得是法。",
        "translation": "At the time, Mahākāśyapa told the assembly members, When the Buddha's teaching was about to cease, the Buddha had cultivated this teaching for three incalculably long eons of various kinds of hardship and compassion toward sentient beings who studied it.",
        "source": "T25n1509_002:0067c06_10"
    },
    {
        "source_sentence": "佛般涅槃已，諸弟子知法、持法、誦法者，皆亦隨佛滅度；",
        "translation": "“Once the Buddha entered final nirvana, all the disciples who knew the teaching, upheld the teaching, and recited the teaching also followed the Buddha’s path of liberation.",
        "source": "T25n1509_002:0067c08_11"
    },
    {
        "source_sentence": "法今欲滅，未來眾生甚可憐愍，失智慧眼，愚癡盲冥；",
        "translation": "Now that the Dharma is about to be destroyed, future sentient beings will have great compassion for them. They will lose the eye of wisdom and become ignorant and blind in ignorance.",
        "source": "T25n1509_002:0067c09_12"
    },
    {
        "source_sentence": "佛大慈悲愍傷眾生，我曹應當承用佛教，須待結集經藏竟，隨意滅度。」",
        "translation": "The Buddha's great compassionate compassionate pity for sentient beings should allow us to use Buddhism, so we must wait until the completion of the collection of sūtras and stores before we can be liberated as we wish.",
        "source": "T25n1509_002:0067c10_13"
    },
    {
        "source_sentence": "諸來眾會，皆受教住。",
        "translation": "All the people who came to the assembly were all taught and stayed there.",
        "source": "T25n1509_002:0067c12_14"
    },
    {
        "source_sentence": "爾時，大迦葉選得千人，除善阿難，盡皆阿羅漢，得六神通，得共解脫，無礙解脫；",
        "translation": "At that time Mahākāśyapa had chosen a thousand people, all of whom were arhats with the exception of Sunetra. Having attained the six supernatural powers, Sudhana entered parinirmita-vaśavartin and attained unobstructed liberation.",
        "source": "T25n1509_002:0067c12_15"
    },
    {
        "source_sentence": "悉得三明，禪定自在，能逆順行諸三昧，皆悉無礙。",
        "translation": "They all attain the three kinds of insight, meditate freely, and are able to reverse and follow the various samādhis without obstruction.",
        "source": "T25n1509_002:0067c14_16"
    },
    {
        "source_sentence": "誦讀三藏，知內外經書，諸外道家十八種大經，盡亦讀知，皆能論議，降伏異學。",
        "translation": "He recites and reads the Tripitaka Master’s collection of scriptures, knowing both Buddhist and heretical texts. All the eighteen kinds of great scriptures of the non-Buddhist schools are also known by him. They can discuss and debate all these theories and subdue heretics.",
        "source": "T25n1509_002:0067c15_17"
    },
    {
        "source_sentence": "問曰：是時，有如是等無數阿羅漢，何以故正選取千人，不多取耶？",
        "translation": "Q: At the time, there were countless arhats like this, so why did they correctly select a thousand people and not many of them?",
        "source": "T25n1509_002:0067c17_18"
    },
    {
        "source_sentence": "答曰：頻婆娑羅王得道，八萬四千官屬亦各得道。",
        "translation": "Answer: King Bimbisāra attained enlightenment, and 84,000 officials also attained enlightenment.",
        "source": "T25n1509_002:0067c19_19"
    },
    {
        "source_sentence": "是時，王教勅宮中，常設飯食，供養千人；",
        "translation": "The king then instructed the palace to provide food and drink for a thousand people at all times.",
        "source": "T25n1509_002:0067c20_20"
    },
    {
        "source_sentence": "阿闍貰王不斷是法。",
        "translation": "The king Ajātaśatru doesn't stop this teaching.",
        "source": "T25n1509_002:0067c21_21"
    },
    {
        "source_sentence": "爾時，大迦葉思惟言：「若我等常乞食者，當有外道強來難問，廢闕法事；",
        "translation": "It was then that Mahākāśyapa thought to himself: If we always begged food, there would be heretics who came forth with difficult questions and neglected the affairs of the Dharma.",
        "source": "T25n1509_002:0067c21_22"
    },
    {
        "source_sentence": "今王舍城常設飯食供給千人，是中可住結集經藏。」",
        "translation": "Now, the city of Rājagṛha always provides food for a thousand people, and here they can live to collect sūtras and stores.",
        "source": "T25n1509_002:0067c23_23"
    },
    {
        "source_sentence": "以是故，選取千人，不得多取。",
        "translation": "Because of this, he selected a thousand people and didn't take many.",
        "source": "T25n1509_002:0067c24_24"
    },
    {
        "source_sentence": "是時，大迦葉與千人俱，到王舍城耆闍崛山中，告語阿闍世王：「給我等食，日日送來，今我曹等結集經藏，不得他行。」",
        "translation": "At the time, Mahākāśyapa and a thousand people went to Rājagṛha in the city of Rājagṛha on Mount Gṛdhrakūṭa and told King Ajātaśatru, Give me food and so forth, send it day after day, and now we'll compile the sūtras and stores together, so I won't be allowed to do anything else.",
        "source": "T25n1509_002:0067c25_25"
    },
    {
        "source_sentence": "是中夏安居三月，初十五日說戒時，集和合僧。",
        "translation": "It was the third month of the summer retreat, and when the precepts were taught on the first fifteenth day, the saṃgha gathered to harmonize.",
        "source": "T25n1509_002:0068a03_26"
    },
    {
        "source_sentence": "大迦葉入禪定，以天眼觀，今是眾中，誰有煩惱未盡應逐出者！",
        "translation": "Mahākāśyapa entered meditation and observed with the divine eye, but now who among the assembled people in the assembly has any afflictions that haven't ended or should be expelled?",
        "source": "T25n1509_002:0068a04_27"
    },
    {
        "source_sentence": "唯有阿難一人不盡，餘九百九十九人諸漏已盡，清淨無垢。",
        "translation": "Only Ānanda did not completely extinguish the defilements. The remaining nine hundred and ninety-nine bhikṣus were pure and spotless, having completely extinguished all their defilements.",
        "source": "T25n1509_002:0068a05_28"
    },
    {
        "source_sentence": "大迦葉從禪定起，眾中手牽阿難出，言：「今清淨眾中結集經藏。",
        "translation": "When Mahākāśyapa rose from meditation, he led Ānanda out of the assembly with his hand and said, Now, among the pure assembly, I've compiled the sūtra collection.",
        "source": "T25n1509_002:0068a07_29"
    },
    {
        "source_sentence": "汝結未盡，不應住此！」",
        "translation": "You haven't ended your bonds, so you shouldn't stay here!",
        "source": "T25n1509_002:0068a08_30"
    },
    {
        "source_sentence": "是時，阿難慚恥悲泣，而自念言：「我二十五年隨侍世尊，供給左右，未曾得如是苦惱；",
        "translation": "At that time, ashamed of himself and weeping in pity, Ānanda thought to himself: For twenty-five years I have been attending the World-honored One, serving his aides.",
        "source": "T25n1509_002:0068a09_31"
    },
    {
        "source_sentence": "佛實大德，慈悲含忍。」",
        "translation": "The Buddha's true great virtue is that compassion contains forbearance.",
        "source": "T25n1509_002:0068a11_32"
    },
    {
        "source_sentence": "念已，白大迦葉言：「我能有力，久可得道；",
        "translation": "Having thought of this, he said to Mahākāśyapa: I am strong enough to attain enlightenment for a long time.",
        "source": "T25n1509_002:0068a11_33"
    },
    {
        "source_sentence": "但諸佛法，阿羅漢者不得供給左右使令；",
        "translation": "But according to the teachings of buddhas, arhats are not allowed to make offerings or envoys to their aides.",
        "source": "T25n1509_002:0068a12_34"
    },
    {
        "source_sentence": "以是故，我留殘結不盡斷耳。」",
        "translation": "Because of this, I won't end the residual bonds that I leave behind.",
        "source": "T25n1509_002:0068a13_35"
    },
    {
        "source_sentence": "大迦葉言：「汝更有罪！",
        "translation": "Mahākāśyapa said, You're still guilty!",
        "source": "T25n1509_002:0068a14_36"
    },
    {
        "source_sentence": "佛意不欲聽女人出家，汝慇懃勸請，佛聽為道；",
        "translation": "The Buddha does not wish to allow women to renounce the householder’s life.",
        "source": "T25n1509_002:0068a14_37"
    },
    {
        "source_sentence": "以是故，佛之正法五百歲而衰微，是汝突吉羅罪！」",
        "translation": "Because of this, the Buddha's right teaching will decline for five hundred years, which is your grave sin!",
        "source": "T25n1509_002:0068a16_38"
    },
    {
        "source_sentence": "阿難言：「我憐愍瞿曇彌，又三世諸佛法皆有四部眾，我釋迦文佛云何獨無？」",
        "translation": "Ānanda said, I'm sorry, Gautama, but there are four groups of people in the teachings of the buddhas of the three times, so why wouldn't I, Śākyamuni Buddha, be alone?",
        "source": "T25n1509_002:0068a17_39"
    },
    {
        "source_sentence": "大迦葉復言：「佛欲涅槃時，近俱夷那竭城，脊痛，四疊漚多羅僧敷臥，語汝言：『我須水。』",
        "translation": "Again, Mahākāśyapa said, When the Buddha was about to enter nirvāṇa, he approached the city of Kuśinagara and had back pain, covered his bed with four layers of sandalwood cloth, and said to you, 'I need water.'",
        "source": "T25n1509_002:0068a19_40"
    },
    {
        "source_sentence": "汝不供給，是汝突吉羅罪！」",
        "translation": "If you don't make offerings, it's a grave offense for you!",
        "source": "T25n1509_002:0068a21_41"
    },
    {
        "source_sentence": "阿難答言：「是時，五百乘車，截流而渡，令水渾濁，以是故不取。」",
        "translation": "Ānanda answered, At that time, five hundred chariots crossed the river with their streams cut off and caused the water to become muddy; therefore, they didn't take it.",
        "source": "T25n1509_002:0068a21_42"
    },
    {
        "source_sentence": "大迦葉復言：「正使水濁，佛有大神力，能令大海濁水清淨。",
        "translation": "Again, Mahākāśyapa said, It's precisely because the water turbidity causes the Buddha to have great supernormal powers that make the turbid water of the great ocean pure.",
        "source": "T25n1509_002:0068a23_43"
    },
    {
        "source_sentence": "汝何以不與？",
        "translation": "Why don't you give it to him?",
        "source": "T25n1509_002:0068a24_44"
    },
    {
        "source_sentence": "是汝之罪，汝去作突吉羅懺悔！」",
        "translation": "This is your sin, so go and repent of it!",
        "source": "T25n1509_002:0068a25_0"
    },
    {
        "source_sentence": "大迦葉復言：「佛問汝：『若有人四神足好修，可住壽一劫，若減一劫；",
        "translation": "Again Mahākāśyapa said: The Buddha asked you, “If a bhikṣu well cultivates the four kinds of supernormal powers, he can live for one world age and lose them by one world age.",
        "source": "T25n1509_002:0068a25_1"
    },
    {
        "source_sentence": "佛四神足好修，欲住壽一劫，若減一劫。』",
        "translation": "The Buddha's four miraculous abilities are well cultivated, and he wants to live for an eon or less if he wants to live for an eon.'",
        "source": "T25n1509_002:0068a27_2"
    },
    {
        "source_sentence": "汝默然不答。",
        "translation": "You remained silent and didn't answer.",
        "source": "T25n1509_002:0068a28_3"
    },
    {
        "source_sentence": "問汝至三，汝故默然。",
        "translation": "I'll ask you up to three, and you'll be silent for that reason.",
        "source": "T25n1509_002:0068a28_4"
    },
    {
        "source_sentence": "汝若答佛：『佛四神足好修，應住一劫，若減一劫。』",
        "translation": "If you answer the Buddha, 'The Buddha's four miraculous powers are well cultivated, they should abide for one eon or less.'",
        "source": "T25n1509_002:0068a29_5"
    },
    {
        "source_sentence": "由汝故，令佛世尊早入涅槃，是汝突吉羅罪！」",
        "translation": "It's because of you that the Bhagavān caused the Buddha to enter nirvāṇa early, which is your grave sin!",
        "source": "T25n1509_002:0068b01_6"
    },
    {
        "source_sentence": "阿難言：「魔蔽我心，是故無言；",
        "translation": "Ānanda said: Because the devil has overwhelmed my mind, there is nothing further to say.",
        "source": "T25n1509_002:0068b02_7"
    },
    {
        "source_sentence": "我非惡心而不答佛。」",
        "translation": "I'm not bad-minded and don't answer the Buddha.",
        "source": "T25n1509_002:0068b02_8"
    },
    {
        "source_sentence": "大迦葉復言：「汝與佛疊僧伽梨衣，以足蹈上，是汝突吉羅罪。」",
        "translation": "Again, Mahākāśyapa said, You gave the Buddha a pile of monk's robe and footstool to walk on it, which is your grave offense.",
        "source": "T25n1509_002:0068b03_9"
    },
    {
        "source_sentence": "阿難言：「爾時，有大風起，無人助我捉衣，時風吹來墮我腳下，非不恭敬，故蹈佛衣。」",
        "translation": "Ānanda said, At the time, a great wind rose and there was no one to help me grab my robes; it then blew down at my feet with its blowing wind, not because I didn't disrespectfully tread on the Buddha's robe.",
        "source": "T25n1509_002:0068b04_10"
    },
    {
        "source_sentence": "大迦葉復言：「佛陰藏相，般涅槃後以示女人，是何可恥？",
        "translation": "Again, Mahākāśyapa said, What shame is there in showing a woman after the Buddha's existence as a store of characteristics and after his parinirvāṇa?",
        "source": "T25n1509_002:0068b06_11"
    },
    {
        "source_sentence": "是汝突吉羅罪！」",
        "translation": "This is your grave sin!",
        "source": "T25n1509_002:0068b08_12"
    },
    {
        "source_sentence": "阿難言：「爾時，我思惟：『若諸女人見佛陰藏相者，便自羞恥女人形，欲得男子身，修行佛相，種福德根。』",
        "translation": "Ānanda said, At the time, I thought, 'If women see the hidden characteristics of the Buddha's aggregates, then they will shame themselves for their female form and want to attain a man's body, cultivate the Buddha's characteristics, and plant the root of merit.'",
        "source": "T25n1509_002:0068b08_13"
    },
    {
        "source_sentence": "以是故，我示女人，不為無恥而故破戒。」",
        "translation": "Because of this, I show the woman that I won't break the precepts for the sake of shamelessness.",
        "source": "T25n1509_002:0068b11_0"
    },
    {
        "source_sentence": "大迦葉言：「汝有六種突吉羅罪，盡應僧中悔過！」",
        "translation": "Mahākāśyapa said, You have six kinds of grave sins that you should repent of in the saṃgha!",
        "source": "T25n1509_002:0068b12_0"
    },
    {
        "source_sentence": "阿難言：「諾！",
        "translation": "Ānanda said, Yes!",
        "source": "T25n1509_002:0068b13_1"
    },
    {
        "source_sentence": "隨長老大迦葉及僧所教！」",
        "translation": "Follow what the elder Mahākāśyapa and the saṃgha teach!",
        "source": "T25n1509_002:0068b13_2"
    },
    {
        "source_sentence": "是時，阿難長跪合手，偏袒右肩，脫革屣，六種突吉羅罪懺悔。",
        "translation": "At the time, Ānanda knelt down with his palms joined together, bared his right shoulder, removed his leather sandals, and repented of six kinds of grave sins.",
        "source": "T25n1509_002:0068b14_0"
    },
    {
        "source_sentence": "大迦葉於僧中，手牽阿難出，語阿難言：「斷汝漏盡，然後來入；",
        "translation": "Among the monks, Mahākāśyapa led Ānanda out of the assembly with his palms joined together and said to Ānanda:",
        "source": "T25n1509_002:0068b15_1"
    },
    {
        "source_sentence": "殘結未盡，汝勿來也！」",
        "translation": "Don't come, since the residual bonds haven't ended!",
        "source": "T25n1509_002:0068b16_2"
    },
    {
        "source_sentence": "如是語竟，便自閉門。",
        "translation": "After he finished saying this, he closed the door on his own.",
        "source": "T25n1509_002:0068b17_3"
    },
    {
        "source_sentence": "爾時，諸阿羅漢議言：「誰能結集毘尼法藏者？」",
        "translation": "It was then that the arhats discussed, Who can compile the Vinaya?",
        "source": "T25n1509_002:0068b17_4"
    },
    {
        "source_sentence": "長老阿泥盧豆言：「舍利弗是第二佛，有好弟子，字憍梵波提(秦言牛呞)，柔軟和雅，常處閑居，住心寂燕，能知毘尼法藏；",
        "translation": "The elder Aniruddha said, “Śāriputra is the second buddha. He has a good disciple named Gavāṃpati (known as Upanpatti in Chinese), who is gentle and graceful; he always lives in seclusion but keeps his mind absorbed in quiescence so as to be able to understand the meaning of the Vinaya.",
        "source": "T25n1509_002:0068b19_0"
    },
    {
        "source_sentence": "今在天上尸利沙樹園中住，遣使請來。」",
        "translation": "Now, I'm staying in the cemetery of Śāriputra in heaven, sending an envoy to invite you here.",
        "source": "T25n1509_002:0068b21_1"
    },
    {
        "source_sentence": "大迦葉語下坐比丘：「汝次應僧使。」",
        "translation": "Mahākāśyapa said to the monk below, Next, you should send it to the saṃgha.",
        "source": "T25n1509_002:0068b22_2"
    },
    {
        "source_sentence": "下坐比丘言：「僧有何使？」",
        "translation": "The monk who sat down said, What's the messenger for the saṃgha?",
        "source": "T25n1509_002:0068b23_3"
    },
    {
        "source_sentence": "大迦葉言：「僧使汝至天上尸利沙樹園中，憍梵波提阿羅漢住處。」",
        "translation": "Mahākāśyapa said, The saṃgha asked you to go up to the heavenly Śāriputra's tree park in the forested abode of the arhat Upan Brahmapāṭi.",
        "source": "T25n1509_002:0068b24_4"
    },
    {
        "source_sentence": "是比丘歡喜踊躍受僧勅命，白大迦葉言：「我到憍梵波提阿羅漢所，陳說何事？」",
        "translation": "The monk rejoiced and jumped for joy, accepted the saṃgha's command, and said to Mahākāśyapa, What will I tell you when I go to the arhat Brahmāpāti?",
        "source": "T25n1509_002:0068b25_5"
    },
    {
        "source_sentence": "大迦葉言：「到已，語憍梵鉢提：大迦葉等漏盡阿羅漢，皆會閻浮提。",
        "translation": "Mahākāśyapa said, When he arrived, he told Upan Brahmapati, Mahākāśyapa and other arhats who had ended the contaminants all assembled in Jambudvīpa.",
        "source": "T25n1509_002:0068b27_6"
    },
    {
        "source_sentence": "僧有大法事，汝可疾來！」",
        "translation": "The saṃgha has a great dharma-work, so you may come quickly!",
        "source": "T25n1509_002:0068b29_7"
    },
    {
        "source_sentence": "是下坐比丘頭面禮僧，右繞三匝；",
        "translation": "The next seated bhikṣu bowed his head and face to the Buddha and circumambulated the community of monks three times.",
        "source": "T25n1509_002:0068b29_8"
    },
    {
        "source_sentence": "如金翅鳥，飛騰虛空，往到憍梵波提所，頭面作禮，語憍梵波提言：「軟善大德！",
        "translation": "It's like a golden-winged bird that flies up into the sky and goes to Gavāṃpati, pays homage with its head and face, and says to Gavāṃpati, That's gentle and good!",
        "source": "T25n1509_002:0068c01_9"
    },
    {
        "source_sentence": "少欲知足，常在禪定！",
        "translation": "Being satisfied with few desires, he's always in meditation!",
        "source": "T25n1509_002:0068c03_10"
    },
    {
        "source_sentence": "大迦葉問訊有語：今僧有大法事，可疾下來，觀眾寶聚。」",
        "translation": "Mahākāśyapa greeted someone who said, Now that the saṃgha has a great dharma-work to do, you can quickly come down and see the treasure trove.",
        "source": "T25n1509_002:0068c03_11"
    },
    {
        "source_sentence": "是時，憍梵波提心覺生疑，語是比丘言：「僧將無鬪諍事喚我來耶？",
        "translation": "At that point, Gavāṃpati had doubts in his mind and said to the monk, Wouldn't the saṃgha call me here for a fight?",
        "source": "T25n1509_002:0068c05_12"
    },
    {
        "source_sentence": "無有破僧者不？",
        "translation": "Is there anyone who breaks the saṃgha?",
        "source": "T25n1509_002:0068c07_0"
    },
    {
        "source_sentence": "佛日滅度耶？」",
        "translation": "Is the Buddha's day of extinction?",
        "source": "T25n1509_002:0068c07_1"
    },
    {
        "source_sentence": "是比丘言：「實如所言，大師佛已滅度。」",
        "translation": "The monk said, As I say, the great teacher and buddha have ceased.",
        "source": "T25n1509_002:0068c07_2"
    },
    {
        "source_sentence": "憍梵波提言：「佛滅度大疾，世間眼滅！",
        "translation": "Gavāṃpati said, The Buddha's extinction is a great swiftness, and the worldly eye ceases!",
        "source": "T25n1509_002:0068c08_3"
    },
    {
        "source_sentence": "能逐佛轉法輪將，我和上舍利弗今在何所？」",
        "translation": "If you can follow the Buddha and turn the wheel of the Dharma, where are we Śāriputra and myself now?",
        "source": "T25n1509_002:0068c09_4"
    },
    {
        "source_sentence": "答曰：「先入涅槃。」",
        "translation": "He answered, First enter nirvāṇa.",
        "source": "T25n1509_002:0068c10_5"
    },
    {
        "source_sentence": "憍梵波提言：「大師法將，各自別離，當可奈何！",
        "translation": "Gavāṃpati said, The great general of the Dharma, you'll be separated from each other, so what can you do?",
        "source": "T25n1509_002:0068c10_6"
    },
    {
        "source_sentence": "摩訶目伽連今在何所？」",
        "translation": "Where is Mahāmaudgalyāyana now?",
        "source": "T25n1509_002:0068c12_0"
    },
    {
        "source_sentence": "是比丘言：「是亦滅度。」",
        "translation": "The monk said, This is also cessation.",
        "source": "T25n1509_002:0068c12_1"
    },
    {
        "source_sentence": "憍梵波提言：「佛法欲散，大人過去，眾生可愍。」",
        "translation": "Gavāṃpati said, The Buddha's teaching is about to disperse, and the great man has passed away; sentient beings can see it.",
        "source": "T25n1509_002:0068c13_0"
    },
    {
        "source_sentence": "問：「長老阿難今何所作？」",
        "translation": "He asked, What's the elder Ānanda doing now?",
        "source": "T25n1509_002:0068c14_1"
    },
    {
        "source_sentence": "是比丘言：「長老阿難，佛滅度後，憂愁、啼哭、迷悶，不能自喻。」",
        "translation": "The monk said, Elder Ānanda, after the Buddha's passing away, he was so grieved, weeping, and confused that he couldn't describe it himself.",
        "source": "T25n1509_002:0068c14_2"
    },
    {
        "source_sentence": "憍梵波提言：「阿難懊惱，由有愛結，別離生苦。",
        "translation": "Gavāṃpati said, Ānanda's remorsefulness is due to the bond of craving that separates him from the suffering that arises from separation.",
        "source": "T25n1509_002:0068c16_3"
    },
    {
        "source_sentence": "羅睺羅復云何？」",
        "translation": "What's the case with Rāhula?",
        "source": "T25n1509_002:0068c17_4"
    },
    {
        "source_sentence": "答言：「羅睺羅得阿羅漢故，無憂無愁，但觀諸法無常相。」",
        "translation": "He replied, Because Rāhula attained arhatship, he has no sorrow and no grief but only observes the impermanent characteristics of dharmas.",
        "source": "T25n1509_002:0068c17_5"
    },
    {
        "source_sentence": "憍梵波提言：「難斷愛已斷，無憂愁。」",
        "translation": "Gavāṃpati said, It's difficult to stop craving and have stopped it, so there's no sorrow.",
        "source": "T25n1509_002:0068c18_6"
    },
    {
        "source_sentence": "憍梵波提言：「我失離欲大師，於是尸利沙樹園中住，亦何所為？",
        "translation": "Gavāṃpati said, I've lost the great teacher who's free of desire, so what would I do if I were to live in a tree parked place like Śāriputra?",
        "source": "T25n1509_002:0068c19_7"
    },
    {
        "source_sentence": "我和上、大師皆已滅度，我今不能復下閻浮提，住此般涅槃。」",
        "translation": "My superiors and the great masters have all been liberated, but now I can't go down into Jambudvīpa or stay here to parinirvāṇa.",
        "source": "T25n1509_002:0068c21_8"
    },
    {
        "source_sentence": "說是言已，入禪定中，踊在虛空，身放光明；",
        "translation": "Having said these words, he entered into meditative absorption and flew up into the sky. His body emitted light.",
        "source": "T25n1509_002:0068c22_9"
    },
    {
        "source_sentence": "又出水火，手摩日月，現種種神變，自心出火燒身，身中出水，四道流下，至大迦葉所。",
        "translation": "Again water and fire emerged, touching the sun and moon with their hands. They manifested various miraculous signs, producing fire from their own mind that burned their bodies. Water came out of their bodies, flowing in all four directions to where Mahākāśyapa was.",
        "source": "T25n1509_002:0069a01_10"
    },
    {
        "source_sentence": "　「憍梵鉢提稽首禮，　　妙眾第一大德僧，",
        "translation": "Gavāṃpati bowed his head in homage to the supremely virtuous monks of the assembly.",
        "source": "T25n1509_002:0069a03_11"
    },
    {
        "source_sentence": "　　聞佛滅度我隨去，　　如大象去象子隨！」",
        "translation": "Hearing that the Buddha is extinguished, I'll follow him, just like a great elephant going and following an elephant!",
        "source": "T25n1509_002:0069a03_11"
    },
    {
        "source_sentence": "水中有聲，說此偈言：爾時，下坐比丘持衣鉢還僧。",
        "translation": "A voice was heard in the water, saying this verse, At that point, the monk downstairs returned to the saṃgha with his robe and bowl.",
        "source": "T25n1509_002:0069a03_11"
    },
    {
        "source_sentence": "是時中間，阿難思惟諸法，求盡殘漏；",
        "translation": "At that time, in between, Ānanda contemplated the teachings and sought to extinguish the taint of defilement.",
        "source": "T25n1509_002:0069a07_12"
    },
    {
        "source_sentence": "其夜坐禪經行，慇懃求道。",
        "translation": "That night he sat in meditation, walked up and down, and earnestly sought the path.",
        "source": "T25n1509_002:0069a08_13"
    },
    {
        "source_sentence": "是阿難智慧多，定力少，是故不即得道；",
        "translation": "Because Ānanda’s wisdom was great and his power of meditative absorption weak, he did not immediately attain enlightenment.",
        "source": "T25n1509_002:0069a09_14"
    },
    {
        "source_sentence": "定智等者，乃可速得。",
        "translation": "Such [things] as concentration and wisdom can be acquired quickly.",
        "source": "T25n1509_002:0069a10_15"
    },
    {
        "source_sentence": "後夜欲過，疲極偃息，却臥就枕，頭未至枕，廓然得悟；",
        "translation": "When the night came to an end, he was exhausted and unable to sleep. He withdrew to lie down on a pillow but his head did not reach the other side of the pillow.",
        "source": "T25n1509_002:0069a10_16"
    },
    {
        "source_sentence": "如電光出，闇者見道。",
        "translation": "It's like when a flash of lightning emerges, and the dark one sees the path.",
        "source": "T25n1509_002:0069a11_17"
    },
    {
        "source_sentence": "阿難如是入金剛定，破一切諸煩惱山；",
        "translation": "Ānanda thus entered the diamond-like concentration and destroyed all the mountains of defilement.",
        "source": "T25n1509_002:0069a12_18"
    },
    {
        "source_sentence": "得三明、六神通、共解脫，作大力阿羅漢。",
        "translation": "Attaining the three insights, six supernormal powers, and shared liberation, he becomes a great arhat.",
        "source": "T25n1509_002:0069a13_19"
    },
    {
        "source_sentence": "即夜到僧堂門，敲門而喚。",
        "translation": "That night, he went to the entrance of the saṃgha hall, knocked on the door, and called out.",
        "source": "T25n1509_002:0069a14_20"
    },
    {
        "source_sentence": "大迦葉問言：「敲門者誰？」",
        "translation": "Mahākāśyapa asked, Who is the one who knocks at the door?",
        "source": "T25n1509_002:0069a14_21"
    },
    {
        "source_sentence": "答言：「我是阿難。」",
        "translation": "He replied, This is Ānanda.",
        "source": "T25n1509_002:0069a15_22"
    },
    {
        "source_sentence": "大迦葉言：「汝何以來？」",
        "translation": "Mahākāśyapa said, Where did you come from?",
        "source": "T25n1509_002:0069a15_23"
    },
    {
        "source_sentence": "阿難言：「我今夜得盡諸漏。」",
        "translation": "Ānanda said, Tonight, I'll end the contaminants.",
        "source": "T25n1509_002:0069a16_24"
    },
    {
        "source_sentence": "大迦葉言：「不與汝開門，汝從門鑰孔中來！」",
        "translation": "Mahākāśyapa said, Don't open the door with you; come from the keyhole of the door!",
        "source": "T25n1509_002:0069a16_25"
    },
    {
        "source_sentence": "阿難答言：「可爾！」",
        "translation": "Ānanda replied, Yes!",
        "source": "T25n1509_002:0069a18_0"
    },
    {
        "source_sentence": "即以神力從門鑰孔中入，禮拜僧足懺悔：「大迦葉！",
        "translation": "He then entered through the keyhole of the door with his supernormal powers, bowed at the feet of the saṃgha, and repented, Mahākāśyapa!",
        "source": "T25n1509_002:0069a18_1"
    },
    {
        "source_sentence": "莫復見責！」",
        "translation": "Don't blame me again!",
        "source": "T25n1509_002:0069a19_2"
    },
    {
        "source_sentence": "大迦葉手摩阿難頭言：「我故為汝，使汝得道；",
        "translation": "Mahākāśyapa touched Ānanda’s hair on his forehead with his hand and said: For this reason I am here for your sake, to enable you to attain the path.",
        "source": "T25n1509_002:0069a19_3"
    },
    {
        "source_sentence": "汝無嫌恨，我亦如是，以汝自證。",
        "translation": "You have no animosity, and so am I. Because of your testimony I am like this.",
        "source": "T25n1509_002:0069a20_4"
    },
    {
        "source_sentence": "譬如手畫虛空，無所染著；",
        "translation": "It is as if one were to paint a picture of space with one’s hand without being attached to anything.",
        "source": "T25n1509_002:0069a21_5"
    },
    {
        "source_sentence": "阿羅漢心亦如是，一切法中得無所著。",
        "translation": "The mind of an arhat is likewise, attaining nothing attached in all dharmas.",
        "source": "T25n1509_002:0069a22_6"
    },
    {
        "source_sentence": "復汝本坐。」",
        "translation": "Again, you're sitting in your original place.",
        "source": "T25n1509_002:0069a23_7"
    },
    {
        "source_sentence": "是時，僧復議言：「憍梵波提已取滅度，更有誰能結集法藏？」",
        "translation": "The saṃgha then again discussed it, saying, Who else could compile the Dharma store after Gavāṃpati had entered nirvāṇa?",
        "source": "T25n1509_002:0069a23_8"
    },
    {
        "source_sentence": "長老阿泥盧豆言：「是長老阿難，於佛弟子，常侍近佛，聞經能持，佛常歎譽；",
        "translation": "The elder Aniruddha said, “The venerable Ānanda was always attending the Buddha’s disciples. Hearing that he could preserve the scripture, the Buddha often praised him.",
        "source": "T25n1509_002:0069a24_9"
    },
    {
        "source_sentence": "是阿難能結集經藏。」",
        "translation": "This is the store where Ānanda can compile the collection of sūtras.",
        "source": "T25n1509_002:0069a26_10"
    },
    {
        "source_sentence": "是時，長老大迦葉摩阿難頭言：「佛囑累汝，令持法藏，汝應報佛恩！",
        "translation": "The elder Kāśyapa Mahākāśyapa Ānanda then said, The Buddha instructed you to maintain the store of the Dharma, and you should repay the Buddha's kindness!",
        "source": "T25n1509_002:0069a27_11"
    },
    {
        "source_sentence": "佛在何處最初說法？",
        "translation": "Where did the Buddha first teach the Dharma?",
        "source": "T25n1509_002:0069a28_12"
    },
    {
        "source_sentence": "佛諸大弟子能守護法藏者，皆以滅度，唯汝一人在。",
        "translation": "All the great disciples of the Buddha who can protect the treasure house of the Dharma will all be liberated through cessation, but you alone are here.",
        "source": "T25n1509_002:0069a29_13"
    },
    {
        "source_sentence": "汝今應隨佛心，憐愍眾生故，集佛法藏。」",
        "translation": "Now, you should follow the Buddha's mind and collect the Buddha's Dharma treasure because you have compassion for sentient beings.",
        "source": "T25n1509_002:0069b01_14"
    },
    {
        "source_sentence": "是時，阿難禮僧已，坐師子床。",
        "translation": "After paying homage to the saṃgha, Ānanda sat on the lion's seat.",
        "source": "T25n1509_002:0069b02_15"
    },
    {
        "source_sentence": "　「佛聖師子王，　　阿難是佛子，",
        "translation": "Ānanda, the lion king of buddhas, King of the holy lion, Is the offspring of the Buddha.",
        "source": "T25n1509_002:0069b03_16"
    },
    {
        "source_sentence": "　　師子座處坐，　　觀眾無有佛。",
        "translation": "Sitting on the lion seat, There is no buddha in the audience.",
        "source": "T25n1509_002:0069b03_16"
    },
    {
        "source_sentence": "　　如是大德眾，　　無佛失威神，",
        "translation": "Thus, the great virtuous multitude has no Buddha who loses his authoritative power.",
        "source": "T25n1509_002:0069b03_16"
    },
    {
        "source_sentence": "　　如空無月時，　　有宿而不嚴。",
        "translation": "It's like when space has no moon and there are constellations that aren't adorned.",
        "source": "T25n1509_002:0069b03_16"
    },
    {
        "source_sentence": "　　汝大智人說，　　汝佛子當演，",
        "translation": "You great wise man, you will teach it. Your offspring of the Buddha Will teach it.",
        "source": "T25n1509_002:0069b03_16"
    },
    {
        "source_sentence": "　　何處佛初說，　　今汝當布現！」",
        "translation": "Where did the Buddha first teach it, and now you will spread it out!",
        "source": "T25n1509_002:0069b03_16"
    },
    {
        "source_sentence": "　「佛初說法時，　　爾時我不見，",
        "translation": "When the Buddha first taught the Dharma, I did not see him at that time.",
        "source": "T25n1509_002:0069b03_16"
    },
    {
        "source_sentence": "　　如是展轉聞：　　佛在波羅柰，",
        "translation": "Thus I have heard in succession that the Buddha is at Benares,",
        "source": "T25n1509_002:0069b03_16"
    },
    {
        "source_sentence": "　　佛為五比丘，　　初開甘露門，",
        "translation": "The Buddha, for the sake of these five monks, For the first time opened the ambrosial gate.",
        "source": "T25n1509_002:0069b03_16"
    },
    {
        "source_sentence": "　　說四真諦法：　　苦集滅道諦。",
        "translation": "He teaches the Dharma of four true truths:",
        "source": "T25n1509_002:0069b03_16"
    },
    {
        "source_sentence": "　　阿若憍陳如，　　最初得見道；",
        "translation": "Ājñāta-kauṇḍinya thus At first attained the path of insight.",
        "source": "T25n1509_002:0069b03_16"
    },
    {
        "source_sentence": "　　八萬諸天眾，　　皆亦入道迹！」",
        "translation": "Eighty thousand celestial beings all entered the traces of the Way!",
        "source": "T25n1509_002:0069b03_16"
    },
    {
        "source_sentence": "時大迦葉說此偈言：是時，長老阿難一心合手，向佛涅槃方如是說言：是千阿羅漢聞是語已，上昇虛空高七多羅樹。",
        "translation": "Mahākāśyapa then spoke this verse, saying, At the time, the elder Ānanda was concentrating his hands with one mind and facing toward the Buddha's nirvāṇa, thus saying, After hearing these words, a thousand arhats rose up into the sky seven-thousand palm trees high.",
        "source": "T25n1509_002:0069b03_16"
    },
    {
        "source_sentence": "皆言：「咄！",
        "translation": "They all said, Duh!",
        "source": "T25n1509_002:0069b19_17"
    },
    {
        "source_sentence": "無常力大，如我等眼見佛說法，今乃言我聞！」",
        "translation": "The power of impermanence is great, just as we see the Buddha's teaching with our eyes and now say we've heard it!",
        "source": "T25n1509_002:0069b19_18"
    },
    {
        "source_sentence": "　「我見佛身相，　　猶如紫金山，",
        "translation": "I see the Buddha’s physical form, Like a mountain of purple gold.",
        "source": "T25n1509_002:0069b20_19"
    },
    {
        "source_sentence": "　　妙相眾德滅，　　唯有名獨存。",
        "translation": "The marvelous characteristics and virtues cease, but only names remain alone.",
        "source": "T25n1509_002:0069b20_19"
    },
    {
        "source_sentence": "　　是故當方便，　　求出於三界，",
        "translation": "Therefore, you should skillfully seek to leave the three realms.",
        "source": "T25n1509_002:0069b20_19"
    },
    {
        "source_sentence": "　　勤集諸善根，　　涅槃最為樂！」",
        "translation": "To diligently gather good roots, nirvāṇa is the most blissful!",
        "source": "T25n1509_002:0069b20_19"
    },
    {
        "source_sentence": "　「咄世間無常！　　如水月芭蕉，",
        "translation": "“The world is impermanent, like the water moon and the banana tree.",
        "source": "T25n1509_002:0069b20_19"
    },
    {
        "source_sentence": "　　功德滿三界，　　無常風所壞！」",
        "translation": "The merit fills the three realms, and it's destroyed by the wind of impermanence!",
        "source": "T25n1509_002:0069b20_19"
    },
    {
        "source_sentence": "　「無常力甚大，　　愚智貧富貴，",
        "translation": "“The power of impermanence is great, ignorant and ignorant, poor and wealthy,",
        "source": "T25n1509_002:0069b20_19"
    },
    {
        "source_sentence": "　　得道及未得，　　一切無能免！",
        "translation": "Attaining the path and not attaining it, there's nothing that can be avoided!",
        "source": "T25n1509_002:0069b20_19"
    },
    {
        "source_sentence": "　　非巧言妙寶，　　非欺誑力諍，",
        "translation": "It’s not a wonderful treasure of skillful words, Nor is it deceptive or coarse.",
        "source": "T25n1509_002:0069b20_19"
    },
    {
        "source_sentence": "　　如火燒萬物，　　無常相法爾。」",
        "translation": "It's like a fire that burns all things, which are impermanent and characterized as such.",
        "source": "T25n1509_002:0069b20_19"
    },
    {
        "source_sentence": "便說偈言：爾時，長老阿泥盧豆說偈言：爾時，大迦葉復說此偈：大迦葉語阿難：「從《轉法輪經》至《大般涅槃》，集作四阿含：《增一阿含》、《中阿含》、《長阿含》、《相應阿含》。",
        "translation": "Then the elder Aniruddha spoke these verses: At that time Mahākāśyapa composed the following verse: Mahākāśyapa said to Ānanda: From the Mahaparinirvana Sutra up to the Mahaparinirvana Sutra, four abhidharma sūtras were compiled and compiled into four abhidharma texts: the Incremental Abhidharma, the Middle Abhidharma,",
        "source": "T25n1509_002:0069b20_19"
    },
    {
        "source_sentence": "是名修妬路法藏。」",
        "translation": "This is called the Dharma store of cultivating the path of jealousy.",
        "source": "T25n1509_002:0069c06_20"
    },
    {
        "source_sentence": "諸阿羅漢更問：「誰能明了集毘尼法藏？」",
        "translation": "The arhats then asked, Who can explain the collection of the vinaya?",
        "source": "T25n1509_002:0069c06_21"
    },
    {
        "source_sentence": "皆言：「長老憂婆離，於五百阿羅漢中持律第一，我等今請。」",
        "translation": "They all said, The elder Upāli is the best among the five hundred arhats who uphold the precepts, so we're now inviting him.",
        "source": "T25n1509_002:0069c07_22"
    },
    {
        "source_sentence": "即請言：「起，就師子座處坐！",
        "translation": "He then asked, Arise, sit at the lion's seat!",
        "source": "T25n1509_002:0069c08_23"
    },
    {
        "source_sentence": "說佛在何處初說毘尼結戒？」",
        "translation": "Where did the Buddha teach the first precept of the Vinaya?",
        "source": "T25n1509_002:0069c09_24"
    },
    {
        "source_sentence": "憂婆離受僧教，師子座處坐，說：「如是我聞：一時，佛在毘舍離。",
        "translation": "Upāli, having received the instruction of the assembly, sat cross-legged on his seat and said: Thus have I heard. At one time the Buddha was staying at Vaiśālī.",
        "source": "T25n1509_002:0069c10_25"
    },
    {
        "source_sentence": "爾時，須提那迦蘭陀長者子初作婬欲，以是因緣故，結初大罪。",
        "translation": "At the time, the elder son of Sudhana Kālānda first became sexually attached, and because of these causes and conditions, he was condemned to the first major offense.",
        "source": "T25n1509_002:0069c11_26"
    },
    {
        "source_sentence": "二百五十戒義作三部，七法、八法、比丘尼毘尼、增一、憂婆利問、雜部、善部；",
        "translation": "The doctrine of the two hundred and fifty precepts is divided into three divisions:",
        "source": "T25n1509_002:0069c13_27"
    },
    {
        "source_sentence": "如是等八十部，作毘尼藏。」",
        "translation": "These are the eighty such collections that make up the Vinaya.",
        "source": "T25n1509_002:0069c14_28"
    },
    {
        "source_sentence": "諸阿羅漢復更思惟：「誰能明了集阿毘曇藏？」",
        "translation": "Again, the arhats thought, Who can clearly gather the abhidharma collection?",
        "source": "T25n1509_002:0069c15_29"
    },
    {
        "source_sentence": "念言：「長老阿難，於五百阿羅漢中，解修妬路義第一，我等今請。」",
        "translation": "He thought, Elder Ānanda, among the five hundred arhats, the one who understands the meaning of the path of cultivation is the first, and we're now inviting him.",
        "source": "T25n1509_002:0069c16_30"
    },
    {
        "source_sentence": "即請言：「起，就師子座處坐！",
        "translation": "He then asked, Arise, sit at the lion's seat!",
        "source": "T25n1509_002:0069c18_31"
    },
    {
        "source_sentence": "佛在何處初說阿毘曇？」",
        "translation": "Where did the Buddha first teach the abhidharma?",
        "source": "T25n1509_002:0069c18_32"
    },
    {
        "source_sentence": "阿難受僧教，師子座處坐，說：「如是我聞：一時，佛在舍婆提城。",
        "translation": "Ānanda had received the instruction of the Sangha. He sat cross-legged on his seat and said: Thus have I heard. At one time the Buddha was staying at Sāvatthī.",
        "source": "T25n1509_002:0069c19_33"
    },
    {
        "source_sentence": "爾時，佛告諸比丘：『諸有五怖、五罪、五怨，不除不滅，是因緣故，此生中身、心受無量苦，復後世墮惡道中。",
        "translation": "At the time, the Buddha told the monks, 'There are five fears, five sins, and five grudges that won't be removed or extinguished because of these causes and conditions, which cause their bodies and minds to experience measureless suffering in this life and will fall into a bad destiny in a later life.",
        "source": "T25n1509_002:0069c20_34"
    },
    {
        "source_sentence": "諸有無此五怖、五罪、五怨，是因緣故，於今生種種身、心受樂，後世生天上樂處。",
        "translation": "These five fears, five sins and five grudges are absent in all existences. Because of these causes and conditions, various forms of bodily and mental well-being will arise in the present life; later beings will be reborn in a heavenly blissful realm.",
        "source": "T25n1509_002:0069c23_35"
    },
    {
        "source_sentence": "何等五怖應遠？",
        "translation": "What are the five fears that should be kept far away?",
        "source": "T25n1509_002:0069c25_0"
    },
    {
        "source_sentence": "一者殺，二者盜，三者邪婬，四者妄語，五者飲酒。』」",
        "translation": "One is killing, two are stealing, three are sexual misconduct, four are false speech, and five are drinking alcohol.'",
        "source": "T25n1509_002:0069c25_1"
    },
    {
        "source_sentence": "如是等名阿毘曇藏。",
        "translation": "Such is the name of the abhidharma collection.",
        "source": "T25n1509_002:0069c26_2"
    },
    {
        "source_sentence": "三法藏集竟，諸天、鬼神、諸龍、天女，種種供養，雨天華香、幡蓋、天衣，供養法故。",
        "translation": "After the three treasures of the Dharma have been collected, gods, ghosts, dragons, and goddesses make various offerings, raining heavenly flowers, fragrances, banners, canopies, and celestial robes to honor the Dharma.",
        "source": "T25n1509_002:0069c26_3"
    },
    {
        "source_sentence": "　「憐愍世界故，　　集結三藏法；",
        "translation": "In the world of pity, He compiled the teachings of the Tripiṭaka.",
        "source": "T25n1509_002:0070a02_4"
    },
    {
        "source_sentence": "　　十力一切智，　　說智無明燈！」",
        "translation": "The ten powers of omniscience and all cognition, he explains the lamp of ignorance of wisdom!",
        "source": "T25n1509_002:0070a02_4"
    },
    {
        "source_sentence": "於是說偈：問曰：《八犍度阿毘曇》、六分阿毘曇等，從何處出？",
        "translation": "He then spoke a verse, asking, Where did the Eightfold Commentary on the Mahāprajñāpāramitā and Six Part Abhidharma come from?",
        "source": "T25n1509_002:0070a02_4"
    },
    {
        "source_sentence": "答曰：佛在世時，法無違錯；",
        "translation": "Answer: When the Buddha was in the world, there was no contradiction with the Dharma.",
        "source": "T25n1509_002:0070a07_5"
    },
    {
        "source_sentence": "佛滅度後，初集法時，亦如佛在。",
        "translation": "After the parinirvāṇa of the Buddha, when he first collected the teachings, he was likewise present.",
        "source": "T25n1509_002:0070a07_6"
    },
    {
        "source_sentence": "後百年，阿輸迦王作般闍于瑟大會，諸大法師論議異故，有別部名字。",
        "translation": "One hundred years later, King Aśoka made a great assembly called the Prajñāyuta Assembly. Because the great Masters discussed different doctrines, there was a separate sect that had different names.",
        "source": "T25n1509_002:0070a08_7"
    },
    {
        "source_sentence": "從是以來，展轉至姓迦旃延婆羅門道人，智慧利根，盡讀三藏內外經書，欲解佛語故，作《發智經八犍度》，初品是世間第一法。",
        "translation": "From then on, he gradually reached the family name of Kātyāyana, a brāhmaṇa with sharp faculties and wisdom, who read all the texts of the Tripiṭaka's internal and external scriptures. Because he wanted to understand the Buddha' s words, he composed the Eight Masteries of the Arousal of Wisdom Sutra, the first chapter of which was the highest worldly dharma.",
        "source": "T25n1509_002:0070a10_8"
    },
    {
        "source_sentence": "後諸弟子等，為後人不能盡解《八犍度》故，作《鞞婆娑》。",
        "translation": "The later disciples and so forth, because later generations couldn't fully understand the Eight Chapters of the Mahāprajñāpāramitā, they made Upāsaka.",
        "source": "T25n1509_002:0070a13_9"
    },
    {
        "source_sentence": "有人言：六分阿毘曇中，第三分八品之名〈分別世處分〉(此是《樓炭經》作六分中第三分)，是目犍連作；",
        "translation": "Some people claim that in the six parts of the Abhidharma, the third and eighth parts are called the Part on Discriminating Worldly Places (this is the third part of the six parts composed by the Loutan jing), composed by Maudgalyāyana.",
        "source": "T25n1509_002:0070a14_10"
    },
    {
        "source_sentence": "六分中，初分八品，四品是婆須蜜菩薩作，四品是罽賓阿羅漢作；",
        "translation": "In the six parts, the first part consists of eight chapters. The fourth chapter is composed by Vasumitra Bodhisattva; the fourth chapter is composed by Kāttiya Arhat.",
        "source": "T25n1509_002:0070a16_11"
    },
    {
        "source_sentence": "餘五分諸論議師所作。",
        "translation": "The other five parts are created by the treatise masters.",
        "source": "T25n1509_002:0070a17_12"
    },
    {
        "source_sentence": "有人言：佛在時，舍利弗解佛語故作阿毘曇；",
        "translation": "Some people said: When the Buddha was present, Śāriputra composed the abhidharma because he understood the Buddha’s words.",
        "source": "T25n1509_002:0070a18_13"
    },
    {
        "source_sentence": "後犢子道人等讀誦，乃至今名為《舍利弗阿毘曇》。",
        "translation": "Later, the Vātsīputrīya monks and others recited it, which is now called Śāriputrâbhidharma.",
        "source": "T25n1509_002:0070a19_14"
    },
    {
        "source_sentence": "摩訶迦旃延，佛在時，解佛語作蜫勒(蜫勒秦言篋藏)，乃至今行於南天竺。",
        "translation": "When Mahākātyāyana Buddha was present, he understood the Buddha's words and made them into śarī (known as Śākyamuni in the Sanskrit language), even though he was traveling to southern India now.",
        "source": "T25n1509_002:0070a20_15"
    },
    {
        "source_sentence": "皆是廣解佛語故。",
        "translation": "It's because they all explain the Buddha's words in detail.",
        "source": "T25n1509_002:0070a22_16"
    },
    {
        "source_sentence": "如說五戒：幾有色，幾無色？",
        "translation": "How many are material and how many are immaterial?",
        "source": "T25n1509_002:0070a22_17"
    },
    {
        "source_sentence": "幾可見，幾不可見？",
        "translation": "How many are visible and how many are invisible?",
        "source": "T25n1509_002:0070a23_18"
    },
    {
        "source_sentence": "幾有對，幾無對？",
        "translation": "How many are resisting and how many are not resisting?",
        "source": "T25n1509_002:0070a23_19"
    },
    {
        "source_sentence": "幾有漏，幾無漏？",
        "translation": "How many are pure and how many are impure?",
        "source": "T25n1509_002:0070a24_20"
    },
    {
        "source_sentence": "幾有為，幾無為？",
        "translation": "How many are conditioned and how many are unconditioned?",
        "source": "T25n1509_002:0070a24_21"
    },
    {
        "source_sentence": "幾有報，幾無報？",
        "translation": "How many are with retribution and how many are without retribution?",
        "source": "T25n1509_002:0070a24_22"
    },
    {
        "source_sentence": "幾有善，幾不善？",
        "translation": "How many are good and how many are bad?",
        "source": "T25n1509_002:0070a25_23"
    },
    {
        "source_sentence": "幾有記，幾無記？",
        "translation": "How many are indeterminate and how many are indeterminate?",
        "source": "T25n1509_002:0070a25_24"
    },
    {
        "source_sentence": "如是等，是名阿毘曇。",
        "translation": "Such and such are called the abhidharma.",
        "source": "T25n1509_002:0070a25_25"
    },
    {
        "source_sentence": "復次，七使：欲染使，瞋恚使，有愛使，憍慢使，無明使，見使，疑使。",
        "translation": "“Furthermore, there are seven contaminants: the contaminant sexual passion; the contaminant repugnance; the contaminant attachment to sensual pleasure; the contaminant arrogance; the contaminant ignorance; the contaminant views; and the contaminant perplexity.",
        "source": "T25n1509_002:0070a26_26"
    },
    {
        "source_sentence": "是七使，幾欲界繫，幾色界繫，幾無色界繫？",
        "translation": "How many are bound to the realm of sexual passion, how many are bound to the realm of form and how many are bound to the one of formlessness?",
        "source": "T25n1509_002:0070a27_27"
    },
    {
        "source_sentence": "幾見諦斷，幾思惟斷？",
        "translation": "How many are to be abandoned through vision and how many are to be abandoned through reflection?",
        "source": "T25n1509_002:0070a28_28"
    },
    {
        "source_sentence": "幾見苦斷，幾見集斷，幾見盡斷，幾見道斷？",
        "translation": "How many are to be abandoned through the vision of frustration, how many are to be abandoned through the vision of the origin, how many are to be abandoned through the vision of destruction and how many are to be abandoned through the vision of the path?",
        "source": "T25n1509_002:0070a29_29"
    },
    {
        "source_sentence": "幾遍使，幾不遍使？",
        "translation": "How many are pervasive and how many are not pervasive?",
        "source": "T25n1509_002:0070b01_30"
    },
    {
        "source_sentence": "十智：法智，比智，世智，他心智，苦智，集智，滅智，道智，盡智，無生智。",
        "translation": "Ten knowledges: knowledge of dharmas, inferential knowledge, knowledge of worlds, knowledge of the minds of others, knowledge of suffering, knowledge of accumulation, knowledge of cessation, knowledge of the path, knowledge of extinction, and knowledge of nonarising.",
        "source": "T25n1509_002:0070b01_31"
    },
    {
        "source_sentence": "是十智，幾有漏，幾無漏？",
        "translation": "How many of these knowledges are impure?",
        "source": "T25n1509_002:0070b03_32"
    },
    {
        "source_sentence": "幾有為，幾無為？",
        "translation": "How many are conditioned and how many are unconditioned?",
        "source": "T25n1509_002:0070b03_33"
    },
    {
        "source_sentence": "幾有漏緣，幾無漏緣？",
        "translation": "How many are impure and how many are pure?",
        "source": "T25n1509_002:0070b04_0"
    },
    {
        "source_sentence": "幾有為緣，幾無為緣？",
        "translation": "How many are conditioned and how many are unconditioned?",
        "source": "T25n1509_002:0070b04_1"
    },
    {
        "source_sentence": "幾欲界緣，幾色界緣，幾無色界緣？",
        "translation": "How many are the conditions of the desire realm, how many are the conditions of the form realm, and how many are the conditions of the formless realm?",
        "source": "T25n1509_002:0070b04_2"
    },
    {
        "source_sentence": "幾不繫緣？",
        "translation": "How many are not bound by conditions?",
        "source": "T25n1509_002:0070b05_3"
    },
    {
        "source_sentence": "幾無礙道中修，幾解脫道中修？",
        "translation": "How many are cultivated in the unobstructed path? How many are cultivated in the path of liberation?",
        "source": "T25n1509_002:0070b05_4"
    },
    {
        "source_sentence": "四果得時，幾得、幾失？",
        "translation": "When the four fruits are attained, how many are attained and how many are lost?",
        "source": "T25n1509_002:0070b06_5"
    },
    {
        "source_sentence": "如是等分別一切法，亦名阿毘曇。",
        "translation": "Such a discernment of all dharmas is also called the abhidharma.",
        "source": "T25n1509_002:0070b07_6"
    },
    {
        "source_sentence": "為阿毘曇三種：一者、阿毘曇身及義，略說三十二萬言；",
        "translation": "The first is the body and doctrine of the abhidharma, which consists of thirty-two thousand syllables.",
        "source": "T25n1509_002:0070b07_7"
    },
    {
        "source_sentence": "二者、六分，略說三十六萬言；",
        "translation": "The second is the sixfold doctrine, consisting of thirty-six million syllables.",
        "source": "T25n1509_002:0070b09_8"
    },
    {
        "source_sentence": "三者、蜫勒，略說三十二萬言。",
        "translation": "3. Kauṇḍinya, which is briefly explained in thirty-two million words.",
        "source": "T25n1509_002:0070b09_9"
    },
    {
        "source_sentence": "蜫勒廣比諸事以類相從，非阿毘曇。",
        "translation": "It is not the abhidharma that extensively compares all entities and follows each other by type.",
        "source": "T25n1509_002:0070b10_10"
    },
    {
        "source_sentence": "略說「如是我聞：一時」總義竟。",
        "translation": "After briefly explaining the general meaning of thus I've heard: one time, he said.",
        "source": "T25n1509_002:0070b11_11"
    },
    {
        "source_sentence": "大智度初品中婆伽婆釋論第四",
        "translation": "The Fourth Commentary on the Bhagavān in the First Chapter of the Mahāprajñāpāramitā",
        "source": "T25n1509_002:0070b13_0"
    },
    {
        "source_sentence": "【經】婆伽婆。",
        "translation": "[Sutra] Bhagavān.",
        "source": "T25n1509_002:0070b14_0"
    },
    {
        "source_sentence": "【論】今當說。",
        "translation": "[Commentary] Now, I'll explain.",
        "source": "T25n1509_002:0070b14_1"
    },
    {
        "source_sentence": "釋曰：云何名婆伽婆？",
        "translation": "What is the name Bhagavān?",
        "source": "T25n1509_002:0070b14_2"
    },
    {
        "source_sentence": "婆伽婆者，「婆伽」言「德」，「婆」言「有」，是名有德。",
        "translation": "Bhagavān means that Bhagavān refers to virtue, and bha refers to existence, which is called having virtue.",
        "source": "T25n1509_002:0070b15_3"
    },
    {
        "source_sentence": "復次，「婆伽」名「分別」，「婆」名「巧」，巧分別諸法總相別相，故名「婆伽婆」。",
        "translation": "Furthermore, Bhagavān is called discernment, and Bhā is called skillfulness, which skillfully discerns the general and specific characteristics of dharmas, so it's called Bhagavān.",
        "source": "T25n1509_002:0070b16_4"
    },
    {
        "source_sentence": "復次，「婆伽」名「名聲」，「婆」名「有」，是名「有名聲」，無有得名聲如佛者。",
        "translation": "Furthermore, the name bhaga is called name and sound, and the name bha is called existence, which is called name and sound, and there's no such person who attains name and sound like a Buddha.",
        "source": "T25n1509_002:0070b17_5"
    },
    {
        "source_sentence": "轉輪聖王、釋、梵、護世者，無有及佛，何況諸餘凡庶！",
        "translation": "The wheel-turning sage king, the Śākyamuni, Brahmā, and world protectors are no different from buddhas, so why wouldn't there be buddhas, let alone other ordinary people?",
        "source": "T25n1509_002:0070b19_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_002:0070b20_7"
    },
    {
        "source_sentence": "轉輪聖王與結相應，佛已離結；",
        "translation": "The cakravartin is associated with fetters, but the Buddha has been free of fetters.",
        "source": "T25n1509_002:0070b20_8"
    },
    {
        "source_sentence": "轉輪聖王沒在生、老、病、死泥中，佛已得渡；",
        "translation": "The wheel-turning sage king was submerged in the mud of birth, old age, sickness, and death.",
        "source": "T25n1509_002:0070b21_9"
    },
    {
        "source_sentence": "轉輪聖王為恩愛奴僕，佛已永離；",
        "translation": "The wheel-turning sage kings were kind and affectionate slaves to the Buddha, who had left them forever.",
        "source": "T25n1509_002:0070b22_10"
    },
    {
        "source_sentence": "轉輪聖王處在世間曠野災患，佛已得離；",
        "translation": "The wheel-turning sage king was in the world in the wilderness of misfortune, but the Buddha had already escaped.",
        "source": "T25n1509_002:0070b23_11"
    },
    {
        "source_sentence": "轉輪聖王處在無明闇中，佛處第一明中；",
        "translation": "The cakravartin is to be found in the darkness of ignorance, while Buddha is to be found in the first light.",
        "source": "T25n1509_002:0070b24_12"
    },
    {
        "source_sentence": "轉輪聖王若極多領四天下，佛領無量諸世界；",
        "translation": "If a universal ruler ruled over four continents, the Buddha ruled over an infinite number of worlds.",
        "source": "T25n1509_002:0070b25_13"
    },
    {
        "source_sentence": "轉輪聖王財自在，佛心自在；",
        "translation": "The wheel-turning sage king has sovereignty over wealth and possessions while the Buddha’s mind has sovereignty.",
        "source": "T25n1509_002:0070b26_14"
    },
    {
        "source_sentence": "轉輪聖王貪求天樂，佛乃至有頂樂亦不貪著；",
        "translation": "The universal ruler of the cakravartin desires heavenly bliss. Buddha and even the bliss of the summit of enlightenment do not cling to it.",
        "source": "T25n1509_002:0070b27_15"
    },
    {
        "source_sentence": "轉輪聖王從他求樂，佛內心自樂。",
        "translation": "The wheel-turning sage king seeks happiness from others, and the Buddha himself is happy inside his own mind.",
        "source": "T25n1509_002:0070b28_16"
    },
    {
        "source_sentence": "以是因緣，佛勝轉輪聖王。",
        "translation": "Because of these causes and conditions, the Buddha is superior to the wheel-turning sage king.",
        "source": "T25n1509_002:0070b29_17"
    },
    {
        "source_sentence": "諸餘釋、梵、護世者，亦復如是，但於轉輪聖王小勝。",
        "translation": "The other Śākyas, Brahmās, and world protectors are likewise, but slightly superior to the wheel-turning sage king.",
        "source": "T25n1509_002:0070b29_18"
    },
    {
        "source_sentence": "復次，「婆伽」名「破」，「婆」名「能」，是人能破婬怒癡故，稱為「婆伽婆」。",
        "translation": "Furthermore, Bhagavān is called refuting, and Bhā is called capable. Because this person can refute anger, anger, and delusion, they're called Bhagavān.",
        "source": "T25n1509_002:0070c01_19"
    },
    {
        "source_sentence": "問曰：如阿羅漢、辟支佛亦破婬怒癡，與佛何異？",
        "translation": "Q: Suppose arhats and pratyekabuddhas also destroy lust, anger, and delusion, so what's the difference between them and the Buddha?",
        "source": "T25n1509_002:0070c03_20"
    },
    {
        "source_sentence": "答曰：阿羅漢、辟支佛雖破三毒，氣分不盡；",
        "translation": "Answer: Although arhats and pratyekabuddhas destroy the three kinds of poison, their energy does not run out.",
        "source": "T25n1509_002:0070c04_21"
    },
    {
        "source_sentence": "譬如香在器中，香雖出，餘氣故在。",
        "translation": "It's like when an odor is present in a container, and although the odor exits, the remaining odor remains.",
        "source": "T25n1509_002:0070c05_22"
    },
    {
        "source_sentence": "又如草木薪火燒煙出，炭灰不盡，火力薄故；",
        "translation": "It is also like the case of grass, trees, and firewood that burn up smoke without extinguishing it because the power of the fire is weak.",
        "source": "T25n1509_002:0070c06_23"
    },
    {
        "source_sentence": "佛三毒永盡無餘，譬如劫盡，火燒須彌山，一切地都盡，無煙無炭。",
        "translation": "The Buddha's three poisons are permanently extinguished without remainder, like when an eon is extinguished and a fire burns up Mount Sumeru, and all the ground is completely extinguished with no smoke or charcoal.",
        "source": "T25n1509_002:0070c07_24"
    },
    {
        "source_sentence": "如舍利弗瞋恚氣殘，難陀婬欲氣殘，必陵伽婆磋慢氣殘；",
        "translation": "It is as if the vital energy of Śāriputra’s anger were to be exhausted, the vital energy of Nanda’s hatred for sensual desire was to be exhausted, and the vital energy of Belinda’s arrogance was to be exhausted.",
        "source": "T25n1509_002:0070c09_0"
    },
    {
        "source_sentence": "譬如人被鎖，初脫時，行猶不便。",
        "translation": "It's like when a person is locked and first freed, it's still uncomfortable to walk.",
        "source": "T25n1509_002:0070c10_1"
    },
    {
        "source_sentence": "時，佛從禪起經行，羅睺羅從佛經行，佛問羅睺羅：「何以羸瘦？」",
        "translation": "When the Buddha rose from meditation and began to walk, Rāhula followed the Buddha's steps, and the Buddha asked Rāhula, Why are you so weak?",
        "source": "T25n1509_002:0070c11_2"
    },
    {
        "source_sentence": "　「若人食油則得力，　　若食酥者得好色，",
        "translation": "“If someone eats oil, they’ll attain strength; if they eat butter, they’ll attain good appearance.",
        "source": "T25n1509_002:0070c12_3"
    },
    {
        "source_sentence": "　　食麻滓菜無色力，　　大德世尊自當知！」",
        "translation": "Eating sesame, garbage, and vegetables without form or strength, the Bhagavān Mahāprajñāpāramitā will know for himself!",
        "source": "T25n1509_002:0070c12_3"
    },
    {
        "source_sentence": "羅睺羅說偈答佛：佛問羅睺羅：「是眾中誰為上座？」",
        "translation": "Rāhula answered the Buddha in verse: The Buddha asked Rāhula, Who among these people is the superior seat?",
        "source": "T25n1509_002:0070c12_3"
    },
    {
        "source_sentence": "羅睺羅答：「和上舍利弗。」",
        "translation": "Rāhula answered, Upāsaka Śāriputra.",
        "source": "T25n1509_002:0070c16_4"
    },
    {
        "source_sentence": "佛言：「舍利弗食不淨食。」",
        "translation": "The Buddha said, Śāriputra eats impure food.",
        "source": "T25n1509_002:0070c17_5"
    },
    {
        "source_sentence": "爾時，舍利弗轉聞是語，即時吐食，自作誓言：「從今日不復受人請。」",
        "translation": "When Śāriputra heard these words, he immediately vomited out his food and made a vow to himself, From today, I won't accept another invitation from anyone.",
        "source": "T25n1509_002:0070c17_6"
    },
    {
        "source_sentence": "是時，波斯匿王、長者須達多等，來詣舍利弗所，語舍利弗：「佛不以無事而受人請，大德舍利弗復不受請，我等白衣云何當得大信清淨？」",
        "translation": "The king of Prasenajit and the elder Sudarśana then came to Śāriputra and said to him, How will we white-robed people attain great faith and purity if the Buddha doesn't accept people's invitation without doing anything, and how will the great virtuous Śāriputra not accept it?",
        "source": "T25n1509_002:0071a01_7"
    },
    {
        "source_sentence": "舍利弗言：「我大師佛言：『舍利弗食不淨食。』",
        "translation": "Śāriputra said, My great teacher and Buddha said, 'Śāriputra eats impure food.'",
        "source": "T25n1509_002:0071a04_8"
    },
    {
        "source_sentence": "今不得受人請。」",
        "translation": "Now, you mustn't accept someone's invitation.",
        "source": "T25n1509_002:0071a05_9"
    },
    {
        "source_sentence": "於是波斯匿等至佛所，白佛言：「佛不常受人請，舍利弗復不受請，我等云何心得大信？",
        "translation": "Prasenajit and others then went to the Buddha and said to him, The Buddha doesn't always accept people's invitations, and Śāriputra doesn't accept them; how can we attain great faith?",
        "source": "T25n1509_002:0071a06_10"
    },
    {
        "source_sentence": "願佛勅舍利弗還受人請！」",
        "translation": "May the Buddha command Śāriputra to return and accept people's invitation!",
        "source": "T25n1509_002:0071a08_11"
    },
    {
        "source_sentence": "佛言：「此人心堅，不可移轉。」",
        "translation": "The Buddha said, This mind is so strong that it can't be moved.",
        "source": "T25n1509_002:0071a08_12"
    },
    {
        "source_sentence": "佛爾時引本生因緣：「昔有一國王為毒蛇所囓，王時欲死，呼諸良醫令治蛇毒。",
        "translation": "It was then that the Buddha cited the causes and conditions of his original birth, saying, Once, there was a king of a country who was tormented by a poisonous snake. When the king wanted to die, he summoned good doctors to treat the poison of the snake.",
        "source": "T25n1509_002:0071a09_13"
    },
    {
        "source_sentence": "時諸醫言：『還令蛇嗽，毒氣乃盡。』",
        "translation": "The doctors then said, 'Let the snake cough again, and its poisonous breath will be exhausted.'",
        "source": "T25n1509_002:0071a11_14"
    },
    {
        "source_sentence": "是時諸醫各設呪術，所囓王蛇即來王所。",
        "translation": "Each of the doctors then set up a spell, and the king's snake that was eaten came to the king.",
        "source": "T25n1509_002:0071a12_15"
    },
    {
        "source_sentence": "諸醫積薪燃火，勅蛇還嗽汝毒，若不爾者，當入此火！",
        "translation": "If you don't, you'll enter this fire!",
        "source": "T25n1509_002:0071a13_16"
    },
    {
        "source_sentence": "毒蛇思惟：『我既吐毒，云何還嗽？",
        "translation": "The poisonous snake thought, 'Since I spit out poison, how can I still cough?'",
        "source": "T25n1509_002:0071a14_17"
    },
    {
        "source_sentence": "此事劇死！』",
        "translation": "This matter is so terrific!'",
        "source": "T25n1509_002:0071a15_18"
    },
    {
        "source_sentence": "思惟心定，即時入火。",
        "translation": "When he contemplates the concentration of mind, he immediately enters the fire.",
        "source": "T25n1509_002:0071a15_19"
    },
    {
        "source_sentence": "爾時毒蛇，舍利弗是。",
        "translation": "At the time, that poisonous snake was Śāriputra.",
        "source": "T25n1509_002:0071a16_20"
    },
    {
        "source_sentence": "世世心堅，不可動也。」",
        "translation": "The mind of worldly beings is resolute, and it can't be moved.",
        "source": "T25n1509_002:0071a16_21"
    },
    {
        "source_sentence": "復次，長老必陵伽婆蹉常患眼痛，是人乞食，常渡恒水，到恒水邊彈指言：「小婢住！",
        "translation": "Furthermore, the elder必陵伽婆蹉常患眼痛,是人乞食,常渡恒水,到恒水邊彈指言,小婢住!",
        "source": "T25n1509_002:0071a17_22"
    },
    {
        "source_sentence": "莫流！」",
        "translation": "Don't go!",
        "source": "T25n1509_002:0071a19_0"
    },
    {
        "source_sentence": "水即兩斷，得過乞食。",
        "translation": "The water is cut off in two ways, and he's allowed to go beyond begging for food.",
        "source": "T25n1509_002:0071a19_1"
    },
    {
        "source_sentence": "是恒神到佛所白佛：「佛弟子必陵伽婆蹉，常罵我言小婢住！",
        "translation": "The goddess of the Ganges came to the Buddha and said to him, A disciple of the Buddha,必陵伽婆蹉, always scolds me as a little maid!",
        "source": "T25n1509_002:0071a19_2"
    },
    {
        "source_sentence": "莫流水！」",
        "translation": "Don't flow water!",
        "source": "T25n1509_002:0071a21_3"
    },
    {
        "source_sentence": "佛告必陵伽婆蹉懺謝恒神！",
        "translation": "The Buddha addressed the celestial god Blinggua Vasiṣṭha to repent and thank him!",
        "source": "T25n1509_002:0071a21_4"
    },
    {
        "source_sentence": "必陵伽婆蹉即時合手語恒神言：「小婢莫瞋！",
        "translation": "Upagupta then joined his hands and said to the goddess, Don't be angry, little maid!",
        "source": "T25n1509_002:0071a22_5"
    },
    {
        "source_sentence": "今懺謝汝！」",
        "translation": "Now, I'll repent to you!",
        "source": "T25n1509_002:0071a23_6"
    },
    {
        "source_sentence": "是時，大眾笑之：「云何懺謝而復罵耶？」",
        "translation": "The crowd then laughed at him, How did you repent and abuse him again?",
        "source": "T25n1509_002:0071a23_7"
    },
    {
        "source_sentence": "佛語恒神：「汝見必陵伽婆蹉合手懺謝不？",
        "translation": "The Buddha said to the goddess of the Ganges, Do you see Bṛhatphala repentance by joining your hands?",
        "source": "T25n1509_002:0071a24_8"
    },
    {
        "source_sentence": "懺謝無慢而有此言，當知非惡。",
        "translation": "If someone repents without conceit and says this, you should know that it's not bad.",
        "source": "T25n1509_002:0071a25_9"
    },
    {
        "source_sentence": "此人五百世來，常生婆羅門家，常自憍貴，輕賤餘人，本來所習，口言而已，心無憍也。」",
        "translation": "For five hundred generations, this man has always been born in a brāhmaṇa's family, always despising himself and despising others. This is what he used to do in the past; he simply speaks words with no anger in his mind.",
        "source": "T25n1509_002:0071a26_10"
    },
    {
        "source_sentence": "如是諸阿羅漢雖斷結使，猶有殘氣。",
        "translation": "Thus, even though arhats have cut off the bonds and tendencies, they still have residual energy.",
        "source": "T25n1509_002:0071a28_11"
    },
    {
        "source_sentence": "如諸佛世尊，若人以刀割一臂，若人以栴檀香泥一臂，如左右眼，心無憎愛，是以永無殘氣。",
        "translation": "World-Honored Buddhas, just as if someone were to cut off one arm with a knife or another arm with sandalwood clay like the eyes of their left and right, they would have no hatred or craving in their minds; that is why they would never have any residual energy.",
        "source": "T25n1509_002:0071a29_12"
    },
    {
        "source_sentence": "栴闍婆羅門女木杅謗佛，於大眾中言：「汝使我有娠，何以不憂？",
        "translation": "Kauṇḍinya, a brahman woman, slandered the Buddha and said to the crowd, “If you allow me to become pregnant, why don’t you worry?",
        "source": "T25n1509_002:0071b02_13"
    },
    {
        "source_sentence": "與我衣食！",
        "translation": "Give me food and clothing!",
        "source": "T25n1509_002:0071b03_14"
    },
    {
        "source_sentence": "為爾無羞，誑惑餘人！」",
        "translation": "For your sake, have no shame, and deceive others!",
        "source": "T25n1509_002:0071b04_15"
    },
    {
        "source_sentence": "是時，五百婆羅門師等，皆舉手唱言：「是！",
        "translation": "At that point, the five hundred Brāhmaṇa teachers and others all raised their hands and called out, Yes!",
        "source": "T25n1509_002:0071b04_16"
    },
    {
        "source_sentence": "是！",
        "translation": "Yes!",
        "source": "T25n1509_002:0071b05_17"
    },
    {
        "source_sentence": "我曹知此事。」",
        "translation": "I'll know this.",
        "source": "T25n1509_002:0071b05_18"
    },
    {
        "source_sentence": "是時，佛無異色，亦無慚色。",
        "translation": "At the time, the Buddha had no different form and no form of shame.",
        "source": "T25n1509_002:0071b06_0"
    },
    {
        "source_sentence": "此事即時彰露，地為大動，諸天供養，散眾名華，讚歎佛德，佛無喜色。",
        "translation": "Immediately this matter was revealed to the world. The earth trembled greatly and all the gods offered offerings, scattering various kinds of famous flowers in praise of the Buddha’s virtue. The Buddha did not show signs of delight.",
        "source": "T25n1509_002:0071b06_1"
    },
    {
        "source_sentence": "復次，佛食馬麥，亦無憂慼；",
        "translation": "“Furthermore, the Buddha ate horse wheat and had no sorrow or anxiety.",
        "source": "T25n1509_002:0071b08_2"
    },
    {
        "source_sentence": "天王獻食，百味具足，不以為悅，一心無二。",
        "translation": "The king of gods offered food with a hundred flavors and didn't think it was delightful, being one-pointed and without duality.",
        "source": "T25n1509_002:0071b08_3"
    },
    {
        "source_sentence": "如是等種種飲食、衣被、臥具，讚呵、輕敬等種種事中，心無異也。",
        "translation": "Such are the various kinds of food, clothing, bedding, bedding, praise, disparagement, veneration, and other various things that have no difference in mind.",
        "source": "T25n1509_002:0071b09_4"
    },
    {
        "source_sentence": "譬如真金，燒鍛打磨，都無增損。",
        "translation": "It's like true gold that's burned, forged, and ground without gain or loss.",
        "source": "T25n1509_002:0071b11_5"
    },
    {
        "source_sentence": "以是故，阿羅漢雖斷結得道，猶有殘氣，不得稱婆伽婆。",
        "translation": "Because of this, even though an arhat has cut off the bonds and attained the path, he still has residual energy that can't be called a Bhagavān.",
        "source": "T25n1509_002:0071b12_6"
    },
    {
        "source_sentence": "問曰：婆伽婆正有此一名？",
        "translation": "Q: Is there really this one name for the Bhagavān?",
        "source": "T25n1509_002:0071b13_7"
    },
    {
        "source_sentence": "更有餘名？",
        "translation": "Is there another name for it?",
        "source": "T25n1509_002:0071b14_8"
    },
    {
        "source_sentence": "答曰：佛功德無量，名號亦無量；",
        "translation": "Answer: The virtues of buddhas are immeasurable, and their names are also immeasurable.",
        "source": "T25n1509_002:0071b14_9"
    },
    {
        "source_sentence": "此名取其大者，以人多識故。",
        "translation": "This is called grasping its greatness because people have many consciousnesses.",
        "source": "T25n1509_002:0071b15_10"
    },
    {
        "source_sentence": "復有異名，名多陀阿伽陀等。",
        "translation": "Also, there are dissimilar names called dhātu agada and so forth.",
        "source": "T25n1509_002:0071b15_11"
    },
    {
        "source_sentence": "云何名多陀阿伽陀？",
        "translation": "What's called a tathāgata?",
        "source": "T25n1509_002:0071b16_12"
    },
    {
        "source_sentence": "如法相解，如法相說；",
        "translation": "Understanding according to the characteristics of things, they are explained according to the characteristics of things.",
        "source": "T25n1509_002:0071b17_13"
    },
    {
        "source_sentence": "如諸佛安隱道來，佛亦如是來，更不去後有中，是故名多陀阿伽陀。",
        "translation": "Just as the buddhas come from the peaceful path, so do the buddhas come; there's nowhere else in the middle that they don't. That's why it's called a tathāgata.",
        "source": "T25n1509_002:0071b17_14"
    },
    {
        "source_sentence": "復名阿羅呵。",
        "translation": "It's also called arāha.",
        "source": "T25n1509_002:0071b19_15"
    },
    {
        "source_sentence": "云何名阿羅呵？",
        "translation": "What's called arhatship?",
        "source": "T25n1509_002:0071b19_16"
    },
    {
        "source_sentence": "「阿羅」名「賊」，「呵」名「殺」，是名「殺賊」。",
        "translation": "Ārāḍa is called thief, and Ha is called killing, which is called killing thief.",
        "source": "T25n1509_002:0071b20_17"
    },
    {
        "source_sentence": "　「佛以忍為鎧，　　精進為剛甲，",
        "translation": "The Buddha uses patience as his armor and energy as his steadfast armor.",
        "source": "T25n1509_002:0071b20_18"
    },
    {
        "source_sentence": "　　持戒為大馬，　　禪定為良弓，",
        "translation": "Observing precepts is a great horse, Meditation is a good bow.",
        "source": "T25n1509_002:0071b20_18"
    },
    {
        "source_sentence": "　　智慧為好箭；　　外破魔王軍，",
        "translation": "Wisdom is a good arrow, Destroying the armies of Māra everywhere.",
        "source": "T25n1509_002:0071b20_18"
    },
    {
        "source_sentence": "　　內滅煩惱賊，　　是名阿羅呵。」",
        "translation": "To internally extinguish the afflictive thief is called arrogance.",
        "source": "T25n1509_002:0071b20_18"
    },
    {
        "source_sentence": "如偈說：復次，「阿」名「不」，「羅呵」名「生」，是名「不生」。",
        "translation": "As the verse says, Furthermore, a is called not, and rāja is called arising, which is called not arising.",
        "source": "T25n1509_002:0071b20_18"
    },
    {
        "source_sentence": "佛心種子，後世田中不生，無明糠脫故。",
        "translation": "The seeds of the Buddha mind are not produced in the field of later ages, because they are freed from the chaff of ignorance.",
        "source": "T25n1509_002:0071b26_19"
    },
    {
        "source_sentence": "復次，「阿羅呵」名「應受供養」。",
        "translation": "Furthermore, arhat is called worthy of offerings.",
        "source": "T25n1509_002:0071b27_20"
    },
    {
        "source_sentence": "佛諸結使除盡，得一切智慧故，應受一切天地眾生供養，以是故，佛名阿羅呵。",
        "translation": "Because the Buddha's bonds are extinguished, and because he has attained all wisdom, he should be offered support by all sentient beings in heaven and earth; therefore, the Buddha is called arhat.",
        "source": "T25n1509_002:0071b28_21"
    },
    {
        "source_sentence": "復名三藐三佛陀。",
        "translation": "It's also called samyak-saṃbuddha.",
        "source": "T25n1509_002:0071c01_22"
    },
    {
        "source_sentence": "云何名三藐三佛陀？",
        "translation": "What is the name of samyak-saṃbuddha?",
        "source": "T25n1509_002:0071c01_23"
    },
    {
        "source_sentence": "「三藐」名「正」，「三」名「遍」，「佛」名「知」，是名正遍知一切法。",
        "translation": "Samyak is called correct, samyaka is called pervasive, and buddha is called knowing, which is called correctly pervasive knowing all dharmas.",
        "source": "T25n1509_002:0071c02_24"
    },
    {
        "source_sentence": "問曰：云何正遍知？",
        "translation": "Q: What's right pervasive knowing?",
        "source": "T25n1509_002:0071c03_25"
    },
    {
        "source_sentence": "　　知苦如苦相，　　知集如集相，",
        "translation": "Knowing suffering is as the characteristic of suffering, They know accumulation is as the characteristic of accumulation.",
        "source": "T25n1509_002:0071c03_26"
    },
    {
        "source_sentence": "　　知滅如滅相，　　知道如道相。",
        "translation": "Knowing cessation is like the characteristic of cessation, they know it is like the characteristic of the path.",
        "source": "T25n1509_002:0071c03_26"
    },
    {
        "source_sentence": "答曰：是名三藐三佛陀。",
        "translation": "Answer: This is called the name of the samyak-saṃbuddha.",
        "source": "T25n1509_002:0071c03_26"
    },
    {
        "source_sentence": "復次，知一切諸法實不壞相，不增不減。",
        "translation": "Furthermore, they know that all dharmas really have indestructible characteristics that don't increase or decrease.",
        "source": "T25n1509_002:0071c06_27"
    },
    {
        "source_sentence": "云何名不壞相？",
        "translation": "What's called the characteristic of indestructible?",
        "source": "T25n1509_002:0071c07_28"
    },
    {
        "source_sentence": "心行處滅，言語道斷，過諸法如涅槃相不動。",
        "translation": "The locus of mental functioning ceases, the path of language is cut off, and the characteristics of past dharmas are like nirvāṇa without moving.",
        "source": "T25n1509_002:0071c07_29"
    },
    {
        "source_sentence": "以是故，名三藐三佛陀。",
        "translation": "Because of this, they're called samyak-saṃbuddha.",
        "source": "T25n1509_002:0071c08_30"
    },
    {
        "source_sentence": "復次，一切十方諸世界名號，六道所攝眾生名號；",
        "translation": "“Furthermore, the names of all worlds in the ten directions are given. The sentient beings included in the six realms of rebirth are given names.",
        "source": "T25n1509_002:0071c09_31"
    },
    {
        "source_sentence": "眾生先世因緣，未來世生處；",
        "translation": "Sentient beings are the causes and conditions for birth in a prior lifetime; they will be born in future lives.",
        "source": "T25n1509_002:0071c10_32"
    },
    {
        "source_sentence": "一切十方眾生心相，諸結使、諸善根、諸出要，如是等一切諸法悉知，是名三藐三佛陀。",
        "translation": "Knowing all the mental characteristics of all sentient beings in the ten directions, the bonds, the good roots, and the essentials of liberation, and so forth, and knowing all these things, this is called samyak-saṃbuddha.",
        "source": "T25n1509_002:0071c11_33"
    },
    {
        "source_sentence": "復名鞞侈遮羅那三般那，秦言明行具足。",
        "translation": "He was also called Kauṣṭhila-caraṇasampanna (known in the Qin as Mingpuṣa), a Sanskrit word for being endowed with knowledge and conduct.",
        "source": "T25n1509_002:0071c13_34"
    },
    {
        "source_sentence": "云何名明行具足？",
        "translation": "What's called the fulfillment of insight and practice?",
        "source": "T25n1509_002:0071c14_35"
    },
    {
        "source_sentence": "宿命、天眼、漏盡，名為三明。",
        "translation": "Constellations, divine vision and the extinction of contaminants are called the three kinds of insight.",
        "source": "T25n1509_002:0071c14_36"
    },
    {
        "source_sentence": "問曰：神通、明有何等異？",
        "translation": "Q: What's the difference between supernormal abilities and insight?",
        "source": "T25n1509_002:0071c15_37"
    },
    {
        "source_sentence": "答曰：直知過去宿命事，是名通；",
        "translation": "Answer: To directly know the events of past lives is called supernormal knowledge.",
        "source": "T25n1509_002:0071c15_38"
    },
    {
        "source_sentence": "知過去因緣行業，是名明。",
        "translation": "Knowing past actions by causes and conditions, this is called insight.",
        "source": "T25n1509_002:0071c16_39"
    },
    {
        "source_sentence": "直知死此生彼，是名通；",
        "translation": "To directly know death here and birth there is called supernormal knowledge.",
        "source": "T25n1509_002:0071c17_40"
    },
    {
        "source_sentence": "知行因緣，際會不失，是名明。",
        "translation": "Knowing the causes and conditions of conditioned phenomena without losing their conjunction is called insight.",
        "source": "T25n1509_002:0071c17_41"
    },
    {
        "source_sentence": "直盡結使，不知更生不生，是名通；",
        "translation": "To directly terminate the contaminants of fetters and not knowing what is to be produced or not—this is called supernormal knowledge.",
        "source": "T25n1509_002:0071c18_42"
    },
    {
        "source_sentence": "若知漏盡，更不復生，是名明。",
        "translation": "If someone knows that the contaminants have ended and won't arise again, this is called insight.",
        "source": "T25n1509_002:0071c19_43"
    },
    {
        "source_sentence": "是三明，大阿羅漢、大辟支佛所得。",
        "translation": "These are the three kinds of insight that great arhats and great pratyekabuddhas attain.",
        "source": "T25n1509_002:0071c20_44"
    },
    {
        "source_sentence": "問曰：若爾者，與佛有何等異？",
        "translation": "Q: If that's the case, what's the difference between it and the Buddha?",
        "source": "T25n1509_002:0071c20_45"
    },
    {
        "source_sentence": "答曰：彼雖得三明，明不滿足，佛悉滿足，是為異。",
        "translation": "Answer: Although they attain the three kinds of insight, their insight isn't fulfilled, and the Buddha is fully fulfilled, which is different.",
        "source": "T25n1509_002:0071c21_46"
    },
    {
        "source_sentence": "問曰：云何不滿？",
        "translation": "Q: What's dissatisfactory?",
        "source": "T25n1509_002:0071c22_47"
    },
    {
        "source_sentence": "云何滿？",
        "translation": "How are they fulfilled?",
        "source": "T25n1509_002:0071c23_48"
    },
    {
        "source_sentence": "答曰：諸阿羅漢、辟支佛宿命智，知自身及他人，亦不能遍；",
        "translation": "Answer: The knowledge of past lives of arhats and pratyekabuddhas knows neither themselves nor others.",
        "source": "T25n1509_002:0071c23_49"
    },
    {
        "source_sentence": "有阿羅漢知一世，或二世、三世，十、百、千、萬劫，乃至八萬劫，過是以往不能復知，是故不滿。",
        "translation": "There are arhats who know one time period, sometimes two, sometimes three, sometimes ten, sometimes a hundred, sometimes a thousand, sometimes tens of thousands, sometimes millions, sometimes up to eighty-thousand world ages; but if they go beyond this, they will no longer be able to do so. Because of this, it is incomplete.",
        "source": "T25n1509_002:0071c24_50"
    },
    {
        "source_sentence": "天眼明未來世亦如是。",
        "translation": "So it will be with the divine eye that it's illuminating future lives.",
        "source": "T25n1509_002:0072a01_51"
    },
    {
        "source_sentence": "佛一念中生、住、滅時，諸結使分，生時如是，住時如是，滅時如是。",
        "translation": "In a single thought, when the Buddha arises, abides, and ceases, the afflictive tendencies are as they are when they arise, as they are when they abide, and as they cease when they cease.",
        "source": "T25n1509_002:0072a02_52"
    },
    {
        "source_sentence": "苦法忍、苦法智中所斷結使悉覺了。",
        "translation": "He fully perceives the bonds that are eliminated in the forbearance of suffering as a dharma and the knowledge of suffering as a dharma.",
        "source": "T25n1509_002:0072a03_53"
    },
    {
        "source_sentence": "知如是結使解脫，得爾所有為法解脫，得爾所無為法解脫，乃至道比忍見諦道十五心中。",
        "translation": "Knowing the liberation of such bonds and tendencies, he attains the liberation of these kinds of conditioned dharmas, the liberation of these kinds of unconditioned dharmas, up to the fifteenth mind of the path that's the path of seeing the truth in terms of forbearance of the path.",
        "source": "T25n1509_002:0072a04_54"
    },
    {
        "source_sentence": "諸聲聞、辟支佛所不覺知，時少疾故。",
        "translation": "It's because śrāvakas and pratyekbuddhas don't perceive it, and they have little illness at the time.",
        "source": "T25n1509_002:0072a06_55"
    },
    {
        "source_sentence": "如是知過去眾生因緣、漏盡，未來、現在亦如是，是故名佛明行具足。",
        "translation": "Thus, they know the causes and conditions of past sentient beings and end the contaminants, and so it will be likewise in the future and present; therefore, they're called fully endowed with the Buddha's insight and practice.",
        "source": "T25n1509_002:0072a07_56"
    },
    {
        "source_sentence": "行名身口業，唯佛身、口業具足，餘皆有失，是名明行具足。",
        "translation": "Practice is called bodily or verbal action. Only the Buddha’s bodily and verbal action are supplied with all these [factors]. All the others have faults. This is called ‘ supplied with knowledge and practice’.",
        "source": "T25n1509_002:0072a09_57"
    },
    {
        "source_sentence": "復名修伽陀：「修」秦言「好」，「伽陀」或言「去」，或言「說」，是名「好去」、「好說」。",
        "translation": "It's also called sūgada, which is the Qin word for good, and it's called either going or teaching, which is called good going and good speaking.",
        "source": "T25n1509_002:0072a10_58"
    },
    {
        "source_sentence": "　「佛一切智為大車，　　八正道行入涅槃。」",
        "translation": "The Buddha's omniscience is the great chariot, and the eightfold correct path of practice enters nirvāṇa.",
        "source": "T25n1509_002:0072a12_59"
    },
    {
        "source_sentence": "好去者，於種種諸深三摩提、無量諸大智慧中去，如偈說：是名好去。",
        "translation": "Those who like to leave are those who leave in various profound samādhis and immeasurable great wisdom, as explained in the verse, This is called a good leave.",
        "source": "T25n1509_002:0072a12_59"
    },
    {
        "source_sentence": "好說者，如諸法實相說，不著法愛說。",
        "translation": "Someone who speaks well explains it as the true characteristics of dharmas are explained and doesn't cling to the explanation of craving for dharmas.",
        "source": "T25n1509_002:0072a15_60"
    },
    {
        "source_sentence": "觀弟子智慧力，是人正使一切方便神通智力化之，亦無如之何。",
        "translation": "Observing the disciple's power of wisdom, this person correctly transforms him with the power of all skillful means and supernormal knowledge, and there's nothing like it.",
        "source": "T25n1509_002:0072a16_61"
    },
    {
        "source_sentence": "是人可度是疾、是遲，是人應是處度；",
        "translation": "If that person is able to cross over [to the other shore] because of illness or due to delay, that person should be saved wherever possible.",
        "source": "T25n1509_002:0072a17_62"
    },
    {
        "source_sentence": "是人應說布施，或說戒，或說涅槃；",
        "translation": "That person should teach generosity, or precepts, or nirvana.",
        "source": "T25n1509_002:0072a18_63"
    },
    {
        "source_sentence": "是人應說五眾、十二因緣、四諦等諸法能入道。",
        "translation": "That person should explain that the five collections, the twelve causes and conditions, the four truths, and other dharmas can enter the path.",
        "source": "T25n1509_002:0072a19_64"
    },
    {
        "source_sentence": "如是等種種知弟子智力而為說法，是名好說。",
        "translation": "Such a variety of knowledgeable disciples who teach the Dharma with the power of their knowledge are called good speakers.",
        "source": "T25n1509_002:0072a20_65"
    },
    {
        "source_sentence": "復名路迦憊：「路迦」秦言「世」，「憊」名「知」，是名知世間。",
        "translation": "It's also called Lokeṭika, which means worldly in Sanskrit. Lokeṭika is called knowing, and this is called knowing the world.",
        "source": "T25n1509_002:0072a21_66"
    },
    {
        "source_sentence": "問曰：云何知世間？",
        "translation": "Q: How do you know the world?",
        "source": "T25n1509_002:0072a22_67"
    },
    {
        "source_sentence": "答曰：知二種世間：一、眾生，二、非眾生。",
        "translation": "Answer: They know two kinds of worlds: 1. sentient beings and 2. not sentient beings.",
        "source": "T25n1509_002:0072a23_68"
    },
    {
        "source_sentence": "及如實相知世間、世間因、知世間滅、出世間道。",
        "translation": "They also know the world as it really is, its causes, its cessation, and the path leading to supramundane liberation.",
        "source": "T25n1509_002:0072a24_69"
    },
    {
        "source_sentence": "復次，知世間，非如世俗知，亦非外道知；",
        "translation": "“Furthermore, they know the world; they do not know it conventionally, nor do non-Buddhists know it.",
        "source": "T25n1509_002:0072a25_70"
    },
    {
        "source_sentence": "知世間無常故苦，苦故無我。",
        "translation": "They know that the world is impermanent because it's painful, and selfless because it's painful.",
        "source": "T25n1509_002:0072a26_71"
    },
    {
        "source_sentence": "復次，知世間相，非有常非無常，非有邊非無邊，非去非不去，如是相亦不著，清淨、常不壞相如虛空，是名知世間。",
        "translation": "Furthermore, they know the characteristics of the world, which are neither permanent nor impermanent, neither finite nor infinite, neither going nor non-going, such characteristics also don't cling to them, and their characteristics as pure and eternal and indestructible like space are called knowing the world.",
        "source": "T25n1509_002:0072a27_72"
    },
    {
        "source_sentence": "復名阿耨多羅，秦言「無上」。",
        "translation": "It's also called anuttara, which is the Qin word for unsurpassed.",
        "source": "T25n1509_002:0072a29_73"
    },
    {
        "source_sentence": "云何無上？",
        "translation": "What's unsurpassed?",
        "source": "T25n1509_002:0072b01_74"
    },
    {
        "source_sentence": "涅槃法無上。",
        "translation": "The Dharma of nirvāṇa is unsurpassed.",
        "source": "T25n1509_002:0072b01_75"
    },
    {
        "source_sentence": "佛自知是涅槃不從他聞，亦將導眾生令至涅槃。",
        "translation": "The Buddha knows for himself that this is nirvāṇa and doesn't hear it from others, and he will guide sentient beings to reach nirvāṇa.",
        "source": "T25n1509_002:0072b02_76"
    },
    {
        "source_sentence": "如諸法中涅槃無上，眾生中佛亦無上。",
        "translation": "As nirvāṇa is the unsurpassed among all dharmas, so is the Buddha the unsurpassed among sentient beings.",
        "source": "T25n1509_002:0072b03_77"
    },
    {
        "source_sentence": "復次，持戒、禪定、智慧，教化眾生，一切無有與等者，何況能過！",
        "translation": "Furthermore, there's no equal in observing precepts, meditation, or wisdom, and teaching sentient beings, so how could it be surpassed by anyone?",
        "source": "T25n1509_002:0072b04_78"
    },
    {
        "source_sentence": "故言無上。",
        "translation": "That's why it's called unsurpassed.",
        "source": "T25n1509_002:0072b05_79"
    },
    {
        "source_sentence": "復次，「阿」名「無」，「耨多羅」名「答」。",
        "translation": "Furthermore, the letter a is called nothing, and the letter caṇḍāla is called an answer.",
        "source": "T25n1509_002:0072b05_80"
    },
    {
        "source_sentence": "一切外道法，可答可破，非實非清淨故；",
        "translation": "All non-Buddhist doctrines can be answered or refuted, because they are neither real nor pure.",
        "source": "T25n1509_002:0072b06_81"
    },
    {
        "source_sentence": "佛法不可答、不可破，出一切語言道，亦實清淨故，以是故名無答。",
        "translation": "The Buddha's teaching can't be answered or refuted, and all the paths of language that emerge are also truly pure, which is why they're called in replyless.",
        "source": "T25n1509_002:0072b07_82"
    },
    {
        "source_sentence": "復名富樓沙曇藐婆羅提：「富樓沙」秦言「丈夫」，「曇藐」言「可化」，「婆羅提」言「調御師」，是名「可化丈夫調御師」。",
        "translation": "Again, it's called Puruṣa Dharmakṣema-vararbuddhi: Puruṣa is the Qin word for husband, Dharmakṣema means to be transformed, and Vārāṇasī means tamer, which is called tamer of the men who can be transformed.",
        "source": "T25n1509_002:0072b09_0"
    },
    {
        "source_sentence": "佛以大慈大悲大智故，有時軟美語，有時苦切語，有時雜語，以此調御令不失道。",
        "translation": "Because of his great compassion, great compassion, and great wisdom, the Buddha sometimes speaks softly, sometimes with sweet words, sometimes with painful words, and sometimes with mixed words, to tame them so that they won't lose their path.",
        "source": "T25n1509_002:0072b11_1"
    },
    {
        "source_sentence": "　「佛法為車弟子馬，　　實法寶主佛調御，",
        "translation": "The Buddha-dharma is the chariot of disciples and horses, Really the jewel of the Teaching, tamed by the Buddha.",
        "source": "T25n1509_002:0072b13_2"
    },
    {
        "source_sentence": "　　若馬出道失正轍，　　如是當治令調伏。",
        "translation": "If a horse leaves the path and loses his right path, he'll thus be disciplined and made to tame it.",
        "source": "T25n1509_002:0072b13_2"
    },
    {
        "source_sentence": "　　若小不調輕法治，　　好善成立為上道，",
        "translation": "If the lesser is not disciplined and rules lightly, Goodness establishes it as the higher path.",
        "source": "T25n1509_002:0072b13_2"
    },
    {
        "source_sentence": "　　若不可治便棄捨，　　以是調御為無上。」",
        "translation": "If it's untreatable, then he discards it; this is the unsurpassed way to tame it.",
        "source": "T25n1509_002:0072b13_2"
    },
    {
        "source_sentence": "如偈說：復次，調御師有五種：初父母兄姊親里，中官法，下師法——今世三種法治，後世閻羅王治，佛以今世樂、後世樂及涅槃樂利益，故名師。",
        "translation": "As a verse says: Furthermore, there are five kinds of taming teachers: first, parents, brothers, sisters, relatives, middle officials, and inferior teachers - the three kinds of rules in the present life ruled by the king of Yama in the afterlife, and the Buddha is called a teacher because he benefits from the happiness of the present life, the happiness of the afterlife, and the happiness of nirvāṇa",
        "source": "T25n1509_002:0072b13_2"
    },
    {
        "source_sentence": "上四種法治人不久畢壞，不能常實成就。",
        "translation": "The above four kinds of rulers will soon perish, and they won't be able to permanently and truly accomplish it.",
        "source": "T25n1509_002:0072b21_3"
    },
    {
        "source_sentence": "佛成人以三種道，常隨道不失，如火自相不捨乃至滅；",
        "translation": "The Buddha’s adulthood is of three kinds, always following the path without losing it: just as fire does not let go of its own characteristic marks until it goes out.",
        "source": "T25n1509_002:0072b22_4"
    },
    {
        "source_sentence": "佛令人得善法亦如是，至死不捨。",
        "translation": "So it is with the Buddha who causes people to attain good qualities and doesn't abandon them until death.",
        "source": "T25n1509_002:0072b23_5"
    },
    {
        "source_sentence": "以是故，佛名可化丈夫調御師。",
        "translation": "Because of this, the Buddha is called the tamer of men who can be transformed.",
        "source": "T25n1509_002:0072b24_6"
    },
    {
        "source_sentence": "問曰：女人，佛亦化令得道，何以獨言丈夫？",
        "translation": "Q: Women, the Buddha also transforms them to attain the path, so why is it that he speaks of men alone?",
        "source": "T25n1509_002:0072b25_7"
    },
    {
        "source_sentence": "答曰：男尊女卑故，女從男故，男為事業主故。",
        "translation": "Answer: Because men are honored and women are inferior, women follow men, and men are the leaders of their undertakings.",
        "source": "T25n1509_002:0072b26_8"
    },
    {
        "source_sentence": "復次，女人有五礙：不得作轉輪王、釋天王、魔天王、梵天王、佛，以是故不說。",
        "translation": "Furthermore, women have five obstructions: they can't become wheel-turning kings, the king of the Śākya gods, the king of Māra gods, the king of Brahmā gods, or the Buddha; therefore, they won't explain it.",
        "source": "T25n1509_002:0072b27_9"
    },
    {
        "source_sentence": "復次，若言佛為女人調御師，為不尊重。",
        "translation": "Furthermore, if someone says the Buddha is a woman's taming teacher, that's because they don't respect him.",
        "source": "T25n1509_002:0072b28_10"
    },
    {
        "source_sentence": "若說丈夫，一切都攝。",
        "translation": "If it's said to be a husband, they're all included.",
        "source": "T25n1509_002:0072b29_11"
    },
    {
        "source_sentence": "譬如王來，不應獨來，必有侍從。",
        "translation": "It's like when a king comes, he shouldn't come alone; there must be an attendant.",
        "source": "T25n1509_002:0072c01_12"
    },
    {
        "source_sentence": "如是說丈夫，二根、無根及女盡攝，以是故說丈夫。",
        "translation": "In this way, it is said that the two faculties and the one without faculties as well as the woman are all included. That is why a husband is spoken of.",
        "source": "T25n1509_002:0072c02_13"
    },
    {
        "source_sentence": "用是因緣故，佛名可化丈夫調御師。",
        "translation": "Because of these causes and conditions, the Buddha is called the tamer who can transform men.",
        "source": "T25n1509_002:0072c03_14"
    },
    {
        "source_sentence": "復名舍多提婆魔[少\\/兔]舍喃：「舍多」秦言「教師」，「提婆」言「天」，「魔[少\\/兔]舍喃」言「人」，是名「天人教師」。",
        "translation": "It's also called Śatadeva Māra [lesser\\/rabbit] śāraṇa: Śata means teacher, Deva means god, and Māra [lesser\\/rabbit] śāraṇa means human, which is called teacher of gods and humans.",
        "source": "T25n1509_002:0072c04_15"
    },
    {
        "source_sentence": "云何名天人教師？",
        "translation": "What's called a teacher of gods and humans?",
        "source": "T25n1509_002:0072c06_16"
    },
    {
        "source_sentence": "佛示導是應作、是不應作，是善、是不善，是人隨教行、不捨道法，得煩惱解脫報，是名天人師。",
        "translation": "The Buddha shows and guides what should be done and what shouldn't be done, which are good and unwholesome, and this person follows their instructions, doesn't abandon the path of enlightenment, and attains the fruit of liberation from affliction, which is called the teacher of gods and humans.",
        "source": "T25n1509_002:0072c06_17"
    },
    {
        "source_sentence": "問曰：佛能度龍、鬼、神等墮餘道中生者，何以獨言天人師？",
        "translation": "Q: If the Buddha can save dragons, ghosts, spirits, and so forth from being born in other destinies, why is it that he speaks alone as a teacher of gods and humans?",
        "source": "T25n1509_002:0072c08_18"
    },
    {
        "source_sentence": "答曰：度餘道中生者少，度天、人中生者多。",
        "translation": "Answer: Those born in the other paths are few, and those born in the heavens and humans are many.",
        "source": "T25n1509_002:0072c10_19"
    },
    {
        "source_sentence": "如白色人，雖有黑黶子，不名黑人，黑少故。",
        "translation": "Like a white person, even though they have black spots, they aren't called black people because their blackness is small.",
        "source": "T25n1509_002:0072c11_20"
    },
    {
        "source_sentence": "復次，人中結使薄，厭心易得；",
        "translation": "“Furthermore, among humans the defilements are weak and easy to acquire through aversion.",
        "source": "T25n1509_002:0072c12_21"
    },
    {
        "source_sentence": "天中智慧利。",
        "translation": "It's the benefit of wisdom in heaven.",
        "source": "T25n1509_002:0072c12_22"
    },
    {
        "source_sentence": "以是故，二處易得道，餘道中不爾。",
        "translation": "Because of this, it is easy to acquire the path in two places. This is not so for the other paths.",
        "source": "T25n1509_002:0072c13_23"
    },
    {
        "source_sentence": "復次，言天則攝一切天，言人則攝一切地上生者。",
        "translation": "Furthermore, when it's called heaven, all the gods are included, and when it's called a person, all the earthly beings are included.",
        "source": "T25n1509_002:0072c14_24"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_002:0072c15_25"
    },
    {
        "source_sentence": "天上則天大，地上則人大，是故說天則天上盡攝，說人則地上盡攝。",
        "translation": "Because of this, it is said that the gods are included in heaven. When speaking of humans, they are included in earth*°; when speaking of celestial beings, they are included in heaven.",
        "source": "T25n1509_002:0072c15_26"
    },
    {
        "source_sentence": "復次，人中得受戒律儀、見諦道、思惟道及諸道果。",
        "translation": "Furthermore, among humans, it's the path of observing precepts, the path of seeing the truths, the path of contemplation, and the fruit of the paths.",
        "source": "T25n1509_002:0072c17_27"
    },
    {
        "source_sentence": "或有人言：餘道中不得。",
        "translation": "Or someone might say, They won't attain it in other paths.",
        "source": "T25n1509_002:0072c18_28"
    },
    {
        "source_sentence": "或有人言：多少得。",
        "translation": "Some people may say, How much is it attained?",
        "source": "T25n1509_002:0072c18_29"
    },
    {
        "source_sentence": "天、人中易得多得，以是故，佛為天人師。",
        "translation": "It's easy to attain many things among gods and humans, so the Buddha is the teacher of gods and humans.",
        "source": "T25n1509_002:0072c19_30"
    },
    {
        "source_sentence": "復次，人中行樂因多，天中樂報多；",
        "translation": "“Furthermore, among humans there are many reasons for pleasure and happiness; among gods there are many reasons for pleasure and retribution.",
        "source": "T25n1509_002:0072c20_31"
    },
    {
        "source_sentence": "善法是樂因，樂是善法報。",
        "translation": "Good dharmas are the cause of happiness, and happiness is the result of good dharmas.",
        "source": "T25n1509_002:0073a01_32"
    },
    {
        "source_sentence": "餘道中善因報少，以是故，佛為天人師。",
        "translation": "In the other paths, there are good causes with few rewards; therefore, the Buddha is the teacher of gods and humans.",
        "source": "T25n1509_002:0073a01_33"
    },
    {
        "source_sentence": "復名佛陀(秦言「知者」)。",
        "translation": "Again, he's called a buddha (knower in the Qin).",
        "source": "T25n1509_002:0073a02_34"
    },
    {
        "source_sentence": "知何等法？",
        "translation": "Know what kind of dharmas?",
        "source": "T25n1509_002:0073a03_35"
    },
    {
        "source_sentence": "知過去、未來、現在，眾生數、非眾生數，有常、無常等一切諸法。",
        "translation": "They know all the things that are permanent and impermanent in the past, future, and present, which are numbered by sentient beings and not sentient beings, such as permanence and impermanence.",
        "source": "T25n1509_002:0073a03_36"
    },
    {
        "source_sentence": "菩提樹下了了覺知，故名為佛陀。",
        "translation": "Under the enlightenment tree, he understands and knows, so he's called a buddha.",
        "source": "T25n1509_002:0073a04_37"
    },
    {
        "source_sentence": "問曰：餘人亦知一切諸法，如摩醯首羅天(秦言「大自在」)，八臂，三眼，騎白牛。",
        "translation": "Q: Other people also know all dharmas, such as the Mahêśvara gods (known as Mahêśvara in the Qin language), eight-armed, three-eyed, and white cow riding.",
        "source": "T25n1509_002:0073a05_38"
    },
    {
        "source_sentence": "如韋紐天(秦言「遍悶」)，四臂，捉貝持輪，騎金翅鳥。",
        "translation": "It's like the Vaiśravaṇa gods (known as pervasive torpor in the Qin), with four arms holding shells and carrying wheels, riding golden-winged birds.",
        "source": "T25n1509_002:0073a07_39"
    },
    {
        "source_sentence": "如鳩摩羅天(秦言「童子」)，是天擎雞持鈴，捉赤幡，騎孔雀，皆是諸天大將。",
        "translation": "It's like the Kumārata gods (known in the Qin as children), which are the generals of the gods holding birds, holding bells, grasping red banners, and riding peacocks.",
        "source": "T25n1509_002:0073a08_40"
    },
    {
        "source_sentence": "如是等諸天，各各言大，皆稱一切智。",
        "translation": "Each of these gods is called great, and they all call themselves omniscience.",
        "source": "T25n1509_002:0073a09_41"
    },
    {
        "source_sentence": "有人作弟子，學其經書，亦受其法，言是一切智。",
        "translation": "Someone becomes a disciple, studying the sūtras and books, and also accepts their teachings, saying that they are omniscience.",
        "source": "T25n1509_002:0073a10_42"
    },
    {
        "source_sentence": "答曰：此不應一切智。",
        "translation": "Answer: This shouldn't be omniscience.",
        "source": "T25n1509_002:0073a11_43"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_002:0073a12_44"
    },
    {
        "source_sentence": "瞋恚、憍慢心著故。",
        "translation": "It's because the mind is attached to anger and arrogance.",
        "source": "T25n1509_002:0073a12_45"
    },
    {
        "source_sentence": "　「若彩畫像及泥像，　　聞經中天及讚天，",
        "translation": "“Suppose a colorful, painted image or a mud image is heard by the gods in the sutra and praised by the gods.",
        "source": "T25n1509_002:0073a13_0"
    },
    {
        "source_sentence": "　　如是四種諸天等，　　各各手執諸兵杖。",
        "translation": "Thus, these four kinds of gods and so forth each held their weapons in their hands.",
        "source": "T25n1509_002:0073a13_0"
    },
    {
        "source_sentence": "　　若力不如畏怖他，　　若心不善恐怖他，",
        "translation": "If someone’s strength isn’t strong enough to fear others, or if their mind isn’t good enough to fear others,",
        "source": "T25n1509_002:0073a13_0"
    },
    {
        "source_sentence": "　　此天定必若怖他，　　若少力故畏怖他。",
        "translation": "This god necessarily fears others. If he fears others because of the smallness of his power, then he will be afraid of them.",
        "source": "T25n1509_002:0073a13_0"
    },
    {
        "source_sentence": "　　是天一切常怖畏，　　不能除却諸衰苦。",
        "translation": "All these gods are always fearful, unable to remove the suffering of decay.",
        "source": "T25n1509_002:0073a13_0"
    },
    {
        "source_sentence": "　　有人奉事恭敬者，　　現世不免沒憂海；",
        "translation": "Some people serve and venerate those who are honored, Yet in the present world they cannot avoid sinking into the sea of sorrow.",
        "source": "T25n1509_002:0073a13_0"
    },
    {
        "source_sentence": "　　有人不敬不供養，　　現世不妨受富樂。",
        "translation": "If someone doesn't honor and don't make offerings, they might as well experience wealth and happiness in the present life.",
        "source": "T25n1509_002:0073a13_0"
    },
    {
        "source_sentence": "　　當知虛誑無實事，　　是故智人不屬天。",
        "translation": "You should know that hypocrisy has no real substance; therefore, the wise person doesn't belong to heaven.",
        "source": "T25n1509_002:0073a13_0"
    },
    {
        "source_sentence": "　　若世間中諸眾生，　　業因緣故如循環，",
        "translation": "If sentient beings in the world act like a cycle because of karmic causes and conditions,",
        "source": "T25n1509_002:0073a13_0"
    },
    {
        "source_sentence": "　　福德緣故生天上，　　雜業因緣故人中，",
        "translation": "They are born in heaven because of the conditions of virtue, among humans because of the causes and conditions of mixed karma.",
        "source": "T25n1509_002:0073a13_0"
    },
    {
        "source_sentence": "　　世間行業屬因緣，　　是故智者不依天！」",
        "translation": "Worldly actions belong to causes and conditions, so the wise don't rely on heaven!",
        "source": "T25n1509_002:0073a13_0"
    },
    {
        "source_sentence": "如偈說：復次，是三天，愛之則欲令得一切願，惡之則欲令七世滅。",
        "translation": "As a verse says: Furthermore, these are the three kinds of gods. If one loves them, he wishes to cause all vows to be fulfilled; if one hates them, he wishes to bring about the cessation of seven eons.",
        "source": "T25n1509_002:0073a13_0"
    },
    {
        "source_sentence": "佛不爾。",
        "translation": "That's not the case with the Buddha.",
        "source": "T25n1509_002:0073a26_1"
    },
    {
        "source_sentence": "菩薩時，若怨家賊來欲殺，尚自以身肉、頭目、髓腦而供養之，何況得佛不惜身時！",
        "translation": "When the bodhisattva was about to be killed by an enemy thief, he offered his own flesh, hair, eyes, marrow, and marrow as an offering, so why wouldn't he offer it to the Buddha when he didn't spare his body?",
        "source": "T25n1509_002:0073a26_2"
    },
    {
        "source_sentence": "以是故，獨佛應當受佛名號。",
        "translation": "Because of this, the Buddha alone should receive the Buddha's name.",
        "source": "T25n1509_002:0073a28_3"
    },
    {
        "source_sentence": "應當歸命佛，以佛為師，不應事天。",
        "translation": "You should pay homage to the Buddha, make him your teacher, and not serve gods.",
        "source": "T25n1509_002:0073a29_4"
    },
    {
        "source_sentence": "復次，佛有二事：一者大功德神通力，二者第一淨心，諸結使滅。",
        "translation": "Furthermore, there are two things that the Buddha does: first, great virtue and supernormal powers; and second, the first pure mind that extinguishes the afflictive tendencies.",
        "source": "T25n1509_002:0073b01_5"
    },
    {
        "source_sentence": "諸天雖有福德神力，諸結使不滅故，心不清淨；",
        "translation": "Even though the gods have merit and supernatural powers, their minds are not pure because they do not extinguish the defilements.",
        "source": "T25n1509_002:0073b02_6"
    },
    {
        "source_sentence": "心不清淨故，神力亦少。",
        "translation": "Because the mind is not pure, its supernormal powers are weak.",
        "source": "T25n1509_002:0073b03_7"
    },
    {
        "source_sentence": "聲聞、辟支佛雖結使滅，心清淨，福德薄故力勢少。",
        "translation": "Although śrāvakas and pratyekbuddhas are bound by fetters, their minds are purified, and because their merit is weak, their powers are small.",
        "source": "T25n1509_002:0073b04_8"
    },
    {
        "source_sentence": "佛二法滿足，故稱勝一切人；",
        "translation": "Because the Buddha fulfilled these two qualities, he is called superior to all people.",
        "source": "T25n1509_002:0073b05_9"
    },
    {
        "source_sentence": "餘人不勝一切人。",
        "translation": "The others aren't superior to all people.",
        "source": "T25n1509_002:0073b06_10"
    },
    {
        "source_sentence": "婆伽婆名有德，先已說。",
        "translation": "Bhagavān is called having virtue, as has been said before.",
        "source": "T25n1509_002:0073b06_11"
    },
    {
        "source_sentence": "復名阿婆磨(秦言無等)，復名阿婆摩婆摩(秦言無等等)，復名路迦那他(秦言世尊)，復名波羅伽(秦言度彼岸)，復名婆檀陀(秦言大德)，復名尸梨伽那(秦言厚德)，如是等無量名號。",
        "translation": "They're also called abhidharma (known as none in the Qin language), abhidharma (known as none in the Qin language), abhidharma (known as none in the Qin language), and so forth, with measureless names like these.",
        "source": "T25n1509_002:0073b07_12"
    },
    {
        "source_sentence": "父母名字悉達陀(秦言成利)；",
        "translation": "His parents’ name was Siddhârtha (known as Chengli in Chinese).",
        "source": "T25n1509_002:0073b10_13"
    },
    {
        "source_sentence": "得道時，知一切諸法故，是名為佛，應受諸天世人供養。",
        "translation": "When he attains the path, knowing all dharmas, this is called a buddha who should be offered support by gods and humans.",
        "source": "T25n1509_002:0073b11_14"
    },
    {
        "source_sentence": "如是等得名大德、厚德。",
        "translation": "Such things as these are called great virtues and profound virtues.",
        "source": "T25n1509_002:0073b12_15"
    },
    {
        "source_sentence": "如是種種，隨德立名。",
        "translation": "These various names are established in accordance with their qualities.",
        "source": "T25n1509_002:0073b13_16"
    },
    {
        "source_sentence": "問曰：汝愛剎利種淨飯王子字悉達多，以是故而大稱讚言一切智，一切智人無也！",
        "translation": "Q: You love the name Siddhârtha, the prince of the Śuddhodana from the kṣatriya family, and for this reason you greatly praise it as omniscience, saying that there are no omniscience people!",
        "source": "T25n1509_002:0073b13_17"
    },
    {
        "source_sentence": "答曰：不爾！",
        "translation": "Answer, No!",
        "source": "T25n1509_002:0073b16_0"
    },
    {
        "source_sentence": "汝惡邪故妬瞋佛，作妄語，實有一切智人。",
        "translation": "Because you're bad and wrong, you're jealous of the Buddha and speak falsely, but there really is a person of omniscience.",
        "source": "T25n1509_002:0073b16_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_002:0073b17_2"
    },
    {
        "source_sentence": "佛一切眾生中，身色顏貌，端正無比，相、德、明具，勝一切人。",
        "translation": "Among all sentient beings, the Buddha's body has form and appearance, which are incomparably handsome and endowed with characteristics, virtue, and insight, superior to all people.",
        "source": "T25n1509_002:0073b17_3"
    },
    {
        "source_sentence": "小人見佛身相，亦知是一切智人，何況大人！",
        "translation": "A small person who sees the characteristics of the Buddha's body also knows that he's a man of omniscience, so why wouldn't a great person?",
        "source": "T25n1509_002:0073b18_4"
    },
    {
        "source_sentence": "如《放牛譬喻經》中說：摩伽陀國王頻婆娑羅，請佛三月，及五百弟子。",
        "translation": "As it's said in the Parable Sutra of the Metaphor of the released ox: The king of Magadha, Bimbisara, invited the Buddha for three months and five hundred disciples.",
        "source": "T25n1509_002:0073b19_5"
    },
    {
        "source_sentence": "王須新乳酪酥供養佛及比丘僧，語諸放牛人，來近處住，日日送新乳酪酥。",
        "translation": "The king needed fresh milk, curds, and butter to make offerings to the Buddha and the monks and said to the herding cattlemen, who came to live nearby and delivered new milk, curds, and butter every day.",
        "source": "T25n1509_002:0073b21_6"
    },
    {
        "source_sentence": "竟三月，王憐愍此放牛人，語言：「汝往見佛，還出放牛。」",
        "translation": "After three months, the king pityed the herding cowherd and said, Go see the Buddha and return to herding cattle.",
        "source": "T25n1509_002:0073b23_7"
    },
    {
        "source_sentence": "諸放牛人往詣佛所，於道中自共論言：「我等聞人說佛是一切智人，我等是下劣小人，何能別知實有一切智人！」",
        "translation": "The herding cattlemen went to the Buddha and argued among themselves in the path, saying, We've heard people say that the Buddha is a man of omniscience; we're inferior and small people, so how can we know separately that there really is a man of omniscience?",
        "source": "T25n1509_002:0073b24_8"
    },
    {
        "source_sentence": "諸婆羅門喜好酥酪故，常來往諸放牛人所作親厚，放牛人由是聞婆羅門種種經書名字。",
        "translation": "Because the Brāhmaṇas liked butter and cream, they always came and went to the herding cowherds to be affectionate, and the herding cowherds heard the names of the various sūtras and books of the Brāhmaṇas as a result.",
        "source": "T25n1509_002:0073b27_9"
    },
    {
        "source_sentence": "故言：「四違陀經中治病法、鬪戰法、星宿法、祠天法、歌舞、論議難問法，如是等六十四種世間伎藝，淨飯王子廣學多聞，若知此事不足為難。",
        "translation": "That's why it's said, In the sutra on the four contradictions, there's the method of healing illnesses, the method of fighting, the method of stars and constellations, the method of worshipping gods, the method of singing and dancing, the method of discussing difficult questions, and so forth, these are the sixty-four kinds of worldly arts and skills, and Prince Jīva",
        "source": "T25n1509_002:0073b29_10"
    },
    {
        "source_sentence": "其從生已來不放牛，我等以放牛祕法問之，若能解者，實是一切智人。」",
        "translation": "Since he's been born, he won't release the cow; we'll ask him about the secret teaching of releasing the cow, and if he can understand it, he's really a man of omniscience.",
        "source": "T25n1509_002:0073c03_11"
    },
    {
        "source_sentence": "作是論已，前入竹園，見佛光明照於林間。",
        "translation": "After he had made this argument, he went into the bamboo grove and saw the Buddha's light shining brightly in the forest.",
        "source": "T25n1509_002:0073c05_12"
    },
    {
        "source_sentence": "　「今此釋師子，　　一切智有無，",
        "translation": "“Now, this lion of the Buddha explains that omniscience exists and doesn’t exist,",
        "source": "T25n1509_002:0073c06_13"
    },
    {
        "source_sentence": "　　見之無不喜，　　此事亦已足。",
        "translation": "There’s no one who doesn’t rejoice when he sees it, and this matter is also sufficient.",
        "source": "T25n1509_002:0073c06_13"
    },
    {
        "source_sentence": "　　光明第一照，　　顏貌甚貴重，",
        "translation": "The first ray of light shines brightly, With a very noble countenance.",
        "source": "T25n1509_002:0073c06_13"
    },
    {
        "source_sentence": "　　身相威德備，　　與佛名相稱。",
        "translation": "Their bodies and features are endowed with authoritative qualities, which are commensurate with the Buddha's name.",
        "source": "T25n1509_002:0073c06_13"
    },
    {
        "source_sentence": "　　相相皆分明，　　威神亦滿足，",
        "translation": "The characteristics and signs are all clearly visible, And their majesty is also fulfilled.",
        "source": "T25n1509_002:0073c06_13"
    },
    {
        "source_sentence": "　　福德自纏絡，　　見者無不愛；",
        "translation": "Their virtues themselves are self-entangled, And those who see them don’t dislike them.",
        "source": "T25n1509_002:0073c06_13"
    },
    {
        "source_sentence": "　　圓光身處中，　　觀者無厭足！",
        "translation": "In the place of the body of perfect illumination, Those who contemplate don’t tire of it!",
        "source": "T25n1509_002:0073c06_13"
    },
    {
        "source_sentence": "　　若有一切智，　　必有是功德。",
        "translation": "If there is omniscience, There must be this merit.",
        "source": "T25n1509_002:0073c06_13"
    },
    {
        "source_sentence": "　　一切諸彩畫，　　寶飾莊嚴像，",
        "translation": "All the colorful paintings and jewel ornamented images,",
        "source": "T25n1509_002:0073c06_13"
    },
    {
        "source_sentence": "　　欲比此妙身，　　不可以為喻！",
        "translation": "Wishing to compare this marvelous body, they can't use it as a metaphor!",
        "source": "T25n1509_002:0073c06_13"
    },
    {
        "source_sentence": "　　能滿諸觀者，　　令得第一樂，",
        "translation": "Those who can fulfill the contemplations Will cause them to attain the highest bliss.",
        "source": "T25n1509_002:0073c06_13"
    },
    {
        "source_sentence": "　　見之發淨信，　　必是一切智！」",
        "translation": "Seeing it gives rise to pure faith, which must be omniscience!",
        "source": "T25n1509_002:0073c06_13"
    },
    {
        "source_sentence": "進前覓佛，見坐樹下，狀似金山，如酥投火，其炎大明，有似融金，散竹林間上，紫金光色，視之無厭，心大歡喜，自相謂言：如是思惟已，禮佛而坐，問佛言：「放牛人有幾法成就，能令牛群番息？",
        "translation": "He approached the Buddha and saw that he was seated under a tree, resembling a mountain of gold, shaped like butter thrown into a fire. It was as bright as molten gold scattered in the middle of a bamboo forest, shining with the color of purplish-gold. Looking at him without tire, they were overjoyed. They said to each other: Having thought thus, we venerated the",
        "source": "T25n1509_002:0073c06_13"
    },
    {
        "source_sentence": "有幾法不成就，令牛群不增、不得安隱？」",
        "translation": "How many things are not accomplished that cause the herd of cattle to not increase and become uncomfortable?",
        "source": "T25n1509_002:0074a03_14"
    },
    {
        "source_sentence": "佛答言：「有十一法，放牛人能令牛群番息。",
        "translation": "The Buddha answered, There are 11 things that a cowherd can do to calm the herding of cattle.",
        "source": "T25n1509_002:0074a04_15"
    },
    {
        "source_sentence": "何等十一？",
        "translation": "What are the eleven?",
        "source": "T25n1509_002:0074a05_16"
    },
    {
        "source_sentence": "知色，知相，知刮刷，知覆瘡，知作煙，知好道，知牛所宜處，知好度濟，知安隱處，知留乳，知養牛主。",
        "translation": "They know form, they know characteristics, they know marks, they know scraping and brushing, they know covering sores, they know making smoke, they know good paths, they know where the cow is fit, they know how to save it, they know a peaceful place, they know keeping milk, they know feeding the owner of the cow.",
        "source": "T25n1509_002:0074a05_17"
    },
    {
        "source_sentence": "若放牛人知此十一法，能令牛群番息；",
        "translation": "If a herdingherd knows these eleven things, he can cause the herd to stop beating.",
        "source": "T25n1509_002:0074a08_18"
    },
    {
        "source_sentence": "比丘亦如是，知十一法能增長善法。",
        "translation": "A monk is likewise, knowing that 11 things can grow good qualities.",
        "source": "T25n1509_002:0074a09_19"
    },
    {
        "source_sentence": "「云何知色？",
        "translation": "What is knowledge of form?",
        "source": "T25n1509_002:0074a10_20"
    },
    {
        "source_sentence": "知黑、白、雜色；",
        "translation": "They know black, white, and mixed colors.",
        "source": "T25n1509_002:0074a10_21"
    },
    {
        "source_sentence": "比丘亦如是，知一切色皆是四大，四大造。",
        "translation": "Similarly, a monk knows that all forms are created by the four elements.",
        "source": "T25n1509_002:0074a10_22"
    },
    {
        "source_sentence": "「云何知相？",
        "translation": "What are the characteristics of knowing?",
        "source": "T25n1509_002:0074a11_23"
    },
    {
        "source_sentence": "知牛吉不吉相，與他群合，因相則識；",
        "translation": "They know the signs of auspicious and inauspicious omens for cattle, and they associate with others. The causal signs make them conscious.",
        "source": "T25n1509_002:0074a11_24"
    },
    {
        "source_sentence": "比丘亦如是，見善業相，知是智人；",
        "translation": "In the same way, a monk sees the marks of good karma and knows he is a wise person.",
        "source": "T25n1509_002:0074a12_25"
    },
    {
        "source_sentence": "見惡業相，知是愚人。",
        "translation": "Seeing the signs of bad actions, he knows he's a fool.",
        "source": "T25n1509_002:0074a13_26"
    },
    {
        "source_sentence": "「云何刮刷？",
        "translation": "What's scraping?",
        "source": "T25n1509_002:0074a14_27"
    },
    {
        "source_sentence": "為諸虫飲血則增長諸瘡，刮刷則除害；",
        "translation": "If you drink blood for the sake of insects, your sores will grow; if you scrape and brush it away, you’ll be freed from harm.",
        "source": "T25n1509_002:0074a14_28"
    },
    {
        "source_sentence": "比丘亦如是，惡邪覺觀虫飲善根血，增長心瘡，除則安隱。",
        "translation": "A monk is likewise, observing insects with bad and wrong feelings who drink the blood of good roots from worms that grow sores in their hearts, and when they remove them, they're comfortable.",
        "source": "T25n1509_002:0074a15_29"
    },
    {
        "source_sentence": "「云何覆瘡？",
        "translation": "What's covered sores?",
        "source": "T25n1509_002:0074a16_30"
    },
    {
        "source_sentence": "若衣若草葉以防蚊虻惡刺；",
        "translation": "It is covered with cloth and leaves to prevent mosquitoes and gadflies from attacking it.",
        "source": "T25n1509_002:0074a17_31"
    },
    {
        "source_sentence": "比丘亦如是，念正觀法，覆六情瘡，不令煩惱貪欲、瞋恚惡虫刺蕀所傷。",
        "translation": "Similarly, a monk who is mindful of the right method of contemplation covers the sores of the six emotions and doesn't allow them to be inflicted by afflictions, greed, desire, anger, bad insects, thorns, and abscesses.",
        "source": "T25n1509_002:0074a17_32"
    },
    {
        "source_sentence": "「云何知作煙？",
        "translation": "How do we know that it creates smoke?",
        "source": "T25n1509_002:0074a19_33"
    },
    {
        "source_sentence": "除諸蚊虻，牛遙見煙則來趣向屋舍。",
        "translation": "Aside from the gnats and gadflies, when the cow saw the smoke from a distance, it came heading for the house.",
        "source": "T25n1509_002:0074a20_0"
    },
    {
        "source_sentence": "比丘亦如是，如所聞而說，除諸結使蚊虻，以說法煙引眾生入於無我實相空舍中。",
        "translation": "The monk is likewise, explaining as he's heard, removing the bonds and tendencies of mosquitoes and gadflies, teaching the smoke that leads sentient beings into the abode of emptiness without self in terms of its true characteristics.",
        "source": "T25n1509_002:0074a20_1"
    },
    {
        "source_sentence": "「云何知道？",
        "translation": "“How do we know?",
        "source": "T25n1509_002:0074a23_0"
    },
    {
        "source_sentence": "知牛所行來去好惡道；",
        "translation": "They know the good and bad destinies of the cow’s movements.",
        "source": "T25n1509_002:0074a23_1"
    },
    {
        "source_sentence": "比丘亦如是，知八聖道能至涅槃，離斷常惡道。",
        "translation": "A monk is likewise, knowing the eight noble paths that lead to nirvāṇa and being free of the bad path of ending permanence.",
        "source": "T25n1509_002:0074a23_2"
    },
    {
        "source_sentence": "「云何知牛所宜處？",
        "translation": "How do we know the proper place for an ox?",
        "source": "T25n1509_002:0074a24_3"
    },
    {
        "source_sentence": "能令牛番息少病；",
        "translation": "He was able to cause the cow’s quarters to be calmed and less painful.",
        "source": "T25n1509_002:0074a25_4"
    },
    {
        "source_sentence": "比丘亦如是，說佛法時，得清淨法喜，諸善根增盛。",
        "translation": "Similarly, when a monk teaches the Buddha's teaching, he attains the joy of pure dharmas and increases his good roots.",
        "source": "T25n1509_002:0074a25_5"
    },
    {
        "source_sentence": "「云何知濟？",
        "translation": "What's knowing and relieving?",
        "source": "T25n1509_002:0074a27_0"
    },
    {
        "source_sentence": "知易入易度無波浪惡虫處；",
        "translation": "They know that it is easy to enter, easy to cross, and not a place of waves or bad insects.",
        "source": "T25n1509_002:0074a27_1"
    },
    {
        "source_sentence": "比丘亦如是，能至多聞比丘所問法。",
        "translation": "A monk is likewise, who can go to a well-versed monk and ask about the teaching.",
        "source": "T25n1509_002:0074a28_0"
    },
    {
        "source_sentence": "說法者知前人心利鈍、煩惱輕重，令入好濟，安隱得度。",
        "translation": "The Dharma preacher knows the strength and weakness of his former mind and the seriousness of his afflictions, so he causes them to enter into good salvation and attain liberation in peace.",
        "source": "T25n1509_002:0074a28_1"
    },
    {
        "source_sentence": "「云何知安隱處？",
        "translation": "“How do we know the peaceful abode?",
        "source": "T25n1509_002:0074b01_2"
    },
    {
        "source_sentence": "知所住處無虎、狼、師子、惡虫、毒獸；",
        "translation": "They know where they live: there are no tigers, wolves, lions, bad insects, or poisonous animals.",
        "source": "T25n1509_002:0074b01_3"
    },
    {
        "source_sentence": "比丘亦如是，知四念處安隱，無煩惱、惡魔、毒獸，比丘入此，則安隱無患。",
        "translation": "Similarly, a monk knows that the four abodes of mindfulness are peaceful and free of afflictions, bad demons, and poisonous animals. If a monk enters them, he’ll be peaceful and without trouble.",
        "source": "T25n1509_002:0074b02_4"
    },
    {
        "source_sentence": "「云何留乳？",
        "translation": "How do you store milk?",
        "source": "T25n1509_002:0074b04_0"
    },
    {
        "source_sentence": "犢母愛念犢子故與乳，以留殘乳故犢母歡喜，則犢子不竭，牛主及放牛人，日日有益；",
        "translation": "The Vātsīputrīya’s mother gave her milk out of affection for the Vātsīputrīya. Because she stored the milk left behind, the Vātsīputrīya was delighted. Then the Vātsīputrīya did not run out. The owner of the cow and the herding cowherd were benefited day after day.",
        "source": "T25n1509_002:0074b04_1"
    },
    {
        "source_sentence": "比丘亦如是，居士白衣給施衣食，當知節量，不令罄竭，則檀越歡喜，信心不絕，受者無乏。",
        "translation": "Similarly, a monk who gives food and clothing to a layman in white robes should know moderation so that he doesn't let it run out. Then the donor is delighted, his faith doesn't stop, and there's no lack of those who receive it.",
        "source": "T25n1509_002:0074b06_2"
    },
    {
        "source_sentence": "「云何知養牛主？",
        "translation": "How do we know the owner of the cowherd?",
        "source": "T25n1509_002:0074b08_3"
    },
    {
        "source_sentence": "諸大特牛能守牛群故，應養護，不令羸瘦，飲以麻油，飾以瓔珞，標以鐵角，摩刷、讚譽稱等；",
        "translation": "The great special cattle are able to protect the herd of cows. They should be nurtured and protected so that they do not grow weak. They drink sesame oil, adorn themselves with necklaces, mark their bodies with iron horns, stroke their brushes, praiseworthy words, etc.",
        "source": "T25n1509_002:0074b08_4"
    },
    {
        "source_sentence": "比丘亦如是，眾僧中有威德大人，護益佛法，摧伏外道，能令八眾得種諸善根，隨其所宜恭敬供養等。」",
        "translation": "Similarly, monks, there are authoritative great men in the saṃgha who protect the Buddha's teachings, subdue non-Buddhists, cause eight groups of people to plant good roots, venerate and make offerings according to their abilities.",
        "source": "T25n1509_002:0074b11_5"
    },
    {
        "source_sentence": "放牛人聞此語已，如是思惟：「我等所知不過三四事，放牛師輩遠不過五六事，今聞此說，歎未曾有！",
        "translation": "After hearing these words, the herding cattlemen thought, We know nothing more than three or four things, and we are far removed from the herding cattlemen by only five or six things. Now that we have heard these words, we marvel at how unprecedented it has been!",
        "source": "T25n1509_002:0074b13_6"
    },
    {
        "source_sentence": "若知此事，餘亦皆爾，實是一切智人，無復疑也。」",
        "translation": "If you know this matter, the rest are likewise, and they're really all people of omniscience, so there's no doubt about it.",
        "source": "T25n1509_002:0074b16_0"
    },
    {
        "source_sentence": "是經，此中應廣說。",
        "translation": "This sūtra should be explained in detail here.",
        "source": "T25n1509_002:0074b17_1"
    },
    {
        "source_sentence": "以是故，知有一切智人。",
        "translation": "Because of this, they know that there's a person of omniscience.",
        "source": "T25n1509_002:0074b17_2"
    },
    {
        "source_sentence": "問曰：世間不應有一切智人。",
        "translation": "Q: There shouldn't be a person of omniscience in the world.",
        "source": "T25n1509_002:0074b18_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_002:0074b18_4"
    },
    {
        "source_sentence": "無見一切智人者。",
        "translation": "There's no one who doesn't see all the wise people.",
        "source": "T25n1509_002:0074b19_0"
    },
    {
        "source_sentence": "答曰：不爾！",
        "translation": "Answer, No!",
        "source": "T25n1509_002:0074b19_1"
    },
    {
        "source_sentence": "不見有二種，不可以不見故便言無。",
        "translation": "There are two kinds of not seeing, and it can't be said to be nonexistent because it can't be seen.",
        "source": "T25n1509_002:0074b19_2"
    },
    {
        "source_sentence": "一者、事實有，以因緣覆故不見。",
        "translation": "1. The fact exists because it's obscured by causes and conditions, so it doesn't appear.",
        "source": "T25n1509_002:0074b20_3"
    },
    {
        "source_sentence": "譬如人姓族初，及雪山斤兩、恒河邊沙數，有而不可知。",
        "translation": "It's like the number of people and castes at the beginning, as well as the snowy mountain catty and the number of sands at the edge of the Ganges River that exist but can't be known.",
        "source": "T25n1509_002:0074b21_4"
    },
    {
        "source_sentence": "二者、實無，無故不見。",
        "translation": "2. It's really nonexistent, and it's not seen because it's nonexistent.",
        "source": "T25n1509_002:0074b22_5"
    },
    {
        "source_sentence": "譬如第二頭、第三手，無因緣覆而不見。",
        "translation": "It's like the second head and third hand that aren't seen without a cause or condition to cover it.",
        "source": "T25n1509_002:0074b23_6"
    },
    {
        "source_sentence": "如是一切智人，因緣覆故汝不見，非無一切智人。",
        "translation": "Thus, you don't see this person of omniscience because they're covered by causes and conditions, not someone who doesn't have omniscience.",
        "source": "T25n1509_002:0074b24_7"
    },
    {
        "source_sentence": "何等是覆因緣？",
        "translation": "What are the causes and conditions for obstruction?",
        "source": "T25n1509_002:0074b25_8"
    },
    {
        "source_sentence": "未得四信，心著惡邪；",
        "translation": "They do not have the four kinds of faith and are attached to evil in their minds.",
        "source": "T25n1509_002:0074b25_9"
    },
    {
        "source_sentence": "汝以是因緣覆故，不見一切智人。",
        "translation": "Because you're covered by these causes and conditions, you don't see the person of omniscience.",
        "source": "T25n1509_002:0074b26_10"
    },
    {
        "source_sentence": "問曰：所知處無量故，無一切智人。",
        "translation": "Q: Because the locus of knowing is immeasurable, there's no person with omniscience.",
        "source": "T25n1509_002:0074b27_11"
    },
    {
        "source_sentence": "諸法無量無邊，多人和合尚不能知，何況一人！",
        "translation": "The dharmas are immeasurable and limitless, and many people in harmony can't even know them, so why wouldn't one person?",
        "source": "T25n1509_002:0074b28_0"
    },
    {
        "source_sentence": "以是故，無一切智人！",
        "translation": "Because of this, there's no person of omniscience!",
        "source": "T25n1509_002:0074b29_1"
    },
    {
        "source_sentence": "答曰：如諸法無量，智慧亦無量無數無邊；",
        "translation": "Answer: Just as all things are immeasurable, so also knowledge and wisdom are immeasurable, countless, and boundless.",
        "source": "T25n1509_002:0074b29_2"
    },
    {
        "source_sentence": "如函大蓋亦大，函小蓋亦小。",
        "translation": "It's like a large container with a large lid that's also large and a small lid that's also small.",
        "source": "T25n1509_002:0074c01_3"
    },
    {
        "source_sentence": "問曰：佛自說佛法，不說餘經。",
        "translation": "Q: The Buddha himself explains the Buddha's teaching, but he doesn't explain the other sūtras.",
        "source": "T25n1509_002:0074c02_4"
    },
    {
        "source_sentence": "若藥方、星宿、算經世典，如是等法；",
        "translation": "Such things as the prescriptions for medicine, stars and constellations, calculations of scriptures and worldly books are all like this.",
        "source": "T25n1509_002:0074c03_5"
    },
    {
        "source_sentence": "若是一切智人，何以不說？",
        "translation": "If this is a person of omniscience, why don't you explain it?",
        "source": "T25n1509_002:0074c03_6"
    },
    {
        "source_sentence": "以是故，知非一切智人。",
        "translation": "Because of this, he knows that he's not a person of omniscience.",
        "source": "T25n1509_002:0074c04_7"
    },
    {
        "source_sentence": "答曰：雖知一切法，用故說，不用故不說；",
        "translation": "Answer: Although they know all dharmas, they are spoken of because of their function and not spoken of because of their non-use.",
        "source": "T25n1509_002:0074c05_8"
    },
    {
        "source_sentence": "有人問故說，不問故不說。",
        "translation": "Some people say it because they ask, but they don't say it because they don't ask.",
        "source": "T25n1509_002:0074c06_9"
    },
    {
        "source_sentence": "復次，一切法略說有三種：一者、有為法，二者、無為法，三者、不可說法，此已攝一切法。",
        "translation": "Furthermore, there are three kinds of all dharmas that are briefly explained: 1. conditioned dharmas, 2. unconditioned dharmas, and 3. ineffable dharmas. These have already included all dharmas.",
        "source": "T25n1509_002:0074c06_10"
    },
    {
        "source_sentence": "問曰：十四難不答故，知非一切智人。",
        "translation": "Q: It's because the fourteen difficult questions aren't answered, knowing that they aren't omniscience people.",
        "source": "T25n1509_002:0074c08_11"
    },
    {
        "source_sentence": "何等十四難？",
        "translation": "What are the fourteen difficulties?",
        "source": "T25n1509_002:0074c09_12"
    },
    {
        "source_sentence": "世界及我常，世界及我無常，世界及我亦有常亦無常，世界及我亦非有常亦非無常；",
        "translation": "World and self are permanent, world and self are impermanent; world and self are impermanent; world and self are also permanent and impermanent; world and self are neither permanent nor impermanent.",
        "source": "T25n1509_002:0074c09_13"
    },
    {
        "source_sentence": "世界及我有邊，無邊，亦有邊亦無邊，亦非有邊亦非無邊；",
        "translation": "World and self are finite and infinite, they are also finite and infinite. They are neither finite nor infinite.",
        "source": "T25n1509_002:0074c11_14"
    },
    {
        "source_sentence": "死後有神去後世，無神去後世，亦有神去亦無神去，死後亦非有神去亦非無神去後世；",
        "translation": "“After death, there will be a departure of consciousness in the afterlife and a departure without consciousness in the afterlife. There will also be a departure of consciousness in the afterlife and a departure without consciousness in the afterlife; neither there will be a departure without consciousness at death nor a departure without consciousness in the afterlife.",
        "source": "T25n1509_002:0074c13_15"
    },
    {
        "source_sentence": "是身、是神，身異、神異。",
        "translation": "It's body, it's spirit, and the body is different from the body and the spirit is different.",
        "source": "T25n1509_002:0074c15_16"
    },
    {
        "source_sentence": "若佛一切智人，此十四難何以不答？",
        "translation": "If the Buddha is a person of omniscience, why aren't these 14 difficulties answered?",
        "source": "T25n1509_002:0074c15_17"
    },
    {
        "source_sentence": "答曰：此事無實故不答。",
        "translation": "Answer: This matter is insubstantial, so I won't answer.",
        "source": "T25n1509_002:0074c16_18"
    },
    {
        "source_sentence": "諸法有常，無此理；",
        "translation": "The dharmas are eternal, but there is no such thing.",
        "source": "T25n1509_002:0074c17_19"
    },
    {
        "source_sentence": "諸法斷，亦無此理；",
        "translation": "Nor does this principle hold for the annihilation of all dharmas.",
        "source": "T25n1509_002:0074c17_20"
    },
    {
        "source_sentence": "以是故，佛不答。",
        "translation": "Because of this, the Buddha didn't answer.",
        "source": "T25n1509_002:0074c18_21"
    },
    {
        "source_sentence": "譬如人問搆牛角得幾升乳，是為非問，不應答。",
        "translation": "It's like a person who asks how many liters of milk he obtains from the horns of an ox when he harvests it, which is not a question and shouldn't be answered.",
        "source": "T25n1509_002:0074c18_22"
    },
    {
        "source_sentence": "復次，世界無窮，如車輪無初無後。",
        "translation": "Furthermore, the world has no limit, like a chariot wheel that has no beginning and no end.",
        "source": "T25n1509_002:0074c19_23"
    },
    {
        "source_sentence": "復次，答此無利有失，墮惡邪中。",
        "translation": "Furthermore, the answer is that there's neither benefit nor loss here, and they fall into bad error.",
        "source": "T25n1509_002:0074c20_24"
    },
    {
        "source_sentence": "佛知十四難，常覆四諦諸法實相。",
        "translation": "The Buddha knows that the fourteen difficulties always cover the true characteristics of dharmas in the four truths.",
        "source": "T25n1509_002:0074c21_25"
    },
    {
        "source_sentence": "如渡處有惡虫水，不應將人渡；",
        "translation": "Good man, it is like the case of a river where there are bad insect waters on the bridge and you should not cross over to that river.",
        "source": "T25n1509_002:0074c22_26"
    },
    {
        "source_sentence": "安隱無患處，可示人令渡。",
        "translation": "It's a place of peace and no trouble, so you can show people to make them cross.",
        "source": "T25n1509_002:0075a01_27"
    },
    {
        "source_sentence": "復次，有人言：是事非一切智人不能解，以人不能知，故佛不答。",
        "translation": "Furthermore, some people say that these things aren't something that people of omniscience can understand, and because people can't know them, the Buddha won't answer.",
        "source": "T25n1509_002:0075a01_28"
    },
    {
        "source_sentence": "復次，若人無言有，有言無，是名非一切智人；",
        "translation": "Furthermore, if a person does not speak of existence when there is nonexistence and does not speak of existence when there is nonexistence, this is called someone who is not omniscience.",
        "source": "T25n1509_002:0075a04_0"
    },
    {
        "source_sentence": "一切智人有言有，無言無。",
        "translation": "A person of omniscience has words that are existent and nothing that are nonexistent.",
        "source": "T25n1509_002:0075a05_1"
    },
    {
        "source_sentence": "佛有不言無，無不言有，但說諸法實相，云何不名一切智人？",
        "translation": "The Buddha has what he doesn't say is nonexistent, and there's nothing what he doesn't say is existent, but he only explains the true characteristics of dharmas, so why isn't he called a person of omniscience?",
        "source": "T25n1509_002:0075a05_2"
    },
    {
        "source_sentence": "譬如日不作高下，亦不作平地，等一而照；",
        "translation": "It is like when the sun does not make a rising or falling moon, and neither does it make a shining surface.",
        "source": "T25n1509_002:0075a07_3"
    },
    {
        "source_sentence": "佛亦如是，非令有作無，非令無作有，常說實智慧光照諸法。",
        "translation": "So it is with the Buddha, who doesn't cause existence to be done and nonexistence to be done, doesn't cause nonexistence to be done, and always explains that true wisdom illuminates all dharmas.",
        "source": "T25n1509_002:0075a08_4"
    },
    {
        "source_sentence": "如一道人問佛言：「大德！",
        "translation": "Suppose a fellow practitioner asked the Buddha, Mañjuśrī!",
        "source": "T25n1509_002:0075a09_5"
    },
    {
        "source_sentence": "十二因緣佛作耶？",
        "translation": "What are the twelve causes and conditions for buddha-works?",
        "source": "T25n1509_002:0075a10_6"
    },
    {
        "source_sentence": "他作耶？」",
        "translation": "Do they do it for others?",
        "source": "T25n1509_002:0075a10_7"
    },
    {
        "source_sentence": "佛言：「我不作十二因緣，餘人亦不作。",
        "translation": "The Buddha said, I won't do these twelve causes and conditions, and the others won't do them either.",
        "source": "T25n1509_002:0075a10_8"
    },
    {
        "source_sentence": "有佛無佛，生因緣老死，是法常定住。」",
        "translation": "Whether there's a Buddha or no Buddha, birth is the cause of old age and death, and this is the Dharma that always abides in concentration.",
        "source": "T25n1509_002:0075a11_9"
    },
    {
        "source_sentence": "佛能說是生因緣老死，乃至無明因緣諸行。",
        "translation": "The Buddha can explain that birth is the cause and condition of old age and death, up to the causes and conditions of ignorance are the causes and conditions of conditioned formations.",
        "source": "T25n1509_002:0075a12_10"
    },
    {
        "source_sentence": "復次，十四難中若答有過罪。",
        "translation": "Furthermore, in the fourteen difficulties, there's a mistake in answering questions.",
        "source": "T25n1509_002:0075a13_11"
    },
    {
        "source_sentence": "若人問：「石女、黃門兒，長短好醜何類？」",
        "translation": "Suppose someone asks, What's the length of a stone-maiden or yellow-gate child that's beautiful and ugly?",
        "source": "T25n1509_002:0075a14_12"
    },
    {
        "source_sentence": "此不應答，以無兒故。",
        "translation": "This shouldn't be answered because there are no children.",
        "source": "T25n1509_002:0075a15_13"
    },
    {
        "source_sentence": "復次，此十四難，是邪見非真實；",
        "translation": "Furthermore, these fourteen objections are false views and not true theories.",
        "source": "T25n1509_002:0075a15_14"
    },
    {
        "source_sentence": "佛常以真實，以是故，置不答。",
        "translation": "Because the Buddha always uses reality, it's because of this that he doesn't answer.",
        "source": "T25n1509_002:0075a16_15"
    },
    {
        "source_sentence": "復次，置不答，是為答。",
        "translation": "Furthermore, if someone doesn't answer it, this is an answer.",
        "source": "T25n1509_002:0075a17_16"
    },
    {
        "source_sentence": "有四種答：一、決了答，如佛第一涅槃安隱；",
        "translation": "There are four kinds of answer:",
        "source": "T25n1509_002:0075a17_17"
    },
    {
        "source_sentence": "二、解義答；",
        "translation": "Answer on Understanding Meaning.",
        "source": "T25n1509_002:0075a18_18"
    },
    {
        "source_sentence": "三、反問答；",
        "translation": "The third is to question and answer in reverse.",
        "source": "T25n1509_002:0075a18_19"
    },
    {
        "source_sentence": "四、置答。",
        "translation": "Fourth, he answers with a question.",
        "source": "T25n1509_002:0075a19_20"
    },
    {
        "source_sentence": "此中佛以置答。",
        "translation": "Here, the Buddha answers by placing it here.",
        "source": "T25n1509_002:0075a19_21"
    },
    {
        "source_sentence": "汝言無一切智人，有是言而無義，是大妄語。",
        "translation": "You say there's no person of omniscience who speaks this way but has no meaning, which is a great false statement.",
        "source": "T25n1509_002:0075a19_22"
    },
    {
        "source_sentence": "實有一切智人。",
        "translation": "There really is a person of omniscience.",
        "source": "T25n1509_002:0075a20_23"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_002:0075a21_24"
    },
    {
        "source_sentence": "得十力故：知處非處故，知因緣業報故，知諸禪定解脫故，知眾生根善惡故，知種種欲解故，知種種世間無量性故，知一切至處道故，先世行處憶念知故，天眼分明得故，知一切漏盡故；",
        "translation": "They attain ten powers: because they know where to go and where not to go; because they know the causes and consequences of action; because they know the liberations of meditation; because they know the roots of goodness and evil of sentient beings; because they know all kinds of desires and understandings; because they know the various worlds are immeasurable by nature; because they know the paths leading everywhere; because they",
        "source": "T25n1509_002:0075a21_25"
    },
    {
        "source_sentence": "淨不淨分明知故，說一切世界中上法故，得甘露味故，得中道故，知一切法若有為、若無為實相故，永離三界欲故。",
        "translation": "Because they clearly know the distinctive characteristics of purity and impurity, because they explain the higher dharmas in all worlds, because they attain the taste of ambrosia, because they attain the middle way, because they know that all dharmas are conditioned and unconditioned in their true characteristics, and because they are permanently free of the desires of the three realms.",
        "source": "T25n1509_002:0075a26_0"
    },
    {
        "source_sentence": "如是種種因緣故，佛為一切智人。",
        "translation": "Because of these various causes and conditions, the Buddha is a man of omniscience.",
        "source": "T25n1509_002:0075a28_1"
    },
    {
        "source_sentence": "問曰：有一切智人，何等人是？",
        "translation": "Q: Who are the people of omniscience, and who are they?",
        "source": "T25n1509_002:0075a29_2"
    },
    {
        "source_sentence": "答曰：是第一大人，三界尊，名曰佛。",
        "translation": "Answer: This is the first great person, the honored one of the three realms, named Buddha.",
        "source": "T25n1509_002:0075b01_3"
    },
    {
        "source_sentence": "　「頂生轉輪王，　　如日月燈明；",
        "translation": "At the top of their heads are born wheel-turning kings, Like the sun and moon shining brightly.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　釋迦貴種族，　　淨飯王太子。",
        "translation": "The noble clan of Śākyamuni is the prince of King Jīvaka.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　生時動三千，　　須彌山海水；",
        "translation": "At the moment of arising, it moves 3,000 times: Mount Sumeru’s ocean water.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　為破老病死，　　哀愍故生世。",
        "translation": "In order to destroy old age, sickness, and death, he's born in the world out of pity.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　生時行七步，　　光明滿十方；",
        "translation": "When he was born, he walked seven paces, Filling the ten directions with light.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　四觀發大音，　　我生胎分盡。",
        "translation": "The fourth contemplation gives forth a great sound, saying, I'll be born in the womb at the end of my portion.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　成佛說妙法，　　大音振法鼓；",
        "translation": "At the attainment of buddhahood they expound the sublime Teaching, The great voice playing the drum of truth.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　以此覺眾生，　　世間無明睡。",
        "translation": "Because of this, they awaken sentient beings to the world's ignorance and drowsiness.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　如是等種種，　　希有事已現；",
        "translation": "Such and such various rare things have already been manifested.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　諸天及世人，　　見之皆歡喜！",
        "translation": "All the gods and humans, seeing it, rejoiced.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　佛相莊嚴身，　　大光滿月面；",
        "translation": "The Buddha’s body adorned with the marks of greatness, A ray of light filling the face of the moon.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　一切諸男女，　　視之無厭足！",
        "translation": "All the men and women Will never tire of looking at him.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　生身乳餔力，　　勝萬億香象；",
        "translation": "The power of the embryo is greater than that of a myriad-thousand koṭis of fragrant elephants.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　神足力無上，　　智慧力無量。",
        "translation": "The power of mystic feet is unexcelled, The power of knowledge immeasurable.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　佛身大光明，　　照曜佛身表；",
        "translation": "The great ray of light from the Buddha’s body Illumines the surface of the Buddha’s body.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　佛在光明中，　　如月在光裏。",
        "translation": "The Buddha is in the light, Just as the moon is in the light.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　種種惡毀佛，　　佛亦無惡想；",
        "translation": "Various kinds of evil disparage the Buddha: The Buddha also has no evil thoughts.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　種種稱譽佛，　　佛亦無憙想。",
        "translation": "Various kinds of praise are given to the Buddha, and the Buddha also has no thoughts of anger.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　大慈視一切，　　怨親等無異；",
        "translation": "Great compassion looks out for all, Equal to enemies and friends.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　一切有識類，　　咸皆知此事。",
        "translation": "All kinds of conscious beings Know this.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　忍辱慈悲力，　　故能勝一切；",
        "translation": "Because of the power of forbearance, kindness, compassion, and pity They can overcome all.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　為度眾生故，　　世世受勤苦。",
        "translation": "For the sake of liberating sentient beings, they experience hardship and suffering from generation to generation.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　其心常一定，　　為眾作利益。",
        "translation": "Their minds are always fixed, And they work for the benefit of all.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　智慧力有十，　　無畏力有四，",
        "translation": "The power of wisdom has ten. The power of fearlessness four.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　不共有十八，　　無量功德藏。",
        "translation": "They don't share the eighteen, which are an immeasurable store of merit.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　如是等無數，　　希有功德力，",
        "translation": "Countless such things as these are rare and endowed with virtuous power.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　如師子無畏，　　破諸外道法，",
        "translation": "Like a lion’s fearlessness Destroying the teachings of heretics,",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "　　轉無上梵輪，　　度脫諸三界。」",
        "translation": "Turning the unsurpassed Brahma wheel, he liberates the three realms.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "如讚佛偈說：是名為婆伽婆。",
        "translation": "As a verse praising the Buddha says, This is called a Bhagavān.",
        "source": "T25n1509_002:0075b02_4"
    },
    {
        "source_sentence": "婆伽婆義無量，若廣說則廢餘事，以是故略說。",
        "translation": "The meaning of bhagavat is immeasurable. If it were spoken of elaborately, the other matters would be abandoned. That is why it is spoken of briefly.",
        "source": "T25n1509_002:0075c02_5"
    },
    {
        "source_sentence": "大智度論卷第二",
        "translation": "Dazhiduo lun, vol. 2",
        "source": "T25n1509_002:0075c04_0"
    }
]