[
    {
        "source_sentence": "大智度論釋幻人聽法品第二十",
        "translation": "Dazhiduo lun explains that the illusory person listens to the Dharma, chapter 20",
        "source": "T25n1509_055:0448c07_0"
    },
    {
        "source_sentence": "八(卷五十五)",
        "translation": "8. (Skt. fifty-five)",
        "source": "T25n1509_055:0448c08_0"
    },
    {
        "source_sentence": "聖者龍樹造",
        "translation": "created by the sage named dragon tree",
        "source": "T25n1509_055:0448c10_0"
    },
    {
        "source_sentence": "後秦龜茲國三藏鳩摩羅什譯",
        "translation": "Translated by Kumārajīva, a translator of the Tripiṭaka of the country of Kucha in the Later Qin",
        "source": "T25n1509_055:0448c11_0"
    },
    {
        "source_sentence": "【經】爾時，諸天子心念：「應用何等人聽須菩提所說？」",
        "translation": "[Sutra] At that point, the celestial beings thought to themselves, Who will listen to what Suppository of Enlightenment teaches?",
        "source": "T25n1509_055:0448c12_0"
    },
    {
        "source_sentence": "須菩提知諸天子心所念，語諸天子言：「如幻化人聽法，我應用如是人。",
        "translation": "Knowing what the celestial beings thought, Suppository said to the celestial beings, Like an illusion that transforms people and listens to the Dharma, I'll use such a person.",
        "source": "T25n1509_055:0448c13_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0448c14_2"
    },
    {
        "source_sentence": "如是人無聞、無聽、無知、無證故。」",
        "translation": "Such a person has no hearing, no listening, no knowing, and no realization.",
        "source": "T25n1509_055:0448c14_3"
    },
    {
        "source_sentence": "諸天子語須菩提：「是眾生如幻、如化，聽法者亦如幻、如化耶？」",
        "translation": "The celestial beings said to Subhūti, Are these sentient beings illusory and like apparitions, and are those who hear the teaching illusory and like apparitions?",
        "source": "T25n1509_055:0448c15_4"
    },
    {
        "source_sentence": "「如是！",
        "translation": "“So it is!",
        "source": "T25n1509_055:0448c17_0"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T25n1509_055:0448c17_1"
    },
    {
        "source_sentence": "諸天子！",
        "translation": "“O gods!",
        "source": "T25n1509_055:0448c17_2"
    },
    {
        "source_sentence": "眾生如幻，聽法者亦如幻；",
        "translation": "Sentient beings are illusory, and those who hear the Teaching are also illusory.",
        "source": "T25n1509_055:0448c17_3"
    },
    {
        "source_sentence": "眾生如化，聽法者亦如化。",
        "translation": "Sentient beings are like phantoms, and those who hear the Dharma are like phantoms.",
        "source": "T25n1509_055:0448c18_0"
    },
    {
        "source_sentence": "諸天子！",
        "translation": "“O gods!",
        "source": "T25n1509_055:0448c18_1"
    },
    {
        "source_sentence": "我如幻、如夢，眾生乃至知者、見者亦如幻、如夢。",
        "translation": "The self is like an illusion or a dream, and sentient beings who know and see it are also like an illusion or a dream.",
        "source": "T25n1509_055:0448c18_2"
    },
    {
        "source_sentence": "諸天子！",
        "translation": "“O gods!",
        "source": "T25n1509_055:0448c19_3"
    },
    {
        "source_sentence": "色如幻、如夢，受、想、行、識如幻、如夢。",
        "translation": "Form is like an illusion or a dream, and feeling, perception, volition, and consciousness are like an illusion or a dream.",
        "source": "T25n1509_055:0448c20_0"
    },
    {
        "source_sentence": "「眼乃至意觸因緣生受如幻、如夢，內空乃至無法有法空、檀波羅蜜乃至般若波羅蜜如幻、如夢。",
        "translation": "The eye and even the sensation that arises from the causes and conditions of mental contact as illusory and as a dream, internal emptiness up to the emptiness of dharmas that don't exist, the sandalwood perfection or even the prajñāpāramitā as illusory and as a dream.",
        "source": "T25n1509_055:0448c20_1"
    },
    {
        "source_sentence": "諸天子！",
        "translation": "“O gods!",
        "source": "T25n1509_055:0448c22_2"
    },
    {
        "source_sentence": "四念處乃至十八不共法如幻、如夢，須陀洹果如幻、如夢，斯陀含果、阿那含果、阿羅漢果、辟支佛道如幻、如夢。",
        "translation": "The four abodes of mindfulness up to the 18 distinctive qualities are illusory and like a dream, the fruit of stream entry is illusory and like a dream, the fruit of once-returning, the fruit of non-returning, the fruit of arhatship, and the path of the pratyekabuddhas are illusory and like a dream.",
        "source": "T25n1509_055:0449a01_3"
    },
    {
        "source_sentence": "諸天子！",
        "translation": "“O gods!",
        "source": "T25n1509_055:0449a03_4"
    },
    {
        "source_sentence": "佛道如幻、如夢。」",
        "translation": "The Buddha Way is like an illusion or a dream.",
        "source": "T25n1509_055:0449a03_5"
    },
    {
        "source_sentence": "爾時，諸天子問須菩提：「汝說佛道如幻、如夢，汝說涅槃亦復如幻、如夢耶？」",
        "translation": "It was then that the celestial beings asked Subhūti, Do you say that the Buddha Way is illusory and like a dream or that nirvāṇa is also illusory and like a dream?",
        "source": "T25n1509_055:0449a04_6"
    },
    {
        "source_sentence": "須菩提語諸天子：「我說佛道如幻、如夢，我說涅槃亦如幻、如夢；",
        "translation": "Suppository of enlightenment said to the celestial beings: I teach that the path of buddhahood is like a magic trick or a dream, but I teach that nirvana is also like a magic trick or a dream.",
        "source": "T25n1509_055:0449a05_7"
    },
    {
        "source_sentence": "若當有法勝於涅槃者，我說亦復如幻、如夢。",
        "translation": "If there's a teaching that's superior to nirvāṇa, I say it's like an illusion or a dream.",
        "source": "T25n1509_055:0449a07_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0449a08_9"
    },
    {
        "source_sentence": "諸天子！",
        "translation": "“O gods!",
        "source": "T25n1509_055:0449a08_10"
    },
    {
        "source_sentence": "是幻、夢、涅槃，不二不別。」",
        "translation": "These are illusions, dreams, and nirvāṇa, which are neither two nor distinct.",
        "source": "T25n1509_055:0449a08_11"
    },
    {
        "source_sentence": "【論】問曰：上已說「如幻、如夢，無說者、無聽者」，今何以故復問「應用何等人隨須菩提意聽法者」？",
        "translation": "[Commentary] Q: As explained above, it's like an illusion or a dream, there's no speaker and no listener, so why is it that he now asks again, Who are the people who follow the mind of enlightenment and listen to the teaching?",
        "source": "T25n1509_055:0449a10_0"
    },
    {
        "source_sentence": "答曰：諸天子先言「須菩提所說不可解」，此中須菩提說幻化人喻。",
        "translation": "Answer: The gods first said, What Suppositories of enlightenment teach can't be understood, and here Suppositories of enlightenment teach the metaphor of illusory transformation people.",
        "source": "T25n1509_055:0449a12_1"
    },
    {
        "source_sentence": "今諸天子更作是念：「何等人聽，與須菩提所說相應，能信、受、行、得道果？」",
        "translation": "Now, the celestial beings further thought, Who will listen to what Suppository of enlightenment teaches and be able to believe, receive, practice, and attain the fruit of the path?",
        "source": "T25n1509_055:0449a13_2"
    },
    {
        "source_sentence": "須菩提答：「如幻化人聽者，則與我說法相應。」",
        "translation": "Suppository answered, Like an illusion that transforms people who hear it, it's associated with my teaching.",
        "source": "T25n1509_055:0449a15_3"
    },
    {
        "source_sentence": "問曰：是化人無心心數法，不能聽受，何用說法？",
        "translation": "Q: This is a teaching that transforms people without mind and mental factors who can't hear it, so why should they teach it?",
        "source": "T25n1509_055:0449a16_4"
    },
    {
        "source_sentence": "答曰：非即使幻化人聽，但欲令行者於諸法用心無所著，如幻化人，是幻化人無聞亦無證。",
        "translation": "Answer: It's not that even if an illusory transformation person listens, but wants to cause practitioners to have no attachment in their minds to the teachings, like an illusory transformation person, this is an illusory transformation person who doesn't hear and doesn't realize them.",
        "source": "T25n1509_055:0449a17_5"
    },
    {
        "source_sentence": "眾生如幻、如夢，聽法亦如幻、如夢——「眾生」者說法人，「聽法」者是受法人。",
        "translation": "Sentient beings are like illusions and dreams, and listening to the teaching is also like illusions and dreams - sentient beings refers to those who teach the Dharma, and listening to the teaching refers to those who receive it.",
        "source": "T25n1509_055:0449a20_6"
    },
    {
        "source_sentence": "須菩提言：「不但說法者、聽法者如幻、如夢，我乃至知者、見者皆如幻、如夢，色亦如幻、如夢，乃至涅槃如幻、如夢，即是所說法如幻、如夢。」",
        "translation": "Suppository said, Not only are those who teach the Dharma and those who hear the teaching illusory and like dreams, but I, even those who know and see it, are illusory and like dreams, and form is illusory and like dreams, and even nirvāṇa is illusory and like a dream, which is to say that what's taught is illusory and like a dream.",
        "source": "T25n1509_055:0449a21_7"
    },
    {
        "source_sentence": "一切眾生中，佛為第一；",
        "translation": "Among all sentient beings the Buddha is foremost.",
        "source": "T25n1509_055:0449a24_8"
    },
    {
        "source_sentence": "一切諸法中，涅槃第一。",
        "translation": "Among all dharmas, nirvāṇa is the first.",
        "source": "T25n1509_055:0449a25_9"
    },
    {
        "source_sentence": "聞是二事如幻、如夢，心則驚疑：「佛及涅槃最上最妙，云何如幻、如夢？」",
        "translation": "When he heard that these two things were illusory and like dreams, his mind was startled and wondered, How are the buddhas and nirvāṇa the most supreme and most marvelous, such as illusory and dreamlike?",
        "source": "T25n1509_055:0449a25_10"
    },
    {
        "source_sentence": "以是故，更重問其事：「佛及涅槃審如幻、如夢耶？」",
        "translation": "Because of this, he asked again and again about it, Do the Buddha and nirvāṇa judge them to be illusory or dreamlike?",
        "source": "T25n1509_055:0449a27_11"
    },
    {
        "source_sentence": "「須菩提將無誤說？",
        "translation": "Suppose there's no mistake in what you say about enlightenment?",
        "source": "T25n1509_055:0449a28_12"
    },
    {
        "source_sentence": "我等將無謬聽？」",
        "translation": "Will we not hear wrongly?",
        "source": "T25n1509_055:0449a28_13"
    },
    {
        "source_sentence": "是以更定問。",
        "translation": "That's why it's asked with greater certainty.",
        "source": "T25n1509_055:0449a29_14"
    },
    {
        "source_sentence": "須菩提語諸天子：「我說佛及涅槃，正自如幻、如夢。」",
        "translation": "Suppository said to the celestial beings, I teach that buddhas and nirvāṇa are precisely illusory and dreamlike.",
        "source": "T25n1509_055:0449a29_15"
    },
    {
        "source_sentence": "是二法雖妙，皆從虛妄法出故空。",
        "translation": "Although these two dharmas are marvelous, they all come from false dharmas that give rise to old emptiness.",
        "source": "T25n1509_055:0449b01_16"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_055:0449b02_17"
    },
    {
        "source_sentence": "從虛妄法故有涅槃，從福德智慧故有佛，是二法屬因緣，無有實定；",
        "translation": "Because of false dharmas there is nirvana, and because of virtue and wisdom there is buddhahood. These two things belong to causes and conditions; there is no real equipoise.",
        "source": "T25n1509_055:0449b02_18"
    },
    {
        "source_sentence": "如念佛、念法義中說。",
        "translation": "It's as explained in the meaning of mindfulness of the Buddha and mindfulness of the Dharma.",
        "source": "T25n1509_055:0449b04_19"
    },
    {
        "source_sentence": "須菩提作是念：「般若波羅蜜力，假令有法勝涅槃者，能令如幻，何況涅槃！」",
        "translation": "Suppository had this thought, The power of prajñā-pāramitā is that if there's a dharma superior to nirvāṇa, it can make it illusory, so why wouldn't it be nirvāṇa?",
        "source": "T25n1509_055:0449b04_20"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0449b06_21"
    },
    {
        "source_sentence": "涅槃，一切憂愁苦惱畢竟滅，以是故，無有法勝涅槃者。",
        "translation": "Because nirvana is the final cessation of all sorrow and suffering, there's no dharma that surpasses nirvāṇa.",
        "source": "T25n1509_055:0449b06_22"
    },
    {
        "source_sentence": "問曰：若無法勝涅槃者，何以故說「若有法勝涅槃，亦復如幻」？",
        "translation": "Q: If there's no superior nirvāṇa, why is it said that if there are dharmas that are superior to nirvāṇa, they're also illusory?",
        "source": "T25n1509_055:0449b07_23"
    },
    {
        "source_sentence": "答曰：譬喻法，或以實事、或時假設，隨因緣故說。",
        "translation": "Answer: An analogy is a teaching that's either based on real things or nominally established at the time, and it's explained according to causes and conditions.",
        "source": "T25n1509_055:0449b09_24"
    },
    {
        "source_sentence": "如佛言：「若令樹木解我所說者，我亦記言得須陀洹。」",
        "translation": "As the Buddha said, If I cause a tree to understand what I teach, I'll also record it as attaining stream entry.",
        "source": "T25n1509_055:0449b10_25"
    },
    {
        "source_sentence": "但樹木無因緣可解，佛為解悟人意故，引此喻耳。",
        "translation": "But there are no causes and conditions for trees to be understood, so the Buddha cites this metaphor in order to understand people's minds.",
        "source": "T25n1509_055:0449b11_26"
    },
    {
        "source_sentence": "涅槃是一切法中究竟無上法，如眾川萬流大海為上，諸山之中須彌為上，一切法中虛空為上。",
        "translation": "Nirvāṇa is the ultimate and unsurpassed dharma among all dharmas, like the great ocean of myriad rivers and streams in the mountains being the highest, Mount Sumeru being the highest among mountains, and space being the highest among all dharmas.",
        "source": "T25n1509_055:0449b12_27"
    },
    {
        "source_sentence": "涅槃亦如是，無有老病死苦，無有邪見、貪、恚等諸衰，無有愛別離苦，無怨憎會苦，無所求不得苦，無常、虛誑、敗壞、變異等一切皆無。",
        "translation": "Similarly, nirvāṇa has no suffering of old age, illness, death, wrong views, craving, anger, and other decays, no suffering of separation from what's loved, no suffering of association with what's disliked, no suffering of not getting what's desired, no suffering of impermanence, falsehood, decay, change, and so forth, and nothing at all.",
        "source": "T25n1509_055:0449b15_28"
    },
    {
        "source_sentence": "以要言之，涅槃是一切苦盡，畢竟常樂，十方諸佛、菩薩、弟子眾所歸處，安隱常樂，無過是者，終不為魔王、魔人所破。",
        "translation": "To sum up, nirvāṇa is the cessation of all suffering and ultimately eternal bliss. The buddhas, bodhisattvas, and disciples of the ten directions take refuge in peace and eternal bliss wherever they are. There is nothing wrong with this, for it will never be destroyed by Māra King or anyone else like him.",
        "source": "T25n1509_055:0449b18_29"
    },
    {
        "source_sentence": "如阿毘曇中說：「有上法者，一切有為法及虛空、非智緣盡；",
        "translation": "As has been said in the Abhidharma: “The highest factor is that all conditioned factors, space and non-cognisance are extinguished as supporting object.",
        "source": "T25n1509_055:0449b21_0"
    },
    {
        "source_sentence": "無上法者，智緣盡，所謂涅槃。」",
        "translation": "The unsurpassed dharma is the exhaustion of cognition as a condition, which is called nirvāṇa.",
        "source": "T25n1509_055:0449b22_1"
    },
    {
        "source_sentence": "是故知無法勝涅槃者。",
        "translation": "Therefore, it's known that there's no superior nirvāṇa.",
        "source": "T25n1509_055:0449b23_0"
    },
    {
        "source_sentence": "須菩提美般若波羅蜜力大故言：「若有法勝涅槃者，是亦如幻。」",
        "translation": "Suppositories of enlightenment praise the great power of the perfection of wisdom because they say, If there's a dharma that's superior to nirvāṇa, it's also illusory.",
        "source": "T25n1509_055:0449b23_1"
    },
    {
        "source_sentence": "譬如大熱鐵丸，以著擘起毳上，直燒下過，熱勢無損，但更無可燒者；",
        "translation": "Good man, it is analogous to the case of a great hot iron ball that one picks up and crushes with the power of heat but there is no more thing to burn.",
        "source": "T25n1509_055:0449b25_2"
    },
    {
        "source_sentence": "般若波羅蜜智慧破一切有法，乃至涅槃，直過無礙，智力不減，直更無法可破。",
        "translation": "The wisdom of prajñā-pāramitā destroys all existent dharmas, up to nirvāṇa, directly transcends them without obstruction, doesn't decrease in the power of knowledge, and there's nothing that can be destroyed.",
        "source": "T25n1509_055:0449b26_3"
    },
    {
        "source_sentence": "是故言「設有法勝涅槃，智慧力亦能破。」",
        "translation": "Therefore, it's said, If there's a superior nirvāṇa in terms of dharmas, the power of wisdom can also break it down.",
        "source": "T25n1509_055:0449b28_4"
    },
    {
        "source_sentence": "【經】爾時，慧命舍利弗、摩訶目揵連、摩訶拘絺羅、摩訶迦旃延、富樓那彌多羅尼子、摩訶迦葉及無數千菩薩問須菩提：「般若波羅蜜如是甚深、難見、難解、難知、寂滅、微妙，誰當受者？」",
        "translation": "[Sutra] At the time, Wisdom Life Śāriputra, Mahāmaudgalyāyana, Mahāmaudgalyāyana, Mahāmaudgalyāyana, Mahākāśyapa, Mahākāśyapa, and countless thousands of bodhisattvas asked Subhūti, Such is the profound, difficult to see, difficult to understand, difficult to know, quiescent, and subtle prajñāpār",
        "source": "T25n1509_055:0449c01_0"
    },
    {
        "source_sentence": "爾時，阿難語諸大弟子及諸菩薩：「阿鞞跋致諸菩薩摩訶薩，能受是甚深、難見、難解、難知、寂滅、微妙般若波羅蜜；",
        "translation": "It was then that Ānanda said to the great disciples and enlightening beings: The bodhisattva mahāsattvas of abhidharma can experience this profound, difficult to see, difficult to understand, difficult to know, tranquil and subtle perfection of wisdom.",
        "source": "T25n1509_055:0449c05_1"
    },
    {
        "source_sentence": "正見成就人、漏盡阿羅漢所願已滿，亦能受之；",
        "translation": "Those who have perfected right view and fulfilled their vows as arhats with the extinction of contamination can also receive it.",
        "source": "T25n1509_055:0449c07_2"
    },
    {
        "source_sentence": "復次，善男子、善女人多見佛、於諸佛所多供養、種善根、親近善知識、有利根——是人能受，不言是法非法。」",
        "translation": "Furthermore, good men and good women often see buddhas, make offerings to the buddhas, plant good roots, become intimate with good friends, and have sharp faculties - these people can receive them, but they don't say this is a teaching that's unlawful.",
        "source": "T25n1509_055:0449c08_3"
    },
    {
        "source_sentence": "須菩提言：「不以空分別色，不以色分別空；",
        "translation": "Suppository of enlightenment said, They don’t discriminate form by emptiness; they don’t discriminate emptiness by form.",
        "source": "T25n1509_055:0449c10_4"
    },
    {
        "source_sentence": "受、想、行、識亦如是。",
        "translation": "Feeling, perception, volition, and consciousness are likewise.",
        "source": "T25n1509_055:0449c11_5"
    },
    {
        "source_sentence": "不以無相、無作分別色，不以色分別無相、無作；",
        "translation": "“Great enlightening beings do not discriminate form in terms of signlessness or unmanifesting, and they do not discriminate signlessness or unmanifesting in terms of form.",
        "source": "T25n1509_055:0449c12_6"
    },
    {
        "source_sentence": "受、想、行、識亦如是。",
        "translation": "Feeling, perception, volition, and consciousness are likewise.",
        "source": "T25n1509_055:0449c13_7"
    },
    {
        "source_sentence": "不以無生、無滅、寂滅、離分別色，不以色分別無生、無滅、寂滅、離；",
        "translation": "“Great enlightening beings do not discriminate form by nonorigination, nonperishing, quiescence, or separation; they do not discriminate nonorigination, nonperishing, quiescence, or separation from form by form.",
        "source": "T25n1509_055:0449c13_8"
    },
    {
        "source_sentence": "受、想、行、識亦如是。",
        "translation": "Feeling, perception, volition, and consciousness are likewise.",
        "source": "T25n1509_055:0449c15_9"
    },
    {
        "source_sentence": "眼乃至意觸因緣生受亦如是。",
        "translation": "It's likewise with the sensation that arises from the causes and conditions of eye contact or even mental contact.",
        "source": "T25n1509_055:0449c15_10"
    },
    {
        "source_sentence": "檀波羅蜜乃至般若波羅蜜，內空乃至無法有法空，四念處乃至十八不共法，一切三昧門、一切陀羅尼門，須陀洹乃至阿羅漢、辟支佛、佛；",
        "translation": "The perfection of giving up to the perfection of wisdom, internal emptiness up to the emptiness of dharmas that do not exist, the four abodes of mindfulness up to the eighteen unique qualities, all samādhis and all dhāraṇī teachings, stream entry up to arhats, pratyekabuddhas, and buddhas.",
        "source": "T25n1509_055:0449c16_11"
    },
    {
        "source_sentence": "一切智，不以空分別一切智、不以一切智分別空，不以空分別一切種智、不以一切種智分別空；",
        "translation": "“Great enlightening beings of omniscience do not discriminate all things by emptiness, and they do not discriminate emptiness by all things. They do not discriminate all kinds of knowledge with emptiness, and they do not discriminate emptiness with all kinds of knowledge.",
        "source": "T25n1509_055:0449c19_12"
    },
    {
        "source_sentence": "無相、無作、無生、無滅、寂滅、離亦如是。」",
        "translation": "So it is with signlessness, unconstructedness, nonarising, noncessation, tranquility, and separation.",
        "source": "T25n1509_055:0449c21_13"
    },
    {
        "source_sentence": "須菩提語諸天子言：「是般若波羅蜜甚深，誰能受者？",
        "translation": "Suppository said to the celestial beings, This is the profound prajñāpāramitā, so who will be able to receive it?",
        "source": "T25n1509_055:0449c22_14"
    },
    {
        "source_sentence": "是般若波羅蜜中無法可示，無法可說；",
        "translation": "In the perfection of wisdom there is nothing to show and nothing to teach.",
        "source": "T25n1509_055:0449c23_15"
    },
    {
        "source_sentence": "若無法可示、無法可說，受人亦不可得。」",
        "translation": "If there's nothing to show and nothing to teach, the person who receives it won't get it either.",
        "source": "T25n1509_055:0449c24_16"
    },
    {
        "source_sentence": "爾時，舍利弗語須菩提言：「般若波羅蜜中廣說三乘之教及攝取菩薩之法，從初發意地乃至十地，檀波羅蜜乃至般若波羅蜜，四念處乃至八聖道分，佛十力乃至十八不共法，護持菩薩之教。",
        "translation": "At the time, Śāriputra said to Subhūti, In the perfection of wisdom, he explained in detail the teachings of the three vehicles and the methods for gathering in bodhisattvas, from the first ground of arousal of intention up to the tenth ground, the perfection of generosity up to the perfection of wisdom, the four abodes of mindfulness up to the eight parts of the noble path, the ten powers of",
        "source": "T25n1509_055:0449c25_17"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜，常化生，不失神通，遊諸佛國，具足善根，隨其所欲供養諸佛，即得如願，從諸佛所聽受法教，至薩婆若初不斷絕，未曾離三昧時，當得捷疾辯、利辯、不盡辯、不可斷辯、隨應辯、義辯、一切世間最上辯。」",
        "translation": "Thus does the bodhisattva Mahāsattva practice the perfection of prajñā, always transforming sentient beings without losing their supernormal powers, traveling to the buddha lands, fully possessing good roots, making offerings to the buddhas as he wishes, then attaining such a vow, listening to the Dharma teaching from the buddhas and receiving it from them until the first moment of sarvajña",
        "source": "T25n1509_055:0449c29_18"
    },
    {
        "source_sentence": "須菩提言：「如是！",
        "translation": "Suppository said, So it is!",
        "source": "T25n1509_055:0450a05_19"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T25n1509_055:0450a06_20"
    },
    {
        "source_sentence": "如舍利弗言，般若波羅蜜廣說三乘之教及護持菩薩之教，乃至菩薩摩訶薩得一切世間最上辯，不可得故。",
        "translation": "As Śāriputra said, the prajñāpāramitā extensively explains the teachings of the three vehicles and protects the bodhisattva's teachings, up to the point where the bodhisattva Mahāsattva attains the highest eloquence in all worlds because it's unobtainable.",
        "source": "T25n1509_055:0450a06_21"
    },
    {
        "source_sentence": "我乃至知者、見者不可得，色、受、想、行、識，檀波羅蜜乃至般若波羅蜜不可得，內空乃至無法有法空不可得，四念處乃至八聖道分，佛十力乃至一切種智，亦不可得故。」",
        "translation": "It's because form, sensation, perception, perception, volition, consciousness, the perfection of giving and even the perfection of prajñā are unobtainable, internal emptiness or even the emptiness of nonexistence as a dharma is unobtainable, the four abodes of mindfulness up to the eightfold noble path are unobtainable, and the ten powers of the Buddha and all kinds",
        "source": "T25n1509_055:0450a08_22"
    },
    {
        "source_sentence": "舍利弗語須菩提：「何因緣故，般若波羅蜜中廣說三乘而不可得？",
        "translation": "Śāriputra said to Subhūti, What are the causes and conditions that make the three vehicles explained in detail in the prajñāpāramitā unobtainable?",
        "source": "T25n1509_055:0450a12_23"
    },
    {
        "source_sentence": "何因緣故，般若波羅蜜中護持菩薩？",
        "translation": "What are the causes and conditions that protect bodhisattvas in the prajñāpāramitā?",
        "source": "T25n1509_055:0450a14_0"
    },
    {
        "source_sentence": "何因緣故，菩薩摩訶薩得捷疾辯乃至一切世間最上辯不可得故？」",
        "translation": "Why is it that the bodhisattva Mahāsattva attains swift eloquence and even the highest eloquence of all worlds are unobtainable?",
        "source": "T25n1509_055:0450a14_1"
    },
    {
        "source_sentence": "須菩提語舍利弗言：「以內空故，般若波羅蜜廣說三乘不可得故；",
        "translation": "Suppository of enlightenment said to Śāriputra: Because it is internally empty, the transcendent wisdom that extensively expounds the three vehicles cannot be grasped.",
        "source": "T25n1509_055:0450a16_2"
    },
    {
        "source_sentence": "外空乃至無法有法空故，廣說三乘不可得故。",
        "translation": "It's because external emptiness or even the emptiness of dharmas that lack existence is explained in detail as the three vehicles being unobtainable.",
        "source": "T25n1509_055:0450a17_3"
    },
    {
        "source_sentence": "內空故，護持菩薩乃至一切世間最上辯不可得故；",
        "translation": "Because of internal emptiness, the preserving enlightening beings are ungraspable, up to the supreme eloquence of all worlds.",
        "source": "T25n1509_055:0450a18_4"
    },
    {
        "source_sentence": "外空乃至無法有法空故，護持菩薩乃至一切世間最上辯不可得故。」",
        "translation": "It's because the emptiness of external emptiness and even the emptiness of dharmas that lack existence are unobtainable, and it's because the bodhisattva who guards them up to the supreme eloquence of all worlds is unobtainable.",
        "source": "T25n1509_055:0450a20_5"
    },
    {
        "source_sentence": "【論】者言：是時諸大弟子舍利弗等語須菩提：「是般若波羅蜜法甚深、難解。」",
        "translation": "[Commentary] He said, At the time, the great disciples Śāriputra and others said to Subhūti, This is the profound and difficult to understand teaching of prajñāpāramitā.",
        "source": "T25n1509_055:0450a22_0"
    },
    {
        "source_sentence": "以諸法無定相故為「甚深」；",
        "translation": "It is profound because all things lack definite characteristics.",
        "source": "T25n1509_055:0450a23_1"
    },
    {
        "source_sentence": "諸思惟觀行滅故「難見」；",
        "translation": "It is difficult to see because of the cessation of contemplations and practices.",
        "source": "T25n1509_055:0450a24_2"
    },
    {
        "source_sentence": "亦不著般若波羅蜜故名「難解、難知」；",
        "translation": "They are also called difficult to understand and difficult to know because they don’t cling to the perfection of wisdom.",
        "source": "T25n1509_055:0450a24_3"
    },
    {
        "source_sentence": "滅三毒及諸戲論故名「寂滅」；",
        "translation": "It is called nirvana because it extinguishes the three poisons and all conceptual elaborations.",
        "source": "T25n1509_055:0450a25_4"
    },
    {
        "source_sentence": "得是智慧妙味故，常得滿足，更無所求，餘一切智慧皆麁澁叵樂，故言「微妙」。",
        "translation": "Because they attain this marvelous taste of wisdom, they always attain its fulfillment and have nothing to ask for, and all the other kinds of wisdom are crude and unpleasant, so they're called subtle.",
        "source": "T25n1509_055:0450a26_5"
    },
    {
        "source_sentence": "諸大弟子作是言：「般若波羅蜜智慧甚深，世間人智慧淺薄，但貪著福德果報，而不樂修福德。",
        "translation": "The great disciples said, The wisdom of the prajñāpāramitā is so profound that people in the world have weak wisdom but cling to the rewards of virtue and don't enjoy cultivating virtue.",
        "source": "T25n1509_055:0450a28_6"
    },
    {
        "source_sentence": "著有則情勇，破有則心怯；",
        "translation": "When one is attached to existence, the mind is courageous; when one destroys existence, the mind is cowardly.",
        "source": "T25n1509_055:0450b01_7"
    },
    {
        "source_sentence": "本所聞習邪見經書，堅著不捨，如是人常樂世樂。」",
        "translation": "They've always heard and cultivated wrong views about the sūtras and books, and they're firmly attached and don't abandon them; such people always delight in worldly pleasures.",
        "source": "T25n1509_055:0450b02_8"
    },
    {
        "source_sentence": "以是故言：「誰能信受是深般若波羅蜜？",
        "translation": "Because of this, he said, Who can believe and accept this profound prajñāpāramitā?",
        "source": "T25n1509_055:0450b03_9"
    },
    {
        "source_sentence": "若無信受，何用說為？」",
        "translation": "If there's no faith and acceptance, what is the use of saying so?",
        "source": "T25n1509_055:0450b04_10"
    },
    {
        "source_sentence": "阿難助答：有四種人能信受，是故大德須菩提所說必有信受，不空說也。",
        "translation": "Ānanda's assistant answer: There are four kinds of people who can believe and accept it, so what the great virtuous monk Subhūti teaches must have faith and acceptance, which is not an empty teaching.",
        "source": "T25n1509_055:0450b04_11"
    },
    {
        "source_sentence": "一者、阿鞞跋致菩薩摩訶薩，知一切法不生不滅，不取相、無所著故，是則能受。",
        "translation": "1. Because the bodhisattva Mahāsattva Abhidharma knows that all things don't arise and don't cease, he doesn't grasp characteristics and has no attachment, so he's able to receive them.",
        "source": "T25n1509_055:0450b06_12"
    },
    {
        "source_sentence": "二者、漏盡阿羅漢，漏盡故無所著，得無為最上法，所願已滿，更無所求故，常住空、無相、無作三昧，隨順般若波羅蜜故，則能信受。",
        "translation": "Second, an arhat whose contaminants have ended is free of attachment because the contaminants have ended, attains the supreme teaching of nonexistence, fulfills what he wishes, and has nothing further to seek. He always abides in the samādhi of emptiness, signlessness, and unconstructedness, and it's because he follows the perfection of prajñāpāramitā that he can believe",
        "source": "T25n1509_055:0450b08_13"
    },
    {
        "source_sentence": "三者、三種學人，正見成就，漏雖未都盡，四信力故，亦能信受。",
        "translation": "3. The three kinds of trainees have accomplished right view, and even though the contaminants haven't completely ended, the fourth is able to believe it because of the power of faith.",
        "source": "T25n1509_055:0450b11_14"
    },
    {
        "source_sentence": "四者、有菩薩雖未得阿鞞跋致，福德利根，智慧清淨，常隨善知識，是人亦能信受。",
        "translation": "4. If there are bodhisattvas who haven't yet attained abhidharma, whose merits are sharp, their faculties are pure, and their wisdom is pure, and they always follow good teachers, those people can also believe and accept them.",
        "source": "T25n1509_055:0450b12_15"
    },
    {
        "source_sentence": "信受相，不言「是法非佛菩薩大弟子所說」；",
        "translation": "They believe in the characteristics of enlightenment and don't say these things aren't taught by buddhas or bodhisattvas or great disciples.",
        "source": "T25n1509_055:0450b14_16"
    },
    {
        "source_sentence": "雖聞般若波羅蜜諸法皆畢竟空，不以愛先法故而言「非法」。",
        "translation": "Even though they hear that all the teachings of the perfection of wisdom are ultimately empty, they don't say it's unlawful because they love the prior teachings.",
        "source": "T25n1509_055:0450b15_17"
    },
    {
        "source_sentence": "問曰：自上已來，阿難都無言論，今何以代須菩提答？",
        "translation": "Q: Since the above, there's nothing that Ānanda has said, so why would he answer on behalf of Suppository?",
        "source": "T25n1509_055:0450b17_18"
    },
    {
        "source_sentence": "答曰：阿難是第三轉法輪將，能為大眾師，是世尊近侍。",
        "translation": "Answer: Ānanda is the third general who turns the wheel of the Dharma, and he's able to be the teacher of the masses; this is the Bhagavān's attendant.",
        "source": "T25n1509_055:0450b18_19"
    },
    {
        "source_sentence": "雖得初道，以漏未盡故，雖有多聞智慧，自以於空智慧中未能善巧，若說空法，自未入故，皆是他事，是故無言。",
        "translation": "Even though he has attained the first path, it's because the contaminants haven't ended, and even though he has extensive learning and wisdom, he can't skillfully explain the teaching of emptiness because he doesn't enter it himself, they're all other things; therefore, there are no words.",
        "source": "T25n1509_055:0450b19_20"
    },
    {
        "source_sentence": "或時說諸有事，則能問能答。",
        "translation": "Sometimes he explains things that exist, and then he can ask questions and answer them.",
        "source": "T25n1509_055:0450b22_21"
    },
    {
        "source_sentence": "如後品中問佛言：「世尊何以故但讚歎般若波羅蜜，不讚五波羅蜜？」",
        "translation": "As the latter section asks the Buddha, Bhagavān, why does the Bhagavān only praise the perfection of wisdom and not the five perfections?",
        "source": "T25n1509_055:0450b23_22"
    },
    {
        "source_sentence": "此中問人誰能信是深般若波羅蜜者，非是空事故，阿難便答。",
        "translation": "Who among these people who can believe that this is the profound prajñāpāramitā isn't a matter of emptiness, Ānanda then answered.",
        "source": "T25n1509_055:0450b24_23"
    },
    {
        "source_sentence": "須菩提常樂說空事，不喜說有。",
        "translation": "Suppository always delights in speaking of things as emptiness and doesn't like to speak of existence.",
        "source": "T25n1509_055:0450b26_24"
    },
    {
        "source_sentence": "又以阿難是時樂說心生，是故聽答。",
        "translation": "Also, because Ānanda's mind arises when he happily explains it at the right time, he therefore listens and answers.",
        "source": "T25n1509_055:0450b27_25"
    },
    {
        "source_sentence": "阿難煩惱未盡故智慧力鈍，然信力猛利故，於甚深般若波羅蜜中能如法問答。",
        "translation": "Because Ānanda's afflictions haven't ended, his wisdom is weak, but because his faith is so strong, he can ask and answer questions in the profound prajñāpāramitā according to the teaching.",
        "source": "T25n1509_055:0450b27_26"
    },
    {
        "source_sentence": "問曰：般若波羅蜜無所有，無有一定法，云何「四種人信受，不言非法」？",
        "translation": "Q: The perfection of wisdom has no existence, and there's no set dharma; why are the four kinds of people who believe in it and don't say it's unlawful?",
        "source": "T25n1509_055:0450b29_27"
    },
    {
        "source_sentence": "答曰：今須菩提此中自說因緣：「不以空分別色，色即是空，空即是色。」",
        "translation": "Answer: Now, Suppositories explain the causes and conditions here for themselves, Not discriminating form with emptiness, form is emptiness, and emptiness is form.",
        "source": "T25n1509_055:0450c02_28"
    },
    {
        "source_sentence": "以是故，般若波羅蜜無所失、無所破；",
        "translation": "Because of this, there is nothing to lose and nothing to gain from the transcendent wisdom.",
        "source": "T25n1509_055:0450c04_29"
    },
    {
        "source_sentence": "若無所破，則無過罪，是故不言非法。",
        "translation": "If there's nothing to break, then there's no fault; therefore, it doesn't say unlawful.",
        "source": "T25n1509_055:0450c04_30"
    },
    {
        "source_sentence": "空即是般若波羅蜜，不以空智慧破色令空，亦不以破色因緣故有空，空即是色、色即是空故。",
        "translation": "Emptiness is the prajñāpāramitā, which doesn't use emptiness and wisdom to refute form so that it becomes emptiness, and it doesn't have emptiness because it refutes the causes and conditions of form, because emptiness is form and form is emptiness.",
        "source": "T25n1509_055:0450c05_31"
    },
    {
        "source_sentence": "以般若波羅蜜中破諸戲論，有如是功德，故無不信受。",
        "translation": "Because the prajñāpāramitā refutes conceptual elaborations and has such merit, there's no one who doesn't believe it.",
        "source": "T25n1509_055:0450c08_32"
    },
    {
        "source_sentence": "無相、無作，無生、無滅，寂滅、遠離，亦如是。",
        "translation": "The same applies to signlessness and to unmanifesting, to nonorigination and to nonextinguishing. The same applies to nirvana and to separation.",
        "source": "T25n1509_055:0450c09_33"
    },
    {
        "source_sentence": "乃至一切種智，皆應廣說。",
        "translation": "All kinds of knowledge should be spoken of elaborately.",
        "source": "T25n1509_055:0450c10_34"
    },
    {
        "source_sentence": "問曰：諸大弟子問是義，須菩提何以乃答諸天子？",
        "translation": "Q: When the great disciples ask about this meaning, why do they need enlightenment to answer the celestial beings?",
        "source": "T25n1509_055:0450c10_35"
    },
    {
        "source_sentence": "答曰：諸大弟子已得阿羅漢，但自為疑故問，益利事少；",
        "translation": "Answer: The great disciples have already attained arhatship, but they ask questions for the sake of doubt on their own. There are few advantages and disadvantages in doing so.",
        "source": "T25n1509_055:0450c12_0"
    },
    {
        "source_sentence": "諸天子發心為菩薩，利益深故為說。",
        "translation": "The celestials aroused the intention to be bodhisattvas and taught them because they had profound benefits.",
        "source": "T25n1509_055:0450c13_1"
    },
    {
        "source_sentence": "復次，雖為諸天子說，即是答諸大弟子。",
        "translation": "Furthermore, even though it's explained for the sake of the celestial beings, this is an answer to the great disciples.",
        "source": "T25n1509_055:0450c14_2"
    },
    {
        "source_sentence": "上說「諸法空」，今說「深般若波羅蜜中眾生畢竟空」。",
        "translation": "The above explains that all dharmas are empty, but now it's explained that the sentient beings in the profound prajñāpāramitā are ultimately empty.",
        "source": "T25n1509_055:0450c15_3"
    },
    {
        "source_sentence": "以是故，般若波羅蜜中無有說者，何況有聽受者！",
        "translation": "Because of this, there's no speaker in the prajñāpāramitā, so why wouldn't there be a listener?",
        "source": "T25n1509_055:0450c16_4"
    },
    {
        "source_sentence": "若能如是解諸法空，心無所著則能信受。",
        "translation": "If someone can thus understand the emptiness of dharmas and have no attachment in their mind, then they'll be able to believe and accept them.",
        "source": "T25n1509_055:0450c17_5"
    },
    {
        "source_sentence": "爾時，須菩提說深般若波羅蜜，舍利弗讚歎助成其事：「般若波羅蜜非但以空故可受，亦廣說有三乘。」",
        "translation": "It was then that Suppository taught the profound prajñāpāramitā, and Śāriputra praised it for its accomplishment, Not only is the prajñāpāramitā to be received because of emptiness, but it's also explained in detail that there are three vehicles.",
        "source": "T25n1509_055:0450c18_6"
    },
    {
        "source_sentence": "三乘義，如先說。",
        "translation": "The meaning of the three vehicles is as explained above.",
        "source": "T25n1509_055:0450c20_7"
    },
    {
        "source_sentence": "「攝取菩薩」者，以般若波羅蜜利益諸菩薩，令得增長。",
        "translation": "The bodhisattva who takes in means to benefit the bodhisattvas with the prajñāpāramitā and cause them to grow.",
        "source": "T25n1509_055:0450c21_8"
    },
    {
        "source_sentence": "復次，「攝取」者，是般若波羅蜜中有十地，令菩薩從一地至一地，乃至第十地。",
        "translation": "Furthermore, the phrase taking in refers to the tenth ground in the perfection of wisdom that causes bodhisattvas to go from one ground to another ground and up to the tenth ground.",
        "source": "T25n1509_055:0450c22_9"
    },
    {
        "source_sentence": "十地義、從六波羅蜜乃至一切種智義，如先說。",
        "translation": "The meaning of the ten stages and the meaning of all kinds of cognition from the six perfections are as explained above.",
        "source": "T25n1509_055:0450c24_10"
    },
    {
        "source_sentence": "「化生」者，說般若波羅蜜行報。",
        "translation": "The phrase birth by transformation refers to the practice of prajñā-pāramitā.",
        "source": "T25n1509_055:0450c25_11"
    },
    {
        "source_sentence": "行般若波羅蜜，於一切法無礙故，得「捷疾辯」。",
        "translation": "Practicing the perfection of prajñāpāramitā, he attains swift eloquence because he's unobstructed in all dharmas.",
        "source": "T25n1509_055:0450c26_12"
    },
    {
        "source_sentence": "有人雖能捷疾，鈍根故不能深入，以能深入故利，是「利辯」。",
        "translation": "Although some people can be quick, they can't enter deeply because their faculties are dull; it's because they can enter deeply that they benefit, which is called sharp eloquence.",
        "source": "T25n1509_055:0450c27_13"
    },
    {
        "source_sentence": "說諸法實相，無邊無盡故，名「樂說無盡辯」。",
        "translation": "Because they teach the true characteristics of dharmas are limitless and inexhaustible, they're called happy to teach endless eloquence.",
        "source": "T25n1509_055:0450c28_14"
    },
    {
        "source_sentence": "般若中無諸戲論故，無能問難斷絕者，名「不可斷辯」。",
        "translation": "Because there are no conceptual elaborations in prajñā, there's no one who can ask questions that are difficult to cut off, which is called uncutable eloquence.",
        "source": "T25n1509_055:0450c29_15"
    },
    {
        "source_sentence": "斷法愛故，隨眾生所應而為說法，名「隨應辯」。",
        "translation": "Because he stops craving for the Dharma, he explains the teaching to sentient beings as they should be taught, which is called following the response debate.",
        "source": "T25n1509_055:0451a01_16"
    },
    {
        "source_sentence": "說趣涅槃利益之事故，名「義辯」。",
        "translation": "To explain the benefits of going to nirvāṇa is called meaningful eloquence.",
        "source": "T25n1509_055:0451a03_0"
    },
    {
        "source_sentence": "說一切世間第一之事，所謂大乘，是名「世間最上辯」。",
        "translation": "Explaining all the world's first things, which is called the great vehicle, is called the world's supreme eloquence.",
        "source": "T25n1509_055:0451a03_1"
    },
    {
        "source_sentence": "須菩提然其問，言：「如是！",
        "translation": "Suppository asked, So it is!",
        "source": "T25n1509_055:0451a04_2"
    },
    {
        "source_sentence": "如是！」",
        "translation": "So it is!",
        "source": "T25n1509_055:0451a05_3"
    },
    {
        "source_sentence": "舍利弗作是念：「須菩提常樂說空，何以故受我所說般若波羅蜜廣說三乘之教？",
        "translation": "Śāriputra thought, Suppositories always delight in explaining emptiness, so why would they accept my teaching of the prajñāpāramitā that extensively explains the teachings of the three vehicles?",
        "source": "T25n1509_055:0451a05_4"
    },
    {
        "source_sentence": "應當更有因緣。」",
        "translation": "There should be another cause and condition.",
        "source": "T25n1509_055:0451a07_5"
    },
    {
        "source_sentence": "須菩提答：「般若波羅蜜雖廣說三乘法，非有定相，皆以十八空和合故說。",
        "translation": "Suppository answered, Although the prajñāpāramitā extensively explains the teachings of the three vehicles, it doesn't have a set characteristic, but it's explained because they are all combined with the 18 kinds of emptiness.",
        "source": "T25n1509_055:0451a07_6"
    },
    {
        "source_sentence": "攝取菩薩、七種辯亦如是，以空智慧故。」",
        "translation": "So are the bodhisattvas who gather in sentient beings and seven kinds of eloquence because of emptiness and wisdom.",
        "source": "T25n1509_055:0451a09_7"
    },
    {
        "source_sentence": "大智度論釋散華品第二十九",
        "translation": "Dazhiduo lun shi sanhua pin xxix",
        "source": "T25n1509_055:0451a11_0"
    },
    {
        "source_sentence": "【經】爾時，釋提桓因及三千大千世界中四天王天乃至阿迦尼吒諸天作是念：「慧命須菩提為雨法雨，我等寧可化作華，散佛、菩薩摩訶薩、比丘僧、須菩提及般若波羅蜜上！」",
        "translation": "[Sutra] At the time, Śakra Devānām-Indra and the four heavenly kings of the 3,000 great one-thousand worlds and even the gods of Akaniṣṭha had this thought, Wisdom Life Subhūti is the rain of the Dharma; we'd better transform ourselves into flowers, scattering buddhas, bodhisattvas, bodhisattvas, mahāsattvas, monks",
        "source": "T25n1509_055:0451a12_0"
    },
    {
        "source_sentence": "釋提桓因及三千大千世界中諸天化作華，散佛、菩薩摩訶薩、比丘僧及須菩提上，亦供養般若波羅蜜。",
        "translation": "Śakra Devānām-Indra and the gods of the 3,000 great one-thousand worlds transform themselves into flowers, scattering buddhas, bodhisattvas, bodhisattvas, bodhisattva mahāsattvas, monks, and Suppositories to make offerings to the prajñāpāramitā as well.",
        "source": "T25n1509_055:0451a16_0"
    },
    {
        "source_sentence": "是時，三千大千世界，華悉周遍於虛空中，化成華臺，端嚴殊妙。",
        "translation": "At the time, 3,000 great one-thousand worlds were all pervaded by flowers in the sky and transformed into a flower dais, which was so beautifully arrayed.",
        "source": "T25n1509_055:0451a18_1"
    },
    {
        "source_sentence": "須菩提心念：「是諸天子所散華，天上未曾見如是華比。",
        "translation": "Suppository thought, These are the flowers scattered by the gods, which have never been seen in heaven like these flowers.",
        "source": "T25n1509_055:0451a19_2"
    },
    {
        "source_sentence": "是華是化華，非樹生華，是諸天子所散華，從心樹生，非樹生華。」",
        "translation": "This is a flower that's a transformation flower, not a tree-growing flower; it's a flower scattered by the gods, and it arises from the mind tree, not a tree-growing flower.",
        "source": "T25n1509_055:0451a21_0"
    },
    {
        "source_sentence": "釋提桓因知須菩提心所念，語須菩提言：「大德！",
        "translation": "Knowing what Suppository was thinking, Śakra Devānām-Indra said to Suppository, Mañjuśrī!",
        "source": "T25n1509_055:0451a22_1"
    },
    {
        "source_sentence": "是華非生華，亦非意樹生。」",
        "translation": "This is a flower that doesn't give rise to flowers, and it doesn't give rise to the mind tree.",
        "source": "T25n1509_055:0451a23_2"
    },
    {
        "source_sentence": "須菩提語釋提桓因言：「憍尸迦！",
        "translation": "Suppository said to Śakra Devānām-Indra, Kauśika!",
        "source": "T25n1509_055:0451a24_3"
    },
    {
        "source_sentence": "汝言『是華非生華，亦非意樹生』。",
        "translation": "You say, 'This is a flower that doesn't give rise to flowers and isn't born from the mind tree.'",
        "source": "T25n1509_055:0451a24_4"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0451a25_5"
    },
    {
        "source_sentence": "是若非生法，不名為華。」",
        "translation": "If it's not a dharma that arises, it won't be called a flower.",
        "source": "T25n1509_055:0451a25_6"
    },
    {
        "source_sentence": "釋提桓因語須菩提言：「大德！",
        "translation": "Śakra Devānām-Indra said to Subhūti, Mañjuśrī!",
        "source": "T25n1509_055:0451a26_7"
    },
    {
        "source_sentence": "但是華不生？",
        "translation": "Is it just that flowers don't grow?",
        "source": "T25n1509_055:0451a26_8"
    },
    {
        "source_sentence": "色亦不生？",
        "translation": "does form also not arise?",
        "source": "T25n1509_055:0451a27_9"
    },
    {
        "source_sentence": "受、想、行、識亦不生？」",
        "translation": "Nor do feeling, perception, volition, and consciousness arise?",
        "source": "T25n1509_055:0451a27_10"
    },
    {
        "source_sentence": "須菩提言：「憍尸迦！",
        "translation": "Suppository said, Kauśika!",
        "source": "T25n1509_055:0451a27_11"
    },
    {
        "source_sentence": "非但是華不生，色亦不生，若不生，是不名為色。",
        "translation": "It's not just that flowers don't arise, form doesn't arise, and if they don't arise, it's not called form.",
        "source": "T25n1509_055:0451a28_12"
    },
    {
        "source_sentence": "受、想、行；",
        "translation": "Feeling, conceptual identification and formations:",
        "source": "T25n1509_055:0451a29_13"
    },
    {
        "source_sentence": "識亦不生，若不生，是不名為識。",
        "translation": "Consciousness also doesn't arise, and if it doesn't arise, it's not called consciousness.",
        "source": "T25n1509_055:0451a29_14"
    },
    {
        "source_sentence": "六入、六識、六觸、六觸因緣生諸受亦如是。",
        "translation": "So it is with the six sense-fields, six consciousnesses, six contacts, and sensations that arise from the causes and conditions of the six contacts.",
        "source": "T25n1509_055:0451b01_15"
    },
    {
        "source_sentence": "檀波羅蜜不生，若不生，是不名檀波羅蜜；",
        "translation": "The transcendent of giving that does not arise, and if it does not arise, is not called the transcendent of giving.",
        "source": "T25n1509_055:0451b02_16"
    },
    {
        "source_sentence": "乃至般若波羅蜜不生，若不生，是不名般若波羅蜜。",
        "translation": "Up to the point where the perfection of wisdom doesn't arise, and if it doesn't arise, it's not called the perfection of wisdom.",
        "source": "T25n1509_055:0451b03_17"
    },
    {
        "source_sentence": "內空不生，若不生，是不名內空；",
        "translation": "When internal emptiness does not arise, and when it does not arise, it is no longer said to be internal emptiness.",
        "source": "T25n1509_055:0451b04_18"
    },
    {
        "source_sentence": "乃至無法有法空不生，若不生，是不名無法有法空。",
        "translation": "If it doesn't arise, it's not called the emptiness of dharmas that don't exist.",
        "source": "T25n1509_055:0451b05_0"
    },
    {
        "source_sentence": "四念處不生，若不生，是不名四念處。",
        "translation": "If the four abodes of mindfulness don't arise, and if they don't arise, they aren't called the four abodes of mindfulness.",
        "source": "T25n1509_055:0451b06_1"
    },
    {
        "source_sentence": "乃至十八不共法不生，若不生，是不名十八不共法。",
        "translation": "It's not called the 18 distinctive qualities that don't arise, and if they don't arise, it's not called the 18 distinctive qualities.",
        "source": "T25n1509_055:0451b07_0"
    },
    {
        "source_sentence": "乃至一切種智不生，若不生，是不名一切種智。」",
        "translation": "Even if all kinds of cognition don't arise, and if they don't arise, it's not called all kinds of cognition.",
        "source": "T25n1509_055:0451b08_1"
    },
    {
        "source_sentence": "【論】釋曰：釋提桓因及諸天聞須菩提所說般若義：一切法盡是實相，無所分別；",
        "translation": "[Commentary] Explanation: Śakra Devānām-Indra and the gods heard what Suppository of Enlightenment taught about the meaning of prajñāpāramitā: All things are ultimately true characteristics without discrimination.",
        "source": "T25n1509_055:0451b10_0"
    },
    {
        "source_sentence": "雖說空，於諸法無所破，亦不失諸行業果報。",
        "translation": "Even though it teaches emptiness, there's nothing to refute in terms of dharmas, and they don't lose the results of their actions.",
        "source": "T25n1509_055:0451b11_1"
    },
    {
        "source_sentence": "聲聞人於佛前能說是甚深法故，釋提桓因等皆歡喜，作是念：「須菩提所說法，無礙無障，譬如時雨。」",
        "translation": "Because śrāvakas can explain this profound teaching in front of the Buddha, Śakra Devānām-Indra and others rejoiced and thought, It's like a rain at the time when they hear the Dharma taught by Subhūti without obstruction or hindrance.",
        "source": "T25n1509_055:0451b13_0"
    },
    {
        "source_sentence": "如有國土，溉灌種蒔及種種用水，常苦不足；",
        "translation": "Suppose there is a land in which irrigation, irrigation, sowing, and various waters are always painful but not enough.",
        "source": "T25n1509_055:0451b15_1"
    },
    {
        "source_sentence": "若時雨普降，無不霑洽，無不如願。",
        "translation": "Whenever it rains, there's nothing that isn't moistened and nothing that doesn't wish to be moistened.",
        "source": "T25n1509_055:0451b16_2"
    },
    {
        "source_sentence": "小乘法亦如是，初種種讚歎布施、持戒、禪定、無常等諸觀，有量有限，末後說涅槃。",
        "translation": "The teachings of the lesser vehicle are likewise: first, they variously praise such contemplations as generosity, observance of precepts, meditation, impermanence, and so forth, which are limited in number but later described as nirvāṇa.",
        "source": "T25n1509_055:0451b17_3"
    },
    {
        "source_sentence": "此中須菩提所明，從初發心乃至佛道，唯說諸法實相，無所分別。",
        "translation": "Here, what Subhūti explains, from the first arousal of mind up to the Buddha Way, he only explains the true characteristics of dharmas and doesn't discriminate anything.",
        "source": "T25n1509_055:0451b19_4"
    },
    {
        "source_sentence": "譬如大雨遍滿閻浮提，無所不潤。",
        "translation": "It's like a great rain that fills Jambudvīpa and nothing doesn't moisten it.",
        "source": "T25n1509_055:0451b20_5"
    },
    {
        "source_sentence": "又如地先雖有穀子，無雨則不生。",
        "translation": "It's also like when the earth first had grains, but they didn't grow without rain.",
        "source": "T25n1509_055:0451b21_6"
    },
    {
        "source_sentence": "行者亦如是，雖有因緣，不得法雨，發心者退，未發者住；",
        "translation": "Practitioners are also like this: even if there are reasons why they cannot receive the rain of the Dharma. Those who have undertaken to do so will withdrew, but those who have not undertaken yet abide.",
        "source": "T25n1509_055:0451b22_7"
    },
    {
        "source_sentence": "若得法雨，發心者增長，未發者發。",
        "translation": "If someone attains the rain of the Dharma, those who have arisen will grow and those who haven't yet arisen will arise.",
        "source": "T25n1509_055:0451b23_8"
    },
    {
        "source_sentence": "以是故說「如雨法雨」。",
        "translation": "That's why it's called like raining the Dharma rain.",
        "source": "T25n1509_055:0451b24_9"
    },
    {
        "source_sentence": "復次，譬如惡風、塵土、諸熱、毒氣等，得雨則消滅；",
        "translation": "“Furthermore, it is analogous to bad wind, dust, heat, poisonous gas, etc.",
        "source": "T25n1509_055:0451b25_10"
    },
    {
        "source_sentence": "法雨亦如是，惡覺觀塵土、三不善毒、邪見惡風、邪師惡蟲及諸惡知識等，得般若波羅蜜法雨，則皆除滅。",
        "translation": "The Dharma rain is likewise, and when bad feelings observe dust, the three unwholesome poisons, mistaken views, bad wind, mistaken teachers, bad insects, and bad friends attain the Dharma rain of prajñā-pāramitā, they are all removed.",
        "source": "T25n1509_055:0451b26_11"
    },
    {
        "source_sentence": "人蒙時雨，故供養天；",
        "translation": "Because people receive rain at the proper season, they make offerings to the gods.",
        "source": "T25n1509_055:0451b28_12"
    },
    {
        "source_sentence": "諸天聞法雨，大利益，欲供養故，作是念：「我等寧可作華，散佛、諸大菩薩、比丘僧及須菩提，亦供養般若波羅蜜。」",
        "translation": "The gods heard that the Dharma rain would greatly benefit them and wanted to make offerings, so they thought, Let's rather make flowers that will scatter the Buddha, the great bodhisattvas, the monks, and Subhūti as well as the prajñāpāramitā.",
        "source": "T25n1509_055:0451b29_13"
    },
    {
        "source_sentence": "以須菩提善說般若，敬之重故，甄名供養。",
        "translation": "Because Suppository of enlightenment well explains the prajñāpāramitā, and because he respects it, he discerns its names and makes offerings.",
        "source": "T25n1509_055:0451c02_14"
    },
    {
        "source_sentence": "是般若波羅蜜多說諸法空，又上欲得如化人聽法，隨其相故，以化華供養。",
        "translation": "This is the prajñāpāramitā that explains the emptiness of all dharmas and also wants to attain it like a transformation person who hears the teaching, so he makes offerings with transformed flowers according to their characteristics.",
        "source": "T25n1509_055:0451c03_15"
    },
    {
        "source_sentence": "復次，諸天當歡喜時，便稱心供養，不容多還取，故即作化華，散佛、須菩提、諸菩薩、比丘僧及般若波羅蜜——華散佛上，是供養佛寶；",
        "translation": "“Furthermore, when the gods were overjoyed, they praised their hearts for offerings and did not allow much to be taken back. So they made magical flowers that scattered on top of the buddhas, stream-enterers, enlightening beings, bodhisattvas, bhikṣus, and pratyekabuddhas—this was an offering to the Buddha’s treasure:",
        "source": "T25n1509_055:0451c05_16"
    },
    {
        "source_sentence": "散諸菩薩、須菩提及般若波羅蜜，是供養法寶；",
        "translation": "散諸菩薩、須菩提及般若波羅蜜,是供養法寶;散諸菩薩、須菩提及般若波羅蜜,是供養法寶;",
        "source": "T25n1509_055:0451c08_17"
    },
    {
        "source_sentence": "散諸比丘僧，是供養僧寶。",
        "translation": "Scattering monks and saṃgha is an offering to the treasures of the saṃgha.",
        "source": "T25n1509_055:0451c09_18"
    },
    {
        "source_sentence": "作是念已，隨意變化，供養三寶。",
        "translation": "After he had this thought, he transformed himself as he wished to make offerings to the Three Treasures.",
        "source": "T25n1509_055:0451c10_19"
    },
    {
        "source_sentence": "大福德成就故，心生所願，皆得如意，不從他求。",
        "translation": "Because of their accomplishment of great virtue, they attain supernormal abilities and wishes that arise in their minds, not seeking from others.",
        "source": "T25n1509_055:0451c11_20"
    },
    {
        "source_sentence": "問曰：華臺端嚴，為是誰力？",
        "translation": "Q: The flower dais is so beautiful, but whose power is it?",
        "source": "T25n1509_055:0451c12_21"
    },
    {
        "source_sentence": "答曰：是諸天力。",
        "translation": "Answer: It's the power of the gods.",
        "source": "T25n1509_055:0451c12_22"
    },
    {
        "source_sentence": "諸天福德自在故，小能為大。",
        "translation": "Because the gods have sovereignty over their merit, the small can be the great.",
        "source": "T25n1509_055:0451c13_23"
    },
    {
        "source_sentence": "有人言：「是佛神力。",
        "translation": "Some people said, This is the Buddha's miraculous power.",
        "source": "T25n1509_055:0451c13_24"
    },
    {
        "source_sentence": "佛以此般若波羅蜜有大功德，因時少而果報甚大，成就佛道，是故現此奇特。」",
        "translation": "Because this prajñāpāramitā of the Buddha has great merit, the rewards are so great when the time is short that they accomplish the Buddha Way; therefore, it's extraordinary to show it here.",
        "source": "T25n1509_055:0451c14_25"
    },
    {
        "source_sentence": "須菩提即時分別，知非實華。",
        "translation": "Suppository of enlightenment immediately discerns it and knows it's not a real flower.",
        "source": "T25n1509_055:0451c16_26"
    },
    {
        "source_sentence": "釋提桓因知須菩提覺是化華，語須菩提言：「大德！",
        "translation": "Knowing that Subhūti's awakening was the flower of transformation, Śakra Devānām-Indra said to Subhūti, Mañjuśrī!",
        "source": "T25n1509_055:0451c16_27"
    },
    {
        "source_sentence": "是華非生華。」",
        "translation": "This is a flower that's not a growing flower.",
        "source": "T25n1509_055:0451c17_28"
    },
    {
        "source_sentence": "「非生華」者，言：「是華無生、空、無所出。」",
        "translation": "The phrase not a growing flower refers to the fact that flowers lack birth, emptiness, and nothing comes out.",
        "source": "T25n1509_055:0451c18_29"
    },
    {
        "source_sentence": "須菩提說是般若波羅蜜，諸法無生、空寂，故以無生華供養。",
        "translation": "Suppository of enlightenment teaches that this is the perfection of prajñā, and all dharmas lack birth and emptiness and are quiescent, so he makes offerings with the flower of nonproduction.",
        "source": "T25n1509_055:0451c19_30"
    },
    {
        "source_sentence": "「意樹」者，諸天隨意所念則得。",
        "translation": "The thought tree means that the gods attain it according to their thoughts.",
        "source": "T25n1509_055:0451c20_31"
    },
    {
        "source_sentence": "以要言之，天樹隨意所欲，應念則至，故言「意樹」。",
        "translation": "To put it briefly, the celestial tree follows what he wants, and when he's mindful of it, he arrives; therefore, it's called the wish tree.",
        "source": "T25n1509_055:0451c21_32"
    },
    {
        "source_sentence": "釋提桓因難須菩提故言「是華無生」，何以言「是華不從樹生」？",
        "translation": "Śakra Devānām-Indra said, This is the flower that has no birth because it's difficult to attain enlightenment, so why does he say, This flower doesn't arise from a tree?",
        "source": "T25n1509_055:0451c22_33"
    },
    {
        "source_sentence": "須菩提反質言：「若不生，何以名華？」",
        "translation": "Suppository replied, If it doesn't arise, why is it called a flower?",
        "source": "T25n1509_055:0451c23_34"
    },
    {
        "source_sentence": "不生法中無所分別——所謂是華、是非華。",
        "translation": "They don't discriminate between what's called a flower and what's not a flower in the Dharma that doesn't arise - they say it's a flower or a non-flower.",
        "source": "T25n1509_055:0451c24_35"
    },
    {
        "source_sentence": "是時釋提桓因心伏而問：「但是華無生，諸法亦無生？」",
        "translation": "Śakra Devānām-Indra then subdued his mind and asked, But flowers are unarisen, and dharmas are also unarisen?",
        "source": "T25n1509_055:0451c25_36"
    },
    {
        "source_sentence": "須菩提答：「非但是華不生，色亦不生。」",
        "translation": "Suppository answered, It's not just that flowers don't arise and form doesn't arise.",
        "source": "T25n1509_055:0451c26_37"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0451c27_38"
    },
    {
        "source_sentence": "若一法空，則一切法皆空；",
        "translation": "If one thing is void, all things are void.",
        "source": "T25n1509_055:0451c27_39"
    },
    {
        "source_sentence": "若行者於一法中了了決定知空，則一切法中皆亦明了。",
        "translation": "If a practitioner understands the emptiness of one thing with certainty, then all things are also clearly understood.",
        "source": "T25n1509_055:0451c28_40"
    },
    {
        "source_sentence": "若五眾不生，則非五眾相。",
        "translation": "If the five characteristics don't arise, then it's not the characteristic of the five characteristics.",
        "source": "T25n1509_055:0451c29_41"
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "It's likewise with all kinds of cognition.",
        "source": "T25n1509_055:0452a01_42"
    },
    {
        "source_sentence": "五眾從因緣和合生，無有定性，但有假名。",
        "translation": "The five collections arise from the conjunction of causes and conditions. They have no fixed nature but only nominal names.",
        "source": "T25n1509_055:0452a01_43"
    },
    {
        "source_sentence": "「假名實相」者，所謂五眾如、法性、實際。",
        "translation": "The phrase nominally called true characteristic refers to the five collections of thusness, Dharma nature, and reality.",
        "source": "T25n1509_055:0452a02_44"
    },
    {
        "source_sentence": "須菩提所說，不違此理；",
        "translation": "What Subhūti teaches is not inconsistent with this principle.",
        "source": "T25n1509_055:0452a03_45"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0452a04_46"
    },
    {
        "source_sentence": "聖人知名字是俗諦、實相是第一義諦；",
        "translation": "The name of saints is a conventional truth, while real characteristics are the ultimate truth.",
        "source": "T25n1509_055:0452a04_47"
    },
    {
        "source_sentence": "有所說者隨凡夫人，第一義諦中無彼此、亦無諍。",
        "translation": "Anyone who teaches anything follows ordinary people, and there's no mutuality or anger in the ultimate truth.",
        "source": "T25n1509_055:0452a05_48"
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "It's likewise with all kinds of cognition.",
        "source": "T25n1509_055:0452a06_49"
    },
    {
        "source_sentence": "眾生空乃至知者、見者空故，須陀洹但有假名，乃至佛亦如是。",
        "translation": "Because sentient beings are empty and even those who know and see are empty, stream entry only has a nominal name, and so is the Buddha.",
        "source": "T25n1509_055:0452a07_0"
    },
    {
        "source_sentence": "【經】爾時，釋提桓因作是念：「是慧命須菩提，其智甚深，不壞假名而說諸法實相。」",
        "translation": "[Sutra] At the time, Śakra Devānām-Indra had this thought, This is the wisdom that requires enlightenment, whose knowledge is so profound that it doesn't destroy nominal names and explains the true characteristics of dharmas.",
        "source": "T25n1509_055:0452a09_0"
    },
    {
        "source_sentence": "佛知釋提桓因心所念，語釋提桓因言：「如是！",
        "translation": "Knowing what Śakra thought in his mind, the Buddha said to Śakra Devānām-Indra, So it is!",
        "source": "T25n1509_055:0452a10_1"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T25n1509_055:0452a11_2"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0452a12_0"
    },
    {
        "source_sentence": "須菩提其智甚深，不壞假名而說諸法實相。」",
        "translation": "Suppository of enlightenment, his knowledge is so profound that it doesn't destroy nominal names and explains the true characteristics of dharmas.",
        "source": "T25n1509_055:0452a12_1"
    },
    {
        "source_sentence": "釋提桓因白佛言：「大德須菩提，云何不壞假名而說諸法實相？」",
        "translation": "Śakra Devānām-Indra said to the Buddha, Mañjuśrī, how can you explain the true characteristics of dharmas without destroying nominal names?",
        "source": "T25n1509_055:0452a13_2"
    },
    {
        "source_sentence": "佛告釋提桓因：「色但假名，須菩提不壞假名而說諸法實相；",
        "translation": "The Buddha told Śakra Devānām-Indra: Form is merely a designation, but it requires enlightenment to preach the true characteristics of all dharmas without destroying names.",
        "source": "T25n1509_055:0452a14_3"
    },
    {
        "source_sentence": "受、想、行、識但假名，須菩提亦不壞假名而說諸法實相。",
        "translation": "Feeling, perception, volition, volition, and consciousness are only nominal names, but Suppositories of enlightenment also don't destroy nominal names and explain the true characteristics of dharmas.",
        "source": "T25n1509_055:0452a16_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_055:0452a17_5"
    },
    {
        "source_sentence": "是諸法實相，無壞不壞故，須菩提所說亦無壞不壞。",
        "translation": "Because these are the true characteristics of dharmas, they lack decay and don't break down, and what Subhūti teaches also doesn't break down or break down.",
        "source": "T25n1509_055:0452a17_6"
    },
    {
        "source_sentence": "眼乃至意觸因緣生諸受亦如是；",
        "translation": "The same applies up to feelings that arise by means of the eye or even by means of mental contact.",
        "source": "T25n1509_055:0452a18_7"
    },
    {
        "source_sentence": "檀波羅蜜乃至般若波羅蜜，內空乃至無法有法空，四念處乃至十八不共法亦如是。",
        "translation": "The perfection of giving up to the perfection of wisdom, internal emptiness up to the emptiness of dharmas that don't exist, and the four abodes of mindfulness up to the 18 distinctive qualities are likewise.",
        "source": "T25n1509_055:0452a19_8"
    },
    {
        "source_sentence": "須陀洹果乃至阿羅漢果、辟支佛道、菩薩道、佛道，一切智、一切種智亦如是。",
        "translation": "The fruit of stream entry up to the fruit of arhatship, the path of pratyekabuddhas, the path of bodhisattvas, and the path of buddhas are likewise with omniscience and omniscience of all kinds.",
        "source": "T25n1509_055:0452a21_9"
    },
    {
        "source_sentence": "須陀洹乃至阿羅漢、辟支佛、佛，是但假名，須菩提不壞假名而說諸法實相。",
        "translation": "Sudarśana, even arhats, pratyekabuddhas, and buddhas are only nominal names, and Subhūti doesn't break down the nominal names but speaks of the true characteristics of dharmas.",
        "source": "T25n1509_055:0452a23_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0452a24_11"
    },
    {
        "source_sentence": "是諸法實相，無壞不壞故；",
        "translation": "They are the true characteristics of all dharmas, because they do not break down or disintegrate.",
        "source": "T25n1509_055:0452a25_12"
    },
    {
        "source_sentence": "須菩提所說亦無壞不壞。",
        "translation": "What Subhūti teaches, it doesn't break down and doesn't break down either.",
        "source": "T25n1509_055:0452a25_13"
    },
    {
        "source_sentence": "如是，憍尸迦！",
        "translation": "So it is, Kauśika!",
        "source": "T25n1509_055:0452a26_14"
    },
    {
        "source_sentence": "須菩提不壞假名而說諸法實相。」",
        "translation": "Suppose enlightenment doesn't destroy nominal names and explain the true characteristics of dharmas.",
        "source": "T25n1509_055:0452a26_15"
    },
    {
        "source_sentence": "須菩提語釋提桓因：「如是！",
        "translation": "Suppository said to Śakra Devānām-Indra, So it is!",
        "source": "T25n1509_055:0452a27_16"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T25n1509_055:0452a28_17"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0452a28_18"
    },
    {
        "source_sentence": "如佛所說諸法但假名，菩薩摩訶薩當作是知：諸法但假名，應如是學般若波羅蜜。",
        "translation": "Just as the Buddha teaches that all dharmas are merely nominal names, so the bodhisattva Mahāsattva should know that all dharmas are merely nominal names, and he should thus train in the perfection of wisdom.",
        "source": "T25n1509_055:0452a28_19"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0452b01_20"
    },
    {
        "source_sentence": "菩薩摩訶薩作如是學，為不學色，不學受、想、行、識。",
        "translation": "The bodhisattva Mahāsattva does so because he doesn't train in form and doesn't train in feeling, perception, volition, or consciousness.",
        "source": "T25n1509_055:0452b01_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0452b02_22"
    },
    {
        "source_sentence": "不見色當可學者，不見受、想、行、識當可學者。",
        "translation": "Not seeing form should be studied, and not seeing feeling, perception, volition, or consciousness should be studied.",
        "source": "T25n1509_055:0452b02_23"
    },
    {
        "source_sentence": "菩薩摩訶薩如是學，為不學檀波羅蜜。",
        "translation": "A bodhisattva-mahāsattva thus trains, but he doesn't train in the perfection of giving.",
        "source": "T25n1509_055:0452b03_24"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0452b04_25"
    },
    {
        "source_sentence": "不見檀波羅蜜當可學者。",
        "translation": "They don't see that the perfection of giving should be studied.",
        "source": "T25n1509_055:0452b04_26"
    },
    {
        "source_sentence": "乃至不學般若波羅蜜。",
        "translation": "He doesn't even train in the perfection of wisdom.",
        "source": "T25n1509_055:0452b05_27"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0452b05_28"
    },
    {
        "source_sentence": "不見般若波羅蜜當可學者。",
        "translation": "If you don't see the perfection of wisdom, you should be able to study it.",
        "source": "T25n1509_055:0452b06_29"
    },
    {
        "source_sentence": "如是學，為不學內空乃至無法有法空。",
        "translation": "Thus training, it's because they don't train in internal emptiness or even the emptiness of dharmas that lack existence.",
        "source": "T25n1509_055:0452b06_30"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0452b07_31"
    },
    {
        "source_sentence": "不見內空乃至無法有法空當可學者。",
        "translation": "They don't see internal emptiness or even the emptiness of dharmas that lack existence, so they should be studied.",
        "source": "T25n1509_055:0452b07_32"
    },
    {
        "source_sentence": "如是學，為不學四念處乃至十八不共法。",
        "translation": "This is training that doesn't train in the four abodes of mindfulness up to 18 distinctive qualities.",
        "source": "T25n1509_055:0452b08_33"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0452b09_34"
    },
    {
        "source_sentence": "不見四念處乃至十八不共法當可學者。",
        "translation": "They won't see the four abodes of mindfulness or even the 18 distinctive qualities that should be studied.",
        "source": "T25n1509_055:0452b09_35"
    },
    {
        "source_sentence": "如是學，為不學須陀洹果乃至一切種智。",
        "translation": "Such a learner is someone who doesn't train in the fruit of stream entry or even all kinds of cognition.",
        "source": "T25n1509_055:0452b10_36"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0452b11_37"
    },
    {
        "source_sentence": "不見須陀洹果乃至一切種智當可學者。」",
        "translation": "They won't see the fruit of stream entry or even all kinds of cognition that can be studied.",
        "source": "T25n1509_055:0452b11_38"
    },
    {
        "source_sentence": "爾時，釋提桓因語須菩提言：「菩薩摩訶薩何因緣故不見色乃至不見一切種智？」",
        "translation": "It was then that Śakra Devānām-Indra said to Subhūti, What are the causes and conditions for a bodhisattva Mahāsattva not seeing form or even all kinds of cognition?",
        "source": "T25n1509_055:0452b12_39"
    },
    {
        "source_sentence": "須菩提言：「色，色空；",
        "translation": "Suppository of enlightenment said, Form and form are emptiness.",
        "source": "T25n1509_055:0452b14_40"
    },
    {
        "source_sentence": "乃至一切種智，一切種智空。",
        "translation": "Up to all kinds of cognition, all kinds of cognition are empty.",
        "source": "T25n1509_055:0452b15_41"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0452b15_42"
    },
    {
        "source_sentence": "色空不學色空，乃至一切種智空不學一切種智空。",
        "translation": "The emptiness of form doesn't train in the emptiness of form, and the emptiness of all kinds of cognition doesn't train in the emptiness of all kinds of cognition.",
        "source": "T25n1509_055:0452b15_43"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0452b17_44"
    },
    {
        "source_sentence": "若如是不學空，是名學空，以不二故。",
        "translation": "If someone thus doesn't train in emptiness, this is called training in emptiness because it's not two.",
        "source": "T25n1509_055:0452b17_45"
    },
    {
        "source_sentence": "是菩薩摩訶薩學色空，以不二故；",
        "translation": "“These great enlightening beings study form as emptiness because they are not two.",
        "source": "T25n1509_055:0452b18_46"
    },
    {
        "source_sentence": "乃至學一切種智空，以不二故。",
        "translation": "It goes so far as to train in the emptiness of all kinds of cognition because it's not two.",
        "source": "T25n1509_055:0452b18_47"
    },
    {
        "source_sentence": "若學色空不二故，乃至學一切種智空不二故，是菩薩摩訶薩能學檀波羅蜜不二故，乃至能學般若波羅蜜不二故；",
        "translation": "If the emptiness of form is studied because it is not two, and so on, up to the emptiness of all kinds of knowledge is studied because it is not two, this is because great enlightening beings are able to study the transcendent practice of giving because it is not two, and so on, up to they can study the transcendent practice of wisdom because it is not two.",
        "source": "T25n1509_055:0452b19_48"
    },
    {
        "source_sentence": "能學四念處不二故，乃至能學十八不共法不二故；",
        "translation": "They are able to study the four applications of mindfulness because they are not two; up to they can study the eighteen unique factors because they are not two.",
        "source": "T25n1509_055:0452b22_49"
    },
    {
        "source_sentence": "能學須陀洹果不二故，乃至能學一切種智不二故。",
        "translation": "It's because the fruit of stream entry that can be studied is not two, and it's because all kinds of cognition that can be studied are not two.",
        "source": "T25n1509_055:0452b23_50"
    },
    {
        "source_sentence": "是菩薩能學無量無邊阿僧祇佛法。",
        "translation": "This is a bodhisattva who can train in measureless, limitless, and incalculable buddha-teachings.",
        "source": "T25n1509_055:0452b24_51"
    },
    {
        "source_sentence": "「若能學無量無邊阿僧祇佛法，是菩薩不為色增學，不為色減學，乃至不為一切種智增學，不為一切種智減學。",
        "translation": "If someone can train in measureless, limitless, and incalculable buddha-dharmas, this is a bodhisattva who doesn't increase training with form or decrease training with form, up to the point where he doesn't increase training with all kinds of cognition or decrease training with all kinds of cognition.",
        "source": "T25n1509_055:0452b25_52"
    },
    {
        "source_sentence": "若不為色增、減學，乃至不為一切種智增、減學，是菩薩不為色受學，不為色滅學；",
        "translation": "If one does not train for the increase and decrease of form, or even if one does not train for the increase and decrease of all kinds of knowledge, this is a bodhisattva who does not receive training for form but does not train for the cessation of form.",
        "source": "T25n1509_055:0452b28_53"
    },
    {
        "source_sentence": "亦不為受、想、行、識受學，亦不為滅學。",
        "translation": "Nor does he train in sensation, perception, volition, and consciousness, nor does he train in cessation.",
        "source": "T25n1509_055:0452c01_0"
    },
    {
        "source_sentence": "乃至一切種智亦不為受學，亦不為滅學。」",
        "translation": "Even all kinds of cognition don't receive training, and they don't train in cessation.",
        "source": "T25n1509_055:0452c01_1"
    },
    {
        "source_sentence": "舍利弗語須菩提：「菩薩摩訶薩如是學，不為受色學，不為滅色學，乃至一切種智亦不為受學，亦不為滅學？」",
        "translation": "Śāriputra said to Subhūti, Thus does the bodhisattva Mahāsattva train in such a way that he doesn't train in form and doesn't train in the cessation of form, and even all kinds of cognition don't train or train in all kinds of cognition?",
        "source": "T25n1509_055:0452c02_2"
    },
    {
        "source_sentence": "須菩提言：「菩薩摩訶薩若如是學，不為受色學，不為滅色學，乃至一切種智亦不為受學，亦不為滅學。」",
        "translation": "Suppository said, If a bodhisattva-mahāsattva thus trains, he doesn't train in form and doesn't train in the cessation of form, and so forth, even if he doesn't train in all kinds of cognition and doesn't train in sensation or cessation.",
        "source": "T25n1509_055:0452c05_3"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_055:0452c07_4"
    },
    {
        "source_sentence": "何因緣故，菩薩摩訶薩不為受色學，不為滅色學，乃至一切種智亦不為受學，亦不為滅學？」",
        "translation": "Why is it that the bodhisattva Mahāsattva doesn't train in form and doesn't train in the cessation of form, and why does he not train in all kinds of cognition and doesn't train in the cessation of cognition?",
        "source": "T25n1509_055:0452c07_5"
    },
    {
        "source_sentence": "須菩提言：「是色不可受，亦無受色者，乃至一切種智不可受，亦無受者，內外空故。",
        "translation": "Suppository of enlightenment said, This is form that's unacceptable and there's no receiver of form, up to the point where all kinds of cognition are unacceptable and there's no receiver because internal and external emptiness are empty.",
        "source": "T25n1509_055:0452c09_6"
    },
    {
        "source_sentence": "如是，舍利弗！",
        "translation": "So it is, Śāriputra!",
        "source": "T25n1509_055:0452c11_7"
    },
    {
        "source_sentence": "菩薩摩訶薩一切法不受故，能到一切種智。」",
        "translation": "Because the bodhisattva Mahāsattva doesn't accept all dharmas, he can attain omniscience.",
        "source": "T25n1509_055:0452c11_8"
    },
    {
        "source_sentence": "是時，舍利弗語須菩提：「菩薩摩訶薩如是學般若波羅蜜，能到一切種智耶？」",
        "translation": "Śāriputra then said to Subhūti, Can a bodhisattva-mahāsattva thus train in the perfection of wisdom and attain all kinds of cognition?",
        "source": "T25n1509_055:0452c12_9"
    },
    {
        "source_sentence": "須菩提言：「菩薩摩訶薩如是學般若波羅蜜，能到一切種智，一切法不受故。」",
        "translation": "Suppository said, Thus does the bodhisattva Mahāsattva train in the perfection of wisdom, which enables him to attain all kinds of cognition and not accept all dharmas.",
        "source": "T25n1509_055:0452c14_10"
    },
    {
        "source_sentence": "舍利弗語須菩提：「若菩薩摩訶薩於一切法不受、不滅學者，菩薩摩訶薩云何能到一切種智？」",
        "translation": "Śāriputra said to Subhūti, If a bodhisattva-mahāsattva doesn't accept and doesn't cease study all dharmas, how can a bodhisattva-mahāsattva attain the knowledge of all kinds?",
        "source": "T25n1509_055:0452c16_11"
    },
    {
        "source_sentence": "須菩提言：「菩薩摩訶薩行般若波羅蜜，不見色生、不見色滅；",
        "translation": "Suppository of enlightenment said, When bodhisattvas and mahāsattvas practice the perfection of wisdom, they don’t see form arising or ceasing.",
        "source": "T25n1509_055:0452c18_12"
    },
    {
        "source_sentence": "不見色受、不見色不受，不見色垢、不見色淨，不見色增、不見色減。",
        "translation": "They don't see form as sensation, don't see form as sensation, don't see form as defilement, don't see form as purity, don't see form increase and don't see form decrease.",
        "source": "T25n1509_055:0452c19_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0452c21_14"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_055:0452c21_15"
    },
    {
        "source_sentence": "色，色性空故。",
        "translation": "form: because the nature of form is emptiness.",
        "source": "T25n1509_055:0452c21_16"
    },
    {
        "source_sentence": "受、想、行。",
        "translation": "feeling, perception, and volition.",
        "source": "T25n1509_055:0452c22_0"
    },
    {
        "source_sentence": "識亦不見生、亦不見滅，亦不見受、亦不見不受，亦不見垢、亦不見淨，亦不見增、亦不見減。",
        "translation": "Consciousness doesn't see birth or cessation, doesn't see sensation or non- sensation, doesn't see defilement or purity, and doesn't see increase or decrease.",
        "source": "T25n1509_055:0452c22_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0452c24_2"
    },
    {
        "source_sentence": "識，識性空故。",
        "translation": "Consciousness, because the nature of consciousness is empty.",
        "source": "T25n1509_055:0452c24_3"
    },
    {
        "source_sentence": "乃至一切種智亦不見生亦不見滅，亦不見受、亦不見不受，亦不見垢、亦不見淨，亦不見增、亦不見減。",
        "translation": "All kinds of cognition also don't see birth and don't see cessation, don't see sensation and don't see sensation, don't see defilement and don't see purity, don't see increase and don't see decrease.",
        "source": "T25n1509_055:0452c24_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0452c27_0"
    },
    {
        "source_sentence": "一切種智，一切種智性空故。",
        "translation": "All kinds of cognition, because the nature of all kinds of cognition is empty.",
        "source": "T25n1509_055:0452c27_1"
    },
    {
        "source_sentence": "如是，舍利弗！",
        "translation": "So it is, Śāriputra!",
        "source": "T25n1509_055:0452c27_2"
    },
    {
        "source_sentence": "菩薩摩訶薩為一切法不生不滅、不受不捨、不垢不淨、不合不散，不增不減故，學般若波羅蜜，能到一切種智，無所學、無所到故。」",
        "translation": "Because all things don't arise or cease, aren't received or abandoned, aren't dirty or pure, don't combine or disperse, don't increase or decrease, and train in the perfection of prajñāpāramitā, bodhisattvas and mahāsattvas can attain all kinds of cognition because there's nothing to learn and nothing to attain.",
        "source": "T25n1509_055:0452c28_3"
    },
    {
        "source_sentence": "【論】釋曰：釋提桓因歡喜言：「須菩提其智甚深，不壞假名而說諸法實相。」",
        "translation": "[Commentary] Explanation: Śakra Devānām-Indra rejoiced and said, Suppose someone's wisdom is so profound that they don't destroy nominal names and explain the true characteristics of dharmas.",
        "source": "T25n1509_055:0453a03_0"
    },
    {
        "source_sentence": "爾時，佛讚須菩提言：「如是！",
        "translation": "It was then that the Buddha praised Subhūti, saying, So it is!",
        "source": "T25n1509_055:0453a04_1"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T25n1509_055:0453a05_2"
    },
    {
        "source_sentence": "如釋所言。」",
        "translation": "It's as explained in the explanation.",
        "source": "T25n1509_055:0453a05_3"
    },
    {
        "source_sentence": "問曰：佛何故讚須菩提？",
        "translation": "Q: Why did the Buddha praise Suppository of Enlightenment?",
        "source": "T25n1509_055:0453a05_4"
    },
    {
        "source_sentence": "答曰：示師不自高，弟子承順師法故。",
        "translation": "Answer: Showing a teacher doesn't make oneself superior because the disciple follows the teacher's teaching.",
        "source": "T25n1509_055:0453a06_5"
    },
    {
        "source_sentence": "有人師所說，弟子不受；",
        "translation": "Some people do not accept the doctrine taught by their teacher.",
        "source": "T25n1509_055:0453a07_6"
    },
    {
        "source_sentence": "弟子所說，師不聽。",
        "translation": "What the disciple teaches, the teacher won't listen.",
        "source": "T25n1509_055:0453a07_7"
    },
    {
        "source_sentence": "如凡夫人處眾說法時，破一切語不受。",
        "translation": "It's like a worldling who refutes all words and doesn't accept them when she teaches the Dharma to the crowd.",
        "source": "T25n1509_055:0453a08_8"
    },
    {
        "source_sentence": "以佛無吾我心故，讚須菩提言：「如是！",
        "translation": "Because the Buddha has no self or mind, he praised Suppository of Enlightenment, saying, So it is!",
        "source": "T25n1509_055:0453a09_9"
    },
    {
        "source_sentence": "如是！」",
        "translation": "So it is!",
        "source": "T25n1509_055:0453a10_0"
    },
    {
        "source_sentence": "復次，佛以大悲心，欲令眾生信受須菩提所說故，讚言：「其智甚深。」",
        "translation": "Furthermore, with great compassion, the Buddha wanted to cause sentient beings to believe what Subhūti taught and praised it, saying, That knowledge is profound.",
        "source": "T25n1509_055:0453a10_1"
    },
    {
        "source_sentence": "菩薩知一切法假名，則應般若波羅蜜學。",
        "translation": "Knowing the provisional names of all dharmas, bodhisattvas should train in the prajñāpāramitā.",
        "source": "T25n1509_055:0453a11_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_055:0453a12_3"
    },
    {
        "source_sentence": "一切法但有假名，皆隨順般若波羅蜜畢竟空相故。",
        "translation": "All dharmas simply have nominal names, because they all follow the ultimate characteristic of emptiness in the perfection of wisdom.",
        "source": "T25n1509_055:0453a12_4"
    },
    {
        "source_sentence": "「如是學，不學色」者，假名法中無有定色，若無色者，云何「學色」？",
        "translation": "The phrase thus training and not training form means that there are no set forms in nominal dharmas, but if there are formless forms, then what is the form of training?",
        "source": "T25n1509_055:0453a14_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0453a15_6"
    },
    {
        "source_sentence": "菩薩以五眼求色，而不見是色若我、若無我等相；",
        "translation": "“Enlightening beings use the five eyes to search for form, yet they do not see such characteristics as form, self, or selflessness.",
        "source": "T25n1509_055:0453a15_7"
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "It's likewise with all kinds of cognition.",
        "source": "T25n1509_055:0453a16_8"
    },
    {
        "source_sentence": "「何以故不見色」者，答言：色中色相空，不可得故不可見，即是自相空。",
        "translation": "The reason why they don't see form answers, saying, In form, form and characteristics are empty, and because they can't be obtained, they can't be seen, which means their own characteristics are empty.",
        "source": "T25n1509_055:0453a17_9"
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "It's likewise with all kinds of cognition.",
        "source": "T25n1509_055:0453a19_0"
    },
    {
        "source_sentence": "復次，「不學色」者，是色空即自不能學色空，以諸法行於他相、不行自相故；",
        "translation": "Furthermore, not training in form means that emptiness of form is the emptiness of form which one cannot train in oneself: because all factors act with other characteristics and do not act with their own characteristics.",
        "source": "T25n1509_055:0453a19_1"
    },
    {
        "source_sentence": "譬如人乘馬，非馬乘馬。",
        "translation": "It's like a person riding a horse, not a horse riding a horse.",
        "source": "T25n1509_055:0453a21_2"
    },
    {
        "source_sentence": "問曰：若如是不學一切法，云何「學一切智」？",
        "translation": "Q: If someone thus doesn't train in all dharmas, how does it mean to train in all cognition?",
        "source": "T25n1509_055:0453a21_3"
    },
    {
        "source_sentence": "答曰：是中說：「若能於諸法空中無所著，是為真學色空。」",
        "translation": "Answer: Here, it's said, If you can be unattached in the sky of dharmas, this is true training in form and emptiness.",
        "source": "T25n1509_055:0453a22_4"
    },
    {
        "source_sentence": "若著空者，是破諸法而不破空。",
        "translation": "If someone is attached to emptiness, they refute dharmas and don't refute emptiness.",
        "source": "T25n1509_055:0453a24_5"
    },
    {
        "source_sentence": "若人破色而不著空，是則色與空不二不別，是為能學色空，以不可得空故不見空。",
        "translation": "If someone breaks through form and doesn't cling to emptiness, then form and emptiness are not two and not distinct, which is how they can train in the emptiness of form and not see emptiness because it's unobtainable.",
        "source": "T25n1509_055:0453a25_6"
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "It's likewise with all kinds of cognition.",
        "source": "T25n1509_055:0453a27_7"
    },
    {
        "source_sentence": "「無量無邊阿僧祇佛法」者，是讚一切種智。",
        "translation": "The phrase immeasurable, limitless, and incalculable buddha-dharma praises all kinds of cognition.",
        "source": "T25n1509_055:0453a27_8"
    },
    {
        "source_sentence": "上一切種智，是菩薩心中有量有限，在佛心中則無量無限。",
        "translation": "The above-mentioned omniscience is limited in the mind of a bodhisattva, but immeasurable and limitless in the mind of a buddha.",
        "source": "T25n1509_055:0453a28_9"
    },
    {
        "source_sentence": "以是故，上雖說學佛法，今更別說。",
        "translation": "For this reason, even though the above explains training in the Buddha's teachings, we'll explain them separately.",
        "source": "T25n1509_055:0453b01_10"
    },
    {
        "source_sentence": "若能如是學，正行菩薩道，不增減色學。",
        "translation": "If someone can train in this way, they'll correctly practice the bodhisattva path and not increase or decrease their training in form.",
        "source": "T25n1509_055:0453b02_11"
    },
    {
        "source_sentence": "「不增」者，若但見四大及造色和合成身者，則不生著。",
        "translation": "The phrase not increasing means that if someone simply sees the four elements and the combined body of form and formlessness, then they won't become attached.",
        "source": "T25n1509_055:0453b03_12"
    },
    {
        "source_sentence": "以於是身中起男女、好醜、長短相，謂為定實，生染著心，是為「增」。",
        "translation": "It's because male and female, good and ugly, long and short characteristics arise in their bodies, which are called the real nature of concentration and give rise to defiled attachment.",
        "source": "T25n1509_055:0453b04_13"
    },
    {
        "source_sentence": "若破色使空，心著是空，是為「減」。",
        "translation": "If someone refutes form and makes it empty, and their mind clings to emptiness as emptiness, this is called decrease.",
        "source": "T25n1509_055:0453b05_14"
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "It's likewise with all kinds of cognition.",
        "source": "T25n1509_055:0453b06_15"
    },
    {
        "source_sentence": "「不受、不滅」者，空故「不受」；",
        "translation": "“Non-acquisition and non-cessation” means that because of emptiness, it is not acquired.",
        "source": "T25n1509_055:0453b07_16"
    },
    {
        "source_sentence": "業果因緣相續故「不滅」。",
        "translation": "Because the causes and conditions of karma continue, it doesn't cease.",
        "source": "T25n1509_055:0453b07_17"
    },
    {
        "source_sentence": "是中須菩提自說因緣：「色受者，不可得故不受。」",
        "translation": "Here, Suppository explains the causes and conditions for self-causation, Form sensation is received because form is unobtainable and therefore not received.",
        "source": "T25n1509_055:0453b08_18"
    },
    {
        "source_sentence": "又以色內外空故「不受」，以色中內外空空故「不滅」。",
        "translation": "It's also because form is empty of internal and external emptiness that it doesn't abide, and because form is empty of internal and external emptiness that it doesn't cease.",
        "source": "T25n1509_055:0453b09_19"
    },
    {
        "source_sentence": "問曰：應以十八空空諸法，此中何以但說「內、外空」？",
        "translation": "Q: You should use the 18 dharmas of emptiness as emptiness, but why are they only described here as internal and external emptiness?",
        "source": "T25n1509_055:0453b10_20"
    },
    {
        "source_sentence": "答曰：受色者無故說「內空」，色不可受故名「外空」。",
        "translation": "Answer: It's called internal emptiness because form that's received is nonexistent, and it's called external emptiness because form can't be received.",
        "source": "T25n1509_055:0453b11_21"
    },
    {
        "source_sentence": "是內、外空，則攝一切法空。",
        "translation": "If it's internal and external emptiness, then it includes the emptiness of all dharmas.",
        "source": "T25n1509_055:0453b12_22"
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "It's likewise with all kinds of cognition.",
        "source": "T25n1509_055:0453b13_23"
    },
    {
        "source_sentence": "若菩薩能如是學，則出生一切種智。",
        "translation": "If bodhisattvas can thus train, then all kinds of cognition will arise.",
        "source": "T25n1509_055:0453b14_0"
    },
    {
        "source_sentence": "一切種智是無障礙相，若菩薩觀一切法如虛空無障礙，則是學一切種智，因果相似故。",
        "translation": "If a bodhisattva observes all dharmas like space without obstruction, then he's training in all kinds of cognition because causes and effects are similar.",
        "source": "T25n1509_055:0453b14_1"
    },
    {
        "source_sentence": "舍利弗作是念：「菩薩法應當滅一切煩惱，應當受一切諸善法；",
        "translation": "Śāriputra thought: The Dharma of enlightening beings should extinguish all afflictions, and they should receive all wholesome states.",
        "source": "T25n1509_055:0453b16_2"
    },
    {
        "source_sentence": "今不受、不滅學，云何出至薩婆若？」",
        "translation": "Now that you're training in neither acceptance nor cessation, how can you leave up to sarvajña?",
        "source": "T25n1509_055:0453b18_3"
    },
    {
        "source_sentence": "作是念已，問須菩提。",
        "translation": "After he had this thought, he asked Subhūti.",
        "source": "T25n1509_055:0453b19_4"
    },
    {
        "source_sentence": "須菩提答言：「破一切法生相故不生，破一切法無常相故不滅；",
        "translation": "Suppository of enlightenment answered, They do not arise because they refute the characteristics of all things as being produced; they do not perish because they refute the characteristics of impermanence of all things.",
        "source": "T25n1509_055:0453b19_5"
    },
    {
        "source_sentence": "觀一切法種種過罪故不受，觀一切法種種利益故不捨；",
        "translation": "Because of observing the various faults and sins of all things, they do not accept them; because of observing the various benefits of all things, they do not abandon them.",
        "source": "T25n1509_055:0453b21_6"
    },
    {
        "source_sentence": "一切法性常清淨故不垢，一切法能生著心故不淨。",
        "translation": "The nature of all dharmas is always pure because it's not defiled, and all dharmas are impure because they can give rise to mind attachment.",
        "source": "T25n1509_055:0453b22_7"
    },
    {
        "source_sentence": "一切法雖是有作無作、起滅、入出、來往等，而不多不少不增不減。",
        "translation": "Although all dharmas are created and uncreated, arising and ceasing, entering and exiting, coming and going, and so forth, they don't increase or decrease.",
        "source": "T25n1509_055:0453b23_8"
    },
    {
        "source_sentence": "譬如大海，眾流歸之不增，火珠煎之不減；",
        "translation": "Good man, this is analogous to a great ocean in which the various rivers flow back and forth without rising or falling. The flames do not diminish even when being submerged [in water].",
        "source": "T25n1509_055:0453b25_9"
    },
    {
        "source_sentence": "諸法亦如是，法性常住故，一切法自性不可得故。",
        "translation": "The same applies to factors: because the nature of factors always abides: because the specific nature of all factors is ungraspable.",
        "source": "T25n1509_055:0453b26_10"
    },
    {
        "source_sentence": "能如是學，則出到薩婆若，不見學相、不見出相，不見菩薩相、不見般若波羅蜜相。」",
        "translation": "If someone can thus train, then they'll go out to sarvajña and don't see the mark of training or the mark of going out, and they won't see the mark of bodhisattvahood or the mark of prajñāpāramitā.",
        "source": "T25n1509_055:0453b27_11"
    },
    {
        "source_sentence": "此中略說故，但說「無學、無出」。",
        "translation": "Because it's briefly explained here, it only says, There's no training and no escape.",
        "source": "T25n1509_055:0453b29_12"
    },
    {
        "source_sentence": "【經】爾時，釋提桓因語舍利弗：「菩薩摩訶薩般若波羅蜜，當於何處求？」",
        "translation": "[Sutra] At that point, Śakra Devānām-Indra said to Śāriputra, Where will the bodhisattva Mahāsattva prajñāpāramit be sought?",
        "source": "T25n1509_055:0453c02_0"
    },
    {
        "source_sentence": "舍利弗言：「菩薩摩訶薩般若波羅蜜，當於須菩提品中求。」",
        "translation": "Śāriputra said, The bodhisattva Mahāsattva prajñāpāramitā should be sought in the chapter on Subhūti.",
        "source": "T25n1509_055:0453c03_1"
    },
    {
        "source_sentence": "釋提桓因語須菩提：「是汝神力使舍利弗言『菩薩摩訶薩般若波羅蜜，當於須菩提品中求』？」",
        "translation": "Śakra Devānām-Indra said to Suppository, Is it because of your miraculous powers that Śāriputra said, 'The bodhisattva Mahāsattva prajñāpāramitā should be sought in the chapter on Suppository's Enlightenment?'",
        "source": "T25n1509_055:0453c04_2"
    },
    {
        "source_sentence": "須菩提語釋提桓因：「非我神力。」",
        "translation": "Suppository said to Śakra Devānām-Indra, It's not my supernormal power.",
        "source": "T25n1509_055:0453c06_3"
    },
    {
        "source_sentence": "釋提桓因語須菩提：「是誰神力？」",
        "translation": "Śakra Devānām-Indra said to Suppository, Who's this supernormal power?",
        "source": "T25n1509_055:0453c07_4"
    },
    {
        "source_sentence": "須菩提言：「是佛神力。」",
        "translation": "Suppository said, This is the Buddha's supernormal power.",
        "source": "T25n1509_055:0453c08_5"
    },
    {
        "source_sentence": "釋提桓因言：「一切法皆無受處，何以故言是佛神力？",
        "translation": "Śakra Devānām-Indra said, All dharmas have no place of reception, so why does he say it's the Buddha's supernormal power?",
        "source": "T25n1509_055:0453c08_6"
    },
    {
        "source_sentence": "離無受處相，如來不可得；",
        "translation": "The Tathāgata is ungraspable apart from the characteristics of the sphere of sensationlessness.",
        "source": "T25n1509_055:0453c10_7"
    },
    {
        "source_sentence": "離如，如來亦不可得。」",
        "translation": "Being free of thusness, the Tathāgata can't be obtained either.",
        "source": "T25n1509_055:0453c10_8"
    },
    {
        "source_sentence": "須菩提語釋提桓因言：「如是！",
        "translation": "Suppository said to Śakra Devānām-Indra, So it is!",
        "source": "T25n1509_055:0453c11_9"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T25n1509_055:0453c11_10"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0453c11_11"
    },
    {
        "source_sentence": "離無受處相，如來不可得；",
        "translation": "The Tathāgata is ungraspable apart from the characteristics of the sphere of sensationlessness.",
        "source": "T25n1509_055:0453c12_12"
    },
    {
        "source_sentence": "離如，如來亦不可得。",
        "translation": "Being free of thusness, the Tathāgata is also unobtainable.",
        "source": "T25n1509_055:0453c12_13"
    },
    {
        "source_sentence": "無受處相中如來不可得，如中如來不可得。",
        "translation": "The Tathāgata is unobtainable in the characteristic of the absence of sensation, and the Tathāgata is unobtainable in thusness.",
        "source": "T25n1509_055:0453c13_14"
    },
    {
        "source_sentence": "「色如中如來如不可得，如來如中色如不可得。",
        "translation": "The Tathāgata thusness in form is thus, the Tathāgata thusness in form is thus, and the Tathāgata thusness in form is thus.",
        "source": "T25n1509_055:0453c14_15"
    },
    {
        "source_sentence": "色法相中如來法相不可得，如來法相中色法相不可得；",
        "translation": "In the characteristics of form, the characteristics of Buddha are ungraspable; in the characteristics of form, the characteristics of Buddha are ungraspable; in the characteristics of form, the characteristics of Buddha are ungraspable.",
        "source": "T25n1509_055:0453c15_16"
    },
    {
        "source_sentence": "受、想、行、識法相中，乃至一切種智亦如是。",
        "translation": "It's likewise with feeling, perception, volition, and consciousness in the characteristics of things, up to all kinds of cognition.",
        "source": "T25n1509_055:0453c16_17"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0453c17_18"
    },
    {
        "source_sentence": "如來色如中不合不散，受、想、行、識如中不合不散；",
        "translation": "Form of the Buddha is as it is, neither combined nor dispersed; feeling, conceptual identification, conditioning and consciousness are as they are, neither combined nor dispersed.",
        "source": "T25n1509_055:0453c17_19"
    },
    {
        "source_sentence": "如來離色如不合不散，離受、想、行、識如不合不散。",
        "translation": "The Tathāgata is free of form as if it doesn't fit and doesn't disperse, and free of feeling, perception, volition, and consciousness as if they don't fit and don't disperse.",
        "source": "T25n1509_055:0453c18_20"
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "It's likewise with all kinds of cognition.",
        "source": "T25n1509_055:0453c19_21"
    },
    {
        "source_sentence": "如來色法相中不合不散，受、想、行、識法相中不合不散；",
        "translation": "The Tathāgata is neither united with nor dispersed from the characteristics of form and dharmas; he is neither united with nor dispersed from the characteristics of feeling, perception, volition, and consciousness.",
        "source": "T25n1509_055:0453c20_22"
    },
    {
        "source_sentence": "如來離色法相中不合不散，離受、想、行、識法相中不合不散。",
        "translation": "The Tathāgata is free of form and dharmas that aren't combined or dispersed in form, and he's free of feeling, perception, volition, and consciousness that aren't combined or dispersed in the characteristics of feeling, perception, volition, and consciousness.",
        "source": "T25n1509_055:0453c21_23"
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "It's likewise with all kinds of cognition.",
        "source": "T25n1509_055:0453c22_24"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0453c23_25"
    },
    {
        "source_sentence": "如是等一切法中不合不散，是佛神力，用無所受法故。",
        "translation": "Such things as these are not combined or dispersed among all dharmas, which is the Buddha's miraculous power because it uses the Dharma that receives nothing.",
        "source": "T25n1509_055:0453c23_26"
    },
    {
        "source_sentence": "「如憍尸迦言：『菩薩摩訶薩般若波羅蜜，當於何處求？』",
        "translation": "As Kauśika said, 'Where will the bodhisattva Mahāsattva prajñāpāramitā be sought?'",
        "source": "T25n1509_055:0453c24_27"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0453c26_28"
    },
    {
        "source_sentence": "不應色中求般若波羅蜜，亦不應離色求般若波羅蜜；",
        "translation": "You should not seek the transcendent wisdom in form, and you should not seek the transcendent wisdom apart from form.",
        "source": "T25n1509_055:0453c26_29"
    },
    {
        "source_sentence": "不應受、想、行、識中求，亦不應離受、想、行、識求。",
        "translation": "They shouldn't seek it in feeling, perception, volition, or consciousness, and they shouldn't seek it apart from feeling, perception, volition, or consciousness.",
        "source": "T25n1509_055:0453c27_30"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0453c28_31"
    },
    {
        "source_sentence": "是般若波羅蜜，色、受、想、行、識，是一切法皆不合、不散，無色、無形、無對，一相，所謂無相。",
        "translation": "The perfection of wisdom, form, feeling, perception, volition, and consciousness are all things that don't fit together or disperse, lack form, lack form, lack form, lack resistance, and have one characteristic, which is called formless.",
        "source": "T25n1509_055:0453c28_32"
    },
    {
        "source_sentence": "乃至一切種智中不應求般若波羅蜜，亦不應離一切種智求般若波羅蜜。",
        "translation": "They shouldn't seek the perfection of prajñā in all kinds of cognition, and they shouldn't seek the perfection of prajñā apart from all kinds of cognition.",
        "source": "T25n1509_055:0454a01_33"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0454a03_34"
    },
    {
        "source_sentence": "是般若波羅蜜、一切種智，是一切法皆不合、不散，無色、無形、無對，一相，所謂無相。",
        "translation": "This is the prajñāpāramitā and all kinds of cognition, which are all things that don't fit together or disperse, formless, formless, and formless, and have one characteristic, which is called formless.",
        "source": "T25n1509_055:0454a03_35"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0454a05_36"
    },
    {
        "source_sentence": "般若波羅蜜非色、亦非離色，非受想行識、亦非離受想行識；",
        "translation": "The transcendent wisdom is neither form nor formless, not apart from form; it is neither feeling, perception, volition, or consciousness, and not apart from feeling, perception, volition, or consciousness.",
        "source": "T25n1509_055:0454a05_37"
    },
    {
        "source_sentence": "乃至非一切種智、亦非離一切種智。",
        "translation": "It's not all kinds of cognition, and it's not free from all kinds of cognition.",
        "source": "T25n1509_055:0454a06_38"
    },
    {
        "source_sentence": "般若波羅蜜非色如、亦非離色如，非受想行識如、亦非離受想行識如。",
        "translation": "The prajñāpāramitā is not thusness of form and not thusness apart from form, and it's not thusness of feeling, perception, volition, consciousness, or thusness apart from feeling, perception, volition, and consciousness.",
        "source": "T25n1509_055:0454a07_39"
    },
    {
        "source_sentence": "般若波羅蜜非色法、亦非離色法，非受想行識法、亦非離受想行識法。",
        "translation": "The prajñāpāramitā is neither a form dharma nor a form dharma apart from form, and it's not a feeling, perception, volition, or consciousness dharma apart from feeling, perception, volition, or consciousness dharma.",
        "source": "T25n1509_055:0454a09_40"
    },
    {
        "source_sentence": "乃至非一切種智如、亦非離一切種智如；",
        "translation": "It is neither the thusness of omniscience nor the thusness apart from omniscience.",
        "source": "T25n1509_055:0454a10_41"
    },
    {
        "source_sentence": "般若波羅蜜非一切種智法、亦非離一切種智法。",
        "translation": "The perfection of wisdom is not the Dharma of all kinds of cognition, and it's not free of all kinds of cognition.",
        "source": "T25n1509_055:0454a11_42"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0454a13_0"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0454a13_1"
    },
    {
        "source_sentence": "是一切法皆無所有、不可得，以無所有、不可得故，般若波羅蜜非色、亦非離色，非色如、亦非離色如，非色法、亦非離色法；",
        "translation": "Because all things lack existence and are ungraspable, because they lack existence and are ungraspable, the transcendent wisdom is neither form nor formless, not thusness of form or suchness of formlessness, not formless or formless; it is neither form nor formless.",
        "source": "T25n1509_055:0454a13_2"
    },
    {
        "source_sentence": "乃至非一切種智、亦非離一切種智，非一切種智如、亦非離一切種智如，非一切種智法、亦非離一切種智法。」",
        "translation": "It's not all kinds of cognition, and it's not apart from all kinds of cognition; it's not all kinds of cognition as they are, and it's not apart from all kinds of cognition as they are; it's not all kinds of the Dharma of cognition or all kinds of the Dharma of cognition as they are.",
        "source": "T25n1509_055:0454a16_3"
    },
    {
        "source_sentence": "【論】問曰：佛、舍利弗、須菩提從上來種種因緣明般若波羅蜜相，今釋提桓因何以故問「當何處求般若波羅蜜」？",
        "translation": "[Commentary] Q: Buddha, Śāriputra, and Suppository have explained the characteristics of the perfection of wisdom for various reasons since the above, but why did Śakra Devānām-Indra now ask, Where will you seek the perfection of wisdom?",
        "source": "T25n1509_055:0454a19_0"
    },
    {
        "source_sentence": "答曰：此不問般若體，但問般若言說名字可讀誦事，是故舍利弗言：「當於須菩提所說品中求。」",
        "translation": "Answer: This doesn't ask about the essence of prajñā, but asks about the words and names of prajñā that can be recited; therefore, Śāriputra said, You should seek them in the chapter on what Suppository of Enlightenment teaches.",
        "source": "T25n1509_055:0454a21_1"
    },
    {
        "source_sentence": "須菩提樂說空，常善修習空故；",
        "translation": "Enlightenment is delighted with speaking of emptiness, because it always skillfully cultivates emptiness.",
        "source": "T25n1509_055:0454a23_2"
    },
    {
        "source_sentence": "舍利弗雖智慧第一，以無吾我嫉妬心，又斷法愛故，而言「當於須菩提所說品中求」。",
        "translation": "Although Śāriputra was the best in wisdom, he said, You must seek it in the chapter on what Suppository of Enlightenment teaches because you're free of self-jealousy and stop craving the Dharma.",
        "source": "T25n1509_055:0454a24_3"
    },
    {
        "source_sentence": "問曰：佛處處說般若波羅蜜，欲比須菩提所說，百千萬倍不可算數譬喻為比，何以不言「於佛所說品中求」？",
        "translation": "Q: Where did the Buddha teach the prajñāpāramitā, wanting to compare it with what Suppository of Enlightenment taught, and why didn't he say, Seeking in the chapter on the Buddha's teachings?",
        "source": "T25n1509_055:0454a26_4"
    },
    {
        "source_sentence": "答曰：釋提桓因意：「除佛一人，誰能善說者？」",
        "translation": "Answer: Śakra Devānām-Indra said, Except for the Buddha alone, who can explain it well?",
        "source": "T25n1509_055:0454a29_5"
    },
    {
        "source_sentence": "是以推須菩提。",
        "translation": "That's why it's called Suppository of Enlightenment.",
        "source": "T25n1509_055:0454b01_6"
    },
    {
        "source_sentence": "復次，佛常一日一夜六時以佛眼觀眾生，無令不聞法故墮落，是故隨眾生所應解、所應得、所應習行等說。",
        "translation": "Furthermore, the Buddha always observes sentient beings with the Buddha' s eye at six o fclock during one day and night. He does not cause them to fall down because they do not hear the doctrine. That is why he explains it in accordance with what sentient beings should understand, acquire, and practice.",
        "source": "T25n1509_055:0454b01_7"
    },
    {
        "source_sentence": "或說般若波羅蜜無常、苦、空、無我，如病、如癰等，名為「般若波羅蜜」；",
        "translation": "Some people say that the perfection of wisdom is impermanent, painful, empty, and without self, like illness or abscesses, which is called the perfection of wisdom.",
        "source": "T25n1509_055:0454b04_8"
    },
    {
        "source_sentence": "或分別諸法總相、別相，或說諸法因緣和合生，無有作者、受者，無知者、見者，名為「般若波羅蜜」；",
        "translation": "Sometimes they discriminate the general and specific characteristics of all dharmas, sometimes they explain that all dharmas arise from the conjunction of causes and conditions, without author or recipient, without knower or viewer: this is called the perfection of wisdom.",
        "source": "T25n1509_055:0454b05_9"
    },
    {
        "source_sentence": "或時說法空、或說畢竟空，名為「般若波羅蜜」。",
        "translation": "Sometimes they teach emptiness and sometimes they teach ultimate emptiness, which is called the prajñāpāramitā.",
        "source": "T25n1509_055:0454b07_10"
    },
    {
        "source_sentence": "以是故，不言「佛所說品中求」。",
        "translation": "That's why it doesn't say, Seeking in the chapter on what the Buddha teaches.",
        "source": "T25n1509_055:0454b09_0"
    },
    {
        "source_sentence": "又釋提桓因心念：「不知何者定是般若定相？」",
        "translation": "Again, Śakra Devānām-Indra thought to himself, I don't know which one of these concentrations is the mark of prajñāpāramitā?",
        "source": "T25n1509_055:0454b09_1"
    },
    {
        "source_sentence": "是以舍利弗言：「須菩提常深入空，所說皆趣空，所說空亦空；",
        "translation": "That is why Śāriputra said: Enlightenment always enters deeply into emptiness. All that it teaches leads to emptiness, and all that it teaches about emptiness is also empty.",
        "source": "T25n1509_055:0454b10_2"
    },
    {
        "source_sentence": "是故言『當於須菩提所說品中求』。」",
        "translation": "That's why they say, 'Should you seek it in the chapter on what Suppository teaches?'",
        "source": "T25n1509_055:0454b12_3"
    },
    {
        "source_sentence": "釋提桓因歡喜，讚須菩提言：「大德神力甚大！」",
        "translation": "Śakra Devānām-Indra rejoiced and praised Suppository, saying, The great virtues and supernormal powers are so great!",
        "source": "T25n1509_055:0454b12_4"
    },
    {
        "source_sentence": "須菩提謙言：「非是我力，是佛所受神力。」",
        "translation": "Suppositories of enlightenment humbly said, It's not my power; it's the Buddha's supernormal power received.",
        "source": "T25n1509_055:0454b14_0"
    },
    {
        "source_sentence": "釋提桓因言：「若一切法皆無所受，云何言是佛所受神力？",
        "translation": "Śakra Devānām-Indra said, If all dharmas have nothing to receive, how can it be said that they are received by the Buddha's supernormal powers?",
        "source": "T25n1509_055:0454b14_1"
    },
    {
        "source_sentence": "若離無受相，如來不可得；",
        "translation": "If one were to be free of the signlessness of sensation, the Buddha would not be found.",
        "source": "T25n1509_055:0454b16_2"
    },
    {
        "source_sentence": "離如中，如來不可得。」",
        "translation": "Being free of suchness, the Tathāgata can't be obtained.",
        "source": "T25n1509_055:0454b16_3"
    },
    {
        "source_sentence": "釋提桓因作是念言：「一切法無受相，一切法空，無依止處，云何當言定有如來？",
        "translation": "Śakra Devānām-Indra had this thought, saying, All dharmas lack the characteristics of sensation, all dharmas are empty, and there's no basis, so how could it be said that there's a Tathāgata in concentration?",
        "source": "T25n1509_055:0454b17_4"
    },
    {
        "source_sentence": "若無如來，云何有所受神力？",
        "translation": "If there were no Tathāgata, how could anyone experience supernormal powers?",
        "source": "T25n1509_055:0454b19_5"
    },
    {
        "source_sentence": "又復離無受相，如來亦不可得；",
        "translation": "Furthermore, apart from the characteristic of sensationlessness, the Buddha is also ungraspable.",
        "source": "T25n1509_055:0454b19_6"
    },
    {
        "source_sentence": "今離是如，如來不可得。」",
        "translation": "Now, apart from this thusness, the Tathāgata can't be obtained.",
        "source": "T25n1509_055:0454b20_7"
    },
    {
        "source_sentence": "問曰：無受相與如有何等異？",
        "translation": "Q: What's the difference between the absence of sensation and what's there?",
        "source": "T25n1509_055:0454b21_8"
    },
    {
        "source_sentence": "答曰：諸法實相，亦名無受，亦名如。",
        "translation": "Answer: The true characteristics of dharmas are also called without sensation and are also called thus.",
        "source": "T25n1509_055:0454b22_0"
    },
    {
        "source_sentence": "諸法中不可著，故名無受；",
        "translation": "Because they cannot be attached to any dharmas, they are said to be without sensation.",
        "source": "T25n1509_055:0454b22_1"
    },
    {
        "source_sentence": "諸戲論不能破壞，故名為如。",
        "translation": "Because they can't be broken by conceptual elaborations, they're called thus.",
        "source": "T25n1509_055:0454b23_2"
    },
    {
        "source_sentence": "今如來，空中不可得，離空亦不可得。",
        "translation": "Now, the Tathāgata is unobtainable in space and unobtainable apart from space.",
        "source": "T25n1509_055:0454b24_3"
    },
    {
        "source_sentence": "須菩提然其言：「如是！",
        "translation": "Suppository, however, said, So it is!",
        "source": "T25n1509_055:0454b25_0"
    },
    {
        "source_sentence": "如是！」",
        "translation": "So it is!",
        "source": "T25n1509_055:0454b25_1"
    },
    {
        "source_sentence": "今須菩提廣說其事。",
        "translation": "Now, Suppository of Enlightenment explains these things in detail.",
        "source": "T25n1509_055:0454b25_2"
    },
    {
        "source_sentence": "「無受相、如相中，如來不可得」者，或以佛名名為如來，或以眾生名字名為如來。",
        "translation": "The phrase the Tathāgata is ungraspable because there are no characteristics of sensation and thusness means that either he's called a tathāgata by the names of buddhas or he's called a tathāgata by the names of sentient beings.",
        "source": "T25n1509_055:0454b26_3"
    },
    {
        "source_sentence": "如先世來，後世亦如是去，是亦名如來，亦名如去。",
        "translation": "Just as it came in a previous life, so it will come in a later life. This is also called the Tathāgata and just as it goes.",
        "source": "T25n1509_055:0454b28_0"
    },
    {
        "source_sentence": "如十四置難中說：「死後如去者，為有？",
        "translation": "As it's said in the fourteen difficulties, Is there such a person who leaves after death?",
        "source": "T25n1509_055:0454b29_1"
    },
    {
        "source_sentence": "為無？",
        "translation": "Why is it nonexistent?",
        "source": "T25n1509_055:0454c01_2"
    },
    {
        "source_sentence": "亦有亦無？",
        "translation": "What's also existent and what's not?",
        "source": "T25n1509_055:0454c01_3"
    },
    {
        "source_sentence": "亦非有非無？」",
        "translation": "Is neither existent nor nonexistent?",
        "source": "T25n1509_055:0454c01_4"
    },
    {
        "source_sentence": "佛名如來者，如定光佛等行六波羅蜜，得成佛道；",
        "translation": "The Buddha is called “tathāgata” because, like the buddhas of absorption, they practice the six transcendent ways and attain enlightenment.",
        "source": "T25n1509_055:0454c01_5"
    },
    {
        "source_sentence": "釋迦文佛亦如是來，故名如來。",
        "translation": "Śākyamuni Buddha is also like this, so he's called the Tathāgata.",
        "source": "T25n1509_055:0454c03_6"
    },
    {
        "source_sentence": "如錠光佛等智知諸法如，從如中來，故名如來；",
        "translation": "It is like the buddha Cakravartin Buddha’s knowledge that all things are thusness. Because it comes from suchness, it is called ‘tathāgata’.",
        "source": "T25n1509_055:0454c03_7"
    },
    {
        "source_sentence": "釋迦文佛亦如是來，故名如來。",
        "translation": "Śākyamuni Buddha is also like this, so he's called the Tathāgata.",
        "source": "T25n1509_055:0454c05_8"
    },
    {
        "source_sentence": "此二種如來中，此間說是佛如來。",
        "translation": "Among these two kinds of tathāgatas, this is the buddha-tathāgata that's described here.",
        "source": "T25n1509_055:0454c05_9"
    },
    {
        "source_sentence": "因解佛如來無所有，一切眾生、一切法皆如是亦無所有。",
        "translation": "Because the Buddha understands that the Tathāgata has nothing, all sentient beings and all dharmas are likewise also have nothing.",
        "source": "T25n1509_055:0454c06_10"
    },
    {
        "source_sentence": "無受及如來義，如先說。",
        "translation": "The meaning of neither feeling nor tathagata is as has been said previously.",
        "source": "T25n1509_055:0454c07_11"
    },
    {
        "source_sentence": "今當更略說：無受相、如來相皆空無所有。",
        "translation": "Now, I'll briefly explain that the characteristic of no sensation and the characteristics of the Tathāgata are both empty and lack existence.",
        "source": "T25n1509_055:0454c08_12"
    },
    {
        "source_sentence": "無受相、如相，無定性故無如來。",
        "translation": "There are no characteristics of feeling and thusness, and because there's no set nature, there's no Tathāgata.",
        "source": "T25n1509_055:0454c09_13"
    },
    {
        "source_sentence": "有人言：諸法實相有二種說：一者、諸法相畢竟空，是實；",
        "translation": "Some people claim that there are two kinds of explanation of the true characteristics of all dharmas. 1. The ultimate emptiness of the characteristics of all dharmas is reality.",
        "source": "T25n1509_055:0454c10_14"
    },
    {
        "source_sentence": "二者、有人言：畢竟空可示可說故非實，如涅槃相不可示不可說，是名為實。",
        "translation": "Second, someone says, After all, emptiness can be shown and explained because it's not real, just like the characteristic of nirvāṇa that can't be shown or explained is called real.",
        "source": "T25n1509_055:0454c11_15"
    },
    {
        "source_sentence": "於此二事，畢竟空中如來不可得，破畢竟空實相中如來亦不可得。",
        "translation": "In these two things, the ultimate Tathāgata in space is unobtainable, and the Tathāgata in the true characteristic of refuting ultimate emptiness is also unobtainable.",
        "source": "T25n1509_055:0454c13_16"
    },
    {
        "source_sentence": "畢竟空即是無受相，破畢竟空實相即是如。",
        "translation": "The ultimate emptiness is the characteristic of no sensation, and the true characteristic of refuting ultimate emptiness is thusness.",
        "source": "T25n1509_055:0454c14_17"
    },
    {
        "source_sentence": "從此已下，廣說二義。",
        "translation": "From here, we'll explain the two meanings in detail.",
        "source": "T25n1509_055:0454c15_18"
    },
    {
        "source_sentence": "於五眾乃至一切種智，如來不可得；",
        "translation": "In the fivefold assembly, up to omniscience, the Buddha is ungraspable.",
        "source": "T25n1509_055:0454c16_19"
    },
    {
        "source_sentence": "如來不可得故，云何當有如來神力？",
        "translation": "Because the Tathāgata is unobtainable, how could there be a tathāgata with supernormal powers?",
        "source": "T25n1509_055:0454c17_20"
    },
    {
        "source_sentence": "如來不可得，如上說。",
        "translation": "The Tathāgata is ungraspable, as explained above.",
        "source": "T25n1509_055:0454c18_21"
    },
    {
        "source_sentence": "是五眾非如來，離五眾非如來，五眾不在如來中，如來不在五眾中，如來亦不有五眾。",
        "translation": "These five congregations are not the Tathāgata, and apart from the five congregations that are not the Tathāgata, the five congregations aren't in the Tathāgata, the Tathāgata isn't in the five congregations, and the Tathāgata doesn't have five congregations.",
        "source": "T25n1509_055:0454c18_22"
    },
    {
        "source_sentence": "五眾生滅無常、苦、空、無我相故，非是如來；",
        "translation": "The cessation of the five kinds of sentient beings is impermanent, painful, empty, and selfless because they are not buddhas.",
        "source": "T25n1509_055:0454c20_23"
    },
    {
        "source_sentence": "若是如來者，如來亦應是生滅。",
        "translation": "If this were the Tathagata, then the Tathagata would also be arising and ceasing.",
        "source": "T25n1509_055:0454c21_24"
    },
    {
        "source_sentence": "復次，五眾是五法，如來是一，云何五法作一？",
        "translation": "Furthermore, the five collections are five dharmas. The tathagatas are one and the same: how can five dharmas make one?",
        "source": "T25n1509_055:0454c22_25"
    },
    {
        "source_sentence": "若五即是一，一亦應即是五；",
        "translation": "If five were one, they would be one. One should also be five.",
        "source": "T25n1509_055:0454c23_26"
    },
    {
        "source_sentence": "若爾者，世間法、出世間法，一切亂壞！",
        "translation": "If that's the case, worldly dharmas and transmundane dharmas will all be in disarray!",
        "source": "T25n1509_055:0454c24_27"
    },
    {
        "source_sentence": "如是種種因緣故，五眾非如來。",
        "translation": "Because of these various causes and conditions, the five congregations aren't tathāgatas.",
        "source": "T25n1509_055:0454c24_28"
    },
    {
        "source_sentence": "若離五眾有如來者，如來應無見、無聞、無知、無識，亦不覺苦樂。",
        "translation": "If the Tathāgata were to exist apart from the fivefold assembly, the Tathāgata would have no views, no hearing, no knowing, and no consciousness, and he wouldn't experience pain or pleasure.",
        "source": "T25n1509_055:0454c25_29"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_055:0454c27_30"
    },
    {
        "source_sentence": "知覺等是五眾法故。",
        "translation": "Knowing and feeling are the five kinds of dharmas.",
        "source": "T25n1509_055:0454c27_31"
    },
    {
        "source_sentence": "問曰：如來用眼、耳、智慧等能知見者，有何咎？",
        "translation": "Q: What's the blame for someone who uses their eyes, ears, wisdom, and so forth to know and see?",
        "source": "T25n1509_055:0454c27_32"
    },
    {
        "source_sentence": "答曰：能見是眼，非是如來。",
        "translation": "Answer: It's the eye that can see, not the Tathāgata.",
        "source": "T25n1509_055:0454c29_0"
    },
    {
        "source_sentence": "若如來非見相用眼能見者，未取色時，云何知用是眼？",
        "translation": "If the Tathāgata doesn't see characteristics and uses the eye to see them, then how would he know that he uses the eye when he doesn't grasp form?",
        "source": "T25n1509_055:0454c29_1"
    },
    {
        "source_sentence": "亦可用耳見！",
        "translation": "You can also see it with your ears!",
        "source": "T25n1509_055:0455a02_0"
    },
    {
        "source_sentence": "問曰：如來用智慧分別能知，眼是能見，餘不能見，以是故用眼，不取餘根！",
        "translation": "Q: The Tathāgata uses wisdom to discern and know that the eye is capable of seeing, but the others can't see; therefore, he uses the eye and doesn't grasp the other faculties!",
        "source": "T25n1509_055:0455a02_1"
    },
    {
        "source_sentence": "答曰：知亦如眼過，知是五眾，非是如來。",
        "translation": "Answer: Knowing is also like the fault of the eye, knowing that these are the five groups of people who aren't the Tathāgata.",
        "source": "T25n1509_055:0455a04_2"
    },
    {
        "source_sentence": "若用知知眼，復用何事能知此知？",
        "translation": "If someone uses the eye of knowing and knowing, what else can they use to know this knowing?",
        "source": "T25n1509_055:0455a05_3"
    },
    {
        "source_sentence": "問曰：如來用知知眼，以眼知色；",
        "translation": "Q: The Tathāgata knows the eye with knowledge, knowing matter by means of the eye.",
        "source": "T25n1509_055:0455a05_4"
    },
    {
        "source_sentence": "若欲知如來，以何得知？",
        "translation": "If you want to know the Tathāgata, how can you know him?",
        "source": "T25n1509_055:0455a06_5"
    },
    {
        "source_sentence": "若以如來知如來，是則無窮！",
        "translation": "If someone knows the Tathāgata because of the Tathāgata, they'll know the Tathāgata, which is infinite!",
        "source": "T25n1509_055:0455a07_6"
    },
    {
        "source_sentence": "答曰：知相知中住。",
        "translation": "Answer: Knowing characteristics and knowing the middle abode.",
        "source": "T25n1509_055:0455a08_7"
    },
    {
        "source_sentence": "如來若知，即是知相；",
        "translation": "If the Tathagata knows, that is to say, he knows characteristics.",
        "source": "T25n1509_055:0455a08_8"
    },
    {
        "source_sentence": "若是知相，則是無常；",
        "translation": "If they know characteristics, then they are impermanent.",
        "source": "T25n1509_055:0455a09_0"
    },
    {
        "source_sentence": "若無常者，則無後世！",
        "translation": "If it were impermanent, there would be no afterlife!",
        "source": "T25n1509_055:0455a09_1"
    },
    {
        "source_sentence": "復次，離五眾有如來者，如來應是常，如虛空相不應變異受苦受樂，亦應無縛無解，有如是等過罪。",
        "translation": "Furthermore, if the Tathagata exists apart from the five groups of beings, then the Tathagata should be eternal. Just as the characteristics of space are impermanent and changeless, experience suffering and enjoying bliss, there should also be neither bondage nor disjunction. There is a transgression such as this.",
        "source": "T25n1509_055:0455a09_2"
    },
    {
        "source_sentence": "破異故，五眾不在如來，如來不在五眾，亦非如來有五眾。",
        "translation": "Because it refutes differences, the five congregations aren't in the Tathāgata, and the Tathāgata isn't in the five congregations, so it's not that the Tathāgata has five congregations.",
        "source": "T25n1509_055:0455a12_3"
    },
    {
        "source_sentence": "問曰：應以五眾因緣故有如來；",
        "translation": "Question: There should be a buddha by reason of five reasons.",
        "source": "T25n1509_055:0455a13_4"
    },
    {
        "source_sentence": "若無五眾，則無如來。",
        "translation": "If there were no five assemblies, there would be no Tathāgata.",
        "source": "T25n1509_055:0455a14_5"
    },
    {
        "source_sentence": "答曰：若以五眾因緣有如來者，則如來無自性；",
        "translation": "Answer: When there is a tathagata because of five reasons, then the Tathagata has no self-nature.",
        "source": "T25n1509_055:0455a15_6"
    },
    {
        "source_sentence": "若無自性，何得從他性生？",
        "translation": "If there were no self-nature, how could it arise from other natures?",
        "source": "T25n1509_055:0455a16_7"
    },
    {
        "source_sentence": "於五眾中，五種求如來不可得，是故無如來。",
        "translation": "Among the five assemblies, there are five kinds of seeking tathāgatas that are unobtainable, so there are no tathāgatas.",
        "source": "T25n1509_055:0455a16_8"
    },
    {
        "source_sentence": "但以戲論故，說有如來；",
        "translation": "It is only because of conceptual elaborations that they say there is a buddha.",
        "source": "T25n1509_055:0455a17_9"
    },
    {
        "source_sentence": "以斷戲論故，無如來。",
        "translation": "Because it stops conceptual elaborations, there's no Tathāgata.",
        "source": "T25n1509_055:0455a18_10"
    },
    {
        "source_sentence": "如來是不生不滅法，云何當以戲論求於如來？",
        "translation": "The Tathāgata is a dharma that neither arises nor ceases, so how could you seek the Tathāgata with conceptual elaborations?",
        "source": "T25n1509_055:0455a19_0"
    },
    {
        "source_sentence": "若以戲論求如來者，則不見如來。",
        "translation": "If someone pursues the Tathāgata with conceptual elaborations, they won't see the Tathāgata.",
        "source": "T25n1509_055:0455a20_1"
    },
    {
        "source_sentence": "若當都無如來，則墮邪見！",
        "translation": "If there were no Tathāgata at all, then they'd fall into wrong views!",
        "source": "T25n1509_055:0455a21_0"
    },
    {
        "source_sentence": "是故，若以有、無戲論求如來，是則不然！",
        "translation": "Therefore, if someone were to seek the Tathāgata with existence or without conceptual elaborations, that wouldn't be right!",
        "source": "T25n1509_055:0455a21_1"
    },
    {
        "source_sentence": "如來相即是一切法相，一切法相即是如來相；",
        "translation": "The characteristics of a buddha are the characteristics of all things. The characteristics of all things are the characteristics of a buddha.",
        "source": "T25n1509_055:0455a22_2"
    },
    {
        "source_sentence": "如來相即是畢竟空相，畢竟空相即是一切法相。",
        "translation": "The characteristic of the Tathāgata is the ultimate characteristic of emptiness, and the ultimate characteristic of emptiness is the characteristic of all dharmas.",
        "source": "T25n1509_055:0455a23_3"
    },
    {
        "source_sentence": "問曰：此中何以但說二事，言「五眾如中無如來如，如來如中無五眾如」？",
        "translation": "Q: Why are these only two things explained here, saying, There's no tathāgata-tathāgata among the five kinds of thusness and no five kinds of thusness among the Tathāgata-tathāgata?",
        "source": "T25n1509_055:0455a24_4"
    },
    {
        "source_sentence": "答曰：此是略說；",
        "translation": "Answer: This is a brief explanation.",
        "source": "T25n1509_055:0455a26_5"
    },
    {
        "source_sentence": "說二，則五事都攝。",
        "translation": "When two are spoken of, then all five things are included.",
        "source": "T25n1509_055:0455a26_6"
    },
    {
        "source_sentence": "復次，二十種我見，雖一切凡夫人有，不能一時起。",
        "translation": "Furthermore, even though all ordinary people have these twenty kinds of view of self, they can't arise at once.",
        "source": "T25n1509_055:0455a27_7"
    },
    {
        "source_sentence": "今是會中，或此二事，以是故，但說二事。",
        "translation": "In this assembly, sometimes these two things are spoken of. That is why we only speak of two things.",
        "source": "T25n1509_055:0455a28_8"
    },
    {
        "source_sentence": "如五眾，乃至一切種智亦如是。",
        "translation": "So it is with the five assemblies, up to all kinds of cognition.",
        "source": "T25n1509_055:0455a29_9"
    },
    {
        "source_sentence": "五眾法相乃至一切種智法相亦如是。",
        "translation": "The five characteristics of all dharmas and even the characteristics of all kinds of cognition are likewise.",
        "source": "T25n1509_055:0455b01_10"
    },
    {
        "source_sentence": "五眾如，即是法相。",
        "translation": "The five collections of thusness are the characteristics of dharmas.",
        "source": "T25n1509_055:0455b02_0"
    },
    {
        "source_sentence": "問曰：若如即是法相，何以重說？",
        "translation": "Q: If thusness is the characteristic of dharmas, why is it repeatedly explained?",
        "source": "T25n1509_055:0455b02_1"
    },
    {
        "source_sentence": "答曰：行者既到五眾如，心驚，法相何以畢竟空無所有！",
        "translation": "Answer: When the practitioner arrives at the five groups of thusness, his mind is frightened, and how could the characteristics of dharmas be ultimately empty and lack existence?",
        "source": "T25n1509_055:0455b03_2"
    },
    {
        "source_sentence": "是故說五眾法法相自爾。",
        "translation": "Therefore, it's said that the characteristics of the five sets of dharmas and dharmas are self-existent.",
        "source": "T25n1509_055:0455b04_3"
    },
    {
        "source_sentence": "如人觸火燒手，則無慍心，以其火相自爾故；",
        "translation": "Just as when someone touches a hand burned by fire, they have no thoughts of burning because the characteristics of that fire are inherent in it.",
        "source": "T25n1509_055:0455b05_4"
    },
    {
        "source_sentence": "若人執火燒之，則忿然而怒，以其執火燒故。",
        "translation": "If someone holds a fire and burns it, they'll be angry and furious because they're holding the fire and burning it.",
        "source": "T25n1509_055:0455b06_5"
    },
    {
        "source_sentence": "「如來五眾如中、五眾法相中，不合不散」者，除五眾如無如來，即是一相，所謂無相。",
        "translation": "The phrase the Tathāgata's five dharmas are thusness within the five dharmas and not combined or dispersed within the five dharmas means that except for the five dharmas as they are without the Tathāgata, there's one characteristic, which is called formless.",
        "source": "T25n1509_055:0455b07_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_055:0455b09_7"
    },
    {
        "source_sentence": "一法無合無散故，二法故有合有散。",
        "translation": "Because one factor is not combined and not dispersed, and because two factors are combined and dispersed because of these two factors.",
        "source": "T25n1509_055:0455b09_8"
    },
    {
        "source_sentence": "離五眾法相，亦無合無散。",
        "translation": "Being free of the characteristics of the five dharmas, there's neither unity nor dispersal.",
        "source": "T25n1509_055:0455b10_9"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_055:0455b11_0"
    },
    {
        "source_sentence": "離五眾法相，如來不可得故。",
        "translation": "Being free of the five characteristics of dharmas, the Tathāgata is unobtainable.",
        "source": "T25n1509_055:0455b11_1"
    },
    {
        "source_sentence": "如來如、法相，五眾如、法相無二無別，故言：「離五眾如、五眾法相，亦不合不散。」",
        "translation": "The Tathāgata's thusness and Dharma characteristics, the fivefold thusness and Dharma characteristics are not two or different, so he says, Being free of the fivefold thusness and fivefold Dharma characteristics, they don't fit or disperse either.",
        "source": "T25n1509_055:0455b11_2"
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "It's likewise with all kinds of cognition.",
        "source": "T25n1509_055:0455b13_3"
    },
    {
        "source_sentence": "能如是知諸法如、法相不合不散故，有是神力。",
        "translation": "It's because they can thus know that all things are as they are and the characteristics of things aren't combined or dispersed, and they have this supernormal power.",
        "source": "T25n1509_055:0455b14_4"
    },
    {
        "source_sentence": "「當於何處求」者，上來因佛神力說般若相，今直說云何求般若。",
        "translation": "Where should we seek? means that the above is a statement of the characteristics of prajñā because of the Buddha's miraculous powers, and now it's a direct explanation of how to seek prajñā.",
        "source": "T25n1509_055:0455b15_5"
    },
    {
        "source_sentence": "論者言：五眾虛誑無常，本無今有，已有還無，如幻如夢；",
        "translation": "The Vātsīputrīyas say: The five categories of falsehoods are impermanent, which were nonexistent in the past but exist now. Having existed, they return to nonexistence like illusions or dreams.",
        "source": "T25n1509_055:0455b16_6"
    },
    {
        "source_sentence": "般若波羅蜜是諸佛實智慧，云何當於五眾中求？",
        "translation": "The prajñāpāramitā is the true wisdom of the buddhas, so how should it be sought among the five groups of people?",
        "source": "T25n1509_055:0455b18_7"
    },
    {
        "source_sentence": "譬如求重寶，必於大海寶山中求，不應在溝瀆臭穢處求。",
        "translation": "It's like looking for a precious treasure that mustn't be sought in a great ocean of treasures or a mountain, and it shouldn't be sought in a foul-smelling place in a ditch.",
        "source": "T25n1509_055:0455b19_8"
    },
    {
        "source_sentence": "離五眾則無生無滅、無作無起、無有法相，是中云何可求？",
        "translation": "Being free of the fivefold assemblies, there's no arising and no ceasing, no doing and no arising, and no characteristics of dharmas, so how can they be sought?",
        "source": "T25n1509_055:0455b20_9"
    },
    {
        "source_sentence": "復次，五眾、般若波羅蜜，不一不異、不合不散，無色、無形、無對，一相，所謂「無相」。",
        "translation": "Furthermore, the five congregations and the prajñāpāramitā are not one and the same, not different, not combined or dispersed, formless, formless, formless, and formless, and have one characteristic, which is called formless.",
        "source": "T25n1509_055:0455b22_10"
    },
    {
        "source_sentence": "問曰：般若波羅蜜，是智慧心數法故，可應無色、無形、無對；",
        "translation": "Q: The perfection of wisdom, because it is the mental principle of wisdom, should be formless, formless, and formless.",
        "source": "T25n1509_055:0455b23_11"
    },
    {
        "source_sentence": "五眾中色眾，云何當說無形、無對？",
        "translation": "Among the five kinds of sentient beings, how can form and formlessness be described as formless or formless?",
        "source": "T25n1509_055:0455b25_12"
    },
    {
        "source_sentence": "答曰：聖人以慧眼觀諸法平等皆空，一相，所謂無相；",
        "translation": "Answer: A holy person observes all things equally as emptiness with the eye of wisdom. The one characteristic is so-called signless.",
        "source": "T25n1509_055:0455b25_13"
    },
    {
        "source_sentence": "以是故，色眾無形、無對。",
        "translation": "Because of this, the multitude of form has no form and no opposites.",
        "source": "T25n1509_055:0455b27_14"
    },
    {
        "source_sentence": "復次，凡夫人所見色非實，種種如先破。",
        "translation": "Furthermore, the form that ordinary people see is not real, and it's various as previously explained.",
        "source": "T25n1509_055:0455b27_15"
    },
    {
        "source_sentence": "復次，有因緣，般若波羅蜜不即是如凡夫人所見五眾；",
        "translation": "Furthermore, there are reasons why the transcendent wisdoms are not like the fivefold assemblies seen by ordinary people.",
        "source": "T25n1509_055:0455b28_16"
    },
    {
        "source_sentence": "破凡夫人所見五眾故，即是般若波羅蜜，故言不離。",
        "translation": "It's because it destroys the five groups of people who see what ordinary people see, which is the prajñāpāramitā, so it's called not separate.",
        "source": "T25n1509_055:0455b29_17"
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "It's likewise with all kinds of cognition.",
        "source": "T25n1509_055:0455c02_18"
    },
    {
        "source_sentence": "如相、法相相，如先說。",
        "translation": "The characteristic marks of suchness and the characteristic marks of factors are as has been said previously.",
        "source": "T25n1509_055:0455c02_19"
    },
    {
        "source_sentence": "【經】釋提桓因語須菩提：「是摩訶波羅蜜，是菩薩摩訶薩般若波羅蜜！",
        "translation": "[Sutra] Śakra Devānām-Indra said to Subhūti, This is the bodhisattva Mahāprajñāpāramitā!",
        "source": "T25n1509_055:0455c04_0"
    },
    {
        "source_sentence": "無量波羅蜜、無邊波羅蜜，是菩薩摩訶薩般若波羅蜜！",
        "translation": "The immeasurable perfection and the limitless perfection are the bodhisattva-mahāsattva prajñāpāramit!",
        "source": "T25n1509_055:0455c05_1"
    },
    {
        "source_sentence": "諸須陀洹、須陀洹果，從是般若波羅蜜中學成；",
        "translation": "The fruit of stream-entry and the fruit of stream-entry are settled from this as a secondary to the perfection of wisdom.",
        "source": "T25n1509_055:0455c06_2"
    },
    {
        "source_sentence": "乃至諸阿羅漢、阿羅漢果，諸辟支佛、辟支佛道，諸菩薩摩訶薩，皆從是般若波羅蜜中學成；",
        "translation": "All the arhats, all the fruits of arhatship, all the paths of the pratyekabuddhas and the paths of the pratyekabuddhas, and all the bodhisattva mahāsattvas all emerged from this instruction in the perfection of wisdom.",
        "source": "T25n1509_055:0455c07_3"
    },
    {
        "source_sentence": "成就眾生、淨佛世界、得阿耨多羅三藐三菩提，皆從是學成。」",
        "translation": "To accomplish sentient beings, purify the Buddha's world, and attain supreme perfect enlightenment are all formed by training from this.",
        "source": "T25n1509_055:0455c09_4"
    },
    {
        "source_sentence": "須菩提語釋提桓因言：「如是！",
        "translation": "Suppository said to Śakra Devānām-Indra, So it is!",
        "source": "T25n1509_055:0455c11_5"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T25n1509_055:0455c11_6"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0455c12_7"
    },
    {
        "source_sentence": "是摩訶波羅蜜，是菩薩摩訶薩般若波羅蜜！",
        "translation": "This is the great perfection, which is the bodhisattva-mahāsattva prajñāpāramit!",
        "source": "T25n1509_055:0455c12_8"
    },
    {
        "source_sentence": "無量波羅蜜、無邊波羅蜜，是菩薩摩訶薩般若波羅蜜。",
        "translation": "The immeasurable perfection and the limitless perfection are the bodhisattva-mahāsattva prajñāpāramit.",
        "source": "T25n1509_055:0455c13_9"
    },
    {
        "source_sentence": "從是中學成須陀洹果乃至阿羅漢果、辟支佛道、諸菩薩摩訶薩；",
        "translation": "From this middle school they attain the state of stream-enterer, up to the state of arhatship, the path of the pratyekabuddhas, and enlightening beings.",
        "source": "T25n1509_055:0455c14_10"
    },
    {
        "source_sentence": "從是般若波羅蜜中學成成就眾生、淨佛世界、得阿耨多羅三藐三菩提，已得、今得、當得。",
        "translation": "From this school of prajñāpāramitā, the accomplishment of sentient beings who purify the Buddha world and attain unsurpassed, correct, and complete enlightenment has been attained, is attained now, will be attained, and will be attained.",
        "source": "T25n1509_055:0455c15_11"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0455c17_12"
    },
    {
        "source_sentence": "色大故，般若波羅蜜亦大。",
        "translation": "Because form is great, the prajñāpāramitā is also great.",
        "source": "T25n1509_055:0455c18_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0455c18_14"
    },
    {
        "source_sentence": "是色前際不可得，後際不可得，中際不可得。",
        "translation": "This form is unobtainable at the front end, unobtainable at the back end, and unobtainable at the middle end.",
        "source": "T25n1509_055:0455c18_15"
    },
    {
        "source_sentence": "受、想、行、識大故，般若波羅蜜亦大。",
        "translation": "Because feeling, perception, volition, volition, and consciousness are great, the prajñāpāramitā is also great.",
        "source": "T25n1509_055:0455c19_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0455c20_17"
    },
    {
        "source_sentence": "受、想、行、識前際不可得，後際不可得，中際不可得。",
        "translation": "The prior state of feeling, perception, volition, and consciousness are unobtainable, the subsequent state is unobtainable, and the middle state is unobtainable.",
        "source": "T25n1509_055:0455c20_18"
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "It's likewise with all kinds of cognition.",
        "source": "T25n1509_055:0455c22_0"
    },
    {
        "source_sentence": "以是因緣故，憍尸迦！",
        "translation": "Because of these causes and conditions, Kauśika!",
        "source": "T25n1509_055:0455c22_1"
    },
    {
        "source_sentence": "是摩訶波羅蜜，是菩薩摩訶薩般若波羅蜜。",
        "translation": "This is the great perfection, which is the bodhisattva-mahāsattva prajñāpāramit.",
        "source": "T25n1509_055:0455c23_0"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0455c24_0"
    },
    {
        "source_sentence": "色無量故，般若波羅蜜無量。",
        "translation": "Because form is immeasurable, the prajñāpāramitā is immeasurable.",
        "source": "T25n1509_055:0455c24_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0455c24_2"
    },
    {
        "source_sentence": "色量不可得故。",
        "translation": "It's because the amount of form is unobtainable.",
        "source": "T25n1509_055:0455c25_0"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0455c25_1"
    },
    {
        "source_sentence": "譬如虛空量不可得，色亦如是量不可得。",
        "translation": "Just as space is unobtainable in its measure, so too form is unobtainable in its measure.",
        "source": "T25n1509_055:0455c25_2"
    },
    {
        "source_sentence": "虛空無量故，色無量；",
        "translation": "Because space is immeasurable, form is immeasurable.",
        "source": "T25n1509_055:0455c26_3"
    },
    {
        "source_sentence": "色無量故，般若波羅蜜無量。",
        "translation": "Because form is immeasurable, the prajñāpāramitā is immeasurable.",
        "source": "T25n1509_055:0455c26_4"
    },
    {
        "source_sentence": "受、想、行、識，乃至一切種智無量故，般若波羅蜜無量。",
        "translation": "Because sensation, perception, volition, consciousness, and even all kinds of cognition are immeasurable, the prajñāpāramitā is immeasurable.",
        "source": "T25n1509_055:0455c27_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0455c28_6"
    },
    {
        "source_sentence": "一切種智量不可得。",
        "translation": "The amount of all kinds of cognition is unobtainable.",
        "source": "T25n1509_055:0455c28_7"
    },
    {
        "source_sentence": "譬如虛空量不可得，一切種智亦如是量不可得。",
        "translation": "Just as the measure of space is unobtainable, so too the measure of all kinds of cognition is unobtainable.",
        "source": "T25n1509_055:0455c29_8"
    },
    {
        "source_sentence": "虛空無量故，一切種智無量；",
        "translation": "Because space is immeasurable, all kinds of knowledge are immeasurable.",
        "source": "T25n1509_055:0456a01_9"
    },
    {
        "source_sentence": "一切種智無量故，般若波羅蜜無量。",
        "translation": "Because all kinds of cognition are immeasurable, the prajñāpāramitā is immeasurable.",
        "source": "T25n1509_055:0456a02_10"
    },
    {
        "source_sentence": "以是因緣故，是菩薩摩訶薩般若波羅蜜無量。",
        "translation": "Because of these causes and conditions, the bodhisattva Mahāsattva's prajñāpāramitā is immeasurable.",
        "source": "T25n1509_055:0456a03_11"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0456a04_12"
    },
    {
        "source_sentence": "色無邊故，諸菩薩摩訶薩般若波羅蜜無邊。",
        "translation": "Because form has no limit, the bodhisattvas, mahāsattvas, and prajñāpāramitā have no limit.",
        "source": "T25n1509_055:0456a04_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0456a05_14"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0456a05_15"
    },
    {
        "source_sentence": "色前際不可得，後際不可得，中際不可得。",
        "translation": "Form is unobtainable at the front end, unobtainable at the back end, and unobtainable at the middle end.",
        "source": "T25n1509_055:0456a05_16"
    },
    {
        "source_sentence": "受、想、行、識無邊故，般若波羅蜜無邊。",
        "translation": "Because feeling, perception, volition, volition, and consciousness are limitless, the prajñāpāramitā is limitless.",
        "source": "T25n1509_055:0456a06_17"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0456a07_18"
    },
    {
        "source_sentence": "受想行識前際、後際、中際皆不可得故。",
        "translation": "It's because the prior, subsequent, and middle parts of feeling, perception, volition, and consciousness are all unobtainable.",
        "source": "T25n1509_055:0456a07_19"
    },
    {
        "source_sentence": "乃至一切種智無邊故，般若波羅蜜無邊。",
        "translation": "Because all kinds of cognition are limitless, the prajñāpāramitā is limitless.",
        "source": "T25n1509_055:0456a08_20"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0456a09_21"
    },
    {
        "source_sentence": "一切種智前、後、中際不可得故。",
        "translation": "It's because the prior, subsequent, and middle parts of all kinds of cognition are unobtainable.",
        "source": "T25n1509_055:0456a09_22"
    },
    {
        "source_sentence": "以是因緣故，憍尸迦！",
        "translation": "Because of these causes and conditions, Kauśika!",
        "source": "T25n1509_055:0456a10_23"
    },
    {
        "source_sentence": "是般若波羅蜜無邊。",
        "translation": "This is the limitlessness of the perfection of wisdom.",
        "source": "T25n1509_055:0456a11_24"
    },
    {
        "source_sentence": "色無邊，乃至一切種智無邊。",
        "translation": "Form has no limit, and even all kinds of cognition have no limit.",
        "source": "T25n1509_055:0456a11_25"
    },
    {
        "source_sentence": "復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T25n1509_055:0456a12_26"
    },
    {
        "source_sentence": "緣無邊故，般若波羅蜜無邊。」",
        "translation": "Because the conditions are limitless, the prajñāpāramitā is limitless.",
        "source": "T25n1509_055:0456a12_27"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_055:0456a13_28"
    },
    {
        "source_sentence": "云何緣無邊故般若波羅蜜無邊？」",
        "translation": "How is the prajñāpāramitā infinite because its conditions are infinite?",
        "source": "T25n1509_055:0456a13_29"
    },
    {
        "source_sentence": "須菩提言：「緣一切無邊法故，般若波羅蜜無邊。」",
        "translation": "Suppository said, Because of all the limitless dharmas, the prajñāpāramitā has no limit.",
        "source": "T25n1509_055:0456a14_30"
    },
    {
        "source_sentence": "「云何緣一切無邊法故般若波羅蜜無邊？」",
        "translation": "How is the prajñāpāramitā infinite because it's conditioned by all limitless dharmas?",
        "source": "T25n1509_055:0456a15_31"
    },
    {
        "source_sentence": "須菩提言：「緣無邊法性故，般若波羅蜜無邊。",
        "translation": "Suppository said, Because of the limitless Dharma nature of conditioned dharmas, the prajñāpāramitā has no limit.",
        "source": "T25n1509_055:0456a16_32"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T25n1509_055:0456a17_33"
    },
    {
        "source_sentence": "緣無邊如故，般若波羅蜜無邊。」",
        "translation": "The conditions are limitless as they are, and the prajñāpāramitā is limitless.",
        "source": "T25n1509_055:0456a17_34"
    },
    {
        "source_sentence": "釋提桓因言：「云何緣無邊如故般若波羅蜜無邊？」",
        "translation": "Śakra Devānām-Indra said, What are the limitless conditions that make the prajñāpāramitā as before limitless?",
        "source": "T25n1509_055:0456a18_35"
    },
    {
        "source_sentence": "須菩提言：「如無邊故，緣亦無邊；",
        "translation": "Suppository of enlightenment said: Because it is like infinity, the supporting object also has infinity.",
        "source": "T25n1509_055:0456a19_36"
    },
    {
        "source_sentence": "緣無邊故，如亦無邊。",
        "translation": "Because the conditions are limitless, thusness is also limitless.",
        "source": "T25n1509_055:0456a19_37"
    },
    {
        "source_sentence": "以是因緣故，諸菩薩摩訶薩般若波羅蜜無邊。",
        "translation": "Because of these causes and conditions, the bodhisattvas, mahāsattvas, and prajñāpāramitā are boundless.",
        "source": "T25n1509_055:0456a20_38"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T25n1509_055:0456a21_39"
    },
    {
        "source_sentence": "眾生無邊故，般若波羅蜜無邊。」",
        "translation": "Because sentient beings have no limit, the prajñāpāramitā has no limit.",
        "source": "T25n1509_055:0456a21_40"
    },
    {
        "source_sentence": "釋提桓因問須菩提：「云何眾生無邊故般若波羅蜜無邊？」",
        "translation": "Śakra Devānām-Indra asked Subhūti, How are sentient beings without limit because the prajñāpāramitā has no limit?",
        "source": "T25n1509_055:0456a22_41"
    },
    {
        "source_sentence": "須菩提言：「於汝意云何？",
        "translation": "Suppository said, What do you think?",
        "source": "T25n1509_055:0456a23_42"
    },
    {
        "source_sentence": "何等法名眾生？」",
        "translation": "What are the names of sentient beings?",
        "source": "T25n1509_055:0456a24_43"
    },
    {
        "source_sentence": "釋提桓因言：「無有法名眾生，假名故為眾生；",
        "translation": "Śakra Devānām-Indra said: There is no dharma that calls living beings sentient beings.",
        "source": "T25n1509_055:0456a24_44"
    },
    {
        "source_sentence": "是名字本無有法，亦無所趣，強為作名。」",
        "translation": "This name originally has no dharmas and no destination, so it's forced to be called that.",
        "source": "T25n1509_055:0456a25_45"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0456a26_46"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T25n1509_055:0456a26_47"
    },
    {
        "source_sentence": "是般若波羅蜜中說眾生有實不？」",
        "translation": "Is it true that it's said in the prajñāpāramitā that sentient beings exist?",
        "source": "T25n1509_055:0456a27_48"
    },
    {
        "source_sentence": "釋提桓因言：「無也！」",
        "translation": "Śakra Devānām-Indra said, No!",
        "source": "T25n1509_055:0456a27_49"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0456a28_50"
    },
    {
        "source_sentence": "若般若波羅蜜中實不說，眾生無邊亦不可得。",
        "translation": "If it's really not explained in the prajñāpāramitā, sentient beings are limitless and unobtainable.",
        "source": "T25n1509_055:0456a28_51"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T25n1509_055:0456a29_52"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T25n1509_055:0456a29_53"
    },
    {
        "source_sentence": "佛恒河沙劫壽說眾生、眾生名字，頗有眾生法有生有滅不？」",
        "translation": "Does the Buddha speak of sentient beings and the names of sentient beings for as many eons as there are grains of sand in the Ganges River, or is there a dharma that produces and ceases sentient beings?",
        "source": "T25n1509_055:0456b01_0"
    },
    {
        "source_sentence": "釋提桓因言：「不也！",
        "translation": "Śakra Devānām-Indra said, No!",
        "source": "T25n1509_055:0456b02_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_055:0456b02_2"
    },
    {
        "source_sentence": "眾生從本已來常清淨故。」",
        "translation": "It's because sentient beings are always pure since the distant past.",
        "source": "T25n1509_055:0456b03_0"
    },
    {
        "source_sentence": "「以是因緣故，憍尸迦！",
        "translation": "Because of these causes and conditions, Kauśika!",
        "source": "T25n1509_055:0456b03_1"
    },
    {
        "source_sentence": "眾生無邊故，當知般若波羅蜜亦無邊。」",
        "translation": "Because sentient beings have no limit, you should know that the perfection of wisdom also has no limit.",
        "source": "T25n1509_055:0456b04_2"
    },
    {
        "source_sentence": "【論】問曰：釋提桓因是須陀洹人，云何能問深般若波羅蜜？",
        "translation": "[Commentary] Q: Śakra Devānām-Indra is a stream entrant, so how can he ask about the profound prajñāpāramitā?",
        "source": "T25n1509_055:0456b05_0"
    },
    {
        "source_sentence": "答曰：如須菩提是具足阿羅漢，以利益菩薩、憐愍眾生故，問菩薩所行事。",
        "translation": "Answer: Suppose Suppository is a fully arhat who asks what the bodhisattva does for the sake of benefiting bodhisattvas and pitying sentient beings.",
        "source": "T25n1509_055:0456b06_1"
    },
    {
        "source_sentence": "釋提桓因雖是聲聞人，是諸天主，有利智慧、憐愍眾生故，問般若波羅蜜，亦如是。",
        "translation": "Although Śakra Devānām-Indra is a śrāvaka, it's because the lords of gods have superior wisdom and pity for sentient beings that they ask about the perfection of prajñāpāramitā, which is likewise.",
        "source": "T25n1509_055:0456b08_2"
    },
    {
        "source_sentence": "復次，有人言：「三千大千世界中，有百億釋提桓因。",
        "translation": "Furthermore, some people said, In the 3,000 great one-thousand worlds, there are 10 billion Śakra Devānām-Indra.",
        "source": "T25n1509_055:0456b10_3"
    },
    {
        "source_sentence": "《中阿含》中說釋提桓因得須陀洹者，異今釋提桓因。",
        "translation": "In the Middle Length Āgamas, it's said that Śakra Devānām-Indra attained stream entry because of Śakra Devānām-Indra, which is different from the present Śakra Devānām-Indra.",
        "source": "T25n1509_055:0456b11_4"
    },
    {
        "source_sentence": "今釋提桓因是大菩薩，憐愍眾生故，三種讚般若波羅蜜，所謂摩訶波羅蜜、無量波羅蜜、無邊波羅蜜，是般若波羅蜜；",
        "translation": "Because Śakra Devānām-Indra is a great bodhisattva who, out of pity for sentient beings, praises the perfection of wisdom in three ways. The so-called mahāpāramitā, immeasurable pāramitā, and limitless pāramitā are the perfections of wisdom.",
        "source": "T25n1509_055:0456b12_5"
    },
    {
        "source_sentence": "是般若波羅蜜中學成諸聖道故。」",
        "translation": "It's because the middle way of prajñā-pāramitā accomplishes the noble paths.",
        "source": "T25n1509_055:0456b15_6"
    },
    {
        "source_sentence": "須菩提然釋提桓因讚，而廣解其讚言。",
        "translation": "Suppository of enlightenment, however, Śakra Devānām-Indra praised it and explained the words of his praise in detail.",
        "source": "T25n1509_055:0456b15_7"
    },
    {
        "source_sentence": "以五眾大故，般若波羅蜜大。",
        "translation": "Because the five congregations are great, the prajñāpāramitā is great.",
        "source": "T25n1509_055:0456b16_8"
    },
    {
        "source_sentence": "「五眾大」者，所謂三際不可得故。",
        "translation": "The five greatness of the multitude means that the three realms are unobtainable.",
        "source": "T25n1509_055:0456b17_9"
    },
    {
        "source_sentence": "亦以無量、無邊故言「大」。",
        "translation": "It's also called great because it's immeasurable and limitless.",
        "source": "T25n1509_055:0456b18_10"
    },
    {
        "source_sentence": "破是無量無邊五眾，將一切眾生入無餘涅槃中，故言「般若波羅蜜大」。",
        "translation": "He destroys these five immeasurable and limitless congregations and puts all sentient beings into nirvāṇa without remainder, so he says, The greatness of the prajñāpāramitā.",
        "source": "T25n1509_055:0456b18_11"
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "It's likewise with all kinds of cognition.",
        "source": "T25n1509_055:0456b20_12"
    },
    {
        "source_sentence": "「無量」者亦爾，但以虛空譬喻為異。",
        "translation": "The phrase immeasurable is likewise, but it's different because it's based on the metaphor of space.",
        "source": "T25n1509_055:0456b20_13"
    },
    {
        "source_sentence": "有法雖大，不必無量，是故不得以空為喻。",
        "translation": "Although there are dharmas that are great, they needn't be immeasurable; therefore, they can't be used as a metaphor for emptiness.",
        "source": "T25n1509_055:0456b21_14"
    },
    {
        "source_sentence": "如須彌山，於諸山中雖大而有量，所謂八萬四千由旬。",
        "translation": "It's like Mount Sumeru, which is so large that it's 84,000 yojanas in size among the mountains.",
        "source": "T25n1509_055:0456b22_15"
    },
    {
        "source_sentence": "「無邊」者，以五眾廣大無量，故言「無邊」；",
        "translation": "The expression limitless means that the five congregations are vast and immeasurable because their number is infinite.",
        "source": "T25n1509_055:0456b24_16"
    },
    {
        "source_sentence": "亦以五眾有邊則有始，有始則有終，即是無因無緣，墮斷滅等種種過故。",
        "translation": "Also, because the five consciousnesses have beginnings when they have limits and ends when they have beginnings, that is to say, without cause or condition: because of various faults such as falling into annihilation.",
        "source": "T25n1509_055:0456b25_0"
    },
    {
        "source_sentence": "復次，五眾，三世中不可得，故言「無邊」。",
        "translation": "Furthermore, the five congregations are unobtainable in the three times, so they're called limitless.",
        "source": "T25n1509_055:0456b26_1"
    },
    {
        "source_sentence": "「緣無邊」者，所謂一切法四緣：因緣，生一切有為法；",
        "translation": "Conditioned by boundlessness means that all things are conditioned by four conditions:",
        "source": "T25n1509_055:0456b27_2"
    },
    {
        "source_sentence": "次第緣，過去、現在心心數法；",
        "translation": "Conditioned by succession, they are past and present awarenesses and accompanying mental factors.",
        "source": "T25n1509_055:0456b28_3"
    },
    {
        "source_sentence": "緣緣、增上緣，一切法。",
        "translation": "Conditioned by conditions and dominant conditions, all dharmas.",
        "source": "T25n1509_055:0456b29_4"
    },
    {
        "source_sentence": "是四種緣，一切處、一切時皆有，故說「緣無邊」；",
        "translation": "These four kinds of conditions exist in all places and at all times; therefore, it is said that the conditions are boundless.",
        "source": "T25n1509_055:0456b29_5"
    },
    {
        "source_sentence": "緣無邊故，般若波羅蜜無邊。",
        "translation": "Because the conditions are limitless, the prajñāpāramitā is limitless.",
        "source": "T25n1509_055:0456c01_6"
    },
    {
        "source_sentence": "復次，「緣無邊」者，四緣法虛誑無實、畢竟空故無邊。",
        "translation": "Furthermore, the phrase conditioned by boundless means that the four conditions for dharmas are false and insubstantial because they are ultimately empty.",
        "source": "T25n1509_055:0456c02_7"
    },
    {
        "source_sentence": "復次，緣如、法性、實際無邊故，般若波羅蜜無邊。",
        "translation": "Furthermore, because the cognition of thusness, Dharma nature, and reality are limitless, the prajñāpāramitā is limitless.",
        "source": "T25n1509_055:0456c03_8"
    },
    {
        "source_sentence": "「如、法性、實際」，是自然無為相故無量無邊；",
        "translation": "“Thusness, dharma-nature and actuality”: Because they are naturally unconditioned characteristics, they are immeasurable and boundless.",
        "source": "T25n1509_055:0456c04_9"
    },
    {
        "source_sentence": "五眾無邊，是觀力故，強作無邊。",
        "translation": "The five congregations are limitless because of the power of contemplation, and it's forced to be limitless.",
        "source": "T25n1509_055:0456c05_10"
    },
    {
        "source_sentence": "復次，「眾生無邊」者，以眾生多故；",
        "translation": "Furthermore, sentient beings are boundless because sentient beings are numerous.",
        "source": "T25n1509_055:0456c06_11"
    },
    {
        "source_sentence": "無量阿僧祇三世十方眾生，無人能知數，故言「無邊」。",
        "translation": "Measureless and incalculable sentient beings of the three times and ten directions can't be counted by anyone, so they say limitless.",
        "source": "T25n1509_055:0456c07_12"
    },
    {
        "source_sentence": "復次，是中說眾生空，故言「無邊」，但強為作名。",
        "translation": "Furthermore, this explains the emptiness of sentient beings, so it's called limitless but forcibly named that.",
        "source": "T25n1509_055:0456c08_13"
    },
    {
        "source_sentence": "「亦無所趣」者，以眾生無有定法可趣向故；",
        "translation": "The expression also has no destination means that sentient beings lack a set doctrine to which they can turn.",
        "source": "T25n1509_055:0456c09_14"
    },
    {
        "source_sentence": "如火定有所趣，而眾生名，無實眾生可趣。",
        "translation": "It's like the concentration of fire that has an aim, but there are sentient beings named and no real sentient beings to aim for it.",
        "source": "T25n1509_055:0456c10_15"
    },
    {
        "source_sentence": "「於汝意云何，般若波羅蜜中頗說實有眾生不？」",
        "translation": "What do you think, does it really say there are sentient beings in the prajñāpāramitā?",
        "source": "T25n1509_055:0456c11_16"
    },
    {
        "source_sentence": "「不也！",
        "translation": "“No!",
        "source": "T25n1509_055:0456c12_17"
    },
    {
        "source_sentence": "大德！」",
        "translation": "Great virtuous one!",
        "source": "T25n1509_055:0456c12_18"
    },
    {
        "source_sentence": "「若眾生實無，云何有邊？」",
        "translation": "If sentient beings really are nonexistent, how could they be finite?",
        "source": "T25n1509_055:0456c12_19"
    },
    {
        "source_sentence": "譬如諸佛是一切實語人中第一，於無量恒河沙劫壽說眾生名字，是眾生法不以說故有生、有滅，何況餘人顛倒虛誑少時說！",
        "translation": "It's like when the buddhas are the first among all true people who say the names of sentient beings for an immeasurable number of eons, and it's because they don't explain the dharmas of sentient beings that there's birth and cessation, so why wouldn't other people mistakenly speak falsely for a little while?",
        "source": "T25n1509_055:0456c13_20"
    },
    {
        "source_sentence": "生我心故，當有眾生。",
        "translation": "Because it gives rise to the mind of self, there will be sentient beings.",
        "source": "T25n1509_055:0456c16_21"
    },
    {
        "source_sentence": "是眾生不以入般若波羅蜜中故言「無」，從本已來常清淨、無所有，有無等戲論滅故。",
        "translation": "It's because sentient beings don't say nothing because they enter the perfection of prajñāpāramitā, which has always been pure since the distant past and has no existence, and it's because such conceptual elaborations as existence and nonexistence cease.",
        "source": "T25n1509_055:0456c16_22"
    },
    {
        "source_sentence": "是以說：「眾生無邊故，般若波羅蜜無邊。」",
        "translation": "That's why it's said, Because sentient beings have no limit, the prajñāpāramitā has no limit.",
        "source": "T25n1509_055:0456c18_23"
    },
    {
        "source_sentence": "問曰：「無邊」中何以故廣說？",
        "translation": "Q: Why is it explained in detail in Boundless?",
        "source": "T25n1509_055:0456c19_24"
    },
    {
        "source_sentence": "而「大」及「無量」何以略說？",
        "translation": "How can greatness and immeasurability be briefly explained?",
        "source": "T25n1509_055:0456c20_25"
    },
    {
        "source_sentence": "答曰：以眾生因緣故，一切凡夫起諸煩惱，於五眾中作諸邪行，難破故，是以廣說。",
        "translation": "Answer: Because of the causes and conditions for sentient beings, all worldlings give rise to afflictions that are difficult to break because they do wrong actions among the five groups of people.",
        "source": "T25n1509_055:0456c20_26"
    },
    {
        "source_sentence": "若破眾生相，餘一切易破。",
        "translation": "If they refute the characteristics of sentient beings, it's easy to refute all the others.",
        "source": "T25n1509_055:0456c22_27"
    },
    {
        "source_sentence": "大智度論卷第五十五",
        "translation": "Dazhiduo lun, vol. 55",
        "source": "T25n1509_055:0456c24_0"
    }
]