[
    {
        "source_sentence": "大智度論釋初品中八背捨義",
        "translation": "Mahāprajñāpāramitā-śāstra explains the meaning of the eight renunciations in the first chapter",
        "source": "T25n1509_021:0215a02_0"
    },
    {
        "source_sentence": "第三十四(卷二十一)",
        "translation": "The Thirty-fourth ( Fascicle twenty-one)",
        "source": "T25n1509_021:0215a03_0"
    },
    {
        "source_sentence": "聖者龍樹造",
        "translation": "created by the sage named dragon tree",
        "source": "T25n1509_021:0215a05_0"
    },
    {
        "source_sentence": "後秦龜茲國三藏鳩摩羅什譯",
        "translation": "Translated by Kumārajīva, a translator of the Tripiṭaka of the country of Kucha in the Later Qin",
        "source": "T25n1509_021:0215a06_0"
    },
    {
        "source_sentence": "八背捨者，內有色，外亦觀色，是初背捨。",
        "translation": "The eighth liberation is that when there are forms inside and also contemplating forms outside, this is the first liberation.",
        "source": "T25n1509_021:0215a07_0"
    },
    {
        "source_sentence": "內無色，外觀色，是第二背捨。",
        "translation": "The internal immaterial ones and the matter external to them is the second equanimity.",
        "source": "T25n1509_021:0215a07_1"
    },
    {
        "source_sentence": "淨背捨，身作證，第三背捨。",
        "translation": "The pure liberation, bodily realization and the third liberation.",
        "source": "T25n1509_021:0215a08_2"
    },
    {
        "source_sentence": "四無色定及滅受想定，是五。",
        "translation": "The four formless absorptions and the equipoise of cessation are five.",
        "source": "T25n1509_021:0215a09_3"
    },
    {
        "source_sentence": "合為八背捨。",
        "translation": "They are combined into eight liberations.",
        "source": "T25n1509_021:0215a09_4"
    },
    {
        "source_sentence": "背是淨潔五欲，離是著心，故名「背捨」。",
        "translation": "Being turned away from the five pure desires and being free of them is called turning away.",
        "source": "T25n1509_021:0215a10_5"
    },
    {
        "source_sentence": "不壞內、外色，不內外滅色相，以是不淨心觀色，是名初背捨。",
        "translation": "Not destroying internal form and external form, not internally or externally extinguishing form and characteristics, and observing form with an impure mind is called the first liberation.",
        "source": "T25n1509_021:0215a11_6"
    },
    {
        "source_sentence": "壞內色，滅內色相；",
        "translation": "Disintegrating internal form, they annihilate the characteristics of internal form.",
        "source": "T25n1509_021:0215a12_7"
    },
    {
        "source_sentence": "不壞外色，不滅外色相，以是不淨心觀外色，是第二背捨。",
        "translation": "He doesn't destroy external form and doesn't cease external form, and he observes external form with an impure mind that's the second liberation.",
        "source": "T25n1509_021:0215a13_0"
    },
    {
        "source_sentence": "是二皆觀不淨：一者觀內、觀外，二者不見內，但見外。",
        "translation": "These two are both observing impurity: one, observing inside and observing outside; two, not seeing inside but only seeing outside.",
        "source": "T25n1509_021:0215a14_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_021:0215a15_2"
    },
    {
        "source_sentence": "眾生有二分行：愛行、見行。",
        "translation": "Sentient beings have two forms of conditioning: the conditioned by craving and the conditioned by perception.",
        "source": "T25n1509_021:0215a15_3"
    },
    {
        "source_sentence": "愛多者著樂，多縛在外諸結使行。",
        "translation": "Those with a lot of craving are attached to pleasure, and they're mostly bound by external bonds and tendencies.",
        "source": "T25n1509_021:0215a16_4"
    },
    {
        "source_sentence": "見多者，多著身見等行，為內結使縛。",
        "translation": "“Many views”: Mostly attachment to such formations as belief in a self and so on is an inner fetter that binds.",
        "source": "T25n1509_021:0215a17_5"
    },
    {
        "source_sentence": "以是故，愛多者觀外色不淨，見多者觀自身不淨壞敗故。",
        "translation": "Because of this, the one with manifold attachment observes external form as impure. The one with manifold views observes himself as impure and disintegrates:",
        "source": "T25n1509_021:0215a18_6"
    },
    {
        "source_sentence": "復次，行者初心未細攝，繫心一處難，故內外觀；",
        "translation": "“Furthermore, the practitioner is not subtly included in the first moment of thought”: Because it is difficult to concentrate awarenesses on one place”, it therefore appears internally.",
        "source": "T25n1509_021:0215a19_7"
    },
    {
        "source_sentence": "漸習調柔，能內壞色相，但觀外。",
        "translation": "They gradually become accustomed to gentleness and are able to internally destroy form and characteristics but only look outward.",
        "source": "T25n1509_021:0215a20_8"
    },
    {
        "source_sentence": "問曰：若無內色相，誰當觀外？",
        "translation": "Q: If there are no internal forms and characteristics, who will look outside?",
        "source": "T25n1509_021:0215a21_9"
    },
    {
        "source_sentence": "答曰：是為得解道，非實道。",
        "translation": "Answer: This is the path of attaining understanding, not the true path.",
        "source": "T25n1509_021:0215a22_10"
    },
    {
        "source_sentence": "行者念未來死及火燒、虫噉，埋著土中，皆磨滅。",
        "translation": "The practitioner is mindful of future death, fire, burning, insects, and worms, buried in the ground, and they'll all be crushed and exterminated.",
        "source": "T25n1509_021:0215a22_11"
    },
    {
        "source_sentence": "若現在觀，亦分別是身乃至微塵皆無，是名「內無色相外觀色」。",
        "translation": "If he observes them in the present, he also discerns that this body or even a tiny particle of it is nonexistent, which is called internal form without form and external form.",
        "source": "T25n1509_021:0215a23_12"
    },
    {
        "source_sentence": "問曰：二勝處見內外色，六勝處但見外色；",
        "translation": "Question: The two spheres of mastery see internal and external matter; the six spheres of mastery only see external matter.",
        "source": "T25n1509_021:0215a25_13"
    },
    {
        "source_sentence": "一背捨見內外色，二背捨但見外色，何以故但內有壞色相，外色不能壞？",
        "translation": "One, the equanimity sees internal and external forms; two, the equanimity only sees external forms. Why is it that only internal form with decaying characteristics exists?",
        "source": "T25n1509_021:0215a26_14"
    },
    {
        "source_sentence": "答曰：行者眼見是身有死相，取是未來死相以況今身；",
        "translation": "Answer: When practitioners of the doctrine see with their eyes that this body has the characteristic mark of death, they grasp that it will die in the future, much less in the present body.",
        "source": "T25n1509_021:0215a27_15"
    },
    {
        "source_sentence": "外四大不見滅相故，難可觀無，故不說外色壞。",
        "translation": "Because the outward four elements do not see the characteristic of cessation, it is difficult to perceive nonexistence. Therefore, no external matter is said to disintegrate.",
        "source": "T25n1509_021:0215a29_16"
    },
    {
        "source_sentence": "復次，離色界時，是時亦不見外色。",
        "translation": "Furthermore, when one is free from the realm of form, at that very moment also no external matter is seen.",
        "source": "T25n1509_021:0215b01_17"
    },
    {
        "source_sentence": "「淨背捨身作證」者，不淨中淨觀，如八勝處說。",
        "translation": "The phrase pure renunciation body as realization refers to the pure contemplation in the midst of impurity, as explained in the eight superior places.",
        "source": "T25n1509_021:0215b02_18"
    },
    {
        "source_sentence": "前八一切處觀清淨：地、水、火、風及青、黃、赤、白。",
        "translation": "The first eight are observing the purity of all places: earth, water, fire, wind, blue, yellow, red, and white.",
        "source": "T25n1509_021:0215b03_19"
    },
    {
        "source_sentence": "觀青色如青蓮華，如金精山，如優摩伽華，如真青婆羅捺衣。",
        "translation": "He observes that the blue color is like a blue lotus flower, like a mountain of gold spirits, like an emerald flower, and like a true blue Vārāṇasī robe.",
        "source": "T25n1509_021:0215b04_20"
    },
    {
        "source_sentence": "觀黃、赤、白，各隨色亦復如是，總名「淨背捨」。",
        "translation": "Observing yellow, red, and white, each according to their color, is likewise, and they're collectively called pure liberation.",
        "source": "T25n1509_021:0215b05_21"
    },
    {
        "source_sentence": "問曰：若總是淨背捨，不應說一切處！",
        "translation": "Q: If there's always pure liberation, it shouldn't be described as all places!",
        "source": "T25n1509_021:0215b06_22"
    },
    {
        "source_sentence": "答曰：背捨是初行者，勝處是中行，一切處是久行。",
        "translation": "Answer: The renunciation is the first practice, the superior place is the middle practice, and all places are the long practice.",
        "source": "T25n1509_021:0215b07_23"
    },
    {
        "source_sentence": "不淨觀有二種：一者不淨，二者淨。",
        "translation": "There are two kinds of contemplation on impurity: first, impurity and second, purity.",
        "source": "T25n1509_021:0215b08_24"
    },
    {
        "source_sentence": "不淨觀中：二背捨、四勝處。",
        "translation": "In the contemplation on impurity: two liberations and four spheres of mastery.",
        "source": "T25n1509_021:0215b09_25"
    },
    {
        "source_sentence": "淨觀中：一背捨、四勝處、八一切處。",
        "translation": "In the pure contemplation: one liberation, four spheres of mastery and eight spheres of totality.",
        "source": "T25n1509_021:0215b10_26"
    },
    {
        "source_sentence": "問曰：行者以不淨為淨，名為顛倒；",
        "translation": "Question: Practitioners regard impurity as purity is called ‘overturned’.",
        "source": "T25n1509_021:0215b10_27"
    },
    {
        "source_sentence": "淨背捨觀云何不顛倒？",
        "translation": "How is the contemplation of pure renunciation not mistaken?",
        "source": "T25n1509_021:0215b11_28"
    },
    {
        "source_sentence": "答曰：女色不淨，妄見為淨，是名顛倒。",
        "translation": "Answer: The woman's form is impure, and deluded views are pure, which is called mistaken.",
        "source": "T25n1509_021:0215b12_29"
    },
    {
        "source_sentence": "淨背捨觀一切實青色廣大，故不顛倒。",
        "translation": "The pure liberation contemplates all real blue forms as vast, so it's not mistaken.",
        "source": "T25n1509_021:0215b13_30"
    },
    {
        "source_sentence": "復次，為調心故淨觀，以久習不淨觀，心厭，以是故習淨觀，非顛倒，亦是中不著故。",
        "translation": "Furthermore, for the sake of controlling awarenesses, it is to be observed as clean: because after having practised the contemplation on what is unclean for a long time, one becomes disgusted. Because of this, one cultivates the contemplation on what is clean; not overturned: because of not being attached [to it].",
        "source": "T25n1509_021:0215b14_31"
    },
    {
        "source_sentence": "復次，行者先觀身不淨，隨身法所有內外不淨，繫心觀中，是時生厭，婬、恚、癡薄，即自驚悟：「我為無目，此身如是，云何生著？」",
        "translation": "Furthermore, when a practitioner first observes that the body is impure and that all internal and external things in his body are impure, he fixes his mind on observing it, becomes disillusioned at that point, and becomes weak in anger, anger, and delusion, then he startles himself and realizes, I have no eyes; this body is like this, so how can attachment arise?",
        "source": "T25n1509_021:0215b16_32"
    },
    {
        "source_sentence": "攝心實觀，無令復錯。",
        "translation": "He observes the mind as it really is and doesn't let it be again.",
        "source": "T25n1509_021:0215b18_33"
    },
    {
        "source_sentence": "心既調柔，想身皮、肉、血、髓不淨，除却，唯有白骨；",
        "translation": "Their minds were tempered, and they thought the skin, flesh, blood, and marrow of their bodies was impure. All they removed was white bone.",
        "source": "T25n1509_021:0215b19_34"
    },
    {
        "source_sentence": "繫心骨人，若外馳散，攝之令還。",
        "translation": "If a person with bones attached to the mind is driven outward and dispersed, he collects them and causes them to return.",
        "source": "T25n1509_021:0215b20_35"
    },
    {
        "source_sentence": "深攝心故，見白骨流光，如珂、如貝，能照內外諸物，是為淨背捨初門。",
        "translation": "Because it deeply collects his mind, he sees white bones flowing with light like eunuchs and shellfish that can illuminate both inside and outside things. This is the first aspect of purifying renunciation.",
        "source": "T25n1509_021:0215b21_36"
    },
    {
        "source_sentence": "然後觀骨人散滅，但見骨光，取外淨潔色相。",
        "translation": "Then he observes that the bones are scattered and disintegrated, but he sees the bones' radiance and apprehends their pure form and characteristics outside.",
        "source": "T25n1509_021:0215b22_37"
    },
    {
        "source_sentence": "復次，若金剛、真珠、金銀寶物，若清淨地，若淨水，如無煙、無薪淨潔火，若清風無塵；",
        "translation": "“Furthermore, if they are made of diamond, genuine pearls, or treasures of gold and silver, whether pure earth or pure water, like smokeless fire without fuel or fire without wood, or like clear air with no dust.",
        "source": "T25n1509_021:0215b23_38"
    },
    {
        "source_sentence": "諸青色，如金精山；",
        "translation": "The colors of the flowers are like mountains of gold and silver.",
        "source": "T25n1509_021:0215b25_39"
    },
    {
        "source_sentence": "諸黃色，如瞻蔔花；",
        "translation": "The colors of the flowers are like campaka blossoms.",
        "source": "T25n1509_021:0215b26_40"
    },
    {
        "source_sentence": "諸赤色，如赤蓮華；",
        "translation": "The red colors are like red lotus blossoms.",
        "source": "T25n1509_021:0215b26_41"
    },
    {
        "source_sentence": "諸白色，如白雪等。",
        "translation": "The white ones are like white snow, etc.",
        "source": "T25n1509_021:0215b26_42"
    },
    {
        "source_sentence": "取是相，繫心淨觀，隨是諸色，各有清淨光曜。",
        "translation": "Grasping these characteristics, they bind the mind to pure contemplation, and each of these forms has a pure radiance that follows them.",
        "source": "T25n1509_021:0215b27_43"
    },
    {
        "source_sentence": "是時行者得受喜樂，遍滿身中，是名淨背捨。",
        "translation": "The practitioner then attains the joy and happiness that pervades his body, which is called pure renunciation.",
        "source": "T25n1509_021:0215b28_44"
    },
    {
        "source_sentence": "緣淨故，名為「淨背捨」。",
        "translation": "Because the condition is pure, it's called pure renunciation.",
        "source": "T25n1509_021:0215b29_45"
    },
    {
        "source_sentence": "遍身受樂，故名為「身證」。",
        "translation": "It's called the realization of body because it pervades the body and receives pleasure.",
        "source": "T25n1509_021:0215c01_0"
    },
    {
        "source_sentence": "得是心樂，背捨五欲，不復喜樂，是名「背捨」。",
        "translation": "Attaining this mental bliss, he turns away from the five desires and no longer delights in them, which is called turning away.",
        "source": "T25n1509_021:0215c01_1"
    },
    {
        "source_sentence": "未漏盡故，中間或結使心生，隨著淨色。",
        "translation": "Because the impure influence has not yet disappeared, sometimes a mind endowed with fetters arises in between and follows pure matter.",
        "source": "T25n1509_021:0215c02_2"
    },
    {
        "source_sentence": "復懃精進，斷此著故，如是淨觀從心想生。",
        "translation": "Furthermore, due to the debilitating effort of stopping this attachment, such a pure contemplation arises from the perception of mind.",
        "source": "T25n1509_021:0215c03_3"
    },
    {
        "source_sentence": "譬如幻主觀所幻物，知從己出，心不生著，能不隨所緣。",
        "translation": "It's like an illusionist who observes illusory things and knows they come out of himself, doesn't become attached to them in his mind, and can't follow their perceptual objects.",
        "source": "T25n1509_021:0215c04_4"
    },
    {
        "source_sentence": "是時「背捨」變名「勝處」。",
        "translation": "At that point, renunciation is transformed into the name superior place.",
        "source": "T25n1509_021:0215c05_5"
    },
    {
        "source_sentence": "於淨觀雖勝，未能廣大，是時行者還取淨相；",
        "translation": "Even though the contemplation of purity is superior, it cannot be extensive. The practitioner at that time still grasps the characteristic of purity.",
        "source": "T25n1509_021:0215c06_6"
    },
    {
        "source_sentence": "用背捨力及勝處力故，取是淨地相，漸漸遍滿十方虛空；",
        "translation": "Because of the power of relinquishment and the power of the sphere of mastery, they grasp this characteristic of the stage of purity, gradually filling space in all directions.",
        "source": "T25n1509_021:0215c07_7"
    },
    {
        "source_sentence": "水、火、風亦爾。",
        "translation": "So it is with water, fire, and wind.",
        "source": "T25n1509_021:0215c08_8"
    },
    {
        "source_sentence": "取青相，漸令廣大，亦遍十方虛空；",
        "translation": "They grasp the characteristic of blue and gradually make it vast, also pervading space in all ten directions.",
        "source": "T25n1509_021:0215c09_0"
    },
    {
        "source_sentence": "黃、赤、白亦如是。",
        "translation": "So it is with yellow, red, and white.",
        "source": "T25n1509_021:0215c09_1"
    },
    {
        "source_sentence": "是時「勝處」復變為「一切處」。",
        "translation": "At that point, the superior place then again transforms into all places.",
        "source": "T25n1509_021:0215c10_2"
    },
    {
        "source_sentence": "是三事一義，轉變有三名。",
        "translation": "These three things are one and the same meaning. Transformation has three names:",
        "source": "T25n1509_021:0215c10_3"
    },
    {
        "source_sentence": "問曰：是三背捨、八勝處、十一切處是實觀？",
        "translation": "Q: Are the three liberations, the eight abodes of excellence, and the ten universal abodes really contemplation?",
        "source": "T25n1509_021:0215c11_4"
    },
    {
        "source_sentence": "是得解觀？",
        "translation": "Is this the contemplation of attaining understanding?",
        "source": "T25n1509_021:0215c12_5"
    },
    {
        "source_sentence": "若實觀，身有皮肉，何以但見白骨？",
        "translation": "If you really observe that your body has skin and flesh, why do you only see white bones?",
        "source": "T25n1509_021:0215c12_6"
    },
    {
        "source_sentence": "又三十六物合為身法，何以分別散觀？",
        "translation": "Furthermore, the thirty-six things are combined into a body and a dharma, so why would they be discerned and dispersed?",
        "source": "T25n1509_021:0215c13_7"
    },
    {
        "source_sentence": "四大各自有相，何以滅三大、但觀一地大？",
        "translation": "Each of the four elements has its own characteristics, so why do they cease the three elements and only observe the one ground as large?",
        "source": "T25n1509_021:0215c14_8"
    },
    {
        "source_sentence": "四色非盡是青，何以都作青觀？",
        "translation": "If the four forms are not exhaustively blue, how can they all be contemplated as blue?",
        "source": "T25n1509_021:0215c15_9"
    },
    {
        "source_sentence": "答曰：有實觀，亦有得解觀。",
        "translation": "Answer: There's real contemplation, and there's also the contemplation of attaining understanding.",
        "source": "T25n1509_021:0215c16_10"
    },
    {
        "source_sentence": "身相實是不淨，是為實觀。",
        "translation": "The body and characteristics are really impure, which is true contemplation.",
        "source": "T25n1509_021:0215c16_11"
    },
    {
        "source_sentence": "外法中有淨相，種種色相，是為實淨。",
        "translation": "In external dharmas, there are characteristics of purity and various forms that are truly pure.",
        "source": "T25n1509_021:0215c17_12"
    },
    {
        "source_sentence": "觀淨、不淨，是為實觀。",
        "translation": "To contemplate what's pure and impure is to truly contemplate.",
        "source": "T25n1509_021:0215c18_13"
    },
    {
        "source_sentence": "以此少許淨，廣觀一切皆是淨；",
        "translation": "Because of this a little bit of purity, he observed extensively that everything is pure.",
        "source": "T25n1509_021:0215c18_14"
    },
    {
        "source_sentence": "取是一水，遍觀一切皆是水；",
        "translation": "They grasp a single mass of water and pervade it to see that everything is water.",
        "source": "T25n1509_021:0215c19_15"
    },
    {
        "source_sentence": "取是少許青相，遍一切皆是青。",
        "translation": "The grasping is a little bit blue in appearance, but all of them are blue.",
        "source": "T25n1509_021:0215c20_16"
    },
    {
        "source_sentence": "如是等，是為得解觀，非實。",
        "translation": "Such and so forth are the contemplations of attaining understanding, which are not real.",
        "source": "T25n1509_021:0215c20_17"
    },
    {
        "source_sentence": "四無色背捨，如四無色定中觀。",
        "translation": "The four formless liberations are as observed in the four formless concentrations.",
        "source": "T25n1509_021:0215c21_18"
    },
    {
        "source_sentence": "欲得背捨，先入無色定，無色定是背捨之初門。",
        "translation": "Those who want to attain renunciation first enter formless concentration, and formless concentration is the first aspect of renunciation.",
        "source": "T25n1509_021:0215c22_19"
    },
    {
        "source_sentence": "背捨色，緣無量虛空處。",
        "translation": "The rāpa of indifference has an infinite space for its object.",
        "source": "T25n1509_021:0215c23_20"
    },
    {
        "source_sentence": "問曰：無色定亦爾，有何等異？",
        "translation": "Q: So it is with formless concentration, so what's the difference?",
        "source": "T25n1509_021:0215c23_21"
    },
    {
        "source_sentence": "答曰：凡夫人得是無色定，是為無色；",
        "translation": "Answer: Ordinary people attain this formless concentration, which is formless.",
        "source": "T25n1509_021:0215c24_22"
    },
    {
        "source_sentence": "聖人深心得無色定，一向不迴，是名背捨。",
        "translation": "A sage who deeply attains formless concentration and always doesn't turn back, this is called liberation.",
        "source": "T25n1509_021:0215c25_23"
    },
    {
        "source_sentence": "餘殘識處、無所有處、非有想非無想處，亦如是。",
        "translation": "The same applies to the other spheres of unlimited consciousness, to the sphere of nothingness and to the sphere neither with-thought-nor-without-thought.",
        "source": "T25n1509_021:0215c26_24"
    },
    {
        "source_sentence": "背滅受想諸心心數法，是名滅受想背捨。",
        "translation": "To turn one's back on the mind and mental factors that cease feelings and perceptions is called turning one's back on cessation of feelings and perceptions.",
        "source": "T25n1509_021:0215c27_25"
    },
    {
        "source_sentence": "問曰：無想定何以不名背捨？",
        "translation": "Q: Why isn't it called liberation when there's no concentration?",
        "source": "T25n1509_021:0215c28_26"
    },
    {
        "source_sentence": "答曰：邪見者，不審諸法過失，直入定中，謂是涅槃；",
        "translation": "Answer: A person with wrong view doesn't examine the faults of all dharmas and directly enters concentration, which is called nirvāṇa.",
        "source": "T25n1509_021:0215c29_27"
    },
    {
        "source_sentence": "從定起時，還生悔心，墮在邪見，是故非背捨。",
        "translation": "At the moment of arising from absorption, there is a feeling of regret and falling back into false view. That is why it is no liberation.",
        "source": "T25n1509_021:0216a01_28"
    },
    {
        "source_sentence": "滅受想患厭散亂心故，入定休息，似涅槃法著身中得，故名「身證」。",
        "translation": "Because he ceases the afflictions of feelings, perception, and disillusionment with distraction, he enters concentration and rests, resembling nirvāṇa as attained by clinging to the body, which is why it's called physical realization.",
        "source": "T25n1509_021:0216a02_29"
    },
    {
        "source_sentence": "「八勝處」者，內有色相，外觀色少，若好、若醜，是色勝知勝觀，是名初勝處。",
        "translation": "The eight superior abodes refers to the first superior abode when there's an internal form that has few external forms, and if it's good or ugly, this form is superior in knowing and superior in contemplation, which is called the first superior abode.",
        "source": "T25n1509_021:0216a03_30"
    },
    {
        "source_sentence": "內有色相，外觀色多，若好、若醜，是色勝知勝觀，是名第二勝處。",
        "translation": "When internal form has form and characteristics, and external form is abundant, whether good or ugly, it's superior to form and knowledge and superior to contemplation, which is called the second superior place.",
        "source": "T25n1509_021:0216a05_31"
    },
    {
        "source_sentence": "第三、第四亦如是，但以「內無色相，外觀色」為異。",
        "translation": "The third and fourth are likewise, but it's because internal formlessness and external form are different.",
        "source": "T25n1509_021:0216a07_0"
    },
    {
        "source_sentence": "內亦無色相，外觀諸色青、黃、赤、白。",
        "translation": "It also has no form on the inside, and its external forms are blue, yellow, red, or white.",
        "source": "T25n1509_021:0216a08_1"
    },
    {
        "source_sentence": "是為八勝處。",
        "translation": "These are the eight superior places.",
        "source": "T25n1509_021:0216a08_2"
    },
    {
        "source_sentence": "「內有色相，外觀色」者，內身不壞，見外緣。",
        "translation": "The phrase internal form has form and external form means that the internal body doesn't perish but sees external conditions.",
        "source": "T25n1509_021:0216a09_3"
    },
    {
        "source_sentence": "「少」者，緣少故名「少」。",
        "translation": "scarce means that it's called scarce because the conditions are scarce.",
        "source": "T25n1509_021:0216a10_4"
    },
    {
        "source_sentence": "觀道未增長故觀少因緣，觀多畏難攝故；",
        "translation": "Because the path of contemplation has not yet grown, it observes few reasons: because it observes many fears and is difficult to subdue.",
        "source": "T25n1509_021:0216a10_5"
    },
    {
        "source_sentence": "譬如鹿遊未調，不中遠放。",
        "translation": "It's like a deer that travels without regulation and doesn't let it go from place to place.",
        "source": "T25n1509_021:0216a11_6"
    },
    {
        "source_sentence": "「若好、若醜」者，初學繫心緣中，若眉間、若額上、若鼻端，內身不淨相；",
        "translation": "The phrase whether good or ugly refers to the condition of first-time students' fetters in mind, such as between the eyebrows, on the top of the forehead, or at the tip of the nose, the internal body has impure characteristics.",
        "source": "T25n1509_021:0216a12_7"
    },
    {
        "source_sentence": "內身中不淨相觀外諸色，善業報故名「好」，不善業報故名「醜」。",
        "translation": "In the internal body, it's called good because it's the result of good actions and ugly because it's the result of bad actions.",
        "source": "T25n1509_021:0216a13_8"
    },
    {
        "source_sentence": "復次，行者如從師所受，觀外緣種種不淨，是名「醜色」。",
        "translation": "Furthermore, when a practitioner observes various kinds of impure external conditions as received from his teacher, this is called ugly form.",
        "source": "T25n1509_021:0216a16_0"
    },
    {
        "source_sentence": "行者或時憶念忘故，生淨相，觀淨色，是名「好色」。",
        "translation": "When a practitioner sometimes recalls or forgets it, produces pure form and observes pure form, which is called good form.",
        "source": "T25n1509_021:0216a17_1"
    },
    {
        "source_sentence": "復次，行者自身中繫心一處，觀欲界中色二種：一者、能生婬欲，二者、能生瞋恚。",
        "translation": "Furthermore, the practitioner's mind is bound to one place within himself, and he observes two kinds of form in the desire realm: 1. that which gives rise to sexual desire and 2. that which gives rise to anger.",
        "source": "T25n1509_021:0216a18_2"
    },
    {
        "source_sentence": "能生婬欲者是淨色，名為「好」；",
        "translation": "Those who can give rise to sexual desire are pure forms, which are called good.",
        "source": "T25n1509_021:0216a20_3"
    },
    {
        "source_sentence": "能生瞋恚者是不淨色，名為「醜」。",
        "translation": "Those who can give rise to anger are impure forms that are called ugly.",
        "source": "T25n1509_021:0216a21_0"
    },
    {
        "source_sentence": "於緣中自在勝知、勝見，行者於能生婬欲端正色中，不生婬欲；",
        "translation": "The practitioner who is self-dependent regarding the supporting objects of superior knowledge and superior vision, does not give rise to sexual desire among the forms that are capable of giving rise to sensual desire.",
        "source": "T25n1509_021:0216a21_1"
    },
    {
        "source_sentence": "於能生瞋恚惡色中，不生瞋恚。",
        "translation": "Among the bad forms that give rise to anger, anger doesn't arise.",
        "source": "T25n1509_021:0216a23_2"
    },
    {
        "source_sentence": "但觀色四大因緣和合生，如水沫不堅固——是名「若好、若醜」。",
        "translation": "They simply observe that the four major causes and conditions for form are combined to produce, like water bubbles that aren't firm - this is called whether good or ugly.",
        "source": "T25n1509_021:0216a23_3"
    },
    {
        "source_sentence": "「勝處」者，行者住是不淨門中，婬欲、瞋恚等諸結使來能不隨，是名「勝處」——勝是不淨中淨顛倒等諸煩惱賊故。",
        "translation": "The sphere of superiority means that practitioners abide in the gate of impurity and can not follow the afflictive tendencies of sexual desire, anger, and so forth, which are called the sphere of superiority - because they're superior to the afflictive thieves of pure delusion and other afflictions in the midst of impurity.",
        "source": "T25n1509_021:0216a25_4"
    },
    {
        "source_sentence": "問曰：行者云何內色相外觀色？",
        "translation": "Q: What's a practitioner's internal form and external form?",
        "source": "T25n1509_021:0216a27_5"
    },
    {
        "source_sentence": "答曰：是八勝處，深入定心調柔者可得。",
        "translation": "Answer: These are the eight abodes of excellence that can be attained by someone who enters deeply into concentration and has a gentle mind.",
        "source": "T25n1509_021:0216a28_6"
    },
    {
        "source_sentence": "行者或時見內身不淨，亦見外色不淨。",
        "translation": "Sometimes a practitioner sees an internal body that's impure, and they also see external form that's impure.",
        "source": "T25n1509_021:0216a29_7"
    },
    {
        "source_sentence": "不淨觀有二種：一者、三十六物等種種不淨；",
        "translation": "The contemplation on the repulsive is of two kinds:",
        "source": "T25n1509_021:0216b01_8"
    },
    {
        "source_sentence": "二者、除內外皮肉五藏，但觀白骨如珂如雪。",
        "translation": "Second, except for the five stores of internal and external skin and flesh, he simply observes that white bones are like snow.",
        "source": "T25n1509_021:0216b02_9"
    },
    {
        "source_sentence": "三十六物等觀是名「醜」，如珂如雪觀是名「好」。",
        "translation": "The contemplation of the thirty-six things and so forth is called ugly, and the contemplation of equality as snow is called good.",
        "source": "T25n1509_021:0216b03_10"
    },
    {
        "source_sentence": "行者內、外觀時，心散亂，難入禪；",
        "translation": "When the practitioner acts either internally or externally, his mind is distracted and he finds it difficult to enter meditation.",
        "source": "T25n1509_021:0216b04_11"
    },
    {
        "source_sentence": "除自身相，但觀外色，如《阿毘曇》中說。",
        "translation": "He observes external forms with the exception of his own characteristics, as explained in the abhidharma.",
        "source": "T25n1509_021:0216b05_12"
    },
    {
        "source_sentence": "行者以得解脫觀，見是身死；",
        "translation": "The practitioner, having gained the contemplation of liberation, saw this bodily death.",
        "source": "T25n1509_021:0216b06_13"
    },
    {
        "source_sentence": "死已，舉出塚間，若火燒、若虫噉，皆已滅盡，是時但見虫、火，不見身，是名「內無色相外觀色」。",
        "translation": "After he dies, he lifts it out of the tomb and leaves it, and whether it's burned by fire or gnawed by insects, they all cease, but then he only sees insects and fire and doesn't see his body, which is called form that appears as form when there's no form inside.",
        "source": "T25n1509_021:0216b06_14"
    },
    {
        "source_sentence": "行者如教受觀身是骨人，若心外散，還攝骨人緣中。",
        "translation": "Practitioners are likewise instructed to observe that the body is a skeleton, and if it's scattered outside the mind, it's still included in the condition of a skeleton.",
        "source": "T25n1509_021:0216b09_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_021:0216b10_16"
    },
    {
        "source_sentence": "是人初習行，未能觀細緣故，是名「少色」；",
        "translation": "Because these people are first accustomed to practice but can't observe subtle conditions, this is called having few forms.",
        "source": "T25n1509_021:0216b10_17"
    },
    {
        "source_sentence": "行者觀道轉深增長，以此一骨人，遍觀閻浮提皆是骨人，是名為「多」；",
        "translation": "Practitioners observe that the path grows in depth as it develops, and because of this one skeleton man, they pervade Jambudvfpa to see that all are skeletons.",
        "source": "T25n1509_021:0216b11_18"
    },
    {
        "source_sentence": "還復攝念觀一骨人，以是故名「勝知勝見」。",
        "translation": "Again, he collects the mind and observes a person with one bone, which is why it's called superior knowledge and superior views.",
        "source": "T25n1509_021:0216b13_19"
    },
    {
        "source_sentence": "復次，隨意五欲中男女相、淨潔相能勝故，名為「勝處」。",
        "translation": "Furthermore, because the male and pure characteristics of men and women can be superior in the five desires as they wish, it's called a superior place.",
        "source": "T25n1509_021:0216b14_20"
    },
    {
        "source_sentence": "譬如健人乘馬擊賊能破，是名為「勝」；",
        "translation": "It's like a strong man riding a horse and beating a thief to break it down, which is called superior.",
        "source": "T25n1509_021:0216b15_21"
    },
    {
        "source_sentence": "又能制御其馬，是亦名「勝」。",
        "translation": "He can also control his horse, which is also called superior.",
        "source": "T25n1509_021:0216b16_22"
    },
    {
        "source_sentence": "行者亦如是，能自於不淨觀中，少能多、多能少，是為「勝處」；",
        "translation": "Practitioners are also like this: when they can themselves contemplate impurity with little and much, and often with little, this is called the superior state.",
        "source": "T25n1509_021:0216b16_23"
    },
    {
        "source_sentence": "亦能破五欲賊，亦名「勝處」。",
        "translation": "It's also capable of destroying the five thieves of desire, which is also called the superior place.",
        "source": "T25n1509_021:0216b18_24"
    },
    {
        "source_sentence": "內未能壞身，外觀色若多、若少、若好、若醜，是初、第二勝處。",
        "translation": "If he doesn't internally disintegrate his body and appears with many, few, good, or ugly forms, this is the first and second superior place.",
        "source": "T25n1509_021:0216b18_25"
    },
    {
        "source_sentence": "內壞身無色相，觀外色若多、若少、若好、若醜，是第三、第四勝處。",
        "translation": "When the body disintegrates internally and has no form, observing external forms that are numerous, few, good, or ugly is the third and fourth superior state.",
        "source": "T25n1509_021:0216b20_26"
    },
    {
        "source_sentence": "攝心深入定中，壞內身，觀外淨，緣青，青色；",
        "translation": "He collects his mind and enters deeply into absorption. Disintegrating the internal body, he observes the external purity with reference to blue or blue color.",
        "source": "T25n1509_021:0216b21_27"
    },
    {
        "source_sentence": "黃、赤、白，白色，是為後四勝處。",
        "translation": "Yellow, red, white, white, and white are the last four spheres of superiority.",
        "source": "T25n1509_021:0216b22_28"
    },
    {
        "source_sentence": "問曰：是後四勝處、十一切處中青等四處，有何等異？",
        "translation": "Q: What's the difference between these last four abodes of excellence and the four places like blue in the ten universal abodes?",
        "source": "T25n1509_021:0216b23_29"
    },
    {
        "source_sentence": "答曰：青一切處，能普緣一切令青；",
        "translation": "Answer: All places of blue are able to condition all things and make them blue.",
        "source": "T25n1509_021:0216b24_30"
    },
    {
        "source_sentence": "是勝處若多、若少隨意觀，不令異心奪，「觀」勝是緣，名為勝處。",
        "translation": "Whether it's a superior place, whether numerous or few, he observes it as he wishes without being taken away by another mind, and the superiority of contemplation is the condition that's called the superior place.",
        "source": "T25n1509_021:0216b25_31"
    },
    {
        "source_sentence": "譬如轉輪聖王遍勝四天下，閻浮提王勝一天下而已。",
        "translation": "It's like when the wheel-turning sage king pervades the four continents and the king of Jambudvīpa is victorious under a single day.",
        "source": "T25n1509_021:0216b26_32"
    },
    {
        "source_sentence": "一切處普遍勝一切緣；",
        "translation": "All places are universally superior to all conditions.",
        "source": "T25n1509_021:0216b28_33"
    },
    {
        "source_sentence": "勝處但觀少色能勝，不能遍一切緣。",
        "translation": "The sphere of mastery only observes that a small number of forms can be superior, but it can't pervade all conditions.",
        "source": "T25n1509_021:0216b28_34"
    },
    {
        "source_sentence": "如是等，略說八勝處。",
        "translation": "These are briefly the eight spheres of mastery.",
        "source": "T25n1509_021:0216b29_35"
    },
    {
        "source_sentence": "「十一切處」者，背捨、勝處已說，此以遍滿緣故，名一切處。",
        "translation": "The ten all-embracing abodes have been explained as the liberation and the superior abode, which are called all-embracing because of their pervasive conditions.",
        "source": "T25n1509_021:0216c01_0"
    },
    {
        "source_sentence": "問曰：何以無所有處、非有想非無想處不名一切處？",
        "translation": "Q: Why isn't the sphere of nothingness, the sphere of neither perception nor non-perception called all places?",
        "source": "T25n1509_021:0216c02_1"
    },
    {
        "source_sentence": "答曰：是得解之心。",
        "translation": "Answer: It's the mind that attains understanding.",
        "source": "T25n1509_021:0216c03_2"
    },
    {
        "source_sentence": "「安隱快樂、廣大、無量、無邊虛空處」，是佛所說；",
        "translation": "The abode of peace and bliss, vast, immeasurable, and boundless space is what the Buddha has taught.",
        "source": "T25n1509_021:0216c03_3"
    },
    {
        "source_sentence": "一切處中皆有識，能疾緣一切法故，一切法中皆見有識。",
        "translation": "Consciousness exists in all places, because it can quickly refer to all dharmas. Consciousness is seen in all dharmas.",
        "source": "T25n1509_021:0216c04_4"
    },
    {
        "source_sentence": "以是故，二處立一切處。",
        "translation": "Because of this, two places establish all places.",
        "source": "T25n1509_021:0216c06_5"
    },
    {
        "source_sentence": "「無所有」中，無物可廣，亦不得快樂，佛亦不說是「無所有」無邊無量。",
        "translation": "In Nothing exists, there's nothing that can be expanded and no happiness, and the Buddha doesn't say that nothing exists is limitless and immeasurable.",
        "source": "T25n1509_021:0216c06_6"
    },
    {
        "source_sentence": "「非有想非無想處」心鈍，難得取相令廣大。",
        "translation": "The mind that's neither with perception nor without perception is dull, and it's difficult to grasp characteristics and make them vast.",
        "source": "T25n1509_021:0216c08_7"
    },
    {
        "source_sentence": "復次，虛空處近色界，亦能緣色。",
        "translation": "Furthermore, space near the realm of form can also be a supporting object for form.",
        "source": "T25n1509_021:0216c09_8"
    },
    {
        "source_sentence": "識處能緣緣色，又識處起能超入第四禪，第四禪起超入識處。",
        "translation": "The sphere of unlimited consciousness can take matter as supporting object; furthermore, what is produced in the sphere of unlimited consciousness can go beyond and enter the fourth trance.",
        "source": "T25n1509_021:0216c10_9"
    },
    {
        "source_sentence": "無所有處、非有想非無想處遠，無色因緣故，非一切處。",
        "translation": "The sphere of nothingness and the sphere of neither perception nor non-perception are distant, and it's because of formless causes and conditions that they aren't all places.",
        "source": "T25n1509_021:0216c11_10"
    },
    {
        "source_sentence": "是三種法皆行得。",
        "translation": "These three kinds of dharmas are all practiced and attained.",
        "source": "T25n1509_021:0216c12_11"
    },
    {
        "source_sentence": "勝處、一切處是有漏。",
        "translation": "The superior place and all places are contaminated.",
        "source": "T25n1509_021:0216c13_12"
    },
    {
        "source_sentence": "初三背捨、第七、第八背捨是有漏；",
        "translation": "The first three liberations, the seventh and the eighth liberations are impure.",
        "source": "T25n1509_021:0216c13_13"
    },
    {
        "source_sentence": "餘殘，或有漏、或無漏。",
        "translation": "The remaining residue is either contaminated or uncontaminated.",
        "source": "T25n1509_021:0216c14_14"
    },
    {
        "source_sentence": "初二背捨、初四勝處，初禪、二禪中攝。",
        "translation": "The first two liberations and the first four spheres of mastery are included in the first trance and in the second trance.",
        "source": "T25n1509_021:0216c15_0"
    },
    {
        "source_sentence": "淨背捨、後四勝處、八一切處，第四禪中攝。",
        "translation": "The pure liberation, the last four spheres of mastery and eight spheres of totality are included in the fourth trance.",
        "source": "T25n1509_021:0216c15_1"
    },
    {
        "source_sentence": "二一切處，即名說空處空處攝，識處識處攝。",
        "translation": "The second is the sphere of totality. That is to say, it is categorized as the sphere of names that speaks of the sphere of space and the sphere of emptiness; the sphere of consciousness is categorized as the sphere of consciousness.",
        "source": "T25n1509_021:0216c16_2"
    },
    {
        "source_sentence": "前三背捨、八勝處、八一切處，皆緣欲界。",
        "translation": "The first three liberations, eight spheres of mastery and eight spheres of totality all have the realm of sexual passion as supporting object.",
        "source": "T25n1509_021:0216c17_3"
    },
    {
        "source_sentence": "後四背捨，緣無色界及無漏法諸妙功德，在根本中，若無色根本不緣下地故。",
        "translation": "The last four liberations take the formless realm and pure factors as supporting object: because these marvelous qualities abide in the fundamental one.",
        "source": "T25n1509_021:0216c18_4"
    },
    {
        "source_sentence": "滅受想定，非心心數法故無緣。",
        "translation": "The absorption of cessation and feeling are without supporting object because they are not mental states or mental factors.",
        "source": "T25n1509_021:0216c20_5"
    },
    {
        "source_sentence": "非有想非無想處背捨，但緣無色四陰及無漏法。",
        "translation": "The liberation from the sphere of neither-identification-nor-nonidentification takes only the four formless aggregates and pure factors as supporting object.",
        "source": "T25n1509_021:0216c21_6"
    },
    {
        "source_sentence": "「九次第定」者，從初禪心起，次第入第二禪，不令餘心得入，若善若垢；",
        "translation": "The nine graduated concentrations are produced from the mind of the first trance and successively enter the second trance. They do not let other minds enter, whether good or bad.",
        "source": "T25n1509_021:0216c22_7"
    },
    {
        "source_sentence": "如是乃至滅受想定。",
        "translation": "It's like this up to the cessation of feeling and perception.",
        "source": "T25n1509_021:0216c24_8"
    },
    {
        "source_sentence": "問曰：餘者亦有次第，何以但稱「九次第定」？",
        "translation": "Q: The rest also have order, so why is it simply called the nine graduated concentrations?",
        "source": "T25n1509_021:0216c24_9"
    },
    {
        "source_sentence": "答曰：餘功德皆有異心間生，故非次第。",
        "translation": "Answer: The other qualities all arise separately between minds, so they aren't sequential.",
        "source": "T25n1509_021:0216c25_10"
    },
    {
        "source_sentence": "此中深心智慧利，行者自試其心，從一禪心起，次入二禪，不令異念得入；",
        "translation": "The practitioners test their own minds, arise from the awarenesses of the first trance and enter second trance. They do not let another thought enter them.",
        "source": "T25n1509_021:0216c26_11"
    },
    {
        "source_sentence": "於此功德心柔軟，善斷法愛故，能心心相次。",
        "translation": "Because of these virtues, the mind is soft and gentle; because it well eliminates attachment to phenomena, it can be mental or mental in order.",
        "source": "T25n1509_021:0216c28_12"
    },
    {
        "source_sentence": "是次第，二是有漏；",
        "translation": "In succession, these two are impure.",
        "source": "T25n1509_021:0216c29_13"
    },
    {
        "source_sentence": "七，或有漏或無漏。",
        "translation": "Seven, either contaminated or uncontaminated.",
        "source": "T25n1509_021:0216c29_14"
    },
    {
        "source_sentence": "禪中間、未到地不牢固，又是聖人所得，又此大功德不在邊地，是故無次第。",
        "translation": "In the middle of trance and before reaching the stages, they are not firm. They are also acquired by noble persons. Furthermore, these great qualities do not abide in the peripheral stages: that is why there is no succession.",
        "source": "T25n1509_021:0217a01_15"
    },
    {
        "source_sentence": "八背捨、八勝處、十一切處、九次第定，聲聞法中略說。",
        "translation": "The eight liberations, the eight spheres of mastery, the ten spheres of totality and the nine graduated concentrations are spoken of briefly in the sravaka-dharma.",
        "source": "T25n1509_021:0217a02_16"
    },
    {
        "source_sentence": "大智度論釋初品中九相義第三十五",
        "translation": "The Meaning of the Nine Characteristics in the First Chapter of the Explanation of the Treatise on the Mahāprajñāpāramitā",
        "source": "T25n1509_021:0217a05_0"
    },
    {
        "source_sentence": "【經】「九相：脹相、壞相、血塗相、膿爛相、青相、噉相、散相、骨相、燒相。」",
        "translation": "[Sutra] Nine marks: swelling marks, disintegrating marks, blood smeared marks, pus and rotten marks, blue marks, abscess marks, dispersed marks, bone marks, and burn marks.",
        "source": "T25n1509_021:0217a06_0"
    },
    {
        "source_sentence": "【論】問曰：應當先習九相離欲，然後得諸禪；",
        "translation": "[Commentary] Q: You should first cultivate the nine characteristics of freedom from desire, and then attain the meditations.",
        "source": "T25n1509_021:0217a07_1"
    },
    {
        "source_sentence": "何以故諸禪定後，方說九相？",
        "translation": "Why are only the nine characteristics spoken of after meditative absorptions?",
        "source": "T25n1509_021:0217a08_2"
    },
    {
        "source_sentence": "答曰：先說果報，令行者心樂。",
        "translation": "Answer: First, he explains the reward that causes practitioners to attain mental bliss.",
        "source": "T25n1509_021:0217a09_3"
    },
    {
        "source_sentence": "九相雖是不淨，人貪其果報，故必習行。",
        "translation": "Although the nine characteristics are impure, people covet their rewards and therefore must cultivate them.",
        "source": "T25n1509_021:0217a09_4"
    },
    {
        "source_sentence": "問曰：行者云何觀是脹相等九事？",
        "translation": "Q: How does a practitioner observe these nine things, such as swelling and so forth?",
        "source": "T25n1509_021:0217a10_5"
    },
    {
        "source_sentence": "答曰：行者先持戒清淨，令心不悔故，易受觀法，能破婬欲諸煩惱賊。",
        "translation": "Answer: A practitioner who first observes the precepts purely so that his mind doesn't regret them and easily accepts the contemplation of the Dharma can break through the thief of sexual desire and afflictions.",
        "source": "T25n1509_021:0217a11_6"
    },
    {
        "source_sentence": "觀人初死之日：辭訣言語，息出不反，奄忽已死；",
        "translation": "On the day of the first death of the human being, as soon as he had uttered his last words and breathed out without rising any more, he suddenly died.",
        "source": "T25n1509_021:0217a13_7"
    },
    {
        "source_sentence": "室家驚慟，號哭呼天，言說方爾，奄便那去！",
        "translation": "The monks of the house were terrified and cried out in tears, wailing and screaming to heaven, saying, Where are you going?",
        "source": "T25n1509_021:0217a14_8"
    },
    {
        "source_sentence": "氣滅身冷，無所覺識。",
        "translation": "Their breath ceases and their bodies become cold, and they have no perceptual consciousness.",
        "source": "T25n1509_021:0217a15_9"
    },
    {
        "source_sentence": "此為大畏，無可免處。",
        "translation": "This is a great fear, and there's no place to escape.",
        "source": "T25n1509_021:0217a15_10"
    },
    {
        "source_sentence": "譬如劫盡火燒，無有遺脫。",
        "translation": "It's like when an eon is consumed by fire and there's no escape.",
        "source": "T25n1509_021:0217a16_11"
    },
    {
        "source_sentence": "　「死至無貧富，　　無懃修善惡，",
        "translation": "“Death reaches the point where there’s no poverty or wealth, No anger cultivates wholesomeness or evil,",
        "source": "T25n1509_021:0217a16_12"
    },
    {
        "source_sentence": "　　無貴亦無賤，　　老少無免者。",
        "translation": "There's no value and no lowness, and there's no exemption for old and young.",
        "source": "T25n1509_021:0217a16_12"
    },
    {
        "source_sentence": "　　無祈請可救，　　亦無欺誑離，",
        "translation": "They have no prayers to be rescued, And no deceit or disobedience.",
        "source": "T25n1509_021:0217a16_12"
    },
    {
        "source_sentence": "　　無捍挌得脫，　　一切無免處！」",
        "translation": "There's no place to defend and attain liberation, and there's no place to escape!",
        "source": "T25n1509_021:0217a16_12"
    },
    {
        "source_sentence": "如說：死法名為永離恩愛之處，一切有生之所惡者；",
        "translation": "As has been said: The law in relation to death is called ‘the place of eternal separation from kindness and thirst.’ All beings who are born there do evil.",
        "source": "T25n1509_021:0217a16_12"
    },
    {
        "source_sentence": "雖甚惡之，無得脫者。",
        "translation": "Even though it's so bad, there's no one who can be liberated.",
        "source": "T25n1509_021:0217a22_13"
    },
    {
        "source_sentence": "我身不久，必當如是，同於木石，無所別知。",
        "translation": "Soon my body will surely be like this, just like wood and stone, with no one to know it separately.",
        "source": "T25n1509_021:0217a22_14"
    },
    {
        "source_sentence": "我今不應貪著五欲，不覺死至，同於牛羊；",
        "translation": "World-Honored One, now I should not cling to the five kinds of desire. If I do not feel death approaching me, it would be like that of a cow or sheep.",
        "source": "T25n1509_021:0217a23_15"
    },
    {
        "source_sentence": "牛羊禽獸，雖見死者，跳騰哮吼，不自覺悟。",
        "translation": "Even though cattle, sheep, animals, and birds see the dead, they jump and roar without realizing it for themselves.",
        "source": "T25n1509_021:0217a24_16"
    },
    {
        "source_sentence": "我既得人身，識別好醜，當求甘露不死之法。",
        "translation": "Now that I've obtained a human body, which distinguishes good and ugly, I should seek the Dharma of immortality.",
        "source": "T25n1509_021:0217a25_17"
    },
    {
        "source_sentence": "　「六情身完具，　　智鑒亦明利；",
        "translation": "The body of the six emotions is complete, And wisdom and discernment are also clear and sharp.",
        "source": "T25n1509_021:0217a26_18"
    },
    {
        "source_sentence": "　　而不求道法，　　唐受身智慧。",
        "translation": "They don't seek the path and Dharma, but they accept the body and wisdom of the Tang.",
        "source": "T25n1509_021:0217a26_18"
    },
    {
        "source_sentence": "　　禽獸亦皆知，　　欲樂以自恣；",
        "translation": "All the animals also know Their desires and pleasures for self-restraint.",
        "source": "T25n1509_021:0217a26_18"
    },
    {
        "source_sentence": "　　而不知方便，　　為道修善事。",
        "translation": "They don't know the method, cultivating good deeds for the sake of the path.",
        "source": "T25n1509_021:0217a26_18"
    },
    {
        "source_sentence": "　　既已得人身，　　而但自放恣；",
        "translation": "Having obtained a human body, They simply indulge in self-indulgence.",
        "source": "T25n1509_021:0217a26_18"
    },
    {
        "source_sentence": "　　不知修善行，　　與彼亦何異！",
        "translation": "If someone doesn't know to cultivate good actions, how is it different from them?",
        "source": "T25n1509_021:0217a26_18"
    },
    {
        "source_sentence": "　　三惡道眾生，　　不得修道業；",
        "translation": "Sentient beings in the three evil destinies Can’t cultivate religious practice.",
        "source": "T25n1509_021:0217a26_18"
    },
    {
        "source_sentence": "　　已得此人身，　　當勉自益利！」",
        "translation": "Having obtained this person's body, you must strive to benefit yourself!",
        "source": "T25n1509_021:0217a26_18"
    },
    {
        "source_sentence": "如說：行者到死屍邊，見死屍膖脹，如韋囊盛風，異於本相，心生厭畏，我身亦當如是，未脫此法。",
        "translation": "As it's said, when a practitioner goes to the side of a corpse and sees a corpse swollen with abscesses like Wei's bag full of wind, his mind becomes disillusioned with its original form and becomes frightened, and so will my body, which hasn't yet gotten rid of this teaching.",
        "source": "T25n1509_021:0217a26_18"
    },
    {
        "source_sentence": "身中主識役御此身，視聽、言語，作罪、作福，以此自貴，為何所趣？",
        "translation": "Consciousness, the lord of the body, serves and controls this body, looking after what's seen, heard, spoken, and done for sins and good deeds, so why does it aim for its own sake?",
        "source": "T25n1509_021:0217b08_19"
    },
    {
        "source_sentence": "而今但見空舍在此！",
        "translation": "Now, we're just seeing the abode of emptiness here!",
        "source": "T25n1509_021:0217b09_20"
    },
    {
        "source_sentence": "是身好相，細腰、姝媚、長眼、直鼻、平額、高眉，如是等好，令人心惑；",
        "translation": "These were the good features of his body, such as a fine waist, grace and beauty, long eyes, a straight nose, a flat forehead, and high eyebrows. Such beautiful features disturbed the mind.",
        "source": "T25n1509_021:0217b10_21"
    },
    {
        "source_sentence": "今但見膖脹，好在何處？",
        "translation": "Now, we're just seeing abscess swelling, so where is the good place?",
        "source": "T25n1509_021:0217b11_22"
    },
    {
        "source_sentence": "男女之相亦不可識。",
        "translation": "The characteristics of men and women can't be known either.",
        "source": "T25n1509_021:0217b12_23"
    },
    {
        "source_sentence": "作此觀已，呵著欲心，此臭屎囊膖脹可惡，何足貪著！",
        "translation": "After observing this, he rebukes his mind for craving, saying, This smelly bag of excrement swells and is bad, so why should he cling to it?",
        "source": "T25n1509_021:0217b12_24"
    },
    {
        "source_sentence": "死屍風熱轉大，裂壞在地，五藏、屎尿、膿血流出，惡露已現。",
        "translation": "The wind and fever of the dead corpse became so strong that it broke apart and fell to the ground. Five stores, excrement, urine, pus, and blood poured forth, leaving behind an unpleasant dew visible like this.",
        "source": "T25n1509_021:0217b14_25"
    },
    {
        "source_sentence": "行者取是壞相，以況己身：「我亦如是，皆有是物，與此何異？",
        "translation": "The practitioner takes this as the characteristic of disintegration and describes it to himself, saying, So is self, which all have these things, so what's the difference between them?",
        "source": "T25n1509_021:0217b15_26"
    },
    {
        "source_sentence": "我為甚惑，為此屎囊、薄皮所誑；",
        "translation": "I am greatly confused, being burned by this mass of excrement and thin skin.",
        "source": "T25n1509_021:0217b16_27"
    },
    {
        "source_sentence": "如燈蛾投火，但貪明色，不知燒身。",
        "translation": "It's like a lamp moth that throws itself into a fire but clings to bright form and doesn't know it burns its body.",
        "source": "T25n1509_021:0217b17_28"
    },
    {
        "source_sentence": "已見裂壞，男女相滅，我所著者，亦皆如是。」",
        "translation": "They've already seen the disintegration, the male and female characteristics cease, and so does what I'm attached to.",
        "source": "T25n1509_021:0217b18_29"
    },
    {
        "source_sentence": "死屍已壞，肉血塗漫。",
        "translation": "The corpse had already disintegrated and was covered with flesh and blood.",
        "source": "T25n1509_021:0217b19_30"
    },
    {
        "source_sentence": "或見杖楚死者，青瘀、黃、赤，或日曝瘀黑；",
        "translation": "Some saw that the corpse was bruised on the staff, either blue, yellow, or red; some were sun-smeared and bruised black.",
        "source": "T25n1509_021:0217b19_31"
    },
    {
        "source_sentence": "具取是相，觀所著者，若赤白之色，淨潔端正，與此何異？",
        "translation": "If they are red and white in color, pure and handsome, what's the difference between them?",
        "source": "T25n1509_021:0217b20_32"
    },
    {
        "source_sentence": "既見青瘀黃赤，鳥獸不食，不埋不藏，不久膿爛，種種虫生。",
        "translation": "When they see blue bruises, yellow bruises, and red bruises, birds and beasts won't eat them, buried or hide them, and soon the pus will rot and various insects will grow.",
        "source": "T25n1509_021:0217b22_33"
    },
    {
        "source_sentence": "行者見已，念此死屍本有好色，好香塗身，衣以上服，飾以華綵；",
        "translation": "Seeing the corpse, the traveler thought to himself, “This old corpse had a nice color. The body coated with good fragrance and dressed in upper garments decorated with flowery silk.",
        "source": "T25n1509_021:0217b23_34"
    },
    {
        "source_sentence": "今但臭壞，膿爛塗染，此是其實分；",
        "translation": "But now it smells bad and disintegrates, with pus rising up and smeared. This is the true aspect.",
        "source": "T25n1509_021:0217b24_35"
    },
    {
        "source_sentence": "先所飾綵，皆是假借。",
        "translation": "All the previously decorated silk was borrowed.",
        "source": "T25n1509_021:0217b25_36"
    },
    {
        "source_sentence": "若不燒不埋，棄之曠野，為鳥獸所食。",
        "translation": "If he doesn't burn it or bury it, he discards it in the wilderness and is eaten by birds and animals.",
        "source": "T25n1509_021:0217b26_37"
    },
    {
        "source_sentence": "烏挑其眼，狗分手腳，虎狼刳腹，分掣爴裂。",
        "translation": "A crow picks its eyes, a dog breaks off its legs, a tiger or wolf lies on its belly, and the parts are split into two.",
        "source": "T25n1509_021:0217b27_38"
    },
    {
        "source_sentence": "殘藉在地，有盡不盡。",
        "translation": "The residue remains on the ground are inexhaustible and inexhaustible.",
        "source": "T25n1509_021:0217b28_39"
    },
    {
        "source_sentence": "行者見已，心生厭想，思惟：「此屍未壞之時，人所著處；",
        "translation": "Seeing this, the traveler became disgusted and thought:",
        "source": "T25n1509_021:0217b28_40"
    },
    {
        "source_sentence": "而今壞敗，無復本相，但見殘藉，鳥獸食處，甚可惡畏。」",
        "translation": "Now that it's disintegrating, there's no longer any original form but a place where birds and animals eat and are seen to be in distress.",
        "source": "T25n1509_021:0217b29_41"
    },
    {
        "source_sentence": "鳥獸已去，風日飄曝，筋斷骨離，各各異處。",
        "translation": "After the birds and animals had departed, the wind and sun blew to expose them, and their tendons were severed and their bones were separated, each in a different place.",
        "source": "T25n1509_021:0217c02_42"
    },
    {
        "source_sentence": "行者思惟：「本見身法，和合而有身相，男女皆可分別；",
        "translation": "The practitioner thought: In the past I saw bodily dharmas, which are harmonious and endowed with bodily characteristics. Men and women can all be distinguished as male or female.",
        "source": "T25n1509_021:0217c03_0"
    },
    {
        "source_sentence": "今已離散，各在異處，和合法滅，身相亦無，皆異於本，所可愛著，今在何處？」",
        "translation": "Now that they've been separated, each is in a different place, peaceful and legally extinguished, the body and characteristics are also absent, all different from the original, and where is it now?",
        "source": "T25n1509_021:0217c04_1"
    },
    {
        "source_sentence": "身既離散，處處白骨，鳥獸食已，唯有骨在；",
        "translation": "His body disintegrated, and everywhere he found white bones. After the birds and beasts ate these bones, only the skeleton remained.",
        "source": "T25n1509_021:0217c05_2"
    },
    {
        "source_sentence": "觀是骨人，是為骨相。",
        "translation": "He observes that this is a skeleton, which is the characteristic of a skeleton.",
        "source": "T25n1509_021:0217c06_3"
    },
    {
        "source_sentence": "骨相有二種：一者骨人筋骨相連，二者骨節分離。",
        "translation": "There are two kinds of characteristics of bones: first, the bones are connected by tendons and bones; second, the bones are separated by knuckles.",
        "source": "T25n1509_021:0217c07_4"
    },
    {
        "source_sentence": "筋骨相連破男女、長短、好色、細滑之相；",
        "translation": "The sinews and bones are linked together to form male and female, long and short, beautiful and fine in appearance.",
        "source": "T25n1509_021:0217c08_5"
    },
    {
        "source_sentence": "骨節分離，破眾生根本實相。",
        "translation": "The bones and knuckles are separated, destroying the fundamental true characteristics of sentient beings.",
        "source": "T25n1509_021:0217c09_6"
    },
    {
        "source_sentence": "復有二種：一者淨，二者不淨。",
        "translation": "Again, there are two kinds: the first pure and the second impure.",
        "source": "T25n1509_021:0217c10_7"
    },
    {
        "source_sentence": "淨者，久骨白淨，無血無膩，色如白雪；",
        "translation": "The pure one is that the bones have been white and pure for a long time without bleeding or grime, with the color of white snow.",
        "source": "T25n1509_021:0217c10_8"
    },
    {
        "source_sentence": "不淨者，餘血塗染，膩膏未盡。",
        "translation": "impure means the remaining blood is smeared with dirt and grease that hasn't ended.",
        "source": "T25n1509_021:0217c11_9"
    },
    {
        "source_sentence": "行者到屍林中，或見積多草木，焚燒死屍，腹破眼出，皮色燋黑，甚可惡畏。",
        "translation": "When the practitioner went into the cemetery, he might see a pile of grass and trees that burned the dead corpse. His belly broke open and his eyes came out; its skin was coarse black in color and very fearsome.",
        "source": "T25n1509_021:0217c12_10"
    },
    {
        "source_sentence": "須臾之間，變為灰燼。",
        "translation": "In a moment, it turns into ashes.",
        "source": "T25n1509_021:0217c14_11"
    },
    {
        "source_sentence": "行者取是燒相，思惟：「此身未死之前，沐浴香華，五欲自恣；",
        "translation": "The practitioner grasped this mark of burning and thought to himself: Before my body dies, I will bathe myself in fragrant flowers and indulge in the five desires freely.",
        "source": "T25n1509_021:0217c14_12"
    },
    {
        "source_sentence": "今為火燒，甚於兵刃！",
        "translation": "Now it's burned by fire, much more so than the sword of war!",
        "source": "T25n1509_021:0217c15_13"
    },
    {
        "source_sentence": "此屍初死，形猶似人；",
        "translation": "When the corpse first died it looked human in form.",
        "source": "T25n1509_021:0217c16_14"
    },
    {
        "source_sentence": "火燒須臾，本相都失。",
        "translation": "In a moment, the fire burns them all away from their original marks.",
        "source": "T25n1509_021:0217c16_15"
    },
    {
        "source_sentence": "一切有身皆歸無常，我亦如是。」",
        "translation": "All existent bodies return to impermanence, and so do I.",
        "source": "T25n1509_021:0217c17_16"
    },
    {
        "source_sentence": "是九相，斷諸煩惱，於滅婬欲最勝；",
        "translation": "These nine characteristics abandon defilement and are preeminent among the cessation of sexual desire.",
        "source": "T25n1509_021:0217c18_17"
    },
    {
        "source_sentence": "為滅婬欲故，說是九相。",
        "translation": "In order to extinguish sexual desire, these nine characteristics are spoken of.",
        "source": "T25n1509_021:0217c19_0"
    },
    {
        "source_sentence": "問曰：無常等十想，為滅何事故說？",
        "translation": "Q: What are the ten conceptions of impermanence and so forth that are explained as cessation?",
        "source": "T25n1509_021:0217c19_1"
    },
    {
        "source_sentence": "答曰：亦為滅婬欲等三毒。",
        "translation": "Answer: It's also for the purpose of extinguishing the three poisons of sexual desire and so forth.",
        "source": "T25n1509_021:0217c20_2"
    },
    {
        "source_sentence": "問曰：若爾者，二相有何等異？",
        "translation": "Q: If that's the case, what's the difference between the two characteristics?",
        "source": "T25n1509_021:0217c21_0"
    },
    {
        "source_sentence": "答曰：九相為遮未得禪定，為婬欲所覆故；",
        "translation": "Answer: The nine characteristic marks obstruct meditative attainment not acquired yet: because they are obstructed by sexual desire.",
        "source": "T25n1509_021:0217c21_1"
    },
    {
        "source_sentence": "十想能除滅婬欲等三毒。",
        "translation": "The ten conceptions can remove the three poisons of sexual desire and so forth.",
        "source": "T25n1509_021:0217c22_2"
    },
    {
        "source_sentence": "九相如縛賊，十想如斬殺。",
        "translation": "The nine characteristics are like binding thieves, and the ten conceptions are like cutting and killing.",
        "source": "T25n1509_021:0217c23_3"
    },
    {
        "source_sentence": "九相為初學，十想為成就。",
        "translation": "The nine characteristic marks are the first learning; ten conceptual identifications are what is accomplished.",
        "source": "T25n1509_021:0217c24_0"
    },
    {
        "source_sentence": "復次，是十想中，不淨想攝九相。",
        "translation": "Furthermore, among these ten conceptions, the conception of impurity includes nine characteristics.",
        "source": "T25n1509_021:0217c24_1"
    },
    {
        "source_sentence": "有人言：十想中，不淨想、食不淨想、世間不可樂想攝九相。",
        "translation": "Some people say, Among the ten conceptions, the conception of impurity, the conception of food that's not pure, and the conception of worldly unpleasantness contain nine characteristics.",
        "source": "T25n1509_021:0217c25_2"
    },
    {
        "source_sentence": "復有人言：十想、九相同為離欲，俱為涅槃。",
        "translation": "Again, someone says, The ten conceptions and nine are the same as being free of desire, and both are nirvāṇa.",
        "source": "T25n1509_021:0217c26_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_021:0217c27_4"
    },
    {
        "source_sentence": "初死相，動轉、言語須臾之間，忽然已死；",
        "translation": "The first sign of death is that within a split second, as soon as one has moved or spoken, he suddenly dies.",
        "source": "T25n1509_021:0217c27_5"
    },
    {
        "source_sentence": "身體膖脹，爛壞分散，各各變異，是則無常。",
        "translation": "Their bodies are gross and swollen, disintegrating and dispersed, each changing in its own way. This is impermanence.",
        "source": "T25n1509_021:0217c28_6"
    },
    {
        "source_sentence": "若著此法，無常壞時，是即為苦。",
        "translation": "If someone were to cling to this teaching, it would be painful when impermanence breaks down.",
        "source": "T25n1509_021:0217c29_7"
    },
    {
        "source_sentence": "若無常苦、無得自在者，是則無我。",
        "translation": "If it's impermanent, painful, and unobtainable without self, then there's no self.",
        "source": "T25n1509_021:0218a01_8"
    },
    {
        "source_sentence": "不淨、無常、苦、無我，則不可樂，觀身如是。",
        "translation": "If it's impure, impermanent, painful, and selfless, then it's unpleasant, and observing the body is like this.",
        "source": "T25n1509_021:0218a02_9"
    },
    {
        "source_sentence": "食雖在口，腦涎流下，與唾和合成味，而咽與吐無異，下入腹中，即是食不淨想。",
        "translation": "Even though food is in the mouth, saliva flows downward from the brain and goes down to the abdomen, where it's combined with spittle and taste, but swallowing and vomiting are no different, and going down into the abdomen is the perception of food that's impure.",
        "source": "T25n1509_021:0218a03_10"
    },
    {
        "source_sentence": "以此九相觀身無常，變異，念念皆滅，即是死想。",
        "translation": "Because of these nine characteristics, he observes that the body is impermanent and varies, and each thought ceases, which is the perception of death.",
        "source": "T25n1509_021:0218a05_11"
    },
    {
        "source_sentence": "以是九相厭世間樂，知煩惱斷，則安隱寂滅，即是斷相。",
        "translation": "Because these nine characteristics are disillusioned with worldly pleasures, knowing the afflictions are stopped, they become peaceful and tranquil, which is the characteristic of stopping.",
        "source": "T25n1509_021:0218a06_12"
    },
    {
        "source_sentence": "以是九相遮諸煩惱，即是離想。",
        "translation": "These nine characteristics obscure the defilements, which are free of perception.",
        "source": "T25n1509_021:0218a07_13"
    },
    {
        "source_sentence": "以是九相厭世間故，知此五眾滅，更不復生，是處安隱，即是盡想。",
        "translation": "Because these nine characteristics are disillusioned with the world, they know that these five things cease and don't arise again, and this place is peaceful, which is the perception of cessation.",
        "source": "T25n1509_021:0218a08_14"
    },
    {
        "source_sentence": "復次，九相為因，十想為果。",
        "translation": "Furthermore, nine characteristic marks are the cause and ten conceptual identifications are the effect.",
        "source": "T25n1509_021:0218a09_15"
    },
    {
        "source_sentence": "是故先九相，後十想。",
        "translation": "That is why the first nine characteristic marks and the last ten conceptual identifications are spoken of.",
        "source": "T25n1509_021:0218a10_16"
    },
    {
        "source_sentence": "復次，九相為外門，十想為內門，是故經言：「二為甘露門：一者不淨門，二者安那般那門。」",
        "translation": "Furthermore, the nine characteristics are external and the ten conceptions are internal; therefore, the sūtra says, The two are the gate of ambrosia: one is the gate of impurity, and the other is the gate of breathing.",
        "source": "T25n1509_021:0218a11_17"
    },
    {
        "source_sentence": "是九相，除人七種染著：或有人染著色：若赤、若白、若赤白、若黃、若黑。",
        "translation": "These are the nine characteristics, except for the seven kinds of defiled attachment of people: sometimes a person is defiled by form: whether red, sometimes white, sometimes red-white, sometimes yellow, sometimes black.",
        "source": "T25n1509_021:0218a13_18"
    },
    {
        "source_sentence": "或有人不著色，但染著形容：細膚、纖指、修目、高眉。",
        "translation": "Sometimes a person doesn't cling to form but becomes defiled by appearance: fine skin, slender fingers, cultivated eyes, and high eyebrows.",
        "source": "T25n1509_021:0218a14_19"
    },
    {
        "source_sentence": "或有人不著容、色，但染著威儀：進、止、坐、起、行、住、禮拜、俯仰、揚眉、頓睫、親近、按摩。",
        "translation": "Sometimes a person doesn't cling to appearance or form but becomes attached to manner: advancing, stopping, sitting, rising, walking, standing, venerating, prostrating, bowing, raising their eyebrows, sudden eyelashes, approaching, and massage.",
        "source": "T25n1509_021:0218a16_20"
    },
    {
        "source_sentence": "或有人不著容、色、威儀，但染著言語、軟聲、美辭、隨時而說、應意承旨，能動人心。",
        "translation": "Sometimes a person doesn't cling to appearance, form, or mannerisms, but becomes attached to words, soft sounds, beautiful words, explanations at any time, and responses that move their minds.",
        "source": "T25n1509_021:0218a17_21"
    },
    {
        "source_sentence": "或有人不著容、色、威儀、軟聲，但染著細滑、柔膚軟肌，熱時身涼，寒時體溫。",
        "translation": "Sometimes a person isn't attached to appearance, form, mannerisms, or soft sounds but is only stained with fine and smooth, soft and soft skin. When it's hot, his body is cool, and when it's cold, his body is warm.",
        "source": "T25n1509_021:0218a19_22"
    },
    {
        "source_sentence": "或有人皆著五事。",
        "translation": "Some people are all attached to five things.",
        "source": "T25n1509_021:0218a21_23"
    },
    {
        "source_sentence": "或有人都不著五事，但染著人相，若男、若女。",
        "translation": "Sometimes a person doesn't attach to five things but becomes attached to the characteristics of people, whether male or female.",
        "source": "T25n1509_021:0218a21_24"
    },
    {
        "source_sentence": "雖得上六種欲，不得所著之人，猶無所解，捨世所重五種欲樂而隨其死。",
        "translation": "Even though they've attained the upper six kinds of desire, they can't get the person to whom they're attached, but they still don't understand anything, abandon the five kinds of desires and pleasures that are valued in the world and follow their death.",
        "source": "T25n1509_021:0218a23_0"
    },
    {
        "source_sentence": "死相多除威儀、語言愛。",
        "translation": "The mark of death mostly removes deportment and verbal craving.",
        "source": "T25n1509_021:0218a24_1"
    },
    {
        "source_sentence": "膖脹相、壞相、噉相、散相多除形容愛。",
        "translation": "The characteristic of swelling, the characteristic of disintegration, the characteristic of crudeness, and the characteristic of dispersal are mostly free of descriptive craving.",
        "source": "T25n1509_021:0218a25_2"
    },
    {
        "source_sentence": "血塗相、青瘀相、膿爛相多除色愛。",
        "translation": "The characteristic of being covered with blood, the characteristic of being blue and bruised, and the characteristic of being pussed are mostly free of craving for form.",
        "source": "T25n1509_021:0218a26_3"
    },
    {
        "source_sentence": "骨相、燒相多除細滑愛。",
        "translation": "The characteristic of bones and the characteristic of burning are mostly free of subtle craving.",
        "source": "T25n1509_021:0218a26_4"
    },
    {
        "source_sentence": "九相除雜愛及所著人愛。",
        "translation": "The nine characteristics remove mixed craving and the human craving that's attached to it.",
        "source": "T25n1509_021:0218a27_5"
    },
    {
        "source_sentence": "噉相、散相、骨相偏除人愛；",
        "translation": "The characteristic of grossness, the characteristic of dispersal and the characteristic of bones are to be abandoned through overweeningly rejecting craving for humans.",
        "source": "T25n1509_021:0218a28_0"
    },
    {
        "source_sentence": "噉殘、離散、白骨中，不見有人可著。",
        "translation": "They don't see anyone to wear it in the crude, disintegrated, or white bones.",
        "source": "T25n1509_021:0218a28_1"
    },
    {
        "source_sentence": "以是九相觀離愛心，瞋癡亦微薄。",
        "translation": "Because these nine characteristics of contemplation are free of craving, anger and delusion are also weak.",
        "source": "T25n1509_021:0218a29_2"
    },
    {
        "source_sentence": "不淨中淨顛倒，癡故著是身。",
        "translation": "Among the impure ones, the pure one is overturned: because of being attached to this body due to delusion.",
        "source": "T25n1509_021:0218b01_3"
    },
    {
        "source_sentence": "今以是九相披析身內，見是身相，癡心薄；",
        "translation": "Now, by means of these nine characteristics they are scattered and analyzed within the body. Seeing these characteristics of the body, their delusion is weakened.",
        "source": "T25n1509_021:0218b01_4"
    },
    {
        "source_sentence": "癡心薄則貪欲薄；",
        "translation": "When the awarenesses of delusion are weak, attachment to sensual pleasure is weak.",
        "source": "T25n1509_021:0218b02_5"
    },
    {
        "source_sentence": "貪欲薄則瞋亦薄。",
        "translation": "When craving is weak, anger is also weak.",
        "source": "T25n1509_021:0218b03_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_021:0218b03_7"
    },
    {
        "source_sentence": "人以貪身故生瞋，今觀身不淨，心厭故不復貪身；",
        "translation": "People become angry because they covet the body, and now observe that the body is impure. Because their minds are disgusted with it, they no longer covet the body.",
        "source": "T25n1509_021:0218b04_0"
    },
    {
        "source_sentence": "不貪身故，不復生瞋。",
        "translation": "Because they don't crave the body, they won't again become angry.",
        "source": "T25n1509_021:0218b05_1"
    },
    {
        "source_sentence": "三毒薄故，一切九十八使山皆動，漸漸增進其道，以金剛三昧，摧碎結山。",
        "translation": "Because the three poisons are weak, all the ninety-eight contaminants cause the mountains to move, gradually increasing their paths, and they use adamantine concentration to destroy the formations of the mountains.",
        "source": "T25n1509_021:0218b05_2"
    },
    {
        "source_sentence": "九相雖是不淨觀，依是能成大事；",
        "translation": "Although the nine characteristics are an impure contemplation, it is by relying on them that great works can be done.",
        "source": "T25n1509_021:0218b07_3"
    },
    {
        "source_sentence": "譬如大海中臭屍，溺人依以得渡。",
        "translation": "It's like a foul-smelling corpse in the ocean that drowns and depends on it to cross.",
        "source": "T25n1509_021:0218b08_4"
    },
    {
        "source_sentence": "問曰：是九相有何性？",
        "translation": "Q: What's the nature of these nine characteristics?",
        "source": "T25n1509_021:0218b09_0"
    },
    {
        "source_sentence": "何所緣？",
        "translation": "What's the perceptual object?",
        "source": "T25n1509_021:0218b09_1"
    },
    {
        "source_sentence": "何處攝？",
        "translation": "Where are they included?",
        "source": "T25n1509_021:0218b09_2"
    },
    {
        "source_sentence": "答曰：取相性，緣欲界身，色相陰攝，亦身念處少分；",
        "translation": "Answer: The nature of grasping characteristics takes the body in the realm of sexual passion as supporting object. It is included in the aggregate matter and characteristic marks, but also in a small part of the application of mindfulness on the body.",
        "source": "T25n1509_021:0218b09_3"
    },
    {
        "source_sentence": "或欲界攝，或初禪、二禪、四禪攝。",
        "translation": "It may be included in the desire realm, or it may be included in the first dhyāna, second dhyāna, or fourth dhyāna.",
        "source": "T25n1509_021:0218b11_4"
    },
    {
        "source_sentence": "未離欲、散心人得，欲界繫；",
        "translation": "In the realm of sexual passion and in the one who is not free from attachment, it is acquired by persons with dispersed awarenesses.",
        "source": "T25n1509_021:0218b11_5"
    },
    {
        "source_sentence": "離欲人心得，色界繫。",
        "translation": "The mind of a person who's free of desire is bound to the form realm.",
        "source": "T25n1509_021:0218b12_6"
    },
    {
        "source_sentence": "膖脹等八相，欲界、初禪、二禪中攝；",
        "translation": "The eight characteristic marks such as roughness and swelling are included in the realm of sexual passion, in the first trance and in the second trance.",
        "source": "T25n1509_021:0218b12_7"
    },
    {
        "source_sentence": "淨骨相，欲界、初禪、二禪、四禪中攝。",
        "translation": "The characteristic mark of the pure bones is included in the realm of sexual passion, in the first trance, in the second trance and in the fourth trance.",
        "source": "T25n1509_021:0218b13_8"
    },
    {
        "source_sentence": "三禪中多樂故，無是相。",
        "translation": "Because there is much satisfaction in the third trance, it has no such characteristic marks.",
        "source": "T25n1509_021:0218b14_9"
    },
    {
        "source_sentence": "是九相是開身念處門，身念處開三念處門，是四念處開三十七品門，三十七品開涅槃城門，入涅槃，離一切憂惱諸苦，滅五陰因緣生故，受涅槃常樂。",
        "translation": "These nine characteristics are the gate that opens up the mindfulness of body, the three gates that open up the mindfulness of body and the four gates of mindfulness that open up the thirty-seven chapters, the thirty-seven chapters that open up the gate of the city of nirvāṇa, entering nirvāṇa, being free of all sorrow and suffering, ceasing the five aggregates",
        "source": "T25n1509_021:0218b14_10"
    },
    {
        "source_sentence": "問曰：聲聞人如是觀，心厭離，欲疾入涅槃；",
        "translation": "Q: A śrāvaka observes in this way, his mind becomes disillusioned and wants to quickly enter nirvana.",
        "source": "T25n1509_021:0218b18_11"
    },
    {
        "source_sentence": "菩薩憐愍一切眾生、集一切佛法、度一切眾生、不求疾入涅槃故，觀是九相，云何不墮二乘證？",
        "translation": "Because the bodhisattva pities all sentient beings, collects all the Buddha's teachings, liberates all sentient beings, and doesn't seek to quickly enter nirvāṇa, he observes these nine characteristics, so how can he not fall into the realization of the two vehicles?",
        "source": "T25n1509_021:0218b19_12"
    },
    {
        "source_sentence": "答曰：菩薩於眾生心生憐愍，知眾生以三毒因緣故，受今世、後世身、心苦痛。",
        "translation": "Answer: The bodhisattva's mind is compassionate toward sentient beings, knowing that sentient beings experience the pain and suffering of body and mind in the present and future lives because of the causes and conditions of the three poisons.",
        "source": "T25n1509_021:0218b21_13"
    },
    {
        "source_sentence": "是三毒終不自滅，亦不可以餘理得滅；",
        "translation": "These three poisons cannot be extinguished by themselves, nor can they be extinguished in any other way.",
        "source": "T25n1509_021:0218b23_14"
    },
    {
        "source_sentence": "但觀所著內外身相，然後可除。",
        "translation": "He simply observes the internal and external bodily marks that he's attached to, and then he can remove them.",
        "source": "T25n1509_021:0218b24_15"
    },
    {
        "source_sentence": "以是故，菩薩欲滅是婬欲毒故，觀是九相。",
        "translation": "Because of this, the bodhisattva's desire to cease is the poison of sexual desire, and he observes these nine characteristics.",
        "source": "T25n1509_021:0218b25_16"
    },
    {
        "source_sentence": "如人憐愍病者，合和諸藥以療之；",
        "translation": "It is like a man who, out of pity for someone suffering from an illness, mixes together the medicines to heal them.",
        "source": "T25n1509_021:0218b26_17"
    },
    {
        "source_sentence": "菩薩亦如是，為著色眾生，說是青瘀相等，隨其所著，分別諸相，如先說。",
        "translation": "Similarly, the bodhisattva explains to sentient beings who are attached to form that it's the characteristic of blue bruises and so forth, and he discerns the characteristics according to what they're attached to, as explained above.",
        "source": "T25n1509_021:0218b27_18"
    },
    {
        "source_sentence": "是為菩薩行九相觀。",
        "translation": "This is the bodhisattva's practice of observing the nine characteristics.",
        "source": "T25n1509_021:0218b28_19"
    },
    {
        "source_sentence": "復次，菩薩以大慈悲心，行是九相，作如是念：「我未具足一切佛法，不入涅槃，是為一法門，我不應住此一門，我當學一切法門。」",
        "translation": "Furthermore, with great compassion, the bodhisattva practices these nine characteristics and thinks, I don't have all the buddha-teachings and won't enter nirvāṇa; this is one teaching; I shouldn't abide in this one teaching; I will study all the teachings.",
        "source": "T25n1509_021:0218c01_0"
    },
    {
        "source_sentence": "以是故，菩薩行九相無所妨。",
        "translation": "Because of this, the bodhisattva's practice of the nine characteristics is unobstructed.",
        "source": "T25n1509_021:0218c04_1"
    },
    {
        "source_sentence": "菩薩行是九相，或時厭患心起，如是不淨身可惡可患，欲疾取涅槃。",
        "translation": "The bodhisattva's practice is of these nine characteristics, and sometimes he becomes disillusioned with a mind that produces distress, such as an impure body that's bad or painful, wanting to quickly attain nirvāṇa.",
        "source": "T25n1509_021:0218c04_2"
    },
    {
        "source_sentence": "爾時，菩薩作是念：「十方諸佛說：一切法相空，空中無無常，何況有不淨！",
        "translation": "At the time, the bodhisattva had this thought, The buddhas of the ten directions say that all characteristics of dharmas are empty, and there's nothing impermanent in space, so why wouldn't there be anything impure?",
        "source": "T25n1509_021:0218c06_3"
    },
    {
        "source_sentence": "但為破淨顛倒故習此不淨，是不淨皆從因緣和合生，無有自性，皆歸空相；",
        "translation": "It is only to dispel the delusion of purity that they develop these forms of impurity. All impure forms arise from the conjunction of causes and conditions, have no self-nature, and all belong to the characteristic of emptiness.",
        "source": "T25n1509_021:0218c08_4"
    },
    {
        "source_sentence": "我今不應取是因緣和合生無自性不淨法，欲疾入涅槃。」",
        "translation": "Now, I shouldn't take these causes and conditions that are combined to give rise to an impure dharma with no self-nature and want to quickly enter nirvāṇa.",
        "source": "T25n1509_021:0218c09_5"
    },
    {
        "source_sentence": "經中亦有是說：「若色中無味相，眾生不應著色；",
        "translation": "The sūtra also says: If there were no taste and characteristics in form, sentient beings would not cling to form.",
        "source": "T25n1509_021:0218c11_6"
    },
    {
        "source_sentence": "以色中有味故，眾生起著。",
        "translation": "Because there's taste in form, sentient beings become attached.",
        "source": "T25n1509_021:0218c12_7"
    },
    {
        "source_sentence": "若色無過罪，眾生亦無厭色者；",
        "translation": "If form is without blameworthiness, sentient beings also do not detest form.",
        "source": "T25n1509_021:0218c13_8"
    },
    {
        "source_sentence": "以色實有過惡，故觀色則厭。",
        "translation": "Because form really has faults and evils, they're disillusioned when they look at form.",
        "source": "T25n1509_021:0218c13_9"
    },
    {
        "source_sentence": "若色中無出相，眾生亦不能於色得脫；",
        "translation": "If there were no external characteristics in form, sentient beings would not be able to attain liberation from form.",
        "source": "T25n1509_021:0218c14_10"
    },
    {
        "source_sentence": "以色有出相故，眾生於色得解脫。」",
        "translation": "It's because form has distinctive characteristics that sentient beings attain liberation from form.",
        "source": "T25n1509_021:0218c15_11"
    },
    {
        "source_sentence": "味是淨相因緣故，以是故，菩薩不於不淨中沒、早取涅槃。",
        "translation": "Because taste is the causal condition for the characteristic of purity, the bodhisattva doesn't fall into impurity and quickly attain nirvāṇa because of this.",
        "source": "T25n1509_021:0218c16_12"
    },
    {
        "source_sentence": "九相義，分別竟。",
        "translation": "The meaning of the nine characteristics has been discerned.",
        "source": "T25n1509_021:0218c17_13"
    },
    {
        "source_sentence": "大智度論釋初品中八念義第三十",
        "translation": "Dazhiduo lun explains the meaning of the eight kinds of mindfulness in the first chapter, number 30",
        "source": "T25n1509_021:0218c19_0"
    },
    {
        "source_sentence": "六之一",
        "translation": "one of the six",
        "source": "T25n1509_021:0218c20_0"
    },
    {
        "source_sentence": "【經】「念佛、念法、念僧、念戒、念捨、念天、念入出息、念死。」",
        "translation": "[Sutra] Mindful of the Buddha, mindful of the Dharma, mindful of the saṃgha, mindful of precepts, mindful of equanimity, mindful of heaven, mindful of inhalation and exhalation, and mindful of death.",
        "source": "T25n1509_021:0218c21_0"
    },
    {
        "source_sentence": "【論】問曰：何以故九相次第有八念？",
        "translation": "[Commentary] Q: Why are the eight kinds of mindfulness sequential to the nine characteristics?",
        "source": "T25n1509_021:0218c22_1"
    },
    {
        "source_sentence": "答曰：佛弟子於阿蘭若處，空舍、塚間，山林、曠野，善修九相，內、外不淨觀，厭患其身，而作是念：「我云何擔是底下不淨屎尿囊？」",
        "translation": "Answer: The Buddha's disciple was in an empty monastery, a tomb, a mountain forest, or a wilderness in the forest and wilderness of Araṇya, skillfully cultivating the nine characteristics, observing internally and externally impure things that are disgusting to his body, and he thought, How can I burden this unsullied urine bag of excrement under",
        "source": "T25n1509_021:0218c22_2"
    },
    {
        "source_sentence": "自隨懎然驚怖；",
        "translation": "They followed [the others] in shame and fear, terrified.",
        "source": "T25n1509_021:0218c25_3"
    },
    {
        "source_sentence": "及為惡魔作種種惡事來恐怖之，欲令其退。",
        "translation": "They'll be terrified by bad demons who do various bad things and want to cause them to retreat.",
        "source": "T25n1509_021:0218c26_4"
    },
    {
        "source_sentence": "以是故，佛次第為說八念。",
        "translation": "Because of this, the Buddha explains the eight kinds of mindfulness in order.",
        "source": "T25n1509_021:0218c27_5"
    },
    {
        "source_sentence": "如經中說：「佛告諸比丘：『若於阿蘭若處，空舍、塚間，山林、曠野，在中思惟，若有怖畏，衣毛為竪，爾時當念佛：佛是多陀阿伽度、阿羅呵、三藐三佛陀，乃至婆伽婆。",
        "translation": "As the sūtra says, 'The Buddha told the monks, 'If you were to contemplate in an empty house, a cemetery, a mound, a mountain forest, or a wilderness place in a forest, and if you're afraid that your hair will stand on end, then you should think of the Buddha: The Buddha is the Tathāgata Aghadharma, Arhat, Samyak-saṃbuddha,",
        "source": "T25n1509_021:0218c27_6"
    },
    {
        "source_sentence": "恐怖則滅。",
        "translation": "The fear then ceases.",
        "source": "T25n1509_021:0219a02_7"
    },
    {
        "source_sentence": "若不念佛，當疾念法：佛法清淨，巧出善說，得今世報，指示開發，有智之人心力能解。",
        "translation": "If they aren't mindful of the Buddha, they should quickly think of the teaching: The Buddha's teaching is pure, skillfully producing good explanations that will attain present-world rewards, instructing and developing them, and being able to understand it with the power of a wise person's mind.",
        "source": "T25n1509_021:0219a02_8"
    },
    {
        "source_sentence": "如是念法，怖畏則除。",
        "translation": "Thus, this is the method of mindfulness, which removes fear and fear.",
        "source": "T25n1509_021:0219a04_9"
    },
    {
        "source_sentence": "若不念法，則當念僧：佛弟子眾修正道，隨法行。",
        "translation": "If they aren't mindful of the teaching, then they should be mindful of the saṃgha: the Buddha's disciples cultivate the path and practice according to the teaching.",
        "source": "T25n1509_021:0219a05_10"
    },
    {
        "source_sentence": "僧中有阿羅漢、向阿羅漢，乃至須陀洹、向須陀洹，四雙八輩。",
        "translation": "In the saṃgha, there are arhats and those who are headed toward arhatship, up to stream-winners and those who are heading toward stream-winners, with four pairs and eight groups.",
        "source": "T25n1509_021:0219a06_11"
    },
    {
        "source_sentence": "是佛弟子眾應供養，合手恭敬，禮拜、迎送，世間無上福田。",
        "translation": "These disciples of the Buddha should be offered offerings, joining their palms in reverence and veneration, greeting and welcoming them. This is the highest field of blessedness in the world.",
        "source": "T25n1509_021:0219a07_12"
    },
    {
        "source_sentence": "作如是念僧，恐怖即滅。』",
        "translation": "When you think of the saṃgha in this way, fear will cease.'",
        "source": "T25n1509_021:0219a08_13"
    },
    {
        "source_sentence": "「佛告諸比丘：『釋提桓因與阿修羅鬪，在大陣中時，告諸天眾：汝與阿修羅鬪時，設有恐怖，當念我七寶幢，恐怖即滅；",
        "translation": "“The Buddha said to the bhikṣus: At the time when King Śakra was engaged in battle with the asuras, during the great battlefield, he told the gods and goddesses, “When you are engaged in battle with the asuras, if you have any fear, think of my seven-jeweled banner.",
        "source": "T25n1509_021:0219a10_0"
    },
    {
        "source_sentence": "若不念我幢，當念伊舍那天子(帝釋左面天王也)寶幢，恐怖即除；",
        "translation": "If they don’t think of my banner, they should think of the jeweled banner of the god Indra (also called Indra, the ruler of the gods on the left side of the earth), and their fearlessness will be removed.",
        "source": "T25n1509_021:0219a12_1"
    },
    {
        "source_sentence": "若不念伊舍那寶幢，當念婆樓那天子(右面天子)寶幢，恐怖即除。』」",
        "translation": "If you aren't mindful of the jeweled banner of Īśāna, you should be mindful of the jeweled banner of the god Brahmā (the right-hand celestial son), and your fear will be removed.'",
        "source": "T25n1509_021:0219a14_2"
    },
    {
        "source_sentence": "以是故，知為除恐怖因緣故，次第說八念。",
        "translation": "Because of this, eight forms of mindfulness are spoken of successively:",
        "source": "T25n1509_021:0219a15_3"
    },
    {
        "source_sentence": "問曰：經中說三念因緣除恐怖，五念復云何能除恐怖？",
        "translation": "Q: The sūtras say that three kinds of mindfulness are the causes and conditions for removing fear, but how can five kinds of mindfulness remove fear?",
        "source": "T25n1509_021:0219a16_4"
    },
    {
        "source_sentence": "答曰：是比丘自念布施、持戒功德，怖畏亦除。",
        "translation": "Answer: That monk is mindful of the merits of generosity and observance of precepts for himself, and his fears are also removed.",
        "source": "T25n1509_021:0219a17_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_021:0219a18_6"
    },
    {
        "source_sentence": "若破戒心，畏墮地獄；",
        "translation": "Those who break the precepts are afraid of falling into hell.",
        "source": "T25n1509_021:0219a19_7"
    },
    {
        "source_sentence": "若慳貪心，畏墮餓鬼及貧窮中。",
        "translation": "If they are stingy and greedy, they're afraid of falling into hungry ghosts and the poor.",
        "source": "T25n1509_021:0219a19_8"
    },
    {
        "source_sentence": "自念我有是淨戒、布施，若念淨戒、若念布施，心則歡喜，作是言：「若我命未盡，當更增進功德；",
        "translation": "They think to themselves, “This is my morality and generosity. If they are mindful of my morality and generosity, their hearts will be filled with joy.” They say, “If my life were to run out, I would further increase in virtue.",
        "source": "T25n1509_021:0219a20_9"
    },
    {
        "source_sentence": "若當命終，不畏墮惡道！」",
        "translation": "If you die, you won't fear falling into a bad path!",
        "source": "T25n1509_021:0219a22_10"
    },
    {
        "source_sentence": "以是故，念戒施亦能令怖畏不生。",
        "translation": "Because of this, mindfulness of precepts and giving can also cause fear not to arise.",
        "source": "T25n1509_021:0219a23_0"
    },
    {
        "source_sentence": "念上諸天皆是布施、持戒果報，此諸天以福德因緣故生彼，我亦有是福德。",
        "translation": "The above-mentioned gods are all the results of generosity and observance of precepts, and these gods are born there because of meritorious causes and conditions, and I too have this merit.",
        "source": "T25n1509_021:0219a23_1"
    },
    {
        "source_sentence": "以是故，念天亦能令怖畏不生。",
        "translation": "Because of this, mindfulness of the gods can also cause fear not to arise.",
        "source": "T25n1509_021:0219a25_2"
    },
    {
        "source_sentence": "十六行念安那般那時，細覺尚滅，何況恐怖麁覺！",
        "translation": "When he's mindful of Anupanna in sixteen practices, the subtle awakening still ceases, so why wouldn't he be frightened by the coarse awakening?",
        "source": "T25n1509_021:0219a26_3"
    },
    {
        "source_sentence": "念死者，念五眾身念念生滅，從生已來，常與死俱，今何以畏死？",
        "translation": "When someone is mindful of death, they're mindful of the five bodies that arise and cease in every moment of thought. Since birth, they've always been with death, so why would they fear death now?",
        "source": "T25n1509_021:0219a27_4"
    },
    {
        "source_sentence": "是五念，佛雖不說，亦當除恐怖。",
        "translation": "Although these five kinds of mindfulness aren't explained by the Buddha, they will also remove fear.",
        "source": "T25n1509_021:0219a28_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_021:0219a29_6"
    },
    {
        "source_sentence": "念他功德以除恐怖則難，自念己事以除恐怖則易，以是故佛不說。",
        "translation": "Being mindful of the merits of others makes it difficult to remove fear, and being mindful of one's own actions makes it easy to remove fear; therefore, the Buddha doesn't explain it.",
        "source": "T25n1509_021:0219a29_7"
    },
    {
        "source_sentence": "問曰：云何是念佛？",
        "translation": "Q: What's mindfulness of the Buddha?",
        "source": "T25n1509_021:0219b02_8"
    },
    {
        "source_sentence": "答曰：行者一心念佛：得如實智慧，大慈大悲成就，是故言無錯謬，麁細、多少、深淺，皆無不實。",
        "translation": "Answer: Practitioners are mindful of the Buddha with one mind: They attain true wisdom and great kindness and compassion, so they say there's no mistake, whether gross or subtle, large or small, deep or shallow, which are not unreal.",
        "source": "T25n1509_021:0219b03_0"
    },
    {
        "source_sentence": "皆是實故，名為「多陀阿伽度」。",
        "translation": "Because they are all real, they're called the Tathāgata-pāramitā.",
        "source": "T25n1509_021:0219b05_1"
    },
    {
        "source_sentence": "亦如過去、未來、現在十方諸佛於眾生中起大悲心，行六波羅蜜，得諸法相，來至阿耨多羅三藐三菩提中；",
        "translation": "“Furthermore, just as in the past, future, and present buddhas of the ten directions give rise to great compassion toward sentient beings and practice the six transcendent ways. They attain the characteristics of all things and come to unexcelled complete perfect enlightenment.",
        "source": "T25n1509_021:0219b05_2"
    },
    {
        "source_sentence": "此佛亦如是。",
        "translation": "So it is with this Buddha.",
        "source": "T25n1509_021:0219b08_3"
    },
    {
        "source_sentence": "是名「多陀阿伽度」。",
        "translation": "This is called the Tathāgata-pāramitā.",
        "source": "T25n1509_021:0219b08_4"
    },
    {
        "source_sentence": "如三世十方諸佛身放大光明，遍照十方，破諸黑闇；",
        "translation": "“Furthermore, just as the buddhas of past, present, and future emanate great rays of light from their bodies in all ten directions, illumining the ten directions to dispel darkness.",
        "source": "T25n1509_021:0219b09_5"
    },
    {
        "source_sentence": "心出智慧光明，破眾生無明闇冥；",
        "translation": "The light of knowledge emanated from their minds, destroying the darkness of ignorance of sentient beings.",
        "source": "T25n1509_021:0219b10_6"
    },
    {
        "source_sentence": "功德、名聞亦遍滿十方，去至涅槃中。",
        "translation": "Their merits and fame also pervade the ten directions, going to nirvāṇa.",
        "source": "T25n1509_021:0219b11_7"
    },
    {
        "source_sentence": "此佛亦如是去，以是故亦名「多陀阿伽度」。",
        "translation": "This Buddha also thus departed, which is why it's also called the Tathāgatagarbha.",
        "source": "T25n1509_021:0219b12_0"
    },
    {
        "source_sentence": "有如是功德故，應受一切諸天、世人最上供養，是故名「阿羅呵」。",
        "translation": "Because of such merit, they should receive the highest offerings from all gods and people in the world, which is why they're called arhats.",
        "source": "T25n1509_021:0219b13_0"
    },
    {
        "source_sentence": "若有人言：何以故但佛如實說，如來如去故，應受最上供養？",
        "translation": "Suppose someone says, Why is it that the Buddha only explains them as they really are, and because the Tathāgata is like a departure, he should receive the highest offering?",
        "source": "T25n1509_021:0219b14_1"
    },
    {
        "source_sentence": "以佛得「正遍智慧」故。",
        "translation": "It's because the Buddha has attained right and pervasive wisdom.",
        "source": "T25n1509_021:0219b15_2"
    },
    {
        "source_sentence": "「正」名諸法不動不壞相，「遍」名不為一法、二法故，以悉知一切法無餘不盡，是名「三藐三佛陀」。",
        "translation": "Correct is the name for the immovable and indestructible characteristics of all dharmas, pervasive is the name for not being one or two dharmas, because it fully knows all dharmas without remainder and doesn't exhaust them, which is called samyak-saṃbuddha.",
        "source": "T25n1509_021:0219b16_3"
    },
    {
        "source_sentence": "是正遍智慧，不從無因而得，亦不從無緣得；",
        "translation": "This pervasive wisdom is not attained from non-causation, and neither is it attained from non-causation.",
        "source": "T25n1509_021:0219b18_4"
    },
    {
        "source_sentence": "是中依智慧、持戒具足故，得正遍智慧。",
        "translation": "Because they rely on wisdom and are fully endowed with observance of precepts, they attain right and pervasive wisdom.",
        "source": "T25n1509_021:0219b19_5"
    },
    {
        "source_sentence": "智慧名菩薩從初發意乃至金剛三昧相應智慧，持戒名菩薩從初發意乃至金剛三昧身業、口業清淨隨意行已，是故名「鞞闍遮羅那三般那」。",
        "translation": "Wisdom is called wisdom associated with wisdom that's associated with wisdom from the first arousal of mind up to the vajra samādhi, and maintaining precepts are called a bodhisattva who follows the purity of bodily actions and verbal actions as he wishes after following them from the first arousal of mind up to the vajra samādhi, which is why it's called Vajracana-saṃpanna",
        "source": "T25n1509_021:0219b20_6"
    },
    {
        "source_sentence": "若行是二行得善去，如車有兩輪。",
        "translation": "If he practices these two practices, he'll be able to skillfully remove them, like a chariot with two wheels.",
        "source": "T25n1509_021:0219b24_0"
    },
    {
        "source_sentence": "善去者，如先佛所去處，佛亦如是去，故名「修伽陀」。",
        "translation": "Good departure is called sugata because it's like the place where the previous Buddha departed and the Buddha also departed in this way, so he's called sugata.",
        "source": "T25n1509_021:0219b24_1"
    },
    {
        "source_sentence": "若有言：「佛自修其法，不知我等事。」",
        "translation": "Suppose someone says, The Buddha cultivates his own teaching and doesn't know our works.",
        "source": "T25n1509_021:0219b26_2"
    },
    {
        "source_sentence": "以是故知世間，知世間因，知世間盡，知世間盡道故，名為「路迦憊」。",
        "translation": "Because he knows the world, knows the causes of the world, knows the end of the world, and knows the path to the end of the world, he's called a lokṣa.",
        "source": "T25n1509_021:0219b26_3"
    },
    {
        "source_sentence": "知世間已，調御眾生，於種種師中最為無上，以是故名「阿耨多羅富樓沙曇藐婆羅提」。",
        "translation": "Knowing the world, he tames sentient beings and is the most unsurpassed among all kinds of teachers, which is why it's called anuttara-puṣadharma-pāramitā.",
        "source": "T25n1509_021:0219b28_4"
    },
    {
        "source_sentence": "能以三種道滅三毒，令眾生行三乘道，以是故名「貰多提婆魔[少\\/兔]舍」。",
        "translation": "He's able to use three kinds of paths to extinguish the three poisons and cause sentient beings to practice the three-vehicle path, which is why he's called Kārttikadeva Māra [less\\/rabbit] She.",
        "source": "T25n1509_021:0219c01_5"
    },
    {
        "source_sentence": "若有言：「以何事故能自利益無量？",
        "translation": "Suppose someone says, What's the thing that can self-benefit immeasurable?",
        "source": "T25n1509_021:0219c03_6"
    },
    {
        "source_sentence": "復能利益他人無量？」",
        "translation": "How could they benefit others without measure?",
        "source": "T25n1509_021:0219c03_7"
    },
    {
        "source_sentence": "佛一切智慧成就故，過去、未來、現在，盡不盡，動不動，一切世間了了悉知故，名為「佛陀」。",
        "translation": "Because all the Buddha's wisdom has been accomplished, it's called a buddha because past, future, and present are not exhausted, move and don't move, and all the worlds understand and fully know them.",
        "source": "T25n1509_021:0219c04_8"
    },
    {
        "source_sentence": "得是九種名號，有大名稱，遍滿十方，以是故名為「婆伽婆」。",
        "translation": "They attain these nine kinds of names that have great reputation and pervade the ten directions, which is why they're called bhagavān.",
        "source": "T25n1509_021:0219c06_9"
    },
    {
        "source_sentence": "經中佛自說如是名號，應當作是念佛。",
        "translation": "In the sūtras, the Buddha himself says such a name, and you should make this kind of mindfulness of the Buddha.",
        "source": "T25n1509_021:0219c07_10"
    },
    {
        "source_sentence": "復次，一切種種功德，盡在於佛。",
        "translation": "Furthermore, all kinds of various virtues are found in buddhas.",
        "source": "T25n1509_021:0219c08_11"
    },
    {
        "source_sentence": "佛是劫初轉輪聖王摩訶三磨陀等種，閻浮提中智慧威德，諸釋子中生，貴性憍曇氏。",
        "translation": "At the beginning of the eon, the Buddha was a universal sage king named Mahāsamddhoṣa and so forth. He was born among the sons of the Śākyas in Jambudvīpa with wisdom and mighty virtue. His noble nature was that of a khaṭṭṭam family.",
        "source": "T25n1509_021:0219c09_12"
    },
    {
        "source_sentence": "生時光明遍照三千大千世界，梵天王持寶蓋、釋提桓因以天寶衣承接，阿那婆蹋多龍王、婆伽多龍王以妙香湯澡浴。",
        "translation": "When he's born, his light pervades 3,000 great one-thousand worlds, where Brahmā takes the jeweled canopy and Śakra receives it with a heavenly jeweled robe, and Anavatapta and Bhagavān are bathed in wonderfully fragrant bathing water.",
        "source": "T25n1509_021:0219c11_13"
    },
    {
        "source_sentence": "生時地六種動，行至七步，安詳如象王，觀視四方，作師子吼：「我是末後身，當度一切眾生！」",
        "translation": "When he's born, the earth moves in six ways, goes seven steps, is as peaceful as an elephant king, looks around in all directions, and makes a lion's roar, saying, 'This is my final body that will save all sentient beings!'",
        "source": "T25n1509_021:0219c14_14"
    },
    {
        "source_sentence": "阿私陀仙人相之，告淨飯王：「是人足下千輻輪相，指合縵網，當自於法中安平立，無能動、無能壞者。",
        "translation": "The sage Asita looked at him and said to King Śuddhodana, This man has a thousand-spoked wheel beneath his feet with his fingers joined together in a webbed mesh, so that he can stand upright within the Dharma without moving or breaking it.",
        "source": "T25n1509_021:0219c16_15"
    },
    {
        "source_sentence": "手中德字，縵網莊嚴，當以此手安慰眾生，令無所畏。",
        "translation": "In his hand, he holds the word virtue, adorned with webbing, to comfort sentient beings with this hand so they won't fear it.",
        "source": "T25n1509_021:0219c18_16"
    },
    {
        "source_sentence": "如是乃至肉骨髻相，如青珠山頂，青色光明從四邊出。",
        "translation": "It's like the topknot of flesh and bones, like the topknot of a mountain of blue pearls, with blue-colored light coming out from the four sides.",
        "source": "T25n1509_021:0219c20_0"
    },
    {
        "source_sentence": "頭中頂相無能見上，若天、若人無有勝者。",
        "translation": "The top of his head has no marks that can be seen above, and there's nothing superior for gods or humans.",
        "source": "T25n1509_021:0219c21_1"
    },
    {
        "source_sentence": "白毫眉間跱，白光踰頗梨。",
        "translation": "The white hair between his eyebrows was white and the white light extended more than a thousand li.",
        "source": "T25n1509_021:0219c22_2"
    },
    {
        "source_sentence": "淨眼長廣，其色紺青。",
        "translation": "The pure eye is long and wide in length, blue and blue in color.",
        "source": "T25n1509_021:0219c22_3"
    },
    {
        "source_sentence": "鼻高直好，甚可愛樂。",
        "translation": "The nose was high and straight, very pleasing.",
        "source": "T25n1509_021:0219c23_4"
    },
    {
        "source_sentence": "口四十齒，白淨利好。",
        "translation": "His mouth has forty teeth that are white, pure, and sharp.",
        "source": "T25n1509_021:0219c23_5"
    },
    {
        "source_sentence": "四牙上白，其光最勝。",
        "translation": "The four teeth are white on top of each other, and their light is the most brilliant.",
        "source": "T25n1509_021:0219c24_6"
    },
    {
        "source_sentence": "脣上下等，不大不小，不長不短。",
        "translation": "The upper and lower parts of the hair are neither large nor small, neither long nor short.",
        "source": "T25n1509_021:0219c24_7"
    },
    {
        "source_sentence": "舌薄而大，軟赤紅色，如天蓮華。",
        "translation": "Their tongues are slender but large, soft red and pink like heavenly lotus flowers.",
        "source": "T25n1509_021:0219c25_8"
    },
    {
        "source_sentence": "梵聲深遠，聞者悅樂，聽無厭足。",
        "translation": "The sound of the holy Dharma is profound and far-reaching. All who hear it are delighted, and they never tire of listening to it.",
        "source": "T25n1509_021:0219c26_9"
    },
    {
        "source_sentence": "身色好妙，勝閻浮檀金。",
        "translation": "The color of his body was superior to that of Jambudvīpa’s gold.",
        "source": "T25n1509_021:0219c26_10"
    },
    {
        "source_sentence": "大光周身，種種雜色，妙好無比。",
        "translation": "A great ray of light pervaded his body in various colors, incomparably beautiful.",
        "source": "T25n1509_021:0219c27_11"
    },
    {
        "source_sentence": "如是等三十二相具足，是人不久出家，得一切智成佛。」",
        "translation": "Such are the thirty-two characteristics that are complete, and this person will soon leave home and attain omniscience and become a buddha.",
        "source": "T25n1509_021:0219c28_12"
    },
    {
        "source_sentence": "佛身功德如是，應當念佛。",
        "translation": "The merit of the Buddha's body is thus, so you should remember the Buddha.",
        "source": "T25n1509_021:0219c29_13"
    },
    {
        "source_sentence": "復次，佛身功德，身力勝於十萬白香象寶，是為父母遺體力；",
        "translation": "“Furthermore, the virtue of the Buddha’s body was that it surpassed one hundred thousand white fragrant elephants and jewels in terms of physical strength. This was the empowerment left by his parents.",
        "source": "T25n1509_021:0220a01_14"
    },
    {
        "source_sentence": "若神通功德力，無量無限。",
        "translation": "The power of his supernormal abilities and virtues are immeasurable and limitless.",
        "source": "T25n1509_021:0220a02_15"
    },
    {
        "source_sentence": "佛身以三十二相、八十隨形好莊嚴，內有無量佛法功德故，視之無厭。",
        "translation": "The Buddha's body is beautifully adorned with the thirty-two marks and eighty-eight secondary forms, and inside it there are measureless merits of the Buddha's teachings, so they don't tire of looking at them.",
        "source": "T25n1509_021:0220a03_16"
    },
    {
        "source_sentence": "見佛身者，忘世五欲，萬事不憶；",
        "translation": "Those who saw the buddha-body forgot the five worldly desires, forgetting all things.",
        "source": "T25n1509_021:0220a04_17"
    },
    {
        "source_sentence": "若見佛身一處，愛樂無厭，不能移觀。",
        "translation": "If he sees the Buddha's body in one place, he loves it and doesn't tire of it, so he can't move or look around.",
        "source": "T25n1509_021:0220a05_18"
    },
    {
        "source_sentence": "佛身功德如是，應當念佛。",
        "translation": "The merit of the Buddha's body is thus, so you should remember the Buddha.",
        "source": "T25n1509_021:0220a06_19"
    },
    {
        "source_sentence": "復次，佛持戒具足清淨，從初發心修戒，增積無量，與憐愍心俱，不求果報，不向聲聞、辟支佛道，不雜諸結使，但為自心清淨、不惱眾生故，世世持戒。",
        "translation": "Furthermore, the Buddha observes the precepts with complete purity because he cultivates them from the first arousal of mind in order to increase immeasurably. He is imbued with compassion and doesn’t seek reward or reward; he doesn’t aspire to the path of śrāvakas or pratyekabuddhas; he isn’t mixed up with the bonds that bind sentient beings",
        "source": "T25n1509_021:0220a08_0"
    },
    {
        "source_sentence": "以是故，得佛道時，戒得具足。",
        "translation": "Because of this, when they attain the Buddha Way, the precepts are fulfilled.",
        "source": "T25n1509_021:0220a11_1"
    },
    {
        "source_sentence": "應如是念佛戒眾。",
        "translation": "They should thus be mindful of the Buddha's precepts for all sentient beings.",
        "source": "T25n1509_021:0220a12_2"
    },
    {
        "source_sentence": "復次，佛定眾具足。",
        "translation": "Furthermore, the Buddha's concentration is complete in many ways.",
        "source": "T25n1509_021:0220a12_3"
    },
    {
        "source_sentence": "問曰：持戒，以身、口業清淨故可知；",
        "translation": "Q: observance of precepts can be known because bodily and verbal action are pure.",
        "source": "T25n1509_021:0220a13_4"
    },
    {
        "source_sentence": "智慧，以分別說法能除眾生疑故可知；",
        "translation": "“Great enlightening beings’ knowledge and wisdom are knowable because they explain the truth discriminatingly, thereby removing the doubts of sentient beings.",
        "source": "T25n1509_021:0220a13_5"
    },
    {
        "source_sentence": "定者，餘人修定尚不可知，何況於佛，云何得知？",
        "translation": "Concentration means that the cultivation of concentration by others is still unknowable, so why wouldn't they know it when they cultivate it, let alone Buddha? How would they know it?",
        "source": "T25n1509_021:0220a14_6"
    },
    {
        "source_sentence": "答曰：大智慧具足故，當知禪定必具足。",
        "translation": "Answer: Because great wisdom is complete, you should know that meditation must be complete.",
        "source": "T25n1509_021:0220a15_7"
    },
    {
        "source_sentence": "譬如見蓮華大，必知池亦深大；",
        "translation": "It is like seeing lotus blossoms grow larger and knowing that the pond also grows deeper.",
        "source": "T25n1509_021:0220a16_8"
    },
    {
        "source_sentence": "又如燈明大者，必知蘇油亦多。",
        "translation": "Also, just as a great lamp is large, you must know that there's plenty of soap and oil.",
        "source": "T25n1509_021:0220a17_9"
    },
    {
        "source_sentence": "亦以佛神通變化力無量無比故，知禪定力亦具足；",
        "translation": "Also, because of the infinity and incomparability of the magical powers of buddhas’ spiritual powers, they know that the power of meditation is also complete.",
        "source": "T25n1509_021:0220a18_10"
    },
    {
        "source_sentence": "亦如見果大故，知因亦必大。",
        "translation": "Also, because the fruit of views is great, the cause of knowing must also be great.",
        "source": "T25n1509_021:0220a19_11"
    },
    {
        "source_sentence": "復次，有時佛自為人說：「我禪定相甚深。」",
        "translation": "Furthermore, there are times when the Buddha himself says to someone, The characteristics of my meditation are profound.",
        "source": "T25n1509_021:0220a20_12"
    },
    {
        "source_sentence": "如經中說：「佛在阿頭摩國林樹下坐，入禪定。",
        "translation": "As the sūtra explains, The Buddha was sitting under a tree in the forest in the country of Asuma and entering meditation.",
        "source": "T25n1509_021:0220a21_13"
    },
    {
        "source_sentence": "是時大雨雷電霹靂，有四特牛、耕者二人，聞聲怖死。",
        "translation": "At the time, there was a great deal of rain, thunder, lightning, and thunder, and four special cattle and two farmers heard the sound and died in fear.",
        "source": "T25n1509_021:0220a22_14"
    },
    {
        "source_sentence": "須臾便晴，佛起經行。",
        "translation": "In a moment it became clear, and the Buddha began his meditation.",
        "source": "T25n1509_021:0220a23_15"
    },
    {
        "source_sentence": "有一居士禮佛足已，隨從佛後，白佛言：『世尊！",
        "translation": "There was a householder who bowed at the Buddha's feet, followed him behind them, and said to him, 'Bhagavān!",
        "source": "T25n1509_021:0220a23_16"
    },
    {
        "source_sentence": "向者雷電霹靂，有四特牛、耕者二人，聞聲怖死，世尊聞不？』",
        "translation": "In the past, there were four special cattle and two farmers who heard the sound of thunder and lightning and thunder, and did the Bhagavān hear it?'",
        "source": "T25n1509_021:0220a25_17"
    },
    {
        "source_sentence": "佛言：『不聞！』",
        "translation": "The Buddha said, 'I won't hear it!'",
        "source": "T25n1509_021:0220a26_18"
    },
    {
        "source_sentence": "居士言：『佛時睡耶？』",
        "translation": "The householder said, 'Did you sleep at the Buddha's time?'",
        "source": "T25n1509_021:0220a26_19"
    },
    {
        "source_sentence": "佛言：『不睡！』",
        "translation": "The Buddha said, 'Don't sleep!'",
        "source": "T25n1509_021:0220a27_20"
    },
    {
        "source_sentence": "問曰：『入無心想定耶？』",
        "translation": "He asked, 'Has he entered the concentration without mind?'",
        "source": "T25n1509_021:0220a27_21"
    },
    {
        "source_sentence": "佛言：『不也！",
        "translation": "The Buddha said, 'No!",
        "source": "T25n1509_021:0220a27_22"
    },
    {
        "source_sentence": "我有心想，但入定耳。』",
        "translation": "I have thoughts of mind, but I'm only entering concentration.'",
        "source": "T25n1509_021:0220a28_23"
    },
    {
        "source_sentence": "居士言：『未曾有也！",
        "translation": "The householder said, 'How extraordinary!'",
        "source": "T25n1509_021:0220a28_24"
    },
    {
        "source_sentence": "諸佛禪定大為甚深，有心想在禪定，如是大聲覺而不聞。』」",
        "translation": "The greatness of the buddhas' meditation is profound, and there are mental perceptions in meditation that aren't heard by a great vocal awakening like this.'",
        "source": "T25n1509_021:0220a29_25"
    },
    {
        "source_sentence": "如餘經中，佛告諸比丘：「佛入出諸定，舍利弗、目揵連尚不聞其名，何況能知！」",
        "translation": "As in other sūtras, the Buddha told the monks, When the Buddha entered and exited the concentrations, Śāriputra and Maudgalyāyana still didn't hear his name, so how could they know it?",
        "source": "T25n1509_021:0220b01_26"
    },
    {
        "source_sentence": "何者是？",
        "translation": "What is it?",
        "source": "T25n1509_021:0220b03_27"
    },
    {
        "source_sentence": "如三昧王三昧、師子遊戲三昧等，佛入其中，能令十方世界六種震動，放大光明，化為無量諸佛，遍滿十方。",
        "translation": "Like the samādhi king samādhi and lion's play samādhi, the Buddha enters them, causes the worlds in the ten directions to shake in six ways, emanates great light, transforms into measureless buddhas, and pervades the ten directions.",
        "source": "T25n1509_021:0220b03_28"
    },
    {
        "source_sentence": "如阿難一時心生念：「過去然燈佛時，時世好，人壽長，易化度；",
        "translation": "“O Ānanda, one time the thought occurred to him in his mind: In the past, at the time of the Buddha Sadāparvatasara buddha, the world was good and the human life span was long.",
        "source": "T25n1509_021:0220b05_29"
    },
    {
        "source_sentence": "今釋迦牟尼佛時世惡，人壽短，難教化；",
        "translation": "Now the time of Śākyamuni Buddha is bad in the world, with a short human life span and difficult to edify.",
        "source": "T25n1509_021:0220b07_30"
    },
    {
        "source_sentence": "佛事未訖而入涅槃耶？」",
        "translation": "Does the Buddha enter nirvāṇa before he finishes his work?",
        "source": "T25n1509_021:0220b08_31"
    },
    {
        "source_sentence": "清旦以是事白佛已，日出。",
        "translation": "After he had told the Buddha about these matters at sunrise, the sun rose.",
        "source": "T25n1509_021:0220b08_32"
    },
    {
        "source_sentence": "佛時入日出三昧，如日出光明照閻浮提；",
        "translation": "The Buddha entered the samādhi of sunrise at that time, just as the light of the sun illumines Jambudvfpa.",
        "source": "T25n1509_021:0220b09_33"
    },
    {
        "source_sentence": "佛身如是，毛孔普出光明，遍照十方恒河沙等世界。",
        "translation": "The Buddha's body is like this, and his pores universally emit light that illuminates worlds as numerous as the sands of the Ganges in the ten directions.",
        "source": "T25n1509_021:0220b10_34"
    },
    {
        "source_sentence": "一一光中出七寶千葉蓮華，一一華上皆有坐佛，一一諸佛皆放無量光明。",
        "translation": "Each ray of light produced a thousand-petaled lotus flower of the seven treasures, and on each flower there was a seated Buddha, and each buddha radiated an infinite ray of light.",
        "source": "T25n1509_021:0220b11_35"
    },
    {
        "source_sentence": "一一光中皆出七寶千葉蓮華，一一華上皆有坐佛，是諸佛等遍滿十方恒河沙等世界，教化眾生：或有說法；",
        "translation": "In each ray of light a thousand-petaled lotus blossom of the seven kinds of jewels emerged, and on each blossom there was a seated buddha. These buddhas pervaded as many worlds in the ten directions as there are grains of sand in the Ganges River, teaching sentient beings:",
        "source": "T25n1509_021:0220b13_36"
    },
    {
        "source_sentence": "或有默然；",
        "translation": "Some are silent.",
        "source": "T25n1509_021:0220b15_37"
    },
    {
        "source_sentence": "或以經行；",
        "translation": "Or they may do so by means of scriptures and examples.",
        "source": "T25n1509_021:0220b16_38"
    },
    {
        "source_sentence": "或神通變化，身出水、火。",
        "translation": "Or they may show miraculous transformations, producing water and fire in their bodies.",
        "source": "T25n1509_021:0220b16_39"
    },
    {
        "source_sentence": "如是等種種方便，度脫十方五道眾生。",
        "translation": "Such various methods are used to liberate the sentient beings of the five destinies in the ten directions.",
        "source": "T25n1509_021:0220b16_40"
    },
    {
        "source_sentence": "阿難承佛威神，悉見是事。",
        "translation": "Ānanda, imbued with the Buddha’s authoritative power, saw all these events.",
        "source": "T25n1509_021:0220b17_41"
    },
    {
        "source_sentence": "佛攝神足，從三昧起，告阿難：「見是事不？",
        "translation": "The Buddha gathered his spiritual feet, rose from concentration, and said to Ānanda, Do you see this?",
        "source": "T25n1509_021:0220b18_42"
    },
    {
        "source_sentence": "聞是事不？」",
        "translation": "Do you hear this thing?",
        "source": "T25n1509_021:0220b19_43"
    },
    {
        "source_sentence": "阿難言：「蒙佛威神，已見、已聞！」",
        "translation": "Ānanda said, Endowed with the Buddha's authoritative power, I've seen and heard!",
        "source": "T25n1509_021:0220b19_44"
    },
    {
        "source_sentence": "佛言：「佛有如是力，能究竟佛事不？」",
        "translation": "The Buddha said, Does the Buddha have such power that he can accomplish the Buddha's work?",
        "source": "T25n1509_021:0220b20_45"
    },
    {
        "source_sentence": "阿難言：「世尊！",
        "translation": "Ānanda said, Bhagavān!",
        "source": "T25n1509_021:0220b21_46"
    },
    {
        "source_sentence": "若眾生滿十方恒河沙等世界中，佛壽一日，用如是力，必能究竟施作佛事。」",
        "translation": "If sentient beings fill the worlds of the Ganges River and so forth in the ten directions, the Buddha's life span is one day, and with such power, they'll surely be able to ultimately perform buddha-works.",
        "source": "T25n1509_021:0220b21_47"
    },
    {
        "source_sentence": "阿難歎言：「未曾有也！",
        "translation": "Ānanda praised him, saying, Never before!",
        "source": "T25n1509_021:0220b23_48"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_021:0220b23_49"
    },
    {
        "source_sentence": "諸佛法無量不可思議！」",
        "translation": "The buddha-dharmas are immeasurable and inconceivable!",
        "source": "T25n1509_021:0220b24_50"
    },
    {
        "source_sentence": "以是故知佛禪定具足。",
        "translation": "Because of this, he knows that the Buddha's meditation is complete.",
        "source": "T25n1509_021:0220b24_51"
    },
    {
        "source_sentence": "復次，佛慧眾具足。",
        "translation": "Furthermore, the Buddha's wisdom is complete in many ways.",
        "source": "T25n1509_021:0220b25_52"
    },
    {
        "source_sentence": "從初發心，於阿僧祇劫中，無法不行，世世集諸功德，一心專精，不惜身命以求智慧，如薩陀波崙菩薩。",
        "translation": "From the first arousal of the aspiration for enlightenment, there's nothing that isn't practiced during an incalculably long eon, accumulates merits from generation to generation, concentrates his mind with concentration, and doesn't spare his life to pursue wisdom, just like Sadāprarudita Bodhisattva.",
        "source": "T25n1509_021:0220b25_53"
    },
    {
        "source_sentence": "復次，以善修大悲智慧故，具足慧眾；",
        "translation": "“Furthermore, because they skillfully practice great compassion and wisdom, they are endowed with a host of knowledge.",
        "source": "T25n1509_021:0220b28_0"
    },
    {
        "source_sentence": "餘人無是大悲，雖有智慧，不得具足。",
        "translation": "Other people lack this kind of great compassion, and even though they have wisdom, they can't be fully endowed with it.",
        "source": "T25n1509_021:0220b28_1"
    },
    {
        "source_sentence": "大悲欲度眾生，求種種智慧故，及斷法愛，滅六十二邪見，不墮二邊：若受五欲樂，若修身苦道；",
        "translation": "With great compassion they want to save sentient beings, seeking various knowledge and wisdom; abandoning craving for the doctrine and annihilating the sixty-two wrong views, they do not fall into two extremes: those who experience the five pleasures of sensual desire and those who are in the path of physical suffering.",
        "source": "T25n1509_021:0220b29_2"
    },
    {
        "source_sentence": "若斷滅，若計常；",
        "translation": "Whether it is annihilated or calculated to be eternal.",
        "source": "T25n1509_021:0220c03_3"
    },
    {
        "source_sentence": "若有、若無等，如是諸法邊。",
        "translation": "Whether it exists or doesn't, such are the limits of all dharmas.",
        "source": "T25n1509_021:0220c03_4"
    },
    {
        "source_sentence": "復次，佛慧無上，徹鑒無比，從甚深禪定中生故；",
        "translation": "“Furthermore, the Buddha’s wisdom is unsurpassed, incomparable in penetration and insight, being born of profound meditation.",
        "source": "T25n1509_021:0220c04_0"
    },
    {
        "source_sentence": "諸麁細煩惱所不能動故；",
        "translation": "It is unable to be disturbed by gross and subtle defilements.",
        "source": "T25n1509_021:0220c05_1"
    },
    {
        "source_sentence": "善修三十七品、四禪、四無量心、四無色定、八背捨、九次第定等諸功德故；",
        "translation": "They skillfully cultivate the virtues of the thirty-seven classes, the four meditations, the four immeasurable states of mind, the four formless concentrations, the eight liberations, and the nine graduated concentrations.",
        "source": "T25n1509_021:0220c05_2"
    },
    {
        "source_sentence": "有十力、四無所畏、四無礙智、十八不共法，得無礙不可思議解脫故——佛慧眾具足。",
        "translation": "Because there are the ten powers, four fearlessnesses, four unhindered knowledges, and 18 unique qualities that attain unobstructed inconceivable liberation-the Buddha's wisdom is complete.",
        "source": "T25n1509_021:0220c07_3"
    },
    {
        "source_sentence": "復次，能降伏外道大論議師，所謂憂樓頻蠡迦葉、摩訶迦葉、舍利弗、目揵連、薩遮尼揵子、婆蹉首羅、長爪等大論議師輩皆降伏，是故知佛慧眾具足。",
        "translation": "Furthermore, he's able to subdue the great debating teachers of non-Buddhist theories, which are called the great debating teachers Uparinirmita-kāśyapa, Mahākāśyapa, Śāriputra, Maudgalyāyana, Sakyaniputra, Vasiṣṭhila, and Jñānaprasthāna, and so forth, and therefore knows that the Buddha's wisdom is complete",
        "source": "T25n1509_021:0220c09_4"
    },
    {
        "source_sentence": "復次，佛三藏、十二部經、八萬四千法聚，見是語言多故，知智慧亦大。",
        "translation": "Furthermore, the Buddha's Tripiṭaka, 12 scriptures, 84,000 dharmas, and 84,000 teachings are seen to have many words, so they know that wisdom is also great.",
        "source": "T25n1509_021:0220c12_5"
    },
    {
        "source_sentence": "譬如一居士清朝見大雨處，語眾人言：「昨夜雨龍，其力甚大！」",
        "translation": "It's like a householder who sees a place where there's a great rain in the morning and says to the crowd, Yesterday night, it rained dragons, whose power is so great!",
        "source": "T25n1509_021:0220c14_6"
    },
    {
        "source_sentence": "眾人言：「汝何以知之？」",
        "translation": "The people said, How do you know it?",
        "source": "T25n1509_021:0220c15_7"
    },
    {
        "source_sentence": "答言：「我見地濕、泥多，山崩、樹折，殺諸鳥獸，以此故知龍力為大。」",
        "translation": "He replied, I've seen so much moisture and mud on the ground that a mountain collapses and a tree breaks down and kills birds and animals; therefore, I know that the dragon's power is great.",
        "source": "T25n1509_021:0220c16_8"
    },
    {
        "source_sentence": "佛亦如是，甚深智慧，雖非眼見，雨大法雨，諸大論議師及釋梵天王皆以降伏，以是可知佛智慧多。",
        "translation": "The Buddha is also like this. Although he does not see with his own eyes, he has profound wisdom that rains down the great dharma rain and all the great śāstra masters and brahma kings of the Śakra Devānām-Indra gods are subdued after him. Because of this we may know that the Buddha has a great deal of wisdom.",
        "source": "T25n1509_021:0220c17_9"
    },
    {
        "source_sentence": "復次，諸佛得無礙解脫故，於一切法中智慧無礙。",
        "translation": "Furthermore, because the buddhas attain unobstructed liberation, their wisdom in all dharmas is unimpeded.",
        "source": "T25n1509_021:0220c19_10"
    },
    {
        "source_sentence": "復次，佛此智慧皆清淨，出諸觀上；",
        "translation": "“Furthermore, these knowledges and insights of buddhas are all pure, emanating from the spheres of contemplation.",
        "source": "T25n1509_021:0220c21_11"
    },
    {
        "source_sentence": "不觀諸法常相、無常相，有邊相、無邊相，有去相、無去相，有相、無相，有漏相、無漏相，有為相、無為相，生滅相、不生滅相，空相、不空相；",
        "translation": "They do not contemplate the characteristics of all things as permanent or impermanent, their characteristics as finite or infinite, their characteristics as departing or non-departing, their characteristics as existent or nonexistent, their characteristics as impure or pure, their characteristics as conditioned or unconditioned, their characteristics as arising and ceasing and not arising and ceasing,",
        "source": "T25n1509_021:0220c21_12"
    },
    {
        "source_sentence": "常清淨無量如虛空，以是故無礙。",
        "translation": "They are always pure and immeasurable like space, which is why they're unobstructed.",
        "source": "T25n1509_021:0220c24_13"
    },
    {
        "source_sentence": "若觀生滅者，不得觀不生滅；",
        "translation": "If someone observes arising and ceasing, they cannot observe neither arising nor ceasing.",
        "source": "T25n1509_021:0220c25_14"
    },
    {
        "source_sentence": "觀不生滅者，不得觀生滅。",
        "translation": "Those who contemplate neither arising nor ceasing won't be allowed to contemplate arising and ceasing.",
        "source": "T25n1509_021:0220c26_15"
    },
    {
        "source_sentence": "若不生滅實，生滅不實；",
        "translation": "If neither arising nor ceasing is real, the arising and ceasing are insubstantial.",
        "source": "T25n1509_021:0220c26_16"
    },
    {
        "source_sentence": "若生滅實，不生滅不實。",
        "translation": "If arising and ceasing are real, then neither arising nor ceasing is unreal.",
        "source": "T25n1509_021:0220c27_17"
    },
    {
        "source_sentence": "如是等諸觀皆爾，得無礙智故，知佛慧眾具足。",
        "translation": "Such contemplations are all like this, because they attain unobstructed knowledge and know that the Buddha's wisdom is complete.",
        "source": "T25n1509_021:0220c27_18"
    },
    {
        "source_sentence": "復次，念佛解脫眾具足。",
        "translation": "Furthermore, mindfulness of the Buddha's liberation is complete in many ways.",
        "source": "T25n1509_021:0220c29_0"
    },
    {
        "source_sentence": "佛解脫諸煩惱及習，根本拔故，解脫真不可壞，一切智慧成就故，名為無礙解脫。",
        "translation": "The Buddha's liberation from the afflictions and accumulations, which are fundamentally removed, is called unobstructed liberation because its liberation is truly indestructible and because all wisdom is accomplished.",
        "source": "T25n1509_021:0220c29_1"
    },
    {
        "source_sentence": "成就八解脫，甚深遍得故，名為具足解脫。",
        "translation": "Accomplishing the eight liberations is called perfect liberation because it's profound and pervasively attained.",
        "source": "T25n1509_021:0221a02_2"
    },
    {
        "source_sentence": "復次，離「時解脫」及「慧解脫」故，便具足成就「共解脫」。",
        "translation": "Furthermore, because it's free of the timely liberation and the wisdom liberation, it's possible to fully accomplish the shared liberation.",
        "source": "T25n1509_021:0221a03_3"
    },
    {
        "source_sentence": "成就如是等解脫故，名具足解脫眾。",
        "translation": "Because they accomplish such liberation, they're called the full group of liberation.",
        "source": "T25n1509_021:0221a04_4"
    },
    {
        "source_sentence": "復次，破魔軍故得解脫，離煩惱故得解脫，離遮諸禪法故得解脫，於諸禪定入出自在無礙故。",
        "translation": "Furthermore, it is because of destroying the army of devil that liberation is attained; because of being free from defilement that liberation is attained; because of being free from obstructing the factors of trance that liberation is attained: because one enters and emerges freely in all trances without obstruction.",
        "source": "T25n1509_021:0221a05_5"
    },
    {
        "source_sentence": "復次，菩薩於見諦道中，得深十六解脫：一、苦法智相應有為解脫；",
        "translation": "“Furthermore, in the path of insight into truths enlightening beings attain sixteen profound liberations:",
        "source": "T25n1509_021:0221a07_6"
    },
    {
        "source_sentence": "二、苦諦斷十結盡，得無為解脫。",
        "translation": "The second is the truth of suffering, which ends the ten bonds and attains liberation from nonexistence.",
        "source": "T25n1509_021:0221a09_7"
    },
    {
        "source_sentence": "如是乃至道比智。",
        "translation": "Thus, it's up to the cognition of the path as compared.",
        "source": "T25n1509_021:0221a10_0"
    },
    {
        "source_sentence": "思惟道中，得十八解脫：一、或比智或法智相應有為解脫，二、斷無色界三思惟結故，得無為解脫。",
        "translation": "In the path of reflection, they attain 18 liberations: 1. conditioned liberation associated with either inferential knowledge or knowledge of dharmas; 2. because they end the three bonds of contemplation in the formless realm, they attain unconditioned liberation.",
        "source": "T25n1509_021:0221a10_1"
    },
    {
        "source_sentence": "如是乃至第十八盡智相應有為解脫；",
        "translation": "In this way, up to the conditioned liberation associated with the eighteenth knowledge of destruction.",
        "source": "T25n1509_021:0221a12_2"
    },
    {
        "source_sentence": "及一切結使盡，得無為解脫。",
        "translation": "When all the bonds and tendencies are ended, he attains liberation from nonexistence.",
        "source": "T25n1509_021:0221a13_3"
    },
    {
        "source_sentence": "如是諸解脫和合，名為解脫眾具足。",
        "translation": "Thus, the combination of these liberations is called the fulfillment of the multitude of liberation.",
        "source": "T25n1509_021:0221a14_4"
    },
    {
        "source_sentence": "復次，念佛解脫知見眾具足。",
        "translation": "Furthermore, mindfulness of the Buddha's liberation is replete with knowledge and vision.",
        "source": "T25n1509_021:0221a15_5"
    },
    {
        "source_sentence": "解脫知見眾有二種：一者、佛於解脫諸煩惱中，用盡智自證知：知苦已，斷集已，盡證已，修道已，是為盡智解脫知見眾。",
        "translation": "There are two kinds of knowledge and vision of liberation: 1. The Buddha, in liberation from the afflictions, knows on his own with the knowledge of extinction that suffering has been known, stopped, accumulated, completely realized, and cultivated—this is the knowledge and vision of the liberation of liberation through the knowledge of extinction.",
        "source": "T25n1509_021:0221a15_6"
    },
    {
        "source_sentence": "知苦已不復更知，乃至修道已不復更修，是為無生智解脫知見眾。",
        "translation": "Knowing that suffering is no longer known, and not further cultivating it after cultivating it, this is the group of people who are liberated by knowledge and vision of nonarising.",
        "source": "T25n1509_021:0221a18_7"
    },
    {
        "source_sentence": "二者、佛知是人入空門得解脫，是人無相門得解脫，是人無作門得解脫；",
        "translation": "The second is that the Buddha knows that this person enters the aspect of emptiness to attain liberation. This person enters the aspect of signlessness to attain liberation, and this person enters the aspect of nonconstruction to attain liberation.",
        "source": "T25n1509_021:0221a20_8"
    },
    {
        "source_sentence": "是人無方便可令解脫。",
        "translation": "That person doesn't have the method to be liberated.",
        "source": "T25n1509_021:0221a21_9"
    },
    {
        "source_sentence": "是人久久可得解脫，是人不久可得解脫，是人即時得解脫。",
        "translation": "That person will attain liberation for a long time, and that person will attain liberation soon. That person will immediately attain liberation.",
        "source": "T25n1509_021:0221a22_10"
    },
    {
        "source_sentence": "是人軟語得解脫，是人苦教得解脫，是人雜語得解脫。",
        "translation": "That person's soft speech attains liberation, and that person's painful teaching attains liberation, and this person's mixed speech attains liberation.",
        "source": "T25n1509_021:0221a23_11"
    },
    {
        "source_sentence": "是人見神通力得解脫，是人說法得解脫。",
        "translation": "That person sees the miraculous powers and attains liberation, and this person who teaches the Dharma attains liberation.",
        "source": "T25n1509_021:0221a25_12"
    },
    {
        "source_sentence": "是人婬欲多，為增婬欲得解脫；",
        "translation": "That person’s sexual desire is intense, and in order to increase his sexual desire he obtains liberation.",
        "source": "T25n1509_021:0221a26_13"
    },
    {
        "source_sentence": "是人瞋恚多，為增瞋恚得解脫——如難陀、漚樓頻螺龍是。",
        "translation": "That person's anger is abundant, and it's because they increase anger that they attain liberation - like Nanda and Uruvilvāparvata.",
        "source": "T25n1509_021:0221a26_14"
    },
    {
        "source_sentence": "如是等種種因緣得解脫，如法眼中說。",
        "translation": "Such are the various causes and conditions for attaining liberation, as explained in the Dharma eye.",
        "source": "T25n1509_021:0221a28_15"
    },
    {
        "source_sentence": "於是諸解脫中了了知見，是名解脫知見眾具足。",
        "translation": "In these liberations, he perceives and sees that this is called the full accomplishment of the knowledge and vision of liberation.",
        "source": "T25n1509_021:0221a29_16"
    },
    {
        "source_sentence": "復次，念佛一切智、一切知見，大慈、大悲，十力、四無所畏，四無礙智、十八不共法等；",
        "translation": "“Furthermore, mindfulness of Buddha’s omniscience, omniscience in all knowledge and vision, great kindness, great compassion, the ten powers, the four fearlessnesses, the four unhindered knowledges, the eighteen unique qualities, etc.",
        "source": "T25n1509_021:0221b01_17"
    },
    {
        "source_sentence": "念如佛所知無量不可思議諸功德，是名念佛。",
        "translation": "To be mindful of the immeasurable and inconceivable merits known by the Buddha is called mindfulness of the Buddha.",
        "source": "T25n1509_021:0221b03_18"
    },
    {
        "source_sentence": "是念在七地中。",
        "translation": "This mindfulness is in the seventh ground.",
        "source": "T25n1509_021:0221b04_19"
    },
    {
        "source_sentence": "或有漏，或無漏。",
        "translation": "They may be contaminated or uncontaminated.",
        "source": "T25n1509_021:0221b04_20"
    },
    {
        "source_sentence": "有漏者有報，無漏者無報。",
        "translation": "What's contaminated has retribution, what's uncontaminated has no retribution.",
        "source": "T25n1509_021:0221b05_0"
    },
    {
        "source_sentence": "三根相應：樂、喜、捨根。",
        "translation": "They are associated with three faculties: satisfaction, satisfaction and equanimity.",
        "source": "T25n1509_021:0221b05_1"
    },
    {
        "source_sentence": "行得，亦果報得：行得者，如此間國中學念佛三昧；",
        "translation": "The one acquired by application is also acquired as retribution:",
        "source": "T25n1509_021:0221b06_2"
    },
    {
        "source_sentence": "果報得者，如無量壽佛國人，生便自然能念佛。",
        "translation": "Those who attain retribution are like the people of the Buddha's land of Immeasurable Life, who are born and naturally able to remember the Buddha.",
        "source": "T25n1509_021:0221b07_3"
    },
    {
        "source_sentence": "如是等，如《阿毘曇》中廣分別。",
        "translation": "Such and so on, as explained in detail in the abhidharma.",
        "source": "T25n1509_021:0221b08_4"
    },
    {
        "source_sentence": "大智度論卷第二十一",
        "translation": "Dazhiduo lun, vol. 21",
        "source": "T25n1509_021:0221b09_0"
    }
]