[
    {
        "source_sentence": "金剛仙論卷第十",
        "translation": "Jingang xian lun, vol. 10",
        "source": "T25n1512_010:0867c12_0"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1512_010:0867c14_0"
    },
    {
        "source_sentence": "若善男子善女人，以三千大千世界微塵」等，此一段經是斷疑分中第十六經文。",
        "translation": "If good men and good women, take the tiny dust of the 3,000 great one-thousand worlds, this section of the sūtra is the sixteenth text of the sutra in the section on ending doubt.",
        "source": "T25n1512_010:0867c14_1"
    },
    {
        "source_sentence": "所以來者，為答上疑問故也。",
        "translation": "The reason for coming is to answer the above question.",
        "source": "T25n1512_010:0867c16_0"
    },
    {
        "source_sentence": "疑云：若應佛有去來，法報二佛無去來者，此之三佛及十方諸佛，斷煩惱盡成道之時，",
        "translation": "Doubt: If the response buddha has a coming and going, and the two buddhas of the dharma-retribution have no coming or going, then these three buddhas and the buddhas of the ten directions will attain enlightenment when their afflictions are ended.",
        "source": "T25n1512_010:0867c16_1"
    },
    {
        "source_sentence": "於真如法界中，為一住處？",
        "translation": "What's the single abode in the realm of reality and the Dharma realm?",
        "source": "T25n1512_010:0867c18_2"
    },
    {
        "source_sentence": "為異住處？",
        "translation": "Why is it a different dwelling place?",
        "source": "T25n1512_010:0867c19_3"
    },
    {
        "source_sentence": "為合作？",
        "translation": "For the sake of cooperation?",
        "source": "T25n1512_010:0867c19_4"
    },
    {
        "source_sentence": "一切眾生真如性，為一為異？",
        "translation": "Is the true nature of all sentient beings, is it one or different?",
        "source": "T25n1512_010:0867c19_5"
    },
    {
        "source_sentence": "為多為少？",
        "translation": "Why is it much and why is it little?",
        "source": "T25n1512_010:0867c20_6"
    },
    {
        "source_sentence": "此猶是前經中所疑問事，前論偈中作生此經之端略，興問答云「於是法界處，",
        "translation": "This is just like the question asked in the previous sūtra. In the verse that gives rise to this summary of the meaning of the sutra, he asks a question and answers, saying:",
        "source": "T25n1512_010:0867c20_7"
    },
    {
        "source_sentence": "非一亦非異」。",
        "translation": "It's neither the same nor different.",
        "source": "T25n1512_010:0867c22_8"
    },
    {
        "source_sentence": "而此經將具釋彼疑一異多少之義故，引三千世界微塵喻經以答之也。",
        "translation": "This sūtra will explain in detail the meaning of that doubt about the number of differences, so we'll cite the 3,000 worldly metaphors and scriptures to answer it.",
        "source": "T25n1512_010:0867c22_9"
    },
    {
        "source_sentence": "此明碎三千世界極細微塵，為無色香味觸之塵，然今窓中因日光見者此是麁塵，",
        "translation": "This shows that the subtle particles shattering the 3,000 worlds are formless objects of odor, taste, and touch, but now those seen in the window by reason of the sunlight are dust motes.",
        "source": "T25n1512_010:0867c24_10"
    },
    {
        "source_sentence": "析此為三百分方謂微塵，此微塵非凡夫二乘所見。",
        "translation": "This is called a tiny particle of dust when it's analyzed as 300 parts, and this tiny particle of dust is not something that ordinary people see in the two-vehicle teachings.",
        "source": "T25n1512_010:0867c26_11"
    },
    {
        "source_sentence": "復末此細塵令作無色味等塵。",
        "translation": "Again, this subtle particle of dust causes it to become formless taste and so forth.",
        "source": "T25n1512_010:0867c27_12"
    },
    {
        "source_sentence": "此微塵無色味形狀，亦無四方上下，頭數雖多而不可言一處住、異處住、合作一，",
        "translation": "These tiny particles are without color, taste, shape, or form, and do not exist in the four directions or up or down. Though their number may be numerous, they cannot be said to abide in one place, live in different places, or cooperate with each other.",
        "source": "T25n1512_010:0867c28_13"
    },
    {
        "source_sentence": "以況三佛及十方諸佛亦多無量也。",
        "translation": "How could it be that the three buddhas and the buddhas of the ten directions are also numerous and immeasurable?",
        "source": "T25n1512_010:0868a01_0"
    },
    {
        "source_sentence": "然此諸佛雖多，斷煩惱盡時，於真如法界中，不可說言一異，亦不可說言一處住、異處住。",
        "translation": "However, even though these buddhas are numerous, when they end their afflictions, it can't be said that there's one place where they live or another place where they live in the true reality realm of reality.",
        "source": "T25n1512_010:0868a01_1"
    },
    {
        "source_sentence": "眾生佛性性淨解脫，據眾生雖多，而真如理中古今平等，亦不可說言一異多少。",
        "translation": "Although there are so many sentient beings, the buddha-nature of sentient beings is inherently pure and liberating, and even though it's true that the past and present are equal in principle, it can't be said to be one or different.",
        "source": "T25n1512_010:0868a03_2"
    },
    {
        "source_sentence": "為釋此疑，故次明也。",
        "translation": "In order to explain this doubt, we'll explain it next.",
        "source": "T25n1512_010:0868a05_3"
    },
    {
        "source_sentence": "「以三千世界微塵」者，此舉三千世界極細微塵也。",
        "translation": "The phrase 'by the tiny dust of the 3,000 worlds' refers to the extremely subtle tiny dust of the 3,000 worlds.",
        "source": "T25n1512_010:0868a07_0"
    },
    {
        "source_sentence": "「復以爾許微塵世界」者，此名細微塵，為世界，界之言性，故此一塵依世辨論，",
        "translation": "Furthermore, because these tiny dusty worlds are called subtle dust motes, they are worlds that have the verbal nature of realms, so this one dust mote relies on worldly explanations.",
        "source": "T25n1512_010:0868a08_1"
    },
    {
        "source_sentence": "亦名世界，亦名微塵也。",
        "translation": "They're also called worlds, and they're also called tiny dust.",
        "source": "T25n1512_010:0868a09_2"
    },
    {
        "source_sentence": "「碎為微塵」者，復碎此極細微塵為無色香味觸微塵也。",
        "translation": "The phrase broken into tiny dust means that further broken into these extremely fine dust are formless tiny dust motes of smell, taste, and touch.",
        "source": "T25n1512_010:0868a10_3"
    },
    {
        "source_sentence": "「阿僧祇」者，明非但碎三千世界為微塵，亦碎阿僧祇世界以為微塵。",
        "translation": "The phrase incalculable refers to the fact that it's not just crushing 3,000 worlds into tiny dust, but also crushing an incalculable number of worlds into tiny dust.",
        "source": "T25n1512_010:0868a11_4"
    },
    {
        "source_sentence": "亦得言無色味微塵不可算數故，言阿僧祇也。",
        "translation": "It can also be called incalculable because the tiny particles of formlessness and taste are incalculable.",
        "source": "T25n1512_010:0868a13_5"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1512_010:0868a14_6"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T25n1512_010:0868a14_7"
    },
    {
        "source_sentence": "是微塵眾寧為多不」者，明所碎世界既廣，故佛問須菩提：於汝意地，",
        "translation": "Would these tiny particles of dust be numerous? This means that since the worlds that are destroyed are so vast, the Buddha asks Subhūti, In your mind ground,",
        "source": "T25n1512_010:0868a14_8"
    },
    {
        "source_sentence": "思唯籌量，謂此微塵為多不也？",
        "translation": "Thinking only by calculation, does it mean that these tiny particles are numerous?",
        "source": "T25n1512_010:0868a16_9"
    },
    {
        "source_sentence": "故須菩提解如來意，答言「彼微塵眾甚多。",
        "translation": "That's why Subhūti understood the Tathāgata's intention and answered, There are so many tiny dusty people there.",
        "source": "T25n1512_010:0868a16_10"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T25n1512_010:0868a17_11"
    },
    {
        "source_sentence": "此明如來向者所說彼塵眾多；",
        "translation": "This shows how many atoms the Buddha teaches to those who are directed toward him.",
        "source": "T25n1512_010:0868a17_12"
    },
    {
        "source_sentence": "雖多，以無色香味觸形狀方所、無妨無礙故，不可說一處住、異處住、合作一，",
        "translation": "Even though they are numerous, because of being without form, odor, taste, touch, shape, direction and place, unobstructed and unimpeded: it cannot be said that there is abiding in one place, abiding in a different place or cooperating with one.",
        "source": "T25n1512_010:0868a18_13"
    },
    {
        "source_sentence": "以喻十方諸佛亦甚多無量。",
        "translation": "It's a metaphor for the fact that the buddhas of the ten directions are also so numerous and immeasurable.",
        "source": "T25n1512_010:0868a20_14"
    },
    {
        "source_sentence": "此十方諸佛，若據行者而言，一行者自作一佛；",
        "translation": "“These buddhas of the ten directions, according to their practitioners, each practice makes one buddha for themselves.",
        "source": "T25n1512_010:0868a20_15"
    },
    {
        "source_sentence": "行者既多，故佛亦多也。",
        "translation": "Since there are so many practitioners, so are the buddhas.",
        "source": "T25n1512_010:0868a22_0"
    },
    {
        "source_sentence": "諸佛據行者既多，不可說一；",
        "translation": "Since the buddhas have many practitioners, it cannot be said that they are one.",
        "source": "T25n1512_010:0868a22_1"
    },
    {
        "source_sentence": "二障永盡，法身平等無有差別，不可說異。",
        "translation": "The two hindrances are permanently eliminated, and the Dharma body is equal without distinction, which can't be described as different.",
        "source": "T25n1512_010:0868a23_2"
    },
    {
        "source_sentence": "然此微塵碎為無色味之塵雖多，無有形狀故，無色味等，亦無六方故，",
        "translation": "These tiny particles, however, are reduced to dust of formlessness. Although numerous, they have no shape because form and taste do not exist in the six directions.",
        "source": "T25n1512_010:0868a24_3"
    },
    {
        "source_sentence": "不可說一處，喻十方諸佛斷除二鄣會真如法界時，無有形礙，亦無方所故，",
        "translation": "It cannot be said that one place is a metaphor for the fact that when the buddhas of the ten directions cut off the two disputes and assemblies in the realm of reality, there is no form or obstruction, and also no direction or location.",
        "source": "T25n1512_010:0868a25_4"
    },
    {
        "source_sentence": "不可說言一處住、異處住也。",
        "translation": "It can't be said that they live in one place and live in different places.",
        "source": "T25n1512_010:0868a27_5"
    },
    {
        "source_sentence": "須菩提解佛意故，仰答如上。",
        "translation": "Because Suppository understands the Buddha's intention, he answers with reverence as above.",
        "source": "T25n1512_010:0868a28_6"
    },
    {
        "source_sentence": "眾中有人因生疑念：前既言碎微塵作虛空，無有六方形狀，復云微塵眾甚多。",
        "translation": "Some people in the assembly had this doubtful thought, saying, As we said before, shattering tiny particles creates space, there are no shapes in the six directions, and it's also said that there are so many tiny particles.",
        "source": "T25n1512_010:0868a28_7"
    },
    {
        "source_sentence": "此二言何故相違？",
        "translation": "Why are these two statements contradictory?",
        "source": "T25n1512_010:0868b01_8"
    },
    {
        "source_sentence": "故言「何以故」也。",
        "translation": "That's why they say, Why is it so?",
        "source": "T25n1512_010:0868b01_9"
    },
    {
        "source_sentence": "即答「若是微塵眾實有者，佛則不說微塵眾」，此明若使微塵眾實有六方形狀色香味觸不空者，",
        "translation": "He answered, If the number of tiny particles really exists, then the Buddha doesn't teach that the number of dust motes. This shows that if the number of tiny particles really exist in the six directions, form, form, odor, taste, touch, and nonemptyness",
        "source": "T25n1512_010:0868b02_10"
    },
    {
        "source_sentence": "佛則不假設說碎細微塵以為無色味微塵也。",
        "translation": "The Buddha then doesn't presume to say that the subtle and fine dust is a tiny particle of formless taste.",
        "source": "T25n1512_010:0868b04_11"
    },
    {
        "source_sentence": "復疑云：若此微塵體空無色味是不實者，何故如來說為微塵？",
        "translation": "Again, he wondered, If these tiny dust motes are empty in essence and formless in taste but not real, then why did the Tathāgata say they are tiny dust motes?",
        "source": "T25n1512_010:0868b05_12"
    },
    {
        "source_sentence": "以如來說為微塵故，明知微塵是實不空，故言「何以故」。",
        "translation": "Because the Tathāgata explains that it's because they are tiny dust motes, he clearly knows that tiny dust motes are real and not empty, so he says, Why?",
        "source": "T25n1512_010:0868b06_13"
    },
    {
        "source_sentence": "即答「佛說微塵眾則非微塵眾」，此明如來依世諦道中說虛妄微塵故，",
        "translation": "He answered, The Buddha teaches that the tiny number of dust motes is not the tiny number of dust motes. This shows that the Tathāgata relies on the path of the conventional truth and explains that it's because he speaks falsely of the tiny number of dust motes.",
        "source": "T25n1512_010:0868b08_14"
    },
    {
        "source_sentence": "言佛說微塵眾也。",
        "translation": "It means that the Buddha teaches about the tiny number of dust motes.",
        "source": "T25n1512_010:0868b09_15"
    },
    {
        "source_sentence": "此微塵眾虛妄不實，本來空寂，故言「則非微塵眾」。",
        "translation": "These tiny number of dust motes are false and insubstantial, which are originally empty and quiescent, so it's called not a tiny number of dust motes.",
        "source": "T25n1512_010:0868b10_16"
    },
    {
        "source_sentence": "此之微塵既是虛妄，寧有實塵而可說也？",
        "translation": "Since these tiny particles are false, how could there be a real particle that can be explained?",
        "source": "T25n1512_010:0868b11_17"
    },
    {
        "source_sentence": "「是故佛說微塵眾」者，以是故，如來上說無色香味觸無形狀之塵故，",
        "translation": "That's why the Buddha teaches about the multitude of tiny particles because it's because the Tathāgata explains above that formless, odorless, tasteless, touchless, and shapeless dust",
        "source": "T25n1512_010:0868b12_18"
    },
    {
        "source_sentence": "說於無塵為塵也。",
        "translation": "It's said that in the absence of dust, it's called dust.",
        "source": "T25n1512_010:0868b13_19"
    },
    {
        "source_sentence": "亦得道是故佛說非微塵眾，此因事無，以明因緣法體空也。",
        "translation": "Because they also attain the path, the Buddha teaches that it's not a collection of tiny dust motes, and these causes and conditions are absent in order to explain the emptiness of the Dharma body as cause and condition.",
        "source": "T25n1512_010:0868b14_20"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1512_010:0868b16_0"
    },
    {
        "source_sentence": "如來說三千大千世界則非世界」者，向明微塵喻，據極細而言，此言三千世界，",
        "translation": "The phrase the Tathāgata teaches that 3,000 great one-thousand worlds are not worlds refers to the metaphor of understanding subtle objects, which are described as 3,000 worlds in terms of their subtlety.",
        "source": "T25n1512_010:0868b16_1"
    },
    {
        "source_sentence": "就塵為語。",
        "translation": "They speak in terms of the dust.",
        "source": "T25n1512_010:0868b17_2"
    },
    {
        "source_sentence": "然復有疑：上佛說細微塵，其體不實故，所以是無。",
        "translation": "However, there's another doubt: the above Buddha said that subtle particles of dust are not real because their essence is unreal; therefore, it's nonexistent.",
        "source": "T25n1512_010:0868b18_3"
    },
    {
        "source_sentence": "然要以細微塵成麁世界，若細微塵無實者，何故有此三千世界等麁物？",
        "translation": "However, if a tiny particle of dust were to form a coarse world, and if a tiny particle of dust is insubstantial, then why would there be such coarse things as these 3,000 worlds?",
        "source": "T25n1512_010:0868b19_4"
    },
    {
        "source_sentence": "然此麁世界既為細塵所成，若細塵無者，何故眼見三千世界等麁物是有？",
        "translation": "However, since these gross worlds are formed by minute particles, why would the eye see such gross things as the 3,000 worlds exist if they were nonexistent?",
        "source": "T25n1512_010:0868b20_5"
    },
    {
        "source_sentence": "以麁物有故，明知細塵亦有也。",
        "translation": "Because crude things exist, it's clear that fine dust also exists.",
        "source": "T25n1512_010:0868b22_6"
    },
    {
        "source_sentence": "故答「如來說三千大千世界則非世界」，明如來說假三千成一世界。",
        "translation": "That's why the answer is, The Tathāgata teaches that 3,000 great one-thousand worlds are not worlds, which explains that the Tathāgata teaches that 3,000 nominally constitute a single world.",
        "source": "T25n1512_010:0868b23_7"
    },
    {
        "source_sentence": "若有一世界不為他成，可有世界是實；",
        "translation": "If there is one world, it cannot be formed by others; but the existence of a world is real.",
        "source": "T25n1512_010:0868b24_8"
    },
    {
        "source_sentence": "然無一世界不為他成，是故無實。",
        "translation": "However, there is not a single world that cannot be formed by others. Therefore, it does not really exist.",
        "source": "T25n1512_010:0868b25_9"
    },
    {
        "source_sentence": "以其無實故，言如來說三千世界則非世界也。",
        "translation": "Because they are insubstantial, it's said that the Tathāgata teaches that 3,000 worlds are not worlds.",
        "source": "T25n1512_010:0868b26_10"
    },
    {
        "source_sentence": "然此細塵既無，明知三千麁界亦虛假不實也。",
        "translation": "However, since this subtle particle of dust is absent, it's clear that the 3,000 debilitating realms are also false and not real.",
        "source": "T25n1512_010:0868b27_11"
    },
    {
        "source_sentence": "「是故佛說三千世界」者，欲明若有一世界是實非虛妄者，佛則不虛說言三千世界；",
        "translation": "The expression therefore, the Buddha explains 3,000 worlds means to show that if there is a single world which is real and not false, then the Buddha does not speak falsely of a trichiliocosm.",
        "source": "T25n1512_010:0868b28_12"
    },
    {
        "source_sentence": "佛既說攬三千為一世界，故知虛假不實。",
        "translation": "Since the Buddha teaches that embracing 3,000 is one world, it's known to be false and not real.",
        "source": "T25n1512_010:0868c01_13"
    },
    {
        "source_sentence": "「何以故」者，有人乘生疑念：若微塵、世界二俱不實者，如來何說微塵集故世界成、散故世界壞？",
        "translation": "Why is it so? means that some people in the vehicle have doubts, saying, If tiny particles and worlds are neither real nor real, then why does the Tathāgata say that a tiny particle of dust accumulates because the world becomes formed and a world breaks up because it disperses?",
        "source": "T25n1512_010:0868c03_0"
    },
    {
        "source_sentence": "以此聖言誠驗，故知微塵是實，何故言空？",
        "translation": "Because these noble words are truly testimony, we know that the tiny particle is real, so why do we say it's empty?",
        "source": "T25n1512_010:0868c05_1"
    },
    {
        "source_sentence": "故云何以故也。",
        "translation": "That's why it's called that.",
        "source": "T25n1512_010:0868c06_2"
    },
    {
        "source_sentence": "即答「若世界實有者，則是一合相」，此言「世界」者，名微塵為世界，",
        "translation": "He answered, If the world really exists, then it's a single conjunction of characteristics. This expression world refers to names and tiny dust as worlds,",
        "source": "T25n1512_010:0868c06_3"
    },
    {
        "source_sentence": "明何故三千世界是不實。",
        "translation": "It explains why the 3,000 worlds are not real.",
        "source": "T25n1512_010:0868c07_4"
    },
    {
        "source_sentence": "若微塵世界是實者，四方微塵來則冥然一合，作一世界不可分別，不應有三千之名。",
        "translation": "If the world of tiny particles were real, then the tiny particles coming from the four directions would be mysterious and unitary, forming a single world that could not be distinguished, and there wouldn't have to be a name for it, even if it were called 3,000.",
        "source": "T25n1512_010:0868c08_5"
    },
    {
        "source_sentence": "既有三千之名，故知能成微塵世界是虛妄不實也。",
        "translation": "Since there are 3,000 names, it's known that the world that can form a tiny number of dust motes is false and unreal.",
        "source": "T25n1512_010:0868c10_6"
    },
    {
        "source_sentence": "以此微塵虛妄不實故，即體是空。",
        "translation": "Because these tiny particles are false and unreal, their essence is emptiness.",
        "source": "T25n1512_010:0868c11_7"
    },
    {
        "source_sentence": "空無形狀故，往來無障，乃至鐵圍山亦不相妨礙。",
        "translation": "Because space has no shape, there's no obstruction between going and coming, and even the iron mountains don't obstruct each other.",
        "source": "T25n1512_010:0868c12_8"
    },
    {
        "source_sentence": "故理而言之，東方微塵來無障無礙，西方乃至南北上下六方微塵來皆無障無礙。",
        "translation": "Therefore, in principle, it's said that the tiny particles coming from the east are unobstructed and unobstructed, and the tiny particles coming from the west up to the north or south and down in the six directions are all unobstructed and unobstructed.",
        "source": "T25n1512_010:0868c13_9"
    },
    {
        "source_sentence": "此微塵既不相障礙，亦無聚集之相，泯然空無有形狀，乃至須彌山亦不可見。",
        "translation": "Since these tiny particles aren't mutually obstructing, there's no characteristic of gathering, and extinguishing emptiness has no shape, so even Mount Sumeru can't be seen.",
        "source": "T25n1512_010:0868c15_10"
    },
    {
        "source_sentence": "以此驗知，有為世界莫問麁細，皆是虛妄不實本來空寂，依世人妄情說有世界。",
        "translation": "Because of this testimony, it's known that the artificial world doesn't ask about crude or subtle things, which are all false and unreal in their original emptiness and quiescence, relying on the deluded feelings of worldlings to say there's a world.",
        "source": "T25n1512_010:0868c17_11"
    },
    {
        "source_sentence": "此明因緣法體本來空也。",
        "translation": "This explains that the essence of causes and conditions as dharmas is originally empty.",
        "source": "T25n1512_010:0868c18_12"
    },
    {
        "source_sentence": "乘有疑難：若一合相是相實者，何故如來說合三千世界為一合相也？",
        "translation": "The vehicle has doubts and difficulties: If a single compound characteristic is the true characteristic, then why does the Tathāgata say that 3,000 worlds are one compound characteristic?",
        "source": "T25n1512_010:0868c20_0"
    },
    {
        "source_sentence": "故答云「如來說一合相」者，依世諦名，用虛妄法中說一合相也。",
        "translation": "That's why the answer says, The Tathāgata teaches that one compound characteristic is based on the names of the worldly truths and uses false dharmas to explain a single compound characteristic.",
        "source": "T25n1512_010:0868c21_1"
    },
    {
        "source_sentence": "「則非一合相」者，究理而言，無有一世界冥然一合，不假三千成故，",
        "translation": "The phrase not the characteristic of a single conjunction means that, according to the ultimate truth, there's no world that remains unified in a single conjunction, because it doesn't rely on 3,000 formations.",
        "source": "T25n1512_010:0868c23_0"
    },
    {
        "source_sentence": "言則非一合相也。",
        "translation": "When it's said, it's not a single unified characteristic.",
        "source": "T25n1512_010:0868c24_1"
    },
    {
        "source_sentence": "「佛言：須菩提：一合相者則是不可說」者，明有為虛妄不實故，無有一世界冥然一合相是實而可說，",
        "translation": "The Buddha said, Subhūti, a single compound characteristic is inexplicable because conditioned things are false and unreal, so there's not a single world that can be explained by means of a single compound characteristic.",
        "source": "T25n1512_010:0868c24_2"
    },
    {
        "source_sentence": "故言則是不可說也。",
        "translation": "That's why it's called ineffable.",
        "source": "T25n1512_010:0868c27_3"
    },
    {
        "source_sentence": "乘此生疑：若使世界一合相無實者，而眾生不應見，復不應用之；",
        "translation": "If the characteristics of a single conjunction of worlds were insubstantial, sentient beings would not see it and do not use it.",
        "source": "T25n1512_010:0868c28_0"
    },
    {
        "source_sentence": "然今現見有此世界屋宅衣服器世間等用。",
        "translation": "However, now we see that this world has such functions as homes, clothing, vessels, and so forth in the world.",
        "source": "T25n1512_010:0868c29_1"
    },
    {
        "source_sentence": "既有此用，明知麁世界是實。",
        "translation": "Since this function exists, it's clear that the crude world is real.",
        "source": "T25n1512_010:0869a01_2"
    },
    {
        "source_sentence": "麁世界既實，細微塵亦實，何得言麁細微塵世界皆虛妄不實也？",
        "translation": "Since the crude world is real, how can we say that the crude and subtle worlds are all false and insubstantial?",
        "source": "T25n1512_010:0869a02_3"
    },
    {
        "source_sentence": "故經答云「但凡夫之人貪著其事」也，明凡夫之人以取相顛倒因緣故，",
        "translation": "That's why the sūtra answers, But ordinary people cling to things. It means that ordinary people are mistakenly attached to marks because they grasp them as causes and conditions.",
        "source": "T25n1512_010:0869a03_4"
    },
    {
        "source_sentence": "於虛事之中計以為實，非謂麁世界是性實也。",
        "translation": "In the midst of falsehood, it's imagined to be real, not that the crude world is inherently real.",
        "source": "T25n1512_010:0869a05_5"
    },
    {
        "source_sentence": "然所成麁世界既不實故，明知細塵亦是虛也。",
        "translation": "However, since the crude world that's formed is not real, it's clear that the subtle dust is also empty.",
        "source": "T25n1512_010:0869a06_6"
    },
    {
        "source_sentence": "「何以故」者，因前凡夫貪著其事，乘復生疑：若凡夫人顛倒在心故，",
        "translation": "Why is it so? means that because the former worldlings were greedy with their things, the vehicle again became doubtful:",
        "source": "T25n1512_010:0869a07_7"
    },
    {
        "source_sentence": "取微塵世界麁細有為虛事妄謂為實者，如來無有取相顛倒之心，何說有微塵世界？",
        "translation": "The Tathāgata has no mistaken mind that grasps characteristics, so why would he say there are tiny worlds?",
        "source": "T25n1512_010:0869a08_8"
    },
    {
        "source_sentence": "如來何故復言，我見微塵及世界等。",
        "translation": "Why does the Tathāgata again say, 'I see tiny dust motes and worlds'?",
        "source": "T25n1512_010:0869a10_9"
    },
    {
        "source_sentence": "若如來說言我見所見，我我所別內外之異，又如來何故復說本有我人眾生等見，",
        "translation": "If the Tathāgata were to teach that there is a view of self and another view of what belongs to self, then why would the Tathāgata have any idea of self, person, living being, etc., exist in the first place?",
        "source": "T25n1512_010:0869a11_10"
    },
    {
        "source_sentence": "後觀我法體空故得二種無我解，方斷我人等惑，名為得道。",
        "translation": "Only after observing the emptiness of the essence of self and dharmas can they attain the understanding of two kinds of selflessness, and it's only when they stop the afflictions such as self and person that they're called attaining the path.",
        "source": "T25n1512_010:0869a13_11"
    },
    {
        "source_sentence": "如來既作如是說，以此驗之，明知此微塵世界麁細等法是其實有，非虛妄故空也。",
        "translation": "Since the Tathāgata has made such a statement, this proves that these tiny worlds of dust and subtle things really exist, not empty because they're false.",
        "source": "T25n1512_010:0869a14_12"
    },
    {
        "source_sentence": "以有此疑故，言何以故也。",
        "translation": "Because there's this doubt, they say why is it so?",
        "source": "T25n1512_010:0869a16_13"
    },
    {
        "source_sentence": "佛今將答此義，故問須菩提：若人如是言「佛說我人眾生壽者見。」",
        "translation": "Now, the Buddha will answer this question, so he asks Suppository: Suppose someone thus says, The Buddha teaches that I am the view of sentient beings and sentient beings who have longevity.",
        "source": "T25n1512_010:0869a17_14"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1512_010:0869a18_15"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T25n1512_010:0869a18_16"
    },
    {
        "source_sentence": "是人所說為正語不也？",
        "translation": "Is this person's explanation correct?",
        "source": "T25n1512_010:0869a19_17"
    },
    {
        "source_sentence": "此明佛問須菩提，若有人以如前所疑疑，謂佛作是說：本實有我法，後觀此我法得無我法之解，",
        "translation": "This shows that the Buddha asked Subhūti. Suppose there is someone who doubts and doubts something as before, saying: “The Buddha said in fact, ‘There really is a self and dharmas in the past,’ and then observes this self and dharmas to attain an understanding of selflessness”—",
        "source": "T25n1512_010:0869a19_18"
    },
    {
        "source_sentence": "遣我法二見得無我無法名為得道。",
        "translation": "Rejecting the two views of self and dharmas to attain selflessness and nonexistence is called attaining the path.",
        "source": "T25n1512_010:0869a22_0"
    },
    {
        "source_sentence": "此人所說當理、此正語不也。",
        "translation": "What this person teaches should be the principle, but isn't it the right speech?",
        "source": "T25n1512_010:0869a22_1"
    },
    {
        "source_sentence": "故須菩提答言「不也。",
        "translation": "That's why Suppository replied, No.",
        "source": "T25n1512_010:0869a23_2"
    },
    {
        "source_sentence": "世尊」，明向者疑人所說言不當理不合佛意，故云不也。",
        "translation": "Bhagavān, it's because the person who goes there doubts that what people say doesn't accord with the Buddha's intention and therefore says no.",
        "source": "T25n1512_010:0869a23_3"
    },
    {
        "source_sentence": "「何以故？",
        "translation": "“Why is that?",
        "source": "T25n1512_010:0869a25_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1512_010:0869a25_5"
    },
    {
        "source_sentence": "如來說我人眾生壽者見，即非我人眾生壽者見」者，釋何故此人所說言不當理是不正語也。",
        "translation": "The Tathāgata teaches that the view of self and sentient beings' longevity is not the view of self and sentient beings' longevity, which explains why this person's words don't follow reason and aren't right speech.",
        "source": "T25n1512_010:0869a25_6"
    },
    {
        "source_sentence": "明二乘之人謂本實有我人眾生壽者等我我所見，後觀此我所二種空故，",
        "translation": "It means that the originally real self exists, humans, sentient beings, living beings, and life spans are equal to the view of self and what belongs to self. Because subsequently one observes these two kinds of emptiness:",
        "source": "T25n1512_010:0869a27_7"
    },
    {
        "source_sentence": "能斷此我人等見，而云我得無我之解，以此為真解。",
        "translation": "Being able to stop this view of self and humans and so forth and say that I've attained the understanding of selflessness is called true understanding.",
        "source": "T25n1512_010:0869a29_8"
    },
    {
        "source_sentence": "若謂如來亦作是說，以此為真實者，此說非正說也。",
        "translation": "If it's said that the Tathāgata also explains this as true, this explanation is not a correct explanation.",
        "source": "T25n1512_010:0869b01_9"
    },
    {
        "source_sentence": "然諸佛如來解一切法本來空寂，尚無我法可除，況有我法二空之見可存也，",
        "translation": "Still, the buddha-tathāgatas understand that all things are originally void and quiescent, yet there is no self or dharmas to be removed. How much less so a view of self and dharmas as two kinds of emptiness can exist.",
        "source": "T25n1512_010:0869b02_10"
    },
    {
        "source_sentence": "故云即非我人等見也。",
        "translation": "That's why it's called the view that it's not self or person.",
        "source": "T25n1512_010:0869b04_11"
    },
    {
        "source_sentence": "此無我等見，於聲聞為解，於菩薩為障。",
        "translation": "This view of selflessness and so forth is an understanding for śrāvakas and a hindrance for bodhisattvas.",
        "source": "T25n1512_010:0869b04_12"
    },
    {
        "source_sentence": "今明佛說要觀我法從本來空畢竟寂滅，無有我法可空，乃至煩惱亦本來寂靜，",
        "translation": "Now, the Buddha teaches that it is necessary to contemplate self and dharmas as ultimately quiescent from their original emptiness. There is no self or dharmas that can be empty, and so on, up to the initial quiescence of affliction.",
        "source": "T25n1512_010:0869b05_13"
    },
    {
        "source_sentence": "故無煩惱可斷。",
        "translation": "Therefore, there are no afflictions that can be stopped.",
        "source": "T25n1512_010:0869b07_14"
    },
    {
        "source_sentence": "不同二乘見本有我有法，今解二空方斷此惑名得道也。",
        "translation": "Unlike the two-vehicle view that there's originally a self and dharmas, the present understanding of the two kinds of emptiness only stops this affliction and is called attaining the path.",
        "source": "T25n1512_010:0869b08_0"
    },
    {
        "source_sentence": "「是名非我見人見」等者，雙結我法二空也。",
        "translation": "These are called the two kinds of emptiness of self and dharmas that are neither viewed by self nor viewed by people, etc.",
        "source": "T25n1512_010:0869b09_1"
    },
    {
        "source_sentence": "二乘人見我無，得無我人等解，以為真實，故曰是名非我人見，亦得導是名我人眾生壽者見者。",
        "translation": "The two-vehicle people see that self is nonexistent and attain the understanding of selflessness as real, so they say it's called a view that's not self or person, and they can also be guided by this view. This is called a view that sees the longevity of self and sentient beings.",
        "source": "T25n1512_010:0869b10_2"
    },
    {
        "source_sentence": "明如上所說而解知我之與法古今湛然本來不生，現見真如平等，證初地無生忍菩提，",
        "translation": "They clearly understand as explained above, knowing that the self and the dharmas of past and present are inherently unarisen; now they see the equality of true reality to realize the enlightenment of the first-stage forbearance of nonarising.",
        "source": "T25n1512_010:0869b12_3"
    },
    {
        "source_sentence": "乃至佛果無上菩提，不同小乘取無我無法見以為真道。",
        "translation": "Up to the Buddha's fruit of unsurpassed enlightenment, it's not like the lesser vehicle taking selflessness and non-dharma views as the true path.",
        "source": "T25n1512_010:0869b14_4"
    },
    {
        "source_sentence": "佛作是說，故曰是名佛說虛妄不實我人眾生等見也，明是名無我人等虛妄見也。",
        "translation": "Because the Buddha makes this statement, it's called a false view that the Buddha teaches what's false and unreal, such as self, humans, sentient beings, and so forth, which clearly is called a false view of selflessness.",
        "source": "T25n1512_010:0869b15_5"
    },
    {
        "source_sentence": "乘更疑問：若存有無我無法見非得道者，觀何等法、起何等心、證何等法名為得道也？",
        "translation": "The vehicle further asked, If there's a view of selflessness that exists but doesn't attain the path, what are the things that are observed, what are the mental states that arise, and what are the things that are realized that are called the attainments of the path?",
        "source": "T25n1512_010:0869b18_0"
    },
    {
        "source_sentence": "故答「須菩提！",
        "translation": "That's why he answered, Subhūti!",
        "source": "T25n1512_010:0869b19_1"
    },
    {
        "source_sentence": "菩薩發菩提心者，於一切法應如是知」等，此以初地證智為菩提心，明於何義勸人。",
        "translation": "A bodhisattva who gives rise to the mind of enlightenment should thus know all things.' and so forth, this means that the first ground realizes knowledge as the mind of enlightenment and explains what it means to encourage people.",
        "source": "T25n1512_010:0869b20_2"
    },
    {
        "source_sentence": "若欲得初地以上真實道者，於麁細有為我法無我無法虛妄物中，應如是生知見信也。",
        "translation": "If someone wants to attain the true path above the first ground, they should thus give rise to knowledge and vision and faith in crude, subtle, conditioned self-existence, selflessness, and nothing false things.",
        "source": "T25n1512_010:0869b22_3"
    },
    {
        "source_sentence": "「如是知」者，明住前人以世間聞慧五明論智髣髴而知。",
        "translation": "The phrase thus knowing refers to the knowledge that someone who lives before him knows by means of the five insights of worldly hearing and wisdom, which are discussed in terms of their cognition.",
        "source": "T25n1512_010:0869b24_4"
    },
    {
        "source_sentence": "「如是見」者，明住上人以出世第一義智見。",
        "translation": "Such-and-such views refers to those who abide in the supramundane wisdom view of the ultimate truth.",
        "source": "T25n1512_010:0869b25_5"
    },
    {
        "source_sentence": "「如是信」者，明前二人前並依三昧無量功德力信。",
        "translation": "The phrase thus faith explains that the first two people had faith based on the immeasurable merit and power of samādhi in front of each other.",
        "source": "T25n1512_010:0869b26_6"
    },
    {
        "source_sentence": "此明之人以用此二智三昧故見真如佛性，除一切法上有無之患也。",
        "translation": "This explains that people who use these two kinds of wisdom and samādhi to see the buddha-nature of true thusness and remove the afflictions of existence and nonexistence in all dharmas.",
        "source": "T25n1512_010:0869b27_7"
    },
    {
        "source_sentence": "「如是不住法相」者，既有為虛妄無我無法中生知見信解故，便不取著也。",
        "translation": "Thus, he doesn't abide in the characteristics of dharmas because knowing, seeing, believing, and understanding arises from what's false, selfless, and nonexistent, so he doesn't cling to them.",
        "source": "T25n1512_010:0869b29_8"
    },
    {
        "source_sentence": "「何以故」者，或者聞言菩薩不住法相，疑謂菩薩於世間法出世間法中悉皆不住，",
        "translation": "Why is that? Some people who hear that the bodhisattva doesn't abide in the characteristics of things doubt that the bodhisattva doesn't abide in worldly dharmas or transmundane dharmas at all.",
        "source": "T25n1512_010:0869c01_9"
    },
    {
        "source_sentence": "故言何以故也。",
        "translation": "That's why they say, Why is it so?",
        "source": "T25n1512_010:0869c03_10"
    },
    {
        "source_sentence": "故佛答「須菩提！",
        "translation": "That's why the Buddha answered, Subhūti!",
        "source": "T25n1512_010:0869c03_11"
    },
    {
        "source_sentence": "所言法相法相者，如來說即非法相也」。",
        "translation": "What's called the characteristic of dharmas and the characteristic of dharmas is what the Tathāgata teaches, which is the characteristic of what's unlawful.",
        "source": "T25n1512_010:0869c04_12"
    },
    {
        "source_sentence": "上言「法相」者，是世間色等有為法有無之相。",
        "translation": "The above statement, characteristics of dharmas refers to worldly form and other conditioned dharmas that have and don't have characteristics.",
        "source": "T25n1512_010:0869c05_13"
    },
    {
        "source_sentence": "下言「法相」，是出世真如無為法相。",
        "translation": "The following statement, Dharma-characteristic, refers to the supramundane true and unconditioned Dharma-characteristic.",
        "source": "T25n1512_010:0869c06_14"
    },
    {
        "source_sentence": "「如來說即非法相」者，明如來說「即非法相」者明如來說世間有無法相，",
        "translation": "The phrase the Tathāgata teaches that what's unlawful means to explain that the Tathāgata teaches that what's unlawful means to explain that the Tathāgata teaches that the world has an unlawful characteristic,",
        "source": "T25n1512_010:0869c06_15"
    },
    {
        "source_sentence": "非出世間無為真如法相。",
        "translation": "It's not the true dharma-characteristic of nonproductivity that transcends the world.",
        "source": "T25n1512_010:0869c08_16"
    },
    {
        "source_sentence": "出世間真如法相，即非世間有無虛妄法相也。",
        "translation": "It's the true dharma-characteristic that transcends the world, which means it's not a false dharma-characteristic that exists or doesn't exist in the world.",
        "source": "T25n1512_010:0869c09_17"
    },
    {
        "source_sentence": "「是名法相」者，如是非世間有為有漏法相，即是出世間真如無為法相，",
        "translation": "The expression this is called the characteristic of dharmas refers to the fact that what's not worldly, conditioned, and contaminated dharmas are supramundane, true, unconditioned dharmas.",
        "source": "T25n1512_010:0869c10_18"
    },
    {
        "source_sentence": "亦得云是名世間有無法相也。",
        "translation": "It can also be said that this is called the absence of a mark of nonexistence in the world.",
        "source": "T25n1512_010:0869c11_19"
    },
    {
        "source_sentence": "上言「不住法相」者，但不住世間有為法有無之相，非不住出世間無為法相，",
        "translation": "The above saying, He doesn't abide in the characteristics of dharmas means that he doesn't abide in the characteristics of worldly conditioned dharmas as existent or nonexistent, and he doesn't abide in the characteristics of transmundane unconditioned dharmas.",
        "source": "T25n1512_010:0869c12_20"
    },
    {
        "source_sentence": "那得聞言不住法相便謂世間出世間有為無為法相中皆不住也？",
        "translation": "How can it be said that they don't abide in the characteristics of dharmas when they hear that they don't abide in the characteristics of dharmas and then say that they don't abide in the characteristics of worldly and transmundane, conditioned and unconditioned dharmas?",
        "source": "T25n1512_010:0869c14_21"
    },
    {
        "source_sentence": "自此已上經，釋前偈中「於是法界處，非一亦非異」疑也。",
        "translation": "From here on, the above sūtra explains the doubt that in the previous verse, Where there's the Dharma realm, it's neither the same nor different.",
        "source": "T25n1512_010:0869c15_22"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1512_010:0869c17_0"
    },
    {
        "source_sentence": "若有菩薩以滿無量阿僧祇世界七寶用布施」者，此上有疑：上來微塵喻中明三佛不一不異。",
        "translation": "Suppose there's a bodhisattva who uses the seven treasures of the infinite incalculable world to fill it with generosity, and there's doubt about this: the above metaphor of the tiny dusty metaphor that explains that the three buddhas are neither the same nor different.",
        "source": "T25n1512_010:0869c17_1"
    },
    {
        "source_sentence": "雖明三佛，准上經文唯應有二，不應有三。",
        "translation": "Even though it explains the three buddhas, there should be only two according to the text of the sūtras above, not three.",
        "source": "T25n1512_010:0869c19_2"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T25n1512_010:0869c20_3"
    },
    {
        "source_sentence": "上第六段中云釋迦牟尼非佛亦非說法者；",
        "translation": "In the sixth paragraph above, it is said that Śākyamuni is neither a Buddha nor a preacher.",
        "source": "T25n1512_010:0869c20_4"
    },
    {
        "source_sentence": "又次前經復云化佛有去來教化眾生，供之得福。",
        "translation": "Furthermore, the previous sūtra also said that there are transformation buddhas who go and come to teach sentient beings and make offerings to them to attain merit.",
        "source": "T25n1512_010:0869c21_5"
    },
    {
        "source_sentence": "此前後相違。",
        "translation": "The prior and subsequent are contradictory.",
        "source": "T25n1512_010:0869c22_6"
    },
    {
        "source_sentence": "今疑未知應身為定是佛、為非佛也？",
        "translation": "Now, do you doubt that the response body is definitely a buddha or not a buddha?",
        "source": "T25n1512_010:0869c22_7"
    },
    {
        "source_sentence": "若是佛者，供養此應佛所有福德，與二佛同、為有差降？",
        "translation": "If this were a buddha, would it be the same as the merits of making offerings to these two buddhas or different from those of the two buddhas?",
        "source": "T25n1512_010:0869c23_8"
    },
    {
        "source_sentence": "化佛所說經法，為是正法、為非正法？",
        "translation": "What's the right teaching and what's not the right teaching that the transformation buddha teaches?",
        "source": "T25n1512_010:0869c24_9"
    },
    {
        "source_sentence": "若受應佛所說法，所得利益為與受持報佛所說法功德同、為復有差降也？",
        "translation": "If someone receives the teaching taught by the Buddha who should be taught, is the benefit gain gained equal to the merit of the teaching taught by the Buddha who receives and retains the precepts, or is there another difference in their descent?",
        "source": "T25n1512_010:0869c25_10"
    },
    {
        "source_sentence": "惡心毀謗損害之者，罪復云何？",
        "translation": "What's the offense for someone who maliciously disparages and harms them?",
        "source": "T25n1512_010:0869c27_11"
    },
    {
        "source_sentence": "故欲答應佛是佛，所說經教是正法，供養受持得福。",
        "translation": "That's why I want to answer that the Buddha should be the Buddha, and the sūtras taught by him are the right teaching, making offerings, upholding, and attaining merit.",
        "source": "T25n1512_010:0869c28_12"
    },
    {
        "source_sentence": "聞前二佛，惡心毀謗得罪亦然。",
        "translation": "Hearing the first two buddhas, he badly denigrates them and commits the same offense.",
        "source": "T25n1512_010:0869c29_13"
    },
    {
        "source_sentence": "故引此喻，以阿僧祇世界七寶持用布施挍量，不如有人於應佛邊發菩薩心，",
        "translation": "That's why this metaphor is cited. It's because the seven treasures of incalculable worlds are supported by generosity, and it's not as great as if someone were to give rise to the bodhisattva aspiration at the side of the Buddha who responds to them.",
        "source": "T25n1512_010:0870a01_14"
    },
    {
        "source_sentence": "受應佛所說般若經一四句偈，乃至為人演說，其福勝彼無量阿僧祇。",
        "translation": "Accepting a four-line verse of the Prajñāpāramitā sūtra taught by the response Buddha or even expounding it for someone, their merit is greater than that of measureless incalculable eons.",
        "source": "T25n1512_010:0870a02_15"
    },
    {
        "source_sentence": "上疑通疑應佛，今經中何以但言持應佛所說經福多，不云供養應佛得福多？",
        "translation": "The above doubt is that there's a general doubt about the Buddha of response, so why does the present sūtra only say that maintaining the sūtras taught by the Buddha of response is abundant in merit and not that making offerings to the Buddha of response will obtain abundant merit?",
        "source": "T25n1512_010:0870a04_16"
    },
    {
        "source_sentence": "持應佛所說經法，此法能是應佛所說，但言受持應佛所說得福無量，則知供養應佛得福亦多，",
        "translation": "If someone simply says that the merit gained from accepting and upholding the sūtras taught by the Tathāgata is immeasurable, then they know that making offerings to the Tathāgata will also bring much merit.",
        "source": "T25n1512_010:0870a06_17"
    },
    {
        "source_sentence": "故不別出供養應佛也。",
        "translation": "Therefore, they don't separately present offerings to the response buddha.",
        "source": "T25n1512_010:0870a08_18"
    },
    {
        "source_sentence": "疑者云：若供養應佛所說經教與真佛無異者，云何此應佛處世教化說法，",
        "translation": "Those who doubted it said, If the offerings to the Worthy of Offerings are no different from the sūtras and teachings taught by the Buddha as real buddhas, then how could this Worthy of Offerings be a worldly exposition of the Teaching?",
        "source": "T25n1512_010:0870a09_0"
    },
    {
        "source_sentence": "而得不名應佛說法也？",
        "translation": "How could it not be called the teaching that should be taught by the Buddha?",
        "source": "T25n1512_010:0870a10_1"
    },
    {
        "source_sentence": "故經問言「云何？",
        "translation": "That's why the sūtra asks, What is it?",
        "source": "T25n1512_010:0870a11_2"
    },
    {
        "source_sentence": "為人演說，而不名說」，明應佛說法時，自云我從無量阿僧祇劫來廣修萬行，",
        "translation": "He explains it for others and doesn't call it a teaching. It means that when the Buddha teaches the Dharma, he says, 'Since measureless incalculably long eons, I've cultivated myriad practices extensively.",
        "source": "T25n1512_010:0870a11_3"
    },
    {
        "source_sentence": "今方成佛果，具足相好及諸功德，而不言我是化佛。",
        "translation": "Now that I've attained buddhahood, I'm fully endowed with the characteristics and virtues, but I don't say I'm a transformation Buddha.",
        "source": "T25n1512_010:0870a13_4"
    },
    {
        "source_sentence": "若自言我是化佛，眾生便謂是幻化人，此何等鬼神？",
        "translation": "If someone says to themselves, 'I am a transformation buddha,' sentient beings will then say that they are illusory and transformed people, so what are these ghosts?",
        "source": "T25n1512_010:0870a14_5"
    },
    {
        "source_sentence": "遂不生敬信，不受其所說。",
        "translation": "Consequently, they didn't give rise to respect and faith and didn't accept what he taught.",
        "source": "T25n1512_010:0870a15_6"
    },
    {
        "source_sentence": "心既不信，不受其教，即無所利益。",
        "translation": "Since their minds don't believe it, they won't accept its teaching, which means there's nothing to benefit.",
        "source": "T25n1512_010:0870a16_7"
    },
    {
        "source_sentence": "以不言是化佛故，有多利益也。",
        "translation": "It's because it doesn't say that it's because it's the transformation buddha, which has many benefits.",
        "source": "T25n1512_010:0870a17_8"
    },
    {
        "source_sentence": "「是名為說」者，此應佛從真處來，而不云是應化故，供養受持所得利益，",
        "translation": "The phrase this is called teaching means that the Buddha should come from the true place, but he doesn't say it's because of his transformation, offering support, receiving, and maintaining benefits.",
        "source": "T25n1512_010:0870a17_9"
    },
    {
        "source_sentence": "與真佛無差，是名即應佛所說是正說也。",
        "translation": "There's no difference between it and the true Buddha, which is called what should be taught by the Buddha as correct teaching.",
        "source": "T25n1512_010:0870a19_10"
    },
    {
        "source_sentence": "此一段經凡以六偈來釋。",
        "translation": "This section of the sūtra explains it in six verses.",
        "source": "T25n1512_010:0870a21_0"
    },
    {
        "source_sentence": "初一偈，舉微塵喻，作問答意，釋前經中疑。",
        "translation": "The first verse, which cites the metaphor of a tiny particle of dust, asks questions and answers with the intention to explain the doubts in the previous sūtras.",
        "source": "T25n1512_010:0870a21_1"
    },
    {
        "source_sentence": "第二偈，明微塵無色味形狀故不一不異，諸佛亦然，煩惱盡故不一不異也。",
        "translation": "The second verse explains that the tiny dust has no form and taste and shape, so it's neither the same nor different, and so are the buddhas, which are neither the same nor different because their afflictions have ended.",
        "source": "T25n1512_010:0870a22_2"
    },
    {
        "source_sentence": "第三偈上二句，明凡夫不解有為法空隨名取著也。",
        "translation": "The third verse and the first two sentences explain that ordinary people don't understand the emptiness of conditioned dharmas and follow their names to grasp them.",
        "source": "T25n1512_010:0870a24_3"
    },
    {
        "source_sentence": "下二句，瑣入第四偈有一偈半，通明諸佛菩薩不但得無我無法解故名為得道也。",
        "translation": "The next two phrases, the fourth verse that trivially enters into the fourth verse in one and a half verses, explain that the buddhas and bodhisattvas don't only attain selflessness and lack understanding, so they're called attaining the path.",
        "source": "T25n1512_010:0870a25_4"
    },
    {
        "source_sentence": "第五偈上二句，出二種菩薩能解之智。",
        "translation": "The first two phrases of the fifth verse give rise to two kinds of bodhisattva cognition that can be understood.",
        "source": "T25n1512_010:0870a27_5"
    },
    {
        "source_sentence": "下半偈，明供養化佛與真佛無異。",
        "translation": "The next half of the verse explains that making offerings to the transformation buddhas is no different from making offerings to the true buddhas.",
        "source": "T25n1512_010:0870a28_6"
    },
    {
        "source_sentence": "第六偈，明應佛所說法是其正說也。",
        "translation": "The sixth verse explains that what the Buddha teaches is his correct teaching.",
        "source": "T25n1512_010:0870a28_7"
    },
    {
        "source_sentence": "初偈云「世界作微塵」等一偈，釋經中「善男子善女人以下乃至阿僧祇世界」，",
        "translation": "The first verse says, As the world becomes a tiny particle of dust, and so forth, explaining that the sūtras say, Good men and good women down to incalculable worlds.",
        "source": "T25n1512_010:0870a29_8"
    },
    {
        "source_sentence": "若依世辨論中名此微塵為世界，非謂三千等世界也。",
        "translation": "If we rely on the names of these tiny dust motes as worlds in the Shiyan lun, we don't mean 3,000 such worlds.",
        "source": "T25n1512_010:0870b02_9"
    },
    {
        "source_sentence": "此明破有色味微塵為無色味微塵，此微塵無色香味觸亦無方所故名微塵。",
        "translation": "This explains that it refutes the idea that the tiny particle of form and taste is a tiny particle of formless taste. These tiny particles have no form, odor, taste, touch, or directional objects, so they're called tiny dust.",
        "source": "T25n1512_010:0870b03_10"
    },
    {
        "source_sentence": "「此喻示彼義」者，明借此微塵喻，釋上疑問於是法界處不一亦不異義，",
        "translation": "This metaphor shows their meaning refers to the metaphor of borrowing these tiny particles, which explains the above question about the meaning of neither one place in the Dharma realm nor different places in the Dharma realm.",
        "source": "T25n1512_010:0870b05_11"
    },
    {
        "source_sentence": "故云示彼義也。",
        "translation": "That's why it's called showing their meaning.",
        "source": "T25n1512_010:0870b07_12"
    },
    {
        "source_sentence": "「微塵碎為末」者，重舉上喻碎於微塵為無色味塵，喻諸佛如來成道之時永無二障，",
        "translation": "The phrase crushing tiny particles into powder refers to the above metaphor of crushing tiny particles into formless dust, which is a metaphor for the fact that there are no two hindrances when the buddhas and tathāgatas attain enlightenment.",
        "source": "T25n1512_010:0870b07_13"
    },
    {
        "source_sentence": "故下句言「示現煩惱盡」也。",
        "translation": "That's why the next sentence says, Showing the end of afflictions.",
        "source": "T25n1512_010:0870b09_14"
    },
    {
        "source_sentence": "「此明何義」者，問此一偈引喻之意，為明何義也。",
        "translation": "The phrase What does this explain mean? asks the meaning of this one verse's metaphor, which is to explain what it means.",
        "source": "T25n1512_010:0870b09_15"
    },
    {
        "source_sentence": "偈言「於是法界處，非一亦非異」者，論主引前偈論略答微塵喻所況事也。",
        "translation": "The verse says, Where there's the Dharma realm, it's neither one nor different, which refers to the fact that the treatise leader cites the previous verse in order to briefly answer the questions asked by the metaphor of the tiny dust motes.",
        "source": "T25n1512_010:0870b11_0"
    },
    {
        "source_sentence": "「彼諸佛如來於真如法界中」等，還解所引偈，明諸佛雖多，於真如法界中非一處住亦非異處住也。",
        "translation": "The phrase those buddhas and tathāgatas abide in the true Dharma realm of reality also explains the verse that's cited, which explains that although there are many buddhas, they don't abide in one place or different places in the Dharma realm of reality.",
        "source": "T25n1512_010:0870b12_1"
    },
    {
        "source_sentence": "「為示此義故說世界碎微塵喻」者，釋諸佛不一處、不異處住竟，提喻來結也。",
        "translation": "To show this meaning, we'll explain the metaphor of destroying tiny particles of worlds in order to explain that the buddhas don't live in one place or different places, which is the conclusion of the derivative metaphor.",
        "source": "T25n1512_010:0870b15_0"
    },
    {
        "source_sentence": "「此喻示何義」者，問此微塵喻況諸佛於真如法界中非一處住異處住者，",
        "translation": "The phrase showing what this metaphor means asks, What's the meaning of this tiny metaphor for buddhas that aren't abiding in one place or another in the true reality realm of reality?",
        "source": "T25n1512_010:0870b16_1"
    },
    {
        "source_sentence": "未知此喻有何相似，得以此喻示況也？",
        "translation": "We don't know what similarity this metaphor has, so we can show the situation with this metaphor.",
        "source": "T25n1512_010:0870b18_2"
    },
    {
        "source_sentence": "即以下半偈答言「微塵碎為末，示現煩惱盡」故。",
        "translation": "The next half a verse answers, A tiny particle of dust is broken into powder and shown to be the end of affliction.",
        "source": "T25n1512_010:0870b19_3"
    },
    {
        "source_sentence": "明若不碎世界，則有彼此之殊；",
        "translation": "It is clear that if one does not destroy worlds, there would be a difference between them.",
        "source": "T25n1512_010:0870b20_4"
    },
    {
        "source_sentence": "既碎為微塵，使無此彼之[阿-可+(可\\/(可*可))]。",
        "translation": "Since it's broken into tiny dust, so there's no such [a-可+(可\\/(可*可))].",
        "source": "T25n1512_010:0870b21_0"
    },
    {
        "source_sentence": "喻諸佛如來斷二障盡時，於真如法界中無彼此障礙。",
        "translation": "It's a metaphor for the fact that when the buddhas and tathāgatas end the two hindrances, there are no mutual obstacles in the true Dharma realm of reality.",
        "source": "T25n1512_010:0870b21_1"
    },
    {
        "source_sentence": "一處異處有如此相似，故以況之也。",
        "translation": "Because there's such similarity in one place and different places, it's called that.",
        "source": "T25n1512_010:0870b22_2"
    },
    {
        "source_sentence": "「此喻非聚集微塵眾」者，將作偈釋經故，先舉經中所明喻意，言微塵眾者，",
        "translation": "The phrase this metaphor isn't a collection of tiny particles because it's intended to be a verse that explains the sūtras, first citing the meaning of the metaphor explained in the sūtras.",
        "source": "T25n1512_010:0870b23_3"
    },
    {
        "source_sentence": "非實有微塵聚集名為眾也。",
        "translation": "It's not really that there are tiny particles that gather together and are called multitudes.",
        "source": "T25n1512_010:0870b25_4"
    },
    {
        "source_sentence": "「示現非一喻」者，為示現諸佛甚多，假設以無色味塵為微塵眾也。",
        "translation": "The expression showing what's not a single metaphor shows that there are so many buddhas, even if they were to suppose formless taste dust as a tiny number of dust motes.",
        "source": "T25n1512_010:0870b26_5"
    },
    {
        "source_sentence": "第二偈，釋經中「於意云何是微塵眾寧為多不是故佛說一合相」一段經也。",
        "translation": "The second verse explains the sūtra's section, What do you think these tiny multitudes of dust motes are? It's because they aren't numerous that the Buddha teaches a single composite characteristic.",
        "source": "T25n1512_010:0870b27_6"
    },
    {
        "source_sentence": "「非聚集」者，上經言「微塵眾甚多」，似如實有微塵。",
        "translation": "The phrase not gathering refers to the fact that the above sūtra says, There are so many tiny dust motes, which seem to really exist as there are tiny dust motes.",
        "source": "T25n1512_010:0870b29_7"
    },
    {
        "source_sentence": "此明以無色味塵為塵，非是實有微塵聚集而言微塵眾多，故言非聚集也。",
        "translation": "This explains that formless taste dust is taken as dust, but it's not true that there are tiny dust motes gathered together and said to be numerous, so it's called not gathering.",
        "source": "T25n1512_010:0870c01_8"
    },
    {
        "source_sentence": "「故集」者，疑云：若無實微塵聚集，何故言微塵眾多？",
        "translation": "The phrase therefore gathering refers to the doubt that if there are no real tiny dust motes gathered together, why would it be said that there are many tiny dust motes?",
        "source": "T25n1512_010:0870c02_9"
    },
    {
        "source_sentence": "故答道言聚集者，依世諦名字假設，無集中說集，非謂實有微塵眾聚集而言多，",
        "translation": "That is why the Answer: The expression “gathering together” in the path of enlightenment means that, according to the conventional truths, names and names are provisionally established. There is no speaking of ‘gathering together’ when they are not concentrated. It does not mean that there really are tiny dusty collections of atoms which are said to be numerous.",
        "source": "T25n1512_010:0870c04_10"
    },
    {
        "source_sentence": "故云故集也。",
        "translation": "That's why it's called the old collection.",
        "source": "T25n1512_010:0870c05_11"
    },
    {
        "source_sentence": "「非唯是一喻」者，若實無微塵聚集，何故假設言甚多也？",
        "translation": "Not only one metaphor means that if there really aren't tiny particles gathered together, why would it be false to say so many?",
        "source": "T25n1512_010:0870c06_12"
    },
    {
        "source_sentence": "明以微塵微既多，況十方諸佛亦是甚多，不可說一故也。",
        "translation": "It's clear that since there are so many tiny particles, why wouldn't the buddhas in the ten directions be so numerous, because they can't be described as one?",
        "source": "T25n1512_010:0870c07_13"
    },
    {
        "source_sentence": "微塵既是無體，不可說言定有微塵聚集，以喻如來斷煩惱盡體無障礙，",
        "translation": "Since atoms are insubstantial, it cannot be said that they necessarily include the collection of atoms. This is a metaphor for the fact that the Tathagata has abandoned defilement without obstruction by eliminating all obstacles [to enlightenment].",
        "source": "T25n1512_010:0870c08_14"
    },
    {
        "source_sentence": "不可說言一處集，故云非唯是一喻也。",
        "translation": "It can't be said that it's collected in one place, so it's called not just a single metaphor.",
        "source": "T25n1512_010:0870c10_15"
    },
    {
        "source_sentence": "「聚集處非彼」者，明微塵雖多，以體空故，聚集處無實塵可得。",
        "translation": "The phrase gathering places aren't those explains that although there are many tiny dust motes, because their essence is empty, the gathering places have no real dust to be obtained.",
        "source": "T25n1512_010:0870c11_16"
    },
    {
        "source_sentence": "一處無故，亦不從異處而來，以異處無實微塵可得故，云聚集處非彼也。",
        "translation": "Because one place is nonexistent, it doesn't come from a different place, and because there are no real tiny dust motes to be found in a different place, it's called the gathering place that aren't those.",
        "source": "T25n1512_010:0870c12_17"
    },
    {
        "source_sentence": "「非是差別喻」者，明如微塵無礙，一處聚集相不可得故，異處差別來相亦不可得；",
        "translation": "The phrase not a metaphor of distinctions means that, just as the characteristics of accumulation in one place are unobstructed by tiny particles, the characteristics of coming from different places are also unobtainable.",
        "source": "T25n1512_010:0870c14_18"
    },
    {
        "source_sentence": "況諸佛亦然，清淨法身體既無礙，非一處住故，亦非條然異處差別。",
        "translation": "It's even more so for buddhas because the pure Dharma body is unobstructed, not abiding in one place or two, and it's not a distinction between different places.",
        "source": "T25n1512_010:0870c16_19"
    },
    {
        "source_sentence": "如東方阿閦等亦不可得，故云非是差別喻也。",
        "translation": "It's like the eastern abhidharma and so forth that are also unobtainable, so it's called not a different metaphor.",
        "source": "T25n1512_010:0870c17_20"
    },
    {
        "source_sentence": "「此義云何？",
        "translation": "What does this mean?",
        "source": "T25n1512_010:0870c18_21"
    },
    {
        "source_sentence": "如微塵至無聚集物故」，釋上半偈也。",
        "translation": "It's like a tiny particle up to the point where there's no gathering of things. The first half of the verse explains this.",
        "source": "T25n1512_010:0870c18_22"
    },
    {
        "source_sentence": "「亦非異處差別至以差別不住故」，釋下半偈也。",
        "translation": "Nor is it because the distinction between different places doesn't abide up to the point where the distinction doesn't abide, explains the next half of the verse.",
        "source": "T25n1512_010:0870c19_23"
    },
    {
        "source_sentence": "「如是諸佛如來至亦非異處住」，上解偈中喻意，此義釋合喻之意也。",
        "translation": "Thus, these buddhas and tathāgatas arrive at the point where they don't abide in different places either, which explains the meaning of the metaphor in the verse above. This meaning explains the meaning of the combined metaphor.",
        "source": "T25n1512_010:0870c20_24"
    },
    {
        "source_sentence": "「如是三千世界合相喻非聚集故」者，前釋微塵不一異義，今此辨世界麁物中不一異義亦然，",
        "translation": "Thus, these 3,000 worlds are combined to form a metaphor for not being gathered because they're not one and the same as the previous explanation of the meaning of neither identity nor difference in the number of dust motes, so here we'll explain that the meaning of not being one and the same in terms of unity and difference in worldly objects is likewise.",
        "source": "T25n1512_010:0870c22_25"
    },
    {
        "source_sentence": "故云如是乃至非聚集也。",
        "translation": "That's why it's called thus and so forth up to not gathering together.",
        "source": "T25n1512_010:0870c24_26"
    },
    {
        "source_sentence": "「此以何義」者，問上三千世界合相喻復言非聚集故，此以何義故如是說也？",
        "translation": "The phrase what does this mean? asks the above metaphor of the 3,000 worlds that are united with characteristics and also says it's because they aren't united, so what does this mean by saying so?",
        "source": "T25n1512_010:0870c25_27"
    },
    {
        "source_sentence": "「如經」以下，舉如來成說為答也。",
        "translation": "Under thus is the sūtra, he cites the Tathāgata's accomplished explanation as an answer.",
        "source": "T25n1512_010:0870c27_0"
    },
    {
        "source_sentence": "「若實有一物聚集，如來則不說一物聚集」者，上已解微塵世界二喻并合喻竟，",
        "translation": "If there really is a single thing that gathers together, then the Tathāgata doesn't say that it's a single thing that gathers together. The above has explained the two metaphors of the dusty world and the combined metaphors,",
        "source": "T25n1512_010:0870c27_1"
    },
    {
        "source_sentence": "此文何故復來者，上雖明微塵世界虛妄不實，非一處聚集、非異處差別以況諸佛，",
        "translation": "The reason this text comes back is because the above explains that even though atomic worlds are false and unreal, they aren't collected in one place or differentiated in different places to describe the buddhas.",
        "source": "T25n1512_010:0870c29_2"
    },
    {
        "source_sentence": "而未解微塵世界所以是空。",
        "translation": "They don't understand that the tiny world of dust is therefore emptiness.",
        "source": "T25n1512_010:0871a02_3"
    },
    {
        "source_sentence": "今正釋二法空義，明若實有一微塵物不空而聚集者，如來則不假說無塵為塵為聚集眾也。",
        "translation": "Now, we'll explain the meaning of emptiness of the two dharmas correctly, saying that if there really is a tiny particle of things that aren't empty and gathered together, then the Tathāgata doesn't pretend to say that the absence of dust is the collection of things that are collected as dust.",
        "source": "T25n1512_010:0871a02_4"
    },
    {
        "source_sentence": "「若實有一世界」等者，此解世界空如微塵無異也。",
        "translation": "If there really is a world, and so forth, this explains that the world's emptiness is like a tiny particle of dust without difference.",
        "source": "T25n1512_010:0871a05_5"
    },
    {
        "source_sentence": "「如經」以下，舉經來結也。",
        "translation": "Under thus is the sūtra, we'll summarize it by citing the sūtras.",
        "source": "T25n1512_010:0871a06_6"
    },
    {
        "source_sentence": "「但凡夫之人貪著其事」者，此文前偈中無，何故別提來者，明凡夫妄聚前境，",
        "translation": "The phrase simply that ordinary people cling to things means that this text doesn't exist in the preceding verse, so why is it separately named because it explains that ordinary people are deludedly clustered in front of each other?",
        "source": "T25n1512_010:0871a06_7"
    },
    {
        "source_sentence": "於虛事生貪，以不實為實，成上微塵二法體空故引此釋也。",
        "translation": "They give rise to craving for things that are false and take what's unreal as real, which creates the emptiness of the essence of the two dharmas in the above-mentioned tiny number of dust motes, so they cite this explanation.",
        "source": "T25n1512_010:0871a08_8"
    },
    {
        "source_sentence": "「如經」以下，通舉前經結也。",
        "translation": "Below thus sūtras, we'll summarize the previous conclusion of the sutra.",
        "source": "T25n1512_010:0871a09_9"
    },
    {
        "source_sentence": "第三偈「但隨於音聲」上二句，釋經中但凡夫之人貪著其事。",
        "translation": "The third verse, simply following sounds, explains that in the sūtras, only ordinary people cling to things.",
        "source": "T25n1512_010:0871a10_10"
    },
    {
        "source_sentence": "明凡夫之人既無如實之解，但有虛妄分別，隨聲取著，聞說色是可見可觸，",
        "translation": "It means that ordinary people have no understanding of things as they really are but falsely discriminate and cling to sounds. When they hear words, form is visible and tangible.",
        "source": "T25n1512_010:0871a11_11"
    },
    {
        "source_sentence": "便謂為實義亦如是可見可觸，故云但隨於音聲也。",
        "translation": "It's then said that the true meaning is also thus visible and tangible, so it's called simply following sounds.",
        "source": "T25n1512_010:0871a13_12"
    },
    {
        "source_sentence": "「凡夫取顛倒」者，聞說色等可見可觸，凡夫便謂色等實有可見可觸，",
        "translation": "Ordinary people take the mistaken view that when they hear that form and so forth are visible and can be touched, ordinary people then say that form and so forth really are visible and can be touched,",
        "source": "T25n1512_010:0871a14_13"
    },
    {
        "source_sentence": "取不實為實，故云凡夫取顛倒也。",
        "translation": "It's called the mistaken attachment of worldlings because they grasp what's not real as real.",
        "source": "T25n1512_010:0871a16_14"
    },
    {
        "source_sentence": "「非無二得道」，此下半偈通第四偈上三句，共釋經中「何以故？",
        "translation": "The second half of this verse doesn't refer to the fourth verse and the first three sentences above, which are commonly explained in the sūtras as why?",
        "source": "T25n1512_010:0871a17_0"
    },
    {
        "source_sentence": "若人如是言至是名我見」等也。",
        "translation": "If someone thus says, 'This is called a view of self' and so forth.",
        "source": "T25n1512_010:0871a18_1"
    },
    {
        "source_sentence": "「非無二得道」者，明諸佛如來非是但得無我無法二空之解名為得道也。",
        "translation": "The phrase non-nondual attainment of the path explains that the buddhas and tathāgatas don't simply attain the understanding that selflessness and nonexistence are not two kinds of emptiness, which is called attaining the path.",
        "source": "T25n1512_010:0871a19_2"
    },
    {
        "source_sentence": "明二乘雖得此三空之解，猶為習惑覆心無明障解故不名得道。",
        "translation": "It means that although the two vehicles attain understanding of these three kinds of emptiness, they still don't call it the path because they cultivate the understanding of the afflictive hindrances that cover mind and ignorance.",
        "source": "T25n1512_010:0871a20_3"
    },
    {
        "source_sentence": "應問：若存此二空不名得道者，見何等法、以何等行能得道也？",
        "translation": "You should ask, If you maintain these two kinds of emptiness and aren't called someone who has attained the path, what teaching and what practice can be used to attain the path?",
        "source": "T25n1512_010:0871a22_4"
    },
    {
        "source_sentence": "故第四句云「遠離於我法」，明要見真如平等究竟深重，解我之以法本來空寂，",
        "translation": "That's why the fourth phrase says, Being far removed from self and dharmas, explains that it's necessary to see the ultimate profundity of equality of true reality, understanding that self is inherently empty and quiescent because dharmas are originally void.",
        "source": "T25n1512_010:0871a23_5"
    },
    {
        "source_sentence": "離於無我無法二空虛妄分別見時乃名得道也。",
        "translation": "When he's free of the false discriminating view of selflessness and nonexistence and the two kinds of emptiness, then he's called attaining the path.",
        "source": "T25n1512_010:0871a25_6"
    },
    {
        "source_sentence": "應言「遠離無我無法見」，以偈俠故，但言離我法也。",
        "translation": "You should say, Being far removed from selflessness and the view that there's nothing to be seen, because it's because of the verse hero, it only says being free of self and dharmas.",
        "source": "T25n1512_010:0871a26_7"
    },
    {
        "source_sentence": "明若謂有我法可空，復自言我能得此二空之解，有此著空之心者，則障於真如菩提，",
        "translation": "It means that if someone maintains that self and dharmas can be empty because they have a self, then they may claim that self can attain the understanding of these two kinds of emptiness. But those who hold to this view of emptiness will prevent them from attaining true enlightenment.",
        "source": "T25n1512_010:0871a27_8"
    },
    {
        "source_sentence": "不名得道。",
        "translation": "It's not called attaining the path.",
        "source": "T25n1512_010:0871a29_9"
    },
    {
        "source_sentence": "明菩薩大士解生陰法體從本以來性相空寂，非假觀無方。",
        "translation": "It explains that the bodhisattva-mahāsattva understands that the dharmas of the aggregate of arising are empty and quiescent in nature since the distant past, not contemplating them as provisionally without direction.",
        "source": "T25n1512_010:0871a29_10"
    },
    {
        "source_sentence": "既無我法可空，亦無二空之見可存，名得道也。",
        "translation": "Since there's no self or dharmas that can be emptiness and no two views of emptiness that can exist, it's called attaining the path.",
        "source": "T25n1512_010:0871b02_11"
    },
    {
        "source_sentence": "此第三偈下長行論中，唯釋下半、不釋上半。",
        "translation": "In this third verse, there's a long line that explains only the second half and doesn't explain the first half.",
        "source": "T25n1512_010:0871b03_12"
    },
    {
        "source_sentence": "所以然者，上長行論中已釋其義，故此中不解也。",
        "translation": "The reason for this is that the meaning has been explained in the long-standing treatise above, so it's not explained here.",
        "source": "T25n1512_010:0871b04_13"
    },
    {
        "source_sentence": "「如經何以故」等，舉下半偈所釋經來，結偈中解意也。",
        "translation": "The phrase why is it like the sūtras? and so forth, which summarizes the meaning of the explanation in the verse by citing the following half a verse that explains the sūtras.",
        "source": "T25n1512_010:0871b05_14"
    },
    {
        "source_sentence": "「此復何義」者，將欲釋偈，問此所引經中明於何義，乃以斯下半偈釋也。",
        "translation": "The phrase what does this mean? means to want to explain the verse and ask what it means in the sūtras cited here, which is the next half of the verse that explains it.",
        "source": "T25n1512_010:0871b06_15"
    },
    {
        "source_sentence": "即以偈答「非無二得道，遠離於我法」故也。",
        "translation": "That's because the verse answers, It's not the nondual attainment of the path that's far removed from self and dharmas.",
        "source": "T25n1512_010:0871b08_16"
    },
    {
        "source_sentence": "「此義云何」者，此偈釋經之義云何？",
        "translation": "What does this mean? What does this verse mean by explaining the meaning of the sūtras?",
        "source": "T25n1512_010:0871b09_17"
    },
    {
        "source_sentence": "下釋可知也。",
        "translation": "The following is an explanation that can be understood.",
        "source": "T25n1512_010:0871b10_18"
    },
    {
        "source_sentence": "「此復何義」者，此無我無法二種見，上雖云離二見而得菩提，然問：此二見應是正解，",
        "translation": "The phrase what does this mean? means that these two kinds of views of selflessness and nonexistence are not possible. Although it's said above that they attain enlightenment apart from the two views, but the question is asked:",
        "source": "T25n1512_010:0871b10_19"
    },
    {
        "source_sentence": "復以何義遠離此見？",
        "translation": "What does it mean to be free of this view?",
        "source": "T25n1512_010:0871b12_20"
    },
    {
        "source_sentence": "故以第四偈答也。",
        "translation": "That's why it's answered in the fourth verse.",
        "source": "T25n1512_010:0871b12_21"
    },
    {
        "source_sentence": "第四偈釋成前半偈。",
        "translation": "The fourth verse explains the accomplishment of the first half of the verse.",
        "source": "T25n1512_010:0871b13_22"
    },
    {
        "source_sentence": "上雖云「非無二得道，遠離於我法」，而未釋所以，其義猶隱故，更作此偈上三句釋也。",
        "translation": "Although the above statement says, It's not that there are no two kinds of attainment of the path and they're far removed from self and dharmas, but it doesn't explain why, because its meaning is still hidden; it further explains the three phrases above this verse in three ways.",
        "source": "T25n1512_010:0871b13_23"
    },
    {
        "source_sentence": "「見我即不見」者，明見有我而可空，道言我見無我者，此非正見究竟深解，",
        "translation": "Seeing self and not seeing it means to clearly see that there's a self but can be emptiness, and the path says that seeing self and no-self is not right view, which is ultimately profound understanding.",
        "source": "T25n1512_010:0871b15_24"
    },
    {
        "source_sentence": "故云見我即不見也。",
        "translation": "That's why it's said that seeing self means not seeing.",
        "source": "T25n1512_010:0871b17_25"
    },
    {
        "source_sentence": "亦應言「見法即不見」，宜以偈俠故，單言見我，不云見法也。",
        "translation": "It should also be said, Seeing the Dharma means not seeing it. It's better to use the verse because it's a verse that simply says you see me and don't say you see the Dharma.",
        "source": "T25n1512_010:0871b17_26"
    },
    {
        "source_sentence": "何故見我名為不見者？",
        "translation": "Why is seeing self called not seeing?",
        "source": "T25n1512_010:0871b19_27"
    },
    {
        "source_sentence": "故第二句云「無實」。",
        "translation": "That's why the second phrase says, There's no reality.",
        "source": "T25n1512_010:0871b19_28"
    },
    {
        "source_sentence": "若無實者，何故見有？",
        "translation": "If they are insubstantial, then why do they appear to exist?",
        "source": "T25n1512_010:0871b20_29"
    },
    {
        "source_sentence": "明以虛妄見故，言「無實虛妄見」也。",
        "translation": "It explains that it's because of false views that they say, There's no true false view.",
        "source": "T25n1512_010:0871b20_30"
    },
    {
        "source_sentence": "此上二句，釋前偈「非無二得道」也。",
        "translation": "These two phrases above explain the previous verse, Not nondual attainment of the path.",
        "source": "T25n1512_010:0871b21_31"
    },
    {
        "source_sentence": "「此是微細障」者，明著有之心名為塵惑，存無之心名之為細。",
        "translation": "The phrase this is a subtle hindrance explains that the mind attached to existence is called dust mental disturbance, and the mind that exists and doesn't exist is called subtle.",
        "source": "T25n1512_010:0871b22_32"
    },
    {
        "source_sentence": "此存我法二空之見，無明之惑體，非四住麁或，以礙於真如勝解故，云微細障也。",
        "translation": "This preserves the view of self and dharmas as two kinds of emptiness, which are the essence of the afflictive tendencies of ignorance, not the four abodes or debilitating hindrances, because they obstruct the ultimate understanding of true reality and are called subtle hindrances.",
        "source": "T25n1512_010:0871b23_33"
    },
    {
        "source_sentence": "「見真如遠離」者此一句，釋經中菩薩發三菩提心，明此細惑要證初地解時，",
        "translation": "The phrase seeing the true nature is far removed explains that in the sūtras, the bodhisattva arouses the three minds of enlightenment and explains that when these subtle afflictions are essential to realize the understanding of the first ground,",
        "source": "T25n1512_010:0871b25_34"
    },
    {
        "source_sentence": "現見真如究竟深理，遣此虛妄分別，爾時乃盡，故言見真如遠離也。",
        "translation": "He now sees the ultimate profound principle of true reality and dispels this false discrimination, and then he ends it, so he says he's far removed from views of true reality.",
        "source": "T25n1512_010:0871b26_35"
    },
    {
        "source_sentence": "此二句釋遠離於我法也。",
        "translation": "These two phrases explain that they're far removed from self and dharmas.",
        "source": "T25n1512_010:0871b28_36"
    },
    {
        "source_sentence": "「是故見即不見至見法亦是不見」，此釋上半偈也。",
        "translation": "This is the first half of the verse that explains that views are not seen up to the point where views and dharmas are also not seen.",
        "source": "T25n1512_010:0871b29_37"
    },
    {
        "source_sentence": "「是故見即不見」，釋初句也。",
        "translation": "Therefore, seeing is not seeing, which is the first phrase of the explanation.",
        "source": "T25n1512_010:0871c01_38"
    },
    {
        "source_sentence": "「無其實義，以虗妄分別」，釋第二句也。",
        "translation": "There's no real meaning, but it's falsely discriminated in terms of crudeness and delusion, which explains the second phrase.",
        "source": "T25n1512_010:0871c01_39"
    },
    {
        "source_sentence": "「以是無我」者，結句也。",
        "translation": "The phrase 'because it's selfless' is a concluding phrase.",
        "source": "T25n1512_010:0871c02_40"
    },
    {
        "source_sentence": "「是故如來說彼我見即是不見」者，引佛成言為證也。",
        "translation": "The phrase therefore, the Tathāgata teaches that this view of self is not seeing refers to the Buddha's accomplishment of words as proof.",
        "source": "T25n1512_010:0871c03_41"
    },
    {
        "source_sentence": "「以其無實至我見不見故」，論主解如來證也。",
        "translation": "Because they lack reality up to the point where they don't see self, the treatise leader understands that the Tathāgata realizes it.",
        "source": "T25n1512_010:0871c04_42"
    },
    {
        "source_sentence": "「見法者亦是不見」者，偈中無文故，別提類釋也。",
        "translation": "Seeing the teaching is also not seeing because there's no text in the verse, so it's a specific interpretation of type.",
        "source": "T25n1512_010:0871c05_43"
    },
    {
        "source_sentence": "「如經菩薩發三菩提心」以下，此為經前偈第四句，明菩薩得真如解，",
        "translation": "Just as the sūtras say, bodhisattvas give rise to the mind of the three kinds of enlightenment, this is the fourth phrase in the first verse of the sutra that explains that bodhisattvas attain true understanding of reality.",
        "source": "T25n1512_010:0871c06_44"
    },
    {
        "source_sentence": "不存無我無法以之為正見故，復為形前存無我無法為不正見故引來也。",
        "translation": "It's because they don't exist without self and lack dharmas that they can be correctly viewed, and it's also because they exist without self before form and lack dharmas that they are not correctly viewed that they're cited.",
        "source": "T25n1512_010:0871c07_45"
    },
    {
        "source_sentence": "「此復何義」者，此何故引菩薩見法相經形前二見名為不見也？",
        "translation": "What does this mean? Why is it that the first two views in the form of the bodhisattva's view of the sūtra on the characteristics of dharmas are called not seeing?",
        "source": "T25n1512_010:0871c09_46"
    },
    {
        "source_sentence": "即答「以見法相即不見相」，明以存得無法相見者即是不見法相也。",
        "translation": "That's the answer, Seeing the characteristics of things means not seeing characteristics, which explains that those who see characteristics without characteristics because they exist are those who don't see characteristics, which means they don't see characteristics.",
        "source": "T25n1512_010:0871c11_0"
    },
    {
        "source_sentence": "「如彼我見即非見」者，存無我見為正見者亦非見也。",
        "translation": "Just as that view of self is what's not view, this means that maintaining the view of selflessness as right view is also not view.",
        "source": "T25n1512_010:0871c12_1"
    },
    {
        "source_sentence": "「何故此二見說名不見」者，將欲釋下半偈故作問生起，問此無我無法二見應是正解，",
        "translation": "The reason why these two views are called invisible is because they want to explain the next half of the verse and therefore ask questions that arise, asking whether these two views of selflessness and nonexistence should be correctly understood.",
        "source": "T25n1512_010:0871c13_2"
    },
    {
        "source_sentence": "何故說為不見也？",
        "translation": "Why is it said to be invisible?",
        "source": "T25n1512_010:0871c15_3"
    },
    {
        "source_sentence": "即以下半偈答「此是微細障，見真如遠離」也。",
        "translation": "The next half of the verse answers, This is a subtle hindrance that's far removed from seeing the true nature.",
        "source": "T25n1512_010:0871c16_4"
    },
    {
        "source_sentence": "「此復云何」者，問此偈中以此二見為微細障，云「見真如遠離」，此復云何也？",
        "translation": "What are these two views the subtle hindrances that are asked in this verse, Seeing the true nature is far removed, and what are these?",
        "source": "T25n1512_010:0871c17_5"
    },
    {
        "source_sentence": "即釋「彼見我見法，此是細障」者，結二見為障名。",
        "translation": "That is, the explanation that says, 'They see self and see dharmas, which are subtle hindrances' concludes by saying that the two views are called hindrances.",
        "source": "T25n1512_010:0871c18_6"
    },
    {
        "source_sentence": "以不見彼二故者，釋作障義也。",
        "translation": "It's because they don't see those two, which explains the meaning of being an obstruction.",
        "source": "T25n1512_010:0871c19_7"
    },
    {
        "source_sentence": "「是以見法以為得遠離」者，此二見，於聲聞無妨、於菩薩為患，故見真如遠離也。",
        "translation": "That's why they see the teaching in order to attain seclusion means that these two views are not hindrances for śrāvakas and bodhisattvas, so they see true reality as seclusion.",
        "source": "T25n1512_010:0871c20_8"
    },
    {
        "source_sentence": "「又如是知」等，上已引結前偈，何故此中復牒來也？",
        "translation": "Again, thus do you know? and so forth, the above quote concludes with the previous verse, why is this also an explanation of the source here?",
        "source": "T25n1512_010:0871c22_9"
    },
    {
        "source_sentence": "前偈中但釋得此知見信者皆離無我無法細障，猶未解知、見、信義，今將作偈釋故更舉來耳。",
        "translation": "The first verse only explains that those who attain this knowledge and see and believe in it are all free of selflessness and the absence of subtle hindrances, but they still don't understand knowing, seeing, or believing, so I'll explain it again in verse.",
        "source": "T25n1512_010:0871c23_10"
    },
    {
        "source_sentence": "第五偈「二智及三昧，如是得遠離」者，此上二句釋經中菩薩發阿耨三菩提心應如是知見信等也。",
        "translation": "The fifth verse, The two kinds of cognition and samādhi are thus attained in seclusion means that the above two phrases explain that bodhisattvas who give rise to the mind of unsurpassed enlightenment in the sūtras should thus know and see and believe.",
        "source": "T25n1512_010:0871c25_11"
    },
    {
        "source_sentence": "所以明此者，上云存二空之人有細障在心，故不名得道。",
        "translation": "That's why it's explained here, because the above saying is that people who preserve the two kinds of emptiness have subtle hindrances in their minds, so they aren't called attaining the path.",
        "source": "T25n1512_010:0871c27_12"
    },
    {
        "source_sentence": "明見真如者皆遠離細障，名為得道。",
        "translation": "It explains that those who see the true nature are all free of subtle hindrances, which is called attaining the path.",
        "source": "T25n1512_010:0871c29_13"
    },
    {
        "source_sentence": "未知何等人，能見真如、遠離細障？",
        "translation": "I don't know which people can see the true nature and be free of subtle hindrances?",
        "source": "T25n1512_010:0871c29_14"
    },
    {
        "source_sentence": "今辨出二種菩薩具足功德智慧，見真如深理，能離細障所明也。",
        "translation": "Now, we'll explain two kinds of bodhisattvas who are endowed with merit and wisdom that see the profound principle of true reality and can be freed from the subtle hindrances that are explained.",
        "source": "T25n1512_010:0872a01_15"
    },
    {
        "source_sentence": "「二智」者，地前世智、地上第一義智，此是二智。",
        "translation": "The term two kinds of cognition refers to worldly cognition prior to the ground and the first meaningful cognition on the ground, which are two kinds of cognition.",
        "source": "T25n1512_010:0872a03_16"
    },
    {
        "source_sentence": "世智者，釋經中「如是知」也。",
        "translation": "Worldly cognition refers to the explanation in the sūtras that it's thus known.",
        "source": "T25n1512_010:0872a04_17"
    },
    {
        "source_sentence": "第一義智，釋經中「如是見」也。",
        "translation": "The first is cognition of meaning, which explains the sūtra's view that it's like this.",
        "source": "T25n1512_010:0872a04_18"
    },
    {
        "source_sentence": "「及三昧」者，離垢等無量三昧，釋經中「如是信」也。",
        "translation": "The phrase and samādhi refers to the immeasurable samādhi of freedom from defilement and so forth, which explains that the sūtras say thus faith.",
        "source": "T25n1512_010:0872a05_19"
    },
    {
        "source_sentence": "故云二智及三昧也。",
        "translation": "That's why it's called the two kinds of cognition and samādhi.",
        "source": "T25n1512_010:0872a06_20"
    },
    {
        "source_sentence": "「如是得遠離」者，明具智慧、三昧二種功德之人，得理究竟，能離細障也。",
        "translation": "Thus attaining seclusion means that someone who possesses the two kinds of virtue of wisdom and samādhi will attain the ultimate truth and be able to part with the subtle hindrances.",
        "source": "T25n1512_010:0872a06_21"
    },
    {
        "source_sentence": "「化身示現福」者，前經中有人生疑：化佛既不脩行斷惑、不證菩提，",
        "translation": "The phrase the transformation body shows merit means that there's a doubt in the previous sūtra: since the transformation buddha doesn't cultivate practice to end mental disturbances and doesn't realize enlightenment,",
        "source": "T25n1512_010:0872a08_22"
    },
    {
        "source_sentence": "亦不說法，有生滅去來，非是實佛，供養之者，為有福德、為無福德也？",
        "translation": "Nor does he teach the Dharma that there's birth and cessation in the past and future, which aren't real buddhas, and those who make offerings to them have merit or no merit?",
        "source": "T25n1512_010:0872a10_23"
    },
    {
        "source_sentence": "若得福德，與供養真佛，為有差降、為無差降？",
        "translation": "If someone attains merit and makes offerings to the true Buddha, is there a difference or no difference between them?",
        "source": "T25n1512_010:0872a11_24"
    },
    {
        "source_sentence": "惡心毀害，其罪云何？",
        "translation": "What is the sin of harming others with evil intentions?",
        "source": "T25n1512_010:0872a12_25"
    },
    {
        "source_sentence": "故答「化身示現福，非無無盡福」，明化佛雖不修行證果，然由真身為本，",
        "translation": "That's why the answer, The transformation body shows merit, not infinite and inexhaustible merit, explains that although the transformation buddha doesn't cultivate practice and realize its fruit, it's because of the root of the true body that he does so.",
        "source": "T25n1512_010:0872a13_26"
    },
    {
        "source_sentence": "而眾生有感，聖則赴感垂應。",
        "translation": "When sentient beings have feelings, the noble ones go to feeling and respond.",
        "source": "T25n1512_010:0872a14_27"
    },
    {
        "source_sentence": "以此應佛從真處來，與彼二佛有其一義，復不言我是化佛，故供養化佛所得功德與真佛不異。",
        "translation": "Because this response Buddha comes from the true place, it has one meaning with those two buddhas and doesn't say that I am a transformation Buddha, so the merit gained by offering support to a transformation Buddha isn't different from the true Buddha.",
        "source": "T25n1512_010:0872a15_28"
    },
    {
        "source_sentence": "示現有福，非無無盡之福，有無量無邊功德故。",
        "translation": "It shows that there's merit present, not inexhaustible merit because it has measureless and limitless merit.",
        "source": "T25n1512_010:0872a17_29"
    },
    {
        "source_sentence": "經引七寶施福雖多，而不如供養化佛，亦不及受化佛所說經教得福多也。",
        "translation": "Although the sūtras cite seven treasures and give a lot of merit, they aren't as good as making offerings to the transformation buddhas, nor are they as good as receiving the teachings taught by the transformation buddhas and attaining much merit.",
        "source": "T25n1512_010:0872a18_30"
    },
    {
        "source_sentence": "然經中但辨受持化佛所說經尚勝七寶布施之福，明知供養化佛亦勝七寶施福也。",
        "translation": "However, the sūtras simply identify the merit of accepting and upholding the sūtras taught by the transformation buddhas as superior to the merit of seven-jeweled generosity, which shows that making offerings to the transformation buddhas is also superior to the merit of seven-jeweled generosity.",
        "source": "T25n1512_010:0872a20_31"
    },
    {
        "source_sentence": "此二句，釋經中「若有發菩提心者至無量阿僧祇」也。",
        "translation": "These two phrases explain that the sūtra says, If someone gives rise to the mind of enlightenment, they'll reach measureless incalculability.",
        "source": "T25n1512_010:0872a22_32"
    },
    {
        "source_sentence": "「此義云何？",
        "translation": "What does this mean?",
        "source": "T25n1512_010:0872a23_33"
    },
    {
        "source_sentence": "示現世智至遠離彼障」，釋偈上二句也。",
        "translation": "Showing worldly cognition up to the point where they're free of those hindrances explains the two phrases above the verse.",
        "source": "T25n1512_010:0872a23_34"
    },
    {
        "source_sentence": "「是故重說勝福譬喻」者，釋下半偈。",
        "translation": "That's why he repeatedly explains the parable of superior merit, which is explained in the next half of the verse.",
        "source": "T25n1512_010:0872a25_0"
    },
    {
        "source_sentence": "「是故」者，是上有人疑：供養應佛及受持應佛所說，為有福德、為無福德？",
        "translation": "Therefore, this is a person who doubts whether there's merit or no merit in making offerings to the Buddha and retaining what he teaches.",
        "source": "T25n1512_010:0872a25_1"
    },
    {
        "source_sentence": "故我引勝福德譬喻釋彼疑也。",
        "translation": "Therefore, I'll cite the parable of superior merit to explain their doubts.",
        "source": "T25n1512_010:0872a27_2"
    },
    {
        "source_sentence": "「云何為人演說而不名為說」等，何故如是說者，將欲設偈釋此經文故，",
        "translation": "How can it be explained for the sake of others and not called 'explanation' etc. Why does he explain it in this way, because he wants to define the text of this sūtra in verses,",
        "source": "T25n1512_010:0872a28_3"
    },
    {
        "source_sentence": "提來為問。",
        "translation": "Did he ask a question?",
        "source": "T25n1512_010:0872a29_4"
    },
    {
        "source_sentence": "問：此經為若人演說，應名為說。",
        "translation": "Question: This scripture should be called ‘exposition’ if someone expounds it.",
        "source": "T25n1512_010:0872b01_0"
    },
    {
        "source_sentence": "何故乃云不名為說？",
        "translation": "Why is it said not to be called a teaching?",
        "source": "T25n1512_010:0872b01_1"
    },
    {
        "source_sentence": "故云何故如是說。",
        "translation": "That's why it's said in this way.",
        "source": "T25n1512_010:0872b02_2"
    },
    {
        "source_sentence": "第六說「諸佛說法時」一偈，釋經中「云何為人演說而不名說」等經文也。",
        "translation": "The sixth verse says, When the buddhas teach the Dharma, is an explanation of the sūtras that say, How can we explain it for others without naming it? and so forth.",
        "source": "T25n1512_010:0872b02_3"
    },
    {
        "source_sentence": "經中疑云：以化佛不實故，所說經教亦應是不正說。",
        "translation": "It's doubted in the sūtras that because the transformation buddhas aren't real, the sūtras and teachings explained should also be incorrectly explained.",
        "source": "T25n1512_010:0872b04_4"
    },
    {
        "source_sentence": "以有此疑故，偈釋云「諸佛說法時，不言是化身」也。",
        "translation": "Because of this doubt, the verse explains, When the buddhas teach the Dharma, they don't say it's the transformation body.",
        "source": "T25n1512_010:0872b05_5"
    },
    {
        "source_sentence": "「說法時」者，眾生有感，無有八難，受道時也。",
        "translation": "When he teaches the Dharma, sentient beings have feelings, and there are no eight difficulties at the time when they receive the path.",
        "source": "T25n1512_010:0872b06_6"
    },
    {
        "source_sentence": "明應佛赴眾生感，說法之時，雖化身不實，而所說言教是其正說。",
        "translation": "It means that when the response Buddha goes to sentient beings and teaches the Dharma, even though his transformation body isn't real, the words he teaches are their correct teaching.",
        "source": "T25n1512_010:0872b07_7"
    },
    {
        "source_sentence": "所以爾者，下句云「不言是化身」，明化身佛為眾生說法時，不道我是化佛。",
        "translation": "The reason for this is that the next sentence says, They don't say it's the transformation body, which explains that when the transformation body Buddha teaches to sentient beings, they don't say I am the transformation Buddha.",
        "source": "T25n1512_010:0872b09_8"
    },
    {
        "source_sentence": "若言我是化佛，可化眾生不生敬心。",
        "translation": "If someone says I am a transformation buddha, they can transform sentient beings without paying respect to them.",
        "source": "T25n1512_010:0872b10_9"
    },
    {
        "source_sentence": "既不敬信，則雖化無益，故不云我是化佛。",
        "translation": "Since they don't respect and believe it, then even though their transformation is useless, they won't say that I am the transformation buddha.",
        "source": "T25n1512_010:0872b11_10"
    },
    {
        "source_sentence": "以不言是化佛故，所說經教眾生信受，有多利益，即是正說。",
        "translation": "Because they don't say it's the transformation buddha, the sūtras that are taught teach sentient beings to believe and accept them will have many benefits, which is precisely the correct teaching.",
        "source": "T25n1512_010:0872b12_11"
    },
    {
        "source_sentence": "故下半偈云「以不如是說，是故彼說正」也。",
        "translation": "That's why the next half of the verse says, Because they don't explain it this way, they therefore explain it correctly.",
        "source": "T25n1512_010:0872b13_12"
    },
    {
        "source_sentence": "「一切有為法，如星翳燈」等者，此一偈是第十一段經，名為不住道分。",
        "translation": "The phrase all conditioned dharmas are like stars shining brightly like lamps means that this verse is the eleventh section of the sutra, which is called the part of the path of nonabiding.",
        "source": "T25n1512_010:0872b15_0"
    },
    {
        "source_sentence": "此經何故名為不住道者？",
        "translation": "Why is this sūtra called the one who does not abide in the path?",
        "source": "T25n1512_010:0872b16_1"
    },
    {
        "source_sentence": "明諸佛如來以出世妙智，觀九種有為即是涅槃故。",
        "translation": "It explains that the buddhas and tathāgatas use supramundane marvelous wisdom to observe nine kinds of conditioned things, which are nirvāṇa.",
        "source": "T25n1512_010:0872b17_2"
    },
    {
        "source_sentence": "不同凡夫樂著世間，復不同二乘樂住涅槃。",
        "translation": "It's not like ordinary people who happily cling to the world, and it's not like the two vehicles who happily abide in nirvāṇa.",
        "source": "T25n1512_010:0872b18_3"
    },
    {
        "source_sentence": "不住此二道故，曰不住道也。",
        "translation": "Because they don't abide in these two paths, it's called not abiding in the path.",
        "source": "T25n1512_010:0872b19_4"
    },
    {
        "source_sentence": "此所以來者，為釋疑故也。",
        "translation": "The reason for this is to explain the doubts.",
        "source": "T25n1512_010:0872b20_0"
    },
    {
        "source_sentence": "前段微塵喻經，明諸佛如來成正覺時，斷二障盡故，於真法界中非一處住、不異處住。",
        "translation": "The first paragraph of the sutra on the metaphor of the tiny dust explains that when the buddhas and tathāgatas become perfectly enlightened, they end the two hindrances and therefore don't abide in one place or different places in the true Dharma realm.",
        "source": "T25n1512_010:0872b20_1"
    },
    {
        "source_sentence": "便生疑云：諸佛如來，為如彼微塵體空畢竟無身？",
        "translation": "They then had doubts, saying, Are the buddhas and tathāgatas like those tiny dusty bodies of emptiness ultimately without body?",
        "source": "T25n1512_010:0872b22_2"
    },
    {
        "source_sentence": "為實有身也？",
        "translation": "Why is there really a body?",
        "source": "T25n1512_010:0872b23_3"
    },
    {
        "source_sentence": "若有身者，身應有住處，何故言非一處住、非異處住也？",
        "translation": "If there were a body, the body would have an abode, so why would it be said that it doesn't abide in one place and doesn't abide in different places?",
        "source": "T25n1512_010:0872b24_0"
    },
    {
        "source_sentence": "若有住處者，為世間中住？",
        "translation": "If someone has a place to live, are they living in the world?",
        "source": "T25n1512_010:0872b25_1"
    },
    {
        "source_sentence": "為涅槃中住也？",
        "translation": "Is it abiding in nirvāṇa?",
        "source": "T25n1512_010:0872b25_2"
    },
    {
        "source_sentence": "若世間中住，何故前段經云如來入涅槃去？",
        "translation": "If he were to abide in the world, why did the previous section of the sutra say that the Tathāgata entered nirvāṇa and departed?",
        "source": "T25n1512_010:0872b26_3"
    },
    {
        "source_sentence": "若涅槃中住，復何故言如來來在世間，常為眾生說法？",
        "translation": "If someone were to abide in nirvāṇa, why would they say that the Tathāgata is in the world and always expounds the Dharma for sentient beings?",
        "source": "T25n1512_010:0872b27_4"
    },
    {
        "source_sentence": "為釋此疑故，引九種有為法譬喻答之。",
        "translation": "In order to explain this doubt, he cites nine kinds of metaphors and metaphors for artificial dharmas to answer it.",
        "source": "T25n1512_010:0872b28_5"
    },
    {
        "source_sentence": "明諸佛如來有十力無畏無量功德真實妙身，此身以不住道為住處。",
        "translation": "It explains that the buddhas and tathāgatas have ten powers, fearlessness, immeasurable merit, and a truly marvelous body of true virtue, which is the abode of those who don't abide in the path.",
        "source": "T25n1512_010:0872b29_6"
    },
    {
        "source_sentence": "云何不住道？",
        "translation": "How is it that they don't abide in the path?",
        "source": "T25n1512_010:0872c01_7"
    },
    {
        "source_sentence": "謂不住世間、不住涅槃。",
        "translation": "It means they don't abide in the world and don't abide in nirvāṇa.",
        "source": "T25n1512_010:0872c02_8"
    },
    {
        "source_sentence": "明諸佛如來，解九種有為法體是虛偽本來空寂，悟真如平等，知世間實性即是涅槃，",
        "translation": "The buddha-tathāgatas understand that the essence of these nine kinds of conditioned dharmas is false and originally void. They realize the equality of reality, knowing that the real nature of the world is nirvana.",
        "source": "T25n1512_010:0872c02_9"
    },
    {
        "source_sentence": "斷生死因盡，是故不住世間。",
        "translation": "It stops the causes of birth-and-death and therefore doesn't abide in the world.",
        "source": "T25n1512_010:0872c04_10"
    },
    {
        "source_sentence": "不同凡夫不解世間有為諸法本來空寂，起取著之行，故住於世間也。",
        "translation": "Unlike ordinary people who don't understand that worldly conditioned dharmas are originally empty and quiescent, they give rise to the practice of apprehension and attachment, so they abide in the world.",
        "source": "T25n1512_010:0872c05_11"
    },
    {
        "source_sentence": "既見真如平等故，解世間實性即是涅槃，世間涅槃無二無別；",
        "translation": "Because they see the equality of true suchness, they understand that worldly reality is nirvana. Worldly nirvana has no duality or distinction.",
        "source": "T25n1512_010:0872c06_12"
    },
    {
        "source_sentence": "又具慈悲大願故，常處生死教化眾生，是故不住涅槃。",
        "translation": "Because they possess the great vow of compassion, they always remain in birth-and-death and teach sentient beings; therefore, they don't abide in nirvāṇa.",
        "source": "T25n1512_010:0872c08_13"
    },
    {
        "source_sentence": "不同二乘不知一切眾生皆有真如佛性平等無二故，見涅槃異世間，厭背世間、忻樂涅槃，",
        "translation": "Unlike the two vehicles, they do not know that all sentient beings possess the buddha-nature of reality. Because their buddha-nature is equanimous and nondual, they see nirvana as different from the world, are disgusted with distancing themselves from the world, and delight in nirvana.",
        "source": "T25n1512_010:0872c09_14"
    },
    {
        "source_sentence": "中道取證故住於涅槃。",
        "translation": "The middle way takes the realization and therefore abides in nirvāṇa.",
        "source": "T25n1512_010:0872c11_15"
    },
    {
        "source_sentence": "諸佛如來以此不住道為住處，故次明也。",
        "translation": "The buddhas and tathāgatas make this nonabiding path their dwelling place, so they're explained in order.",
        "source": "T25n1512_010:0872c11_16"
    },
    {
        "source_sentence": "「一切有為法如星翳燈幻」等，此一偈經是如來所說，非論主所造。",
        "translation": "All conditioned dharmas are like stars, flames, lamps, illusions, and so forth, this one verse of the sūtra is taught by the Tathāgata, not created by the treatise master.",
        "source": "T25n1512_010:0872c12_17"
    },
    {
        "source_sentence": "「一切有為法」者，將欲引九種喻，喻九種有為法故，總舉一切有為法也。",
        "translation": "The phrase all conditioned dharmas refers to the nine kinds of metaphors that are cited because it's a metaphor for the nine kinds of conditioned dharmas, which are summarized as all conditioned dharmas.",
        "source": "T25n1512_010:0872c14_18"
    },
    {
        "source_sentence": "「如星翳燈」，此三喻偈，論合云「見相識」；",
        "translation": "These three metaphors are combined in the treatise as seeing characteristics and consciousnesses.",
        "source": "T25n1512_010:0872c15_19"
    },
    {
        "source_sentence": "「幻露泡」中三喻偈，論合云「器身受用」；",
        "translation": "The three metaphors in illusory and unmanifest bubbles are combined into one treatise, which says that the container body experiences its function.",
        "source": "T25n1512_010:0872c16_20"
    },
    {
        "source_sentence": "「夢電雲」下三喻偈，論合云「過現未來」。",
        "translation": "The next three metaphors under dream cloud of lightning and the following three metaphors are combined in the treatise as past, present, and future.",
        "source": "T25n1512_010:0872c17_21"
    },
    {
        "source_sentence": "明上六種有為，三世中轉也。",
        "translation": "It explains that the above six kinds of conditioned things are transformed in the three times.",
        "source": "T25n1512_010:0872c18_22"
    },
    {
        "source_sentence": "前微塵喻，直說六塵境中，以明有為法體空也。",
        "translation": "The preceding metaphor of the tiny particle directly explains that in the six objects, it's to explain the emptiness of the essence of conditioned dharmas.",
        "source": "T25n1512_010:0872c19_23"
    },
    {
        "source_sentence": "此九種譬喻，據能緣內心，以明法體空。",
        "translation": "These nine kinds of metaphors are explained in terms of the emptiness of the essence of dharmas by relying on the mind that can refer to them.",
        "source": "T25n1512_010:0872c20_24"
    },
    {
        "source_sentence": "問：此九種，若明內心體空，何故亦有世界身等外無記法？",
        "translation": "Question: If these nine kinds were to clarify the emptiness of the essence of internal matter, then why would there also be indeterminate factors outside of the world-body, etc.?",
        "source": "T25n1512_010:0872c21_0"
    },
    {
        "source_sentence": "答意雖通明外色等法，大意舉境明心空也。",
        "translation": "Answer Although the idea is to explain external forms and so forth in general, the main idea is to explain emptiness of mind by citing objects.",
        "source": "T25n1512_010:0872c22_1"
    },
    {
        "source_sentence": "「如星」者，喻內能見心。",
        "translation": "Like a star is a metaphor for the mind that's capable of seeing within.",
        "source": "T25n1512_010:0872c23_2"
    },
    {
        "source_sentence": "所以內能見心喻之以星，外道凡夫多計日月星辰是常故實，亦計內心是常是實，",
        "translation": "Therefore, they can see the mind internally and metaphorically refer to it as a star. Many non-Buddhist ordinary people believe that the sun, moon, stars, and planets are permanent because they are real, and they also believe that what's permanent within the mind is real.",
        "source": "T25n1512_010:0872c23_3"
    },
    {
        "source_sentence": "是故就其情計以破之。",
        "translation": "That's why they conceptualize it in terms of their feelings to refute it.",
        "source": "T25n1512_010:0872c25_4"
    },
    {
        "source_sentence": "明日月星辰迭相形奪遷轉不定故，所以不實，心法亦然，少分相似故，",
        "translation": "Because the shapes of the moons and stars of the future are not always the same. The mind and its mental states are likewise, because they resemble each other in a small part.",
        "source": "T25n1512_010:0872c26_5"
    },
    {
        "source_sentence": "喻之如天上星宿。",
        "translation": "It's a metaphor for the stars and constellations in heaven.",
        "source": "T25n1512_010:0872c27_6"
    },
    {
        "source_sentence": "日未出時，處空顯現，有昭物之用。",
        "translation": "When the sun does not yet rise, space is manifested. This has the function of revealing things.",
        "source": "T25n1512_010:0872c28_7"
    },
    {
        "source_sentence": "日既出已，光明悉滅，雖有不現，以大小相奪故。",
        "translation": "When the sun has emerged, all its light disappears. Although it exists, it does not appear: because large and small are separated from one another.",
        "source": "T25n1512_010:0872c29_8"
    },
    {
        "source_sentence": "能見心法亦復如是，未有出世證智無漏聖解起時，妄想心法有取境之用。",
        "translation": "So it is with the mind and dharmas that are capable of seeing, because when there's no supramundane realized knowledge or uncontaminated noble understanding that arises, deludedly conceiving mind and dharmas have the function of grasping objects.",
        "source": "T25n1512_010:0873a01_9"
    },
    {
        "source_sentence": "聖解既起，妄想心法殄滅無餘，以其不實故也。",
        "translation": "When holy resolve arises, deluded conceptions and mind and dharmas crudely cease without remainder because they aren't real.",
        "source": "T25n1512_010:0873a02_10"
    },
    {
        "source_sentence": "如是觀時，解能見六識本來空寂皆何等法也。",
        "translation": "When he observes them in this way, he understands what dharmas are the originally empty and quiescent of the six consciousnesses that can be seen.",
        "source": "T25n1512_010:0873a03_11"
    },
    {
        "source_sentence": "二、如翳者，亦喻能見心。",
        "translation": "2. Like a dispute, it's also a metaphor for the mind that's capable of seeing.",
        "source": "T25n1512_010:0873a05_12"
    },
    {
        "source_sentence": "此第二意，何異於初？",
        "translation": "What's the difference between this second meaning and the first?",
        "source": "T25n1512_010:0873a05_13"
    },
    {
        "source_sentence": "有小乘人計云：何以得知心心法是實？",
        "translation": "Some people of the lesser vehicle think, How can we know that mind and mental states are real?",
        "source": "T25n1512_010:0873a06_14"
    },
    {
        "source_sentence": "以其能見前境能取六塵故，是如實故，喻之如翳。",
        "translation": "It's because they can see the prior object and grasp the six dust motes, which are metaphors for being like space.",
        "source": "T25n1512_010:0873a06_15"
    },
    {
        "source_sentence": "以小乘人取謂翳揵闥婆城等是虛妄不實，能見六識及所見六塵是實故。",
        "translation": "It's because the lesser vehicle people take the claim that the city of ambrosia and so forth are false and unreal, and they can see the six consciousnesses and the six dust motes that are seen as real.",
        "source": "T25n1512_010:0873a08_16"
    },
    {
        "source_sentence": "如來就其所解，引以喻之，破其所執也。",
        "translation": "In terms of what they understand, the Tathāgata cites it as a metaphor to refute their attachment.",
        "source": "T25n1512_010:0873a09_17"
    },
    {
        "source_sentence": "如人目上有翳，於虛空中妄見毛輪等色，以之為實。",
        "translation": "It's like when a person's eye has a space on it and falsely sees such forms as hair curls in space, which are taken to be real.",
        "source": "T25n1512_010:0873a10_18"
    },
    {
        "source_sentence": "觀有為法心亦復如是，於色等有為虛妄法中，謂不實為實，以心倒取境故也。",
        "translation": "Observing the mind of conditioned dharmas is likewise, and in such conditioned false dharmas as form that aren't real because it mistakenly grasps objects with its mind.",
        "source": "T25n1512_010:0873a11_19"
    },
    {
        "source_sentence": "三、如燈者，亦喻能見心。",
        "translation": "3. Like a lamp, it's also a metaphor for the mind that can see.",
        "source": "T25n1512_010:0873a13_20"
    },
    {
        "source_sentence": "此第三何異前二也？",
        "translation": "Why is the third one different from the first two?",
        "source": "T25n1512_010:0873a14_21"
    },
    {
        "source_sentence": "解云：二乘外道皆見皆知水流燈炎遷轉不亭，故就其所識以曉之，故以燈喻之內識也。",
        "translation": "The explanation says, All the two-vehicle non-Buddhists see that water flows and the lamp's flame doesn't rise; therefore, they use what they know to illuminate it, so they use the lamp as a metaphor for internal consciousness.",
        "source": "T25n1512_010:0873a14_22"
    },
    {
        "source_sentence": "如世人燃燈，要以清油淨炷及以燈爐，三法相假後方得燃。",
        "translation": "It's like when people in the world burn a lamp, they must use a pure wick of oil and a torch for it to be burned, and the three things are mutually exclusive and can only be burned later.",
        "source": "T25n1512_010:0873a16_23"
    },
    {
        "source_sentence": "識法亦爾，要假根塵和合，因貪愛等或識法得起，有取境之用。",
        "translation": "Consciousness and dharmas are likewise, for it is only through the conjunction of faculties, dust, and atoms that they arise. It may be by reason of such [things] as greed, etc., or it may be because of consciousness and dharmas:",
        "source": "T25n1512_010:0873a18_0"
    },
    {
        "source_sentence": "證智起時，此識寂然無取境之用，以其即體不實虛妄故也。",
        "translation": "When the cognition of realization arises, this consciousness is tranquil and lacks the function of apprehending objects because its essence isn't really false.",
        "source": "T25n1512_010:0873a19_1"
    },
    {
        "source_sentence": "此能見心既不實如是，背何等法、趣何等法也？",
        "translation": "Since this mind that's capable of seeing is not really like this, what teaching does it reject and what teaching does it aspire to?",
        "source": "T25n1512_010:0873a20_2"
    },
    {
        "source_sentence": "四、如幻者，如世間幻師，幻作四兵及男女等，種種隨意自在悉見，而無真實。",
        "translation": "4. Like an illusion, it's like a worldly illusionist who creates four armies of illusions and men and women, which are freely seen as they wish but don't really exist.",
        "source": "T25n1512_010:0873a22_0"
    },
    {
        "source_sentence": "器世間亦如是，以諸眾生造善惡業種種不同，隨彼眾生善惡之業，感得淨穢等土亦有萬品差別。",
        "translation": "The container world is likewise, because the good and bad actions of sentient beings create various kinds of good and bad actions, and there are also myriad distinctions according to the good and bad actions of those sentient beings that lead to the attainment of pure and defiled lands.",
        "source": "T25n1512_010:0873a23_1"
    },
    {
        "source_sentence": "斯由業見有殊，非是實有也。",
        "translation": "This is due to the fact that there are differences in views of karma, not real existences.",
        "source": "T25n1512_010:0873a26_2"
    },
    {
        "source_sentence": "如似有人以虛空為地、以地為虛空，有人以水為火用、火為水用，知何者為實？",
        "translation": "It's like someone who takes space as earth and earth as space, or someone who uses water for fire and fire for water, knowing which one is real?",
        "source": "T25n1512_010:0873a26_3"
    },
    {
        "source_sentence": "如婆羅墮婆羅門，以火為食、虛空中眠，斯即其事也。",
        "translation": "It's like a Brāhmaṇa who takes fire as food and sleeps in space, which is the same thing.",
        "source": "T25n1512_010:0873a28_4"
    },
    {
        "source_sentence": "五、如露者，如草上朝露，見日則落。",
        "translation": "5. Like dew, it's like the morning dew on a blade of grass that falls off when you see the sun.",
        "source": "T25n1512_010:0873a29_5"
    },
    {
        "source_sentence": "陰身亦然，生已即滅，念念遷謝，暫時不住，以體虛不實無常故也。",
        "translation": "So it is with the aggregates and bodies, which cease after being produced, change moment to moment and don't abide for a while because their essence is false and insubstantial and impermanent.",
        "source": "T25n1512_010:0873b01_6"
    },
    {
        "source_sentence": "六、如泡者，如因天上雨渧擊地上水則成泡沫，愚癡小兒謂流離珠，心生愛著，",
        "translation": "6. Like a bubble, it's like when rain from the gods strikes water on the ground and forms a bubble. Foolish children say they're running away from the pearl, and their minds become attached to it.",
        "source": "T25n1512_010:0873b03_0"
    },
    {
        "source_sentence": "須臾即滅不得久立。",
        "translation": "In a moment, it ceases and can't be established for a long time.",
        "source": "T25n1512_010:0873b04_1"
    },
    {
        "source_sentence": "三受亦爾，從根塵識三和後起苦樂等受，暫有不亭速於泡沫。",
        "translation": "The same applies to three feelings: such feelings as frustration and satisfaction that are produced from the three harmonies of sense faculties, dust and consciousness. For a certain time, there is an unsteady bubble not rising faster than foam.",
        "source": "T25n1512_010:0873b05_2"
    },
    {
        "source_sentence": "此世界身苦樂等受不實若此，背何等法、趣何等法？",
        "translation": "If this world's body is painful, pleasant, and so forth, such feelings are insubstantial, what teaching would they turn their backs on and what teaching would they aspire to?",
        "source": "T25n1512_010:0873b06_3"
    },
    {
        "source_sentence": "七、如夢者，前六種有為虛妄之法已謝於住，如人夢受五欲及見種種色物，",
        "translation": "7. Like a dream: The first six kinds of conditioned, false dharmas that are conditioned have already passed away. Suppose a person experiences the five desires and sees various objects of form in a dream.",
        "source": "T25n1512_010:0873b08_0"
    },
    {
        "source_sentence": "寤已則無，唯可念知不可重覩，過去遷滅如夢寤不異也。",
        "translation": "After the dispute is settled, there's nothing, but it can only be remembered and known that it can't be repeatedly disputed, and the past moves and ceases like a dream in which the dispute isn't different.",
        "source": "T25n1512_010:0873b09_1"
    },
    {
        "source_sentence": "八、如電者，如電光暫現理無久住。",
        "translation": "8. Like a flash of lightning, it's like a flash of lightning that temporarily appears in principle without long abiding.",
        "source": "T25n1512_010:0873b11_0"
    },
    {
        "source_sentence": "六種有為，現在峻轉疾極於電，故以為喻也。",
        "translation": "The six kinds of conditioned dharmas are present in the present, and they're as fast as a flash of lightning, so they're considered metaphors.",
        "source": "T25n1512_010:0873b11_1"
    },
    {
        "source_sentence": "九、如雲者，如虛空中清淨無雲，以眾生不可思議業有，龍為本故，於虛空中未現雲現、現已還滅。",
        "translation": "9. Like clouds, it's like the pure absence of clouds in space, because sentient beings have unfathomable actions and dragons as their root, which are manifested by clouds that don't yet appear in space and cease after they appear.",
        "source": "T25n1512_010:0873b12_2"
    },
    {
        "source_sentence": "六種有為未起之法亦復如是，由有無始阿梨耶識根本種子無明住地勳故，",
        "translation": "The same applies to the six kinds of conditioned factors that have not arisen yet: because there is mixing of the fundamental seed of the beginningless store consciousness with ignorance abiding in the stages.",
        "source": "T25n1512_010:0873b15_0"
    },
    {
        "source_sentence": "能令未現法現、現已即謝。",
        "translation": "It causes the manifesting of things that have yet to be manifested and those that have already been manifested to cease.",
        "source": "T25n1512_010:0873b16_1"
    },
    {
        "source_sentence": "以其不實故，喻之如雲。",
        "translation": "Because it's not real, it's likened to a cloud.",
        "source": "T25n1512_010:0873b17_2"
    },
    {
        "source_sentence": "然此六種有為法，既為三世所轉，妄情謂有，其體無實，如九喻無別。",
        "translation": "However, these six kinds of conditioned dharmas are the result of the three periods of time. They are said to exist by deluded thought because their essence is insubstantial, like the nine metaphors that have no distinctions.",
        "source": "T25n1512_010:0873b17_3"
    },
    {
        "source_sentence": "若然，背何等法、趣何等法也？",
        "translation": "If that's the case, what teaching is turned away from and what teaching is turned toward?",
        "source": "T25n1512_010:0873b19_4"
    },
    {
        "source_sentence": "「應如是觀」者，九種有為如九種喻，作不實而觀。",
        "translation": "The phrase should be observed in this way refers to the nine kinds of conditioned things like the nine kinds of metaphors that are observed as unreal.",
        "source": "T25n1512_010:0873b20_5"
    },
    {
        "source_sentence": "應云一切有為法如星，應作如是觀，乃至如雲，皆如是說。",
        "translation": "You should say that all conditioned dharmas are like stars, and you should observe them in this way, up to the point where they're like clouds, which are all thus explained.",
        "source": "T25n1512_010:0873b21_6"
    },
    {
        "source_sentence": "此有為法既不實如此，則本來寂滅。",
        "translation": "Since these conditioned dharmas are not really like this, they are originally extinguished.",
        "source": "T25n1512_010:0873b22_7"
    },
    {
        "source_sentence": "本來寂滅，則唯一真如。",
        "translation": "When the originally tranquil, then there's only one true reality.",
        "source": "T25n1512_010:0873b23_8"
    },
    {
        "source_sentence": "真如寂滅，即是涅槃。",
        "translation": "The cessation of true thusness is nirvāṇa.",
        "source": "T25n1512_010:0873b23_9"
    },
    {
        "source_sentence": "是故諸佛如來見世間即涅槃故，不同二乘厭背生死、樂住涅槃、不化眾生。",
        "translation": "Because the buddhas and tathāgatas therefore see the world as nirvāṇa, they're different from the two vehicles who are disillusioned with birth-and-death, happily abide in nirvāṇa, and don't transform sentient beings.",
        "source": "T25n1512_010:0873b24_10"
    },
    {
        "source_sentence": "見涅槃即世間故，不同凡夫眾生死而無厭，不求出世涅槃解脫之果也。",
        "translation": "Because they see nirvāṇa as the world, they're not like ordinary sentient beings who die without tire and don't seek the fruit of liberation from supramundane nirvāṇa.",
        "source": "T25n1512_010:0873b26_11"
    },
    {
        "source_sentence": "「論曰：復有疑」等，此一段長行論，論主略作疑答意，若諸佛如來常為眾生說法者，",
        "translation": "The treatise says, Again, there are doubts and so forth, which is a long line of argument in which the treatise leader briefly answers doubts.",
        "source": "T25n1512_010:0873b28_0"
    },
    {
        "source_sentence": "此應是住世間；",
        "translation": "This should be abiding in the world.",
        "source": "T25n1512_010:0873b29_1"
    },
    {
        "source_sentence": "復言如來入涅槃，即是住涅槃。",
        "translation": "Again, it's said that the Tathāgata enters nirvāṇa, which is abiding in nirvāṇa.",
        "source": "T25n1512_010:0873c01_2"
    },
    {
        "source_sentence": "云何上論中言不一處住不異處住也？",
        "translation": "How does the above treatise say that it doesn't abide in one place and doesn't abide in different places?",
        "source": "T25n1512_010:0873c01_3"
    },
    {
        "source_sentence": "為斷此疑故，如來即說偈喻者，此為略答疑者，申九喻來意也。",
        "translation": "In order to stop these doubts, the Tathāgata explains the verse metaphor. This is a brief explanation of the doubts, explaining the meaning of the nine metaphors that come from them.",
        "source": "T25n1512_010:0873c02_4"
    },
    {
        "source_sentence": "此一偈經，論主凡以三行偈釋：第一偈，作問答釋疑，明不住道也；",
        "translation": "The first verse answers questions and explains doubts in order to clarify that they do not abide in the path.",
        "source": "T25n1512_010:0873c04_5"
    },
    {
        "source_sentence": "第二偈，出所觀九種有為境界；",
        "translation": "The second verse speaks of the nine kinds of conditioned objects that are contemplated.",
        "source": "T25n1512_010:0873c05_6"
    },
    {
        "source_sentence": "第三偈，重舉九種有為法，答難明觀之有所得也。",
        "translation": "The third verse repeats the nine kinds of conditioned dharmas and answers the difficult question by explaining that contemplation has attainment.",
        "source": "T25n1512_010:0873c06_7"
    },
    {
        "source_sentence": "「非有為非離」者，言「非有」者，明諸佛所得常住涅槃出世間法體，",
        "translation": "The phrase neither existent nor nonexistent means that the buddhas attain eternally abiding nirvāṇa, which is the supramundane essence of dharmas.",
        "source": "T25n1512_010:0873c07_8"
    },
    {
        "source_sentence": "絕生滅起動、無始終之相，故非有為。",
        "translation": "The cessation of arising and ceasing has no beginning or end characteristics, so it's not conditioned.",
        "source": "T25n1512_010:0873c08_9"
    },
    {
        "source_sentence": "若非有為者，可條然異處，不住有為法中，故言「非離」。",
        "translation": "If it's not conditioned, then it can be distinct and doesn't abide in conditioned dharmas, so it's called not separate.",
        "source": "T25n1512_010:0873c09_10"
    },
    {
        "source_sentence": "明有為實性即是涅槃，不離有為之外更有涅槃。",
        "translation": "It explains that the real nature of conditioned is nirvāṇa, and there's no other nirvāṇa apart from conditioned.",
        "source": "T25n1512_010:0873c10_11"
    },
    {
        "source_sentence": "故下句云「諸如來涅槃」，明證大涅槃時，不住有為法中，亦不離有為法也。",
        "translation": "That's why the next sentence says, The Tathāgatas attain nirvāṇa, which explains that when they realize great nirvāṇa, they don't abide in conditioned dharmas and don't part from conditioned dharmas.",
        "source": "T25n1512_010:0873c12_0"
    },
    {
        "source_sentence": "若不離有為則是住世間，若非有為則是住涅槃，云何言諸佛不住涅槃、不住世間也？",
        "translation": "If it's not free of conditioned things, then it's abiding in the world; if it's not conditioned, then it's abiding in nirvāṇa, so why do you say that the buddhas don't abide in nirvāṇa and don't abide in the world?",
        "source": "T25n1512_010:0873c13_1"
    },
    {
        "source_sentence": "故下半偈答云「九種有為法，妙智正觀故」，明諸佛如來得出世正觀，",
        "translation": "That's why the next half of the verse answer says, Nine kinds of conditioned dharmas are marvelously subtle and correctly observed, explaining that the buddha-tathāgatas emerge from the world to correctly observe,",
        "source": "T25n1512_010:0873c15_2"
    },
    {
        "source_sentence": "見有為法本來寂滅即是涅槃性，不同聲聞見世間異涅槃故厭捨有為而取涅槃。",
        "translation": "Seeing the original quiescence of conditioned dharmas is the nature of nirvāṇa, but unlike śrāvakas who see worldly differences in nirvāṇa, they abandon conditioned and grasp nirvāṇa because they're disillusioned with it.",
        "source": "T25n1512_010:0873c17_3"
    },
    {
        "source_sentence": "今言有為即涅槃者，是佛性妙有常住涅槃。",
        "translation": "Now, when it's said that conditioned nirvāṇa is nirvāṇa, it means the buddha-nature is marvelously existent and eternally abiding nirvāṇa.",
        "source": "T25n1512_010:0873c19_0"
    },
    {
        "source_sentence": "明諸佛如來觀有為法即是性淨涅槃，既見性淨涅槃，斷二障永盡，得此妙智正觀時，",
        "translation": "It means that all buddha-tathāgatas observe conditioned phenomena, which are the essential purity of nirvana. Having seen the essential purity of nirvana, they eliminate the two obstacles and forever extinguish them.",
        "source": "T25n1512_010:0873c20_0"
    },
    {
        "source_sentence": "能即得彼現果方便涅槃故，不捨有為而住涅槃也。",
        "translation": "It's because they can immediately attain nirvāṇa in the present result of skillful means, and they don't abandon conditioned things and abide in nirvāṇa.",
        "source": "T25n1512_010:0873c22_0"
    },
    {
        "source_sentence": "「此義云何？",
        "translation": "What does this mean?",
        "source": "T25n1512_010:0873c23_1"
    },
    {
        "source_sentence": "諸佛涅槃」者，此提偈中第二句也。",
        "translation": "The phrase nirvāṇa of the buddhas refers to the second phrase in this verse.",
        "source": "T25n1512_010:0873c23_2"
    },
    {
        "source_sentence": "「非有為法亦不離有為法」者，釋偈中上句也。",
        "translation": "The phrase neither conditioned dharmas nor non-conditioned dharmas are separate from conditioned dharmas refers to the first sentence of the explanation in the verse.",
        "source": "T25n1512_010:0873c24_3"
    },
    {
        "source_sentence": "「何以故」者，此釋前諸佛涅槃，何故非有為法而復云不離有為法也。",
        "translation": "Why is it so? This explains the previous nirvāṇa of the buddhas, why isn't it conditioned dharmas that are not conditioned dharmas but also says they aren't separate from conditioned dharmas?",
        "source": "T25n1512_010:0873c25_4"
    },
    {
        "source_sentence": "即釋以諸佛得涅槃，出離生死故，非有為也。",
        "translation": "That is, the explanation explains that it's because the buddhas attain nirvāṇa and are free of birth-and-death, not conditioned.",
        "source": "T25n1512_010:0873c26_5"
    },
    {
        "source_sentence": "「化身說法至為利益眾生故」，明諸佛以應身常在世化物故，不離有為也。",
        "translation": "The transformation body teaches the Dharma until it's for the benefit of sentient beings explains that the buddhas are always present in the world to transform things because their response bodies aren't free from existence.",
        "source": "T25n1512_010:0873c27_6"
    },
    {
        "source_sentence": "此明諸佛以不住涅槃者結初句，以不住世間者結後句也。",
        "translation": "This explains that the buddhas conclude the first sentence because they don't abide in nirvāṇa, and the second sentence because they don't abide in the world.",
        "source": "T25n1512_010:0873c29_7"
    },
    {
        "source_sentence": "「何故諸佛示現世間行而不住有為法中」者，將釋下半偈，問前示現世間行，",
        "translation": "The reason why the buddhas show worldly actions and don't abide in conditioned dharmas is to explain the next half of the verse that asks about the previously shown worldly actions,",
        "source": "T25n1512_010:0874a01_8"
    },
    {
        "source_sentence": "何故諸佛應身化物示有生老病死，而不名住有為法中也？",
        "translation": "Why are the buddhas' response bodies and transformations shown to have birth, old age, illness, and death, but they aren't called abiding in conditioned dharmas?",
        "source": "T25n1512_010:0874a03_9"
    },
    {
        "source_sentence": "以下半偈答「九種有為法，妙智正觀故」。",
        "translation": "The next half a verse answers, Nine kinds of conditioned dharmas are the result of subtle wisdom and right contemplation.",
        "source": "T25n1512_010:0874a04_10"
    },
    {
        "source_sentence": "雖同世間有老病死，而非有為法也。",
        "translation": "Although it's the same as old age, illness, and death in the world, it's not conditioned dharmas.",
        "source": "T25n1512_010:0874a05_11"
    },
    {
        "source_sentence": "「此以何義」者，問此偈所明正觀者，作何法用而觀，得名為正觀，雖示有生死等世間行，",
        "translation": "The phrase what does this mean? asks, What is the correct contemplation explained in this verse that observes with the functioning of dharmas and gets the name correct contemplation? Although it shows that there are such worldly phenomena as birth and death,",
        "source": "T25n1512_010:0874a06_12"
    },
    {
        "source_sentence": "而不名住有為法也。",
        "translation": "It's not called abiding in conditioned dharmas.",
        "source": "T25n1512_010:0874a08_13"
    },
    {
        "source_sentence": "即釋云「如星宿」等，相對九種正觀故，明諸佛觀九種有為法虛妄不實。",
        "translation": "That is, the explanation says, Like the stars and constellations, etc., because they are opposed to the nine kinds of correct contemplation, it explains that the nine kinds of conditioned dharmas observed by the buddhas are false and unreal.",
        "source": "T25n1512_010:0874a09_14"
    },
    {
        "source_sentence": "如觀星宿等九種法虛妄不實，便能於有為法中，以正觀力故終日示世間行，",
        "translation": "Like observing the nine kinds of dharmas, stars, constellations, and so on, which are false and unreal, they can then, through the power of correct contemplation, show the world day after day in conditioned dharmas.",
        "source": "T25n1512_010:0874a10_15"
    },
    {
        "source_sentence": "而能不住有為法也。",
        "translation": "They can't abide in conditioned dharmas.",
        "source": "T25n1512_010:0874a12_16"
    },
    {
        "source_sentence": "「此九種正觀，於九種境界應知」者，出正觀之境勸人識之。",
        "translation": "The phrase these nine kinds of correct contemplation should be known in nine kinds of objective realms refers to the object of correct contemplation and encourages people to recognize it.",
        "source": "T25n1512_010:0874a12_17"
    },
    {
        "source_sentence": "第二偈上句云「見相」者，直云心見相，攝能見三盡，但為成偈故，言及於識也。",
        "translation": "The second verse says, Seeing characteristics in the first sentence, it's simply saying that the mind sees characteristics, which includes the three kinds of views that can be seen, but it's only for the sake of forming a verse that it's called consciousness and consciousness.",
        "source": "T25n1512_010:0874a14_18"
    },
    {
        "source_sentence": "此句有三，明能見心，釋經中星翳燈三喻也。",
        "translation": "These sentences are threefold, explaining the mind that can see and explaining the three metaphors of the star-shaped lamp in the sūtras.",
        "source": "T25n1512_010:0874a15_19"
    },
    {
        "source_sentence": "「器身受用事」者，此三明所受用事，釋經中幻露泡三喻也。",
        "translation": "The phrase things that are received and used by the body of the container refers to these three explanations of the things that are received and used, explaining the three metaphors of illusory bubbles in the sūtras.",
        "source": "T25n1512_010:0874a17_0"
    },
    {
        "source_sentence": "「過去現在法，亦觀未來世」者，明前六種有為法在三世中轉，釋經中夢電雲也。",
        "translation": "The phrase past and present dharmas are also observed in the future explains that the first six kinds of conditioned dharmas arise in the three times, explaining that the sūtras say they're clouds of dreams and lightning.",
        "source": "T25n1512_010:0874a18_1"
    },
    {
        "source_sentence": "此明六種有為已謝於往名為過去，六種有為萌兆未起名未來，六種有為起於今辰念念生滅名為現在，",
        "translation": "This shows that six kinds of conditioned things are said to be past when they have already passed away. Six kinds of conditioned things are said to be future when they have not yet arisen. Six kinds of conditioned things arise at the present moment, and birth and desinence in each thought are said to be present.",
        "source": "T25n1512_010:0874a20_2"
    },
    {
        "source_sentence": "故云三世轉也。",
        "translation": "That's why it's called the three worldly transformations.",
        "source": "T25n1512_010:0874a22_3"
    },
    {
        "source_sentence": "第三偈「觀相及受用」者，言「觀相」，牒前偈中上見相識。",
        "translation": "The third verse, contemplation of characteristics and sensation refers to the above-mentioned verse in terms of seeing characteristics and consciousness.",
        "source": "T25n1512_010:0874a23_4"
    },
    {
        "source_sentence": "「及受用」者，牒前偈中三「器身受用事」。",
        "translation": "The phrase and sensation refers to the three things that are experienced by the body of the container in the previous verse.",
        "source": "T25n1512_010:0874a24_5"
    },
    {
        "source_sentence": "「觀於三世事」者，牒前偈中後三過現未來三世法也。",
        "translation": "The phrase observing the three worldly phenomena refers to the last three faults in the previous verse that present and future three worldly dharmas.",
        "source": "T25n1512_010:0874a25_6"
    },
    {
        "source_sentence": "所以重舉此九種法者，難云：觀此九種有為法，得何等功德、成就何智？",
        "translation": "That's why these nine kinds of dharmas are repeatedly cited because it's difficult to say, Observing these nine kinds of conditioned dharmas, what virtue will they attain and what knowledge will they achieve?",
        "source": "T25n1512_010:0874a26_7"
    },
    {
        "source_sentence": "故以下半偈答云「於有為法中，得無垢自在」，明觀此九種有為法時，",
        "translation": "That's why the next half of the verse answer says, In these nine kinds of conditioned dharmas, he attains unadulterated freedom.",
        "source": "T25n1512_010:0874a28_8"
    },
    {
        "source_sentence": "能得初地以上無漏無垢之果，無生之智不住道解自在功德也。",
        "translation": "He's able to attain the uncontaminated, undefiled fruit of the first ground and above, the unborn knowledge that doesn't abide in the path and the merit of self-contained understanding.",
        "source": "T25n1512_010:0874a29_9"
    },
    {
        "source_sentence": "「佛說是經已至信受奉行」，此是第十二流通分經。",
        "translation": "After the Buddha teaches this sūtra, he believes it and accepts and consecrates it. This is the twelfth circulation section of the sūtra.",
        "source": "T25n1512_010:0874b03_0"
    },
    {
        "source_sentence": "所以次明流通者，上來說法正辨經體，信悟者眾。",
        "translation": "The next reason we explain circulation is that the above teaching correctly identifies the essence of the sūtras and the multitude of those who believe and awaken.",
        "source": "T25n1512_010:0874b04_1"
    },
    {
        "source_sentence": "今將明如來說法，非但直欲通益當時，亦欲澤被遐劫故，令流通未來，",
        "translation": "I will now explain that the Tathāgata teaches the Dharma. Not only does he want to directly benefit those who were present at the time, but he also wants to enable them to pass on the teaching in the future so that they may be able to do so for as many eons as possible.",
        "source": "T25n1512_010:0874b05_2"
    },
    {
        "source_sentence": "使異世問津，故明也。",
        "translation": "It's because the other world asks about the river, so it's clear.",
        "source": "T25n1512_010:0874b06_3"
    },
    {
        "source_sentence": "以此中具列四眾八部及諸大菩薩故，明知序中引同聞時亦應具有，以經略故闕也。",
        "translation": "Because these are listed here as the four groups, the eight divisions, and the great bodhisattvas, it's clear that the preface quoted at the time of shared hearing should also have them, but they're missing because the sūtras are abbreviated.",
        "source": "T25n1512_010:0874b07_4"
    },
    {
        "source_sentence": "聞佛所說，時會所以皆大歡喜信受奉行流通此經者，凡有三義故也。",
        "translation": "When they hear what the Buddha teaches, the people at the assembly are all greatly joyful and faithfully believe in this sūtra because it has three meanings.",
        "source": "T25n1512_010:0874b09_5"
    },
    {
        "source_sentence": "一、說者清淨，明諸佛如來乃是一切智人二障永盡，具足十力四無畏十八不共法等無量功德，",
        "translation": "1. The speaker is pure, explaining that the buddha-tathāgatas are the two hindrances of all wise people who have permanently ended the two hindrances and possess the immeasurable qualities of the ten powers, four fearlessnesses, 18 unique qualities, and so forth.",
        "source": "T25n1512_010:0874b11_6"
    },
    {
        "source_sentence": "如證而說必當理，故曰說者清淨也。",
        "translation": "As it's realized, it must be explained in accordance with the principle, so it's called a teaching that's pure.",
        "source": "T25n1512_010:0874b13_7"
    },
    {
        "source_sentence": "二、所說清淨，此明所說音聲章句阿含經教，從無煩惱人邊來，說同諸佛，",
        "translation": "The second is the purity of what they teach. This explains that the sounds, phrases, and abhidharma sūtras taught by the buddhas are the same as those taught by the buddhas from the perspective of people without afflictions.",
        "source": "T25n1512_010:0874b14_8"
    },
    {
        "source_sentence": "不多不少、不增不減，與理相應，故曰所說清淨也。",
        "translation": "Nothing is greater or lesser, neither increasing nor decreasing, and it's consistent with the principle; therefore, it's said to be pure.",
        "source": "T25n1512_010:0874b15_9"
    },
    {
        "source_sentence": "三、受者清淨，時會大眾一心專聽無見諍過，不言我法是、彼法非，心無疑濁，",
        "translation": "3. The recipient is pure, the masses of the assembly at that time singlemindedly concentrate their minds on listening without seeing or criticizing faults, don't say self and dharmas are right or wrong, and have no doubt in their minds.",
        "source": "T25n1512_010:0874b16_10"
    },
    {
        "source_sentence": "故曰清淨也。",
        "translation": "That's why it's called pure.",
        "source": "T25n1512_010:0874b18_11"
    },
    {
        "source_sentence": "一切大眾，慶覩天尊，得深法味，除疑遣障，獲道度世，故大歡喜信受奉行也。",
        "translation": "All the people in the assembly were delighted to see that the Bhagavān had attained the profound flavor of the Dharma, removed their doubts and obstacles, and attained the path to save the world. Therefore, they were greatly joyful and believed it, accepted it, and carried it out.",
        "source": "T25n1512_010:0874b18_12"
    },
    {
        "source_sentence": "「諸佛希有總持法」等，此一偈是論主所制第八十偈，讚歎迴向。",
        "translation": "These are the eighty-eighth verses composed by the treatise master, praising and dedicating themselves back to the rare Dharma of the buddhas.",
        "source": "T25n1512_010:0874b20_13"
    },
    {
        "source_sentence": "「諸佛」者，十方三世諸佛也，明此《金剛般若波羅蜜經》是十方三世諸佛智母，",
        "translation": "The buddhas refers to the buddhas of the three times in the ten directions, meaning that this Diamond Sutra is the mother of wisdom of the buddhas of the three times in the ten directions.",
        "source": "T25n1512_010:0874b22_14"
    },
    {
        "source_sentence": "三世諸佛同說此法，非獨釋迦如來，故言諸佛也。",
        "translation": "The buddhas of the three times all explain this teaching together, not just the Tathāgata Śākyamuni, so they're called buddhas.",
        "source": "T25n1512_010:0874b23_15"
    },
    {
        "source_sentence": "「希有」者，此非曠世所無、時時而有故，名為希有。",
        "translation": "Rarely found means that this isn't something that's not found in the wilderness of the world and exists from time to time, so it's called rare.",
        "source": "T25n1512_010:0874b25_0"
    },
    {
        "source_sentence": "又諸佛如來常為眾生說之，何故名為希有也？",
        "translation": "Also, why is it called rare when the buddhas and tathāgatas always explain it for sentient beings?",
        "source": "T25n1512_010:0874b26_1"
    },
    {
        "source_sentence": "明此般若理深旨遠，唯是諸佛境界，非餘人所知故，凡夫二乘小行根小行之人所不能受，",
        "translation": "This explains that the profound meaning of this principle of prajñā is far-reaching, and it's only the sphere of the buddhas, not known by others. Ordinary people of the two vehicles with lesser practice faculties and lesser practitioners can't accept it.",
        "source": "T25n1512_010:0874b27_2"
    },
    {
        "source_sentence": "以信者難得故曰希有也。",
        "translation": "Because it's difficult to believe, it's called rare.",
        "source": "T25n1512_010:0874b29_3"
    },
    {
        "source_sentence": "「總持法」者，明此經其文雖略，明義乃廣，旨明常住因果境智之理收羅皆盡，",
        "translation": "The phrase dhāraṇī explains that although the text of this sūtra is brief, its clear meaning is extensive, and its purpose is to explain that the principle of eternally abiding cognition of cause and effect in terms of objects is exhausted.",
        "source": "T25n1512_010:0874b29_4"
    },
    {
        "source_sentence": "故曰總持法也。",
        "translation": "That's why it's called the dhāraṇī of the Dharma.",
        "source": "T25n1512_010:0874c02_5"
    },
    {
        "source_sentence": "又復一義，一切諸大乘經其文雖廣，至於所明不出眾生、菩薩、佛、淨土。",
        "translation": "Furthermore, in another sense, even though the texts of all the great vehicle scriptures are extensive, what they explain don't go beyond sentient beings, bodhisattvas, buddhas, or pure lands.",
        "source": "T25n1512_010:0874c03_6"
    },
    {
        "source_sentence": "然此雖略，至於所明，亦盡斯四也，故言總持法。",
        "translation": "However, even though this is brief, it goes so far as to explain these four things, so it's called the dhāraṇī.",
        "source": "T25n1512_010:0874c04_7"
    },
    {
        "source_sentence": "「不可稱量」者，明此經理深，非二乘小智所能圖度也。",
        "translation": "The phrase immeasurable means to explain that this manager is profound, and it's not something the lesser wisdom of the two vehicles can fathom.",
        "source": "T25n1512_010:0874c05_8"
    },
    {
        "source_sentence": "「深句義」者，謂此經文句及次第深義也。",
        "translation": "Profound meaning of profound phrase refers to the text and sequential profound meaning of this sūtra.",
        "source": "T25n1512_010:0874c07_0"
    },
    {
        "source_sentence": "乘此生疑難：若此金剛般若句義次第難解非圖度境者，論主何由得解而造論解釋也？",
        "translation": "If these words and meanings of the adamantine prajñāpāramitā are sequentially difficult to understand because they don't describe objects, how could the treatise leader have understood them and created a treatise that explains them?",
        "source": "T25n1512_010:0874c07_1"
    },
    {
        "source_sentence": "故云「從尊者聞」，明論主自云此金剛般若甚深法門義釋非自智力解，",
        "translation": "That's why it's called hearing from the venerable, explaining that the treatise leader himself says that this profound meaning of the Dharma teaching of the adamantine prajñāpāramitā is not explained by his own knowledge and power.",
        "source": "T25n1512_010:0874c09_2"
    },
    {
        "source_sentence": "乃近從尊者胡名阿僧呿、漢云無障礙比丘邊聞，復遠從彌勒世尊邊聞，",
        "translation": "He had heard it from the side of Venerable Asaṃghârāma bhikṣu (known in Chinese as Wuqian, “Infinitely Enlightened One”), who was also known by the side of World-honored One Maitreya.",
        "source": "T25n1512_010:0874c11_3"
    },
    {
        "source_sentence": "明仰推功有在，非是謬傳，故言從尊者聞也。",
        "translation": "It's clear that there's a reason to presume the merit, which isn't mistakenly transmitted, so it's said to be heard from the venerable.",
        "source": "T25n1512_010:0874c13_4"
    },
    {
        "source_sentence": "「及廣說」者，明無障礙比丘乃是性地菩薩，多聞強記，能流通大乘、折伏外道故。",
        "translation": "The phrase and extensive explanation explains that the unobstructed monk is a bodhisattva of the nature-stage who's well-versed and strongly remembered because he can circulate the great vehicle and subdue non-Buddhists.",
        "source": "T25n1512_010:0874c14_5"
    },
    {
        "source_sentence": "彌勒世尊愍此閻浮提人，作《金剛般若經義釋》并《地持論》，齎付無障礙比丘令其流通。",
        "translation": "Bhagavān Maitreya pityed the people of Jambudvīpa and produced the Vajrapāṇi-paripṛcchā(sūtra, the Explanation of its Meaning, as well as the Earth Upholder's Commentary. He delivered it to the unobstructed bhikṣu and caused it to circulate.",
        "source": "T25n1512_010:0874c15_6"
    },
    {
        "source_sentence": "然彌勒世尊但作長行釋，論主天親既從無障礙比丘邊學得，復尋此經論之意，",
        "translation": "\\",
        "source": "T25n1512_010:0874c17_7"
    },
    {
        "source_sentence": "更作偈論廣興疑問以釋此經，凡有八十偈，及作長行論釋，復以此論轉教金剛仙論師等。",
        "translation": "He then composed a verse treatise to explain this sūtra, which consists of eighty verses and a long explanation in length, and he also taught the Vajrapāṇi-śāstra master with this treatise.",
        "source": "T25n1512_010:0874c19_8"
    },
    {
        "source_sentence": "此金剛仙轉教無盡意，無盡意復轉教聖濟，聖濟轉教菩提留支，迭相傳授以至於今始二百年許，",
        "translation": "This Vajra仙轉教無盡意,無盡意復轉教聖濟,聖濟轉教菩提留支,次次傳授至今始二百年許,",
        "source": "T25n1512_010:0874c21_9"
    },
    {
        "source_sentence": "未曾斷絕，故言及廣說也。",
        "translation": "It's never been cut off, so it's called that and explained in detail.",
        "source": "T25n1512_010:0874c24_10"
    },
    {
        "source_sentence": "「迴此福德施群生」者，然菩薩大士每日事興願故，論主自申己所有造論傳訓功德，",
        "translation": "The phrase dedication of these merits to sentient beings means that each day the bodhisattva or great person gives rise to a vow, and the author of the treatise explains the merits of his own created treatises and transmitted teachings.",
        "source": "T25n1512_010:0874c24_11"
    },
    {
        "source_sentence": "不專獨善，乃迴與法界眾生，同向無上菩提心也。",
        "translation": "He doesn't focus solely on goodness, but rather returns it to sentient beings in the Dharma realm and shares the same dedication of mind for unsurpassed enlightenment.",
        "source": "T25n1512_010:0874c26_12"
    },
    {
        "source_sentence": "金剛仙論卷第十",
        "translation": "Jingang xian lun, vol. 10",
        "source": "T25n1512_010:0874c28_0"
    }
]