[
    {
        "source_sentence": "大智度論釋初品中羼提波羅蜜",
        "translation": "Mahāprajñāpāramitā in the First Chapter of the Commentary on the Treatise on the Great Decease of Wisdom",
        "source": "T25n1509_015:0168b02_0"
    },
    {
        "source_sentence": "法忍義第二十五(卷第十五)",
        "translation": "The Meaning of Forbearance of the Dharma Twenty-fifth ( Fascicle 15)",
        "source": "T25n1509_015:0168b03_0"
    },
    {
        "source_sentence": "龍樹菩薩造",
        "translation": "created by Nāgârjuna Bodhisattva",
        "source": "T25n1509_015:0168b05_0"
    },
    {
        "source_sentence": "後秦龜茲國三藏鳩摩羅什",
        "translation": "Kumārajīva, the Tripiṭaka of the Later Qin state of Kucha",
        "source": "T25n1509_015:0168b06_0"
    },
    {
        "source_sentence": "奉　詔譯",
        "translation": "translated by imperial edict",
        "source": "T25n1509_015:0168b07_0"
    },
    {
        "source_sentence": "云何名法忍？",
        "translation": "What's called the patience of dharmas?",
        "source": "T25n1509_015:0168b08_0"
    },
    {
        "source_sentence": "忍諸恭敬、供養眾生及諸瞋惱、婬欲之人，是名生忍。",
        "translation": "To tolerate respect, offerings to sentient beings, anger, and sexual desire is called producing forbearance.",
        "source": "T25n1509_015:0168b08_1"
    },
    {
        "source_sentence": "忍其供養、恭敬法及瞋惱、婬欲法，是為法忍。",
        "translation": "To tolerate their offerings, respect the Dharma and the Dharma of veneration, anger and resentment, and sexual desire is forbearance of the Dharma.",
        "source": "T25n1509_015:0168b09_2"
    },
    {
        "source_sentence": "復次，法忍者，於內六情不著，於外六塵不受，能於此二不作分別。",
        "translation": "Furthermore, the Dharma-忍者, who is not attached to the six internal emotions and doesn't accept the six external objects, can make no distinctions between these two.",
        "source": "T25n1509_015:0168b10_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_015:0168b12_4"
    },
    {
        "source_sentence": "內相如外，外相如內，二相俱不可得故；",
        "translation": "The internal characteristic marks are as external; the external characteristic marks are as internal: because neither of these two characteristic marks can be acquired.",
        "source": "T25n1509_015:0168b12_5"
    },
    {
        "source_sentence": "一相故，因緣合故，其實空故，一切法相常清淨故，如、真際、法性相故，",
        "translation": "Because of one characteristic mark, because of the conjunction of causes and conditions, because of emptiness in fact, because all characteristics of dharmas are always pure, because of suchness, because of their true extent, because of the characteristic mark of",
        "source": "T25n1509_015:0168b13_6"
    },
    {
        "source_sentence": "不二入故，雖無二亦不一。",
        "translation": "Because there are no two sense-fields, even though there are no two, they aren't one.",
        "source": "T25n1509_015:0168b14_7"
    },
    {
        "source_sentence": "如是觀諸法，心信不轉，是名法忍。",
        "translation": "Observing all dharmas in this way, the mind doesn't change with faith, which is called forbearance of the Dharma.",
        "source": "T25n1509_015:0168b15_8"
    },
    {
        "source_sentence": "如《毘摩羅鞊經》中，法住菩薩說：「生、滅為二，不生、不滅是不二入法門。」",
        "translation": "As in the Vimalakīrti Sutra, the Dharma-abiding Bodhisattva says, Birth and cessation are two, and non-birth and non-cessation are not two ways to enter the Dharma teaching.",
        "source": "T25n1509_015:0168b16_9"
    },
    {
        "source_sentence": "乃至文殊尸利說：「無聞、無見，一切心滅，無說、無語，是不二入法門。」",
        "translation": "Even Mañjuśrī said, Without hearing or seeing, all minds cease, and without saying or speaking, it's not two ways to enter the Dharma teaching.",
        "source": "T25n1509_015:0168b17_10"
    },
    {
        "source_sentence": "毘摩羅鞊默然無言，諸菩薩讚言：「善哉！",
        "translation": "Vimalakīrti remained silent and said nothing, and the bodhisattvas praised him, Good!",
        "source": "T25n1509_015:0168b19_11"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T25n1509_015:0168b20_12"
    },
    {
        "source_sentence": "是真不二入法門。」",
        "translation": "This is the true, nondual entry into the Dharma teaching.",
        "source": "T25n1509_015:0168b20_13"
    },
    {
        "source_sentence": "復次，一切法有二種：一者、眾生，二者、諸法。",
        "translation": "Furthermore, there are two kinds of all dharmas: 1. sentient beings and 2. dharmas.",
        "source": "T25n1509_015:0168b20_14"
    },
    {
        "source_sentence": "菩薩於眾生中忍，如先說；",
        "translation": "Enlightening beings’ tolerance among sentient beings is as has been said before.",
        "source": "T25n1509_015:0168b21_15"
    },
    {
        "source_sentence": "今說法中忍。",
        "translation": "Now, I'll explain the forbearance in the teaching of the Dharma.",
        "source": "T25n1509_015:0168b22_16"
    },
    {
        "source_sentence": "法有二種：心法，非心法。",
        "translation": "There are two kinds of dharmas: mental factors and non-mental factors.",
        "source": "T25n1509_015:0168b22_17"
    },
    {
        "source_sentence": "非心法中有內、有外：外有寒熱、風雨等，內有飢渴、老病死等。",
        "translation": "It's not that there's internal and external in mind dharmas, such as cold, heat, wind, rain, hunger, thirst, old age, illness, death, and so forth.",
        "source": "T25n1509_015:0168b23_18"
    },
    {
        "source_sentence": "如是等種種，名為非心法。",
        "translation": "Such various things are called what's not mental dharmas.",
        "source": "T25n1509_015:0168b24_19"
    },
    {
        "source_sentence": "心法中有二種：一者、瞋恚、憂愁、疑等，二者、婬欲、憍慢等。",
        "translation": "Among the mental factors, there are two kinds: 1. anger, grief, doubt, etc., and 2. sexual desire, arrogance, pride, etc.",
        "source": "T25n1509_015:0168b25_20"
    },
    {
        "source_sentence": "是二名為心法。",
        "translation": "These two are called mind and dharmas.",
        "source": "T25n1509_015:0168b26_21"
    },
    {
        "source_sentence": "菩薩於此二法，能忍不動，是名法忍。",
        "translation": "A bodhisattva can tolerate these two things without moving, which is called forbearance of the Dharma.",
        "source": "T25n1509_015:0168b27_22"
    },
    {
        "source_sentence": "問曰：於眾生中若瞋惱害命得罪，憐愍得福；",
        "translation": "Q: Among sentient beings, if one is angry and harms life to gain blameworthiness, compassion obtains merit.",
        "source": "T25n1509_015:0168b27_23"
    },
    {
        "source_sentence": "寒熱、風雨，無有增損，云何而忍？",
        "translation": "How can we tolerate the suffering of cold, heat, wind, and rain?",
        "source": "T25n1509_015:0168b29_0"
    },
    {
        "source_sentence": "答曰：雖無增損而自生惱亂憂苦，害菩薩道，以是故，應當忍。",
        "translation": "Answer: Even though there's no increase or decrease, self-inflicted anguish and grief that harms the bodhisattva path should be tolerated because of this.",
        "source": "T25n1509_015:0168b29_1"
    },
    {
        "source_sentence": "復次，非但殺惱眾生故得罪，為惡心作因緣故有罪。",
        "translation": "Furthermore, it is not only because of killing beings that a blameworthiness is acquired. It is also because of the causes and conditions for bad awarenesses that a blameworthiness is acquired.",
        "source": "T25n1509_015:0168c02_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_015:0168c03_3"
    },
    {
        "source_sentence": "雖殺眾生而無記心，是便無罪；",
        "translation": "Even if one kills sentient beings with an indeterminate mind, this is no offense.",
        "source": "T25n1509_015:0168c03_4"
    },
    {
        "source_sentence": "慈念眾生，雖無所與而大得福。",
        "translation": "Being compassionate to sentient beings, they'll attain great merit even though they don't give anything.",
        "source": "T25n1509_015:0168c04_5"
    },
    {
        "source_sentence": "以是故，寒熱、風雨，雖無增損，然以能生惡意故得罪。",
        "translation": "Because of this, even though there's no increase or decrease in cold, heat, wind, or rain, it's still a sin because it can give rise to bad thoughts.",
        "source": "T25n1509_015:0168c05_6"
    },
    {
        "source_sentence": "以是故，應當忍。",
        "translation": "Because of this, they should tolerate it.",
        "source": "T25n1509_015:0168c06_7"
    },
    {
        "source_sentence": "復次，菩薩自知宿罪因緣：「生此苦處，此我自作，我應自受。」",
        "translation": "Furthermore, the bodhisattva knows for himself the causes and conditions of past sins, Being born in this painful place is self-made by me, and I should myself experience them.",
        "source": "T25n1509_015:0168c06_8"
    },
    {
        "source_sentence": "如是思惟，是故能忍。",
        "translation": "Because they think in this way, they are able to tolerate it.",
        "source": "T25n1509_015:0168c08_9"
    },
    {
        "source_sentence": "復次，菩薩思惟：「國土有二種：有淨，有不淨。",
        "translation": "Furthermore, the bodhisattva thought, There are two kinds of lands: pure and impure.",
        "source": "T25n1509_015:0168c08_10"
    },
    {
        "source_sentence": "菩薩若生不淨國中，受此辛苦、飢寒眾惱，自發淨願：『我成佛時，國中無此眾苦。』",
        "translation": "If a bodhisattva is born in an impure land and suffers from this painful, hungry, and cold state of suffering, he makes the pure vow on his own: 'When I become a buddha, there won't be these kinds of",
        "source": "T25n1509_015:0168c09_11"
    },
    {
        "source_sentence": "此雖不淨，乃是我利。」",
        "translation": "Although this is impure, it's for my benefit.",
        "source": "T25n1509_015:0168c11_12"
    },
    {
        "source_sentence": "復次，菩薩思惟：「世間八法，賢聖所不能免，何況於我！」",
        "translation": "Furthermore, the bodhisattva thought, There are eight worldly dharmas that good men and sages can't avoid, so why wouldn't they avoid me?",
        "source": "T25n1509_015:0168c12_13"
    },
    {
        "source_sentence": "以是故，應當忍。",
        "translation": "Because of this, they should tolerate it.",
        "source": "T25n1509_015:0168c13_14"
    },
    {
        "source_sentence": "復次，菩薩思惟：「知此人身無牢無強，為老、病、死所逐；",
        "translation": "“Furthermore, the enlightening being thinks: Knowing that this man’s body is neither strong nor weak, he is driven by old age, sickness, and death.",
        "source": "T25n1509_015:0168c13_15"
    },
    {
        "source_sentence": "雖復天身清淨，無老、無病，耽著天樂，譬如醉人，不得修行道福、出家離欲。」",
        "translation": "Even though the body of the gods is pure, there's no old age or illness and they're addicted to heavenly pleasures, like a drunken man who doesn't cultivate the merits of the path and leave home free of desire.",
        "source": "T25n1509_015:0168c15_0"
    },
    {
        "source_sentence": "以是故，於此人身自忍修福，利益眾生。",
        "translation": "Because of this, they forbearably cultivate merit in their own bodies to benefit sentient beings.",
        "source": "T25n1509_015:0168c16_1"
    },
    {
        "source_sentence": "復次，菩薩思惟：「我受此四大、五眾身，應有種種苦分，無有受身而不苦者；",
        "translation": "“Furthermore, the enlightening beings think: When I experience these four elements of great compassion and the five assemblies of sentient beings, there should be various forms of suffering. There is no sensation body that is neither painful",
        "source": "T25n1509_015:0168c17_2"
    },
    {
        "source_sentence": "富貴、貧賤，出家、在家，愚智、明闇，無得免者。",
        "translation": "Wealthy and poor, leaving home and staying at home, ignorant and ignorant, in the darkness of ignorance, there's no one who can escape.",
        "source": "T25n1509_015:0168c19_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_015:0168c20_4"
    },
    {
        "source_sentence": "富貴之人，常有畏怖，守護財物，譬如肥羊，早就屠机，如烏銜肉，眾烏逐之；",
        "translation": "The wealthy and powerful always fearful, guarding their possessions like fat sheep that have been slaughtered long ago. Like a crow holding meat in its beak, the crows chase it away.",
        "source": "T25n1509_015:0168c20_5"
    },
    {
        "source_sentence": "貧賤之人，有飢、寒之苦。",
        "translation": "The poor and the humble suffer from hunger and cold.",
        "source": "T25n1509_015:0168c22_6"
    },
    {
        "source_sentence": "出家之人，今世雖苦，後世受福得道；",
        "translation": "A renunciant, though suffering in the present life, will receive merit and attain enlightenment in a later life.",
        "source": "T25n1509_015:0168c23_7"
    },
    {
        "source_sentence": "在家之人，今世雖樂，後世受苦。",
        "translation": "A layman, even though he's happy in the present life, will experience suffering in a later life.",
        "source": "T25n1509_015:0168c23_8"
    },
    {
        "source_sentence": "愚人先求今世樂，無常對至，後則受苦；",
        "translation": "Foolish people first seek worldly bliss in the present life, but it is impermanent to confront them. Later they experience suffering.",
        "source": "T25n1509_015:0168c24_9"
    },
    {
        "source_sentence": "智人思惟無常苦，後則受樂得道。",
        "translation": "A wise person contemplates the suffering of impermanence, and later they experience happiness and attain the path.",
        "source": "T25n1509_015:0168c25_10"
    },
    {
        "source_sentence": "如是等受身之人，無不有苦。」",
        "translation": "Such a person who receives the body like this has no suffering that isn't painful.",
        "source": "T25n1509_015:0168c26_11"
    },
    {
        "source_sentence": "是故菩薩應當行忍。",
        "translation": "Therefore, bodhisattvas should practice forbearance.",
        "source": "T25n1509_015:0168c27_12"
    },
    {
        "source_sentence": "復次，菩薩思惟：「一切世間皆苦，我當云何於中而欲求樂？」",
        "translation": "Furthermore, the bodhisattva thought, All worlds are painful, so how could I want to seek pleasure in them?",
        "source": "T25n1509_015:0168c27_13"
    },
    {
        "source_sentence": "復次，菩薩思惟：「我於無量劫中常受眾苦，無所利益，未曾為法；",
        "translation": "“Furthermore, the enlightening being thinks: For immeasurable kalpas I have always suffered all kinds of pain; benefiting no one is ever beneficial to me.",
        "source": "T25n1509_015:0168c29_0"
    },
    {
        "source_sentence": "今日為眾生求佛道，雖受此苦，當得大利。",
        "translation": "Today, we seek the Buddha Way for the sake of sentient beings, and even though we experience this suffering, we'll attain great rewards.",
        "source": "T25n1509_015:0169a01_1"
    },
    {
        "source_sentence": "是故外、內諸苦，悉當忍受。」",
        "translation": "Therefore, external and internal sufferings will all be tolerated.",
        "source": "T25n1509_015:0169a02_2"
    },
    {
        "source_sentence": "復次，菩薩大心誓願：「若阿鼻泥犁苦，我當忍之，何況小苦而不能忍？",
        "translation": "Furthermore, the bodhisattva's great vow is, If there's pain in the avīci plow, I will tolerate it, so why wouldn't I tolerate minor pain?",
        "source": "T25n1509_015:0169a03_3"
    },
    {
        "source_sentence": "若小不忍，何能忍大？」",
        "translation": "If the small can't tolerate it, how can they tolerate the large?",
        "source": "T25n1509_015:0169a04_4"
    },
    {
        "source_sentence": "如是種種外法中忍，名曰法忍。",
        "translation": "Thus, these various kinds of forbearance in external dharmas are called Dharma forbearance.",
        "source": "T25n1509_015:0169a05_5"
    },
    {
        "source_sentence": "問曰：云何內心法中能忍？",
        "translation": "Q: How can it be tolerated in internal dharmas?",
        "source": "T25n1509_015:0169a06_6"
    },
    {
        "source_sentence": "答曰：菩薩思惟：「我雖未得道，諸結未斷，若當不忍，與凡人不異，",
        "translation": "Answer: The bodhisattva thought, Even though I haven't yet attained the path, my bonds haven't been cut, and if I don't tolerate them, they won't be different from ordinary people.",
        "source": "T25n1509_015:0169a06_7"
    },
    {
        "source_sentence": "非為菩薩。」",
        "translation": "It's not for bodhisattvas.",
        "source": "T25n1509_015:0169a08_8"
    },
    {
        "source_sentence": "復自思惟：「若我得道，斷諸結使，則無法可忍。」",
        "translation": "Again, he thought to himself, If I attained the path and ended the bonds, there wouldn't be anything to tolerate.",
        "source": "T25n1509_015:0169a08_9"
    },
    {
        "source_sentence": "復次，「飢渴、寒熱，是外魔軍；",
        "translation": "Furthermore, hunger, thirst, and cold and heat are the armies of Māra outside.",
        "source": "T25n1509_015:0169a09_10"
    },
    {
        "source_sentence": "結使、煩惱，是內魔賊。",
        "translation": "The bonds, tendencies, and afflictions are internal Māra and thieves.",
        "source": "T25n1509_015:0169a10_11"
    },
    {
        "source_sentence": "我當破此二軍以成佛道；",
        "translation": "I will destroy these two armies and attain buddhahood.",
        "source": "T25n1509_015:0169a10_12"
    },
    {
        "source_sentence": "若不爾者，佛道不成。」",
        "translation": "If that's not the case, the Buddha Way won't be accomplished.",
        "source": "T25n1509_015:0169a11_13"
    },
    {
        "source_sentence": "如說佛苦行六年，魔王來言：「剎利貴人，汝千分生中正有一分活耳！",
        "translation": "As it was said that the Buddha had been practicing austerities for six years, the Māra king came and said, Noble monk, you're one-thousandth alive in your birth!",
        "source": "T25n1509_015:0169a11_14"
    },
    {
        "source_sentence": "速起還國，布施修福，可得今世後世、人中天上之樂；",
        "translation": "You should quickly get up and return to your own country. By practicing charity and by accumulating merit you can attain the happiness of heavenly beings in present and future ages among human beings.",
        "source": "T25n1509_015:0169a13_15"
    },
    {
        "source_sentence": "道不可得，汝唐勤苦。",
        "translation": "The Way is ungraspable, and you're suffering from your Tang diligence.",
        "source": "T25n1509_015:0169a14_16"
    },
    {
        "source_sentence": "汝若不受軟言，守迷不起，我當將大軍眾來擊破汝！」",
        "translation": "If you don't accept soft words and don't get lost, I will come with a large army to strike you!",
        "source": "T25n1509_015:0169a15_17"
    },
    {
        "source_sentence": "菩薩言：「我今當破汝大力內軍，何況外軍？」",
        "translation": "The bodhisattva said, Now, I will defeat your mighty internal army, so why wouldn't I?",
        "source": "T25n1509_015:0169a16_18"
    },
    {
        "source_sentence": "魔言：「何等是我內軍？」",
        "translation": "The Māra said, What's my internal army?",
        "source": "T25n1509_015:0169a17_19"
    },
    {
        "source_sentence": "　「欲是汝初軍，　　憂愁為第二，",
        "translation": "Wishing to be your first army, sorrow is the second.",
        "source": "T25n1509_015:0169a17_20"
    },
    {
        "source_sentence": "　　飢渴第三軍，　　渴愛為第四，",
        "translation": "The third is hunger and thirst, while the fourth is thirst.",
        "source": "T25n1509_015:0169a17_20"
    },
    {
        "source_sentence": "　　睡眠第五軍，　　怖畏為第六，",
        "translation": "The fifth is the army of sloth and torpor, with fear as the sixth.",
        "source": "T25n1509_015:0169a17_20"
    },
    {
        "source_sentence": "　　疑悔第七軍，　　瞋恚為第八，",
        "translation": "The seventh assault of doubt and remorse is the eighth, anger.",
        "source": "T25n1509_015:0169a17_20"
    },
    {
        "source_sentence": "　　利養虛稱九，　　自高蔑人十。",
        "translation": "Beneficent and falsely called nine, self-exalted and despised by ten.",
        "source": "T25n1509_015:0169a17_20"
    },
    {
        "source_sentence": "　　如是等軍眾，　　厭沒出家人；",
        "translation": "Such an army of monks and nuns Were disillusioned with leaving home.",
        "source": "T25n1509_015:0169a17_20"
    },
    {
        "source_sentence": "　　我以禪智力，　　破汝此諸軍，",
        "translation": "With the power of my meditation and wisdom, I will defeat your armies.",
        "source": "T25n1509_015:0169a17_20"
    },
    {
        "source_sentence": "　　得成佛道已，　　度脫一切人。」",
        "translation": "After attaining the Buddha Way, he liberates all people.",
        "source": "T25n1509_015:0169a17_20"
    },
    {
        "source_sentence": "答曰：菩薩於此諸軍雖未能破，著忍辱鎧，捉智慧劍，執禪定楯，遮諸煩惱箭，",
        "translation": "Answer: Although the bodhisattvas can't break through these armies, they wear the armor of forbearance, grasp the sword of wisdom, hold the shield of meditation, and shield themselves from the arrows of afflictions.",
        "source": "T25n1509_015:0169a17_20"
    },
    {
        "source_sentence": "是名內忍。",
        "translation": "This is called internal tolerance.",
        "source": "T25n1509_015:0169a27_21"
    },
    {
        "source_sentence": "復次，菩薩於諸煩惱中，應當修忍，不應斷結。",
        "translation": "Furthermore, bodhisattvas should cultivate forbearance among the afflictions and not cut the bonds.",
        "source": "T25n1509_015:0169a28_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_015:0169a29_1"
    },
    {
        "source_sentence": "若斷結者，所失甚多，墮阿羅漢道中，與根敗無異。",
        "translation": "If someone breaks the fetters, they'll lose so much, and they'll fall into the path of the arhat, which is no different from the defeat of their faculties.",
        "source": "T25n1509_015:0169a29_2"
    },
    {
        "source_sentence": "是故遮而不斷，以修忍辱，不隨結使。",
        "translation": "Therefore, they are obstructed and not cut off because they cultivate patience and don't follow the bonds.",
        "source": "T25n1509_015:0169b01_3"
    },
    {
        "source_sentence": "問曰：云何結使未斷而能不隨？",
        "translation": "Q: How are the bonds and tendencies that haven't been cut but can they not be followed?",
        "source": "T25n1509_015:0169b02_4"
    },
    {
        "source_sentence": "答曰：正思惟故，雖有煩惱而能不隨。",
        "translation": "Answer: Because of right contemplation, even though there are afflictions, they can not follow them.",
        "source": "T25n1509_015:0169b03_5"
    },
    {
        "source_sentence": "復次，思惟觀空、無常相故，雖有妙好五欲，不生諸結。",
        "translation": "Furthermore, it's because they contemplate observing emptiness and impermanent characteristics, even though they have the five subtle and beautiful desires that don't give rise to bonds.",
        "source": "T25n1509_015:0169b04_0"
    },
    {
        "source_sentence": "譬如國王有一大臣，自覆藏罪，人所不知。",
        "translation": "It's like when a king has a minister who hides his sins and doesn't know them.",
        "source": "T25n1509_015:0169b05_1"
    },
    {
        "source_sentence": "王言：「取無脂肥羊來，汝若不得者，當與汝罪。」",
        "translation": "The king said, Take a fat and fat sheep that's not fat; if you can't get it, I'll punish you for your sins.",
        "source": "T25n1509_015:0169b06_2"
    },
    {
        "source_sentence": "大臣有智，繫一大羊，以草穀好養；",
        "translation": "The ministers of the assembly were wise and had a large flock of sheep to feed on grass and grain.",
        "source": "T25n1509_015:0169b07_3"
    },
    {
        "source_sentence": "日三以狼而畏怖之，羊雖得養，肥而無脂。",
        "translation": "Every three days he was frightened by the wolf and feared it. Although the sheep were able to raise them, they grew fat but no fat.",
        "source": "T25n1509_015:0169b08_4"
    },
    {
        "source_sentence": "牽羊與王，王遣人殺之，肥而無脂。",
        "translation": "He took the goat and gave it to the king, who sent someone to kill it, which was fat but without fat.",
        "source": "T25n1509_015:0169b09_5"
    },
    {
        "source_sentence": "王問：「云何得爾？」",
        "translation": "The king asked, How did you get it?",
        "source": "T25n1509_015:0169b10_6"
    },
    {
        "source_sentence": "答以上事。",
        "translation": "Answer to the above questions.",
        "source": "T25n1509_015:0169b10_7"
    },
    {
        "source_sentence": "菩薩亦如是，見無常、苦、空狼，令諸結使脂消，諸功德肉肥。",
        "translation": "Similarly, the bodhisattva sees impermanent, painful, and empty wolves, causing the fetters that cause fat to disappear and the flesh of merits to be fat.",
        "source": "T25n1509_015:0169b10_8"
    },
    {
        "source_sentence": "復次，菩薩功德福報無量故，其心柔軟，諸結使薄，易修忍辱。",
        "translation": "Furthermore, because the merits and rewards of a bodhisattva's virtue are immeasurable, his mind is flexible, his bonds are weak, and it's easy to cultivate forbearance.",
        "source": "T25n1509_015:0169b12_0"
    },
    {
        "source_sentence": "譬如師子王，在林中吼，有人見之，叩頭求哀，則放令去；",
        "translation": "It is as if a lion king were to roar in the forest. On seeing this lion king, some people clapped their heads and cried out in distress but they released him and ordered him to leave.",
        "source": "T25n1509_015:0169b13_1"
    },
    {
        "source_sentence": "虎豹小物，不能爾也。",
        "translation": "The small things of tigers and leopards can't do so.",
        "source": "T25n1509_015:0169b14_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_015:0169b15_3"
    },
    {
        "source_sentence": "師子王貴獸，有智分別故；",
        "translation": "The king of lions is a noble animal because it has discernment through knowledge.",
        "source": "T25n1509_015:0169b15_4"
    },
    {
        "source_sentence": "虎豹賤蟲，不知分別故。",
        "translation": "Tigers, leopards, and lowly insects don't know the distinction.",
        "source": "T25n1509_015:0169b16_0"
    },
    {
        "source_sentence": "又如壞軍，得值大將則活，值遇小兵則死。",
        "translation": "It's also like when an army breaks up and they meet a general, then they'll be alive, and if they meet a small army, then they'll die.",
        "source": "T25n1509_015:0169b16_1"
    },
    {
        "source_sentence": "復次，菩薩智慧力，觀瞋恚有種種諸惡，觀忍辱有種種功德，是故能忍結使。",
        "translation": "Furthermore, the bodhisattva's power of wisdom observes that anger has various bad qualities and observes that forbearance has various merits; therefore, he can tolerate the bonds and tendencies.",
        "source": "T25n1509_015:0169b17_2"
    },
    {
        "source_sentence": "復次，菩薩心有智力，能斷結使，為眾生故久住世間；",
        "translation": "“Furthermore, enlightening beings have the power of knowledge in their minds and are able to cut off the defilements. For the sake of sentient beings they dwell in the world for a long time.",
        "source": "T25n1509_015:0169b19_3"
    },
    {
        "source_sentence": "知結使是賊，是故忍而不隨。",
        "translation": "Knowing that the fetters are thieves, they tolerate and don't follow them.",
        "source": "T25n1509_015:0169b20_4"
    },
    {
        "source_sentence": "菩薩繫此結賊，不令縱逸而行功德；",
        "translation": "Enlightening beings are bound by these bonds of thief, preventing them from indulging in idleness and practicing virtue.",
        "source": "T25n1509_015:0169b21_5"
    },
    {
        "source_sentence": "譬如有賊，以因緣故不殺，堅閉一處而自修事業。",
        "translation": "It's like a thief who doesn't kill because of causes and conditions, firmly shuts himself up in one place, and cultivates his own business.",
        "source": "T25n1509_015:0169b22_6"
    },
    {
        "source_sentence": "復次，菩薩實知諸法相故，不以諸結使為惡，不以功德為妙；",
        "translation": "“Furthermore, because enlightening beings truly know the characteristics of all things, they do not regard fetters as evil and virtues as marvelous.",
        "source": "T25n1509_015:0169b23_7"
    },
    {
        "source_sentence": "是故於結不瞋，功德不愛。",
        "translation": "Therefore, they aren't angry at fetters and don't love merit.",
        "source": "T25n1509_015:0169b24_8"
    },
    {
        "source_sentence": "以此智力故，能修忍辱。",
        "translation": "Because of this power of knowledge, they can cultivate forbearance.",
        "source": "T25n1509_015:0169b25_9"
    },
    {
        "source_sentence": "　「菩薩斷除諸不善，　　乃至極微滅無餘；",
        "translation": "Enlightening beings annihilate all unwholesomeness, Up to the ultimate extinction without remainder.",
        "source": "T25n1509_015:0169b26_10"
    },
    {
        "source_sentence": "　　大功德福無有量，　　所造事業無不辦。",
        "translation": "The great virtues and merits are immeasurable; There is nothing that they cannot do.",
        "source": "T25n1509_015:0169b26_10"
    },
    {
        "source_sentence": "　　菩薩大智慧力故，　　於諸結使不能惱；",
        "translation": "Enlightening beings, by the power of great knowledge and wisdom, Are not troubled by fetters or tendencies.",
        "source": "T25n1509_015:0169b26_10"
    },
    {
        "source_sentence": "　　是故能知諸法相，　　生死涅槃一無二。」",
        "translation": "Therefore, they can know the characteristics of dharmas, and birth-and-death and nirvāṇa are one and not two.",
        "source": "T25n1509_015:0169b26_10"
    },
    {
        "source_sentence": "如偈說：如是種種因緣，雖未得道，於諸煩惱法中能忍，是名法忍。",
        "translation": "As a verse says, Such are the various causes and conditions for being able to tolerate the afflictive tendencies even though they haven't yet attained the path, which are called patience of the Dharma.",
        "source": "T25n1509_015:0169b26_10"
    },
    {
        "source_sentence": "復次，菩薩於一切法，知一相無二。",
        "translation": "Furthermore, bodhisattvas know that the single characteristic of all dharmas is without duality.",
        "source": "T25n1509_015:0169c03_11"
    },
    {
        "source_sentence": "一切法可識相，故言一。",
        "translation": "All dharmas can be discerned, so they're called one.",
        "source": "T25n1509_015:0169c04_12"
    },
    {
        "source_sentence": "眼識識色，乃至意識識法，是可識相法，故言一。",
        "translation": "Consciousness of the eye and consciousness of form, up to consciousness of the mind and dharmas are qualities that can be discerned; therefore, they are said to be one.",
        "source": "T25n1509_015:0169c04_13"
    },
    {
        "source_sentence": "復次，一切法可知相，故言一。",
        "translation": "Furthermore, all factors can be known by their characteristic marks:",
        "source": "T25n1509_015:0169c05_14"
    },
    {
        "source_sentence": "苦法智、苦比智，知苦諦；",
        "translation": "By knowledge of the law in relation to suffering and by knowledge of the inference from suffering they know the truth of suffering.",
        "source": "T25n1509_015:0169c06_15"
    },
    {
        "source_sentence": "集法智、集比智，知集諦；",
        "translation": "The knowledge of the law in relation to accumulation and the inferential knowledge in relation to accumulation know the truth of accumulation.",
        "source": "T25n1509_015:0169c07_16"
    },
    {
        "source_sentence": "滅法智、滅比智，知滅諦；",
        "translation": "The knowledge of the law in relation to cessation and inferential knowledge in relation to cessation know the truth of cessation.",
        "source": "T25n1509_015:0169c07_17"
    },
    {
        "source_sentence": "道法智、道比智，知道諦。",
        "translation": "cognition of the path as a teaching and subsequent cognition of the path as knowing the truths.",
        "source": "T25n1509_015:0169c08_18"
    },
    {
        "source_sentence": "及善世智，亦知苦、集、滅、道、虛空、非智緣滅，是可知相法，故言一。",
        "translation": "And the knowledge of the good world also knows suffering, arising, cessation, the path, space, and cessation that are not the objects of knowledge. These are knowable dharmas with characteristics; therefore, it is said to be one.",
        "source": "T25n1509_015:0169c08_19"
    },
    {
        "source_sentence": "復次，一切法可緣相，故言一。",
        "translation": "Furthermore, all factors can be the supporting object: that is why they are said to be one.",
        "source": "T25n1509_015:0169c10_20"
    },
    {
        "source_sentence": "眼識及眼識相應法緣色；",
        "translation": "Consciousness of the eye and matter conditioned by factors associated with consciousness of the eye.",
        "source": "T25n1509_015:0169c10_21"
    },
    {
        "source_sentence": "耳識、鼻識、舌識、身識亦如是；",
        "translation": "The same applies to consciousness of the ear, to consciousness of the nose, to consciousness of the tongue and to consciousness of the body.",
        "source": "T25n1509_015:0169c11_22"
    },
    {
        "source_sentence": "意識及意識相應法，亦緣眼、亦緣色、亦緣眼識，乃至緣意、緣法、緣意識。",
        "translation": "Consciousness of the mind and factors associated with consciousness of the mind are also conditioned by the eye, also by form and also by consciousness of the eye, up to conditioned by mind, conditioned by factors and conditioned by consciousness of the",
        "source": "T25n1509_015:0169c12_23"
    },
    {
        "source_sentence": "一切法可緣相，故言一。",
        "translation": "All dharmas can be conditioned by characteristics, so they're called one.",
        "source": "T25n1509_015:0169c13_24"
    },
    {
        "source_sentence": "復次，有人言：一切法各皆一，一復有一名為二，三一名為三，如是乃至千萬，",
        "translation": "“Furthermore, some people claim that all factors are one and the same: one further name is twofold. Three form one; one forms three. In this way, up to a thousand.",
        "source": "T25n1509_015:0169c14_25"
    },
    {
        "source_sentence": "皆是一而假名為千萬。",
        "translation": "They are all one, but they're nominally called a thousand.",
        "source": "T25n1509_015:0169c16_26"
    },
    {
        "source_sentence": "復次，一切法中有相，故言一；",
        "translation": "“Furthermore, because all things have characteristics within them, they are said to be one.",
        "source": "T25n1509_015:0169c16_27"
    },
    {
        "source_sentence": "一相故，名為一。",
        "translation": "Because it has one characteristic, it's called one.",
        "source": "T25n1509_015:0169c17_28"
    },
    {
        "source_sentence": "一切物名為法，法相故名為一。",
        "translation": "All things are called dharmas, and because of the characteristics of dharmas, they're called one.",
        "source": "T25n1509_015:0169c17_29"
    },
    {
        "source_sentence": "如是等無量一門，破異相，不著一，是名法忍。",
        "translation": "Such an immeasurable number of such one approaches that refute dissimilar characteristics and don't cling to one, this is called the Dharma forbearance.",
        "source": "T25n1509_015:0169c18_30"
    },
    {
        "source_sentence": "復次，菩薩觀一切為二。",
        "translation": "Furthermore, the bodhisattva observes that all are two.",
        "source": "T25n1509_015:0169c20_0"
    },
    {
        "source_sentence": "何等二？",
        "translation": "What are these two?",
        "source": "T25n1509_015:0169c20_1"
    },
    {
        "source_sentence": "二名內、外相。",
        "translation": "The second is called internal and external characteristics.",
        "source": "T25n1509_015:0169c20_2"
    },
    {
        "source_sentence": "內、外相故，內非外相，外非內相。",
        "translation": "Because of the internal and the external characteristic marks, what is internal is not what is external; what is external is not what is internal.",
        "source": "T25n1509_015:0169c21_3"
    },
    {
        "source_sentence": "復次，一切法有、無相故為二。",
        "translation": "Furthermore, all factors are twofold because they exist and have no characteristic marks.",
        "source": "T25n1509_015:0169c21_4"
    },
    {
        "source_sentence": "空、不空，常、非常，我、非我，色、非色，可見、不可見，有對、非有對，",
        "translation": "Emptiness and non emptiness, permanence and impermanence, self and what’s not self, form and what’s not form, visible and invisible, resistant and unresisting.",
        "source": "T25n1509_015:0169c22_5"
    },
    {
        "source_sentence": "有漏、無漏，有為、無為，心法、非心法，心數法、非心數法，心相應法、非心相應法。",
        "translation": "They are contaminated and uncontaminated, conditioned and unconditioned, mental dharmas, non-mental dharmas, mental factors, factors not mental factors, factors counted by mind and factors not counted by mind, factors associated with mind and factors not",
        "source": "T25n1509_015:0169c23_6"
    },
    {
        "source_sentence": "如是無量二門，破一不著二，是名為法忍。",
        "translation": "Thus, these two immeasurable approaches that refute one and don't cling to two are called the tolerance of the Dharma.",
        "source": "T25n1509_015:0169c25_7"
    },
    {
        "source_sentence": "復次，菩薩或觀一切法為三。",
        "translation": "Furthermore, the bodhisattva sometimes observes all dharmas as three.",
        "source": "T25n1509_015:0169c26_8"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T25n1509_015:0169c27_9"
    },
    {
        "source_sentence": "下、中、上，善、不善、無記，有、無、非有非無，見諦斷、思惟斷、無斷，",
        "translation": "Good, bad, neutral, and neutral are to be abandoned through the vision of the truths. They are to be abandoned through insight, through reflection, or without.",
        "source": "T25n1509_015:0169c27_10"
    },
    {
        "source_sentence": "學、無學、非學非無學，報、有報、非報非有報。",
        "translation": "What's learned, what's post-learning, what's not learned, what's neither learned nor post-learning, and what's rewarded, rewarded, and what's not rewarded are not rewarded.",
        "source": "T25n1509_015:0169c28_11"
    },
    {
        "source_sentence": "如是無量三門，破一不著異，是名為法忍。",
        "translation": "Thus, these immeasurable three approaches that break through one and don't cling to differences are called the tolerance of the Dharma.",
        "source": "T25n1509_015:0169c29_12"
    },
    {
        "source_sentence": "復次，菩薩雖未得無漏道，結使未斷，能信無漏聖法及三種法印：一者、一切有為生法無常等印，",
        "translation": "“Furthermore, even though enlightening beings have not yet attained the uncontaminated path and have not cut off the bonds of afflictions, they are able to believe in the uncontaminated holy teachings and three kinds of",
        "source": "T25n1509_015:0170a01_13"
    },
    {
        "source_sentence": "二者、一切法無我印，三者、涅槃實法印。",
        "translation": "The second is the sign that all dharmas lack self, and the third is the sign of the true dharma of nirvāṇa.",
        "source": "T25n1509_015:0170a03_14"
    },
    {
        "source_sentence": "得道賢聖人，自得自知；",
        "translation": "Good men and sages who have attained the Way know it for themselves.",
        "source": "T25n1509_015:0170a04_15"
    },
    {
        "source_sentence": "菩薩雖未得道，能信能受，是名法忍。",
        "translation": "Although a bodhisattva has yet to attain the path, he's able to believe and accept it, which is called patience of the Dharma.",
        "source": "T25n1509_015:0170a05_16"
    },
    {
        "source_sentence": "復次，於十四難不答法中有常、無常等，觀察無礙，不失中道，是法能忍，",
        "translation": "Furthermore, in the fourteen difficult questions he does not answer, there are such things as permanence and impermanence. He observes them without obstruction and doesn’t lose the middle way. This is the Dharma that can tolerate.",
        "source": "T25n1509_015:0170a06_17"
    },
    {
        "source_sentence": "是為法忍。",
        "translation": "This is the forbearance of the Dharma.",
        "source": "T25n1509_015:0170a07_18"
    },
    {
        "source_sentence": "如一比丘於此十四難思惟觀察，不能通達，心不能忍；",
        "translation": "“Suppose a monk is unable to comprehend or comprehend these fourteen difficulties, and his mind is unable to endure them.",
        "source": "T25n1509_015:0170a08_0"
    },
    {
        "source_sentence": "持衣鉢至佛所，白佛言：「佛能為我解此十四難，使我意了者，當作弟子；",
        "translation": "They brought their robes and bowls to the Buddha and said to him: The Buddha will be able to resolve these fourteen difficulties for me, so that I can understand them.",
        "source": "T25n1509_015:0170a09_1"
    },
    {
        "source_sentence": "若不能解，我當更求餘道！」",
        "translation": "If you can't understand it, I will seek another path!",
        "source": "T25n1509_015:0170a11_2"
    },
    {
        "source_sentence": "佛告：「癡人！",
        "translation": "The Buddha told him, Foolish man!",
        "source": "T25n1509_015:0170a11_3"
    },
    {
        "source_sentence": "汝本共我要誓『若答十四難，汝作我弟子』耶？」",
        "translation": "Did you originally make a vow with me, 'If you answer the fourteen difficult questions, you'll be my disciple?'",
        "source": "T25n1509_015:0170a11_4"
    },
    {
        "source_sentence": "比丘言：「不也！」",
        "translation": "The monk said, No!",
        "source": "T25n1509_015:0170a13_0"
    },
    {
        "source_sentence": "佛言：「汝癡人今何以言『若不答我，不作弟子』？",
        "translation": "The Buddha said, Why are you foolish people now saying, 'If you don't answer me, why won't you become a disciple?'",
        "source": "T25n1509_015:0170a13_1"
    },
    {
        "source_sentence": "我為老、病、死人說法濟度；",
        "translation": "I teach the doctrine for the salvation of those who are old, sick, and dead.",
        "source": "T25n1509_015:0170a14_2"
    },
    {
        "source_sentence": "此十四難是鬪諍法，於法無益，但是戲論，何用問為？",
        "translation": "These fourteen objections constitute the method of dispute. They are not helpful in regard to the dharma but merely a matter of argument. Why would there be any need to ask questions?",
        "source": "T25n1509_015:0170a14_3"
    },
    {
        "source_sentence": "若為汝答，汝心不了，至死不解，不能得脫生、老、病、死。",
        "translation": "If I answer for you, your mind won't understand it until death and doesn't understand it, and you won't be able to escape birth, old age, illness, or death.",
        "source": "T25n1509_015:0170a16_4"
    },
    {
        "source_sentence": "譬如有人身被毒箭，親屬呼醫，欲為出箭塗藥，便言：『未可出箭，我先當知汝姓字、親里，",
        "translation": "Good man, it is analogous to someone whose body has been struck by a poisonous arrow and his relatives calling for an expert physician. Wishing to pull the arrow out so that he can administer the ointment, they say, “We should",
        "source": "T25n1509_015:0170a17_5"
    },
    {
        "source_sentence": "父、母年歲；",
        "translation": "Their fathers and mothers are respectively one year old and five years old.",
        "source": "T25n1509_015:0170a19_6"
    },
    {
        "source_sentence": "次欲知箭出在何山，何木、何羽，作箭鏃者為是何人，是何等鐵；",
        "translation": "“Then the enlightening being wishes to know which mountain the arrow comes from, what wood it is made of, and what its members are. To whom does the arrow-header belong? What sort of iron is it?",
        "source": "T25n1509_015:0170a19_7"
    },
    {
        "source_sentence": "復欲知弓何山木，何蟲角；",
        "translation": "Again, they want to know where the bow is made of mountain trees and where the horns of the insects are.",
        "source": "T25n1509_015:0170a21_8"
    },
    {
        "source_sentence": "復欲知藥是何處生，是何種名。",
        "translation": "Again, they want to know where the medicine is produced and what its name is.",
        "source": "T25n1509_015:0170a21_9"
    },
    {
        "source_sentence": "如是等事，盡了了知之，然後聽汝出箭塗藥。』」",
        "translation": "Know all these things like this, and then I'll listen to you as you produce the arrow-smearing medicine.'",
        "source": "T25n1509_015:0170a22_10"
    },
    {
        "source_sentence": "佛問比丘：「此人可得知此眾事，然後出箭不？」",
        "translation": "The Buddha asked the monk, Can this person know these things and then produce an arrow?",
        "source": "T25n1509_015:0170a23_11"
    },
    {
        "source_sentence": "比丘言：「不可得知！",
        "translation": "The monks said, You can't tell!",
        "source": "T25n1509_015:0170a24_12"
    },
    {
        "source_sentence": "若待盡知，此則已死。」",
        "translation": "If he waits until he knows it completely, then he'll die.",
        "source": "T25n1509_015:0170a25_13"
    },
    {
        "source_sentence": "佛言：「汝亦如是！",
        "translation": "The Buddha said, So it is with you!",
        "source": "T25n1509_015:0170a25_14"
    },
    {
        "source_sentence": "為邪見箭愛毒塗，已入汝心，欲拔此箭，作我弟子；",
        "translation": "Because the arrow of wrong views is smeared with the poisonous stain of thirst, I have entered into your mind.",
        "source": "T25n1509_015:0170a26_15"
    },
    {
        "source_sentence": "而不欲出箭，方欲求盡世間常、無常，邊、無邊等，求之未得，則失慧命，",
        "translation": "They don’t want to get out of the arrow but only want to search for the end of worldly permanence and impermanence, extremes and infinities, etc. If they seek them but don’t attain them, they’ll lose their",
        "source": "T25n1509_015:0170a27_16"
    },
    {
        "source_sentence": "與畜生同死，自投黑闇！」",
        "translation": "They'll die together with the animals and throw themselves into darkness!",
        "source": "T25n1509_015:0170a29_0"
    },
    {
        "source_sentence": "比丘慚愧，深識佛語，即得阿羅漢道。",
        "translation": "The bhikṣu felt ashamed and became deeply aware of the Buddha’s words. So he attained the path of arhatship.",
        "source": "T25n1509_015:0170a29_1"
    },
    {
        "source_sentence": "復次，菩薩欲作一切智人，應推求一切法，知其實相；",
        "translation": "“Furthermore, if enlightening beings want to be omniscient, they should investigate all things and know their true characteristics.",
        "source": "T25n1509_015:0170b01_2"
    },
    {
        "source_sentence": "於十四難中不滯、不礙，知其是心重病，能出、能忍，是名法忍。",
        "translation": "Being unhindered and unobstructed in the fourteen difficulties, knowing they're serious mental illnesses, and being able to escape and tolerate them is called forbearance of the Dharma.",
        "source": "T25n1509_015:0170b02_3"
    },
    {
        "source_sentence": "復次，佛法甚深，清淨微妙，演暢種種無量法門，能一心信受，不疑、不悔，",
        "translation": "“Furthermore, the buddha-dharma is profound, pure and subtle. He expounds innumerable various teachings, able to wholeheartedly believe and receive them without doubt or regret.",
        "source": "T25n1509_015:0170b04_4"
    },
    {
        "source_sentence": "是名法忍。",
        "translation": "This is called the forbearance of the Dharma.",
        "source": "T25n1509_015:0170b05_5"
    },
    {
        "source_sentence": "如佛所言：「諸法雖空，亦不斷，亦不滅；",
        "translation": "As the Buddha has said: “Although all things are empty, they do not arise or perish.",
        "source": "T25n1509_015:0170b06_0"
    },
    {
        "source_sentence": "諸法因緣相續生，亦非常；",
        "translation": "The causes and conditions for the successive production of all dharmas are also impermanent.",
        "source": "T25n1509_015:0170b06_1"
    },
    {
        "source_sentence": "諸法雖無神，亦不失罪福。」",
        "translation": "Although the dharmas lack spirit, they don't lose their sins and merits.",
        "source": "T25n1509_015:0170b07_2"
    },
    {
        "source_sentence": "一心念頃，身諸法、諸根、諸慧，轉滅不停，不至後念；",
        "translation": "In a moment of thought, all bodily factors, all faculties, and all wisdoms develop and cease without stopping. They do not reach subsequent moments of thought.",
        "source": "T25n1509_015:0170b08_3"
    },
    {
        "source_sentence": "新新生滅，亦不失無量世中因緣業。",
        "translation": "When new birth ceases, it doesn't lose the causes and conditions for karma in measureless worlds.",
        "source": "T25n1509_015:0170b09_4"
    },
    {
        "source_sentence": "諸眾、界、入中皆空無神，而眾生輪轉五道中受生死。",
        "translation": "All the sentient beings, realms, and sense-fields are empty and without spirit, yet sentient beings are subject to birth and death in the five destinies of transmigration.",
        "source": "T25n1509_015:0170b10_5"
    },
    {
        "source_sentence": "如是等種種甚深微妙法，雖未得佛道，能信能受不疑、不悔，是為法忍。",
        "translation": "Such are the various profound and subtle dharmas that, even though they haven't yet attained the Buddha Way, can be believed, accepted, and experienced without doubt or regret, which is the Dharma forbearance.",
        "source": "T25n1509_015:0170b11_6"
    },
    {
        "source_sentence": "復次，阿羅漢、辟支佛畏惡生死，早求入涅槃；",
        "translation": "“Furthermore, arhats and pratyekabuddhas fear the evil of birth and death and soon seek to enter nirvana.",
        "source": "T25n1509_015:0170b13_7"
    },
    {
        "source_sentence": "菩薩未得成佛，而欲求一切智，欲憐愍眾生，欲了了分別知諸法實相，",
        "translation": "Before enlightening beings attain buddhahood, they want to seek omniscience. They want to have compassion for sentient beings. They want to comprehend and distinguish the true characteristics of all things.",
        "source": "T25n1509_015:0170b14_8"
    },
    {
        "source_sentence": "是中能忍，是名法忍。",
        "translation": "Being able to tolerate this is called forbearance of the Dharma.",
        "source": "T25n1509_015:0170b16_0"
    },
    {
        "source_sentence": "問曰：云何觀諸法實相？",
        "translation": "Q: How do you contemplate the true characteristics of dharmas?",
        "source": "T25n1509_015:0170b16_1"
    },
    {
        "source_sentence": "答曰：觀知諸法無有瑕隟，不可破、不可壞，是為實相。",
        "translation": "Answer: Observing that all dharmas lack flawlessness, are indestructible and indestructible, is their true characteristic.",
        "source": "T25n1509_015:0170b17_2"
    },
    {
        "source_sentence": "問曰：一切語，皆可答、可破、可壞，云何言「不可破壞，是為實相」？",
        "translation": "Q: All words can be answered, refuted, and destroyed, so why does it say, indestructible, which is the true characteristic?",
        "source": "T25n1509_015:0170b18_3"
    },
    {
        "source_sentence": "答曰：以諸法不可破故，佛法中一切言語道過，心行處滅，常不生不滅，",
        "translation": "Answer: Because the dharmas can't be broken, all the verbal paths and faults in the Buddha's teachings are extinguished by mind and place of action, which always arise and don't arise.",
        "source": "T25n1509_015:0170b19_4"
    },
    {
        "source_sentence": "如涅槃相。",
        "translation": "It's like the characteristic of nirvāṇa.",
        "source": "T25n1509_015:0170b21_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_015:0170b21_6"
    },
    {
        "source_sentence": "若諸法相實有，不應無；",
        "translation": "If the characteristics of things really existed, they would not exist.",
        "source": "T25n1509_015:0170b21_7"
    },
    {
        "source_sentence": "若諸法先有今無，則是斷滅。",
        "translation": "If all dharmas were formerly present but are not present now, they would be abandoned.",
        "source": "T25n1509_015:0170b22_8"
    },
    {
        "source_sentence": "復次，諸法不應是常。",
        "translation": "Furthermore, all dharmas should not be eternal.",
        "source": "T25n1509_015:0170b23_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_015:0170b23_10"
    },
    {
        "source_sentence": "若常則無罪、無福，無所傷殺，亦無施命，亦無修行利益，亦無縛、無解，",
        "translation": "If it were permanent, there would be no sin and no merit, no injury or killing, no giving or life, no benefit of practice, no bondage or liberation.",
        "source": "T25n1509_015:0170b23_11"
    },
    {
        "source_sentence": "世間則是涅槃。",
        "translation": "The world is nirvāṇa.",
        "source": "T25n1509_015:0170b25_12"
    },
    {
        "source_sentence": "如是等因緣故，諸法不應常。",
        "translation": "Because of such causes and conditions, the dharmas should not be permanent.",
        "source": "T25n1509_015:0170b25_13"
    },
    {
        "source_sentence": "若諸法無常，則是斷滅，亦無罪、無福，亦無增損功德業，因緣果報亦失。",
        "translation": "If all dharmas are impermanent, then they are eliminated, and there's no fault or merit, no increase or decrease in virtuous actions, and the results of causes and conditions are also lost.",
        "source": "T25n1509_015:0170b26_14"
    },
    {
        "source_sentence": "如是等因緣故，諸法不應無常。",
        "translation": "Because of such causes and conditions, the dharmas should not be impermanent.",
        "source": "T25n1509_015:0170b28_15"
    },
    {
        "source_sentence": "問曰：汝言「佛法中常亦不實，無常亦不實」，是事不然！",
        "translation": "Q: You say, 'In the Buddha's teaching, permanence is also unreal, and impermanence is also unreal,' but that's not true!",
        "source": "T25n1509_015:0170b29_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_015:0170c01_17"
    },
    {
        "source_sentence": "佛法中常亦實，無常亦實。",
        "translation": "In the Buddha's teaching, permanence is also real, and impermanence is also real.",
        "source": "T25n1509_015:0170c01_18"
    },
    {
        "source_sentence": "常者，數緣盡、非數緣盡、虛空，不生、不住、不滅故，是常相；",
        "translation": "“ constancy”: Because the condition as direct antecedent is exhausted by calculation, the uncalculated condition as direct antecedent is exhausted by calculation, and because space does not arise, does not abide, and does not perish, it is",
        "source": "T25n1509_015:0170c02_19"
    },
    {
        "source_sentence": "無常者，五眾生、住、滅故，無常相。",
        "translation": "Impermanent refers to the characteristic of impermanence because five sentient beings, abiding and ceasing, are impermanent.",
        "source": "T25n1509_015:0170c03_20"
    },
    {
        "source_sentence": "汝何以言：「常、無常皆不實」？",
        "translation": "Why do you say, Neither permanent nor impermanent is real?",
        "source": "T25n1509_015:0170c04_21"
    },
    {
        "source_sentence": "答曰：聖人有二種語：一者、方便語，二者、直語。",
        "translation": "Answer: There are two kinds of words for noble people: one, skillful words and two, straightforward words.",
        "source": "T25n1509_015:0170c04_22"
    },
    {
        "source_sentence": "方便語者，為人、為因緣故。",
        "translation": "The words of skillful means are for the sake of people and because of causes and conditions.",
        "source": "T25n1509_015:0170c05_23"
    },
    {
        "source_sentence": "為人者，為眾生說是常、是無常，如對治悉檀中說。",
        "translation": "For the sake of people, he teaches that it's permanent and impermanent for sentient beings, as explained in the antidote siddhânta.",
        "source": "T25n1509_015:0170c06_24"
    },
    {
        "source_sentence": "若說無常，欲拔眾生三界著樂；",
        "translation": "If they teach impermanence, they want to remove the attachments and pleasures of sentient beings in the three realms.",
        "source": "T25n1509_015:0170c07_25"
    },
    {
        "source_sentence": "佛思惟：「以何令眾生得離欲？」",
        "translation": "The Buddha thought, How does it cause sentient beings to attain freedom from desire?",
        "source": "T25n1509_015:0170c08_26"
    },
    {
        "source_sentence": "是故說無常法。",
        "translation": "Therefore, it's said to be impermanent dharmas.",
        "source": "T25n1509_015:0170c08_27"
    },
    {
        "source_sentence": "　「若觀無生法，　　於生法得離；",
        "translation": "“If one observes the nonorigination of things, They will be freed from the dharmas that arise.",
        "source": "T25n1509_015:0170c09_28"
    },
    {
        "source_sentence": "　　若觀無為法，　　於有為得離。」",
        "translation": "If someone observes unconditioned things, they'll be freed from conditioned things.",
        "source": "T25n1509_015:0170c09_28"
    },
    {
        "source_sentence": "如偈說：云何生？",
        "translation": "As a verse says: How are they produced?",
        "source": "T25n1509_015:0170c09_28"
    },
    {
        "source_sentence": "生名因緣和合，無常，不自在，屬因緣，有老病死相、欺誑相、破壞相，",
        "translation": "Birth is called a conjunction of causes and conditions. It is impermanent, not self-willed; it belongs to causes and conditions. It has the characteristics of old age, sickness, death, hypocrisy, and destruction.",
        "source": "T25n1509_015:0170c12_29"
    },
    {
        "source_sentence": "是名生；",
        "translation": "This is called arising.",
        "source": "T25n1509_015:0170c13_30"
    },
    {
        "source_sentence": "生則是有為法。",
        "translation": "'Birth is a conditioned dharma.'",
        "source": "T25n1509_015:0170c14_0"
    },
    {
        "source_sentence": "如對治悉檀說。",
        "translation": "It's as explained in the antidote siddhânta.",
        "source": "T25n1509_015:0170c14_1"
    },
    {
        "source_sentence": "常無常，非實相，二俱過故。",
        "translation": "Impermanent and impermanent are not real characteristics, because both are faulty.",
        "source": "T25n1509_015:0170c14_2"
    },
    {
        "source_sentence": "若諸法非有常非無常，是為愚癡論。",
        "translation": "If all dharmas are neither permanent nor impermanent, this is a theory of folly.",
        "source": "T25n1509_015:0170c15_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_015:0170c16_4"
    },
    {
        "source_sentence": "若非有則破無，若非無則破有；",
        "translation": "If there is no existence, then it refutes nonexistence; if there is no nonexistence, then it refutes existence.",
        "source": "T25n1509_015:0170c16_5"
    },
    {
        "source_sentence": "若破此二事，更有何法可說？",
        "translation": "If you refute these two things, what other thing can be explained?",
        "source": "T25n1509_015:0170c17_6"
    },
    {
        "source_sentence": "問曰：佛法常空相中，非有、非無；",
        "translation": "Question: Among the characteristics of permanence and emptiness of Buddhist doctrine, there is neither existence nor nonexistence.",
        "source": "T25n1509_015:0170c17_7"
    },
    {
        "source_sentence": "空以除有，空空遮無，是為非有、非無，何以言愚癡論？",
        "translation": "Emptiness excludes existence and emptiness obscures nonexistence, which are neither existent nor nonexistent, so why is it called a theory of folly?",
        "source": "T25n1509_015:0170c18_8"
    },
    {
        "source_sentence": "答曰：佛法實相，不受、不著。",
        "translation": "Answer: The true characteristics of the Buddha's teaching are not received or attached.",
        "source": "T25n1509_015:0170c19_9"
    },
    {
        "source_sentence": "汝非有、非無受著故，是為癡論。",
        "translation": "Because you aren't attached to feelings that are neither existent nor nonexistent, this is the theory of delusion.",
        "source": "T25n1509_015:0170c20_10"
    },
    {
        "source_sentence": "若言非有、非無，是則可說、可破，是心生處，是鬪諍處。",
        "translation": "If someone says it's neither existent nor nonexistent, then they can be explained and refuted, which is the place where mind arises and the place where fighting occurs.",
        "source": "T25n1509_015:0170c21_11"
    },
    {
        "source_sentence": "佛法則不然，雖因緣故說非有、非無，不生著；",
        "translation": "The Buddha-dharma is not like that: although it is said to be neither existent nor nonexistent because of causes and conditions, it does not give rise to attachment.",
        "source": "T25n1509_015:0170c22_12"
    },
    {
        "source_sentence": "不生著則不可壞、不可破。",
        "translation": "If they don't give rise to attachment, then they can't be destroyed or broken.",
        "source": "T25n1509_015:0170c23_13"
    },
    {
        "source_sentence": "諸法若有邊，若無邊，若有無邊，若非有無邊；",
        "translation": "If all things are finite, if they are infinite, and if they are infinite, or if they are not infinite.",
        "source": "T25n1509_015:0170c24_14"
    },
    {
        "source_sentence": "若死後有去，若死後無去，若死後有去無去，若死後非有去非無去；",
        "translation": "If there is going after death, there is no going after death; if there is going after death, there is no going; if there is going after death, there is no going; if there is going after death, there is no going; and if there is neither going",
        "source": "T25n1509_015:0170c25_15"
    },
    {
        "source_sentence": "是身是神，身異神異，亦如是，皆不實。",
        "translation": "This body is a soul, and the body is different from the soul. The same applies to dissimilarity of body and dissimilarity of spirit.",
        "source": "T25n1509_015:0170c26_16"
    },
    {
        "source_sentence": "於六十二見中觀諸法，亦皆不實。",
        "translation": "In the sixty-two views, he observes that all dharmas are also unreal.",
        "source": "T25n1509_015:0170c27_17"
    },
    {
        "source_sentence": "如是一切除却，信佛法清淨不壞相，心不悔、不轉，是名法忍。",
        "translation": "Removing all of these and believing in the pure and indestructible characteristics of the Buddha's teaching, his mind isn't remorseful or changed, which is called forbearance of the Dharma.",
        "source": "T25n1509_015:0170c28_18"
    },
    {
        "source_sentence": "復次，有、無二邊，觀諸法生時、住時，則為有見相；",
        "translation": "“Furthermore, when one observes the time of the arising and the time of abiding of all things, then there is vision.",
        "source": "T25n1509_015:0170c29_19"
    },
    {
        "source_sentence": "觀諸法老時、壞時，則為無見相；",
        "translation": "When one observes the dharmas, at the time of old age and at the time of disintegration, one does not see their characteristics.",
        "source": "T25n1509_015:0171a02_0"
    },
    {
        "source_sentence": "三界眾生，多著此二見相。",
        "translation": "Many sentient beings in the three realms are attached to these two views and characteristics.",
        "source": "T25n1509_015:0171a02_1"
    },
    {
        "source_sentence": "是二種法，虛誑不實。",
        "translation": "These are two kinds of dharmas that are false and unreal.",
        "source": "T25n1509_015:0171a03_2"
    },
    {
        "source_sentence": "若實有相則不應無。",
        "translation": "If there really are marks, then they shouldn't be nonexistent.",
        "source": "T25n1509_015:0171a03_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_015:0171a04_4"
    },
    {
        "source_sentence": "今無先有，則墮斷中；",
        "translation": "If there is no pre-existing thing now, one will fall into annihilation.",
        "source": "T25n1509_015:0171a04_5"
    },
    {
        "source_sentence": "若斷，是則不然。",
        "translation": "If it is to be abandoned, then this is not right.",
        "source": "T25n1509_015:0171a05_0"
    },
    {
        "source_sentence": "復次，一切諸法，名字和合故，謂之為有；",
        "translation": "“Furthermore, all things are said to exist because of the conjunction of names.",
        "source": "T25n1509_015:0171a05_1"
    },
    {
        "source_sentence": "以是故，名字和合所生法不可得。",
        "translation": "Because of this, the dharmas that arise from the conjunction of names and words are unobtainable.",
        "source": "T25n1509_015:0171a06_2"
    },
    {
        "source_sentence": "問曰：名字所生法，雖不可得，則有名字和合！",
        "translation": "Q: Although the dharmas produced by names are unobtainable, there's a combination of names!",
        "source": "T25n1509_015:0171a07_3"
    },
    {
        "source_sentence": "答曰：若無法，名字為誰而和合？",
        "translation": "Answer: If there's no such thing, then where will names be combined?",
        "source": "T25n1509_015:0171a08_4"
    },
    {
        "source_sentence": "是則無名字。",
        "translation": "Then there's no name.",
        "source": "T25n1509_015:0171a08_5"
    },
    {
        "source_sentence": "復次，若諸法實有，不應以心識故知有；",
        "translation": "Furthermore, if all things really exist, one should not know them to exist because of mental consciousness.",
        "source": "T25n1509_015:0171a09_6"
    },
    {
        "source_sentence": "若以心識故知有，是則非有。",
        "translation": "If someone knows it exists because of mind and consciousness, then they don't have it.",
        "source": "T25n1509_015:0171a10_7"
    },
    {
        "source_sentence": "如地堅相，以身根、身識知故有，若無身根、身識知，則無堅相。",
        "translation": "Just as the characteristic of firmness of the earth exists because it is known through the body faculty and bodily consciousness. If there were no bodily faculty or bodily consciousness, there would be no characteristic of firmness.",
        "source": "T25n1509_015:0171a10_8"
    },
    {
        "source_sentence": "問曰：身根，身識，若知、若不知，而地常是堅相！",
        "translation": "Q: The body faculty and body consciousness know or don't know, but the earth always has a resolute characteristic!",
        "source": "T25n1509_015:0171a12_9"
    },
    {
        "source_sentence": "答曰：若先自知有堅相，若從他聞則知有堅相；",
        "translation": "Answer: If one knows for himself that there is a characteristic of firmness, and if one hears it from someone else, then he knows that there is a characteristic of firmness.",
        "source": "T25n1509_015:0171a13_10"
    },
    {
        "source_sentence": "若先不知、不聞，則無堅相。",
        "translation": "If someone didn't know and didn't hear it before, then there wouldn't be a resolute characteristic.",
        "source": "T25n1509_015:0171a14_11"
    },
    {
        "source_sentence": "復次，地若常是堅相，不應捨其相，如凝酥、蠟蜜、樹膠，融則捨其堅相，",
        "translation": "Furthermore, if the earth were permanent, it wouldn't have to abandon its characteristics. It' s like when there' s melted butter, curds of honey, and tree glue, and when they melt, they would abandon their characteristics",
        "source": "T25n1509_015:0171a15_12"
    },
    {
        "source_sentence": "墮濕相中；",
        "translation": "They fall into the characteristic of moisture.",
        "source": "T25n1509_015:0171a16_13"
    },
    {
        "source_sentence": "金、銀、銅、鐵等亦爾。",
        "translation": "So are gold, silver, copper, iron, and so forth.",
        "source": "T25n1509_015:0171a16_14"
    },
    {
        "source_sentence": "如水為濕相，寒則轉為堅相。",
        "translation": "Just as water is the characteristic of moisture, so too cold is the characteristic of hardness.",
        "source": "T25n1509_015:0171a17_15"
    },
    {
        "source_sentence": "如是等種種，悉皆捨相。",
        "translation": "These various things are all characteristics of relinquishment.",
        "source": "T25n1509_015:0171a18_16"
    },
    {
        "source_sentence": "復次，諸論議師輩有能令無、無能令有；",
        "translation": "Furthermore, various commentators on the Abhidharma say that some can make it nonexistent while others cannot make it exist.",
        "source": "T25n1509_015:0171a18_17"
    },
    {
        "source_sentence": "諸賢聖人、坐禪人能令地作水、水作地。",
        "translation": "Good men and sages and meditation practitioners can cause the earth to become water and the water to become earth.",
        "source": "T25n1509_015:0171a19_18"
    },
    {
        "source_sentence": "如是等諸法皆可轉，如十一切入中說。",
        "translation": "Such things can all be transformed, as explained in the ten universal sense-fields.",
        "source": "T25n1509_015:0171a20_19"
    },
    {
        "source_sentence": "復次，是有見，為貪欲、瞋恚、愚癡、結縛、鬪諍故生；",
        "translation": "“Furthermore, there are views that arise for the sake of craving, hatred, folly, bondage, and strife.",
        "source": "T25n1509_015:0171a21_20"
    },
    {
        "source_sentence": "若有生此欲、恚等處，是非佛法。",
        "translation": "If someone were to give rise to this place of desire, anger, and so forth, it wouldn't be the Buddha's teaching.",
        "source": "T25n1509_015:0171a22_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_015:0171a23_22"
    },
    {
        "source_sentence": "佛法相善淨故，以是故非實。",
        "translation": "Because the characteristics of buddhas and dharmas are good and pure, they therefore aren't real.",
        "source": "T25n1509_015:0171a23_23"
    },
    {
        "source_sentence": "復次，一切法有二種：色法、無色法。",
        "translation": "Furthermore, there are two kinds of all factors: factors arising with matter and factors not arising with matter.",
        "source": "T25n1509_015:0171a24_24"
    },
    {
        "source_sentence": "色法分析乃至微塵，散滅無餘，如〈檀波羅蜜品〉破施物中說。",
        "translation": "Form and dharmas are analyzed up to the point where they disperse and cease without remainder, as explained in the Chapter on the Destruction of generosity in the perfection of giving.",
        "source": "T25n1509_015:0171a24_25"
    },
    {
        "source_sentence": "無色法五情所不知故，意情生、住、滅時觀故，知心有分，有分故無常，",
        "translation": "Because formless dharmas are not known to the five emotions, and because they are observed at the time of arising, abiding, and ceasing in mind and feelings, they know that thought has parts, and because there are parts, it is imperman",
        "source": "T25n1509_015:0171a26_26"
    },
    {
        "source_sentence": "無常故空，空故非有。",
        "translation": "Because they are impermanent, they are empty; because they are empty, they are not existent.",
        "source": "T25n1509_015:0171a27_27"
    },
    {
        "source_sentence": "彈指頃有六十時，一一時中，心有生、滅；",
        "translation": "The duration of time it takes to snap one’s fingers is sixty muhūrtas [eq.",
        "source": "T25n1509_015:0171a28_28"
    },
    {
        "source_sentence": "相續生故，知是貪心、是瞋心、是癡心，是信心、清淨智慧禪定心。",
        "translation": "Because they continue to arise, they know that it's the mind of greed, the mind of anger, and the mind of delusion, and it's the mind of faith, pure wisdom, and meditation.",
        "source": "T25n1509_015:0171a29_29"
    },
    {
        "source_sentence": "行者觀心生、滅，如流水、燈焰，此名入空智門。",
        "translation": "Practitioners observe that mind arises and ceases, like running water and the flame of a lamp, and this is called entering the gate of knowledge of emptiness.",
        "source": "T25n1509_015:0171b01_30"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_015:0171b02_31"
    },
    {
        "source_sentence": "若一時生，餘時中滅者，此心應常。",
        "translation": "If it were to arise at one moment and perish at the other moments, this awareness would be eternal.",
        "source": "T25n1509_015:0171b02_32"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_015:0171b03_33"
    },
    {
        "source_sentence": "此極少時中無滅故；",
        "translation": "Because it does not perish at the shortest possible time.",
        "source": "T25n1509_015:0171b03_34"
    },
    {
        "source_sentence": "若一時中無滅者，應終始無滅。",
        "translation": "If there is no destruction at one and the same time, there should be no destruction from the beginning to the end.",
        "source": "T25n1509_015:0171b04_35"
    },
    {
        "source_sentence": "復次，佛說有為法，皆有三相。",
        "translation": "Furthermore, the Buddha teaches that conditioned factors all have three characteristics:",
        "source": "T25n1509_015:0171b05_36"
    },
    {
        "source_sentence": "若極少時中生而無滅者，是為非有為法。",
        "translation": "If it arises at a very short time but doesn't cease, this is not conditioned dharmas.",
        "source": "T25n1509_015:0171b05_37"
    },
    {
        "source_sentence": "若極少時中心生、住、滅者，何以但先生而後滅，不先滅而後生？",
        "translation": "If the mind arises, abides, and perishes at a very limited time, why is it only this way that it perishes later? Why does it not cease first and arise later?",
        "source": "T25n1509_015:0171b06_38"
    },
    {
        "source_sentence": "復次，若先有心後有生，則心不待生。",
        "translation": "Furthermore, if there were mind before and birth after it, then the mind wouldn't await birth.",
        "source": "T25n1509_015:0171b08_39"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_015:0171b08_40"
    },
    {
        "source_sentence": "先已有心故。",
        "translation": "It's because the mind has already existed before.",
        "source": "T25n1509_015:0171b09_41"
    },
    {
        "source_sentence": "若先有生，則生無所生。",
        "translation": "If there's birth beforehand, then birth doesn't arise.",
        "source": "T25n1509_015:0171b09_42"
    },
    {
        "source_sentence": "又生、滅性相違，生則不應有滅，滅時不應有生。",
        "translation": "Also, the natures of arising and cessation are at odds with each other. If there were arising, there would be no cessation; but if there were cessation, there would be no arising.",
        "source": "T25n1509_015:0171b10_0"
    },
    {
        "source_sentence": "以是故，一時不可得，異亦不可得，是即無生；",
        "translation": "Because of this, it is ungraspable at one time and also ungraspable at di›er. That is to say, there is no arising.",
        "source": "T25n1509_015:0171b11_1"
    },
    {
        "source_sentence": "若無生，則無住、滅；",
        "translation": "If there were no arising, there would be no abiding and no disintegration.",
        "source": "T25n1509_015:0171b12_2"
    },
    {
        "source_sentence": "若無生、住、滅，則無心數法；",
        "translation": "If there were no arising, abiding and cessation, there would be no mental factors.",
        "source": "T25n1509_015:0171b12_3"
    },
    {
        "source_sentence": "無心數法，則無心不相應諸行。",
        "translation": "In the absence of mental factors, there are no conditioned forces dissociated from mind.",
        "source": "T25n1509_015:0171b13_4"
    },
    {
        "source_sentence": "色、無色法無故，無為法亦無。",
        "translation": "Because form and formless dharmas are absent, the unconditioned dharmas are also absent.",
        "source": "T25n1509_015:0171b14_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_015:0171b14_1"
    },
    {
        "source_sentence": "因有為故有無為，若無有為則亦無無為。",
        "translation": "Conditioned things exist because of conditioned things. If there is no conditioned thing, then there also is no unconditioned thing.",
        "source": "T25n1509_015:0171b14_2"
    },
    {
        "source_sentence": "復次，見作法無常故，知不作法常。",
        "translation": "Furthermore, because they see that the created dharmas are impermanent, they know that the uncreated dharmas are permanent.",
        "source": "T25n1509_015:0171b15_3"
    },
    {
        "source_sentence": "若然者，今見作法是有法，不作法應是無法。",
        "translation": "If that's the case, then we now see that what's done is a dharma and what's not done should be nonexistent.",
        "source": "T25n1509_015:0171b16_4"
    },
    {
        "source_sentence": "以是故，常法不可得。",
        "translation": "Because of this, the eternal Dharma is ungraspable.",
        "source": "T25n1509_015:0171b17_5"
    },
    {
        "source_sentence": "復次，外道及佛弟子，說常法有同、有異：同者，虛空、涅槃；",
        "translation": "Furthermore, non-Buddhist doctrines and Buddhist disciples say that the eternal factors are the same as but different from one another:",
        "source": "T25n1509_015:0171b18_6"
    },
    {
        "source_sentence": "外道有神、時、方、微塵、冥初，如是等名為異。",
        "translation": "Non-Buddhists have a soul, time, direction, tiny dust, and the first part of the darkness, which are called differences.",
        "source": "T25n1509_015:0171b19_7"
    },
    {
        "source_sentence": "又佛弟子說：「非數緣滅是常。」",
        "translation": "Again, the Buddha's disciple said, Cessation that doesn't have numerous conditions as causes is permanent.",
        "source": "T25n1509_015:0171b20_8"
    },
    {
        "source_sentence": "又復言：「滅因緣法常，因緣生法無常。」",
        "translation": "Again, he said, The causes and conditions for cessation are permanent, and the causes and conditions for arising are impermanent.",
        "source": "T25n1509_015:0171b21_9"
    },
    {
        "source_sentence": "摩訶衍中常法：法性、如、真際，如是等種種，名為常法。",
        "translation": "The eternal dharmas in Mahāyāna: the Dharma nature, thusness, and the true extent of suchness, and so forth, are called the eternal dharmas.",
        "source": "T25n1509_015:0171b22_0"
    },
    {
        "source_sentence": "虛空、涅槃，如先〈讚菩薩品〉中說。",
        "translation": "Space and nirvāṇa are as explained in the preceding Praise of the Bodhisattva Chapter.",
        "source": "T25n1509_015:0171b23_1"
    },
    {
        "source_sentence": "神及時、方、微塵，亦如上說。",
        "translation": "The time, the direction and the tiny particles of the soul are also as explained above.",
        "source": "T25n1509_015:0171b23_2"
    },
    {
        "source_sentence": "以是故，不應言諸法有。",
        "translation": "Therefore, it shouldn't be said that all dharmas exist.",
        "source": "T25n1509_015:0171b24_3"
    },
    {
        "source_sentence": "若諸法無者，有二種：一者、常無，二者、斷滅故無。",
        "translation": "If all dharmas are nonexistent, there are two kinds: one, eternal nonexistence and two, nonexistence because of cessation.",
        "source": "T25n1509_015:0171b25_4"
    },
    {
        "source_sentence": "若先有今無，若今有後無，是則斷滅。",
        "translation": "If there is what was formerly present but does not exist now, and if there is what is present but does not exist in the future, this is cessation.",
        "source": "T25n1509_015:0171b26_5"
    },
    {
        "source_sentence": "若然者，則無因緣；",
        "translation": "If this were so, there would be no cause and condition.",
        "source": "T25n1509_015:0171b27_6"
    },
    {
        "source_sentence": "無因緣者，應一物中出一切物，亦應一切物中都無所出。",
        "translation": "The absence of causes and conditions means that all things should come forth from one thing, and nothing comes forth from all things.",
        "source": "T25n1509_015:0171b27_7"
    },
    {
        "source_sentence": "後世中亦如是，若斷罪福因緣，則不應有貧富、貴賤之異，及墮惡道、畜生中。",
        "translation": "If the causes and conditions of sin and merit were to be cut off, then there wouldn't be poverty, wealth, distinctions in nobility, and falling into a bad path or an animal rebirth.",
        "source": "T25n1509_015:0171b28_8"
    },
    {
        "source_sentence": "若言常無，則無苦、集、滅、道；",
        "translation": "If it is said that permanence is nonexistent, then there is no suffering, arising, cessation and the path.",
        "source": "T25n1509_015:0171c01_9"
    },
    {
        "source_sentence": "若無四諦，則無法寶；",
        "translation": "If the four truths did not exist, there would be no treasure.",
        "source": "T25n1509_015:0171c02_10"
    },
    {
        "source_sentence": "若無法寶，則無八賢聖道；",
        "translation": "If there were no treasures, the eightfold noble path of enlightenment wouldn’t exist.",
        "source": "T25n1509_015:0171c02_11"
    },
    {
        "source_sentence": "若無法寶、僧寶，則無佛寶；",
        "translation": "If there is no dharma treasure or sangha treasure, there would be no buddha treasure.",
        "source": "T25n1509_015:0171c03_12"
    },
    {
        "source_sentence": "若如是者，則破三寶。",
        "translation": "If someone does so, they'll destroy the Three Treasures.",
        "source": "T25n1509_015:0171c04_13"
    },
    {
        "source_sentence": "復次，若一切法實空者，則無罪福，亦無父母，亦無世間禮法，亦無善無惡。",
        "translation": "Furthermore, if all things are really empty, then there's no sin or merit, no parents, no worldly rituals, and no good or bad.",
        "source": "T25n1509_015:0171c04_14"
    },
    {
        "source_sentence": "然則善惡同門，是非一貫，一切物盡無，如夢中所見。",
        "translation": "However, good and evil are the same in approach, right and wrong are consistent, and all things are completely nonexistent, just like what's seen in a dream.",
        "source": "T25n1509_015:0171c06_15"
    },
    {
        "source_sentence": "若言實無，有如是失，此言誰當信者！",
        "translation": "If someone says it's really nonexistent, there's such a mistake, and who will believe this statement?",
        "source": "T25n1509_015:0171c07_16"
    },
    {
        "source_sentence": "若言顛倒故見有者，當見一人時，何以不見二、三？",
        "translation": "If someone says they see existence because they're mistaken, why don't they see two or three when they see one person?",
        "source": "T25n1509_015:0171c08_17"
    },
    {
        "source_sentence": "以其實無而顛倒見故。",
        "translation": "It's because they really don't exist and mistakenly see them.",
        "source": "T25n1509_015:0171c09_18"
    },
    {
        "source_sentence": "若不墮此有、無見，得中道實相。",
        "translation": "If someone doesn't fall into this view of existence and nonexistence, they'll attain the true characteristics of the middle way.",
        "source": "T25n1509_015:0171c10_19"
    },
    {
        "source_sentence": "云何知實？",
        "translation": "What is knowledge of reality?",
        "source": "T25n1509_015:0171c10_20"
    },
    {
        "source_sentence": "如過去恒河沙等諸佛菩薩所知所說，未來恒河沙等諸佛菩薩所知所說，",
        "translation": "“Furthermore, the Buddhas and bodhisattvas of the past are as numerous as grains of sand in the Ganges River. The Buddhas and bodhisattvas of the future are as numerous as grains of sand in the Ganges River.",
        "source": "T25n1509_015:0171c11_21"
    },
    {
        "source_sentence": "現在恒河沙等諸佛菩薩所知所說。",
        "translation": "Now, there are buddhas and bodhisattvas as numerous as the sands of the Ganges River who know what they teach.",
        "source": "T25n1509_015:0171c12_22"
    },
    {
        "source_sentence": "信心大故，不疑、不悔；",
        "translation": "Because their faith is great, they have no doubts or regrets.",
        "source": "T25n1509_015:0171c13_23"
    },
    {
        "source_sentence": "信力大故，能持、能受；",
        "translation": "Because the power of faith is great, they are able to preserve and receive it.",
        "source": "T25n1509_015:0171c14_24"
    },
    {
        "source_sentence": "是名法忍。",
        "translation": "This is called the forbearance of the Dharma.",
        "source": "T25n1509_015:0171c14_25"
    },
    {
        "source_sentence": "復次，禪定力故，心柔軟清淨，聞諸法實相，應心與會，信著深入，無疑、無悔。",
        "translation": "Furthermore, because of the power of meditation, his mind is supple and pure, and when he hears the true characteristics of dharmas, his mind is united with them, faithfully entering deeply into them without doubt or regret.",
        "source": "T25n1509_015:0171c14_26"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_015:0171c16_27"
    },
    {
        "source_sentence": "疑、悔是欲界繫法，麁惡故不入柔軟心中，是名法忍。",
        "translation": "Doubt and regret are fetters of the desire realm, and because they're crude and bad, they don't enter a flexible mind, which is called forbearance of dharmas.",
        "source": "T25n1509_015:0171c16_28"
    },
    {
        "source_sentence": "復次，智慧力故，於一切諸法中種種觀，無有一法可得者；",
        "translation": "“Furthermore, because of the power of knowledge and wisdom, there is not a single thing that can be grasped by contemplating all things in various ways.",
        "source": "T25n1509_015:0171c18_29"
    },
    {
        "source_sentence": "是法能忍、能受，不疑、不悔，是名法忍。",
        "translation": "Being able to tolerate and accept these things without doubt or regret is called patience of the Dharma.",
        "source": "T25n1509_015:0171c19_30"
    },
    {
        "source_sentence": "復次，菩薩思惟：「凡夫人以無明毒故，於一切諸法中作轉相：非常作常想，",
        "translation": "Furthermore, the bodhisattva contemplates, Ordinary people because of the poison of ignorance create evolving characteristics in all dharmas:",
        "source": "T25n1509_015:0171c20_31"
    },
    {
        "source_sentence": "苦作樂想，無我有我想，空謂有實，非有為有，有為非有。",
        "translation": "The perception of suffering as pleasure has no self or self-self. Emptiness means existence in and of itself; it is neither conditioned nor nonexistent.",
        "source": "T25n1509_015:0171c22_32"
    },
    {
        "source_sentence": "如是等種種法中作轉相，得聖實智慧，破無明毒，知諸法實相。」",
        "translation": "Such are the various ways to create and transform characteristics in various dharmas, attain noble true wisdom, destroy the poison of ignorance, and know the true characteristics of dharmas.",
        "source": "T25n1509_015:0171c23_33"
    },
    {
        "source_sentence": "得無常、苦、空、無我智慧，棄捨不著，是法能忍，是名法忍。",
        "translation": "Attaining the wisdom of impermanence, suffering, emptiness, and selflessness, abandoning it and not clinging to it, this is the Dharma that can tolerate it, which is called the Dharma forbearance.",
        "source": "T25n1509_015:0171c25_0"
    },
    {
        "source_sentence": "復次，觀一切諸法，從本已來常空，今世亦空，是法能信、能受，是為法忍。",
        "translation": "Furthermore, observing all dharmas that have always been empty since the distant past and are also empty in the present life is the Dharma that can be believed and accepted, which is called the Dharma forbearance.",
        "source": "T25n1509_015:0171c26_1"
    },
    {
        "source_sentence": "問曰：若從本已來常空，今世亦空，是為惡邪，云何言法忍？",
        "translation": "Q: If the eternal emptiness from the past is always empty and the present world is also empty, this is a bad mistake, so how can we say that it's forbearance of dharmas?",
        "source": "T25n1509_015:0171c27_2"
    },
    {
        "source_sentence": "答曰：若觀諸法常畢竟空，取相心著，是為惡邪見；",
        "translation": "Answer: If one observes that all dharmas are always ultimately void and grasps their characteristics and mental states, this is bad and wrong view.",
        "source": "T25n1509_015:0171c29_3"
    },
    {
        "source_sentence": "若觀空不著，不生邪見，是為法忍。",
        "translation": "If someone observes emptiness without attachment and doesn't give rise to wrong views, this is patience of the Dharma.",
        "source": "T25n1509_015:0172a01_4"
    },
    {
        "source_sentence": "　「諸法性常空，　　心亦不著空；",
        "translation": "The nature of all things is always empty, And the mind does not cling to emptiness.",
        "source": "T25n1509_015:0172a02_5"
    },
    {
        "source_sentence": "　　如是法能忍，　　是佛道初相。」",
        "translation": "Being able to tolerate such things is the first aspect of the Buddha Way.",
        "source": "T25n1509_015:0172a02_5"
    },
    {
        "source_sentence": "如偈說：如是等種種入智慧門，觀諸法實相，心不退、不悔，不隨諸觀，",
        "translation": "As a verse explains, Such are the various ways to enter into wisdom that observe the true characteristics of dharmas without regressing or regretting in mind and without following observations.",
        "source": "T25n1509_015:0172a02_5"
    },
    {
        "source_sentence": "亦無所憂，能得自利、利他，是名法忍。",
        "translation": "Being free of sorrow and able to attain self-benefiting and benefitting others is called the tolerance of the Dharma.",
        "source": "T25n1509_015:0172a06_6"
    },
    {
        "source_sentence": "是法忍有三種行清淨：不見忍辱法，不見己身，不見罵辱人；",
        "translation": "This patience of the doctrine has three kinds of practice that are pure:",
        "source": "T25n1509_015:0172a07_7"
    },
    {
        "source_sentence": "不戲諸法，是時名清淨法忍。",
        "translation": "When he doesn't play with the teachings, this is called pure tolerance of the Dharma.",
        "source": "T25n1509_015:0172a08_8"
    },
    {
        "source_sentence": "以是事故，說菩薩住般若波羅蜜中，能具足羼提波羅蜜，不動、不退故。",
        "translation": "Because of this, it's said that the bodhisattva abides in the perfection of prajñāpāramitā and is able to perfect the perfection of the perfection of kṣatriya because he doesn't move or retreat.",
        "source": "T25n1509_015:0172a09_9"
    },
    {
        "source_sentence": "云何名「不動不退」？",
        "translation": "What's called immovable and non-backsliding?",
        "source": "T25n1509_015:0172a11_10"
    },
    {
        "source_sentence": "瞋恚不生，不出惡言，身不加惡，心無所疑。",
        "translation": "Their anger doesn't arise, they don't say bad words, their bodies don't add evil, and their minds have no doubt.",
        "source": "T25n1509_015:0172a11_11"
    },
    {
        "source_sentence": "菩薩知般若波羅蜜實相，不見諸法，心無所著故；",
        "translation": "Enlightening beings know the true characteristics of the transcendent wisdom, not seeing anything, because their minds have no attachment.",
        "source": "T25n1509_015:0172a12_12"
    },
    {
        "source_sentence": "若人來罵，若加楚毒、殺害，一切能忍。",
        "translation": "If someone comes and scolds them, or inflicts pain and poison or kills them, they can tolerate it.",
        "source": "T25n1509_015:0172a13_13"
    },
    {
        "source_sentence": "以是故說「住般若波羅蜜中，能具足羼提波羅蜜」。",
        "translation": "That's why it's said, Abiding in the perfection of prajñāpāramitā, they can fulfill the perfection of the perfection of kṣatriya.",
        "source": "T25n1509_015:0172a14_14"
    },
    {
        "source_sentence": "大智度論釋初品中毘梨耶波羅蜜義第二十六【經】「身心精進不懈息故，",
        "translation": "In the first chapter of the Mahāprajñāpāramitā-śāstra, the meaning of the vīrya-pāramitā is explained in twenty-six [ sūtras]:",
        "source": "T25n1509_015:0172a16_0"
    },
    {
        "source_sentence": "應具足毘梨耶波羅蜜。」",
        "translation": "They should be fully endowed with the pārājika-pāramitā.",
        "source": "T25n1509_015:0172a18_1"
    },
    {
        "source_sentence": "【論】毘梨耶(秦言精進)。",
        "translation": "[Commentary] Vaiśravaṇa (known as diligence in the Qin).",
        "source": "T25n1509_015:0172a19_2"
    },
    {
        "source_sentence": "問曰：如精進是一切善法本，應最在初，今何以故第四？",
        "translation": "Q: Just as effort is the root of all good qualities, it should be the first, but now why is it the fourth?",
        "source": "T25n1509_015:0172a19_3"
    },
    {
        "source_sentence": "答曰：布施、持戒、忍辱，世間常有。",
        "translation": "Answer: generosity, observance of precepts, and forbearance always exist in the world.",
        "source": "T25n1509_015:0172a20_4"
    },
    {
        "source_sentence": "如客主之義，法應供給，乃至畜生亦知布施；",
        "translation": "Just as the meaning of guest and host is that they should be offered according to the Dharma, so also do animals know generosity.",
        "source": "T25n1509_015:0172a21_5"
    },
    {
        "source_sentence": "或有人種種因緣故能布施，若為今世、若為後世、若為道故布施，不須精進。",
        "translation": "Sometimes a person is able to give for various reasons and doesn't need to make effort if he gives for the sake of present life, future lives, or the path.",
        "source": "T25n1509_015:0172a22_6"
    },
    {
        "source_sentence": "如持戒者，見為惡之人，王法治罪，便自畏懼，不敢為非；",
        "translation": "Good man, it is like a person who keeps the precepts. If he sees someone evil and the king punishes them for their crimes, then he feels apprehensive and doesn’t dare to do anything wrong.",
        "source": "T25n1509_015:0172a24_7"
    },
    {
        "source_sentence": "或有性善，不作諸惡；",
        "translation": "Some are good by nature but do not do evil.",
        "source": "T25n1509_015:0172a25_8"
    },
    {
        "source_sentence": "有人聞今世作惡，後世受罪，而以怖畏，故能持戒；",
        "translation": "Some people hear that evil is committed in the present life but are punished in a later life. Because of their fear, they are able to keep the precepts.",
        "source": "T25n1509_015:0172a26_9"
    },
    {
        "source_sentence": "有人聞持戒因緣故，得離生、老、病、死，是中心生、口言：「我從今日，",
        "translation": "If someone hears that it's because of the causes and conditions for observing precepts that they're freed from birth, old age, illness, and death, this is a central birth and verbal statement, saying, From today,",
        "source": "T25n1509_015:0172a27_10"
    },
    {
        "source_sentence": "不復殺生。」",
        "translation": "I won't kill again.",
        "source": "T25n1509_015:0172a28_11"
    },
    {
        "source_sentence": "如是等即是戒，豈須精進波羅蜜而能行耶？",
        "translation": "These are the precepts, so how could they be practiced without the perfection of effort?",
        "source": "T25n1509_015:0172a29_12"
    },
    {
        "source_sentence": "如忍辱中，若罵、若打、若殺，或畏故不報，或少力、或畏罪、或修善人法、或為求道故，",
        "translation": "Suppose in forbearance, someone ridicules, beats, or kills someone because they're afraid and doesn't retaliate because of fear, or has little strength, or fears crimes, cultivates the ways of good people, or seeks the",
        "source": "T25n1509_015:0172b01_13"
    },
    {
        "source_sentence": "默然不報，皆不必須精進波羅蜜乃能忍也。",
        "translation": "He's silent and doesn't respond, and they don't need the perfection of effort to be able to tolerate it.",
        "source": "T25n1509_015:0172b03_14"
    },
    {
        "source_sentence": "今欲得知諸法實相，行般若波羅蜜故，修行禪定；",
        "translation": "Now I want to know the true characteristics of all dharmas and practice transcendent wisdom, so I cultivate meditation.",
        "source": "T25n1509_015:0172b04_15"
    },
    {
        "source_sentence": "禪定是實智慧之門，是中應懃修精進，一心行禪。",
        "translation": "Meditation is the gate of true wisdom, where one should diligently cultivate effort and singlemindedly practice meditation.",
        "source": "T25n1509_015:0172b05_16"
    },
    {
        "source_sentence": "復次，布施、持戒、忍辱，是大福德，安隱快樂，有好名譽，所欲者得；",
        "translation": "“Furthermore, generosity, observance of precepts, and forbearance are great virtues that enable those who desire them to attain peace and happiness, good repute, and renown.",
        "source": "T25n1509_015:0172b06_17"
    },
    {
        "source_sentence": "既得知此福利之味，今欲增進，更得妙勝禪定、智慧。",
        "translation": "Knowing the taste of this benefit, they now want to increase it and attain marvelous meditative concentration and wisdom.",
        "source": "T25n1509_015:0172b07_18"
    },
    {
        "source_sentence": "譬如穿井已見濕泥，轉加增進必望得水；",
        "translation": "Good man, it is analogous to someone who penetrates a well and sees wet mud. As the water increases he will surely get more and more moisture.",
        "source": "T25n1509_015:0172b09_19"
    },
    {
        "source_sentence": "又如鑽火，已得見煙，倍復力勵，必望得火。",
        "translation": "It's also like when you drill a fire, and once you see smoke, you must expect to get the fire after doubling your strength.",
        "source": "T25n1509_015:0172b10_20"
    },
    {
        "source_sentence": "欲成佛道，凡有二門：一者、福德，二者、智慧。",
        "translation": "There are two kinds of people who want to achieve the Buddha Way: 1. merit and 2. wisdom.",
        "source": "T25n1509_015:0172b11_21"
    },
    {
        "source_sentence": "行施、戒、忍是為福德門；",
        "translation": "Practicing generosity, morality and patience is the door of blessedness.",
        "source": "T25n1509_015:0172b12_22"
    },
    {
        "source_sentence": "知一切諸法實相，摩訶般若波羅蜜，是為智慧門。",
        "translation": "Knowing the true characteristics of all dharmas and the great perfection of wisdom is the gate of wisdom.",
        "source": "T25n1509_015:0172b12_23"
    },
    {
        "source_sentence": "菩薩入福德門，除一切罪，所願皆得；",
        "translation": "Enlightening beings enter the door of virtue, getting rid of all sins and attaining whatever they wish.",
        "source": "T25n1509_015:0172b13_24"
    },
    {
        "source_sentence": "若不得願者，以罪垢遮故。",
        "translation": "If someone doesn't get the vow, it's because they're covered by the stain of sin.",
        "source": "T25n1509_015:0172b14_25"
    },
    {
        "source_sentence": "入智慧門，則不厭生死、不樂涅槃，二事一故。",
        "translation": "Entering the gate of wisdom, they won't become disillusioned with birth-and-death and don't delight in nirvāṇa, which are two things that are one.",
        "source": "T25n1509_015:0172b15_26"
    },
    {
        "source_sentence": "今欲出生摩訶般若波羅蜜，般若波羅蜜要因禪定門，禪定門必須大精進力。",
        "translation": "Now, if you want to produce the Mahāprajñāpāramitā, the prajñāpāramitā must be the cause of the approach of meditation, and the approach of meditation requires great effort.",
        "source": "T25n1509_015:0172b16_27"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_015:0172b18_28"
    },
    {
        "source_sentence": "散亂心不能得見諸法實相。",
        "translation": "A distracted mind can't see the true characteristics of dharmas.",
        "source": "T25n1509_015:0172b18_29"
    },
    {
        "source_sentence": "譬如風中然燈，不能照物；",
        "translation": "Good man, it is like a flash of light in the wind that cannot illuminate objects.",
        "source": "T25n1509_015:0172b19_30"
    },
    {
        "source_sentence": "燈在密屋，明必能照。",
        "translation": "The lamp is in a hidden room, but the light can illuminate it.",
        "source": "T25n1509_015:0172b19_31"
    },
    {
        "source_sentence": "是禪定、智慧，不可以福願求，亦非麁觀能得，要須身、心精懃，急著不懈，",
        "translation": "These meditations and insights cannot be obtained by means of meritorious vows, nor can they be obtained through deceitful contemplation. They require physical or mental effort, which is neither urgent nor unremitting.",
        "source": "T25n1509_015:0172b20_32"
    },
    {
        "source_sentence": "爾乃成辦。",
        "translation": "You then accomplished it.",
        "source": "T25n1509_015:0172b22_33"
    },
    {
        "source_sentence": "如佛所說：血、肉、脂、髓皆使竭盡，但令皮、骨、筋在，不捨精進。",
        "translation": "As the Buddha explains, blood, flesh, fat, marrow, and marrow are all made to dry up, but skin, bones, and tendons remain, and they don't abandon effort.",
        "source": "T25n1509_015:0172b22_34"
    },
    {
        "source_sentence": "如是乃能得禪定、智慧，得是二事，則眾事皆辦。",
        "translation": "Thus, they'll be able to attain meditation and wisdom, and when they attain these two things, all the tasks will be done.",
        "source": "T25n1509_015:0172b23_35"
    },
    {
        "source_sentence": "以是故，精進第四，名為禪定、實智慧之根。",
        "translation": "Because of this, the fourth form of zeal is called ‘the faculty meditative absorption and true wisdom’.",
        "source": "T25n1509_015:0172b24_36"
    },
    {
        "source_sentence": "上三中雖有精進，少故不說。",
        "translation": "Although energy is present in the higher three, it is not spoken of because it is scarce.",
        "source": "T25n1509_015:0172b25_37"
    },
    {
        "source_sentence": "問曰：有人言：但行布施、持戒、忍辱故，得大福德；",
        "translation": "Q: Some people say that they attain great merit simply by practicing generosity, observing precepts, and tolerating humility.",
        "source": "T25n1509_015:0172b26_38"
    },
    {
        "source_sentence": "福德力故，所願皆得，禪定、智慧自然而至，復何用精進波羅蜜為？",
        "translation": "Because of the power of virtue, they'll attain whatever they wish, and their meditation and wisdom will naturally arrive, so why should they use the perfection of effort?",
        "source": "T25n1509_015:0172b27_39"
    },
    {
        "source_sentence": "答曰：佛道甚深難得，雖有布施、持戒、忍辱力，要須精進，得甚深禪定、實智慧及無量諸佛法。",
        "translation": "Answer: The Buddha Way is profound and difficult to attain, even though it has generosity, observance of precepts, and the power of forbearance, it requires effort to attain profound meditation, true wisdom, and measureless buddha-te",
        "source": "T25n1509_015:0172b29_40"
    },
    {
        "source_sentence": "若不行精進，則不生禪定；",
        "translation": "If one does not practice zeal, no meditative absorption can arise.",
        "source": "T25n1509_015:0172c02_41"
    },
    {
        "source_sentence": "禪定不生，則不得生梵天王處，何況欲求佛道？",
        "translation": "If meditation doesn't arise, then they won't be able to be born in the Brahma heavenly king's place, so why wouldn't they want to pursue the Buddha Way?",
        "source": "T25n1509_015:0172c02_42"
    },
    {
        "source_sentence": "復次，有人如民大居士等，欲得無量寶物，則應意皆得。",
        "translation": "Furthermore, if someone wants to obtain measureless treasures like the great householders of the people, then they'll get them at will.",
        "source": "T25n1509_015:0172c03_43"
    },
    {
        "source_sentence": "如頂生王王四天下，天雨七寶及所須之物，釋提婆那民分座與坐；",
        "translation": "It was as if the king Mandhātu had rained seven treasures from heaven and provided them with what they needed. The people of Śakra Devānām-Indra divided their seats and took their seats among the four continents under him.",
        "source": "T25n1509_015:0172c05_44"
    },
    {
        "source_sentence": "雖有是福，然不能得道。",
        "translation": "Even though they have this merit, they can't attain the path.",
        "source": "T25n1509_015:0172c06_45"
    },
    {
        "source_sentence": "如羅頻珠比丘，雖得阿羅漢道，乞食七日不得，空鉢而還；",
        "translation": "Suppose there is a bhikṣu named robber pearl who, even though he has attained the path of arhatship, after having begged for almsfood seven days without getting it, returns with an empty bowl.",
        "source": "T25n1509_015:0172c07_46"
    },
    {
        "source_sentence": "後以禪定火自燒其身而般涅槃。",
        "translation": "He then burned his body in the fire of meditation and passed into nirvāṇa.",
        "source": "T25n1509_015:0172c08_47"
    },
    {
        "source_sentence": "以是故知，非但福德力故得道；",
        "translation": "Because of this we know that it is not only by the power of virtue alone that they attain enlightenment.",
        "source": "T25n1509_015:0172c09_48"
    },
    {
        "source_sentence": "欲成佛道，要須懃大精進。",
        "translation": "In order to attain buddhahood it is necessary to make great effort.",
        "source": "T25n1509_015:0172c10_49"
    },
    {
        "source_sentence": "問曰：菩薩觀精進，有何利益而懃修不懈？",
        "translation": "Q: What's the benefit of a bodhisattva observing effort and not cultivating it?",
        "source": "T25n1509_015:0172c11_0"
    },
    {
        "source_sentence": "答曰：一切今世、後世道德利益，皆由精進得。",
        "translation": "Answer: All the moral benefits in the present and future lives are obtained by effort.",
        "source": "T25n1509_015:0172c12_0"
    },
    {
        "source_sentence": "復次，若人欲自度身，尚當懃急精進，何況菩薩誓願欲度一切！",
        "translation": "Furthermore, if someone wants to save themselves, they should still make diligent effort, so why wouldn't a bodhisattva vow to save all?",
        "source": "T25n1509_015:0172c13_0"
    },
    {
        "source_sentence": "　「有人不惜身，　　智慧心決定，",
        "translation": "“Some people don’t cherish their bodies, but their minds are determined by wisdom.",
        "source": "T25n1509_015:0172c14_1"
    },
    {
        "source_sentence": "　　如法行精進，　　所求事無難！",
        "translation": "Practicing according to the teaching and making effort, there's no difficulty in seeking things!",
        "source": "T25n1509_015:0172c14_1"
    },
    {
        "source_sentence": "　　如農夫懃修，　　所收必豐實；",
        "translation": "Like a farmer who cultivates well, What he harvests will surely be abundant.",
        "source": "T25n1509_015:0172c14_1"
    },
    {
        "source_sentence": "　　亦如涉遠路，　　懃則必能達。",
        "translation": "It's like traveling a long distance, and if you cross it, you'll surely be able to reach it.",
        "source": "T25n1509_015:0172c14_1"
    },
    {
        "source_sentence": "　　若得生天上，　　及得涅槃樂，",
        "translation": "If they attain birth in heaven and attain the bliss of nirvāṇa,",
        "source": "T25n1509_015:0172c14_1"
    },
    {
        "source_sentence": "　　如是之因緣，　　皆由精進力。",
        "translation": "Such causes and conditions are all due to the power of effort.",
        "source": "T25n1509_015:0172c14_1"
    },
    {
        "source_sentence": "　　非天非無因，　　自作故自得，",
        "translation": "They are neither heavenly nor non-causal, Because they are self-manifesting and self-obtained.",
        "source": "T25n1509_015:0172c14_1"
    },
    {
        "source_sentence": "　　誰有智慧人，　　而不自勉勵？",
        "translation": "Who is there a wise person who doesn't encourage themselves?",
        "source": "T25n1509_015:0172c14_1"
    },
    {
        "source_sentence": "　　三界火熾然，　　譬如大炎火，",
        "translation": "The fires of the three realms are blazing, Like a great scorching fire.",
        "source": "T25n1509_015:0172c14_1"
    },
    {
        "source_sentence": "　　有智決斷人，　　乃能得免離！",
        "translation": "Only those who are wise and decisive Will be able to escape.",
        "source": "T25n1509_015:0172c14_1"
    },
    {
        "source_sentence": "　　以是故佛告：　　阿難正精進，",
        "translation": "For this reason the Buddha said to Ānanda:",
        "source": "T25n1509_015:0172c14_1"
    },
    {
        "source_sentence": "　　如是不懈怠，　　直至於佛道。",
        "translation": "Thus, he doesn't lazy and goes straight to the Buddha Way.",
        "source": "T25n1509_015:0172c14_1"
    },
    {
        "source_sentence": "　　勉強而懃修，　　穿地能通泉；",
        "translation": "He studies and practices diligently, penetrating the earth to reach the fountain.",
        "source": "T25n1509_015:0172c14_1"
    },
    {
        "source_sentence": "　　精進亦如是，　　無求而不得。",
        "translation": "The same applies to energy: Without seeking, it is not acquired.",
        "source": "T25n1509_015:0172c14_1"
    },
    {
        "source_sentence": "　　能如行道法，　　精進不懈者，",
        "translation": "Those who practice the path of enlightenment according to its principles And make effort without slackening,",
        "source": "T25n1509_015:0172c14_1"
    },
    {
        "source_sentence": "　　無量果必得，　　此報終不失！」",
        "translation": "Immeasurable results will surely be obtained, and this reward won't be lost!",
        "source": "T25n1509_015:0172c14_1"
    },
    {
        "source_sentence": "如讚精進偈中說：復次，精進法是一切諸善法之根本，能出生一切諸道法，",
        "translation": "Furthermore, the principle of energy is the root of all wholesome states. It produces all factors conducive to enlightenment.",
        "source": "T25n1509_015:0172c14_1"
    },
    {
        "source_sentence": "乃至阿耨多羅三藐三菩提，何況於小利！",
        "translation": "It's even unsurpassed, correct, and complete enlightenment, so why wouldn't it be a trivial benefit?",
        "source": "T25n1509_015:0173a03_2"
    },
    {
        "source_sentence": "如毘尼中說：「一切諸善法，乃至阿耨多羅三藐三菩提，皆從精進不放逸生。」",
        "translation": "As the Vinaya says, All good qualities, up to unsurpassed, correct, and complete enlightenment, arise from diligence and nonfrivolity.",
        "source": "T25n1509_015:0173a04_3"
    },
    {
        "source_sentence": "復次，精進能動發先世福德，如雨潤種，能令必生；",
        "translation": "“Furthermore, energy can move and produce the virtues of former existences like rain that nourishes seeds and enables them to surely grow.",
        "source": "T25n1509_015:0173a06_4"
    },
    {
        "source_sentence": "此亦如是，雖有先世福德因緣，若無精進則不能生；",
        "translation": "In the same way, even though there are causes and conditions of virtue from prior lives, they cannot arise without effort.",
        "source": "T25n1509_015:0173a07_5"
    },
    {
        "source_sentence": "乃至今世利尚不能得，何況佛道！",
        "translation": "Even now worldly benefits can't yet be obtained, so why wouldn't the Buddha Way?",
        "source": "T25n1509_015:0173a08_6"
    },
    {
        "source_sentence": "復次，諸大菩薩荷負眾生，受一切苦，乃至阿鼻泥犁中苦，心亦不懈，",
        "translation": "“Furthermore, great enlightening beings bear the burden of all suffering on sentient beings, and their minds are not negligent in enduring all that is painful, even to the point where it is painful like an aerial plo",
        "source": "T25n1509_015:0173a09_7"
    },
    {
        "source_sentence": "是為精進。",
        "translation": "This is called effort.",
        "source": "T25n1509_015:0173a10_8"
    },
    {
        "source_sentence": "復次，一切眾事，若無精進，則不能成。",
        "translation": "Furthermore, all things can't be accomplished without effort.",
        "source": "T25n1509_015:0173a11_9"
    },
    {
        "source_sentence": "譬如下藥，以巴豆為主；",
        "translation": "It is analogous to the following kind of medicine, which is made up of grapes and beans.",
        "source": "T25n1509_015:0173a12_0"
    },
    {
        "source_sentence": "若除巴豆，則無下力。",
        "translation": "If he removes the beans, then he won't have inferior strength.",
        "source": "T25n1509_015:0173a12_1"
    },
    {
        "source_sentence": "如是意止、神足、根、力、覺、道，必待精進；",
        "translation": "The cessation of thought in this way, the spiritual footing, faculties, powers, energy, enlightenment and the path necessarily await zeal.",
        "source": "T25n1509_015:0173a13_2"
    },
    {
        "source_sentence": "若無精進，則眾事不辦。",
        "translation": "If they don't make effort, then all things won't be done.",
        "source": "T25n1509_015:0173a13_3"
    },
    {
        "source_sentence": "如戒唯在八道，不在餘處；",
        "translation": "For example, the precepts are found only in eight realms of rebirth and not elsewhere.",
        "source": "T25n1509_015:0173a14_4"
    },
    {
        "source_sentence": "信在根、力，餘處則無。",
        "translation": "Faith abides in faculties and powers; it does not abide elsewhere.",
        "source": "T25n1509_015:0173a15_5"
    },
    {
        "source_sentence": "如精進者，無處不有，既總眾法而別自有門。",
        "translation": "There's no place where there's no such thing as effort that doesn't exist, and since it summarizes all dharmas, it has its own separate approach.",
        "source": "T25n1509_015:0173a15_6"
    },
    {
        "source_sentence": "譬如無明使，遍在一切諸使中，而別有不共無明。",
        "translation": "It's like the tendency of nescience, which pervades all the tendencies and separately has an uncommon ignorance.",
        "source": "T25n1509_015:0173a16_7"
    },
    {
        "source_sentence": "問曰：菩薩欲得一切佛法，欲度一切眾生，欲滅一切煩惱，皆得如意，",
        "translation": "Vimalakīrti: Enlightening beings want to attain all buddha-teachings, want to liberate all sentient beings, want to extinguish all afflictions, and attain thusness of mind.",
        "source": "T25n1509_015:0173a17_8"
    },
    {
        "source_sentence": "云何增益精進而能得佛？",
        "translation": "How can they attain buddhahood by increasing their energy?",
        "source": "T25n1509_015:0173a19_9"
    },
    {
        "source_sentence": "譬如小火不能燒大林，火勢增益，能燒一切。",
        "translation": "It's like a small fire that can't burn a large forest, and when the fire increases in strength, it can burn all of them.",
        "source": "T25n1509_015:0173a20_10"
    },
    {
        "source_sentence": "答曰：菩薩從初發心，作誓願：「當令一切眾生得歡樂，常為一切，不自惜身；",
        "translation": "Answer: From the first arousal of mind, enlightening beings make a vow: They should cause all sentient beings to attain happiness and always do so for all without giving up their own bodies.",
        "source": "T25n1509_015:0173a21_11"
    },
    {
        "source_sentence": "若惜身者，於諸善法不能成辦。」",
        "translation": "If someone cherishes their body, they won't be able to accomplish good qualities.",
        "source": "T25n1509_015:0173a23_0"
    },
    {
        "source_sentence": "以是故增益精進。",
        "translation": "Because of this, they'll increase their effort.",
        "source": "T25n1509_015:0173a23_1"
    },
    {
        "source_sentence": "復次，菩薩種種因緣，呵懈怠心，令樂著精進。",
        "translation": "Furthermore, for various reasons, the bodhisattva disparages lazy minds and makes them delight in effort.",
        "source": "T25n1509_015:0173a24_2"
    },
    {
        "source_sentence": "懈怠黑雲，覆諸明慧，吞滅功德，增長不善。",
        "translation": "The black cloud of laziness covers the bright wisdom that swallows up virtue and grows unwholesomeness.",
        "source": "T25n1509_015:0173a25_3"
    },
    {
        "source_sentence": "懈怠之人，初雖小樂，後則大苦；",
        "translation": "A lazy person, though initially blissful, will experience great suffering in the afterlife.",
        "source": "T25n1509_015:0173a26_4"
    },
    {
        "source_sentence": "譬如毒食，初雖香美，久則殺人。",
        "translation": "It's like a poisonous food that kills people for a long time even though it's first fragrant and delicious.",
        "source": "T25n1509_015:0173a27_0"
    },
    {
        "source_sentence": "懈怠之心，燒諸功德，譬如大火燒諸林野。",
        "translation": "A lazy mind burns merit, like a great fire that burns forests and fields.",
        "source": "T25n1509_015:0173a27_1"
    },
    {
        "source_sentence": "懈怠之人失諸功德，譬如被賊，無復遺餘。",
        "translation": "A lazy person loses all his merits, like being caught by a thief and nothing left behind.",
        "source": "T25n1509_015:0173a28_2"
    },
    {
        "source_sentence": "　「應得而不得，　　已得而復失，",
        "translation": "You should attain it but not attain it, And after attaining it you will lose it again.",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　既自輕其身，　　眾人亦不敬。",
        "translation": "Since they despise their own bodies, the people don't respect them.",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　常處大闇中，　　無有諸威德，",
        "translation": "In the great darkness of eternalism, There is no power or virtue.",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　尊貴智慧法，　　此事永以失。",
        "translation": "The Dharma of noble wisdom is always lost in this matter.",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　聞諸妙道法，　　不能以益身，",
        "translation": "Hearing the teachings of the wondrous path, they can’t use them to benefit their bodies.",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　如是之過失，　　皆由懈怠心。",
        "translation": "Such faults and errors are all due to lazy thoughts.",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　雖聞增益法，　　不能得上及，",
        "translation": "Even though they hear the teaching of increase, They can’t attain superiority.",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　如是之過罪，　　皆由懈怠心。",
        "translation": "Such faults and sins are all due to lazy thoughts.",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　生業不修理，　　不入於道法，",
        "translation": "Their karma is produced, but they don’t repair it; They don’t enter the principles of the path.",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　如是之過失，　　皆由懈怠心。",
        "translation": "Such faults and errors are all due to lazy thoughts.",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　上智所棄遠，　　中人時復近，",
        "translation": "They are abandoned by those of superior wisdom who are far away, but they're approached by those in the middle at the right time.",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　下愚為之沒，　　如猪樂在溷。",
        "translation": "The next foolish man disappears because of it, like a pig playing in a pot.",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　若為世中人，　　三事皆廢失：",
        "translation": "If someone were to become a human being in the world, Three things would all be lost:",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　欲樂及財利，　　福德亦復沒。",
        "translation": "Desire, pleasure, wealth, and profit also disappear, And so does virtue.",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　若為出家人，　　則不得二事：",
        "translation": "If someone becomes a renunciant, they won’t get two things:",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　生天及涅槃，　　名譽二俱失。",
        "translation": "The gods of rebirth and Nirvāṇa lose both name and fame.",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　如是諸廢失，　　欲知其所由，",
        "translation": "Do you want to know the reason for these errors?",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　一切諸賊中，　　無過懈怠賊！",
        "translation": "Among all the thieves, there's no more lazy thief!",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　以是眾罪故，　　懶心不應作，",
        "translation": "Because of these sins, they shouldn't be done in a lazy mind.",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　馬井二比丘，　　懈怠墜惡道；",
        "translation": "The two bhikṣus Ma and Jīvaka Have fallen into the evil destinies of laziness.",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "　　雖見佛聞法，　　猶亦不自免！」",
        "translation": "Even though they see the Buddha and hear the Dharma, they still can't escape on their own!",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "如偈說：如是等種種觀懈怠之罪，精進增長。",
        "translation": "As a verse says, Such are the various ways to contemplate the sins of laziness, which increase in effort.",
        "source": "T25n1509_015:0173a29_3"
    },
    {
        "source_sentence": "復次，觀精進之益，今世、後世、佛道、涅槃之利，皆由精進。",
        "translation": "Furthermore, the benefits of observing effort and the benefits of present-world, future-world, buddha path, and nirvāṇa all come from effort.",
        "source": "T25n1509_015:0173b22_4"
    },
    {
        "source_sentence": "復次，菩薩知一切諸法皆空無所有，而不證涅槃；",
        "translation": "“Furthermore, enlightening beings know all things are empty and have no existence, yet they do not realize nirvana.",
        "source": "T25n1509_015:0173b24_5"
    },
    {
        "source_sentence": "憐愍眾生，集諸善法，是精進波羅蜜力。",
        "translation": "Being compassionate to sentient beings and accumulating good qualities is the power of the perfection of effort.",
        "source": "T25n1509_015:0173b25_6"
    },
    {
        "source_sentence": "復次，菩薩一人獨無等侶，以精進福德力故，能破魔軍及結使賊，得成佛道。",
        "translation": "Furthermore, the bodhisattva is alone without an equal number of companions, and it's because of the power of effort and virtue that he can break through the armies of Māra and the bonds of thieves and attain the Buddha Way",
        "source": "T25n1509_015:0173b26_7"
    },
    {
        "source_sentence": "既得佛道，於一切諸法，一相無相，其實皆空；",
        "translation": "Having attained buddhahood, all things have one characteristic and no characteristics; in fact, they are all empty.",
        "source": "T25n1509_015:0173b28_0"
    },
    {
        "source_sentence": "而為眾生說諸法種種名字，種種方便，度脫眾生老病死苦。",
        "translation": "He explains the various names of the teachings for sentient beings, and he uses various methods to liberate sentient beings from the suffering of old age, illness, and death.",
        "source": "T25n1509_015:0173b29_1"
    },
    {
        "source_sentence": "將滅度時，以法身與彌勒菩薩摩訶薩、迦葉、阿難等；",
        "translation": "When he was about to enter nirvana, he gave the Dharma body to Maitreya Bodhisattva Mahasattva, Kasyapa, Ānanda, and others.",
        "source": "T25n1509_015:0173c01_2"
    },
    {
        "source_sentence": "然後入金剛三昧，自碎身骨令如芥子，以度眾生而不捨精進力。",
        "translation": "Then he enters the vajra samādhi, crushes his own body and bones like a mustard seed, and doesn't abandon the power of effort to save sentient beings.",
        "source": "T25n1509_015:0173c02_3"
    },
    {
        "source_sentence": "復次，如阿難為諸比丘說七覺意，至精進覺意，佛問阿難：「汝說精進覺意耶？」",
        "translation": "Furthermore, suppose Ānanda explains the seven awakening intentions for the monks up to the awakening intention of effort, and the Buddha asks Ānanda, Do you explain the awakening intentions of effort?",
        "source": "T25n1509_015:0173c04_4"
    },
    {
        "source_sentence": "阿難言：「說精進覺意。」",
        "translation": "Ānanda said, Teach the mind of enlightenment through effort.",
        "source": "T25n1509_015:0173c06_5"
    },
    {
        "source_sentence": "如是三問、三答。",
        "translation": "These are the three questions and three answers.",
        "source": "T25n1509_015:0173c06_6"
    },
    {
        "source_sentence": "佛即從坐起，告阿難：「人能愛樂修行精進，無事不得；",
        "translation": "The Buddha rose from his seat and said to Ānanda, “Those who delight in the practice of austerities are unable to attain any kind of enlightenment.",
        "source": "T25n1509_015:0173c07_7"
    },
    {
        "source_sentence": "得至佛道，終不虛也。」",
        "translation": "They'll attain the Buddha Way, which is never false.",
        "source": "T25n1509_015:0173c08_8"
    },
    {
        "source_sentence": "如是種種因緣，觀精進利而得增益。",
        "translation": "Such are the various reasons why they observe the benefits of effort and attain gain.",
        "source": "T25n1509_015:0173c08_9"
    },
    {
        "source_sentence": "如是精進，佛有時說為欲，或時說精進，有時說不放逸。",
        "translation": "Such effort sometimes is spoken of by the Buddha as attachment. Sometimes it is said to be effort. Sometimes, nonfrivolity is spoken of.",
        "source": "T25n1509_015:0173c09_10"
    },
    {
        "source_sentence": "譬如人欲遠行，初欲去時，是名為欲；",
        "translation": "Good man, this is analogous to someone who wishes to travel a long distance. This is called desire when he first wishes to leave.",
        "source": "T25n1509_015:0173c11_11"
    },
    {
        "source_sentence": "發行不住，是為精進；",
        "translation": "This is enlightening beings’ exertion.",
        "source": "T25n1509_015:0173c11_12"
    },
    {
        "source_sentence": "能自勸勵，不令行事稽留，是為不放逸。",
        "translation": "Being able to encourage oneself and not allowing others to act or retain it is called nonfrivolity.",
        "source": "T25n1509_015:0173c12_13"
    },
    {
        "source_sentence": "以是故，知欲生精進，精進生故不放逸，不放逸故能生諸法，乃至得成佛道。",
        "translation": "Because of this, they know that effort arises because they want to produce it, and because effort arises, they aren't careless; because they aren't careless, they can produce dharmas until they attain the Buddha Way.",
        "source": "T25n1509_015:0173c13_14"
    },
    {
        "source_sentence": "復次，菩薩欲脫生、老、病、死，亦欲度脫眾生，常應精進一心不放逸。",
        "translation": "Furthermore, if a bodhisattva wants to liberate sentient beings from birth, old age, illness, and death, and also wants to liberate sentient beings, he should always make effort with one mind and not be careless.",
        "source": "T25n1509_015:0173c15_15"
    },
    {
        "source_sentence": "如人擎油鉢行大眾中，現前一心不放逸故，大得名利。",
        "translation": "Suppose a person carries an oil bowl and walks among the masses, and because he's unified in his mind and doesn't act carelessly, he greatly attain fame and profit.",
        "source": "T25n1509_015:0173c16_16"
    },
    {
        "source_sentence": "又如偏閣嶮道，若懸繩，若乘山羊；",
        "translation": "It is also like a partial pavilion on a precipitous path, whether it is suspended by a rope or ridden by a mountain goat.",
        "source": "T25n1509_015:0173c18_17"
    },
    {
        "source_sentence": "此諸惡道，以一心不放逸故，身得安隱，今世大得名利。",
        "translation": "Because they are unified in mind and not lazy, the bodies of these evil destinies will attain peace. They will gain great fame and prosperity in this world.",
        "source": "T25n1509_015:0173c18_18"
    },
    {
        "source_sentence": "求道精進，亦復如是；",
        "translation": "So it is with the effort of those seeking enlightenment.",
        "source": "T25n1509_015:0173c20_19"
    },
    {
        "source_sentence": "若一心不放逸，所願皆得。",
        "translation": "If he's single-minded and doesn't careless, his wishes will be obtained.",
        "source": "T25n1509_015:0173c20_20"
    },
    {
        "source_sentence": "復次，譬如水流，能決大石；",
        "translation": "“Furthermore, it is analogous to a stream of water that can determine the size of a great rock.",
        "source": "T25n1509_015:0173c21_21"
    },
    {
        "source_sentence": "不放逸心，亦復如是。",
        "translation": "So it is with the mind that's not careless, too.",
        "source": "T25n1509_015:0173c21_22"
    },
    {
        "source_sentence": "專修方便，常行不廢，能破煩惱諸結使山。",
        "translation": "He exclusively cultivates skillful means, always practicing it without fail, which can break the mountain of afflictive bonds and tendencies.",
        "source": "T25n1509_015:0173c22_23"
    },
    {
        "source_sentence": "復次，菩薩有三種思惟：「若我不作，不得果報；",
        "translation": "“Furthermore, enlightening beings have three kinds of thought:",
        "source": "T25n1509_015:0173c23_24"
    },
    {
        "source_sentence": "若我不自作，不從他來；",
        "translation": "If I don’t do it myself, it won’t come from someone else.",
        "source": "T25n1509_015:0173c24_25"
    },
    {
        "source_sentence": "若我作者，終不失。」",
        "translation": "If I were to do it, I wouldn't lose it.",
        "source": "T25n1509_015:0173c25_0"
    },
    {
        "source_sentence": "如是思惟，當必精進，為佛道故，懃修專精而不放逸。",
        "translation": "Such a contemplation, you must make effort because it's for the sake of the Buddha Way, diligently cultivate it, concentrate on it, and don't be careless.",
        "source": "T25n1509_015:0173c25_1"
    },
    {
        "source_sentence": "如一小阿蘭若，獨在林中坐禪而生懈怠。",
        "translation": "Suppose there's a small forest monastery that sits alone in the forest and becomes lazy while meditating.",
        "source": "T25n1509_015:0173c26_2"
    },
    {
        "source_sentence": "　「林中小比丘，　　何以生懈廢？",
        "translation": "Why would a small monk in the forest become lazy?",
        "source": "T25n1509_015:0173c27_3"
    },
    {
        "source_sentence": "　　晝來若不畏，　　夜復如是來！」",
        "translation": "If he doesn't fearlessly come during the day, he'll come likewise at night!",
        "source": "T25n1509_015:0173c27_3"
    },
    {
        "source_sentence": "林中有神是佛弟子，入一死屍骨中，歌儛而來，說此偈言：是比丘驚怖起坐，",
        "translation": "There was a spirit in the forest. This disciple of the Buddha entered into the bones of a dead corpse and came out singing, saying these verses:",
        "source": "T25n1509_015:0173c27_3"
    },
    {
        "source_sentence": "內自思惟，中夜復睡。",
        "translation": "He thought to himself and fell asleep again in the middle of the night.",
        "source": "T25n1509_015:0174a03_4"
    },
    {
        "source_sentence": "是神復現十頭，口中出火，牙爪如劍，眼赤如炎，顧語將從：「捉此懈怠比丘！",
        "translation": "Again, the deity manifested ten heads, with fire coming out of their mouths, their teeth and nails like swords and eyes as red as hot, and looked around and said, Take this lazy monk!",
        "source": "T25n1509_015:0174a03_5"
    },
    {
        "source_sentence": "此處不應懈怠，何以故爾？」",
        "translation": "This place shouldn't be lazy, so why is that?",
        "source": "T25n1509_015:0174a05_6"
    },
    {
        "source_sentence": "是比丘大怖，即起思惟，專精念法，得阿羅漢道。",
        "translation": "That monk was greatly frightened, so he thought to himself, concentrated his thoughts on the Dharma, and attained the path of the arhat.",
        "source": "T25n1509_015:0174a06_7"
    },
    {
        "source_sentence": "是名自強精進不放逸力，能得道果。",
        "translation": "This is called the power of self-effort and nonfrivolity that enables one to attain the fruit of the path.",
        "source": "T25n1509_015:0174a07_8"
    },
    {
        "source_sentence": "復次，是精進不自惜身而惜果報，於身四儀：坐、臥、行、住常懃精進，",
        "translation": "“Furthermore, this effort does not cherish its own body but cherishes the rewards. The four bodily gestures of sitting, lying down, walking, and standing are always accompanied by effort.",
        "source": "T25n1509_015:0174a08_9"
    },
    {
        "source_sentence": "寧自失身，不廢道業。",
        "translation": "They would rather lose their own bodies than abandon the practice of the Way.",
        "source": "T25n1509_015:0174a09_10"
    },
    {
        "source_sentence": "譬如失火，以瓶水投之，唯存滅火而不惜瓶。",
        "translation": "It's like a man who loses a fire and throws it into a pot of water, but he only keeps the fire alive and doesn't spare the pot.",
        "source": "T25n1509_015:0174a10_11"
    },
    {
        "source_sentence": "　「決定心悅豫，　　如獲大果報，",
        "translation": "Their minds are determined and joyful, just as they attain great rewards.",
        "source": "T25n1509_015:0174a11_12"
    },
    {
        "source_sentence": "　　如願事得時，　　乃知此最妙！」",
        "translation": "When the task of wishing is attained, then you'll know that it's most wonderful!",
        "source": "T25n1509_015:0174a11_12"
    },
    {
        "source_sentence": "如仙人師教弟子說偈言：如是種種因緣，觀精進之利，能令精進增益。",
        "translation": "As the teacher of sages teaches his disciples, he says in verse, Such are the various causes and conditions that observe the benefits of effort to cause effort to increase.",
        "source": "T25n1509_015:0174a11_12"
    },
    {
        "source_sentence": "復次，菩薩修諸苦行，若有人來求索頭、目、髓、腦，盡能與之，而自念言：「我有忍辱、精進、智慧、方便之力，",
        "translation": "“Furthermore, when the bodhisattva is engaged in ascetic practices, if someone comes and asks for his hair, eyes, marrow, bones, or brains, he can give them to them freely. He thinks to",
        "source": "T25n1509_015:0174a16_13"
    },
    {
        "source_sentence": "受之尚苦，何況愚騃三塗眾生？",
        "translation": "It's still painful to experience, so why wouldn't it be painful for foolish sentient beings in the three destinies?",
        "source": "T25n1509_015:0174a18_14"
    },
    {
        "source_sentence": "我當為此眾生故，懃修精進，早成佛道而度脫之。」",
        "translation": "For the sake of these sentient beings, I will diligently cultivate my effort and quickly achieve the Buddha Way to liberate them.",
        "source": "T25n1509_015:0174a19_15"
    },
    {
        "source_sentence": "大智度論卷第十五",
        "translation": "Dazhiduo lun, vol. 15",
        "source": "T25n1509_015:0174a21_0"
    }
]