[
    {
        "source_sentence": "金剛仙論卷第七",
        "translation": "Jingang xian lun, vol. 7",
        "source": "T25n1512_007:0844a08_0"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1512_007:0844a10_0"
    },
    {
        "source_sentence": "以要言之，此經有不可思議不可稱量無邊功德」者，此是大段中第九，",
        "translation": "To sum up, this sūtra has inconceivable, immeasurable, and limitless merit. This is the ninth of the great section,",
        "source": "T25n1512_007:0844a10_1"
    },
    {
        "source_sentence": "名為利益分。",
        "translation": "It's called the benefit aspect.",
        "source": "T25n1512_007:0844a11_2"
    },
    {
        "source_sentence": "此經所以來者，前第八段中明一切眾生雖皆有真如佛性平等無差，要修行者見、不修行者則不能見。",
        "translation": "The reason for this sūtra's origin is that the previous eighth paragraph explained that although all sentient beings have the true buddha-nature of buddhahood, there's equality and no difference between those who cultivate it and those who don't cultivate it.",
        "source": "T25n1512_007:0844a12_3"
    },
    {
        "source_sentence": "上已明依此經受持讀誦三種修行能見佛性，然猶非究竟勝行，未知為直依此經三種修行得見佛性？",
        "translation": "The above has already explained that the buddha-nature can be seen based on the three kinds of cultivation of memorizing and reciting this sūtra, but it's still not the ultimate superior practice, so I don't know whether it's possible to directly see the buddha-nature based on the three kinds of cultivation of this sūtra?",
        "source": "T25n1512_007:0844a14_4"
    },
    {
        "source_sentence": "為復更成就何等勝行，有何等利益能見佛性？",
        "translation": "What kind of superior practices are further accomplished, and what kind of benefit is there to be gained from seeing the buddha-nature?",
        "source": "T25n1512_007:0844a16_5"
    },
    {
        "source_sentence": "見佛性時得何等果報？",
        "translation": "What kind of reward is attained when you see the buddha-nature?",
        "source": "T25n1512_007:0844a17_6"
    },
    {
        "source_sentence": "故今明不但依此經三種修行能見佛性，要更依經發思修二慧、復廣修萬行，",
        "translation": "Therefore, it's now clear that not only can you see the buddha-nature based on the three kinds of cultivation in this sūtra, but you must also rely on the sūtras to give rise to contemplation and cultivate two kinds of wisdom and further cultivate myriad practices.",
        "source": "T25n1512_007:0844a18_7"
    },
    {
        "source_sentence": "現在能滅往罪、未來斷除二障，得此現在未來現多種利益，方能見於佛性終剋常果也。",
        "translation": "Only when they can now extinguish past sins and remove the two hindrances in the future will they be able to attain these present and future benefits, and then they'll be able to see the eternal fruit of the buddha-nature as final and permanent.",
        "source": "T25n1512_007:0844a20_8"
    },
    {
        "source_sentence": "然前段初偈中言成就何業，今此中正出業體有多種，故次來也。",
        "translation": "However, in the first verse of the previous section, it's said what actions are accomplished, and now here, we're going to explain that there are many kinds of actions in essence, so they come next.",
        "source": "T25n1512_007:0844a22_9"
    },
    {
        "source_sentence": "上來已廣明持此經者，得多福德，皆是利益，何故不障利益之名？",
        "translation": "The above-mentioned person has explained in detail that those who preserve this sūtra will attain much merit, but they are all benefits, so why isn't the name benefit obstructed?",
        "source": "T25n1512_007:0844a23_10"
    },
    {
        "source_sentence": "所以此段獨得利益之稱者，然上來雖明依此經修行有多利益，未若此段明由持經因緣發生思修二慧，",
        "translation": "The reason this paragraph alone receives the title of benefit is that although the above explains that there are many benefits from cultivating practice based on this sūtra, it doesn't say that this paragraph explains that the two kinds of wisdom of contemplation and cultivation arise because of the causes and conditions for maintaining the sūtras.",
        "source": "T25n1512_007:0844a25_11"
    },
    {
        "source_sentence": "能轉過去重業現世輕受，未來復得世間出世間二種果報。",
        "translation": "He's able to change the heavy karma of past actions into light feelings in the present life, and he'll again attain two kinds of worldly and transmundane rewards in the future.",
        "source": "T25n1512_007:0844a27_12"
    },
    {
        "source_sentence": "以有如此多種利益，故偏名利益分也。",
        "translation": "Because there are so many such kinds of benefits, they're partially called the benefit part.",
        "source": "T25n1512_007:0844a28_13"
    },
    {
        "source_sentence": "然依此經修行乃有無量利益，且依此一段作九種章門，或作十種以利益之義，",
        "translation": "However, there are immeasurable benefits to be gained from cultivating the practice of this scripture. And in relying upon this passage, we present nine kinds of chapters and sections or ten kinds of meanings of benefit:",
        "source": "T25n1512_007:0844b01_0"
    },
    {
        "source_sentence": "故經初言「以要言之」，即是略列九種章門，以明利益也。",
        "translation": "That's why the first part of the sūtra says, To summarize, this is a brief listing of nine kinds of chapters that explain benefits.",
        "source": "T25n1512_007:0844b02_1"
    },
    {
        "source_sentence": "何者為九？",
        "translation": "What are these nine?",
        "source": "T25n1512_007:0844b04_2"
    },
    {
        "source_sentence": "一者，「此經有不可思議不可稱量無邊功德」者，論云「非餘者境界」，",
        "translation": "One, the phrase this sūtra has inconceivable, immeasurable, and limitless merit means that the treatise says, It's not the other sphere.",
        "source": "T25n1512_007:0844b04_3"
    },
    {
        "source_sentence": "明此經理深重有無邊功德，故先舉如來所說法也。",
        "translation": "It's because this manager has profound and limitless merit, so he first cites what the Tathāgata teaches.",
        "source": "T25n1512_007:0844b05_4"
    },
    {
        "source_sentence": "「不可思議」者，明此經所詮無為法身，是諸佛境界故，二乘凡夫不能惻也。",
        "translation": "The phrase inconceivable explains that the unconditioned Dharma body explained in this sūtra is the realm of the buddhas, so worldlings of the two vehicles can't see it.",
        "source": "T25n1512_007:0844b07_0"
    },
    {
        "source_sentence": "「不可稱量」者，明經有大功德，不可以算數稱量諸佛大人境界，故下句云無量功德也。",
        "translation": "The phrase immeasurable means that the sūtras have great merit, which can't be measured in terms of the Buddha's realm of greatness, so the next sentence says immeasurable merit.",
        "source": "T25n1512_007:0844b08_1"
    },
    {
        "source_sentence": "二者，「此法門如來為發大乘者說，為發最上乘者說」。",
        "translation": "Second, the Tathāgata explains this teaching for those who give rise to the great vehicle and for those who give rise to the supreme vehicle.",
        "source": "T25n1512_007:0844b11_0"
    },
    {
        "source_sentence": "論名「唯依大人說，此出所為人」，明經理既深，小根之人所不能受，",
        "translation": "The treatise says, Rely only on what's said by the great person, and this is the person who produces it. It explains that since managers are so deep, they can't be accepted by people of lesser faculties.",
        "source": "T25n1512_007:0844b12_1"
    },
    {
        "source_sentence": "唯為菩薩大根者說、為發大乘者說，此是地前菩薩始發心人；",
        "translation": "“The enlightening beings in this assembly spoke only for the sake of those who have great faculties and for those who are inspired with great aspiration for enlightenment. These were the first to awaken the determination for enlightenment of enlightening beings before they had attained buddhahood.",
        "source": "T25n1512_007:0844b13_2"
    },
    {
        "source_sentence": "為最上乘者，此明不但為始發心人說，亦為如實修行者說也。",
        "translation": "For the supreme vehicle, this explains that it's not only for someone who first arouses the mind but also for those who truly practice.",
        "source": "T25n1512_007:0844b15_3"
    },
    {
        "source_sentence": "三者，依下偈論釋初偈第三句云「及希聞信法」，明此經希有，信者難得。",
        "translation": "Third, the third phrase of the first verse in the following verse explains that it's called 'and those who want to hear and believe in the teaching.' It shows that this sūtra is rare and those who believe are difficult to attain.",
        "source": "T25n1512_007:0844b17_0"
    },
    {
        "source_sentence": "准偈中應別有第三段經，但能信之人及所信法不異前二段經故，義有文無。",
        "translation": "According to the verse, there should be a third section of the sūtra that only refers to those who are capable of faith and those who believe in the teachings because it doesn't differ from the previous two sections of the sūtra, so its meaning is existent but its text is absent.",
        "source": "T25n1512_007:0844b18_1"
    },
    {
        "source_sentence": "應舉不信之人形出能信之者，但以此不信之人義通前後故不別出，即指下第五經文中二乘外道不信者是也。",
        "translation": "It should be mentioned that the form of someone who doesn't believe produces those who can believe, but because the meaning of this person who doesn't believe is shared with the prior and subsequent, it doesn't come out separately, which refers to the non-believers of the two-vehicle non-Buddhists in the fifth sūtra text below.",
        "source": "T25n1512_007:0844b20_2"
    },
    {
        "source_sentence": "四者，「若有人受持讀誦修行此經至無量功德聚」，論名「滿足無上界」。",
        "translation": "Fourth, if someone memorizes, recites, cultivates, and practices this sūtra up to the point of immeasurable merit, the treatise is called fulfilling the unsurpassed realm.",
        "source": "T25n1512_007:0844b22_3"
    },
    {
        "source_sentence": "此明由受持此經故能生思修二慧乃至修二種莊嚴，顯滿足法身也。",
        "translation": "This explains that it's because of accepting and upholding this sūtra that the two kinds of wisdom of contemplation and cultivation can give rise to the two kinds of adornment, revealing the fulfillment of the Dharma body.",
        "source": "T25n1512_007:0844b24_4"
    },
    {
        "source_sentence": "「如來悉知悉見是人」者，上第六第八段中已明此義，今何故重明也？",
        "translation": "The phrase the Tathāgata fully knows and fully sees this person means that this meaning has been explained in the sixth and eighth paragraphs above, so why is it being explained again now?",
        "source": "T25n1512_007:0844b26_5"
    },
    {
        "source_sentence": "解云：為漸化眾生令生信心，故處處明也。",
        "translation": "Understanding says, In order to gradually transform sentient beings so that they give rise to faith, it's explained everywhere.",
        "source": "T25n1512_007:0844b27_6"
    },
    {
        "source_sentence": "「不可思議不可稱量無邊功德聚」者，此明持經因緣，得彼無為法身無邊功德聚也。",
        "translation": "The phrase inconceivable, immeasurable, and limitless stock of merit means that this explains the causes and conditions for maintaining the sūtras to attain the limitless stock of merit of the unconditioned Dharma body.",
        "source": "T25n1512_007:0844b28_7"
    },
    {
        "source_sentence": "五者，「如是人等則為荷擔如來阿耨三菩提」者，論名「受持真妙法」。",
        "translation": "The fifth, Thus these people are the bearers of the Tathāgata's unsurpassed three bodhisattvas, which is called receiving and maintaining the true and marvelous Dharma.",
        "source": "T25n1512_007:0844c02_0"
    },
    {
        "source_sentence": "明此持經之人既受持此經，則是能荷擔法身如來大菩提也。",
        "translation": "It means that someone who holds this sūtra and accepts it is the Tathāgata who can bear the burden of the Dharma body as a great bodhisattva.",
        "source": "T25n1512_007:0844c03_1"
    },
    {
        "source_sentence": "「何以故」者，難云：何以故如來唯為大乘人說此法門，不為小乘外道說也？",
        "translation": "The reason why is that it's difficult to say, Why is it that the Tathāgata explains this teaching only for people of the great vehicle and not for non-Buddhists of the lesser vehicle?",
        "source": "T25n1512_007:0844c04_2"
    },
    {
        "source_sentence": "故釋云「須菩提！",
        "translation": "That's why the explanation says, Subhūti!",
        "source": "T25n1512_007:0844c06_3"
    },
    {
        "source_sentence": "若樂小法者至無有是處」，明此二乘諸見外道各執己解故，所以不能於此經生信；",
        "translation": "If someone delights in the lesser teaching, there's no place for them. This shows that because these two-vehicle views and non-Buddhists each cling to their own understanding, they can't give rise to faith in this sūtra.",
        "source": "T25n1512_007:0844c06_4"
    },
    {
        "source_sentence": "既不生信，亦不為人說也。",
        "translation": "Since they don't give rise to faith, they won't teach it for others.",
        "source": "T25n1512_007:0844c08_5"
    },
    {
        "source_sentence": "此一段經皆明持經利益，何故乃舉樂小法人及以我見外道等在此中也？",
        "translation": "This section of the sūtra explains the benefits of maintaining the sūtras, so why is it here that small-minded people who take delight in self and non-Buddhists who see self are cited?",
        "source": "T25n1512_007:0844c09_6"
    },
    {
        "source_sentence": "欲明斯二人於此經中不能生信，既不生信則亦不能受持讀誦如說修行，",
        "translation": "To show that these two cannot produce faith in the doctrine of this scripture, neither can they receive, retain, recite, teach, and practice it.",
        "source": "T25n1512_007:0844c11_7"
    },
    {
        "source_sentence": "既不能受持何能荷擔也。",
        "translation": "Since they can't receive and uphold it, how can they bear the burden?",
        "source": "T25n1512_007:0844c12_8"
    },
    {
        "source_sentence": "上第三段指不信之人，在於第五即此文所明二乘外道人是也。",
        "translation": "The third paragraph above refers to people who don't believe, and the fifth one in this text explains that these are non-Buddhist people of the two vehicles.",
        "source": "T25n1512_007:0844c13_9"
    },
    {
        "source_sentence": "「若樂小法者」，明二乘之人心小意俠志無遠悕，聞佛道長遠久受懃苦乃可得成，",
        "translation": "If someone who enjoys the lesser teaching explains that the minds of the two vehicles have lesser intentions and heroic aspirations, there's no distant anger, and it's only when they hear that the Buddha Way is long and suffers from anger and suffering for a long time that it can be accomplished.",
        "source": "T25n1512_007:0844c14_10"
    },
    {
        "source_sentence": "便生怯弱退轉之心，但欲一生三生乃至六十劫，劬劬行道，速出三界，",
        "translation": "They then become faint-hearted and retrogressing, wanting only one birth or three births, up to sixty eons, crudely following the path, quickly leaving the three realms.",
        "source": "T25n1512_007:0844c16_11"
    },
    {
        "source_sentence": "盡分段生死，證羅漢果取灰身之樂，故不能信也。",
        "translation": "Through the exhaustion of segmental birth and death, he realizes the happiness of the arhat's fruit of grasping the body of ashes, so he can't believe it.",
        "source": "T25n1512_007:0844c18_12"
    },
    {
        "source_sentence": "「若有我見人見」等者，此明外道之人恃已我見為是，更無所求，不能信也。",
        "translation": "If there are views of self and views of people, etc., this shows that non-Buddhist people rely on the view of self as self and don't have anything to seek, and they can't believe it.",
        "source": "T25n1512_007:0844c19_13"
    },
    {
        "source_sentence": "六者，「須菩提在在處處若有此經」者，斯一段經，論名「尊重身得福」。",
        "translation": "The sixth, Suppose there's a sūtra where and where this sūtra exists that says, This is a section of the sūtra that discusses the title, Honoring the body to attain merit.",
        "source": "T25n1512_007:0844c22_0"
    },
    {
        "source_sentence": "敬重有此經處，勸人天阿修羅等廣設供養，生功德也。",
        "translation": "There's a place where this sūtra is venerated, and it encourages humans, gods, asuras, and so forth to make extensive offerings, producing merit.",
        "source": "T25n1512_007:0844c23_1"
    },
    {
        "source_sentence": "然此起塔勸供養處，與上勸供養處，文同而義異。",
        "translation": "However, this is the place where a stūpa is erected to encourage offerings, and it's the same as the above place where he encourages offerings, with the same meaning and different meaning.",
        "source": "T25n1512_007:0844c24_2"
    },
    {
        "source_sentence": "上勸起塔供養者，明眾生所以得人天修羅五欲樂果者，由依此經修行五戒十善而得，",
        "translation": "The above exhortation to erect a stūpa as an offering explains that the reason sentient beings attain the fruit of the five desires and pleasures of humans and gods is because they rely on this sūtra to cultivate the five precepts and ten good qualities.",
        "source": "T25n1512_007:0844c25_3"
    },
    {
        "source_sentence": "故所以勸起塔供養其處以酬往恩；",
        "translation": "That is why they are encouraged to build stupas and honor the places of worship in order to repay their past kindness.",
        "source": "T25n1512_007:0844c27_4"
    },
    {
        "source_sentence": "此中復勸於此處供養者，明依此經修行，畢竟能得無為法身無上菩提，",
        "translation": "Here again, to those who are encouraged to make offerings here, it's explained that based on the cultivation of this sūtra, they can ultimately attain the unsurpassed enlightenment of the uncreated Dharma body.",
        "source": "T25n1512_007:0844c28_5"
    },
    {
        "source_sentence": "故勸供養如塔廟想也。",
        "translation": "That's why they encourage offerings are like the conception of a stūpa or shrine.",
        "source": "T25n1512_007:0845a01_6"
    },
    {
        "source_sentence": "七者，「復次須菩提！",
        "translation": "The seventh is, Furthermore, Subhūti!",
        "source": "T25n1512_007:0845a02_0"
    },
    {
        "source_sentence": "若善男子善女人受持讀誦此經，為人輕賤」者，論名「及遠離諸障」。",
        "translation": "If good men and good women who memorize and recite this sūtra will be despised by others, the treatise says, And they'll be freed from the hindrances.",
        "source": "T25n1512_007:0845a02_1"
    },
    {
        "source_sentence": "此一段經，出經之威力，明持經功德有二世利益：一、由受持此經發思修二慧，",
        "translation": "This section of the sutra reveals the authoritative power of the sūtras and explains that maintaining the merits of the sūtras has two worldly benefits: 1. By accepting and upholding this sūtra, they give rise to the two kinds of wisdom of contemplation and cultivation.",
        "source": "T25n1512_007:0845a03_2"
    },
    {
        "source_sentence": "能轉過去三塗重業，現世輕受。",
        "translation": "They are able to transmute the three defiled karmas of the past, which are despised in the present life.",
        "source": "T25n1512_007:0845a05_3"
    },
    {
        "source_sentence": "二、因思修二慧故，十地行滿，未來遠離二障，必得無上菩提也。",
        "translation": "2. Because of the two kinds of wisdom of contemplation and cultivation, when the ten stages are fulfilled, they'll be freed from the two hindrances in the future and will surely attain unsurpassed enlightenment.",
        "source": "T25n1512_007:0845a06_4"
    },
    {
        "source_sentence": "明此人先世非但有罪亦有福德，以過去福德因緣今得聞此經，既聞經已，",
        "translation": "It means that in a previous life this person was not only guilty but also meritorious, and because of the causes and conditions of their past virtue they are now able to hear this sūtra. Having heard it,",
        "source": "T25n1512_007:0845a07_5"
    },
    {
        "source_sentence": "復能受持、為人演說，得滅罪業；",
        "translation": "They are also able to receive, retain, and expound the Teaching for others, thereby extinguishing sins.",
        "source": "T25n1512_007:0845a09_6"
    },
    {
        "source_sentence": "非但滅過去罪業，復能斷除二障，得大菩提也。",
        "translation": "Not only does he extinguish past sins and actions, but he can also remove the two hindrances and attain great enlightenment.",
        "source": "T25n1512_007:0845a10_7"
    },
    {
        "source_sentence": "「為人輕賤」者，明持經功德能轉三塗重業為輕。",
        "translation": "The phrase for the sake of despising people means to explain that the merit of maintaining the sūtras can transform the three defilements and heavy karma into lightness.",
        "source": "T25n1512_007:0845a11_8"
    },
    {
        "source_sentence": "使現在為人輕賤，乃至頭痛即滅，非謂由持經故招人輕賤報也。",
        "translation": "It doesn't mean that it's because of maintaining the sūtras that they invite despise and despise people, even to the point where their headaches cease.",
        "source": "T25n1512_007:0845a12_9"
    },
    {
        "source_sentence": "乘生疑難：若此經有大威力，能轉重業為輕，罪即消滅者；",
        "translation": "Doubts arose in the Mahayana. If this scripture had great power, it would turn serious karma into light action and sins would be extinguished.",
        "source": "T25n1512_007:0845a13_10"
    },
    {
        "source_sentence": "既威力如是，何故不能使罪業永盡，乃令輕報而已？",
        "translation": "Since their authority is so great, why can they not cause sins to be permanently extinguished and let the retribution be little more than that?",
        "source": "T25n1512_007:0845a15_11"
    },
    {
        "source_sentence": "答意明此經威力實非不能令永滅，但為行惡不信眾生亦有善惡業報也，",
        "translation": "Answer: The meaning of this sūtra's authoritative power is that it really can't be permanently extinguished, but because sentient beings who do evil and don't believe in it also have the results of good and bad actions.",
        "source": "T25n1512_007:0845a16_12"
    },
    {
        "source_sentence": "然不差故，但令輕受不永盡。",
        "translation": "However, because they are not different, they simply cause light feelings that aren't permanently extinguished.",
        "source": "T25n1512_007:0845a18_13"
    },
    {
        "source_sentence": "八者，論名「復能速證法」，從「須菩提！",
        "translation": "The eighth is the treatise called Furthermore, able to quickly realize the teaching, which follows from Suppository!",
        "source": "T25n1512_007:0845a19_0"
    },
    {
        "source_sentence": "我念過去無量阿僧祇等至所不能及」。",
        "translation": "I'm mindful of the immeasurable incalculable incalculable eons of the past that I couldn't reach.",
        "source": "T25n1512_007:0845a19_1"
    },
    {
        "source_sentence": "此一段經，明釋迦如來自引往昔初燃燈已前未入習種性時，供養八十四億那由他佛。",
        "translation": "This section of the sūtra explains that in the past, when the Tathāgata Śākyamuni hadn't yet entered into the cultivation of his seed nature before he first burned the lamp, he made offerings to 8,400,000,000 nayutas.",
        "source": "T25n1512_007:0845a20_2"
    },
    {
        "source_sentence": "雖復親承爾許諸佛，四事供養、聽受勝法、三業利益，無空過者，故挍量不如末世持經功德百千萬分。",
        "translation": "Even though they personally inherit such buddhas and make offerings to them in four ways, listen to their superior teachings, and benefit from the three activities, there's nothing wrong with that, so it's not as great as a hundred million parts of the merit of maintaining the sūtras in the latter part of time.",
        "source": "T25n1512_007:0845a22_3"
    },
    {
        "source_sentence": "不相比類，以不能速證佛果故也。",
        "translation": "They aren't comparable because they can't quickly realize the Buddhahood.",
        "source": "T25n1512_007:0845a24_4"
    },
    {
        "source_sentence": "有三義故所以不如。",
        "translation": "Because there are three meanings, it's not like that.",
        "source": "T25n1512_007:0845a25_5"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T25n1512_007:0845a26_6"
    },
    {
        "source_sentence": "一、以如來在世修行供養不以為難；",
        "translation": "The first is that it is not difficult to make offerings to the enlightened by cultivating practice in the world.",
        "source": "T25n1512_007:0845a26_7"
    },
    {
        "source_sentence": "二、所行經供養功德是取相心；",
        "translation": "The second is the mental state of grasping characteristics, which consists of making offerings to practiced scriptures.",
        "source": "T25n1512_007:0845a27_8"
    },
    {
        "source_sentence": "三、此取相之行既不能正感菩提，但能作其遠因。",
        "translation": "3. Since this practice of grasping characteristics doesn't directly bring about enlightenment, it can only be a distant cause.",
        "source": "T25n1512_007:0845a27_9"
    },
    {
        "source_sentence": "有此三義故，不速證無上菩提，不如持經福也。",
        "translation": "Because of these three meanings, they won't quickly realize unsurpassed enlightenment, which is not as good as maintaining the merit of the sūtras.",
        "source": "T25n1512_007:0845a28_10"
    },
    {
        "source_sentence": "九者，論名「成種種勢力，得大妙果報」。",
        "translation": "Nine, the treatise says, Accomplish various powers and attain great marvelous rewards.",
        "source": "T25n1512_007:0845b01_0"
    },
    {
        "source_sentence": "若作十章門，分此兩句為二。",
        "translation": "If we create ten chapters, these two phrases are divided into two.",
        "source": "T25n1512_007:0845b01_1"
    },
    {
        "source_sentence": "從「須菩提！",
        "translation": "It's from Subhūti!",
        "source": "T25n1512_007:0845b02_2"
    },
    {
        "source_sentence": "若善男子善女人於後末世有受持修行此經所得功德，若我具說或有人聞心則狂亂」等，",
        "translation": "If good men and good women have received, maintained, and cultivated the merits of this sūtra in later generations, then if I explain it fully, or if someone hears it, their minds will be disturbed.",
        "source": "T25n1512_007:0845b02_3"
    },
    {
        "source_sentence": "自此以下二段經，明持經因緣，能得世間出世間二種果報。",
        "translation": "From here, the next two sections of the sūtra explain the causes and conditions for maintaining the sūtras that enable them to attain worldly and transmundane rewards of two kinds.",
        "source": "T25n1512_007:0845b04_4"
    },
    {
        "source_sentence": "此文明持經功德非但正感佛果，亦兼得世間人王天王五欲果報也。",
        "translation": "The merit of maintaining the sūtras in this civilization isn't just that they correctly bring about the Buddhahood, but it's also the result of the five desires of human kings and heavenly kings in the world.",
        "source": "T25n1512_007:0845b06_5"
    },
    {
        "source_sentence": "「若我具說或有人聞心則狂亂疑惑不信」者，若我具說持經所得世間出世間二種果報者，",
        "translation": "If I explain in detail that if someone hears the mind, they'll be crazy and doubtful and won't believe it, then if I explain in detail the two kinds of fruits of worldly and transmundane rewards obtained by holding the sūtras,",
        "source": "T25n1512_007:0845b07_6"
    },
    {
        "source_sentence": "眾生聞則疑惑故，但說得出世不可思議功德，不說得世間果報也。",
        "translation": "Because sentient beings hear it and doubt it, they only talk about the inconceivable merit of supramundane attainment and don't talk about attaining worldly rewards.",
        "source": "T25n1512_007:0845b09_7"
    },
    {
        "source_sentence": "上明行取相行者，得三界果報，受持此經，唯得無為法身至極之果；",
        "translation": "The above explains that practitioners of the practice of grasping characteristics will attain the results of the three realms. Accepting and upholding this scripture, they will only attain the ultimate fruit of the unconditioned dharma body.",
        "source": "T25n1512_007:0845b11_8"
    },
    {
        "source_sentence": "此中復言得世間出世間二種果報，斯言何故前後相違不定？",
        "translation": "Here, it's further said that they attain the two kinds of worldly and supramundane rewards, but why does this statement mean that the former and latter are contradictory and indeterminate?",
        "source": "T25n1512_007:0845b12_9"
    },
    {
        "source_sentence": "若得無為法身，不應復得世間天王果報；",
        "translation": "If someone attains the body of unconditioned reality, they should no longer attain the rewards of worldly celestial kingship.",
        "source": "T25n1512_007:0845b14_10"
    },
    {
        "source_sentence": "既得人王天王報，不應復得法身果也，以此世人現都榮位、情重王報，",
        "translation": "Since they've received the rewards of human kingship and heavenly kingship, they shouldn't again attain the fruit of the Dharma body. Because of this, people in the world now show their prosperous status and affectionate royal rewards,",
        "source": "T25n1512_007:0845b15_11"
    },
    {
        "source_sentence": "於中取著，便用持經功德求於世報、不求佛果，故心狂亂也。",
        "translation": "Taking attachment to them, he then uses the merit of maintaining sūtras to seek worldly rewards and doesn't seek Buddhahood, so his mind is confused.",
        "source": "T25n1512_007:0845b16_12"
    },
    {
        "source_sentence": "既狂亂，則猶豫不信。",
        "translation": "Since they're crazy, they're hesitant and don't believe it.",
        "source": "T25n1512_007:0845b18_13"
    },
    {
        "source_sentence": "不知受持此經為決定能得佛果、為不得？",
        "translation": "Doesn't he know whether it's certain to receive and uphold this sūtra and attain the Buddhahood or not?",
        "source": "T25n1512_007:0845b18_14"
    },
    {
        "source_sentence": "如此猶豫，故曰疑也。",
        "translation": "Because of such hesitation, it's called doubt.",
        "source": "T25n1512_007:0845b19_15"
    },
    {
        "source_sentence": "此疑心迷理更起煩惱，故曰或也。",
        "translation": "This doubting mind is deluded about the principle and further generates afflictions, so it's called'something.'",
        "source": "T25n1512_007:0845b20_0"
    },
    {
        "source_sentence": "然上言依此經行無相檀波羅蜜等，能得無為法身，不得世間果報。",
        "translation": "However, the above statement is that relying on the practice of this sūtra's markless perfection of giving and so forth, they can attain the unconditioned Dharma body and not obtain worldly rewards.",
        "source": "T25n1512_007:0845b20_1"
    },
    {
        "source_sentence": "今此中何故云受持此經得世間出世間人王天王等尊位勢力果報者，明受持此經實自遠得無為法身大妙果報。",
        "translation": "Now, why is it said here that someone who receives and maintains this sūtra will attain the fruit of the power of worldly and transmundane human kings, heavenly kings, and other venerable positions will surely attain the great marvelous fruit of accepting and maintaining this sūtra from afar to really attain the great reward of the unconditioned Dharma body as a great",
        "source": "T25n1512_007:0845b22_2"
    },
    {
        "source_sentence": "所以得世間諸王果報者，以行者修行未滿、未成佛中間，自然得此人天傍報。",
        "translation": "The reason they attain the rewards of worldly kings is that practitioners who cultivate practice before they've fulfilled it or become buddhas will naturally attain the human and divine side-rewards of this person.",
        "source": "T25n1512_007:0845b24_3"
    },
    {
        "source_sentence": "如人種穀但求果實，不悕蒿草自然得之。",
        "translation": "It's like when a person plants grain but seeks fruit and doesn't eat the grapes or grass, they'll naturally obtain it.",
        "source": "T25n1512_007:0845b26_4"
    },
    {
        "source_sentence": "菩薩雖受此世王之果而不染著，勿謂此果同於世間取相所得實果也。",
        "translation": "Although bodhisattvas experience the fruit of this worldly king, they aren't stained by attachment, so don't say that this fruit is the same as the real fruit obtained by grasping characteristics in the world.",
        "source": "T25n1512_007:0845b27_5"
    },
    {
        "source_sentence": "「論曰：復成就何業修行」者，牒上第八段三種修行初論本偈中第三句也。",
        "translation": "The treatise says, What's the cultivation of karma that's further accomplished? refers to the third phrase in the first verse of the eighth paragraph above, which explains the three kinds of cultivation.",
        "source": "T25n1512_007:0845c01_0"
    },
    {
        "source_sentence": "「顯彼修行業」者，生此利益分，明此一段經。",
        "translation": "The phrase revealing their cultivation of karma refers to the benefits that arise from this section of the sutra, which explains this one section of the sūtra.",
        "source": "T25n1512_007:0845c02_1"
    },
    {
        "source_sentence": "所以經文在此而章門在上者，以前明三種聞慧是其修行，今辨得多種利益。",
        "translation": "That's why the sūtras are here and the chapter approach is above, which previously explained that the three kinds of hearing and wisdom are their cultivation, and now we'll explain the many benefits they attain.",
        "source": "T25n1512_007:0845c03_2"
    },
    {
        "source_sentence": "思修二慧亦是修行，以三慧義勢相屬。",
        "translation": "The two wisdoms of the one through reasoning and the one through personal realisation are also a spiritual practice: because they belong to each other in terms of the power of the three kinds of wisdom.",
        "source": "T25n1512_007:0845c05_3"
    },
    {
        "source_sentence": "復修行名通，義有拘瑣故，章門在上、經釋在此。",
        "translation": "Furthermore, the cultivation of practice is called supernormal because its meaning is limited. The chapters and sections are found above; the sūtras and interpretations are found here.",
        "source": "T25n1512_007:0845c06_4"
    },
    {
        "source_sentence": "以斯經解釋方彰、修行之義足，故言顯彼修行業也。",
        "translation": "It's because this sūtra explains that only then does it reveal the meaning of cultivation and the sufficientness of cultivation, so it's called revealing those who cultivate actions.",
        "source": "T25n1512_007:0845c07_5"
    },
    {
        "source_sentence": "此一段經，凡以三行偈，作九種章門或作十章門釋此一段經。",
        "translation": "This section of the sūtra explains this section of the sūtra with three lines of verse that create nine kinds of chapters or ten chapters to explain it.",
        "source": "T25n1512_007:0845c08_6"
    },
    {
        "source_sentence": "初一偈釋前四章門，第二偈釋中四章門，第三偈上二句釋後一章門亦得分釋二章門，",
        "translation": "The first verse explains the first four chapter approaches, the second verse explains the four chapter approaches in the second verse, and the third verse explains the first two sentences above that the latter one chapter approach is also divided into two chapter approaches.",
        "source": "T25n1512_007:0845c09_7"
    },
    {
        "source_sentence": "下半偈通結三偈，勸人令知也。",
        "translation": "The next half of the verse concludes with three verses that encourage people to know.",
        "source": "T25n1512_007:0845c11_8"
    },
    {
        "source_sentence": "「非餘者境界」者，釋經中第一段，明此經理深，非凡夫二乘聞思修慧心意識所惻，",
        "translation": "The first paragraph of the sūtra explains that this manager is profound, and it's not something that ordinary people in the two vehicles hear, contemplate, cultivate, wisdom, mind, thought, and consciousness see.",
        "source": "T25n1512_007:0845c12_9"
    },
    {
        "source_sentence": "故非餘者境界也。",
        "translation": "Therefore, it's not the other realm.",
        "source": "T25n1512_007:0845c14_10"
    },
    {
        "source_sentence": "「唯依大人說」者，釋第二段經，明經理既深，小根之人不能勘受，故但為菩薩大人說也。",
        "translation": "The phrase only relying on what's taught by the great man explains the second paragraph of the sūtra, which explains that managers are so deep that those with lesser faculties can't accept them, so it's only taught for the bodhisattvas and great men.",
        "source": "T25n1512_007:0845c14_11"
    },
    {
        "source_sentence": "然如來非能為菩薩說、不為小乘人說，但菩薩機根大故所以為說，小乘之人器小心狹不勘聞大所以不為說之，",
        "translation": "But the Tathagata cannot teach it to bodhisattvas, nor does he teach it to adherents of the lesser vehicle. The bodhisattva is only taught because his faculties are so great as to enable him to do so. Those who belong to the lesser vehicle should be cautious and narrow-minded, not listening to the teachings of the Great Vehicle.",
        "source": "T25n1512_007:0845c16_12"
    },
    {
        "source_sentence": "非情不平等鄙於二乘不為說也。",
        "translation": "They don't have feelings that aren't equal and despise the two vehicles and don't teach them.",
        "source": "T25n1512_007:0845c19_13"
    },
    {
        "source_sentence": "如日初出，光照高山，後照於下，非曰有高下之心故然也。",
        "translation": "It's like when the sun first rises and shines on a high mountain, and then it shines downward; it's not because there's a higher or lower mind.",
        "source": "T25n1512_007:0845c20_14"
    },
    {
        "source_sentence": "「及希聞信法」者，此是釋第三段，明此經希有信者難得。",
        "translation": "The phrase and those who want to hear faith in the teaching refers to the third section of the explanation, which explains that this sūtra is rare and difficult for those who have faith.",
        "source": "T25n1512_007:0845c21_15"
    },
    {
        "source_sentence": "經中更無別文可釋，即指前二段經中人法，以為能信所信人法也。",
        "translation": "There's no separate text in the sūtras that can be interpreted, which refers to the first two sections of the sūtra that refer to the teachings of humans and dharmas as the teachings of those who believe them.",
        "source": "T25n1512_007:0845c22_16"
    },
    {
        "source_sentence": "「希聞」者，明凡夫二乘不聞此經，設聞不能生信，唯菩薩能聞能信，",
        "translation": "The phrase wishing to hear explains that ordinary people and adherents of the two vehicles don't hear this sūtra, and even if they hear it, they can't give rise to faith; only bodhisattvas are able to hear and believe.",
        "source": "T25n1512_007:0845c24_17"
    },
    {
        "source_sentence": "信者難得，故云希聞信法也。",
        "translation": "Faith is difficult to attain, so it's called wishing to hear the teaching of faith.",
        "source": "T25n1512_007:0845c25_18"
    },
    {
        "source_sentence": "「滿足無上界」者，釋第四段經，明持經因緣，能顯無為法身法身滿足性也。",
        "translation": "The phrase fulfilling the unsurpassed realm explains the fourth section of the sūtra, which explains the causes and conditions for maintaining the sūtras that reveal the fulfillment of the Dharma body of the unconditioned Dharma body and Dharma body.",
        "source": "T25n1512_007:0845c26_19"
    },
    {
        "source_sentence": "此明滿足性，有二二十，二地菩薩分中顯滿足性；",
        "translation": "This explains the nature of fulfillment, which consists of twenty-two parts. The second is to reveal the nature of fulfillment in the chapter on enlightening beings at the second stage.",
        "source": "T25n1512_007:0845c28_20"
    },
    {
        "source_sentence": "二顯如來果頭具足現用滿足性也。",
        "translation": "The second shows that the Tathāgata's fruition is complete in terms of its present and fulfilled nature.",
        "source": "T25n1512_007:0845c29_21"
    },
    {
        "source_sentence": "「受持真妙法」者，釋經中第五段。",
        "translation": "The fifth section of the explanation of the sūtra's meaning is to receive and uphold the true marvelous dharma.",
        "source": "T25n1512_007:0846a01_22"
    },
    {
        "source_sentence": "若受持此經，不能尋詮會理得理亡詮，不名受持真妙法要。",
        "translation": "If someone were to memorize this sūtra, they wouldn't be able to explain it, understand the principle, obtain the principle and lose the explanation, and it wouldn't be called memorizing the true and marvelous essentials of the Dharma.",
        "source": "T25n1512_007:0846a01_23"
    },
    {
        "source_sentence": "受持此經，能亡詮會旨，解無為法身，方名受持真妙法，故明受持經者，",
        "translation": "To memorize this sūtra is to be able to lose the meaning of the assembly and understand the body of the unconditioned dharma body, which is then called memorizing the true and marvelous dharma. Therefore, it's clear that someone who memorizes the sutra will only be called one who receives and upholds it.",
        "source": "T25n1512_007:0846a03_24"
    },
    {
        "source_sentence": "即是荷擔如來真妙法身也。",
        "translation": "That is, it's the true and marvelous Dharma body of the Loaded Tathāgata.",
        "source": "T25n1512_007:0846a04_25"
    },
    {
        "source_sentence": "「尊重身得福」者，釋經中第六段，明非但持經多得功德，敬重說此經處、廣設供養亦得多福，",
        "translation": "The phrase honoring the body to obtain merit refers to the sixth section of the sūtra that explains that not only does maintaining the sūtras often obtain merit, but reverently explaining the place where this sūtra is taught and making extensive offerings also produces much merit.",
        "source": "T25n1512_007:0846a05_26"
    },
    {
        "source_sentence": "以此處說金剛般若、辨無為法身，供養此處即供養法身故，云尊重也。",
        "translation": "This is the place where he teaches the Vajra-prajñāpāramitā and identifies the unconditioned Dharma body, and making offerings here are called honoring the Dharma body because they make offerings to it.",
        "source": "T25n1512_007:0846a07_27"
    },
    {
        "source_sentence": "「身時得福」者，說供養人，身得世間出世間二種果報也。",
        "translation": "The phrase merit attained at the time of the body refers to making offerings to people, which are the two kinds of rewards for worldly and supramundane rewards obtained by the body.",
        "source": "T25n1512_007:0846a09_28"
    },
    {
        "source_sentence": "「及遠離諸障」者，釋經中第七段，以持經功德威力，使三惡罪業現世輕受即為消滅，",
        "translation": "The phrase and being free of hindrances refers to the seventh section of the sūtra, which explains that it's because of the power of maintaining the sūtras that the three bad sins are extinguished in the present world by being lightly received.",
        "source": "T25n1512_007:0846a10_29"
    },
    {
        "source_sentence": "亦離智障煩惱障也。",
        "translation": "They're also free of the cognitive hindrances and afflictive hindrances.",
        "source": "T25n1512_007:0846a12_30"
    },
    {
        "source_sentence": "「復能速證法」者，釋經中第八段，明佛自引過去雖供養諸佛，當爾時懷取相心，",
        "translation": "The phrase Furthermore, they can quickly realize the teaching means that the eighth section of the sūtra explains that although the Buddha himself cites the past as an offering to the buddhas, he then harbors the mind of grasping characteristics.",
        "source": "T25n1512_007:0846a12_31"
    },
    {
        "source_sentence": "不能疾得菩提。",
        "translation": "They can't quickly attain enlightenment.",
        "source": "T25n1512_007:0846a14_32"
    },
    {
        "source_sentence": "若能受持此經者，不近期三界有為果報故，能速證無上菩提法也。",
        "translation": "If someone can memorize this sūtra, they won't be subject to the conditioned results of the three realms in the near future, and they'll quickly realize the unsurpassed method of enlightenment.",
        "source": "T25n1512_007:0846a14_33"
    },
    {
        "source_sentence": "「成種種勢力」者，釋經中第九段，明持經功德能得世間人天中王種種勢力果也。",
        "translation": "The phrase accomplishing various powers refers to the ninth section of the sūtra, which explains that the merit of maintaining the sūtras enables them to attain the fruit of the various powers of worldly kings among humans and gods.",
        "source": "T25n1512_007:0846a16_34"
    },
    {
        "source_sentence": "「得大妙果報」者，此二句釋經中「此法門不可思議果報亦不可思議」，",
        "translation": "Attaining great marvelous rewards means that these two phrases explain the sūtra's statement, This teaching is inconceivable and its rewards are also inconceivable.",
        "source": "T25n1512_007:0846a18_35"
    },
    {
        "source_sentence": "此明非但直得世間種種勢力果報，乃遠感出世間極大妙果也。",
        "translation": "This explains that it's not just the direct attainment of the results of various powers in the world, but the extremely great marvelous result of transcending the world that's produced from afar.",
        "source": "T25n1512_007:0846a19_36"
    },
    {
        "source_sentence": "「此三行偈說何等義」者，論主將以長行釋偈中九章門故，作此問生起也。",
        "translation": "What's the meaning of these three lines of the verse? means that the treatise leader will ask this question because he's going to explain the nine chapters of the long line of the verse in order to give rise to it.",
        "source": "T25n1512_007:0846a22_0"
    },
    {
        "source_sentence": "「有不可思議至不共聲聞」等，釋偈中初句也。",
        "translation": "The phrase there's something inconceivable up to the point where it's not shared with śrāvakas and so forth explains the first phrase of the verse.",
        "source": "T25n1512_007:0846a23_1"
    },
    {
        "source_sentence": "「以為住第一大乘者至修行勝故」，釋偈中第二句也。",
        "translation": "It's the second phrase in the explanation of the verse that says it's because those who abide in the first great vehicle attain the superiority of cultivation.",
        "source": "T25n1512_007:0846a24_2"
    },
    {
        "source_sentence": "「以信小乘等則不能聞此示希聞而能信法故」，釋偈中第三句也，并釋三章門竟。",
        "translation": "It's because those who believe in the lesser vehicle and so forth can't hear this teaching, show their desire to hear it, and are able to believe in the teaching. This is the third phrase in the explanation of the verse that explains the completion of the three chapters.",
        "source": "T25n1512_007:0846a25_3"
    },
    {
        "source_sentence": "「如經」以下，通舉經來結也。",
        "translation": "Below thusness of the sūtra, we'll summarize it by referring to the sūtras.",
        "source": "T25n1512_007:0846a27_4"
    },
    {
        "source_sentence": "「希聞者謂不可思議等文句」者，前二章門經中有文，即此二章門經。",
        "translation": "The phrase those who wish to hear refers to inconceivable words and phrases means that there's a text in the first two chapters of the sutra, namely these two chapters of the sutra.",
        "source": "T25n1512_007:0846a28_5"
    },
    {
        "source_sentence": "上作第三章門，經無別文，恐人不識故，還指上章門，謂「不可思議」等文句也。",
        "translation": "The above is the third chapter aspect of the sūtra, which has no separate text, and because it's feared that people won't know it, they return to the higher chapter aspect, which refers to the words inconceivable and so forth.",
        "source": "T25n1512_007:0846a29_6"
    },
    {
        "source_sentence": "「得不可思議等福德至無量功德聚故」，解偈中第四句，舉經來結也。",
        "translation": "Attaining inconceivable merits up to an immeasurable stock of merit, the fourth phrase in the verse explains that it's a conclusion by citing the sūtras.",
        "source": "T25n1512_007:0846b02_7"
    },
    {
        "source_sentence": "下釋二偈五章門，一一略提經解釋，還廣舉經，依論可知也。",
        "translation": "The following is an explanation of the five chapters of the two verses, each one briefly explaining the sūtras and also citing the sūtras in detail, which can be understood based on the treatise.",
        "source": "T25n1512_007:0846b04_8"
    },
    {
        "source_sentence": "「爾時須菩提白佛言：云何菩薩發三菩提心？",
        "translation": "It was then that Suppository said to the Buddha, How does a bodhisattva give rise to the three kinds of mind of enlightenment?",
        "source": "T25n1512_007:0846b06_0"
    },
    {
        "source_sentence": "云何降伏其心」等，以下凡有十六段經文，此是大段中第十，名為斷疑分。",
        "translation": "What's the way to subdue their minds? and so forth, where there are 16 sections of sūtras that follow, this is the tenth of the major section, which is called the section on ending doubt.",
        "source": "T25n1512_007:0846b07_0"
    },
    {
        "source_sentence": "此所以名斷疑者，上從第三段來已廣辨斷疑，何故不與斷疑之名，此段所以獨得斷疑之稱也？",
        "translation": "This is why it's called stopping doubt. The third paragraph above has already extensively explained the removal of doubt, so why isn't it given the name stopping doubt? Why does this paragraph alone get the name stopping doubt?",
        "source": "T25n1512_007:0846b08_1"
    },
    {
        "source_sentence": "然眾生到側。",
        "translation": "Still, when sentient beings come to the side.",
        "source": "T25n1512_007:0846b10_2"
    },
    {
        "source_sentence": "或取著心，多聞如來說法，於一法上起種種疑。",
        "translation": "Or they may become attached to their minds and hear a lot of the Tathāgata's teachings, and various doubts arise about a single teaching.",
        "source": "T25n1512_007:0846b11_3"
    },
    {
        "source_sentence": "從第三段來至第九段，此一周說法，於菩薩眾生佛淨土等四法上次第一遍斷疑。",
        "translation": "From the third paragraph up to the ninth paragraph, this week he teaches the Dharma, cutting off doubts one by one in order among the four dharmas of bodhisattvas, sentient beings, buddhas, pure lands, and so forth.",
        "source": "T25n1512_007:0846b12_4"
    },
    {
        "source_sentence": "然各逐所明，事義不同，別立名字。",
        "translation": "Each, however, establishes a separate name in accordance with what it explains, given the differences in substance and meaning.",
        "source": "T25n1512_007:0846b14_5"
    },
    {
        "source_sentence": "雖復斷疑，而不名斷疑分。",
        "translation": "Even though it also removes doubt, it's not called the part that removes doubt.",
        "source": "T25n1512_007:0846b14_6"
    },
    {
        "source_sentence": "自此以下還提上經，其文略同，而疑有異、答意亦異，故獨得斷疑之名也。",
        "translation": "From here, we'll return to the above sūtra, which briefly shares the same text but has different doubts and answers with different meanings, so it's the only one that gets the name of eliminating doubt.",
        "source": "T25n1512_007:0846b15_7"
    },
    {
        "source_sentence": "以何次第起此第十段？",
        "translation": "What's the order in which this tenth paragraph arises?",
        "source": "T25n1512_007:0846b17_8"
    },
    {
        "source_sentence": "十將欲釋上所未斷疑故，次第重舉前七段經來以釋眾疑故，次明此斷疑分經也。",
        "translation": "Ten, because he wants to explain the doubts that haven't been eliminated above, he sequentially reintroduces the first seven sections of the sūtra to explain the many doubts, and then he explains that this is the Sutra on the Elimination of Doubts.",
        "source": "T25n1512_007:0846b17_9"
    },
    {
        "source_sentence": "「爾時須菩提白佛至則非菩薩」，重牒前第三住分經文。",
        "translation": "At the time, Suppository said to the Buddha, 'It's not a bodhisattva when he arrives,' which again refers to the text of the third abode section of the previous sūtra.",
        "source": "T25n1512_007:0846b20_0"
    },
    {
        "source_sentence": "然此住義前已廣釋，所以重舉來者，就此文上有疑未盡，為欲取下「何以故須菩提實無有法名為菩薩」以釋上疑故，",
        "translation": "However, this meaning of abiding has already been explained in detail, so the reason it's repeatedly cited is that there are doubts on this text that haven't ended because they want to get rid of them.",
        "source": "T25n1512_007:0846b21_1"
    },
    {
        "source_sentence": "通舉來也。",
        "translation": "It's a general statement that refers to the coming.",
        "source": "T25n1512_007:0846b23_2"
    },
    {
        "source_sentence": "此言「何以故」者，以作難云：上第三段經中已明此三種修行，何以故此中復重明？",
        "translation": "This expression why is it so? means to make a difficulty by saying, The third paragraph above explains these three kinds of cultivation in the sūtras, and why is it again explained here?",
        "source": "T25n1512_007:0846b24_3"
    },
    {
        "source_sentence": "有何勝也？",
        "translation": "What's superior?",
        "source": "T25n1512_007:0846b25_4"
    },
    {
        "source_sentence": "故釋「實無有法名為菩薩發三菩提心者」，明於前三種修行上疑未遣，",
        "translation": "That's why it's explained that there really isn't a teaching called bodhisattva who gives rise to the mind of the three kinds of enlightenment, explaining that doubts about the first three kinds of cultivation haven't been removed,",
        "source": "T25n1512_007:0846b26_5"
    },
    {
        "source_sentence": "為以此實無有法名為菩薩釋疑，故重來也。",
        "translation": "It's because this truly nonexistent thing is called the bodhisattva's explanation of doubt, so it comes back.",
        "source": "T25n1512_007:0846b27_6"
    },
    {
        "source_sentence": "疑意：云何上第三段中，明菩薩證得初地無生二種無我見道之解，具足四種深心、永斷三界四住習氣無明麁品、離五怖畏，",
        "translation": "The meaning of doubt: In the third paragraph above, it's explained that the bodhisattva realizes the understanding of the path of the first ground of the two kinds of selflessness and views of selflessness in the first ground, which is replete with four kinds of profound mind, permanently eliminates the three realms, four abodes of habituated tendencies, ignorance, ang",
        "source": "T25n1512_007:0846b28_7"
    },
    {
        "source_sentence": "住於初地平等理中，不見彼是眾生、我為菩薩。",
        "translation": "Abiding in the principle of equality in the first ground, they don't see that they are sentient beings and I am a bodhisattva.",
        "source": "T25n1512_007:0846c02_8"
    },
    {
        "source_sentence": "於此理中柔伏其心；",
        "translation": "In this principle they temper their minds and give rise to equanimity.",
        "source": "T25n1512_007:0846c03_9"
    },
    {
        "source_sentence": "復得二地以上修道之解，以得此解故，存我能具足四種深心住於初地、我能不著三事修行、我能不見三事降伏其心、我能斷煩惱、我能化人，",
        "translation": "He also attains the understanding of cultivation above the second ground, and because he has attained this understanding, he preserves the self that can fulfill the four kinds of profound mind in the first ground, that I can cultivate it without attachment to three things, that I can subdue his mind with three things, that I can cut off afflictions, and that I can transform people.",
        "source": "T25n1512_007:0846c04_10"
    },
    {
        "source_sentence": "有此分別之心。",
        "translation": "There's this discriminating mind.",
        "source": "T25n1512_007:0846c07_11"
    },
    {
        "source_sentence": "以有此心故，有人疑云：若菩薩以證見道修無我之解，何故猶云我能證平等理，",
        "translation": "If a bodhisattva cultivates the understanding of selflessness in order to realize the path of insight, why does he still say, I can realize equanimity?",
        "source": "T25n1512_007:0846c08_0"
    },
    {
        "source_sentence": "不見眾生異於菩薩，乃至我能修行等？",
        "translation": "Do you not see that sentient beings are different from bodhisattvas, even to the point where I can cultivate them?",
        "source": "T25n1512_007:0846c09_1"
    },
    {
        "source_sentence": "既自得無我解，今言不見，誰云不見？",
        "translation": "Since they themselves have attained the understanding of selflessness, who says they don't see it now? Who says they don't see it?",
        "source": "T25n1512_007:0846c10_2"
    },
    {
        "source_sentence": "菩薩言我能不見。",
        "translation": "The bodhisattva said, I can't see it.",
        "source": "T25n1512_007:0846c11_3"
    },
    {
        "source_sentence": "即難：者是菩薩，何者是我？",
        "translation": "That's the difficulty: Is this the bodhisattva, or is it me?",
        "source": "T25n1512_007:0846c12_0"
    },
    {
        "source_sentence": "而菩薩言我能不見也。",
        "translation": "The bodhisattva said, I can't see it.",
        "source": "T25n1512_007:0846c12_1"
    },
    {
        "source_sentence": "若爾，疑者還謂：即眾生五陰是菩薩，更無別菩薩。",
        "translation": "If that's the case, the doubter also says, That is, the five aggregates of sentient beings are bodhisattvas, and there are no separate bodhisattvas.",
        "source": "T25n1512_007:0846c13_2"
    },
    {
        "source_sentence": "若眾生五陰非菩薩者，何故菩薩自言我能？",
        "translation": "If the five aggregates of sentient beings aren't bodhisattvas, why do bodhisattvas say they can themselves?",
        "source": "T25n1512_007:0846c14_3"
    },
    {
        "source_sentence": "以此驗之，故知即此眾生五陰是實菩薩也。",
        "translation": "Because of this testimony, it's known that these five aggregates of sentient beings are really bodhisattvas.",
        "source": "T25n1512_007:0846c15_4"
    },
    {
        "source_sentence": "為除此疑故，言實無有法名為菩薩發三菩提心者也。",
        "translation": "In order to remove this doubt, they say there really is no dharma called a bodhisattva who gives rise to the mind of the three kinds of enlightenment.",
        "source": "T25n1512_007:0846c16_5"
    },
    {
        "source_sentence": "今明實無有法名為菩薩者，假名名字眾生，體虛妄不實，五陰因緣滅法，",
        "translation": "Now, it's clear that there really aren't dharmas called bodhisattvas who nominally name sentient beings, whose essence is false and unreal, and the five aggregates are causes and conditions for cessation of dharmas.",
        "source": "T25n1512_007:0846c17_6"
    },
    {
        "source_sentence": "體本來空寂。",
        "translation": "The essence is originally empty and quiescent.",
        "source": "T25n1512_007:0846c19_7"
    },
    {
        "source_sentence": "於眾生五陰有為法中，無有一法是實可名為菩薩。",
        "translation": "In the five aggregates of sentient beings, there's not a single thing that really can be called a bodhisattva in terms of conditioned dharmas.",
        "source": "T25n1512_007:0846c19_8"
    },
    {
        "source_sentence": "若眾生五陰中無有一法是實名為菩薩者，云何而言我是菩薩？",
        "translation": "If there's no single thing in the five aggregates of sentient beings that is really called a bodhisattva, how can they say I am a bodhisattva?",
        "source": "T25n1512_007:0846c20_9"
    },
    {
        "source_sentence": "然今言我是菩薩、我能見修、我能修行等者，非謂菩薩發初地已猶存眾生五陰以之為我，",
        "translation": "However, if someone now says, 'I am the bodhisattva,' 'I can see, cultivate, and I can practice,' etc.,' it doesn't mean that a bodhisattva who gives rise to the first ground still retains the five aggregates of sentient beings as self after they give rise to it.",
        "source": "T25n1512_007:0846c22_10"
    },
    {
        "source_sentence": "有身見等麁惑未盡也。",
        "translation": "There are the debilitating afflictions of body views and so forth that haven't ended.",
        "source": "T25n1512_007:0846c24_11"
    },
    {
        "source_sentence": "所以尚言我能者，明見道修道二種菩薩，雖現見真性斷除四住不善煩惱等一品麁惑，",
        "translation": "The reason why it is still said that I am able is to explain the two kinds of bodhisattvas who see the path and cultivate enlightenment. Although they now see the true nature, they abandon four abodes of unwholesome defilements and one class of debilitating passions.",
        "source": "T25n1512_007:0846c24_12"
    },
    {
        "source_sentence": "猶有無明住地根本煩惱細惑，於善法中有微分別心未斷盡故，有此功用之惑，",
        "translation": "It is likewise with the subtle defilement of ignorance and the fundamental defilement of the sphere of abiding in samdhi. Because there are subtle discriminating thoughts among the good factors but they have not yet abandoned them, it is said to be a defilement of exerted effort.",
        "source": "T25n1512_007:0846c26_13"
    },
    {
        "source_sentence": "於七地以還非患，乃障八地以上無功用不住道解。",
        "translation": "In the seventh ground, it's because they aren't afflicted by returning, which hinders the understanding of the path above the eighth ground and beyond without effort.",
        "source": "T25n1512_007:0846c28_14"
    },
    {
        "source_sentence": "因斷此疑，即勵諸菩薩，遣存我分別之心故，言實無有法名為菩薩發三菩提心也。",
        "translation": "Because this doubt has been eliminated, the bodhisattvas are encouraged to abandon their discriminating minds of self and existence, saying that there really is no dharma called a bodhisattva's arousal of the three kinds of enlightenment.",
        "source": "T25n1512_007:0846c29_15"
    },
    {
        "source_sentence": "此乃隱覆之答，非是正答。",
        "translation": "This is a hidden answer, not a correct one.",
        "source": "T25n1512_007:0847a02_16"
    },
    {
        "source_sentence": "若欲正答，亦應更問：若起此分別非真實菩薩者，何者是真實菩薩？",
        "translation": "If you want to answer correctly, you should also ask, If this discrimination that arises isn't a true bodhisattva, then what is a true bodhisattva?",
        "source": "T25n1512_007:0847a03_17"
    },
    {
        "source_sentence": "應答：有實菩薩。",
        "translation": "Answer: There are real bodhisattvas.",
        "source": "T25n1512_007:0847a04_18"
    },
    {
        "source_sentence": "何者是？",
        "translation": "What is it?",
        "source": "T25n1512_007:0847a05_0"
    },
    {
        "source_sentence": "要得無生忍、會二種無我解者，是真實菩薩。",
        "translation": "To attain the forbearance of nonproduction and the understanding that unifies the two kinds of selflessness is a true bodhisattva.",
        "source": "T25n1512_007:0847a05_1"
    },
    {
        "source_sentence": "而不正答者，以引釋在下第四經中，但此義勢未盡，故合答也。",
        "translation": "Those who don't answer correctly because the explanation is cited in the following fourth sūtra, but this meaning hasn't yet exhausted its momentum, so it's a combined answer.",
        "source": "T25n1512_007:0847a06_2"
    },
    {
        "source_sentence": "此一段經，以一行偈釋。",
        "translation": "This section of the sūtra explains it in one line of verse.",
        "source": "T25n1512_007:0847a08_0"
    },
    {
        "source_sentence": "「於內心修行，存我為菩薩」者，初地以上七地以還菩薩，雖得無我之解於內心中，",
        "translation": "He cultivates it internally and keeps self as a bodhisattva because he returns to the bodhisattva in the first or seventh ground, even though he has attained understanding of selflessness within his own mind.",
        "source": "T25n1512_007:0847a08_1"
    },
    {
        "source_sentence": "修行之時自謂我是菩薩、我能不見三事。",
        "translation": "When he cultivates it, he says to himself, 'I am a bodhisattva, and I can't see three things.'",
        "source": "T25n1512_007:0847a10_2"
    },
    {
        "source_sentence": "此之分別等，即是根本無明，於善法中分別之惑也。",
        "translation": "These discriminations and so forth are fundamental ignorance, which is the mental disturbance of discriminating good qualities.",
        "source": "T25n1512_007:0847a11_3"
    },
    {
        "source_sentence": "應問：此見道修道三種修行勝解為實不實也？",
        "translation": "You should ask, Are these three kinds of cultivation of seeing, path, and cultivation of enlightenment as real or not?",
        "source": "T25n1512_007:0847a12_4"
    },
    {
        "source_sentence": "亦應答：是實。",
        "translation": "You should also answer, It's real.",
        "source": "T25n1512_007:0847a13_5"
    },
    {
        "source_sentence": "次難：若是實者，自言我能修行，此有何妨？",
        "translation": "The next difficulty: If this is real, then what's the obstruction for someone to claim that they can cultivate it themselves?",
        "source": "T25n1512_007:0847a13_6"
    },
    {
        "source_sentence": "即答「此即障於心」也，明如此分別云我能修行等，善法無明功用之惑，",
        "translation": "That's the answer, This is an obstruction to the mind, which explains that such distinctions as saying I can cultivate practice and so forth are afflictions of ignorance about the functioning of good qualities.",
        "source": "T25n1512_007:0847a14_7"
    },
    {
        "source_sentence": "障八地以上心。",
        "translation": "It hinders the mind above the eighth ground and beyond.",
        "source": "T25n1512_007:0847a16_8"
    },
    {
        "source_sentence": "應問：障八地以上何等心？",
        "translation": "You should ask, What's the mind that hinders the eighth ground and above?",
        "source": "T25n1512_007:0847a16_9"
    },
    {
        "source_sentence": "故下句云「違於不住道」，明七地以還善法分別功用之惑，障八地以上無功用心不住道解也。",
        "translation": "That's why the next sentence says, It's contrary to not abiding in the path, which explains the seventh ground's afflictions of discriminating effort with respect to returning to good qualities and hinders the understanding of the path that doesn't abide in the eighth ground or higher without effort.",
        "source": "T25n1512_007:0847a17_10"
    },
    {
        "source_sentence": "此言「不住」者，不住功用心、不住無功用心，故名不住道也。",
        "translation": "This expression doesn't abide means that it doesn't abide in the effort of effort and doesn't abide in the effort of effortlessness, so it's called not abiding in the path.",
        "source": "T25n1512_007:0847a19_11"
    },
    {
        "source_sentence": "「此義云何至降伏其心」，釋偈初句。",
        "translation": "What does this mean by going so far as to subdue their minds? he explains the first phrase of the verse.",
        "source": "T25n1512_007:0847a20_12"
    },
    {
        "source_sentence": "「菩薩生此分別」者，釋偈中第二句。",
        "translation": "The phrase bodhisattvas give rise to this distinction refers to the second phrase in the explanation of the verse.",
        "source": "T25n1512_007:0847a21_13"
    },
    {
        "source_sentence": "「障於菩提行」者，釋偈中第三句。",
        "translation": "The phrase hindrances to the practice of enlightenment refers to the third phrase in the explanation of the verse.",
        "source": "T25n1512_007:0847a22_14"
    },
    {
        "source_sentence": "下并以三句偈來經結也。",
        "translation": "The following is a summary of the three-line verse that comes from the sūtra.",
        "source": "T25n1512_007:0847a22_15"
    },
    {
        "source_sentence": "「障何等心」者，提第三句作問也。",
        "translation": "The third phrase, What's the mind that hinders? refers to the third phrase as a question.",
        "source": "T25n1512_007:0847a23_16"
    },
    {
        "source_sentence": "即答「偈言違於不住道」者，此以第四句為答也。",
        "translation": "This is the answer to the question, The verse says it's contrary to not abiding in the path, which uses the fourth phrase as the answer.",
        "source": "T25n1512_007:0847a24_17"
    },
    {
        "source_sentence": "「如經」以下，舉釋疑經來結也。",
        "translation": "Under Thus are the sutras, we'll explain the conclusion by citing the doubtful sūtras.",
        "source": "T25n1512_007:0847a25_18"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1512_007:0847a25_19"
    },
    {
        "source_sentence": "如來於燃燈佛所，有法得菩提不」，此斷疑分中第二經文，何故復來？",
        "translation": "Is there a way for the Tathāgata to attain enlightenment at the place of the Burning Lamp Buddha? This is the second text of the sutra in the section on ending doubt, so why would it come again?",
        "source": "T25n1512_007:0847a26_20"
    },
    {
        "source_sentence": "以前疑實無有法名菩薩。",
        "translation": "Earlier, he doubted that there really wasn't a dharma called a bodhisattva.",
        "source": "T25n1512_007:0847a27_21"
    },
    {
        "source_sentence": "疑者謂一向無菩薩者，何故如來云我昔在燃燈佛所行菩薩行得菩提記？",
        "translation": "Doubt means someone who has always been devoid of bodhisattvas, so why did the Tathāgata say that in the past I attained enlightenment while practicing bodhi at Burning Lamp Buddha's place?",
        "source": "T25n1512_007:0847a28_22"
    },
    {
        "source_sentence": "以此驗之，應有菩薩行，何故言無？",
        "translation": "If you examine it with this, there should be bodhisattva practices, so why do you say they don't?",
        "source": "T25n1512_007:0847a29_23"
    },
    {
        "source_sentence": "「佛語須菩提：我於燃燈佛所，有法得菩提不？",
        "translation": "The Buddha said to Subhūti, Is there a way for me to attain enlightenment at the Burning Lamp Buddha's place?",
        "source": "T25n1512_007:0847b01_24"
    },
    {
        "source_sentence": "須菩提解答佛言：佛於燃燈佛所，無有法得菩提記」，明菩薩猶在習種性中，",
        "translation": "Suppository answered the Buddha's question, saying, There's no way for a buddha to attain the assurance of enlightenment at Burning Lamp Buddha's place, explaining that the bodhisattva is still in the seed nature of accumulation.",
        "source": "T25n1512_007:0847b02_25"
    },
    {
        "source_sentence": "於燃燈佛所唯言語受記，未有所證，故言無法得菩提也。",
        "translation": "Because he had only verbally received assurance of enlightenment from the Burning Lamp Buddha but hadn't realized it, he therefore said there was no way to attain enlightenment.",
        "source": "T25n1512_007:0847b04_26"
    },
    {
        "source_sentence": "明未得初地真實無生忍三菩提也，而非無地前假名名字菩薩言語受菩提記也。",
        "translation": "It explains that the first ground hasn't yet attained the three bodhisattvas of true nonarising forbearance and the three bodhisattvas, but it's not the mark of enlightenment received in words by bodhisattvas who nominally name themselves before the ground.",
        "source": "T25n1512_007:0847b05_27"
    },
    {
        "source_sentence": "前疑問於應有菩提，何故今者答以不得菩提也？",
        "translation": "The previous question asked whether there should be enlightenment, but why is the present answer given because it doesn't attain enlightenment?",
        "source": "T25n1512_007:0847b07_28"
    },
    {
        "source_sentence": "此名真如所證法為菩提，明眾生修行證菩提者名為菩薩。",
        "translation": "This is called enlightenment the Dharma realized by true reality, which explains that those who cultivate and realize enlightenment in sentient beings are called bodhisattvas.",
        "source": "T25n1512_007:0847b08_29"
    },
    {
        "source_sentence": "爾時既未登菩提，明非是實也。",
        "translation": "Since they hadn't yet ascended to enlightenment at the time, it's clear that they aren't real.",
        "source": "T25n1512_007:0847b10_30"
    },
    {
        "source_sentence": "「佛言：如是。",
        "translation": "“The Buddha said, So it is.",
        "source": "T25n1512_007:0847b10_31"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1512_007:0847b11_0"
    },
    {
        "source_sentence": "實無有法如來於燃燈佛所得三菩提」者，此如來印可須菩提所說不虛，",
        "translation": "There really isn't a teaching that the Tathāgata obtains the three kinds of enlightenment from the Burning Lamp Buddha. This means that the Tathāgata's seal requires that what he teaches in terms of enlightenment not be false,",
        "source": "T25n1512_007:0847b11_1"
    },
    {
        "source_sentence": "拂去眾疑也。",
        "translation": "It's to remove the doubts of the multitude.",
        "source": "T25n1512_007:0847b12_2"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1512_007:0847b13_3"
    },
    {
        "source_sentence": "若有法如來得菩提者，燃燈佛則不與我授記：汝於來世當得作佛，號釋迦牟尼」者，",
        "translation": "If there's a Dharma Tathāgata who has attained enlightenment, the Burning Lamp Buddha won't give me an assurance that you will become a buddha in future lives named Śākyamuni.",
        "source": "T25n1512_007:0847b13_4"
    },
    {
        "source_sentence": "如來自云，若我在習種中，燃燈佛時已得初地無生三菩提記者，則後時無量諸佛乃至初地中，",
        "translation": "The Tathāgata said, If I am in the seed of accumulation, and have attained the three marks of enlightenment of nonarising in the first ground at the time of the Buddha Candraprabha Buddha, then there will be measureless buddhas until they reach the first ground.",
        "source": "T25n1512_007:0847b15_5"
    },
    {
        "source_sentence": "燃燈等則更不與我授無生忍記也。",
        "translation": "Burning a lamp and so forth, they won't give me the assurance of the tolerance of nonproduction.",
        "source": "T25n1512_007:0847b17_6"
    },
    {
        "source_sentence": "「以實未得無生忍三菩提記，是故後燃燈佛等復與我授記：摩那婆！",
        "translation": "Because they really haven't yet attained the assurance of the three kinds of enlightenment of the forbearance of nonarising, the later Burning Lamp Buddha and others will again give me this assurance: Manabha!",
        "source": "T25n1512_007:0847b18_7"
    },
    {
        "source_sentence": "汝於來世當得作佛，號釋迦」者，此明正以我於彼時實未得初地真無生忍三菩提記故，",
        "translation": "You will become a buddha in the future, and you'll be called Śākyamuni. This shows that it's precisely because I really hadn't yet attained the first ground of true nonarising forbearance and the three marks of enlightenment at that time.",
        "source": "T25n1512_007:0847b19_8"
    },
    {
        "source_sentence": "後明時燃燈佛更與我授記，汝當作佛也。",
        "translation": "Later, it's clear that when the Burning Lamp Buddha gives me another prediction, you will become a buddha.",
        "source": "T25n1512_007:0847b21_9"
    },
    {
        "source_sentence": "又第三燃燈佛所，爾時始證真無生忍記。",
        "translation": "At the third buddha, Burning Lamp Buddha, it was then that he first realized the true tolerance of nonarising.",
        "source": "T25n1512_007:0847b22_10"
    },
    {
        "source_sentence": "「何以故」者，此有疑難云：如上所說，應有菩提；",
        "translation": "The phrase why is it so? means that there are doubts and difficulties here: As has been said above, there should be enlightenment.",
        "source": "T25n1512_007:0847b24_0"
    },
    {
        "source_sentence": "今何故言實無有法如來得菩提？",
        "translation": "Why does it now say that there really is no Dharma Tathāgata who attains enlightenment?",
        "source": "T25n1512_007:0847b25_0"
    },
    {
        "source_sentence": "若實無有法如來得菩提者，則謗謂一向無菩提，亦無諸佛得菩提者。",
        "translation": "If there really is no Dharma Tathāgata who attains enlightenment, then he denigrates the claim that there's always been no enlightenment, and there are no buddhas who attain enlightenment.",
        "source": "T25n1512_007:0847b25_1"
    },
    {
        "source_sentence": "若爾，既無菩提可得，何故菩薩三大阿僧祇劫修苦行菩提也？",
        "translation": "If that's the case, then why did the bodhisattva cultivate ascetic enlightenment for three great incalculable eons when there's no enlightenment to be attained?",
        "source": "T25n1512_007:0847b27_2"
    },
    {
        "source_sentence": "答「言如來者即實真如」也。",
        "translation": "Answer, It's called the true reality of the Tathāgata.",
        "source": "T25n1512_007:0847b28_3"
    },
    {
        "source_sentence": "上所以云無有一法名得菩提者，明爾時但言語授記，未有證法是實而得名為菩提，",
        "translation": "The above reason it's said that there's no single thing called attaining enlightenment is to explain that at the time, they simply verbally instructed and predicted, but there weren't real dharmas that could be called enlightenment.",
        "source": "T25n1512_007:0847b29_4"
    },
    {
        "source_sentence": "非謂理中一向無菩提故。",
        "translation": "It doesn't mean that there's always no enlightenment in the principle.",
        "source": "T25n1512_007:0847c02_5"
    },
    {
        "source_sentence": "今言「即實真如」者，明實有無為法身菩提，古今一定、體不變不異、無生住滅相故，",
        "translation": "The present expression true reality means that there really is enlightenment of the unconditioned Dharma body, which is certain from ancient times to the present and whose essence remains unchanging and dissimilar, because it has the characteristic of nonarising, abiding, and cessation.",
        "source": "T25n1512_007:0847c02_6"
    },
    {
        "source_sentence": "名即實真如。",
        "translation": "The name is the true nature of reality.",
        "source": "T25n1512_007:0847c04_7"
    },
    {
        "source_sentence": "指此真如無為法身是菩提體，以有實菩提故。",
        "translation": "It means that this true and unconditioned Dharma body is the essence of enlightenment because there's real enlightenment.",
        "source": "T25n1512_007:0847c05_8"
    },
    {
        "source_sentence": "明知亦有菩薩，復有修行得佛，何得謗言一向無菩提亦無菩薩修行證果成佛者也？",
        "translation": "It's clear that there are also bodhisattvas who cultivate the attainment of buddhahood, so how can you denigrate them by saying that there's always no enlightenment and no bodhisattva who cultivates it to realize its fruit and becomes a buddha?",
        "source": "T25n1512_007:0847c06_9"
    },
    {
        "source_sentence": "然今雖答有菩提之體，猶未是正答，下大身喻中別當正答也。",
        "translation": "Although the answer now is that there's the essence of enlightenment, it's still not a correct answer, and the following great body metaphor will be a specific correct answer.",
        "source": "T25n1512_007:0847c08_10"
    },
    {
        "source_sentence": "乘此答「言如來者即實真如」，復更生疑：若言真如菩提是實有者，此有猶同世間色等有為萬相之有。",
        "translation": "The vehicle answers this question, saying that the Tathāgata is the true true nature of reality, and furthermore creates doubt: If someone says that true enlightenment is truly existent, then this existence is like worldly forms and other conditioned things with myriad characteristics.",
        "source": "T25n1512_007:0847c09_11"
    },
    {
        "source_sentence": "生此疑心故，答言「若有人言如來得三菩提者，是人不實語」。",
        "translation": "Because of this doubt, he answered, If someone says the Tathāgata has attained the three kinds of enlightenment, that person doesn't really say it.",
        "source": "T25n1512_007:0847c11_12"
    },
    {
        "source_sentence": "此明法身菩提體絕萬相、妙有故有，非是有為虛妄之有，那得聞有便取同色等萬相虛妄之有？",
        "translation": "This shows that the essence of the Dharma body and enlightenment is cut off from the myriad characteristics and marvelous existences, so it's not a false existence that's conditioned, so how can you hear that there are such myriad characteristics as form and so forth and then grasp them as false existences?",
        "source": "T25n1512_007:0847c13_13"
    },
    {
        "source_sentence": "既是妙有，謂同虛妄有者即是妄說，故言不實語也。",
        "translation": "Since it's marvelous existence, that which is the same as false existence means to speak falsely, so it's called insubstantial speech.",
        "source": "T25n1512_007:0847c15_14"
    },
    {
        "source_sentence": "下經即成何取此菩提同有為者是其不實語，以實無有法佛得三菩提故也。",
        "translation": "The following sūtra says, What's the reason why this enlightenment is taken to be the same as conditioned? This is an unreal statement because there really are no Dharma buddhas who attain the three kinds of enlightenment?",
        "source": "T25n1512_007:0847c16_15"
    },
    {
        "source_sentence": "此中應引上菩薩證成此義。",
        "translation": "Here, we should cite the above bodhisattva who realizes this meaning.",
        "source": "T25n1512_007:0847c18_16"
    },
    {
        "source_sentence": "上實無有法名為菩薩者，明眾生五陰非實菩薩，而言此眾生五陰法中實不有一法名菩薩者，",
        "translation": "The above is called bodhisattva because there really isn't a single thing called bodhisattva, which explains that the five aggregates of sentient beings aren't real bodhisattvas in the five aggregates of sentient beings.",
        "source": "T25n1512_007:0847c19_0"
    },
    {
        "source_sentence": "是不實語。",
        "translation": "It's not true speech.",
        "source": "T25n1512_007:0847c21_1"
    },
    {
        "source_sentence": "今言實無有法如來得三菩提，明菩提之體無色等萬相可得，而言有得菩提者亦是虛妄。",
        "translation": "Now, it's said that there really are no dharmas where the Tathāgata attains the three kinds of enlightenment, explaining that the essence of enlightenment has formless form and other myriad characteristics to attain, and it's also false to say there's someone who has attained enlightenment.",
        "source": "T25n1512_007:0847c21_2"
    },
    {
        "source_sentence": "此明如菩薩，佛亦如是；",
        "translation": "This shows that enlightening beings are like bodhisattvas, and so are buddhas.",
        "source": "T25n1512_007:0847c23_3"
    },
    {
        "source_sentence": "以菩薩不實故，菩提亦不實也。",
        "translation": "Because the bodhisattva isn't real, enlightenment isn't real either.",
        "source": "T25n1512_007:0847c24_0"
    },
    {
        "source_sentence": "或者聞言有菩提，便謂菩提同有為色等萬相可得，故答以不得菩薩。",
        "translation": "Or, someone who hears that there's enlightenment and then says that enlightenment is the same as the myriad characteristics of conditioned form and so forth that can be attained, so they answer that they don't attain bodhi.",
        "source": "T25n1512_007:0847c24_1"
    },
    {
        "source_sentence": "此明不得者，菩提之體無有為萬相一法可得，故言不得菩提，非謂理中無得，",
        "translation": "This means that the essence of enlightenment has no unconditioned, myriad characteristics or single thing to attain. Therefore, it is called not attaining enlightenment because it does not mean that there is no acquisition in principle.",
        "source": "T25n1512_007:0847c26_2"
    },
    {
        "source_sentence": "那得以菩提無有為萬相可得，難理中亦使不得也？",
        "translation": "How could it be possible to attain enlightenment without the myriad characteristics of unconditioned things that can be attained, and why wouldn't it be attained if there were difficult principles?",
        "source": "T25n1512_007:0847c28_3"
    },
    {
        "source_sentence": "乘實無有法佛得三菩提，覆生疑謗：若言實無有法佛得三菩提者，便一向無有得菩提人。",
        "translation": "If someone says that there really are no Dharma buddhas who attain the three kinds of enlightenment, then there's absolutely no person who attains enlightenment.",
        "source": "T25n1512_007:0847c29_4"
    },
    {
        "source_sentence": "既無得菩提者，故知亦無菩提可得也。",
        "translation": "Since there's no one who attains enlightenment, it's known that there's also no enlightenment to attain.",
        "source": "T25n1512_007:0848a02_5"
    },
    {
        "source_sentence": "故答言「須菩提！",
        "translation": "That's why he answered, Subhūti!",
        "source": "T25n1512_007:0848a03_6"
    },
    {
        "source_sentence": "如來所得阿耨三菩提」，此佛引己所得菩提證成有得之義也。",
        "translation": "The Tathāgata's attainment of the unsurpassed three kinds of enlightenment means that this Buddha cites his own attainment of enlightenment to realize the meaning of having attained it.",
        "source": "T25n1512_007:0848a03_7"
    },
    {
        "source_sentence": "言「如來所得」者，明我親自修行逕三大阿僧祇，十地行滿證得菩提，",
        "translation": "The expression attained by the Tathāgata means that I myself cultivated three great incalculable eons of practice, fulfilled the ten stages of practice, and realized enlightenment.",
        "source": "T25n1512_007:0848a04_8"
    },
    {
        "source_sentence": "何得謗言一向無有得菩提者也？",
        "translation": "How can you deny that there's always no one who attains enlightenment?",
        "source": "T25n1512_007:0848a06_9"
    },
    {
        "source_sentence": "於是中不實者，結成上實無有法佛得菩提，明菩提之體無色等萬相，而取同有為萬相可得者，",
        "translation": "Those who conclude that there's really no Dharma Buddha attain enlightenment, explaining that the essence of enlightenment has formless myriad characteristics like form and so forth, but they take the same myriad characteristics as existent things that can be attained.",
        "source": "T25n1512_007:0848a07_10"
    },
    {
        "source_sentence": "此是不實也。",
        "translation": "This is not real.",
        "source": "T25n1512_007:0848a09_11"
    },
    {
        "source_sentence": "「不妄語」者，結成前如來所得阿耨三菩提明菩提之體，雖無色等萬相可得，",
        "translation": "The phrase not lying summarizes the previous statement that the Tathāgata's attainment of the unsurpassed three kinds of enlightenment clarifies the essence of enlightenment, even though formlessness and other myriad characteristics can be obtained,",
        "source": "T25n1512_007:0848a09_12"
    },
    {
        "source_sentence": "非不實有真如菩提萬德具足為如來所證，故云不妄語也。",
        "translation": "It's not that there really isn't true enlightenment and the myriad virtues of enlightenment are fully possessed by the Tathāgata, so it's called not speaking falsely.",
        "source": "T25n1512_007:0848a11_13"
    },
    {
        "source_sentence": "此雙結上有得、無得二種經文也。",
        "translation": "These are the two kinds of sūtras that have both fetters on attaining and non-attaining.",
        "source": "T25n1512_007:0848a12_14"
    },
    {
        "source_sentence": "「是故如來說一切法皆是佛法」者，偏成上是故所得阿耨菩提理中不有妄得語義故，",
        "translation": "That's why the Tathāgata teaches that all things are buddha-dharmas partially because there's no falsely attained meaning of words in the principle of unsurpassed enlightenment.",
        "source": "T25n1512_007:0848a13_15"
    },
    {
        "source_sentence": "如來所說一切果頭萬德之法，皆是諸佛法身妙有之法。",
        "translation": "All the myriad virtuous qualities of the fruit that the Tathāgata teaches are all marvelously existent dharmas of the Dharma body of the buddhas.",
        "source": "T25n1512_007:0848a15_16"
    },
    {
        "source_sentence": "亦應言：是故如來說一切法非佛法，明色等有為萬相一切法，皆非果頭萬德一切法。",
        "translation": "You should also say: Therefore, the Tathāgata teaches that all dharmas are not buddha-dharmas, explaining that form and other conditioned myriad characteristics of all dharmas are not the fruit of the myriad virtues of all dharmas.",
        "source": "T25n1512_007:0848a16_17"
    },
    {
        "source_sentence": "以不作此說故，大眾乘如來說一切法皆是佛法，復更生疑：若言一切法皆是佛法者，",
        "translation": "Because they don’t make such a statement, the masses of Buddhist followers say that all things are buddha-dharmas. Again, they have further doubt:",
        "source": "T25n1512_007:0848a18_18"
    },
    {
        "source_sentence": "而一切名濫，有有為一切、有無為一切，此二種一切可皆是佛法耶？",
        "translation": "And all names are confused, with all that is conditioned and all that is unconditioned, so can these two kinds of all things be buddha-dharmas?",
        "source": "T25n1512_007:0848a20_19"
    },
    {
        "source_sentence": "若皆是佛法者，那得上言法身菩提無萬相可得，真如無為法中實有菩提也，",
        "translation": "If they were all buddha-teachings, how could the enlightenment of the Dharma body as described above be attained without myriad characteristics? It is true that there really is enlightenment in unconditioned dharmas.",
        "source": "T25n1512_007:0848a22_20"
    },
    {
        "source_sentence": "故經答言「所言一切法一切法者，即非一切法」也。",
        "translation": "That's why the sūtra answers, What's called all dharmas and all dharmas is not all dharmas.",
        "source": "T25n1512_007:0848a24_21"
    },
    {
        "source_sentence": "上「一切法」者，名有為一切法；",
        "translation": "The above all dharmas refers to conditioned all dharmas.",
        "source": "T25n1512_007:0848a25_22"
    },
    {
        "source_sentence": "下「一切法」者，是無為一切。",
        "translation": "The next phrase all dharmas refers to the nonexistence of all things.",
        "source": "T25n1512_007:0848a25_23"
    },
    {
        "source_sentence": "「即非一切法」者，明上有為一切非無為一切，亦得言無為一切即非有為一切法。",
        "translation": "That is, it's not all dharmas that clarify that the above-mentioned are all things that are neither conditioned nor unconditioned, and it can also be said that all things that are unconditioned are not all dharmas that are not conditioned.",
        "source": "T25n1512_007:0848a26_24"
    },
    {
        "source_sentence": "「是故名一切法」者，此句雙結二種一切法，是故名有為一切法、是故名無為一切法也。",
        "translation": "The phrase therefore called all dharmas refers to the two kinds of all dharmas that are combined in these sentences, which are therefore called all conditioned dharmas and therefore called all unconditioned dharmas.",
        "source": "T25n1512_007:0848a28_25"
    },
    {
        "source_sentence": "雖復一切名同，有為一切法體是虛妄，故非菩提；",
        "translation": "Even though all names are the same, the substance of conditioned dharmas is unreal and therefore not enlightenment.",
        "source": "T25n1512_007:0848b01_26"
    },
    {
        "source_sentence": "無為一切法體是真實，故是菩提。",
        "translation": "Because the essence of all unconditioned dharmas is real, it's enlightenment.",
        "source": "T25n1512_007:0848b02_27"
    },
    {
        "source_sentence": "勿得以一切名同，便謂有為一切亦是果頭一切萬德佛法也。",
        "translation": "They can't get all to be called the same, so they say that all conditioned things are also the fruit of all the myriad virtues of the Buddha's teachings.",
        "source": "T25n1512_007:0848b03_28"
    },
    {
        "source_sentence": "「論曰：此中有疑」以下，論主先生起疑意，舉經來結，作兩偈釋此一段經。",
        "translation": "Under The treatise says, 'There's doubt here,' the treatise leader gives rise to doubtful thoughts, cites the sūtras as a conclusion, and explains this section of the sūtra in two verses.",
        "source": "T25n1512_007:0848b05_0"
    },
    {
        "source_sentence": "初偈釋經中「須菩提！",
        "translation": "The first verse explains that the sūtra says, Subhūti!",
        "source": "T25n1512_007:0848b06_1"
    },
    {
        "source_sentence": "於意云何至不實不妄語」也。",
        "translation": "What's the point of saying that it's not real and not false speech?",
        "source": "T25n1512_007:0848b07_2"
    },
    {
        "source_sentence": "「以後時授記」者，此還釋前斷疑經。",
        "translation": "This is an explanation of the previous sūtra on ending doubt.",
        "source": "T25n1512_007:0848b07_3"
    },
    {
        "source_sentence": "作疑不異於上。",
        "translation": "The doubt that's raised isn't different from the above.",
        "source": "T25n1512_007:0848b08_4"
    },
    {
        "source_sentence": "若作正答，應云實無有法得菩提者，明我於燃燈佛時未有所證故，云無法得菩提。",
        "translation": "If he answers correctly, he should say that there really is no way to attain enlightenment because it's clear that I hadn't realized anything when I was the Burning Lamp Buddha, so he says there's no way to attain enlightenment.",
        "source": "T25n1512_007:0848b08_5"
    },
    {
        "source_sentence": "既無所證菩提，成上亦無實證菩薩。",
        "translation": "Since there's no enlightenment that's realized, there's no bodhisattva who accomplishes the above and no bodhisattva who really realizes it.",
        "source": "T25n1512_007:0848b10_6"
    },
    {
        "source_sentence": "言有菩薩者，要現得無生法忍出世間解，名真菩薩。",
        "translation": "A bodhisattva who says there's a bodhisattva who needs to attain the supramundane understanding of the nonarising of dharmas in order to manifestly attain the forbearance of the nonarising of dharmas is called a true bodhisattva.",
        "source": "T25n1512_007:0848b11_7"
    },
    {
        "source_sentence": "今偈但答言「以後時授記」，義中已知實有菩薩。",
        "translation": "The present verse simply answers by saying, At a later time, I'll give you an assurance, which means to know that there really are bodhisattvas.",
        "source": "T25n1512_007:0848b12_8"
    },
    {
        "source_sentence": "若無菩薩者，何得言後時授記？",
        "translation": "If there were no bodhisattvas, how could they say that they'll be given assurance at a later time?",
        "source": "T25n1512_007:0848b13_9"
    },
    {
        "source_sentence": "所以此中不正答者，以斯義勢未盡故拘瑣在下，以下經文中有正釋故。",
        "translation": "The reason this isn't correctly answered here is that because the momentum of this meaning hasn't ended, the fetters are present below, and there's a correct explanation in the following sūtra text.",
        "source": "T25n1512_007:0848b14_10"
    },
    {
        "source_sentence": "此因後時授記，以明於有也。",
        "translation": "This cause is given a prediction at a later time to explain that it exists.",
        "source": "T25n1512_007:0848b16_11"
    },
    {
        "source_sentence": "「燃燈行非上」者，我於前燃燈佛時，在習種性中，未得初地無生法忍第一上行故，",
        "translation": "The phrase the practice of burning a lamp is not superior means that at the time of the previous Buddha Burning a Lamp, I was in the cultivating seed nature because I hadn't yet attained the first higher practice of the first stage of the forbearance of the nonarising of the Dharma in the first place.",
        "source": "T25n1512_007:0848b16_12"
    },
    {
        "source_sentence": "云燃燈行非上也。",
        "translation": "It's called the practice of burning a lamp that's not superior.",
        "source": "T25n1512_007:0848b18_13"
    },
    {
        "source_sentence": "故上句云「以後時授記」，後性地中第二燃燈佛懸授初地、八地無生忍記。",
        "translation": "That's why the first sentence says, Teaching assurance at a later time, and the second lamp-lighting buddha in the latter stage of the subsequently enlightened state gives assurance of the tolerance of nonarising in the first and eighth stages.",
        "source": "T25n1512_007:0848b19_14"
    },
    {
        "source_sentence": "後三十心滿，復有第三燃燈佛與我授無生忍後時記。",
        "translation": "The next 30 mental moments are complete, and there's another third time when the Burning Lamp Buddha gives me the forbearance of nonarising at the end of his life.",
        "source": "T25n1512_007:0848b20_15"
    },
    {
        "source_sentence": "此謂道種之未初地之前，此燃燈佛與我授記，以驗知前燃燈佛邊未證無生三菩提現道記也。",
        "translation": "This means that before the first ground of the path is planted, this Burning Lamp Buddha gave me a prediction to confirm that the previous Burning Buddha hadn't realized the three kinds of nonarising enlightenment at the end of his life.",
        "source": "T25n1512_007:0848b21_16"
    },
    {
        "source_sentence": "此上二句，釋「摩那婆！",
        "translation": "These two phrases above explain, Manabha!",
        "source": "T25n1512_007:0848b24_17"
    },
    {
        "source_sentence": "汝於來世作佛，號釋迦牟尼」以前經也。",
        "translation": "In a future life, you will become a buddha named Śākyamuni.” This is the preceding sūtra.",
        "source": "T25n1512_007:0848b24_18"
    },
    {
        "source_sentence": "「菩提彼行等」者，經中先言眾生五陰非菩薩，後云色等有為非菩提。",
        "translation": "The phrase bodhi and those practices means that the sūtras first say that the five aggregates of sentient beings are not bodhisattvas, and then they say form and so forth are not bodhi.",
        "source": "T25n1512_007:0848b25_19"
    },
    {
        "source_sentence": "依此作偈，應言「彼行等菩提」，而言「菩提彼行」者，明證菩提者是實菩薩。",
        "translation": "Relying on this verse, he should say, Such enlightenment as these practices, and he says, Enlighten those practices, which explains that someone who realizes enlightenment is really a bodhisattva.",
        "source": "T25n1512_007:0848b26_20"
    },
    {
        "source_sentence": "既未證菩提，故知亦無明證菩薩。",
        "translation": "Since they haven't realized enlightenment, they know that they are also ignorantly realizing bodhisattvas.",
        "source": "T25n1512_007:0848b28_21"
    },
    {
        "source_sentence": "不實義同，反覆相成故也。",
        "translation": "The meaning of insubstantial is the same, because it's formed by overturning characteristics.",
        "source": "T25n1512_007:0848b29_22"
    },
    {
        "source_sentence": "又復一釋：應言「彼行隨等菩提」，但依闡陀論作偈法，用逐語便上下意也。",
        "translation": "Again, there's another explanation: You should say, They practice following equal enlightenment, but they rely on the icchantika-śāstra to create a verse that follows the words and refers to the upper and lower meanings.",
        "source": "T25n1512_007:0848c01_23"
    },
    {
        "source_sentence": "此明如菩薩佛亦如是，故下句云「非實有為相」。",
        "translation": "This explains that bodhisattvas and buddhas are likewise, so the next sentence says, They aren't really conditioned characteristics.",
        "source": "T25n1512_007:0848c02_24"
    },
    {
        "source_sentence": "此明以眾生五陰有為萬相而得菩薩菩提者，此是虛妄，故云非實。",
        "translation": "This explains that someone who attains bodhisattva enlightenment with the five aggregates of sentient beings and the myriad artificial characteristics of sentient beings is false, so it's called not real.",
        "source": "T25n1512_007:0848c03_25"
    },
    {
        "source_sentence": "何故非實？",
        "translation": "Why are they not real?",
        "source": "T25n1512_007:0848c05_26"
    },
    {
        "source_sentence": "以取有為為實相故也。",
        "translation": "It's because they take conditioned things as real characteristics.",
        "source": "T25n1512_007:0848c05_27"
    },
    {
        "source_sentence": "此後二句，釋「何以故」已下經也。",
        "translation": "The last two sentences here explain the sūtra below Why is it so?",
        "source": "T25n1512_007:0848c06_28"
    },
    {
        "source_sentence": "此解直明菩薩菩提不可以有為相得，未明無為法中有實菩薩行，及菩提可得義中應作第二道義言「菩提彼行等，",
        "translation": "This explanation directly explains that bodhisattva enlightenment can't be attained with conditioned characteristics, but it doesn't explain that there are real bodhisattva practices in the unconditioned dharmas and that the meaning of enlightenment can be attained should be expressed in terms of the second path, saying, Such practices as enlightenment...",
        "source": "T25n1512_007:0848c06_29"
    },
    {
        "source_sentence": "是實無為相」，以正偈俠故，更作第二偈。",
        "translation": "It's really the mark of nonexistence. Because it's a correct verse, the hero composes the second verse.",
        "source": "T25n1512_007:0848c09_30"
    },
    {
        "source_sentence": "雖作第二偈，以經中未明有實菩薩故，但明有實菩提也。",
        "translation": "Although the second verse is composed because the sūtras don't explain that there are real bodhisattvas, they only explain that there are real enlightenment.",
        "source": "T25n1512_007:0848c10_31"
    },
    {
        "source_sentence": "「此義云何至無有一法得菩提」，此釋偈中第二句也。",
        "translation": "What does this mean? Up to the point where there's no single thing that attains enlightenment, this is the second phrase of the explanation in the verse.",
        "source": "T25n1512_007:0848c11_32"
    },
    {
        "source_sentence": "「若我於彼佛所已證菩提，則後時諸佛不授我記」者，此釋偈中上句也。",
        "translation": "If I had realized enlightenment at that Buddha's place, then later buddhas wouldn't give me assurance of it. This is the first phrase of the explanation in the verse.",
        "source": "T25n1512_007:0848c12_33"
    },
    {
        "source_sentence": "「是故我於彼時行未成佛故」者，還以上句結下第二句也。",
        "translation": "The phrase therefore, 'because I did not become a buddha at that time' refers to the second sentence below the above-mentioned sentence.",
        "source": "T25n1512_007:0848c14_34"
    },
    {
        "source_sentence": "此中應解上句，何故先釋第二句者？",
        "translation": "Here, you should understand the first sentence, so why do you first explain the second sentence?",
        "source": "T25n1512_007:0848c15_35"
    },
    {
        "source_sentence": "但下句所釋經文在於前故，此長行論依經次第先解第二句也。",
        "translation": "However, the text of the sūtras explained in the following sentence is located beforehand, so this long line of the treatise explains the second sentence first according to the order of the sūtras.",
        "source": "T25n1512_007:0848c16_36"
    },
    {
        "source_sentence": "「偈言」以下，釋竟雙引上半偈結也。",
        "translation": "Below the words of the verse, he explains that the first half of the verse concludes with a double quote.",
        "source": "T25n1512_007:0848c17_37"
    },
    {
        "source_sentence": "「若無菩提，即無諸佛如來」等者，先作生疑謗意也。",
        "translation": "If there's no enlightenment, then there are no buddha-tathāgatas, and so forth, the first thing they do is to create doubt and denigrate.",
        "source": "T25n1512_007:0848c18_38"
    },
    {
        "source_sentence": "「如經」等者，舉釋疑經結，然後以論釋經也。",
        "translation": "The phrase thus sūtras and so forth refers to the conclusion of the doubting sūtra, which is followed by an explanation of the sūtras in terms of their discussion.",
        "source": "T25n1512_007:0848c19_39"
    },
    {
        "source_sentence": "「若有人言」以下，先舉經作問，以偈中第三句來答也。",
        "translation": "If someone says, first, the sūtra asks a question by citing the third phrase in the verse to answer it.",
        "source": "T25n1512_007:0848c20_40"
    },
    {
        "source_sentence": "「此義云何」者，以此偈言「菩提彼行等」者此義意云何也。",
        "translation": "What does this mean? This verse says, Enlightenment and the practices of others, etc.",
        "source": "T25n1512_007:0848c21_41"
    },
    {
        "source_sentence": "「彼菩薩行等」者，提彼前經中菩薩發菩提心行，釋偈中「彼行」也。",
        "translation": "The phrase those bodhisattva practices and so forth refers to the bodhisattva's practice of arousing the mind of enlightenment in the previous sūtra, which explains that practice in the verse.",
        "source": "T25n1512_007:0848c23_42"
    },
    {
        "source_sentence": "「如是如來至此亦虛妄」者，提此經中「若人言如來得菩提不實語」釋偈中「菩提」也。",
        "translation": "The phrase thus, the Tathāgata arrives here and is also false refers to the meaning of enlightenment in the verse that says, If someone says the Tathāgata attains enlightenment but doesn't really say so, it means enlightenment.",
        "source": "T25n1512_007:0848c24_43"
    },
    {
        "source_sentence": "「故言菩提彼行等」者，結句也。",
        "translation": "That's why it's called enlightenment, those practices, and so forth, which is a concluding phrase.",
        "source": "T25n1512_007:0848c26_44"
    },
    {
        "source_sentence": "若有人取眾生五陰色等有為法以為菩薩菩提者，此是不實，故言等也。",
        "translation": "If someone takes the five aggregates of form and other conditioned dharmas of sentient beings as bodhisattva enlightenment, this is not true, so they're called equal.",
        "source": "T25n1512_007:0848c27_45"
    },
    {
        "source_sentence": "「若如是有人謗言：如來不得菩提」者，此出疑謗之意也。",
        "translation": "If someone thus denigrates the Tathāgata and says, 'The Tathāgata won't attain enlightenment,' this is to doubt and denigrate.",
        "source": "T25n1512_007:0848c28_46"
    },
    {
        "source_sentence": "為斷此疑，「如經」以下即釋，引疑經結也。",
        "translation": "In order to stop this doubt, the following is an explanation under thusness of the sūtra that concludes by citing the doubts in the sūtras.",
        "source": "T25n1512_007:0848c29_47"
    },
    {
        "source_sentence": "「此義云何」者，設問。",
        "translation": "The phrase what does this mean? asks a question.",
        "source": "T25n1512_007:0849a01_48"
    },
    {
        "source_sentence": "前言實無有法如來得菩提，此中復言如來所得阿耨三菩提，此言相反，",
        "translation": "The aforementioned statement is really that there is no dharma by which the Tathāgata attains enlightenment. Here again it is said that the Tathāgata attains the highest of the three kinds of enlightenment.",
        "source": "T25n1512_007:0849a02_49"
    },
    {
        "source_sentence": "其義云何也？",
        "translation": "What does this mean?",
        "source": "T25n1512_007:0849a03_50"
    },
    {
        "source_sentence": "即釋云「以如來得彼菩提故」，此句釋後經如來所得三菩提，明理而言之，",
        "translation": "This is an explanation that explains the three kinds of enlightenment attained by the Tathāgata in subsequent sūtras and explains them in terms of principle.",
        "source": "T25n1512_007:0849a04_51"
    },
    {
        "source_sentence": "如來實修行證得菩提也。",
        "translation": "The Tathāgata really cultivates and realizes enlightenment.",
        "source": "T25n1512_007:0849a05_52"
    },
    {
        "source_sentence": "若如來實得菩提，何故前言不得也？",
        "translation": "If the Tathāgata really attains enlightenment, why did he not attain it as previously mentioned?",
        "source": "T25n1512_007:0849a06_53"
    },
    {
        "source_sentence": "故即舉偈釋言「非實有為相故」。",
        "translation": "That's why he cites a verse that explains, It's because it doesn't really have artificial characteristics.",
        "source": "T25n1512_007:0849a07_54"
    },
    {
        "source_sentence": "此句解前如來不得三菩提經也。",
        "translation": "This phrase explains that the previous Tathāgata didn't obtain the three bodhisattva scriptures.",
        "source": "T25n1512_007:0849a07_55"
    },
    {
        "source_sentence": "「有為相者，謂五陰相」者，片出偈中有為相名也。",
        "translation": "The phrase conditioned characteristics refers to the characteristics of the five aggregates means that the name conditioned characteristics in the verse is derived from the words.",
        "source": "T25n1512_007:0849a08_56"
    },
    {
        "source_sentence": "「彼菩提法無色等相故」者，明菩提體無色等五陰相可得，故云非實有為相也。",
        "translation": "The phrase because those bodhidharmas lack form and other characteristics explains that the essence of enlightenment has formless form and other five aggregate characteristics that can be obtained, so it's called not really having conditioned characteristics.",
        "source": "T25n1512_007:0849a09_57"
    },
    {
        "source_sentence": "「此復云何」者，前偈下二句且解經中菩提無色等萬相故不可得，若取菩提同色等相者，",
        "translation": "The next two sentences below the preceding verse explain that the sūtra explains that enlightenment is unobtainable because it has no form and so forth in all its myriad characteristics, and if someone were to take those characteristics like form and so forth of enlightenment,",
        "source": "T25n1512_007:0849a11_58"
    },
    {
        "source_sentence": "此則非實；",
        "translation": "This is not true.",
        "source": "T25n1512_007:0849a13_59"
    },
    {
        "source_sentence": "然猶未解實有真如菩提，亦未解有證菩提者。",
        "translation": "Still, they still don't understand that there really is true enlightenment and don't understand that there's realization of enlightenment.",
        "source": "T25n1512_007:0849a13_60"
    },
    {
        "source_sentence": "經文今將欲作第二偈以釋此義故，先設問生起云：若言菩提無色等相者，",
        "translation": "The text of the sūtra now wants to make a second verse to explain this meaning by first asking questions that arise, saying, If someone says enlightenment has formless characteristics such as form and so forth,",
        "source": "T25n1512_007:0849a14_61"
    },
    {
        "source_sentence": "經云「言如來者即實真如」，又云「如來所得阿耨三菩提」，此義復云何也？",
        "translation": "The sūtra says, When it says the Tathāgata is truly true, and it also says, The Tathāgata attains the unsurpassed three kinds of enlightenment, what does this mean?",
        "source": "T25n1512_007:0849a16_62"
    },
    {
        "source_sentence": "故即以偈答「彼即非相相」。",
        "translation": "That's why it's a verse that answers, They are not marks and marks.",
        "source": "T25n1512_007:0849a18_63"
    },
    {
        "source_sentence": "此第二偈釋經中「是故如來說一切法佛法」記經。",
        "translation": "This is the second verse in the explanation of the sūtra that says, Therefore, the Tathāgata teaches all the teachings and buddha-teachings.",
        "source": "T25n1512_007:0849a18_64"
    },
    {
        "source_sentence": "「彼即非相相」。",
        "translation": "They are what's not marks and marks.",
        "source": "T25n1512_007:0849a19_65"
    },
    {
        "source_sentence": "「彼」者，彼於法身菩提，非色等有為萬法相也。",
        "translation": "The expression that refers to the enlightenment of the Dharma body, which isn't the characteristic of form and other conditioned things.",
        "source": "T25n1512_007:0849a20_66"
    },
    {
        "source_sentence": "如是無有相者是無為法身決定萬德相也。",
        "translation": "Thus, this marklessness is the mark of the unconditioned Dharma body that determines the characteristics of myriad virtues.",
        "source": "T25n1512_007:0849a21_67"
    },
    {
        "source_sentence": "「以不虛說故」者，明上法身菩提雖無有為萬相，而非不有真如無為萬德之相故，",
        "translation": "The phrase because it's not falsely explained explains that although the above-mentioned enlightenment of the Dharma body has no myriad characteristics of conditioned things, it doesn't have the characteristics of true unconditioned things and myriad virtues.",
        "source": "T25n1512_007:0849a22_68"
    },
    {
        "source_sentence": "經云「如來所得阿耨三菩提」者非為妄說故，言以不虛說故也。",
        "translation": "The sūtra says, The Tathāgata attains the unsurpassed three kinds of enlightenment because he doesn't speak falsely, saying that it's because he doesn't speak falsely.",
        "source": "T25n1512_007:0849a24_69"
    },
    {
        "source_sentence": "又問：何故不虛說也？",
        "translation": "Again, why is it not spoken of falsely?",
        "source": "T25n1512_007:0849a25_70"
    },
    {
        "source_sentence": "故下第三句云「是法諸佛法」。",
        "translation": "That's why the third sentence below says, These are the teachings and the buddha-teachings of the Dharma.",
        "source": "T25n1512_007:0849a25_71"
    },
    {
        "source_sentence": "「是法」者，是無為一切法也。",
        "translation": "This is the teaching, which refers to all unconditioned dharmas.",
        "source": "T25n1512_007:0849a26_72"
    },
    {
        "source_sentence": "「諸佛法」者，是佛所證果頭無為法身萬德一切法相也。",
        "translation": "The buddha-dharmas refers to all the characteristics of all the myriad virtues of the Buddha's realization of the fruition of the Buddha's unconditioned Dharma body as head.",
        "source": "T25n1512_007:0849a27_73"
    },
    {
        "source_sentence": "故第四句云「一切自體相」，明此萬德是真真如法身自體相，非是有為萬相所成也。",
        "translation": "That's why the fourth sentence says, All their own essence and characteristics, which explains that these myriad virtues are the essence and characteristics of the true Dharma body of reality, not created by the myriad characteristics of existence.",
        "source": "T25n1512_007:0849a28_74"
    },
    {
        "source_sentence": "「此義云何」以下至「以不虛說故」，解偈中初句竟，通以上半偈來結也。",
        "translation": "From What does this mean? down to Because it's not falsely explained, the first phrase in the explanation of the verse concludes with the above-mentioned half-verse.",
        "source": "T25n1512_007:0849b01_75"
    },
    {
        "source_sentence": "「是故如來說一切法佛法如是等」者，提結為問，云：如來說一切法佛法，",
        "translation": "That's why the Tathāgata teaches all the teachings of the Dharma buddhas and so forth, he concludes by asking questions, saying, The Tathāgata teaches all the teachings of the Dharma buddhas,",
        "source": "T25n1512_007:0849b02_76"
    },
    {
        "source_sentence": "此義云何也？",
        "translation": "What does this mean?",
        "source": "T25n1512_007:0849b04_77"
    },
    {
        "source_sentence": "故即答「以如來得如是法」，明如來躬自修行，證得如是果頭萬德一切法也。",
        "translation": "That's why he answered, Because the Tathāgata has attained such a teaching, explaining that the Tathāgata himself cultivates it and realizes all the myriad virtues of these fruits.",
        "source": "T25n1512_007:0849b04_78"
    },
    {
        "source_sentence": "故復以下半偈來結釋已，然後先解第四句，後釋第三句也。",
        "translation": "That's why the next half of the verse concludes with an explanation, and then he first explains the fourth phrase and then explains the third phrase.",
        "source": "T25n1512_007:0849b06_79"
    },
    {
        "source_sentence": "「彼處色等相不住故」等，明菩提萬德一切法。",
        "translation": "It's because form and other characteristics in those places don't abide, etc., which explains the myriad virtues of enlightenment and all dharmas.",
        "source": "T25n1512_007:0849b07_80"
    },
    {
        "source_sentence": "所以唯以真如為體，不以色等為體者，以菩提體是真如無為故，但住持萬德一切法，",
        "translation": "Because the essence of enlightenment is reality and nonexistence, it only sustains all things as myriad qualities.",
        "source": "T25n1512_007:0849b08_81"
    },
    {
        "source_sentence": "不住持色等一切法，故以為體也。",
        "translation": "They don't abide in all the things that support form and so forth, so they take them as their essence.",
        "source": "T25n1512_007:0849b10_82"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1512_007:0849b12_0"
    },
    {
        "source_sentence": "譬如有人其身妙大」等，此斷疑分中第三經文。",
        "translation": "Suppose there's a person whose body is marvelously large, and so forth, which is the third text of the sutra in the section on ending doubt.",
        "source": "T25n1512_007:0849b12_1"
    },
    {
        "source_sentence": "前喻明報身佛，今明法身佛。",
        "translation": "The first metaphor explains the buddha of the body of retribution body, and the present one explains the buddha of the Dharma body.",
        "source": "T25n1512_007:0849b13_2"
    },
    {
        "source_sentence": "上已廣釋法身無萬相而是妙有，又次前經中兩句明法身菩提萬德圓滿，",
        "translation": "The above extensively explains that the Dharma body has no myriad characteristics but rather a marvelous existence. Furthermore, the first two sentences of the former sūtra explain that the Dharma body and enlightenment are perfected by myriad virtues:",
        "source": "T25n1512_007:0849b13_3"
    },
    {
        "source_sentence": "故有菩提可得。",
        "translation": "Therefore, there's enlightenment that can be attained.",
        "source": "T25n1512_007:0849b15_4"
    },
    {
        "source_sentence": "然疑者猶謂全無法身。",
        "translation": "Still, those who doubt it still say that there's no body at all.",
        "source": "T25n1512_007:0849b16_0"
    },
    {
        "source_sentence": "何以故爾？",
        "translation": "Why is it so?",
        "source": "T25n1512_007:0849b16_1"
    },
    {
        "source_sentence": "若法身萬德滿足，應有萬相可見；",
        "translation": "If the body of reality were endowed with myriad virtues, it would have myriad characteristics.",
        "source": "T25n1512_007:0849b16_2"
    },
    {
        "source_sentence": "若無萬相可見者，便應一向無法身，所以得知法身是無。",
        "translation": "If there were no myriad characteristics to be seen, one would have a body that is absolutely nonexistent. That is why we know that the dharma body is nonexistent.",
        "source": "T25n1512_007:0849b17_3"
    },
    {
        "source_sentence": "前段經中，如來或言有菩提可得、或言無菩提可得。",
        "translation": "In the first section of the sutra, the Tathāgata sometimes says there's enlightenment to be attained and sometimes he says there's no enlightenment to be attained.",
        "source": "T25n1512_007:0849b18_4"
    },
    {
        "source_sentence": "若法身定有者，應答我有得；",
        "translation": "If the body of doctrine definitely exists, one should reply that it is acquired by me.",
        "source": "T25n1512_007:0849b20_0"
    },
    {
        "source_sentence": "若法身定無，應答言無得。",
        "translation": "If the Dharma body is definitely nonexistent, you should answer that it has no attainment.",
        "source": "T25n1512_007:0849b20_1"
    },
    {
        "source_sentence": "今答既不定，復不可見，故知法身是無也。",
        "translation": "Now, since the answer is indeterminate and invisible, we know that the Dharma body is nonexistent.",
        "source": "T25n1512_007:0849b21_2"
    },
    {
        "source_sentence": "有如此疑，故經答「譬如有人其身妙大」等也。",
        "translation": "There's such doubt, so the sūtra answers, Suppose there's a person whose body is marvelously large, etc.",
        "source": "T25n1512_007:0849b22_3"
    },
    {
        "source_sentence": "答意明理而言之，菩提之體雖無萬相可得，然實有真如法身菩提可得，",
        "translation": "The answer is: although the essence of enlightenment has no myriad characteristics to attain, there really is enlightenment that can be attained by means of the true reality-body dharma body.",
        "source": "T25n1512_007:0849b23_4"
    },
    {
        "source_sentence": "但不得定答。",
        "translation": "They simply can't give a definite answer.",
        "source": "T25n1512_007:0849b24_5"
    },
    {
        "source_sentence": "所以然者，明此法身乃是非有非無、妙有妙無中道之理。",
        "translation": "The reason is that this Dharma body explains that it's neither existent nor nonexistent, subtle and subtle without the principle of the middle way.",
        "source": "T25n1512_007:0849b25_6"
    },
    {
        "source_sentence": "我若定答，汝等便生邪見，聞菩提是有，取同色等有為之有，則成常見；",
        "translation": "If I were to answer with certainty, you would give rise to a mistaken view that enlightenment exists when one hears that conditioned states of being exist in the same way as form, etc.",
        "source": "T25n1512_007:0849b26_7"
    },
    {
        "source_sentence": "聞無，謂一向同於虛空兔角無體之無，則成斷見，故不得定答也。",
        "translation": "The absence of hearing means that it's always the same as the absence of the horns of a rabbit in space and the absence of its essence, which then becomes a view of nihilism, so it can't be answered with certainty.",
        "source": "T25n1512_007:0849b28_8"
    },
    {
        "source_sentence": "又此法身具足功德智慧二種莊嚴，體是妙有，故有法身可得；",
        "translation": "Furthermore, this Dharma body is imbued with the two kinds of adornments of virtue and wisdom. Because its essence is subtle existence, there is a Dharma body that can be acquired.",
        "source": "T25n1512_007:0849b29_9"
    },
    {
        "source_sentence": "遠離二障，體非有為，故無法身可得。",
        "translation": "Being free of these two obstacles, the essence is not conditioned; therefore, there is no body that can be acquired.",
        "source": "T25n1512_007:0849c02_0"
    },
    {
        "source_sentence": "有此二義故，上不得定答，那得難言何故作此不定答也？",
        "translation": "Because of these two meanings, the above doesn't obtain a definite answer, so why would it be difficult to say why this indeterminate answer is given?",
        "source": "T25n1512_007:0849c02_1"
    },
    {
        "source_sentence": "為斷此疑故，引大身喻，明有法身體，不應言無法身也。",
        "translation": "In order to dispel this doubt, he cites the great body metaphor to show that there's a Dharma body, and it shouldn't be said that there's no Dharma body.",
        "source": "T25n1512_007:0849c04_2"
    },
    {
        "source_sentence": "此喻釋成前言「如來者即實真如」也。",
        "translation": "This metaphor explains the accomplishment of the previous statement, The Tathāgata is the true and true reality.",
        "source": "T25n1512_007:0849c05_3"
    },
    {
        "source_sentence": "「譬如有人」者，如來引大身喻，喻法身人也。",
        "translation": "The metaphor of like a person refers to the great body metaphor cited by the Tathāgata, which is a metaphor for someone with the Dharma body.",
        "source": "T25n1512_007:0849c06_4"
    },
    {
        "source_sentence": "「其身妙大」者，如來自合喻。",
        "translation": "The phrase that his body is marvelously large refers to the combined metaphor of the Tathāgata.",
        "source": "T25n1512_007:0849c07_5"
    },
    {
        "source_sentence": "則法身體相圓滿、古今湛然，畢竟達離二障、具足二種莊嚴。",
        "translation": "Then the Dharma body is complete in appearance, perfectly clear both past and present, completely free of the two hindrances, and fully adorned in two ways.",
        "source": "T25n1512_007:0849c07_6"
    },
    {
        "source_sentence": "「妙」者智慧莊嚴，「大」者功德莊嚴也。",
        "translation": "Marvelous is the adornment of wisdom, and great is the adornment of merit.",
        "source": "T25n1512_007:0849c09_7"
    },
    {
        "source_sentence": "此其身妙大，成上章云「如來所得阿耨三菩提」，明實有無為法身菩提可得也。",
        "translation": "This is the marvelous size of his body, which makes the above chapter say, The Tathāgata attains the unsurpassed three kinds of enlightenment, explaining that there really is an unconditioned Dharma body and bodhi that can be attained.",
        "source": "T25n1512_007:0849c09_8"
    },
    {
        "source_sentence": "前二段經，明眾生五陰非實菩薩故，有為萬相亦非實菩提。",
        "translation": "The first two sections of the sūtra explain that the five aggregates of sentient beings are not real bodhisattvas, so the myriad characteristics of conditioned things are also not real enlightenment.",
        "source": "T25n1512_007:0849c11_9"
    },
    {
        "source_sentence": "此下二段經，明法身菩提是妙有故，菩薩無生忍行亦是實有也。",
        "translation": "The next two paragraphs here explain that the Dharma body and enlightenment are marvelously existent, so the bodhisattva's practice of forbearance of nonarising is also really existent.",
        "source": "T25n1512_007:0849c13_10"
    },
    {
        "source_sentence": "上第五段中云「不可以相成就見如來」者，明無為法身體無三相也。",
        "translation": "In the fifth paragraph above, it's said, You can't see the Tathāgata in terms of accomplishing characteristics, which explains that the body of the unconditioned Dharma has no three characteristics.",
        "source": "T25n1512_007:0849c14_11"
    },
    {
        "source_sentence": "第六段中言「如來不得菩提亦不說法」者，此名應化佛不得不說也。",
        "translation": "The sixth paragraph says, The Tathāgata doesn't attain enlightenment and doesn't teach the Dharma, which is called a teaching that the transformation Buddha has no choice but to teach.",
        "source": "T25n1512_007:0849c16_12"
    },
    {
        "source_sentence": "第七分山王大身喻中，謂報佛體無取相分別也。",
        "translation": "The seventh part of the metaphor of the great body of the king of mountains refers to the reward-body Buddha's essence without grasping or discriminating characteristics.",
        "source": "T25n1512_007:0849c17_13"
    },
    {
        "source_sentence": "此中大身譬喻，亦明法身佛。",
        "translation": "Here, the great body metaphor also explains the Dharma body Buddha.",
        "source": "T25n1512_007:0849c18_14"
    },
    {
        "source_sentence": "此之三佛別相中論也。",
        "translation": "These three buddhas are discussed in the Treatise on the Distinct Characteristics of the Buddha.",
        "source": "T25n1512_007:0849c19_15"
    },
    {
        "source_sentence": "「須菩提言：世尊！",
        "translation": "Suppository of enlightenment said, Bhagavān!",
        "source": "T25n1512_007:0849c19_16"
    },
    {
        "source_sentence": "如來說人身妙大則非大身」者，須菩提若不作此說，有二種失：一、不解如來意；",
        "translation": "The expression the Tathāgata teaches that a person’s body is marvelously large but not a big body means that if Subhūti did not make these statements, there would be two kinds of error:",
        "source": "T25n1512_007:0849c20_17"
    },
    {
        "source_sentence": "二、不解無為法身，故作此說也。",
        "translation": "2. They don't understand the unconditioned Dharma body, so they explain it this way.",
        "source": "T25n1512_007:0849c22_0"
    },
    {
        "source_sentence": "或者聞言法身是有，疑謂還同有為萬相之有，故釋云「則非大身」也。",
        "translation": "Perhaps someone hears that the Dharma body is existent, but doubts that it's the same as the existence of all the myriad characteristics of conditioned things, so the explanation says, Then it's not a great body.",
        "source": "T25n1512_007:0849c22_1"
    },
    {
        "source_sentence": "此明古今一定法身體，畢竟遠離二障，不同有為有漏萬相大身也。",
        "translation": "This explains that the ancient and modern bodies of certain dharmas are ultimately free of the two hindrances, which are not the same as the uncontaminated, myriad-character great body of conditioned dharmas.",
        "source": "T25n1512_007:0849c24_2"
    },
    {
        "source_sentence": "此兩句成上「實無有法如來得阿耨三菩提」，明色等有為法非實菩提體也。",
        "translation": "These two phrases make up the above statement, There really is no dharma that the Tathāgata attains the unsurpassed three kinds of enlightenment, which explains that conditioned dharmas like form and so forth are not the true essence of enlightenment.",
        "source": "T25n1512_007:0849c25_3"
    },
    {
        "source_sentence": "「是故如來說名大身」者，說名古今一定體無萬相妙有湛然真極法佛大身也，",
        "translation": "That's why the Tathāgata teaches that it's called the great body of the Buddha, which is called the great body of the ancient and present-day buddhas whose bodies lack myriad characteristics and marvelously subtle and truly ultimate dharmas.",
        "source": "T25n1512_007:0849c27_4"
    },
    {
        "source_sentence": "亦得「是故如來說名非大身」也。",
        "translation": "It can also be said, Therefore, the Tathāgata says it's called not a large body.",
        "source": "T25n1512_007:0849c29_5"
    },
    {
        "source_sentence": "此一句雙結上「其身妙大即非妙大」二句經也。",
        "translation": "This sentence concludes with the two phrases above, The marvelous greatness of his body is what's not marvelous great.",
        "source": "T25n1512_007:0849c29_6"
    },
    {
        "source_sentence": "此一段經以二偈釋。",
        "translation": "This section of the sūtra explains it in two verses.",
        "source": "T25n1512_007:0850a02_0"
    },
    {
        "source_sentence": "初偈作問答意釋疑。",
        "translation": "The first verse asks a question and answers it in order to explain the doubt.",
        "source": "T25n1512_007:0850a02_1"
    },
    {
        "source_sentence": "「依彼法身佛，故說大身喻」者，此出喻意，明與喻之來為顯法身故也。",
        "translation": "Relying on that Dharma body Buddha, he therefore explains the metaphor of the great body, which is to show the Dharma body by referring to it.",
        "source": "T25n1512_007:0850a02_2"
    },
    {
        "source_sentence": "「身離一切障」者，明法身古今湛然自性，永無二障，非斷故方離也。",
        "translation": "The phrase the body free of all hindrances explains that the Dharma body has a perfectly clear self-nature from ancient times to the present, and there are never two hindrances, which are not separated because they aren't eliminated.",
        "source": "T25n1512_007:0850a04_3"
    },
    {
        "source_sentence": "「及遍一切境」者，明此法身體是妙有，復永絕二障，無障無礙故，能遍入一切有心眾生之境。",
        "translation": "The phrase pervading all objects explains that this Dharma body is a marvelous existence, which also permanently ends the two hindrances and enters everywhere into the realm of all sentient beings with minds because it's unobstructed and unobstructed.",
        "source": "T25n1512_007:0850a06_0"
    },
    {
        "source_sentence": "然下長行論中，先釋功德及大體，後方釋及遍一切境。",
        "translation": "However, in the following long line treatise, we first explain the merits and the great essence, and then we'll explain them and pervade all objects.",
        "source": "T25n1512_007:0850a08_1"
    },
    {
        "source_sentence": "所以然者，要先有法身之體，然後障遍一切處，明有體故遍，故釋在後也。",
        "translation": "It's because the essence of the Dharma body first exists, and then the hindrances pervade all places, explaining that they are pervasive because they have essence, so it's explained later.",
        "source": "T25n1512_007:0850a09_2"
    },
    {
        "source_sentence": "「功德及大體」者，此第二偈，正釋經中「其身妙大」。",
        "translation": "The phrase merit and great essence refers to the second verse, which correctly explains that the sūtra says, That body is marvelously large.",
        "source": "T25n1512_007:0850a10_3"
    },
    {
        "source_sentence": "「功德」者，正釋經「大」字。",
        "translation": "The phrase merit refers to the sūtra's word great, which correctly explains the meaning of great.",
        "source": "T25n1512_007:0850a12_0"
    },
    {
        "source_sentence": "「及大體」者，正釋經「妙」字。",
        "translation": "The phrase and the great essence correctly explains the sūtra's word marvelous.",
        "source": "T25n1512_007:0850a12_1"
    },
    {
        "source_sentence": "「大」者功德莊嚴，「妙」者智慧莊嚴也。",
        "translation": "Great is the adornment of merit, and marvelous is the adornment of wisdom.",
        "source": "T25n1512_007:0850a13_0"
    },
    {
        "source_sentence": "前列經先舉妙、後明大，此偈中先釋大、後解妙，此偈以語便故也。",
        "translation": "The previous list of sūtras first cites the marvelous and then explains the great, and this verse first explains the great and then understands the marvelous, which is because it's easy to say.",
        "source": "T25n1512_007:0850a13_1"
    },
    {
        "source_sentence": "「故即說大身」者，以法身具二莊嚴，結作大身義也。",
        "translation": "That's why it's called the great body because the Dharma body is endowed with both adornments, which concludes with the meaning of the great body.",
        "source": "T25n1512_007:0850a15_2"
    },
    {
        "source_sentence": "「非身即是身」者，釋經「人身妙大則非大身」。",
        "translation": "The phrase what's not body is body means the sūtra explains that the human body is marvelously large, but it's not a large body.",
        "source": "T25n1512_007:0850a16_3"
    },
    {
        "source_sentence": "「非身」者，明法身體無萬相，不同有為有漏之身，故言非身也。",
        "translation": "The phrase not body explains that the Dharma body has no myriad characteristics, which are different from the conditioned and contaminated body, so it's called not body.",
        "source": "T25n1512_007:0850a17_4"
    },
    {
        "source_sentence": "「即是身」者，明如是非有為身者即是真如，具二莊嚴妙有法身也。",
        "translation": "That is, it's the body that clarifies that suchness and nonexistence are the two adornments of the marvelously existent Dharma body that is truly thusness.",
        "source": "T25n1512_007:0850a18_5"
    },
    {
        "source_sentence": "下長行論中故引此「非身即是身」，結成及遍一切境，明有相之身故不遍一切，",
        "translation": "In the following long line treatise, it's therefore cited that what's not body is body, which concludes and pervades all objects, explaining that because there's a body with characteristics, it doesn't pervade all.",
        "source": "T25n1512_007:0850a20_6"
    },
    {
        "source_sentence": "無為法身體非形相，能遍一切故，以非身即是身成遍一切處也。",
        "translation": "The body of the unconditioned dharmas is not shape or characteristic, because it can pervade all. Because it is not a body, this body forms and pervades all places.",
        "source": "T25n1512_007:0850a21_7"
    },
    {
        "source_sentence": "「是故說非身」者，釋經中「是故如來說名大身」，以無為法身非有為身，",
        "translation": "Therefore, it's called not a body because the sūtra explains that the Tathāgata therefore says it's called a great body because the unconditioned Dharma body isn't a conditioned body.",
        "source": "T25n1512_007:0850a23_8"
    },
    {
        "source_sentence": "故名非身，非謂無有無為法身，故言是故說非身也。",
        "translation": "That's why it's called not a body, which doesn't mean that there's no unconditioned Dharma body, so it's said to be therefore described as not a body.",
        "source": "T25n1512_007:0850a24_9"
    },
    {
        "source_sentence": "「此二偈說何義」等，論主欲作長行論釋偈故，先設問生起，然後解釋。",
        "translation": "What meaning does these two verses explain? and so forth, because the treatise leader wants to make a long explanation of the verse in order to discuss it, he first asks about its arising and then explains it.",
        "source": "T25n1512_007:0850a26_10"
    },
    {
        "source_sentence": "「畢竟遠離煩惱障、智障，畢竟具足法身故」者，釋偈中第三句「身離一切障」。",
        "translation": "The phrase ultimately free of the afflictive hindrances and cognitive hindrances and ultimately endowed with the Dharma body explains the third phrase in the verse, The body is free of all hindrances.",
        "source": "T25n1512_007:0850a27_11"
    },
    {
        "source_sentence": "「此復云何」者，此畢竟遠離二障，具足法身義。",
        "translation": "What's the meaning of this? This means that they are ultimately free of the two hindrances and fully possess the meaning of the Dharma body.",
        "source": "T25n1512_007:0850a29_12"
    },
    {
        "source_sentence": "復云何也？",
        "translation": "What's the next step?",
        "source": "T25n1512_007:0850b01_13"
    },
    {
        "source_sentence": "故釋有二種義：「一者遍一切處」者，明法身離二種障故，能遍一切有心之境，",
        "translation": "That's why the explanation has two kinds of meaning: one, pervading all places means that the Dharma body is free of both kinds of hindrances and therefore can pervade all objects with mind.",
        "source": "T25n1512_007:0850b01_14"
    },
    {
        "source_sentence": "即見初偈第四句。",
        "translation": "That's the fourth phrase of the first verse that sees the fourth phrase.",
        "source": "T25n1512_007:0850b03_15"
    },
    {
        "source_sentence": "「二者功德大」，明法身非但體離二障故遍，復以備二莊嚴萬德具足故，",
        "translation": "The second is the greatness of merit, which explains that the Dharma body isn't pervasive because its essence is free of the two hindrances, and it's also because both adornments are fully endowed with myriad virtues.",
        "source": "T25n1512_007:0850b03_16"
    },
    {
        "source_sentence": "能遍於一切有心之境。",
        "translation": "It's able to pervade all the objects that have mind.",
        "source": "T25n1512_007:0850b05_17"
    },
    {
        "source_sentence": "「是故名大身」者，結作大身義故，即舉第二偈上句「功德及大體」來成也。",
        "translation": "That's why it's called the great body because it concludes with the meaning of the great body, which is to cite the second verse above as the accomplishment of merit and the great essence.",
        "source": "T25n1512_007:0850b05_18"
    },
    {
        "source_sentence": "「遍一切處者，真如一切法不差別故」者，此解一切處義，明就行者而言，",
        "translation": "The phrase pervading all places because the true nature of all dharmas isn't different means to understand the meaning of all places, explaining that it's explained in terms of practitioners,",
        "source": "T25n1512_007:0850b07_19"
    },
    {
        "source_sentence": "則有諸佛菩薩及以眾生三時之異；",
        "translation": "Then there is the difference between buddhas, enlightening beings, bodhisattvas, and sentient beings at the three times.",
        "source": "T25n1512_007:0850b09_0"
    },
    {
        "source_sentence": "論真如法身，其體滿足、古今平等，無有差別也。",
        "translation": "In discussing the true Dharma body of reality, its essence is complete and equal from ancient times to the present, with no distinctions.",
        "source": "T25n1512_007:0850b09_1"
    },
    {
        "source_sentence": "自此以前，釋初一偈半經中「其身妙大」也。",
        "translation": "Since then, the first verse and a half of the sūtra explains that his body is marvelously large.",
        "source": "T25n1512_007:0850b10_2"
    },
    {
        "source_sentence": "偈言「非身即是身，是故說非身」者，明此半偈義有拘瑣釋上之義，復欲乘釋經偈，",
        "translation": "The verse says, What's not body is body; therefore, it's called what's not body. This half-verse explains that the meaning of this half-verse has the meaning of being a trivial explanation of the above, and furthermore, he wants to explain the meaning of the sūtras by means of an explanation of the sūtra verse:",
        "source": "T25n1512_007:0850b11_3"
    },
    {
        "source_sentence": "故舉此半偈成上以釋經結也。",
        "translation": "That's why this half-verse is cited as the above to explain the sūtra's conclusion.",
        "source": "T25n1512_007:0850b13_4"
    },
    {
        "source_sentence": "「此說何義」者，方次第解釋也。",
        "translation": "The phrase what's the meaning of this explanation explains it in order.",
        "source": "T25n1512_007:0850b14_5"
    },
    {
        "source_sentence": "「佛言：須菩提！",
        "translation": "The Buddha said, Subhūti!",
        "source": "T25n1512_007:0850b16_0"
    },
    {
        "source_sentence": "菩薩亦如是」等，此一段經，是斷疑分中第四經文。",
        "translation": "The bodhisattvas are likewise, and so forth, this section of the sūtra is the fourth text in the section on ending doubt.",
        "source": "T25n1512_007:0850b16_1"
    },
    {
        "source_sentence": "所以來者，此有疑故也。",
        "translation": "The reason for coming is because there's doubt here.",
        "source": "T25n1512_007:0850b17_2"
    },
    {
        "source_sentence": "云何疑？",
        "translation": "What's doubt?",
        "source": "T25n1512_007:0850b17_3"
    },
    {
        "source_sentence": "上言實無有法名為菩薩；",
        "translation": "The above statement is that there really is no dharma called bodhisattva.",
        "source": "T25n1512_007:0850b18_4"
    },
    {
        "source_sentence": "若無菩薩，則亦無修行得菩提者；",
        "translation": "If there were no enlightening beings, there wouldn’t be those who practice and attain enlightenment.",
        "source": "T25n1512_007:0850b18_5"
    },
    {
        "source_sentence": "又若無修行得菩提者，則亦無人教化眾生、亦無眾生入涅槃；",
        "translation": "Furthermore, if there is no one who practices and attains enlightenment, neither does anyone teach sentient beings nor any sentient being enter nirvana.",
        "source": "T25n1512_007:0850b19_6"
    },
    {
        "source_sentence": "若言我莊嚴佛土非菩薩者，則亦無依報淨土。",
        "translation": "If someone says I adorn the Buddha land and aren't a bodhisattva, then there's also no pure land of retribution.",
        "source": "T25n1512_007:0850b20_7"
    },
    {
        "source_sentence": "若此等四法皆是無者，何故諸菩薩發心、度眾生修淨土行、求無上菩提？",
        "translation": "If these four dharmas are all nonexistent, why do bodhisattvas arouse their minds, liberate sentient beings, cultivate the practice of the pure land, and seek unsurpassed enlightenment?",
        "source": "T25n1512_007:0850b21_8"
    },
    {
        "source_sentence": "有如此疑。",
        "translation": "There's such doubt.",
        "source": "T25n1512_007:0850b23_9"
    },
    {
        "source_sentence": "依如上釋，此疑應已遣，但或者偏執以興難也。",
        "translation": "Relying on the above explanation, this doubt should have been rejected, but it might be a partial attachment that creates difficulties.",
        "source": "T25n1512_007:0850b23_10"
    },
    {
        "source_sentence": "故經答「菩薩亦如是」等。",
        "translation": "That's why the sūtras answer, So are the bodhisattvas.",
        "source": "T25n1512_007:0850b24_11"
    },
    {
        "source_sentence": "答意云：上言無菩薩等者，據眾生五陰有為法中無也，非謂理中亦無。",
        "translation": "The answer is: The above statement that there are no bodhisattvas and so forth refers to the fact that the five aggregates of sentient beings lack them in conditioned dharmas, which doesn't mean that they don't exist in principle.",
        "source": "T25n1512_007:0850b25_12"
    },
    {
        "source_sentence": "然非不實有菩薩會無生理修行得佛菩提，既有諸佛證果之人，然諸佛菩薩本不獨善，",
        "translation": "But it is not that there are unreal enlightening beings who have assemblies of bodhisattvas and non-physical practices to attain buddhahood. There are those who realize the fruits of buddhahood, but Buddhas and enlightening beings are not alone in their goodness.",
        "source": "T25n1512_007:0850b27_13"
    },
    {
        "source_sentence": "復化物同得故，發心修行、度眾生令入涅槃、修淨土行，但知不離真如法界外有為法中別有實菩薩是能度者、有實眾生是可度者、有真淨土可修故。",
        "translation": "It's because they arouse the intention to cultivate and liberate sentient beings so that they enter nirvāṇa and cultivate the practice of the pure land, but they only know that there are real bodhisattvas outside the realm of reality who can be liberated, real sentient beings who can be liberated, and real pure lands that can be cultivated.",
        "source": "T25n1512_007:0850b29_14"
    },
    {
        "source_sentence": "下經言「通達無我無我法者是名菩薩」；",
        "translation": "The following sūtra says, Understanding the dharmas of selflessness and selflessness is called a bodhisattva.",
        "source": "T25n1512_007:0850c03_15"
    },
    {
        "source_sentence": "上言無者，道眾生五陰有為法中無實菩薩。",
        "translation": "The above statement that it's nonexistent refers to the bodhisattva who teaches that there are no real bodhisattvas in the five aggregates of sentient beings and conditioned dharmas.",
        "source": "T25n1512_007:0850c04_16"
    },
    {
        "source_sentence": "若爾，非一向無菩薩，那得聞言實無有法名為菩薩，便全無菩薩？",
        "translation": "If that's the case, it's not that there are always no bodhisattvas, so how could someone who hears words that really have no dharmas be called a bodhisattva and then completely lack bodhisattvas?",
        "source": "T25n1512_007:0850c05_17"
    },
    {
        "source_sentence": "為斷此疑，故次明也。",
        "translation": "In order to stop this doubt, it's therefore explained in order.",
        "source": "T25n1512_007:0850c06_18"
    },
    {
        "source_sentence": "「佛言：菩薩亦如是」者，上辨如菩薩，佛亦復如是；",
        "translation": "The Buddha saying, So it is with the bodhisattvas refers to the above statement that they are like the bodhisattvas, and so are the Buddha.",
        "source": "T25n1512_007:0850c08_0"
    },
    {
        "source_sentence": "此明如佛，菩薩亦如是。",
        "translation": "This explains that it's like the Buddha, and so is the bodhisattva.",
        "source": "T25n1512_007:0850c09_1"
    },
    {
        "source_sentence": "云何亦如是？",
        "translation": "How is it likewise?",
        "source": "T25n1512_007:0850c09_2"
    },
    {
        "source_sentence": "即此斷疑分第一段中，明實無有法名為菩薩。",
        "translation": "In the first paragraph of this section on ending doubt, it's explained that there really is no dharma called a bodhisattva.",
        "source": "T25n1512_007:0850c09_3"
    },
    {
        "source_sentence": "次第二段中，明實無有法如來得菩提。",
        "translation": "In the second paragraph, he explains that there really is no Dharma Tathāgata who attains enlightenment.",
        "source": "T25n1512_007:0850c10_4"
    },
    {
        "source_sentence": "此二段經，先明眾生五陰有為虛妄法，非實菩薩故；",
        "translation": "These two sections of the scripture first explain that the five aggregates of sentient beings are conditioned and false dharmas, because they are not real enlightening beings.",
        "source": "T25n1512_007:0850c11_5"
    },
    {
        "source_sentence": "次明若謂菩提同有為萬相可得者，是不實說故。",
        "translation": "Next, it's explained that if someone says that enlightenment is the same as the myriad characteristics of conditioned things that can be attained, it's because they don't really say so.",
        "source": "T25n1512_007:0850c13_0"
    },
    {
        "source_sentence": "上論偈言「菩提彼行等」，此即是如菩薩佛亦復如是也。",
        "translation": "The above-mentioned verse says, Enlightenment and those practices are the same as bodhisattvas and buddhas, which is likewise.",
        "source": "T25n1512_007:0850c14_1"
    },
    {
        "source_sentence": "又次前段經，明有為萬相非是菩提，而真如無為萬德之法是實菩提。",
        "translation": "Furthermore, the previous section of the sūtra explains that the myriad characteristics of conditioned things aren't enlightenment, but true and unconditioned things with myriad virtues are really enlightenment.",
        "source": "T25n1512_007:0850c15_2"
    },
    {
        "source_sentence": "此段明眾生五陰有為虛妄非實菩薩，然非不有會真如無生理者是真菩薩。",
        "translation": "This section explains that the five aggregates of sentient beings are artificial, false, and not real bodhisattvas, but there's no true bodhisattva who doesn't assembly with the unity of reality and non-physicality.",
        "source": "T25n1512_007:0850c16_3"
    },
    {
        "source_sentence": "此二段經，明理中實有、菩提是可證，故亦有菩薩實證之人，此明如佛菩薩亦如是。",
        "translation": "These two sections of the sūtra explain that there really is enlightenment and bodhi in principle that can be realized, so there are also bodhisattvas who truly realize it, and this shows that buddhas and bodhisattvas are likewise.",
        "source": "T25n1512_007:0850c18_4"
    },
    {
        "source_sentence": "今言亦如是如者，明有為虛妄非菩薩，會無生忍者是真菩薩，義同有為萬相非實菩提，",
        "translation": "The present expression also thus thus thusness indicates that conditioned things are false and not bodhisattvas. To gather the ninja of nonorigination is to say that he is a true bodhisattva, which has the same meaning as conditioned all-inclusive enlightenment but not real enlightenment.",
        "source": "T25n1512_007:0850c20_5"
    },
    {
        "source_sentence": "真如無為是實菩提相故，言菩薩亦如是。",
        "translation": "Because the true nature of nonexistence is the true characteristic of enlightenment, it's said that bodhisattvas are likewise.",
        "source": "T25n1512_007:0850c22_6"
    },
    {
        "source_sentence": "前二段經，但就菩薩菩提不實義同故，言亦如是。",
        "translation": "The first two sections of the sūtra simply refer to the bodhisattva's enlightenment because it doesn't really have the same meaning, and they say it's likewise.",
        "source": "T25n1512_007:0850c23_7"
    },
    {
        "source_sentence": "此二段，並明菩薩菩提實義邊同亦如是，不實義同亦如是也。",
        "translation": "These two paragraphs also explain that the bodhisattva's true meaning of enlightenment is the same at the end, and so is its unreal meaning.",
        "source": "T25n1512_007:0850c24_8"
    },
    {
        "source_sentence": "「若作是言：我當滅度無量眾生。",
        "translation": "“If someone says this, I will extinguish measureless sentient beings.",
        "source": "T25n1512_007:0850c25_9"
    },
    {
        "source_sentence": "則非菩薩」者，明若作心謂離真如法界外別有行者，發菩提心、修諸波羅蜜行、以慈悲四無量四攝等法教化眾生令得涅槃，",
        "translation": "The phrase not bodhisattva means that if someone's mind is free of practice outside the realm of reality, they give rise to the mind of enlightenment, cultivate the practices of the perfections, teach sentient beings with the four immeasurable and four collecting qualities of kindness and compassion, and cause them to attain nirvāṇa.",
        "source": "T25n1512_007:0850c26_10"
    },
    {
        "source_sentence": "是真菩薩者，此未會平等，非是初地以上解真如平等菩薩也。",
        "translation": "This is really a bodhisattva who doesn't understand equality here, not an equal bodhisattva who understands the equality of true reality above the first ground.",
        "source": "T25n1512_007:0850c29_11"
    },
    {
        "source_sentence": "「佛言：須菩提！",
        "translation": "The Buddha said, Subhūti!",
        "source": "T25n1512_007:0851a01_12"
    },
    {
        "source_sentence": "頗有實法名為菩薩」者，因前經，乘更生疑：若發心修行、教化眾生非真菩薩者，",
        "translation": "Could it be that there's a real dharma called bodhisattva because of the previous sūtra, which causes further doubt to arise in the vehicle: If someone who arouses the mind to cultivate and teach sentient beings is not really a bodhisattva,",
        "source": "T25n1512_007:0851a02_13"
    },
    {
        "source_sentence": "還同前疑，正眾生五陰是實菩薩。",
        "translation": "It's the same as the previous doubt that corrects the five aggregates of sentient beings who are truly bodhisattvas.",
        "source": "T25n1512_007:0851a03_14"
    },
    {
        "source_sentence": "有如此疑，故佛問須菩提：眾生五陰有為法中頗有一法是實名為菩薩不？",
        "translation": "Because of this doubt, the Buddha asked Subhūti, Is there really a single thing among the five aggregates and conditioned dharmas of sentient beings that's called a bodhisattva?",
        "source": "T25n1512_007:0851a04_15"
    },
    {
        "source_sentence": "故須菩提答「不也。",
        "translation": "That's why Suppository answered, No.",
        "source": "T25n1512_007:0851a06_16"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1512_007:0851a06_17"
    },
    {
        "source_sentence": "實無有法名為菩薩」。",
        "translation": "There really is no dharma called bodhisattva when it's called bodhisattva.",
        "source": "T25n1512_007:0851a06_18"
    },
    {
        "source_sentence": "此答意明眾生五陰有為之法，本來空寂，無有一法是實可名菩薩故，不應取眾生五陰以為真實菩薩也。",
        "translation": "This answer means that the five aggregates of sentient beings' five dharmas are originally empty and quiescent, and there's no single thing that can really be called a bodhisattva because it shouldn't be taken to mean that the five aggregates of sentient beings are real bodhisattvas.",
        "source": "T25n1512_007:0851a07_19"
    },
    {
        "source_sentence": "「一切法無眾生、無人、無壽者」等，引佛語為證也。",
        "translation": "The phrase all dharmas lack sentient beings, no person, and no life span refers to the Buddha's words as proof.",
        "source": "T25n1512_007:0851a09_20"
    },
    {
        "source_sentence": "此就因緣法空中以解無菩薩，明有為法中本來空寂，無有一法是實可名菩薩是能度者，",
        "translation": "This is to explain that there's no bodhisattva in the sky of dharmas as causes and conditions, which shows that within conditioned dharmas originally emptiness and quiescence, there's no single thing that can really be called a bodhisattva who's able to save.",
        "source": "T25n1512_007:0851a10_21"
    },
    {
        "source_sentence": "故亦知無實眾生是可度者也。",
        "translation": "Therefore, it's also known that there are no real sentient beings who can be liberated.",
        "source": "T25n1512_007:0851a12_22"
    },
    {
        "source_sentence": "所以經中但言無眾生等三，不言無我者，以此經始未明真如之我。",
        "translation": "That's why the sūtras only say that there are three things like sentient beings and so forth, but they don't say selflessness because this sūtra begins to explain the true self of suchness.",
        "source": "T25n1512_007:0851a13_23"
    },
    {
        "source_sentence": "若言無我，恐眾生謂佛性真我亦無，故不言無我，以名相濫故也。",
        "translation": "If someone says selfless, they're afraid sentient beings will say that the true self of buddha-nature is also nonexistent, so they won't say selfless because names are confused.",
        "source": "T25n1512_007:0851a15_24"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1512_007:0851a17_0"
    },
    {
        "source_sentence": "若菩薩作是言：我莊嚴佛國土。",
        "translation": "Suppose a bodhisattva says, I adorn the Buddha's land.",
        "source": "T25n1512_007:0851a17_1"
    },
    {
        "source_sentence": "至是名莊嚴佛國土」，此明若起心分別，謂異於真法界外別有出世莊嚴淨土，",
        "translation": "Up to this point, it's called the adornment of the Buddha's land. This shows that if one gives rise to mental discrimination, meaning that there's a separate, supramundane adorned pure land apart from the true Dharma realm,",
        "source": "T25n1512_007:0851a17_2"
    },
    {
        "source_sentence": "為無漏勝因所得是真實者，不名解真如平等菩薩也。",
        "translation": "Because what's attained by uncontaminated superior causes is real, it's not called the bodhisattva who understands the equality of true reality.",
        "source": "T25n1512_007:0851a19_3"
    },
    {
        "source_sentence": "所以重言莊嚴者，明修行因緣顯真如法性有真莊嚴淨土用，非謂異法性別有為波羅蜜行所得莊嚴淨土，",
        "translation": "The reason it's called adorned is to explain that the causes and conditions of cultivation reveal that the true nature of reality as dharmas has the function of truly adorning the pure land, not that it's an adorned pure land acquired from the practice of the transcendent ways that are different from the Dharma-nature.",
        "source": "T25n1512_007:0851a20_4"
    },
    {
        "source_sentence": "故重莊嚴。",
        "translation": "Therefore, it's heavily adorned.",
        "source": "T25n1512_007:0851a23_5"
    },
    {
        "source_sentence": "「是名莊嚴」者，即是第一義諦莊嚴也。",
        "translation": "The phrase this is called adornment refers to the adornment of the cardinal truth.",
        "source": "T25n1512_007:0851a23_6"
    },
    {
        "source_sentence": "此一段經明有實菩薩，何故乃云作是言我度眾生、我莊嚴淨土者非真菩薩也？",
        "translation": "This section of the sūtra explains that there are real bodhisattvas, so why does it say that someone who says 'I save sentient beings and adorn the Pure Land with self' isn't a true bodhisattva?",
        "source": "T25n1512_007:0851a24_7"
    },
    {
        "source_sentence": "為明舉非以形是，故重牒來也。",
        "translation": "It's to clarify that it's not because of form, so it's a repeated explanation.",
        "source": "T25n1512_007:0851a26_8"
    },
    {
        "source_sentence": "更有一意：明眾生、菩薩、佛、淨土此四，雖名用有異，而同一法界中名。",
        "translation": "There's another idea: It means that these four things are called sentient beings, bodhisattvas, buddhas, and pure lands in the same realm of reality even though their names and functions are different.",
        "source": "T25n1512_007:0851a27_9"
    },
    {
        "source_sentence": "若不會真法界者，謂此四法離真法界別體相異故，不名真菩薩。",
        "translation": "If someone doesn't know the true Dharma realm of reality, it means that these four dharmas are separate from the true Dharma realm of reality because their distinct essence and characteristics are different, so they aren't called true bodhisattvas.",
        "source": "T25n1512_007:0851a28_10"
    },
    {
        "source_sentence": "若會真如平等之解者，知此法雖時異用別，語其所歸，無有異相離於真法界條然有也。",
        "translation": "If someone understands the equality of understanding of true reality, they know that even though these things are different in time and use, there's no difference in what they say to be their refuge, and there's no difference in characteristics that are separate from the true Dharma realm as a rule but exist.",
        "source": "T25n1512_007:0851b01_11"
    },
    {
        "source_sentence": "故《勝鬘經》云「依如來藏建立一切法」，又如《不增不減經》中明，",
        "translation": "That's why the Vaiśeṣika-sūtra says, All dharmas are established based on the Tathāgatagarbha, and it's likewise explained in the Sutra of neither increase nor decrease.",
        "source": "T25n1512_007:0851b03_12"
    },
    {
        "source_sentence": "就佛性法身體上有眾生菩薩佛。",
        "translation": "On top of the buddha-nature Dharma body, there's the bodhisattva Buddha of sentient beings and bodhisattvas.",
        "source": "T25n1512_007:0851b04_13"
    },
    {
        "source_sentence": "故知凡聖雖殊而同依佛性。",
        "translation": "Therefore, it's known that even though worldlings and sages are different, they all rely on the buddha-nature.",
        "source": "T25n1512_007:0851b05_14"
    },
    {
        "source_sentence": "若同一法界，所以有斯四法差別者，明未修行不斷惑者名為眾生；",
        "translation": "“If they are the same as one and the same realm of factors, there is therefore a difference between these four factors”: It is said that those who have not cultivated practice but do not abandon defilement are called ‘sentient beings’.",
        "source": "T25n1512_007:0851b05_15"
    },
    {
        "source_sentence": "修行之中分別斷惑者或為菩薩；",
        "translation": "Someone who practices the elimination of afflictions by differentiating may be a bodhisattva.",
        "source": "T25n1512_007:0851b07_16"
    },
    {
        "source_sentence": "全修行滿足除二惑永盡故名為佛也；",
        "translation": "They are called buddhas because they completely practice and fulfill enlightenment, getting rid of the two defilements.",
        "source": "T25n1512_007:0851b08_17"
    },
    {
        "source_sentence": "既得圓報法身，必有所依之土，即此圓報法有上品世間依報用異，故有淨土。",
        "translation": "Since they've attained the Dharma body of perfect retribution, there must be a land where there's a basis, which is the pure land because this perfect retribution dharma has superior worldly bases and rewards that differ in their function.",
        "source": "T25n1512_007:0851b09_18"
    },
    {
        "source_sentence": "此明佛與淨土二法體一，就用異也。",
        "translation": "This explains that the Buddha and the Pure Land are two dharmas with one essence, which differ in terms of function.",
        "source": "T25n1512_007:0851b10_19"
    },
    {
        "source_sentence": "有人生疑：若起如此心非菩薩者，起何等心名真菩薩？",
        "translation": "Some people wonder, If someone gives rise to such a mind that's not a bodhisattva, what kind of mind does they give rise to that's called a true bodhisattva?",
        "source": "T25n1512_007:0851b12_0"
    },
    {
        "source_sentence": "故答「須菩提！",
        "translation": "That's why he answered, Subhūti!",
        "source": "T25n1512_007:0851b13_1"
    },
    {
        "source_sentence": "若菩薩通達無我無我法者，名為真是菩薩菩薩」者，解意上來明未得二無我解者不名為真實菩薩，",
        "translation": "If a bodhisattva understands the principle of selflessness and selflessness, he's called a truly bodhisattva bodhisattva. This means to understand that the above-mentioned explanation explains that someone who hasn't yet attained understanding of the two kinds of selflessness isn't called a true bodhisattva.",
        "source": "T25n1512_007:0851b13_2"
    },
    {
        "source_sentence": "遙指正答在此。",
        "translation": "Here, he's pointing at the correct answer from a distance.",
        "source": "T25n1512_007:0851b15_3"
    },
    {
        "source_sentence": "今言通達無我無我法，正出解二無我法者名真菩薩也。",
        "translation": "Now, I'll say that someone who understands the dharmas of selflessness and selflessness and correctly explains the two dharmas of selflessness is called a true bodhisattva.",
        "source": "T25n1512_007:0851b16_4"
    },
    {
        "source_sentence": "「無我無我法」者，有二種無我：一、人無我，二、法無我。",
        "translation": "The phrase selflessness and selfless dharmas refers to two kinds of selflessness: 1. selflessness of people and 2. selflessness of dharmas.",
        "source": "T25n1512_007:0851b17_5"
    },
    {
        "source_sentence": "人無我者，解眾生五陰中從本以來無定實神我及眾生等，故曰人無我也。",
        "translation": "The selflessness of humans means that they understand that the five aggregates of sentient beings have no real soul, self, sentient beings, and so forth in the five aggregates since the distant past. Therefore, it's said that humans lack self.",
        "source": "T25n1512_007:0851b18_6"
    },
    {
        "source_sentence": "法無我有二種：一、觀因緣法體本來空寂；",
        "translation": "There is no self in dharmas, and there are two kinds of self:",
        "source": "T25n1512_007:0851b20_7"
    },
    {
        "source_sentence": "二、觀佛性法體無萬相故空。",
        "translation": "2. observing that the buddha-nature is empty because the Dharma body has no myriad characteristics.",
        "source": "T25n1512_007:0851b21_8"
    },
    {
        "source_sentence": "若能通達三空二無我者是真菩薩，故曰通達無我無我法也。",
        "translation": "If someone can comprehend the three kinds of emptiness and two kinds of selflessness, they're really bodhisattvas, so they're called comprehending the dharmas of selflessness and selflessness.",
        "source": "T25n1512_007:0851b21_9"
    },
    {
        "source_sentence": "所以重言菩薩菩薩者，明菩薩有二種：一者地前菩薩，聞信二種無我；",
        "translation": "The reason why it is called “bodhisattva-bodhisattva” is to explain that there are two kinds of bodhisattvas:",
        "source": "T25n1512_007:0851b23_10"
    },
    {
        "source_sentence": "二者地上菩薩，現見二種無我。",
        "translation": "The second is the bodhisattva on earth who now sees two kinds of selflessness.",
        "source": "T25n1512_007:0851b24_11"
    },
    {
        "source_sentence": "若直云菩薩，恐失地前菩薩髣髴觀理深伏煩惱者，故重言菩薩菩薩也。",
        "translation": "If it's simply called a bodhisattva, it's because they're afraid of losing the bodhisattvas who contemplate the principle and deeply subdue afflictions before the ground, so they're often called bodhisattvas and bodhisattvas.",
        "source": "T25n1512_007:0851b25_12"
    },
    {
        "source_sentence": "「論曰：此中有疑」等者，論主將欲以偈釋前經文，故作此生起也。",
        "translation": "The treatise says, 'There's doubt here.' and so forth means that the treatise leader wants to explain the previous sūtras in verse, so he makes them arise here.",
        "source": "T25n1512_007:0851b27_13"
    },
    {
        "source_sentence": "「若無菩薩至清淨佛國土」，以牒所疑事也。",
        "translation": "Suppose there's no bodhisattva who arrives in the pure Buddha land to explain the matter of doubt.",
        "source": "T25n1512_007:0851b28_14"
    },
    {
        "source_sentence": "「若如是」以下，序生疑之意，指經為釋，如經中生起也。",
        "translation": "If this is the case, the preface gives rise to the idea of doubt by referring to the sūtras as explanations, just as they give rise to them in the sūtras.",
        "source": "T25n1512_007:0851b29_15"
    },
    {
        "source_sentence": "凡以二偈釋斯一段經文。",
        "translation": "Where there are two verses that explain the text of this section of the sūtra in two ways.",
        "source": "T25n1512_007:0851c01_16"
    },
    {
        "source_sentence": "初偈作問答意，釋經中「菩薩亦如是至不名菩薩」也。",
        "translation": "The first verse asks a question and answers, explaining that the sūtra says, So it is with bodhisattvas up to the point where they aren't called bodhisattvas.",
        "source": "T25n1512_007:0851c02_17"
    },
    {
        "source_sentence": "第二偈，釋經「若菩薩通達無我無我法」盡經也。",
        "translation": "The second verse explains the sūtra, If a bodhisattva understands selflessness and selfless dharmas, this is the end of the sutra.",
        "source": "T25n1512_007:0851c03_18"
    },
    {
        "source_sentence": "「不達真法界，起度眾生意，及清淨國土」者，明菩薩所以起心度眾生及莊嚴佛國土者，",
        "translation": "Those who don't understand the true Dharma realm, initiate business to save sentient beings, and pure lands explain that the bodhisattva therefore initiates his mind to save sentient beings and adorn the Buddha's land.",
        "source": "T25n1512_007:0851c04_19"
    },
    {
        "source_sentence": "正以不達真如法界平等理故，不知凡聖一如依正同體，謂離此真法界外於三界有為法中，",
        "translation": "It is precisely because they do not understand the equanimity of the realm of reality and the realm of reality, that they do not know that worldlings and saints have one suchness in their essence. That is to say, apart from this realm of reality, all conditioned dharmas exist in the three realms:",
        "source": "T25n1512_007:0851c06_20"
    },
    {
        "source_sentence": "別有菩薩是能度者、有實眾生是可度者、有真淨土可修，此不名解平等真實菩薩。",
        "translation": "If there's another bodhisattva who can save, a real sentient being who can save, and a truly pure land that can be cultivated, this isn't called a bodhisattva who understands the equality of reality.",
        "source": "T25n1512_007:0851c08_21"
    },
    {
        "source_sentence": "故下句云「生心即是倒」也。",
        "translation": "That's why the next sentence says, The mind that gives rise to it is error.",
        "source": "T25n1512_007:0851c10_22"
    },
    {
        "source_sentence": "故經中明文殊師利向佛懺悔：「我從昔來，由不達真法界理故，以取相心，",
        "translation": "That's why it's explained in the sūtra that Mañjuśrī repents to the Buddha, saying, Since the distant past, because I didn't understand the true principle of the Dharma realm, I used to grasp characteristics and marks with my mind.",
        "source": "T25n1512_007:0851c11_23"
    },
    {
        "source_sentence": "化眾生、修十地行、淨佛國土。",
        "translation": "He transforms sentient beings, cultivates the practice of the ten stages, and purifies the Buddha's land.",
        "source": "T25n1512_007:0851c12_24"
    },
    {
        "source_sentence": "有如此罪，今向佛懺悔。",
        "translation": "Because of such sins, I now repent to the Buddha.",
        "source": "T25n1512_007:0851c13_25"
    },
    {
        "source_sentence": "以起心取此不實為故名倒也。",
        "translation": "It's called a mistake because the mind that gives rise to it takes this as insubstantial.",
        "source": "T25n1512_007:0851c13_26"
    },
    {
        "source_sentence": "「此義云何？",
        "translation": "What does this mean?",
        "source": "T25n1512_007:0851c14_27"
    },
    {
        "source_sentence": "若起如是心」等一段長行論，先舉偈為問，後以經答也。",
        "translation": "If you give rise to such a mind, the long lines of the treatise begin with a verse as a question and end with a sūtra as an answer.",
        "source": "T25n1512_007:0851c14_28"
    },
    {
        "source_sentence": "此示何義？",
        "translation": "What does this mean?",
        "source": "T25n1512_007:0851c16_29"
    },
    {
        "source_sentence": "將作偈釋經故，問此經云通達無我無我法者，示何等義也。",
        "translation": "Because he's about to compose a verse explaining the sūtras, he asks what meaning this sūtra says when he understands the dharmas of selflessness and selflessness.",
        "source": "T25n1512_007:0851c16_30"
    },
    {
        "source_sentence": "所以偈答云「眾生及菩薩」等，此第二偈。",
        "translation": "That's why the verse answers, Sentient beings and bodhisattvas, and so forth, are the second verse.",
        "source": "T25n1512_007:0851c17_31"
    },
    {
        "source_sentence": "「眾生及菩薩」，「眾生」者，凡夫菩薩也。",
        "translation": "Sentient beings and bodhisattvas, sentient beings means ordinary bodhisattvas.",
        "source": "T25n1512_007:0851c18_32"
    },
    {
        "source_sentence": "「及菩薩」者，謂初地以上菩薩也。",
        "translation": "The phrase and bodhisattva refers to bodhisattvas above the first ground.",
        "source": "T25n1512_007:0851c19_33"
    },
    {
        "source_sentence": "「知諸法無我」者，明此二種菩薩得三空二無我解也。",
        "translation": "Knowing that all dharmas lack self means that these two kinds of bodhisattvas attain the understanding of the three kinds of emptiness and two kinds of selflessness.",
        "source": "T25n1512_007:0851c20_34"
    },
    {
        "source_sentence": "此明地前菩薩髣髴解二無我，登地以上現見二無我也。",
        "translation": "This explains that the bodhisattva before the ground crudely understands the two kinds of selflessness and ascends to the ground where he now sees the two kinds of selflessness.",
        "source": "T25n1512_007:0851c21_35"
    },
    {
        "source_sentence": "故下半偈云「非聖自智信，及聖以有智」。",
        "translation": "That's why the next half of the verse says, It's not the noble self-cognition that believes and the noble ones that have knowledge.",
        "source": "T25n1512_007:0851c22_36"
    },
    {
        "source_sentence": "「非聖」者，明地前菩薩未現得真如無我解故名非聖，非不得相似之解，",
        "translation": "The expression not noble means that bodhisattvas before the ground haven't yet manifested the understanding of true selflessness, so they're called not noble because they don't attain similar understanding.",
        "source": "T25n1512_007:0851c23_37"
    },
    {
        "source_sentence": "聞中生決定信故，言自智信也。",
        "translation": "Because certain faith arises in hearing, it's called self-cognizing faith.",
        "source": "T25n1512_007:0851c25_38"
    },
    {
        "source_sentence": "「及聖以有智」者，明初地以上菩薩現會三空二無我理故名為聖。",
        "translation": "The phrase and the noble because there's wisdom explains that the bodhisattvas above the first ground now understand the principle of the three kinds of emptiness, two kinds of selflessness, and therefore are called noble.",
        "source": "T25n1512_007:0851c25_39"
    },
    {
        "source_sentence": "何故名聖？",
        "translation": "Why are they called noble?",
        "source": "T25n1512_007:0851c27_40"
    },
    {
        "source_sentence": "以有真如無漏智故，言及聖以有智也。",
        "translation": "It's because there's true uncontaminated cognition, and it's because words and the noble ones have cognition.",
        "source": "T25n1512_007:0851c27_41"
    },
    {
        "source_sentence": "長行論云「此明何義？",
        "translation": "The Changxing lun says, What does this mean?",
        "source": "T25n1512_007:0851c28_42"
    },
    {
        "source_sentence": "知無我無我法」者，先釋偈中第二句，出菩薩所觀二種我境也。",
        "translation": "Knowing that there's no self and no self and dharmas is the second phrase of the verse that first explains the second sentence in the verse, which refers to the two kinds of self objects observed by bodhisattvas.",
        "source": "T25n1512_007:0851c28_43"
    },
    {
        "source_sentence": "「謂眾生及菩薩」者，釋偈中初句，出二種菩薩能觀人也。",
        "translation": "The first phrase in the explanation of the verse refers to two kinds of bodhisattvas who can observe people.",
        "source": "T25n1512_007:0852a01_44"
    },
    {
        "source_sentence": "「何等眾生、何等菩薩」者，將釋下半偈故，作問生起。",
        "translation": "The phrase What kinds of sentient beings and what kinds of bodhisattvas will explain the second half of the verse because it asks questions that arise.",
        "source": "T25n1512_007:0852a02_45"
    },
    {
        "source_sentence": "問此二種菩薩既俱觀二種無我理，有何憂劣，而有眾生、菩薩二名不同也？",
        "translation": "Q: Since these two kinds of bodhisattvas both contemplate the two kinds of selflessness, why are there so many griefs and weaknesses when there are sentient beings and bodhisattvas whose names are different?",
        "source": "T25n1512_007:0852a03_46"
    },
    {
        "source_sentence": "即釋云「於彼法若能自智信」。",
        "translation": "That is, the explanation says, If you can have faith in that teaching and know it for yourself.",
        "source": "T25n1512_007:0852a05_47"
    },
    {
        "source_sentence": "總出二種菩薩，於彼三空理以智信也。",
        "translation": "It's a general statement of two kinds of bodhisattvas who believe in the three principles of emptiness with wisdom.",
        "source": "T25n1512_007:0852a05_48"
    },
    {
        "source_sentence": "「世間智」者，正釋偈中下半偈，明此二菩薩雖同信三空而憂劣有別也。",
        "translation": "The phrase worldly wisdom refers to the second half of the verse, which explains that these two bodhisattvas believe in the three kinds of emptiness but have distinctions in their grief and inferiority.",
        "source": "T25n1512_007:0852a06_49"
    },
    {
        "source_sentence": "「所謂凡夫聖人」以下，兩對結，得二菩薩名不同也。",
        "translation": "Under so-called worldlings and sages, the two pairs conclude by saying that the names of the two bodhisattvas are different.",
        "source": "T25n1512_007:0852a08_50"
    },
    {
        "source_sentence": "「如經」以下，引經結也。",
        "translation": "Under thus is the sūtra, we'll cite the conclusion of the sūtra.",
        "source": "T25n1512_007:0852a09_51"
    },
    {
        "source_sentence": "金剛仙論卷第七",
        "translation": "Jingang xian lun, vol. 7",
        "source": "T25n1512_007:0852a10_0"
    }
]