[
    {
        "source_sentence": "大智度論釋會宗品第二十四(卷五十二)聖者龍樹造後秦龜茲國三藏鳩摩羅什譯【經】爾時，慧命富樓那彌多羅尼子白佛言：「世尊！",
        "translation": "Mahāprajñāpāramitā-śāstra explains the assembly's doctrine in twenty-four ( vol. 52) At that point, Pūrṇa Maitrāyaṇīputra said to the Buddha, Bhagavān!",
        "source": "T25n1509_052:0429b22_0"
    },
    {
        "source_sentence": "佛使須菩提為諸菩薩摩訶薩說般若波羅蜜，今乃說摩訶衍為？」",
        "translation": "The Buddha instructed Subhūti to teach the perfection of prajñā for the bodhisattvas and mahāsattvas, but now he's teaching Mahāyāna.",
        "source": "T25n1509_052:0429b27_1"
    },
    {
        "source_sentence": "須菩提白佛言：「世尊！",
        "translation": "Suppository said to the Buddha, Bhagavān!",
        "source": "T25n1509_052:0429b28_2"
    },
    {
        "source_sentence": "我說摩訶衍，將無離般若波羅蜜？」",
        "translation": "When I teach Mahāyāna, will there be no separation from the perfection of wisdom?",
        "source": "T25n1509_052:0429b29_3"
    },
    {
        "source_sentence": "佛言：「不也！",
        "translation": "The Buddha said, No!",
        "source": "T25n1509_052:0429b29_4"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_052:0429c01_5"
    },
    {
        "source_sentence": "汝說摩訶衍，隨般若波羅蜜，不離般若波羅蜜。",
        "translation": "You say that Mahāyāna follows the perfection of wisdom and doesn't part from the perfection of wisdom.",
        "source": "T25n1509_052:0429c01_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0429c02_7"
    },
    {
        "source_sentence": "一切所有善法、助道法，若聲聞法、若辟支佛法、若菩薩法、若佛法，是一切法，皆攝入般若波羅蜜中。」",
        "translation": "All the good qualities that exist and the qualities that aid in the path, whether śrāvaka qualities, pratyekabuddha qualities, bodhisattva qualities, or buddha qualities, are all qualities that are collected into the perfection of prajñāpāramitā.",
        "source": "T25n1509_052:0429c02_8"
    },
    {
        "source_sentence": "須菩提白佛言：「世尊！",
        "translation": "Suppository said to the Buddha, Bhagavān!",
        "source": "T25n1509_052:0429c04_9"
    },
    {
        "source_sentence": "何等諸善法、助道法，聲聞法、辟支佛法、菩薩法、佛法，皆攝入般若波羅蜜中？」",
        "translation": "What good qualities, factors that aid in the path, śrāvaka qualities, pratyekabuddha qualities, bodhisattva qualities, and buddha qualities are all included in the perfection of wisdom?",
        "source": "T25n1509_052:0429c05_10"
    },
    {
        "source_sentence": "佛告須菩提：「所謂檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分，空、無相、無作解脫門，佛十力、四無所畏、四無礙智、大慈大悲、十八不共法、無錯謬相、常捨行。",
        "translation": "The Buddha told Subhūti, The so-called perfection of giving, perfection of śīla, perfection of kṣatriya, perfection of vīrya, perfection of meditation, perfection of wisdom, perfection of the four abodes of mindfulness, four correct endeavors, four supernormal abilities, five faculties, five powers, seven factors of awakening, eight parts of the noble path, emptiness, signless",
        "source": "T25n1509_052:0429c07_0"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_052:0429c12_1"
    },
    {
        "source_sentence": "是諸餘善法、助道法，若聲聞法、若辟支佛法、若菩薩法、若佛法，皆攝入般若波羅蜜中。",
        "translation": "These other good qualities and factors that aid in the path, whether śrāvaka qualities, pratyekabuddha qualities, bodhisattva qualities, or buddha qualities, are all included in the perfection of wisdom.",
        "source": "T25n1509_052:0429c12_2"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_052:0429c14_3"
    },
    {
        "source_sentence": "若摩訶衍，若般若波羅蜜、禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜；",
        "translation": "If it is Mahāyāna, if it is the perfection of wisdom, the perfection of meditation, the perfection of vīrya, the perfection of kṣatriya, the perfection of śīla, and the perfection of sandalwood.",
        "source": "T25n1509_052:0429c14_4"
    },
    {
        "source_sentence": "若色、受、想、行、識，眼、色、眼識、眼觸、眼觸因緣生諸受，乃至意、法、意識、意觸、意觸因緣生諸受；",
        "translation": "“If form, feeling, perception, conceptual identification, volition, and consciousness arise, then the eye, form, eye consciousness, eye contact, eye contact as causal condition, and eye contact as causal condition will give rise to feelings. Up to mind, factors, mental formations, thought con sciousness, mental contact, and mental contact as causal condition will give rise to feelings.",
        "source": "T25n1509_052:0429c16_5"
    },
    {
        "source_sentence": "地種乃至識種；",
        "translation": "The seeds of earth up to the seeds of consciousness.",
        "source": "T25n1509_052:0429c18_6"
    },
    {
        "source_sentence": "四念處乃至八聖道分；",
        "translation": "The four abodes of mindfulness up to the eightfold noble path.",
        "source": "T25n1509_052:0429c19_7"
    },
    {
        "source_sentence": "空、無相、無作解脫門；",
        "translation": "The liberation door of emptiness, signlessness, and noncontrivance.",
        "source": "T25n1509_052:0429c19_8"
    },
    {
        "source_sentence": "及諸善法，若有漏、若無漏，若有為、若無為，若苦諦、集諦、滅諦、道諦，若欲界、若色界、若無色界，若內空乃至無法有法空；",
        "translation": "And all the wholesome factors are either impure or pure, conditioned or unconditioned; they are of the truth of suffering, of the truth of origin, of the truth of cessation, and of the truth of the path; if they belong to the realm of sexual passion, to the realm of form, or to the formless realm; if they be internal emptiness, up to non-existent emptiness of things",
        "source": "T25n1509_052:0429c20_9"
    },
    {
        "source_sentence": "諸三昧門、諸陀羅尼門；",
        "translation": "the approaches of concentration and the approaches to enlightening beings’ spells;",
        "source": "T25n1509_052:0429c22_10"
    },
    {
        "source_sentence": "佛十力乃至十八不共法；",
        "translation": "The ten powers of buddhas up to the eighteen unique qualities.",
        "source": "T25n1509_052:0429c23_11"
    },
    {
        "source_sentence": "若佛、佛法、法性、如、實際、不可思議性、涅槃——是一切諸法皆不合不散、無色、無形、無對，一相，所謂無相。",
        "translation": "If buddhas, buddha-dharmas, dharma-natures, thusnesses, actualities, inconceivable natures, and nirvāṇa are all things that don't fit together or disperse, formless, formless, formless, and formless, they have one characteristic, which is called formless.",
        "source": "T25n1509_052:0429c23_12"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_052:0429c26_0"
    },
    {
        "source_sentence": "以是因緣故，汝所說摩訶衍，隨順般若波羅蜜。",
        "translation": "Because of these causes and conditions, your explanation of Mahāyāna follows the perfection of prajñāpāramitā.",
        "source": "T25n1509_052:0429c26_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0429c27_2"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_052:0429c27_3"
    },
    {
        "source_sentence": "摩訶衍不異般若波羅蜜，般若波羅蜜不異摩訶衍，般若波羅蜜、摩訶衍無二無別；",
        "translation": "“Great enlightening beings are not different from the transcendent wisdom, and the transcendent wisdom is not different from great enlightening beings. The transcendent wisdom and great enlightening beings are neither two nor different.",
        "source": "T25n1509_052:0429c27_4"
    },
    {
        "source_sentence": "檀波羅蜜不異摩訶衍，摩訶衍不異檀波羅蜜，檀波羅蜜、摩訶衍無二無別；",
        "translation": "The transcendent giving is not different from the Great Vehicle, and the Great Vehicle is not different from the transcendent giving. The transcendent giving and the Great Vehicle are neither two nor different.",
        "source": "T25n1509_052:0429c29_5"
    },
    {
        "source_sentence": "乃至禪波羅蜜亦如是。",
        "translation": "It's likewise with the perfection of meditation.",
        "source": "T25n1509_052:0430a02_6"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_052:0430a02_7"
    },
    {
        "source_sentence": "四念處不異摩訶衍，摩訶衍不異四念處，四念處、摩訶衍無二無別；",
        "translation": "The four foundations of mindfulness are not different from Mahayana, and Mahayana is not different from the four foundations of mindfulness; the four foundations of mindfulness and Mahayana are neither two nor different.",
        "source": "T25n1509_052:0430a02_8"
    },
    {
        "source_sentence": "乃至十八不共法不異摩訶衍，摩訶衍不異十八不共法，十八不共法、摩訶衍無二無別。",
        "translation": "The 18 distinctive qualities don't differ from Mahāyāna, the Mahāyāna doesn't differ from the 18 distinctive qualities, and the 18 distinctive qualities and Mahāyāna are not two or different.",
        "source": "T25n1509_052:0430a04_9"
    },
    {
        "source_sentence": "以是因緣故，須菩提！",
        "translation": "Because of these causes and conditions, Subhūti!",
        "source": "T25n1509_052:0430a06_10"
    },
    {
        "source_sentence": "汝說摩訶衍即是說般若波羅蜜。」",
        "translation": "You say that Mahāyāna is the teaching of the perfection of wisdom.",
        "source": "T25n1509_052:0430a06_11"
    },
    {
        "source_sentence": "【論】者言：富樓那雖自無疑，為新學鈍根者不解義一而名字異，故發問。",
        "translation": "[Commentary]: Although Pūrṇa himself has no doubts, he asks a question because newly trained people with dull faculties don't understand that the meaning is one and the names are different.",
        "source": "T25n1509_052:0430a08_0"
    },
    {
        "source_sentence": "須菩提即以其事白佛：「佛法甚深，我所說者將無有失？」",
        "translation": "Suppository then told the Buddha about this matter, The Buddha's teaching is so profound that there won't be any error in what I teach?",
        "source": "T25n1509_052:0430a09_1"
    },
    {
        "source_sentence": "佛答：「汝說摩訶衍，隨順般若，無有違錯。」",
        "translation": "The Buddha answered, You say that Mahāyāna follows the teaching of prajñā without any disobedience.",
        "source": "T25n1509_052:0430a11_2"
    },
    {
        "source_sentence": "此義初已論之，今佛為說隨順因緣，所謂三乘所攝一切善法皆合聚在般若波羅蜜中。",
        "translation": "This meaning has been discussed at the beginning, but now the Buddha teaches that it follows causes and conditions, which is to say that all good qualities included in the three vehicles are collected together in the perfection of prajñā.",
        "source": "T25n1509_052:0430a12_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_052:0430a14_4"
    },
    {
        "source_sentence": "一切三乘善法皆為涅槃故。",
        "translation": "All the good qualities of the three vehicles are all for the sake of nirvāṇa.",
        "source": "T25n1509_052:0430a14_5"
    },
    {
        "source_sentence": "涅槃門有三種：一切法皆入空門、無相、無作門。",
        "translation": "There are three kinds of nirvāṇa gates: all dharmas enter the gate of emptiness, the gate of signlessness, and the gate of noncontrivance.",
        "source": "T25n1509_052:0430a15_6"
    },
    {
        "source_sentence": "如持戒能生禪定，禪定能生實智慧，不著世間故。",
        "translation": "Just as observing precepts can give rise to meditation, and meditation can give rise to real wisdom because it doesn't cling to the world.",
        "source": "T25n1509_052:0430a16_7"
    },
    {
        "source_sentence": "何等三乘助道法攝在般若中？",
        "translation": "What are the three vehicles of aid to the path that are included in prajñā?",
        "source": "T25n1509_052:0430a17_8"
    },
    {
        "source_sentence": "所謂六波羅蜜，三十七品、三脫門，佛十力、四無所畏、四無礙智、大慈大悲、十八不共法、無錯謬相、常捨行。",
        "translation": "The so-called six perfections are the thirty-seven chapters and three gates of liberation, the Buddha's ten powers, four fearlessnesses, four unhindered cognitions, great kindness and compassion, 18 distinctive qualities, no mistaken characteristics, and constant equanimity.",
        "source": "T25n1509_052:0430a18_9"
    },
    {
        "source_sentence": "此中三十七品、三脫門是三乘共法，六波羅蜜是菩薩法，十力乃至常捨行是佛法。",
        "translation": "The thirty-seven and three gates of liberation are the common dharma of the three vehicles, the six perfections are the bodhisattva dharma, the ten powers up to the practice of constant equanimity are the buddha dharma.",
        "source": "T25n1509_052:0430a20_10"
    },
    {
        "source_sentence": "有人言：「六波羅蜜有具足、有不具足。",
        "translation": "Some people say, The six perfections are complete and incomplete.",
        "source": "T25n1509_052:0430a22_11"
    },
    {
        "source_sentence": "不具足者共二乘法，具足者獨菩薩法。」",
        "translation": "Those who aren't fully endowed share the teachings of the two vehicles, and those who are fully endowed are the only bodhisattva teachings.",
        "source": "T25n1509_052:0430a23_12"
    },
    {
        "source_sentence": "復次，摩訶衍空，般若波羅蜜亦空，空義一故，須菩提隨順無錯。",
        "translation": "Furthermore, Mahāyāna is empty, and the prajñāpāramitā is also empty because the meaning of emptiness is one, so there's no mistake in following and following enlightenment.",
        "source": "T25n1509_052:0430a24_13"
    },
    {
        "source_sentence": "如般若波羅蜜空，五波羅蜜乃至如、法性、實際、不可思議性、涅槃亦如是。",
        "translation": "Just as the prajñāpāramitā is empty, so are the five perfections up to thusness, Dharma nature, reality, inconceivability, and nirvāṇa.",
        "source": "T25n1509_052:0430a25_14"
    },
    {
        "source_sentence": "復次，從般若波羅蜜乃至涅槃，皆是不合、不散、無色、無形、無對，一相，所謂無相。",
        "translation": "Furthermore, from the perfection of wisdom up to nirvāṇa, they all lack unity, dispersal, formlessness, formlessness, and formlessness, and have one characteristic, which is called formlessness.",
        "source": "T25n1509_052:0430a27_15"
    },
    {
        "source_sentence": "是同相故，說「摩訶衍則是般若波羅蜜，摩訶衍、般若波羅蜜無二無別故」。",
        "translation": "Because they are the same in characteristics, it's said that Mahāyāna is the perfection of wisdom, and Mahāyāna and the perfection of wisdom are not two or different.",
        "source": "T25n1509_052:0430a29_16"
    },
    {
        "source_sentence": "大智度論釋十無品第二十五",
        "translation": "Mahāprajñāpāramitā-śāstra explains the twenty-fifth chapter of the ten kinds of nonexistence",
        "source": "T25n1509_052:0430b02_0"
    },
    {
        "source_sentence": "【經】慧命須菩提白佛言：「世尊！",
        "translation": "[Sutra] Wisdom Life Subhūti said to the Buddha, Bhagavān!",
        "source": "T25n1509_052:0430b03_0"
    },
    {
        "source_sentence": "菩薩摩訶薩前際不可得，後際不可得，中際不可得。",
        "translation": "The bodhisattva Mahāsattva's prior end is unobtainable, the subsequent end is unobtainable, and the middle end is unobtainable.",
        "source": "T25n1509_052:0430b03_1"
    },
    {
        "source_sentence": "色無邊故，當知菩薩摩訶薩亦無邊；",
        "translation": "Because form has no limit, you should know that great enlightening beings also have no limit.",
        "source": "T25n1509_052:0430b04_2"
    },
    {
        "source_sentence": "受、想、行、識無邊故，當知菩薩摩訶薩亦無邊。",
        "translation": "Because feeling, perception, volition, and consciousness are limitless, you should know that the bodhisattva-mahāsattva is also limitless.",
        "source": "T25n1509_052:0430b05_3"
    },
    {
        "source_sentence": "色是菩薩摩訶薩，是亦不可得；",
        "translation": "Form is the great enlightening being, which is also ungraspable.",
        "source": "T25n1509_052:0430b06_4"
    },
    {
        "source_sentence": "受、想、行、識是菩薩摩訶薩，是亦不可得。",
        "translation": "Feeling, perception, volition, volition, and consciousness are bodhisattva-mahāsattvas, which are also unobtainable.",
        "source": "T25n1509_052:0430b07_5"
    },
    {
        "source_sentence": "如是，世尊！",
        "translation": "So it is, Bhagavān!",
        "source": "T25n1509_052:0430b08_6"
    },
    {
        "source_sentence": "於一切種、一切處求菩薩不可得。",
        "translation": "Seeking bodhisattvas in all kinds and places is unobtainable.",
        "source": "T25n1509_052:0430b08_7"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_052:0430b09_8"
    },
    {
        "source_sentence": "我當教何等菩薩摩訶薩般若波羅蜜？",
        "translation": "What kind of bodhisattva-mahāsattva prajñāpāramit will I teach?",
        "source": "T25n1509_052:0430b09_9"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_052:0430b10_10"
    },
    {
        "source_sentence": "菩薩摩訶薩但有名字。",
        "translation": "The bodhisattva Mahāsattva only has names.",
        "source": "T25n1509_052:0430b10_11"
    },
    {
        "source_sentence": "如說我名字，我畢竟不生。",
        "translation": "Just as you say my name, I won't arise after all.",
        "source": "T25n1509_052:0430b11_12"
    },
    {
        "source_sentence": "如我，諸法亦如是無自性。",
        "translation": "Just as self, so are all dharmas without an own-nature.",
        "source": "T25n1509_052:0430b11_13"
    },
    {
        "source_sentence": "何等色畢竟不生？",
        "translation": "What form doesn't arise after all?",
        "source": "T25n1509_052:0430b12_14"
    },
    {
        "source_sentence": "何等受、想、行、識畢竟不生？",
        "translation": "What are feeling, perception, volition, and consciousness that are ultimately unarisen?",
        "source": "T25n1509_052:0430b12_15"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_052:0430b13_16"
    },
    {
        "source_sentence": "是畢竟不生，不名為色；",
        "translation": "They are not called form because they do not arise after all.",
        "source": "T25n1509_052:0430b13_17"
    },
    {
        "source_sentence": "是畢竟不生，不名為受、想、行、識。",
        "translation": "It's ultimately unarisen, and it's not called feeling, perception, volition, or consciousness.",
        "source": "T25n1509_052:0430b14_18"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_052:0430b14_19"
    },
    {
        "source_sentence": "若畢竟不生法，當教誰是般若波羅蜜耶？",
        "translation": "If they ultimately don't give rise to dharmas, who will teach them the perfection of wisdom?",
        "source": "T25n1509_052:0430b15_0"
    },
    {
        "source_sentence": "離畢竟不生，亦無菩薩行阿耨多羅三藐三菩提。",
        "translation": "Being free of ultimate nonarising, there's also no bodhisattva who practices unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_052:0430b16_0"
    },
    {
        "source_sentence": "若菩薩聞作是說，心不沒、不悔、不驚、不怖、不畏，當知是菩薩摩訶薩能行般若波羅蜜。」",
        "translation": "If a bodhisattva hears this teaching and doesn't desist, doesn't regret, isn't frightened, isn't terrified, and isn't afraid, you should know that this is the bodhisattva Mahāsattva who can practice the perfection of prajñāpāramitā.",
        "source": "T25n1509_052:0430b17_1"
    },
    {
        "source_sentence": "舍利弗問：「須菩提！",
        "translation": "Śāriputra asked, Suppository!",
        "source": "T25n1509_052:0430b19_2"
    },
    {
        "source_sentence": "何因緣故言『菩薩摩訶薩前際不可得，後際不可得，中際不可得』？",
        "translation": "Why does it say, 'The bodhisattva Mahāsattva's prior end is unobtainable, the subsequent end is unobtainable, and the middle end is unobtainable'?",
        "source": "T25n1509_052:0430b19_3"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_052:0430b20_4"
    },
    {
        "source_sentence": "何因緣故言『色無邊故，當知菩薩亦無邊；",
        "translation": "“World-honored One, why do you say that because form has no limit, know that enlightening beings also have no limit?",
        "source": "T25n1509_052:0430b21_5"
    },
    {
        "source_sentence": "受、想、行、識無邊故，當知菩薩亦無邊』？",
        "translation": "Because feeling, perception, volition, volition, and consciousness are limitless, should you know that the bodhisattva is also limitless?'",
        "source": "T25n1509_052:0430b22_6"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_052:0430b22_7"
    },
    {
        "source_sentence": "何因緣故言『色是菩薩，是亦不可得；",
        "translation": "What is the reason for saying that form is a bodhisattva and that it cannot be obtained?",
        "source": "T25n1509_052:0430b23_8"
    },
    {
        "source_sentence": "受、想、行、識是菩薩，是亦不可得』？",
        "translation": "If feeling, perception, volition, volition, and consciousness are bodhisattvas, is this also unobtainable?",
        "source": "T25n1509_052:0430b23_9"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_052:0430b24_10"
    },
    {
        "source_sentence": "何因緣故言『於一切種、一切處，菩薩不可得，當教何等菩薩般若波羅蜜』？",
        "translation": "What is the reason it's said, 'In all kinds and all places, bodhisattvas can't attain them; what kind of bodhisattva prajñāpāramitā should they teach?'",
        "source": "T25n1509_052:0430b24_11"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_052:0430b26_12"
    },
    {
        "source_sentence": "何因緣故言『菩薩摩訶薩但有名字』？",
        "translation": "Why does it say, 'The bodhisattva Mahāsattva only has names?'",
        "source": "T25n1509_052:0430b26_13"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_052:0430b27_14"
    },
    {
        "source_sentence": "何因緣故言『如說我名字，我畢竟不生；",
        "translation": "What is the reason they say, “As you give my name, I will never arise” after all?",
        "source": "T25n1509_052:0430b27_15"
    },
    {
        "source_sentence": "如我，諸法亦如是無自性。",
        "translation": "Just as self, so are all dharmas without an own-nature.",
        "source": "T25n1509_052:0430b28_16"
    },
    {
        "source_sentence": "何等色畢竟不生，何等受、想、行、識畢竟不生』？",
        "translation": "What forms are ultimately unarisen, and what feelings, perceptions, volitions, and consciousnesses are ultimately unarisen?'",
        "source": "T25n1509_052:0430b29_17"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_052:0430c01_18"
    },
    {
        "source_sentence": "何因緣故言『畢竟不生，不名為色？",
        "translation": "What is the reason it's said, 'It doesn't arise after all, and it's not called form?'",
        "source": "T25n1509_052:0430c01_19"
    },
    {
        "source_sentence": "畢竟不生，不名為受、想、行、識』？",
        "translation": "After all, it doesn't arise, isn't it called feeling, perception, volition, or consciousness?",
        "source": "T25n1509_052:0430c02_0"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_052:0430c02_1"
    },
    {
        "source_sentence": "何因緣故言『若畢竟不生法，當教誰是般若波羅蜜耶』？",
        "translation": "What is the reason it's said, 'If there are ultimately unarisen dharmas, who will you teach them to be the prajñāpāramitā?'",
        "source": "T25n1509_052:0430c02_2"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_052:0430c04_3"
    },
    {
        "source_sentence": "何因緣故言『離畢竟不生，亦無菩薩行阿耨多羅三藐三菩提』？",
        "translation": "Why does it say, 'There's no bodhisattva who practices unsurpassed, correct, and complete enlightenment apart from the ultimate nonarising?'",
        "source": "T25n1509_052:0430c04_4"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_052:0430c05_5"
    },
    {
        "source_sentence": "何因緣故言『若菩薩聞作是說，心不沒、不悔、不驚、不怖、不畏，若能如是行，是名菩薩摩訶薩行般若波羅蜜』？」",
        "translation": "What are the reasons why it's called 'If a bodhisattva hears this teaching and doesn't desist, doesn't repent, isn't frightened, isn't terrified, and isn't afraid, and if he can do so, this is called a bodhisattva-mahāsattva practicing the perfection of prajñāpāramitā?'",
        "source": "T25n1509_052:0430c05_6"
    },
    {
        "source_sentence": "爾時，須菩提報舍利弗言：「眾生無所有故，菩薩前際不可得；",
        "translation": "It was then that Subhūti reported to Śāriputra, saying, Because sentient beings lack existence, the bodhisattva’s past cannot be obtained.",
        "source": "T25n1509_052:0430c08_7"
    },
    {
        "source_sentence": "眾生空故，菩薩前際不可得；",
        "translation": "Because sentient beings are empty, the bounds of enlightening beings cannot be obtained.",
        "source": "T25n1509_052:0430c09_8"
    },
    {
        "source_sentence": "眾生離故，菩薩前際不可得。",
        "translation": "Because sentient beings are separated, the bodhisattva's prior limit is unobtainable.",
        "source": "T25n1509_052:0430c10_9"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0430c10_10"
    },
    {
        "source_sentence": "色無有故，菩薩前際不可得；",
        "translation": "Because form does not exist, the former limits of enlightening beings cannot be found.",
        "source": "T25n1509_052:0430c11_11"
    },
    {
        "source_sentence": "受、想、行、識無有故，菩薩前際不可得。",
        "translation": "Because feeling, perception, volition, and consciousness are nonexistent, the bodhisattva's prior end is unobtainable.",
        "source": "T25n1509_052:0430c11_12"
    },
    {
        "source_sentence": "色空故，菩薩前際不可得；",
        "translation": "Because form is empty, the former limits of enlightening beings cannot be found.",
        "source": "T25n1509_052:0430c12_13"
    },
    {
        "source_sentence": "受、想、行、識空故，菩薩前際不可得。",
        "translation": "Because feeling, perception, volition, and consciousness are empty, the bodhisattva's prior end is unobtainable.",
        "source": "T25n1509_052:0430c13_14"
    },
    {
        "source_sentence": "色離故，菩薩前際不可得；",
        "translation": "Because form is free from form, the former end of enlightening beings cannot be found.",
        "source": "T25n1509_052:0430c14_0"
    },
    {
        "source_sentence": "受、想、行、識離故，菩薩前際不可得。",
        "translation": "Because feeling, perception, volition, volition, and consciousness are free, the bodhisattva's prior end is unobtainable.",
        "source": "T25n1509_052:0430c14_1"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0430c15_2"
    },
    {
        "source_sentence": "色性無故，菩薩前際不可得；",
        "translation": "Because the nature of form is nonexistent, the past lives of enlightening beings cannot be obtained.",
        "source": "T25n1509_052:0430c15_3"
    },
    {
        "source_sentence": "受、想、行、識性無故，菩薩前際不可得。",
        "translation": "Because the nature of feeling, perception, volition, and consciousness are absent, the bodhisattva's prior end is unobtainable.",
        "source": "T25n1509_052:0430c16_4"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T25n1509_052:0430c17_0"
    },
    {
        "source_sentence": "檀波羅蜜無有故，菩薩前際不可得；",
        "translation": "Because there is no transcendent giving, the enlightening beings cannot attain it.",
        "source": "T25n1509_052:0430c17_1"
    },
    {
        "source_sentence": "尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜無有故，菩薩前際不可得。",
        "translation": "Because the pāramitā of śīla, the pāramitā of kṣatriya, the pāramitā of vīrya, the pāramitā of meditation, and the pāramitā of prajñā are nonexistent, the bodhisattva's prior limit is unobtainable.",
        "source": "T25n1509_052:0430c18_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0430c20_1"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0430c20_2"
    },
    {
        "source_sentence": "空中前際不可得、後際不可得、中際不可得；",
        "translation": "The first part of space is ungraspable, the second part is ungraspable, and the middle part is ungraspable.",
        "source": "T25n1509_052:0430c20_3"
    },
    {
        "source_sentence": "空不異菩薩，菩薩不異前際。",
        "translation": "Emptiness doesn't differ from bodhisattvas, and bodhisattvas don't differ from the prior.",
        "source": "T25n1509_052:0430c21_4"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0430c22_5"
    },
    {
        "source_sentence": "空、菩薩、前際，是諸法無二無別。",
        "translation": "Emptiness, bodhisattvas, and the prior realms are dharmas that are neither two nor distinct.",
        "source": "T25n1509_052:0430c22_6"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T25n1509_052:0430c22_7"
    },
    {
        "source_sentence": "菩薩前際不可得。",
        "translation": "The bodhisattva's prior state is unobtainable.",
        "source": "T25n1509_052:0430c23_8"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T25n1509_052:0430c23_9"
    },
    {
        "source_sentence": "檀波羅蜜空故，檀波羅蜜離故，檀波羅蜜性無故，菩薩前際不可得；",
        "translation": "Because the transcendent practice of giving is empty, because the transcendent practice of giving is free from it, and because the nature of transcendence of giving is nonexistent, enlightening beings cannot attain a prior state.",
        "source": "T25n1509_052:0430c24_0"
    },
    {
        "source_sentence": "尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜；",
        "translation": "The perfection of śīla, the perfection of kṣatriya, the perfection of vīrya, and the perfection of dhyāna.",
        "source": "T25n1509_052:0430c25_1"
    },
    {
        "source_sentence": "般若波羅蜜空故，般若波羅蜜離故，般若波羅蜜性無故，菩薩前際不可得。",
        "translation": "Because the prajñāpāramitā is empty, because the prajñāpāramitā is free, and because the nature of the prajñāpāramitā is absent, the bodhisattva's prior end is unobtainable.",
        "source": "T25n1509_052:0430c26_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0430c28_3"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0430c28_4"
    },
    {
        "source_sentence": "空中前際不可得、後際不可得、中際不可得；",
        "translation": "The first part of space is ungraspable, the second part is ungraspable, and the middle part is ungraspable.",
        "source": "T25n1509_052:0430c28_5"
    },
    {
        "source_sentence": "空不異菩薩，菩薩亦不異前際。",
        "translation": "Emptiness doesn't differ from bodhisattvas, and bodhisattvas don't differ from the prior.",
        "source": "T25n1509_052:0430c29_6"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0431a01_7"
    },
    {
        "source_sentence": "空、菩薩、前際，是諸法無二無別。",
        "translation": "Emptiness, bodhisattvas, and the prior realms are dharmas that are neither two nor distinct.",
        "source": "T25n1509_052:0431a01_8"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T25n1509_052:0431a02_9"
    },
    {
        "source_sentence": "菩薩前際不可得。",
        "translation": "The bodhisattva's prior state is unobtainable.",
        "source": "T25n1509_052:0431a03_0"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T25n1509_052:0431a03_1"
    },
    {
        "source_sentence": "內空無所有故，菩薩前際不可得；",
        "translation": "Because internal emptiness has no existence, the enlightening being’s past cannot be found.",
        "source": "T25n1509_052:0431a03_2"
    },
    {
        "source_sentence": "乃至無法有法空無所有故，菩薩前際不可得。",
        "translation": "It's because the emptiness of dharmas that don't exist and lack existence doesn't exist, so the bodhisattva's prior end is unobtainable.",
        "source": "T25n1509_052:0431a04_3"
    },
    {
        "source_sentence": "內空空故、內空離故、內空性無故，乃至無法有法空空故、離故、性無故，菩薩前際不可得。",
        "translation": "Because internal emptiness is empty because it's empty, internal emptiness is free of emptiness, the nature of internal emptiness is nonexistent, and there's no dharma that doesn't exist because it's empty, free of emptiness, and its nature is nonexistent, the bodhisattva's prior end is unobtainable.",
        "source": "T25n1509_052:0431a05_4"
    },
    {
        "source_sentence": "餘如上說。",
        "translation": "The rest are as explained above.",
        "source": "T25n1509_052:0431a07_5"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T25n1509_052:0431a07_6"
    },
    {
        "source_sentence": "四念處無所有故，菩薩前際不可得；",
        "translation": "Because the four abodes of mindfulness have no existence, enlightening beings cannot go before them.",
        "source": "T25n1509_052:0431a08_7"
    },
    {
        "source_sentence": "四念處空故、離故、性無故，菩薩前際不可得。",
        "translation": "Because the fourth abode of mindfulness is empty, because it's free, and because its nature is nonexistent, the bodhisattva's prior end is unobtainable.",
        "source": "T25n1509_052:0431a08_8"
    },
    {
        "source_sentence": "乃至十八不共法無所有故，菩薩前際不可得；",
        "translation": "Because the eighteen unique qualities of enlightening beings have no existence, the former part of enlightening beings cannot be found.",
        "source": "T25n1509_052:0431a09_9"
    },
    {
        "source_sentence": "十八不共法空故、離故、性無故，菩薩前際不可得。",
        "translation": "Because the eighteen distinctive qualities are empty, separate, and nonexistent in nature, the bodhisattva's prior end is unobtainable.",
        "source": "T25n1509_052:0431a10_10"
    },
    {
        "source_sentence": "餘如上說。",
        "translation": "The rest are as explained above.",
        "source": "T25n1509_052:0431a12_11"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T25n1509_052:0431a12_12"
    },
    {
        "source_sentence": "菩薩前際不可得。",
        "translation": "The bodhisattva's prior state is unobtainable.",
        "source": "T25n1509_052:0431a12_13"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T25n1509_052:0431a13_14"
    },
    {
        "source_sentence": "一切三昧門、一切陀羅尼門無有故，菩薩前際不可得；",
        "translation": "Because all approaches to concentration and all approaches to enlightening beings’ spells are nonexistent, the former part of enlightening beings cannot be found.",
        "source": "T25n1509_052:0431a13_15"
    },
    {
        "source_sentence": "三昧門、陀羅尼門空故、離故、性無故，菩薩前際不可得。",
        "translation": "Because the approach of samādhi and the approach of dhāraṇī are empty, because they're free, and because their natures are nonexistent, the bodhisattva's prior end is unobtainable.",
        "source": "T25n1509_052:0431a14_16"
    },
    {
        "source_sentence": "餘如上說。",
        "translation": "The rest are as explained above.",
        "source": "T25n1509_052:0431a15_17"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T25n1509_052:0431a16_18"
    },
    {
        "source_sentence": "法性無有故，菩薩前際不可得；",
        "translation": "Because the essence of dharmas does not exist, enlightening beings cannot attain a prior state.",
        "source": "T25n1509_052:0431a16_19"
    },
    {
        "source_sentence": "法性空故、離故、性無故，菩薩前際不可得。",
        "translation": "Because the Dharma nature is empty, because it's free, and because its nature is nonexistent, the bodhisattva's prior end is unobtainable.",
        "source": "T25n1509_052:0431a17_20"
    },
    {
        "source_sentence": "餘如上說。",
        "translation": "The rest are as explained above.",
        "source": "T25n1509_052:0431a18_21"
    },
    {
        "source_sentence": "復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T25n1509_052:0431a18_22"
    },
    {
        "source_sentence": "如無有故、空故、離故、性無故，實際無有故、空故、離故、性無故，不可思議性無有故、空故、離故、性無故，菩薩前際不可得。",
        "translation": "Just as because there's no existence, emptiness, separation, nonexistence, and nonexistence in essence, the actuality has no existence, emptiness, separation, nonexistence, and nonexistence in essence, and because the inconceivable nature has no existence, emptiness, separation, and nonexistence in essence, the bodhisattva's prior end is unobtainable.",
        "source": "T25n1509_052:0431a18_23"
    },
    {
        "source_sentence": "餘如上說。",
        "translation": "The rest are as explained above.",
        "source": "T25n1509_052:0431a21_24"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T25n1509_052:0431a21_25"
    },
    {
        "source_sentence": "聲聞無有故，菩薩前際不可得；",
        "translation": "Because śrāvakas do not exist, the past lives of enlightening beings cannot be obtained.",
        "source": "T25n1509_052:0431a21_26"
    },
    {
        "source_sentence": "聲聞空故、離故、性無故，菩薩前際不可得。",
        "translation": "Because śrāvakas are empty, secluded, and nonexistent in nature, the bodhisattva's prior end is unobtainable.",
        "source": "T25n1509_052:0431a22_27"
    },
    {
        "source_sentence": "辟支佛無有故、空故、離故、性無故，菩薩前際不可得。",
        "translation": "Because the pratyekabuddha has no existence, because it's empty, because it's free, and because its nature is nonexistent, the bodhisattva's prior end is unobtainable.",
        "source": "T25n1509_052:0431a23_28"
    },
    {
        "source_sentence": "佛無有故、空故、離故、性無故，菩薩前際不可得。",
        "translation": "Because the Buddha doesn't exist, because it's empty, because it's free, and because its nature is nonexistent, the bodhisattva's prior end is unobtainable.",
        "source": "T25n1509_052:0431a24_29"
    },
    {
        "source_sentence": "阿耨多羅三藐三菩提無有故乃至性無故，菩薩前際不可得。",
        "translation": "Because the unsurpassed, correct, and complete enlightenment doesn't exist or even because its nature doesn't exist, the bodhisattva's prior end is unobtainable.",
        "source": "T25n1509_052:0431a25_30"
    },
    {
        "source_sentence": "「復次，一切種智無有故乃至性無故，菩薩前際不可得。",
        "translation": "Furthermore, because all kinds of cognition lack existence and even the nature lack existence, the bodhisattva's prior end is unobtainable.",
        "source": "T25n1509_052:0431a27_31"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0431a28_32"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0431a28_33"
    },
    {
        "source_sentence": "空，前際不可得、後際不可得、中際不可得，菩薩不可得。",
        "translation": "When emptiness is unobtainable at the front end, unobtainable at the back end, and unobtainable at the middle end, the bodhisattva is unobtainable.",
        "source": "T25n1509_052:0431a28_34"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0431a29_35"
    },
    {
        "source_sentence": "空，不異菩薩，亦不異前際；",
        "translation": "Emptiness is not different from enlightening beings, and neither is it different from the past.",
        "source": "T25n1509_052:0431b01_36"
    },
    {
        "source_sentence": "空、菩薩、前際，是諸法無二無別。",
        "translation": "Emptiness, bodhisattvas, and the prior realms are dharmas that are neither two nor distinct.",
        "source": "T25n1509_052:0431b01_37"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T25n1509_052:0431b02_38"
    },
    {
        "source_sentence": "菩薩前際不可得，後際、中際亦如是。」",
        "translation": "The bodhisattva's prior period is unobtainable, and so are the subsequent and middle periods.",
        "source": "T25n1509_052:0431b02_39"
    },
    {
        "source_sentence": "【論】問曰：上已說「菩薩、菩薩字不可得，為誰說般若波羅蜜」，今何以更說？",
        "translation": "[Commentary] Q: As explained above, the words bodhisattva and bodhisattva are unobtainable, so who explains the perfection of prajñā for whom? Why is it further explained now?",
        "source": "T25n1509_052:0431b04_0"
    },
    {
        "source_sentence": "答曰：不應作是問！",
        "translation": "Answer: You shouldn't ask this question!",
        "source": "T25n1509_052:0431b05_1"
    },
    {
        "source_sentence": "須菩提空行第一，常樂說空；",
        "translation": "Enlightenment is the foremost in practice in terms of emptiness, always gladly explaining emptiness.",
        "source": "T25n1509_052:0431b06_2"
    },
    {
        "source_sentence": "若有所說，常以空門利益眾生。",
        "translation": "If someone teaches anything, they always use the approach of emptiness to benefit sentient beings.",
        "source": "T25n1509_052:0431b06_3"
    },
    {
        "source_sentence": "復次，上略說，是中十種廣分別菩薩不可得。",
        "translation": "Furthermore, the above briefly explains that these ten kinds of extensively discriminated bodhisattvas are unobtainable.",
        "source": "T25n1509_052:0431b07_4"
    },
    {
        "source_sentence": "行者若觀諸法空，隨順無相、無作；",
        "translation": "Practitioners observe the emptiness of all things, following signlessness and unmanifesting.",
        "source": "T25n1509_052:0431b08_5"
    },
    {
        "source_sentence": "以無作心故，不欲有所作，尚不能自作利益，何況利益人！",
        "translation": "Because of their unconstructed mind, they don't want to do anything, and they can't yet benefit themselves, so why wouldn't they benefit others?",
        "source": "T25n1509_052:0431b09_6"
    },
    {
        "source_sentence": "若人住我心中，能分別諸法善不善相，集諸善法、捨不善法；",
        "translation": "If someone abides in my mind, they will be able to distinguish the characteristics of good and bad dharmas. They will accumulate wholesome states and abandon unwholesome states.",
        "source": "T25n1509_052:0431b10_7"
    },
    {
        "source_sentence": "今佛說：「般若波羅蜜中，不應計我心，不應分別諸法，但行眾善。」",
        "translation": "Now, the Buddha says, In the perfection of wisdom, you shouldn't discriminate self or mind, and you shouldn't discriminate dharmas but simply practice many good qualities.",
        "source": "T25n1509_052:0431b12_8"
    },
    {
        "source_sentence": "是事為難。",
        "translation": "This is a difficult thing.",
        "source": "T25n1509_052:0431b13_9"
    },
    {
        "source_sentence": "行者作是念：「若無我者，為誰修善？」",
        "translation": "The practitioner thought, If there's no self, who will cultivate goodness?",
        "source": "T25n1509_052:0431b14_10"
    },
    {
        "source_sentence": "先有我，今以般若波羅蜜故無，心生憂戚。",
        "translation": "Formerly there was a self, but now it's nonexistent because of the perfection of wisdom, and sorrow arises in my mind.",
        "source": "T25n1509_052:0431b14_11"
    },
    {
        "source_sentence": "是故須菩提更重說：「我，從本已來無，非先有今無。」",
        "translation": "That's why Suppository again said, 'The self hasn't existed since the distant past; it wasn't previously existent and doesn't exist now.'",
        "source": "T25n1509_052:0431b15_12"
    },
    {
        "source_sentence": "行者如是如是本來自無，今無所失，故無所憂。",
        "translation": "The practitioner thus and thus thus originally has nothing, but now there's nothing to lose, so there's nothing to worry about.",
        "source": "T25n1509_052:0431b17_13"
    },
    {
        "source_sentence": "譬如深根大樹，不可以一斫能辦，多用斧力乃能斷；",
        "translation": "Good man, it is like a tree with deep roots that cannot be cut down by the power of an axe even if one stroke of the brush were to pull it up.",
        "source": "T25n1509_052:0431b18_14"
    },
    {
        "source_sentence": "菩薩空亦如是，不可一說便得，以是故廣分別。",
        "translation": "So it is with the bodhisattva's emptiness, which can't be attained in a single statement; therefore, it's explained in detail.",
        "source": "T25n1509_052:0431b19_15"
    },
    {
        "source_sentence": "須菩提問佛時，作是念：「若定有菩薩法，應三世通有。",
        "translation": "When Subhūti asked the Buddha, he had this thought, If there were a bodhisattva's teaching, it would exist in all three times.",
        "source": "T25n1509_052:0431b20_16"
    },
    {
        "source_sentence": "今前世中無有菩薩。",
        "translation": "In a previous life, there were no bodhisattvas.",
        "source": "T25n1509_052:0431b21_17"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0431b22_18"
    },
    {
        "source_sentence": "前世無初故。",
        "translation": "It's because there was no beginning in the prior life.",
        "source": "T25n1509_052:0431b22_19"
    },
    {
        "source_sentence": "未來世亦如是，未有因緣故。",
        "translation": "So it will be in the future: because there are no reasons for this.",
        "source": "T25n1509_052:0431b22_20"
    },
    {
        "source_sentence": "前後相待故有中間，若無前後則無中間。」",
        "translation": "Because the prior and subsequent are mutually exclusive, there's a middle; if there's no prior and subsequent, there's no middle.",
        "source": "T25n1509_052:0431b23_21"
    },
    {
        "source_sentence": "若謂「五眾是菩薩」；",
        "translation": "Suppose someone says, The five groups of people are bodhisattvas.",
        "source": "T25n1509_052:0431b24_22"
    },
    {
        "source_sentence": "五眾無邊，如先種種因緣說五眾畢竟空故無量無邊，無量無邊故同無為法。",
        "translation": "The five collections are boundless because, as has been said previously in various reasons that the five collections are ultimately empty, they are unlimited and boundless; because they are unlimited and boundless, they are the same as unconditioned factors.",
        "source": "T25n1509_052:0431b25_0"
    },
    {
        "source_sentence": "若菩薩無邊者，是事不然！",
        "translation": "If a bodhisattva has no limit, that's not the case!",
        "source": "T25n1509_052:0431b26_1"
    },
    {
        "source_sentence": "以此因緣故，菩薩不可得，當為誰說？",
        "translation": "Because of these causes and conditions, the bodhisattva is unobtainable; to whom will he teach it?",
        "source": "T25n1509_052:0431b27_2"
    },
    {
        "source_sentence": "常一切處、一切種、一切時求菩薩不可得，當為誰說？",
        "translation": "To whom will you teach that all places, all kinds, and all times of seeking bodhisattvas are unobtainable?",
        "source": "T25n1509_052:0431b28_3"
    },
    {
        "source_sentence": "如我畢竟不生、空無所有，五眾亦如是畢竟不生、無所有。",
        "translation": "Just as the self ultimately doesn't arise and emptiness has nothing, so do the five saṃgha ultimately don't arise and have nothing.",
        "source": "T25n1509_052:0431b29_4"
    },
    {
        "source_sentence": "既無眾生及五眾法，云何有菩薩？",
        "translation": "Since there are no sentient beings or the five dharmas, how could there be bodhisattvas?",
        "source": "T25n1509_052:0431c01_5"
    },
    {
        "source_sentence": "問曰：眾生及五眾法畢竟不生，解是法者，即是菩薩？",
        "translation": "Q: Are sentient beings and the five dharmas ultimately unarisen, and someone who understands these dharmas is a bodhisattva?",
        "source": "T25n1509_052:0431c02_6"
    },
    {
        "source_sentence": "答曰：「畢竟不生」不名為色，不名為受想行識。",
        "translation": "Answer: After all, it doesn't arise and isn't called form or feeling, perception, volition, or consciousness.",
        "source": "T25n1509_052:0431c03_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0431c05_0"
    },
    {
        "source_sentence": "五眾是生相，畢竟不生中無是分別。",
        "translation": "The five collections are the characteristic of arising, and there's no such distinction in what doesn't arise after all.",
        "source": "T25n1509_052:0431c05_1"
    },
    {
        "source_sentence": "五眾畢竟不生，不可以教化；",
        "translation": "The fivefold assembly is ultimately unarisen, and cannot be taught.",
        "source": "T25n1509_052:0431c06_0"
    },
    {
        "source_sentence": "離畢竟不生，亦無菩薩行道，當教誰？",
        "translation": "Being free of ultimate nonarising, there's also no bodhisattva who practices the path, so whom should he teach?",
        "source": "T25n1509_052:0431c06_1"
    },
    {
        "source_sentence": "菩薩聞是不怖、不畏，是為能行菩薩道。",
        "translation": "A bodhisattva who hears and isn't frightened or fearless is someone who can practice the bodhisattva path.",
        "source": "T25n1509_052:0431c07_2"
    },
    {
        "source_sentence": "問曰：我與菩薩是一物，云何以我喻菩薩？",
        "translation": "Q: I and the bodhisattva are one thing, so how can we use self as a metaphor for the bodhisattva?",
        "source": "T25n1509_052:0431c08_3"
    },
    {
        "source_sentence": "答曰：是般若波羅蜜中一切法空，初學不得便為說空！",
        "translation": "Answer: This is the emptiness of all dharmas in the prajñāpāramitā, and it's explained as emptiness for beginners who can't attain it!",
        "source": "T25n1509_052:0431c09_4"
    },
    {
        "source_sentence": "先當分別罪福，捨罪修福德；",
        "translation": "They should first distinguish the merit of sins and abandon sins in order to cultivate virtue.",
        "source": "T25n1509_052:0431c10_5"
    },
    {
        "source_sentence": "福德果報無常，無常故生苦，是故捨福厭世間，求道入涅槃。",
        "translation": "The rewards of merit are impermanent, and because they are impermanent, suffering arises; therefore, he abandons merit and becomes disillusioned with the world and seeks the path to enter nirvāṇa.",
        "source": "T25n1509_052:0431c11_6"
    },
    {
        "source_sentence": "爾時，應作是念：「因我故生諸煩惱，是我於六識中求不可得，但以顛倒故著我。」",
        "translation": "At that point, you should think, Because of the afflictions that arise because of self, I'm seeking what's unobtainable in the six consciousnesses, but it's because of mistaken attachment to self.",
        "source": "T25n1509_052:0431c13_7"
    },
    {
        "source_sentence": "是故解無我易，易可受化。",
        "translation": "Therefore, it's easy to understand that selflessness is easy, and it's easy to be subject to transformation.",
        "source": "T25n1509_052:0431c15_0"
    },
    {
        "source_sentence": "若言「色空」，則難解；",
        "translation": "If you say form is void, it will be difficult to understand.",
        "source": "T25n1509_052:0431c15_1"
    },
    {
        "source_sentence": "雖耳聞說空，眼常見實。",
        "translation": "Even though the ear hears and speaks of emptiness, the eye sees what's real.",
        "source": "T25n1509_052:0431c16_2"
    },
    {
        "source_sentence": "是故先破惡罪中我，後破一切諸法。",
        "translation": "That's why they first destroy the self in bad sins and then all dharmas.",
        "source": "T25n1509_052:0431c16_3"
    },
    {
        "source_sentence": "一切佛弟子，得道者自知自證無我，未得道者信餘法空，不能如信無我，是故以無我為喻。",
        "translation": "All the Buddha's disciples who attain the path know for themselves that they realize selflessness, but those who haven't yet attained the path believe in the emptiness of other dharmas and can't thus believe in selflessness; therefore, selflessness is used as a metaphor.",
        "source": "T25n1509_052:0431c17_4"
    },
    {
        "source_sentence": "此中須菩提說一切法空，推無菩薩，用無我為喻；",
        "translation": "Here Subhūti teaches the emptiness of all dharmas, using selflessness as a metaphor to deduce the absence of enlightening beings.",
        "source": "T25n1509_052:0431c19_5"
    },
    {
        "source_sentence": "以小喻大，如石蜜喻甘露。",
        "translation": "It's because the lesser is metaphor for the greater, just as rock honey is metaphor for ambrosia.",
        "source": "T25n1509_052:0431c21_0"
    },
    {
        "source_sentence": "問曰：舍利弗知空無我義，何以故事事致問？",
        "translation": "Q: Knowing the meaning of emptiness and selflessness, why did Śāriputra ask questions about stories?",
        "source": "T25n1509_052:0431c21_1"
    },
    {
        "source_sentence": "答曰：須菩提聲聞人，德不如菩薩，而於佛前說深般若，新學菩薩心或生疑。",
        "translation": "Answer: Suppose a śrāvaka whose virtue is inferior to that of a bodhisattva and who teaches profound prajñā in front of the Buddha, and newly trained bodhisattvas might have doubts in their minds.",
        "source": "T25n1509_052:0431c22_2"
    },
    {
        "source_sentence": "上佛雖言「汝說摩訶衍隨順般若」，猶謂佛將順須菩提。",
        "translation": "Although the above Buddha said, You teach that Mahāyāna follows prajñā, it still means that the Buddha is about to follow Suppository enlightenment.",
        "source": "T25n1509_052:0431c24_3"
    },
    {
        "source_sentence": "舍利弗欲斷此疑，故發問。",
        "translation": "Śāriputra wanted to stop this doubt, so he asked a question.",
        "source": "T25n1509_052:0431c25_4"
    },
    {
        "source_sentence": "復次，佛欲共須菩提說般若，乃至終竟；",
        "translation": "“Furthermore, the Buddha wanted to share with Subhūti his teaching of prajñā, up to the ultimate end.",
        "source": "T25n1509_052:0431c26_5"
    },
    {
        "source_sentence": "是故舍利弗事事質問，令須菩提善分別深義，使眾人敬信。",
        "translation": "That's why Śāriputra asked questions about things, so that Suppositories of enlightenment would skillfully discern the profound meaning and cause people to respect and believe in it.",
        "source": "T25n1509_052:0431c27_6"
    },
    {
        "source_sentence": "以是故問：「過去世中菩薩不可得，乃至不恐不怖。」",
        "translation": "That's why he asked, In a past life, bodhisattvas were unobtainable, even to the point where they weren't afraid or frightened.",
        "source": "T25n1509_052:0431c28_7"
    },
    {
        "source_sentence": "須菩提答義：我、眾生、人即是一物。",
        "translation": "Suppository of enlightenment answers, 'I, sentient beings, and people are one thing.'",
        "source": "T25n1509_052:0431c29_8"
    },
    {
        "source_sentence": "未得道時，名凡夫人；",
        "translation": "When they have not yet attained enlightenment, they are called worldlings.",
        "source": "T25n1509_052:0432a01_9"
    },
    {
        "source_sentence": "初入道乃至阿羅漢，名聲聞人；",
        "translation": "The first to enter the path and up to arhats are called sravakas.",
        "source": "T25n1509_052:0432a02_10"
    },
    {
        "source_sentence": "觀因緣法悟空小深，小愍眾生，名辟支佛人；",
        "translation": "He observed the dharmas as causes and conditions to realize the small depth of emptiness, pitying sentient beings for the small.",
        "source": "T25n1509_052:0432a02_11"
    },
    {
        "source_sentence": "深入空法，行六波羅蜜，大慈大悲，是名菩薩人——功德別異故，名字亦異。",
        "translation": "Deeply penetrating the teaching of emptiness, practicing the six perfections and great kindness and compassion, these are called bodhisattvas whose merits are distinct but whose names are also different.",
        "source": "T25n1509_052:0432a04_0"
    },
    {
        "source_sentence": "如我、眾生、人一事，以眼見事故名見者，意得故名知者，受苦樂故名受者。",
        "translation": "For example, when a self, sentient beings, or person see one thing with their eyes, it's called seeing because the mind attains it, and it's called knowing because it experiences pain and pleasure, so it's called feeling.",
        "source": "T25n1509_052:0432a05_1"
    },
    {
        "source_sentence": "是我、眾生、人等，先已說種種因緣無故，菩薩亦應無。",
        "translation": "Because self, sentient beings, humans, and so forth had previously explained that various causes and conditions are absent, the bodhisattva would also be absent.",
        "source": "T25n1509_052:0432a07_2"
    },
    {
        "source_sentence": "是故須菩提語舍利弗：「眾生無故，三世中無菩薩。」",
        "translation": "That's why Suppository said to Śāriputra, Because sentient beings are absent, there are no bodhisattvas in the three worlds.",
        "source": "T25n1509_052:0432a08_3"
    },
    {
        "source_sentence": "問曰：五眾和合有菩薩，菩薩應無，五眾應有！",
        "translation": "Q: If the five groups of people combine to have bodhisattvas, there should be no bodhisattva, and the five groups of people should have them!",
        "source": "T25n1509_052:0432a09_4"
    },
    {
        "source_sentence": "答曰：為破是事故言「無眾生、無我」，無我故則五眾無所屬，無所屬故空，空故無菩薩。",
        "translation": "Answer: In order to refute this, he says, There are no sentient beings and no self, and because there are no self, the five aggregates lack what they belong to, emptiness because there are no attachments, and bodhisattvas don't exist because of emptiness.",
        "source": "T25n1509_052:0432a10_5"
    },
    {
        "source_sentence": "問曰：若五眾空者，空即是菩薩？",
        "translation": "Q: If the five aggregates are empty, is emptiness the bodhisattva?",
        "source": "T25n1509_052:0432a13_0"
    },
    {
        "source_sentence": "答曰：五眾空亦非菩薩，空、無所有、無分別故。",
        "translation": "Answer: The five aggregates of emptiness are also not bodhisattvas, because they are empty, lack existence, and lack discrimination.",
        "source": "T25n1509_052:0432a13_1"
    },
    {
        "source_sentence": "五眾離、五眾無性，亦無菩薩。",
        "translation": "The five aggregates are free of the five aggregates and the five aggregates lack nature, and there's no bodhisattva.",
        "source": "T25n1509_052:0432a14_2"
    },
    {
        "source_sentence": "若說無菩薩，則三世皆無。",
        "translation": "If it's said that there are no bodhisattvas, then the three times are nonexistent.",
        "source": "T25n1509_052:0432a15_3"
    },
    {
        "source_sentence": "觀是五眾等世間法、六波羅蜜等道法，是名菩薩；",
        "translation": "Observing these worldly dharmas such as the five assemblies and the six transcendent ways of enlightenment is called an enlightening being.",
        "source": "T25n1509_052:0432a16_4"
    },
    {
        "source_sentence": "是法空故，菩薩亦空。",
        "translation": "Because these things are empty, the bodhisattva is also empty.",
        "source": "T25n1509_052:0432a17_5"
    },
    {
        "source_sentence": "此中佛自說因緣：「諸法空不異菩薩，菩薩不異空，菩薩空、三世空，無二無別。」",
        "translation": "Here, the Buddha himself explains the causes and conditions for this, The emptiness of dharmas doesn't differ from bodhisattvas, bodhisattvas don't differ from emptiness, and bodhisattvas are empty and the three worlds are empty, without duality or distinction.",
        "source": "T25n1509_052:0432a17_6"
    },
    {
        "source_sentence": "從六波羅蜜乃至一切種智，行是諸法故，名為菩薩；",
        "translation": "From the six transcendent ways up to omniscience, because they practice these things, they are called enlightening beings.",
        "source": "T25n1509_052:0432a19_7"
    },
    {
        "source_sentence": "是諸法空故，菩薩亦空。",
        "translation": "Because these things are empty, the bodhisattva is also empty.",
        "source": "T25n1509_052:0432a20_8"
    },
    {
        "source_sentence": "此中法空，聲聞、辟支佛得是空故，名聲聞、辟支佛人；",
        "translation": "These people are called śrāvakas and pratyekabuddhas because of the emptiness of dharmas. Because śrāvakas and pratyekabuddhas realize this emptiness, they are called śrāvakas and pratyekabuddhas.",
        "source": "T25n1509_052:0432a21_9"
    },
    {
        "source_sentence": "聲聞、辟支佛人空故，菩薩亦如是。",
        "translation": "Because śrāvakas and pratyekbuddhas are empty of people, so are bodhisattvas.",
        "source": "T25n1509_052:0432a22_10"
    },
    {
        "source_sentence": "【經】「如舍利弗言：『色無邊故，當知菩薩亦無邊；",
        "translation": "[Sutra] Just as Śāriputra said, 'Because form has no limit, you should know that bodhisattvas also have no limit.",
        "source": "T25n1509_052:0432a24_0"
    },
    {
        "source_sentence": "受、想、行、識無邊故，當知菩薩亦無邊。』",
        "translation": "Because feeling, perception, volition, volition, and consciousness are limitless, you should know that the bodhisattva is also limitless.'",
        "source": "T25n1509_052:0432a25_1"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0432a25_2"
    },
    {
        "source_sentence": "色如虛空，受、想、行、識如虛空。",
        "translation": "Form is like space, and feeling, perception, volition, and consciousness are like space.",
        "source": "T25n1509_052:0432a26_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0432a26_4"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0432a26_5"
    },
    {
        "source_sentence": "如虛空邊不可得、中不可得，無邊無中故，但說名虛空。",
        "translation": "Just as the extent of space is unobtainable and the middle is unobtainable, because there's no limit and no middle, but it's simply called space.",
        "source": "T25n1509_052:0432a27_6"
    },
    {
        "source_sentence": "如是，舍利弗！",
        "translation": "So it is, Śāriputra!",
        "source": "T25n1509_052:0432a28_7"
    },
    {
        "source_sentence": "色邊不可得、中不可得，是色空故，空中亦無邊亦無中；",
        "translation": "Because the extremes of form are ungraspable and the middle is ungraspable. Because matter is emptiness, space also has neither extremes nor middle:",
        "source": "T25n1509_052:0432a28_8"
    },
    {
        "source_sentence": "受、想、行；",
        "translation": "Feeling, conceptual identification and formations:",
        "source": "T25n1509_052:0432a29_9"
    },
    {
        "source_sentence": "識邊不可得、中不可得，識空故，空中亦無邊、亦無中。",
        "translation": "Because the extremes of consciousness are ungraspable and the middle is ungraspable, and because consciousness is empty, space has no limit and no middle.",
        "source": "T25n1509_052:0432b01_0"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T25n1509_052:0432b02_1"
    },
    {
        "source_sentence": "色無邊故，當知菩薩亦無邊；",
        "translation": "Because form has no limit, you should know that enlightening beings also have no limit.",
        "source": "T25n1509_052:0432b02_2"
    },
    {
        "source_sentence": "受、想、行、識無邊故，當知菩薩亦無邊。",
        "translation": "Because feeling, perception, volition, and consciousness are limitless, you should know that the bodhisattva is also limitless.",
        "source": "T25n1509_052:0432b03_3"
    },
    {
        "source_sentence": "乃至十八不共法亦如是。",
        "translation": "It's likewise with the 18 distinctive qualities.",
        "source": "T25n1509_052:0432b04_4"
    },
    {
        "source_sentence": "「如舍利弗言：『色是菩薩，是亦不可得；",
        "translation": "“Suppose Śāriputra said, ‘Form is a bodhisattva; this too cannot be obtained.",
        "source": "T25n1509_052:0432b04_5"
    },
    {
        "source_sentence": "受、想、行、識是菩薩，是亦不可得。』",
        "translation": "Feeling, perception, volition, volition, and consciousness are bodhisattvas, which are also unobtainable.'",
        "source": "T25n1509_052:0432b05_6"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0432b06_7"
    },
    {
        "source_sentence": "色、色相空，受、想、行，識、識相空；",
        "translation": "Form and the characteristic marks of form are void; feeling, perception and conditioning are void; consciousness and the characteristic marks of consciousness are void.",
        "source": "T25n1509_052:0432b06_8"
    },
    {
        "source_sentence": "檀波羅蜜、檀波羅蜜相空，乃至般若波羅蜜亦如是；",
        "translation": "The transcendent of giving and the transcendent of giving are characterized by emptiness, and so is the transcendent of wisdom.",
        "source": "T25n1509_052:0432b07_9"
    },
    {
        "source_sentence": "內空、內空相空，乃至無法有法空、無法有法空相空；",
        "translation": "Emptiness of internal emptiness, emptiness of characteristics of internal emptiness, emptiness of dharmas that do not exist and emptiness of characteristics of dharmas that do not exist.",
        "source": "T25n1509_052:0432b08_10"
    },
    {
        "source_sentence": "四念處、四念處相空，乃至十八不共法、十八不共法相空；",
        "translation": "The four applications of mindfulness and the characteristics of the four applications of mindfulness are empty, up to the emptiness of the eighteen unique qualities and the characteristics of the eighteen unique qualities.",
        "source": "T25n1509_052:0432b09_11"
    },
    {
        "source_sentence": "如、法性、實際，不可思議性、不可思議性相空；",
        "translation": "“Thusness, the essence of things, and reality are inconceivable by their inconceivable natures and characteristics.",
        "source": "T25n1509_052:0432b10_12"
    },
    {
        "source_sentence": "三昧門、三昧門相空，陀羅尼門、陀羅尼門相空；",
        "translation": "The aspects of concentration and the aspects of concentration are void, while the aspects of dhāraṇī and the aspects of dhāraṇī are void.",
        "source": "T25n1509_052:0432b11_13"
    },
    {
        "source_sentence": "一切智、一切智相空，道種智、道種智相空，一切種智、一切種智相空；",
        "translation": "The characteristic marks of omniscience and omniscience are void, the characteristic marks of knowledge of the path and knowledge of the path are void, and the characteristic marks of knowledge of all kinds and knowledge of all kinds are void.",
        "source": "T25n1509_052:0432b12_14"
    },
    {
        "source_sentence": "聲聞乘、聲聞乘相空，辟支佛乘、辟支佛乘相空，佛乘、佛乘相空；",
        "translation": "The vehicle of the sravakas and the vehicle of the sravakas are void; the vehicles of the pratyekabuddhas and the vehicles of the pratyekabuddhas are void; the buddha vehicle and the enlightened vehicle are void.",
        "source": "T25n1509_052:0432b14_15"
    },
    {
        "source_sentence": "聲聞人、聲聞人相空，辟支佛、辟支佛相空，佛、佛相空。",
        "translation": "The characteristics of śrāvakas and śrāvakas are empty, the characteristics of pratyekabuddhas and pratyekabuddhas are empty, and the characteristics of buddhas and buddhas are empty.",
        "source": "T25n1509_052:0432b15_16"
    },
    {
        "source_sentence": "空中色不可得，受、想、行、識不可得。",
        "translation": "Form in space is unobtainable, and feeling, perception, volition, and consciousness are unobtainable.",
        "source": "T25n1509_052:0432b17_17"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T25n1509_052:0432b17_18"
    },
    {
        "source_sentence": "色是菩薩，是亦不可得；",
        "translation": "Form is the enlightening being, and form is also ungraspable.",
        "source": "T25n1509_052:0432b18_19"
    },
    {
        "source_sentence": "受、想、行、識是菩薩，是亦不可得。",
        "translation": "Feeling, perception, volition, and consciousness are bodhisattvas, which are also unobtainable.",
        "source": "T25n1509_052:0432b18_20"
    },
    {
        "source_sentence": "「如舍利弗言：『何因緣故，於一切種、一切處，菩薩不可得，當教何等菩薩般若波羅蜜？』",
        "translation": "As Śāriputra said, 'What are the causes and conditions that make all kinds and all places unobtainable for bodhisattvas, and what should they teach about the bodhisattva's prajñāpāramitā?'",
        "source": "T25n1509_052:0432b19_21"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0432b21_22"
    },
    {
        "source_sentence": "色，色中不可得；",
        "translation": "Form is ungraspable within form.",
        "source": "T25n1509_052:0432b21_23"
    },
    {
        "source_sentence": "色，受中不可得。",
        "translation": "Form is unobtainable in sensation.",
        "source": "T25n1509_052:0432b22_0"
    },
    {
        "source_sentence": "受，受中不可得；",
        "translation": "Feeling is ungraspable within feeling.",
        "source": "T25n1509_052:0432b22_1"
    },
    {
        "source_sentence": "受，色中不可得；",
        "translation": "Feeling is unobtainable in matter.",
        "source": "T25n1509_052:0432b22_2"
    },
    {
        "source_sentence": "受，想中不可得。",
        "translation": "Feeling is unobtainable in perception.",
        "source": "T25n1509_052:0432b23_3"
    },
    {
        "source_sentence": "想，想中不可得；",
        "translation": "Consciousness is ungraspable within conceptions.",
        "source": "T25n1509_052:0432b23_4"
    },
    {
        "source_sentence": "想，色、受中不可得；",
        "translation": "Consciousness is ungraspable in matter and sensation.",
        "source": "T25n1509_052:0432b23_5"
    },
    {
        "source_sentence": "想，行中不可得。",
        "translation": "conceptions, which are unobtainable in practice.",
        "source": "T25n1509_052:0432b24_6"
    },
    {
        "source_sentence": "行，行中不可得；",
        "translation": "Practice is ungraspable in practice.",
        "source": "T25n1509_052:0432b24_7"
    },
    {
        "source_sentence": "行，色、受、想中不可得；",
        "translation": "Conditioned things are ungraspable in matter, sensation, or ideation.",
        "source": "T25n1509_052:0432b24_8"
    },
    {
        "source_sentence": "行，識中不可得。",
        "translation": "Conditioned things are unobtainable in consciousness.",
        "source": "T25n1509_052:0432b25_9"
    },
    {
        "source_sentence": "識，識中不可得，識，色、受、想、行中不可得。",
        "translation": "Consciousness is unobtainable in consciousness, and consciousness is unobtainable in form, sensation, perception, and volition.",
        "source": "T25n1509_052:0432b25_10"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0432b26_11"
    },
    {
        "source_sentence": "眼，眼中不可得；",
        "translation": "The eye is ungraspable by the eye.",
        "source": "T25n1509_052:0432b26_12"
    },
    {
        "source_sentence": "眼，耳中不可得。",
        "translation": "In the eye, it's unobtainable in the ear.",
        "source": "T25n1509_052:0432b27_13"
    },
    {
        "source_sentence": "耳，耳中不可得；",
        "translation": "Ear, which is ungraspable in the ear.",
        "source": "T25n1509_052:0432b27_14"
    },
    {
        "source_sentence": "耳，眼中不可得；",
        "translation": "Ear, which is unobtainable to the eye.",
        "source": "T25n1509_052:0432b27_15"
    },
    {
        "source_sentence": "耳，鼻中不可得。",
        "translation": "Ear, it's unobtainable in the nose.",
        "source": "T25n1509_052:0432b28_16"
    },
    {
        "source_sentence": "鼻，鼻中不可得；",
        "translation": "The nose is ungraspable within the nose.",
        "source": "T25n1509_052:0432b28_17"
    },
    {
        "source_sentence": "鼻，眼、耳中不可得；",
        "translation": "The nose is unobtainable in the eyes and ears.",
        "source": "T25n1509_052:0432b28_18"
    },
    {
        "source_sentence": "鼻，舌中不可得。",
        "translation": "The nose is unobtainable in the tongue.",
        "source": "T25n1509_052:0432b29_19"
    },
    {
        "source_sentence": "舌，舌中不可得；",
        "translation": "A voice is ungraspable within a voice.",
        "source": "T25n1509_052:0432b29_20"
    },
    {
        "source_sentence": "舌，眼、耳、鼻中不可得；",
        "translation": "The voice is not to be found in the eyes, ears, or nose.",
        "source": "T25n1509_052:0432c01_0"
    },
    {
        "source_sentence": "舌，身中不可得。",
        "translation": "tongue, which is unobtainable in the body.",
        "source": "T25n1509_052:0432c01_1"
    },
    {
        "source_sentence": "身，身中不可得；",
        "translation": "The body is ungraspable within the body.",
        "source": "T25n1509_052:0432c01_2"
    },
    {
        "source_sentence": "身，眼、耳、鼻、舌中不可得；",
        "translation": "The body is not found in the eyes, ears, nose, or tongue.",
        "source": "T25n1509_052:0432c02_3"
    },
    {
        "source_sentence": "身，意中不可得。",
        "translation": "In body, it's unobtainable in mind.",
        "source": "T25n1509_052:0432c02_4"
    },
    {
        "source_sentence": "意，意中不可得；",
        "translation": "manas is ungraspable within manas.",
        "source": "T25n1509_052:0432c03_5"
    },
    {
        "source_sentence": "意，眼、耳、鼻、舌、身中不可得。",
        "translation": "Mind, which is unobtainable in the eye, ear, nose, tongue, and body.",
        "source": "T25n1509_052:0432c03_6"
    },
    {
        "source_sentence": "六入、六識、六觸、六觸因緣生受亦如是。",
        "translation": "It's likewise with the six sense-fields, six consciousnesses, six tactile sensations, and six tactile causes and conditions that give rise to sensation.",
        "source": "T25n1509_052:0432c04_0"
    },
    {
        "source_sentence": "檀波羅蜜乃至般若波羅蜜，內空乃至無法有法空，四念處乃至十八不共法，一切三昧門、一切陀羅尼門，性法乃至辟支佛法，初地乃至十地，一切智、道種智、一切種智亦如是；",
        "translation": "The perfection of giving up to the perfection of wisdom, the emptiness of internal emptiness up to the emptiness of dharmas that do not exist, the four abodes of mindfulness up to the eighteen unique qualities, all samādhi approaches and all dhāraṇī approaches, the essential principles up to the teachings of the pratyekabuddhas, the first ground up to the tenth ground, omniscience",
        "source": "T25n1509_052:0432c04_1"
    },
    {
        "source_sentence": "須陀洹乃至阿羅漢、辟支佛、菩薩、佛亦如是。",
        "translation": "So it is with stream-winner and even arhats, pratyekabuddhas, bodhisattvas, and buddhas.",
        "source": "T25n1509_052:0432c08_2"
    },
    {
        "source_sentence": "菩薩，菩薩中不可得；",
        "translation": "Enlightening beings are ungraspable in enlightening beings.",
        "source": "T25n1509_052:0432c09_3"
    },
    {
        "source_sentence": "菩薩，般若波羅蜜中不可得。",
        "translation": "Bodhisattva, it's unobtainable in the perfection of wisdom.",
        "source": "T25n1509_052:0432c10_4"
    },
    {
        "source_sentence": "般若波羅蜜，般若波羅蜜中不可得；",
        "translation": "The transcendent wisdom is ungraspable in the transcendent wisdom.",
        "source": "T25n1509_052:0432c11_0"
    },
    {
        "source_sentence": "般若波羅蜜，菩薩中不可得；",
        "translation": "The transcendent wisdom is ungraspable in enlightening beings.",
        "source": "T25n1509_052:0432c11_1"
    },
    {
        "source_sentence": "般若波羅蜜中，教化無所有不可得。",
        "translation": "In the perfection of wisdom, there's nothing to teach that can't be obtained.",
        "source": "T25n1509_052:0432c12_2"
    },
    {
        "source_sentence": "教化中，教化無所有不可得；",
        "translation": "In teaching, there is nothing to teach that cannot be found.",
        "source": "T25n1509_052:0432c13_3"
    },
    {
        "source_sentence": "教化中，菩薩及般若波羅蜜無所有不可得。",
        "translation": "In teaching and transforming, the bodhisattva and the perfection of wisdom have no existence and cannot be obtained.",
        "source": "T25n1509_052:0432c13_4"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0432c14_5"
    },
    {
        "source_sentence": "如是一切法無所有不可得。",
        "translation": "Thus, all dharmas lack existence and are unobtainable.",
        "source": "T25n1509_052:0432c15_6"
    },
    {
        "source_sentence": "以是因緣故，一切種、一切處，菩薩不可得，當教何等菩薩般若波羅蜜？」",
        "translation": "Because of these causes and conditions, all kinds and all places are unobtainable for bodhisattvas, so what kind of bodhisattva prajñāpāramitā should they teach?",
        "source": "T25n1509_052:0432c15_7"
    },
    {
        "source_sentence": "「如舍利弗言：『何因緣故說菩薩摩訶薩但有假名？』",
        "translation": "As Śāriputra said, 'Why does the bodhisattva Mahāsattva only have a nominal name?'",
        "source": "T25n1509_052:0432c17_8"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0432c18_9"
    },
    {
        "source_sentence": "色是假名，受、想、行、識是假名；",
        "translation": "Form is a provisional designation, and feeling, perception, volition, and consciousness are provisional names.",
        "source": "T25n1509_052:0432c18_10"
    },
    {
        "source_sentence": "色名非色，受、想、行，識名非識。",
        "translation": "Form is called form and not form; feeling, conceptual identification and formations are called consciousness and not consciousness.",
        "source": "T25n1509_052:0432c19_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0432c19_12"
    },
    {
        "source_sentence": "名、名相空；",
        "translation": "Names and their characteristics are void.",
        "source": "T25n1509_052:0432c20_13"
    },
    {
        "source_sentence": "若空，則非菩薩。",
        "translation": "If it's empty, then it's not bodhisattva.",
        "source": "T25n1509_052:0432c20_14"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T25n1509_052:0432c20_15"
    },
    {
        "source_sentence": "菩薩但有假名。",
        "translation": "A bodhisattva simply has a nominal name.",
        "source": "T25n1509_052:0432c21_16"
    },
    {
        "source_sentence": "復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T25n1509_052:0432c21_17"
    },
    {
        "source_sentence": "檀波羅蜜但有名字；",
        "translation": "The transcendent practice of giving only has names.",
        "source": "T25n1509_052:0432c21_18"
    },
    {
        "source_sentence": "名字中非有檀波羅蜜，檀波羅蜜中非有名字。",
        "translation": "The perfection of giving doesn't have names in names, and the perfection of giving doesn't have names in names.",
        "source": "T25n1509_052:0432c22_19"
    },
    {
        "source_sentence": "以是因緣故，菩薩但有假名。",
        "translation": "Because of these causes and conditions, the bodhisattva simply has a nominal name.",
        "source": "T25n1509_052:0432c23_20"
    },
    {
        "source_sentence": "尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜。",
        "translation": "The pāramitā of śīla, the pāramitā of caṇḍi, the pāramitā of vīrya, and the pāramitā of meditation.",
        "source": "T25n1509_052:0432c24_0"
    },
    {
        "source_sentence": "般若波羅蜜但有名字；",
        "translation": "The transcendent wisdom has only names.",
        "source": "T25n1509_052:0432c25_1"
    },
    {
        "source_sentence": "名字中無有般若波羅蜜，般若波羅蜜中無有名字。",
        "translation": "In names, there's no prajñā-pāramitā, and in prajñā-pāramitā, there's no name.",
        "source": "T25n1509_052:0432c25_2"
    },
    {
        "source_sentence": "以是因緣故，菩薩但有假名。",
        "translation": "Because of these causes and conditions, the bodhisattva simply has a nominal name.",
        "source": "T25n1509_052:0432c26_3"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0432c27_4"
    },
    {
        "source_sentence": "內空但有名字，乃至無法有法空但有名字，名字中無內空，內空中無名字。",
        "translation": "Internal emptiness only has names, and even if there's no dharma emptiness that has names, there won't be internal emptiness in names, and there won't be names in internal emptiness or internal emptiness.",
        "source": "T25n1509_052:0432c27_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0432c29_6"
    },
    {
        "source_sentence": "名字、內空俱不可得。",
        "translation": "Names and internal emptiness are both unobtainable.",
        "source": "T25n1509_052:0432c29_7"
    },
    {
        "source_sentence": "乃至無法有法空亦如是。",
        "translation": "It's likewise with the emptiness of nonexistence and dharmas.",
        "source": "T25n1509_052:0433a01_8"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T25n1509_052:0433a01_9"
    },
    {
        "source_sentence": "菩薩但有假名。",
        "translation": "A bodhisattva simply has a nominal name.",
        "source": "T25n1509_052:0433a02_10"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0433a02_11"
    },
    {
        "source_sentence": "四念處但有名字，乃至十八不共法但有名字；",
        "translation": "The four applications of mindfulness only have names, up to the eighteen unique factors only have names.",
        "source": "T25n1509_052:0433a02_12"
    },
    {
        "source_sentence": "一切三昧門、一切陀羅尼門，乃至一切種智亦如是。",
        "translation": "It's likewise with all the samādhi approaches, all the dhāraṇī approaches, and even all kinds of cognition.",
        "source": "T25n1509_052:0433a03_13"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T25n1509_052:0433a04_14"
    },
    {
        "source_sentence": "我說菩薩但有假名。」",
        "translation": "I say that bodhisattvas only have nominal names.",
        "source": "T25n1509_052:0433a05_15"
    },
    {
        "source_sentence": "「如舍利弗言：『何因緣故，說我名字畢竟不生？』",
        "translation": "Suppose Śāriputra says, 'What are the reasons why you say my name doesn't arise after all?'",
        "source": "T25n1509_052:0433a05_16"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0433a06_17"
    },
    {
        "source_sentence": "我畢竟不可得，云何當有生？",
        "translation": "After all, the self is ungraspable, so how could there be birth?",
        "source": "T25n1509_052:0433a07_18"
    },
    {
        "source_sentence": "乃至知者、見者畢竟不可得，云何當有生？",
        "translation": "How could there be birth when the knower and the viewer are ultimately unobtainable?",
        "source": "T25n1509_052:0433a07_19"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0433a08_20"
    },
    {
        "source_sentence": "色畢竟不可得，云何當有生？",
        "translation": "Form is ultimately unobtainable, so how could there be birth?",
        "source": "T25n1509_052:0433a08_21"
    },
    {
        "source_sentence": "受、想、行、識畢竟不可得，云何當有生？",
        "translation": "Feeling, perception, volition, and consciousness are ultimately ungraspable, so how could there be birth?",
        "source": "T25n1509_052:0433a09_22"
    },
    {
        "source_sentence": "眼畢竟不可得，乃至意觸因緣生受畢竟不可得，云何當有生？",
        "translation": "How could there be birth when the eye is ultimately unobtainable, or even when sensation arises from the causes and conditions of mental contact is ultimately unobtainable?",
        "source": "T25n1509_052:0433a10_23"
    },
    {
        "source_sentence": "檀波羅蜜畢竟不可得，乃至般若波羅蜜畢竟不可得，云何當有生？",
        "translation": "After all, the perfection of giving is unobtainable, and after all, the perfection of wisdom is unobtainable, how could there be birth?",
        "source": "T25n1509_052:0433a11_24"
    },
    {
        "source_sentence": "內空畢竟不可得，乃至無法有法空畢竟不可得，云何當有生？",
        "translation": "How could there be birth when internal emptiness is ultimately unobtainable and even the emptiness of nonexistent dharmas is ultimately unobtainable?",
        "source": "T25n1509_052:0433a13_25"
    },
    {
        "source_sentence": "四念處畢竟不可得，乃至十八不共法畢竟不可得，云何當有生？",
        "translation": "The four abodes of mindfulness are ultimately unobtainable, and even the 18 distinctive qualities are ultimately unobtainable, so how could there be birth?",
        "source": "T25n1509_052:0433a14_26"
    },
    {
        "source_sentence": "諸三昧門、諸陀羅尼門畢竟不可得，云何當有生？",
        "translation": "The approaches of samādhi and dhāraṇī are ultimately unobtainable, so how could there be birth?",
        "source": "T25n1509_052:0433a16_27"
    },
    {
        "source_sentence": "聲聞乃至佛畢竟不可得，云何當有生？",
        "translation": "śrāvakas and even buddhas are ultimately unobtainable, so how could there be birth?",
        "source": "T25n1509_052:0433a17_28"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T25n1509_052:0433a18_29"
    },
    {
        "source_sentence": "我說：『如我名字，我亦畢竟不生。』」",
        "translation": "I say, 'Suppose my name is self, and I don't arise after all.'",
        "source": "T25n1509_052:0433a18_30"
    },
    {
        "source_sentence": "【論】問曰：心、心數法無形、不可見故可無邊；",
        "translation": "[Commentary] Q: Mind and mental factors are formless and invisible, so they can be limitless.",
        "source": "T25n1509_052:0433a20_0"
    },
    {
        "source_sentence": "色是有形、可見，云何無邊？",
        "translation": "Form has form and can be seen, so why is it limitless?",
        "source": "T25n1509_052:0433a21_1"
    },
    {
        "source_sentence": "答曰：無處不有色，不可得籌量遠近輕重。",
        "translation": "Answer: There's no place that doesn't have form, and it can't be measured by distance or nearness.",
        "source": "T25n1509_052:0433a21_2"
    },
    {
        "source_sentence": "如佛說：四大無處不有，故名為大；",
        "translation": "As the Buddha has said: Because the four elements do not exist in any place, they are therefore called ‘great’.",
        "source": "T25n1509_052:0433a22_3"
    },
    {
        "source_sentence": "不可以五情得其限，不可以斗稱量其多少輕重，是故言「色無邊」。",
        "translation": "They can't obtain their limit with five emotions, and they can't measure the amount of lightness or weight of a bowl by measuring it; therefore, they say form has no limit.",
        "source": "T25n1509_052:0433a23_4"
    },
    {
        "source_sentence": "復次，是色過去時，初始不可得；",
        "translation": "Furthermore, these forms were ungraspable at the beginning of time in the past.",
        "source": "T25n1509_052:0433a25_5"
    },
    {
        "source_sentence": "未來時中，無有恒河沙劫數限色當有盡，是故無後邊；",
        "translation": "In the future, there will be no number of eons as numerous as the grains of sand in the Ganges River; form will have an end. Therefore, there is no limit to it.",
        "source": "T25n1509_052:0433a26_0"
    },
    {
        "source_sentence": "初邊、後邊無故，中亦無。",
        "translation": "Because the first and last extremes are absent, there is also no middle.",
        "source": "T25n1509_052:0433a27_1"
    },
    {
        "source_sentence": "復次，「邊」名色相；",
        "translation": "“Furthermore, extremes are the characteristic of name and form.",
        "source": "T25n1509_052:0433a27_2"
    },
    {
        "source_sentence": "是色分別破散，邊不可得，無有本相。",
        "translation": "These forms are discriminated and dispersed, the extremes are unobtainable, and there are no original characteristics.",
        "source": "T25n1509_052:0433a28_3"
    },
    {
        "source_sentence": "復次，無為法不生不滅故，無數無量無邊；",
        "translation": "“Furthermore, because unconditioned things neither arise nor perish, they are countless, immeasurable, and boundless.",
        "source": "T25n1509_052:0433a29_4"
    },
    {
        "source_sentence": "以法空觀觀色皆空，與虛空及無為同相。",
        "translation": "It's because the contemplation of emptiness of dharmas and the contemplation of form are all empty, which have the same characteristics as space and nothingness.",
        "source": "T25n1509_052:0433b01_0"
    },
    {
        "source_sentence": "無量無數無邊法中，乃至微塵不可得，何況菩薩！",
        "translation": "In measureless, countless, and limitless dharmas, even the smallest particle of it is unobtainable, so why wouldn't a bodhisattva?",
        "source": "T25n1509_052:0433b02_1"
    },
    {
        "source_sentence": "是故說「五眾無邊，菩薩亦無邊」。",
        "translation": "That's why it's said, The five congregations are limitless, and so are the bodhisattvas.",
        "source": "T25n1509_052:0433b03_2"
    },
    {
        "source_sentence": "如色無邊，乃至十八不共法亦如是，隨相分別如先說。",
        "translation": "Just as form has no limit, so it is with the eighteen unique factors. The difference in secondary characteristic marks is as has been said previously.",
        "source": "T25n1509_052:0433b03_3"
    },
    {
        "source_sentence": "是五眾無量無數無邊故，不得言色是菩薩；",
        "translation": "Because these five assemblies are immeasurable, countless, and boundless, one cannot say that form is an enlightening being.",
        "source": "T25n1509_052:0433b05_4"
    },
    {
        "source_sentence": "四眾亦如是。",
        "translation": "The fourfold assembly is likewise.",
        "source": "T25n1509_052:0433b06_5"
    },
    {
        "source_sentence": "復次，色若離心心數法，如草木瓦石，云何名菩薩？",
        "translation": "Furthermore, if form is free of mind and mental factors, like grass, wood, tile, and stone, how are they called bodhisattvas?",
        "source": "T25n1509_052:0433b06_6"
    },
    {
        "source_sentence": "若心心數法離色，則無依止處，亦無所能為，云何名菩薩？",
        "translation": "If mind and mental factors are free of form, then there's no basis or support, and nothing that can be done, so what's called a bodhisattva?",
        "source": "T25n1509_052:0433b07_7"
    },
    {
        "source_sentence": "復次，六波羅蜜、十八空、三十七品，十力乃至十八不共法，如、法性、實際、不可思議性，三解脫門，陀羅尼門、諸三昧門，薩婆若、道智、一切種智，三乘、三乘人，是法若修、若觀，是名菩薩。",
        "translation": "Furthermore, the six perfections, 18 emptinesses, 37 chapters, ten powers up to 18 unique qualities, suchness, Dharma nature, reality, inconceivability, three gates of liberation, dhāraṇī gates and samādhi gates, sarvajña, knowledge of the path, and all kinds of cognition, are called bodhisattvas if they cultivate or contemplate these things",
        "source": "T25n1509_052:0433b09_8"
    },
    {
        "source_sentence": "是法皆以自相空故空，所謂檀波羅蜜、檀波羅蜜相空，乃至佛、佛相空。",
        "translation": "These dharmas are all empty because their own characteristics are empty, which is called the emptiness of the characteristics of the perfection of giving and the perfection of giving, up to the emptiness of the characteristics of buddhas and buddhas.",
        "source": "T25n1509_052:0433b13_0"
    },
    {
        "source_sentence": "「一切處」者，五眾、十二入、十八界，乃至一切種智。",
        "translation": "All places refers to the five congregations, the twelve sense-fields, the 18 realms, and even all kinds of cognition.",
        "source": "T25n1509_052:0433b14_1"
    },
    {
        "source_sentence": "「一切種智」者，十八空、三解脫門。",
        "translation": "The all-inclusive cognition refers to the eighteen kinds of emptiness and the three liberations.",
        "source": "T25n1509_052:0433b15_2"
    },
    {
        "source_sentence": "般若波羅蜜觀若常若無常等，入一門、二門乃至無量門等，是名一切種智。",
        "translation": "If the prajñāpāramitā observes whether permanent or impermanent, and so forth, and enters into one aspect, two aspects, up to an infinite number of aspects, these are called all kinds of cognition.",
        "source": "T25n1509_052:0433b16_3"
    },
    {
        "source_sentence": "求索菩薩不可得。",
        "translation": "The bodhisattva who asks for it can't get it.",
        "source": "T25n1509_052:0433b18_4"
    },
    {
        "source_sentence": "又以自法中無自法，亦無他法。",
        "translation": "It's because there are no self-dharmas in their own dharmas and no other dharmas.",
        "source": "T25n1509_052:0433b18_5"
    },
    {
        "source_sentence": "如此中說：「色，色中不可得；",
        "translation": "In this way, it is said:",
        "source": "T25n1509_052:0433b19_6"
    },
    {
        "source_sentence": "色，受中不可得。",
        "translation": "Form is unobtainable in sensation.",
        "source": "T25n1509_052:0433b19_7"
    },
    {
        "source_sentence": "受，受中不可得；",
        "translation": "Feeling is ungraspable within feeling.",
        "source": "T25n1509_052:0433b20_8"
    },
    {
        "source_sentence": "受，色中不可得；",
        "translation": "Feeling is unobtainable in matter.",
        "source": "T25n1509_052:0433b20_9"
    },
    {
        "source_sentence": "乃至般若波羅蜜，般若波羅蜜中不可得；",
        "translation": "Even the transcendent wisdom of liberation is ungraspable in the transcendent wisdom.",
        "source": "T25n1509_052:0433b21_0"
    },
    {
        "source_sentence": "乃至教化中，教化不可得。」",
        "translation": "Even in teaching and transforming, teaching and transforming are unobtainable.",
        "source": "T25n1509_052:0433b21_1"
    },
    {
        "source_sentence": "「但有名字」者，是五眾破壞散滅，如虛空無異。",
        "translation": "The phrase simply has names refers to the five collections that are destroyed and dispersed, just like space without distinction.",
        "source": "T25n1509_052:0433b22_2"
    },
    {
        "source_sentence": "是菩薩但有名字，如幻化人，假名字中更為立名。",
        "translation": "This bodhisattva simply has names, just like an illusory transformation person who creates names and establishes another name in a nominal name.",
        "source": "T25n1509_052:0433b23_3"
    },
    {
        "source_sentence": "須菩提語舍利弗：「不但菩薩假名字，五眾皆亦假名字；",
        "translation": "Suppository of enlightenment said to Śāriputra: Not only are the bodhisattvas given provisional names, but all the fivefold assembly is also given provisional names.",
        "source": "T25n1509_052:0433b24_4"
    },
    {
        "source_sentence": "假名字中，假名字相不可得，皆入第一義中。",
        "translation": "In nominal names, the characteristics of nominal names are unobtainable, and they all enter into the ultimate truth.",
        "source": "T25n1509_052:0433b26_0"
    },
    {
        "source_sentence": "若如是空者，則非菩薩。」",
        "translation": "If it's thus empty, then it's not bodhisattva.",
        "source": "T25n1509_052:0433b27_0"
    },
    {
        "source_sentence": "復次，六波羅蜜乃至一切種智，行是法故，名為菩薩；",
        "translation": "“Furthermore, because they practice the six transcendent ways and all kinds of knowledge, they are called enlightening beings.",
        "source": "T25n1509_052:0433b27_1"
    },
    {
        "source_sentence": "是法亦假名字，菩薩亦假名字，空無所有。",
        "translation": "These dharmas are also nominal names, and bodhisattvas are also nominal names, for emptiness has no existence.",
        "source": "T25n1509_052:0433b28_2"
    },
    {
        "source_sentence": "是諸法等強為作名，因緣和合故有，亦無其實。",
        "translation": "These dharmas, etc., are forcibly named because they exist due to the conjunction of causes and conditions, but there is no reality in them.",
        "source": "T25n1509_052:0433b29_3"
    },
    {
        "source_sentence": "「我名字畢竟不生」者，如此品初已說。",
        "translation": "The phrase self and names are ultimately unarisen means that they've been explained at the beginning of this chapter.",
        "source": "T25n1509_052:0433c01_4"
    },
    {
        "source_sentence": "此中須菩提亦如眾生空、法空破我，所謂：「我畢竟不可得，乃至知者、見者不可得，云何當有生？",
        "translation": "Here, Suppository also refutes self in terms of the emptiness of sentient beings and the emptiness of dharmas, saying, After all, I am ungraspable, so why wouldn't there be birth?",
        "source": "T25n1509_052:0433c02_5"
    },
    {
        "source_sentence": "五眾畢竟不可得，云何有五眾生？",
        "translation": "How could there be five sentient beings when the five aggregates are ultimately unobtainable?",
        "source": "T25n1509_052:0433c04_6"
    },
    {
        "source_sentence": "乃至意觸因緣生受畢竟不可得，云何當有生？",
        "translation": "How could there be birth when the causes and conditions for mental contact that give rise to sensation are ultimately unobtainable?",
        "source": "T25n1509_052:0433c05_7"
    },
    {
        "source_sentence": "六波羅蜜畢竟不可得，乃至諸陀羅尼門、三昧門、聲聞、辟支佛、佛畢竟不可得，云何當有生？」",
        "translation": "When the six perfections are ultimately unobtainable, even the dhāraṇī teachings, samādhi teachings, śrāvakas, pratyekbuddhas, and buddhas are ultimately unobtainable, how could there be birth?",
        "source": "T25n1509_052:0433c06_8"
    },
    {
        "source_sentence": "若法先有，然後可問生；",
        "translation": "If a factor exists first, then it can be asked to arise later.",
        "source": "T25n1509_052:0433c08_9"
    },
    {
        "source_sentence": "法體先無，云何有生？",
        "translation": "If the essence of dharmas were nonexistent before, how could there be birth?",
        "source": "T25n1509_052:0433c09_10"
    },
    {
        "source_sentence": "【經】「如舍利弗所言：『如我，諸法亦如是無自性。』",
        "translation": "[Sutra] As Śāriputra said, 'Just as I say, so are all dharmas without self-nature.'",
        "source": "T25n1509_052:0433c10_0"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0433c11_0"
    },
    {
        "source_sentence": "諸法和合生故無自性。",
        "translation": "Because the dharmas are combined and produced, there's no self-nature.",
        "source": "T25n1509_052:0433c11_1"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0433c11_2"
    },
    {
        "source_sentence": "何等和合生無自性？",
        "translation": "What is the absence of an essential nature in the arising of a conjunction?",
        "source": "T25n1509_052:0433c11_3"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0433c12_4"
    },
    {
        "source_sentence": "色和合生無自性，受、想、行、識和合生無自性。",
        "translation": "The combination of form and arising has no self-nature, and the combination of feeling, perception, volition, and consciousness to arise has no self-nature.",
        "source": "T25n1509_052:0433c12_5"
    },
    {
        "source_sentence": "眼和合生無自性，乃至意和合生無自性。",
        "translation": "The conjunction of the eye produces no self-nature, and the conjunction of the mind produces no self-nature.",
        "source": "T25n1509_052:0433c13_6"
    },
    {
        "source_sentence": "色乃至法、眼界乃至法界、地種乃至識種、眼觸乃至意觸、眼觸因緣生受乃至意觸因緣生受和合生無自性。",
        "translation": "Form up to dharmas, the eye realm up to the Dharma realm, the earth element up to the consciousness element, eye contact up to mental contact, and feelings that arise from the causes and conditions of eye contact up to feelings that arise from the causes and conditions of mental contact combine to produce no self-nature.",
        "source": "T25n1509_052:0433c14_7"
    },
    {
        "source_sentence": "檀波羅蜜乃至般若波羅蜜和合生無自性。",
        "translation": "The combination of the perfection of giving and even the perfection of wisdom produces no self-nature.",
        "source": "T25n1509_052:0433c16_8"
    },
    {
        "source_sentence": "四念處乃至十八不共法和合生無自性。",
        "translation": "The four abodes of mindfulness up to the conjunction of the 18 distinctive qualities give rise to no self-nature.",
        "source": "T25n1509_052:0433c17_9"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T25n1509_052:0433c18_10"
    },
    {
        "source_sentence": "一切法無常亦不失。」",
        "translation": "All things are impermanent and not lost, either.",
        "source": "T25n1509_052:0433c19_11"
    },
    {
        "source_sentence": "舍利弗問須菩提：「何等法無常亦不失？」",
        "translation": "Śāriputra asked Subhūti, What things are impermanent and not lost?",
        "source": "T25n1509_052:0433c19_12"
    },
    {
        "source_sentence": "須菩提言：「色無常亦不失，受、想、行、識無常亦不失。",
        "translation": "Suppository of enlightenment said, Form is impermanent and not lost, and feeling, perception, volition, and consciousness are impermanent and not lost.",
        "source": "T25n1509_052:0433c20_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0433c21_14"
    },
    {
        "source_sentence": "若法無常，即是動相、即是空相。",
        "translation": "If a thing is impermanent, it's the characteristic of movement and the characteristic of emptiness.",
        "source": "T25n1509_052:0433c21_15"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T25n1509_052:0433c22_16"
    },
    {
        "source_sentence": "一切有為法無常亦不失。",
        "translation": "All conditioned dharmas are impermanent and not lost, either.",
        "source": "T25n1509_052:0433c22_17"
    },
    {
        "source_sentence": "若有漏法、若無漏法，若有記法、若無記法，無常亦不失。",
        "translation": "If there are contaminated dharmas, if there are uncontaminated dharmas, and if there are indeterminate dharmas or indeterminate dharmas, they're impermanent and not lost.",
        "source": "T25n1509_052:0433c23_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0433c24_19"
    },
    {
        "source_sentence": "若法無常，即是動相、即是空相。",
        "translation": "If a thing is impermanent, it's the characteristic of movement and the characteristic of emptiness.",
        "source": "T25n1509_052:0433c25_0"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T25n1509_052:0433c25_1"
    },
    {
        "source_sentence": "一切作法無常亦不失。",
        "translation": "All the created dharmas are impermanent and not lost.",
        "source": "T25n1509_052:0433c26_2"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T25n1509_052:0433c26_3"
    },
    {
        "source_sentence": "一切法非常非滅。」",
        "translation": "All dharmas are neither eternal nor cessation.",
        "source": "T25n1509_052:0433c27_4"
    },
    {
        "source_sentence": "舍利弗言：「何等法非常非滅？」",
        "translation": "Śāriputra said, What are the things that are neither permanent nor impermanent?",
        "source": "T25n1509_052:0433c27_5"
    },
    {
        "source_sentence": "須菩提言：「色非常非滅。",
        "translation": "Suppository of enlightenment said, Form is neither eternal nor cessation.",
        "source": "T25n1509_052:0433c28_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0433c28_7"
    },
    {
        "source_sentence": "性自爾。",
        "translation": "It's natural by nature.",
        "source": "T25n1509_052:0433c28_8"
    },
    {
        "source_sentence": "受、想、行、識非常非滅。",
        "translation": "Feeling, perception, volition, and consciousness are neither permanent nor cessation.",
        "source": "T25n1509_052:0433c29_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0433c29_10"
    },
    {
        "source_sentence": "性自爾。",
        "translation": "It's natural by nature.",
        "source": "T25n1509_052:0433c29_11"
    },
    {
        "source_sentence": "乃至意識因緣生受非常非滅。",
        "translation": "It goes so far as to say that the causes and conditions of consciousness give rise to feelings that are neither permanent nor cessation.",
        "source": "T25n1509_052:0433c29_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0434a01_13"
    },
    {
        "source_sentence": "性自爾。",
        "translation": "It's natural by nature.",
        "source": "T25n1509_052:0434a01_14"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T25n1509_052:0434a02_0"
    },
    {
        "source_sentence": "諸法和合生無自性。",
        "translation": "When the dharmas are combined, they give rise to no self-nature.",
        "source": "T25n1509_052:0434a02_1"
    },
    {
        "source_sentence": "「如舍利弗所言：『何因緣故，色畢竟不生，受、想、行、識畢竟不生？』」",
        "translation": "As Śāriputra said, 'What are the reasons why form doesn't arise after all and feeling, perception, volition, and consciousness don't arise after all?'",
        "source": "T25n1509_052:0434a02_2"
    },
    {
        "source_sentence": "須菩提言：「色非作法，受、想、行、識非作法。",
        "translation": "Suppository of enlightenment said, Form is not a done thing, and feeling, perception, volition, and consciousness are not done things.",
        "source": "T25n1509_052:0434a04_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0434a05_4"
    },
    {
        "source_sentence": "作者不可得故。",
        "translation": "It's because the author is unobtainable.",
        "source": "T25n1509_052:0434a05_5"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0434a05_6"
    },
    {
        "source_sentence": "眼非作法。",
        "translation": "The eye doesn't create dharmas.",
        "source": "T25n1509_052:0434a05_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0434a06_8"
    },
    {
        "source_sentence": "作者不可得故；",
        "translation": "Because the author is ungraspable.",
        "source": "T25n1509_052:0434a06_9"
    },
    {
        "source_sentence": "乃至意亦如是。",
        "translation": "It's likewise with the mind and so forth.",
        "source": "T25n1509_052:0434a06_10"
    },
    {
        "source_sentence": "眼界乃至意觸因緣生受，亦如是。",
        "translation": "The same applies up to feeling that arises from the eye element and up to mental contact as cause and condition:",
        "source": "T25n1509_052:0434a07_0"
    },
    {
        "source_sentence": "復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T25n1509_052:0434a07_1"
    },
    {
        "source_sentence": "一切諸法皆非起非作。",
        "translation": "All dharmas are neither produced nor created.",
        "source": "T25n1509_052:0434a08_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0434a08_3"
    },
    {
        "source_sentence": "作者不可得故。",
        "translation": "It's because the author is unobtainable.",
        "source": "T25n1509_052:0434a08_4"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T25n1509_052:0434a09_5"
    },
    {
        "source_sentence": "色畢竟不生，受、想、行、識畢竟不生。",
        "translation": "Form doesn't arise after all, and feeling, perception, volition, and consciousness don't arise after all.",
        "source": "T25n1509_052:0434a09_6"
    },
    {
        "source_sentence": "「如舍利弗所言：『何因緣故，畢竟不生，是不名為色？",
        "translation": "As Śāriputra said, 'What are the reasons why it doesn't arise after all and isn't called form?'",
        "source": "T25n1509_052:0434a10_7"
    },
    {
        "source_sentence": "畢竟不生，是不名為受、想、行、識？』」",
        "translation": "Is it not called feeling, perception, volition, and consciousness after all when it doesn't arise?'",
        "source": "T25n1509_052:0434a11_8"
    },
    {
        "source_sentence": "須菩提言：「色性空，是空無生、無滅、無住異；",
        "translation": "Suppository of enlightenment said: The nature of matter is emptiness, which has no arising, no passing away, and no abiding.",
        "source": "T25n1509_052:0434a12_9"
    },
    {
        "source_sentence": "受想行識性空，是空無生、無滅、無住異。",
        "translation": "The nature of feeling, perception, volition, and consciousness is emptiness, which has no arising, no cessation, and no abiding difference.",
        "source": "T25n1509_052:0434a13_10"
    },
    {
        "source_sentence": "眼乃至一切有為法性空，是空無生、無滅、無住異。",
        "translation": "The eye or even the emptiness of all conditioned dharmas is emptiness that has no arising, no cessation, and no abiding difference.",
        "source": "T25n1509_052:0434a14_11"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T25n1509_052:0434a15_12"
    },
    {
        "source_sentence": "畢竟不生，是不名色；",
        "translation": "The ultimate nonarising is not name-and-form.",
        "source": "T25n1509_052:0434a15_13"
    },
    {
        "source_sentence": "畢竟不生，是不名受、想、行、識。」",
        "translation": "After all, it doesn't arise, and it's not called feeling, perception, volition, or consciousness.",
        "source": "T25n1509_052:0434a16_14"
    },
    {
        "source_sentence": "「如舍利弗所言：『何因緣故，畢竟不生法，當教是般若波羅蜜耶？』」",
        "translation": "As Śāriputra said, 'What are the causes and conditions for ultimately unarisen dharmas that will be taught as the prajñāpāramitā?'",
        "source": "T25n1509_052:0434a16_15"
    },
    {
        "source_sentence": "須菩提言：「畢竟不生即是般若波羅蜜，般若波羅蜜即是畢竟不生，般若波羅蜜、畢竟不生，無二無別。",
        "translation": "Suppository said, What's ultimately unarisen is the perfection of wisdom, what's ultimately unarisen is the perfection of wisdom, and what's ultimately unarisen is the perfection of wisdom, which is neither two nor distinct.",
        "source": "T25n1509_052:0434a18_16"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T25n1509_052:0434a20_17"
    },
    {
        "source_sentence": "我說畢竟不生，當教是般若波羅蜜耶？」",
        "translation": "Will I teach that this is the perfection of wisdom when I say it's ultimately unarisen?",
        "source": "T25n1509_052:0434a21_18"
    },
    {
        "source_sentence": "「如舍利弗所言：『何因緣故，離畢竟不生，無菩薩行阿耨多羅三藐三菩提？』」",
        "translation": "As Śāriputra said, 'What is the reason why there's no bodhisattva who practices unsurpassed, correct, and complete enlightenment apart from ultimate nonarising?'",
        "source": "T25n1509_052:0434a22_0"
    },
    {
        "source_sentence": "須菩提言：「菩薩摩訶薩行般若波羅蜜時，不見畢竟不生異般若波羅蜜，亦不見畢竟不生異菩薩，畢竟不生及菩薩無二無別。",
        "translation": "Suppository said, When the bodhisattva Mahāsattva practices the perfection of wisdom, he doesn't see the perfection of wisdom that doesn't give rise to dissimilarity after all and doesn't see the perfection of wisdom that doesn't give rise to dissimilar bodhisattvas who don't give rise to dissimilar bodhi in the end, and what doesn't give rise to",
        "source": "T25n1509_052:0434a23_1"
    },
    {
        "source_sentence": "不見畢竟不生異色。",
        "translation": "They don't see that they ultimately don't give rise to different forms.",
        "source": "T25n1509_052:0434a26_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0434a26_3"
    },
    {
        "source_sentence": "是畢竟不生及色無二無別；",
        "translation": "These are the ultimate nonarising and form, which are not two and not distinct.",
        "source": "T25n1509_052:0434a27_4"
    },
    {
        "source_sentence": "不見畢竟不生異受想行識。",
        "translation": "They don't see that they ultimately don't give rise to different feelings, perceptions, volitions, and consciousnesses.",
        "source": "T25n1509_052:0434a27_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0434a28_6"
    },
    {
        "source_sentence": "畢竟不生、受想行識無二無別。",
        "translation": "After all, feeling, perception, volition, and consciousness that don't arise and sensation, perception, volition, and consciousness are not two or different.",
        "source": "T25n1509_052:0434a28_7"
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "It's likewise with all kinds of cognition.",
        "source": "T25n1509_052:0434a29_8"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T25n1509_052:0434a29_9"
    },
    {
        "source_sentence": "離畢竟不生，無菩薩行阿耨多羅三藐三菩提。」",
        "translation": "Being free of ultimate nonarising, there's no bodhisattva who practices unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_052:0434b01_10"
    },
    {
        "source_sentence": "「如舍利弗所言：『何因緣故，菩薩聞作是說，心不沒、不悔，不驚、不怖、不畏，是名菩薩行般若波羅蜜？』」",
        "translation": "As Śāriputra said, 'What are the reasons why a bodhisattva who hears such a teaching and doesn't desist, doesn't repent, isn't frightened, isn't terrified, and isn't afraid is called a bodhisattva practicing the perfection of prajñā?'",
        "source": "T25n1509_052:0434b02_11"
    },
    {
        "source_sentence": "須菩提言：「菩薩摩訶薩不見諸法有覺知相，見一切諸法如夢、如幻、如炎、如影、如化。",
        "translation": "Suppository of enlightenment said, The bodhisattva Mahāsattva doesn't see that all dharmas have the characteristics of perception and knowing, and he sees all dharmas as dreams, illusory, mirages, flames, shadows, and transformations.",
        "source": "T25n1509_052:0434b04_12"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_052:0434b06_13"
    },
    {
        "source_sentence": "以是因緣故，菩薩聞作是說，心不沒、不悔、不驚、不怖、不畏。」",
        "translation": "Because of these causes and conditions, when the bodhisattva hears this teaching, his mind doesn't sink, doesn't repent, isn't frightened, isn't terrified, and isn't afraid.",
        "source": "T25n1509_052:0434b06_14"
    },
    {
        "source_sentence": "【論】者言：「諸法無有自性」者，以性空破諸法各各性。",
        "translation": "[Commentary] The phrase saying, All dharmas lack self-nature means that the emptiness of nature destroys the distinctive natures of dharmas.",
        "source": "T25n1509_052:0434b08_0"
    },
    {
        "source_sentence": "此中須菩提自說：「諸法和合生，無有自性。」",
        "translation": "Here, Subhūti himself says, All dharmas are produced by combining and there's no self-nature.",
        "source": "T25n1509_052:0434b09_1"
    },
    {
        "source_sentence": "如和合五眾等法及六波羅蜜等善法，從是出菩薩名字；",
        "translation": "Together with such good qualities as the unity of the five collections of teachings and the six transcendent ways, they produce the names of enlightening beings.",
        "source": "T25n1509_052:0434b10_2"
    },
    {
        "source_sentence": "是菩薩從作法、眾緣和合生故，非一法所成，以是故言假名。",
        "translation": "Because these bodhisattvas arise from the conjunction of created dharmas and various conditions, they aren't formed by one thing; therefore, they're called nominal names.",
        "source": "T25n1509_052:0434b11_3"
    },
    {
        "source_sentence": "是眾法亦從和合邊生，譬如有眼、有色、有明、有空、有欲見心等諸因緣和合生眼識，是中不得言眼是見者、若識是見者、若色是見者、若明是見者。",
        "translation": "These are all dharmas that also arise from the conjunction, such as when the eye, form, insight, emptiness, mind with desire to see and so forth, and other causes and conditions combine to give rise to the eye consciousness, it can't be said that the eye is seeing, if consciousness is seeing, form is seeing, or insight is seeing.",
        "source": "T25n1509_052:0434b13_4"
    },
    {
        "source_sentence": "若是眼、色、識等，各各不得有所見，和合中亦不應有見。",
        "translation": "If this were so, then the eye, matter, consciousness, etc., wouldn't be able to see each other, and there wouldn't be views in the conjunction.",
        "source": "T25n1509_052:0434b16_5"
    },
    {
        "source_sentence": "以是故，見法畢竟空，如幻、如夢。",
        "translation": "Because of this, they see the ultimate emptiness of things as illusory and dreamlike.",
        "source": "T25n1509_052:0434b17_6"
    },
    {
        "source_sentence": "一切諸法亦如是。",
        "translation": "All dharmas are likewise.",
        "source": "T25n1509_052:0434b18_7"
    },
    {
        "source_sentence": "復次，「一切法無常亦不失」，無常破「常倒」，不失破「斷滅倒」；",
        "translation": "Furthermore, all things are impermanent and not lost, impermanent refutes the error of permanence, and non-failing refutes the error of cessation.",
        "source": "T25n1509_052:0434b19_8"
    },
    {
        "source_sentence": "是無常不失法，即是入實相門，是故須菩提語舍利弗：「無常即是動相、即是空相。」",
        "translation": "This is the approach of entering into the true characteristics of impermanence and not losing the teaching, which is why Suppository said to Śāriputra, Impermanent is the characteristic of movement, and emptiness is the characteristic of emptiness.",
        "source": "T25n1509_052:0434b20_9"
    },
    {
        "source_sentence": "一切法亦如是。",
        "translation": "So it is with all dharmas.",
        "source": "T25n1509_052:0434b22_10"
    },
    {
        "source_sentence": "復次，「一切法非常非失」者，如十八空後義說。",
        "translation": "Furthermore, the phrase all dharmas are neither permanent nor non-failing refers to the meaning after the eighteen kinds of emptiness.",
        "source": "T25n1509_052:0434b22_11"
    },
    {
        "source_sentence": "「色畢竟不生」者，五眾作者、生者、起者不可得故。",
        "translation": "The phrase form that ultimately doesn't arise means that the five authors, those who give rise to it, and those who give rise to it are unobtainable.",
        "source": "T25n1509_052:0434b23_12"
    },
    {
        "source_sentence": "復次，生相不可得者，如先破生中說。",
        "translation": "Furthermore, the characteristic marks of arising are ungraspable: as has been said previously in the section ‘arising’.",
        "source": "T25n1509_052:0434b24_13"
    },
    {
        "source_sentence": "一切法亦如是。",
        "translation": "So it is with all dharmas.",
        "source": "T25n1509_052:0434b25_14"
    },
    {
        "source_sentence": "「何以故說若色不生為非色，非受、想、行、識」者，此中須菩提自說：「色從因緣生，無有自性，常空相。",
        "translation": "Why is it said that if form doesn't arise, it's not form, and it's not feeling, perception, volition, or consciousness? Here, Subhūti himself says, Form arises from causes and conditions, has no self-nature, and always has the characteristic of emptiness.",
        "source": "T25n1509_052:0434b25_15"
    },
    {
        "source_sentence": "若法常空相，是法無生相、無滅相、無住異相。",
        "translation": "If a dharma is always characterized by emptiness, then this dharma has no characteristics of arising, no characteristics of cessation, and no different characteristics of abiding.",
        "source": "T25n1509_052:0434b28_16"
    },
    {
        "source_sentence": "受、想、行、識亦如是。」",
        "translation": "So it is with feeling, perception, volition, and consciousness.",
        "source": "T25n1509_052:0434b29_17"
    },
    {
        "source_sentence": "故不生相法即是無為，非有為相。",
        "translation": "Therefore, the characteristic of nonarising is that which is unconditioned; it is not conditioned.",
        "source": "T25n1509_052:0434b29_18"
    },
    {
        "source_sentence": "餘法亦如是。",
        "translation": "The other dharmas are likewise.",
        "source": "T25n1509_052:0434c01_19"
    },
    {
        "source_sentence": "「畢竟不生，當教誰般若」者，畢竟不生即是諸法實相，諸法實相即是般若波羅蜜，云何以般若波羅蜜教般若波羅蜜？",
        "translation": "The phrase ultimately unarisen, who will be taught the perfection of wisdom means that ultimately unarisen is the true characteristics of dharmas, and the true characteristics of dharmas are the perfection of wisdom, so how can you teach the perfection of wisdom with the perfection of wisdom?",
        "source": "T25n1509_052:0434c01_20"
    },
    {
        "source_sentence": "若離是畢竟不生有菩薩者，應當教般若波羅蜜；",
        "translation": "If there are enlightening beings who are free from this ultimate nonarising, they should teach the transcendent wisdom.",
        "source": "T25n1509_052:0434c04_21"
    },
    {
        "source_sentence": "是菩薩、般若波羅蜜、畢竟不生，無二無別，云何當教離畢竟不生行道者？",
        "translation": "If these bodhisattvas, prajñāpāramitā, and ultimately unarisen are not two and not distinct, how will they be taught to part with the path of practice that ultimately unarisen?",
        "source": "T25n1509_052:0434c05_22"
    },
    {
        "source_sentence": "上說中已合解。",
        "translation": "In the above explanation, we've already explained it together.",
        "source": "T25n1509_052:0434c07_23"
    },
    {
        "source_sentence": "「菩薩聞是不沒、不悔」者，菩薩於一切法中不見我、眾生乃至知者、見者，亦無說者、亦無聽者，無邪說、無正說，亦無無說者；",
        "translation": "“When enlightening beings hear, they don’t regress and don’t regret”: When enlightening beings do not see self, sentient beings, or even those who know and see in all things, there is neither speaker nor listener. There is neither wrong teaching nor right teaching, and there is also no speaker.",
        "source": "T25n1509_052:0434c07_24"
    },
    {
        "source_sentence": "知一切法因緣和合故生，諸緣離故滅，無有起者、無有滅者，故不畏、不怖、不沒、不悔。",
        "translation": "Knowing that all dharmas arise because of the conjunction of causes and conditions and cease because their conditions are removed, there's no one who arises and no one who ceases, so he doesn't fear, doesn't fear, doesn't fall down, and doesn't repent.",
        "source": "T25n1509_052:0434c10_25"
    },
    {
        "source_sentence": "菩薩知一切法虛誑、無實無定；",
        "translation": "Enlightening beings know all things are false, insubstantial, and uncertain.",
        "source": "T25n1509_052:0434c12_26"
    },
    {
        "source_sentence": "若死急時，若墮阿鼻泥犁，心猶不動，況聞虛聲而有恐怖！",
        "translation": "If someone dies in an acute condition or falls into an avīci, their mind doesn't budge, so why wouldn't they hear false sounds and be frightened?",
        "source": "T25n1509_052:0434c13_27"
    },
    {
        "source_sentence": "如人夢中見怖畏事，覺已則無恐心，知夢法能誑心，無有實事；",
        "translation": "Good man, it is like someone who in a dream sees something terrifying and apprehends it without fear. Knowing that the law of dreams can frighten the mind but there is no real thing:",
        "source": "T25n1509_052:0434c14_28"
    },
    {
        "source_sentence": "菩薩亦如是，入世間心夢中見有恐畏，得諸法實相覺時則無所畏；",
        "translation": "Similarly, enlightening beings enter the world and see fearlessness in their minds; when they awaken to the true characteristics of all things, they have no fear.",
        "source": "T25n1509_052:0434c16_29"
    },
    {
        "source_sentence": "知諸法但是虛誑，無有真實。",
        "translation": "They know that all dharmas are nothing real but falsehoods, and there's no reality.",
        "source": "T25n1509_052:0434c18_30"
    },
    {
        "source_sentence": "復次，譬如幻事，智者雖見，心無所惑，知是誑法；",
        "translation": "“Furthermore, it is like an illusion: even though a wise person sees something magical, they are not confused at all in their minds and know it to be the law of sexual misconduct.",
        "source": "T25n1509_052:0434c18_31"
    },
    {
        "source_sentence": "菩薩亦如是，知一切法如幻，能誑人心，是中無實，以是故不怖畏。",
        "translation": "Similarly, bodhisattvas know that all dharmas are illusory and can deceive people, but there's no reality in this, so they aren't frightened because of that.",
        "source": "T25n1509_052:0434c19_32"
    },
    {
        "source_sentence": "如炎、如影、如化亦如是。",
        "translation": "So it is with such things as fire, such things as shadows, and such things as transformations.",
        "source": "T25n1509_052:0434c21_33"
    },
    {
        "source_sentence": "【經】須菩提白佛言：「世尊！",
        "translation": "[Subhidharma] Subhūti said to the Buddha, Bhagavān!",
        "source": "T25n1509_052:0434c23_0"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，如是觀諸法，是時菩薩摩訶薩不受色，不視色，不住色，不著色，不言是色；",
        "translation": "“When great enlightening beings practice prajñā-pāramitā and thus contemplate all things, then great enlightening beings don’t accept form, don’t look at form, don’t abide in form, don’t cling to form, and don’t say it is form.",
        "source": "T25n1509_052:0434c23_1"
    },
    {
        "source_sentence": "受、想、行、識亦不受、不視、不住、不著，亦不言是受、想、行、識。",
        "translation": "Feeling, perception, volition, volition, and consciousness also don't experience, don't look, don't abide, and don't cling, and they don't say feeling, perception, volition, and consciousness are sensations, perception, volition, and consciousness.",
        "source": "T25n1509_052:0434c25_2"
    },
    {
        "source_sentence": "眼不受、不視、不住、不著，亦不言是眼；",
        "translation": "The eye doesn’t experience, doesn’t look, doesn’t abide and doesn’t cling, and doesn’t say it is the eye.",
        "source": "T25n1509_052:0434c27_3"
    },
    {
        "source_sentence": "耳、鼻、舌、身；",
        "translation": "ear, nose, tongue, and body.",
        "source": "T25n1509_052:0434c28_0"
    },
    {
        "source_sentence": "意亦不受、不視、不住、不著，亦不言是意。",
        "translation": "The mind also doesn't accept, doesn't look, doesn't abide, and doesn't cling, and doesn't say it's the mind.",
        "source": "T25n1509_052:0434c28_1"
    },
    {
        "source_sentence": "檀波羅蜜不受、不視、不住、不著，亦不言是檀波羅蜜；",
        "translation": "The transcendent of giving is not accepted, not seen, not abiding, and not attached. Nor does one say that it is the transcendent of giving.",
        "source": "T25n1509_052:0434c29_2"
    },
    {
        "source_sentence": "尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜，禪波羅蜜；",
        "translation": "The pāramitā of śīla, the pāramitā of caṇḍi, and the pāramitā of vīrya are the pāramitā of meditation.",
        "source": "T25n1509_052:0435a01_3"
    },
    {
        "source_sentence": "般若波羅蜜不受、不示、不住、不著，亦不言是般若波羅蜜。",
        "translation": "The prajñāpāramitā doesn't accept, doesn't show, doesn't abide, and doesn't cling, and doesn't say it's the prajñāpāramitā.",
        "source": "T25n1509_052:0435a02_4"
    },
    {
        "source_sentence": "內空不受、不示、不住、不著，亦不言是內空；",
        "translation": "“Inward emptiness does not experience, does not show, does not abide, and does not cling. Nor does it say that it is inward emptiness.",
        "source": "T25n1509_052:0435a03_5"
    },
    {
        "source_sentence": "乃至無法有法空亦如是。",
        "translation": "It's likewise with the emptiness of nonexistence and dharmas.",
        "source": "T25n1509_052:0435a04_6"
    },
    {
        "source_sentence": "復次，世尊！",
        "translation": "Furthermore, Bhagavān!",
        "source": "T25n1509_052:0435a05_7"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜時，四念處不受、不示、不住、不著，亦不言是四念處；",
        "translation": "“When great enlightening beings practice prajñā-pāramitā, the four abodes of mindfulness are not accepted, shown, assented to, or attached; they do not say these are the four abodes of mindfulness.",
        "source": "T25n1509_052:0435a05_8"
    },
    {
        "source_sentence": "乃至十八不共法不受、不示、不住、不著，亦不言是十八不共法。",
        "translation": "It doesn't even say that these 18 distinctive qualities are the 18 distinctive qualities that are neither received, shown, not abiding, nor attached to.",
        "source": "T25n1509_052:0435a07_9"
    },
    {
        "source_sentence": "一切三昧門、一切陀羅尼門；",
        "translation": "all the teachings of concentration and all the teachings of enlightening beings;",
        "source": "T25n1509_052:0435a08_10"
    },
    {
        "source_sentence": "乃至一切種智，不受、不示、不住、不著，亦不言是一切種智。",
        "translation": "It doesn't say that all kinds of cognition don't receive, don't show, don't abide, and don't cling, and it doesn't say they are all kinds of cognition.",
        "source": "T25n1509_052:0435a09_11"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T25n1509_052:0435a10_12"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜時，不見色乃至不見一切種智。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of prajñā, they don't see form or even all kinds of cognition.",
        "source": "T25n1509_052:0435a10_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0435a12_14"
    },
    {
        "source_sentence": "色不生，是非色；",
        "translation": "Form doesn’t arise; it is right and wrong form.",
        "source": "T25n1509_052:0435a12_15"
    },
    {
        "source_sentence": "受、想、行；",
        "translation": "Feeling, conceptual identification and formations:",
        "source": "T25n1509_052:0435a12_16"
    },
    {
        "source_sentence": "識不生，是非識。",
        "translation": "Consciousness doesn't arise, which is right and wrong consciousness.",
        "source": "T25n1509_052:0435a12_17"
    },
    {
        "source_sentence": "眼不生，是非眼；",
        "translation": "When the eye does not arise, it is right or wrong eye.",
        "source": "T25n1509_052:0435a13_18"
    },
    {
        "source_sentence": "耳、鼻、舌、身；",
        "translation": "ear, nose, tongue, and body.",
        "source": "T25n1509_052:0435a13_19"
    },
    {
        "source_sentence": "意不生，是非意。",
        "translation": "The mind doesn't arise, but what's right and wrong is the mind.",
        "source": "T25n1509_052:0435a13_20"
    },
    {
        "source_sentence": "檀波羅蜜不生，是非檀波羅蜜；",
        "translation": "The transcendent of giving that does not arise is what is not the transcendent of giving.",
        "source": "T25n1509_052:0435a14_21"
    },
    {
        "source_sentence": "乃至般若波羅蜜不生，是非般若波羅蜜。",
        "translation": "Even if the perfection of wisdom doesn't arise, it's not the perfection of wisdom.",
        "source": "T25n1509_052:0435a14_22"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0435a15_23"
    },
    {
        "source_sentence": "色、不生，不二不別；",
        "translation": "Form and nonform are neither two nor different.",
        "source": "T25n1509_052:0435a16_24"
    },
    {
        "source_sentence": "乃至般若波羅蜜、不生，不二不別。",
        "translation": "Up to the perfection of wisdom and nonarising are neither two nor distinct.",
        "source": "T25n1509_052:0435a16_25"
    },
    {
        "source_sentence": "內空不生，是非內空；",
        "translation": "What is internal emptiness does not arise and what is non-internal emptiness.",
        "source": "T25n1509_052:0435a17_26"
    },
    {
        "source_sentence": "乃至無法有法空不生，是非無法有法空，何以故？",
        "translation": "It goes so far as to say that the emptiness of dharmas that are nonexistent doesn't arise, and the emptiness of dharmas that are nonexistent is not nonexistent; why is it so?",
        "source": "T25n1509_052:0435a17_27"
    },
    {
        "source_sentence": "內空乃至無法有法空、不生，不二不別。",
        "translation": "The internal emptiness and even the emptiness of dharmas that lack existence and don't arise are neither two nor distinct.",
        "source": "T25n1509_052:0435a18_28"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_052:0435a19_29"
    },
    {
        "source_sentence": "四念處不生，非四念處，何以故？",
        "translation": "The four applications of mindfulness don't arise, and they aren't the four applications of mindfulness, so why is that?",
        "source": "T25n1509_052:0435a19_30"
    },
    {
        "source_sentence": "四念處、不生，不二不別。",
        "translation": "The four abodes of mindfulness and nonarising are neither two nor distinct.",
        "source": "T25n1509_052:0435a20_31"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0435a21_32"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_052:0435a21_33"
    },
    {
        "source_sentence": "是不生法非一、非二、非三、非異。",
        "translation": "The non-arisen dharmas are not one, not two, not three, and not different.",
        "source": "T25n1509_052:0435a21_34"
    },
    {
        "source_sentence": "以是故，四念處、不生，不二不別。",
        "translation": "Because of this, the four abodes of mindfulness and nonarising are neither two nor different.",
        "source": "T25n1509_052:0435a22_35"
    },
    {
        "source_sentence": "乃至十八不共法不生，非十八不共法。",
        "translation": "It's not the 18 distinctive qualities that don't arise, but it's not the 18 distinctive qualities.",
        "source": "T25n1509_052:0435a22_36"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0435a23_37"
    },
    {
        "source_sentence": "十八不共法、不生，不二不別。",
        "translation": "The eighteen unique qualities and nonarising are neither two nor distinct.",
        "source": "T25n1509_052:0435a23_38"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0435a24_39"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_052:0435a24_40"
    },
    {
        "source_sentence": "是不生法非一、非二、非三、非異。",
        "translation": "The non-arisen dharmas are not one, not two, not three, and not different.",
        "source": "T25n1509_052:0435a24_41"
    },
    {
        "source_sentence": "以是故，十八不共法不生，非十八不共法。",
        "translation": "Because of this, the eighteen unique factors do not arise: they are no eighteen unique factors.",
        "source": "T25n1509_052:0435a25_42"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_052:0435a26_43"
    },
    {
        "source_sentence": "如不生，是非如；",
        "translation": "Thusness does not arise; what is right and wrong are thus.",
        "source": "T25n1509_052:0435a26_44"
    },
    {
        "source_sentence": "乃至不可思議性不生，是非不可思議性。",
        "translation": "The inconceivable nature doesn't arise, and what's right is the inconceivable nature.",
        "source": "T25n1509_052:0435a27_45"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_052:0435a28_46"
    },
    {
        "source_sentence": "是阿耨多羅三藐三菩提不生，一切智；",
        "translation": "This is the omniscience of unexcelled complete perfect enlightenment, which does not arise.",
        "source": "T25n1509_052:0435a28_47"
    },
    {
        "source_sentence": "一切種智不生，是非一切種智。",
        "translation": "All kinds of cognition don't arise, and it's not all kinds of cognition.",
        "source": "T25n1509_052:0435a29_48"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0435a29_49"
    },
    {
        "source_sentence": "是阿耨多羅三藐三菩提，乃至一切種智、不生，不二不別。",
        "translation": "It's unsurpassed, correct, and complete enlightenment, up to the point where all kinds of cognition and non-arising are not two or different.",
        "source": "T25n1509_052:0435b01_50"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0435b02_51"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_052:0435b02_52"
    },
    {
        "source_sentence": "是不生法非一、非二、非三、非異。",
        "translation": "The non-arisen dharmas are not one, not two, not three, and not different.",
        "source": "T25n1509_052:0435b02_53"
    },
    {
        "source_sentence": "以是故，乃至一切種智不生，非一切種智。",
        "translation": "Because of this, up to omniscience doesn't arise, not omniscience.",
        "source": "T25n1509_052:0435b03_54"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_052:0435b04_55"
    },
    {
        "source_sentence": "色不滅相，是非色。",
        "translation": "Form doesn't cease its characteristics, which are right and wrong form.",
        "source": "T25n1509_052:0435b04_56"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0435b04_57"
    },
    {
        "source_sentence": "色及不滅相，不二不別。",
        "translation": "Form and the characteristic of noncessation are neither two nor distinct.",
        "source": "T25n1509_052:0435b05_58"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0435b05_59"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_052:0435b05_60"
    },
    {
        "source_sentence": "是不滅法非一、非二、非三、非異。",
        "translation": "The non-cessation dharmas are not one, not two, not three, and not different.",
        "source": "T25n1509_052:0435b05_61"
    },
    {
        "source_sentence": "以是故，色不滅相是非色；",
        "translation": "Because of this, form that does not perish is characterized as neither form nor nonform.",
        "source": "T25n1509_052:0435b06_62"
    },
    {
        "source_sentence": "受、想、行；",
        "translation": "Feeling, conceptual identification and formations:",
        "source": "T25n1509_052:0435b07_63"
    },
    {
        "source_sentence": "識不滅相是非識。",
        "translation": "Consciousness doesn't cease, and marks are right and wrong consciousness.",
        "source": "T25n1509_052:0435b07_64"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0435b07_65"
    },
    {
        "source_sentence": "識及不滅不二不別。",
        "translation": "Consciousness and non-cessation are neither two nor distinct.",
        "source": "T25n1509_052:0435b08_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0435b08_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_052:0435b08_2"
    },
    {
        "source_sentence": "是不滅法非一、非二、非三、非異，以是故，識不滅相是非識。",
        "translation": "The factors that are not extinguished are not one, not two, not three, and not different; therefore, the characteristic of not extinguishing consciousness is not consciousness.",
        "source": "T25n1509_052:0435b08_3"
    },
    {
        "source_sentence": "檀波羅蜜乃至般若波羅蜜，內空乃至無法有法空，四念處乃至十八不共法，亦如是。",
        "translation": "The perfection of giving up to the perfection of wisdom, internal emptiness up to the emptiness of dharmas that don't exist, and the four abodes of mindfulness up to the 18 distinctive qualities are likewise.",
        "source": "T25n1509_052:0435b10_4"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_052:0435b12_5"
    },
    {
        "source_sentence": "以是故，色入無二法數，受、想、行、識入無二法數，乃至一切種智入無二法數。」",
        "translation": "Because of this, form enters into the number of nondual dharmas, sensation, perception, volition, and consciousness enter into the number of nondual dharmas, and so forth, up to all kinds of cognition enter into the number of nondual dharmas.",
        "source": "T25n1509_052:0435b12_6"
    },
    {
        "source_sentence": "【論】者言：須菩提白佛：菩薩能如是觀諸法，於五眾中有五種正觀行：所謂「不受」，以五眾中有無常火能燒心故。",
        "translation": "[Commentary] The person says, Suppository said to the Buddha, A bodhisattva can thus observe the dharmas and there are five kinds of correctly observing practice among the five groups of people: so-called not accepting because there's an impermanent fire in the five groups of people that burns the mind.",
        "source": "T25n1509_052:0435b14_0"
    },
    {
        "source_sentence": "「不視」者，不取相，非但觀無常等過，觀是五眾空，不取相故。",
        "translation": "Not looking means not grasping characteristics, not just observing impermanent and other faults, but observing that these are the five kinds of emptiness because they don't grasp characteristics.",
        "source": "T25n1509_052:0435b16_1"
    },
    {
        "source_sentence": "「不住」者，不依止五眾，畏諸煩惱賊來故，不敢久住；",
        "translation": "Those who don't abide don't rely on the five groups of people because they fear the afflictive thieves coming, and they won't dare to stay for long.",
        "source": "T25n1509_052:0435b18_2"
    },
    {
        "source_sentence": "譬如空聚落，賊所止處，智者不應久住。",
        "translation": "It's like an empty village where thieves live, and a wise person shouldn't stay long.",
        "source": "T25n1509_052:0435b19_3"
    },
    {
        "source_sentence": "「不著」者，五眾若有一罪，猶不應著，何況身有飢渴、寒熱、老病死等，心有憂愁、恐怖、妬嫉、瞋恚等，後世墮三惡道！",
        "translation": "Not attached means that if there's a single sin in the five groups, they shouldn't be attached, so why wouldn't they be attached when their bodies have hunger and thirst, cold and heat, old age, illness, death, and so forth, and their minds have grief, fear, jealousy, anger, etc., and will fall into the three bad destinies in later lifetimes?",
        "source": "T25n1509_052:0435b20_4"
    },
    {
        "source_sentence": "一切無常、苦、空、無我，不得自在；",
        "translation": "All things are impermanent, painful, empty, and selfless; they do not attain mastery.",
        "source": "T25n1509_052:0435b22_5"
    },
    {
        "source_sentence": "如是等無量無邊過罪，云何可著？",
        "translation": "Such sins are immeasurable and limitless, so how can they be attached?",
        "source": "T25n1509_052:0435b23_6"
    },
    {
        "source_sentence": "「不言是色」者，不以邪見說色若常、若無常等，不言五眾如是定相。",
        "translation": "He doesn't say it's form because he doesn't say that form is permanent or impermanent with wrong views, and he doesn't say that the five groups of people are thus determined in their characteristics.",
        "source": "T25n1509_052:0435b24_7"
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "It's likewise with all kinds of cognition.",
        "source": "T25n1509_052:0435b25_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0435b26_9"
    },
    {
        "source_sentence": "色中行五種正行，是五眾皆無生相，皆一相，一相則無相；",
        "translation": "These are the characteristic marks of nonorigination in all five collections. All have one characteristic mark, and one characteristic mark is signless.",
        "source": "T25n1509_052:0435b26_10"
    },
    {
        "source_sentence": "若無相則非有五眾。",
        "translation": "If there are no characteristics, then there aren't the five congregations.",
        "source": "T25n1509_052:0435b28_0"
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "It's likewise with all kinds of cognition.",
        "source": "T25n1509_052:0435b28_1"
    },
    {
        "source_sentence": "若一切法無生相、般若波羅蜜不二不別；",
        "translation": "If all things have the signlessness of nonorigination, the transcendent wisdom is neither two nor different.",
        "source": "T25n1509_052:0435c01_2"
    },
    {
        "source_sentence": "得是無生心，即是般若波羅蜜；",
        "translation": "Attaining this mind of nonorigination is the transcendent wisdom.",
        "source": "T25n1509_052:0435c02_0"
    },
    {
        "source_sentence": "得般若波羅蜜，即知諸法不生不滅。",
        "translation": "Attaining the perfection of prajñā, he knows that all dharmas don't arise and don't cease.",
        "source": "T25n1509_052:0435c02_1"
    },
    {
        "source_sentence": "以是故，般若波羅蜜即是不生，不二不別。",
        "translation": "Because of this, the perfection of wisdom is that which doesn't arise and isn't two or different.",
        "source": "T25n1509_052:0435c03_2"
    },
    {
        "source_sentence": "復次，須菩提自說因緣，所謂是無生法不一相、不二相、不三、不異。",
        "translation": "Furthermore, Subhūti himself explains the causes and conditions, which are called the nonarising of dharmas that aren't one-sided, don't two-sided, don't three, and don't differ.",
        "source": "T25n1509_052:0435c04_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_052:0435c06_4"
    },
    {
        "source_sentence": "諸法、無生一相故。",
        "translation": "It's because all dharmas lack the single characteristic of nonproduction.",
        "source": "T25n1509_052:0435c06_5"
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "It's likewise with all kinds of cognition.",
        "source": "T25n1509_052:0435c06_6"
    },
    {
        "source_sentence": "如無生，無滅亦如是。",
        "translation": "So it is with the absence of arising and the absence of cessation.",
        "source": "T25n1509_052:0435c07_7"
    },
    {
        "source_sentence": "問曰：末後何以故說「色乃至一切種智入無二法數」？",
        "translation": "Q: Why is it later explained that form and even all kinds of cognition enter into the number of nondual dharmas?",
        "source": "T25n1509_052:0435c07_8"
    },
    {
        "source_sentence": "答曰：菩薩若未破色，則生愛等結使，著是色等；",
        "translation": "Answer: If a bodhisattva has not destroyed form, then he generates bonds of craving and so on.",
        "source": "T25n1509_052:0435c08_9"
    },
    {
        "source_sentence": "破色已，則生邪見，著是色空等。",
        "translation": "After refuting form, they give rise to wrong views that are attached to form and emptiness.",
        "source": "T25n1509_052:0435c10_10"
    },
    {
        "source_sentence": "今色等用空智慧故，皆空不二相。",
        "translation": "Now, form and so forth use the wisdom of emptiness because they are all empty and not two characteristics.",
        "source": "T25n1509_052:0435c10_11"
    },
    {
        "source_sentence": "是諸法虛誑不實，內外入所攝故名為二；",
        "translation": "These dharmas are false and insubstantial. Because they are included within internal and external sense operations, they are called two.",
        "source": "T25n1509_052:0435c11_12"
    },
    {
        "source_sentence": "色等乃至一切種智，離是二，名不二。",
        "translation": "When form, and so on, up to all kinds of cognition are free from these two, they're called nondual.",
        "source": "T25n1509_052:0435c12_13"
    },
    {
        "source_sentence": "今須菩提憐愍眾生、利益諸菩薩故，說：「是諸法不二，入無二法數中。」",
        "translation": "Now, it's because they need enlightenment to pity sentient beings and benefit the bodhisattvas that they say, These dharmas are not two; they enter into the number of nondual dharmas.",
        "source": "T25n1509_052:0435c13_14"
    },
    {
        "source_sentence": "大智度論卷第五十二",
        "translation": "Dazhiduo lun, vol. 52",
        "source": "T25n1509_052:0435c16_0"
    }
]