[
    {
        "source_sentence": "摩訶般若波羅蜜經釋論序",
        "translation": "Preface to the Explanation and Commentary on the Mahāprajñāpāramitā-sūtra",
        "source": "T25n1509_001:0057a03_0"
    },
    {
        "source_sentence": "長安釋僧叡述",
        "translation": "Chang'an Shi Sengriesu",
        "source": "T25n1509_001:0057a05_0"
    },
    {
        "source_sentence": "夫萬有本於生生而生，生者無生；",
        "translation": "All things arise in dependence upon birth. The one who is born has no birth.",
        "source": "T25n1509_001:0057a06_0"
    },
    {
        "source_sentence": "變化兆於物始而始，始者無始。",
        "translation": "The sign of transformation begins with things, and the beginning has no beginning.",
        "source": "T25n1509_001:0057a06_1"
    },
    {
        "source_sentence": "然則無生、無始，物之性也。",
        "translation": "Then there's no arising and no beginning, which are the natures of things.",
        "source": "T25n1509_001:0057a07_2"
    },
    {
        "source_sentence": "生、始不動於性，而萬有陳於外、悔吝生於內者，其唯邪思乎！",
        "translation": "It's only wrong to think that birth and the beginning don't move in their nature, while all things are presented externally and repentance and stinginess are produced internally!",
        "source": "T25n1509_001:0057a08_3"
    },
    {
        "source_sentence": "正覺有以見邪思之自起故，阿含為之作；",
        "translation": "Good enlightenment has the Āgamas for its work because it is self-generated from views and wrong thoughts.",
        "source": "T25n1509_001:0057a09_4"
    },
    {
        "source_sentence": "知滯有之由惑故，般若為之照。",
        "translation": "Knowing that attachment exists because of mental disturbances, prajñā is the illumination for them.",
        "source": "T25n1509_001:0057a10_5"
    },
    {
        "source_sentence": "然而照本希夷，津涯浩汗，理超文表，趣絕思境。",
        "translation": "However, it illuminates the originally insubstantial and has a vast pervasive sense of shame. The principle transcends words and expressions and is not concerned with thoughts or objects.",
        "source": "T25n1509_001:0057a11_6"
    },
    {
        "source_sentence": "以言求之，則乖其深；",
        "translation": "To seek it in words would be to diverge from its depth.",
        "source": "T25n1509_001:0057a12_7"
    },
    {
        "source_sentence": "以智測之，則失其旨。",
        "translation": "When we judge it with wisdom, we will lose its meaning.",
        "source": "T25n1509_001:0057a12_8"
    },
    {
        "source_sentence": "二乘所以顛沛於三藏，雜學所以曝鱗於龍門者，不其然乎！",
        "translation": "Isn't that the reason the two vehicles are mistaken about the Tripiṭaka and the reason mixed learning exposes their scales to the dragon gate?",
        "source": "T25n1509_001:0057a13_9"
    },
    {
        "source_sentence": "是以馬鳴起於正法之餘，龍樹生於像法之末。",
        "translation": "That's why the horse singing arises at the end of the true teaching and the dragon tree grows at the end of the image teaching.",
        "source": "T25n1509_001:0057a14_10"
    },
    {
        "source_sentence": "正餘易弘故，直振其遺風瑩拂而已。",
        "translation": "It's precisely because the rest are easy to propagate, and it simply refreshes the breeze of his legacy.",
        "source": "T25n1509_001:0057a15_11"
    },
    {
        "source_sentence": "像末多端故，乃寄跡凡夫示悟物以漸，又假照龍宮以朗搜玄之慧，託聞幽祕以窮微言之妙，爾乃憲章智典作茲釋論。",
        "translation": "Because the image had many ends, he sent his traces to ordinary people to show their gradual enlightenment in order to gradually understand things. He also asked them to illuminate the dragon's palace with the wisdom of extensive search for the profound and entrusted the mysterious to hear the subtle theories so as to exhaust the subtle theories. So he wrote this treatise on the interpretation of the",
        "source": "T25n1509_001:0057a16_12"
    },
    {
        "source_sentence": "其開夷路也，則令大乘之駕方軌而直入；",
        "translation": "He opens the way for the barbarians and causes the Mahayana carriages to enter directly through the right path.",
        "source": "T25n1509_001:0057a19_0"
    },
    {
        "source_sentence": "其辯實相也，則使妄見之惑不遠而自復。",
        "translation": "When they debate the true characteristics, they cause the deluded mental disturbances of deluded views not to be distant and to come back on their own.",
        "source": "T25n1509_001:0057a19_1"
    },
    {
        "source_sentence": "其為論也，初辭擬之，必標眾異以盡美；",
        "translation": "The first part of the treatise is to be composed in such a way as to distinguish all differences so as to embellish their beauty.",
        "source": "T25n1509_001:0057a20_2"
    },
    {
        "source_sentence": "卒成之終，則舉無執以盡善。",
        "translation": "When it's suddenly completed, then he'll cite the absence of attachment to end goodness.",
        "source": "T25n1509_001:0057a21_3"
    },
    {
        "source_sentence": "釋所不盡，則立論以明之；",
        "translation": "When the explanation is inexhaustible, a treatise is established to explain it.",
        "source": "T25n1509_001:0057a22_4"
    },
    {
        "source_sentence": "論其未辯，則寄折中以定之。",
        "translation": "If we discuss it without debate, we'll send it to the middle of the fold to determine it.",
        "source": "T25n1509_001:0057a23_0"
    },
    {
        "source_sentence": "使靈篇無難喻之章，千載悟作者之旨，信若人之功矣！",
        "translation": "The chapter on enabling spirit has no difficulty metaphors, and the author's a thousand years of awakening to the author's intention are believed to be the merits of someone!",
        "source": "T25n1509_001:0057a23_1"
    },
    {
        "source_sentence": "有鳩摩羅耆婆法師者，少播聰慧之聞，長集奇拔之譽，才舉則亢標萬里，言發則英辯榮枯，常杖茲論為淵鏡憑高、致以明宗。",
        "translation": "There was the Dharma Master Kumārajīva, a man of little learning who spread the fame of his wise wisdom and long collected the fame of his marvelous abilities. His talents were so great that he surpassed ten thousand li in virtue; his eloquence would make him brilliant and distinguished, and he always held this treatise to be the profound doctrine of enlightenment based on emptiness,",
        "source": "T25n1509_001:0057a24_2"
    },
    {
        "source_sentence": "以秦弘始三年，歲次星紀，十二月二十日，自姑臧至長安。",
        "translation": "On the twentieth day of the twelfth month in the third year of the reign of the founding emperor of the Qin dynasty, he traveled from Guzang to Chang’an on the twenty-second day of the twelfth month.",
        "source": "T25n1509_001:0057a27_3"
    },
    {
        "source_sentence": "秦王虛襟既已蘊在，昔見之心豈徒則悅而已！",
        "translation": "Since the king of Qin's empty chest is already present, isn't it just joyful to see his mind in the past?",
        "source": "T25n1509_001:0057a29_0"
    },
    {
        "source_sentence": "晤言相對，則淹留終日；",
        "translation": "They exchanged words with each other and remained submerged for the rest of the day.",
        "source": "T25n1509_001:0057b01_1"
    },
    {
        "source_sentence": "研微造盡，則窮年忘倦。",
        "translation": "When the study of the subtleties is exhausted, he forgets all his years.",
        "source": "T25n1509_001:0057b01_2"
    },
    {
        "source_sentence": "又以晤言之功雖深，而恨獨符之心不曠；",
        "translation": "Furthermore, even though the merit of listening to words is profound, one does not feel anger toward those who hold a grudge against them alone.",
        "source": "T25n1509_001:0057b02_3"
    },
    {
        "source_sentence": "造盡之要雖玄，而惜津梁之勢未普。",
        "translation": "Although the essentials of enactment are mysterious, I regret that the influence of the Jin and Liang dynasties is not widespread.",
        "source": "T25n1509_001:0057b03_4"
    },
    {
        "source_sentence": "遂以莫逆之懷，相與弘兼忘之慧，乃集京師義業沙門，命公卿賞契之士五百餘人，集於渭濱逍遙園堂。",
        "translation": "With a mind free from malice and combining the wisdom of neither hatred nor hostility with the wisdom of forgetfulness, he assembled the monk Yiqiao of the capital. He ordered more than five hundred men who had been honored by the court officials and ministers to gather together in the park-and-ride hall at the foot of the Wei River.",
        "source": "T25n1509_001:0057b04_0"
    },
    {
        "source_sentence": "鑾輿佇駕於洪涘，禁禦息警於林間。",
        "translation": "The carriages stopped at Hongqiao and guarded the fortress in the woods.",
        "source": "T25n1509_001:0057b06_1"
    },
    {
        "source_sentence": "躬覽玄章，考正名於梵本；",
        "translation": "He read the profound scriptures in person and examined the Sanskrit texts for their correct names.",
        "source": "T25n1509_001:0057b07_2"
    },
    {
        "source_sentence": "諮通津要，坦夷路於來踐。",
        "translation": "He consulted on the essentials of the Tripiṭaka, and Tanyi came to visit him.",
        "source": "T25n1509_001:0057b07_3"
    },
    {
        "source_sentence": "經本既定，乃出此釋論。",
        "translation": "Since the text of the sūtras had been fixed, he produced this explanation of the treatise.",
        "source": "T25n1509_001:0057b08_4"
    },
    {
        "source_sentence": "論之略本有十萬偈，偈有三十二字，并三百二十萬言。",
        "translation": "The abbreviated version of the treatise consists of 100,000 verses with thirty-two syllables and three hundred and twenty million words.",
        "source": "T25n1509_001:0057b08_5"
    },
    {
        "source_sentence": "梵夏既乖，又有煩簡之異，三分除二，得此百卷。",
        "translation": "As the Sanskrit and Chinese are not the same, there's also a difference in what's complicated and simple, except for the three parts and two, which obtain these one hundred fascicles.",
        "source": "T25n1509_001:0057b10_6"
    },
    {
        "source_sentence": "於大智三十萬言，玄章婉旨，朗然可見，歸途直達，無復惑趣之疑，以文求之無間然矣。",
        "translation": "In the thirty thousand words of Mahāprajñāpāramitā, his profound teachings and subtle meanings are so clear and distinct that they can be directly perceived on the way back home without further confusion or doubt about where to go. It is just as if we were to search for them by means of texts.",
        "source": "T25n1509_001:0057b11_7"
    },
    {
        "source_sentence": "故天竺傳云：「像、正之末，微馬鳴、龍樹，道學之門其淪胥溺喪矣！」",
        "translation": "The old Indian biographies of the Buddha say, Toward the end of the image and the Zheng dynasty, there's a weak horse and a dragon tree, and the gate of enlightenment and training is drowning!",
        "source": "T25n1509_001:0057b13_8"
    },
    {
        "source_sentence": "其故何耶？",
        "translation": "What is the reason for this?",
        "source": "T25n1509_001:0057b14_9"
    },
    {
        "source_sentence": "寔由二未契微邪法用盛，虛言與實教並興，嶮徑與夷路爭轍，始進者化之而流離，向道者惑之而播越，非二匠其孰與正之！",
        "translation": "It's because the two people who don't understand the subtle and wrong teachings flourish, false speech arises along with the true teaching, a dangerous path fights with the barbarians, those who begin to advance are transformed and flow away, and those who are heading for the path confuse them and sow transmigration, but it's not up to the two masters to correct them!",
        "source": "T25n1509_001:0057b14_10"
    },
    {
        "source_sentence": "是以天竺諸國，為之立廟，宗之若佛。",
        "translation": "That's why the Indian countries built temples for him, and their doctrines are like buddhas.",
        "source": "T25n1509_001:0057b17_11"
    },
    {
        "source_sentence": "又稱而詠之曰：「智慧日已頹，斯人令再曜；",
        "translation": "He also praised them and composed a verse, saying: As the sun of wisdom has degenerated, these people will be reborn.",
        "source": "T25n1509_001:0057b18_12"
    },
    {
        "source_sentence": "世昏寢已久，斯人悟令覺。」",
        "translation": "It's been a long time since the world went into darkness and slept, and this person awakened to make them awake.",
        "source": "T25n1509_001:0057b19_13"
    },
    {
        "source_sentence": "若然者，真可謂功格十地，道侔補處者矣！",
        "translation": "If that's the case, then it really can be called the tenth ground of merit, and the path is a place to make up for it!",
        "source": "T25n1509_001:0057b20_14"
    },
    {
        "source_sentence": "傳而稱之，不亦宜乎！",
        "translation": "Wouldn't it be appropriate to call it by that name?",
        "source": "T25n1509_001:0057b21_15"
    },
    {
        "source_sentence": "幸哉！",
        "translation": "How fortunate!",
        "source": "T25n1509_001:0057b21_16"
    },
    {
        "source_sentence": "此中鄙之外，忽得全有此論。",
        "translation": "In addition to the coarse here, there's suddenly a whole treatise like this.",
        "source": "T25n1509_001:0057b21_17"
    },
    {
        "source_sentence": "梵文委曲，皆如初品。",
        "translation": "The Sanskrit text is entrusted with music, just as in the first chapter.",
        "source": "T25n1509_001:0057b22_18"
    },
    {
        "source_sentence": "法師以秦人好簡故，裁而略之。",
        "translation": "The Master, being a native of the Qin dynasty and fond of simplicity, abbreviated it by dividing it into two.",
        "source": "T25n1509_001:0057b22_19"
    },
    {
        "source_sentence": "若備譯其文，將近千有餘卷。",
        "translation": "If we translate the text in full, there will be more than a thousand fascicles.",
        "source": "T25n1509_001:0057b23_20"
    },
    {
        "source_sentence": "法師於秦語大格，唯譯一往；",
        "translation": "The Master translated only one of the major texts of the Qin language into Chinese.",
        "source": "T25n1509_001:0057b24_21"
    },
    {
        "source_sentence": "方言殊好，猶隔而未通。",
        "translation": "The dialects are distinct and good, but they are still separated but not connected.",
        "source": "T25n1509_001:0057b24_22"
    },
    {
        "source_sentence": "苟言不相喻，則情無由比。",
        "translation": "If one speaks of the absence of characteristics as metaphors, there is no comparison with feelings.",
        "source": "T25n1509_001:0057b25_23"
    },
    {
        "source_sentence": "不比之情，則不可以託悟懷於文表；",
        "translation": "If one does not compare it to feelings, then one cannot rely on enlightenment to embrace words and expressions.",
        "source": "T25n1509_001:0057b26_0"
    },
    {
        "source_sentence": "不喻之言，亦何得委殊塗於一致。",
        "translation": "If we don't use metaphors, how can we entrust distinctive characteristics to unity?",
        "source": "T25n1509_001:0057b26_1"
    },
    {
        "source_sentence": "理固然矣，進欲停筆爭是，則交競終日卒無所成；",
        "translation": "It is true that the principle is certain, but if one wishes to stop writing and strives for it, then at the end of the day there will be no victory.",
        "source": "T25n1509_001:0057b27_2"
    },
    {
        "source_sentence": "退欲簡而便之，則負傷於穿鑿之譏以二三。",
        "translation": "If he retreated and wanted to simplify it, then he'd be inflicted harm by the two or three criticisms of penetration.",
        "source": "T25n1509_001:0057b28_3"
    },
    {
        "source_sentence": "唯案譯而書，都不備飾。",
        "translation": "The only thing he did was to translate the scriptures into Chinese and write them, but they weren't fully decorated.",
        "source": "T25n1509_001:0057b29_4"
    },
    {
        "source_sentence": "幸冀明悟之賢，略其文而挹其玄也！",
        "translation": "It's fortunate that the wise man who understands and awakens should summarize his text and plunge into its mystery!",
        "source": "T25n1509_001:0057c01_5"
    },
    {
        "source_sentence": "大智度初序品中緣起義釋論",
        "translation": "Commentary on the Meaning of Conditioned Arising in the First Preface to the Mahāprajñāpāramitā",
        "source": "T25n1509_001:0057c05_0"
    },
    {
        "source_sentence": "第一(卷第一)",
        "translation": "the first (fascicle 1)",
        "source": "T25n1509_001:0057c06_0"
    },
    {
        "source_sentence": "龍樹菩薩造",
        "translation": "created by Nāgârjuna Bodhisattva",
        "source": "T25n1509_001:0057c08_0"
    },
    {
        "source_sentence": "後秦龜茲國三藏法師鳩摩羅什",
        "translation": "Kumārajīva, the Tripiṭaka Master of the Later Qin state of Kucha",
        "source": "T25n1509_001:0057c09_0"
    },
    {
        "source_sentence": "奉　詔譯",
        "translation": "translated by imperial edict",
        "source": "T25n1509_001:0057c10_0"
    },
    {
        "source_sentence": "　智度大道佛從來，　　智度大海佛窮盡，",
        "translation": "The Buddha of the Great Path of Knowledge and Conqueror comes from this buddha; The Buddha of knowledge and conqueror of the great ocean is infinite.",
        "source": "T25n1509_001:0057c11_0"
    },
    {
        "source_sentence": "　智度相義佛無礙，　　稽首智度無等佛。",
        "translation": "The Buddha of knowledge and characteristics is unobstructed, the Buddha of wisdom and characteristics is unobstructed, and he pays homage to the unequalled Buddha of knowledge and characteristics.",
        "source": "T25n1509_001:0057c12_0"
    },
    {
        "source_sentence": "　有無二見滅無餘，　　諸法實相佛所說，",
        "translation": "The two views of existence and nonexistence are extinguished without remainder; All things as real characteristics are taught by Buddha.",
        "source": "T25n1509_001:0057c13_0"
    },
    {
        "source_sentence": "　常住不壞淨煩惱，　　稽首佛所尊重法。",
        "translation": "They always abide in the indestructible pure afflictions, bowing their heads to the Buddha's honored teaching.",
        "source": "T25n1509_001:0057c14_0"
    },
    {
        "source_sentence": "　聖眾大海行福田，　　學無學人以莊嚴，",
        "translation": "The great ocean of holy beings’ practice is a field of blessings, Adorned by those who have learning and those who do not.",
        "source": "T25n1509_001:0057c15_0"
    },
    {
        "source_sentence": "　後有愛種永已盡，　　我所既滅根亦除；",
        "translation": "Later, when the seeds of craving have been permanently extinguished, the faculty annihilating self and possessions is also eliminated.",
        "source": "T25n1509_001:0057c16_0"
    },
    {
        "source_sentence": "　已捨世間諸事業，　　種種功德所住處，",
        "translation": "Having abandoned worldly undertakings, Their various virtues are the dwelling places.",
        "source": "T25n1509_001:0057c17_0"
    },
    {
        "source_sentence": "　一切眾中最為上，　　稽首真淨大德僧。",
        "translation": "The best of all the assemblies, bowing his head in homage to the truly pure and virtuous saṃgha.",
        "source": "T25n1509_001:0057c18_0"
    },
    {
        "source_sentence": "　一心恭敬三寶已，　　及諸救世彌勒等；",
        "translation": "Having wholeheartedly honored the Three Treasures, And world-saving Maitreya and so forth.",
        "source": "T25n1509_001:0057c19_0"
    },
    {
        "source_sentence": "　智慧第一舍利弗，　　無諍空行須菩提。",
        "translation": "The supremely wise Śāriputra Has no compassion for the practice of emptiness and needs enlightenment.",
        "source": "T25n1509_001:0057c20_0"
    },
    {
        "source_sentence": "　我今如力欲演說，　　大智彼岸實相義，",
        "translation": "I now want to explain, according to my power, the true characteristics of the other shore of great knowledge.",
        "source": "T25n1509_001:0057c21_0"
    },
    {
        "source_sentence": "　願諸大德聖智人，　　一心善順聽我說！",
        "translation": "May the great virtuous sages and wise people wholeheartedly listen to my teaching!",
        "source": "T25n1509_001:0057c22_0"
    },
    {
        "source_sentence": "問曰：佛以何因緣故說《摩訶般若波羅蜜經》？",
        "translation": "Q: For what reason did the Buddha teach the Mahāprajñāpāramitā-sūtra?",
        "source": "T25n1509_001:0057c23_0"
    },
    {
        "source_sentence": "諸佛法不以無事及小因緣而自發言，譬如須彌山王不以無事及小因緣而動。",
        "translation": "The buddhas and dharmas don't speak for themselves because of nothingness or minor causes, like Mount Sumeru that doesn't move because of nothingness or minor causes.",
        "source": "T25n1509_001:0057c24_1"
    },
    {
        "source_sentence": "今有何等大因緣故，佛說《摩訶般若波羅蜜經》？",
        "translation": "What are the great reasons why the Buddha teaches the Mahāprajñāpāramitā-sūtra?",
        "source": "T25n1509_001:0057c26_0"
    },
    {
        "source_sentence": "答曰：佛於三藏中，廣引種種諸喻，為聲聞說法，不說菩薩道。",
        "translation": "Answer: In the three collections, the Buddha extensively cites various metaphors to explain the path of śrāvakas and not the bodhisattva path.",
        "source": "T25n1509_001:0057c27_1"
    },
    {
        "source_sentence": "唯《中阿含．本末經》中，佛記彌勒菩薩「汝當來世，當得作佛，號字彌勒」，亦不說種種菩薩行。",
        "translation": "Only in the Middle Length Sutra, the Buddha remembers Maitreya Bodhisattva and says, In a future life, you will become a buddha named Maitreya, but he doesn't explain the various bodhisattva practices.",
        "source": "T25n1509_001:0057c28_2"
    },
    {
        "source_sentence": "佛今欲為彌勒等廣說諸菩薩行，是故說《摩訶般若波羅蜜經》。",
        "translation": "The Buddha now wants to explain the bodhisattva practices in detail for Maitreya and others, so he teaches the Mahāprajñāpāramitā-sūtra.",
        "source": "T25n1509_001:0058a01_3"
    },
    {
        "source_sentence": "復次，有菩薩修念佛三昧，佛為彼等欲令於此三昧得增益故說《般若波羅蜜經》。",
        "translation": "Furthermore, there are bodhisattvas who cultivate the samādhi of mindfulness of the Buddha, and the Buddha teaches the Prajñāpāramitā Sutra for their sake because he wants to make this samādhi increase.",
        "source": "T25n1509_001:0058a04_0"
    },
    {
        "source_sentence": "如《般若波羅蜜．初品》中說：「佛現神足，放金色光明，遍照十方恒河沙等世界，示現大身，清淨光明，種種妙色滿虛空中。",
        "translation": "As it's said in the First Chapter of the Prajñāpāramitā, The Buddha manifests his miraculous feet and emits a golden light that shines throughout the worlds like the sands of the Ganges River in the ten directions, revealing a large body with a pure light that fills space with various subtle forms.",
        "source": "T25n1509_001:0058a05_1"
    },
    {
        "source_sentence": "佛在眾中，端正殊妙，無能及者。",
        "translation": "When the Buddha was in the assembly, he was so handsome and marvelous that no one could match him.",
        "source": "T25n1509_001:0058a08_2"
    },
    {
        "source_sentence": "譬如須彌山王，處於大海。」",
        "translation": "It's like Sumeru the king of mountains standing in the ocean.",
        "source": "T25n1509_001:0058a09_3"
    },
    {
        "source_sentence": "諸菩薩見佛神變，於念佛三昧倍復增益，以是事故說《摩訶般若波羅蜜經》。",
        "translation": "When bodhisattvas see the Buddha's miraculous transformation, their mindfulness of the Buddha's samādhi increases even more, and for this reason they teach the Mahāprajñāpāramitā-sūtra.",
        "source": "T25n1509_001:0058a10_4"
    },
    {
        "source_sentence": "　「我生胎分盡，　　是最末後身；",
        "translation": "When the period of my birth in the womb is over, I am the last to be born.",
        "source": "T25n1509_001:0058a11_5"
    },
    {
        "source_sentence": "　　我已得解脫，　　當復度眾生。」",
        "translation": "Once I've attained liberation, I will again save sentient beings.",
        "source": "T25n1509_001:0058a11_5"
    },
    {
        "source_sentence": "復次，菩薩初生時，放大光明，普遍十方，行至七步，四顧觀察，作師子吼而說偈言：作是誓已，身漸長大，欲捨親屬，出家修無上道。",
        "translation": "Furthermore, when the bodhisattva was first born, he emanated a great ray of light that extended throughout the ten directions. After seven paces had passed, he looked around in all directions, made a lion’s roar, and uttered these verses: Having made this vow, my body gradually grew larger; I want to relinquish my kinsmen and relatives, renounce household",
        "source": "T25n1509_001:0058a11_5"
    },
    {
        "source_sentence": "中夜起觀，見諸伎直、后妃婇女，狀若臭屍。",
        "translation": "In the middle of the night, he got up to watch and saw all the court ladies and queen consorts dressed in the form of smelly corpses.",
        "source": "T25n1509_001:0058a17_6"
    },
    {
        "source_sentence": "即命車匿，令被白馬，夜半踰城，行十二由旬，到跋伽婆仙人所住林中，以刀剃髮，以上妙寶衣，貿麁布僧伽梨。",
        "translation": "At midnight he crossed the city for twelve yojanas and arrived at the forest where the ṛṣi Vajrapāṇi lived. He shaved his hair with a knife, covered his upper clothes with exquisite jeweled cloth, and traded silk cloth to spread it over the monks’ robes.",
        "source": "T25n1509_001:0058a18_7"
    },
    {
        "source_sentence": "於泥連禪河側，六年苦行，日食一麻，或食一米等，而自念言：「是處非道！」",
        "translation": "On the bank of the Nairañjanā River, he practiced austerities for six years, eating a grain of hemp or rice every day and thought to himself, This place is not the path!",
        "source": "T25n1509_001:0058a20_8"
    },
    {
        "source_sentence": "爾時，菩薩捨苦行處，到菩提樹下，坐金剛處。",
        "translation": "At the time, the bodhisattva abandoned the place of austerities, went to the foot of the bodhi tree, and sat down in the adamantine place.",
        "source": "T25n1509_001:0058a22_9"
    },
    {
        "source_sentence": "魔王將十八億萬眾來壞菩薩，菩薩以智慧功德力故，降魔眾已，即得阿耨多羅三藐三菩提。",
        "translation": "The king of Māra came with 1,800,000,000 people to destroy the bodhisattva, and because of the power of wisdom and virtue, the bodhisattva subdued the demons and then attained unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_001:0058a23_10"
    },
    {
        "source_sentence": "是時三千大千世界主梵天王，名式棄，及色界諸天等，釋提桓因及欲界諸天等，并四天王，皆詣佛所，勸請世尊初轉法輪；",
        "translation": "At that time Brahma, the king of the Brahma heavens in the great manifold cosmos, named Śikhin, and the other gods in the realm of form, as well as Sakra Devānām-Indra and the other gods in the realm of desire, together with the four deva kings, all approached the Buddha and invited him to turn the wheel of the Dharma for the first time.",
        "source": "T25n1509_001:0058a25_11"
    },
    {
        "source_sentence": "亦是菩薩念本所願，及大慈大悲故，受請說法。",
        "translation": "It's also because of the bodhisattva's mindfulness of what he originally wished and great kindness and compassion that he accepted the invitation to teach the Dharma.",
        "source": "T25n1509_001:0058a28_12"
    },
    {
        "source_sentence": "諸法甚深者，般若波羅蜜是。",
        "translation": "The profoundness of all dharmas is the perfection of wisdom.",
        "source": "T25n1509_001:0058a29_13"
    },
    {
        "source_sentence": "以是故佛說《摩訶般若波羅蜜經》。",
        "translation": "That's why the Buddha taught the Mahāprajñāpāramitā-sūtra.",
        "source": "T25n1509_001:0058b01_14"
    },
    {
        "source_sentence": "復次，有人疑佛不得一切智。",
        "translation": "Furthermore, some people doubt that the Buddha won't attain omniscience.",
        "source": "T25n1509_001:0058b02_15"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_001:0058b03_16"
    },
    {
        "source_sentence": "諸法無量無數，云何一人能知一切法？",
        "translation": "The teachings are immeasurable and countless, so how could one person know all the teachings?",
        "source": "T25n1509_001:0058b03_17"
    },
    {
        "source_sentence": "佛住般若波羅蜜實相清淨如虛空，無量無數法中，自發誠言：「我是一切智人。」",
        "translation": "The Buddha abides in the true characteristics of prajñā-pāramitā as pure as space, and in measureless and countless dharmas, he arouses his own sincerity and says, I am a person of omniscience.",
        "source": "T25n1509_001:0058b04_18"
    },
    {
        "source_sentence": "欲斷一切眾生疑，以是故說《摩訶般若波羅蜜經》。",
        "translation": "Desiring to end the doubts of all sentient beings, he therefore taught the Mahāprajñāpāramitā-sūtra.",
        "source": "T25n1509_001:0058b06_19"
    },
    {
        "source_sentence": "復次，有眾生應得度者，以佛大功德智慧無量，難知難解故，為惡師所惑，心沒邪法，不入正道。",
        "translation": "Furthermore, there are sentient beings who should be liberated because the Buddha's great merit and wisdom are immeasurable, difficult to know and difficult to understand, and they're confused by bad teachers, whose minds submerge wrong dharmas and don't enter the right path.",
        "source": "T25n1509_001:0058b07_20"
    },
    {
        "source_sentence": "為是輩人，起大慈心，以大悲手授之，令入佛道；",
        "translation": "For the sake of these people he generated great compassion and handed them over with his hands of great compassion, enabling them to enter the buddha path.",
        "source": "T25n1509_001:0058b09_21"
    },
    {
        "source_sentence": "是故自現最妙功德，出大神力。",
        "translation": "That's why he shows himself the most marvelous merit and produces great supernormal powers.",
        "source": "T25n1509_001:0058b10_22"
    },
    {
        "source_sentence": "如《般若波羅蜜．初品》中說：「佛入三昧王三昧，從三昧起，以天眼觀十方世界，舉身毛孔皆笑，從其足下千輻輪相，放六百千萬億種種色光明，從足指上至肉髻，處處各放六百千萬億種種色光明，普照十方無量無數如恒沙等諸佛世界，皆令大明。」",
        "translation": "As it's said in the First Chapter of the Prajñāpāramitā, the Buddha enters the samādhi king samādhi, arises from that samādhi, observes the worlds in the ten directions with the divine eye, raises his body hair pores and smiles, produces a thousand-spoked wheel form beneath his feet, radiates six hundred million millions of billions of various kinds of",
        "source": "T25n1509_001:0058b11_23"
    },
    {
        "source_sentence": "佛從三昧起，欲宣示一切諸法實相，斷一切眾生疑結故，說《般若波羅蜜經》。",
        "translation": "When the Buddha arises from samādhi, he wants to reveal the true characteristics of all dharmas and ends the bond of doubt in all sentient beings, so he teaches the Prajñāpāramitā Sutra.",
        "source": "T25n1509_001:0058b17_24"
    },
    {
        "source_sentence": "復次，有惡邪人，懷嫉妬意，誹謗言：「佛智慧不出於人，但以幻術惑世。」",
        "translation": "Furthermore, there are bad and evil people who harbor jealousy and denigrate it, saying, The Buddha's wisdom doesn't come from people but confuses the world with illusory tricks.",
        "source": "T25n1509_001:0058b19_25"
    },
    {
        "source_sentence": "斷彼貢高邪慢意故，現無量神力、無量智慧力，於《般若波羅蜜》中，自說：「我神德無量，三界特尊，為一切覆護。",
        "translation": "Because he had cut off their arrogant conceit, he manifested measureless supernormal powers and the power of wisdom and said to himself in the Prajñāpāramitā, My supernormal powers are immeasurable, especially honored in the three realms, for the protection of all.",
        "source": "T25n1509_001:0058b21_0"
    },
    {
        "source_sentence": "若一發惡念，獲罪無量；",
        "translation": "If one evil thought is aroused, immeasurable sins are committed.",
        "source": "T25n1509_001:0058b23_1"
    },
    {
        "source_sentence": "一發淨信，受人天樂，必得涅槃果。」",
        "translation": "Once you give rise to pure faith, you'll receive the happiness of humans and gods and surely attain the fruit of nirvāṇa.",
        "source": "T25n1509_001:0058b24_2"
    },
    {
        "source_sentence": "復次，欲令人信受法故，言：「我是大師，有十力、四無所畏，安立聖主住處，心得自在，能師子吼，轉妙法輪，於一切世界最尊最上。」",
        "translation": "Furthermore, because they want to make people believe and accept the teaching, they say, This is the great teacher who has the ten powers and four fearlessnesses, establishes a noble dwelling place, attains freedom of mind, can roar like a lion, turns the wonderful Dharma wheel, and is the most honored and highest among all the worlds.",
        "source": "T25n1509_001:0058b25_0"
    },
    {
        "source_sentence": "復次，佛世尊欲令眾生歡喜故，說是《般若波羅蜜經》言：「汝等應生大喜！",
        "translation": "Furthermore, because the Bhagavān wanted to cause sentient beings to rejoice, he spoke this Prajñāpāramitā Sutra, saying, You should give rise to great joy!",
        "source": "T25n1509_001:0058b28_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_001:0058b29_1"
    },
    {
        "source_sentence": "一切眾生入邪見網，為異學惡師所惑，我於一切惡師邪網中得出。",
        "translation": "All sentient beings enter the net of wrong views and are deluded by bad teachers from different schools, and I'm freed from the net of all bad teachers.",
        "source": "T25n1509_001:0058b29_2"
    },
    {
        "source_sentence": "十力大師，難可值見，汝今已遇，我隨時開發三十七品等諸深法藏，恣汝採取。」",
        "translation": "It's difficult to meet the great teacher of the ten powers, but now that you've met him, I will develop the thirty-seven chapters of the profound treasure house of the Dharma at any time and let you pick it up.",
        "source": "T25n1509_001:0058c02_3"
    },
    {
        "source_sentence": "復次，一切眾生為結使病所煩惱，無始生死已來，無人能治此病者，常為外道惡師所誤。",
        "translation": "Furthermore, all sentient beings are afflicted by the disease of bondage, and since beginningless birth and death no one has been able to treat this illness, which is always mistakenly explained by bad non-Buddhist teachers.",
        "source": "T25n1509_001:0058c04_4"
    },
    {
        "source_sentence": "我今出世為大醫王，集諸法藥，汝等當服。",
        "translation": "Now that I have appeared in the world as a great king of doctors, collecting all the medicines of the Dharma, you should take them.",
        "source": "T25n1509_001:0058c06_5"
    },
    {
        "source_sentence": "是故佛說《摩訶般若波羅蜜經》。",
        "translation": "That's why the Buddha taught the Mahāprajñāpāramitā-sūtra.",
        "source": "T25n1509_001:0058c07_6"
    },
    {
        "source_sentence": "復次，有人念言：「佛與人同，亦有生死，實受飢渴、寒熱、老病苦。」",
        "translation": "Furthermore, some people think, The Buddha is the same as humans, which also have birth-and-death, and they really experience hunger, thirst, cold, heat, old age, illness, and pain.",
        "source": "T25n1509_001:0058c08_7"
    },
    {
        "source_sentence": "佛欲斷彼意故，說是《摩訶般若波羅蜜經》。",
        "translation": "Because the Buddha wanted to stop their thoughts, he taught this Mahāprajñāpāramitā-sūtra.",
        "source": "T25n1509_001:0058c09_8"
    },
    {
        "source_sentence": "示言：「我身不可思議，梵天王等諸天祖父，於恒河沙等劫中，欲思量我身、尋究我聲，不能測度，況我智慧三昧？」",
        "translation": "He said, My body is inconceivable, so why wouldn't Brahmā and other gods and grandfathers want to contemplate my body and investigate my voice for eons as numerous as the grains of sand in the Ganges River, let alone my samādhi of wisdom?",
        "source": "T25n1509_001:0058c10_9"
    },
    {
        "source_sentence": "　「諸法實相中，　　諸梵天王等，",
        "translation": "Among the true characteristics of all dharmas, The Brahmadeva kings and so forth.",
        "source": "T25n1509_001:0058c13_10"
    },
    {
        "source_sentence": "　　一切天地主，　　迷惑不能了！",
        "translation": "All the lords of heaven and earth are confused and unable to understand!",
        "source": "T25n1509_001:0058c13_10"
    },
    {
        "source_sentence": "　　此法甚深妙，　　無能測量者，",
        "translation": "This teaching is so profound and subtle That no one can fathom it.",
        "source": "T25n1509_001:0058c13_10"
    },
    {
        "source_sentence": "　　佛出悉開解，　　其明如日照。」",
        "translation": "The Buddha comes out to fully enlighten, and his insight is as bright as the sun shining.",
        "source": "T25n1509_001:0058c13_10"
    },
    {
        "source_sentence": "　「虛空無有邊，　　佛功德亦爾；",
        "translation": "Space has no bounds, So is Buddha’s virtue.",
        "source": "T25n1509_001:0058c13_10"
    },
    {
        "source_sentence": "　　設欲量其身，　　唐勞不能盡！",
        "translation": "Even if they want to measure their bodies, They can't do so in vain!",
        "source": "T25n1509_001:0058c13_10"
    },
    {
        "source_sentence": "　　上過虛空界，　　無量諸佛土，",
        "translation": "Beyond the realm of space there are boundless buddha-lands.",
        "source": "T25n1509_001:0058c13_10"
    },
    {
        "source_sentence": "　　見釋師子身，　　如故而不異！",
        "translation": "Seeing the body of the Buddha’s lion Is As it is, without any difference!",
        "source": "T25n1509_001:0058c13_10"
    },
    {
        "source_sentence": "　　佛身如金山，　　演出大光明，",
        "translation": "The Buddha’s body is like a mountain of gold, Producing great light.",
        "source": "T25n1509_001:0058c13_10"
    },
    {
        "source_sentence": "　　相好自莊嚴，　　猶如春華敷。」",
        "translation": "Their features are self-adorned, just like the spring flowers spread out.",
        "source": "T25n1509_001:0058c13_10"
    },
    {
        "source_sentence": "如偈說：又如佛初轉法輪時，應時菩薩從他方來，欲量佛身，上過虛空無量佛剎，至華上佛世界，見佛身如故，菩薩說言：如佛身無量，光明、音響亦復無量，戒、定、慧等諸佛功德皆悉無量。",
        "translation": "Also, just as when the Buddha first turns the wheel of the Dharma, the bodhisattva then comes from another place and wants to measure the Buddha's body, so he goes up through an infinite number of buddha-bodies in space up to the Buddha's world on top of the Flower Trees and sees the Buddha's body as it is. The bodhisattva says, Just as the Buddha's body has no",
        "source": "T25n1509_001:0058c13_10"
    },
    {
        "source_sentence": "如《密迹經》中三密，此中應廣說。",
        "translation": "As the three mysteries in the Sutra of the Mysterious Teachings explain, these should be explained in detail here.",
        "source": "T25n1509_001:0059a03_11"
    },
    {
        "source_sentence": "復次，佛初生時，墮地行七步，口自發言，言竟便默，如諸嬰孩，不行不語，乳餔三歲，諸母養育，漸次長大。",
        "translation": "Furthermore, when the Buddha was first born, he fell to the ground and walked seven paces. He uttered these words in his mouth, but after uttering them he remained silent like a small child that did not speak or said anything. It was three years old when it was nurtured by its mothers and gradually grew into adulthood.",
        "source": "T25n1509_001:0059a04_12"
    },
    {
        "source_sentence": "然佛身無數，過諸世間，為眾生故，現如凡人。",
        "translation": "But the buddha-bodies are countless, surpassing all worlds. For the sake of sentient beings they appear like ordinary people.",
        "source": "T25n1509_001:0059a06_13"
    },
    {
        "source_sentence": "凡人生時，身分諸根及其意識未成就故，身四威儀：坐、臥、行、住，言談語默，種種人法，皆悉未了；",
        "translation": "When they are born, because the faculties of body, sense faculties, and thinking consciousness have not yet been accomplished. The four modes of bodily comportment—seated, lying down, walking, standing, speaking, and being silent—they do not understand all manner of persons or things.",
        "source": "T25n1509_001:0059a07_14"
    },
    {
        "source_sentence": "日月歲過，漸漸習學，能具人法。",
        "translation": "Each passing day and month, as the years pass, they gradually learn and study in order to be able to keep up the human condition.",
        "source": "T25n1509_001:0059a09_15"
    },
    {
        "source_sentence": "今佛云何生便能語能行，後更不能？",
        "translation": "How can the Buddha now that he's born be able to speak and act, and how can he not do so later?",
        "source": "T25n1509_001:0059a10_16"
    },
    {
        "source_sentence": "以此致怪！",
        "translation": "This is why it's so strange!",
        "source": "T25n1509_001:0059a11_17"
    },
    {
        "source_sentence": "但為此故，以方便力，現行人法，如人威儀，令諸眾生信於深法。",
        "translation": "For this reason, through the power of skillful means he manifested himself as a human being and practiced the Dharma according to people’s manner. He caused sentient beings to believe in the profound Dharma.",
        "source": "T25n1509_001:0059a11_18"
    },
    {
        "source_sentence": "若菩薩生時，便能行能語，世人當作是念：「今見此人，世未曾有，必是天、龍、鬼、神，其所學法，必非我等所及。",
        "translation": "If a bodhisattva is born, then he's able to act and speak. The people of the world will think, Now, when they see this person, it's unprecedented in the world that they must be gods, dragons, ghosts, or spirits, and their teachings won't reach us.",
        "source": "T25n1509_001:0059a13_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_001:0059a15_20"
    },
    {
        "source_sentence": "我等生死肉身，為結使業所牽，不得自在。",
        "translation": "We are born in the flesh body of birth and death, which is tethered by the karmic forces of bondage and doesn't attain mastery.",
        "source": "T25n1509_001:0059a15_21"
    },
    {
        "source_sentence": "如此深法，誰能及之？」",
        "translation": "Who can surpass such a profound teaching?",
        "source": "T25n1509_001:0059a16_22"
    },
    {
        "source_sentence": "以此自絕，不得成賢聖法器。",
        "translation": "Because of this self-cessation, they won't be able to become the Dharma vessel of the wise and noble ones.",
        "source": "T25n1509_001:0059a17_23"
    },
    {
        "source_sentence": "為是人故，於嵐毘尼園中生。",
        "translation": "Because of these people, he was born in the Lumbinī Park.",
        "source": "T25n1509_001:0059a18_24"
    },
    {
        "source_sentence": "雖即能至菩提樹下成佛，以方便力故，而現作孩童、幼小、年少、成人；",
        "translation": "Even though they can reach buddhahood at the foot of an enlightenment tree, by the power of skill in means they appear to be children, young, old, and adult.",
        "source": "T25n1509_001:0059a18_25"
    },
    {
        "source_sentence": "於諸時中次第而受嬉戲、術藝、服御、五欲，具足人法。",
        "translation": "At each time, they'll receive the five desires of play, arts and crafts, clothing, and the five desires in order, and they'll be fully endowed with human qualities.",
        "source": "T25n1509_001:0059a20_26"
    },
    {
        "source_sentence": "後漸見老、病、死苦，生厭患心，於夜中半，踰城出家，到鬱特伽阿羅洛仙人所，現作弟子而不行其法。",
        "translation": "Later, gradually seeing the suffering of old age, illness, and death, he became disillusioned with it. At midnight he crossed the city and renounced the householder’s life. He came to the place where the holy sage Uttarakuru was staying. Now he is a disciple but does not practice his religious path.",
        "source": "T25n1509_001:0059a21_27"
    },
    {
        "source_sentence": "雖常用神通，自念宿命，迦葉佛時持戒行道，而今現修苦行六年求道。",
        "translation": "Even though he always used his supernormal powers to think of his past lives, Kāśyapa Buddha observed precepts and practiced the path at the time, but now he's cultivating austerities for six years to seek the path.",
        "source": "T25n1509_001:0059a24_28"
    },
    {
        "source_sentence": "菩薩雖主三千大千世界，而現破魔軍，成無上道。",
        "translation": "Although the bodhisattva lords a world of 3,000 great one-thousand worlds, he manifests to destroy the army of Māra and achieve the unsurpassed path.",
        "source": "T25n1509_001:0059a25_29"
    },
    {
        "source_sentence": "隨順世法故，現是眾變。",
        "translation": "Because they conform to worldly dharmas, they are manifested as myriad transformations.",
        "source": "T25n1509_001:0059a27_30"
    },
    {
        "source_sentence": "今於《般若波羅蜜》中現大神通智慧力故，諸人當知佛身無數，過諸世間。",
        "translation": "Now, in the Prajñāpāramitā, he shows the great power of supernormal knowledge and wisdom, so people should know that the Buddha's body is countless and surpasses all the worlds.",
        "source": "T25n1509_001:0059a27_31"
    },
    {
        "source_sentence": "復次，有人應可度者，或墮二邊；",
        "translation": "“Furthermore, some people should be liberated, but some may fall into two extremes.",
        "source": "T25n1509_001:0059a29_32"
    },
    {
        "source_sentence": "或以無智故，但求身樂；",
        "translation": "Some, because of ignorance, simply seek physical bliss.",
        "source": "T25n1509_001:0059b01_33"
    },
    {
        "source_sentence": "或有為道故，修著苦行。",
        "translation": "Or it is because of the conditioned path that they develop attachment to unsatisfactoriness.",
        "source": "T25n1509_001:0059b01_34"
    },
    {
        "source_sentence": "如是人等，於第一義中，失涅槃正道。",
        "translation": "Such people and so forth lose the right path of nirvāṇa in the ultimate truth.",
        "source": "T25n1509_001:0059b02_35"
    },
    {
        "source_sentence": "佛欲拔此二邊，令入中道，故說《摩訶般若波羅蜜經》。",
        "translation": "Desiring to remove these two extremes and cause them to enter the middle way, the Buddha therefore taught the Mahāprajñāpāramitā-sūtra.",
        "source": "T25n1509_001:0059b03_36"
    },
    {
        "source_sentence": "復次，分別生身、法身供養果報故，說《摩訶般若波羅蜜經》，如〈舍利塔品〉中說。",
        "translation": "Furthermore, it's because they discriminate between the body that arises and the Dharma body as an offering of fruition that they teach the Mahāprajñāpāramitā-sūtra, as explained in the Śāriputra Chapter.",
        "source": "T25n1509_001:0059b04_37"
    },
    {
        "source_sentence": "復次，欲說阿鞞跋致，阿鞞跋致相故說。",
        "translation": "Furthermore, in order to explain abhidharma, it is spoken of because of the characteristic marks of abhidharma.",
        "source": "T25n1509_001:0059b06_38"
    },
    {
        "source_sentence": "又為魔幻、魔事故說。",
        "translation": "It's also explained for the sake of demonic illusions and demonic incidents.",
        "source": "T25n1509_001:0059b07_39"
    },
    {
        "source_sentence": "復次，為當來世人，供養般若波羅蜜因緣故；",
        "translation": "“Furthermore, it is for the sake of future generations as a cause and condition for making offerings to the transcendent wisdom.",
        "source": "T25n1509_001:0059b07_40"
    },
    {
        "source_sentence": "又欲授三乘記別故，說是《般若波羅蜜經》。",
        "translation": "Also, because they want to teach the distinctive meanings of the three vehicles, they say this is the Perfection of Wisdom Sutra.",
        "source": "T25n1509_001:0059b08_41"
    },
    {
        "source_sentence": "如佛告阿難：「我涅槃後，此般若波羅蜜當至南方，從南方至西方，後五百歲中當至北方。",
        "translation": "It's like when the Buddha told Ānanda, After my nirvāṇa, this prajñāpāramitā will reach the south and from the south to the west for five hundred years after it reaches the north.",
        "source": "T25n1509_001:0059b09_42"
    },
    {
        "source_sentence": "是中多有信法善男子、善女人，種種華香、瓔珞、幢幡、伎樂、燈明、珍寶，以財物供養。",
        "translation": "Good men and good women who believed in the Dharma offered various kinds of flowers, fragrances, jewelry, banners, music, lamps, and precious treasures as offerings.",
        "source": "T25n1509_001:0059b11_43"
    },
    {
        "source_sentence": "若自書，若教人書，若讀誦、聽說，正憶念、修行，以法供養。",
        "translation": "If he writes it himself, teaches others to write it, recites it, listens to it, correctly remembers it, and practices it, he makes offerings with the Dharma.",
        "source": "T25n1509_001:0059b13_44"
    },
    {
        "source_sentence": "是人以是因緣故，受種種世間樂；",
        "translation": "Because of these causes and conditions, they experience various worldly pleasures.",
        "source": "T25n1509_001:0059b15_45"
    },
    {
        "source_sentence": "末後得三乘，入無餘涅槃。」",
        "translation": "At the end, he'll attain the three vehicles and enter nirvāṇa without remainder.",
        "source": "T25n1509_001:0059b15_46"
    },
    {
        "source_sentence": "如是等觀諸品中因緣事故，說《般若波羅蜜經》。",
        "translation": "Such are the causes and conditions for observing the events in the various chapters, which are explained in the Prajñāpāramitā Sutra.",
        "source": "T25n1509_001:0059b16_47"
    },
    {
        "source_sentence": "復次，佛欲說第一義悉檀相故，說是《般若波羅蜜經》。",
        "translation": "Furthermore, because the Buddha wanted to explain the accomplishment of the ultimate truth, he taught this prajñāpāramitā sūtra.",
        "source": "T25n1509_001:0059b17_48"
    },
    {
        "source_sentence": "有四種悉檀：一者、世界悉檀，二者、各各為人悉檀，三者、對治悉檀，四者、第一義悉檀。",
        "translation": "There are four kinds of accomplishment: 1. accomplishment of worldly accomplishment, 2. accomplishment of individual accomplishment for people, 3. accomplishment of antidote accomplishment, and 4. accomplishment of the ultimate truth.",
        "source": "T25n1509_001:0059b18_49"
    },
    {
        "source_sentence": "四悉檀中，一切十二部經，八萬四千法藏，皆是實，無相違背。",
        "translation": "In the four siddhântas, all twelve kinds of scriptures and eighty-four thousand collections of teachings are true, without contradiction or opposition.",
        "source": "T25n1509_001:0059b20_50"
    },
    {
        "source_sentence": "佛法中，有以世界悉檀故實，有以各各為人悉檀故實，有以對治悉檀故實，有以第一義悉檀故實。",
        "translation": "Among the Buddha's teachings, there are those that are real because of the accomplishment of worldly accomplishments, those that are real because of the accomplishment of individual accomplishments for people, those that are real because of the accomplishment of antidotes, and those that are real because of the accomplishment of the ultimate truth.",
        "source": "T25n1509_001:0059b22_51"
    },
    {
        "source_sentence": "有世界者，有法從因緣和合故有，無別性。",
        "translation": "“There are worlds”: Certain factors exist because of the conjunction of causes and conditions. They do not have a specific nature.",
        "source": "T25n1509_001:0059b24_52"
    },
    {
        "source_sentence": "譬如車，轅、軸、輻、輞等和合故有，無別車。",
        "translation": "It's like a chariot that exists because of the combination of spokes, shafts, spokes, rims, and so forth, and there's no separate chariot.",
        "source": "T25n1509_001:0059b25_53"
    },
    {
        "source_sentence": "人亦如是，五眾和合故有，無別人。",
        "translation": "The same applies to humans. Because of the conjunction of five groups, there is existence and no other person.",
        "source": "T25n1509_001:0059b26_54"
    },
    {
        "source_sentence": "若無世界悉檀者，佛是實語人，云何言「我以清淨天眼，見諸眾生隨善惡業死此生彼受果報；",
        "translation": "If there were no worldly siddhânta, the Buddha would be a man of true speech. How could he have said: “With my pure divine eye I see all sentient beings who die here and are reborn here as a result of good or evil deeds”?",
        "source": "T25n1509_001:0059b27_55"
    },
    {
        "source_sentence": "善業者生天人中，惡業者墮三惡道」？",
        "translation": "Good actions are born among gods and humans, and bad actions fall into the three bad destinies?",
        "source": "T25n1509_001:0059b29_56"
    },
    {
        "source_sentence": "復次，經言：「一人出世，多人蒙慶，福樂饒益，佛世尊也。」",
        "translation": "Furthermore, the sūtra says, One person emerges in the world, and many people are blessed, benefited by merit and happiness, which is the Bhagavān.",
        "source": "T25n1509_001:0059c01_57"
    },
    {
        "source_sentence": "如《法句》中說：「神自能救神，他人安能救！",
        "translation": "As it's said in the Dharma sentence, The soul itself can save the soul, and so can others save it!",
        "source": "T25n1509_001:0059c02_58"
    },
    {
        "source_sentence": "神自行善智，是最能自救。」",
        "translation": "The soul that self-manifests itself with good cognition is the best able to save itself.",
        "source": "T25n1509_001:0059c03_59"
    },
    {
        "source_sentence": "如《瓶沙王迎經》中佛說：「凡人不聞法，凡人著於我。」",
        "translation": "As the Buddha said in the Vaiśravaṇa King's Greeting Sutra, Ordinary people don't hear the teaching, and ordinary people are attached to me.",
        "source": "T25n1509_001:0059c04_60"
    },
    {
        "source_sentence": "又《佛二夜經》中說：「佛初得道夜，至般涅槃夜，是二夜中間所說經教，一切皆實不顛倒。」",
        "translation": "It's also said in the Buddha's Two-Night Sutra, The first night of the Buddha's attainment of enlightenment and the second night of his parinirvāṇa are the sūtras and teachings taught between the two nights, all true and not mistaken.",
        "source": "T25n1509_001:0059c05_61"
    },
    {
        "source_sentence": "若實無人者，佛云何言「我天眼見眾生」？",
        "translation": "If there really is no one, then how does the Buddha say, I see sentient beings with the divine eye?",
        "source": "T25n1509_001:0059c07_62"
    },
    {
        "source_sentence": "是故當知有人者，世界悉檀，故非是第一義悉檀。",
        "translation": "Therefore, you should know that someone is the accomplishment of worldly accomplishment, so they aren't the accomplishment of the ultimate truth.",
        "source": "T25n1509_001:0059c08_63"
    },
    {
        "source_sentence": "問曰：第一悉檀是真實，實故名第一，餘者不應實。",
        "translation": "Q: The first accomplishment is real, and it's called the first because it's real; the rest shouldn't be real.",
        "source": "T25n1509_001:0059c09_64"
    },
    {
        "source_sentence": "答曰：不然！",
        "translation": "Answer, No!",
        "source": "T25n1509_001:0059c10_65"
    },
    {
        "source_sentence": "是四悉檀各各有實，如如、法性、實際，世界悉檀故無，第一義悉檀故有。",
        "translation": "Each of these four siddhântas has its own reality, which is thusness, dharma-nature, and actuality. Because worlds are siddhântas, they do not exist; because of being the siddhânta of the ultimate truth, they exist.",
        "source": "T25n1509_001:0059c11_66"
    },
    {
        "source_sentence": "人等亦如是，世界悉檀故有，第一義悉檀故無。",
        "translation": "The same applies to humans and so on. Because worlds are accomplished by means of sandalwood, they exist; because the highest truth is accomplished by means of sandalwood, they do not.",
        "source": "T25n1509_001:0059c12_67"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_001:0059c14_68"
    },
    {
        "source_sentence": "人五眾因緣有故有是人等。",
        "translation": "'The five groups of people exist because their causes and conditions exist, so there are these people.'",
        "source": "T25n1509_001:0059c14_69"
    },
    {
        "source_sentence": "譬如乳，色、香、味、觸因緣有故有是乳；",
        "translation": "Good man, this is analogous to the case of milk. Because form, odor, taste, and tactile sensation are present as causes and conditions for its existence, there is this kind of milk.",
        "source": "T25n1509_001:0059c15_70"
    },
    {
        "source_sentence": "若乳實無，乳因緣亦應無。",
        "translation": "If milk really is nonexistent, the causes and conditions of milk would also be nonexistent.",
        "source": "T25n1509_001:0059c15_71"
    },
    {
        "source_sentence": "今乳因緣實有故，乳亦應有；",
        "translation": "Now, since the causes and conditions of milk really exist, there should also be milk.",
        "source": "T25n1509_001:0060a01_72"
    },
    {
        "source_sentence": "非如一人第二頭、第三手，無因緣而有假名。",
        "translation": "It's not like the second head or third hand of a person who has a nominal name without a cause or condition.",
        "source": "T25n1509_001:0060a02_73"
    },
    {
        "source_sentence": "如是等相，名為世界悉檀。",
        "translation": "Such characteristics are called worldly accomplishment.",
        "source": "T25n1509_001:0060a03_74"
    },
    {
        "source_sentence": "云何各各為人悉檀者？",
        "translation": "How are each accomplished as a human being?",
        "source": "T25n1509_001:0060a04_0"
    },
    {
        "source_sentence": "觀人心行而為說法，於一事中，或聽或不聽。",
        "translation": "He observes the mind's actions and explains the teaching, whether he hears or doesn't hear them in a single thing.",
        "source": "T25n1509_001:0060a04_1"
    },
    {
        "source_sentence": "如經中所說：「雜報業故，雜生世間，得雜觸、雜受。」",
        "translation": "As the sūtras say, It's because of the karma of mixed retribution that the world is born in a mixed way and gets mixed contact and mixed feelings.",
        "source": "T25n1509_001:0060a05_2"
    },
    {
        "source_sentence": "更有《破群那經》中說：「無人得觸，無人得受。」",
        "translation": "It's also said in the破群那經, There's no one who can touch it and no one who can receive it.",
        "source": "T25n1509_001:0060a06_3"
    },
    {
        "source_sentence": "問曰：此二經云何通？",
        "translation": "Q: How are these two sūtras shared?",
        "source": "T25n1509_001:0060a07_4"
    },
    {
        "source_sentence": "答曰：以有人疑後世，不信罪福，作不善行，墮斷滅見；",
        "translation": "Answer: It is because some people doubt that in later ages they will not believe in sins and merits, do unwholesome deeds, and fall into the view of annihilation.",
        "source": "T25n1509_001:0060a08_5"
    },
    {
        "source_sentence": "欲斷彼疑，捨彼惡行，欲拔彼斷見，是故說雜生世間、雜觸、雜受。",
        "translation": "They want to stop their doubts, abandon their bad actions, and want to remove their views of cessation. That's why they say the world is mixed with sentient beings, mixed with touch, and mixed with feeling.",
        "source": "T25n1509_001:0060a09_6"
    },
    {
        "source_sentence": "是破群那計有我有神，墮計常中。",
        "translation": "This refutes the idea that there's a self and soul in the group of people, and it falls into the category of eternalism.",
        "source": "T25n1509_001:0060a11_7"
    },
    {
        "source_sentence": "破群那問佛言：「大德！",
        "translation": "Prabhūtaratna asked the Buddha, Mañjuśrī!",
        "source": "T25n1509_001:0060a12_8"
    },
    {
        "source_sentence": "誰受？」",
        "translation": "Who will receive it?",
        "source": "T25n1509_001:0060a12_9"
    },
    {
        "source_sentence": "若佛說「某甲某甲受」，便墮計常中，其人我見倍復牢固，不可移轉，以是故不說有受者、觸者。",
        "translation": "If the Buddha says, 'Some person receives,' then they'll fall into the category of eternalism, and that person's view of self is doubly stronger and unchanging, so it doesn't say there's a sensation or touch.",
        "source": "T25n1509_001:0060a13_0"
    },
    {
        "source_sentence": "如是等相，是名各各為人悉檀。",
        "translation": "Such characteristics and so forth are each called a person's accomplishment.",
        "source": "T25n1509_001:0060a15_1"
    },
    {
        "source_sentence": "對治悉檀者，有法，對治則有，實性則無。",
        "translation": "“The antidote accomplishes”: Because there are factors, the antidote is then to be found; but the real nature’? is not to be found.",
        "source": "T25n1509_001:0060a15_2"
    },
    {
        "source_sentence": "譬如重、熱、膩、酢、醎藥草飲食等，於風病中名為藥，於餘病非藥；",
        "translation": "Good man, it is analogous to the fact that healing in relation to ailments of weakness, fever, heat, greasiness, vinegar, abscesses, herbs, food and drink, etc., is known as medicine when they are attacked by wind but not medicine for other illnesses.",
        "source": "T25n1509_001:0060a16_3"
    },
    {
        "source_sentence": "若輕、冷、甘、苦、澁藥草飲食等，於熱病名為藥，於餘病非藥；",
        "translation": "If it is light, cold, sweet, painful, bitter, salty, herbs, food and drink etc., they are said to be medicine for fever and not medicine for the other illnesses.",
        "source": "T25n1509_001:0060a18_4"
    },
    {
        "source_sentence": "若輕、辛、苦、澁、熱藥草飲食等，於冷病中名為藥，於餘病非藥。",
        "translation": "If light, pungent, bitter, painful, salty, and hot medicines, herbs, food, and so forth are called medicine when they're cold and not medicine when they're other illnesses.",
        "source": "T25n1509_001:0060a19_5"
    },
    {
        "source_sentence": "佛法中治心病亦如是：不淨觀思惟，於貪欲病中，名為善對治法；",
        "translation": "In the Buddha’s doctrine, it is likewise with the antidote for the defilement of thought:",
        "source": "T25n1509_001:0060a21_6"
    },
    {
        "source_sentence": "於瞋恚病中，不名為善，非對治法。",
        "translation": "Among the illnesses of anger, they aren't called good and aren't antidotes.",
        "source": "T25n1509_001:0060a22_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_001:0060a23_8"
    },
    {
        "source_sentence": "觀身過失，名不淨觀；",
        "translation": "Observing body faults is called ‘observing the repulsive’.",
        "source": "T25n1509_001:0060a23_9"
    },
    {
        "source_sentence": "若瞋恚人觀過失者，則增益瞋恚火故。",
        "translation": "If an angry person observes faults, then they'll increase the fire of anger.",
        "source": "T25n1509_001:0060a24_10"
    },
    {
        "source_sentence": "思惟慈心，於瞋恚病中，名為善對治法；",
        "translation": "To meditate on kindness and compassion is to be called a good antidote for the sickness of anger.",
        "source": "T25n1509_001:0060a25_11"
    },
    {
        "source_sentence": "於貪欲病中，不名為善，非對治法。",
        "translation": "In the case of a sickness caused by attachment to sensual pleasure, it is not called “good” or “counteractive”.",
        "source": "T25n1509_001:0060a26_12"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_001:0060a27_13"
    },
    {
        "source_sentence": "慈心於眾生中求好事、觀功德；",
        "translation": "“Great enlightening beings have compassion for sentient beings, seeking to do good among sentient beings and observing their virtues.",
        "source": "T25n1509_001:0060a27_14"
    },
    {
        "source_sentence": "若貪欲人求好事、觀功德者，則增益貪欲故。",
        "translation": "If someone with desire seeks goodness and observes merit, then they'll increase craving.",
        "source": "T25n1509_001:0060a28_15"
    },
    {
        "source_sentence": "因緣觀法，於愚癡病中，名為善對治法；",
        "translation": "Observing the law in relation to causes and conditions is said to be a good antidote for the sickness of ignorance.",
        "source": "T25n1509_001:0060a29_16"
    },
    {
        "source_sentence": "於貪欲、瞋恚病中，不名為善，非對治法。",
        "translation": "Among the illnesses of craving and anger, they aren't called good and aren't antidotes.",
        "source": "T25n1509_001:0060b01_17"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_001:0060b02_18"
    },
    {
        "source_sentence": "先邪觀故生邪見，邪見即是愚癡。",
        "translation": "A mistaken view arises because of the previous mistaken contemplation, and a mistaken view is folly.",
        "source": "T25n1509_001:0060b02_19"
    },
    {
        "source_sentence": "問曰：如佛法中說十二因緣甚深，如說：「佛告阿難：『是因緣法甚深，難見難解，難覺難觀，細心巧慧人乃能解。』」",
        "translation": "Q: Suppose the Buddha teaches that the twelve causes and conditions are profound in the Buddha's teaching, as he said, The Buddha told Ānanda, 'These causes and conditions are profound, difficult to see and difficult to understand, difficult to perceive and difficult to contemplate, but only a person of subtle mind and skillful wisdom can understand them.'",
        "source": "T25n1509_001:0060b03_20"
    },
    {
        "source_sentence": "愚癡人於淺近法，猶尚難解，何況甚深因緣？",
        "translation": "A foolish man's approach to the shallow is still difficult to understand, so why wouldn't he explain the profound causes and conditions?",
        "source": "T25n1509_001:0060b05_21"
    },
    {
        "source_sentence": "今云何言「愚癡人應觀因緣法」？",
        "translation": "How does it now say, A foolish man should contemplate causes and conditions as dharmas?",
        "source": "T25n1509_001:0060b06_22"
    },
    {
        "source_sentence": "答曰：愚癡人者，非謂如牛羊等愚癡；",
        "translation": "Answer: “Foolish person” does not mean such [things] as cow and sheep are ignorant.",
        "source": "T25n1509_001:0060b07_23"
    },
    {
        "source_sentence": "是人欲求實道，邪心觀故，生種種邪見。",
        "translation": "That person wants to pursue the true path, and because of wrong mental contemplation, they give rise to various wrong views.",
        "source": "T25n1509_001:0060b08_24"
    },
    {
        "source_sentence": "如是愚癡人，當觀因緣，是名為善對治法。",
        "translation": "Such a foolish person should observe causes and conditions, which are called the good antidote.",
        "source": "T25n1509_001:0060b09_25"
    },
    {
        "source_sentence": "若行瞋恚、婬欲人，欲求樂、欲惱他，於此人中，非善非對治法；",
        "translation": "“Those who behave with hatred and wickedness toward others, wanting to delight in or displeasure others. Among these people, there is neither wholesome nor a factor of restraint.",
        "source": "T25n1509_001:0060b10_26"
    },
    {
        "source_sentence": "不淨、慈心思惟，是二人中，是善是對治法。",
        "translation": "Among these two, impurity and the contemplation of kindness are good and antidote dharmas.",
        "source": "T25n1509_001:0060b12_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_001:0060b12_1"
    },
    {
        "source_sentence": "是二觀能拔瞋恚、貪欲毒刺故。",
        "translation": "These two contemplations are able to remove the poisonous thorns of anger and craving.",
        "source": "T25n1509_001:0060b13_2"
    },
    {
        "source_sentence": "復次，著常顛倒眾生，不知諸法相似相續有；",
        "translation": "Furthermore, they cling to eternally deluded sentient beings who do not know that the similarities of all things exist in a continuous series.",
        "source": "T25n1509_001:0060b13_3"
    },
    {
        "source_sentence": "如是人觀無常，是對治悉檀，非第一義。",
        "translation": "Such a person observes impermanence, which is the antidote to siddhânta, not the ultimate truth.",
        "source": "T25n1509_001:0060b14_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_001:0060b15_5"
    },
    {
        "source_sentence": "一切諸法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T25n1509_001:0060b16_6"
    },
    {
        "source_sentence": "　「無常見有常，　　是名為顛倒；",
        "translation": "The absence of permanence and the existence of impermanence is called delusion.",
        "source": "T25n1509_001:0060b16_7"
    },
    {
        "source_sentence": "　　空中無無常，　　何處見有常？」",
        "translation": "Nothing in the sky is impermanent, so where do you see permanence?",
        "source": "T25n1509_001:0060b16_7"
    },
    {
        "source_sentence": "如說偈言：問曰：一切有為法，皆無常相應，是第一義，云何言無常非實？",
        "translation": "As has been said in verse: Question: All conditioned factors are all associated with impermanence. This is the highest truth. How can one say that impermanence is not real?",
        "source": "T25n1509_001:0060b16_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_001:0060b20_8"
    },
    {
        "source_sentence": "一切有為法，生、住、滅相，前生、次住、後滅故，云何言無常非實？",
        "translation": "All conditioned dharmas are the characteristics of arising, abiding, and ceasing: because they arise first, then abide second, and cease later. How can it be said that impermanence is not real?",
        "source": "T25n1509_001:0060b20_9"
    },
    {
        "source_sentence": "答曰：有為法不應有三相。",
        "translation": "Answer: Conditioned dharmas shouldn't have three characteristics.",
        "source": "T25n1509_001:0060b22_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_001:0060b22_11"
    },
    {
        "source_sentence": "三相不實故。",
        "translation": "It's because the three characteristics aren't real.",
        "source": "T25n1509_001:0060b22_12"
    },
    {
        "source_sentence": "若諸法生、住、滅是有為相者，今「生」中亦應有三相，「生」是有為相故；",
        "translation": "If arising, abiding and cessation of all factors were conditioned characteristics, then the present word arising should also have three characteristics:",
        "source": "T25n1509_001:0060b23_13"
    },
    {
        "source_sentence": "如是一一處亦應有三相，是則無窮，住、滅亦如是。",
        "translation": "In this way, each and every place should also have three characteristic marks. This then is infinite. The same applies to abiding and to cessation.",
        "source": "T25n1509_001:0060b24_14"
    },
    {
        "source_sentence": "若諸生、住、滅各更無有生、住、滅者，不應名有為法。",
        "translation": "If there were no arising, abiding, and ceasing for each of the things that arise, they wouldn't be called conditioned dharmas.",
        "source": "T25n1509_001:0060b26_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_001:0060b27_16"
    },
    {
        "source_sentence": "有為法相無故。",
        "translation": "It's because the characteristics of conditioned dharmas are absent.",
        "source": "T25n1509_001:0060b27_17"
    },
    {
        "source_sentence": "以是故，諸法無常，非第一義。",
        "translation": "Because of this, all dharmas are impermanent and not the ultimate truth.",
        "source": "T25n1509_001:0060b27_18"
    },
    {
        "source_sentence": "復次，若一切實性無常，則無行業報。",
        "translation": "Furthermore, if all real natures were impermanent, then there would be no karmic retribution.",
        "source": "T25n1509_001:0060b28_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_001:0060b29_20"
    },
    {
        "source_sentence": "無常名生滅失故，譬如腐種子不生果。",
        "translation": "Being impermanent is called arising and ceasing because it's a failure, like rotten seeds that don't produce fruit.",
        "source": "T25n1509_001:0060b29_21"
    },
    {
        "source_sentence": "如是則無行業，無行業云何有果報？",
        "translation": "Thus, there's no action, so how could there be an effect without action?",
        "source": "T25n1509_001:0060c01_22"
    },
    {
        "source_sentence": "今一切賢聖法有果報，善智之人所可信受，不應言無。",
        "translation": "Now, all good and noble dharmas have rewards that can be believed by people of good cognition, so they shouldn't say nothing.",
        "source": "T25n1509_001:0060c02_23"
    },
    {
        "source_sentence": "以是故，諸法非無常性。",
        "translation": "Because of this, all dharmas are not impermanent.",
        "source": "T25n1509_001:0060c03_24"
    },
    {
        "source_sentence": "如是等無量因緣說，不得言諸法無常性。",
        "translation": "Such measureless causes and conditions as these are explained, it can't be said that all dharmas are impermanent.",
        "source": "T25n1509_001:0060c04_25"
    },
    {
        "source_sentence": "一切有為法無常，苦、無我等亦如是。",
        "translation": "All conditioned dharmas are impermanent, and so are suffering, selflessness, and so forth.",
        "source": "T25n1509_001:0060c05_26"
    },
    {
        "source_sentence": "如是等相，名為對治悉檀。",
        "translation": "Such characteristics are called the antidote siddhânta.",
        "source": "T25n1509_001:0060c06_27"
    },
    {
        "source_sentence": "第一義悉檀者，一切法性，一切論議語言，一切是法非法，一一可分別破散；",
        "translation": "The accomplishment of the ultimate truth is that all doctrines, all arguments and all explanations, all are dharmas or non-dharmas; each can be differentiated and dispersed.",
        "source": "T25n1509_001:0060c07_0"
    },
    {
        "source_sentence": "諸佛、辟支佛、阿羅漢所行真實法，不可破，不可散。",
        "translation": "The true teaching practiced by buddhas, pratyekabuddhas, and arhats cannot be broken or dispersed.",
        "source": "T25n1509_001:0060c08_1"
    },
    {
        "source_sentence": "上於三悉檀中所不通者，此中皆通。",
        "translation": "The above doesn't go along with the three siddhântas, but they all go along with them.",
        "source": "T25n1509_001:0060c09_2"
    },
    {
        "source_sentence": "問曰：云何通？",
        "translation": "Q: What does it teach?",
        "source": "T25n1509_001:0060c10_3"
    },
    {
        "source_sentence": "答曰：所謂通者，離一切過失，不可變易，不可勝。",
        "translation": "Answer: The so-called penetration is free of all faults, immutable, and invincible.",
        "source": "T25n1509_001:0060c11_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_001:0060c12_5"
    },
    {
        "source_sentence": "除第一義悉檀，諸餘論議，諸餘悉檀，皆可破故。",
        "translation": "Except for the accomplishment of the ultimate truth, all other discussions and accomplishments can be refuted.",
        "source": "T25n1509_001:0060c12_6"
    },
    {
        "source_sentence": "　「各各自依見，　　戲論起諍競；",
        "translation": "Each relying on their own views, They engage in arguments and disputes.",
        "source": "T25n1509_001:0060c13_7"
    },
    {
        "source_sentence": "　　若能知彼非，　　是為知正見。",
        "translation": "If someone can know that they're wrong, this is the right view of knowing.",
        "source": "T25n1509_001:0060c13_7"
    },
    {
        "source_sentence": "　　不肯受他法，　　是名愚癡人，",
        "translation": "Being unwilling to receive the teachings of others is called a foolish man.",
        "source": "T25n1509_001:0060c13_7"
    },
    {
        "source_sentence": "　　作是論議者，　　真是愚癡人。",
        "translation": "Those who make such arguments are really foolish people.",
        "source": "T25n1509_001:0060c13_7"
    },
    {
        "source_sentence": "　　若依自是見，　　而生諸戲論，",
        "translation": "If they rely on their own views And give rise to conceptual elaborations,",
        "source": "T25n1509_001:0060c13_7"
    },
    {
        "source_sentence": "　　若此是淨智，　　無非淨智者。」",
        "translation": "If this is pure cognition, there's nothing that isn't pure cognition.",
        "source": "T25n1509_001:0060c13_7"
    },
    {
        "source_sentence": "如《眾義經》中所說偈：此三偈中，佛說第一義悉檀相。",
        "translation": "In these three verses, the Buddha explains the characteristic of accomplishment of the ultimate truth in terms of siddhânta.",
        "source": "T25n1509_001:0060c13_7"
    },
    {
        "source_sentence": "所謂世間眾生自依見、自依法、自依論議而生諍競；",
        "translation": "It is so-called that sentient beings in the world rely on their own views, their own doctrines, and their own arguments to give rise to disputes.",
        "source": "T25n1509_001:0061a03_8"
    },
    {
        "source_sentence": "戲論即諍競本，戲論依諸見生。",
        "translation": "Gambling is the root of dispute. Gambling arises on the basis of views.",
        "source": "T25n1509_001:0061a05_0"
    },
    {
        "source_sentence": "　「有受法故有諸論，　　若無有受何所論？",
        "translation": "Because there are feelings, there are treatises; if there are no feelings, what do you discuss?",
        "source": "T25n1509_001:0061a05_1"
    },
    {
        "source_sentence": "　　有受無受諸見等，　　是人於此悉已除。」",
        "translation": "Those who have feelings and non-sensation views and so forth have all been removed here.",
        "source": "T25n1509_001:0061a05_1"
    },
    {
        "source_sentence": "如說偈言：行者能如實知此者，於一切法、一切戲論，不受不著，不見是實，不共諍競，能知佛法甘露味。",
        "translation": "As a verse says, A practitioner who knows these things as they really are doesn't accept or attach to all the teachings and all the conceptual elaborations, doesn't see them as real, doesn't compete with each other, and can know the taste of the ambrosia of the Buddha's teaching.",
        "source": "T25n1509_001:0061a05_1"
    },
    {
        "source_sentence": "若不爾者，則謗法。",
        "translation": "If someone doesn't, they'll denigrate the teaching.",
        "source": "T25n1509_001:0061a11_2"
    },
    {
        "source_sentence": "若不受他法，不知不取，是無智人。",
        "translation": "If someone doesn't accept other dharmas and doesn't know or don't grasp them, they're a person with no knowledge.",
        "source": "T25n1509_001:0061a11_3"
    },
    {
        "source_sentence": "若爾者，應一切論議人皆無智。",
        "translation": "If that's the case, then all the people who discuss it should lack knowledge.",
        "source": "T25n1509_001:0061a12_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_001:0061a13_5"
    },
    {
        "source_sentence": "各各不相受法故。",
        "translation": "Each one doesn't receive the Dharma from each other.",
        "source": "T25n1509_001:0061a13_6"
    },
    {
        "source_sentence": "所謂有人自謂法第一義淨，餘人妄語不淨。",
        "translation": "It's called someone who claims that the ultimate truth of the teaching is pure, and others falsely say it's impure.",
        "source": "T25n1509_001:0061a13_7"
    },
    {
        "source_sentence": "譬如世間治法，故治法者，刑罰殺戮，種種不淨，世間人信受行之，以為真淨；",
        "translation": "Good man, it is analogous to a worldly rule that governs the Dharma. For this reason those who govern the Dharma punish and kill people with various kinds of impurity. The people of the world believe in these principles and practice them as genuinely pure.",
        "source": "T25n1509_001:0061a15_0"
    },
    {
        "source_sentence": "於餘出家善聖人中，是最為不淨。",
        "translation": "Among the other renunciant good sages, this is the most impure.",
        "source": "T25n1509_001:0061a16_1"
    },
    {
        "source_sentence": "外道出家人法，五熱中一腳立、拔髮等，尼犍子輩以為妙慧，餘人說此為癡法。",
        "translation": "Non-Buddhist and renunciant dharmas, such as standing or pulling out one foot in the five feverish hells, are regarded by Nirgrantha as marvelous wisdom, but others say they're deluded dharmas.",
        "source": "T25n1509_001:0061a17_2"
    },
    {
        "source_sentence": "如是等種種外道出家、白衣婆羅門法，各各自以為好，餘皆妄語。",
        "translation": "Each of these various kinds of non-Buddhist renunciants and white-robed brāhmaṇas take them as good, while the others speak falsely.",
        "source": "T25n1509_001:0061a19_3"
    },
    {
        "source_sentence": "是佛法中亦有犢子比丘說：「如四大和合有眼法，如是五眾和合有人法。」",
        "translation": "In the Buddha's teaching, there's also a Vātsīputrīya monk who says, Thus, when the four elements are combined, there's the eye dharma; thus, when the five groups of people are combined, there's the person dharma.",
        "source": "T25n1509_001:0061a21_4"
    },
    {
        "source_sentence": "《犢子阿毘曇》中說：「五眾不離人，人不離五眾，不可說五眾是人、離五眾是人，人是第五不可說法藏中所攝。」",
        "translation": "In the Vātsīputrī abhidharma, it's said, The five congregations don't part from people, and people don't part from the five congregations; it can't be said that the five congregations are people and those who part from the five congregations are people, and people are included in the fifth unfathomable store.",
        "source": "T25n1509_001:0061a22_5"
    },
    {
        "source_sentence": "說一切有道人輩言：「神人，一切種、一切時、一切法門中求不可得，譬如兔角龜毛常無。",
        "translation": "He said to all the people of the Way, Gods and goddesses, All kinds, all times, and all teachings are unobtainable, like a rabbit's horn or a turtle's hair that always disappears.",
        "source": "T25n1509_001:0061a25_6"
    },
    {
        "source_sentence": "復次十八界、十二入、五眾實有，而此中無人。」",
        "translation": "Furthermore, the 18 realms, 12 sense-fields, and five aggregates really exist, but there's no one here.",
        "source": "T25n1509_001:0061a27_7"
    },
    {
        "source_sentence": "更有佛法中方廣道人言：「一切法不生不滅，空無所有，譬如兔角龜毛常無。」",
        "translation": "There's also the extensive path of the Buddha's teaching, saying, All dharmas don't arise and don't cease, and emptiness has no existence, like rabbit horns and turtle hair that are always absent.",
        "source": "T25n1509_001:0061a28_8"
    },
    {
        "source_sentence": "如是等一切論議師輩，自守其法，不受餘法，此是實，餘者妄語。",
        "translation": "All these teachers who discuss the doctrine keep their own doctrine and do not accept others’ doctrines. This is true while the rest is false speech.",
        "source": "T25n1509_001:0061b01_9"
    },
    {
        "source_sentence": "若自受其法，自法供養，自法修行，他法不受、不供養，為作過失。",
        "translation": "If someone receives their own teaching, makes offerings to their own teaching, cultivates their own teaching, doesn't accept or don't make offerings to other teachings, it's a mistake.",
        "source": "T25n1509_001:0061b02_10"
    },
    {
        "source_sentence": "若以是為清淨得第一義利者，則一切無非清淨。",
        "translation": "If someone attains the supreme benefit of purity because of this, then nothing is not pure.",
        "source": "T25n1509_001:0061b04_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_001:0061b05_12"
    },
    {
        "source_sentence": "彼一切皆自愛法故。",
        "translation": "It's because they all love the Dharma for themselves.",
        "source": "T25n1509_001:0061b05_13"
    },
    {
        "source_sentence": "問曰：若諸見皆有過失，第一義悉檀何者是？",
        "translation": "Q: If all views have faults, what's the first meaning of accomplishment?",
        "source": "T25n1509_001:0061b06_14"
    },
    {
        "source_sentence": "答曰：過一切語言道，心行處滅，遍無所依，不示諸法。",
        "translation": "Answer: A Forest of Pearls from the Dharma Garden, Volume I Answer: Beyond all paths of speech and thought, the locus of mental functioning ceases, pervades without any basis, and doesn't show dharmas.",
        "source": "T25n1509_001:0061b07_15"
    },
    {
        "source_sentence": "諸法實相，無初、無中、無後，不盡、不壞，是名第一義悉檀。",
        "translation": "The true characteristics of all dharmas, which have no beginning, no middle, no end, no end, and no destruction, are called the accomplishment of the ultimate truth.",
        "source": "T25n1509_001:0061b08_16"
    },
    {
        "source_sentence": "　「語言盡竟，　　心行亦訖；　　不生不滅，",
        "translation": "Having said these words, His mind and his deeds are also complete; Without arising or ceasing,",
        "source": "T25n1509_001:0061b09_17"
    },
    {
        "source_sentence": "　　法如涅槃。　　說諸行處，　　名世界法；",
        "translation": "The Teaching is like nirvana, Explaining the sphere of conditioned things Is called worldly doctrine.",
        "source": "T25n1509_001:0061b09_17"
    },
    {
        "source_sentence": "　　說不行處，　　名第一義。",
        "translation": "The sphere of neither practice nor nonpractice is called the highest truth.",
        "source": "T25n1509_001:0061b09_17"
    },
    {
        "source_sentence": "　「一切實一切非實，　　及一切實亦非實，",
        "translation": "“All real things are not real, and all real things are also not real.",
        "source": "T25n1509_001:0061b09_17"
    },
    {
        "source_sentence": "　　一切非實非不實，　　是名諸法之實相。」",
        "translation": "All things that are neither real nor unreal are called the true characteristics of dharmas.",
        "source": "T25n1509_001:0061b09_17"
    },
    {
        "source_sentence": "如摩訶衍義偈中說：如是等處處經中說第一義悉檀。",
        "translation": "As it's said in the Mahāprajñāpāramitā-sūtra, Thus and so forth, the sūtras explain the accomplishment of the ultimate truth.",
        "source": "T25n1509_001:0061b09_17"
    },
    {
        "source_sentence": "是義甚深，難見難解，佛欲說是義故，說《摩訶般若波羅蜜經》。",
        "translation": "Because this meaning is so profound and difficult to see and difficult to understand, the Buddha wanted to explain it, so he taught the Mahāprajñāpāramitā-sūtra.",
        "source": "T25n1509_001:0061b16_18"
    },
    {
        "source_sentence": "復次，欲令長爪梵志等大論議師於佛法中生信故，說是《摩訶般若波羅蜜經》。",
        "translation": "Furthermore, in order to cause the long-clawed priests and other great discussants to have faith in the Buddha's teachings, they say this is the Mahāprajñāpāramitā-sūtra.",
        "source": "T25n1509_001:0061b18_19"
    },
    {
        "source_sentence": "有梵志號名長爪，更有名先尼婆蹉衢多羅，更有名薩遮迦摩揵提等，是等閻浮提大論議師輩言：「一切論可破，一切語可壞，一切執可轉故，無有實法可信可恭敬者。」",
        "translation": "There's a priest named Changzhao, another named Nibhūtaratna, and another named Sākyamuni. These are the great discussants of Jambudvīpa who say, All arguments can be refuted, all words can be destroyed, and all attachments can be changed because there's no real teaching that can be believed or respected.",
        "source": "T25n1509_001:0061b20_20"
    },
    {
        "source_sentence": "如《舍利弗本末經》中說：舍利弗舅摩訶俱絺羅，與姊舍利論議不如。",
        "translation": "As it's said in the Sutra of the origin and derivative of Śāriputra, Śāriputra's uncle Mahākauṣṭhila had a dispute with his sister Śāriputra.",
        "source": "T25n1509_001:0061b24_21"
    },
    {
        "source_sentence": "俱絺羅思惟念言：「非姊力也，必懷智人，寄言母口。",
        "translation": "Kauṣṭhila reflected and thought to himself, saying, It's not the power of my sister; she must have harbored a wise man who sent word to her mother.",
        "source": "T25n1509_001:0061b25_22"
    },
    {
        "source_sentence": "未生乃爾，及生長大，當如之何？」",
        "translation": "What will be the same for those who haven't yet arisen and those who grow?",
        "source": "T25n1509_001:0061b26_23"
    },
    {
        "source_sentence": "思惟已，生憍慢心，為廣論議故，出家作梵志。",
        "translation": "After reflecting on this, he became conceited and left home to become a priest for the sake of extensive discussion.",
        "source": "T25n1509_001:0061b27_24"
    },
    {
        "source_sentence": "入南天竺國，始讀經書。",
        "translation": "He entered the country of India in the south and began to read scriptures.",
        "source": "T25n1509_001:0061b28_25"
    },
    {
        "source_sentence": "諸人問言：「汝志何求？",
        "translation": "The people asked, What do you want?",
        "source": "T25n1509_001:0061b29_26"
    },
    {
        "source_sentence": "學習何經？」",
        "translation": "What sūtra do you study?",
        "source": "T25n1509_001:0061b29_27"
    },
    {
        "source_sentence": "長爪答言：「十八種大經，盡欲讀之。」",
        "translation": "The long-clawed replied, Eighteen kinds of great sūtras, and I want to read them all.",
        "source": "T25n1509_001:0061c01_28"
    },
    {
        "source_sentence": "諸人語言：「盡汝壽命，猶不能知一，何況能盡？」",
        "translation": "The people said, For the rest of your life, you still can't know one, so why would you be able to finish it?",
        "source": "T25n1509_001:0061c01_29"
    },
    {
        "source_sentence": "長爪自念：「昔作憍慢，為姊所勝，今此諸人復見輕辱。」",
        "translation": "The long-clawed man thought to himself, In the past, I was conceited and overpowered by my sister, but now these people are again despising me.",
        "source": "T25n1509_001:0061c03_0"
    },
    {
        "source_sentence": "為是二事故，自作誓言：「我不剪爪，要讀十八種經書盡。」",
        "translation": "For these two reasons, he made a vow on his own, saying, I won't cut my nails; I must read the 18 kinds of sūtras and books in full.",
        "source": "T25n1509_001:0061c04_1"
    },
    {
        "source_sentence": "人見爪長，因號為長爪梵志。",
        "translation": "When people saw that his nails were long, they called him a long-clawed brahman.",
        "source": "T25n1509_001:0061c05_2"
    },
    {
        "source_sentence": "是人以種種經書智慧力，種種譏刺是法是非法、是應是不應、是實是不實、是有是無，破他論議。",
        "translation": "Because of the power of the wisdom of various sūtras and books, that person often criticizes what's right and wrong, what's right and wrong, what's real and unreal, what's existent and what's nonexistent, and refutes other discussions.",
        "source": "T25n1509_001:0061c06_3"
    },
    {
        "source_sentence": "譬如大力狂象，搪揬蹴踏，無能制者。",
        "translation": "It's like a powerful, crazy elephant that can't be restrained by being pushed and kicked.",
        "source": "T25n1509_001:0061c08_4"
    },
    {
        "source_sentence": "如是長爪梵志以論議力，摧伏諸論師已，還至摩伽陀國王舍城那羅聚落，至本生處，問人言：「我姊生子，今在何處？」",
        "translation": "Thus, the long-clawed priest used the power of argument to subdue the treatise masters and returned to the village of Nāra in the city of Rājagṛha in the country of Magadha and asked people where he was born, asking, Where is my sister giving birth to a child?",
        "source": "T25n1509_001:0061c09_5"
    },
    {
        "source_sentence": "有人語言：「汝姊子者，適生八歲，讀一切經書盡；",
        "translation": "Some people said, “Your elder sister will be eight years old when you are born.",
        "source": "T25n1509_001:0061c12_6"
    },
    {
        "source_sentence": "至年十六，論議勝一切人。",
        "translation": "When he was sixteen years old, he debated and won the victory over all people.",
        "source": "T25n1509_001:0061c13_7"
    },
    {
        "source_sentence": "有釋種道人姓瞿曇，與作弟子。」",
        "translation": "There was a Śākyamuni named Gautama who became a disciple of the Way.",
        "source": "T25n1509_001:0061c14_0"
    },
    {
        "source_sentence": "長爪聞之，即起憍慢，生不信心而作是言：「如我姊子聰明如是，彼以何術，誘誑剃頭作弟子？」",
        "translation": "When the long-clawed man heard this, he became conceited and gave rise to disbelief and said, Like my elder sister is so intelligent, what technique did she use to tempt her hair shaving as a disciple?",
        "source": "T25n1509_001:0061c14_1"
    },
    {
        "source_sentence": "說是語已，直向佛所。",
        "translation": "After speaking these words, he went straight to the Buddha.",
        "source": "T25n1509_001:0061c16_2"
    },
    {
        "source_sentence": "爾時，舍利弗初受戒半月，佛邊侍立，以扇扇佛。",
        "translation": "At the time, Śāriputra had first received the precepts for half a month, and the Buddha stood at his side to fan the Buddha with a fan.",
        "source": "T25n1509_001:0061c17_3"
    },
    {
        "source_sentence": "長爪梵志見佛，問訊訖，一面坐，作是念：「一切論可破，一切語可壞，一切執可轉，是中何者是諸法實相？",
        "translation": "When the long-clawed brāhmaṇa saw the Buddha, he greeted him and sat to one side. He thought: All theories can be refuted, all doctrines can be broken down, and all holds can be changed. Which of these is true dharmas?",
        "source": "T25n1509_001:0061c18_4"
    },
    {
        "source_sentence": "何者是第一義？",
        "translation": "What's the ultimate truth?",
        "source": "T25n1509_001:0061c20_5"
    },
    {
        "source_sentence": "何者性？",
        "translation": "What's the nature?",
        "source": "T25n1509_001:0061c21_6"
    },
    {
        "source_sentence": "何者相？",
        "translation": "What are their characteristics?",
        "source": "T25n1509_001:0061c21_7"
    },
    {
        "source_sentence": "不顛倒？」",
        "translation": "Is not mistaken?",
        "source": "T25n1509_001:0061c21_8"
    },
    {
        "source_sentence": "如是思惟，譬如大海水中，欲盡其涯底，求之既久，不得一法實可以入心者。",
        "translation": "It's like when someone wants to reach the bottom of a boundary in the ocean and after seeking it for a long time, they can't find a single thing that really can enter their mind.",
        "source": "T25n1509_001:0061c21_9"
    },
    {
        "source_sentence": "「彼以何論議道而得我姊子？」",
        "translation": "How did they discuss the path and attain my sister's son?",
        "source": "T25n1509_001:0062a01_10"
    },
    {
        "source_sentence": "作是思惟已，而語佛言：「瞿曇！",
        "translation": "After he had this thought, he said to the Buddha, Gautama!",
        "source": "T25n1509_001:0062a02_11"
    },
    {
        "source_sentence": "我一切法不受。」",
        "translation": "I won't accept all dharmas.",
        "source": "T25n1509_001:0062a03_12"
    },
    {
        "source_sentence": "佛問長爪：「汝一切法不受，是見受不？」",
        "translation": "The Buddha asked the long-clawed, Do you accept all of your teachings, or do you accept them from views?",
        "source": "T25n1509_001:0062a03_13"
    },
    {
        "source_sentence": "佛所質義，汝已飲邪見毒，今出是毒氣，言：「一切法不受，是見汝受不？」",
        "translation": "You've already drunk the poison of wrong views, and now you're producing this poisonous air, saying, All things are not accepted; is this seeing that you're accepted?",
        "source": "T25n1509_001:0062a04_14"
    },
    {
        "source_sentence": "爾時，長爪梵志如好馬見鞭影即覺，便著正道；",
        "translation": "At that time, the brahmin with long claws looked like a good horse. Seeing the shadow of his whipping, he immediately woke up and became attached to the right path.",
        "source": "T25n1509_001:0062a06_15"
    },
    {
        "source_sentence": "長爪梵志亦如是，得佛語鞭影入心，即棄捐貢高，慚愧低頭，如是思惟：「佛置我著二處負門中：若我說『是見我受』，是負處門麁，故多人知——『云何自言一切法不受，今受是見』？",
        "translation": "So it is with the long-clawed brahmin, who got the Buddha's words and whipped his shadow into his mind. He then discarded Don Qian and raised his head in shame and thought, The Buddha put me in two places at the negative gate: If I say, 'This is a view of self and accept it,' this is the negative gate; therefore, many people know - 'How do you say you yourself",
        "source": "T25n1509_001:0062a07_16"
    },
    {
        "source_sentence": "此是現前妄語，是麁負處門，多人所知。",
        "translation": "This is a false statement in the present that's known to many people because it's a debilitating approach.",
        "source": "T25n1509_001:0062a11_17"
    },
    {
        "source_sentence": "第二負處門細，我欲受之，以不多人知故。」",
        "translation": "The second negative aspect is subtle, and I want to accept it because few people know it.",
        "source": "T25n1509_001:0062a12_18"
    },
    {
        "source_sentence": "作是念已，答佛言：「瞿曇！",
        "translation": "After he had this thought, he answered the Buddha, Gautama!",
        "source": "T25n1509_001:0062a13_19"
    },
    {
        "source_sentence": "一切法不受，是見亦不受。」",
        "translation": "All dharmas are not received, and this view is also not received.",
        "source": "T25n1509_001:0062a14_20"
    },
    {
        "source_sentence": "佛語梵志：「汝不受一切法，是見亦不受，則無所受，與眾人無異，何用自高而生憍慢？」",
        "translation": "The Buddha said to the priest, You don't accept all dharmas, and this is a view that you don't accept, so there's nothing to be accepted; it's no different from what people do, so why would you become conceited because of your own arrogance?",
        "source": "T25n1509_001:0062a14_21"
    },
    {
        "source_sentence": "如是，長爪梵志不能得答，自知墮負處，即於佛一切智中起恭敬，生信心，自思惟：「我墮負處，世尊不彰我負，不言是非，不以為意。",
        "translation": "Thus, the long-clawed brahmin couldn't answer, knowing for himself where he was falling into a negative position, respected the Buddha in all his knowledge and became faithful, thought to himself, I fell into a negative position, and the Bhagavān didn't express my negativeness, didn't say right or wrong, and didn't think about it.",
        "source": "T25n1509_001:0062a17_0"
    },
    {
        "source_sentence": "佛心柔濡，第一清淨；",
        "translation": "The Buddha’s mind is gentle and the first pure.",
        "source": "T25n1509_001:0062a20_1"
    },
    {
        "source_sentence": "一切語論處滅，得大甚深法，是可恭敬處，心淨第一。」",
        "translation": "When all the places where speech and arguments cease, they attain great profound dharmas, which are a place to be respected and the purest of minds.",
        "source": "T25n1509_001:0062a20_2"
    },
    {
        "source_sentence": "佛說法斷其邪見故，即於坐處得遠塵離垢，諸法中得法眼淨。",
        "translation": "Because the Buddha teaches the Dharma and stops their mistaken views, they attain freedom from dust and dirt in their seats and attain purity of the Dharma eye in all dharmas.",
        "source": "T25n1509_001:0062a22_3"
    },
    {
        "source_sentence": "時，舍利弗聞是語，得阿羅漢。",
        "translation": "When Śāriputra heard these words, he attained arhatship.",
        "source": "T25n1509_001:0062a23_4"
    },
    {
        "source_sentence": "是長爪梵志出家作沙門，得大力阿羅漢。",
        "translation": "That long-clawed brahmin renunciant became a monk and attained great arhatship.",
        "source": "T25n1509_001:0062a24_5"
    },
    {
        "source_sentence": "若長爪梵志不聞般若波羅蜜氣分，離四句第一義相應法，小信尚不得，何況得出家道果？",
        "translation": "If a long-clawed priest doesn't hear the breathing part of the prajñāpāramitā, parts with the teaching associated with the first meaning of the four phrases, and has little faith, how could he attain the fruit of the path leading to renunciation?",
        "source": "T25n1509_001:0062a25_6"
    },
    {
        "source_sentence": "佛欲導引如是等大論議師利根人故，說是《般若波羅蜜經》。",
        "translation": "Because the Buddha wanted to guide people with sharp faculties who had such great discussions, he taught this prajñāpāramitā sūtra.",
        "source": "T25n1509_001:0062a27_7"
    },
    {
        "source_sentence": "復次，諸佛有二種說法：一者、觀人心隨可度者，二者、觀諸法相。",
        "translation": "Furthermore, there are two kinds of teachings from the buddhas: first, observing people's minds as they can be liberated, and second, observing the characteristics of dharmas.",
        "source": "T25n1509_001:0062a29_0"
    },
    {
        "source_sentence": "今佛欲說諸法實相故，說是《摩訶般若波羅蜜經》。",
        "translation": "Now, because the Buddha wants to explain the true characteristics of dharmas, he teaches that this is the Mahāprajñāpāramitā-sūtra.",
        "source": "T25n1509_001:0062b01_1"
    },
    {
        "source_sentence": "如說〈相不相品〉中，諸天子問佛：「是般若波羅蜜甚深，云何作相？」",
        "translation": "As explained in the Chapter on Characteristics and Non-characteristics, the celestial beings asked the Buddha, This is the profound prajñāpāramitā, so how does it create characteristics?",
        "source": "T25n1509_001:0062b02_2"
    },
    {
        "source_sentence": "佛告諸天子：「空則是相，無相、無作相、無生滅相、無行之相，常不生、如性相、寂滅相等。」",
        "translation": "The Buddha told the celestial beings, Emptiness is a mark, which has no marks, no marks of form, no marks of formlessness, no marks of arising and ceasing, no marks of action, eternal and impermanent, such as nature and cessation, and so forth.",
        "source": "T25n1509_001:0062b04_3"
    },
    {
        "source_sentence": "復次，有二種說法：一者、諍處，二者、不諍處。",
        "translation": "Furthermore, there are two kinds of teaching: one, the place of sexual misconduct and two, the place of no sexual misconduct.",
        "source": "T25n1509_001:0062b06_0"
    },
    {
        "source_sentence": "諍處，如餘經中說；",
        "translation": "The place of rebirth is as has been said in other scriptural texts.",
        "source": "T25n1509_001:0062b06_1"
    },
    {
        "source_sentence": "今欲明無諍處故，說是《般若波羅蜜經》。",
        "translation": "Now, in order to explain the absence of a place of anger, we say this is the Perfection of Wisdom Sutra.",
        "source": "T25n1509_001:0062b07_2"
    },
    {
        "source_sentence": "有相、無相，有物、無物，有依、無依，有對、無對，有上、無上，世界、非世界，亦如是。",
        "translation": "With form and formless, with things and no things, with support and no support, with opposites and no opposites, superior and unsurpassed, worldly and non-worldly, it's likewise.",
        "source": "T25n1509_001:0062b08_3"
    },
    {
        "source_sentence": "問曰：佛大慈悲心，但應說無諍法，何以說諍法？",
        "translation": "Q: The Buddha's great compassionate mind should only explain the principle of no anger, but why would he explain the principle of anger?",
        "source": "T25n1509_001:0062b10_4"
    },
    {
        "source_sentence": "答曰：無諍法皆是無相，常寂滅不可說；",
        "translation": "Answer: The dharmas without dispute are all signless, eternally tranquil and inexpressible.",
        "source": "T25n1509_001:0062b11_5"
    },
    {
        "source_sentence": "今說布施等及無常、苦、空等諸法，皆為寂滅無戲論故說。",
        "translation": "Now, it's said that such things as generosity and impermanent, painful, and empty dharmas are all explained for the sake of quiescence and no conceptual elaboration.",
        "source": "T25n1509_001:0062b12_6"
    },
    {
        "source_sentence": "利根者知佛意，不起諍；",
        "translation": "Those with sharp faculties know the Buddha’s thoughts and do not argue.",
        "source": "T25n1509_001:0062b13_7"
    },
    {
        "source_sentence": "鈍根者不知佛意，取相、著心故起諍。",
        "translation": "Those with dull faculties don't know the Buddha's intention, and anger arises because they grasp characteristics and are attached to mind.",
        "source": "T25n1509_001:0062b14_8"
    },
    {
        "source_sentence": "此般若波羅蜜，諸法畢竟空故，無諍處；",
        "translation": "Because these transcendent wisdoms are ultimately empty of all dharmas, they have no place of debate.",
        "source": "T25n1509_001:0062b15_0"
    },
    {
        "source_sentence": "若畢竟空可得、可諍者，不名畢竟空。",
        "translation": "If ultimate emptiness is obtainable and debilitating, it's not called ultimate emptiness.",
        "source": "T25n1509_001:0062b15_1"
    },
    {
        "source_sentence": "是故，《般若波羅蜜經》名無諍處，有無二事皆寂滅故。",
        "translation": "That's why the Prajñāpāramitā-sūtra is called the sphere of no dispute, because both things that exist and don't exist are tranquil.",
        "source": "T25n1509_001:0062b16_2"
    },
    {
        "source_sentence": "復次，餘經中多以三種門說諸法，所謂善門、不善門、無記門；",
        "translation": "“Furthermore, in many other scriptures doctrines are taught in three kinds: the so-called good aspects, bad aspects and neutral aspects.",
        "source": "T25n1509_001:0062b18_3"
    },
    {
        "source_sentence": "今欲說非善門、非不善門、非無記門諸法相故，說《摩訶般若波羅蜜經》。",
        "translation": "Now, I want to explain the characteristics of dharmas that are not good, not unwholesome, and not indeterminate, so I'll explain the Mahāprajñāpāramitā-sūtra.",
        "source": "T25n1509_001:0062b19_4"
    },
    {
        "source_sentence": "學法、無學法、非學非無學法，見諦斷法、思惟斷法、無斷法，可見有對、不可見有對、不可見無對，上、中、下法，小、大、無量法，如是等三法門亦如是。",
        "translation": "The doctrine of training, the doctrine of post-learning, the doctrine of post-learning, and the doctrine of post- neither-learning nor post-learning: doctrine to be abandoned through vision of the truths, doctrine to be abandoned through reflection, and doctrine not to be abandoned; doctrine that is resisting when visible, resisting when invisible, resisting",
        "source": "T25n1509_001:0062b21_5"
    },
    {
        "source_sentence": "復次，餘經中說四念處，隨聲聞法門。",
        "translation": "Furthermore, in other scriptural texts it is said that the four applications of mindfulness follow the dharma-gate of sravakas.",
        "source": "T25n1509_001:0062b24_6"
    },
    {
        "source_sentence": "於是比丘觀內身三十六物，除欲貪病；",
        "translation": "The bhikṣu then observed the thirty-six internal objects of his body to remove the disease of desire and greed.",
        "source": "T25n1509_001:0062b25_7"
    },
    {
        "source_sentence": "如是觀外身，觀內外身。",
        "translation": "Thus, he observes the external body and observes the internal and external body.",
        "source": "T25n1509_001:0062b26_8"
    },
    {
        "source_sentence": "今於四念處，欲以異門說般若波羅蜜。",
        "translation": "Now, in the four abodes of mindfulness, I want to explain the perfection of wisdom in a different way.",
        "source": "T25n1509_001:0062b26_9"
    },
    {
        "source_sentence": "如所說：菩薩觀內身，於身不生覺觀，不得身，以無所得故。",
        "translation": "As has been said: When a bodhisattva observes the inner body, he does not produce initial thought and sustained thought regarding the body. He does not acquire the body because there is nothing to be gained.",
        "source": "T25n1509_001:0062b27_10"
    },
    {
        "source_sentence": "如是觀外身，觀內外身，於身不生覺觀，不得身，以無所得故。",
        "translation": "Thus, he observes external bodies and observes internal and external bodies, doesn't give rise to perception or contemplation of the body, and doesn't obtain a body because there's nothing to be gained.",
        "source": "T25n1509_001:0062b29_11"
    },
    {
        "source_sentence": "於身念處中觀身而不生身覺觀，是事甚難；",
        "translation": "It is very difficult to contemplate the body in the state of bodily mindfulness and not give rise to bodily initial thought and sustained thought.",
        "source": "T25n1509_001:0062c01_12"
    },
    {
        "source_sentence": "三念處亦如是。",
        "translation": "The same applies to the three applications of mindfulness.",
        "source": "T25n1509_001:0062c02_13"
    },
    {
        "source_sentence": "四正勤、四如意足、四禪、四諦等種種四法門亦如是。",
        "translation": "The fourfold correct effort, the four supernormal abilities, the four meditations, the four noble truths, and various other four approaches are likewise.",
        "source": "T25n1509_001:0062c03_14"
    },
    {
        "source_sentence": "復次，餘經中佛說五眾，無常、苦、空、無我相；",
        "translation": "“Furthermore, in other scriptures the Buddha teaches that the five collections are impermanent, painful, empty, and selfless.",
        "source": "T25n1509_001:0062c04_15"
    },
    {
        "source_sentence": "今於是五眾欲說異法門故，說《般若波羅蜜經》。",
        "translation": "Now, because the five groups of people wanted to teach a different teaching, they taught the Perfection of Wisdom Sutra.",
        "source": "T25n1509_001:0062c05_16"
    },
    {
        "source_sentence": "如佛告須菩提：「菩薩若觀色是常行，不行般若波羅蜜；",
        "translation": "Suppose the Buddha told Subhūti, If a bodhisattva observes form as eternal practice, he won't practice prajñā-pāramitā.",
        "source": "T25n1509_001:0062c06_17"
    },
    {
        "source_sentence": "受、想、行、識是常行，不行般若波羅蜜；",
        "translation": "Feeling, perception, volition, and consciousness are the eternal aspects; they do not practice transcendent wisdom.",
        "source": "T25n1509_001:0062c07_18"
    },
    {
        "source_sentence": "色無常行，不行般若波羅蜜；",
        "translation": "Form is impermanent and conditioned, yet they do not practice transcendent wisdom.",
        "source": "T25n1509_001:0062c08_19"
    },
    {
        "source_sentence": "受、想、行、識無常行，不行般若波羅蜜。」",
        "translation": "sensation, perception, volition, volition, and consciousness are impermanent and don't practice the prajñāpāramitā.",
        "source": "T25n1509_001:0062c09_20"
    },
    {
        "source_sentence": "五受眾、五道，如是等種種五法門亦如是。",
        "translation": "So it is with the five sensations, the five destinies, and these various five dharmas.",
        "source": "T25n1509_001:0062c10_21"
    },
    {
        "source_sentence": "餘六、七、八等，乃至無量法門亦如是。",
        "translation": "The other six, seven, eight, and so forth, up to the immeasurable dharma-gate are likewise.",
        "source": "T25n1509_001:0062c11_22"
    },
    {
        "source_sentence": "如摩訶般若波羅蜜無量無邊，說《般若波羅蜜》因緣亦無量無邊。",
        "translation": "Just as the Mahāprajñāpāramitā is immeasurable and limitless, so it's said that the causes and conditions of the Prajñāpāramitā are also immeasurable and limitless.",
        "source": "T25n1509_001:0062c12_0"
    },
    {
        "source_sentence": "是事廣故，今略說摩訶般若波羅蜜因緣起法竟。",
        "translation": "Because these things are so extensive, I'll briefly explain the end of the causal and conditioned arising dharmas of the Mahāprajñāpāramitā.",
        "source": "T25n1509_001:0062c13_1"
    },
    {
        "source_sentence": "摩訶般若波羅蜜初品如是",
        "translation": "The first chapter of the Mahāprajñāpāramitā is thus",
        "source": "T25n1509_001:0062c15_0"
    },
    {
        "source_sentence": "我聞一時釋論第二",
        "translation": "Second Explanation of the Treatise on the One-pointedness of Self and I've heard.",
        "source": "T25n1509_001:0062c16_0"
    },
    {
        "source_sentence": "【經】如是我聞：一時。",
        "translation": "[Sutra] Thus have I heard: One time.",
        "source": "T25n1509_001:0062c17_0"
    },
    {
        "source_sentence": "【論】問曰：諸佛經何以故初稱「如是」語？",
        "translation": "[Commentary] Q: Why do the buddha- sūtras first call it thus?",
        "source": "T25n1509_001:0062c17_1"
    },
    {
        "source_sentence": "答曰：佛法大海，信為能入，智為能度。",
        "translation": "Answer: In the great ocean of the Buddha's teaching, faith is the one who can enter it and wisdom is the one who can save it.",
        "source": "T25n1509_001:0063a01_2"
    },
    {
        "source_sentence": "「如是」義者，即是信。",
        "translation": "The meaning of thus is faith.",
        "source": "T25n1509_001:0063a02_3"
    },
    {
        "source_sentence": "若人心中有信清淨，是人能入佛法；",
        "translation": "If there is purity of faith in one’s mind, that person can enter the buddha-dharma.",
        "source": "T25n1509_001:0063a02_4"
    },
    {
        "source_sentence": "若無信，是人不能入佛法。",
        "translation": "If someone lacks faith, they won't be able to enter the Buddha's teaching.",
        "source": "T25n1509_001:0063a03_5"
    },
    {
        "source_sentence": "不信者言「是事不如是」，是不信相。",
        "translation": "Those who don't believe say, This is not like that, and they don't believe in characteristics.",
        "source": "T25n1509_001:0063a04_6"
    },
    {
        "source_sentence": "信者言「是事如是」。",
        "translation": "The believer says, This is thus the thing.",
        "source": "T25n1509_001:0063a05_7"
    },
    {
        "source_sentence": "譬如牛皮未柔，不可屈折；",
        "translation": "It is like a cow’s skin that has not yet become soft and cannot be broken.",
        "source": "T25n1509_001:0063a05_8"
    },
    {
        "source_sentence": "無信人亦如是。",
        "translation": "So it is with those who lack faith.",
        "source": "T25n1509_001:0063a06_9"
    },
    {
        "source_sentence": "譬如牛皮已柔，隨用可作；",
        "translation": "It is like a cow’s skin that has become soft and can be made as it wishes.",
        "source": "T25n1509_001:0063a06_10"
    },
    {
        "source_sentence": "有信人亦如是。",
        "translation": "So it is with those who have faith.",
        "source": "T25n1509_001:0063a07_11"
    },
    {
        "source_sentence": "復次，經中說：「信如手。」",
        "translation": "Furthermore, the sūtras say, Faith is like a hand.",
        "source": "T25n1509_001:0063a07_12"
    },
    {
        "source_sentence": "如人有手，入寶山中，自在取寶；",
        "translation": "Suppose a man has his hand and enters a mountain of jewels, freely taking the jewels.",
        "source": "T25n1509_001:0063a08_13"
    },
    {
        "source_sentence": "有信亦如是，入佛法無漏根、力、覺、道、禪定寶山中，自在所取。",
        "translation": "Those who have faith are likewise, entering the uncontaminated faculties, powers, awakening, paths, and meditation mountains of the Buddha's teachings, freely grasping them.",
        "source": "T25n1509_001:0063a09_14"
    },
    {
        "source_sentence": "無信如無手，無手人入寶山中，則不能有所取；",
        "translation": "The absence of faith is like the absence of hands. If a man with no hands were to enter a mountain of jewels, he would not be able to grasp anything.",
        "source": "T25n1509_001:0063a10_15"
    },
    {
        "source_sentence": "無信亦如是，入佛法寶山，都無所得。",
        "translation": "So it is with the absence of faith, which enters the Buddha's mountain of treasures of the Dharma but doesn't attain anything.",
        "source": "T25n1509_001:0063a11_16"
    },
    {
        "source_sentence": "佛言：「若人有信，是人能入我大法海中，能得沙門果，不空剃頭染袈裟。",
        "translation": "The Buddha said, If someone has faith, that person can enter my great ocean of teachings and attain the fruit of asceticism without shaving their hair and dyeing their reddish-brown robes.",
        "source": "T25n1509_001:0063a12_17"
    },
    {
        "source_sentence": "若無信，是人不能入我法海中，如枯樹不生華實，不得沙門果，雖剃頭染衣，讀種種經，能難能答，於佛法中空無所得。」",
        "translation": "If someone lacks faith, they won't be able to enter the ocean of my teachings, like a withered tree that doesn't produce flowers or fruits, won't obtain ascetic fruit, shaved their hair and dyed their robes, read various sūtras, could hardly answer them, and didn't attain emptiness in the Buddha's teaching.",
        "source": "T25n1509_001:0063a14_18"
    },
    {
        "source_sentence": "以是故，如是義在佛法初，善信相故。",
        "translation": "Because of this, the meaning of such is at the beginning of the Buddha-dharma: because of the characteristic mark of being faithful.",
        "source": "T25n1509_001:0063a17_19"
    },
    {
        "source_sentence": "復次，佛法深遠，更有佛乃能知。",
        "translation": "Furthermore, the Buddha's teaching is so profound that there are other buddhas who can know it.",
        "source": "T25n1509_001:0063a18_20"
    },
    {
        "source_sentence": "人有信者，雖未作佛，以信力故能入佛法。",
        "translation": "People who have faith are able to enter the Buddha's teaching because of the power of faith even though they haven't become buddhas.",
        "source": "T25n1509_001:0063a18_21"
    },
    {
        "source_sentence": "　「閻浮提先出，　　多諸不淨法；",
        "translation": "Before Jambudvfpa came out, There were many impure dharmas.",
        "source": "T25n1509_001:0063a20_22"
    },
    {
        "source_sentence": "　　願開甘露門，　　當說清淨道！」",
        "translation": "May you open the gate of ambrosia and explain the pure path!",
        "source": "T25n1509_001:0063a20_22"
    },
    {
        "source_sentence": "　「我法甚難得，　　能斷諸結使，",
        "translation": "“My teaching is so difficult to attain that it’s possible to cut the bonds and tendencies.",
        "source": "T25n1509_001:0063a20_22"
    },
    {
        "source_sentence": "　　三有愛著心，　　是人不能解！」",
        "translation": "Third, if someone has a mind attached to craving, that person can't understand!",
        "source": "T25n1509_001:0063a20_22"
    },
    {
        "source_sentence": "如梵天王請佛初轉法輪，以偈請佛：佛以偈答：梵天王白佛：「大德！",
        "translation": "Suppose the king of Brahmā invites the Buddha to first turn the wheel of the Dharma and asks him to do so in verse: The Buddha answers in verse:",
        "source": "T25n1509_001:0063a20_22"
    },
    {
        "source_sentence": "世界中智，有上、中、下。",
        "translation": "In the world of knowledge, there's superior, middle, and inferior.",
        "source": "T25n1509_001:0063a26_23"
    },
    {
        "source_sentence": "善濡直心者，易可得度，是人若不聞法者，退墮諸惡難中，譬如水中蓮華，有生有熟，有水中未出者，若不得日光則不能開。",
        "translation": "Good and straight mind is easy to save, but if someone doesn't hear the teaching, they'll fall back into bad difficulties, like a lotus flower in water that has birth and ripening and something in water that hasn't yet emerged, and if they don't get sunlight, it won't open.",
        "source": "T25n1509_001:0063a26_24"
    },
    {
        "source_sentence": "佛亦如是，佛以大慈悲憐愍眾生，故為說法。」",
        "translation": "The Buddha is likewise, and because of his great compassion for sentient beings, the Buddha teaches the Dharma for them.",
        "source": "T25n1509_001:0063b01_0"
    },
    {
        "source_sentence": "佛念：「過去、未來、現在三世諸佛法，皆度眾生為說法，我亦應爾。」",
        "translation": "The Buddha thought, All the buddhas and dharmas of the three times in the past, future, and present have all liberated sentient beings to preach for them, and so should I.",
        "source": "T25n1509_001:0063b02_1"
    },
    {
        "source_sentence": "如是思惟竟，受梵天王等諸天請說法。",
        "translation": "After he had this thought, he accepted the invitation from Brahmā and other gods to teach the Dharma.",
        "source": "T25n1509_001:0063b03_2"
    },
    {
        "source_sentence": "　「我今開甘露味門，　　若有信者得歡喜；",
        "translation": "“Now I have revealed the taste of ambrosia, And those who believe in it will be delighted.",
        "source": "T25n1509_001:0063b04_3"
    },
    {
        "source_sentence": "　　於諸人中說妙法，　　非惱他故而為說。」",
        "translation": "He teaches the wonderful Dharma among people, not because he disturbs others.",
        "source": "T25n1509_001:0063b04_3"
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：佛此偈中，不說布施人得歡喜，亦不說多聞、持戒、忍辱、精進、禪定、智慧人得歡喜，獨說信人。",
        "translation": "At the time, the Bhagavān answered in a verse, saying, In this verse, the Buddha doesn't say that those who give alms will rejoice, and he doesn't say that well-versed people who observe precepts, tolerate humility, make effort, meditate, and are wise will rejoice, speaking only of those who believe.",
        "source": "T25n1509_001:0063b04_3"
    },
    {
        "source_sentence": "佛意如是：我第一甚深法微妙，無量無數，不可思議，不動、不猗、不著，無所得法，非一切智人則不能解。",
        "translation": "The Buddha’s thought was thus: My first profound doctrine is subtle, immeasurable, incalculable, inconceivable, unmoving, not agitated, not attached, and devoid of anything to be grasped. It cannot be comprehended by anyone without omniscience.",
        "source": "T25n1509_001:0063b09_4"
    },
    {
        "source_sentence": "是故佛法中信力為初，信力能入，非布施、持戒、禪定、智慧等能初入佛法。",
        "translation": "That's why faith is the first of the Buddha's teachings, and faith can enter it, but it's not generosity, observance of precepts, meditation, wisdom, and so forth that can enter the Buddha's teachings for the first time.",
        "source": "T25n1509_001:0063b11_5"
    },
    {
        "source_sentence": "　「世間人心動，　　愛好福果報，",
        "translation": "The hearts and minds of the people in the world are agitated, yearning for goodness and merit as rewards.",
        "source": "T25n1509_001:0063b13_6"
    },
    {
        "source_sentence": "　　而不好福因，　　求有不求滅。",
        "translation": "They don’t accept the causes of merit, seeking existence and not cessation.",
        "source": "T25n1509_001:0063b13_6"
    },
    {
        "source_sentence": "　　先聞邪見法，　　心著而深入，",
        "translation": "Having heard the teaching of false views before, They become attached to their minds And enter deeply into them.",
        "source": "T25n1509_001:0063b13_6"
    },
    {
        "source_sentence": "　　我此甚深法，　　無信云何解？」",
        "translation": "How can I understand this profound teaching without faith?",
        "source": "T25n1509_001:0063b13_6"
    },
    {
        "source_sentence": "如說偈言：如提婆達大弟子俱迦梨等，無信法故墮惡道中。",
        "translation": "As has been said in verse: Just as the great disciples of Devadatta, such as Kokālika and others, fell into a bad rebirth because they did not believe in the doctrine.",
        "source": "T25n1509_001:0063b13_6"
    },
    {
        "source_sentence": "是人無信，於佛法自以智慧求不能得。",
        "translation": "That person lacks faith, and because of their own wisdom they can't attain the Buddha's teaching.",
        "source": "T25n1509_001:0063b19_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_001:0063b20_8"
    },
    {
        "source_sentence": "佛法甚深故。",
        "translation": "It's because the Buddha's teaching is so profound.",
        "source": "T25n1509_001:0063b20_9"
    },
    {
        "source_sentence": "　「欲量無量法，　　智者所不量，",
        "translation": "Desire is immeasurable and dharmas are immeasurable, which the wise cannot fathom.",
        "source": "T25n1509_001:0063b20_10"
    },
    {
        "source_sentence": "　　無量法欲量，　　此人自覆沒！」",
        "translation": "Measureless dharmas are desired to be measured, and this person is self-obscured!",
        "source": "T25n1509_001:0063b20_10"
    },
    {
        "source_sentence": "如梵天王教俱迦梨說偈：復次，「如是」義者，若人心善直信，是人可聽法，若無是相則不解。",
        "translation": "Furthermore, the meaning of thus means that if someone's mind is well and straightforwardly convinced, they can listen to the teaching; if they don't have this characteristic, then they won't understand it.",
        "source": "T25n1509_001:0063b20_10"
    },
    {
        "source_sentence": "　「聽者端視如渴飲，　　一心入於語議中，",
        "translation": "The listeners looked as if they were thirsty to drink. They entered the discussion with one mind,",
        "source": "T25n1509_001:0063b25_11"
    },
    {
        "source_sentence": "　　踊躍聞法心悲喜，　　如是之人應為說。」",
        "translation": "They rise up and hear the teaching with pity and joy, and such people should teach it for them.",
        "source": "T25n1509_001:0063b25_11"
    },
    {
        "source_sentence": "如所說偈：復次，「如是」義在佛法初，現世利、後世利、涅槃利，諸利根本，信為大力。",
        "translation": "As the verse said, Furthermore, the meaning of thus is that at the beginning of the Buddha's teaching, there are benefits in the present life, benefits in the afterlife, and benefits in nirvāṇa, and the root of those benefits is faith as great power.",
        "source": "T25n1509_001:0063b25_11"
    },
    {
        "source_sentence": "復次，一切諸外道出家，心念我法微妙，第一清淨。",
        "translation": "Furthermore, all the non-Buddhist renunciants are mindful of my teaching as subtle and most pure.",
        "source": "T25n1509_001:0063b29_12"
    },
    {
        "source_sentence": "如是人自歎所行法，毀他人法，是故現世相打鬪諍，後世墮地獄，受種種無量苦。",
        "translation": "Such people praise the teachings they practice and disparage the teachings of others. Because of this, they fight each other in the present life and fall into hell in a later life, enduring various forms of immeasurable suffering.",
        "source": "T25n1509_001:0063c01_13"
    },
    {
        "source_sentence": "　「自法愛染故，　　呰毀他人法，",
        "translation": "Because of the defilement of attachment to one’s own doctrine, They disparage others’ doctrines.",
        "source": "T25n1509_001:0063c03_14"
    },
    {
        "source_sentence": "　　雖持戒行人，　　不脫地獄苦！」",
        "translation": "Even though a practitioner observes precepts, he won't be liberated from the suffering of hell!",
        "source": "T25n1509_001:0063c03_14"
    },
    {
        "source_sentence": "如說偈：是佛法中，棄捨一切愛、一切見，一切吾我憍慢悉斷不著。",
        "translation": "As a verse says: In the Buddha's teaching, he abandons all cravings and all views, stops all self-conceit and conceit, and doesn't cling to it.",
        "source": "T25n1509_001:0063c03_14"
    },
    {
        "source_sentence": "如《栰喻經》言：「汝曹若解我栰喻法，是時善法應棄捨，何況不善法？」",
        "translation": "As the Mahāprajñāpāramitā-sūtra says, If you understand the teaching of self and arrogance, then good qualities should be abandoned, so why wouldn't unwholesome qualities?",
        "source": "T25n1509_001:0063c07_15"
    },
    {
        "source_sentence": "佛自於般若波羅蜜，不念不猗，何況餘法有猗著者？",
        "translation": "The Buddha himself doesn't think about the perfection of wisdom and doesn't meditate, so why wouldn't there be attachments to other things?",
        "source": "T25n1509_001:0063c08_16"
    },
    {
        "source_sentence": "以是故，佛法初頭稱「如是」。",
        "translation": "Because of this, the first part of the Buddha's teaching is called thus.",
        "source": "T25n1509_001:0063c10_17"
    },
    {
        "source_sentence": "佛意如是：我弟子無愛法，無染法，無朋黨，但求離苦解脫，不戲論諸法相。",
        "translation": "So it is with the Buddha’s thought: My disciples have no craving for the doctrine, no defiled doctrine, and no associates. They only seek to be freed from suffering and liberation, not to argue about the characteristics of things.",
        "source": "T25n1509_001:0063c10_18"
    },
    {
        "source_sentence": "　「決定諸法中，　　橫生種種想，",
        "translation": "In certain dharmas, Various kinds of thoughts arise horizontally.",
        "source": "T25n1509_001:0063c12_19"
    },
    {
        "source_sentence": "　　悉捨內外故，　　云何當得道？」",
        "translation": "Because they all abandon both inside and outside, how will they attain the path?",
        "source": "T25n1509_001:0063c12_19"
    },
    {
        "source_sentence": "　「非見聞知覺，　　亦非持戒得；",
        "translation": "They are not seen, heard, known, or apprehended, And they are not accompanied by observance of precepts.",
        "source": "T25n1509_001:0063c12_19"
    },
    {
        "source_sentence": "　　非不見聞等，　　非不持戒得。",
        "translation": "It's not that they don't see, hear, and so forth, and it's not that they don't observe precepts.",
        "source": "T25n1509_001:0063c12_19"
    },
    {
        "source_sentence": "　　如是論悉捨，　　亦捨我我所，",
        "translation": "Thus, the theory is completely abandoned, and it also abandons self and what belongs to self.",
        "source": "T25n1509_001:0063c12_19"
    },
    {
        "source_sentence": "　　不取諸法相，　　如是可得道。」",
        "translation": "They don't grasp the characteristics of dharmas, and thus can they attain the path.",
        "source": "T25n1509_001:0063c12_19"
    },
    {
        "source_sentence": "　「若不見聞等，　　亦非持戒得；",
        "translation": "If someone doesn’t see, hear, and so forth, they won’t observe the precepts.",
        "source": "T25n1509_001:0063c12_19"
    },
    {
        "source_sentence": "　　非不見聞等，　　非不持戒得。",
        "translation": "It's not that they don't see, hear, and so forth, and it's not that they don't observe precepts.",
        "source": "T25n1509_001:0063c12_19"
    },
    {
        "source_sentence": "　　如我心觀察，　　持啞法得道！」",
        "translation": "As I observe it with my mind, I'll maintain the dumb dharma and attain enlightenment!",
        "source": "T25n1509_001:0063c12_19"
    },
    {
        "source_sentence": "　「汝依邪見門，　　我知汝癡道。",
        "translation": "You rely on the approach of wrong views, and I know you're in the path of delusion.",
        "source": "T25n1509_001:0063c12_19"
    },
    {
        "source_sentence": "　　汝不見妄想，　　爾時自當啞！」",
        "translation": "If you don't see deluded conceptions, then you yourself will be dumb!",
        "source": "T25n1509_001:0063c12_19"
    },
    {
        "source_sentence": "如說《阿他婆耆經》摩犍提難偈言：佛答言：摩犍提問曰：佛答言：復次，我法真實，餘法妄語；",
        "translation": "As stated in the stanza of the Atharvajit Sutra: The Buddha answered Maudgalyāyana, saying:",
        "source": "T25n1509_001:0063c12_19"
    },
    {
        "source_sentence": "我法第一，餘法不實，是為鬪諍本。",
        "translation": "The self and dharmas are the first, while the other dharmas are not real. This is the root of dispute.",
        "source": "T25n1509_001:0064a10_20"
    },
    {
        "source_sentence": "今「如是」義，示人無諍法，聞他所說，說人無咎。",
        "translation": "Now, the meaning of thus shows that there's no blameworthy Dharma for someone who hears others teach it and explains that they're blameless.",
        "source": "T25n1509_001:0064a11_21"
    },
    {
        "source_sentence": "以是故，諸佛經初稱「如是」。",
        "translation": "Because of this, the first part of the Buddha's sūtras call it thus.",
        "source": "T25n1509_001:0064a12_22"
    },
    {
        "source_sentence": "略說「如是」義竟。",
        "translation": "I'll briefly explain the meaning of thus.",
        "source": "T25n1509_001:0064a13_23"
    },
    {
        "source_sentence": "「我」者，今當說。",
        "translation": "The expression self will now be explained.",
        "source": "T25n1509_001:0064a14_0"
    },
    {
        "source_sentence": "問曰：若佛法中言一切法空，一切無有吾我，云何佛經初頭言「如是我聞」？",
        "translation": "Q: If it's said in the Buddha's teaching that all things are empty and all have no self, how did the first part of the Buddha's sūtra say, Thus have I heard?",
        "source": "T25n1509_001:0064a14_1"
    },
    {
        "source_sentence": "答曰：佛弟子輩雖知無我，隨俗法說我，非實我也。",
        "translation": "Answer: Although the Buddha's disciples know that there's no self, they teach self according to conventional dharmas and aren't really self.",
        "source": "T25n1509_001:0064a16_2"
    },
    {
        "source_sentence": "譬如以金錢買銅錢，人無笑者。",
        "translation": "It's like purchasing copper coins with money, and people don't laugh.",
        "source": "T25n1509_001:0064a17_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_001:0064a18_4"
    },
    {
        "source_sentence": "賣買法應爾。",
        "translation": "It's appropriate to sell and buy according to the rules.",
        "source": "T25n1509_001:0064a18_5"
    },
    {
        "source_sentence": "言我者亦如是，於無我法中而說我，隨世俗故不應難。",
        "translation": "The expression self is likewise: in the doctrine of nonself, it is said to be a self. Because it follows worldly conventionality, there should be no difficulty.",
        "source": "T25n1509_001:0064a18_6"
    },
    {
        "source_sentence": "　「有羅漢比丘，　　諸漏已永盡，",
        "translation": "“There’s an arhat monk whose contaminants have been permanently ended,",
        "source": "T25n1509_001:0064a20_7"
    },
    {
        "source_sentence": "　　於最後邊身，　　能言吾我不？」",
        "translation": "In the final body, can I say self or self?",
        "source": "T25n1509_001:0064a20_7"
    },
    {
        "source_sentence": "　「有羅漢比丘，　　諸漏已永盡，",
        "translation": "“There’s an arhat monk whose contaminants have been permanently ended,",
        "source": "T25n1509_001:0064a20_7"
    },
    {
        "source_sentence": "　　於最後邊身，　　能言有吾我。」",
        "translation": "In the final body, he can say there's a self.",
        "source": "T25n1509_001:0064a20_7"
    },
    {
        "source_sentence": "如《天問經》中偈說：佛答言：世界法中說我，非第一實義中說。",
        "translation": "As the verse in the Sutra of the Questions of the Gods explains, the Buddha answered, saying, The self is explained in worldly dharmas, not in the ultimate truth.",
        "source": "T25n1509_001:0064a20_7"
    },
    {
        "source_sentence": "以是故，諸法空無我，世界法故，雖說我，無咎。",
        "translation": "Because of this, all dharmas are empty and without self, and because they are worldly dharmas, even though they say self, there's no blame.",
        "source": "T25n1509_001:0064a26_8"
    },
    {
        "source_sentence": "復次，世界語言有三根本：一者邪見，二者慢，三者名字。",
        "translation": "Furthermore, worldly language has three fundamentals: first, wrong views; second, arrogance; and third, names.",
        "source": "T25n1509_001:0064a27_9"
    },
    {
        "source_sentence": "是中二種不淨，一種淨。",
        "translation": "These are the two kinds of impurity and one kind of purity.",
        "source": "T25n1509_001:0064a29_10"
    },
    {
        "source_sentence": "一切凡人三種語：邪、慢、名字；",
        "translation": "All worldlings speak three kinds: false views, arrogance and names.",
        "source": "T25n1509_001:0064a29_11"
    },
    {
        "source_sentence": "見道學人二種語：慢、名字；",
        "translation": "The seeker of the path is with two forms of speech:",
        "source": "T25n1509_001:0064b01_12"
    },
    {
        "source_sentence": "諸聖人一種語：名字。",
        "translation": "The saints speak one thing: names.",
        "source": "T25n1509_001:0064b02_0"
    },
    {
        "source_sentence": "內心雖不違實法，而隨世界人故共傳是語，除世界邪見，故隨俗無諍。",
        "translation": "Although their internal minds don't disobey the true teaching, they transmit these words together with the worldly people because they follow the worldly people; except for wrong views in the world, there's no debate following the conventional.",
        "source": "T25n1509_001:0064b02_1"
    },
    {
        "source_sentence": "以是故，除二種不淨語，本隨世故用一種語。",
        "translation": "Because of this, exception made for two kinds of impure speech: because they are originally in relation to the world.",
        "source": "T25n1509_001:0064b04_2"
    },
    {
        "source_sentence": "佛弟子隨俗故說我，無有咎。",
        "translation": "A disciple of the Buddha follows the conventional and therefore speaks of self, there's no blame.",
        "source": "T25n1509_001:0064b05_3"
    },
    {
        "source_sentence": "復次，若人著無吾我相言是實，餘妄語，是人應難：「汝一切法實相無我，云何言如是我聞？」",
        "translation": "Furthermore, if someone were to say that the characteristic of selflessness is real and the other false statements are false, they would have the difficulty, All your true characteristics of dharmas are without self, so how could you say it's like hearing from me?",
        "source": "T25n1509_001:0064b06_4"
    },
    {
        "source_sentence": "今諸佛弟子，一切法空無所有，是中心不著，亦不言著諸法實相，何況無我法中心著？",
        "translation": "Now, the disciples of the Buddha say that all dharmas are empty and lack existence, but this is the center that's not attached, and they don't say they're attached to the true characteristics of dharmas, so why wouldn't they be attached to the center of selflessness?",
        "source": "T25n1509_001:0064b08_5"
    },
    {
        "source_sentence": "以是故，不應難言何以說我。",
        "translation": "Therefore, it shouldn't be difficult to say how to explain self.",
        "source": "T25n1509_001:0064b10_6"
    },
    {
        "source_sentence": "　「若有所不空，　　應當有所空，",
        "translation": "“If something is nonempty, there should be emptiness.",
        "source": "T25n1509_001:0064b11_7"
    },
    {
        "source_sentence": "　　不空尚不得，　　何況得於空？",
        "translation": "If they don't have emptiness, they still can't get it, so why wouldn't they attain emptiness?",
        "source": "T25n1509_001:0064b11_7"
    },
    {
        "source_sentence": "　　凡人見不空，　　亦復見於空，",
        "translation": "Ordinary people see what’s not empty, And they also see emptiness.",
        "source": "T25n1509_001:0064b11_7"
    },
    {
        "source_sentence": "　　不見見無見，　　是實名涅槃。",
        "translation": "Not seeing and not seeing is really called nirvāṇa.",
        "source": "T25n1509_001:0064b11_7"
    },
    {
        "source_sentence": "　　非二安隱門，　　能破諸邪見；",
        "translation": "It is not that the two approaches of peacefulness Can destroy all false views.",
        "source": "T25n1509_001:0064b11_7"
    },
    {
        "source_sentence": "　　諸佛所行處，　　是名無我法。」",
        "translation": "Where the buddhas practice, this is called the selfless dharma.",
        "source": "T25n1509_001:0064b11_7"
    },
    {
        "source_sentence": "如《中論》中偈說：略說「我」義竟。",
        "translation": "As the verse in the Middle Length Treatise says, I'll briefly explain the end of the meaning of self.",
        "source": "T25n1509_001:0064b11_7"
    },
    {
        "source_sentence": "「聞」者，今當說。",
        "translation": "The phrase hear will now be explained.",
        "source": "T25n1509_001:0064b19_0"
    },
    {
        "source_sentence": "問曰：聞者，云何聞？",
        "translation": "Q: He who hears, how does he hear?",
        "source": "T25n1509_001:0064b19_1"
    },
    {
        "source_sentence": "用耳根聞耶？",
        "translation": "Does it use the ear faculty to hear?",
        "source": "T25n1509_001:0064b19_2"
    },
    {
        "source_sentence": "用耳識聞？",
        "translation": "What's heard by the consciousness of hearing with the ear?",
        "source": "T25n1509_001:0064b20_3"
    },
    {
        "source_sentence": "用意識聞耶？",
        "translation": "Is it heard by the thinking consciousness?",
        "source": "T25n1509_001:0064b20_4"
    },
    {
        "source_sentence": "若耳根聞，耳根無覺知故，不應聞。",
        "translation": "If the ear faculty hears, it shouldn't hear because the ear faculty has no perception.",
        "source": "T25n1509_001:0064b20_5"
    },
    {
        "source_sentence": "若耳識聞，耳識一念故不能分別，不應聞。",
        "translation": "If the auditory consciousness hears, and because it can't discriminate with a single thought, it shouldn't hear.",
        "source": "T25n1509_001:0064b21_6"
    },
    {
        "source_sentence": "若意識聞，意識亦不能聞。",
        "translation": "If the thinking consciousness hears it, the thinking consciousness can't hear it either.",
        "source": "T25n1509_001:0064b22_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_001:0064b23_8"
    },
    {
        "source_sentence": "先五識識五塵，然後意識識；",
        "translation": "Consciousness of the mind is preceded by five forms of consciousness.",
        "source": "T25n1509_001:0064b23_9"
    },
    {
        "source_sentence": "意識不能識現在五塵，唯識過去、未來五塵。",
        "translation": "Consciousness of the mind can't perceive the five dust motes in the present; it only perceives the five dust motes of the past and future.",
        "source": "T25n1509_001:0064b24_10"
    },
    {
        "source_sentence": "若意識能識現在五塵者，盲聾人亦應識聲色。",
        "translation": "If the thinking consciousness were able to perceive the five objects in the present, the blind and deaf would also perceive sound and form.",
        "source": "T25n1509_001:0064b25_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_001:0064b26_12"
    },
    {
        "source_sentence": "意識不破故。",
        "translation": "It's because the consciousness doesn't break it.",
        "source": "T25n1509_001:0064b26_13"
    },
    {
        "source_sentence": "答曰：非耳根能聞聲，亦非耳識，亦非意識。",
        "translation": "Answer: It's not the case that the ear faculty can hear sounds, nor is it the ear consciousness, nor is it the consciousness of consciousness.",
        "source": "T25n1509_001:0064b26_14"
    },
    {
        "source_sentence": "能聞聲事，從多因緣和合故得聞聲，不得言一法能聞聲。",
        "translation": "A thing that can hear sounds is heard because of the confluence of many causes and conditions, and it can't be said that a single thing can hear sounds.",
        "source": "T25n1509_001:0064b27_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_001:0064b29_16"
    },
    {
        "source_sentence": "耳根無覺故，不應聞聲；",
        "translation": "Because the faculty of hearing is without perception, one should not hear sound.",
        "source": "T25n1509_001:0064b29_17"
    },
    {
        "source_sentence": "識無色無對無處故，亦不應聞聲；",
        "translation": "Because consciousness has no form, no opposites, and no location, they also should not hear sound.",
        "source": "T25n1509_001:0064c01_18"
    },
    {
        "source_sentence": "聲無覺亦無根故，不能知聲。",
        "translation": "Because sound has no perception and no faculties, it can't know sound.",
        "source": "T25n1509_001:0064c01_19"
    },
    {
        "source_sentence": "爾時，耳根不破，聲至可聞處，意欲聞；",
        "translation": "At that time the organ of hearing is not broken, and when sound reaches a place where it can be heard, one wishes to hear.",
        "source": "T25n1509_001:0064c02_20"
    },
    {
        "source_sentence": "情、塵、意和合故耳識生；",
        "translation": "Consciousness of the ear arises from the conjunction of feelings, dust and thought.",
        "source": "T25n1509_001:0064c03_21"
    },
    {
        "source_sentence": "隨耳識，即生意識，能分別——種種因緣得聞聲。",
        "translation": "Consciousness of the ear follows the consciousness of hearing, which gives rise to the thinking consciousness and is able to discriminate - it hears sounds for various reasons.",
        "source": "T25n1509_001:0064c04_22"
    },
    {
        "source_sentence": "以是故，不應作是難：「誰聞聲？」",
        "translation": "Because of this, they shouldn't make this objection, Who hears the sound?",
        "source": "T25n1509_001:0064c05_23"
    },
    {
        "source_sentence": "佛法中亦無有一法能作、能見、能知。",
        "translation": "In the Buddha's teaching, there's also no single thing that can be done, seen, or known.",
        "source": "T25n1509_001:0064c05_24"
    },
    {
        "source_sentence": "　「有業亦有果，　　無作業果者，",
        "translation": "“With action, there is also an effect. There is no effect of action:",
        "source": "T25n1509_001:0064c06_25"
    },
    {
        "source_sentence": "　　此第一甚深，　　是法佛能見。",
        "translation": "The first one is profound; This is what the Buddha of Truth can see.",
        "source": "T25n1509_001:0064c06_25"
    },
    {
        "source_sentence": "　　雖空亦不斷，　　相續亦不常，",
        "translation": "Even though emptiness is unceasing, Continuity is also impermanent.",
        "source": "T25n1509_001:0064c06_25"
    },
    {
        "source_sentence": "　　罪福亦不失，　　如是法佛說。」",
        "translation": "Sin and merit are also not lost, as the Dharma Buddha explains.",
        "source": "T25n1509_001:0064c06_25"
    },
    {
        "source_sentence": "如說偈：略說「聞」竟。",
        "translation": "As he said in the verse, I'll briefly explain the end of hearing.",
        "source": "T25n1509_001:0064c06_25"
    },
    {
        "source_sentence": "「一」者，今當說。",
        "translation": "The phrase one will now be explained.",
        "source": "T25n1509_001:0064c12_0"
    },
    {
        "source_sentence": "問曰：佛法中，數、時等法實無，陰、入、持所不攝故，何以言「一時」？",
        "translation": "Q: In the Buddha's teaching, such things as number and time really don't exist, and because they aren't included in aggregates, entry, or maintaining, why is it said to be one time?",
        "source": "T25n1509_001:0064c12_1"
    },
    {
        "source_sentence": "答曰：隨世俗故有一時，無有咎。",
        "translation": "Answer: According to the secular, there's a time when there's no blame.",
        "source": "T25n1509_001:0064c13_2"
    },
    {
        "source_sentence": "若畫泥木等作天像，念天故禮拜，無咎。",
        "translation": "If he paints an image of a god made of mud, wood, etc., and venerates it out of mindfulness of the gods, there's no blame.",
        "source": "T25n1509_001:0064c14_3"
    },
    {
        "source_sentence": "說一時亦如是，雖實無一時，隨俗說一時，無咎。",
        "translation": "Even though there really is no one time, it is said to be one time in accordance with the conventional interpretation. There is no blameworthiness.",
        "source": "T25n1509_001:0064c15_4"
    },
    {
        "source_sentence": "問曰：不應無一時。",
        "translation": "Q: There shouldn't be no one time.",
        "source": "T25n1509_001:0064c16_5"
    },
    {
        "source_sentence": "佛自說言：「一人出世間，多人得樂，是者何人？",
        "translation": "The Buddha himself said, One person emerges from the world, and many people attain happiness. Who is this person?",
        "source": "T25n1509_001:0064c17_6"
    },
    {
        "source_sentence": "佛世尊也。」",
        "translation": "It's the Bhagavān.",
        "source": "T25n1509_001:0064c18_7"
    },
    {
        "source_sentence": "　「我行無師保，　　志一無等侶，",
        "translation": "My practice has no teacher or protector, and my aspiration is the same as peerlessness.",
        "source": "T25n1509_001:0064c18_8"
    },
    {
        "source_sentence": "　　積一行得佛，　　自然通聖道。」",
        "translation": "He accumulates one practice to attain Buddhahood and naturally penetrates the noble path.",
        "source": "T25n1509_001:0064c18_8"
    },
    {
        "source_sentence": "亦如說偈：如是等，佛處處說一，應當有一。",
        "translation": "Also as has been said in verse: Such and such, the Buddha everywhere teaches one; there should be one.",
        "source": "T25n1509_001:0064c18_8"
    },
    {
        "source_sentence": "復次，一法和合故，物名為一，若實無一法，何以故一物中一心生，非二非三？",
        "translation": "Furthermore, because of the conjunction of one factor, things are said to be one. If there really were no one factor, why would a single mind arise in a single thing, not two or three?",
        "source": "T25n1509_001:0065a03_9"
    },
    {
        "source_sentence": "二物中二心生，非一非三？",
        "translation": "Among the two things, two minds arise, not one and not three?",
        "source": "T25n1509_001:0065a05_10"
    },
    {
        "source_sentence": "三物中三心生，非二非一？",
        "translation": "Among the three things, three minds arise, not two and not one?",
        "source": "T25n1509_001:0065a06_11"
    },
    {
        "source_sentence": "若實無諸數，一物中應二心生，二物中應一心生；",
        "translation": "If there really are no numbers, then two minds would arise in one thing. One mind would arise in two things.",
        "source": "T25n1509_001:0065a06_12"
    },
    {
        "source_sentence": "如是等三、四、五、六皆爾。",
        "translation": "So it is with these three, four, five, and six.",
        "source": "T25n1509_001:0065a07_13"
    },
    {
        "source_sentence": "以是故，定知一物中有一法，是法和合故，一物中一心生。",
        "translation": "Because of this, it's certain to know that there's a dharma in one thing, and because of the conjunction of dharmas, one mind arises in one thing.",
        "source": "T25n1509_001:0065a08_14"
    },
    {
        "source_sentence": "答曰：若「一」與「物」一，若「一」與「物」異，二俱有過。",
        "translation": "Answer: If one and things are one, and if one and things are different, there's a mistake in both.",
        "source": "T25n1509_001:0065a09_15"
    },
    {
        "source_sentence": "問曰：若一，有何過？",
        "translation": "Q: If it's one, what's wrong?",
        "source": "T25n1509_001:0065a10_16"
    },
    {
        "source_sentence": "答曰：若「一」、「瓶」，是一義，如因提梨、釋迦，亦是一義。",
        "translation": "Answer: If 'one' and 'bottle' are one meaning, it's like Indra and Śākyamuni, which are also one meaning.",
        "source": "T25n1509_001:0065a11_17"
    },
    {
        "source_sentence": "若爾者，在在有一者，應皆是瓶；",
        "translation": "If this were so, then all that exists would be a vial.",
        "source": "T25n1509_001:0065a12_18"
    },
    {
        "source_sentence": "譬如在在有因提梨，亦處處有釋迦。",
        "translation": "It's like a place where there are Indra and Śākyamuni, and everywhere there are Śākyamunis.",
        "source": "T25n1509_001:0065a13_19"
    },
    {
        "source_sentence": "今衣等諸物皆應是瓶，「一」、「瓶」一故。",
        "translation": "Now, all things like clothing and so forth should be vases, because one and the vase are one.",
        "source": "T25n1509_001:0065a14_20"
    },
    {
        "source_sentence": "如是處處一，皆應是瓶；",
        "translation": "In the same way, if it were one and the same everywhere, they would all be a jug.",
        "source": "T25n1509_001:0065a14_21"
    },
    {
        "source_sentence": "如瓶、衣等悉是一物，無有分別。",
        "translation": "It's like a pot, clothing, and so forth that are all one thing, with no distinctions.",
        "source": "T25n1509_001:0065a15_22"
    },
    {
        "source_sentence": "復次，「一」是數法，「瓶」亦應是數法。",
        "translation": "Furthermore, one is a number of dharmas, and the vial should also be a number of dharmas.",
        "source": "T25n1509_001:0065a16_23"
    },
    {
        "source_sentence": "瓶體有五法，「一」亦應有五法。",
        "translation": "The essence of the vial has five dharmas, and one should also have five dharmas.",
        "source": "T25n1509_001:0065a17_0"
    },
    {
        "source_sentence": "瓶，有色有對；",
        "translation": "The vial has form and resistance.",
        "source": "T25n1509_001:0065a17_1"
    },
    {
        "source_sentence": "一，亦應有色有對。",
        "translation": "One, there should also be form and resistance.",
        "source": "T25n1509_001:0065a18_0"
    },
    {
        "source_sentence": "若在在一不名為瓶，今不應「瓶」、「一」一！",
        "translation": "If it were in one, it wouldn't be called a vial, and now it wouldn't be a vial or one!",
        "source": "T25n1509_001:0065a18_1"
    },
    {
        "source_sentence": "若說一不攝瓶，若說瓶亦不攝一，「瓶」、「一」不異故。",
        "translation": "If it's said that one doesn't include the vial, and if it's said that the vial also doesn't include one, the vial and one aren't different.",
        "source": "T25n1509_001:0065a19_2"
    },
    {
        "source_sentence": "又復欲說一，應說瓶；",
        "translation": "Also, if you want to speak of one, you should speak of the vial.",
        "source": "T25n1509_001:0065a20_3"
    },
    {
        "source_sentence": "欲說瓶，應說一，如是則錯亂。",
        "translation": "If you want to speak of a vial, you should speak of one; this would be a distortion.",
        "source": "T25n1509_001:0065a21_4"
    },
    {
        "source_sentence": "問曰：一中過如是，異中有何咎？",
        "translation": "Q: Such is the fault in one, but what's the blame in the difference?",
        "source": "T25n1509_001:0065a22_0"
    },
    {
        "source_sentence": "答曰：若一與瓶異，瓶則非一；",
        "translation": "Answer: If the one is different from the vial, the vial is not the same.",
        "source": "T25n1509_001:0065a22_1"
    },
    {
        "source_sentence": "若瓶與一異，一則非瓶。",
        "translation": "If a bottle is different from one, then one is not a bottle.",
        "source": "T25n1509_001:0065a23_2"
    },
    {
        "source_sentence": "若瓶與一合，瓶名一者，今一與瓶合，何以不名一為瓶？",
        "translation": "If a vial is combined with one, and the vial is called one, then when one is combined with the vial, why isn't it called one as a vial?",
        "source": "T25n1509_001:0065a24_3"
    },
    {
        "source_sentence": "是故不得言瓶異一。",
        "translation": "Therefore, it can't be said that the vial is different from the one.",
        "source": "T25n1509_001:0065a25_4"
    },
    {
        "source_sentence": "問曰：雖一數合故，瓶為一，然一不作瓶。",
        "translation": "Q: Even though it's a combination of one number, the vial becomes one, but one doesn't make a vial.",
        "source": "T25n1509_001:0065a26_0"
    },
    {
        "source_sentence": "答曰：諸數初一，一與瓶異，以是故瓶不作一。",
        "translation": "Answer: The first one of these numbers is different from the vial, so the vial doesn't make a single one.",
        "source": "T25n1509_001:0065a26_1"
    },
    {
        "source_sentence": "一無故，多亦無。",
        "translation": "Because one is nonexistent, many are also nonexistent.",
        "source": "T25n1509_001:0065a28_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_001:0065a28_1"
    },
    {
        "source_sentence": "先一後多故。",
        "translation": "It's because the first one is followed by many.",
        "source": "T25n1509_001:0065a28_2"
    },
    {
        "source_sentence": "如是異中，一亦不可得。",
        "translation": "Thus, in this difference, one is also unobtainable.",
        "source": "T25n1509_001:0065a28_3"
    },
    {
        "source_sentence": "以是故，二門中求一法不可得，不可得故，云何陰、持、入攝？",
        "translation": "Because of this, the pursuit of a single doctrine in these two approaches is unobtainable. Because it is unobtainable, what are aggregates, supports, and sense-fields that are included?",
        "source": "T25n1509_001:0065a29_4"
    },
    {
        "source_sentence": "但佛弟子隨俗語言名為一，心實不著，知數法名字有。",
        "translation": "However, the Buddha disciple follows conventional language and calls it one, doesn't really cling to it in his mind, and knows that the names of dharmas exist.",
        "source": "T25n1509_001:0065b01_5"
    },
    {
        "source_sentence": "以是故，佛法中言一人、一師、一時，不墮邪見咎。",
        "translation": "Because of this, it's said in the Buddha's teaching that one person, one teacher, and one time won't fall into the blame of wrong views.",
        "source": "T25n1509_001:0065b03_6"
    },
    {
        "source_sentence": "略說「一」竟。",
        "translation": "I'll briefly explain the completion of one.",
        "source": "T25n1509_001:0065b04_7"
    },
    {
        "source_sentence": "「時」者，今當說。",
        "translation": "The phrase time will now be explained.",
        "source": "T25n1509_001:0065b05_0"
    },
    {
        "source_sentence": "問曰：天竺說「時」名有二種：一名迦羅，二名三摩耶。",
        "translation": "Q: There are two kinds of names that are called time in India: one is called kalala, and two are called samaya.",
        "source": "T25n1509_001:0065b05_1"
    },
    {
        "source_sentence": "佛何以不言迦羅而言三摩耶？",
        "translation": "Why didn't the Buddha say Kālā and speak of it as a samaya?",
        "source": "T25n1509_001:0065b06_2"
    },
    {
        "source_sentence": "答曰：若言迦羅，俱亦有疑。",
        "translation": "Answer: If he says Kālā, there's also doubt in both.",
        "source": "T25n1509_001:0065b07_3"
    },
    {
        "source_sentence": "問曰：輕易說故，應言迦羅；",
        "translation": "Q: Because it is so light and easy to teach, one should call it kalala.",
        "source": "T25n1509_001:0065b08_0"
    },
    {
        "source_sentence": "迦羅二字，三摩耶三字，重語難故。",
        "translation": "The two words kalala and sanmaya are three words, because they repeatedly express difficulties.",
        "source": "T25n1509_001:0065b08_1"
    },
    {
        "source_sentence": "答曰：除邪見故，說三摩耶，不言迦羅。",
        "translation": "Answer: For the sake of removing wrong views, it's called a samaya, not a kalala.",
        "source": "T25n1509_001:0065b09_2"
    },
    {
        "source_sentence": "　「『時來眾生熟，　　時至則催促；",
        "translation": "'Sometime comes when sentient beings are ripe, and the time arrives quickly.",
        "source": "T25n1509_001:0065b10_3"
    },
    {
        "source_sentence": "　　　時能覺悟人，　　是故時為因。",
        "translation": "The time is the cause for the person who awakens; Therefore, the time is the cause.",
        "source": "T25n1509_001:0065b10_3"
    },
    {
        "source_sentence": "　　　世界如車輪，　　時變如轉輪；",
        "translation": "Worlds are like wheels of carts, And the seasons change like a turning wheel.",
        "source": "T25n1509_001:0065b10_3"
    },
    {
        "source_sentence": "　　　人亦如車輪，　　或上而或下。』」",
        "translation": "A person is also like a wheel of a chariot, whether it goes up or down.'",
        "source": "T25n1509_001:0065b10_3"
    },
    {
        "source_sentence": "問曰：有人言：「一切天地好醜皆以時為因，如《時經》中偈說：更有人言：「雖天地好醜一切物非時所作，然時是不變因，是實有。",
        "translation": "Q: Some people say, All the good and bad qualities of heaven and earth are conditioned by time as a cause, just as the verse in the Time Sutra says, There's another person who says, Although all the good and bad qualities of heaven and earth are not created at the right time for all things, they are unchanging causes at the right time that really exist.",
        "source": "T25n1509_001:0065b10_3"
    },
    {
        "source_sentence": "時法細故，不可見、不可知，以華果等果故可知有時。",
        "translation": "Because the seasons are subtle, they can't be seen or known, and it's because of such fruits as flowers and fruits that we can know the seasons.",
        "source": "T25n1509_001:0065b17_4"
    },
    {
        "source_sentence": "往年今年，久近遲疾，見此相，雖不見時，可知有時。",
        "translation": "In the past and this year, when he had been ill for a long time, he saw these signs. Although he did not see them at the right time, it is still possible to know that there was a season.",
        "source": "T25n1509_001:0065b18_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_001:0065b20_6"
    },
    {
        "source_sentence": "見果知有因故。",
        "translation": "It's because they see the result and know there's a cause.",
        "source": "T25n1509_001:0065b20_7"
    },
    {
        "source_sentence": "以是故有時法，時法不壞故常。」",
        "translation": "Because of this, there's a timely dharma that's permanent because the timely dharma doesn't break down.",
        "source": "T25n1509_001:0065b20_8"
    },
    {
        "source_sentence": "答曰：如泥丸是現在時，土塵是過去時，瓶是未來時。",
        "translation": "Answer: Suppose a mud ball is the present time, a dust of dirt is the past time, and a pot is the future time.",
        "source": "T25n1509_001:0065b21_9"
    },
    {
        "source_sentence": "時相常故，過去時不作未來時；",
        "translation": "Because the characteristics of time and space are constant, they do not occur in the past or future.",
        "source": "T25n1509_001:0065b22_10"
    },
    {
        "source_sentence": "汝經書法，時是一物，以是故，過去世不作未來世，亦不作現在世，雜過故。",
        "translation": "Your sūtras and teachings are one thing at the time; therefore, they won't be done in the past or future lives, nor will they be done in the present life, because of their mixed faults.",
        "source": "T25n1509_001:0065b23_11"
    },
    {
        "source_sentence": "過去世中亦無未來世，以是故無未來世。",
        "translation": "In a past life, there's no future life; therefore, there's no future life.",
        "source": "T25n1509_001:0065b25_12"
    },
    {
        "source_sentence": "現在世亦如是。",
        "translation": "So it is in the present world.",
        "source": "T25n1509_001:0065b26_13"
    },
    {
        "source_sentence": "問曰：汝受過去土塵時，若有過去時，必應有未來時，以是故實有時法。",
        "translation": "Q: When you receive the dust of a past land, if there's a past time, there must be a future time; therefore, it's really a teaching that there's a time.",
        "source": "T25n1509_001:0065b27_0"
    },
    {
        "source_sentence": "答曰：汝不聞我先說，未來世瓶，過去世土塵。",
        "translation": "Answer: You haven't heard me previously explain that future vases and dust from past lands will be the same as what I did.",
        "source": "T25n1509_001:0065b28_1"
    },
    {
        "source_sentence": "未來世不作過去世，墮未來世相中是未來世相時，云何名過去時？",
        "translation": "When the future doesn't create a past world, and when it falls into the marks of a future world, what's the time that's called the past?",
        "source": "T25n1509_001:0065b29_2"
    },
    {
        "source_sentence": "以是故，過去時亦無。",
        "translation": "Because of this, they also did not exist in the past.",
        "source": "T25n1509_001:0065c02_3"
    },
    {
        "source_sentence": "問曰：何以無時？",
        "translation": "Q: Why is there no time?",
        "source": "T25n1509_001:0065c04_0"
    },
    {
        "source_sentence": "必應有時。",
        "translation": "There must be a time.",
        "source": "T25n1509_001:0065c04_1"
    },
    {
        "source_sentence": "現在有現在相，過去有過去相，未來有未來相。",
        "translation": "The present has the characteristic of the present, the past has the characteristic of the past, and the future has the characteristic of the future.",
        "source": "T25n1509_001:0065c04_2"
    },
    {
        "source_sentence": "答曰：若令一切三世時有自相，應盡是現在世，無過去、未來時。",
        "translation": "Answer: If it were to cause all three times to have their own distinctive characteristics, they would all be present in the present world and there would be no past or future time.",
        "source": "T25n1509_001:0065c05_3"
    },
    {
        "source_sentence": "若今有未來，不名未來，應當名現在。",
        "translation": "If the future exists in the present, it should be called present if it does not exist in the future.",
        "source": "T25n1509_001:0065c07_4"
    },
    {
        "source_sentence": "以是故，是語不然！",
        "translation": "Therefore, this is not the way to say it!",
        "source": "T25n1509_001:0065c08_5"
    },
    {
        "source_sentence": "問曰：過去時、未來時非現在相中行，過去時過去世中行，未來世未來時中行。",
        "translation": "Q: What's practiced in the past and what's practiced in the future that aren't practiced in the present, what's practiced in the past and what's practiced in the past, and what's practiced in the future and what's practiced in the future.",
        "source": "T25n1509_001:0065c09_0"
    },
    {
        "source_sentence": "以是故，各各法相有時。",
        "translation": "Because of this, each one has a time for its own characteristics.",
        "source": "T25n1509_001:0065c10_1"
    },
    {
        "source_sentence": "答曰：若過去復過去，則破過去相；",
        "translation": "Answer: If the past were further also in the past, it would destroy the characteristic marks of the past.",
        "source": "T25n1509_001:0065c11_2"
    },
    {
        "source_sentence": "若過去不過去，則無過去相。",
        "translation": "If the past doesn't go away, then there are no past marks.",
        "source": "T25n1509_001:0065c12_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_001:0065c13_0"
    },
    {
        "source_sentence": "自相捨故。",
        "translation": "It's because they abandon their own characteristics.",
        "source": "T25n1509_001:0065c13_1"
    },
    {
        "source_sentence": "未來世亦如是。",
        "translation": "So it will be in the future.",
        "source": "T25n1509_001:0065c13_2"
    },
    {
        "source_sentence": "以是故，時法無實，云何能生天地好醜及華果等諸物？",
        "translation": "Because of this, the seasons and dharmas are insubstantial, so how could they give rise to such things as heaven and earth, beauty and ugliness, flowers and fruits?",
        "source": "T25n1509_001:0065c13_3"
    },
    {
        "source_sentence": "如是等種種除邪見故，不說迦羅時，說三摩耶。",
        "translation": "Because of these various ways to remove wrong views, when he doesn't explain the kalala, he explains the samaya.",
        "source": "T25n1509_001:0065c15_4"
    },
    {
        "source_sentence": "見陰、界、入生滅，假名為時，無別時。",
        "translation": "Seeing the aggregates, elements, and sense-fields that enter into arising and ceasing is nominally called time, but there's no separate time.",
        "source": "T25n1509_001:0065c16_5"
    },
    {
        "source_sentence": "所謂方、時、離、合，一、異、長、短等名字，出凡人心著，謂是實有法；",
        "translation": "The so-called names of direction, time, separation, conjunction, one, difference, length, shortness, etc., are to dispel ordinary people’s attachment that they really exist as dharmas.",
        "source": "T25n1509_001:0065c17_6"
    },
    {
        "source_sentence": "以是故，除棄世界名字語言法。",
        "translation": "Because of this, they'll abandon world names and words and dharmas.",
        "source": "T25n1509_001:0065c18_7"
    },
    {
        "source_sentence": "問曰：若無時，云何聽「時食」、遮「非時食」是戒？",
        "translation": "Q: If there's no time, how is it that listening to food at the right time and refuting food at a wrong time are precepts?",
        "source": "T25n1509_001:0066a02_0"
    },
    {
        "source_sentence": "答曰：我先已說「世界名字法有，時非實法」，汝不應難！",
        "translation": "Answer: I've already explained that world names and dharmas exist, but they aren't real dharmas at the time. You shouldn't have difficulty!",
        "source": "T25n1509_001:0066a03_1"
    },
    {
        "source_sentence": "亦是毘尼中結戒法，是世界中實，非第一實法相，吾我法相實不可得故；",
        "translation": "It is also the doctrine of the precepts established in the Vinaya, which are real worldly dharmas and not the characteristics of the first true dharma. Because the characteristics of self and dharmas really cannot be grasped.",
        "source": "T25n1509_001:0066a04_2"
    },
    {
        "source_sentence": "亦為眾人瞋呵故，亦欲護佛法使久存，定弟子禮法故，諸三界世尊結諸戒。",
        "translation": "Because they also want to protect the Buddha's teaching so that it will exist for a long time, and because they are determined to venerate the teaching of the disciples, the world-honored ones in the three realms form the precepts.",
        "source": "T25n1509_001:0066a06_3"
    },
    {
        "source_sentence": "是中不應求：有何實？",
        "translation": "Here, one should not ask: What is real?",
        "source": "T25n1509_001:0066a07_4"
    },
    {
        "source_sentence": "有何名字等？",
        "translation": "What names and so forth are there?",
        "source": "T25n1509_001:0066a08_5"
    },
    {
        "source_sentence": "何者相應？",
        "translation": "What's associated?",
        "source": "T25n1509_001:0066a08_6"
    },
    {
        "source_sentence": "何者不相應？",
        "translation": "What's not associated?",
        "source": "T25n1509_001:0066a09_0"
    },
    {
        "source_sentence": "何者是法如是相？",
        "translation": "What's such a characteristic of a dharma?",
        "source": "T25n1509_001:0066a09_1"
    },
    {
        "source_sentence": "何者是法不如是相？",
        "translation": "What's a dharma that doesn't have such characteristics?",
        "source": "T25n1509_001:0066a09_2"
    },
    {
        "source_sentence": "以是故，是事不應難！",
        "translation": "Therefore, this matter shouldn't be difficult!",
        "source": "T25n1509_001:0066a10_3"
    },
    {
        "source_sentence": "問曰：若「非時食」、「時藥」、「時衣」，皆是柯邏，何以不說三摩耶？",
        "translation": "Q: If it's not a timely food, a timely medicine, or a timely robe, why doesn't he explain the samaya?",
        "source": "T25n1509_001:0066a11_0"
    },
    {
        "source_sentence": "答曰：此毘尼中說，白衣不得聞，外道何由得聞而生邪見！",
        "translation": "Answer: This is said in the Vinaya that white robes can't hear it, so why would non-Buddhists give rise to wrong views because they hear it?",
        "source": "T25n1509_001:0066a12_1"
    },
    {
        "source_sentence": "餘經通皆得聞，是故說三摩耶令其不生邪見。",
        "translation": "The other sūtras are universally heard, so they explain the samaya so that they won't give rise to wrong views.",
        "source": "T25n1509_001:0066a13_2"
    },
    {
        "source_sentence": "三摩耶詭名，時亦是假名稱。",
        "translation": "Samāya is a deceptive name, and sometimes it's also a false name.",
        "source": "T25n1509_001:0066a15_3"
    },
    {
        "source_sentence": "又佛法中多說三摩耶，少說柯邏，少故不應難。",
        "translation": "Also, in the Buddha's teaching, there are many explanations of samaya and few explanations of kalala, but because there are few, it shouldn't be difficult.",
        "source": "T25n1509_001:0066a15_4"
    },
    {
        "source_sentence": "「如是、我、聞、一、時」五語各各義略說竟。",
        "translation": "Thus, the five words thus, self, hearing, one, and time have each been briefly explained in terms of their respective meanings.",
        "source": "T25n1509_001:0066a17_0"
    },
    {
        "source_sentence": "大智度論卷第一",
        "translation": "Dazhiduo lun, vol. 1",
        "source": "T25n1509_001:0066a18_0"
    }
]