[
    {
        "source_sentence": "大智度論釋初品中檀波羅蜜",
        "translation": "Mahāprajñāpāramitā-śāstra explains the first part of the perfection of giving",
        "source": "T25n1509_012:0145a09_0"
    },
    {
        "source_sentence": "法施之餘(卷第十二)",
        "translation": "The rest of the Dharma-sacrifice ( vol. 12)",
        "source": "T25n1509_012:0145a10_0"
    },
    {
        "source_sentence": "龍樹菩薩造",
        "translation": "created by Nāgârjuna Bodhisattva",
        "source": "T25n1509_012:0145a12_0"
    },
    {
        "source_sentence": "後秦龜茲國三藏鳩摩羅什",
        "translation": "Kumārajīva, the Tripiṭaka of the Later Qin state of Kucha",
        "source": "T25n1509_012:0145a13_0"
    },
    {
        "source_sentence": "奉　詔譯",
        "translation": "translated by imperial edict",
        "source": "T25n1509_012:0145a14_0"
    },
    {
        "source_sentence": "問曰：云何名檀波羅蜜滿？",
        "translation": "Q: What's called the completion of the perfection of giving?",
        "source": "T25n1509_012:0145a15_0"
    },
    {
        "source_sentence": "答曰：「檀」義，如上說。",
        "translation": "He answered, The meaning of sandalwood is as explained above.",
        "source": "T25n1509_012:0145a15_1"
    },
    {
        "source_sentence": "「波羅(秦言彼岸)蜜(秦言到)」，是名渡布施河得到彼岸。",
        "translation": "This is called crossing the Pusa River and reaching the other shore.",
        "source": "T25n1509_012:0145a16_2"
    },
    {
        "source_sentence": "問曰：云何名不到彼岸？",
        "translation": "Q: What's called not reaching the other side?",
        "source": "T25n1509_012:0145a17_3"
    },
    {
        "source_sentence": "答曰：譬如渡河未到而還，名為不到彼岸。",
        "translation": "Answer: It's like crossing a river and returning without reaching it, which is called not reaching the other side.",
        "source": "T25n1509_012:0145a17_4"
    },
    {
        "source_sentence": "如舍利弗於六十劫中行菩薩道，欲渡布施河。",
        "translation": "Suppose Śāriputra had practiced the bodhisattva path for 60 eons and wanted to cross the river of generosity.",
        "source": "T25n1509_012:0145a18_5"
    },
    {
        "source_sentence": "時有乞人來乞其眼，舍利弗言：「眼無所任，何以索之？",
        "translation": "When a beggar came to ask for his eyes, Śāriputra said, The eyes have nothing to give, so why would they ask for them?",
        "source": "T25n1509_012:0145a20_0"
    },
    {
        "source_sentence": "若須我身及財物者，當以相與！」",
        "translation": "If you need my body and possessions, you'll give them to me!",
        "source": "T25n1509_012:0145a21_1"
    },
    {
        "source_sentence": "答言：「不須汝身及以財物，唯欲得眼。",
        "translation": "He replied, You don't need your body or possessions, but only the eye to attain it.",
        "source": "T25n1509_012:0145a22_2"
    },
    {
        "source_sentence": "若汝實行檀者，以眼見與！」",
        "translation": "If you really practice sandalwood, give it to him with your eyes!",
        "source": "T25n1509_012:0145a22_3"
    },
    {
        "source_sentence": "爾時，舍利弗出一眼與之。",
        "translation": "At the time, Śāriputra gave it to him with one eye.",
        "source": "T25n1509_012:0145a23_4"
    },
    {
        "source_sentence": "乞者得眼，於舍利弗前嗅之嫌臭，唾而棄地，又以腳蹋。",
        "translation": "The beggar got his eyes, smelled bad odor in front of Śāriputra, spit, abandoned the ground, and stepped on it with his feet.",
        "source": "T25n1509_012:0145a24_5"
    },
    {
        "source_sentence": "舍利弗思惟言：「如此弊人等，難可度也！",
        "translation": "Śāriputra thought, Such a bad person is difficult to save!",
        "source": "T25n1509_012:0145a25_6"
    },
    {
        "source_sentence": "眼實無用而強索之，既得而棄，又以腳蹋，何弊之甚！",
        "translation": "What's really useless to the eye is forcing it, and when he gets it, he discards it and steps on it with his feet, which is so bad!",
        "source": "T25n1509_012:0145a26_7"
    },
    {
        "source_sentence": "如此人輩，不可度也。",
        "translation": "Such a group of people can't be saved.",
        "source": "T25n1509_012:0145a27_8"
    },
    {
        "source_sentence": "不如自調，早脫生死。」",
        "translation": "If you don't regulate yourself, you'll be freed from birth and death sooner.",
        "source": "T25n1509_012:0145a28_9"
    },
    {
        "source_sentence": "思惟是已，於菩薩道退，迴向小乘，是名不到彼岸。",
        "translation": "After contemplating this, they regress from the bodhisattva path and return to the lesser vehicle, which is called not reaching the other shore.",
        "source": "T25n1509_012:0145a28_10"
    },
    {
        "source_sentence": "若能直進不退，成辦佛道，名到彼岸。",
        "translation": "If someone can directly advance without regressing and accomplish the Buddha Way, they're called reaching the other shore.",
        "source": "T25n1509_012:0145a29_11"
    },
    {
        "source_sentence": "復次，於事成辦，亦名到彼岸(天竺俗法，凡造事成辦皆言到彼岸)。",
        "translation": "Furthermore, when things are accomplished, it's also called reaching the other shore (it's a common custom in India to say that everything is accomplished when they're done).",
        "source": "T25n1509_012:0145b01_12"
    },
    {
        "source_sentence": "復次，此岸名慳貪，檀名河中，彼岸名佛道。",
        "translation": "Furthermore, this shore is called parsimony and greed. Sandalwood is the name given to it in a river. The other shore is called the Buddha-Path.",
        "source": "T25n1509_012:0145b02_13"
    },
    {
        "source_sentence": "復次，有無見名此岸，破有無見智慧名彼岸，懃修布施是名河中。",
        "translation": "Furthermore, the existence and nonexistence of views are called this shore; the wisdom that refutes the existence and nonexistence of views is called the other shore.",
        "source": "T25n1509_012:0145b03_14"
    },
    {
        "source_sentence": "復次，檀有二種：一者魔檀，二者佛檀。",
        "translation": "Furthermore, there are two kinds of sandalwood: first, Māra sandalwood and second, Buddha sandalwood.",
        "source": "T25n1509_012:0145b05_15"
    },
    {
        "source_sentence": "若為結使賊所奪，憂惱怖畏，是為魔檀，名曰此岸。",
        "translation": "If someone is captured by a thief with bonds, and they're grieved and frightened, this is called the Māra sandalwood named this shore.",
        "source": "T25n1509_012:0145b06_16"
    },
    {
        "source_sentence": "若有清淨布施，無結使賊，無所怖畏，得至佛道，是為佛檀，名曰到彼岸，是為波羅蜜。",
        "translation": "If someone has a pure generosity that's free of bonds and thieves, doesn't fear anything, and attains the Buddha Way, this is called the perfection of buddha sandalwood, which is called reaching the other shore.",
        "source": "T25n1509_012:0145b07_17"
    },
    {
        "source_sentence": "如《佛說毒蛇喻經》中：有人得罪於王，王令掌護一篋，篋中有四毒蛇。",
        "translation": "As the Buddha teaches in the Sutra of the Parable of the Metaphor of the Poisonous snake: A person is guilty of a sin against the king, and the king orders his palm to guard a viper, and there are four poisonous snakes in that viper.",
        "source": "T25n1509_012:0145b09_18"
    },
    {
        "source_sentence": "王勅罪人，令看視養育。",
        "translation": "The king ordered the sinners to be looked after and raised.",
        "source": "T25n1509_012:0145b11_19"
    },
    {
        "source_sentence": "此人思惟：「四蛇難近，近則害人，一猶叵養，而況於四？」",
        "translation": "The man thought, Four snakes are difficult to get close to, and when they get close to them, they harm people; one is still unable to feed, so why wouldn't four?",
        "source": "T25n1509_012:0145b11_20"
    },
    {
        "source_sentence": "便棄篋而走，王令五人拔刀追之。",
        "translation": "So he abandoned his sword and ran away. The king ordered five men to pull out the sword and chase after him.",
        "source": "T25n1509_012:0145b13_0"
    },
    {
        "source_sentence": "復有一人，口言附順，心欲中傷，而語之言：「養之以理，此亦無苦！」",
        "translation": "Again, there's another person who speaks compliantly and harms people in their hearts and desires, saying, nourish them with the principle, which is also not painful!",
        "source": "T25n1509_012:0145b13_1"
    },
    {
        "source_sentence": "其人覺之，馳走逃命，至一空聚。",
        "translation": "Realizing this, the man ran away and fled to an empty lump of earth.",
        "source": "T25n1509_012:0145b15_2"
    },
    {
        "source_sentence": "有一善人，方便語之：「此聚雖空，是賊所止處，汝今住此，必為賊害，慎勿住也！」",
        "translation": "A good person skillfully said to him, Although this cluster is empty, it's the place where the thief stops, so if you stay here now, you'll surely be harmed by the thief; be careful not to stay there!",
        "source": "T25n1509_012:0145b16_3"
    },
    {
        "source_sentence": "於是復去，至一大河，河之彼岸，即是異國。",
        "translation": "He then departed again and arrived at a big river, the other bank of which was an unknown country.",
        "source": "T25n1509_012:0145b17_4"
    },
    {
        "source_sentence": "其國安樂，坦然清淨，無諸患難。",
        "translation": "The kingdom will be peaceful and tranquil, free from any troubles or difficulties.",
        "source": "T25n1509_012:0145b18_5"
    },
    {
        "source_sentence": "於是集眾草木，縛以為栰，進以手足，竭力求渡，既到彼岸，安樂無患。",
        "translation": "He then gathered the grass and trees, tied them together as a bundle, advanced with his hands and feet, and tried hard to cross. When he reached the other shore, he was safe and unhurt.",
        "source": "T25n1509_012:0145b19_6"
    },
    {
        "source_sentence": "王者，魔王；",
        "translation": "The king is the king of Māra.",
        "source": "T25n1509_012:0145b21_7"
    },
    {
        "source_sentence": "篋者，人身；",
        "translation": "gross is the body of a human being.",
        "source": "T25n1509_012:0145b21_8"
    },
    {
        "source_sentence": "四毒蛇者，四大；",
        "translation": "The four poisonous snakes are the four elements:",
        "source": "T25n1509_012:0145b21_9"
    },
    {
        "source_sentence": "五拔刀賊者，五眾；",
        "translation": "The five thieves pulling out their swords are the fivefold assembly.",
        "source": "T25n1509_012:0145b22_10"
    },
    {
        "source_sentence": "一人口善心惡者，是染著；",
        "translation": "The first is defiled attachment, that is to say, the good and bad minds of all living beings.",
        "source": "T25n1509_012:0145b22_11"
    },
    {
        "source_sentence": "空聚是六情；",
        "translation": "The aggregate emptiness is the sixth emotion.",
        "source": "T25n1509_012:0145b23_12"
    },
    {
        "source_sentence": "賊是六塵；",
        "translation": "Thieves are the six dust motes.",
        "source": "T25n1509_012:0145b23_13"
    },
    {
        "source_sentence": "一人愍而語之是為善師；",
        "translation": "A good teacher is one who speaks to others in a deceptive way.",
        "source": "T25n1509_012:0145b23_14"
    },
    {
        "source_sentence": "大河是愛；",
        "translation": "The great river is craving.",
        "source": "T25n1509_012:0145b24_15"
    },
    {
        "source_sentence": "栰是八正道；",
        "translation": "These are the eightfold Noble Path:",
        "source": "T25n1509_012:0145b24_16"
    },
    {
        "source_sentence": "手足懃渡是精進；",
        "translation": "To cross the river with one’s hands and feet is effort.",
        "source": "T25n1509_012:0145b24_17"
    },
    {
        "source_sentence": "此岸是世間；",
        "translation": "This shore is worldly.",
        "source": "T25n1509_012:0145b25_18"
    },
    {
        "source_sentence": "彼岸是涅槃；",
        "translation": "The other shore is nirvana.",
        "source": "T25n1509_012:0145b25_19"
    },
    {
        "source_sentence": "度者漏盡阿羅漢。",
        "translation": "He's a liberated arhat who has ended the contaminants.",
        "source": "T25n1509_012:0145b25_20"
    },
    {
        "source_sentence": "菩薩法中亦如是，若施有三礙：我與、彼受、所施者財，是為墮魔境界，未離眾難。",
        "translation": "It's likewise in the bodhisattva's teaching that there are three hindrances when giving: giving to self, those who receive it, and the property given is a way to fall into the demonic realm and not part with the many difficulties.",
        "source": "T25n1509_012:0145b26_21"
    },
    {
        "source_sentence": "如菩薩布施，三種清淨，無此三礙，得到彼岸，為諸佛所讚，是名檀波羅蜜。",
        "translation": "Just as a bodhisattva's generosity is threefold pure, without these three hindrances, he attains the other shore and is praised by the buddhas, which is called the perfection of giving.",
        "source": "T25n1509_012:0145b28_22"
    },
    {
        "source_sentence": "以是故名到彼岸。",
        "translation": "That's why it's called reaching the other shore.",
        "source": "T25n1509_012:0145c01_23"
    },
    {
        "source_sentence": "此六波羅蜜，能令人渡慳貪等煩惱染著大海，到於彼岸，以是故名波羅蜜。",
        "translation": "These six perfections can cause people to cross the great ocean stained by such afflictions as stinginess and greed and reach the other shore, which is why they're called perfections.",
        "source": "T25n1509_012:0145c01_24"
    },
    {
        "source_sentence": "問曰：阿羅漢、辟支佛亦能到彼岸，何以不名波羅蜜？",
        "translation": "Q: Arhats and pratyekabuddhas can reach the other shore, so why aren't they called pāramitās?",
        "source": "T25n1509_012:0145c03_25"
    },
    {
        "source_sentence": "答曰：阿羅漢、辟支佛渡彼岸，與佛渡彼岸，名同而實異。",
        "translation": "Answer: Arhats and pratyekbuddhas who cross over to the other side and those who cross over to the other side with the Buddha are called the same but really different.",
        "source": "T25n1509_012:0145c04_26"
    },
    {
        "source_sentence": "彼以生死為此岸，涅槃為彼岸，而不能渡檀之彼岸。",
        "translation": "They take birth and death as this shore and nirvāṇa as the other shore, but they can't cross to the other shore of sandalwood.",
        "source": "T25n1509_012:0145c05_27"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_012:0145c07_28"
    },
    {
        "source_sentence": "不能以一切物、一切時、一切種布施；",
        "translation": "They cannot give all things, at all times, and in all ways.",
        "source": "T25n1509_012:0145c07_29"
    },
    {
        "source_sentence": "設能布施，亦無大心；",
        "translation": "Even if they were able to give, they would not have great aspirations.",
        "source": "T25n1509_012:0145c08_30"
    },
    {
        "source_sentence": "或以無記心、或有漏善心、或無漏心施；",
        "translation": "They may give with indeterminate minds, impure good minds, or pure minds.",
        "source": "T25n1509_012:0145c08_31"
    },
    {
        "source_sentence": "無大悲心；",
        "translation": "They do not have the mind of great compassion.",
        "source": "T25n1509_012:0145c09_32"
    },
    {
        "source_sentence": "不能為一切眾生施。",
        "translation": "They can't give to all sentient beings.",
        "source": "T25n1509_012:0145c10_33"
    },
    {
        "source_sentence": "菩薩施者，知布施不生不滅，無漏無為，如涅槃相，為一切眾生故施，是名檀波羅蜜。",
        "translation": "A bodhisattva's generosity is knowing that generosity doesn't arise or cease, that it's uncontaminated and unconditioned, like the characteristic of nirvāṇa, and that it's given for the sake of all sentient beings, which is called the perfection of giving.",
        "source": "T25n1509_012:0145c10_34"
    },
    {
        "source_sentence": "復次，有人言：一切物、一切種內外物，盡以布施，不求果報；",
        "translation": "“Furthermore, some people say that all things and all kinds of internal and external things are given up as donations without seeking reward.",
        "source": "T25n1509_012:0145c12_35"
    },
    {
        "source_sentence": "如是布施，名檀波羅蜜。",
        "translation": "This kind of generosity is called the perfection of giving.",
        "source": "T25n1509_012:0145c13_36"
    },
    {
        "source_sentence": "復次，不可盡故，名檀波羅蜜。",
        "translation": "Furthermore, because it can't be exhausted, it's called the perfection of giving.",
        "source": "T25n1509_012:0145c14_37"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_012:0145c15_38"
    },
    {
        "source_sentence": "知所施物畢竟空，如涅槃相；",
        "translation": "They know the ultimate emptiness of the things they give is like the sign of nirvana.",
        "source": "T25n1509_012:0145c15_39"
    },
    {
        "source_sentence": "以是心施眾生，是故施報不可盡，名檀波羅蜜。",
        "translation": "Giving with this mind to sentient beings because the reward for giving is inexhaustible is called the perfection of giving.",
        "source": "T25n1509_012:0145c16_0"
    },
    {
        "source_sentence": "如五通仙人，以好寶物，藏著石中；",
        "translation": "It is as if a sage of the five supernatural powers were to store good treasures in a rock.",
        "source": "T25n1509_012:0145c17_1"
    },
    {
        "source_sentence": "欲護此寶，磨金剛塗之，令不可破。",
        "translation": "Desiring to protect this treasure, he polishes it with a golden coating so that it won't break down.",
        "source": "T25n1509_012:0145c17_2"
    },
    {
        "source_sentence": "菩薩布施亦復如是，以涅槃實相智慧磨塗之布施，令不可盡。",
        "translation": "Similarly, the bodhisattva's generosity is likewise, polished with the true characteristics of nirvāṇa and wisdom to make it inexhaustible.",
        "source": "T25n1509_012:0145c18_3"
    },
    {
        "source_sentence": "復次，菩薩為一切眾生故布施，眾生數不可盡故，布施亦不可盡。",
        "translation": "Furthermore, bodhisattvas give for the sake of all sentient beings, and because the number of sentient beings can't be exhausted, their generosity can't be exhausted.",
        "source": "T25n1509_012:0145c20_4"
    },
    {
        "source_sentence": "復次，菩薩為佛法布施，佛法無量無邊，布施亦無量無邊。",
        "translation": "Furthermore, the bodhisattva's generosity for the Buddha's teaching is immeasurable and limitless, and his generosity is immeasurable and limitless.",
        "source": "T25n1509_012:0145c21_5"
    },
    {
        "source_sentence": "以是故，阿羅漢、辟支佛，雖到彼岸，不名波羅蜜。",
        "translation": "Because of this, even though arhats and pratyekabuddhas reach the other shore, they aren't called pāramitās.",
        "source": "T25n1509_012:0145c23_6"
    },
    {
        "source_sentence": "問曰：云何名「具足滿」？",
        "translation": "Q: What's called complete fulfillment?",
        "source": "T25n1509_012:0145c24_7"
    },
    {
        "source_sentence": "答曰：如先說，菩薩能一切布施，內外大小，多少麁細，著不著，用不用，如是等種種物，一切能捨，心無所惜，等與一切眾生，不作是觀：「大人應與，小人不應與；",
        "translation": "Answer: As I said before, a bodhisattva can give all kinds of things, both inside and outside, large and small, whether gross or small in size, without attachment or non-attachment, used or not; he can give away all these kinds of things with an open mind that doesn’t cherish anything. He gives them equally to all sentient beings and doesn’t think like this:",
        "source": "T25n1509_012:0145c24_8"
    },
    {
        "source_sentence": "出家人應與，不出家人不應與；",
        "translation": "A renunciant should give it, but a renunciant should not give it.",
        "source": "T25n1509_012:0145c28_9"
    },
    {
        "source_sentence": "人應與，禽獸不應與。」",
        "translation": "People should give it, but animals and animals shouldn't give it.",
        "source": "T25n1509_012:0145c29_10"
    },
    {
        "source_sentence": "於一切眾生平等心施，施不求報，又得施實相，是名具足滿。",
        "translation": "Giving with an equal mind to all sentient beings without seeking reward for giving and also attaining the true characteristics of giving is called perfect completion.",
        "source": "T25n1509_012:0145c29_11"
    },
    {
        "source_sentence": "亦不觀時，無晝無夜，無冬無夏，無吉無衰，一切時常等施，心無悔惜，乃至頭目髓腦，施而無悋，是為具足滿。",
        "translation": "Nor does he observe the seasons, neither day nor night, neither winter nor summer, neither auspicious nor decreasing, and always gives equally at all times without regret or stinginess, even to the point where he gives his head, eyes, marrow, and bones with no anger.",
        "source": "T25n1509_012:0146a02_12"
    },
    {
        "source_sentence": "復次，有人言：菩薩從初發心，乃至菩提樹下三十四心，於是中間，名為布施具足滿。",
        "translation": "Furthermore, some people say that the bodhisattva's thirty-four mental states from the first arousal of his mind up to the thirty-four mental states under the bodhi tree are called the fulfillment of generosity.",
        "source": "T25n1509_012:0146a05_0"
    },
    {
        "source_sentence": "復次，七住菩薩得一切諸法實相智慧，是時，莊嚴佛土，教化眾生，供養諸佛，得大神通，能分一身作無數身，一一身皆雨七寶、華香、幡蓋，化作大燈如須彌山，供養十方佛及菩薩僧；",
        "translation": "“Furthermore, when enlightening beings in the seven abodes attain knowledge of all true characteristics of all teachings, they adorn buddha-lands, edify sentient beings, and make offerings to those buddhas. They attain great spiritual powers, being able to divide one body into countless bodies; each body showering rain of the seven treasures, flowers, fragrances, and cano",
        "source": "T25n1509_012:0146a06_1"
    },
    {
        "source_sentence": "復以妙音讚頌佛德，禮拜供養，恭敬將迎。",
        "translation": "They also praised the Buddha’s virtue in a sublime voice, venerated and honored him, and greeted him with reverence.",
        "source": "T25n1509_012:0146a11_2"
    },
    {
        "source_sentence": "復次，是菩薩於一切十方無量餓鬼國中，雨種種飲食、衣被，令其充滿；",
        "translation": "“Furthermore, in all the countless hungry ghost kingdoms of the ten directions this enlightening being fills them with food, drink, clothing, and shelter.",
        "source": "T25n1509_012:0146a12_3"
    },
    {
        "source_sentence": "得滿足已，皆發阿耨多羅三藐三菩提心。",
        "translation": "Having fulfilled them, they all aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_012:0146a13_4"
    },
    {
        "source_sentence": "復至畜生道中，令其自善，無相害意，除其畏怖，隨其所須，各令充足；",
        "translation": "They go again to the realm of animals, enabling them to do good deeds for themselves and not commit harmful or hostile acts. Removing their fears, they are provided with whatever they need.",
        "source": "T25n1509_012:0146a14_5"
    },
    {
        "source_sentence": "得滿足已，皆發阿耨多羅三藐三菩提心。",
        "translation": "Having fulfilled them, they all aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_012:0146a16_6"
    },
    {
        "source_sentence": "於地獄無量苦中，能令地獄火滅湯冷，罪息心善，除其飢渴，得生天上、人中；",
        "translation": "Among the immeasurable tortures of hell, they can make the fires in hell go out and the boiling water cool. Their sins are extinguished and their minds are good. They get rid of hunger and thirst and are reborn as gods or human beings.",
        "source": "T25n1509_012:0146a17_7"
    },
    {
        "source_sentence": "以此因緣故，皆發阿耨多羅三藐三菩提心。",
        "translation": "Because of these causes and conditions, they all aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_012:0146a19_8"
    },
    {
        "source_sentence": "若十方人，貧窮者給之以財，富貴者施以異味異色，令其歡喜；",
        "translation": "Suppose people in the ten directions give property to those who are poor and impoverished. The rich and powerful give it with different flavors and colors, enabling them to rejoice.",
        "source": "T25n1509_012:0146a20_9"
    },
    {
        "source_sentence": "以此因緣故，皆發阿耨多羅三藐三菩提心。",
        "translation": "Because of these causes and conditions, they all aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_012:0146a21_10"
    },
    {
        "source_sentence": "若至欲天中，令其除却天上欲樂，施以妙寶法樂，令其歡喜；",
        "translation": "When they arrive in the realm of desire, he causes them to get rid of their heavenly desires and pleasures. He bestows on them the bliss of the Teaching of Wonderful Jewels so that they will be delighted.",
        "source": "T25n1509_012:0146a22_11"
    },
    {
        "source_sentence": "以此因緣故，皆發阿耨多羅三藐三菩提心。",
        "translation": "Because of these causes and conditions, they all aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_012:0146a24_12"
    },
    {
        "source_sentence": "若至色天中，除其樂著，以菩薩禪法而娛樂之；",
        "translation": "If they go to the realm of form, they’ll be rid of their delight in attachment and amuse themselves with the enlightening practice of meditation.",
        "source": "T25n1509_012:0146a25_13"
    },
    {
        "source_sentence": "以此因緣故，皆發阿耨多羅三藐三菩提心。",
        "translation": "Because of these causes and conditions, they all aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_012:0146a26_14"
    },
    {
        "source_sentence": "如是乃至十住，是名檀波羅蜜具足滿。",
        "translation": "Thus, up to the ten abodes, this is called the perfection of the perfection of giving.",
        "source": "T25n1509_012:0146a27_15"
    },
    {
        "source_sentence": "復次，菩薩有二種身：一者結業生身，二者法身。",
        "translation": "“Furthermore, there are two kinds of bodies for enlightening beings: first, the body born from bondage by karma; second, the Dharma body.",
        "source": "T25n1509_012:0146a28_16"
    },
    {
        "source_sentence": "是二種身中，檀波羅蜜滿，是名具足檀波羅蜜。",
        "translation": "In these two kinds of bodies, the perfection of giving is complete, which is called the perfect perfection of giving.",
        "source": "T25n1509_012:0146a29_17"
    },
    {
        "source_sentence": "問曰：云何名結業生身檀波羅蜜滿？",
        "translation": "Q: What's called the completion of the perfection of the body-body bond of karma that gives rise to the perfection of giving?",
        "source": "T25n1509_012:0146b01_18"
    },
    {
        "source_sentence": "答曰：未得法身，結使未盡，能以一切寶物、頭、目、髓、腦、國、財、妻、子，內、外所有，盡以布施，心不動轉。",
        "translation": "Answer: They haven't yet attained the Dharma body, and their bonds haven't ended, so they can give away all their treasures, heads, eyes, marrow, brains, countries, possessions, wives, children, internal and external possessions, and all of them as a gift without moving their minds.",
        "source": "T25n1509_012:0146b02_19"
    },
    {
        "source_sentence": "如須提拏太子(秦言好愛)以其二子布施婆羅門，次以妻施，其心不轉。",
        "translation": "It's like Prince Sudarśana (known as good love in the Qin) who gives his two sons to a Brāhmaṇa and then gives them to a wife, but his mind doesn't change.",
        "source": "T25n1509_012:0146b04_20"
    },
    {
        "source_sentence": "又如薩婆達王(秦言一切施)為敵國所滅，身竄窮林。",
        "translation": "It's also like when the king of Sāvada (known as all-giving in the Qin) was exterminated by an enemy country and fled into a forest.",
        "source": "T25n1509_012:0146b06_21"
    },
    {
        "source_sentence": "見有遠國婆羅門來，欲從己乞。",
        "translation": "He saw a brahman coming from a distant land, intending to beg for food from him.",
        "source": "T25n1509_012:0146b07_22"
    },
    {
        "source_sentence": "自以國破家亡，一身藏竄，愍其辛苦，故從遠來而無所得，語婆羅門言：「我是薩婆達王，新王募人，求我甚重。」",
        "translation": "Because his own country had been destroyed and his family died, he hid himself in a body and fled because of his hardships, so he came from a long distance but didn't get anything. He said to the Brāhmaṇa, I am the king of sarvadharma, and the new king is recruiting people who are asking me for my help, which is very heavy.",
        "source": "T25n1509_012:0146b08_23"
    },
    {
        "source_sentence": "即時自縛以身施之，送與新王，大得財物。",
        "translation": "Immediately, he bound himself and gave it to the new king as a gift of his own body, which greatly enriched him with property.",
        "source": "T25n1509_012:0146b10_24"
    },
    {
        "source_sentence": "亦如月光太子，出行遊觀。",
        "translation": "It's also like the prince Candraprabha, who travels around and contemplates.",
        "source": "T25n1509_012:0146b11_25"
    },
    {
        "source_sentence": "癩人見之要車，白言：「我身重病，辛苦懊惱，太子嬉遊，獨自歡耶？",
        "translation": "Seeing this, the Licchavi saw the important chariot and said, “I am seriously ill.",
        "source": "T25n1509_012:0146b12_26"
    },
    {
        "source_sentence": "大慈愍念，願見救療！」",
        "translation": "With great compassion, I'd like to see you treated!",
        "source": "T25n1509_012:0146b13_27"
    },
    {
        "source_sentence": "太子聞之，以問諸醫。",
        "translation": "When the prince heard this, he asked the doctors about it.",
        "source": "T25n1509_012:0146b14_28"
    },
    {
        "source_sentence": "醫言：「當須從生長大無瞋之人血髓，塗而飲之，如是可愈。」",
        "translation": "The doctor said, You must grow from the blood and marrow of a great non-angry person's blood and marrow, rub it on it, and drink it; you can be cured like this.",
        "source": "T25n1509_012:0146b14_29"
    },
    {
        "source_sentence": "太子念言：「設有此人，貪生惜壽，何可得耶？",
        "translation": "The prince thought, Suppose there's this man who craves life and cherishes longevity, how could he get it?",
        "source": "T25n1509_012:0146b16_30"
    },
    {
        "source_sentence": "自除我身，無可得處。」",
        "translation": "If you remove yourself from my body, there's no place to get it.",
        "source": "T25n1509_012:0146b17_31"
    },
    {
        "source_sentence": "即命旃陀羅，令除身肉，破骨出髓以塗病人，以血飲之。",
        "translation": "He then ordered Candra to remove his flesh and bones, break through the bones and produce marrow to rub it on the sick man's body and drink it with blood.",
        "source": "T25n1509_012:0146b17_32"
    },
    {
        "source_sentence": "如是等種種，身及妻子，施而無悋，如棄草木。",
        "translation": "Such various things as these, body and wife, are given without anger, like discarding grass and trees.",
        "source": "T25n1509_012:0146b19_33"
    },
    {
        "source_sentence": "觀所施物，知從緣有，推求其實，都無所得，一切清淨，如涅槃相，乃至得無生法忍，是為結業生身行檀波羅蜜滿。",
        "translation": "Observing the things given, knowing that they exist based on conditions and investigating them in detail without obtaining anything, all pure like the characteristics of nirvāṇa, up to attaining the tolerance of the nonarising of phenomena, is the completion of the perfection of the sandalwood-pāramitā of forming a body by karma.",
        "source": "T25n1509_012:0146b20_34"
    },
    {
        "source_sentence": "云何法身菩薩行檀波羅蜜滿？",
        "translation": "How does a bodhisattva who practices the Dharma body fulfill the perfection of giving?",
        "source": "T25n1509_012:0146b22_35"
    },
    {
        "source_sentence": "菩薩末後肉身得無生法忍，捨肉身得法身。",
        "translation": "At the end of the bodhisattva's life, his physical body attains the tolerance of the nonarising of the Dharma, and he abandons his physical body to attain the Dharma body.",
        "source": "T25n1509_012:0146b23_36"
    },
    {
        "source_sentence": "於十方六道中，變身應適以化眾生，種種珍寶、衣服、飲食，給施一切。",
        "translation": "In the ten directions and six destinies, he transforms his body so that it adapts to transform sentient beings and gives various treasures, clothing, food, and drink to all of them.",
        "source": "T25n1509_012:0146b24_37"
    },
    {
        "source_sentence": "又以頭、目、髓、腦、國、財、妻、子，內、外所有，盡以布施。",
        "translation": "Also, he gives his head, eyes, marrow, bone marrow, head, country, possessions, wife, children, and all internal and external possessions as alms.",
        "source": "T25n1509_012:0146b26_38"
    },
    {
        "source_sentence": "譬如釋迦文佛曾為六牙白象，獵者伺便，以毒箭射之。",
        "translation": "It's like when Śākyamuni Buddha once was a white elephant with six teeth, and a hunter wanted to get an advantage over it and shot it with a poisonous arrow.",
        "source": "T25n1509_012:0146b27_39"
    },
    {
        "source_sentence": "諸象競至，欲來蹈殺獵者。",
        "translation": "The elephants rushed to the place, intending to attack and kill the hunters.",
        "source": "T25n1509_012:0146b28_40"
    },
    {
        "source_sentence": "白象以身捍之，擁護其人，愍之如子，諭遣群象。",
        "translation": "The white elephant defended it with its body to protect the man, beating him like a child and instructing the herd of elephants.",
        "source": "T25n1509_012:0146b29_41"
    },
    {
        "source_sentence": "徐問獵人：「何故射我？」",
        "translation": "Xu asked the hunter, Why did you shoot me?",
        "source": "T25n1509_012:0146c01_42"
    },
    {
        "source_sentence": "答曰：「我須汝牙！」",
        "translation": "He replied, I need your tooth!",
        "source": "T25n1509_012:0146c01_43"
    },
    {
        "source_sentence": "即時以六牙內石孔中，血肉俱出，以鼻舉牙，授與獵者。",
        "translation": "Immediately, he put his six tusks inside a stone pore with all the blood and flesh coming out, raised his tusks with his nose, and gave them to the hunter.",
        "source": "T25n1509_012:0146c02_44"
    },
    {
        "source_sentence": "雖曰象身，用心如是，當知此象非畜生行報。",
        "translation": "Although it's said that the elephant's body is like this, you should know that this elephant isn't the result of an animal's actions.",
        "source": "T25n1509_012:0146c03_45"
    },
    {
        "source_sentence": "阿羅漢法中，都無此心，當知此為法身菩薩。",
        "translation": "In the arhat's teaching, there's no such mind at all, so you should know that this is the Dharma body bodhisattva.",
        "source": "T25n1509_012:0146c04_46"
    },
    {
        "source_sentence": "有時閻浮提人，不知禮敬。",
        "translation": "There are times when people in Jambudvīpa don't know how to venerate them.",
        "source": "T25n1509_012:0146c05_47"
    },
    {
        "source_sentence": "耆舊有德，以言化之，未可得度。",
        "translation": "The elderly and virtuous monks were too old to be saved by teaching them in words.",
        "source": "T25n1509_012:0146c06_48"
    },
    {
        "source_sentence": "是時，菩薩自變其身，作迦頻闍羅鳥。",
        "translation": "The bodhisattva then transformed himself into a Kāśyapa-jāra bird.",
        "source": "T25n1509_012:0146c07_49"
    },
    {
        "source_sentence": "是鳥有二親友：一者大象，二者獼猴，共在必鉢羅樹下住。",
        "translation": "The bird had two close friends: one was a great elephant and the other a rhesus monkey, who lived together under a pippala tree.",
        "source": "T25n1509_012:0146c08_50"
    },
    {
        "source_sentence": "自相問言：「我等不知誰應為長？」",
        "translation": "They asked each other, We don't know who should be the longest?",
        "source": "T25n1509_012:0146c09_51"
    },
    {
        "source_sentence": "象言：「我昔見此樹在我腹下，今大如是。",
        "translation": "The elephant said, “In the past I saw this tree beneath my belly.",
        "source": "T25n1509_012:0146c10_52"
    },
    {
        "source_sentence": "以此推之，我應為長！」",
        "translation": "Because of this, I should be the longest!",
        "source": "T25n1509_012:0146c11_53"
    },
    {
        "source_sentence": "獼猴言：「我曾蹲地，手挽樹頭。",
        "translation": "The rhesus monkey said, “I once crouched on the ground holding a tree’s head in my hand.",
        "source": "T25n1509_012:0146c11_54"
    },
    {
        "source_sentence": "以是推之，我應為長！」",
        "translation": "Because of this, I should be the longest!",
        "source": "T25n1509_012:0146c12_55"
    },
    {
        "source_sentence": "鳥言：「我於必鉢羅林中，食此樹果，子隨糞出，此樹得生。",
        "translation": "The bird said, “I ate the fruit of this tree in Jeta’s Grove.",
        "source": "T25n1509_012:0146c12_56"
    },
    {
        "source_sentence": "以是推之，我應最長！」",
        "translation": "By inferring from this, I should be the longest!",
        "source": "T25n1509_012:0146c14_57"
    },
    {
        "source_sentence": "鳥復說言：「先生宿舊，禮應供養！」",
        "translation": "Again, the bird said, Sir, this is an old man who should be honored and offered support!",
        "source": "T25n1509_012:0146c14_58"
    },
    {
        "source_sentence": "即時大象背負獼猴，鳥在猴上，周遊而行。",
        "translation": "Immediately, the great elephant carried the monkey on its back, and the bird was above the monkey as it traveled around.",
        "source": "T25n1509_012:0146c15_59"
    },
    {
        "source_sentence": "一切禽獸見而問之：「何以如此？」",
        "translation": "All the animals saw him and asked, Why is it like this?",
        "source": "T25n1509_012:0146c16_60"
    },
    {
        "source_sentence": "答曰：「以此恭敬供養長老！」",
        "translation": "He replied, With respect and offerings to the elder!",
        "source": "T25n1509_012:0146c17_61"
    },
    {
        "source_sentence": "禽獸受化，皆行禮敬，不侵民田，不害物命。",
        "translation": "All the animals and birds that have undergone this instruction are treated with reverence, not attacking people’s land or harming living things.",
        "source": "T25n1509_012:0146c17_62"
    },
    {
        "source_sentence": "眾人疑怪，一切禽獸不復為害。",
        "translation": "The people doubted and wondered, but all the birds and animals were no longer harmed.",
        "source": "T25n1509_012:0146c18_63"
    },
    {
        "source_sentence": "獵者入林，見象負獼猴，獼猴戴鳥，行敬化物，物皆修善。",
        "translation": "When the hunter entered the forest, he saw an elephant carrying a rhesus monkey and the rhesus monkey wearing a bird. He practiced respectfully transforming things so that they would all cultivate goodness.",
        "source": "T25n1509_012:0146c19_64"
    },
    {
        "source_sentence": "傳告國人，人各慶曰：「時將太平，鳥獸而仁！」",
        "translation": "He told the people of his country, and they each celebrated it, saying, When he was about to return to peace, birds and animals were kind!",
        "source": "T25n1509_012:0146c21_0"
    },
    {
        "source_sentence": "人亦效之，皆行禮敬。",
        "translation": "The people also paid respect to him and worshipped him.",
        "source": "T25n1509_012:0146c22_0"
    },
    {
        "source_sentence": "自古及今，化流萬世。",
        "translation": "From ancient times up to the present, his teachings have spread throughout myriad ages.",
        "source": "T25n1509_012:0146c22_1"
    },
    {
        "source_sentence": "當知是為法身菩薩。",
        "translation": "You should know that this is the Dharma body bodhisattva.",
        "source": "T25n1509_012:0146c23_0"
    },
    {
        "source_sentence": "復次，法身菩薩，一時之頃，化作無央數身，供養十方諸佛；",
        "translation": "“Furthermore, the enlightening being Truth-body instantly transformed into an infinite number of bodies to honor all buddhas in the ten directions.",
        "source": "T25n1509_012:0146c23_1"
    },
    {
        "source_sentence": "一時能化無量財寶，給足眾生；",
        "translation": "At one time they were able to produce infinite riches and jewels at once, satisfying sentient beings.",
        "source": "T25n1509_012:0146c24_2"
    },
    {
        "source_sentence": "能隨一切上中下聲，一時之頃，普為說法；",
        "translation": "They were able to teach the Dharma according to all the highest, middle, and lowest voices in a single instant of time.",
        "source": "T25n1509_012:0146c25_3"
    },
    {
        "source_sentence": "乃至坐佛樹下。",
        "translation": "He'll even sit under a buddha tree.",
        "source": "T25n1509_012:0146c26_4"
    },
    {
        "source_sentence": "如是等種種，名為法身菩薩行檀波羅蜜滿。",
        "translation": "Such various things are called the fulfillment of the perfection of the Dharma body bodhisattva's practice of the perfection of giving.",
        "source": "T25n1509_012:0146c26_5"
    },
    {
        "source_sentence": "復次，檀有三種：一者、物施，二者、供養恭敬施，三者、法施。",
        "translation": "Furthermore, there are three kinds of giving: 1. giving things, 2. offering support and respect, and 3. giving the Dharma.",
        "source": "T25n1509_012:0146c27_6"
    },
    {
        "source_sentence": "云何物施？",
        "translation": "What's a gift of things?",
        "source": "T25n1509_012:0146c29_7"
    },
    {
        "source_sentence": "珍寶、衣、食、頭、目、髓、腦——如是等一切內、外所有，盡以布施，是名物施。",
        "translation": "Giving all the treasures, clothing, food, hair, head, eyes, marrow, and brains-and so forth that are possessed internally or externally is called giving things.",
        "source": "T25n1509_012:0146c29_8"
    },
    {
        "source_sentence": "恭敬施者，信心清淨，恭敬禮拜，將送迎逆，讚遶供養——如是等種種，名為恭敬施。",
        "translation": "Giving out of respect is when faith is pure, one venerates and venerates with respect, greets and reveres [the donor] in return, praises him or her, and makes offerings to him-and so forth. Such various things are called giving out of respect.",
        "source": "T25n1509_012:0147a01_9"
    },
    {
        "source_sentence": "法施者，為道德故，語言論議，誦讀講說，除疑問答，授人五戒——如是等種種，為佛道故施，是名法施。",
        "translation": "Giving the Dharma is giving for moral reasons, speaking and discussing words, reciting and teaching, except for questions and answers, and bestowing the five precepts on people - these kinds of things are given for the sake of the Buddha's path, which is called giving the Dharma.",
        "source": "T25n1509_012:0147a03_10"
    },
    {
        "source_sentence": "是三種施滿，是名檀波羅蜜滿。",
        "translation": "These three kinds of fulfillment of generosity are called the fulfillment of the perfection of giving.",
        "source": "T25n1509_012:0147a05_11"
    },
    {
        "source_sentence": "復次，三事因緣生檀：一者、信心清淨，二者、財物，三者、福田。",
        "translation": "Furthermore, there are three causes and conditions that give rise to sandalwood: 1. purity of faith, 2. possessions, and 3. the field of merit.",
        "source": "T25n1509_012:0147a06_12"
    },
    {
        "source_sentence": "心有三種：若憐愍，若恭敬，若憐愍恭敬。",
        "translation": "There are three kinds of mind: whether affectionate, respectful, or affectionate and respectful.",
        "source": "T25n1509_012:0147a07_13"
    },
    {
        "source_sentence": "施貧窮下賤及諸畜生，是為憐愍施；",
        "translation": "Giving to the poor, the inferior and the animals is giving out of pity.",
        "source": "T25n1509_012:0147a08_14"
    },
    {
        "source_sentence": "施佛及諸法身菩薩等，是為恭敬施；",
        "translation": "Giving to buddhas and enlightening beings of the body of reality is giving out of respect.",
        "source": "T25n1509_012:0147a09_15"
    },
    {
        "source_sentence": "若施諸老病貧乏阿羅漢、辟支佛，是為恭敬憐愍施。",
        "translation": "If someone gives to an arhat or pratyekabuddha who's old, sick, and poor, this is a gift of respect and pity.",
        "source": "T25n1509_012:0147a10_16"
    },
    {
        "source_sentence": "施物清淨，非盜非劫，以時而施，不求名譽，不求利養。",
        "translation": "Giving is pure, not stealing or robbery, given at the right time and without seeking fame or profit.",
        "source": "T25n1509_012:0147a11_17"
    },
    {
        "source_sentence": "或時從心大得福德，或從福田大得功德，或從妙物大得功德。",
        "translation": "Sometimes they attain great merit from their minds, sometimes they attain great merit from fields of merit, and sometimes they attain great merit from marvelous things.",
        "source": "T25n1509_012:0147a13_0"
    },
    {
        "source_sentence": "第一從心，如四等心、念佛三昧、以身施虎，如是名為從心大得功德。",
        "translation": "The first is to follow the mind, like the four equal states of mind, mindfulness of the Buddha's concentration, and giving a body to a tiger, which are called greatly attaining merit from the mind.",
        "source": "T25n1509_012:0147a14_1"
    },
    {
        "source_sentence": "福田有二種：一者、憐愍福田，二者、恭敬福田。",
        "translation": "There are two kinds of fields of merit: 1. the field of pity, 2. the field of reverence, and 3. the field of compassion.",
        "source": "T25n1509_012:0147a16_2"
    },
    {
        "source_sentence": "憐愍福田，能生憐愍心；",
        "translation": "Being compassionate is a field of blessings, enabling one to give rise to affection.",
        "source": "T25n1509_012:0147a17_3"
    },
    {
        "source_sentence": "恭敬福田，能生恭敬心。",
        "translation": "Being respectful to the field of merit, they can give rise to a mind of respect.",
        "source": "T25n1509_012:0147a17_4"
    },
    {
        "source_sentence": "如阿輸伽(秦言無憂)王以土上佛。",
        "translation": "Suppose the king of Aśoka (the Qin word for no sorrow) takes the Buddha on earth and puts it there.",
        "source": "T25n1509_012:0147a18_5"
    },
    {
        "source_sentence": "復次，物施中，如一女人，酒醉沒心，誤以七寶瓔珞布施迦葉佛塔，以福德故，生三十三天。",
        "translation": "Furthermore, among the things given, it's like a woman whose mind is drunk with wine and who mistakenly gives a seven-jeweled necklace to a stūpa of Kāśyapa Buddha because she's born in the thirty-three heavens because of merit.",
        "source": "T25n1509_012:0147a19_0"
    },
    {
        "source_sentence": "如是種種，名為物施。",
        "translation": "Such kinds of things are called giving things.",
        "source": "T25n1509_012:0147a21_1"
    },
    {
        "source_sentence": "問曰：檀名捨財，何以言「具足無所捨法」？",
        "translation": "Q: It's called giving up possessions because it's called giving up possessions, so why is it said to be fully endowed with the principle of not giving up?",
        "source": "T25n1509_012:0147a21_2"
    },
    {
        "source_sentence": "答曰：檀有二種：一者、出世間，二者、不出世間。",
        "translation": "Answer: There are two kinds of sandalwood: one, supramundane and two, supramundane.",
        "source": "T25n1509_012:0147a22_3"
    },
    {
        "source_sentence": "今說出世間檀無相，無相故無所捨，是故言「具足無所捨法」。",
        "translation": "Now, it's said that transmundane sandalwood has no marks, and because it has no marks, there's nothing to abandon.",
        "source": "T25n1509_012:0147a23_4"
    },
    {
        "source_sentence": "復次，財物不可得故，名為無所捨。",
        "translation": "Furthermore, because possessions are unobtainable, they're called having nothing to abandon.",
        "source": "T25n1509_012:0147a25_0"
    },
    {
        "source_sentence": "是物未來、過去空，現在分別，無一定法，以是故言無所捨。",
        "translation": "These things will be empty in the future and emptiness in the past, are discriminated in the present, and have no fixed dharmas; therefore, it's said that there's nothing to abandon.",
        "source": "T25n1509_012:0147a25_1"
    },
    {
        "source_sentence": "復次，以行者捨財時，心念此施大有功德，倚是而生憍慢、愛結等；",
        "translation": "“Furthermore, when a practitioner gives up his wealth, he is mindful of the great virtue of this charity. On relying upon it, such [things] as arrogance and craving arise.",
        "source": "T25n1509_012:0147a27_2"
    },
    {
        "source_sentence": "以是故言無所捨。",
        "translation": "That's why they say there's nothing to abandon.",
        "source": "T25n1509_012:0147a28_3"
    },
    {
        "source_sentence": "以無所捨故無憍慢，無憍慢故愛結等不生。",
        "translation": "Because of the absence of that which is to be abandoned, there is no arrogance; because of the absence of arrogance, bonds of thirst and so on do not arise.",
        "source": "T25n1509_012:0147a29_4"
    },
    {
        "source_sentence": "復次，施者有二種：一者、世間人，二者、出世間人。",
        "translation": "Furthermore, there are two kinds of giving: 1. worldly people and 2. supramundane people.",
        "source": "T25n1509_012:0147b01_5"
    },
    {
        "source_sentence": "世間人能捨財，不能捨施；",
        "translation": "People in the world can give up property but they cannot give it away.",
        "source": "T25n1509_012:0147b02_6"
    },
    {
        "source_sentence": "出世間人能捨財，能捨施。",
        "translation": "People outside the world can abandon possessions and give alms.",
        "source": "T25n1509_012:0147b02_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_012:0147b03_8"
    },
    {
        "source_sentence": "以財物、施心俱不可得故。",
        "translation": "It's because both possessions and the mind of giving are unobtainable.",
        "source": "T25n1509_012:0147b03_9"
    },
    {
        "source_sentence": "以是故言具足無所捨法。",
        "translation": "That's why it's said to be replete with the teaching that there's nothing to abandon.",
        "source": "T25n1509_012:0147b04_10"
    },
    {
        "source_sentence": "復次，檀波羅蜜中，言：「財、施、受者，三事不可得。」",
        "translation": "Furthermore, in the perfection of giving, it's said, Three things are unobtainable: possessions, generosity, and recipients.",
        "source": "T25n1509_012:0147b04_11"
    },
    {
        "source_sentence": "問曰：三事和合，故名為檀；",
        "translation": "Q: Because the three things are combined, it is called sandalwood.",
        "source": "T25n1509_012:0147b05_12"
    },
    {
        "source_sentence": "今言三事不可得，云何名「檀波羅蜜具足滿」？",
        "translation": "Now, it's said that the three things are unobtainable, so why is it called perfect completion of the perfection of giving?",
        "source": "T25n1509_012:0147b06_13"
    },
    {
        "source_sentence": "今有財、有施、有受者，云何三事不可得？",
        "translation": "Now that there's wealth, generosity, and recipients, what are the three things that are unobtainable?",
        "source": "T25n1509_012:0147b07_14"
    },
    {
        "source_sentence": "如所施疊實有。",
        "translation": "It's like giving a pile of things that really exist.",
        "source": "T25n1509_012:0147b08_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_012:0147b08_16"
    },
    {
        "source_sentence": "疊有名，則有疊法，若無疊法，亦無疊名；",
        "translation": "When a pile has names, there is a principle of overlap. If there were no principle of overlap, there also would be no name for the pile.",
        "source": "T25n1509_012:0147b09_17"
    },
    {
        "source_sentence": "以有名故，應實有疊。",
        "translation": "Because there is a name, there should really be a superposition.",
        "source": "T25n1509_012:0147b10_18"
    },
    {
        "source_sentence": "復次，疊有長、有短，麁、細、白、黑、黃、赤，有因有緣，有作有破，有果報，隨法生心。",
        "translation": "Furthermore, there are long and short piles of garments that are coarse, fine, white, black, yellow, and red, with causes and conditions, made and broken, with results and rewards, and minds that arise according to the teaching.",
        "source": "T25n1509_012:0147b10_19"
    },
    {
        "source_sentence": "十尺為長，五尺為短；",
        "translation": "Ten feet is long and five feet is short.",
        "source": "T25n1509_012:0147b12_20"
    },
    {
        "source_sentence": "縷大為麁，縷小為細；",
        "translation": "The large thread is coarse, while the small thread is fine.",
        "source": "T25n1509_012:0147b13_21"
    },
    {
        "source_sentence": "隨染有色；",
        "translation": "They are colored according to their defilement.",
        "source": "T25n1509_012:0147b13_22"
    },
    {
        "source_sentence": "有縷為因，織具為緣，是因緣和合故為疊。",
        "translation": "There are threads as cause and woven cloth as condition. It is the combination of causes and conditions that makes it a pile.",
        "source": "T25n1509_012:0147b13_23"
    },
    {
        "source_sentence": "人功為作，人毀為破；",
        "translation": "Human effort is doing what should be done, and human destruction is destroying [what should be done].",
        "source": "T25n1509_012:0147b14_24"
    },
    {
        "source_sentence": "御寒暑，弊身體，名果報。",
        "translation": "It protects against cold and heat, and its bad body is called the fruit of retribution.",
        "source": "T25n1509_012:0147b15_25"
    },
    {
        "source_sentence": "人得之大喜，失之大憂。",
        "translation": "People are greatly delighted when they attain it and greatly grieve when they lose it.",
        "source": "T25n1509_012:0147b16_26"
    },
    {
        "source_sentence": "以之施故，得福助道；",
        "translation": "Because of their giving, they attain blessedness and assist in the path.",
        "source": "T25n1509_012:0147b16_27"
    },
    {
        "source_sentence": "若盜若劫，戮之都市，死入地獄。",
        "translation": "If they steal or rob it, they'll be slain in the city and enter hell after death.",
        "source": "T25n1509_012:0147b17_28"
    },
    {
        "source_sentence": "如是等種種因緣，故知有此疊，是名疊法，云何言施物不可得？",
        "translation": "Because of these various causes and conditions, they know that there's this overlap, which is called the overlap dharma, so how can it be said that the gift is unobtainable?",
        "source": "T25n1509_012:0147b17_29"
    },
    {
        "source_sentence": "答曰：汝言有名故有，是事不然。",
        "translation": "Answer: You say it exists because it exists, but that's not the case.",
        "source": "T25n1509_012:0147b19_30"
    },
    {
        "source_sentence": "何以知之？",
        "translation": "How do we know this?",
        "source": "T25n1509_012:0147b20_31"
    },
    {
        "source_sentence": "名有二種：有實、有不實。",
        "translation": "Names are of two kinds: real and unreal.",
        "source": "T25n1509_012:0147b20_32"
    },
    {
        "source_sentence": "不實名，如有一草名朱利(朱利秦言賊也)，草亦不盜不劫，實非賊而名為賊。",
        "translation": "It doesn't really have a name, so suppose there's a blade of grass named Zhuli (known as thief in the Qin language), which isn't stealing or robbing, and it's really not a thief but is called a thief.",
        "source": "T25n1509_012:0147b21_0"
    },
    {
        "source_sentence": "又如兔角、龜毛，亦但有名而無實。",
        "translation": "It's also like the horns of a rabbit and the hair on a tortoise, which have only names but no substance.",
        "source": "T25n1509_012:0147b22_1"
    },
    {
        "source_sentence": "疊雖不如兔角、龜毛無，然因緣會故有，因緣散故無。",
        "translation": "Although a pile is not as good as the horns of a rabbit or the hairs of a tortoise, it exists due to the conjunction of causes and conditions; but it does not exist because the causes and conditions disperse.",
        "source": "T25n1509_012:0147b23_2"
    },
    {
        "source_sentence": "如林、如軍，是皆有名而無實。",
        "translation": "Like a forest or an army, they all have names but no reality.",
        "source": "T25n1509_012:0147b24_3"
    },
    {
        "source_sentence": "譬如木人，雖有人名，不應求其人法。",
        "translation": "It's like a woodworker who, even though he has a name, shouldn't seek his person's dharmas.",
        "source": "T25n1509_012:0147b25_4"
    },
    {
        "source_sentence": "疊中雖有名，亦不應求疊真實。",
        "translation": "Even though there are names in the pile, they shouldn't seek the true reality of the pile.",
        "source": "T25n1509_012:0147b26_5"
    },
    {
        "source_sentence": "疊能生人心念因緣，得之便喜，失之便憂，是為念因緣。",
        "translation": "These are the causes and conditions that give rise to mindfulness, which gives rise to joy when it's obtained and grief when it's lost.",
        "source": "T25n1509_012:0147b27_6"
    },
    {
        "source_sentence": "心生有二因緣：有從實而生，有從不實而生。",
        "translation": "There are two causes and conditions for the arising of mind: there are those that arise from reality and those that arise from what's not real.",
        "source": "T25n1509_012:0147b28_7"
    },
    {
        "source_sentence": "如夢中所見，如水中月，如夜見杌樹謂為人，如是名從不實中能令心生。",
        "translation": "It's like seeing what's seen in a dream, like the moon in water, and like seeing a rosewood tree at night that's called a person. Such names can cause the mind to arise from something unreal.",
        "source": "T25n1509_012:0147b29_8"
    },
    {
        "source_sentence": "是緣不定，不應言心生有故便是有。",
        "translation": "Because the supporting object is indeterminate, one should not say that it exists when mind arises.",
        "source": "T25n1509_012:0147c02_9"
    },
    {
        "source_sentence": "若心生因緣故有，更不應求實有。",
        "translation": "If mind exists because of the causes and conditions that give rise to it, you shouldn't seek real existence.",
        "source": "T25n1509_012:0147c03_10"
    },
    {
        "source_sentence": "如眼見水中月，心生謂是月，若從心生便是月者，則無復真月。",
        "translation": "If the eye sees the moon in water and the mind arises, it's called the moon, and if it arises from the mind, it's the moon, then there's no more true moon.",
        "source": "T25n1509_012:0147c04_11"
    },
    {
        "source_sentence": "復次，「有」，有三種：一者、相待有，二者、假名有，三者、法有。",
        "translation": "Furthermore, there are three kinds of existence: 1. dependent existence, 2. nominal existence, and 3. existent dharmas.",
        "source": "T25n1509_012:0147c05_12"
    },
    {
        "source_sentence": "相待者，如長短、彼此等，實無長短，亦無彼此，以相待故有名。",
        "translation": "mutual dependence means that there really is neither length nor shortness and neither one from the other. Because of mutual dependence, they have names.",
        "source": "T25n1509_012:0147c06_13"
    },
    {
        "source_sentence": "長因短有，短亦因長；",
        "translation": "A long one is the cause for a short one; a short one is also the cause for a long one.",
        "source": "T25n1509_012:0147c08_14"
    },
    {
        "source_sentence": "彼亦因此，此亦因彼；",
        "translation": "This is also the cause for that, and this is also the cause for that.",
        "source": "T25n1509_012:0147c08_15"
    },
    {
        "source_sentence": "若在物東，則以為西，在西則以為東；",
        "translation": "To the east of these things, one thinks of them as to the west; to the west of these things one thinks of them as to the east.",
        "source": "T25n1509_012:0147c09_16"
    },
    {
        "source_sentence": "一物未異而有東、西之別，此皆有名而無實也。",
        "translation": "Before one thing is different, there's the distinction between east and west, which are both named but not real.",
        "source": "T25n1509_012:0147c10_17"
    },
    {
        "source_sentence": "如是等，名為相待有，是中無實法，不如色、香、味、觸等。",
        "translation": "Such [things] as these are said to exist in dependence on each other. These do not really exist, but they are not the same as form, odor, taste, touch, etc.",
        "source": "T25n1509_012:0147c11_18"
    },
    {
        "source_sentence": "假名有者，如酪有色、香、味、觸，四事因緣合故，假名為酪。",
        "translation": "Formerly it is called ‘existence’: just as curds have form, smell, taste and touch. Because of the conjunction of four things as causes and conditions, they are provisionally called ‘curds’.",
        "source": "T25n1509_012:0147c12_19"
    },
    {
        "source_sentence": "雖有，不同因緣法有；",
        "translation": "Even though it exists, it does not have the same causes and conditions as the dharmas.",
        "source": "T25n1509_012:0147c13_20"
    },
    {
        "source_sentence": "雖無，亦不如兔角、龜毛無；",
        "translation": "Even if it were nonexistent, it would not be as if the horns of a rabbit or the hairs of a tortoise did not exist.",
        "source": "T25n1509_012:0147c14_21"
    },
    {
        "source_sentence": "但以因緣合故，假名有酪。",
        "translation": "It's simply because of the conjunction of causes and conditions that it's nominally called having cream.",
        "source": "T25n1509_012:0147c14_22"
    },
    {
        "source_sentence": "疊亦如是。",
        "translation": "So it is with the pile.",
        "source": "T25n1509_012:0147c15_23"
    },
    {
        "source_sentence": "復次，有極微色、香、味、觸，故有毛分，毛分因緣故有毛，毛因緣故有毳，毳因緣故有縷，縷因緣故有疊，疊因緣故有衣。",
        "translation": "Furthermore, there are extremely subtle forms, smells, tastes and tactile sensations: because of this, there is a hair atom. Because of the causes and conditions [of these] hair atoms, there is hair; because of the causes and conditions of hair being hair, there is wool; because of the causes and conditions of wool, there is thread; because of the causes and conditions of thread, there is cotton; because",
        "source": "T25n1509_012:0147c15_24"
    },
    {
        "source_sentence": "若無極微色、香、味、觸因緣，亦無毛分，毛分無故亦無毛，毛無故亦無毳，毳無故亦無縷，縷無故亦無疊，疊無故亦無衣。",
        "translation": "If there are no extremely subtle forms, smells, tastes, or tactile causes and conditions, there's also no hair part; if hair part is absent, there's no hair; if hair is absent, there's no roughness; if roughness is absent, there's no thread; if thread is absent, there's no overlap; and if overlap is absent, there's no clothing.",
        "source": "T25n1509_012:0147c18_25"
    },
    {
        "source_sentence": "問曰：亦不必一切物皆從因緣和合故有，如微塵至細故無分，無分故無和合。",
        "translation": "Q: It doesn't mean that all things don't exist because of the conjunction of causes and conditions, like particles up to subtlety that lack parts and lack conjunction because they lack parts.",
        "source": "T25n1509_012:0147c21_26"
    },
    {
        "source_sentence": "疊麁故可破，微塵中無分，云何可破？",
        "translation": "Because they are overlapping, they can be broken; there is no part of them among the atoms. How could they be broken?",
        "source": "T25n1509_012:0147c23_27"
    },
    {
        "source_sentence": "答曰：至微無實，強為之名。",
        "translation": "Answer: Up to the subtle and insubstantial, it's forcibly called that.",
        "source": "T25n1509_012:0147c24_28"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_012:0147c25_0"
    },
    {
        "source_sentence": "麁細相待，因麁故有細，是細復應有細。",
        "translation": "grossness and subtlety are mutually exclusive: because of being gross, there is subtle. This subtle should also be subtle.",
        "source": "T25n1509_012:0147c25_1"
    },
    {
        "source_sentence": "復次，若有極微色，則有十方分；",
        "translation": "“Furthermore, if atoms were extremely subtle, they would have the parts of the ten directions.",
        "source": "T25n1509_012:0147c26_2"
    },
    {
        "source_sentence": "若有十方分，是不名為極微；",
        "translation": "If there are parts in the ten directions, they are not called extremely subtle.",
        "source": "T25n1509_012:0147c26_3"
    },
    {
        "source_sentence": "若無十方分，則不名為色。",
        "translation": "If there are no parts in the ten directions, then they aren't called form.",
        "source": "T25n1509_012:0147c27_4"
    },
    {
        "source_sentence": "復次，若有極微，則應有虛空分齊；",
        "translation": "Furthermore, if atoms were extremely subtle, then space would be evenly spaced.",
        "source": "T25n1509_012:0147c28_5"
    },
    {
        "source_sentence": "若有分者，則不名極微。",
        "translation": "If there are parts, then they aren't called extremely subtle.",
        "source": "T25n1509_012:0147c29_0"
    },
    {
        "source_sentence": "復次，若有極微，是中有色、香、味、觸作分，色、香、味、觸作分，是不名極微。",
        "translation": "Furthermore, if there are atoms that are extremely subtle but have form, odor, taste, and tactile sensation as components, then form, odor, taste, and tactile sensation as components are not called extremely subtle.",
        "source": "T25n1509_012:0147c29_1"
    },
    {
        "source_sentence": "以是推求，微塵則不可得。",
        "translation": "Because of this inquiry, even a tiny particle of dust is unobtainable.",
        "source": "T25n1509_012:0148a02_2"
    },
    {
        "source_sentence": "如經言：「色若麁若細，若內若外，總而觀之，無常無我。」",
        "translation": "As the sūtra says, Whether form is crude or fine, internal or external, it's generally observed as impermanent and selfless.",
        "source": "T25n1509_012:0148a02_3"
    },
    {
        "source_sentence": "不言有微塵。",
        "translation": "It doesn't say there are tiny dust motes.",
        "source": "T25n1509_012:0148a04_0"
    },
    {
        "source_sentence": "是名分破空。",
        "translation": "This is called the partial refutation of emptiness.",
        "source": "T25n1509_012:0148a04_1"
    },
    {
        "source_sentence": "復有觀空：是疊隨心有。",
        "translation": "Again, there's the contemplation of emptiness: it's a superimposed existence that follows the mind.",
        "source": "T25n1509_012:0148a04_2"
    },
    {
        "source_sentence": "如坐禪人觀疊或作地、或作水、或作火、或作風，或青、或黃、或白、或赤，或都空，如十一切入觀。",
        "translation": "It's like a person sitting in meditation observing the ten all-encompassing contemplations of earth, water, fire, wind, blue, yellow, white, red, or both emptiness and emptiness.",
        "source": "T25n1509_012:0148a05_3"
    },
    {
        "source_sentence": "如佛在耆闍崛山中，與比丘僧俱，入王舍城。",
        "translation": "Suppose the Buddha was on Mount Gṛdhrakūṭa, accompanied by a group of monks and nuns, and entered Rājagṛha.",
        "source": "T25n1509_012:0148a07_4"
    },
    {
        "source_sentence": "道中見大水，佛於水上敷尼師壇坐，告諸比丘：「若比丘入禪，心得自在，能令大水作地，即成實地。",
        "translation": "When he saw a large body of water on the road, the Buddha spread out his nuns' altar seat on the water and told the monks, If a monk enters meditation with an unimpeded mind, he can cause that large body of water to become ground, which is when it becomes real ground.",
        "source": "T25n1509_012:0148a08_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_012:0148a11_0"
    },
    {
        "source_sentence": "是水中有地分故。",
        "translation": "It's because there's a part of earth in water.",
        "source": "T25n1509_012:0148a11_1"
    },
    {
        "source_sentence": "如是水、火、風、金、銀種種寶物即皆成實。",
        "translation": "Thus, these various treasures of water, fire, wind, gold, and silver will all become real.",
        "source": "T25n1509_012:0148a11_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_012:0148a12_3"
    },
    {
        "source_sentence": "是水中皆有其分。」",
        "translation": "There's a part of it in the water.",
        "source": "T25n1509_012:0148a12_4"
    },
    {
        "source_sentence": "復次，如一美色，婬人見之以為淨妙，心生染著；",
        "translation": "“Furthermore, it is like the case of a certain beautiful color that people see as pure and marvelous because their minds give rise to defiled attachment.",
        "source": "T25n1509_012:0148a13_5"
    },
    {
        "source_sentence": "不淨觀人視之，種種惡露，無一淨處；",
        "translation": "People observe the place as impure and look at it, but there is not a single spot of purity in all kinds of filthy places.",
        "source": "T25n1509_012:0148a14_6"
    },
    {
        "source_sentence": "等婦見之，妬瞋憎惡，目不欲見，以為不淨；",
        "translation": "When the other women saw him, they became angry and disgusted. Their eyes did not want to see him, thinking that he was impure.",
        "source": "T25n1509_012:0148a15_7"
    },
    {
        "source_sentence": "婬人觀之為樂；",
        "translation": "It pleases the people who see it as pleasure.",
        "source": "T25n1509_012:0148a16_8"
    },
    {
        "source_sentence": "妬人觀之為苦；",
        "translation": "A jealous person observes it as suffering.",
        "source": "T25n1509_012:0148a16_9"
    },
    {
        "source_sentence": "行人觀之得道；",
        "translation": "Practitioners observe them and attain enlightenment.",
        "source": "T25n1509_012:0148a17_0"
    },
    {
        "source_sentence": "無豫之人觀之，無所適莫，如見土木。",
        "translation": "People who don't prepare to contemplate it have no place to look, just like seeing dirt and wood.",
        "source": "T25n1509_012:0148a17_1"
    },
    {
        "source_sentence": "若此美色實淨，四種人觀，皆應見淨；",
        "translation": "If these beautiful forms are really pure, the four kinds of people observe them and all should see that they are pure.",
        "source": "T25n1509_012:0148a18_2"
    },
    {
        "source_sentence": "若實不淨，四種人觀，皆應不淨。",
        "translation": "If they really aren't pure, the four kinds of people observe that they should all be impure.",
        "source": "T25n1509_012:0148a19_3"
    },
    {
        "source_sentence": "以是故，知好醜在心，外無定也。",
        "translation": "Because of this, they know that good and bad are present in the mind but there's no concentration outside.",
        "source": "T25n1509_012:0148a19_4"
    },
    {
        "source_sentence": "觀空亦如是。",
        "translation": "So it is with observing emptiness.",
        "source": "T25n1509_012:0148a20_5"
    },
    {
        "source_sentence": "復次，是疊中有十八空相故，觀之便空，空故不可得。",
        "translation": "Furthermore, it's because there are 18 characteristics of emptiness in the pile, which are observed as emptiness and unobtainable because of emptiness.",
        "source": "T25n1509_012:0148a20_6"
    },
    {
        "source_sentence": "如是種種因緣財物空，決定不可得。",
        "translation": "Such are the various causes and conditions for the emptiness of possessions, which are definitely unobtainable.",
        "source": "T25n1509_012:0148a22_7"
    },
    {
        "source_sentence": "云何施人不可得？",
        "translation": "How is the donor unobtainable?",
        "source": "T25n1509_012:0148a23_0"
    },
    {
        "source_sentence": "如疊因緣和合故有，分分推之，疊不可得。",
        "translation": "It's like a pile that exists because of the conjunction of causes and conditions, and when it's deduced separately, the pile is unobtainable.",
        "source": "T25n1509_012:0148a23_1"
    },
    {
        "source_sentence": "施者亦如是，四大圍虛空，名為身，是身識動作來往坐起，假名為人。",
        "translation": "Giving is likewise, the four elements surrounding space are called body, which is the body and consciousness that moves, comes, goes, sits, and rises up, and is nominally called person.",
        "source": "T25n1509_012:0148a24_2"
    },
    {
        "source_sentence": "分分求之，亦不可得。",
        "translation": "Part by part, they're also unobtainable.",
        "source": "T25n1509_012:0148a26_0"
    },
    {
        "source_sentence": "復次，一切眾、界、入中，我不可得，我不可得故，施人不可得。",
        "translation": "Furthermore, in all the congregations, realms, and sense-fields, there's a self that's unobtainable, and because it's unobtainable, giving to someone is unobtainable.",
        "source": "T25n1509_012:0148a26_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_012:0148a27_2"
    },
    {
        "source_sentence": "我，有種種名字：人、天，男、女，施人、受人，受苦人、受樂人，畜生等；",
        "translation": "The self has various names: humans, gods, men, women, donors, recipients, those in distress, those who are happy, animals, etc.",
        "source": "T25n1509_012:0148a27_3"
    },
    {
        "source_sentence": "是但有名，而實法不可得。",
        "translation": "They only have names, but real dharmas are unobtainable.",
        "source": "T25n1509_012:0148a29_4"
    },
    {
        "source_sentence": "問曰：若施者不可得，云何有菩薩行檀波羅蜜？",
        "translation": "Q: If a donor is unobtainable, how could there be a bodhisattva who practices the perfection of giving?",
        "source": "T25n1509_012:0148a29_5"
    },
    {
        "source_sentence": "答曰：因緣和合故有名字，如屋、如車，實法不可得。",
        "translation": "Answer: It's because of the conjunction of causes and conditions that there are names, like a house or a chariot, which are really unobtainable.",
        "source": "T25n1509_012:0148b02_0"
    },
    {
        "source_sentence": "問曰：云何我不可得？",
        "translation": "Q: How is the self unobtainable?",
        "source": "T25n1509_012:0148b03_1"
    },
    {
        "source_sentence": "答曰：如上「我聞一時」中已說，今當更說。",
        "translation": "Answer: As explained in the above, I've heard it at one time, I'll explain it again.",
        "source": "T25n1509_012:0148b03_2"
    },
    {
        "source_sentence": "佛說六識：眼識及眼識相應法，共緣色，不緣屋舍、城郭種種諸名。",
        "translation": "The Buddha has spoken of six forms of consciousness. Consciousness of the eye and the factors associated with consciousness of the eye take matter as supporting object:",
        "source": "T25n1509_012:0148b04_3"
    },
    {
        "source_sentence": "耳、鼻、舌、身識，亦如是。",
        "translation": "The same applies to the consciousnesses of ear, nose, tongue and body.",
        "source": "T25n1509_012:0148b06_4"
    },
    {
        "source_sentence": "意識及意識相應法，知眼、知色、知眼識，乃至知意、知法、知意識。",
        "translation": "Consciousness of the mind and dharmas associated with it, knowing eye, knowing form, knowing eye consciousness, up to knowing mind, knowing things, and knowing consciousness of the mind.",
        "source": "T25n1509_012:0148b06_5"
    },
    {
        "source_sentence": "是識所緣法，皆空無我，生滅故，不自在故。",
        "translation": "These dharmas that are the object of consciousness are all empty and without self, because they arise and cease and aren't self-contained.",
        "source": "T25n1509_012:0148b08_6"
    },
    {
        "source_sentence": "無為法中亦不計我，苦樂不受故。",
        "translation": "In the unconditioned dharmas, no self is imagined: because suffering and satisfaction are not experienced.",
        "source": "T25n1509_012:0148b09_7"
    },
    {
        "source_sentence": "是中若強有我法，應當有第七識識我；",
        "translation": "If self and dharmas exist forcefully, there should be a seventh consciousness that recognizes the self.",
        "source": "T25n1509_012:0148b09_8"
    },
    {
        "source_sentence": "而今不爾，以是故知無我。",
        "translation": "But now it is not so: because of this, one knows that there is no self.",
        "source": "T25n1509_012:0148b10_9"
    },
    {
        "source_sentence": "問曰：何以識無我？",
        "translation": "Q: Why is consciousness without self?",
        "source": "T25n1509_012:0148b11_10"
    },
    {
        "source_sentence": "一切人各於自身中生計我，不於他身中生我；",
        "translation": "All people think of themselves as self within themselves, but they do not think of others as self.",
        "source": "T25n1509_012:0148b11_11"
    },
    {
        "source_sentence": "若自身中無我，而妄見為我者，他身中無我，亦應於他身而妄見為我。",
        "translation": "If there's no self in himself but deludedly views it as self, then there's no self in another person's body, and they should also deludedly see other people's bodies as self.",
        "source": "T25n1509_012:0148b13_12"
    },
    {
        "source_sentence": "復次，若內無我，色、識念念生滅，云何分別知是色青、黃、赤、白？",
        "translation": "Furthermore, if there's no self inside, form and consciousness arise and cease in each other, how can we discriminate and know that it's form blue, yellow, red, or white?",
        "source": "T25n1509_012:0148b14_13"
    },
    {
        "source_sentence": "復次，若無我，今現在人識，漸漸生滅，身命斷時亦盡，諸行罪福，誰隨誰受？",
        "translation": "Furthermore, if there's no self, then the present person's consciousness gradually arises and ceases, and when body and life are cut off, they also end, so who will receive it according to whom?",
        "source": "T25n1509_012:0148b16_14"
    },
    {
        "source_sentence": "誰受苦樂？",
        "translation": "Who experiences pain and pleasure?",
        "source": "T25n1509_012:0148b17_15"
    },
    {
        "source_sentence": "誰解脫者？",
        "translation": "Who is liberated?",
        "source": "T25n1509_012:0148b18_16"
    },
    {
        "source_sentence": "如是種種因緣故知有我。",
        "translation": "Because of these various causes and conditions, they know that there's a self.",
        "source": "T25n1509_012:0148b18_17"
    },
    {
        "source_sentence": "答曰：此俱有難！",
        "translation": "Answer: Both of these have difficulties!",
        "source": "T25n1509_012:0148b19_18"
    },
    {
        "source_sentence": "若於他身生計我者，復當言「何以不自身中生計我」？",
        "translation": "If someone creates a self that's imagined in other bodies, they should also say, Why isn't a self created in themselves?",
        "source": "T25n1509_012:0148b19_19"
    },
    {
        "source_sentence": "復次，五眾因緣生故空無我，從無明因緣生二十身見，是我見自於五陰相續生。",
        "translation": "Furthermore, because emptiness and selflessness arise by reason of the fivefold set of causes and conditions, twenty beliefs in a self arise from the causes and conditions of ignorance. These beliefs in a self arise successively within the five aggregates themselves.",
        "source": "T25n1509_012:0148b20_20"
    },
    {
        "source_sentence": "以從此五眾緣生故，即計此五眾為我，不在他身，以其習故。",
        "translation": "Because they arise from these five groups of dependent co-arising, exactly this means that the five groups are calculated to be self and not other bodies: because of their accumulation.",
        "source": "T25n1509_012:0148b22_21"
    },
    {
        "source_sentence": "復次，若有神者，可有彼我。",
        "translation": "Furthermore, if there's a soul, it can have that self.",
        "source": "T25n1509_012:0148b24_22"
    },
    {
        "source_sentence": "汝神有無未了，而問彼我！",
        "translation": "Your mind has no understanding of existence or nonexistence, yet you ask me about it!",
        "source": "T25n1509_012:0148b24_23"
    },
    {
        "source_sentence": "其猶人問兔角，答似馬角。",
        "translation": "It's like someone who asks about a rabbit horn and answers with a horse horn.",
        "source": "T25n1509_012:0148b25_24"
    },
    {
        "source_sentence": "馬角若實有，可以證兔角；",
        "translation": "If the horn of a horse really exists, one can realize the horn of a rabbit.",
        "source": "T25n1509_012:0148b26_25"
    },
    {
        "source_sentence": "馬角猶尚未了，而欲以證兔角。",
        "translation": "The horns of the horse hadn't yet been completed, but he wanted to use them to realize the horns of a rabbit.",
        "source": "T25n1509_012:0148b26_26"
    },
    {
        "source_sentence": "復次，自於身生我故，便自謂有神。",
        "translation": "Furthermore, because a self arises from the body itself, it then says to itself that it has a soul.",
        "source": "T25n1509_012:0148b27_27"
    },
    {
        "source_sentence": "汝言「神遍」，亦應計他身為我。",
        "translation": "You say that the soul pervades, but you should also impute other bodies as self.",
        "source": "T25n1509_012:0148b28_28"
    },
    {
        "source_sentence": "以是故，不應言「自身中生計我心，於他身不生，故知有神」。",
        "translation": "For this reason, it shouldn't be said that the self-thought arises in itself and doesn't arise in other bodies; therefore, it knows there's a soul.",
        "source": "T25n1509_012:0148b29_0"
    },
    {
        "source_sentence": "復次，有人於他物中我心生，如外道坐禪人，用地一切入觀時，見地則是我，我則是地，水、火、風、空，亦如是。",
        "translation": "“Furthermore, suppose there is someone who thinks ‘I am a self’ regarding other things. Just as the heretic meditates while sitting in meditation; when he enters into contemplation on earth and everything else, he sees that earth is himself [the self] and that self is earth (i.e., water, fire, wind, air, and space).",
        "source": "T25n1509_012:0148c01_1"
    },
    {
        "source_sentence": "顛倒故，於他身中亦計我。",
        "translation": "Because of being overturned, they also imagine a self in the bodies of others.",
        "source": "T25n1509_012:0148c03_2"
    },
    {
        "source_sentence": "復次，有時於他身生我，如有一人，受使遠行，獨宿空舍。",
        "translation": "“Furthermore, sometimes a self arises from the bodies of others. Suppose there is a man who receives an envoy traveling far away to live alone in an empty hut.",
        "source": "T25n1509_012:0148c04_3"
    },
    {
        "source_sentence": "夜中有鬼擔一死人來著其前，復有一鬼逐來，瞋罵前鬼：「是死人是我物，汝何以擔來？」",
        "translation": "In the middle of the night, there was a ghost carrying a dead man in front of him, and another ghost chased him away, angrily scolded the other ghosts, saying, This dead man is mine; why are you carrying it?",
        "source": "T25n1509_012:0148c05_4"
    },
    {
        "source_sentence": "先鬼言：「是我物，我自持來。」",
        "translation": "The former demon said, This is my property; I'll take it for myself.",
        "source": "T25n1509_012:0148c07_5"
    },
    {
        "source_sentence": "後鬼言：「是死人實我擔來！」",
        "translation": "The latter demon said, This is really my burden as a dead man!",
        "source": "T25n1509_012:0148c08_6"
    },
    {
        "source_sentence": "二鬼各捉一手爭之。",
        "translation": "Each of the two ghosts grabbed it with one hand and fought it.",
        "source": "T25n1509_012:0148c08_7"
    },
    {
        "source_sentence": "前鬼言：「此有人可問。」",
        "translation": "The previous demon said, There's someone here to ask questions.",
        "source": "T25n1509_012:0148c09_8"
    },
    {
        "source_sentence": "後鬼即問：「是死人誰擔來？」",
        "translation": "The latter ghost then asked, Who is the dead man carrying it?",
        "source": "T25n1509_012:0148c09_9"
    },
    {
        "source_sentence": "是人思惟：「此二鬼力大，若實語亦當死，若妄語亦當死，俱不免死，何為妄語？」",
        "translation": "That person thinks, These two ghosts are so powerful that if they really speak, they'll die, and if they speak falsely, they'll die, but neither can escape death; why would they speak falsely?",
        "source": "T25n1509_012:0148c10_10"
    },
    {
        "source_sentence": "語言：「前鬼擔來。」",
        "translation": "They said, The former ghosts are coming with their burdens.",
        "source": "T25n1509_012:0148c12_11"
    },
    {
        "source_sentence": "後鬼大瞋，捉人手拔出著地，前鬼取死人一臂拊之即著。",
        "translation": "The latter demon became furious and grabbed the man's hand and pulled it out to the ground, and the former demon snatched a dead man's arm and touched him, then attachment.",
        "source": "T25n1509_012:0148c12_12"
    },
    {
        "source_sentence": "如是兩臂、兩腳、頭、脇，舉身皆易。",
        "translation": "Thus, these two arms, two legs, head, and flanks are all easy to lift.",
        "source": "T25n1509_012:0148c14_13"
    },
    {
        "source_sentence": "於是二鬼共食所易人身，拭口而去。",
        "translation": "The two ghosts then shared the food, exchanged their bodies, wiped their mouths, and left.",
        "source": "T25n1509_012:0148c14_14"
    },
    {
        "source_sentence": "其人思惟：「我人母生身，眼見二鬼食盡，今我此身盡是他肉。",
        "translation": "That man thought, My mother gave birth to my body and saw that the eyes of two ghosts had run out of food, but now this body of mine has run out of other flesh.",
        "source": "T25n1509_012:0148c15_15"
    },
    {
        "source_sentence": "我今定有身耶？",
        "translation": "Does the self now definitely have a body?",
        "source": "T25n1509_012:0148c17_0"
    },
    {
        "source_sentence": "為無身耶？",
        "translation": "Why is there no body?",
        "source": "T25n1509_012:0148c17_1"
    },
    {
        "source_sentence": "若以為有，盡是他身；",
        "translation": "If one thinks it exists, they are all other bodies.",
        "source": "T25n1509_012:0148c17_2"
    },
    {
        "source_sentence": "若以為無，今現有身。」",
        "translation": "If someone thinks it's nonexistent, they'll now have a body.",
        "source": "T25n1509_012:0148c18_3"
    },
    {
        "source_sentence": "如是思惟，其心迷悶，譬如狂人。",
        "translation": "When they think like this, their minds are confused, like a madman.",
        "source": "T25n1509_012:0148c18_4"
    },
    {
        "source_sentence": "明朝尋路而去，到前國土，見有佛塔眾僧，不論餘事，但問己身為有為無？",
        "translation": "In the morning, he searched his way and departed. When he arrived in a previous land, he saw that there were buddha-tathāgatas and other monks who didn't care about anything else but asked whether their bodies are conditioned or not?",
        "source": "T25n1509_012:0148c19_5"
    },
    {
        "source_sentence": "諸比丘問：「汝是何人？」",
        "translation": "The monks asked, Who are you?",
        "source": "T25n1509_012:0148c21_6"
    },
    {
        "source_sentence": "答言：「我亦不自知是人、非人？」",
        "translation": "He replied, I don't know for myself whether it's a person or not?",
        "source": "T25n1509_012:0148c21_7"
    },
    {
        "source_sentence": "即為眾僧廣說上事。",
        "translation": "He then explained the above matter in detail for the saṃgha.",
        "source": "T25n1509_012:0148c22_8"
    },
    {
        "source_sentence": "諸比丘言：「此人自知無我，易可得度。」",
        "translation": "The monks said, This person knows for themselves that there's no self, and it's easy to save them.",
        "source": "T25n1509_012:0148c22_9"
    },
    {
        "source_sentence": "而語之言：「汝身從本已來，恒自無我，非適今也。",
        "translation": "He said to them, “Your body has always been without self since the distant past; it is not suitable for the present.",
        "source": "T25n1509_012:0148c23_10"
    },
    {
        "source_sentence": "但以四大和合故，計為我身，如汝本身，與今無異。」",
        "translation": "It's simply because of the confluence of the four elements that they're considered to be self, just like you yourself, which is no different from the present.",
        "source": "T25n1509_012:0148c24_11"
    },
    {
        "source_sentence": "諸比丘度之為道，斷諸煩惱，即得阿羅漢。",
        "translation": "The monks converted them to the path, cut off their afflictions, and then attained arhatship.",
        "source": "T25n1509_012:0148c26_12"
    },
    {
        "source_sentence": "是為有時他身亦計為我。",
        "translation": "This is because sometimes other bodies are also imagined to be self.",
        "source": "T25n1509_012:0148c27_13"
    },
    {
        "source_sentence": "不可以有彼此故謂有我。",
        "translation": "It can't be said to have a self because there are no two.",
        "source": "T25n1509_012:0148c27_14"
    },
    {
        "source_sentence": "復次，是我實性，決定不可得。",
        "translation": "Furthermore, the essence of self is definitely ungraspable.",
        "source": "T25n1509_012:0148c28_15"
    },
    {
        "source_sentence": "若常相、非常相，自在相、不自在相，作相、不作相，色相、非色相，如是等種種皆不可得。",
        "translation": "If the characteristics of permanence and impermanence, the characteristics of mastery and non-mastery, the characteristics that are made and those that are not made, the characteristics of form and the characteristics of formlessness, such various things as these are all unobtainable.",
        "source": "T25n1509_012:0148c29_0"
    },
    {
        "source_sentence": "若有相則有法，無相則無法，我今無相，則知無我。",
        "translation": "If there are characteristics, then there are dharmas; if there are no characteristics, then there are non-dharmas. Now that the self has no characteristics, we know that it has no self.",
        "source": "T25n1509_012:0149a01_1"
    },
    {
        "source_sentence": "若我是常，不應有殺罪。",
        "translation": "If the self were permanent, there would be no sin of killing.",
        "source": "T25n1509_012:0149a03_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_012:0149a03_3"
    },
    {
        "source_sentence": "身可殺，非常故；",
        "translation": "The body can be killed because it is not eternal.",
        "source": "T25n1509_012:0149a03_4"
    },
    {
        "source_sentence": "我不可殺，常故。",
        "translation": "I can't be killed because it's permanent.",
        "source": "T25n1509_012:0149a04_5"
    },
    {
        "source_sentence": "問曰：我雖常故不可殺，但殺身則有殺罪。",
        "translation": "Q: Although I'm permanent, I can't be killed, but if I kill my body, there's the sin of killing.",
        "source": "T25n1509_012:0149a04_6"
    },
    {
        "source_sentence": "答曰：若殺身有殺罪者，《毘尼》中言：「自殺無殺罪。」",
        "translation": "Answer: If someone kills their body and has the sin of killing, the Vinaya says, Suffering is not the sin of killing.",
        "source": "T25n1509_012:0149a05_7"
    },
    {
        "source_sentence": "罪福從惱他益他生，非自供養身、自殺身故有罪有福。",
        "translation": "Sin and merit arise from harming others and benefiting others, not from making offerings to oneself or committing suicide because there's sin and merit.",
        "source": "T25n1509_012:0149a07_0"
    },
    {
        "source_sentence": "以是故《毘尼》中言：「自殺身無殺罪，有愚癡、貪欲、瞋恚之咎。」",
        "translation": "That's why the Vinaya says, There's no offense of killing by committing suicide, and there's the blame of foolishness, craving, and anger.",
        "source": "T25n1509_012:0149a08_1"
    },
    {
        "source_sentence": "若神常者，不應死，不應生。",
        "translation": "If the soul were permanent, it wouldn't die and wouldn't arise.",
        "source": "T25n1509_012:0149a09_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_012:0149a10_3"
    },
    {
        "source_sentence": "汝等法神常，一切遍滿五道中，云何有死生？",
        "translation": "You Dharma spirits are eternal, so how could there be death and birth in all the five destinies that pervade them?",
        "source": "T25n1509_012:0149a10_4"
    },
    {
        "source_sentence": "死名此處失，生名彼處出。",
        "translation": "Death is called loss in this place; birth is called coming out of that place.",
        "source": "T25n1509_012:0149a11_5"
    },
    {
        "source_sentence": "以是故，不得言神常。",
        "translation": "Because of this, it can't be said that the soul is permanent.",
        "source": "T25n1509_012:0149a12_6"
    },
    {
        "source_sentence": "若神常者，亦應不受苦樂。",
        "translation": "If the soul were eternal, it would not experience either pleasure or pain.",
        "source": "T25n1509_012:0149a12_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_012:0149a13_8"
    },
    {
        "source_sentence": "苦來則憂，樂至則喜，若為憂喜所變者，則非常也。",
        "translation": "When suffering comes, sorrow; when happiness arrives, joy. If it is transformed by sorrow and joy, then it is impermanent.",
        "source": "T25n1509_012:0149a13_9"
    },
    {
        "source_sentence": "若常，應如虛空，雨不能濕，熱不能乾，亦無今世、後世。",
        "translation": "If it were constant, it would be like space: rain could not moisten it and heat could not dry it; neither would there be a present world nor a future world.",
        "source": "T25n1509_012:0149a14_10"
    },
    {
        "source_sentence": "若神常者，亦不應有後世生、今世死。",
        "translation": "If the soul were eternal, there could not be birth in a later existence or death in this one.",
        "source": "T25n1509_012:0149a16_0"
    },
    {
        "source_sentence": "若神常者，則常有我見，不應得涅槃。",
        "translation": "If the soul were permanent, then permanence would have a view of self and you would not attain nirvana.",
        "source": "T25n1509_012:0149a16_1"
    },
    {
        "source_sentence": "若神常者，則無起無滅，不應有忘失；",
        "translation": "If the soul were permanent, there would be neither arising nor ceasing, and there should not be forgetfulness.",
        "source": "T25n1509_012:0149a17_2"
    },
    {
        "source_sentence": "以其無神，識無常故，有忘有失，是故神非常也！",
        "translation": "Because there's no soul, and because consciousness is impermanent, there's forgetfulness and loss; therefore, soul is not permanent!",
        "source": "T25n1509_012:0149a18_3"
    },
    {
        "source_sentence": "如是等種種因緣，可知神非常相。",
        "translation": "Such are the various causes and conditions that make it possible to know that the soul is not eternal.",
        "source": "T25n1509_012:0149a19_4"
    },
    {
        "source_sentence": "若神無常相者，亦無罪無福。",
        "translation": "If the soul has impermanent characteristics, it's also without sin or merit.",
        "source": "T25n1509_012:0149a20_5"
    },
    {
        "source_sentence": "若身無常，神亦無常，二事俱滅，則墮斷滅邊。",
        "translation": "If the body is impermanent and the soul is impermanent, and if both things cease, then they'll fall into the extreme of cessation.",
        "source": "T25n1509_012:0149a21_6"
    },
    {
        "source_sentence": "墮斷滅，則無到後世受罪福者。",
        "translation": "If they fall into cessation, then there won't be anyone who receives sin and merit in a later life.",
        "source": "T25n1509_012:0149a22_7"
    },
    {
        "source_sentence": "若斷滅，則得涅槃不須斷結，亦不用後世罪福因緣。",
        "translation": "If he stops and extinguishes them, then he'll attain nirvāṇa without the need to break the bonds, and he won't use the causes of sin and merit in later lifetimes.",
        "source": "T25n1509_012:0149a23_8"
    },
    {
        "source_sentence": "如是等種種因緣，可知神非無常。",
        "translation": "Such various causes and conditions make it possible to know that the soul is not impermanent.",
        "source": "T25n1509_012:0149a24_9"
    },
    {
        "source_sentence": "若神自在相、作相者，則應隨所欲得皆得；",
        "translation": "If it were with the characteristic marks of unimpededness and the characteristic marks of what is manifesting, then all should be acquired according to wish.",
        "source": "T25n1509_012:0149a25_10"
    },
    {
        "source_sentence": "今所欲更不得，非所欲更得。",
        "translation": "What I want now is no longer obtained, and what I don't want is no longer obtained.",
        "source": "T25n1509_012:0149a26_11"
    },
    {
        "source_sentence": "若神自在，亦不應有作惡行，墮畜生惡道中。",
        "translation": "If the soul is free, it shouldn't have done bad actions and fallen into the bad destinies of animals.",
        "source": "T25n1509_012:0149a26_12"
    },
    {
        "source_sentence": "復次，一切眾生皆不樂苦，誰當好樂而更得苦？",
        "translation": "Furthermore, all sentient beings don't delight in suffering, so who will delight in it and attain suffering again?",
        "source": "T25n1509_012:0149a27_13"
    },
    {
        "source_sentence": "以是故，知神不自在，亦不作。",
        "translation": "Because of this, they know that the soul isn't self-contained and doesn't do anything.",
        "source": "T25n1509_012:0149a28_14"
    },
    {
        "source_sentence": "又如人畏罪故，自強行善，若自在者，何以畏罪而自強修福？",
        "translation": "Also, it's like a person who fears sin and forcibly performs good deeds on their own. If he does so freely, why would he forcibly cultivate good deeds on his own because he fears sin?",
        "source": "T25n1509_012:0149a29_15"
    },
    {
        "source_sentence": "又諸眾生不得如意，常為煩惱愛縛所牽。",
        "translation": "Also, sentient beings who don't attain supernormal abilities are always bound by the bond of affliction and craving.",
        "source": "T25n1509_012:0149b02_16"
    },
    {
        "source_sentence": "如是等種種因緣，知神不自在、不自作。",
        "translation": "Such are the various causes and conditions for knowing that the soul isn't self-contained or self-manifest.",
        "source": "T25n1509_012:0149b03_17"
    },
    {
        "source_sentence": "若神不自在、不自作者，是為無神相，言我者，即是六識，更無異事。",
        "translation": "If the soul isn't self-contained and doesn't create itself, this is the absence of the characteristics of the soul. When it says self, it means the six consciousnesses, and there are no different things.",
        "source": "T25n1509_012:0149b04_0"
    },
    {
        "source_sentence": "復次，若不作者，云何閻羅王問罪人：「誰使汝作此罪者？」",
        "translation": "Furthermore, if you don't do so, then why did King Yama ask the offender, Who will cause you to commit this offense?",
        "source": "T25n1509_012:0149b05_1"
    },
    {
        "source_sentence": "罪人答言：「是我自作。」",
        "translation": "The sinners replied, I did it myself.",
        "source": "T25n1509_012:0149b06_2"
    },
    {
        "source_sentence": "以是故，知非不自作。",
        "translation": "Because of this, they know it's not self-made.",
        "source": "T25n1509_012:0149b07_3"
    },
    {
        "source_sentence": "若神色相者，是事不然。",
        "translation": "If it's a mark of divine form, that's not the case.",
        "source": "T25n1509_012:0149b07_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_012:0149b08_5"
    },
    {
        "source_sentence": "一切色無常故。",
        "translation": "It's because all form is impermanent.",
        "source": "T25n1509_012:0149b08_6"
    },
    {
        "source_sentence": "問曰：人云何言「色是我相」？",
        "translation": "Q: How does a person say form is the mark of self?",
        "source": "T25n1509_012:0149b08_7"
    },
    {
        "source_sentence": "答曰：有人言：「神在心中，微細如芥子，清淨名為淨色身。」",
        "translation": "Answer: Some people say, The soul is in the mind that's subtle like a mustard seed, and its purity is called pure form body.",
        "source": "T25n1509_012:0149b09_8"
    },
    {
        "source_sentence": "更有人言「如麥」，有言「如豆」，有言「半寸」，有言「一寸」。",
        "translation": "Some people say it's like wheat, some say it's like beans, some say it's half an inch, and some say it's one inch.",
        "source": "T25n1509_012:0149b10_9"
    },
    {
        "source_sentence": "初受身時，最在前受，譬如像骨；",
        "translation": "At the moment of the first feeling of the body, it is felt at the very front.",
        "source": "T25n1509_012:0149b12_0"
    },
    {
        "source_sentence": "及其成身，如像已莊。",
        "translation": "Their formed bodies are like an image that's already adorned.",
        "source": "T25n1509_012:0149b12_1"
    },
    {
        "source_sentence": "有言：「大小隨人身，死壞時，此亦前出。」",
        "translation": "Some people say, According to the size of the person's body, this also comes out in front when death breaks up.",
        "source": "T25n1509_012:0149b13_2"
    },
    {
        "source_sentence": "如此事，皆不爾也！",
        "translation": "None of these things are like that!",
        "source": "T25n1509_012:0149b14_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_012:0149b14_4"
    },
    {
        "source_sentence": "一切色，四大所造，因緣生故無常。",
        "translation": "All forms are created by the four elements and are impermanent because they arise due to causes and conditions.",
        "source": "T25n1509_012:0149b14_5"
    },
    {
        "source_sentence": "若神是色，色無常，神亦無常。",
        "translation": "If a soul is form, form is impermanent, and the soul is also impermanent.",
        "source": "T25n1509_012:0149b15_6"
    },
    {
        "source_sentence": "若無常者，如上所說。",
        "translation": "If it's impermanent, it's as explained above.",
        "source": "T25n1509_012:0149b16_7"
    },
    {
        "source_sentence": "問曰：身有二種：麁身及細身。",
        "translation": "Q: There are two kinds of bodies: crude and fine bodies.",
        "source": "T25n1509_012:0149b16_8"
    },
    {
        "source_sentence": "麁身無常，細身是神，世世常去入五道中。",
        "translation": "The gross body is impermanent, and the subtle body is a soul that always leaves and enters the five destinies from time to time.",
        "source": "T25n1509_012:0149b17_9"
    },
    {
        "source_sentence": "答曰：此細身不可得。",
        "translation": "Answer: This subtle body is unobtainable.",
        "source": "T25n1509_012:0149b18_10"
    },
    {
        "source_sentence": "若有細身，應有處所可得，如五藏、四體一一處中求，皆不可得。",
        "translation": "If there were a subtle body, there would be a place where it could be obtained, just like the five stores and four bodies that are sought in each of the four places, but they wouldn't be obtained.",
        "source": "T25n1509_012:0149b18_11"
    },
    {
        "source_sentence": "問曰：此細身微細，初死時已去，若活時則不可求得，汝云何能見？",
        "translation": "Q: This subtle body is so subtle that it's already gone when it first dies, and if it's alive, then it can't be obtained; how can you see it?",
        "source": "T25n1509_012:0149b20_12"
    },
    {
        "source_sentence": "又此細身，非五情能見能知，唯有神通聖人乃能得見。",
        "translation": "Furthermore, this subtle body cannot be seen or known by the five senses; it can only be seen by a sage endowed with supernormal powers.",
        "source": "T25n1509_012:0149b21_13"
    },
    {
        "source_sentence": "答曰：若爾者，與無無異。",
        "translation": "Answer: If that's the case, it's no different from nonexistence.",
        "source": "T25n1509_012:0149b23_14"
    },
    {
        "source_sentence": "如人死時，捨此生陰，入中陰中。",
        "translation": "It's like when a person dies, they abandon this aggregate of birth and enter the intermediate aggregate.",
        "source": "T25n1509_012:0149b23_15"
    },
    {
        "source_sentence": "是時，今世身滅，受中陰身，此無前後，滅時即生。",
        "translation": "At that time, the body of the present world ceases and receives the body of the intermediate existence. There is no prior or subsequent:",
        "source": "T25n1509_012:0149b24_16"
    },
    {
        "source_sentence": "譬如蠟印印泥，泥中受印，印即時壞，成壞一時，亦無前後。",
        "translation": "It's like when the wax seal is sealed in mud and the seal is received in mud, and the seal immediately breaks down, forming and disintegrating at the same time, with no prior or subsequent.",
        "source": "T25n1509_012:0149b25_17"
    },
    {
        "source_sentence": "是時，受中陰中有，捨此中陰，受生陰有。",
        "translation": "At that time, there's the intermediate aggregate of feeling in the intermediate aggregate, and by abandoning this intermediate aggregate, there's the aggregate of feeling at birth.",
        "source": "T25n1509_012:0149b26_18"
    },
    {
        "source_sentence": "汝言細身，即此中陰，中陰身無出無入。",
        "translation": "You say that the subtle body is this intermediate aggregate, and there's neither exiting nor entering in the intermediate aggregate body.",
        "source": "T25n1509_012:0149b27_19"
    },
    {
        "source_sentence": "譬如然燈，生滅相續，不常不斷。",
        "translation": "It's like a lamp that arises and ceases continuously, which isn't constant or unceasing.",
        "source": "T25n1509_012:0149b28_20"
    },
    {
        "source_sentence": "佛言：「一切色眾，若過去、未來、現在，若內、若外，若麁、若細，皆悉無常。」",
        "translation": "The Buddha said, All the multitudes of forms, whether past, future, or present, internal or external, crude or fine, are all impermanent.",
        "source": "T25n1509_012:0149b29_21"
    },
    {
        "source_sentence": "汝神微細色者，亦應無常斷滅。",
        "translation": "If your mind has subtle form, it should also be impermanent and ceaseless.",
        "source": "T25n1509_012:0149c02_22"
    },
    {
        "source_sentence": "如是等種種因緣，可知非色相。",
        "translation": "These various causes and conditions can be known as formless.",
        "source": "T25n1509_012:0149c02_23"
    },
    {
        "source_sentence": "神非無色相，無色者，四眾及無為。",
        "translation": "The soul is not with the characteristic marks of a formless one. A formless one: the fourfold collection and the unconditioned.",
        "source": "T25n1509_012:0149c03_24"
    },
    {
        "source_sentence": "四眾無常故，不自在故，屬因緣故，不應是神。",
        "translation": "Because the four collections are impermanent, because they are not self-willed, and because they belong to causes and conditions, they should not be divine.",
        "source": "T25n1509_012:0149c04_25"
    },
    {
        "source_sentence": "三無為中，不計有神，無所受故。",
        "translation": "Among the three unconditioned dharmas, it is not thought that there is a soul because there is no sensation.",
        "source": "T25n1509_012:0149c05_26"
    },
    {
        "source_sentence": "如是等種種因緣，知神非無色相。",
        "translation": "Such are the various causes and conditions for knowing that the soul isn't formless in form.",
        "source": "T25n1509_012:0149c06_27"
    },
    {
        "source_sentence": "如是天地間，若內若外，三世、十方，求我不可得。",
        "translation": "Thus, between heaven and earth, whether internal or external, in the three times and ten directions, seeking self is unobtainable.",
        "source": "T25n1509_012:0149c07_28"
    },
    {
        "source_sentence": "但十二入和合生六識，三事和合名觸，觸生受、想、思等心數法。",
        "translation": "However, the conjunction of twelve sense-fields makes six forms of consciousness arise. The conjunction of these three things is called ‘contact’; and such mental factors as feeling, conceptual identification, and volition make contact arise.",
        "source": "T25n1509_012:0149c08_29"
    },
    {
        "source_sentence": "是法中，無明力故身見生，身見生故謂有神。",
        "translation": "Among these factors, belief in a self arises because of the power of ignorance. Because belief in a self arises, it is said to be with supernormal knowledge.",
        "source": "T25n1509_012:0149c09_30"
    },
    {
        "source_sentence": "是身見，見苦諦，苦法智及苦比智則斷，斷時則不見有神。",
        "translation": "This belief in a self is the view that sees the truth of suffering. Knowledge of the law in relation to frustration and subsequent knowledge in relation to frustration are to be abandoned, but when they are abandoned, one does not see the existence of a soul.",
        "source": "T25n1509_012:0149c10_31"
    },
    {
        "source_sentence": "汝先言：「若內無神，色識念念生滅，云何分別知色青、黃、赤、白？」",
        "translation": "You first said, If there's no soul inside, and form and consciousness arise and cease in each other, how can you discern and know form as blue, yellow, red, or white?",
        "source": "T25n1509_012:0149c11_32"
    },
    {
        "source_sentence": "汝若有神，亦不能獨知，要依眼識故能知。",
        "translation": "If you have a soul, you won't be able to know it alone because you must rely on the eye consciousness to know it.",
        "source": "T25n1509_012:0149c13_33"
    },
    {
        "source_sentence": "若爾者，神無用也。",
        "translation": "If that's the case, then the soul has no function.",
        "source": "T25n1509_012:0149c14_34"
    },
    {
        "source_sentence": "眼識知色，色生滅，相似生，相似滅，然後心中有法生，名為念。",
        "translation": "The visual consciousness knows form, and form arises and ceases, similarly arises and ceases, and then there are dharmas that arise in the mind, which are called mindfulness.",
        "source": "T25n1509_012:0149c14_35"
    },
    {
        "source_sentence": "是念相有為法，雖滅過去，是念能知。",
        "translation": "Even though the characteristics of these thoughts are conditioned dharmas, even if they cease in the past, this thought can know them.",
        "source": "T25n1509_012:0149c16_36"
    },
    {
        "source_sentence": "如聖人智慧力，能知未來世事；",
        "translation": "“Good son, it is like the intelligence of a sage who knows future events.",
        "source": "T25n1509_012:0149c17_37"
    },
    {
        "source_sentence": "念念亦如是，能知過去法。",
        "translation": "Each thought is likewise, able to know past dharmas.",
        "source": "T25n1509_012:0149c17_38"
    },
    {
        "source_sentence": "若前眼識滅，生後眼識，後眼識轉利有力。",
        "translation": "If the former visual consciousness ceases, a subsequent visual consciousness arises, and the latter visual consciousness becomes sharp and powerful.",
        "source": "T25n1509_012:0149c18_39"
    },
    {
        "source_sentence": "色雖暫有不住，以念力利故能知。",
        "translation": "Even though form temporarily exists and doesn't abide, it can be known because of the power of mindfulness.",
        "source": "T25n1509_012:0149c19_40"
    },
    {
        "source_sentence": "以是事故，雖念念生滅無常，能分別知色。",
        "translation": "Because of these things, even though birth and cessation are impermanent in each thought, they can discern form.",
        "source": "T25n1509_012:0149c20_41"
    },
    {
        "source_sentence": "又汝言：「今現在人識新新生滅，身命斷時亦盡，諸行罪福，誰隨誰受？",
        "translation": "Again, you said, Nowadays, people's consciousnesses are newly arisen and cease, and when their bodies and lives are cut off, they also end, so who will receive the sins and merits of actions according to whom?",
        "source": "T25n1509_012:0149c21_42"
    },
    {
        "source_sentence": "誰受苦樂？",
        "translation": "Who experiences pain and pleasure?",
        "source": "T25n1509_012:0149c22_43"
    },
    {
        "source_sentence": "誰解脫者？」",
        "translation": "Who is liberated?",
        "source": "T25n1509_012:0149c22_44"
    },
    {
        "source_sentence": "今當答汝：今未得實道，是人諸煩惱覆心，作生因緣業，死時從此五陰相續生五陰。",
        "translation": "Now, I will answer you: Now, someone who hasn't really attained the path is covered by afflictions in their mind and creates causes and conditions for karma that give rise to birth, and five aggregates continue to arise from these five aggregates at the time of death.",
        "source": "T25n1509_012:0149c23_45"
    },
    {
        "source_sentence": "譬如一燈，更然一燈。",
        "translation": "It's like a single lamp and yet another one lamp.",
        "source": "T25n1509_012:0149c25_46"
    },
    {
        "source_sentence": "又如穀生，有三因緣：地、水、種子。",
        "translation": "Good man, it is also like grain that has three kinds of causes and conditions: earth, water, and seeds.",
        "source": "T25n1509_012:0149c25_47"
    },
    {
        "source_sentence": "後世身生，亦如是。",
        "translation": "The same applies to the body that arises later:",
        "source": "T25n1509_012:0149c26_48"
    },
    {
        "source_sentence": "有身，有有漏業，有結使，三事故後身生。",
        "translation": "With body, there is impure action; with fetters and contaminants: the three things make a subsequent body arise.",
        "source": "T25n1509_012:0149c26_49"
    },
    {
        "source_sentence": "是中身、業因緣，不可斷、不可破，但諸結使可斷。",
        "translation": "These are the causes and conditions of body and karma that can't be cut or broken, but the bonds and tendencies can be cut.",
        "source": "T25n1509_012:0149c27_50"
    },
    {
        "source_sentence": "結使斷時，雖有殘身、殘業，可得解脫。",
        "translation": "When the fetters are cut, even though there's residual body and residual karma, they can be liberated.",
        "source": "T25n1509_012:0149c28_51"
    },
    {
        "source_sentence": "如有穀子、有地，無水故不生。",
        "translation": "It's like grain and earth, which don't grow because there's no water.",
        "source": "T25n1509_012:0149c29_52"
    },
    {
        "source_sentence": "如是雖有身、有業，無愛結水潤則不生。",
        "translation": "Thus, even though there's body and karma, the absence of the bond of desire doesn't arise when moistened by water.",
        "source": "T25n1509_012:0150a01_53"
    },
    {
        "source_sentence": "是名雖無神，亦名得解脫。",
        "translation": "Although this is called having no soul, it's also called attaining liberation.",
        "source": "T25n1509_012:0150a02_54"
    },
    {
        "source_sentence": "無明故縛，智慧故解，則我無所用。",
        "translation": "Because they are bound because of ignorance and liberated because of wisdom, the self has no function.",
        "source": "T25n1509_012:0150a03_55"
    },
    {
        "source_sentence": "復次，是名色和合，假名為人。",
        "translation": "Furthermore, when name and form are combined, they're nominally called people.",
        "source": "T25n1509_012:0150a04_0"
    },
    {
        "source_sentence": "是人為諸結所繫，得無漏智慧爪，解此諸結，是時，名人得解脫。",
        "translation": "That person is bound by these bonds, attains the uncontaminated wisdom nails, and frees themselves from these bonds, and then that person will be liberated.",
        "source": "T25n1509_012:0150a04_1"
    },
    {
        "source_sentence": "如繩結、繩解，繩即是結，結無異法，世界中說結繩、解繩。",
        "translation": "Just as a rope is fettered and a rope discloses, a rope is fetter; fetters are no different from fetters: in the world, it is said to be fettered.",
        "source": "T25n1509_012:0150a06_2"
    },
    {
        "source_sentence": "名色亦如是，名色二法和合，假名為人。",
        "translation": "The same applies to name and form. When two factors name and form are combined, they are nominally called ‘human’.",
        "source": "T25n1509_012:0150a07_3"
    },
    {
        "source_sentence": "是結使與名色不異，但名為名色結、名色解。",
        "translation": "These fetters and tendencies are not different from name-and-form, but they're simply called name-and-form fetters and name-and-form understandings.",
        "source": "T25n1509_012:0150a08_4"
    },
    {
        "source_sentence": "受罪福亦如是，雖無一法為人實，名色故受罪福果，而人得名。",
        "translation": "Even though there is no single dharma that is real for the sake of human beings, it is because of their name and form that they experience the fruit of sin and merit, whereas human beings are called by that name.",
        "source": "T25n1509_012:0150a09_5"
    },
    {
        "source_sentence": "譬如車載物，一一推之，竟無車實，然車受載物之名。",
        "translation": "It's like a cart that carries things and pushes them one by one, but there's no real cart at all, yet the cart receives the names of the things it carries.",
        "source": "T25n1509_012:0150a11_0"
    },
    {
        "source_sentence": "人受罪福亦如是，名色受罪福，而人受其名。",
        "translation": "The same applies to the blameworthiness of humans. Name and form receive blameworthiness, whereas humans receive their name.",
        "source": "T25n1509_012:0150a12_1"
    },
    {
        "source_sentence": "受苦樂亦如是。",
        "translation": "It's likewise with feeling pain and pleasure.",
        "source": "T25n1509_012:0150a13_2"
    },
    {
        "source_sentence": "如是種種因緣，神不可得。",
        "translation": "Such various causes and conditions are unobtainable by the soul.",
        "source": "T25n1509_012:0150a13_3"
    },
    {
        "source_sentence": "神即是施者，受者亦如是。",
        "translation": "The same applies to the one who receives.",
        "source": "T25n1509_012:0150a14_4"
    },
    {
        "source_sentence": "汝以神為人，以是故，施人不可得，受人不可得亦如是。",
        "translation": "Because you take the soul as a human being, it's because giving to someone is unobtainable, and so is receiving something that's unobtainable to someone.",
        "source": "T25n1509_012:0150a14_5"
    },
    {
        "source_sentence": "如是種種因緣，是名財物、施人、受人不可得。",
        "translation": "Such various causes and conditions are called property that's unobtainable to the donor or recipient of the gift.",
        "source": "T25n1509_012:0150a16_6"
    },
    {
        "source_sentence": "問曰：若施於諸法，是如實相無所破、無所滅、無所生、無所作，何以故言「三事破析不可得」？",
        "translation": "Q: If someone gives to dharmas that are as they really are, there's nothing to break down, nothing to cease, nothing to produce, and nothing to do, why does it say, Three things are unobtainable by breaking up and analyzing?",
        "source": "T25n1509_012:0150a17_7"
    },
    {
        "source_sentence": "答曰：如凡夫人見施者、見受者、見財物，是為顛倒妄見，生世間受樂，福盡轉還。",
        "translation": "Answer: Suppose an ordinary person sees someone who gives, sees someone who receives, and sees property, this is a mistaken deluded view that produces happiness in the world and returns when their merits are exhausted.",
        "source": "T25n1509_012:0150a19_8"
    },
    {
        "source_sentence": "是故佛欲令菩薩行實道，得實果報，實果報則是佛道。",
        "translation": "That's why the Buddha wants to cause bodhisattvas to practice the true path and attain its true reward, and the true reward is the Buddha Way.",
        "source": "T25n1509_012:0150a21_9"
    },
    {
        "source_sentence": "佛為破妄見故，言三事不可得，實無所破。",
        "translation": "In order to refute false views, the Buddha says that three things are unobtainable, but there's really nothing to refute.",
        "source": "T25n1509_012:0150a22_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_012:0150a23_11"
    },
    {
        "source_sentence": "諸法從本已來畢竟空故。",
        "translation": "It's because all dharmas are ultimately empty since the distant past.",
        "source": "T25n1509_012:0150a23_12"
    },
    {
        "source_sentence": "如是等種種無量因緣，不可得故，名為檀波羅蜜具足滿。",
        "translation": "Because these kinds of measureless causes and conditions are unobtainable, they're called the fulfillment of the perfection of giving.",
        "source": "T25n1509_012:0150a24_13"
    },
    {
        "source_sentence": "復次，若菩薩行檀波羅蜜，能生六波羅蜜，是時，名為檀波羅蜜具足滿。",
        "translation": "Furthermore, if a bodhisattva practices the perfection of giving and produces the six perfections, then he's called fully endowed with the perfection of giving.",
        "source": "T25n1509_012:0150a25_14"
    },
    {
        "source_sentence": "云何布施生檀波羅蜜？",
        "translation": "What is the perfection of generosity that gives rise to giving?",
        "source": "T25n1509_012:0150a27_15"
    },
    {
        "source_sentence": "檀有下、中、上：從下生中，從中生上。",
        "translation": "The sandalwood is of two kinds: inferior, middle and superior. Depending on what is inferior, the middle arises; depending on what is medium, what is superior arises.",
        "source": "T25n1509_012:0150a28_0"
    },
    {
        "source_sentence": "若以飲食麁物，軟心布施，是名為下；",
        "translation": "If one gives food, drink, and belongings with a gentle mind as an offering, this is called benevolence.",
        "source": "T25n1509_012:0150a28_1"
    },
    {
        "source_sentence": "習施轉增，能以衣服寶物布施，是為從下生中；",
        "translation": "The giving condition increases gradually, being able to give clothes and jewels. This is the next stage.",
        "source": "T25n1509_012:0150a29_2"
    },
    {
        "source_sentence": "施心轉增，無所愛惜，能以頭、目、血、肉、國、財、妻、子盡用布施，是為從中生上。",
        "translation": "When the mind of giving increases, they don't cherish anything and can give with their head, eyes, blood, flesh, country, property, wife, or child in full.",
        "source": "T25n1509_012:0150b01_3"
    },
    {
        "source_sentence": "如釋迦牟尼佛初發心時，作大國王，名曰光明，求索佛道，少多布施。",
        "translation": "It's like when Śākyamuni Buddha first arouses his mind, he becomes a great king named Guṇaprabhāsa who seeks the Buddha Way and rarely gives alms.",
        "source": "T25n1509_012:0150b03_4"
    },
    {
        "source_sentence": "轉受後身作陶師，能以澡浴之具及石蜜漿，布施異釋迦牟尼佛及比丘僧。",
        "translation": "He then accepted the latter body as a potter and was able to give it to Śākyamuni Buddha and the monks with bathing implements and rock honey and juice, which were different from those given to Śākyamuni Buddha and the monks.",
        "source": "T25n1509_012:0150b05_5"
    },
    {
        "source_sentence": "其後轉身作大長者女，以燈供養憍陳若佛。",
        "translation": "After that, she transformed herself into a great elderly woman and offered a lamp to Kauṇḍinya Buddha.",
        "source": "T25n1509_012:0150b07_0"
    },
    {
        "source_sentence": "如是等種種，名為菩薩下布施。",
        "translation": "Such various things are called the bodhisattva's underlying generosity.",
        "source": "T25n1509_012:0150b08_1"
    },
    {
        "source_sentence": "如釋迦文尼佛本身作長者子，以衣布施大音聲佛；",
        "translation": "“Just as the Buddha Śākyamuni himself became the son of a wealthy householder and gave his robes to Great Sound Buddha.",
        "source": "T25n1509_012:0150b08_2"
    },
    {
        "source_sentence": "佛滅度後，起九十塔。",
        "translation": "After the nirvana of the Buddha, ninety stupas were built.",
        "source": "T25n1509_012:0150b10_3"
    },
    {
        "source_sentence": "後更轉身作大國王，以七寶蓋供養師子佛。",
        "translation": "Later, he transformed himself into a great king and offered a seven-jeweled canopy to the lion Buddha.",
        "source": "T25n1509_012:0150b10_4"
    },
    {
        "source_sentence": "後復受身作大長者，供養妙目佛上好房舍及七寶妙華。",
        "translation": "After that, he'll again receive the body as a great elder and make offerings to the wonderfully beautiful dwelling abode of Marvelous Eyes Buddha and the marvelous flowers of the seven treasures.",
        "source": "T25n1509_012:0150b11_5"
    },
    {
        "source_sentence": "如是等種種，名為菩薩中布施。",
        "translation": "Such kinds of things are called generosity among bodhisattvas.",
        "source": "T25n1509_012:0150b13_0"
    },
    {
        "source_sentence": "如釋迦牟尼佛本身作仙人，見憍陳若佛端政殊妙，便從高山上自投佛前，其身安隱，在一面立。",
        "translation": "Suppose Śākyamuni Buddha himself is a sage, and when he sees Kauṇḍinya Buddha's handsome appearance, he emerges from the high mountain and throws himself in front of him, his body peaceful and standing to one side.",
        "source": "T25n1509_012:0150b13_1"
    },
    {
        "source_sentence": "又如眾生喜見菩薩，以身為燈，供養日月光德佛。",
        "translation": "It's also like when sentient beings joyfully see the bodhisattva and offer his body as a lamp to the Buddha of Light of the Sun and Moon.",
        "source": "T25n1509_012:0150b16_0"
    },
    {
        "source_sentence": "如是等種種，不惜身命，供養諸佛，是為菩薩上布施。",
        "translation": "These are the kinds of offerings that a bodhisattva makes to the buddhas without sparing his life, and these are the higher forms of giving.",
        "source": "T25n1509_012:0150b17_1"
    },
    {
        "source_sentence": "是名菩薩三種布施。",
        "translation": "These are called the three kinds of bodhisattva generosity.",
        "source": "T25n1509_012:0150b18_2"
    },
    {
        "source_sentence": "若有初發佛心，布施眾生，亦復如是。",
        "translation": "If someone first arouses the buddha-mind and gives it to sentient beings, it's likewise.",
        "source": "T25n1509_012:0150b18_3"
    },
    {
        "source_sentence": "初以飲食布施，施心轉增，能以身肉與之。",
        "translation": "The first is to give food and drink as alms, and when the mind of giving increases, he's able to give it with his body and flesh.",
        "source": "T25n1509_012:0150b19_4"
    },
    {
        "source_sentence": "先以種種好漿布施，後心轉增，能以身血與之。",
        "translation": "First, he gives various kinds of good wine as a gift, and then his mind increases in strength and he's able to give it with body and blood.",
        "source": "T25n1509_012:0150b20_5"
    },
    {
        "source_sentence": "先以紙墨經書布施，及以衣服、飲食四種供養，供養法師；",
        "translation": "He had previously offered the Master four kinds of offerings, namely, paper and ink scriptures, books and booklets, as well as clothing and food.",
        "source": "T25n1509_012:0150b21_6"
    },
    {
        "source_sentence": "後得法身，為無量眾生說種種法，而為法施。",
        "translation": "He then attains the Dharma body, explains various dharmas for measureless sentient beings, and gives them as a Dharma gift.",
        "source": "T25n1509_012:0150b23_7"
    },
    {
        "source_sentence": "如是等種種，從檀波羅蜜中生檀波羅蜜。",
        "translation": "These various kinds of such things arise from the perfection of giving in the perfection of giving.",
        "source": "T25n1509_012:0150b24_8"
    },
    {
        "source_sentence": "云何菩薩布施生尸羅波羅蜜？",
        "translation": "What is the bodhisattva's generosity that gives rise to the śīla-pāramitā?",
        "source": "T25n1509_012:0150b25_9"
    },
    {
        "source_sentence": "菩薩思惟：「眾生不布施故，後世貧窮；",
        "translation": "The enlightening beings think: Because sentient beings do not give, the world to come will be poor.",
        "source": "T25n1509_012:0150b26_10"
    },
    {
        "source_sentence": "以貧窮故，劫盜心生；",
        "translation": "Because they are poor, thoughts of robbery and stealing arise in them.",
        "source": "T25n1509_012:0150b27_0"
    },
    {
        "source_sentence": "以劫盜故而有殺害；",
        "translation": "Because of robbery and theft, there is killing.",
        "source": "T25n1509_012:0150b27_1"
    },
    {
        "source_sentence": "以貧窮故，不足於色；",
        "translation": "Because they are poor, they do not have enough material form.",
        "source": "T25n1509_012:0150b28_0"
    },
    {
        "source_sentence": "色不足故而行邪婬。",
        "translation": "Because form is insufficient, they engage in sexual misconduct.",
        "source": "T25n1509_012:0150b28_1"
    },
    {
        "source_sentence": "又以貧窮故，為人下賤；",
        "translation": "Also, because they are poor and impoverished, they are the lowest of the people.",
        "source": "T25n1509_012:0150b29_0"
    },
    {
        "source_sentence": "下賤畏怖而生妄語——如是等貧窮因緣故，行十不善道。",
        "translation": "Because of these causes and conditions of poverty, they'll go on the ten unwholesome paths.",
        "source": "T25n1509_012:0150b29_1"
    },
    {
        "source_sentence": "若行布施，生有財物，有財物故，不為非法。",
        "translation": "If someone practices generosity and produces property, it won't be unlawful because they have property.",
        "source": "T25n1509_012:0150c01_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_012:0150c03_0"
    },
    {
        "source_sentence": "五塵充足，無所乏短故。」",
        "translation": "The five dust motes are abundant, so there's nothing short of them.",
        "source": "T25n1509_012:0150c03_1"
    },
    {
        "source_sentence": "如提婆達本生曾為一蛇，與一蝦蟇、一龜，在一池中，共結親友。",
        "translation": "It's like when Devadatta was once a snake in his native land, he gave it to a frog or tortoise and placed it in a pond to form a group of friends.",
        "source": "T25n1509_012:0150c03_2"
    },
    {
        "source_sentence": "其後池水竭盡，飢窮困乏，無所控告。",
        "translation": "Later, the water in the pond ran out and they became hungry and exhausted. There was nothing to tell them.",
        "source": "T25n1509_012:0150c05_3"
    },
    {
        "source_sentence": "　「若遭貧窮失本心，　　不惟本義食為先；",
        "translation": "“If someone is poor and loses their original mind, They don’t think of food for the sake of their original meaning as first.",
        "source": "T25n1509_012:0150c06_4"
    },
    {
        "source_sentence": "　　汝持我聲以語蛇，　　蝦蟇終不到汝邊！」",
        "translation": "Take my voice and speak to the snake, and the frog won't reach you!",
        "source": "T25n1509_012:0150c06_4"
    },
    {
        "source_sentence": "時蛇遣龜以呼蝦蟇，蝦蟇說偈以遣龜言：若修布施，後生有福，無所短乏，則能持戒，無此眾惡，是為布施能生尸羅波羅蜜。",
        "translation": "The snake then sent the turtle to call out to the frog, and the frog spoke a verse to send the turtle, saying, If you cultivate generosity, there will be merit in later births that are not deficient, so you'll be able to observe precepts and have no such bad qualities.",
        "source": "T25n1509_012:0150c06_4"
    },
    {
        "source_sentence": "復次，布施時，能令破戒諸結使薄，益持戒心，令得堅固；",
        "translation": "“Furthermore, when they practice giving, they are able to cause the breaking of the fetters of precepts to be weakened. Increasing their awareness of keeping the precepts makes them firmer and stronger.",
        "source": "T25n1509_012:0150c11_5"
    },
    {
        "source_sentence": "是為布施因緣增益於戒。",
        "translation": "These are the causes and conditions for generosity that increase the precepts.",
        "source": "T25n1509_012:0150c13_6"
    },
    {
        "source_sentence": "復次，菩薩布施，常於受者生慈悲心，不著於財，自物不惜，何況劫盜？",
        "translation": "Furthermore, when a bodhisattva gives alms, he always has compassion for those who receive it, doesn't cling to property, and doesn't cherish his own possessions, much less steal them.",
        "source": "T25n1509_012:0150c13_7"
    },
    {
        "source_sentence": "慈悲受者，何有殺意？",
        "translation": "What's the intention to kill someone who receive it with kindness and pity?",
        "source": "T25n1509_012:0150c15_8"
    },
    {
        "source_sentence": "如是等能遮破戒，是為施生戒。",
        "translation": "Such things can obscure the precept against breaking it, which is the precept that gives rise to giving.",
        "source": "T25n1509_012:0150c15_9"
    },
    {
        "source_sentence": "若能布施以破慳心，然後持戒、忍辱等，易可得行。",
        "translation": "If someone can give alms to break the mind of stinginess and then observe precepts, forbearance, and so forth, it's easy to do so.",
        "source": "T25n1509_012:0150c16_10"
    },
    {
        "source_sentence": "如文殊師利，在昔過去久遠劫時曾為比丘，入城乞食，得滿鉢百味歡喜丸。",
        "translation": "Suppose Mañjuśrī had once been a monk for a long eon in the past, entered the city to solicit alms, filled his bowl with a hundred flavors of joyful pills.",
        "source": "T25n1509_012:0150c17_11"
    },
    {
        "source_sentence": "城中一小兒，追而從乞。",
        "translation": "A small child in the city chased after him and begged for alms.",
        "source": "T25n1509_012:0150c19_12"
    },
    {
        "source_sentence": "不即與之，乃至佛圖，手捉二丸而要之言：「汝若能自食一丸，以一丸施僧者，當以施汝！」",
        "translation": "He didn't immediately give it to them, even up to the Buddha's image, grasped two pills in his hand and asked them, If you can eat a pill for yourself and give one pill to the saṃgha, you should give it to him!",
        "source": "T25n1509_012:0150c20_13"
    },
    {
        "source_sentence": "即相然可，以一歡喜丸布施眾僧，然後於文殊師利許受戒，發心作佛。",
        "translation": "He then gave a joyful ball of it to the saṃgha, and after giving it to Mañjuśrī to accept the precepts, he arouses the intention to become a buddha.",
        "source": "T25n1509_012:0150c22_14"
    },
    {
        "source_sentence": "如是布施，能令受戒發心作佛，是為布施生尸羅波羅蜜。",
        "translation": "Such generosity can cause someone to receive the precepts and give rise to the intention to become a buddha, which is the perfection of giving that produces śīla-pāramitā.",
        "source": "T25n1509_012:0150c24_0"
    },
    {
        "source_sentence": "復次，布施之報，得四事供養，好國善師，無所乏少，故能持戒。",
        "translation": "Furthermore, as a result of their generosity, they'll attain the four kinds of offerings, and they'll be able to maintain precepts because they're fond of good countries and good teachers with no lack.",
        "source": "T25n1509_012:0150c25_1"
    },
    {
        "source_sentence": "又布施之報，其心調柔；",
        "translation": "Their minds were tempered by the retribution of their charity.",
        "source": "T25n1509_012:0150c26_2"
    },
    {
        "source_sentence": "心調柔故，能生持戒；",
        "translation": "Because their minds are tempered, they can produce observance of precepts.",
        "source": "T25n1509_012:0150c27_3"
    },
    {
        "source_sentence": "能生持戒故，從不善法中能自制心。",
        "translation": "Because they can give rise to observance of precepts, they're able to control their own minds from unwholesome things.",
        "source": "T25n1509_012:0150c27_4"
    },
    {
        "source_sentence": "如是種種因緣，從布施生尸羅波羅蜜。",
        "translation": "Thus, these various causes and conditions give rise to the śīla-pāramitā from generosity.",
        "source": "T25n1509_012:0150c28_5"
    },
    {
        "source_sentence": "云何布施生羼提波羅蜜？",
        "translation": "How does generosity give rise to the perfection of enlightenment?",
        "source": "T25n1509_012:0150c29_6"
    },
    {
        "source_sentence": "菩薩布施時，受者逆罵，若大求索，若不時索，或不應索而索。",
        "translation": "When a bodhisattva gives alms, the recipient is harshly abused and asked to ask for something if he asks greatly or doesn't ask it at the right time, or asks without asking.",
        "source": "T25n1509_012:0151a01_7"
    },
    {
        "source_sentence": "是時，菩薩自思惟言：「我今布施，欲求佛道，亦無有人使我布施。",
        "translation": "The bodhisattva then thought to himself, Now that I'm giving and wanting to pursue the Buddha Way, there's no one who will cause me to give it.",
        "source": "T25n1509_012:0151a02_8"
    },
    {
        "source_sentence": "我自為故，云何生瞋？」",
        "translation": "How can anger arise because of self-causation?",
        "source": "T25n1509_012:0151a04_0"
    },
    {
        "source_sentence": "如是思惟已，而行忍辱，是名布施生羼提波羅蜜。",
        "translation": "After reflecting like this, they practice forbearance and forbearance, which is called the perfection of generosity that produces kṣatriya.",
        "source": "T25n1509_012:0151a04_1"
    },
    {
        "source_sentence": "復次，菩薩布施時，若受者瞋惱，便自思惟：「我今布施內外財物，難捨能捨，何況空聲而不能忍？",
        "translation": "Furthermore, when a bodhisattva gives alms, if the recipient is angry and distressed, he then thinks to himself, Now that I'm giving alms for internal and external possessions, it's difficult to abandon or give them away, so why wouldn't I be able to tolerate an empty sound?",
        "source": "T25n1509_012:0151a05_2"
    },
    {
        "source_sentence": "若我不忍，所可布施則為不淨。",
        "translation": "If I don't tolerate it, what I can give will be impure.",
        "source": "T25n1509_012:0151a07_3"
    },
    {
        "source_sentence": "譬如白象，入池澡浴，出已還復以土坌身；",
        "translation": "It is as if a white elephant enters a pond to bathe, and after emerging it returns again and again with its body covered with dirt.",
        "source": "T25n1509_012:0151a08_4"
    },
    {
        "source_sentence": "布施不忍，亦復如是。」",
        "translation": "So it is with generosity that they can't tolerate it.",
        "source": "T25n1509_012:0151a09_5"
    },
    {
        "source_sentence": "如是思惟已，行於忍辱。",
        "translation": "After thus reflecting on it, he practices patience.",
        "source": "T25n1509_012:0151a10_6"
    },
    {
        "source_sentence": "如是等種種布施因緣，生羼提波羅蜜。",
        "translation": "Such are the causes and conditions for various kinds of generosity that give rise to the perfection of pithy.",
        "source": "T25n1509_012:0151a10_7"
    },
    {
        "source_sentence": "云何布施生毘梨耶波羅蜜？",
        "translation": "How does generosity give rise to the pāramitā of vīrya?",
        "source": "T25n1509_012:0151a11_8"
    },
    {
        "source_sentence": "菩薩布施時，常行精進。",
        "translation": "When a bodhisattva gives alms, he always conducts himself with energy.",
        "source": "T25n1509_012:0151a12_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_012:0151a12_10"
    },
    {
        "source_sentence": "菩薩初發心時，功德未大，爾時，欲行二施，充滿一切眾生之願。",
        "translation": "When the bodhisattva first arouses his mind, his virtue isn't great, and when he wants to perform two kinds of giving, he fills the wishes of all sentient beings.",
        "source": "T25n1509_012:0151a12_11"
    },
    {
        "source_sentence": "以物不足故，懃求財、法，以給足之。",
        "translation": "Because their possessions are insufficient, they earnestly seek property and the Dharma to provide for them.",
        "source": "T25n1509_012:0151a14_12"
    },
    {
        "source_sentence": "如釋迦文尼佛本身，作大醫王，療一切病，不求名利，為憐愍眾生故。",
        "translation": "Suppose Śākyamuni Buddha himself becomes a great king of doctors who treats all illnesses and doesn't seek fame or profit, out of pity for sentient beings.",
        "source": "T25n1509_012:0151a15_13"
    },
    {
        "source_sentence": "病者甚多，力不周救，憂念一切而不從心，懊惱而死，即生忉利天上。",
        "translation": "The sick people were so numerous that they could not be rescued by any means. They grieved for all but did not comply with their wishes and died in distress, being reborn in Trāyastriṃśa Heaven.",
        "source": "T25n1509_012:0151a16_14"
    },
    {
        "source_sentence": "自思惟言：「我今生天，但食福報，無所長益。」",
        "translation": "He thought to himself, Now that I'm born in heaven, I'll simply eat the rewards of good fortune and there won't be any long-term benefit.",
        "source": "T25n1509_012:0151a18_15"
    },
    {
        "source_sentence": "即自方便，自取滅身，捨此天壽。",
        "translation": "That is, with their own skillful means, they take the body of cessation themselves and abandon this heavenly life span.",
        "source": "T25n1509_012:0151a19_16"
    },
    {
        "source_sentence": "生婆迦陀龍王宮中為龍太子。",
        "translation": "He was born in the palace of the dragon king Bhagavān and became the prince of the dragon.",
        "source": "T25n1509_012:0151a20_17"
    },
    {
        "source_sentence": "其身長大，父母愛重，欲自取死，就金翅鳥王，鳥即取此龍子於舍摩利樹上吞之。",
        "translation": "His body grew larger and his parents loved him so much that they wanted to kill him. So they went to the king of birds with golden wings, and the bird caught the dragon offspring and swallowed them on top of a śāmarī tree.",
        "source": "T25n1509_012:0151a21_0"
    },
    {
        "source_sentence": "父母嘷咷，啼哭懊惱。",
        "translation": "His parents were distressed and cried in distress.",
        "source": "T25n1509_012:0151a22_1"
    },
    {
        "source_sentence": "龍子既死，生閻浮提中為大國王太子，名曰能施。",
        "translation": "After the dragon prince died, he was born in Jambudvīpa and became the prince of a great king named A Forest of Pearls from the Dharma Garden, Volume II The giver.",
        "source": "T25n1509_012:0151a23_2"
    },
    {
        "source_sentence": "生而能言，問諸左右：今此國中有何等物，盡皆持來以用布施！",
        "translation": "Being able to say so, he asked his aides, What things are there in this country now that they'll carry and use as alms?",
        "source": "T25n1509_012:0151a24_3"
    },
    {
        "source_sentence": "眾人怪畏，皆捨之走。",
        "translation": "The people were all frightened and abandoned him.",
        "source": "T25n1509_012:0151a26_4"
    },
    {
        "source_sentence": "其母憐愛，獨自守之。",
        "translation": "The mother, out of pity and affection for the prince, kept him alone.",
        "source": "T25n1509_012:0151a26_5"
    },
    {
        "source_sentence": "語其母言：「我非羅剎，眾人何以故走？",
        "translation": "He said to his mother, I'm not the rāṣā; why are you people running away?",
        "source": "T25n1509_012:0151a27_6"
    },
    {
        "source_sentence": "我本宿命常好布施，我為一切人之檀越。」",
        "translation": "In my past lives, I always gave generously, and I'm the donor of all people.",
        "source": "T25n1509_012:0151a27_7"
    },
    {
        "source_sentence": "母聞其言，以語眾人，眾人即還。",
        "translation": "When the mother heard these words, she told them to the people and they all returned.",
        "source": "T25n1509_012:0151a28_8"
    },
    {
        "source_sentence": "母好養育，及年長大，自身所有，盡以施盡；",
        "translation": "Their mothers were fond of raising their children, and when they grew up to adulthood they gave away all that they had.",
        "source": "T25n1509_012:0151a29_9"
    },
    {
        "source_sentence": "至父王所，索物布施，父與其分，復以施盡。",
        "translation": "He went to his father, the king, asked for property and gave it as a gift, and when his father gave him a share of it, he again gave it up.",
        "source": "T25n1509_012:0151b01_10"
    },
    {
        "source_sentence": "見閻浮提人貧窮辛苦，思欲給施而財物不足，便自啼泣，問諸人言：「作何方便，當令一切滿足於財？」",
        "translation": "Seeing the people of Jambudvīpa who were poor and suffering, they wanted to give alms but didn't have enough possessions, so they wept and asked the people, What method will you use to make them all fulfill their possessions?",
        "source": "T25n1509_012:0151b02_11"
    },
    {
        "source_sentence": "諸宿人言：「我等曾聞有如意寶珠，若得此珠，則能隨心所索，無不必得。」",
        "translation": "The people of the constellations said, We've heard that there's a wish-granting jewel, and if we obtain this jewel, we can ask for it according to our hearts without having to obtain it.",
        "source": "T25n1509_012:0151b05_12"
    },
    {
        "source_sentence": "菩薩聞是語已，白其父母：「欲入大海求龍王頭上如意寶珠。」",
        "translation": "After hearing these words, the bodhisattva said to his parents, I want to enter the ocean and seek the wish-granting jewel on the dragon king's head.",
        "source": "T25n1509_012:0151b06_13"
    },
    {
        "source_sentence": "父母報言：「我唯有汝一兒耳，若入大海，眾難難度。",
        "translation": "The parents replied, “I have only one child of yours. If you enter the great sea it will be difficult for us to cross.",
        "source": "T25n1509_012:0151b08_14"
    },
    {
        "source_sentence": "一旦失汝，我等亦當何用活為？",
        "translation": "If we were to lose you once, what would we need to live for?",
        "source": "T25n1509_012:0151b09_15"
    },
    {
        "source_sentence": "不須去也！",
        "translation": "It doesn't need to go!",
        "source": "T25n1509_012:0151b10_16"
    },
    {
        "source_sentence": "我今藏中猶亦有物，當以給汝！」",
        "translation": "Now, there's still something in my store that I will give you!",
        "source": "T25n1509_012:0151b10_17"
    },
    {
        "source_sentence": "兒言：「藏中有限，我意無量。",
        "translation": "The boy said, There's a limit to the store, and my mind is immeasurable.",
        "source": "T25n1509_012:0151b11_18"
    },
    {
        "source_sentence": "我欲以財充滿一切，令無乏短，願見聽許，得遂本心，使閻浮提人一切充足！」",
        "translation": "I want to fill them all with wealth so that they don't lack it, and I wish to see and hear their permission to fulfill my original mind so that the people of Jambudvīpa will be fully supplied!",
        "source": "T25n1509_012:0151b11_19"
    },
    {
        "source_sentence": "父母知其志大，不敢制之，遂放令去。",
        "translation": "Knowing that his ambition was great, the parents did not dare to restrain him. So they released him and sent him away.",
        "source": "T25n1509_012:0151b13_20"
    },
    {
        "source_sentence": "是時，五百賈客，以其福德大人，皆樂隨從；",
        "translation": "At that time five hundred merchants and travelers, all greatly endowed with blessedness and virtue, were happy to accompany the Master.",
        "source": "T25n1509_012:0151b14_21"
    },
    {
        "source_sentence": "知其行日，集海道口。",
        "translation": "Knowing the date of his journey, they assembled at the mouth of the seaport.",
        "source": "T25n1509_012:0151b15_22"
    },
    {
        "source_sentence": "菩薩先聞婆伽陀龍王頭上有如意寶珠，問眾人言：「誰知水道，至彼龍宮？」",
        "translation": "The bodhisattva first heard that a wish-granting jewel was on the top of the dragon king Bhagavān's head, and he asked the crowd, Who knows the water path to reach that dragon's palace?",
        "source": "T25n1509_012:0151b16_0"
    },
    {
        "source_sentence": "有一盲人名陀舍，曾以七反入大海中，具知海道。",
        "translation": "There was a blind man named Dāsā who once entered the ocean seven times and knew the path of the sea.",
        "source": "T25n1509_012:0151b17_1"
    },
    {
        "source_sentence": "菩薩即命共行。",
        "translation": "The bodhisattva then ordered them to perform it together.",
        "source": "T25n1509_012:0151b18_2"
    },
    {
        "source_sentence": "答曰：「我年既老，兩目失明，曾雖數入，今不能去！」",
        "translation": "He replied, I'm old and lost my eyesight in both eyes, and though I've entered it several times, I can't leave now!",
        "source": "T25n1509_012:0151b19_3"
    },
    {
        "source_sentence": "菩薩語言：「我今此行，不自為身，普為一切求如意寶珠，欲給足眾生令身無乏，次以道法因緣而教化之。",
        "translation": "The bodhisattva said, Now that I'm doing this, I don't do it for my own sake, seeking the wish-granting jewel for all people and wanting to provide for sentient beings so they won't lack it, and then I'll teach them with the causes and conditions of the path.",
        "source": "T25n1509_012:0151b20_4"
    },
    {
        "source_sentence": "汝是智人，何得辭耶？",
        "translation": "You're a wise person, so how can you say anything?",
        "source": "T25n1509_012:0151b23_5"
    },
    {
        "source_sentence": "我願得成，豈非汝力！」",
        "translation": "Isn't it your power that I want to achieve it!",
        "source": "T25n1509_012:0151b23_6"
    },
    {
        "source_sentence": "陀舍聞其要言，欣然同懷，語菩薩言：「我今共汝俱入大海，我必不全，汝當安我尸骸，著大海之中金沙洲上。」",
        "translation": "When he heard his essentials, Dāsāśa rejoiced and said to the bodhisattva, Now, I'll enter the ocean with you, but I won't be able to do so; you must place my body on a gold sand island in the ocean.",
        "source": "T25n1509_012:0151b24_7"
    },
    {
        "source_sentence": "行事都集，斷第七繩，船去如馳，到眾寶渚。",
        "translation": "The seventh rope was cut, and the boat departed as if on a chase to reach the island of myriad treasures.",
        "source": "T25n1509_012:0151b26_8"
    },
    {
        "source_sentence": "眾賈競取七寶，各各已足。",
        "translation": "The merchants competed to obtain the seven treasures, each of which was sufficient.",
        "source": "T25n1509_012:0151b27_9"
    },
    {
        "source_sentence": "語菩薩言：「何以不取？」",
        "translation": "He said to the bodhisattva, Why don't you take it?",
        "source": "T25n1509_012:0151b28_10"
    },
    {
        "source_sentence": "菩薩報言：「我所求者，如意寶珠，此有盡物，我不須也。",
        "translation": "The bodhisattva replied, What I want is the wish-granting jewel, which has all these things; I don't need them.",
        "source": "T25n1509_012:0151b28_11"
    },
    {
        "source_sentence": "汝等各當知足知量，無令船重，不自免也！」",
        "translation": "Each of you should know your own contentment and measurements, so that you won't let the boat weigh or escape on your own!",
        "source": "T25n1509_012:0151c01_12"
    },
    {
        "source_sentence": "是時，眾賈白菩薩言：「大德！",
        "translation": "The merchants then said to the bodhisattva, Mañjuśrī!",
        "source": "T25n1509_012:0151c02_13"
    },
    {
        "source_sentence": "為我呪願，令得安隱！」",
        "translation": "For my sake, I pray that you'll attain peace!",
        "source": "T25n1509_012:0151c02_14"
    },
    {
        "source_sentence": "於是辭去。",
        "translation": "He then departed.",
        "source": "T25n1509_012:0151c03_15"
    },
    {
        "source_sentence": "陀舍是時語菩薩言：「別留艇舟，當隨是別道而去。",
        "translation": "Dāsāya then said to the bodhisattva, Separate your boat and boat, and follow this different path to depart.",
        "source": "T25n1509_012:0151c03_16"
    },
    {
        "source_sentence": "待風七日，博海南岸，至一險處，當有絕崖，棗林枝皆覆水。",
        "translation": "In seven days’ time the wind will blow and you will reach the shore of the island of Hainan. When you reach a dangerous place, there will be a steep cliff with branches of jujube trees covering the water.",
        "source": "T25n1509_012:0151c04_17"
    },
    {
        "source_sentence": "大風吹船，船當摧覆！",
        "translation": "A great wind blows the boat, and the boat will be destroyed!",
        "source": "T25n1509_012:0151c06_18"
    },
    {
        "source_sentence": "汝當仰板棗枝，可以自濟。",
        "translation": "You should rise up to the top of your chest and stand on a jujube tree, so you can help yourself.",
        "source": "T25n1509_012:0151c06_19"
    },
    {
        "source_sentence": "我身無目，於此當死。",
        "translation": "My body has no eyes, and I'll die here.",
        "source": "T25n1509_012:0151c07_20"
    },
    {
        "source_sentence": "過此隘岸，當有金沙洲，可以我身置此沙中；",
        "translation": "If you pass beyond this narrow shore, there will be a continent of gold sand.",
        "source": "T25n1509_012:0151c08_0"
    },
    {
        "source_sentence": "金沙清淨，是我願也！」",
        "translation": "The purity of the gold sand is my wish!",
        "source": "T25n1509_012:0151c09_1"
    },
    {
        "source_sentence": "即如其言，風至而去。",
        "translation": "Then, just as he had said, the wind arrived and departed.",
        "source": "T25n1509_012:0151c09_2"
    },
    {
        "source_sentence": "既到絕崖，如陀舍語。",
        "translation": "When he arrived at the top of the cliff, it was as described by Dāsāśya.",
        "source": "T25n1509_012:0151c10_3"
    },
    {
        "source_sentence": "菩薩仰板棗枝，得以自免。",
        "translation": "The bodhisattva raised the jujube stick on his back and was able to escape by himself.",
        "source": "T25n1509_012:0151c10_4"
    },
    {
        "source_sentence": "置陀舍屍，安厝金地，於是獨去。",
        "translation": "He placed Dāsāśa’s corpse in a golden vault and departed alone.",
        "source": "T25n1509_012:0151c11_5"
    },
    {
        "source_sentence": "如其先教，深水中浮七日，至垒咽水中行七日，垒腰水中行七日，垒膝水中行七日，泥中行七日。",
        "translation": "As he had previously instructed, he floated in deep water for seven days and traveled in the water of his nasal passage for seven days, passed through the water of his waistcoat for seven days, passed through the water of his knees for seven days, and passed through the mud for seven days.",
        "source": "T25n1509_012:0151c12_6"
    },
    {
        "source_sentence": "見好蓮華，鮮潔柔軟，自思惟言：「此華軟脆，當入虛空三昧，自輕其身。」",
        "translation": "Seeing a beautiful lotus flower that's pure and gentle, he thought to himself, This flower is so soft and fragile that it will enter the samādhi of space and despise itself.",
        "source": "T25n1509_012:0151c14_7"
    },
    {
        "source_sentence": "行蓮華上七日，見諸毒蛇，念言：「含毒之虫，甚可畏也！」",
        "translation": "When he was walking on the lotus flower for seven days, he saw poisonous snakes and thought, Containing poisonous insects, they're terrifying!",
        "source": "T25n1509_012:0151c15_8"
    },
    {
        "source_sentence": "即入慈心三昧，行毒蛇頭上七日，蛇皆擎頭授與菩薩，令蹈上而過。",
        "translation": "He then entered the samādhi of compassion and walked on the poisonous snake's head for seven days, and the snakes all held their heads up and gave them to the bodhisattva, causing him to step on them and pass by.",
        "source": "T25n1509_012:0151c17_9"
    },
    {
        "source_sentence": "過此難已，見有七重寶城，有七重塹，塹中皆滿毒蛇，有三大龍守門。",
        "translation": "After crossing this difficulty, he saw that there were seven-fold jeweled castles with seven moats filled with poisonous snakes and three great dragons guarding the gates.",
        "source": "T25n1509_012:0151c18_10"
    },
    {
        "source_sentence": "龍見菩薩形容端政，相好嚴儀，能度眾難，得來至此，念言：「此非凡夫，必是菩薩大功德人！」",
        "translation": "When the dragon saw that the bodhisattva was so handsome and well-looking, adorned with beautiful features and dignified manners, able to overcome difficulties, he came here and thought, This extraordinary man must be a great person of great merit for the bodhisattva!",
        "source": "T25n1509_012:0151c20_11"
    },
    {
        "source_sentence": "即聽令前，逕得入宮。",
        "translation": "He then listened to the order and allowed him to enter the palace in front of him.",
        "source": "T25n1509_012:0151c22_12"
    },
    {
        "source_sentence": "龍王夫婦喪兒未久，猶故哀泣；",
        "translation": "The dragon king’s wife and children had not been bereaved for a long time but they were still crying in sorrow.",
        "source": "T25n1509_012:0151c23_13"
    },
    {
        "source_sentence": "見菩薩來，龍王婦有神通，知是其子，兩乳汁流出。",
        "translation": "Seeing the bodhisattva coming, the dragon king's wife had supernormal powers to know that he was his son, and two milkshakes flowed out.",
        "source": "T25n1509_012:0151c23_14"
    },
    {
        "source_sentence": "命之令坐，而問之言：「汝是我子，捨我命終，生在何處？」",
        "translation": "He ordered him to sit and asked, You're my son, where will you be born if you abandon me at the end of my life?",
        "source": "T25n1509_012:0151c25_15"
    },
    {
        "source_sentence": "菩薩亦自識宿命，知是父母，而答母言：「我生閻浮提上，為大國王太子。",
        "translation": "Knowing that they were their parents, the bodhisattva also replied to his mother, saying, I was born in Jambudvīpa as a prince of great kings.",
        "source": "T25n1509_012:0151c26_16"
    },
    {
        "source_sentence": "憐愍貧人，飢寒勤苦，不得自在，故來至此，欲求如意寶珠！」",
        "translation": "Out of pity for the poor and hungry, hungry, cold, and suffering, who can't be independent, they come here to seek the wish-granting jewel!",
        "source": "T25n1509_012:0151c28_17"
    },
    {
        "source_sentence": "母言：「汝父頭上有此寶珠，以為首飾，難可得也！",
        "translation": "The mother said, On your father's head there's this precious pearl, which is decorated as a head ornament, and it's difficult to obtain!",
        "source": "T25n1509_012:0151c29_18"
    },
    {
        "source_sentence": "必當將汝入諸寶藏，隨汝所欲，必欲與汝。",
        "translation": "I will surely bring you into the treasury of treasures, and whatever you wish, I will surely give it to you.",
        "source": "T25n1509_012:0152a01_19"
    },
    {
        "source_sentence": "汝當報言：『其餘雜寶，我不須也，唯欲大王頭上寶珠；",
        "translation": "You should reply, “I do not need any of the other treasures. All I want is a jeweled pearl on the king’s head.",
        "source": "T25n1509_012:0152a02_20"
    },
    {
        "source_sentence": "若見憐愍，願以與我。』",
        "translation": "If you see pity, please give it to me.'",
        "source": "T25n1509_012:0152a03_21"
    },
    {
        "source_sentence": "如此可得。」",
        "translation": "It's thus obtainable.",
        "source": "T25n1509_012:0152a04_22"
    },
    {
        "source_sentence": "即往見父。",
        "translation": "He went to see his father.",
        "source": "T25n1509_012:0152a04_23"
    },
    {
        "source_sentence": "父大悲喜，歡慶無量；",
        "translation": "The father’s great compassion and joy were immeasurable, and his joy was immeasurable.",
        "source": "T25n1509_012:0152a04_24"
    },
    {
        "source_sentence": "愍念其子，遠涉艱難，乃來至此，指示妙寶，隨意與汝，須者取之。",
        "translation": "Being pitying for his son, who had traveled a long distance and was in distress, he came to this place and instructed him to give you the wonderful treasure as you wished.",
        "source": "T25n1509_012:0152a05_25"
    },
    {
        "source_sentence": "菩薩言：「我從遠來，願見大王，求王頭上如意寶珠；",
        "translation": "The enlightening beings said, “Coming from a distant land, I wish to see the great king and ask for the wish-granting jewel on his head.",
        "source": "T25n1509_012:0152a06_26"
    },
    {
        "source_sentence": "若見憐愍，當以與我，若不見與，不須餘物！」",
        "translation": "If you see pity, you'll give it to me; if you don't give it, there won't be anything else!",
        "source": "T25n1509_012:0152a08_27"
    },
    {
        "source_sentence": "龍王報言：「我唯有此一珠，常為首飾，閻浮提人薄福下賤，不應見也！」",
        "translation": "The dragon king replied, I have only this one pearl, which is always the first to be adorned, and the people of Jambudvīpa are weak in merit and inferior, so they shouldn't see it!",
        "source": "T25n1509_012:0152a09_28"
    },
    {
        "source_sentence": "菩薩白言：「我以此故，遠涉艱難，冒死遠來，為閻浮提人薄福貧賤，欲以如意寶珠濟其所願，然後以佛道因緣而教化之！」",
        "translation": "The bodhisattva said, Because of this, I've traveled far into difficulties and dangers, risking my life to come from afar for the sake of the people of Jambudvīpa who lack merit and are poor, wanting to use the wish-granting jewel to help them save their wishes, and then they'll be taught by the causes and conditions of the Buddha Way!",
        "source": "T25n1509_012:0152a10_29"
    },
    {
        "source_sentence": "龍王與珠而要之言：「今以此珠與汝，汝既去世，當以還我！」",
        "translation": "The dragon king gave the pearl and offered it to him, saying, Now give it to you with this pearl; after you die, return it to me!",
        "source": "T25n1509_012:0152a13_30"
    },
    {
        "source_sentence": "答曰：「敬如王言！」",
        "translation": "He replied, Respectfully follow the king's words!",
        "source": "T25n1509_012:0152a15_31"
    },
    {
        "source_sentence": "菩薩得珠，飛騰虛空，如屈伸臂頃，到閻浮提。",
        "translation": "When the bodhisattva obtained the pearl, he flew up into space like a bow-span and reached Jambudvīpa.",
        "source": "T25n1509_012:0152a15_32"
    },
    {
        "source_sentence": "人王父母見兒吉還，歡悅踊躍，抱而問言：「汝得何物？」",
        "translation": "Seeing his son's good fortune, the human king's parents rejoiced and jumped with joy.",
        "source": "T25n1509_012:0152a16_33"
    },
    {
        "source_sentence": "答言：「得如意寶珠。」",
        "translation": "He replied, They'll attain the wish-granting jewel.",
        "source": "T25n1509_012:0152a17_34"
    },
    {
        "source_sentence": "問言：「今在何許？」",
        "translation": "He asked, Where is it now?",
        "source": "T25n1509_012:0152a18_35"
    },
    {
        "source_sentence": "白言：「在此衣角裏中。」",
        "translation": "He said, It's here inside the corner of my robe.",
        "source": "T25n1509_012:0152a18_36"
    },
    {
        "source_sentence": "父母言：「何其泰小？」",
        "translation": "His parents said, What's so small?",
        "source": "T25n1509_012:0152a19_37"
    },
    {
        "source_sentence": "白言：「在其神德，不在大也。」",
        "translation": "They said, It's because of their spiritual virtue that they aren't great.",
        "source": "T25n1509_012:0152a19_38"
    },
    {
        "source_sentence": "白父母言：「當勅城中內外，掃灑燒香，懸繒幡蓋，持齋受戒。」",
        "translation": "He told his parents, You must order the city to sweep and burn incense inside and outside the city, hang silk banners and canopies, observe purification, and receive the precepts.",
        "source": "T25n1509_012:0152a20_39"
    },
    {
        "source_sentence": "明日清旦，以長木為表，以珠著上。",
        "translation": "On the morning, at dawn, he made a long wooden surface and put it on top of his beads.",
        "source": "T25n1509_012:0152a21_40"
    },
    {
        "source_sentence": "菩薩是時自立誓願：「若我當成佛道、度脫一切者，珠當如我意願，出一切寶物，隨人所須，盡皆備有！」",
        "translation": "The bodhisattva then made a vow, If I were to achieve the Buddha Way and liberate all people, the pearl would be as I wished, producing all the treasures that are needed by anyone!",
        "source": "T25n1509_012:0152a22_41"
    },
    {
        "source_sentence": "是時，陰雲普遍，雨種種寶物，衣服、飲食、臥具、湯藥，人之所須，一切具足。",
        "translation": "At that time, clouds of moonlight fell all over the sky and rain poured down various precious things, such as clothing, food and drink, bedding, bathing water, and medicine. All the people needed they were provided for.",
        "source": "T25n1509_012:0152a24_42"
    },
    {
        "source_sentence": "至其命盡，常爾不絕。",
        "translation": "When his life ends, he'll always be like this without ceasing.",
        "source": "T25n1509_012:0152a26_43"
    },
    {
        "source_sentence": "如是等，名為菩薩布施生精進波羅蜜。",
        "translation": "Such and so forth are called the bodhisattva's perfection of generosity that produces effort.",
        "source": "T25n1509_012:0152a26_44"
    },
    {
        "source_sentence": "云何菩薩布施生禪波羅蜜？",
        "translation": "How does a bodhisattva's generosity give rise to the perfection of meditation?",
        "source": "T25n1509_012:0152a27_45"
    },
    {
        "source_sentence": "菩薩布施時，能除慳貪。",
        "translation": "When a bodhisattva gives alms, he's able to remove stinginess and greed.",
        "source": "T25n1509_012:0152a28_46"
    },
    {
        "source_sentence": "除慳貪已，因此布施而行一心，漸除五蓋；",
        "translation": "After getting rid of stinginess and greed, they practice giving with one mind through this giving, gradually getting rid of the five hindrances.",
        "source": "T25n1509_012:0152a29_0"
    },
    {
        "source_sentence": "能除五蓋，是名為禪。",
        "translation": "Being able to remove the five hindrances is called meditation.",
        "source": "T25n1509_012:0152b01_0"
    },
    {
        "source_sentence": "復次，心依布施，入於初禪，乃至滅定禪。",
        "translation": "Furthermore, the mind relies on generosity and enters the first dhyāna up to the cessation of meditation.",
        "source": "T25n1509_012:0152b01_1"
    },
    {
        "source_sentence": "云何為依？",
        "translation": "What is the support?",
        "source": "T25n1509_012:0152b02_2"
    },
    {
        "source_sentence": "若施行禪人時，心自念言：「我以此人行禪定故，淨心供養，我今何為自替於禪？」",
        "translation": "When he's practicing meditation, he thinks to himself, I made offerings with a pure mind because of this person's practice of meditation, so why am I changing my place of meditation now?",
        "source": "T25n1509_012:0152b02_3"
    },
    {
        "source_sentence": "即自歛心，思惟行禪。",
        "translation": "He then closed his mind and contemplated the practice of meditation.",
        "source": "T25n1509_012:0152b04_4"
    },
    {
        "source_sentence": "若施貧人，念此宿命作諸不善，不求一心，不修福業，今世貧窮。",
        "translation": "If someone gives to a poor man, thinks of this past life as doing unwholesome things, doesn't seek one-pointedness, and doesn't cultivate meritorious actions, they'll be poor in the present life.",
        "source": "T25n1509_012:0152b05_0"
    },
    {
        "source_sentence": "以是自勉修善，一心以入禪定。",
        "translation": "Because of this, they themselves strive to cultivate goodness and enter meditation with one mind.",
        "source": "T25n1509_012:0152b06_1"
    },
    {
        "source_sentence": "如說喜見轉輪聖王，八萬四千小王來朝，皆持七寶妙物來獻。",
        "translation": "As it was said, the wheel-turning sage king Joyful Vision came to court with 84,000 minor kings, all bringing marvelous things of the seven treasures to offer.",
        "source": "T25n1509_012:0152b07_2"
    },
    {
        "source_sentence": "王言：「我不須也，汝等各可自以修福！」",
        "translation": "The king said, I don't need it; you can each cultivate your own merits!",
        "source": "T25n1509_012:0152b08_3"
    },
    {
        "source_sentence": "諸王自念：「大王雖不肯取，我等亦復不宜自用。」",
        "translation": "The kings thought to themselves, Even though the great king won't take it, we won't use it for ourselves.",
        "source": "T25n1509_012:0152b09_4"
    },
    {
        "source_sentence": "即共造工，立七寶殿，殖七寶行樹，作七寶浴池。",
        "translation": "Together they built a seven-jeweled palace, planted seven-jeweled lines of trees, and constructed a bathing pool made of seven-jeweled substances.",
        "source": "T25n1509_012:0152b10_5"
    },
    {
        "source_sentence": "於大殿中造八萬四千七寶樓，樓中皆有七寶床座，雜色被枕，置床兩頭，懸繒幡蓋，香熏塗地。",
        "translation": "In the great hall, eighty-four thousand seven-jeweled towers were built in which were seated seven-jeweled beds of various colors and draped with pillows. On both ends of the beds were hanging silhouetted banners and canopies that perfumed the earth with fragrance.",
        "source": "T25n1509_012:0152b11_6"
    },
    {
        "source_sentence": "眾事備已，白大王言：「願受法殿、寶樹、浴池！」",
        "translation": "When all the things had been prepared, he said to the great king, May I accept the Dharma hall, the jeweled tree, and the bathing pond!",
        "source": "T25n1509_012:0152b14_7"
    },
    {
        "source_sentence": "王默然受之，而自念言：「我今不應先處新殿以自娛樂，當求善人、諸沙門、婆羅門等先入供養，然後我當處之！」",
        "translation": "The king accepted it in silence and thought to himself, Now, I shouldn't go into the new hall to amuse myself; I must first make offerings to good people, ascetics, priests, and brāhmaṇas, and then I will stay there!",
        "source": "T25n1509_012:0152b15_8"
    },
    {
        "source_sentence": "即集善人，先入寶殿，種種供養，微妙具足。",
        "translation": "He then gathered the good people, entered the jeweled hall first, and offered various kinds of offerings that were subtly complete.",
        "source": "T25n1509_012:0152b17_9"
    },
    {
        "source_sentence": "諸人出已，王入寶殿，登金樓，坐銀床，念布施，除五蓋，攝六情，却六塵，受喜樂，入初禪。",
        "translation": "The king entered the jeweled palace, ascended to the golden tower, and sat on a silver couch. He was mindful of his almsgiving, removing the five kinds of hindrances that prevented him from receiving charity. Having subdued these six emotions, he withdrew into the first meditative state of absorption in which all senses were freed from the six defilements",
        "source": "T25n1509_012:0152b18_10"
    },
    {
        "source_sentence": "次登銀樓，坐金床，入二禪。",
        "translation": "Next, he ascended to the silver building and sat on a golden couch. He entered the second meditative state of absorption.",
        "source": "T25n1509_012:0152b20_11"
    },
    {
        "source_sentence": "次登毘琉璃樓，坐頗梨寶床，入三禪。",
        "translation": "Next, he ascended to the vaiḍūrya pavilion, sat on a pārijātaka seat, and entered the third meditation.",
        "source": "T25n1509_012:0152b21_12"
    },
    {
        "source_sentence": "次登頗梨寶樓，坐毘琉璃床，入四禪。",
        "translation": "Next, he ascended to the jeweled palace of pārijā and sat on a vaiḍūrya bed. He entered the fourth meditative state of absorption.",
        "source": "T25n1509_012:0152b22_13"
    },
    {
        "source_sentence": "獨坐思惟，終竟三月。",
        "translation": "He sat alone in meditation for three months.",
        "source": "T25n1509_012:0152b23_14"
    },
    {
        "source_sentence": "玉女寶后，與八萬四千諸侍女俱，皆以白珠名寶瓔珞其身，來白大王：「久違親覲，敢來問訊！」",
        "translation": "The jeweled queen of the jadelike queen, accompanied by 84,000 maidservants, presented her body with a white pearl-jeweled necklace and said to the king, I've been absent from my family for a long time; I dare to come to greet you!",
        "source": "T25n1509_012:0152b23_15"
    },
    {
        "source_sentence": "王告諸妹：「汝等各當端心，當為知識，勿為我怨！」",
        "translation": "The king told the sisters, All of you, be straightforward in your minds, be friends, and don't become enemies of me!",
        "source": "T25n1509_012:0152b25_16"
    },
    {
        "source_sentence": "玉女寶后垂淚而言：「大王！",
        "translation": "The jeweled queen of the jadelike queen wept and said, Great king!",
        "source": "T25n1509_012:0152b27_17"
    },
    {
        "source_sentence": "何為謂我為妹？",
        "translation": "Why is it said that I am your sister?",
        "source": "T25n1509_012:0152b27_18"
    },
    {
        "source_sentence": "必有異心，願聞其意，云何見勅『當為知識，勿為我怨』？」",
        "translation": "They must have a different mind and wish to hear their thoughts, so why do they see the command, 'You must be my friend and not mine?'",
        "source": "T25n1509_012:0152b28_19"
    },
    {
        "source_sentence": "王告之言：「汝若以我為世因緣，共行欲事以為歡樂，是為我怨；",
        "translation": "The king said to them, “If you think of self as a worldly cause or condition and enjoy sexual desire together with me, this is my enemy.",
        "source": "T25n1509_012:0152b29_20"
    },
    {
        "source_sentence": "若能覺悟非常，知身如幻，修福行善，絕去欲情，是為知識。」",
        "translation": "If someone can perceive and awaken to impermanence, know that their body is illusory, cultivate goodness and goodness, and cut off the feelings of desire, this is knowledge.",
        "source": "T25n1509_012:0152c01_21"
    },
    {
        "source_sentence": "諸玉女言：「敬如王勅！」",
        "translation": "The jade maidens said, Respectfully as the king commands!",
        "source": "T25n1509_012:0152c03_22"
    },
    {
        "source_sentence": "說此語已，各遣令還。",
        "translation": "After speaking these words, they each sent an order to return.",
        "source": "T25n1509_012:0152c03_23"
    },
    {
        "source_sentence": "諸女出已，王登金樓，坐銀床，行慈三昧；",
        "translation": "The king ascended the golden tower and sat on a silver couch, practicing meditative absorption of benevolence.",
        "source": "T25n1509_012:0152c04_24"
    },
    {
        "source_sentence": "登銀樓，坐金床，行悲三昧；",
        "translation": "He ascended a silver tower, sat on a golden couch, and practiced compassion in concentration.",
        "source": "T25n1509_012:0152c05_25"
    },
    {
        "source_sentence": "登毘琉璃樓，坐頗梨床，行喜三昧；",
        "translation": "He ascended to the lapis lazuli building, sat on a crystal bed, and practiced blissful concentration.",
        "source": "T25n1509_012:0152c05_26"
    },
    {
        "source_sentence": "登頗梨寶樓，坐毘琉璃床，行捨三昧。",
        "translation": "He ascended to the jeweled palace of pāri, sat on a vaiḍūrya couch, and practiced abstinence concentration.",
        "source": "T25n1509_012:0152c06_27"
    },
    {
        "source_sentence": "是為菩薩布施生禪波羅蜜。",
        "translation": "This is the bodhisattva's generosity that gives rise to the perfection of meditation.",
        "source": "T25n1509_012:0152c07_28"
    },
    {
        "source_sentence": "云何菩薩布施生般若波羅蜜？",
        "translation": "How does a bodhisattva's generosity give rise to the perfection of wisdom?",
        "source": "T25n1509_012:0152c08_29"
    },
    {
        "source_sentence": "菩薩布施時，知此布施必有果報而不疑惑，能破邪見無明，是為布施生般若波羅蜜。",
        "translation": "When a bodhisattva makes a gift, he knows that this gift will surely have fruit and doesn't doubt it, and he can break through wrong views and ignorance, which is the perfection of generosity that gives rise to the perfection of prajñāpāramitā.",
        "source": "T25n1509_012:0152c09_0"
    },
    {
        "source_sentence": "復次，菩薩布施時，能分別知：不持戒人，若鞭打拷掠閉繫，枉法得財而作布施，生象、馬、牛中，雖受畜生形，負重鞭策，羇靽乘騎，而常得好屋好食，為人所重，以人供給。",
        "translation": "Furthermore, when a bodhisattva gives alms, he can discern and know that someone who doesn't observe precepts is born among elephants, horses, or cattle in the form of an animal, even though they're whipped, beaten, tortured, confined, and made to give alms because they've gained property in violation of the Dharma. They'll always attain a good house",
        "source": "T25n1509_012:0152c11_1"
    },
    {
        "source_sentence": "又知惡人多懷瞋恚，心曲不端而行布施，當墮龍中，得七寶宮殿，妙食好色。",
        "translation": "Knowing that evil people harbor much anger, their minds are twisted and unruly and they practice generosity, they'll fall into a dragon and attain a seven-jeweled palace with marvelous food and good color.",
        "source": "T25n1509_012:0152c14_2"
    },
    {
        "source_sentence": "又知憍人多慢、瞋心布施，墮金翅鳥中，常得自在。",
        "translation": "Knowing that angry people are often conceited and give generously with an angry mind, they'll fall into the garuḍa and always attain mastery.",
        "source": "T25n1509_012:0152c16_3"
    },
    {
        "source_sentence": "有如意寶珠以為瓔珞，種種所須，皆得自恣，無不如意，變化萬端，無事不辦。",
        "translation": "They had wish-granting jewels as their jewelry, and whatever they needed were all given to them freely. There was nothing not wished for, and there were myriad forms of magical transformations that could not be done.",
        "source": "T25n1509_012:0152c18_0"
    },
    {
        "source_sentence": "又知宰官之人，枉濫人民，不順治法而取財物，以用布施，墮鬼神中，作鳩槃茶鬼，能種種變化，五塵自娛。",
        "translation": "They also know that the chancellor's officials are unjust to the people, don't follow the rules and regulations, take property, give it as alms, fall into ghosthood, become kumbhāṇḍa ghosts, can perform various transformations, and enjoy themselves in five dust motes.",
        "source": "T25n1509_012:0152c19_1"
    },
    {
        "source_sentence": "又知多瞋佷戾、嗜好酒肉之人而行布施，墮地夜叉鬼中，常得種種歡樂、音樂、飲食。",
        "translation": "Knowing that there are many angry and hostile people who like wine and meat and give alms to them, they'll fall into the land of a yakṣa ghost and always attain various kinds of happiness, music, and food and drink.",
        "source": "T25n1509_012:0152c22_2"
    },
    {
        "source_sentence": "又知有人剛愎強梁而能布施，車馬代步，墮虛空夜叉中而有大力，所至如風。",
        "translation": "You also know that some people are able to give alms by steadfastly building strong beams of iron. Carriages and horses follow one another, and they fall into the sky in the realm of yakṣas with great strength, reaching as far as the wind.",
        "source": "T25n1509_012:0152c24_3"
    },
    {
        "source_sentence": "又知有人妬心好諍，而能以好房舍、臥具、衣服、飲食布施，故生宮觀飛行夜叉中，有種種娛樂便身之物。",
        "translation": "Knowing that someone's jealousy and good anger can give them nice dwellings, bedding, clothing, food and drink, so they're born in the palace to observe flying yakṣas with various kinds of amusement and conveniences.",
        "source": "T25n1509_012:0152c26_4"
    },
    {
        "source_sentence": "如是種種，當布施時能分別知，是為菩薩布施生般若。",
        "translation": "Such various things can be discerned and known when they're given, which is the bodhisattva's generosity that gives rise to prajñā.",
        "source": "T25n1509_012:0152c28_5"
    },
    {
        "source_sentence": "復次，布施飲食得力、色、命、樂、瞻。",
        "translation": "Furthermore, generosity of food and drink obtains strength, form, life, happiness, and insight.",
        "source": "T25n1509_012:0153a01_6"
    },
    {
        "source_sentence": "若布施衣服，得生知慚愧，威德端正，身心安樂；",
        "translation": "If one donates clothing, he or she will be embarrassed and ashamed of his or her sins. With dignity and virtue they will attain well-being in body and mind.",
        "source": "T25n1509_012:0153a01_7"
    },
    {
        "source_sentence": "若施房舍，則得種種七寶宮觀，自然而有，五欲自娛；",
        "translation": "If you donate living quarters, you’ll attain various kinds of seven-jeweled palaces and pavilions that are naturally present to satisfy the five senses.",
        "source": "T25n1509_012:0153a02_8"
    },
    {
        "source_sentence": "若施井池泉水種種好漿，所生則得無飢、無渴，五欲備有；",
        "translation": "If one gives water from wells, ponds, and springs to various kinds of delicious juices, they will be born without hunger or thirst, with all the five desires.",
        "source": "T25n1509_012:0153a04_9"
    },
    {
        "source_sentence": "若施橋船及諸履屣，生有種種車馬具足；",
        "translation": "If they donate bridges, boats, and footstools, they will be provided with various kinds of carts and horses.",
        "source": "T25n1509_012:0153a05_10"
    },
    {
        "source_sentence": "若施園林，則得豪尊，為一切依止，受身端政，心樂無憂。",
        "translation": "If you donate to a garden or forest, you'll attain the status of noble person who relies on it for all his support, receives a body that's correct and well-maintained, and has no sorrow in his mind.",
        "source": "T25n1509_012:0153a06_11"
    },
    {
        "source_sentence": "如是等種種人中，因緣布施所得。",
        "translation": "Among these various kinds of people, it's because of the causes and conditions that they give alms.",
        "source": "T25n1509_012:0153a07_12"
    },
    {
        "source_sentence": "若人布施修作福德，不好有為作業生活，則得生四天王處；",
        "translation": "If someone gives alms and practices meritorious deeds, they will not be born in the realm of conditioned existence. Then they can be reborn in the realm of the four heavenly kings.",
        "source": "T25n1509_012:0153a08_13"
    },
    {
        "source_sentence": "若人布施，加以供養父母，及諸伯叔兄弟姊妹，無瞋無恨，不好諍訟，又不喜見諍訟之人，得生忉利天上、焰摩、兜術、化自在、他化自在。",
        "translation": "If someone gives alms to their parents and makes offerings to their uncles, brothers, sisters, no anger or resentment, doesn't like disputes, and doesn't like to see those who argue, they'll be born in Trāyastriṃśa Heaven, Yama, Tuṣita, the master of transformation, and the master of other transformation.",
        "source": "T25n1509_012:0153a10_0"
    },
    {
        "source_sentence": "如是種種分別布施，是為菩薩布施生般若。",
        "translation": "Such various kinds of discriminating generosity are the bodhisattva's generosity that gives rise to prajñā.",
        "source": "T25n1509_012:0153a13_1"
    },
    {
        "source_sentence": "若人布施，心不染著，厭患世間，求涅槃樂，是為阿羅漢、辟支佛布施；",
        "translation": "If someone’s mind isn’t tainted with attachment, becomes disillusioned with worldly things and seeks the bliss of nirvana—this is an arhat’s or a pratyekabuddha’s giving.",
        "source": "T25n1509_012:0153a14_2"
    },
    {
        "source_sentence": "若人布施為佛道，為眾生故，是為菩薩布施。",
        "translation": "If someone gives alms for the sake of the Buddha's path and for the sake of sentient beings, this is a bodhisattva's giving.",
        "source": "T25n1509_012:0153a15_3"
    },
    {
        "source_sentence": "如是等種種布施中分別知，是為布施生般若波羅蜜。",
        "translation": "Such kinds of discernment in various kinds of generosity are the prajñāpāramitā that arises from generosity.",
        "source": "T25n1509_012:0153a16_4"
    },
    {
        "source_sentence": "復次，菩薩布施時，思惟三事實相，如上說。",
        "translation": "Furthermore, when a bodhisattva gives alms, he contemplates the three real characteristics of reality as explained above.",
        "source": "T25n1509_012:0153a18_5"
    },
    {
        "source_sentence": "如是能知，是為布施生般若波羅蜜。",
        "translation": "Knowing it this way is the perfection of generosity that gives rise to prajñāpāramitā.",
        "source": "T25n1509_012:0153a19_6"
    },
    {
        "source_sentence": "復次，一切智慧功德因緣，皆由布施。",
        "translation": "Furthermore, all the causes and conditions for the merit of wisdom are all due to generosity.",
        "source": "T25n1509_012:0153a20_0"
    },
    {
        "source_sentence": "如千佛始發意時，種種財物布施諸佛，或以華香、或以衣服、或以楊枝布施而以發意。",
        "translation": "It's like when a thousand buddhas first arouse their intention, they give various kinds of possessions to the buddhas and give them flowers, incense, clothing, or poplar branches as an offering to arouse their intention.",
        "source": "T25n1509_012:0153a20_1"
    },
    {
        "source_sentence": "如是等種種布施，是為菩薩布施生般若波羅蜜。",
        "translation": "Such various kinds of generosity are the bodhisattva's generosity that gives rise to the perfection of wisdom.",
        "source": "T25n1509_012:0153a22_2"
    },
    {
        "source_sentence": "大智度論卷第十二",
        "translation": "Dazhiduo lun, vol. 12",
        "source": "T25n1509_012:0153a24_0"
    }
]