[
    {
        "source_sentence": "大智度論釋曇無竭品第八十九",
        "translation": "Mahāprajñāpāramitā-śāstra: An Explanation of Dharmagupta, Chapter 89",
        "source": "T25n1509_100:0750b20_0"
    },
    {
        "source_sentence": "(卷第一百)",
        "translation": "(Skt. 100)",
        "source": "T25n1509_100:0750b21_0"
    },
    {
        "source_sentence": "龍樹菩薩造",
        "translation": "created by Nāgârjuna Bodhisattva",
        "source": "T25n1509_100:0750b23_0"
    },
    {
        "source_sentence": "後秦龜茲國三藏鳩摩羅什譯",
        "translation": "Translated by Kumārajīva, a translator of the Tripiṭaka of the country of Kucha in the Later Qin",
        "source": "T25n1509_100:0750b24_0"
    },
    {
        "source_sentence": "【經】「爾時，薩陀波崙菩薩摩訶薩及長者女并五百侍女到曇無竭菩薩摩訶薩所，",
        "translation": "[Sutra] It was then that the bodhisattva Mahāsattva Sadāprarudita and the elderly maidservants and five hundred other maidservants went to the Dharmagupta Bodhisattva Mahāsattva,",
        "source": "T25n1509_100:0750b25_0"
    },
    {
        "source_sentence": "散天曼陀羅華，頭面禮畢，退坐一面。",
        "translation": "They scattered heavenly maṇḍala flowers, bowed their heads and faces, withdrew, and sat to one side.",
        "source": "T25n1509_100:0750b26_1"
    },
    {
        "source_sentence": "曇無竭菩薩見其坐已，告薩陀波崙菩薩言：『善男子！",
        "translation": "Seeing him, Dharmagupta Bodhisattva told Sadāprarudita Bodhisattva, 'Good man!",
        "source": "T25n1509_100:0750b27_2"
    },
    {
        "source_sentence": "諦聽！",
        "translation": "Listen attentively!",
        "source": "T25n1509_100:0750b28_3"
    },
    {
        "source_sentence": "諦受！",
        "translation": "It's received with respect!",
        "source": "T25n1509_100:0750b29_0"
    },
    {
        "source_sentence": "今當為汝說般若波羅蜜相。",
        "translation": "Now, I will explain the characteristics of prajñā-pāramitā for you.",
        "source": "T25n1509_100:0750b29_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T25n1509_100:0750b29_2"
    },
    {
        "source_sentence": "諸法等故，當知般若波羅蜜亦等。",
        "translation": "Because the dharmas are equal, you should know that the prajñāpāramitā is also equal.",
        "source": "T25n1509_100:0750c01_0"
    },
    {
        "source_sentence": "諸法離故，當知般若波羅蜜亦離。",
        "translation": "Because the dharmas are free, you should know that the prajñāpāramitā is also free.",
        "source": "T25n1509_100:0750c01_1"
    },
    {
        "source_sentence": "諸法不動故，當知般若波羅蜜亦不動。",
        "translation": "Because the dharmas don't move, you should know that the prajñāpāramitā doesn't move either.",
        "source": "T25n1509_100:0750c02_2"
    },
    {
        "source_sentence": "諸法無念故，當知般若波羅蜜亦無念。",
        "translation": "Because all dharmas lack mindfulness, you should know that the prajñāpāramitā also has no mindfulness.",
        "source": "T25n1509_100:0750c03_3"
    },
    {
        "source_sentence": "諸法無畏故，當知般若波羅蜜亦無畏。",
        "translation": "Because the dharmas are fearless, you should know that the prajñāpāramitā is also fearless.",
        "source": "T25n1509_100:0750c04_4"
    },
    {
        "source_sentence": "諸法一味故，當知般若波羅蜜亦一味。",
        "translation": "Because all dharmas are one flavor, you should know that the prajñāpāramitā is also one flavor.",
        "source": "T25n1509_100:0750c05_5"
    },
    {
        "source_sentence": "諸法無邊故，當知般若波羅蜜亦無邊。",
        "translation": "Because the dharmas are limitless, you should know that the prajñāpāramitā is also limitless.",
        "source": "T25n1509_100:0750c06_6"
    },
    {
        "source_sentence": "諸法無生故，當知般若波羅蜜亦無生。",
        "translation": "Because dharmas lack birth, you should know that the prajñāpāramitā also has no birth.",
        "source": "T25n1509_100:0750c06_7"
    },
    {
        "source_sentence": "諸法無滅故，當知般若波羅蜜亦無滅。",
        "translation": "Because all dharmas lack cessation, you should know that the prajñāpāramitā also has no cessation.",
        "source": "T25n1509_100:0750c07_8"
    },
    {
        "source_sentence": "虛空無邊故，當知般若波羅蜜亦無邊。",
        "translation": "Because space has no limit, you should know that the prajñāpāramitā also has no limit.",
        "source": "T25n1509_100:0750c08_9"
    },
    {
        "source_sentence": "大海水無邊故，當知般若波羅蜜亦無邊。",
        "translation": "Because the great water of the ocean has no limit, you should know that the prajñāpāramitā also has no limit.",
        "source": "T25n1509_100:0750c09_10"
    },
    {
        "source_sentence": "須彌山莊嚴故，當知般若波羅蜜亦莊嚴。",
        "translation": "Because it's adorned by Mount Sumeru, you should know that the perfection of wisdom is also adorned.",
        "source": "T25n1509_100:0750c10_11"
    },
    {
        "source_sentence": "虛空無分別故，當知般若波羅蜜亦無分別。",
        "translation": "Because space has no discrimination, you should know that the prajñāpāramitā also has no discrimination.",
        "source": "T25n1509_100:0750c11_12"
    },
    {
        "source_sentence": "色無邊故，當知般若波羅蜜亦無邊；",
        "translation": "Because form has no limit, you should know that the transcendent wisdom also has no limit.",
        "source": "T25n1509_100:0750c12_13"
    },
    {
        "source_sentence": "受、想、行、識無邊故，當知般若波羅蜜亦無邊。",
        "translation": "Because feeling, perception, volition, volition, and consciousness are limitless, you should know that the prajñāpāramitā is also limitless.",
        "source": "T25n1509_100:0750c13_14"
    },
    {
        "source_sentence": "地種無邊故，當知般若波羅蜜亦無邊；",
        "translation": "Because the seeds of the earth are boundless, you should know that the transcendent wisdom is also boundless.",
        "source": "T25n1509_100:0750c14_15"
    },
    {
        "source_sentence": "水種、火種、風種無邊故，當知般若波羅蜜亦無邊；",
        "translation": "Because the seeds of water, fire, and wind are boundless, you should know that the transcendent wisdom is also boundless.",
        "source": "T25n1509_100:0750c15_16"
    },
    {
        "source_sentence": "空種無邊故，當知般若波羅蜜亦無邊。",
        "translation": "Because the seed of emptiness has no limit, you should know that the prajñāpāramitā also has no limit.",
        "source": "T25n1509_100:0750c16_17"
    },
    {
        "source_sentence": "如金鋼等故，當知般若波羅蜜亦等。",
        "translation": "Because they're like gold and steel, you should know that the prajñāpāramitā is also like this.",
        "source": "T25n1509_100:0750c17_18"
    },
    {
        "source_sentence": "諸法無分別故，當知般若波羅蜜亦無分別。",
        "translation": "Because the dharmas are without discrimination, you should know that the prajñāpāramitā is also without discrimination.",
        "source": "T25n1509_100:0750c18_0"
    },
    {
        "source_sentence": "諸法性不可得故，當知般若波羅蜜性亦不可得。",
        "translation": "Because the nature of dharmas is unobtainable, you should know that the nature of prajñā-pāramitā is also unobtainable.",
        "source": "T25n1509_100:0750c19_0"
    },
    {
        "source_sentence": "諸法無所有等故，當知般若波羅蜜亦無所有等。",
        "translation": "Because all dharmas lack existence and so forth, you should know that the prajñāpāramitā also lacks existence and so forth.",
        "source": "T25n1509_100:0750c20_1"
    },
    {
        "source_sentence": "諸法無作故，當知般若波羅蜜亦無作。",
        "translation": "Because all dharmas are uncreated, you should know that the prajñāpāramitā is also uncreated.",
        "source": "T25n1509_100:0750c21_2"
    },
    {
        "source_sentence": "諸法不可思議故，當知般若波羅蜜亦不可思議。』",
        "translation": "Because the teachings are inconceivable, you should know that the perfection of wisdom is also inconceivable.'",
        "source": "T25n1509_100:0750c22_3"
    },
    {
        "source_sentence": "「是時，薩陀波崙菩薩摩訶薩即於座上得諸三昧，所謂諸法等三昧，諸法離三昧，",
        "translation": "“At that time, the bodhisattva Mahāsattva Sadāprarudita had attained various concentrations while seated in his meditation throne, which are called ‘samādhi of qualities’ and ‘samādhi of ‘separation from qualities’.",
        "source": "T25n1509_100:0750c23_4"
    },
    {
        "source_sentence": "諸法無畏三昧，諸法一味三昧，諸法無邊三昧，諸法無生三昧，諸法無滅三昧，",
        "translation": "They are the fearless concentration of all things, the one- flavor concentration of all things, the boundless concentration of all things, the unarisen concentration of all things, and the cessationless concentration of all things.",
        "source": "T25n1509_100:0750c25_5"
    },
    {
        "source_sentence": "虛空無邊三昧，大海水無邊三昧，須彌山莊嚴三昧，虛空無分別三昧，",
        "translation": "They are the boundless concentration of space, the boundless concentration of water in the great ocean, the adorned concentration of the polar mountain, and the boundless concentration of space.",
        "source": "T25n1509_100:0750c26_6"
    },
    {
        "source_sentence": "色無邊三昧，受、想、行、識無邊三昧；",
        "translation": "Boundless concentration of material form, boundless concentration of feeling, perception, volition, and consciousness.",
        "source": "T25n1509_100:0750c28_7"
    },
    {
        "source_sentence": "地種無邊三昧，水種、火種、風種、空種無邊三昧；",
        "translation": "boundless concentration of the earth element, boundless concentration of the water element, the fire element, the wind element and the sky element.",
        "source": "T25n1509_100:0750c29_8"
    },
    {
        "source_sentence": "如金鋼等三昧，諸法無分別三昧，諸法不可思議三昧——如是等，得六百萬諸三昧門。」",
        "translation": "It's like the samādhi of gold and steel, the nondiscriminating samādhi of dharmas, the inconceivable samādhi of dharmas - so forth, you'll attain six million samādhis.",
        "source": "T25n1509_100:0751a01_9"
    },
    {
        "source_sentence": "爾時，佛告須菩提：「如我今於三千大千世界中與諸比丘僧圍繞，以是相、以是像貌、以是名字說般若波羅蜜；",
        "translation": "It was then that the Buddha said to Subhūti: Suppose I now, in a world of 3,000 great chiliocosms, surrounded by monks and nuns, explain the transcendent wisdom through these characteristics, these images, and these names.",
        "source": "T25n1509_100:0751a03_10"
    },
    {
        "source_sentence": "薩陀波崙得是六百萬三昧門，見東方、南西北方、四維、上下如恒河沙等三千大千世界中諸佛與諸比丘恭敬圍繞，",
        "translation": "Sadāprarudita attained these six million samādhi-gates, seeing the buddhas and monks of the east, south, west, north, four directions, up and down as numerous as the sands of the Ganges River in a thousand great manifold cosmos, surrounded with reverence.",
        "source": "T25n1509_100:0751a05_11"
    },
    {
        "source_sentence": "以如是相、以是像貌、以是名字說是摩訶般若波羅蜜亦如是。",
        "translation": "It's likewise with such-and-such form, such-and-such appearance, and such-and-such names that they say this is the Mahāprajñāpāramitā.",
        "source": "T25n1509_100:0751a08_12"
    },
    {
        "source_sentence": "薩陀波崙菩薩從是已後，多聞、智慧不可思議，如大海水；",
        "translation": "“After that the enlightening being Sadāprarudita had inconceivable knowledge and wisdom, like the water of the great ocean.",
        "source": "T25n1509_100:0751a09_13"
    },
    {
        "source_sentence": "常不離諸佛，生於有佛土中。",
        "translation": "They always don't part from the buddhas and are born in a buddha land where there are buddhas.",
        "source": "T25n1509_100:0751a11_14"
    },
    {
        "source_sentence": "乃至夢中未曾不見佛時；",
        "translation": "They do not even dream of ever seeing a buddha.",
        "source": "T25n1509_100:0751a11_15"
    },
    {
        "source_sentence": "一切眾難皆悉已斷，在所佛土隨願往生。",
        "translation": "All the difficulties have all been completely eliminated, and they'll be reborn in the Buddha land where they wish to be born.",
        "source": "T25n1509_100:0751a12_16"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_100:0751a13_17"
    },
    {
        "source_sentence": "當知是般若波羅蜜因緣，能成就菩薩摩訶薩一切功德，得一切種智。",
        "translation": "You should know that these are the causes and conditions for the perfection of prajñā-pāramitā that accomplish all the merits of bodhisattvas, mahāsattvas, and attain all kinds of cognition.",
        "source": "T25n1509_100:0751a13_18"
    },
    {
        "source_sentence": "以是故，須菩提！",
        "translation": "Because of this, Subhūti!",
        "source": "T25n1509_100:0751a15_19"
    },
    {
        "source_sentence": "諸菩薩摩訶薩若欲學六波羅蜜、欲深入諸佛智慧、欲得一切種智，應受持是般若波羅蜜，",
        "translation": "If bodhisattvas, mahāsattvas, want to train in the six perfections, want to enter deeply into the wisdom of the buddhas, and want to attain all kinds of knowledge, they should accept and uphold this prajñāpāramitā.",
        "source": "T25n1509_100:0751a15_20"
    },
    {
        "source_sentence": "誦、讀、正憶念、廣為人說，亦書寫經卷，供養、尊重、讚歎，香華乃至妓樂。",
        "translation": "He recites, reads, correctly recalls, and extensively explains it to others, and he also writes sūtras in scrolls that are offered support, honored, praised, and praised, such as fragrant flowers or even music.",
        "source": "T25n1509_100:0751a17_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_100:0751a19_22"
    },
    {
        "source_sentence": "般若波羅蜜是過去、未來、現在十方諸佛母，十方諸佛所尊重故。」",
        "translation": "The perfection of wisdom is the mother of the buddhas of the past, future, and present in the ten directions, and it's honored by the buddhas of the ten directions.",
        "source": "T25n1509_100:0751a19_23"
    },
    {
        "source_sentence": "【論】釋曰：曇無竭既出，至法座所，遍觀無勝己者，於是而坐。",
        "translation": "[Commentary] Explanation: When Dharmakṣema emerged, he went to the Dharma seat, observed everywhere that there's nothing superior to him, and sat down there.",
        "source": "T25n1509_100:0751a22_0"
    },
    {
        "source_sentence": "爾時，薩陀波崙菩薩知坐已定，到曇無竭所，頭面禮足，一面坐。",
        "translation": "Knowing that his seat had been set, Sadāprarudita Bodhisattva went to Dharmakṣema, bowed his forehead and feet, and sat to one side.",
        "source": "T25n1509_100:0751a23_1"
    },
    {
        "source_sentence": "禮有三種：一者、口禮；",
        "translation": "There are three kinds of reverence:",
        "source": "T25n1509_100:0751a24_2"
    },
    {
        "source_sentence": "二者、屈膝，頭不至地；",
        "translation": "The second is that they bend their knees and do not touch the ground with their heads.",
        "source": "T25n1509_100:0751a25_3"
    },
    {
        "source_sentence": "三者、頭至地，是為上禮。",
        "translation": "Third, the bodhisattva's head reaches the ground, which is a superior salute.",
        "source": "T25n1509_100:0751a25_4"
    },
    {
        "source_sentence": "人之一身，頭為最上，足為最下，以頭禮足，恭敬之至。",
        "translation": "In one of the human bodies the head is the highest, while the feet are the lowest. They bow down at each other’s feet with their heads and venerate them with utmost reverence.",
        "source": "T25n1509_100:0751a26_5"
    },
    {
        "source_sentence": "曇無竭見其坐已，知從遠來，不惜身命，種種勤苦，為欲聞法。",
        "translation": "Seeing him seated, Dharmagupta knew that he had come from a distant land. He did not spare his life and endured various kinds of hardships in order to hear the Dharma.",
        "source": "T25n1509_100:0751a27_6"
    },
    {
        "source_sentence": "初相見時，日垂欲沒，少時聞法；",
        "translation": "When they first saw each other, the sun was setting and their desires disappeared. They listened to the Dharma for a little while.",
        "source": "T25n1509_100:0751a29_7"
    },
    {
        "source_sentence": "曇無竭以日沒故，起入宮中。",
        "translation": "Dharmagupta rose and entered the palace because the sun had gone down.",
        "source": "T25n1509_100:0751a29_8"
    },
    {
        "source_sentence": "今為法故，七歲渴仰，不生異心；",
        "translation": "For the sake of the Teaching he cherished it for seven years and never gave rise to dissimilar thoughts.",
        "source": "T25n1509_100:0751b01_9"
    },
    {
        "source_sentence": "垂欲出時，以血灑地，知其為法不惜身命，其心不退，決定無疑，堪受教化。",
        "translation": "When he was about to leave, he sprinkled his blood on the ground and knew that he didn't spare his life for the sake of the Dharma, but his mind didn't retreat, and he had no doubt in his mind that he would be able to receive instruction.",
        "source": "T25n1509_100:0751b02_10"
    },
    {
        "source_sentence": "是故告言：「善男子！",
        "translation": "That's why he told them, Good man!",
        "source": "T25n1509_100:0751b04_11"
    },
    {
        "source_sentence": "一心諦聽！」",
        "translation": "Listen with one mind!",
        "source": "T25n1509_100:0751b04_12"
    },
    {
        "source_sentence": "上疑諸佛來去，已斷；",
        "translation": "The above doubt that the buddhas are coming and going has been abandoned.",
        "source": "T25n1509_100:0751b04_13"
    },
    {
        "source_sentence": "今但欲聞甚深般若波羅蜜，是故為說「般若波羅蜜相」。",
        "translation": "Now, I just want to hear the profound prajñāpāramitā, so I'll explain the characteristics of the prajñāpāramitā.",
        "source": "T25n1509_100:0751b05_14"
    },
    {
        "source_sentence": "「般若波羅蜜相」者，如先諸法平等義中說。",
        "translation": "The phrase prajñāpāramitā-paripṛcchā refers to what was explained in the previous explanation of the equality of dharmas.",
        "source": "T25n1509_100:0751b06_15"
    },
    {
        "source_sentence": "或有人言：般若波羅蜜力故，觀諸法皆平等；",
        "translation": "“Some people may say, ‘Because of the power of transcendent wisdom they observe all things equally.",
        "source": "T25n1509_100:0751b07_16"
    },
    {
        "source_sentence": "非諸法性性自平等。",
        "translation": "It's not the self-equality of the nature of dharmas.",
        "source": "T25n1509_100:0751b08_17"
    },
    {
        "source_sentence": "是故，曇無竭言：「諸法平等故，般若波羅蜜平等。」",
        "translation": "That's why Dharmagupta said, Because the dharmas are equal, the prajñāpāramitā is equal.",
        "source": "T25n1509_100:0751b09_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_100:0751b10_1"
    },
    {
        "source_sentence": "因果相似故。",
        "translation": "It's because the cause and effect are similar.",
        "source": "T25n1509_100:0751b10_2"
    },
    {
        "source_sentence": "初觀諸法平等是因，決定心得般若波羅蜜是為果。",
        "translation": "The first observes that the equality of all dharmas is the cause, and the realization of the perfection of prajñāpāramitā with certainty is the result.",
        "source": "T25n1509_100:0751b10_3"
    },
    {
        "source_sentence": "問曰：觀諸法平等即是般若、般若即是平等，何以分別為因、果？",
        "translation": "Q: Observing the equality of all dharmas is prajñā, and prajñā is equality, so why are they discriminated as causes and effects?",
        "source": "T25n1509_100:0751b11_4"
    },
    {
        "source_sentence": "答曰：般若及諸法雖一相、無二無別，行者初觀時是因，觀竟名為果。",
        "translation": "Answer: Although prajñā and dharmas are one characteristic, without duality or distinction, the practitioner first observes them as causes when he first observes them, and after observing them, he calls them results.",
        "source": "T25n1509_100:0751b13_5"
    },
    {
        "source_sentence": "如須陀洹道得、向。",
        "translation": "It's like the attainment and dedication of stream entry.",
        "source": "T25n1509_100:0751b14_6"
    },
    {
        "source_sentence": "又如有漏五眾，因時名集，果時名苦。",
        "translation": "Also, it is like the case of the five impure dharmas that are called arising at the moment of cause and suffering at the moment of result.",
        "source": "T25n1509_100:0751b15_7"
    },
    {
        "source_sentence": "色等一切法平等，即是般若波羅蜜平等。",
        "translation": "The equality of all things like form is the equality of the prajñāpāramitā.",
        "source": "T25n1509_100:0751b16_8"
    },
    {
        "source_sentence": "問曰：應說「般若波羅蜜相」，今何以說平等？",
        "translation": "Q: You should say the characteristic of prajñā-pāramitā, but why is it said to be equal now?",
        "source": "T25n1509_100:0751b17_9"
    },
    {
        "source_sentence": "因不平故有平等，因平故有不平。",
        "translation": "Because of being uneven, there is equality; because of being even, there is uneven.",
        "source": "T25n1509_100:0751b18_10"
    },
    {
        "source_sentence": "於般若中亦不一相、亦不異相，汝何以故欲取一相？",
        "translation": "In prajñā, there's neither a single characteristic nor different characteristic, so why do you want to take one characteristic?",
        "source": "T25n1509_100:0751b19_11"
    },
    {
        "source_sentence": "答曰：般若波羅蜜甚深微妙，不以方便說則無解者；",
        "translation": "Answer: The perfection of wisdom is so profound and subtle that if one did not explain it with skillful means there would be no understanding.",
        "source": "T25n1509_100:0751b20_12"
    },
    {
        "source_sentence": "是故若分別不等，則生諸煩惱，三毒增長，所謂憎怨，愛親；",
        "translation": "Consequently, if discrimination is unequal, the defilements will arise. The three poisons will increase:",
        "source": "T25n1509_100:0751b21_13"
    },
    {
        "source_sentence": "愛善，憎不善。",
        "translation": "They love what’s good and hate what’s bad.",
        "source": "T25n1509_100:0751b22_14"
    },
    {
        "source_sentence": "菩薩住是二等中，觀一切法皆平等：住眾生等中，怨親、憎愛皆悉平等，",
        "translation": "“When enlightening beings abide in these two kinds of equanimity, they observe that all things are equal: when they abide in sentient beings and so on, their enemies and those who hate them are all equal.",
        "source": "T25n1509_100:0751b23_15"
    },
    {
        "source_sentence": "開福德門，閉諸惡趣；",
        "translation": "They open the doors of virtue and shut the gates of evil states.",
        "source": "T25n1509_100:0751b24_16"
    },
    {
        "source_sentence": "住法等中，於一切法中憶想分別、著心取相皆除滅，但見諸法空，空即是平等。",
        "translation": "He abides in qualities and so forth, removes all the characteristics of recollection, discrimination, attachment, mind, and apprehension of all qualities but sees the emptiness of qualities, and emptiness is equality.",
        "source": "T25n1509_100:0751b25_17"
    },
    {
        "source_sentence": "有人得是諸法平等空，直趣菩薩道，於空不戲論；",
        "translation": "Some people attain this equality of all things as emptiness and proceed directly toward the path of enlightening beings, not speculating about emptiness.",
        "source": "T25n1509_100:0751b27_18"
    },
    {
        "source_sentence": "有人雖得平等而生戲論：「若觀都空，有如是失！」",
        "translation": "Some people, even though they've attained equality, give rise to conceptual elaborations, saying, If you contemplate emptiness, there's such a mistake!",
        "source": "T25n1509_100:0751b28_19"
    },
    {
        "source_sentence": "如是人於平等即是不等。",
        "translation": "Such a person's equality is not equal.",
        "source": "T25n1509_100:0751b29_20"
    },
    {
        "source_sentence": "是故此中為「真平等」故說「般若波羅蜜等」，非是戲論。",
        "translation": "That's why it's called prajñāpāramitā and so forth here for the sake of true equality, not conceptual elaboration.",
        "source": "T25n1509_100:0751c01_21"
    },
    {
        "source_sentence": "離平等、不平等二邊，是般若波羅蜜相。",
        "translation": "Being free of the two extremes of equality and nonequality is the characteristic of the perfection of wisdom.",
        "source": "T25n1509_100:0751c02_22"
    },
    {
        "source_sentence": "問曰：平等者，於般若波羅蜜相已具足，何以故更說「離等是般若波羅蜜相」？",
        "translation": "Q: Equality means that the characteristics of the perfection of wisdom are already complete, so why is it further explained that freedom and so forth are the characteristics of the perfection of wisdom?",
        "source": "T25n1509_100:0751c03_23"
    },
    {
        "source_sentence": "答曰：經中但說「諸法等故般若等」，行者取是平等相而生著，是故說：「般若波羅蜜平等相自性離，",
        "translation": "Answer: The sūtras simply say, Because all dharmas are equal, such as prajñā and so forth, practitioners take these equal characteristics and become attached to them. That's why they say, The self-nature of the equality of prajñāpāramitā is free from each other.",
        "source": "T25n1509_100:0751c05_24"
    },
    {
        "source_sentence": "色等諸法自相離故。」",
        "translation": "It's because form and other dharmas are free of their own characteristics.",
        "source": "T25n1509_100:0751c07_25"
    },
    {
        "source_sentence": "離義，如〈相無相品〉中說。",
        "translation": "The meaning of freedom is as explained in the chapter on marks and signlessness.",
        "source": "T25n1509_100:0751c07_26"
    },
    {
        "source_sentence": "得此諸法平等，又於平等離，安住空中，空中則不動——戲論不能動，",
        "translation": "Attaining equality of these things, he's also free of equality and abides in space, but the sky doesn't move - it can't be moved by conceptual elaboration.",
        "source": "T25n1509_100:0751c08_27"
    },
    {
        "source_sentence": "諸煩惱山亦不能動，無常時亦不能動。",
        "translation": "The mountains of afflictions can't move, and they can't move when they're impermanent.",
        "source": "T25n1509_100:0751c10_28"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_100:0751c11_29"
    },
    {
        "source_sentence": "於一切法得實相故。",
        "translation": "It's because all dharmas attain their true characteristics.",
        "source": "T25n1509_100:0751c11_30"
    },
    {
        "source_sentence": "菩薩住是二空，得不動般若波羅蜜，是則究竟。",
        "translation": "When a bodhisattva abides in these two kinds of emptiness and attains the immovable perfection of wisdom, this is the ultimate.",
        "source": "T25n1509_100:0751c11_31"
    },
    {
        "source_sentence": "若有念，即是有相著處；",
        "translation": "If there is thought, it is the attachment of being with characteristics.",
        "source": "T25n1509_100:0751c13_0"
    },
    {
        "source_sentence": "是故說：「諸法無念故，當知般若波羅蜜亦無念。」",
        "translation": "Therefore, it's said, Because all dharmas lack mindfulness, you should know that the prajñāpāramitā also has no mindfulness.",
        "source": "T25n1509_100:0751c13_1"
    },
    {
        "source_sentence": "無動相是般若波羅蜜，般若波羅蜜諸相滅故。",
        "translation": "The characteristic of immovability is the perfection of wisdom, because the characteristics of the perfection of wisdom cease.",
        "source": "T25n1509_100:0751c14_2"
    },
    {
        "source_sentence": "若不念是般若，或迷悶無所趣向，有戲論者，在大眾中則生怖畏；",
        "translation": "If someone is not mindful of this prajñā, or if they are confused and do not have anything to aspire to. Someone who engages in conceptual elaborations will become frightened when they are in the midst of the masses.",
        "source": "T25n1509_100:0751c15_3"
    },
    {
        "source_sentence": "或於涅槃中不了故，亦生怖畏。",
        "translation": "Because they might not understand nirvāṇa, they'll also become frightened.",
        "source": "T25n1509_100:0751c17_4"
    },
    {
        "source_sentence": "是故說「無怖畏相是般若波羅蜜」。",
        "translation": "That's why it's said, The absence of fearlessness is the perfection of wisdom.",
        "source": "T25n1509_100:0751c18_5"
    },
    {
        "source_sentence": "是人雖不決定取諸法相，而深入法性故，於大眾中有難論諸相者，心無所畏，",
        "translation": "Because even though they do not definitively grasp the characteristics of things, yet penetrate deeply into the essence of things. Those in the assembly who have difficulty discussing characteristics have no fear in their minds.",
        "source": "T25n1509_100:0751c18_6"
    },
    {
        "source_sentence": "於諸法得無相故。",
        "translation": "It's because they attain the marklessness of all dharmas.",
        "source": "T25n1509_100:0751c20_7"
    },
    {
        "source_sentence": "又入無生法忍時，知一切法不可得，於是中亦無所畏。",
        "translation": "Also, when they enter the forbearance of the nonarising of all dharmas, they know that all dharmas are unobtainable, and there's no fear in them.",
        "source": "T25n1509_100:0751c21_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_100:0751c22_9"
    },
    {
        "source_sentence": "是菩薩善通達一切法故。",
        "translation": "It's because the bodhisattva well understands all dharmas.",
        "source": "T25n1509_100:0751c22_10"
    },
    {
        "source_sentence": "復次，一切法一相，所謂性空；",
        "translation": "“Furthermore, all things have one characteristic, which is emptiness by nature.",
        "source": "T25n1509_100:0751c23_11"
    },
    {
        "source_sentence": "是故般若波羅蜜隨一切法故，亦性空一味。",
        "translation": "Therefore, because the prajñāpāramitā follows all dharmas, it also has the single flavor of emptiness in its nature.",
        "source": "T25n1509_100:0751c24_12"
    },
    {
        "source_sentence": "問曰：上已說諸法平等，今何以更說一味？",
        "translation": "Q: The above has explained the equality of all dharmas, so why is it that we're talking about one flavor now?",
        "source": "T25n1509_100:0751c25_13"
    },
    {
        "source_sentence": "答曰：空，或時有味，或時無味。",
        "translation": "Answer: Emptiness sometimes has taste and sometimes no taste.",
        "source": "T25n1509_100:0751c26_14"
    },
    {
        "source_sentence": "若行者為諸見取相分別好醜籌量，爾時得是諸法平等空心，大歡喜故名為味。",
        "translation": "If a practitioner discerns the characteristics of views and apprehends what's good and ugly for their discernment, then he attains the equality of emptiness in all dharmas, which is called taste because he's greatly joyful.",
        "source": "T25n1509_100:0751c26_15"
    },
    {
        "source_sentence": "如人為熱渴所逼，得清冷水，以為真味無比，隨時用故名味。",
        "translation": "It's like a person who is tormented by fever and thirst and obtains clear, cool water because its true taste is unsurpassed, and it's called taste because it's used at any time.",
        "source": "T25n1509_100:0751c28_16"
    },
    {
        "source_sentence": "真實畢竟空，則無味、不味。",
        "translation": "When reality is ultimately empty, there's no taste or tastelessness.",
        "source": "T25n1509_100:0752a01_17"
    },
    {
        "source_sentence": "復次，一味者，菩薩行般若波羅蜜時，所緣、所觀皆為一味；",
        "translation": "“Furthermore, ‘one flavor’ means that when enlightening beings practice transcendent wisdom, the supporting and contemplating objects are all one flavor.",
        "source": "T25n1509_100:0752a01_18"
    },
    {
        "source_sentence": "空智力大故，餘法皆隨而為空。",
        "translation": "Because the power of knowledge regarding emptiness is great, all other dharmas follow it and become emptiness.",
        "source": "T25n1509_100:0752a03_19"
    },
    {
        "source_sentence": "譬如煮石蜜欲熟時，雖異物和合，皆為石蜜。",
        "translation": "It's like boiling rock honey and wanting to ripen it, but even though it's mixed with different things, they all become rock honey.",
        "source": "T25n1509_100:0752a04_0"
    },
    {
        "source_sentence": "又如大海，百川歸之，皆為一味，所謂畢竟空味。",
        "translation": "It's also like the great ocean where a hundred rivers return to it, all of which are one flavor, which is called the ultimate taste of emptiness.",
        "source": "T25n1509_100:0752a05_1"
    },
    {
        "source_sentence": "色等諸法亦如是，凡夫心中各各別異；",
        "translation": "The same applies to such factors as matter: the awarenesses of worldlings are each different.",
        "source": "T25n1509_100:0752a06_2"
    },
    {
        "source_sentence": "入般若波羅蜜中，皆為一味。",
        "translation": "Entering into the perfection of wisdom, they're all one flavor.",
        "source": "T25n1509_100:0752a07_3"
    },
    {
        "source_sentence": "邊名為相，若有、若無。",
        "translation": "The extremes are called characteristic marks, whether present or nonexistent.",
        "source": "T25n1509_100:0752a07_4"
    },
    {
        "source_sentence": "實觀色等諸法非有非無故無相，無相即是無邊；",
        "translation": "They really observe that form, and so on, are neither existent nor nonexistent because they lack characteristics. The absence of characteristics means limitless.",
        "source": "T25n1509_100:0752a08_5"
    },
    {
        "source_sentence": "觀是已，即是無邊般若波羅蜜。",
        "translation": "After observing this, that's the limitless prajñāpāramitā.",
        "source": "T25n1509_100:0752a09_6"
    },
    {
        "source_sentence": "復次，有人言：邊有二種：常邊、斷邊，世間邊、涅槃邊，惡邊、善邊等。",
        "translation": "“Furthermore, some people state: There are two kinds of extremes: the extreme of permanence and the extreme of annihilation; the extreme of the world and the extreme of nirvana; the extreme of woefulness and the extreme of bliss.",
        "source": "T25n1509_100:0752a10_7"
    },
    {
        "source_sentence": "此中無如是等諸邊故，名為無邊般若波羅蜜。",
        "translation": "Because there are no such extremes here, it's called the limitless prajñāpāramitā.",
        "source": "T25n1509_100:0752a11_8"
    },
    {
        "source_sentence": "復次，有人言：邊名前際、後際。",
        "translation": "Furthermore, some people state: The limit is called ‘by means of names’ and the limit follows.",
        "source": "T25n1509_100:0752a12_9"
    },
    {
        "source_sentence": "世間無始故無前際，入無餘涅槃故有前際；",
        "translation": "Because the world has no beginning, there is no prior end; because one enters nirvana without remainder, there is a prior end.",
        "source": "T25n1509_100:0752a13_10"
    },
    {
        "source_sentence": "不復更出故無後際。",
        "translation": "Because it doesn't come out again, there's no subsequent time.",
        "source": "T25n1509_100:0752a14_11"
    },
    {
        "source_sentence": "如是等分別諸邊，著世間故畏涅槃。",
        "translation": "Such kinds of discriminating extremes are attached to the world and therefore fear nirvāṇa.",
        "source": "T25n1509_100:0752a14_12"
    },
    {
        "source_sentence": "是故般若波羅蜜中無是一切邊，但聞諸法實相無入無出。",
        "translation": "Therefore, there are no all the extremes in the perfection of wisdom, but they hear the true characteristics of dharmas without entering or leaving them.",
        "source": "T25n1509_100:0752a15_13"
    },
    {
        "source_sentence": "問曰：諸法平等、諸法離皆是無邊，何以復別說？",
        "translation": "Q: The equality of dharmas and the separation of dharmas are both limitless, so why is it explained separately?",
        "source": "T25n1509_100:0752a17_14"
    },
    {
        "source_sentence": "答曰：有人知諸法平等、知諸法離，則不須說；",
        "translation": "Answer: Someone who knows the equality of all things and knows the separation of all things need no explanation.",
        "source": "T25n1509_100:0752a18_15"
    },
    {
        "source_sentence": "若有人取相，著是一味，故說無邊。",
        "translation": "If someone apprehends characteristics and clings to one taste, they're therefore said to have no limit.",
        "source": "T25n1509_100:0752a19_16"
    },
    {
        "source_sentence": "曇無竭非但為薩陀波崙故說，薩陀波崙亦不但自為故問，但為眾生有種種心、種種行故，",
        "translation": "Dharmagupta doesn't explain it just for the sake of Sadāprarudita, and Sadāprarudita doesn't ask questions for his own sake but for the sake of sentient beings who have various minds and various actions.",
        "source": "T25n1509_100:0752a20_17"
    },
    {
        "source_sentence": "於般若波羅蜜相中略說。",
        "translation": "It's briefly explained in the aspect of prajñā-pāramitā.",
        "source": "T25n1509_100:0752a22_18"
    },
    {
        "source_sentence": "無生、無滅，如先種種因緣「破生滅」中說。",
        "translation": "The absence of arising and the absence of cessation are as explained in the previous section on destroying arising and ceasing by various causes and conditions.",
        "source": "T25n1509_100:0752a23_0"
    },
    {
        "source_sentence": "虛空無邊，如摩訶衍虛空譬喻中說。",
        "translation": "Space has no limit, as explained in the Mahāyāna metaphor of space.",
        "source": "T25n1509_100:0752a23_1"
    },
    {
        "source_sentence": "大海水無邊、須彌莊嚴，先未說故，今當略說。",
        "translation": "Because the great water of the ocean is boundless and adorned like Mount Sumeru, it hasn't been explained before, so I will explain it briefly.",
        "source": "T25n1509_100:0752a24_2"
    },
    {
        "source_sentence": "問曰：虛空，無為、常法故無得其邊者，可言無邊。",
        "translation": "Q: Space has no limit because it's unconditioned and eternal dharmas, so it can be called limitless.",
        "source": "T25n1509_100:0752a25_3"
    },
    {
        "source_sentence": "大海水在四天中，繞須彌山，有由旬數量，有人能渡，何以言無邊？",
        "translation": "The great water of the great ocean is in the middle of the four heavens, surrounded by Mount Sumeru, which is as many yojanas in number as there are people who can cross. Why do you say it has no limit?",
        "source": "T25n1509_100:0752a26_4"
    },
    {
        "source_sentence": "答曰：無邊有二種：一者、實無邊，二者、人不能到故無邊。",
        "translation": "Answer: There are two kinds of limitlessness: 1. real limitlessness and 2. limitless because people can't reach it.",
        "source": "T25n1509_100:0752a28_5"
    },
    {
        "source_sentence": "海亦有二種：一者、可渡；",
        "translation": "There are also two kinds of seas:",
        "source": "T25n1509_100:0752a29_6"
    },
    {
        "source_sentence": "二者、繞須彌山在九寶山裏，廣八萬二千由旬，世間人不能得邊，故言無邊。",
        "translation": "The second is that the circumference of Mount Sumeru lies within a mountain made of the nine treasures, eighty-thousand yojanas wide and eighty-two thousand yojanas in width. Because worldly people cannot know the limits [of this circumference], they therefore say it has no limit.",
        "source": "T25n1509_100:0752b01_7"
    },
    {
        "source_sentence": "如小海，船力可渡；",
        "translation": "It is like a small ocean that can be crossed by boat power.",
        "source": "T25n1509_100:0752b03_8"
    },
    {
        "source_sentence": "大海水，船力不可渡，唯有神通者能度。",
        "translation": "The great water of the great ocean cannot be crossed by boat; only those with supernatural powers can cross it.",
        "source": "T25n1509_100:0752b03_9"
    },
    {
        "source_sentence": "如外道凡夫能生禪定船，度欲界、色界海；",
        "translation": "Just as non-Buddhist worldlings can build a boat of meditation and cross the sea of the realm of sexual passion and the one of form.",
        "source": "T25n1509_100:0752b04_10"
    },
    {
        "source_sentence": "無色界如大海，深廣則不能渡，以不能破我心故。",
        "translation": "The formless realm is like a great ocean that's too deep and too wide to cross because it can't break through the self and mind.",
        "source": "T25n1509_100:0752b05_11"
    },
    {
        "source_sentence": "諸賢聖人智慧、禪定翅力，破諸法邪相、得實相，故能度，是故說大海譬喻。",
        "translation": "Good men and sages have wisdom, the power of the wing of meditation, which refutes the mistaken characteristics of dharmas and attains their true characteristics, so they can save them; therefore, they're described as a metaphor for the ocean.",
        "source": "T25n1509_100:0752b07_12"
    },
    {
        "source_sentence": "問曰：須彌山一色，何以言莊嚴？",
        "translation": "Q: What's the reason it's called adorned with a single color like Mount Sumeru?",
        "source": "T25n1509_100:0752b08_13"
    },
    {
        "source_sentence": "答曰：外書說須彌山一色，純是黃金。",
        "translation": "Answer: Non-Buddhist books say that the one color of Mount Sumeru is pure gold.",
        "source": "T25n1509_100:0752b09_14"
    },
    {
        "source_sentence": "六足阿毘曇中說：須彌山四邊，各以一寶成，金、銀、頗梨、琉璃莊嚴。",
        "translation": "In the six-legged abhidharma, it's said that each of the four sides of Mount Sumeru are made of one treasure, adorned with gold, silver, pāri, and lapis lazuli.",
        "source": "T25n1509_100:0752b10_15"
    },
    {
        "source_sentence": "若諸鳥隨所至方，各同其色。",
        "translation": "If the birds were to go wherever they went, each would be the same color.",
        "source": "T25n1509_100:0752b11_16"
    },
    {
        "source_sentence": "難陀、婆難陀龍王兄弟，以身圍繞七匝。",
        "translation": "Nanda and the dragon kings Upananda and Upananda surrounded him seven times with their bodies.",
        "source": "T25n1509_100:0752b12_17"
    },
    {
        "source_sentence": "山頂有三十三天宮，其城七重，名為憙見，九百九十九門，一一門邊皆有十六青衣大力鬼神守護。",
        "translation": "At the top of the mountain is the palace of the thirty-three gods. The city consists of seven walls, which are called Vaiśravaṇa and have nine hundred and ninety-nine gates with each gate surrounded by sixteen blue-clad greatly powerful guardian spirits.",
        "source": "T25n1509_100:0752b13_18"
    },
    {
        "source_sentence": "城中高處作殿，名曰最勝，四邊有四大園。",
        "translation": "A high place in the city is made into a hall called the most superior, with four large parks on each of its four sides.",
        "source": "T25n1509_100:0752b15_19"
    },
    {
        "source_sentence": "四天王在四邊，有山名遊乾陀，各高四萬二千由旬，四天王治其上。",
        "translation": "On each of the four sides of the mountain is a mountain called Yugaṃdhara, forty-two thousand yojanas in height. The four guardian gods rule over it.",
        "source": "T25n1509_100:0752b16_20"
    },
    {
        "source_sentence": "四大海水，諸阿修羅宮及諸龍王宮殿；",
        "translation": "The great waters of the four great oceans, the palaces of the asuras and the palaces of the dragon kings.",
        "source": "T25n1509_100:0752b18_21"
    },
    {
        "source_sentence": "遊乾陀等九寶山，日月、五星、二十八宿及諸餘星圍繞莊嚴。",
        "translation": "He traveled to the nine treasured mountains of Gandhāra and so forth, surrounded by the sun, moons, five stars, twenty-eight constellations, and other stars.",
        "source": "T25n1509_100:0752b19_22"
    },
    {
        "source_sentence": "如是等種種雜飾以為莊嚴，視之無厭。",
        "translation": "Such kinds of various decorations are adorned, and they don't tire of looking at them.",
        "source": "T25n1509_100:0752b20_23"
    },
    {
        "source_sentence": "般若波羅蜜亦如是。",
        "translation": "The prajñāpāramitā is likewise.",
        "source": "T25n1509_100:0752b21_24"
    },
    {
        "source_sentence": "六波羅蜜果報故，作轉輪王、梵、釋天王、淨居天王、大自在天——如是等果報，",
        "translation": "Because of the fruit of the six perfections, they become wheel-turning kings, Brahmā, Śakra Devānām-Indra, Śakra Devānām-Indra, Śakra Devānām-Indra, and Maheśvara Devānām-Indra-and so forth.",
        "source": "T25n1509_100:0752b22_25"
    },
    {
        "source_sentence": "行般若波羅蜜未具足時，受此果報莊嚴。",
        "translation": "When they practice the perfection of prajñā-pāramitā, they're not yet fully endowed, and they'll receive this fruitful adornment.",
        "source": "T25n1509_100:0752b23_26"
    },
    {
        "source_sentence": "般若波羅蜜具足時，則有須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道、阿毘跋致菩薩、諸佛道果莊嚴。",
        "translation": "When the perfection of wisdom is complete, then there's the fruit of stream entry, the fruit of once-returning, the fruit of non-returning, the fruit of arhatship, the path of the pratyekabuddhas, the bodhisattva abhidharma, and the adornment of the fruit of the buddha paths.",
        "source": "T25n1509_100:0752b24_27"
    },
    {
        "source_sentence": "如須彌山，上、下皆有莊嚴。",
        "translation": "It's like Mount Sumeru, which has an adornment above and below.",
        "source": "T25n1509_100:0752b27_28"
    },
    {
        "source_sentence": "般若波羅蜜莊嚴亦爾，未具足時，諸天王等莊嚴；",
        "translation": "The adornment of the transcendent wisdom is also like this: when it is not perfect, the celestial kings are equally adorned.",
        "source": "T25n1509_100:0752b27_29"
    },
    {
        "source_sentence": "具足已，諸道果莊嚴。",
        "translation": "Having fulfilled them, they are adorned with the fruits of the paths.",
        "source": "T25n1509_100:0752b29_30"
    },
    {
        "source_sentence": "如須彌山者，劫初立時，四邊大風吹，聚地之精味，積為須彌山；",
        "translation": "“It is like the polar mountain”: At the beginning of the cosmic age, a great wind blows in all four directions and the earth’s energy and flavor accumulates into Mount Sumeru.",
        "source": "T25n1509_100:0752b29_31"
    },
    {
        "source_sentence": "更有風吹，令堅而成寶。",
        "translation": "There's another wind blowing it, making it firm and becomes a treasure.",
        "source": "T25n1509_100:0752c02_32"
    },
    {
        "source_sentence": "般若波羅蜜亦如是，一切善法中第一堅實牢固和合以為般若。",
        "translation": "The prajñāpāramitā is likewise, and the first of all good qualities that's resolute and firmly combines it into prajñā.",
        "source": "T25n1509_100:0752c02_33"
    },
    {
        "source_sentence": "如須彌山，四邊大風吹、大海水波所不能動；",
        "translation": "It is like the polar mountain, whose four sides are blown by a great wind and cannot be moved by the waves of water in the great ocean.",
        "source": "T25n1509_100:0752c04_34"
    },
    {
        "source_sentence": "般若波羅蜜亦如是，邪見、外道、戲論及諸魔民所不能動。",
        "translation": "The perfection of wisdom is likewise, and it can't be moved by wrong views, non-Buddhists, conceptual elaborations, or the people of Māra.",
        "source": "T25n1509_100:0752c05_35"
    },
    {
        "source_sentence": "如須彌山頂四園，諸天到者，受種種樂；",
        "translation": "It is like the four parks at the top of Mount Sumeru, where heavenly beings experience various pleasures when they arrive.",
        "source": "T25n1509_100:0752c06_36"
    },
    {
        "source_sentence": "般若亦如是，行者能登般若頂，到四禪等諸定園中，受種種樂。",
        "translation": "Prajñā is likewise, for practitioners can ascend to the top of prajñā and go to the fourth dhyāna and other parks of concentration and experience various kinds of happiness.",
        "source": "T25n1509_100:0752c07_37"
    },
    {
        "source_sentence": "復次，有人言：須彌山，眾鳥到者皆同一色；",
        "translation": "“Furthermore, some people say that on the polar mountain all the birds that fly there are of the same color.",
        "source": "T25n1509_100:0752c09_38"
    },
    {
        "source_sentence": "般若波羅蜜亦如是，諸法入中皆同一相，所謂無相。",
        "translation": "The prajñāpāramitā is likewise, in which all the dharmas that enter into it have the same characteristics, which are called formless.",
        "source": "T25n1509_100:0752c10_39"
    },
    {
        "source_sentence": "如虛空無分別者，虛空無分別是內是外、是遠是近、是長是短、是淨是不淨等；",
        "translation": "Just as space is nondiscriminating, space is nondiscriminating whether internal or external, distant or near, long or short, pure or impure.",
        "source": "T25n1509_100:0752c11_40"
    },
    {
        "source_sentence": "般若波羅蜜亦如是，諸法入般若中，亦無內外、善不善等分別。",
        "translation": "The prajñāpāramitā is likewise, in which all dharmas enter into prajñā without internal or external distinctions such as good and unskillful.",
        "source": "T25n1509_100:0752c13_41"
    },
    {
        "source_sentence": "如五眾無邊者，五眾常遍滿世間；",
        "translation": "“Just as the fivefold assembly is boundless, so the fivefold assemblies always fill the world.",
        "source": "T25n1509_100:0752c14_42"
    },
    {
        "source_sentence": "般若波羅蜜亦如是，不遠離於五眾，五眾實相即是般若波羅蜜。",
        "translation": "The prajñāpāramitā is likewise, not far removed from the five congregations, and the true characteristics of the five congregations are the prajñāpāramitā.",
        "source": "T25n1509_100:0752c15_43"
    },
    {
        "source_sentence": "復次，如色等法，分析破裂，乃至微塵則無方，無方故無邊；",
        "translation": "“Furthermore, just as such things as form are analyzed and broken apart, so also atoms have no bounds. Because they have no bounds, they have no limit.",
        "source": "T25n1509_100:0752c17_0"
    },
    {
        "source_sentence": "無色法，無形故無此彼，無此彼故無邊。",
        "translation": "Because formless dharmas lack form, there's no here and there, and because there's no here and there, they have no limit.",
        "source": "T25n1509_100:0752c18_1"
    },
    {
        "source_sentence": "般若波羅蜜亦如是，於一切法，分別色乃至微塵、分別無色法乃至一念中，",
        "translation": "The prajñāpāramitā is likewise: in all things, it discriminates form up to the smallest particle of form and discriminates formless things up to one thought.",
        "source": "T25n1509_100:0752c19_2"
    },
    {
        "source_sentence": "不見決定有常、樂、我、淨。",
        "translation": "They don't see that certainty has permanence, bliss, self, and purity.",
        "source": "T25n1509_100:0752c21_3"
    },
    {
        "source_sentence": "是故說色無邊故般若無邊。",
        "translation": "That's why it's said that form has no limit, so prajñā has no limit.",
        "source": "T25n1509_100:0752c21_4"
    },
    {
        "source_sentence": "乃至虛空六種，亦如是。",
        "translation": "It's likewise with the six kinds of space.",
        "source": "T25n1509_100:0752c22_5"
    },
    {
        "source_sentence": "如金鋼等者，如天王所執金鋼，無憎無愛，隨所用處，無不摧碎；",
        "translation": "It is like the case of a heavenly king holding a golden iron, which is neither desirable nor undesirable. Wherever he uses it, no iron will not break apart.",
        "source": "T25n1509_100:0752c22_6"
    },
    {
        "source_sentence": "諸佛一切智前心，此心中三昧能斷一切結使煩惱顛倒及習皆滅，故名為如金鋼。",
        "translation": "The buddhas' omniscience precedes mind, and this mind samādhi can cut all the bonds that cause afflictions, errors, and accumulations to cease, so it's called like a golden steel.",
        "source": "T25n1509_100:0752c24_7"
    },
    {
        "source_sentence": "如金鋼三昧相應智慧觀一切法皆平等，般若波羅蜜觀諸法平等亦如是。",
        "translation": "Just as the wisdom associated with the samādhi of the golden steel observes that all dharmas are equal, so does the prajñāpāramitā observe that all dharmas are equal.",
        "source": "T25n1509_100:0752c26_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_100:0752c28_9"
    },
    {
        "source_sentence": "般若先觀諸法平等，然後得是三昧。",
        "translation": "Prajñā first observes the equality of dharmas and then attains this concentration.",
        "source": "T25n1509_100:0752c28_10"
    },
    {
        "source_sentence": "諸法無分別者，世間凡夫煩惱力故，種種分別諸法；",
        "translation": "“Factors are nondiscriminating”: Because of the power of defilement, worldly worldlings differentiate all kinds of factors.",
        "source": "T25n1509_100:0752c29_11"
    },
    {
        "source_sentence": "得諸法實相，則皆破壞、變異。",
        "translation": "When they attain the true characteristics of dharmas, they all break down and change.",
        "source": "T25n1509_100:0753a01_12"
    },
    {
        "source_sentence": "是故聖人得般若波羅蜜，不隨憶想分別諸法，入空、無相、無作三昧中；",
        "translation": "That is why the holy persons attain the perfection of wisdom. They do not discriminate things according to recollection, and enter emptiness, signlessness, and unmanifesting concentration.",
        "source": "T25n1509_100:0753a02_13"
    },
    {
        "source_sentence": "若得諸法變異時，則不憂愁，以先來不分別取諸法相故。",
        "translation": "If they attain the time when things change, then they won't be sad because they didn't discriminate and grasp the characteristics of things in the past.",
        "source": "T25n1509_100:0753a03_14"
    },
    {
        "source_sentence": "諸法性不可得者，一切法皆從因緣和合生，無有無因緣、若少因緣而起者；",
        "translation": "“The essence of all factors is ungraspable”: All factors arise from the conjunction of causes and conditions.",
        "source": "T25n1509_100:0753a05_15"
    },
    {
        "source_sentence": "若從因緣生，則無自性。",
        "translation": "If it were to arise from causes and conditions, there would be no self-nature.",
        "source": "T25n1509_100:0753a06_16"
    },
    {
        "source_sentence": "性者，名本有決定實事。",
        "translation": "“Nature”: Names are the absolutely real entities that exist in the past.",
        "source": "T25n1509_100:0753a07_17"
    },
    {
        "source_sentence": "若性從因緣和合邊生，當知未和合時則無；",
        "translation": "If its nature were to arise from the conjunction of causes and conditions, it should be known that at the moment of nonconjunction there would not be.",
        "source": "T25n1509_100:0753a07_18"
    },
    {
        "source_sentence": "若先無今從因緣和合有者，則知無性。",
        "translation": "If it didn't exist in the past and now exists from the conjunction of causes and conditions, then we know that it has no nature.",
        "source": "T25n1509_100:0753a09_0"
    },
    {
        "source_sentence": "若從因緣而生性者，性即是作法。",
        "translation": "If it's the nature that arises from causes and conditions, the nature is the created dharma.",
        "source": "T25n1509_100:0753a09_1"
    },
    {
        "source_sentence": "性名不相待、不相因，常應獨有；",
        "translation": "Their natures are said to be non-associated and non-associated causes, which should always exist alone.",
        "source": "T25n1509_100:0753a10_2"
    },
    {
        "source_sentence": "如是有為法則無。",
        "translation": "Thus, the conditioned dharmas are nonexistent.",
        "source": "T25n1509_100:0753a11_3"
    },
    {
        "source_sentence": "是故言「一切諸法性不可得，般若波羅蜜性亦爾」。",
        "translation": "Therefore, it's said, All dharmas are unobtainable in nature, and so is the nature of prajñā-pāramitā.",
        "source": "T25n1509_100:0753a11_4"
    },
    {
        "source_sentence": "諸法無所有等故者，諸法性不可得故，眾因緣亦不可得；",
        "translation": "“Factors have no existence”: Because the natures of factors are ungraspable, so are the causes and conditions.",
        "source": "T25n1509_100:0753a13_5"
    },
    {
        "source_sentence": "眾因緣亦不可得故，皆是無所有；",
        "translation": "Because all causes and conditions are also ungraspable, they all have no existence.",
        "source": "T25n1509_100:0753a14_6"
    },
    {
        "source_sentence": "入無所有中故，則皆平等。",
        "translation": "Because they enter the sphere of nothingness, they're all equal.",
        "source": "T25n1509_100:0753a15_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_100:0753a15_8"
    },
    {
        "source_sentence": "有，故有分別；",
        "translation": "Because of existence, there is distinction.",
        "source": "T25n1509_100:0753a16_9"
    },
    {
        "source_sentence": "無，故無分別。",
        "translation": "Because they are nonexistent, there is no discrimination.",
        "source": "T25n1509_100:0753a16_10"
    },
    {
        "source_sentence": "如草香、栴檀香，燒時有分別，滅時無分別。",
        "translation": "It's like the fragrance of grass and sandalwood, which have distinctions when burned and no distinctions when extinguished.",
        "source": "T25n1509_100:0753a16_11"
    },
    {
        "source_sentence": "諸法無作者，眾生空、法空故，則皆無作。",
        "translation": "All dharmas lack author, and because sentient beings are empty and dharmas are empty, they all lack author.",
        "source": "T25n1509_100:0753a17_12"
    },
    {
        "source_sentence": "眾生所作者，所謂十善、十不善等。",
        "translation": "What's created by sentient beings are called the ten good and ten unskillful [factors].",
        "source": "T25n1509_100:0753a18_13"
    },
    {
        "source_sentence": "法作者，所謂火然、水流、風動、識能識，智能知——如是法，各各自有力。",
        "translation": "The author of the teaching is so-called that fire, water, wind, and consciousness can know it intelligently - each has a powerful teaching like this.",
        "source": "T25n1509_100:0753a19_14"
    },
    {
        "source_sentence": "無眾生乃至無知者、見者，無色等乃至一切種智，先已破。",
        "translation": "The absence of sentient beings up to the absence of knowables and views, formlessness and so forth up to all kinds of cognition have been previously refuted.",
        "source": "T25n1509_100:0753a20_15"
    },
    {
        "source_sentence": "破眾生故無作者，破法故無所作；",
        "translation": "Because of destroying sentient beings, there is no maker; because of destroying the doctrine, nothing is done.",
        "source": "T25n1509_100:0753a22_16"
    },
    {
        "source_sentence": "但凡夫人顛倒覆故言：「我有所作。」",
        "translation": "But ordinary people are mistakenly covered up and say, I've done something.",
        "source": "T25n1509_100:0753a23_17"
    },
    {
        "source_sentence": "諸法不可思議者，色等一切法不得決定——若常、若無常，若苦、若樂，",
        "translation": "“Factors are inconceivable”: All things, such as form and so on, cannot be certain - whether permanent or impermanent, painful or pleasant.",
        "source": "T25n1509_100:0753a23_18"
    },
    {
        "source_sentence": "若實、若空，若我、若無我，若生滅、若不生滅，若寂滅、若不寂滅，",
        "translation": "If it’s real, if it’s empty, if it’s self or selfless, if it arises or doesn’t arise, and if it ceases or doesn’t cease,",
        "source": "T25n1509_100:0753a25_19"
    },
    {
        "source_sentence": "若離、若不離，若有、若無等種種門分別，亦如是不可得思議。",
        "translation": "Whether separated or not separated, whether existent or nonexistent, and so forth, the various kinds of discrimination are likewise inconceivable.",
        "source": "T25n1509_100:0753a26_20"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_100:0753a28_21"
    },
    {
        "source_sentence": "是法皆從心中憶想分別生，亦不可決定；",
        "translation": "These dharmas all arise from memory, ideation, and discrimination in the mind. They cannot be determined.",
        "source": "T25n1509_100:0753a28_22"
    },
    {
        "source_sentence": "一切法實性，皆過心、心數法、出名字語言道。",
        "translation": "The true nature of all dharmas is beyond mind, mental factors, and the paths that give rise to names and words.",
        "source": "T25n1509_100:0753a29_23"
    },
    {
        "source_sentence": "如前品說：「一切諸法平等，一切賢聖不能行、不能到。」",
        "translation": "As the previous section said, All dharmas are equal, and all good men and sages can't practice or reach them.",
        "source": "T25n1509_100:0753b01_24"
    },
    {
        "source_sentence": "是故不可思議。",
        "translation": "Therefore, it's inconceivable.",
        "source": "T25n1509_100:0753b02_25"
    },
    {
        "source_sentence": "般若波羅蜜亦爾，觀是法故生。",
        "translation": "The prajñāpāramitā is likewise, which arises because of observing these things.",
        "source": "T25n1509_100:0753b03_0"
    },
    {
        "source_sentence": "是時，薩陀波崙即於坐上得諸三昧。",
        "translation": "At that point, Sadāprarudita then attained the samādhis while sitting there.",
        "source": "T25n1509_100:0753b03_1"
    },
    {
        "source_sentence": "問曰：薩陀波崙先已知諸法空相，今種種勤苦，住立七歲，見曇無竭得何等利益？",
        "translation": "Q: Sadāprarudita had previously known the characteristics of emptiness in all dharmas, but now he's undergoing various kinds of suffering and abiding for seven years, so what benefit does he get from seeing Dharmagupta?",
        "source": "T25n1509_100:0753b04_2"
    },
    {
        "source_sentence": "答曰：薩陀波崙先見諸佛，得諸三昧，貴重般若波羅蜜生著相；",
        "translation": "Answer: When Sadāprarudita saw the buddhas first, he attained samādhi and esteemed the transcendent wisdom.",
        "source": "T25n1509_100:0753b06_3"
    },
    {
        "source_sentence": "今曇無竭七歲從定起，為說般若破其著心，一切法性自空，非般若波羅蜜令其空。",
        "translation": "Now, Dharmagupta arose from concentration at the age of seven years old and taught prajñā to break through his mind's attachment, explaining that all dharmas are self-empty in their own right, but it's not the prajñāpāramitā that makes them empty.",
        "source": "T25n1509_100:0753b08_0"
    },
    {
        "source_sentence": "是故說：「諸法等故，般若波羅蜜等；",
        "translation": "That is why it is said: Because all factors are equal, such [things] as prajñā-pāramitā and so on.",
        "source": "T25n1509_100:0753b10_0"
    },
    {
        "source_sentence": "諸法離相，乃至諸法不可思議故，般若不可思議。」",
        "translation": "Because the dharmas are free of characteristics and even the dharmas are inconceivable, prajñā is inconceivable.",
        "source": "T25n1509_100:0753b10_1"
    },
    {
        "source_sentence": "不令輕賤餘法、貴重般若。",
        "translation": "They won't despise the other teachings or value prajñāpāramitā.",
        "source": "T25n1509_100:0753b12_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_100:0753b12_1"
    },
    {
        "source_sentence": "不令因般若故更生垢著。",
        "translation": "They won't allow defiled attachment to arise again because of prajñā.",
        "source": "T25n1509_100:0753b12_2"
    },
    {
        "source_sentence": "般若波羅蜜雖畢竟清淨，多所饒益，復不可取相而生著心；",
        "translation": "Although the transcendent wisdom of liberation is ultimately pure, it often brings benefit to sentient beings. They do not cling to characteristics and give rise to thoughts of attachment.",
        "source": "T25n1509_100:0753b13_3"
    },
    {
        "source_sentence": "如熱金雖好，不可手捉。",
        "translation": "It's like hot gold that can't be grasped by hand even though it's good.",
        "source": "T25n1509_100:0753b15_0"
    },
    {
        "source_sentence": "薩陀波崙得是教化，斷般若中著心，即得諸法等諸三昧。",
        "translation": "Sadāprarudita attains this teaching and stops attachment to the mind in prajñā, which is when he attains the samādhi of such things as dharmas.",
        "source": "T25n1509_100:0753b15_1"
    },
    {
        "source_sentence": "句句解說，散亂心中，但有智慧，不名三昧；",
        "translation": "Their explanations and explanations are scattered in their minds but they have wisdom, which is not called concentration.",
        "source": "T25n1509_100:0753b16_2"
    },
    {
        "source_sentence": "今從師聞已，一心思惟，名為三昧，攝心不散，智慧變成三昧。",
        "translation": "Now, after hearing it from the teacher, he singlemindedly contemplates it as samādhi, which is called gathering his mind without dissipation and transforming wisdom into samādhi.",
        "source": "T25n1509_100:0753b17_3"
    },
    {
        "source_sentence": "如風中燈不能照明，在靜室閉門，明乃遍照。",
        "translation": "It's like a lamp in the wind that can't be illuminated, and when it closes its door in a quiet room, the light shines everywhere.",
        "source": "T25n1509_100:0753b19_4"
    },
    {
        "source_sentence": "先已欲界心散亂故，智慧力未成就；",
        "translation": "Because their minds had previously been scattered in the realm of desire, they did not perfect the power knowledge and wisdom.",
        "source": "T25n1509_100:0753b20_5"
    },
    {
        "source_sentence": "今入攝心中，所聞諸法皆名三昧，能破諸煩惱等及魔人民。",
        "translation": "Now, when he enters the collected mind, all the things he hears are called samādhi that can break through the afflictions and other demonic people.",
        "source": "T25n1509_100:0753b21_6"
    },
    {
        "source_sentence": "如水，寒風未至，未成為氷，則無堅用；",
        "translation": "Good man, it is like water that when the cold wind has not yet blown and does not form ice, there is no firmness or function.",
        "source": "T25n1509_100:0753b22_7"
    },
    {
        "source_sentence": "若成凍氷，能有所蹈。",
        "translation": "If they form frozen ice, they can tread on it.",
        "source": "T25n1509_100:0753b23_8"
    },
    {
        "source_sentence": "得如是等六百萬三昧門：薩陀波崙得聞曇無竭所說法，得諸法中大智慧明，",
        "translation": "Attaining six million such samādhis, Sadāprarudita heard the Dharma taught by Dharmagupta and attained great wisdom and insight in all things.",
        "source": "T25n1509_100:0753b24_9"
    },
    {
        "source_sentence": "所謂種種諸法實相門。",
        "translation": "It's called the gate of the true characteristics of various dharmas.",
        "source": "T25n1509_100:0753b25_10"
    },
    {
        "source_sentence": "諸法平等——平等是智慧，入薩陀波崙禪定心中，變為三昧。",
        "translation": "The equality of all dharmas - equality is wisdom, which enters the mind of Sadāprarudita's meditation and transforms into concentration.",
        "source": "T25n1509_100:0753b26_11"
    },
    {
        "source_sentence": "今欲說三昧、智慧今世後世果報故，爾時，佛告須菩提：「如我今在大眾中說般若，",
        "translation": "It was then that the Buddha said to Subhūti, Just as I now teach prajñā in the great assembly,",
        "source": "T25n1509_100:0753b27_12"
    },
    {
        "source_sentence": "以是相、以是像貌、以是名字說般若；",
        "translation": "He teaches prajñā with these characteristics, these images, and these names.",
        "source": "T25n1509_100:0753b29_13"
    },
    {
        "source_sentence": "薩陀波崙從曇無竭得是三昧，於三昧中見十方佛在大眾中說般若亦如是。",
        "translation": "Sadāprarudita attains this concentration from Dharmagupta, and in that concentration he sees the buddhas of the ten directions teaching prajñā in the masses likewise.",
        "source": "T25n1509_100:0753c01_14"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_100:0753c03_15"
    },
    {
        "source_sentence": "薩陀波崙從是以後深愛樂法故，多集諸經，廣誦多聞。",
        "translation": "Because Sadāprarudita deeply loved the Dharma from then on, he collected many sūtras and recited them extensively so that they were well-versed.",
        "source": "T25n1509_100:0753c03_16"
    },
    {
        "source_sentence": "如阿難，佛所說皆能持；",
        "translation": "“Just as Ānanda was able to preserve all the teachings taught by the Buddha.",
        "source": "T25n1509_100:0753c05_17"
    },
    {
        "source_sentence": "薩陀波崙亦如是，多聞、智慧不可思議，如大海水。",
        "translation": "So it is with Sadāprarudita, whose extensive learning and wisdom are inconceivable like the water of the great ocean.",
        "source": "T25n1509_100:0753c05_18"
    },
    {
        "source_sentence": "即於是世常不離佛。」",
        "translation": "That is, in this world, they always don't part from the Buddha.",
        "source": "T25n1509_100:0753c06_19"
    },
    {
        "source_sentence": "如是等名為今世果報。",
        "translation": "Such and such are called the results of present worldly rewards.",
        "source": "T25n1509_100:0753c07_20"
    },
    {
        "source_sentence": "捨身常生有佛國中，好修行念佛三昧故，乃至夢中初不離見佛。",
        "translation": "They abandon their bodies and are always born in a buddha-land where there's a Buddha, preferring to cultivate the concentration of mindfulness of the Buddha because they don't part from seeing the Buddha for the first time in a dream.",
        "source": "T25n1509_100:0753c07_21"
    },
    {
        "source_sentence": "地獄等諸難皆已永絕，隨意往生諸佛國土；",
        "translation": "The difficulties of hell and so on have all been permanently extinguished, being reborn in the buddha-lands as they wish.",
        "source": "T25n1509_100:0753c09_22"
    },
    {
        "source_sentence": "以其深入般若波羅蜜、集無量功德故，不隨業生。",
        "translation": "Because they enter deeply into the perfection of wisdom and accumulate measureless merit, they don't arise according to actions.",
        "source": "T25n1509_100:0753c10_23"
    },
    {
        "source_sentence": "薩陀波崙從一佛土至一佛土，供養諸佛，度脫眾生，集無量功德；",
        "translation": "Sadāprarudita went from one buddha-land to another, honoring the buddhas and liberating sentient beings by accumulating immeasurable virtue.",
        "source": "T25n1509_100:0753c11_24"
    },
    {
        "source_sentence": "譬如豪貴長者，從一會至一會，乃至今在大雷音佛所，淨修梵行。",
        "translation": "It's like a noble elder who goes from one assembly to another assembly and now purely cultivates the religious practice at the place of Great Thunder Buddha.",
        "source": "T25n1509_100:0753c13_25"
    },
    {
        "source_sentence": "若有欲求般若波羅蜜者，當如薩陀波崙菩薩，堅正一心，不可傾動！",
        "translation": "If someone wants to pursue the perfection of prajñā, they should be like Sadāprarudita Bodhisattva, who is resolute and single-minded, unshakable!",
        "source": "T25n1509_100:0753c14_26"
    },
    {
        "source_sentence": "是故當知般若波羅蜜因緣故，能成就一切功德者，諸菩薩等得般若者，",
        "translation": "Therefore, you should know that it's because of the causes and conditions for the perfection of prajñāpāramitā that they can accomplish all merits.",
        "source": "T25n1509_100:0753c16_27"
    },
    {
        "source_sentence": "貪欲瞋恚等在家罪垢、邪疑戲論等出家罪垢，皆悉除滅，得心清淨；",
        "translation": "The stain of the sins of sensual desire, anger, hatred, and so on, as well as the sins of layman’s transgressions such as greed, doubt, hypocrisy, and debauchery, are all extinguished, and one attains mental purity.",
        "source": "T25n1509_100:0753c18_28"
    },
    {
        "source_sentence": "心清淨故，得一切功德成就。",
        "translation": "Because their minds are pure, they attain the accomplishment of all merits.",
        "source": "T25n1509_100:0753c19_29"
    },
    {
        "source_sentence": "得一切種智者，所謂得阿耨多羅三藐三菩提。",
        "translation": "Attaining all kinds of cognition is called attaining unsurpassed, correct enlightenment.",
        "source": "T25n1509_100:0753c20_30"
    },
    {
        "source_sentence": "六波羅蜜者，從初地乃至七地得無生忍法；",
        "translation": "The six transcendent ways are acquiring the factor patience of nonorigination from the first stage up to the seventh stage.",
        "source": "T25n1509_100:0753c21_31"
    },
    {
        "source_sentence": "八地、九地、十地，是深入佛智慧，得一切種智，成就作佛。",
        "translation": "The eighth, ninth, and tenth stages are those that enter deeply into the Buddha's wisdom, attain all kinds of cognition, and accomplish becoming a buddha.",
        "source": "T25n1509_100:0753c22_32"
    },
    {
        "source_sentence": "於一切法得自在者，皆應受持，乃至華香、妓樂。",
        "translation": "Those who attain mastery over all dharmas should always accept and uphold it, even to the point where flowers, incense, and music are offered.",
        "source": "T25n1509_100:0753c23_33"
    },
    {
        "source_sentence": "須菩提雖常樂空行，佛共說般若，又得無諍三昧，故不應囑累。",
        "translation": "Although Suppositories of enlightenment always delight in the practice of emptiness, the Buddha teaches prajñā together with them, and they attain the absence of anger samādhi, so they shouldn't be instructed.",
        "source": "T25n1509_100:0753c25_34"
    },
    {
        "source_sentence": "阿難得聞持陀羅尼，又常親近世尊，故廣囑累。",
        "translation": "It's difficult to hear and retain the dhāraṇī, and it's always intimate with the Bhagavān, so I'll entrust it to him in detail.",
        "source": "T25n1509_100:0753c26_35"
    },
    {
        "source_sentence": "大智度論釋囑累品第九十",
        "translation": "Dazhidharma-śāstra, Chapter 90 of the Explanation of Entrustment",
        "source": "T25n1509_100:0753c28_0"
    },
    {
        "source_sentence": "【經】爾時，佛告阿難：「於汝意云何？",
        "translation": "[Sutra] It was then that the Buddha addressed Ānanda, What do you think?",
        "source": "T25n1509_100:0753c29_0"
    },
    {
        "source_sentence": "佛是汝大師不？",
        "translation": "Is the Buddha your great teacher?",
        "source": "T25n1509_100:0753c29_1"
    },
    {
        "source_sentence": "汝是佛弟子不？」",
        "translation": "Are you a disciple of the Buddha?",
        "source": "T25n1509_100:0754a01_2"
    },
    {
        "source_sentence": "阿難言：「世尊！",
        "translation": "Ānanda said, Bhagavān!",
        "source": "T25n1509_100:0754a01_3"
    },
    {
        "source_sentence": "佛是我大師，脩伽陀是我大師，我是佛弟子。」",
        "translation": "The Buddha is my teacher, the sūgada is my teacher, and I'm the Buddha's disciple.",
        "source": "T25n1509_100:0754a01_4"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T25n1509_100:0754a02_5"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T25n1509_100:0754a03_6"
    },
    {
        "source_sentence": "我是汝大師，汝是我弟子。",
        "translation": "I am your great teacher, and you are my disciple.",
        "source": "T25n1509_100:0754a03_7"
    },
    {
        "source_sentence": "若如弟子所應作者，汝已作竟。",
        "translation": "If it's as the disciple should do, you've done it.",
        "source": "T25n1509_100:0754a03_8"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T25n1509_100:0754a04_9"
    },
    {
        "source_sentence": "汝用身、口、意慈業供養供給我，亦常如我意，無有違失。",
        "translation": "You have offered me your body, speech, and mind as an offering of kindness, always following my wishes, without any disobedience.",
        "source": "T25n1509_100:0754a04_10"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T25n1509_100:0754a05_11"
    },
    {
        "source_sentence": "我身現在，汝愛敬供養供給，心常清淨；",
        "translation": "In the present body of mine you cherish, venerate, offer support, and provide for me.",
        "source": "T25n1509_100:0754a05_12"
    },
    {
        "source_sentence": "我滅度後，是一切愛敬、供養、供給事，當愛敬、供養般若波羅蜜！",
        "translation": "After my parinirvāṇa, this is the prajñāpāramitā of all kinds of love, respect, offerings, and offerings that should be loved and honored!",
        "source": "T25n1509_100:0754a06_13"
    },
    {
        "source_sentence": "乃至第二、第三，以般若波羅蜜囑累汝。",
        "translation": "Up to the second and third, I'll entrust you with the perfection of wisdom.",
        "source": "T25n1509_100:0754a08_14"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T25n1509_100:0754a09_15"
    },
    {
        "source_sentence": "汝莫忘莫失，莫作最後斷種人！",
        "translation": "Don't forget or lose it, and don't become the last person to cut off the seeds!",
        "source": "T25n1509_100:0754a09_16"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T25n1509_100:0754a09_17"
    },
    {
        "source_sentence": "隨爾所時般若波羅蜜在世，當知爾所時有佛在世說法。",
        "translation": "Whenever the prajñāpāramitā is in the world at that point, you should know that there's a Buddha who teaches the Dharma in the world at that point.",
        "source": "T25n1509_100:0754a10_18"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T25n1509_100:0754a11_19"
    },
    {
        "source_sentence": "若有書般若波羅蜜，受持、讀、誦、正憶念、為人廣說，恭敬、尊重、讚歎，",
        "translation": "If someone writes the perfection of wisdom, memorizes, recites, recites, correctly remembers, and explains it widely for others, they will be honored, venerated, respected, and praised.",
        "source": "T25n1509_100:0754a11_20"
    },
    {
        "source_sentence": "華香、幡蓋、寶衣、燈燭種種供養，當知是人不離見佛、不離聞法、常親近佛。」",
        "translation": "You should know that these people don't part from seeing the Buddha, hear the Dharma, or always become intimate with the Buddha with various offerings of flowers, incense, banners, canopies, jeweled clothing, or candles.",
        "source": "T25n1509_100:0754a12_21"
    },
    {
        "source_sentence": "佛說般若波羅蜜已，彌勒等諸菩薩摩訶薩、慧命須菩提、舍利弗、大目犍連、摩訶迦葉、富樓那彌多隷耶尼子、摩訶俱絺羅、摩訶迦旃延、阿難等，",
        "translation": "After the Buddha taught the perfection of wisdom, Maitreya and other bodhisattva mahāsattvas, such as Wisdom Life Subhūti, Śāriputra, Mahāmaudgalyāyana, Mahākāśyapa, Pūrṇamaitrāyaṇīputra, Mahākauṣṭhila, Mahākātyāyana, Ānanda, and others.",
        "source": "T25n1509_100:0754a14_22"
    },
    {
        "source_sentence": "并一切大眾，及一切世間諸天、人、犍闥婆、阿修羅等，聞佛所說，皆大歡喜。",
        "translation": "All the people in the assembly, as well as all the gods, humans, gandharvas, and asuras of the world who heard what the Buddha taught them rejoiced greatly.",
        "source": "T25n1509_100:0754a17_23"
    },
    {
        "source_sentence": "【論】問曰：佛已斷法愛，乃至一切種智、涅槃，不著不取相，今何以種種因緣囑累是法，",
        "translation": "[Commentary] Q: After the Buddha has cut off craving for the Dharma, up to omniscience and nirvāṇa, he doesn't cling or grasp characteristics, so why does he now entrust this teaching with various causes and conditions?",
        "source": "T25n1509_100:0754a20_0"
    },
    {
        "source_sentence": "似如愛著？",
        "translation": "It's like craving and attachment?",
        "source": "T25n1509_100:0754a21_1"
    },
    {
        "source_sentence": "答曰：諸佛大慈悲心，從初發意已來乃至到涅槃門，常不捨離。",
        "translation": "Answer: The great compassionate minds of the buddhas are always not abandoned from the time they first arouse their intention until they reach the gate of nirvāṇa.",
        "source": "T25n1509_100:0754a22_2"
    },
    {
        "source_sentence": "於娑羅雙樹間，以金鋼三昧為眾生碎身如麻米，何況經法多所饒益而不囑累！",
        "translation": "Among the two śāla trees, he uses the samādhi of gold and steel to break his body into pieces for sentient beings like hemp rice, so why wouldn't he entrust it to the sūtras and teachings that often benefit them?",
        "source": "T25n1509_100:0754a23_3"
    },
    {
        "source_sentence": "又阿難是未離欲人，未盡知般若波羅蜜力勢果報多所利益，是以慇懃囑累：「汝當好受持無令忘失！」",
        "translation": "Again, Ānanda, this is someone who hasn't yet parted with desire and doesn't fully know the great benefits of the fruit of the power and momentum of prajñāpāramitā, so he begrudgingly instructed him, You must well-maintain it without forgetting it!",
        "source": "T25n1509_100:0754a25_4"
    },
    {
        "source_sentence": "是故佛雖於一切法無憎愛、常寂滅相，而囑累是般若。",
        "translation": "Therefore, even though the Buddha has no hatred or craving for all things and always ceases characteristics, his instructions are prajñā.",
        "source": "T25n1509_100:0754a28_5"
    },
    {
        "source_sentence": "問曰：阿難是聲聞人，何以以般若波羅蜜囑累，而不囑累彌勒等大菩薩？",
        "translation": "Q: Why did Ānanda, who is a śrāvaka, entrust it to the great bodhisattvas like Maitreya and so forth with the prajñāpāramitā?",
        "source": "T25n1509_100:0754a29_6"
    },
    {
        "source_sentence": "答曰：有人言：阿難常侍佛左右，供給所須，得聞持陀羅尼，一聞常不失。",
        "translation": "Answer: Some people say, Ānanda always serves the Buddha to his left and right, providing what's needed, and he hears and retains the dhāraṇī with a single hearing that isn't lost.",
        "source": "T25n1509_100:0754b02_7"
    },
    {
        "source_sentence": "既是佛之從弟，又多知多識，名聞廣普，四眾所依，是能隨佛轉法輪第三師。",
        "translation": "Since he was the disciple of the Buddha and had many knowledges and consciousnesses, his reputation spread widely and the fourfold assembly relied on him. This was the third teacher who could follow the Buddha in turning the wheel of the Dharma.",
        "source": "T25n1509_100:0754b03_8"
    },
    {
        "source_sentence": "佛知舍利弗壽短早滅度故不囑累。",
        "translation": "Knowing that Śāriputra's life span was short, the Buddha entered nirvāṇa early and therefore didn't entrust him with it.",
        "source": "T25n1509_100:0754b05_9"
    },
    {
        "source_sentence": "又阿難是六神通、三明、共解脫五百阿羅漢師，能如是多所利益，是故囑累。",
        "translation": "Again, Ānanda, these five hundred arhat teachers of the six supernatural powers, the three sciences, and shared liberation are able to benefit so many people in this way. That is why they entrusted [the teaching] to me.",
        "source": "T25n1509_100:0754b06_10"
    },
    {
        "source_sentence": "彌勒等諸大菩薩，佛滅度後，各各分散，至隨所應度眾生國土——彌勒還兜率天上，",
        "translation": "Maitreya and other great bodhisattvas, after the nirvana of the Buddha, each scattered to wherever he could save sentient beings. Then Maitreya returned to Tuṣita Heaven.",
        "source": "T25n1509_100:0754b08_11"
    },
    {
        "source_sentence": "毘摩羅鞊、文殊師利亦至所應度眾生處。",
        "translation": "Vimalakīrti and Mañjuśrī also went to the place where they should save sentient beings.",
        "source": "T25n1509_100:0754b10_12"
    },
    {
        "source_sentence": "佛又以是諸菩薩深知般若波羅蜜力，不須苦囑累。",
        "translation": "Because these bodhisattvas deeply know the power of the prajñāpāramitā, the Buddha also doesn't need to be entrusted with suffering.",
        "source": "T25n1509_100:0754b11_13"
    },
    {
        "source_sentence": "阿難是聲聞人，隨小乘法，是故佛慇懃囑累。",
        "translation": "Ānanda was a śrāvaka who followed the teachings of the lesser vehicle, so the Buddha instructed him to do so.",
        "source": "T25n1509_100:0754b12_14"
    },
    {
        "source_sentence": "問曰：若爾者，《法華經》、諸餘方等經，何以囑累喜王諸菩薩等？",
        "translation": "Q: If that's the case, then why did the Lotus Sutra and other scriptures in other directions entrust the bodhisattvas of King joy to them?",
        "source": "T25n1509_100:0754b13_15"
    },
    {
        "source_sentence": "答曰：有人言：是時，佛說甚深難信之法，聲聞人不在。",
        "translation": "Answer: Some people say, At the time, the Buddha taught a profound and difficult teaching that śrāvakas weren't present.",
        "source": "T25n1509_100:0754b14_16"
    },
    {
        "source_sentence": "又如《佛說不可思議解脫經》，五百阿羅漢雖在佛邊而不聞，或時得聞而不能用。",
        "translation": "Also, just as the Buddha teaches the Inconceivable Liberation Sutra, even though five hundred arhats are at the Buddha's side but don't hear it, sometimes they hear it and can't use it.",
        "source": "T25n1509_100:0754b16_0"
    },
    {
        "source_sentence": "是故囑累諸菩薩。",
        "translation": "Therefore, it's entrusted to the bodhisattvas.",
        "source": "T25n1509_100:0754b17_1"
    },
    {
        "source_sentence": "問曰：更有何法甚深勝般若者，而以《般若》囑累阿難，而餘經囑累菩薩？",
        "translation": "Q: What other teaching is so profound and superior to prajñā that it entrusts the Prajñāpāramitā to Ānanda and the other sūtras to the bodhisattvas?",
        "source": "T25n1509_100:0754b18_2"
    },
    {
        "source_sentence": "答曰：般若波羅蜜非祕密法。",
        "translation": "Answer: The prajñāpāramitā is not a secret dharma.",
        "source": "T25n1509_100:0754b20_3"
    },
    {
        "source_sentence": "而《法華》等諸經說阿羅漢受決作佛，大菩薩能受持用；",
        "translation": "The Lotus Sutra and other scriptures teach that arhats receive ordination as buddhas, while great enlightening beings are able to receive and uphold it.",
        "source": "T25n1509_100:0754b20_4"
    },
    {
        "source_sentence": "譬如大藥師能以毒為藥。",
        "translation": "It's like a great healing doctor who can make poison into medicine.",
        "source": "T25n1509_100:0754b22_5"
    },
    {
        "source_sentence": "復次，如先說，般若有二種：一者、共聲聞說；",
        "translation": "“Furthermore, as has been said previously:",
        "source": "T25n1509_100:0754b22_6"
    },
    {
        "source_sentence": "二者、但為十方住十地大菩薩說，非九住所聞，何況新發意者！",
        "translation": "Second, it's only for the sake of the great bodhisattvas who live in the ten stages in the ten directions and aren't heard at the nine abodes, so why wouldn't they hear it, let alone those who have newly arisen the intention?",
        "source": "T25n1509_100:0754b23_7"
    },
    {
        "source_sentence": "復有九地所聞，乃至初地所聞，各各不同。",
        "translation": "There are also those heard in the nine stages, up to those heard in the first stage, which are each different.",
        "source": "T25n1509_100:0754b25_8"
    },
    {
        "source_sentence": "般若波羅蜜總相是一，而深淺有異，是故囑累阿難無咎。",
        "translation": "The general characteristic of the prajñāpāramitā is one, but its depth and depth are different; therefore, it's not blameworthy to entrust it to Ānanda.",
        "source": "T25n1509_100:0754b26_9"
    },
    {
        "source_sentence": "問曰：先〈見阿閦佛品〉中囑累，今復囑累，有何等異？",
        "translation": "Q: What's the difference between what was previously entrusted in the Seeing the Buddha Chapter and what's now entrusted again?",
        "source": "T25n1509_100:0754b27_10"
    },
    {
        "source_sentence": "答曰：菩薩道有二種：一者、般若波羅蜜道，二者、方便道。",
        "translation": "Answer: There are two kinds of bodhisattva paths: one, the path of prajñā-pāramitā and two, the path of skillful means.",
        "source": "T25n1509_100:0754b28_11"
    },
    {
        "source_sentence": "先囑累者，為說般若波羅蜜體竟；",
        "translation": "Those who had previously instructed him would explain the essence of the transcendent wisdom for them.",
        "source": "T25n1509_100:0754b29_12"
    },
    {
        "source_sentence": "今以說令眾生得是般若方便竟，囑累。",
        "translation": "Now, I'll explain it so that sentient beings will attain the completion of this method of prajñāpāramitā and entrust it to them.",
        "source": "T25n1509_100:0754c01_13"
    },
    {
        "source_sentence": "以是故，〈見阿閦佛〉後，說〈漚和拘捨羅品〉。",
        "translation": "For this reason, it's said that after Seeing Akṣobhya Buddha, he explains the Kauśinagara Chapter.",
        "source": "T25n1509_100:0754c02_14"
    },
    {
        "source_sentence": "般若波羅蜜中雖有方便，方便中雖有般若波羅蜜，而隨多受名。",
        "translation": "Although there are skillful means in the perfection of prajñāpāramitā, and although there are skillful means in the perfection of prajñāpāramitā, they often receive their names accordingly.",
        "source": "T25n1509_100:0754c03_15"
    },
    {
        "source_sentence": "般若與方便，本體是一，以所用小異故別說；",
        "translation": "Because the essence of prajñā and effort are one, they are spoken of separately because there is a minor difference in their function.",
        "source": "T25n1509_100:0754c05_16"
    },
    {
        "source_sentence": "譬如金師以巧方便故，以金作種種異物，雖皆是金，而各異名。",
        "translation": "It's like a gold smith who makes various different things with gold because of skillful means, and although they are all gold, each has a different name.",
        "source": "T25n1509_100:0754c06_17"
    },
    {
        "source_sentence": "菩薩得是般若波羅蜜實相，所謂一切法性空、無所有、寂滅相，即欲滅度；",
        "translation": "“Enlightening beings attain this true characteristic of the transcendent wisdom, which is emptiness, nonexistence, and quiescence of all things by means of the essence of dharmas.",
        "source": "T25n1509_100:0754c07_18"
    },
    {
        "source_sentence": "以方便力故，不取涅槃證。",
        "translation": "Because of the power of skillful means, they don't attain the realization of nirvāṇa.",
        "source": "T25n1509_100:0754c09_19"
    },
    {
        "source_sentence": "是時，作是念：「一切法性空，涅槃亦空，我今於菩薩功德未具足，不應取證；",
        "translation": "“The essence of all things is void, and so is nirvana. Now I am not fully endowed with the virtues of enlightening beings, which should not be grasped or realized.",
        "source": "T25n1509_100:0754c10_20"
    },
    {
        "source_sentence": "功德具足，乃可取證。」",
        "translation": "Only when their merits are complete can they be grasped and realized.",
        "source": "T25n1509_100:0754c11_21"
    },
    {
        "source_sentence": "是時，菩薩以方便力，過二地，入菩薩位；",
        "translation": "At that time the enlightening being entered the throne of enlightening beings through the power of skill in liberative technique, transcending the second and third stages.",
        "source": "T25n1509_100:0754c12_22"
    },
    {
        "source_sentence": "住菩薩位中，知甚深微妙無文字法，引導眾生，是名方便。",
        "translation": "Abiding in the bodhisattva's position, knowing the profound and subtle formless dharmas and guiding sentient beings is called skillful means.",
        "source": "T25n1509_100:0754c13_23"
    },
    {
        "source_sentence": "復次，有方便——菩薩知一切法畢竟空性、無所有，而能還起善法、行六波羅蜜，",
        "translation": "“Furthermore, there is another expedient meansby which a bodhisattva can know the ultimate emptiness and nonexistence of all things, yet he can still produce good dharmas and practice the six transcendent ways.",
        "source": "T25n1509_100:0754c14_24"
    },
    {
        "source_sentence": "不隨空。",
        "translation": "They don't follow emptiness.",
        "source": "T25n1509_100:0754c16_25"
    },
    {
        "source_sentence": "若能生四種事：若疑、若邪見、若入涅槃、若作佛；",
        "translation": "If they can produce four kinds of things: doubt, false views, entering nirvana and becoming buddhas.",
        "source": "T25n1509_100:0754c16_26"
    },
    {
        "source_sentence": "以般若有如是分別，若能除邪、疑，不入涅槃，是為方便。",
        "translation": "If there are such distinctions in parinirvāṇa, and if they can remove errors and doubts and don't enter nirvāṇa, this is the method.",
        "source": "T25n1509_100:0754c17_27"
    },
    {
        "source_sentence": "有人言：般若波羅蜜多所饒益，於大珍寶聚中最勝。",
        "translation": "Some people say, The benefits of the prajñāpāramitā are the most superior among the great treasures.",
        "source": "T25n1509_100:0754c19_0"
    },
    {
        "source_sentence": "佛知滅度後，多有怨賊欲毀壞者，品品囑累猶尚無咎，何況二處！",
        "translation": "The Buddha knows that after his parinirvāṇa, there will be many enemies and thieves who want to destroy it, but the blameworthiness of each chapter's instructions is still unknown, so why wouldn't there be blame? How much more so in two places!",
        "source": "T25n1509_100:0754c20_1"
    },
    {
        "source_sentence": "問曰：若囑累，何以乃爾慇懃鄭重？",
        "translation": "Q: If it's entrusted, why is it so heavy for you?",
        "source": "T25n1509_100:0754c21_2"
    },
    {
        "source_sentence": "答曰：佛隨世俗法引導眾生，譬如估客主，欲遠出他國，雖以財寶囑累於子，",
        "translation": "Answer: The Buddha guides sentient beings according to worldly dharmas, like an appraiser who wants to leave home from a distant land but entrusts his possessions to his children.",
        "source": "T25n1509_100:0754c22_3"
    },
    {
        "source_sentence": "大價妙寶偏獨慇懃，以其子未識妙寶價重故。",
        "translation": "The great value of the marvelous treasure is partial and solitary, because his son doesn't know the value of the marvelous treasure.",
        "source": "T25n1509_100:0754c24_4"
    },
    {
        "source_sentence": "餘人以估客主是識寶價人而慇懃囑累，必知其貴；",
        "translation": "Other people, appraising the guest as a man who knows the value of the treasure, will surely know the value of his entrustment.",
        "source": "T25n1509_100:0754c25_5"
    },
    {
        "source_sentence": "若聞其子讚說寶價，則不信之。",
        "translation": "If someone hears their son praise the price of a treasure, they won't believe it.",
        "source": "T25n1509_100:0754c26_6"
    },
    {
        "source_sentence": "佛亦如是。",
        "translation": "So it is with the Buddha.",
        "source": "T25n1509_100:0754c27_7"
    },
    {
        "source_sentence": "復次，若於餘人異眾中讚歎般若囑累，人則譏佛自稱讚法，疑而不信；",
        "translation": "“Furthermore, if one praises the commands of wisdom and entrusts it to others in different congregations, people will criticize the Buddha for praising himself as a buddha but doubt and not believe him.",
        "source": "T25n1509_100:0754c27_8"
    },
    {
        "source_sentence": "自於弟子中囑累，則無嫌。",
        "translation": "He himself instructed his disciples to do so, and they didn't resent it.",
        "source": "T25n1509_100:0754c29_9"
    },
    {
        "source_sentence": "復有人言：佛上品中說寂滅相無戲論，是一切智，是中無有決定法可取，",
        "translation": "Again, some people say: The Buddha teaches in the supreme book that nirvana is characterized by non-conceptuality. This is omniscience. There is no set doctrine to be grasped here.",
        "source": "T25n1509_100:0755a01_10"
    },
    {
        "source_sentence": "則人以為無所可貴；",
        "translation": "Then people think there is nothing to value.",
        "source": "T25n1509_100:0755a02_11"
    },
    {
        "source_sentence": "今慇懃囑累，則知佛不著空法。",
        "translation": "Now that I've been instructed, then I know that the Buddha doesn't cling to the teaching of emptiness.",
        "source": "T25n1509_100:0755a03_12"
    },
    {
        "source_sentence": "一切眾生中，愛念般若無過佛者，佛知般若恩深故，貴重是般若而慇懃囑累。",
        "translation": "Among all sentient beings, those who love mindfulness of prajñā without fail are buddhas, because the Buddha knows the depth of the grace of prajñā, and they value it as prajñā and entrust it to them.",
        "source": "T25n1509_100:0755a04_13"
    },
    {
        "source_sentence": "有人言：佛欲現中道故囑累：先說諸法空，以遮有邊；",
        "translation": "Some people claim: The Buddha, wishing to manifest the intermediate path, entrusts us with first explaining the emptiness of all things in order to obscure the finite.",
        "source": "T25n1509_100:0755a06_0"
    },
    {
        "source_sentence": "今慇懃囑累，則破無邊，是則中道。",
        "translation": "Now, if we look at the burden of entrustment, we'll refute limitlessness, which is the middle way.",
        "source": "T25n1509_100:0755a07_1"
    },
    {
        "source_sentence": "若人謂佛貪心愛著此法，佛以種種因緣說般若波羅蜜空相；",
        "translation": "Suppose someone says that the Buddha is greedy with minds attached to these teachings. The Buddha explains the emptiness of the transcendent wisdom for various reasons.",
        "source": "T25n1509_100:0755a08_2"
    },
    {
        "source_sentence": "若人謂佛墮斷滅中，是故慇懃囑累。",
        "translation": "If someone says the Buddha falls into cessation, it's because he's entrusted with a burden.",
        "source": "T25n1509_100:0755a09_3"
    },
    {
        "source_sentence": "如是，則離二邊。",
        "translation": "Thus, they're free of the two extremes.",
        "source": "T25n1509_100:0755a10_4"
    },
    {
        "source_sentence": "問曰：佛知阿難是弟子，何以故問阿難：「汝是我弟子不？",
        "translation": "Q: Knowing that Ānanda was a disciple, why did the Buddha ask Ānanda, Are you my disciple?",
        "source": "T25n1509_100:0755a10_5"
    },
    {
        "source_sentence": "我是汝師不？」",
        "translation": "Is this your teacher?",
        "source": "T25n1509_100:0755a12_6"
    },
    {
        "source_sentence": "答曰：佛有惡弟子須那剎多羅等，有少因緣故作弟子，欲於佛所取射法，",
        "translation": "Answer: The Buddha had bad disciples like Sunakṣatra and so forth, who had few reasons to become disciples because they wanted to take the teaching of archery from the Buddha.",
        "source": "T25n1509_100:0755a12_7"
    },
    {
        "source_sentence": "佛不為說，於是反戒言：「我非佛弟子。」",
        "translation": "The Buddha didn't explain it for him, so he replied to the precepts and said, I'm not a disciple of the Buddha.",
        "source": "T25n1509_100:0755a14_8"
    },
    {
        "source_sentence": "又如須尸摩為盜法故作弟子。",
        "translation": "It's also like when Suśmī becomes a disciple for the sake of stealing the Dharma.",
        "source": "T25n1509_100:0755a15_9"
    },
    {
        "source_sentence": "如是等，是名字弟子。",
        "translation": "Such and so forth are called disciples by name.",
        "source": "T25n1509_100:0755a15_10"
    },
    {
        "source_sentence": "又復外道等謂阿難不得已而在佛邊——阿難曾作外道弟子，著草衣，求神仙；",
        "translation": "Again, non-Buddhist theories and others said that Ānanda did not obtain it but stayed at the Buddha’s side. Ānanda had once been a disciple of non-Buddhist doctrine. He wore a grass robe and sought holy ones.",
        "source": "T25n1509_100:0755a16_11"
    },
    {
        "source_sentence": "今以佛是其親族，尊重故給侍。",
        "translation": "Now, because the Buddha is his relative, he venerates and serves him as an attendant.",
        "source": "T25n1509_100:0755a18_12"
    },
    {
        "source_sentence": "以如是等事故，於大眾中問阿難：「汝是我弟子不？」",
        "translation": "Because of these things, he asked Ānanda in the crowd, Are you my disciple?",
        "source": "T25n1509_100:0755a18_13"
    },
    {
        "source_sentence": "若言是真弟子，當隨我勅。",
        "translation": "If you say it's a true disciple, follow my instructions.",
        "source": "T25n1509_100:0755a20_14"
    },
    {
        "source_sentence": "是故阿難為欲令人信故重答。",
        "translation": "That's why Ānanda repeatedly answered because he wanted to make them believe.",
        "source": "T25n1509_100:0755a20_15"
    },
    {
        "source_sentence": "佛告阿難：「弟子所應作法，汝盡具足。」",
        "translation": "The Buddha told Ānanda, Whatever you disciples should do, you'll be fully endowed.",
        "source": "T25n1509_100:0755a21_16"
    },
    {
        "source_sentence": "弟子法者，所謂以善身、口、意業供給師。",
        "translation": "The disciple's teaching is to offer good bodily, verbal, and mental actions to the teacher.",
        "source": "T25n1509_100:0755a22_17"
    },
    {
        "source_sentence": "有弟子心好，身、口業不稱；",
        "translation": "“Some disciples have good intentions but their physical and verbal actions are not commensurate.",
        "source": "T25n1509_100:0755a23_18"
    },
    {
        "source_sentence": "有弟子身、口業好，而心不稱。",
        "translation": "There was a disciple whose physical and verbal actions were good, but his mind didn't praise them.",
        "source": "T25n1509_100:0755a23_19"
    },
    {
        "source_sentence": "若弟子以善心深愛樂師，身、口相稱，不惜身命、不難懃勞，自捨其心，",
        "translation": "“If a disciple deeply loves his teacher with good intentions, doesn’t cherish body and life or tirelessly exert effort to praise him verbally or bodily, and doesn’t give up his own mind,",
        "source": "T25n1509_100:0755a24_20"
    },
    {
        "source_sentence": "隨師教勅——阿難盡具足此事。",
        "translation": "He follows the teacher's instructions - Ānanda is fully equipped with these things.",
        "source": "T25n1509_100:0755a26_21"
    },
    {
        "source_sentence": "佛告阿難：「汝今現在恭敬於我，我滅度後，恭敬般若，亦當如是。」",
        "translation": "The Buddha told Ānanda, Now that you're respectful to me, I will revere Prajñā after my parinirvāṇa.",
        "source": "T25n1509_100:0755a26_22"
    },
    {
        "source_sentence": "問曰：般若是諸佛師，而阿難何以不恭敬其師，而恭敬佛？",
        "translation": "Q: If parinirvāṇa were the teacher of the buddhas, why wouldn't Ānanda respect his teacher and respect the Buddha?",
        "source": "T25n1509_100:0755a28_23"
    },
    {
        "source_sentence": "答曰：阿難雖得初道，漏未盡故，不深知法實，如佛所知。",
        "translation": "Answer: Although Ānanda has attained the first path, his contaminants haven't ended, so he doesn't deeply know the true nature of the Dharma as the Buddha knows it.",
        "source": "T25n1509_100:0755a29_24"
    },
    {
        "source_sentence": "是故佛告阿難：「汝恭敬般若，如恭敬我。」",
        "translation": "That's why the Buddha told Ānanda, Respect Prajñāpāramitā, as you respect me.",
        "source": "T25n1509_100:0755b02_25"
    },
    {
        "source_sentence": "復次，眾生見佛三十二相、八十隨形好、大光明、金色身，多愛敬；",
        "translation": "“Furthermore, when sentient beings saw the buddhas’ thirty-two characteristics, their eighty secondary signs, great light, and golden bodies they loved and revered them.",
        "source": "T25n1509_100:0755b03_26"
    },
    {
        "source_sentence": "般若波羅蜜微妙甚深，無形、無色，智者能知。",
        "translation": "The perfection of wisdom is subtle and profound, formless and formless, which the wise can know.",
        "source": "T25n1509_100:0755b04_27"
    },
    {
        "source_sentence": "佛身相好，愚、智視之，皆無厭足，是故佛以身喻般若。",
        "translation": "Because the Buddha's body has good features, foolish and wise people don't tire of looking at it; therefore, the Buddha uses his body as a metaphor for prajñā.",
        "source": "T25n1509_100:0755b05_28"
    },
    {
        "source_sentence": "佛在世時，能自遮魔，是故佛告阿難：「我滅度後，好守護般若。」",
        "translation": "When the Buddha was in the world, he was able to shield himself from Māra; therefore, the Buddha told Ānanda, After I cease being liberated, I'll be good at guarding prajñā.",
        "source": "T25n1509_100:0755b06_29"
    },
    {
        "source_sentence": "問曰：一囑累則足，何以至三？",
        "translation": "Q: If one is entrusted with the burden, it's sufficient; why is it up to three?",
        "source": "T25n1509_100:0755b08_30"
    },
    {
        "source_sentence": "答曰：佛深愛般若波羅蜜故三囑。",
        "translation": "Answer: The Buddha deeply loves the three commands because he loves the prajñāpāramitā.",
        "source": "T25n1509_100:0755b08_31"
    },
    {
        "source_sentence": "問曰：若深愛者，何限於三？",
        "translation": "Q: If someone deeply loves it, why is it limited to three?",
        "source": "T25n1509_100:0755b09_32"
    },
    {
        "source_sentence": "答曰：諸佛常法，語不過三。",
        "translation": "Answer: The eternal teachings of the buddhas are only three in number.",
        "source": "T25n1509_100:0755b10_33"
    },
    {
        "source_sentence": "若過三不從，執金鋼神則以杵擬之；",
        "translation": "If they do not obey after three times, the gods holding the golden-steel spirits will prepare them with a pounder.",
        "source": "T25n1509_100:0755b11_0"
    },
    {
        "source_sentence": "又執金鋼神意：若過三不從，則是逆人，便當殺之。",
        "translation": "Also, the metal-holding goddess said, If someone goes beyond the three and doesn't follow them, they'll be killed if they go against others.",
        "source": "T25n1509_100:0755b12_0"
    },
    {
        "source_sentence": "是故佛問不過三。",
        "translation": "Therefore, the Buddha asks only three questions.",
        "source": "T25n1509_100:0755b13_1"
    },
    {
        "source_sentence": "復次，若一說，猶緩；",
        "translation": "Furthermore, if one were to expound it once, it would still be slow.",
        "source": "T25n1509_100:0755b13_2"
    },
    {
        "source_sentence": "過三，太急，似如凡夫貪著者。",
        "translation": "If it goes beyond three, it's too urgent, resembling ordinary craving.",
        "source": "T25n1509_100:0755b14_3"
    },
    {
        "source_sentence": "復次，受者心有三種，鈍根者至三乃生善心；",
        "translation": "“Furthermore, there are three kinds of awarenesses for the one who receives:",
        "source": "T25n1509_100:0755b14_4"
    },
    {
        "source_sentence": "阿難雖復利根，心向聲聞，但一身求度，是故三告。",
        "translation": "Although Ānanda still had sharp faculties, his mind was directed toward the śrāvakas and he simply sought salvation with one body. That is why I admonish him in three ways.",
        "source": "T25n1509_100:0755b15_5"
    },
    {
        "source_sentence": "所以囑累者，為不令法滅故。",
        "translation": "The reason it's entrusted is because it doesn't cause the Dharma to cease.",
        "source": "T25n1509_100:0755b17_0"
    },
    {
        "source_sentence": "汝當教化弟子，弟子復教餘人，展轉相教；",
        "translation": "You should lead and inspire the disciples. The disciples will also lead others, teaching one another in turn.",
        "source": "T25n1509_100:0755b17_1"
    },
    {
        "source_sentence": "譬如一燈復然餘燈，其明轉多。",
        "translation": "It's like a single lamp that turns into many other lamps, and their luminosity increases.",
        "source": "T25n1509_100:0755b18_2"
    },
    {
        "source_sentence": "莫作最後斷種人者，世人有子，若不紹繼，則名斷種，最為可恥。",
        "translation": "Don't make the last person who cuts off seeds because people in the world have children, and if they don't continue to do so, then they're called cutting off seeds, which is most shameful.",
        "source": "T25n1509_100:0755b19_3"
    },
    {
        "source_sentence": "佛以此喻告阿難：「汝莫於汝身上令般若斷絕！」",
        "translation": "With this metaphor, the Buddha told Ānanda, Don't let prajñā cease on your body!",
        "source": "T25n1509_100:0755b21_0"
    },
    {
        "source_sentence": "問曰：如先品中明「般若波羅蜜，說亦不增、不說亦不減，畢竟寂滅相」，",
        "translation": "Q: As explained in the previous section, the prajñāpāramitā doesn't increase or decrease when it's explained, and it ultimately has the characteristic of cessation.",
        "source": "T25n1509_100:0755b22_1"
    },
    {
        "source_sentence": "今何以言「莫令斷滅」？",
        "translation": "Why does he now say, Don't let it be stopped?",
        "source": "T25n1509_100:0755b23_2"
    },
    {
        "source_sentence": "譬如虛空，誰能滅者？",
        "translation": "It's like space, but who can extinguish it?",
        "source": "T25n1509_100:0755b24_3"
    },
    {
        "source_sentence": "答曰：般若波羅蜜雖寂滅、無生無滅相、如虛空、不可戲論，而文字語言書般若波羅蜜經卷，",
        "translation": "Answer: Although the prajñāpāramitā is tranquil, without arising or ceasing characteristics, like space, and not to be discussed, yet it's written in words and books, such as the Prajñāpāramitā-sūtra.",
        "source": "T25n1509_100:0755b24_4"
    },
    {
        "source_sentence": "為他人說，是此中般若，於此因中而說其果。",
        "translation": "To teach it for others is prajñā, which explains its result in terms of this cause.",
        "source": "T25n1509_100:0755b26_5"
    },
    {
        "source_sentence": "凡人聞般若波羅蜜微妙，即生著心，取般若相，分別諸法，所謂是善、是不善，",
        "translation": "Ordinary people who hear the subtlety of the perfection of wisdom immediately become attached, grasp the characteristics of wisdom, and discriminate qualities that are called good and unskillful.",
        "source": "T25n1509_100:0755b27_6"
    },
    {
        "source_sentence": "是世間、是涅槃等；",
        "translation": "This is the world, this is nirvana, and so on.",
        "source": "T25n1509_100:0755b29_7"
    },
    {
        "source_sentence": "以分別故，於是法中生著心，著心故鬪諍，鬪諍故起諸罪業——如是人名為滅般若波羅蜜。",
        "translation": "Because of discrimination, they become attached to these things, fight because of their attachment, and commit crimes because of fighting - such people are called the cessation of the perfection of prajñāpāramitā.",
        "source": "T25n1509_100:0755c01_8"
    },
    {
        "source_sentence": "佛告阿難：「汝當如般若波羅蜜相，莫著文字語言，教化眾生。」",
        "translation": "The Buddha told Ānanda, You must follow the characteristics of the perfection of wisdom and not cling to words or words to teach sentient beings.",
        "source": "T25n1509_100:0755c03_9"
    },
    {
        "source_sentence": "是名不滅。",
        "translation": "This is called not ceasing.",
        "source": "T25n1509_100:0755c04_10"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T25n1509_100:0755c05_0"
    },
    {
        "source_sentence": "隨般若在世幾時，則知爾許時佛在世」，如經中廣說。",
        "translation": "Whenever Prajñāpāramitā is in the world, it's known that the Buddha is in the world at that time. As explained in detail in the sūtras.",
        "source": "T25n1509_100:0755c05_1"
    },
    {
        "source_sentence": "佛慇懃囑累，在會眾生有疑，是故佛說囑累因緣，所謂「有般若在世，",
        "translation": "Because sentient beings at the assembly have doubts, the Buddha explains the causes and conditions for entrusting them.",
        "source": "T25n1509_100:0755c06_2"
    },
    {
        "source_sentence": "則為佛在」。",
        "translation": "Then the Buddha will be here.",
        "source": "T25n1509_100:0755c08_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_100:0755c08_1"
    },
    {
        "source_sentence": "般若波羅蜜是諸佛母，諸佛以法為師。",
        "translation": "The perfection of wisdom is the mother of buddhas, and the buddhas have the Dharma as their teacher.",
        "source": "T25n1509_100:0755c08_2"
    },
    {
        "source_sentence": "法者，即是般若波羅蜜。",
        "translation": "The Dharma is the prajñāpāramitā.",
        "source": "T25n1509_100:0755c09_3"
    },
    {
        "source_sentence": "若師在、母在，不名為失利。",
        "translation": "If the teacher is present and the mother is present, it's not called losing profit.",
        "source": "T25n1509_100:0755c09_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_100:0755c10_5"
    },
    {
        "source_sentence": "利本在故。",
        "translation": "It's because the benefits are inherently present.",
        "source": "T25n1509_100:0755c10_6"
    },
    {
        "source_sentence": "是故說：「若般若在世，佛亦在世。」",
        "translation": "That's why it's said, If prajñā is in the world, the Buddha is also in the world.",
        "source": "T25n1509_100:0755c11_0"
    },
    {
        "source_sentence": "又法寶不離佛寶。",
        "translation": "Furthermore, the Dharma treasure doesn't part from the Buddha treasure.",
        "source": "T25n1509_100:0755c11_1"
    },
    {
        "source_sentence": "菩薩有三十二相、八十隨形好，不名為佛，得法寶故名為佛。",
        "translation": "A bodhisattva has the thirty-two marks and eighty secondary signs, which are not called a buddha but are called a buddha because they attain the treasure of the Dharma.",
        "source": "T25n1509_100:0755c12_2"
    },
    {
        "source_sentence": "法寶即是般若波羅蜜。",
        "translation": "The Dharma treasure is the prajñāpāramitā.",
        "source": "T25n1509_100:0755c13_3"
    },
    {
        "source_sentence": "如人從佛得利，乃至得解脫涅槃；",
        "translation": "“Good man, this is analogous to someone who benefits from the Buddha and attains liberation by [obtaining] nirvana.",
        "source": "T25n1509_100:0755c14_4"
    },
    {
        "source_sentence": "若人於般若中能信行，亦以三乘法而入涅槃。",
        "translation": "If someone can believe in the practice of prajñā, they'll also enter nirvāṇa with the teachings of the three vehicles.",
        "source": "T25n1509_100:0755c15_0"
    },
    {
        "source_sentence": "是故說般若在世，如佛在世，說法無異。",
        "translation": "That's why it's said that prajñā is in the world, just as the Buddha is in the world and explains his teaching without difference.",
        "source": "T25n1509_100:0755c16_1"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T25n1509_100:0755c17_2"
    },
    {
        "source_sentence": "若有人聽受般若，及書、持等，當知是人不離見佛、聞法、親近諸佛。」",
        "translation": "If someone hears and receives prajñā, writes, retains, and so forth, you should know that person doesn't part from seeing the Buddha, hearing the Dharma, or associating with the buddhas.",
        "source": "T25n1509_100:0755c17_3"
    },
    {
        "source_sentence": "問曰：有人重罪，三不善業成就，聽、受、書、持般若，是人云何當得不離諸佛、聞法、親近佛不？",
        "translation": "Q: A person with a serious offense who has accomplished three bad actions and listens, receives, writes, and retains prajñā, how will that person attain the ability to not part with the buddhas, hear the Dharma, and become intimate with the buddhas?",
        "source": "T25n1509_100:0755c18_4"
    },
    {
        "source_sentence": "答曰：是事先品中已答，所謂聽法者有二種人：一者、但聽而不信受行，",
        "translation": "Answer: This has already been answered in the previous section. There are two kinds of people called hearers of the doctrine. The first is those who simply hear but do not believe and accept it.",
        "source": "T25n1509_100:0755c20_5"
    },
    {
        "source_sentence": "二者、聽而信受奉行。",
        "translation": "The second is that they listen and believe, accept, and practice it.",
        "source": "T25n1509_100:0755c22_6"
    },
    {
        "source_sentence": "如弟子不聽、不信受行師語，是名不聽；",
        "translation": "Like a disciple who does not listen and does not believe in the words of his teacher, this is called not listening.",
        "source": "T25n1509_100:0755c23_0"
    },
    {
        "source_sentence": "若以一心聽聞，信受奉行，厭世、愛涅槃，離小乘、樂大乘——作如是聽受，",
        "translation": "If someone listens with a concentrated mind, believes and accepts it, dislikes the world and craves nirvāṇa, parts with the lesser vehicle and enjoys the greater vehicle - they'll hear and accept it like this.",
        "source": "T25n1509_100:0755c24_0"
    },
    {
        "source_sentence": "是名真聽。",
        "translation": "This is called true listening.",
        "source": "T25n1509_100:0755c25_1"
    },
    {
        "source_sentence": "誦、讀亦如是。",
        "translation": "Recitation and recitation are likewise.",
        "source": "T25n1509_100:0755c25_2"
    },
    {
        "source_sentence": "正憶念，隨如佛意，離有無二邊，行於中道。",
        "translation": "He correctly remembers, follows the Buddha's wishes, parts with existence and nonduality, and travels the middle way.",
        "source": "T25n1509_100:0755c26_3"
    },
    {
        "source_sentence": "如所聞受持，及其義解、為他人解說，恭敬、尊重、供養、讚歎、花香等。",
        "translation": "They are honored, venerated, offered support, praised, praised, and filled with the fragrance of flowers.",
        "source": "T25n1509_100:0755c27_4"
    },
    {
        "source_sentence": "初始微薄，乃至正憶念、為他人說，其心轉厚，功德轉多，牢固不動。",
        "translation": "At first they are weak, but when they correctly remember and explain it to others their minds become thick, their merit increases, and they're firm and unmoving.",
        "source": "T25n1509_100:0755c28_5"
    },
    {
        "source_sentence": "若聞師說、若見經卷、花香等供養——若智者知般若功德供養者，福德重；",
        "translation": "If one hears the teacher’s exhortation, if one sees a scripture in fascicles or flowers and fragrances, etc., and makes offerings of this kind-if the wise person knows the merit of prajñāpāramitā and makes offerings to it, his merit will be great.",
        "source": "T25n1509_100:0756a01_6"
    },
    {
        "source_sentence": "不知者供養，福德微薄。",
        "translation": "Those who don't know will make offerings, but their merit is weak.",
        "source": "T25n1509_100:0756a02_7"
    },
    {
        "source_sentence": "福德純厚者，轉身不離見佛、聞法、親近諸佛；",
        "translation": "The one whose virtue is pure and generous develops bodies that are not separate from seeing Buddhas, hearing the Teaching, or associating with Buddhas.",
        "source": "T25n1509_100:0756a03_8"
    },
    {
        "source_sentence": "福德微薄者，不言轉身得三福報，償眾罪已，久後亦必當得佛。",
        "translation": "Those whose virtue is weak don't say that they'll attain the three rewards of merit by transforming their bodies, and after paying off their sins, they'll surely attain Buddhahood in the future.",
        "source": "T25n1509_100:0756a04_9"
    },
    {
        "source_sentence": "此中佛總說福德純厚、微薄，漸漸皆當見十方佛、聞佛所說，漸漸具足六波羅蜜，",
        "translation": "Here the Buddha teaches in a general way that merit is pure and strong but weak; gradually they will all see buddhas of the ten directions and hear what they teach. They will gradually attain the six transcendent ways.",
        "source": "T25n1509_100:0756a06_10"
    },
    {
        "source_sentence": "皆得作佛。",
        "translation": "They'll all become buddhas.",
        "source": "T25n1509_100:0756a08_0"
    },
    {
        "source_sentence": "佛以佛眼見般若有如是大利益眾生故，慇懃囑累。",
        "translation": "Because the Buddha sees parinirvāṇa with the Buddha's eye and thus has such great benefits for sentient beings, he entrusts it to them.",
        "source": "T25n1509_100:0756a08_1"
    },
    {
        "source_sentence": "問曰：是諸大阿羅漢已證實際，無復憂喜，小喜尚無，何況大歡喜！",
        "translation": "Q: These great arhats have realized reality, no more grief or joy, and little joy is still absent, so why wouldn't they rejoice?",
        "source": "T25n1509_100:0756a09_2"
    },
    {
        "source_sentence": "答曰：諸大阿羅漢，雖離三界欲，未得一切智慧故，於諸甚深法中猶疑不了；",
        "translation": "Answer: Although great arhats are free from the desires of the three realms and have not yet attained omniscience, they still doubt and do not understand the profound teachings.",
        "source": "T25n1509_100:0756a11_3"
    },
    {
        "source_sentence": "是摩訶般若波羅蜜中了了解說，斷除其疑，是故大歡喜。",
        "translation": "This is the great joy that understands and explains what's explained in the Mahāprajñāpāramitā and removes their doubts, which is why they rejoice.",
        "source": "T25n1509_100:0756a12_4"
    },
    {
        "source_sentence": "復次，此諸大弟子已證實際。",
        "translation": "Furthermore, these great disciples have already realized reality.",
        "source": "T25n1509_100:0756a14_5"
    },
    {
        "source_sentence": "實際者，即是空、無相、無量，無所分別。",
        "translation": "Practical actuality means emptiness, signlessness, and immeasurability, which are not discriminated.",
        "source": "T25n1509_100:0756a14_6"
    },
    {
        "source_sentence": "佛以此寂滅法，種種分別名字、語言、譬喻廣說，亦不壞法性，又不與世間相違；",
        "translation": "Because of these teachings of extinction, the Buddha explains in various different names, words, and metaphors. He does not destroy the essence of dharmas, nor is he at odds with the world.",
        "source": "T25n1509_100:0756a15_7"
    },
    {
        "source_sentence": "諸阿羅漢是法中證故大歡喜。",
        "translation": "The arhats are greatly joyful because they realize this in the Dharma.",
        "source": "T25n1509_100:0756a17_8"
    },
    {
        "source_sentence": "佛善說是空、無相、無量、寂滅法，諸餘大眾未悉漏盡，信力深故，亦大歡喜，",
        "translation": "The Buddha had explained this doctrine of emptiness, signlessness, immeasurability, and extinction well. But the remaining members of the great assembly did not understand it completely; because of the power of their deep faith, they were also greatly delighted.",
        "source": "T25n1509_100:0756a18_9"
    },
    {
        "source_sentence": "言：「此法能盡我等生死苦，令得佛道。」",
        "translation": "He said, This teaching can end the suffering of birth-and-death for us and allow us to attain the Buddha Way.",
        "source": "T25n1509_100:0756a19_10"
    },
    {
        "source_sentence": "如是等無量因緣故，大眾皆歡喜。",
        "translation": "Because of these measureless causes and conditions, the masses all rejoiced.",
        "source": "T25n1509_100:0756a20_11"
    },
    {
        "source_sentence": "問曰：若佛囑累阿難是般若波羅蜜，佛般涅槃後，阿難共大迦葉結集三藏，",
        "translation": "Q: If the Buddha instructed Ānanda to compile this perfection of wisdom, then after the parinirvāṇa of the Buddha, Ānanda and Mahākāśyapa would have compiled the Tripiṭaka.",
        "source": "T25n1509_100:0756a21_12"
    },
    {
        "source_sentence": "此中何以不說？",
        "translation": "Why isn't it explained here?",
        "source": "T25n1509_100:0756a23_13"
    },
    {
        "source_sentence": "答曰：摩訶衍甚深難信、難解難行。",
        "translation": "Answer: Mahāyāna is profound, difficult to believe in and difficult to understand and difficult to practice.",
        "source": "T25n1509_100:0756a23_14"
    },
    {
        "source_sentence": "佛在世時，有諸比丘聞摩訶衍不信、不解故，從坐而去，何況佛般涅槃後！",
        "translation": "When the Buddha was in the world, some monks heard Mahāyāna and departed from their seats because they didn't believe or understand it, so why wouldn't they leave after the Buddha's parinirvāṇa?",
        "source": "T25n1509_100:0756a24_15"
    },
    {
        "source_sentence": "以是故不說。",
        "translation": "That's why it's not explained.",
        "source": "T25n1509_100:0756a26_16"
    },
    {
        "source_sentence": "復次，三藏正有三十萬偈，并為九百六十萬言。",
        "translation": "Furthermore, the Tripiṭaka correctly has 300,000 verses, and it's 960,000 words.",
        "source": "T25n1509_100:0756a26_17"
    },
    {
        "source_sentence": "摩訶衍甚多無量無限，如此中〈般若波羅蜜品〉有二萬二千偈，〈大般若品〉有十萬偈，",
        "translation": "Mahāyāna is so numerous and immeasurable that there are twenty-thousand verses in the Prajñāpāramitā Chapter and one hundred thousand verses in the Mahāprajñāpāramitā Chapter.",
        "source": "T25n1509_100:0756a27_18"
    },
    {
        "source_sentence": "諸龍王、阿修羅王、諸天宮中有千億萬偈等。",
        "translation": "In the palaces of the dragon kings, asura kings, and gods, there are trillions of millions of verses.",
        "source": "T25n1509_100:0756a29_19"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_100:0756b01_20"
    },
    {
        "source_sentence": "此諸天、龍、神壽命長久、識念力強故。",
        "translation": "It's because these gods, dragons, and spirits have long lives and the power of mindfulness of consciousness is strong.",
        "source": "T25n1509_100:0756b01_21"
    },
    {
        "source_sentence": "今此世人，壽命短促、識念力薄，〈小般若波羅蜜品〉尚不能讀，何況多者！",
        "translation": "The people of this world today have short life spans and the power of consciousness and thought are weak, so they can't even read the Lesser Perfection of Wisdom Chapter, much less many.",
        "source": "T25n1509_100:0756b02_22"
    },
    {
        "source_sentence": "諸餘大菩薩所知般若波羅蜜無量無限。",
        "translation": "The other great bodhisattvas know that the perfection of wisdom is immeasurable and limitless.",
        "source": "T25n1509_100:0756b04_23"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T25n1509_100:0756b05_24"
    },
    {
        "source_sentence": "佛非但一身所說，無量世中或變化作無數身，是故所說無量。",
        "translation": "The Buddha is not only spoken of in one body. In an infinite number of worlds, sometimes he manifests countless bodies. That is why it is said to be infinite.",
        "source": "T25n1509_100:0756b05_25"
    },
    {
        "source_sentence": "又有《不可思議解脫經》十萬偈，《諸佛本起經》、《寶雲經》、《大雲經》、《法雲經》各各十萬偈，",
        "translation": "There were also ten thousand stanzas in the Inconceivable Liberation Sutra, and one hundred thousand stanzas in each of the Originally Enlightened Ones’ Scriptures, Jewel Cloud Scriptures, Great Cloud Scriptures, and Dharma Cloud Scriptures.",
        "source": "T25n1509_100:0756b06_26"
    },
    {
        "source_sentence": "《法華經》、《華手經》、《大悲經》、《方便經》、《龍王問經》、《阿修羅王問經》等諸大經，",
        "translation": "The Lotus Sutra, the Flower Hand Sutra, the Great Compassion Sutra, the Mahayana Sutra, the Mahayana Sutra, the Mahayana Sutra, the Mahayana Sutra, the Mahayana Sutra of the Questions of the Dragon King, and the Mahayana Sutra of the Questions of the Asura King.",
        "source": "T25n1509_100:0756b08_27"
    },
    {
        "source_sentence": "無量無邊，如大海中寶，云何可入三藏中？",
        "translation": "It's immeasurable and limitless, like the treasure in the ocean, so how can it enter the Tripiṭaka?",
        "source": "T25n1509_100:0756b10_28"
    },
    {
        "source_sentence": "小物應在大中，大物不得入小。",
        "translation": "The small things should be in the large, but the large things can't enter the small.",
        "source": "T25n1509_100:0756b11_29"
    },
    {
        "source_sentence": "若欲問，應言：「小乘何以不在摩訶衍中？」",
        "translation": "If you want to ask, you should say, Why isn't the lesser vehicle in Mahāyāna?",
        "source": "T25n1509_100:0756b12_30"
    },
    {
        "source_sentence": "摩訶衍能兼小乘法故，是故不應如汝所問。",
        "translation": "Because Mahāyāna can combine the teachings of the lesser vehicle, therefore it shouldn't be asked as you ask.",
        "source": "T25n1509_100:0756b13_0"
    },
    {
        "source_sentence": "復次，有人言：如摩訶迦葉將諸比丘在耆闍崛山中集三藏，佛滅度後，",
        "translation": "Furthermore, some people say: Suppose Mahākāśyapa gathered the monks together at Mount Gṛdhrakūṭa to collect the Tripiṭaka. After the nirvana of the Buddha,",
        "source": "T25n1509_100:0756b14_1"
    },
    {
        "source_sentence": "文殊尸利、彌勒諸大菩薩亦將阿難集是摩訶衍。",
        "translation": "Mañjuśrī and Maitreya, the great bodhisattvas, also gathered Ānanda together as Mahāyāna.",
        "source": "T25n1509_100:0756b15_2"
    },
    {
        "source_sentence": "又阿難知籌量眾生志業大小，是故不於聲聞人中說摩訶衍，說則錯亂，",
        "translation": "Again, Ānanda, [the Buddha] knew the size of the aspirations and actions of sentient beings. For this reason he did not preach the Mahāyāna among the śrāvakas, for when he preached it, there would be a discrepancy.",
        "source": "T25n1509_100:0756b16_3"
    },
    {
        "source_sentence": "無所成辦。",
        "translation": "Nothing is accomplished.",
        "source": "T25n1509_100:0756b18_4"
    },
    {
        "source_sentence": "佛法皆是一種一味，所謂苦盡解脫味。",
        "translation": "The Buddha's teachings are all of one kind, which is called the taste of liberation from suffering.",
        "source": "T25n1509_100:0756b18_5"
    },
    {
        "source_sentence": "此解脫味有二種：一者、但自為身，二者、兼為一切眾生。",
        "translation": "There are two kinds of flavor of this liberation: 1. simply for one's own sake and 2. for the sake of all sentient beings.",
        "source": "T25n1509_100:0756b19_6"
    },
    {
        "source_sentence": "雖俱求一解脫門，而有自利、利人之異，是故有大小乘差別。",
        "translation": "Even though they both seek the single gate of liberation, there are differences in self-benefiting and benefiting people, so there are distinctions between large and small vehicles.",
        "source": "T25n1509_100:0756b21_7"
    },
    {
        "source_sentence": "為是二種人故，佛口所說，以文字語言分為二種：三藏是聲聞法，摩訶衍是大乘法。",
        "translation": "Because of these two kinds of people, the Buddha's verbal teaching is divided into two kinds by using words: the three collections are śrāvaka dharmas and mahāyāna dharmas are great vehicle dharmas.",
        "source": "T25n1509_100:0756b22_8"
    },
    {
        "source_sentence": "復次，佛在世時，無有三藏名，但有持修多羅比丘、持毘尼比丘、持摩多羅迦比丘。",
        "translation": "Furthermore, when the Buddha was in the world, there were no names for the Tripiṭaka but only the monks who upheld the sūtra, upheld the vinaya, and upheld the Mathuraka.",
        "source": "T25n1509_100:0756b24_9"
    },
    {
        "source_sentence": "修多羅者，是四《阿鋡》中經名、摩訶衍中經名。",
        "translation": "The sūtra refers to the names of the sūtras in the four Āgamas and the names of the sūtras in Mahāyāna.",
        "source": "T25n1509_100:0756b26_10"
    },
    {
        "source_sentence": "修多羅有二分：一者、四阿含中修多羅，二者、摩訶衍經名為大。",
        "translation": "The sūtra has two parts: 1. the sūtra in the four Āgamas, and 2. the Mahāyāna sūtras are called great.",
        "source": "T25n1509_100:0756b27_11"
    },
    {
        "source_sentence": "修多羅入二分，亦大乘、亦小乘。",
        "translation": "The sūtra enters into two parts, which are also the great vehicle and lesser vehicle.",
        "source": "T25n1509_100:0756b28_12"
    },
    {
        "source_sentence": "二百五十戒，如是等，名為修多羅。",
        "translation": "Two hundred and fifty precepts, such as these, are called sūtra.",
        "source": "T25n1509_100:0756b29_13"
    },
    {
        "source_sentence": "毘尼名比丘作罪，佛結戒：應行是、不應行是，作是事得是罪。",
        "translation": "The Vinaya calls it a sin when a monk commits a sin, and the Buddha concludes the precepts by saying, 'This is a sin that should be done and this is a sin that shouldn't be done; doing such things will result in this sin.'",
        "source": "T25n1509_100:0756c01_14"
    },
    {
        "source_sentence": "略說有八十部。",
        "translation": "It's briefly explained that there are eighty parts.",
        "source": "T25n1509_100:0756c02_15"
    },
    {
        "source_sentence": "亦有二分：一者、摩偷羅國毘尼，含阿波陀那、本生，有八十部；",
        "translation": "There are also two parts: the first, the code of ethics of the country of Mathurā, which contains the āpadāna and the eighty-eight ancient texts.",
        "source": "T25n1509_100:0756c03_16"
    },
    {
        "source_sentence": "二者、罽賓國毘泥，除却本生、阿波陀那，但取要用作十部。",
        "translation": "Second, the Vinaya of Kāśmīra excludes the originally produced and abhidharma but takes the essentials and makes them into ten parts.",
        "source": "T25n1509_100:0756c04_17"
    },
    {
        "source_sentence": "有八十部毘婆沙解釋。",
        "translation": "There are eighty explanations in the Vibhāṣā council.",
        "source": "T25n1509_100:0756c05_18"
    },
    {
        "source_sentence": "是故知《摩訶般若波羅蜜經》等在修多羅經中以經大、事異故別說，是故不在集三藏中。",
        "translation": "Therefore, it's known that the Mahāprajñāpāramitā-sūtra and so forth are explained separately in the sūtra because the sūtras are large and the things are different, so they aren't found in the collection of the three collections.",
        "source": "T25n1509_100:0756c06_19"
    },
    {
        "source_sentence": "究摩羅耆婆法師，以秦弘始三年歲在辛丑十二月二十日至長安，四年夏，",
        "translation": "The Master Kumārajīva stayed at Chang’an from the twenty-second day of the twelfth month in Xin uo in the fourth year and summer of the reign of Emperor Mañjuśrī.",
        "source": "T25n1509_100:0756c09_0"
    },
    {
        "source_sentence": "於逍遙園中西門閣上為姚天王出此",
        "translation": "At the west entrance of the pavilion in the middle of the park, he appeared as the king of gods.",
        "source": "T25n1509_100:0756c11_0"
    },
    {
        "source_sentence": "釋論，七年十二月二十七日乃訖。",
        "translation": "The explanation of the treatise was completed on the twenty-seventh day of the twelfth month in the seventh year.",
        "source": "T25n1509_100:0756c12_0"
    },
    {
        "source_sentence": "其中兼出經本、禪經、戒律、百論、禪法要解，向五十萬言，并此釋論一百五十萬言。",
        "translation": "The texts of the sūtras, meditation scriptures, precepts, one hundred treatises, and the essential explanations of the Chan teachings were compiled in it, amounting to fifty million words, along with one hundred and fifty million words of this commentary on the treatise.",
        "source": "T25n1509_100:0756c12_1"
    },
    {
        "source_sentence": "論初品三十四卷，解釋一品，是全論具本；",
        "translation": "The first part of the treatise, consisting of thirty-four fascicles and one chapter of explanation, is the complete text of the whole treatise.",
        "source": "T25n1509_100:0756c14_2"
    },
    {
        "source_sentence": "二品已下，法師略之，取其足以開釋文意而已，不復備其廣釋。",
        "translation": "After the second chapter, the teacher of the Dharma abbreviates it, taking that as sufficient to reveal the meaning of the text and doesn't explain it in detail.",
        "source": "T25n1509_100:0756c15_3"
    },
    {
        "source_sentence": "得此百卷，若盡出之，將十倍於此。",
        "translation": "If he were to produce all these one hundred fascicles, it would be ten times greater than this.",
        "source": "T25n1509_100:0756c17_4"
    },
    {
        "source_sentence": "大智度論卷第一百",
        "translation": "Dazhiduo lun, vol. 100",
        "source": "T25n1509_100:0756c19_0"
    }
]