[
    {
        "source_sentence": "大智度論釋初品中見一切佛",
        "translation": "In the first chapter of the Mahāprajñāpāramitā-śāstra, he sees all buddhas.",
        "source": "T25n1509_034:0308b21_0"
    },
    {
        "source_sentence": "世界義第五十一之餘(卷三十四)",
        "translation": "The rest of the Fifty-first Part of the Worldly Meaning (Vol. 34)",
        "source": "T25n1509_034:0308b22_0"
    },
    {
        "source_sentence": "聖者龍樹造",
        "translation": "created by the sage named dragon tree",
        "source": "T25n1509_034:0308b24_0"
    },
    {
        "source_sentence": "後秦龜茲國三藏鳩摩羅什譯",
        "translation": "Translated by Kumārajīva, a translator of the Tripiṭaka of the country of Kucha in the Later Qin",
        "source": "T25n1509_034:0308b25_0"
    },
    {
        "source_sentence": "◎【經】「復次，舍利弗！",
        "translation": "Śāriputra, furthermore, Śāriputra!",
        "source": "T25n1509_034:0308b26_0"
    },
    {
        "source_sentence": "菩薩摩訶薩，十方如恒河沙等世界中諸佛所說法：已說、今說、當說，聞已，欲一切信持、自行、亦為人說者，當學般若波羅蜜！」",
        "translation": "Bodhisattvas, mahāsattvas, and buddhas in the worlds of the ten directions like the sands of the Ganges River that have been taught by the buddhas: those who have taught, are teaching, will teach, and will teach; and those who want to believe, practice themselves, and teach for others should train in the perfection of wisdom!",
        "source": "T25n1509_034:0308b26_1"
    },
    {
        "source_sentence": "【論】問曰：上已說「十方諸佛所說，欲憶持不忘，當學般若」，今何以復說「信持三世佛法」？",
        "translation": "[Commentary] Q: As explained above, the buddhas of the ten directions who want to remember what they teach and don't forget it should train in prajñā, so why do they now say again, Faithfully maintaining the teachings of the buddhas of the three times?",
        "source": "T25n1509_034:0308b29_2"
    },
    {
        "source_sentence": "答曰：上說「欲憶持十方諸佛法」，未知是何法，故說十二部經是佛法，及聲聞所不聞者。",
        "translation": "Answer: The above teaching says, In order to remember the buddha-dharmas of the ten directions, we don't know what they are, so we say that twelve sūtras are buddha-dharmas and śrāvakas who don't hear them.",
        "source": "T25n1509_034:0308c02_3"
    },
    {
        "source_sentence": "上但言「恒河沙等世界諸佛」，今言「恒河沙三世諸佛法」。",
        "translation": "The above simply says, Such are the buddhas of the worlds as numerous as the sands of the Ganges River, but now it says, Sands of the Ganges River are the dharmas of the buddhas of the three times.",
        "source": "T25n1509_034:0308c04_4"
    },
    {
        "source_sentence": "又上但說「受持不忘」，不說受持利益；",
        "translation": "Further, the above is only saying that it is to be accepted and not to be rejected. It does not speak of the benefits of accepting and upholding.",
        "source": "T25n1509_034:0308c05_5"
    },
    {
        "source_sentence": "今言「自為，亦為他人說」，是故復說。",
        "translation": "Now, it's said, 'I do it for myself and I teach it for others.' That's why it's further explained.",
        "source": "T25n1509_034:0308c06_6"
    },
    {
        "source_sentence": "【經】「復次，舍利弗！",
        "translation": "[Sutra] Furthermore, Śāriputra!",
        "source": "T25n1509_034:0308c08_0"
    },
    {
        "source_sentence": "菩薩摩訶薩，過去諸佛說已，未來諸佛當說，欲聞，聞已，自利亦利他人，當學般若波羅蜜！」",
        "translation": "After the buddhas of the past have taught it, the buddhas of the future will teach it, and those who want to hear it or hear it and benefit themselves and others will train in the perfection of prajñāpāramitā!",
        "source": "T25n1509_034:0308c08_1"
    },
    {
        "source_sentence": "【論】問曰：十方現在佛所說法，可受、可持；",
        "translation": "[Commentary] Q: What is taught by the present buddhas in the ten directions can be accepted or upheld.",
        "source": "T25n1509_034:0308c10_2"
    },
    {
        "source_sentence": "過去已滅，未來未有，云何可聞？",
        "translation": "How can they be heard if the past has ceased and the future does not exist?",
        "source": "T25n1509_034:0308c11_3"
    },
    {
        "source_sentence": "答曰：此義先已答，今當更說。",
        "translation": "Answer: This meaning was previously answered, and I'll explain it again.",
        "source": "T25n1509_034:0308c12_4"
    },
    {
        "source_sentence": "菩薩有三昧，名「觀三世諸佛三昧」，菩薩入是三昧中，悉見三世諸佛，聞其說法。",
        "translation": "The bodhisattva has a concentration called observing the samādhi of the buddhas of the three times, in which he enters and sees all the buddhas of the three times and hears them teach.",
        "source": "T25n1509_034:0308c12_5"
    },
    {
        "source_sentence": "譬如外道神仙，於未來世事，未有形兆、未有言說，以智慧力故，亦見、亦聞。",
        "translation": "It's like a non-Buddhist sage who doesn't have form or words for future events, and because of the power of his wisdom, he also sees and hears them.",
        "source": "T25n1509_034:0308c14_6"
    },
    {
        "source_sentence": "復次，諸菩薩力不可思議，未來世雖未有形、未有言說，而能見、能聞。",
        "translation": "Furthermore, the powers of bodhisattvas are inconceivable, and even though they won't have form or words in future lives, they can see and hear them.",
        "source": "T25n1509_034:0308c16_7"
    },
    {
        "source_sentence": "或以陀羅尼力，或以今事比知過去、未來諸事。",
        "translation": "Perhaps it's because of the power of the dhāraṇī, or maybe it's because of the present situation that they know past and future events.",
        "source": "T25n1509_034:0308c17_8"
    },
    {
        "source_sentence": "以是故言：「欲得是者，當學般若波羅蜜。」",
        "translation": "That's why they say, If you want to attain this, you must train in the perfection of wisdom.",
        "source": "T25n1509_034:0308c19_0"
    },
    {
        "source_sentence": "【經】「十方如恒河沙等諸世界，中間闇處，日月所不照，欲持光明普照者，當學般若波羅蜜！」",
        "translation": "【經】「十方如恒河沙等諸世界,中間闇處,日月所不照照,欲持光明普照者,當學般若波羅蜜!」",
        "source": "T25n1509_034:0308c20_0"
    },
    {
        "source_sentence": "【論】菩薩從兜率天上欲降神母胎，爾時，身放光明，遍照一切世界及世間幽冥之處。",
        "translation": "[Commentary] When the bodhisattva was about to descend from Tuṣita Heaven into the mother's womb, his body emitted light that illuminated all worlds and the dark places in the world.",
        "source": "T25n1509_034:0308c22_0"
    },
    {
        "source_sentence": "次後生時，光明遍照，亦復如是。",
        "translation": "The same applies to the pervasive illumination of light at the moment subsequently arisen.",
        "source": "T25n1509_034:0308c23_1"
    },
    {
        "source_sentence": "初成道時、轉法輪時、般涅槃時，放大光明皆亦如是。",
        "translation": "When he first becomes enlightened, when he turns the wheel of the Dharma, and when he enters parinirvāṇa, it's likewise when he emanates great light.",
        "source": "T25n1509_034:0308c24_2"
    },
    {
        "source_sentence": "及於餘時現大神通，放大光明。",
        "translation": "At other times, he manifests great supernormal powers and radiates a ray of light.",
        "source": "T25n1509_034:0308c25_3"
    },
    {
        "source_sentence": "如欲說般若波羅蜜時，現大神通，以大光明遍照世間幽冥之處。",
        "translation": "When he wants to teach the perfection of wisdom, he manifests great supernormal powers and shines a great ray of light that illuminates the world's dark places.",
        "source": "T25n1509_034:0308c26_4"
    },
    {
        "source_sentence": "如是比，處處經中說神通光明。",
        "translation": "Thus, it's compared to the sūtras everywhere that speak of the light of supernormal powers.",
        "source": "T25n1509_034:0308c28_5"
    },
    {
        "source_sentence": "問曰：此是佛力，何以故說菩薩？",
        "translation": "Q: This is the Buddha's power, so why is it called a bodhisattva?",
        "source": "T25n1509_034:0308c28_6"
    },
    {
        "source_sentence": "答曰：今言菩薩欲得是者，當學般若波羅蜜。",
        "translation": "Answer: Now, it's said that bodhisattvas who want to attain this should train in the perfection of wisdom.",
        "source": "T25n1509_034:0308c29_7"
    },
    {
        "source_sentence": "諸大菩薩能有是力。",
        "translation": "Great bodhisattvas can have this kind of power.",
        "source": "T25n1509_034:0309a01_8"
    },
    {
        "source_sentence": "如遍吉菩薩，觀世音、得大勢、明網、無量光菩薩等，能有是力，身出無量光明，能照十方如恒河沙等世界。",
        "translation": "It's like the pervasively enlightened bodhisattva Avalokitêśvara, the Bodhisattva who has attained great momentum, the Net of Light, and the Bodhisattva of Immeasurable Light, who can have this power and produce an immeasurable amount of light from his body that illuminates the worlds in the ten directions like the sands of the Ganges.",
        "source": "T25n1509_034:0309a02_9"
    },
    {
        "source_sentence": "又如阿彌陀佛世界中，諸菩薩身出常光，照十萬由旬。",
        "translation": "It's also like when the bodies of the bodhisattvas in the world Amitâbha Buddha emanate eternal light that shines for 100,000 leagues.",
        "source": "T25n1509_034:0309a04_10"
    },
    {
        "source_sentence": "問曰：菩薩身光如是，本以何業因緣得？",
        "translation": "Q: Such is the light of the bodhisattva's body, so what was the cause and condition for its attainment in the past?",
        "source": "T25n1509_034:0309a06_0"
    },
    {
        "source_sentence": "答曰：身業清淨故身得莊嚴。",
        "translation": "Answer: Because bodily actions are pure, the body attains adornment.",
        "source": "T25n1509_034:0309a06_1"
    },
    {
        "source_sentence": "如經說：「有一鬼頭似猪，臭虫從口出，身有金色光明。",
        "translation": "As the sūtra explains, There's a ghost with a pig-like head that smells like an odorful bug coming out of its mouth and has a golden light shining from its body.",
        "source": "T25n1509_034:0309a07_2"
    },
    {
        "source_sentence": "是鬼宿世作比丘，惡口罵詈客比丘。",
        "translation": "That ghost is a monk who becomes a monk in the constellations and speaks harshly against guest monks.",
        "source": "T25n1509_034:0309a08_3"
    },
    {
        "source_sentence": "身持淨戒，故身有光明；",
        "translation": "Because the body keeps pure precepts, the body has light.",
        "source": "T25n1509_034:0309a09_4"
    },
    {
        "source_sentence": "口有惡言，故臭虫從口出。」",
        "translation": "Because there's bad speech in his mouth, the foul-smelling insect comes out of his mouth.",
        "source": "T25n1509_034:0309a10_5"
    },
    {
        "source_sentence": "如經說：「心清淨優劣，故光有上、中、下：少光、大光、光音。",
        "translation": "As the sūtra explains, Because the mind is pure and inferior, there's superior, middle, and inferior light: little light, great light, and sound of light.",
        "source": "T25n1509_034:0309a10_6"
    },
    {
        "source_sentence": "欲界諸天，心清淨布施、持戒，故身有光明。」",
        "translation": "The gods in the desire realm have a pure mind that gives generosity and observes precepts, so their bodies have light.",
        "source": "T25n1509_034:0309a12_7"
    },
    {
        "source_sentence": "復次，有人憐愍眾生故，於闇處然燈，亦為供養尊像、塔、寺故，亦以明珠、戶嚮、明鏡等明淨物布施故，身有光明。",
        "translation": "“Furthermore, because of their pity for sentient beings, some people have lamps placed in the dark places and offering them to venerate buddha images, stupas, and temples. They also give light beads, doorposts, luminous objects, mirrors, etc., which are pure and bright, so that they will have light on their bodies.",
        "source": "T25n1509_034:0309a13_8"
    },
    {
        "source_sentence": "復次，常修慈心，遍念眾生，心清淨故；",
        "translation": "“Furthermore, they always cultivate a mind of kindness, pervading sentient beings because their minds are pure.",
        "source": "T25n1509_034:0309a15_9"
    },
    {
        "source_sentence": "又常修念佛三昧，念諸佛光明神德故，得身光明。",
        "translation": "Also, he always cultivates the samādhi of mindfulness of the Buddha and attains the light of his body because of the miraculous power of mindfulness of the buddhas' radiance.",
        "source": "T25n1509_034:0309a16_10"
    },
    {
        "source_sentence": "復次，行者常修火一切入；",
        "translation": "“Furthermore, practitioners always develop all the sense-fields of fire.",
        "source": "T25n1509_034:0309a17_11"
    },
    {
        "source_sentence": "又以智慧光明，教化愚闇邪見眾生。",
        "translation": "Also, with the light of wisdom and insight, he teaches sentient beings who are ignorant and mistaken in their views.",
        "source": "T25n1509_034:0309a18_12"
    },
    {
        "source_sentence": "以是業因緣故，得心中智慧明，身亦有光。",
        "translation": "Because of these karmic causes and conditions, he attains wisdom and insight in his mind, and his body also has light.",
        "source": "T25n1509_034:0309a19_13"
    },
    {
        "source_sentence": "如是等業因緣，得身光清淨。",
        "translation": "Because of the causes and conditions of such actions, he attains purity in body radiance.",
        "source": "T25n1509_034:0309a20_14"
    },
    {
        "source_sentence": "【經】「十方如恒河沙等世界中，無有佛名、法名、僧名；",
        "translation": "[Sutra] In the worlds in the ten directions like the Ganges River, there are no buddha names, dharma names, or sangha names.",
        "source": "T25n1509_034:0309a21_0"
    },
    {
        "source_sentence": "欲使一切眾生皆得正見、聞三寶音者，當學般若波羅蜜！」",
        "translation": "If you want to cause all sentient beings to attain right view and hear the sounds of the Three Treasures, you should train in the perfection of prajñāpāramitā!",
        "source": "T25n1509_034:0309a22_1"
    },
    {
        "source_sentence": "【論】菩薩於先無佛法塔寺處，於中起塔，以是業因緣，後身得力成就；",
        "translation": "【論】菩薩於先無佛法塔寺處,於中起塔,以此業因緣,後身得力成就;",
        "source": "T25n1509_034:0309a23_2"
    },
    {
        "source_sentence": "於無佛法眾處，讚歎三寶，令眾生入於正見。",
        "translation": "In the absence of buddha-dharma congregations, they praise the Three Treasures and cause sentient beings to enter right view.",
        "source": "T25n1509_034:0309a25_3"
    },
    {
        "source_sentence": "如經說：「有人於先無佛塔國土中，修立塔廟，得梵福德，梵名無量福德；",
        "translation": "As the sūtra explains, “Some people built stupas and shrines in previously nonexistent buddha-tached lands to attain the merit of Brahmā. The name Brahmā has immeasurable merit.",
        "source": "T25n1509_034:0309a26_4"
    },
    {
        "source_sentence": "以是因緣，疾得禪定；",
        "translation": "Because of these causes and conditions, he quickly attained meditative absorption.",
        "source": "T25n1509_034:0309a27_5"
    },
    {
        "source_sentence": "得禪定故，得無量神通；",
        "translation": "Because of attaining meditative absorption they attain immeasurable supernatural powers.",
        "source": "T25n1509_034:0309a28_6"
    },
    {
        "source_sentence": "神通力故，能到十方讚歎三寶。」",
        "translation": "Because of their supernormal powers, they can go to the ten directions and praise the Three Treasures.",
        "source": "T25n1509_034:0309a28_7"
    },
    {
        "source_sentence": "「正見」者，若先不識三寶功德，因菩薩故得信三寶；",
        "translation": "The expression right view means that if someone didn't know the merits of the Three Treasures before, they would attain faith in the Three Treasures because of enlightening beings.",
        "source": "T25n1509_034:0309a29_8"
    },
    {
        "source_sentence": "信三寶故，信業因緣罪福；",
        "translation": "Because of faith in the three treasures, blameworthiness and blameworthiness are the causes and conditions for believing actions.",
        "source": "T25n1509_034:0309b01_9"
    },
    {
        "source_sentence": "信業因緣故，信世間是縛、涅槃是解。",
        "translation": "Because of the karmic cause and condition of faith, faith in the world is bondage, and nirvāṇa is liberation.",
        "source": "T25n1509_034:0309b02_10"
    },
    {
        "source_sentence": "讚歎三寶義，如「八念」中說。",
        "translation": "The meaning of praising the Three Treasures is as explained in Eight Mindfulness.",
        "source": "T25n1509_034:0309b03_11"
    },
    {
        "source_sentence": "【經】「菩薩摩訶薩，欲令十方如恒河沙等世界中眾生，以我力故，盲者得視、聾者得聽、狂者得念、裸者得衣、飢渴者得飽滿者，當學般若波羅蜜！」",
        "translation": "[Sutra]: If a bodhisattva Mahāsattva wants to cause sentient beings in the worlds in the ten directions like the sands of the Ganges River and so forth in the worlds, it's because of my power that the blind get eyesight, the deaf get ears, the crazy get thoughts, the naked get robes, and the hungry and thirsty get full nourishment",
        "source": "T25n1509_034:0309b04_0"
    },
    {
        "source_sentence": "【論】菩薩行無礙般若波羅蜜，若得無礙解脫成佛、若作法性生身菩薩——如文殊師利等，在十住地，有種種功德具足；",
        "translation": "[Commentary] If a bodhisattva practices the unobstructed prajñāpāramitā, he becomes a buddha if he attains unobstructed liberation and makes a bodhisattva body that gives rise to the Dharma-like Mañjuśrī and others who are in the stage of the ten abodes and have various merits.",
        "source": "T25n1509_034:0309b07_1"
    },
    {
        "source_sentence": "眾生見者，皆得如願。",
        "translation": "All sentient beings who see it will attain it as they wish.",
        "source": "T25n1509_034:0309b10_2"
    },
    {
        "source_sentence": "譬如如意珠，所欲皆得；",
        "translation": "It is like the wish-granting jewel that obtains whatever one wishes.",
        "source": "T25n1509_034:0309b10_3"
    },
    {
        "source_sentence": "法性生身佛及法性生身菩薩，人有見者，皆得所願，亦復如是。",
        "translation": "It's likewise with the Dharma-nature body buddha and Dharma-nature body bodhisattva who give rise to the body of Dharma, and those who have views will all attain what they wish.",
        "source": "T25n1509_034:0309b11_4"
    },
    {
        "source_sentence": "復次，菩薩從初發意已來，於無量劫中，治一切眾生九十六種眼病；",
        "translation": "“Furthermore, since the enlightening being’s initial determination for enlightenment, over countless eons he has cured all sentient beings of ninety-six kinds of eye ailments.",
        "source": "T25n1509_034:0309b12_5"
    },
    {
        "source_sentence": "又於無量世中，自以眼布施眾生；",
        "translation": "In countless worlds he gave his own eyes to sentient beings.",
        "source": "T25n1509_034:0309b14_6"
    },
    {
        "source_sentence": "又智慧光明，破邪見黑闇；",
        "translation": "Also, the light of knowledge and wisdom destroys the darkness of wrong views.",
        "source": "T25n1509_034:0309b15_0"
    },
    {
        "source_sentence": "又以大悲，欲令眾生所願皆得。",
        "translation": "Also, with great compassion, they want to cause all the wishes of sentient beings to be obtained.",
        "source": "T25n1509_034:0309b15_1"
    },
    {
        "source_sentence": "如是業因緣，云何令眾生見菩薩身而不得眼？",
        "translation": "As a result of these karmic causes and conditions, how do they cause sentient beings to see the bodhisattva's body but not have eyes?",
        "source": "T25n1509_034:0309b16_2"
    },
    {
        "source_sentence": "餘事亦如是。",
        "translation": "The same applies to the other things.",
        "source": "T25n1509_034:0309b17_3"
    },
    {
        "source_sentence": "此諸義，如「放光」中說。",
        "translation": "These meanings are explained in Emission of Light.",
        "source": "T25n1509_034:0309b17_4"
    },
    {
        "source_sentence": "◎◎【經】「復次，舍利弗！",
        "translation": "Śāriputra, furthermore, Śāriputra!",
        "source": "T25n1509_034:0309b18_5"
    },
    {
        "source_sentence": "菩薩摩訶薩，若欲令十方如恒沙等世界中眾生，諸在三惡趣者，以我力故皆得人身者，當學般若波羅蜜！」",
        "translation": "If a bodhisattva-mahāsattva wants to cause sentient beings in the ten directions like the sands of the Ganges in worlds in the three bad destinies to attain personal status because of my power, he or she should train in the perfection of wisdom!",
        "source": "T25n1509_034:0309b19_6"
    },
    {
        "source_sentence": "【論】問曰：自以善業因緣故得人身，云何菩薩言「以我力因緣故，令三惡道中眾生皆得人身」？",
        "translation": "[Commentary] Q: Why does the bodhisattva say, It's because of the causes and conditions of good actions that he obtains a human body, and why does the bodhisattva say, It's because of the causes and conditions of self-power that all sentient beings in the three bad destinies attain a human body?",
        "source": "T25n1509_034:0309b22_0"
    },
    {
        "source_sentence": "答曰：不言「以菩薩業因緣令眾生得人身」，但言「菩薩恩力因緣故得」。",
        "translation": "Answer: It doesn't say, 'It's because of the causes and conditions of bodhisattva actions that sentient beings attain a human body,' but it only says, Attained by the causes and conditions of the bodhisattva's kindness.",
        "source": "T25n1509_034:0309b24_1"
    },
    {
        "source_sentence": "菩薩以神通變化說法力故，令眾生修善得人身。",
        "translation": "Because of the power of the bodhisattva's miraculous transformation and teaching, he causes sentient beings to cultivate goodness and attain a human body.",
        "source": "T25n1509_034:0309b25_2"
    },
    {
        "source_sentence": "如《經》中說：「二因緣發起正見：一者、外聞正法，二者、內有正念。」",
        "translation": "As the sūtras say, There are two causes and conditions that give rise to right view: 1. hearing the right teaching externally and having right mindfulness internally.",
        "source": "T25n1509_034:0309b26_3"
    },
    {
        "source_sentence": "又如草木，內有種子、外有雨澤，然後得生。",
        "translation": "It's also like grass and trees that have seeds inside and rain and marsh outside, and then they can grow.",
        "source": "T25n1509_034:0309b28_4"
    },
    {
        "source_sentence": "若無菩薩，眾生雖有業因緣，無由發起。",
        "translation": "In the absence of bodhisattvas, even though sentient beings have karmic causes and conditions, there's no way to give rise to them.",
        "source": "T25n1509_034:0309b29_5"
    },
    {
        "source_sentence": "以是故知諸佛菩薩所益甚多！",
        "translation": "Because of this, you know that the benefits of the buddhas and bodhisattvas are so great!",
        "source": "T25n1509_034:0309c01_6"
    },
    {
        "source_sentence": "問曰：云何能令三惡道中眾生皆得解脫？",
        "translation": "Q: How can it cause sentient beings in the three bad destinies to attain liberation?",
        "source": "T25n1509_034:0309c02_0"
    },
    {
        "source_sentence": "佛尚不能，何況菩薩！",
        "translation": "The Buddha still can't, so why wouldn't the bodhisattva?",
        "source": "T25n1509_034:0309c02_1"
    },
    {
        "source_sentence": "答曰：菩薩心願欲爾，則無過咎。",
        "translation": "Answer: If the bodhisattva wishes to do so, there's nothing wrong with it.",
        "source": "T25n1509_034:0309c03_2"
    },
    {
        "source_sentence": "又多得解脫，故言「一切」。",
        "translation": "Also, many people attain liberation, so they're called all.",
        "source": "T25n1509_034:0309c04_3"
    },
    {
        "source_sentence": "如諸佛及大菩薩身遍出無量光明，從是光明出無量化身，遍入十方三惡道中：令地獄火滅湯冷，其中眾生心清淨故，生天上、人中；",
        "translation": "“Furthermore, the buddhas and great enlightening beings emanate infinite rays of light from their bodies. From these rays of light emanating infinite transformation bodies, they enter the three evil destinies in the ten directions:",
        "source": "T25n1509_034:0309c04_4"
    },
    {
        "source_sentence": "令餓鬼道飢渴飽滿，開發善心，得生天、人中；",
        "translation": "Causing hunger and thirst in the realm of hungry ghosts to be satisfied, they develop good intentions and are able to be reborn among gods or humans.",
        "source": "T25n1509_034:0309c07_5"
    },
    {
        "source_sentence": "令畜生道隨意得食，離諸恐怖，開發善心，亦得生天、人中。",
        "translation": "He causes the animal kingdom to obtain food as he wishes, frees himself from fear and develops good intentions, and can be born among gods or humans.",
        "source": "T25n1509_034:0309c08_6"
    },
    {
        "source_sentence": "如是名為「一切三惡道得解脫」。",
        "translation": "Thus, it's called liberation from all three bad destinies.",
        "source": "T25n1509_034:0309c10_7"
    },
    {
        "source_sentence": "問曰：如餘經說「生天、人中」，此何以但說「皆得人身」？",
        "translation": "Q: As other sūtras say, born among gods and humans, why is it that they all attain the human body?",
        "source": "T25n1509_034:0309c11_8"
    },
    {
        "source_sentence": "答曰：於人中得修大功德，亦受福樂；",
        "translation": "Answer: Among people who cultivate great virtue, they also experience blessings and happiness.",
        "source": "T25n1509_034:0309c12_9"
    },
    {
        "source_sentence": "天上多著樂故，不能修道。",
        "translation": "Because the gods are mostly attached to pleasure, they can't cultivate it.",
        "source": "T25n1509_034:0309c13_10"
    },
    {
        "source_sentence": "以是故願令皆得人身。",
        "translation": "Because of this, I wish to cause them all to attain a human body.",
        "source": "T25n1509_034:0309c13_11"
    },
    {
        "source_sentence": "復次，菩薩不願眾生但受福樂，欲令得解脫，常樂涅槃，以是故不說生天上。",
        "translation": "Furthermore, bodhisattvas don't want sentient beings to simply experience merit and happiness, want to attain liberation, and always delight in nirvāṇa; therefore, they don't say they'll be born in heaven.",
        "source": "T25n1509_034:0309c14_12"
    },
    {
        "source_sentence": "【經】「欲令十方如恒河沙等世界中眾生，以我力故，立於戒、三昧、智慧、解脫、解脫知見，令得須陀洹果，乃至阿耨多羅三藐三菩提者，當學般若波羅蜜！」",
        "translation": "[Sutra] If you want to cause sentient beings in the worlds in the ten directions like the sands of the Ganges River to establish precepts, samādhi, wisdom, liberation, and the knowledge and vision of liberation because of my power, so that they attain the fruit of stream entry and even unsurpassed, correct, and complete enlightenment, you should train in the perfection of wisdom!",
        "source": "T25n1509_034:0309c17_0"
    },
    {
        "source_sentence": "【論】問曰：先已說此五眾、道果，今何以更說？",
        "translation": "[Commentary] Q: I've already explained these five groups of people and the fruit of the path, so why would I explain them again?",
        "source": "T25n1509_034:0309c20_1"
    },
    {
        "source_sentence": "答曰：上說但是聲聞法，從須陀洹乃至無餘涅槃；",
        "translation": "Answer: The above-mentioned doctrine is only the doctrine of the sravakas: from stream-entry up to nirvana without remainder.",
        "source": "T25n1509_034:0309c21_2"
    },
    {
        "source_sentence": "今雜說三乘：聲聞、辟支佛，乃至阿耨多羅三藐三菩提。",
        "translation": "Now, it's a mixture of the three vehicles: śrāvakas, pratyekabuddhas, and even unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_034:0309c22_3"
    },
    {
        "source_sentence": "【經】「復次，舍利弗！",
        "translation": "[Sutra] Furthermore, Śāriputra!",
        "source": "T25n1509_034:0309c24_0"
    },
    {
        "source_sentence": "菩薩摩訶薩欲學諸佛威儀者，當學般若波羅蜜！」",
        "translation": "A bodhisattva-mahāsattva who wants to train in the Buddha's manner should train in the perfection of prajñāpāramitā!",
        "source": "T25n1509_034:0309c24_1"
    },
    {
        "source_sentence": "【論】問曰：何等是諸佛威儀？",
        "translation": "[Commentary] Q: What's the manner of the buddhas?",
        "source": "T25n1509_034:0309c25_2"
    },
    {
        "source_sentence": "答曰：威儀名身四動止。",
        "translation": "Answer: Deportment is called the four bodily movements and cessation.",
        "source": "T25n1509_034:0309c26_3"
    },
    {
        "source_sentence": "譬如象王，迴身而觀；",
        "translation": "It is as if an elephant king were to turn around and look around.",
        "source": "T25n1509_034:0309c26_4"
    },
    {
        "source_sentence": "行時足離地四指，雖不蹈地而輪跡現；",
        "translation": "When he walks his feet are four fingers apart from the ground. Although he does not tread on the ground, his footprints appear in all directions.",
        "source": "T25n1509_034:0309c27_5"
    },
    {
        "source_sentence": "不遲不疾，身不傾動；",
        "translation": "They are neither slow nor fast, and their bodies don’t incline.",
        "source": "T25n1509_034:0309c28_6"
    },
    {
        "source_sentence": "常舉右手安慰眾生；",
        "translation": "He always held up his right hand to comfort sentient beings.",
        "source": "T25n1509_034:0309c28_7"
    },
    {
        "source_sentence": "結加趺坐，其身正直；",
        "translation": "He sat cross-legged, his body straight and upright.",
        "source": "T25n1509_034:0309c29_8"
    },
    {
        "source_sentence": "常偃右脇，累膝而臥；",
        "translation": "He always stood on his right side, kneeling and lying cross-legged.",
        "source": "T25n1509_034:0309c29_9"
    },
    {
        "source_sentence": "所敷草蓐，齊整不亂；",
        "translation": "The grass and shrubs planted there are arranged neatly without disturbance.",
        "source": "T25n1509_034:0310a01_10"
    },
    {
        "source_sentence": "食不著味，美惡等一；",
        "translation": "Eating is not attached to taste: such [things] as deliciousness and evil are one.",
        "source": "T25n1509_034:0310a01_11"
    },
    {
        "source_sentence": "若受人請，默然無違；",
        "translation": "If he receives an invitation, he remains silent and not disobeying it.",
        "source": "T25n1509_034:0310a02_12"
    },
    {
        "source_sentence": "言辭柔渜，方便利益，不失時節。",
        "translation": "He speaks gently and patiently, benefiting people with skillful means without losing time or season.",
        "source": "T25n1509_034:0310a02_13"
    },
    {
        "source_sentence": "復次，法身佛威儀者，過東方如恒河沙等世界以為一步；",
        "translation": "“Furthermore, the deportment of buddhas of the body of truth is one step beyond worlds as numerous as the grains of sand in the Ganges River in the east.",
        "source": "T25n1509_034:0310a03_14"
    },
    {
        "source_sentence": "梵音說法，亦復如是。",
        "translation": "So it is with the explanation of the Dharma preached in Sanskrit.",
        "source": "T25n1509_034:0310a04_15"
    },
    {
        "source_sentence": "法身佛相義，如先說。",
        "translation": "The meaning of the buddha-form of the Dharma body is as has been said previously.",
        "source": "T25n1509_034:0310a05_16"
    },
    {
        "source_sentence": "【經】「復次，菩薩摩訶薩欲得如象王視觀者，當學般若波羅蜜！",
        "translation": "[Sutra] Furthermore, if a bodhisattva-mahāsattva wants to attain the contemplation like an elephant king, he should train in the perfection of wisdom!",
        "source": "T25n1509_034:0310a06_0"
    },
    {
        "source_sentence": "菩薩作是願：『使我行時離地四指，足不蹈地。",
        "translation": "The bodhisattva made this vow, saying, 'May I leave my four fingers on the ground while walking and not touch the ground with my feet.",
        "source": "T25n1509_034:0310a07_1"
    },
    {
        "source_sentence": "我當共四天王天乃至阿迦尼吒天、無量千萬億諸天眾圍繞恭敬，至菩提樹下』者，當學般若波羅蜜！」",
        "translation": "I will go to the foot of the bodhi tree with the four heavenly kings and gods, even the Akaniṣṭha gods and measureless thousands of myriads of koṭis of gods surrounded and respected by them, and then you'll train in the perfection of prajñāpāramitā!",
        "source": "T25n1509_034:0310a08_2"
    },
    {
        "source_sentence": "【論】「如象王視」者，若欲迴身觀時，舉身俱轉。",
        "translation": "[Commentary] Just as the elephant king looks, this means that when he wants to turn around and look at his body, he raises his body together with it.",
        "source": "T25n1509_034:0310a11_0"
    },
    {
        "source_sentence": "大人相者，身心專一；",
        "translation": "The characteristics of great beings are that their bodies and minds are exclusively one.",
        "source": "T25n1509_034:0310a12_1"
    },
    {
        "source_sentence": "是故若有所觀，身心俱迴。",
        "translation": "Therefore, if there's contemplation, both body and mind will turn back.",
        "source": "T25n1509_034:0310a12_2"
    },
    {
        "source_sentence": "譬如師子有所搏撮，不以小物故而改其壯勢；",
        "translation": "It is as if a lion were to fight and snatch something, not changing its vigor because of small things.",
        "source": "T25n1509_034:0310a13_3"
    },
    {
        "source_sentence": "佛亦如是，若有所觀、若有所說，身與心俱，常不分散。",
        "translation": "The Buddha is also like this. If he observes or explains something, his body and mind are always together, without dispersion.",
        "source": "T25n1509_034:0310a14_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_034:0310a15_5"
    },
    {
        "source_sentence": "從無數劫來，集一心法；",
        "translation": "Since innumerable past ages they have collected the doctrine of unity of mind.",
        "source": "T25n1509_034:0310a15_6"
    },
    {
        "source_sentence": "以是業因緣故，頂骨與身為一，無有分解。",
        "translation": "Because of these karmic causes and conditions, the topknot bones and the body are one and the same, without disintegration.",
        "source": "T25n1509_034:0310a16_7"
    },
    {
        "source_sentence": "又以世世破憍慢故，不輕眾生，觀則俱轉。",
        "translation": "It's also because the worldly refutation of arrogance doesn't despise sentient beings, and contemplation then proceeds together.",
        "source": "T25n1509_034:0310a17_8"
    },
    {
        "source_sentence": "如《尼陀阿波陀那》中說：舍婆提國除糞人，而佛以手摩頭，教令出家，猶不輕之。",
        "translation": "As it's said in the Nirdhâvāsa-āpanna, The country of Śrāvastī removes excrement, but the Buddha touches his head with his hand and teaches him to leave home, yet he doesn't despise it.",
        "source": "T25n1509_034:0310a18_9"
    },
    {
        "source_sentence": "「足離地四指」者，佛若常飛，眾生疑怪，謂佛非是人類，則不歸附；",
        "translation": "The phrase feet four fingers off the ground means that if a buddha always flies, sentient beings will doubt and wonder, saying that the buddhas aren't human beings, then they won't be attached.",
        "source": "T25n1509_034:0310a20_10"
    },
    {
        "source_sentence": "若足到地，則眾生以為與常人不異，不生敬心。",
        "translation": "If someone reaches the ground with their feet, then sentient beings think they're no different from ordinary people and don't become respectful.",
        "source": "T25n1509_034:0310a21_11"
    },
    {
        "source_sentence": "是故雖為行地，四指不到而輪跡現。",
        "translation": "Therefore, even though it's the ground of practice, the four fingers don't reach it, and the traces of the wheel appear.",
        "source": "T25n1509_034:0310a22_12"
    },
    {
        "source_sentence": "問曰：如佛常放丈光、足不到地，眾生何以故不盡敬附？",
        "translation": "Q: Suppose the Buddha always emits a ten-foot radiance and his feet don't reach the ground, so why don't sentient beings venerate it in full?",
        "source": "T25n1509_034:0310a23_13"
    },
    {
        "source_sentence": "答曰：眾生無量劫中積罪甚重，無明垢深，於佛生疑，謂是幻師，以術誑人；",
        "translation": "Answer: Sentient beings have accumulated a great deal of blameworthy sins over immeasurable kalpas, deeply stained by ignorance. They doubt the Buddha and say that he is an illusory teacher who deceives people with magic tricks.",
        "source": "T25n1509_034:0310a25_14"
    },
    {
        "source_sentence": "或言：「足不蹈地，生性自爾，如鳥能飛，有何奇特！」",
        "translation": "Some people say, It's natural by nature that the feet don't touch the ground; it's like a bird that can fly, so what's extraordinary!",
        "source": "T25n1509_034:0310a26_15"
    },
    {
        "source_sentence": "或有眾生罪重因緣故，不見佛相，直謂大威德沙門而已；",
        "translation": "Because some sentient beings did not see the buddha images due to serious sins, simply saying that they were Mahāprajñāpāramitā śramaṇas.",
        "source": "T25n1509_034:0310a28_0"
    },
    {
        "source_sentence": "譬如人重病欲死，名藥美食，皆謂臭穢，是故不盡敬附。",
        "translation": "It's like when a person is seriously ill and wants to die, and they're all called medicinal and delicious food that smells bad; therefore, they don't end up paying respect to it.",
        "source": "T25n1509_034:0310a29_1"
    },
    {
        "source_sentence": "「共四天王，乃至阿迦尼吒無量千萬億諸天眾，恭敬圍繞至菩提樹下」者，是諸佛常法。",
        "translation": "Together with the four heavenly kings and measureless thousands of myriads of koṭis of gods in Akaniṣṭha, they respectfully surround themselves at the foot of the bodhi tree. This is the eternal teaching of the buddhas.",
        "source": "T25n1509_034:0310b01_2"
    },
    {
        "source_sentence": "佛為世尊，至菩提樹下，欲破二種魔：一者結使魔、二者自在天子魔，欲成一切智；",
        "translation": "“The Buddha, the World-honored One, went to the foot of the enlightenment tree in order to destroy two kinds of demons: the first is the demon that binds sentient beings and the second is the demon that controls celestial beings, wanting to attain omniscience.",
        "source": "T25n1509_034:0310b03_3"
    },
    {
        "source_sentence": "是諸天眾，云何不恭敬侍送？",
        "translation": "Why don't these celestial beings venerate and escort them?",
        "source": "T25n1509_034:0310b05_4"
    },
    {
        "source_sentence": "又諸天世世佐助擁護菩薩，乃至出家時，令諸宮人婇女，淳惛而臥，捧馬足踰城出。",
        "translation": "Also, the gods and goddesses from time to time assisted the bodhisattva in supporting him, and when he left home, they caused the palace officials and court ladies to simply lie down with their legs crossing the city at the feet of a horse.",
        "source": "T25n1509_034:0310b06_5"
    },
    {
        "source_sentence": "今日事辦，我等當共侍送至菩提樹下。",
        "translation": "Today, we'll escort you to the foot of the bodhi tree with us.",
        "source": "T25n1509_034:0310b08_6"
    },
    {
        "source_sentence": "問曰：何以不說剎利、婆羅門等無量人侍送，而但說「諸天」？",
        "translation": "Q: Why isn't it said that the kṣatriyas and brāhmaṇas are accompanied by measureless people but only say, gods?",
        "source": "T25n1509_034:0310b09_7"
    },
    {
        "source_sentence": "答曰：佛獨於深林中求菩提樹，非是人行處，是故不說。",
        "translation": "Answer: The Buddha was alone in the deep forest seeking the bodhi tree, not a place where people would walk; therefore, he didn't explain it.",
        "source": "T25n1509_034:0310b10_8"
    },
    {
        "source_sentence": "又以人無天眼、他心智故，不知佛當成道，是故不說。",
        "translation": "Also, because people lack divine vision and knowledge of the minds of others, they don't know that the Buddha will become a buddha, so they won't explain it.",
        "source": "T25n1509_034:0310b11_9"
    },
    {
        "source_sentence": "復次，諸天貴於人，故但說天。",
        "translation": "Furthermore, because the gods are esteemed by humans, they are only referred to as gods.",
        "source": "T25n1509_034:0310b13_10"
    },
    {
        "source_sentence": "復次，諸佛常樂閑靜處，諸天能隱身不現，不妨閑靜，是故但說諸天從。",
        "translation": "Furthermore, the buddhas always delight in a secluded place. The gods are able to hide their bodies but do not show them; it is better to be secluded. That is why they only speak of celestial beings as followers.",
        "source": "T25n1509_034:0310b13_11"
    },
    {
        "source_sentence": "復次，菩薩見五比丘捨菩薩而去，而菩薩獨至樹下，是故作是願。",
        "translation": "Furthermore, when the bodhisattva saw five monks abandoning the bodhisattva and leaving him, the bodhisattva went alone under a tree; therefore, he made this vow.",
        "source": "T25n1509_034:0310b15_12"
    },
    {
        "source_sentence": "【經】「『我當於菩提樹下坐，四天王天乃至阿迦尼吒天，以天衣為座』者，當學般若波羅蜜！」",
        "translation": "[Sutra] 'I will sit under the bodhi tree, and the gods of the four heavenly kings or even the Akaniṣṭha gods will take my heavenly robe as their seat,' you must train in the perfection of prajñāpāramitā!",
        "source": "T25n1509_034:0310b18_0"
    },
    {
        "source_sentence": "【論】問曰：如經說「佛敷草樹下坐而成佛道」，今云何願言「以天衣為座」？",
        "translation": "[Commentary] Q: As the sūtra says, The Buddha spreads out his seat under a tree of grass to accomplish the Buddha Way, why would he now wish to say, 'Take my heavenly robe as my seat?'",
        "source": "T25n1509_034:0310b20_0"
    },
    {
        "source_sentence": "答曰：聲聞經中說敷草。",
        "translation": "Answer: In the śrāvaka sūtras, it's said to spread grass.",
        "source": "T25n1509_034:0310b21_1"
    },
    {
        "source_sentence": "摩訶衍經中隨眾生所見——或有見敷草樹下，或見敷天綩綖——隨其福德多少，所見不同。",
        "translation": "In the Mahāyāna sūtras, according to what sentient beings see - some see it spread under grass and trees, or some see it spread in celestial bushes - depending on how much merit they have, their views are different.",
        "source": "T25n1509_034:0310b22_2"
    },
    {
        "source_sentence": "復次，生身佛把草樹下；",
        "translation": "“Furthermore, the buddha Birth-body Buddha was holding a blade of grass under a tree.",
        "source": "T25n1509_034:0310b24_3"
    },
    {
        "source_sentence": "法性生身佛以天衣為座，或勝天衣。",
        "translation": "The buddha Dharma-nature-body-generating body Buddha uses heavenly robes as his seat, or he might prefer heavenly robes.",
        "source": "T25n1509_034:0310b24_4"
    },
    {
        "source_sentence": "復次，佛於深林樹下成佛，林中人見，則奉佛草。",
        "translation": "Furthermore, when the Buddha became a buddha under a tree in a deep forest, people in the forest saw him and offered him the Buddha's grass.",
        "source": "T25n1509_034:0310b25_5"
    },
    {
        "source_sentence": "若貴人見者，當以所貴衣服為座；",
        "translation": "If a noble person sees it, he should make his seat of precious raiment.",
        "source": "T25n1509_034:0310b26_6"
    },
    {
        "source_sentence": "但林中無貴人故，時諸龍神天，各以妙衣為座。",
        "translation": "But there were no no noble people in the forest, so the dragons and gods each had a wonderful robe as their seat.",
        "source": "T25n1509_034:0310b27_7"
    },
    {
        "source_sentence": "四天王衣重二兩；",
        "translation": "The robes of the four guardian gods weighed two taels.",
        "source": "T25n1509_034:0310b28_8"
    },
    {
        "source_sentence": "忉利天衣重一兩；",
        "translation": "The garments of the Trāyastriṃśa gods weighed one tael.",
        "source": "T25n1509_034:0310b29_0"
    },
    {
        "source_sentence": "夜摩天衣重十八銖；",
        "translation": "The celestial robe of Yama weighs eighteen zhu.",
        "source": "T25n1509_034:0310b29_1"
    },
    {
        "source_sentence": "兜率天衣重十二銖；",
        "translation": "The robes of the gods in Tuṣita weighed twelve zhu.",
        "source": "T25n1509_034:0310b29_2"
    },
    {
        "source_sentence": "化樂天衣重六銖；",
        "translation": "The robes of the Nirmāṇaratideva gods weighed six zhu.",
        "source": "T25n1509_034:0310c01_3"
    },
    {
        "source_sentence": "他化自在天衣重三銖。",
        "translation": "The garments of the Paranirmita-vaśavartin Heaven weigh three zhu.",
        "source": "T25n1509_034:0310c01_4"
    },
    {
        "source_sentence": "色界天衣無重相。",
        "translation": "The robes of the gods in the form realm have no heavy marks.",
        "source": "T25n1509_034:0310c02_5"
    },
    {
        "source_sentence": "欲界天衣從樹邊生，無縷無織；",
        "translation": "The heavenly garments of the realm of sexual passion are produced from trees, without thread or woven fabric.",
        "source": "T25n1509_034:0310c02_6"
    },
    {
        "source_sentence": "譬如薄氷，光曜明淨，有種種色。",
        "translation": "It's like thin ice that shines brightly and clearly pure, with various colors.",
        "source": "T25n1509_034:0310c03_7"
    },
    {
        "source_sentence": "色界天衣，純金色光明，不可稱知。",
        "translation": "The celestial robes of the form realm are purely golden in color and shining bright, which can't be called known.",
        "source": "T25n1509_034:0310c04_8"
    },
    {
        "source_sentence": "如是等寶衣敷座，菩薩坐上，成阿耨多羅三藐三菩提。",
        "translation": "Thus, these jeweled robes spread out their seats, and the bodhisattva sat on them to attain unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_034:0310c05_0"
    },
    {
        "source_sentence": "問曰：何以但說諸天敷衣，不說十方諸大菩薩為佛敷座？",
        "translation": "Q: Why is it that they only say the gods spread their robes and not the great bodhisattvas in the ten directions spread their seats for the Buddha?",
        "source": "T25n1509_034:0310c06_1"
    },
    {
        "source_sentence": "諸菩薩等，佛將成道時，皆為佛敷座——或廣長一由旬，十百千萬億乃至無量由旬；",
        "translation": "When the Buddha was about to attain enlightenment, all the bodhisattvas prepared their seats for him. Some of them were one yojana in width and length, some ten hundred myriads of koṭis, up to an infinite number of yojanas long.",
        "source": "T25n1509_034:0310c07_2"
    },
    {
        "source_sentence": "高亦如是。",
        "translation": "So it is with the height.",
        "source": "T25n1509_034:0310c09_3"
    },
    {
        "source_sentence": "此諸寶座，是菩薩無漏福德生故，是諸天目所不見，何況手觸！",
        "translation": "These jeweled seats are the result of the uncontaminated virtue produced by the bodhisattva, which is not seen by the eyes of gods, so why wouldn't they see it, let alone by touching it with their hands?",
        "source": "T25n1509_034:0310c09_4"
    },
    {
        "source_sentence": "十方三世諸佛，降魔得道，莊嚴佛事，皆悉照見，譬如明鏡；",
        "translation": "The buddhas of the ten directions and three time periods, having subdued Māra and attained enlightenment, adorned the deeds of buddhahood, all shone as brightly as a clear mirror.",
        "source": "T25n1509_034:0310c11_5"
    },
    {
        "source_sentence": "如是妙座，何以不說？",
        "translation": "Why don't you explain such a marvelous seat?",
        "source": "T25n1509_034:0310c12_6"
    },
    {
        "source_sentence": "答曰：般若波羅蜜有二種：一者、與聲聞、菩薩、諸天共說，二者、但與十住具足菩薩說。",
        "translation": "Answer: There are two kinds of prajñā-pāramitā: first, shared with śrāvakas, bodhisattvas, and gods, and second, shared only with the bodhisattvas who are fully endowed with the ten abodes.",
        "source": "T25n1509_034:0310c12_7"
    },
    {
        "source_sentence": "是般若波羅蜜中，應說菩薩為佛敷座。",
        "translation": "In this prajñāpāramitā, it should be said that the bodhisattva spreads out his seat for the Buddha.",
        "source": "T25n1509_034:0310c14_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_034:0310c15_9"
    },
    {
        "source_sentence": "諸天知佛恩，不及一生、二生諸大菩薩；",
        "translation": "The gods knew the Buddha’s benevolence, but they did not outweigh the great enlightening beings of one and two world ages.",
        "source": "T25n1509_034:0310c16_10"
    },
    {
        "source_sentence": "如是，菩薩云何不以神通力而供養佛！",
        "translation": "Thus, why wouldn't bodhisattvas use their spiritual powers to make offerings to the Buddha?",
        "source": "T25n1509_034:0310c17_0"
    },
    {
        "source_sentence": "是中合聲聞說，是故不說。",
        "translation": "This is combined with what śrāvakas say, so it's not explained.",
        "source": "T25n1509_034:0310c17_1"
    },
    {
        "source_sentence": "【經】「『我得阿耨多羅三藐三菩提時，行、住、坐、臥處，欲使悉為金剛』者，當學般若波羅蜜！」",
        "translation": "[Sutra] 'When I attain unsurpassed, correct, and complete enlightenment, I'll train in the perfection of prajñāpāramitā when I walk, stand, sit, and lie down, wanting to make them all adamantine!'",
        "source": "T25n1509_034:0310c19_0"
    },
    {
        "source_sentence": "【論】問曰：何以故佛四威儀中，地悉為金剛？",
        "translation": "[Commentary] Q: Why is it that in the Buddha's four comportments, the ground is all adamantine?",
        "source": "T25n1509_034:0310c21_0"
    },
    {
        "source_sentence": "答曰：有人言：菩薩至菩提樹下時，於此處坐，得阿耨多羅三藐三菩提；",
        "translation": "Answer: Some people say that when an enlightening being arrives at the foot of a tree of enlightenment, he sits there and attains unexcelled complete perfect enlightenment.",
        "source": "T25n1509_034:0310c21_1"
    },
    {
        "source_sentence": "爾時菩薩入諸法實相中，無有地能舉是菩薩。",
        "translation": "At that point, the bodhisattva enters into the true characteristics of all dharmas, and there's no place where he can be called a bodhisattva.",
        "source": "T25n1509_034:0310c23_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_034:0310c24_3"
    },
    {
        "source_sentence": "地皆是眾生虛誑業因緣報故有，是故不能舉。",
        "translation": "Because earth is the causal retribution of sentient beings’ shameful deeds, it cannot be raised.",
        "source": "T25n1509_034:0310c24_4"
    },
    {
        "source_sentence": "菩薩欲成佛時，實相智慧身，是時坐處變為金剛。",
        "translation": "When the bodhisattva wants to become a buddha, his true form of wisdom and body of wisdom is transformed into adamantine when he's sitting there.",
        "source": "T25n1509_034:0310c26_0"
    },
    {
        "source_sentence": "有人言：土在金輪上，金輪在金剛上，從金剛際出，如蓮花臺，直上持菩薩坐處，令不陷沒；",
        "translation": "Some people said, “Soil rests on a golden wheel. A golden wheel rests on the diamond and emerges from the diamond.” It is like a lotus flower dais that rises straight up to where the bodhisattva sat so as not to sink or fall down.",
        "source": "T25n1509_034:0310c27_1"
    },
    {
        "source_sentence": "以是故，此道場坐處名為金剛。",
        "translation": "Because of this, this seat of enlightenment is called the Vajra.",
        "source": "T25n1509_034:0310c29_2"
    },
    {
        "source_sentence": "有人言：成佛道已，四種威儀處，悉變成金剛。",
        "translation": "Some people say, After accomplishing the Buddha Way, all four kinds of places of deportment become adamantine.",
        "source": "T25n1509_034:0311a01_3"
    },
    {
        "source_sentence": "問曰：金剛亦是眾生虛誑業因緣有，云何能舉佛？",
        "translation": "Q: The vajra is also the cause and condition for sentient beings' false actions, so how can it lift up buddhas?",
        "source": "T25n1509_034:0311a02_4"
    },
    {
        "source_sentence": "答曰：金剛雖是虛誑所成，於地最為牢固，更無勝者。",
        "translation": "Answer: Although the vajra is made of space, it's the most strong on earth, and there's no better one.",
        "source": "T25n1509_034:0311a03_5"
    },
    {
        "source_sentence": "金剛下水，諸大龍王以此堅固物，奉獻於佛。",
        "translation": "Under the water beneath the vajra, the great dragon kings offered this sturdy thing to the Buddha.",
        "source": "T25n1509_034:0311a04_6"
    },
    {
        "source_sentence": "亦是佛宿世業因緣故，得此安立處。",
        "translation": "It's also because of the causes and conditions of the Buddha's past actions that they attain this established position.",
        "source": "T25n1509_034:0311a05_7"
    },
    {
        "source_sentence": "又復佛變金剛及四大令為虛空，虛空不誑，佛智慧亦不誑；",
        "translation": "Again, the Buddha transformed the diamond and the four elements into space. Space is not depressed; neither is the Buddha’s wisdom depressed.",
        "source": "T25n1509_034:0311a06_8"
    },
    {
        "source_sentence": "二事既同，是故能舉。",
        "translation": "Since the two things are the same, they can therefore be cited.",
        "source": "T25n1509_034:0311a07_9"
    },
    {
        "source_sentence": "【經】「復次，舍利弗！",
        "translation": "[Sutra] Furthermore, Śāriputra!",
        "source": "T25n1509_034:0311a09_0"
    },
    {
        "source_sentence": "菩薩摩訶薩欲出家日即成阿耨多羅三藐三菩提；",
        "translation": "“Great enlightening beings attain unexcelled complete perfect enlightenment on the day they want to leave home.",
        "source": "T25n1509_034:0311a09_1"
    },
    {
        "source_sentence": "即是日轉法輪。",
        "translation": "That's when the sun turns the wheel of the Dharma.",
        "source": "T25n1509_034:0311a10_2"
    },
    {
        "source_sentence": "轉法輪時，無量阿僧祇眾生遠塵離垢，諸法中得法眼淨；",
        "translation": "When the wheel of the Teaching was turning, incalculable numbers of sentient beings were far removed from dust and dirt. In all things they attained purity of the eye of truth.",
        "source": "T25n1509_034:0311a10_3"
    },
    {
        "source_sentence": "無量阿僧祇眾生，一切法不受故，諸漏心得解脫；",
        "translation": "Innumerable, incalculable numbers of sentient beings are not subject to any dharmas; therefore, the minds with impure influences are liberated.",
        "source": "T25n1509_034:0311a12_4"
    },
    {
        "source_sentence": "無量阿僧祇眾生於阿耨多羅三藐三菩提得不退轉者，當學般若波羅蜜！」",
        "translation": "Measureless and incalculable sentient beings who attain irreversibility in unsurpassed, correct enlightenment should train in the perfection of prajñāpāramitā!",
        "source": "T25n1509_034:0311a13_5"
    },
    {
        "source_sentence": "【論】或有菩薩，於惡世邪見眾生中，為除眾生邪見故，自行勤苦甚難之行。",
        "translation": "[Commentary] Perhaps there's a bodhisattva who, among sentient beings with wrong views in the bad world, wants to remove wrong views of sentient beings and self-imposes extremely difficult and painful practices.",
        "source": "T25n1509_034:0311a15_0"
    },
    {
        "source_sentence": "如釋迦文佛於漚樓頻螺樹林中，食一麻一米。",
        "translation": "It's like when Śākyamuni Buddha ate one grain of hemp and one grain of rice in the forest of Kālôdayin conch-shelled trees.",
        "source": "T25n1509_034:0311a16_1"
    },
    {
        "source_sentence": "諸外道言：「我等先師，雖修苦行，不能如是六年勤苦！」",
        "translation": "The non-Buddhists said, Even though we former teachers cultivated ascetic practices, we couldn't do so for six years of hardship!",
        "source": "T25n1509_034:0311a17_2"
    },
    {
        "source_sentence": "又復有人謂佛先世惡業，今受苦報。",
        "translation": "Again, some people said that the Buddha had done evil deeds in previous lives and is now suffering painful retribution.",
        "source": "T25n1509_034:0311a19_3"
    },
    {
        "source_sentence": "有菩薩謂佛為實受是苦，是故發心：「我當即以出家日成佛。」",
        "translation": "Some bodhisattvas say that the Buddha is really suffering this kind of pain, so they arouse the intention, I will become a buddha on the day I leave home.",
        "source": "T25n1509_034:0311a20_0"
    },
    {
        "source_sentence": "又有菩薩於好世出家，如大通惠求佛道，結加趺坐，經十小劫乃得成佛。",
        "translation": "Again, there was a bodhisattva who renounced home in the good world and sought the Buddha Way like Mahāprajāpatīṣṭacāritra, sitting cross-legged for ten small eons before he became a buddha.",
        "source": "T25n1509_034:0311a21_1"
    },
    {
        "source_sentence": "菩薩聞是已，發心言：「願我以出家日即得成佛。」",
        "translation": "After hearing this, the bodhisattva arouses his mind and says, May I become a buddha on the day I leave home.",
        "source": "T25n1509_034:0311a23_2"
    },
    {
        "source_sentence": "有菩薩成佛已，不即轉法輪。",
        "translation": "There are bodhisattvas who have become buddhas and don't immediately turn the Dharma wheel after they become buddhas.",
        "source": "T25n1509_034:0311a24_3"
    },
    {
        "source_sentence": "如然燈佛，成佛已，十二年但放光明，人無識者，而不說法。",
        "translation": "For twelve years after the buddha Dīpaṅkara Buddha had attained buddhahood, he merely emitted a ray of light. People did not recognize him and they did not teach the Dharma.",
        "source": "T25n1509_034:0311a25_4"
    },
    {
        "source_sentence": "又如須扇多佛，成佛已，無受化者，作化佛留住一劫，說法度人，自身滅度。",
        "translation": "It is also like the case of Suppository Buddha. After he becomes a buddha, there will be no one to receive his instruction. Becoming a buddha who remains in this world for an eon, he teaches the Dharma and liberates people. He himself will enter nirvana.",
        "source": "T25n1509_034:0311a26_5"
    },
    {
        "source_sentence": "又如釋迦文佛，成佛已，五十七日不說法。",
        "translation": "It's also like when Śākyamuni Buddha became a buddha and didn't teach the Dharma for fifty-seven days after he became a buddha.",
        "source": "T25n1509_034:0311a28_6"
    },
    {
        "source_sentence": "菩薩聞是已，「願我成佛已，即轉法輪」。",
        "translation": "After hearing this, the bodhisattva said, May I become a buddha and turn the Dharma wheel after becoming a buddha?",
        "source": "T25n1509_034:0311a29_7"
    },
    {
        "source_sentence": "有佛度眾生有限數，如釋迦文佛轉法輪時，憍陳如一人得初道，八萬諸天諸法中得法眼淨。",
        "translation": "There's a limited number of buddhas who save sentient beings, such as when Śākyamuni Buddha turned the Dharma wheel, Kauṇḍinya like one person attained the first path and 80,000 gods in all dharmas attained purity of the Dharma eye.",
        "source": "T25n1509_034:0311b01_8"
    },
    {
        "source_sentence": "菩薩聞是已，作是願：「我轉法輪時，令無量阿僧祇人遠塵離垢，諸法中得法眼淨。」",
        "translation": "After hearing this, the bodhisattva made this vow, When I turn the wheel of the Dharma, I will cause measureless incalculable numbers of people to be far removed from dust and dirt and attain purity of the Dharma eye in all dharmas.",
        "source": "T25n1509_034:0311b03_9"
    },
    {
        "source_sentence": "以釋迦文佛初轉法輪時，一比丘及諸天皆得初道，而無一人得阿羅漢及菩薩道者；",
        "translation": "When Śākyamuni Buddha first turned the wheel of the Dharma, one bhikṣu and all the gods attained the first path, whereas no bhikṣu attained the path of the arhat or bodhisattva.",
        "source": "T25n1509_034:0311b05_10"
    },
    {
        "source_sentence": "是故菩薩願言：「我作佛時，當使無量阿僧祇眾生一切法不受故，諸漏心得解脫，及無量阿僧祇眾生於阿耨多羅三藐三菩提得不退轉。」",
        "translation": "That's why the bodhisattva vowed, When I become a buddha, I will cause measureless incalculable sentient beings who don't accept all dharmas to be liberated by the contaminants and measureless incalculable sentient beings to attain unsurpassed, correct, and complete enlightenment without regressing.",
        "source": "T25n1509_034:0311b07_11"
    },
    {
        "source_sentence": "問曰：若一切佛神力、功德、度眾生皆等，此菩薩何以作此願？",
        "translation": "Q: If all the buddhas' miraculous powers, merits, and liberations for sentient beings are equal, why does this bodhisattva make this vow?",
        "source": "T25n1509_034:0311b10_12"
    },
    {
        "source_sentence": "答曰：一佛能變作無量阿僧祇身而度眾生，而世界有嚴淨者、有不嚴淨者。",
        "translation": "Answer: One Buddha can transform himself into an immeasurable incalculable body to save sentient beings, but there are worlds that are adorned and those that aren't adorned.",
        "source": "T25n1509_034:0311b11_13"
    },
    {
        "source_sentence": "菩薩若見、若聞是諸佛有苦行難得佛者，有不即轉法輪者，有如釋迦牟尼佛六年苦行成道；",
        "translation": "“When enlightening beings see and hear these buddhas, they have ascetic practices that make it difficult to attain buddhahood. Some who do not immediately turn the wheel of the Teaching are like Śākyamuni Buddha’s six years of ascetic practice when he became a buddha.",
        "source": "T25n1509_034:0311b13_14"
    },
    {
        "source_sentence": "又聞初轉法輪時，未有得阿羅漢道者，何況得菩薩道！",
        "translation": "Furthermore, I've heard that when he first turned the wheel of the Dharma, there was no one who had attained the arhat path, so why wouldn't he attain the bodhisattva path?",
        "source": "T25n1509_034:0311b16_0"
    },
    {
        "source_sentence": "是故菩薩未聞諸佛力等，故作是願。",
        "translation": "Therefore, the bodhisattva hasn't heard of the powers of the buddhas and so forth, so he makes this vow.",
        "source": "T25n1509_034:0311b17_1"
    },
    {
        "source_sentence": "然諸佛神力、功德，平等無異。",
        "translation": "Still, the buddhas' miraculous powers and virtues are equal and no different.",
        "source": "T25n1509_034:0311b18_2"
    },
    {
        "source_sentence": "【經】「我得阿耨多羅三藐三菩提時，以無量阿僧祇聲聞為僧；",
        "translation": "[Sutra] When I attain anuttarii samyaksarrzbodhi, I take measureless incalculable śrāvakas as my sangha.",
        "source": "T25n1509_034:0311b19_0"
    },
    {
        "source_sentence": "我一說法時，便於座上盡得阿羅漢者，當學般若波羅蜜！」",
        "translation": "When I teach the Dharma once, I'll attain arhatship in my seat when I'm sitting there, and you must train in the perfection of prajñāpāramitā!",
        "source": "T25n1509_034:0311b20_1"
    },
    {
        "source_sentence": "【論】有佛以聲聞為僧，有數有限。",
        "translation": "[Commentary] There are buddhas who take śrāvakas as saṃgha, but there are limited numbers of them.",
        "source": "T25n1509_034:0311b22_0"
    },
    {
        "source_sentence": "如釋迦文尼佛，千二百五十比丘為僧。",
        "translation": "Like Śākyamuni Buddha, one thousand two hundred and fifty monks are the saṃgha.",
        "source": "T25n1509_034:0311b22_1"
    },
    {
        "source_sentence": "彌勒佛，初會僧九十九億，第二會九十六億，第三會九十三億。",
        "translation": "Maitreya Buddha had ninety-nine koṭis of monks at the first assembly, ninety-six koṭis at the second assembly, and ninety-three koṭis at the third assembly.",
        "source": "T25n1509_034:0311b23_2"
    },
    {
        "source_sentence": "如是等諸佛僧，各各有限有數不同。",
        "translation": "Each of these buddhas and saṃgha is limited in number but different in number.",
        "source": "T25n1509_034:0311b25_3"
    },
    {
        "source_sentence": "以是故，菩薩願言：「我當以無量阿僧祇聲聞為僧。」",
        "translation": "Because of this, the bodhisattva vowed, I will make measureless incalculable śrāvakas my saṃgha.",
        "source": "T25n1509_034:0311b26_4"
    },
    {
        "source_sentence": "有佛為眾生說法，一說法得初道，異時更說，得二道、三道、第四道。",
        "translation": "If there are buddhas who teach the Dharma for sentient beings, one is to teach the Dharma that they attain the first path, and if they teach it again at different times, they'll attain the second, third, and fourth paths.",
        "source": "T25n1509_034:0311b27_5"
    },
    {
        "source_sentence": "如釋迦文尼佛為五比丘說法，得初道，異日得阿羅漢道；",
        "translation": "Just as Śākyamuni Buddha preached the Dharma to five bhikṣus, who attained the first path and on a different day attained the path of arhatship.",
        "source": "T25n1509_034:0311b28_6"
    },
    {
        "source_sentence": "如舍利弗得初道，經半月然後得阿羅漢道；",
        "translation": "Suppose Śāriputra attained the first path, and after half a month he attained the path of the arhat.",
        "source": "T25n1509_034:0311c01_7"
    },
    {
        "source_sentence": "摩訶迦葉見佛得初道，過八日已得阿羅漢；",
        "translation": "When Mahākāśyapa saw the Buddha he attained the first path and after eight days he attained arhatship.",
        "source": "T25n1509_034:0311c02_8"
    },
    {
        "source_sentence": "如阿難得須陀洹道，二十五歲供養佛已，佛般涅槃後得阿羅漢。",
        "translation": "It's like the arhat who doesn't attain the stream entry path because it's twenty-five years old after making offerings to the Buddha and then attains arhatship after he parinirvāṇa.",
        "source": "T25n1509_034:0311c03_9"
    },
    {
        "source_sentence": "如是等諸阿羅漢，不一時得四道。",
        "translation": "Such arhats don't attain the four paths at one time.",
        "source": "T25n1509_034:0311c04_10"
    },
    {
        "source_sentence": "以是故菩薩願言：「我一說法時，便於座上盡得阿羅漢。」",
        "translation": "That's why the bodhisattva vowed, When I teach the Dharma once, I'll attain arhatship on my seat.",
        "source": "T25n1509_034:0311c05_11"
    },
    {
        "source_sentence": "【經】「我當以無量阿僧祇菩薩摩訶薩為僧；",
        "translation": "【經】「我當以無量阿僧祇菩薩摩訶薩為僧;",
        "source": "T25n1509_034:0311c07_0"
    },
    {
        "source_sentence": "我一說法時，無量阿僧祇菩薩皆得阿鞞跋致！」",
        "translation": "When I teach the Dharma once, measureless and incalculable bodhisattvas attain abhidharma!",
        "source": "T25n1509_034:0311c07_1"
    },
    {
        "source_sentence": "【論】菩薩所以作此願者，諸佛多以聲聞為僧，無別菩薩僧。",
        "translation": "[Commentary] The reason a bodhisattva makes this vow is that many buddhas make śrāvakas the saṃgha and there are no separate bodhisattvas or saṃgha.",
        "source": "T25n1509_034:0311c09_0"
    },
    {
        "source_sentence": "如彌勒菩薩、文殊師利菩薩等，以釋迦文佛無別菩薩僧，故入聲聞僧中次第坐。",
        "translation": "Suppose Maitreya Bodhisattva and Mañjuśrī Bodhisattva enter the śrāvaka saṃgha because Śākyamuni Buddha has no separate bodhisattva or saṃgha, so they sit in order among the śrāvaka saṃgha.",
        "source": "T25n1509_034:0311c10_1"
    },
    {
        "source_sentence": "有佛為一乘說法，純以菩薩為僧。",
        "translation": "There's a Buddha who teaches the Dharma for the One Vehicle and purely uses bodhisattvas as the saṃgha.",
        "source": "T25n1509_034:0311c12_2"
    },
    {
        "source_sentence": "有佛聲聞、菩薩雜以為僧；",
        "translation": "Some buddhas, śrāvakas and bodhisattvas were mixed into a single order of monks.",
        "source": "T25n1509_034:0311c13_3"
    },
    {
        "source_sentence": "如阿彌陀佛國，菩薩僧多，聲聞僧少。",
        "translation": "For example, in the land of Amitâbha Buddha there are many bodhisattva monks but a few śrāvaka monks.",
        "source": "T25n1509_034:0311c13_4"
    },
    {
        "source_sentence": "以是故，願以無量菩薩為僧。",
        "translation": "Because of this, I wish to make immeasurable bodhisattvas the saṃgha.",
        "source": "T25n1509_034:0311c14_5"
    },
    {
        "source_sentence": "有佛初轉法輪時，無有人得阿鞞跋致，以是故，菩薩願言：「我一說法，無量阿僧祇人得阿鞞跋致。」",
        "translation": "When the Buddha first turned the wheel of the Dharma, there were no people who attained abhidharma; therefore, the bodhisattva wished to say, If I taught one teaching, measureless incalculable number of people would attain abhidharma.",
        "source": "T25n1509_034:0311c15_6"
    },
    {
        "source_sentence": "【經】「欲得壽命無量、光明具足者，當學般若波羅蜜！」",
        "translation": "[Sutra] If you want to attain an immeasurable life span and a perfect radiance, you must train in the perfection of prajñāpāramitā!",
        "source": "T25n1509_034:0311c18_0"
    },
    {
        "source_sentence": "【論】諸佛壽命，有長、有短。",
        "translation": "[Commentary] The life spans of the buddhas are long and short.",
        "source": "T25n1509_034:0311c20_0"
    },
    {
        "source_sentence": "如鞞婆尸佛，壽八萬四千歲；",
        "translation": "For example, the buddha Kauśinagara Buddha had a life span of eighty-four thousand years.",
        "source": "T25n1509_034:0311c20_1"
    },
    {
        "source_sentence": "如拘樓餐陀佛，壽六萬歲；",
        "translation": "For example, the Buddha Krakucchanda Buddha had a life span of sixty thousand years.",
        "source": "T25n1509_034:0311c21_2"
    },
    {
        "source_sentence": "迦那伽牟尼佛，壽三萬歲；",
        "translation": "The buddha Kanakamuni Buddha had a life span of thirty thousand years.",
        "source": "T25n1509_034:0311c21_3"
    },
    {
        "source_sentence": "迦葉佛，壽二萬歲；",
        "translation": "The Buddha Kasyapa had a life span of twenty thousand years.",
        "source": "T25n1509_034:0311c22_4"
    },
    {
        "source_sentence": "釋迦文佛，壽百歲，少有過者；",
        "translation": "The Buddha Śākyamuni Buddha had a life span of one hundred years, with few exceptions.",
        "source": "T25n1509_034:0311c22_5"
    },
    {
        "source_sentence": "彌勒佛，壽八萬四千歲。",
        "translation": "Maitreya Buddha had a life span of eighty-four thousand years.",
        "source": "T25n1509_034:0311c23_6"
    },
    {
        "source_sentence": "如釋迦文佛常光一丈，彌勒佛常光十里。",
        "translation": "Just as Śākyamuni Buddha’s eternal light is one zhang long, Maitreya Buddha’s eternal light is ten li in diameter.",
        "source": "T25n1509_034:0311c24_7"
    },
    {
        "source_sentence": "諸佛壽命、光明，各有二種：一者、隱藏，二者、顯現；",
        "translation": "The duration of life and the light of buddhas are each of two kinds:",
        "source": "T25n1509_034:0311c25_8"
    },
    {
        "source_sentence": "一者、真實，二者、為眾生故隱藏。",
        "translation": "1. reality, and 2. concealment for the sake of sentient beings.",
        "source": "T25n1509_034:0311c26_9"
    },
    {
        "source_sentence": "真實者，無量、顯現；",
        "translation": "What is true and real is immeasurable and manifest.",
        "source": "T25n1509_034:0311c26_10"
    },
    {
        "source_sentence": "為眾生者，有限有量。",
        "translation": "For the sake of sentient beings, it's limited and finite.",
        "source": "T25n1509_034:0311c27_11"
    },
    {
        "source_sentence": "實佛壽不應短。",
        "translation": "It's true that the Buddha's life span shouldn't be short.",
        "source": "T25n1509_034:0311c27_12"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_034:0311c28_13"
    },
    {
        "source_sentence": "諸佛長壽業因緣具足故。",
        "translation": "It's because the causes and conditions for long-lived karma of the buddhas are complete.",
        "source": "T25n1509_034:0311c28_14"
    },
    {
        "source_sentence": "如婆伽梵宿世救一聚落人命，故得無量阿僧祇壽命。",
        "translation": "It's like the Bhagavān constellation that saves the lives of a village in the world and therefore attains an immeasurable, incalculable life span.",
        "source": "T25n1509_034:0311c29_15"
    },
    {
        "source_sentence": "梵世中壽法不過半劫，而此梵天壽獨無量，以是故生邪見言：「唯我常住！」",
        "translation": "The life span in the Brahma world is only half an eon, but the life spans of these Brahma gods are immeasurable alone; therefore, they give rise to a mistaken view and say, Only I will always live!",
        "source": "T25n1509_034:0311c30_16"
    },
    {
        "source_sentence": "佛到其所，破其邪見，說其本緣：救一聚落，其壽乃爾。",
        "translation": "When the Buddha came to them, he refuted their mistaken views and explained their original reason: To save a village, that's how long its life span is.",
        "source": "T25n1509_034:0312a02_17"
    },
    {
        "source_sentence": "何況佛世世救無量阿僧祇眾生：或以財物救濟，或以身命代死，云何壽限不過百歲？",
        "translation": "How much more so when the Buddha saves measureless and incalculable sentient beings from one world to another: sometimes he saves them with possessions, sometimes he dies on behalf of his body and life, so why doesn't his life span be less than a hundred years?",
        "source": "T25n1509_034:0312a03_18"
    },
    {
        "source_sentence": "又不殺生戒是長壽業因緣；",
        "translation": "Again, the precept against taking life is the causal condition for longevity in action.",
        "source": "T25n1509_034:0312a05_19"
    },
    {
        "source_sentence": "佛以大慈眾生，愛徹骨髓，常能為眾生故死，何況殺生！",
        "translation": "Because of great compassion for sentient beings, the Buddha loves and penetrates their bone marrow, and he can always die for the sake of sentient beings, so why wouldn't he kill them?",
        "source": "T25n1509_034:0312a06_20"
    },
    {
        "source_sentence": "又以諸法實相智慧真實不誑故，亦是長壽因緣。",
        "translation": "Also, because the true characteristics of dharmas and wisdom are real and not coarse, they're also causes and conditions for long life.",
        "source": "T25n1509_034:0312a07_21"
    },
    {
        "source_sentence": "菩薩以般若波羅蜜和合持戒諸功德故，得壽命無量，何況佛世世具足此諸無量功德而壽命有限！",
        "translation": "Because the bodhisattva combines the merits of prajñā-pāramitā with the virtues of observing precepts, he attains an immeasurable life span, so why wouldn't the Buddha have a limited life span if he were to fulfill these immeasurable merits in this world?",
        "source": "T25n1509_034:0312a08_22"
    },
    {
        "source_sentence": "復次，如一切色中，佛身第一；",
        "translation": "“Furthermore, just as among all forms the buddha-body is foremost.",
        "source": "T25n1509_034:0312a10_23"
    },
    {
        "source_sentence": "一切心中，佛心第一；",
        "translation": "Among all minds, the Buddha mind is foremost.",
        "source": "T25n1509_034:0312a11_24"
    },
    {
        "source_sentence": "以是故，一切壽命中，佛壽亦應第一。",
        "translation": "For this reason, among all the buddha-lives, the Buddha' s life should also be the first.",
        "source": "T25n1509_034:0312a12_0"
    },
    {
        "source_sentence": "如世俗人言：「人生於世，以壽為貴。」",
        "translation": "It's like a secular person who says, When someone is born in the world, longevity is valued.",
        "source": "T25n1509_034:0312a12_1"
    },
    {
        "source_sentence": "佛為人中之上，壽亦應長！",
        "translation": "The Buddha is the highest among humans, and his life span should be long!",
        "source": "T25n1509_034:0312a13_2"
    },
    {
        "source_sentence": "問曰：佛雖有長壽業因緣，生於惡世，故壽命便短；",
        "translation": "Q: Although buddhas have long life spans because of karmic causes and conditions, they are born in evil worlds; therefore their life spans are short.",
        "source": "T25n1509_034:0312a14_3"
    },
    {
        "source_sentence": "以此短壽，能具佛事，何用長為？",
        "translation": "Because of this short life span, they can perform the buddha-works. Why would a long life span be necessary?",
        "source": "T25n1509_034:0312a15_4"
    },
    {
        "source_sentence": "又佛以神通力故，一日之中能具佛事，何況百歲！",
        "translation": "Also, because of the Buddha's supernormal powers, he can perform all the Buddha's tasks in a single day, so why wouldn't he do them for a hundred years?",
        "source": "T25n1509_034:0312a16_5"
    },
    {
        "source_sentence": "答曰：此間閻浮提惡，故佛壽應短。",
        "translation": "Answer: Here, Jambudvīpa is bad, so the Buddha's life span should be short.",
        "source": "T25n1509_034:0312a17_6"
    },
    {
        "source_sentence": "餘處好，故佛壽應長。",
        "translation": "Because the other places are good, the Buddha's life span should be long.",
        "source": "T25n1509_034:0312a18_7"
    },
    {
        "source_sentence": "問曰：若然者，菩薩於此閻浮提淨飯王宮生，出家成道，是實佛；",
        "translation": "Q: If so, then the bodhisattva who was born in the palace of King Śuddhodana in Jambudvlpa and renounced domestic life to attain enlightenment is indeed a buddha.",
        "source": "T25n1509_034:0312a18_8"
    },
    {
        "source_sentence": "餘處皆是神通力變化作佛，以度眾生？",
        "translation": "In the other places, are they all miraculously transformed into buddhas to save sentient beings?",
        "source": "T25n1509_034:0312a20_9"
    },
    {
        "source_sentence": "答曰：此言非也！",
        "translation": "Answer: It's said to be wrong!",
        "source": "T25n1509_034:0312a21_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_034:0312a21_1"
    },
    {
        "source_sentence": "餘處閻浮提，亦各各言：「我國是實佛，餘處為變化。」",
        "translation": "The other places in Jambudvīpa each said, My country is really a buddha, and the other places are transformations.",
        "source": "T25n1509_034:0312a21_2"
    },
    {
        "source_sentence": "何以知之？",
        "translation": "How do we know this?",
        "source": "T25n1509_034:0312a22_3"
    },
    {
        "source_sentence": "若餘處國土，自知是化佛，則不肯信受教戒。",
        "translation": "If someone in another land knows for themselves that they're a transformation buddha, they won't believe and accept the precepts.",
        "source": "T25n1509_034:0312a23_4"
    },
    {
        "source_sentence": "又如餘國土人壽命一劫，若佛壽百歲，於彼裁無一日，眾生則起輕慢，不肯受教；",
        "translation": "Again, if the Buddha’s life span were to be one hundred years in all other buddha-lands, there would not be a single day of rebirth for people there. The sentient beings would then become disrespectful and would not accept his instructions.",
        "source": "T25n1509_034:0312a24_5"
    },
    {
        "source_sentence": "彼則以一劫為實佛，以此為變化化。",
        "translation": "They then take one eon as the real Buddha and use this as their transformation.",
        "source": "T25n1509_034:0312a26_6"
    },
    {
        "source_sentence": "如《首楞嚴經》說：「神通遍照佛，壽七百千阿僧祇劫。",
        "translation": "As the Śūraṃgama-sūtra explains, The Buddha with supernormal powers pervading illumination has a life span of 70,000 incalculably long eons.",
        "source": "T25n1509_034:0312a27_0"
    },
    {
        "source_sentence": "佛告文殊尸利：『彼佛則是我身。』",
        "translation": "The Buddha told Mañjuśrī, 'That Buddha is my body.'",
        "source": "T25n1509_034:0312a28_1"
    },
    {
        "source_sentence": "彼佛亦言：『釋迦文佛則是我身。』」",
        "translation": "That Buddha also said, 'Śākyamuni Buddha is my body.'",
        "source": "T25n1509_034:0312a28_2"
    },
    {
        "source_sentence": "以是故知，諸佛壽命實皆無量，為度人故，現有長短。",
        "translation": "Because of this, it's known that the life spans of the buddhas are really immeasurable, and they exist long and short in order to save people.",
        "source": "T25n1509_034:0312a29_3"
    },
    {
        "source_sentence": "汝言：「釋迦文佛，以神通力故，所度眾生與人壽不異者，則不須百歲，一日之中可具足佛事！」",
        "translation": "You said, Śākyamuni Buddha, because of his miraculous powers, if the sentient beings he saves don't differ from human life spans, then it doesn't take a hundred years to fulfill the Buddha's task in a single day!",
        "source": "T25n1509_034:0312b01_4"
    },
    {
        "source_sentence": "如阿難一時心生是念：「如然燈世尊、一切勝佛、鞞婆尸佛，出於好世，壽命極多，能具佛事；",
        "translation": "At one time Ānanda thought to himself: World-Honored One, it is as if the buddhas Tathågata, Samantabhadra, and Vimalakīrti had emerged from a good world. Their life spans were so great that they could fulfill the duties of buddhahood.",
        "source": "T25n1509_034:0312b04_5"
    },
    {
        "source_sentence": "我釋迦文佛出生惡世，壽命極短，將無世尊不能具足佛事耶？」",
        "translation": "I, Śākyamuni Buddha, will be born in a bad world with an extremely short life span, so won't the Bhagavān be able to fulfill the Buddha's service?",
        "source": "T25n1509_034:0312b06_6"
    },
    {
        "source_sentence": "爾時，世尊入日出三昧，從身變化出無量諸佛及無量光明，普至十方；",
        "translation": "At that time the World-honored One entered the samādhi of sunrise, emanating from his body infinite buddhas and infinite rays of light reaching everywhere in the ten directions.",
        "source": "T25n1509_034:0312b07_7"
    },
    {
        "source_sentence": "一一化佛在諸世界，各作佛事：或有說法、或現神通、或現三昧、或現飯食。",
        "translation": "Each of the apparitional buddhas in each world did buddha-works: some preached the Dharma, some manifested mystic powers, some manifested concentration, and some manifested food and drink.",
        "source": "T25n1509_034:0312b09_8"
    },
    {
        "source_sentence": "如是之比種種因緣，施作佛事而度眾生。",
        "translation": "Because of various similar causes and conditions like this, they perform buddha-works to save sentient beings.",
        "source": "T25n1509_034:0312b11_9"
    },
    {
        "source_sentence": "從三昧起，告阿難曰：「汝悉見聞是事不？」",
        "translation": "He rose from his samādhi and told Ānanda, Do you see and hear this thing?",
        "source": "T25n1509_034:0312b12_10"
    },
    {
        "source_sentence": "阿難言：「唯然！",
        "translation": "Ānanda said, Yes!",
        "source": "T25n1509_034:0312b13_11"
    },
    {
        "source_sentence": "已見！」",
        "translation": "I've seen it!",
        "source": "T25n1509_034:0312b13_12"
    },
    {
        "source_sentence": "佛告阿難：「佛以如是神力，能具佛事不？」",
        "translation": "The Buddha told Ānanda, Does the Buddha use such miraculous powers to accomplish the Buddha's work?",
        "source": "T25n1509_034:0312b13_13"
    },
    {
        "source_sentence": "阿難言：「假令佛壽一日，大地草木悉為可度眾生，則能度盡，何況百歲！」",
        "translation": "Ānanda said, Suppose the Buddha's life span were one day, and all the plants and trees in the earth would be able to save sentient beings, so they could save them up to a hundred years!",
        "source": "T25n1509_034:0312b14_14"
    },
    {
        "source_sentence": "以是故知，諸佛壽命皆悉無量，為度人故，現有長短。",
        "translation": "Because of this we know that the life spans of buddhas are all immeasurable, and in order to save sentient beings they have long and short life spans.",
        "source": "T25n1509_034:0312b16_15"
    },
    {
        "source_sentence": "譬如日出，影現於水，隨水大小，水大則影久，水小則速滅；",
        "translation": "It is like when the sun comes out and its reflection appears in water. According to the size of the water, the reflection lasts for a long time if the water is large; but disappears quickly if the water is small.",
        "source": "T25n1509_034:0312b17_16"
    },
    {
        "source_sentence": "若照琉璃、頗梨珠山，影則久住。",
        "translation": "If he shines on the lapis and pārijātaka mountains, his shadow will abide for a long time.",
        "source": "T25n1509_034:0312b18_17"
    },
    {
        "source_sentence": "又如火燒草木，然少則速滅，然多則久住；",
        "translation": "It is also like a fire that burns grass and trees but when it is small it quickly perishes; but when large it remains for a long time.",
        "source": "T25n1509_034:0312b19_18"
    },
    {
        "source_sentence": "不可以滅處無火故，謂多然處亦無。",
        "translation": "It can't be because there's no fire in the place of cessation, meaning that the many such places are also absent.",
        "source": "T25n1509_034:0312b20_19"
    },
    {
        "source_sentence": "光明長短義，亦如是。",
        "translation": "The meaning of length and shortness of light is likewise.",
        "source": "T25n1509_034:0312b21_20"
    },
    {
        "source_sentence": "大智度論釋初品中信持無三毒義第",
        "translation": "Mahāprajñāpāramitā-śāstra explains the meaning of maintaining faith in the absence of the three poisons in the first chapter.",
        "source": "T25n1509_034:0312b22_0"
    },
    {
        "source_sentence": "五十二",
        "translation": "fifty-two",
        "source": "T25n1509_034:0312b23_0"
    },
    {
        "source_sentence": "【經】「我成阿耨多羅三藐三菩提時，世界中無有婬欲、瞋恚、愚癡，亦無三毒之名。",
        "translation": "[Sutra] When I attain supreme perfect enlightenment, there won't be sexual desire, anger, or folly in the world, and there won't be the name of the three poisons.",
        "source": "T25n1509_034:0312b24_0"
    },
    {
        "source_sentence": "一切眾生成就如是智慧，善施、善戒、善定、善梵行、善不嬈眾生者，當學般若波羅蜜。」",
        "translation": "All sentient beings who have accomplished such wisdom, good generosity, good morality, good concentration, good religious practice, and goodness that doesn't disturb sentient beings should train in the perfection of prajñāpāramitā.",
        "source": "T25n1509_034:0312b25_1"
    },
    {
        "source_sentence": "【論】問曰：若世界無三毒、亦無三毒名者，佛為何等故出生其國？",
        "translation": "[Commentary] Q: If the world has no three poisons and no names for the three poisons, what's the reason why the Buddha is born in that country?",
        "source": "T25n1509_034:0312b28_0"
    },
    {
        "source_sentence": "答曰：貪欲、瞋恚、愚癡名為三不善根，是欲界繫法。",
        "translation": "Answer: The three unwholesome roots of desire, anger, and folly are called the three unwholesome roots, which are fetters in the desire realm.",
        "source": "T25n1509_034:0312b29_1"
    },
    {
        "source_sentence": "佛若說貪欲、瞋恚、愚癡，是欲界繫不善；",
        "translation": "If the Buddha teaches that attachment to sensual pleasure, hatred and delusion are unwholesome fetters of the realm of sexual passion.",
        "source": "T25n1509_034:0312c01_2"
    },
    {
        "source_sentence": "若說染愛、無明，是則通三界。",
        "translation": "If it's said that defilement, craving, and ignorance are shared with the three realms.",
        "source": "T25n1509_034:0312c02_3"
    },
    {
        "source_sentence": "有佛世界純諸欲人，為是眾生故，菩薩願言：「我成佛時，國無三毒及三毒之名。」",
        "translation": "There are people in the Buddha's world who are purely desirous, and it's for the sake of sentient beings that the bodhisattva wishes to say, When I become a buddha, there won't be the names of the three poisons or three poisons in my country.",
        "source": "T25n1509_034:0312c03_4"
    },
    {
        "source_sentence": "復有清淨佛國，純阿鞞跋致、法性生身菩薩，無諸煩惱，唯有餘習，是故言「無三毒之名」。",
        "translation": "Again, there are pure buddha-lands that are purely abhidharma and the bodhisattva who gives rise to the body of Dharma nature as body, which have no afflictions but only residual habits; therefore, they're called 'without the names of the three poisons.'",
        "source": "T25n1509_034:0312c05_5"
    },
    {
        "source_sentence": "若有人言：如菩薩願言「我當度一切眾生」，而眾生實不盡度；",
        "translation": "Suppose someone says, “As the enlightening being vows, ‘I will liberate all sentient beings,’ but in reality sentient beings are not liberated.",
        "source": "T25n1509_034:0312c07_6"
    },
    {
        "source_sentence": "此亦如是，欲令世界無三毒之名，亦應實有三毒不盡。",
        "translation": "This is likewise, because if you want to make the world without the names of the three poisons, there should really be three poisons that don't end.",
        "source": "T25n1509_034:0312c08_7"
    },
    {
        "source_sentence": "若無三毒，何用佛為？",
        "translation": "If there are no the three poisons, what use is Buddha for them?",
        "source": "T25n1509_034:0312c09_8"
    },
    {
        "source_sentence": "如地無大闇，則不須日照。",
        "translation": "Just as the earth has no great darkness, it doesn't need the sun to shine.",
        "source": "T25n1509_034:0312c10_9"
    },
    {
        "source_sentence": "如經所說：「若無三法則佛不出世，若三法不斷則不得離老、病、死。」",
        "translation": "As the sūtras say, If there are no three dharmas, then the Buddha won't appear in the world, and if the three dharmas don't continue, then they won't be able to part with old age, illness, and death.",
        "source": "T25n1509_034:0312c11_10"
    },
    {
        "source_sentence": "「三法」者則是三毒，如《三法經》，此中應廣說。",
        "translation": "The three dharmas are the three poisons, as explained in the Three Dharmas Sutra, which should be explained in detail here.",
        "source": "T25n1509_034:0312c12_11"
    },
    {
        "source_sentence": "復次，有世界，眾生分別諸法是善、是不善，是縛、是解等，於一相寂滅法中而生戲論；",
        "translation": "“Furthermore, there is a world in which sentient beings discriminate the dharmas as good or bad. These are fetters, liberations, etc., and give rise to conceptual elaborations about one characteristic of the dharma of cessation:",
        "source": "T25n1509_034:0312c13_12"
    },
    {
        "source_sentence": "菩薩以是故願言：「令我世界中眾生不生三毒，知三毒實相即是涅槃。」",
        "translation": "Because of this, the bodhisattva vowed, So that sentient beings in my world won't give rise to the three poisons and know that the true characteristics of the three poisons are nirvāṇa.",
        "source": "T25n1509_034:0312c15_13"
    },
    {
        "source_sentence": "問曰：一切眾生得如是智慧，是何等智慧？",
        "translation": "Q: All sentient beings attain such wisdom, what kind of wisdom is it?",
        "source": "T25n1509_034:0312c17_14"
    },
    {
        "source_sentence": "答曰：智慧是世間正見。",
        "translation": "Answer: Wisdom is the worldly right view.",
        "source": "T25n1509_034:0312c18_15"
    },
    {
        "source_sentence": "世間正見中，說有布施、有罪福、有今世後世、有阿羅漢。",
        "translation": "In the worldly correct view, it's said that there's generosity, sin and merit, present and future lives, and arhatship.",
        "source": "T25n1509_034:0312c19_0"
    },
    {
        "source_sentence": "信罪福故，能善布施。",
        "translation": "Because they believe in sin and merit, they're able to skillfully give alms.",
        "source": "T25n1509_034:0312c20_1"
    },
    {
        "source_sentence": "信有阿羅漢故，能善持戒、善禪定、善梵行。",
        "translation": "Because they believe there's an arhat, they can well observe precepts, good meditation, and good religious practice.",
        "source": "T25n1509_034:0312c20_2"
    },
    {
        "source_sentence": "得正見力故，能善不嬈眾生。",
        "translation": "Because of attaining the power of right view, they can be good and not disturb sentient beings.",
        "source": "T25n1509_034:0312c21_3"
    },
    {
        "source_sentence": "世間正見是無漏智慧根本，以是故說「國中無三毒之名」。",
        "translation": "The right view of the world is the root of uncontaminated wisdom, which is why it's said that there are no names for the three poisons in a country.",
        "source": "T25n1509_034:0312c22_4"
    },
    {
        "source_sentence": "貪欲有二種：一者、邪貪欲，二者、貪欲。",
        "translation": "There are two kinds of craving: 1. wrong craving and 2. craving.",
        "source": "T25n1509_034:0312c23_5"
    },
    {
        "source_sentence": "瞋恚有二種：一者、邪瞋恚，二者、瞋恚。",
        "translation": "There are two kinds of anger: 1. wrong anger and 2. anger.",
        "source": "T25n1509_034:0312c24_6"
    },
    {
        "source_sentence": "愚癡有二種：一者、邪見愚癡，二者、愚癡。",
        "translation": "There are two kinds of delusion: 1. delusion from wrong views and 2. delusion.",
        "source": "T25n1509_034:0312c25_7"
    },
    {
        "source_sentence": "是三種邪毒眾生難可化度，餘三易度。",
        "translation": "These are the three kinds of wrong poisons that make it difficult for sentient beings to be liberated, and the other three are easy to liberate.",
        "source": "T25n1509_034:0312c26_8"
    },
    {
        "source_sentence": "「無三毒名」者，無邪三毒之名。",
        "translation": "The phrase without the names of the three poisons means there are no names for the three poisons that are wrong.",
        "source": "T25n1509_034:0312c27_9"
    },
    {
        "source_sentence": "「善布施」等五事，如上〈放光品〉中說。",
        "translation": "The five things that are well-disbursed and so forth are as explained in the above section on the release of light.",
        "source": "T25n1509_034:0312c28_10"
    },
    {
        "source_sentence": "【經】「使我般涅槃後，法無滅盡，亦無滅盡之名，當學般若波羅蜜。」",
        "translation": "[Sutra] So that after my parinirvāṇa, the Dharma won't cease and there won't be a name for its cessation, you must train in the perfection of prajñā.",
        "source": "T25n1509_034:0312c29_0"
    },
    {
        "source_sentence": "【論】問曰：佛為法王尚自滅度，云何言「法無滅盡」？",
        "translation": "[Commentary] Q: When the Buddha is still extinguished for the sake of the king of the Dharma, how can he say that the Dharma has no cessation?",
        "source": "T25n1509_034:0313a02_0"
    },
    {
        "source_sentence": "答曰：如上說，是菩薩願事不必實。",
        "translation": "Answer: As explained above, these are the bodhisattva's vows that needn't be real.",
        "source": "T25n1509_034:0313a03_1"
    },
    {
        "source_sentence": "一切有為法，從因緣和合生，云何常住而不滅？",
        "translation": "All conditioned dharmas arise from the conjunction of causes and conditions, so how can they be eternal and not perish?",
        "source": "T25n1509_034:0313a04_0"
    },
    {
        "source_sentence": "佛如日明，法如日沒餘光，云何日沒而餘光不滅？",
        "translation": "The Buddha is like the sun when it shines and the Dharma is like the sun when it disappears, so why doesn't the remaining light disappear when the sun disappears?",
        "source": "T25n1509_034:0313a05_1"
    },
    {
        "source_sentence": "但久住故，無能見滅者，故名不滅。",
        "translation": "Because it only abides for a long time, there is no one who can perceive cessation. That is why it is called not perishing.",
        "source": "T25n1509_034:0313a06_2"
    },
    {
        "source_sentence": "復次，是菩薩見諸佛法住有多有少，如迦葉佛法住七日，如釋迦牟尼佛法住千歲；",
        "translation": "“Furthermore, these enlightening beings see that there are many different kinds of buddha-teachings: just as the teaching of Buddha Kasyapa lasts for seven days, in the same way the teaching of Buddha Śākyamuni lasts for one thousand years.",
        "source": "T25n1509_034:0313a07_3"
    },
    {
        "source_sentence": "是故菩薩發是願言：「法雖有為，願令相續不滅；",
        "translation": "That is why the enlightening beings make this vow: Though things are conditioned, may they continue and not perish.",
        "source": "T25n1509_034:0313a09_4"
    },
    {
        "source_sentence": "如火得薪，相傳不絕。」",
        "translation": "It's like a fire that obtains firewood and transmits it without stopping.",
        "source": "T25n1509_034:0313a10_5"
    },
    {
        "source_sentence": "復次，諸法實相名為佛法。",
        "translation": "Furthermore, the true characteristics of dharmas are called buddha-dharmas.",
        "source": "T25n1509_034:0313a10_6"
    },
    {
        "source_sentence": "是實法相，不生不滅、不斷不常、不一不異、不來不去、不受不動、不著不依、無所有，如涅槃相。",
        "translation": "These are the true characteristics of dharmas that don't arise or cease, aren't unceasing or impermanent, aren't one and the same or different, don't come or go, don't experience or move, don't cling or rely, and lack existence, just like the characteristics of nirvāṇa.",
        "source": "T25n1509_034:0313a11_7"
    },
    {
        "source_sentence": "法相如是，云何有滅？",
        "translation": "If the characteristics of dharmas are like this, how could there be cessation?",
        "source": "T25n1509_034:0313a13_8"
    },
    {
        "source_sentence": "問曰：法相如是者，一切佛法皆應不滅！",
        "translation": "Q: If the characteristics of dharmas are thus, then all the Buddha's teachings shouldn't cease!",
        "source": "T25n1509_034:0313a13_9"
    },
    {
        "source_sentence": "答曰：如所言，諸法實相無有滅者。",
        "translation": "Answer: As they say, there's no cessation of the true characteristics of dharmas.",
        "source": "T25n1509_034:0313a14_10"
    },
    {
        "source_sentence": "有人憶想分別取諸法相、壞實法相，用二法說，是故有滅；",
        "translation": "Some people, remembering and conceptualizing, discriminating and grasping the characteristics of all dharmas and destroying the real characteristics of all dharmas, use two teachings to explain. Because of this, there is cessation.",
        "source": "T25n1509_034:0313a15_11"
    },
    {
        "source_sentence": "實相法中無有滅也。",
        "translation": "There's no cessation in the true characteristic dharmas.",
        "source": "T25n1509_034:0313a17_12"
    },
    {
        "source_sentence": "復次，行般若波羅蜜無礙法、集無量功德故，隨其本願，法法相續，無有見其滅者；",
        "translation": "“Furthermore, because they practice the unhindered teaching of transcendent wisdom and accumulate immeasurable virtues, according to their original vows, principles and phenomena continue one after another; no one sees them cease.",
        "source": "T25n1509_034:0313a17_13"
    },
    {
        "source_sentence": "譬如仰射虛空，箭去極遠，人雖不見，要必當墮。",
        "translation": "It's like shooting upward into space, and an arrow goes so far away that even though a person doesn't see it, they'll surely fall if they do.",
        "source": "T25n1509_034:0313a19_14"
    },
    {
        "source_sentence": "【經】「『我得阿耨多羅三藐三菩提時，十方如恒河沙等世界中眾生聞我名者，必得阿耨多羅三藐三菩提。』",
        "translation": "[Sutra] 'When I attain unsurpassed, correct, and complete enlightenment, sentient beings in the ten directions like the sands of the Ganges River who hear my name will surely attain unsurpassed, correct, and complete enlightenment.'",
        "source": "T25n1509_034:0313a21_0"
    },
    {
        "source_sentence": "欲得如是等功德者，當學般若波羅蜜。」",
        "translation": "Those who want to attain such merits should train in the perfection of wisdom.",
        "source": "T25n1509_034:0313a23_1"
    },
    {
        "source_sentence": "【論】問曰：有人生值佛世，在佛法中，或墮地獄者，如提婆達、俱迦利、訶多釋子等，三不善法覆心故墮地獄。",
        "translation": "[Commentary] Q: Suppose someone is born in the Buddha's world and meets the Buddha, and they either fall into hell within the Buddha's teaching or into hell, such as Devadatta, Kauṇḍalī, Śākyamuni, etc., who fall into hell because their minds are covered by the three unwholesome qualities.",
        "source": "T25n1509_034:0313a25_0"
    },
    {
        "source_sentence": "此中云何言「去佛如恒河沙等世界，但聞佛名便得道」耶？",
        "translation": "How does it say, Going away from buddhas like the sands of the Ganges River and other worlds, you'll only hear the names of buddhas and then attain enlightenment?",
        "source": "T25n1509_034:0313a27_1"
    },
    {
        "source_sentence": "答曰：上已說有二種佛：一者、法性生身佛，二者、隨眾生優劣現化佛。",
        "translation": "Answer: The above has already explained that there are two kinds of buddhas: 1. the buddha who gives rise to the body body in the Dharma-nature and 2. the buddha who manifests transformation according to the superiority and inferiority of sentient beings.",
        "source": "T25n1509_034:0313a28_2"
    },
    {
        "source_sentence": "為法性生身佛故，說「乃至聞名得度」；",
        "translation": "It's because of the buddha who gives rise to the Dharma-nature body that he teaches, Up to the point where he hears names and attain liberation.",
        "source": "T25n1509_034:0313b01_3"
    },
    {
        "source_sentence": "為隨眾生現身佛故，說「雖共佛住，隨業因緣有墮地獄者」。",
        "translation": "It's because of the Buddha who follows sentient beings in their present bodies and says, Even though they live together with the Buddha, there are those who fall into hell according to the causes and conditions of their actions.",
        "source": "T25n1509_034:0313b02_4"
    },
    {
        "source_sentence": "法性生身佛者，無事不濟、無願不滿。",
        "translation": "The buddha of the Dharma-nature body that gives rise to the body, there's nothing that isn't saved and nothing that isn't fulfilled by wishes.",
        "source": "T25n1509_034:0313b03_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_034:0313b04_6"
    },
    {
        "source_sentence": "於無量阿僧祇劫積集一切善本功德，一切智慧無礙具足，為眾聖主，諸天及大菩薩希能見者。",
        "translation": "In measureless incalculable eons, they accumulate all the merits of their good roots, are fully endowed with all knowledge and wisdom, are the noble lords of gods, and are rarely seen by gods or great bodhisattvas.",
        "source": "T25n1509_034:0313b05_0"
    },
    {
        "source_sentence": "譬如如意寶珠難見、難得，若有見者，所願必果。",
        "translation": "It's like the wish-granting jewel that's difficult to see and difficult to obtain, and if you see it, your wishes will surely be fulfilled.",
        "source": "T25n1509_034:0313b07_1"
    },
    {
        "source_sentence": "如喜見藥，其有見者，眾患悉除。",
        "translation": "It's like seeing the medicine of joy, and if someone sees it, all their afflictions are completely removed.",
        "source": "T25n1509_034:0313b08_2"
    },
    {
        "source_sentence": "如轉輪聖王，人有見者，無不富足。",
        "translation": "It's like the wheel-turning sage king, and anyone who sees it is no differently rich.",
        "source": "T25n1509_034:0313b09_3"
    },
    {
        "source_sentence": "如釋提桓因，有人見者，隨願悉得。",
        "translation": "Suppose someone sees Śakra Devānām-Indra, and they'll attain it as they wish.",
        "source": "T25n1509_034:0313b09_4"
    },
    {
        "source_sentence": "如梵天王，眾生依附，恐怖悉除。",
        "translation": "It's like the king of Brahmā, who relies on sentient beings and removes all their fears.",
        "source": "T25n1509_034:0313b10_5"
    },
    {
        "source_sentence": "如人念觀世音菩薩名者，悉脫厄難。",
        "translation": "Like a person who remembers the name of Avalokiteśvara Bodhisattva, they'll all be freed from difficulty.",
        "source": "T25n1509_034:0313b11_6"
    },
    {
        "source_sentence": "是事尚爾，何況諸佛法性生身！",
        "translation": "This is still the case, so why wouldn't the Dharma-nature of the buddhas give rise to the body?",
        "source": "T25n1509_034:0313b12_7"
    },
    {
        "source_sentence": "問曰：釋迦文佛亦是法性生身分，無有異體；",
        "translation": "Q: The buddha Śākyamuni Buddha is also a self-existing personality born of the essence of dharmas. There is no difference in essence between them.",
        "source": "T25n1509_034:0313b13_8"
    },
    {
        "source_sentence": "何以故佛在世時，有作五逆罪人、飢餓、賊盜如是等惡？",
        "translation": "Why is it that when the Buddha was in the world, there were five heinous crimes like this committed by sinners, hunger, thieves, and thieves?",
        "source": "T25n1509_034:0313b14_9"
    },
    {
        "source_sentence": "答曰：釋迦文佛本誓：「我出惡世，欲以道法度脫眾生，不為富貴世樂故出。」",
        "translation": "Answer: Śākyamuni Buddha originally vowed, I'll leave the bad world and want to save sentient beings with the path and not leave it for the sake of wealth and worldly pleasure.",
        "source": "T25n1509_034:0313b15_10"
    },
    {
        "source_sentence": "若佛以力與之則無事不能。",
        "translation": "If the Buddha gives it to them with his power, then nothing can be done.",
        "source": "T25n1509_034:0313b17_11"
    },
    {
        "source_sentence": "又亦是眾生福德力薄、罪垢深重故，不得隨意度脫。",
        "translation": "It's also because sentient beings lack the power of virtue and the profound stain of sin that they can't be freed as they wish.",
        "source": "T25n1509_034:0313b17_12"
    },
    {
        "source_sentence": "又今佛但說清淨涅槃，而眾生譏論誹謗言：「何以多畜弟子化導人民？",
        "translation": "Furthermore, now the Buddha only explains pure nirvāṇa, but sentient beings criticize and denigrate it, saying, Why do you have so many disciples who teach people?",
        "source": "T25n1509_034:0313b19_13"
    },
    {
        "source_sentence": "此亦是繫縛法。」",
        "translation": "This is also the binding dharma.",
        "source": "T25n1509_034:0313b20_14"
    },
    {
        "source_sentence": "但以涅槃法化猶尚譏謗，何況雜以世樂！",
        "translation": "But the teaching of nirvāṇa is still a criticism, so why would it be mixed with worldly pleasures?",
        "source": "T25n1509_034:0313b21_15"
    },
    {
        "source_sentence": "如提婆達欲令足下有千輻相輪故，以鐵作模燒而爍之，爍已，足壞，身惱大呼。",
        "translation": "Suppose Devadatta wants to have a thousand-spoked wheel at the bottom of his feet, so he makes an iron mould that burns it and shines it. After shining, his feet disintegrate, and he screams with vexation.",
        "source": "T25n1509_034:0313b22_16"
    },
    {
        "source_sentence": "爾時阿難聞已涕泣白佛：「我兄欲死，願佛哀救！」",
        "translation": "After hearing this, Ānanda wept and said to the Buddha, My brother is about to die, so may the Buddha rescue him!",
        "source": "T25n1509_034:0313b24_17"
    },
    {
        "source_sentence": "佛即伸手就摩其身，發至誠言：「我看羅睺羅與提婆達等者，彼痛當滅。」",
        "translation": "The Buddha then reached out, touched his body with his hand, and said with sincerity, I'll see Rāhula and Devadatta, and their pain will cease.",
        "source": "T25n1509_034:0313b25_18"
    },
    {
        "source_sentence": "是時提婆達眾痛即除；",
        "translation": "Devadatta’s aches and pains were immediately removed.",
        "source": "T25n1509_034:0313b26_19"
    },
    {
        "source_sentence": "執手觀之，知是佛手，便作是言：「淨飯王子以此醫術足自生活。」",
        "translation": "Knowing that it was the Buddha's hand, he said, Prince Jīvaka lives on his own with these medicines and skills.",
        "source": "T25n1509_034:0313b27_20"
    },
    {
        "source_sentence": "佛告阿難：「汝觀提婆達不？",
        "translation": "The Buddha told Ānanda, Do you observe Devadatta?",
        "source": "T25n1509_034:0313b28_21"
    },
    {
        "source_sentence": "用心如是，云何可度？」",
        "translation": "If the mind is like this, how can it be liberated?",
        "source": "T25n1509_034:0313b29_22"
    },
    {
        "source_sentence": "若好世人則無是咎。",
        "translation": "If it's good for worldly people, then there's no blame.",
        "source": "T25n1509_034:0313c01_0"
    },
    {
        "source_sentence": "如是眾生，若以世樂，不得度也。",
        "translation": "Such sentient beings can't be liberated by worldly pleasures.",
        "source": "T25n1509_034:0313c01_1"
    },
    {
        "source_sentence": "是事種種因緣上已廣說。",
        "translation": "The various causes and conditions for these things have been explained in detail above.",
        "source": "T25n1509_034:0313c02_2"
    },
    {
        "source_sentence": "以是故說：「聞佛名有得道者，有不得者。」",
        "translation": "That's why it's said, There's someone who hears the Buddha's name and attains the path, and there's someone who doesn't.",
        "source": "T25n1509_034:0313c02_3"
    },
    {
        "source_sentence": "復次，佛身無量阿僧祇種種不同：有佛為眾生說法令得道者；",
        "translation": "“Furthermore, the buddha-bodies are infinite, incalculable, and variously different:",
        "source": "T25n1509_034:0313c03_4"
    },
    {
        "source_sentence": "有佛放無量光明，眾生遇之而得道者；",
        "translation": "“Some buddhas emanate boundless rays of light; beings encounter them and attain enlightenment.",
        "source": "T25n1509_034:0313c05_5"
    },
    {
        "source_sentence": "有以神通變化指示其心而得道者；",
        "translation": "Some people attain enlightenment by means of mystic transformations, pointing to their minds.",
        "source": "T25n1509_034:0313c06_6"
    },
    {
        "source_sentence": "有佛但現色身而得道者；",
        "translation": "“Some buddhas attain enlightenment simply by manifesting their physical bodies.",
        "source": "T25n1509_034:0313c07_7"
    },
    {
        "source_sentence": "有佛遍身毛孔出眾妙香，眾生聞之而得道者；",
        "translation": "“There is a buddha whose pores all over his body emanate myriad subtle fragrances, and sentient beings who hear them attain enlightenment.",
        "source": "T25n1509_034:0313c07_8"
    },
    {
        "source_sentence": "有佛以食與眾生令得道者；",
        "translation": "“Some buddhas give food to sentient beings and cause them to attain enlightenment.",
        "source": "T25n1509_034:0313c08_9"
    },
    {
        "source_sentence": "有佛眾生但念而得道者；",
        "translation": "“There are buddha-sentient beings who attain enlightenment by merely thinking:",
        "source": "T25n1509_034:0313c09_10"
    },
    {
        "source_sentence": "有佛能以一切草木之聲而作佛事令眾生得道者；",
        "translation": "“Some buddhas can do buddha-work by means of the sounds of all plants and trees, causing sentient beings to attain enlightenment.",
        "source": "T25n1509_034:0313c10_11"
    },
    {
        "source_sentence": "有佛眾生聞名而得道者，為是佛故說言：「我作佛時，其聞名者皆令得度。」",
        "translation": "If there are buddhas and sentient beings who hear names and attain the path, they say this for the sake of those buddhas, When I become a buddha, those who hear names will all be liberated.",
        "source": "T25n1509_034:0313c11_12"
    },
    {
        "source_sentence": "復次，聞名，不但以名便得道也；",
        "translation": "“Furthermore, it is not by hearing names that one attains enlightenment.",
        "source": "T25n1509_034:0313c13_13"
    },
    {
        "source_sentence": "聞已修道，然後得度。",
        "translation": "After hearing it, they'll cultivate it, and then they'll be liberated.",
        "source": "T25n1509_034:0313c14_0"
    },
    {
        "source_sentence": "如須達長者，初聞佛名，內心驚喜，詣佛聽法而能得道。",
        "translation": "When the householder Sudarśana first heard the Buddha’s name he was astonished. He went to see the Buddha and listened to his exhortation, and thereupon attained enlightenment.",
        "source": "T25n1509_034:0313c14_1"
    },
    {
        "source_sentence": "又如貰夷羅婆羅門，從雞泥耶結髮梵志所初聞佛名，心即驚喜，直詣佛所，聞法得道。",
        "translation": "It's also like when a priest named Kātyāyana first heard the Buddha's name from a priest named Kātyāyana, he was surprised in his mind and went straight to the Buddha where he heard the teaching and attained enlightenment.",
        "source": "T25n1509_034:0313c15_2"
    },
    {
        "source_sentence": "是但說聞名，聞名為得道因緣，非得道也。",
        "translation": "This is only saying that hearing is called the cause and condition for attaining the path; it's not the cause for attaining the path.",
        "source": "T25n1509_034:0313c17_3"
    },
    {
        "source_sentence": "問曰：此經言「聞諸佛名即時得道」，不言「聞名已修道乃得」。",
        "translation": "Q: This sūtra says, He hears the names of the buddhas and immediately attains enlightenment, but it doesn't say, After hearing their names, he cultivates enlightenment.",
        "source": "T25n1509_034:0313c18_4"
    },
    {
        "source_sentence": "答曰：今言「即時」，不言「一心中」；",
        "translation": "Answer: Now, it's called immediate, but not in one mind.",
        "source": "T25n1509_034:0313c20_5"
    },
    {
        "source_sentence": "但言更無異事聞之，故言「即時」。",
        "translation": "They simply say there's no different thing to hear, so they say it's immediate.",
        "source": "T25n1509_034:0313c20_6"
    },
    {
        "source_sentence": "譬如經中說：「修慈心時即修七覺意。」",
        "translation": "It's like the sūtra that says, When you cultivate the mind of kindness, you cultivate seven awakening intentions.",
        "source": "T25n1509_034:0313c21_7"
    },
    {
        "source_sentence": "難者言：「慈三昧，有漏，是緣眾生法，云何得即時修七覺？」",
        "translation": "The difficult questioner said, Compassion samādhi, which is contaminated, is conditioned by the teachings of sentient beings, so how can it be cultivated in seven awakenings at once?",
        "source": "T25n1509_034:0313c22_8"
    },
    {
        "source_sentence": "答者言：「從慈起已即修七覺，更無餘法，故言即時。",
        "translation": "The answerer said, After arising from kindness, he cultivates seven awakenings, and there are no other dharmas; therefore, it's called immediate.",
        "source": "T25n1509_034:0313c23_9"
    },
    {
        "source_sentence": "即時有二種：一者、同時，二者、雖久，更無異法。",
        "translation": "There are two kinds of immediate and simultaneous: 1. simultaneous, and 2. even though long, there's no different thing.",
        "source": "T25n1509_034:0313c25_10"
    },
    {
        "source_sentence": "即是心而得修七覺亦名即時。」",
        "translation": "That is, it's the mind that cultivates seven kinds of awakening and is also called immediate.",
        "source": "T25n1509_034:0313c26_11"
    },
    {
        "source_sentence": "復次，有眾生福德淳熟、結使心薄，應當得道，若聞佛名，即時得道。",
        "translation": "Furthermore, if there are sentient beings whose virtue is pure and their bonds are weak, they should attain the path. If they hear the Buddha's name, they'll immediately attain the path.",
        "source": "T25n1509_034:0313c27_0"
    },
    {
        "source_sentence": "又復以佛威力故，聞即得度；",
        "translation": "“Furthermore, because of the Buddha’s mighty power, those who heard about it attained salvation.",
        "source": "T25n1509_034:0313c28_1"
    },
    {
        "source_sentence": "譬如熟癰，若無治者，得小因緣而便自潰；",
        "translation": "It is like the case of a cooked rice gruel. If there is no remedy, it will surely perish on its own due to minor causes and conditions.",
        "source": "T25n1509_034:0313c29_2"
    },
    {
        "source_sentence": "亦如熟果，若人無取，微風因緣，便自墮落；",
        "translation": "Good man, it is also like a ripened fruit. If someone does not harvest it, then due to the influence of wind they will fall down on their own.",
        "source": "T25n1509_034:0314a01_3"
    },
    {
        "source_sentence": "譬如新淨白[疊*毛]易為受色。",
        "translation": "It's like a new, pure white [tuft of *hair] that's easy to receive color.",
        "source": "T25n1509_034:0314a02_4"
    },
    {
        "source_sentence": "為是人故，說若聞佛名即時得道。",
        "translation": "Because of this person, it's said that if someone hears the Buddha's name, they'll immediately attain enlightenment.",
        "source": "T25n1509_034:0314a02_5"
    },
    {
        "source_sentence": "譬如鬼神著人，聞仙人呪名，即時捨去。",
        "translation": "It's like when a ghost attaches itself to someone and hears the names of the sage's spell, he immediately abandons it.",
        "source": "T25n1509_034:0314a03_6"
    },
    {
        "source_sentence": "問曰：過如恒河沙等世界，誰傳此名令彼得聞？",
        "translation": "Q: Like the worlds like the sands of the Ganges River, who transmits this name so that Peter hears it?",
        "source": "T25n1509_034:0314a04_7"
    },
    {
        "source_sentence": "答曰：佛以神力舉身毛孔放無量光明，一一光上皆有寶華，一一華上皆有坐佛，一一諸佛各說妙法以度眾生，又說諸佛名字，以是故聞。",
        "translation": "Answer: With supernormal powers, the Buddha raises his pores in his body and radiates measureless light. On each ray of light are jeweled flowers, on each flower there's a sitting Buddha, each one of which teaches the wonderful Dharma to save sentient beings, and he also speaks the names of the buddhas; that's why he hears them.",
        "source": "T25n1509_034:0314a05_8"
    },
    {
        "source_sentence": "如〈放光〉中說。",
        "translation": "It's as explained in the Emission of Light.",
        "source": "T25n1509_034:0314a09_9"
    },
    {
        "source_sentence": "復次，諸大菩薩以本願欲至無佛法處稱揚佛名，如此品中說者，是故得聞。",
        "translation": "Furthermore, the great bodhisattvas want to go to a place where there are no buddhas or dharmas because of their original vow to praise the Buddha's name, and it's because they say so in this chapter that they can hear it.",
        "source": "T25n1509_034:0314a09_10"
    },
    {
        "source_sentence": "復有大功德人從虛空中聞佛名號，如薩陀波崙菩薩。",
        "translation": "Again, there are people of great merit who hear the Buddha's name from space like Sadāprarudita Bodhisattva.",
        "source": "T25n1509_034:0314a11_11"
    },
    {
        "source_sentence": "又有從諸天聞，或從樹木音聲中聞，或從夢中。",
        "translation": "Also, it's heard from the gods, heard from the sounds of trees, or heard in a dream.",
        "source": "T25n1509_034:0314a12_12"
    },
    {
        "source_sentence": "復次，諸佛有不可思議力故自往語，或以聲告。",
        "translation": "Furthermore, because of their inconceivable powers, the buddhas may go and speak for themselves or they may tell them by voice.",
        "source": "T25n1509_034:0314a13_13"
    },
    {
        "source_sentence": "又如菩薩作願誓度一切眾生，以是故說：「我成佛時，過如恒河沙等世界眾生聞我名皆得成佛。",
        "translation": "It's also like when a bodhisattva makes a vow to save all sentient beings and therefore says, When I become a buddha, more than the number of sentient beings in worlds like the sands of the Ganges River who hear my name will attain buddhahood.",
        "source": "T25n1509_034:0314a14_14"
    },
    {
        "source_sentence": "欲得是者，當學般若波羅蜜。」",
        "translation": "Those who want to attain this should train in the perfection of wisdom.",
        "source": "T25n1509_034:0314a17_15"
    },
    {
        "source_sentence": "問曰：上欲得諸功德及諸所願，是諸事皆是眾行和合所成，何以故但說「當學般若波羅蜜」？",
        "translation": "Q: The above-mentioned desires to attain merits and vows are all accomplished by the combination of various practices, so why is it only said, You must train in the perfection of prajñā?",
        "source": "T25n1509_034:0314a18_0"
    },
    {
        "source_sentence": "答曰：是經名「般若波羅蜜」，佛欲解說其事，是故品品中皆讚般若波羅蜜。",
        "translation": "Answer: This sūtra is called prajñā-pāramitā, and the Buddha wants to explain its meaning; therefore, each chapter praises the prajñā-pāramitā.",
        "source": "T25n1509_034:0314a20_1"
    },
    {
        "source_sentence": "復次，般若波羅蜜是諸佛母，父母之中母功最重，是故佛以般若為母、般舟三昧為父。",
        "translation": "Furthermore, the perfection of prajñā is the mother of all buddhas, and among their parents, the mother's merit is the most important; therefore, the Buddha takes prajñā as his mother and panzhou concentration as his father.",
        "source": "T25n1509_034:0314a21_2"
    },
    {
        "source_sentence": "三昧唯能攝持亂心令智慧得成，而不能觀諸法實相。",
        "translation": "Only samādhi can collect and maintain a disturbed mind so that wisdom becomes formed, but it can't contemplate the true characteristics of dharmas.",
        "source": "T25n1509_034:0314a23_3"
    },
    {
        "source_sentence": "般若波羅蜜能遍觀諸法分別實相，無事不達、無事不成；",
        "translation": "The transcendent wisdom of prajñā-pāramitā can pervasively observe all things and discriminate their true characteristics. There is nothing that it does not understand, there is nothing that it does not accomplish.",
        "source": "T25n1509_034:0314a25_4"
    },
    {
        "source_sentence": "功德大故，名之為母。",
        "translation": "Because their merit is great, they're called mothers.",
        "source": "T25n1509_034:0314a26_5"
    },
    {
        "source_sentence": "以是故，行者雖行六波羅蜜及種種功德和合能具眾願，而但說「當學般若波羅蜜」。",
        "translation": "Therefore, even though practitioners practice the six perfections and various virtues combine to fulfill their vows, they simply say, You must train in the perfection of prajñāpāramitā.",
        "source": "T25n1509_034:0314a27_0"
    },
    {
        "source_sentence": "復次，如《般若》後品中說：「若無般若波羅蜜，餘五事不名波羅蜜。」",
        "translation": "Furthermore, as it's said in the latter part of the Prajñāpāramitā, If there were no prajñā-pāramitā, the other five things wouldn't be called pāramitā.",
        "source": "T25n1509_034:0314a28_1"
    },
    {
        "source_sentence": "雖普修眾行，亦不能滿具諸願；",
        "translation": "Though they cultivate all practices, yet they cannot fulfill their vows.",
        "source": "T25n1509_034:0314b01_2"
    },
    {
        "source_sentence": "如種種畫彩，若無膠者，亦不中用。",
        "translation": "It's like various kinds of paint, and if there's no glue, it won't be used in the middle.",
        "source": "T25n1509_034:0314b02_3"
    },
    {
        "source_sentence": "眾生從無始世界中來，雖修布施、持戒、忍辱、精進、一心、智慧，受世間果報已而復還盡。",
        "translation": "Even though sentient beings come from the beginningless world, they cultivate generosity, observe precepts, forbearance, effort, unity of mind, and wisdom, and after they experience the results of worldly rewards, they return to their end.",
        "source": "T25n1509_034:0314b02_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_034:0314b04_5"
    },
    {
        "source_sentence": "離般若波羅蜜故。",
        "translation": "It's because they're free of the perfection of wisdom.",
        "source": "T25n1509_034:0314b05_6"
    },
    {
        "source_sentence": "今以佛恩，以般若波羅蜜修行六事故得名波羅蜜，成就佛道，使佛佛相續而無窮盡。",
        "translation": "Now, because of the Buddha's kindness, he cultivates the six things called the perfection of prajñā-pāramitā with the perfection of wisdom and accomplishes the Buddha Way so that buddhas and buddhas continue without limit.",
        "source": "T25n1509_034:0314b05_7"
    },
    {
        "source_sentence": "復次，菩薩行般若波羅蜜時，普觀諸法皆空，空亦復空，滅諸觀，得無礙般若波羅蜜，以大悲方便力還起諸功德業；",
        "translation": "“Furthermore, when enlightening beings practice the transcendent wisdom, they observe that all things are void, and emptiness also is void. Extinguishing these observations, they attain unhindered transcendent wisdom; by the power of compassion and skill in means they return to produce meritorious actions.",
        "source": "T25n1509_034:0314b07_8"
    },
    {
        "source_sentence": "此清淨業因緣故，無願不得。",
        "translation": "Because of the causes and conditions of this pure action, there's no wish to attain it.",
        "source": "T25n1509_034:0314b10_9"
    },
    {
        "source_sentence": "餘功德離般若波羅蜜，無有無礙智慧，云何言「欲得諸願，當學檀波羅蜜等」？",
        "translation": "The other merits are free of the perfection of wisdom and lack unhindered wisdom, so why does it say, If you want to attain the vows, you should train in the perfection of giving?",
        "source": "T25n1509_034:0314b10_10"
    },
    {
        "source_sentence": "復次，又以五波羅蜜離般若，不得波羅蜜名字；",
        "translation": "“Furthermore, because the five transcendent ways are separated from prajñā, they do not get the names of the transcendent ways.",
        "source": "T25n1509_034:0314b12_11"
    },
    {
        "source_sentence": "五波羅蜜如盲，般若波羅蜜如眼；",
        "translation": "The five transcendent ways are like blindness, and the transcendent way of wisdom is like eyes.",
        "source": "T25n1509_034:0314b13_12"
    },
    {
        "source_sentence": "五波羅蜜如坏瓶盛水，般若波羅蜜如盛熟瓶；",
        "translation": "The five transcendent ways are like filling a broken pot with water, and the transcendent way of wisdom is like filling a ripened pot.",
        "source": "T25n1509_034:0314b14_13"
    },
    {
        "source_sentence": "五波羅蜜如鳥無兩翼，般若波羅蜜如有翼之鳥。",
        "translation": "The five perfections are like birds with no two wings, and the prajñāpāramitā is like a bird with wings.",
        "source": "T25n1509_034:0314b15_14"
    },
    {
        "source_sentence": "如是等種種因緣故，般若波羅蜜能成大事，以是故言：「欲得諸功德及願，當學般若波羅蜜。」",
        "translation": "Because of these various causes and conditions, the perfection of wisdom can accomplish great things; therefore, they say, If you want to attain merits and vows, you must train in the perfection of wisdom.",
        "source": "T25n1509_034:0314b16_15"
    },
    {
        "source_sentence": "大智度論卷第三十四",
        "translation": "Dazhiduo lun, vol. 34",
        "source": "T25n1509_034:0314b19_0"
    }
]