[
    {
        "source_sentence": "阿毘曇八犍度論卷第二十四",
        "translation": "Abhidharma-mahāvibhāga-śāstra, vol. 24",
        "source": "T26n1543_024:0883c18_0"
    },
    {
        "source_sentence": "迦旃延子造",
        "translation": "created by Kātyāyanaputra",
        "source": "T26n1543_024:0883c20_0"
    },
    {
        "source_sentence": "符秦罽賓三藏僧伽提婆",
        "translation": "*Mahāmeghadeva of the Tripiṭaka of Kauṇḍinya",
        "source": "T26n1543_024:0883c21_0"
    },
    {
        "source_sentence": "共竺佛念譯",
        "translation": "translated by Zhu Fonian",
        "source": "T26n1543_024:0883c22_0"
    },
    {
        "source_sentence": "根揵度中七緣跋渠之二",
        "translation": "The second of the seven conditions in the faculty of transmigration and the second of the two in the vajra",
        "source": "T26n1543_024:0883c23_0"
    },
    {
        "source_sentence": "◎復次諸根苦法智斷因習法智斷緣見苦斷。",
        "translation": "Furthermore, the faculties are stopped by knowledge of painful dharmas and the cognition of causes that are stopped by knowledge of accumulated dharmas and the cognition of conditions that are stopped by seeing suffering.",
        "source": "T26n1543_024:0883c24_0"
    },
    {
        "source_sentence": "云何根緣見苦斷因習未知智斷？",
        "translation": "What are the causes and conditions of seeing suffering as cessation by faculties that are not yet known as cessation by cognition?",
        "source": "T26n1543_024:0883c25_1"
    },
    {
        "source_sentence": "答曰：諸根習未知智斷緣見苦斷，復次諸根苦未知智斷因習未知智斷緣見苦斷。",
        "translation": "Answer: The faculties are cultivated and unknown cognition is stopped by seeing suffering as a condition for the cessation of suffering, and furthermore, the faculties are stopped by seeing suffering as a condition for the cessation of suffering that's",
        "source": "T26n1543_024:0883c25_2"
    },
    {
        "source_sentence": "云何根緣見苦斷因思惟斷？",
        "translation": "What are the causes of seeing and contemplating cessation of suffering by faculties and conditions that are stopped by seeing?",
        "source": "T26n1543_024:0883c27_3"
    },
    {
        "source_sentence": "答曰：諸根思惟斷緣見苦斷。",
        "translation": "Answer: The faculties contemplate the cessation of conditioned views that are painful and the cessation of suffering.",
        "source": "T26n1543_024:0883c28_4"
    },
    {
        "source_sentence": "云何根緣見苦斷因無斷？",
        "translation": "How are the causes of seeing suffering that are stopped by faculties and cognition not stopped?",
        "source": "T26n1543_024:0884a01_0"
    },
    {
        "source_sentence": "答曰：諸根無斷緣見苦斷(四八苦諦竟)。",
        "translation": "Answer: The faculties are not cut off by seeing the cessation of suffering as a condition (after the end of the four and eight noble truths of suffering).",
        "source": "T26n1543_024:0884a01_1"
    },
    {
        "source_sentence": "因見習諦斷緣習法智斷、因見習斷緣習未知智斷亦如上。",
        "translation": "The cessation of cognition of dharmas that are cultivated by seeing the truth of accumulation as causes and the cessation of cognition of unknownness as causes and the cessation of cognition that are cultivated by seeing what's cultiva",
        "source": "T26n1543_024:0884a02_2"
    },
    {
        "source_sentence": "諸根因見盡斷，彼根緣盡法智斷耶？",
        "translation": "Are the faculties stopped by seeing the end of causes, and are those faculties stopped by knowledge of the end of cognition of phenomena?",
        "source": "T26n1543_024:0884a03_3"
    },
    {
        "source_sentence": "答曰：或根因見盡斷，緣盡法智斷、緣盡未知智斷、緣無斷、無緣。",
        "translation": "Answer: Some faculties are stopped by seeing the end of causes and conditions, cognition of the end of dharmas stops, cognition of the end of conditions stops, cognition of the unknown stops, cognition of the cessation of",
        "source": "T26n1543_024:0884a04_4"
    },
    {
        "source_sentence": "云何根因見盡斷緣盡法智斷？",
        "translation": "What is the cessation of the knowledge of the exhaustion of faculties as causes and the cessation of cognition of phenomena as conditions?",
        "source": "T26n1543_024:0884a05_5"
    },
    {
        "source_sentence": "答曰：諸根見盡斷緣盡法智斷。",
        "translation": "Answer: The view that the faculties are ended and the cognition of the end of conditioned dharmas is stopped.",
        "source": "T26n1543_024:0884a06_6"
    },
    {
        "source_sentence": "云何根因見盡斷緣盡未知智斷？",
        "translation": "How are the faculties stopped by seeing the cessation of causes and the cognition of the cessation of conditions stopped by not knowing?",
        "source": "T26n1543_024:0884a07_7"
    },
    {
        "source_sentence": "答曰：諸根見盡斷緣盡未知智斷。",
        "translation": "Answer: When the views of the faculties are ended, the cognition of the end of cognition is not known to be ended.",
        "source": "T26n1543_024:0884a08_8"
    },
    {
        "source_sentence": "云何根因見盡斷緣無斷？",
        "translation": "How are the causes of seeing the end of faculties stopped and the conditions not stopped?",
        "source": "T26n1543_024:0884a08_9"
    },
    {
        "source_sentence": "答曰：諸根見盡斷緣無斷。",
        "translation": "Answer: When the views of the faculties are ended, the cognition is stopped and the conditions are not stopped.",
        "source": "T26n1543_024:0884a09_10"
    },
    {
        "source_sentence": "云何根因見盡斷無緣？",
        "translation": "How are the faculties stopped without conditions by seeing the end of causes?",
        "source": "T26n1543_024:0884a10_11"
    },
    {
        "source_sentence": "答曰：諸根無緣因見盡斷法。",
        "translation": "Answer: The faculties lack the causes and conditions for seeing the end of the path to cessation.",
        "source": "T26n1543_024:0884a10_12"
    },
    {
        "source_sentence": "設諸根緣見盡斷，彼根因盡法智斷耶？",
        "translation": "Suppose the faculties are stopped by seeing the end of cognition as a condition, and that faculty is stopped by the knowledge of the end of cognition of phenomena as a cause?",
        "source": "T26n1543_024:0884a11_13"
    },
    {
        "source_sentence": "答曰：或根緣見盡斷，因盡法智斷、因盡未知智斷、因苦法智斷、因苦未知智斷、因習法智斷、因習未知智斷、因思惟斷、因無斷。",
        "translation": "Answer: Perhaps the knowledge of the exhaustion of faculties and conditioned views is stopped because of the knowledge of the exhaustion of dharmas, stops because of the knowledge of the exhaustion of unknown cognition, stops because of the knowledge of the",
        "source": "T26n1543_024:0884a12_14"
    },
    {
        "source_sentence": "云何根緣見盡斷因盡法智斷？",
        "translation": "What is the cessation of the knowledge of the exhaustion of faculties and cognition of the exhaustion of causes by seeing the end of faculties?",
        "source": "T26n1543_024:0884a14_15"
    },
    {
        "source_sentence": "答曰：諸根盡法智斷緣見盡斷。",
        "translation": "Answer: When the faculties are exhausted, cognition of dharmas is stopped, and when the conditional views are stopped, they're stopped.",
        "source": "T26n1543_024:0884a15_16"
    },
    {
        "source_sentence": "云何根緣見盡斷因盡未知智斷？",
        "translation": "How are the faculties conditioned by views that are ended and the causes that are ended not known to be stopped by cognition?",
        "source": "T26n1543_024:0884a16_17"
    },
    {
        "source_sentence": "答曰：諸根盡未知智斷緣見盡斷。",
        "translation": "Answer: When the faculties are exhausted, they're not known to be stopped by cognition and stopped by seeing.",
        "source": "T26n1543_024:0884a17_18"
    },
    {
        "source_sentence": "云何根緣見盡斷因苦法智斷？",
        "translation": "What is the cessation of the cognition of suffering as a cause for seeing the exhaustion of faculties?",
        "source": "T26n1543_024:0884a17_19"
    },
    {
        "source_sentence": "答曰：諸根苦法智斷緣見盡斷，復次諸根習法智斷因苦法智斷緣見盡斷，",
        "translation": "Answer: The faculties are to be abandoned through knowledge of the law in relation to frustration, and they are to be abandoned through the vision of cessation as supporting object. Furthermore, the faculties are to be abandoned through knowledge of the",
        "source": "T26n1543_024:0884a18_20"
    },
    {
        "source_sentence": "復次諸根盡法智斷因苦法智斷緣見盡斷。",
        "translation": "Furthermore, the cognition of the exhaustion of faculties as a cause and the cognition of suffering as a condition are stopped by the cognition of the exhaustion of views.",
        "source": "T26n1543_024:0884a20_21"
    },
    {
        "source_sentence": "云何根緣見盡斷因苦未知智斷？",
        "translation": "How are the causes of suffering that are stopped by seeing the end of faculties and cognition not known to be stopped?",
        "source": "T26n1543_024:0884a21_22"
    },
    {
        "source_sentence": "答曰：諸根苦未知智斷緣見盡斷，復次諸根習未知智斷因苦未知智斷緣見盡斷，",
        "translation": "Answer: The faculties are to be abandoned through the cognition of suffering that is not yet known, and they are to be abandoned through the vision of cessation as supporting object. Furthermore, the faculties are to be abandoned through the",
        "source": "T26n1543_024:0884a22_23"
    },
    {
        "source_sentence": "復次諸根盡未知智斷因苦未知智斷緣見盡斷。",
        "translation": "Furthermore, when the faculties are exhausted, they're not known as cognition that stops causes suffering and not known as cognition that stops cognition, and when views are exhausted, they're stopped.",
        "source": "T26n1543_024:0884a23_24"
    },
    {
        "source_sentence": "云何根緣見盡斷因習法智斷？",
        "translation": "What is the cessation of the knowledge of the exhaustion of views as faculties and cognition of phenomena as causes that are cultivated?",
        "source": "T26n1543_024:0884a25_25"
    },
    {
        "source_sentence": "答曰：諸根習法智斷緣見盡斷，復次諸根苦法智斷因習法智斷緣見盡斷，",
        "translation": "Answer: The faculties are stopped by knowledge of the law in relation to accumulation of faculties, and they are stopped by seeing cessation as a condition. Furthermore, the faculties are stopped by knowledge of the law in relation to suffering that is",
        "source": "T26n1543_024:0884a25_26"
    },
    {
        "source_sentence": "復次諸根盡法智斷因習法智斷緣見盡斷。",
        "translation": "Furthermore, when the faculties are exhausted, cognition of dharmas is stopped because accumulation of cognition of dharmas is stopped and views are stopped because accumulation of cognition of dharmas are stopped.",
        "source": "T26n1543_024:0884a27_27"
    },
    {
        "source_sentence": "云何根緣見盡斷因習未知智斷？",
        "translation": "How are the causes and conditions for seeing the end of faculties stopped by accumulation not known as cognition stopped?",
        "source": "T26n1543_024:0884a28_28"
    },
    {
        "source_sentence": "答曰：諸根習未知智斷緣見盡斷，復次諸根苦未知智斷因習未知智斷緣見盡斷，",
        "translation": "Answer: The faculties are to be abandoned through the accumulation of not-knowing cognition at the root and are to be abandoned through the vision of cessation as supporting object. Furthermore, the faculties are to be abandoned through",
        "source": "T26n1543_024:0884a29_29"
    },
    {
        "source_sentence": "復次諸根盡未知智斷因習未知智斷緣見盡斷。",
        "translation": "Furthermore, when the faculties are exhausted and cognition of the unknown is stopped, the causes that are accumulated and the cognition of the unknown are stopped, and the conditions that are seen are ended.",
        "source": "T26n1543_024:0884b02_30"
    },
    {
        "source_sentence": "云何根緣見盡斷因思惟斷？",
        "translation": "What are the causes and contemplations that are stopped by seeing the end of faculties as cognition?",
        "source": "T26n1543_024:0884b03_31"
    },
    {
        "source_sentence": "答曰：諸根思惟斷緣見盡斷。",
        "translation": "Answer: The faculties contemplate the cessation of conditioned views that are completely eliminated.",
        "source": "T26n1543_024:0884b03_32"
    },
    {
        "source_sentence": "云何根緣見盡斷因無斷？",
        "translation": "How are the causes that are stopped by seeing the end of faculties and cognition not stopped?",
        "source": "T26n1543_024:0884b04_33"
    },
    {
        "source_sentence": "答曰：諸根無斷緣見盡斷(四諦八盡竟)。",
        "translation": "Answer: The faculties are not eliminated by seeing the cessation of cognition (after the eight extinctions of the four truths).",
        "source": "T26n1543_024:0884b05_34"
    },
    {
        "source_sentence": "因見道斷緣道法智斷、因見道斷緣道未知智斷亦如上(四八竟)。",
        "translation": "The cognition of the path that's stopped by seeing the path as a cause and the cognition of the path that's stopped by seeing the path as a condition and the cognition of the unknown path as a cause are likewise stopped as above (end of",
        "source": "T26n1543_024:0884b05_35"
    },
    {
        "source_sentence": "諸根因苦法智斷，彼根緣苦法智斷耶？",
        "translation": "What are the faculties that are stopped by knowledge of the law of suffering as cause and the faculties that are stopped by knowledge of the law of suffering as condition?",
        "source": "T26n1543_024:0884b07_36"
    },
    {
        "source_sentence": "答曰：或根因苦法智斷，緣苦法智斷、緣苦未知智斷、緣習法智斷、緣習未知智斷、緣盡法智斷、緣盡未知智斷、緣道法智斷、緣道未知智斷、緣思惟斷、緣無斷、無緣。",
        "translation": "Answer: Some faculties are stopped by knowledge of the Dharma of suffering as a cause and cognition of the Dharma of suffering as a condition; cognition of the Dharma of suffering as a condition is stopped by knowledge of the Dharma of suffering as a condition; cognition of the",
        "source": "T26n1543_024:0884b08_37"
    },
    {
        "source_sentence": "云何根因苦法智斷緣苦法智斷？",
        "translation": "How are the faculties stopped by knowledge of the law of suffering as cause and the cognition of the law of suffering as condition stopped by knowledge of the law of suffering?",
        "source": "T26n1543_024:0884b11_38"
    },
    {
        "source_sentence": "答曰：諸根苦法智斷緣苦法智斷，復次諸根習法智斷因苦法智斷緣苦法智斷。",
        "translation": "Answer: The faculties are stopped by knowledge of the Dharma of suffering as a condition for knowledge of the Dharma of suffering and stopped by knowledge of the Dharma of suffering as a condition for knowledge of the Dharma of suffering, and furthermore, the faculties are stopped by knowledge",
        "source": "T26n1543_024:0884b12_39"
    },
    {
        "source_sentence": "云何根因苦法智斷緣苦未知智斷？",
        "translation": "How are the faculties that are stopped by knowledge of suffering as a cause and the cognition of dharmas that are stopped by knowledge of suffering as a condition stopped by knowledge of what's unknown?",
        "source": "T26n1543_024:0884b14_40"
    },
    {
        "source_sentence": "答曰：諸根苦法智斷緣苦未知智斷，復次諸根習法智斷因苦法智斷緣苦未知智斷。",
        "translation": "Answer: The faculties are stopped by knowledge of the cognition of suffering as a condition for the cognition of suffering that doesn't know it, and furthermore, the faculties are stopped by knowledge of the accumulation of dharmas that don't know",
        "source": "T26n1543_024:0884b15_41"
    },
    {
        "source_sentence": "云何根因苦法智斷緣習法智斷？",
        "translation": "What are the faculties that are stopped by knowledge of suffering as a cause for knowledge of the Dharma and those that are stopped by knowledge of the Dharma as a condition for knowledge of accumulation?",
        "source": "T26n1543_024:0884b17_42"
    },
    {
        "source_sentence": "答曰：諸根苦法智斷緣習法智斷，復次諸根習法智斷因苦法智斷緣習法智斷。",
        "translation": "Answer: The faculties are stopped by knowledge of the cognition of suffering as a cause and stop by knowledge of the cognition of the accumulation of dharmas, and furthermore, the faculties are stopped by knowledge of the accumulation of dharmas that",
        "source": "T26n1543_024:0884b18_0"
    },
    {
        "source_sentence": "云何根因苦法智斷緣習未知智斷？",
        "translation": "How are the faculties stopped by cognition of suffering as a cause and the cognition of dharmas stopped by accumulating unknown cognition?",
        "source": "T26n1543_024:0884b19_1"
    },
    {
        "source_sentence": "答曰：諸根苦法智斷緣習未知智斷，復次諸根習法智斷因苦法智斷緣習未知智斷。",
        "translation": "Answer: The faculties are stopped by knowledge of the cognition of suffering as a cause and stopped by knowledge of the cognition of suffering as a condition that doesn't know, and furthermore, the faculties are stopped by knowledge of the cognition of the cognitio",
        "source": "T26n1543_024:0884b20_2"
    },
    {
        "source_sentence": "云何根因苦法智斷緣盡法智斷？",
        "translation": "What is the cognition of suffering as a cause for the cessation of faculties and the cognition of extinction as a condition for the cessation of cognition of phenomena?",
        "source": "T26n1543_024:0884b22_3"
    },
    {
        "source_sentence": "答曰：諸根苦法智斷緣盡法智斷，復次諸根習法智斷因苦法智斷緣盡法智斷，",
        "translation": "Answer: The faculties are stopped by knowledge of the law in relation to suffering as a condition for knowledge of the law, and they are stopped by knowledge of the law in relation to cessation. Furthermore, the faculties are stopped by knowledge of the law",
        "source": "T26n1543_024:0884b23_4"
    },
    {
        "source_sentence": "復次諸根盡法智斷因苦法智斷緣盡法智斷。",
        "translation": "Furthermore, when the faculties are exhausted, cognition of dharmas ceases because the cognition of suffering as dharmas ceases and the cognition of dharmas as conditions ceases.",
        "source": "T26n1543_024:0884b25_5"
    },
    {
        "source_sentence": "云何根因苦法智斷緣盡未知智斷？",
        "translation": "How are the faculties stopped by cognition of suffering as a cause and the cognition of dharmas stopped by the cognition of endlessness not known as cognition?",
        "source": "T26n1543_024:0884b26_6"
    },
    {
        "source_sentence": "答曰：諸根苦法智斷緣盡未知智斷，復次諸根習法智斷因苦法智斷緣盡未知智斷。",
        "translation": "Answer: The cognition of the knowledge of suffering as a cause and the cognition of suffering as a condition that ends are not known to be stopped, and furthermore, the cognition of accumulation as a cause and the cognition of suffering as a condition that ends",
        "source": "T26n1543_024:0884b27_7"
    },
    {
        "source_sentence": "云何根因苦法智斷緣道法智斷？",
        "translation": "What are the faculties that are stopped by knowledge of suffering as a cause for knowledge of the Dharma and the path as a condition for knowledge of the Dharma?",
        "source": "T26n1543_024:0884b29_8"
    },
    {
        "source_sentence": "答曰：諸根苦法智斷緣道法智斷，復次諸根習法智斷因苦法智斷緣道法智斷，",
        "translation": "Answer: The faculties are stopped by knowledge of the law in relation to suffering that is based on knowledge of the law in relation to the path, and they are stopped by knowledge of the law in relation to the path. Furthermore, the faculties are stopped by",
        "source": "T26n1543_024:0884c01_0"
    },
    {
        "source_sentence": "復次諸根道法智斷因苦法智斷緣道法智斷。",
        "translation": "Furthermore, the cognition of the path of faculties is stopped by the cognition of suffering as a cause and the cognition of the path as a condition are stopped by the cognition of the path as a result.",
        "source": "T26n1543_024:0884c02_1"
    },
    {
        "source_sentence": "云何根因苦法智斷緣道未知智斷？",
        "translation": "What are the faculties that are stopped by knowledge of suffering as a cause and by knowledge of dharmas that are stopped by not knowing the path as a condition?",
        "source": "T26n1543_024:0884c03_2"
    },
    {
        "source_sentence": "答曰：諸根苦法智斷緣道未知智斷，復次諸根習法智斷因苦法智斷緣道未知智斷。",
        "translation": "Answer: The faculties are stopped by knowledge of the cognition of suffering as a condition for the path that's not known to be stopped, and furthermore, the faculties are stopped by knowledge of the accumulation of dharmas that are stopped by knowledge of",
        "source": "T26n1543_024:0884c04_3"
    },
    {
        "source_sentence": "云何根因苦法智斷緣思惟斷？",
        "translation": "What are the faculties that are stopped by contemplation based on the knowledge of suffering as a condition for the cessation of cognition of dharmas?",
        "source": "T26n1543_024:0884c06_4"
    },
    {
        "source_sentence": "答曰：諸根苦法智斷緣思惟斷，復次諸根習法智斷因苦法智斷緣思惟斷，",
        "translation": "Answer: The faculties are to be abandoned through the knowledge of the law in relation to frustration, and they are to be abandoned through reasoning and through reflection. Furthermore, the faculties are to be abandoned through the knowledge of the law in",
        "source": "T26n1543_024:0884c07_5"
    },
    {
        "source_sentence": "復次諸根思惟斷因苦法智斷緣思惟斷。",
        "translation": "Furthermore, the faculties are contemplated as being stopped because of the cessation of knowledge of painful dharmas and the contemplation of stopping conditioned cognition.",
        "source": "T26n1543_024:0884c09_6"
    },
    {
        "source_sentence": "云何根因苦法智斷緣無斷？",
        "translation": "How are the faculties stopped by the cognition of suffering as a cause and not stopped by the cognition of dharmas?",
        "source": "T26n1543_024:0884c10_7"
    },
    {
        "source_sentence": "答曰：諸根盡法智斷道法智斷因苦法智斷緣無斷。",
        "translation": "Answer: When the faculties are exhausted by knowledge of the Dharma and knowledge of the path, knowledge of the Dharma and knowledge of the path are eliminated, knowledge of the causes of suffering and knowledge of the Dharma are eliminated, and knowledge of the cognition of the",
        "source": "T26n1543_024:0884c10_8"
    },
    {
        "source_sentence": "云何根因苦法智斷無緣？",
        "translation": "How are the faculties that are the cause of suffering and the cognition of dharmas to be stopped without conditions?",
        "source": "T26n1543_024:0884c11_9"
    },
    {
        "source_sentence": "答曰：諸根無緣因苦法智斷。",
        "translation": "Answer: The faculties are stopped by the cognition of painful dharmas as unconditional causes.",
        "source": "T26n1543_024:0884c12_10"
    },
    {
        "source_sentence": "設諸根緣苦法智斷，彼根因苦法智斷耶？",
        "translation": "Suppose the faculties are stopped by knowledge of the law of suffering as a condition, and those faculties are stopped by knowledge of the law of suffering as a cause?",
        "source": "T26n1543_024:0884c13_11"
    },
    {
        "source_sentence": "答曰：或根緣苦法智斷，因苦法智斷、因習法智斷、因思惟斷、因無斷。",
        "translation": "Answer: Perhaps the cognition of the Dharma of suffering as a root condition is stopped, the cognition of the Dharma of suffering as a cause is stopped, the cognition of the Dharma of accumulation as a cause is stopped, the cognition of the Dharma of contemplation as",
        "source": "T26n1543_024:0884c14_12"
    },
    {
        "source_sentence": "云何根緣苦法智斷因苦法智斷？",
        "translation": "How are the faculties conditioned by knowledge of suffering stopped by knowledge of the law of suffering and the causes stopped by knowledge of the law of suffering?",
        "source": "T26n1543_024:0884c15_13"
    },
    {
        "source_sentence": "答曰：諸根苦法智斷緣苦法智斷，復次諸根習法智斷因苦法智斷緣苦法智斷。",
        "translation": "Answer: The faculties are stopped by knowledge of the Dharma of suffering as a condition for knowledge of the Dharma of suffering and stopped by knowledge of the Dharma of suffering as a condition for knowledge of the Dharma of suffering, and furthermore, the faculties are stopped by knowledge",
        "source": "T26n1543_024:0884c16_14"
    },
    {
        "source_sentence": "云何根緣苦法智斷因習法智斷？",
        "translation": "How are the cognitions of suffering as a root condition and the cognitions of suffering as a cause and the cognitions of accumulation as a result stopped?",
        "source": "T26n1543_024:0884c18_15"
    },
    {
        "source_sentence": "答曰：諸根習法智斷緣苦法智斷，復次諸根苦法智斷因習法智斷緣苦法智斷。",
        "translation": "Answer: The cognition of the accumulation of dharmas by the faculties is stopped, the cognition of suffering as a condition is stopped, and the cognition of suffering as a condition is stopped. Furthermore, the cognition of suffering as a condition is",
        "source": "T26n1543_024:0884c19_0"
    },
    {
        "source_sentence": "云何根緣苦法智斷因思惟斷？",
        "translation": "How are the faculties conditioned by cognition of suffering as a cause for stopping and the contemplation of cessation stopped?",
        "source": "T26n1543_024:0884c20_1"
    },
    {
        "source_sentence": "答曰：諸根思惟斷緣苦法智斷。",
        "translation": "Answer: The faculties contemplate the cessation of cognition of suffering as a condition for the cessation of cognition of dharmas.",
        "source": "T26n1543_024:0884c21_2"
    },
    {
        "source_sentence": "云何根緣苦法智斷因無斷？",
        "translation": "How are the faculties conditioned by knowledge of suffering and dharmas to be eliminated as causes that are not eliminated?",
        "source": "T26n1543_024:0884c22_3"
    },
    {
        "source_sentence": "答曰：諸根無斷緣苦法智斷。",
        "translation": "Answer: The faculties are not stopped because the cognition of suffering as a condition is stopped by the cognition of qualities.",
        "source": "T26n1543_024:0884c22_4"
    },
    {
        "source_sentence": "諸根因苦未知智斷，彼根緣苦未知智斷耶？",
        "translation": "What are the faculties that are stopped by cognition of suffering as a cause and not yet known, and what are those faculties that are stopped by cognition of suffering as a condition and not yet known?",
        "source": "T26n1543_024:0884c23_5"
    },
    {
        "source_sentence": "答曰：或根因苦未知智斷，緣苦未知智斷、緣習未知智斷、緣盡未知智斷、緣道未知智斷、緣思惟斷、緣無斷。",
        "translation": "Answer: Perhaps the cognition of suffering as a root cause and suffering as a condition is not known to be stopped, the cognition of suffering as a condition is not known to be stopped, the cognition of accumulation as a condition is not known to be stopped, the cognitio",
        "source": "T26n1543_024:0884c24_6"
    },
    {
        "source_sentence": "云何根因苦未知智斷緣苦未知智斷？",
        "translation": "What are the faculties that are stopped by cognition of suffering as unknown causes and stop by cognition of suffering as unknown conditions?",
        "source": "T26n1543_024:0884c27_0"
    },
    {
        "source_sentence": "答曰：諸根苦未知智斷緣苦未知智斷，復次諸根習未知智斷因苦未知智斷緣苦未知智斷。",
        "translation": "Answer: The faculties are stopped by the cognition of suffering that's unknown to the knowledge of suffering as a condition for the cessation of suffering and not known to the knowledge of suffering, and furthermore, the faculties are stopped by the cognitio",
        "source": "T26n1543_024:0884c27_1"
    },
    {
        "source_sentence": "云何根因苦未知智斷緣習未知智斷？",
        "translation": "What are the faculties that are stopped by cognition of suffering as a condition for the cessation of accumulation and not known as cognition?",
        "source": "T26n1543_024:0885a01_0"
    },
    {
        "source_sentence": "答曰：諸根苦未知智斷緣習未知智斷，復次諸根習未知智斷因苦未知智斷緣習未知智斷。",
        "translation": "Answer: The faculties are stopped by the cognition of suffering that's unknown to the knowledge of suffering and the cognition of accumulation that's not known to the knowledge of accumulation, and furthermore, the faculties are stopped by the cognitio",
        "source": "T26n1543_024:0885a01_1"
    },
    {
        "source_sentence": "云何根因苦未知智斷緣盡未知智斷？",
        "translation": "What are the faculties that are stopped by cognition of suffering as a condition for the cessation of unknown cognition and the cognition of the end of unknown cognition?",
        "source": "T26n1543_024:0885a04_0"
    },
    {
        "source_sentence": "答曰：諸根苦未知智斷緣盡未知智斷，復次諸根習未知智斷因苦未知智斷緣盡未知智斷，",
        "translation": "Answer: The faculties are to be abandoned through the cognition of suffering that is not known as unknown, and they are to be abandoned through the cognition of the extinction of conditioned states. Furthermore, the faculties are to",
        "source": "T26n1543_024:0885a04_1"
    },
    {
        "source_sentence": "復次諸根盡未知智斷因苦未知智斷緣盡未知智斷。",
        "translation": "Furthermore, when the faculties are ended and unknown cognition is stopped, the causes of suffering that are painful and unknown cognition are stopped, and the conditions are ended and unknown cognition is stopped.",
        "source": "T26n1543_024:0885a07_0"
    },
    {
        "source_sentence": "云何根因苦未知智斷緣道未知智斷？",
        "translation": "What are the faculties that are stopped by cognition of suffering as unknown causes and stop by cognition of the path as unknown conditions?",
        "source": "T26n1543_024:0885a08_1"
    },
    {
        "source_sentence": "答曰：諸根苦未知智斷緣道未知智斷，復次諸根習未知智斷因苦未知智斷緣道未知智斷，",
        "translation": "Answer: The faculties are to be abandoned through the cognition of suffering that is not yet known as a condition for the path, and they are to be abandoned through subsequent knowledge. Furthermore, the faculties are to be abandoned through the cognition",
        "source": "T26n1543_024:0885a09_2"
    },
    {
        "source_sentence": "復次諸根道未知智斷因苦未知智斷緣道未知智斷。",
        "translation": "Furthermore, the paths of the faculties are stopped by unknown cognition because suffering is stopped by unknown cognition and the paths of cognition are stopped by unknown cognition.",
        "source": "T26n1543_024:0885a11_3"
    },
    {
        "source_sentence": "云何根因苦未知智斷緣思惟斷？",
        "translation": "What are the faculties that are stopped by contemplation based on the cognition of suffering as unknown causes and stopping?",
        "source": "T26n1543_024:0885a12_4"
    },
    {
        "source_sentence": "答曰：諸根苦未知智斷緣思惟斷，復次諸根習未知智斷因苦未知智斷緣思惟斷，",
        "translation": "Answer: The faculties are abandoned by contemplation when the cognition of suffering as unknown to beings is abandoned, and furthermore, the faculties are abandoned by contemplation when the cognition of accumulation as unknown to beings",
        "source": "T26n1543_024:0885a13_5"
    },
    {
        "source_sentence": "復次諸根思惟斷因苦未知智斷緣思惟斷。",
        "translation": "Furthermore, the faculties are contemplated as being stopped because of the cessation of suffering that's not known to be stopped by cognition and the conditions are contemplated as being stopped.",
        "source": "T26n1543_024:0885a15_6"
    },
    {
        "source_sentence": "云何根因苦未知智斷緣無斷？",
        "translation": "How are the faculties that are not known to be stopped by knowledge of suffering as a cause and not stopped by cognition as a condition?",
        "source": "T26n1543_024:0885a16_7"
    },
    {
        "source_sentence": "答曰：諸根盡未知智斷道未知智斷因苦未知智斷緣無斷。",
        "translation": "Answer: When the faculties are exhausted, it's not known that cognition is stopped, and the path is not known that cognition is stopped because of the cessation of suffering and not known that cognition is stopped, and the conditions are not stopped.",
        "source": "T26n1543_024:0885a16_8"
    },
    {
        "source_sentence": "設諸根緣苦未知智斷，彼根因苦未知智斷耶？",
        "translation": "Suppose the faculties are stopped by cognition that doesn't know suffering as a condition and those faculties are stopped by cognition that doesn't know suffering as a cause?",
        "source": "T26n1543_024:0885a18_9"
    },
    {
        "source_sentence": "答曰：或根緣苦未知智斷，因苦未知智斷、因苦法智斷、因習法智斷、因習未知智斷、因思惟斷、因無斷。",
        "translation": "Answer: Perhaps the cognition of suffering as a root condition is stopped by not knowing what's painful, the cognition of suffering as a cause is stopped by not knowing what's painful, the cognition of suffering as a cause is stopped by not knowing what'",
        "source": "T26n1543_024:0885a19_10"
    },
    {
        "source_sentence": "云何根緣苦未知智斷因苦未知智斷？",
        "translation": "How are the faculties conditioned by suffering that are not known as cognition and the causes of suffering that are not known as cognition stopped?",
        "source": "T26n1543_024:0885a21_11"
    },
    {
        "source_sentence": "答曰：諸根苦未知智斷緣苦未知智斷，復次諸根習未知智斷因苦未知智斷緣苦未知智斷。",
        "translation": "Answer: The faculties are stopped by the cognition of suffering that's unknown to the knowledge of suffering as a condition for the cessation of suffering and not known to the knowledge of suffering, and furthermore, the faculties are stopped by the cognitio",
        "source": "T26n1543_024:0885a22_12"
    },
    {
        "source_sentence": "云何根緣苦未知智斷因苦法智斷？",
        "translation": "How are the faculties conditioned by suffering unknown cognition and the cognition of suffering as cause and the cognition of suffering as principle stopped?",
        "source": "T26n1543_024:0885a24_13"
    },
    {
        "source_sentence": "答曰：諸根苦法智斷緣苦未知智斷，復次諸根習法智斷因苦法智斷緣苦未知智斷。",
        "translation": "Answer: The faculties are stopped by knowledge of the cognition of suffering as a condition for the cognition of suffering that doesn't know it, and furthermore, the faculties are stopped by knowledge of the accumulation of dharmas that don't know",
        "source": "T26n1543_024:0885a25_14"
    },
    {
        "source_sentence": "云何根緣苦未知智斷因習法智斷？",
        "translation": "How are the faculties conditioned by suffering not known as cognition and the cognition of causes and conditions stopped by the cognition of dharmas?",
        "source": "T26n1543_024:0885a27_15"
    },
    {
        "source_sentence": "答曰：諸根習法智斷緣苦未知智斷，復次諸根苦法智斷因習法智斷緣苦未知智斷。",
        "translation": "Answer: The cognition of the accumulation of dharmas in the faculties is stopped by the cognition of suffering as a condition for the cognition of suffering that's not known, and furthermore, the cognition of suffering as a condition for the cultivation",
        "source": "T26n1543_024:0885a28_16"
    },
    {
        "source_sentence": "云何根緣苦未知智斷因習未知智斷？",
        "translation": "How are the faculties conditioned by suffering not known as cognition of cessation and the causes conditioned by accumulation not known as cognition of cessation?",
        "source": "T26n1543_024:0885b01_17"
    },
    {
        "source_sentence": "答曰：諸根習未知智斷緣苦未知智斷，復次諸根苦未知智斷因習未知智斷緣苦未知智斷。",
        "translation": "Answer: The cognition of the accumulation of faculties that are unknown and the cognition of suffering as a condition for the cessation of afflictions is not known, and furthermore, the cognition of the accumulation of faculties that are",
        "source": "T26n1543_024:0885b01_18"
    },
    {
        "source_sentence": "云何根緣苦未知智斷因思惟斷？",
        "translation": "How are the faculties conditioned by suffering not known as cognition and the causes of cessation stopped by contemplation stopped?",
        "source": "T26n1543_024:0885b04_19"
    },
    {
        "source_sentence": "答曰：諸根思惟斷緣苦未知智斷。",
        "translation": "Answer: The faculties contemplate the cessation of cognition that doesn't know suffering as a condition for the cessation of sensation.",
        "source": "T26n1543_024:0885b04_20"
    },
    {
        "source_sentence": "云何根緣苦未知智斷因無斷？",
        "translation": "How are the faculties conditioned by suffering unknown cognition and the causes of cessation not eliminated?",
        "source": "T26n1543_024:0885b05_21"
    },
    {
        "source_sentence": "答曰：諸根無斷緣苦未知智斷(八共八苦智竟)。",
        "translation": "Answer: The faculties are not cut because the cognition of suffering as a condition is not known to be cut (after the completion of the eight shared eight kinds of painful cognition).",
        "source": "T26n1543_024:0885b06_22"
    },
    {
        "source_sentence": "因習法智斷緣習法智斷、因習未知智斷緣習未知智斷亦如上。",
        "translation": "The cessation of cognition of dharmas as causes and the cessation of cognition of dharmas as conditions and the cessation of cognition of dharmas as causes and the cessation of cognition of not-knowing cognition as",
        "source": "T26n1543_024:0885b07_23"
    },
    {
        "source_sentence": "諸根因盡法智斷，彼根緣盡法智斷耶？",
        "translation": "When the causes of the faculties are exhausted, knowledge of the Dharma stops, and when those faculties are exhausted, knowledge of the Dharma stops?",
        "source": "T26n1543_024:0885b08_24"
    },
    {
        "source_sentence": "答曰：或根因盡法智斷，緣盡法智斷、緣無斷、無緣。",
        "translation": "Answer: Perhaps the cognition of the Dharma when the causes of faculties are ended, the cognition of the Dharma when the conditions are ended, the cognition of the Dharma when the conditions are ended, the cognition of the Dharma when the conditions are not ended, and",
        "source": "T26n1543_024:0885b09_25"
    },
    {
        "source_sentence": "云何根因盡法智斷緣盡法智斷？",
        "translation": "What is the cessation of knowledge of the exhaustion of faculties as causes and what is the cessation of knowledge of the exhaustion of knowledge of phenomena as conditions?",
        "source": "T26n1543_024:0885b10_26"
    },
    {
        "source_sentence": "答曰：諸根盡法智斷緣盡法智斷。",
        "translation": "Answer: The cognition of the exhaustion of faculties and the cognition of the exhaustion of cognition of phenomena are stopped by the cognition of the exhaustion of cognition of phenomena as conditions.",
        "source": "T26n1543_024:0885b11_27"
    },
    {
        "source_sentence": "云何根因盡法智斷緣無斷？",
        "translation": "What are the causes and conditions for the cessation of knowledge of the exhaustion of faculties that are not eliminated?",
        "source": "T26n1543_024:0885b12_28"
    },
    {
        "source_sentence": "答曰：諸根盡法智斷緣無斷。",
        "translation": "Answer: The cognition of the exhaustion of faculties as dharmas stops conditioned by the cessation of cognition, and it doesn't stop.",
        "source": "T26n1543_024:0885b12_29"
    },
    {
        "source_sentence": "云何根因盡法智斷無緣？",
        "translation": "What is the cognition of the exhaustion of faculties as causes that cuts off dharmas without conditions?",
        "source": "T26n1543_024:0885b13_30"
    },
    {
        "source_sentence": "答曰：諸根無緣因盡法智斷法。",
        "translation": "Answer: The faculties lack the cognition of the cessation of dharmas as causes and stopping dharmas.",
        "source": "T26n1543_024:0885b14_0"
    },
    {
        "source_sentence": "設諸根緣盡法智斷，彼根因盡法智斷耶？",
        "translation": "Suppose the cognition of the exhaustion of dharmas as causes for the faculties is stopped, and those faculties are stopped by the knowledge of the exhaustion of dharmas as causes?",
        "source": "T26n1543_024:0885b14_1"
    },
    {
        "source_sentence": "答曰：或根緣盡法智斷，因盡法智斷、因苦法智斷、因習法智斷、因思惟斷、因無斷。",
        "translation": "Answer: Perhaps the cognition of qualities at the end of faculties and conditions is stopped, the cognition of qualities at the end of causes is stopped, the cognition of qualities at the end of suffering is stopped, the cognition of qualities at the",
        "source": "T26n1543_024:0885b15_2"
    },
    {
        "source_sentence": "云何根緣盡法智斷因盡法智斷？",
        "translation": "What is the cessation of knowledge of the exhaustion of faculties and cognition of phenomena by the destruction of causes and end of knowledge of the teaching?",
        "source": "T26n1543_024:0885b17_3"
    },
    {
        "source_sentence": "答曰：諸根盡法智斷緣盡法智斷。",
        "translation": "Answer: The cognition of the exhaustion of faculties and the cognition of the exhaustion of cognition of phenomena are stopped by the cognition of the exhaustion of cognition of phenomena as conditions.",
        "source": "T26n1543_024:0885b18_4"
    },
    {
        "source_sentence": "云何根緣盡法智斷因苦法智斷？",
        "translation": "What is the cessation of knowledge of the exhaustion of faculties and cognition of phenomena that is the cause of knowledge of the truth of suffering?",
        "source": "T26n1543_024:0885b19_0"
    },
    {
        "source_sentence": "答曰：諸根苦法智斷緣盡法智斷。",
        "translation": "Answer: The cognition of the faculties as suffering and the cognition of the Dharma are stopped, and the cognition of the cessation of conditioned dharmas is stopped.",
        "source": "T26n1543_024:0885b19_1"
    },
    {
        "source_sentence": "復次諸根習法智斷。",
        "translation": "Furthermore, the faculties are conditioned by the cognition of dharmas that are stopped.",
        "source": "T26n1543_024:0885b20_2"
    },
    {
        "source_sentence": "因苦法智斷緣盡法智斷，復次諸根盡法智斷因苦法智斷緣盡法智斷。",
        "translation": "Knowledge of the law in relation to suffering as cause and knowledge of the law in relation to condition are abandoned through the cessation of knowledge of the law; knowledge of the law in relation to the exhaustion of faculties is also abandoned. Furthermore, knowledge",
        "source": "T26n1543_024:0885b21_0"
    },
    {
        "source_sentence": "云何諸根緣盡法智斷因習法智斷？",
        "translation": "How are the faculties conditioned by the exhaustion of cognition of phenomena and the cessation of cognition of phenomena as causes for the cessation of accumulated cognition of phenomena?",
        "source": "T26n1543_024:0885b22_1"
    },
    {
        "source_sentence": "答曰：諸根習法智斷緣盡法智斷，復次諸根苦法智斷因習法智斷緣盡法智斷，",
        "translation": "Answer: The knowledge of the accumulation of dharmas by the faculties is eliminated, the cognition of the extinction of conditioned phenomena is eliminated, and the knowledge of the exhaustion of conditioned phenomena is eliminated. Fur",
        "source": "T26n1543_024:0885b23_2"
    },
    {
        "source_sentence": "復次諸根盡法智斷因習法智斷緣盡法智斷。",
        "translation": "Furthermore, when the faculties are exhausted, cognition of dharmas is stopped, causal cognition of accumulated dharmas is stopped, and conditional cognition of dharmas is stopped.",
        "source": "T26n1543_024:0885b25_3"
    },
    {
        "source_sentence": "云何根緣盡法智斷因思惟斷？",
        "translation": "What are the causes and contemplations for the cessation of knowledge of the exhaustion of faculties as cognition of phenomena?",
        "source": "T26n1543_024:0885b26_4"
    },
    {
        "source_sentence": "答曰：諸根思惟斷緣盡法智斷。",
        "translation": "Answer: The cognition of the end of dharmas is stopped by contemplating the cessation of the faculties as a condition for the cessation of cognition.",
        "source": "T26n1543_024:0885b27_0"
    },
    {
        "source_sentence": "云何根緣盡法智斷因無斷？",
        "translation": "How are the causes of knowledge of the exhaustion of faculties and cognition of phenomena stopped and not stopped?",
        "source": "T26n1543_024:0885b27_1"
    },
    {
        "source_sentence": "答曰：諸根無斷緣盡法智斷。",
        "translation": "Answer: The faculties are not cut off, and the cognition of the end of conditioned dharmas is cut off.",
        "source": "T26n1543_024:0885b28_2"
    },
    {
        "source_sentence": "諸根因盡未知智斷，彼根緣盡未知智斷耶？",
        "translation": "When the causes of the faculties are ended, it's not known that cognition is stopped, and when those faculties end as a condition, it's not known that cognition is stopped?",
        "source": "T26n1543_024:0885b29_0"
    },
    {
        "source_sentence": "答曰：或根因盡未知智斷，緣盡未知智斷、緣無斷。",
        "translation": "Answer: Perhaps the causes of faculties are ended and not known to be stopped by cognition, the conditions are ended and not known to be stopped by cognition, and the conditions are not stopped by cognition.",
        "source": "T26n1543_024:0885c01_0"
    },
    {
        "source_sentence": "云何根因盡未知智斷緣盡未知智斷？",
        "translation": "How are the causes of faculties ended and not known cognition ended, and the conditions ended and not known cognition ended?",
        "source": "T26n1543_024:0885c02_1"
    },
    {
        "source_sentence": "答曰：諸根盡未知智斷緣盡未知智斷。",
        "translation": "Answer: When the faculties are exhausted, cognition of the unknown is stopped, and when the conditions are exhausted, cognition of the unknown is stopped.",
        "source": "T26n1543_024:0885c03_0"
    },
    {
        "source_sentence": "云何根因盡未知智斷緣無斷？",
        "translation": "How are the causes of faculties exhausted and not known to be eliminated by cognition and the conditions not eliminated?",
        "source": "T26n1543_024:0885c03_1"
    },
    {
        "source_sentence": "答曰：諸根盡未知智斷緣無斷。",
        "translation": "Answer: When the faculties are exhausted, they aren't known to be stopped by cognition and have no stopping as a condition.",
        "source": "T26n1543_024:0885c04_2"
    },
    {
        "source_sentence": "設諸根緣盡未知智斷，彼根因盡未知智斷耶？",
        "translation": "Suppose the cognition of the extinction of all faculties and conditions is stopped by not knowing, and the cause of that faculty is stopped by not knowing when those faculties are ended?",
        "source": "T26n1543_024:0885c05_3"
    },
    {
        "source_sentence": "答曰：或根緣盡未知智斷，因盡未知智斷、因苦法智斷、因苦未知智斷、因習法智斷、因習未知智斷、因思惟斷、因無斷。",
        "translation": "Answer: Perhaps the cognition of the exhaustion of faculties and conditions is not known, the cognition of the exhaustion of causes is not known, the cognition of suffering as dharmas is not known, the cognition of suffering as cause is not known,",
        "source": "T26n1543_024:0885c06_4"
    },
    {
        "source_sentence": "云何根緣盡未知智斷因盡未知智斷？",
        "translation": "How are the causes of the cessation of cognition of the extinction of faculties and cognition of the extinction of cognition of the unknown and the causes of the extinction of cognition of the unknown eliminated?",
        "source": "T26n1543_024:0885c09_0"
    },
    {
        "source_sentence": "答曰：諸根盡未知智斷緣盡未知智斷。",
        "translation": "Answer: When the faculties are exhausted, cognition of the unknown is stopped, and when the conditions are exhausted, cognition of the unknown is stopped.",
        "source": "T26n1543_024:0885c09_1"
    },
    {
        "source_sentence": "云何根緣盡未知智斷因苦法智斷？",
        "translation": "How are the cognitions of suffering and dharmas as causes for the cessation of knowledge of the exhaustion of faculties and cognition of the unknown?",
        "source": "T26n1543_024:0885c10_2"
    },
    {
        "source_sentence": "答曰：諸根苦法智斷緣盡未知智斷，復次諸根習法智斷因苦法智斷緣盡未知智斷。",
        "translation": "Answer: The cognition of the knowledge of suffering as a cause and the cognition of suffering as a condition that ends are not known to be stopped, and furthermore, the cognition of accumulation as a cause and the cognition of suffering as a condition that ends",
        "source": "T26n1543_024:0885c11_3"
    },
    {
        "source_sentence": "云何根緣盡未知智斷因苦未知智斷？",
        "translation": "How are the faculties and conditions exhausted that are not known as cessation of cognition and the causes of suffering that are not known as knowledge?",
        "source": "T26n1543_024:0885c13_4"
    },
    {
        "source_sentence": "答曰：諸根苦未知智斷緣盡未知智斷，復次諸根習未知智斷因苦未知智斷緣盡未知智斷，",
        "translation": "Answer: The faculties are to be abandoned through the cognition of suffering that is not known as unknown, and they are to be abandoned through the cognition of the extinction of conditioned states. Furthermore, the faculties are to",
        "source": "T26n1543_024:0885c14_5"
    },
    {
        "source_sentence": "復次諸根盡未知智斷因苦未知智斷緣盡未知智斷。",
        "translation": "Furthermore, when the faculties are ended and unknown cognition is stopped, the causes of suffering that are painful and unknown cognition are stopped, and the conditions are ended and unknown cognition is stopped.",
        "source": "T26n1543_024:0885c16_6"
    },
    {
        "source_sentence": "云何根緣盡未知智斷因習法智斷？",
        "translation": "How are the faculties and conditions exhausted that are not known to be eliminated by cognition of causes and the accumulation of knowledge of phenomena eliminated?",
        "source": "T26n1543_024:0885c17_7"
    },
    {
        "source_sentence": "答曰：諸根習法智斷緣盡未知智斷，復次諸根苦法智斷因習法智斷緣盡未知智斷。",
        "translation": "Answer: The cognition of the accumulation of dharmas by the faculties is stopped because the cognition of suffering as a cause and the cognition of the accumulation of dharmas are stopped because the cognition of suffering as a condition is stopped, and the",
        "source": "T26n1543_024:0885c18_8"
    },
    {
        "source_sentence": "云何根緣盡未知智斷因習未知智斷？",
        "translation": "How are the faculties and conditions exhausted that are not known as cessation of cognition and the causes cultivated by unknown cognition not known as cessation?",
        "source": "T26n1543_024:0885c20_9"
    },
    {
        "source_sentence": "答曰：諸根習未知智斷緣盡未知智斷，復次諸根苦未知智斷因習未知智斷緣盡未知智斷，",
        "translation": "Answer: The faculties are conditioned by the knowledge of the unknown to be abandoned through the cessation of cognition of the roots, and the cognition of the end of conditions is not known to be abandoned. Furthermore, the fac",
        "source": "T26n1543_024:0885c21_10"
    },
    {
        "source_sentence": "復次諸根盡未知智斷因習未知智斷緣盡未知智斷。",
        "translation": "Furthermore, when the faculties are exhausted and unknown cognition is stopped, the causes of accumulating unknown cognition are stopped, and the conditions are ended and unknown cognition is stopped.",
        "source": "T26n1543_024:0885c23_11"
    },
    {
        "source_sentence": "云何根緣盡未知智斷因思惟斷？",
        "translation": "What are the causes and contemplations for the cessation of the cognition of the exhaustion of faculties and conditions that are stopped by not knowing?",
        "source": "T26n1543_024:0885c24_12"
    },
    {
        "source_sentence": "答曰：諸根思惟斷緣盡未知智斷。",
        "translation": "Answer: The faculties contemplate the cessation of cognition that doesn't know the end of cognition.",
        "source": "T26n1543_024:0885c25_13"
    },
    {
        "source_sentence": "云何根緣盡未知智斷因無斷？",
        "translation": "What are the causes and conditions for the cessation of faculties that are not known to be eliminated by the knowledge of the extinction of faculties?",
        "source": "T26n1543_024:0885c26_14"
    },
    {
        "source_sentence": "答曰：諸根無斷緣盡未知智斷(八共八盡智竟)。",
        "translation": "Answer: The cognition of the non-cessation of the faculties and the cognition of the extinction of conditioned cognition is not known to be stopped (after the completion of the eight shared eight kinds of cognition of extinction).",
        "source": "T26n1543_024:0885c27_0"
    },
    {
        "source_sentence": "因道法智斷緣道法智斷、因道未知智斷緣道未知智斷亦如上(八共八竟)。",
        "translation": "The cognition of the path as cause and the cognition of the path as condition are eliminated, and the cognition of the path as cause and the cognition of the path as unknown elimination as condition are also eliminated as above (after the eight shared",
        "source": "T26n1543_024:0885c27_1"
    },
    {
        "source_sentence": "諸根因苦法智斷，彼根緣見苦斷耶？",
        "translation": "The faculties are stopped because of the cognition of suffering as a cause, and those faculties are stopped by seeing suffering as a condition?",
        "source": "T26n1543_024:0885c29_2"
    },
    {
        "source_sentence": "答曰：或根因苦法智斷，緣見苦斷、緣見習斷、緣見盡斷、緣見道斷、緣思惟斷、緣無斷、無緣。",
        "translation": "Answer: Perhaps the cognition of suffering as a root cause for suffering is stopped by seeing suffering as a condition, stopping it as a condition for seeing accumulation, stopping it as a condition for seeing extinction, stopping it as a condition for seeing the path,",
        "source": "T26n1543_024:0886a01_3"
    },
    {
        "source_sentence": "云何根因苦法智斷緣見苦斷？",
        "translation": "How are the faculties stopped by seeing suffering as a condition for the cessation of cognition of suffering as a cause of suffering?",
        "source": "T26n1543_024:0886a03_4"
    },
    {
        "source_sentence": "答曰：諸根苦法智斷緣見苦斷，復次諸根習法智斷因苦法智斷緣見苦斷。",
        "translation": "Answer: The faculties are stopped by the cognition of suffering as a cause and stop by seeing suffering as a condition, and furthermore, the faculties are stopped by the cognition of accumulation as a cause and stopped by the cognition of suffering as a condition",
        "source": "T26n1543_024:0886a03_5"
    },
    {
        "source_sentence": "云何根因苦法智斷緣見習斷？",
        "translation": "What are the faculties that are stopped by seeing and accumulating because of the cognition of suffering as dharmas?",
        "source": "T26n1543_024:0886a05_6"
    },
    {
        "source_sentence": "答曰：諸根苦法智斷緣見習斷，復次諸根習法智斷因苦法智斷緣見習斷。",
        "translation": "Answer: The faculties are stopped by the cognition of suffering as a condition for seeing and accumulating cessation, and furthermore, the faculties are stopped by the cognition of suffering as a condition for seeing and accumulating cessation.",
        "source": "T26n1543_024:0886a06_7"
    },
    {
        "source_sentence": "云何根因苦法智斷緣見盡斷？",
        "translation": "What are the faculties that are stopped by seeing the cessation of cognition of suffering as a cause and by seeing the cessation of dharmas?",
        "source": "T26n1543_024:0886a07_8"
    },
    {
        "source_sentence": "答曰：諸根苦法智斷緣見盡斷，復次諸根習法智斷因苦法智斷緣見盡斷，",
        "translation": "Answer: The faculties are to be abandoned through knowledge of the law in relation to frustration, and they are to be abandoned through the vision of cessation as supporting object. Furthermore, the faculties are to be abandoned through knowledge of the",
        "source": "T26n1543_024:0886a08_9"
    },
    {
        "source_sentence": "復次諸根盡法智斷因苦法智斷緣見盡斷。",
        "translation": "Furthermore, the cognition of the exhaustion of faculties as a cause and the cognition of suffering as a condition are stopped by the cognition of the exhaustion of views.",
        "source": "T26n1543_024:0886a10_10"
    },
    {
        "source_sentence": "云何根因苦法智斷緣見道斷？",
        "translation": "What are the faculties that are stopped by the cognition of suffering as a cause for the path of seeing?",
        "source": "T26n1543_024:0886a11_11"
    },
    {
        "source_sentence": "答曰：諸根苦法智斷緣見道斷，復次諸根習法智斷因苦法智斷緣見道斷，",
        "translation": "Answer: The faculties are to be abandoned through the knowledge of the law in relation to frustration, and they are to be abandoned through the path of vision as supporting object. Furthermore, the faculties are to be abandoned through the knowledge of the",
        "source": "T26n1543_024:0886a12_0"
    },
    {
        "source_sentence": "復次諸根道法智斷因苦法智斷緣見道斷。",
        "translation": "Furthermore, the knowledge of the faculties, paths, and dharmas is stopped because the knowledge of suffering and the knowledge of the path are stopped, and the knowledge of the path of seeing is stopped because it's stopped.",
        "source": "T26n1543_024:0886a13_1"
    },
    {
        "source_sentence": "云何根因苦法智斷緣思惟斷？",
        "translation": "What are the faculties that are stopped by contemplation based on the knowledge of suffering as a condition for the cessation of cognition of dharmas?",
        "source": "T26n1543_024:0886a14_2"
    },
    {
        "source_sentence": "答曰：諸根苦法智斷緣思惟斷，復次諸根習法智斷因苦法智斷緣思惟斷，",
        "translation": "Answer: The faculties are to be abandoned through the knowledge of the law in relation to frustration, and they are to be abandoned through reasoning and through reflection. Furthermore, the faculties are to be abandoned through the knowledge of the law in",
        "source": "T26n1543_024:0886a15_3"
    },
    {
        "source_sentence": "復次諸根思惟斷因苦法智斷緣思惟斷。",
        "translation": "Furthermore, the faculties are contemplated as being stopped because of the cessation of knowledge of painful dharmas and the contemplation of stopping conditioned cognition.",
        "source": "T26n1543_024:0886a17_4"
    },
    {
        "source_sentence": "云何根因苦法智斷緣無斷？",
        "translation": "How are the faculties stopped by the cognition of suffering as a cause and not stopped by the cognition of dharmas?",
        "source": "T26n1543_024:0886a18_5"
    },
    {
        "source_sentence": "答曰：諸根盡法智道法智斷因苦法智斷緣無斷。",
        "translation": "Answer: When the faculties are exhausted by knowledge of the Dharma and knowledge of the path, knowledge of the Dharma stops causes that are painful, knowledge of the Dharma stops conditions that are stopped, and they aren't stopped.",
        "source": "T26n1543_024:0886a18_6"
    },
    {
        "source_sentence": "云何根因苦法智斷無緣？",
        "translation": "How are the faculties that are the cause of suffering and the cognition of dharmas to be stopped without conditions?",
        "source": "T26n1543_024:0886a19_7"
    },
    {
        "source_sentence": "答曰：諸根無緣因苦法智斷。",
        "translation": "Answer: The faculties are stopped by the cognition of painful dharmas as unconditional causes.",
        "source": "T26n1543_024:0886a20_8"
    },
    {
        "source_sentence": "設諸根緣苦法智斷，彼根因見苦斷耶？",
        "translation": "Suppose the faculties are stopped by cognition of suffering as a condition for knowledge of dharmas, and those faculties are stopped by seeing suffering as a cause?",
        "source": "T26n1543_024:0886a21_9"
    },
    {
        "source_sentence": "答曰：或根緣苦法智斷，因見苦斷、因見習斷、因思惟斷、因無斷。",
        "translation": "Answer: Perhaps the cognition of suffering as a root condition is stopped because they see suffering, stop because they see accumulation, stop because they contemplate it, and stop because they lack it.",
        "source": "T26n1543_024:0886a21_10"
    },
    {
        "source_sentence": "云何根緣苦法智斷因見苦斷？",
        "translation": "How are the faculties conditioned by knowledge of suffering and dharmas to be stopped because they see suffering as stopped?",
        "source": "T26n1543_024:0886a23_11"
    },
    {
        "source_sentence": "答曰：諸根見苦斷緣苦法智斷，復次諸根見習斷因見苦斷緣苦法智斷。",
        "translation": "Answer: The faculties see the cognition of suffering as a condition for the cessation of suffering, and furthermore, the faculties see that accumulation is stopped because they see the cognition of suffering as a condition for the cessation of suffering as a",
        "source": "T26n1543_024:0886a24_12"
    },
    {
        "source_sentence": "云何根緣苦法智斷因見習斷？",
        "translation": "How are the faculties conditioned by knowledge of suffering as a cause for seeing and accumulating cessation stopped by cognition of dharmas?",
        "source": "T26n1543_024:0886a25_13"
    },
    {
        "source_sentence": "答曰：諸根見習斷緣苦法智斷，復次諸根見苦斷因見習斷緣苦法智斷。",
        "translation": "Answer: The faculties see the cessation of accumulation as a condition for the cognition of painful dharmas that are stopped, and furthermore, the faculties see the cessation of suffering as a cause for seeing accumulation as a condition for",
        "source": "T26n1543_024:0886a26_14"
    },
    {
        "source_sentence": "云何諸根緣苦法智斷因思惟斷？",
        "translation": "How are the faculties conditioned by knowledge of suffering and dharmas to be stopped by contemplation as causes of stopping?",
        "source": "T26n1543_024:0886a28_15"
    },
    {
        "source_sentence": "答曰：諸根思惟斷緣苦法智斷。",
        "translation": "Answer: The faculties contemplate the cessation of cognition of suffering as a condition for the cessation of cognition of dharmas.",
        "source": "T26n1543_024:0886a28_16"
    },
    {
        "source_sentence": "云何根緣苦法智斷因無斷？",
        "translation": "How are the faculties conditioned by knowledge of suffering and dharmas to be eliminated as causes that are not eliminated?",
        "source": "T26n1543_024:0886a29_17"
    },
    {
        "source_sentence": "答曰：諸根無斷緣苦法智斷。",
        "translation": "Answer: The faculties are not stopped because the cognition of suffering as a condition is stopped by the cognition of qualities.",
        "source": "T26n1543_024:0886b01_18"
    },
    {
        "source_sentence": "諸根因苦未知智斷，彼根緣見苦斷耶？",
        "translation": "What are the faculties that are stopped by not knowing suffering as a cause for suffering and those that are stopped by seeing suffering as a condition for those faculties?",
        "source": "T26n1543_024:0886b01_19"
    },
    {
        "source_sentence": "答曰：或根因苦未知智斷，緣見苦斷、緣見習斷、緣見盡斷、緣見道斷、緣思惟斷、緣無斷。",
        "translation": "Answer: Some faculties are stopped by the cognition of suffering that's not yet known as a cause for suffering, which is stopped by seeing suffering in terms of conditions, stopped by seeing accumulation in terms of conditions, stopped by seeing cessation in terms of conditions",
        "source": "T26n1543_024:0886b02_20"
    },
    {
        "source_sentence": "云何根因苦未知智斷緣見苦斷？",
        "translation": "How are the faculties stopped by seeing suffering as a condition for the cessation of unknown cognition because of suffering?",
        "source": "T26n1543_024:0886b04_21"
    },
    {
        "source_sentence": "答曰：諸根苦未知智斷緣見苦斷，復次諸根習未知智斷因苦未知智斷緣見苦斷。",
        "translation": "Answer: The faculties are stopped by seeing suffering as a condition for the cessation of cognition of suffering that's not known to be painful, and furthermore, the faculties are stopped by seeing suffering as a condition for the cessation of accumula",
        "source": "T26n1543_024:0886b05_22"
    },
    {
        "source_sentence": "云何根因苦未知智斷緣見習斷？",
        "translation": "How are the faculties stopped by seeing and accumulating because of the cognition of suffering that is unknown?",
        "source": "T26n1543_024:0886b07_23"
    },
    {
        "source_sentence": "答曰：諸根苦未知智斷緣見習斷，復次諸根習未知智斷因苦未知智斷緣見習斷。",
        "translation": "Answer: The faculties are stopped by seeing accumulation when the cognition of suffering is unknown to the faculties, and furthermore, the faculties are stopped by seeing accumulation when the cognition of accumulation is unknown to the facul",
        "source": "T26n1543_024:0886b08_24"
    },
    {
        "source_sentence": "云何根因苦未知智斷緣見盡斷？",
        "translation": "What are the faculties that are stopped by not knowing suffering as a cause and seeing as a condition for the cessation of suffering?",
        "source": "T26n1543_024:0886b10_0"
    },
    {
        "source_sentence": "答曰：諸根苦未知智斷緣見盡斷，復次諸根習未知智斷因苦未知智斷緣見盡斷，",
        "translation": "Answer: The faculties are to be abandoned through the cognition of suffering that is not yet known, and they are to be abandoned through the vision of cessation as supporting object. Furthermore, the faculties are to be abandoned through the",
        "source": "T26n1543_024:0886b10_1"
    },
    {
        "source_sentence": "復次諸根盡未知智斷因苦未知智斷緣見盡斷。",
        "translation": "Furthermore, when the faculties are exhausted, they're not known as cognition that stops causes suffering and not known as cognition that stops cognition, and when views are exhausted, they're stopped.",
        "source": "T26n1543_024:0886b12_2"
    },
    {
        "source_sentence": "云何根因苦未知智斷緣見道斷？",
        "translation": "What are the faculties that are stopped by the cognition of suffering as a condition for the cessation of the path of seeing?",
        "source": "T26n1543_024:0886b13_3"
    },
    {
        "source_sentence": "答曰：諸根苦未知智斷緣見道斷，復次諸根習未知智斷因苦未知智斷緣見道斷，",
        "translation": "Answer: The faculties are to be abandoned through the path of vision as supporting condition for the cessation of unscientific knowledge in relation to frustration. Furthermore, the faculties are to be abandoned through the accumulation of unknown-",
        "source": "T26n1543_024:0886b14_4"
    },
    {
        "source_sentence": "復次諸根道未知智斷因苦未知智斷緣見道斷。",
        "translation": "Furthermore, the paths of the faculties are stopped by unknown cognition because suffering is stopped by unknown cognition and stopped by seeing the path.",
        "source": "T26n1543_024:0886b16_5"
    },
    {
        "source_sentence": "云何根因苦未知智斷緣思惟斷？",
        "translation": "What are the faculties that are stopped by contemplation based on the cognition of suffering as unknown causes and stopping?",
        "source": "T26n1543_024:0886b17_6"
    },
    {
        "source_sentence": "答曰：諸根苦未知智斷緣思惟斷，復次諸根習未知智斷因苦未知智斷緣思惟斷，",
        "translation": "Answer: The faculties are abandoned by contemplation when the cognition of suffering as unknown to beings is abandoned, and furthermore, the faculties are abandoned by contemplation when the cognition of accumulation as unknown to beings",
        "source": "T26n1543_024:0886b18_7"
    },
    {
        "source_sentence": "復次諸根思惟斷因苦未知智斷緣思惟斷。",
        "translation": "Furthermore, the faculties are contemplated as being stopped because of the cessation of suffering that's not known to be stopped by cognition and the conditions are contemplated as being stopped.",
        "source": "T26n1543_024:0886b20_8"
    },
    {
        "source_sentence": "云何根因苦未知智斷緣無斷？",
        "translation": "How are the faculties that are not known to be stopped by knowledge of suffering as a cause and not stopped by cognition as a condition?",
        "source": "T26n1543_024:0886b21_9"
    },
    {
        "source_sentence": "答曰：諸根盡未知智道未知智斷因苦未知智斷緣無斷。",
        "translation": "Answer: When the faculties are exhausted, they don't know the path of cognition and don't know the cessation of cognition as a cause or condition for the cessation of suffering that doesn't know the cognition.",
        "source": "T26n1543_024:0886b21_10"
    },
    {
        "source_sentence": "設諸根緣苦未知智斷，彼根因見苦斷耶？",
        "translation": "Suppose the faculties are stopped by cognition of suffering as a condition for not knowing, and those faculties are stopped by seeing suffering as a cause?",
        "source": "T26n1543_024:0886b23_11"
    },
    {
        "source_sentence": "答曰：或根緣苦未知智斷，因見苦斷、因見習斷、因思惟斷、因無斷。",
        "translation": "Answer: Perhaps the cognition of suffering as a root condition is stopped because they see suffering, stop it because they see accumulation, stop it because they contemplate it, and stop it because they don't.",
        "source": "T26n1543_024:0886b24_12"
    },
    {
        "source_sentence": "云何根緣苦未知智斷因見苦斷？",
        "translation": "How are the faculties conditioned by suffering not known as cognition and the causes of seeing suffering to be stopped?",
        "source": "T26n1543_024:0886b25_13"
    },
    {
        "source_sentence": "答曰：諸根見苦斷緣苦未知智斷，復次諸根見習斷因見苦斷緣苦未知智斷。",
        "translation": "Answer: The faculties see the cessation of suffering as a condition for the cessation of suffering that's not known by cognition, and furthermore, the faculties see the cessation of accumulation because they see the cessation of suffering",
        "source": "T26n1543_024:0886b26_14"
    },
    {
        "source_sentence": "云何根緣苦未知智斷因見習斷？",
        "translation": "How are the faculties conditioned by suffering not known as cognition and the causes of seeing and accumulating cessation stopped?",
        "source": "T26n1543_024:0886b28_15"
    },
    {
        "source_sentence": "答曰：諸根見習斷緣苦未知智斷，復次諸根見苦斷因見習斷緣苦未知智斷。",
        "translation": "Answer: The faculties see the cessation of accumulation as a condition for suffering that's not known to be stopped by cognition, and furthermore, the faculties see the cessation of suffering as a cause for seeing accumulation as a condition for",
        "source": "T26n1543_024:0886b28_16"
    },
    {
        "source_sentence": "云何根緣苦未知智斷因思惟斷？",
        "translation": "How are the faculties conditioned by suffering not known as cognition and the causes of cessation stopped by contemplation stopped?",
        "source": "T26n1543_024:0886c01_17"
    },
    {
        "source_sentence": "答曰：諸根思惟斷緣苦未知智斷。",
        "translation": "Answer: The faculties contemplate the cessation of cognition that doesn't know suffering as a condition for the cessation of sensation.",
        "source": "T26n1543_024:0886c02_18"
    },
    {
        "source_sentence": "云何根緣苦未知智斷因無斷？",
        "translation": "How are the faculties conditioned by suffering unknown cognition and the causes of cessation not eliminated?",
        "source": "T26n1543_024:0886c03_19"
    },
    {
        "source_sentence": "答曰：諸根無斷緣苦未知智斷(八四苦智竟)。",
        "translation": "Answer: The faculties are not cut because the cognition of suffering is unknown and the cognition of suffering is cut (after the completion of the eighty-four kinds of cognition of suffering).",
        "source": "T26n1543_024:0886c03_20"
    },
    {
        "source_sentence": "因習法智斷緣見習斷、因習未知智斷緣見習斷亦如上。",
        "translation": "The cessation of the cognition of dharmas as causes and the cessation of the cognition of seeing as causes and the cessation of the cognition of not knowing as causes and the cessation of the cognition of seeing as causes are likewise",
        "source": "T26n1543_024:0886c04_21"
    },
    {
        "source_sentence": "諸根因盡法智斷，彼根緣見盡斷耶？",
        "translation": "When the causes of the faculties are ended by knowledge of dharmas, will those faculties be ended by seeing?",
        "source": "T26n1543_024:0886c06_0"
    },
    {
        "source_sentence": "答曰：或根因盡法智斷，緣見盡斷、緣無斷、無緣。",
        "translation": "Answer: Perhaps the cognition of dharmas when the causes of faculties are ended and the views of cognition of conditions are ended, and the cognition of conditions is not stopped and the cognition of conditions is not stopped.",
        "source": "T26n1543_024:0886c06_1"
    },
    {
        "source_sentence": "云何根因盡法智斷緣見盡斷？",
        "translation": "What is the cessation of the knowledge of the exhaustion of faculties as causes and the cessation of views as conditions for the cessation of dharmas?",
        "source": "T26n1543_024:0886c07_2"
    },
    {
        "source_sentence": "答曰：諸根盡法智斷緣見盡斷。",
        "translation": "Answer: When the faculties are exhausted, cognition of dharmas is stopped, and when the conditional views are stopped, they're stopped.",
        "source": "T26n1543_024:0886c08_3"
    },
    {
        "source_sentence": "云何根因盡法智斷緣無斷？",
        "translation": "What are the causes and conditions for the cessation of knowledge of the exhaustion of faculties that are not eliminated?",
        "source": "T26n1543_024:0886c09_4"
    },
    {
        "source_sentence": "答曰：諸根盡法智斷緣無斷。",
        "translation": "Answer: The cognition of the exhaustion of faculties as dharmas stops conditioned by the cessation of cognition, and it doesn't stop.",
        "source": "T26n1543_024:0886c09_5"
    },
    {
        "source_sentence": "云何根因盡法智斷無緣？",
        "translation": "What is the cognition of the exhaustion of faculties as causes that cuts off dharmas without conditions?",
        "source": "T26n1543_024:0886c10_6"
    },
    {
        "source_sentence": "答曰：諸根無緣因盡法智斷。",
        "translation": "Answer: The faculties are stopped by the cognition of the exhaustion of dharmas without conditions as causes.",
        "source": "T26n1543_024:0886c11_7"
    },
    {
        "source_sentence": "設諸根緣盡法智斷，彼根因見盡斷耶？",
        "translation": "Suppose the cognition of the exhaustion of dharmas as causes for the faculties is stopped, and that faculty is stopped by seeing the exhaustion of causes?",
        "source": "T26n1543_024:0886c11_8"
    },
    {
        "source_sentence": "答曰：或根緣盡法智斷，因見盡斷、因見苦斷、因見習斷、因思惟斷、因無斷。",
        "translation": "Answer: Perhaps the knowledge of the exhaustion of faculties and cognition of dharmas is stopped because views are stopped, suffering is stopped because views are stopped, accumulation is stopped because views are stopped, contemplation is stopped because thoughts are stopped, and nothing is stopped",
        "source": "T26n1543_024:0886c12_9"
    },
    {
        "source_sentence": "云何根緣盡法智斷因見盡斷？",
        "translation": "What is the cessation of knowledge of the exhaustion of faculties and cognition of phenomena as causes for the exhaustion of views?",
        "source": "T26n1543_024:0886c14_10"
    },
    {
        "source_sentence": "答曰：諸根見盡斷緣盡法智斷。",
        "translation": "Answer: The view that the faculties are ended and the cognition of the end of conditioned dharmas is stopped.",
        "source": "T26n1543_024:0886c15_11"
    },
    {
        "source_sentence": "云何根緣盡法智斷因見苦斷？",
        "translation": "What is the cessation of suffering by seeing as the cause for the cessation of knowledge of the exhaustion of faculties?",
        "source": "T26n1543_024:0886c15_12"
    },
    {
        "source_sentence": "答曰：諸根見苦斷緣盡法智斷，復次諸根見習斷因見苦斷緣盡法智斷，",
        "translation": "Answer: The faculties see the cessation of suffering as a condition for the cessation of knowledge of the Dharma, and furthermore, the faculties see the cessation of accumulation as a cause for seeing the cessation of suffering as a condition",
        "source": "T26n1543_024:0886c16_13"
    },
    {
        "source_sentence": "復次諸根見苦斷緣盡法智斷。",
        "translation": "Furthermore, the faculties see the cessation of suffering as a condition for the cessation of cognition of the exhaustion of dharmas.",
        "source": "T26n1543_024:0886c18_14"
    },
    {
        "source_sentence": "云何根緣盡法智斷因見習斷？",
        "translation": "What are the causes of seeing and accumulating cessation of the knowledge of the exhaustion of faculties as cognition of phenomena?",
        "source": "T26n1543_024:0886c18_15"
    },
    {
        "source_sentence": "答曰：諸根見習斷緣盡法智斷，復次諸根見苦斷因見習斷緣盡法智斷，",
        "translation": "Answer: The faculties see the cessation of accumulation as a condition for the cessation of knowledge of dharmas, and furthermore, the faculties see the cessation of suffering as a cause for the cessation of knowledge of dhar",
        "source": "T26n1543_024:0886c19_16"
    },
    {
        "source_sentence": "復次諸根見盡斷因見習斷緣盡法智斷。",
        "translation": "Furthermore, the views of the faculties are stopped by seeing the end of causes, and the views of accumulation are stopped by seeing the end of cognition of phenomena.",
        "source": "T26n1543_024:0886c21_17"
    },
    {
        "source_sentence": "云何根緣盡法智斷因思惟斷？",
        "translation": "What are the causes and contemplations for the cessation of knowledge of the exhaustion of faculties as cognition of phenomena?",
        "source": "T26n1543_024:0886c22_18"
    },
    {
        "source_sentence": "答曰：諸根思惟斷緣盡法智斷。",
        "translation": "Answer: The cognition of the end of dharmas is stopped by contemplating the cessation of the faculties as a condition for the cessation of cognition.",
        "source": "T26n1543_024:0886c22_19"
    },
    {
        "source_sentence": "云何根緣盡法智斷因無斷？",
        "translation": "How are the causes of knowledge of the exhaustion of faculties and cognition of phenomena stopped and not stopped?",
        "source": "T26n1543_024:0886c23_20"
    },
    {
        "source_sentence": "答曰：諸根無斷緣盡法智斷。",
        "translation": "Answer: The faculties are not cut off, and the cognition of the end of conditioned dharmas is cut off.",
        "source": "T26n1543_024:0886c24_21"
    },
    {
        "source_sentence": "諸根因盡未知智斷，彼根緣見盡斷耶？",
        "translation": "When the causes of the faculties are exhausted, it's not known that cognition is stopped, and when those faculties are stopped by seeing the end of conditional views?",
        "source": "T26n1543_024:0886c24_22"
    },
    {
        "source_sentence": "答曰：或根因盡未知智斷，緣見盡斷、緣無斷。",
        "translation": "Answer: Perhaps the causes of faculties are ended without knowing, and cognition is stopped by seeing what's ended and stopped by what's not stopped by conditions.",
        "source": "T26n1543_024:0886c25_23"
    },
    {
        "source_sentence": "云何根因盡未知智斷緣見盡斷？",
        "translation": "What are the causes of the cessation of faculties that are ended by not knowing and the causes of seeing that are ended by stopping cognition?",
        "source": "T26n1543_024:0886c26_24"
    },
    {
        "source_sentence": "答曰：諸根因盡未知智斷緣見盡斷。",
        "translation": "Answer: When the causes of the faculties are ended, they're not known to be stopped by cognition and stopped by seeing.",
        "source": "T26n1543_024:0886c27_25"
    },
    {
        "source_sentence": "云何根因盡未知智斷緣無斷？",
        "translation": "How are the causes of faculties exhausted and not known to be eliminated by cognition and the conditions not eliminated?",
        "source": "T26n1543_024:0886c28_26"
    },
    {
        "source_sentence": "答曰：諸根盡未知智斷緣無斷。",
        "translation": "Answer: When the faculties are exhausted, they aren't known to be stopped by cognition and have no stopping as a condition.",
        "source": "T26n1543_024:0886c29_27"
    },
    {
        "source_sentence": "設諸根緣盡未知智斷，彼根因見盡斷耶？",
        "translation": "Suppose the cognition of the exhaustion of faculties and conditions is stopped by not knowing, and that faculty is stopped because of the exhaustion of views?",
        "source": "T26n1543_024:0886c29_28"
    },
    {
        "source_sentence": "答曰：或根緣盡未知智斷，因見盡斷、因見苦斷、因見習斷、因思惟斷、因無斷。",
        "translation": "Answer: Perhaps the cognition of the exhaustion of faculties and conditions that are not yet known is stopped by seeing what's ended, which is stopped by seeing what's ended, stopped by seeing what's painful, stopped by seeing what's accumulated",
        "source": "T26n1543_024:0887a01_29"
    },
    {
        "source_sentence": "云何根緣盡未知智斷因見盡斷？",
        "translation": "What are the causes and conditions for the cessation of cognition of the exhaustion of faculties that are not known to be eliminated by seeing?",
        "source": "T26n1543_024:0887a03_30"
    },
    {
        "source_sentence": "答曰：諸根見盡斷緣盡未知智斷。",
        "translation": "Answer: When the views of the faculties are ended, the cognition of the end of cognition is not known to be ended.",
        "source": "T26n1543_024:0887a04_31"
    },
    {
        "source_sentence": "云何根緣盡未知智斷因見苦斷？",
        "translation": "What are the causes of seeing and suffering that are stopped by the knowledge of the exhaustion of faculties and cognition?",
        "source": "T26n1543_024:0887a04_32"
    },
    {
        "source_sentence": "答曰：諸根見苦斷緣盡未知智斷，復次諸根見習斷因見苦斷緣盡未知智斷，",
        "translation": "Answer: The faculties see that the cognition of suffering as cessation is not known as cessation, and furthermore, the faculties see that accumulation is stopped because they see the cognition of suffering as cessation as cessation.",
        "source": "T26n1543_024:0887a05_33"
    },
    {
        "source_sentence": "復次諸根見盡斷因見苦斷緣盡未知智斷。",
        "translation": "Furthermore, the faculties are stopped by seeing the end of causes and seeing the cessation of suffering as cognition that doesn't know the end of conditions.",
        "source": "T26n1543_024:0887a07_34"
    },
    {
        "source_sentence": "云何根緣盡未知智斷因見習斷？",
        "translation": "What are the causes of seeing and accumulating cessation that are stopped by the knowledge of the exhaustion of faculties and cognition?",
        "source": "T26n1543_024:0887a08_35"
    },
    {
        "source_sentence": "答曰：諸根見習斷緣盡未知智斷，復次諸根見苦斷因見習斷緣盡未知智斷，",
        "translation": "Answer: All faculties are to be abandoned through the vision of cessation by means of accumulation. Furthermore, all faculties are to be abandoned through the vision of frustration and through the vision of cessation by means of accumulation.",
        "source": "T26n1543_024:0887a09_36"
    },
    {
        "source_sentence": "復次諸根見盡斷因見習斷緣盡未知智斷。",
        "translation": "Furthermore, when the views of the faculties are ended, the causes are ended by seeing and accumulating, and the conditions are ended by not knowing that cognition is ended.",
        "source": "T26n1543_024:0887a11_0"
    },
    {
        "source_sentence": "云何根緣盡未知智斷因思惟斷？",
        "translation": "What are the causes and contemplations for the cessation of the cognition of the exhaustion of faculties and conditions that are stopped by not knowing?",
        "source": "T26n1543_024:0887a12_0"
    },
    {
        "source_sentence": "答曰：諸根思惟斷緣盡未知智斷。",
        "translation": "Answer: The faculties contemplate the cessation of cognition that doesn't know the end of cognition.",
        "source": "T26n1543_024:0887a12_1"
    },
    {
        "source_sentence": "云何根緣盡未知智斷因無斷？",
        "translation": "What are the causes and conditions for the cessation of faculties that are not known to be eliminated by the knowledge of the extinction of faculties?",
        "source": "T26n1543_024:0887a13_2"
    },
    {
        "source_sentence": "答曰：諸根無斷緣盡未知智斷。",
        "translation": "Answer: The faculties are not cut off, and the cognition of the exhaustion of cognition doesn't know that they're cut off.",
        "source": "T26n1543_024:0887a14_3"
    },
    {
        "source_sentence": "因道法智斷緣見道斷、因道未知智斷緣見道斷亦如上。",
        "translation": "The path of seeing the path as a condition for the cessation of cognition of dharmas and the path of seeing the path as a condition for the cessation of cognition of what's unknown because of the path are likewise as above.",
        "source": "T26n1543_024:0887a15_0"
    },
    {
        "source_sentence": "阿毘曇根犍度緣跋渠第三十三竟。",
        "translation": "At the end of the thirty-third section of the abhidharma's faculty, he explains the Bhagavān.",
        "source": "T26n1543_024:0887a17_0"
    },
    {
        "source_sentence": "根犍度第六竟。",
        "translation": "After the sixth completion of the faculty gandharva, he said.",
        "source": "T26n1543_024:0887a18_0"
    },
    {
        "source_sentence": "斯經序曰：其人忘因緣一品，故闕文焉。",
        "translation": "The preface to this sūtra says, That person forgets the one chapter on causes and conditions, so there's a missing text.",
        "source": "T26n1543_024:0887a19_0"
    },
    {
        "source_sentence": "近有罽賓沙門曇摩卑諳之，來經密川，僧伽諦婆譯出此品，八犍度文具也。",
        "translation": "Recently the Kāśmī monk Dharmapāda, who was well versed in it, came to this mysterious river and translated this chapter into Chinese by Saṃghâṭīpa, which contains all the texts of the eight skandhas.",
        "source": "T26n1543_024:0887a19_1"
    },
    {
        "source_sentence": "而卑云：八犍度是體耳，別有六足，可百萬言。",
        "translation": "It's just that the eight skandhas are the essence, and there are six feet separately, which can be a million words long.",
        "source": "T26n1543_024:0887a21_2"
    },
    {
        "source_sentence": "卑誦二足，今無譯，可出，慨恨良深。",
        "translation": "I humbly recite the scripture with two legs but do not translate it now. I may go forth without translating it. My regret is deep and profound.",
        "source": "T26n1543_024:0887a22_3"
    },
    {
        "source_sentence": "秦建元十五年正月十九日於揚州正官佛圖記。",
        "translation": "On the 19th day of the first month in the fifteenth year of the Qin dynasty, he wrote a memorial to the Buddha's image at the head office in Yangzhou.",
        "source": "T26n1543_024:0887a23_4"
    },
    {
        "source_sentence": "阿毘曇八犍度論卷第二十四",
        "translation": "Abhidharma-mahāvibhāga-śāstra, vol. 24",
        "source": "T26n1543_024:0887a25_0"
    }
]