[
    {
        "source_sentence": "彌勒菩薩所問經論卷第六",
        "translation": "Treatise on the Sutra of the Questions Asked by Maitreya, Volume 6",
        "source": "T26n1525_006:0256c26_0"
    },
    {
        "source_sentence": "後魏天竺三藏菩提流支譯",
        "translation": "Latter Wei translation of the Tripiṭaka of Tianzhus, translated by Bodhiruci",
        "source": "T26n1525_006:0256c28_0"
    },
    {
        "source_sentence": "◎成就捨心者。",
        "translation": "He who has accomplished the mind of equanimity.",
        "source": "T26n1525_006:0256c29_0"
    },
    {
        "source_sentence": "問曰：「以何義故？",
        "translation": "He asked, What's the reason?",
        "source": "T26n1525_006:0256c29_1"
    },
    {
        "source_sentence": "說持戒後次說成就捨心。」",
        "translation": "After he explains observing the precepts, he then explains the accomplishment of the mind of equanimity.",
        "source": "T26n1525_006:0256c29_2"
    },
    {
        "source_sentence": "答曰：「以見作他利益力故。",
        "translation": "He answered, It's because of the power of seeing what's for the benefit of others.",
        "source": "T26n1525_006:0257a01_3"
    },
    {
        "source_sentence": "此明何義？",
        "translation": "What does this explain?",
        "source": "T26n1525_006:0257a01_4"
    },
    {
        "source_sentence": "以菩薩持戒，依持戒故得生善道，雖成就捨心而無具足資生。",
        "translation": "Because bodhisattvas observe precepts, they rely on observing precepts to be born in a good path, and even though they've accomplished the mind of equanimity, they don't have the necessary necessities.",
        "source": "T26n1525_006:0257a02_5"
    },
    {
        "source_sentence": "若爾，不能作他利益，又復不能成就諸餘一切功德。",
        "translation": "If that's the case, they won't work for the benefit of others and won't attain all the other merits.",
        "source": "T26n1525_006:0257a03_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T26n1525_006:0257a04_7"
    },
    {
        "source_sentence": "為他利益攝取世間，而彼菩薩利益他時離捨財物，不能成就。",
        "translation": "They take in the world for the benefit of others, but when that bodhisattva benefits others, they part with their possessions and don't abandon them, and they can't accomplish it.",
        "source": "T26n1525_006:0257a04_8"
    },
    {
        "source_sentence": "以是義故，依他利益說持戒後，次說成就捨心。",
        "translation": "Because of this meaning, it's said that after observing precepts for the benefit of others, they'll next explain the accomplishment of equanimity.",
        "source": "T26n1525_006:0257a06_9"
    },
    {
        "source_sentence": "「又復有義，持戒、捨心迭共相依互為利益，以彼持戒能益捨心，捨心亦能利益持戒。",
        "translation": "Again, there is another interpretation that keeping the precepts and abstinence from mind are mutually reinforcing and mutually beneficial. Because they keep the precepts to benefit equanimity, the mind of equanimity also benefits observance of the precepts.",
        "source": "T26n1525_006:0257a07_10"
    },
    {
        "source_sentence": "以是義故，次持戒後說成就捨心。",
        "translation": "Because of this meaning, it's subsequently said to accomplish the mind of equanimity after observing precepts.",
        "source": "T26n1525_006:0257a09_11"
    },
    {
        "source_sentence": "「又離持戒故生惡道中，捨心不能受於果報，如相應果則不能得具足現前；",
        "translation": "“Furthermore, one is born in a bad rebirth because of distancing oneself from observing precepts. If one abandons mind and does not experience the fruit as its reward, just as [someone who] attains conjoined fruit they will not be able to fully manifest it.",
        "source": "T26n1525_006:0257a10_0"
    },
    {
        "source_sentence": "而持戒人生善道中，捨心則能受於果報，如相應果具足現前。",
        "translation": "When someone who observes precepts and is born in a good path, the mind of equanimity can then experience the fruit as its reward, just as the associated fruit is fully present.",
        "source": "T26n1525_006:0257a11_1"
    },
    {
        "source_sentence": "以是義故，持戒於捨能作利益，捨心亦能利益持戒，以持戒人生善道處，",
        "translation": "Because of this meaning, adherence to precepts can work for the benefit of equanimity, and the mind of equanimity can also work for the benefit of observing precepts. By observing precepts one is born in a good path:",
        "source": "T26n1525_006:0257a13_2"
    },
    {
        "source_sentence": "無資生故，則為貧窮苦惱所逼。",
        "translation": "Because they have no means of subsistence, they're oppressed by poverty and suffering.",
        "source": "T26n1525_006:0257a14_3"
    },
    {
        "source_sentence": "雖生善道即名惡道，成就捨心生善道處，於作自利及他利因，是故施能利益持戒。",
        "translation": "Even though it gives rise to a good path, which is called a bad path, it accomplishes the mind of equanimity that gives rise to a good path and creates causes for self-benefiting and other-benefiting; therefore, generosity can help maintain precepts.",
        "source": "T26n1525_006:0257a15_4"
    },
    {
        "source_sentence": "「又以修行次第義故。",
        "translation": "Again, it's because of the sequential meaning of cultivation.",
        "source": "T26n1525_006:0257a17_5"
    },
    {
        "source_sentence": "此明何義？",
        "translation": "What does this explain?",
        "source": "T26n1525_006:0257a17_6"
    },
    {
        "source_sentence": "菩薩為欲利益眾生修行義故，如是次第欲自取勘等口言功德先住持戒，",
        "translation": "Because they want to benefit sentient beings and cultivate the meaning of their practice, bodhisattvas thus sequentially want to grasp for themselves the verbal virtues of chanting and so forth. They first abide by observing precepts:",
        "source": "T26n1525_006:0257a18_7"
    },
    {
        "source_sentence": "次後依於不損害心起大慈悲心，為他作利益法施資生施，如彼眾生可化攝取。",
        "translation": "Subsequently, they rely on the mind that's not harmful to others and give great kindness and compassion, performing acts of charity for the benefit of others like those sentient beings who can be transformed into them.",
        "source": "T26n1525_006:0257a19_8"
    },
    {
        "source_sentence": "「又施等法能莊嚴戒故。",
        "translation": "It's because such things as generosity can adorn the precepts.",
        "source": "T26n1525_006:0257a21_9"
    },
    {
        "source_sentence": "此明何義？",
        "translation": "What does this explain?",
        "source": "T26n1525_006:0257a22_10"
    },
    {
        "source_sentence": "菩薩摩訶薩以施等法莊嚴持戒故，能成就種種勝果，如如來《娑伽羅龍王所問經》中說：『龍王！",
        "translation": "Because they adorn themselves with the precepts of giving and so forth, bodhisattvas and mahāsattvas can achieve various excellent results, as the Tathāgata explains in the Sutra of the Questions asked by Sāgara-nāga-rāja, 'Nāga-rāja!",
        "source": "T26n1525_006:0257a22_11"
    },
    {
        "source_sentence": "菩薩摩訶薩離殺生故，能起布施，則得成就大富資生不可破壞得長壽命，",
        "translation": "“Because great enlightening beings are free of killing, if they can produce generosity, they will attain great wealth, livelihood, and unbreakable longevity.",
        "source": "T26n1525_006:0257a24_12"
    },
    {
        "source_sentence": "行菩薩行過諸世間所惱惡事，如是等。",
        "translation": "Such are the bad things that practice bodhisattvas and transgress worldly afflictions, such as these.",
        "source": "T26n1525_006:0257a26_13"
    },
    {
        "source_sentence": "龍王！",
        "translation": "Great dragon king!",
        "source": "T26n1525_006:0257a27_0"
    },
    {
        "source_sentence": "十善業道亦復如是，布施莊嚴十善業道，成就大利益；",
        "translation": "So it is with the ten good paths of action: giving adorns the ten good paths of action and develops great benefit.",
        "source": "T26n1525_006:0257a27_1"
    },
    {
        "source_sentence": "持戒莊嚴十善業道，成就一切佛法願；",
        "translation": "Observing precepts adorned the ten good paths of action, they fulfilled the vows of all buddhas’ teachings.",
        "source": "T26n1525_006:0257a28_2"
    },
    {
        "source_sentence": "忍辱莊嚴十善業道，成就三十二相八十種好佛妙音聲；",
        "translation": "Adorned by forbearance and humility they develop ten paths of good action, producing the thirty-two marks and eighty kinds of beautiful sounds of buddhahood.",
        "source": "T26n1525_006:0257a29_3"
    },
    {
        "source_sentence": "精進莊嚴十善業道，成就佛法降伏一切諸魔怨敵；",
        "translation": "“Great enlightening beings practice the ten paths of good deeds, producing buddha-teachings to overcome all demons.",
        "source": "T26n1525_006:0257b01_4"
    },
    {
        "source_sentence": "思惟莊嚴十善業道，成就聞慧思慧修慧堅固清淨；",
        "translation": "They contemplate and adorn the ten good paths of action, perfecting listening, insight, reflection, wisdom, and meditation.",
        "source": "T26n1525_006:0257b02_5"
    },
    {
        "source_sentence": "般若莊嚴十善業道，成就離諸邪見；",
        "translation": "Prajñāpāramitā adorned the ten good paths of action, developing freedom from false views.",
        "source": "T26n1525_006:0257b03_6"
    },
    {
        "source_sentence": "慈心莊嚴十善業道，成就不害一切眾生心；",
        "translation": "A compassionate mind adorned with the ten good paths of action, they develop a mind not harming all sentient beings.",
        "source": "T26n1525_006:0257b04_7"
    },
    {
        "source_sentence": "悲心莊嚴十善業道，成就不捨一切眾生心；",
        "translation": "A compassionate mind adorned with the ten good paths of action, they develop a mind not giving up all sentient beings.",
        "source": "T26n1525_006:0257b05_8"
    },
    {
        "source_sentence": "喜心莊嚴十善業道，成就修行佛法不怯弱心；",
        "translation": "A delighted mind adorned with the ten good paths of action, they develop a mind not fainthearted in cultivating buddha-teachings.",
        "source": "T26n1525_006:0257b06_9"
    },
    {
        "source_sentence": "捨心莊嚴十善業道，成就遠離愛心憎心，四攝莊嚴十善業道，成就教化一切眾生心。』」",
        "translation": "The mind of equanimity adorns the ten good courses of action, accomplishes freedom from craving and hatred, and the fourth collects the ten good courses of action that adorn all sentient beings' minds.'",
        "source": "T26n1525_006:0257b07_10"
    },
    {
        "source_sentence": "問曰：「捨義云何？」",
        "translation": "He asked, What's the meaning of abandoning?",
        "source": "T26n1525_006:0257b09_11"
    },
    {
        "source_sentence": "答曰：「對治貪著五陰及以資生，起慈悲心為攝受彼利益他行，不著因果等法，",
        "translation": "Answer: To counteract craving for the five aggregates and necessities, they give rise to a mind of kindness and compassion in order to collect their actions for the benefit of others and aren't attached to such things as causes and effects.",
        "source": "T26n1525_006:0257b10_12"
    },
    {
        "source_sentence": "住持修行名為捨義。」",
        "translation": "Abiding and cultivating it is called the meaning of equanimity.",
        "source": "T26n1525_006:0257b11_13"
    },
    {
        "source_sentence": "問曰：「應說捨成就義。",
        "translation": "He asked, You should explain the meaning of accomplishing equanimity.",
        "source": "T26n1525_006:0257b12_14"
    },
    {
        "source_sentence": "云何菩薩捨成就？」",
        "translation": "How does a bodhisattva accomplish equanimity?",
        "source": "T26n1525_006:0257b12_15"
    },
    {
        "source_sentence": "答曰：「菩薩遠離自取樂行，名捨成就。",
        "translation": "He answered, A bodhisattva's practice of being far removed from self-attachment and bliss is called the accomplishment of equanimity.",
        "source": "T26n1525_006:0257b13_16"
    },
    {
        "source_sentence": "此義云何？",
        "translation": "What does this mean?",
        "source": "T26n1525_006:0257b14_17"
    },
    {
        "source_sentence": "又外道人求自取樂行於布施，彼外道人為自身捨，雖廣行施而愛境界心之所纏故，",
        "translation": "Also, a non-Buddhist seeks to take it for himself and enjoys practicing generosity. That non-Buddhist lets it go for himself because even though he practices generosity extensively, he is tethered by the mind that loves objects.",
        "source": "T26n1525_006:0257b14_18"
    },
    {
        "source_sentence": "果報微薄。",
        "translation": "The rewards are slight.",
        "source": "T26n1525_006:0257b16_19"
    },
    {
        "source_sentence": "又聲聞、辟支佛人雖不求世間樂果報事，而心畢竟取於涅槃。",
        "translation": "Furthermore, even though śrāvakas and pratyekbuddhas don't seek worldly rewards that bring happiness in the world, their minds ultimately grasp nirvāṇa.",
        "source": "T26n1525_006:0257b16_20"
    },
    {
        "source_sentence": "捨利眾生但取涅槃樂，是故施等業道功德，雖少為他而畢竟自為，畢竟專念成就自身利益果報。",
        "translation": "Because they abandon the benefits of sentient beings and simply attain the bliss of nirvāṇa, this is why the virtues of such paths of action as giving are so little for others but ultimately for themselves, and ultimately concentrate on accomplishing the results of their own benefit in their own mind.",
        "source": "T26n1525_006:0257b18_0"
    },
    {
        "source_sentence": "又菩薩摩訶薩出過一切世間，大士為利益他發起堅固大力之心，起大悲柔軟所施最勝畢竟成就。",
        "translation": "Also, when the bodhisattva Mahāsattva transcends all worlds, the great man arouses a resolute mind of great strength for the benefit of others and gives it with great compassion and gentleness that's most excellent and ultimately accomplished.",
        "source": "T26n1525_006:0257b20_1"
    },
    {
        "source_sentence": "「又成就捨者，有六種因。",
        "translation": "“Furthermore, the accomplishment of equanimity has six kinds of causes:",
        "source": "T26n1525_006:0257b23_0"
    },
    {
        "source_sentence": "何等為六？",
        "translation": "What are these six?",
        "source": "T26n1525_006:0257b23_1"
    },
    {
        "source_sentence": "一者、捨自身樂；",
        "translation": "The first is the joy of relinquishing one’s own happiness.",
        "source": "T26n1525_006:0257b23_2"
    },
    {
        "source_sentence": "二者、觀無眾生；",
        "translation": "The second is that they contemplate the absence of sentient beings.",
        "source": "T26n1525_006:0257b24_3"
    },
    {
        "source_sentence": "三者、求無量佛法；",
        "translation": "The third is seeking immeasurable buddha-teachings.",
        "source": "T26n1525_006:0257b24_4"
    },
    {
        "source_sentence": "四者、攝取無量世住；",
        "translation": "The fourth is that they embrace immeasurable worldly abodes.",
        "source": "T26n1525_006:0257b24_5"
    },
    {
        "source_sentence": "五者、修集無量種種善根；",
        "translation": "The fifth is that they cultivate and accumulate measureless various roots of goodness.",
        "source": "T26n1525_006:0257b25_6"
    },
    {
        "source_sentence": "六者、不斷三寶以能成就無量果報，是名菩薩捨成就義應知。",
        "translation": "6. Not stopping the three treasures because they can accomplish measureless rewards, this is called the meaning of a bodhisattva's accomplishment of equanimity that should be known.",
        "source": "T26n1525_006:0257b26_0"
    },
    {
        "source_sentence": "又為他利益一味心故。",
        "translation": "It's also because it's for the benefit of others with a single-flavored mind.",
        "source": "T26n1525_006:0257b27_1"
    },
    {
        "source_sentence": "此明何義？",
        "translation": "What does this explain?",
        "source": "T26n1525_006:0257b27_2"
    },
    {
        "source_sentence": "世間眾生多為自身棄捨利益一切眾生，為求自樂為現受報為未來果施與他物。",
        "translation": "Many worldly sentient beings abandon themselves for the sake of benefiting all sentient beings and give things to others in order to seek their own happiness, which will be rewarded in the present life or future reward.",
        "source": "T26n1525_006:0257b28_3"
    },
    {
        "source_sentence": "若諸菩薩摩訶薩等，為利益他專心一味，見諸眾生貧無資財般若等法。",
        "translation": "Suppose bodhisattvas, mahāsattvas, and so forth, focus their minds on the single flavor of benefiting others and seeing the teachings of prajñāpāramitā and so forth that sentient beings are poor and lack necessities.",
        "source": "T26n1525_006:0257c01_4"
    },
    {
        "source_sentence": "以是義故，不著因果依法施財施，於現在世及未來世能與眾生大利益事，",
        "translation": "Because of this meaning, they don’t cling to causes and effects. Giving according to the Dharma is giving in terms of possessions; it can give great benefits to sentient beings in present and future lives.",
        "source": "T26n1525_006:0257c02_5"
    },
    {
        "source_sentence": "是故菩薩摩訶薩捨成就。",
        "translation": "Therefore, the bodhisattva Mahāsattva's equanimity is accomplished.",
        "source": "T26n1525_006:0257c04_6"
    },
    {
        "source_sentence": "「又復以捨隨順義故。",
        "translation": "“Furthermore, it’s because they abandon the meaning of following.",
        "source": "T26n1525_006:0257c05_0"
    },
    {
        "source_sentence": "此明何義？",
        "translation": "What does this explain?",
        "source": "T26n1525_006:0257c05_1"
    },
    {
        "source_sentence": "布施等事隨順攝取眾生行故，則能攝取一切眾生，作大利益事。",
        "translation": "Because generosity and so forth follow the practice of taking in sentient beings, they're able to take in all sentient beings and perform great benefits.",
        "source": "T26n1525_006:0257c05_2"
    },
    {
        "source_sentence": "雖為利益他事，而外道、聲聞辟支佛等，棄捨利益一切眾生，唯為成就自身利益；",
        "translation": "Even though they do things for the benefit of others, non-Buddhist practitioners, śrāvakas and pratyekabuddhas abandon benefits for all sentient beings only in order to accomplish their own benefit.",
        "source": "T26n1525_006:0257c07_3"
    },
    {
        "source_sentence": "菩薩摩訶薩依大慈悲心起樂利益他眾生行，如菩薩所求如是成就。",
        "translation": "The bodhisattva Mahāsattva relies on the mind of great compassion to give rise to the practice of delighting in benefiting other sentient beings, just as the bodhisattva sought and thus accomplished.",
        "source": "T26n1525_006:0257c09_0"
    },
    {
        "source_sentence": "以是義故，名捨成就。",
        "translation": "Because of this meaning, it's called the accomplishment of equanimity.",
        "source": "T26n1525_006:0257c10_1"
    },
    {
        "source_sentence": "「又以依於取佛菩提起心義故。",
        "translation": "Furthermore, it's because they rely on the meaning of taking the Buddha's enlightenment and initiating mind.",
        "source": "T26n1525_006:0257c11_2"
    },
    {
        "source_sentence": "此明何義？",
        "translation": "What does this explain?",
        "source": "T26n1525_006:0257c11_3"
    },
    {
        "source_sentence": "以菩薩摩訶薩為與一切眾生樂故，自求佛菩提起於捨心，見諸眾生墮墜惡趣，",
        "translation": "Because the great enlightening beings, wishing to give happiness to all sentient beings, seek buddhahood for themselves and set their minds on equanimity, seeing that all sentient beings will fall into bad destinies.",
        "source": "T26n1525_006:0257c12_0"
    },
    {
        "source_sentence": "我於現在及未來世，令諸眾生離苦惱事。",
        "translation": "In the present and future, I will cause sentient beings to be free of suffering and distress.",
        "source": "T26n1525_006:0257c13_1"
    },
    {
        "source_sentence": "是故菩薩其心日夜轉轉為欲利益眾生，名捨成就。",
        "translation": "That's why the bodhisattva's mind is transformed day and night for the sake of benefiting sentient beings, which is called the accomplishment of equanimity.",
        "source": "T26n1525_006:0257c14_2"
    },
    {
        "source_sentence": "「又以能攝取種種果故。",
        "translation": "It's also because they can gather various fruits.",
        "source": "T26n1525_006:0257c15_3"
    },
    {
        "source_sentence": "此明何義？",
        "translation": "What does this explain?",
        "source": "T26n1525_006:0257c16_4"
    },
    {
        "source_sentence": "以諸菩薩為欲利益一切眾生種種布施，於現在世及未來世，為欲攝取一切眾生取種種果，",
        "translation": "“Enlightening beings give various kinds of gifts to all sentient beings in order to benefit them. In the present and in the future they want to take care of all sentient beings and obtain various fruits.",
        "source": "T26n1525_006:0257c16_5"
    },
    {
        "source_sentence": "是名菩薩捨成就。",
        "translation": "This is called the accomplishment of bodhisattva equanimity.",
        "source": "T26n1525_006:0257c18_6"
    },
    {
        "source_sentence": "如《無盡意修多羅》中說，求飲食者施與飲食，為命為樂為辯為色及以為力，",
        "translation": "As it's said in the Inexhaustible Wish-Fulfilling Sutra, Those who seek food and drink give food and drink for their livelihood, pleasure, eloquence, form, and strength.",
        "source": "T26n1525_006:0257c19_7"
    },
    {
        "source_sentence": "如是等皆悉施與。",
        "translation": "All of these things are given to him.",
        "source": "T26n1525_006:0257c20_8"
    },
    {
        "source_sentence": "「又為遠離邪命自活求資生故。",
        "translation": "“Furthermore, it’s because he’s far removed from wrong livelihood and seeks to support himself.",
        "source": "T26n1525_006:0257c21_9"
    },
    {
        "source_sentence": "此明何義？",
        "translation": "What does this explain?",
        "source": "T26n1525_006:0257c22_10"
    },
    {
        "source_sentence": "以諸菩薩布施波羅蜜相違之法貪求資生，邪命自活等皆悉遠離。",
        "translation": "Because the bodhisattvas' generosity is contrary to the perfection of giving, they crave necessities and are completely free of wrong livelihood, self-existence, and so forth.",
        "source": "T26n1525_006:0257c22_11"
    },
    {
        "source_sentence": "如《無盡意修多羅》中說，菩薩摩訶薩無顛倒邪命追求資生等布施。」",
        "translation": "As it's said in the Sutra of Inexhaustible Thought, the bodhisattva Mahāsattva doesn't mistakenly pursue wrong livelihood and makes offerings such as pursuing necessities.",
        "source": "T26n1525_006:0257c23_12"
    },
    {
        "source_sentence": "問曰：「應說清淨不清淨捨。",
        "translation": "He asked, You should explain pure and impure equanimity.",
        "source": "T26n1525_006:0257c26_0"
    },
    {
        "source_sentence": "云何清淨？",
        "translation": "What's pure?",
        "source": "T26n1525_006:0257c26_1"
    },
    {
        "source_sentence": "云何不清淨？」",
        "translation": "How is it impure?",
        "source": "T26n1525_006:0257c26_2"
    },
    {
        "source_sentence": "答曰：「菩薩摩訶薩依自心清淨布施清淨，如如來修多羅中說，有四種清淨布施。",
        "translation": "Answer: The bodhisattva Mahāsattva relies on the purity of his own mind for pure generosity and purity, as explained in the Tathāgata's sūtra, there are four kinds of pure generosity.",
        "source": "T26n1525_006:0257c27_3"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T26n1525_006:0257c29_4"
    },
    {
        "source_sentence": "謂有布施從施主清淨非是受者，如是等於彼四種清淨施中，所謂施主清淨非是受者，",
        "translation": "These are the four kinds of giving that are pure because they are not received from the donor.",
        "source": "T26n1525_006:0257c29_5"
    },
    {
        "source_sentence": "是名菩薩摩訶薩清淨施。",
        "translation": "This is called the pure generosity of the bodhisattva-mahāsattva.",
        "source": "T26n1525_006:0258a02_6"
    },
    {
        "source_sentence": "又從施者受者清淨，亦名菩薩清淨之施。",
        "translation": "It's also called the bodhisattva's pure giving that follows the purity of those who give and those who receive it.",
        "source": "T26n1525_006:0258a03_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T26n1525_006:0258a03_1"
    },
    {
        "source_sentence": "以諸菩薩施與他物不求果報，即能施與一切眾生。",
        "translation": "Because bodhisattvas give things to others without seeking reward, they can give them to all sentient beings.",
        "source": "T26n1525_006:0258a04_2"
    },
    {
        "source_sentence": "又求布施果報者，彼人於受者邊求清淨，而菩薩離果報故，一切時自身心清淨，",
        "translation": "Also, if someone seeks the reward of generosity, they'll seek purity at the recipient's side, but because the bodhisattva is free of the reward, his own mind is pure at all times.",
        "source": "T26n1525_006:0258a05_3"
    },
    {
        "source_sentence": "以心清淨故施清淨。",
        "translation": "Because the mind is purified, giving is purified.",
        "source": "T26n1525_006:0258a07_4"
    },
    {
        "source_sentence": "「又以遠離忽然施等。",
        "translation": "Again, it's because they're far removed from sudden generosity and so forth.",
        "source": "T26n1525_006:0258a07_5"
    },
    {
        "source_sentence": "此明何義？",
        "translation": "What does this explain?",
        "source": "T26n1525_006:0258a08_6"
    },
    {
        "source_sentence": "以如來修多羅中說有九種施：一者、植施；",
        "translation": "Because it is said in the sutra of the Tathagata that there are nine forms of giving:",
        "source": "T26n1525_006:0258a08_7"
    },
    {
        "source_sentence": "二者、畏懼施；",
        "translation": "The second is the practice of giving out of fear.",
        "source": "T26n1525_006:0258a09_8"
    },
    {
        "source_sentence": "三者、報恩施；",
        "translation": "The third is the gift of repaying kindness.",
        "source": "T26n1525_006:0258a09_9"
    },
    {
        "source_sentence": "四者、求恩施；",
        "translation": "The fourth is giving in order to seek charity.",
        "source": "T26n1525_006:0258a09_10"
    },
    {
        "source_sentence": "五者、學父母施；",
        "translation": "The fifth is the giving of those who are still learning from their parents.",
        "source": "T26n1525_006:0258a10_11"
    },
    {
        "source_sentence": "六者、為生天施；",
        "translation": "The sixth is giving for the sake of rebirth in heaven.",
        "source": "T26n1525_006:0258a10_12"
    },
    {
        "source_sentence": "七者、為名稱施；",
        "translation": "The seventh is giving for the sake of fame.",
        "source": "T26n1525_006:0258a10_13"
    },
    {
        "source_sentence": "八者、為莊嚴心施；",
        "translation": "The eighth is giving in order to adorn the mind.",
        "source": "T26n1525_006:0258a11_14"
    },
    {
        "source_sentence": "九者、眷屬法施。",
        "translation": "The nineth is the giving of dependents and dharmas.",
        "source": "T26n1525_006:0258a11_15"
    },
    {
        "source_sentence": "為修行功德為得上義施。",
        "translation": "It's for the merit of cultivating practice and for the attainment of superior meaningful giving.",
        "source": "T26n1525_006:0258a12_16"
    },
    {
        "source_sentence": "植布施者，謂得植福田求多果報故。",
        "translation": "Giving by planting means that one can plant a field of merit and seek great rewards.",
        "source": "T26n1525_006:0258a12_17"
    },
    {
        "source_sentence": "又植施者，謂近眷屬名植布施。",
        "translation": "Also, planting generosity means planting generosity near one's family members.",
        "source": "T26n1525_006:0258a13_18"
    },
    {
        "source_sentence": "畏懼施者，見一切物無常敗壞，寧用布施故。",
        "translation": "Giving out of fear is when one sees that all things are impermanent and decaying, preferring to use generosity.",
        "source": "T26n1525_006:0258a14_19"
    },
    {
        "source_sentence": "報恩施者，謂報恩相施，彼先施我、我應還施。",
        "translation": "Giving as repaying kindness means giving with the characteristic of repaying kindness, which is first given to me and then given back to me.",
        "source": "T26n1525_006:0258a15_20"
    },
    {
        "source_sentence": "求報恩施者，謂求後時報恩故。",
        "translation": "Giving in order to repay kindness means to seek the kindnesses of later lifetimes.",
        "source": "T26n1525_006:0258a16_21"
    },
    {
        "source_sentence": "施學父母施者，謂著過去修行起如是心：『我父母精進常行布施，我亦如是行於布施。』",
        "translation": "Giving to someone who trains and gives to their parents means to focus on past cultivation and give with this mind: 'My parents' exertion always practiced generosity, and so did I practice generosity in the same way.'",
        "source": "T26n1525_006:0258a17_22"
    },
    {
        "source_sentence": "故。",
        "translation": "That's why.",
        "source": "T26n1525_006:0258a19_0"
    },
    {
        "source_sentence": "為生天施者，謂求天中五欲境界故。",
        "translation": "Giving for the sake of rebirth in heaven means seeking the five objects of desire in heaven.",
        "source": "T26n1525_006:0258a19_1"
    },
    {
        "source_sentence": "為名稱施者，為令四方沙門婆羅門等知而施故。",
        "translation": "Giving for fame is to cause the ascetics and brāhmaṇas of the four directions to know and give.",
        "source": "T26n1525_006:0258a19_2"
    },
    {
        "source_sentence": "如是七種施。",
        "translation": "These are the seven kinds of giving.",
        "source": "T26n1525_006:0258a21_3"
    },
    {
        "source_sentence": "為智者所呵，以不清淨故。",
        "translation": "It's criticized by wise people because it's not pure.",
        "source": "T26n1525_006:0258a21_4"
    },
    {
        "source_sentence": "又聲聞、辟支佛人，離世間樂求涅槃樂，如是布施亦非清淨。",
        "translation": "Also, śrāvakas and pratyekbuddhas part with worldly happiness and seek the happiness of nirvāṇa, and such generosity isn't pure either.",
        "source": "T26n1525_006:0258a21_5"
    },
    {
        "source_sentence": "又菩薩摩訶薩不著自樂，唯求諸佛菩提心施，於諸施中最勝清淨，是名菩薩施清淨。",
        "translation": "Also, the bodhisattva Mahāsattva's generosity that doesn't cling to self and pleasure but seeks the buddhas' mind of enlightenment is the most pure of all kinds of generosity, which is called the bodhisattva's purity of generosity.",
        "source": "T26n1525_006:0258a23_6"
    },
    {
        "source_sentence": "「又以如實知有為行體故。",
        "translation": "“Furthermore, it’s because they truly know the essence of conditioned formations.",
        "source": "T26n1525_006:0258a25_7"
    },
    {
        "source_sentence": "此明何義？",
        "translation": "What does this explain?",
        "source": "T26n1525_006:0258a25_8"
    },
    {
        "source_sentence": "以諸凡夫取著虛妄戲論我相心顛倒故，唯求五欲樂境界事，以離慧眼以為愛等煩惱諸垢之所染污。",
        "translation": "Because ordinary people are attached to false conceptual elaborations about self and characteristics, they only seek the objects of the five desires and pleasures, and because they're free of the eye of wisdom, they think that they're stained by the defilements of craving and other afflictions.",
        "source": "T26n1525_006:0258a26_9"
    },
    {
        "source_sentence": "捨不清淨。",
        "translation": "They abandon what's impure and pure.",
        "source": "T26n1525_006:0258a28_10"
    },
    {
        "source_sentence": "菩薩摩訶薩如實知見有為行體虛妄不實，是故遠離我見等相，及能遠離五怖畏故，",
        "translation": "“Great enlightening beings truly know that the essence of conditioned forces is false and unreal; therefore, they are far removed from such characteristics as view of self and can be far removed from the five fears.",
        "source": "T26n1525_006:0258a28_11"
    },
    {
        "source_sentence": "無有內外可施之物不能捨者，以為求他利益所縛，及能遠離自求樂等垢污之法，",
        "translation": "There is no internal or external thing to be given that they can’t give up because they are bound by seeking the benefit of others and being able to distance themselves from such defiled things as seeking happiness.",
        "source": "T26n1525_006:0258b01_12"
    },
    {
        "source_sentence": "以是義故，名捨清淨。",
        "translation": "Because of this meaning, it's called the purity of equanimity.",
        "source": "T26n1525_006:0258b03_13"
    },
    {
        "source_sentence": "「又以空觀觀所起故。",
        "translation": "“Furthermore, it’s because the contemplation of emptiness is produced by the contemplation of emptiness.",
        "source": "T26n1525_006:0258b03_14"
    },
    {
        "source_sentence": "此明何義？",
        "translation": "What does this explain?",
        "source": "T26n1525_006:0258b04_15"
    },
    {
        "source_sentence": "以諸菩薩空觀等觀觀施等法，以是義故名捨清淨。",
        "translation": "Because bodhisattvas contemplate emptiness and so forth, they contemplate such things as giving, which is called the purity of equanimity because of this meaning.",
        "source": "T26n1525_006:0258b04_16"
    },
    {
        "source_sentence": "如《無盡意修多羅》中如來說言：『以觀空觀觀起布施。』",
        "translation": "As the Tathāgata says in the Sutra of Inexhaustible Thought, 'The cultivation of generosity arises from observing emptiness and contemplating it.'",
        "source": "T26n1525_006:0258b05_17"
    },
    {
        "source_sentence": "以是義故，施不可盡如是等。」",
        "translation": "Because of this meaning, such things as giving can't be exhausted.",
        "source": "T26n1525_006:0258b07_0"
    },
    {
        "source_sentence": "問曰：「應說布施差別之相？」",
        "translation": "He asked, Should we explain the distinctive characteristics of generosity?",
        "source": "T26n1525_006:0258b08_0"
    },
    {
        "source_sentence": "答曰：「略說則有一種布施，謂不貪心相應心施。",
        "translation": "Answer: In brief, there's one kind of generosity, which is to say that it's mind-associated with mind that doesn't crave the mind.",
        "source": "T26n1525_006:0258b08_1"
    },
    {
        "source_sentence": "「復有二種：一、見受者；",
        "translation": "Again, there are two kinds:",
        "source": "T26n1525_006:0258b09_2"
    },
    {
        "source_sentence": "二、不見受者。",
        "translation": "2. Those who don't see and receive.",
        "source": "T26n1525_006:0258b10_3"
    },
    {
        "source_sentence": "不見受者者，如置物火中及恒河中。",
        "translation": "Someone who doesn't see the recipient is like putting something in a fire or in the Ganges River.",
        "source": "T26n1525_006:0258b10_4"
    },
    {
        "source_sentence": "又見施主者，有施有布施。",
        "translation": "Also, when you see a donor, there's generosity and generosity.",
        "source": "T26n1525_006:0258b11_5"
    },
    {
        "source_sentence": "彼亦有二種：謂染、不染。",
        "translation": "There are also two kinds of these: defiled and undefiled.",
        "source": "T26n1525_006:0258b11_6"
    },
    {
        "source_sentence": "染者謂家法餘食及婬女人莊嚴具施，是名染施。",
        "translation": "Defilement refers to the gift of food that's left over from the householder's life and the gift of women's adornments, which is called defiled giving.",
        "source": "T26n1525_006:0258b12_7"
    },
    {
        "source_sentence": "不染施者，謂施貧窮孤獨人等是不染施。",
        "translation": "“Non-defiled giving”: Giving to such [things] as giving to the poor, orphaned persons and so on is an undefiled giving.",
        "source": "T26n1525_006:0258b13_8"
    },
    {
        "source_sentence": "「復有二種施：謂法施、資生施。",
        "translation": "“Furthermore, there are two kinds of generosity: the giving of the Dharma and the giving of necessities.",
        "source": "T26n1525_006:0258b14_9"
    },
    {
        "source_sentence": "法施者，謂離供養恭敬等心，於法中法想，遠離愛心及顛倒心說修多羅等，",
        "translation": "Giving of the doctrine means that one is free of such thoughts as offerings, honoring and venerating [the Buddha]. Within the doctrine, conceptualizing it as a doctrine, one keeps free of craving and deluded thoughts by teaching sutras, etc.",
        "source": "T26n1525_006:0258b15_10"
    },
    {
        "source_sentence": "是名法施。",
        "translation": "This is called giving the Dharma.",
        "source": "T26n1525_006:0258b16_11"
    },
    {
        "source_sentence": "「復有三種施，即此二種加無畏施。",
        "translation": "(2) Again there is another triple doctrine that explains three kinds of generosity:",
        "source": "T26n1525_006:0258b17_12"
    },
    {
        "source_sentence": "無畏施者，作如是言：『汝莫怖畏，汝莫怖畏。』",
        "translation": "The fearless donor says, 'Don't be afraid; don't be afraid.'",
        "source": "T26n1525_006:0258b17_13"
    },
    {
        "source_sentence": "又無畏施者，見諸眾生種種怖畏施與無畏。",
        "translation": "Also, fearless giving refers to the generosity and fearlessness of seeing the various fears of sentient beings.",
        "source": "T26n1525_006:0258b18_14"
    },
    {
        "source_sentence": "此義云何？",
        "translation": "What does this mean?",
        "source": "T26n1525_006:0258b19_15"
    },
    {
        "source_sentence": "謂見他畏起，與現世及未來世無怖畏心，而口說言：『汝莫怖畏，汝莫怖畏。",
        "translation": "It means that when they see fear arising in others and have no fear of them in the present or future lives, they say, 'Don't be afraid, and don't be afraid!'",
        "source": "T26n1525_006:0258b20_16"
    },
    {
        "source_sentence": "我為汝作如是如是方便，隨何等方便與汝畢竟無畏之處。』",
        "translation": "For you, I'll make such-and-such a method, and whatever method I use to give you the ultimate fearlessness.'",
        "source": "T26n1525_006:0258b21_17"
    },
    {
        "source_sentence": "名無畏施。",
        "translation": "It's called fearless giving.",
        "source": "T26n1525_006:0258b23_18"
    },
    {
        "source_sentence": "彼怖畏者，如貧窮人受於苦惱，此怖畏者亦復如是，以與無畏對治法故。",
        "translation": "Just as a poor person experiences suffering and distress, this fear is likewise because it's the antidote to fearlessness.",
        "source": "T26n1525_006:0258b23_19"
    },
    {
        "source_sentence": "「復有四種施，即向三種，復有大施。",
        "translation": "Again, there are four kinds of giving: directing [them] to three kinds; furthermore, there is the great giving.",
        "source": "T26n1525_006:0258b24_20"
    },
    {
        "source_sentence": "言大施者，謂受持五戒，此是如來所說大施，以能攝取無量眾生故，成就無量眾生樂故。",
        "translation": "The expression great giving refers to the five precepts that are observed. This is what the Tathāgata teaches as great giving because it can take care of measureless sentient beings and accomplish the happiness of measureless sentient beings.",
        "source": "T26n1525_006:0258b25_21"
    },
    {
        "source_sentence": "資生飲食用布施者，不能廣作利益眾生。",
        "translation": "Those who provide food and drink for the benefit of sentient beings can't extensively work to benefit sentient beings.",
        "source": "T26n1525_006:0258b27_22"
    },
    {
        "source_sentence": "受持五戒能作利益，以能盡形受持五戒，念念增長種種功德，以依止彼根本心故，",
        "translation": "By being able to receive and uphold the five precepts in all their forms, each moment of thought increases various merits because it depends on that fundamental mind.",
        "source": "T26n1525_006:0258b28_23"
    },
    {
        "source_sentence": "諸功德聚乃至命根不斷絕住。",
        "translation": "The accumulation of merit and even the life root don't continue to be cut off.",
        "source": "T26n1525_006:0258c01_24"
    },
    {
        "source_sentence": "「復有四種施，此四種施略有二種：一者、不淨；",
        "translation": "Again, there are four kinds of giving. Briefly, these four kinds of giving are of two kinds:",
        "source": "T26n1525_006:0258c02_25"
    },
    {
        "source_sentence": "二者、淨。",
        "translation": "The second is pure.",
        "source": "T26n1525_006:0258c03_26"
    },
    {
        "source_sentence": "不淨中有二種差別。",
        "translation": "There are two kinds of distinctions in what's impure.",
        "source": "T26n1525_006:0258c03_27"
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are these two?",
        "source": "T26n1525_006:0258c04_0"
    },
    {
        "source_sentence": "一者、怖畏施；",
        "translation": "The first is the practice of giving out of fear.",
        "source": "T26n1525_006:0258c04_1"
    },
    {
        "source_sentence": "二者、求報恩施。",
        "translation": "The second is that they seek to repay kindness and give.",
        "source": "T26n1525_006:0258c04_2"
    },
    {
        "source_sentence": "以何義故名為不淨？",
        "translation": "What does it mean to be called impure?",
        "source": "T26n1525_006:0258c04_3"
    },
    {
        "source_sentence": "如世間田，以為荊蕀惡草等覆，故名不淨，此亦如是，以怖畏故、求報恩故，",
        "translation": "Just as a field in the world is called impure because it's covered with thorns, weeds, bad grass, and so forth. This is likewise because of fear and because of seeking to repay kindness.",
        "source": "T26n1525_006:0258c05_4"
    },
    {
        "source_sentence": "名不淨施。",
        "translation": "It's called impure giving.",
        "source": "T26n1525_006:0258c07_5"
    },
    {
        "source_sentence": "淨中亦有二種差別。",
        "translation": "There are also two kinds of distinctions in purity.",
        "source": "T26n1525_006:0258c07_6"
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are these two?",
        "source": "T26n1525_006:0258c07_7"
    },
    {
        "source_sentence": "一者、敬重心施；",
        "translation": "The first is that they give with reverence.",
        "source": "T26n1525_006:0258c08_0"
    },
    {
        "source_sentence": "二者、慈悲心施。",
        "translation": "2. giving with a compassionate mind.",
        "source": "T26n1525_006:0258c08_1"
    },
    {
        "source_sentence": "「『下求有資生，　　下下怖畏施，",
        "translation": "'Lower to seek necessities, lower to fearlessly give,",
        "source": "T26n1525_006:0258c08_2"
    },
    {
        "source_sentence": "　　智者敬重施，　　勝智慈悲施。』",
        "translation": "A wise person respects generosity and bestows wisdom, compassionate generosity, and superior kindness.'",
        "source": "T26n1525_006:0258c08_2"
    },
    {
        "source_sentence": "除此四種更有上上勝施，如偈言：「復有四種施。",
        "translation": "Beyond these four kinds, there's another superior form of giving, as the verse says, Again, there are four kinds of giving.",
        "source": "T26n1525_006:0258c08_2"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T26n1525_006:0258c12_3"
    },
    {
        "source_sentence": "一者、自利益施非他利益；",
        "translation": "The first is that they give for their own benefit and not for the benefit of others.",
        "source": "T26n1525_006:0258c12_4"
    },
    {
        "source_sentence": "二者、他利益施非自利益；",
        "translation": "The second is that they give for the benefit of others and not for their own benefit.",
        "source": "T26n1525_006:0258c13_5"
    },
    {
        "source_sentence": "三者、俱利益施；",
        "translation": "The third is mutually beneficial giving.",
        "source": "T26n1525_006:0258c13_6"
    },
    {
        "source_sentence": "四者、俱無利益施。",
        "translation": "4. Neither is it a beneficial gift.",
        "source": "T26n1525_006:0258c14_7"
    },
    {
        "source_sentence": "自利益施非他利益者，謂凡夫聖人伏離煩惱，或有非是伏離煩惱，或時施與諸佛如來，",
        "translation": "Giving for one’s own benefit is not for the benefit of another: when worldlings and noble persons subdue defilement, sometimes they subdue defilement; sometimes they don’t. Sometimes they give to the buddha-tathāgatas.",
        "source": "T26n1525_006:0258c14_8"
    },
    {
        "source_sentence": "或時施與形像塔廟，是名自利益施非他利益。",
        "translation": "Sometimes giving to an image of a stūpa or shrine is called self-benefiting and not other-benefiting.",
        "source": "T26n1525_006:0258c16_9"
    },
    {
        "source_sentence": "他利益施非自利益者，謂阿羅漢、阿那含等，除為現果施與眾生，是名他利益施非自利益。",
        "translation": "Giving for the benefit of others and not for one's own benefit means that an arhat or non-returner, etc., except for giving to sentient beings for their present reward, is called a donor who gives for the benefit of others and doesn't give for his own benefit.",
        "source": "T26n1525_006:0258c17_10"
    },
    {
        "source_sentence": "俱利益施者，謂施伏離煩惱凡夫，或未伏離煩惱凡夫，是名俱利益施。",
        "translation": "Giving for the benefit of both means that giving subdues worldlings who are free of affliction, or they may not subdue worldlings who are free of affliction, and this is called giving for the benefit of both.",
        "source": "T26n1525_006:0258c19_11"
    },
    {
        "source_sentence": "俱無利益施者，除為現果，謂阿羅漢、阿那含等為塔廟施，是名俱無利益施。",
        "translation": "Giving for the benefit of both is called giving for the benefit of neither. “giving for the benefit of both”: Exception made for the present fruit: such [things] as giving to arhats and anāgāmins, etc., are called ‘giving for the benefit of both’.",
        "source": "T26n1525_006:0258c21_12"
    },
    {
        "source_sentence": "「又復略說，諸菩薩摩訶薩有四種施，悉能攝取一切善根。",
        "translation": "Again, it's briefly explained that there are four kinds of generosity by bodhisattvas and mahāsattvas that can all gather in all good roots.",
        "source": "T26n1525_006:0258c23_13"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T26n1525_006:0258c24_14"
    },
    {
        "source_sentence": "一者、平等心施；",
        "translation": "The first is impartial mental giving.",
        "source": "T26n1525_006:0258c24_15"
    },
    {
        "source_sentence": "二者、對治施；",
        "translation": "The second is antidote giving.",
        "source": "T26n1525_006:0258c25_16"
    },
    {
        "source_sentence": "三者、迴向大菩提施；",
        "translation": "The third is generosity directed toward great enlightenment.",
        "source": "T26n1525_006:0258c25_17"
    },
    {
        "source_sentence": "四者、依寂滅施。",
        "translation": "4. Giving based on the cessation of quiescence.",
        "source": "T26n1525_006:0258c26_18"
    },
    {
        "source_sentence": "如是諸菩薩摩訶薩為滿足檀波羅蜜故，如是布施應知。」",
        "translation": "Thus, these are the kinds of generosity that should be known to bodhisattvas and mahāsattvas who fulfill the perfection of giving in order to fulfill the perfection of giving.",
        "source": "T26n1525_006:0258c26_19"
    },
    {
        "source_sentence": "問曰：「應說布施果。",
        "translation": "He asked, You should explain the fruit of generosity.",
        "source": "T26n1525_006:0258c27_20"
    },
    {
        "source_sentence": "云何布施果？」",
        "translation": "What is the fruit of generosity?",
        "source": "T26n1525_006:0258c28_21"
    },
    {
        "source_sentence": "答曰：「略說布施，有一種果，所謂受用。",
        "translation": "Answer: In brief, it's said that generosity has one kind of fruit, which is called enjoyment.",
        "source": "T26n1525_006:0258c28_22"
    },
    {
        "source_sentence": "「復有二種果，所謂現在受果、未來受果。",
        "translation": "“Furthermore, there are two kinds of fruits: the so-called fruit that is experienced in the present and the fruit that will be experienced in the future.",
        "source": "T26n1525_006:0258c29_23"
    },
    {
        "source_sentence": "「復有三種果，即此二種復加般若。",
        "translation": "Again, there are three kinds of fruit, which are these two kinds of further addition to prajñā.",
        "source": "T26n1525_006:0259a01_24"
    },
    {
        "source_sentence": "「復有四種果，何謂四種？",
        "translation": "Again, there are four kinds of fruits. What are these four kinds?",
        "source": "T26n1525_006:0259a02_0"
    },
    {
        "source_sentence": "一者、有果而無用；",
        "translation": "The first is that they have an effect but are useless.",
        "source": "T26n1525_006:0259a02_1"
    },
    {
        "source_sentence": "二者、有用而無果；",
        "translation": "The second is that they are useful but have no effect.",
        "source": "T26n1525_006:0259a02_2"
    },
    {
        "source_sentence": "三者、有果亦有用；",
        "translation": "The third is that there are fruits that are also useful.",
        "source": "T26n1525_006:0259a03_3"
    },
    {
        "source_sentence": "四者、無果亦無用。",
        "translation": "4. It's useless because it has no fruit and no function.",
        "source": "T26n1525_006:0259a03_4"
    },
    {
        "source_sentence": "有果而無用者，謂不至心施、不自手施、輕心布施，彼如是施，雖得無量種種果報而不能受用，",
        "translation": "Someone who has an effect but is useless means someone who doesn't give with sincerity, doesn't give with their own hands, and gives with a light heart. Such a gift may attain measureless rewards of various kinds, but they can't experience them.",
        "source": "T26n1525_006:0259a04_5"
    },
    {
        "source_sentence": "如舍衛天主，雖得無量種種珍寶，而不能受用。",
        "translation": "It's like the lord of Śrāvastī, who obtained measureless various treasures but couldn't use them.",
        "source": "T26n1525_006:0259a06_6"
    },
    {
        "source_sentence": "有用而無果者，謂自不施，見他行施起隨喜心。",
        "translation": "Someone who has function but no fruit means that they don't give themselves, and when they see others doing giving, they give with joy.",
        "source": "T26n1525_006:0259a07_7"
    },
    {
        "source_sentence": "以是義故，雖得受用而自無果，如天子物一切沙門婆羅門等，雖得衣食及以受用而自無果，",
        "translation": "It is because even though they obtain food and drink, they do not experience any fruit of their own accord. Just as all the śramaṇas and brāhmaṇas who possess the property of a heavenly being are not experiencing any fruit of their own accord even though they obtain food and drink or enjoy it.",
        "source": "T26n1525_006:0259a08_8"
    },
    {
        "source_sentence": "又如轉輪聖王四兵，雖得衣食而不得果。",
        "translation": "It's also like the four armies of a wheel-turning sage king who doesn't attain fruit even though he gets food and clothing.",
        "source": "T26n1525_006:0259a10_9"
    },
    {
        "source_sentence": "有果亦有用者，謂至心施、不輕心施，如樹提伽諸長者等。",
        "translation": "Someone who has an effect and also uses it means giving with sincerity and giving without despising oneself, like the elders of Jyotiṣa.",
        "source": "T26n1525_006:0259a11_10"
    },
    {
        "source_sentence": "無果亦無用者，謂布施已因即滅盡，或為出世聖道障故，猶如遠離煩惱聖人。",
        "translation": "The absence of an effect and also the absence of a function means that when the cause of generosity is given, it ceases, or because it's for the sake of the supramundane noble path hindrances, just like the noble person who's far removed from affliction.",
        "source": "T26n1525_006:0259a12_11"
    },
    {
        "source_sentence": "「復有五種果，謂得命、色、力、樂、辯等，如如來修多羅中說，因食得命是故施食即是施命，",
        "translation": "“Furthermore, there are five kinds of fruits: the acquisition of life, material form, power, bliss, happiness, eloquence, and so on. As has been said in the sūtra by the Tathāgata that it is through food that one obtains life; therefore, to give food is to give life.",
        "source": "T26n1525_006:0259a14_12"
    },
    {
        "source_sentence": "以是因緣後得長命。",
        "translation": "Because of these causes and conditions, they'll attain long life later.",
        "source": "T26n1525_006:0259a16_13"
    },
    {
        "source_sentence": "如是施色、施力、施樂、施辯才等，皆亦如是。",
        "translation": "So it is with such forms of giving, the power of giving, the bliss of giving, and the eloquence of giving.",
        "source": "T26n1525_006:0259a17_0"
    },
    {
        "source_sentence": "「復有五種勝果，所謂施與父、母、病人、法師、菩薩，得勝果報。",
        "translation": "“Furthermore, there are five kinds of superior rewards, which are called the superior rewards of giving to fathers, mothers, sick people, Dharma masters, and bodhisattvas.",
        "source": "T26n1525_006:0259a17_1"
    },
    {
        "source_sentence": "父母恩養生長身命，是故施者得勝果報。",
        "translation": "Because their parents nurtured them with kindness and longevity, the donor attains the superior reward of giving.",
        "source": "T26n1525_006:0259a19_2"
    },
    {
        "source_sentence": "又病人者，孤獨可愍。",
        "translation": "Also, a sick person is orphaned and alone to be cured.",
        "source": "T26n1525_006:0259a20_3"
    },
    {
        "source_sentence": "以是義故，起慈悲心施病人者得勝果報。",
        "translation": "Because of this meaning, someone who gives with kindness and compassion to a sick person will attain the superior reward.",
        "source": "T26n1525_006:0259a20_4"
    },
    {
        "source_sentence": "又說法者，能生法身增長法身，示導善惡、平正非平正、顛倒非顛倒，",
        "translation": "Also, a preacher of the Dharma can give rise to the Dharma body and grow the Dharma body, showing good and evil, what’s level and not level, and what’s mistaken and not mistaken.",
        "source": "T26n1525_006:0259a21_5"
    },
    {
        "source_sentence": "是故施者得勝果報。",
        "translation": "That's why a donor attains the superior reward of giving.",
        "source": "T26n1525_006:0259a23_6"
    },
    {
        "source_sentence": "又諸菩薩等悉能攝取利益眾生故，以快心故、以無因緣而能發起慈悲心故、以攝取三寶不斷絕因故，",
        "translation": "“Furthermore, enlightening beings are able to take care of sentient beings for their benefit; because they can develop compassion and pity with a joyful mind without any cause or condition; because they take care of the unceasing causes of the Three Jewels.",
        "source": "T26n1525_006:0259a23_7"
    },
    {
        "source_sentence": "以是義故，施菩薩者得勝果報。",
        "translation": "Because of this meaning, a donor who gives to a bodhisattva will attain the superior reward.",
        "source": "T26n1525_006:0259a25_8"
    },
    {
        "source_sentence": "「復有五種果，即現身得。",
        "translation": "Again, there are five kinds of fruits that are attained in the present body.",
        "source": "T26n1525_006:0259a27_0"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T26n1525_006:0259a27_1"
    },
    {
        "source_sentence": "一者、入慈三昧；",
        "translation": "The first is that they enter the concentration of compassion.",
        "source": "T26n1525_006:0259a27_2"
    },
    {
        "source_sentence": "二者、入無諍三昧；",
        "translation": "The second is that they enter the state of no-strife concentration.",
        "source": "T26n1525_006:0259a28_3"
    },
    {
        "source_sentence": "三者、入滅盡定；",
        "translation": "The third is that they enter the absorption of total cessation.",
        "source": "T26n1525_006:0259a28_4"
    },
    {
        "source_sentence": "四者、見道；",
        "translation": "The fourth is the path of insight.",
        "source": "T26n1525_006:0259a28_5"
    },
    {
        "source_sentence": "五者、阿羅漢果。",
        "translation": "5. the fruit of arhatship.",
        "source": "T26n1525_006:0259a29_6"
    },
    {
        "source_sentence": "若布施者，即得果報。",
        "translation": "If someone gives alms, they'll attain its fruit.",
        "source": "T26n1525_006:0259a29_7"
    },
    {
        "source_sentence": "入大慈定者，能發心與無量眾生安隱之樂，以與無量眾生樂故名為慈心，",
        "translation": "He who enters the concentration of great compassion is called a compassionate mind because he's able to arouse the intention to give peace and comfort to measureless sentient beings.",
        "source": "T26n1525_006:0259b01_0"
    },
    {
        "source_sentence": "以是慈心熏修自體，是故初起慈心三昧即布施者，得現果報。",
        "translation": "Because this mind of kindness permeates and cultivates its own essence, the first one who produces the samādhi of compassion, which is generosity, will attain the present reward.",
        "source": "T26n1525_006:0259b02_1"
    },
    {
        "source_sentence": "又入無諍三昧者，悉能防護一切眾生諸煩惱心，以廣攝取利益眾生熏修自體，",
        "translation": "He also entered the concentration of no anger, able to protect all sentient beings from the afflictions of their minds, and perfumed his own essence by extensively taking care of sentient beings for their benefit.",
        "source": "T26n1525_006:0259b04_2"
    },
    {
        "source_sentence": "是故初起無諍三昧即布施者，得現果報。",
        "translation": "That's why the first arousal of the samādhi of no anger, which is generosity, will attain its present reward.",
        "source": "T26n1525_006:0259b05_3"
    },
    {
        "source_sentence": "又入滅盡定者，則能攝取無量功德，以取無量功德熏修自體，以此三昧似於涅槃，",
        "translation": "Also, when one enters the absorption of cessation, one is able to grasp immeasurable qualities. By grasping immeasurable qualities, one perfumes their own essence and, through this concentration, resembles nirvana.",
        "source": "T26n1525_006:0259b06_4"
    },
    {
        "source_sentence": "是故初起滅盡三昧即布施者，得現果報。",
        "translation": "That's why the first one who gives rise to the samādhi of cessation, which is generosity, will attain its present reward.",
        "source": "T26n1525_006:0259b08_5"
    },
    {
        "source_sentence": "又見道者離見道煩惱，以聖道力熏修自體，以是義故，初起見道即布施者，",
        "translation": "Also, the path of vision is free from defilement of the path of vision. By means of the power of the noble path, it perfumes its own essence. Because of this meaning, the one who produces the path of vision for the first time exactly is giving.",
        "source": "T26n1525_006:0259b09_6"
    },
    {
        "source_sentence": "得現果報。",
        "translation": "They'll attain the present reward.",
        "source": "T26n1525_006:0259b11_7"
    },
    {
        "source_sentence": "又阿羅漢果者，遠離修道一切煩惱心得自在，是故初起阿羅漢果即布施者，",
        "translation": "\\",
        "source": "T26n1525_006:0259b11_8"
    },
    {
        "source_sentence": "得現果報。",
        "translation": "They'll attain the present reward.",
        "source": "T26n1525_006:0259b13_9"
    },
    {
        "source_sentence": "又菩薩摩訶薩布施果者，如《無盡意修多羅》中及餘一切修多羅中廣說應知。",
        "translation": "Also, the fruit of giving by bodhisattvas and mahāsattvas should be known as explained in detail in the Sutra of Inexhaustible Thought and all other sutras.",
        "source": "T26n1525_006:0259b13_10"
    },
    {
        "source_sentence": "而諸菩薩摩訶薩等，修行布施勝餘人施，離自取樂為欲利益他眾生故而行布施。",
        "translation": "The bodhisattvas, mahāsattvas, and so forth, cultivate generosity rather than other people's generosity and practice generosity because they part with self-attachment and happiness in order to benefit other sentient beings.",
        "source": "T26n1525_006:0259b15_11"
    },
    {
        "source_sentence": "又復略說，菩薩求於二種法故而行布施：一者、求於大富資生故；",
        "translation": "“Furthermore, it is briefly explained that there are two kinds of reasons why enlightening beings practice giving:",
        "source": "T26n1525_006:0259b17_12"
    },
    {
        "source_sentence": "二者、求得成就波羅蜜故。",
        "translation": "2. because they seek to attain the accomplishment of the perfection.",
        "source": "T26n1525_006:0259b18_13"
    },
    {
        "source_sentence": "「又復菩薩起如是心：『我若無有多資生者，雖有施心而無財物可以布施。』",
        "translation": "Again, the bodhisattva arouses this thought: 'If I don't have many necessities, then even though I have a mind of generosity, there won't be any possessions to give.'",
        "source": "T26n1525_006:0259b20_0"
    },
    {
        "source_sentence": "是故起心為欲成就資生大富施與眾生，依此施故怨親平等攝取利益。",
        "translation": "That's why they arouse the intention to accomplish the great wealth of accumulation and give it to sentient beings, and because of this gift, their enemies and relatives are equally collecting benefits.",
        "source": "T26n1525_006:0259b21_1"
    },
    {
        "source_sentence": "是故菩薩見依布施故，得成就無量福德：一者、能攝取怨；",
        "translation": "Therefore the enlightening beings, seeing that they rely on giving, attain immeasurable virtues:",
        "source": "T26n1525_006:0259b23_2"
    },
    {
        "source_sentence": "二者、恒常給濟一切眾生衣食等物；",
        "translation": "The second is that they always provide all sentient beings with food, clothing, and other necessities.",
        "source": "T26n1525_006:0259b24_3"
    },
    {
        "source_sentence": "三者、心不怯弱；",
        "translation": "The third is that their minds are not faint-hearted.",
        "source": "T26n1525_006:0259b25_4"
    },
    {
        "source_sentence": "四者、餘親不欺；",
        "translation": "The fourth is that they do not deceive others.",
        "source": "T26n1525_006:0259b25_5"
    },
    {
        "source_sentence": "五者、常為眾人敬信尊重；",
        "translation": "The fifth is that they are always respected and revered by the people.",
        "source": "T26n1525_006:0259b26_6"
    },
    {
        "source_sentence": "六者、一切眷屬信受其語；",
        "translation": "The sixth is that all the members of their retinues believe and accept their words.",
        "source": "T26n1525_006:0259b26_7"
    },
    {
        "source_sentence": "七者、入大眾時心無怖畏；",
        "translation": "The seventh is that they have no fear in their minds when entering the assembly.",
        "source": "T26n1525_006:0259b27_8"
    },
    {
        "source_sentence": "八者、一切怨敵不能傷害；",
        "translation": "The eighth is that all enemies cannot harm them.",
        "source": "T26n1525_006:0259b27_9"
    },
    {
        "source_sentence": "九者、親屬歡喜；",
        "translation": "The ninth is that their relatives should be joyful.",
        "source": "T26n1525_006:0259b28_10"
    },
    {
        "source_sentence": "十者、現果資生常有不空；",
        "translation": "The tenth is that the means of producing present fruits always has nonemptyness.",
        "source": "T26n1525_006:0259b28_11"
    },
    {
        "source_sentence": "十一者、常為他求；",
        "translation": "The eleventh is that they always seek for the sake of others.",
        "source": "T26n1525_006:0259b29_12"
    },
    {
        "source_sentence": "十二者、所作已辦；",
        "translation": "The twelfth is that they have accomplished what should be done.",
        "source": "T26n1525_006:0259b29_13"
    },
    {
        "source_sentence": "十三者、情所愛敬常自圍遶；",
        "translation": "The thirteenth is that they are constantly surrounded by affection and respect.",
        "source": "T26n1525_006:0259c01_14"
    },
    {
        "source_sentence": "十四者、所不愛敬皆悉遠離；",
        "translation": "The fourteenth is that all those they dislike and venerate are completely separated from.",
        "source": "T26n1525_006:0259c01_15"
    },
    {
        "source_sentence": "十五者、所有成就世間出世間利益勝事，常為一切親屬所慶；",
        "translation": "The fifteenth was that all the excellent deeds accomplishing worldly and supramundane benefits were always celebrated by all their kinsmen.",
        "source": "T26n1525_006:0259c02_16"
    },
    {
        "source_sentence": "十六者、若無利益一切諸親則懷憂惱；",
        "translation": "The sixteenth is that if they do not benefit all their relatives, they will harbor sorrow.",
        "source": "T26n1525_006:0259c03_17"
    },
    {
        "source_sentence": "十七者、護一切惡；",
        "translation": "The seventeenth is that they protect all evil.",
        "source": "T26n1525_006:0259c04_18"
    },
    {
        "source_sentence": "十八者、自令安住諸善法中；",
        "translation": "The eighteenth is to cause oneself to abide in wholesome states.",
        "source": "T26n1525_006:0259c05_19"
    },
    {
        "source_sentence": "十九者、見他神通心不欣尚；",
        "translation": "The nineteenth is that their minds are not attached to seeing the spiritual powers of others.",
        "source": "T26n1525_006:0259c05_20"
    },
    {
        "source_sentence": "二十者、恒常讚歎一切功德；",
        "translation": "The twenty-second is that they always praise all virtues.",
        "source": "T26n1525_006:0259c06_21"
    },
    {
        "source_sentence": "二十一者、覆藏諸過；",
        "translation": "(21) The twenty-first is that which covers up all faults.",
        "source": "T26n1525_006:0259c07_22"
    },
    {
        "source_sentence": "二十二者、棄捨一切非丈夫相；",
        "translation": "The twenty-second is that they abandon all marks of unworthiness.",
        "source": "T26n1525_006:0259c07_23"
    },
    {
        "source_sentence": "二十三者、成就一切大丈夫相；",
        "translation": "The twenty-third is the accomplishment of all marks of greatness.",
        "source": "T26n1525_006:0259c08_24"
    },
    {
        "source_sentence": "二十四者、無有貧窮下賤乞人看施主眼；",
        "translation": "The twenty-fourth is that there should be no poor or inferior beggar who looks into the donor’s eyes.",
        "source": "T26n1525_006:0259c09_25"
    },
    {
        "source_sentence": "二十五者、一切求心稱事滿足。",
        "translation": "25. The fulfillment of all the things that are sought after by the mind.",
        "source": "T26n1525_006:0259c10_0"
    },
    {
        "source_sentence": "「是故菩薩摩訶薩，深見布施有如是等無量功德，為欲利益一切眾生，",
        "translation": "“Therefore, great enlightening beings deeply see that generosity has such immeasurable virtues for the benefit of all living beings.",
        "source": "T26n1525_006:0259c10_1"
    },
    {
        "source_sentence": "自能成辦如是力故，信憙布施，以依信憙行布施故，則能滿足檀波羅蜜。」",
        "translation": "Because they themselves can accomplish such power, they believe in generosity and practice generosity based on faith and generosity, and then they'll be able to fulfill the perfection of giving.",
        "source": "T26n1525_006:0259c12_2"
    },
    {
        "source_sentence": "問曰：「為從勝心成就清淨布施果報？",
        "translation": "He asked, Is the result of accomplishing the pure fruit of generosity from a superior mind?",
        "source": "T26n1525_006:0259c14_0"
    },
    {
        "source_sentence": "從勝福田成就清淨布施果報？」",
        "translation": "From the superior field of merit, he accomplishes the fruit of pure generosity?",
        "source": "T26n1525_006:0259c14_1"
    },
    {
        "source_sentence": "答曰：「有人言：從勝心故成就清淨布施果報。",
        "translation": "Answer: Some people say, It's because of their superior mind that they accomplish the fruit of pure generosity.",
        "source": "T26n1525_006:0259c15_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T26n1525_006:0259c16_3"
    },
    {
        "source_sentence": "現見施事是一而果報差別，猶如種子。",
        "translation": "They now see that the act of giving is one and the rewards are different, just like seeds.",
        "source": "T26n1525_006:0259c16_4"
    },
    {
        "source_sentence": "此義云何？",
        "translation": "What does this mean?",
        "source": "T26n1525_006:0259c17_5"
    },
    {
        "source_sentence": "猶如種子，地等是一，而依種子見有勝果。",
        "translation": "It is like the case with seeds: earth, etc., are one and the same; but on the basis of seeds they are seen to have superior results.",
        "source": "T26n1525_006:0259c17_6"
    },
    {
        "source_sentence": "如是施物是一，而依勝心乃至施畜生等，以心力故得人天果，轉輪聖王、聲聞、辟支佛、佛菩提果。",
        "translation": "Thus, these things that are given are one and the same, but relying on a superior mind or even giving to animals, etc., they attain the fruit of humans and gods because of their mental powers, which are the fruits of the enlightenment of wheel-turning sage kings, śrāvakas, pratyekbuddhas, and buddhas by virtue of their",
        "source": "T26n1525_006:0259c18_7"
    },
    {
        "source_sentence": "以是義故，依於勝心得勝果報，是故得知勝心為重。",
        "translation": "Because of this meaning, they rely on the superior mind as the superior reward. Therefore, it is important to know the superior mind.",
        "source": "T26n1525_006:0259c21_8"
    },
    {
        "source_sentence": "此復何義？",
        "translation": "What does this mean?",
        "source": "T26n1525_006:0259c22_9"
    },
    {
        "source_sentence": "若施事是重，依施事故成就清淨施果報者，離重施事以慈悲心施與畜生、施與福田，",
        "translation": "If the act of giving is serious and based on the fact of giving accomplishes the fruit of pure giving as a result, give with kindness and compassion to animals and fields of merit that are free from heavy forms of giving.",
        "source": "T26n1525_006:0259c22_10"
    },
    {
        "source_sentence": "如布施佛不應成就清淨施果。",
        "translation": "It's like giving to a buddha who doesn't attain the fruit of pure generosity.",
        "source": "T26n1525_006:0259c24_11"
    },
    {
        "source_sentence": "又若離快勝尊重心等布施如來，應得成就清淨施果而實不成。",
        "translation": "Furthermore, if someone were to part with the Tathāgata's generosity that's free of feelings of superior respect and so forth, they would attain the fruit of pure generosity that's really not accomplished.",
        "source": "T26n1525_006:0259c25_12"
    },
    {
        "source_sentence": "以是義故，成就清淨布施果報，心為勝因，而施事福田能生勝心。",
        "translation": "Because of this meaning, they accomplish the pure rewards of generosity, and their mind is the superior cause, while giving works as a field of merit that produces superior mind.",
        "source": "T26n1525_006:0259c26_13"
    },
    {
        "source_sentence": "依此義故，如來經中讚歎福田。",
        "translation": "Based on this meaning, the Tathāgata's sūtras praise the field of merit.",
        "source": "T26n1525_006:0259c28_0"
    },
    {
        "source_sentence": "「復有人言：依勝福田、依重施事成清淨果。",
        "translation": "Again, some people say that it's the pure fruit of relying on a superior field of merit and relying on heavy-handed generosity.",
        "source": "T26n1525_006:0259c28_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T26n1525_006:0259c29_2"
    },
    {
        "source_sentence": "以聞布施不知福田得勝果報。",
        "translation": "Because they hear about generosity, they don't know the superior rewards of the field of merit.",
        "source": "T26n1525_006:0259c29_3"
    },
    {
        "source_sentence": "此明何義？",
        "translation": "What does this explain?",
        "source": "T26n1525_006:0260a01_4"
    },
    {
        "source_sentence": "不識佛等功德福田、布施佛等得勝果報，如有獼猴施如來蜜，及婆私咤加尸迦等。",
        "translation": "They don't know the superior rewards of such merits as buddhas, fields of merit, fields of blessings, generosity, and so forth, like a monkey giving the Tathāgata's honey or Vasiṣṭhaśika and so forth.",
        "source": "T26n1525_006:0260a01_5"
    },
    {
        "source_sentence": "又如女人愛念心故，以諸幡蓋及華鬘等本心實欲供養兒塔，而實供養辟支佛塔謂是兒塔，",
        "translation": "“Furthermore, it is like a woman’s desire to make offerings to a children’s tower by means of banners, pennants, canopies, flower garlands, and other objects of adornment. While she really wishes to make offerings to the tower of the pratyekabuddha:",
        "source": "T26n1525_006:0260a03_6"
    },
    {
        "source_sentence": "從辟支佛得無量福，不從本心兒邊得福，如是等。",
        "translation": "They attain measureless merit from the pratyekabuddhas and don't attain it from the side of their original mind, such as this.",
        "source": "T26n1525_006:0260a05_7"
    },
    {
        "source_sentence": "以是義故，從勝福田及以重事得勝果報，不從心得，故知福田施事為重。",
        "translation": "Because of this meaning, they attain superior rewards from a superior field of merit and a heavy task that doesn't come from the mind, so they know that the field of merit is a heavy task to give.",
        "source": "T26n1525_006:0260a06_8"
    },
    {
        "source_sentence": "「又有人言：不知福田無福田事，不得成就清淨施果。",
        "translation": "Again, some people say, They don't know the merit of a field of merit or the absence of a field of merit, and they can't attain the fruit of pure generosity.",
        "source": "T26n1525_006:0260a08_9"
    },
    {
        "source_sentence": "如有一人施尼乾子生羅漢想，而不成就清淨果報。",
        "translation": "Suppose there's a person who gives to a Nirgrantha child with the perception of arhatship but doesn't attain the pure reward.",
        "source": "T26n1525_006:0260a09_10"
    },
    {
        "source_sentence": "「又有人言：心以福田及施事等三種和合。",
        "translation": "Again, some people say, The mind combines the three kinds of things like a field of merit and generosity.",
        "source": "T26n1525_006:0260a10_11"
    },
    {
        "source_sentence": "此明何義？",
        "translation": "What does this explain?",
        "source": "T26n1525_006:0260a11_12"
    },
    {
        "source_sentence": "若布施者從所尊重起布施心，知福田等無量功德，值遇諸佛如來福田，",
        "translation": "If a donor gives to someone who gives out of respect, knowing the immeasurable merits of fields of merit and so forth, they'll meet buddhas and tathāgatas as fields of merit.",
        "source": "T26n1525_006:0260a12_13"
    },
    {
        "source_sentence": "或時值遇如來弟子，從尊重心起布施心，所可施物是難捨事能捨布施，",
        "translation": "Sometimes he meets a disciple of the Tathāgata who, out of respect and reverence, gives generosity. The things he gives are difficult to give up but he is able to give them up.",
        "source": "T26n1525_006:0260a13_14"
    },
    {
        "source_sentence": "三種和合方得成就清淨果報而心為重。",
        "translation": "Only when the three kinds are combined will they attain the pure reward of accomplishment, and their mind is heavy.",
        "source": "T26n1525_006:0260a15_15"
    },
    {
        "source_sentence": "以是義故，此三種中唯心一種為重為勝，是能捨主能施主者。」",
        "translation": "Because of this meaning, the only one of these three kinds of mind that's considered to be heavy and superior is the one who can abandon the donor and the one who can give.",
        "source": "T26n1525_006:0260a16_16"
    },
    {
        "source_sentence": "問：「捨主、施主有何差別？」",
        "translation": "Q: What's the difference between a donor who abandons and a donor who gives?",
        "source": "T26n1525_006:0260a17_17"
    },
    {
        "source_sentence": "答曰：「有乞求者，持他物施，是能施主；",
        "translation": "He replied, If there is a beggar or petitioner who gives by taking something from someone else, this is the one who can give.",
        "source": "T26n1525_006:0260a18_18"
    },
    {
        "source_sentence": "持自物施，是能捨主。",
        "translation": "Giving by maintaining one's own property is the owner who can abandon it.",
        "source": "T26n1525_006:0260a19_19"
    },
    {
        "source_sentence": "又有人來乞，持自物施是能施主；",
        "translation": "Also, when someone comes to ask for something, the donor who gives by taking what is his or her own property is the one who can give.",
        "source": "T26n1525_006:0260a19_20"
    },
    {
        "source_sentence": "若人發心求貴重物，而口不言，知心即施，是能捨主。",
        "translation": "If someone arouses the intention to seek valuable things but doesn't say anything, knowing that mind is giving, they're the one who can give up the owner.",
        "source": "T26n1525_006:0260a20_21"
    },
    {
        "source_sentence": "又布施物時慳心數數中間隔起，是能施主；",
        "translation": "Also, when the mind of avarice is repeatedly generated at the moment of giving things, this is the donor who can make donations.",
        "source": "T26n1525_006:0260a21_22"
    },
    {
        "source_sentence": "若無慳心數數起者，是能捨主。",
        "translation": "If it doesn't arise repeatedly with the mind of stinginess, it's the subject who can abandon it.",
        "source": "T26n1525_006:0260a22_23"
    },
    {
        "source_sentence": "又雖施他物，以慳心故自求果報，是能施主；",
        "translation": "Also, even though they give things to others and seek their own reward because of stinginess, this is the donor who is able to do so.",
        "source": "T26n1525_006:0260a23_24"
    },
    {
        "source_sentence": "若施他物，不以慳心專求自果，是能捨主。",
        "translation": "If someone gives to another's property and doesn't focus on their own fruit with stinginess, they're the one who can abandon it.",
        "source": "T26n1525_006:0260a24_25"
    },
    {
        "source_sentence": "又離喜等心而行布施，是能施主；",
        "translation": "Giving away from joy, etc., is the donor who can make donations.",
        "source": "T26n1525_006:0260a25_26"
    },
    {
        "source_sentence": "共歡喜心於三時中不悔心施，是能捨主。",
        "translation": "To rejoice together and give with no regret at three times is the master who's capable of abandoning it.",
        "source": "T26n1525_006:0260a26_27"
    },
    {
        "source_sentence": "又若求未來勝果報者，是能施主；",
        "translation": "Also, if someone seeks the ultimate reward in the future, they are the donor who is able to give.",
        "source": "T26n1525_006:0260a27_28"
    },
    {
        "source_sentence": "離世間報求涅槃果，是能捨主。",
        "translation": "Being free of worldly rewards and seeking the fruit of nirvāṇa is the master who's able to abandon them.",
        "source": "T26n1525_006:0260a27_29"
    },
    {
        "source_sentence": "又若施求於現在未來及涅槃果，是能施主；",
        "translation": "Also, if someone gives and seeks the present and future as well as the fruit of nirvana, this is the donor who can give.",
        "source": "T26n1525_006:0260a28_30"
    },
    {
        "source_sentence": "若發心求大菩提果，唯大悲心施與眾生，是能捨主。",
        "translation": "If someone arouses the intention to seek the fruit of great enlightenment and gives it to sentient beings with only great compassion, they're the master who can abandon them.",
        "source": "T26n1525_006:0260a29_31"
    },
    {
        "source_sentence": "「成就善知迴向方便者。」",
        "translation": "He who accomplishes the skillful means of knowing well and dedicating himself back to it.",
        "source": "T26n1525_006:0260b01_32"
    },
    {
        "source_sentence": "問曰：「何故說戒、施後次說善知迴向方便？」",
        "translation": "He asked, Why are the precepts taught and the method of relying on subsequently explained well-understood dedication of merit?",
        "source": "T26n1525_006:0260b02_33"
    },
    {
        "source_sentence": "答曰：「為欲示現異道功德故。",
        "translation": "He answered, It's because they want to show the merits of the heretics.",
        "source": "T26n1525_006:0260b03_34"
    },
    {
        "source_sentence": "此義云何？",
        "translation": "What does this mean?",
        "source": "T26n1525_006:0260b03_35"
    },
    {
        "source_sentence": "外道人等求自樂故，修戒施等迴向三有。",
        "translation": "Because non-Buddhist people and so forth seek their own happiness, they cultivate morality, generosity, etc., and dedicate them to the three existences.",
        "source": "T26n1525_006:0260b04_36"
    },
    {
        "source_sentence": "又聲聞人、辟支佛等，亦自為身求涅槃樂，修戒施等迴向涅槃。",
        "translation": "Also, śrāvakas and pratyekbuddhas also seek the bliss of nirvāṇa for their own sake, cultivate morality and generosity, and so forth, and dedicate themselves back to nirvāṇa.",
        "source": "T26n1525_006:0260b05_0"
    },
    {
        "source_sentence": "諸菩薩摩訶薩為利益他求大涅槃，以慈悲心一味等心與眾生樂，修戒施等迴向無上大菩提果，",
        "translation": "“Great enlightening beings, seeking great nirvana for the benefit of others, give sentient beings happiness with kindness, compassion, one-pointed concentration, and so forth, cultivating morality, giving, etc., they dedicate them to the supreme fruit of unexcelled great awakening.",
        "source": "T26n1525_006:0260b06_1"
    },
    {
        "source_sentence": "以戒施等同彼外道聲聞辟支佛，是故如來示現迴向勝道功德，說戒施後次說善知迴向方便。",
        "translation": "Because precepts and giving are the same as those of non-Buddhist śrāvakas and pratyekbuddhas, the Tathāgata shows the merit of the superior path of dedication of merit by explaining precepts and giving, and then he explains the method of dedication of good knowledge.",
        "source": "T26n1525_006:0260b08_2"
    },
    {
        "source_sentence": "「又修戒施等貪著世間樂果報心難可防護，是故如來說施戒後，次說善知迴向方便。",
        "translation": "Furthermore, it's difficult to guard the mind that cultivates precepts like generosity and craving for worldly pleasures as rewards; therefore, after the Tathāgata explains the precepts of giving, he next explains the method of well-understood dedication.",
        "source": "T26n1525_006:0260b10_3"
    },
    {
        "source_sentence": "此明何義？",
        "translation": "What does this explain?",
        "source": "T26n1525_006:0260b12_4"
    },
    {
        "source_sentence": "以戒施等非三昧行，唯取欲界天人之中淨妙色等境界果報，而彼淨妙色等境界，",
        "translation": "Because such [things] as morality, giving, etc., are not samādhi formations: they only grasp the fruit-results of such [things] as form and other objects among gods and humans in the realm of sexual passion; but these such [things] as form and other objects -",
        "source": "T26n1525_006:0260b13_5"
    },
    {
        "source_sentence": "雖作心護，貪等煩惱不可得離。",
        "translation": "Even though they act as mental protectors, the afflictions like craving and so forth cannot be freed.",
        "source": "T26n1525_006:0260b14_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T26n1525_006:0260b15_7"
    },
    {
        "source_sentence": "以於過去無始世來習貪愛等染著境界，以心取彼色等境界難防護故。",
        "translation": "It is because from beginningless time in the past, such objects as craving and other defiled attachments have been accumulated. Because mind grasps those objects of form, etc., which are difficult to guard.",
        "source": "T26n1525_006:0260b15_8"
    },
    {
        "source_sentence": "而諸菩薩彼時修行地方便法，即於彼時雖復未離貪等煩惱而修戒施，貪等煩惱不能染心。",
        "translation": "The bodhisattvas then cultivate the method in the stage of cultivation, which is to cultivate morality and generosity even though they aren't free of craving and other afflictions at that point, and their minds aren't stained by craving and other afflictions.",
        "source": "T26n1525_006:0260b17_9"
    },
    {
        "source_sentence": "「又為斷疑，是故如來說戒施後，次說善知迴向方便。",
        "translation": "“Furthermore, in order to end doubt, the Tathāgata explains that after he teaches precepts and generosity, he then explains the method of well-understood dedication of merit.",
        "source": "T26n1525_006:0260b19_10"
    },
    {
        "source_sentence": "此示現何義？",
        "translation": "What does this show mean?",
        "source": "T26n1525_006:0260b20_11"
    },
    {
        "source_sentence": "世間有人，疑於菩薩不離煩惱修戒施等，以利根故觀有為法，一切皆悉苦空無常，",
        "translation": "Some people in the world doubt that bodhisattvas don't part with afflictions, cultivate precepts and generosity, observe conditioned things because of their sharp faculties, and all are completely painful, empty, and impermanent.",
        "source": "T26n1525_006:0260b21_12"
    },
    {
        "source_sentence": "修戒施時貪等煩惱為染菩薩、不染菩薩？",
        "translation": "When cultivating precepts and giving, are the afflictions of craving and so forth defiled bodhisattvas or undefiled bodhisattvas?",
        "source": "T26n1525_006:0260b22_13"
    },
    {
        "source_sentence": "為斷彼疑。",
        "translation": "In order to stop their doubts, they say.",
        "source": "T26n1525_006:0260b23_14"
    },
    {
        "source_sentence": "菩薩爾時，為欲利益一切眾生，捨自利益乃至不求轉輪王處樂果報事，",
        "translation": "“At that time the enlightening beings, wishing to benefit all sentient beings, give up their own benefits and do not seek rewards or rewards of worldly pleasures.",
        "source": "T26n1525_006:0260b24_15"
    },
    {
        "source_sentence": "唯為一切眾生樂故求佛菩提，所有善根迴向涅槃。",
        "translation": "They only seek the Buddha's enlightenment for the sake of the happiness of all sentient beings and dedicate their good roots to nirvāṇa.",
        "source": "T26n1525_006:0260b25_16"
    },
    {
        "source_sentence": "以是義故，菩薩雖復未離世間，一切世間所有過患不染菩薩。",
        "translation": "Because of this, even though the bodhisattva has yet to leave the world, all the faults and afflictions in the world don't stain the bodhisattva.",
        "source": "T26n1525_006:0260b26_17"
    },
    {
        "source_sentence": "「又依清淨戒迴向清淨故。",
        "translation": "Again, it's because the pure dedication of relying on the pure precepts is purified.",
        "source": "T26n1525_006:0260b28_18"
    },
    {
        "source_sentence": "此明何義？",
        "translation": "What does this explain?",
        "source": "T26n1525_006:0260b28_19"
    },
    {
        "source_sentence": "以依清淨持戒之力，是故能捨「以捨力故，諸所求法皆悉成就。",
        "translation": "It's because of the power of purely observing precepts that they can abandon it. Because of the power of abandonment, all the things they seek will be accomplished.",
        "source": "T26n1525_006:0260b29_20"
    },
    {
        "source_sentence": "是故如來說戒施後，次說迴向方便。",
        "translation": "That's why the Tathāgata teaches that after giving precepts, he next explains the method of dedication of merit.",
        "source": "T26n1525_006:0260c01_21"
    },
    {
        "source_sentence": "是故如來修多羅中說，持戒人所願所作皆悉成就。",
        "translation": "That's why the Tathāgata says in the sūtra, Whatever a person who observes precepts wishes to do, they'll accomplish it.",
        "source": "T26n1525_006:0260c02_22"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T26n1525_006:0260c03_23"
    },
    {
        "source_sentence": "戒清淨故。」",
        "translation": "It's because the precepts are pure.",
        "source": "T26n1525_006:0260c03_24"
    },
    {
        "source_sentence": "彌勒菩薩所問經論卷第六",
        "translation": "Treatise on the Sutra of the Questions Asked by Maitreya, Volume 6",
        "source": "T26n1525_006:0260c05_0"
    }
]