[
    {
        "source_sentence": "阿毘達磨品類足論卷第九",
        "translation": "Abhidharma-mahāprajñāpāramitā-śāstra, vol. 9",
        "source": "T26n1542_009:0726b10_0"
    },
    {
        "source_sentence": "尊者世友造",
        "translation": "created by the venerable secular friend",
        "source": "T26n1542_009:0726b12_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T26n1542_009:0726b13_0"
    },
    {
        "source_sentence": "辯攝等品第六之五",
        "translation": "sixth and fifth parts of the chapter on eloquence and so forth",
        "source": "T26n1542_009:0726b14_0"
    },
    {
        "source_sentence": "異生法法，十八界十二處五蘊攝，八智知除滅道智，六識識，欲色界一切隨眠隨增。",
        "translation": "The dharmas of ordinary people are included in the five aggregates of the eighteen realms and twelve locations, the eight kinds of cognition that remove cessation and knowledge of the path, the six consciousnesses, and all the latent tendencies and increases in the desire realm and form realms.",
        "source": "T26n1542_009:0726b15_0"
    },
    {
        "source_sentence": "非異生法法，十一界十處五蘊攝，十智知，四識識，三界遍行及修所斷隨眠隨增。",
        "translation": "It's not an ordinary dharma that's included in the five aggregates of the 11 realms, 10 places, 10 knowledges, 4 consciousnesses, 3 realms, pervasive and cultivated tendencies, and latencies that are eliminated by practitioners.",
        "source": "T26n1542_009:0726b16_1"
    },
    {
        "source_sentence": "共異生法，十八界十二處五蘊攝，八智知除滅道智，六識識，一切隨眠隨增。",
        "translation": "In common with ordinary dharmas, the five aggregates of the eighteen realms and twelve locations are included in the five dharmas, the eight kinds of cognition that remove cessation and knowledge of the path, and the six consciousnesses, all which follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0726b18_2"
    },
    {
        "source_sentence": "不共異生法，十一界十處五蘊攝，十智知，四識識，三界遍行及修所斷隨眠隨增。",
        "translation": "The dharmas unique to ordinary beings are the eleven realms, ten places, five aggregates, ten knowledges, four consciousnesses, three realms, pervasive and cultivated tendencies, and latencies that are eliminated by cultivation.",
        "source": "T26n1542_009:0726b20_3"
    },
    {
        "source_sentence": "定法，五界四處五蘊攝，九智知除滅智，三識識，欲界遍行及修所斷隨眠隨增。",
        "translation": "The factors of samdhi are the five realms, four locations and five aggregates that are included in nine kinds of cognition with the exception of cessation cognition, three forms of consciousness, pervasive formations in the desire realm, and latencies that are eliminated by cultivation.",
        "source": "T26n1542_009:0726b22_4"
    },
    {
        "source_sentence": "非定法，十八界十二處五蘊攝，九智知除道智，六識識，一切隨眠隨增。",
        "translation": "It's not a determined dharma, which is included in the five aggregates of the 18 realms and 12 places, nine cognitions that remove knowledge of the path, and six consciousnesses that all follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0726b24_0"
    },
    {
        "source_sentence": "順熱惱法，十界四處五蘊攝，八智知除滅道智，三識識，一切隨眠隨增。",
        "translation": "Consistent with the factors of fever, the ten realms, four locations, and five aggregates are included in the eight kinds of cognition that remove cessation and path cognition, and the three consciousnesses all follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0726b25_1"
    },
    {
        "source_sentence": "非順熱惱法，十八界十二處五蘊攝，十智知，六識識，三界遍行及修所斷隨眠隨增。",
        "translation": "They do not conform to the factors of feverishness and distress. The five aggregates of the eighteen elements, twelve sense-fields and ten knowledges are included in the ten knowledges and six forms of consciousness. The pervasive forces of the three realms and the proclivities that are abandoned through Meditation increase accordingly.",
        "source": "T26n1542_009:0726b27_2"
    },
    {
        "source_sentence": "根法，十三界七處四蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "The faculties and dharmas are subsumed in the four aggregates of the 13 realms and seven places, nine cognitions that know extinction except for cessation, and one consciousness that increases with all the latent tendencies.",
        "source": "T26n1542_009:0726b29_3"
    },
    {
        "source_sentence": "非根法，六界六處三蘊攝，十智知，六識識，一切隨眠隨增。",
        "translation": "It's not a faculty that's included in the three aggregates of the six realms and six locations, which are known by the ten kinds of cognition and the six consciousnesses, and all follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0726c01_4"
    },
    {
        "source_sentence": "聖諦所攝法，十八界十二處五蘊攝，十智知，六識識，一切隨眠隨增。",
        "translation": "The dharmas that are included in the noble truths are subsumed in the five aggregates of the 18 realms and 12 locations, which are known by the ten kinds of cognition and the six consciousnesses, and all follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0726c02_5"
    },
    {
        "source_sentence": "非聖諦所攝法，一界一處非蘊攝，一智知謂世俗智，一識識，非隨眠隨增。",
        "translation": "They are not factors that are included in the noble truths: one realm and one place are not included in the aggregates; one knowledge is worldly knowledge; one consciousness, not latent and subsequently increasing.",
        "source": "T26n1542_009:0726c04_6"
    },
    {
        "source_sentence": "俱有法，十八界十二處五蘊攝，九智知除滅智，六識識，一切隨眠隨增。",
        "translation": "The eighteen dhātus and twelve āyatanas are included in five sandhas: the nine knowledges of cessation with the exception of the knowledge of destruction; the six consciousnesses, all accompanied by dormancy and subsequently increasing.",
        "source": "T26n1542_009:0726c06_7"
    },
    {
        "source_sentence": "非俱有法，一界一處非蘊攝，六智知除他心苦集道智，一識識，非隨眠隨增。",
        "translation": "The dharmas that are not co-existent, one realm and one place aren't included in the aggregates, six kinds of cognition know each other's mind as suffering, accumulation, path, and wisdom, and one consciousness doesn't follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0726c07_8"
    },
    {
        "source_sentence": "相應法，八界二處四蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "Concomitant dharmas are the eight realms, two locations, and four aggregates that are included in the nine kinds of cognition except cessation cognition, and one consciousness, all which follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0726c09_9"
    },
    {
        "source_sentence": "不相應法，十一界十一處二蘊攝，九智知除他心智，六識識，三界有漏緣隨眠隨增。",
        "translation": "The dharmas that are not conjoined with it are subsumed in eleven realms and eleven sense-fields: the two aggregates of nine knowledges, namely knowledge of the mind of another and knowledge of the mind of another; the six conscious constructs of consciousness; the three realms have impure supporting objects which follow dormancy and increase.",
        "source": "T26n1542_009:0726c10_10"
    },
    {
        "source_sentence": "果法，十八界十二處五蘊攝，十智知，六識識，一切隨眠隨增。",
        "translation": "The dharmas as fruits are included in the five aggregates of the eighteen realms, twelve places, ten knowledges, and six consciousnesses, all which follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0726c12_11"
    },
    {
        "source_sentence": "非果法，一界一處非蘊攝，一智知謂世俗智，一識識，非隨眠隨增。",
        "translation": "They are not dharmas as fruits: one realm and one place are not included in the aggregates. One knowledge of knowing means worldly knowledge; one consciousness is not accompanied by dormancy or by increase.",
        "source": "T26n1542_009:0726c14_12"
    },
    {
        "source_sentence": "有果法，十八界十二處五蘊攝，九智知除滅智，六識識，一切隨眠隨增。",
        "translation": "The dharmas with fruit are the five aggregates of the eighteen realms and twelve locations, nine knowledges that remove cessation cognition, and six consciousnesses that all follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0726c15_13"
    },
    {
        "source_sentence": "無果法，一界一處非蘊攝，六智知除他心苦集道智，一識識，非隨眠隨增。",
        "translation": "In the dharmas without fruit, one realm and one place aren't included in the aggregates, six kinds of cognition know that they remove other minds from suffering, accumulation, and path cognition, and one consciousness doesn't follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0726c17_14"
    },
    {
        "source_sentence": "異熟法，十七界十一處五蘊攝，八智知除滅道智，五識識，三界遍行及修所斷隨眠隨增。",
        "translation": "The dharmas as retribution are included in the five aggregates of the seventeen realms and eleven locations, the eight kinds of cognition that remove knowledge of cessation and knowledge of the path, the five consciousnesses, the pervasive activity of the three realms, and the latencies that are eliminated by cultivation and increase accordingly.",
        "source": "T26n1542_009:0726c18_15"
    },
    {
        "source_sentence": "非異熟法，十八界十二處五蘊攝，十智知，六識識，一切隨眠隨增。",
        "translation": "The dharmas that are not retribution are the five aggregates of the eighteen realms and twelve locations, the ten knowledges, the six consciousnesses, and all the accompanying dormancies that increase accordingly.",
        "source": "T26n1542_009:0726c20_16"
    },
    {
        "source_sentence": "有異熟法，十界四處五蘊攝，八智知除滅道智，三識識，欲界一切色無色界遍行及修所斷隨眠隨增。",
        "translation": "There are ripening dharmas that are included in the five aggregates of the four places in the ten realms, the eight kinds of cognition that know and remove cessation and knowledge of the path, the three kinds of consciousness, all the pervasive form and formless realms in the desire realm, and the latent tendencies and subsequent dormancy that are eliminated by cultivation.",
        "source": "T26n1542_009:0726c22_17"
    },
    {
        "source_sentence": "無異熟法，十八界十二處五蘊攝，十智知，六識識，色無色界一切欲界二部，及見集所斷遍行隨眠隨增。",
        "translation": "There are no ripening dharmas, the five aggregates of the 18 realms and 12 places, the ten knowledges, the six consciousnesses, all the two parts of the desire realm in the form and formless realms, and the pervasive tendencies that are eliminated by seeing and accumulating, which follow dormancy and increase.",
        "source": "T26n1542_009:0726c24_18"
    },
    {
        "source_sentence": "因緣法，十八界十二處五蘊攝，十智知，六識識，一切隨眠隨增。",
        "translation": "Conditioned dharmas are the five aggregates of the eighteen realms and twelve locations, the ten cognitive knowings, the six consciousnesses, and all the accompanying dormancies that increase accordingly.",
        "source": "T26n1542_009:0726c26_19"
    },
    {
        "source_sentence": "非因緣法，非界非處非蘊攝，非智知，非識識，非隨眠隨增，以如是法不可得故。",
        "translation": "It's not a conditioned dharma that's not included in realms, places, or aggregates, isn't known by cognition, isn't conscious of consciousness, and doesn't follow dormancy and increase because such a dharma is unobtainable.",
        "source": "T26n1542_009:0726c28_20"
    },
    {
        "source_sentence": "有因緣法，十八界十二處五蘊攝，九智知除滅智，六識識，一切隨眠隨增。",
        "translation": "There are causal dharmas that are included in the five aggregates of the eighteen realms and twelve locations, nine knowledges that remove cessation cognition, and six consciousnesses that all follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0727a01_0"
    },
    {
        "source_sentence": "無因緣法，一界一處非蘊攝，六智知除他心苦集道智，一識識，非隨眠隨增。",
        "translation": "In the dharmas without causes and conditions, one realm and one place aren't included in the aggregates, six kinds of cognition know that they remove other minds from suffering, accumulation, and path cognition, and one consciousness doesn't follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0727a02_1"
    },
    {
        "source_sentence": "離法，五界四處五蘊攝，十智知，三識識，三界遍行及修所斷隨眠隨增。",
        "translation": "Being free of dharmas, the five realms, four locations, and five aggregates are included in the ten kinds of cognition, the three consciousnesses, pervasively functioning in the three realms, and the latencies that are cultivated and eliminated.",
        "source": "T26n1542_009:0727a04_2"
    },
    {
        "source_sentence": "非離法，十八界十二處五蘊攝，八智知除滅道智，六識識，一切隨眠隨增。",
        "translation": "Not separate from dharmas, the five aggregates of the eighteen realms and twelve locations, the eight kinds of cognition that remove cessation and path cognition, and the six consciousnesses are all accompanied by dormancy and increase.",
        "source": "T26n1542_009:0727a05_3"
    },
    {
        "source_sentence": "有離法，十八界十二處五蘊攝，九智知除滅智，六識識，一切隨眠隨增。",
        "translation": "There are separate dharmas that are included in the five aggregates of the eighteen realms and twelve locations, nine knowledges that remove cessation cognition, and six consciousnesses that all follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0727a07_4"
    },
    {
        "source_sentence": "無離法，一界一處非蘊攝，六智知除他心苦集道智，一識識，非隨眠隨增。",
        "translation": "There are no separate dharmas, one realm and one place that aren't included in the aggregates, six kinds of cognition that know other minds apart from suffering, accumulation, and path cognition, and one consciousness that doesn't follow dormancy and increase.",
        "source": "T26n1542_009:0727a09_5"
    },
    {
        "source_sentence": "相續法，十八界十二處五蘊攝，九智知除滅智，六識識，一切隨眠隨增。",
        "translation": "dharmas of the stream, which are included in the five aggregates of the eighteen realms and twelve locations, nine knowledges that remove cessation cognition, and six consciousnesses that all follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0727a10_6"
    },
    {
        "source_sentence": "非相續法，十八界十二處五蘊攝，十智知，六識識，一切隨眠隨增。",
        "translation": "It is not a factor arising in succession: it is included in the five aggregates of eighteen elements, twelve places and ten knowledges; it knows the ten knowledges and six forms of consciousness. All [factors] follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0727a12_7"
    },
    {
        "source_sentence": "有相續、無相續法亦爾。",
        "translation": "So it is with the dharmas that are continuous and those that are not continuous.",
        "source": "T26n1542_009:0727a13_8"
    },
    {
        "source_sentence": "善法，十界四處五蘊攝，十智知，三識識，三界遍行及修所斷隨眠隨增。",
        "translation": "Good dharmas are subsumed in the ten realms, four locations, five aggregates, ten cognitions, three consciousnesses, pervasive activity in the three realms, and latencies that are eliminated by cultivation that increase accordingly.",
        "source": "T26n1542_009:0727a15_0"
    },
    {
        "source_sentence": "不善法，十界四處五蘊攝，七智知除類滅道智，三識識，欲界一切隨眠隨增。",
        "translation": "Bad dharmas are included in the ten realms, four locations, and five aggregates, seven kinds of cognition that knows extinction and path cognition, three kinds of consciousness, and all the latent tendencies and increases in the desire realm.",
        "source": "T26n1542_009:0727a16_1"
    },
    {
        "source_sentence": "無記法，十八界十二處五蘊攝，八智知除滅道智，六識識，色無色界一切欲界二部，及見集所斷遍行隨眠隨增。",
        "translation": "Indeterminate dharmas are the five aggregates of the eighteen realms and twelve locations, the eight kinds of cognition that remove cessation and path cognition, the six consciousnesses, all the two parts of the desire realm in the form and formless realms, and the pervasive tendencies that are eliminated by seeing and accumulating and followed by dormancy and increase.",
        "source": "T26n1542_009:0727a18_2"
    },
    {
        "source_sentence": "學無學法，三界二處五蘊攝，七智知除苦集滅智，一識識，非隨眠隨增。",
        "translation": "The factors of training and post-learning are included in the three realms, two places, and five aggregates, with seven kinds of cognition that remove suffering, accumulation, cessation, and wisdom, and one consciousness that doesn't follow dormancy and increase.",
        "source": "T26n1542_009:0727a20_3"
    },
    {
        "source_sentence": "非學非無學法，十八界十二處五蘊攝，九智知除道智，六識識，一切隨眠隨增。",
        "translation": "The factors neither still having learning to do nor having no more learning to do are included in the five aggregates of the eighteen elements and twelve sense-fields: nine knowledges that know everything but the knowledge of the path; six forms of consciousness, all with subsequent dormancy and successively increasing.",
        "source": "T26n1542_009:0727a22_4"
    },
    {
        "source_sentence": "見所斷法，三界二處四蘊攝，八智知除滅道智，一識識，三界見所斷一切隨眠隨增。",
        "translation": "The factors to be eliminated by insight are included in the three realms, two places, and four aggregates. Eight knowledges of cessation and one knowledge of the path [to cessation] are with one form of consciousness. All the secondary passions that are eliminated by insight into the three realms increase accordingly.",
        "source": "T26n1542_009:0727a24_5"
    },
    {
        "source_sentence": "修所斷法，十八界十二處五蘊攝，八智知除滅道智，六識識，三界修所斷一切及遍行隨眠隨增。",
        "translation": "The factors to be eliminated by cultivation are included in the five aggregates of the eighteen realms and twelve locations, the eight kinds of cognition that remove cessation and knowledge of the path, the six forms of consciousness, all those eliminated by cultivation in the three realms, and pervasive latencies and subsequent increases.",
        "source": "T26n1542_009:0727a26_6"
    },
    {
        "source_sentence": "非所斷法，三界二處五蘊攝，八智知除苦集智，一識識，非隨眠隨增。",
        "translation": "The dharmas that are not to be eliminated are included in the three realms, two places, and five aggregates, eight kinds of cognition that remove suffering and accumulate cognition, and one form of consciousness that doesn't follow dormancy and increase.",
        "source": "T26n1542_009:0727a28_7"
    },
    {
        "source_sentence": "見所斷為因法，十八界十二處五蘊攝，八智知除滅道智，六識識，一切隨眠隨增。",
        "translation": "They are the causal factors that are stopped by seeing, which are included in the five aggregates of the 18 realms and 12 places, the eight kinds of cognition that remove cessation and path cognition, and the six consciousnesses, all accompanied by dormancy and increase accordingly.",
        "source": "T26n1542_009:0727a29_8"
    },
    {
        "source_sentence": "修所斷為因法，十八界十二處五蘊攝，八智知除滅道智，六識識，三界修所斷一切及遍行隨眠隨增。",
        "translation": "The five dharmas that are cultivated and eliminated as causes are the five aggregates of the eighteen realms, twelve places, eight kinds of cognition that remove cessation and path cognition, six forms of consciousness, all the consciousnesses in the three realms that are cultivated and all the pervasive latencies that are eliminated by cultivation.",
        "source": "T26n1542_009:0727b02_9"
    },
    {
        "source_sentence": "非所斷為因法，三界二處五蘊攝，七智知除苦集滅智，一識識，非隨眠隨增。",
        "translation": "The three realms, two places and five aggregates are included in seven knowledges: the knowledge of frustration, the one of the origin and the one of cessation. One form of consciousness does not increase subsequently to dormancy.",
        "source": "T26n1542_009:0727b04_10"
    },
    {
        "source_sentence": "有見有對法，一界一處一蘊攝，七智知除他心滅道智，二識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "There are views and opposing dharmas, which are subsumed in one realm, one place, and one aggregate, seven kinds of cognition that know the path to cessation except for the mind of another, two kinds of consciousness, pervasive activity in the form realm of desire, and latent tendencies and subsequent dormancy that are eliminated by cultivation.",
        "source": "T26n1542_009:0727b07_0"
    },
    {
        "source_sentence": "無見有對法，九界九處一蘊攝，七智知除他心滅道智，五識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "There are no views and opposing dharmas, the nine realms and nine locations that are included in one aggregate, seven cognitions that know the path to cessation of mind except for other minds, and five consciousnesses that pervade the desire realm and increase with pervasive activity and latencies that are eliminated by cultivation.",
        "source": "T26n1542_009:0727b09_1"
    },
    {
        "source_sentence": "無見無對法，八界二處五蘊攝，十智知，一識識，一切隨眠隨增。",
        "translation": "There are no views and no opposing dharmas, eight realms, two places, five aggregates, ten kinds of cognition, one consciousness, and all the latent tendencies that follow it.",
        "source": "T26n1542_009:0727b11_2"
    },
    {
        "source_sentence": "異熟法，十七界十一處五蘊攝，八智知除滅道智，五識識，三界遍行及修所斷隨眠隨增。",
        "translation": "The dharmas as retribution are included in the five aggregates of the seventeen realms and eleven locations, the eight kinds of cognition that remove knowledge of cessation and knowledge of the path, the five consciousnesses, the pervasive activity of the three realms, and the latencies that are eliminated by cultivation and increase accordingly.",
        "source": "T26n1542_009:0727b12_3"
    },
    {
        "source_sentence": "異熟法法，十界四處五蘊攝，八智知除滅道智，三識識，欲界一切色無色界遍行及修所斷隨眠隨增。",
        "translation": "Dharma and dharmas as retribution are the five aggregates of the four places in the ten realms, the eight kinds of cognition that remove knowledge of cessation and knowledge of the path, the three kinds of consciousness, all the form and formless realms in the desire realm, pervasive actions and latencies that are eliminated by cultivation.",
        "source": "T26n1542_009:0727b14_4"
    },
    {
        "source_sentence": "非異熟非異熟法法，十八界十二處五蘊攝，十智知，六識識，色無色界一切，欲界二部及見集所斷遍行隨眠隨增。",
        "translation": "The dharmas that are neither retribution nor non-retribution are included in the five aggregates of the 18 realms, 12 places, 10 knowledges, 6 consciousnesses, all of the form and formless realms, two parts in the desire realm, and pervasive latencies and dormancies that are eliminated by seeing and accumulating.",
        "source": "T26n1542_009:0727b17_5"
    },
    {
        "source_sentence": "劣法，十界四處五蘊攝，八智知除滅道智，三識識，一切隨眠隨增。",
        "translation": "The weak dharmas are the ten realms, four places, and five aggregates that are included in the eight kinds of cognition except for cessation and path cognition, and the three consciousnesses, which all follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0727b19_6"
    },
    {
        "source_sentence": "中法，十八界十二處五蘊攝，八智知除滅道智，六識識，三界遍行及修所斷隨眠隨增。",
        "translation": "In the middle dharma, the five aggregates of the eighteen realms and twelve locations are included, the eight kinds of cognition that remove cessation and path cognition, the six consciousnesses, the pervasive activity of the three realms, and the latencies that are eliminated by cultivation increase accordingly.",
        "source": "T26n1542_009:0727b21_7"
    },
    {
        "source_sentence": "妙法，三界二處五蘊攝，八智知除苦集智，一識識，非隨眠隨增。",
        "translation": "The marvelous teaching is that the three realms, two places, and five aggregates are subsumed in eight kinds of cognition to remove suffering and accumulate cognition, and one form of consciousness isn't followed by dormancy or increase.",
        "source": "T26n1542_009:0727b23_8"
    },
    {
        "source_sentence": "小法、大法，十八界十二處五蘊攝，九智知除滅智，六識識，一切隨眠隨增。",
        "translation": "The lesser dharmas and great dharmas are subsumed in the five aggregates of the eighteen realms and twelve places, nine knowledges that remove cessation cognition, and six consciousnesses that all follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0727b24_9"
    },
    {
        "source_sentence": "無量法、可意法、不可意法、非可意非不可意法，十八界十二處五蘊攝，十智知，六識識，一切隨眠隨增。",
        "translation": "Measureless dharmas, desirable dharmas, undesirable dharmas, and neither desirable nor undesirable dharmas are included in the five aggregates of the 18 realms and 12 locations, which are known by the ten kinds of cognition, the six consciousnesses, and all the latencies that follow and increase accordingly.",
        "source": "T26n1542_009:0727b26_10"
    },
    {
        "source_sentence": "樂俱行法，八界二處三蘊攝，九智知除滅智，一識識，色界一切，除欲界無漏緣疑及彼相應無明識，餘欲界一切隨眠隨增，苦俱行法，八界二處三蘊攝，七智知除類滅道智，一識識，欲界一切隨眠隨增。",
        "translation": "The dharmas that are accompanied by pleasure and the dharmas that are accompanied by suffering are included in the three aggregates of the eight realms, two places and nine kinds of cognition except cessation cognition, one consciousness, all of the form realm, except for doubt with uncontaminated conditions in the desire realm and ignorance consciousness associated with it, all the other",
        "source": "T26n1542_009:0727b28_11"
    },
    {
        "source_sentence": "不苦不樂俱行法，八界二處三蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "The factors arising simultaneously with neither-unpleasant-nor-unpleasant are the eight realms, two places, and three aggregates, nine knowledges that remove cessation of cognition, and one consciousness that all follows dormancy and increase.",
        "source": "T26n1542_009:0727c04_12"
    },
    {
        "source_sentence": "俱生法、俱住法、俱滅法，十八界十二處五蘊攝，九智知除滅智，六識識，一切隨眠隨增。",
        "translation": "The dharmas that arise together, the dharmas that abide together, and the dharmas that cease together are included in the five aggregates of the eighteen realms and twelve places, the nine kinds of cognition except cessation cognition, and the six consciousnesses, which all follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0727c05_13"
    },
    {
        "source_sentence": "非俱生法、非俱住法、非俱滅法，一界一處非蘊攝，六智知除他心苦集道智，一識識，非隨眠隨增。",
        "translation": "The dharmas that aren't co-arisen, the dharmas that aren't co-abiding, and the dharmas that aren't co-ceasing are not included in a single realm or place that aren't included in an aggregate, the knowledge of the six kinds of cognition that removes the minds of others with the knowledge of suffering, accumulation, and the knowledge of the path, and",
        "source": "T26n1542_009:0727c07_14"
    },
    {
        "source_sentence": "心俱生法，十一界十一處四蘊攝，九智知除滅智，六識識，一切隨眠隨增。",
        "translation": "The dharmas that arise together with mind are subsumed in the four aggregates of eleven realms and eleven locations, nine kinds of cognition except cessation cognition, and six kinds of consciousness, all accompanied by dormancy and increase.",
        "source": "T26n1542_009:0727c10_0"
    },
    {
        "source_sentence": "心俱住法，一界一處四蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "The dharmas that abide together with mind are subsumed in one realm and one location by the four aggregates, which are known by nine cognitions except cessation cognition, and one consciousness, all of which follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0727c11_1"
    },
    {
        "source_sentence": "心俱滅法，十界十處四蘊攝，九智知除滅智，五識識，一切隨眠隨增。",
        "translation": "The dharmas that are extinguished at the same time as mind, which are included in the four aggregates of the ten realms and ten locations, nine cognitions that remove knowledge of cessation, and five consciousnesses that all follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0727c13_2"
    },
    {
        "source_sentence": "非心俱生法、非心俱住法、非心俱滅法，十八界十二處三蘊攝，十智知，六識識，一切隨眠隨增。",
        "translation": "dharmas that aren't produced together with mind, dharmas that abide together with mind and dharmas that cease together with mind, the three aggregates of the eighteen realms and twelve places, the ten kinds of cognition, the six consciousnesses, and all the latent tendencies and subsequent increases.",
        "source": "T26n1542_009:0727c14_3"
    },
    {
        "source_sentence": "欲界，十界四處五蘊攝，七智知除類滅道智，三識識，欲界有漏緣隨眠隨增。",
        "translation": "In the realm of sexual passion, the ten realms are included in four residences and five aggregates. The seven knowledges know that they are with exception for the one of cessation and the one of the path. They are with three forms of consciousness:",
        "source": "T26n1542_009:0727c17_0"
    },
    {
        "source_sentence": "恚界亦爾。",
        "translation": "So it is with the coarse realm.",
        "source": "T26n1542_009:0727c18_1"
    },
    {
        "source_sentence": "害界，五界四處五蘊攝，七智知除類滅道智，三識識，欲界遍行及修所斷隨眠隨增。",
        "translation": "harmful realm: the five realms, four places and five aggregates are included in seven knowledges of cognition that remove types of cessation and knowledge of the path, three consciousnesses, pervasive volition in the desire realm, and latent tendencies and subsequently increasing latencies that are eliminated by cultivation.",
        "source": "T26n1542_009:0727c18_2"
    },
    {
        "source_sentence": "出離界，十界四處五蘊攝，十智知，三識識，三界遍行及修所斷隨眠隨增。",
        "translation": "The realm of liberation, which is subsumed in the five aggregates of the ten realms and four locations, knows the ten kinds of cognition, the three consciousnesses, the pervasive activity of the three realms, and the latencies that are eliminated by cultivation increase accordingly.",
        "source": "T26n1542_009:0727c20_3"
    },
    {
        "source_sentence": "無恚界、無害界，十界四處五蘊攝，九智知除滅智，三識識，三界遍行及修所斷隨眠隨增。",
        "translation": "The absence of anger and the absence of harmfulness are included in the ten realms, the four places and five aggregates, nine kinds of cognition that remove knowledge of cessation, three kinds of consciousness, pervasive activity in the three realms, and latencies that are eliminated by cultivation and increase accordingly.",
        "source": "T26n1542_009:0727c22_4"
    },
    {
        "source_sentence": "欲界，十八界十二處五蘊攝，七智知除類滅道智，六識識，欲界一切隨眠隨增。",
        "translation": "In the realm of sexual passion, the five aggregates of the eighteen realms and twelve residences are included: seven knowledges that know exceptions to the ones of cessation and path knowledge; six forms of consciousness in the realm of sexual passion with all subsequent dormancy and successively increasing.",
        "source": "T26n1542_009:0727c24_5"
    },
    {
        "source_sentence": "色界，十四界十處五蘊攝，七智知除法滅道智，四識識，色界一切隨眠隨增。",
        "translation": "In the form realm, the fourteen realms and ten locations of the five aggregates are included in seven kinds of cognition that know the path to cessation except for knowledge of the Dharma and four kinds of consciousness, which all follow dormancy and increase in the form realm.",
        "source": "T26n1542_009:0727c26_6"
    },
    {
        "source_sentence": "無色界，三界二處四蘊攝，六智知除法他心滅道智，一識識，無色界一切隨眠隨增。",
        "translation": "In the formless realm, the three realms, two locations, and four aggregates are included in six kinds of cognition that knows the path to cessation except for the mind of other things, and one kind of consciousness that increases with all latent tendencies in the formless realm.",
        "source": "T26n1542_009:0727c28_0"
    },
    {
        "source_sentence": "欲界、色界名色界者，十八界十二處五蘊攝，八智知除滅道智，六識識，欲色界一切隨眠隨增。",
        "translation": "“The realm of sexual passion and the one of form are called ‘the realm of form’: The eighteen elements, twelve residences and five aggregates*!®” include the knowledge of cessation by means of the eight knowledges and the knowledge of the path; the six forms of consciousness - all subsequent dormancy and subsequent increase in the realm of sexual passion and in the one of form.",
        "source": "T26n1542_009:0727c29_1"
    },
    {
        "source_sentence": "四無色名無色界者，三界二處四蘊攝，六智知除法他心滅道智，一識識，無色界一切隨眠隨增。",
        "translation": "The four formless realms are called formless realms because the three realms, two locations, and four aggregates are included in the six kinds of cognition that know the path to cessation except for the knowledge of the mind of others with respect to phenomena, and one consciousness that follows and increases all the latencies in the formless realm.",
        "source": "T26n1542_009:0728a03_0"
    },
    {
        "source_sentence": "擇滅、非擇滅名滅界者，一界一處非蘊攝，六智知除他心苦集道智，一識識，非隨眠隨增。",
        "translation": "“ Cessation resulting from discrimination and cessation resulting from non-discriminating are called ‘the element cessation’: Because one element is not included in the aggregates at one place or another. The six knowledges know that, exception made for the awareness of another, there is the knowledge of frustration, the one of the origin and the one of the path. They are with one form of consciousness as supporting object",
        "source": "T26n1542_009:0728a05_1"
    },
    {
        "source_sentence": "復次一切色法總名色界者，十一界十一處一蘊攝，八智知除他心滅智，六識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "“Furthermore, all factors matter are in general called ‘form realm’: The eleven elements and the eleven residences are included in one aggregate. Eight knowledges know that it is with exception for the knowledge of cessation of awarenesses of another. Six forms of consciousness”:",
        "source": "T26n1542_009:0728a07_2"
    },
    {
        "source_sentence": "除擇滅非擇滅，諸餘非色法總名無色界者，八界二處四蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "“Exception made for cessation resulting from discrimination and not cessation resulting from discrimination”: The other formless factors are generally called the realm of formlessness”: The eight elements, two residences and four aggregates are included in nine knowledges.",
        "source": "T26n1542_009:0728a09_3"
    },
    {
        "source_sentence": "擇滅、非擇滅總名滅界，如前說。",
        "translation": "Cessation resulting from discrimination and cessation resulting from non-discriminating are collectively called the element of cessation as explained above.",
        "source": "T26n1542_009:0728a12_4"
    },
    {
        "source_sentence": "欲有，十八界十二處五蘊攝，七智知除類滅道智，六識識，欲界一切隨眠隨增。",
        "translation": "Desire exists in the five aggregates of the eighteen realms and twelve locations, seven kinds of cognition that knows extinction except for cessation and path cognition, and six forms of consciousness that all follow dormancy and increase in the desire realm.",
        "source": "T26n1542_009:0728a12_5"
    },
    {
        "source_sentence": "色有，十四界十處五蘊攝，七智知除法滅道智，四識識，色界一切隨眠隨增。",
        "translation": "Form exists, which is included in the fourteen realms, ten locations, five aggregates, seven kinds of cognition that knows the path to cessation except for knowledge of things, and four kinds of consciousness that all follow dormancy and increase in the form realm.",
        "source": "T26n1542_009:0728a14_6"
    },
    {
        "source_sentence": "無色有，三界二處四蘊攝，六智知除法他心滅道智，一識識，無色界一切隨眠隨增。",
        "translation": "In the formless realm, there are three realms, two locations, and four aggregates that are included in six kinds of cognition, knowledge of the path to the cessation of mind excepting dharmas and other minds, and one kind of consciousness that increases with all latent tendencies in the formless realm.",
        "source": "T26n1542_009:0728a16_7"
    },
    {
        "source_sentence": "欲漏，一界一處一蘊攝，七智知除類滅道智，一識識，欲界一切隨眠隨增。",
        "translation": "The contaminants of sexual passion are subsumed in one realm, one place and one aggregate: seven knowledges that know the path to cessation with exception of the one of cessation as a species; one form of consciousness - all subsequently existing dormancies*”®’ of the realm of sexual passion increase successively.",
        "source": "T26n1542_009:0728a18_8"
    },
    {
        "source_sentence": "有漏，一界一處一蘊攝，七智知除法滅道智，一識識，色無色界一切隨眠隨增。",
        "translation": "Impure, one realm, one place and one aggregate are included: seven knowledges that know the path to cessation of factors exception made for knowledge of cognition of cessation of factors; one form and one formless realm - all subsequent dormancy and subsequent increase.",
        "source": "T26n1542_009:0728a19_9"
    },
    {
        "source_sentence": "無明漏，一界一處一蘊攝，八智知除滅道智，一識識，除無漏緣無明，諸餘一切隨眠隨增。",
        "translation": "The impure influence of ignorance is included in one realm, one location, and one aggregate: the eight knowledges are with an awareness of cessation and a knowledge of the path. One form of consciousness has ignorance as its uncontaminated supporting object; all other secondary passions follow and increase accordingly.",
        "source": "T26n1542_009:0728a21_10"
    },
    {
        "source_sentence": "三世三言依事，十八界十二處五蘊攝，九智知除滅智，六識識，一切隨眠隨增。",
        "translation": "The three worlds and the three verbal supports are included in the five aggregates of the eighteen realms, twelve locations, nine knowledges that remove cessation cognition, and six consciousnesses, all which follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0728a24_0"
    },
    {
        "source_sentence": "欲界由苦苦故苦者，十八界十二處五蘊攝，七智知除類滅道智，六識識，欲界一切隨眠隨增。",
        "translation": "“In the realm of sexual passion, it is because of frustration and because of frustration that there is frustration”: In the eighteen realms, twelve forms of existence and five aggregates are included. The seven knowledges in relation to cognition - exception made for the one of cessation of beings with specific characteristic marks?®*°; the six consciousnesses in relation to all subsequent dormancy and subsequent",
        "source": "T26n1542_009:0728a25_1"
    },
    {
        "source_sentence": "色界由壞苦故苦者，十四界十處五蘊攝，七智知除法滅道智，四識識，色界一切隨眠隨增。",
        "translation": "“In the realm of form, suffering is due to disintegration and therefore unsatisfactoriness”: The four consciousnesses are included in seven knowledges with knowledge of cessation of factors exception made for knowledge of the law. In the realm of form, all subsequent dormancies increase successively.",
        "source": "T26n1542_009:0728a27_2"
    },
    {
        "source_sentence": "無色界由行苦故苦者，三界二處四蘊攝，六智知除法他心滅道智，一識識，無色界一切隨眠隨增。",
        "translation": "“In the one of formlessness, it is because of proceeding in frustration”: The three realms, two residences and four aggregates are included: six knowledges that know exception made for the knowledge of the cessation of awareness of a factor by another; one consciousness. In the one of formlessness, all subsequent dormancies increase successively.",
        "source": "T26n1542_009:0728a29_3"
    },
    {
        "source_sentence": "復次不可意諸行由苦苦故苦、可意諸行由壞苦故苦、非可意非不可意諸行由行苦故苦苦者，皆十八界十二處五蘊攝，八智知除滅道智，六識識，一切隨眠隨增。",
        "translation": "Furthermore, conditioned forces that are unpleasant because they are painful due to suffering and unsatisfactory because they are painful; conditioned forces that are agreeable because they are painful by reason of the destruction of suffering; and neither agreeable nor disagreeable conditioned forces that are painful or unsatisfactory because they are painful by reason of the suffering of these eighteen dharmas are all subsumed in",
        "source": "T26n1542_009:0728b03_4"
    },
    {
        "source_sentence": "復次苦受由苦苦故苦者，一界一處一蘊攝，七智知除類滅道智，一識識，欲界一切隨眠隨增。",
        "translation": "“Furthermore, the feeling of frustration because of frustration”: With one realm, one place and one aggregate”, it is with seven knowledges that are knowledge of cessation and knowledge of the path to cessation as exceptions. One form of consciousness - all subsequent dormancy and successively increasing in the realm of sexual passion®*?",
        "source": "T26n1542_009:0728b06_5"
    },
    {
        "source_sentence": "樂受由壞苦故苦者，一界一處一蘊攝，八智知除滅道智，一識識，色界一切，除欲界無漏緣疑及彼相應無明，諸餘欲界一切隨眠隨增。",
        "translation": "“Suffering of satisfaction and feeling because of the disintegration of frustration”: One realm, one place and one aggregate are included. The knowledge of eight knowledges is with the exception of the knowledge of cessation and the knowledge of the path; one consciousness - all in the realm of form - exception made for perplexity and ignorance associated with it as an outflow-free supporting object?®*!°",
        "source": "T26n1542_009:0728b09_6"
    },
    {
        "source_sentence": "不苦不樂受由行苦故苦者，一界一處一蘊攝，八智知除滅道智，一識識，一切隨眠隨增。",
        "translation": "The neither-unpleasant-nor-unpleasant feeling that is painful because of the suffering of volition means that it's subsumed in one realm, one place, and one aggregate, which has eight kinds of cognition that remove the knowledge of cessation and the path, and one consciousness that increases with all the latencies.",
        "source": "T26n1542_009:0728b12_7"
    },
    {
        "source_sentence": "有尋有伺法，八界二處四蘊攝，九智知除滅智，一識識，欲色界一切隨眠隨增。",
        "translation": "With the factors of discursive and discursive dharmas, the eight realms, two places, and four aggregates are included in the nine kinds of cognition except cessation cognition, and one form of consciousness that follows and increases all the latencies in the desire realm and form.",
        "source": "T26n1542_009:0728b14_8"
    },
    {
        "source_sentence": "無尋唯伺法，三界二處四蘊攝，九智知除滅智，一識識，欲色界一切隨眠隨增。",
        "translation": "The dharmas of non discursive examination and only the dharmas of discursive examination are included in the three realms, two places, and four aggregates, nine kinds of cognition except cessation cognition, and one form of consciousness, which increases with all the latencies that follow them in the desire realm and form realm.",
        "source": "T26n1542_009:0728b15_9"
    },
    {
        "source_sentence": "無尋無伺法，十三界十二處五蘊攝，十智知，六識識，色無色界一切欲界有漏緣隨眠隨增。",
        "translation": "The dharmas of neither discursive thought nor discursive examination are subsumed in the five aggregates of the 13 realms, 12 places, 10 knowledges, 6 consciousnesses, and all the contaminated conditions that follow dormancy and increase in all the desire realms in the form and formless realms.",
        "source": "T26n1542_009:0728b17_10"
    },
    {
        "source_sentence": "有尋有伺地，十八界十二處五蘊攝，九智知除滅智，六識識，欲色界一切隨眠隨增。",
        "translation": "In the stages of discursive examination and discursive examination, the five aggregates of the eighteen realms and twelve locations are included in nine kinds of knowledge that removes cessation cognition, six kinds of consciousness, and all the latent tendencies in the desire realm and form increase accordingly.",
        "source": "T26n1542_009:0728b19_11"
    },
    {
        "source_sentence": "無尋唯伺地，三界二處五蘊攝，九智知除滅智，一識識，色界遍行及修所斷隨眠隨增。",
        "translation": "There is no discursive examination but only the stage of sustained thought. The three realms, two spheres and five aggregates are included in nine knowledges: exception made for the knowledge of cessation; one consciousness:",
        "source": "T26n1542_009:0728b21_12"
    },
    {
        "source_sentence": "無尋無伺地，十一界十處五蘊攝，九智知除滅智，四識識，色無色界一切隨眠隨增。",
        "translation": "In the stages of neither discursive thought nor discursive examination, the eleven realms, ten places, and five aggregates are included in nine kinds of cognition except cessation cognition, four kinds of consciousness, and all the latencies that follow and increase in the form and formless realms.",
        "source": "T26n1542_009:0728b23_13"
    },
    {
        "source_sentence": "身業，二界二處一蘊攝，八智知除他心滅智，二識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "bodily action is included in two realms, two places and one aggregate: the knowledge of cessation of awarenesses of another by means of eight knowledges; two forms of consciousness by means of two knowledges. The pervasive formations of the realm of sexual passion and of the one of form are as well as the anuśayas which are to be abandoned through Meditation®*!",
        "source": "T26n1542_009:0728b26_0"
    },
    {
        "source_sentence": "語業亦爾。",
        "translation": "So it is with verbal action.",
        "source": "T26n1542_009:0728b27_1"
    },
    {
        "source_sentence": "意業，一界一處一蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "mental action, which is subsumed in one realm, one place, and one aggregate, with nine knowledges that remove cessation of cognition, and one consciousness, all the accompanying dormancies increase accordingly.",
        "source": "T26n1542_009:0728b28_2"
    },
    {
        "source_sentence": "善業，三界三處二蘊攝，九智知除滅智，三識識，三界遍行及修所斷隨眠隨增。",
        "translation": "Good karma is included in the three realms, three locations, and two aggregates, nine knowledges of cognition except cessation, three consciousnesses, pervasive activity in the three realms, and latencies that are eliminated by cultivation.",
        "source": "T26n1542_009:0728b29_3"
    },
    {
        "source_sentence": "不善業，三界三處二蘊攝，七智知除類滅道智，三識識，欲界一切隨眠隨增。",
        "translation": "Bad karma, which is included in the three realms and three locations of the two aggregates, has seven kinds of cognition that are free of cessation and path cognition, three kinds of consciousness, and all the latent tendencies and increases in the desire realm.",
        "source": "T26n1542_009:0728c02_4"
    },
    {
        "source_sentence": "無記業，三界三處二蘊攝，八智知除滅道智，三識識，色無色界一切，欲界三部，及見集所斷遍行隨眠隨增。",
        "translation": "Indeterminate karma, the three realms and three places are included in two aggregates, the eight kinds of cognition that remove cessation and path cognition, the three consciousnesses, all things in the form and formless realms, the three parts in the desire realm, and pervasive latencies and dormancy that are eliminated by seeing and accumulating.",
        "source": "T26n1542_009:0728c04_5"
    },
    {
        "source_sentence": "學業、無學業，一界一處二蘊攝，七智知除苦集滅智，一識識，非隨眠隨增。",
        "translation": "The action of the seeker and the action of the adept are included in one realm, one place and two aggregates. Seven knowledges know exceptions to the knowledge of frustration, the one of the origin and the one of cessation. One consciousness does not follow dormancy and subsequently increase.",
        "source": "T26n1542_009:0728c06_6"
    },
    {
        "source_sentence": "非學非無學業，三界三處二蘊攝，八智知除滅道智，三識識，一切隨眠隨增。",
        "translation": "neither still having learning to do nor having no more learning to do; three realms, three places and two aggregates are included in the three realms of rebirth. The eight knowledges know that it is with the exception of the knowledge of cessation and the one of the path. Three forms of consciousness all subsequently abide and increase accordingly.",
        "source": "T26n1542_009:0728c08_7"
    },
    {
        "source_sentence": "見所斷業，一界一處一蘊攝，八智知除滅道智，一識識，三界見所斷一切隨眠隨增。",
        "translation": "Action to be abandoned through vision is that which is included in one realm, one place and one aggregate. The eight knowledges are with the knowledge of cessation and the knowledge of the path; one form of consciousness. All the secondary passions®*”!° that are to be abandoned through the vision of the three realms increase successively.",
        "source": "T26n1542_009:0728c09_8"
    },
    {
        "source_sentence": "修所斷業，三界三處二蘊攝，八智知除滅道智，三識識，三界修所斷一切及遍行隨眠隨增。",
        "translation": "Karma to be eliminated by cultivation is included in the three realms, three places, two aggregates, eight knowledges that remove cessation and path knowledge, three consciousnesses, all of which are eliminated by cultivation in the three realms, and pervasive latencies and subsequent increases.",
        "source": "T26n1542_009:0728c11_9"
    },
    {
        "source_sentence": "非所斷業，一界一處二蘊攝，七智知除苦集滅智，一識識，非隨眠隨增。",
        "translation": "In the case of karma not to be eliminated, one realm and one location are included in two aggregates, seven knowledges that know suffering, arising and ceasing cognition, and one consciousness that doesn't follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0728c13_10"
    },
    {
        "source_sentence": "順現法受業、順次生受業、順後次受業，三界三處二蘊攝，八智知除滅道智，三識識，欲界一切，色無色界遍行，及修所斷隨眠隨增。",
        "translation": "karma received in the present life, karma received in subsequent lifetimes, and karma received in subsequent lifetimes are included in the three realms, three places, two aggregates, eight kinds of cognition that remove knowledge of cessation and knowledge of the path, three forms of consciousness, all sentient beings in the desire realm, pervasively functioning in the form and formless realms, and following dormancy",
        "source": "T26n1542_009:0728c15_11"
    },
    {
        "source_sentence": "順樂受業，三界三處二蘊攝，八智知除滅道智，三識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "karma that's received according to pleasure, which is included in the three realms and three locations of the two aggregates, the eight kinds of cognition that removes cessation and knowledge of the path, the three forms of consciousness, pervasive activity in the desire realm and the latencies that are cultivated and eliminated in the form realm.",
        "source": "T26n1542_009:0728c18_12"
    },
    {
        "source_sentence": "順苦受業，三界三處二蘊攝，七智知除類滅道智，三識識，欲界一切隨眠隨增。",
        "translation": "karma that's received in response to suffering, which is included in the three realms and three locations of the two aggregates, seven kinds of cognition that knows extinguishing cessation and path cognition, and three forms of consciousness that increase with all latent tendencies in the desire realm.",
        "source": "T26n1542_009:0728c20_13"
    },
    {
        "source_sentence": "順不苦不樂業，一界一處二蘊攝，七智知除法滅道智，一識識，色無色界遍行及修所斷隨眠隨增。",
        "translation": "Consistent with karma that's neither painful nor pleasant, one realm, one place, and two aggregates are included in seven kinds of cognition, except for the knowledge of the path to cessation of dharmas, and one consciousness, which is pervasive in the form and formless realms and increases along with the latencies that are eliminated by cultivation.",
        "source": "T26n1542_009:0728c22_14"
    },
    {
        "source_sentence": "身念住，十一界十一處一蘊攝，八智知除他心滅智，六識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "The abode of bodily mindfulness, which is subsumed in eleven realms and 11 locations as one aggregate, has eight kinds of cognition that know the cessation of mind except for other minds, six kinds of consciousness, pervasive activity in the desire realm and form, and latencies that are eliminated by cultivation and increase accordingly.",
        "source": "T26n1542_009:0728c24_15"
    },
    {
        "source_sentence": "受念住，一界一處一蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "The abode of feeling and mindfulness, which are subsumed in one realm, one place, and one aggregate, has nine kinds of cognition that remove the knowledge of cessation, and one consciousness that increases with all the latencies.",
        "source": "T26n1542_009:0728c26_16"
    },
    {
        "source_sentence": "心念住，七界一處一蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "The mind is the abode of mindfulness, which consists of seven realms, one place, and one aggregate, nine kinds of cognition that remove knowledge of cessation, and one consciousness that increases with all its latent tendencies.",
        "source": "T26n1542_009:0728c28_17"
    },
    {
        "source_sentence": "法念住，一界一處二蘊攝，十智知，一識識，一切隨眠隨增。",
        "translation": "The mindful abiding of dharmas is subsumed in one realm, one location, two aggregates, ten knowledges, and one consciousness, all accompanied by dormancy and increase.",
        "source": "T26n1542_009:0728c29_18"
    },
    {
        "source_sentence": "復次身受心法增上所起善有漏無漏道，三界二處五蘊攝，九智知除滅智，一識識，三界遍行及修所斷隨眠隨增。",
        "translation": "Furthermore, the wholesome, impure and pure paths that arise from the increase in body, sensation, mind, and dharmas are included in the three realms, two places, and five aggregates, nine knowledges of cognition that remove cessation of cognition, one consciousness, three realms of consciousness, pervasive activity, and latencies that are cultivated and eliminated by cultivation",
        "source": "T26n1542_009:0729a01_19"
    },
    {
        "source_sentence": "復次緣身受心法所起善有漏無漏慧，一界一處一蘊攝，九智知除滅智，一識識，三界遍行及修所斷隨眠隨增。",
        "translation": "Furthermore, the wholesome, impure and pure wisdom that arises in relation to body, feeling, mind and dharmas is subsumed in one realm, one location, and one aggregate; nine knowledges are known with the exception of knowledge of cessation; one consciousness is a consciousness; the pervasive activity of the three realms and the proclivities eliminated by cultivation are successively",
        "source": "T26n1542_009:0729a04_20"
    },
    {
        "source_sentence": "四正斷、四神足，三界二處五蘊攝，九智知除滅智，一識識，三界遍行及修所斷隨眠隨增。",
        "translation": "The four that are correctly eliminated and the four that have supernormal powers, which are subsumed in the three realms, two locations, and five aggregates, nine knowledges of cognition except cessation, one consciousness, and one consciousness with universal activity in the three realms and latencies that are eliminated by cultivation and increase accordingly.",
        "source": "T26n1542_009:0729a07_21"
    },
    {
        "source_sentence": "四靜慮，三界二處五蘊攝，九智知除滅智，一識識，色界遍行及修所斷隨眠隨增。",
        "translation": "The four forms of trance are that which is included in three realms, two residences and five aggregates. Nine knowledges know the extinction of cessation (knowledge of cessation) by means of nine knowledges.",
        "source": "T26n1542_009:0729a09_22"
    },
    {
        "source_sentence": "苦集聖諦，十八界十二處五蘊攝，八智知除滅道智，六識識，一切隨眠隨增。",
        "translation": "The noble truth of suffering and arising is that it's included in the five aggregates of the 18 realms and 12 places, the eight kinds of cognition that remove cessation and knowledge of the path, and the six consciousnesses, all of which are accompanied by dormancy and increase.",
        "source": "T26n1542_009:0729a10_23"
    },
    {
        "source_sentence": "滅聖諦，一界一處非蘊攝，六智知除他心苦集道智，一識識，非隨眠隨增。",
        "translation": "The noble truth of cessation is that one realm and one place aren't included in the aggregates, six kinds of cognition know the knowledge of removing other minds from suffering, accumulation, and paths, and one kind of consciousness doesn't follow dormancy and increase.",
        "source": "T26n1542_009:0729a12_24"
    },
    {
        "source_sentence": "道聖諦，三界二處五蘊攝，七智知除苦集滅智，一識識，非隨眠隨增。",
        "translation": "The noble truth of the path, which is subsumed in the three realms, two places, and five aggregates, has seven kinds of cognition that remove suffering, accumulation, cessation, and wisdom, and a single consciousness that doesn't follow dormancy and increase.",
        "source": "T26n1542_009:0729a14_25"
    },
    {
        "source_sentence": "四無量，三界二處五蘊攝，七智知除法滅道智，一識識，色界遍行及修所斷隨眠隨增。",
        "translation": "The four immeasurable, the three realms, two locations, and five aggregates are included in seven kinds of cognition that know the path to cessation of dharmas and one kind of consciousness, which are pervasive in the form realm and increase with subsequent dormancy and latencies that are eliminated by cultivation.",
        "source": "T26n1542_009:0729a15_26"
    },
    {
        "source_sentence": "空無邊處、識無邊處、無所有處，三界二處四蘊攝，七智知除法他心滅智，一識識，無色界一切隨眠隨增。",
        "translation": "The boundless realm of emptiness, the boundless realm of consciousness, and the sphere of nothingness are subsumed in the three realms, two places, and four aggregates, seven kinds of cognition that know the cessation of other minds except for dharmas, one consciousness, and all the formless realms of consciousness with all their latencies and subsequent increases",
        "source": "T26n1542_009:0729a17_27"
    },
    {
        "source_sentence": "非想非非想處，三界二處四蘊攝，六智知除法他心滅道智，一識識，無色界一切隨眠隨增。",
        "translation": "The sphere of neither-thought-nor-non-thought, the three realms, two places, and four aggregates are included in six kinds of cognition that knows the cessation of mind except for dharmas and other minds, and one formless realm of consciousness that follows and increases all latencies.",
        "source": "T26n1542_009:0729a20_28"
    },
    {
        "source_sentence": "四聖種，三界二處五蘊攝，九智知除滅智，一識識，三界遍行及修所斷隨眠隨增。",
        "translation": "The four noble seeds are included in the three realms, two locations, and five aggregates, nine knowledges of cognition that remove cessation, one knowledge of consciousness, and one consciousness of consciousness that pervades the three realms and increases along with the latencies that are eliminated by cultivation.",
        "source": "T26n1542_009:0729a22_29"
    },
    {
        "source_sentence": "有為四沙門果，三界二處五蘊攝，七智知除苦集滅智，一識識，非隨眠隨增。",
        "translation": "The conditioned fruit of Sramana-ship is fourfold: it is included in three realms, two spheres, and five aggregates. With the exception of the knowledge of unsatisfactoriness, the one of arising and the one of cessation are with seven knowledges. One form of consciousness does not increase subsequently to dormancy.",
        "source": "T26n1542_009:0729a24_30"
    },
    {
        "source_sentence": "無為四沙門果，一界一處非蘊攝，六智知除他心苦集道智，一識識，非隨眠隨增。",
        "translation": "The unconditioned ones are the fruit of four forms of Sramana-ship. One realm and one place are not included in the aggregates; six knowledges know that they remove the awarenesses of others as to frustration, the one of the origin and the one of the path; and one consciousness does not follow dormancy and subsequently increase.",
        "source": "T26n1542_009:0729a25_31"
    },
    {
        "source_sentence": "法智，一界一處一蘊攝，六智知除類苦集滅智，一識識，非隨眠隨增。",
        "translation": "The knowledge of dharmas, which is subsumed in one realm, one place, and one aggregate, has six kinds of cognition that remove suffering, accumulation, and cessation, and a single consciousness that doesn't follow dormancy and increase.",
        "source": "T26n1542_009:0729a27_32"
    },
    {
        "source_sentence": "類智，一界一處一蘊攝，六智知除法苦集滅智，一識識，非隨眠隨增。",
        "translation": "Consciousness of the same type, which is subsumed in one realm, one location, and one aggregate, has six kinds of cognition that know suffering, accumulation, and cessation except for dharmas, and a single consciousness that doesn't follow dormancy or increase.",
        "source": "T26n1542_009:0729a29_33"
    },
    {
        "source_sentence": "他心智，一界一處一蘊攝，九智知除滅智，一識識，色界遍行及修所斷隨眠隨增。",
        "translation": "The knowledge of the mind of another is subsumed in one realm, one location, and one aggregate. Nine knowledges are to be known with the exception of the knowledge of cessation.",
        "source": "T26n1542_009:0729b01_34"
    },
    {
        "source_sentence": "世俗智，一界一處一蘊攝，八智知除滅道智，一識識，除無漏緣見諸餘一切隨眠隨增。",
        "translation": "conventional cognition, which is included in one realm, one place, and one aggregate, the eight kinds of cognition that remove cessation and path cognition, and one consciousness that removes all other latent tendencies and increases along with it except for uncontaminated conditioned views.",
        "source": "T26n1542_009:0729b03_35"
    },
    {
        "source_sentence": "苦集滅道智，一界一處一蘊攝，七智知除苦集滅智，一識識，非隨眠隨增。",
        "translation": "The knowledge of suffering, its arising and cessation, and the knowledge of the path are subsumed in one realm, one place, and one aggregate; the seven knowledges know that they remove the knowledge of suffering, its arising and cessation, and one consciousness does not follow dormancy or increase.",
        "source": "T26n1542_009:0729b05_36"
    },
    {
        "source_sentence": "法無礙解，一界一處一蘊攝，八智知除滅道智，一識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "Unhindered understanding of dharmas, which are subsumed in one realm, one place, and one aggregate, the eight kinds of cognition that remove cessation and knowledge of the path, a single consciousness, pervasively functioning in the desire realm and the latencies that are cultivated and eliminated in the desire realm.",
        "source": "T26n1542_009:0729b07_37"
    },
    {
        "source_sentence": "詞無礙解亦爾。",
        "translation": "So it is with unobstructed understanding of words.",
        "source": "T26n1542_009:0729b09_38"
    },
    {
        "source_sentence": "義無礙解，一界一處一蘊攝，九智知除滅智，一識識，三界遍行及修所斷隨眠隨增。",
        "translation": "The meaning of unhindered understanding is that one realm, one place, and one aggregate are subsumed in nine kinds of cognition except cessation cognition, one consciousness, the pervasive activity of the three realms, and the latencies that are eliminated by cultivation increase accordingly.",
        "source": "T26n1542_009:0729b09_39"
    },
    {
        "source_sentence": "辯無礙解亦爾。",
        "translation": "So it is with unhindered understanding of eloquence.",
        "source": "T26n1542_009:0729b11_40"
    },
    {
        "source_sentence": "因緣，十八界十二處五蘊攝，九智知除滅智，六識識，一切隨眠隨增。",
        "translation": "As a cause and condition, the five aggregates of the eighteen realms and twelve locations are included in the nine kinds of cognition except cessation cognition, and the six consciousnesses all follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0729b12_0"
    },
    {
        "source_sentence": "等無間緣，八界二處四蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "Equanimous and immediately antecedent conditions, the eight realms, two locations, and four aggregates are subsumed in nine knowledges that remove cessation of cognition, and one consciousness, all which follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0729b13_1"
    },
    {
        "source_sentence": "所緣緣增上緣，十八界十二處五蘊攝，十智知，六識識，一切隨眠隨增。",
        "translation": "The eighteen dhātus, twelve āyatanas, and five dharmas are the predominant condition as object. They are known by the ten knowledges and by six forms of consciousness. All subsequent dormancy follows and increases accordingly.",
        "source": "T26n1542_009:0729b15_2"
    },
    {
        "source_sentence": "段食，三界三處一蘊攝，六智知除類他心滅道智，四識識，欲界遍行及修所斷隨眠隨增。",
        "translation": "partial nutriment: the three realms, three residences and one aggregate. Six knowledges are with the knowledge of extinguishing the awarenesses of another in relation to cessation®*”’; four knowledges arise subsequently when proceeding pervasively in the realm of sexual passion as well as the proclivities that are to be abandoned through personal realisation.",
        "source": "T26n1542_009:0729b16_3"
    },
    {
        "source_sentence": "觸食、意思食，一界一處一蘊攝，八智知除滅道智，一識識，一切隨眠隨增。",
        "translation": "The food of contact and the food of thought are subsumed in one realm, one place, and one aggregate, with the eight kinds of cognition that remove the knowledge of cessation and the path, and one consciousness that all follows dormancy and increase.",
        "source": "T26n1542_009:0729b18_4"
    },
    {
        "source_sentence": "識食，七界一處一蘊攝，八智知除滅道智，一識識，一切隨眠隨增。",
        "translation": "Consciousness is the nutriment of consciousness, which consists of seven elements that are subsumed in one place and one aggregate, eight kinds of cognition that remove cessation and knowledge of the path, and one consciousness that increases with all its latencies.",
        "source": "T26n1542_009:0729b20_5"
    },
    {
        "source_sentence": "欲瀑流，一界一處一蘊攝，七智知除類滅道智，一識識，欲界一切隨眠隨增。",
        "translation": "The flood of desire, which is subsumed in one realm, one place, and one aggregate, has seven kinds of cognition that remove the knowledge of cessation and paths, and one consciousness that follows and increases all the latencies in the desire realm.",
        "source": "T26n1542_009:0729b22_0"
    },
    {
        "source_sentence": "有瀑流，一界一處一蘊攝，七智知除法滅道智，一識識，色無色界一切隨眠隨增。",
        "translation": "There are floods, which are subsumed in one realm, one place, and one aggregate, with seven kinds of cognition that remove the knowledge of cessation of dharmas and paths, a single consciousness, and all the latent tendencies and subsequent increases in the form and formless realms.",
        "source": "T26n1542_009:0729b23_1"
    },
    {
        "source_sentence": "見瀑流，一界一處一蘊攝，八智知除滅道智，一識識，三界見所斷有漏緣，及見相應無漏緣無明隨眠隨增。",
        "translation": "The floods of views are subsumed in one realm, one location, and one aggregate. Eight knowledges know the extinction of cessation and path knowledge; one is with one form of consciousness. These three realms have pure supporting objects that are to be abandoned through vision®*” as supporting object:",
        "source": "T26n1542_009:0729b25_2"
    },
    {
        "source_sentence": "無明瀑流，一界一處一蘊攝，八智知除滅道智，一識識，除無漏緣無明諸餘一切隨眠隨增。",
        "translation": "The flood of nescience, which is subsumed in one realm, one place, and one aggregate, has eight kinds of cognition that remove the knowledge of cessation and the path, and one consciousness that removes all the other latent tendencies and subsequent increases except for the uncontaminated condition of ignorance.",
        "source": "T26n1542_009:0729b28_3"
    },
    {
        "source_sentence": "如四瀑流，四軛亦爾。",
        "translation": "Like the four streams of water, so are the four rivers.",
        "source": "T26n1542_009:0729c01_4"
    },
    {
        "source_sentence": "欲取，一界一處一蘊攝，七智知除類滅道智，一識識，欲界一切隨眠隨增。",
        "translation": "The grasping of desire is one realm, one place and one aggregate that's included in seven kinds of cognition except for the cognition of cessation and path, and one consciousness that increases with all the latent tendencies in the desire realm.",
        "source": "T26n1542_009:0729c01_5"
    },
    {
        "source_sentence": "見取，一界一處一蘊攝，八智知除滅道智，一識識，三界見所斷有漏緣，及無漏緣見相應無明隨眠隨增。",
        "translation": "Seeing and grasping are subsumed in one realm, one place, one aggregate, eight kinds of cognition that remove the knowledge of cessation and the path, one consciousness, three realms of views that have contaminated perceptual objects that are stopped by seeing, and uncontaminated perceptual objects associated with ignorance and latencies that increase accordingly.",
        "source": "T26n1542_009:0729c03_6"
    },
    {
        "source_sentence": "戒禁取，一界一處一蘊攝，八智知除滅道智，一識識，三界見苦所斷一切，見集所斷遍行、見道所斷有漏緣隨眠隨增。",
        "translation": "adherence to precepts and prohibitions, which are subsumed in one realm, one place, and one aggregate, eight kinds of cognition that know the path to cessation and remove it, one consciousness, all of which are eliminated by seeing suffering in the three realms, pervasive formations that are eliminated by seeing accumulation and pervasive formations that are eliminated by seeing the path",
        "source": "T26n1542_009:0729c05_7"
    },
    {
        "source_sentence": "我語取，一界一處一蘊攝，七智知除法滅道智，一識識，色無色界一切隨眠隨增。",
        "translation": "grasping of self and speech, which are included in one realm, one place, and one aggregate, seven kinds of cognition that know the path to cessation of dharmas and one kind of cognition, and one form and one formless realm with all the latencies and subsequent increases.",
        "source": "T26n1542_009:0729c08_8"
    },
    {
        "source_sentence": "過去法、未來法、現在法，十八界十二處五蘊攝，九智知除滅智，六識識，一切隨眠隨增。",
        "translation": "Past dharmas, future dharmas and present dharmas are subsumed in the five aggregates of the eighteen realms, twelve locations, nine kinds of cognition that remove knowledge of cessation, and six consciousnesses that all follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0729c10_9"
    },
    {
        "source_sentence": "非過去非未來非現在法，一界一處非蘊攝，六智知除他心苦集道智，一識識，非隨眠隨增。",
        "translation": "It's not past, future, or present dharmas, one realm and one place aren't included in the aggregates, six kinds of cognition know that they're except for the suffering, accumulation, and path knowledge of other minds, and one consciousness doesn't follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0729c12_10"
    },
    {
        "source_sentence": "欲界繫法，十八界十二處五蘊攝，七智知除類滅道智，六識識，欲界一切隨眠隨增。",
        "translation": "The factors bound to the realm of sexual passion are included in the five aggregates of eighteen realms and twelve places: seven knowledges that know, exception made for the knowledge of cessation of the path®*°; six forms of consciousness which all subsequently abide in the realm of sexual passion and increase successively.",
        "source": "T26n1542_009:0729c14_11"
    },
    {
        "source_sentence": "色界繫法，十四界十處五蘊攝，七智知除法滅道智，四識識，色界一切隨眠隨增。",
        "translation": "The form realm is fettered by dharmas, which are subsumed in the five aggregates of the fourteen realms and ten locations, seven cognitions that know the path to cessation except for the cessation of dharmas, and four consciousnesses that all follow dormancy and increase in the form realm.",
        "source": "T26n1542_009:0729c16_12"
    },
    {
        "source_sentence": "無色界繫法，三界二處四蘊攝，六智知除法他心滅道智，一識識，無色界一切隨眠隨增。",
        "translation": "The formless realm is fettered by dharmas, which are included in the three realms, two places, and four aggregates, six cognitions that know the path to cessation except for the mind of another who knows the Dharma, and one consciousness that follows and increases all the latencies in the formless realm.",
        "source": "T26n1542_009:0729c18_0"
    },
    {
        "source_sentence": "不繫法，三界二處五蘊攝，八智知除苦集智，一識識，非隨眠隨增。",
        "translation": "The dharmas that aren't fetters are included in the three realms, two places, and five aggregates, eight kinds of cognition that remove suffering and accumulate cognition, and one kind of consciousness that doesn't follow dormancy and increase.",
        "source": "T26n1542_009:0729c20_0"
    },
    {
        "source_sentence": "善為因法，十八界十二處五蘊攝，九智知除滅智，六識識，三界遍行及修所斷隨眠隨增。",
        "translation": "Good is the causal factor, which consists of the five aggregates of the eighteen realms and twelve locations, nine knowledges that remove cessation cognition, six consciousnesses, three realms, pervasive activity, and latencies that are eliminated by cultivation and increase accordingly.",
        "source": "T26n1542_009:0729c21_1"
    },
    {
        "source_sentence": "不善為因法，十八界十二處五蘊攝，七智知除類滅道智，六識識，欲界一切隨眠隨增。",
        "translation": "The unwholesome are the causal factors, which are included in the five aggregates of the eighteen realms and twelve locations, the seven knowledges that know the path to cessation except for cognition of types, and the six consciousnesses that follow and increase all the latencies in the desire realm.",
        "source": "T26n1542_009:0729c23_2"
    },
    {
        "source_sentence": "無記為因法，十八界十二處五蘊攝，八智知除滅道智，六識識，一切隨眠隨增。",
        "translation": "Indeterminate dharmas are the causal factors, which are included in the five aggregates of the eighteen realms and twelve places, the eight kinds of cognition that remove cessation and path cognition, and the six consciousnesses, all of which follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0729c25_3"
    },
    {
        "source_sentence": "非善為因非不善為因非無記為因法，一界一處非蘊攝，六智知除他心苦集道智，一識識，非隨眠隨增。",
        "translation": "What's not good as cause, what's not unwholesome as cause, and what's not indeterminate as cause are the causes of dharmas, one realm and one place aren't included in the aggregates, six kinds of cognition know that they're except for the knowledge of other minds, suffering, accumulation, and paths, and one consciousness isn't followed by dormancy",
        "source": "T26n1542_009:0729c27_4"
    },
    {
        "source_sentence": "緣有所緣法，三界二處四蘊攝，九智知除滅智，一識識，三界有為緣隨眠隨增。",
        "translation": "Conditioned dharmas that have conditions as objects are included in the three realms, two locations, and four aggregates, nine knowledges that remove cessation of cognition, one consciousness, and three realms with conditioned conditions that follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0729c29_5"
    },
    {
        "source_sentence": "緣無所緣法，八界二處四蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "Conditioned by dharmas that have no perceptual objects, the eight realms, two places, and four aggregates are included in the nine kinds of cognition except cessation cognition, and one consciousness, all which follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0730a02_6"
    },
    {
        "source_sentence": "緣有所緣緣無所緣法，三界二處四蘊攝，九智知除滅智，一識識，三界有為緣隨眠隨增。",
        "translation": "Conditioned and conditioned, conditioned and unconditioned dharmas are included in the three realms, two locations, and four aggregates, nine kinds of cognition that remove knowledge of cessation, and one form of consciousness that follows and increases with latencies as conditioned conditions in the three realms.",
        "source": "T26n1542_009:0730a04_7"
    },
    {
        "source_sentence": "非緣有所緣非緣無所緣法，十一界十一處二蘊攝，九智知除他心智，六識識，三界有漏緣隨眠隨增。",
        "translation": "Conditioned dharmas that are neither conditioned nor unconditioned, which are included in the 11 realms and 11 locations of the two aggregates, nine kinds of cognition that remove knowledge of other minds, six forms of consciousness, and three realms with contaminated conditions that follow dormancy and increase.",
        "source": "T26n1542_009:0730a06_8"
    },
    {
        "source_sentence": "色蘊，十一界十一處一蘊攝，八智知除他心滅智，六識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "The aggregate of form, which is subsumed in eleven realms and 11 locations as one aggregate, has eight kinds of cognition that know the cessation of mind except for other minds, six kinds of consciousness, pervasive activity in the desire realm and form, and latencies that are eliminated by cultivation and increase accordingly.",
        "source": "T26n1542_009:0730a08_9"
    },
    {
        "source_sentence": "受蘊，一界一處一蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "The aggregate of sensation, which is subsumed in one realm, one place, and one aggregate, has nine kinds of cognition that remove the knowledge of cessation, and one consciousness that increases with all the latent tendencies.",
        "source": "T26n1542_009:0730a10_10"
    },
    {
        "source_sentence": "想蘊行蘊亦爾。",
        "translation": "So it is with the aggregate of perception and the aggregate of volition.",
        "source": "T26n1542_009:0730a11_11"
    },
    {
        "source_sentence": "識蘊，七界一處一蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "The aggregate of consciousness, which consists of seven realms, one place, and one aggregate, is subsumed by nine kinds of cognition except cessation cognition, and a single consciousness that increases with all the latencies.",
        "source": "T26n1542_009:0730a12_12"
    },
    {
        "source_sentence": "色取蘊，十一界十一處一蘊攝，七智知除他心滅道智，六識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "The form-grasping aggregate, which is subsumed in eleven realms and eleven locations as one aggregate, has seven kinds of cognition that know the path to cessation of mind except for other minds, six kinds of consciousness, pervasively functioning in the desire realm and following dormancy that's cultivated and eliminated in the desire realm.",
        "source": "T26n1542_009:0730a13_13"
    },
    {
        "source_sentence": "受取蘊，一界一處一蘊攝，八智知除滅道智，一識識，一切隨眠隨增。",
        "translation": "The aggregate of feeling and grasping, which is subsumed in one realm, one place, and one aggregate, the eight kinds of cognition that remove cessation and path cognition, and one consciousness, all follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0730a15_14"
    },
    {
        "source_sentence": "想取蘊、行取蘊亦爾。",
        "translation": "So it is with the aggregate of grasping perception and the aggregate of grasping volition.",
        "source": "T26n1542_009:0730a17_15"
    },
    {
        "source_sentence": "識取蘊，七界一處一蘊攝，八智知除滅道智，一識識，一切隨眠隨增。",
        "translation": "The consciousness-grasping aggregate, which consists of seven realms and one place in one aggregate, eight kinds of cognition that remove the knowledge of cessation and the path, and one consciousness, all accompanied by dormancy and increase.",
        "source": "T26n1542_009:0730a17_16"
    },
    {
        "source_sentence": "地獄趣，十八界十二處五蘊攝，七智知除類滅道智，六識識，欲界一切隨眠隨增。",
        "translation": "In the hell realms, the five aggregates of the eighteen realms and twelve locations are included in seven kinds of cognition that knows the path to cessation except for knowledge of types, six kinds of consciousness, and all the latent tendencies and increases in the desire realm.",
        "source": "T26n1542_009:0730a19_17"
    },
    {
        "source_sentence": "傍生趣、鬼趣、人趣亦爾。",
        "translation": "So it is with the destinies of animals, ghosts, and humans.",
        "source": "T26n1542_009:0730a21_18"
    },
    {
        "source_sentence": "天趣，十八界十二處五蘊攝，八智知除滅道智，六識識，三界一切隨眠隨增。",
        "translation": "The heavenly destinies are included in the five aggregates of the eighteen realms and twelve locations, the eight kinds of cognition that remove cessation and knowledge of the path, the six consciousnesses, and all the latencies and increases in the three realms.",
        "source": "T26n1542_009:0730a21_19"
    },
    {
        "source_sentence": "見苦所斷煩惱部，一界一處一蘊攝，八智知除滅道智，一識識，三界見苦所斷一切及見集所斷遍行隨眠隨增。",
        "translation": "The part of defilement to be abandoned through the vision of frustration is that which is included in one realm, one place and one aggregate. One knowledge knows with eight knowledges: exception made for the knowledge of cessation and the one of the path; one form of consciousness*!®” - all that are to be abandoned through the three realms by the vision of frustration or by the pervasive doctrineTM",
        "source": "T26n1542_009:0730a23_20"
    },
    {
        "source_sentence": "見集所斷煩惱部，一界一處一蘊攝，八智知除滅道智，一識識，三界見集所斷一切及見苦所斷遍行隨眠隨增。",
        "translation": "The part of defilement to be abandoned through the vision of the origin is that which is included in one realm, one place and one aggregate. One knowledge knows with eight knowledges: exception made for the knowledge of cessation and the one of the path.",
        "source": "T26n1542_009:0730a25_21"
    },
    {
        "source_sentence": "見滅所斷煩惱部，一界一處一蘊攝，八智知除滅道智，一識識，三界見滅所斷一切及遍行隨眠隨增。",
        "translation": "The part of defilement to be abandoned through the vision of cessation is that which is included in one realm, one place and one aggregate. One knowledge knows with eight knowledges exception made for the knowledge of cessation and one knowledge of the path.",
        "source": "T26n1542_009:0730a28_22"
    },
    {
        "source_sentence": "見道所斷煩惱部，一界一處一蘊攝，八智知除滅道智，一識識，三界見道所斷一切及遍行隨眠隨增。",
        "translation": "In the group of defilement to be abandoned through the path of vision, one realm, one place and one aggregate are included. The knowledge of cessation by means of eight knowledges is excluded from the knowledge of the path of cessation.",
        "source": "T26n1542_009:0730b01_23"
    },
    {
        "source_sentence": "修所斷煩惱部，一界一處一蘊攝，八智知除滅道智，一識識，三界修所斷一切及遍行隨眠隨增。",
        "translation": "The defilement that is to be abandoned through the spiritual path consists of one realm, one sphere, and one aggregate. It is made up of eight knowledges with the exception of the knowledge of cessation and the knowledge of the path.",
        "source": "T26n1542_009:0730b04_24"
    },
    {
        "source_sentence": "色法，十一界十一處一蘊攝，八智知除他心滅智，六識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "Form dharmas, which are subsumed in eleven realms and 11 places in one aggregate, eight kinds of cognition that know the cessation of mind except for other minds, six kinds of consciousness, pervasive activity in the desire realm and form, and latencies and subsequent increases in what's eliminated by cultivation.",
        "source": "T26n1542_009:0730b06_25"
    },
    {
        "source_sentence": "心法，七界一處一蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "The mind and dharmas are subsumed in seven realms, one location, one aggregate, nine knowledges that remove cessation of cognition, and one consciousness, all which follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0730b08_26"
    },
    {
        "source_sentence": "心所法，一界一處三蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "The dharmas of the mind are subsumed in one realm, one place, and three aggregates: nine knowledges that know extinction with the exception of cessation; one consciousness which knows all subsequent dormancy and increases accordingly.",
        "source": "T26n1542_009:0730b09_27"
    },
    {
        "source_sentence": "心不相應行法，一界一處一蘊攝，八智知除他心滅智，一識識，三界有漏緣隨眠隨增。",
        "translation": "The accompanying mental factors dissociated from awarenesses are one realm, one place and one aggregate: eight knowledges that know the cessation of awarenesses exception made for the awareness of another; one form of consciousnessTM*!. In three realms, it is with an impure supporting object®” as subsequent dormancy and successively increasing.",
        "source": "T26n1542_009:0730b11_28"
    },
    {
        "source_sentence": "無為法，一界一處非蘊攝，六智知除他心苦集道智，一識識，非隨眠隨增。",
        "translation": "The unconditioned dharmas are one realm and one location that aren't included in the aggregates, six kinds of cognition that know the mind except for suffering, accumulation, and path cognition, and one consciousness that doesn't follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0730b13_29"
    },
    {
        "source_sentence": "地界，一界一處一蘊攝，七智知除他心滅道智，二識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "In the earth realm, there's one realm, one place, and one aggregate that are included in seven cognitions that know the path to cessation of other minds, two consciousnesses, pervasively functioning in the desire realm and the latencies that are cultivated and eliminated in the form realm.",
        "source": "T26n1542_009:0730b16_0"
    },
    {
        "source_sentence": "水、火、風、空界亦爾。",
        "translation": "The same applies to water, to fire, to wind and to the element space.",
        "source": "T26n1542_009:0730b18_0"
    },
    {
        "source_sentence": "識界，七界一處一蘊攝，八智知除滅道智，一識識，一切隨眠隨增。",
        "translation": "The consciousness realm has seven realms, one place and one aggregate that are included in the eight kinds of cognition except for the cognition of cessation and the path, and one consciousness with all its latencies and subsequent increases.",
        "source": "T26n1542_009:0730b18_1"
    },
    {
        "source_sentence": "見苦所斷法，三界二處四蘊攝，八智知除滅道智，一識識，三界見苦所斷一切及見集所斷遍行隨眠隨增。",
        "translation": "The factors to be abandoned through the vision of frustration are included in three realms, two spheres and four aggregates; eight knowledges that know cessation with the exception of the knowledge of cessation and the one knowledge of the path; one form of consciousness; all [factors] to be abandoned through the vision of frustrationTM* of the three realms; pervasive formations®*”! which are to",
        "source": "T26n1542_009:0730b19_2"
    },
    {
        "source_sentence": "見集所斷法，三界二處四蘊攝，八智知除滅道智，一識識，三界見集所斷一切及見苦所斷遍行隨眠隨增。",
        "translation": "The factors to be abandoned through the vision of the origin are included in three realms, two spheres and four aggregates: the eight knowledges that know exceptions with respect to cessation and the knowledge of the path; one form of consciousness. All [factors] to be abandoned through the vision of the origin®*” of the three realms and all pervasively proceeding ones to be abandoned through the",
        "source": "T26n1542_009:0730b22_3"
    },
    {
        "source_sentence": "見滅所斷法，三界二處四蘊攝，八智知除滅道智，一識識，三界見滅所斷一切及遍行隨眠隨增。",
        "translation": "The factors to be abandoned through the vision of cessation are included in three realms, two spheres, and four aggregates. Eight knowledges know that they are with the exception of the knowledge of cessation and the one knowledge of the path. One is consciousness. All [factors] to be abandoned through the vision of cessation®*” of three realms and pervasively active proclivities",
        "source": "T26n1542_009:0730b24_4"
    },
    {
        "source_sentence": "見道所斷法，三界二處四蘊攝，八智知除滅道智，一識識，三界見道所斷一切及遍行隨眠隨增。",
        "translation": "The factors to be abandoned through the path of vision are included in three realms, two spheres and four aggregates. Eight knowledges know that they are with the exception of the knowledge of cessation and the one knowledge of the path. One is consciousness. All [factors] to be abandoned through the path of vision of the three realms and all pervasively active proclivitiesTM*!",
        "source": "T26n1542_009:0730b26_5"
    },
    {
        "source_sentence": "修所斷法，十八界十二處五蘊攝，八智知除滅道智，六識識，三界修所斷一切及遍行隨眠隨增。",
        "translation": "The factors to be eliminated by cultivation are included in the five aggregates of the eighteen realms and twelve locations, the eight kinds of cognition that remove cessation and knowledge of the path, the six forms of consciousness, all those eliminated by cultivation in the three realms, and pervasive latencies and subsequent increases.",
        "source": "T26n1542_009:0730b29_6"
    },
    {
        "source_sentence": "非所斷法，三界二處五蘊攝，八智知除苦集智，一識識，非隨眠隨增。",
        "translation": "The dharmas that are not to be eliminated are included in the three realms, two places, and five aggregates, eight kinds of cognition that remove suffering and accumulate cognition, and one form of consciousness that doesn't follow dormancy and increase.",
        "source": "T26n1542_009:0730c02_7"
    },
    {
        "source_sentence": "欲貪隨眠及瞋隨眠，一界一處一蘊攝，七智知除類滅道智，一識識，欲界有漏緣隨眠隨增。",
        "translation": "The latent defilement of attachment to sensual pleasure and the latent defilement of hatred are subsumed in one realm, one place, and one aggregate: seven knowledges that know exceptions to the knowledge of the path to cessation as a species; one consciousness.",
        "source": "T26n1542_009:0730c04_0"
    },
    {
        "source_sentence": "有貪隨眠，一界一處一蘊攝，七智知除法滅道智，一識識，色無色界有漏緣隨眠隨增。",
        "translation": "There are the latent defilements of craving, which are subsumed in one realm, one place, and one aggregate, seven kinds of cognition that know the path to cessation of dharmas and one consciousness, and a form and formless realm with contaminated conditions that follow dormancy and increase accordingly.",
        "source": "T26n1542_009:0730c06_1"
    },
    {
        "source_sentence": "慢隨眠，一界一處一蘊攝，八智知除滅道智，一識識，三界有漏緣隨眠隨增。",
        "translation": "The eight knowledges of cessation and the knowledge of cessation path are included in one realm, one consciousness. The three realms have impure supporting objects as secondary dormancy and increase accordingly.",
        "source": "T26n1542_009:0730c08_2"
    },
    {
        "source_sentence": "無明隨眠，一界一處一蘊攝，八智知除滅道智，一識識，除無漏緣無明，諸餘一切隨眠隨增。",
        "translation": "The eight knowledges of cessation and the knowledge of the path to cessation are included in one realm, one place, and one consciousness: exception made for the pure supporting object ignorance; all other [factors] that are accompanied by dormancy increase subsequently.",
        "source": "T26n1542_009:0730c09_3"
    },
    {
        "source_sentence": "見隨眠，一界一處一蘊攝，八智知除滅道智，一識識，三界見所斷有漏緣及無漏緣見相應無明隨眠隨增。",
        "translation": "The proclivities of views are subsumed in one realm, one location, and one aggregate. Eight knowledges know the path to cessation with the exception of the knowledge of cessation and one knowledge of the path; one form of consciousness is consciousness. The impure supporting objects that are to be abandoned through the vision of the three realms*”®! as well as the ignorance associated",
        "source": "T26n1542_009:0730c11_4"
    },
    {
        "source_sentence": "疑隨眠，一界一處一蘊攝，八智知除滅道智，一識識，三界見所斷有漏緣及無漏緣疑相應無明隨眠隨增。",
        "translation": "The proclivities of perplexity are subsumed in one realm, one location, and one aggregate. Eight knowledges know the path to cessation with the exception of the knowledge of cessation and one knowledge of the path; one form of consciousness is consciousness. The three realms see that ignorance follows dormancy associated with doubt regarding the impure supporting conditions and the pure supporting conditions to",
        "source": "T26n1542_009:0730c14_5"
    },
    {
        "source_sentence": "初識住，十八界十二處五蘊攝，七智知除類滅道智，六識識，欲界一切隨眠隨增。",
        "translation": "The first is the abode of consciousness, which consists of the five aggregates of the eighteen realms and twelve locations, the seven knowledges that know the path to cessation except for cognition of types, the six consciousnesses, and all the latencies in the desire realm that increase accordingly.",
        "source": "T26n1542_009:0730c17_0"
    },
    {
        "source_sentence": "第二識住，十四界十處五蘊攝，七智知除法滅道智，四識識，色界一切隨眠隨增。",
        "translation": "The second abode of consciousness, which consists of the fourteen realms, ten locations, and five aggregates, is subsumed by seven kinds of cognition that know the path to cessation except for knowledge of the Dharma, and the four consciousnesses are all latent and increasing in the form realm.",
        "source": "T26n1542_009:0730c18_1"
    },
    {
        "source_sentence": "第三、第四識住，十一界十處五蘊攝，七智知除法滅道智，四識識，色界一切隨眠隨增。",
        "translation": "The third and the fourth abodes of consciousness, which are subsumed in the five aggregates of the eleven realms and ten places, seven kinds of cognition that know the path to cessation except for the cessation of dharmas, and four kinds of consciousness that follow and increase all the latencies in the form realm.",
        "source": "T26n1542_009:0730c20_2"
    },
    {
        "source_sentence": "第五、第六、第七識住，三界二處四蘊攝，六智知除法他心滅道智，一識識，無色界一切隨眠隨增。",
        "translation": "The fifth, sixth, and seventh abodes of consciousness are subsumed in the three realms, two places, and four aggregates, with six kinds of cognition that know the path to cessation except for the cessation of minds of other things, and a single consciousness that increases all the latencies and tendencies of the formless realm.",
        "source": "T26n1542_009:0730c22_3"
    },
    {
        "source_sentence": "說一切有部品類足論卷第九",
        "translation": "Saṃyuktâgama-śāstra, vol. 9",
        "source": "T26n1542_009:0730c25_0"
    }
]