[
    {
        "source_sentence": "大寶積經論卷第一",
        "translation": "Commentary on the Mahāprajñāpāramitā-sūtra Treatise, Volume 1",
        "source": "T26n1523_001:0204a03_0"
    },
    {
        "source_sentence": "後魏北印度三藏菩提流支譯",
        "translation": "Latter Wei translation of the Northern India Tripiṭaka, translated by Bodhiruci",
        "source": "T26n1523_001:0204a05_0"
    },
    {
        "source_sentence": "　歸命世間救，　　苦海度彼岸，",
        "translation": "I take refuge in the world to save them, crossing the ocean of suffering to the other shore.",
        "source": "T26n1523_001:0204a06_0"
    },
    {
        "source_sentence": "　大悲降魔怨，　　我釋寶積經。",
        "translation": "Great compassion subdues Māra's enemies, and I explain the Jewel-Store Sutra.",
        "source": "T26n1523_001:0204a07_0"
    },
    {
        "source_sentence": "　莊嚴十六種，　　真實微妙義，",
        "translation": "Their adornments are sixteen kinds, True and subtle in meaning.",
        "source": "T26n1523_001:0204a08_0"
    },
    {
        "source_sentence": "　欲令法久住，　　自利利他故。",
        "translation": "They want to cause the Dharma to abide for a long time, For their own benefit and for the benefit of others.",
        "source": "T26n1523_001:0204a09_0"
    },
    {
        "source_sentence": "問曰：汝欲釋寶積經，應先釋此法。",
        "translation": "Q: If you want to explain the Jewel-Store Sutra, you should first explain this teaching.",
        "source": "T26n1523_001:0204a10_0"
    },
    {
        "source_sentence": "問：以何義故，名為寶積？",
        "translation": "Question: What is the meaning of ‘ pile of treasures’? Answer:",
        "source": "T26n1523_001:0204a10_1"
    },
    {
        "source_sentence": "答曰：大乘法寶中，一切諸法差別義攝取故。",
        "translation": "Answer: In the great vehicle treasure of the Dharma, all the distinctive meanings of all dharmas are collected.",
        "source": "T26n1523_001:0204a11_2"
    },
    {
        "source_sentence": "所有大乘法寶中諸法差別相者，彼盡攝取義故，名曰寶積。",
        "translation": "The distinctive characteristics of all the dharmas in the great vehicle treasure of the Dharma are called the jeweled accumulation because they fully gather their meaning.",
        "source": "T26n1523_001:0204a12_3"
    },
    {
        "source_sentence": "一、聚；",
        "translation": "The first is the aggregate.",
        "source": "T26n1523_001:0204a13_4"
    },
    {
        "source_sentence": "二、積；",
        "translation": "The second is accumulation.",
        "source": "T26n1523_001:0204a13_5"
    },
    {
        "source_sentence": "三、陰；",
        "translation": "The third is the aggregate.",
        "source": "T26n1523_001:0204a14_6"
    },
    {
        "source_sentence": "四、合和，義一名異。",
        "translation": "4. unitedness and harmony, which have different meanings.",
        "source": "T26n1523_001:0204a14_7"
    },
    {
        "source_sentence": "是中一切大乘法中，如來為諸菩薩十六種相差別說法。",
        "translation": "In all these great vehicle teachings, the Tathāgata explains the sixteen distinctive characteristics of the bodhisattvas to them.",
        "source": "T26n1523_001:0204a14_8"
    },
    {
        "source_sentence": "何者十六種相？",
        "translation": "What are these sixteen characteristics?",
        "source": "T26n1523_001:0204a15_9"
    },
    {
        "source_sentence": "一、法邪行相，如是菩薩行邪行已，名為行邪行相。",
        "translation": "1. The mark of wrong practice of the Dharma, which is called the mark of wrong practice after a bodhisattva has done wrong practice.",
        "source": "T26n1523_001:0204a16_10"
    },
    {
        "source_sentence": "二、正行相，如是菩薩行正行已，名為行正行相。",
        "translation": "2. the mark of right practice, which is called the mark of right practice after a bodhisattva thus practices right practice.",
        "source": "T26n1523_001:0204a17_11"
    },
    {
        "source_sentence": "三、行正行利益相，菩薩住正行已，名法行等行善行。",
        "translation": "3. The beneficial aspect of practicing right practice, which is called the good practice of Dharma practice and so forth after a bodhisattva abides in right practice.",
        "source": "T26n1523_001:0204a18_12"
    },
    {
        "source_sentence": "四、行法行諸相差別。",
        "translation": "4. Distinctions in the characteristics of conditioned dharmas and conditioned forms.",
        "source": "T26n1523_001:0204a19_13"
    },
    {
        "source_sentence": "五、於諸菩薩所生慈心相，為令生敬重心行說相故。",
        "translation": "5. the characteristic of compassion that arises in bodhisattvas, which is explained in order to cause them to give rise to respectful mental actions.",
        "source": "T26n1523_001:0204a20_14"
    },
    {
        "source_sentence": "六、菩薩住正行，學戒相故。",
        "translation": "6. because bodhisattvas abide in correct practice, which is the characteristic of training in morality.",
        "source": "T26n1523_001:0204a21_15"
    },
    {
        "source_sentence": "七、聲聞戒與菩薩戒中說優劣勝如相故。",
        "translation": "7. because the śrāvaka precepts and the bodhisattva precepts are described as superior or inferior in terms of their characteristics.",
        "source": "T26n1523_001:0204a21_16"
    },
    {
        "source_sentence": "八、菩薩善學菩薩戒已，能與世間智等饒益他行差別相故。",
        "translation": "8. It's because the bodhisattva who well trains in the bodhisattva precepts can share the distinctive characteristics of worldly cognition and other practices that benefit others.",
        "source": "T26n1523_001:0204a22_17"
    },
    {
        "source_sentence": "九、受彼菩薩藏時，教修聲聞戒相差別。",
        "translation": "9. When they receive the bodhisattva collection, they teach and cultivate the distinctions in the characteristics of śrāvaka precepts.",
        "source": "T26n1523_001:0204a24_18"
    },
    {
        "source_sentence": "十、不善學沙門相差別故。",
        "translation": "10. because there are distinctions in the characteristics of ascetics who don't well train.",
        "source": "T26n1523_001:0204a25_19"
    },
    {
        "source_sentence": "十一、不學沙門相差別故。",
        "translation": "11. because there are distinctions in the characteristics of ascetics who don't train.",
        "source": "T26n1523_001:0204a25_20"
    },
    {
        "source_sentence": "十二、住假名行相差別故。",
        "translation": "12. It's because they abide in distinctions in nominal names, practices, and marks.",
        "source": "T26n1523_001:0204a26_21"
    },
    {
        "source_sentence": "十三、住真實行相差別故。",
        "translation": "13. It's because they abide in the distinction between reality and practice.",
        "source": "T26n1523_001:0204a26_22"
    },
    {
        "source_sentence": "十四、如來方便化度眾生相差別故。",
        "translation": "14. It's because the Tathāgata skillfully transforms sentient beings with distinctions in their characteristics.",
        "source": "T26n1523_001:0204a27_23"
    },
    {
        "source_sentence": "十五、說微密語相差別故。",
        "translation": "Fifteenth, it's because they explain the distinctions in the characteristics of subtle esoteric speech.",
        "source": "T26n1523_001:0204a28_24"
    },
    {
        "source_sentence": "十六、於菩薩藏中得教誨已，善信有益相差別故。",
        "translation": "16. After receiving instruction from the bodhisattva collection, they well believe in the distinction between beneficial and beneficial characteristics.",
        "source": "T26n1523_001:0204a28_25"
    },
    {
        "source_sentence": "大乘經中如來為諸菩薩說如是等十六種相差別法故，彼法門中此一切諸相現所說故，彼大乘法寶中所有諸相盡攝取故，此妙法門名為寶積。",
        "translation": "In the great vehicle sūtras, the Tathāgata explains these 16 kinds of distinctive qualities for bodhisattvas because all these characteristics are presently explained in that dharma-gate, and this marvelous dharma-gate is called the jeweled accumulation because all the characteristics in those great vehicle treasures of the Dharma are fully included.",
        "source": "T26n1523_001:0204a29_26"
    },
    {
        "source_sentence": "問曰：云何彼大乘正法寶中所有諸相，而此法門中所攝取成？",
        "translation": "Q: What are the characteristics that exist in the great vehicle treasure of the true dharma, and what are the characteristics that are collected in this teaching?",
        "source": "T26n1523_001:0204b04_27"
    },
    {
        "source_sentence": "答曰：「迦葉！",
        "translation": "He replied, Kāśyapa!",
        "source": "T26n1523_001:0204b05_28"
    },
    {
        "source_sentence": "有四法退失智慧」如是等，黑朋所攝八種四句，攝邪行相差別故。",
        "translation": "These are the eight kinds of four phrases included in the black group, because they include distinctions in the characteristics of wrong actions.",
        "source": "T26n1523_001:0204b05_29"
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "Kasyapa!",
        "source": "T26n1523_001:0204b07_30"
    },
    {
        "source_sentence": "菩薩有得四大伏藏」如是等，六種四句所攝正行利益相差別。",
        "translation": "Bodhisattvas have the four great stores of subjugation that are attained by the bodhisattvas, and so forth, which are the distinctions in the benefits and characteristics of the six kinds of right practice included in the four sentences.",
        "source": "T26n1523_001:0204b07_31"
    },
    {
        "source_sentence": "如是此諸二十二四句，具說染淨退益之事。",
        "translation": "Thus, these twenty-two or four phrases explain the benefits of defilement and purity in terms of regressing.",
        "source": "T26n1523_001:0204b08_32"
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "Kasyapa!",
        "source": "T26n1523_001:0204b09_33"
    },
    {
        "source_sentence": "名菩薩者，非但名字名為菩薩」如是等，有三十二種相差別應知。",
        "translation": "Names are called bodhisattvas, not just names that are called bodhisattvas. These and so forth have thirty-two kinds of distinctive characteristics that should be known.",
        "source": "T26n1523_001:0204b10_34"
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "Kasyapa!",
        "source": "T26n1523_001:0204b11_35"
    },
    {
        "source_sentence": "菩薩功德無量無邊，我當以譬喻演說」如是十九喻所明諸相差別應知。",
        "translation": "The merits of the bodhisattvas are immeasurable and limitless, and I will explain them in metaphors. These nineteen metaphors explain the distinctions in characteristics that should be known.",
        "source": "T26n1523_001:0204b11_36"
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "Kasyapa!",
        "source": "T26n1523_001:0204b13_37"
    },
    {
        "source_sentence": "菩薩欲學此大寶積經，乃至其燈明者聖慧根是，其黑闇者諸結業是，是名住正行中攝諸戒相差別應知。",
        "translation": "A bodhisattva who wants to study this great jeweled sūtra, up to the point where the lamp that shines is the noble faculty of wisdom and the darkness is the fetter karma, should be known as someone who abides in right practice and collects the distinctive characteristics of the precepts.",
        "source": "T26n1523_001:0204b13_38"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T26n1523_001:0204b15_39"
    },
    {
        "source_sentence": "譬如種在空中而能生長者，從本以來無有是處，乃至能出無量百千聲聞辟支佛報」如是等，明聲聞戒喻，菩薩戒中勝劣相差別攝故應知。",
        "translation": "It's like a seed in the sky that grows because there's no place for it since the beginning, up to the point where it can produce measureless hundreds of thousands of śrāvakas and pratyekbuddha rewards.",
        "source": "T26n1523_001:0204b16_40"
    },
    {
        "source_sentence": "「爾時世尊復告大迦葉言乃至從本以來畢竟淨故」如是等，攝取世間出世間智饒益他行事差別相應知。",
        "translation": "The Bhagavān then again addressed Mahākāśyapa, saying, Up to the ultimate purity since the beginning, and so forth, it's appropriate to know the distinctions in terms of taking in worldly and transmundane cognition and benefiting others.",
        "source": "T26n1523_001:0204b19_41"
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "Kasyapa!",
        "source": "T26n1523_001:0204b21_42"
    },
    {
        "source_sentence": "汝等觀內莫外逃走乃至出家人有二種病。",
        "translation": "You should observe that there are two kinds of illnesses inside and outside, such as running away or leaving home.",
        "source": "T26n1523_001:0204b21_43"
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are these two?",
        "source": "T26n1523_001:0204b22_44"
    },
    {
        "source_sentence": "一者懷增上慢而自伏心，二者壞他發大乘心」如是等，攝取受彼菩薩藏時教修聲聞戒相差別應知。",
        "translation": "One, they harbor superior conceit and subdue their own minds, and two, they disrupt the minds of others and give rise to the great vehicle mind. Such are the distinctions in the characteristics of the śrāvaka precepts that should be known when they take in the bodhisattva collection and teach them to cultivate the śrāvaka precepts.",
        "source": "T26n1523_001:0204b23_45"
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "Kasyapa!",
        "source": "T26n1523_001:0204b25_46"
    },
    {
        "source_sentence": "沙門沙門者，以何義故名為沙門？",
        "translation": "What's the meaning of being called an ascetic when you're an ascetic?",
        "source": "T26n1523_001:0204b25_47"
    },
    {
        "source_sentence": "復云何沙門？",
        "translation": "Again, what's an ascetic?",
        "source": "T26n1523_001:0204b26_48"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T26n1523_001:0204b26_49"
    },
    {
        "source_sentence": "有四種沙門乃至如是普明，是名菩薩速疾法通」如是等，攝前三種沙門不善學沙門相差別應知。",
        "translation": "There are four kinds of ascetics and so forth, which are called the bodhisattva's swift Dharma supernormal abilities. Thus, these are the distinctions in the characteristics of the first three kinds of ascetics who aren't well-versed as as as ascetics that should be known.",
        "source": "T26n1523_001:0204b26_50"
    },
    {
        "source_sentence": "「爾時尊者摩訶迦葉白佛言：世尊！",
        "translation": "At the time, Venerable Mahākāśyapa said to the Buddha, Bhagavān!",
        "source": "T26n1523_001:0204b29_51"
    },
    {
        "source_sentence": "希有希有。",
        "translation": "It's rare and rare.",
        "source": "T26n1523_001:0204b29_52"
    },
    {
        "source_sentence": "此大寶積經，行大乘者而能作利益，乃至讀誦受持書寫此大寶積經，彼人即供養一切諸佛」如是等，於菩薩得教授已善信有益相差別攝故應知。",
        "translation": "This great jeweled sūtra is for the benefit of those who practice the great vehicle, even if they recite, memorize, and write this great jeweled sūtra, that person will then make offerings to all the buddhas. Such things should be known because they are included in the distinctive characteristics of the bodhisattva's good faith and beneficialness after he has received the teaching.",
        "source": "T26n1523_001:0204c01_53"
    },
    {
        "source_sentence": "如是大乘中所說十六種諸法相差別攝取故，此法門名為寶積應知耳。",
        "translation": "Thus, because the sixteen kinds of characteristics of dharmas explained in the great vehicle are differentiated and collected, this teaching is called the jeweled heap of knowledge.",
        "source": "T26n1523_001:0204c04_54"
    },
    {
        "source_sentence": "「佛住王舍大城」。",
        "translation": "The Buddha lives in the great city of Rājagṛha.",
        "source": "T26n1523_001:0204c06_55"
    },
    {
        "source_sentence": "問曰：何故初明住處？",
        "translation": "Q: Why does the first explain the abode?",
        "source": "T26n1523_001:0204c06_56"
    },
    {
        "source_sentence": "答曰：佛住此處者，欲令敬重彼處故。",
        "translation": "Answer: When the Buddha lives here, he wants to cause respect for that place.",
        "source": "T26n1523_001:0204c07_0"
    },
    {
        "source_sentence": "重福眾生敬此處故增長善根，是故先明住處。",
        "translation": "Because sentient beings of great merit respect this place and therefore grow good roots, they first explain the dwelling place.",
        "source": "T26n1523_001:0204c07_1"
    },
    {
        "source_sentence": "問曰：何故此法唯王舍城說，非餘城郭？",
        "translation": "Q: Why is this teaching taught only in Rājagṛha and not in other cities?",
        "source": "T26n1523_001:0204c08_2"
    },
    {
        "source_sentence": "答曰：釋此法門法王住處故，喻如王舍王所止住，故明王舍。",
        "translation": "Answer: This explains that this is the abode of the Dharma king of the Dharma teaching because it's a metaphor for the king's dwelling place, so he explains the king's dwelling.",
        "source": "T26n1523_001:0204c09_3"
    },
    {
        "source_sentence": "此大法門亦復如是，法王住處，釋成此義故，說住王舍城。",
        "translation": "This great dharma-gate is also like this: the dwelling place of the King of the Dharma. The explanation accomplishes this meaning by saying that he lives in the city of Rājagṛha.",
        "source": "T26n1523_001:0204c11_4"
    },
    {
        "source_sentence": "問曰：何故唯在耆闍崛山，非餘方中？",
        "translation": "Q: Why is it only on Mount Gṛdhrakūṭa and not in other directions?",
        "source": "T26n1523_001:0204c12_5"
    },
    {
        "source_sentence": "答曰：說此大乘法，比於聲聞緣覺乘中增上義故，增上自利利他行故。",
        "translation": "Answer: Teaching this great vehicle teaching has superior meaning compared to the śrāvakas and pratyekbuddhas' vehicles because it increases their practice of self-benefiting and benefiting others.",
        "source": "T26n1523_001:0204c13_6"
    },
    {
        "source_sentence": "「與大比丘眾八千人俱，菩薩萬六千人俱」。",
        "translation": "He was accompanied by 8,000 people from the great assembly of monks and 16,000 people from the bodhisattva.",
        "source": "T26n1523_001:0204c15_0"
    },
    {
        "source_sentence": "問曰：既因菩薩明此法門，以是義故應說菩薩大名稱眾，說聲聞眾有何義也？",
        "translation": "Q: Since the bodhisattva explains this teaching, what does it mean to say that the bodhisattva's great name is a multitude of śrāvakas?",
        "source": "T26n1523_001:0204c15_1"
    },
    {
        "source_sentence": "答曰：說聲聞眾，若有聲聞於大乘中所有疑心，為除彼疑故。",
        "translation": "Answer: It's said that among the śrāvakas, if there are śrāvakas who have doubts in the great vehicle, it's because they want to remove those doubts.",
        "source": "T26n1523_001:0204c17_2"
    },
    {
        "source_sentence": "若有不定，助成正信。",
        "translation": "If there's indeterminate, it helps to establish right faith.",
        "source": "T26n1523_001:0204c19_3"
    },
    {
        "source_sentence": "若有自謂得清淨者，為欲捨離彼淨心故。",
        "translation": "If someone says they've attained purity, it's because they want to abandon their pure mind.",
        "source": "T26n1523_001:0204c19_4"
    },
    {
        "source_sentence": "復有聲聞，謂盡諸結，於佛法中無復所修，所謂滅諸煩惱等障，心生逮得己利。",
        "translation": "Again, there are śrāvakas who have ended the bonds and no longer cultivate what's cultivated in the Buddha's teachings, which is called extinguishing the afflictive hindrances and so forth, and whose mind arises to acquire its own benefits.",
        "source": "T26n1523_001:0204c20_5"
    },
    {
        "source_sentence": "為欲捨離彼慢心故，此法門中為諸菩薩說煩惱障滅，因彼煩惱障及滅智障亦非餘所說，勝於聲聞緣覺中得上果報。",
        "translation": "Because they want to abandon their conceit, this teaching of the Dharma explains the cessation of the afflictive hindrances for bodhisattvas in order to remove the afflictive hindrances, and because those afflictive hindrances and the hindrance of extinguishing the cognitive hindrances are not explained otherwise, they're superior to the results of śrāvakas and pratyekbuddhas who attain the",
        "source": "T26n1523_001:0204c22_6"
    },
    {
        "source_sentence": "問曰：聲聞眾數，此諸菩薩從何而至？",
        "translation": "Q: How many śrāvakas are there, and where do these bodhisattvas come from?",
        "source": "T26n1523_001:0204c25_7"
    },
    {
        "source_sentence": "答曰：未來世中有疑惑者，為令除彼疑惑故。",
        "translation": "Answer: In the future, there will be doubters in order to remove their doubts.",
        "source": "T26n1523_001:0204c25_8"
    },
    {
        "source_sentence": "經家所說，從他方諸佛國土而來集會。",
        "translation": "The sūtras say that they come from the buddha lands of other directions to assemble.",
        "source": "T26n1523_001:0204c26_9"
    },
    {
        "source_sentence": "問曰：何故說言皆得不退轉也？",
        "translation": "Q: Why is it said that they all attain nonretrogression?",
        "source": "T26n1523_001:0204c27_10"
    },
    {
        "source_sentence": "答曰：皆得不退轉者，已得具足四忍故。",
        "translation": "Answer: They all attain nonretrogression because they've already attained the four tolerances.",
        "source": "T26n1523_001:0204c28_11"
    },
    {
        "source_sentence": "一生得者，聞說此法堪為器故。",
        "translation": "A person who attains it in one lifetime hears and teaches this teaching because they're capable of being a vessel.",
        "source": "T26n1523_001:0204c29_12"
    },
    {
        "source_sentence": "問曰：是諸菩薩從他方諸佛國土而來此土，成有何益？",
        "translation": "Q: What's the benefit of these bodhisattvas coming from other buddha-lands to this land?",
        "source": "T26n1523_001:0205a01_13"
    },
    {
        "source_sentence": "彼世界中是諸如來各自說法。",
        "translation": "In those worlds, each of the tathāgatas teaches the Dharma.",
        "source": "T26n1523_001:0205a02_14"
    },
    {
        "source_sentence": "答曰：為益眾生故。",
        "translation": "Answer: It's for the benefit of sentient beings.",
        "source": "T26n1523_001:0205a03_15"
    },
    {
        "source_sentence": "此世界中亦有眾生，彼諸菩薩本所化受，既見本同修諸行故，是則樂見。",
        "translation": "In this world, there are also sentient beings who were originally transformed by those bodhisattvas, and since they saw that they were originally cultivating the practices together, they're happy to see them.",
        "source": "T26n1523_001:0205a03_16"
    },
    {
        "source_sentence": "及本所化諸菩薩法，以復受是行。",
        "translation": "and the bodhisattva dharmas that were originally transformed, so they'll again experience these practices.",
        "source": "T26n1523_001:0205a05_17"
    },
    {
        "source_sentence": "餘方亦有無量諸佛，為令生渴仰敬重諮請親近之心，說無量佛故，令諸眾生生堪得心起勇猛精進不生疲惓。",
        "translation": "In other directions, there are also measureless buddhas who cause sentient beings to become thirsty, respectful, instructing, and intimate, and explaining the names of measureless buddhas causes sentient beings to give rise to a mind capable of attaining enlightenment that produces courageous effort and doesn't become weary.",
        "source": "T26n1523_001:0205a05_18"
    },
    {
        "source_sentence": "復是釋迦如來本所化故，憶本化度，修諸願行事，從他方來親近如來。",
        "translation": "Again, it's because the Śākyamuni Tathāgata was originally transformed by the Tathāgata, remembering his original transformation and liberation, cultivating vows, and doing so, and coming from another place to become intimate with the Tathāgata.",
        "source": "T26n1523_001:0205a08_19"
    },
    {
        "source_sentence": "問曰：何故明菩薩多、說聲聞少？",
        "translation": "Q: Why do they explain that there are many bodhisattvas and few śrāvakas who teach?",
        "source": "T26n1523_001:0205a10_0"
    },
    {
        "source_sentence": "答曰：說菩薩眾多者，此法門中所辯諸行，彼盡因為諸菩薩說。",
        "translation": "Answer: When it's said that there are many bodhisattvas, the practices discussed in this teaching are all explained because of the bodhisattvas.",
        "source": "T26n1523_001:0205a10_1"
    },
    {
        "source_sentence": "問曰：何故先說聲聞眾？",
        "translation": "Q: Why was it first explained to the śrāvakas?",
        "source": "T26n1523_001:0205a12_2"
    },
    {
        "source_sentence": "答曰：因彼加持所說法故。",
        "translation": "Answer: It's because of the teaching given by those who are endowed with it.",
        "source": "T26n1523_001:0205a12_3"
    },
    {
        "source_sentence": "問曰：何故說言從他方來集會皆得一生者？",
        "translation": "Q: Why is it said that they all come from other places to gather together and attain one life?",
        "source": "T26n1523_001:0205a13_4"
    },
    {
        "source_sentence": "說懈怠我慢故令不生往求於正法。",
        "translation": "They say they're lazy and self-conceited, so they won't give rise to the desire to pursue the right teaching.",
        "source": "T26n1523_001:0205a14_5"
    },
    {
        "source_sentence": "對治此患故，言自樂法故，從他方來集會，不為順他心故，釋成遠來。",
        "translation": "It's because they counteract this affliction, say that it's because of self-delight in the Dharma and come from another place to assemble, not because they don't follow the minds of others, which explains the formation of a distant coming.",
        "source": "T26n1523_001:0205a15_6"
    },
    {
        "source_sentence": "諸佛世界中，此諸菩薩已得佛位，尚為法來，況於餘者云何不來。",
        "translation": "In all the buddha worlds, these bodhisattvas who have attained buddhahood still come for the sake of the Dharma, so why wouldn't they come if there were others?",
        "source": "T26n1523_001:0205a16_7"
    },
    {
        "source_sentence": "問曰：如來何故但對迦葉說此法門，不對菩薩？",
        "translation": "Q: Why did the Tathāgata only explain this teaching to Kāśyapa and not to the bodhisattva?",
        "source": "T26n1523_001:0205a18_8"
    },
    {
        "source_sentence": "答曰：如來告大迦葉時，知堪能說故。",
        "translation": "Answer: When the Tathāgata addressed Mahākāśyapa, he knew that he was capable of speaking.",
        "source": "T26n1523_001:0205a19_9"
    },
    {
        "source_sentence": "唯未知覺復未正信，以釋成堪知覺信大乘義故。",
        "translation": "They only don't know the meaning of awakening and don't yet have correct faith, because they explain the meaning of accomplishing the awakening of knowing and believing in the great vehicle.",
        "source": "T26n1523_001:0205a19_10"
    },
    {
        "source_sentence": "是中邪行所攝八種四句，上上相釋漸次應知。",
        "translation": "These are the eight kinds of four phrases that are included in wrong practices, which should be gradually understood by explaining the above-mentioned characteristics.",
        "source": "T26n1523_001:0205a21_11"
    },
    {
        "source_sentence": "第一四句，說退失智慧邪行相事。",
        "translation": "The first four sentences explain the matter of the mistaken aspect of retreating wisdom.",
        "source": "T26n1523_001:0205a22_12"
    },
    {
        "source_sentence": "第二四句，退失智慧已，忘於正念。",
        "translation": "The second four sentences are, After regressing from wisdom, they forget right mindfulness.",
        "source": "T26n1523_001:0205a22_13"
    },
    {
        "source_sentence": "第三四句，滅正念已，令滅白法。",
        "translation": "The third four sentence, after ceasing right mindfulness, causes the white dharma to cease.",
        "source": "T26n1523_001:0205a23_14"
    },
    {
        "source_sentence": "第四四句，滅白法已，似非菩薩行惡心相。",
        "translation": "The fourth four sentence, after extinguishing white dharmas, resembles the bad mental characteristics of someone who doesn't act like a bodhisattva.",
        "source": "T26n1523_001:0205a24_15"
    },
    {
        "source_sentence": "第五四句，行惡心相已，難調伏故。",
        "translation": "The fifth four sentences are because it's difficult to subdue after committing bad mental states.",
        "source": "T26n1523_001:0205a25_16"
    },
    {
        "source_sentence": "第六四句，難調伏已，行於邪盜。",
        "translation": "The sixth and fourth sentences, after being difficult to subdue, engage in stealing.",
        "source": "T26n1523_001:0205a26_17"
    },
    {
        "source_sentence": "第七四句，行邪盜已，不應親近而能親近。",
        "translation": "The seventh four sentences say that after committing stealing, they shouldn't become intimate and be able to become intimate.",
        "source": "T26n1523_001:0205a26_18"
    },
    {
        "source_sentence": "第八四句，不應親近而能親近已，令不助菩薩行成於邪行。",
        "translation": "The eighth and fourth sentences, which shouldn't be approached but can be approached, cause wrong actions that don't help the bodhisattva's practice to become wrong.",
        "source": "T26n1523_001:0205a27_19"
    },
    {
        "source_sentence": "對治此故，正行所攝亦有八四句，上上相釋漸次應知。",
        "translation": "Because of this antidote, there are also eight or four sentences that are included in the correct practice. The explanation of the higher and higher characteristics should be known gradually one after the other.",
        "source": "T26n1523_001:0205a29_20"
    },
    {
        "source_sentence": "第一四句，說為滿足助道智已，令不忘正念。",
        "translation": "The first four sentences are said to fulfill the knowledge that assists in the path and cause them not to forget right mindfulness.",
        "source": "T26n1523_001:0205b01_21"
    },
    {
        "source_sentence": "第二四句。",
        "translation": "The second four sentences.",
        "source": "T26n1523_001:0205b02_22"
    },
    {
        "source_sentence": "令不忘正念助道，智增長故。",
        "translation": "It causes them not to forget right mindfulness as an aid to the path, because their knowledge increases.",
        "source": "T26n1523_001:0205b02_23"
    },
    {
        "source_sentence": "第三四句，不忘正念已，增長白法。",
        "translation": "The third and fourth phrases, after not forgetting right mindfulness, increase the white dharma.",
        "source": "T26n1523_001:0205b03_24"
    },
    {
        "source_sentence": "第四四句，增長白法已，行似菩薩心想行故。",
        "translation": "The fourth four sentences increase the white dharmas, because their practice resembles the bodhisattva's mind and perception of practice.",
        "source": "T26n1523_001:0205b04_25"
    },
    {
        "source_sentence": "第五四句，行不惡心事，善調伏故。",
        "translation": "The fifth and fourth sentences are about doing things that aren't bad to the mind, which are well disciplined.",
        "source": "T26n1523_001:0205b05_26"
    },
    {
        "source_sentence": "第六四句，善調伏已，行於正道。",
        "translation": "The sixth four sentence, well-adjusted, follows the right path.",
        "source": "T26n1523_001:0205b05_27"
    },
    {
        "source_sentence": "第七四句，既行正道已，應親近者而能親近。",
        "translation": "The seventh four sentences say that once they've practiced the right path, they should become intimate and be able to become intimate.",
        "source": "T26n1523_001:0205b06_28"
    },
    {
        "source_sentence": "第八四句，應親近而能親近已，令隨菩薩所行諸行成於正行。",
        "translation": "The eighth four sentence, which should be approached and can be approached, causes the bodhisattva to follow the practices he's performing to form right practice.",
        "source": "T26n1523_001:0205b07_29"
    },
    {
        "source_sentence": "先所說正行利益，有六種四句，上下相釋漸次應知。",
        "translation": "The benefits of the right practice previously mentioned are sixfold in four sentences:",
        "source": "T26n1523_001:0205b09_0"
    },
    {
        "source_sentence": "第一四句，菩薩如是多行正行已，習成福德智慧。",
        "translation": "In the first four sentences, the bodhisattva thus conducts himself often and correctly, accumulating merit and wisdom.",
        "source": "T26n1523_001:0205b10_1"
    },
    {
        "source_sentence": "第二四句，依功德智慧習成已，令得障淨。",
        "translation": "The second four sentences rely on the accumulation of merit and wisdom to attain purification of the hindrances.",
        "source": "T26n1523_001:0205b11_2"
    },
    {
        "source_sentence": "第三四句，依障淨已，令一切法門助習，通達一法門故。",
        "translation": "The third and fourth sentences, relying on the purification of hindrances, cause all the teachings to be cultivated as an aid, because they comprehend one teaching.",
        "source": "T26n1523_001:0205b12_3"
    },
    {
        "source_sentence": "第四四句，依習一切白法門已，一切相一切種利益一切眾生故，復修行無量功德。",
        "translation": "The fourth and fourth sentences rely on the cultivation of all white dharmas, because they have all characteristics and all kinds of benefits for all sentient beings, and they further cultivate measureless merit.",
        "source": "T26n1523_001:0205b13_4"
    },
    {
        "source_sentence": "第五四句，既修行無量功德已，令過無明住地。",
        "translation": "The fifth four sentences, having cultivated measureless merit, cause them to transcend the entrenchment of ignorance.",
        "source": "T26n1523_001:0205b15_5"
    },
    {
        "source_sentence": "第六四句，依過無明住地已，令得無障礙地。",
        "translation": "The sixth four sentences rely on the fact that after abiding in the sphere of error and ignorance, one is caused to attain an unobstructed state.",
        "source": "T26n1523_001:0205b16_6"
    },
    {
        "source_sentence": "是名此諸二十二四句之中所說漸次。",
        "translation": "This is called the gradual order of these twenty-two or twenty-four phrases.",
        "source": "T26n1523_001:0205b17_7"
    },
    {
        "source_sentence": "自此已後，還彼前四句次第解釋說應知。",
        "translation": "After this, he returns to the first four sentences and explains them in order.",
        "source": "T26n1523_001:0205b18_8"
    },
    {
        "source_sentence": "經言「迦葉！",
        "translation": "The sūtra says, Kāśyapa!",
        "source": "T26n1523_001:0205b19_9"
    },
    {
        "source_sentence": "菩薩有四法退失智慧」。",
        "translation": "A bodhisattva has four ways to regress from wisdom.",
        "source": "T26n1523_001:0205b19_10"
    },
    {
        "source_sentence": "問曰：以何義故發此說？",
        "translation": "Q: What's the reason this teaching is given?",
        "source": "T26n1523_001:0205b20_11"
    },
    {
        "source_sentence": "答曰：修大乘者，為得無上菩提方便故，愚癡者為令示現故，放逸者令正勸故，怯弱小心者令助慰喻使發大意故，已行正行者為令讚歎故。",
        "translation": "Answer: Those who cultivate the great vehicle want to attain the method of unsurpassed enlightenment, those who are foolish want to show it, those who are careless want to be correctly encouraged, those who are timid and cautious want to help comfort and make them give rise to great intentions, and those who have already done right practice want to praise it.",
        "source": "T26n1523_001:0205b20_12"
    },
    {
        "source_sentence": "問曰：明四法者，此數無義而說，自體明故。",
        "translation": "Q: To explain the four dharmas, these are counted without meaning and explained because their own essence is clear.",
        "source": "T26n1523_001:0205b23_13"
    },
    {
        "source_sentence": "答曰：四算數者，說攝取義故。",
        "translation": "Answer: The four calculations are explained in terms of taking in.",
        "source": "T26n1523_001:0205b24_14"
    },
    {
        "source_sentence": "廣不可盡，伏防聽者不樂多聞故，以數攝故令憶持則易，如繩穿華不使零落故。",
        "translation": "It's inexhaustible because the listener doesn't delight in much learning, and it's easy to keep it in memory because it's collected by numbers, like a rope that penetrates a flower without letting it fall down.",
        "source": "T26n1523_001:0205b25_15"
    },
    {
        "source_sentence": "問曰：何以故唯定四，不多亦不少？",
        "translation": "Q: Why is it that there are only four concentrations, not many and not many?",
        "source": "T26n1523_001:0205b27_16"
    },
    {
        "source_sentence": "答曰：遮無窮及無義問故。",
        "translation": "Answer: It's because it obscures the question of limitlessness and meaninglessness.",
        "source": "T26n1523_001:0205b28_17"
    },
    {
        "source_sentence": "復有喻者，退失三種助智攝取故明四數。",
        "translation": "Again, there's a metaphor because the three kinds of retrogression and loss are collected by the three kinds of auxiliary cognition, so it explains the four numbers.",
        "source": "T26n1523_001:0205b28_18"
    },
    {
        "source_sentence": "復有餘者，略說有三種智慧聞思修等。",
        "translation": "“Furthermore, there are other”: In sum, it is said that there are three kinds of wisdom’?*!: such [things] as hearing, thinking and spiritual practice.",
        "source": "T26n1523_001:0205b29_19"
    },
    {
        "source_sentence": "是中前三法，多示盡失助聞慧智故，第四法者，多明盡失思修慧等，是故說四法。",
        "translation": "These are the first three dharmas, because they mostly indicate exhaustion and loss of wisdom that assists in the knowledge of hearing. The fourth dharma often explains exhaustion, volition, cultivation, wisdom, etc.; therefore, it is said to be four dharmas.",
        "source": "T26n1523_001:0205c01_20"
    },
    {
        "source_sentence": "次者是諸法中示相近漸次差別解釋義。",
        "translation": "Next, it's the explanation of the meaning of showing the gradual and distinctive characteristics of dharmas in terms of their proximity.",
        "source": "T26n1523_001:0205c03_21"
    },
    {
        "source_sentence": "佛告迦葉時，勸令聽眾。",
        "translation": "When the Buddha told Kāśyapa, he encouraged the audience to listen.",
        "source": "T26n1523_001:0205c04_22"
    },
    {
        "source_sentence": "聽眾之徒一心，不念餘緣聽故。",
        "translation": "The listeners of the assembly are with one mind: because they do not pay attention to other conditions for listening.",
        "source": "T26n1523_001:0205c04_23"
    },
    {
        "source_sentence": "法者，捨於人故。",
        "translation": "A dharma is because it's abandoned to people.",
        "source": "T26n1523_001:0205c05_24"
    },
    {
        "source_sentence": "言聽法，若不言法者，容有生疑，為欲說法、為欲說人？",
        "translation": "If someone says they're listening to the teaching, and if they don't say the teaching, are they allowed to have doubts that they want to teach or want to teach people?",
        "source": "T26n1523_001:0205c05_25"
    },
    {
        "source_sentence": "問曰：先言菩薩者，以何義故名為菩薩？",
        "translation": "Q: First, what's the meaning of being called a bodhisattva when it's called a bodhisattva?",
        "source": "T26n1523_001:0205c07_26"
    },
    {
        "source_sentence": "答曰：行大乘者，此菩薩名，為攝取多義。",
        "translation": "Answer: When someone practices the great vehicle, this bodhisattva's name is to gather in many meanings.",
        "source": "T26n1523_001:0205c08_27"
    },
    {
        "source_sentence": "然今略說三義說應知：一者信；",
        "translation": "However, it should now be known that the first is faith.",
        "source": "T26n1523_001:0205c08_28"
    },
    {
        "source_sentence": "二者修行；",
        "translation": "The second is enlightening being practice.",
        "source": "T26n1523_001:0205c09_29"
    },
    {
        "source_sentence": "三者證。",
        "translation": "The third is realization.",
        "source": "T26n1523_001:0205c09_30"
    },
    {
        "source_sentence": "云何信？",
        "translation": "What is faith?",
        "source": "T26n1523_001:0205c10_31"
    },
    {
        "source_sentence": "覺知甚深智慧而能令覺故。",
        "translation": "It's because he perceives profound wisdom and can cause it to be perceived.",
        "source": "T26n1523_001:0205c10_32"
    },
    {
        "source_sentence": "云何修行？",
        "translation": "How do they cultivate it?",
        "source": "T26n1523_001:0205c10_33"
    },
    {
        "source_sentence": "為自利利他因故，往行無上菩提。",
        "translation": "Because of self-benefiting and other-benefiting causes, they'll go to practice unsurpassed enlightenment.",
        "source": "T26n1523_001:0205c11_34"
    },
    {
        "source_sentence": "云何得證？",
        "translation": "How do they attain realization?",
        "source": "T26n1523_001:0205c11_35"
    },
    {
        "source_sentence": "以智慧力故，令得證無上菩提。",
        "translation": "It's because of the power of wisdom that they attain unsurpassed enlightenment.",
        "source": "T26n1523_001:0205c12_36"
    },
    {
        "source_sentence": "退失智慧者，明二時有二種失：一、已得失；",
        "translation": "The one who falls back from wisdom explains that there are two kinds of faults at two moments:",
        "source": "T26n1523_001:0205c12_37"
    },
    {
        "source_sentence": "二、當得失。",
        "translation": "2. the gains and losses that will be realized.",
        "source": "T26n1523_001:0205c13_38"
    },
    {
        "source_sentence": "何者退？",
        "translation": "What's retrogression?",
        "source": "T26n1523_001:0205c14_39"
    },
    {
        "source_sentence": "云何失？",
        "translation": "What's the error?",
        "source": "T26n1523_001:0205c14_40"
    },
    {
        "source_sentence": "於無漏中失當得，餘者世間故二時俱失，不甄說退，失智慧故。",
        "translation": "In the pure one, loss is to be acquired. The rest are lost at both moments: because of being worldly and simultaneous'®*”’; in two moments: because of being worldly!?*”, they are not said to be falling back by means of discrimination:",
        "source": "T26n1523_001:0205c14_41"
    },
    {
        "source_sentence": "問曰：無漏亦失。",
        "translation": "Q: What's uncontaminated is also wrong.",
        "source": "T26n1523_001:0205c15_42"
    },
    {
        "source_sentence": "答曰：解釋不爾。",
        "translation": "Answer: That's not the explanation.",
        "source": "T26n1523_001:0205c16_43"
    },
    {
        "source_sentence": "說退失智慧者，欲明不放逸因，於所作事中令作法故，言退失智慧。",
        "translation": "It's said to be a loss of wisdom because they want to explain the causes of nonfrivolity and cause them to do things that are done, which is called a loss of wisdom.",
        "source": "T26n1523_001:0205c16_44"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T26n1523_001:0205c18_45"
    },
    {
        "source_sentence": "有漏智者與無漏智助道因故。",
        "translation": "It's because contaminated cognition and uncontaminated cognition are the causes of the path.",
        "source": "T26n1523_001:0205c18_46"
    },
    {
        "source_sentence": "是有漏智，得已未得二故便失。",
        "translation": "Because there are two kinds of impure knowledge: acquired and not acquired, it is lost.",
        "source": "T26n1523_001:0205c19_47"
    },
    {
        "source_sentence": "無漏智失者，以不得故。",
        "translation": "loss of the pure knowledge: because it is not acquired.",
        "source": "T26n1523_001:0205c19_48"
    },
    {
        "source_sentence": "既證無漏智，則無有退失。",
        "translation": "Once they have realized uncontaminated cognition, then there's no retrogression.",
        "source": "T26n1523_001:0205c20_49"
    },
    {
        "source_sentence": "問曰：云何不尊重等法，令能退失智慧。",
        "translation": "Q: Why doesn't he honor such things that cause him to regress from wisdom?",
        "source": "T26n1523_001:0205c20_50"
    },
    {
        "source_sentence": "答曰：瞋恨故不敬，不敬故不聞，不聞故不生解，以不生解故即現退失智慧。",
        "translation": "Answer: Because of anger and resentment, disrespect doesn't arise; because of disrespect, they don't hear it; because they don't hear it, understanding doesn't arise; because they don't give rise to understanding, they show retrogression and loss of wisdom.",
        "source": "T26n1523_001:0205c21_51"
    },
    {
        "source_sentence": "悋惜諸法，所受諸法祕不盡說，故不聞。",
        "translation": "Because they cherish the teachings and don't explain all the teachings they receive in detail, they won't hear them.",
        "source": "T26n1523_001:0205c23_52"
    },
    {
        "source_sentence": "不聞故於未來世中眾緣不具，緣不具故退失智慧。",
        "translation": "Because of not hearing it, all conditions are not supplied in a future time. Because the conditions are not supplied, one regresses and loses wisdom.",
        "source": "T26n1523_001:0205c24_53"
    },
    {
        "source_sentence": "有樂法者為作留難，說諸因緣沮壞其心，說有餘言，所犯覆藏不能悔過等故。",
        "translation": "Those who delight in the Dharma make it difficult for them to do so, saying that causes and conditions discourage their minds and say there are other words because they can't repent of what they transgress.",
        "source": "T26n1523_001:0205c25_54"
    },
    {
        "source_sentence": "得聞障報已，聞障報故得愚癡因，是故未來必得愚癡，以愚癡故退智慧。",
        "translation": "Having received the retribution of hearing the obstacle, it is because of hearing the obstacle that one acquires the cause of delusion. That is why in the future one will surely attain delusion; because of delusion one will fall back from wisdom.",
        "source": "T26n1523_001:0205c27_55"
    },
    {
        "source_sentence": "其心憍慢自高讚己、卑下他人故令恨他，以恨他故即為倒說，已顛倒說故於未來世中招倒，以招倒故退失智慧。",
        "translation": "Their minds are arrogant and self-exalted, praising themselves and despising others because they cause them to hate others. Because they hate others, they speak falsehoods; because they have already spoken falsehoods, they invite error in the future [world] ; because they invite error, they lose wisdom.",
        "source": "T26n1523_001:0205c28_56"
    },
    {
        "source_sentence": "問曰：何時退失？",
        "translation": "Q: When did he retrogress?",
        "source": "T26n1523_001:0206a02_57"
    },
    {
        "source_sentence": "答曰：二時中現及未來。",
        "translation": "Answer: In two moments, present and future.",
        "source": "T26n1523_001:0206a02_58"
    },
    {
        "source_sentence": "問曰：若布施等諸法亦是退失因，有悋等諸法者，何故但說唯退失智慧因，不說布施等退失因也？",
        "translation": "Q: If such things as generosity and so forth are also causes of retrogression, why do you say that they are only causes of retrogression from wisdom and not causes of retrogression from generosity and so forth?",
        "source": "T26n1523_001:0206a03_59"
    },
    {
        "source_sentence": "答曰：易失故先說。",
        "translation": "Answer: It's explained first because it's easy to lose.",
        "source": "T26n1523_001:0206a05_60"
    },
    {
        "source_sentence": "菩提是智性故，諸餘波羅蜜者從彼智所生，智依止故。",
        "translation": "Because enlightenment is with the nature of knowledge, the other perfections arise from that knowledge: because they are the support of knowledge.",
        "source": "T26n1523_001:0206a06_61"
    },
    {
        "source_sentence": "菩薩於智中邪行已，即於菩提及助菩提法中不名正行，是故但說退失智慧因，不說布施等退失因。",
        "translation": "A bodhisattva who practices wrongly in the midst of wisdom doesn't call it right practice in terms of enlightenment and the factors that aid enlightenment, so he simply explains the causes of retrogression from wisdom and doesn't explain the causes of retrogression from generosity and so forth.",
        "source": "T26n1523_001:0206a07_62"
    },
    {
        "source_sentence": "如是不敬等法，退失智慧因，四句顯說不樂聞等四法。",
        "translation": "Thus, such things as disrespect and so forth are the causes of regression and loss of wisdom, and four sentences show that they don't delight in hearing and so forth.",
        "source": "T26n1523_001:0206a09_63"
    },
    {
        "source_sentence": "是中不敬重故顯說不樂聞，悋惜法故不聞，障他法故得不聞障報，我慢故姤心倒說，如是不能助聞等智退失意。",
        "translation": "Because of being disrespectful, it is said that one does not delight in listening to the doctrine. Because because of being stingy with attachment to doctrine, one does not hear it; because of obstructing other doctrines, one acquires the retribution of not hearing them. Because of self-conceit, one speaks arrogantly and pervertedly [in a coarse] manner. In this way,",
        "source": "T26n1523_001:0206a10_64"
    },
    {
        "source_sentence": "此四法已，以復有餘智相，謂生於四悔法，現及未來。",
        "translation": "In addition to these four factors, there are the other characteristics of knowledge: that is, arising with respect to the four factors of remorse®”*°, present and future.",
        "source": "T26n1523_001:0206a13_65"
    },
    {
        "source_sentence": "何者四法？",
        "translation": "(4) What is the fourfold item?",
        "source": "T26n1523_001:0206a14_66"
    },
    {
        "source_sentence": "一、不能生解；",
        "translation": "The first is that they cannot give rise to understanding.",
        "source": "T26n1523_001:0206a14_67"
    },
    {
        "source_sentence": "二、眾緣不具；",
        "translation": "The second is that they are not endowed with many conditions.",
        "source": "T26n1523_001:0206a15_68"
    },
    {
        "source_sentence": "三、助愚癡福報；",
        "translation": "The third is the meritorious retribution of assisting ignorance.",
        "source": "T26n1523_001:0206a15_69"
    },
    {
        "source_sentence": "四、及已顛倒故、依不聞故，於現法中不生正解。",
        "translation": "4. And because they've already been mistaken and relying on what they haven't heard, right understanding doesn't arise in the present life.",
        "source": "T26n1523_001:0206a15_70"
    },
    {
        "source_sentence": "依不聞故，於未來世中眾緣不具。",
        "translation": "Because it depends on not hearing, the many conditions won't be present in future lives.",
        "source": "T26n1523_001:0206a16_71"
    },
    {
        "source_sentence": "依聞障故，亦於未來世中得愚癡報。",
        "translation": "Because they rely on the hindrance of hearing, they'll also attain the result of folly in future lives.",
        "source": "T26n1523_001:0206a17_72"
    },
    {
        "source_sentence": "依姤心倒說故，未來世得顛倒報。",
        "translation": "Because it is spoken of in relation to the wicked mind, one acquires a future retribution for being wicked.",
        "source": "T26n1523_001:0206a18_73"
    },
    {
        "source_sentence": "問曰：不尊重敬法及不敬法師者，此二句重說有何義？",
        "translation": "Q: What does it mean to say that someone who doesn't respect the Dharma and doesn't respect the teacher of the Dharma, what are these two phrases repeatedly explained?",
        "source": "T26n1523_001:0206a19_74"
    },
    {
        "source_sentence": "答曰：此二句重說中，顯示具足不樂聞意。",
        "translation": "Answer: In these two phrases, it's repeatedly explained that they show the intention of not wanting to hear.",
        "source": "T26n1523_001:0206a20_75"
    },
    {
        "source_sentence": "設有人瞋謗不敬法故不聞其法，敬重法師故樂聽聞法。",
        "translation": "Suppose there's someone who angrily denigrates the teaching and doesn't venerate it because they don't hear it, respects the teacher of the Dharma and therefore happily listens to the teaching.",
        "source": "T26n1523_001:0206a21_76"
    },
    {
        "source_sentence": "復有瞋恨不敬重法師故不聽聞法，復有瞋敬重法故能樂聽聞法。",
        "translation": "Again, there are those who become angry and disrespectful to the teacher of the Dharma and therefore won't listen to the teaching, and those who become angry and respectful to the teaching and therefore can delight in listening to the teaching.",
        "source": "T26n1523_001:0206a22_77"
    },
    {
        "source_sentence": "若二俱瞋恨謗不敬重者，彼眾無方而能聽聞。",
        "translation": "If both are angry, hateful, and disrespectful, the multitude has no direction but can hear.",
        "source": "T26n1523_001:0206a24_78"
    },
    {
        "source_sentence": "是故此二句重說，示現具足不樂聽聞法意。",
        "translation": "Therefore, these two phrases are repeatedly explained in order to show that they fully express the intention of those who don't want to hear the teaching.",
        "source": "T26n1523_001:0206a25_79"
    },
    {
        "source_sentence": "悋惜諸法、所受諸法祕不盡說者，此二句有何義？",
        "translation": "What's the meaning of these two phrases that secretly don't explain all the things they cherish and receive?",
        "source": "T26n1523_001:0206a26_80"
    },
    {
        "source_sentence": "悋惜諸法，見既於他所知解中勝故，即於法中祕不盡說，護得後不敬防畏勝故。",
        "translation": "They cherish the teachings because their views are superior to those of others who know and understand them, which means they secretly don't explain all the teachings in full, and they won't be honored or feared after they're attained.",
        "source": "T26n1523_001:0206a27_81"
    },
    {
        "source_sentence": "或復有義，若請不請一向不說故。",
        "translation": "Or again, there is another interpretation that when invited or not invited, one absolutely does not explain.",
        "source": "T26n1523_001:0206a29_82"
    },
    {
        "source_sentence": "悋法者，或有向說、或復不說、或復悋法故棄捨正法，已捨法故即壞其心。",
        "translation": "A debilitating dharma is someone who teaches what's taught, doesn't teach it again, or abandons the right teaching because of debilitating dharmas, and destroys their mind because they've abandoned the teaching.",
        "source": "T26n1523_001:0206b01_83"
    },
    {
        "source_sentence": "所受諸法祕不盡說，起悋惜心行故說言壞行，有樂法者為作留難，說諸因緣沮壞其心，說有餘言，所犯覆藏不能悔過。",
        "translation": "He doesn't explain all the teachings that he receives in detail, and because he gives rise to thoughts of stinginess and behavior, he speaks of disruptive behavior. Those who delight in the Dharma make it difficult for others, explaining the causes and conditions that disturb their minds, saying there are other words, and covering up the offenses without repentance.",
        "source": "T26n1523_001:0206b02_84"
    },
    {
        "source_sentence": "如是等句有何異義？",
        "translation": "What's the difference in meaning of such phrases as these?",
        "source": "T26n1523_001:0206b05_85"
    },
    {
        "source_sentence": "是中有樂法而作留難者，此是說有餘言。",
        "translation": "This is saying that there's a pleasant dharma and making it difficult to stay here, but this is saying something else.",
        "source": "T26n1523_001:0206b06_86"
    },
    {
        "source_sentence": "云何樂法者而作留難？",
        "translation": "What's a person who delights in the Dharma and makes it difficult to do so?",
        "source": "T26n1523_001:0206b07_0"
    },
    {
        "source_sentence": "說諸因緣沮壞其心，呵責說有餘言，所犯覆藏不能悔過。",
        "translation": "He explains the causes and conditions that disturb his mind, rebuke it, and say anything else, and he doesn't repent of the offense committed by the covering store.",
        "source": "T26n1523_001:0206b07_1"
    },
    {
        "source_sentence": "云何沮壞人法並說諸惡？",
        "translation": "How is it that they disrupt people and dharmas and speak of bad things?",
        "source": "T26n1523_001:0206b08_2"
    },
    {
        "source_sentence": "所有法從人所欲樂聽聞者，彼法及彼人。",
        "translation": "All the teachings that are heard from someone who desires to hear them, these teachings and those people.",
        "source": "T26n1523_001:0206b09_3"
    },
    {
        "source_sentence": "已無實言及無義者，而言能種種說。",
        "translation": "Since there are no real words and no meanings, it's said to be able to explain variously.",
        "source": "T26n1523_001:0206b10_4"
    },
    {
        "source_sentence": "既說已即令不復樂聞。",
        "translation": "After he explains it, he causes them to no longer delight in listening.",
        "source": "T26n1523_001:0206b11_5"
    },
    {
        "source_sentence": "云何說諸因緣呵責等？",
        "translation": "How do we explain the causes, conditions, rebukes, etc.?",
        "source": "T26n1523_001:0206b11_6"
    },
    {
        "source_sentence": "所說不正，復言無限。",
        "translation": "The explanation is incorrect, and it's further said to be infinite.",
        "source": "T26n1523_001:0206b12_7"
    },
    {
        "source_sentence": "或復樂聞者，為助種種難訪無限等言說。",
        "translation": "Those who are also happy to hear it will be able to help various kinds of difficult-to-obtain and limitless explanations.",
        "source": "T26n1523_001:0206b12_8"
    },
    {
        "source_sentence": "聞難訪等，即便不聽亦不樂聞。",
        "translation": "When someone hears something difficult to visit and so forth, they don't even hear it and don't enjoy hearing it.",
        "source": "T26n1523_001:0206b13_9"
    },
    {
        "source_sentence": "云何不能？",
        "translation": "How could it not be?",
        "source": "T26n1523_001:0206b14_10"
    },
    {
        "source_sentence": "為說教故復請而不受。",
        "translation": "In order to explain the teaching, he's again invited but doesn't accept it.",
        "source": "T26n1523_001:0206b14_11"
    },
    {
        "source_sentence": "有他樂法者來請問說法，已悋惜法故即不為說，復不請餘法師等。",
        "translation": "Someone who delights in the Dharma comes to ask questions and teaches the Dharma, but because they're stingy with the Dharma, they won't teach it, and they won't invite other masters of the Dharma.",
        "source": "T26n1523_001:0206b15_12"
    },
    {
        "source_sentence": "若欲請聞不為許可。",
        "translation": "If he wants to ask for permission, he won't allow it.",
        "source": "T26n1523_001:0206b16_13"
    },
    {
        "source_sentence": "云何覆藏？",
        "translation": "What's the hidden treasure?",
        "source": "T26n1523_001:0206b17_14"
    },
    {
        "source_sentence": "說其聽者及呵聽眾，亦說彼法。",
        "translation": "He teaches the listeners and the audience who rebuke him, and he also teaches the teaching.",
        "source": "T26n1523_001:0206b17_15"
    },
    {
        "source_sentence": "汝等無智，此法甚深不能通達知故，已說聽眾故覆藏正法。",
        "translation": "You have no knowledge, because this teaching is so profound that you can't comprehend it. It's because you've already explained the hidden treasure of the right teaching for the sake of listening to the crowd.",
        "source": "T26n1523_001:0206b18_16"
    },
    {
        "source_sentence": "如是障法因緣，令得難處果報。",
        "translation": "Thus, the causes and conditions of these hindrances cause them to attain the results of difficult places.",
        "source": "T26n1523_001:0206b19_17"
    },
    {
        "source_sentence": "其心憍慢自高讚己卑下他人，如是等句有何義？",
        "translation": "What does it mean to say that they are arrogant and self-exalted, praising themselves and despising others?",
        "source": "T26n1523_001:0206b20_18"
    },
    {
        "source_sentence": "憍慢者說初句。",
        "translation": "The arrogant teaches the first phrase.",
        "source": "T26n1523_001:0206b21_19"
    },
    {
        "source_sentence": "云何憍慢？",
        "translation": "What is arrogance?",
        "source": "T26n1523_001:0206b21_20"
    },
    {
        "source_sentence": "若讚己為勝、毀謗於他。",
        "translation": "If someone praises themselves as superior and disparages others.",
        "source": "T26n1523_001:0206b21_21"
    },
    {
        "source_sentence": "云何讚己為勝？",
        "translation": "How do you praise yourself as superior?",
        "source": "T26n1523_001:0206b22_22"
    },
    {
        "source_sentence": "自所說不善、修行不正，見他所說皆善修行亦正，於中起慢妬心。",
        "translation": "What they teach themselves is unwholesome and their practice is incorrect, and they see that what others teach is well-practiced and correct, and they become conceited and jealous of it.",
        "source": "T26n1523_001:0206b22_23"
    },
    {
        "source_sentence": "云何毀謗於他？",
        "translation": "How do you disparage others?",
        "source": "T26n1523_001:0206b24_24"
    },
    {
        "source_sentence": "若他善說善修行中，生不善說、不善修憍慢妬心想，已憍慢患故，令不能得證正覺智慧。",
        "translation": "If someone well-explained and well-cultivated by others gives rise to unwholesome explanations and doesn't cultivate the perception of arrogance and jealousy, it's because they're already suffering from the affliction of conceit that they can't attain the wisdom of right awakening.",
        "source": "T26n1523_001:0206b24_25"
    },
    {
        "source_sentence": "諸法盡證所攝，此要略而說：一、唯所退失；",
        "translation": "The dharmas are included in the exhaustion of realization. These are briefly stated:",
        "source": "T26n1523_001:0206b26_26"
    },
    {
        "source_sentence": "二、如何退失；",
        "translation": "The second is the question of how one can turn away from it.",
        "source": "T26n1523_001:0206b27_27"
    },
    {
        "source_sentence": "三、以何時失；",
        "translation": "3. What is the occasion for error?",
        "source": "T26n1523_001:0206b27_28"
    },
    {
        "source_sentence": "四、所有既法退失，彼盡顯示。",
        "translation": "4. Since they've regressed from all the teachings, they show them up in full.",
        "source": "T26n1523_001:0206b28_29"
    },
    {
        "source_sentence": "何處退失者，於智慧中如何退失。",
        "translation": "What's the place where they regress? How do they regress in wisdom?",
        "source": "T26n1523_001:0206b28_30"
    },
    {
        "source_sentence": "以何想退失者，失已解釋。",
        "translation": "What's the reason for conceptualizing retrogression? The explanation of loss has already been explained.",
        "source": "T26n1523_001:0206b29_31"
    },
    {
        "source_sentence": "何時退失者，現在及未來。",
        "translation": "At what moment is falling back?*”: the present and the future.",
        "source": "T26n1523_001:0206c01_32"
    },
    {
        "source_sentence": "所有既法而退失者，明不敬重等四法。",
        "translation": "Those who regress because of their past dharmas explain the four kinds of things like disrespectfulness.",
        "source": "T26n1523_001:0206c01_33"
    },
    {
        "source_sentence": "已有此不恭敬等四法，能令退失智慧等法障，故說四對治法。",
        "translation": "These four characteristics of disrespect, etc., are already present and can cause one to fall away from the dharmas that obstruct wisdom, etc.; therefore, they are said to be four antidotes.",
        "source": "T26n1523_001:0206c02_34"
    },
    {
        "source_sentence": "「復次迦葉！",
        "translation": "Furthermore, Kāśyapa!",
        "source": "T26n1523_001:0206c03_35"
    },
    {
        "source_sentence": "菩薩有四法成大智慧。",
        "translation": "A bodhisattva has four ways to accomplish great wisdom.",
        "source": "T26n1523_001:0206c04_36"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T26n1523_001:0206c04_37"
    },
    {
        "source_sentence": "所謂尊敬重法及敬法師」等。",
        "translation": "It's called respecting the Dharma and honoring the teacher of the Dharma, etc.",
        "source": "T26n1523_001:0206c04_38"
    },
    {
        "source_sentence": "菩薩順行此敬等法因故，得與大智因故，生四種智慧。",
        "translation": "Because bodhisattvas follow these causes of respect and so forth, they attain the causes of great wisdom and give rise to four kinds of wisdom because of the causes of great knowledge.",
        "source": "T26n1523_001:0206c05_39"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T26n1523_001:0206c06_40"
    },
    {
        "source_sentence": "一者起；",
        "translation": "The first is arousal.",
        "source": "T26n1523_001:0206c07_41"
    },
    {
        "source_sentence": "二者成熟；",
        "translation": "The second is maturation.",
        "source": "T26n1523_001:0206c07_42"
    },
    {
        "source_sentence": "三者滿足助道；",
        "translation": "The third is to fulfill the aids to enlightenment.",
        "source": "T26n1523_001:0206c07_43"
    },
    {
        "source_sentence": "四者能為成菩提。",
        "translation": "Fourth, it's capable of accomplishing enlightenment.",
        "source": "T26n1523_001:0206c07_44"
    },
    {
        "source_sentence": "然彼恭敬故樂聽聞法，既聞法已便得起發智慧，隨所聞讀誦受持諸法，以清淨心廣為人說，而不求一切名聞利養恭敬等事故，令得化他成熟心智。",
        "translation": "Having heard the teaching, they then attain wisdom that arises, recites and retains what they've heard, explains it widely for others with a pure mind, doesn't seek all kinds of things like fame, profit, respect, and so forth, and attains the knowledge of the mind to transform others.",
        "source": "T26n1523_001:0206c08_45"
    },
    {
        "source_sentence": "善知智慧從多聞生，精進不懈怠如救頭燃，聞法誦持樂如說行。",
        "translation": "He well knows that wisdom arises from much learning, makes effort without laziness like rescuing someone whose hair is on fire, and hears the teaching, recites it, retains it, and practices it as he says.",
        "source": "T26n1523_001:0206c11_46"
    },
    {
        "source_sentence": "不隨言說常求多聞，聞則憶持不忘故。",
        "translation": "It's because they don't follow language and always seek much learning, and when they hear it, they retain it and don't forget it.",
        "source": "T26n1523_001:0206c13_47"
    },
    {
        "source_sentence": "令得滿足助道智行其實行，行不隨言語及已音聲，為實行故令能得成菩提智慧。",
        "translation": "It causes them to attain the knowledge that fulfills the practice of the auxiliary path, doesn't follow words or sounds, and causes them to attain the wisdom that accomplishes enlightenment because it's really practiced.",
        "source": "T26n1523_001:0206c14_48"
    },
    {
        "source_sentence": "是中尊敬重法及敬法師者，以不敬重故，對治說敬重應知。",
        "translation": "These are those who revere the Dharma and venerate teachers of the Dharma because they don't revere it, which should be known as reverence in terms of antidotes.",
        "source": "T26n1523_001:0206c15_49"
    },
    {
        "source_sentence": "隨所聞諸法讀誦受持，是中聞者以耳識故，誦持者以意識故。",
        "translation": "Whatever dharmas are heard, one recites and retains them. This means that what is heard is because of the consciousness of the organ of hearing; what is recited and retains is because of the consciousness of the mind.",
        "source": "T26n1523_001:0206c17_50"
    },
    {
        "source_sentence": "或復聞者以聞慧故，誦持者以思慧故。",
        "translation": "Again, it's because of the wisdom of hearing that someone who hears and recites it because of the wisdom of contemplation.",
        "source": "T26n1523_001:0206c18_51"
    },
    {
        "source_sentence": "經言以清淨心廣為人說者，以離慳妬嫉心故。",
        "translation": "The sūtras say that someone explains it for others with a pure mind because they're free of stinginess and jealousy.",
        "source": "T26n1523_001:0206c19_52"
    },
    {
        "source_sentence": "不求一切名聞利養恭敬等事者，是則悋法因故。",
        "translation": "Those who don't seek all the things like fame, hearing, profit, support, respect, and so forth are the causes of deceitfulness in the Dharma.",
        "source": "T26n1523_001:0206c20_53"
    },
    {
        "source_sentence": "利養者，衣服等。",
        "translation": "Beneficent means clothing, etc.",
        "source": "T26n1523_001:0206c21_54"
    },
    {
        "source_sentence": "恭敬者，禮拜等。",
        "translation": "Respect is veneration and so forth.",
        "source": "T26n1523_001:0206c22_55"
    },
    {
        "source_sentence": "名聞者，稱揚諸功德。",
        "translation": "A well-known person praises the merits.",
        "source": "T26n1523_001:0206c22_56"
    },
    {
        "source_sentence": "以多聞故堪得聞慧等智已，如救頭燃修求聞慧，為求聞慧故勸轉明修慧。",
        "translation": "It's because of being well-versed that they're capable of attaining the wisdom of hearing, and so forth, like rescuing someone whose hair is on fire who cultivates the wisdom of hearing and encouraging them to develop the wisdom of understanding in order to seek the wisdom of hearing.",
        "source": "T26n1523_001:0206c22_57"
    },
    {
        "source_sentence": "譬如有人或燃頭或燃衣，彼人捨一切諸事先救頭及衣服。",
        "translation": "It's like a person who either burns their hair or clothing, and that person abandons all the previously salvaged hair and clothing.",
        "source": "T26n1523_001:0206c24_58"
    },
    {
        "source_sentence": "菩薩亦如是，知聞慧是智因智者，乃至亦能得一切智因故，轉勤求聞，為自利利他故。",
        "translation": "Similarly, bodhisattvas who know that the wisdom of hearing is the knowledge of the causes of cognition... because they can also attain the causes of omniscience and become more diligent in seeking to hear it for their own benefit and others' benefit.",
        "source": "T26n1523_001:0206c26_0"
    },
    {
        "source_sentence": "隨所聞法而能誦持及如說行者，若隨聞而能取義者，彼已順行故則能生如順智，非如但有音聲語言者，非如但求聞、非但口說。",
        "translation": "If someone can recite and retain the teachings they've heard and practice them as they're taught, and if they can apprehend meanings according to what they hear, it's because they've done so that they can give rise to such-and-such knowledge. It's not like someone who simply has sounds and words, or someone who simply seeks to hear and doesn't just speak verbally.",
        "source": "T26n1523_001:0206c27_1"
    },
    {
        "source_sentence": "或復無義故，或復所說皆無出世之益。",
        "translation": "Or they may have no meaning, or whatever they teach has no supramundane benefit.",
        "source": "T26n1523_001:0207a02_2"
    },
    {
        "source_sentence": "順次解釋不尊敬重法及行順法已成悋惜諸法。",
        "translation": "He explains in order that he doesn't venerate the Dharma and practices following the Dharma. Having done so, he cherishes the Dharma.",
        "source": "T26n1523_001:0207a03_3"
    },
    {
        "source_sentence": "悋惜法已，於樂求法者起諸障礙，祕不為說。",
        "translation": "Having cherished the Dharma, he creates obstacles for those who delight in seeking the Dharma and doesn't explain it secretly.",
        "source": "T26n1523_001:0207a04_4"
    },
    {
        "source_sentence": "彼滅此三種智因，已無智故則起我慢。",
        "translation": "The cessation of these three kinds of knowledge is the cause for cognition, and because there's no cognition, self-conceit arises.",
        "source": "T26n1523_001:0207a05_5"
    },
    {
        "source_sentence": "自法對治尊敬法者，已順行法及次法故離慳悋惜心已，隨所聞法廣為人說，好樂法故求多聞記，具多聞已即能行自利利他之行，隨說修行不著語言。",
        "translation": "He who respects the teaching as antidote to his own teaching and follows the practice of the teaching, parts with stinginess and generosity because he's following the practice of the teaching and the next teaching, explains the teaching widely for others according to what he hears, seeks to be well-versed because he loves the teaching, and after having heard it extensively, he's able to perform the practice of",
        "source": "T26n1523_001:0207a06_6"
    },
    {
        "source_sentence": "語言，音聲等事。",
        "translation": "Words, sounds, sounds, etc.",
        "source": "T26n1523_001:0207a09_7"
    },
    {
        "source_sentence": "菩提心者，唯智根本。",
        "translation": "The mind of enlightenment is only the root of knowledge.",
        "source": "T26n1523_001:0207a10_8"
    },
    {
        "source_sentence": "一切智者，唯菩提心為本。",
        "translation": "All cognition is based solely on the mind of enlightenment.",
        "source": "T26n1523_001:0207a10_9"
    },
    {
        "source_sentence": "是以不忘菩提心故。",
        "translation": "That's because they don't forget the mind of enlightenment.",
        "source": "T26n1523_001:0207a11_10"
    },
    {
        "source_sentence": "忘菩提心及已不忘諸法因故。",
        "translation": "It's because they forget the mind of enlightenment and haven't forgotten the causes of the teachings.",
        "source": "T26n1523_001:0207a11_11"
    },
    {
        "source_sentence": "「佛告迦葉：菩薩有四法忘失菩提心。",
        "translation": "The Buddha told Kāśyapa, There are four ways a bodhisattva forgets the mind of enlightenment.",
        "source": "T26n1523_001:0207a12_12"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T26n1523_001:0207a13_13"
    },
    {
        "source_sentence": "欺誑阿闍梨」等。",
        "translation": "They deceive the Ajari and so forth.",
        "source": "T26n1523_001:0207a13_14"
    },
    {
        "source_sentence": "問曰：何故但說有四法能忘失菩提心因，不多不少？",
        "translation": "Q: Why is it only said that there are four things that can forget the causes of the mind of enlightenment, not many and not many?",
        "source": "T26n1523_001:0207a13_15"
    },
    {
        "source_sentence": "答曰：忘失有四種故。",
        "translation": "Answer: There are four kinds of forgetfulness.",
        "source": "T26n1523_001:0207a15_16"
    },
    {
        "source_sentence": "略說有四種：一、不正信忘失；",
        "translation": "There are, in brief, four kinds:",
        "source": "T26n1523_001:0207a15_17"
    },
    {
        "source_sentence": "二、信顛倒忘失，於菩提心中見有過故；",
        "translation": "The second is that faith is mistaken and forgetful, because there are faults in the view of enlightenment.",
        "source": "T26n1523_001:0207a16_18"
    },
    {
        "source_sentence": "三、所受諸法皆是假名心故忘失；",
        "translation": "The third is that all the dharmas received are falsely named mental states, and therefore they are forgetful.",
        "source": "T26n1523_001:0207a17_19"
    },
    {
        "source_sentence": "四、得法體心忘失。",
        "translation": "4. forgetfulness of the mind that attains the essence of the Dharma.",
        "source": "T26n1523_001:0207a17_20"
    },
    {
        "source_sentence": "此四種忘失中，對有四種因，如是次第應知。",
        "translation": "In succession to these four kinds of forgetfulness, there are four kinds of causes:",
        "source": "T26n1523_001:0207a18_21"
    },
    {
        "source_sentence": "是中欺誑阿闍梨師長等者，於師長前不能如實語。",
        "translation": "This is someone who deceives a preceptor, teacher, etc., and doesn't speak truthfully in front of their teacher.",
        "source": "T26n1523_001:0207a19_22"
    },
    {
        "source_sentence": "既犯罪不發露故，妄語心誑故，即成欺誑師長。",
        "translation": "Since the offense isn't revealed, and because the mind is angry with false speech, it becomes a teacher of deceit.",
        "source": "T26n1523_001:0207a20_23"
    },
    {
        "source_sentence": "是中阿闍梨者，能諫及勸指授。",
        "translation": "A preceptor here is someone who can admonish and encourage.",
        "source": "T26n1523_001:0207a21_24"
    },
    {
        "source_sentence": "隨彼所犯為令發露，此不應作。",
        "translation": "Whatever offenses they commit in order to make them known, this shouldn't be done.",
        "source": "T26n1523_001:0207a22_25"
    },
    {
        "source_sentence": "先所犯罪為欲懺滅故，說諸方便，汝應如是作。",
        "translation": "Because you want to repent and extinguish the sins you've committed before, you should explain the method of doing so.",
        "source": "T26n1523_001:0207a23_26"
    },
    {
        "source_sentence": "師長者，若能助益長秀聖者，雖非師長已有諸功德故，憐愍與樂、勸止惡修善。",
        "translation": "If a teacher or elder is able to assist a noble person who's long-standing, even though he's not a teacher or elder and already possesses merit, he's compassionate and blissful, encourages stopping evil and cultivating goodness.",
        "source": "T26n1523_001:0207a24_27"
    },
    {
        "source_sentence": "為既犯故，令彼以妄語忘失。",
        "translation": "Because it's a violation, they cause them to forget it by speaking falsely.",
        "source": "T26n1523_001:0207a25_28"
    },
    {
        "source_sentence": "以是義故，助得增上業報。",
        "translation": "Because of this meaning, they'll help attain the results of superior actions.",
        "source": "T26n1523_001:0207a26_29"
    },
    {
        "source_sentence": "已助得增上業報故，成不正信忘失菩提心應知。",
        "translation": "Because they've already helped to attain the results of increased karma, they become mistakenly faithful and forget their mind of enlightenment, which should be known.",
        "source": "T26n1523_001:0207a27_30"
    },
    {
        "source_sentence": "若彼不能令忘失者，如是彼已習妄語及得戒障故忘失菩提心，是名初因。",
        "translation": "If someone can't cause them to forget it, then they'll forget the mind of enlightenment because they've cultivated false speech and attained the hindrance of precepts, which is called the first cause.",
        "source": "T26n1523_001:0207a28_31"
    },
    {
        "source_sentence": "無疑悔者令生疑悔，同修梵行中無疑能令生顛倒疑故，同梵行中正修戒行者於戒中令起疑惑故。",
        "translation": "Those who have no doubts and repentance cause doubts to arise because they cultivate the same religious practice without doubts that can cause mistaken doubts to arise, and those who correctly cultivate the precepts in the same religious practice cause doubts to arise in the precepts.",
        "source": "T26n1523_001:0207b01_32"
    },
    {
        "source_sentence": "彼如是同梵行中不至心恭敬及行諂曲心，能於戒中生疑惑故，生深重業障。",
        "translation": "Thus, they're the same as those who don't sincerely respect and practice flattering thoughts in their religious practice, and because they can give rise to doubt and confusion in the precepts, profound karmic hindrances arise.",
        "source": "T26n1523_001:0207b03_33"
    },
    {
        "source_sentence": "彼以是故，於菩提心中顛倒，不正信見過故忘菩提心。",
        "translation": "Because of this, they're mistaken in their mind about enlightenment and forget the mind of enlightenment because they don't correctly believe and see faults.",
        "source": "T26n1523_001:0207b05_34"
    },
    {
        "source_sentence": "彼若不能令生疑惑者，如是彼已謗說故令忘菩提心，是名第二因。",
        "translation": "If they can't cause doubt to arise, and thus they forget the mind of enlightenment because they've already denigrated it, this is called the second cause.",
        "source": "T26n1523_001:0207b06_35"
    },
    {
        "source_sentence": "修大乘人，呵罵誹謗廣彰惡名，樂修法者隨所有法利，彼能令遠離背故。",
        "translation": "A person who cultivates the great vehicle ridicules and denigrates people and extensively expresses bad reputations, and those who delight in cultivating the Dharma follow all the benefits of the Dharma because they can cause them to be far removed from it.",
        "source": "T26n1523_001:0207b07_36"
    },
    {
        "source_sentence": "若有信樂修大乘者，為欲壞彼故，呵罵誹謗廣彰惡名，說不善言破壞，說無利益無利益語。",
        "translation": "If there are those who believe in and cultivate the great vehicle because they want to destroy it, they ridicule and denigrate it, extensively express bad names, speak unwholesome words that break it, and speak words that are neither beneficial nor beneficial.",
        "source": "T26n1523_001:0207b09_37"
    },
    {
        "source_sentence": "是中不善語者，說惡名響彰其諸過，所謂破戒。",
        "translation": "This is called breaking the precepts when someone speaks unwholesome words and says a bad name that resonates to show their faults.",
        "source": "T26n1523_001:0207b11_38"
    },
    {
        "source_sentence": "發言說謂惡，廣彰人短謂非梵行，分別說者不稱功德、隨彰其說惡。",
        "translation": "Discriminatingly speaking means not praising virtue and following it to show that they speak evil.",
        "source": "T26n1523_001:0207b12_39"
    },
    {
        "source_sentence": "有如是等事，彼如是向諸菩薩說無利語，分別廣彰惡名等。",
        "translation": "If there are such things, they'll thus speak unbeneficial words to the bodhisattvas and discriminate and extensively express bad names.",
        "source": "T26n1523_001:0207b14_40"
    },
    {
        "source_sentence": "若欲修大乘者，如是等令退迷惑。",
        "translation": "If someone wants to cultivate the great vehicle, they'll cause them to regress and be confused like this.",
        "source": "T26n1523_001:0207b15_41"
    },
    {
        "source_sentence": "彼如是向諸菩薩心不恭敬已，所有功德則便覆藏。",
        "translation": "After they thus show disrespect to the bodhisattvas, all their merits will then be concealed.",
        "source": "T26n1523_001:0207b16_42"
    },
    {
        "source_sentence": "已覆藏故令惡深重業障。",
        "translation": "It's because they have covered the store and caused bad, profound karmic hindrances.",
        "source": "T26n1523_001:0207b17_43"
    },
    {
        "source_sentence": "以彼障故，本所修戒心即便滅壞。",
        "translation": "Because of those hindrances, the mind that originally cultivated precepts will cease and disintegrate.",
        "source": "T26n1523_001:0207b18_44"
    },
    {
        "source_sentence": "若使不能覆藏菩薩真實功德者，彼如是以得戒障故退滅其心，是名第三因。",
        "translation": "If someone who can't conceal the true virtue of the bodhisattva and withdraw their mind because they thus attain the hindrance of morality, this is called the third cause.",
        "source": "T26n1523_001:0207b19_45"
    },
    {
        "source_sentence": "以諂曲心與他從事非真實心者，欲為諸法師開彰諸祕密之事，令生迷惑故。",
        "translation": "Someone who cultivates a flattering mind with others and doesn't really have a true mind wants to reveal the esoteric things for the masters of the Dharma so that confusion will arise.",
        "source": "T26n1523_001:0207b20_46"
    },
    {
        "source_sentence": "是中諂者，以虛偽無有實心而與從事故。",
        "translation": "This is called flattering because it's false and lacks a real mind that gives rise to things.",
        "source": "T26n1523_001:0207b22_47"
    },
    {
        "source_sentence": "曲者，以心諂誑非真實心與人隨順，為欲諸法師開彰說行諸祕密之事。",
        "translation": "A crooked person's mind is flattering because it's not true, and their mind and people follow it, wanting the masters of the Dharma to reveal the esoteric things that are practiced.",
        "source": "T26n1523_001:0207b23_48"
    },
    {
        "source_sentence": "從諸法師所聞深密微妙法已，若有修行大乘者，為彼能起誹謗意。",
        "translation": "After hearing the profound and subtle teachings from the masters of the Dharma, if someone cultivates the great vehicle, they'll be able to give rise to the intention to denigrate them.",
        "source": "T26n1523_001:0207b25_49"
    },
    {
        "source_sentence": "作如是意已，令助無量惡業。",
        "translation": "Having done so, he causes measureless bad actions to be assisted.",
        "source": "T26n1523_001:0207b26_50"
    },
    {
        "source_sentence": "以有彼業障故，應得順法心而成遠離退失。",
        "translation": "Because there are these karmic hindrances, they should be able to follow the mind of the Dharma and become free of retrogression.",
        "source": "T26n1523_001:0207b27_51"
    },
    {
        "source_sentence": "若不能誹謗遠離者，彼以如是故，於戒障中心得退失。",
        "translation": "If someone can't denigrate seclusion, it's because of this that they attain retrogression in the midst of the hindrance of precepts.",
        "source": "T26n1523_001:0207b28_52"
    },
    {
        "source_sentence": "略說以何退失，所謂心何時退失？",
        "translation": "What's the reason for this loss? It's briefly explained that when does the mind lose it?",
        "source": "T26n1523_001:0207b29_53"
    },
    {
        "source_sentence": "現法中及已未來行中。",
        "translation": "In the present life and in past and future lives.",
        "source": "T26n1523_001:0207c01_54"
    },
    {
        "source_sentence": "如何等行？",
        "translation": "How are they equal in terms of practice?",
        "source": "T26n1523_001:0207c01_55"
    },
    {
        "source_sentence": "於師尊長中不正恭敬等故。",
        "translation": "It's because they don't correctly venerate their teacher and so forth.",
        "source": "T26n1523_001:0207c02_56"
    },
    {
        "source_sentence": "有何等相？",
        "translation": "What are their characteristics?",
        "source": "T26n1523_001:0207c02_57"
    },
    {
        "source_sentence": "具四法故。",
        "translation": "It's because it contains the four dharmas.",
        "source": "T26n1523_001:0207c03_0"
    },
    {
        "source_sentence": "彼以顯說對治彼故，說四善法應知。",
        "translation": "Because they expressly preach the antidote for them, it's because they preach four good qualities that should be known.",
        "source": "T26n1523_001:0207c03_1"
    },
    {
        "source_sentence": "經言「菩薩乃至失命因緣不故妄語」者，護治實語故、以不惜身命故，何況戲笑者。",
        "translation": "The sūtra says, A bodhisattva doesn't speak falsely for the sake of protecting true speech or because he doesn't spare his life, so why wouldn't he?",
        "source": "T26n1523_001:0207c04_2"
    },
    {
        "source_sentence": "菩薩於微輕罪中生大怖畏故，常以真心與人從事者，以離無我諂曲心故。",
        "translation": "Because a bodhisattva becomes greatly frightened by minor sins, he always serves people with his mind because he's free of selfless flattering thoughts.",
        "source": "T26n1523_001:0207c05_3"
    },
    {
        "source_sentence": "是中真心者，實心隨順親近故。",
        "translation": "Mindfulness among these is because the real mind follows and becomes intimate with it.",
        "source": "T26n1523_001:0207c07_4"
    },
    {
        "source_sentence": "離無我患者，菩薩如實親近，不示假名、行離諂曲，遠離不調伏惡心故。",
        "translation": "Being free of selflessness as a patient, the bodhisattva truly becomes intimate, doesn't show false names, practices free of flattery, and is far removed from unruly bad thoughts.",
        "source": "T26n1523_001:0207c08_5"
    },
    {
        "source_sentence": "於一切菩薩生世尊想，能為諸菩薩於四方中稱揚功德者，隨所得法利彼常讚歎故。",
        "translation": "All the bodhisattvas give rise to the perception of the Bhagavān and are able to praise the merits of those bodhisattvas in the four directions, because they always praise them for the benefits of the Dharma that they attain.",
        "source": "T26n1523_001:0207c09_6"
    },
    {
        "source_sentence": "自不愛樂諸小乘法，隨所化眾生令彼一切住阿耨多羅三藐三菩提者，不樂狹小乘，己劣弱故；",
        "translation": "They themselves do not delight in the teachings of the lesser vehicle and cause all to abide in unexcelled complete perfect enlightenment according to the sentient beings they teach.",
        "source": "T26n1523_001:0207c11_7"
    },
    {
        "source_sentence": "既得上義，行所攝取化意欲故。",
        "translation": "Since they've attained the higher meaning, it's because of the intention to cultivate what's collected by practice.",
        "source": "T26n1523_001:0207c14_0"
    },
    {
        "source_sentence": "此諸句漸次重釋，欺誑阿闍梨等，復不供養恭敬阿闍梨師長等故，於戒法中不生慇重速疾之意。",
        "translation": "These phrases are gradually and repeatedly explained in order, deceiving preceptors and so forth, and they don't offer support to respectful preceptors, teachers, and so forth, so they don't give rise to the idea of seriousness or speedyness in regard to the precepts.",
        "source": "T26n1523_001:0207c14_1"
    },
    {
        "source_sentence": "自無慚愧悔過，見他有慚愧悔過者，為令惱故，助不安樂心憂惱彼，己無慚愧開令悔故。",
        "translation": "Those who themselves lack shamelessness and repent of their faults and those who see others with shamefulness and repent of their faults are the ones who, in order to cause disturbance, help uncomfortable minds to grieve for them because they lack shamelessness on their own and enable them to repent.",
        "source": "T26n1523_001:0207c16_2"
    },
    {
        "source_sentence": "於修大乘人中說諸惡事，以謗菩提心所起諸利益他心無故。",
        "translation": "Among those who cultivate the great vehicle, they say bad things because they denigrate the absence of other-benefiting thoughts that arise from the mind of enlightenment.",
        "source": "T26n1523_001:0207c18_3"
    },
    {
        "source_sentence": "以諂曲心與他從事非實真心，復有不失諸句漸次重釋，以實語不忘菩提心集因故，不失菩提心所起眾生饒益故。",
        "translation": "With a flattering mind that engages with others and doesn't really have true mind, there are also gradually and repeatedly explained phrases that aren't lost because they don't forget the causes of the accumulation of the mind of enlightenment in terms of reality, and they don't lose the benefits to sentient beings who give rise to the mind of enlightenment.",
        "source": "T26n1523_001:0207c20_4"
    },
    {
        "source_sentence": "自身中所有無量希有諸法，知已敬菩提心及一切智因故。",
        "translation": "In his own body, there are measureless rare dharmas that he knows have honored the mind of enlightenment and the causes of omniscience.",
        "source": "T26n1523_001:0207c23_0"
    },
    {
        "source_sentence": "於菩提心并一切菩薩所起世尊想已，敬菩提心故。",
        "translation": "It's because they revere the mind of enlightenment and all the bodhisattva conceptions that arise from the Bhagavān in order to honor the mind of enlightenment.",
        "source": "T26n1523_001:0207c24_1"
    },
    {
        "source_sentence": "所化眾生，彼一切勸令向阿耨多羅三藐三菩提，不憙樂求行狹劣小乘之法。",
        "translation": "The sentient beings they teach are all encouraged to aspire to unsurpassed, correct, and complete enlightenment, not longing to practice the teachings of the narrow and inferior lesser vehicle.",
        "source": "T26n1523_001:0207c25_2"
    },
    {
        "source_sentence": "菩提心者，是菩提應義。",
        "translation": "The mind of enlightenment is the meaning of response to enlightenment.",
        "source": "T26n1523_001:0207c27_3"
    },
    {
        "source_sentence": "問曰：若是菩薩初發心者，我當成於正覺。",
        "translation": "Q: If a bodhisattva first arouses the mind, I'll become perfectly enlightened.",
        "source": "T26n1523_001:0207c27_4"
    },
    {
        "source_sentence": "彼心有何等性？",
        "translation": "What's the nature of that mind?",
        "source": "T26n1523_001:0207c28_5"
    },
    {
        "source_sentence": "復有何相？",
        "translation": "What are the other characteristics?",
        "source": "T26n1523_001:0207c29_6"
    },
    {
        "source_sentence": "有何等念？",
        "translation": "What kind of thought is there?",
        "source": "T26n1523_001:0207c29_7"
    },
    {
        "source_sentence": "有何功德？",
        "translation": "What merit does it have?",
        "source": "T26n1523_001:0207c29_8"
    },
    {
        "source_sentence": "有何勝事？",
        "translation": "What's the superior thing?",
        "source": "T26n1523_001:0207c29_9"
    },
    {
        "source_sentence": "以何所攝？",
        "translation": "What's included?",
        "source": "T26n1523_001:0208a01_10"
    },
    {
        "source_sentence": "為誰根本？",
        "translation": "Who is the root?",
        "source": "T26n1523_001:0208a01_11"
    },
    {
        "source_sentence": "是誰現氣因？",
        "translation": "Who is the cause of present energy?",
        "source": "T26n1523_001:0208a01_12"
    },
    {
        "source_sentence": "誰所依止？",
        "translation": "Who relies on it?",
        "source": "T26n1523_001:0208a02_0"
    },
    {
        "source_sentence": "答曰：初正願性，豈欲求相？",
        "translation": "Answer: The first is the nature of right vow, so why would you want to seek characteristics?",
        "source": "T26n1523_001:0208a02_1"
    },
    {
        "source_sentence": "菩提為念及念眾生，以一切智，因無量功德，一切世間聲聞緣覺願中上故，為勝信地所攝，無上菩提根本，慈悲現氣因，菩薩戒所依止。",
        "translation": "Because enlightenment is the cause of mindfulness and compassion for sentient beings, it's the result of all kinds of cognition, immeasurable virtue, which are among the vows of śrāvakas and pratyekbuddhas in all the worlds because they're included in the stage of superior faith, the root of unsurpassed enlightenment, the manifestation of compassion as the cause of benevol",
        "source": "T26n1523_001:0208a02_2"
    },
    {
        "source_sentence": "然是發菩提心，略有二種：一者出世因；",
        "translation": "However, in brief, there are two kinds of the determination for enlightenment:",
        "source": "T26n1523_001:0208a05_3"
    },
    {
        "source_sentence": "二者不出世因。",
        "translation": "The second is the cause that doesn't arise in the world.",
        "source": "T26n1523_001:0208a06_4"
    },
    {
        "source_sentence": "是中出世因者，若發心已永，遂不忘，是名出世因。",
        "translation": "A supramundane cause is called a supramundane cause if someone has permanently arisen the mind and then doesn't forget it.",
        "source": "T26n1523_001:0208a07_5"
    },
    {
        "source_sentence": "不出世因者，若心不永，遂中忘彼心。",
        "translation": "The non-worldly cause is that when awarenesses are not eternal, one forgets these awarenesses at the end.",
        "source": "T26n1523_001:0208a08_6"
    },
    {
        "source_sentence": "退亦有二種：一者永退；",
        "translation": "There are also two forms of falling back:",
        "source": "T26n1523_001:0208a09_7"
    },
    {
        "source_sentence": "二者不永退。",
        "translation": "The second is that they don't permanently regress.",
        "source": "T26n1523_001:0208a09_8"
    },
    {
        "source_sentence": "是中永退者，若有數退而復能生。",
        "translation": "This is the one who permanently regresses in relation to this: when falling back repeatedly, it can arise again.",
        "source": "T26n1523_001:0208a10_0"
    },
    {
        "source_sentence": "不永退者，若退已即生。",
        "translation": "Someone who doesn't permanently regress will be born after regressing.",
        "source": "T26n1523_001:0208a10_1"
    },
    {
        "source_sentence": "然彼心以四種緣、四種因及四種力而能生。",
        "translation": "Still, that mind can arise because of four kinds of conditions, four kinds of causes, and four kinds of powers.",
        "source": "T26n1523_001:0208a11_2"
    },
    {
        "source_sentence": "何等四種緣？",
        "translation": "What are these four kinds of conditions?",
        "source": "T26n1523_001:0208a12_3"
    },
    {
        "source_sentence": "一者見聞如來希有變化故，發菩提心；",
        "translation": "The first is the determination for enlightenment because they see and hear rare emanations of buddhas.",
        "source": "T26n1523_001:0208a12_4"
    },
    {
        "source_sentence": "二者因於無上菩提，以聞法為憐愍利益眾生故，發菩提心；",
        "translation": "The second is that they develop the will for enlightenment because of their unexcelled awakening, hearing the Teaching out of pity for sentient beings and benefiting them.",
        "source": "T26n1523_001:0208a13_5"
    },
    {
        "source_sentence": "三者菩薩為欲正法久住故，發菩提心；",
        "translation": "The third is that enlightening beings give rise to the determination for enlightenment because they want the true teaching to remain forever.",
        "source": "T26n1523_001:0208a14_6"
    },
    {
        "source_sentence": "四者見末世眾生受諸重苦故，發菩提心。",
        "translation": "The fourth is to give rise to the mind of enlightenment because they see that sentient beings in the latter part of the world experience heavy suffering.",
        "source": "T26n1523_001:0208a15_7"
    },
    {
        "source_sentence": "何者四種因？",
        "translation": "What are these four kinds of causes?",
        "source": "T26n1523_001:0208a16_8"
    },
    {
        "source_sentence": "一者具性故；",
        "translation": "The first is because they are endowed with nature.",
        "source": "T26n1523_001:0208a17_0"
    },
    {
        "source_sentence": "二者具善知識故；",
        "translation": "The second is endowed with knowledge.",
        "source": "T26n1523_001:0208a17_1"
    },
    {
        "source_sentence": "三者慈悲為首故；",
        "translation": "The third is that compassion is the foremost.",
        "source": "T26n1523_001:0208a17_2"
    },
    {
        "source_sentence": "四者不驚怖世間長夜種種深重，有聞等因故。",
        "translation": "Fourth, they are not frightened by the various depths of the long night in the world because there are causes such as hearing.",
        "source": "T26n1523_001:0208a18_3"
    },
    {
        "source_sentence": "何等四力？",
        "translation": "What are these four powers?",
        "source": "T26n1523_001:0208a19_4"
    },
    {
        "source_sentence": "一者自力；",
        "translation": "The first is self-power.",
        "source": "T26n1523_001:0208a19_5"
    },
    {
        "source_sentence": "二者他力；",
        "translation": "The second is the power of others.",
        "source": "T26n1523_001:0208a19_6"
    },
    {
        "source_sentence": "三者因力；",
        "translation": "The third is the power of causation.",
        "source": "T26n1523_001:0208a19_7"
    },
    {
        "source_sentence": "四者修行力。",
        "translation": "The fourth is the power of cultivation.",
        "source": "T26n1523_001:0208a20_8"
    },
    {
        "source_sentence": "是中自力者，以自力故，堪樂欲發阿耨多羅三藐三菩提心，是名自力。",
        "translation": "Because of their own power, they are able to delight in and want to give rise to the mind of unsurpassed, correct, and complete enlightenment, which is called their own power.",
        "source": "T26n1523_001:0208a20_9"
    },
    {
        "source_sentence": "他力者，以他所勸令發心，是名他力。",
        "translation": "The power of others is called the power of others by encouraging others to give rise to mind.",
        "source": "T26n1523_001:0208a22_0"
    },
    {
        "source_sentence": "前所習大乘善法者，是名因力。",
        "translation": "The good qualities of the great vehicle that were cultivated in the past are called causal power.",
        "source": "T26n1523_001:0208a22_1"
    },
    {
        "source_sentence": "現在法中親近知識，長夜之中聞思等正法習行善不息者，是名修行力。",
        "translation": "Being intimate with a teacher in the present teaching and hearing and contemplating the right teaching for a long time while cultivating goodness and not stopping it overnight is called the power of cultivation.",
        "source": "T26n1523_001:0208a23_2"
    },
    {
        "source_sentence": "是中若廣略，此四緣及四因藉故。",
        "translation": "If these are extensive and brief, it's because of these four conditions and four causes.",
        "source": "T26n1523_001:0208a25_3"
    },
    {
        "source_sentence": "若使內自力及以因力，具此二因生彼心者，如是故名為有益、名堅不動而生。",
        "translation": "If someone's internal self-power and causal power are endowed with these two causes to give rise to that mind, then this is why they're called beneficial and called firm and unmoving because they arise.",
        "source": "T26n1523_001:0208a25_4"
    },
    {
        "source_sentence": "他力修行力生彼心者，名為不應動失應知。",
        "translation": "When the power of others and the power of cultivation give rise to that mind, it's called not being able to move or lose what should be known.",
        "source": "T26n1523_001:0208a27_5"
    },
    {
        "source_sentence": "彼心退轉相亦有四種：無性故、惡知識所攝、於諸眾生不起悲愍心及恐怖世間故。",
        "translation": "There are also four kinds of characteristics of the retrogression of mind: because it has no nature, because it is included in bad friends, and because it doesn't become compassionate toward sentient beings or fearful to the world.",
        "source": "T26n1523_001:0208a28_6"
    },
    {
        "source_sentence": "不忘菩提心，菩薩還憶持彼菩提心故，能修行功德智明。",
        "translation": "They don't forget the mind of enlightenment, and because they retain that mind of enlightenment, bodhisattvas can cultivate the knowledge of merit.",
        "source": "T26n1523_001:0208b01_7"
    },
    {
        "source_sentence": "助道所攝善根法中，彼如是修諸行已，善法滅不增長因故說諸法。",
        "translation": "Among the factors of the roots of merit included in the aid to enlightenment, they are said to be factors because, having thus cultivated these formations, good factors cease and do not increase as a cause.",
        "source": "T26n1523_001:0208b02_8"
    },
    {
        "source_sentence": "經曰「佛語迦葉：菩薩成就四法，所生善法滅不增長。",
        "translation": "The sūtra says, Buddha said to Kāśyapa, A bodhisattva accomplishes four things that give rise to good qualities that cease and don't grow.",
        "source": "T26n1523_001:0208b04_9"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T26n1523_001:0208b05_10"
    },
    {
        "source_sentence": "但以憍慢心讀誦世間經典呪術」如是等。",
        "translation": "They simply recite worldly sūtras and spells with arrogance, such as these.",
        "source": "T26n1523_001:0208b05_11"
    },
    {
        "source_sentence": "問曰：何故唯有四法明因能滅善法不能增長，不多亦不少？",
        "translation": "Q: Why are there only four things that explain why the causes that can extinguish good qualities can't grow, not many and not many?",
        "source": "T26n1523_001:0208b06_12"
    },
    {
        "source_sentence": "答曰：善法有四種滅不增長故。",
        "translation": "Answer: Good qualities have four kinds of cessation that don't grow.",
        "source": "T26n1523_001:0208b08_13"
    },
    {
        "source_sentence": "此略有四種善法滅不增長事：一者不生滅不增長；",
        "translation": "These are, in brief, four kinds of things that do not arise from the cessation of good factors:",
        "source": "T26n1523_001:0208b08_14"
    },
    {
        "source_sentence": "二者不能增長滅不增長故；",
        "translation": "The second is that it cannot grow, because cessation does not grow.",
        "source": "T26n1523_001:0208b10_15"
    },
    {
        "source_sentence": "三者除拔根本滅不增長；",
        "translation": "The third is that they remove the root and extinguish it without growing.",
        "source": "T26n1523_001:0208b10_16"
    },
    {
        "source_sentence": "四者作及遠離滅不增長。",
        "translation": "Fourth, it doesn't grow when it's made and removed from cessation.",
        "source": "T26n1523_001:0208b11_17"
    },
    {
        "source_sentence": "是中不生諸白法滅因者，以我慢心故，讀誦世間經典求諸呪術，不能通達菩薩六波羅蜜及菩薩法藏，菩薩以我慢心降伏故。",
        "translation": "Those who don't give rise to the causes for the cessation of white dharmas here are those who, because of self-conceit, recite worldly sūtras and seek spells that can't penetrate the bodhisattva's six perfections and the bodhisattva's Dharma store because they're subdued by self-conceit.",
        "source": "T26n1523_001:0208b11_18"
    },
    {
        "source_sentence": "悕望名聞利養、妬勝憎他常誑故，求於世間呪術，不能求善白等法，已不生諸白法滅盡故能令盡滅，及先所得者以緣事故聞習轉弱故，是不增長滅。",
        "translation": "Because of their longing for fame and profit, their jealousy and resentment toward others are always angry, they seek worldly spells that won't lead to the cessation of good and white dharmas, and because they don't give rise to the cessation of white dharmas that can be extinguished, they can cause them to cease, and those who previously acquired them will not",
        "source": "T26n1523_001:0208b14_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T26n1523_001:0208b18_20"
    },
    {
        "source_sentence": "貪著利養名聞故，親近諸檀越。",
        "translation": "Because they crave profit and fame, they become intimate with the donors.",
        "source": "T26n1523_001:0208b18_21"
    },
    {
        "source_sentence": "是中利養者衣服等，供養者禮拜等。",
        "translation": "Among these benefits, those who make offerings are clothing and so forth, and those who make offerings are venerating and so forth.",
        "source": "T26n1523_001:0208b19_22"
    },
    {
        "source_sentence": "著於利養名聞故，說著利養名聞耳。",
        "translation": "Because they're attached to profit and fame, they say they're attached to profit and fame.",
        "source": "T26n1523_001:0208b19_23"
    },
    {
        "source_sentence": "以著利養名聞故，受於邪命資養等顯說應知。",
        "translation": "Because they are attached to profit and fame, they receive the support of wrong livelihoods and so forth.",
        "source": "T26n1523_001:0208b20_24"
    },
    {
        "source_sentence": "以親近檀越家故，多有親近中諸患。",
        "translation": "Because they're intimate with the donor's home, there are many afflictions in intimacy.",
        "source": "T26n1523_001:0208b21_25"
    },
    {
        "source_sentence": "若彼有如是二疑助成者故，說以如法得財利養以為不滅因，以依諂曲等意故不住聖處。",
        "translation": "If they have these two doubts that assist in their formation, they say that possessions and profits obtained according to the teaching are the cause of not ceasing because they don't abide in the noble place because they rely on flattery and dishonesty.",
        "source": "T26n1523_001:0208b22_26"
    },
    {
        "source_sentence": "彼如是著名聞利養，親近諸白衣家故。",
        "translation": "They're thus renowned for hearing and benefiting because they're close to the white-robed houses.",
        "source": "T26n1523_001:0208b24_27"
    },
    {
        "source_sentence": "以多緣親故，聞等善法不能增長。",
        "translation": "It's because of many proximate conditions that hearing such good qualities can't grow.",
        "source": "T26n1523_001:0208b25_28"
    },
    {
        "source_sentence": "聞等不增長，已聞等諸善法悉不增長故，令盡義便滅根本因故。",
        "translation": "hearing, etc., do not increase: because all such wholesome factors as having already been heard do not increase: because they cause the extinction of meaning and thereby eliminate the fundamental cause.",
        "source": "T26n1523_001:0208b26_29"
    },
    {
        "source_sentence": "及增謗菩薩，已惡見還增，及謗菩薩法藏，己瞋故於諸菩薩覓諸錯謬等患，令為諸菩薩以虛實等罪謗故令得大罪。",
        "translation": "They denigrate the bodhisattva's store of the bodhisattva's dharma, and because they are angry, they search for errors and errors among the bodhisattvas to cause them to commit a great offense because they denigrate the bodhisattvas with falsehoods and so forth.",
        "source": "T26n1523_001:0208b27_30"
    },
    {
        "source_sentence": "以此罪業因緣故，所有善法從根本拔除，遠離滅盡。",
        "translation": "Because of the causes and conditions of this sinful action, all good qualities that exist are removed from their roots and become free of extinction.",
        "source": "T26n1523_001:0208c01_31"
    },
    {
        "source_sentence": "遠離滅因故，未聞未曾受持諸脩多羅法而能誹謗。",
        "translation": "Because they're far removed from the causes of cessation, they haven't heard or memorized the sūtra teachings and can denigrate them.",
        "source": "T26n1523_001:0208c02_32"
    },
    {
        "source_sentence": "未聞者，未至耳識道故。",
        "translation": "Those who haven't heard it because they haven't yet reached the path of the ear consciousness.",
        "source": "T26n1523_001:0208c03_33"
    },
    {
        "source_sentence": "未曾受持者，雖至耳識道不誦持。",
        "translation": "Those who haven't received and maintained it before will not recite it even though they reach the ear consciousness path.",
        "source": "T26n1523_001:0208c04_34"
    },
    {
        "source_sentence": "諸頓說教及諸脩多羅法謗，以是義故，如來說此脩多羅，大阿波提舍中亦說此義。",
        "translation": "Because of this meaning, the Tathāgata teaches these sūtras, which are also explained in the Mahāprajñāpāramitā.",
        "source": "T26n1523_001:0208c05_35"
    },
    {
        "source_sentence": "若有邪師能測量如來意者，彼人得大毀謗正法之事，是故彼遠離諸盡法故，諸白等法令滅。",
        "translation": "If there's a mistaken teacher who can measure the Tathāgata's intention, that person will be able to greatly disparage the right teaching; therefore, because they're far removed from the exhaustive teachings, the white and so forth will cease.",
        "source": "T26n1523_001:0208c07_36"
    },
    {
        "source_sentence": "顛倒對治故，明此白等法句應知。",
        "translation": "Because it's the antidote for mistakenness, this explanation of the white and other phrases of the teaching should be known.",
        "source": "T26n1523_001:0208c09_37"
    },
    {
        "source_sentence": "是故「如來告迦葉言：迦葉！",
        "translation": "Therefore, the Tathāgata addressed Kāśyapa, saying, Kāśyapa!",
        "source": "T26n1523_001:0208c10_38"
    },
    {
        "source_sentence": "菩薩成就四法，所生善法轉勝增長不令有失，轉復倍勝。",
        "translation": "When a bodhisattva accomplishes four things, the good qualities that are produced become increasingly superior and don't cause loss, and they become even more superior.",
        "source": "T26n1523_001:0208c10_39"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T26n1523_001:0208c12_0"
    },
    {
        "source_sentence": "捨離邪法唯求正法」如是等。",
        "translation": "They abandon wrong dharmas and only seek the right dharmas.",
        "source": "T26n1523_001:0208c12_1"
    },
    {
        "source_sentence": "是中唯求正法者，六波羅蜜菩薩法藏所說，正聞非不正聞。",
        "translation": "Here, only those who seek the right teaching are taught by the Dharma store of the bodhisattvas in the six perfections, and right hearing is neither right hearing nor wrong hearing.",
        "source": "T26n1523_001:0208c12_2"
    },
    {
        "source_sentence": "所明世間呪術等，不定聞現事故，言非不定聞。",
        "translation": "It's explained that worldly spells, spells, and so forth are not necessarily heard in the present situation, which means they aren't uncertainly heard.",
        "source": "T26n1523_001:0208c14_3"
    },
    {
        "source_sentence": "復是隨如勸心者，柔軟善心故。",
        "translation": "It's also the mind that follows such an exhortation because it's a gentle and good mind.",
        "source": "T26n1523_001:0208c15_4"
    },
    {
        "source_sentence": "顯示何意？",
        "translation": "What does it mean to show?",
        "source": "T26n1523_001:0208c16_0"
    },
    {
        "source_sentence": "求世間語言呪術等，求因故。",
        "translation": "They seek worldly words, spells, and so forth because they seek causes.",
        "source": "T26n1523_001:0208c16_1"
    },
    {
        "source_sentence": "著我慢者，成世間呪術等事。",
        "translation": "Someone who's attached to self-conceit creates worldly spells and other things.",
        "source": "T26n1523_001:0208c16_2"
    },
    {
        "source_sentence": "求世間呪術語言者，成捨利養恭敬名聞之心。",
        "translation": "Those who seek worldly spells and words will become disrespectful, respectful, and well-versed.",
        "source": "T26n1523_001:0208c17_3"
    },
    {
        "source_sentence": "令捨故，言求六波羅蜜及菩薩法藏耳。",
        "translation": "Because they cause them to abandon it, they say they seek the six perfections and the bodhisattva's store of the Dharma.",
        "source": "T26n1523_001:0208c18_4"
    },
    {
        "source_sentence": "以法財利養為足，捨離一切諸邪命等。",
        "translation": "They take the wealth of the Dharma as their sufficient, abandon all wrong livelihoods, and so forth.",
        "source": "T26n1523_001:0208c19_5"
    },
    {
        "source_sentence": "及安住知足聖主性中者，以法利為足，如法所得利養心足故。",
        "translation": "Those who abide in the noble sovereignty of knowing and being content are satisfied because they take the benefits of the Dharma as their footing, which is the basis for benefiting the mind that's gained according to the Dharma.",
        "source": "T26n1523_001:0208c20_6"
    },
    {
        "source_sentence": "捨離一切諸邪命等者，遠離諸諂曲等心故。",
        "translation": "He who abandons all wrong livelihoods and so forth because he's free of flattery and dishonesty.",
        "source": "T26n1523_001:0208c21_7"
    },
    {
        "source_sentence": "安住知足聖主性中者，不生疲倦心故，得失不以心故。",
        "translation": "He who abides in the noble lordship of contentedness because he doesn't give rise to a mind that's weary, and gains and loses aren't based on his mind.",
        "source": "T26n1523_001:0208c22_8"
    },
    {
        "source_sentence": "彼如是行之，正行已，為成自利利他行故。",
        "translation": "They thus practice it, and after correctly practicing it, they accomplish the practice of self-benefiting and benefiting others.",
        "source": "T26n1523_001:0208c24_0"
    },
    {
        "source_sentence": "防護他心，若有失事不諫向人罪過虛實，何況覓人長短諸過。",
        "translation": "They guard others' minds, and if there's a fault, they don't remonstrate with someone who commits crimes that are false and unreal, so why wouldn't they look for the strength or weaknesses of someone?",
        "source": "T26n1523_001:0208c24_1"
    },
    {
        "source_sentence": "是菩薩修行六波羅蜜菩薩法藏，以於諸佛法中心不通達。",
        "translation": "This is the bodhisattva who cultivates the bodhisattva's Dharma treasure of the six perfections and doesn't comprehend them because he doesn't understand the center of the Buddha's teachings.",
        "source": "T26n1523_001:0208c26_2"
    },
    {
        "source_sentence": "是中唯佛為現作證故，不生謗心。",
        "translation": "Here, only the Buddha does not give rise to a mind of denigrating because he's now realizing it.",
        "source": "T26n1523_001:0208c27_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T26n1523_001:0208c28_4"
    },
    {
        "source_sentence": "佛菩提無邊及所信根非一故。",
        "translation": "It's because the Buddha's enlightenment has no limit and the faculties he believes in aren't one and the same.",
        "source": "T26n1523_001:0208c28_5"
    },
    {
        "source_sentence": "演說諸法亦治諸法，總略而明，以何退失不能增長？",
        "translation": "He explains that all dharmas also counteract dharmas, which are summarized and explained in a general way, so why doesn't he regress and grow?",
        "source": "T26n1523_001:0208c29_6"
    },
    {
        "source_sentence": "如何退失？",
        "translation": "What's the loss of retrogression?",
        "source": "T26n1523_001:0209a01_7"
    },
    {
        "source_sentence": "以何時失？",
        "translation": "At what time is it lost?",
        "source": "T26n1523_001:0209a01_8"
    },
    {
        "source_sentence": "及何等法，彼以顯說。",
        "translation": "What are the dharmas that they teach in order to show?",
        "source": "T26n1523_001:0209a02_0"
    },
    {
        "source_sentence": "以何退失不能增長者，謂諸善法。",
        "translation": "What's the reason why they can't grow in regression? It's good qualities.",
        "source": "T26n1523_001:0209a02_1"
    },
    {
        "source_sentence": "如何退失者，以我慢心求世間語言咒術等漸次說。",
        "translation": "What's the way to regress? It's gradually explained in order because they seek worldly speech, spells, and so forth with self-conceit.",
        "source": "T26n1523_001:0209a03_2"
    },
    {
        "source_sentence": "以何時失者，現法中及未來。",
        "translation": "At what moment is it lost?*”: In the present and in the future.",
        "source": "T26n1523_001:0209a04_3"
    },
    {
        "source_sentence": "何等法者，具足四法，白朋中亦爾。",
        "translation": "What are the four dharmas that are replete with the four dharmas, and so are the white friends?",
        "source": "T26n1523_001:0209a05_4"
    },
    {
        "source_sentence": "所有善法生及如何生、以何時生，及何等法生、以何對治說，復此諸法漸次，以何我慢所攝諸利養等希望求世間語言呪術等，求以隨所。",
        "translation": "All the good qualities that arise, how they arise, when they arise, what qualities arise, and what antidotes they're taught, and these qualities are gradually cultivated by seeking worldly language, mantras, spells, and so forth to follow where they arise because of the benefits included in self-conceit.",
        "source": "T26n1523_001:0209a05_5"
    },
    {
        "source_sentence": "家中見利養者則能親近此家，身為利養名聞被縛，妬悋心故。",
        "translation": "Those who see benefits at home can then become intimate with this family, and their bodies are bound by profits and fame because of their jealousy.",
        "source": "T26n1523_001:0209a08_6"
    },
    {
        "source_sentence": "因彼家所有餘菩薩親近者，為令起瞋及以惡謗，因瞋謗彼人故則謗正法。",
        "translation": "It's because the other bodhisattvas in that house who are close to them become angry and badly denigrate others, and because they harshly denigrate those people, they denigrate the right teaching.",
        "source": "T26n1523_001:0209a10_7"
    },
    {
        "source_sentence": "白朋法中漸次明離慢等諸患故，六波羅蜜所攝、菩薩修學正聞故，能行順法。",
        "translation": "In the white group teaching, it gradually explains that they're free of the afflictions of conceit and so forth, are included in the six perfections, and because bodhisattvas cultivate right hearing, they can practice the Dharma.",
        "source": "T26n1523_001:0209a12_8"
    },
    {
        "source_sentence": "行順法已，如法得施以為知量，捨離一切諸邪命等，安住知足聖主性中，以著利養名聞謗因緣故。",
        "translation": "Having practiced it in accordance with the teaching, he attains generosity according to the teaching as a measure of knowing, abandons all wrong livelihoods and so forth, and abides in the noble lordship of contentedness because he's attached to profiting from fame and reputation and denigrating causes and conditions.",
        "source": "T26n1523_001:0209a13_9"
    },
    {
        "source_sentence": "不說他人罪過、實以不實，不求人短，離謗菩薩心故，能行利益如法等事。",
        "translation": "They don't explain the sins and faults of others because they aren't real, don't look for shortcomings, and are free of denigrating the bodhisattva's mind, so they can perform tasks that benefit them according to the teaching.",
        "source": "T26n1523_001:0209a16_10"
    },
    {
        "source_sentence": "行如法行故不謗正法，捨離滅諸白法因諸法故。",
        "translation": "Because they practice according to the teaching, they don't denigrate the right teaching, abandoning and extinguishing white dharmas because of the causes of dharmas.",
        "source": "T26n1523_001:0209a17_11"
    },
    {
        "source_sentence": "修行不滅諸白法因已，捨離似非菩薩隨一一相習行惡心等，修行似菩薩直心修相，習諸行故、為令勸故。",
        "translation": "After cultivating practice and not ceasing the causes of white dharmas, he abandons bad thoughts that resemble bodhisattvas and those that don't resemble bodhisattvas and follows each one of their characteristics to cultivate bad thoughts, and cultivates forms that resemble bodhisattvas who cultivate straightforward mental cultivation because they cultivate actions and encourage them.",
        "source": "T26n1523_001:0209a18_12"
    },
    {
        "source_sentence": "明顯生滅苦，不行諸惱等行故。",
        "translation": "It's because it clearly shows that the suffering of arising and ceasing doesn't arise, so it doesn't practice such things as anguish.",
        "source": "T26n1523_001:0209a21_13"
    },
    {
        "source_sentence": "「佛語迦葉：菩薩有四種諂曲心，菩薩常應捨離。",
        "translation": "The Buddha said to Kāśyapa, A bodhisattva has four kinds of flattering mental states that should always be abandoned by a bodhisattva.",
        "source": "T26n1523_001:0209a22_14"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T26n1523_001:0209a23_15"
    },
    {
        "source_sentence": "於佛法中心生疑悔不決了」如是等。",
        "translation": "They give rise to doubts and regrets in the center of the Buddha's teaching that aren't resolved.",
        "source": "T26n1523_001:0209a23_16"
    },
    {
        "source_sentence": "問曰：何故唯說四法？",
        "translation": "Question: Why are only four factors spoken of?",
        "source": "T26n1523_001:0209a24_17"
    },
    {
        "source_sentence": "答曰：為因四種諂曲等法故。",
        "translation": "Answer: It's because of the four kinds of flattering and so forth.",
        "source": "T26n1523_001:0209a24_18"
    },
    {
        "source_sentence": "以有此四種諂曲心故，說四諂曲應知。",
        "translation": "Because these four kinds of deceitful awarenesses are present, it should be known that they are said to be four forms of deceit.",
        "source": "T26n1523_001:0209a25_19"
    },
    {
        "source_sentence": "何等四？",
        "translation": "What are these four?",
        "source": "T26n1523_001:0209a26_20"
    },
    {
        "source_sentence": "一者於乘諂曲；",
        "translation": "The first is hypocrisy in regard to the vehicles.",
        "source": "T26n1523_001:0209a26_21"
    },
    {
        "source_sentence": "二者化受諂曲；",
        "translation": "The second is instruction in flattery and deceitfulness.",
        "source": "T26n1523_001:0209a26_22"
    },
    {
        "source_sentence": "三者助功德諂曲；",
        "translation": "The third is the crookedness of assisting virtue.",
        "source": "T26n1523_001:0209a27_23"
    },
    {
        "source_sentence": "四者助智諂曲。",
        "translation": "Fourth, it's an aid to wisdom that's flattering.",
        "source": "T26n1523_001:0209a27_24"
    },
    {
        "source_sentence": "是中乘諂曲者，於佛法中心生疑惑不決了等，及不敬尊，復不敬諸戒等法，於佛法中生疑惑等故，諸大乘中生不信默然行。",
        "translation": "This is the middle vehicle that's flattering because doubt and confusion arise in the center of the Buddha's teaching, such as doubt and indecision, lack respect for the venerable, lack respect for precepts, etc., doubt and doubt arise in the Buddha's teaching, and so forth, and unbelief and silence arise in the great vehicle because doubt and confusion arise in the great vehicle.",
        "source": "T26n1523_001:0209a27_25"
    },
    {
        "source_sentence": "是中於諸佛法中以有故生疑，以有大意德故生惑，以其不可得故，生不決了等事。",
        "translation": "Here, doubt arises because it exists in the Buddha's teachings, and confusion arises because it has great mental virtue. Because it's unobtainable, such things as indeterminate understanding arise.",
        "source": "T26n1523_001:0209b01_26"
    },
    {
        "source_sentence": "化受諂曲因者，於諸眾生起憍慢瞋恨妄想等，以慢等心故。",
        "translation": "“Conversion is the cause for receiving hypocrisy”: Such [things] as arrogance, hatred, deluded conceptual identification and so on are produced regarding beings: because of such awarenesses as pride.",
        "source": "T26n1523_001:0209b03_27"
    },
    {
        "source_sentence": "化諸眾生中恨默故，不能化導憍慢瞋恨妄想等。",
        "translation": "Because it transforms the hatred and silence among sentient beings, it can't transform or guide pride, anger, resentment, deluded conceptions, and so forth.",
        "source": "T26n1523_001:0209b05_28"
    },
    {
        "source_sentence": "於諸尊及弟子并勸諫，有益無益等中應知。",
        "translation": "You should know that the honored ones and the disciples are both admonished and exhorted, whether they're beneficial or not.",
        "source": "T26n1523_001:0209b06_29"
    },
    {
        "source_sentence": "助功德諂曲因者，於他利養中生妬悋等心。",
        "translation": "Someone who assists in the causes of merit and flattery gives rise to feelings of jealousy and so forth in others' benefits.",
        "source": "T26n1523_001:0209b07_30"
    },
    {
        "source_sentence": "是中見他得利養，心起忿惱瞋意妬。",
        "translation": "When they see others gaining benefits, their minds become angry and angry with anger.",
        "source": "T26n1523_001:0209b08_31"
    },
    {
        "source_sentence": "若見彼求而起惜心，是名悋。",
        "translation": "If someone sees that they're seeking and becomes stingy, this is called anger.",
        "source": "T26n1523_001:0209b09_0"
    },
    {
        "source_sentence": "彼如是既起妬悋心熾盛故，於助功德智中恨不修行故，諸功德智即便退失。",
        "translation": "Because they thus give rise to a mind of jealousy and anger that's so intense, and because they hate the wisdom that aids in virtue and don't cultivate it, the knowledge of virtue will even regress.",
        "source": "T26n1523_001:0209b09_1"
    },
    {
        "source_sentence": "助智諂曲因者，於諸菩薩廣彰諸惡，惡名惡稱惡行等。",
        "translation": "Auxiliary causes of flattering cognition are those that extensively express bad qualities in bodhisattvas, such as bad names and bad reputations and bad actions.",
        "source": "T26n1523_001:0209b11_2"
    },
    {
        "source_sentence": "說惡名等事前已解說。",
        "translation": "He explains bad names and so forth as previously explained.",
        "source": "T26n1523_001:0209b12_3"
    },
    {
        "source_sentence": "為諸菩薩說諸惡等句。",
        "translation": "He teaches the bad and so forth phrases for bodhisattvas.",
        "source": "T26n1523_001:0209b13_4"
    },
    {
        "source_sentence": "為說大乘經應知。",
        "translation": "You should know that it's for the sake of teaching the great vehicle sūtras.",
        "source": "T26n1523_001:0209b13_5"
    },
    {
        "source_sentence": "以謗大乘故，菩薩於助道智中默住懈怠不修行故，修道智中成於退失。",
        "translation": "Because it denigrates the great vehicle, the bodhisattva remains silent and lazy in the wisdom that aids in the path and doesn't cultivate it, and he becomes retrogressing in the wisdom that cultivates the path.",
        "source": "T26n1523_001:0209b14_6"
    },
    {
        "source_sentence": "以為此故說朋應知。",
        "translation": "Because of this, it's said that the friend should know.",
        "source": "T26n1523_001:0209b15_7"
    },
    {
        "source_sentence": "諂曲對治故，「佛語迦葉：菩薩有四質直之相。",
        "translation": "Because of the antidote of flattery, the Buddha said to Kāśyapa, The bodhisattva has four straightforward characteristics.",
        "source": "T26n1523_001:0209b16_8"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T26n1523_001:0209b17_9"
    },
    {
        "source_sentence": "所謂所犯諸罪終不覆藏」如是等。",
        "translation": "The so-called sins that are committed will never be hidden, such as this.",
        "source": "T26n1523_001:0209b17_10"
    },
    {
        "source_sentence": "是中所犯諸罪終不覆藏者，是總向他發露者。",
        "translation": "A person who never hides the sins that are committed here is someone who reveals them to others in general.",
        "source": "T26n1523_001:0209b18_11"
    },
    {
        "source_sentence": "發露事故說者，有犯能懺悔故。",
        "translation": "It's because there are offenses that can be repented of.",
        "source": "T26n1523_001:0209b19_12"
    },
    {
        "source_sentence": "彼如是懺悔，是以後時不生悔恨等情，發起善故。",
        "translation": "Such feelings as regret and resentment do not arise later: because they give rise to what is wholesome.",
        "source": "T26n1523_001:0209b20_13"
    },
    {
        "source_sentence": "或失國土或財者，以真求實故，示現不惜諸施等故。",
        "translation": "Someone who loses their land or possessions because they truly seek the truth and show generosity without stinginess.",
        "source": "T26n1523_001:0209b21_14"
    },
    {
        "source_sentence": "身命難者，以捨離身命，不依止餘種種不舉餘事，捨彼事已令惑人故、憶餘事故。",
        "translation": "The difficulty of body and life is that because they abandon body and life, they don't rely on other kinds of things and don't cite other things, and after abandoning those things, they cause people to be confused and remember other things.",
        "source": "T26n1523_001:0209b22_15"
    },
    {
        "source_sentence": "一切惡事中，罵詈誹謗撾打繫縛種種傷害。",
        "translation": "Among all the bad things, they are ridiculed, slandered, beaten, bound, and variously harmed.",
        "source": "T26n1523_001:0209b24_16"
    },
    {
        "source_sentence": "受此苦時，但求自責自憶業報，不瞋恨他。",
        "translation": "When they experience this kind of suffering, they simply seek to blame themselves and recollect the results of their actions without angering others.",
        "source": "T26n1523_001:0209b25_17"
    },
    {
        "source_sentence": "此諸句有何異義？",
        "translation": "What's the difference between these phrases?",
        "source": "T26n1523_001:0209b26_18"
    },
    {
        "source_sentence": "是中罵者，說虛妄故。",
        "translation": "This is called scold because it's said to be false.",
        "source": "T26n1523_001:0209b26_19"
    },
    {
        "source_sentence": "瞋者，虛實俱說故。",
        "translation": "anger: because they are both said to be false and real.",
        "source": "T26n1523_001:0209b27_20"
    },
    {
        "source_sentence": "於他苦者，已說種生姓等，說諸惡事故。",
        "translation": "“Suffering of others” has already been spoken of: such [things] as the seed-generated castes, etc., are said to be bad events.",
        "source": "T26n1523_001:0209b27_21"
    },
    {
        "source_sentence": "誹謗者，以因實見彰惡故。",
        "translation": "A denigrating person denigrates because they show badness by seeing things as they really are.",
        "source": "T26n1523_001:0209b28_22"
    },
    {
        "source_sentence": "撾打責數者，於身中具諸緣故。",
        "translation": "The number of blameworthiness refers to the fact that it is accompanied by conditions within the body.",
        "source": "T26n1523_001:0209b29_0"
    },
    {
        "source_sentence": "責數者，具三業故。",
        "translation": "The number of blameworthiness is because they are supplied with the three actions.",
        "source": "T26n1523_001:0209b29_1"
    },
    {
        "source_sentence": "復撾打者，以手足等諸身分故。",
        "translation": "Again, it's because of the hands, feet, and other identities that someone is beaten.",
        "source": "T26n1523_001:0209c01_2"
    },
    {
        "source_sentence": "殺者，依身手等及刀杖等故。",
        "translation": "The one who kills: because of relying on such [things] as body, hand, and so on, as well as on such [things] as a knife or a stick.",
        "source": "T26n1523_001:0209c01_3"
    },
    {
        "source_sentence": "繫縛者，以繩索鎖等。",
        "translation": "The fetters are such [things] as a rope, a chain, and so on.",
        "source": "T26n1523_001:0209c02_4"
    },
    {
        "source_sentence": "如是等事中，唯責己之業報，善惡業報因故，不瞋恨他。",
        "translation": "Among these things, the only thing that's blamed is the result of one's own actions, and it's because of the results of good and bad actions that they don't hate others.",
        "source": "T26n1523_001:0209c03_5"
    },
    {
        "source_sentence": "心不懷瞋恨等，及無諸結使，不懷瞋恨結使。",
        "translation": "The mind doesn't harbor anger and so forth, and there are no bonds or tendencies, and it doesn't harbor the bond of anger.",
        "source": "T26n1523_001:0209c04_6"
    },
    {
        "source_sentence": "彼善堅住信欲之中，設使有不可信諸佛法者彼能信，以心清淨故。",
        "translation": "If someone well and firmly abides in faith and desire, then even if they don't believe the Buddha's teachings, they can believe them because their mind is pure.",
        "source": "T26n1523_001:0209c05_7"
    },
    {
        "source_sentence": "顯說於大乘中身心成就，此諸句漸次說。",
        "translation": "It's clearly said that the body and mind are accomplished in the great vehicle, and these phrases are gradually explained in order.",
        "source": "T26n1523_001:0209c06_8"
    },
    {
        "source_sentence": "於諸佛法中以疑心故，不修戒行故，令諸眾生中行諸邪行。",
        "translation": "Because they doubt the buddhas' teachings and don't cultivate precepts, they cause sentient beings to engage in wrong practices among themselves.",
        "source": "T26n1523_001:0209c07_9"
    },
    {
        "source_sentence": "行邪行已，彼利養中即生慳悋妬心，以不能制妬心故。",
        "translation": "After they engage in wrong practices, the mind of stinginess and jealousy arises in those benefits, because they can't restrain their thoughts of jealousy.",
        "source": "T26n1523_001:0209c09_10"
    },
    {
        "source_sentence": "見聞有功德利養諸菩薩中起誹謗廣彰惡名。",
        "translation": "Seeing and hearing that there are merits and benefits, the bodhisattvas denigrate and extensively express bad names.",
        "source": "T26n1523_001:0209c10_11"
    },
    {
        "source_sentence": "白朋法中漸次亦作，依持戒故。",
        "translation": "They are also gradually made among the white companions in the Dharma, because they rely on observing precepts.",
        "source": "T26n1523_001:0209c11_12"
    },
    {
        "source_sentence": "善持戒者善護諦語，護諦語者能順忍法，以具忍故得身心清淨，以清淨身心故能信諸佛正法。",
        "translation": "A well-maintained preceptor well guards the words of the truth, and someone who guards the words of the truth can follow the teaching of forbearance, attain purity of body and mind because they possess forbearance, and believe in the Buddha's right teaching because they have purified body and mind.",
        "source": "T26n1523_001:0209c12_13"
    },
    {
        "source_sentence": "略說諂曲者，是名心愧恒事。",
        "translation": "To speak briefly of flattering is called a constant state of shame in the mind.",
        "source": "T26n1523_001:0209c14_14"
    },
    {
        "source_sentence": "何處諂曲？",
        "translation": "Where is it flattering?",
        "source": "T26n1523_001:0209c15_0"
    },
    {
        "source_sentence": "於諸佛法中及以眾生。",
        "translation": "In all the buddha-teachings and in sentient beings.",
        "source": "T26n1523_001:0209c15_1"
    },
    {
        "source_sentence": "以何時諂曲者？",
        "translation": "At what time are those who are flattering?",
        "source": "T26n1523_001:0209c15_2"
    },
    {
        "source_sentence": "現法中習不捨故亦至未來。",
        "translation": "Because they're cultivated in the present life and aren't abandoned, they'll also reach the future.",
        "source": "T26n1523_001:0209c16_3"
    },
    {
        "source_sentence": "隨所有法及隨所說二種四句，隨所有真直之相，以何義中復以何時，有記等法對治，明於白法應知。",
        "translation": "What are the two kinds of four phrases that follow all the teachings and what's taught, what are the true and straightforward characteristics that follow all the true and straightforward characteristics, what do they mean, and when will they be used as antidotes to such things as indeterminate dharmas? It's clear that white dharmas should be known.",
        "source": "T26n1523_001:0209c16_4"
    },
    {
        "source_sentence": "於諸諂曲心中，諸菩薩諫及以諸真直心。",
        "translation": "In their flattering minds, the bodhisattvas remonstrate with true and straightforward thoughts.",
        "source": "T26n1523_001:0209c19_5"
    },
    {
        "source_sentence": "菩薩說真直心已，為真直心菩薩，說諸調伏義故，防諂曲法故，勸彼調順，現示調順及不調順等法故。",
        "translation": "After the bodhisattva teaches the true and straight mind, it's for the bodhisattva with a true and straight mind that he explains the meaning of discipline, which is to prevent flattery and dishonesty, encourages them to be disciplined, and presents such things as being disciplined and not being disciplined.",
        "source": "T26n1523_001:0209c20_0"
    },
    {
        "source_sentence": "「佛語迦葉：菩薩有四種不調順散壞之相。",
        "translation": "The Buddha said to Kāśyapa, There are four kinds of characteristics of a bodhisattva that aren't regulated and dispersed.",
        "source": "T26n1523_001:0209c22_1"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T26n1523_001:0209c23_2"
    },
    {
        "source_sentence": "讀誦經典而生戲論，法及順法不隨而行，於諸教誨中不調散壞」如是等四法。",
        "translation": "They read and recite sūtras and give rise to conceptual elaborations, don't follow the teachings and comply with the teachings, and don't regulate or disrupt the teachings. These are the four things.",
        "source": "T26n1523_001:0209c23_3"
    },
    {
        "source_sentence": "何故但說四法？",
        "translation": "Why are only four factors spoken of?",
        "source": "T26n1523_001:0209c25_4"
    },
    {
        "source_sentence": "有四法，有四種不調散壞因故。",
        "translation": "There are four dharmas, because there are four kinds of unruly and disintegrating causes.",
        "source": "T26n1523_001:0209c25_5"
    },
    {
        "source_sentence": "何者不調散壞四法？",
        "translation": "What are the four dharmas that don't regulate and disintegrate?",
        "source": "T26n1523_001:0209c26_6"
    },
    {
        "source_sentence": "一者處不調散壞；",
        "translation": "The first is disintegration due to the imbalance of location.",
        "source": "T26n1523_001:0209c26_7"
    },
    {
        "source_sentence": "二者發行中不調散壞；",
        "translation": "The second is that they do not change and disintegrate in the midst of enlightenment.",
        "source": "T26n1523_001:0209c27_8"
    },
    {
        "source_sentence": "三者受用中不調散壞；",
        "translation": "The third is the absence of regulation and disintegration in enjoyment.",
        "source": "T26n1523_001:0209c27_9"
    },
    {
        "source_sentence": "四者共住不調散壞。",
        "translation": "The fourth is that they live together and don't regulate and disintegrate.",
        "source": "T26n1523_001:0209c28_10"
    },
    {
        "source_sentence": "是中不調散壞者，名為不善調伏故，喻如惡馬。",
        "translation": "This is called not well-adjusted because it's like a bad horse.",
        "source": "T26n1523_001:0209c28_11"
    },
    {
        "source_sentence": "此諸不調散四法，能障修彼菩薩行故，名為不調散法。",
        "translation": "These four unregulated dharmas are called unregulated dharmas because they obstruct the cultivation of those bodhisattva practices.",
        "source": "T26n1523_001:0209c29_12"
    },
    {
        "source_sentence": "是中聞諸法及修行處而生戲論者，是名處不調散壞因，喻如不調散惡馬。",
        "translation": "Here, someone who hears the teachings and places of cultivation and gives rise to conceptual elaborations is called a place that's not regulated and causes destruction, which is likened to an unregulated bad horse.",
        "source": "T26n1523_001:0210a02_13"
    },
    {
        "source_sentence": "以不調故，還安本處已，爾時不能善住，復不能調伏，不能散壞。",
        "translation": "Because they aren't disciplined, they return to their original place and aren't able to abide well, be disciplined, or disintegrate.",
        "source": "T26n1523_001:0210a03_14"
    },
    {
        "source_sentence": "菩薩亦爾，如法義中多聞已，多聞故心不調伏，被諸善知識正勸令行修諸法及次法，不能正住，於教誨中不能正受法行，是名發行不調散壞因。",
        "translation": "Similarly, bodhisattvas who have heard much about the meaning of the teaching and whose minds aren't disciplined because they're well-versed, are correctly encouraged by good teachers to cultivate the teachings and subsequent teachings, can't correctly abide, and can't correctly receive the practice of the teaching in their instruction, which is called the cause of the disintegration of imbalance that produces",
        "source": "T26n1523_001:0210a05_15"
    },
    {
        "source_sentence": "譬如不調伏惡馬，安置正道處中，以不調伏故向於惡道。",
        "translation": "It's like a bad horse that doesn't tame and places it in the right path but goes into a bad path because it doesn't tame.",
        "source": "T26n1523_001:0210a08_16"
    },
    {
        "source_sentence": "不調伏菩薩亦復如是，為諸善知識所勸修行法及次法，諸悔之中現以心顛倒分別念故即便倒取。",
        "translation": "Similarly, the bodhisattva who doesn't subdue is encouraged by good friends to cultivate the practices and sequential teachings, and in his repentance, he mistakenly discriminates them with his mind and even takes them.",
        "source": "T26n1523_001:0210a09_17"
    },
    {
        "source_sentence": "損他信施供養恭敬者，是名受用中不調散壞因。",
        "translation": "Disrupting others' faith, offering support, offerings, and respect is called the cause of imbalanced decay in enjoyment.",
        "source": "T26n1523_001:0210a12_18"
    },
    {
        "source_sentence": "喻如不調伏惡馬，共諸調伏馬同其一處，而與諸調伏馬行異故，說不調伏也。",
        "translation": "It's a metaphor like an undisciplined bad horse that shares the same place with the disciplined horses and differs from the practice of the disciplined horses, so it's said to be undisciplined.",
        "source": "T26n1523_001:0210a13_19"
    },
    {
        "source_sentence": "不調伏菩薩亦復如是，雖在調伏菩薩同其一處，已漏戒行故，受諸信施供養恭敬以成其悔恨，於善調伏菩薩所行，行不相似、不樂知見，善調伏菩薩中起心誹謗不生恭敬，是名處不調伏散壞因。",
        "translation": "Even though there are bodhisattvas in the same place who are disciplined, because they've violated the precepts and practices, they receive faith, offering support, offerings, and respect to make up their repentance, don't practice what well-adjusted bodhisattvas do, don't like it, don't delight in knowing and seeing, and give rise to thoughts of disparagement and disrespect",
        "source": "T26n1523_001:0210a15_20"
    },
    {
        "source_sentence": "譬如不調惡馬，共諸調伏馬同其一處，以不調伏故心不悅樂。",
        "translation": "It's like a bad horse that doesn't tame and shares the same place with the tamed horses, and because they aren't tamed, their minds aren't happy.",
        "source": "T26n1523_001:0210a19_21"
    },
    {
        "source_sentence": "善調伏者共不調伏同其一處亦爾。",
        "translation": "Good discipline is shared with those who aren't disciplined, and so is the same as one place.",
        "source": "T26n1523_001:0210a21_22"
    },
    {
        "source_sentence": "不調伏菩薩亦復如是，以自有見取義故，共諸善調伏菩薩同在一處故心不悅樂。",
        "translation": "So it is with the bodhisattvas who aren't disciplined because they have their own views and grasp their own meanings, and their minds aren't delighted because they share the same place as well-disciplined bodhisattvas.",
        "source": "T26n1523_001:0210a21_23"
    },
    {
        "source_sentence": "善調伏菩薩亦復如是。",
        "translation": "So it is with the well-adjusted bodhisattva.",
        "source": "T26n1523_001:0210a23_24"
    },
    {
        "source_sentence": "是中調者，根調勝故。",
        "translation": "This is middling discipline because the faculties are tempered and superior.",
        "source": "T26n1523_001:0210a24_25"
    },
    {
        "source_sentence": "伏者，一心滅惡得勝行故。",
        "translation": "It's because he singlemindedly extinguishes evil and attains superior practice.",
        "source": "T26n1523_001:0210a24_26"
    },
    {
        "source_sentence": "轉一切黑法，對治說白朋法應知。",
        "translation": "To change all black dharmas, the antidote that teaches white friends should be known.",
        "source": "T26n1523_001:0210a25_27"
    },
    {
        "source_sentence": "經言「善說所聞聞便信受，如所說行，依止於法不依言說」者，非妬心諍勝故，但聽聞正法唯求利益，不求覓見人諸短。",
        "translation": "The sūtra says, He well explains what he hears and then believes it, acts accordingly as he teaches, relies on the teaching and doesn't rely on words, not because his jealousy is superior but because he hears the right teaching only for profit and doesn't seek to see people's shortcomings.",
        "source": "T26n1523_001:0210a26_28"
    },
    {
        "source_sentence": "菩薩如是行諸行已，常得值不離法善知識。",
        "translation": "After thus practicing these practices, the bodhisattva always meets a good teacher who doesn't part from the Dharma.",
        "source": "T26n1523_001:0210a28_29"
    },
    {
        "source_sentence": "隨順師教能知依止，以餘言語所作皆善不失師意。",
        "translation": "Following the teacher's instructions, they can know their support and rely on other words that are good and don't lose their teacher's meaning.",
        "source": "T26n1523_001:0210a29_30"
    },
    {
        "source_sentence": "不退戒定者，此諸句有異義。",
        "translation": "The phrase not falling back from morality and samdhi has different meanings in these sentences.",
        "source": "T26n1523_001:0210b02_31"
    },
    {
        "source_sentence": "是中於教誨處隨順師教者，是總能令善。",
        "translation": "Here, someone who follows the teacher's instructions at the point of instruction is generally able to make them good.",
        "source": "T26n1523_001:0210b02_32"
    },
    {
        "source_sentence": "以喻言語者，聞善惡等忍故。",
        "translation": "It's because they hear good and bad forbearance and so forth.",
        "source": "T26n1523_001:0210b03_33"
    },
    {
        "source_sentence": "所作皆善者，一切時不犯戒故。",
        "translation": "All that they do is good because they don't violate the precepts at all times.",
        "source": "T26n1523_001:0210b04_34"
    },
    {
        "source_sentence": "不失師意者，於教誨中心敬重故。",
        "translation": "Someone who doesn't lose the teacher's mind is respected at the center of his teaching because he venerates it.",
        "source": "T26n1523_001:0210b05_35"
    },
    {
        "source_sentence": "菩薩如是行諸行已，常得值不離阿練善知識故，不退戒定。",
        "translation": "A bodhisattva who thus practices these practices always meets a good teacher who doesn't part from the forest and doesn't retreat from them, so he doesn't regress from the concentration of morality.",
        "source": "T26n1523_001:0210b05_36"
    },
    {
        "source_sentence": "以調順心而受供養者，所說不退戒定者，重明戒以定名說故應知。",
        "translation": "Those who receive offerings with a tempered mind and are taught that they don't regress from precepts and concentration should be known because the precepts are repeatedly explained by the name of concentration.",
        "source": "T26n1523_001:0210b07_37"
    },
    {
        "source_sentence": "菩薩如是行行已，諸常得不離行諸功德善知識，見諸善調順菩薩已，恭敬愛樂隨順善人，勸受等行順向順意順諸功德，為令得利。",
        "translation": "Having done so, the bodhisattva always attains the virtues of not-separating practices and good teachers who see well-adjusted bodhisattvas, respects, loves, follows, and complies with good people, encourages them to undertake such practices, follows them, conforms to their intentions, and follows their virtues in order to obtain benefits.",
        "source": "T26n1523_001:0210b08_38"
    },
    {
        "source_sentence": "此諸句有何異義？",
        "translation": "What's the difference between these phrases?",
        "source": "T26n1523_001:0210b11_39"
    },
    {
        "source_sentence": "是中善調及順等諸句，前已解釋。",
        "translation": "These are the phrases that are well-adjusted and compliant, as explained earlier.",
        "source": "T26n1523_001:0210b12_40"
    },
    {
        "source_sentence": "恭敬愛樂者，示現喜敬重心故。",
        "translation": "Respect and affection are shown because they show joy and reverence.",
        "source": "T26n1523_001:0210b13_0"
    },
    {
        "source_sentence": "順向者，樂見故。",
        "translation": "“Concomitant”: Because it is with the view of satisfaction.",
        "source": "T26n1523_001:0210b13_1"
    },
    {
        "source_sentence": "順意者，正親近意故。",
        "translation": "The one who follows the intention is because he's directly proximate to the intention.",
        "source": "T26n1523_001:0210b14_2"
    },
    {
        "source_sentence": "順諸功德者，樂聞意故。",
        "translation": "Those who follow merits are those who delight in listening because they want to hear it.",
        "source": "T26n1523_001:0210b14_3"
    },
    {
        "source_sentence": "為令得彼利者，順行此法意故。",
        "translation": "It's because someone who follows the meaning of this teaching in order to attain its benefits.",
        "source": "T26n1523_001:0210b15_4"
    },
    {
        "source_sentence": "菩薩如是行諸行已，成不離得眾首善知識。",
        "translation": "After thus practicing these practices, the bodhisattva becomes a good teacher who doesn't part from them and attains their heads.",
        "source": "T26n1523_001:0210b15_5"
    },
    {
        "source_sentence": "略說以何故調順不調順邊壞事，及云何而有？",
        "translation": "Briefly, it is said: “Why are the extreme forms of disunity conformable and those that are not conformable conditioned?°*” spoken of. And how do they exist?”",
        "source": "T26n1523_001:0210b16_6"
    },
    {
        "source_sentence": "唯以聞等諸相故。",
        "translation": "It's only because of the characteristics of hearing and so forth.",
        "source": "T26n1523_001:0210b17_7"
    },
    {
        "source_sentence": "以何時？",
        "translation": "At what time?",
        "source": "T26n1523_001:0210b18_8"
    },
    {
        "source_sentence": "現法中及未來，習學不止故。",
        "translation": "In the present and in the future, it's because they don't stop accumulating and training.",
        "source": "T26n1523_001:0210b18_9"
    },
    {
        "source_sentence": "以何等相？",
        "translation": "What are their characteristics?",
        "source": "T26n1523_001:0210b19_10"
    },
    {
        "source_sentence": "具足四法，行聞等法對治故。",
        "translation": "They are supplied with four factors: because of the antidote for such factors as practising and hearing.",
        "source": "T26n1523_001:0210b19_11"
    },
    {
        "source_sentence": "說白朋等法應知。",
        "translation": "He explains the teaching that white friends and other things should be known.",
        "source": "T26n1523_001:0210b20_0"
    },
    {
        "source_sentence": "起次說者，行聞等法慢心故。",
        "translation": "The one who gives rise to successive explanations because of the practice of such [things] as hearing and so on: because of being with such awarenesses as pride in such [things] as teaching.",
        "source": "T26n1523_001:0210b20_1"
    },
    {
        "source_sentence": "順行正法次法等行已，於正教授處不如法行。",
        "translation": "After following the practice of the right teaching next to the Dharma and so forth, they don't practice according to the teaching in the correct teaching place.",
        "source": "T26n1523_001:0210b21_2"
    },
    {
        "source_sentence": "既正教授處不如法行已，所用受信施中諸事，彼令能墮不饒益處。",
        "translation": "If someone correctly teaches a place where they don't practice according to the teaching and uses the things that are received as faithful gifts, they'll be able to fall into an unbeneficial place.",
        "source": "T26n1523_001:0210b22_3"
    },
    {
        "source_sentence": "彼如是雜垢染心故，見諸善調伏心菩薩已，即不生恭敬。",
        "translation": "Because their minds are thus stained with defilement, they see well-adjusted bodhisattvas and don't give rise to respect after seeing them.",
        "source": "T26n1523_001:0210b23_4"
    },
    {
        "source_sentence": "對治漸次說白朋等法應知。",
        "translation": "The antidote is to gradually explain the white friends and other things that should be known.",
        "source": "T26n1523_001:0210b24_5"
    },
    {
        "source_sentence": "不調伏諸法中諫已，勸修調伏等法故，防護住調伏法菩薩。",
        "translation": "After remonstrating with those who aren't disciplined in the teachings and exhorting them to cultivate such things as discipline, he guards the bodhisattva who abides in the Dharma of discipline.",
        "source": "T26n1523_001:0210b25_6"
    },
    {
        "source_sentence": "錯謬等法，勸修不錯謬等法，故說錯謬不錯謬等法。",
        "translation": "Such things as errors and mistakes encourage the cultivation of such things as errors and mistakes, so they're called errors and mistakes.",
        "source": "T26n1523_001:0210b26_7"
    },
    {
        "source_sentence": "「佛語迦葉：菩薩有四錯謬法。",
        "translation": "The Buddha said to Kāśyapa, There are four mistaken dharmas that bodhisattvas have.",
        "source": "T26n1523_001:0210b28_8"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T26n1523_001:0210b28_9"
    },
    {
        "source_sentence": "未與所化信受眾生而共同意，是菩薩錯謬。",
        "translation": "This is a mistake on the part of the bodhisattva who doesn't share the same intention with the sentient beings he teaches and believes in them.",
        "source": "T26n1523_001:0210b29_10"
    },
    {
        "source_sentence": "乃至攝取破戒惡人等，是菩薩錯謬」。",
        "translation": "Even taking in bad people who break the precepts is a mistake on the part of the bodhisattva.",
        "source": "T26n1523_001:0210c01_11"
    },
    {
        "source_sentence": "問曰：何故但說四法？",
        "translation": "Question: Why are only four factors spoken of?",
        "source": "T26n1523_001:0210c02_0"
    },
    {
        "source_sentence": "答曰：依四種錯謬法故，說菩薩有四種錯謬。",
        "translation": "Answer: Based on four kinds of mistaken dharmas, it's said that bodhisattvas have four kinds of mistaken dharmas.",
        "source": "T26n1523_001:0210c02_1"
    },
    {
        "source_sentence": "何等四種？",
        "translation": "What are these four kinds?",
        "source": "T26n1523_001:0210c03_2"
    },
    {
        "source_sentence": "一者不作錯謬；",
        "translation": "The first is that they do not erect errors.",
        "source": "T26n1523_001:0210c03_3"
    },
    {
        "source_sentence": "二者過量錯謬；",
        "translation": "The second is the error of incalculability.",
        "source": "T26n1523_001:0210c04_4"
    },
    {
        "source_sentence": "三者不正作錯謬；",
        "translation": "The third is that they do not correctly create errors.",
        "source": "T26n1523_001:0210c04_5"
    },
    {
        "source_sentence": "四者惡作錯謬。",
        "translation": "The fourth is the mistake of doing evil deeds.",
        "source": "T26n1523_001:0210c04_6"
    },
    {
        "source_sentence": "是中不作錯謬者，未受化眾生而與同意，依化眾生勸令到究竟故，信心敬眾生中所說法中斷絕，是菩薩錯謬。",
        "translation": "This is a mistake on the part of the bodhisattva who doesn't make errors here because he hasn't accepted the teachings of sentient beings and agreed with them, and because he relies on the teachings of sentient beings to encourage them to reach their ultimate end and believes that the teachings taught among sentient beings are cut off in faith and respect.",
        "source": "T26n1523_001:0210c05_7"
    },
    {
        "source_sentence": "過量錯謬者，非器眾生中說深妙上法故，於小乘眾生希求大乘而不隨根說，是菩薩錯謬。",
        "translation": "It's because they don't teach the profound and marvelous higher Dharma in sentient beings who are capable, and they don't teach it according to their faculties to sentient beings of lesser vehicles who desire the great vehicle. This is a mistake for bodhisattvas.",
        "source": "T26n1523_001:0210c07_8"
    },
    {
        "source_sentence": "不正作錯謬者，為諸上根眾生說小乘法，於大乘眾生求小乘，不隨根說法，是名錯謬。",
        "translation": "Someone who doesn't correctly create errors because they teach the lesser vehicle teaching to sentient beings with higher faculties and seek the lesser vehicle for sentient beings in the great vehicle but don't teach it according to their faculties, which is called a mistake.",
        "source": "T26n1523_001:0210c09_9"
    },
    {
        "source_sentence": "惡作錯謬者，住正行眾生如法持戒者持罰不敬，攝取破戒等，於持戒破戒中偏心，倒說法故。",
        "translation": "A mistake is that sentient beings who abide in right practice observe precepts according to the teaching and those who observe precepts are disciplined and disrespectful, taking in violations of precepts and so forth, which are partial to observing precepts and violating precepts because they teach incorrectly.",
        "source": "T26n1523_001:0210c11_10"
    },
    {
        "source_sentence": "是中持戒者有三義應知：住正行者，不犯諸業故；",
        "translation": "In this way, there are three meanings for the one who keeps precepts. Those who abide in correct practice should be known:",
        "source": "T26n1523_001:0210c14_0"
    },
    {
        "source_sentence": "持戒者，不缺漏諸戒故；",
        "translation": "The one who keeps precepts is because he does not lack the precepts.",
        "source": "T26n1523_001:0210c15_1"
    },
    {
        "source_sentence": "真法者，敬戒法故。",
        "translation": "The true dharma is because of reverence for the dharma of morality.",
        "source": "T26n1523_001:0210c15_2"
    },
    {
        "source_sentence": "有二種相釋成破戒者，破戒、缺漏戒故。",
        "translation": "There are two kinds of characteristics that explain the accomplishment of breaking the precepts because they break the precepts and lack the contaminated precepts.",
        "source": "T26n1523_001:0210c16_3"
    },
    {
        "source_sentence": "惡法者，不敬重諸戒。",
        "translation": "A bad dharma is someone who doesn't respect the precepts.",
        "source": "T26n1523_001:0210c17_4"
    },
    {
        "source_sentence": "錯謬者，取不正道及示不正道故應知。",
        "translation": "A mistake is to take the wrong path and show the wrong path, so it should be known.",
        "source": "T26n1523_001:0210c17_5"
    },
    {
        "source_sentence": "此四錯謬句現說四法：一者不說；",
        "translation": "These four incoherent statements presently expound four things:",
        "source": "T26n1523_001:0210c18_6"
    },
    {
        "source_sentence": "二者不相似說；",
        "translation": "The second is a teaching that does not resemble one another.",
        "source": "T26n1523_001:0210c19_7"
    },
    {
        "source_sentence": "三者不稱根說；",
        "translation": "The third is that they are not taught by the faculties.",
        "source": "T26n1523_001:0210c19_8"
    },
    {
        "source_sentence": "四者惡說。",
        "translation": "The fourth is bad speech.",
        "source": "T26n1523_001:0210c19_9"
    },
    {
        "source_sentence": "不說者，對前後說法疲倦，已生惡心故。",
        "translation": "Those who don't explain it are weary of teaching the Dharma before and after, because they've already given rise to bad thoughts.",
        "source": "T26n1523_001:0210c20_10"
    },
    {
        "source_sentence": "不相似說者，所說無方便故。",
        "translation": "Someone who doesn't teach similarly because what's taught has no skillful means.",
        "source": "T26n1523_001:0210c21_11"
    },
    {
        "source_sentence": "不稱根說者，喜樂小乘法故。",
        "translation": "Someone who doesn't claim to speak of the faculties because they delight in the teachings of the lesser vehicle.",
        "source": "T26n1523_001:0210c21_12"
    },
    {
        "source_sentence": "惡說者，以利養心訓誨行行故。",
        "translation": "A bad explanation is because it's based on the mind of benefiting and nurturing, instructing and practicing.",
        "source": "T26n1523_001:0210c22_13"
    },
    {
        "source_sentence": "是中惡心者以不說故，於諸善根中而便退失不能滿足，以不滿足故調誑眾生，已說法中無方便善巧故；",
        "translation": "Because they do not expound the doctrine, those with bad awarenesses in this way will fall away from the roots of virtue and be unable to fulfill them. Because they do not fulfill them, they discipline sentient beings because there is no skillful means for teaching what they have already taught.",
        "source": "T26n1523_001:0210c23_14"
    },
    {
        "source_sentence": "及不能攝取諸上善根，以樂小乘故；",
        "translation": "They are also unable to take in the roots of higher goodness because they delight in the lesser vehicle.",
        "source": "T26n1523_001:0210c25_15"
    },
    {
        "source_sentence": "及遠離上善根，復常悕求利養心訓誨行行故，不集功德及助諸惡故，調誑眾生。",
        "translation": "It's because they're far removed from the higher good roots, always seek profit and support with a mind that instructs and practices, don't gather merit and help evil, and discipline sentient beings.",
        "source": "T26n1523_001:0210c26_16"
    },
    {
        "source_sentence": "對治彼故，白朋所說應知。",
        "translation": "Because of the antidote for them, it should be known that what's said by confessing to friends.",
        "source": "T26n1523_001:0210c28_17"
    },
    {
        "source_sentence": "經言「於諸眾生其心平等，乃至普令眾生等住正行」。",
        "translation": "The sūtra says, The minds of sentient beings are equal, even up to the point where they universally cause sentient beings to equally abide in right practice.",
        "source": "T26n1523_001:0210c28_18"
    },
    {
        "source_sentence": "於諸眾生其心平等者，自己及他心平等故。",
        "translation": "“The awarenesses of beings are equal”: Because the awarenesses of oneself and of someone else are equal.",
        "source": "T26n1523_001:0211a01_0"
    },
    {
        "source_sentence": "於不深信眾生，化未成熟者而為說法，防護不作錯謬。",
        "translation": "He teaches the Dharma to those who don't deeply believe in sentient beings and transforms those who aren't mature, guarding them so they won't make mistakes.",
        "source": "T26n1523_001:0211a02_0"
    },
    {
        "source_sentence": "心知於一切眾生平等說法者，法等故名為等法。",
        "translation": "The mind knows that all sentient beings teach the Dharma equally, and because it's equal in principle, it's called equal in principle.",
        "source": "T26n1523_001:0211a03_1"
    },
    {
        "source_sentence": "於非器眾生樂小乘等悕求大乘者，隨力說法防護過量錯謬應知，隨器說故。",
        "translation": "Those who delight in the lesser vehicle and seek the Great Vehicle among non-bodhisattva sentient beings, etc., should be able to teach the Dharma according to their capacities so as to guard against faults and errors that should be known, because it's taught according to the container.",
        "source": "T26n1523_001:0211a04_2"
    },
    {
        "source_sentence": "普化一切眾生令入佛慧者，信樂大乘上根眾生而意求小乘法，勸令入佛慧，防護不正作錯謬應知。",
        "translation": "He who universally transforms all sentient beings and causes them to enter the Buddha's wisdom believes in the great vehicle, encourages sentient beings with higher faculties who want to pursue the lesser vehicle teachings, encourages them to enter the Buddha's wisdom, protects those who don't correctly create errors, and should be known.",
        "source": "T26n1523_001:0211a06_3"
    },
    {
        "source_sentence": "普令眾生等住正行者，捨諸利養名聞破戒持戒等心，以等同說法護惡作錯謬事應知。",
        "translation": "Causing all sentient beings to equally abide in correct practice is the mind that abandons benefits and rewards, renounces fame, breaks precepts, observes precepts, and so forth, and teaches the same Dharma to guard against bad actions and errors with equality, which should be known.",
        "source": "T26n1523_001:0211a08_4"
    },
    {
        "source_sentence": "諫菩薩不正取因及不應親近已，示現可親近不可親近因故。",
        "translation": "After remonstrating with the bodhisattva, they don't correctly grasp causes and shouldn't become intimate, because they show that they can be intimate and not intimate causes.",
        "source": "T26n1523_001:0211a10_5"
    },
    {
        "source_sentence": "「佛語迦葉！",
        "translation": "The Buddha said, Kāśyapa!",
        "source": "T26n1523_001:0211a11_6"
    },
    {
        "source_sentence": "菩薩有四非善知識非善等侶，菩薩常應捨彼。",
        "translation": "A bodhisattva has four kinds of companions who aren't good friends or not good, and a bodhisattva should always abandon them.",
        "source": "T26n1523_001:0211a12_7"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T26n1523_001:0211a13_8"
    },
    {
        "source_sentence": "求小乘者但欲自利，乃至親近，以成世間利而無法利」。",
        "translation": "Those who seek the lesser vehicle simply want to benefit themselves and even become intimate with it because they accomplish worldly benefits but not non-worldly benefits.",
        "source": "T26n1523_001:0211a13_9"
    },
    {
        "source_sentence": "問曰：何故定說四法？",
        "translation": "Question: Why are four factors spoken of definitely?",
        "source": "T26n1523_001:0211a14_10"
    },
    {
        "source_sentence": "答曰：因非善知識故。",
        "translation": "Answer: It's because they aren't good teachers.",
        "source": "T26n1523_001:0211a15_11"
    },
    {
        "source_sentence": "說四種非善知識，非善等侶應知。",
        "translation": "It should be known that four kinds of bad companions are spoken of:",
        "source": "T26n1523_001:0211a15_12"
    },
    {
        "source_sentence": "何等四種？",
        "translation": "What are these four kinds?",
        "source": "T26n1523_001:0211a16_13"
    },
    {
        "source_sentence": "一者於乘中非善知識；",
        "translation": "The first is that they are not good teachers in the vehicle.",
        "source": "T26n1523_001:0211a16_14"
    },
    {
        "source_sentence": "二者於行中非善知識；",
        "translation": "The second is the absence of spiritual benefactors in practice.",
        "source": "T26n1523_001:0211a17_15"
    },
    {
        "source_sentence": "三者於佛法中非善知識；",
        "translation": "The third is that they are not good teachers of Buddhist doctrine.",
        "source": "T26n1523_001:0211a17_16"
    },
    {
        "source_sentence": "四者於正法中非善知識。",
        "translation": "Fourth, they aren't good teachers in the right teaching.",
        "source": "T26n1523_001:0211a18_17"
    },
    {
        "source_sentence": "是中小乘人者，但求己利不求他益，性行狹劣相似故，勸菩薩令遠離大乘法中故，是名於乘中非善知識應知。",
        "translation": "A person of the lesser vehicle in this group simply seeks their own benefit and doesn't seek the benefit of others, because their nature and actions are narrow and similar, and they encourage bodhisattvas to part with the great vehicle teachings, which is called someone who isn't a good teacher in the vehicle that should be known.",
        "source": "T26n1523_001:0211a18_18"
    },
    {
        "source_sentence": "求緣覺者，少欲少作，背眾生益及修行處，令勸菩薩遠離眾生益及諸行等，以遠離益故成失行因，是名於行中非善知識應知。",
        "translation": "Those who seek pratyekabuddhas with few desires and few actions, turn their backs on the benefits of sentient beings and the places of cultivation, encourage bodhisattvas to distance themselves from the benefits of sentient beings and the practices, and so forth, and because they become the causes of loss of practice because of that absence of benefit, this is called someone who's not a good teacher in practice.",
        "source": "T26n1523_001:0211a21_19"
    },
    {
        "source_sentence": "盧伽耶陀者，說種種異言故，勸令遠離於佛法中，以遠離故成失行因，是名於正法中非善知識應知。",
        "translation": "Because he speaks various different words, he encourages people to distance themselves from the Buddha's teachings, and because they are far removed, they become causes of loss of practice, which is called not a good teacher in the right teaching that should be known.",
        "source": "T26n1523_001:0211a24_20"
    },
    {
        "source_sentence": "彼親近己，唯有世間利而無法利，於善法中勤修故得成退失因，以退失善法因故，名為於正法非善知識應知。",
        "translation": "Because they become intimate with themselves, there's only worldly benefits and no benefits, and because they diligently cultivate good qualities, they attain the cause of regression because they're the cause of regressing, which is called not a good teacher in the right teaching that should be known.",
        "source": "T26n1523_001:0211a26_21"
    },
    {
        "source_sentence": "對治非故，說四種善知識。",
        "translation": "Because the antidote is no, it is said to be fourfold:",
        "source": "T26n1523_001:0211a29_22"
    },
    {
        "source_sentence": "經言「諸來求者，是菩薩善知識、佛道因緣」者，對不斷絕大乘法故，說諸來求者是菩薩善知識，差別應知。",
        "translation": "The sūtra says, Those who come to seek are the causes and conditions for bodhisattvas who are good teachers and buddhas of the path because they don't stop cutting off the great vehicle teachings, saying that those who come to seek are bodhisattvas who are good teachers, which is a distinction that should be known.",
        "source": "T26n1523_001:0211a29_23"
    },
    {
        "source_sentence": "菩薩作是念：我依來求善知識因故，修無量功德迴向無上菩提，修行不虛故。",
        "translation": "The bodhisattva thought, Because I relied on the cause of seeking good friends, cultivating measureless merit and dedicating myself to unsurpassed enlightenment, my practice wasn't false.",
        "source": "T26n1523_001:0211b03_24"
    },
    {
        "source_sentence": "不悕求小乘，所修布施助成菩提作善根故，令不失大乘行。",
        "translation": "They don't covet the lesser vehicle, cultivate generosity to help achieve enlightenment and create good roots so they won't lose the practice of the great vehicle.",
        "source": "T26n1523_001:0211b05_25"
    },
    {
        "source_sentence": "說法者，是菩薩善知識。",
        "translation": "He who teaches the Dharma is a good friend of the bodhisattva.",
        "source": "T26n1523_001:0211b06_26"
    },
    {
        "source_sentence": "生智慧純志者，不失行對治，以多聞故能令為他說法，是故不求少欲之事，聞慧多純志故，雖得世間苦而不疲倦。",
        "translation": "He who gives rise to wisdom and pure intention is the antidote of not losing practice because he's well-versed and able to teach others. Therefore, he doesn't seek things with few desires, and because he hears wisdom and has many pure intentions, even though he's suffering in the world and isn't weary.",
        "source": "T26n1523_001:0211b07_27"
    },
    {
        "source_sentence": "教化人令得出家者，是菩薩善知識。",
        "translation": "A bodhisattva who teaches people to leave home is a good friend of the bodhisattva.",
        "source": "T26n1523_001:0211b09_28"
    },
    {
        "source_sentence": "純志增長一切善法者，不斷正法理對治勸出家故。",
        "translation": "The pure intention to increase all good qualities is because they don't stop the correct principle of the teaching and antidote that encourages renunciation.",
        "source": "T26n1523_001:0211b10_29"
    },
    {
        "source_sentence": "於諸邪法而成遠離，以一切善根純志故，作利益而不生懈怠疲倦退失。",
        "translation": "They become detached from wrong teachings because all their good roots are purely determined, and they work for their benefit without laziness, weariness, exhaustion, or retrogression.",
        "source": "T26n1523_001:0211b11_30"
    },
    {
        "source_sentence": "諸佛世尊，是菩薩善知識，純志一切佛法增長者，對治不失佛法故。",
        "translation": "Bhagavān, the buddhas are good teachers of bodhisattvas who purely aspire to the growth of all the Buddha's teachings because they counteract not losing the Buddha's teachings.",
        "source": "T26n1523_001:0211b13_31"
    },
    {
        "source_sentence": "示現得諸佛挍量勝不退故，釋成不著利養名聞等。",
        "translation": "It's because they show that they've attained the buddhas' debilitating superiority and non-backsliding, explaining that they're accomplished without attachment to benefits, fame, learning, and so forth.",
        "source": "T26n1523_001:0211b15_32"
    },
    {
        "source_sentence": "既著利養名聞故，令遠離退失諸佛法。",
        "translation": "Because they're attached to profiting from fame and reputation, they'll be freed from regressing from the Buddha's teachings.",
        "source": "T26n1523_001:0211b16_33"
    },
    {
        "source_sentence": "修習純志諸佛法，及以積善根力故，不能退失。",
        "translation": "They cultivate pure aspirations for the Buddha's teachings, and because of the power of accumulating good roots, they can't regress.",
        "source": "T26n1523_001:0211b17_34"
    },
    {
        "source_sentence": "以是義故，從非善知識中諫己勸修如是實行，行菩薩事故。",
        "translation": "Because of this meaning, they admonish themselves from someone who's not a good teacher and encourage them to cultivate such real practices, which are the bodhisattva's deeds.",
        "source": "T26n1523_001:0211b18_35"
    },
    {
        "source_sentence": "明不如實及如實諸菩薩相故。",
        "translation": "It's because it explains the characteristics of bodhisattvas who don't really exist and those who truly exist.",
        "source": "T26n1523_001:0211b19_36"
    },
    {
        "source_sentence": "「佛語迦葉：菩薩有四非菩薩而似菩薩。",
        "translation": "The Buddha said to Kāśyapa, There are four bodhisattvas who aren't bodhisattvas but resemble bodhisattvas.",
        "source": "T26n1523_001:0211b20_37"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T26n1523_001:0211b21_38"
    },
    {
        "source_sentence": "一者貪求利養而不求法，乃至樂聚徒眾不樂遠離」。",
        "translation": "One, they crave profit and don't seek the Dharma, even to the point where they delight in gathering crowds of followers and don't delight in separation.",
        "source": "T26n1523_001:0211b21_39"
    },
    {
        "source_sentence": "問曰：何故唯有四法？",
        "translation": "Q: Why are there only four dharmas?",
        "source": "T26n1523_001:0211b22_40"
    },
    {
        "source_sentence": "答曰：因四種非菩薩相故，說四種非菩薩相事，而似菩薩應知。",
        "translation": "Answer: Because of these four kinds of things that aren't bodhisattva characteristics, it's said that the four kinds of things that aren't bodhisattva characteristics resemble bodhisattvas and should be known.",
        "source": "T26n1523_001:0211b23_41"
    },
    {
        "source_sentence": "一者多聞相似；",
        "translation": "The first is the similarity of extensive learning.",
        "source": "T26n1523_001:0211b24_42"
    },
    {
        "source_sentence": "二者阿蘭若相似；",
        "translation": "The second is the similarity of forest dwelling.",
        "source": "T26n1523_001:0211b25_0"
    },
    {
        "source_sentence": "三者造作功德行相似；",
        "translation": "The third is the similarity of the meritorious deeds they perform.",
        "source": "T26n1523_001:0211b25_1"
    },
    {
        "source_sentence": "四者將諸徒眾相似。",
        "translation": "Fourth, it's to make all the disciples resemble each other.",
        "source": "T26n1523_001:0211b25_2"
    },
    {
        "source_sentence": "貪求利養而不求法者，菩薩於諸信心中悕求利養者，雖復持法，是名不如實非如實。",
        "translation": "A bodhisattva who desires profit and doesn't seek the Dharma, and a bodhisattva who earnestly seeks profit in faith even though he retains the Dharma, this is called someone who doesn't really see what's true and doesn't see what's true.",
        "source": "T26n1523_001:0211b26_3"
    },
    {
        "source_sentence": "貪求名聞稱己之德，不求出世功德者，樂名聞菩薩者，雖為阿蘭若，是名不如實非如實。",
        "translation": "Those who crave fame and reputation to praise their own virtues and don't seek worldly merits, and those who delight in name-hearing bodhisattvas even though they are a forest dwellers are called not as real or not as real.",
        "source": "T26n1523_001:0211b28_4"
    },
    {
        "source_sentence": "貪求自樂，不能救拔眾生諸苦者，以利養悕求心縛故，菩薩雖作功德行，而名不如實非如實。",
        "translation": "Those who covet their own happiness and can't save sentient beings from suffering because they're bound by the mind of pursuing profit and pity, even though a bodhisattva does meritorious actions, they're called what's not true and what's not true.",
        "source": "T26n1523_001:0211c01_5"
    },
    {
        "source_sentence": "樂求聚徒眾不樂遠離者，以供養恭敬心縛故，菩薩雖是眾首，而名不如實行非如實行。",
        "translation": "Although the bodhisattva is the leader of the assembly, he's called someone who doesn't practice according to reality and doesn't practice according to reality because he's bound by offering support and respect.",
        "source": "T26n1523_001:0211c03_6"
    },
    {
        "source_sentence": "菩薩如是行行已，令失持法、阿蘭若、作諸功德及眾首之事。",
        "translation": "After thus practicing it, the bodhisattva causes them to lose the way to maintain the Dharma, a forest, perform meritorious deeds, and perform the tasks of the heads.",
        "source": "T26n1523_001:0211c05_7"
    },
    {
        "source_sentence": "對治彼故，說諸真實功德應知。",
        "translation": "Because of the antidote for them, it should be known that they are said to be true qualities.",
        "source": "T26n1523_001:0211c06_8"
    },
    {
        "source_sentence": "經言「能信解空亦信業報，以信解空故，不樂利養」等事。",
        "translation": "The sūtras say, They can believe in understanding emptiness and also believe in the results of actions, and because they believe in understanding emptiness, they don't delight in profits and benefits.",
        "source": "T26n1523_001:0211c07_9"
    },
    {
        "source_sentence": "及信業報故，憙樂諸法因，樂法故聞修無量功德忍。",
        "translation": "It's because of the results of faith and actions, the causes of displeasure with dharmas, and the causes of pleasure with dharmas that they hear and cultivate measureless meritorious forbearance.",
        "source": "T26n1523_001:0211c08_10"
    },
    {
        "source_sentence": "一切無我我所者，以忍無我故，不憙樂著名聞稱等事。",
        "translation": "Because they tolerate the absence of self, they don't delight in such things as fame and hearing names.",
        "source": "T26n1523_001:0211c10_11"
    },
    {
        "source_sentence": "於一切眾生起大悲心者，以大悲故悕求菩薩功德。",
        "translation": "Those who give rise to the mind of great compassion for all sentient beings earnestly seek the bodhisattva's merit because of great compassion.",
        "source": "T26n1523_001:0211c11_12"
    },
    {
        "source_sentence": "入涅槃意者，以涅槃意不樂自樂。",
        "translation": "He who enters the intention to nirvāṇa because he doesn't delight in or enjoy himself with the intention to nirvāṇa.",
        "source": "T26n1523_001:0211c12_13"
    },
    {
        "source_sentence": "不捨世間行者，以不捨世間故，拔眾生苦。",
        "translation": "Those who don't abandon worldly practices because they don't abandon the world will remove the suffering of sentient beings because they don't abandon the world.",
        "source": "T26n1523_001:0211c13_14"
    },
    {
        "source_sentence": "為化眾生者，心不捨眾生故。",
        "translation": "He who wants to transform sentient beings because his mind doesn't abandon sentient beings.",
        "source": "T26n1523_001:0211c14_15"
    },
    {
        "source_sentence": "而行布施者，以行施故，善知眾生功德。",
        "translation": "Those who practice generosity because they practice generosity well know the merits of sentient beings.",
        "source": "T26n1523_001:0211c15_0"
    },
    {
        "source_sentence": "雖修行施而不望報者，以樂寂靜故，行施而不求報耳。",
        "translation": "Although he cultivates generosity, he doesn't expect reward because he enjoys quiescence and practices generosity without seeking reward.",
        "source": "T26n1523_001:0211c15_1"
    },
    {
        "source_sentence": "問曰：白朋中演信樂等法、說空等法何用？",
        "translation": "Q: What's the use of expounding such things as faith and explaining emptiness in a white group?",
        "source": "T26n1523_001:0211c17_2"
    },
    {
        "source_sentence": "答曰：布施等助道諸行者，意謂與聲聞緣覺等共諸行，而欲聞菩薩勝行故。",
        "translation": "Answer: The practices of generosity and so forth that aid in the path are meant to be shared with the practices of śrāvakas, pratyekbuddhas, and so forth, and they want to hear about the bodhisattva's superior practice.",
        "source": "T26n1523_001:0211c18_3"
    },
    {
        "source_sentence": "及生猶豫心，為欲現說聲聞緣覺不共，助成正覺諸菩薩法故。",
        "translation": "They give rise to hesitation because they want to show that śrāvakas and pratyekbuddhas aren't common to them, and they help accomplish the bodhisattva teachings of right awakening.",
        "source": "T26n1523_001:0211c19_4"
    },
    {
        "source_sentence": "大乘寶積經論卷第一",
        "translation": "Commentary on the Treatise on the Great Vehicle Jeweled Scripture Treatise, Volume 1",
        "source": "T26n1523_001:0211c22_0"
    },
    {
        "source_sentence": "此論宋藏第一卷，與諸藏本文義逈異，未知去取。",
        "translation": "This treatise is the first volume of the Song collection of this treatise, which differs in meaning from the texts in the collections and doesn't know how to remove it.",
        "source": "T26n1523_001:0211c23_0"
    },
    {
        "source_sentence": "按《開元錄》云「右釋舊單卷大寶積經，則寶積第四十三會是。",
        "translation": "According to the Kaiyuan lu, the right-hand interpretation of the old single-fascicle Mahāprajñāpāramitā-sūtra says, This is the forty-third assembly of the treasure accumulation.",
        "source": "T26n1523_001:0211c24_1"
    },
    {
        "source_sentence": "寶積部云第四十三普明菩薩會一卷失譯。",
        "translation": "The Jewel-Store School says that the forty-third Bodhisattva Assembly of Universal Illumination, in one volume, is a lost translation.",
        "source": "T26n1523_001:0211c25_2"
    },
    {
        "source_sentence": "右舊譯單卷大寶積經，有釋論四卷。」",
        "translation": "The right is the old translation of the single-fascicle Mahāprajñāpāramitā-sūtra, which has four fascicles of an explanation of the treatise.",
        "source": "T26n1523_001:0211c26_3"
    },
    {
        "source_sentence": "今撿之宋本初卷，則全是彼經，非論文也。",
        "translation": "Now, when we examine the first volume of the Song text, it's all that sūtra, not that one.",
        "source": "T26n1523_001:0211c27_4"
    },
    {
        "source_sentence": "是則宋本錯將經本名加論字為論初卷，又為留支譯。",
        "translation": "This is the first volume of the treatise, which was translated by Ruci into Chinese.",
        "source": "T26n1523_001:0211c28_5"
    },
    {
        "source_sentence": "何也？",
        "translation": "What is it?",
        "source": "T26n1523_001:0211c29_6"
    },
    {
        "source_sentence": "今取二本為正，其所釋經本則是大經第一百一十二卷耳。",
        "translation": "Now, we take the two texts as correct, and the sūtras that they explain are the one hundred and twelve fascicles of the first book of the great sūtra.",
        "source": "T26n1523_001:0212a01_0"
    },
    {
        "source_sentence": "後賢欲知今之所去宋本初卷是何等者，請見彼經即是耳。",
        "translation": "Later, the good man wanted to know what the first volume of the Song version of the presently departed text was, so he asked to see that it was the scripture.",
        "source": "T26n1523_001:0212a02_1"
    }
]