[
    {
        "source_sentence": "阿毘達磨品類足論卷第四",
        "translation": "Abhidharma-mahāprajñāpāramitā-śāstra, vol. 4",
        "source": "T26n1542_004:0704b02_0"
    },
    {
        "source_sentence": "尊者世友造",
        "translation": "created by the venerable secular friend",
        "source": "T26n1542_004:0704b04_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T26n1542_004:0704b05_0"
    },
    {
        "source_sentence": "辯隨眠品第五之二",
        "translation": "The Fifth and Second Parts of the Chapter on Defending latent tendencies",
        "source": "T26n1542_004:0704b06_0"
    },
    {
        "source_sentence": "有唯二十法，謂唯見苦所斷法、唯見集所斷法、唯見滅所斷法、惟見道所斷法、唯修所斷法。",
        "translation": "There are only twenty dharmas: the dharmas to be eliminated by insight into unsatisfactoriness, the dharmas to be eliminated by insight into the origin of suffering, the dharmas to be eliminated by insight into cessation, the",
        "source": "T26n1542_004:0704b07_0"
    },
    {
        "source_sentence": "如不定繫，欲界繫、色界繫、無色界繫亦爾。",
        "translation": "The same applies to the fetters of the realm of sexual passion, to the fetters of the realm of form and to the fetters of the one of formlessness.",
        "source": "T26n1542_004:0704b09_1"
    },
    {
        "source_sentence": "於惟見苦所斷法，幾隨眠隨增？",
        "translation": "How many dharmas are abandoned through Seeing the Truth of Suffering?",
        "source": "T26n1542_004:0704b10_2"
    },
    {
        "source_sentence": "答：惟見苦所斷非遍行隨眠。",
        "translation": "Answer: “Only what is to be abandoned through the vision of frustration is no pervasive proclivities”:",
        "source": "T26n1542_004:0704b10_3"
    },
    {
        "source_sentence": "於惟見集所斷法，幾隨眠隨增？",
        "translation": "How many dharmas are abandoned through Seeing the Arising of Suffering?",
        "source": "T26n1542_004:0704b11_4"
    },
    {
        "source_sentence": "答：惟見集所斷非遍行隨眠。",
        "translation": "Answer: Only what is to be abandoned through the vision of the origin is no pervasive proclivities.",
        "source": "T26n1542_004:0704b12_5"
    },
    {
        "source_sentence": "於惟見滅所斷法，幾隨眠隨增？",
        "translation": "How many dharmas are abandoned through Seeing the Extinction of Suffering?",
        "source": "T26n1542_004:0704b12_6"
    },
    {
        "source_sentence": "答：惟見滅所斷一切隨眠。",
        "translation": "Answer: All proclivities that are to be abandoned through the vision of cessation only.",
        "source": "T26n1542_004:0704b13_7"
    },
    {
        "source_sentence": "於惟見道所斷法，幾隨眠隨增？",
        "translation": "How many dharmas are abandoned through Seeing only the Path of Meditation?",
        "source": "T26n1542_004:0704b14_8"
    },
    {
        "source_sentence": "答：惟見道所斷一切隨眠。",
        "translation": "Answer: All proclivities that are to be abandoned through the path of vision only.",
        "source": "T26n1542_004:0704b14_9"
    },
    {
        "source_sentence": "於惟修所斷法，幾隨眠隨增？",
        "translation": "How many proclivities are there among the dharmas abandoned through Meditation alone?",
        "source": "T26n1542_004:0704b15_10"
    },
    {
        "source_sentence": "答：惟修所斷一切隨眠。",
        "translation": "Answer: All proclivities that are to be abandoned through spiritual practice only.",
        "source": "T26n1542_004:0704b16_11"
    },
    {
        "source_sentence": "如不定繫，欲界繫、色界繫、無色界繫亦爾。",
        "translation": "The same applies to the fetters of the realm of sexual passion, to the fetters of the realm of form and to the fetters of the one of formlessness.",
        "source": "T26n1542_004:0704b16_12"
    },
    {
        "source_sentence": "於惟見苦所斷法，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many of the dharmas abandoned through insight into unsatisfactoriness are not associated with increase because they are conditioned by dormancy and how many are not associated with increase because they are not conditioned by dormancy?",
        "source": "T26n1542_004:0704b18_0"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，無。",
        "translation": "Answer: “Because of the supporting object, it is successive and not conjoined”:",
        "source": "T26n1542_004:0704b21_1"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，無。",
        "translation": "Because they are conjoined, it follows the increase and is not the perceptual object.",
        "source": "T26n1542_004:0704b22_0"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂惟見苦所斷非遍行隨眠。",
        "translation": "Because of being the supporting object, it is successively increasing and also associated: because only what is to be abandoned through vision of frustration is not pervasive proclivities.",
        "source": "T26n1542_004:0704b22_1"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，無。",
        "translation": "“Because it is not the supporting object, there is no such thing as successively increasing and not being conjoined”:",
        "source": "T26n1542_004:0704b23_2"
    },
    {
        "source_sentence": "於惟見集所斷法，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many of the dharmas abandoned by insight into the origin are not associated with increase because they are conditioned by dormancy and how many are not associated with increase because they are not conditioned by dormancy?",
        "source": "T26n1542_004:0704b24_3"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，無。",
        "translation": "Answer: “Because of the supporting object, it is successive and not conjoined”:",
        "source": "T26n1542_004:0704b27_4"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，無。",
        "translation": "Because they are conjoined, it follows the increase and is not the perceptual object.",
        "source": "T26n1542_004:0704b28_5"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂惟見集所斷非遍行隨眠。",
        "translation": "Because of being the supporting object, it follows increase and also is associated: because only what is to be abandoned through vision of the origin is not pervasive proclivities.",
        "source": "T26n1542_004:0704b29_6"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，無。",
        "translation": "“Because it is not the supporting object, there is no such thing as successively increasing and not being conjoined”:",
        "source": "T26n1542_004:0704c01_7"
    },
    {
        "source_sentence": "於惟見滅所斷法，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many dharmas are abandoned by insight into cessation because they are not associated with increase and how many are not associated with increase because they are not the object of increase?",
        "source": "T26n1542_004:0704c02_8"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，無。",
        "translation": "Answer: “Because of the supporting object, it is successive and not conjoined”:",
        "source": "T26n1542_004:0704c05_9"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，謂見滅所斷無漏緣隨眠。",
        "translation": "“Concomitant because it is not the supporting object”: The pure supporting objects that are to be abandoned through the vision of cessation have latent dormancy as supporting object.",
        "source": "T26n1542_004:0704c06_10"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂見滅所斷有漏緣隨眠。",
        "translation": "Because of being the supporting object, it is successively increasing and also associated: impure condition as supporting object that is to be abandoned through the vision of cessation.",
        "source": "T26n1542_004:0704c07_11"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，無。",
        "translation": "“Because it is not the supporting object, there is no such thing as successively increasing and not being conjoined”:",
        "source": "T26n1542_004:0704c08_12"
    },
    {
        "source_sentence": "於惟見道所斷法，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many dharmas are abandoned through the path of insight that are only conditioned by proclivities, because they are not associated with increase and how many are not associated with increase because they are not conditioned by proclivities?",
        "source": "T26n1542_004:0704c09_13"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，無。",
        "translation": "Answer: “Because of the supporting object, it is successive and not conjoined”:",
        "source": "T26n1542_004:0704c12_14"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，謂見道所斷無漏緣隨眠。",
        "translation": "“Concomitant, it follows and increases because it is not the supporting object”: The pure supporting object that is to be abandoned through the path of vision has proclivities as a supporting object.",
        "source": "T26n1542_004:0704c13_15"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂見道所斷有漏緣隨眠。",
        "translation": "“Conditioned by the supporting object, it follows increase and is also associated”: The impure conditioned supporting object that is to be abandoned through the path of vision is proclivities as companion.",
        "source": "T26n1542_004:0704c14_16"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，無。",
        "translation": "“Because it is not the supporting object, there is no such thing as successively increasing and not being conjoined”:",
        "source": "T26n1542_004:0704c15_17"
    },
    {
        "source_sentence": "於惟修所斷法，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many of the dharmas that are cultivated and eliminated are not associated with increase because they are conditioned by dormancy, how many are not associated with increase because they are not conditioned by dormancy?",
        "source": "T26n1542_004:0704c16_18"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，無。",
        "translation": "Answer: “Because of the supporting object, it is successive and not conjoined”:",
        "source": "T26n1542_004:0704c19_19"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，無。",
        "translation": "Because they are conjoined, it follows the increase and is not the perceptual object.",
        "source": "T26n1542_004:0704c20_20"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂惟修所斷一切隨眠。",
        "translation": "Because of being the supporting object, it follows increase and is also associated: all proclivities that are to be abandoned through spiritual practice only.",
        "source": "T26n1542_004:0704c20_21"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，無。",
        "translation": "“Because it is not the supporting object, there is no such thing as successively increasing and not being conjoined”:",
        "source": "T26n1542_004:0704c21_22"
    },
    {
        "source_sentence": "有二十心，謂見苦所斷心、見集所斷心、見滅所斷心、見道所斷心、修所斷心。",
        "translation": "There are twenty awarenesses: awarenesses to be abandoned through the vision of frustration; awarenesses to be abandoned through the vision of the origin; awarenesses to be abandoned through the vision of cessation; awarenesses to be abandoned through the vision of the path",
        "source": "T26n1542_004:0704c23_0"
    },
    {
        "source_sentence": "如不定繫，欲界繫、色界繫、無色界繫亦爾。",
        "translation": "The same applies to the fetters of the realm of sexual passion, to the fetters of the realm of form and to the fetters of the one of formlessness.",
        "source": "T26n1542_004:0704c24_1"
    },
    {
        "source_sentence": "於見苦所斷心，幾隨眠隨增？",
        "translation": "How many minds are abandoned through Seeing the Truth of Suffering?",
        "source": "T26n1542_004:0704c25_2"
    },
    {
        "source_sentence": "答：見苦所斷一切，及見集所斷遍行隨眠，於彼相應法，及彼等起心不相應行亦爾。",
        "translation": "Answer: All that are to be abandoned through the vision of frustration and pervasive proclivities that are to be abandoned through the vision of the origin. The same applies to factors associated with these, as well as to formations dissociated from awarenesses that",
        "source": "T26n1542_004:0704c26_3"
    },
    {
        "source_sentence": "於見集所斷心，幾隨眠隨增？",
        "translation": "How many minds are abandoned through Seeing the Arising of Suffering?",
        "source": "T26n1542_004:0704c28_4"
    },
    {
        "source_sentence": "答：見集所斷一切，及見苦所斷遍行隨眠，於彼相應法，及彼等起心不相應行亦爾。",
        "translation": "Answer: All that are to be abandoned through the vision of the origin and pervasive dormancy*”®!, as well as what is to be abandoned through the vision of frustration. The same applies to factors associated with these and to formations dissocia",
        "source": "T26n1542_004:0704c28_5"
    },
    {
        "source_sentence": "於見滅所斷心，幾隨眠隨增？",
        "translation": "How many minds are abandoned through Seeing the Extinction of Suffering?",
        "source": "T26n1542_004:0705a01_6"
    },
    {
        "source_sentence": "答：見滅所斷一切，及遍行隨眠，於彼相應法亦爾，於彼等起心不相應行，",
        "translation": "Answer: All that are to be abandoned through the vision of cessation, as well as pervasive proclivities and subsequent dormancy. The same applies to factors associated with these. In relation to these, formations dissociated from awarenesses arise",
        "source": "T26n1542_004:0705a02_7"
    },
    {
        "source_sentence": "見滅所斷有漏緣及遍行隨眠。",
        "translation": "They are the contaminants that are stopped by seeing cessation, the contaminants that are stopped by pervasive latencies, and the contaminants that are stopped by pervasive latencies.",
        "source": "T26n1542_004:0705a04_0"
    },
    {
        "source_sentence": "於見道所斷心，幾隨眠隨增？",
        "translation": "How many minds are abandoned through Seeing the Path of Meditation accompanied by dormancy?",
        "source": "T26n1542_004:0705a04_1"
    },
    {
        "source_sentence": "答：見道所斷一切，及遍行隨眠，於彼相應法亦爾，於彼等起心不相應行，",
        "translation": "Answer: All that are to be abandoned through the path of vision, as well as pervasive proclivities and subsequent dormancy. The same applies to factors associated with these. In relation to these, formations dissociated from awarenesses arise.",
        "source": "T26n1542_004:0705a05_2"
    },
    {
        "source_sentence": "見道所斷有漏緣及遍行隨眠。",
        "translation": "They are the contaminants that are stopped in the path of seeing and the pervasive latencies that follow them.",
        "source": "T26n1542_004:0705a07_0"
    },
    {
        "source_sentence": "於修所斷心，幾隨眠隨增？",
        "translation": "How many minds are abandoned through Meditation accompanied by dormancy?",
        "source": "T26n1542_004:0705a07_1"
    },
    {
        "source_sentence": "答：修所斷一切，及遍行隨眠，於彼相應法，及彼等起心不相應行亦爾。",
        "translation": "Answer: All that are to be abandoned through the spiritual practice, and pervasive proclivities as companions. The same applies to factors associated with these and to formations dissociated from awarenesses produced by them.",
        "source": "T26n1542_004:0705a08_2"
    },
    {
        "source_sentence": "如不定繫，欲界繫、色界繫、無色界繫亦爾。",
        "translation": "The same applies to the fetters of the realm of sexual passion, to the fetters of the realm of form and to the fetters of the one of formlessness.",
        "source": "T26n1542_004:0705a09_3"
    },
    {
        "source_sentence": "於見苦所斷心，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many mental states abandoned through the insight of unsatisfactoriness are not associated with increase because they are conditioned by dormancy; how many are not associated with increase because they are not conditioned by dormancy?",
        "source": "T26n1542_004:0705a11_0"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，謂見集所斷遍行隨眠。",
        "translation": "Answer: Because of being the supporting object, it is successively increasing and not conjoined: pervasive proclivities that are to be abandoned through the vision of the origin.",
        "source": "T26n1542_004:0705a14_1"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，無。",
        "translation": "Because they are conjoined, it follows the increase and is not the perceptual object.",
        "source": "T26n1542_004:0705a15_2"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂見苦所斷一切隨眠。",
        "translation": "Because of being the supporting object, it is successively increasing and also because of being associated: all proclivities to be abandoned through the vision of frustration.",
        "source": "T26n1542_004:0705a16_3"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂見集所斷非遍行，及見滅道修所斷一切隨眠，",
        "translation": "because of not being the supporting object. “Concomitant with increase, but not associated with it”: Not pervasive formations to be abandoned through the vision of the origin and all proclivities to be abandoned through the vision of cessation or",
        "source": "T26n1542_004:0705a17_4"
    },
    {
        "source_sentence": "於彼相應法亦爾，於彼等起心不相應行。",
        "translation": "The same applies to the factors associated with these: formations dissociated from awarenesses that are produced regarding these.",
        "source": "T26n1542_004:0705a18_5"
    },
    {
        "source_sentence": "見苦所斷一切，及見集所斷遍行隨眠，所緣故隨增非相應故；",
        "translation": "All that are to be abandoned through the vision of frustration and pervasive proclivities that are to be abandoned through the vision of the origin, because they are not associated with each other.",
        "source": "T26n1542_004:0705a19_6"
    },
    {
        "source_sentence": "諸餘隨眠，於彼非所緣故隨增非相應故。",
        "translation": "The other proclivities are not the objects of consciousness, because they are not conjoined with it.",
        "source": "T26n1542_004:0705a21_7"
    },
    {
        "source_sentence": "於見集所斷心，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many mental states abandoned by insight into the origin are not associated with increase because they are conditioned by dormancy?",
        "source": "T26n1542_004:0705a22_8"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，謂見苦所斷遍行隨眠。",
        "translation": "Answer: Because of being the supporting object, it is successively increasing and not conjoined: pervasive proclivities that are to be abandoned through the vision of frustration.",
        "source": "T26n1542_004:0705a25_9"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，無。",
        "translation": "Because they are conjoined, it follows the increase and is not the perceptual object.",
        "source": "T26n1542_004:0705a26_10"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂見集所斷一切隨眠。",
        "translation": "Because of being the supporting object, it is successively increasing and also because of being associated: all proclivities to be abandoned through the vision of the origin.",
        "source": "T26n1542_004:0705a27_11"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂見苦所斷非遍行，及見滅道修所斷一切隨眠，",
        "translation": "because of not being the supporting object. “Concomitant with increase and not associated”: Not pervasive formations to be abandoned through the vision of frustration, and all proclivities to be abandoned through the vision of cessation and through the path",
        "source": "T26n1542_004:0705a28_12"
    },
    {
        "source_sentence": "於彼相應法亦爾，於彼等起心不相應行。",
        "translation": "The same applies to the factors associated with these: formations dissociated from awarenesses that are produced regarding these.",
        "source": "T26n1542_004:0705b01_13"
    },
    {
        "source_sentence": "見集所斷一切，及見苦所斷遍行隨眠，所緣故隨增非相應故；",
        "translation": "All that are to be abandoned through the vision of the origin and pervasive proclivities that are to be abandoned through the vision of unsatisfactoriness, because they are not associated with each other.",
        "source": "T26n1542_004:0705b02_14"
    },
    {
        "source_sentence": "諸餘隨眠，於彼非所緣故隨增非相應故。",
        "translation": "The other proclivities are not the objects of consciousness, because they are not conjoined with it.",
        "source": "T26n1542_004:0705b03_15"
    },
    {
        "source_sentence": "於見滅所斷心，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many mental states abandoned through the vision of cessation are not associated with increase because they are conditioned by dormancy, how many are not associated with increase because they are not conditioned by dormancy?",
        "source": "T26n1542_004:0705b04_16"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，謂遍行隨眠。",
        "translation": "Answer: “Following increase because of being the supporting object and not conjoined”: The pervasive proclivities that are subsequent to dormancy.",
        "source": "T26n1542_004:0705b07_17"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，謂見滅所斷無漏緣隨眠。",
        "translation": "“Concomitant because it is not the supporting object”: The pure supporting objects that are to be abandoned through the vision of cessation have latent dormancy as supporting object.",
        "source": "T26n1542_004:0705b08_18"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂見滅所斷有漏緣隨眠。",
        "translation": "Because of being the supporting object, it is successively increasing and also associated: impure condition as supporting object that is to be abandoned through the vision of cessation.",
        "source": "T26n1542_004:0705b09_19"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂見苦集所斷非遍行，及見道修所斷一切隨眠，",
        "translation": "because of not being the supporting object. The pervasive formations that are to be abandoned by insight into unsatisfactoriness, and all the proclivities that are to be abandoned by insight into the path and by means of spiritual practice:",
        "source": "T26n1542_004:0705b11_0"
    },
    {
        "source_sentence": "於彼相應法亦爾，於彼等起心不相應行。",
        "translation": "The same applies to the factors associated with these: formations dissociated from awarenesses that are produced regarding these.",
        "source": "T26n1542_004:0705b12_1"
    },
    {
        "source_sentence": "見滅所斷有漏緣，及遍行隨眠，所緣故隨增非相應故；",
        "translation": "The impure supporting objects to be abandoned through the vision of cessation and pervasive proclivities are the supporting objects, because they are not conjoined with each other.",
        "source": "T26n1542_004:0705b13_2"
    },
    {
        "source_sentence": "諸餘隨眠，於彼非所緣故隨增非相應故。",
        "translation": "The other proclivities are not the objects of consciousness, because they are not conjoined with it.",
        "source": "T26n1542_004:0705b14_3"
    },
    {
        "source_sentence": "於見道所斷心，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many minds abandoned through the path of insight are not associated with increase because they are conditioned by dormancy? how many are not associated with increase because they are not conditioned by dormancy?",
        "source": "T26n1542_004:0705b15_4"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，謂遍行隨眠。",
        "translation": "Answer: “Following increase because of being the supporting object and not conjoined”: The pervasive proclivities that are subsequent to dormancy.",
        "source": "T26n1542_004:0705b19_5"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，謂見道所斷無漏緣隨眠。",
        "translation": "“Concomitant, it follows and increases because it is not the supporting object”: The pure supporting object that is to be abandoned through the path of vision has proclivities as a supporting object.",
        "source": "T26n1542_004:0705b20_6"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂見道所斷有漏緣隨眠。",
        "translation": "“Conditioned by the supporting object, it follows increase and is also associated”: The impure conditioned supporting object that is to be abandoned through the path of vision is proclivities as companion.",
        "source": "T26n1542_004:0705b21_7"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂見苦集所斷非遍行，及見滅修所斷一切隨眠，",
        "translation": "The pervasive formations that are to be abandoned by insight into unsatisfactoriness and those that are not associated with unsatisfactoriness, because they are not the supporting object: all proclivities which are to be abandoned by insight into cess",
        "source": "T26n1542_004:0705b22_8"
    },
    {
        "source_sentence": "於彼相應法亦爾，於彼等起心不相應行。",
        "translation": "The same applies to the factors associated with these: formations dissociated from awarenesses that are produced regarding these.",
        "source": "T26n1542_004:0705b24_9"
    },
    {
        "source_sentence": "見道所斷有漏緣，及遍行隨眠，所緣故隨增非相應故；",
        "translation": "The impure supporting object and the pervasive proclivities that are to be abandoned through the path of vision have increase as supporting object because they are not associated with each other.",
        "source": "T26n1542_004:0705b25_10"
    },
    {
        "source_sentence": "諸餘隨眠，於彼非所緣故隨增非相應故。",
        "translation": "The other proclivities are not the objects of consciousness, because they are not conjoined with it.",
        "source": "T26n1542_004:0705b26_11"
    },
    {
        "source_sentence": "於修所斷心，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增亦非相應故？",
        "translation": "How many mental states are abandoned by cultivation because they are the objects of latent defilement?",
        "source": "T26n1542_004:0705b27_12"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，謂遍行隨眠。",
        "translation": "Answer: “Following increase because of being the supporting object and not conjoined”: The pervasive proclivities that are subsequent to dormancy.",
        "source": "T26n1542_004:0705c01_13"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，無。",
        "translation": "Because they are conjoined, it follows the increase and is not the perceptual object.",
        "source": "T26n1542_004:0705c02_14"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂修所斷一切隨眠。",
        "translation": "Because of being the supporting object, it is successively increasing and also because of being associated: all proclivities to be abandoned through spiritual practice.",
        "source": "T26n1542_004:0705c03_15"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂見苦集所斷非遍行，及見滅道所斷一切隨眠，",
        "translation": "The pervasive formations that are to be abandoned through the vision of frustration and through the one of the origin, and all proclivities that are to be abandoned through the vision of cessation and through the one of the path:",
        "source": "T26n1542_004:0705c04_16"
    },
    {
        "source_sentence": "於彼相應法亦爾，於彼等起心不相應行。",
        "translation": "The same applies to the factors associated with these: formations dissociated from awarenesses that are produced regarding these.",
        "source": "T26n1542_004:0705c05_17"
    },
    {
        "source_sentence": "修所斷一切，及遍行隨眠，所緣故隨增非相應故；",
        "translation": "All that are to be abandoned through personal realisation, and pervasive proclivities as supporting objects: because they are not associated with the increase of subsequent ones.",
        "source": "T26n1542_004:0705c06_18"
    },
    {
        "source_sentence": "諸餘隨眠，於彼非所緣故隨增非相應故。",
        "translation": "The other proclivities are not the objects of consciousness, because they are not conjoined with it.",
        "source": "T26n1542_004:0705c08_0"
    },
    {
        "source_sentence": "如不定繫，欲界繫、色界繫、無色界繫亦爾。",
        "translation": "The same applies to the fetters of the realm of sexual passion, to the fetters of the realm of form and to the fetters of the one of formlessness.",
        "source": "T26n1542_004:0705c08_1"
    },
    {
        "source_sentence": "有四十八心，謂見滅所斷邪見相應心、見滅所斷疑相應心、見滅所斷邪見疑相應心、見滅所斷邪見不相應心、見滅所斷疑不相應心、見滅所斷邪見疑不相應心，",
        "translation": "“Good son, there are forty-eight kinds of mind: the mind associated with false views to be abandoned by insight into cessation; the mind associated with doubt that is eliminated by insight into cessation; the mind associated with doubt that is elimina",
        "source": "T26n1542_004:0705c10_0"
    },
    {
        "source_sentence": "見道所斷心亦爾。",
        "translation": "The same applies to the awarenesses to be abandoned through the path of vision.",
        "source": "T26n1542_004:0705c13_1"
    },
    {
        "source_sentence": "如不定繫，欲界繫、色界繫、無色界繫亦爾。",
        "translation": "The same applies to the fetters of the realm of sexual passion, to the fetters of the realm of form and to the fetters of the one of formlessness.",
        "source": "T26n1542_004:0705c14_2"
    },
    {
        "source_sentence": "於見滅所斷邪見相應心，幾隨眠隨增？",
        "translation": "With respect to the mind associated with false views abandoned through the Seeing of Extinction, how many proclivities do they increase?",
        "source": "T26n1542_004:0705c15_3"
    },
    {
        "source_sentence": "答：見滅所斷邪見，及彼相應無明，若見滅所斷有漏緣，若遍行隨眠，",
        "translation": "Answer: The false view that is to be abandoned through the vision of cessation and the ignorance associated with it are when they see the pure supporting object, or when pervasively proceeding subsequent dormancy.",
        "source": "T26n1542_004:0705c15_4"
    },
    {
        "source_sentence": "於彼相應法亦爾，於彼等起心不相應行見滅所斷有漏緣及遍行隨眠。",
        "translation": "The same applies in relation to the factors associated with these: regarding such formations dissociated from awarenesses that are produced, the impure conditions and pervasive proclivities to be abandoned by vision and cessationTM*” as supporting object.",
        "source": "T26n1542_004:0705c17_5"
    },
    {
        "source_sentence": "於見滅所斷疑相應心，幾隨眠隨增？",
        "translation": "With respect to the mind associated with perplexity abandoned through the Seeing of Extinction, how many proclivities do they increase?",
        "source": "T26n1542_004:0705c19_6"
    },
    {
        "source_sentence": "答：見滅所斷疑，及彼相應無明。",
        "translation": "Answer: The perplexity to be abandoned through the vision of cessation and the ignorance associated with these.",
        "source": "T26n1542_004:0705c19_7"
    },
    {
        "source_sentence": "若見滅所斷有漏緣，若遍行隨眠，於彼相應法亦爾，於彼等起心不相應行見滅所斷有漏緣及遍行隨眠。",
        "translation": "The same applies to the pervasive proclivities that are abandonable by insight into cessation®*” as impure supporting object and to the pervasive proclivities that are abandonable by insight into cessation.",
        "source": "T26n1542_004:0705c20_8"
    },
    {
        "source_sentence": "於見滅所斷邪見疑相應心，幾隨眠隨增？",
        "translation": "With respect to the mind associated with perplexity regarding false views abandoned through the vision of cessation, how many proclivities do they have and increase?",
        "source": "T26n1542_004:0705c23_9"
    },
    {
        "source_sentence": "答：見滅所斷邪見疑，及彼相應無明。",
        "translation": "Answer: The perplexity of the false view to be abandoned through the vision of cessation and the ignorance associated with these.",
        "source": "T26n1542_004:0705c24_0"
    },
    {
        "source_sentence": "若見滅所斷有漏緣，若遍行隨眠，於彼相應法亦爾，於彼等起心不相應行見滅所斷有漏緣及遍行隨眠。",
        "translation": "The same applies to the pervasive proclivities that are abandonable by insight into cessation®*” as impure supporting object and to the pervasive proclivities that are abandonable by insight into cessation.",
        "source": "T26n1542_004:0705c24_1"
    },
    {
        "source_sentence": "於見滅所斷邪見不相應心，幾隨眠隨增？",
        "translation": "With respect to the mind not associated with false views abandoned by insight into cessation, how many proclivities do they have and increase?",
        "source": "T26n1542_004:0705c27_2"
    },
    {
        "source_sentence": "答？",
        "translation": "Answer?",
        "source": "T26n1542_004:0705c28_3"
    },
    {
        "source_sentence": "除見滅所斷邪見及彼相應無明，諸餘見滅所斷一切及遍行隨眠，於彼相應法亦爾，",
        "translation": "\\",
        "source": "T26n1542_004:0705c28_4"
    },
    {
        "source_sentence": "於彼等起心不相應行見滅所斷有漏緣及遍行隨眠。",
        "translation": "They give rise to unconcomitant mental formations that are stopped by seeing and ceasing, which have contaminated conditions and pervasive latencies that are the causes of their cessation.",
        "source": "T26n1542_004:0706a01_5"
    },
    {
        "source_sentence": "於見滅所斷疑不相應心，幾隨眠隨增，答：除見滅所斷疑及彼相應無明，",
        "translation": "How many accompanying mental states are not associated with perplexity to be abandoned through the vision of cessation? Answer: “Exception made for perplexity to be abandoned through the vision of cessation, and ignorance associated with them”:",
        "source": "T26n1542_004:0706a02_6"
    },
    {
        "source_sentence": "諸餘見滅所斷一切及遍行隨眠，於彼相應法亦爾，於彼等起心不相應行見滅所斷有漏緣及遍行隨眠。",
        "translation": "The same applies to all other impure supporting objects and pervasive proclivities that are to be abandoned through the vision of cessation, as well as their pervasive proclivities. So it is with factors associated with these. These impure",
        "source": "T26n1542_004:0706a04_7"
    },
    {
        "source_sentence": "於見滅所斷邪見疑不相應心，幾隨眠隨增？",
        "translation": "How many minds are not associated with doubt and wrong views that are stopped by seeing cessation?",
        "source": "T26n1542_004:0706a06_8"
    },
    {
        "source_sentence": "答：除見滅所斷邪見疑及彼相應無明，諸餘見滅所斷一切及遍行隨眠，",
        "translation": "Answer: “Exception made for the perverted view of doubt and ignorance associated with these, which are to be abandoned through the vision of cessation”: All other false views that are to be abandoned through the vision of cessation and all perva",
        "source": "T26n1542_004:0706a07_9"
    },
    {
        "source_sentence": "於彼相應法亦爾，於彼等起心不相應行見滅所斷有漏緣及遍行隨眠。",
        "translation": "The same applies in relation to the factors associated with these: regarding such formations dissociated from awarenesses that are produced, the impure conditions and pervasive proclivities to be abandoned by vision and cessationTM*” as supporting object.",
        "source": "T26n1542_004:0706a09_10"
    },
    {
        "source_sentence": "見道所斷心亦爾。",
        "translation": "The same applies to the awarenesses to be abandoned through the path of vision.",
        "source": "T26n1542_004:0706a10_11"
    },
    {
        "source_sentence": "如不定繫，欲界繫、色界繫、無色界繫亦爾。",
        "translation": "The same applies to the fetters of the realm of sexual passion, to the fetters of the realm of form and to the fetters of the one of formlessness.",
        "source": "T26n1542_004:0706a11_12"
    },
    {
        "source_sentence": "於見滅所斷邪見相應心，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many minds are associated with false views that are stopped by seeing cessation, which are not associated with subsequent increase because they are the objects of latent dormancy; how many are associated with subsequent increase because they are not the objects of subsequent increase?",
        "source": "T26n1542_004:0706a13_0"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，謂見滅所斷有漏緣及遍行隨眠。",
        "translation": "Answer: Because of being the supporting object, it is successively increases and not conjoined”: The impure supporting object that is to be abandoned through the vision of cessation and the pervasive one-sided proclivities.",
        "source": "T26n1542_004:0706a16_1"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，謂見滅所斷邪見及彼相應無明。",
        "translation": "“Because of being associated, it increases successively and is not the supporting object”: False view to be abandoned through the vision of cessation and ignorance associated with them.",
        "source": "T26n1542_004:0706a17_2"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，無。",
        "translation": "“Because of being the supporting object, it is successive and also associated”: No.",
        "source": "T26n1542_004:0706a19_3"
    },
    {
        "source_sentence": "非所緣故隨增亦非相應故者，謂除見滅所斷邪見及彼相應無明，諸餘見滅所斷無漏緣，",
        "translation": "“Because of not being the supporting object, it is successively increasing and neither associated”: Exception made for the false view to be abandoned through the vision of cessation nor ignorance associated with it. The other pure supporting object that is to",
        "source": "T26n1542_004:0706a19_4"
    },
    {
        "source_sentence": "及見苦集所斷非遍行，并見道修所斷一切隨眠。",
        "translation": "They are the pervasive formations that are to be abandoned by insight into unsatisfactoriness and the non-pervasive formations that are to be abandoned by insight into unsatisfactoriness and all the proclivities that are to be abandoned",
        "source": "T26n1542_004:0706a21_5"
    },
    {
        "source_sentence": "於彼相應法亦爾，於彼等起心不相應行見滅所斷有漏緣及遍行隨眠，所緣故隨增非相應故；",
        "translation": "The same applies in relation to the factors associated with these. In relation to such [things] as awarenesses that are produced, impure supporting objects and pervasive proclivities abandoned by insight into cessation dissociated from what is associated with",
        "source": "T26n1542_004:0706a23_6"
    },
    {
        "source_sentence": "諸餘隨眠，於彼非所緣故隨增非相應故。",
        "translation": "The other proclivities are not the objects of consciousness, because they are not conjoined with it.",
        "source": "T26n1542_004:0706a25_7"
    },
    {
        "source_sentence": "於見滅所斷疑相應心，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many minds are associated with doubt that are stopped by seeing cessation because they are not associated with latencies because they are the object of latencies, how many are associated with latencies because they are not the object of latencies, how many are associated with latencies",
        "source": "T26n1542_004:0706a26_8"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，謂見滅所斷有漏緣及遍行隨眠。",
        "translation": "Answer: Because of being the supporting object, it is successively increases and not conjoined”: The impure supporting object that is to be abandoned through the vision of cessation and the pervasive one-sided proclivities.",
        "source": "T26n1542_004:0706a29_9"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，謂見滅所斷疑及彼相應無明。",
        "translation": "“Concomitant because it is not the supporting object”: The perplexity to be abandoned through the vision of cessation and the ignorance associated with them.",
        "source": "T26n1542_004:0706b02_0"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，無。",
        "translation": "“Because of being the supporting object, it is successive and also associated”: No.",
        "source": "T26n1542_004:0706b03_1"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂除見滅所斷疑及彼相應無明，諸餘見滅所斷無漏緣，",
        "translation": "“Because of not being the supporting object, it is successively increasing and not being associated”: Exception made for doubt to be abandoned through the vision of cessation and for ignorance associated with it, the other pure supporting object which is to be",
        "source": "T26n1542_004:0706b03_2"
    },
    {
        "source_sentence": "及見苦集所斷非遍行，并見道修所斷一切隨眠。",
        "translation": "They are the pervasive formations that are to be abandoned by insight into unsatisfactoriness and the non-pervasive formations that are to be abandoned by insight into unsatisfactoriness and all the proclivities that are to be abandoned",
        "source": "T26n1542_004:0706b05_3"
    },
    {
        "source_sentence": "於彼相應法亦爾，於彼等起心不相應行見滅所斷有漏緣及遍行隨眠，所緣故隨增非相應故；",
        "translation": "The same applies in relation to the factors associated with these. In relation to such [things] as awarenesses that are produced, impure supporting objects and pervasive proclivities abandoned by insight into cessation dissociated from what is associated with",
        "source": "T26n1542_004:0706b06_4"
    },
    {
        "source_sentence": "諸餘隨眠，於彼非所緣故隨增非相應故。",
        "translation": "The other proclivities are not the objects of consciousness, because they are not conjoined with it.",
        "source": "T26n1542_004:0706b09_5"
    },
    {
        "source_sentence": "於見滅所斷邪見疑相應心，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many are not associated with subsequent increases because they are conditioned by dormancy and how many are not associated with subsequent increases because they are not conditioned by dormancy?",
        "source": "T26n1542_004:0706b10_6"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，謂見滅所斷有漏緣及遍行隨眠。",
        "translation": "Answer: Because of being the supporting object, it is successively increases and not conjoined”: The impure supporting object that is to be abandoned through the vision of cessation and the pervasive one-sided proclivities.",
        "source": "T26n1542_004:0706b13_7"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，謂見滅所斷邪見疑及彼相應無明。",
        "translation": "“Concomitant because it is not the supporting object”: False view, perplexity and ignorance associated with them that are to be abandoned through the vision of cessation.",
        "source": "T26n1542_004:0706b15_8"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，無。",
        "translation": "“Because of being the supporting object, it is successive and also associated”: No.",
        "source": "T26n1542_004:0706b16_9"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂除見滅所斷邪見疑及彼相應無明，諸餘見滅所斷無漏緣，",
        "translation": "“Because of not being the supporting object, it is successively increasing and not being associated”: Exception made for the perverted view that is to be abandoned through the vision of cessation, doubt and ignorance associated with delusion as well as",
        "source": "T26n1542_004:0706b17_10"
    },
    {
        "source_sentence": "及見苦集所斷非遍行，并見道修所斷一切隨眠。",
        "translation": "They are the pervasive formations that are to be abandoned by insight into unsatisfactoriness and the non-pervasive formations that are to be abandoned by insight into unsatisfactoriness and all the proclivities that are to be abandoned",
        "source": "T26n1542_004:0706b19_11"
    },
    {
        "source_sentence": "於彼相應法亦爾，於彼等起心不相應行見滅所斷有漏緣及遍行隨眠，所緣故隨增非相應故；",
        "translation": "The same applies in relation to the factors associated with these. In relation to such [things] as awarenesses that are produced, impure supporting objects and pervasive proclivities abandoned by insight into cessation dissociated from what is associated with",
        "source": "T26n1542_004:0706b20_12"
    },
    {
        "source_sentence": "諸餘隨眠，於彼非所緣故隨增非相應故。",
        "translation": "The other proclivities are not the objects of consciousness, because they are not conjoined with it.",
        "source": "T26n1542_004:0706b22_13"
    },
    {
        "source_sentence": "於見滅所斷邪見不相應心，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "With regard to the mind not associated with false views that are abandoned by insight into cessation, how many proclivities are not associated with subsequent increase because they are conditioned by latencies; how many proclivities are associated with subsequent increase because they are not conditioned",
        "source": "T26n1542_004:0706b23_14"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，謂遍行隨眠。",
        "translation": "Answer: “Following increase because of being the supporting object and not conjoined”: The pervasive proclivities that are subsequent to dormancy.",
        "source": "T26n1542_004:0706b26_15"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，謂除見滅所斷邪見及彼相應無明，諸餘見滅所斷無漏緣隨眠。",
        "translation": "exception made for the false view to be abandoned through the vision of cessation and for ignorance associated with it; all other pure supporting objects*” that are abandoned through the vision of cessation have proclivities as supporting object.",
        "source": "T26n1542_004:0706b27_16"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂見滅所斷有漏緣隨眠。",
        "translation": "Because of being the supporting object, it is successively increasing and also associated: impure condition as supporting object that is to be abandoned through the vision of cessation.",
        "source": "T26n1542_004:0706b29_17"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂見滅所斷邪見及彼相應無明，若見苦集所斷非遍行，",
        "translation": "“Because of not being the supporting object, it is successively increasing and not being associated”: False view to be abandoned through the vision of cessation and ignorance associated with them are said to be bad views. If one sees that which is",
        "source": "T26n1542_004:0706c02_18"
    },
    {
        "source_sentence": "若見道修所斷一切隨眠。",
        "translation": "If he sees all the latent tendencies that are cultivated in the path of seeing and those that are stopped by cultivation.",
        "source": "T26n1542_004:0706c04_19"
    },
    {
        "source_sentence": "於彼相應法亦爾，於彼等起心不相應行見滅所斷有漏緣及遍行隨眠，所緣故隨增非相應故；",
        "translation": "The same applies in relation to the factors associated with these. In relation to such [things] as awarenesses that are produced, impure supporting objects and pervasive proclivities abandoned by insight into cessation dissociated from what is associated with",
        "source": "T26n1542_004:0706c04_20"
    },
    {
        "source_sentence": "諸餘隨眠，於彼非所緣故隨增非相應故。",
        "translation": "The other proclivities are not the objects of consciousness, because they are not conjoined with it.",
        "source": "T26n1542_004:0706c06_21"
    },
    {
        "source_sentence": "於見滅所斷疑不相應心，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many mental states are not associated with doubt that are stopped by seeing cessation because they are the objects of latent dormancy?",
        "source": "T26n1542_004:0706c07_22"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，謂遍行隨眠。",
        "translation": "Answer: “Following increase because of being the supporting object and not conjoined”: The pervasive proclivities that are subsequent to dormancy.",
        "source": "T26n1542_004:0706c11_23"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，謂除見滅所斷疑及彼相應無明，諸餘見滅所斷無漏緣隨眠。",
        "translation": "exception made for the perplexity to be abandoned through the vision of cessation and for ignorance associated with it. The other impure supporting object is proclivitiesTM*°, With the exception of doubt that is to be abandoned through the vision of ces",
        "source": "T26n1542_004:0706c12_24"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂見滅所斷有漏緣隨眠。",
        "translation": "Because of being the supporting object, it is successively increasing and also associated: impure condition as supporting object that is to be abandoned through the vision of cessation.",
        "source": "T26n1542_004:0706c14_25"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂見滅所斷疑，及彼相應無明，若見苦集所斷非遍行，",
        "translation": "It is not the supporting object, so it increases subsequently and not conjoined with it: perplexity to be abandoned through the vision of cessation and ignorance associated with it.",
        "source": "T26n1542_004:0706c15_26"
    },
    {
        "source_sentence": "若見道修所斷一切隨眠。",
        "translation": "If he sees all the latent tendencies that are cultivated in the path of seeing and those that are stopped by cultivation.",
        "source": "T26n1542_004:0706c17_27"
    },
    {
        "source_sentence": "於彼相應法亦爾，於彼等起心不相應行見滅所斷有漏緣及遍行隨眠，所緣故隨增非相應故；",
        "translation": "The same applies in relation to the factors associated with these. In relation to such [things] as awarenesses that are produced, impure supporting objects and pervasive proclivities abandoned by insight into cessation dissociated from what is associated with",
        "source": "T26n1542_004:0706c17_28"
    },
    {
        "source_sentence": "諸餘隨眠，於彼非所緣故隨增非相應故。",
        "translation": "The other proclivities are not the objects of consciousness, because they are not conjoined with it.",
        "source": "T26n1542_004:0706c20_0"
    },
    {
        "source_sentence": "於見滅所斷邪見疑不相應心，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many minds are not associated with doubt and wrong views that are stopped by seeing cessation because they are the objects of latent dormancy?",
        "source": "T26n1542_004:0706c20_1"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，謂遍行隨眠。",
        "translation": "Answer: “Following increase because of being the supporting object and not conjoined”: The pervasive proclivities that are subsequent to dormancy.",
        "source": "T26n1542_004:0706c24_2"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，謂除見滅所斷邪見疑及彼相應無明，諸餘見滅所斷無漏緣隨眠。",
        "translation": "exception made for the perplexity of false view that is to be abandoned through the vision of cessation, doubt and ignorance associated therewith; all other impure supporting objects*”®° are subsequently dormancy with no pure supporting object.",
        "source": "T26n1542_004:0706c25_3"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂見滅所斷有漏緣隨眠。",
        "translation": "Because of being the supporting object, it is successively increasing and also associated: impure condition as supporting object that is to be abandoned through the vision of cessation.",
        "source": "T26n1542_004:0706c27_4"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂見滅所斷邪見疑及彼相應無明，若見苦集所斷非遍行，",
        "translation": "“Because of not being the supporting object, it is successively increasing and not being associated”: False doctrine to be abandoned through the vision of cessation, doubt and ignorance associated with them are said to be pervasive when they are",
        "source": "T26n1542_004:0706c28_5"
    },
    {
        "source_sentence": "若見道修所斷一切隨眠。",
        "translation": "If he sees all the latent tendencies that are cultivated in the path of seeing and those that are stopped by cultivation.",
        "source": "T26n1542_004:0707a01_6"
    },
    {
        "source_sentence": "於彼相應法亦爾，於彼等起心不相應行見滅所斷有漏緣及遍行隨眠，所緣故隨增非相應故；",
        "translation": "The same applies in relation to the factors associated with these. In relation to such [things] as awarenesses that are produced, impure supporting objects and pervasive proclivities abandoned by insight into cessation dissociated from what is associated with",
        "source": "T26n1542_004:0707a02_7"
    },
    {
        "source_sentence": "諸餘隨眠，於彼非所緣故隨增非相應故。",
        "translation": "The other proclivities are not the objects of consciousness, because they are not conjoined with it.",
        "source": "T26n1542_004:0707a04_8"
    },
    {
        "source_sentence": "見道所斷心亦爾。",
        "translation": "The same applies to the awarenesses to be abandoned through the path of vision.",
        "source": "T26n1542_004:0707a05_9"
    },
    {
        "source_sentence": "如不定繫，欲界繫、色界繫、無色界繫亦爾。",
        "translation": "The same applies to the fetters of the realm of sexual passion, to the fetters of the realm of form and to the fetters of the one of formlessness.",
        "source": "T26n1542_004:0707a05_10"
    },
    {
        "source_sentence": "有三十六隨眠，謂見苦所斷十，見集所斷七，見滅所斷七，見道所斷八，",
        "translation": "4.5.36 There are thirty-six proclivities: ten that are abandonable by insight into unsatisfactoriness; seven that are abandonable by insight into the origin; seven that are abandonable by insight into cessation; and eight that are abandon",
        "source": "T26n1542_004:0707a07_0"
    },
    {
        "source_sentence": "修所斷四。",
        "translation": "There are four that are cultivated and stopped by cultivation.",
        "source": "T26n1542_004:0707a08_1"
    },
    {
        "source_sentence": "見苦所斷十隨眠云何？",
        "translation": "What are the ten proclivities abandonable by insight into unsatisfactoriness?",
        "source": "T26n1542_004:0707a08_2"
    },
    {
        "source_sentence": "謂有身見、邊執見。",
        "translation": "It means there's a view of the body and a view of extreme attachment.",
        "source": "T26n1542_004:0707a09_3"
    },
    {
        "source_sentence": "見苦所斷邪見、見取、戒禁取、疑、貪、瞋、慢、無明。",
        "translation": "False views that are stopped by seeing suffering, attachment to views, adherence to precepts and prohibitions, doubt, greed, anger, conceit, and ignorance.",
        "source": "T26n1542_004:0707a09_4"
    },
    {
        "source_sentence": "見集所斷七隨眠云何？",
        "translation": "What are the seven proclivities abandonable by insight into the origin?",
        "source": "T26n1542_004:0707a10_5"
    },
    {
        "source_sentence": "謂見集所斷邪見、見取、疑、貪、瞋、慢、無明。",
        "translation": "It's seeing the mistaken views, views of attachment, doubt, greed, anger, conceit, and ignorance that are stopped in the accumulation of views.",
        "source": "T26n1542_004:0707a11_6"
    },
    {
        "source_sentence": "見滅所斷七隨眠云何？",
        "translation": "What are the seven proclivities abandonable by insight into cessation?",
        "source": "T26n1542_004:0707a12_7"
    },
    {
        "source_sentence": "謂見滅所斷邪見、見取、疑、貪、瞋、慢、無明。",
        "translation": "They are the mistaken views, views of attachment, doubt, greed, anger, conceit, and ignorance that are stopped by seeing cessation.",
        "source": "T26n1542_004:0707a12_8"
    },
    {
        "source_sentence": "見道所斷八隨眠云何？",
        "translation": "What are the eight proclivities to be abandoned through the path of insight?",
        "source": "T26n1542_004:0707a13_9"
    },
    {
        "source_sentence": "謂見道所斷邪見、見取、戒禁取、疑、貪、瞋、慢、無明。",
        "translation": "They are wrong views that are stopped by seeing the path, view of attachment, adherence to precepts and prohibitions, doubt, greed, anger, conceit, and ignorance.",
        "source": "T26n1542_004:0707a14_10"
    },
    {
        "source_sentence": "修所斷四隨眠云何？",
        "translation": "What are the four proclivities that are cultivated and eliminated?",
        "source": "T26n1542_004:0707a15_11"
    },
    {
        "source_sentence": "謂修所斷貪、瞋、慢、無明。",
        "translation": "They are craving, anger, conceit, and ignorance that are cultivated and stopped by cultivation.",
        "source": "T26n1542_004:0707a15_12"
    },
    {
        "source_sentence": "於有身見，幾隨眠隨增？",
        "translation": "How many anuśayas are there in the belief in a self?",
        "source": "T26n1542_004:0707a16_13"
    },
    {
        "source_sentence": "答：見苦所斷一切及見集所斷遍行隨眠，於彼相應法及彼等起心不相應行亦爾。",
        "translation": "Answer: All that are to be abandoned through the vision of frustration and pervasive proclivities that are to be abandoned through the vision of the origin. The same applies in relation to factors associated with these and such formations dissociated from awarenesses that are",
        "source": "T26n1542_004:0707a16_14"
    },
    {
        "source_sentence": "如有身見，邊執見、見苦所斷邪見、見取、戒禁取、疑、貪、瞋、慢、無明亦爾。",
        "translation": "Just as with belief in a self, the same applies to views of extreme attachment, false views to be abandoned through insight into unsatisfactoriness, adherence to particular views, adherence to precepts and vows, doubt, covetous",
        "source": "T26n1542_004:0707a18_15"
    },
    {
        "source_sentence": "於見集所斷邪見，幾隨眠隨增？",
        "translation": "How many false views are abandoned through the Seeing of the Arising of Suffering or through Meditation?",
        "source": "T26n1542_004:0707a20_16"
    },
    {
        "source_sentence": "答：見集所斷一切及見苦所斷遍行隨眠，於彼相應法及彼等起心不相應行亦爾。",
        "translation": "Answer: All that are to be abandoned through the vision of the origin and pervasive proclivities that are to be abandoned through the vision of frustration. The same applies in relation to factors associated with these and such formations dissociated from awarenesses that are",
        "source": "T26n1542_004:0707a20_17"
    },
    {
        "source_sentence": "如見集所斷邪見，見取、疑、貪、瞋、慢、無明亦爾。",
        "translation": "Just as with the false view to be abandoned through the vision of the origin, the same applies to views of grasping, perplexity, greed, hatred, pride and ignorance.",
        "source": "T26n1542_004:0707a22_18"
    },
    {
        "source_sentence": "於見滅所斷邪見，幾隨眠隨增？",
        "translation": "How many proclivities do the false views to be abandoned through the insight of cessation have as follows and increase?",
        "source": "T26n1542_004:0707a23_19"
    },
    {
        "source_sentence": "答：見滅所斷邪見相應無明，及見滅所斷有漏緣，并遍行隨眠。",
        "translation": "Answer: The ignorance associated with false view to be abandoned through the vision of cessation and the impure supporting object to be abandoned through the vision of cessation, together with pervasive proclivities.",
        "source": "T26n1542_004:0707a24_20"
    },
    {
        "source_sentence": "於彼相應法見滅所斷邪見，及彼相應無明，若見滅所斷有漏緣，若遍行隨眠，",
        "translation": "4.5.29.11.中 Regarding the false view to be abandoned through the vision of the dharmas associated with these [factors] and the ignorance associated with them, when they are abandoned through the vision of cessation, there is a pervasive proc",
        "source": "T26n1542_004:0707a25_21"
    },
    {
        "source_sentence": "於彼等起心不相應行，見滅所斷有漏緣及遍行隨眠。",
        "translation": "Among the formations dissociated from awarenesses that arise in relation to these, the impure condition as supporting object and pervasive proclivities to be abandoned by insight and cessation are spoken of.",
        "source": "T26n1542_004:0707a27_22"
    },
    {
        "source_sentence": "見滅所斷疑亦爾。",
        "translation": "So is the doubt that's stopped by seeing cessation.",
        "source": "T26n1542_004:0707a28_23"
    },
    {
        "source_sentence": "於見滅所斷見取，幾隨眠隨增？",
        "translation": "How many proclivities are there among the anuśayas and attachments to views abandoned by insight into cessation?",
        "source": "T26n1542_004:0707a29_24"
    },
    {
        "source_sentence": "答：見滅所斷有漏緣及遍行隨眠。",
        "translation": "Answer: The impure supporting objects to be abandoned through the vision of cessation and pervasive proclivities.",
        "source": "T26n1542_004:0707a29_25"
    },
    {
        "source_sentence": "於彼相應法及彼等起心不相應行亦爾。",
        "translation": "It's likewise with respect to those associated dharmas and the mental states that give rise to them that aren't associated with mind.",
        "source": "T26n1542_004:0707b01_26"
    },
    {
        "source_sentence": "見滅所斷貪、瞋、慢亦爾。",
        "translation": "So it is with craving, anger, and conceit that are stopped by seeing cessation.",
        "source": "T26n1542_004:0707b02_27"
    },
    {
        "source_sentence": "於見滅所斷無明，幾隨眠隨增？",
        "translation": "With respect to ignorance abandoned through the Seeing and Extinguishing of Suffering, how many proclivities does it follow and increase?",
        "source": "T26n1542_004:0707b03_28"
    },
    {
        "source_sentence": "答：除見滅所斷無漏緣無明，諸餘見滅所斷一切及遍行隨眠。",
        "translation": "Answer: Exception made for the pure supporting object of ignorance to be abandoned through the vision of cessation, all other [things] that are to be abandoned through the vision of cessation and pervasive proclivities.",
        "source": "T26n1542_004:0707b03_29"
    },
    {
        "source_sentence": "於彼相應法，見滅所斷一切及遍行隨眠，於彼等起心不相應行見滅所斷有漏緣及遍行隨眠。",
        "translation": "Regarding the factors associated with these, everything that is to be abandoned through the vision of cessation and pervasive proclivitiesTM* are all abandoned through the vision of cessation. The impure condition as supporting object and pervasive procliv",
        "source": "T26n1542_004:0707b05_30"
    },
    {
        "source_sentence": "見道所斷亦爾。",
        "translation": "The same applies to that which is to be abandoned through the path of vision.",
        "source": "T26n1542_004:0707b07_31"
    },
    {
        "source_sentence": "於修所斷貪，幾隨眠隨增？",
        "translation": "How many proclivities are there among the cravings abandoned through Meditation that are accompanied by increase?",
        "source": "T26n1542_004:0707b07_32"
    },
    {
        "source_sentence": "答：修所斷一切及遍行隨眠，於彼相應法及彼等起心不相應行亦爾。",
        "translation": "Answer: All that are to be abandoned through the spiritual practice and pervasive proclivitiesTM*, The same applies to factors associated with these and to formations dissociated from awarenesses produced by these.",
        "source": "T26n1542_004:0707b08_33"
    },
    {
        "source_sentence": "修所斷瞋、慢、無明亦爾。",
        "translation": "So it is with anger, conceit, and ignorance that are cultivated and eliminated.",
        "source": "T26n1542_004:0707b09_34"
    },
    {
        "source_sentence": "於有身見，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many are not conjoined with the view that there is a body because of being conditioned by dormancy?",
        "source": "T26n1542_004:0707b11_0"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，謂除有身見相應無明，諸餘見苦所斷一切，",
        "translation": "Answer: “Because of the supporting object, subsequently increasing and not being associated with it”: Exception made for ignorance associated with belief in a self that is bodily existence, all other forms of ignorance to be abandoned through the vision of",
        "source": "T26n1542_004:0707b14_1"
    },
    {
        "source_sentence": "及見集所斷遍行隨眠。",
        "translation": "It's the pervasive latencies that are stopped by seeing what's accumulated.",
        "source": "T26n1542_004:0707b15_2"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，無。",
        "translation": "Because they are conjoined, it follows the increase and is not the perceptual object.",
        "source": "T26n1542_004:0707b16_3"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂有身見相應無明。",
        "translation": "The one that follows the increase because of being the supporting object and is also associated with it means that there is ignorance associated with belief in a self.",
        "source": "T26n1542_004:0707b16_4"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂見集所斷非遍行，及見滅道修所斷一切隨眠。",
        "translation": "because of not being the supporting object. “Concomitant with what is subsequently produced and not associated”: Not pervasive formations to be abandoned through the vision of the origin, and all proclivities to be abandoned through the vision of cess",
        "source": "T26n1542_004:0707b18_0"
    },
    {
        "source_sentence": "於彼相應法，所緣故隨增非相應故者，謂除有身見及彼相應無明，諸餘見苦所斷一切，",
        "translation": "“In relation to factors associated with these, it is because of the supporting object that they increase successively and not because of being dissociated”: Exception made for belief in a self and ignorance associated with them, all other doctrines to be abandoned through",
        "source": "T26n1542_004:0707b19_1"
    },
    {
        "source_sentence": "及見集所斷遍行隨眠。",
        "translation": "It's the pervasive latencies that are stopped by seeing what's accumulated.",
        "source": "T26n1542_004:0707b21_2"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，無。",
        "translation": "Because they are conjoined, it follows the increase and is not the perceptual object.",
        "source": "T26n1542_004:0707b22_3"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂有身見及彼相應無明。",
        "translation": "Because of being the supporting object, it is successively increasing and also because of being associated: there is belief in a self and ignorance associated with these.",
        "source": "T26n1542_004:0707b22_4"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂見集所斷非遍行，及見滅道修所斷一切隨眠。",
        "translation": "because of not being the supporting object. “Concomitant with what is subsequently produced and not associated”: Not pervasive formations to be abandoned through the vision of the origin, and all proclivities to be abandoned through the vision of cess",
        "source": "T26n1542_004:0707b24_5"
    },
    {
        "source_sentence": "於彼等起心不相應行見苦所斷一切及見集所斷遍行隨眠，所緣故隨增非相應故；",
        "translation": "All that is to be abandoned by insight into unsatisfactoriness in relation to the formations dissociated from awarenesses that give rise to it, and all pervasive proclivities that are to be abandoned by insight into the origin. Because of being",
        "source": "T26n1542_004:0707b25_6"
    },
    {
        "source_sentence": "諸餘隨眠，於彼非所緣故隨增非相應故。",
        "translation": "The other proclivities are not the objects of consciousness, because they are not conjoined with it.",
        "source": "T26n1542_004:0707b27_7"
    },
    {
        "source_sentence": "如有身見，邊執見、見苦所斷邪見、見取、戒禁取、疑、貪、瞋、慢亦爾。",
        "translation": "Just as with belief in a self, the same applies to views of extreme attachment, false views to be abandoned through insight into unsatisfactoriness, adherence to particular views, adherence to moral precepts and vows, perplexity,",
        "source": "T26n1542_004:0707b28_8"
    },
    {
        "source_sentence": "於見苦所斷無明，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many of the ignorance that is abandoned through insight into unsatisfactoriness are not conjoined with increase because they are conditioned by dormancy, and how many are not conjoined with increase because they are not conditioned by dormancy",
        "source": "T26n1542_004:0707c01_9"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，謂見苦所斷無明，及見集所斷遍行隨眠。",
        "translation": "Answer: “Because of the supporting object, it follows increase and is not associated”: The ignorance to be abandoned through vision of frustration and the pervasive one-sided proclivities to be abandoned through the vision of the origin are said",
        "source": "T26n1542_004:0707c04_10"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，無。",
        "translation": "Because they are conjoined, it follows the increase and is not the perceptual object.",
        "source": "T26n1542_004:0707c06_11"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂除見苦所斷無明，諸餘見苦所斷一切隨眠。",
        "translation": "“Because of being the supporting object, it follows increase and also is associated”: Exception made for ignorance to be abandoned through vision of unsatisfactoriness, all other proclivities to be abandoned through vision of unsatisfactoriness",
        "source": "T26n1542_004:0707c06_12"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂見集所斷非遍行，及見滅道修所斷一切隨眠。",
        "translation": "because of not being the supporting object. “Concomitant with what is subsequently produced and not associated”: Not pervasive formations to be abandoned through the vision of the origin, and all proclivities to be abandoned through the vision of cess",
        "source": "T26n1542_004:0707c08_13"
    },
    {
        "source_sentence": "於彼相應法，所緣故隨增非相應故者，謂見集所斷遍行隨眠。",
        "translation": "The pervasive proclivities to be abandoned through the vision of the origin are said to be the pervasive proclivities that are associated with these factors, because they are the objects of consciousness.",
        "source": "T26n1542_004:0707c10_14"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，無。",
        "translation": "Because they are conjoined, it follows the increase and is not the perceptual object.",
        "source": "T26n1542_004:0707c11_15"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂見苦所斷一切隨眠。",
        "translation": "Because of being the supporting object, it is successively increasing and also because of being associated: all proclivities to be abandoned through the vision of frustration.",
        "source": "T26n1542_004:0707c12_16"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂見集所斷非遍行及見滅道修所斷一切隨眠。",
        "translation": "because of not being the supporting object. “Concomitant with what is subsequently produced and not associated”: The pervasive formations that are to be abandoned by insight into the origin but not by insight into cessation, as well as all procliv",
        "source": "T26n1542_004:0707c13_17"
    },
    {
        "source_sentence": "於彼等起心不相應行見苦所斷一切及見集所斷遍行隨眠，所緣故隨增非相應故；",
        "translation": "All that is to be abandoned by insight into unsatisfactoriness in relation to the formations dissociated from awarenesses that give rise to it, and all pervasive proclivities that are to be abandoned by insight into the origin. Because of being",
        "source": "T26n1542_004:0707c15_18"
    },
    {
        "source_sentence": "諸餘隨眠，於彼非所緣故隨增非相應故。",
        "translation": "The other proclivities are not the objects of consciousness, because they are not conjoined with it.",
        "source": "T26n1542_004:0707c17_0"
    },
    {
        "source_sentence": "於見集所斷邪見，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many false views that are stopped by the view of accumulation are not associated with subsequent increase because they are the objects of latent dormancy, and how many are not associated with subsequent increase because they are not the objects?",
        "source": "T26n1542_004:0707c17_1"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，謂除見集所斷邪見相應無明，諸餘見集所斷一切及見苦所斷遍行隨眠。",
        "translation": "Answer: Because of the supporting object, subsequently increasing and not being associated: exception made for ignorance associated with false view that is to be abandoned through vision of the origin; all other ignorance that is to be abandoned through vision of the origin and pervasive",
        "source": "T26n1542_004:0707c21_2"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，無。",
        "translation": "Because they are conjoined, it follows the increase and is not the perceptual object.",
        "source": "T26n1542_004:0707c23_3"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂見集所斷邪見相應無明。",
        "translation": "“Because of the supporting object, subsequently increasing and also being associated”: The ignorance associated with false view that is to be abandoned by insight into the origin.",
        "source": "T26n1542_004:0707c24_4"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂見苦所斷非遍行，及見滅道修所斷一切隨眠。",
        "translation": "“Concomitant with increase because of not being what is supporting object”: Not pervasive formations to be abandoned through the vision of frustration, and all proclivities to be abandoned through the vision of cessation and through the path of spiritual practice",
        "source": "T26n1542_004:0707c25_5"
    },
    {
        "source_sentence": "於彼相應法，所緣故隨增非相應故者，謂除見集所斷邪見及彼相應無明，",
        "translation": "“Conjoined with these factors”: Because they are the supporting object, and because they are successive and not associated”: Exception made for false view to be abandoned through the vision of the origin and ignorance associated with them.",
        "source": "T26n1542_004:0707c27_6"
    },
    {
        "source_sentence": "諸餘見集所斷一切，及見苦所斷遍行隨眠。",
        "translation": "All the other pervasive proclivities abandoned by insight into the origin are abandoned by insight into the state of arising, and all the universal proclivities abandoned by insight into unsatisfactoriness.",
        "source": "T26n1542_004:0707c28_7"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，無。",
        "translation": "Because they are conjoined, it follows the increase and is not the perceptual object.",
        "source": "T26n1542_004:0707c29_8"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂見集所斷邪見及彼相應無明。",
        "translation": "“Because of being the supporting object, they are successively increasing and also associated”: False view to be abandoned through the vision of the origin and ignorance associated with it.",
        "source": "T26n1542_004:0708a01_9"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂見苦所斷非遍行，及見滅道修所斷一切隨眠。",
        "translation": "“Concomitant with increase because of not being what is supporting object”: Not pervasive formations to be abandoned through the vision of frustration, and all proclivities to be abandoned through the vision of cessation and through the path of spiritual practice",
        "source": "T26n1542_004:0708a02_10"
    },
    {
        "source_sentence": "於彼等起心不相應行見集所斷一切及見苦所斷遍行隨眠，所緣故隨增非相應故；",
        "translation": "All that is to be abandoned through the vision of the origin and pervasive proclivities that are to be abandoned through the vision of unsatisfactoriness arise in relation to these, because they are not associated with each other.",
        "source": "T26n1542_004:0708a04_11"
    },
    {
        "source_sentence": "諸餘隨眠，於彼非所緣故隨增非相應故。",
        "translation": "The other proclivities are not the objects of consciousness, because they are not conjoined with it.",
        "source": "T26n1542_004:0708a06_12"
    },
    {
        "source_sentence": "如見集所斷邪見，見取、疑、貪、瞋、慢亦爾。",
        "translation": "Just as with the false view to be abandoned through the vision of the origin, the same applies to views of grasping, perplexity, greed, hatred and pride.",
        "source": "T26n1542_004:0708a07_13"
    },
    {
        "source_sentence": "於見集所斷無明，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many of the ignorance that is eliminated by insight and accumulation are not associated with subsequent increases because they are the objects of latent defilement, how many are not associated with subsequent increases because they are not objects?",
        "source": "T26n1542_004:0708a08_14"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，謂見集所斷無明，及見苦所斷遍行隨眠。",
        "translation": "Answer: “Because of the supporting object, it follows increase and is not associated”: ignorance to be abandoned through vision of the origin and subsequent dormancy of pervasive formations to be abandoned through vision of frustration.",
        "source": "T26n1542_004:0708a11_15"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，無。",
        "translation": "Because they are conjoined, it follows the increase and is not the perceptual object.",
        "source": "T26n1542_004:0708a13_16"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂除見集所斷無明，諸餘見集所斷一切隨眠。",
        "translation": "“Because of being the supporting object, it follows increase and also is associated”: Exception made for ignorance to be abandoned through vision or through the one of the origin, all other proclivities to be abandoned through vision or through the one of",
        "source": "T26n1542_004:0708a13_17"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂見苦所斷非遍行，及見滅道修所斷一切隨眠。",
        "translation": "“Concomitant with increase because of not being what is supporting object”: Not pervasive formations to be abandoned through the vision of frustration, and all proclivities to be abandoned through the vision of cessation and through the path of spiritual practice",
        "source": "T26n1542_004:0708a15_18"
    },
    {
        "source_sentence": "於彼相應法，所緣故隨增非相應故者，謂見苦所斷遍行隨眠。",
        "translation": "The pervasive proclivities that are to be abandoned through the vision of unsatisfactoriness.",
        "source": "T26n1542_004:0708a17_19"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，無。",
        "translation": "Because they are conjoined, it follows the increase and is not the perceptual object.",
        "source": "T26n1542_004:0708a18_20"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂見集所斷一切隨眠。",
        "translation": "Because of being the supporting object, it is successively increasing and also because of being associated: all proclivities to be abandoned through the vision of the origin.",
        "source": "T26n1542_004:0708a19_21"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂見苦所斷非遍行，及見滅道修所斷一切隨眠。",
        "translation": "“Concomitant with increase because of not being what is supporting object”: Not pervasive formations to be abandoned through the vision of frustration, and all proclivities to be abandoned through the vision of cessation and through the path of spiritual practice",
        "source": "T26n1542_004:0708a20_22"
    },
    {
        "source_sentence": "於彼等起心不相應行見集所斷一切及見苦所斷遍行隨眠，所緣故隨增非相應故；",
        "translation": "All that is to be abandoned through the vision of the origin and pervasive proclivities that are to be abandoned through the vision of unsatisfactoriness arise in relation to these, because they are not associated with each other.",
        "source": "T26n1542_004:0708a22_23"
    },
    {
        "source_sentence": "諸餘隨眠，於彼非所緣故隨增非相應故。",
        "translation": "The other proclivities are not the objects of consciousness, because they are not conjoined with it.",
        "source": "T26n1542_004:0708a24_24"
    },
    {
        "source_sentence": "於見滅所斷邪見，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many false views that are stopped by seeing cessation are not associated with subsequent increase because they are the object of latent defilement and how many are not associated with subsequent increase because they are not the object of latent defilement?",
        "source": "T26n1542_004:0708a25_25"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，謂見滅所斷有漏緣，及遍行隨眠。",
        "translation": "Answer: Because of being the supporting object, it is successively increasing and not conjoined: impure supporting objects that are to be abandoned through the vision of cessation and pervasive accompanying dormancy.",
        "source": "T26n1542_004:0708a28_26"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，謂見滅所斷邪見相應無明。",
        "translation": "“Concomitant because it is not the supporting object”: The ignorance associated with false view, which is to be abandoned through the vision of cessation.",
        "source": "T26n1542_004:0708a29_27"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，無。",
        "translation": "“Because of being the supporting object, it is successive and also associated”: No.",
        "source": "T26n1542_004:0708b02_0"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂除見滅所斷邪見相應無明，諸餘見滅所斷無漏緣，",
        "translation": "“Because of not being the supporting object, it is successively increasing and not being associated”: Exception made for ignorance associated with false view that is to be abandoned through the vision of cessation. The other pure supporting object which is to be",
        "source": "T26n1542_004:0708b02_1"
    },
    {
        "source_sentence": "及見苦集所斷非遍行，并見道修所斷一切隨眠。",
        "translation": "They are the pervasive formations that are to be abandoned by insight into unsatisfactoriness and the non-pervasive formations that are to be abandoned by insight into unsatisfactoriness and all the proclivities that are to be abandoned",
        "source": "T26n1542_004:0708b04_2"
    },
    {
        "source_sentence": "於彼相應法，所緣故隨增非相應故者，謂見滅所斷有漏緣及遍行隨眠。",
        "translation": "“Conjoined factors”: Because of the supporting object, they are successively increasing and not being associated”: The impure supporting objects and pervasive proclivities that are to be abandoned through the vision of cessation.",
        "source": "T26n1542_004:0708b05_3"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，謂見滅所斷邪見及彼相應無明。",
        "translation": "“Because of being associated, it increases successively and is not the supporting object”: False view to be abandoned through the vision of cessation and ignorance associated with them.",
        "source": "T26n1542_004:0708b07_4"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，無。",
        "translation": "“Because of being the supporting object, it is successive and also associated”: No.",
        "source": "T26n1542_004:0708b08_5"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂除見滅所斷邪見，及彼相應無明，諸餘見滅所斷無漏緣，",
        "translation": "exception made for the false view to be abandoned through the vision of cessation, and ignorance associated with it. The other pure supporting object that is to be abandoned through the vision of cessation:",
        "source": "T26n1542_004:0708b09_6"
    },
    {
        "source_sentence": "及見苦集所斷非遍行，并見道修所斷一切隨眠。",
        "translation": "They are the pervasive formations that are to be abandoned by insight into unsatisfactoriness and the non-pervasive formations that are to be abandoned by insight into unsatisfactoriness and all the proclivities that are to be abandoned",
        "source": "T26n1542_004:0708b11_7"
    },
    {
        "source_sentence": "於彼等起心不相應行見滅所斷有漏緣及遍行隨眠，所緣故隨增非相應故；",
        "translation": "The impure condition as supporting object and the universal proclivities that are to be abandoned by insight into cessation of formations dissociated from awarenesses that arise in relation to these, because they are not associated with each other.",
        "source": "T26n1542_004:0708b12_8"
    },
    {
        "source_sentence": "諸餘隨眠，於彼非所緣故隨增非相應故。",
        "translation": "The other proclivities are not the objects of consciousness, because they are not conjoined with it.",
        "source": "T26n1542_004:0708b14_9"
    },
    {
        "source_sentence": "見滅所斷疑亦爾。",
        "translation": "So is the doubt that's stopped by seeing cessation.",
        "source": "T26n1542_004:0708b15_10"
    },
    {
        "source_sentence": "於見滅所斷見取，幾隨眠所緣故隨增非相應故、幾隨眠相應故隨增非所緣故、幾隨眠所緣故隨增亦相應故、幾隨眠非所緣故隨增非相應故？",
        "translation": "How many proclivities are not associated with increase because they are the objects of attachment to views that are abandoned by insight into cessation?",
        "source": "T26n1542_004:0708b15_11"
    },
    {
        "source_sentence": "答：所緣故隨增非相應故者，謂除見滅所斷見取相應無明，諸餘見滅所斷有漏緣，",
        "translation": "Answer: “Because of the supporting object, subsequently increasing and not being associated with it”: Exception made for ignorance associated with taking what is to be abandoned through vision and seeing that is to be abandoned through cessation, the other impure",
        "source": "T26n1542_004:0708b18_12"
    },
    {
        "source_sentence": "及遍行隨眠。",
        "translation": "and pervasive latencies.",
        "source": "T26n1542_004:0708b20_13"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，無。",
        "translation": "Because they are conjoined, it follows the increase and is not the perceptual object.",
        "source": "T26n1542_004:0708b20_14"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂見滅所斷見取相應無明。",
        "translation": "“Because of being the supporting object, successively increasing and also being associated”: The ignorance associated with grasping by vision that is to be abandoned through the vision of cessation.",
        "source": "T26n1542_004:0708b21_15"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂見滅所斷無漏緣，及見苦集所斷非遍行，",
        "translation": "“Because of not being the supporting object, it follows increase and is not associated”: The pure supporting object to be abandoned through the vision of cessation and the pervasive one to be abandoned through the vision of frustration and through the one",
        "source": "T26n1542_004:0708b22_16"
    },
    {
        "source_sentence": "并見道修所斷一切隨眠。",
        "translation": "They also see all the latent tendencies that are stopped by cultivating the path.",
        "source": "T26n1542_004:0708b24_17"
    },
    {
        "source_sentence": "於彼相應法，所緣故隨增非相應故者，謂除見滅所斷見取及彼相應無明，",
        "translation": "“Conjoined with these factors”: Because of the supporting object, they are successively increased and not conjoined”: Exception made for ignorance abandoned through the vision of cessation by the vision of the view that grasping is to be",
        "source": "T26n1542_004:0708b25_18"
    },
    {
        "source_sentence": "諸餘見滅所斷有漏緣及遍行隨眠。",
        "translation": "The remaining contaminants that are stopped by seeing cessation and the pervasive latencies that are the causes of the afflictions.",
        "source": "T26n1542_004:0708b26_19"
    },
    {
        "source_sentence": "相應故隨增非所緣故者，無。",
        "translation": "Because they are conjoined, it follows the increase and is not the perceptual object.",
        "source": "T26n1542_004:0708b27_20"
    },
    {
        "source_sentence": "所緣故隨增亦相應故者，謂見滅所斷見取及彼相應無明。",
        "translation": "“Because of being the supporting object, they are successively increasing and also associated”: The one who is to be abandoned through the vision of cessation means that ignorance which is to be abandoned through the vision of the view-attainer and",
        "source": "T26n1542_004:0708b28_21"
    },
    {
        "source_sentence": "非所緣故隨增非相應故者，謂見滅所斷無漏緣，及見苦集所斷非遍行，",
        "translation": "“Because of not being the supporting object, it follows increase and is not associated”: The pure supporting object to be abandoned through the vision of cessation and the pervasive one to be abandoned through the vision of frustration and through the one",
        "source": "T26n1542_004:0708b29_22"
    },
    {
        "source_sentence": "并見道修所斷一切隨眠。",
        "translation": "They also see all the latent tendencies that are stopped by cultivating the path.",
        "source": "T26n1542_004:0708c02_23"
    },
    {
        "source_sentence": "於彼等起心不相應行見滅所斷有漏緣及遍行隨眠，所緣故隨增非相應故；",
        "translation": "The impure condition as supporting object and the universal proclivities that are to be abandoned by insight into cessation of formations dissociated from awarenesses that arise in relation to these, because they are not associated with each other.",
        "source": "T26n1542_004:0708c02_24"
    },
    {
        "source_sentence": "諸餘隨眠，於彼非所緣故隨增非相應故。",
        "translation": "The other proclivities are not the objects of consciousness, because they are not conjoined with it.",
        "source": "T26n1542_004:0708c04_25"
    },
    {
        "source_sentence": "見滅所斷貪、瞋、慢亦爾。",
        "translation": "So it is with craving, anger, and conceit that are stopped by seeing cessation.",
        "source": "T26n1542_004:0708c05_26"
    },
    {
        "source_sentence": "說一切有部品類足論卷第四",
        "translation": "Saṃyuktâgama-śāstra, vol. 4",
        "source": "T26n1542_004:0708c07_0"
    }
]