[
    {
        "source_sentence": "十地經論初歡喜地卷之三",
        "translation": "Daśabhūmika-sūtra Treatise on the First Delightful Land of the Ten Stages, Volume 3",
        "source": "T26n1522_003:0138a25_0"
    },
    {
        "source_sentence": "天親菩薩造",
        "translation": "created by gods and bodhisattvas",
        "source": "T26n1522_003:0138a27_0"
    },
    {
        "source_sentence": "後魏北印度三藏菩提流支譯",
        "translation": "Latter Wei translation of the Northern India Tripiṭaka, translated by Bodhiruci",
        "source": "T26n1522_003:0138a28_0"
    },
    {
        "source_sentence": "論曰：已顯說分，次說挍量勝分。",
        "translation": "The parts of the Abhidharma have been spoken of. Next, we shall speak of the coarse and the superior parts.",
        "source": "T26n1522_003:0138a29_0"
    },
    {
        "source_sentence": "云何挍量勝？",
        "translation": "What's the superiority of debilitating measurement?",
        "source": "T26n1522_003:0138a29_1"
    },
    {
        "source_sentence": "菩薩住此地中，勝聲聞、辟支佛故。",
        "translation": "Because the bodhisattvas who live in this place are superior to śrāvakas and pratyekabuddhas.",
        "source": "T26n1522_003:0138b01_2"
    },
    {
        "source_sentence": "挍量勝有三種：一、願勝；",
        "translation": "4.5.29 There are three kinds of superiority in terms of grossness:",
        "source": "T26n1522_003:0138b01_3"
    },
    {
        "source_sentence": "二、修行勝；",
        "translation": "The second is the superiority of practice.",
        "source": "T26n1522_003:0138b02_4"
    },
    {
        "source_sentence": "三、果利益勝。",
        "translation": "3. the superiority of the benefits of fruition.",
        "source": "T26n1522_003:0138b02_5"
    },
    {
        "source_sentence": "何者願勝？",
        "translation": "What's superior to the vow?",
        "source": "T26n1522_003:0138b03_0"
    },
    {
        "source_sentence": "所謂十大願。",
        "translation": "It's called the ten great vows.",
        "source": "T26n1522_003:0138b03_1"
    },
    {
        "source_sentence": "經曰：菩薩如是安住菩薩歡喜地，發諸大願，起如是大方便，如是大行成就。",
        "translation": "The sūtra says, Thus do bodhisattvas abide in the bodhisattva's joyful stage, make great vows, give rise to such great skillful means, and thus accomplish such great actions.",
        "source": "T26n1522_003:0138b04_0"
    },
    {
        "source_sentence": "所謂無餘一切諸佛一切供養一切恭敬故，一切種具足，上深信清淨，廣大如法界，究竟如虛空，盡未來際，盡一切劫數一切佛成道數，大供養恭敬無有休息。",
        "translation": "It's because all the buddhas without remainder offer all kinds of offerings and respect to all kinds of people, are fully endowed with all kinds, have profound faith in purity, are as vast as the Dharma realm, are ultimately like space, will continue throughout all future eons, fulfill the number of times all buddhas attain enlightenment, and greatly offer support and respect without cease.",
        "source": "T26n1522_003:0138b05_1"
    },
    {
        "source_sentence": "論曰：是初大願，無餘者有三種：一者一切佛無餘；",
        "translation": "There are three kinds of the first great vow, which is without remainder:",
        "source": "T26n1522_003:0138b10_0"
    },
    {
        "source_sentence": "二者一切供養無餘；",
        "translation": "The second is that all offerings are without remainder.",
        "source": "T26n1522_003:0138b11_1"
    },
    {
        "source_sentence": "三者一切恭敬無餘。",
        "translation": "Three, all respect and reverence without remainder.",
        "source": "T26n1522_003:0138b11_2"
    },
    {
        "source_sentence": "一切佛者有三種佛：一、應身佛；",
        "translation": "All buddhas are three kinds of buddhas:",
        "source": "T26n1522_003:0138b12_3"
    },
    {
        "source_sentence": "二、報身佛；",
        "translation": "The second is the buddha of the body as retribution.",
        "source": "T26n1522_003:0138b12_4"
    },
    {
        "source_sentence": "三、法身佛。",
        "translation": "3. the Dharma body buddha.",
        "source": "T26n1522_003:0138b13_0"
    },
    {
        "source_sentence": "一切供養者，有三種供養：一者利養供養，謂衣服臥具等；",
        "translation": "“All offerings”: There are three kinds of offerings:",
        "source": "T26n1522_003:0138b13_1"
    },
    {
        "source_sentence": "二者恭敬供養，謂香花幡蓋等；",
        "translation": "The second is reverence and offerings, that is, incense, flowers, streamers, banners, canopies, and so on.",
        "source": "T26n1522_003:0138b14_2"
    },
    {
        "source_sentence": "三者行供養，謂修行信戒行等。",
        "translation": "The third is the practice of making offerings, which are cultivating faith, morality, and so forth.",
        "source": "T26n1522_003:0138b15_3"
    },
    {
        "source_sentence": "一切恭敬者，有三種恭敬：一、給侍恭敬；",
        "translation": "All kinds of reverence: there are three kinds of reverence:",
        "source": "T26n1522_003:0138b16_0"
    },
    {
        "source_sentence": "二、迎送恭敬；",
        "translation": "The second is to receive and greet with reverence.",
        "source": "T26n1522_003:0138b16_1"
    },
    {
        "source_sentence": "三、修行恭敬。",
        "translation": "3. respectfulness of cultivation.",
        "source": "T26n1522_003:0138b17_2"
    },
    {
        "source_sentence": "是故作願供養恭敬，如經「所謂無餘一切諸佛一切供養一切恭敬」故。",
        "translation": "That's why they make a vow to offer support and respect, as the sūtra says, All the other buddhas give all kinds of offerings and all kinds of respect.",
        "source": "T26n1522_003:0138b17_3"
    },
    {
        "source_sentence": "一切種具足者，無量種種，復有勝事等供養故。",
        "translation": "“All kinds are supplied”: Because they are unlimited and manifold, there are also such extraordinary things as offerings.",
        "source": "T26n1522_003:0138b19_4"
    },
    {
        "source_sentence": "上深信清淨者，增上敬重故，願迴向菩提決定信故。",
        "translation": "The higher profound faith is pure because it's superior in respect and the vow to dedicate oneself back to enlightenment is based on certain faith.",
        "source": "T26n1522_003:0138b20_5"
    },
    {
        "source_sentence": "廣大如法界者，一切餘善根中勝故。",
        "translation": "“It is as vast as the element of factors”: Because it is superior to all other roots of merit.",
        "source": "T26n1522_003:0138b21_6"
    },
    {
        "source_sentence": "究竟如虛空者，無常愛果無量因故。",
        "translation": "“The ultimate is as space”: Because the fruit of craving for impermanence is an immeasurable cause.",
        "source": "T26n1522_003:0138b22_7"
    },
    {
        "source_sentence": "盡未來際者，此因得涅槃常果故。",
        "translation": "The unlimited future: because this cause acquires the eternal fruit of nirvana.",
        "source": "T26n1522_003:0138b23_8"
    },
    {
        "source_sentence": "一切劫數一切佛成道數，大供養恭敬無有休息故。",
        "translation": "It's the number of all eons and the number of all buddhas who attain enlightenment, which are greatly honored and respected without resting.",
        "source": "T26n1522_003:0138b24_9"
    },
    {
        "source_sentence": "此初願中有六種大，名為大願：一者福田大，如經「所謂無餘一切諸佛一切供養一切恭敬」故。",
        "translation": "In this first vow, there are six kinds of great vows that are called great vows: one, the great field of merit, as described in the sūtra, All the offerings and respects of all the buddhas without remainder.",
        "source": "T26n1522_003:0138b25_10"
    },
    {
        "source_sentence": "二者供事大，如經「一切種具足」故。",
        "translation": "The second is great in terms of offerings, as the sūtra says, All kinds are complete.",
        "source": "T26n1522_003:0138b27_11"
    },
    {
        "source_sentence": "三者心大，如經「上深信清淨」故。",
        "translation": "Third, the mind is great because it's as explained in the sūtra, The higher profound faith is pure.",
        "source": "T26n1522_003:0138b28_12"
    },
    {
        "source_sentence": "四者攝功德大，如經「廣大如法界」故。",
        "translation": "The fourth is to gather great merit, as the sūtra says, vast as the Dharma realm.",
        "source": "T26n1522_003:0138b28_13"
    },
    {
        "source_sentence": "五者因大，如經「究竟如虛空」故。",
        "translation": "The fifth is the cause of greatness, as the sūtra says, Ultimately like space.",
        "source": "T26n1522_003:0138b29_14"
    },
    {
        "source_sentence": "六者時大，如經「盡未來際」故。",
        "translation": "Sixth, the time is great because it's like the sūtra, Up to the end of the future.",
        "source": "T26n1522_003:0138c01_15"
    },
    {
        "source_sentence": "經曰：又發大願，所謂一切諸佛所說法輪皆悉受持故，攝受一切佛菩提故，一切諸佛所教化法皆悉守護故，廣大如法界，究竟如虛空，盡未來際盡一切劫數一切佛成道數，攝護正法無有休息。",
        "translation": "The sūtra says, Again, he gives rise to the great vow, which is to say that all the wheels of teaching taught by all the buddhas are fully accepted and upheld, that they collect the enlightenment of all buddhas, that all the teachings taught by all buddhas are fully guarded, that they are vast as the Dharma realm, ultimately as vast as space, that they will embrace the right",
        "source": "T26n1522_003:0138c03_0"
    },
    {
        "source_sentence": "論曰：第二大願有三種法：一切諸佛所說法輪皆悉受持者，謂教法修多羅等，書寫供養讀誦受持為他演說故。",
        "translation": "The second great vow has three kinds of dharmas: accepting and upholding all the wheels of doctrine taught by all the buddhas, that is to say, teaching the Dharma sūtra, etc., by writing, making offerings, reciting, memorizing, and expounding it for others.",
        "source": "T26n1522_003:0138c08_0"
    },
    {
        "source_sentence": "攝受一切佛菩提者，所謂證法，證三種佛菩提法，攝受此證法教化轉授故。",
        "translation": "He who collects the enlightenment of all buddhas refers to the realization of the Dharma, which is the realization of the three kinds of Buddha-bodhi teachings, because he collects these realizations and teaches them.",
        "source": "T26n1522_003:0138c10_1"
    },
    {
        "source_sentence": "一切諸佛所教化法皆悉守護者，謂修行法，於修行時有諸障難攝護救濟故。",
        "translation": "All the teachings taught by all buddhas are fully guarded because there are hindrances that make it difficult to collect, protect, and rescue them when they practice.",
        "source": "T26n1522_003:0138c12_2"
    },
    {
        "source_sentence": "復名三種成就：一者於諸佛所說修多羅等阿含次第令法輪不斷成就故；",
        "translation": "“They are further also called three kinds of accomplishment. The first is to cause the unceasing accomplishment of the wheel of teaching in succession to the scriptures taught by the Buddhas:",
        "source": "T26n1522_003:0138c14_3"
    },
    {
        "source_sentence": "二者證三種正覺得證成就故；",
        "translation": "The second is to realize the accomplishment of realization of the three kinds of right awakening.",
        "source": "T26n1522_003:0138c15_4"
    },
    {
        "source_sentence": "三者修行乃至如實修行正覺成就故，是名三種成就。",
        "translation": "The third is the accomplishment of cultivation, up to the accomplishment of truly cultivating right awakening, which are called the three kinds of accomplishment.",
        "source": "T26n1522_003:0138c16_5"
    },
    {
        "source_sentence": "三種佛菩提者，聲聞、辟支佛亦名為佛故。",
        "translation": "The enlightenment of the three kinds of buddhas is because śrāvakas and pratyekabuddhas are also called buddhas.",
        "source": "T26n1522_003:0138c17_6"
    },
    {
        "source_sentence": "經曰：又發大願，所謂一切成佛無餘一切世界住處從兜率天來下，入胎及在胎中，初生時、出家時、成佛道時、請轉法輪時、示入大涅槃，我於爾時盡往供養，攝法為首，一切處一時成一時轉故。",
        "translation": "The sūtra says, Again, he gives rise to the great vow that all become buddhas without exception in all the worlds where sentient beings live and descend from the Tuṣita Heaven into the womb or within the womb, when they are first born, leave home, at the time of their attainment of buddhahood, ask for the turning of the wheel of the Dharma, and show them entry into great nirvāṇa",
        "source": "T26n1522_003:0138c19_0"
    },
    {
        "source_sentence": "廣大如法界，究竟如虛空，盡未來際盡一切劫數一切佛成道數，盡往攝法無有休息。",
        "translation": "It is as vast as the cosmos of reality, as vast as space, as numerous as all buddhas who will attain enlightenment in all future ages, and as numerous as all past and future collected teachings.",
        "source": "T26n1522_003:0138c23_1"
    },
    {
        "source_sentence": "論曰：第三大願。",
        "translation": "The third is the great vow.",
        "source": "T26n1522_003:0138c26_0"
    },
    {
        "source_sentence": "一切成佛無餘一切世界住處者，一切應佛無邊遍滿一切世界住處故。",
        "translation": "All become buddhas without remainder, all worlds and dwelling places: because all the boundless Buddhas of response fill all worlds and dwelling places.",
        "source": "T26n1522_003:0138c26_1"
    },
    {
        "source_sentence": "隨何等世界諸佛住處，應感相順眾生見故。",
        "translation": "Whatever worlds the buddhas live in, they're supposed to cause sentient beings to follow their views.",
        "source": "T26n1522_003:0138c28_0"
    },
    {
        "source_sentence": "從兜率天來下乃至示入大涅槃，我於爾時盡往供養，攝法為首者，隨彼眾生供養佛方便，以如來所說攝法方便，集功德智慧助菩提法故。",
        "translation": "Those who come down from the Tuṣita Heaven and show their entry into great nirvāṇa, I'll make offerings to them all at that point, with the method of gathering the Dharma as the first, following the skillful means of those sentient beings making offerings to the Buddha because the Tathāgata teaches the method of gathering the Dharma by accumulating merit and wisdom that aids enlightenment.",
        "source": "T26n1522_003:0138c29_0"
    },
    {
        "source_sentence": "一切處一時成一時轉者，示非前後故。",
        "translation": "The simultaneous formation and the simultaneous proceeding of all places are indicated because they are not prior or subsequent.",
        "source": "T26n1522_003:0139a03_1"
    },
    {
        "source_sentence": "何故示現彼處住不在色、無色處？",
        "translation": "Why does it show that they abide there and aren't in the form or formless realms?",
        "source": "T26n1522_003:0139a04_2"
    },
    {
        "source_sentence": "此難處來不為我故，起於輕心不生恭敬，為遮此等故。",
        "translation": "This difficulty comes because they don't come for the sake of self, and they give rise to despise and disrespectfulness in order to obscure them.",
        "source": "T26n1522_003:0139a05_3"
    },
    {
        "source_sentence": "何故不住他化自在天等？",
        "translation": "Why doesn't it abide in the other-transformed unimpeded heavens and so forth?",
        "source": "T26n1522_003:0139a06_4"
    },
    {
        "source_sentence": "如來有力能勝處生，捨而不生，為念眾生故來生兜率。",
        "translation": "The Tathāgata is powerful and capable of being born in a superior place, but he abandons it and doesn't give it up; he comes to be born in Tuṣita for the sake of sentient beings.",
        "source": "T26n1522_003:0139a07_0"
    },
    {
        "source_sentence": "如是生大恭敬心故。",
        "translation": "It's because they thus give rise to great respect.",
        "source": "T26n1522_003:0139a08_1"
    },
    {
        "source_sentence": "何故人中捨上天樂？",
        "translation": "Why is it that among humans they abandon heavenly bliss?",
        "source": "T26n1522_003:0139a08_2"
    },
    {
        "source_sentence": "愍我等故來生人中，生增上敬重心故。",
        "translation": "It's because they pity us and come to be born among humans because they give rise to an increasingly respectful mind.",
        "source": "T26n1522_003:0139a09_3"
    },
    {
        "source_sentence": "何故處胎？",
        "translation": "Why does it abide in the womb?",
        "source": "T26n1522_003:0139a10_4"
    },
    {
        "source_sentence": "示現同生增長力故。",
        "translation": "It's because it shows the power of the growth of sameness in birth.",
        "source": "T26n1522_003:0139a10_5"
    },
    {
        "source_sentence": "何故自成正覺？",
        "translation": "Why do they themselves become perfectly enlightened?",
        "source": "T26n1522_003:0139a11_0"
    },
    {
        "source_sentence": "示非餘佛教化，現丈夫力成就，非因他得菩提故。",
        "translation": "It shows that it's not other than the Buddha's teaching, which is accomplished by the power of presenting a man, not because he attains enlightenment because of others.",
        "source": "T26n1522_003:0139a11_1"
    },
    {
        "source_sentence": "何故示入大涅槃？",
        "translation": "Why does it show entry into great nirvāṇa?",
        "source": "T26n1522_003:0139a12_2"
    },
    {
        "source_sentence": "為令懈怠眾生勤心修道故。",
        "translation": "It's because it causes lazy sentient beings to diligently cultivate their minds.",
        "source": "T26n1522_003:0139a13_0"
    },
    {
        "source_sentence": "經曰：又發大願，所謂一切菩薩所行廣大無量不雜諸波羅蜜所攝，諸地所淨生諸助道法，總相、別相、同相、異相、成相、壞相，說一切菩薩所行如實地道及諸波羅蜜方便業，教化一切令其受行心得增長故。",
        "translation": "The sūtra says, Again, he gives rise to the great vow that all the bodhisattva's practices are vast and immeasurable without mixing with the perfections, that the factors that purify the path that arise in the stages, such as general characteristics, distinctive characteristics, similar characteristics, dissimilar characteristics, formed characteristics, and disintegrating characteristic",
        "source": "T26n1522_003:0139a14_0"
    },
    {
        "source_sentence": "廣大如法界究竟如虛空，盡未來際盡一切劫數行數增長無有休息。",
        "translation": "It's as vast as the realm of reality and ultimately like space, and it grows repeatedly for all eons throughout the future without cease.",
        "source": "T26n1522_003:0139a18_1"
    },
    {
        "source_sentence": "論曰：第四大願心得增長者，以何等行令心增長？",
        "translation": "Discourse: The fourth great vow is to cause the mind to grow, and what actions will cause the mind to grow?",
        "source": "T26n1522_003:0139a21_0"
    },
    {
        "source_sentence": "一切菩薩所行教化，一切令其受行，心得增長故。",
        "translation": "All the practices of all bodhisattvas are taught and transformed, and all cause their minds to grow in accepting and practicing them.",
        "source": "T26n1522_003:0139a22_1"
    },
    {
        "source_sentence": "彼菩薩行有四種：一種種；",
        "translation": "The practice of enlightening beings is of four kinds:",
        "source": "T26n1522_003:0139a23_2"
    },
    {
        "source_sentence": "二體；",
        "translation": "The second is the essence.",
        "source": "T26n1522_003:0139a23_3"
    },
    {
        "source_sentence": "三業；",
        "translation": "These are the three kinds of karma.",
        "source": "T26n1522_003:0139a24_4"
    },
    {
        "source_sentence": "四方便。",
        "translation": "The fourth is skillful means.",
        "source": "T26n1522_003:0139a24_5"
    },
    {
        "source_sentence": "以此四種教化令其受行。",
        "translation": "These are the four kinds of teaching that cause them to receive and practice.",
        "source": "T26n1522_003:0139a24_6"
    },
    {
        "source_sentence": "何者是菩薩行？",
        "translation": "What's the bodhisattva practice?",
        "source": "T26n1522_003:0139a25_0"
    },
    {
        "source_sentence": "種種世間行有三種：廣者，從初地乃至六地；",
        "translation": "There are three kinds of various worldly formations:",
        "source": "T26n1522_003:0139a25_1"
    },
    {
        "source_sentence": "大者，七地；",
        "translation": "The great one is seven stages:",
        "source": "T26n1522_003:0139a26_2"
    },
    {
        "source_sentence": "無量者，從八地乃至十地。",
        "translation": "“Countless”: From the eighth stage up to the tenth stage.",
        "source": "T26n1522_003:0139a26_3"
    },
    {
        "source_sentence": "不雜者，法無我平等觀，出世間智故，如經「一切菩薩所行廣大無量不雜」故。",
        "translation": "The unadulterated refers to the equal contemplation of selflessness of dharmas because it's based on transmundane cognition, just as the sūtra says, All bodhisattva practices are vast and immeasurable without mixture.",
        "source": "T26n1522_003:0139a27_4"
    },
    {
        "source_sentence": "體者，如經「諸波羅蜜所攝」故。",
        "translation": "The essence is because it's like the sūtra, What's included in the perfections.",
        "source": "T26n1522_003:0139a28_5"
    },
    {
        "source_sentence": "業者，如經「諸地所淨生諸助道法」故。",
        "translation": "Karma, as the sūtra says, The factors that are purely produced by the stages and assist in the path.",
        "source": "T26n1522_003:0139a29_6"
    },
    {
        "source_sentence": "方便者，如經「總相、別相、同相、異相、成相、壞相」故，「說一切菩薩所行如實地道及諸波羅蜜方便業」故。",
        "translation": "The method is because the sūtra says, General characteristics, distinctive characteristics, similar characteristics, dissimilar characteristics, formed characteristics, and decaying characteristics explain all the bodhisattva's practices of the path to the true ground and the skillful actions of the perfections.",
        "source": "T26n1522_003:0139b01_7"
    },
    {
        "source_sentence": "經曰：又發大願，所謂無餘一切眾生界，有色無色、有想無想、非無想非想非非想，卵生、胎生、濕生、化生，三界所繫雜入六道，一切生處名色所攝，為教化成就一切眾生界令信入諸佛法故、斷一切世間數道故、令住一切智智處故。",
        "translation": "The sūtra says, Again, he gives rise to the great vow that all sentient beings without remainder are in the realm of form and formlessness, with perception and non-perception, not without perception, neither perception nor non-perception, birth from an egg, birth from a womb, birth from moisture, birth through transformation, birth tethered by the three realms, entry into the six",
        "source": "T26n1522_003:0139b04_0"
    },
    {
        "source_sentence": "廣大如法界究竟如虛空，盡未來際盡一切劫數一切眾生界數，教化一切眾生無有休息。",
        "translation": "They are as vast as the cosmos of reality, ultimately as vast as space; throughout all ages and all realms of sentient beings, they never cease in teaching and edifying all sentient beings.",
        "source": "T26n1522_003:0139b09_1"
    },
    {
        "source_sentence": "論曰：第五大願教化眾生故。",
        "translation": "It's because the fifth great vow teaches sentient beings.",
        "source": "T26n1522_003:0139b12_0"
    },
    {
        "source_sentence": "何者是眾生？",
        "translation": "What are sentient beings?",
        "source": "T26n1522_003:0139b12_1"
    },
    {
        "source_sentence": "為何義故化一切眾生有六種差別：一、麁細差別；",
        "translation": "What is the reason why there are six kinds of distinctions in teaching all sentient beings?",
        "source": "T26n1522_003:0139b13_0"
    },
    {
        "source_sentence": "二、生依止差別；",
        "translation": "The second is the distinction in the supports that arise.",
        "source": "T26n1522_003:0139b14_1"
    },
    {
        "source_sentence": "三、不淨淨處差別；",
        "translation": "The third is the distinction between impurity and purity.",
        "source": "T26n1522_003:0139b14_2"
    },
    {
        "source_sentence": "四、苦樂差別；",
        "translation": "The fourth is the distinction between suffering and pleasure.",
        "source": "T26n1522_003:0139b14_3"
    },
    {
        "source_sentence": "五、自業差別；",
        "translation": "The fifth is the distinction in one’s own karma.",
        "source": "T26n1522_003:0139b15_4"
    },
    {
        "source_sentence": "六、自體差別。",
        "translation": "6. distinctions in their own essence.",
        "source": "T26n1522_003:0139b15_5"
    },
    {
        "source_sentence": "何者麁細差別？",
        "translation": "What's the distinction between gross and subtle?",
        "source": "T26n1522_003:0139b15_6"
    },
    {
        "source_sentence": "麁者有色，細者無色。",
        "translation": "The coarse one has form and the fine one is formless.",
        "source": "T26n1522_003:0139b16_7"
    },
    {
        "source_sentence": "色中麁者有想，細者無想。",
        "translation": "The coarse one in matter has conceptual identification; the fine one is without conceptual identification.",
        "source": "T26n1522_003:0139b16_8"
    },
    {
        "source_sentence": "無色中麁者非無想，細者非想非非想。",
        "translation": "The coarse one in the immaterial ones is not without conceptual identification, and the fine one is neither conceptual identification nor non-conception.",
        "source": "T26n1522_003:0139b17_9"
    },
    {
        "source_sentence": "是名麁細差別。",
        "translation": "This is called the distinction between crude and subtle.",
        "source": "T26n1522_003:0139b18_10"
    },
    {
        "source_sentence": "如經「有色無色、有想無想、非無想非想非非想」故。",
        "translation": "As the sūtra says, There's form and formlessness, there's perception and perception without perception, and there's neither perception nor perception without perception nor perception without perception.",
        "source": "T26n1522_003:0139b18_11"
    },
    {
        "source_sentence": "生依止差別者，如經「卵生、胎生、濕生、化生」故。",
        "translation": "The distinction in the basis of birth is as explained in the sūtra, Birth from an egg, birth from a womb, birth from moisture, and birth through transformation.",
        "source": "T26n1522_003:0139b19_12"
    },
    {
        "source_sentence": "化生者云何依止？",
        "translation": "What's the basis for those who are born by transformation?",
        "source": "T26n1522_003:0139b20_13"
    },
    {
        "source_sentence": "依止業生故。",
        "translation": "It's because karma arises based on karmic reliance.",
        "source": "T26n1522_003:0139b20_14"
    },
    {
        "source_sentence": "不淨淨處差別者，如經「三界所繫」故。",
        "translation": "The distinction between impure and pure places is because the sūtra says, Bound by the three realms.",
        "source": "T26n1522_003:0139b21_15"
    },
    {
        "source_sentence": "苦樂差別者，種種身故，如經「雜入六道」故。",
        "translation": "The distinction between pain and pleasure is because of various bodies, as the sūtra says, They enter the six destinies together.",
        "source": "T26n1522_003:0139b22_16"
    },
    {
        "source_sentence": "自業差別者，如經「一切生處」故。",
        "translation": "The distinction between self-karma is as explained in the sūtra, All places of birth.",
        "source": "T26n1522_003:0139b23_17"
    },
    {
        "source_sentence": "自體差別者，如經「名色所攝」故。",
        "translation": "The distinction in essence is as explained in the sūtra, What's included in name-and-form.",
        "source": "T26n1522_003:0139b23_18"
    },
    {
        "source_sentence": "是名眾生。",
        "translation": "These are called sentient beings.",
        "source": "T26n1522_003:0139b24_19"
    },
    {
        "source_sentence": "為何義化者，為三義故：一者為信入諸佛所說法中，如經「為教化成就一切眾生界，令信入諸佛法」故。",
        "translation": "What's the meaning of transformation? It's because of three meanings: first, it's to believe and enter the teachings taught by the buddhas, as the sūtra says, In order to teach and accomplish all sentient beings in the realm of sentient beings so that they will believe and enter the Buddha's teachings.",
        "source": "T26n1522_003:0139b24_20"
    },
    {
        "source_sentence": "二者已入佛法中，令入二乘菩提故，如「經斷一切世間數道」故。",
        "translation": "Second, it's because they've entered the Buddha's teaching and caused them to enter the enlightenment of the two-vehicle bodhisattvas, just as the sūtra says, Cutting off all worldly paths.",
        "source": "T26n1522_003:0139b27_21"
    },
    {
        "source_sentence": "三者已入二乘菩提，令入無上菩提故，如經「令住一切智智處」故。",
        "translation": "Third, it's because they've entered the enlightenment of the two vehicles and caused them to enter unsurpassed enlightenment, as the sūtra says, Enabling them to abide in the abode of omniscience.",
        "source": "T26n1522_003:0139b28_22"
    },
    {
        "source_sentence": "經曰：又發大願，所謂無餘一切世界廣大無量麁細亂住、倒住正住，如帝網差別，十方世界無量差別入皆現前知故。",
        "translation": "The sūtra says, Again, he gives rise to the great vow that all the remaining worlds are vast and immeasurable in terms of crude, subtle, confusing, mistaken, and correctly abiding, just like the distinctions in Indra's net, because the countless different entry into all the worlds in the ten directions will be known.",
        "source": "T26n1522_003:0139c02_0"
    },
    {
        "source_sentence": "廣大如法界究竟如虛空，盡未來際盡一切劫數一切世界數，信入無有休息。",
        "translation": "Vast as the cosmos of reality, ultimately spacelike, they believe and enter without cease throughout all ages, throughout all worlds.",
        "source": "T26n1522_003:0139c04_1"
    },
    {
        "source_sentence": "論曰：第六大願，無餘一切世界者有三種相，隨入如是世界，智皆現前知：一者一切相；",
        "translation": "The sixth great vow is that all worlds without remainder have three kinds of characteristics. When one enters a world like this, knowledge appears to know:",
        "source": "T26n1522_003:0139c07_0"
    },
    {
        "source_sentence": "二者真實義相；",
        "translation": "The second is the characteristic of true meaning.",
        "source": "T26n1522_003:0139c08_1"
    },
    {
        "source_sentence": "三者無量相。",
        "translation": "Three, immeasurable characteristics.",
        "source": "T26n1522_003:0139c09_2"
    },
    {
        "source_sentence": "一切相者，如經「廣大無量乃至正住」故。",
        "translation": "All characteristics are as explained in the sūtra, Vast and immeasurable up to right abode.",
        "source": "T26n1522_003:0139c09_3"
    },
    {
        "source_sentence": "廣大無量者，一千世界二千世界三千世界故。",
        "translation": "The vast and immeasurable is because there are 1,000 worlds, 2,000 worlds, and 3,000 worlds.",
        "source": "T26n1522_003:0139c10_4"
    },
    {
        "source_sentence": "細者，隨何等世界意識身故。",
        "translation": "The subtle one is because it follows the body of consciousness of the mind in any world.",
        "source": "T26n1522_003:0139c11_5"
    },
    {
        "source_sentence": "麁者，隨何等世界意色身故。",
        "translation": "What's crude is because it follows the mind and form body of which world?",
        "source": "T26n1522_003:0139c12_6"
    },
    {
        "source_sentence": "亂住者，非次第住故。",
        "translation": "Those who abide in disorder are not those who abide in order.",
        "source": "T26n1522_003:0139c12_7"
    },
    {
        "source_sentence": "倒住者，不造舍宅住故。",
        "translation": "A person who lives in error doesn't build a house or dwelling to live in.",
        "source": "T26n1522_003:0139c13_8"
    },
    {
        "source_sentence": "正住者，造舍宅住故。",
        "translation": "Those who correctly live are those who build dwellings and homes to live in.",
        "source": "T26n1522_003:0139c13_9"
    },
    {
        "source_sentence": "是名一切相。",
        "translation": "These are called all marks.",
        "source": "T26n1522_003:0139c14_10"
    },
    {
        "source_sentence": "如帝網差別者，真實義相故，如業幻作故。",
        "translation": "Differences like the emperor's net are real because of their meaning and characteristics, like actions that are illusoryly created.",
        "source": "T26n1522_003:0139c14_11"
    },
    {
        "source_sentence": "無量相者，十方世界無量差別入故，無量相故。",
        "translation": "“Innumerable characteristic marks”: Because the worlds of the ten directions are with unlimited differentiating sense-fields:",
        "source": "T26n1522_003:0139c15_12"
    },
    {
        "source_sentence": "真實義相者，唯智能知。",
        "translation": "The characteristic of true and real meaning is only known by intelligence.",
        "source": "T26n1522_003:0139c16_13"
    },
    {
        "source_sentence": "餘相者，可現見故。",
        "translation": "The other characteristic marks are because they can be seen in the present.",
        "source": "T26n1522_003:0139c17_14"
    },
    {
        "source_sentence": "經曰：又發大願，所謂一切佛土一佛土、一佛土一切佛土，一切國土平等清淨，一切佛土神通莊嚴光相具足，離一切煩惱成就清淨道，有無量智慧眾生悉滿其中，入佛上妙平等境界故，隨諸眾生心之所樂而為示現故。",
        "translation": "The sūtra says, Again, he gives rise to the great vow that all buddha-lands, one Buddha land, all buddha-lands, all buddha-lands, all lands equally pure, all buddha-lands adorned with mystical powers and characteristics endowed with radiance, free of all afflictions, accomplishing the pure path of purity, having measureless wisdom in which sentient beings",
        "source": "T26n1522_003:0139c18_0"
    },
    {
        "source_sentence": "廣大如法界究竟如虛空，盡未來際盡一切劫數佛國土數，清淨一切佛土無有休息。",
        "translation": "It's as vast as the realm of reality, ultimately as vast as space, counting all eons and buddha-lands throughout the future, purifying all buddha-lands without cease.",
        "source": "T26n1522_003:0139c23_1"
    },
    {
        "source_sentence": "論曰：第七大願淨佛國土相有七種：一者同體淨，如經「一切佛土一佛土、一佛土一切佛土」故。",
        "translation": "The treatise says, There are seven kinds of characteristics of the seventh great vow to purify the Buddha's land: 1. purity of sameness in essence, as explained in the sūtra, All buddha lands are one buddha land for all buddha lands and one buddha land for all buddha lands.",
        "source": "T26n1522_003:0139c26_0"
    },
    {
        "source_sentence": "二者自在淨，如經「一切國土平等清淨」故。",
        "translation": "The second is self-contained purity, as the sūtra says, All lands are equally pure.",
        "source": "T26n1522_003:0139c28_1"
    },
    {
        "source_sentence": "三者莊嚴淨，如經「一切佛土神通莊嚴光相具足」故，光明莊嚴眾寶等莊嚴故。",
        "translation": "The third is the purity of adornment, as the sūtra says, All buddha-lands are endowed with miraculous adornments and characteristics of light, because their light adorns the adornments of treasures and other adornments.",
        "source": "T26n1522_003:0139c29_2"
    },
    {
        "source_sentence": "四者受用淨，如經「離一切煩惱成就清淨道」故。",
        "translation": "The fourth is the purity of enjoyment, as the sūtra says, Being free of all afflictions, they accomplish the pure path.",
        "source": "T26n1522_003:0140a01_3"
    },
    {
        "source_sentence": "五者住處眾生淨，如經「有無量智慧眾生悉滿其中」故。",
        "translation": "The fifth is that the abode of sentient beings is pure, as the sūtra says, All sentient beings with immeasurable wisdom fill it.",
        "source": "T26n1522_003:0140a03_0"
    },
    {
        "source_sentence": "六者因淨，如經「入佛上妙平等境界」故。",
        "translation": "The sixth is the causal purity, as the sūtra says, Entering the Buddha's supremely marvelous equal sphere of equality.",
        "source": "T26n1522_003:0140a04_1"
    },
    {
        "source_sentence": "七者果淨，如經「隨諸眾生心之所樂而為示現」故，顯智神力等故。",
        "translation": "The seventh is the purity of fruition, as the sūtra says, Show it to sentient beings according to their mental pleasures, because it shows that knowledge and supernormal powers are equal.",
        "source": "T26n1522_003:0140a05_2"
    },
    {
        "source_sentence": "經曰：又發大願，所謂一切菩薩同心同行故，共集善根無怨嫉故，一切菩薩平等一觀故，常親近諸佛菩薩不捨離故，隨意能現佛身故，自於心中悉能解知諸佛神力智力故，得不退隨意神通故，悉能遊行一切世界故，一切佛會皆現身相故，一切生處普生其中故，成就不可思議大乘故，具足行菩薩行故。",
        "translation": "The sūtra says, Again, he gives rise to the great vow, which is that all enlightening beings are fellow practitioners of the same mind because they gather together roots of goodness without resentment, because all enlightening beings equally observe one and the same, because they always associate with buddhas and enlightening beings and don't abandon them, because they can manifest Buddha-bodies",
        "source": "T26n1522_003:0140a07_0"
    },
    {
        "source_sentence": "廣大如法界究竟如虛空，盡未來際盡一切劫數一切行數，入大乘道無有休息。",
        "translation": "They are as vast as the cosmos of reality, ultimately as vast as space; they enter the path of the Great Vehicle without cease throughout all ages, forever and in all ways.",
        "source": "T26n1522_003:0140a14_1"
    },
    {
        "source_sentence": "論曰：第八大願不念餘乘故，如經「一切菩薩同心同行」故。",
        "translation": "The eighth great vow is because they aren't mindful of other vehicles, as the sūtras say, All bodhisattvas are acting with one mind.",
        "source": "T26n1522_003:0140a17_0"
    },
    {
        "source_sentence": "菩薩行有十種：一者共集善根無怨嫉故；",
        "translation": "The practice of enlightening beings is of ten kinds:",
        "source": "T26n1522_003:0140a18_1"
    },
    {
        "source_sentence": "二者一切菩薩平等一觀故；",
        "translation": "The second is the equality of all enlightening beings because they observe one and the same.",
        "source": "T26n1522_003:0140a19_2"
    },
    {
        "source_sentence": "三者常親近諸佛菩薩不捨離故；",
        "translation": "The third is that they always associate with the buddhas and enlightening beings without giving up.",
        "source": "T26n1522_003:0140a20_3"
    },
    {
        "source_sentence": "四者隨意能現佛身故；",
        "translation": "The fourth is the ability to manifest buddha-bodies as one wishes.",
        "source": "T26n1522_003:0140a20_4"
    },
    {
        "source_sentence": "五者自於心中悉能解知諸佛神力智力故；",
        "translation": "The fifth is the ability to know in one’s own mind all the spiritual powers and knowledge of buddhas.",
        "source": "T26n1522_003:0140a21_5"
    },
    {
        "source_sentence": "六者得不退隨意神通故；",
        "translation": "The sixth is the attainment of non-backsliding supernormal knowledge.",
        "source": "T26n1522_003:0140a22_6"
    },
    {
        "source_sentence": "七者悉能遊行一切世界故；",
        "translation": "The seventh is that they can travel to all worlds.",
        "source": "T26n1522_003:0140a23_7"
    },
    {
        "source_sentence": "八者一切佛會皆現身相故；",
        "translation": "The eighth is that all buddha-ssemblies show their physical forms.",
        "source": "T26n1522_003:0140a23_8"
    },
    {
        "source_sentence": "九者一切生處普生其中故；",
        "translation": "The ninth is that all places of birth are born therein.",
        "source": "T26n1522_003:0140a24_9"
    },
    {
        "source_sentence": "十者成就不可思議大乘故，具足行菩薩行故。",
        "translation": "The tenth is the accomplishment of the inconceivable great vehicle because they are fully endowed with the bodhisattva practices.",
        "source": "T26n1522_003:0140a25_10"
    },
    {
        "source_sentence": "於中初句顯功德行故，第二住寂靜等觀故，第三聚集解說論佛法故，第四隨心示現成佛故，第五自發勝心念如來法身故，第六得常不退神通故。",
        "translation": "The first sentence shows the practice of merit because the second abides in such contemplations as quiescence, the third gathers explanations and discusses the Buddha's teachings, the fourth follows the mind to show that he becomes a buddha, the fifth self-arouses superior thoughts about the Tathāgata's Dharma body, and the sixth attains eternal nonretrogressing supernormal powers",
        "source": "T26n1522_003:0140a26_11"
    },
    {
        "source_sentence": "餘四者以通業得名：一、往餘世界；",
        "translation": "The other four are called going to other worlds by means of supernormal knowledge.",
        "source": "T26n1522_003:0140a29_12"
    },
    {
        "source_sentence": "二、自餘異身示現；",
        "translation": "The second is self-manifesting in dissimilar bodies.",
        "source": "T26n1522_003:0140b01_13"
    },
    {
        "source_sentence": "三、同生往故；",
        "translation": "The third is because they are born together in the past and future.",
        "source": "T26n1522_003:0140b01_14"
    },
    {
        "source_sentence": "四、入不可思議大乘故。",
        "translation": "4. because they enter the inconceivable great vehicle.",
        "source": "T26n1522_003:0140b02_15"
    },
    {
        "source_sentence": "經曰：又發大願，所謂乘不退輪行菩薩行故，身口意業所作不空，眾生見者即必定佛法故，聞我音聲即得真實智慧故，心喜恭敬即斷煩惱故，得如藥樹王身故，得如如意寶身故，行大菩薩行故。",
        "translation": "The sūtra says, Again, he gives rise to the great vow, which is called the bodhisattva's practice of nonregression in the vehicle of enlightenment, because bodily, verbal, and mental actions are not empty, because sentient beings who see me will surely attain true wisdom when they hear my voice, because their minds are joyful and respectful, because they stop afflictions, because they",
        "source": "T26n1522_003:0140b03_0"
    },
    {
        "source_sentence": "廣大如法界究竟如虛空，盡未來際盡一切劫數一切行數，所作利益不空無有休息。",
        "translation": "It's as vast as the Dharma realm, ultimately like space, counting all eons and all practices throughout all future lives, and its benefits are unceasingly nonempty without cease.",
        "source": "T26n1522_003:0140b07_1"
    },
    {
        "source_sentence": "論曰：第九大願顯不空行菩薩行，復行菩薩行，顯乘不退輪行菩薩行故。",
        "translation": "The ninth great vow shows the bodhisattva's practice of practicing nonemptyness, and it also shows the bodhisattva's practice of practicing in the vehicle of nonretrogressing wheel-turning bodhisattva practice.",
        "source": "T26n1522_003:0140b10_0"
    },
    {
        "source_sentence": "於中不空有二種：一、作業必定不空，身口意業所作不空故。",
        "translation": "There are two kinds of nonemptyness in this: 1. definitely nonempty action, because what's done by body, speech, and thought actions isn't empty.",
        "source": "T26n1522_003:0140b11_1"
    },
    {
        "source_sentence": "如是次第三句說應知，眾生見者即必定佛法故者，明身業不空；",
        "translation": "In this way, the third sentence in succession is said to be ‘should be known’: Because sentient beings who see it definitely are because of the Buddha-dharma. This shows that bodily action is nonempty.",
        "source": "T26n1522_003:0140b13_2"
    },
    {
        "source_sentence": "聞我音聲即得真實智慧者，明口業不空；",
        "translation": "Those who hear my voice and immediately attain true knowledge and wisdom explain that verbal action is not empty.",
        "source": "T26n1522_003:0140b14_3"
    },
    {
        "source_sentence": "心喜恭敬即斷煩惱者，明意業不空。",
        "translation": "The mind is joyful and respectful, which means to stop the afflictions, explaining that mental activity isn't empty.",
        "source": "T26n1522_003:0140b15_4"
    },
    {
        "source_sentence": "二、作利益不空，一切眾生有二種苦：一、種種諸苦；",
        "translation": "All sentient beings experience two kinds of suffering:",
        "source": "T26n1522_003:0140b16_5"
    },
    {
        "source_sentence": "二、貧窮苦。",
        "translation": "2. the suffering of poverty...",
        "source": "T26n1522_003:0140b17_6"
    },
    {
        "source_sentence": "對治是二，如經「得如藥樹王身」故，得如如意寶身故。",
        "translation": "The antidote is twofold, as the sūtra says, It's because they attain the body of the king of the medicinal tree-like bodies, and they attain the wish-granting jeweled body.",
        "source": "T26n1522_003:0140b17_7"
    },
    {
        "source_sentence": "經曰：又發大願，所謂於一切世界處成阿耨多羅三藐三菩提故，於一凡夫道不離一切凡夫道處，示身初生、坐道場成佛道、轉法輪度眾生、示大涅槃，現諸佛境界大神通智力，隨一切眾生界所應度者於念念中示得佛道度諸眾生滅苦惱故，以一三菩提遍知一切法如涅槃性故，以一音說令一切眾生心皆歡喜故，示大涅槃而不斷菩薩所行故，示大智慧地發起一切法故，法智通、如意神通、幻通遍一切世界故。",
        "translation": "The sūtra says, Again, they give rise to the great vow, which is to say that in all worlds they attain unexcelled complete perfect enlightenment, show their bodies for the first birth, sit on the terrace of enlightenment to become buddhas, turn the wheel of the Dharma to save sentient beings, show great nirvāṇa, manifest the great supernormal knowledge and powers of the",
        "source": "T26n1522_003:0140b20_0"
    },
    {
        "source_sentence": "廣大如法界究竟如虛空，盡未來際盡一切劫數成三菩提數，求大智慧大神通等無有休息。",
        "translation": "They are as vast as the realm of reality and ultimately as vast as space, counting all eons throughout the future to become the number of the three bodhisattvas, seeking great wisdom, great supernormal powers, and so forth without cease.",
        "source": "T26n1522_003:0140c01_1"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T26n1522_003:0140c03_2"
    },
    {
        "source_sentence": "菩薩如是安住菩薩歡喜地，發諸大願，起如是大方便、如是大行，以十願門為首生如是等，滿足十百千萬阿僧祇大願。",
        "translation": "Thus, the bodhisattva thus abides in the bodhisattva's joyful stage, makes great vows, gives rise to such great skillful means and such great practices, takes the approach of the ten vows as their head, produces such-and-such things, and fulfills 10 million millions of incalculable great vows.",
        "source": "T26n1522_003:0140c03_3"
    },
    {
        "source_sentence": "是菩薩住菩薩歡喜地，起如是等願。",
        "translation": "This is the bodhisattva who abides in the bodhisattva's joyous stage and makes such a vow.",
        "source": "T26n1522_003:0140c06_4"
    },
    {
        "source_sentence": "論曰：第十大願起大乘行。",
        "translation": "The tenth great vow is to initiate the practice of the great vehicle.",
        "source": "T26n1522_003:0140c08_0"
    },
    {
        "source_sentence": "云何大菩提？",
        "translation": "What is great enlightenment?",
        "source": "T26n1522_003:0140c08_1"
    },
    {
        "source_sentence": "云何作業？",
        "translation": "What's the action?",
        "source": "T26n1522_003:0140c08_2"
    },
    {
        "source_sentence": "大菩提者，如經「成阿耨多羅三藐三菩提」故。",
        "translation": "Great enlightenment is as the sūtra says, Accomplishing unsurpassed, correct, and complete enlightenment.",
        "source": "T26n1522_003:0140c09_3"
    },
    {
        "source_sentence": "作業者，有七種：一、示正覺業；",
        "translation": "There are seven kinds of action:",
        "source": "T26n1522_003:0140c10_4"
    },
    {
        "source_sentence": "二、說實諦業；",
        "translation": "The second is the action of teaching the truth.",
        "source": "T26n1522_003:0140c10_5"
    },
    {
        "source_sentence": "三、證教化業；",
        "translation": "The third is the activity of actualizing enlightenment.",
        "source": "T26n1522_003:0140c11_6"
    },
    {
        "source_sentence": "四、種種說法業；",
        "translation": "The fourth is the practice of expounding doctrine in various ways.",
        "source": "T26n1522_003:0140c11_7"
    },
    {
        "source_sentence": "五、不斷佛種業；",
        "translation": "The fifth is that they do not cut off the seed karma of buddhahood.",
        "source": "T26n1522_003:0140c11_8"
    },
    {
        "source_sentence": "六、法輪復住業；",
        "translation": "The sixth is karma of the rebirth in the wheel of the Teaching.",
        "source": "T26n1522_003:0140c12_9"
    },
    {
        "source_sentence": "七、自在業。",
        "translation": "7. unimpeded karma...",
        "source": "T26n1522_003:0140c12_10"
    },
    {
        "source_sentence": "初業者於一凡夫道不離一切凡夫道處乃至示大涅槃故。",
        "translation": "The first karma is because it doesn't part from the path of all worldlings in a single mortal path and doesn't part from the paths of all worldlings or even show great nirvāṇa.",
        "source": "T26n1522_003:0140c12_11"
    },
    {
        "source_sentence": "一凡夫道者，一閻浮提義。",
        "translation": "The first is the path of worldlings, and the second is the meaning of Jambudvīpa.",
        "source": "T26n1522_003:0140c14_12"
    },
    {
        "source_sentence": "閻浮提凡夫道者，可化眾生住處名為凡夫道。",
        "translation": "The path of the worldling in Jambudvīpa is called the path of the worldling because it's a place where sentient beings can be transformed and live.",
        "source": "T26n1522_003:0140c14_13"
    },
    {
        "source_sentence": "第二業者，現諸佛境界大神通智力故，隨一切眾生界所應度者，於念念中示得佛道，度諸眾生滅苦惱故，隨諸世界一切可化者隨心示現佛身。",
        "translation": "In the second action, he manifests the great supernormal knowledge power of the buddhas' realm and shows the Buddha's body to all sentient beings who should be liberated according to their mentalities in every moment of thought to show that they've attained the Buddha Way because they've liberated sentient beings from suffering and distress, and he follows all the worlds where there's something to teach.",
        "source": "T26n1522_003:0140c15_14"
    },
    {
        "source_sentence": "示現佛身者，除諸難處彼彼勝處生，示除苦斷集證滅修道。",
        "translation": "He who shows the Buddha's body removes the difficult places and other superior places that arise, and he shows the cultivation of suffering, cessation, accumulation, realization, and cessation by removing suffering.",
        "source": "T26n1522_003:0140c19_15"
    },
    {
        "source_sentence": "第三業者，以一三菩提觀法無我一切法性淨涅槃，令眾生信解故。",
        "translation": "The third karma is the pure nirvāṇa of observing the selflessness of all dharmas with one or three kinds of enlightenment, which causes sentient beings to believe and understand.",
        "source": "T26n1522_003:0140c20_16"
    },
    {
        "source_sentence": "第四業者，以一音聲隨種種信解可化眾生，一時皆令心歡喜故。",
        "translation": "The fourth action is that by means of a single sound one can convert beings according to their various beliefs and understandings, causing them all at once to rejoice.",
        "source": "T26n1522_003:0140c22_17"
    },
    {
        "source_sentence": "第五業者，示現大涅槃而不斷菩薩所行力故。",
        "translation": "The fifth karma shows great nirvāṇa and doesn't stop the power of the bodhisattva's practice.",
        "source": "T26n1522_003:0140c23_18"
    },
    {
        "source_sentence": "第六業者，復佛智地一切修多羅等，所說法軌則不失故。",
        "translation": "The sixth karma is that all the sūtras and so forth of the Buddha's wisdom stage, which teaches the Dharma guideline without losing it.",
        "source": "T26n1522_003:0140c25_0"
    },
    {
        "source_sentence": "第七業法智通者，觀一切法無性相故。",
        "translation": "The seventh is the supernormal knowledge of the law in relation to action: because one observes that all factors are without essence or characteristic marks.",
        "source": "T26n1522_003:0140c26_1"
    },
    {
        "source_sentence": "如意神通者，自身現生住滅脩短，隨心自在故。",
        "translation": "supernormal power of supernormal volition is the ability to manifest, arise, abide, and cease oneself: because one develops shortness of breath.",
        "source": "T26n1522_003:0140c27_2"
    },
    {
        "source_sentence": "幻通者，轉變外事無不隨意故。",
        "translation": "The supernormal power of magic is that which transforms external things without not following one’s wishes.",
        "source": "T26n1522_003:0140c28_3"
    },
    {
        "source_sentence": "初法智通不住世間故，如意神通幻通不住涅槃故。",
        "translation": "The first is because the supernormal knowledge of dharmas doesn't abide in the world, and the supernormal knowledge of supernormal powers and illusory abilities don't abide in nirvāṇa.",
        "source": "T26n1522_003:0140c29_4"
    },
    {
        "source_sentence": "何故唯說此十大願？",
        "translation": "Why are only these ten great vows spoken of?",
        "source": "T26n1522_003:0141a01_5"
    },
    {
        "source_sentence": "初願功德行滿足故，第二願智慧行滿足故，次五願為教化眾生故，一以何身、二以何心、三何者眾生、四眾生住何處、五自身住何處能教化眾生，後三願顯自身，一得地挍量勝故、二得菩薩地盡挍量勝故、三得一切地盡究竟故。",
        "translation": "The first vow is fulfilled because of the practice of virtuous action of the first vow; the second vow is fulfilled because of the practice of wisdom of the second vow; the next five vows are fulfilled because of teaching sentient beings: 1. what body, 2. what mind, 3. what beings, 4. where do sentient beings live, 5. where can they teach sentient beings when they themselves live?",
        "source": "T26n1522_003:0141a01_6"
    },
    {
        "source_sentence": "此三示現如實教化眾生故。",
        "translation": "These three shows that they truly teach sentient beings.",
        "source": "T26n1522_003:0141a07_7"
    },
    {
        "source_sentence": "發諸大願者，隨心求義故。",
        "translation": "Those who give rise to the great vows seek their meaning according to their minds.",
        "source": "T26n1522_003:0141a08_8"
    },
    {
        "source_sentence": "起如是大方便者，成彼所作方便勇猛故。",
        "translation": "Someone who gives rise to such a great skillful means accomplishes the courageousness of the skillful means they make.",
        "source": "T26n1522_003:0141a08_9"
    },
    {
        "source_sentence": "如是大行者，彼所作行成就故。",
        "translation": "Such a great practice is the accomplishment of what they do.",
        "source": "T26n1522_003:0141a09_10"
    },
    {
        "source_sentence": "菩薩住此地漸次久習起此三行，非一時故。",
        "translation": "When the bodhisattva abides in this stage, these three aspects are produced gradually and over a long period of time:",
        "source": "T26n1522_003:0141a10_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T26n1522_003:0141a11_12"
    },
    {
        "source_sentence": "此十大願，一一願中有百千萬阿僧祇大願以為眷屬故。",
        "translation": "Within each of these ten great vows, there are a hundred million incalculable great vows as their followers.",
        "source": "T26n1522_003:0141a11_13"
    },
    {
        "source_sentence": "如經「諸佛子！",
        "translation": "As the sūtra says, Children of the Buddha!",
        "source": "T26n1522_003:0141a13_14"
    },
    {
        "source_sentence": "菩薩如是安住菩薩歡喜地發諸大願，起如是大方便、如是大行，以十願門為首，生如是等滿足十百千萬阿僧祇大願。",
        "translation": "The bodhisattva thus abides in the bodhisattva's joyful stage, makes great vows, gives rise to such great skillful means and such great deeds, starts with the gate of the ten vows as their head, and produces such a fulfillment of 10 million millions of incalculable great vows.",
        "source": "T26n1522_003:0141a13_15"
    },
    {
        "source_sentence": "是菩薩住菩薩歡喜地，起如是等願」故。",
        "translation": "This is because the bodhisattva abides in the bodhisattva's joyful state and gives rise to such a vow.",
        "source": "T26n1522_003:0141a16_16"
    },
    {
        "source_sentence": "何故名大願？",
        "translation": "Why is it called the great vow?",
        "source": "T26n1522_003:0141a17_17"
    },
    {
        "source_sentence": "光明善根轉勝增廣故。",
        "translation": "It's because the good root of light becomes superior and increases in breadth.",
        "source": "T26n1522_003:0141a17_18"
    },
    {
        "source_sentence": "此挍量菩薩願勝，有二種勝聲聞辟支佛：一、常勤修習無量行故，二、與一切眾生同行故。",
        "translation": "There are two kinds of superior śrāvakas and pratyekbuddhas: 1. because they always diligently cultivate measureless practices and 2. because they work with all sentient beings.",
        "source": "T26n1522_003:0141a18_0"
    },
    {
        "source_sentence": "同行者，十盡句示現。",
        "translation": "The fellow practitioner shows it in ten exhaustive phrases.",
        "source": "T26n1522_003:0141a20_1"
    },
    {
        "source_sentence": "經曰：以十盡句成諸大願。",
        "translation": "The sūtra says, With the ten exhaustive phrases, he accomplishes the great vows.",
        "source": "T26n1522_003:0141a21_0"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T26n1522_003:0141a21_1"
    },
    {
        "source_sentence": "所謂一、眾生界盡；",
        "translation": "The first is the exhaustion of sentient being realms.",
        "source": "T26n1522_003:0141a21_2"
    },
    {
        "source_sentence": "二、世界盡；",
        "translation": "The second is the exhaustion of worlds.",
        "source": "T26n1522_003:0141a22_3"
    },
    {
        "source_sentence": "三、虛空界盡；",
        "translation": "The space realm is extinguished.",
        "source": "T26n1522_003:0141a22_4"
    },
    {
        "source_sentence": "四、法界盡；",
        "translation": "The fourth is the exhaustion of the reality realm.",
        "source": "T26n1522_003:0141a22_5"
    },
    {
        "source_sentence": "五、涅槃界盡；",
        "translation": "The fifth is the exhaustion of the realm of nirvana.",
        "source": "T26n1522_003:0141a23_6"
    },
    {
        "source_sentence": "六、佛出世界盡；",
        "translation": "The sixth is the exhaustion of buddhas leaving worlds.",
        "source": "T26n1522_003:0141a23_7"
    },
    {
        "source_sentence": "七、如來智界盡；",
        "translation": "The seventh is the exhaustion of the realm of knowledge of buddhas.",
        "source": "T26n1522_003:0141a23_8"
    },
    {
        "source_sentence": "八、心所緣界盡；",
        "translation": "The eighth is the exhaustion of the sphere of mental activities.",
        "source": "T26n1522_003:0141a24_9"
    },
    {
        "source_sentence": "九、佛境界智入界盡；",
        "translation": "The ninth is the exhaustion of knowledge entering the realm of buddhahood.",
        "source": "T26n1522_003:0141a24_10"
    },
    {
        "source_sentence": "十、世間轉法轉智轉界盡。",
        "translation": "10. The worldly transformation of dharmas, the transformation of cognition, and the transformation of realms are ended.",
        "source": "T26n1522_003:0141a24_11"
    },
    {
        "source_sentence": "如眾生界盡，我願乃盡。",
        "translation": "Just as the realm of sentient beings has ended, so have my vows ended.",
        "source": "T26n1522_003:0141a25_12"
    },
    {
        "source_sentence": "如世界盡、如虛空界盡、如法界盡、如涅槃界盡、如佛出世界盡、如佛智界盡、如心所緣界盡、如佛境界智入界盡、如世間轉法轉智轉界盡，若彼界盡，我願乃盡。",
        "translation": "As the worlds are exhausted, as space is exhausted, as the realm of reality is exhausted, as the realm of nirvana is exhausted, as the buddhas emerge from the worlds are exhausted, as the realm of Buddha’s knowledge is exhausted, as the realm of mental objects is exhausted, as the entering realm of Buddha’s sphere of knowledge is exhausted, and as the",
        "source": "T26n1522_003:0141a26_13"
    },
    {
        "source_sentence": "如是眾生界盡不盡，我此善根亦不可盡。",
        "translation": "Thus, the sentient being realm is exhausted and not exhausted, and so are these good roots of mine that can't be exhausted.",
        "source": "T26n1522_003:0141a29_14"
    },
    {
        "source_sentence": "世界盡不盡、虛空界盡不盡、法界盡不盡、涅槃界盡不盡、佛出世界盡不盡、如來智界盡不盡、心所緣界盡不盡、佛境界智入界盡不盡、世間轉法轉智轉界盡不盡，我此諸願善根亦不可盡。",
        "translation": "The worlds are exhausted and inexhaustible, the space realm is exhausted and inexhaustible, the Dharma realm is exhausted and inexhaustible, the nirvāṇa realm is exhausted and inexhaustible, the buddhas emerge from the worlds are exhausted and inexhaustible, the Tathāgata's knowledge realm is exhausted and inexhaustible,",
        "source": "T26n1522_003:0141b01_15"
    },
    {
        "source_sentence": "論曰：於中眾生界盡是總，世界盡乃至智轉界盡是別。",
        "translation": "The destruction of the realm of sentient beings is general; the destruction of worlds, up to the destruction of the realm of transmutation of knowledge are specific.",
        "source": "T26n1522_003:0141b07_0"
    },
    {
        "source_sentence": "何等是眾生界？",
        "translation": "What's the sentient being realm?",
        "source": "T26n1522_003:0141b08_1"
    },
    {
        "source_sentence": "眾生界盡故。",
        "translation": "It's because the realm of sentient beings has ended.",
        "source": "T26n1522_003:0141b08_2"
    },
    {
        "source_sentence": "何處住？",
        "translation": "Where do they abide?",
        "source": "T26n1522_003:0141b08_3"
    },
    {
        "source_sentence": "世界盡故。",
        "translation": "It's because the world is exhausted.",
        "source": "T26n1522_003:0141b09_4"
    },
    {
        "source_sentence": "所有虛空界虛空界盡故，說何法教化？",
        "translation": "Because the space realm and the space realm are exhausted, what teaching does it teach?",
        "source": "T26n1522_003:0141b09_5"
    },
    {
        "source_sentence": "法界盡故，隨化眾生置何處？",
        "translation": "Because the Dharma realm is exhausted, where will they place sentient beings who are transformed accordingly?",
        "source": "T26n1522_003:0141b10_6"
    },
    {
        "source_sentence": "涅槃界盡故，佛出世界盡故，以何方便善巧？",
        "translation": "Because the realm of nirvana has ended, and because the Buddha's appearance in the world has ended, what skillful means does he use?",
        "source": "T26n1522_003:0141b10_7"
    },
    {
        "source_sentence": "如來智界盡故，復隨所緣心緣界盡故，復隨以何界？",
        "translation": "Because the sphere of knowledge of a Tathågata is exhausted, and because the spheres of awarenesses having mental supporting objects are also exhausted by reason of the exhaustion of the sphere of knowledge of a Tathågata.",
        "source": "T26n1522_003:0141b11_8"
    },
    {
        "source_sentence": "佛境界智入界盡故。",
        "translation": "It's because the Buddha's cognition of the objective realm and the sense-entry realm are exhausted.",
        "source": "T26n1522_003:0141b13_9"
    },
    {
        "source_sentence": "此事已說盡者，示現不斷盡，非念念盡故。",
        "translation": "“This matter has already been spoken of as being extinguished”: The manifestation is unceasingly extinguished: because it is not the extinguishing of mindfulness.",
        "source": "T26n1522_003:0141b13_10"
    },
    {
        "source_sentence": "此九種盡，略說三種三轉，示現此十盡句增上力故，諸佛以此力常為眾生作利益故。",
        "translation": "These nine forms of cessation are briefly said to be threefold and three revolutions: because they show the dominant power of these ten statements of cessation. Because by means of these powers buddhas always work for the benefit of sentient beings.",
        "source": "T26n1522_003:0141b14_11"
    },
    {
        "source_sentence": "如是已說願挍量勝。",
        "translation": "Thus, it's been said that the vow is superior in terms of its breadth.",
        "source": "T26n1522_003:0141b16_12"
    },
    {
        "source_sentence": "云何行挍量勝？",
        "translation": "What's the superiority of practice that's gross and immeasurable?",
        "source": "T26n1522_003:0141b17_13"
    },
    {
        "source_sentence": "經曰：諸佛子！",
        "translation": "The sūtra says, Children of the Buddha!",
        "source": "T26n1522_003:0141b18_0"
    },
    {
        "source_sentence": "菩薩決定發如是諸大願已，則得調順心、柔軟心，如是則成信者。",
        "translation": "A bodhisattva who is certain to give rise to these great vows will then attain a compliant mind and a gentle mind, and thus he'll become a believer.",
        "source": "T26n1522_003:0141b18_1"
    },
    {
        "source_sentence": "信諸佛如來本所行入，集諸波羅蜜而得增長，善成就諸地，具足無畏、力、不共佛法不壞故，不可思議佛法，無中無邊如來境界起，無量行門諸如來境界入，信成就果。",
        "translation": "Because they believe in the buddha-tathāgatas' original practice and entry, accumulate the perfections and attain growth, skillfully accomplish the stages, are endowed with fearlessness, power, and don't share the Buddha's teaching that doesn't break down, the inconceivable Buddha dharma arises from the boundless realm of the Tathāgata who has no middle or no end, enter",
        "source": "T26n1522_003:0141b19_2"
    },
    {
        "source_sentence": "舉要言之，信一切菩薩行，乃至得如來智地說加故。",
        "translation": "To summarize, it's because they believe in all the bodhisattva practices up to the point where they attain the Tathāgata's stage of wisdom and explain their addition.",
        "source": "T26n1522_003:0141b23_3"
    },
    {
        "source_sentence": "論曰：發如是諸大願已則得調順心者，彼諸善根中得自在勝故。",
        "translation": "He who gives rise to these great vows then attains a mind that's disciplined, because he attains mastery over the good roots.",
        "source": "T26n1522_003:0141b26_0"
    },
    {
        "source_sentence": "柔軟心者，得勝樂行故。",
        "translation": "A gentle mind is because it attains superior blissful conduct.",
        "source": "T26n1522_003:0141b27_1"
    },
    {
        "source_sentence": "如是則成信者，於中本行入者從菩薩行入乃至成菩提覺故。",
        "translation": "Thus, this is the person who becomes a believer because the original practice and entry of enlightenment comes from the bodhisattva's practice and entry up to the attainment of enlightenment.",
        "source": "T26n1522_003:0141b28_2"
    },
    {
        "source_sentence": "於中信菩薩行所攝本行入，有二種相：一、云何菩薩行；",
        "translation": "Regarding this, there are two kinds of characteristics of the original practice-entry included in faith as practice for enlightening beings:",
        "source": "T26n1522_003:0141b29_3"
    },
    {
        "source_sentence": "二、云何次第成。",
        "translation": "2. How are they formed in order?",
        "source": "T26n1522_003:0141c01_4"
    },
    {
        "source_sentence": "如經「集諸波羅蜜而得增長」故，善成就諸地故。",
        "translation": "As the sūtra says, He gathers the perfections and grows them, it's because he well accomplishes the stages.",
        "source": "T26n1522_003:0141c02_5"
    },
    {
        "source_sentence": "此菩提所攝本行入有六種勝，是故信勝。",
        "translation": "There are six kinds of superiority in the original practice and entry included in this enlightenment, so it's believed to be superior.",
        "source": "T26n1522_003:0141c03_6"
    },
    {
        "source_sentence": "一者外道魔怨、聲聞緣覺對治等勝，如經「具足無畏、力、不共佛法不壞」故。",
        "translation": "One, the non-Buddhist Māra's enemies, śrāvakas, pratyekbuddhas, antidotes, and so forth are superior, as the sūtra says, Replete with fearlessness, power, and unique qualities of the Buddha's teaching that don't break down.",
        "source": "T26n1522_003:0141c04_7"
    },
    {
        "source_sentence": "二者不思議神通力上勝，如經「不可思議佛法」故。",
        "translation": "The second is the superiority of inconceivable supernormal powers, as shown in the sūtra, Inconceivable Buddhadharma.",
        "source": "T26n1522_003:0141c05_8"
    },
    {
        "source_sentence": "三者不雜染勝，如經「無中無邊如來境界起」故。",
        "translation": "The third is the superiority of not being defiled, as the sūtra says, There's no limitless tathāgata realm in the middle that arises.",
        "source": "T26n1522_003:0141c07_9"
    },
    {
        "source_sentence": "四者一切種智勝，如經「無量行門諸如來境界入」故。",
        "translation": "Fourth, the superiority of all kinds of cognition is as explained in the sūtra, The Tathāgata's objective entry through the gate of immeasurable practices.",
        "source": "T26n1522_003:0141c08_10"
    },
    {
        "source_sentence": "五者離勝，一切煩惱習常遠離故，如經「信成就果」故。",
        "translation": "The fifth is superior because it's free of all the accumulations of afflictions and always free of them, just as the sūtra says, The fruit of accomplishing faith.",
        "source": "T26n1522_003:0141c09_11"
    },
    {
        "source_sentence": "復略說彼菩薩本行入示現，如經「舉要言之，信一切菩薩行乃至得如來智地說加」故。",
        "translation": "It's also briefly explained that the bodhisattva's original practice enters into manifestation, just as the sūtra says, To summarize, it's because he believes in all the bodhisattva practices up to the point where he attains the Tathāgata's wisdom stage and explains their addition.",
        "source": "T26n1522_003:0141c10_12"
    },
    {
        "source_sentence": "說者所說，加者得證故。",
        "translation": "Spoken of is what is spoken of: because that which is added acquires realization.",
        "source": "T26n1522_003:0141c12_13"
    },
    {
        "source_sentence": "此菩薩三種觀，於諸眾生起大慈悲：一、遠離最上第一義樂；",
        "translation": "These enlightening beings observe three kinds of great compassion toward sentient beings:",
        "source": "T26n1522_003:0141c13_14"
    },
    {
        "source_sentence": "二、具足諸苦；",
        "translation": "The second is that they are endowed with suffering.",
        "source": "T26n1522_003:0141c14_15"
    },
    {
        "source_sentence": "三、於彼二顛倒。",
        "translation": "3. those two mistaken views.",
        "source": "T26n1522_003:0141c14_16"
    },
    {
        "source_sentence": "云何遠離最上第一義樂？",
        "translation": "How can we be far removed from the supreme bliss of ultimate truth?",
        "source": "T26n1522_003:0141c15_17"
    },
    {
        "source_sentence": "經曰：諸佛子！",
        "translation": "The sūtra says, Children of the Buddha!",
        "source": "T26n1522_003:0141c16_0"
    },
    {
        "source_sentence": "彼菩薩作是念：諸佛正法如是甚深、如是寂靜、如是寂滅、如是空、如是無相、如是無願、如是無染、如是無量、如是上，此諸佛法如是難得。",
        "translation": "That bodhisattva thought, The right teachings of the buddhas are thus profound, thus quiescent, thus tranquil, thus empty, thus signless, thus wishless, thus undefiled, thus immeasurable, and thus superior, and these buddha-teachings are thus difficult to attain.",
        "source": "T26n1522_003:0141c16_1"
    },
    {
        "source_sentence": "論曰：諸佛正法如是甚深者，有九種：一、寂靜甚深；",
        "translation": "The doctrine of the Buddhas is thus profound. There are nine kinds:",
        "source": "T26n1522_003:0141c20_0"
    },
    {
        "source_sentence": "二、寂滅甚深；",
        "translation": "The second is the profundity of extinction.",
        "source": "T26n1522_003:0141c21_1"
    },
    {
        "source_sentence": "三、空甚深；",
        "translation": "The third is the profundity of emptiness.",
        "source": "T26n1522_003:0141c21_2"
    },
    {
        "source_sentence": "四、無相甚深；",
        "translation": "The fourth is the profundity of signlessness.",
        "source": "T26n1522_003:0141c21_3"
    },
    {
        "source_sentence": "五、無願甚深；",
        "translation": "The fifth is the profundity of wishlessness.",
        "source": "T26n1522_003:0141c22_0"
    },
    {
        "source_sentence": "六、無染甚深；",
        "translation": "The sixth is the profundity of nondefilement.",
        "source": "T26n1522_003:0141c22_1"
    },
    {
        "source_sentence": "七、無量甚深；",
        "translation": "The seventh is immeasurable and profound.",
        "source": "T26n1522_003:0141c22_2"
    },
    {
        "source_sentence": "八、上甚深；",
        "translation": "The eighth is great depth.",
        "source": "T26n1522_003:0141c22_3"
    },
    {
        "source_sentence": "九、難得甚深。",
        "translation": "9. It's difficult to attain profoundness.",
        "source": "T26n1522_003:0141c23_4"
    },
    {
        "source_sentence": "寂靜者，離妄計實有故，妄計正取故。",
        "translation": "“ Tranquil”: Being free from falsely imagining that there really is something, because they falsely imagine right grasping.",
        "source": "T26n1522_003:0141c23_5"
    },
    {
        "source_sentence": "寂滅者，法義定故。",
        "translation": "extinction means that the meaning of dharmas is fixed.",
        "source": "T26n1522_003:0141c24_6"
    },
    {
        "source_sentence": "空無相無願者，三障對治解脫門觀故。",
        "translation": "“Emptiness, signlessness and wishlessness”: Because of the contemplation of the gate of liberation which is the antidote for the three obstacles.",
        "source": "T26n1522_003:0141c24_7"
    },
    {
        "source_sentence": "何者三障？",
        "translation": "What are these three hindrances?",
        "source": "T26n1522_003:0141c25_8"
    },
    {
        "source_sentence": "一分別、二相、三取，捨願故。",
        "translation": "One is discrimination, two are characteristic marks and three are grasping: because of abandoning the vow.",
        "source": "T26n1522_003:0141c26_0"
    },
    {
        "source_sentence": "無染者，離雜染法觀故。",
        "translation": "The undefiled one is because he observes the principle of freedom from defilement.",
        "source": "T26n1522_003:0141c26_1"
    },
    {
        "source_sentence": "無量者，不可算數不可思量，生善根觀故。",
        "translation": "Measureless means incalculable and inconceivable, because it produces the contemplation of good roots.",
        "source": "T26n1522_003:0141c27_2"
    },
    {
        "source_sentence": "上者，依自利利他增上智觀故。",
        "translation": "The higher one is because of the contemplation of self-benefiting and benefitting others by relying on superior knowledge.",
        "source": "T26n1522_003:0141c28_3"
    },
    {
        "source_sentence": "難得者，三阿僧祇劫證智觀故。",
        "translation": "It's difficult to attain because it's the contemplation of realizing wisdom for three incalculable eons.",
        "source": "T26n1522_003:0141c28_4"
    },
    {
        "source_sentence": "云何具足諸苦？",
        "translation": "How are they replete with suffering?",
        "source": "T26n1522_003:0141c29_5"
    },
    {
        "source_sentence": "經曰：而諸凡夫心墮邪見，為無明癡闇蔽其意識，常立憍慢幢，墮在念欲渴愛網中，隨順諂曲林，常懷嫉妬而作後身生處因緣。",
        "translation": "The sūtra says, But the minds of ordinary people fall into wrong views, are blinded by the darkness of ignorance and delusion in their consciousnesses, always set up banners of conceit, fall into the web of desire, thirst, and love, follow the forest of flattery, always harbor jealousy, and create causes and conditions for the place where they'll be born later.",
        "source": "T26n1522_003:0142a01_0"
    },
    {
        "source_sentence": "多集貪欲、瞋、癡，起諸業行，嫌恨猛風吹罪心火常令熾燃，有所作業皆與顛倒相應，隨順欲漏、有漏、無明漏，相續起心意識種子。",
        "translation": "They often accumulate craving, anger, and delusion, give rise to karmic actions, and the fierce wind of hate blows away the fire of sinful thoughts that always make them burn. All their actions are associated with error; they follow the contaminants of desire, the contaminants of existence, and the contaminants of ignorance, and continuously produce the seeds of mind, thought, and consciousness in succession",
        "source": "T26n1522_003:0142a04_1"
    },
    {
        "source_sentence": "論曰：而諸凡夫心墮邪見者，邪見有九種：一者蔽意邪見，如經「為無明癡闇蔽其意識」故。",
        "translation": "The treatise says, When ordinary people's minds fall into mistaken views, there are nine kinds of mistaken views: one is a mistaken view that obstructs the mind, as explained in the sūtra, It's because ignorance and delusion obscure their consciousness.",
        "source": "T26n1522_003:0142a08_0"
    },
    {
        "source_sentence": "二者憍慢邪見，如經「常立憍慢幢」故。",
        "translation": "The second is the mistaken view of arrogance, as shown in the sūtra, Always erect the banner of arrogance.",
        "source": "T26n1522_003:0142a10_1"
    },
    {
        "source_sentence": "三者愛念邪見，如經「墮在念欲渴愛網中」故。",
        "translation": "The third is a mistaken view of craving and mindfulness, as the sūtra says, They'll fall into the web of thoughts, desires, and thirst.",
        "source": "T26n1522_003:0142a11_0"
    },
    {
        "source_sentence": "四者諂曲心邪見，如經「隨順諂曲林」故。",
        "translation": "The fourth is the mistaken view of flattering mind, as shown in the sūtra, Following the flattering forest.",
        "source": "T26n1522_003:0142a12_1"
    },
    {
        "source_sentence": "五者嫉妬行邪見，如經「常懷嫉妬而作後身生處因緣」故。",
        "translation": "The fifth is the mistaken view of jealousy because it's like the sūtra, Always harboring jealousy and creating causes and conditions for the place where the latter body will be born.",
        "source": "T26n1522_003:0142a13_0"
    },
    {
        "source_sentence": "六者集業邪見，如經「多集貪欲瞋癡起諸業行」故。",
        "translation": "The sixth is the mistaken view of accumulating karma, as the sūtra says, Many accumulate craving, anger, and delusion that give rise to actions.",
        "source": "T26n1522_003:0142a14_1"
    },
    {
        "source_sentence": "七者吹心熾燃邪見，如經「嫌恨猛風吹罪心火常令熾燃」故。",
        "translation": "The seventh is a mistaken view that blows away the mind and burns it, as shown in the sūtra, A fierce wind of hatred blows away the fire of sinful thoughts and always makes them burn.",
        "source": "T26n1522_003:0142a15_2"
    },
    {
        "source_sentence": "八者起業邪見，如經「有所作業皆與顛倒相應」故。",
        "translation": "Eight, the wrong view that gives rise to karma, as the sūtra says, All actions are associated with mistakenness.",
        "source": "T26n1522_003:0142a17_0"
    },
    {
        "source_sentence": "九者心意識種子邪見，如經「隨順欲漏有漏無明漏相續起心意識種子」故。",
        "translation": "The nineth is the mistaken view that the seeds of mind and consciousness arise from the seeds of mind and consciousness, as the sūtra says, Following the contaminants of desire, contaminants of ignorance, and contaminants of continuity give rise to the seeds of mind and consciousness.",
        "source": "T26n1522_003:0142a18_1"
    },
    {
        "source_sentence": "是中蔽意邪見、憍慢邪見、愛念邪見，此三邪見依法義妄計如是次第。",
        "translation": "These are the three mistaken views of obstructing mind, conceit, pride, and craving, which falsely discriminate according to the meaning of the Dharma in this order.",
        "source": "T26n1522_003:0142a19_2"
    },
    {
        "source_sentence": "諂曲心邪見、嫉妬行邪見，此二邪見於追求時心行過故。",
        "translation": "The perverted view of hypocrisy, the perverted view of jealousy and the perverted view of envy. These two perverted views are due to the faults committed by thought at the moment of pursuing.",
        "source": "T26n1522_003:0142a21_3"
    },
    {
        "source_sentence": "嫉者於身起邪行故，妬者於資財等，是故生生之處墮卑賤中，形貌鄙陋資生不足故。",
        "translation": "Because jealousy proceeds regarding the body and produces evil conduct. Jealousy is with such [things] as means of subsistence. That is why, wherever they are born, they fall into the lowest class: because their appearance is coarse and unworthy!®*° and the means of subsistence is insufficient.",
        "source": "T26n1522_003:0142a22_4"
    },
    {
        "source_sentence": "第六集業邪見，受諸受時憎愛彼二顛倒境界故。",
        "translation": "The sixth is the false view of accumulating karma, because when feeling sensations are experienced, one dislikes and loves those two mistaken objects.",
        "source": "T26n1522_003:0142a24_5"
    },
    {
        "source_sentence": "第七吹心熾燃邪見，於怨恨時互相追念欲起報惡業故。",
        "translation": "The seventh kind blows the mind and burns out false views: because, at the moment of enmity or resentment, they are mutually oppressed and wish to produce evil action as retribution.",
        "source": "T26n1522_003:0142a26_0"
    },
    {
        "source_sentence": "第八起業邪見，於作惡時迭相加害故。",
        "translation": "The eighth gives rise to wrong view of action, because at the moment of doing evil, they inflict harm on one another.",
        "source": "T26n1522_003:0142a27_1"
    },
    {
        "source_sentence": "第九心意識種子邪見，於作善業時所有布施持戒修行善根等業皆是有漏故。",
        "translation": "The ninth is the mistaken view that the seeds of mind, thought, and consciousness are all contaminated when they do good actions such as generosity, observance of precepts, cultivation of good roots, and so forth.",
        "source": "T26n1522_003:0142a28_2"
    },
    {
        "source_sentence": "經曰：於三界地復有芽生，所謂名色共生不離，此名色增長已成六入聚，成六入已內外相對生觸，觸因緣故生受，深樂受故生渴愛，渴愛增長故生取，取增長故復起後有，有因緣故有生老死憂悲苦惱，如是眾生生長苦聚。",
        "translation": "The Sūtra says: Again, there is sprouting in the stages of the three spheres. That is to say, name and form arise together without separation. This name and form having increased make six classes of sense-fields possible. Having developed these six classes of sense-fields, contact arises with respect to each other inside and outside. sensation arises because of the causes and conditions of contact; thirst arises because",
        "source": "T26n1522_003:0142b02_0"
    },
    {
        "source_sentence": "是中皆空離我我所，無知無覺如草木石壁又亦如響；",
        "translation": "They are all empty, free from self and what belongs to self. Without knowing or apprehending them, they are like grass, trees, stones, walls, and sounds.",
        "source": "T26n1522_003:0142b07_1"
    },
    {
        "source_sentence": "然諸眾生不知不覺而受苦惱。",
        "translation": "Still, sentient beings don't know or perceive and experience suffering and distress.",
        "source": "T26n1522_003:0142b08_2"
    },
    {
        "source_sentence": "論曰：是中因緣有三種：一、自相，從復有芽生乃至於有；",
        "translation": "There are three kinds of causes and conditions:",
        "source": "T26n1522_003:0142b10_0"
    },
    {
        "source_sentence": "二、同相，謂生老病死等過；",
        "translation": "The second is the characteristic of sameness, that is, birth, old age, sickness, and death.",
        "source": "T26n1522_003:0142b11_1"
    },
    {
        "source_sentence": "三、顛倒相，離我我所等。",
        "translation": "3. the characteristic of delusion, which is free of self and what belongs to self.",
        "source": "T26n1522_003:0142b11_2"
    },
    {
        "source_sentence": "自相者有三種：一者報相，名色共阿黎耶識生，如經「於三界地復有芽生，所謂名色共生」故。",
        "translation": "There are three kinds of self-marks: first, the mark of retribution, which gives rise to name-and-form in common with the store consciousness, as the sūtra says, In the land of the three realms, there are also sprouts that arise, which are called name-and-form co-arisen.",
        "source": "T26n1522_003:0142b12_3"
    },
    {
        "source_sentence": "名色共生者，名色共彼生故。",
        "translation": "“In common with name and form, it is produced”: Because name and form arise in common with these.",
        "source": "T26n1522_003:0142b14_4"
    },
    {
        "source_sentence": "二者彼因相，是名色不離彼、依彼共生故，如經「不離」故。",
        "translation": "The second is the causal aspect, which is that name-and-form doesn't part from them and co-arises based on them, as the sūtra says, Not separated.",
        "source": "T26n1522_003:0142b15_5"
    },
    {
        "source_sentence": "三者彼果次第相，從六入乃至於有，如經「此名色增長已成六入聚，成六入已內外相對生觸，觸因緣故生受，深樂受故生渴愛，渴愛增長故生取，取增長故復起後有，有因緣故有生老死憂悲苦惱，如是眾生生長苦聚」故。",
        "translation": "The third is the sequential characteristic of those fruits, from the six sense-fields up to existence, as the sūtra says, After this name-and-form grows, it becomes a cluster of the six sense-fields; after becoming a cluster of the six sense-fields, contact arises internally and externally; sensation arises because of the causes and conditions of touch; thirst arises because of the profound",
        "source": "T26n1522_003:0142b16_6"
    },
    {
        "source_sentence": "是中離我我所者，此二示現空。",
        "translation": "Being free of self and what belongs to self, these two shows emptiness.",
        "source": "T26n1522_003:0142b21_7"
    },
    {
        "source_sentence": "無知無覺者，自體無我故。",
        "translation": "“Without knowing and without perception”: Because the specific essence is without self.",
        "source": "T26n1522_003:0142b22_8"
    },
    {
        "source_sentence": "彼無知無覺，示非眾生數動不動事。",
        "translation": "They lack knowledge and perception, showing that they aren't sentient beings who repeatedly move and don't move things.",
        "source": "T26n1522_003:0142b23_9"
    },
    {
        "source_sentence": "如經「如草木石壁又亦如響」故，因緣相似相類法故。",
        "translation": "It's because the sūtra says, Just as grass, wood, stones, walls, and sounds are like echoes, so are the causes and conditions similar to each other.",
        "source": "T26n1522_003:0142b24_10"
    },
    {
        "source_sentence": "云何於彼二顛倒？",
        "translation": "What are these two mistaken attachments?",
        "source": "T26n1522_003:0142b25_11"
    },
    {
        "source_sentence": "如經「然諸眾生不知不覺而受苦惱」故。",
        "translation": "It's because the sūtra says, Still, sentient beings don't know and don't feel pain and suffering.",
        "source": "T26n1522_003:0142b25_12"
    },
    {
        "source_sentence": "經曰：菩薩如是見諸眾生不離苦聚，是故即生大悲智慧；",
        "translation": "The scripture says, “Thus do enlightening beings see sentient beings who are not free from the mass of suffering; therefore they engender great compassion and wisdom.",
        "source": "T26n1522_003:0142b27_0"
    },
    {
        "source_sentence": "是諸眾生我應教化令住涅槃畢竟之樂，是故即生大慈智慧。",
        "translation": "These sentient beings should be taught by me to abide in the ultimate bliss of nirvāṇa, so that's why great compassion and wisdom arise.",
        "source": "T26n1522_003:0142b28_1"
    },
    {
        "source_sentence": "論曰：云何具諸苦聚？",
        "translation": "How are the lumps of suffering endowed?",
        "source": "T26n1522_003:0142c01_0"
    },
    {
        "source_sentence": "云何遠離？",
        "translation": "How are they separated?",
        "source": "T26n1522_003:0142c01_1"
    },
    {
        "source_sentence": "最上第一義樂，此先已說，示現大悲慈等故。",
        "translation": "The supreme bliss of the highest meaning has already been spoken of here: because it manifests such [things] as great compassion and kindness.",
        "source": "T26n1522_003:0142c01_2"
    },
    {
        "source_sentence": "經曰：諸佛子？",
        "translation": "The sūtra says, Children of the Buddha?",
        "source": "T26n1522_003:0142c03_0"
    },
    {
        "source_sentence": "菩薩摩訶薩隨順如是大慈悲法住在初地，以深妙心於一切物無所悋惜，以智求佛大妙智故，修行大捨，即時所有可施之物皆悉能捨，所謂一切財穀庫藏等捨，或以金銀、摩尼、真珠、琉璃、珂貝、車璩、馬瑙、生金等捨，或以寶莊嚴具瓔珞等捨，或以象馬車乘輦輿等捨，或以寺舍園林樓觀流泉浴地等捨，或以奴婢僮僕等捨，或以國土聚落城邑王都等捨，或以妻子男女等捨，或以一切所愛之事皆悉能捨，或以頭目耳鼻支節手足一切身分等捨。",
        "translation": "The bodhisattva Mahāsattva abides in the first stage of great compassion, following these principles of great kindness and compassion, with a profound mind deeply devoted to all things without regret, cultivates great giving because he seeks Buddha’s great marvelous wisdom through knowledge. He immediately gives away everything that can be given, such as grain storehouse for all possessions, gold, silver, jewels, pe",
        "source": "T26n1522_003:0142c03_1"
    },
    {
        "source_sentence": "如是一切可捨之物而不貪惜，唯求無上佛智慧故而行大捨。",
        "translation": "Thus, he doesn't crave all the things that can be abandoned but practices great equanimity because he seeks the unsurpassed Buddha's wisdom.",
        "source": "T26n1522_003:0142c13_2"
    },
    {
        "source_sentence": "如是菩薩摩訶薩住於初地能成大捨。",
        "translation": "Thus, the bodhisattva Mahāsattva abides in the first ground and can accomplish great equanimity.",
        "source": "T26n1522_003:0142c15_3"
    },
    {
        "source_sentence": "論曰：即時所有可施之物皆悉能捨者，求佛無上大妙智故。",
        "translation": "The treatise says, He who immediately abandons all the things that can be given because he seeks the Buddha's unsurpassed great marvelous wisdom.",
        "source": "T26n1522_003:0142c16_0"
    },
    {
        "source_sentence": "是中一切物者，略有二種：一外、二內。",
        "translation": "In brief, all these things are of two kinds: one is external and two are internal.",
        "source": "T26n1522_003:0142c17_1"
    },
    {
        "source_sentence": "外者復有二種：一、所用；",
        "translation": "Again, there are two kinds of external ones:",
        "source": "T26n1522_003:0142c18_2"
    },
    {
        "source_sentence": "二、貯積。",
        "translation": "2. accumulation.",
        "source": "T26n1522_003:0142c18_3"
    },
    {
        "source_sentence": "如經「所謂一切財穀庫藏等」故。",
        "translation": "It's because the sūtra says, All possessions, grain storehouses, and so forth.",
        "source": "T26n1522_003:0142c19_4"
    },
    {
        "source_sentence": "如是次第於中廣有八種，從金銀等乃至一切所愛之事。",
        "translation": "In this order, there are eight kinds: from gold and silver, etc., up to all the things beloved.",
        "source": "T26n1522_003:0142c19_5"
    },
    {
        "source_sentence": "內者，自身所攝。",
        "translation": "Within refers to that which is included within oneself.",
        "source": "T26n1522_003:0142c21_6"
    },
    {
        "source_sentence": "是外事捨中，初捨是總，餘九捨是別。",
        "translation": "The first form of equanimity is general; the other nine forms of equanimity are specific.",
        "source": "T26n1522_003:0142c21_7"
    },
    {
        "source_sentence": "依二種喜：一、藏攝喜；",
        "translation": "Relying on two kinds of delight:",
        "source": "T26n1522_003:0142c22_8"
    },
    {
        "source_sentence": "二、利益喜。",
        "translation": "2. the joy of benefit...",
        "source": "T26n1522_003:0142c22_9"
    },
    {
        "source_sentence": "藏攝喜者，謂金銀等。",
        "translation": "The store that gathers joy means gold, silver, and so forth.",
        "source": "T26n1522_003:0142c23_10"
    },
    {
        "source_sentence": "利益喜者，復有八種：一者嚴飾利益喜，謂寶莊嚴等。",
        "translation": "There are another eight kinds of benefit and joy: first, the benefit and joy of adornment, which refers to jewel ornamentation and so forth.",
        "source": "T26n1522_003:0142c23_11"
    },
    {
        "source_sentence": "二者代步利益喜，謂象馬等。",
        "translation": "The second is the joy of benefiting others by stepping on their behalf: elephants, horses, etc.",
        "source": "T26n1522_003:0142c24_12"
    },
    {
        "source_sentence": "三者戲樂利益喜，謂園林樓觀等。",
        "translation": "The third is the joy of benefiting from play and pleasure, which are parks, forests, buildings, and so forth.",
        "source": "T26n1522_003:0142c25_13"
    },
    {
        "source_sentence": "四者代苦利益喜，謂奴婢等。",
        "translation": "The fourth is the joy of repaying suffering and benefiting, which are slaves, maids, and so forth.",
        "source": "T26n1522_003:0142c26_14"
    },
    {
        "source_sentence": "五者自在利益喜，謂國土聚落等。",
        "translation": "The fifth is unimpeded benefit and joy, that is, lands, villages, etc.",
        "source": "T26n1522_003:0142c26_15"
    },
    {
        "source_sentence": "六者眷屬利益喜，謂妻子等。",
        "translation": "The sixth is the benefit and joy of dependents, i.e., spouses, children, etc.",
        "source": "T26n1522_003:0142c27_16"
    },
    {
        "source_sentence": "七者堅著利益喜，謂一切所愛等。",
        "translation": "The seventh is firmly attached to benefits and joys, which are all the things that are loved.",
        "source": "T26n1522_003:0142c28_17"
    },
    {
        "source_sentence": "八者稱意利益喜，謂頭目耳鼻等。",
        "translation": "The eighth is the joy of praising one's intention for benefit, which is called head, eyes, ears, nose, ears, ears, and so forth.",
        "source": "T26n1522_003:0142c29_18"
    },
    {
        "source_sentence": "經曰：菩薩如是以大施心救一切眾生故，轉轉推求世間出世間利益勝事。",
        "translation": "The sūtra says, Thus, because the bodhisattva's mind of great generosity saves all sentient beings, he turns around and seeks worldly and supramundane benefits that are superior.",
        "source": "T26n1522_003:0143a01_0"
    },
    {
        "source_sentence": "彼推求利益勝事時心不疲惓，是故菩薩成不疲惓心。",
        "translation": "Their mind isn't weary when they seek superior things for benefit, so the bodhisattva becomes a mind that isn't weary.",
        "source": "T26n1522_003:0143a02_1"
    },
    {
        "source_sentence": "成不疲惓已，於一切經論心無怯弱，是名成一切經論智。",
        "translation": "Having accomplished this, he's not weary and doesn't become frightened by all the sūtras and treatises, which is called accomplishing the knowledge of all the sūtras and treatises.",
        "source": "T26n1522_003:0143a04_2"
    },
    {
        "source_sentence": "如是成一切經論智已，善能籌量應作不應作，於上中下眾生隨宜隨宜而行、隨力隨感，是故菩薩成就世智。",
        "translation": "Having thus perfected the knowledge of all the sūtras and treatises, he's well able to discern what should be done and what shouldn't be done, and he acts appropriately and appropriately for sentient beings in the upper, middle, and lower realms according to their abilities and strengths, so the bodhisattva accomplishes worldly knowledge.",
        "source": "T26n1522_003:0143a05_3"
    },
    {
        "source_sentence": "成世智已，知時知量慚愧莊嚴修習自利利他之道，是故菩薩成慚愧莊嚴。",
        "translation": "Having perfected worldly cognition, he knows the time and knows how to measure the adornment of shamefulness and cultivate the path for self-benefiting and benefiting others; therefore, the bodhisattva accomplishes the adornment of shame.",
        "source": "T26n1522_003:0143a08_4"
    },
    {
        "source_sentence": "如是行中精勤修行得不退不轉力，如是菩薩成堅固力。",
        "translation": "In this practice, diligently cultivating it in order to attain the power of nonbacksliding and nonturning, such a bodhisattva becomes resolute.",
        "source": "T26n1522_003:0143a09_5"
    },
    {
        "source_sentence": "得堅固力已，勤行供養諸佛，隨所聞法如說修行。",
        "translation": "After attaining resolute strength, they diligently practiced to make offerings to the buddhas and cultivated following the teachings they had heard.",
        "source": "T26n1522_003:0143a11_6"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T26n1522_003:0143a12_7"
    },
    {
        "source_sentence": "是菩薩悉知生起如是清淨諸地法，所謂信悲慈捨不疲惓，知諸經論善解世法，慚愧堅固力，供養諸佛如說修行。",
        "translation": "This is the bodhisattva who fully knows that such pure dharmas arise, which are called faith, compassion, kindness, equanimity, and non-frivolity, knows the sūtras and treatises, well understands worldly dharmas, is shameful and resolute, makes offerings to the buddhas as they're taught, and cultivates their practice.",
        "source": "T26n1522_003:0143a12_8"
    },
    {
        "source_sentence": "論曰：是中依此世智隨宜隨宜而行者，如論中說隨自己力隨彼能受故。",
        "translation": "The Sūtra teaches that the consciousness which acts on the basis of worldly knowledge, according to one’s capacities and according to what is appropriate.",
        "source": "T26n1522_003:0143a16_0"
    },
    {
        "source_sentence": "依慚愧知時知量者，示三種時：一者念時；",
        "translation": "Those who, relying on shame and modesty, know the time and know the limitations show three kinds of moments:",
        "source": "T26n1522_003:0143a17_1"
    },
    {
        "source_sentence": "二者日夜時；",
        "translation": "The second is the time of day and night.",
        "source": "T26n1522_003:0143a18_2"
    },
    {
        "source_sentence": "三者所作必得不斷時。",
        "translation": "3. When what's done will surely attain unremittingness.",
        "source": "T26n1522_003:0143a19_3"
    },
    {
        "source_sentence": "依堅固力如是彼行中者，如上所說信等故。",
        "translation": "The one who relies on the power of steadfastness and thus is in this aspect: because, as has been said above, such [things] as faith.",
        "source": "T26n1522_003:0143a19_4"
    },
    {
        "source_sentence": "精勤修行者，有二種：一、不退力，不捨行故；",
        "translation": "There are two kinds of energetic practitioners:",
        "source": "T26n1522_003:0143a20_5"
    },
    {
        "source_sentence": "二、不轉力，精進不息故。",
        "translation": "2. the power of non-transformation: because energy does not cease.",
        "source": "T26n1522_003:0143a21_6"
    },
    {
        "source_sentence": "供養諸佛如說修行者，有二種：一、利養供養；",
        "translation": "There are two kinds of people who make offerings to buddhas:",
        "source": "T26n1522_003:0143a22_7"
    },
    {
        "source_sentence": "二、修行供養。",
        "translation": "2. the offering of cultivation.",
        "source": "T26n1522_003:0143a23_8"
    },
    {
        "source_sentence": "此十種行顯二種勝成就：一、深心成就，謂信悲慈等。",
        "translation": "These ten kinds of practices show two kinds of superior accomplishment: 1. the accomplishment of profound mind, which are faith, pity, compassion, and so forth.",
        "source": "T26n1522_003:0143a23_9"
    },
    {
        "source_sentence": "二、修行成就，謂捨不疲惓，知諸經論善解世法，慚愧堅固力，供養諸佛如說修行等。",
        "translation": "The second is the accomplishment of cultivation, which consists of relinquishing without weariness, knowing the sūtras and treatises that well understand worldly dharmas, being ashamed of one's steadfast strength, making offerings to the buddhas as they teach and cultivate.",
        "source": "T26n1522_003:0143a24_10"
    },
    {
        "source_sentence": "於中依自利行，謂信能信菩薩行及諸佛法，求必能得故。",
        "translation": "The practice of self-benefiting is that which relies on faith to be able to believe in the bodhisattva practices and the buddha-dharmas, because one will surely attain them if one seeks them.",
        "source": "T26n1522_003:0143a26_11"
    },
    {
        "source_sentence": "依利他行，所謂悲慈能安隱與樂心故。",
        "translation": "Relying on the practice of benefiting others, it's called compassion and kindness that can bring peace and happiness to mind.",
        "source": "T26n1522_003:0143a27_12"
    },
    {
        "source_sentence": "捨者，以財攝他行故。",
        "translation": "“Equanimity”: Because possessions grasp the conduct of others.",
        "source": "T26n1522_003:0143a28_13"
    },
    {
        "source_sentence": "不疲惓者，自攝法行故。",
        "translation": "He who isn't weary because he takes care of his own practice of the Dharma.",
        "source": "T26n1522_003:0143a29_14"
    },
    {
        "source_sentence": "知諸經論善解世法者，以法攝他行故。",
        "translation": "Knowing the sūtras and treatises well understand worldly dharmas, it's because they gather other practices in dharmas.",
        "source": "T26n1522_003:0143a29_15"
    },
    {
        "source_sentence": "餘有三行攝護信等：一者不著行，以慚愧對治障信等不著行故；",
        "translation": "There are three other practices that safeguard faith, etc.:",
        "source": "T26n1522_003:0143b01_16"
    },
    {
        "source_sentence": "二者不動行，有堅固力，信等不可動故；",
        "translation": "The second is the steadfast one, because it has such powers as unshakable faith and so on.",
        "source": "T26n1522_003:0143b03_17"
    },
    {
        "source_sentence": "三者修行，彼垢清淨依止行供養諸佛，攝信等善根故。",
        "translation": "The third is the practice of cultivation, which is to rely on that defilement and purity as a basis for practicing offerings to the buddhas because it collects such good roots as faith.",
        "source": "T26n1522_003:0143b04_18"
    },
    {
        "source_sentence": "是中依二種供養故，得二種身：一者上妙身，所可見者心生敬重，利益不空故；",
        "translation": "In this way, relying on two kinds of offerings, they obtain two kinds of bodies:",
        "source": "T26n1522_003:0143b05_19"
    },
    {
        "source_sentence": "二者調柔心，自性善根成就，樂行法故。",
        "translation": "The second is the state of gentle mind, which is naturally endowed with good roots because it delights in religious practice.",
        "source": "T26n1522_003:0143b07_20"
    },
    {
        "source_sentence": "前所說三十句，從信增上等乃至常求上上勝道，是清淨地法。",
        "translation": "The thirty sentences mentioned previously are: from such [things] as faith that is superior, etc., up to the eternally seeking highest and most excellent path - this is the doctrine of the stage of cleanliness.",
        "source": "T26n1522_003:0143b08_21"
    },
    {
        "source_sentence": "今此十句從信等乃至供養諸佛，盡是障地淨法，是名修行挍量勝。",
        "translation": "These ten phrases now, from faith and so forth, up to making offerings to the buddhas, are all pure dharmas that obstruct the stage of purity, which is called the superiority of cultivation in terms of their crudeness.",
        "source": "T26n1522_003:0143b09_22"
    },
    {
        "source_sentence": "云何果利益挍量勝？",
        "translation": "What's the superiority of the benefits of fruition in terms of their grossness?",
        "source": "T26n1522_003:0143b11_23"
    },
    {
        "source_sentence": "經曰：諸佛子！",
        "translation": "The sūtra says, Children of the Buddha!",
        "source": "T26n1522_003:0143b12_0"
    },
    {
        "source_sentence": "是菩薩住此菩薩歡喜地已，多見諸佛。",
        "translation": "After this bodhisattva abides in this bodhisattva's joyful state, he often sees the buddhas.",
        "source": "T26n1522_003:0143b12_1"
    },
    {
        "source_sentence": "以大神通力、大願力故，見多百佛、多千佛、多百千佛、多百千那由他佛、多億佛、多百億佛、多千億佛、多百千億佛、多百千億那由他佛，以大神通力大願力故。",
        "translation": "Because of their great supernormal powers and great vows, they see many hundreds of thousands of buddhas, many hundreds of millions of buddhas, many trillions of buddhas, many trillions of buddhas, many trillions of buddhas, many trillions of buddhas, many trillions of buddhas, many trillions of buddhas, many trillions of buddhas, many trillions of buddh",
        "source": "T26n1522_003:0143b13_2"
    },
    {
        "source_sentence": "是菩薩見諸佛時，以上心深心供養恭敬尊重讚歎，衣服飲食臥具湯藥一切供具悉以奉施，以諸菩薩上妙樂具供養眾僧，以此善根皆願迴向阿耨多羅三藐三菩提。",
        "translation": "When this bodhisattva sees the buddhas, he wholeheartedly and profoundly makes offerings to them with respect, veneration, respect, praise, and admiration, presents clothing, food, bedding, bathing, and all the other offerings, and makes offerings to the saṃgha with the supremely wonderful comforts of enlightening beings and vows to return these good roots to unsurpassed",
        "source": "T26n1522_003:0143b16_3"
    },
    {
        "source_sentence": "是菩薩因供養諸佛故，成教化利益眾生法。",
        "translation": "Because these bodhisattvas make offerings to the buddhas, they accomplish the teaching and benefiting sentient beings.",
        "source": "T26n1522_003:0143b20_4"
    },
    {
        "source_sentence": "是菩薩多以二攝攝取眾生，所謂布施、愛語。",
        "translation": "These bodhisattvas often take care of sentient beings with two kinds of taking in, which are called generosity and loving words.",
        "source": "T26n1522_003:0143b21_5"
    },
    {
        "source_sentence": "後二攝法但以信解力行，未善通達。",
        "translation": "The last two methods of gathering in sentient beings are simply practiced with the power of faith and understanding, but they don't well understand them.",
        "source": "T26n1522_003:0143b22_6"
    },
    {
        "source_sentence": "是菩薩十波羅蜜中檀波羅蜜增上，餘波羅蜜非不修集，隨力隨分是菩薩隨所供養諸佛，教化眾生皆能受行清淨地法。",
        "translation": "Among the ten perfections, this is the bodhisattva's augmentation of the perfection of giving, and the other perfections aren't cultivated or accumulated; these are the powers and parts that enable a bodhisattva to follow the offerings made to the buddhas and teach sentient beings so that they can all receive and practice the pure ground dharma.",
        "source": "T26n1522_003:0143b23_7"
    },
    {
        "source_sentence": "如是如是彼諸善根皆願迴向薩婆若，轉復明淨調柔成就隨意所用。",
        "translation": "Thus and so forth, these good roots are all vowed to be directed back to sarvajña, which further clarifies that the accomplishment of pure and gentleness is used as they wish.",
        "source": "T26n1522_003:0143b26_8"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T26n1522_003:0143b27_9"
    },
    {
        "source_sentence": "譬如金師善巧鍊金數數入火，如是如是轉復明淨調柔成就隨意所用。",
        "translation": "It's like a gold master who skillfully collects gold into the fire and repeatedly enters it, thus and so forth, and then he further explains that purity and gentleness are accomplished as he wishes.",
        "source": "T26n1522_003:0143b28_0"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T26n1522_003:0143b29_1"
    },
    {
        "source_sentence": "菩薩亦復如是，如是如是供養諸佛教化眾生，皆能修行清淨地法。",
        "translation": "So it is with the bodhisattvas, who thus and so thus make offerings to the buddhas and transform sentient beings, and they're all able to cultivate the practice of the pure ground dharma.",
        "source": "T26n1522_003:0143b29_2"
    },
    {
        "source_sentence": "正修行已，如是如是彼諸善根皆願迴向薩婆若，轉復明淨調柔成就隨意所用。",
        "translation": "After correctly cultivating it, they all wish to dedicate their good roots in this way and so forth to sarvajña, which furthermore explains that the pure and gentle accomplishment of these good roots is used at will.",
        "source": "T26n1522_003:0143c02_3"
    },
    {
        "source_sentence": "論曰：果利益挍量勝有四種：一、調柔果利益勝；",
        "translation": "There are four kinds of predominance in the benefits of fruit:",
        "source": "T26n1522_003:0143c05_0"
    },
    {
        "source_sentence": "二、發趣果利益勝；",
        "translation": "The second is the superiority in terms of benefiting those who have set out for enlightenment.",
        "source": "T26n1522_003:0143c06_1"
    },
    {
        "source_sentence": "三、攝報果利益勝；",
        "translation": "The third is the superiority in terms of benefiting by means of the fruits of retribution.",
        "source": "T26n1522_003:0143c06_2"
    },
    {
        "source_sentence": "四、願智果利益勝。",
        "translation": "4. the superiority of the benefits of the fruit of vow knowledge.",
        "source": "T26n1522_003:0143c06_3"
    },
    {
        "source_sentence": "調柔果利益勝者，金相似法，信等善法猶如真金。",
        "translation": "The superiority of the benefits of the fruit of gentleness is that gold resembles the Dharma and faith in good qualities like real gold.",
        "source": "T26n1522_003:0143c07_4"
    },
    {
        "source_sentence": "數數入火者，有三種入：一、功德入，供養佛僧故；",
        "translation": "“Countless [factors] enter the fire”: There are three kinds of entry:",
        "source": "T26n1522_003:0143c08_5"
    },
    {
        "source_sentence": "二、悲心入，教化眾生故；",
        "translation": "The second is the sense mind of compassion, because it develops sentient beings.",
        "source": "T26n1522_003:0143c09_6"
    },
    {
        "source_sentence": "三、無上果入，願迴向大菩提故。",
        "translation": "3. the unsurpassed fruitful entry, which is the vow to return to great enlightenment.",
        "source": "T26n1522_003:0143c10_7"
    },
    {
        "source_sentence": "以大神通力見諸佛者，以勝神通力見色身佛。",
        "translation": "Someone who sees the buddhas with great supernormal powers will see the form-body Buddha with superior supernormal powers.",
        "source": "T26n1522_003:0143c10_8"
    },
    {
        "source_sentence": "大願力者，以內正願力見法身佛。",
        "translation": "The power of the great vow is to see the Dharma body Buddha with the power of the right internal vow.",
        "source": "T26n1522_003:0143c12_0"
    },
    {
        "source_sentence": "多百佛乃至百千億那由他佛者，方便善巧示現多佛，顯多數故。",
        "translation": "Many hundreds of buddhas up to a hundred thousand koṭis of nayutas are the skillful means of skillfully manifesting many buddhas, because they show that there are many.",
        "source": "T26n1522_003:0143c12_1"
    },
    {
        "source_sentence": "供養者，有三種：一、恭敬供養，謂讚歎等，顯佛功德故；",
        "translation": "There are three kinds of offerings: 1. respectful offerings, i.e., praise, etc., because they show the virtues of buddhas.",
        "source": "T26n1522_003:0143c14_2"
    },
    {
        "source_sentence": "二、尊重供養，謂禮拜等；",
        "translation": "The second is to venerate and make offerings, that is, by worshipping.",
        "source": "T26n1522_003:0143c15_3"
    },
    {
        "source_sentence": "三、奉施供養，謂花香塗香末香幡蓋等。",
        "translation": "3. offerings and offerings, which are flowers, incense, ointments, powdered incense, banners, canopies, and so forth.",
        "source": "T26n1522_003:0143c16_4"
    },
    {
        "source_sentence": "以諸菩薩上妙樂具者，是諸菩薩所有世間不供之物，具足奉施一切眾僧故。",
        "translation": "It's because the bodhisattvas' supreme marvelous joyful implements are things that they don't offer in the world, and they fully present them to all the saṃgha.",
        "source": "T26n1522_003:0143c16_5"
    },
    {
        "source_sentence": "云何發趣果利益勝？",
        "translation": "What's the superiority of the benefit that arouses the fruit of rebirth?",
        "source": "T26n1522_003:0143c18_6"
    },
    {
        "source_sentence": "經曰：復次諸佛子！",
        "translation": "The sūtra says, Furthermore, children of the Buddha!",
        "source": "T26n1522_003:0143c20_0"
    },
    {
        "source_sentence": "菩薩摩訶薩住此菩薩歡喜地，於初地中諸相得果，應從諸佛菩薩善知識所推求請問成地諸法無有厭足。",
        "translation": "When the bodhisattva Mahāsattva abides in this bodhisattva's joyful stage, he attains the fruit of the marks in the first ground and doesn't tire of asking questions from the buddhas and bodhisattvas who are well-versed about the accomplishment of the dharmas in the stage.",
        "source": "T26n1522_003:0143c20_1"
    },
    {
        "source_sentence": "如是菩薩住初地中，應從諸佛菩薩善知識所推求請問第二地中諸相得果成地諸法無有厭足，如是第三第四第五第六第七第八第九第十地中諸相得果，應從諸佛菩薩善知識所推求請問成十地法無有厭足。",
        "translation": "Thus, when a bodhisattva abides in the first ground, he should ask questions from the buddhas and bodhisattvas who are well-versed about the second ground's characteristics that attain fruition and become dharmas in the third, fourth, fifth, sixth, seventh, eighth, ninth, and tenth stages, such things that attain fruition in the third, four",
        "source": "T26n1522_003:0143c23_0"
    },
    {
        "source_sentence": "是菩薩善知諸地障對治、善知地成壞、善知地相、善知地得修、善知地清淨分、善知地地轉行、善知地地住處、善知地地挍量勝智、善知地得不退轉、善知一切菩薩地清淨轉入如來智地。",
        "translation": "This is the bodhisattva who well knows the antidotes to the hindrances of the stages, well knows the formation and disintegration of the stages, well knows the characteristics of the stages, well knows the cultivation of the stages, well knows the pure parts of the stages, well knows the turns of the stages, well knows the abodes of the stages, well knows the superior knowledge of the",
        "source": "T26n1522_003:0143c28_1"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T26n1522_003:0144a03_2"
    },
    {
        "source_sentence": "菩薩如是善起地相，發於初地不住意成乃至轉入十地，無障礙故。",
        "translation": "Bodhisattvas thus skillfully arouse the characteristics of the stage because they give rise to the first stage and don't abide in mental formation up to the tenth stage, which is unobstructed.",
        "source": "T26n1522_003:0144a03_3"
    },
    {
        "source_sentence": "以得十地智慧光明故，能得諸佛智慧光明。",
        "translation": "Because they've attained the light of the wisdom of the ten stages, they can attain the light of the buddhas' wisdom.",
        "source": "T26n1522_003:0144a05_4"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T26n1522_003:0144a06_5"
    },
    {
        "source_sentence": "譬如善巧導師，多將人眾向彼大城。",
        "translation": "It's like a skillful guide who sends a large group of people to the great city.",
        "source": "T26n1522_003:0144a06_6"
    },
    {
        "source_sentence": "未發之時應先問道中利益諸事，復問道中退患過咎，復問道處中間勝事，復問道處中間退患過咎。",
        "translation": "When they haven't yet arisen, they should first ask about the benefits of the path, the faults and blameworthiness of retreating in the path, the superiority of the middle way, and the faults and blameworthiness of retreating in the middle way.",
        "source": "T26n1522_003:0144a07_7"
    },
    {
        "source_sentence": "具道資糧，作所應作，推求請問。",
        "translation": "He had the necessities for the path, did what should be done, and asked questions.",
        "source": "T26n1522_003:0144a09_8"
    },
    {
        "source_sentence": "未發初處，是大導師乃至善知到彼大城。",
        "translation": "Before he sets out for the first place, this is the great guide or even a well-versed person who reaches that great city.",
        "source": "T26n1522_003:0144a10_9"
    },
    {
        "source_sentence": "未發初處，此導師能以智慧思惟籌量，具諸資用令無所乏，正導眾人乃至得到大城，於嶮道中免諸患難，身及眾人皆無憂惱。",
        "translation": "Before he sets out for the first place, this guide can skillfully contemplate and calculate with wisdom, equip himself with necessities so that there's nothing to lack, correctly guide people up to the great city, avoid all hardships and difficulties on the precipitous path, and have no sorrow in body or people.",
        "source": "T26n1522_003:0144a11_10"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T26n1522_003:0144a14_11"
    },
    {
        "source_sentence": "菩薩摩訶薩善巧導師亦復如是，住於初地善知地障對治，乃至善知一切菩薩地清淨轉入如來智地。",
        "translation": "Similarly, the skillful guide of bodhisattvas and mahāsattvas who abide in the first ground well know the antidote for the hindrances to the stages and well know all the purities of the bodhisattva stages and turn into the Tathāgata's stage of knowledge.",
        "source": "T26n1522_003:0144a14_12"
    },
    {
        "source_sentence": "爾時菩薩具大福德助道資糧、善擇智慧助道，欲將一切眾生向薩婆若大城。",
        "translation": "It was then that the bodhisattva possessed the accumulation of great merit that aids in the path and the accumulation of skillful discernment and wisdom that aids in the path, and he wanted to lead all sentient beings to the great city of sarvajña.",
        "source": "T26n1522_003:0144a17_13"
    },
    {
        "source_sentence": "未發初處，應先問地道功德，復問諸地退患，復問地道處中間勝事，復問地道處中間退患。",
        "translation": "Before you start the first place, you should first ask about the merits of the path of the stages, and then ask about the hindrances of retrogression in the stages, the superior things in between the paths of the stages, and the hindrances in between the paths.",
        "source": "T26n1522_003:0144a19_14"
    },
    {
        "source_sentence": "具大功德智慧資糧，作所應作，應從諸佛菩薩善知識所推求請問。",
        "translation": "He possesses the accumulation of great merit and wisdom, and whatever he does should be done, he should ask questions from the buddhas and bodhisattvas who are well-versed.",
        "source": "T26n1522_003:0144a21_15"
    },
    {
        "source_sentence": "未發初處，是菩薩善知地障對治，乃至善知能到薩婆若大城。",
        "translation": "Before he gives rise to the first place, this is a bodhisattva who well knows the antidote for the earthly hindrances and can reach the great city of Sāvajñāpāramitā.",
        "source": "T26n1522_003:0144a22_16"
    },
    {
        "source_sentence": "未發初處，菩薩如是智慧分別具大功德智慧資糧，將一切眾生如應教化，出過世間嶮難惡處，乃至令住薩婆若大城，不為世間生死嶮過所染，身及眾生無諸衰惱。",
        "translation": "Before he gives rise to the first place, the bodhisattva thus discerns his wisdom and possesses the accumulation of great merit and wisdom, which enables all sentient beings to correctly teach and transform themselves, transcend worldly bad places that are dangerous and difficult, even live in the great city of Sāvajñā, aren't stained by worldly paths of birth and death, and have no physical or sentient",
        "source": "T26n1522_003:0144a24_17"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T26n1522_003:0144a28_18"
    },
    {
        "source_sentence": "是故菩薩摩訶薩常應心不疲惓勤修諸地業勝智本行。",
        "translation": "Therefore, the bodhisattva Mahāsattva always responds with a mind that doesn't tire and diligently cultivates the fundamental practice of superior knowledge of the actions of the stages.",
        "source": "T26n1522_003:0144a28_19"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T26n1522_003:0144a29_20"
    },
    {
        "source_sentence": "是名略說菩薩摩訶薩入初菩薩歡喜地門，廣說則有無量百千萬億阿僧祇事。",
        "translation": "This is called a brief explanation of how the bodhisattva Mahāsattva enters the first bodhisattva's joyful ground approach, and when he explains it in detail, there are measureless hundreds of thousands of millions of incalculable things.",
        "source": "T26n1522_003:0144b01_0"
    },
    {
        "source_sentence": "論曰：諸相者，隨諸地中所有諸障及對治相故。",
        "translation": "The characteristics are the characteristics of the obstacles and the characteristics of the antidote that exist in all stages.",
        "source": "T26n1522_003:0144b03_0"
    },
    {
        "source_sentence": "得者，證出世間智故。",
        "translation": "Attained: because of realizing transmundane knowledge.",
        "source": "T26n1522_003:0144b04_1"
    },
    {
        "source_sentence": "果者，因證智力得世間出世間智故。",
        "translation": "The fruit is that which, because of the power knowledge of realization, acquires worldly and transmundane knowledge.",
        "source": "T26n1522_003:0144b04_2"
    },
    {
        "source_sentence": "成地諸法者，所謂信等，為滿足彼故。",
        "translation": "The factors that settle the stages are so-called such [things] as faith: because of fulfilling them.",
        "source": "T26n1522_003:0144b05_3"
    },
    {
        "source_sentence": "有五種方便：一、觀方便；",
        "translation": "There are five kinds of skillful means:",
        "source": "T26n1522_003:0144b06_4"
    },
    {
        "source_sentence": "二、得方便；",
        "translation": "The second is the attainment of skillful means.",
        "source": "T26n1522_003:0144b06_5"
    },
    {
        "source_sentence": "三、增上方便；",
        "translation": "The third is superior skillful means.",
        "source": "T26n1522_003:0144b07_6"
    },
    {
        "source_sentence": "四、不退方便；",
        "translation": "The fourth is the method of nonbacksliding.",
        "source": "T26n1522_003:0144b07_7"
    },
    {
        "source_sentence": "五、盡至方便。",
        "translation": "5. the method of exhaustion...",
        "source": "T26n1522_003:0144b07_8"
    },
    {
        "source_sentence": "觀方便者，障對治成壞善巧，如經「是菩薩善知諸地障對治故、善知地成壞故，十種地障對治故，名為十地」。",
        "translation": "The method of contemplation is the skillfulness of counteracting hindrances and forming and disintegrating, as the sūtra says, It's called the ten stages because bodhisattvas well know the antidote for the hindrances to the ten kinds of stages and well know the formation and disintegration of the stages, and it's called the ten stages because they are the antidotes for the",
        "source": "T26n1522_003:0144b07_9"
    },
    {
        "source_sentence": "如本分中說，如是次第集故成、散故壞。",
        "translation": "As has been said in the main text: formation is due to successive accumulation; decay is due to dispersal.",
        "source": "T26n1522_003:0144b10_10"
    },
    {
        "source_sentence": "得方便者，欲入方便、已入方便，彼勝進方便，如經「善知地相故、善知地得修故、善知地清淨分」故。",
        "translation": "Those who attain skillful means want to enter the method and have entered the method, and those who advance with skillful means are as explained in the sūtra, It's because they well know the characteristics of the ground, well know the cultivation of the ground, and well know the pure parts of the ground.",
        "source": "T26n1522_003:0144b11_11"
    },
    {
        "source_sentence": "增上方便者，地地轉行、地地住處、地地增長善巧，如經「善知地地轉行故、善知地地住處故、善知地地挍量勝智」故。",
        "translation": "The superior method refers to the skillfulness of gradually transforming stages, the abode of each stage and the growth of each stage, as the sūtra says, It's because they well know the gradually transforming stages, the abode of each stage and the abode of each stage, and the superior wisdom of knowing the debilitating aspects of each stage.",
        "source": "T26n1522_003:0144b13_12"
    },
    {
        "source_sentence": "不退方便者，如經「善知地得不退轉」故。",
        "translation": "The method of non-backsliding is as explained in the sūtra, Good knowledge of the ground attains non-backsliding.",
        "source": "T26n1522_003:0144b16_13"
    },
    {
        "source_sentence": "盡至方便者，菩薩地盡入如來地善巧，如經「善知一切菩薩地清淨轉入如來智地」故。",
        "translation": "The perfection of skillful means is when the bodhisattva's ground completely enters the Tathāgata's ground and skillfully enters the Tathāgata's ground, just as the sūtra says, Knowing well that all bodhisattva stages are purely transformed into the Tathāgata's ground of wisdom because they enter the Tathāgata's ground of knowledge.",
        "source": "T26n1522_003:0144b17_14"
    },
    {
        "source_sentence": "諸佛子譬如善巧導師多將人眾向彼大城者，令得正行故。",
        "translation": "It's like a skillful guide who directs many people to the great city because he causes them to attain right practice.",
        "source": "T26n1522_003:0144b19_15"
    },
    {
        "source_sentence": "於中導師者，有二種方便：一者不迷道方便，於道路中是利是退患，於道路處是勝是過咎，皆善巧知。",
        "translation": "Among these guides, there are two kinds of skillful means: first, the method of not misconstruing the path; second, the skillful means of knowing what's advantageous and what's disadvantageous in the path; and third, the skillful means of knowing what's superior and what's faulty in the path.",
        "source": "T26n1522_003:0144b20_16"
    },
    {
        "source_sentence": "如經「先問道中利益諸事故，復問道中退患過咎故，復問道處中間勝事故，復問道處中間退患過咎」故。",
        "translation": "As the sūtra says, First, he asks about the benefits of the path, and then he asks about the faults and errors of retreat in the path; second, he asks about the superiority of the middle way and the faults and errors of retreat in the middle way.",
        "source": "T26n1522_003:0144b23_17"
    },
    {
        "source_sentence": "二者資具利益方便，如經「具道資糧，作所應作」故。",
        "translation": "The second is the method of accumulating benefits, as shown in the sūtra, Accompanied by the necessities of the path and doing what should be done.",
        "source": "T26n1522_003:0144b25_18"
    },
    {
        "source_sentence": "云何攝報果利益勝？",
        "translation": "What's the superiority of the benefit of gathering in retribution?",
        "source": "T26n1522_003:0144b26_19"
    },
    {
        "source_sentence": "經曰：菩薩摩訶薩住此初地，多作閻浮提王，豪貴自在常護正法，能以大施攝取眾生，善除眾生慳貪妬嫉之垢，常行大捨而無窮盡。",
        "translation": "The sūtra says, When the bodhisattva Mahāsattva lives in this first ground, he often becomes king of Jambudvīpa, is wealthy and self-possessed, always protects the right teaching, can take care of sentient beings with great generosity, well rids sentient beings of the stain of stinginess, greed, craving, jealousy, and jealousy",
        "source": "T26n1522_003:0144b28_0"
    },
    {
        "source_sentence": "所作善業，布施、愛語、利益、同事，是諸福德皆不離念佛、不離念法、不離念僧、不離念諸菩薩、不離念菩薩行、不離念諸波羅蜜、不離念十地、不離念不壞力、不離念無畏、不離念佛不共法，乃至不離念具足一切種一切智智。",
        "translation": "The good actions they perform are generosity, kind speech, benefit, and co-workers, which are all merits that don't part from mindfulness of the Buddha, Dharma, saṃgha, bodhisattvas, bodhisattva practices, perfections, ten stages, indestructible powers, fearlessness, uncommon dharmas, or buddhas, up to the fulfillment of all kinds of omniscience and",
        "source": "T26n1522_003:0144c02_1"
    },
    {
        "source_sentence": "常生是心：我當於一切眾生中為首為勝、為大為妙為微妙、為上為無上、為導為將、為師為尊，乃至為一切智智依止者。",
        "translation": "They always give rise to this thought: Among all sentient beings, I will be the leader, the superior, the great, the marvelous, the subtle, the supreme, the unsurpassed, the guide, the general, the teacher, the honored, and even the support of omniscience and cognition.",
        "source": "T26n1522_003:0144c07_2"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T26n1522_003:0144c10_3"
    },
    {
        "source_sentence": "是菩薩摩訶薩若欲捨家勤行精進，於佛法中便能捨家妻子五欲。",
        "translation": "If this bodhisattva Mahāsattva wants to abandon his family and diligently practices effort, he'll be able to abandon the five desires of home and wife in the Buddha's teaching.",
        "source": "T26n1522_003:0144c10_4"
    },
    {
        "source_sentence": "得出家已勤行精進，於一念間得百三昧、得見百佛、知百佛神力，能動百佛世界、能入百佛世界、能照百佛世界、能教化百佛世界眾生、能住壽百劫、能知過去未來世各百劫事、能善入百法門、能變身為百，於一一身能示百菩薩以為眷屬。",
        "translation": "Having renounced the householder’s life, he diligently practiced and energetically. In a single thought he attained a hundred concentrations, saw a hundred buddhas, and knew the spiritual powers of a hundred buddhas. He was able to move a hundred worlds, enter a hundred worlds, illumine a hundred worlds, edify a hundred beings in a hundred worlds, live a hundred eons, know the events of",
        "source": "T26n1522_003:0144c12_5"
    },
    {
        "source_sentence": "論曰：攝報果利益勝者，有二種：一、在家果；",
        "translation": "There are two kinds of superiority in the benefits of the fruit of collecting retribution:",
        "source": "T26n1522_003:0144c19_0"
    },
    {
        "source_sentence": "二、出家果。",
        "translation": "2. the fruit of leaving home.",
        "source": "T26n1522_003:0144c19_1"
    },
    {
        "source_sentence": "在家果復有二種：一者上勝身，閻浮提王等，如經「菩薩摩訶薩住此初地多作閻浮提王，豪貴自在常護正法」故。",
        "translation": "Again, there are two kinds of fruit at home: first, the superior body, Jambudvīpa and so forth, as shown in the sūtra, The bodhisattva Mahāsattva who lives here in the first ground often becomes a king of Jambudvīpa, because he's powerful and self-possessed and always protects the right teaching.",
        "source": "T26n1522_003:0144c20_2"
    },
    {
        "source_sentence": "二者上勝果，善巧調伏慳貪嫉妬等，如經「能以大施攝取眾生，善除眾生慳貪嫉妬垢」等。",
        "translation": "The second is the superior result, which skillfully subdues stinginess, greed, jealousy, and so forth, as shown in the sūtra, He can take care of sentient beings with great generosity and skillfully remove the stain of stinginess, greed, jealousy, and jealousy from sentient beings.",
        "source": "T26n1522_003:0144c22_3"
    },
    {
        "source_sentence": "能以大施攝取眾生者，自行布施善勸他施，攝取眾生善轉眾生慳嫉之垢，方便善巧以四攝法攝取眾生故。",
        "translation": "Those who can take care of sentient beings with great generosity are self-generated and well encourage others to give, taking care of sentient beings and skillfully transforming the stain of stinginess and jealousy in sentient beings because they skillfully and skillfully take care of sentient beings with the four methods of gathering in sentient beings.",
        "source": "T26n1522_003:0144c24_4"
    },
    {
        "source_sentence": "不離念佛等者，示現不離念自利益事。",
        "translation": "Someone who doesn't part from mindfulness of the Buddha and so forth shows self-benefiting things that don't part from mindfulness.",
        "source": "T26n1522_003:0144c27_5"
    },
    {
        "source_sentence": "如是諸念於事中行已，成大恭敬除諸妄想。",
        "translation": "After these thoughts are practiced in terms of things, they become greatly respectful and rid themselves of deluded conceptions.",
        "source": "T26n1522_003:0144c28_6"
    },
    {
        "source_sentence": "此念略有四種：一者上念，念三寶故；",
        "translation": "In sum, these thoughts are of four kinds:",
        "source": "T26n1522_003:0144c29_7"
    },
    {
        "source_sentence": "二者同法念，念諸菩薩故；",
        "translation": "The second is to be mindful of the same doctrine, being mindful of enlightening beings.",
        "source": "T26n1522_003:0145a01_8"
    },
    {
        "source_sentence": "三者功德念，念自身他身菩薩行自體轉勝故；",
        "translation": "The third is mindfulness of virtue, being mindful of one’s own and others’ bodies, because mindfulness of the practice of enlightening beings becomes inherently superior.",
        "source": "T26n1522_003:0145a02_0"
    },
    {
        "source_sentence": "四者求義念，念諸力等此是真實究竟故。",
        "translation": "The fourth is to seek meaningful thoughts, and this is the ultimate in reality because of the powers of mindfulness.",
        "source": "T26n1522_003:0145a03_1"
    },
    {
        "source_sentence": "何者是上念？",
        "translation": "What's superior mindfulness?",
        "source": "T26n1522_003:0145a04_2"
    },
    {
        "source_sentence": "念佛等，念佛法等故。",
        "translation": "mindfulness of buddhas and so forth, because mindfulness of the Buddha's teachings and so forth.",
        "source": "T26n1522_003:0145a04_3"
    },
    {
        "source_sentence": "於施者受者財物及菩提，不生分別不取著故。",
        "translation": "It's because they don't discriminate and don't cling to the property of the donor, the recipient, and enlightenment.",
        "source": "T26n1522_003:0145a04_4"
    },
    {
        "source_sentence": "如是一切所作業中，作者不著、境界不著、作事不著、果報不著，以此一切諸行皆願迴向大菩提故。",
        "translation": "Thus, among all these actions, the author isn't attached, the object isn't attached, the action isn't attached, and the result isn't attached, so all these actions are all vowed to return to great enlightenment.",
        "source": "T26n1522_003:0145a06_0"
    },
    {
        "source_sentence": "為首者，有二種：一者勝首，光明功德故；",
        "translation": "There are two kinds of leaders:",
        "source": "T26n1522_003:0145a08_1"
    },
    {
        "source_sentence": "二者大首，獨無二故。",
        "translation": "The second is the great chief, because there are no two of them alone.",
        "source": "T26n1522_003:0145a09_2"
    },
    {
        "source_sentence": "勝者，有二種：一者妙智，自在勝故；",
        "translation": "There are two kinds of superiority. The first is sublime knowledge, because it freely excels.",
        "source": "T26n1522_003:0145a09_3"
    },
    {
        "source_sentence": "二者微妙，離一切煩惱自在勝故。",
        "translation": "The second is subtle, because it's free of all afflictions and unimpededly superior.",
        "source": "T26n1522_003:0145a10_4"
    },
    {
        "source_sentence": "大者，有二種：一者上，無與等故；",
        "translation": "“Great” is of two kinds:",
        "source": "T26n1522_003:0145a11_5"
    },
    {
        "source_sentence": "二者無上，無能過故。",
        "translation": "The second is unsurpassed, because there's nothing that can be faulty.",
        "source": "T26n1522_003:0145a12_6"
    },
    {
        "source_sentence": "如是顯示自體功德故。",
        "translation": "It's because they thus show the merit of their own essence.",
        "source": "T26n1522_003:0145a12_7"
    },
    {
        "source_sentence": "導者，於阿含中分別法義正說故。",
        "translation": "Guidance means that the meaning of discriminating dharmas is correctly explained in the Āgamas.",
        "source": "T26n1522_003:0145a13_8"
    },
    {
        "source_sentence": "將者，令他證得義滅諸煩惱故。",
        "translation": "A general is someone who causes others to realize the meaning and extinguishes afflictions.",
        "source": "T26n1522_003:0145a14_0"
    },
    {
        "source_sentence": "師者，教授令入正道故。",
        "translation": "A teacher is someone who teaches and causes people to enter the right path.",
        "source": "T26n1522_003:0145a14_1"
    },
    {
        "source_sentence": "乃至一切智智依止者，以大菩提道教化故。",
        "translation": "It's because the great path of enlightenment teaches and transforms.",
        "source": "T26n1522_003:0145a15_2"
    },
    {
        "source_sentence": "是名在家菩薩攝報果利益勝。",
        "translation": "This is called the superiority of the benefits that a householder bodhisattva receives as retribution.",
        "source": "T26n1522_003:0145a16_3"
    },
    {
        "source_sentence": "復次出家菩薩禪定勝業。",
        "translation": "Furthermore, the renunciant bodhisattva's meditation is superior to karma.",
        "source": "T26n1522_003:0145a17_0"
    },
    {
        "source_sentence": "勝業有二種：一者三昧勝，所謂於一念間得百三昧，得三昧自在力故。",
        "translation": "There are two kinds of superior karma: first, the superiority of samādhi, which is called attaining a hundred samādhis in a single moment of thought because of the mastery of attainment of samādhi.",
        "source": "T26n1522_003:0145a17_1"
    },
    {
        "source_sentence": "二者三昧所作勝，謂見百佛等。",
        "translation": "The second is the superiority of what's done in samādhi, which is to see a hundred buddhas and so forth.",
        "source": "T26n1522_003:0145a19_2"
    },
    {
        "source_sentence": "以得是三昧力故，於十方諸佛及佛所加諸菩薩所修習智慧故。",
        "translation": "Because of the power of attaining this concentration, he cultivates the wisdom cultivated by the buddhas and bodhisattvas in the ten directions who are endowed with it.",
        "source": "T26n1522_003:0145a20_0"
    },
    {
        "source_sentence": "能動百佛世界者，令可化眾生生正信故。",
        "translation": "The one who can move a hundred buddha worlds causes sentient beings to be transformed and give rise to right faith.",
        "source": "T26n1522_003:0145a21_1"
    },
    {
        "source_sentence": "能入百佛世界、能照百佛世界、能教化百佛世界眾生者，往至及見正化眾生故。",
        "translation": "Those who can enter a hundred buddha-realms, illuminate a hundred buddha-realms, and teach sentient beings in a hundred buddha-realms are those who go there and see and correctly transform sentient beings.",
        "source": "T26n1522_003:0145a22_2"
    },
    {
        "source_sentence": "能住壽百劫者，攝取勝生故。",
        "translation": "The one who can abide for the duration of life for one hundred kalpas is because he takes in rebirth by means of superior birth.",
        "source": "T26n1522_003:0145a24_3"
    },
    {
        "source_sentence": "能知過去未來世各百劫事者，化諸眾生作離惡上首，說善惡業道故。",
        "translation": "He who can know the events of each of the past and future hundreds of eons in past and future lives transforms sentient beings to become free of bad leaders because he explains the paths of good and bad actions.",
        "source": "T26n1522_003:0145a25_4"
    },
    {
        "source_sentence": "能善入百法門者，為增長自智慧，思惟種種法門義故。",
        "translation": "Those who can skillfully enter a hundred teachings because they want to increase their own wisdom and contemplate the meaning of various teachings.",
        "source": "T26n1522_003:0145a26_5"
    },
    {
        "source_sentence": "能變身為百，於一一身能示百菩薩以為眷屬者，作多利益速疾行故。",
        "translation": "The transformation body that's capable of transforming is a hundred, and it's because one body can show a hundred bodhisattvas as their retinues in order to perform many benefits and quickly practice.",
        "source": "T26n1522_003:0145a28_6"
    },
    {
        "source_sentence": "云何願智果利益勝？",
        "translation": "What's the superiority of the benefit of the fruit of knowledge of vows?",
        "source": "T26n1522_003:0145a29_7"
    },
    {
        "source_sentence": "經曰：若以願力自在勝上，菩薩願力示現過於此數，示種種神通，或身、或光明、或神通、或眼、或境界、或音聲、或行、或莊嚴、或加、或信、或業，是諸神通乃至無量百千萬億那由他劫不可數知。",
        "translation": "The sūtra says, If a bodhisattva's vow power is superior to the mastery of his vows, and he shows them beyond that number by showing various miraculous abilities, such as body, light, light, vision, eyes, objects, sounds, actions, adornments, embellishments, additions, faith, or actions, these are miraculous abilities up to measureless hundreds of millions of",
        "source": "T26n1522_003:0145b02_0"
    },
    {
        "source_sentence": "論曰：於中身者，是一切菩薩行根本所依故。",
        "translation": "The intermediate body is the fundamental support of all bodhisattva practices.",
        "source": "T26n1522_003:0145b07_0"
    },
    {
        "source_sentence": "依彼身故有光明及神通，依光明有天眼，以有天眼見前境界。",
        "translation": "Depending on that body, there is light and supernormal powers. Depending on light, there is divine vision: because of having divine vision, one sees the former object by means of a divine vision.",
        "source": "T26n1522_003:0145b08_1"
    },
    {
        "source_sentence": "一切眼有五種應知。",
        "translation": "All eyes are five in number:",
        "source": "T26n1522_003:0145b09_2"
    },
    {
        "source_sentence": "依神通有音聲及行莊嚴加等。",
        "translation": "'Relying on the supernormal powers, there are sounds and practices that are adorned and so forth.'",
        "source": "T26n1522_003:0145b10_3"
    },
    {
        "source_sentence": "音聲者，應彼言說故。",
        "translation": "Sound is that which should be spoken of.",
        "source": "T26n1522_003:0145b10_4"
    },
    {
        "source_sentence": "行者，遍至十方故。",
        "translation": "Practitioner: because it reaches everywhere in ten directions.",
        "source": "T26n1522_003:0145b11_5"
    },
    {
        "source_sentence": "莊嚴者，作種種應現故。",
        "translation": "Adorned means to make various kinds of responses.",
        "source": "T26n1522_003:0145b11_6"
    },
    {
        "source_sentence": "加者，神力加彼故。",
        "translation": "“Add”: Because of the spiritual power that adds to it.",
        "source": "T26n1522_003:0145b12_7"
    },
    {
        "source_sentence": "信者，依三昧門現神通力，隨眾生信利益成就故。",
        "translation": "Faith is the manifestation of supernormal powers by relying on the approach of samādhi, because they are accomplished for the benefit of sentient beings according to their faith.",
        "source": "T26n1522_003:0145b12_8"
    },
    {
        "source_sentence": "業者，依慧眼所攝陀羅尼門現說法故。",
        "translation": "Karma, because it's based on the dhāraṇī aspect that's included in the eye of wisdom to presently teach the Dharma.",
        "source": "T26n1522_003:0145b14_0"
    },
    {
        "source_sentence": "略說一切諸地各有因體果相應知。",
        "translation": "It's briefly explained that all the stages each have a causal body and an effect associated with knowing.",
        "source": "T26n1522_003:0145b14_1"
    },
    {
        "source_sentence": "十地經論初歡喜地卷之三",
        "translation": "Daśabhūmika-sūtra Treatise on the First Delightful Land of the Ten Stages, Volume 3",
        "source": "T26n1522_003:0145b16_0"
    }
]