[
    {
        "source_sentence": "十地經論難勝地第五卷之七",
        "translation": "Daśabhūmika-sūtra Treatise on the Ten Stages, Volume 5, Part 7 of the Fifth Fascicle",
        "source": "T26n1522_007:0163a04_0"
    },
    {
        "source_sentence": "天親菩薩造",
        "translation": "created by gods and bodhisattvas",
        "source": "T26n1522_007:0163a06_0"
    },
    {
        "source_sentence": "後魏北印度三藏菩提流支譯",
        "translation": "Latter Wei translation of the Northern India Tripiṭaka, translated by Bodhiruci",
        "source": "T26n1522_007:0163a07_0"
    },
    {
        "source_sentence": "論曰：第五地中分別有三：一、勝慢對治；二、不住道行勝；三、彼果勝。",
        "translation": "The treatise says, In the fifth ground, there are three distinctions: 1. the antidote of overweening conceit; 2. the superiority of not abiding in the path and practice;",
        "source": "T26n1522_007:0163a08_0"
    },
    {
        "source_sentence": "云何勝慢對治？",
        "translation": "What's the antidote of overweening conceit?",
        "source": "T26n1522_007:0163a09_1"
    },
    {
        "source_sentence": "經曰：爾時金剛藏菩薩言：諸佛子！",
        "translation": "The sūtra says, It was then that the Vajragarbha Bodhisattva said, Children of the Buddha!",
        "source": "T26n1522_007:0163a10_0"
    },
    {
        "source_sentence": "若菩薩得第四菩薩地善滿諸行已，欲入第五菩薩地，當以十平等深淨心得入第五地。",
        "translation": "If a bodhisattva wants to enter the fifth bodhisattva ground after attaining the fourth bodhisattva ground and well fulfilling his practices, he'll enter the fift",
        "source": "T26n1522_007:0163a10_1"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T26n1522_007:0163a12_2"
    },
    {
        "source_sentence": "一、過去佛法平等深淨心故；二、未來佛法平等深淨心故；三、現在佛法平等深淨心故；四、戒淨平等深淨心故；五、心淨平等深淨心故；六、除見疑悔淨平等深淨心故；七、道非道智淨平等深淨心故；八、行斷智淨平等深淨心故；九、思量一切菩提分法上上淨平等深淨心故；十、化度一切眾生淨平等深淨心故。",
        "translation": "1. the profound mental state of equality and purity of the Buddha's teachings in the past; 2. the profound mental state of equality and purity of the Buddha's teachings in the future",
        "source": "T26n1522_007:0163a13_3"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T26n1522_007:0163a20_4"
    },
    {
        "source_sentence": "菩薩以是十種平等深淨心得入第五菩薩地。",
        "translation": "With these ten kinds of equal and profoundly pure mind, the bodhisattva enters the fifth bodhisattva ground.",
        "source": "T26n1522_007:0163a20_5"
    },
    {
        "source_sentence": "論曰：勝慢對治者，謂十平等深淨心，同念不退轉心故。",
        "translation": "The antidote of overweening pride is the ten equal and deeply pure states of mind, because they are the same as mindfulness and not regressing from mindfulness.",
        "source": "T26n1522_007:0163a22_0"
    },
    {
        "source_sentence": "前已說解法慢對治，今此地中說身淨分別慢對治。",
        "translation": "The antidote for conceit regarding the understanding of dharmas has already been spoken of. Now, in this stage, the antidote for conceit regarding bodily cleanliness and discrimination is spoke",
        "source": "T26n1522_007:0163a23_1"
    },
    {
        "source_sentence": "是中平等深淨心者，於平等中心得清淨。",
        "translation": "This is the profound and pure mind of equality, which attains purity in the center of equality.",
        "source": "T26n1522_007:0163a24_2"
    },
    {
        "source_sentence": "此深淨心分別有十種。",
        "translation": "There are ten kinds of distinctions in this profoundly pure mind.",
        "source": "T26n1522_007:0163a25_3"
    },
    {
        "source_sentence": "十種深淨心者，是諸佛法及隨順諸佛法，彼分別應知。",
        "translation": "The ten kinds of profound clean awarenesses are the Buddha-teachings and the doctrine that follows them. These should be known separately.",
        "source": "T26n1522_007:0163a26_4"
    },
    {
        "source_sentence": "何者是諸佛法？",
        "translation": "What are the buddha-teachings?",
        "source": "T26n1522_007:0163a27_5"
    },
    {
        "source_sentence": "謂三世力等，如經「過去佛法平等深淨心故、未來佛法平等深淨心故、現在佛法平等深淨心故」。",
        "translation": "They are the three worldly powers and so forth, as the sūtra says, It's because of the equality and profound purity of the Buddha's teachings in the past, the e",
        "source": "T26n1522_007:0163a27_6"
    },
    {
        "source_sentence": "如是三世佛法力等已說，次說隨順諸佛法。",
        "translation": "Thus, these are the powers of the teachings of the buddhas of the three times that have been explained, and so forth, and then we'll explain following the teachings of the buddhas.",
        "source": "T26n1522_007:0163a29_7"
    },
    {
        "source_sentence": "彼諸佛法云何得成？",
        "translation": "How can those buddha-teachings be accomplished?",
        "source": "T26n1522_007:0163b01_8"
    },
    {
        "source_sentence": "因戒定智及化眾生故。",
        "translation": "It's because of morality, concentration, wisdom, and the transformation of sentient beings.",
        "source": "T26n1522_007:0163b02_9"
    },
    {
        "source_sentence": "是中依戒淨，如經「戒淨平等深淨心故」。",
        "translation": "Here, it's based on the purity of precepts, as the sūtra says, It's because the purity of precepts is equally profound and pure in mind.",
        "source": "T26n1522_007:0163b03_0"
    },
    {
        "source_sentence": "依定淨，如經「心淨平等深淨心故」。",
        "translation": "Relying on the purity of concentration, as the sūtra says, The mind is pure because it's equal and profoundly pure.",
        "source": "T26n1522_007:0163b03_1"
    },
    {
        "source_sentence": "依智淨，如經「除見疑悔淨平等深淨心故、道非道智淨平等深淨心故、行斷智淨平等深淨心故、思量一切菩提分法上上淨平等深淨心故」。",
        "translation": "Relying on the purity of cognition, as the sūtra says, It's because the mind is equally and profoundly pure in terms of the purity of seeing doubt and remorse, the",
        "source": "T26n1522_007:0163b04_2"
    },
    {
        "source_sentence": "是中行斷智者，思量一切菩提分法上上轉勝故，依教化眾生，如經「化度一切眾生淨平等深淨心故」。",
        "translation": "This is the knowledge of practice and cessation because it's superior to the contemplation of all the factors of enlightenment, based on the teaching and transforming sentient beings, as the sūtra",
        "source": "T26n1522_007:0163b07_3"
    },
    {
        "source_sentence": "經曰：諸佛子！",
        "translation": "The sūtra says, Children of the Buddha!",
        "source": "T26n1522_007:0163b11_0"
    },
    {
        "source_sentence": "是菩薩住第五菩薩地已，善修行菩提分法故、善深淨心故、轉求上勝行故、隨順如道行故、得大願力故、以慈悲心不捨一切眾生故、修習功德智慧行故、不休息諸行故、起方便善巧故、照見上上地故、正受如來加故、得念意去智力故、成就不退轉心故。",
        "translation": "This bodhisattva abides in the fifth bodhisattva ground because he well cultivates the factors of enlightenment, good and deeply pure minds, turns to seeking superior practices",
        "source": "T26n1522_007:0163b11_1"
    },
    {
        "source_sentence": "論曰：是中善修行菩提分法，乃至隨順如道行者，皆是正修諸行。",
        "translation": "The treatise says, These are the factors of enlightenment that are well cultivated, and even those who practice according to the path are all correctly cultivating their practices.",
        "source": "T26n1522_007:0163b18_0"
    },
    {
        "source_sentence": "善修行菩提分法者，第四菩薩地中修菩提分法善清淨深心故，彼深淨心等悕求勝行，如是不住道行勝，破彼慢故。",
        "translation": "Those who skillfully cultivate the factors of enlightenment are those who cultivate the factors of enlightenment in the fourth bodhisattva ground because their mind is well-purified and profound",
        "source": "T26n1522_007:0163b19_1"
    },
    {
        "source_sentence": "隨順如道行者，彼平等中深淨心不退轉心現成就故，隨彼平等清淨法住，如是菩薩深心安住名為隨順如道行故。",
        "translation": "Those who follow the practice of the path because their profoundly pure mind in equality and non-backsliding mind are now accomplished, and they follow their equally pure dharmas to abide,",
        "source": "T26n1522_007:0163b22_2"
    },
    {
        "source_sentence": "是中隨順如道行有八種：一、修習菩提心，如經「得大願力故」。",
        "translation": "Here, there are eight kinds of practices that follow the path: 1. cultivating the mind of enlightenment, as the sūtra says, because they attain the power of the great vow.",
        "source": "T26n1522_007:0163b24_3"
    },
    {
        "source_sentence": "二、不疲惓，如經「以慈悲心不捨一切眾生故」。",
        "translation": "2. not being weary, as the sūtra says, Because he doesn't abandon all sentient beings with compassion.",
        "source": "T26n1522_007:0163b26_4"
    },
    {
        "source_sentence": "三、得善根力，如經「修習功德智慧行故」。",
        "translation": "3. attaining the power of the good roots, as the sūtra says, Because they cultivate the practice of merit and wisdom.",
        "source": "T26n1522_007:0163b27_5"
    },
    {
        "source_sentence": "四、不捨眾行，如經「不休息諸行故」。",
        "translation": "4. not abandoning all practices, as the sūtra says, It's because he doesn't rest from his practices.",
        "source": "T26n1522_007:0163b28_6"
    },
    {
        "source_sentence": "五、正修行，如經「起方便善巧故」。",
        "translation": "5. correct cultivation, as the sūtra says, because it gives rise to skillful means.",
        "source": "T26n1522_007:0163b29_7"
    },
    {
        "source_sentence": "六、無厭足，如經「照見上上地故」。",
        "translation": "6. not being satisfied, as the sūtra says, It's because they illuminate the higher and higher stages.",
        "source": "T26n1522_007:0163b29_8"
    },
    {
        "source_sentence": "七、得他勝力，如經「正受如來加故」。",
        "translation": "7. attaining the superior power of others, as the sūtra says, It's because they are directly subject to the Tathāgata's empowerment.",
        "source": "T26n1522_007:0163c01_9"
    },
    {
        "source_sentence": "八、自身得勝力故、勝念等三慧故，如經「得念意去智力故，成就不退轉心故」。",
        "translation": "8. It's because they themselves have attained superior power and superior mindfulness and the other three kinds of wisdom, as the sūtra says, Because they attain mindfulness and remove the power of cognition, they accomplish",
        "source": "T26n1522_007:0163c02_10"
    },
    {
        "source_sentence": "去者，修慧觀，無障礙義故。",
        "translation": "“Departing”: because when practising wisdom and contemplation, there is the meaning of being without obstruction.",
        "source": "T26n1522_007:0163c04_11"
    },
    {
        "source_sentence": "云何不住道行勝？",
        "translation": "How is the practice of not abiding in the path superior?",
        "source": "T26n1522_007:0163c04_12"
    },
    {
        "source_sentence": "不住道行勝有二種觀：一、所知法中智清淨勝；二、利益眾生勤方便勝。",
        "translation": "There are two kinds of contemplation that don't abide in the practice of the path: 1. the superiority of knowledge and purity in knowing dharmas; and 2. the superiority of diligent effort for",
        "source": "T26n1522_007:0163c05_13"
    },
    {
        "source_sentence": "以是二法故，不住世間不住涅槃。",
        "translation": "Because of these two things, they don't abide in the world and don't abide in nirvāṇa.",
        "source": "T26n1522_007:0163c06_14"
    },
    {
        "source_sentence": "云何所知法中智清淨勝？",
        "translation": "What is the superiority of the purity of knowledge among the knowables?",
        "source": "T26n1522_007:0163c07_15"
    },
    {
        "source_sentence": "經曰：是菩薩如實知，是苦聖諦、是苦集諦、是苦滅諦，如實知是至滅苦道聖諦。",
        "translation": "The sūtra says, This is the true knowledge of bodhisattvas that this is the noble truth of suffering, the truth of suffering's accumulation, and the truth of suffering's cessation,",
        "source": "T26n1522_007:0163c09_0"
    },
    {
        "source_sentence": "是菩薩善知世諦、善知第一義諦、善知相諦、善知差別諦、善知說成諦、善知事諦、善知生諦、善知盡無生智諦、善知令入道智諦、善知一切菩薩地次第成就諦，及善知集如來智諦。",
        "translation": "This is the bodhisattva who well knows the conventional truth, well knows the ultimate truth, well knows the mark truth, well knows the differentiation truth, well knows the accomplishment truth, well knows the",
        "source": "T26n1522_007:0163c10_1"
    },
    {
        "source_sentence": "是菩薩隨眾生意令歡喜故，善知世諦，通達一切法一相故。",
        "translation": "Because this bodhisattva follows the business of making sentient beings rejoice, he well knows the conventional truth and comprehends all dharmas as one characteristic.",
        "source": "T26n1522_007:0163c15_0"
    },
    {
        "source_sentence": "善知第一義諦，覺法自相同相故。",
        "translation": "He well knows the ultimate truth, because he perceives all dharmas with the same distinctive characteristics.",
        "source": "T26n1522_007:0163c16_1"
    },
    {
        "source_sentence": "善知相諦，覺法差別故。",
        "translation": "They know well the truth of characteristics, because they perceive distinctions in phenomena.",
        "source": "T26n1522_007:0163c17_2"
    },
    {
        "source_sentence": "善知差別諦，覺分別陰界入故。",
        "translation": "He well knows the truth of distinctions, because he perceives the discriminating aggregates, elements, and sense-fields.",
        "source": "T26n1522_007:0163c17_3"
    },
    {
        "source_sentence": "善知說成諦，覺身心苦惱故。",
        "translation": "He well knows and explains the accomplishment of truth because he perceives suffering in body and mind.",
        "source": "T26n1522_007:0163c18_4"
    },
    {
        "source_sentence": "善知事諦，覺諸道生相續故。",
        "translation": "He well knows the facts and truths, because he perceives the paths that arise in succession.",
        "source": "T26n1522_007:0163c19_5"
    },
    {
        "source_sentence": "善知生諦，畢竟滅一切熱惱故。",
        "translation": "He well knows the truth of arising, which ultimately extinguishes all feverishable afflictions.",
        "source": "T26n1522_007:0163c19_6"
    },
    {
        "source_sentence": "善知盡無生智諦，起不二行故。",
        "translation": "He well knows the truth of the knowledge of the exhaustion of nonorigination because he gives rise to the practice of nonduality.",
        "source": "T26n1522_007:0163c20_7"
    },
    {
        "source_sentence": "善知令入道智諦，正覺一切法相故。",
        "translation": "He well knows and causes them to enter the truth of knowledge of the path because he correctly perceives all the characteristics of dharmas.",
        "source": "T26n1522_007:0163c21_8"
    },
    {
        "source_sentence": "善知一切菩薩地次第成就諦，及善知集如來智諦，以信解力故。",
        "translation": "He well knows all the truths of the sequential accomplishment of all bodhisattva stages and well knows the truth of the Tathāgata's knowledge of accumulation because of the power of faith and understanding",
        "source": "T26n1522_007:0163c22_9"
    },
    {
        "source_sentence": "知非得一切究竟智知。",
        "translation": "He knows that he doesn't attain the knowledge of all ultimate cognitions.",
        "source": "T26n1522_007:0163c23_10"
    },
    {
        "source_sentence": "論曰：彼所知法中智清淨勝有二種：一、實法分別，如實知四諦，如經「是菩薩如實知苦聖諦乃至如實知至滅苦道聖諦」故。",
        "translation": "The treatise says, Among the known dharmas, there are two kinds of knowledge that's pure and superior: 1. discernment of real dharmas and knowing the four truths as they really are",
        "source": "T26n1522_007:0163c25_0"
    },
    {
        "source_sentence": "二、化眾生方便差別，十諦差別方便智，如經「是菩薩善知世諦乃至及善知集如來智諦」故。",
        "translation": "2. the distinction in skillful means for transforming sentient beings and the distinction in skillful means for the ten truths, as shown in the sūtra, This is because bodhisattvas well know",
        "source": "T26n1522_007:0163c27_1"
    },
    {
        "source_sentence": "是中實法分別者，有佛無佛苦集二諦果因差別體是妄想染故，滅道二諦果因差別體是淨法故。",
        "translation": "These are the real dharmas that are discriminated because the distinctive essence of the causes of the results of the two truths of buddhahood and non-buddha, suffering and arising are deluded",
        "source": "T26n1522_007:0163c29_2"
    },
    {
        "source_sentence": "化眾生方便差別者，所化眾生差別故，方便差別應知。",
        "translation": "The difference in the means for converting beings is because of the difference in the beings that are converted. The difference in the means should be known.",
        "source": "T26n1522_007:0164a03_3"
    },
    {
        "source_sentence": "所化眾生有七種，小乘可化有六種：一、為根未熟眾生故，知世諦方便。",
        "translation": "There are seven kinds of sentient beings to be transformed, and there are six kinds that can be transformed by the lesser vehicle: 1. They know the conventional truth for the sake of sentient",
        "source": "T26n1522_007:0164a04_4"
    },
    {
        "source_sentence": "二、為根熟眾生故，知第一義諦方便。",
        "translation": "2. for the sake of sentient beings whose faculties are ripe, they know the method of the ultimate truth.",
        "source": "T26n1522_007:0164a06_0"
    },
    {
        "source_sentence": "三、為疑惑深法眾生故，知相諦方便。",
        "translation": "3. It's the method of knowing the truth of characteristics for the sake of sentient beings who doubt the profound teaching.",
        "source": "T26n1522_007:0164a06_1"
    },
    {
        "source_sentence": "四、為謬解迷惑深法眾生故，知差別諦方便。",
        "translation": "4. It's because sentient beings who mistakenly understand and confuse profound dharmas know the method of distinguishing the truths.",
        "source": "T26n1522_007:0164a07_2"
    },
    {
        "source_sentence": "五、為離正念眾生故，知說成諦方便。",
        "translation": "5. For the sake of being free of right mindfulness, they know and explain the method of accomplishing the truths.",
        "source": "T26n1522_007:0164a08_3"
    },
    {
        "source_sentence": "六、為正見眾生義故，知事諦方便、知生諦方便、知盡無生智諦方便、知令入道智諦方便。",
        "translation": "6. For the sake of correctly seeing the meaning of sentient beings, he knows the method of knowing the truth of phenomena, the method of knowing the truth of arising, the method of knowing the method",
        "source": "T26n1522_007:0164a09_4"
    },
    {
        "source_sentence": "事諦等四諦，苦諦等所攝。",
        "translation": "Such four truths as the one of substance and so on, are included in such [things] as the truth of frustration.",
        "source": "T26n1522_007:0164a11_5"
    },
    {
        "source_sentence": "七、為大乘可化眾生故，善知一切菩薩地次第成就諦方便及善知集如來智諦方便。",
        "translation": "7. For the sake of sentient beings who can be transformed by the great vehicle, he well knows the sequential accomplishment of the skillful means of the truths in all bodhisattva stages and",
        "source": "T26n1522_007:0164a12_6"
    },
    {
        "source_sentence": "如經「是菩薩隨眾生意令歡喜故，善知世諦乃至非得一切究竟智知」故。",
        "translation": "As the sūtra says, This is because a bodhisattva follows the business of making people rejoice and well knows the conventional truth up to the point where he doesn't attain the knowledge of",
        "source": "T26n1522_007:0164a14_7"
    },
    {
        "source_sentence": "是中菩薩地次第者，地地中間如自地次第入應知，一切生處身心受苦惱故。",
        "translation": "The succession of these stages of the bodhisattva is that which should be known as entering in succession from one stage to another, because all places of rebirth experience suffering and distress in body and mind",
        "source": "T26n1522_007:0164a16_8"
    },
    {
        "source_sentence": "知事諦苦者，所有受者皆是苦事故。",
        "translation": "“Knowing the fact that things are to be known as frustration”: All that is felt and all that is experienced are unsatisfactory actual entities.",
        "source": "T26n1522_007:0164a18_0"
    },
    {
        "source_sentence": "起不二行者，一行故。",
        "translation": "Those who give rise to the practice of nonduality because it's one practice.",
        "source": "T26n1522_007:0164a18_1"
    },
    {
        "source_sentence": "正覺一切相者，五明論處善巧知故、信解力故。",
        "translation": "Correctly awakening to all characteristics means that the five insights are skillfully known in the treatise place and because of the power of faith and understanding.",
        "source": "T26n1522_007:0164a19_2"
    },
    {
        "source_sentence": "知者，鏡像觀智力，非成就觀智力故。",
        "translation": "“Knowing”: The power knowledge of the contemplation of a mirror image®*! is not because of accomplishing the power knowledge of the contemplation.",
        "source": "T26n1522_007:0164a20_3"
    },
    {
        "source_sentence": "如是所知法中智清淨勝已說，云何利益眾生勤方便勝？",
        "translation": "Thus, what's the superiority of the purity of knowledge among the knowables that's explained, and what's the superiority of diligently applying effort to benefit sentient beings?",
        "source": "T26n1522_007:0164a21_4"
    },
    {
        "source_sentence": "以知一切有為法虛妄相故，起憐愍眾生念。",
        "translation": "Because they know the false characteristics of all conditioned dharmas, they give rise to thoughts of pity for sentient beings.",
        "source": "T26n1522_007:0164a22_5"
    },
    {
        "source_sentence": "經曰：是菩薩如是善起諸諦智已，如實知一切有為行皆是虛妄誑詐誑惑凡夫。",
        "translation": "The sūtra says, After thus skillfully producing the knowledge of the truths, this bodhisattva knows that all conditioned actions are falsely deceptive and confusing to ordinary people.",
        "source": "T26n1522_007:0164a24_0"
    },
    {
        "source_sentence": "菩薩爾時復於眾生中大悲轉勝而現在前，及生大慈光明。",
        "translation": "At that point, the bodhisattva's great compassion turns out to be superior among sentient beings and appears before them, and he produces the light of great compassion.",
        "source": "T26n1522_007:0164a25_1"
    },
    {
        "source_sentence": "論曰：是菩薩如是善起諸諦智已，乃至及生大慈光明者，是中妄想常等不相似無故虛，常作我想慢事故、妄世法盡壞故、誑世法牽取愚癡凡夫故、詐常等相無非有似有故、虛事中意正取我想慢事正取故、妄事是患世法利盡故、誑事牽心世法愚癡凡夫牽取故。",
        "translation": "The treatise says, This is the bodhisattva who thus well-arouses the knowledge of the truths and gives rise to the light of great compassion. These deluded conceptions are always",
        "source": "T26n1522_007:0164a28_0"
    },
    {
        "source_sentence": "詐事相現故言誑惑凡夫，此諸句義應知。",
        "translation": "The meaning of these phrases should be known because they are said to deceive and delude ordinary people.",
        "source": "T26n1522_007:0164b05_1"
    },
    {
        "source_sentence": "凡夫者，依止彼正取我慢身。",
        "translation": "Ordinary people rely on those who correctly grasp the self and conceit body.",
        "source": "T26n1522_007:0164b06_2"
    },
    {
        "source_sentence": "大悲大慈者，憐愍彼眾生。",
        "translation": "Great compassion and great kindness are pitying those sentient beings.",
        "source": "T26n1522_007:0164b06_3"
    },
    {
        "source_sentence": "勝利益示現勝彼前地悲故，言大悲不住，道行勝故。",
        "translation": "Because the superior benefits and manifestations are superior to the compassion of those in the previous stages, it's said that great compassion doesn't abide, because the practice of path is superior.",
        "source": "T26n1522_007:0164b07_4"
    },
    {
        "source_sentence": "救眾生方便智成就故，言大慈光明。",
        "translation": "Because the knowledge of skillful means for saving sentient beings is accomplished, it's called the light of great compassion.",
        "source": "T26n1522_007:0164b08_5"
    },
    {
        "source_sentence": "經曰：是菩薩得如是智慧力，不捨一切眾生，常求佛智慧，如實觀一切有為行先際後際，知諸眾生從先際無明有愛故生，流轉世間歸五陰家，不能動發，增長苦陰聚，是中無我、無壽命、無眾生，離我我所，皆如實知。",
        "translation": "The sūtra says, This bodhisattva attains the power of such wisdom, doesn't abandon all sentient beings, always seeks the Buddha's wisdom, truly observes the prior and subsequent",
        "source": "T26n1522_007:0164b10_0"
    },
    {
        "source_sentence": "後際亦如是。",
        "translation": "The latter part is likewise.",
        "source": "T26n1522_007:0164b15_1"
    },
    {
        "source_sentence": "此無所有虛妄貪著分段盡出有無，皆如實知。",
        "translation": "These nonexistent, falsely attached segments of craving are completely free of existence and nonexistence, and they all know them as they really are.",
        "source": "T26n1522_007:0164b15_2"
    },
    {
        "source_sentence": "論曰：是菩薩得如是智慧力者，如前說。",
        "translation": "This is the bodhisattva who has attained such a power of wisdom, as explained above.",
        "source": "T26n1522_007:0164b17_0"
    },
    {
        "source_sentence": "不捨一切眾生者，大悲大慈光明亦如前說。",
        "translation": "When they don't abandon all sentient beings, the light of great compassion and great compassion is likewise explained as before.",
        "source": "T26n1522_007:0164b17_1"
    },
    {
        "source_sentence": "求佛智慧者，救一切眾生義故。",
        "translation": "Seeking the Buddha's wisdom means saving all sentient beings.",
        "source": "T26n1522_007:0164b19_0"
    },
    {
        "source_sentence": "如實觀一切有為行先際後際者，隨彼大悲觀示二種相：一、如實觀苦因緣集故，如經「知諸眾生從先際無明有愛故生，乃至有無皆如實知」故。",
        "translation": "He who truly observes the prior and subsequent limits of all conditioned actions shows two kinds of characteristics according to that great compassionate contemplation: 1. he truly observes the causes and conditions for suffering",
        "source": "T26n1522_007:0164b19_1"
    },
    {
        "source_sentence": "是中從先際無明有愛故生者，此顯凡夫生，非菩薩生，菩薩以善巧方便生。",
        "translation": "This shows that ordinary people are born, not bodhisattvas who are born because of skillful means for bodhisattvas to be born.",
        "source": "T26n1522_007:0164b23_2"
    },
    {
        "source_sentence": "何故不言餘因緣分？",
        "translation": "Why are the other factors of causality not mentioned?",
        "source": "T26n1522_007:0164b24_3"
    },
    {
        "source_sentence": "無明有愛是有分根本故。",
        "translation": "It's because nescience and craving are the root of existence.",
        "source": "T26n1522_007:0164b25_4"
    },
    {
        "source_sentence": "彼生者，說有三種眾生：欲求眾生、妄梵行求眾生、有求眾生，乃至依有頂五陰苦聚。",
        "translation": "Birth means that there are three kinds of sentient beings: those who want to seek sentient beings, those who falsely practice the path of celibacy, and those who have sought senti",
        "source": "T26n1522_007:0164b26_0"
    },
    {
        "source_sentence": "是無我事，是中自身無我。",
        "translation": "This is the phenomenon of selflessness, which has no self in itself.",
        "source": "T26n1522_007:0164b27_1"
    },
    {
        "source_sentence": "及彼無我事，第一義故無。",
        "translation": "and the dharmas of selflessness, because they are nonexistent in the highest sense.",
        "source": "T26n1522_007:0164b28_2"
    },
    {
        "source_sentence": "然後無我依命根力住數數受生，眾生身心相續非常非斷故，說有命有眾生；破彼慢取意故，說無命無眾生；遠離能取所取我慢意故，說離我我所前際。",
        "translation": "Then, selflessness depends on the power of the vital faculty to abide and repeatedly receive birth, because sentient beings' bodies and minds continue without cessation or discontinu",
        "source": "T26n1522_007:0164b29_3"
    },
    {
        "source_sentence": "以何因隨所有眾生、隨所有苦行？",
        "translation": "What is the cause that follows all sentient beings and all ascetic practices?",
        "source": "T26n1522_007:0164c03_4"
    },
    {
        "source_sentence": "彼正觀已，後際亦如是，隨彼苦因。",
        "translation": "The same applies to the subsequent moments after this meditative attainment: according to the cause of frustration.",
        "source": "T26n1522_007:0164c04_5"
    },
    {
        "source_sentence": "無明愛事盡者名滅，勝世間滅故。",
        "translation": "When the craving for nescience is extinguished, it's called cessation because it's superior to worldly cessation.",
        "source": "T26n1522_007:0164c05_6"
    },
    {
        "source_sentence": "出者名道。",
        "translation": "What comes out is called the path.",
        "source": "T26n1522_007:0164c06_7"
    },
    {
        "source_sentence": "無亦如實知，有亦如實知，是名一種大悲正觀因緣集念如實苦故。",
        "translation": "Nothing is also known as it really is, and existence is also known as it really is, which is called a kind of great compassion that correctly observes the causes and conditions for accumulating mindfulness as they really",
        "source": "T26n1522_007:0164c06_8"
    },
    {
        "source_sentence": "次說第二種大悲正觀深重苦無量世隨逐及種種苦事。",
        "translation": "Next, he explains the second kind of great compassionate correctly observing profound suffering that's immeasurable in terms of worldly pursuits and various painful things.",
        "source": "T26n1522_007:0164c07_9"
    },
    {
        "source_sentence": "經曰：菩薩爾時作如是念：此諸凡夫甚為可怪，愚癡無智，有無量無邊阿僧祇身，已滅、今滅、當滅。",
        "translation": "The sūtra says, At that point, the bodhisattva had this thought, These ordinary people are very strange, foolish and ignorant, with measureless and limitless incalculable bodies that have",
        "source": "T26n1522_007:0164c10_0"
    },
    {
        "source_sentence": "如是盡滅已，不能於身生厭離想，轉更增長機關苦身，常隨世間漂流不能得返，歸五陰舍不能捨離，不畏四大毒蛇，不能拔出我慢見箭，不能滅除貪恚癡火，不能破壞無明黑暗，不能乾竭愛著大河，不求十力大聖導師，常入魔意稠林，於生死海中常為諸惡覺觀所轉。",
        "translation": "Having completely extinguished them, they can't give rise to thoughts of disillusionment and separation in their bodies, develop a painful body that grows more and more powerful, always follows",
        "source": "T26n1522_007:0164c12_1"
    },
    {
        "source_sentence": "論曰：大悲正觀深重苦者，無量世隨逐種種苦故。",
        "translation": "Treatise: Great compassion is the true contemplation of profound suffering because it follows various kinds of suffering for measureless ages.",
        "source": "T26n1522_007:0164c19_0"
    },
    {
        "source_sentence": "有無量無邊阿僧祇身滅者，無量世隨逐故。",
        "translation": "There are immeasurable, boundless, and incalculable cessation of the body because it follows measureless worlds.",
        "source": "T26n1522_007:0164c20_1"
    },
    {
        "source_sentence": "云何種種苦觀？",
        "translation": "What are the various kinds of contemplations of suffering?",
        "source": "T26n1522_007:0164c21_2"
    },
    {
        "source_sentence": "生苦故、彼集故、離彼滅道故。",
        "translation": "It's because suffering arises, because it's accumulated, and because it's free of the path to cessation.",
        "source": "T26n1522_007:0164c21_3"
    },
    {
        "source_sentence": "如是觀老病死，苦故、彼集故、離彼滅道故。",
        "translation": "Thus, they observe old age, illness, and death because of suffering, their accumulation, and the path leading to cessation that's free from them.",
        "source": "T26n1522_007:0164c22_4"
    },
    {
        "source_sentence": "是中此身依因緣有機關苦身者，生苦示現。",
        "translation": "Here, this body depends on causes and conditions to have a mechanical body that's painful because it produces painful manifestations.",
        "source": "T26n1522_007:0164c23_5"
    },
    {
        "source_sentence": "常隨世間漂流不能得返者，集愛示現。",
        "translation": "Those who always follow the world's drift and can't return are shown by accumulating craving.",
        "source": "T26n1522_007:0164c24_6"
    },
    {
        "source_sentence": "歸五陰舍不能捨離者，離彼滅道示現。",
        "translation": "Those who take refuge in the five aggregates and can't abandon them are shown to be free of their path to cessation.",
        "source": "T26n1522_007:0164c25_7"
    },
    {
        "source_sentence": "不畏四大毒蛇者，謂病苦，彼增損生故。",
        "translation": "Those who aren't afraid of the four great poisonous snakes refer to illness and suffering because they increase and decrease birth.",
        "source": "T26n1522_007:0164c26_8"
    },
    {
        "source_sentence": "妄梵行求眾生、欲求眾生受欲者，行惡行者。",
        "translation": "Someone who engages in a false religious practice that seeks sentient beings and wants to seek sentient beings to experience desires, and someone who engages in bad behavior.",
        "source": "T26n1522_007:0164c27_9"
    },
    {
        "source_sentence": "有求眾生者，不能拔出我慢見箭示現。",
        "translation": "Those who seek sentient beings won't be able to remove the arrow of self-conceit and show it.",
        "source": "T26n1522_007:0164c28_10"
    },
    {
        "source_sentence": "不能滅除貪恚癡火，不能破壞無明黑暗，不能乾竭愛著大河。",
        "translation": "They can't extinguish the fire of craving, ill-will, and delusion, destroy the darkness of ignorance, and dry up their craving for the great river.",
        "source": "T26n1522_007:0164c29_11"
    },
    {
        "source_sentence": "如是次第彼集示現。",
        "translation": "Thus, they are shown in order of those collections.",
        "source": "T26n1522_007:0165a01_12"
    },
    {
        "source_sentence": "趣無畏處，不求十力大聖導師，遠離彼滅示現。",
        "translation": "They go to the place of fearlessness, don't seek the great sage guide of the ten powers, and are far removed from their cessation and manifestation.",
        "source": "T26n1522_007:0165a02_13"
    },
    {
        "source_sentence": "常入魔意稠林，隨順怨道，遠離彼道示現。",
        "translation": "He always enters the dense forest of Māra's thoughts, follows the path of enmity, and distances himself from that path to show it.",
        "source": "T26n1522_007:0165a03_14"
    },
    {
        "source_sentence": "於生死海中常為諸惡覺觀所轉者，一切三界心心數相虛妄分別應知。",
        "translation": "In the ocean of birth and death, they're always transformed by bad feelings and contemplations, which should be known as the false discrimination of all the minds and mental numbers in the three realms.",
        "source": "T26n1522_007:0165a04_15"
    },
    {
        "source_sentence": "次說上大慈光明觀行。",
        "translation": "Next, he explains the contemplation practice of the light of great compassion above.",
        "source": "T26n1522_007:0165a06_16"
    },
    {
        "source_sentence": "經曰：我見彼諸眾生受如是苦惱，孤獨無救，無有依者、無有舍者、無有洲者、無究竟者、盲無目者，無明翳藏所纏、愚癡所覆。",
        "translation": "The sūtra says, I see that those sentient beings suffer such pain and suffering, are alone and helpless, lack support, lack shelter, lack a continent, lack the ultimate, are blind and",
        "source": "T26n1522_007:0165a07_0"
    },
    {
        "source_sentence": "為此眾生發如是心：唯我一人獨無等侶，修集功德智慧助道，以是功德智慧助道資糧令一切眾生得住畢竟清淨，乃至使得佛十力無障礙智盡。",
        "translation": "For the sake of these sentient beings, they give rise to this thought: 'I alone am the only one who has no equal, cultivating merit and wisdom that aids in the path, and because of",
        "source": "T26n1522_007:0165a10_0"
    },
    {
        "source_sentence": "論曰：彼受如是苦惱者，如前所說。",
        "translation": "Those who experience this kind of suffering are as has been said previously.",
        "source": "T26n1522_007:0165a14_0"
    },
    {
        "source_sentence": "孤獨者，於彼苦中無救拔故。",
        "translation": "An orphaned person is because there's no salvation in that suffering.",
        "source": "T26n1522_007:0165a14_1"
    },
    {
        "source_sentence": "復次孤獨者，於已受苦未受苦中故。",
        "translation": "“Furthermore, the one who is without companions”: Because of abiding in frustration that has already been felt and in frustration that has not been felt yet.",
        "source": "T26n1522_007:0165a15_2"
    },
    {
        "source_sentence": "言無救無依者，離善知識故。",
        "translation": "Those who say there's no salvation and no support because they're free of good friends.",
        "source": "T26n1522_007:0165a16_3"
    },
    {
        "source_sentence": "言無有舍者，離聞正法故。",
        "translation": "Those who say there's no shelter because they're free of hearing the right teaching.",
        "source": "T26n1522_007:0165a17_4"
    },
    {
        "source_sentence": "言無有洲者，離寂靜思惟故。",
        "translation": "When stating that there are no continents, it's because they're free of quiet contemplation.",
        "source": "T26n1522_007:0165a17_5"
    },
    {
        "source_sentence": "言無究竟者，離於正見故。",
        "translation": "The expression 'without the ultimate' means to be free of right view.",
        "source": "T26n1522_007:0165a18_6"
    },
    {
        "source_sentence": "言盲無目者，彼障諸舊煩惱及客塵煩惱常起邪念，不聞正法等故。",
        "translation": "When stating that it is blind and without eyes, this obstructs the old defilements and the defilements as well as the secondary defilements: because they always give rise to wrong awarenesses",
        "source": "T26n1522_007:0165a19_7"
    },
    {
        "source_sentence": "言無明翳藏所纏愚癡所覆，唯我一人獨無等侶者，顯示勇猛勝事。",
        "translation": "When it's said that I am tethered by the store of ignorance and hindered by folly, only I alone have no equal companions, showing superior courageous deeds.",
        "source": "T26n1522_007:0165a20_8"
    },
    {
        "source_sentence": "修集功德智慧助道者，顯示修行增長，依彼教化眾生作人天因乃至涅槃因故。",
        "translation": "Those who cultivate merit and wisdom that aid in the path show the growth of cultivation because they teach sentient beings to be the causes of humans and gods and even the causes of nirvāṇa based on",
        "source": "T26n1522_007:0165a22_9"
    },
    {
        "source_sentence": "畢竟清淨者，勝世間清淨故。",
        "translation": "It's ultimately pure because it's superior to the worldly purity.",
        "source": "T26n1522_007:0165a24_10"
    },
    {
        "source_sentence": "得佛十力者，降伏諸魔怨故。",
        "translation": "Attaining the Buddha's ten powers is because he subdues Māra's enemies.",
        "source": "T26n1522_007:0165a24_11"
    },
    {
        "source_sentence": "無障礙智盡者，勝聲聞辟支佛淨智故。",
        "translation": "When the unobstructed knowledge is exhausted, it's superior to the pure knowledge of śrāvakas and pratyekbuddhas.",
        "source": "T26n1522_007:0165a25_12"
    },
    {
        "source_sentence": "經曰：菩薩如是善觀起智慧力，所修諸善發願為救一切眾生故、為一切眾生作利益故、為一切眾生得安樂故、愍念一切眾生故、為令一切眾生無苦惱故、為令一切眾生得解脫故、為攝一切眾生故、為一切眾生心清淨故、為調伏一切眾生故，發願為一切眾生令入大涅槃故。",
        "translation": "The sūtra says, Because the bodhisattva thus well observes and produces the power of wisdom, he cultivates good vows to save all sentient beings, for the benefit of all sentient",
        "source": "T26n1522_007:0165a27_0"
    },
    {
        "source_sentence": "論曰：是中善觀起智慧力者，以正觀智調伏眾生故。",
        "translation": "Discourse: This is the power of the wisdom that arises from good contemplation because it correctly observes and disciplines sentient beings with knowledge.",
        "source": "T26n1522_007:0165b05_0"
    },
    {
        "source_sentence": "皆為救度一切眾生者，拔一切苦惱故。",
        "translation": "They are all for the salvation of all sentient beings because they remove all suffering and distress.",
        "source": "T26n1522_007:0165b06_1"
    },
    {
        "source_sentence": "救度有九種：一、住不善眾生令住善法，如經「為一切眾生作利益故」。",
        "translation": "There are nine kinds of salvation: 1. Abiding in unskillful sentient beings and causing them to abide in good qualities, as the sūtra says, It's for the benefit of",
        "source": "T26n1522_007:0165b07_2"
    },
    {
        "source_sentence": "二、住善法眾生令得樂果，如經「為一切眾生得安樂故」。",
        "translation": "2. to cause sentient beings who abide in good qualities to attain the fruit of happiness, as the sūtra says, It's because all sentient beings attain well-being.",
        "source": "T26n1522_007:0165b08_3"
    },
    {
        "source_sentence": "三、住貧乏眾生與一切資生之具，如經「愍念一切眾生故」。",
        "translation": "3. Those who live in poverty give all necessities to sentient beings, as the sūtra says, Because they are compassionate and mindful of all sentient beings.",
        "source": "T26n1522_007:0165b10_4"
    },
    {
        "source_sentence": "四、住病苦及諸外緣所惱眾生皆令除斷，如經「為令一切眾生無苦惱故」。",
        "translation": "4. He causes all the sentient beings who abide in illness, suffering, and those afflicted by external conditions to be removed, as the sūtra says, It's because he wants to cause all senti",
        "source": "T26n1522_007:0165b11_5"
    },
    {
        "source_sentence": "五、世間繫閉眾生令得出離，如經「為令一切眾生得解脫故」。",
        "translation": "5. The sūtra says, It's for the sake of enabling all sentient beings to attain liberation that the world shuts off sentient beings and causes them to escape.",
        "source": "T26n1522_007:0165b13_6"
    },
    {
        "source_sentence": "有四種相令諸外道信解正法，如經「為攝一切眾生故」。",
        "translation": "There are four kinds of characteristics that cause non-Buddhists to believe and understand the right teaching, as the sūtra says, For the sake of taking in all sentient beings.",
        "source": "T26n1522_007:0165b14_7"
    },
    {
        "source_sentence": "疑惑眾生善決定斷疑，如經「為一切眾生心清淨故」。",
        "translation": "Sentient beings who doubt and doubt are well-determined to resolve doubts, as the sūtra says, For the sake of purifying the minds of all sentient beings.",
        "source": "T26n1522_007:0165b15_8"
    },
    {
        "source_sentence": "已住決定眾生勸修三學，如經「為調伏一切眾生故」。",
        "translation": "Those who have already abided in certainty are encouraged to cultivate the three disciplines, as the sūtra says, For the sake of taming all sentient beings.",
        "source": "T26n1522_007:0165b17_9"
    },
    {
        "source_sentence": "已住三學眾生令得涅槃，如經「發願為一切眾生令入大涅槃故」。",
        "translation": "Those who have abided in the three disciplines will cause sentient beings to attain nirvāṇa, as the sūtra says, It's because they make a vow for all sentient beings",
        "source": "T26n1522_007:0165b18_10"
    },
    {
        "source_sentence": "此九種救苦中，初二句為救未來，餘句為救現在亦救未來。",
        "translation": "Of these nine kinds of salvation from suffering, the first two sentences are for salvation in the future; the other sentences are for salvation in the present and also for salvation in the future.",
        "source": "T26n1522_007:0165b19_11"
    },
    {
        "source_sentence": "是名不住道修行勝。",
        "translation": "This is called the superiority of cultivating practice that doesn't abide in the path.",
        "source": "T26n1522_007:0165b21_12"
    },
    {
        "source_sentence": "次說不住道修行勝果。",
        "translation": "Next, it's said that he doesn't abide in the path and cultivates the superior result.",
        "source": "T26n1522_007:0165b21_13"
    },
    {
        "source_sentence": "有四種相：一、攝功德勝；二、修行勝；三、教化眾生勝；四、起隨順世間智勝。",
        "translation": "There are four kinds of characteristics: 1. the superiority of gathering merit; 2. the superiority of cultivating practice; 3. the superiority of teaching sentient beings; and 4. the superiority",
        "source": "T26n1522_007:0165b22_14"
    },
    {
        "source_sentence": "云何攝功德勝？",
        "translation": "What's the superiority of gathering merit?",
        "source": "T26n1522_007:0165b24_0"
    },
    {
        "source_sentence": "攝聞戒智勝故。",
        "translation": "It's because the wisdom of collecting what's heard and observing precepts is superior.",
        "source": "T26n1522_007:0165b24_1"
    },
    {
        "source_sentence": "經曰：是菩薩住此第五菩薩難勝地已，名為念者，不忘諸法故。",
        "translation": "The sūtra says, This is called mindfulness when a bodhisattva abides in this fifth bodhisattva's difficulty overcoming ground and doesn't forget the teachings.",
        "source": "T26n1522_007:0165b25_0"
    },
    {
        "source_sentence": "名為意者，善決定智慧故。",
        "translation": "It's called mind because it's well-determined wisdom.",
        "source": "T26n1522_007:0165b26_1"
    },
    {
        "source_sentence": "名為去者，知經書意次第故。",
        "translation": "It's called going because it knows the order of the meaning of the sūtras and books.",
        "source": "T26n1522_007:0165b27_2"
    },
    {
        "source_sentence": "名為有慚愧者，自護護彼故。",
        "translation": "It's called someone with shame because they protect themselves and guard others.",
        "source": "T26n1522_007:0165b27_3"
    },
    {
        "source_sentence": "名為堅心者，不捨持戒行故。",
        "translation": "It's called a resolute mind because it doesn't abandon the practice of observing precepts.",
        "source": "T26n1522_007:0165b28_4"
    },
    {
        "source_sentence": "名為覺者，善思惟是處非處故。",
        "translation": "It's called awakening because it well contemplates what's a place and what's not a place.",
        "source": "T26n1522_007:0165b29_5"
    },
    {
        "source_sentence": "名為隨智者，不隨他故。",
        "translation": "It's called following knowledge because it doesn't follow others.",
        "source": "T26n1522_007:0165b29_6"
    },
    {
        "source_sentence": "名為隨慧者，善分別諸法章句是義非義故。",
        "translation": "It's called following wisdom because it skillfully discerns the meaning and non-meaning of the words of the teachings.",
        "source": "T26n1522_007:0165c01_7"
    },
    {
        "source_sentence": "名為得神通者，善修禪定故。",
        "translation": "It's called someone who has attained supernormal abilities because they skillfully cultivate meditation.",
        "source": "T26n1522_007:0165c02_8"
    },
    {
        "source_sentence": "名為善方便者，隨世間法行故。",
        "translation": "It's called good skillful means because it follows the practice of worldly dharmas.",
        "source": "T26n1522_007:0165c03_9"
    },
    {
        "source_sentence": "論曰：攝聞勝者，攝聞思修慧勝故。",
        "translation": "The one who collects what is heard is superior because he collects what is heard, what is reflected upon and what is developed by wisdom.",
        "source": "T26n1522_007:0165c05_0"
    },
    {
        "source_sentence": "云何慧勝？",
        "translation": "What is the superiority of wisdom?",
        "source": "T26n1522_007:0165c05_1"
    },
    {
        "source_sentence": "如經「名為念者，不忘諸法故。",
        "translation": "As the sūtra says, It's called mindfulness because he doesn't forget the teachings.",
        "source": "T26n1522_007:0165c06_2"
    },
    {
        "source_sentence": "名為意者，善決定智慧故。",
        "translation": "It's called mind because it's well-determined wisdom.",
        "source": "T26n1522_007:0165c06_3"
    },
    {
        "source_sentence": "名為去者，知經書意次第故」。",
        "translation": "It's called going because it knows the order of the meaning of the sūtras and books.",
        "source": "T26n1522_007:0165c07_4"
    },
    {
        "source_sentence": "是中念者，聞慧勝故。",
        "translation": "This is mindfulness because the wisdom of hearing is superior.",
        "source": "T26n1522_007:0165c08_5"
    },
    {
        "source_sentence": "意者，思慧勝故。",
        "translation": "“ manas”: Because volition and wisdom are superior.",
        "source": "T26n1522_007:0165c08_6"
    },
    {
        "source_sentence": "去者，修慧勝故。",
        "translation": "“Departing”: Because of the superiority of spiritual practice and wisdom.",
        "source": "T26n1522_007:0165c08_7"
    },
    {
        "source_sentence": "此諸句次第復有異釋：聞持勝故名為念者，法智甚深勝故名為意者，意甚深智勝故名為去者，此略說成就二種善巧法善巧義善巧故。",
        "translation": "The succession of these sentences has another different interpretation: because they are superior in hearing and maintaining, they're called mindfulness; because their knowledge of the teaching is so profound, they're called mind; and",
        "source": "T26n1522_007:0165c09_8"
    },
    {
        "source_sentence": "戒攝勝者有二種：忍辱柔和勝，及戒無缺勝。",
        "translation": "There are two kinds of superiority in terms of gathering in precepts: the superiority of patience and gentleness, and the superiority of morality without fail.",
        "source": "T26n1522_007:0165c12_9"
    },
    {
        "source_sentence": "如經「名為有慚愧者，自護護彼故。",
        "translation": "As the sūtra says, It's called having shame because it protects itself and protects others.",
        "source": "T26n1522_007:0165c13_10"
    },
    {
        "source_sentence": "名為堅心者，不捨持戒行故」。",
        "translation": "It's called a resolute mind because it doesn't abandon the practice of observing precepts.",
        "source": "T26n1522_007:0165c14_11"
    },
    {
        "source_sentence": "攝智勝者有五種：一者因緣集智，無因顛倒因邪見對治，如經「名為覺者，善思惟是處非處故」。",
        "translation": "There are five kinds of superiority in gathering cognition: 1. knowledge of the accumulation of causes and conditions, which is the antidote for mistaken views without causes and mistaken causes, as the",
        "source": "T26n1522_007:0165c14_12"
    },
    {
        "source_sentence": "二者證智，魔事對治，如經「名為隨智者，不隨他故」。",
        "translation": "The second is the knowledge of realization, which is the antidote for Māra's deeds, as the sūtra says, It's called following knowledge because it doesn't follow others.",
        "source": "T26n1522_007:0165c17_13"
    },
    {
        "source_sentence": "三者知妄說智，異說對治，善知是句義非句義雜句義，如經「名為隨慧者，善分別諸法章句是義非義故」。",
        "translation": "The third is the knowledge of knowing falsely explained cognition and the antidote of dissimilar explanations, which well knows what's the meaning of phrases and what's not the meaning of phrases",
        "source": "T26n1522_007:0165c18_14"
    },
    {
        "source_sentence": "四者神力智，邪歸依行對治，如經「名為得神通者，善修禪定故」。",
        "translation": "The fourth is the knowledge of supernormal powers, which is the antidote for wrong refuge and practice, as the sūtra says, It's called attaining supernormal abilities because it's",
        "source": "T26n1522_007:0165c20_15"
    },
    {
        "source_sentence": "五者化眾生智，方便攝取故，如經「名為善方便者，隨世間法行故」。",
        "translation": "The fifth is the knowledge of transforming sentient beings because it's collected by skillful means, as the sūtra says, It's called good skillful means because it follows the world",
        "source": "T26n1522_007:0165c22_16"
    },
    {
        "source_sentence": "是名攝功德勝。",
        "translation": "This is called the superiority of gathering merit.",
        "source": "T26n1522_007:0165c23_17"
    },
    {
        "source_sentence": "云何修行勝？",
        "translation": "What's the superiority of cultivation?",
        "source": "T26n1522_007:0165c24_18"
    },
    {
        "source_sentence": "經曰：名為無厭足者，善集功德行助道故。",
        "translation": "The sūtra says, It's called having no weariness because it's the practice of skillfully gathering merit and virtue that helps the path.",
        "source": "T26n1522_007:0165c25_0"
    },
    {
        "source_sentence": "名為不休息精進者，常求智慧行助道故。",
        "translation": "It's called someone who doesn't rest and makes effort because they always seek wisdom and practice as an aid to the path.",
        "source": "T26n1522_007:0165c26_1"
    },
    {
        "source_sentence": "名為無疲惓者，集大慈悲行助道故。",
        "translation": "It's called tireless because it collects the practice of great compassion and pity that aids in the path.",
        "source": "T26n1522_007:0165c27_2"
    },
    {
        "source_sentence": "名為常念佛法者，求佛十力、四無所畏、十八不共佛法故。",
        "translation": "It's called someone who always mindful of the Buddha's teaching because they seek the Buddha's ten powers, four fearlessnesses, and 18 unique buddha-teachings.",
        "source": "T26n1522_007:0165c28_0"
    },
    {
        "source_sentence": "名為善念修行者，起莊嚴佛國故。",
        "translation": "It's called the practice of good mindfulness because it gives rise to the adornment of the Buddha's land.",
        "source": "T26n1522_007:0165c29_1"
    },
    {
        "source_sentence": "名為具足修行種種善業者，集三十二相八十種好故。",
        "translation": "It's called fully cultivating various good actions, because it collects the thirty-two characteristics and eighty kinds of beauty.",
        "source": "T26n1522_007:0166a01_2"
    },
    {
        "source_sentence": "名為常行精進者，求莊嚴佛身口意故。",
        "translation": "It's called someone who always practices effort because they seek to adorn the Buddha's body, speech, and mind.",
        "source": "T26n1522_007:0166a02_3"
    },
    {
        "source_sentence": "名為樂大恭敬法者，親近供養一切菩薩及法師故。",
        "translation": "They're called those who delight in great respect for the Dharma because they're intimate with and offer support to all bodhisattvas and teachers of the Dharma.",
        "source": "T26n1522_007:0166a03_4"
    },
    {
        "source_sentence": "名為善起願自在者，大方便善入世間故。",
        "translation": "It's called well-arisen vow mastery because it's a great method of skillfully entering the world.",
        "source": "T26n1522_007:0166a04_5"
    },
    {
        "source_sentence": "名為日夜遠離餘心者，常樂教化一切眾生故。",
        "translation": "It's called being far removed from other minds day and night because it always delights in teaching all sentient beings.",
        "source": "T26n1522_007:0166a05_6"
    },
    {
        "source_sentence": "論曰：是中修行勝有十種：一、增長因行，如經「名為無厭足者，善集功德行助道故」。",
        "translation": "The treatise says, Here, there are ten kinds of superiority in cultivation: 1. growing causes and actions, as the sūtra says, Being called unsatisfied because he well gathers merit",
        "source": "T26n1522_007:0166a07_0"
    },
    {
        "source_sentence": "二、依止因行，如經「名為不休息精進者，常求智慧行助道故」。",
        "translation": "2. relying on causal practice, as the sūtra says, This is called someone who doesn't rest and makes effort because they always seek wisdom and practice to assist the path.",
        "source": "T26n1522_007:0166a08_1"
    },
    {
        "source_sentence": "三、化眾生不疲惓行，如經「名為無疲惓者，集大慈悲行助道故」。",
        "translation": "3. the practice of transforming sentient beings without weariness, as the sūtra says, He's called one who doesn't weariness because he gathers great compassionate actions to help",
        "source": "T26n1522_007:0166a10_2"
    },
    {
        "source_sentence": "四、起佛法行，如經「名為常念佛法者，求佛十力、四無所畏、十八不共佛法故」。",
        "translation": "4. to give rise to the practice of the Buddha's teaching, as the sūtra says, This is called someone who always remembers the Buddha's teaching because they seek the Buddha's ten powers",
        "source": "T26n1522_007:0166a11_3"
    },
    {
        "source_sentence": "五、起淨佛國土行，如經「名為善念修行者，起莊嚴佛國故」。",
        "translation": "5. the practice of purifying the Buddha's land, as the sūtra says, This is called a good-minded practitioner because he gives rise to the adornment of the Buddha's land",
        "source": "T26n1522_007:0166a13_4"
    },
    {
        "source_sentence": "云何莊嚴？",
        "translation": "What are their adornments?",
        "source": "T26n1522_007:0166a14_5"
    },
    {
        "source_sentence": "無煩惱染得堅固智慧，眾生住在其中及佛法莊嚴故。",
        "translation": "The absence of afflictive defilement attains resolute wisdom, because sentient beings live there and the Buddha's teachings are adorned.",
        "source": "T26n1522_007:0166a15_6"
    },
    {
        "source_sentence": "六、依佛法身起行，如經「名為具足修行種種善業者，集三十二相八十種好故」。",
        "translation": "6. Relying on the Buddha's Dharma body to initiate practice, as the sūtra says, It's called fully cultivating various good actions that gather the thirty-two marks and eight",
        "source": "T26n1522_007:0166a16_7"
    },
    {
        "source_sentence": "七、依佛所作起行，如經「名為常行精進者，求莊嚴佛身口意故」。",
        "translation": "7. Relying on what the Buddha does to initiate practice, as the sūtra says, It's called constant effort because it seeks to adorn the Buddha's body, speech, and mind.",
        "source": "T26n1522_007:0166a18_8"
    },
    {
        "source_sentence": "八、敬重法行，如經「名為樂大恭敬法者，親近供養一切菩薩及法師故」。",
        "translation": "8. Respectful Dharma practice, as the sūtra says, It's called delighting in great respect for the Dharma because it's intimate with and offering support to all bodhisattvas and teachers of the Dharma",
        "source": "T26n1522_007:0166a19_9"
    },
    {
        "source_sentence": "九、願取有行，如經「名為善起願自在者，大方便善入世間故」。",
        "translation": "Nine, there's practice of grasping to vows, as the sūtra says, This is called well-arisen vow mastery because it's a great method of skillfully entering the world",
        "source": "T26n1522_007:0166a21_10"
    },
    {
        "source_sentence": "十、離小乘心行，如經「名為日夜遠離餘心者，常樂教化一切眾生故」。",
        "translation": "10. Being free of the mind and conduct of the lesser vehicle, as the sūtra says, It's called being free of other minds day and night because it always delights in teaching all sentient",
        "source": "T26n1522_007:0166a22_11"
    },
    {
        "source_sentence": "是名修行勝。",
        "translation": "This is called the superiority of cultivation.",
        "source": "T26n1522_007:0166a24_12"
    },
    {
        "source_sentence": "云何教化眾生勝？",
        "translation": "What's the superiority of teaching sentient beings?",
        "source": "T26n1522_007:0166a24_13"
    },
    {
        "source_sentence": "經曰：是菩薩成就如是行時，以布施教化眾生，又以愛語、利益、同事教化眾生，又以色身示現教化眾生，又以說法教化眾生，又廣示菩薩行神通事教化眾生，又說諸佛大事教化眾生，又示世間過惡教化眾生，又說諸佛智慧利益教化眾生，又現大神通莊嚴相亦說種種行教化眾生。",
        "translation": "The sūtra says, When a bodhisattva accomplishes such practices, he teaches sentient beings with generosity, teaches sentient beings with loving words, benefits, and colleagues, shows",
        "source": "T26n1522_007:0166a26_0"
    },
    {
        "source_sentence": "是菩薩如是教化眾生方便成就，身心常趣佛智而不退失，諸善根行常勤修行轉勝道故。",
        "translation": "Such a bodhisattva thus teaches and transforms sentient beings with skillful means that they always abide in the Buddha's wisdom without retreating, and their good roots and actions always",
        "source": "T26n1522_007:0166b03_1"
    },
    {
        "source_sentence": "論曰：是中教化眾生勝者，以四攝法教化，如經「是菩薩成就如是行時，以布施教化眾生，又以愛語、利益、同事教化眾生」故。",
        "translation": "The treatise says, This is the superiority of teaching and transforming sentient beings because it teaches and transforms by means of the four ways to gather the Dharma, as the sūtra says, When",
        "source": "T26n1522_007:0166b06_0"
    },
    {
        "source_sentence": "為同事隨順眾生應化自眾，如經「又以色身示現教化眾生」故。",
        "translation": "It's because they work together to follow sentient beings and teach themselves, as the sūtra says, Also, by showing their form body, they teach sentient beings.",
        "source": "T26n1522_007:0166b08_1"
    },
    {
        "source_sentence": "為疑惑眾生可說法成就，如經「又以說法教化眾生」故。",
        "translation": "It's because they doubt that sentient beings can teach the Dharma and accomplish it, as the sūtra says, Also, by teaching the Dharma to teach sentient beings.",
        "source": "T26n1522_007:0166b10_2"
    },
    {
        "source_sentence": "為於菩提無方便眾生，如經「又廣示菩薩行神通事教化眾生」故。",
        "translation": "For the sake of enlightenment, there are no skillful sentient beings, as the sūtra says, Furthermore, I'll explain in detail how the bodhisattva practices his super",
        "source": "T26n1522_007:0166b11_3"
    },
    {
        "source_sentence": "為於大乘疲惓眾生，如經「又說諸佛大事教化眾生」故。",
        "translation": "It's because the great vehicle tires sentient beings who are weary, as the sūtra says, Furthermore, he explains the great works of the buddhas to teach sentient beings.",
        "source": "T26n1522_007:0166b13_4"
    },
    {
        "source_sentence": "為樂世間眾生，如經「又示世間過惡教化眾生」故。",
        "translation": "It's for the benefit of sentient beings in the world, as the sūtra says, Furthermore, it shows the world what's wrong with bad teaching and transforming sentient beings.",
        "source": "T26n1522_007:0166b14_5"
    },
    {
        "source_sentence": "為不信大乘眾生，如經「又說諸佛智慧利益教化眾生」故。",
        "translation": "It's because they don't believe in the great vehicle sentient beings, as the sūtra says, Furthermore, it's because they teach and transform sentient beings for the benefit of the",
        "source": "T26n1522_007:0166b15_6"
    },
    {
        "source_sentence": "為無智眾生現神通莊嚴，示種種行，以一身示無量身，如是事令生決定信，如經「又現大神通莊嚴相，亦說種種行教化眾生」故。",
        "translation": "For the sake of ignorant sentient beings who manifest the adornment of supernormal powers, show various practices, and show measureless bodies with one body, such things cause them to give rise to",
        "source": "T26n1522_007:0166b17_7"
    },
    {
        "source_sentence": "是菩薩如是教化眾生方便成就者，如前說。",
        "translation": "This is the bodhisattva who thus accomplishes the skillful means of teaching sentient beings, as explained above.",
        "source": "T26n1522_007:0166b20_8"
    },
    {
        "source_sentence": "身心常趣佛智者，為教化眾生求勝力故。",
        "translation": "Those whose bodies and minds always abide in the Buddha's wisdom are those who teach sentient beings to seek superior strength.",
        "source": "T26n1522_007:0166b21_9"
    },
    {
        "source_sentence": "而不退失諸善根行者，隨所得功德智慧皆不退失故。",
        "translation": "Those who don't regress from the practice of good roots because they don't regress from the merit and wisdom that they attain.",
        "source": "T26n1522_007:0166b22_10"
    },
    {
        "source_sentence": "常勤修行轉勝道者，彼所修諸行欲令增勝故。",
        "translation": "Someone who always diligently cultivates and develops the superior path because they want to make the practices cultivated by them increase.",
        "source": "T26n1522_007:0166b23_11"
    },
    {
        "source_sentence": "是名教化眾生勝。",
        "translation": "This is called the superiority of teaching sentient beings.",
        "source": "T26n1522_007:0166b24_12"
    },
    {
        "source_sentence": "云何起隨順世間智勝染障對治？",
        "translation": "How do they give rise to the antidote for the superior defiled hindrance of following worldly cognition?",
        "source": "T26n1522_007:0166b25_13"
    },
    {
        "source_sentence": "經曰：是菩薩為利益眾生故，善知世間所有書論印算數石性等論、治諸病方，所謂治乾枯病、治顛狂病、治鬼著病、治蠱毒病等，損害眾生者皆悉能治，謂呪藥等。",
        "translation": "The sūtra says, Because it's for the benefit of sentient beings, the bodhisattva well knows all the books and treatises in the world that treat illnesses, such as the Treatise",
        "source": "T26n1522_007:0166b26_0"
    },
    {
        "source_sentence": "作論經書伎樂戲笑歡娛等事，國土城邑、聚落室宅、河泉池流、園觀花果、藥草林樹等，金銀琉璃、摩尼真珠、珊瑚琥珀、車璩馬碯諸寶性等，日月星宿地動夢想吉凶入等遍身諸相，持戒行處、禪定神通、四無量心、四無色定，凡諸不惱眾生事、能利益安樂眾生事，憐愍眾生故出，漸令信入無上佛法故。",
        "translation": "They create treatises, scriptures, books, music, plays, laughter, and amusements, such things as lands, cities, villages, houses, rivers, springs, ponds,",
        "source": "T26n1522_007:0166b29_1"
    },
    {
        "source_sentence": "論曰：隨順世間智者，染障對治，如經「是菩薩為利益眾生故，善知世間所有一切書論」等。",
        "translation": "The treatise says, Consistent with worldly cognition, they are the antidotes to defiled hindrances, as shown in the sūtra, For the sake of benefiting sentient beings",
        "source": "T26n1522_007:0166c08_0"
    },
    {
        "source_sentence": "是中書等有四種障對治。",
        "translation": "These are the four kinds of antidotes to hindrances that are found in the middle way and so forth.",
        "source": "T26n1522_007:0166c10_1"
    },
    {
        "source_sentence": "四種障者：一、所用事中忘障，取與寄付聞法思義，作不作事、已作未作事、應作不應作事，此對治故書。",
        "translation": "The four kinds of obstruction are: 1. the obstruction of forgetfulness regarding things used, which is taking and sending what's meant by hearing the teaching and thinking about it, doing or not doing",
        "source": "T26n1522_007:0166c10_2"
    },
    {
        "source_sentence": "二、邪見軟智障，以因論、聲論對治此二故論。",
        "translation": "2. The weak cognitive hindrance of mistaken views is discussed because the causal theory and the sound theory counteract these two.",
        "source": "T26n1522_007:0166c12_3"
    },
    {
        "source_sentence": "三、所取物不守護障，此對治故印。",
        "translation": "3. The obstacle of not guarding the things that are grasped, which is the antidote for the old mudrā.",
        "source": "T26n1522_007:0166c14_0"
    },
    {
        "source_sentence": "四、取與生疑障，此對治故算數。",
        "translation": "4. The hindrance of grasping and the hindrance of doubt that arises, which are counteracted by calculation.",
        "source": "T26n1522_007:0166c14_1"
    },
    {
        "source_sentence": "數者，一一為二、二二為四如是等。",
        "translation": "“Counting”: The one by one is two; the two by two are four, and so on.",
        "source": "T26n1522_007:0166c15_2"
    },
    {
        "source_sentence": "算者，一縱十橫如是等。",
        "translation": "calculations are one vertical and ten horizontal, such as this.",
        "source": "T26n1522_007:0166c16_3"
    },
    {
        "source_sentence": "石性等論者，貧事障對治故。",
        "translation": "Treatise on the nature of rocks and so on: because they are the antidote for the obstacle of poverty.",
        "source": "T26n1522_007:0166c16_4"
    },
    {
        "source_sentence": "治諸病方者，四大不調眾生毒相，病障對治故。",
        "translation": "Prescriptions for treating illnesses are the poisonous characteristics of the four major unregulated sentient beings, which are the antidotes to the hindrances of illness.",
        "source": "T26n1522_007:0166c17_5"
    },
    {
        "source_sentence": "乾枯顛狂病者，四大不調相故。",
        "translation": "The disease of dryness, witherence and delusion is due to the four major disorders.",
        "source": "T26n1522_007:0166c18_6"
    },
    {
        "source_sentence": "鬼著病等，是眾生相。",
        "translation": "ghosts are attached to illnesses and so forth, which are characteristics of sentient beings.",
        "source": "T26n1522_007:0166c19_7"
    },
    {
        "source_sentence": "蠱毒病者，亦四大不調，亦眾生相病因及死因，此對治謂呪藥等。",
        "translation": "The disease of enchantment and poison is also the cause for the four elements not being disciplined. It is also the cause for the sicknesses and the cause for death that characterize living beings. These",
        "source": "T26n1522_007:0166c19_8"
    },
    {
        "source_sentence": "日月星宿地動夢想吉凶入等遍身諸相者，是中唯有日月等相見故，日等曜等攝故。",
        "translation": "The sun, moon, stars, constellations, earthquakes, dreams, omens, and other characteristics of the whole body are found only in such [things] as the sun and",
        "source": "T26n1522_007:0166c21_9"
    },
    {
        "source_sentence": "入者，入八業果故。",
        "translation": "“Entry”: Because entering is the fruit of eight forms of action.",
        "source": "T26n1522_007:0166c23_10"
    },
    {
        "source_sentence": "遍身諸相者，愛不愛果行故。",
        "translation": "The pervasive characteristic marks of the body: because they act as the fruit of craving and non-craving.",
        "source": "T26n1522_007:0166c23_11"
    },
    {
        "source_sentence": "持戒行處等者，是中持戒行處、禪定神通、四無量心、四無色定等，如是次第破戒染、貪欲染、邪歸依染、妄行功德染、妄修解脫染，如是次第說。",
        "translation": "These are the four immeasurable awarenesses*” and the four formless concentrations. In this way, defilement by moral precept is successively broken; defilement by attachment to sensual pleasure",
        "source": "T26n1522_007:0166c24_12"
    },
    {
        "source_sentence": "如經「石性等論乃至呪藥等」故。",
        "translation": "It's because the sūtra says,石性等論乃至呪藥等等.",
        "source": "T26n1522_007:0166c27_13"
    },
    {
        "source_sentence": "作論經書伎樂戲笑歡娛等者，憂惱障對治故。",
        "translation": "Someone who composes treatises, sūtras, books, plays, laughs, and entertains because they are the antidote for the hindrance of grief.",
        "source": "T26n1522_007:0166c28_14"
    },
    {
        "source_sentence": "國土城邑乃至藥草林樹等者，此不喜樂障對治故。",
        "translation": "It's because the land, cities, and even medicinal plants, forests, trees, and so forth don't delight in antidotes to the hindrances.",
        "source": "T26n1522_007:0166c29_15"
    },
    {
        "source_sentence": "金銀琉璃乃至諸寶性等者，繫閉等障，此對治故。",
        "translation": "Gold, silver, lapis lazuli, up to the nature of treasures and so on: such [things] as fetters and other obstructions: because this is the antidote.",
        "source": "T26n1522_007:0167a01_16"
    },
    {
        "source_sentence": "日月星宿乃至遍身諸相等者，所得報分過作惡因障，此對治故。",
        "translation": "“日月星宿乃至乃至遍身諸相等”: The part of retribution that is acquired is the obstruction by transgression as bad cause: because this is the antidote.",
        "source": "T26n1522_007:0167a02_17"
    },
    {
        "source_sentence": "持戒行處乃至無色定者，五種染對治。",
        "translation": "The sphere of the one who keeps precepts and practises them up to immaterial meditative attainments is with five forms as antidote for defilement.",
        "source": "T26n1522_007:0167a04_18"
    },
    {
        "source_sentence": "何者五種染？",
        "translation": "What are the five kinds of defilement?",
        "source": "T26n1522_007:0167a04_19"
    },
    {
        "source_sentence": "破戒染乃至妄修解脫染故。",
        "translation": "It's because it destroys the defilement of precepts and even the defilement of deludedly cultivating liberation.",
        "source": "T26n1522_007:0167a05_20"
    },
    {
        "source_sentence": "此起世間智，具四種相：一、異障中無障故，如經「凡諸不惱眾生事」者。",
        "translation": "This gives rise to worldly cognition, which has four kinds of characteristics: 1. because there are no hindrances in dissimilar hindrances, as the sūtra says, All things that",
        "source": "T26n1522_007:0167a05_21"
    },
    {
        "source_sentence": "二、與無過樂，如經「能利益安樂眾生事」故。",
        "translation": "Second, it's because it's free of faults and happiness, as the sūtra says, It's able to benefit and comfort sentient beings.",
        "source": "T26n1522_007:0167a07_22"
    },
    {
        "source_sentence": "三、發起清淨，如經「憐愍眾生故出」。",
        "translation": "3. the purity of arousal, as shown in the sūtra, Compassionate because it comes forth from pitying sentient beings.",
        "source": "T26n1522_007:0167a08_23"
    },
    {
        "source_sentence": "四、所用清淨，如經「漸令信入無上佛法故」。",
        "translation": "4. purity of what's used, as the sūtra says, Gradually causing faith to enter the unsurpassed buddha-dharma.",
        "source": "T26n1522_007:0167a09_24"
    },
    {
        "source_sentence": "經曰：諸佛子！",
        "translation": "The sūtra says, Children of the Buddha!",
        "source": "T26n1522_007:0167a11_0"
    },
    {
        "source_sentence": "是菩薩住此菩薩難勝地已，多見諸佛，以大神通力、大願力故。",
        "translation": "After abiding in this bodhisattva's difficulty overcoming ground, the bodhisattva often sees the buddhas because of their great supernormal powers and great vows.",
        "source": "T26n1522_007:0167a11_1"
    },
    {
        "source_sentence": "見多百佛、多千佛、多百千佛、多百千那由他佛、多億佛、多百億佛、多千億佛、多百千億佛、多百千萬億那由他佛，以大神通力、大願力故。",
        "translation": "They see many hundreds of thousands of buddhas, many hundreds of thousands of buddhas, many hundreds of thousands of buddhas, many hundreds of thousands of buddhas, many millions of buddhas, many",
        "source": "T26n1522_007:0167a12_2"
    },
    {
        "source_sentence": "是菩薩見諸佛時，以上心深心供養恭敬尊重讚歎，衣服飲食臥具湯藥一切供具悉以奉施，以諸菩薩上妙樂具供養眾僧，以此善根皆願迴向阿耨多羅三藐三菩提。",
        "translation": "When this bodhisattva sees the buddhas, he wholeheartedly and profoundly makes offerings to them with respect, veneration, respect, praise, clothing, food, bedding, bath",
        "source": "T26n1522_007:0167a15_3"
    },
    {
        "source_sentence": "於諸佛所生上恭敬專心聽法，聞已受持隨力修行，於佛法中出家，得出家已於諸佛所聽受經法而為法師，說法利益，得轉勝多聞陀羅尼成就法師。",
        "translation": "They give rise to great respect for the buddhas and concentrate their minds on listening to the teaching, retaining it after hearing it, cultivating it as much as they can, leaving home in the Buddha'",
        "source": "T26n1522_007:0167a19_4"
    },
    {
        "source_sentence": "是菩薩爾時住此菩薩難勝地中，無量百劫彼諸善根轉勝明淨，無量千劫、無量百千劫、無量百千那由他劫無量億劫、無量百億劫、無量千億劫、無量百千億劫、無量百千萬億那由他劫，彼諸善根轉勝明靜，是菩薩成就如是教化眾生法。",
        "translation": "At the time, this bodhisattva was staying in this bodhisattva's difficulty overcoming ground, and for measureless hundreds of millions of eons those good roots became increasingly",
        "source": "T26n1522_007:0167a23_5"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T26n1522_007:0167a28_6"
    },
    {
        "source_sentence": "譬如本真金，以車璩摩瑩，光色轉勝明淨。",
        "translation": "It's like the originally genuine gold that shines brightly with a carriage, and its radiance becomes increasingly brilliant and pure.",
        "source": "T26n1522_007:0167a28_7"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T26n1522_007:0167a29_8"
    },
    {
        "source_sentence": "菩薩住此菩薩難勝地中，彼諸善根以方便智思量力故轉勝明淨，彼智慧善根成就不退思量轉勝，下地善根所不能及。",
        "translation": "When the bodhisattva abides in this stage where it's difficult for the bodhisattva to overcome, those good roots become superior and insightful because of the power of skillful means, knowledge",
        "source": "T26n1522_007:0167b01_9"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T26n1522_007:0167b03_10"
    },
    {
        "source_sentence": "譬如日月星宿諸天宮殿光輪圓滿成就不壞，風不能動。",
        "translation": "It's like the sun, moon, stars, and constellations of the heavenly palaces whose radiance is complete and doesn't break down when the wind doesn't move.",
        "source": "T26n1522_007:0167b04_11"
    },
    {
        "source_sentence": "如是諸佛子！",
        "translation": "Thus, heirs of the Buddha!",
        "source": "T26n1522_007:0167b05_12"
    },
    {
        "source_sentence": "菩薩住此菩薩難勝地中，彼諸善根以方便智思量力故成就不退，一切聲聞辟支佛世間善根所不能及。",
        "translation": "When a bodhisattva abides in this difficulty-overcoming stage of enlightening beings, those good roots accomplish nonregression because of the power of skillful means, wisdom, and delibera",
        "source": "T26n1522_007:0167b05_13"
    },
    {
        "source_sentence": "是菩薩十波羅蜜中禪波羅蜜增上，餘波羅蜜非不修習，隨力隨分。",
        "translation": "This is the bodhisattva's increase in the perfection of meditation among the ten perfections, and the other perfections aren't cultivated or not cultivated, but are distributed according to their strength.",
        "source": "T26n1522_007:0167b08_14"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T26n1522_007:0167b09_15"
    },
    {
        "source_sentence": "是名略說菩薩第五菩薩難勝地。",
        "translation": "This is called the fifth bodhisattva stage that's difficult for a bodhisattva to overcome.",
        "source": "T26n1522_007:0167b09_16"
    },
    {
        "source_sentence": "若菩薩住此地中，多作兜率陀天王，所作自在摧伏一切外道邪見，能令眾生住實諦中。",
        "translation": "If a bodhisattva lives in this place, he'll often become the king of the Tuṣita heavens, and whatever he does will freely subdue all the mistaken views of non-Bud",
        "source": "T26n1522_007:0167b10_17"
    },
    {
        "source_sentence": "所作善業布施愛語利益同事，是諸福德皆不離念佛、念法、念僧、念菩薩、念菩薩行、念波羅蜜、念十地、念不壞力、念無畏、念不共佛法，乃至不離念一切種一切智智。",
        "translation": "These virtues are not separate from mindfulness of buddhas, mindfulness of the Dharma, mindfulness of saṃgha, mindfulness of bodhisattvas, mindfulness of bodhisattva practices, mindfulness of the perfections,",
        "source": "T26n1522_007:0167b12_18"
    },
    {
        "source_sentence": "常生是心：我當於一切眾生中，為首為勝為大、為妙為微妙、為上為無上、為導為將、為師為尊，乃至為一切智依止者。",
        "translation": "They always give rise to this thought: Among all sentient beings, I will be the leader, the superior, the great, the marvelous, the subtle, the supreme, the unsurpass",
        "source": "T26n1522_007:0167b16_19"
    },
    {
        "source_sentence": "復從是念發精進行，以精進力故，於一念間得千億三昧，見千億佛、知千億佛神力、能動千億佛世界、能入千億佛世界、能照千億佛世界、能化千億佛世界眾生、能住壽千億劫、能知過去未來世各千億劫事、能善入千億法門、能變身為千億，於一一身能示千億菩薩以為眷屬。",
        "translation": "Because of the power of their exertion, they instantly attain a thousand billion samādhis in a single thought and see a thousand billion buddhas, know a thousand billion buddhas’ spiritual powers,",
        "source": "T26n1522_007:0167b19_20"
    },
    {
        "source_sentence": "若以願力自在勝上，菩薩願力過於此數。",
        "translation": "If the power of the vow is unimpeded and superior, the power of the bodhisattva's vow is greater than this number.",
        "source": "T26n1522_007:0167b25_21"
    },
    {
        "source_sentence": "示種種神通，或身、或光明、或神通、或眼、或境界、或音聲、或行、或莊嚴、或加、或信、或業。",
        "translation": "It shows various supernormal powers, either body, or light, or supernormal powers, or eyes, or objects, or sounds, or actions, or adornments, or embellishments, or",
        "source": "T26n1522_007:0167b26_22"
    },
    {
        "source_sentence": "是諸神通，乃至無量百千萬億那由他劫不可數知。",
        "translation": "These supernormal powers are countless hundreds of thousands of myriads of koṭis of nayutas of eons.",
        "source": "T26n1522_007:0167b28_23"
    },
    {
        "source_sentence": "論曰：得轉勝多聞陀羅尼成就法師者，非得義陀羅尼，以平等清淨心甚難得故。",
        "translation": "The treatise says, Attaining the accomplishment of the master of the Dharma who turns away from the well-versed dhāraṇī means not attaining the meaningful dhāraṇī because it",
        "source": "T26n1522_007:0167c01_0"
    },
    {
        "source_sentence": "又樂出世間智現世間智最難故，得聞持陀羅尼。",
        "translation": "Also, because it's most difficult to delight in transmundane cognition and manifest worldly cognition, they can hear and retain the dhāraṇī.",
        "source": "T26n1522_007:0167c02_1"
    },
    {
        "source_sentence": "此地智光明真如事示現，如經「諸佛子！",
        "translation": "This is the true manifestation of the buddha-work of the light of knowledge of this stage, as shown in the sūtra, Children of Buddha!",
        "source": "T26n1522_007:0167c04_2"
    },
    {
        "source_sentence": "譬如本真金乃至下地善根所不能及」故。",
        "translation": "It's like the originally true gold that can't reach even the lower level of good roots.",
        "source": "T26n1522_007:0167c04_3"
    },
    {
        "source_sentence": "日月光輪者，依阿含增長智慧光明，勝於前地智故，如經「諸佛子！",
        "translation": "The wheel of the light of the sun and moon is based on the Āgamas that increases the light of wisdom, which is superior to the knowledge of the previous stages because it's like the sūtra",
        "source": "T26n1522_007:0167c05_4"
    },
    {
        "source_sentence": "譬如日月星宿乃至世間善根所不能及」故。",
        "translation": "It's like the sun, moon, stars, constellations, and even worldly good roots that can't reach them.",
        "source": "T26n1522_007:0167c07_5"
    },
    {
        "source_sentence": "十地經論難勝地第五卷之七",
        "translation": "Daśabhūmika-sūtra Treatise on the Ten Stages, Volume 5, Part 7 of the Fifth Fascicle",
        "source": "T26n1522_007:0167c09_0"
    }
]