[
    {
        "source_sentence": "大寶積經論卷第三",
        "translation": "Commentary on the Mahāprajñāpāramitā-sūtra Treatise, Volume 3",
        "source": "T26n1523_003:0218b02_0"
    },
    {
        "source_sentence": "後魏北印度三藏菩提流支譯",
        "translation": "Latter Wei translation of the Northern India Tripiṭaka, translated by Bodhiruci",
        "source": "T26n1523_003:0218b04_0"
    },
    {
        "source_sentence": "不見我，云何釋成人無我？",
        "translation": "If you don't see self, how do you explain the absence of self in adulthood?",
        "source": "T26n1523_003:0218b05_0"
    },
    {
        "source_sentence": "示現以一相覺故。",
        "translation": "It's because the manifestation is awakened by a single characteristic.",
        "source": "T26n1523_003:0218b05_1"
    },
    {
        "source_sentence": "是中有此覺事故，說不常觀，知還彼三種事中凡夫計執所生常，不見凡夫所計自異相見故。",
        "translation": "In this case, there are these feelings that contemplate impermanence and know that in those three kinds of things, ordinary people imagine permanence to arise because they don't see the distinctive characteristics of what ordinary people conceptualize as different.",
        "source": "T26n1523_003:0218b06_0"
    },
    {
        "source_sentence": "陰等無常事，云何釋法空？",
        "translation": "How do we explain the emptiness of dharmas when such things as aggregates are impermanent?",
        "source": "T26n1523_003:0218b08_1"
    },
    {
        "source_sentence": "示現亦以一相不覺故。",
        "translation": "It's because the manifestation also doesn't perceive a single characteristic.",
        "source": "T26n1523_003:0218b08_2"
    },
    {
        "source_sentence": "說非無常觀故，知是中有此不覺事，還彼事中無常趣故，內外及二中間是凡夫計執假說相，",
        "translation": "Because it is said not to be the contemplation of impermanence. It is known that this nonenlightened thing exists in them, because when returning to these things, there is an impermanent destiny.",
        "source": "T26n1523_003:0218b09_3"
    },
    {
        "source_sentence": "體性不可覺知。",
        "translation": "The essence and nature can't be perceived.",
        "source": "T26n1523_003:0218b11_4"
    },
    {
        "source_sentence": "得無常者若計執已，於不可說事中橫安，云何釋說法無我？",
        "translation": "If someone who attains impermanence imagines and clings to it, then they're comfortable in untold things, so how can they explain that the teaching is selfless?",
        "source": "T26n1523_003:0218b11_5"
    },
    {
        "source_sentence": "示現以一相覺故。",
        "translation": "It's because the manifestation is awakened by a single characteristic.",
        "source": "T26n1523_003:0218b13_0"
    },
    {
        "source_sentence": "是中有此覺覺事故，還彼事中所覺見聖智境界，唯彼自內證知，餘人不能說。",
        "translation": "Within this, there are these things that are perceived and awakened, and within those things that are perceived and seen as the sphere of noble cognition, only they themselves realize it internally, but others can't explain it.",
        "source": "T26n1523_003:0218b13_1"
    },
    {
        "source_sentence": "彼有六種相，如凡夫所計執假見說性不相似。",
        "translation": "They have six kinds of characteristics, just as worldlings imagine that they cling to false views and say their nature is not the same.",
        "source": "T26n1523_003:0218b15_2"
    },
    {
        "source_sentence": "何者六種？",
        "translation": "What are these six kinds?",
        "source": "T26n1523_003:0218b16_3"
    },
    {
        "source_sentence": "非色者，自測指斥不可得說是此。",
        "translation": "What's not form is self-determined, pointing and rejecting, and it can't be said to be this.",
        "source": "T26n1523_003:0218b16_4"
    },
    {
        "source_sentence": "此是不可見者，是以彼不可得。",
        "translation": "This is invisible because it's unobtainable.",
        "source": "T26n1523_003:0218b17_5"
    },
    {
        "source_sentence": "示他不住者，過色根境界故，彼處色等根不能住故。",
        "translation": "“Instructing others not to abide”: Because it goes beyond the realm of the faculty matter and because such faculties as matter, etc., cannot abide in this [realm].",
        "source": "T26n1523_003:0218b17_6"
    },
    {
        "source_sentence": "無相者，離念性相故。",
        "translation": "The signless one: because it is free from the characteristic marks of the nature of mindfulness.",
        "source": "T26n1523_003:0218b19_7"
    },
    {
        "source_sentence": "無記者，離意識境界故。",
        "translation": "They are neutral because they are free from the sphere of the thinking consciousness.",
        "source": "T26n1523_003:0218b19_8"
    },
    {
        "source_sentence": "無著者，無煩惱事故。",
        "translation": "The absence of attachment means the absence of afflictive phenomena.",
        "source": "T26n1523_003:0218b20_9"
    },
    {
        "source_sentence": "云何釋成橫計執有邊？",
        "translation": "How does the explanation become a horizontally discriminated attachment that has limits?",
        "source": "T26n1523_003:0218b20_10"
    },
    {
        "source_sentence": "示現有二種勝相正說故，及示現彼體性相正說故。",
        "translation": "It's because they show that there are two kinds of superior characteristics that are present, and it's because they show that their essential nature and characteristics are correctly explained.",
        "source": "T26n1523_003:0218b21_11"
    },
    {
        "source_sentence": "是中何者勝正說性相？",
        "translation": "Which of these is superior to the correctly explained nature and characteristics?",
        "source": "T26n1523_003:0218b22_12"
    },
    {
        "source_sentence": "彼上上有八種應知。",
        "translation": "There are eight ways to know the above.",
        "source": "T26n1523_003:0218b22_13"
    },
    {
        "source_sentence": "還彼事中常正執、無常正執。",
        "translation": "Again, there's the correct attachment to permanence and the correct attachment to impermanence in those things.",
        "source": "T26n1523_003:0218b23_14"
    },
    {
        "source_sentence": "及依常正執故，有我取正執。",
        "translation": "Because they rely on the correct attachment to permanence, there is a correct attachment to self and grasping.",
        "source": "T26n1523_003:0218b23_15"
    },
    {
        "source_sentence": "及依無常執，有無我執。",
        "translation": "The attachment to impermanence and the attachment to selflessness are supported by these two.",
        "source": "T26n1523_003:0218b24_16"
    },
    {
        "source_sentence": "及依無我取執故，有取實心大執。",
        "translation": "Because they rely on the attachment to selflessness, they have great grasping of the real mind and great clinging.",
        "source": "T26n1523_003:0218b25_17"
    },
    {
        "source_sentence": "依有我執故，說不取實心執。",
        "translation": "Because they rely on attachment to the existence of self, it's said that they don't cling to real mental attachment.",
        "source": "T26n1523_003:0218b25_18"
    },
    {
        "source_sentence": "彼所依者亦求，彼復求者，依執故及依執共順依，取不實心。",
        "translation": "Those on which they rely also seek, and those who further seek: because of being with attachment to the basis!®*°; together with attachment to the basis, it is conforming to the basis:",
        "source": "T26n1523_003:0218b26_19"
    },
    {
        "source_sentence": "所執取不善等執著，乃至取染執相，有五種障患。",
        "translation": "4.5.29 There are five kinds of obstacles and di›er, namely, grasping what is appropriated as unwholesome, etc., up to grasping the characteristics of defilement and clinging:",
        "source": "T26n1523_003:0218b27_20"
    },
    {
        "source_sentence": "於染法中有顛倒患、謗患、發起患、麁惡患、無常患，依執取實心。",
        "translation": "Among the defiled dharmas, there are the afflictions of delusion, the afflictions of denigrating, the afflictions of arousing, the afflictions of anger and badness, and the afflictions of impermanence, which rely on the mind that clings to reality.",
        "source": "T26n1523_003:0218b29_0"
    },
    {
        "source_sentence": "彼對治，於淨法中善等所安乃至淨得所安，此是成八種諸勝安。",
        "translation": "The antidote is what is settled by such [things] as that which is good among the pure dharmas, up to what is settled by what is acquired through purity. These make eight kinds of superior peaceTM”’:",
        "source": "T26n1523_003:0218c01_1"
    },
    {
        "source_sentence": "是諸八種勝安，菩薩不覺念順，不執著故。",
        "translation": "These are the eight kinds of superior peace that bodhisattvas don't perceive and follow, because they don't cling to them.",
        "source": "T26n1523_003:0218c02_2"
    },
    {
        "source_sentence": "不說順，不勸他故。",
        "translation": "It is not said to be agreeable because it does not encourage others.",
        "source": "T26n1523_003:0218c03_3"
    },
    {
        "source_sentence": "不悟順，不動他故。",
        "translation": "They are not conforming to enlightenment because they do not move others.",
        "source": "T26n1523_003:0218c04_4"
    },
    {
        "source_sentence": "是中真實執安者，上明依此八種勝安事中，凡夫繫念假用性執安。",
        "translation": "This is the true attachment to peace because the above explains that among these eight kinds of superior peacefulness, ordinary people who are mindful and provisionally apply themselves to peace by clinging to their nature.",
        "source": "T26n1523_003:0218c04_5"
    },
    {
        "source_sentence": "言有如是安，云何釋謗邊？",
        "translation": "When you say there's such peace, how do you explain the limit of denigrating?",
        "source": "T26n1523_003:0218c06_6"
    },
    {
        "source_sentence": "亦以一相故，示現有謗事故。",
        "translation": "It's also because of a single characteristic that it shows the existence of denigrating things.",
        "source": "T26n1523_003:0218c06_7"
    },
    {
        "source_sentence": "是中有謗事者，如彼信邪法無我一切時執故，言無一切法相。",
        "translation": "Here, there's a person who denigrates things because they believe that wrong dharmas lack self and all times cling to them, so they say they lack all the characteristics of dharmas.",
        "source": "T26n1523_003:0218c07_8"
    },
    {
        "source_sentence": "以是義故，略說此橫執謗邊離六種相，顯說中道義。",
        "translation": "Because of this meaning, it's briefly explained that these six kinds of characteristics are free from the side of horizontal attachment and denigrating, revealing the meaning of the middle way.",
        "source": "T26n1523_003:0218c08_9"
    },
    {
        "source_sentence": "云何釋成諸法證事？",
        "translation": "What's an explanation of the accomplishment of the realization of things as dharmas?",
        "source": "T26n1523_003:0218c09_10"
    },
    {
        "source_sentence": "如經「迦葉！",
        "translation": "As the sūtra says, Kāśyapa!",
        "source": "T26n1523_003:0218c10_11"
    },
    {
        "source_sentence": "明與無明無異無別，如是知者是名中道真實正觀。",
        "translation": "Knowledge and ignorance are neither different nor distinct, and thus knowing is called the true right contemplation of the middle way.",
        "source": "T26n1523_003:0218c10_12"
    },
    {
        "source_sentence": "乃至老死滅，是無二無別」等。",
        "translation": "Up to the cessation of old age and death, there are no two and no distinctions.",
        "source": "T26n1523_003:0218c11_13"
    },
    {
        "source_sentence": "有三種相，釋說證法事，還彼本說三種事中。",
        "translation": "There are three kinds of characteristics that explain the realization of the Dharma service, which returns to the three kinds of service explained in the previous section.",
        "source": "T26n1523_003:0218c12_14"
    },
    {
        "source_sentence": "及第四因緣事中有障有對治。",
        "translation": "and the fourth, there are hindrances that are counteracted in terms of causes and conditions.",
        "source": "T26n1523_003:0218c13_15"
    },
    {
        "source_sentence": "住有為無為，示現性相不可得故，示現勝事不可得故，及習彼已證得如實智。",
        "translation": "They abide in conditioned and unconditioned because the manifestation of their essential characteristics is unobtainable, because the manifestation of superior things is unobtainable, and they experience them and realize true knowledge.",
        "source": "T26n1523_003:0218c14_16"
    },
    {
        "source_sentence": "是中性相不可得者，如凡夫計執，明與無明性相不可得。",
        "translation": "This is because the nature and characteristics of these are unobtainable, just as ordinary people imagine that the nature and characteristics of insight and nescience are unobtainable.",
        "source": "T26n1523_003:0218c15_17"
    },
    {
        "source_sentence": "是中勝事不可得者，所有彼凡夫橫計執性相滅生聚集不見二相故。",
        "translation": "In this case, the superior thing is unobtainable because all those worldlings who falsely believe in the cessation of nature and characteristics as arising and accumulation don't see the two characteristics.",
        "source": "T26n1523_003:0218c17_18"
    },
    {
        "source_sentence": "是中證得智者，所說彼智及依所依念相行不念故，及行不障故，以內智知證法無我故。",
        "translation": "This is the one who realizes knowledge: because what is said to be knowledge and the characteristic marks on which it depends are without mindfulness in relation to formations, and because formations are not obstructed: because of the realization of the selflessness of factors by means of an inner knowledge.",
        "source": "T26n1523_003:0218c18_19"
    },
    {
        "source_sentence": "云何釋菩薩證法？",
        "translation": "What's an explanation of the bodhisattva's realization of the teaching?",
        "source": "T26n1523_003:0218c20_20"
    },
    {
        "source_sentence": "迴發願向大菩提故，亦是一相故。",
        "translation": "It's because the turning back of the vow to great enlightenment is also one characteristic.",
        "source": "T26n1523_003:0218c21_21"
    },
    {
        "source_sentence": "言若不以空故令諸法空，如是等七句說菩薩為利益眾生故，以空故不令諸法空，",
        "translation": "They say, “If the enlightening being were not to cause all things to be void because of emptiness, he would not cause all things to be void.” The enlightening beings explain in these seven sentences:",
        "source": "T26n1523_003:0218c21_22"
    },
    {
        "source_sentence": "不捨煩惱，是義如是。",
        "translation": "The meaning of not abandoning defilement is as follows:",
        "source": "T26n1523_003:0218c23_23"
    },
    {
        "source_sentence": "不以無願故令諸法無願，不以無相故令諸法無相。",
        "translation": "It's not because of wishlessness that they cause dharmas to lack wishes, and it's not because of signlessness that they cause dharmas to lack signs.",
        "source": "T26n1523_003:0218c24_24"
    },
    {
        "source_sentence": "不現起復業生流及念生流，一切諸行無性，以涅槃滅世間流。",
        "translation": "He doesn't presently give rise to the stream of karmic production and the stream of mindfulness, and all conditioned things lack nature, so he extinguishes the worldly flow with nirvāṇa.",
        "source": "T26n1523_003:0218c25_25"
    },
    {
        "source_sentence": "云何如是行已釋成未離煩惱苦心事？",
        "translation": "How does such a practice explain the formation of mental states that are not free from affliction and suffering after they've done so?",
        "source": "T26n1523_003:0218c26_26"
    },
    {
        "source_sentence": "亦以一相義故。",
        "translation": "It's also because of the meaning of one characteristic.",
        "source": "T26n1523_003:0218c27_27"
    },
    {
        "source_sentence": "言如諸法有性無性，如是等七句說未滅諸怨障等法，如實觀證。",
        "translation": "It means that just as all dharmas have natures and no natures, these seven phrases explain the fact that they haven't ceased the hindrances of enmity and so forth, which are truly observed and realized.",
        "source": "T26n1523_003:0218c28_28"
    },
    {
        "source_sentence": "是中如實證者，還彼障等諸法，以體性行法無我見不染及苦。",
        "translation": "This is the true realization, which returns to those hindrances and other dharmas with their essence, practice, selflessness, views, nondefilement, and suffering.",
        "source": "T26n1523_003:0218c29_29"
    },
    {
        "source_sentence": "云何勝？",
        "translation": "What's superior?",
        "source": "T26n1523_003:0219a01_30"
    },
    {
        "source_sentence": "釋四種相故：示現見勝相故、示現還彼遠相離勝故、示現失禪亂勝故、示現心亂勝故。",
        "translation": "It's because of four kinds of characteristics: showing the superiority of views, showing the superiority of returning to those distant forms, showing the superiority of losing meditation and disturbance, and showing the superiority of mental disturbances.",
        "source": "T26n1523_003:0219a02_31"
    },
    {
        "source_sentence": "是中見勝者，經言「迦葉！",
        "translation": "To those who see the superiority here, the sūtra says, Kāśyapa!",
        "source": "T26n1523_003:0219a04_32"
    },
    {
        "source_sentence": "非無人故名曰為空，乃至中際亦空故，非但不見人故說空」。",
        "translation": "It's not called emptiness because there's no person, and even the middle part is also empty because it doesn't just say emptiness because it doesn't see people.",
        "source": "T26n1523_003:0219a04_33"
    },
    {
        "source_sentence": "是義何以故？",
        "translation": "What is the reason for this?",
        "source": "T26n1523_003:0219a05_34"
    },
    {
        "source_sentence": "住眾生空者，不見法空，惟法自體空。",
        "translation": "Those who abide in the emptiness of sentient beings don't see the emptiness of things but the emptiness of the essence of things.",
        "source": "T26n1523_003:0219a06_35"
    },
    {
        "source_sentence": "未來於涅槃中作斷慢，心善觀所取乃至行能取無我智，離假名性空所攝。",
        "translation": "In the future, in nirvāṇa, they'll become free of conceit, and their minds will skillfully observe what's grasped and even the cognition that grasps selflessness as practiced, which is free of the emptiness of the nature of nominal names.",
        "source": "T26n1523_003:0219a07_36"
    },
    {
        "source_sentence": "不善觀三時過去未來現在，故名不正觀真如智爾焰。",
        "translation": "Because they do not well contemplate the past, future, and present of the three time periods, they are said to be those who do not correctly contemplate the flame of knowledge regarding true reality.",
        "source": "T26n1523_003:0219a08_37"
    },
    {
        "source_sentence": "空假名妄取法慢故，言依空不依法無我真實空，彼以不滅本所取眾生空及有取生法故，",
        "translation": "Because emptiness is a metaphor for falsely grasping the conceit of dharmas. When stating that it relies on emptiness and does not rely on the selflessness of things as real emptiness, this is because it does not eliminate the emptiness of sentient beings who have grasped what they originally grasped and the dharmas that arise from gras",
        "source": "T26n1523_003:0219a10_38"
    },
    {
        "source_sentence": "名相退失。",
        "translation": "They're called regressing from characteristics.",
        "source": "T26n1523_003:0219a12_39"
    },
    {
        "source_sentence": "於此法中，菩薩不如是，以是義故，顯勝說菩薩行示法無我故。",
        "translation": "In this teaching, the bodhisattva isn't like that because it shows that the bodhisattva's practice reveals the selflessness of dharmas in terms of their meaning.",
        "source": "T26n1523_003:0219a12_40"
    },
    {
        "source_sentence": "「佛語迦葉：汝等當依於空，乃至於佛法中則為退失」。",
        "translation": "The Buddha said to Kāśyapa, You must rely on emptiness, and even in the Buddha's teaching you'll regress.",
        "source": "T26n1523_003:0219a13_41"
    },
    {
        "source_sentence": "是中有此遠離，勝住眾生無我故。",
        "translation": "In this, there's this seclusion because sentient beings who are superiorly abiding have no self.",
        "source": "T26n1523_003:0219a14_42"
    },
    {
        "source_sentence": "自我見是以於凡夫最下中轉。",
        "translation": "Self-view is thus transformed in the lowest among worldlings.",
        "source": "T26n1523_003:0219a15_43"
    },
    {
        "source_sentence": "復最下有二種相故：一、不免苦；",
        "translation": "Again, the lowest has two characteristics:",
        "source": "T26n1523_003:0219a16_44"
    },
    {
        "source_sentence": "二、行苦，此是二相故，言「迦葉！",
        "translation": "2. the suffering of volition, because these are the two characteristics, he said, Kāśyapa!",
        "source": "T26n1523_003:0219a17_45"
    },
    {
        "source_sentence": "寧起眾生見積如須彌，不以空見起增上慢。",
        "translation": "It's better to give rise to the view that sentient beings accumulate like Mount Sumeru than to give rise to increased pride because of views of emptiness.",
        "source": "T26n1523_003:0219a17_46"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T26n1523_003:0219a18_47"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T26n1523_003:0219a19_48"
    },
    {
        "source_sentence": "一切諸見以空得脫。",
        "translation": "All views are liberated by emptiness.",
        "source": "T26n1523_003:0219a19_49"
    },
    {
        "source_sentence": "若起空見者，彼則不可治」，此文顯示彼義。",
        "translation": "If someone gives rise to the view of emptiness, they can't be disciplined. This text shows their meaning.",
        "source": "T26n1523_003:0219a19_50"
    },
    {
        "source_sentence": "寧起我見積如須彌者，以我見是可對治、可令得滅。",
        "translation": "It's better to give rise to a view of self that accumulates like Mount Sumeru because views of self can be counteracted and made to cease.",
        "source": "T26n1523_003:0219a20_51"
    },
    {
        "source_sentence": "不以空見起增上慢，以不見法無我故起增上慢應知。",
        "translation": "They don't give rise to excessive conceit because they see emptiness, and they give rise to excessive conceit because they don't see things as selfless, you should know.",
        "source": "T26n1523_003:0219a21_52"
    },
    {
        "source_sentence": "我以空故見諸行空，妄相執性空亦是空，彼不可得體空，橫執分別性空，",
        "translation": "Because of the emptiness of self, all conditioned forces are seen to be empty. The emptiness of deludedly grasping natured characteristics is also emptiness. These ungraspable entities are empty in essence, and they arbitrarily grasp the emptiness of discriminating nature as emptiness.",
        "source": "T26n1523_003:0219a23_53"
    },
    {
        "source_sentence": "橫安顛倒處故。",
        "translation": "It's because it's horizontally settled in a place of error.",
        "source": "T26n1523_003:0219a24_54"
    },
    {
        "source_sentence": "以橫安執見故，成於空見。",
        "translation": "It's because of the view of horizontally attaching to emptiness that they become views of emptiness.",
        "source": "T26n1523_003:0219a25_55"
    },
    {
        "source_sentence": "若起空見者，彼不得與對治，故不可持應知。",
        "translation": "If someone gives rise to the view of emptiness, they won't be able to counteract it, so they can't maintain it and should know it.",
        "source": "T26n1523_003:0219a25_56"
    },
    {
        "source_sentence": "以不可持故，不免生等諸苦，一切時不離煩惱熱故。",
        "translation": "Because they cannot be sustained, they cannot escape the suffering of birth and so on: because at all moments they are not free from the fever of defilement.",
        "source": "T26n1523_003:0219a26_57"
    },
    {
        "source_sentence": "不能樂行，喻如不可治病人。",
        "translation": "Being unable to practice with pleasure is a metaphor for being like an incurable patient.",
        "source": "T26n1523_003:0219a28_58"
    },
    {
        "source_sentence": "滅二種執取故，為前者說有二種相，譬如病人良醫授藥。",
        "translation": "Because of the cessation of these two kinds of grasping, it is said that there are two kinds of characteristic marks for the former: just as when a sick person receives medicine from a good physician.",
        "source": "T26n1523_003:0219a28_59"
    },
    {
        "source_sentence": "乃至若起空見者，我說彼人則不可治。",
        "translation": "Even if someone gives rise to the view of emptiness, I say that person is untreatable.",
        "source": "T26n1523_003:0219b01_60"
    },
    {
        "source_sentence": "此喻示現，譬如病人不正將息令動諸患，順動病因順不動病因前後故，",
        "translation": "This metaphor shows that it's like a sick person who doesn't correctly calm and causes the afflictions to be disturbed, which is the cause of illnesses that are accompanied by movement and those that aren't accompanied by movement because of the causes before and after.",
        "source": "T26n1523_003:0219b01_61"
    },
    {
        "source_sentence": "受二種苦受。",
        "translation": "They experience two kinds of painful feelings.",
        "source": "T26n1523_003:0219b03_62"
    },
    {
        "source_sentence": "如是人無我見不滅同我見，及生空法無我執不離，自順煩惱病故。",
        "translation": "In this way, the view of selflessness of person is not abandoned: because it is the same as the view of self. Moreover, when arising in emptiness and attachment to a selflessness of factors are not separated one from the other: because they naturally follow defilement and sickness.",
        "source": "T26n1523_003:0219b03_63"
    },
    {
        "source_sentence": "前後取二種滅，故名為滅。",
        "translation": "Because the prior and subsequent grasping are two kinds of cessation, they're called cessation.",
        "source": "T26n1523_003:0219b05_64"
    },
    {
        "source_sentence": "菩薩不如是。",
        "translation": "The bodhisattva is not like this.",
        "source": "T26n1523_003:0219b06_65"
    },
    {
        "source_sentence": "是中滅善勝者，如經「譬如有人怖畏虛空」如是等。",
        "translation": "This is called the superiority of cessation of goodness, as the sūtra says, It's like a person who fears space and so forth.",
        "source": "T26n1523_003:0219b06_66"
    },
    {
        "source_sentence": "「如人空中自念分別橫執計作物怖畏，彼已作如是言：除此空除此空」如是等。",
        "translation": "Suppose a person in the sky thinks to themselves, discriminates, and arbitrarily clings to the fear of crops, and they say, 'Abandon this emptiness and remove this emptiness' and so forth.",
        "source": "T26n1523_003:0219b07_67"
    },
    {
        "source_sentence": "如是住人無我中，不住法無我，我慢故生怖畏。",
        "translation": "Thus, they abide in the selflessness of people and don't abide in the selflessness of dharmas, and because of self-conceit, fear arises.",
        "source": "T26n1523_003:0219b09_68"
    },
    {
        "source_sentence": "於虛空處不可說事中，橫執虛、橫安執已，安執故色等故色等想，求彼斷事。",
        "translation": "In the space realm, there are ineffable things that are horizontally grasped as space and horizontally grasped. Having horizontally grasped form and so forth because of their attachment, one seeks to eliminate them.",
        "source": "T26n1523_003:0219b10_69"
    },
    {
        "source_sentence": "菩薩不爾，是中有此心亂勝事，故言「迦葉！",
        "translation": "If the bodhisattva isn't like this, then there's this mind that's distracted by superior things, so he says, Kāśyapa!",
        "source": "T26n1523_003:0219b12_0"
    },
    {
        "source_sentence": "譬如畫師，自畫作恐怖夜叉鬼像如是」等。",
        "translation": "It's like a painter who paints his own images of fearful yakṣa ghosts and so forth.",
        "source": "T26n1523_003:0219b12_1"
    },
    {
        "source_sentence": "如是失行亂者，住人無我故，自分別念實有境界。",
        "translation": "Such a discrepancy in loss of volition is because people who abide in selflessness discriminate among themselves and think that there really is an object.",
        "source": "T26n1523_003:0219b13_2"
    },
    {
        "source_sentence": "彼以想等倒故，令成顛倒。",
        "translation": "Because of such errors as conceptual identification, it causes them to become mistaken.",
        "source": "T26n1523_003:0219b15_3"
    },
    {
        "source_sentence": "菩薩不爾。",
        "translation": "That's not the case for bodhisattvas.",
        "source": "T26n1523_003:0219b15_4"
    },
    {
        "source_sentence": "云何釋說因？",
        "translation": "What's an explanation of explaining the cause?",
        "source": "T26n1523_003:0219b15_5"
    },
    {
        "source_sentence": "以二種喻：一者幻師喻；",
        "translation": "“Good son, it is because of two kinds of metaphors:",
        "source": "T26n1523_003:0219b16_6"
    },
    {
        "source_sentence": "二者二木相磨喻。",
        "translation": "The second is the metaphor of the two kinds of wood being milled together.",
        "source": "T26n1523_003:0219b16_7"
    },
    {
        "source_sentence": "初喻示現觀能取者，人無我智唯取諸行，彼以法無我智觀，是法無我智名為能取及觀。",
        "translation": "The first metaphor shows that contemplation is able to grasp because the cognition of selflessness of humans apprehends only conditioned phenomena, and they observe it with the cognition of selflessness of dharmas. This knowledge of selflessness of dharmas is called the one who apprehends and contemplates.",
        "source": "T26n1523_003:0219b17_8"
    },
    {
        "source_sentence": "然彼人無我智與法無我智為因，以有彼故有此喻。",
        "translation": "However, that person's cognition of selflessness and the cognition of selflessness of dharmas are the causes, and because they exist, there's this metaphor.",
        "source": "T26n1523_003:0219b19_9"
    },
    {
        "source_sentence": "若幻師與幻人為因，喻若幻人食，彼師如是行者，以法無我智、眾生無我智離假名性故空，",
        "translation": "If the illusionist and the illusionist are the cause, it's a metaphor for the illusionist who eats food. That teacher thus practices because of the selflessness of cognition of things and the selflessness of sentient beings because he's free of the nature of nominal names.",
        "source": "T26n1523_003:0219b20_10"
    },
    {
        "source_sentence": "離彼分別故寂，可捨相故無有堅固，空無物故。",
        "translation": "Because they are free from discrimination, they are quiescent; because they can abandon characteristics, they have no firmness: because emptiness has no things.",
        "source": "T26n1523_003:0219b22_11"
    },
    {
        "source_sentence": "不牢觀者如食，第二喻示現。",
        "translation": "A contemplation that's not firm like food, the second metaphor shows it.",
        "source": "T26n1523_003:0219b23_12"
    },
    {
        "source_sentence": "譬如二實證得，是中如實證得所有觀，彼能取所取寂靜思惟念因不捨離，",
        "translation": "“Good son, it is analogous to the realization of these two kinds of acquisition as they really are. This is the contemplation that has been realized as they really are. They apprehend what they apprehend and are apprehended by quiet reflection without giving up the cause of mindfulness.",
        "source": "T26n1523_003:0219b24_13"
    },
    {
        "source_sentence": "永得彼內知決定智生。",
        "translation": "They'll permanently attain the cognition of certainty that arises from their internal knowledge.",
        "source": "T26n1523_003:0219b25_14"
    },
    {
        "source_sentence": "是中觀所取者，謂眾生無我智觀，能取者行法無我智，彼二如上下二木順故。",
        "translation": "The one who grasps it is the contemplation of selfless knowledge regarding beings. Those who are able to grasp it proceed in dharmas with selfless knowledge: because these two are as follows for the upper and lower [factors], because they are mutually concomitant.",
        "source": "T26n1523_003:0219b26_15"
    },
    {
        "source_sentence": "寂靜思惟以寂靜因故，內所證知生決定知，名為真實證。",
        "translation": "Because of the cause of quiescence, quiet contemplation gives rise to certainty about what's realized internally, which is called true realization.",
        "source": "T26n1523_003:0219b28_16"
    },
    {
        "source_sentence": "此之二木喻，顯示有因可得，喻如因磨二木故生火，生已還燒彼二木。",
        "translation": "These two metaphors of trees show that there's a cause that can be obtained, which is like the metaphor where fire arises because two trees are ground together and burns those two trees back up after being ground.",
        "source": "T26n1523_003:0219b29_17"
    },
    {
        "source_sentence": "如是人無我、法無我智行因，生是法無我智，以緣內智決定生智。",
        "translation": "Thus, this person's cognition of selflessness and the dharmas as selflessness are the causes of their cognitive functioning, which gives rise to the cognition that the dharmas are selfless, and it's because of internal cognition that they definitely give rise to cognition.",
        "source": "T26n1523_003:0219c02_18"
    },
    {
        "source_sentence": "彼行智所有妄念計執性，彼如實觀而能燒。",
        "translation": "They practice wisdom that possesses deluded thoughts and imaginations with the nature of attachment, and they truly observe them and can burn them.",
        "source": "T26n1523_003:0219c03_19"
    },
    {
        "source_sentence": "云何說遍至空？",
        "translation": "How are they said to be pervasive up to emptiness?",
        "source": "T26n1523_003:0219c04_20"
    },
    {
        "source_sentence": "亦以一相義故，還彼法無我智中如實見故。",
        "translation": "It's also because of the meaning of one characteristic, which is to return to that selflessness of dharmas in cognition as they really are.",
        "source": "T26n1523_003:0219c04_21"
    },
    {
        "source_sentence": "言譬如然燈時一切黑闇皆悉自滅，此喻解釋說是中如實見故，無智等離假名性故。",
        "translation": "It is to be compared with the fact that all darkness disappears spontaneously at the moment of a lamp. This metaphor explains that this is because one sees it as it really is: because there is no knowledge, and so on, apart from the nature of namelessness.",
        "source": "T26n1523_003:0219c05_22"
    },
    {
        "source_sentence": "空者，如是不執故。",
        "translation": "Emptiness is because it's thus not attached.",
        "source": "T26n1523_003:0219c07_23"
    },
    {
        "source_sentence": "不可取寂滅者，不覺故。",
        "translation": "They cannot be apprehended as tranquil because they are not apprehended.",
        "source": "T26n1523_003:0219c08_24"
    },
    {
        "source_sentence": "云何如是釋彼空？",
        "translation": "How does he explain emptiness in this way?",
        "source": "T26n1523_003:0219c08_25"
    },
    {
        "source_sentence": "一者業滅煩惱滅，是現對治故。",
        "translation": "One, the cessation of karma and afflictions is the present antidote.",
        "source": "T26n1523_003:0219c09_26"
    },
    {
        "source_sentence": "言「迦葉！",
        "translation": "He said, Kāśyapa!",
        "source": "T26n1523_003:0219c10_0"
    },
    {
        "source_sentence": "譬如宅內，若室若房若屋中過千歲以來乃至其黑闇」者，諸結業是此喻說。",
        "translation": "It's like being inside a house, whether it's a room, a room, or a house that goes beyond a thousand years until it's black and dark.",
        "source": "T26n1523_003:0219c10_1"
    },
    {
        "source_sentence": "是中顯示滅至失者，尋即所生智慧光明能滅無始以來諸業煩惱。",
        "translation": "This shows that cessation up to error, which means that the light of wisdom that arises from discursive investigation can extinguish the afflictions of actions since beginningless time.",
        "source": "T26n1523_003:0219c11_2"
    },
    {
        "source_sentence": "若能如是速滅諸煩惱者，何故菩薩久長行世間？",
        "translation": "If someone can thus quickly extinguish the afflictions, why does a bodhisattva travel through the world for so long?",
        "source": "T26n1523_003:0219c13_3"
    },
    {
        "source_sentence": "二喻示現得勝果故。",
        "translation": "The second metaphor shows that it's because they've attained superior results.",
        "source": "T26n1523_003:0219c14_4"
    },
    {
        "source_sentence": "言「迦葉！",
        "translation": "He said, Kāśyapa!",
        "source": "T26n1523_003:0219c15_5"
    },
    {
        "source_sentence": "譬如種在空中乃至諸使雜世間法能長佛法」者，雜穢良田中能生長種子。",
        "translation": "It's like planting seeds in the sky or even contaminants that are mixed with worldly dharmas that can grow the Buddha-dharma.",
        "source": "T26n1523_003:0219c15_6"
    },
    {
        "source_sentence": "如是等喻，示現此事菩薩向涅槃心故，不捨眾生為得佛法故願取世間，",
        "translation": "These metaphors show that this is because the bodhisattva’s mind is directed toward nirvana, not abandoning sentient beings in order to attain buddhahood and wishing to grasp the world.",
        "source": "T26n1523_003:0219c16_7"
    },
    {
        "source_sentence": "已迴向發願諸善根故，長夜中行行。",
        "translation": "Because they've already dedicated themselves back to the good roots of their vow, they walk for a long time at night.",
        "source": "T26n1523_003:0219c18_8"
    },
    {
        "source_sentence": "是中涅槃是無為，喻如虛空，彼依故不長諸佛法。",
        "translation": "Here, nirvāṇa is unconditioned, which is likened to space because it's the basis and doesn't grow the buddha-dharmas.",
        "source": "T26n1523_003:0219c19_9"
    },
    {
        "source_sentence": "世間如煩惱雜穢田，菩薩大悲亦如煩惱雜穢地處，持彼地故，能增長菩薩佛法。",
        "translation": "The world is like a field of afflictions and defilement, and the bodhisattva's great compassion is like a place where afflictions and defilement are planted, maintaining it so that it can increase the bodhisattva's buddha-dharma.",
        "source": "T26n1523_003:0219c20_10"
    },
    {
        "source_sentence": "問曰：云何依下劣有為法中能增長菩薩無上佛法？",
        "translation": "Q: How can we rely on inferior conditioned dharmas to grow the bodhisattva's unsurpassed buddha-dharma?",
        "source": "T26n1523_003:0219c23_0"
    },
    {
        "source_sentence": "以蓮華喻顯釋，故言「迦葉！",
        "translation": "The explanation is expressed in terms of the lotus metaphor, so it's called Kāśyapa!",
        "source": "T26n1523_003:0219c24_1"
    },
    {
        "source_sentence": "譬如卑濕淤泥乃生蓮華。",
        "translation": "It's like the lotus flower that grows when it's submerged in wet mud.",
        "source": "T26n1523_003:0219c24_2"
    },
    {
        "source_sentence": "菩薩亦爾，於生死泥邪定眾生中，菩薩乃生佛」法。",
        "translation": "So it is with bodhisattvas, for among sentient beings in the mud of birth-and-death and wrongly determined sentient beings, bodhisattvas are born as buddhas.",
        "source": "T26n1523_003:0219c25_3"
    },
    {
        "source_sentence": "問曰：若如是者，諸聲聞於菩薩中無此十二種勝事。",
        "translation": "Q: If that's the case, then śrāvakas don't have these 12 kinds of superior qualities among bodhisattvas.",
        "source": "T26n1523_003:0219c26_4"
    },
    {
        "source_sentence": "何等十二種？",
        "translation": "What are these twelve kinds?",
        "source": "T26n1523_003:0219c27_5"
    },
    {
        "source_sentence": "所謂修習現諸雜善根勝事；",
        "translation": "They are the excellence of cultivating and manifesting mixed roots of goodness.",
        "source": "T26n1523_003:0219c27_6"
    },
    {
        "source_sentence": "修智行勝事；",
        "translation": "They cultivate knowledge and carry out excellent deeds.",
        "source": "T26n1523_003:0219c28_7"
    },
    {
        "source_sentence": "解脫果所攝盡無生智解脫同至勝事；",
        "translation": "The liberation of the knowledge of extinction from nonorigination, which is included in the fruit of liberation, is the same as the supreme phenomenon.",
        "source": "T26n1523_003:0219c28_8"
    },
    {
        "source_sentence": "滅降伏諸魔怨等勝事；",
        "translation": "I elucidate the supreme deed of subjugating all demons and enemies.",
        "source": "T26n1523_003:0219c29_9"
    },
    {
        "source_sentence": "無學勝事；",
        "translation": "The supreme deeds of the post learners.",
        "source": "T26n1523_003:0220a01_10"
    },
    {
        "source_sentence": "阿羅漢勝事。",
        "translation": "The arhat is a superior deed.",
        "source": "T26n1523_003:0220a01_11"
    },
    {
        "source_sentence": "應供義故說眾上勝事，依四雙八人故。",
        "translation": "It's because of the meaning of making offerings that it's said to be the most superior among many things, relying on the four pairs and eight people.",
        "source": "T26n1523_003:0220a01_12"
    },
    {
        "source_sentence": "明諸說者上勝事，現法中得涅槃說法故。",
        "translation": "It explains that the speakers are superior because they attain nirvāṇa in the present life and teach the Dharma.",
        "source": "T26n1523_003:0220a02_13"
    },
    {
        "source_sentence": "明眾生中上勝事，乃至眾生乃至九眾生處，如是中得最寂滅勝事。",
        "translation": "It explains the superiority of the highest among sentient beings, up to the abode of sentient beings and even the nine abodes of sentient beings, such as when they attain the supreme state of tranquility.",
        "source": "T26n1523_003:0220a03_14"
    },
    {
        "source_sentence": "於心得自在勝事，及難伏生勝事，為防難故，說諸喻應知。",
        "translation": "It should be known that in order to prevent difficulties, the parables are spoken of.",
        "source": "T26n1523_003:0220a05_15"
    },
    {
        "source_sentence": "為防初勝難故，說二種大海生酥喻，無量眾生不受受用相似法故。",
        "translation": "In order to prevent the first difficulty, it's a metaphor for two kinds of oceanic butter that are produced in the ocean, because measureless sentient beings don't experience and enjoy similar dharmas.",
        "source": "T26n1523_003:0220a06_16"
    },
    {
        "source_sentence": "第二防難菩薩智有二，自及他無量眾生身中障對治故。",
        "translation": "The second is the bodhisattva' s knowledge of how to prevent difficulties because there are two kinds of wisdom: that which counteracts the hindrances in the bodies of self and other unlimited sentient beings.",
        "source": "T26n1523_003:0220a08_0"
    },
    {
        "source_sentence": "第三護難彼有二種，丈夫人喻，如上夫人處解脫應知。",
        "translation": "The third is of two kinds, that of protecting those who are resistant. It should be known that it is a metaphor for the liberation of men and women as described above.",
        "source": "T26n1523_003:0220a09_1"
    },
    {
        "source_sentence": "如貧人處諸聲聞乘及願。",
        "translation": "It's like the śrāvaka vehicle and vows of those in the poor place.",
        "source": "T26n1523_003:0220a10_2"
    },
    {
        "source_sentence": "是婢使處者，不捨眾生故。",
        "translation": "This is the maidservant's messenger's place because he doesn't abandon sentient beings.",
        "source": "T26n1523_003:0220a11_3"
    },
    {
        "source_sentence": "王處者，諸大乘願，以防護諸怨故。",
        "translation": "The king's place is the great vehicle vow to protect against enemies.",
        "source": "T26n1523_003:0220a11_4"
    },
    {
        "source_sentence": "初轉輪王喻，與如來真子故，防護無學勝事。",
        "translation": "The first is the parable of the wheel-turning king, because he's the true son of the Tathāgata and guards the superior things of post-learning.",
        "source": "T26n1523_003:0220a12_5"
    },
    {
        "source_sentence": "第二轉輪王喻，不斷佛種事故。",
        "translation": "The second is the metaphor of the wheel-turning king, which doesn't stop the events of the Buddha's lineage.",
        "source": "T26n1523_003:0220a13_6"
    },
    {
        "source_sentence": "防護阿羅漢勝事，堪應供故。",
        "translation": "It's because they guard the arhat's superior deeds, which are worthy of offerings.",
        "source": "T26n1523_003:0220a14_7"
    },
    {
        "source_sentence": "說第三轉輪王喻，授薩婆若因故。",
        "translation": "It's because the third wheel-turning king metaphor teaches the cause of sarvajña.",
        "source": "T26n1523_003:0220a14_8"
    },
    {
        "source_sentence": "防護說眾上勝事。",
        "translation": "He guards and explains the superior qualities of the multitude.",
        "source": "T26n1523_003:0220a15_9"
    },
    {
        "source_sentence": "以毘琉璃喻，初攝得菩提心故。",
        "translation": "It's because the Vaiśravaṇa metaphor first collects the mind that attains enlightenment.",
        "source": "T26n1523_003:0220a15_10"
    },
    {
        "source_sentence": "防護說法者，上勝事故。",
        "translation": "It's a superior event for someone who guards and teaches the Dharma.",
        "source": "T26n1523_003:0220a16_11"
    },
    {
        "source_sentence": "說藥樹王喻，能與眾生除煩惱病故。",
        "translation": "He teaches the parable of the king of the medicinal tree because he's able to remove the afflictions and illnesses of sentient beings.",
        "source": "T26n1523_003:0220a17_12"
    },
    {
        "source_sentence": "防護明眾生中上勝事喻者，無能捨月輪，如是能作一切眾生智慧光明故。",
        "translation": "The parable of protecting sentient beings with superior qualities means that they can't abandon the moon wheel because it thus creates the light of wisdom for all sentient beings.",
        "source": "T26n1523_003:0220a18_0"
    },
    {
        "source_sentence": "防護得最寂滅勝事，作月初喻，集功德智因助得菩提故。",
        "translation": "It's a metaphor for guarding the supreme attainment of quiescence, which is called the moon metaphor because it's the cause of accumulating merit and wisdom that helps to attain enlightenment.",
        "source": "T26n1523_003:0220a19_1"
    },
    {
        "source_sentence": "防護心得自在勝事喻琉璃珠，菩薩得薩婆若果故。",
        "translation": "The superiority of guarding the mind with self-dependence is a metaphor for the lapis lazuli pearl, because the bodhisattva attains the fruit of sarvajña.",
        "source": "T26n1523_003:0220a21_0"
    },
    {
        "source_sentence": "防護難復生勝事，喻如治毘琉璃珠故。",
        "translation": "It's a metaphor for curing the vaiḍūrya pearl because it protects against difficulties that will again give rise to superior things.",
        "source": "T26n1523_003:0220a22_1"
    },
    {
        "source_sentence": "心自在勝利養等諸聲聞功德者，依菩薩故。",
        "translation": "The mastery of mind, such as the superior benefits and nourishing qualities of śrāvakas, because they rely on bodhisattvas.",
        "source": "T26n1523_003:0220a23_2"
    },
    {
        "source_sentence": "如是此諸喻略說菩薩於聲聞中示勝功德故。",
        "translation": "Thus, these metaphors briefly explain that the bodhisattva shows superior merit among śrāvakas.",
        "source": "T26n1523_003:0220a24_3"
    },
    {
        "source_sentence": "自此已後廣說諸功德。",
        "translation": "From here on, we'll explain the merits in detail.",
        "source": "T26n1523_003:0220a25_4"
    },
    {
        "source_sentence": "有幾種聲聞，聲聞戒中菩薩戒有何勝事。",
        "translation": "How many kinds of śrāvakas are there, and what's the superior thing about the bodhisattva precepts in the śrāvaka precepts?",
        "source": "T26n1523_003:0220a25_5"
    },
    {
        "source_sentence": "有四種聲聞，復有十三種相，諸聲聞戒中菩薩戒有勝事應知。",
        "translation": "There are four kinds of śrāvakas and another 13 kinds of characteristics, and among the śrāvaka precepts, the bodhisattva precepts have superior qualities that should be known.",
        "source": "T26n1523_003:0220a26_6"
    },
    {
        "source_sentence": "是中有四種聲聞者，謂應聲聞、我慢聲聞、作菩提願聲聞及定滅性聲聞。",
        "translation": "Among these, there are four kinds of śrāvakas: those who should be śrāvakas, self-conceited śrāvakas, those who make the vow for enlightenment, and those with the cessation of concentration.",
        "source": "T26n1523_003:0220a28_0"
    },
    {
        "source_sentence": "是中應聲聞者，若為度眾生故，諸佛菩薩所化，是名應聲聞。",
        "translation": "This is called a śrāvaka who responds to the buddhas and bodhisattvas' teachings in order to save sentient beings, and this is called a śrāvaka who responds to the buddhas.",
        "source": "T26n1523_003:0220a29_1"
    },
    {
        "source_sentence": "我慢聲聞者，若唯眾生無我智故及邪法無我慢執智故以為淨，是名我慢聲聞。",
        "translation": "If only sentient beings are purified because they have selfless knowledge and mistakenly conceived knowledge of selflessness in regard to dharmas, this is called self-conceit śrāvaka.",
        "source": "T26n1523_003:0220b02_0"
    },
    {
        "source_sentence": "作菩提願聲聞者，若從本來憐愍心微少，以親近如來及以習故，於上妙佛法中身心信作功德相熏成，",
        "translation": "śrāvakas who undertake the vow for enlightenment, if their originally compassionate mind is weak, and because they're close to the Tathāgata and cultivate it, their bodies and minds and faith in the supremely wonderful Buddha-dharma are perfumed with the characteristic of merit.",
        "source": "T26n1523_003:0220b03_1"
    },
    {
        "source_sentence": "雖彼盡至住無漏戒中，而諸佛為勸說諸方便，彼以此因令得修大菩提；",
        "translation": "Even though they all abide in uncontaminated morality, still the Buddhas exhort and teach them means of salvation. Because of this cause they attain great enlightenment.",
        "source": "T26n1523_003:0220b06_2"
    },
    {
        "source_sentence": "雖如是修菩提，然後行中而是鈍根故及樂淨故，非如初發心而有佛性者，",
        "translation": "Even though they cultivate enlightenment in this way, it is because of the dull faculties and because of bliss and purity that there is a buddha-nature in their subsequent practice. They are not like the first development of mind:",
        "source": "T26n1523_003:0220b07_3"
    },
    {
        "source_sentence": "是故名菩提願聲聞。",
        "translation": "Therefore, they're called śrāvakas who vow to attain enlightenment.",
        "source": "T26n1523_003:0220b09_4"
    },
    {
        "source_sentence": "定滅性聲聞者，若從本來愍心微薄性故，一向背眾生及怖畏世間苦心故，",
        "translation": "śrāvakas with the nature of meditative cessation*”: Because, from the beginning, hatred and malice are weak in awarenesses. They absolutely turn their backs on beings and fear worldly frustration because they do not aspire to it.",
        "source": "T26n1523_003:0220b10_5"
    },
    {
        "source_sentence": "唯住向涅槃故，不堪得修大菩提。",
        "translation": "Because they only abide in the path leading to nirvāṇa, they can't cultivate great enlightenment.",
        "source": "T26n1523_003:0220b11_6"
    },
    {
        "source_sentence": "譬如二王子，形貌無異等同受王諸樂，於中一善達王法技藝等事，第二不如是。",
        "translation": "It's like two princes whose appearances are no different, and so forth, who all experience the king's pleasures in the same way, with one of them well understanding the king's teachings, arts, skills, and other things, and the second not like that.",
        "source": "T26n1523_003:0220b12_7"
    },
    {
        "source_sentence": "此二王子有技藝中勝故，非受用樂處，如是菩薩住無漏戒中及滅定性聲聞應知。",
        "translation": "Because these two princes are superior in both arts and crafts, they aren't pleasant places for enjoyment. Thus, bodhisattvas who abide in uncontaminated morality and śrāvakas with the cessation of concentration should be known.",
        "source": "T26n1523_003:0220b14_8"
    },
    {
        "source_sentence": "彼復有勝事，身中應知。",
        "translation": "Again, there's another superior thing that should be known in the body.",
        "source": "T26n1523_003:0220b16_9"
    },
    {
        "source_sentence": "及習諸白法處、智集處、相似處、性處、家持處、行處、神力處、修行處、福田處、上勝處、因果處及依生處應知。",
        "translation": "They should be known as the locus of accumulation of white dharmas, the locus of knowledge and accumulation, the locus of similarity, the locus of nature, the locus of home, the locus of practice, the locus of supernormal powers, the locus of cultivation, the locus of cultivation, the locus of field of merit, the superior locus,",
        "source": "T26n1523_003:0220b16_10"
    },
    {
        "source_sentence": "譬如種在空中而能生長者無有是處，種在雜穢良田中則能生長。",
        "translation": "It's like planting seeds in the sky that can grow, but there's no place for them to grow, and planting seeds in dirty good fields will grow.",
        "source": "T26n1523_003:0220b19_11"
    },
    {
        "source_sentence": "高原陸地不生蓮華。",
        "translation": "The lotus flowers don't grow in the high plains or on land.",
        "source": "T26n1523_003:0220b20_12"
    },
    {
        "source_sentence": "如是等喻，示現定滅性聲聞及說菩薩至心信勝事。",
        "translation": "Such metaphors show that śrāvakas and bodhisattvas with the cessation of concentration are sincerely convinced of superior things.",
        "source": "T26n1523_003:0220b21_13"
    },
    {
        "source_sentence": "定滅性聲聞如雜穢地，諸雜行於雜泥煩惱染，還恕諸眾生中背故。",
        "translation": "śrāvakas with the nature of cessation of concentration are like a defiled land, and their mixed practices are stained by afflictions in the muddy mud, which is because they're still forgiving sentient beings who turn their backs.",
        "source": "T26n1523_003:0220b22_14"
    },
    {
        "source_sentence": "一向涅槃界如地處熾然，於淨眾生界中同心及住心，反質菩薩向涅槃心及住淨眾生心，",
        "translation": "The realm of nirvana is always like a blazing fire on the ground, and in the realm of pure sentient beings it's the same mind and abiding mind; reverse bodhisattvas are headed toward nirvana with one mind and they abide in the mind of pure sentient beings.",
        "source": "T26n1523_003:0220b23_15"
    },
    {
        "source_sentence": "不捨有煩惱眾生度故，取雜染世間及攝取眾生，雖迭互等喻集諸白法處，",
        "translation": "Because they do not abandon the liberation of beings with defilement, they grasp the world and taking in sentient beings who are bound to it. Although they repeatedly metaphorically gather all the white doctrine-fields,",
        "source": "T26n1523_003:0220b25_16"
    },
    {
        "source_sentence": "示現作勝事。",
        "translation": "He shows that he's doing excellent things.",
        "source": "T26n1523_003:0220b27_17"
    },
    {
        "source_sentence": "聲聞有諸白法微薄，唯益自己；",
        "translation": "śrāvakas have various white dharmas that are weak, benefiting only themselves.",
        "source": "T26n1523_003:0220b27_18"
    },
    {
        "source_sentence": "菩薩法無量，利益增長一切眾生如子。",
        "translation": "The bodhisattva's teaching is immeasurable, benefiting and growing all sentient beings like a child.",
        "source": "T26n1523_003:0220b28_19"
    },
    {
        "source_sentence": "譬如父以生酥長養諸子，菩薩亦爾，自善根無量如生酥，養育增長新學菩薩如子男子。",
        "translation": "Just as a father nourishes his children with fresh butter, so does a bodhisattva nourish and grow newly trained bodhisattvas like children.",
        "source": "T26n1523_003:0220b29_20"
    },
    {
        "source_sentence": "虛空唯等示現智集勝事。",
        "translation": "Space is the only thing that equally shows the superior qualities of wisdom and accumulation.",
        "source": "T26n1523_003:0220c02_21"
    },
    {
        "source_sentence": "聲聞以無漏智故，唯見自身空寂。",
        "translation": "Because of their pure knowledge, the sravakas only see themselves as empty and void.",
        "source": "T26n1523_003:0220c03_22"
    },
    {
        "source_sentence": "諸煩惱中，菩薩者憐愍故同證智，令迴與十方一切眾生，發願向無上菩提故。",
        "translation": "Among the afflictions, the bodhisattva's pity causes all sentient beings in the ten directions to turn back and give rise to the vow to unsurpassed enlightenment.",
        "source": "T26n1523_003:0220c03_23"
    },
    {
        "source_sentence": "最大夫人及婢使喻，示現相似勝處。",
        "translation": "It's the parable of the greatest wife and maidservants who show similar superior places.",
        "source": "T26n1523_003:0220c05_24"
    },
    {
        "source_sentence": "聲聞念勝解脫。",
        "translation": "śrāvakas are mindful of superior liberation.",
        "source": "T26n1523_003:0220c06_25"
    },
    {
        "source_sentence": "最大夫人母處狹劣小意，如父貧窮心增長不成佛子。",
        "translation": "The eldest wife's mother is narrow and small-minded, like a father whose mind grows poor and doesn't become the Buddha's child.",
        "source": "T26n1523_003:0220c06_26"
    },
    {
        "source_sentence": "諸菩薩者捨下劣凡夫眾生性，念婢使母處，以上念心如灌頂大王成就故，",
        "translation": "The bodhisattvas abandon the nature of beings as inferior worldlings and are mindful of maidservants in their mother’s place, because these higher states of mind are like the accomplishment of coronation of a great king.",
        "source": "T26n1523_003:0220c08_27"
    },
    {
        "source_sentence": "名為佛子。",
        "translation": "They're called the heirs of the Buddha.",
        "source": "T26n1523_003:0220c09_28"
    },
    {
        "source_sentence": "初轉輪王喻，示現性處勝事。",
        "translation": "The first is the parable of the wheel-turning king, which shows the superiority of the manifestation of the abode of nature.",
        "source": "T26n1523_003:0220c10_29"
    },
    {
        "source_sentence": "如轉輪聖王子成就諸力，成就勢力成就至威，以無轉輪王相故不堪作轉輪聖王。",
        "translation": "It's like when a wheel-turning sage prince accomplishes his powers and accomplishes their momentum and authority, but because he doesn't have the characteristics of a wheel-turning king, he can't become a wheel-turning sage king.",
        "source": "T26n1523_003:0220c10_30"
    },
    {
        "source_sentence": "聲聞亦爾，以勤精進故成就諸力，諦善巧故成就勢力，不捨心故成就至威，",
        "translation": "So it is with the Sravaka: because of diligence and zeal, all powers are accomplished; because of truth and skill in means, all powers are accomplished; because of not giving up one’s mind, supreme majesty is accomplished.",
        "source": "T26n1523_003:0220c12_31"
    },
    {
        "source_sentence": "無佛性相故，諸佛如來不與擁護攝取。",
        "translation": "Because there are no buddha-natures and characteristics, the buddhas and tathāgatas don't embrace them.",
        "source": "T26n1523_003:0220c14_32"
    },
    {
        "source_sentence": "菩薩以第二轉輪王喻，示現持家勝事。",
        "translation": "The bodhisattva uses the second parable of the wheel-turning king to show the superior deeds of the householder.",
        "source": "T26n1523_003:0220c15_33"
    },
    {
        "source_sentence": "聲聞雖盡至故，未來不能持佛家，初發心菩薩堪能故。",
        "translation": "Even though śrāvakas are exhausted, they won't be able to maintain the Buddha's home in the future, because the first-arisen bodhisattva is capable of it.",
        "source": "T26n1523_003:0220c16_34"
    },
    {
        "source_sentence": "第三轉輪聖王喻，示現行勝處。",
        "translation": "The third is the metaphor of the wheel-turning sage king, which shows the superior place of practice.",
        "source": "T26n1523_003:0220c17_35"
    },
    {
        "source_sentence": "聲聞雖得盡至，諸天聖人不如是恭敬讚歎，如新行菩薩毘琉璃寶珠喻，",
        "translation": "Even though the śrāvakas have attained their full accomplishment, gods and sages don't venerate and praise them like this, just like the metaphor of the newly practicing bodhisattva Vaiśravaṇa with a precious pearl.",
        "source": "T26n1523_003:0220c18_0"
    },
    {
        "source_sentence": "示現神力勝事盡至。",
        "translation": "He manifested miraculous powers and accomplished the most excellent deeds.",
        "source": "T26n1523_003:0220c19_1"
    },
    {
        "source_sentence": "菩薩從初地，以智慧神力故，退一切聲聞緣覺。",
        "translation": "From the first ground, the bodhisattva withdrew from all śrāvakas and pratyekbuddhas because of his wisdom and supernormal powers.",
        "source": "T26n1523_003:0220c20_2"
    },
    {
        "source_sentence": "雪山藥樹喻，示現修行勝事。",
        "translation": "The metaphor of the medicinal tree in the Himalayas shows the superior qualities of cultivation.",
        "source": "T26n1523_003:0220c21_3"
    },
    {
        "source_sentence": "聲聞雖成就智能滅煩惱病，智藥滅眾生煩惱病。",
        "translation": "Although śrāvakas have accomplished the wisdom to extinguish the afflictive illnesses of sentient beings, the medicine of wisdom extinguishes the afflictive illnesses of sentient beings.",
        "source": "T26n1523_003:0220c21_4"
    },
    {
        "source_sentence": "反質菩薩者，唯常行益他故。",
        "translation": "A bodhisattva of opposite qualities only always practices for the benefit of others.",
        "source": "T26n1523_003:0220c22_5"
    },
    {
        "source_sentence": "星宿喻，示現福田勝事。",
        "translation": "The stars and constellations are metaphors that show the superior qualities of the field of merit.",
        "source": "T26n1523_003:0220c23_6"
    },
    {
        "source_sentence": "雖盡至聲聞，不能以智慧光照眾生故，不作福田度一切人天，如不滅煩惱菩薩一切人天而作福田。",
        "translation": "Even though they've exhausted themselves as śrāvakas, they can't illuminate sentient beings with the light of wisdom and don't create a field of merit to save all humans and gods, just like the bodhisattva who doesn't extinguish afflictions makes a field of merit for all humans and gods.",
        "source": "T26n1523_003:0220c24_7"
    },
    {
        "source_sentence": "月初月喻，示現於勝中示現勝事。",
        "translation": "The month of the moon is a metaphor for showing what's superior to show what's superior.",
        "source": "T26n1523_003:0220c26_8"
    },
    {
        "source_sentence": "一切時聲聞中，諸佛如來常勝，彼勝中諸菩薩復轉勝彼，從菩薩而成故。",
        "translation": "Among all the śrāvakas at the time, the buddhas and tathāgatas are always superior, and among those superior, the bodhisattvas also turn out to be superior to them because they're formed from bodhisattvas.",
        "source": "T26n1523_003:0220c27_9"
    },
    {
        "source_sentence": "諸菩薩有二種相故，轉勝應知。",
        "translation": "Because bodhisattvas have two kinds of characteristics, their superiority should be known.",
        "source": "T26n1523_003:0220c28_10"
    },
    {
        "source_sentence": "如是彼亦教化眾生及成熟佛法，是故有菩提及得果，隨所化眾生令得解脫。",
        "translation": "Thus, they also teach and transform sentient beings and ripen the Buddha's teachings; therefore, there's enlightenment and attainment that follows the transformation of sentient beings to attain liberation.",
        "source": "T26n1523_003:0220c29_11"
    },
    {
        "source_sentence": "譬如營作影者成奇異怖心不於食者，此亦如是應知。",
        "translation": "Good man, this is analogous to the case of someone who casts a shadow and becomes strangely frightened but does not eat. This should also be known in exactly like this.",
        "source": "T26n1523_003:0221a02_12"
    },
    {
        "source_sentence": "譬如諸天及人，一切世間善持琉璃，此喻示現因果勝事。",
        "translation": "It's like when gods and humans are well-maintained lapis lazuli in all the worlds of the world, this metaphor shows the superiority of cause and effect.",
        "source": "T26n1523_003:0221a03_13"
    },
    {
        "source_sentence": "聲聞雖一向修集淨法勝因，復值親近無量善知識，不能令得大菩提果。",
        "translation": "Even though śrāvakas have always cultivated the superior causes of the pure Dharma, they'll also meet and become intimate with measureless good teachers who won't allow them to attain the great fruit of enlightenment.",
        "source": "T26n1523_003:0221a04_14"
    },
    {
        "source_sentence": "反質故說諸菩薩者，能令得大菩提果故。",
        "translation": "It's called bodhisattvas because they can cause the fruit of great enlightenment to be attained.",
        "source": "T26n1523_003:0221a06_15"
    },
    {
        "source_sentence": "譬如治毘琉璃寶喻，示現依生勝事。",
        "translation": "It's like the parable of healing the vaiḍūrya jewel, which shows the superiority of dependent arising.",
        "source": "T26n1523_003:0221a07_16"
    },
    {
        "source_sentence": "諸聲聞者，依菩薩故而出現世間，非菩薩依聲聞而出世間。",
        "translation": "śrāvakas appear in the world because they rely on bodhisattvas, but it's not that bodhisattvas emerge from the world based on śrāvakas.",
        "source": "T26n1523_003:0221a08_17"
    },
    {
        "source_sentence": "為滅惡持住義故，語尊者摩訶迦葉言「迦葉：若有國中有駱駝咽黑頭仰明者，",
        "translation": "For the sake of extinguishing evil and maintaining it, he said to Venerable Mahākāśyapa, saying, Kāśyapa, suppose there's a country where there's a camel with a black-headed throat that looks upward.",
        "source": "T26n1523_003:0221a09_18"
    },
    {
        "source_sentence": "乃至彼國無有恐怖畏等事。",
        "translation": "Even in that country, there's no fear or other things like fear.",
        "source": "T26n1523_003:0221a11_19"
    },
    {
        "source_sentence": "是故迦葉！",
        "translation": "Therefore, Kāśyapa!",
        "source": "T26n1523_003:0221a12_20"
    },
    {
        "source_sentence": "菩薩常應救護利益眾生」者，有何漸次說，自此已後示現得彼果益勝事。",
        "translation": "The bodhisattva should always rescue and protect sentient beings for their benefit. What's the gradual teaching that since then, he's shown to attain the superior benefits of those fruits.",
        "source": "T26n1523_003:0221a12_21"
    },
    {
        "source_sentence": "前所說言雜染煩惱泥中能長菩薩佛法，若爾非彼身中增長者，亦非諸菩薩令助彼身中者，",
        "translation": "It has been said previously that the enlightening being can develop the buddha-dharma of enlightening beings in the mud of defilement. If this were so, it would not grow within those bodies, nor would enlightening beings assist them.",
        "source": "T26n1523_003:0221a14_22"
    },
    {
        "source_sentence": "云何彼身中而能增長菩薩？",
        "translation": "How can a bodhisattva grow in that body?",
        "source": "T26n1523_003:0221a16_23"
    },
    {
        "source_sentence": "為眾生故修諸行，示現此說。",
        "translation": "He cultivates practices for the sake of sentient beings and shows them this teaching.",
        "source": "T26n1523_003:0221a16_24"
    },
    {
        "source_sentence": "若增長彼者，亦增道自己。",
        "translation": "If it increases them, it also increases the path itself.",
        "source": "T26n1523_003:0221a17_25"
    },
    {
        "source_sentence": "經言「菩薩常應救護」如是等，示現至於四方一切世界一切菩薩願利益眾生事。",
        "translation": "The sūtras say, Bodhisattvas should always rescue and protect, and so forth, which show all the bodhisattva's vows to benefit sentient beings in all the worlds of the four directions.",
        "source": "T26n1523_003:0221a18_26"
    },
    {
        "source_sentence": "真實畢竟治者，所有離良醫療治身患，乃至離外道治煩惱，是名非真實治，",
        "translation": "Ultimately true and genuine antidote means that all those who are free of good doctors treating their physical illnesses, up to those who are free of non-Buddhists treating afflictions. This is called an unreal antidote.",
        "source": "T26n1523_003:0221a19_27"
    },
    {
        "source_sentence": "假名故及顛倒故。",
        "translation": "It's because it's nominal and mistaken.",
        "source": "T26n1523_003:0221a21_28"
    },
    {
        "source_sentence": "是中菩薩者喻良醫應知。",
        "translation": "Here, the bodhisattva is a metaphor for a good doctor who should know.",
        "source": "T26n1523_003:0221a22_29"
    },
    {
        "source_sentence": "一切眾生如病者，諸病者如貪等，藥者如不淨等觀，如有三種相故。",
        "translation": "All sentient beings are like a sick person, illnesses are like craving and so forth, and medicine is like the contemplation of impurity and so forth because there are three kinds of characteristics.",
        "source": "T26n1523_003:0221a22_30"
    },
    {
        "source_sentence": "諸大動而生諸病，或以積諸惡故，或不應食而食故，或以捨諸病故。",
        "translation": "It's because the great movements give rise to illnesses, either because they accumulate bad qualities, or because they eat without food, or because they abandon illnesses.",
        "source": "T26n1523_003:0221a24_31"
    },
    {
        "source_sentence": "如是此三種因，惡心相故生心病，或以積諸貪等惡故，於長夜中諸貪等習故。",
        "translation": "In this way, these three kinds of causes arise because of the characteristic marks of bad awarenesses*”’. Sometimes, it is because of the accumulation of such evil [things] as greed and so on: because of being conditioned by such [things] as greed and so on for a long time during the night.",
        "source": "T26n1523_003:0221a25_32"
    },
    {
        "source_sentence": "或以見不應行而行，復現有行諸見等事故，或行顛倒事捨故。",
        "translation": "Or they may act because views are not to be done, or they may also manifest such things as views that are done, or they may perform mistaken actions because they abandon them.",
        "source": "T26n1523_003:0221a27_33"
    },
    {
        "source_sentence": "是中初煩惱病，不淨等對治應知。",
        "translation": "The first of these is the disease of defilement, which should be known as the antidote for impurity and so on.",
        "source": "T26n1523_003:0221a28_34"
    },
    {
        "source_sentence": "以不淨對治諸貪，慈心對治瞋恚，四因緣觀對治愚癡。",
        "translation": "The mind of loving kindness is the antidote for hatred, and the four causes and conditions of contemplation are the antidote for folly.",
        "source": "T26n1523_003:0221a29_35"
    },
    {
        "source_sentence": "如是等說有病故為說對治。",
        "translation": "Thus, they say there's illness and therefore explain the antidote for it.",
        "source": "T26n1523_003:0221b01_36"
    },
    {
        "source_sentence": "諸空等依四種眾生故說：一者執見；",
        "translation": "Because emptiness, etc., are spoken of on the basis of four kinds of beings:",
        "source": "T26n1523_003:0221b02_37"
    },
    {
        "source_sentence": "二者樂著三摩拔提；",
        "translation": "The second is the state of blissful attachment to concentration.",
        "source": "T26n1523_003:0221b03_38"
    },
    {
        "source_sentence": "三者喜樂諸生；",
        "translation": "The third is to delight in all sentient beings.",
        "source": "T26n1523_003:0221b03_39"
    },
    {
        "source_sentence": "四者於非解脫處而作解脫想。",
        "translation": "Fourth, he gives rise to the perception of liberation in a place that's not liberation.",
        "source": "T26n1523_003:0221b04_40"
    },
    {
        "source_sentence": "是中依執著諸見眾生故，言「一切諸見唯空能治，若起空見」如是等說應知。",
        "translation": "Here, it's because sentient beings who cling to views say that all views are only opposed by emptiness, and if they give rise to views of emptiness, such teachings should be known.",
        "source": "T26n1523_003:0221b05_0"
    },
    {
        "source_sentence": "樂著三摩拔提故說無相，一切有無諸念分別相中無相故。",
        "translation": "It is said to be without characteristics because it delights in samāpatti. All that exist and do not exist are without characteristics within the imagined characteristics of mindfulness, because they are without characteristics.",
        "source": "T26n1523_003:0221b06_1"
    },
    {
        "source_sentence": "示現一切有無，示令樂著三昧，依喜樂諸生故說無願，滅一切欲色無色界等故說言無願。",
        "translation": "It is said to be wishless because it manifests all existences and nonexistences, and it is said to be wishless because it manifests the pleasure of being attached to samddhis. Because it depends on joy and bliss that are produced, it is said to be wishless.",
        "source": "T26n1523_003:0221b08_2"
    },
    {
        "source_sentence": "依非解脫處而作解脫相，說非四倒。",
        "translation": "The characteristic marks of liberation are made on the basis of what is not the sphere of disjunction. This is said to be no fourfold error.",
        "source": "T26n1523_003:0221b10_3"
    },
    {
        "source_sentence": "為滅一切倒故說四倒，見常等故。",
        "translation": "In order to eliminate all errors, four errors are spoken of:",
        "source": "T26n1523_003:0221b11_0"
    },
    {
        "source_sentence": "於非解脫處而生解脫相，捨習顛倒故，依有者故。",
        "translation": "The characteristic marks of liberation arise in spheres that are not liberation because they abandon the perversion of accumulation, because they rely on what exists.",
        "source": "T26n1523_003:0221b11_1"
    },
    {
        "source_sentence": "廣略說四顛倒對治應知。",
        "translation": "It should be known that the four counteracting hindrances of confusion are explained in detail.",
        "source": "T26n1523_003:0221b12_2"
    },
    {
        "source_sentence": "有凡夫復有六種：依著身者，對治彼故說諸念處。",
        "translation": "There are another six kinds of worldlings: those who rely on the body, because they oppose it and therefore speak of the applications of mindfulness.",
        "source": "T26n1523_003:0221b13_3"
    },
    {
        "source_sentence": "煩惱散者，對治彼故說四正勤；",
        "translation": "“Dispersal of defilement”: Because it is the antidote for this, four forms of right effort are spoken of.",
        "source": "T26n1523_003:0221b14_4"
    },
    {
        "source_sentence": "迭互我慢所縛者故，對治說諸如意足；",
        "translation": "The supernormal powers are said to be the antidote for those who are bound by mutual overlapping self-conceit.",
        "source": "T26n1523_003:0221b15_5"
    },
    {
        "source_sentence": "離修諸善故，對治彼說諸根及力；",
        "translation": "Because they are free from cultivating wholesomeness, they oppose the faculties and powers spoken of by those.",
        "source": "T26n1523_003:0221b16_6"
    },
    {
        "source_sentence": "不達諸諦故，對治說諸覺道分；",
        "translation": "Because they do not understand the truths, antidotes are said to be the factors of enlightenment.",
        "source": "T26n1523_003:0221b16_7"
    },
    {
        "source_sentence": "及喜好吉凶等見，對治故說諸道分。",
        "translation": "They are said to be the factors of the paths because they are opposed to such views as those of good fortune or bad fortune, etc.",
        "source": "T26n1523_003:0221b17_8"
    },
    {
        "source_sentence": "云何不順觀身墮身見，若我所見不分別，背善治法不信等應知。",
        "translation": "It should be known that if the view of self and what belongs to self are not differentiated, such [things] as turning one’s back on the doctrine of healing and not believing in it.",
        "source": "T26n1523_003:0221b18_9"
    },
    {
        "source_sentence": "彼對治故，說諸根及力。",
        "translation": "Because of the antidote, faculties and powers are spoken of.",
        "source": "T26n1523_003:0221b20_10"
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "Kasyapa!",
        "source": "T26n1523_003:0221b20_11"
    },
    {
        "source_sentence": "所有閻浮提內諸醫師及醫師弟子中，耆婆醫王最為第一。",
        "translation": "Among all the physicians and physician disciples in Jambudvīpa, the king of doctors Jīvaka is the best.",
        "source": "T26n1523_003:0221b20_12"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T26n1523_003:0221b22_13"
    },
    {
        "source_sentence": "假使三千大千世界中所有眾生，彼一切皆如耆婆醫王，如是等耆婆相似諸眾生，",
        "translation": "Suppose all the sentient beings in the 3,000 great one-thousand worlds are like the king of the jīvaka doctors, and these kinds of jīvaka-like sentient beings",
        "source": "T26n1523_003:0221b22_14"
    },
    {
        "source_sentence": "示現諸論醫方多聞善巧勝故，有辨取見、教悔見疑悔等難治故，是中方便定心故，",
        "translation": "Because it shows that the treatises and physicians are well versed in knowledge and skillful because they are superior. It is difficult to cure such [things] as criticism, taking hold of views, or admonishing oneself for regretting views, doubts, etc. This is because this is the mind concentrated with effort.",
        "source": "T26n1523_003:0221b24_15"
    },
    {
        "source_sentence": "諸見等能作障」。",
        "translation": "views and so forth can create hindrances.",
        "source": "T26n1523_003:0221b25_16"
    },
    {
        "source_sentence": "如尊者闡陀說「諸大德！",
        "translation": "As Venerable Cunda said, Great men!",
        "source": "T26n1523_003:0221b26_17"
    },
    {
        "source_sentence": "我作如是念：色是無常，乃至然復我行舍摩陀空無分別，滅愛離欲滅及涅槃中，",
        "translation": "I think: Form is impermanent, and yet my practice of shamelessness has no discrimination. In the cessation of craving, in the cessation of desire, in the cessation of sensual desire, and in nirvana",
        "source": "T26n1523_003:0221b26_18"
    },
    {
        "source_sentence": "心不安、不喜、不住、不解，我意迴轉生厭懈怠心。",
        "translation": "The mind is restless, disillusioned, unable to abide, and unable to understand, and my thoughts revolve and give rise to the mind of disillusionment and laziness.",
        "source": "T26n1523_003:0221b28_19"
    },
    {
        "source_sentence": "然何者是我所」。",
        "translation": "Still, which one is mine?",
        "source": "T26n1523_003:0221b29_20"
    },
    {
        "source_sentence": "作如是說，彼爾時以智慧心念憶涅槃，不滅我身見故，言我當無故，於涅槃中心退轉生惱。",
        "translation": "When someone says this, they're mindful of nirvāṇa with wisdom at that point because they don't cease their view of self and body, say I will be nonexistent, and become angry when they retreat from the center of nirvāṇa.",
        "source": "T26n1523_003:0221c01_21"
    },
    {
        "source_sentence": "然何者是我我所？",
        "translation": "What, however, is self and what belongs to self?",
        "source": "T26n1523_003:0221c03_22"
    },
    {
        "source_sentence": "不作如是念，此唯是行。",
        "translation": "They don't think like this, but these are only practices.",
        "source": "T26n1523_003:0221c03_23"
    },
    {
        "source_sentence": "以何誰彼無？",
        "translation": "Why is it that they are nonexistent?",
        "source": "T26n1523_003:0221c04_24"
    },
    {
        "source_sentence": "然此時世間道行不能治故，名為不可治。",
        "translation": "However, at this point in time, worldly paths and practices can't be cured, so they're called untreated.",
        "source": "T26n1523_003:0221c04_25"
    },
    {
        "source_sentence": "欲攝未入定心故，縛作疑悔，能散疑悔因故。",
        "translation": "Because they want to take in the mind that has not yet entered absorption. They are bound and make doubts and regrets because they can dispel the causes of doubts and regrets.",
        "source": "T26n1523_003:0221c05_26"
    },
    {
        "source_sentence": "除教誨者，唯諸佛如來并諸菩薩，無有諸毒患、有大力。",
        "translation": "Except for those who teach, only the buddhas, tathāgatas, and bodhisattvas have no poison or great power.",
        "source": "T26n1523_003:0221c06_27"
    },
    {
        "source_sentence": "是故唯說見疑悔，無力能覺知，意不能測，及不能說、不能誦、不能正說、不能以言。",
        "translation": "Therefore, it's only said to be doubtful and remorseful because they lack the power to perceive it, have no ideation of it, and can't speak, recite it, explain it correctly, or use words.",
        "source": "T26n1523_003:0221c07_28"
    },
    {
        "source_sentence": "求此助道行已，求出世間行，有餘中心求，然後有餘。",
        "translation": "After seeking these practices that aid in the path, he seeks out-of-world practices, and after having pursued them with a restful mind, he then has a restful mind.",
        "source": "T26n1523_003:0221c09_29"
    },
    {
        "source_sentence": "依眾生無我故，有二種應知。",
        "translation": "Because sentient beings lack self, there are two kinds that should be known.",
        "source": "T26n1523_003:0221c10_30"
    },
    {
        "source_sentence": "依法無我，有一緣入智等因，欲信本智信智，唯心是中諫斷，無緣覺及無我。",
        "translation": "The Dharma has no self, and there's a conditioned cognition of entry and so forth as a cause that wants to believe in the original cognition and believe in the cognition, but only mind is the middle remonstration, which has no pratyekabuddha or selflessness.",
        "source": "T26n1523_003:0221c11_31"
    },
    {
        "source_sentence": "因緣習中求覓，示現證人無我。",
        "translation": "Seeking to find it in the accumulation of causes and conditions, he shows that he realizes that people lack self.",
        "source": "T26n1523_003:0221c13_32"
    },
    {
        "source_sentence": "於內外入中及依彼念識處中妄想橫念性故，心不可得。",
        "translation": "The mind is ungraspable because it has the nature of delusion, pervasive thought, and horizontal thought in internal and external sense-fields as well as in the other bases of mindfulness and consciousness.",
        "source": "T26n1523_003:0221c13_33"
    },
    {
        "source_sentence": "及成就無色等相，見性故示現證法無我。",
        "translation": "and the accomplishment of such characteristics as formlessness: because of the nature of vision, they are shown to actualize the selflessness of dharmas.",
        "source": "T26n1523_003:0221c15_34"
    },
    {
        "source_sentence": "然是成就性故，作心事有護，不正取故。",
        "translation": "However, because it is with the nature of being accomplishedTM*’, there is protection for what is manifested by awarenesses and for mental formations: because they are not grasped correctly.",
        "source": "T26n1523_003:0221c16_35"
    },
    {
        "source_sentence": "言「迦葉！",
        "translation": "He said, Kāśyapa!",
        "source": "T26n1523_003:0221c17_36"
    },
    {
        "source_sentence": "心一切，諸佛不見故，言非自然故，不見示現住法體故，一切諸佛說三時見故」。",
        "translation": "The mind is all because the buddhas don't see it, say it's not natural, doesn't see the manifestation and abide in the essence of dharmas, and all the buddhas say it's because they see it at three times.",
        "source": "T26n1523_003:0221c17_37"
    },
    {
        "source_sentence": "如是先說無橫念分別性，彼橫念相，示現他性相說故，有依止故，言彼以何為性耳。",
        "translation": "In this way, it is first spoken of that there is no horizontal thought as differentiating nature. The characteristic marks of these horizontal thoughts are said to show the characteristic marks of other natures because they have support:",
        "source": "T26n1523_003:0221c19_38"
    },
    {
        "source_sentence": "於中明心及心數法。",
        "translation": "Here, we'll explain the mind and mental factors.",
        "source": "T26n1523_003:0221c21_0"
    },
    {
        "source_sentence": "若以意墮唯是相，此云何世間成生死釋成如幻？",
        "translation": "If it's because mental falling is only characteristic, then how does this world become birth-and-death and the explanation become illusory?",
        "source": "T26n1523_003:0221c21_1"
    },
    {
        "source_sentence": "唯是一心行者如河流，如是行厭離中心。",
        "translation": "The only thing that's practiced with one mind is like a river, and such practice is the center of disillusionment.",
        "source": "T26n1523_003:0221c22_2"
    },
    {
        "source_sentence": "何故不得解脫？",
        "translation": "Why doesn't he attain liberation?",
        "source": "T26n1523_003:0221c23_3"
    },
    {
        "source_sentence": "釋成就如風。",
        "translation": "He explains that accomplishment is like wind.",
        "source": "T26n1523_003:0221c23_4"
    },
    {
        "source_sentence": "是中遠至者，一切事中以彼性故應知。",
        "translation": "“This one reaches afar”: Among all things, it should be known because of its other-dependent nature.",
        "source": "T26n1523_003:0221c24_5"
    },
    {
        "source_sentence": "如是難知，云何得解脫？",
        "translation": "Thus, it's difficult to know how to attain liberation.",
        "source": "T26n1523_003:0221c25_6"
    },
    {
        "source_sentence": "釋成如燈焰。",
        "translation": "He explains that it's formed like the flame of a lamp.",
        "source": "T26n1523_003:0221c25_7"
    },
    {
        "source_sentence": "以無明緣力故行，示現彼盡故不行。",
        "translation": "It is practised because of the power of ignorance as supporting object. Because it manifests its exhaustion, it does not proceed.",
        "source": "T26n1523_003:0221c25_8"
    },
    {
        "source_sentence": "若心煩惱力故染成；",
        "translation": "If the mind is defiled because of the power of defilement, it becomes defiled.",
        "source": "T26n1523_003:0221c26_9"
    },
    {
        "source_sentence": "不者順如。",
        "translation": "If it doesn't, it follows thusness.",
        "source": "T26n1523_003:0221c27_10"
    },
    {
        "source_sentence": "彼煩惱不淨故，不見覺解脫，防護此患故，示現如虛空，防護諸患故，",
        "translation": "Because these defilements are impure, they do not see enlightenment and liberation. Because they guard against these dangers, they appear like space because they guard against the dangers.",
        "source": "T26n1523_003:0221c27_11"
    },
    {
        "source_sentence": "如虛空無分別故。",
        "translation": "It's because space has no discrimination like space.",
        "source": "T26n1523_003:0221c29_0"
    },
    {
        "source_sentence": "示現如雷電念念滅，貪等諸中不住故，示現無常相相故，示現防作異相患。",
        "translation": "It's shown like thunder and lightning ceasing in each thought because craving and so forth don't abide, and it's shown to have impermanent characteristics and characteristics, so it's shown to guard against the affliction of different characteristics.",
        "source": "T26n1523_003:0221c29_1"
    },
    {
        "source_sentence": "雖淨心念念滅故，示現如獼猴，彼非悕求種種境界故散。",
        "translation": "Even though it's because the pure mind ceases in every moment of thought, it's shown like a monkey, which isn't scattered because it doesn't long for various objects.",
        "source": "T26n1523_003:0222a02_2"
    },
    {
        "source_sentence": "是以順貪等各不能降，成有散故。",
        "translation": "Consequently, it is not possible to subdue the craving and so on: because they are said to be dispersed.",
        "source": "T26n1523_003:0222a03_3"
    },
    {
        "source_sentence": "何故不一切等共生？",
        "translation": "Why aren't all equally produced together?",
        "source": "T26n1523_003:0222a04_4"
    },
    {
        "source_sentence": "釋成如畫師事。",
        "translation": "Śākyamuni is like the work of a painter.",
        "source": "T26n1523_003:0222a04_5"
    },
    {
        "source_sentence": "何故不一切時？",
        "translation": "Why isn't it all the time?",
        "source": "T26n1523_003:0222a05_0"
    },
    {
        "source_sentence": "如是等造業釋成不住故。",
        "translation": "It's because these kinds of created karma explain that they don't abide.",
        "source": "T26n1523_003:0222a05_1"
    },
    {
        "source_sentence": "何故退現在業？",
        "translation": "What is the reason for falling back from present action?",
        "source": "T26n1523_003:0222a05_2"
    },
    {
        "source_sentence": "或以木現氣力故生，釋成如王事，所有業修力最上，彼熏心故得增上成顯說。",
        "translation": "Or it arises because of the power of wood manifesting energy. The interpretation is settled like a king’s deed; all actions and the power of spiritual practice are the highest. Because they permeate the mind, one acquires an ever-increasing unmanifest explanation.",
        "source": "T26n1523_003:0222a06_3"
    },
    {
        "source_sentence": "若如王者，何故自己能生諸苦？",
        "translation": "If it's like the king, then why can he himself cause suffering?",
        "source": "T26n1523_003:0222a08_4"
    },
    {
        "source_sentence": "釋成如怨家故。",
        "translation": "It's because the explanation becomes like a resentful family.",
        "source": "T26n1523_003:0222a08_5"
    },
    {
        "source_sentence": "何故自己如怨家？",
        "translation": "Why is he himself like a house of enemies?",
        "source": "T26n1523_003:0222a09_6"
    },
    {
        "source_sentence": "釋成如疾。",
        "translation": "He explains that it's accomplished like a disease.",
        "source": "T26n1523_003:0222a09_7"
    },
    {
        "source_sentence": "聚家示現故。",
        "translation": "It's because it's shown by a group of scholars.",
        "source": "T26n1523_003:0222a09_8"
    },
    {
        "source_sentence": "身等示現有四倒，順等行故防護患有如是。",
        "translation": "The body, etc., indicates that there are four errors: because of being conformable to such formations as the body and so on, they are protected from suffering in this way.",
        "source": "T26n1523_003:0222a10_9"
    },
    {
        "source_sentence": "以何故生樂處而取生事？",
        "translation": "Why is it that they are born in a happy place and then take the things that are produced?",
        "source": "T26n1523_003:0222a11_10"
    },
    {
        "source_sentence": "示現如怨家故，有三苦故，示現彼處亦生苦故。",
        "translation": "Because it is manifested as a house of enemies, because there are three forms of frustration®*”: because it is manifesting and also producing frustration in this place.",
        "source": "T26n1523_003:0222a11_11"
    },
    {
        "source_sentence": "如是苦，何故不取苦對治？",
        "translation": "Why is this kind of suffering not grasped as the antidote for suffering?",
        "source": "T26n1523_003:0222a12_12"
    },
    {
        "source_sentence": "示現如奪人力夜叉鬼等，防護樂著三昧故。",
        "translation": "It's shown like snatching human beings, yakṣa ghosts, and so forth, because they guard the samādhi of blissful attachment.",
        "source": "T26n1523_003:0222a13_13"
    },
    {
        "source_sentence": "如次復何故不樂對治中示現如賊作事，不防護不將彼？",
        "translation": "Why is it like a thief who doesn't delight in antidotes and shows up like a thief doing things, not guarding or leading them?",
        "source": "T26n1523_003:0222a14_14"
    },
    {
        "source_sentence": "助道行善根故。",
        "translation": "It's because they are the good roots that aid in the practice of the path.",
        "source": "T26n1523_003:0222a15_15"
    },
    {
        "source_sentence": "若以苦中作功德樂意樂住者，如是以何患示現？",
        "translation": "If someone abides with the intention to create merit and happiness in suffering, what kind of trouble does this show?",
        "source": "T26n1523_003:0222a16_16"
    },
    {
        "source_sentence": "如具有勢無勢憎愛事。",
        "translation": "It's like having momentum and no momentum to hate things that are desirable.",
        "source": "T26n1523_003:0222a17_17"
    },
    {
        "source_sentence": "何故？",
        "translation": "Why is it so?",
        "source": "T26n1523_003:0222a17_18"
    },
    {
        "source_sentence": "癡狂故。",
        "translation": "It's because they're deluded and crazy.",
        "source": "T26n1523_003:0222a18_0"
    },
    {
        "source_sentence": "著色等故，釋成如蛾滅燈故。",
        "translation": "It's because they're attached to form and so forth, explaining that it's like the moth ceasing a lamp.",
        "source": "T26n1523_003:0222a18_1"
    },
    {
        "source_sentence": "「佛語迦葉：求是心相而不可得，若不可得則不可見。",
        "translation": "The Buddha said to Kāśyapa, Seeking these marks of mind is unobtainable, and if it's unobtainable, it can't be seen.",
        "source": "T26n1523_003:0222a18_2"
    },
    {
        "source_sentence": "乃至如是聖性眾，非身作業、非口非意，彼性中亦無上中下差別，求是心相而不可得」者，",
        "translation": "Even so, these noble natures are not bodily actions, speech, or thought, and there's no distinction between superior, middle, or inferior in their nature; they can't be obtained by seeking the characteristics of this mind.",
        "source": "T26n1523_003:0222a20_0"
    },
    {
        "source_sentence": "有何漸次？",
        "translation": "What's the gradual order?",
        "source": "T26n1523_003:0222a22_0"
    },
    {
        "source_sentence": "示現他性相行已，如彼他性相求故，亦求橫妄念，及求成就性時彼示現。",
        "translation": "After they show the characteristics of other natures, just as they seek their other natures and characteristics, they also seek horizontal deluded thoughts, and they show them when they seek their accomplished nature.",
        "source": "T26n1523_003:0222a22_1"
    },
    {
        "source_sentence": "然彼橫妄想分別性，心理中求不可得。",
        "translation": "However, the discriminating nature of those horizontal and deluded conceptions is sought in the mind that they can't be found.",
        "source": "T26n1523_003:0222a23_2"
    },
    {
        "source_sentence": "是故性相不可得，彼亦是以不可得，所顯成就性相心彼則無為。",
        "translation": "Therefore, their nature and characteristics are unobtainable, and so they are also unobtainable. The mind that accomplishes the nature and characteristics of what's revealed is then nonexistent.",
        "source": "T26n1523_003:0222a24_3"
    },
    {
        "source_sentence": "後時當說，示彼三世生事，非如入滅盡定當時心不等三世生。",
        "translation": "At a later time, it will be explained that they show the things that arise in the three periods of time, not as when one enters the absorption of extinction. The mind at that time does not equally arise in the three periods of time.",
        "source": "T26n1523_003:0222a26_4"
    },
    {
        "source_sentence": "如是彼生事應知，示現過三世故。",
        "translation": "It should be known that the actual entities arising in this way are manifesting what is beyond the three periods of time.",
        "source": "T26n1523_003:0222a27_5"
    },
    {
        "source_sentence": "彼不過三世，起已復更生心故。",
        "translation": "They do not arise in any of the three time periods:",
        "source": "T26n1523_003:0222a28_6"
    },
    {
        "source_sentence": "若過三世者，彼亦不名有防護，橫執取故。",
        "translation": "If it goes beyond the three time periods, this also is no longer called ‘with protection’: because of being grasped horizontally.",
        "source": "T26n1523_003:0222a29_7"
    },
    {
        "source_sentence": "傍名示現亦有亦無，妄想念他想性等故，顯說成就性故有。",
        "translation": "Because deluded conceptions, thoughts of others, the nature of conceptual identification, etc., are said to be present because they manifest themselves as having the nature of accomplishment.",
        "source": "T26n1523_003:0222b01_8"
    },
    {
        "source_sentence": "彼則不生者，以觀身因故彼則無。",
        "translation": "“They do not arise”: Because of observing the body as cause, they are nonexistent.",
        "source": "T26n1523_003:0222b02_9"
    },
    {
        "source_sentence": "性者，於地獄等定性因故。",
        "translation": "“Nature”: Because of being the cause for such [things] as hell, etc.",
        "source": "T26n1523_003:0222b03_10"
    },
    {
        "source_sentence": "彼無趣者，作生因故則無。",
        "translation": "“They do not have an aim”: Because they are the efficient cause for rearising, they are nonexistent.",
        "source": "T26n1523_003:0222b03_11"
    },
    {
        "source_sentence": "滅者，已滅故。",
        "translation": "Cessation: because it has already been cessated.",
        "source": "T26n1523_003:0222b04_12"
    },
    {
        "source_sentence": "彼則無離者，以滅故。",
        "translation": "“They are not separate”: because of cessation.",
        "source": "T26n1523_003:0222b04_13"
    },
    {
        "source_sentence": "不離者，未滅故。",
        "translation": "Someone who doesn't part is because they haven't yet ceased.",
        "source": "T26n1523_003:0222b05_14"
    },
    {
        "source_sentence": "彼則無行業者，謂陰故。",
        "translation": "because of the aggregates.",
        "source": "T26n1523_003:0222b05_15"
    },
    {
        "source_sentence": "彼是無為者，為顯彼故說此一切彼無為。",
        "translation": "“They are unconditioned”: In order to indicate this, it is said that all these [things] are unconditioned.",
        "source": "T26n1523_003:0222b06_16"
    },
    {
        "source_sentence": "今欲分別釋安是一切聖性本者，以此念故得彼聖處，諸聖以此為顯。",
        "translation": "Now, we want to discern and explain that peace is the root of all noble natures because they attain their noble position because of this thought, and the sages show it here.",
        "source": "T26n1523_003:0222b07_0"
    },
    {
        "source_sentence": "然彼性以有餘、無餘涅槃所顯，及菩薩涅槃所顯。",
        "translation": "However, their nature is manifested by nirvana with or without remainder and that of the bodhisattva.",
        "source": "T26n1523_003:0222b08_1"
    },
    {
        "source_sentence": "是中依有餘涅槃故，言無有持戒亦無破戒。",
        "translation": "Because this is nirvāṇa with remainder in dependence, it's said that there's no observance of the precepts and no violation of the precepts.",
        "source": "T26n1523_003:0222b09_2"
    },
    {
        "source_sentence": "以善學戒故無行，有餘滅故非行有餘，滅有餘故非不行諸煩惱。",
        "translation": "Because of well-cultivating moral precepts, there are no formations; because of cessation with surplus, there are no formations. Because of cessation with surplus, there are no formations: because of cessation with surplus. Because of cessation with surplus, it is not the defilement that does not proceed.",
        "source": "T26n1523_003:0222b10_3"
    },
    {
        "source_sentence": "無心無心數法者，離染故。",
        "translation": "“Without awarenesses and without accompanying mental factors”: Because of being free from defilement.",
        "source": "T26n1523_003:0222b12_4"
    },
    {
        "source_sentence": "是中業者，復有煩惱因業故。",
        "translation": "This is action: because there are also defiled-causal actions.",
        "source": "T26n1523_003:0222b12_5"
    },
    {
        "source_sentence": "亦無業報者，依無餘涅槃故，言以是義故作如是說。",
        "translation": "Also without the retribution of action: because it depends on nirvana without remainder. It is said to be spoken of in this way because of this meaning.",
        "source": "T26n1523_003:0222b13_6"
    },
    {
        "source_sentence": "若無苦及無樂者，則是聖性，如前說言彼則無業者。",
        "translation": "If there is no suffering and no bliss, it is the nature of a sage. As has been said previously: “They have no action”:",
        "source": "T26n1523_003:0222b14_7"
    },
    {
        "source_sentence": "三修多羅句者，說彼業差別。",
        "translation": "The phrase three sūtra passages refers to the distinctions in their actions.",
        "source": "T26n1523_003:0222b15_8"
    },
    {
        "source_sentence": "第四句說眾生差別，依菩薩涅槃故，言是性平等如虛空，乃至是性真淨，",
        "translation": "The fourth sentence explains the distinctions among sentient beings because they rely on the bodhisattva' s nirvana. It is said that their nature is equal as space, up to its true purity of nature.",
        "source": "T26n1523_003:0222b16_9"
    },
    {
        "source_sentence": "從本已來畢竟淨故。",
        "translation": "It's because it's been perfectly pure since the distant past.",
        "source": "T26n1523_003:0222b18_10"
    },
    {
        "source_sentence": "是性平等如虛空者，示現等同行，自益他益故是性無勝。",
        "translation": "This is the nature that's equal like space because it's self-benefiting and benefiting others, so this is the nature that's unsurpassed.",
        "source": "T26n1523_003:0222b18_11"
    },
    {
        "source_sentence": "一切諸法等味者，示現諸淨菩薩中彼不異故，一切菩提分法中不異勝故。",
        "translation": "The equal taste of all dharmas shows that they aren't different among pure bodhisattvas, because they aren't different from the superiority of all the factors of enlightenment.",
        "source": "T26n1523_003:0222b19_12"
    },
    {
        "source_sentence": "是性寂靜遠離身心寂靜者，示現彼體不異故。",
        "translation": "This is the quiescence of nature that's far removed from the quiescence of body and mind because it shows that their essence isn't different.",
        "source": "T26n1523_003:0222b21_13"
    },
    {
        "source_sentence": "是性隨順向涅槃者，示現他身中有彼身業勝故。",
        "translation": "This is the one who naturally follows and goes to nirvana: because he manifests that bodily action exists in the body of another.",
        "source": "T26n1523_003:0222b22_14"
    },
    {
        "source_sentence": "是性寂靜遠離一切煩惱垢者，示現雖同解脫滅習有勝故。",
        "translation": "Its nature is quiescent and free of all the defilements, because although it manifests in the same way as liberation, cessation and accumulation have superiority.",
        "source": "T26n1523_003:0222b23_15"
    },
    {
        "source_sentence": "是性無我離我我所者，示現淨世界永滅定故。",
        "translation": "This is the essence of selflessness that's free of self and what belongs to self because it shows that the pure world is permanently extinguished.",
        "source": "T26n1523_003:0222b25_16"
    },
    {
        "source_sentence": "是性無惡若虛若實從平等生者，示現彼行中世間涅槃無失無得不生分別，",
        "translation": "Its nature is without evil, whether false or true, and arises from equanimity. It manifests worldly liberation in all its aspects, without loss or gain, without distinction, without acquisition or non-discrimination.",
        "source": "T26n1523_003:0222b26_17"
    },
    {
        "source_sentence": "以平等故。",
        "translation": "It's because of equality.",
        "source": "T26n1523_003:0222b28_0"
    },
    {
        "source_sentence": "實義故，涅槃是實；",
        "translation": "Because of their real meaning, nirvana is real.",
        "source": "T26n1523_003:0222b28_1"
    },
    {
        "source_sentence": "虛義故，世間不實應知。",
        "translation": "Because they are false in meaning, the world doesn't really know them.",
        "source": "T26n1523_003:0222b28_2"
    },
    {
        "source_sentence": "是性真實第一義諦者，示現離彼謗及非外道共故。",
        "translation": "This is the true and highest truth of reality by nature, because it shows being free of those who denigrate it and not common to non-Buddhists.",
        "source": "T26n1523_003:0222b29_3"
    },
    {
        "source_sentence": "是性無可盡畢竟不生者，示現雖得無餘涅槃不斷作眾生益故。",
        "translation": "Its nature is inexhaustible and ultimately unarisen because it shows that even though it attains nirvāṇa without remainder, it doesn't continue to work for the benefit of sentient beings.",
        "source": "T26n1523_003:0222c01_4"
    },
    {
        "source_sentence": "復是性畢竟不生者，示現彼非煩惱業生，以得勝自在力生故。",
        "translation": "“Furthermore, the nature absolutely does not arise”: Showing that it is no action of defilement that produces: because of arising by means of the power of acquisition of mastery.",
        "source": "T26n1523_003:0222c02_5"
    },
    {
        "source_sentence": "是性常住一切諸真如常者，示現住世及涅槃者。",
        "translation": "This is the one who shows abiding in the world and nirvāṇa when his nature is permanent and abiding in all true forms of permanence.",
        "source": "T26n1523_003:0222c04_6"
    },
    {
        "source_sentence": "彼不是故，說彼性是安樂清淨無我等應知。",
        "translation": "It should be known that their nature is peaceful, clean, and without self.",
        "source": "T26n1523_003:0222c05_7"
    },
    {
        "source_sentence": "是性真淨從本以來畢竟淨者，示現爾焰障淨故。",
        "translation": "This is the true purity of nature that's ultimately pure since the beginning because it shows the purity of the hindrance of such a flame.",
        "source": "T26n1523_003:0222c06_8"
    },
    {
        "source_sentence": "隨所應淨，顯示如是淨故。",
        "translation": "Whatever should be purified, it's shown to be thus purified.",
        "source": "T26n1523_003:0222c07_9"
    },
    {
        "source_sentence": "是故乃至世間出世間對治差別大義事應知。",
        "translation": "Therefore, the great meaning of the distinctions in worldly and transmundane antidotes should be known.",
        "source": "T26n1523_003:0222c08_10"
    },
    {
        "source_sentence": "此是以漸次及超次釋應知。",
        "translation": "This is because it's a gradual and transcendent explanation that should be known.",
        "source": "T26n1523_003:0222c09_11"
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "Kasyapa!",
        "source": "T26n1523_003:0222c09_12"
    },
    {
        "source_sentence": "菩薩至於四方應利益眾生」者，示現以世間出世間智等利益他故。",
        "translation": "Up to the four directions, bodhisattvas should benefit sentient beings' means to show that they benefit others with worldly and transmundane cognition and so forth.",
        "source": "T26n1523_003:0222c09_13"
    },
    {
        "source_sentence": "至四方者，何等四方？",
        "translation": "To the four directions, what are the four directions?",
        "source": "T26n1523_003:0222c11_14"
    },
    {
        "source_sentence": "謂為教化眾生故，從世界至餘世界。",
        "translation": "It means that in order to teach sentient beings, they go from one world to another.",
        "source": "T26n1523_003:0222c11_15"
    },
    {
        "source_sentence": "以神力故，從一世界至餘世界，中間如從國至餘國故，還彼世界中來生故，",
        "translation": "Because of supernatural powers, it goes from one world to another world. The intermediate being is like going from one country to another: because they return there and are born in that world.",
        "source": "T26n1523_003:0222c12_16"
    },
    {
        "source_sentence": "及彼處處取生故，令淨他故。",
        "translation": "and because of taking birth everywhere: because of causing to cleanse something else.",
        "source": "T26n1523_003:0222c14_17"
    },
    {
        "source_sentence": "隨有眾生彼諸菩薩所教化者，為彼淨故。",
        "translation": "Wherever there are sentient beings who are taught by those bodhisattvas, it's because of their purity.",
        "source": "T26n1523_003:0222c15_18"
    },
    {
        "source_sentence": "作真實畢竟治者，菩薩治煩惱以煩惱。",
        "translation": "A bodhisattva who creates a true and ultimate antidote treats afflictions by treating afflictions.",
        "source": "T26n1523_003:0222c16_19"
    },
    {
        "source_sentence": "大顛狂眾生，菩薩治故，得成無上大醫，教授三種清淨戒行故，非耆婆等諸大醫王能治諸見，",
        "translation": "Because great deluded sentient beings are healed by bodhisattvas, they attain the status of unsurpassed great physician because they teach the three kinds of pure precepts. It is not the case that such great physician kings as the Jīvaka can cure their views.",
        "source": "T26n1523_003:0222c17_0"
    },
    {
        "source_sentence": "及治除疑悔者。",
        "translation": "and those who remove doubts and remorse.",
        "source": "T26n1523_003:0222c19_1"
    },
    {
        "source_sentence": "或復治大者，真實治故名治大。",
        "translation": "It's also called healing because it's really healing.",
        "source": "T26n1523_003:0222c19_2"
    },
    {
        "source_sentence": "大者謂真實，不以是義然後真實畢竟治，以出世間道行滅煩惱使故成。",
        "translation": "The great one is the absolute truth. It is not because of these meanings that the absolute truth lasts; it is settled by means of the defilement-causing influence of going forth in a transmundane path and acting on cessation.",
        "source": "T26n1523_003:0222c20_3"
    },
    {
        "source_sentence": "是中間世智有二種：一、麁；",
        "translation": "4.5.29 There are two kinds of intermediate worldly knowledge:",
        "source": "T26n1523_003:0222c21_4"
    },
    {
        "source_sentence": "二、中。",
        "translation": "2. in the middle...",
        "source": "T26n1523_003:0222c22_5"
    },
    {
        "source_sentence": "麁，滅煩惱對治故。",
        "translation": "They are coarse because they extinguish the antidote for defilement.",
        "source": "T26n1523_003:0222c22_6"
    },
    {
        "source_sentence": "中者，以伏對治故。",
        "translation": "The middle one is because it subdues the antidote.",
        "source": "T26n1523_003:0222c23_0"
    },
    {
        "source_sentence": "所謂多貪欲者，不淨觀對治。",
        "translation": "The so-called many cravings are the antidote for the contemplation of impurity.",
        "source": "T26n1523_003:0222c23_1"
    },
    {
        "source_sentence": "乃至滅一切諸倒，有四倒如是滅。",
        "translation": "Up to the extinguishing of all errors, there are four errors that are thus extinguished.",
        "source": "T26n1523_003:0222c24_2"
    },
    {
        "source_sentence": "麁煩惱對治，四念處乃至八正道，中者伏對治。",
        "translation": "The antidote for debilitating defilement is four applications of mindfulness up to eightfold noble path; the middle one is the antidote for suppressing.",
        "source": "T26n1523_003:0222c24_3"
    },
    {
        "source_sentence": "是中麁煩惱於現境界中貪欲等行故轉成中應知。",
        "translation": "These are the debilitating afflictions in which craving and so forth are cultivated in the present realm because they're transformed into what should be known.",
        "source": "T26n1523_003:0222c25_4"
    },
    {
        "source_sentence": "是中行者，以世間智自境界相防染等煩惱，貪伏已令淨性行，是中性行。",
        "translation": "This is the middle aspect. Because of worldly knowledge and because of the characteristic marks of one’s own sphere, such defilement as being to be avoided by means of worldly knowledge®*” is so that after being subdued, it makes a pure aspect proceed.",
        "source": "T26n1523_003:0222c27_5"
    },
    {
        "source_sentence": "是中性行差別，在家之者多貪瞋癡等行，出家者多依諸見。",
        "translation": "These are the distinctions in their nature and practices, where those at home often practice craving, anger, delusion, and so forth, and those who leave home mostly rely on views.",
        "source": "T26n1523_003:0222c28_6"
    },
    {
        "source_sentence": "以依彼故及依不正念性念，性念分別廣略四種倒，非解脫處生解脫執慢。",
        "translation": "Because of depending on these, and relying on the one who is not with right mindfulness*” as basis: awarenesses arisen by a specific nature**!°. The four forms of perplexity that are differentiating in relation to this specific nature®’ and being extensive and concise regarding what is different from it*?",
        "source": "T26n1523_003:0223a01_7"
    },
    {
        "source_sentence": "是中貪欲等，觀不淨對治令清淨。",
        "translation": "Among these, craving and so forth observes the antidote that's impure and makes it pure.",
        "source": "T26n1523_003:0223a02_8"
    },
    {
        "source_sentence": "瞋者，慈悲觀對治。",
        "translation": "Anger is the antidote for contemplating compassion and pity.",
        "source": "T26n1523_003:0223a03_9"
    },
    {
        "source_sentence": "癡者，因緣觀對治。",
        "translation": "The antidote for delusion is the antidote for observing causes and conditions.",
        "source": "T26n1523_003:0223a03_10"
    },
    {
        "source_sentence": "諸見者，空對治。",
        "translation": "views are the antidote for emptiness.",
        "source": "T26n1523_003:0223a04_11"
    },
    {
        "source_sentence": "不正念所攝分別及性勝分別中，無相對治。",
        "translation": "Among the discriminations that are not included in right mindfulness, and among the discriminations that are inherently superior, there is no antidote to each other.",
        "source": "T26n1523_003:0223a04_12"
    },
    {
        "source_sentence": "復有悕願者，無願對治。",
        "translation": "Again, there's the vow of anger that's the antidote for wishlessness.",
        "source": "T26n1523_003:0223a05_13"
    },
    {
        "source_sentence": "非解脫處生解脫者，非不倒對治。",
        "translation": "A liberation that doesn't arise from the place of liberation is not the correct antidote for being liberated.",
        "source": "T26n1523_003:0223a06_14"
    },
    {
        "source_sentence": "譬如此處是常，是中煩惱。",
        "translation": "It's like this place that's permanent, and these are the afflictions in it.",
        "source": "T26n1523_003:0223a07_0"
    },
    {
        "source_sentence": "何者防麁煩惱？",
        "translation": "What's the antidote to debilitating afflictions?",
        "source": "T26n1523_003:0223a07_1"
    },
    {
        "source_sentence": "依自對治。",
        "translation": "They rely on their own antidotes.",
        "source": "T26n1523_003:0223a07_2"
    },
    {
        "source_sentence": "依染境界貪瞋癡事，於現境界中貪等行患。",
        "translation": "Depending on the defiled objects of craving, anger, and delusion, there are the afflictions of such volitions as craving in the present object.",
        "source": "T26n1523_003:0223a08_3"
    },
    {
        "source_sentence": "集是行義，滅彼故修念處等諸菩提分法。",
        "translation": "To accumulate is the meaning of practice, which extinguishes the factors of enlightenment such as cultivating mindfulness and so forth.",
        "source": "T26n1523_003:0223a09_4"
    },
    {
        "source_sentence": "以修念處法、正念中繫故，於未繫念心令得繫念故修行，不以此念自心起取言我修念處。",
        "translation": "Because the cultivation of mindfulness is bound to the Dharma and right mindfulness, he cultivates it because he attains mindfulness in an unfettered mind that's not fettered, and doesn't give rise to self-cultivating mindfulness with this thought as his own mind that says I am cultivating mindfulness.",
        "source": "T26n1523_003:0223a10_5"
    },
    {
        "source_sentence": "諸念中繫心已修行正勤，如意足取住。",
        "translation": "After fixing his mind in each thought, he cultivates right effort and abides with the supernormal power of grasping after cultivating right effort.",
        "source": "T26n1523_003:0223a12_6"
    },
    {
        "source_sentence": "以取住故，身心從男女相以內知觀故伏中煩惱，於有無漏智行道故，出世間法對治，",
        "translation": "Because of abiding in grasping, the body and mind are subdued by means of knowledge and contemplation regarding male and female characteristics. Because they proceed on the path of uncontaminated knowledge and action, they are antidote for transmundane dharmas.",
        "source": "T26n1523_003:0223a13_7"
    },
    {
        "source_sentence": "滅不欲等。",
        "translation": "The cessation of non-desire and so forth.",
        "source": "T26n1523_003:0223a15_8"
    },
    {
        "source_sentence": "依欲等對治，非與根力而令作見。",
        "translation": "It is not by reason of the power of their faculties that they are said to be capable of seeing.",
        "source": "T26n1523_003:0223a15_9"
    },
    {
        "source_sentence": "於有因緣集癡及人無我癡，以菩提分法伏，於有不正道及正道行中決定成。",
        "translation": "When there are causes and conditions for the delusion of accumulation and the delusion of selflessness of humans, they're subdued by the factors of enlightenment, and they're definitely accomplished in the practice of the right path and right path when there's an incorrect path.",
        "source": "T26n1523_003:0223a16_10"
    },
    {
        "source_sentence": "如是所有此處相麁中煩惱正防及伏對治。",
        "translation": "Thus, these are the afflictions that are correctly guarded and subdued in this place's characteristic debilitating tendencies.",
        "source": "T26n1523_003:0223a17_11"
    },
    {
        "source_sentence": "事智者，是名世界智。",
        "translation": "This is called worldly cognition.",
        "source": "T26n1523_003:0223a18_12"
    },
    {
        "source_sentence": "何者出世間智？",
        "translation": "What's transmundane cognition?",
        "source": "T26n1523_003:0223a19_13"
    },
    {
        "source_sentence": "如是伏貪瞋癡煩惱染處，及所有微細使煩惱對治事智。",
        "translation": "Thus, they subdue the defiled states of craving, anger, delusion, and all the subtle afflictive tendencies that oppose them.",
        "source": "T26n1523_003:0223a19_14"
    },
    {
        "source_sentence": "彼復何者？",
        "translation": "What's that again?",
        "source": "T26n1523_003:0223a21_15"
    },
    {
        "source_sentence": "於彼伏對治中善巧三處，所謂緣智、善巧、因緣。",
        "translation": "Among those subduing the antidote, skillfulness is threefold: so-called cognition as supporting object, skillfulness and causes and conditions.",
        "source": "T26n1523_003:0223a21_16"
    },
    {
        "source_sentence": "無我、無眾生、無命、無養育、無富伽羅法中生信智，可信人無我故，",
        "translation": "In the absence of self, in the absence of sentient beings, in the absence of life, in the absence of nourishment, and in the absence of personality, there arises faith and knowledge because one can believe that people have no self.",
        "source": "T26n1523_003:0223a22_17"
    },
    {
        "source_sentence": "於空無分別法中不生怖故。",
        "translation": "It's because fear doesn't arise in emptiness and nondiscriminating dharmas.",
        "source": "T26n1523_003:0223a23_18"
    },
    {
        "source_sentence": "信法無我故，求心生精進，所有盡度，過諸煩惱。",
        "translation": "Because they believe in the dharmas as selfless, they seek their minds to produce effort, and all of them are completely liberated, surpassing the afflictions.",
        "source": "T26n1523_003:0223a24_19"
    },
    {
        "source_sentence": "對治教四種：無智不取故，觀內心用意於智，同相、自相、染相及淨相。",
        "translation": "The antidote teaches that there are four kinds: because they lack knowledge and don't grasp it, they contemplate the mind internally with respect to knowledge, which has similar characteristics, distinctive characteristics, defiled characteristics, and pure characteristics.",
        "source": "T26n1523_003:0223a25_20"
    },
    {
        "source_sentence": "於無智是中有三種想同想義應知。",
        "translation": "In the absence of cognition, there are three kinds of conceptions that share the same conceptual meaning as should be known.",
        "source": "T26n1523_003:0223a27_21"
    },
    {
        "source_sentence": "彼如是求心。",
        "translation": "They thus seek their mind.",
        "source": "T26n1523_003:0223a27_22"
    },
    {
        "source_sentence": "何者心？",
        "translation": "What's mind?",
        "source": "T26n1523_003:0223a28_23"
    },
    {
        "source_sentence": "可樂、可染、可恥，為過去未來現在所有。",
        "translation": "Joyful, defiled, and shameful are past, future, and present existences.",
        "source": "T26n1523_003:0223a28_24"
    },
    {
        "source_sentence": "過去者是名盡，未來者未至，現在者念念不住。",
        "translation": "The one of the past is called ‘extinguished’; the one of the future has not arrived yet. The one of the present does not abide moment to moment.",
        "source": "T26n1523_003:0223a29_25"
    },
    {
        "source_sentence": "是中過去、未來緣成心皆無覺觀，現在者念念無覺故。",
        "translation": "In this, the mind formed by past and future conditions is without initial thought or sustained thought: because in the present moment of thought there is no initial thought.",
        "source": "T26n1523_003:0223b01_26"
    },
    {
        "source_sentence": "及諸貪等自緣所生，非心所作等諸相心自相應知。",
        "translation": "It should be known that such characteristics as craving, and so on, which arise by specific supporting objects. Such characteristics as what is not made by awarenesses are the specific characteristics of awarenesses.",
        "source": "T26n1523_003:0223b02_27"
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "Kasyapa!",
        "source": "T26n1523_003:0223b03_28"
    },
    {
        "source_sentence": "是心不在內、不在外、不在中間」，覺故如是心求不可得，如本說假名說性不可得故。",
        "translation": "It's because the mind isn't inside, isn't outside, and isn't in between. Because it's perceived, such-and-such a mind that's sought after is unobtainable, just as the originally explained nominally named nature of being said to be unobtainable.",
        "source": "T26n1523_003:0223b03_29"
    },
    {
        "source_sentence": "是心無色無形、無住無相、無記無著。",
        "translation": "This mind is formless, formless, formless, formless, signless, indeterminate, and without attachment.",
        "source": "T26n1523_003:0223b05_30"
    },
    {
        "source_sentence": "如是如前六種相，知真如故，一切言諸佛不已見、不今見、不當見故，",
        "translation": "Thus, as before, these six kinds of characteristics are known as true because they all say the buddhas aren’t seen, aren’t seen now, and won’t be seen.",
        "source": "T26n1523_003:0223b06_31"
    },
    {
        "source_sentence": "一切諸聖不以知見覺故。",
        "translation": "All the sages don't perceive it because they know and see it.",
        "source": "T26n1523_003:0223b08_32"
    },
    {
        "source_sentence": "種相故心有染相應知。",
        "translation": "It's because of the seed characteristics that the mind has defiled characteristics associated with knowing.",
        "source": "T26n1523_003:0223b08_33"
    },
    {
        "source_sentence": "不順不順故，及行行故，故心如幻。",
        "translation": "Because of being disobedient and because of proceeding, the awarenesses are as illusions.",
        "source": "T26n1523_003:0223b09_34"
    },
    {
        "source_sentence": "以虛妄憶想分別起，種種業行生，受種種身心，諸道中受種種身生。",
        "translation": "They are produced by false recollection and discrimination, various actions arise, different bodies and minds are experienced, and various bodies are experienced in the paths.",
        "source": "T26n1523_003:0223b10_35"
    },
    {
        "source_sentence": "不順染故，心如流水。",
        "translation": "Because it is not subject to defilement, the mind is like running water.",
        "source": "T26n1523_003:0223b11_36"
    },
    {
        "source_sentence": "生滅不住者，還彼生以自順念念流故。",
        "translation": "“Birth and cessation do not abide”: The one who returns to these forms of birth because he himself follows the stream of mindfulness.",
        "source": "T26n1523_003:0223b12_37"
    },
    {
        "source_sentence": "心如風遠行去不可捉者，一切念中難治。",
        "translation": "When the mind is like a wind that travels far away and can't be grasped, it's difficult to treat in all thoughts.",
        "source": "T26n1523_003:0223b12_38"
    },
    {
        "source_sentence": "順行故心如燈焰。",
        "translation": "It's because the mind follows actions like a flame of a lamp.",
        "source": "T26n1523_003:0223b13_39"
    },
    {
        "source_sentence": "眾因緣有行者，受潤自在，順行染故，隨所行而能行故，此是行染。",
        "translation": "Conditioned by many causes and conditions, conditioned: because of being nourished freely. Because it is defiled by what follows conditioned; because it can be conditioned according to that which is conditioned. This is the defilement conditioned.",
        "source": "T26n1523_003:0223b14_40"
    },
    {
        "source_sentence": "何處行心如電？",
        "translation": "Where is the mind that acts like a flash of lightning?",
        "source": "T26n1523_003:0223b15_41"
    },
    {
        "source_sentence": "或向作善處行，或如電生善心時心如虛空，或向不善知如虛，客塵煩惱染故。",
        "translation": "Sometimes they're directed toward doing good places, sometimes their mind is like space when a lightning flash gives rise to good thoughts, and sometimes they're directed toward unwholesome knowing as space because they're defiled by guest dust and afflictions.",
        "source": "T26n1523_003:0223b16_42"
    },
    {
        "source_sentence": "心如獼猴，一向貪諸境界故。",
        "translation": "The mind is like a rhesus monkey because it always clings to objects.",
        "source": "T26n1523_003:0223b18_43"
    },
    {
        "source_sentence": "心如畫師，一向起作諸業行故。",
        "translation": "The mind is like a painter, because it always produces actions.",
        "source": "T26n1523_003:0223b18_44"
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "Kasyapa!",
        "source": "T26n1523_003:0223b19_45"
    },
    {
        "source_sentence": "心不一定，能逐種種煩惱」者，或一向煩惱中復能行貪欲瞋癡，不住而行故。",
        "translation": "The mind doesn't necessarily follow various afflictions, or it might be able to practice craving, anger, and delusion in a single affliction because it doesn't abide and acts.",
        "source": "T26n1523_003:0223b19_46"
    },
    {
        "source_sentence": "心如獨行無侶者，非彼本有染貪已而有成離已離，離欲已而復有欲。",
        "translation": "The mind is like a solitary practitioner who has no companions. It is not that the originally existing defiled craving exists after becoming settled and disjunctioned, and there is again desire after being disjunctioned from it.",
        "source": "T26n1523_003:0223b21_47"
    },
    {
        "source_sentence": "如是等釋，說心如王，得一切法自在故，於樂法中得自在世力而行故。",
        "translation": "Such explanations say that mind is like a king because it attains mastery over all dharmas and acts with the power of worldly attainment in the happiness of dharmas.",
        "source": "T26n1523_003:0223b22_48"
    },
    {
        "source_sentence": "心如怨家，能生一切苦故，捨己樂能生苦故。",
        "translation": "The mind is like a house of enemies, because it produces all kinds of suffering and because abandoning one’s own pleasure produces suffering.",
        "source": "T26n1523_003:0223b24_49"
    },
    {
        "source_sentence": "心如灰家、如魚鉤、如夢、如青蠅，以執無我故自能生苦。",
        "translation": "The mind is like an ash house, like a fish hook, like a dream, and like a tiny fly; because it clings to selflessness, it can itself give rise to suffering.",
        "source": "T26n1523_003:0223b25_50"
    },
    {
        "source_sentence": "然以顛倒如怨家，助自己苦不厭足故。",
        "translation": "However, it's because they're mistaken like enemies who help themselves to suffer and don't tire of being satisfied.",
        "source": "T26n1523_003:0223b26_51"
    },
    {
        "source_sentence": "心如奪人力夜叉鬼令修善捨，彼覓便故。",
        "translation": "The mind is like taking human beings away from a yakṣa spirit and causing them to cultivate good equanimity, which is because they look for an advantage.",
        "source": "T26n1523_003:0223b27_52"
    },
    {
        "source_sentence": "心如怨家，行不善覓諸過故。",
        "translation": "The mind is like an enemy's house, which acts unwholesomely and looks for faults.",
        "source": "T26n1523_003:0223b28_53"
    },
    {
        "source_sentence": "常高下有勢無勢，愛憎等解故。",
        "translation": "Being always high and low, they have momentum and no momentum: because of such understandings as craving and hatred.",
        "source": "T26n1523_003:0223b29_54"
    },
    {
        "source_sentence": "心如賊，至放逸故，所作不作一切善根能滅故。",
        "translation": "The mind is like a thief, up to the point where it's careless because all good roots that are done and not done can be extinguished.",
        "source": "T26n1523_003:0223c01_55"
    },
    {
        "source_sentence": "心樂諸色等，色等境界樂著故。",
        "translation": "The mind delights in such [things] as form, because it delights in objects like form and so on.",
        "source": "T26n1523_003:0223c02_56"
    },
    {
        "source_sentence": "於永可得甘露界中憶念，憶念已令難安故。",
        "translation": "It's because it's permanently attainable in the realm of ambrosia and remembered, and after remembering it, it makes it difficult to be comfortable.",
        "source": "T26n1523_003:0223c02_57"
    },
    {
        "source_sentence": "以三種相故，心得清淨應知，不得得相故，非有為相故，二無相故，三性相故。",
        "translation": "Because of these three kinds of characteristic marks, the awarenesses of mind should be known to be clean: because they do not acquire characteristic marks; because they are not with conditioned characteristic marks; because two have no characteristic marks; and because of the characteristic marks of the three natures.",
        "source": "T26n1523_003:0223c03_58"
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "Kasyapa!",
        "source": "T26n1523_003:0223c05_59"
    },
    {
        "source_sentence": "是心求不可得」。",
        "translation": "It's because the mind seeks what's unobtainable.",
        "source": "T26n1523_003:0223c05_60"
    },
    {
        "source_sentence": "若不可得故不可覺知，名性求覓不可得。",
        "translation": "If it's unobtainable because it can't be perceived, then the name-nature seeking is unobtainable.",
        "source": "T26n1523_003:0223c06_61"
    },
    {
        "source_sentence": "是不得故，彼不可覺知。",
        "translation": "Because they can't get it, they can't perceive it.",
        "source": "T26n1523_003:0223c07_62"
    },
    {
        "source_sentence": "心有如是相，觀是心淨因已，故有異思惟行。",
        "translation": "The mind has such characteristics, and after observing these pure causes of mind, there's the practice of different contemplation.",
        "source": "T26n1523_003:0223c07_63"
    },
    {
        "source_sentence": "求心淨不能得，如是思惟已令能得，是名不得得相。",
        "translation": "Seeking to purify the mind that can't obtain it and thus contemplating it so that it can be obtained is called not getting the characteristic of attaining.",
        "source": "T26n1523_003:0223c08_64"
    },
    {
        "source_sentence": "如是修行法無我修行，行已以慧，是真如相。",
        "translation": "Thus cultivating the practice of selflessness in terms of cultivating dharmas that are cultivated, and having done so with wisdom, is the characteristic of true reality.",
        "source": "T26n1523_003:0223c09_65"
    },
    {
        "source_sentence": "心以智見，然後真如相心以九種相說。",
        "translation": "The mind sees it with wisdom, and then the true characteristics of the mind are explained in terms of nine kinds of characteristics.",
        "source": "T26n1523_003:0223c10_66"
    },
    {
        "source_sentence": "對有為相法故說九無為應知。",
        "translation": "It's because the nine unconditioned dharmas are explained in terms of conditioned dharmas that should be known.",
        "source": "T26n1523_003:0223c11_67"
    },
    {
        "source_sentence": "過三世者，非三世行故。",
        "translation": "The one who goes beyond the three periods of time is because it does not proceed in the three periods of time.",
        "source": "T26n1523_003:0223c12_68"
    },
    {
        "source_sentence": "復非如入滅盡定，起已復能生故。",
        "translation": "It is also not like entering the absorption of total extinction, because it can arise again after being produced.",
        "source": "T26n1523_003:0223c13_69"
    },
    {
        "source_sentence": "彼非有非無者，假名性不可分別測故，以真如性可測知彼非二相故。",
        "translation": "“They are neither with nor without”: Because the nature of a metaphor is unfathomable and cannot be differentiated, because it is possible to know by means of the nature of suchness that they are not two distinct characteristics.",
        "source": "T26n1523_003:0223c13_70"
    },
    {
        "source_sentence": "彼不生者，無生相故。",
        "translation": "“They do not arise”: Because they have no characteristic marks of birth.",
        "source": "T26n1523_003:0223c15_71"
    },
    {
        "source_sentence": "彼無性者，過生性因相故。",
        "translation": "“They are without a nature”: Because of the characteristic marks of the cause that goes beyond the nature of arising.",
        "source": "T26n1523_003:0223c15_72"
    },
    {
        "source_sentence": "彼則無起者，未來中過諸生故。",
        "translation": "“They then have no arising”: Because in the future, there are transgressive forms of birth.",
        "source": "T26n1523_003:0223c16_73"
    },
    {
        "source_sentence": "彼則無滅者，過分段死故。",
        "translation": "“They then are without cessation”: Because of transgressing from segmental dying.",
        "source": "T26n1523_003:0223c17_74"
    },
    {
        "source_sentence": "彼無所離者，過離念念故。",
        "translation": "“They have nothing to be separation from”: Because they are free from what is past, present and future.",
        "source": "T26n1523_003:0223c17_75"
    },
    {
        "source_sentence": "無所離者，則無來無去。",
        "translation": "When there's nothing to part with, then there's neither coming nor going.",
        "source": "T26n1523_003:0223c18_76"
    },
    {
        "source_sentence": "無退無生者，過轉諸道故。",
        "translation": "The one who does not fall back and the one who does not arise: because of transmigratory paths.",
        "source": "T26n1523_003:0223c18_77"
    },
    {
        "source_sentence": "是中無行業者，過業煩惱故。",
        "translation": "There is no conditioned action in this: because it goes beyond the defilement of action.",
        "source": "T26n1523_003:0223c19_78"
    },
    {
        "source_sentence": "若無為者則是聖種性。",
        "translation": "If it's nonexistent, then it's the noble seed nature.",
        "source": "T26n1523_003:0223c20_79"
    },
    {
        "source_sentence": "是中性相者，謂無為界相應知，以見彼故顯諸聖事。",
        "translation": "The nature and characteristics of these are that which is associated with knowledge regarding the unconditioned realm: because of seeing them, noble things are manifested.",
        "source": "T26n1523_003:0223c20_80"
    },
    {
        "source_sentence": "然彼現法中過五事若聖性。",
        "translation": "However, in the present life, there are five things that go wrong if they're noble.",
        "source": "T26n1523_003:0223c21_81"
    },
    {
        "source_sentence": "彼無有持戒者，過作事故。",
        "translation": "They don't have anyone who observes the precepts, and they do things wrong.",
        "source": "T26n1523_003:0223c22_82"
    },
    {
        "source_sentence": "亦無破戒者，過無作故。",
        "translation": "There's also no one who breaks the precepts because they're unconstructed.",
        "source": "T26n1523_003:0223c23_83"
    },
    {
        "source_sentence": "無行者，過作行故。",
        "translation": "The one without formations is because of transgressing formations.",
        "source": "T26n1523_003:0223c23_84"
    },
    {
        "source_sentence": "非無行者，過作非行故。",
        "translation": "“It is not without application”: Because what is manifested by transgressions is not application.",
        "source": "T26n1523_003:0223c24_85"
    },
    {
        "source_sentence": "及非行者，過不作行故，及未來過有事故。",
        "translation": "The one who does not practise is because of transgressing and the one who does not practise. It is also with future transgressions as an event.",
        "source": "T26n1523_003:0223c24_86"
    },
    {
        "source_sentence": "是則無心無心數法者，過諸復有生，發起行故。",
        "translation": "“These are the dharmas that are without awarenesses and without accompanying mental factors”: Moreover, there are further forms of birth: because they produce formations.",
        "source": "T26n1523_003:0223c25_87"
    },
    {
        "source_sentence": "無發者，過彼行故。",
        "translation": "The absence of arousal is because it goes beyond that which is conditioned.",
        "source": "T26n1523_003:0223c26_88"
    },
    {
        "source_sentence": "無業報者，過彼生家故。",
        "translation": "Someone who has no karmic retribution goes beyond that because they'll be born at home.",
        "source": "T26n1523_003:0223c27_89"
    },
    {
        "source_sentence": "彼無有苦亦復無樂者，過彼所依有勢無勢故。",
        "translation": "“They have neither unsatisfactoriness nor satisfaction”: Because, beyond that on which they rely, there is momentum and no momentum.",
        "source": "T26n1523_003:0223c27_90"
    },
    {
        "source_sentence": "是中無業無起業行，然彼性中非身作業非口非心者，依苦樂一切有記動轉故。",
        "translation": "In this case, there is no action and no producing action. However, in the nature of that which is neither bodily action nor verbal action nor mind: because it proceeds on the basis of unsatisfactoriness and satisfaction®”*! of all conditioned factors as supporting object.",
        "source": "T26n1523_003:0223c28_91"
    },
    {
        "source_sentence": "無業者，過諸學戒故。",
        "translation": "It is without action: because it goes beyond the precepts of the seeker.",
        "source": "T26n1523_003:0224a01_92"
    },
    {
        "source_sentence": "無起業行者，過諸願故。",
        "translation": "There are no actions that give rise to karma because it's beyond the vows.",
        "source": "T26n1523_003:0224a02_93"
    },
    {
        "source_sentence": "然彼性中非身等作業者，過不受報故。",
        "translation": "However, it is not bodily or similar action by nature: because of being faulty and not experiencing retribution.",
        "source": "T26n1523_003:0224a02_94"
    },
    {
        "source_sentence": "彼性中亦無上下差別者，過依彼種種身故。",
        "translation": "Also, there is no difference between the higher and lower in their natures: because they are different from one another.",
        "source": "T26n1523_003:0224a03_95"
    },
    {
        "source_sentence": "然彼有四時九種相差別性相應知。",
        "translation": "However, there are four times when they have nine kinds of distinctive characteristics that should be known.",
        "source": "T26n1523_003:0224a04_96"
    },
    {
        "source_sentence": "不淨時、淨時、證時及盡時，是性平等如虛空者，不淨時等至一切諸相，",
        "translation": "When it's impure, when it's pure, when it's realized, and when it's exhausted, its nature is equal like space. When it's impure, all characteristics are equal up to all characteristics.",
        "source": "T26n1523_003:0224a05_97"
    },
    {
        "source_sentence": "如空如虛空遍，一切色一切相中真如亦爾。",
        "translation": "Just as space pervades like space, so does the true nature in all forms and all characteristics.",
        "source": "T26n1523_003:0224a06_98"
    },
    {
        "source_sentence": "現者，淨時見等至，此是不淨時。",
        "translation": "“manifest”: At the moment of being pure, such-and-such vision is appeased. This is an impure moment.",
        "source": "T26n1523_003:0224a07_99"
    },
    {
        "source_sentence": "一相是性無分別，一切諸法等味故。",
        "translation": "The one characteristic mark is by nature nondiscriminating: because all factors are equal in suchness of taste.",
        "source": "T26n1523_003:0224a08_100"
    },
    {
        "source_sentence": "是性寂靜遠離身。",
        "translation": "It's the quiescence of nature that's far removed from the body.",
        "source": "T26n1523_003:0224a09_101"
    },
    {
        "source_sentence": "心寂靜者淨時，一味及身心寂靜故。",
        "translation": "When the mind is quiescent, it's when it's pure because the single flavor and body and mind are quiescent.",
        "source": "T26n1523_003:0224a09_102"
    },
    {
        "source_sentence": "淨時有二種相應知。",
        "translation": "When it's pure, there are two kinds of concomitant knowing.",
        "source": "T26n1523_003:0224a10_103"
    },
    {
        "source_sentence": "是相寂靜，隨順向涅槃故。",
        "translation": "This characteristic is quiescent because it follows the path leading to nirvāṇa.",
        "source": "T26n1523_003:0224a11_104"
    },
    {
        "source_sentence": "是性清淨遠離一切煩惱垢者，永證故，是故隨順及以清淨，是故順向盡至證得時，",
        "translation": "This is the one whose nature is pure and free from all defilements because of their eternal realization. That is why they are obedient and because of being pure. Therefore, when they realize it, they will be obedient and completely pure.",
        "source": "T26n1523_003:0224a11_105"
    },
    {
        "source_sentence": "是名證時。",
        "translation": "This is called the time of realization.",
        "source": "T26n1523_003:0224a13_106"
    },
    {
        "source_sentence": "初相是性不等離我我所者，過身見證時中第二相故。",
        "translation": "“The first characteristic mark is with a nature that is not equal: free from self and what belongs to self”: It is because the second characteristic mark occurs at the moment of vision beyond the body.",
        "source": "T26n1523_003:0224a13_107"
    },
    {
        "source_sentence": "是性無惡若虛若實從平等生者，過彼根本惡見故，還彼第三相。",
        "translation": "This is the third characteristic of those whose nature is without evil and who really arise from equality, whether false or true, because they go beyond that fundamental bad view and return to it.",
        "source": "T26n1523_003:0224a15_108"
    },
    {
        "source_sentence": "是性真諦第一義諦者，此說永盡時。",
        "translation": "This is the ultimate truth of the true truth of nature, which is said to be eternally extinguished.",
        "source": "T26n1523_003:0224a16_109"
    },
    {
        "source_sentence": "彼盡中住者，常故及成就諸樂，過三種轉變故。",
        "translation": "“They abide in cessation”: Because of permanence and because of the accomplishment of satisfaction, it is more than threefold:",
        "source": "T26n1523_003:0224a17_110"
    },
    {
        "source_sentence": "是中三種轉變事：一者生死等轉；",
        "translation": "These are the three kinds of evolving:",
        "source": "T26n1523_003:0224a18_111"
    },
    {
        "source_sentence": "二者倒處轉；",
        "translation": "The second is that which proceeds in error.",
        "source": "T26n1523_003:0224a19_112"
    },
    {
        "source_sentence": "三者退淨轉。",
        "translation": "The third is the pure transformation of retrogression.",
        "source": "T26n1523_003:0224a19_113"
    },
    {
        "source_sentence": "是性無盡畢竟不生者，過生死等轉變故，是名成就盡時中初相。",
        "translation": "The nature is inexhaustible and absolutely unarisen: because of transmigration beyond birth and death. This is called ‘the first characteristic mark at the moment of accomplishment of cessation’.",
        "source": "T26n1523_003:0224a19_114"
    },
    {
        "source_sentence": "是性常樂淨無我者，過顛倒處轉變故，還彼後盡至中第二相。",
        "translation": "Its nature is eternal, blissful, pure, and selfless because it goes beyond the transmutation of the place of delusion. This returns to the second characteristic mark in the last up to the middle one.",
        "source": "T26n1523_003:0224a21_115"
    },
    {
        "source_sentence": "是性真淨從本以來畢竟淨者，過退淨轉變故，還彼盡至中時第三相。",
        "translation": "This is the third characteristic of true purity by nature that's ultimately pure since the beginning because it goes beyond the transformation of retrogressing purity and returns back when it reaches its end in the middle.",
        "source": "T26n1523_003:0224a22_116"
    },
    {
        "source_sentence": "是故乃至世間出世間道行示現益他，故言「迦葉！",
        "translation": "That's why they say, Kāśyapa!",
        "source": "T26n1523_003:0224a24_117"
    },
    {
        "source_sentence": "汝當自觀內，莫外逃走。",
        "translation": "You should observe yourself inside and not run away from it.",
        "source": "T26n1523_003:0224a25_118"
    },
    {
        "source_sentence": "乃至迦葉！",
        "translation": "Up to Kāśyapa!",
        "source": "T26n1523_003:0224a26_119"
    },
    {
        "source_sentence": "行道比丘隨心所縛應當求解」。",
        "translation": "A monk who practices the path follows what's bound to his mind and should seek understanding.",
        "source": "T26n1523_003:0224a26_120"
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "Kasyapa!",
        "source": "T26n1523_003:0224a27_121"
    },
    {
        "source_sentence": "汝當自觀內」者，有何漸次？",
        "translation": "You should examine yourself internally. What's the gradual order?",
        "source": "T26n1523_003:0224a27_122"
    },
    {
        "source_sentence": "如彼性所顯淨諸聖，彼已示現如，今隨如聖所生，彼答顯說。",
        "translation": "Just as the pure noble ones revealed by their nature, they've already manifested thusness, and now they're produced according to what the noble ones are producing, they answer and show it.",
        "source": "T26n1523_003:0224a27_123"
    },
    {
        "source_sentence": "大寶積經論卷第三",
        "translation": "Commentary on the Mahāprajñāpāramitā-sūtra Treatise, Volume 3",
        "source": "T26n1523_003:0224b01_0"
    }
]