[
    {
        "source_sentence": "阿毘達磨識身足論卷第十三",
        "translation": "Abhidharma-mahāviśeṣa-sūtra, vol. 13",
        "source": "T26n1539_013:0593b02_0"
    },
    {
        "source_sentence": "提婆設摩阿羅漢造",
        "translation": "created by Devaśāma arhat",
        "source": "T26n1539_013:0593b04_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T26n1539_013:0593b05_0"
    },
    {
        "source_sentence": "成就蘊第六之一嗢拕南頌",
        "translation": "Verse on the Sixth Part of the Awakened Consciousness",
        "source": "T26n1539_013:0593b06_0"
    },
    {
        "source_sentence": "　初成不成與捨得，　　未斷已斷二種心，",
        "translation": "The first is accompanied by formation, the second by non-formation and the acquisition of relinquishment. Two kinds of awarenesses are to be abandoned after not being cut off.",
        "source": "T26n1539_013:0593b07_0"
    },
    {
        "source_sentence": "　補特伽羅二梵世，　　學無學心二最後。",
        "translation": "In the two brahma worlds of Pudgala and Anāgāminīya, there is a mind acquired through effort.",
        "source": "T26n1539_013:0593b08_0"
    },
    {
        "source_sentence": "有十二心，謂欲界繫善心、不善心、有覆無記心、無覆無記心，色界繫善心、有覆無記心、無覆無記心，",
        "translation": "Good awarenesses bound to the realm of sexual passion, bad awarenesses”*°, defiled-neutral awarenesses and undefiled-neutral awarenesses; good awarenesses bound to the realm of form, defiled-neutral awarenesses and undefiled-neutral awarenesses.",
        "source": "T26n1539_013:0593b09_0"
    },
    {
        "source_sentence": "無色界繫善心、有覆無記心、無覆無記心，及學心、無學心。",
        "translation": "good awarenesses bound to the realm of formlessness, defiled-neutral awarenesses and undefiled-neutral awarenesses as well as awarenesses of a learner and one who has no more learning to do.",
        "source": "T26n1539_013:0593b11_1"
    },
    {
        "source_sentence": "若成就欲界繫善心，亦成就不善心耶？",
        "translation": "If someone has accomplished a good mind bound to the desire realm, will they also accomplish an unskillful mind?",
        "source": "T26n1539_013:0593b12_2"
    },
    {
        "source_sentence": "設成就不善心，亦成就此善心耶？",
        "translation": "If someone has accomplished an unwholesome mind, will they also accomplish this wholesome mind?",
        "source": "T26n1539_013:0593b13_3"
    },
    {
        "source_sentence": "若成就欲界繫善心，乃至亦成就無學心耶？",
        "translation": "If someone has accomplished the good mind bound to the desire realm, and they've also accomplished the post-learning mind?",
        "source": "T26n1539_013:0593b14_4"
    },
    {
        "source_sentence": "設成就無學心，亦成就此善心耶？",
        "translation": "If someone has accomplished the mind of post-learning, will they also accomplish this good mind?",
        "source": "T26n1539_013:0593b15_5"
    },
    {
        "source_sentence": "乃至若成就學心，亦成就無學心耶？",
        "translation": "If someone has accomplished the mind of training, will they also accomplish the mind of post-learning?",
        "source": "T26n1539_013:0593b15_6"
    },
    {
        "source_sentence": "設成就無學心，亦成就學心耶？",
        "translation": "If someone has accomplished the mind of post-learning, will they also accomplish the mind of training?",
        "source": "T26n1539_013:0593b16_7"
    },
    {
        "source_sentence": "若成就欲界繫善心，亦成就不善心耶？",
        "translation": "If someone has accomplished a good mind bound to the desire realm, will they also accomplish an unskillful mind?",
        "source": "T26n1539_013:0593b18_0"
    },
    {
        "source_sentence": "或成就欲界繫善心非不善心，或成就不善心非此善心，或成就此善心亦不善心，",
        "translation": "Sometimes they develop good awarenesses bound to the realm of sexual passion and not bad awarenesses; sometimes they develop bad awarenesses but not these good awarenesses; sometimes they develop these good awarenesses but also bad awarenesses:",
        "source": "T26n1539_013:0593b18_1"
    },
    {
        "source_sentence": "或非成就此善心亦非不善心。",
        "translation": "Whether it doesn't accomplish this good mental state or isn't an unwholesome mental state.",
        "source": "T26n1539_013:0593b20_2"
    },
    {
        "source_sentence": "成就欲界繫善心非不善心者，謂欲界生長已離欲界貪補特伽羅。",
        "translation": "Accomplishment of the good awarenesses bound to the realm of sexual passion that are not bad awarenesses means that after having arisen in the realm of sexual passion, one is free from covetousness of the realm of sexual passion as personality.",
        "source": "T26n1539_013:0593b21_3"
    },
    {
        "source_sentence": "成就不善心非此善心者，謂已斷善根補特伽羅。",
        "translation": "Accomplishment of an unwholesome awareness that is not this wholesome awareness: having cut off the roots of merit as a personal precept.",
        "source": "T26n1539_013:0593b23_0"
    },
    {
        "source_sentence": "成就此善心亦不善心者，謂欲界生長不斷善根未離欲界貪補特伽羅。",
        "translation": "Accomplishment of these good awarenesses and also bad awarenesses means that when the realm of sexual passion arises, it does not abandon the roots of merit but is not free from the craving of the realm of sexual passion.",
        "source": "T26n1539_013:0593b24_1"
    },
    {
        "source_sentence": "非成就此善心亦非不善心者，謂色無色界生長補特伽羅。",
        "translation": "Someone who hasn't accomplished this good mind and isn't an unskillful mind means that it grows in the form and formless realms as a personality.",
        "source": "T26n1539_013:0593b25_2"
    },
    {
        "source_sentence": "若成就欲界繫善心，亦成就欲界繫有覆無記心耶？",
        "translation": "If someone has accomplished the good mind bound to the desire realm, will they also accomplish the defiled and indeterminate mind bound to the desire realm?",
        "source": "T26n1539_013:0593b27_3"
    },
    {
        "source_sentence": "或成就欲界繫善心非欲界繫有覆無記心，或成就欲界繫有覆無記心非欲界繫善心，",
        "translation": "They may develop a mind bound to the realm of desire that’s good and not a mind bound to the realm of desire that’s defiled or undefiledneutral, or they may develop a mind bound to the realm of desire that’s defiled or undefiled but not a mind bound to the realm of desire.",
        "source": "T26n1539_013:0593b28_4"
    },
    {
        "source_sentence": "或成就此善心亦此有覆無記心，或非成就此善心亦非此有覆無記心。",
        "translation": "Or they may have accomplished this good mental state, which is also a defiled or indeterminate mental state, or they may not have accomplished this good mental state, which is also a defiled or indeterminate mental state.",
        "source": "T26n1539_013:0593c01_5"
    },
    {
        "source_sentence": "成就欲界繫善心非欲界繫有覆無記心者，謂欲界生長已離欲界貪聖者異生，",
        "translation": "Accomplishment of the good awarenesses bound to the realm of sexual passion and not of the defiledneutral awarenesses bound to the realm of sexual passion: after having arisen in the realm of sexual passion, noble one who is free from craving of the realm of sexual passion.",
        "source": "T26n1539_013:0593c02_6"
    },
    {
        "source_sentence": "及未離欲界貪聖者，現觀邊苦法智已生。",
        "translation": "and the noble one who hasn't yet parted with craving in the desire realm, now observes that knowledge of the Dharma of suffering at the extremes has arisen.",
        "source": "T26n1539_013:0593c04_7"
    },
    {
        "source_sentence": "成就欲界繫有覆無記心非欲界繫善心者，謂已斷善根補特伽羅。",
        "translation": "Accomplishment of defiled-neutral awarenesses bound to the realm of sexual passion that are not good awarenesses bound to the realm of sexual passion refers to a person who has already abandoned the roots of merit.",
        "source": "T26n1539_013:0593c05_8"
    },
    {
        "source_sentence": "成就欲界繫善心亦欲界繫有覆無記心者，謂欲界生長異生不斷善根未離欲界貪，",
        "translation": "Accomplishment of the good awarenesses bound to the realm of sexual passion and also the defiled-neutral awarenesses bound to the realm of sexual passion: when arising in the realm of sexual passion, beings who do not let go of the roots of merit that have not been abandoned yet are not free from the craving of the realm of sexual passion.",
        "source": "T26n1539_013:0593c07_9"
    },
    {
        "source_sentence": "及未離欲界貪聖者現觀邊苦法智未生。",
        "translation": "and those who haven't yet parted with the desire realm's craving for the noble person's presently observing the limits of suffering as cognition of the Dharma has yet to arise.",
        "source": "T26n1539_013:0593c09_10"
    },
    {
        "source_sentence": "非成就欲界繫善心亦非欲界繫有覆無記心者，謂色無色界生長補特伽羅。",
        "translation": "Those who don't attain the good mind bound to the desire realm and aren't bound to the desire realm with an obscured or indeterminate mind are those who grow up in the form and formless realms as a personal.",
        "source": "T26n1539_013:0593c10_11"
    },
    {
        "source_sentence": "若成就欲界繫善心，亦成就欲界繫無覆無記心耶？",
        "translation": "If someone has accomplished the good mind bound to the desire realm, will they also accomplish the unobstructed indeterminate mind bound to the desire realm?",
        "source": "T26n1539_013:0593c12_12"
    },
    {
        "source_sentence": "若成就欲界繫善心，定成就欲界繫無覆無記心。",
        "translation": "If someone has accomplished the good mind bound to the desire realm, they'll definitely accomplish the unobstructed indeterminate mind bound to the desire realm.",
        "source": "T26n1539_013:0593c13_13"
    },
    {
        "source_sentence": "或成就欲界繫無覆無記心非欲界繫善心，謂已斷善根及色界生長補特伽羅。",
        "translation": "Or they may achieve an unobstructed, indeterminate mind bound to the desire realm that's not a good mind bound to the desire realm, which is called having cut off good roots and growing up in the form realm as a personal.",
        "source": "T26n1539_013:0593c14_14"
    },
    {
        "source_sentence": "若成就欲界繫善心，亦成就色界繫善心耶？",
        "translation": "If someone has accomplished the good mental state bound to the desire realm, will they also accomplish the good mental state bound to the form realm?",
        "source": "T26n1539_013:0593c16_15"
    },
    {
        "source_sentence": "或成就欲界繫善心非色界繫善心，或成就色界繫善心非欲界繫善心，或成就欲界繫善心亦色界繫善心，",
        "translation": "Sometimes they develop good awarenesses bound to the realm of sexual passion and not good awarenesses bound to the realm of form; sometimes they develop good awarenesses bound to the realm of form and not good awarenesses bound to the realm of sexual passion; sometimes they develop good awarenesses bound to the realm of sexual passion and also good awarenesses bound to the realm of form.",
        "source": "T26n1539_013:0593c17_16"
    },
    {
        "source_sentence": "或非成就欲界繫善心亦非色界繫善心。",
        "translation": "It might not be the accomplishment of a good mind bound to the desire realm or a good mind bound to the form realm.",
        "source": "T26n1539_013:0593c19_17"
    },
    {
        "source_sentence": "成就欲界繫善心非色界繫善心者，謂欲界生長不斷善根未得色界善心補特伽羅。",
        "translation": "Accomplishment of good awarenesses fettered in the realm of sexual passion and not of good awarenesses fettered in the realm of form means that when arising in the realm of sexual passion, one does not cut off the roots of merit but acquires a wholesome awareness of the realm of form.",
        "source": "T26n1539_013:0593c20_18"
    },
    {
        "source_sentence": "成就色界繫善心非欲界繫善心者，謂色界生長補特伽羅。",
        "translation": "Accomplishment of good awarenesses fettered in the realm of form and not of good awarenesses fettered in the realm of sexual passion is growing up in the realm of form as personal.",
        "source": "T26n1539_013:0593c22_19"
    },
    {
        "source_sentence": "成就欲界繫善心亦色界繫善心者，謂欲界生長已得色界善心補特伽羅。",
        "translation": "Accomplishment of the good awarenesses fettered in the realm of sexual passion and also the good awarenesses fettered in the realm of form: after having grown up in the realm of sexual passion, one acquires the wholesome awarenesses of the realm of form as personal.",
        "source": "T26n1539_013:0593c24_20"
    },
    {
        "source_sentence": "非成就欲界繫善心亦非色界繫善心者，謂已斷善根及無色界生長補特伽羅。",
        "translation": "Those who don't attain the good mind bound to the desire realm and the good mind bound to the form realm are those who have cut off the good roots and grown up in the formless realm as a personal.",
        "source": "T26n1539_013:0593c25_21"
    },
    {
        "source_sentence": "若成就欲界繫善心，亦成就色界繫有覆無記心耶？",
        "translation": "If someone has accomplished the good mind bound to the desire realm, will they also accomplish the defiled and indeterminate mind bound to the form realm?",
        "source": "T26n1539_013:0593c27_22"
    },
    {
        "source_sentence": "或成就欲界繫善心非色界繫有覆無記心，或成就色界繫有覆無記心非欲界繫善心，",
        "translation": "Or they may develop a mind bound to the realm of desire that’s good, not a mind bound to the realm of form that’s defiled or undefiled-neutral. Or they may develop a mind bound to the realm of form that’s defiled-neutral and not a mind bound to the realm of desire that’s good.",
        "source": "T26n1539_013:0593c28_23"
    },
    {
        "source_sentence": "或成就欲界繫善心亦色界繫有覆無記心，或非成就欲界繫善心亦非色界繫有覆無記心。",
        "translation": "Or they may achieve a mind that's bound to goodness in the desire realm and a mind that's bound to form that's covered or indeterminate, or they may not achieve a mind that's bound to goodness in the desire realm and a mind that's bound to form that's covered or indeterminate.",
        "source": "T26n1539_013:0594a01_24"
    },
    {
        "source_sentence": "成就欲界繫善心非色界繫有覆無記心者，謂欲界生長已離色界貪補特伽羅。",
        "translation": "Accomplishment of the good awarenesses bound to the realm of sexual passion that are not fettered to the realm of form and of the defiled-neutral awarenesses that are not fettered to the realm of form means that after having arisen in the realm of sexual passion, one is free from covetousness of the realm of form.",
        "source": "T26n1539_013:0594a03_25"
    },
    {
        "source_sentence": "成就色界繫有覆無記心非欲界繫善心者，謂已斷善根及色界生長未離色界貪補特伽羅。",
        "translation": "Accomplishment of defiled-neutral awarenesses bound to the realm of form that are not good awarenesses bound to the realm of sexual passion means having already abandoned the roots of merit and growing in the realm of form, but not yet free from the craving of the one of form.",
        "source": "T26n1539_013:0594a05_26"
    },
    {
        "source_sentence": "成就欲界繫善心亦色界繫有覆無記心者，謂欲界生長不斷善根未離色界貪補特伽羅。",
        "translation": "Accomplishment of the good awarenesses bound to the realm of sexual passion and also the defiled-neutral awarenesses bound to the realm of form that are covered by the one of form: when arising in the realm of sexual passion, they do not let the roots of merit be cut off. They are not yet free from the craving of the realm of form as personal",
        "source": "T26n1539_013:0594a07_27"
    },
    {
        "source_sentence": "非成就欲界繫善心亦非色界繫有覆無記心者，謂色界生長已離色界貪，",
        "translation": "They are not accompanied by the good awarenesses bound to the realm of sexual passion, nor by the defiled-neutral awarenesses bound to the realm of form. That is to say, having arisen in the realm of form and being free from craving in the realm of form:",
        "source": "T26n1539_013:0594a10_0"
    },
    {
        "source_sentence": "及無色界生長補特伽羅。",
        "translation": "and the growth of the formless realm in the pudgala.",
        "source": "T26n1539_013:0594a11_1"
    },
    {
        "source_sentence": "若成就欲界繫善心，亦成就色界繫無覆無記心耶？",
        "translation": "If someone has accomplished the good mind bound to the desire realm, will they also accomplish the unobstructed indeterminate mind bound to the form realm?",
        "source": "T26n1539_013:0594a12_2"
    },
    {
        "source_sentence": "或成就欲界繫善心非色界繫無覆無記心，或成就色界繫無覆無記心非欲界繫善心，",
        "translation": "They may attain a mind bound to the desire realm that's good, not a mind bound to the form realm that's unobstructed and indeterminate, or they may attain a mind bound to the form realm that's unobstructed and indeterminate, not a mind bound to the desire realm that's good.",
        "source": "T26n1539_013:0594a13_3"
    },
    {
        "source_sentence": "或成就欲界繫善心亦色界繫無覆無記心，或非成就欲界繫善心亦非色界繫無覆無記心。",
        "translation": "Or they may have accomplished a mind that's bound to the desire realm that's good and also bound to the form realm that's unobstructed and indeterminate, or they may not have accomplished a mind that's bound to the desire realm that's good and not bound to the form realm that's unobstructed and indeterminate.",
        "source": "T26n1539_013:0594a15_4"
    },
    {
        "source_sentence": "成就欲界繫善心非色界繫無覆無記心者，謂欲界生長不斷善根未離欲界貪補特伽羅。",
        "translation": "Accomplishment of the good awarenesses bound to the realm of sexual passion that are not bound to the realm of form and of the unobscured and indeterminate awarenesses means that when arising in the realm of sexual passion, one does not let go of the roots of merit but is not yet free from the craving of the realm of sexual passion.",
        "source": "T26n1539_013:0594a17_5"
    },
    {
        "source_sentence": "成就色界繫無覆無記心非欲界繫善心者，謂色界生長補特伽羅。",
        "translation": "Accomplishment of unobstructed-neutral awarenesses bound to the realm of form that are not good awarenesses bound to the realm of sexual passion is growing in the realm of form.",
        "source": "T26n1539_013:0594a19_6"
    },
    {
        "source_sentence": "成就欲界繫善心亦色界繫無覆無記心者，謂欲界生長已離欲界貪補特伽羅。",
        "translation": "Accomplishment of the good awarenesses bound to the realm of sexual passion and also of the unobscured-neutral awarenesses bound to the realm of form: after having arisen in the realm of sexual passion, one is free from the craving of the realm of sexual passion as a personal companion.",
        "source": "T26n1539_013:0594a21_7"
    },
    {
        "source_sentence": "非成就欲界繫善心亦非色界繫無覆無記心者，謂已斷善根，及無色界生長補特伽羅。",
        "translation": "Those who don't attain the good mind bound to the desire realm and the unobstructed indeterminate mind bound to the form realm are those who have cut off good roots and grown up in the formless realm as a personal.",
        "source": "T26n1539_013:0594a23_8"
    },
    {
        "source_sentence": "若成就欲界繫善心，亦成就無色界繫善心耶？",
        "translation": "If someone has accomplished the good mental state bound to the desire realm, will they also accomplish the good mental state bound to the formless realm?",
        "source": "T26n1539_013:0594a25_9"
    },
    {
        "source_sentence": "或成就欲界繫善心非無色界繫善心，或成就無色界繫善心非欲界繫善心，",
        "translation": "Sometimes they develop good awarenesses bound to the realm of sexual passion and not good awarenesses bound to the realm of formlessness; sometimes they develop good awarenesses bound to the realm of formlessness and not good awarenesses bound to the realm of sexual passion.",
        "source": "T26n1539_013:0594a26_10"
    },
    {
        "source_sentence": "或成就欲界繫善心亦無色界繫善心，或非成就欲界繫善心亦非無色界繫善心。",
        "translation": "Or they may achieve good mental states bound to the desire realm and also good mental states bound to the formless realm, or they may not achieve good mental states bound to the desire realm and not good mental states bound to the formless realm.",
        "source": "T26n1539_013:0594a27_11"
    },
    {
        "source_sentence": "成就欲界繫善心非無色界繫善心者，謂欲界生長不斷善根未得無色界善心補特伽羅。",
        "translation": "Accomplishment of the good awarenesses fettered in the realm of sexual passion and not of the good awarenesses fettered in the realm of formlessness: when arising in the realm of sexual passion, one does not let go of the roots of merit”*! but acquires a good awareness of the realm of formlessness.",
        "source": "T26n1539_013:0594a29_12"
    },
    {
        "source_sentence": "成就無色界繫善心非欲界繫善心者，謂色界生長已得無色界善心，及無色界生長補特伽羅。",
        "translation": "Accomplishment of the good awarenesses fettered in the realm of formlessness that are not fettered in the realm of sexual passion is what is called ‘the good awarenesses of the realm of form which have already arisen and acquired’”*!, and the growing up of the person who belongs to the one of formlessness.",
        "source": "T26n1539_013:0594b02_13"
    },
    {
        "source_sentence": "成就欲界繫善心亦無色界繫善心者，謂欲界生長已得無色界善心補特伽羅。",
        "translation": "Accomplishment of the good awarenesses fettered in the realm of sexual passion and also the good awarenesses fettered in the realm of formlessness*”:",
        "source": "T26n1539_013:0594b05_14"
    },
    {
        "source_sentence": "非成就欲界繫善心亦非無色界繫善心者，謂已斷善根，及色界生長未得無色界善心補特伽羅。",
        "translation": "Those who haven't accomplished the good mental state bound to the desire realm and aren't bound to the good mental state bound to the formless realm are those who have cut off good roots and grown up in the form realm but haven't yet attained the good mental state of the formless realm.",
        "source": "T26n1539_013:0594b06_15"
    },
    {
        "source_sentence": "若成就欲界繫善心，亦成就無色界繫有覆無記心耶？",
        "translation": "If someone has accomplished the good mind bound to the desire realm, will they also accomplish the defiled and indeterminate mind bound to the formless realm?",
        "source": "T26n1539_013:0594b09_16"
    },
    {
        "source_sentence": "或成就欲界繫善心非無色界繫有覆無記心，或成就無色界繫有覆無記心非欲界繫善心，",
        "translation": "They may develop a mind bound to the realm of desire that’s good, not a mind bound to the formless realm that’s defiled or undefiledneutral, or they may develop a mind bound to the formless realm that’s defiled or undefiled but not a mind bound to the realm of desire.",
        "source": "T26n1539_013:0594b10_17"
    },
    {
        "source_sentence": "或成就欲界繫善心亦無色界繫有覆無記心，或非成就欲界繫善心亦非無色界繫有覆無記心。",
        "translation": "Or they may have accomplished a mind that's bound to the desire realm that's good and also bound to the formless realm that's covered and indeterminate, or they may not have accomplished a mind that's bound to the desire realm that's good and not bound to the formless realm that's covered and indeterminate.",
        "source": "T26n1539_013:0594b12_18"
    },
    {
        "source_sentence": "成就欲界繫善心非無色界繫有覆無記心者，謂欲界生長阿羅漢。",
        "translation": "Accomplishment of the good awarenesses bound to the realm of sexual passion and not of the defiled-neutral awarenesses bound to the realm of formlessness: arhats who arise in the realm of sexual passion.",
        "source": "T26n1539_013:0594b14_19"
    },
    {
        "source_sentence": "成就無色界繫有覆無記心非欲界繫善心者，謂已斷善根，及色無色界生長有學異生補特伽羅。",
        "translation": "Accomplishment of the good awarenesses fettered in the realm of sexual passion that are not fettered in the realm of sexual passion with defiled-neutral awarenesses*” bound to the one of formlessness is when having already abandoned the roots of merit and growing up in the realm of form and in the one of formlessness.",
        "source": "T26n1539_013:0594b16_20"
    },
    {
        "source_sentence": "成就欲界繫善心亦無色界繫有覆無記心者，謂欲界生長有學及異生不斷善根補特伽羅。",
        "translation": "Accomplishment of the good awarenesses bound to the realm of sexual passion and also the defiled-neutral awarenesses bound to the realm of formlessness*”:",
        "source": "T26n1539_013:0594b18_21"
    },
    {
        "source_sentence": "非成就欲界繫善心亦非無色界繫有覆無記心者，謂色無色界生長阿羅漢。",
        "translation": "He who hasn't accomplished the good mind bound to the desire realm and the defiled indeterminate mind bound to the formless realm refers to arhats growing up in the form and formless realms.",
        "source": "T26n1539_013:0594b20_22"
    },
    {
        "source_sentence": "若成就欲界繫善心，亦成就無色界繫無覆無記心耶？",
        "translation": "If someone has accomplished the good mind bound to the desire realm, will they also accomplish the unobstructed indeterminate mind bound to the formless realm?",
        "source": "T26n1539_013:0594b22_23"
    },
    {
        "source_sentence": "若成就欲界繫善心，定不成就無色界繫無覆無記心。",
        "translation": "If someone has accomplished the good mind bound to the desire realm, they definitely won't accomplish the unobstructed and indeterminate mind bound to the formless realm.",
        "source": "T26n1539_013:0594b23_24"
    },
    {
        "source_sentence": "若成就無色界繫無覆無記心，定不成就欲界繫善心。",
        "translation": "If someone has accomplished the mind bound to the formless realm that's unobstructed and indeterminate, they definitely won't accomplish the good mind bound to the desire realm.",
        "source": "T26n1539_013:0594b24_25"
    },
    {
        "source_sentence": "若成就欲界繫善心亦成就學心耶？",
        "translation": "If someone has accomplished the good mind bound to the desire realm, will they also accomplish the mind of training?",
        "source": "T26n1539_013:0594b26_26"
    },
    {
        "source_sentence": "或成就欲界繫善心非學心，或成就學心非欲界繫善心，或成就欲界繫善心亦學心，",
        "translation": "Sometimes they develop good awarenesses bound to the realm of sexual passion that are not awarenesses of the seeker; sometimes they develop awarenesses of the seeker, but not good awarenesses bound to the realm of sexual passion; sometimes they develop awarenesses of the seeker and also awarenesses of the one of the seeker.",
        "source": "T26n1539_013:0594b27_0"
    },
    {
        "source_sentence": "或非成就欲界繫善心亦非學心。",
        "translation": "It might not be the mind that's bound to the desire realm and good, or it might not be the mind of training.",
        "source": "T26n1539_013:0594b29_0"
    },
    {
        "source_sentence": "成就欲界繫善心非學心者，謂欲界生長阿羅漢，及異生不斷善根補特伽羅。",
        "translation": "Accomplishment of the good awarenesses bound to the realm of sexual passion and no awarenesses of the seeker”: arhats who arise in the realm of sexual passion and also worldlings*!, who do not abandon the roots of merit as a personal precept.",
        "source": "T26n1539_013:0594b29_1"
    },
    {
        "source_sentence": "成就學心非欲界繫善心者，謂色無色界生長。",
        "translation": "Accomplishment of the awarenesses of the seeker and no good awarenesses bound to the realm of sexual passion is growing in the realm of form and in the one of formlessness.",
        "source": "T26n1539_013:0594c02_2"
    },
    {
        "source_sentence": "有學補特伽羅。",
        "translation": "There are trainees in the pudgala.",
        "source": "T26n1539_013:0594c03_3"
    },
    {
        "source_sentence": "成就欲界繫善心亦學心者，謂欲界生長有學補特伽羅。",
        "translation": "Accomplishment of the good awarenesses bound to the realm of sexual passion that are accompanied by awarenesses of one who is still having learning to do:",
        "source": "T26n1539_013:0594c04_4"
    },
    {
        "source_sentence": "非成就欲界繫善心亦非學心者，謂已斷善根，及色無色界生長阿羅漢。",
        "translation": "Someone who hasn't accomplished the mind that's bound to goodness in the desire realm and isn't a learner's mind means someone who has cut off good roots and arhats growing up in the form and formless realms.",
        "source": "T26n1539_013:0594c05_5"
    },
    {
        "source_sentence": "若異生補特伽羅，若成就欲界繫善心，亦成就無學心耶？",
        "translation": "If an ordinary person in the pudgala accomplishes the good mind bound to the desire realm, does he also accomplish the mind of post-learning?",
        "source": "T26n1539_013:0594c07_6"
    },
    {
        "source_sentence": "或成就欲界繫善心非無學心，或成就無學心非欲界繫善心，或成就欲界繫善心亦無學心，",
        "translation": "Sometimes they develop good awarenesses bound to the realm of sexual passion and not an awareness of post learners; sometimes they develop an awareness of post learnerhood and not a good awareness bound to the realm of sexual passion; sometimes they develop an awareness that is bound to the realm of sexual passion and also an awareness of post learnerhood.",
        "source": "T26n1539_013:0594c08_7"
    },
    {
        "source_sentence": "或非成就欲界繫善心亦非無學心。",
        "translation": "It might not be the mind that's bound to the desire realm and good, or it might not be the mind of post-learning.",
        "source": "T26n1539_013:0594c10_8"
    },
    {
        "source_sentence": "成就欲界繫善心非無學心者，謂欲界生長有學，及異生不斷善根補特伽羅。",
        "translation": "Accomplishment of the good awarenesses bound to the realm of sexual passion and no awarenesses of the adepts*”: When having arisen in the realm of sexual passion, there are those who are still having learning to do.",
        "source": "T26n1539_013:0594c11_9"
    },
    {
        "source_sentence": "成就無學心非欲界繫善心者，謂色無色界生長阿羅漢。",
        "translation": "Accomplishment of a good awareness not bound to the realm of sexual passion with an awareness having no more learning to do as object: arhats growing up in the realm of form and in the one of formlessness.",
        "source": "T26n1539_013:0594c13_10"
    },
    {
        "source_sentence": "成就欲界繫善心亦無學心者，謂欲界生長阿羅漢。",
        "translation": "Accomplishment of the good awarenesses bound to the realm of sexual passion and also of the one without more learning is arhats who arise in the realm of sexual passion.",
        "source": "T26n1539_013:0594c14_11"
    },
    {
        "source_sentence": "非成就欲界繫善心亦非無學心者，謂已斷善根，及色無色界生長有學，",
        "translation": "Those who have neither accomplished the good mind bound to the realm of sexual passion nor an Aśaikṣa mind are those who have already cut off the roots of goodness, and those in the form and formless realms who grow up as Śaikṣas.",
        "source": "T26n1539_013:0594c15_12"
    },
    {
        "source_sentence": "若異生補特伽羅。",
        "translation": "Suppose an unenlightened person in the pudgala.",
        "source": "T26n1539_013:0594c17_13"
    },
    {
        "source_sentence": "若成就不善心，亦成就欲界繫有覆無記心耶？",
        "translation": "If someone has accomplished an unwholesome mind, will they also accomplish a covered and indeterminate mind bound to the desire realm?",
        "source": "T26n1539_013:0594c17_14"
    },
    {
        "source_sentence": "若成就欲界繫有覆無記心，定成就不善心。",
        "translation": "If someone has accomplished a mind bound to the desire realm that's covered and indeterminate, they'll surely accomplish an unwholesome mind.",
        "source": "T26n1539_013:0594c18_15"
    },
    {
        "source_sentence": "或成就不善心非欲界繫有覆無記心，謂未離欲界貪聖者現觀邊苦法智已生。",
        "translation": "Or they may develop an unwholesome mind that's not bound to the desire realm and a covered or indeterminate mind that's not fettered by the desire realm, meaning that someone who hasn't yet become free of craving in the desire realm will now observe the cognition of the law of suffering at the extremes.",
        "source": "T26n1539_013:0594c19_16"
    },
    {
        "source_sentence": "若成就不善心，亦成就欲界繫無覆無記心耶？",
        "translation": "If someone has accomplished an unwholesome mind, will they also accomplish a mind bound to the desire realm that's unobstructed and indeterminate?",
        "source": "T26n1539_013:0594c21_17"
    },
    {
        "source_sentence": "若成就不善心，定成就欲界繫無覆無記心。",
        "translation": "If someone has accomplished an unwholesome mind, they'll definitely accomplish the undefiled indeterminate mind bound to the desire realm.",
        "source": "T26n1539_013:0594c22_18"
    },
    {
        "source_sentence": "或成就欲界繫無覆無記心非不善心，謂欲界生長已離欲界貪，或色界生長補特伽羅。",
        "translation": "It sometimes accomplishes an undefiledneutral awareness bound to the realm of sexual passion and not an unwholesome awareness: when arising in the realm of sexual passion, one is already free from craving of the realm of sexual passion; or when arising in the realm of form, one produces a personal precept.",
        "source": "T26n1539_013:0594c23_19"
    },
    {
        "source_sentence": "若成就不善心，亦成就色界繫善心耶？",
        "translation": "If someone has accomplished an unwholesome mind, will they also accomplish a good mind bound to the form realm?",
        "source": "T26n1539_013:0594c25_20"
    },
    {
        "source_sentence": "或成就不善心非色界繫善心，或成就色界繫善心非不善心，或成就不善心亦色界繫善心，",
        "translation": "They may develop an unwholesome mind that’s not a good mind bound to the form realm, or they may develop a good mind bound to the form realm that’s neither wholesome nor unwholesome, or they may develop an unwholesome mind that’s also a good mind bound to the form realm.",
        "source": "T26n1539_013:0594c26_21"
    },
    {
        "source_sentence": "或非成就不善心亦非色界繫善心。",
        "translation": "It might not be the accomplishment of an unwholesome mind or a good mind bound to the form realm.",
        "source": "T26n1539_013:0594c28_22"
    },
    {
        "source_sentence": "成就不善心非色界繫善心者，謂欲界生長未得色界善心補特伽羅。",
        "translation": "Accomplishment of bad awarenesses and no-good awarenesses bound to the realm of form: when arising in the realm of sexual passion, one does not acquire a good awareness of the realm of form.",
        "source": "T26n1539_013:0594c29_23"
    },
    {
        "source_sentence": "成就色界繫善心非不善心者，謂欲界生長已離欲界貪，及色界生長補特伽羅。",
        "translation": "Accomplishment of the good awarenesses bound to the realm of form that are not bad awarenesses: after having arisen in the realm of sexual passion and being free from attachment in the realm of sexual passion, and when having arisen in the realm of form.",
        "source": "T26n1539_013:0595a02_24"
    },
    {
        "source_sentence": "成就不善心亦色界繫善心者，謂欲界生長未離欲界貪已得色界善心補特伽羅。",
        "translation": "Accompanied by bad awarenesses and also with good awarenesses fettered in the realm of form: when arising in the realm of sexual passion but not yet free from attachment in the realm of sexual passion, there is already acquired a good awareness of the one of form as personal companion.",
        "source": "T26n1539_013:0595a04_25"
    },
    {
        "source_sentence": "非成就不善心亦非色界繫善心者，謂無色界生長補特伽羅。",
        "translation": "Those who haven't accomplished an unwholesome mind and aren't bound to a good mind in the form realm are those who grow up in the formless realm as a personal.",
        "source": "T26n1539_013:0595a05_26"
    },
    {
        "source_sentence": "若成就不善心，亦成就色界繫有覆無記心耶？",
        "translation": "If someone has accomplished an unwholesome mental state, will they also accomplish a covered and indeterminate mental state that's bound to the form realm?",
        "source": "T26n1539_013:0595a07_27"
    },
    {
        "source_sentence": "若成就不善心，定成就色界繫有覆無記心。",
        "translation": "If someone has accomplished an unwholesome mind, they'll surely accomplish a covered and indeterminate mind bound to the form realm.",
        "source": "T26n1539_013:0595a08_28"
    },
    {
        "source_sentence": "或成就色界繫有覆無記心非不善心，謂欲界生長已離欲界貪未離色界貪，",
        "translation": "It sometimes accomplishes defiled-neutral awarenesses bound to the realm of form and not bad awarenesses: when arising in the realm of sexual passion, one is already free from craving of the realm of sexual passion but not yet free from craving of the realm of form.",
        "source": "T26n1539_013:0595a09_29"
    },
    {
        "source_sentence": "及色界生長未離色界貪補特伽羅。",
        "translation": "and the growth in the form realm that's not free of craving in the form realm.",
        "source": "T26n1539_013:0595a11_30"
    },
    {
        "source_sentence": "若成就不善心，亦成就色界繫無覆無記心耶？",
        "translation": "If someone has accomplished an unwholesome mind, will they also accomplish the form realm's bound, unobstructed, and indeterminate mind?",
        "source": "T26n1539_013:0595a12_0"
    },
    {
        "source_sentence": "若成就不善心，定不成就色界繫無覆無記心。",
        "translation": "If someone has accomplished an unwholesome mental state, they definitely won't accomplish a form realm fetter that's unobstructed and indeterminate.",
        "source": "T26n1539_013:0595a13_1"
    },
    {
        "source_sentence": "若成就色界繫無覆無記心，定不成就不善心。",
        "translation": "If someone has accomplished an unobstructed, indeterminate mind bound to the form realm, they definitely won't accomplish an unwholesome mind.",
        "source": "T26n1539_013:0595a14_2"
    },
    {
        "source_sentence": "若成就不善心亦成就無色界繫善心耶？",
        "translation": "If someone has accomplished an unwholesome mind, will they also accomplish a good mind bound to the formless realm?",
        "source": "T26n1539_013:0595a15_3"
    },
    {
        "source_sentence": "若成就不善心，定不成就無色界繫善心。",
        "translation": "If someone has accomplished an unwholesome mind, they definitely won't accomplish a good mind bound to the formless realm.",
        "source": "T26n1539_013:0595a16_4"
    },
    {
        "source_sentence": "若成就無色界繫善心，定不成就不善心。",
        "translation": "If someone has accomplished a good mind bound to the formless realm, they definitely won't accomplish an unwholesome mind.",
        "source": "T26n1539_013:0595a17_5"
    },
    {
        "source_sentence": "若成就不善心，亦成就無色界繫有覆無記心耶？",
        "translation": "If someone has accomplished an unwholesome mind, will they also accomplish a covered indeterminate mind bound to the formless realm?",
        "source": "T26n1539_013:0595a18_6"
    },
    {
        "source_sentence": "若成就不善心，定成就無色界繫有覆無記心。",
        "translation": "If someone has accomplished an unwholesome mind, they'll definitely accomplish a covered and indeterminate mind bound to the formless realm.",
        "source": "T26n1539_013:0595a19_7"
    },
    {
        "source_sentence": "或成就無色界繫有覆無記心非不善心，謂有學異生已離欲界貪。",
        "translation": "Or they may achieve a mind bound to the formless realm that's covered, indeterminate, and not an unwholesome mind, meaning that there are trainees and ordinary people who have parted with desire in the desire realm.",
        "source": "T26n1539_013:0595a20_8"
    },
    {
        "source_sentence": "若成就不善心，定不成就無色界繫無覆無記心。",
        "translation": "If someone has accomplished an unwholesome state of mind, they definitely won't accomplish a formless state bound to the form realm that's unobstructed and indeterminate.",
        "source": "T26n1539_013:0595a21_9"
    },
    {
        "source_sentence": "若無學心若成就無色界繫無覆無記心，若無學心定不成就不善心。",
        "translation": "If there's an untrained mind, if it accomplishes the formless realm fetters that are bound to the unobstructed indeterminate mind, and if there's an untrained mind that's concentrated, it doesn't accomplish an unwholesome mind.",
        "source": "T26n1539_013:0595a23_10"
    },
    {
        "source_sentence": "若成就不善心，亦成就學心耶？",
        "translation": "If someone has accomplished an unwholesome mind, will they also accomplish the mind of training?",
        "source": "T26n1539_013:0595a24_11"
    },
    {
        "source_sentence": "或成就不善心非學心，或成就學心非不善心，或成就不善心亦學心，或非成就不善心亦非學心。",
        "translation": "They may develop an unwholesome mind that's not a mind of training, or they may develop a mind of training that's not an unwholesome mind, or they may develop an unwholesome mind that's also a mind of training, or they may not develop an unwholesome mind that's neither a mind of training nor a mind of training.",
        "source": "T26n1539_013:0595a25_12"
    },
    {
        "source_sentence": "成就不善心非學心者，謂欲界生長異生未離欲界貪。",
        "translation": "Accomplishment of an unwholesome awareness that is no awareness of the seeker: when arising in the realm of sexual passion, beings and worldlings who are not yet free from craving of the realm of sexual passion.",
        "source": "T26n1539_013:0595a27_13"
    },
    {
        "source_sentence": "成就學心非不善心者，謂諸有學已離欲界貪。",
        "translation": "Accomplishment of the awarenesses of the seeker and not of the bad one: beings who have already gone beyond the craving of the realm of sexual passion after having studied.",
        "source": "T26n1539_013:0595a28_14"
    },
    {
        "source_sentence": "成就不善心亦學心者，謂諸有學未離欲界貪。",
        "translation": "Accompanied by bad awarenesses and also with the awareness of the seeker: learned ones who are not free from craving of the realm of sexual passion.",
        "source": "T26n1539_013:0595a29_15"
    },
    {
        "source_sentence": "非成就不善心亦非學心者，謂阿羅漢及諸異生已離欲界貪。",
        "translation": "Those who don't have accomplished an unwholesome mind and aren't training in a mind are arhats and ordinary people who have parted with craving in the desire realm.",
        "source": "T26n1539_013:0595b02_0"
    },
    {
        "source_sentence": "若成就欲界繫有覆無記心，亦成就欲界繫無覆無記心耶？",
        "translation": "If someone has accomplished a mind bound to the desire realm that's covered and indeterminate, will they also accomplish a mind bound to the desire realm that's uncovered and indeterminate?",
        "source": "T26n1539_013:0595b03_1"
    },
    {
        "source_sentence": "若成就欲界繫有覆無記心，定成就欲界繫無覆無記心。",
        "translation": "If someone has accomplished a mind that's bound to the desire realm that's covered and indeterminate, they'll surely accomplish a mind that's bound to the desire realm that's uncovered and indeterminate.",
        "source": "T26n1539_013:0595b04_2"
    },
    {
        "source_sentence": "或成就欲界繫無覆無記心非欲界繫有覆無記心，謂欲界生長已離欲界貪，",
        "translation": "Or they may develop an undefiled indeterminate mental state bound to the realm of sexual passion and not an undefiledneutral mental state bound to the realm of sexual passion. That is to say, having arisen in the realm of sexual passion, one becomes free from craving in the realm of sexual passion.",
        "source": "T26n1539_013:0595b06_3"
    },
    {
        "source_sentence": "及未離欲界貪聖者現觀邊苦法智已生，若色界生長補特伽羅。",
        "translation": "and those who are not yet free from craving in the realm of sexual passion. The noble one presently observes extreme frustration as having already arisen with knowledge of the law in relation to frustration.",
        "source": "T26n1539_013:0595b07_4"
    },
    {
        "source_sentence": "若成就欲界繫有覆無記心，亦成就色界繫善心耶？",
        "translation": "If someone has accomplished a mind bound to the desire realm that's covered and indeterminate, will they also accomplish a good mind bound to the form realm?",
        "source": "T26n1539_013:0595b09_5"
    },
    {
        "source_sentence": "或成就欲界繫有覆無記心非色界繫善心，或成就色界繫善心非欲界繫有覆無記心，",
        "translation": "Or they may attain a mind bound to the desire realm that's defiled and indeterminate, not a good mind bound to the form realm, or a mind bound to the form realm that's good and not a defiled and indeterminate mind bound to the desire realm.",
        "source": "T26n1539_013:0595b10_6"
    },
    {
        "source_sentence": "或成就欲界繫有覆無記心亦色界繫善心，或非成就欲界繫有覆無記心亦非色界繫善心。",
        "translation": "Or they may achieve a mind that's bound to the desire realm that's defiled and indeterminate, or a good mind that's bound to the form realm, or they may not achieve a mind that's bound to the desire realm that's defiled and indeterminate, nor a good mind that's bound to the form realm.",
        "source": "T26n1539_013:0595b12_7"
    },
    {
        "source_sentence": "成就欲界繫有覆無記心非色界繫善心者，謂欲界生長未得色界善心補特伽羅。",
        "translation": "Accomplishment of defiled-neutral awarenesses bound to the realm of sexual passion that are not good awarenesses bound to the realm of form: when arising in the realm of sexual passion, they do not acquire a good awareness of the realm of form.",
        "source": "T26n1539_013:0595b14_8"
    },
    {
        "source_sentence": "成就色界繫善心非欲界繫有覆無記心者，謂欲界生長異生已離欲界貪，",
        "translation": "Accomplishment of the good awarenesses fettered in the realm of form that are not fettered in the realm of sexual passion and of the defiled-neutral awarenesses”:",
        "source": "T26n1539_013:0595b16_9"
    },
    {
        "source_sentence": "及未離欲界貪聖者現觀邊苦法智已生，若色界生長補特伽羅。",
        "translation": "and those who are not yet free from craving in the realm of sexual passion. The noble one presently observes extreme frustration as having already arisen with knowledge of the law in relation to frustration.",
        "source": "T26n1539_013:0595b18_10"
    },
    {
        "source_sentence": "成就欲界繫有覆無記心亦色界繫善心者，謂欲界生長異生未離欲界貪已得色界善心，",
        "translation": "Accomplishment of defiled-neutral awarenesses bound to the realm of sexual passion that are also good awarenesses bound to the realm of form: when arising in the realm of sexual passion, ordinary beings who have not yet abandoned craving of the realm of sexual passion acquire good awarenesses of the realm of form.",
        "source": "T26n1539_013:0595b19_11"
    },
    {
        "source_sentence": "及未離欲界貪聖者現觀邊苦法智未生。",
        "translation": "and those who haven't yet parted with the desire realm's craving for the noble person's presently observing the limits of suffering as cognition of the Dharma has yet to arise.",
        "source": "T26n1539_013:0595b21_12"
    },
    {
        "source_sentence": "非成就欲界繫有覆無記心亦非色界繫善心者，謂無色界生長補特伽羅。",
        "translation": "Someone who doesn't attain the mind that's bound to the desire realm, which is covered and indeterminate, and isn't bound to the good mind of the form realm refers to the growing up of the person in the formless realm.",
        "source": "T26n1539_013:0595b22_13"
    },
    {
        "source_sentence": "若成就欲界繫有覆無記心，亦成就色界繫有覆無記心耶？",
        "translation": "If someone has accomplished a mind bound to the desire realm that's covered and indeterminate, will they also accomplish a mind bound to the form realm that's covered and indeterminate?",
        "source": "T26n1539_013:0595b24_14"
    },
    {
        "source_sentence": "若成就欲界繫有覆無記心，定成就色界繫有覆無記心。",
        "translation": "If someone has accomplished a mind that's bound to the desire realm that's covered and indeterminate, they'll surely accomplish a mind that's bound to the form realm that's covered and indeterminate.",
        "source": "T26n1539_013:0595b25_15"
    },
    {
        "source_sentence": "或成就色界繫有覆無記心非欲界繫有覆無記心，謂欲界生長有學異生已離欲界貪未離色界貪，",
        "translation": "It sometimes accomplishes defiled-neutral awarenesses bound to the realm of form and not defiled-neutral awarenesses bound to the realm of sexual passion. That is to say, when arising in the realm of sexual passion, there are already beings who have parted with craving of the realm of sexual passion but not yet free from craving of the realm of",
        "source": "T26n1539_013:0595b27_16"
    },
    {
        "source_sentence": "及未離欲界貪聖者現觀邊苦法智已生，若生色界生長未離彼貪補特伽羅。",
        "translation": "and those who are not yet free of craving in the desire realm have already arisen from the knowledge of the Dharma that observes the extremes of suffering, and if they arise in the form realm and grow up without being free of that craving, then they're not free of it.",
        "source": "T26n1539_013:0595b29_17"
    },
    {
        "source_sentence": "若成就欲界繫有覆無記心，定不成就色界繫無覆無記心，若無色界繫善心。",
        "translation": "If someone has accomplished a mind that's tethered to the desire realm and a mind that's tethered to the form realm, they definitely won't accomplish a mind that's tethered to the form realm and a mind that's tethered to the formless realm that's uncovered and indeterminate, or if they're tethered to",
        "source": "T26n1539_013:0595c02_18"
    },
    {
        "source_sentence": "若成就色界繫無覆無記心，若無色界繫善心，定不成就欲界繫有覆無記心。",
        "translation": "If they accomplish unobstructed indeterminate mental states bound to the form realm, and if they accomplish good mental states bound to the formless realm, they definitely don't accomplish unobstructed mental states that are bound to the desire realm.",
        "source": "T26n1539_013:0595c04_19"
    },
    {
        "source_sentence": "若成就欲界繫有覆無記心，亦成就無色界繫有覆無記心耶？",
        "translation": "If someone has accomplished a mind bound to the desire realm that's covered and indeterminate, will they also accomplish a mind bound to the formless realm that's covered and indeterminate?",
        "source": "T26n1539_013:0595c05_20"
    },
    {
        "source_sentence": "若成就欲界繫有覆無記心，定成就無色界繫有覆無記心。",
        "translation": "If someone has accomplished a mind that's tethered to the desire realm and a mind that's tethered to the form realm, they'll surely accomplish a mind that's tethered to the formless realm and a mind that's tethered to the form realm.",
        "source": "T26n1539_013:0595c07_21"
    },
    {
        "source_sentence": "或成就無色界繫有覆無記心非欲界繫有覆無記心，謂已離欲界貪有學異生，",
        "translation": "Or they may develop a mind bound to the formless realm that's covered and indeterminate, not a mind bound to the realm of desire that's covered and indeterminate. That is to say, having parted with craving in the realm of desire, there are trainees and unenlightened worldlings.",
        "source": "T26n1539_013:0595c08_22"
    },
    {
        "source_sentence": "及未離欲界貪聖者現觀邊苦法智已生。",
        "translation": "and those who haven't yet parted with the desire realm's craving for the noble person's presently observing the cognition of the Dharma of suffering at the extremes have already arisen.",
        "source": "T26n1539_013:0595c10_23"
    },
    {
        "source_sentence": "若成就欲界繫有覆無記心，定不成就無色界繫無覆無記心，若無學心。",
        "translation": "If someone has accomplished a mind bound to the desire realm that's covered and indeterminate, they definitely won't accomplish a mind bound to the formless realm that's uncovered and indeterminate, or if they don't have a post-learning mind.",
        "source": "T26n1539_013:0595c11_24"
    },
    {
        "source_sentence": "若成就無色界繫無覆無記心，若無學心，定不成就欲界繫有覆無記心。",
        "translation": "If someone has accomplished an undefiled indeterminate mind bound to the formless realm, and if they have an unlearned mind, they definitely won't accomplish an undefiled indeterminate mind bound to the desire realm.",
        "source": "T26n1539_013:0595c13_25"
    },
    {
        "source_sentence": "若成就欲界繫有覆無記心，亦成就學心耶？",
        "translation": "If someone has accomplished the mind bound to the desire realm that's covered and indeterminate, will they also accomplish the mind of training?",
        "source": "T26n1539_013:0595c14_26"
    },
    {
        "source_sentence": "或成就欲界繫有覆無記心非學心，或成就學心非欲界繫有覆無記心，或成就欲界繫有覆無記心亦學心，",
        "translation": "Sometimes they develop a mind bound to the realm of sexual passion that is defiled and indeterminate; sometimes they develop a mind not belonging to those who are still learning; sometimes they develop a mind belonging to those who are still learning but not a mind not bound to the realm of sexual passion that is defiled and indeterminate; sometimes they develop a mind belonging to those who are",
        "source": "T26n1539_013:0595c15_27"
    },
    {
        "source_sentence": "或非成就欲界繫有覆無記心亦非學心。",
        "translation": "Or it might not be the mind that's bound to the desire realm and covered with indeterminate mental states, or it might not be the mind of training.",
        "source": "T26n1539_013:0595c18_28"
    },
    {
        "source_sentence": "成就欲界繫有覆無記心非學心者，謂欲界生長異生未離欲界貪。",
        "translation": "Accomplishment of defiled-neutral awarenesses bound to the realm of sexual passion that are not awarenesses of the seeker: growing up in the realm of sexual passion as an ordinary person and not yet free from craving of the realm of sexual passion.",
        "source": "T26n1539_013:0595c19_29"
    },
    {
        "source_sentence": "成就學心非欲界繫有覆無記心者，謂諸有學現觀邊苦法智已生。",
        "translation": "Accomplishment of the awarenesses of the seeker and not of the one bound to the realm of sexual passion with a defiled awareness that is indeterminate: learned ones who have already arisen from the knowledge of the law in relation to unsatisfactoriness of the extremes of comprehension.",
        "source": "T26n1539_013:0595c20_30"
    },
    {
        "source_sentence": "成就欲界繫有覆無記心亦學心者，謂未離欲界貪聖者現觀邊苦法智未生。",
        "translation": "Accomplishment of defiled-neutral awarenesses bound to the realm of sexual passion that are accompanied by awarenesses acquired through effort is also a learned awareness: noble one who is not free from greed in the realm of sexual passion and who observes the extreme form of unsatisfactoriness.",
        "source": "T26n1539_013:0595c22_31"
    },
    {
        "source_sentence": "非成就欲界繫有覆無記心亦非學心者，謂阿羅漢及諸異生已離欲界貪。",
        "translation": "Someone who hasn't accomplished the mind that's bound to the desire realm, which is covered and indeterminate, and isn't a learner's mind means arhats and ordinary people have parted with craving in the desire realm.",
        "source": "T26n1539_013:0595c24_32"
    },
    {
        "source_sentence": "若成就欲界繫無覆無記心，亦成就色界繫善心耶？",
        "translation": "If someone has accomplished the unobstructed indeterminate mind bound to the desire realm, will they also accomplish the good mind bound to the form realm?",
        "source": "T26n1539_013:0595c25_33"
    },
    {
        "source_sentence": "若成就色界繫善心，定成就欲界繫無覆無記心。",
        "translation": "If someone has accomplished the good mind bound to form realm, they'll definitely accomplish the unobstructed indeterminate mind bound to the desire realm.",
        "source": "T26n1539_013:0595c27_0"
    },
    {
        "source_sentence": "或成就欲界繫無覆無記心非色界繫善心，謂欲界生長未得色界善心補特伽羅。",
        "translation": "Or they may achieve an unobstructed, indeterminate mind bound to the desire realm that's not a good mind bound to the form realm, meaning that it grows in the desire realm and doesn't attain the form realm as a wholesome mind of the pudgala.",
        "source": "T26n1539_013:0595c28_1"
    },
    {
        "source_sentence": "若成就欲界繫無覆無記心，亦成就色界繫有覆無記心耶？",
        "translation": "If someone has accomplished the unobstructed and indeterminate mind bound to the desire realm, will they also accomplish the unobstructed and indeterminate mind bound to the form realm?",
        "source": "T26n1539_013:0596a01_2"
    },
    {
        "source_sentence": "若成就色界繫有覆無記心，定成就欲界繫無覆無記心。",
        "translation": "If someone has accomplished a defiled indeterminate mind bound to the form realm, they'll surely accomplish a defiled indeterminate mind bound to the desire realm.",
        "source": "T26n1539_013:0596a02_3"
    },
    {
        "source_sentence": "或成就欲界繫無覆無記心非色界繫有覆無記心，謂欲界色界生長已離色界貪補特伽羅。",
        "translation": "Or they may achieve an undefiled indeterminate mental state bound to the desire realm that's not a defiled mental state bound to the form realm, which means that after growing up in the form realm of desire and form realm, they're free of covetousness in the form realm as a person.",
        "source": "T26n1539_013:0596a03_4"
    },
    {
        "source_sentence": "若成就欲界繫無覆無記心，亦成就色界繫無覆無記心耶？",
        "translation": "If someone has accomplished the unobstructed indeterminate mind bound to the desire realm, will they also accomplish the unobstructed indeterminate mind bound to the form realm?",
        "source": "T26n1539_013:0596a05_5"
    },
    {
        "source_sentence": "若成就色界繫無覆無記心，定成就欲界繫無覆無記心。",
        "translation": "If someone has accomplished an unobstructed indeterminate mind bound to the form realm, they'll surely accomplish an unobstructed indeterminate mind bound to the desire realm.",
        "source": "T26n1539_013:0596a07_6"
    },
    {
        "source_sentence": "或成就欲界繫無覆無記心非色界繫無覆無記心，謂欲界生長未離欲界貪補特伽羅。",
        "translation": "Or they may achieve an unobstructed indeterminate mental state bound to the desire realm that's not an unobstructed mental state bound to the form realm, meaning that it grows in the desire realm and doesn't part from the desire realm's craving for the pudgala.",
        "source": "T26n1539_013:0596a08_7"
    },
    {
        "source_sentence": "若成就欲界繫無覆無記心，亦成就無色界繫善心耶？",
        "translation": "If someone has accomplished the unobstructed indeterminate mind bound to the desire realm, will they also accomplish the good mind bound to the formless realm?",
        "source": "T26n1539_013:0596a10_8"
    },
    {
        "source_sentence": "或成就欲界繫無覆無記心非無色界繫善心，或成就無色界繫善心非欲界繫無覆無記心，",
        "translation": "Or they may develop an unobstructed, indeterminate mind bound to the realm of desire that's not a good mind bound to the formless realm, or they may develop a good mind bound to the formless realm that's not an unobstructed, indeterminate mind bound to the realm of desire.",
        "source": "T26n1539_013:0596a11_9"
    },
    {
        "source_sentence": "或成就欲界繫無覆無記心亦無色界繫善心，或非成就欲界繫無覆無記心亦非無色界繫善心。",
        "translation": "Or they may achieve an unobstructed indeterminate mind bound to the desire realm that's also a good mind bound to the formless realm, or they may not achieve an unobstructed indeterminate mind bound to the desire realm that's not a good mind bound to the formless realm.",
        "source": "T26n1539_013:0596a13_10"
    },
    {
        "source_sentence": "成就欲界繫無覆無記心非無色界繫善心者，謂欲界色界生長未得無色界善心補特伽羅。",
        "translation": "Accomplishment of the good awarenesses bound to the realm of sexual passion that are unobscured-neutral awarenesses and not those bound to the realm of formlessness*”: when arising in the realm of sexual passion and in the one of form, there is a person who has not acquired the wholesome awarenesses of the realm of formlessness.",
        "source": "T26n1539_013:0596a16_11"
    },
    {
        "source_sentence": "成就無色界繫善心非欲界繫無覆無記心者，謂無色界生長補特伽羅。",
        "translation": "Accomplishment of the good awarenesses bound to the realm of formlessness that are not bound to the realm of sexual passion and of the unobscured and indeterminate awarenesses:",
        "source": "T26n1539_013:0596a18_12"
    },
    {
        "source_sentence": "成就欲界繫無覆無記心亦無色界繫善心者，謂欲界色界生長已得無色界善心補特伽羅。",
        "translation": "Accomplishment of unobstructed-neutral awarenesses bound to the realm of sexual passion and also of good awarenesses bound to the realm of formlessness*”:",
        "source": "T26n1539_013:0596a19_13"
    },
    {
        "source_sentence": "非成就欲界繫無覆無記心亦非無色界繫善心者，無有此句。",
        "translation": "This sentence does not apply to the nonaccompaniment of unobstructed, indeterminate awarenesses bound to the realm of sexual passion and good awarenesses bound to the realm of formlessness.",
        "source": "T26n1539_013:0596a22_0"
    },
    {
        "source_sentence": "若成就欲界繫無覆無記心，亦成就無色界繫有覆無記心耶？",
        "translation": "If someone has accomplished the unobstructed and indeterminate mind bound to the desire realm, will they also accomplish the unobstructed and indeterminate mind bound to the formless realm?",
        "source": "T26n1539_013:0596a23_1"
    },
    {
        "source_sentence": "或成就欲界繫無覆無記心非無色界繫有覆無記心，或成就無色界繫有覆無記心非欲界繫無覆無記心，",
        "translation": "Or they may develop an undefiled indeterminate mental state bound to the realm of desire that's not a defiled and undefiled mental state bound to the formless realm, or they may develop an undefiled and undefiled mental state bound to the formless realm that's not a defiled and undefiled mental state bound to the realm of",
        "source": "T26n1539_013:0596a24_2"
    },
    {
        "source_sentence": "或成就欲界繫無覆無記心亦無色界繫有覆無記心，或非成就欲界繫無覆無記心亦非無色界繫有覆無記心。",
        "translation": "Or they may have accomplished an unobstructed indeterminate mind bound to the desire realm that's also a covered indeterminate mind bound to the formless realm, or they may not have accomplished an unobstructed indeterminate mind bound to the desire realm that's not a covered indeterminate mind bound to the formless realm.",
        "source": "T26n1539_013:0596a27_3"
    },
    {
        "source_sentence": "成就欲界繫無覆無記心非無色界繫有覆無記心者，謂欲界色界生長諸阿羅漢。",
        "translation": "Accomplishment of unobstructed-neutral awarenesses bound to the realm of sexual passion that are not covered-neutral awarenesses bound to the realm of formlessness refers to arhats who arise in the realm of sexual passion and in the one of form.",
        "source": "T26n1539_013:0596a29_4"
    },
    {
        "source_sentence": "成就無色界繫有覆無記心非欲界繫無覆無記心者，謂無色界生長有學異生。",
        "translation": "Accomplishment of defiled-neutral awarenesses bound to the realm of formlessness that are not defiled-neutral awarenesses bound to the realm of sexual passion refers to beings who arise in the formless realm as learners and worldlings.",
        "source": "T26n1539_013:0596b02_5"
    },
    {
        "source_sentence": "成就欲界繫無覆無記心亦無色界繫有覆無記心者，謂欲界色界生長有學位生。",
        "translation": "Accomplishment of the non-obscured-neutral awarenesses bound to the realm of sexual passion that are free from fetters and also the one bound to the realm of formlessness that are with obstructed-neutral awarenesses means that in the realm of sexual passion and in the one of form, there is birth at the stage of having learning.",
        "source": "T26n1539_013:0596b04_6"
    },
    {
        "source_sentence": "非成就欲界繫無覆無記心亦非無色界繫有覆無記心者，謂無色界生長諸阿羅漢。",
        "translation": "He who doesn't attain the unobstructed indeterminate mind bound to the desire realm and the unobstructed indeterminate mind bound to the formless realm refers to arhats growing up in the formless realm.",
        "source": "T26n1539_013:0596b06_7"
    },
    {
        "source_sentence": "若成就欲界繫無覆無記心，定不成就無色界繫無覆無記心。",
        "translation": "If someone has accomplished the unobstructed and indeterminate mind bound to the desire realm, they'll surely not accomplish the unobstructed and indeterminate mind bound to the formless realm.",
        "source": "T26n1539_013:0596b08_8"
    },
    {
        "source_sentence": "若成就無色界繫無覆無記心，定不成就欲界繫無覆無記心。",
        "translation": "If someone has accomplished an unobstructed indeterminate mind bound to the formless realm, they definitely won't accomplish an unobstructed indeterminate mind bound to the desire realm.",
        "source": "T26n1539_013:0596b09_9"
    },
    {
        "source_sentence": "若成就欲界繫無覆無記心，亦成就學心耶？",
        "translation": "If someone has accomplished the unobstructed, indeterminate mind bound to the desire realm, will they also accomplish the mind of training?",
        "source": "T26n1539_013:0596b11_10"
    },
    {
        "source_sentence": "或成就欲界繫無覆無記心非學心，或成就學心非欲界繫無覆無記心，或成就欲界繫無覆無記心亦學心，",
        "translation": "Sometimes they develop an undefiledneutral mind bound to the realm of sexual passion that is free from fetters; sometimes they develop an undefiledneutral mind not belonging to the seeker in the realm of sexual passion; sometimes they develop an undefiledneutral mind not belonging to the seeker in the realm of sexual passion that is free from fetters; sometimes they develop an undefiledneutral",
        "source": "T26n1539_013:0596b12_11"
    },
    {
        "source_sentence": "或非成就欲界繫無覆無記心亦非學心。",
        "translation": "It might not be the mind that's bound to the desire realm and unobstructed indeterminate mental states, or it might not be the mind of training.",
        "source": "T26n1539_013:0596b14_12"
    },
    {
        "source_sentence": "成就欲界繫無覆無記心亦非學心者，謂欲界色界生長阿羅漢，及諸異生。",
        "translation": "Accomplishment of unobstructed-neutral awarenesses bound to the realm of sexual passion that are also not awarenesses of the seeker: arhats and worldlings who arise in the realm of sexual passion or in the one of form.",
        "source": "T26n1539_013:0596b15_13"
    },
    {
        "source_sentence": "成就學心非欲界繫無覆無記心者，謂無色界生長有學補特伽羅。",
        "translation": "Accomplishment of the awarenesses of the seeker and not of the one bound to the realm of sexual passion as unobscured-neutral awarenesses means growing up in the realm of formlessness.",
        "source": "T26n1539_013:0596b17_14"
    },
    {
        "source_sentence": "成就欲界繫無覆無記心亦學心者，謂欲界色界生長有學補特伽羅。",
        "translation": "Accomplishment of unobstructed and indeterminate awarenesses bound to the realm of sexual passion that are also awarenesses of the seeker:",
        "source": "T26n1539_013:0596b19_15"
    },
    {
        "source_sentence": "非成就欲界繫無覆無記心亦非學心者，謂無色界生長阿羅漢，及諸異生。",
        "translation": "Someone who hasn't accomplished an unobstructed, indeterminate mind bound to the desire realm and a mind that's not training means arhats growing up in the formless realm and ordinary people.",
        "source": "T26n1539_013:0596b20_16"
    },
    {
        "source_sentence": "若成就欲界繫無覆無記心，亦成就無學心耶？",
        "translation": "If someone has accomplished an unobstructed, indeterminate mind bound to the desire realm, will they also accomplish an unlearned mind?",
        "source": "T26n1539_013:0596b22_17"
    },
    {
        "source_sentence": "或成就欲界繫無覆無記心非無學心，廣說四句。",
        "translation": "Or they may achieve an unobstructed, indeterminate mind bound to the desire realm that's not a post-learning mind. Four sentences are explained in four broad ways.",
        "source": "T26n1539_013:0596b23_18"
    },
    {
        "source_sentence": "成就欲界繫無覆無記心非無學心者，謂欲界色界生長有學，及諸異生。",
        "translation": "Accomplishment of unobstructed and indeterminate awarenesses bound to the realm of sexual passion that are not awarenesses of post learners means having grown up in the realm of sexual passion and in the one of form.",
        "source": "T26n1539_013:0596b24_19"
    },
    {
        "source_sentence": "成就無學心非欲界繫無覆無記心者，謂無色界生長諸阿羅漢。",
        "translation": "Accomplishment of the state of having no more learning to do and not a state bound to the realm of sexual passion that is unobscured-neutral awarenesses”: arhats growing up in the realm of formlessness.",
        "source": "T26n1539_013:0596b26_20"
    },
    {
        "source_sentence": "成就欲界繫無覆無記心亦無學心者，謂欲界色界生長諸阿羅漢。",
        "translation": "Accomplishment of unobstructed-neutral awarenesses bound to the realm of sexual passion and also of awarenesses having no more learning to do means arhats who arise in the realm of sexual passion and in the one of form.",
        "source": "T26n1539_013:0596b27_21"
    },
    {
        "source_sentence": "非成就欲界繫無覆無記心亦非無學心者，謂無色界生長有學，及諸異生。",
        "translation": "Those who haven't accomplished an unobstructed, indeterminate mind bound to the desire realm and a mind that's not post-learning are those who grow up in the formless realm and trainees and ordinary people.",
        "source": "T26n1539_013:0596b29_22"
    },
    {
        "source_sentence": "若成就色界繫善心，亦成就色界繫有覆無記心耶？",
        "translation": "If someone has accomplished the good mind bound to the form realm, will they also accomplish the defiled and indeterminate mind bound to the form realm?",
        "source": "T26n1539_013:0596c02_23"
    },
    {
        "source_sentence": "或成就色界繫善心非色界繫有覆無記心，廣說四句。",
        "translation": "Or they may achieve a mind bound to the form realm that's good, not a mind bound to the form realm that's covered or indeterminate, and explain four broadly explained sentences.",
        "source": "T26n1539_013:0596c03_24"
    },
    {
        "source_sentence": "成就色界繫善心非色界繫有覆無記心者，謂欲界色界生長已離色界貪補特伽羅。",
        "translation": "Accomplishment of the good awarenesses bound to the realm of form that are not bound to the realm of form with a defiled and an indeterminate awareness”: after having arisen in the realm of sexual passion and in the one of form, being free from craving of the realm of form.",
        "source": "T26n1539_013:0596c04_25"
    },
    {
        "source_sentence": "成就色界繫有覆無記心非色界繫善心者，謂欲界生長未得色界善心補特伽羅。",
        "translation": "Accomplishment of defiled-neutral awarenesses bound to the realm of form that are not good awarenesses bound to the realm of form is when they arise in the realm of sexual passion and have not acquired the wholesome awarenesses of the realm of form yet.",
        "source": "T26n1539_013:0596c06_26"
    },
    {
        "source_sentence": "成就色界繫善心亦色界繫有覆無記心者，謂欲界生長已得色界善心未離色界貪，",
        "translation": "Accomplishment of the good awarenesses fettered in the realm of form that are bound to matter, as well as the defiled-neutral awarenesses fettered in the realm of form: when arising in the realm of sexual passion and having already acquired the good awarenesses of the realm of form but not yet free from attachment of the realm of form.",
        "source": "T26n1539_013:0596c08_27"
    },
    {
        "source_sentence": "及色界生長未離彼貪補特伽羅。",
        "translation": "and the growth in the form realm that's not free of those cravings as well as the pudgala.",
        "source": "T26n1539_013:0596c10_28"
    },
    {
        "source_sentence": "非成就色界繫善心亦非色界繫有覆無記心者，謂無色界生長補特伽羅。",
        "translation": "He who doesn't attain the good mind bound to form and the covered indeterminate mind that's not bound to form refers to the growing up of a person in the formless realm.",
        "source": "T26n1539_013:0596c11_29"
    },
    {
        "source_sentence": "若成就色界繫善心，亦成就色界繫無覆無記心耶？",
        "translation": "If someone has accomplished the good mental state bound to the form realm, will they also accomplish the unobstructed and indeterminate mental state bound to the form realm?",
        "source": "T26n1539_013:0596c12_30"
    },
    {
        "source_sentence": "若成就色界繫無覆無記心，定成就色界繫善心。",
        "translation": "If someone has accomplished an unobstructed indeterminate mind bound to the form realm, they'll surely accomplish a good mind bound to the form realm.",
        "source": "T26n1539_013:0596c14_31"
    },
    {
        "source_sentence": "或成就色界繫善心非色界繫無覆無記心，謂欲界生長未離欲界貪已得色界繫善心補特伽羅。",
        "translation": "Or they may achieve a mind bound to form that's good and not a mind bound to form that's unobstructed and indeterminate, meaning that when it grows in the desire realm but doesn't part with craving in the desire realm, it's already attained as a mind bound to form that's good and a mind bound to form that's",
        "source": "T26n1539_013:0596c15_32"
    },
    {
        "source_sentence": "若成就色界繫善心，亦成就無色界善心耶？",
        "translation": "If someone has accomplished a good mind bound to the form realm, will they also accomplish a good mind in the formless realm?",
        "source": "T26n1539_013:0596c17_33"
    },
    {
        "source_sentence": "或成就色界繫善心非無色界繫善心，廣說四句。",
        "translation": "Or they may achieve a mind bound to the form realm that's good and not a mind bound to the formless realm that's good, which are explained in four extensive sentences.",
        "source": "T26n1539_013:0596c18_34"
    },
    {
        "source_sentence": "成就色界繫善心非無色界繫善心者，謂欲界生長已得色界善心未得無色界善心，",
        "translation": "Accomplishment of good awarenesses fettered in the realm of form and not of good awarenesses fettered in the realm of formlessness means that having grown up in the realm of sexual passion, one acquires a good awareness of the realm of form but not a good awareness of the formless realm.",
        "source": "T26n1539_013:0596c19_35"
    },
    {
        "source_sentence": "及色界生長未得無色界善心補特伽羅。",
        "translation": "and the mind that grows in the form realm but doesn't attain good mental states in the formless realm.",
        "source": "T26n1539_013:0596c21_36"
    },
    {
        "source_sentence": "成就無色界繫善心非色界繫善心者，謂無色界生長補特伽羅。",
        "translation": "Accomplishment of good awarenesses fettered in the realm of formlessness and not of good awarenesses fettered in the realm of form is growing up in the realm of formlessness.",
        "source": "T26n1539_013:0596c22_37"
    },
    {
        "source_sentence": "成就色界繫善心亦無色繫善心者，謂欲界色界生長已得無色界善心補特伽羅。",
        "translation": "Accomplishment of the good awarenesses fettered in the realm of form and also the good awarenesses fettered in the one of formlessness: after having arisen in the realm of sexual passion and in the one of form, there is acquisition of the mental state of being without form.",
        "source": "T26n1539_013:0596c24_38"
    },
    {
        "source_sentence": "非成就色界繫善心亦非無色界繫善心者，謂欲界生長未得色界善心補特伽羅。",
        "translation": "Someone who hasn't accomplished the good mind bound to the form realm and not the good mind bound to the formless realm means that they grow up in the desire realm and haven't yet attained the body of form as a wholesome mind.",
        "source": "T26n1539_013:0596c26_39"
    },
    {
        "source_sentence": "若成就色界繫善心，亦成就無色界繫有覆無記心耶？",
        "translation": "If someone has accomplished the good mind bound to the form realm, will they also accomplish the defiled and indeterminate mind bound to the formless realm?",
        "source": "T26n1539_013:0596c28_40"
    },
    {
        "source_sentence": "或成就色界繫善心非無色界繫有覆無記心，廣說四句。",
        "translation": "Or they may achieve a mind bound to the form realm that's good, not a mind bound to the formless realm that's covered or indeterminate, and explain four broadly explained sentences.",
        "source": "T26n1539_013:0596c29_41"
    },
    {
        "source_sentence": "成就色界繫善心非無色界繫有覆無記心者，謂欲界色界生長諸阿羅漢。",
        "translation": "Accomplishment of the good awarenesses fettered in the realm of form that are not fettered in the realm of form and of the defiled-neutral awarenesses that are not fettered in the realm of formlessness means arhats growing up in the realm of sexual passion and in the one of form.",
        "source": "T26n1539_013:0597a01_42"
    },
    {
        "source_sentence": "成就無色界繫有覆無記心非色界繫善心者，謂欲界生長未得色界善心，",
        "translation": "Accomplishment of the good awarenesses bound to the realm of formlessness that are defiled-neutral awarenesses and not those bound to the realm of form: when arising in the realm of sexual passion, they do not acquire the good awarenesses of the realm of form.",
        "source": "T26n1539_013:0597a03_43"
    },
    {
        "source_sentence": "及無色界生長有學異生。",
        "translation": "and the formless realm that grows, there are trainees and non-Buddhists.",
        "source": "T26n1539_013:0597a05_44"
    },
    {
        "source_sentence": "成就色界繫善心亦無色界繫有覆無記心者，謂欲界生長有學異生已得色界善心，",
        "translation": "Accomplishment of the good awarenesses fettered in the realm of form that are also fettered in the realm of formlessness and the defiled-neutral awarenesses that are fettered in the realm of form: when arising in the realm of sexual passion, there are two.",
        "source": "T26n1539_013:0597a05_45"
    },
    {
        "source_sentence": "及色界生長有學異生。",
        "translation": "and the form realm that grows, there are trainees and unenlightened sentient beings.",
        "source": "T26n1539_013:0597a07_46"
    },
    {
        "source_sentence": "非成就色界繫善心亦非無色界繫有覆無記心者，謂無色界生長諸阿羅漢。",
        "translation": "He who doesn't attain the mind that's bound to goodness in the form realm and isn't bound to obscured or indeterminate mind in the formless realm refers to arhats growing up in the formless realm.",
        "source": "T26n1539_013:0597a08_47"
    },
    {
        "source_sentence": "若成就色界繫善心，定不成就無色界繫無覆無記心。",
        "translation": "If someone has accomplished the good mind bound to form realm, they definitely won't accomplish the unobstructed indeterminate mind bound to formless realm.",
        "source": "T26n1539_013:0597a09_48"
    },
    {
        "source_sentence": "若成就無色界繫無覆無記心，定不成就色界繫善心。",
        "translation": "If someone has accomplished an unobstructed indeterminate mind bound to the formless realm, they definitely won't accomplish a good mind bound to the form realm.",
        "source": "T26n1539_013:0597a11_49"
    },
    {
        "source_sentence": "若成就色界繫善心，亦成就學心耶？",
        "translation": "If someone has accomplished the good mind bound to the form realm, will they also accomplish the mind of training?",
        "source": "T26n1539_013:0597a12_50"
    },
    {
        "source_sentence": "或成就色界繫善心非學心，廣說四句。",
        "translation": "Or they may achieve a mind bound to the form realm that's good and not training, which are explained in four extensive ways.",
        "source": "T26n1539_013:0597a13_51"
    },
    {
        "source_sentence": "成就色界繫善心非學心者，謂欲界生長阿羅漢，及諸異生已得色界善心，",
        "translation": "Accomplishment of the good awarenesses fettered in the realm of form and no awareness of the seeker: arhats growing up in the realm of sexual passion and worldlings who have already acquired the good awarenesses of the realm of form.",
        "source": "T26n1539_013:0597a14_52"
    },
    {
        "source_sentence": "若色界生長阿羅漢及諸異生。",
        "translation": "Suppose arhats and non-Buddhists who grow in the form realm.",
        "source": "T26n1539_013:0597a15_53"
    },
    {
        "source_sentence": "成就學心非色界繫善心者，謂無色界生長有學補特伽羅。",
        "translation": "Accomplishment of the awarenesses of the seeker and no good awarenesses fettered in the realm of form is what is called ‘growing up in the realm of formlessness’.",
        "source": "T26n1539_013:0597a16_54"
    },
    {
        "source_sentence": "成就色界繫善心亦學心者，謂欲界色界生長有學補特伽羅。",
        "translation": "Accomplishment of good awarenesses bound to the realm of form that are also awarenesses of the seeker”:",
        "source": "T26n1539_013:0597a17_55"
    },
    {
        "source_sentence": "非成就色界繫善心亦非學心者，謂欲界生長未得色界善心，及無色界生長阿羅漢及諸異生。",
        "translation": "Those who haven't accomplished the good mind bound to form realm and aren't training are arhats and ordinary people who grow up in the desire realm but haven't yet attained the good mind of form realm, and arhats and worldlings who grow up in the formless realm.",
        "source": "T26n1539_013:0597a19_56"
    },
    {
        "source_sentence": "若成就色界繫善心，亦成就無學心耶？",
        "translation": "If someone has accomplished the good mind bound to the form realm, will they also accomplish the post-learning mind?",
        "source": "T26n1539_013:0597a21_57"
    },
    {
        "source_sentence": "或成就色界繫善心非無學心，廣說四句。",
        "translation": "Or they may achieve a mind bound to the form realm that's good and not an post-learning mind, which are explained in four extensive ways.",
        "source": "T26n1539_013:0597a22_58"
    },
    {
        "source_sentence": "成就色界繫善心非無學心者，謂欲界生長有學異生已得色界善心，及色界生長有學異生。",
        "translation": "Accomplishment of the good awarenesses fettered in the realm of form and not of the one without more learning®”: When arising in the realm of sexual passion, there are still having learning to do and beings who have no more learning to do.",
        "source": "T26n1539_013:0597a23_59"
    },
    {
        "source_sentence": "成就無學心非色界繫善心者，謂無色界生長諸阿羅漢。",
        "translation": "Accomplishment of a good awareness bound to the realm of form when having no more learning to do and not in the one of form: arhats growing up in the realm of formlessness.",
        "source": "T26n1539_013:0597a25_60"
    },
    {
        "source_sentence": "成就色界繫善心亦無學心者，謂欲界色界生長諸阿羅漢。",
        "translation": "Accomplishment of the good awarenesses bound to the realm of form and also of the one without more learning: arhats who arise in the realm of sexual passion or in the one of form.",
        "source": "T26n1539_013:0597a26_61"
    },
    {
        "source_sentence": "非成就色界繫善心亦非無學心者，謂欲界生長未得色界善心，及無色界生長有學異生。",
        "translation": "Those who haven't accomplished the good mind bound to form realm and aren't post-learning minds are those who grow up in the desire realm without attaining the good mind of form realm and those who grow up in the formless realm as trainees and worldlings.",
        "source": "T26n1539_013:0597a28_62"
    },
    {
        "source_sentence": "若成就色界繫有覆無記心，亦成就色界繫無覆無記心耶？",
        "translation": "If someone has accomplished a covered and indeterminate mind bound to the form realm, will they also accomplish a covered and indeterminate mind bound to the form realm?",
        "source": "T26n1539_013:0597b01_63"
    },
    {
        "source_sentence": "或成就色界繫有覆無記心非色界繫無覆無記心，廣說四句。",
        "translation": "Or they may achieve a mind bound to the form realm that's covered and indeterminate and not a mind bound to the form realm that's uncovered and indeterminate, which are explained in four extensive ways.",
        "source": "T26n1539_013:0597b02_64"
    },
    {
        "source_sentence": "成就色界繫有覆無記心非色界繫無覆無記心者，謂欲界生長未離欲界貪補特伽羅。",
        "translation": "Accomplishment of defiled-neutral awarenesses bound to the realm of form and not of defiled-neutral awarenesses bound to the realm of form is when arising in the realm of sexual passion but not when not free from craving in the realm of sexual passion.",
        "source": "T26n1539_013:0597b04_0"
    },
    {
        "source_sentence": "成就色界繫無覆無記心非色界繫有覆無記心者，謂欲界色界生長已離色界貪補特伽羅。",
        "translation": "Accomplishment of unobstructed-neutral awarenesses bound to the realm of form and not of obstructed-neutral awarenesses bound to the realm of form: after having arisen in the realm of sexual passion and in the one of form, being free from craving of the realm of form.",
        "source": "T26n1539_013:0597b06_0"
    },
    {
        "source_sentence": "成就色界繫有覆無記心亦色界繫無覆無記心者，謂欲界生長已離欲界貪未離色界貪，",
        "translation": "Accomplishment of defiled-neutral awarenesses bound to the realm of form and also of defiled-neutral awarenesses bound to the realm of form: after having arisen in the realm of sexual passion, free from craving of the realm of sexual passion and not yet free from craving of the realm of form.",
        "source": "T26n1539_013:0597b08_1"
    },
    {
        "source_sentence": "及色界生長未離彼貪補特伽羅。",
        "translation": "and the growth in the form realm that's not free of those cravings as well as the pudgala.",
        "source": "T26n1539_013:0597b10_2"
    },
    {
        "source_sentence": "非成就色界繫有覆無記心亦非色界繫無覆無記心者，謂無色界生長補特伽羅。",
        "translation": "He who doesn't attain the form realm fetters that are covered and indeterminate mental states, and he doesn't attain the form realm fetters that are uncovered and indeterminate mental states: this is called growing up in the formless realm as a personal.",
        "source": "T26n1539_013:0597b10_3"
    },
    {
        "source_sentence": "若成就色界繫有覆無記心，亦成就無色界繫善心耶？",
        "translation": "If someone has accomplished a mind bound to the form realm that's covered and indeterminate, will they also accomplish a good mind bound to the formless realm?",
        "source": "T26n1539_013:0597b12_4"
    },
    {
        "source_sentence": "或成就色界繫有覆無記心非無色繫善心，廣說四句。",
        "translation": "Or they may achieve a mind bound to the form realm that's covered, indeterminate, and not a good mind bound to formlessness. Four sentences are explained in four broad ways.",
        "source": "T26n1539_013:0597b14_5"
    },
    {
        "source_sentence": "成就色界繫有覆無記心非無色界繫善心者，謂欲界色界生長未得無色界善心補特伽羅。",
        "translation": "Accomplishment of the good awarenesses bound to the realm of form that are defiled-neutral awarenesses and not those bound to the realm of formlessness: when arising in the realm of sexual passion or in the one of form, they do not acquire a good awareness of the realm of form.",
        "source": "T26n1539_013:0597b15_6"
    },
    {
        "source_sentence": "成就無色界繫善心非色界繫有覆無記心者，謂欲界色界生長已離色界貪，",
        "translation": "Accomplishment of the good awarenesses fettered in the realm of formlessness that are not fettered in the realm of form and of the defiled-neutral awarenesses”:",
        "source": "T26n1539_013:0597b17_7"
    },
    {
        "source_sentence": "及無色界生長補特伽羅。",
        "translation": "and the growth of the formless realm in the pudgala.",
        "source": "T26n1539_013:0597b19_8"
    },
    {
        "source_sentence": "成就色界繫有覆無記心亦無色界繫善心者，謂欲界色界生長未離色界貪已得無色界善心補特伽羅。",
        "translation": "Accomplishment of defiled-neutral awarenesses bound to the realm of form that are also good awarenesses bound to the realm of formlessness: when arising in the realm of sexual passion or in the one of form but not yet free from craving of the realm of form, after having acquired a good awareness of the realm of formlessness.",
        "source": "T26n1539_013:0597b19_9"
    },
    {
        "source_sentence": "非成就色界繫有覆無記心亦非無色界繫善心者，無有此句。",
        "translation": "It is not the case that one does not possess defiledneutral awarenesses bound to the realm of form and good awarenesses bound to the realm of formlessness.",
        "source": "T26n1539_013:0597b22_10"
    },
    {
        "source_sentence": "若成就色界繫有覆無記心，亦成就無色界繫有覆無記心耶？",
        "translation": "If someone has accomplished a mind bound to the form realm that's covered and indeterminate, will they also accomplish a mind bound to the formless realm that's covered and indeterminate?",
        "source": "T26n1539_013:0597b23_11"
    },
    {
        "source_sentence": "若成就色界繫有覆無記心，定成就無色界繫有覆無記心。",
        "translation": "If someone has accomplished a mind that's bound to the form realm that's covered and indeterminate, they'll surely accomplish a mind that's bound to the formless realm that's covered and indeterminate.",
        "source": "T26n1539_013:0597b25_0"
    },
    {
        "source_sentence": "或成就無色界繫有覆無記心非色界繫有覆無記心，謂有學異生已離色界貪。",
        "translation": "Or they may achieve a mind bound to the formless realm that's covered and indeterminate, not a mind bound to the form realm that's covered and indeterminate, meaning that there are trainees and ordinary people who have parted with craving in the form realm.",
        "source": "T26n1539_013:0597b26_1"
    },
    {
        "source_sentence": "若成就色界繫有覆無記心，定不成就無色界繫無覆無記心，若無學心。",
        "translation": "If someone has accomplished a mind that's bound to the form realm and unobstructed indeterminate mental states, they definitely won't accomplish a mind that's bound to the formless realm and unobstructed indeterminate mental states, or if they don't have a learned mind.",
        "source": "T26n1539_013:0597b28_2"
    },
    {
        "source_sentence": "若成就無色界繫無覆無記心，若無學心，定不成就色界繫有覆無記心。",
        "translation": "If someone has accomplished the mind bound to the formless realm that's unobstructed and indeterminate, and if they don't have a post-learning mind, they certainly won't accomplish the mind bound to the form realm that's covered and indeterminate.",
        "source": "T26n1539_013:0597b29_3"
    },
    {
        "source_sentence": "若成就色界繫有覆無記心，亦成就學心耶？",
        "translation": "If someone has accomplished the mind bound to the form realm that's covered and indeterminate, will they also accomplish the mind of training?",
        "source": "T26n1539_013:0597c02_4"
    },
    {
        "source_sentence": "或成就色界繫有覆無記心非學心，廣說四句。",
        "translation": "Or, it may be accompanied by a mind bound to the realm of form that is defiled or indeterminate and not a mind acquired through learning. Four sentences are spoken of elaborately:",
        "source": "T26n1539_013:0597c03_5"
    },
    {
        "source_sentence": "成就色界繫有覆無記心非學心者，謂諸異生未離色界貪。",
        "translation": "Accomplishment of defiled-neutral awarenesses bound to the realm of form that are accompanied by fetters, and no awareness of the seeker: ordinary beings who have not abandoned craving of the realm of form yet.",
        "source": "T26n1539_013:0597c04_6"
    },
    {
        "source_sentence": "成就學心非色界繫有覆無記心者，謂諸有學已離色界貪。",
        "translation": "Accomplishment of the awarenesses of the seeker and not of the one bound to the realm of form with a covered awareness that is indeterminate: learned ones who have already become free from craving of the realm of form.",
        "source": "T26n1539_013:0597c05_7"
    },
    {
        "source_sentence": "成就色界繫有覆無記心亦學心者，謂諸有學未離色界貪。",
        "translation": "Accomplishment of defiled-neutral awarenesses bound to the realm of form that are also awarenesses of the seeker: learned ones who have not yet abandoned craving of the realm of form.",
        "source": "T26n1539_013:0597c07_8"
    },
    {
        "source_sentence": "非成就色界繫有覆無記心亦非學心者，謂阿羅漢，及諸異生已離色界貪。",
        "translation": "Someone who hasn't accomplished the mind that's bound to the form realm, which is covered and indeterminate, and isn't a learner's mind means arhats and ordinary people who have parted with craving in the form realm.",
        "source": "T26n1539_013:0597c08_9"
    },
    {
        "source_sentence": "若成就色界繫無覆無記心，亦成就無色界繫善心耶？",
        "translation": "If someone has accomplished the unobstructed and indeterminate mind bound to the form realm, will they also accomplish the good mind bound to the formless realm?",
        "source": "T26n1539_013:0597c10_10"
    },
    {
        "source_sentence": "或成就色界繫無覆無記心非無色界繫善心，廣說四句。",
        "translation": "Or they may achieve an unobstructed, indeterminate mind bound to the form realm that's not a good mind bound to the formless realm, which is explained in four broad terms.",
        "source": "T26n1539_013:0597c11_11"
    },
    {
        "source_sentence": "成就色界繫無覆無記心非無色界繫善心者，謂欲界生長已離欲界貪未得無色界善心，",
        "translation": "Accomplishment of unobstructed-neutral awarenesses bound to the realm of form and not of good awarenesses bound to the realm of formlessness: when arising in the realm of sexual passion, free from craving of the realm of sexual passion but not having acquired a good awareness of the realm of formlessness.",
        "source": "T26n1539_013:0597c13_12"
    },
    {
        "source_sentence": "及色界生長未得無色界善心補特伽羅。",
        "translation": "and the mind that grows in the form realm but doesn't attain good mental states in the formless realm.",
        "source": "T26n1539_013:0597c15_13"
    },
    {
        "source_sentence": "成就無色界繫善心非色界繫無覆無記心者，謂無色界生長補特伽羅。",
        "translation": "Accomplishment of the good awarenesses fettered in the realm of formlessness, not fettered in the realm of form, and of the unobscured-neutral awarenesses:",
        "source": "T26n1539_013:0597c16_14"
    },
    {
        "source_sentence": "成就色界繫無覆無記心亦無色界繫善心者，謂欲界色界生長已得無色界善心補特伽羅。",
        "translation": "Accomplishment of the good awarenesses bound to the realm of form that are unobscured-neutral awarenesses and also bound to the realm of formlessness:",
        "source": "T26n1539_013:0597c17_15"
    },
    {
        "source_sentence": "非成就色界繫無覆無記心亦非無色界繫善心者，謂欲界生長未離欲界貪補特伽羅。",
        "translation": "He who hasn't accomplished the good mind bound to the form realm that's unobstructed and indeterminate, and isn't bound to the formless realm means that he grows up in the desire realm but doesn't part with the desire realm's craving for the pudgala.",
        "source": "T26n1539_013:0597c20_16"
    },
    {
        "source_sentence": "若成就色界繫無覆無記心，亦成就無色界繫有覆無記心耶？",
        "translation": "If someone has accomplished the unobstructed and indeterminate mind bound to the form realm, will they also accomplish the unobstructed and indeterminate mind bound to the formless realm?",
        "source": "T26n1539_013:0597c22_17"
    },
    {
        "source_sentence": "或成就色界繫無覆無記心非無色界繫有覆無記心，廣說四句。",
        "translation": "Or they may achieve an undefiled indeterminate mental state bound to the form realm that's not a defiled mental state bound to the formless realm, which is explained in four broad sentences.",
        "source": "T26n1539_013:0597c23_18"
    },
    {
        "source_sentence": "成就色界繫無覆無記心非無色界繫有覆無記心者，謂欲界色界生長諸阿羅漢。",
        "translation": "Accomplishment of the non-obscured-neutral awarenesses bound to the realm of form that are free from fetters, and no obstructed-neutral awarenesses bound to the realm of form that are not free from fetters in the realm of formlessness refers to arhats who arise in the form realm of sexual passion and the form realm.",
        "source": "T26n1539_013:0597c24_19"
    },
    {
        "source_sentence": "成就無色界繫有覆無記心非色界繫無覆無記心者，謂欲界生長未離欲界貪，",
        "translation": "Accomplishment of defiled-neutral awarenesses bound to the realm of formlessness that are not fettered in the realm of form: when arising in the realm of sexual passion but not yet free from attachment in the realm of sexual passion.",
        "source": "T26n1539_013:0597c26_20"
    },
    {
        "source_sentence": "及無色界生長有學異生。",
        "translation": "and the formless realm that grows, there are trainees and non-Buddhists.",
        "source": "T26n1539_013:0597c28_21"
    },
    {
        "source_sentence": "成就色界繫無覆無記心亦無色界繫有覆無記心者，謂欲界生長有學異生已離欲界貪，",
        "translation": "Accomplishment of the non-obscured-neutral awarenesses bound to the realm of form that are free from fetters, and also the non-obscured-neutral awarenesses bound to the realm of form that are free from fetters”:",
        "source": "T26n1539_013:0597c29_22"
    },
    {
        "source_sentence": "及色界生長有學異生。",
        "translation": "and the form realm that grows, there are trainees and unenlightened sentient beings.",
        "source": "T26n1539_013:0598a02_23"
    },
    {
        "source_sentence": "非成就色界繫無覆無記心亦非無色界繫有覆無記心者，謂無色界生長諸阿羅漢。",
        "translation": "It's not the accomplishment of an unobstructed indeterminate mind bound to the form realm that's neither fettered nor fettered in the formless realm, which means arhats growing up in the formless realm.",
        "source": "T26n1539_013:0598a02_24"
    },
    {
        "source_sentence": "若成就色界繫無覆無記心，定不成就無色界繫無覆無記心。",
        "translation": "If someone has accomplished an unobstructed indeterminate mind bound to the form realm, they definitely won't accomplish an unobstructed indeterminate mind bound to the formless realm.",
        "source": "T26n1539_013:0598a04_25"
    },
    {
        "source_sentence": "若成就無色界繫無覆無記心，定不成就色界繫無覆無記心。",
        "translation": "If someone has accomplished an unobstructed indeterminate mind bound to the formless realm, they definitely won't accomplish an unobstructed indeterminate mind bound to the form realm.",
        "source": "T26n1539_013:0598a06_26"
    },
    {
        "source_sentence": "若成就色界繫無覆無記心，亦成就學心耶？",
        "translation": "If someone has accomplished the unobstructed, indeterminate mind bound to the form realm, will they also accomplish the mind of training?",
        "source": "T26n1539_013:0598a07_27"
    },
    {
        "source_sentence": "或成就色界繫無覆無記心非學心，廣說四句。",
        "translation": "Or they may achieve an unobstructed, indeterminate mind bound to the form realm that's not a learned mind, and explain four extensively in four sentences.",
        "source": "T26n1539_013:0598a08_28"
    },
    {
        "source_sentence": "成就色界繫無覆無記心非學心者，謂欲界生長諸阿羅漢，及諸異生已離欲界貪，",
        "translation": "Accomplishment of the unobstructed-neutral awarenesses bound to the realm of form that are accompanied by beings without learning: arhats growing up in the realm of sexual passion and worldlings who have already abandoned craving of the realm of sexual passion.",
        "source": "T26n1539_013:0598a09_29"
    },
    {
        "source_sentence": "若色界生長諸阿羅漢及諸異生。",
        "translation": "If arhats and non-Buddhists grow in the form realm, then they'll be born in the form realm.",
        "source": "T26n1539_013:0598a11_30"
    },
    {
        "source_sentence": "成就學心非色界繫無覆無記心者，謂欲界生長有學未離欲界貪，及無色界生長有學補特伽羅。",
        "translation": "Accomplishment of the awarenesses of the seeker and of the one not bound to the realm of form is unobscured-neutral awarenesses”: when arising in the realm of sexual passion, there are still having learning to do but not yet free from craving of the realm of sexual passion.",
        "source": "T26n1539_013:0598a12_31"
    },
    {
        "source_sentence": "成就色界繫無覆無記心亦學心者，謂欲界生長有學已離欲界貪，及色界生長有學補特伽羅。",
        "translation": "Accomplishment of the mind bound to the realm of form that is unobscured and indeterminate, and also the awareness of the seeker: when arising in the realm of sexual passion, there are those who have already acquired it. Being free from covetousness of the realm of sexual passion*”°; and when arising in the realm of form, there",
        "source": "T26n1539_013:0598a14_32"
    },
    {
        "source_sentence": "非成就欲界繫無覆無記心亦非學心者，謂欲界生長異生未離欲界貪，及無色界生長諸阿羅漢及諸異生。",
        "translation": "Those who don't attain the unobstructed, indeterminate mind bound to the desire realm and aren't training are called arhats and ordinary people who grow up in the desire realm but haven't yet parted with desire for the desire realm, and arhats and ordinary people who grow up in the formless realm.",
        "source": "T26n1539_013:0598a17_0"
    },
    {
        "source_sentence": "若成就色界繫無覆無記心，亦成就無學心耶？",
        "translation": "If someone has accomplished an unobstructed, indeterminate mind bound to the form realm, will they also accomplish an unlearned mind?",
        "source": "T26n1539_013:0598a19_1"
    },
    {
        "source_sentence": "或成就色界繫無覆無記心非無學心，廣說四句。",
        "translation": "Or they may achieve an unobstructed, indeterminate mind bound to the form realm that's not a post-learning mind. Four sentences are explained in detail in four ways.",
        "source": "T26n1539_013:0598a20_2"
    },
    {
        "source_sentence": "成就色界繫無覆無記心非無學心者，謂欲界生長有學異生已離欲界貪，",
        "translation": "Accomplishment of the unobstructed-neutral awarenesses bound to the realm of form that are not accompanied by awarenesses of post learners means that when arising in the realm of sexual passion, there is already being free from craving of the realm of sexual passion.",
        "source": "T26n1539_013:0598a21_3"
    },
    {
        "source_sentence": "及色界生長有學異生。",
        "translation": "and the form realm that grows, there are trainees and unenlightened sentient beings.",
        "source": "T26n1539_013:0598a23_4"
    },
    {
        "source_sentence": "成就無學心非色界繫無覆無記心者，謂無色界生長諸阿羅漢。",
        "translation": "Accomplishment of the state of having no more learning to do and not a state bound to the realm of form that is unobscured-neutral awarenesses”: arhats growing up in the realm of formlessness.",
        "source": "T26n1539_013:0598a24_5"
    },
    {
        "source_sentence": "成就色界繫無覆無記心亦無學心者，謂欲界色界生長諸阿羅漢。",
        "translation": "Accomplishment of unobstructed-neutral awarenesses bound to the realm of form and also of awarenesses having no more learning to do: arhats who arise in the realm of sexual passion and in the one of form.",
        "source": "T26n1539_013:0598a25_6"
    },
    {
        "source_sentence": "非成就色界繫無覆無記心亦非無學心者，謂欲界生長未離欲界貪，及無色界生長有學異生。",
        "translation": "Those who haven't accomplished an unobstructed, indeterminate mind tethered to the form realm and a mind that's not post-learning are those who grow up in the desire realm but aren't free of craving in the desire realm and those who grow up in the formless realm as trainees and worldlings.",
        "source": "T26n1539_013:0598a27_7"
    },
    {
        "source_sentence": "說一切有部識身足論卷第十三",
        "translation": "Saṃyuktâgama-śāstra, vol. 13",
        "source": "T26n1539_013:0598b01_0"
    }
]