[
    {
        "source_sentence": "阿毘達磨品類足論卷第十八",
        "translation": "Abhidharma-mahāprajñāpāramitā-śāstra, vol. 18",
        "source": "T26n1542_018:0766a02_0"
    },
    {
        "source_sentence": "尊者世友造",
        "translation": "created by the venerable secular friend",
        "source": "T26n1542_018:0766a04_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T26n1542_018:0766a05_0"
    },
    {
        "source_sentence": "辨決擇品第八",
        "translation": "The Eighth Chapter of the Explanation and Determination",
        "source": "T26n1542_018:0766a06_0"
    },
    {
        "source_sentence": "有色法，十一界十一處一蘊攝，八智知除他心滅智，六識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "The dharmas with form are subsumed in eleven realms and eleven places, one aggregate of eight knowledges that know the cessation of mind except for other minds, six consciousnesses, pervasively active in the desire realm and following dormancy that's cultivated and eliminated in the form realm.",
        "source": "T26n1542_018:0766a07_0"
    },
    {
        "source_sentence": "唯有色法，十界十處一蘊攝，非智知，五識識，非隨眠隨增。",
        "translation": "Only form dharmas are included in the ten realms, ten locations, and one aggregate, which are not known by cognition, and the five consciousnesses are not accompanied by dormancy or increase.",
        "source": "T26n1542_018:0766a09_1"
    },
    {
        "source_sentence": "無色法，八界二處四蘊攝，十智知，一識識，一切隨眠隨增。",
        "translation": "The formless dharmas are subsumed in the eight realms, two places, four aggregates, ten cognitions, and one consciousness, all of which follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0766a10_2"
    },
    {
        "source_sentence": "唯無色法，七界一處四蘊攝，二智知謂他心滅智，非識識，無色界一切，",
        "translation": "The dharmas in Ārūpyadhātu are the only ones that are subsumed by the four aggregates at one and the same place among the seven dhātus. The two knowledges of cessation refer to the knowledge of the mind of another; they are not the consciousnesses of consciousness.",
        "source": "T26n1542_018:0766a11_3"
    },
    {
        "source_sentence": "欲色界二部，及見苦集所斷非遍行隨眠隨增。",
        "translation": "The two parts of Kāmadhātu and Rūpadhātu are abandoned by insight into unsatisfactoriness, but not by insight into unsatisfactoriness.",
        "source": "T26n1542_018:0766a13_4"
    },
    {
        "source_sentence": "有見法，一界一處一蘊攝，七智知除他心滅道智，二識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "There are views of dharmas that are subsumed in one realm, one place, and one aggregate, seven kinds of cognition that know the path to cessation of mind except for other minds, two kinds of consciousness, pervasive activity in the desire realm and form, and latent tendencies and subsequent dormancy that are eliminated by cultivation.",
        "source": "T26n1542_018:0766a14_5"
    },
    {
        "source_sentence": "唯有見法，一界一處非蘊攝，非智知，一識識，非隨眠隨增。",
        "translation": "There is only the doctrine of insight. One realm and one location are not included in the aggregates, they are not known by knowledge or cognition, there is one consciousness and one consciousness, which does not follow dormancy and increase [by itself].",
        "source": "T26n1542_018:0766a16_6"
    },
    {
        "source_sentence": "無見法，十七界十一處五蘊攝，十智知，五識識，一切隨眠隨增。",
        "translation": "There are no views of dharmas that are included in the five aggregates of the seventeen realms and eleven locations, which are known by the ten kinds of cognition and the five consciousnesses, and all follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0766a17_7"
    },
    {
        "source_sentence": "唯無見法，十七界十一處四蘊攝，三智知謂他心滅道智，四識識，無色界一切欲界二部，",
        "translation": "Only the doctrine of non-vision is included in the four aggregates of seventeen dhātus and eleven āyatanas. The three knowledges are the knowledge of the cessation of thought by others, the knowledge of the path [leading to its cessation], the four consciousnesses, and all the two parts of consciousness in the realm of formlessness",
        "source": "T26n1542_018:0766a19_8"
    },
    {
        "source_sentence": "及見苦集所斷非遍行隨眠隨增。",
        "translation": "It's also the view that what's stopped by suffering and accumulation is not pervasive, which follows dormancy and increases.",
        "source": "T26n1542_018:0766a21_9"
    },
    {
        "source_sentence": "有對法，十界十處一蘊攝，七智知除他心滅道智，六識識，欲色界遍行，",
        "translation": "There is an opposing doctrine that the ten realms and ten locations are subsumed in one aggregate. The seven knowledges know the path of cessation with the exception of the awareness of another; the six consciousnesses:",
        "source": "T26n1542_018:0766a22_10"
    },
    {
        "source_sentence": "及修所斷隨眠隨增。",
        "translation": "It's also the latent tendencies that are cultivated and the latent tendencies that are eliminated.",
        "source": "T26n1542_018:0766a23_11"
    },
    {
        "source_sentence": "唯有對法，十界十處非蘊攝，非智知，五識識，非隨眠隨增。",
        "translation": "Only the opposing dharmas are included in the ten realms and ten locations that aren't included in the aggregates, which aren't known by cognition, and the five consciousnesses don't follow dormancy and increase.",
        "source": "T26n1542_018:0766a24_12"
    },
    {
        "source_sentence": "無對法，八界二處五蘊攝，十智知，一識識，一切隨眠隨增。",
        "translation": "The dharmas that are non-resistant are the eight realms, two places, five aggregates, ten cognitions, and one consciousness, all of which are accompanied by dormancy and increase.",
        "source": "T26n1542_018:0766a25_13"
    },
    {
        "source_sentence": "唯無對法，八界二處四蘊攝，三智知謂他心滅道智，非識識，無色界一切欲界色界二部，",
        "translation": "Only the dharmas that are exclusively non-arrogant are included in the four aggregates of the eight realms and two locations. The knowledge of the mind of another is the knowledge of the path leading to the cessation of thought, not the one of consciousness.",
        "source": "T26n1542_018:0766a26_14"
    },
    {
        "source_sentence": "及見苦集所斷非遍行隨眠隨增。",
        "translation": "It's also the view that what's stopped by suffering and accumulation is not pervasive, which follows dormancy and increases.",
        "source": "T26n1542_018:0766a28_15"
    },
    {
        "source_sentence": "有漏法，十八界十二處五蘊攝，八智知除滅道智，六識識，一切隨眠隨增。",
        "translation": "Contaminated dharmas are included in the five aggregates of the eighteen realms and twelve locations, the eight kinds of cognition that remove cessation and knowledge of the path, and the six consciousnesses, which all follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0766a29_16"
    },
    {
        "source_sentence": "唯有漏法，十五界十處非蘊攝，二智知謂苦集智，五識識，一切隨眠隨增。",
        "translation": "Only the impure dharmas are included in the five consciousnesses. The fifteen dhātus and ten āyatanas do not belong to the aggregate. Two knowledges, namely Knowledge of Suffering and Knowledge of Origin, together with five other knowledges, all aṟe accompanied by dormancy and increase.",
        "source": "T26n1542_018:0766b02_17"
    },
    {
        "source_sentence": "無漏法，三界二處五蘊攝，八智知除苦集智，一識識，非隨眠隨增。",
        "translation": "Uncontaminated dharmas are included in the three realms, two places, and five aggregates, eight kinds of cognition that remove suffering and accumulate cognition, and one kind of consciousness that doesn't follow dormancy and increase.",
        "source": "T26n1542_018:0766b03_18"
    },
    {
        "source_sentence": "唯無漏法，非界非處非蘊攝，二智知謂滅道智，非識識，非隨眠隨增。",
        "translation": "They are only pure dharmas that are not included in realms, locations, or aggregates. The knowledge of cessation and the knowledge of the path are two kinds of knowledge; they are neither consciousness nor accompanied by dormancy nor followed by increase.",
        "source": "T26n1542_018:0766b05_19"
    },
    {
        "source_sentence": "有為法，十八界十二處五蘊攝，九智知除滅智，六識識，一切隨眠隨增。",
        "translation": "Conditioned dharmas are included in the five aggregates of the eighteen realms and twelve locations, nine knowledges that remove cessation cognition, and six consciousnesses that all follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0766b06_20"
    },
    {
        "source_sentence": "唯有為法，十七界十一處五蘊攝，四智知謂他心苦集道智，五識識，一切隨眠隨增。",
        "translation": "Only conditioned dharmas are included in the five aggregates of seventeen dhātus and eleven āyatanas. The four knowledges consist of the knowledge of the mind of another as suffering, the knowledge of the origin of suffering, and the knowledge of the path. The five consciousnesses all follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0766b08_21"
    },
    {
        "source_sentence": "無為法，一界一處非蘊攝，六智知除他心苦集道智，一識識，非隨眠隨增。",
        "translation": "The unconditioned dharmas are one realm and one location that aren't included in the aggregates, six kinds of cognition that know the mind except for suffering, accumulation, and path cognition, and one consciousness that doesn't follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0766b10_22"
    },
    {
        "source_sentence": "唯無為法，非界非處非蘊攝，一智知謂滅智，非識識，非隨眠隨增。",
        "translation": "Only the unconditioned dharmas are included in neither realms, nor locations, nor aggregates. The one knowledge of cessation refers to the knowledge of cessation; it is no consciousness or consciousness, and it does not follow dormancy or increase with dormancy.",
        "source": "T26n1542_018:0766b12_23"
    },
    {
        "source_sentence": "有諍無諍法、世間出世間法、墮界非墮界法、有味著無味著法、耽嗜依出離依法、順結非順結法、順取非順取法、順纏非順纏法，",
        "translation": "dharmas that are debilitating and non-debilitating, worldly and transmundane dharmas, dharmas that fall into realms and not into realms, dharmas that have flavors and no flavors, craving, relying on the Dharma to escape, dharmas that follow fetters and not following fetters, dharmas that follow grasping and not following",
        "source": "T26n1542_018:0766b13_24"
    },
    {
        "source_sentence": "如有漏無漏法應知。",
        "translation": "If there are contaminated and uncontaminated dharmas, they should be known.",
        "source": "T26n1542_018:0766b16_25"
    },
    {
        "source_sentence": "有記法，十界四處五蘊攝，十智知，三識識，欲界一切，色無色界遍行，",
        "translation": "Indeterminate dharmas, which are subsumed in the ten realms, four locations, and five aggregates, are known by the ten knowledges, three consciousnesses, all of the desire realm, form, and formless realms as pervasive.",
        "source": "T26n1542_018:0766b17_0"
    },
    {
        "source_sentence": "及修所斷隨眠隨增。",
        "translation": "It's also the latent tendencies that are cultivated and the latent tendencies that are eliminated.",
        "source": "T26n1542_018:0766b18_1"
    },
    {
        "source_sentence": "唯有記法，非界非處非蘊攝，二智知謂滅道智，非識識，欲界二部及見集所斷非遍行隨眠隨增。",
        "translation": "Only indeterminate dharmas are included, which are neither realms, nor locations, nor aggregates. Two knowledges of cognition are cessation and path knowledge, not consciousness; the two parts of the realm of sexual passion and the one to be abandoned through insight and through the one of the origin are not pervasive proclivities and dormancies that follow and increase",
        "source": "T26n1542_018:0766b19_0"
    },
    {
        "source_sentence": "無記法，十八界十二處五蘊攝，八智知除滅道智，六識識，色無色界一切，",
        "translation": "Indeterminate dharmas are the five aggregates of the eighteen realms and twelve locations, the eight kinds of cognition that remove knowledge of cessation and knowledge of the path, the six consciousnesses, and all in the form and formless realms.",
        "source": "T26n1542_018:0766b21_1"
    },
    {
        "source_sentence": "欲界二部及見集所斷遍行隨眠隨增。",
        "translation": "The two parts of the desire realm and the pervasive tendencies that are stopped by seeing and accumulating follow dormancy and increase.",
        "source": "T26n1542_018:0766b22_2"
    },
    {
        "source_sentence": "唯無記法，八界八處非蘊攝，非智知，三識識，色無色界二部，及見苦集所斷非遍行隨眠隨增。",
        "translation": "Only indeterminate dharmas, the eight realms and eight locations that aren't included in the aggregates, are not known by cognition, the three consciousnesses, the two parts of the form and formless realms, and the pervasive latencies and latencies that are not eliminated by seeing suffering and accumulation.",
        "source": "T26n1542_018:0766b23_3"
    },
    {
        "source_sentence": "有覆法，十界四處五蘊攝，八智知除滅道智，三識識，一切隨眠隨增。",
        "translation": "Defiled dharmas are subsumed in the five aggregates of the ten realms and four locations, the eight kinds of cognition that remove cessation and path cognition, and the three kinds of consciousness that all follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0766b25_4"
    },
    {
        "source_sentence": "唯有覆法，非界非處非蘊攝，非智知，非識識，三界二部及見苦集所斷非遍行隨眠隨增。",
        "translation": "Only the dharmas that are obscured are not realms, not locations, not included in aggregates, not known by cognition, not consciousness, and not pervasive latencies or latencies that are eliminated by the three realms, two parts, and views of suffering and accumulation.",
        "source": "T26n1542_018:0766b27_5"
    },
    {
        "source_sentence": "無覆法，十八界十二處五蘊攝，十智知，六識識，三界遍行及修所斷隨眠隨增。",
        "translation": "The dharmas that are unobstructed are the five aggregates of the eighteen realms and twelve locations, the ten kinds of cognition, the six consciousnesses, the pervasive activity of the three realms, and the latencies that are eliminated by cultivation.",
        "source": "T26n1542_018:0766b29_6"
    },
    {
        "source_sentence": "唯無覆法，八界八處非蘊攝，二智知謂滅道智，三識識，非隨眠隨增。",
        "translation": "Only the unobscured dharmas are included in the eight realms and eight locations that aren't included in the aggregates, which are known by two kinds of cognition called cessation and path cognition, and by three kinds of consciousness, not by dormancy or increase.",
        "source": "T26n1542_018:0766c02_7"
    },
    {
        "source_sentence": "應修法，十界四處五蘊攝，九智知除滅智，三識識，三界遍行及修所斷隨眠隨增。",
        "translation": "You should cultivate the teaching that the ten realms, four places, and five aggregates are included in nine kinds of cognition except cessation cognition, three kinds of consciousness, pervasive activity in the three realms, and latencies that are eliminated by cultivation increase accordingly.",
        "source": "T26n1542_018:0766c03_8"
    },
    {
        "source_sentence": "唯應修法，非界非處非蘊攝，一智知謂道智，非識識，非隨眠隨增。",
        "translation": "They should only cultivate dharmas that aren't included in realms, locations, or aggregates, and one knowledge of cognition refers to the knowledge of the path, not consciousness, and not latent and increasing accordingly.",
        "source": "T26n1542_018:0766c05_9"
    },
    {
        "source_sentence": "不應修法，十八界十二處五蘊攝，九智知除道智，六識識，一切隨眠隨增。",
        "translation": "You shouldn't cultivate the Dharma, which is included in the five aggregates of the 18 realms and 12 places, nine cognitions that remove knowledge of the path, and six consciousnesses that all follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0766c07_0"
    },
    {
        "source_sentence": "唯不應修法，八界八處非蘊攝，一智知謂滅智，三識識，三界二部及見苦集所斷非遍行隨眠隨增。",
        "translation": "Only the dharmas that should not be cultivated are included in the eight realms and eight locations that aren't included in the aggregates, which are called cessation cognition with one knowledge, three consciousnesses, three realms, two divisions, and seeing what's stopped by suffering and accumulation as neither pervasive latencies nor increasing latencies.",
        "source": "T26n1542_018:0766c08_1"
    },
    {
        "source_sentence": "染污法，十界四處五蘊攝，八智知除滅道智，三識識，一切隨眠隨增。",
        "translation": "Defiled dharmas are subsumed in the five aggregates of the ten realms, four places, eight kinds of cognition that remove cessation and path cognition, and three kinds of consciousness that all follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0766c10_2"
    },
    {
        "source_sentence": "唯染污法，非界非處非蘊攝，非智知，非識識，三界二部及見苦集所斷非遍行隨眠隨增。",
        "translation": "They are only defiled dharmas, not realms, not locations, not included in aggregates, not cognition and knowledge, not consciousness, not the three realms, two parts, and views that are stopped by suffering and accumulation, not pervasive tendencies, latencies, and subsequent increases.",
        "source": "T26n1542_018:0766c12_3"
    },
    {
        "source_sentence": "不染污法，十八界十二處五蘊攝，十智知，六識識，三界遍行及修所斷隨眠隨增。",
        "translation": "The undefiled dharmas are subsumed in the five aggregates of the eighteen realms and twelve locations, which are known by the ten kinds of cognition, the six consciousnesses, the pervasive activity of the three realms, and the latencies that are eliminated by cultivation.",
        "source": "T26n1542_018:0766c14_4"
    },
    {
        "source_sentence": "唯不染污法，八界八處非蘊攝，二智知謂滅道智，三識識，非隨眠隨增。",
        "translation": "Only the undefiled dharmas are included in the eight realms and eight āyatanas, but not in the aggregates. The two knowledges of cessation and path refer to the knowledge of cessation and the three consciousnesses; they do not arise subsequently or simultaneously with dormancy.",
        "source": "T26n1542_018:0766c16_5"
    },
    {
        "source_sentence": "有罪無罪法亦爾。",
        "translation": "So it is with sins and sinless dharmas.",
        "source": "T26n1542_018:0766c17_6"
    },
    {
        "source_sentence": "有異熟法，十界四處五蘊攝，八智知除滅道智，三識識，欲界一切，色無色界遍行，",
        "translation": "There are dharmas as retribution, which are subsumed in the ten realms, four places, and five aggregates. The eight knowledges know extinguishing cessation and knowledge of the path; the three forms of consciousness all exist in the realm of sexual passion; they abide everywhere in the realm of form and in the one of formlessness.",
        "source": "T26n1542_018:0766c18_7"
    },
    {
        "source_sentence": "及修所斷隨眠隨增。",
        "translation": "It's also the latent tendencies that are cultivated and the latent tendencies that are eliminated.",
        "source": "T26n1542_018:0766c20_8"
    },
    {
        "source_sentence": "唯有異熟法，非界非處非蘊攝，非智知，非識識，欲界二部及見集所斷非遍行隨眠隨增。",
        "translation": "Only the dharmas of retribution are included, not realms, not places, not aggregates, not cognition and knowledge, not consciousness, not the two parts of the desire realm, not pervasive latencies that are eliminated by seeing and accumulating, and not latencies that follow and increase.",
        "source": "T26n1542_018:0766c20_9"
    },
    {
        "source_sentence": "無異熟法，十八界十二處五蘊攝，十智知，六識識，色無色界一切，欲界二部，",
        "translation": "The dharmas that are without retribution are the five aggregates of the eighteen realms and twelve locations, the knowledge of the ten knowledges, the six consciousnesses, all in the form and formless realms, the two parts of the realm of sexual passion.",
        "source": "T26n1542_018:0766c22_10"
    },
    {
        "source_sentence": "及見集所斷遍行隨眠隨增。",
        "translation": "and the pervasive tendencies that are stopped by seeing what's accumulated and followed by dormancy and subsequent increase.",
        "source": "T26n1542_018:0766c24_11"
    },
    {
        "source_sentence": "唯無異熟法，八界八處非蘊攝，二智知謂滅道智，三識識，色無色界二部及見苦集所斷非遍行隨眠隨增。",
        "translation": "Only the dharmas of retribution are absent, and the eight realms and eight locations aren't included in the aggregates. The two kinds of cognition are cessation and path cognition, the three kinds of consciousness, the form and formless realms, the two divisions, and the pervasive latencies that are not eliminated by seeing what's painful",
        "source": "T26n1542_018:0766c24_12"
    },
    {
        "source_sentence": "見法，二界二處二蘊攝，九智知除滅智，一識識，三界有漏緣及見相應無漏緣無明隨眠隨增。",
        "translation": "Seeing dharmas, the two realms, two locations, and two aggregates are included in nine kinds of cognition except cessation cognition, one form of consciousness, three realms that have contaminated conditions and uncontaminated conditions associated with views, ignorance, latencies, and increases.",
        "source": "T26n1542_018:0766c27_13"
    },
    {
        "source_sentence": "唯見法，一界一處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "They only see dharmas, which are not included in one realm or one place as aggregates, not known by cognition, not consciousness, and not accompanied by dormancy or increase.",
        "source": "T26n1542_018:0766c29_14"
    },
    {
        "source_sentence": "非見法，十七界十一處五蘊攝，十智知，六識識，一切隨眠隨增。",
        "translation": "It's not the teaching of seeing, which is included in the five aggregates of the seventeen realms and eleven places, the ten kinds of cognition, the six consciousnesses, and all the latent tendencies that follow and increase.",
        "source": "T26n1542_018:0767a01_15"
    },
    {
        "source_sentence": "唯非見法，十六界十處三蘊攝，一智知謂滅智，五識識，除見相應無漏緣無明，",
        "translation": "Only the dharmas that are not views are included in the three aggregates of sixteen dhātus and ten āyatanas. The one knowledge of cessation is the knowledge of cessation; the five consciousnesses, with the exception of ignorance associated with views as an uncontaminated supporting object:",
        "source": "T26n1542_018:0767a03_16"
    },
    {
        "source_sentence": "諸餘無漏緣隨眠隨增。",
        "translation": "The other uncontaminated conditions follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0767a04_17"
    },
    {
        "source_sentence": "內法，十二界六處二蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "In internal dharmas, the twelve realms and six places are subsumed in two aggregates, nine cognitions know cessation of cognition, and one consciousness all follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0767a05_18"
    },
    {
        "source_sentence": "唯內法，十二界六處一蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only internal dharmas are included in twelve realms, six places, and one aggregate, which are not known by cognition, not by consciousness, and not accompanied by dormancy or increase.",
        "source": "T26n1542_018:0767a06_19"
    },
    {
        "source_sentence": "外法，六界六處四蘊攝，十智知，六識識，一切隨眠隨增。",
        "translation": "In external dharmas, the six realms and six locations are included in the four aggregates, which are known by the ten kinds of cognition and the six consciousnesses, all of which follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0767a08_20"
    },
    {
        "source_sentence": "唯外法，六界六處三蘊攝，一智知謂滅智，五識識，非隨眠隨增。",
        "translation": "Only external dharmas are included in the three aggregates of the six realms and six locations. The one knowledge of cessation is the knowledge of cessation, and the five consciousnesses are not accompanied by dormancy or by increase.",
        "source": "T26n1542_018:0767a09_21"
    },
    {
        "source_sentence": "有執受法，九界九處一蘊攝，七智知除他心滅道智，五識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "There are those who hold to the doctrine that the nine realms and nine locations are subsumed in one aggregate, seven kinds of cognition that knows the path to the cessation of mind except for other minds, five kinds of consciousness, pervasive activity in the form realm of desire and latent dormancy that follows and increases with what",
        "source": "T26n1542_018:0767a10_22"
    },
    {
        "source_sentence": "唯有執受法，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "They only cling to dharmas that aren't included in realms and places, aren't included in aggregates, aren't known by cognition, aren't conscious of consciousness, and don't follow dormancy and increase.",
        "source": "T26n1542_018:0767a12_23"
    },
    {
        "source_sentence": "無執受法，十八界十二處五蘊攝，十智知，六識識，一切隨眠隨增。",
        "translation": "There are no dharmas that are appropriated, which are included in the five aggregates of the 18 realms and 12 locations, known by the ten kinds of cognition, the six consciousnesses, and all the latent tendencies that follow and increase.",
        "source": "T26n1542_018:0767a14_24"
    },
    {
        "source_sentence": "唯無執受法，九界三處四蘊攝，三智知謂他心滅道智，一識識，無色界一切，",
        "translation": "Only the dharmas that do not assent are included in the nine realms, three places, and four aggregates. The knowledge of the mind of another is the knowledge of the path leading to the cessation of thought.",
        "source": "T26n1542_018:0767a15_25"
    },
    {
        "source_sentence": "欲色界二部，及見苦集所斷非遍行隨眠隨增。",
        "translation": "The two parts of Kāmadhātu and Rūpadhātu are abandoned by insight into unsatisfactoriness, but not by insight into unsatisfactoriness.",
        "source": "T26n1542_018:0767a17_26"
    },
    {
        "source_sentence": "心法，七界一處一蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "The mind and dharmas are subsumed in seven realms, one location, one aggregate, nine knowledges that remove cessation of cognition, and one consciousness, all which follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0767a18_27"
    },
    {
        "source_sentence": "唯心法，七界一處一蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only mind and dharmas are included in seven realms, one place, and one aggregate, which are not known by cognition, not by consciousness, and not accompanied by dormancy or increase.",
        "source": "T26n1542_018:0767a20_0"
    },
    {
        "source_sentence": "非心法，十一界十一處四蘊攝，十智知，六識識，一切隨眠隨增。",
        "translation": "It's not a mental dharma, which is included in the four aggregates of the 11 realms and 11 locations, the ten knowledges, the six consciousnesses, and all the latencies that follow and increase accordingly.",
        "source": "T26n1542_018:0767a21_1"
    },
    {
        "source_sentence": "唯非心法，十一界十一處四蘊攝，一智知謂滅智，五識識，非隨眠隨增。",
        "translation": "Only the four dharmas other than mind are included in eleven realms and eleven places. The one knowledge of cessation is the knowledge of cessation; the five consciousnesses are not accompanied by dormancy or by increase.",
        "source": "T26n1542_018:0767a22_2"
    },
    {
        "source_sentence": "有所緣法，八界二處四蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "Conditioned dharmas are included in the eight realms, two places, and four aggregates, nine cognitions that remove cessation of cognition, and one consciousness that increases with all its latencies.",
        "source": "T26n1542_018:0767a24_3"
    },
    {
        "source_sentence": "唯有所緣法，七界一處三蘊攝，一智知謂他心智，非識識，三界無漏緣隨眠隨增。",
        "translation": "Only the dharmas that are the perceptual objects are included in the seven realms and one location of the three aggregates. One knowledge is cognition of the minds of others, not consciousness; the three realms have uncontaminated perceptual objects that follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0767a25_4"
    },
    {
        "source_sentence": "無所緣法，十一界十一處二蘊攝，九智知除他心智，六識識，三界有漏緣隨眠隨增。",
        "translation": "The dharmas that have no perceptual objects are subsumed in the two aggregates of eleven realms and eleven locations, nine kinds of cognition that remove knowledge of other minds, six kinds of consciousness, and three realms with contaminated perceptual objects that follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0767a27_5"
    },
    {
        "source_sentence": "唯無所緣法，十界十處一蘊攝，一智知謂滅智，五識識，非隨眠隨增。",
        "translation": "Only the dharmas that have no perceptual objects are included in the ten realms and ten locations as one aggregate. One knowledge of cessation is called the knowledge of cessation. The five consciousnesses are not accompanied by dormancy or by increase.",
        "source": "T26n1542_018:0767a29_6"
    },
    {
        "source_sentence": "心所法，一界一處三蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "The dharmas of the mind are subsumed in one realm, one place, and three aggregates: nine knowledges that know extinction with the exception of cessation; one consciousness which knows all subsequent dormancy and increases accordingly.",
        "source": "T26n1542_018:0767b02_7"
    },
    {
        "source_sentence": "唯心所法，非界非處二蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only mental factors are included in the two aggregates of neither realm nor non-realm, which are not known by cognition, not by consciousness, and not accompanied by dormancy or increase.",
        "source": "T26n1542_018:0767b03_8"
    },
    {
        "source_sentence": "非心所法，十八界十二處三蘊攝，十智知，六識識，一切隨眠隨增。",
        "translation": "The dharmas that are not mental factors are included in the three aggregates of the eighteen realms and twelve locations, which are known by the ten knowledges and six consciousnesses, and all follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0767b04_9"
    },
    {
        "source_sentence": "唯非心所法，十七界十一處二蘊攝，一智知謂滅智，五識識，非隨眠隨增。",
        "translation": "Only the dharmas that are not mental factors are included in the two aggregates of the seventeen elements and eleven sense-fields. The one knowledge of cessation refers to the knowledge of cessation. The five forms of consciousness are not accompanied by dormancy or by increase.",
        "source": "T26n1542_018:0767b06_10"
    },
    {
        "source_sentence": "業法，三界三處二蘊攝，九智知除滅智，三識識，一切隨眠隨增。",
        "translation": "Karma and dharmas are included in the three realms, three places, and two aggregates, nine kinds of cognition that know extinction and remove it, and three kinds of consciousness that all follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0767b08_11"
    },
    {
        "source_sentence": "唯業法，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "They are only karmic dharmas that aren't included in realms, places, or aggregates, aren't known by cognition, aren't conscious of consciousness, and don't follow dormancy and increase.",
        "source": "T26n1542_018:0767b09_12"
    },
    {
        "source_sentence": "非業法，十八界十二處五蘊攝，十智知，六識識，一切隨眠隨增。",
        "translation": "They are not karmic dharmas that are included in the five aggregates of the 18 realms and 12 locations, which are known by the ten kinds of cognition and the six consciousnesses, and all follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0767b10_13"
    },
    {
        "source_sentence": "唯非業法，十五界九處三蘊攝，一智知謂滅智，三識識非隨眠隨增。",
        "translation": "Only non-karmic dharmas are included in the three aggregates of the fifteen realms and nine locations. The one knowledge of cessation refers to the knowledge of cessation. The three forms of consciousness are not accompanied by dormancy or by increase.",
        "source": "T26n1542_018:0767b12_14"
    },
    {
        "source_sentence": "善法，十界四處五蘊攝，十智知，三識識，三界遍行及修所斷隨眠隨增。",
        "translation": "Good dharmas are subsumed in the ten realms, four locations, five aggregates, ten cognitions, three consciousnesses, pervasive activity in the three realms, and latencies that are eliminated by cultivation that increase accordingly.",
        "source": "T26n1542_018:0767b13_15"
    },
    {
        "source_sentence": "唯善法，非界非處非蘊攝，二智知謂滅道智，非識識，非隨眠隨增。",
        "translation": "Only good dharmas are not included in realms, locations, or aggregates, and the two kinds of cognition are cessation and path cognition, not consciousness, and not latent and subsequently increasing.",
        "source": "T26n1542_018:0767b15_16"
    },
    {
        "source_sentence": "不善法，十界四處五蘊攝，七智知除類滅道智，三識識，欲界一切隨眠隨增。",
        "translation": "Bad dharmas are included in the ten realms, four locations, and five aggregates, seven kinds of cognition that knows extinction and path cognition, three kinds of consciousness, and all the latent tendencies and increases in the desire realm.",
        "source": "T26n1542_018:0767b16_17"
    },
    {
        "source_sentence": "唯不善法，非界非處非蘊攝，非智知，非識識，欲界二部及見集所斷非遍行隨眠隨增。",
        "translation": "Only unwholesome dharmas are not included in the realms, locations, or aggregates, not cognition and knowledge, not consciousness, and not pervasive latencies that are eliminated by the two parts of the desire realm and by seeing and accumulating.",
        "source": "T26n1542_018:0767b18_18"
    },
    {
        "source_sentence": "無記法，十八界十二處五蘊攝，八智知除滅道智，六識識，色無色界一切，",
        "translation": "Indeterminate dharmas are the five aggregates of the eighteen realms and twelve locations, the eight kinds of cognition that remove knowledge of cessation and knowledge of the path, the six consciousnesses, and all in the form and formless realms.",
        "source": "T26n1542_018:0767b20_19"
    },
    {
        "source_sentence": "欲界二部，及見集所斷遍行隨眠隨增。",
        "translation": "The two parts of the realm of sexual passion and the pervasive formations to be abandoned through the vision of the origin are with subsequent dormancy and successively increasing.",
        "source": "T26n1542_018:0767b22_20"
    },
    {
        "source_sentence": "唯無記法，八界八處非蘊攝，非智知，三識識，色無色界二部及見苦集所斷非遍行隨眠隨增。",
        "translation": "Only indeterminate dharmas, the eight realms and eight locations that aren't included in the aggregates, are not known by cognition, the three consciousnesses, the two parts of the form and formless realms, and the pervasive latencies and latencies that are not eliminated by seeing suffering and accumulation.",
        "source": "T26n1542_018:0767b23_0"
    },
    {
        "source_sentence": "見所斷法，三界二處四蘊攝，八智知除滅道智，一識識，見所斷一切隨眠隨增。",
        "translation": "The factors to be eliminated by insight are included in the three realms, two locations, and four aggregates, the eight kinds of cognition that remove cessation and knowledge of the path, and a single consciousness that increases with all the latencies that are eliminated by insight.",
        "source": "T26n1542_018:0767b25_1"
    },
    {
        "source_sentence": "唯見所斷法，非界非處非蘊攝，非智知，非識識，三界二部及見苦集所斷非遍行隨眠隨增。",
        "translation": "Only the factors to be eliminated by insight are not included in realms, locations, or aggregates; they are not known by cognition, not by consciousness, and not by consciousness. The three realms, two divisions, as well as the pervasive tendencies that are not eliminated by insight into unsatisfactoriness and its arising, are accompanied by",
        "source": "T26n1542_018:0767b26_2"
    },
    {
        "source_sentence": "修所斷法，十八界十二處五蘊攝，八智知除滅道智，六識識，三界遍行及修所斷隨眠隨增。",
        "translation": "The factors to be eliminated by cultivation are included in the five aggregates of the eighteen realms and twelve locations, the eight kinds of cognition that remove knowledge of cessation and knowledge of the path, the six forms of consciousness, the pervasive activity of the three realms, and the proclivities and latencies that are eliminated by cultivation that increase.",
        "source": "T26n1542_018:0767b28_3"
    },
    {
        "source_sentence": "唯修所斷法，十五界十處非蘊攝，非智知，五識識，修所斷一切隨眠隨增。",
        "translation": "Only the dharmas that are cultivated and eliminated by cultivation are included in the fifteen realms and ten locations that aren't included in the aggregates, which aren't known by cognition, and the five consciousnesses, which all follow dormancy and increase together with all the latencies that are eliminated by cultivation.",
        "source": "T26n1542_018:0767c02_0"
    },
    {
        "source_sentence": "非所斷法，三界二處五蘊攝，八智知除苦集智，一識識，非隨眠隨增。",
        "translation": "The dharmas that are not to be eliminated are included in the three realms, two places, and five aggregates, eight kinds of cognition that remove suffering and accumulate cognition, and one form of consciousness that doesn't follow dormancy and increase.",
        "source": "T26n1542_018:0767c03_1"
    },
    {
        "source_sentence": "唯非所斷法，非界非處非蘊攝，二智知謂滅道智，非識識，非隨眠隨增。",
        "translation": "They are only dharmas that are not to be eliminated, which are neither included in realms, locations, nor aggregates, and the two kinds of cognition are cessation and path cognition, not consciousness, and not latent and subsequently increasing.",
        "source": "T26n1542_018:0767c05_2"
    },
    {
        "source_sentence": "學法，三界二處五蘊攝，七智知除苦集滅智，一識識，非隨眠隨增。",
        "translation": "The method of training is that the three realms, two places, and five aggregates are included in seven kinds of cognition that know suffering, accumulation, cessation, and cognition, and a single consciousness that doesn't follow dormancy and increase.",
        "source": "T26n1542_018:0767c06_3"
    },
    {
        "source_sentence": "唯學法，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "They only study dharmas that aren't included in realms and places, aren't included in aggregates, aren't known by cognition, aren't conscious of consciousness, and aren't accompanied by dormancy and increase.",
        "source": "T26n1542_018:0767c08_4"
    },
    {
        "source_sentence": "無學法亦爾。",
        "translation": "So it is with the dharmas of post-learning.",
        "source": "T26n1542_018:0767c09_5"
    },
    {
        "source_sentence": "非學非無學法，十八界十二處五蘊攝，九智知除道智，六識識，一切隨眠隨增。",
        "translation": "The factors neither still having learning to do nor having no more learning to do are included in the five aggregates of the eighteen elements and twelve sense-fields: nine knowledges that know everything but the knowledge of the path; six forms of consciousness, all with subsequent dormancy and successively increasing.",
        "source": "T26n1542_018:0767c09_6"
    },
    {
        "source_sentence": "唯非學非無學法，十五界十處非蘊攝，三智知謂苦集滅智，五識識，一切隨眠隨增。",
        "translation": "Only the dharmas that are neither still having learning to do nor having no more learning to do, and the fifteen realms and ten places aren't included in the aggregates, the three kinds of cognition are suffering, arising, cessation, and cognition, and the five consciousnesses all follow and increase with latencies.",
        "source": "T26n1542_018:0767c11_7"
    },
    {
        "source_sentence": "欲界繫法，十八界十二處五蘊攝，七智知除類滅道智，六識識，欲界一切隨眠隨增。",
        "translation": "The factors bound to the realm of sexual passion are included in the five aggregates of eighteen realms and twelve places: seven knowledges that know, exception made for the knowledge of cessation of the path®*°; six forms of consciousness which all subsequently abide in the realm of sexual passion and increase successively.",
        "source": "T26n1542_018:0767c13_8"
    },
    {
        "source_sentence": "唯欲界繫法，四界二處非蘊攝，非智知，二識識，欲界一切隨眠隨增。",
        "translation": "Only the factors bound to the realm of sexual passion. The four realms and two residences are not included in the aggregates; they are not known by knowledge or cognition. These two forms of consciousness all follow dormancy and increase in the realm of sexual passion.",
        "source": "T26n1542_018:0767c15_9"
    },
    {
        "source_sentence": "色界繫法，十四界十處五蘊攝，七智知除法滅道智，四識識，色界一切隨眠隨增。",
        "translation": "The form realm is fettered by dharmas, which are subsumed in the five aggregates of the fourteen realms and ten locations, seven cognitions that know the path to cessation except for the cessation of dharmas, and four consciousnesses that all follow dormancy and increase in the form realm.",
        "source": "T26n1542_018:0767c16_10"
    },
    {
        "source_sentence": "唯色界繫法，非界非處非蘊攝，非智知，非識識，色界一切隨眠隨增。",
        "translation": "Only the form realm is fettered by dharmas, which aren't included in realms, locations, or aggregates, aren't known by cognition, aren't conscious of consciousness, and all the latent tendencies in the form realm increase accordingly.",
        "source": "T26n1542_018:0767c18_11"
    },
    {
        "source_sentence": "無色界繫法，三界二處四蘊攝，六智知除法他心滅道智，一識識，無色界一切隨眠隨增。",
        "translation": "The formless realm is fettered by dharmas, which are included in the three realms, two places, and four aggregates, six cognitions that know the path to cessation except for the mind of another who knows the Dharma, and one consciousness that follows and increases all the latencies in the formless realm.",
        "source": "T26n1542_018:0767c20_12"
    },
    {
        "source_sentence": "唯無色界繫法，非界非處非蘊攝，非智知，非識識，無色界一切隨眠隨增。",
        "translation": "Only the formless realm is fettered by dharmas, which aren't included in realms, places, or aggregates, aren't known by cognition, aren't conscious of consciousness, and all the latencies that follow and increase in the formless realm.",
        "source": "T26n1542_018:0767c22_13"
    },
    {
        "source_sentence": "不繫法，三界二處五蘊攝，八智知除苦集智，一識識，非隨眠隨增。",
        "translation": "The dharmas that aren't fetters are included in the three realms, two places, and five aggregates, eight kinds of cognition that remove suffering and accumulate cognition, and one kind of consciousness that doesn't follow dormancy and increase.",
        "source": "T26n1542_018:0767c23_14"
    },
    {
        "source_sentence": "唯不繫法，非界非處非蘊攝，二智知謂滅道智，非識識，非隨眠隨增。",
        "translation": "Only the dharmas that are not fetters are included in neither realms, nor locations, nor aggregates, and the two kinds of cognition are cessation and path cognition, not consciousness, and not latent and subsequently increasing.",
        "source": "T26n1542_018:0767c25_15"
    },
    {
        "source_sentence": "過去法，十八界十二處五蘊攝，九智知除滅智，六識識，一切隨眠隨增。",
        "translation": "In the case of past dharmas, the five aggregates of the eighteen realms and twelve locations are included in nine kinds of cognition except cessation cognition, and the six consciousnesses all follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0767c26_16"
    },
    {
        "source_sentence": "唯過去法，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "It's only past dharmas that aren't included in realms, places, or aggregates, aren't known by cognition, aren't conscious of consciousness, and aren't accompanied by dormancy and increase.",
        "source": "T26n1542_018:0767c28_17"
    },
    {
        "source_sentence": "未來現在法亦爾。",
        "translation": "So it will be with future and present dharmas.",
        "source": "T26n1542_018:0767c29_18"
    },
    {
        "source_sentence": "非過去非未來非現在法，一界一處非蘊攝，六智知除他心苦集道智，一識識，",
        "translation": "They are neither past, nor future, nor present dharmas. One realm and one location are not included in the aggregates. The six knowledges know that they remove the awarenesses of others with regard to frustration, the one knowledge of the origin and the one knowledge of the path.",
        "source": "T26n1542_018:0768a01_19"
    },
    {
        "source_sentence": "非隨眠隨增。",
        "translation": "It's not latent and subsequently increasing.",
        "source": "T26n1542_018:0768a02_20"
    },
    {
        "source_sentence": "唯非過去非未來非現在法，非界非處非蘊攝，一智知謂滅智，非識識，",
        "translation": "They are only not past, not future, and not present factors; they are neither realms, nor places, nor included in aggregates. The one knowledge of cessation is the knowledge of cessation, which is not consciousness.",
        "source": "T26n1542_018:0768a03_21"
    },
    {
        "source_sentence": "非隨眠隨增。",
        "translation": "It's not latent and subsequently increasing.",
        "source": "T26n1542_018:0768a04_22"
    },
    {
        "source_sentence": "苦聖諦所攝法，十八界十二處五蘊攝，七智知除集滅道智，六識識，一切隨眠隨增。",
        "translation": "The dharmas that are included in the noble truth of suffering are subsumed in the five aggregates of the eighteen realms and twelve locations, the seven kinds of cognition that remove knowledge of accumulation and cessation and knowledge of the path, and the six consciousnesses that all follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0768a06_0"
    },
    {
        "source_sentence": "唯苦聖諦所攝法，非界非處非蘊攝，一智知謂苦智，非識識，非隨眠隨增。",
        "translation": "Only the dharmas that are included in the noble truth of suffering are not realms, non-realms, non-places, and non-aggregates. The one knowledge of knowing is the knowledge of suffering; they are not consciousness or latent tendencies or subsequently increasing tendencies.",
        "source": "T26n1542_018:0768a07_1"
    },
    {
        "source_sentence": "集聖諦所攝法，十八界十二處五蘊攝，七智知除苦滅道智，六識識，一切隨眠隨增。",
        "translation": "The dharmas that are included in the noble truth of accumulation are subsumed in the five aggregates of the eighteen realms and twelve places, the seven kinds of cognition that remove suffering and cessation and knowledge of the path, and the six consciousnesses that all follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0768a09_2"
    },
    {
        "source_sentence": "唯集聖諦所攝法，非界非處非蘊攝，一智知謂集智，非識識，非隨眠隨增。",
        "translation": "Only the dharmas that are included in the noble truth of accumulation are not included in realms, locations, or aggregates, and one knowledge is cognition of accumulation, not consciousness, which doesn't follow dormancy and increase.",
        "source": "T26n1542_018:0768a11_3"
    },
    {
        "source_sentence": "滅聖諦所攝法，一界一處非蘊攝，六智知除他心苦集道智，一識識，非隨眠隨增。",
        "translation": "dharmas that are included in the noble truth of cessation, one realm and one place aren't included in the aggregates, six kinds of cognition know other minds apart from suffering, accumulation, and path cognition, and one consciousness isn't accompanied by dormancy or increase.",
        "source": "T26n1542_018:0768a13_4"
    },
    {
        "source_sentence": "唯滅聖諦所攝法，非界非處非蘊攝，一智知謂滅智，非識識，非隨眠隨增。",
        "translation": "Only the dharmas that are included in the noble truth of cessation are not included in realms, non-realms, non-places, and non-aggregates. The one knowledge of cessation refers to the knowledge of cessation, which is neither consciousness nor accompanied by dormancy nor increasing.",
        "source": "T26n1542_018:0768a14_5"
    },
    {
        "source_sentence": "道聖諦所攝法，三界二處五蘊攝，七智知除苦集滅智，一識識，非隨眠隨增。",
        "translation": "The factors that are included in the noble truth of the path are subsumed by the three realms, two places, and five aggregates, seven kinds of cognition that remove suffering, accumulation, cessation, and knowledge, and one consciousness that doesn't follow dormancy and increase.",
        "source": "T26n1542_018:0768a16_6"
    },
    {
        "source_sentence": "唯道聖諦所攝法，非界非處非蘊攝，一智知謂道智，非識識，非隨眠隨增。",
        "translation": "Only the factors that are included in the noble truth of the path are not included in realms, non-realms, non-fields, and non-aggregates. The knowledge of one knowledge is the knowledge of the path; they are not consciousnesses of consciousness or latent dormancy and subsequently increasing.",
        "source": "T26n1542_018:0768a18_7"
    },
    {
        "source_sentence": "諦所不攝法，一界一處非蘊攝，一智知謂世俗智，一識識，非隨眠隨增。",
        "translation": "dharmas that are not included in the truths, one realm and one place aren't included in the aggregates, one knowledge of cognition refers to worldly cognition, and one consciousness isn't followed by dormancy or increase.",
        "source": "T26n1542_018:0768a19_8"
    },
    {
        "source_sentence": "唯諦所不攝法，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only the dharmas that aren't included in the truths are not included in realms, non-realms, non-places, and non-aggregates, not known by cognition, not consciousness, and not accompanied by dormancy and increase.",
        "source": "T26n1542_018:0768a21_9"
    },
    {
        "source_sentence": "見苦所斷法，三界二處四蘊攝，八智知除滅道智，一識識，見苦所斷一切及見集所斷遍行隨眠隨增。",
        "translation": "The factors to be abandoned through the vision of frustration are included in three realms, two spheres, and four aggregates: the eight knowledges that know extinction with the exception of the knowledge of cessation and the one knowledge of the path. One form of consciousness is seeing all [factors] to be abandoned through the vision of frustration and pervasively active proclivities",
        "source": "T26n1542_018:0768a22_10"
    },
    {
        "source_sentence": "唯見苦所斷法，非界非處非蘊攝，非智知，非識識，見苦所斷非遍行隨眠隨增。",
        "translation": "Only the factors to be eliminated by insight into unsatisfactoriness, which are neither included in realms, non-realms, and non-aggregates, are not known by cognition, not by consciousness, and do not pervasively accompanying latent tendencies that are eliminated by insight into unsatisfactoriness.",
        "source": "T26n1542_018:0768a25_11"
    },
    {
        "source_sentence": "見集所斷法，三界二處四蘊攝，八智知除滅道智，一識識，見集所斷一切及見苦所斷遍行隨眠隨增。",
        "translation": "The factors to be abandoned through the vision of the origin are included in three realms, two spheres, and four aggregates: the eight knowledges that know extinction with the exception of the knowledge of cessation and the one knowledge of the path. One form of consciousness consists of all [factors] to be abandoned through the vision of the origin and pervasive defile",
        "source": "T26n1542_018:0768a26_12"
    },
    {
        "source_sentence": "唯見集所斷法，非界非處非蘊攝，非智知，非識識，見集所斷非遍行隨眠隨增。",
        "translation": "Only the factors to be eliminated by insight into the origin are not included in realms, locations, or aggregates; they are not known by cognition and not by consciousness. The pervasive tendencies that are eliminated by insight into the origin are not accompanied by dormancy and increase accordingly.",
        "source": "T26n1542_018:0768a29_13"
    },
    {
        "source_sentence": "見滅所斷法，三界二處四蘊攝，八智知除滅道智，一識識，見滅所斷一切及遍行隨眠隨增。",
        "translation": "The factors to be eliminated by insight into cessation are included in the three realms, two locations, and four aggregates, the eight kinds of cognition that remove knowledge of cessation and knowledge of the path, and one form of consciousness that sees all and pervasive latencies that are eliminated by insight into cessation and increase.",
        "source": "T26n1542_018:0768b01_14"
    },
    {
        "source_sentence": "唯見滅所斷法，非界非處非蘊攝，非智知，非識識，見滅所斷一切隨眠隨增。",
        "translation": "Only the factors to be eliminated by insight into cessation are not included in realms, locations, or aggregates; they are not known by cognition and not by consciousness. All the proclivities that are eliminated by insight into cessation increase accordingly.",
        "source": "T26n1542_018:0768b04_0"
    },
    {
        "source_sentence": "見道所斷法，三界二處四蘊攝，八智知除滅道智，一識識，見道所斷一切及遍行隨眠隨增。",
        "translation": "The factors to be abandoned through the path of vision are included in three realms, two spheres, and four aggregates. With the exception of the knowledge of cessation and the knowledge of the path of cessation with eight knowledges, one form of consciousness is all that is to be abandoned through the path of vision:",
        "source": "T26n1542_018:0768b05_1"
    },
    {
        "source_sentence": "唯見道所斷法，非界非處非蘊攝，非智知，非識識，見道所斷一切隨眠隨增。",
        "translation": "Only the factors to be abandoned through the path of vision are not included in realms, spheres, or aggregates; they are not known by knowledge and not by consciousness. All the proclivities and all the secondary passions to be abandoned through the path of vision increase accordingly.",
        "source": "T26n1542_018:0768b07_2"
    },
    {
        "source_sentence": "修所斷法，十八界十二處五蘊攝，八智知除滅道智，六識識，修所斷一切及遍行隨眠隨增。",
        "translation": "The factors to be eliminated by cultivation are the five aggregates of the 18 realms and 12 places, the eight knowledges that remove cessation and path cognition, the six consciousnesses, all the consciousnesses that are eliminated by cultivation, and the pervasive latencies that follow and increase accordingly.",
        "source": "T26n1542_018:0768b09_3"
    },
    {
        "source_sentence": "唯修所斷法，十五界十處，非蘊攝，非智知，五識識，修所斷一切隨眠隨增。",
        "translation": "Only the dharmas that are cultivated and eliminated in the fifteen realms and ten places are not included in the aggregates, they aren't known by cognition, and the five consciousnesses have all the latencies and increases that are eliminated in the cultivation of all the consciousnesses.",
        "source": "T26n1542_018:0768b11_4"
    },
    {
        "source_sentence": "非所斷法，三界二處五蘊攝，八智知除苦集智，一識識，非隨眠隨增。",
        "translation": "The dharmas that are not to be eliminated are included in the three realms, two places, and five aggregates, eight kinds of cognition that remove suffering and accumulate cognition, and one form of consciousness that doesn't follow dormancy and increase.",
        "source": "T26n1542_018:0768b13_5"
    },
    {
        "source_sentence": "唯非所斷法，非界非處非蘊攝，二智知謂滅道智，非識識，非隨眠隨增。",
        "translation": "They are only dharmas that are not to be eliminated, which are neither included in realms, locations, nor aggregates, and the two kinds of cognition are cessation and path cognition, not consciousness, and not latent and subsequently increasing.",
        "source": "T26n1542_018:0768b14_6"
    },
    {
        "source_sentence": "色蘊，十一界十一處一蘊攝，八智知除他心滅智，六識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "The aggregate of form, which is subsumed in eleven realms and 11 locations as one aggregate, has eight kinds of cognition that know the cessation of mind except for other minds, six kinds of consciousness, pervasive activity in the desire realm and form, and latencies that are eliminated by cultivation and increase accordingly.",
        "source": "T26n1542_018:0768b16_7"
    },
    {
        "source_sentence": "唯色蘊，十界十處一蘊攝，非智知，五識識，非隨眠隨增。",
        "translation": "Only the aggregate of form, which is subsumed in ten realms and ten locations as one aggregate, isn't known by cognition, and the five consciousnesses are not accompanied by dormancy or increase.",
        "source": "T26n1542_018:0768b18_8"
    },
    {
        "source_sentence": "受蘊，一界一處一蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "The aggregate of sensation, which is subsumed in one realm, one place, and one aggregate, has nine kinds of cognition that remove the knowledge of cessation, and one consciousness that increases with all the latent tendencies.",
        "source": "T26n1542_018:0768b19_9"
    },
    {
        "source_sentence": "唯受蘊，非界非處一蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only the aggregate of feeling is included in a single aggregate that's neither real nor place, which isn't known by cognition, isn't consciousness, and doesn't follow dormancy and increase.",
        "source": "T26n1542_018:0768b21_10"
    },
    {
        "source_sentence": "想行蘊亦爾。",
        "translation": "So it is with the aggregate of perception and volition.",
        "source": "T26n1542_018:0768b22_11"
    },
    {
        "source_sentence": "識蘊，七界一處一蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "The aggregate of consciousness, which consists of seven realms, one place, and one aggregate, is subsumed by nine kinds of cognition except cessation cognition, and a single consciousness that increases with all the latencies.",
        "source": "T26n1542_018:0768b22_12"
    },
    {
        "source_sentence": "唯識蘊，七界一處一蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Consciousness only is the aggregate of consciousness, which is subsumed in seven realms, one place, and one aggregate, not cognition, not consciousness, and not followed by dormancy and subsequent increase.",
        "source": "T26n1542_018:0768b24_13"
    },
    {
        "source_sentence": "眼處，一界一處一蘊攝，七智知除他心滅道智，一識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "The locus of the eye, which is subsumed in one realm, one place, and one aggregate, has seven kinds of cognition that know the path to the cessation of mind except for others, and one consciousness that increases with pervasive activity in the desire realm and following dormancy that's eliminated by cultivation.",
        "source": "T26n1542_018:0768b26_0"
    },
    {
        "source_sentence": "唯眼處，一界一處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "It is only in the sense-field of the eye. One realm and one place are not included in aggregates; they are not known by knowledge or by consciousness, neither by consciousness nor by dormancy nor by increase.",
        "source": "T26n1542_018:0768b28_0"
    },
    {
        "source_sentence": "耳鼻舌身處亦爾。",
        "translation": "So it is with the ear, nose, tongue, and body.",
        "source": "T26n1542_018:0768b29_1"
    },
    {
        "source_sentence": "色處，一界一處一蘊攝，七智知除他心滅道智，二識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "In the realm of form, there's one realm, one place, and one aggregate that are included in seven kinds of cognition except for the cessation of other minds and knowledge of the path, two kinds of consciousness, which are pervasively active in the desire realm and the latencies that are eliminated by cultivation and increase accordingly.",
        "source": "T26n1542_018:0768b29_2"
    },
    {
        "source_sentence": "唯色處，一界一處非蘊攝，非智知，一識識，非隨眠隨增。",
        "translation": "Only in the form realm, there's one realm and one place that aren't included in the aggregates, don't know by cognition, and a single consciousness that doesn't follow dormancy and increase.",
        "source": "T26n1542_018:0768c02_3"
    },
    {
        "source_sentence": "聲觸處亦爾。",
        "translation": "So it is with the sense-field of sound and touch.",
        "source": "T26n1542_018:0768c03_4"
    },
    {
        "source_sentence": "香處，一界一處一蘊攝，六智知除類他心滅道智，二識識，欲界遍行及修所斷隨眠隨增。",
        "translation": "The sphere of fragrance is subsumed in one realm, one location, and one aggregate. Six knowledges are with the six knowledges: exception made for the knowledge of cessation of awarenesses of another as an object; two forms of consciousness - the pervasive formations of the realm of sexual passion and the subsequent dormancy that is to be abandoned through",
        "source": "T26n1542_018:0768c04_5"
    },
    {
        "source_sentence": "唯香處，一界一處非蘊攝，非智知，一識識，非隨眠隨增。",
        "translation": "It is only the sphere of smell: one realm and one place are not included in the aggregates; they are not known by knowledge or cognition. One consciousness is a consciousness, but it is not accompanied by dormancy or by increase.",
        "source": "T26n1542_018:0768c06_6"
    },
    {
        "source_sentence": "味處亦爾。",
        "translation": "So it is with the sense-field of taste.",
        "source": "T26n1542_018:0768c07_7"
    },
    {
        "source_sentence": "意處，七界一處一蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "The mental state, which is subsumed in one of the seven realms and one place and one aggregate, has nine kinds of cognition except cessation cognition, and one consciousness that all follows and increases with dormancy.",
        "source": "T26n1542_018:0768c07_8"
    },
    {
        "source_sentence": "唯意處，七界一處一蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only the mental state is included in seven realms, one place and one aggregate. It is not known by cognition, not by consciousness, and not accompanied by dormancy or by increase.",
        "source": "T26n1542_018:0768c09_9"
    },
    {
        "source_sentence": "法處，一界一處四蘊攝，十智知，一識識，一切隨眠隨增。",
        "translation": "In the Dharma realm, there are four aggregates that are included in one realm and one location, ten kinds of cognition, and one consciousness, all which follow dormancy and increase accordingly.",
        "source": "T26n1542_018:0768c10_10"
    },
    {
        "source_sentence": "唯法處，一界一處三蘊攝，一智知謂滅智，非識識，非隨眠隨增。",
        "translation": "It is only the sphere of factors: one realm and one location are included in three clusters. The knowledge of cessation through one knowledge means the knowledge of cessation. It is no consciousness or consciousness, because it does not follow dormancy and subsequently increase.",
        "source": "T26n1542_018:0768c11_11"
    },
    {
        "source_sentence": "眼界，一界一處一蘊攝，七智知除他心滅道智，一識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "The eye realm, which is subsumed in one realm, one place, and one aggregate, has seven kinds of cognition that know the path to cessation of mind except for other minds, and a single consciousness that increases with pervasive activity in the desire realm and following dormancy that's eliminated by cultivation.",
        "source": "T26n1542_018:0768c13_12"
    },
    {
        "source_sentence": "唯眼界，一界一處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only the eye realm, which is not included in one realm or one place as an aggregate, isn't known by cognition, isn't conscious of consciousness, and isn't accompanied by dormancy and increase.",
        "source": "T26n1542_018:0768c15_13"
    },
    {
        "source_sentence": "耳、鼻、舌、身界亦爾。",
        "translation": "So it is with the ear, nose, tongue, and body realms.",
        "source": "T26n1542_018:0768c16_14"
    },
    {
        "source_sentence": "色界，一界一處一蘊攝，七智知除他心滅道智，二識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "In the realm of form, there's one realm, one place, and one aggregate that are included in seven kinds of cognition that know the path to cessation of other minds, two kinds of consciousness, pervasive formations in the realm of desire and form, and latencies that are eliminated by cultivation and increase accordingly.",
        "source": "T26n1542_018:0768c16_15"
    },
    {
        "source_sentence": "唯色界，一界一處非蘊攝，非智知，一識識，非隨眠隨增。",
        "translation": "Only in the realm of form, there's one realm and one place that aren't included in the aggregates, not known by cognition, and one consciousness that doesn't follow dormancy and increase.",
        "source": "T26n1542_018:0768c18_16"
    },
    {
        "source_sentence": "聲觸界亦爾。",
        "translation": "So it is with the sound and touch realms.",
        "source": "T26n1542_018:0768c19_17"
    },
    {
        "source_sentence": "香界，一界一處一蘊攝，六智知除類他心滅道智，二識識，欲界遍行及修所斷隨眠隨增。",
        "translation": "In the sense-sphere of fragrance, one realm, one place and one aggregate are included: six knowledges that know the path to cessation of awarenesses as exceptions for the ones of another; two forms of consciousness that are pervasive in the realm of sexual passion and with subsequent dormancy which is to be abandoned through personal realisation.",
        "source": "T26n1542_018:0768c20_18"
    },
    {
        "source_sentence": "唯香界，一界一處非蘊攝，非智知，一識識，非隨眠隨增。",
        "translation": "It is only in the sense-sphere of smell: one realm and one place are not included in the aggregates; they are not known by knowledge or cognition. One consciousness is a consciousness, but it does not follow dormancy or increase [by itself].",
        "source": "T26n1542_018:0768c22_19"
    },
    {
        "source_sentence": "味界亦爾。",
        "translation": "So it is with the taste realm.",
        "source": "T26n1542_018:0768c23_20"
    },
    {
        "source_sentence": "意界，如意處。",
        "translation": "The mind realm is like the mindful abode.",
        "source": "T26n1542_018:0768c23_21"
    },
    {
        "source_sentence": "法界，如法處。",
        "translation": "The Dharma realm is like the Dharma realm.",
        "source": "T26n1542_018:0768c23_22"
    },
    {
        "source_sentence": "眼識界，二界一處一蘊攝，八智知除滅道智，一識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "The element consciousness of the eye is included in two realms, one place and one aggregate: eight knowledges that are with the exception of the knowledge of cessation and the one knowledge of the path. One form of consciousness is consciousness of the mind: pervasively proceeding in the realm of sexual passion and in the one of form; subsequent dormancy which is to",
        "source": "T26n1542_018:0768c24_23"
    },
    {
        "source_sentence": "唯眼識界，一界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only the element of consciousness of the eye is included in one element: it is not a place and not an aggregate. It is not known by knowledge or by consciousness, and it does not follow dormancy and subsequently increase.",
        "source": "T26n1542_018:0768c26_24"
    },
    {
        "source_sentence": "耳、身、識界亦爾。",
        "translation": "So it is with the ear, body, and consciousness realms.",
        "source": "T26n1542_018:0768c27_25"
    },
    {
        "source_sentence": "鼻識界，二界一處一蘊攝，七智知除類滅道智，一識識，欲界遍行及修所斷隨眠隨增。",
        "translation": "The element consciousness of the nose, which is subsumed in two realms, one place, and one aggregate, has seven kinds of cognition that are free of cessation and path cognition, and one consciousness, which is pervasive in the desire realm and increases along with the latencies that are eliminated by cultivation.",
        "source": "T26n1542_018:0768c27_26"
    },
    {
        "source_sentence": "唯鼻識界，一界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only the element consciousness of the nose is included in one realm, not a place and not an aggregate; it is not known by cognition, not by consciousness, and not accompanied by dormancy or increase.",
        "source": "T26n1542_018:0768c29_27"
    },
    {
        "source_sentence": "舌識界亦爾。",
        "translation": "So it is with the tongue and consciousness realms.",
        "source": "T26n1542_018:0769a02_0"
    },
    {
        "source_sentence": "意識界，二界一處一蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "Consciousness of the mind as consciousness, which is subsumed in two realms, one place, and one aggregate, has nine kinds of cognition that remove cessation and knowledge, and one form of consciousness that all follows dormancy and increase.",
        "source": "T26n1542_018:0769a02_1"
    },
    {
        "source_sentence": "唯意識界，一界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Consciousness of the mind is only with one element. It is not included in a single element, not in a place, not in an aggregate, not by knowledge or cognition, not by consciousness, not by dormancy, and not by increase.",
        "source": "T26n1542_018:0769a03_2"
    },
    {
        "source_sentence": "眼根，一界一處一蘊攝，七智知除他心滅道智，一識識，欲色界遍行及修所斷隨眠隨增。",
        "translation": "The eye faculty, which is subsumed in one realm, one place, and one aggregate, has seven kinds of cognition that know the path to the cessation of mind except for other minds, and one consciousness that increases with pervasive activity in the desire realm and following dormancy that's eliminated by cultivation.",
        "source": "T26n1542_018:0769a05_3"
    },
    {
        "source_sentence": "眼根，一界一處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "The eye faculty, which is not included in one realm or one place as an aggregate, isn't known by cognition, isn't conscious of consciousness, and isn't accompanied by dormancy and increase.",
        "source": "T26n1542_018:0769a07_4"
    },
    {
        "source_sentence": "耳、鼻、舌、身根亦爾。",
        "translation": "So it is with the ear, nose, tongue, and body faculties.",
        "source": "T26n1542_018:0769a08_5"
    },
    {
        "source_sentence": "女根，一界一處一蘊攝，六智知除類他心滅道智，一識識，欲界遍行及修所斷隨眠隨增。",
        "translation": "The female faculty, which is subsumed in one realm, one place, and one aggregate, has six kinds of cognition that knows the path to cessation except for the cessation of other minds, and one consciousness that increases with pervasive activity in the desire realm and the latencies that are eliminated by cultivation.",
        "source": "T26n1542_018:0769a08_6"
    },
    {
        "source_sentence": "唯女根，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only the female faculty is not included in realms, locations, or aggregates; it is not known by cognition, not by consciousness, and not accompanied by dormancy or increase.",
        "source": "T26n1542_018:0769a10_7"
    },
    {
        "source_sentence": "男根亦爾。",
        "translation": "So it is with the male faculty.",
        "source": "T26n1542_018:0769a11_8"
    },
    {
        "source_sentence": "命根，一界一處一蘊攝，七智知除他心滅道智，一識識，三界遍行及修所斷隨眠隨增。",
        "translation": "The vital faculty, which is subsumed in one realm, one place, and one aggregate, has seven kinds of cognition that know the path to cessation of mind except for other minds, and one kind of consciousness that pervades the three realms and increases along with the latencies that are eliminated by cultivation.",
        "source": "T26n1542_018:0769a12_9"
    },
    {
        "source_sentence": "唯命根，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "It is only the faculty of vitality. It is neither included in a realm, nor in a place, nor in an aggregate; it is not known by cognition, not by consciousness, and not accompanied by dormancy or by increase.",
        "source": "T26n1542_018:0769a14_10"
    },
    {
        "source_sentence": "意根，如意處。",
        "translation": "The mind faculty is like the locus of thought.",
        "source": "T26n1542_018:0769a15_11"
    },
    {
        "source_sentence": "樂根，一界一處一蘊攝，九智知除滅智，一識識，色界一切，欲界遍行，",
        "translation": "The faculty satisfaction is that which is included in one realm, one place and one aggregate: nine knowledges are with the knowledge of cessation as exception; one knowledge of cessation is with one form of consciousness.",
        "source": "T26n1542_018:0769a15_12"
    },
    {
        "source_sentence": "及修所斷隨眠隨增。",
        "translation": "It's also the latent tendencies that are cultivated and the latent tendencies that are eliminated.",
        "source": "T26n1542_018:0769a17_13"
    },
    {
        "source_sentence": "唯樂根，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "It is only the faculty satisfaction. It is not included in a realm, or in a place, or in an aggregate; it is not known by cognition, not by consciousness, and not accompanied by dormancy or by increase.",
        "source": "T26n1542_018:0769a17_14"
    },
    {
        "source_sentence": "苦根，一界一處一蘊攝，七智知除類滅道智，一識識，欲界遍行及修所斷隨眠隨增。",
        "translation": "The faculty of suffering, which is subsumed in one realm, one place, and one aggregate, has seven kinds of cognition that know the path to cessation and nirvāṇa, and one consciousness that's pervasive in the desire realm and increases along with the latencies that are eliminated by cultivation.",
        "source": "T26n1542_018:0769a20_0"
    },
    {
        "source_sentence": "唯苦根，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "It is only the root of unsatisfactoriness; it is not a realm, not a place, not an aggregate, not cognition or knowledge, not consciousness or consciousness, and not accompanied by dormancy or increase.",
        "source": "T26n1542_018:0769a21_1"
    },
    {
        "source_sentence": "喜根，一界一處一蘊攝，九智知除滅智，一識識，色界一切，除欲界無漏緣疑及彼相應無明，",
        "translation": "The faculty contentedness is included in one realm, one place and one aggregate: nine knowledges are to be known by means of the knowledge of cessation; one knowledge of cessation is with one form of consciousness. All in the realm of form - exception made for perplexity having doubt as an outflow-free supporting object and for ignorance associated with it",
        "source": "T26n1542_018:0769a23_2"
    },
    {
        "source_sentence": "諸餘欲界一切隨眠隨增。",
        "translation": "All the other latent tendencies in the desire realm follow and increase.",
        "source": "T26n1542_018:0769a25_3"
    },
    {
        "source_sentence": "唯喜根，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only the faculty contentedness is not included in a realm, a place, or an aggregate; it is not known by cognition, not by consciousness, and not accompanied by dormancy or increase.",
        "source": "T26n1542_018:0769a25_4"
    },
    {
        "source_sentence": "憂根，一界一處一蘊攝，七智知除類滅道智，一識識，欲界一切隨眠隨增。",
        "translation": "The faculty of grief, which is subsumed in one realm, one place, and one aggregate, has seven kinds of cognition that know the path to cessation except for types of cognition, and one consciousness that increases with all the latencies in the desire realm.",
        "source": "T26n1542_018:0769a27_0"
    },
    {
        "source_sentence": "唯憂根，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only the faculty of grief is not included in realms, locations, or aggregates; it is not known by cognition, not by consciousness, and not accompanied by dormancy or increase.",
        "source": "T26n1542_018:0769a28_1"
    },
    {
        "source_sentence": "捨根，一界一處一蘊攝，九智知除滅智，一識識，一切隨眠隨增。",
        "translation": "The faculty of equanimity, which is subsumed in one realm, one place, and one aggregate, has nine kinds of cognition that remove the knowledge of cessation, and one consciousness that increases with all the latent tendencies.",
        "source": "T26n1542_018:0769a29_2"
    },
    {
        "source_sentence": "唯捨根，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only the faculty of equanimity is not included in realms, places, or aggregates, not cognition, not consciousness, and not accompanied by dormancy and increase.",
        "source": "T26n1542_018:0769b02_3"
    },
    {
        "source_sentence": "信根，一界一處一蘊攝，九智知除滅智，一識識，三界遍行及修所斷隨眠隨增。",
        "translation": "The faculty of faith, which is subsumed in one realm, one place, and one aggregate, has nine kinds of cognition that are known except for cessation, one form of consciousness, three realms that are pervasive, and latencies that are eliminated by cultivation that increase accordingly.",
        "source": "T26n1542_018:0769b03_4"
    },
    {
        "source_sentence": "唯信根，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "They are only the faculty of faith, not included in realms, not places, not aggregates, not cognition, not consciousness, not latent tendencies, and not increases.",
        "source": "T26n1542_018:0769b05_5"
    },
    {
        "source_sentence": "精進、念、定、慧根亦爾。",
        "translation": "The same applies to the faculty energy, to mindfulness, to meditative attainment and to wisdom.",
        "source": "T26n1542_018:0769b06_6"
    },
    {
        "source_sentence": "未知當知根，三界二處三蘊攝，七智知除苦集滅智，一識識，非隨眠隨增。",
        "translation": "He doesn't know the faculty of knowing what should be known, which is included in the three realms, two places, and three aggregates, seven kinds of cognition that knows suffering, accumulation, cessation, and cognition, and a single consciousness that doesn't follow dormancy and increase.",
        "source": "T26n1542_018:0769b07_0"
    },
    {
        "source_sentence": "唯未知當知根，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "They only don't know the faculty of knowing what should be known, aren't included in realms or places or aggregates, aren't known by cognition, aren't consciousness and consciousness, and aren't accompanied by dormancy and increase.",
        "source": "T26n1542_018:0769b08_1"
    },
    {
        "source_sentence": "已知具知根亦爾。",
        "translation": "So it is with the faculty of knowing what's known and fully known.",
        "source": "T26n1542_018:0769b10_2"
    },
    {
        "source_sentence": "欲界見苦所斷隨眠，一界一處一蘊攝，七智知除類滅道智，一識識，欲界見苦所斷一切及見集所斷遍行隨眠隨增。",
        "translation": "In the realm of sexual passion, proclivities that are to be abandoned by insight into unsatisfactorinessTM*’ are included in one realm, one place and one aggregate. The seven knowledges know: exception made for the knowledge of the path to cessation of beings with specific characteristic marks; one form of consciousness - all that are to be abandoned by insight",
        "source": "T26n1542_018:0769b11_0"
    },
    {
        "source_sentence": "唯欲界見苦所斷隨眠，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "They are only proclivities that are abandoned by insight into suffering in the realm of sexual passion, which are neither included in the realms, non-realms, non-places, nor aggregates; they are not known by cognition, not by consciousness, and not accompanied by or followed by dormancy.",
        "source": "T26n1542_018:0769b13_1"
    },
    {
        "source_sentence": "欲界見集所斷隨眠，一界一處一蘊攝，七智知除類滅道智，一識識，欲界見集所斷一切及見苦所斷遍行隨眠隨增。",
        "translation": "In the realm of sexual passion, all proclivities to be abandoned by insight into the origin are included in one realm, one place, and one aggregate. The seven knowledges know that with the exception of the knowledge of cessation as a species, there is only one form of consciousness:",
        "source": "T26n1542_018:0769b15_2"
    },
    {
        "source_sentence": "唯欲界見集所斷隨眠，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "They are only proclivities abandonable by insight into the origin in the realm of sexual passion. They are neither included in the realms, nor in the spheres, nor in the aggregates; they are not known by reason of knowledge, not by reason of consciousness, and not accompanied by or following dormancy.",
        "source": "T26n1542_018:0769b17_3"
    },
    {
        "source_sentence": "欲界見滅所斷隨眠，一界一處一蘊攝，七智知除類滅道智，一識識，除欲界見滅所斷不共無明，",
        "translation": "The proclivities abandonable by insight into cessation in the realm of sexual passion are with one realm, one place and one aggregate as subject matter:",
        "source": "T26n1542_018:0769b19_4"
    },
    {
        "source_sentence": "諸餘欲界見滅所斷一切及遍行隨眠隨增。",
        "translation": "All the other afflictions that are stopped by seeing cessation in the desire realm and pervasive latent tendencies that arise subsequently increase.",
        "source": "T26n1542_018:0769b21_5"
    },
    {
        "source_sentence": "唯欲界見滅所斷隨眠，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "They are only proclivities that are abandoned by insight into cessation in the realm of sexual passion. They are not included in a realm, a non-realm, a non-place, or an aggregate; they are not known by cognition, not by consciousness, and not accompanied by dormancy and subsequently increasing.",
        "source": "T26n1542_018:0769b22_6"
    },
    {
        "source_sentence": "欲界見道所斷隨眠，一界一處一蘊攝，七智知除類滅道智，一識識，除欲界見道所斷不共無明，",
        "translation": "In the realm of sexual passion, proclivities to be abandoned through the path of visionTM*” are with one realm, one place and one aggregate as supporting object. The seven knowledges know that exception is made for the knowledge of the path of cessation of species. One form of consciousness:",
        "source": "T26n1542_018:0769b24_7"
    },
    {
        "source_sentence": "諸餘欲界見道所斷一切及遍行隨眠隨增。",
        "translation": "All the other things in the desire realm that are stopped by the path of seeing and all the pervasive tendencies, latencies, and increases.",
        "source": "T26n1542_018:0769b26_8"
    },
    {
        "source_sentence": "唯欲界見道所斷隨眠，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "They are only proclivities in the realm of sexual passion that are abandoned through the path of vision. They are not included in a realm, a non-realm, a non-place, or an aggregate; they are not known by cognition, not by consciousness, and not accompanied by dormancy and subsequently increasing.",
        "source": "T26n1542_018:0769b27_9"
    },
    {
        "source_sentence": "欲界修所斷隨眠，一界一處一蘊攝，七智知除類滅道智，一識識，欲界修所斷一切及遍行隨眠隨增。",
        "translation": "The proclivities cultivated in the realm of sexual passion that are to be abandoned by means of this path, one realm, one place and one aggregate comprise seven knowledges with the exception of the knowledge of cessation as a species. One consciousness:",
        "source": "T26n1542_018:0769b28_10"
    },
    {
        "source_sentence": "唯欲界修所斷隨眠，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only the proclivities that are cultivated in the desire realm and eliminated by cultivation are not realms, non-realms, non-places, and not included in aggregates, not known by cognition, not consciousness, and not accompanied by dormancy and subsequently increasing.",
        "source": "T26n1542_018:0769c02_11"
    },
    {
        "source_sentence": "色界見苦所斷隨眠，一界一處一蘊攝，七智知除法滅道智，一識識，色界見苦所斷一切及見集所斷遍行隨眠隨增。",
        "translation": "In the realm of form, proclivities that are to be abandoned by insight into unsatisfactoriness are included in one realm, one place, and one aggregate. With the exception of the knowledge of the cessation of factors as substratum with respect to seven knowledges*”’, there is one form of consciousness: all that are to be abandoned by insight into unsatis",
        "source": "T26n1542_018:0769c03_12"
    },
    {
        "source_sentence": "唯色界見苦所斷隨眠，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "They are only proclivities that are abandoned by insight into suffering in the realm of form, which are neither included in either realms, nor locations, nor aggregates; they are not known by cognition, not by consciousness, and not accompanied by or followed by dormancy.",
        "source": "T26n1542_018:0769c06_13"
    },
    {
        "source_sentence": "色界見集所斷隨眠，一界一處一蘊攝，七智知除法滅道智，一識識，色界見集所斷一切及見苦所斷遍行隨眠隨增。",
        "translation": "In the realm of form, all proclivities to be abandoned by insight into the origin are included in one realm, one place, and one aggregate. With the exception of the knowledge of the cessation of factors as substratum with respect to seven knowledges*”’, there is one form of consciousness:",
        "source": "T26n1542_018:0769c07_14"
    },
    {
        "source_sentence": "唯色界見集所斷隨眠，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only the proclivities that are abandoned by insight and accumulation in the realm of form, which are neither realms, nor locations, nor aggregates, are not known by cognition, not by consciousness, and not accompanied by dormancy and subsequently increasing.",
        "source": "T26n1542_018:0769c10_15"
    },
    {
        "source_sentence": "色界見滅所斷隨眠，一界一處一蘊攝，七智知除法滅道智，一識識，除色界見滅所斷不共無明，",
        "translation": "In the realm of form, proclivities to be abandoned by insight into cessation are: one realm, one place and one aggregate are included in seven knowledges with the exception of the knowledge of the path leading to cessation of factors; one consciousness. With the exception of ignorance that is unique and not to be abandoned by insight into cessation in the realm of",
        "source": "T26n1542_018:0769c12_16"
    },
    {
        "source_sentence": "諸餘色界見滅所斷一切及遍行隨眠隨增。",
        "translation": "All the other form realms that are stopped by seeing cessation and pervasive latent tendencies that arise along with those that are stopped by pervasive tendencies increase.",
        "source": "T26n1542_018:0769c14_17"
    },
    {
        "source_sentence": "唯色界見滅所斷隨眠，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only the proclivities that are abandoned by insight into cessation in the realm of form, which are neither realms, non-places, and not included in aggregates, are not known by cognition, not by consciousness, and not accompanied by dormancy and subsequently increasing.",
        "source": "T26n1542_018:0769c15_18"
    },
    {
        "source_sentence": "色界見道所斷隨眠，一界一處一蘊攝，七智知除法滅道智，一識識，除色界見道所斷不共無明，",
        "translation": "In the realm of form, proclivities to be abandoned through the path of vision are: one realm, one place and one aggregate are included in seven knowledges - exception made for knowledge of the path leading to cessation of factors. One consciousness is consciousness; exception made for ignorance that is unique and not to be abandoned through the path of vision of the realm of",
        "source": "T26n1542_018:0769c16_19"
    },
    {
        "source_sentence": "諸餘無色界見道所斷一切及遍行隨眠隨增。",
        "translation": "All the other formless realms that are stopped by the path of seeing and all the pervasive tendencies that follow dormancy and increase.",
        "source": "T26n1542_018:0769c19_20"
    },
    {
        "source_sentence": "唯色界見道所斷隨眠，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "They are only proclivities that are abandoned by the path of seeing in the realm of form, which are not included in either realms or locations or aggregates; they are not known by cognition, not by consciousness, and not accompanied by dormancy or increase.",
        "source": "T26n1542_018:0769c20_21"
    },
    {
        "source_sentence": "色界修所斷隨眠，一界一處一蘊攝，七智知除法滅道智，一識識，色界修所斷一切及遍行隨眠隨增。",
        "translation": "The proclivities cultivated in the realm of form that are to be abandoned through spiritual practice, one realm, one place and one aggregate are included: seven knowledges with the exception of the knowledge of the path to cessation of factors; one consciousness. All those eliminated by spiritual practice in the realm of form and all pervasive proclivities increase successively.",
        "source": "T26n1542_018:0769c21_22"
    },
    {
        "source_sentence": "唯色界修所斷隨眠，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only the proclivities that are cultivated in the form realm and eliminated by cultivation are not realms, non-realms, non-places, and not included in aggregates, not known by cognition, not consciousness, and not accompanied by dormancy and subsequently increasing.",
        "source": "T26n1542_018:0769c24_23"
    },
    {
        "source_sentence": "無色界見苦所斷隨眠，一界一處一蘊攝，六智知除法他心滅道智，一識識，",
        "translation": "In the realm of formlessness, proclivities abandonable by insight into unsatisfactoriness are included in one realm, one sphere, one place, and one aggregate. They are with six knowledges:",
        "source": "T26n1542_018:0769c25_24"
    },
    {
        "source_sentence": "無色界見苦所斷一切及見集所斷遍行隨眠隨增。",
        "translation": "In the formless realm, everything that's stopped by seeing suffering and all that's stopped by seeing accumulation are pervasive, followed by dormancy, and increase.",
        "source": "T26n1542_018:0769c27_25"
    },
    {
        "source_sentence": "唯無色界見苦所斷隨眠，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only the formless realm is subject to proclivities that are stopped by seeing suffering, which aren't included in either realms or locations or aggregates, aren't known by cognition, aren't conscious by consciousness, and don't follow and increase with proclivities.",
        "source": "T26n1542_018:0769c28_26"
    },
    {
        "source_sentence": "無色界見集所斷隨眠，一界一處一蘊攝，六智知除法他心滅道智，一識識，",
        "translation": "In the realm of formlessness, proclivities abandonable by insight into the origin are included in one realm, one place, and one aggregate.",
        "source": "T26n1542_018:0770a01_27"
    },
    {
        "source_sentence": "無色界見集所斷一切及見苦所斷遍行隨眠隨增。",
        "translation": "All of the formless realm's pervasive tendencies that are stopped by seeing what's accumulated and stopped by seeing what's painful increase with subsequent dormancy.",
        "source": "T26n1542_018:0770a02_28"
    },
    {
        "source_sentence": "唯無色界見集所斷隨眠，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only the formless realm is subject to proclivities that are eliminated by seeing and accumulating, which aren't included in realms or places or aggregates, aren't known by cognition, aren't conscious by consciousness, and don't follow and increase with proclivities.",
        "source": "T26n1542_018:0770a04_0"
    },
    {
        "source_sentence": "無色界見滅所斷隨眠，一界一處一蘊攝，六智知除法他心滅道智，一識識，",
        "translation": "In the realm of formlessness, proclivities abandoned by insight into cessation are subsumed in one realm, one place, and one aggregate.",
        "source": "T26n1542_018:0770a05_1"
    },
    {
        "source_sentence": "除無色界見滅所斷不共無明，諸餘無色界見滅所斷一切及遍行隨眠隨增。",
        "translation": "\\",
        "source": "T26n1542_018:0770a07_2"
    },
    {
        "source_sentence": "唯無色界見滅所斷隨眠，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only the formless realm is subject to proclivities that are stopped by seeing cessation, which aren't included in realms or places or aggregates, aren't known by cognition, aren't conscious of consciousness, and aren't accompanied by proclivities that follow and increase.",
        "source": "T26n1542_018:0770a09_3"
    },
    {
        "source_sentence": "無色界見道所斷隨眠，一界一處一蘊攝，六智知除法他心滅道智，一識識，",
        "translation": "In the realm of formlessness, proclivities abandonable by insight into the path are included in one realm, one place, and one aggregate.",
        "source": "T26n1542_018:0770a10_4"
    },
    {
        "source_sentence": "除無色界見道所斷不共無明，諸餘無色界見道所斷一切及遍行隨眠隨增。",
        "translation": "“Exception made for the unique ignorance to be abandoned through the path of vision in the realm of formlessness, all other ignorances to be abandoned through the path of vision in the realm of formlessness and pervasive attachmentsTM* that are subsequently developed increase.",
        "source": "T26n1542_018:0770a12_5"
    },
    {
        "source_sentence": "唯無色界見道所斷隨眠，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only the formless realm is subject to proclivities that are eliminated in the path of seeing, which aren't subsumed by realms or locations or aggregates, aren't known by cognition, aren't conscious by consciousness, and don't follow and increase with proclivities.",
        "source": "T26n1542_018:0770a14_6"
    },
    {
        "source_sentence": "無色界修所斷隨眠，一界一處一蘊攝，六智知除法他心滅道智，一識識，",
        "translation": "In the realm of formlessness, proclivities to be abandoned through spiritual practice are subsumed in one realm, one sphere, one place, and one aggregate. They are with six knowledges:",
        "source": "T26n1542_018:0770a15_7"
    },
    {
        "source_sentence": "無色界修所斷一切及遍行隨眠隨增。",
        "translation": "All the formless realms that are cultivated, eliminated, and pervasive latencies that follow dormancy increase.",
        "source": "T26n1542_018:0770a17_8"
    },
    {
        "source_sentence": "唯無色界修所斷隨眠，非界非處非蘊攝，非智知，非識識，非隨眠隨增。",
        "translation": "Only the formless realm has proclivities that are cultivated and eliminated, which aren't subsumed by realms, locations, or aggregates, aren't known by cognition, aren't conscious of consciousness, and aren't accompanied by proclivities that follow and increase.",
        "source": "T26n1542_018:0770a18_9"
    },
    {
        "source_sentence": "說一切有部品類足論卷第十八",
        "translation": "Saṃyuktâgama-śāstra, vol. 18",
        "source": "T26n1542_018:0770a20_0"
    }
]