[
    {
        "source_sentence": "金剛經纂要刊定記卷第三",
        "translation": "Jingang jing xiangyao ganding ji, vol. 3",
        "source": "T33n1702_003:0189a25_0"
    },
    {
        "source_sentence": "長水沙門子璿錄",
        "translation": "Changshui shaman Zixuan lu",
        "source": "T33n1702_003:0189a27_0"
    },
    {
        "source_sentence": "二、發起下二初、敘意戒能下。",
        "translation": "Second, under initiation, there are two first, the ability to describe the mind and precepts.",
        "source": "T33n1702_003:0189a28_0"
    },
    {
        "source_sentence": "以戒是防非止惡義，定是寂靜不動義，慧是明照揀擇義。",
        "translation": "Because moral precepts are the meaning of preventing evil and not stopping evil, concentration is the meaning of quiescence and immovability, and wisdom is the meaning of illuminating and discriminating.",
        "source": "T33n1702_003:0189a28_1"
    },
    {
        "source_sentence": "但能防非心即不動，心若不動慧乃分明，世出世法無不鑒照。",
        "translation": "They can only guard against what's not the mind, which is immovable, and if the mind isn't immovable, then wisdom clearly understands it, and there's nothing worldly or supramundane that doesn't illuminate it.",
        "source": "T33n1702_003:0189a29_2"
    },
    {
        "source_sentence": "其猶海中欲現萬像必要水清，欲求清水無過水靜，欲得水靜勿令起波，",
        "translation": "It's like wanting to show myriad images in the ocean and needing water to be clear, wanting to seek pure water without surpassing the stillness of water, and wanting to attain the stillness of water so as not to cause waves to arise.",
        "source": "T33n1702_003:0189b02_3"
    },
    {
        "source_sentence": "止波如戒，水靜如定，水清如慧，所現萬像如一切法。",
        "translation": "The calming waves are like precepts, the water is still like concentration, the water is clear like wisdom, and the myriad images he shows are like all dharmas.",
        "source": "T33n1702_003:0189b04_0"
    },
    {
        "source_sentence": "喻中則水若不起波則水靜，水靜則水清，水清則現萬像。",
        "translation": "In the metaphor, if water doesn't give rise to waves, then water is still; if water is still, then water is clear; and if water is clear, then myriad images are shown.",
        "source": "T33n1702_003:0189b05_1"
    },
    {
        "source_sentence": "法中則心不起非則心寂，心寂則照知萬法。",
        "translation": "In dharmas, then mind doesn't arise, and what's not mind is quiescent, and when mind is quiescent, it illuminates all things.",
        "source": "T33n1702_003:0189b06_2"
    },
    {
        "source_sentence": "法上但唯一心，喻上但唯一水。",
        "translation": "The above dharmas are only one mind, and the metaphor above is only one water.",
        "source": "T33n1702_003:0189b07_3"
    },
    {
        "source_sentence": "法喻相對義則昭然。",
        "translation": "The opposite meaning of the Dharma metaphor is then clear.",
        "source": "T33n1702_003:0189b08_4"
    },
    {
        "source_sentence": "故經云：「尸羅不清淨，三昧不現前。」",
        "translation": "That's why the sūtra says, Śīlabhadra is impure, and samādhi doesn't appear before him.",
        "source": "T33n1702_003:0189b08_5"
    },
    {
        "source_sentence": "此則戒資定也。",
        "translation": "This is the precepts that provide for concentration.",
        "source": "T33n1702_003:0189b09_6"
    },
    {
        "source_sentence": "《圓覺》云：「一切諸菩薩，無閡清淨慧，皆依禪定生。」",
        "translation": "The Perfect Enlightenment Sutra says, All bodhisattvas lack unobstructed pure wisdom and all arise based on meditation.",
        "source": "T33n1702_003:0189b09_7"
    },
    {
        "source_sentence": "此則定發慧也。",
        "translation": "This is the concentration that gives rise to wisdom.",
        "source": "T33n1702_003:0189b10_8"
    },
    {
        "source_sentence": "疏戒中七節，如疏。",
        "translation": "The seven sections in the commentary on the precepts are as explained in the commentary.",
        "source": "T33n1702_003:0189b11_9"
    },
    {
        "source_sentence": "一、化主俱上九號者。",
        "translation": "1. The nine epithets above the name of the master of transformation.",
        "source": "T33n1702_003:0189b11_10"
    },
    {
        "source_sentence": "以佛有十號，世尊當第十，故云具上九號。",
        "translation": "Because the Buddha has ten names, the Bhagavān will be the tenth, so it's called having the above-mentioned nine names.",
        "source": "T33n1702_003:0189b12_11"
    },
    {
        "source_sentence": "十號者。",
        "translation": "The ten epithets are.",
        "source": "T33n1702_003:0189b13_0"
    },
    {
        "source_sentence": "一如來、二應供、三正遍知、四明行足、五善逝世間解、六無上士、七調御丈夫、八天人師、九佛、十世尊。",
        "translation": "1. the Tathāgata, 2. the Worthy of Offerings, 3. the Perfectly Enlightened One, 4. the fulfillment of knowledge and practice, 5. the understanding of the well-gone world, 6. the unsurpassed person, 7. the tamer of men, 8. the teacher of gods and humans, 9. the Buddha, and 10. the Bhagavān.",
        "source": "T33n1702_003:0189b13_1"
    },
    {
        "source_sentence": "二、化時當日初分者。",
        "translation": "2. The first part of the day when he's transformed.",
        "source": "T33n1702_003:0189b15_2"
    },
    {
        "source_sentence": "謂一日夜十二時總成四分。",
        "translation": "These are the four parts of a day and twelve parts of a night.",
        "source": "T33n1702_003:0189b15_3"
    },
    {
        "source_sentence": "一初分，即寅卯辰，諸天食時。",
        "translation": "The first part of the moon is the first day of the month, which is the time for the gods to eat.",
        "source": "T33n1702_003:0189b16_4"
    },
    {
        "source_sentence": "二中分，即已午未，人法食時。",
        "translation": "The second is the middle portion, which is before noon, when people eat the Dharma.",
        "source": "T33n1702_003:0189b17_5"
    },
    {
        "source_sentence": "三晡分，即申酉戌，神鬼食時。",
        "translation": "The third part of the day is when the gods and ghosts eat, namely at the time of Shen Youxu.",
        "source": "T33n1702_003:0189b17_6"
    },
    {
        "source_sentence": "四夜分，即亥子丑，畜生食時。",
        "translation": "At the fourth watch of the night, that is, during the feeding time of the hare and the ox, when the animals are eating.",
        "source": "T33n1702_003:0189b18_7"
    },
    {
        "source_sentence": "今言辰時，即初分之後際也。",
        "translation": "Now, when it's called an eon, it's the time after the first part.",
        "source": "T33n1702_003:0189b19_8"
    },
    {
        "source_sentence": "唐周二譯皆言日初分，斯則時勝也。",
        "translation": "Both the Tang and Zhou translations all speak of the first part of the sun, which is the superior time.",
        "source": "T33n1702_003:0189b19_9"
    },
    {
        "source_sentence": "此時則乞求不難，以太早太遲皆難得故。",
        "translation": "At that point, it's not difficult to beg because it's too early or too late to ask for anything.",
        "source": "T33n1702_003:0189b20_10"
    },
    {
        "source_sentence": "若非時乞食，欲施即無，不施又愧，便成惱他。",
        "translation": "If someone begs for food at an ungodly hour and doesn't want to give it, then they won't give it, and if they don't give it and are also ashamed, they'll become angry with others.",
        "source": "T33n1702_003:0189b21_11"
    },
    {
        "source_sentence": "乞之不得，亡餐又饑，是惱自也。",
        "translation": "Being unable to beg for food and starving again is a self-inflicted affliction.",
        "source": "T33n1702_003:0189b22_12"
    },
    {
        "source_sentence": "三、化儀下。",
        "translation": "Third, it's below the level of the transformation ritual.",
        "source": "T33n1702_003:0189b23_13"
    },
    {
        "source_sentence": "謂佛有三衣：一、安陀會，即五條，名下品衣，亦名行道作務儭身等衣。",
        "translation": "It means that the Buddha has three kinds of clothing: 1. undergarments, such as the five-pronged undergarment called an undergarment, which is also called a walking garment and a servant's garment.",
        "source": "T33n1702_003:0189b23_14"
    },
    {
        "source_sentence": "二、欝多羅僧，即七條，名中品衣，亦名入眾說法衣。",
        "translation": "The second is the seven-pronged monk's robe, which is called the middling robe and also known as the Dharma robe that enters the assembly to explain the teaching.",
        "source": "T33n1702_003:0189b24_15"
    },
    {
        "source_sentence": "三、僧伽梨，即九條乃至二十五條，名上品衣，亦名福田衣。",
        "translation": "3. the saṃghāṭī, which is nine pieces up to twenty-five pieces long, is called the upper grade robe and also called the field of merit robe.",
        "source": "T33n1702_003:0189b26_16"
    },
    {
        "source_sentence": "製像水田，見生福故。",
        "translation": "The water field where the statue is made is because it produces merit when viewed.",
        "source": "T33n1702_003:0189b27_17"
    },
    {
        "source_sentence": "入王城聚落即著此衣，今以入城乞食故著也。",
        "translation": "He entered the king's city and village and put on this robe, which is now worn because he entered the city to solicit alms.",
        "source": "T33n1702_003:0189b27_18"
    },
    {
        "source_sentence": "天王鉢者，梵語鉢多羅，此云應量器。",
        "translation": "The divine king bowl is the Sanskrit word pratāla, which means to measure a container.",
        "source": "T33n1702_003:0189b28_19"
    },
    {
        "source_sentence": "是過去維衛佛鉢，入涅槃後，龍王將在宮中供養。",
        "translation": "This was the bowl of Vipaśyin Buddha. After he entered nirvana, the nāga king offered it to him in the palace as an offering.",
        "source": "T33n1702_003:0189b29_20"
    },
    {
        "source_sentence": "釋迦成道，龍王送至海水上，四天王欲取，化為四鉢，各得一鉢以奉如來。",
        "translation": "When Śākyamuni achieved enlightenment, the dragon king sent it to the surface of water. The four guardian gods wished to take it and transformed it into four bowls; each obtained one bowl to offer to the Tathāgata.",
        "source": "T33n1702_003:0189c01_21"
    },
    {
        "source_sentence": "如來受已，重疊四鉢在於左手，以右手按合成一鉢。",
        "translation": "After accepting it, the Tathāgata folded the four bowls in his left hand and pressed them together into one bowl with his right.",
        "source": "T33n1702_003:0189c03_22"
    },
    {
        "source_sentence": "此是紺瑠璃石鉢，持用乞食也。",
        "translation": "This is a blue and lapis lazuli stone bowl used for begging food.",
        "source": "T33n1702_003:0189c04_23"
    },
    {
        "source_sentence": "佛出行化，須著衣持鉢者，為離苦樂二邊故。",
        "translation": "When the Buddha travels to teach, he must put on his robe and carry his bowl because he's free of the two extremes of suffering and pleasure.",
        "source": "T33n1702_003:0189c05_24"
    },
    {
        "source_sentence": "諸在家者，好尚錦綺華潔衣服寶器，增長放逸，太著樂邊。",
        "translation": "Laypeople like to adorn brocaded, fancy, beautiful, clean clothes, and jeweled objects, but they grow more careless and too attached to the side of pleasure.",
        "source": "T33n1702_003:0189c06_25"
    },
    {
        "source_sentence": "出家外道苦行尼乾裸形，手捧飯食致招訶醜，太著苦邊。",
        "translation": "A renunciant non-Buddhist nun who practices austerities in a naked form holds rice and food in his hand, causing it to become ugly and excessively painful.",
        "source": "T33n1702_003:0189c07_26"
    },
    {
        "source_sentence": "佛處中行故著衣持鉢也。",
        "translation": "Because he walks in the Buddha's place, he puts on his robe and carries his bowl.",
        "source": "T33n1702_003:0189c08_27"
    },
    {
        "source_sentence": "四、化處者，園是所住處，國是所化處。",
        "translation": "4. The place of transformation refers to the park where he lives and the country where he's transformed.",
        "source": "T33n1702_003:0189c09_28"
    },
    {
        "source_sentence": "之往也。",
        "translation": "It's also the past.",
        "source": "T33n1702_003:0189c10_29"
    },
    {
        "source_sentence": "今行化，故出祇園入舍衛也。",
        "translation": "Now he's practicing his teaching, so he leaves the Jetavana and enters Śrāvastī.",
        "source": "T33n1702_003:0189c10_30"
    },
    {
        "source_sentence": "處廣等者。",
        "translation": "The breadth of the place and so forth.",
        "source": "T33n1702_003:0189c11_31"
    },
    {
        "source_sentence": "準《西域記》，國周六十餘里，內城周二十里，故云處廣。",
        "translation": "According to the Record of the Western Regions, the country is more than sixty li in circuit and its inner city is twenty li in circuit.",
        "source": "T33n1702_003:0189c11_32"
    },
    {
        "source_sentence": "《智度論》云：「居家九億，故曰人多。」",
        "translation": "The Zhidu lun says, Nine billion people live at home; therefore, it's called many.",
        "source": "T33n1702_003:0189c12_33"
    },
    {
        "source_sentence": "五、化事者。",
        "translation": "5. 'Construction service.'",
        "source": "T33n1702_003:0189c13_34"
    },
    {
        "source_sentence": "此釋經中乞食兩字。",
        "translation": "This explains the two words begging for food in the sūtras.",
        "source": "T33n1702_003:0189c13_35"
    },
    {
        "source_sentence": "頭陀下。",
        "translation": "It's below the ascetic.",
        "source": "T33n1702_003:0189c13_36"
    },
    {
        "source_sentence": "或曰：「佛為教主何須乞食？」",
        "translation": "Or they might say, Why does the Buddha need to beg for food as the master of the teaching?",
        "source": "T33n1702_003:0189c14_37"
    },
    {
        "source_sentence": "故疏釋也。",
        "translation": "That's why the commentary explains it.",
        "source": "T33n1702_003:0189c14_38"
    },
    {
        "source_sentence": "頭陀此云抖擻，抖擻煩惱故。",
        "translation": "This is called ascetic because it shakes the afflictions.",
        "source": "T33n1702_003:0189c14_39"
    },
    {
        "source_sentence": "然頭陀有十二種事。",
        "translation": "Still, there are twelve kinds of ascetic practices.",
        "source": "T33n1702_003:0189c15_40"
    },
    {
        "source_sentence": "謂：常乞食、阿蘭若乃至樹下坐，露地、塚間坐等，今則一也。",
        "translation": "They are: always begging for food, abiding in a forest or even sitting under a tree, sitting in an open place or in a tomb, etc., which are now one and the same.",
        "source": "T33n1702_003:0189c16_41"
    },
    {
        "source_sentence": "若行此事獲大功德，佛現斯軌令人效之。",
        "translation": "If someone does this, they'll attain great merit, and the Buddha will show them this way so that they can follow it.",
        "source": "T33n1702_003:0189c17_42"
    },
    {
        "source_sentence": "頭陀既獲功德，放逸足明尤過。",
        "translation": "Since the ascetic had attained virtue, carelessness was especially faulty.",
        "source": "T33n1702_003:0189c18_43"
    },
    {
        "source_sentence": "世尊尚自乞食，餘人豈合懈怠，慚恥愧悚自然行之。",
        "translation": "The Bhagavān was still begging for food, so why wouldn't the rest of them be lazy and naturally practice it with shame and fear?",
        "source": "T33n1702_003:0189c19_0"
    },
    {
        "source_sentence": "同事攝者，則四攝法之一也。",
        "translation": "Those who are collected by fellow practitioners are one of the four methods of collecting.",
        "source": "T33n1702_003:0189c20_1"
    },
    {
        "source_sentence": "又佛自乞食。",
        "translation": "Again, the Buddha begged for food himself.",
        "source": "T33n1702_003:0189c20_2"
    },
    {
        "source_sentence": "準《纓絡經》說有十意：一、止苦故，謂盲得見。",
        "translation": "According to the sūtras, there are ten meanings: 1. because of stopping suffering, which means blindness obtains views.",
        "source": "T33n1702_003:0189c21_3"
    },
    {
        "source_sentence": "二、得樂故，謂一瞻一禮生無量福。",
        "translation": "2. because of attaining happiness, which means that one look and one salute produce measureless merit.",
        "source": "T33n1702_003:0189c22_4"
    },
    {
        "source_sentence": "三、除慢故，謂眾生見之不生我慢。",
        "translation": "3. because it's free of conceit, meaning that sentient beings see it and don't become conceited about self.",
        "source": "T33n1702_003:0189c22_5"
    },
    {
        "source_sentence": "四、滿鉢願故，富欲施多鉢則為空，貧欲施少鉢則為滿。",
        "translation": "4. because it fulfills the bowl vow, giving a lot of bowls to someone who's rich and wants to give a lot of bowls is considered empty, and giving a little bowl to someone who's poor and wants to give a little bowl is considered complete.",
        "source": "T33n1702_003:0189c23_6"
    },
    {
        "source_sentence": "五、鬼神供養故。",
        "translation": "5. because of the offerings made by ghosts and spirits.",
        "source": "T33n1702_003:0189c24_7"
    },
    {
        "source_sentence": "六、障閡者見佛故，老病貧賤悉皆得見佛也。",
        "translation": "6. Because those who are obstructed by hindrances see the Buddha, old age, illness, and poverty can all see the Buddha.",
        "source": "T33n1702_003:0189c25_8"
    },
    {
        "source_sentence": "七、示天王所獻鉢故。",
        "translation": "7. because it shows the bowl offered by the king of gods.",
        "source": "T33n1702_003:0189c26_9"
    },
    {
        "source_sentence": "八、作軌模故。",
        "translation": "8. because it creates a guideline and a model.",
        "source": "T33n1702_003:0189c26_10"
    },
    {
        "source_sentence": "九、絕誹謗故。",
        "translation": "9. because they stop denigrating.",
        "source": "T33n1702_003:0189c26_11"
    },
    {
        "source_sentence": "十、令弟子不畜八不淨物故。",
        "translation": "10. It's because he causes his disciples not to store eight impure things.",
        "source": "T33n1702_003:0189c27_12"
    },
    {
        "source_sentence": "有此十意故自乞食。",
        "translation": "Because they have these ten intentions, they beg for food themselves.",
        "source": "T33n1702_003:0189c27_13"
    },
    {
        "source_sentence": "纓絡女下。",
        "translation": "It's below the level of a woman who's entangled.",
        "source": "T33n1702_003:0189c28_14"
    },
    {
        "source_sentence": "通難。",
        "translation": "It's a general difficulty.",
        "source": "T33n1702_003:0189c28_15"
    },
    {
        "source_sentence": "前引經難。",
        "translation": "The previous quote from the sūtra explains the difficulty.",
        "source": "T33n1702_003:0189c28_16"
    },
    {
        "source_sentence": "今所下。",
        "translation": "Now, it's below that.",
        "source": "T33n1702_003:0189c28_17"
    },
    {
        "source_sentence": "釋通。",
        "translation": "He explains that it's shared.",
        "source": "T33n1702_003:0189c29_18"
    },
    {
        "source_sentence": "《淨名》下。",
        "translation": "It's found in the Pure Names.",
        "source": "T33n1702_003:0189c29_19"
    },
    {
        "source_sentence": "但證上乞食不食之義。",
        "translation": "They simply realize the above meaning of begging for food and not eating.",
        "source": "T33n1702_003:0189c29_20"
    },
    {
        "source_sentence": "六、化等者，此釋經中於其城中次第乞已也。",
        "translation": "6. Transformation and so forth, this explains that in the sūtras, they've begged in order in their cities.",
        "source": "T33n1702_003:0189c29_21"
    },
    {
        "source_sentence": "內證平等者。",
        "translation": "He who realizes equality internally.",
        "source": "T33n1702_003:0190a01_22"
    },
    {
        "source_sentence": "如理見故。",
        "translation": "It's because they see things as they are according to principle.",
        "source": "T33n1702_003:0190a02_23"
    },
    {
        "source_sentence": "心離貪慢等者。",
        "translation": "The mind is free of craving and conceit, etc.",
        "source": "T33n1702_003:0190a02_24"
    },
    {
        "source_sentence": "不貪富好，不慢貧拙，平等修乞，故云慈無偏利也。",
        "translation": "They don't crave wealth and goodness, aren't conceited and poor, and equally cultivate their begging; therefore, it's called kindness without partiality or benefit.",
        "source": "T33n1702_003:0190a02_25"
    },
    {
        "source_sentence": "表威德等者。",
        "translation": "It shows authoritative qualities and so forth.",
        "source": "T33n1702_003:0190a03_26"
    },
    {
        "source_sentence": "謂佛制小乘律，不許入惡象家，恐彼損害，不許入婬女沽酒家，恐生染心。",
        "translation": "It means that the Buddha establishes the lesser vehicle vinaya, forbidding them from entering a bad elephant's house because he fears harming it. They won't allow them to enter a house where women selling alcohol will give rise to defiled thoughts.",
        "source": "T33n1702_003:0190a04_27"
    },
    {
        "source_sentence": "佛入者表威德勝也。",
        "translation": "The Buddha's entry shows the superiority of his authoritative qualities.",
        "source": "T33n1702_003:0190a05_28"
    },
    {
        "source_sentence": "息凡夫等者。",
        "translation": "He stops worldlings and so forth.",
        "source": "T33n1702_003:0190a06_29"
    },
    {
        "source_sentence": "謂恐憎此愛彼故。",
        "translation": "It's because they're afraid of hating this and craving that.",
        "source": "T33n1702_003:0190a06_30"
    },
    {
        "source_sentence": "破一乘分別者。",
        "translation": "He who refutes the distinction between the One Vehicle.",
        "source": "T33n1702_003:0190a07_31"
    },
    {
        "source_sentence": "謂迦葉捨富從貧乞，意令生福。",
        "translation": "It means that Kāśyapa abandons wealth and begs from the poor, intending to produce merit.",
        "source": "T33n1702_003:0190a07_32"
    },
    {
        "source_sentence": "須菩提捨貧從富乞，不欲惱他云云。",
        "translation": "Suppository abandons the poor and begs from the rich, doesn't want to disturb others, and says.",
        "source": "T33n1702_003:0190a08_33"
    },
    {
        "source_sentence": "二人所見互有是非，如來異此，是非一貫也。",
        "translation": "What they see is right and wrong in each other, but the Tathāgata differs from this, which is consistent with right and wrong.",
        "source": "T33n1702_003:0190a08_34"
    },
    {
        "source_sentence": "然上五中，初、大智、二、大悲、三、顯德、四、息凡、五、破小。",
        "translation": "Of the five above-mentioned, however, the first is great wisdom, the second great compassion, the third reveals virtue, the fourth calms the worldling, and the fifth refutes the lesser.",
        "source": "T33n1702_003:0190a09_35"
    },
    {
        "source_sentence": "七、化終。",
        "translation": "7. at the end of his transformation.",
        "source": "T33n1702_003:0190a11_0"
    },
    {
        "source_sentence": "然已等者。",
        "translation": "Still, it's the same.",
        "source": "T33n1702_003:0190a11_1"
    },
    {
        "source_sentence": "和會字之句義也。",
        "translation": "It's also the meaning of the word harmony in terms of phrases.",
        "source": "T33n1702_003:0190a11_2"
    },
    {
        "source_sentence": "今讀則從文，釋則從義。",
        "translation": "Now, when we read it, we follow the text, and when we explain it, we follow its meaning.",
        "source": "T33n1702_003:0190a11_3"
    },
    {
        "source_sentence": "若廣下。",
        "translation": "If it's extensive, it follows.",
        "source": "T33n1702_003:0190a12_4"
    },
    {
        "source_sentence": "權加數字，顯文義兼暢也。",
        "translation": "The authoritative numbers are added to show that the text and its meaning are both extensive.",
        "source": "T33n1702_003:0190a12_5"
    },
    {
        "source_sentence": "飯即喫也。",
        "translation": "The rice is food that's eaten.",
        "source": "T33n1702_003:0190a13_6"
    },
    {
        "source_sentence": "《論語》云「飯疏食。」",
        "translation": "The treatise says, Rice and food are included in the commentary.",
        "source": "T33n1702_003:0190a13_7"
    },
    {
        "source_sentence": "佛苦下。",
        "translation": "It's below the Buddha's suffering.",
        "source": "T33n1702_003:0190a13_8"
    },
    {
        "source_sentence": "通伏難。",
        "translation": "He's able to overcome difficulties.",
        "source": "T33n1702_003:0190a13_9"
    },
    {
        "source_sentence": "應先難云：「前引《纓絡女經》言不食，今經何以言食？」",
        "translation": "You should first make a difficult commentary, saying, Why did the previous quote from the Sutra on the Cakravartin Woman say it doesn't eat, and why does the present sūtra say it eats?",
        "source": "T33n1702_003:0190a14_10"
    },
    {
        "source_sentence": "故此釋也。",
        "translation": "That's why this explanation is so.",
        "source": "T33n1702_003:0190a15_11"
    },
    {
        "source_sentence": "有說：「食欲至口，有威德天在側，隱形接至他方施作佛事，斯則示現而食，",
        "translation": "Some say: When the food is about to reach your mouth, a mighty god appears at your side. He approaches you in seclusion and goes to another place to perform buddha-works.",
        "source": "T33n1702_003:0190a15_12"
    },
    {
        "source_sentence": "非真食也。」",
        "translation": "It's not true food.",
        "source": "T33n1702_003:0190a17_13"
    },
    {
        "source_sentence": "由是彼此皆不相違。",
        "translation": "Because of this, they aren't at odds with each other.",
        "source": "T33n1702_003:0190a17_14"
    },
    {
        "source_sentence": "寶雲下。",
        "translation": "It's beneath the jeweled cloud.",
        "source": "T33n1702_003:0190a17_15"
    },
    {
        "source_sentence": "顯齋儀也。",
        "translation": "It also shows the rituals for purification.",
        "source": "T33n1702_003:0190a17_16"
    },
    {
        "source_sentence": "此四事中，前二云擬、後二不云者，以梵行貧病來則與之，不來自食，",
        "translation": "Of these four things, the first two are said to be desired and the last two aren’t. Because religious practitioners are poor and ill, they give it to them and don’t go out to eat.",
        "source": "T33n1702_003:0190a18_17"
    },
    {
        "source_sentence": "後二不然，故不云耳。",
        "translation": "The last two are not the same, so it's not called that.",
        "source": "T33n1702_003:0190a19_18"
    },
    {
        "source_sentence": "《十二頭陀經》除梵行者，以自乞故，故不分之。",
        "translation": "The twelve ascetic scriptures except for religious practitioners, which are not separated because they ask for them on their own.",
        "source": "T33n1702_003:0190a20_19"
    },
    {
        "source_sentence": "疏定者。",
        "translation": "Commentary on the Concentration.",
        "source": "T33n1702_003:0190a21_20"
    },
    {
        "source_sentence": "於中三節，如疏云云。",
        "translation": "These three sections are as the commentary says in the commentary.",
        "source": "T33n1702_003:0190a21_21"
    },
    {
        "source_sentence": "疏併資緣者。",
        "translation": "The commentary combines the causes and conditions.",
        "source": "T33n1702_003:0190a21_22"
    },
    {
        "source_sentence": "此釋經中收衣鉢也。",
        "translation": "This explains that the sūtra contains the collection of robes and bowls.",
        "source": "T33n1702_003:0190a22_23"
    },
    {
        "source_sentence": "飯食兩字如前所解。",
        "translation": "The two words rice and food are as explained above.",
        "source": "T33n1702_003:0190a22_24"
    },
    {
        "source_sentence": "訖了畢也。",
        "translation": "It's finished.",
        "source": "T33n1702_003:0190a23_0"
    },
    {
        "source_sentence": "須併資緣者。",
        "translation": "They must be combined with the condition of accumulation.",
        "source": "T33n1702_003:0190a23_1"
    },
    {
        "source_sentence": "以修定時具於五緣。",
        "translation": "It's because the five conditions are present when cultivating concentration.",
        "source": "T33n1702_003:0190a23_2"
    },
    {
        "source_sentence": "謂：閑居靜處、息諸緣務等。",
        "translation": "They are: leisurely living in a quiet place, resting from conditions and duties, etc.",
        "source": "T33n1702_003:0190a24_0"
    },
    {
        "source_sentence": "佛雖至聖諸習都無，實於衣鉢不生勞慮，若不併除，後人倣效無由得定。",
        "translation": "Even though the Buddha has no habits at all, he really doesn't give rise to troubled thoughts about clothing and bowls, and if he doesn't remove them together, there's no way for later generations to follow suit and attain concentration.",
        "source": "T33n1702_003:0190a24_1"
    },
    {
        "source_sentence": "以佛是教主，凡有所作人皆效學，故云示現為後軌也。",
        "translation": "Because the Buddha is the master of the teaching, all people who do anything are trained, so it's called showing up as a subsequent guideline.",
        "source": "T33n1702_003:0190a26_2"
    },
    {
        "source_sentence": "疏淨身業等者。",
        "translation": "Commentary on the Pure Body Actions and so forth.",
        "source": "T33n1702_003:0190a27_3"
    },
    {
        "source_sentence": "此釋經中洗足已三字。",
        "translation": "This is an explanation of the three words in the sūtras that have washed their feet.",
        "source": "T33n1702_003:0190a27_4"
    },
    {
        "source_sentence": "阿含下。",
        "translation": "It's below the Āgamas.",
        "source": "T33n1702_003:0190a28_5"
    },
    {
        "source_sentence": "牒難也。",
        "translation": "It's an explanation of the difficulty.",
        "source": "T33n1702_003:0190a28_6"
    },
    {
        "source_sentence": "又如佛三十二相中有皮膚塵不染相，今何用洗耶？",
        "translation": "Also, it's like the Buddha's thirty-two marks in which there are skin and dust that aren't defiled, so why would you need to wash them now?",
        "source": "T33n1702_003:0190a28_7"
    },
    {
        "source_sentence": "示現下。",
        "translation": "It's shown below.",
        "source": "T33n1702_003:0190a29_8"
    },
    {
        "source_sentence": "釋通也。",
        "translation": "It's also explained that it's shared.",
        "source": "T33n1702_003:0190b01_9"
    },
    {
        "source_sentence": "此有三意。",
        "translation": "These have three meanings.",
        "source": "T33n1702_003:0190b01_10"
    },
    {
        "source_sentence": "一、順世故，夫人外歸必恐塵染，故須洗足，佛順亦爾也。",
        "translation": "1. Because it's compliant with the world, a woman who returns outwardly will be afraid of being stained by dust, so she must wash her feet; so is Buddha-compliance.",
        "source": "T33n1702_003:0190b01_11"
    },
    {
        "source_sentence": "二、表法故，洗去煩惱垢染，顯得清淨法身也。",
        "translation": "2. because it shows the Dharma, it washes away the defilements and stains of affliction and reveals the pure Dharma body.",
        "source": "T33n1702_003:0190b02_12"
    },
    {
        "source_sentence": "三、為後軌者，如資緣說。",
        "translation": "3. For the latter, it's as explained in the context of accumulation.",
        "source": "T33n1702_003:0190b03_13"
    },
    {
        "source_sentence": "疏正入定者。",
        "translation": "The commentary correctly enters concentration.",
        "source": "T33n1702_003:0190b04_14"
    },
    {
        "source_sentence": "此釋經中敷座而坐也。",
        "translation": "This explains that he spreads out his seat in the sutra and sits there.",
        "source": "T33n1702_003:0190b04_15"
    },
    {
        "source_sentence": "沈掉等者。",
        "translation": "He's torpor and so forth.",
        "source": "T33n1702_003:0190b05_16"
    },
    {
        "source_sentence": "沈謂昏沈，能引睡眠障定增故。",
        "translation": "Silentness means torpor, because it can cause the obstacle of sleep to increase in concentration.",
        "source": "T33n1702_003:0190b05_17"
    },
    {
        "source_sentence": "掉謂掉舉，任運攀緣能引散亂亦障定心。",
        "translation": "agitation refers to agitation. It is freely clinging, able to attract distraction and also hindering the state of absorption.",
        "source": "T33n1702_003:0190b06_0"
    },
    {
        "source_sentence": "又於四儀中，以臥則昏沈，行則掉舉，住則疲倦，唯坐為勝，故不沈掉。",
        "translation": "Also, among the four modes of comportment, when lying down one is torpor-stricken; when walking one is agitated; and while standing one is exhausted. Because only sitting is predominant, no torpor or agitation occurs.",
        "source": "T33n1702_003:0190b06_1"
    },
    {
        "source_sentence": "然昏沈掉舉，蓋是凡夫，若據如來的無此事，今垂軌則蓋為後人。",
        "translation": "However, it's because they're deluded and agitated, which are ordinary people. If they follow the Tathāgata without this thing, then they'll be those who follow the example of later generations.",
        "source": "T33n1702_003:0190b08_2"
    },
    {
        "source_sentence": "或曰：「經中但言敷座，焉知入定耶？」",
        "translation": "Or they might say, Does the sūtra only speak of spreading out a seat, so how could you know that you're entering concentration?",
        "source": "T33n1702_003:0190b09_3"
    },
    {
        "source_sentence": "故次釋云魏譯等則知入定也。",
        "translation": "That's why the next explanation says that the Wei translation and so forth are known to enter concentration.",
        "source": "T33n1702_003:0190b10_4"
    },
    {
        "source_sentence": "如常敷座等者。",
        "translation": "Suppose someone always spreads out a seat and so forth.",
        "source": "T33n1702_003:0190b11_5"
    },
    {
        "source_sentence": "謂如來每會說般若，皆自敷座具，為般若出生諸佛即是佛母，表敬般若，",
        "translation": "Every time the Tathāgata preached the Perfection of Wisdom to the assembly, he spread out his own seat mat for it. The buddhas who are born in the company of these buddhas are the mothers of the Buddha and express their reverence toward perfect wisdom.",
        "source": "T33n1702_003:0190b11_6"
    },
    {
        "source_sentence": "故自敷座。",
        "translation": "That's why he spread out his own seat.",
        "source": "T33n1702_003:0190b13_7"
    },
    {
        "source_sentence": "已說八會，此當第九，儀軌不易故曰如常。",
        "translation": "The eight assemblies have already been spoken of. This should be the ninth:",
        "source": "T33n1702_003:0190b13_8"
    },
    {
        "source_sentence": "趺謂足背，加謂以一足壓一足，結即兩足不散表吉祥。",
        "translation": "Biceps refers to the back of the feet, and plus means pressing a foot with one foot against another foot; fetters are two feet that don't disperse to show auspiciousness.",
        "source": "T33n1702_003:0190b14_9"
    },
    {
        "source_sentence": "故《智論》云：「見畫加趺坐，魔王尚驚懼，何況入道人，端身不傾動。」",
        "translation": "That's why the Zhilun says, Seeing a painted image sitting cross-legged, the king of Māra is still frightened, so why wouldn't he enter the path when his body doesn't tilt?",
        "source": "T33n1702_003:0190b15_10"
    },
    {
        "source_sentence": "又為正觀五種因緣，是故結加趺坐。",
        "translation": "Also, for the sake of correctly observing five kinds of causes and conditions, he therefore sat cross-legged.",
        "source": "T33n1702_003:0190b17_11"
    },
    {
        "source_sentence": "一、由身攝歛速發輕安，最為勝故。",
        "translation": "1. It's because the body collects and quickly gives rise to lightness, which is the most superior.",
        "source": "T33n1702_003:0190b18_12"
    },
    {
        "source_sentence": "二、由此宴坐能經時久，不令身速疲極故。",
        "translation": "2. Because this meditation can be prolonged for a long time, it doesn't cause the body to quickly become exhausted.",
        "source": "T33n1702_003:0190b18_13"
    },
    {
        "source_sentence": "三、由此宴坐是不共法，外道他論皆無有故。",
        "translation": "3. It's because this meditation is an extraordinary dharma that's not shared by non-Buddhists and others, and there's nothing to discuss.",
        "source": "T33n1702_003:0190b19_14"
    },
    {
        "source_sentence": "四、由此宴坐形相端嚴，令他見已極敬信故。",
        "translation": "4. It's because the form and characteristics of this meditation seat are so dignified that they cause others to see them with great respect and faith.",
        "source": "T33n1702_003:0190b20_15"
    },
    {
        "source_sentence": "五、由此宴坐佛佛弟子共所開許，一切賢聖所稱讚故。",
        "translation": "5. Because this is the shared approval of the Buddha and Buddha's disciples who are sitting in meditation, it's praised by all the good men and sages.",
        "source": "T33n1702_003:0190b21_16"
    },
    {
        "source_sentence": "正觀五種因緣，是故應當結加趺坐。",
        "translation": "He correctly observes five kinds of causes and conditions, so he should sit cross-legged.",
        "source": "T33n1702_003:0190b23_0"
    },
    {
        "source_sentence": "端身住者，不低不昂、不左右傾側也。",
        "translation": "Someone who stands upright doesn't stoop, doesn't rise, and doesn't lean to either side.",
        "source": "T33n1702_003:0190b23_1"
    },
    {
        "source_sentence": "正念者，如理而念名為正念。",
        "translation": "Right mindfulness is right mindfulness that's correctly mindful and called right mindfulness.",
        "source": "T33n1702_003:0190b24_2"
    },
    {
        "source_sentence": "念即念慧，謂離沈掉有無等。",
        "translation": "Mindfulness is the wisdom of mindfulness. Being free from torpor and agitation, there is none equal to it.",
        "source": "T33n1702_003:0190b25_3"
    },
    {
        "source_sentence": "不動謂不動於正念也。",
        "translation": "Immovable means immovable in right mindfulness.",
        "source": "T33n1702_003:0190b25_4"
    },
    {
        "source_sentence": "唐譯下。",
        "translation": "The Tang translation follows.",
        "source": "T33n1702_003:0190b26_5"
    },
    {
        "source_sentence": "亦證同上義。",
        "translation": "It also realizes the same meaning as the above.",
        "source": "T33n1702_003:0190b26_6"
    },
    {
        "source_sentence": "正願者即正念也。",
        "translation": "The right vow is right mindfulness.",
        "source": "T33n1702_003:0190b26_7"
    },
    {
        "source_sentence": "若別說者願是希欲，謂希欲住對面念。",
        "translation": "When it is spoken of separately, the vow is attachment to sensual desire: abiding in opposite-mindfulness awarenesses with attachment to sensual desire.",
        "source": "T33n1702_003:0190b27_8"
    },
    {
        "source_sentence": "念是所願也。",
        "translation": "Mindfulness is the vow.",
        "source": "T33n1702_003:0190b28_9"
    },
    {
        "source_sentence": "然在定前異，此則非正願也。",
        "translation": "However, it's different before the concentration, which is not the right vow.",
        "source": "T33n1702_003:0190b28_10"
    },
    {
        "source_sentence": "住對面念者。",
        "translation": "He who abides in mindfulness of facing each other.",
        "source": "T33n1702_003:0190b29_11"
    },
    {
        "source_sentence": "面即是喻，念即是法，住對兩字通於法喻。",
        "translation": "Face is the metaphor, mindfulness is the dharma, and abiding is the opposite of both words that penetrate the dharma metaphor.",
        "source": "T33n1702_003:0190b29_12"
    },
    {
        "source_sentence": "今法喻之中各闕一事，謂法闕所照理，喻闕能照鏡，鏡對面住面則自彰，",
        "translation": "There is one thing missing in each of the doctrines and metaphors. That is to say, the doctrine is lacking in that which illuminates reason. The metaphor is lacking in that which illuminates the mirror. When the mirror is face-to-face with respect to the mirror, it stands facing each other and expresses itself [in this way].",
        "source": "T33n1702_003:0190c01_13"
    },
    {
        "source_sentence": "念對理住理則自現。",
        "translation": "When mindfulness is directed toward the principle and abiding in the principle, it's self-manifest.",
        "source": "T33n1702_003:0190c03_0"
    },
    {
        "source_sentence": "法喻闕者文影略故。",
        "translation": "The Dharma metaphor is missing because the text and shadow are abbreviated.",
        "source": "T33n1702_003:0190c03_1"
    },
    {
        "source_sentence": "或可不爾，但理觀分明，如面目覩現量，即水喻亦得。",
        "translation": "Or maybe it's not like that, but the principle and contemplation are clearly delineated, just as the surface of the face and eyes are roughly measured, which means the water metaphor can also be obtained.",
        "source": "T33n1702_003:0190c03_2"
    },
    {
        "source_sentence": "無著下。",
        "translation": "It's below the level of no attachment.",
        "source": "T33n1702_003:0190c05_3"
    },
    {
        "source_sentence": "顯入定意。",
        "translation": "It shows the intention to enter concentration.",
        "source": "T33n1702_003:0190c05_4"
    },
    {
        "source_sentence": "先牒難，併緣入定，意在於何？",
        "translation": "First, we'll explain the difficulty, which is that it's combined with the condition of entering concentration. What does it mean?",
        "source": "T33n1702_003:0190c05_5"
    },
    {
        "source_sentence": "於此下。",
        "translation": "Here, it follows here.",
        "source": "T33n1702_003:0190c06_6"
    },
    {
        "source_sentence": "釋通。",
        "translation": "He explains that it's shared.",
        "source": "T33n1702_003:0190c06_7"
    },
    {
        "source_sentence": "於此者論云於法也。",
        "translation": "Here, the treatise says it's about the teaching.",
        "source": "T33n1702_003:0190c06_8"
    },
    {
        "source_sentence": "能覺者定通，能說者說通也。",
        "translation": "Those who can perceive are definitely penetrating, and those who can teach are said to be penetrating.",
        "source": "T33n1702_003:0190c06_9"
    },
    {
        "source_sentence": "意云定通方得說通，以散心說法不能如實，從定發言必有當也。",
        "translation": "It means that it's only when concentration is shared that it can be explained as shared, and teaching with a distracted mind that it can't be taught as it really is, so there must be a right to speak from concentration.",
        "source": "T33n1702_003:0190c07_10"
    },
    {
        "source_sentence": "故下文云：云何為人演說不取於相如如不動？",
        "translation": "That's why the following sentence says, How can we explain for others that we don't grasp characteristics as such and thus without moving?",
        "source": "T33n1702_003:0190c09_11"
    },
    {
        "source_sentence": "諸經之中每欲說法皆先入定，意皆如此云云。",
        "translation": "In all the sutras, whenever they want to teach the Dharma, they first enter concentration, and their meaning is like this.",
        "source": "T33n1702_003:0190c10_12"
    },
    {
        "source_sentence": "斯亦示現為後軌也。",
        "translation": "This is also shown as a subsequent guideline.",
        "source": "T33n1702_003:0190c11_13"
    },
    {
        "source_sentence": "若準如來，言念何失，是故論云顯示等也。",
        "translation": "If we refer to the Tathāgata, what's wrong with words and thoughts? That's why the treatise says it's called showing and so forth.",
        "source": "T33n1702_003:0190c11_14"
    },
    {
        "source_sentence": "疏然大下。",
        "translation": "The commentary follows, however, the great one.",
        "source": "T33n1702_003:0190c12_15"
    },
    {
        "source_sentence": "二、通前表法釋二初、約大雲廣辨三初、標大聖即佛，體周法界曰大，",
        "translation": "Second, it's a general explanation of the first two interpretations of the prior teachings. First, it's a broad explanation of the three parts in terms of the great cloud. The first part labels the great sage as Buddha, whose essence pervades the Dharma realm and is called great.",
        "source": "T33n1702_003:0190c12_16"
    },
    {
        "source_sentence": "智鑒無昧曰聖。",
        "translation": "Zhijian's ignorance is called noble.",
        "source": "T33n1702_003:0190c14_17"
    },
    {
        "source_sentence": "現跡者。",
        "translation": "Those who show their traces...",
        "source": "T33n1702_003:0190c14_18"
    },
    {
        "source_sentence": "所現之化跡也。",
        "translation": "It's the trace of the transformation that's manifested.",
        "source": "T33n1702_003:0190c14_19"
    },
    {
        "source_sentence": "所表者，諸佛所為必不率爾，皆以事相表內身心。",
        "translation": "What's expressed means that what the buddhas do mustn't be like this, and they all express their bodies and minds internally by things.",
        "source": "T33n1702_003:0190c15_20"
    },
    {
        "source_sentence": "如說《如來藏經》舉身放光，光中現華，華萎見佛。",
        "translation": "As it's said in the Tathāgatagarbha Sutra, he raises his body and emits light, which shows flowers in its light and withers to see the Buddha.",
        "source": "T33n1702_003:0190c16_21"
    },
    {
        "source_sentence": "遂阿難問佛，佛為說之。",
        "translation": "Ānanda then asked the Buddha, and he explained it for him.",
        "source": "T33n1702_003:0190c17_22"
    },
    {
        "source_sentence": "如《華嚴》中說：「佛菩薩說天說雲須彌山大海等」，皆有所表。",
        "translation": "As it's said in the Flower Ornament, The Buddha and bodhisattvas teach that the gods teach clouds, Sumeru, mountains, oceans, and so forth, all have expressions.",
        "source": "T33n1702_003:0190c17_23"
    },
    {
        "source_sentence": "斯皆事相為能表，法為所表，以不徒然，故云必也。",
        "translation": "These are all things and characteristics that can be expressed, and dharmas that are expressed because they aren't in vain, so it's called certain.",
        "source": "T33n1702_003:0190c19_24"
    },
    {
        "source_sentence": "疏表本覺下。",
        "translation": "The commentary shows that it's below the level of original awakening.",
        "source": "T33n1702_003:0190c20_25"
    },
    {
        "source_sentence": "二、釋二初、表通序本覺佛對化佛說：五蘊都對舍衛國，化身佛在舍衛國，",
        "translation": "Second, he explains that the first of the two is to show that the originally enlightened Buddha spoke to the transformed Buddha in a general way: The five aggregates all oppose Śrāvastī, and the transformation body Buddha is in Śrāvastī.",
        "source": "T33n1702_003:0190c20_26"
    },
    {
        "source_sentence": "表本覺佛在五蘊城。",
        "translation": "It shows that the originally enlightened Buddha was in the city of the five aggregates.",
        "source": "T33n1702_003:0190c22_27"
    },
    {
        "source_sentence": "城中既人物相兼，蘊內亦色心具足。",
        "translation": "Since the people in the city are combined, form and mind are also present within the aggregates.",
        "source": "T33n1702_003:0190c22_28"
    },
    {
        "source_sentence": "覺魔等對戰勝也。",
        "translation": "He's superior to the Māra of enlightenment and so forth in terms of fighting.",
        "source": "T33n1702_003:0190c23_29"
    },
    {
        "source_sentence": "梵音魔羅此云殺者，能殺行人慧命故也。",
        "translation": "The Sanskrit word Māra is called killing because it kills the practitioner's wisdom and life.",
        "source": "T33n1702_003:0190c24_0"
    },
    {
        "source_sentence": "然有四種：一、天魔，即欲界主，二、煩惱魔，三、陰魔，四、死魔。",
        "translation": "However, there are four kinds: 1. the demon of heaven, which is the lord of the desire realm; 2. the demon of affliction; 3. the demon of aggregates; and 4. the demon of death.",
        "source": "T33n1702_003:0190c24_1"
    },
    {
        "source_sentence": "今言覺空者，如《心經》云：「照見五蘊皆空，無無明，乃至亦無老死盡」也。",
        "translation": "Now, we'll say that the perception of emptiness is as the mind sūtra says, Observing that the five aggregates are all empty, there's no ignorance, and there's no old age or death.",
        "source": "T33n1702_003:0190c26_2"
    },
    {
        "source_sentence": "照五蘊空即破陰魔，無無明盡破煩惱魔，乃至無老死即破死魔。",
        "translation": "To illuminate the emptiness of the five aggregates is to destroy the demon of the aggregates, the demon of ignorance is to end the demon of afflictions, and the demon of old age and death is to destroy the demon of death.",
        "source": "T33n1702_003:0190c27_3"
    },
    {
        "source_sentence": "餘出世法尚空，況天魔耶。",
        "translation": "The rest of the supramundane dharmas are still empty, so why wouldn't gods and Māra?",
        "source": "T33n1702_003:0190c29_4"
    },
    {
        "source_sentence": "照心識具德者，對給孤獨也。",
        "translation": "Those who illuminate the mind and consciousness with virtue are given to be alone.",
        "source": "T33n1702_003:0190c29_5"
    },
    {
        "source_sentence": "上迷本覺之父曰孤，下隱妙用之子曰獨。",
        "translation": "The above-mentioned man who lost his original enlightenment was called Anāthapiṇḍika, and the below-mentioned one who lived in seclusion with marvelous functions was called Anāthapiṇḍika.",
        "source": "T33n1702_003:0191a01_6"
    },
    {
        "source_sentence": "今照性本具塵沙功德無所乏少，即給孤獨也。",
        "translation": "Now, the nature of illumination is originally endowed with the merits of dust and sand without lack, which means it's given to someone who's alone.",
        "source": "T33n1702_003:0191a02_7"
    },
    {
        "source_sentence": "求法等，對比丘乞士義也。",
        "translation": "Seeking the Dharma and so forth is the meaning of begging a monk to a beggar.",
        "source": "T33n1702_003:0191a03_8"
    },
    {
        "source_sentence": "外則乞食養命，內則求法資神。",
        "translation": "On the outside, they beg for food to nourish their lives, and on the inside they seek the Dharma treasure spirit.",
        "source": "T33n1702_003:0191a04_0"
    },
    {
        "source_sentence": "覺心下。",
        "translation": "It's below the mind of awakening.",
        "source": "T33n1702_003:0191a04_1"
    },
    {
        "source_sentence": "二、表別序覺心等者，對入舍衛大城也。",
        "translation": "The second is to show the distinctive preface of the mind of awakening and so forth, which is to enter the great city of Śrāvastī.",
        "source": "T33n1702_003:0191a04_2"
    },
    {
        "source_sentence": "應云：覺心既發寧棄塵勞，如來出世寧棄群品。",
        "translation": "It should be said that once the mind of awakening arises, it's better to abandon worldly sufferings, and when the Tathāgata appears in the world, it's better to abandon all classes.",
        "source": "T33n1702_003:0191a05_3"
    },
    {
        "source_sentence": "將欲遍觀遂入識藏，將欲教化遂入王城。",
        "translation": "When he was about to pervasively observe it, he entered the store of consciousness, and when he was about to teach it, he entered the king's city.",
        "source": "T33n1702_003:0191a06_4"
    },
    {
        "source_sentence": "離城邑而教化誰人，離心識而觀察何事。",
        "translation": "Who will be taught and who will be transformed apart from cities? What will be observed apart from mind and consciousness?",
        "source": "T33n1702_003:0191a07_5"
    },
    {
        "source_sentence": "心心數法等者，對於其城中次第乞已也。",
        "translation": "The mind and mental factors, such as the number of dharmas, are begging for them in order in their city.",
        "source": "T33n1702_003:0191a08_6"
    },
    {
        "source_sentence": "乞食不揀貧之與富，觀察豈擇心所心王。",
        "translation": "He begs for food and doesn't choose between the poor and the rich, but observes whether he chooses the mind and mental factors that are the king of mind.",
        "source": "T33n1702_003:0191a09_7"
    },
    {
        "source_sentence": "即妄下二句，對乞得食也。",
        "translation": "These are the two phrases below delusion, which are to beg for food.",
        "source": "T33n1702_003:0191a10_8"
    },
    {
        "source_sentence": "外化人而得食，內觀法而生喜。",
        "translation": "Outwardly they transform people and obtain food, and internally they contemplate the Dharma and become joyous.",
        "source": "T33n1702_003:0191a11_9"
    },
    {
        "source_sentence": "法喜下二句，對還至本處飯食也。",
        "translation": "The next two phrases under joy of the Dharma contrast with returning to one's original place and eating rice.",
        "source": "T33n1702_003:0191a11_10"
    },
    {
        "source_sentence": "食能資身、法能益心也。",
        "translation": "Food can support the body, and dharmas can benefit the mind.",
        "source": "T33n1702_003:0191a12_11"
    },
    {
        "source_sentence": "思惟假緣對著衣持鉢，忘緣符真對收衣鉢也。",
        "translation": "He contemplates that the provisional condition is to put on his robe and carry his bowl in front of him, forgetting the condition as a talisman to collect his robe and bowl in front of him.",
        "source": "T33n1702_003:0191a13_12"
    },
    {
        "source_sentence": "乞食既須衣鉢，思惟要假因緣，入定既併資緣，契理須忘念慮。",
        "translation": "Since begging for food requires clothing and bowls, it's necessary to contemplate the provisional causes and conditions as a condition, and since entering concentration combines both necessities and conditions, it's appropriate to forget about mindfulness.",
        "source": "T33n1702_003:0191a14_13"
    },
    {
        "source_sentence": "觀照下二句，對洗足也。",
        "translation": "The next two phrases below Avalokitêśvara are for washing your feet.",
        "source": "T33n1702_003:0191a15_14"
    },
    {
        "source_sentence": "若欲安坐必須洗去足塵，若欲還源必須拂除心念。",
        "translation": "If he wants to sit peacefully, he must wash away the dust of his feet and dirt, and if he wants to return to the source, he must wipe off his thoughts.",
        "source": "T33n1702_003:0191a16_15"
    },
    {
        "source_sentence": "返本下二句，對敷座而坐也。",
        "translation": "He returned to the original text and sat cross-legged on his seat in two phrases below.",
        "source": "T33n1702_003:0191a17_16"
    },
    {
        "source_sentence": "法空即敷座，心寂即而坐，敷座方堪人坐，法空心始得寂。",
        "translation": "Ākāśyapa then spread out his seat, and the mind becomes quiescent as soon as he sits there. He spreads his seat so that people can sit there. Ākāśyapa then attained quiescence in his mind.",
        "source": "T33n1702_003:0191a18_0"
    },
    {
        "source_sentence": "心寂下二句，對正宗法也。",
        "translation": "The next two phrases below mind quiescence are contrastive with the teaching of the correct doctrine.",
        "source": "T33n1702_003:0191a19_1"
    },
    {
        "source_sentence": "謂安坐始能說經，心寂方彰妙慧也。",
        "translation": "It means that it's when he's seated in meditation that he can teach the sūtras, and only when his mind is quiescent does he reveal his marvelous wisdom.",
        "source": "T33n1702_003:0191a19_2"
    },
    {
        "source_sentence": "疏欲談下。",
        "translation": "The commentary is below the point of wanting to discuss.",
        "source": "T33n1702_003:0191a20_3"
    },
    {
        "source_sentence": "三、結也。",
        "translation": "3. it's also a fetter.",
        "source": "T33n1702_003:0191a20_4"
    },
    {
        "source_sentence": "資聖下。",
        "translation": "It's below the level of endowment for sages.",
        "source": "T33n1702_003:0191a21_5"
    },
    {
        "source_sentence": "二、引資聖略明。",
        "translation": "Second, it's briefly explained by citing the noble ones.",
        "source": "T33n1702_003:0191a21_6"
    },
    {
        "source_sentence": "即道液法師疏也。",
        "translation": "It's the commentary of the Daoist master Daosun.",
        "source": "T33n1702_003:0191a21_7"
    },
    {
        "source_sentence": "今摘而用之，文不全取。",
        "translation": "Now, we'll remove it and use it, but the text doesn't fully grasp it.",
        "source": "T33n1702_003:0191a22_8"
    },
    {
        "source_sentence": "於中二一、正明身有二者，通論生佛也，偽者色身、真即法身。",
        "translation": "Among these two, the first and correctly explain that there are two kinds of bodies, which are discussed in terms of birth as buddhas, hypocrisy is the form body and truth is the Dharma body.",
        "source": "T33n1702_003:0191a22_9"
    },
    {
        "source_sentence": "五蘊等者。",
        "translation": "The five aggregates and so forth.",
        "source": "T33n1702_003:0191a23_10"
    },
    {
        "source_sentence": "謂衣以外覆、食以內資，生則雖因父母，存即須假衣食。",
        "translation": "It means that outside of clothing, coverings and food are used as internal necessities, and although birth is the result of parents, it's necessary to make provisions for clothing and food if they exist.",
        "source": "T33n1702_003:0191a24_11"
    },
    {
        "source_sentence": "法身等者。",
        "translation": "The Dharma body and so forth.",
        "source": "T33n1702_003:0191a25_12"
    },
    {
        "source_sentence": "謂非生因之所生，但了因之所了。",
        "translation": "It means that it's not produced by the cause of arising but comprehended by the cause of understanding.",
        "source": "T33n1702_003:0191a25_13"
    },
    {
        "source_sentence": "由是色身以食為命，法身以慧為命。",
        "translation": "Consequently, the material body has food as its life and the Dharma body wisdom as its life.",
        "source": "T33n1702_003:0191a26_14"
    },
    {
        "source_sentence": "保偽謂執妄合塵，遺真謂迷理背覺。",
        "translation": "Preservation of counterfeit means to cling to delusion and combine it with dust, while the remaining truth means to be confused about principles and turn away from enlightenment.",
        "source": "T33n1702_003:0191a27_15"
    },
    {
        "source_sentence": "此皆倒也。",
        "translation": "These are all mistaken.",
        "source": "T33n1702_003:0191a28_16"
    },
    {
        "source_sentence": "養真謂悟理合覺，棄偽謂達妄背塵也。",
        "translation": "True nourishment means awakening to the principle and uniting it with awakening, and abandoning falsehood means understanding what's false and turning away from the dust.",
        "source": "T33n1702_003:0191a28_17"
    },
    {
        "source_sentence": "群生下。",
        "translation": "It's below the level of sentient beings.",
        "source": "T33n1702_003:0191a29_18"
    },
    {
        "source_sentence": "牒前倒者也。",
        "translation": "This is an explanation of the previous mistake.",
        "source": "T33n1702_003:0191a29_19"
    },
    {
        "source_sentence": "我乃下。",
        "translation": "I then went down.",
        "source": "T33n1702_003:0191a29_20"
    },
    {
        "source_sentence": "示現入城乞食以表法也。",
        "translation": "He shows that he's entered the city to solicit alms to show the Dharma.",
        "source": "T33n1702_003:0191a29_21"
    },
    {
        "source_sentence": "意令求般若照成法身，故云引真也。",
        "translation": "The intention is to cause the pursuit of prajñā to illuminate the Dharma body, so it's called citing the truth.",
        "source": "T33n1702_003:0191b01_22"
    },
    {
        "source_sentence": "故託下。",
        "translation": "Therefore, it's entrusted to the following.",
        "source": "T33n1702_003:0191b02_23"
    },
    {
        "source_sentence": "都結表法之意。",
        "translation": "They all conclude with the meaning of expressing the teaching.",
        "source": "T33n1702_003:0191b02_24"
    },
    {
        "source_sentence": "謂示現乞食，意在說法耳。",
        "translation": "It means to show that he's begging for food and wants to teach the Dharma.",
        "source": "T33n1702_003:0191b02_25"
    },
    {
        "source_sentence": "疏涅槃下。",
        "translation": "It's below the commentary on nirvāṇa.",
        "source": "T33n1702_003:0191b03_26"
    },
    {
        "source_sentence": "二、引證。",
        "translation": "2. citing and realizing.",
        "source": "T33n1702_003:0191b03_27"
    },
    {
        "source_sentence": "但證法為食義也。",
        "translation": "It's simply the meaning of realizing the teaching as food.",
        "source": "T33n1702_003:0191b03_28"
    },
    {
        "source_sentence": "正宗中疏二。",
        "translation": "There are two commentaries in the main doctrine.",
        "source": "T33n1702_003:0191b04_29"
    },
    {
        "source_sentence": "初、標章門以一卷經文二論解釋，大雲、青龍皆二論並行。",
        "translation": "First, the chapter on labeling explains the two treatises in a single volume of sūtras and texts with two treatises, and the great cloud and the blue dragon all have two treatises that are practiced together.",
        "source": "T33n1702_003:0191b04_30"
    },
    {
        "source_sentence": "今即不爾。",
        "translation": "That's not the case now.",
        "source": "T33n1702_003:0191b05_31"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T33n1702_003:0191b06_0"
    },
    {
        "source_sentence": "以無著配十八住處，天親斷二十七疑，旨趣既殊，科段亦異，或一疑中有四住五住，",
        "translation": "Because nonattachment is associated with the eighteen abodes, gods personally eliminate twenty-seven doubts, and because their meanings and destinies are different, the categories and sections are also different. Sometimes there are four abodes and five abodes in one doubt.",
        "source": "T33n1702_003:0191b06_1"
    },
    {
        "source_sentence": "或一住中有二疑三疑，乍合乍離連前帶後，以是之故文涉交加，理則不必深玄，",
        "translation": "Or, in one pleasurable state, there are two doubts and three doubts: the first is combined with the first, while the second is separated from the first. Because of this, the text involves interpenetration; but the reasoning does not need to be profound or mysterious.",
        "source": "T33n1702_003:0191b08_0"
    },
    {
        "source_sentence": "學者以之難解。",
        "translation": "It's difficult for scholars to understand because of its difficulty.",
        "source": "T33n1702_003:0191b09_1"
    },
    {
        "source_sentence": "今既別釋庶不相干，傳講之流少力多獲耳。",
        "translation": "Now that the distinct interpretations and common people aren't involved, the stream of transmitted teachings has little power to attain them.",
        "source": "T33n1702_003:0191b10_2"
    },
    {
        "source_sentence": "初中三初、正示七句七義句者。",
        "translation": "The first is the first of the three in the first, which correctly shows seven phrases and seven meaningful phrases.",
        "source": "T33n1702_003:0191b11_3"
    },
    {
        "source_sentence": "論述歸敬偈已，即云成立七種義句，已此般若波羅蜜即得成立。",
        "translation": "After the treatise explains the verse of reverence, it's called establishing seven kinds of meaningful phrases, and after this prajñāpāramitā is established, they'll be established.",
        "source": "T33n1702_003:0191b11_4"
    },
    {
        "source_sentence": "義句，揀文句也。",
        "translation": "The phrase of meaning is the selection of words and phrases.",
        "source": "T33n1702_003:0191b13_5"
    },
    {
        "source_sentence": "既以一義為一句，此經共有七義句也。",
        "translation": "Since one meaning is a phrase, this sūtra has seven meaningful phrases in common.",
        "source": "T33n1702_003:0191b13_6"
    },
    {
        "source_sentence": "七義句名，疏中自有，於中前六顯示菩薩所作究竟，第七顯示成立此法門故。",
        "translation": "The names of the seven meanings and phrases are inherent in the commentary, where the first six shows the ultimate accomplishment of what the bodhisattva does, and the seventh shows the establishment of this teaching.",
        "source": "T33n1702_003:0191b14_7"
    },
    {
        "source_sentence": "然此七句之文，教理行果悉圓滿矣。",
        "translation": "However, the text of these seven sentences is complete in terms of teaching, principle, practice, and result.",
        "source": "T33n1702_003:0191b16_8"
    },
    {
        "source_sentence": "於中一二三四是行也，五理也，六果也，七教也。",
        "translation": "Among them, one, two, three, and four are practices, five are principles, six are fruits, and seven are teachings.",
        "source": "T33n1702_003:0191b17_9"
    },
    {
        "source_sentence": "齊此懸判一科，唯依無著之名記之。",
        "translation": "Together, these are the only categories to be judged here, but they're named according to the absence of attachment.",
        "source": "T33n1702_003:0191b18_10"
    },
    {
        "source_sentence": "疏一種性不斷者。",
        "translation": "The commentary says that one kind of nature doesn't stop.",
        "source": "T33n1702_003:0191b19_11"
    },
    {
        "source_sentence": "此非凡夫、二乘及權教菩薩，意明佛種性不斷也。",
        "translation": "These aren't extraordinary people, two-vehicle and provisionally taught bodhisattvas who want to explain that the Buddha's seed nature is unceasing.",
        "source": "T33n1702_003:0191b19_12"
    },
    {
        "source_sentence": "謂護下。",
        "translation": "It's below the level of guarding.",
        "source": "T33n1702_003:0191b20_13"
    },
    {
        "source_sentence": "指經。",
        "translation": "It refers to the sūtras.",
        "source": "T33n1702_003:0191b20_14"
    },
    {
        "source_sentence": "便是釋。",
        "translation": "That's an explanation.",
        "source": "T33n1702_003:0191b20_15"
    },
    {
        "source_sentence": "意謂以小付大，囑大化小，展轉如是寧有斷絕，如人父母付囑子孫云云。",
        "translation": "The idea is to entrust the lesser to the greater and instruct the greater to transform the lesser, so that there's no interruption of this kind of development, just as a person's parents entrust their children and grandchildren.",
        "source": "T33n1702_003:0191b21_16"
    },
    {
        "source_sentence": "此是空生之本意，故以此事讚佛，引起問端也。",
        "translation": "This is the original meaning of emptiness and arising, so it's a way to praise the Buddha for this matter and ask questions at the end.",
        "source": "T33n1702_003:0191b22_17"
    },
    {
        "source_sentence": "疏二發起行相者。",
        "translation": "The commentary refers to the second aspect of initiating practice.",
        "source": "T33n1702_003:0191b23_18"
    },
    {
        "source_sentence": "既欲種性不斷，故須發起修行之相也。",
        "translation": "Since the seed nature of desire doesn't stop, it's necessary to give rise to the characteristic of cultivation.",
        "source": "T33n1702_003:0191b24_19"
    },
    {
        "source_sentence": "謂申下。",
        "translation": "It's called the next step in explaining.",
        "source": "T33n1702_003:0191b25_20"
    },
    {
        "source_sentence": "指經。",
        "translation": "It refers to the sūtras.",
        "source": "T33n1702_003:0191b25_21"
    },
    {
        "source_sentence": "其實佇聽亦在此攝。",
        "translation": "In fact, standing and listening are also included here.",
        "source": "T33n1702_003:0191b25_22"
    },
    {
        "source_sentence": "疏三行所住處者。",
        "translation": "The commentary refers to the place where the three practices abide.",
        "source": "T33n1702_003:0191b25_23"
    },
    {
        "source_sentence": "既有能發必有所發也。",
        "translation": "Since there's something to give rise to, there must be something to give rise to.",
        "source": "T33n1702_003:0191b26_24"
    },
    {
        "source_sentence": "十八住名義，下文廣釋。",
        "translation": "The names and meanings of the eighteen abodes are explained in detail below.",
        "source": "T33n1702_003:0191b26_25"
    },
    {
        "source_sentence": "從佛下。",
        "translation": "It's below the Buddha.",
        "source": "T33n1702_003:0191b27_26"
    },
    {
        "source_sentence": "指經。",
        "translation": "It refers to the sūtras.",
        "source": "T33n1702_003:0191b27_27"
    },
    {
        "source_sentence": "是無下。",
        "translation": "It's below the level of nonexistence.",
        "source": "T33n1702_003:0191b27_28"
    },
    {
        "source_sentence": "釋名義。",
        "translation": "He explains the names and meanings.",
        "source": "T33n1702_003:0191b27_29"
    },
    {
        "source_sentence": "此即相之無相，非一向之無相，略見行玄為順本宗，故標無相也。",
        "translation": "This is the marklessness of marks, not the exclusive marklessness of marklessness, and it's a brief statement that the practice of the profound teaching follows the original teaching, so it's labeled markless.",
        "source": "T33n1702_003:0191b27_30"
    },
    {
        "source_sentence": "疏四對治中。",
        "translation": "In the commentary, there are four antidotes.",
        "source": "T33n1702_003:0191b29_31"
    },
    {
        "source_sentence": "邪行即不正行也，但不順佛道皆名邪行。",
        "translation": "False practice is incorrect practice, but they don't follow the Buddha Way and are all called wrong practice.",
        "source": "T33n1702_003:0191b29_32"
    },
    {
        "source_sentence": "共者不一義。",
        "translation": "What's shared doesn't have the same meaning.",
        "source": "T33n1702_003:0191c01_33"
    },
    {
        "source_sentence": "見者分別情。",
        "translation": "Seeing is discriminating feelings.",
        "source": "T33n1702_003:0191c01_34"
    },
    {
        "source_sentence": "正行者即離見之正行，非純正之正行也。",
        "translation": "The right practice is the right practice that's free of views, not the pure and correct right practice.",
        "source": "T33n1702_003:0191c02_35"
    },
    {
        "source_sentence": "二種對治者。",
        "translation": "The two kinds of antidotes are.",
        "source": "T33n1702_003:0191c03_36"
    },
    {
        "source_sentence": "以正行治邪行，是一對治。",
        "translation": "To counteract wrong actions with right action is one antidote.",
        "source": "T33n1702_003:0191c03_37"
    },
    {
        "source_sentence": "以無分別智治分別見，是二對治。",
        "translation": "Discriminating views that are counteracted by nondiscriminating cognition is the antidote for these two.",
        "source": "T33n1702_003:0191c04_38"
    },
    {
        "source_sentence": "然邪即全治，共中即但治於見，不治正行，如披砂揀金而去砂不去金，",
        "translation": "However, error is the complete antidote, and what's shared with views is simply the antidote for views that aren't counteracted by right action, like wearing sand and selecting gold while removing sand and not gold.",
        "source": "T33n1702_003:0191c04_39"
    },
    {
        "source_sentence": "今經中但有能治，無所治也。",
        "translation": "In the present sūtra, there's only something that can be counteracted and nothing that can be counteracted.",
        "source": "T33n1702_003:0191c06_40"
    },
    {
        "source_sentence": "且如第一住處中，不度眾生為邪行，度眾生為對治。",
        "translation": "It's like the first abode where not liberating sentient beings is wrong practice and liberating sentient beings is the antidote.",
        "source": "T33n1702_003:0191c07_41"
    },
    {
        "source_sentence": "於度眾生時，見有眾生是所度，見我是能度，是分別。",
        "translation": "When he saves sentient beings, he sees that there are sentient beings who are to be saved and sees that I am the one who can save them, which is discrimination.",
        "source": "T33n1702_003:0191c08_42"
    },
    {
        "source_sentence": "見度而無度為對治。",
        "translation": "Seeing what's liberated but not liberated is the antidote.",
        "source": "T33n1702_003:0191c09_43"
    },
    {
        "source_sentence": "此理實同時，義分前後。",
        "translation": "This principle is really simultaneous, with its meaning being prior and subsequent.",
        "source": "T33n1702_003:0191c09_44"
    },
    {
        "source_sentence": "初住既爾，餘可例知。",
        "translation": "Since this is the case for the first abode, the rest can be understood by analogy.",
        "source": "T33n1702_003:0191c10_45"
    },
    {
        "source_sentence": "故論云：「行諸住處時，有二種對治。」",
        "translation": "That's why the treatise says, When practicing these abodes, there are two kinds of antidotes.",
        "source": "T33n1702_003:0191c10_46"
    },
    {
        "source_sentence": "疏五不失中。",
        "translation": "In the commentary on the five kinds of non-loss, it's said.",
        "source": "T33n1702_003:0191c11_47"
    },
    {
        "source_sentence": "謂由下。",
        "translation": "It's because of the following.",
        "source": "T33n1702_003:0191c11_48"
    },
    {
        "source_sentence": "明意也。",
        "translation": "It's also an explanation of the meaning.",
        "source": "T33n1702_003:0191c12_49"
    },
    {
        "source_sentence": "離增減者。",
        "translation": "He's free of increase and decrease.",
        "source": "T33n1702_003:0191c12_50"
    },
    {
        "source_sentence": "謂執有為增，執無為減。",
        "translation": "They hold to the view that there is an increase in conditioned things and a decrease in unconditioned things.",
        "source": "T33n1702_003:0191c12_51"
    },
    {
        "source_sentence": "前墮此二則失中道，今皆離之，故得不失也。",
        "translation": "If someone previously fell into these two, they lost the middle way, but now they're all free of them, so they attain it and don't lose it.",
        "source": "T33n1702_003:0191c13_52"
    },
    {
        "source_sentence": "如經中即非佛法，是勝義諦遮增益邊，是名佛法，是世俗諦遮損減邊，",
        "translation": "Just as the sūtras say, that which is not a buddha-dharma is the ultimate truth that obscures the extremes of gain and loss, this is called a buddha-dharma. The conventional truth that obscures the extremes of gain and loss",
        "source": "T33n1702_003:0191c14_53"
    },
    {
        "source_sentence": "其餘即非是名皆例此也。",
        "translation": "The other meanings are not names, and they're all examples of this.",
        "source": "T33n1702_003:0191c15_54"
    },
    {
        "source_sentence": "論最後結云：「菩薩離此二邊故，於彼對治不復更失，故名不失。」",
        "translation": "The final conclusion of the treatise says, Because bodhisattvas are free of these two extremes, they won't lose any more of their antidotes, so they're called not losing them.",
        "source": "T33n1702_003:0191c16_55"
    },
    {
        "source_sentence": "疏六地位中。",
        "translation": "In the six stages of the commentary, it's said.",
        "source": "T33n1702_003:0191c17_56"
    },
    {
        "source_sentence": "謂由下。",
        "translation": "It's because of the following.",
        "source": "T33n1702_003:0191c17_57"
    },
    {
        "source_sentence": "釋。",
        "translation": "It's explained.",
        "source": "T33n1702_003:0191c18_58"
    },
    {
        "source_sentence": "以二邊邪僻置之不論，中道乃是大菩提路，故於此中分立地位。",
        "translation": "It's because the two extreme errors are left alone, and the middle way is the great path of enlightenment, so it's established as a position here.",
        "source": "T33n1702_003:0191c18_59"
    },
    {
        "source_sentence": "如往帝都有三路異，兩邊皆非中道即正，正路之中方可論於遠近遲速等也。",
        "translation": "It's like the past emperor who had three paths that are different, and neither side is the middle way or the right path; it's only in the middle of the right path that we can discuss distantness, nearness, delay, and speed.",
        "source": "T33n1702_003:0191c19_60"
    },
    {
        "source_sentence": "法中亦爾，故經云：「一切賢聖皆以無為法而有差別。」",
        "translation": "So it is with the Dharma, so the sūtra says, All good men and sages have distinctions because of the nonexistence of dharmas.",
        "source": "T33n1702_003:0191c21_61"
    },
    {
        "source_sentence": "信行下。",
        "translation": "It's below the practice of faith.",
        "source": "T33n1702_003:0191c22_62"
    },
    {
        "source_sentence": "分位也。",
        "translation": "It's also the level of distinction.",
        "source": "T33n1702_003:0191c22_63"
    },
    {
        "source_sentence": "於十八住中，前十六住是信行地，此當三賢，依信起行故名信行，亦名信解，",
        "translation": "Among the eighteen abodes, the first sixteen abodes are the stage of faith and practice. These should be the three spheres of goodness. Because they produce practice based on faith, they are called ‘practices of faith’. They are also called ‘understandings of faith’.",
        "source": "T33n1702_003:0191c22_64"
    },
    {
        "source_sentence": "依信起解故。",
        "translation": "It's because they rely on faith to give rise to understanding.",
        "source": "T33n1702_003:0191c24_65"
    },
    {
        "source_sentence": "第十七住是淨心地，此當初地，離分別障親證真如故。",
        "translation": "The seventeenth abode is the pure state of mind, which is the first ground here because it's free of the hindrance of discrimination and intimately realizes true reality.",
        "source": "T33n1702_003:0191c24_66"
    },
    {
        "source_sentence": "第十八住從第二地已去，乃至佛位，通名如來地也。",
        "translation": "The eighteenth abode, from the second ground up to the Buddhahood, is generally called the Tathāgata stage.",
        "source": "T33n1702_003:0191c26_67"
    },
    {
        "source_sentence": "又以諸家明地位或廣或略，廣則五十二位，略則泯之全無。",
        "translation": "It's also because the scholars explain that status may be extensive or abbreviated, and when extensive, it's fifty-two states; when abbreviated, it's completely nonexistent.",
        "source": "T33n1702_003:0191c27_68"
    },
    {
        "source_sentence": "今則均於廣略，去其太甚，說三地五位矣。",
        "translation": "Now, they're all limited to the broad and the abbreviated, which are too great to be described as three stages or five stages.",
        "source": "T33n1702_003:0191c28_69"
    },
    {
        "source_sentence": "疏七立名中。",
        "translation": "In the commentary on the seven establishment of names, it's said.",
        "source": "T33n1702_003:0191c29_70"
    },
    {
        "source_sentence": "謂由下。",
        "translation": "It's because of the following.",
        "source": "T33n1702_003:0191c29_71"
    },
    {
        "source_sentence": "釋。",
        "translation": "It's explained.",
        "source": "T33n1702_003:0192a01_72"
    },
    {
        "source_sentence": "謂約三種法上立金剛名。",
        "translation": "It means that the name vajra is established in terms of the three kinds of dharmas.",
        "source": "T33n1702_003:0192a01_73"
    },
    {
        "source_sentence": "一、約般若體用名金剛，此如金剛堅利。",
        "translation": "1. It's called adamantine in terms of the essence and function of prajñā, which is like a vajra that's as strong as it is.",
        "source": "T33n1702_003:0192a01_74"
    },
    {
        "source_sentence": "二、約地位闊狹名金剛，此如金剛杵形。",
        "translation": "Second, it's called adamantine in terms of the breadth and width of its position, which is shaped like a vajra.",
        "source": "T33n1702_003:0192a02_75"
    },
    {
        "source_sentence": "以信行一僧祇，淨心只一剎那，佛地二僧祇，如金剛杵初後闊中間狹故。",
        "translation": "It's because faith and practice are one incalculable, the pure mind is only one moment, and the Buddha ground is two incalculable, just like the first and second widths of the vajra.",
        "source": "T33n1702_003:0192a03_76"
    },
    {
        "source_sentence": "三、約文字名金剛，此如畫像也。",
        "translation": "3. It's called adamantine in terms of words, which is like a painted image.",
        "source": "T33n1702_003:0192a05_77"
    },
    {
        "source_sentence": "以詮信行地七紙餘經、佛地三紙餘文、淨心地五行經，如彼畫像亦初後闊中間狹故。",
        "translation": "It's because it explains the seven-page remaining sūtras at the stage of faith practice, the three-page remaining text at the Buddha ground, and the five-line scriptures at the pure mind ground, just as the painted image is narrow between the first and second widths.",
        "source": "T33n1702_003:0192a05_78"
    },
    {
        "source_sentence": "又此三者，法喻之上皆展轉而成。",
        "translation": "Furthermore, these three are all produced in succession above the metaphor of the Dharma.",
        "source": "T33n1702_003:0192a07_79"
    },
    {
        "source_sentence": "喻中且根本是堅利金剛，因造以成其杵，因畫以成其像。",
        "translation": "In the metaphor, let's say that the root is a hard vajra, which is made into a pounder because it's created and painted to make an image.",
        "source": "T33n1702_003:0192a08_80"
    },
    {
        "source_sentence": "法中根本是體用般若，因修以成其位地，因詮以成其文字也。",
        "translation": "The root of the teaching is prajñā with essence and function, which are conditioned by cultivation to form their stages and defined by interpretation to form their words.",
        "source": "T33n1702_003:0192a09_81"
    },
    {
        "source_sentence": "又此法喻各三事中，一事即實餘二皆虛。",
        "translation": "Furthermore, in each of the three things in this dharma metaphor, one thing is real and the other two are false.",
        "source": "T33n1702_003:0192a11_82"
    },
    {
        "source_sentence": "喻中堅利金剛是實，杵形、畫像皆虛。",
        "translation": "In the metaphor, the adamantine vajra is real, and the shape of the pounder and the painted image are all false.",
        "source": "T33n1702_003:0192a12_83"
    },
    {
        "source_sentence": "法中體用般若是實，位地、文字皆虛。",
        "translation": "If the essence and function of parinirvāṇa in dharmas are real, then the stages and words are empty.",
        "source": "T33n1702_003:0192a13_0"
    },
    {
        "source_sentence": "以此三事首末相似，故立金剛之名。",
        "translation": "Because these three things are similar in their beginning and end, they're called adamantine.",
        "source": "T33n1702_003:0192a13_1"
    },
    {
        "source_sentence": "然前一是佛本意，餘二是菩薩及古德意也。",
        "translation": "However, the first one is the original intention of the Buddha, and the other two are the intentions of the bodhisattvas and ancient virtues.",
        "source": "T33n1702_003:0192a14_2"
    },
    {
        "source_sentence": "由前六等者。",
        "translation": "It's because of the first six and so forth.",
        "source": "T33n1702_003:0192a15_3"
    },
    {
        "source_sentence": "於中前五堅利，第六闊狹，闊狹之中含能所詮也。",
        "translation": "The first of these five firmnesses is the sixth, wide and narrow, which contains what's explained in terms of what can be explained.",
        "source": "T33n1702_003:0192a15_4"
    },
    {
        "source_sentence": "疏後四下。",
        "translation": "The next four parts of the commentary follow.",
        "source": "T33n1702_003:0192a17_5"
    },
    {
        "source_sentence": "二、總指後四。",
        "translation": "2. the last four that are generally cited.",
        "source": "T33n1702_003:0192a17_6"
    },
    {
        "source_sentence": "應先問云：「第三句內說盡經文，未知後四如何配攝？」",
        "translation": "You should first ask, In the third sentence, we'll explain the full text of the sūtra, but we don't know how to match the last four.",
        "source": "T33n1702_003:0192a17_7"
    },
    {
        "source_sentence": "故此云也。",
        "translation": "That's why it's called this.",
        "source": "T33n1702_003:0192a18_8"
    },
    {
        "source_sentence": "謂一一住說對治故，於對治處顯不失中道故，於不失中立位地故，於前六中道立名故云云。",
        "translation": "It means that each of the first abodes is said to be antidote because it indicates the middle path which is not lost in relation to the antidote and establishes a state or stage in relation to what is not lost. Because names are established in relation to the first six intermediate paths.",
        "source": "T33n1702_003:0192a19_0"
    },
    {
        "source_sentence": "疏十八下。",
        "translation": "It's below the eighteenth commentary.",
        "source": "T33n1702_003:0192a21_1"
    },
    {
        "source_sentence": "三廣釋弟三三一、正辨十八住處。",
        "translation": "Three extensive explanations of the disciples' three, three, and one, correctly identifying the eighteen abodes.",
        "source": "T33n1702_003:0192a21_2"
    },
    {
        "source_sentence": "疏中具列十八住名，略釋其義兼明對治十二種障，便指經文令知科段所屬。",
        "translation": "The commentary lists the names of the 18 abodes and briefly explains their meanings, including the twelve kinds of antidotes that counteract the 12 kinds of hindrances, then pointing to the text of the sūtras so that they can be known as belonging to the section.",
        "source": "T33n1702_003:0192a22_3"
    },
    {
        "source_sentence": "然每住經文，疏但略標三字五字，緣以經本科段首尾文勢稍重，恐言涉相濫，",
        "translation": "Each time, however, the texts of the scriptures are abbreviated as three syllables or five syllables. This is due to the fact that the beginning and end of the major sections of the scriptures have slightly heavier syllables; it is feared that their words may be confused with each other.",
        "source": "T33n1702_003:0192a23_4"
    },
    {
        "source_sentence": "故不標最初之字，但取其次異文。",
        "translation": "That's why it doesn't label the first word, but takes the following different words.",
        "source": "T33n1702_003:0192a25_5"
    },
    {
        "source_sentence": "亦不結終齊至何處，意在省約耳。",
        "translation": "I don't want to conclude by saying where I'll go, but I want to save and define it.",
        "source": "T33n1702_003:0192a26_6"
    },
    {
        "source_sentence": "向下隨文略敘首末，以隔前後。",
        "translation": "The following section follows the text and briefly describes the beginning and end, distinguishing the front and back.",
        "source": "T33n1702_003:0192a27_7"
    },
    {
        "source_sentence": "一中發心者，謂發廣大第一等四種心也。",
        "translation": "In one, the arousal of mind refers to the arousal of the vast first and other four kinds of mind.",
        "source": "T33n1702_003:0192a27_8"
    },
    {
        "source_sentence": "經文從「佛告須菩提：諸菩薩摩訶薩應如是降伏其心，乃至若菩薩有我相、人相、眾生相、壽者相，",
        "translation": "The sūtra goes on to say, The Buddha told Subhūti, All bodhisattvas and mahāsattvas should thus subdue their minds, up to the point where if bodhisattvas have characteristics of self, characteristics of person, characteristics of sentient beings, and characteristics of life spans,",
        "source": "T33n1702_003:0192a28_9"
    },
    {
        "source_sentence": "即非菩薩。」",
        "translation": "That's not a bodhisattva.",
        "source": "T33n1702_003:0192b02_0"
    },
    {
        "source_sentence": "以大乘菩薩最初法爾合發是心故，十八住中居其第一。",
        "translation": "Because this is the mind that the great vehicle bodhisattva first unified with the Dharma, he's the first among the 18 abodes.",
        "source": "T33n1702_003:0192b02_1"
    },
    {
        "source_sentence": "二者，經從「復次，須菩提！",
        "translation": "Second, the sūtra follows from Furthermore, Subhūti!",
        "source": "T33n1702_003:0192b03_2"
    },
    {
        "source_sentence": "於法應無所住行於布施，乃至須菩提！",
        "translation": "In the Dharma, there should be nothing to abide in and practice generosity, even if it's necessary for enlightenment!",
        "source": "T33n1702_003:0192b04_3"
    },
    {
        "source_sentence": "菩薩但應如所教住，不住等者。」",
        "translation": "A bodhisattva should simply abide as he teaches and not abide in anything like that.",
        "source": "T33n1702_003:0192b04_4"
    },
    {
        "source_sentence": "等有二意：一則等於餘文，如上所引。",
        "translation": "Equanimity has two meanings: first, it's the same as the other texts, as cited above.",
        "source": "T33n1702_003:0192b05_5"
    },
    {
        "source_sentence": "二則等於餘義，謂等餘戒等五也。",
        "translation": "The second is the same as the other meanings, which are equal to the other five precepts and so forth.",
        "source": "T33n1702_003:0192b06_6"
    },
    {
        "source_sentence": "此則雖是指經便兼釋義，則波羅蜜是所應，戒等是能應，能所兩合故云相應。",
        "translation": "Although this refers to the sūtras, it also explains their meaning together, so the pāramitā is what should be associated with them, precepts and so forth are what can be associated with them, and the agent and the object are combined, so it's called concomitant.",
        "source": "T33n1702_003:0192b07_7"
    },
    {
        "source_sentence": "由是但行施戒等不能離相，或行離相不行施戒等，皆非相應行。",
        "translation": "Consequently, the practice of generosity, morality, etc., and so on cannot be free from characteristics. Some practice that is free from characteristics but does not practice generosity, morality, etc., are neither associated practices nor non-associated practices.",
        "source": "T33n1702_003:0192b09_0"
    },
    {
        "source_sentence": "直於行施戒等處離相，離相處行施戒等，方得名為相應行也。",
        "translation": "It's only when they practice generosity, precepts, and so forth without marks and practice generosity, precepts, and so forth without marks that they can be called associated practices.",
        "source": "T33n1702_003:0192b10_1"
    },
    {
        "source_sentence": "三者，經從「須菩提！",
        "translation": "Third, the sūtra follows from Suppository!",
        "source": "T33n1702_003:0192b11_2"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T33n1702_003:0192b12_3"
    },
    {
        "source_sentence": "可以身相見如來不？",
        "translation": "Can you see the Tathāgata in bodily form?",
        "source": "T33n1702_003:0192b12_4"
    },
    {
        "source_sentence": "乃至若見諸相非相即見如來。」",
        "translation": "It's even the case that if they see what's characterized and what's not characterized, they'll see the Tathāgata.",
        "source": "T33n1702_003:0192b12_5"
    },
    {
        "source_sentence": "問：「色身是相，何以離相求之？」",
        "translation": "Q: The form body is a mark, so why would you seek it apart from marks?",
        "source": "T33n1702_003:0192b13_6"
    },
    {
        "source_sentence": "答：「色身之相是影，法身無相是體。",
        "translation": "Answer: The characteristics of the form body are shadows, and the Dharma body that has no characteristics is its essence.",
        "source": "T33n1702_003:0192b14_7"
    },
    {
        "source_sentence": "欲得有相色身，須見無相法體。",
        "translation": "If you want to attain a body with marks and form, you must see the essence of markless dharmas.",
        "source": "T33n1702_003:0192b15_8"
    },
    {
        "source_sentence": "未見法體不能現相，是故先令見相無相，方得色相之身耳。",
        "translation": "They haven't yet seen the essence of dharmas and can't show their characteristics, so they first cause them to see characteristics without characteristics before they attain the body of form.",
        "source": "T33n1702_003:0192b15_9"
    },
    {
        "source_sentence": "此中意在文外，故論此意科也。」",
        "translation": "The meaning here is outside the text, so we'll discuss this section of the meaning.",
        "source": "T33n1702_003:0192b17_10"
    },
    {
        "source_sentence": "四中言說者。",
        "translation": "In the fourth, it's called teaching.",
        "source": "T33n1702_003:0192b17_11"
    },
    {
        "source_sentence": "經從「須菩提白佛言：世尊！",
        "translation": "The sūtra goes on to say, Suppository said to the Buddha, Bhagavān!",
        "source": "T33n1702_003:0192b18_12"
    },
    {
        "source_sentence": "乃至法尚應捨何況非法。」",
        "translation": "Even if the Dharma is still to be abandoned, how could it not be?",
        "source": "T33n1702_003:0192b18_13"
    },
    {
        "source_sentence": "問：「法身非言說，何故以言說為法身耶？」",
        "translation": "Q: The Dharma body isn't explained in words, so why is it described in words as the Dharma body?",
        "source": "T33n1702_003:0192b19_14"
    },
    {
        "source_sentence": "故疏釋云：「因言顯理故。」",
        "translation": "That's why the commentary explains, It's because words reveal principles.",
        "source": "T33n1702_003:0192b20_15"
    },
    {
        "source_sentence": "此有二意：一、以言說顯於法身，法身非言說。",
        "translation": "These have two meanings: 1. by expressing the Dharma body in words, the Dharma body isn't expressed in words.",
        "source": "T33n1702_003:0192b20_16"
    },
    {
        "source_sentence": "二、文字性離即是法身，無別法身耳。",
        "translation": "2. The nature of words is free of the Dharma body, which is the Dharma body, and there's no separate Dharma body.",
        "source": "T33n1702_003:0192b21_17"
    },
    {
        "source_sentence": "智相者。",
        "translation": "The characteristic of cognition...",
        "source": "T33n1702_003:0192b22_18"
    },
    {
        "source_sentence": "經從「須菩提！",
        "translation": "The sūtra follows, Suppository!",
        "source": "T33n1702_003:0192b22_19"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T33n1702_003:0192b23_0"
    },
    {
        "source_sentence": "如來得阿耨菩提耶？",
        "translation": "Does the Tathāgata attain supreme enlightenment?",
        "source": "T33n1702_003:0192b23_1"
    },
    {
        "source_sentence": "乃至一切賢聖皆以無為法而有差別。」",
        "translation": "Up to all the good and noble ones have distinctions based on the principle of nonexistence.",
        "source": "T33n1702_003:0192b23_2"
    },
    {
        "source_sentence": "則以無相無為法為智相也。",
        "translation": "Then, the mark of marklessness and nonproductive dharmas is the mark of wisdom.",
        "source": "T33n1702_003:0192b24_3"
    },
    {
        "source_sentence": "故《起信》云：「以智相無可見故。」",
        "translation": "That's why the Awakening of Faith says, It's because the characteristic of wisdom is invisible.",
        "source": "T33n1702_003:0192b25_4"
    },
    {
        "source_sentence": "福相者。",
        "translation": "The mark of merit is this.",
        "source": "T33n1702_003:0192b25_5"
    },
    {
        "source_sentence": "經從「須菩提！",
        "translation": "The sūtra follows, Suppository!",
        "source": "T33n1702_003:0192b26_6"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T33n1702_003:0192b26_7"
    },
    {
        "source_sentence": "若人滿三千大千世界七寶以用布施；",
        "translation": "Suppose someone fills a great manifold cosmos of one thousand worlds with the seven treasures and uses them for giving.",
        "source": "T33n1702_003:0192b26_8"
    },
    {
        "source_sentence": "乃至須菩提！",
        "translation": "Up to Subhūti!",
        "source": "T33n1702_003:0192b27_9"
    },
    {
        "source_sentence": "所謂佛法者即非佛法。」",
        "translation": "What's called a buddha-dharma is not a buddha-dharma.",
        "source": "T33n1702_003:0192b27_10"
    },
    {
        "source_sentence": "斯則以持說此經獲無漏福，所感微妙色身，名為福相也。",
        "translation": "Thus, the subtle form body that's induced by maintaining and teaching this sūtra obtains uncontaminated merit, which is called the mark of merit.",
        "source": "T33n1702_003:0192b28_11"
    },
    {
        "source_sentence": "然是法身之福相，福相非法身。",
        "translation": "However, these are the marks of merit in the Dharma body and the marks of merit in the non-dharma body.",
        "source": "T33n1702_003:0192b29_12"
    },
    {
        "source_sentence": "依主釋。",
        "translation": "Relying on the main explanation, he explains.",
        "source": "T33n1702_003:0192c01_13"
    },
    {
        "source_sentence": "五於下，文三初、正示此文。",
        "translation": "Five, below, the text is threefold: first, it correctly shows this text.",
        "source": "T33n1702_003:0192c01_14"
    },
    {
        "source_sentence": "經從「須菩提！",
        "translation": "The sūtra follows, Suppository!",
        "source": "T33n1702_003:0192c02_15"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T33n1702_003:0192c02_16"
    },
    {
        "source_sentence": "須陀洹能作是念我得須陀洹果不？",
        "translation": "Can a stream-winner think, 'I'll attain the fruit of stream-winner?'",
        "source": "T33n1702_003:0192c02_17"
    },
    {
        "source_sentence": "乃至是樂阿蘭那行。」",
        "translation": "It's even the practice of blissful āraṇī.",
        "source": "T33n1702_003:0192c03_18"
    },
    {
        "source_sentence": "得勝者。",
        "translation": "Those who attain victory...",
        "source": "T33n1702_003:0192c03_19"
    },
    {
        "source_sentence": "以小乘四果勝於四向等故，對劣彰勝也。",
        "translation": "It's because the four fruits of the lesser vehicle are superior to the four dedications and so forth, which show superiority over inferior ones.",
        "source": "T33n1702_003:0192c04_20"
    },
    {
        "source_sentence": "此即以小況大也。",
        "translation": "This is called using the lesser to describe the greater.",
        "source": "T33n1702_003:0192c05_0"
    },
    {
        "source_sentence": "小人尚猶無過，君子豈合有愆。",
        "translation": "A small person is still not wrong, so how could a gentleman have any quarrel?",
        "source": "T33n1702_003:0192c05_1"
    },
    {
        "source_sentence": "由無慢故方得證果。",
        "translation": "It's because there's no conceit that they'll attain the fruit of realization.",
        "source": "T33n1702_003:0192c06_2"
    },
    {
        "source_sentence": "故經皆言：「我不作是念，我得須陀洹果等。」",
        "translation": "That's why the sūtras all say, If I don't think this, I'll attain the fruit of stream entry and so forth.",
        "source": "T33n1702_003:0192c06_3"
    },
    {
        "source_sentence": "從此下。",
        "translation": "From here, it follows.",
        "source": "T33n1702_003:0192c07_4"
    },
    {
        "source_sentence": "二、通敘後段意明等者。",
        "translation": "Second, it's a general statement of the meaning of the latter section and so forth.",
        "source": "T33n1702_003:0192c07_5"
    },
    {
        "source_sentence": "敘次第之意也。",
        "translation": "It's also the meaning of sequential order.",
        "source": "T33n1702_003:0192c08_6"
    },
    {
        "source_sentence": "先問云：「前之四住何不言離障耶？」",
        "translation": "First, he asked, Why aren't the previous four abodes said to be free of hindrances?",
        "source": "T33n1702_003:0192c08_7"
    },
    {
        "source_sentence": "故云也。",
        "translation": "That's why it's called that.",
        "source": "T33n1702_003:0192c09_8"
    },
    {
        "source_sentence": "意云凡欲修進先須發心，發心已則修行，故有第一第二。",
        "translation": "It means that when someone wants to cultivate it, they must first give rise to the mind, and after giving rise to the mind, they'll cultivate it; therefore, there's the first and second.",
        "source": "T33n1702_003:0192c09_9"
    },
    {
        "source_sentence": "發心修行本求佛果，佛果之內唯有二身，麁細之間先色後法，故有第三第四。",
        "translation": "Because the arousal of mind and cultivation originally seek Buddhahood, there are only two bodies within Buddhahood: gross and subtle, form first and dharmas last; therefore, there is a third and a fourth.",
        "source": "T33n1702_003:0192c10_10"
    },
    {
        "source_sentence": "前修勝行恐有慢心障入聖位，故說小果以況大乘。",
        "translation": "The former cultivation of superior practices is feared to have the mental hindrance of conceit and enter the noble state, so it's said to be a lesser result, much less a great vehicle.",
        "source": "T33n1702_003:0192c12_11"
    },
    {
        "source_sentence": "今離障進入十迴向位也，故從第五方說離障也。",
        "translation": "Now, they're free of hindrances and enter the stage of the ten dedications of merit, so they're said to be free of hindrances from the fifth direction.",
        "source": "T33n1702_003:0192c13_12"
    },
    {
        "source_sentence": "然此十二障，每至一住皆須躡前以辨來意。",
        "translation": "However, each of these twelve hindrances requires a prior statement to explain the meaning of what comes before it reaches one abode.",
        "source": "T33n1702_003:0192c14_13"
    },
    {
        "source_sentence": "如云雖得無慢猶自少聞，故於第六住中對治少聞障，他皆倣此。",
        "translation": "Just as it is said that even though one has acquired the absence of self-conceit, one still has little learning. Therefore, in the sixth abode, one counteracts the obstacle of having little learning while abiding. All others follow this example.",
        "source": "T33n1702_003:0192c15_14"
    },
    {
        "source_sentence": "以此諸障皆在地前，能障見道，非是地上，故云障盡入證道也。",
        "translation": "Because these obstacles are all in front of the ground, they can obstruct the path of seeing, not the ground; therefore, it's called the path of realization when the hindrances are ended.",
        "source": "T33n1702_003:0192c17_15"
    },
    {
        "source_sentence": "然障是所治，文在經外，住是能治，正是經文。",
        "translation": "However, the obstacle is that which is to be cured. The syllables are located outside the scriptural texts. Abiding is that which is able to be cured. This is precisely the syllable of the sūtra.",
        "source": "T33n1702_003:0192c18_16"
    },
    {
        "source_sentence": "若相望說之，理則明矣。",
        "translation": "If we look at each other and explain them, the principle will be clear.",
        "source": "T33n1702_003:0192c19_17"
    },
    {
        "source_sentence": "今當下。",
        "translation": "Now, let's go on down.",
        "source": "T33n1702_003:0192c20_18"
    },
    {
        "source_sentence": "三、別結對治。",
        "translation": "3. the antidote of specific bonds.",
        "source": "T33n1702_003:0192c20_19"
    },
    {
        "source_sentence": "然準《五蘊論》說，慢有七、九二種，但開合之異，此約入道人說。",
        "translation": "However, according to the five saṃgha treatises, there are seven kinds of conceit and nine or two kinds of conceit, but they are separated by opening and closing. This is spoken of in terms of those who have entered the path.",
        "source": "T33n1702_003:0192c20_20"
    },
    {
        "source_sentence": "七者，論云：一、慢，於劣謂勝、於相似謂等。",
        "translation": "7. The treatise says: 1. conceit, which is called superior when it's inferior and equal when it's similar.",
        "source": "T33n1702_003:0192c22_21"
    },
    {
        "source_sentence": "二、過慢，於相似謂勝、於勝謂等。",
        "translation": "The second is overweening pride, which is called superior when it's similar and equal when it's superior.",
        "source": "T33n1702_003:0192c23_0"
    },
    {
        "source_sentence": "三、慢過慢，謂於勝己計勝彼。",
        "translation": "3. conceit and overweening pride, which is the perception of superiority over oneself and superiority over others.",
        "source": "T33n1702_003:0192c23_1"
    },
    {
        "source_sentence": "四、邪慢，己實無德計己有德。",
        "translation": "4. wrong conceit, which imagines that one has virtue because one really has no virtue and doesn't have virtue.",
        "source": "T33n1702_003:0192c24_2"
    },
    {
        "source_sentence": "五、我慢，謂於五聚蘊計我我所。",
        "translation": "The fifth is self-conceit, which consists of imagining the five aggregates as self and what belongs to self.",
        "source": "T33n1702_003:0192c25_0"
    },
    {
        "source_sentence": "六、增上慢，謂於勝妙法中未得謂得。",
        "translation": "6. overweening pride, which is called attaining when it's not attained in the most sublime teaching.",
        "source": "T33n1702_003:0192c25_1"
    },
    {
        "source_sentence": "七卑劣慢，於多分勝計己少分劣。",
        "translation": "The seventh is the conceit of inferiority, which imagines oneself to be inferior in many ways.",
        "source": "T33n1702_003:0192c26_2"
    },
    {
        "source_sentence": "今所離者即五六也，以證我空故，取自果故。",
        "translation": "What's free of them now are the five and six, because they realize emptiness of self and grasp their own fruit.",
        "source": "T33n1702_003:0192c27_3"
    },
    {
        "source_sentence": "六者，經從「佛告須菩提：於意云何？",
        "translation": "The sixth is that the sūtra follows, The Buddha told Subhūti, What do you think?",
        "source": "T33n1702_003:0192c28_4"
    },
    {
        "source_sentence": "如來昔在然燈佛所，乃至實無所得。」",
        "translation": "In the past, the Tathāgata was at Rājagṛha Buddha's place, but he really had nothing to gain.",
        "source": "T33n1702_003:0192c29_5"
    },
    {
        "source_sentence": "云何離障得成住耶？",
        "translation": "How can they be free of hindrances and attain their abiding?",
        "source": "T33n1702_003:0192c29_6"
    },
    {
        "source_sentence": "疏次云離第下，所離障。",
        "translation": "The second part of the commentary says that it's free of the hindrances that are removed.",
        "source": "T33n1702_003:0193a01_7"
    },
    {
        "source_sentence": "不離下，結成住義。",
        "translation": "The meaning of abiding is that they are not separate from each other.",
        "source": "T33n1702_003:0193a01_8"
    },
    {
        "source_sentence": "於中上句成住，下句離障也。",
        "translation": "In the middle, the first sentence becomes abiding, and the second sentence is free of hindrances.",
        "source": "T33n1702_003:0193a02_9"
    },
    {
        "source_sentence": "若離佛世不名住處，無佛說法則是少聞便成其障，若不離佛世，乃成住處常遇佛說法，",
        "translation": "If someone leaves the Buddha-realm and isn’t called a dwelling place, and doesn’t hear the Dharma taught by buddhas, that person’s obstacle will be eliminated through having heard only a little.",
        "source": "T33n1702_003:0193a02_10"
    },
    {
        "source_sentence": "則具多聞便離障也。",
        "translation": "Then they'll be well-versed and then free of the hindrances.",
        "source": "T33n1702_003:0193a04_11"
    },
    {
        "source_sentence": "然凡是修行，智慧為本，欲得智慧必須多聞，故依佛住離少聞障也。",
        "translation": "However, where there's cultivation, wisdom is the root, and those who want to attain wisdom must hear much, so they rely on the Buddha to stay away from the hindrance of hearing little.",
        "source": "T33n1702_003:0193a05_12"
    },
    {
        "source_sentence": "故經云：「多聞增智慧，勤聞第一方。」",
        "translation": "That's why the sūtra says, Being well-versed increases wisdom and diligently listening to the first direction.",
        "source": "T33n1702_003:0193a06_13"
    },
    {
        "source_sentence": "問：「若然者，據今經云：『於法實無所得』，豈成多聞？」",
        "translation": "Q: If that's the case, then according to the present sūtra, 'There's really nothing to be gained from the Dharma,' how could it be well-versed?",
        "source": "T33n1702_003:0193a07_14"
    },
    {
        "source_sentence": "答：「此是聞而無聞，得而無得。",
        "translation": "Answer: This is hearing but not hearing, and attaining but not attaining.",
        "source": "T33n1702_003:0193a08_15"
    },
    {
        "source_sentence": "無得而得是真得，無聞而聞是實聞。",
        "translation": "Attaining it without attaining it is true attaining it, and hearing it without hearing it is real hearing.",
        "source": "T33n1702_003:0193a09_16"
    },
    {
        "source_sentence": "故成此住。」",
        "translation": "That's why they form this abode.",
        "source": "T33n1702_003:0193a10_17"
    },
    {
        "source_sentence": "七者，經從「須菩提！",
        "translation": "The seventh is that the sūtra follows, Suppository!",
        "source": "T33n1702_003:0193a10_18"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T33n1702_003:0193a10_19"
    },
    {
        "source_sentence": "菩薩莊嚴佛土不？",
        "translation": "Does the bodhisattva adorn the Buddha's land?",
        "source": "T33n1702_003:0193a11_20"
    },
    {
        "source_sentence": "乃至應無所住而生其心。」",
        "translation": "It should even give rise to its mind without anything to abide in.",
        "source": "T33n1702_003:0193a11_21"
    },
    {
        "source_sentence": "離小下。",
        "translation": "It's below the level of freedom from the lesser.",
        "source": "T33n1702_003:0193a12_22"
    },
    {
        "source_sentence": "所離障。",
        "translation": "It's the hindrance that's removed.",
        "source": "T33n1702_003:0193a12_23"
    },
    {
        "source_sentence": "攀緣即是作念，蓋一義耳。",
        "translation": "To cling to conditions is to think, which has one meaning.",
        "source": "T33n1702_003:0193a12_24"
    },
    {
        "source_sentence": "緣形等者。",
        "translation": "Conditioned form and so forth.",
        "source": "T33n1702_003:0193a13_25"
    },
    {
        "source_sentence": "意云若取色聲等相為土，即有分限，故名小也，以不如法身故。",
        "translation": "It means that if form, sound, and so forth are taken as lands, they have limitations, so they're called small because they aren't like the Dharma body.",
        "source": "T33n1702_003:0193a13_26"
    },
    {
        "source_sentence": "若不取相，分別不生，心境兩亡，竟何分限？",
        "translation": "If they don't grasp characteristics, discriminate and don't give rise to them, and the mind and objects are both extinguished, what is the limit?",
        "source": "T33n1702_003:0193a14_27"
    },
    {
        "source_sentence": "故云大也。",
        "translation": "That's why it's called great.",
        "source": "T33n1702_003:0193a15_28"
    },
    {
        "source_sentence": "契法下。",
        "translation": "It's below the point of understanding the teaching.",
        "source": "T33n1702_003:0193a15_29"
    },
    {
        "source_sentence": "釋所以也。",
        "translation": "This explains why.",
        "source": "T33n1702_003:0193a16_30"
    },
    {
        "source_sentence": "意令忘懷，嚴法性土，不令生心，嚴法相土也。",
        "translation": "It's the land of mindfulness that causes forgetfulness, the land of adorning the Dharma nature, and the land of not causing mind to arise, which is the land of adorning the characteristics of the Dharma.",
        "source": "T33n1702_003:0193a16_31"
    },
    {
        "source_sentence": "故經云：「不應住色等生心，應無所住而生其心。」",
        "translation": "That's why the sūtra says, You shouldn't abide in form and so forth to give rise to mind; you should give rise to mind without anything to abide in.",
        "source": "T33n1702_003:0193a17_32"
    },
    {
        "source_sentence": "偈釋云：「智習唯識通，如是取淨土，非形第一體，非嚴莊嚴意。」",
        "translation": "The verse explains, Wisdom and accumulation are only consciousness-only, thus grasping the pure land, which isn't the first essence of form or the mind that adorns it.",
        "source": "T33n1702_003:0193a18_33"
    },
    {
        "source_sentence": "八者，經從「須菩提！",
        "translation": "The eighth is that the sūtra follows, Suppository!",
        "source": "T33n1702_003:0193a19_34"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T33n1702_003:0193a20_35"
    },
    {
        "source_sentence": "譬如有人身如須彌山王，乃至是名大身。」",
        "translation": "It's like a human body like Sumeru the king of mountains, which is called a large body.",
        "source": "T33n1702_003:0193a20_36"
    },
    {
        "source_sentence": "成熟者。",
        "translation": "It's called ripening.",
        "source": "T33n1702_003:0193a21_37"
    },
    {
        "source_sentence": "即由教化令眾生成種根熟，有所悟證。",
        "translation": "That is to say, it's because they teach and cause sentient beings to produce seed faculties that are ripened, and there's awakening and realization.",
        "source": "T33n1702_003:0193a21_38"
    },
    {
        "source_sentence": "離捨下。",
        "translation": "It's below the level of freedom from equanimity.",
        "source": "T33n1702_003:0193a22_39"
    },
    {
        "source_sentence": "所離障。",
        "translation": "It's the hindrance that's removed.",
        "source": "T33n1702_003:0193a22_40"
    },
    {
        "source_sentence": "若捨眾生即不能教化，故令離障方成住也。",
        "translation": "If they abandon sentient beings, they won't be able to teach them, so they'll be freed from the hindrances and become an abode.",
        "source": "T33n1702_003:0193a22_41"
    },
    {
        "source_sentence": "若見大小下。",
        "translation": "If you see large and small, it's below.",
        "source": "T33n1702_003:0193a23_42"
    },
    {
        "source_sentence": "反釋所以。",
        "translation": "He explains why it's so.",
        "source": "T33n1702_003:0193a24_0"
    },
    {
        "source_sentence": "意言能濟物者，蓋為不見大小也。",
        "translation": "The meaning is that someone who says they can help things because they don't see large and small.",
        "source": "T33n1702_003:0193a24_1"
    },
    {
        "source_sentence": "故經云：「佛說非身，是名大身。」",
        "translation": "That's why the sūtra says, The Buddha teaches that what's not a body is called a great body.",
        "source": "T33n1702_003:0193a25_0"
    },
    {
        "source_sentence": "豈存大小？",
        "translation": "How can we keep the large and small?",
        "source": "T33n1702_003:0193a25_1"
    },
    {
        "source_sentence": "若見大小，則有高下親疎憎愛。",
        "translation": "If they see large and small, then there are superior and inferior relatives who dislike each other.",
        "source": "T33n1702_003:0193a25_2"
    },
    {
        "source_sentence": "心既不等，寧曰大悲？",
        "translation": "Since the mind isn't equal, how could it be called great compassion?",
        "source": "T33n1702_003:0193a26_3"
    },
    {
        "source_sentence": "縱使化生，但成愛見，憎者則去，便捨眾生，云何成熟？",
        "translation": "Even if they are transformed into sentient beings but become attached to views, and the hateful go away, then they abandon sentient beings, so how can they be ripened?",
        "source": "T33n1702_003:0193a27_4"
    },
    {
        "source_sentence": "反此用意則物無有遺，遲速之間皆能成熟。",
        "translation": "Instead, with this intention, there's nothing left to be done, and everything can ripen in a moment of time.",
        "source": "T33n1702_003:0193a28_5"
    },
    {
        "source_sentence": "九者，經從「須菩提！",
        "translation": "The ninth is that the sūtra follows, Subhūti!",
        "source": "T33n1702_003:0193a29_6"
    },
    {
        "source_sentence": "如恒河中所有沙，乃至如來無所說。」",
        "translation": "It's like the sand in the Ganges River that exists, and even the Tathāgata doesn't explain anything.",
        "source": "T33n1702_003:0193a29_7"
    },
    {
        "source_sentence": "離樂下。",
        "translation": "It's below the level of freedom from pleasure.",
        "source": "T33n1702_003:0193b01_8"
    },
    {
        "source_sentence": "所離障。",
        "translation": "It's the hindrance that's removed.",
        "source": "T33n1702_003:0193b01_9"
    },
    {
        "source_sentence": "然隨順外論即是散亂，但能遠離即成住也。",
        "translation": "However, following external theories is distraction, but being able to avoid them is becoming and abiding.",
        "source": "T33n1702_003:0193b01_10"
    },
    {
        "source_sentence": "即儒墨文筆，除佛教外皆外論也。",
        "translation": "That's the writing style of Confucianism and ink, except for Buddhism, which are all external treatises.",
        "source": "T33n1702_003:0193b02_11"
    },
    {
        "source_sentence": "以外論之事是名利源，既若求名，豈得心無散亂？",
        "translation": "What's discussed externally is the source of fame and profit, so if you seek fame, how can your mind not be distracted?",
        "source": "T33n1702_003:0193b03_12"
    },
    {
        "source_sentence": "況得之則樂，失之則苦，苦之則憂、樂之則溢，由斯業累世世沈淪，反推其本，",
        "translation": "How much more so when they attain it, they become happy; when they lose it, they become painful; when they experience pain, they become sad; and when they experience pleasure, they overflow with sorrow. Because of these karmic effects, the world sinks into a cycle of transmigration from one lifetime to another, rejecting its source.",
        "source": "T33n1702_003:0193b04_13"
    },
    {
        "source_sentence": "皆由隨順外論耳。",
        "translation": "It's all because they follow the external theories.",
        "source": "T33n1702_003:0193b06_14"
    },
    {
        "source_sentence": "恒沙下。",
        "translation": "It's below the sands of the Ganges.",
        "source": "T33n1702_003:0193b06_15"
    },
    {
        "source_sentence": "舉持經福多以責外學。",
        "translation": "He cites the merit of maintaining the sūtras to criticize non-Buddhist scholars.",
        "source": "T33n1702_003:0193b07_0"
    },
    {
        "source_sentence": "意云：持經者功德若此，而不修行；",
        "translation": "It means to say that those who preserve scriptures do not practice them because of the merits they have gained.",
        "source": "T33n1702_003:0193b07_1"
    },
    {
        "source_sentence": "名利之源是輪迴苦本，如何隨順却乃修學？",
        "translation": "The source of fame and profit is the root of transmigration and suffering, so how can we follow it and cultivate it?",
        "source": "T33n1702_003:0193b08_2"
    },
    {
        "source_sentence": "十者，經從「須菩提！",
        "translation": "Tenth, the sūtra follows, Suppository!",
        "source": "T33n1702_003:0193b09_3"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T33n1702_003:0193b09_4"
    },
    {
        "source_sentence": "三千大千世界所有微塵是為多不？",
        "translation": "Are the tiny dust motes of the 3,000 great one-thousand worlds numerous?",
        "source": "T33n1702_003:0193b09_5"
    },
    {
        "source_sentence": "乃至是名世界。」",
        "translation": "It's even called a world.",
        "source": "T33n1702_003:0193b10_6"
    },
    {
        "source_sentence": "色是依報即外四大，身是正報即內五蘊。",
        "translation": "Form is the supporting retribution, that is, the four elements external. The body is the direct retribution, that is, the five aggregates internal.",
        "source": "T33n1702_003:0193b11_7"
    },
    {
        "source_sentence": "摶取者即和合義也。",
        "translation": "The grasping of debilitating refers to the meaning of combining.",
        "source": "T33n1702_003:0193b12_8"
    },
    {
        "source_sentence": "但秦魏譯異爾。",
        "translation": "But the Qin and Wei translations differ from each other.",
        "source": "T33n1702_003:0193b12_9"
    },
    {
        "source_sentence": "然摶取約法，相應兼人，二事相望總有三對：一、內身色蘊及外器界，",
        "translation": "However, the gross grasping of dharmas is associated with both persons and things. There are three general ways to look at two things in relation to each other:",
        "source": "T33n1702_003:0193b12_10"
    },
    {
        "source_sentence": "但合微塵所成，名為摶取。",
        "translation": "It's simply formed by combining tiny particles, which are called gross grasping.",
        "source": "T33n1702_003:0193b14_11"
    },
    {
        "source_sentence": "見有身器為依正，執取等即是相應。",
        "translation": "Seeing the existence of a bodily receptacle as basis is correct. Such [things] as grasping and so on are associated.",
        "source": "T33n1702_003:0193b15_0"
    },
    {
        "source_sentence": "二、受等四蘊，但合心心所法而成，名為摶取。",
        "translation": "2. The four aggregates of feeling and so forth, which are simply combined to form mind and mental factors, are called gross grasping.",
        "source": "T33n1702_003:0193b15_1"
    },
    {
        "source_sentence": "見有苦樂受等，即是相應。",
        "translation": "The view that there is pain and pleasure, sensation, etc., are conjoined.",
        "source": "T33n1702_003:0193b16_2"
    },
    {
        "source_sentence": "三、色心和合以成此身，名為摶取。",
        "translation": "3. this body is formed by the conjunction of form and mind, which is called gross grasping.",
        "source": "T33n1702_003:0193b17_3"
    },
    {
        "source_sentence": "見有心色即是我人相應。",
        "translation": "Seeing mental form that exists is associated with self and person.",
        "source": "T33n1702_003:0193b18_4"
    },
    {
        "source_sentence": "行即遷流造作之義。",
        "translation": "Practice refers to the meaning of transmigration and creation.",
        "source": "T33n1702_003:0193b18_5"
    },
    {
        "source_sentence": "觀破之義如下所明。",
        "translation": "The meaning of the refutation of contemplation is explained below.",
        "source": "T33n1702_003:0193b19_6"
    },
    {
        "source_sentence": "影像相者，謂色心等法，是法界中之影像，亦可是業識之影像。",
        "translation": "The characteristic of images means that such things as form and mind are images in the Dharma realm, and they can also be images of karma and consciousness.",
        "source": "T33n1702_003:0193b19_7"
    },
    {
        "source_sentence": "離破下。",
        "translation": "It's below the level of freedom from refutation.",
        "source": "T33n1702_003:0193b21_8"
    },
    {
        "source_sentence": "所離障。",
        "translation": "It's the hindrance that's removed.",
        "source": "T33n1702_003:0193b21_9"
    },
    {
        "source_sentence": "無巧便者，由無善巧方便，不能破此影像，乃名為障。",
        "translation": "A person lacking skillful means doesn't have the skillful means to break through this image, which is called an obstruction.",
        "source": "T33n1702_003:0193b21_10"
    },
    {
        "source_sentence": "若有巧便破之，則成其住也。",
        "translation": "If someone skillfully breaks it down, they'll become its abiding.",
        "source": "T33n1702_003:0193b22_11"
    },
    {
        "source_sentence": "巧便之相，彰在次文。",
        "translation": "The characteristics of skillful means are expressed in the following text.",
        "source": "T33n1702_003:0193b23_12"
    },
    {
        "source_sentence": "既離下。",
        "translation": "Since they're free, it follows.",
        "source": "T33n1702_003:0193b23_13"
    },
    {
        "source_sentence": "躡於前住以為方便之本，由無散亂則成其定，從定方能發慧觀而破之。",
        "translation": "It's because of the absence of distraction that they become concentrated, and it's only from concentration that they can give rise to the contemplation of wisdom and break it.",
        "source": "T33n1702_003:0193b23_14"
    },
    {
        "source_sentence": "以細下。",
        "translation": "It's because it's subtle and inferior.",
        "source": "T33n1702_003:0193b25_15"
    },
    {
        "source_sentence": "正示二種方便，巧便之相也。",
        "translation": "It correctly shows the two kinds of skillful means, which are the characteristics of skillful means.",
        "source": "T33n1702_003:0193b25_16"
    },
    {
        "source_sentence": "然破色具二、破心唯一，除細末也。",
        "translation": "However, the refutation of form is twofold and the refutation of mind is only one, except for subtle matter.",
        "source": "T33n1702_003:0193b26_17"
    },
    {
        "source_sentence": "以心心所法不可析破故，麁色顯著難忘執情，析至極微易袪妄念，故須具二。",
        "translation": "Because mind and mental factors cannot be analyzed and broken, gross forms are obvious and difficult to forget or cling to feelings, and when analyzed up to the very subtle, it's easy to deceive deluded thoughts, so there must be two.",
        "source": "T33n1702_003:0193b27_18"
    },
    {
        "source_sentence": "如下文說：「相想即心境也，心境兩忘故云除。」",
        "translation": "As explained in the following text, characteristics and conceptions are mind and objects, and because both mind and objects are forgotten, it's called removal.",
        "source": "T33n1702_003:0193b28_19"
    },
    {
        "source_sentence": "十一者，經從「須菩提！",
        "translation": "Eleventh, the sūtra follows from Suppository!",
        "source": "T33n1702_003:0193b29_20"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T33n1702_003:0193c01_21"
    },
    {
        "source_sentence": "可以三十二相見如來不？",
        "translation": "Can you see the Tathāgata in thirty-two distinctive marks?",
        "source": "T33n1702_003:0193c01_22"
    },
    {
        "source_sentence": "乃至是名三十二相。」",
        "translation": "Up to this point, these are called the thirty-two marks.",
        "source": "T33n1702_003:0193c02_23"
    },
    {
        "source_sentence": "離福下。",
        "translation": "It's below the level of freedom from merit.",
        "source": "T33n1702_003:0193c02_24"
    },
    {
        "source_sentence": "所離障。",
        "translation": "It's the hindrance that's removed.",
        "source": "T33n1702_003:0193c02_25"
    },
    {
        "source_sentence": "欲入聖道須福資糧，如人遠行豈可空往。",
        "translation": "Those who want to enter the noble path need provisions of merit, just like a person traveling far away can't go in vain.",
        "source": "T33n1702_003:0193c03_26"
    },
    {
        "source_sentence": "佛為至聖是福之因，供養給侍無不獲福，即以此福為其資糧。",
        "translation": "Because the Buddha is the ultimate sage, it's a cause of merit, and there's nothing that doesn't obtain merit when he makes offerings to his attendants, which are the accumulation of merit.",
        "source": "T33n1702_003:0193c04_0"
    },
    {
        "source_sentence": "若供養得福，即是住非障，反之則是障非住也。",
        "translation": "If an offering obtains merit, it's abiding and not hindrances, and the opposite is hindrances and not abiding.",
        "source": "T33n1702_003:0193c05_1"
    },
    {
        "source_sentence": "不以下。",
        "translation": "It's not below.",
        "source": "T33n1702_003:0193c06_2"
    },
    {
        "source_sentence": "或問：「文云不以相見如來。",
        "translation": "Some people may ask, The text says that they don't see the Tathāgata in terms of characteristics.",
        "source": "T33n1702_003:0193c06_3"
    },
    {
        "source_sentence": "如來尚不得見，云何給侍耶？」",
        "translation": "The Tathāgata hasn't yet seen it, so how can he give it to an attendant?",
        "source": "T33n1702_003:0193c07_4"
    },
    {
        "source_sentence": "故此釋也。",
        "translation": "That's why this explanation is so.",
        "source": "T33n1702_003:0193c07_5"
    },
    {
        "source_sentence": "此即但以智慧隨順相應，名為給侍。",
        "translation": "This is simply because it's associated with wisdom and following, which is called an attendant.",
        "source": "T33n1702_003:0193c08_6"
    },
    {
        "source_sentence": "然非謂棄却相身別侍無相之佛，但了相即非相，不生執著乃曰相應。",
        "translation": "However, it doesn't mean that the Buddha who abandons marks and separately serves markless buddhas in his body but understands marks are not marks, and when he doesn't give rise to attachment, it's called associated.",
        "source": "T33n1702_003:0193c08_7"
    },
    {
        "source_sentence": "凡所供養親近恭敬，皆名給侍。",
        "translation": "All the offerings that are offered to them, being intimate and respectful, are all called attendants.",
        "source": "T33n1702_003:0193c10_8"
    },
    {
        "source_sentence": "若生執著不順於理，雖常見佛不名為見。",
        "translation": "If someone gives rise to an attachment that doesn't follow the principle, even though they often see buddhas and aren't called views.",
        "source": "T33n1702_003:0193c11_9"
    },
    {
        "source_sentence": "如下文云：「若以色見我，以音聲求我，是人行邪道，不能見如來。」",
        "translation": "As the following text says, If someone sees self with form and asks for self with sound, they're engaged in a wrong path that doesn't allow them to see the Tathāgata.",
        "source": "T33n1702_003:0193c12_10"
    },
    {
        "source_sentence": "《華嚴》云：「若人百千劫，常隨於如來，不了真實義，盲瞑不見佛。」",
        "translation": "The Flower Ornament says, If a person always follows the Tathāgata for a hundred thousand eons and doesn't understand the true meaning, they'll be blind and invisible to the Buddha.",
        "source": "T33n1702_003:0193c13_11"
    },
    {
        "source_sentence": "又如佛昔三月昇忉利天，為母說法後降閻浮，有蓮華色比丘尼，欲先見佛，",
        "translation": "“Furthermore, just as the Buddha ascended to the Trāyastriṃśa gods in three months to preach the Dharma to his mother and then descended to Jambudvīpa, so there were bhikṣuṇīs of the lotus-colored hue who wished to see the Buddha first.",
        "source": "T33n1702_003:0193c14_12"
    },
    {
        "source_sentence": "化作轉輪王，隊仗往至佛所。",
        "translation": "He transformed himself into a wheel-turning king and went to the Buddha with his troops of soldiers.",
        "source": "T33n1702_003:0193c16_13"
    },
    {
        "source_sentence": "佛乃訶之具陳上事。",
        "translation": "The Buddha then reprimanded him and explained the above matters in detail.",
        "source": "T33n1702_003:0193c17_14"
    },
    {
        "source_sentence": "時須菩提在於山中，亦欲見佛，尋復思念：「空無相理是真法身，何用見色相。」",
        "translation": "When Suppository was in the mountains, he also wanted to see the Buddha and then thought, The principle of emptiness and signlessness is really the Dharma body, so why would it be necessary to see form and characteristics?",
        "source": "T33n1702_003:0193c17_15"
    },
    {
        "source_sentence": "言已復坐竟不往見。",
        "translation": "After he said this, he resumed his seat and didn't go to see him.",
        "source": "T33n1702_003:0193c19_16"
    },
    {
        "source_sentence": "於是佛告蓮華色言：「須菩提先見我竟，汝已在後。」",
        "translation": "The Buddha then addressed Padmasaṃbhava, saying, Suppository, you were behind me when you first saw me finish.",
        "source": "T33n1702_003:0193c19_17"
    },
    {
        "source_sentence": "故知執相迷真對面千里，虛心體物天地一家。",
        "translation": "Therefore, it's known that they cling to characteristics and are deluded about the true face facing each other for a thousand miles, which is empty of mind, body, things, and one family of heaven and earth.",
        "source": "T33n1702_003:0193c21_18"
    },
    {
        "source_sentence": "故古人云：「肝膽雖近，情生則隔；",
        "translation": "That is why ancient people said: Although the liver and gallbladder are near one another, feelings arise separately.",
        "source": "T33n1702_003:0193c22_19"
    },
    {
        "source_sentence": "江山雖緬，道契則隣。」",
        "translation": "Although the rivers and mountains are mixed, the path is shared with the neighbors.",
        "source": "T33n1702_003:0193c22_20"
    },
    {
        "source_sentence": "是知通達妙理方真給侍，若斯給侍是侍真佛，故所獲福無有邊際。",
        "translation": "This is how we know that he understands the marvelous principle of the true way to give an attendant, and if this is the true Buddha who gives an attendant, there's no limit to the merit gained.",
        "source": "T33n1702_003:0193c23_21"
    },
    {
        "source_sentence": "十二者，經從「須菩提！",
        "translation": "12. The sūtra follows, Subhūti!",
        "source": "T33n1702_003:0193c24_22"
    },
    {
        "source_sentence": "若有善男子、善女人，以恒河沙等身布施，乃至是名第一波羅蜜。」",
        "translation": "If there are good men and good women who give with their bodies as numerous as the sands of the Ganges River, this is called the first perfection.",
        "source": "T33n1702_003:0193c25_23"
    },
    {
        "source_sentence": "離樂下。",
        "translation": "It's below the level of freedom from pleasure.",
        "source": "T33n1702_003:0193c26_24"
    },
    {
        "source_sentence": "是所離障。",
        "translation": "These are the hindrances that are removed.",
        "source": "T33n1702_003:0193c26_25"
    },
    {
        "source_sentence": "然障名有所闕略，若取周備不過住名。",
        "translation": "However, the names of the obstacles are omitted.",
        "source": "T33n1702_003:0193c27_26"
    },
    {
        "source_sentence": "但樂味成障、遠離成住。",
        "translation": "But the taste of pleasure becomes an obstruction, and seclusion becomes a abode.",
        "source": "T33n1702_003:0193c28_0"
    },
    {
        "source_sentence": "且約為障起過有其五重：一、為身求利。",
        "translation": "Moreover, there are five kinds of faults that arise in terms of hindrances: 1. Seeking profit for the body.",
        "source": "T33n1702_003:0193c28_1"
    },
    {
        "source_sentence": "二、由求利養令身疲乏；",
        "translation": "The second is to cause exhaustion of the body by seeking gain.",
        "source": "T33n1702_003:0193c29_2"
    },
    {
        "source_sentence": "此復有二：一、由放逸令身疲乏，二、求不得身亦疲乏。",
        "translation": "Again, there are two kinds of this: 1. it causes the body to become weary because of carelessness, and 2. it also exhausts the body that doesn't get what it wants.",
        "source": "T33n1702_003:0193c29_3"
    },
    {
        "source_sentence": "三、由身疲故令心熱惱。",
        "translation": "3. It's because the body is weary that it causes the mind to become feverish.",
        "source": "T33n1702_003:0194a02_4"
    },
    {
        "source_sentence": "四、由心熱惱故不起精進。",
        "translation": "4. It's because the mind is hot and tormented that it doesn't give rise to effort.",
        "source": "T33n1702_003:0194a02_5"
    },
    {
        "source_sentence": "五、由不精進故退失功德。",
        "translation": "5. It's because they don't make effort that they regress in merit.",
        "source": "T33n1702_003:0194a03_6"
    },
    {
        "source_sentence": "恒沙命施下。",
        "translation": "It's below the level of the life-giving in the Ganges River.",
        "source": "T33n1702_003:0194a03_7"
    },
    {
        "source_sentence": "釋成對治。",
        "translation": "He explains the accomplishment of antidotes.",
        "source": "T33n1702_003:0194a04_8"
    },
    {
        "source_sentence": "經苦校量意令改革，以見大利故不求小利，既不求利身則不疲，身既不疲心則不惱，",
        "translation": "Because he sees great benefits, he doesn't seek lesser benefits. If he doesn't seek benefit, his body won't be weary, and if his body isn't weary, his mind isn't disturbed.",
        "source": "T33n1702_003:0194a04_9"
    },
    {
        "source_sentence": "心既不惱則起精進，既起精進則能受持獲無邊福。",
        "translation": "Since the mind isn't disturbed, then it gives rise to effort, and since it gives rise to effort, it's possible to receive and maintain limitless merit.",
        "source": "T33n1702_003:0194a06_10"
    },
    {
        "source_sentence": "故知經意為治此障成其住也。",
        "translation": "Therefore, it's known that the meaning of the sūtras is to cure this hindrance and make it abide.",
        "source": "T33n1702_003:0194a07_11"
    },
    {
        "source_sentence": "一身者。",
        "translation": "A body is a body.",
        "source": "T33n1702_003:0194a08_12"
    },
    {
        "source_sentence": "一報身也。",
        "translation": "One is the body of retribution.",
        "source": "T33n1702_003:0194a08_13"
    },
    {
        "source_sentence": "意云：豈為一報之身，終日求名求利，求之不足未始稱情，縱使多財死為他物。",
        "translation": "It means, wouldn't it be for the sake of a single reward body that spends all day seeking fame and profit but doesn't have enough to seek it before he begins to praise it, even if he were to give up his wealth and die as someone else's property?",
        "source": "T33n1702_003:0194a08_14"
    },
    {
        "source_sentence": "持經功德無量無邊，盡未來際用之不竭。",
        "translation": "The merit of upholding the sūtras is immeasurable and limitless, and it won't be exhausted until the end of the future.",
        "source": "T33n1702_003:0194a10_15"
    },
    {
        "source_sentence": "利害若此，人何不然？",
        "translation": "If this is the case for profit and loss, why wouldn't people?",
        "source": "T33n1702_003:0194a11_16"
    },
    {
        "source_sentence": "《無常經》云：「眷屬皆捨去，財貨任他將，但持自善根，險道充糧食。」",
        "translation": "The Impermanent Sutra says, All the members of his family abandoned their possessions and relied on others to manage them, but they maintained their own good roots and went down dangerous paths to store up food.",
        "source": "T33n1702_003:0194a11_17"
    },
    {
        "source_sentence": "十三者，經從「須菩提！",
        "translation": "The thirteenth is the sūtra that follows, Subhūti!",
        "source": "T33n1702_003:0194a13_18"
    },
    {
        "source_sentence": "忍辱波羅蜜；",
        "translation": "The transcendent of forbearance.",
        "source": "T33n1702_003:0194a13_19"
    },
    {
        "source_sentence": "乃至如人有目，日光明照見種種色。」",
        "translation": "It's like when a person has eyes, the sun shines brightly and sees various forms.",
        "source": "T33n1702_003:0194a13_20"
    },
    {
        "source_sentence": "離不下。",
        "translation": "It's free and doesn't go down.",
        "source": "T33n1702_003:0194a14_21"
    },
    {
        "source_sentence": "所離障。",
        "translation": "It's the hindrance that's removed.",
        "source": "T33n1702_003:0194a14_22"
    },
    {
        "source_sentence": "此但不忍為障，忍之成住也。",
        "translation": "These are simply the hindrance of not tolerating, which is the formation and abiding of forbearance.",
        "source": "T33n1702_003:0194a15_23"
    },
    {
        "source_sentence": "無我下。",
        "translation": "It's below selflessness.",
        "source": "T33n1702_003:0194a15_24"
    },
    {
        "source_sentence": "出忍之所以也。",
        "translation": "It's the reason for coming out of forbearance.",
        "source": "T33n1702_003:0194a15_25"
    },
    {
        "source_sentence": "斯有兩意，所謂通別。",
        "translation": "These have two meanings, which are called shared and distinct.",
        "source": "T33n1702_003:0194a16_26"
    },
    {
        "source_sentence": "通則由無我相，雖累遭割截常能忍受。",
        "translation": "In general, it is because of the characteristic of selflessness that they are always able to endure suffering even if their burdens are cut off.",
        "source": "T33n1702_003:0194a16_27"
    },
    {
        "source_sentence": "別則由無我故能忍，由累苦故能忍也。",
        "translation": "In di›erence, it is because of the absence of self that they are able to endure. It is because of the accumulation of suffering that they are able to endure.",
        "source": "T33n1702_003:0194a17_28"
    },
    {
        "source_sentence": "十四者，經從「須菩提！",
        "translation": "14. The sūtra follows, Suppository!",
        "source": "T33n1702_003:0194a18_29"
    },
    {
        "source_sentence": "當來之世若有善男子、善女人，能於此經受持讀誦，乃至果報亦不可思議。」",
        "translation": "In a future life, if there are good men and good women who can memorize and recite this sūtra, the rewards will be inconceivable.",
        "source": "T33n1702_003:0194a19_0"
    },
    {
        "source_sentence": "離智下。",
        "translation": "It's below the level of freedom from cognition.",
        "source": "T33n1702_003:0194a20_1"
    },
    {
        "source_sentence": "所離障。",
        "translation": "It's the hindrance that's removed.",
        "source": "T33n1702_003:0194a20_2"
    },
    {
        "source_sentence": "若耽寂無智，即是障非住，若離寂修智，即是住非障。",
        "translation": "If someone is addicted to quiescence and lacks cognition, it's not abiding as an obstruction, and if they part with quiescence and cultivate cognition, it's abiding as an obstruction and not an obstruction.",
        "source": "T33n1702_003:0194a21_0"
    },
    {
        "source_sentence": "日三時下。",
        "translation": "It's below the three watches of the day.",
        "source": "T33n1702_003:0194a22_1"
    },
    {
        "source_sentence": "指經對治。",
        "translation": "It refers to the antidote of the sūtras.",
        "source": "T33n1702_003:0194a22_2"
    },
    {
        "source_sentence": "意云：欲證聖性非智不階，經苦校量意在策發。",
        "translation": "The idea is: wanting to realize that the noble nature isn't a stage of cognition and doesn't follow steps, the sūtras are painful in their analytical deliberation, and the intention is to encourage it.",
        "source": "T33n1702_003:0194a22_3"
    },
    {
        "source_sentence": "此同《華嚴經》中訶勸之相，彼云：「法性真常離心念，二乘於此亦能得，",
        "translation": "This is the same as the characteristic of the exhortation in the Flower Ornament Sutra, which says, The true nature of dharmas is always apart from thought, and so can the two vehicles attain it.",
        "source": "T33n1702_003:0194a23_4"
    },
    {
        "source_sentence": "不以此故為世尊，但以甚深無閡智。」",
        "translation": "It's not because of this that I'm the Bhagavān but because of my profound, unobstructed wisdom.",
        "source": "T33n1702_003:0194a25_5"
    },
    {
        "source_sentence": "然此是對治之別意，故須一向而言，令人捨定修慧。",
        "translation": "However, these are the specific meanings of the antidote. Therefore, it is necessary to say in a general way that they enable one to abandon samdhi and develop wisdom.",
        "source": "T33n1702_003:0194a26_6"
    },
    {
        "source_sentence": "若據究竟通論，必須定慧等學。",
        "translation": "If we rely on the ultimate and general theories, we must train in such things as concentration and wisdom.",
        "source": "T33n1702_003:0194a27_7"
    },
    {
        "source_sentence": "《涅槃經》中說：「定慧不等不見佛性，無明邪見自此而生。」",
        "translation": "In the Nirvāṇa-sūtra, it's said, Concentration and wisdom don't equally see the buddha-nature, and ignorance and wrong views arise from this.",
        "source": "T33n1702_003:0194a27_8"
    },
    {
        "source_sentence": "前第十一住便是定門，對治不同故須然也。",
        "translation": "The previous eleventh abode is the gate of concentration, and it's necessary because the antidotes are different.",
        "source": "T33n1702_003:0194a29_9"
    },
    {
        "source_sentence": "修習之者須兼行之。",
        "translation": "Those who cultivate it must practice it at the same time.",
        "source": "T33n1702_003:0194b01_10"
    },
    {
        "source_sentence": "十五者，經從「爾時，須菩提白佛言：世尊，乃至實無有法發阿耨多羅三藐三菩提者。」",
        "translation": "Fifteenth, the sūtra goes on to say, At that point, Suppository said to the Buddha, Bhagavān, there really isn't a way to give rise to unsurpassed, correct, and complete enlightenment.",
        "source": "T33n1702_003:0194b01_11"
    },
    {
        "source_sentence": "離十一下。",
        "translation": "It's below the level of freedom from the eleven.",
        "source": "T33n1702_003:0194b03_12"
    },
    {
        "source_sentence": "所離障。",
        "translation": "It's the hindrance that's removed.",
        "source": "T33n1702_003:0194b03_13"
    },
    {
        "source_sentence": "謂動不自攝，則是障非住；",
        "translation": "When movement is not self-contained, it is neither an obstruction nor a continuance.",
        "source": "T33n1702_003:0194b03_14"
    },
    {
        "source_sentence": "若自攝不動，則是住非障也。",
        "translation": "If it doesn't move when self-contained, then abiding is not an obstruction.",
        "source": "T33n1702_003:0194b04_15"
    },
    {
        "source_sentence": "論中則云自取障。",
        "translation": "The treatise then says that it's the hindrance of self-grasping.",
        "source": "T33n1702_003:0194b05_16"
    },
    {
        "source_sentence": "我能下。",
        "translation": "It's below self and what I can do.",
        "source": "T33n1702_003:0194b05_17"
    },
    {
        "source_sentence": "釋。",
        "translation": "It's explained.",
        "source": "T33n1702_003:0194b05_18"
    },
    {
        "source_sentence": "意云：由計我故，遂起降住勝能之心，不覺喜動故不自攝。",
        "translation": "It means that because they conceptualize self, they then give rise to a mind capable of subjugating and abiding, which doesn't perceive joy and therefore doesn't take it in themselves.",
        "source": "T33n1702_003:0194b05_19"
    },
    {
        "source_sentence": "今經既云：「無一眾生得滅度」，無法得菩提，則不計勝能，故能對治也。",
        "translation": "Now, since the sūtra says, There's no single sentient being who attains cessation, and there's no one who can attain enlightenment, then they don't think of superior abilities as being able to counteract them.",
        "source": "T33n1702_003:0194b07_20"
    },
    {
        "source_sentence": "十六，經從「須菩提！",
        "translation": "Sixteen, the sūtra follows, Suppository!",
        "source": "T33n1702_003:0194b08_21"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T33n1702_003:0194b09_22"
    },
    {
        "source_sentence": "如來於然燈佛所，有法得阿耨多羅三藐三菩提不？",
        "translation": "Is there a way for the Tathāgata to attain supreme perfect enlightenment in the presence of Rājagṛha Buddha?",
        "source": "T33n1702_003:0194b09_23"
    },
    {
        "source_sentence": "乃至是故名一切法。」",
        "translation": "It's therefore called all dharmas.",
        "source": "T33n1702_003:0194b10_24"
    },
    {
        "source_sentence": "離十二下。",
        "translation": "It's below the level of freedom from the twelve.",
        "source": "T33n1702_003:0194b10_25"
    },
    {
        "source_sentence": "若無教授即是障非住，若得教授即是住非障。",
        "translation": "If someone doesn't teach, it's a hindrance and not an abode, and if they attain teaching, it's an abode and not an obstruction.",
        "source": "T33n1702_003:0194b11_26"
    },
    {
        "source_sentence": "欲入下。",
        "translation": "It's below the level of wanting to enter.",
        "source": "T33n1702_003:0194b12_27"
    },
    {
        "source_sentence": "釋成住義。",
        "translation": "He explains the meaning of accomplishing abiding.",
        "source": "T33n1702_003:0194b12_28"
    },
    {
        "source_sentence": "雖三賢位中亂修六度經一無數劫，欲入聖道要佛策發，故於資糧位後立加行名。",
        "translation": "Even though it takes countless eons to cultivate the six perfections in disorder during the three stages of goodness, those who want to enter the noble path must be encouraged by buddhas, so they're given the name applied practices after the stage of accumulation.",
        "source": "T33n1702_003:0194b12_29"
    },
    {
        "source_sentence": "其猶鑽火，火欲出時倍加功力。",
        "translation": "It's like drilling a fire, which doubles its power when the fire wants to come out.",
        "source": "T33n1702_003:0194b14_30"
    },
    {
        "source_sentence": "遇佛然燈佛也。",
        "translation": "He meets the Buddha, and he's the lamp-shining buddha.",
        "source": "T33n1702_003:0194b15_31"
    },
    {
        "source_sentence": "得無所得者，即然燈與善慧授記，當得作佛號釋迦牟尼，非佛與法故云無得。",
        "translation": "Someone who attains nothing is given the assurance that they'll become a buddha named Śākyamuni because it's not the Buddha or the Dharma and therefore called having no attainment.",
        "source": "T33n1702_003:0194b15_32"
    },
    {
        "source_sentence": "問：「此說善慧得記進入八地，何故將此配地前耶？」",
        "translation": "Q: This explains that good wisdom attains entry into the eighth ground, so why is it placed before the ground?",
        "source": "T33n1702_003:0194b17_33"
    },
    {
        "source_sentence": "答：「欲入初地須學八地，用心方可得入。",
        "translation": "Answer: If you want to enter the first ground, you must train in the eighth ground, and it's only by focusing your mind that you can enter.",
        "source": "T33n1702_003:0194b18_34"
    },
    {
        "source_sentence": "若學初地竟不能入，如人學射可知。",
        "translation": "If someone trains in the first ground but can't enter, it's like a person who trains in archery and can be known.",
        "source": "T33n1702_003:0194b19_35"
    },
    {
        "source_sentence": "又將證八地猶須教授，欲入見道豈得不然。",
        "translation": "He's about to realize the eighth ground, but he still needs to teach it, so why wouldn't he want to enter the path of seeing?",
        "source": "T33n1702_003:0194b20_36"
    },
    {
        "source_sentence": "然從第五至此住中，每住對治一障，此障障於見道，今則加行位極對治已盡，",
        "translation": "However, from the fifth to this pleasurable state, each time he abides there, he is opposed to one obstacle. This obstacle obstructs him in the path of insight. Now that he has exhausted the ultimate antidote of applied practices,",
        "source": "T33n1702_003:0194b21_37"
    },
    {
        "source_sentence": "故云而證道矣。」",
        "translation": "That's why it's called realizing the path.",
        "source": "T33n1702_003:0194b22_38"
    },
    {
        "source_sentence": "十七者，經從「須菩提！",
        "translation": "17. The sūtra follows, Suppository!",
        "source": "T33n1702_003:0194b23_39"
    },
    {
        "source_sentence": "譬如人身長大，乃至佛說一切法無我、無人、無眾生、無壽者。」",
        "translation": "It's like a person whose body grows larger, even when the Buddha teaches that all things lack self, no person, no sentient beings, and no life span.",
        "source": "T33n1702_003:0194b23_40"
    },
    {
        "source_sentence": "攝種性下。",
        "translation": "It's below gathering in the seed nature.",
        "source": "T33n1702_003:0194b25_41"
    },
    {
        "source_sentence": "釋成住義。",
        "translation": "He explains the meaning of accomplishing abiding.",
        "source": "T33n1702_003:0194b25_42"
    },
    {
        "source_sentence": "智體即觀照，般若是能證也。",
        "translation": "The essence of wisdom is contemplation, and prajñā is the ability to realize it.",
        "source": "T33n1702_003:0194b25_43"
    },
    {
        "source_sentence": "即妙平二智無分別也。",
        "translation": "That is, the two kinds of marvelous and peaceful cognition have no distinctions.",
        "source": "T33n1702_003:0194b26_44"
    },
    {
        "source_sentence": "以得此智生如來家，決定紹佛種，故斯則地前加行之智，至於初地轉受此名。",
        "translation": "Because he attains this knowledge, he's born in the Tathāgata's home and determined to cultivate the Buddha's lineage; therefore, this is the knowledge of applied practices before the ground up to the first ground that receives this name.",
        "source": "T33n1702_003:0194b26_45"
    },
    {
        "source_sentence": "證遍等者，體即實相般若，是所證也，以遍在一切法中故。",
        "translation": "To realize pervasiveness and so forth means that the essence is the true characteristic of prajñā, which is realized because it pervades all dharmas.",
        "source": "T33n1702_003:0194b28_46"
    },
    {
        "source_sentence": "《唯識》云：「由此真如二空所顯，無有一法而不在故。」",
        "translation": "The Consciousness-only says, Thus, there's no single thing that isn't present because it's revealed by the two kinds of emptiness of true reality and emptiness.",
        "source": "T33n1702_003:0194b29_47"
    },
    {
        "source_sentence": "論中則名平等智。",
        "translation": "In the treatise, it's called equal wisdom.",
        "source": "T33n1702_003:0194c01_48"
    },
    {
        "source_sentence": "然有五種平等因緣：一、麁惡平等，二、法無我平等，三、斷相應平等，",
        "translation": "However, there are five kinds of equal causes and conditions: 1. the equality of wickedness; 2. the equality of selflessness of things; 3. the equality of those associated with annihilation.",
        "source": "T33n1702_003:0194c02_49"
    },
    {
        "source_sentence": "四、無希望心平等，五、一切菩薩證道平等。",
        "translation": "4. equality of hopeless mind, and 5. equality of all bodhisattvas realizing the path.",
        "source": "T33n1702_003:0194c03_50"
    },
    {
        "source_sentence": "有是五種因緣，故名平等智。",
        "translation": "Because there are these five kinds of causes and conditions, it's called equal cognition.",
        "source": "T33n1702_003:0194c04_51"
    },
    {
        "source_sentence": "故論云：「入證道時得二種智。",
        "translation": "That's why the treatise says, When he enters the path of realization, he attains two kinds of cognition.",
        "source": "T33n1702_003:0194c05_52"
    },
    {
        "source_sentence": "一、攝種性智，二、平等智也。」",
        "translation": "1. the cognition of gathering seed natures, and 2. the cognition of equality.",
        "source": "T33n1702_003:0194c06_0"
    },
    {
        "source_sentence": "然所證是理，今云智者斯有兩意：一準《起信》論云：「依此法身說名本覺。」",
        "translation": "However, what's realized is the principle, and now it's called wisdom. This has two meanings: first, according to the Awakening of Faith Treatise, saying, Based on this Dharma body, it's said to be called originally enlightened.",
        "source": "T33n1702_003:0194c06_1"
    },
    {
        "source_sentence": "二則理智冥合能所不殊，如珠與光不相捨離。",
        "translation": "Second, principle and wisdom are combined in a mysterious way that the subjective and the objective aren't different, just as the pearl and light aren't separate from each other.",
        "source": "T33n1702_003:0194c08_2"
    },
    {
        "source_sentence": "成法報身者。",
        "translation": "It's the body that accomplishes the karmic retribution of the Dharma.",
        "source": "T33n1702_003:0194c09_3"
    },
    {
        "source_sentence": "攝種性智至果得成報身，平等智至果得成法身。",
        "translation": "The knowledge of gathering seed nature up to the fruit obtains the body as retribution, and the knowledge of equality up to the fruit obtains the Dharma body.",
        "source": "T33n1702_003:0194c09_4"
    },
    {
        "source_sentence": "故長大者，論即云妙大。",
        "translation": "That's why it's called marvelously large because the treatise says that it grows in size.",
        "source": "T33n1702_003:0194c10_5"
    },
    {
        "source_sentence": "妙即報身，以萬行功德所莊嚴故。",
        "translation": "Marvelous is the body of retribution because it's adorned by the merit of myriad practices.",
        "source": "T33n1702_003:0194c11_6"
    },
    {
        "source_sentence": "大即法身，真如實理遍一切故。",
        "translation": "The great is the Dharma body, because the true nature of reality and principle pervade all.",
        "source": "T33n1702_003:0194c11_7"
    },
    {
        "source_sentence": "十八者，自此已下皆求佛地。",
        "translation": "18. From here on, they'll all seek the Buddhahood.",
        "source": "T33n1702_003:0194c12_8"
    },
    {
        "source_sentence": "於中復有六種具足。",
        "translation": "Among them, there are another six kinds of fulfillment.",
        "source": "T33n1702_003:0194c13_9"
    },
    {
        "source_sentence": "具足者。",
        "translation": "Those who are fully endowed...",
        "source": "T33n1702_003:0194c13_10"
    },
    {
        "source_sentence": "圓滿義。",
        "translation": "It's the meaning of perfect.",
        "source": "T33n1702_003:0194c13_11"
    },
    {
        "source_sentence": "謂轉捨二障，轉得菩提涅槃，攝轉具足也。",
        "translation": "They are the two hindrances of turning away and attaining enlightenment and nirvāṇa, which are collected and perfected in turn.",
        "source": "T33n1702_003:0194c14_12"
    },
    {
        "source_sentence": "既證聖性生如來家，須示佛果功德令其欣趣。",
        "translation": "Having realized the noble nature, they'll be born in the Tathāgata's home, and they must show the merit of the Buddha's fruit so that they'll delight in it.",
        "source": "T33n1702_003:0194c15_13"
    },
    {
        "source_sentence": "然其果德雖多，以要言之，不出依正二報。",
        "translation": "However, even though the result is abundant in virtue, it doesn't come from the two karmic retributions of direct and circumstantial.",
        "source": "T33n1702_003:0194c16_14"
    },
    {
        "source_sentence": "二報之內先明所依，若無所依，能依何立？",
        "translation": "Within the two kinds of retribution, it first explains the basis. If there is no basis, how can a basis be established?",
        "source": "T33n1702_003:0194c17_15"
    },
    {
        "source_sentence": "正報之內不踰福智，智引福故先智後福，然後別顯三業，依次所明。",
        "translation": "Within the right retribution, there's no greater than merit and wisdom, because wisdom leads to merit, knowledge comes first and subsequent merit comes second, and then the three actions are separately expressed, which are explained in order.",
        "source": "T33n1702_003:0194c18_0"
    },
    {
        "source_sentence": "一、經從「須菩提！",
        "translation": "1. The sūtra follows, Subhūti!",
        "source": "T33n1702_003:0194c19_1"
    },
    {
        "source_sentence": "若菩薩作是言：『我當莊嚴佛土。』",
        "translation": "Suppose a bodhisattva says, 'I will adorn the Buddha's land.'",
        "source": "T33n1702_003:0194c19_2"
    },
    {
        "source_sentence": "是不名菩薩，乃至若菩薩通達無我法者，如來說名真是菩薩。」",
        "translation": "It's not called a bodhisattva, and even if a bodhisattva understands the teaching of selflessness, the Tathāgata says it's really a bodhisattva.",
        "source": "T33n1702_003:0194c20_3"
    },
    {
        "source_sentence": "此教下。",
        "translation": "It's below this teaching.",
        "source": "T33n1702_003:0194c22_0"
    },
    {
        "source_sentence": "指位。",
        "translation": "It refers to the level.",
        "source": "T33n1702_003:0194c22_1"
    },
    {
        "source_sentence": "即從二地至於等覺，當修道位。",
        "translation": "That is, from the second ground up to the stage of virtual enlightenment, they'll cultivate the path.",
        "source": "T33n1702_003:0194c22_2"
    },
    {
        "source_sentence": "謂莊嚴之時離能所相，名之為淨。",
        "translation": "When it's adorned, it's free of subjective and objective characteristics, which is called purity.",
        "source": "T33n1702_003:0194c23_0"
    },
    {
        "source_sentence": "稱周法界故云具足。",
        "translation": "It's called pervading the Dharma realm, so it's called complete.",
        "source": "T33n1702_003:0194c23_1"
    },
    {
        "source_sentence": "故經云：「通達無我法者，如來說名真是菩薩。」",
        "translation": "That's why the sūtra says, He who understands the teaching of selflessness is called a true bodhisattva by the Tathāgata.",
        "source": "T33n1702_003:0194c24_2"
    },
    {
        "source_sentence": "二者，經從「須菩提！",
        "translation": "Second, the sūtra follows from Suppository!",
        "source": "T33n1702_003:0194c25_3"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T33n1702_003:0194c25_4"
    },
    {
        "source_sentence": "如來有肉眼不？",
        "translation": "Does the Tathāgata have physical eyes?",
        "source": "T33n1702_003:0194c25_5"
    },
    {
        "source_sentence": "乃至未來心不可得。」",
        "translation": "It's unobtainable even in the future mind.",
        "source": "T33n1702_003:0194c26_6"
    },
    {
        "source_sentence": "見淨者即五眼也。",
        "translation": "The purity of views is the five eyes.",
        "source": "T33n1702_003:0194c26_7"
    },
    {
        "source_sentence": "見即無見名之為淨，無所不見名為具足。",
        "translation": "Seeing that there's no view is called purity, and seeing nothing what's not seen is called complete.",
        "source": "T33n1702_003:0194c27_8"
    },
    {
        "source_sentence": "智淨者即悉知諸心等，知即無知名之為淨，無所不知名為具足。",
        "translation": "The purity of knowledge is that which fully knows all the minds and so forth, knows that there's nothing to be known as pure, doesn't know anything, and is called complete.",
        "source": "T33n1702_003:0194c28_9"
    },
    {
        "source_sentence": "以智見不別故當一處。",
        "translation": "Because knowledge and views aren't distinct, they should be in one place.",
        "source": "T33n1702_003:0194c29_10"
    },
    {
        "source_sentence": "此下等即指位，揀非修道，即無學位也。",
        "translation": "The following is the point of reference, which selects what's not cultivated, which is the stage of post-learning.",
        "source": "T33n1702_003:0195a01_11"
    },
    {
        "source_sentence": "下之四段皆合有無上之言，故云貫通下四三者，經從「須菩提！",
        "translation": "The next four paragraphs all combine with the words unsurpassed, so it's called penetrating the next four or three, as the sūtra says, Subhūti!",
        "source": "T33n1702_003:0195a01_12"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T33n1702_003:0195a03_13"
    },
    {
        "source_sentence": "若人滿三千大千世界七寶以用布施，乃至以福德無故，如來說得福德多。」",
        "translation": "If someone fills the 3,000 great one-thousand worlds with seven treasures and uses them for generosity, even if their merit isn't present, the Tathāgata says they'll attain much merit.",
        "source": "T33n1702_003:0195a03_14"
    },
    {
        "source_sentence": "問：「前已頻說施福，與此何別？」",
        "translation": "Q: I've often explained the merit of giving, so what's the difference between it and this?",
        "source": "T33n1702_003:0195a05_15"
    },
    {
        "source_sentence": "答：「前所說者，皆是校量不及受持之福。",
        "translation": "Answer: What was said earlier is that they're all measured and not as good as the merit of accepting and upholding.",
        "source": "T33n1702_003:0195a05_16"
    },
    {
        "source_sentence": "今此說者，乃是無住稱性之福非能校量，故不同也。」",
        "translation": "Now, this explanation is because the merit that doesn't abide in namelessness isn't capable of being measured, so it's different.",
        "source": "T33n1702_003:0195a06_17"
    },
    {
        "source_sentence": "問：「佛是果，布施是因，云何果中即說因行？」",
        "translation": "Q: The Buddha is the result, and generosity is the cause; what's the causal practice that's explained in the result?",
        "source": "T33n1702_003:0195a07_18"
    },
    {
        "source_sentence": "答：「凡是果德皆彼因成，舉彼無住之因，以彰稱性之福也。」",
        "translation": "Answer: All these fruits of virtue are formed by those causes, and they're cited as the causes that don't abide to show the merit of their praiseworthy nature.",
        "source": "T33n1702_003:0195a08_19"
    },
    {
        "source_sentence": "言自在者，揀有漏之福不自在也。",
        "translation": "The expression self-dependence refers to selecting contaminated merit that's not self-contained.",
        "source": "T33n1702_003:0195a10_20"
    },
    {
        "source_sentence": "若準論中，此與智淨合為一段，意明福智不相離故，則於身中開之為二，",
        "translation": "In the standard treatise, this is combined with knowledge and purity as a section. The idea is that since merit and knowledge are not separate, then they are said to be two within the body.",
        "source": "T33n1702_003:0195a10_21"
    },
    {
        "source_sentence": "謂色身具足亦盈六數。",
        "translation": "It means that the body of form is complete, and it also exceeds the number of six.",
        "source": "T33n1702_003:0195a12_22"
    },
    {
        "source_sentence": "今則合後開前者，意云福之與智迢然不同，配攝因果五六有異，異須開也。",
        "translation": "Now, it's combined with the latter to reveal the former, meaning that merit and wisdom are different from each other, and there are differences in the five or six combinations of cause and effect, which must be revealed when they're different.",
        "source": "T33n1702_003:0195a13_23"
    },
    {
        "source_sentence": "相之與好同是一身，兼對下語，意以成三業，故須合也。",
        "translation": "The characteristics and the goodness are the same as one body, but they're combined with the following words, because the mind creates three actions, so it must be combined.",
        "source": "T33n1702_003:0195a14_24"
    },
    {
        "source_sentence": "四者，經從「須菩提！",
        "translation": "The fourth is that the sūtra follows, Suppository!",
        "source": "T33n1702_003:0195a16_0"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T33n1702_003:0195a16_1"
    },
    {
        "source_sentence": "佛可以具足色身見不？",
        "translation": "Can the Buddha be endowed with physical form and body views?",
        "source": "T33n1702_003:0195a16_2"
    },
    {
        "source_sentence": "乃至是名諸相具足。」",
        "translation": "Up to this point, it's called the fulfillment of characteristics.",
        "source": "T33n1702_003:0195a17_3"
    },
    {
        "source_sentence": "此明如來真應具足。",
        "translation": "This explains that the Tathāgata's true response should be complete.",
        "source": "T33n1702_003:0195a17_4"
    },
    {
        "source_sentence": "如經云：「即非具足色身」，明真身也。",
        "translation": "As the sūtra says, That is, it doesn't have a fully developed form body, which explains the true body.",
        "source": "T33n1702_003:0195a18_5"
    },
    {
        "source_sentence": "「是名具足色身」，明應身也。",
        "translation": "This is called the body that's replete with form, which explains the response body.",
        "source": "T33n1702_003:0195a18_6"
    },
    {
        "source_sentence": "「即非諸相具足」，明真身也。",
        "translation": "That is, they aren't endowed with all characteristics, which explains the true body.",
        "source": "T33n1702_003:0195a19_7"
    },
    {
        "source_sentence": "「是名諸相具足」，明應身也。",
        "translation": "This is called the name that's fully endowed with characteristics, which explains the response body.",
        "source": "T33n1702_003:0195a20_0"
    },
    {
        "source_sentence": "五者，經從「須菩提！",
        "translation": "The fifth is that the sūtra follows, Suppository!",
        "source": "T33n1702_003:0195a20_1"
    },
    {
        "source_sentence": "汝勿謂如來作是念：『我當有所說法』，乃至是名說法。」",
        "translation": "Don't say that the Tathāgata thinks, 'I will teach something,' or even that it's called teaching.",
        "source": "T33n1702_003:0195a21_0"
    },
    {
        "source_sentence": "說而無說、無說之說，是真說法具足者。",
        "translation": "To say something without saying anything and speak it without saying anything is to truly explain the teaching that's complete.",
        "source": "T33n1702_003:0195a22_1"
    },
    {
        "source_sentence": "無法可說、無所不說，是名說法。",
        "translation": "There's nothing that can be explained and nothing that can't be explained, which is called teaching.",
        "source": "T33n1702_003:0195a23_2"
    },
    {
        "source_sentence": "六者，然於心中復有六種：一、念處，二、正覺，三、施設大利益，四、攝取法身，",
        "translation": "Sixth, there are six kinds of mind: 1. the state of mindfulness; 2. right awakening; 3. establishing great benefits; and 4. taking in the Dharma body.",
        "source": "T33n1702_003:0195a23_3"
    },
    {
        "source_sentence": "五、不住生死涅槃，六、行住淨。",
        "translation": "5. not abiding in birth-and-death and nirvāṇa, and 6. the purity of practice and abode.",
        "source": "T33n1702_003:0195a25_4"
    },
    {
        "source_sentence": "化度眾生大悲為本，故先明念處。",
        "translation": "Because great compassion for the liberation of sentient beings is the root, it first explains the mindful abode.",
        "source": "T33n1702_003:0195a26_0"
    },
    {
        "source_sentence": "自未成佛焉能度他，故次明正覺。",
        "translation": "How could he save others if he hadn't become a buddha himself? Therefore, he explains right awakening next.",
        "source": "T33n1702_003:0195a26_1"
    },
    {
        "source_sentence": "自利既滿即合利他，故次明施設大利益。",
        "translation": "Since self-benefiting is complete, it's combined with benefiting others, so the next step is to explain the establishment of great benefits.",
        "source": "T33n1702_003:0195a27_2"
    },
    {
        "source_sentence": "猶恐滯相大，次明攝取法身。",
        "translation": "They're still afraid that the characteristic of attachment is great, and next they'll explain the way to gather in the Dharma body.",
        "source": "T33n1702_003:0195a28_3"
    },
    {
        "source_sentence": "又恐住空有，故次明不住生死涅槃。",
        "translation": "Also, because it's afraid that abiding in emptiness exists, it's next explained that it doesn't abide in birth-and-death and nirvāṇa.",
        "source": "T33n1702_003:0195a29_4"
    },
    {
        "source_sentence": "又恐執施化迹，故次明行住淨也。",
        "translation": "They're also afraid to cling to the traces of generosity and transformation, so they next explain the purity of practice and abode.",
        "source": "T33n1702_003:0195a29_5"
    },
    {
        "source_sentence": "以此六義別對經文，廣如彼論避煩不敘。",
        "translation": "These six meanings are separately contrasted with the text of the sūtras, as explained in detail in the avoidance of afflictions and not described.",
        "source": "T33n1702_003:0195b01_6"
    },
    {
        "source_sentence": "又十下。",
        "translation": "Again, it's below the ten.",
        "source": "T33n1702_003:0195b02_7"
    },
    {
        "source_sentence": "二重，以八義相攝。",
        "translation": "The twofold is that they are subsumed in eight meanings.",
        "source": "T33n1702_003:0195b02_8"
    },
    {
        "source_sentence": "一者、攝是籠羅包納之義，即以普度眾生現無違反，是故配同第一發心住也。",
        "translation": "1. The meaning of gathering is to embrace, which means to universally save sentient beings without violating the present, so it's the same as the first abode of arousal of mind.",
        "source": "T33n1702_003:0195b03_9"
    },
    {
        "source_sentence": "二者、淨與相應，蓋一義耳，是故配同第二住也。",
        "translation": "The second is that it's associated with purity because it has the same meaning, so it's the same as the second abode.",
        "source": "T33n1702_003:0195b05_0"
    },
    {
        "source_sentence": "三者、雖三色四法皆是欲得，由此配同三四二住也。",
        "translation": "3. Although the three forms and four dharmas are all desired attainments, this is the same as the third, fourth, and two abodes.",
        "source": "T33n1702_003:0195b06_1"
    },
    {
        "source_sentence": "四者可知。",
        "translation": "The fourth is knowable.",
        "source": "T33n1702_003:0195b07_2"
    },
    {
        "source_sentence": "五者、正當淨心地故同此住。",
        "translation": "5. It's precisely the same as this abode because it's a pure state of mind.",
        "source": "T33n1702_003:0195b07_3"
    },
    {
        "source_sentence": "六者、正當究竟位故同此住。",
        "translation": "6. It's precisely the same as this abode because it's in the final stage.",
        "source": "T33n1702_003:0195b08_4"
    },
    {
        "source_sentence": "雖通修道就多故說。",
        "translation": "Even though it's explained in terms of many, it's said to be shared with cultivation.",
        "source": "T33n1702_003:0195b08_5"
    },
    {
        "source_sentence": "一一下。",
        "translation": "Each one is the same as the other.",
        "source": "T33n1702_003:0195b09_6"
    },
    {
        "source_sentence": "明各攝義。",
        "translation": "It explains the meaning of each being included.",
        "source": "T33n1702_003:0195b09_7"
    },
    {
        "source_sentence": "如第一住中，普度四生，廣也；",
        "translation": "In the first abode they liberate all beings from the four forms of rebirth.",
        "source": "T33n1702_003:0195b09_8"
    },
    {
        "source_sentence": "令入無餘涅槃，深也。",
        "translation": "It causes them to enter nirvāṇa without remainder, which is profound.",
        "source": "T33n1702_003:0195b10_9"
    },
    {
        "source_sentence": "實無眾生得滅度者，廣也；",
        "translation": "It is true that there are no sentient beings attain nirvana, but this is a broad interpretation.",
        "source": "T33n1702_003:0195b10_10"
    },
    {
        "source_sentence": "菩薩無我人等相者，深也。",
        "translation": "The bodhisattva's characteristic of selflessness as person and so forth is profound.",
        "source": "T33n1702_003:0195b11_11"
    },
    {
        "source_sentence": "初住既爾，餘則例知。",
        "translation": "Since this is the case for the first abode, the rest are known by analogy.",
        "source": "T33n1702_003:0195b11_12"
    },
    {
        "source_sentence": "若五百生忍，廣也；",
        "translation": "The patience of the five hundred forms of arising is wide.",
        "source": "T33n1702_003:0195b12_13"
    },
    {
        "source_sentence": "並無我人，深也。",
        "translation": "It's also profound because there's no self or person.",
        "source": "T33n1702_003:0195b12_14"
    },
    {
        "source_sentence": "若細言之，前以六住攝十八住，後以二住攝十八住，皆得滿足。",
        "translation": "If we say this in detail, the first six abodes subsume the 18 abodes, and the second two abodes subsume the 18 abodes, they'll all be fulfilled.",
        "source": "T33n1702_003:0195b13_15"
    },
    {
        "source_sentence": "疏十八住下。",
        "translation": "It's below the eighteen abodes in the commentary.",
        "source": "T33n1702_003:0195b14_16"
    },
    {
        "source_sentence": "三、更約地位配釋。",
        "translation": "3. It's further explained in terms of status.",
        "source": "T33n1702_003:0195b14_17"
    },
    {
        "source_sentence": "然諸教中所說地位，或有或無。",
        "translation": "However, the states mentioned in the teachings may or may not be present.",
        "source": "T33n1702_003:0195b15_18"
    },
    {
        "source_sentence": "如《楞伽經》云：「十地即為初，二地即為八，乃至無所有何地」，此明無也。",
        "translation": "As the Laṅkâvatāra-sūtra says, Ten stages are the first, two stages are the eighth, and so forth, up to where is there a stage that has nothing? This explains that it's nonexistent.",
        "source": "T33n1702_003:0195b16_0"
    },
    {
        "source_sentence": "《仁王》、《纓絡》等經，即具說地位，是明有也。",
        "translation": "The sutras such as the Sutra of Humane Kings and the Vinaya, which explain the status in detail, clearly show that it exists.",
        "source": "T33n1702_003:0195b17_1"
    },
    {
        "source_sentence": "然此有無皆隨機說也。",
        "translation": "However, these existences and nonexistences are all explained at random.",
        "source": "T33n1702_003:0195b18_2"
    },
    {
        "source_sentence": "若《華嚴》行布萬差、圓融一際，有無無閡，斯則稱性之說也。",
        "translation": "If the practice of the Flower Ornament is spread with myriad differences and perfected at one point, there's nothing unobstructed, and this is called the teaching of nature.",
        "source": "T33n1702_003:0195b18_3"
    },
    {
        "source_sentence": "然依《華嚴》有無無閡方為了義，以約法即無，約人即有，人法既不相離，",
        "translation": "However, it is only by relying upon the meaning of existence and nonexistence in the Flower Ornament that one can fully understand their meanings. It is precisely because they are found to be nonexistent in relation to things and existing in relation to people. Since humans and dharmas are not separate from each other,",
        "source": "T33n1702_003:0195b20_4"
    },
    {
        "source_sentence": "有無故合均齊。",
        "translation": "Because there's existence and nonexistence, they are both unitary and equal.",
        "source": "T33n1702_003:0195b21_5"
    },
    {
        "source_sentence": "然其行人，念念須冥佛境反窮果海，自然階降不同。",
        "translation": "Still, each time the practitioners think of the Buddha's realm, they must return to the ocean of fruition in order to naturally descend differently.",
        "source": "T33n1702_003:0195b22_6"
    },
    {
        "source_sentence": "若預等級用心，畢竟障於證入。",
        "translation": "If someone prepares their mind with the intention of classifying, they'll ultimately obstruct realization and entry.",
        "source": "T33n1702_003:0195b23_7"
    },
    {
        "source_sentence": "故《華嚴疏》云：「修則頓修，位分因果。」",
        "translation": "That's why the Flower Ornament Commentary says, Cultivation is sudden cultivation, which is conditioned by cause and effect.",
        "source": "T33n1702_003:0195b24_8"
    },
    {
        "source_sentence": "況此經宗無相，豈合列位淺深？",
        "translation": "How much more so when the doctrine of this sūtra is devoid of characteristics, so how can it be classified as shallow or deep?",
        "source": "T33n1702_003:0195b24_9"
    },
    {
        "source_sentence": "但約情惑漸薄而位地轉高，義相稍同，故略配攝也。",
        "translation": "However, the meaning and characteristics are slightly the same in terms of gradual weakening of feelings and passions while the stages become higher. Therefore, they are briefly classified accordingly.",
        "source": "T33n1702_003:0195b25_10"
    },
    {
        "source_sentence": "等一十住者。",
        "translation": "It's the same as one of the ten abodes.",
        "source": "T33n1702_003:0195b26_11"
    },
    {
        "source_sentence": "十住謂：第一、發心住，二、持地，三、修行，四、生貴，五、方便具足，",
        "translation": "The ten abodes are: first, the abode of arousal of mind; second, the stage of support; third, practice; fourth, noble birth; and fifth, fulfillment of skillful means.",
        "source": "T33n1702_003:0195b27_0"
    },
    {
        "source_sentence": "六、正心，七、不退，八、童真，九、法王子，十、灌頂。",
        "translation": "6. right mind, 7. non-backsliding, 8. youthful truth, 9. prince of the Dharma, and 10. consecration.",
        "source": "T33n1702_003:0195b28_1"
    },
    {
        "source_sentence": "今配十住者，與彼初住名同故配之也。",
        "translation": "Now, we'll assign the ten abodes because they're the same as the first abode and their names are the same as those of the first abode.",
        "source": "T33n1702_003:0195b29_2"
    },
    {
        "source_sentence": "問：「比但云一，如何配十？」",
        "translation": "Q: How can you match the ten if you say it's only one?",
        "source": "T33n1702_003:0195c01_3"
    },
    {
        "source_sentence": "答：「以初攝後故。」",
        "translation": "Answer: It's because the first includes the latter.",
        "source": "T33n1702_003:0195c01_4"
    },
    {
        "source_sentence": "問：「何故不言十信位耶？」",
        "translation": "Q: Why isn't it called the ten stages of faith?",
        "source": "T33n1702_003:0195c02_5"
    },
    {
        "source_sentence": "答：「亦攝入十住位中也。",
        "translation": "Answer: They're also included in the stages of the ten abodes.",
        "source": "T33n1702_003:0195c02_6"
    },
    {
        "source_sentence": "以前之十住，通名信行地。",
        "translation": "The previous ten abodes were commonly called the stage of faith and practice.",
        "source": "T33n1702_003:0195c03_7"
    },
    {
        "source_sentence": "故亦同《華嚴》合前開後也。",
        "translation": "That's why it's the same as the Huayan, which combines the former with the latter.",
        "source": "T33n1702_003:0195c03_8"
    },
    {
        "source_sentence": "故發心一住，前攝十信、後攝餘九耳。」",
        "translation": "That's why the arousal of mind is one abode, which first includes the ten stages of faith and then the other nine.",
        "source": "T33n1702_003:0195c04_9"
    },
    {
        "source_sentence": "第二十行等者。",
        "translation": "The twentieth practice and so forth.",
        "source": "T33n1702_003:0195c05_10"
    },
    {
        "source_sentence": "十行即：一、歡喜行，二、饒益，三、無瞋恨，四、無盡，五、離癡亂，",
        "translation": "The ten practices are: 1. the practice of joy; 2. benefits; 3. no anger or resentment; 4. inexhaustibility; 5. freedom from confusion;",
        "source": "T33n1702_003:0195c05_11"
    },
    {
        "source_sentence": "六、善現，七、無著，八、尊重，九、善法，十、真實。",
        "translation": "6. well-presented, 7. unattached, 8. honored, 9. good qualities, and 10. real.",
        "source": "T33n1702_003:0195c06_12"
    },
    {
        "source_sentence": "前六者。",
        "translation": "The first six are.",
        "source": "T33n1702_003:0195c07_13"
    },
    {
        "source_sentence": "十中前六行也。",
        "translation": "These are the first six of the ten practices.",
        "source": "T33n1702_003:0195c07_14"
    },
    {
        "source_sentence": "以配此中第二住處，以此住處說六度故，即布施配歡喜行，持戒配饒益行，",
        "translation": "Because of the six perfections spoken of in these abodes, generosity is assigned to the practice of joy; observance of moral precepts is assigned to the practice of enrichment.",
        "source": "T33n1702_003:0195c07_15"
    },
    {
        "source_sentence": "忍辱配無瞋恨行，精進配無盡行，禪定配離癡亂行，智慧配善現行，心離分別善巧示現故。",
        "translation": "Forbearance is associated with the practice of no anger, energy is associated with the practice of inexhaustibility, meditation is associated with the practice of freedom from delusion, wisdom is associated with the practice of good manifestations, because the mind is free of discriminating and skillfully manifesting.",
        "source": "T33n1702_003:0195c09_16"
    },
    {
        "source_sentence": "三第七行者。",
        "translation": "The third is the seventh practice.",
        "source": "T33n1702_003:0195c11_17"
    },
    {
        "source_sentence": "不以相見如來，即無著也。",
        "translation": "They don't see the Tathāgata in terms of characteristics, which means they have no attachment.",
        "source": "T33n1702_003:0195c11_18"
    },
    {
        "source_sentence": "四後三行者，配第四住中三種法身。",
        "translation": "The fourth and last three practices are combined with the three kinds of Dharma body in the fourth abode.",
        "source": "T33n1702_003:0195c12_19"
    },
    {
        "source_sentence": "謂言說法身配尊重行，於佛言教生尊重故。",
        "translation": "It means to say that the Dharma body is accompanied by respectful conduct, because respect arises from the Buddha's words and teachings.",
        "source": "T33n1702_003:0195c13_20"
    },
    {
        "source_sentence": "智相法身配善法行，以真如無為是真善法故。",
        "translation": "The Dharma body of knowledge and characteristics matches the practice of good qualities because true reality and nonexistence are truly good qualities.",
        "source": "T33n1702_003:0195c14_21"
    },
    {
        "source_sentence": "福相法身配真實行，以持經之福無漏真實故。",
        "translation": "The Dharma body of merit and characteristics matches true practice because the merit of maintaining the sūtras is uncontaminated and true.",
        "source": "T33n1702_003:0195c15_22"
    },
    {
        "source_sentence": "五至十四配十迴向者。",
        "translation": "The fifth up to the fourteenth are associated with the ten dedications of merit.",
        "source": "T33n1702_003:0195c16_23"
    },
    {
        "source_sentence": "一、救護一切眾生離眾生相迴向，二、不壞，三、等一切佛，四、至一切處，",
        "translation": "1. to save all sentient beings and turn away from the characteristics of sentient beings, 2. not destroying, 3. equal to all buddhas, and 4. reaching everywhere.",
        "source": "T33n1702_003:0195c16_24"
    },
    {
        "source_sentence": "五、無盡功德藏，六、隨順堅固善根，七、等心隨順一切眾生，八、真如相，",
        "translation": "5. the inexhaustible treasury of merit, 6. following strong good roots, 7. following all sentient beings with equal minds, and 8. the characteristics of true reality,",
        "source": "T33n1702_003:0195c18_25"
    },
    {
        "source_sentence": "九、無縛無著解脫，十、法界無量。",
        "translation": "(9) The liberation that is unbound and unattached; (10) the immeasurable realm of reality.",
        "source": "T33n1702_003:0195c19_26"
    },
    {
        "source_sentence": "五配第一，離慢即是離眾生相也。",
        "translation": "The fifth is the first, free of conceit, which means free of the characteristics of sentient beings.",
        "source": "T33n1702_003:0195c20_27"
    },
    {
        "source_sentence": "六配第二，遇佛多聞信，解行等不壞。",
        "translation": "Sixth, it's matched with the second, which is when he meets a Buddha who's well-versed and faithful, understands his practice and so forth without breaking down.",
        "source": "T33n1702_003:0195c21_28"
    },
    {
        "source_sentence": "七配第三，諸佛離相既不住色，即等佛也。",
        "translation": "The seventh matches the third, because the buddhas are free of form and don't abide in form, which is equal to the Buddha.",
        "source": "T33n1702_003:0195c22_29"
    },
    {
        "source_sentence": "八配第四，既見大身非身，是真如際，方至一切處。",
        "translation": "Eight is combined with the fourth, which sees that the great body and what's not a body are really the limit of reality and only then reach all places.",
        "source": "T33n1702_003:0195c23_30"
    },
    {
        "source_sentence": "九配第五，不隨外論受持此經，即得無盡功德。",
        "translation": "The ninth is combined with the fifth, which doesn't follow external theories to accept and uphold this sūtra, which will attain inexhaustible merit.",
        "source": "T33n1702_003:0195c24_31"
    },
    {
        "source_sentence": "十配第六，觀破五蘊與定相應善根堅固。",
        "translation": "The ten are combined with the sixth, which observes the destruction of the five aggregates and the firmness of the good roots associated with concentration.",
        "source": "T33n1702_003:0195c25_32"
    },
    {
        "source_sentence": "十一配第七，既不取相即於眾生等隨順之。",
        "translation": "Eleven are combined with the seventh, because they don't grasp characteristics, which is to follow them in sentient beings and so forth.",
        "source": "T33n1702_003:0195c26_33"
    },
    {
        "source_sentence": "十二配第八，經云「離一切相即名諸佛」，即真如相也。",
        "translation": "The twelve are combined with the eighth, as the sūtra says, Being free of all characteristics is called buddhahood, which is the mark of true reality.",
        "source": "T33n1702_003:0195c27_34"
    },
    {
        "source_sentence": "十三配第九，割截不瞋即無縛無著也。",
        "translation": "The thirteenth is combined with the ninth, which is cut off and not angry, meaning there's no bondage or attachment.",
        "source": "T33n1702_003:0195c28_35"
    },
    {
        "source_sentence": "十四配第十，經云「無有邊不可思議功德」，即是法界功德也。",
        "translation": "The fourteenth is combined with the tenth, which says, Boundless and inconceivable merit, which is the merit of the Dharma realm.",
        "source": "T33n1702_003:0195c29_36"
    },
    {
        "source_sentence": "十五燸等者。",
        "translation": "The fifteen arrows and so forth.",
        "source": "T33n1702_003:0196a01_37"
    },
    {
        "source_sentence": "配四加行位也。",
        "translation": "It's also a combination of the four stages of applied practices.",
        "source": "T33n1702_003:0196a02_0"
    },
    {
        "source_sentence": "然此四位，由三賢菩薩已經一無數劫修集福智資糧，為入見道故，復加行燸、頂二位。",
        "translation": "However, these four stages are due to the fact that the bodhisattvas of the three good ones have cultivated accumulations of merit and wisdom for an incalculable number of kalpas. In order to enter the path of insight, they further apply the two stages of sexual misconduct and summit [of enlightenment].",
        "source": "T33n1702_003:0196a02_1"
    },
    {
        "source_sentence": "以四尋伺觀，觀所取名等四法假有實無，即所取空，忍、世第一。",
        "translation": "With the four investigations of discursive examination, he observes that names and so forth are grasped by the four dharmas that are nominally existent but really nonexistent, which is the emptiness of what's grasped, patience, worldly, and first.",
        "source": "T33n1702_003:0196a04_2"
    },
    {
        "source_sentence": "以四如實智，通觀能所名等皆空。",
        "translation": "With the four as-it-is cognitions, they universally observe that all names and so forth are empty of what's called emptiness.",
        "source": "T33n1702_003:0196a05_3"
    },
    {
        "source_sentence": "然忍有三品，謂下、中、上。",
        "translation": "However, there are three classes of forbearance:",
        "source": "T33n1702_003:0196a06_4"
    },
    {
        "source_sentence": "下品印所取空，中品順能取空，上品印能取空，世第一二空俱印，然皆滯相未能證實。",
        "translation": "The lower-level mudrā grasps emptiness, the middle-level mudrā follows the ability to grasp emptiness, the higher-level mudrā grasps emptiness, and the first and second worldly mudrās of emptiness are both mudrās, but they're all hindered by characteristics that can't be realized.",
        "source": "T33n1702_003:0196a06_5"
    },
    {
        "source_sentence": "故《唯識》云：「現前立少物，謂是唯識性，以有所得故，非實住唯識。」",
        "translation": "That's why the Consciousness-only says, There are few things that are established in the present, which is the nature of consciousness-only because they have something to attain and don't really abide in consciousness-only.",
        "source": "T33n1702_003:0196a08_6"
    },
    {
        "source_sentence": "若配經文即十五住。",
        "translation": "If we match the text of the sūtras, that's the fifteen abodes.",
        "source": "T33n1702_003:0196a10_7"
    },
    {
        "source_sentence": "經云「實無有法發阿耨菩提心者」，以菩提能發所取，既言實無即所取空，",
        "translation": "The sūtras say, There's really no dharma that gives rise to the mind of unsurpassed enlightenment because it's the ability to give rise to grasping. Since it says there's really no such thing as emptiness in terms of grasping,",
        "source": "T33n1702_003:0196a10_8"
    },
    {
        "source_sentence": "當燸、頂二位。",
        "translation": "It's the two stages of anger and topknot.",
        "source": "T33n1702_003:0196a12_9"
    },
    {
        "source_sentence": "十六住中，經云「佛於然燈佛所不得菩提」，是印所取空，當下品忍。",
        "translation": "In the sixteen abodes, the sūtra says, The Buddha doesn't attain enlightenment in the place of Rājagṛha Buddha, which is the seal that takes emptiness and follows the next level of forbearance.",
        "source": "T33n1702_003:0196a12_10"
    },
    {
        "source_sentence": "次云「如來者即諸法如義」即順能取空。",
        "translation": "Next, it's said, The Tathāgata is the meaning of all dharmas, which follows the emptiness that can be grasped.",
        "source": "T33n1702_003:0196a14_11"
    },
    {
        "source_sentence": "然猶未說後時不得，即知未能印持故，當中品忍。",
        "translation": "However, it's still not explained that they won't attain it later, which is because they know they can't seal and maintain it, so the middle level of forbearance.",
        "source": "T33n1702_003:0196a15_12"
    },
    {
        "source_sentence": "次云「實無有法佛得阿耨菩提」，此明後時畢竟不得，即印能取空當上品忍。",
        "translation": "Next, it says, There really isn't a Dharma Buddha who attains the unsurpassed enlightenment, which explains that he ultimately doesn't attain it at the end of his life, meaning that the seal can grasp emptiness as the higher level of forbearance.",
        "source": "T33n1702_003:0196a16_13"
    },
    {
        "source_sentence": "次云「如來所得法，此法無實無虛，乃至即非一切法」即雙印二空，當世第一位也。",
        "translation": "Next, it says, The teaching attained by the Tathāgata is that these things are neither real nor false, even if they aren't all dharmas, which refers to the two seals of emptiness as the first in the world.",
        "source": "T33n1702_003:0196a17_14"
    },
    {
        "source_sentence": "十七初地者。",
        "translation": "The first ground of the seventeen.",
        "source": "T33n1702_003:0196a19_15"
    },
    {
        "source_sentence": "如前疏云：「攝種性智證，遍行真如等」，故當初地。",
        "translation": "As the previous commentary said, The first ground is based on the cognition of gathering in seed natures and realizing pervasive reality and so forth.",
        "source": "T33n1702_003:0196a20_0"
    },
    {
        "source_sentence": "十八等者，於中合有二。",
        "translation": "The eighteen and so on are combined into two.",
        "source": "T33n1702_003:0196a21_1"
    },
    {
        "source_sentence": "謂此住中初國土淨具足，當修道位。",
        "translation": "It means that the first land in this abode is pure and complete, and he'll cultivate the stage of enlightenment.",
        "source": "T33n1702_003:0196a21_2"
    },
    {
        "source_sentence": "故前疏云：「此教二地已上諸大菩薩。」",
        "translation": "That's why the previous commentary said, This teaching teaches the great bodhisattvas above the second ground.",
        "source": "T33n1702_003:0196a22_3"
    },
    {
        "source_sentence": "從無上見智淨具足已下，皆究竟位。",
        "translation": "They are all in the ultimate state from the time when they are endowed with the purity of the knowledge of the highest insight.",
        "source": "T33n1702_003:0196a23_4"
    },
    {
        "source_sentence": "故前疏云：「此下皆住佛果也。」",
        "translation": "That's why the previous commentary said, Here, they all abide in the Buddhahood.",
        "source": "T33n1702_003:0196a24_5"
    },
    {
        "source_sentence": "是則十八住中，前十四資糧，十五十六加行，十七見道，十八中初一具足修道，",
        "translation": "These are the first fourteen of the eighteen: accumulation, the fifteenth and sixteenth. The path of vision is the seventeenth.",
        "source": "T33n1702_003:0196a24_6"
    },
    {
        "source_sentence": "餘即無學道也。",
        "translation": "The rest are the path of post-learning.",
        "source": "T33n1702_003:0196a26_7"
    },
    {
        "source_sentence": "懸判竟。",
        "translation": "It's up to you to judge it.",
        "source": "T33n1702_003:0196a26_8"
    },
    {
        "source_sentence": "第二下。",
        "translation": "Second, it's below.",
        "source": "T33n1702_003:0196a27_0"
    },
    {
        "source_sentence": "二。",
        "translation": "Two.",
        "source": "T33n1702_003:0196a27_1"
    },
    {
        "source_sentence": "初、牃章分文二、依章正釋四初、善現申請二一、整儀讚佛疏二初、釋請人。",
        "translation": "The first, the text of the crude chapter, the second, the correct explanation of the four parts according to the chapter, the second, the request for good manifestation, the second, the commentary on praising the Buddha with proper manners, the second, and the first, the explanation of the person who asks.",
        "source": "T33n1702_003:0196a27_2"
    },
    {
        "source_sentence": "從初至恭敬即是整儀，餘皆讚佛也。",
        "translation": "From the first to the first, respectfulness is the proper manner of conduct, and the rest praise the Buddha.",
        "source": "T33n1702_003:0196a28_3"
    },
    {
        "source_sentence": "經時者，即如來食已，敷座而坐時也。",
        "translation": "The time of the sutra refers to the time when the Tathāgata prepared his seat and sat down after he had eaten.",
        "source": "T33n1702_003:0196a29_4"
    },
    {
        "source_sentence": "德長年老者，謂德高曰長，年多曰老也。",
        "translation": "The seniority of virtuous people means that the seniority of virtuous people is called seniority, and the seniority of old people is called old.",
        "source": "T33n1702_003:0196b01_5"
    },
    {
        "source_sentence": "唐譯下。",
        "translation": "The Tang translation follows.",
        "source": "T33n1702_003:0196b02_6"
    },
    {
        "source_sentence": "證年老。",
        "translation": "He realized that he was old.",
        "source": "T33n1702_003:0196b02_7"
    },
    {
        "source_sentence": "魏譯下。",
        "translation": "It was translated by Wei.",
        "source": "T33n1702_003:0196b02_8"
    },
    {
        "source_sentence": "證德長。",
        "translation": "He realizes the longevity of virtue.",
        "source": "T33n1702_003:0196b02_9"
    },
    {
        "source_sentence": "智慧超倫即是德長義也。",
        "translation": "The transcendence of wisdom is the meaning of virtue and longevity.",
        "source": "T33n1702_003:0196b03_10"
    },
    {
        "source_sentence": "然以慧為命者，約喻顯法也。",
        "translation": "Still, someone who takes wisdom as their life refers to metaphors that show the Dharma.",
        "source": "T33n1702_003:0196b03_11"
    },
    {
        "source_sentence": "謂人身以命為本，佛法以慧為本，命盡則六根俱廢，慧喪則萬行不成云云。",
        "translation": "It means that the human body has life as its root and the Buddha's teachings have wisdom as their root, and when life ends, the six faculties are both abolished, and when wisdom is lost, myriad practices won't be accomplished.",
        "source": "T33n1702_003:0196b04_12"
    },
    {
        "source_sentence": "此約別義釋長老也。",
        "translation": "This is an explanation of the elder in terms of specific meanings.",
        "source": "T33n1702_003:0196b06_13"
    },
    {
        "source_sentence": "若通意者，但有德業便名長老，如云先生未必年老矣。",
        "translation": "If someone has the general idea, they're simply called an elder if they have virtuous actions, just as you say, Mr. doesn't necessarily become old.",
        "source": "T33n1702_003:0196b06_14"
    },
    {
        "source_sentence": "須菩提者。",
        "translation": "It's called'subhūti.'",
        "source": "T33n1702_003:0196b07_15"
    },
    {
        "source_sentence": "亦云蘇補底，但梵音楚夏耳。",
        "translation": "It's also called蘇補底, but it's the Sanskrit sound for cuṣya.",
        "source": "T33n1702_003:0196b08_0"
    },
    {
        "source_sentence": "善吉下。",
        "translation": "It's beneath Shanji.",
        "source": "T33n1702_003:0196b08_1"
    },
    {
        "source_sentence": "從末倒標。",
        "translation": "It's a mistaken label from the beginning.",
        "source": "T33n1702_003:0196b08_2"
    },
    {
        "source_sentence": "生時下。",
        "translation": "It's below the time of birth.",
        "source": "T33n1702_003:0196b09_3"
    },
    {
        "source_sentence": "據本順釋。",
        "translation": "According to the original explanation, it follows.",
        "source": "T33n1702_003:0196b09_4"
    },
    {
        "source_sentence": "《西域記》云：「是東方青龍陀佛，影響釋迦之會，示跡聲聞，發揚空理，",
        "translation": "The Record of the Western Regions says, This is the Buddha Qinglongda Buddha of the east who influenced the assembly of the Śākyas to show the traces of śrāvakas and propagate the doctrine of emptiness.",
        "source": "T33n1702_003:0196b09_5"
    },
    {
        "source_sentence": "十方諸佛法皆爾也。」",
        "translation": "So it is with the buddhas and dharmas of the ten directions.",
        "source": "T33n1702_003:0196b10_6"
    },
    {
        "source_sentence": "從座下。",
        "translation": "He came down from his seat.",
        "source": "T33n1702_003:0196b11_7"
    },
    {
        "source_sentence": "二、釋請儀二初、正釋經文。",
        "translation": "Second, he explains the second part of the request, which correctly explains the text of the sūtra.",
        "source": "T33n1702_003:0196b11_8"
    },
    {
        "source_sentence": "皆整儀者。",
        "translation": "They're all well-maintained.",
        "source": "T33n1702_003:0196b12_9"
    },
    {
        "source_sentence": "疏雖通明，經須別釋。",
        "translation": "Although the commentary explains them in detail, the sūtras need to explain them separately.",
        "source": "T33n1702_003:0196b12_10"
    },
    {
        "source_sentence": "從座起者。",
        "translation": "He who rises from his seat.",
        "source": "T33n1702_003:0196b12_11"
    },
    {
        "source_sentence": "師資之道尊卑頗殊，欲有諮詢不可坐問，此同曾子避席對夫子也。",
        "translation": "The teachers of the Way were so different from each other in terms of their superiority and inferiority that if they wanted to consult, they couldn't sit or ask questions, which was the same as when Zengzi avoided his seat and confronted him.",
        "source": "T33n1702_003:0196b13_12"
    },
    {
        "source_sentence": "《孝經》中夫子問曾子曰：「先王有至德要道以順天下，民用和穆上下無怨。",
        "translation": "In the Sutra of filial piety, Fuzi asked Zengzi, The late king had the supreme virtuous Way to obey the world, and the people lived in harmony without enmity up and down.",
        "source": "T33n1702_003:0196b14_13"
    },
    {
        "source_sentence": "汝知之乎？」",
        "translation": "Do you know it?",
        "source": "T33n1702_003:0196b16_14"
    },
    {
        "source_sentence": "曾子避席曰：「參不敏，何足以知之？」",
        "translation": "Zengzi avoided the seat and said, How can you know it if you're not intelligent?",
        "source": "T33n1702_003:0196b16_15"
    },
    {
        "source_sentence": "雖彼答此問，而致敬是同也。",
        "translation": "Even though they answer this question, paying respect is the same as paying respect.",
        "source": "T33n1702_003:0196b17_16"
    },
    {
        "source_sentence": "偏袒右肩，是彼方儀則，此土非儀也。",
        "translation": "He bares his right shoulder partially, which is the manner in which he conducts himself; this is not the manner in which he conducts himself here.",
        "source": "T33n1702_003:0196b17_17"
    },
    {
        "source_sentence": "欲問如來故須偏袒。",
        "translation": "They want to ask the Tathāgata, so they must be partial and bare.",
        "source": "T33n1702_003:0196b18_18"
    },
    {
        "source_sentence": "右膝下。",
        "translation": "It's beneath his right knee.",
        "source": "T33n1702_003:0196b19_19"
    },
    {
        "source_sentence": "右則為順，膝能迴屈，表順理心也。",
        "translation": "On the right side, it's obedient, and the knees can bend back, which shows that they're obedient to the mind of principle.",
        "source": "T33n1702_003:0196b19_20"
    },
    {
        "source_sentence": "著地即示卑之相也。",
        "translation": "To touch the ground is to show the characteristic of inferiority.",
        "source": "T33n1702_003:0196b20_21"
    },
    {
        "source_sentence": "膝表智，地表理，合掌即表冥心，掌合不執外物，心冥覺不異緣，欲問實相法門故，",
        "translation": "Knee shows wisdom, earth shows principle. The joining of palms indicates mysterious awarenesses; the joining of palms does not grasp external things. Mysterious awarenesses do not have different conditions: because they want to ask about the dharma-gate of real characteristics.",
        "source": "T33n1702_003:0196b20_22"
    },
    {
        "source_sentence": "須用心如此。",
        "translation": "It's necessary to think like this.",
        "source": "T33n1702_003:0196b22_23"
    },
    {
        "source_sentence": "恭敬者。",
        "translation": "A respectful person is someone who venerates.",
        "source": "T33n1702_003:0196b22_24"
    },
    {
        "source_sentence": "總結也。",
        "translation": "It's also a summary.",
        "source": "T33n1702_003:0196b22_25"
    },
    {
        "source_sentence": "起座袒肩、跪膝合掌，莫非恭敬故爾，亦可配於三業。",
        "translation": "He rises from his seat and bares his shoulders, kneels down with his palms joined, and doesn't do so because of respect, but he can also match the three actions.",
        "source": "T33n1702_003:0196b23_26"
    },
    {
        "source_sentence": "謂座起袒肩合掌等身業也，恭敬即意業也，白佛言下即口業也。",
        "translation": "It's bodily action such as standing up with one's shoulders bared and joining palms, respectfulness is mental action, and verbal action below the Buddha's words is verbal action.",
        "source": "T33n1702_003:0196b24_27"
    },
    {
        "source_sentence": "希有下。",
        "translation": "It's rare and inferior.",
        "source": "T33n1702_003:0196b25_28"
    },
    {
        "source_sentence": "疏且總明具有四種：一、時希有。",
        "translation": "The commentary also generally explains that there are four kinds: 1. rare at the time.",
        "source": "T33n1702_003:0196b25_29"
    },
    {
        "source_sentence": "曠劫難逢，然今賢劫之中，正當住劫。",
        "translation": "In the present world age of the wise one, however, we will live in the world age of the wise one.",
        "source": "T33n1702_003:0196b26_30"
    },
    {
        "source_sentence": "就住劫中有二十增減，今即第九減劫中。",
        "translation": "In the kalpa of abiding, there are twenty increases and decreases; now, in the ninth kalpa of decrease.",
        "source": "T33n1702_003:0196b27_31"
    },
    {
        "source_sentence": "人壽二萬歲時，迦葉如來出世，百年減一年，至人壽百歲時，釋迦如來出世，",
        "translation": "At the time when human life span was twenty thousand years in length, the Tathāgata Kassapa appeared in the world.",
        "source": "T33n1702_003:0196b28_32"
    },
    {
        "source_sentence": "減後此劫已盡，至第十劫展轉却增，至八萬四千歲，又百年減一年，至人壽八萬歲時，",
        "translation": "The human life span decreases gradually until it is eighty-four thousand years in length during the tenth kalpa, and then decreases by one year for another one hundred years until it is eighty-four thousand years in length.",
        "source": "T33n1702_003:0196c01_33"
    },
    {
        "source_sentence": "彌勒佛出世。",
        "translation": "Maitreya Buddha appeared in the world.",
        "source": "T33n1702_003:0196c03_0"
    },
    {
        "source_sentence": "望過去未來，二佛相去一千一百萬餘年，中間更無，故云希有也。",
        "translation": "Looking to the past and future, it will be more than a thousand one million years from each other when the two buddhas are separated, but there won't be another in between. That's why it's called rare.",
        "source": "T33n1702_003:0196c03_1"
    },
    {
        "source_sentence": "故《法華》云：「諸佛興出世，懸遠值遇難。」",
        "translation": "That's why the Fahua jing says, When the buddhas arise in the world, they hang far away and encounter difficulties.",
        "source": "T33n1702_003:0196c04_2"
    },
    {
        "source_sentence": "二、處希有。",
        "translation": "2. The place is rare.",
        "source": "T33n1702_003:0196c05_3"
    },
    {
        "source_sentence": "三千界中唯有一佛，百億四天下、百億須彌山、百億日月、百億六欲、百億梵世，",
        "translation": "Within the three thousand worlds there is only one Buddha: ten billion buddhas in the four directions, ten billion mountains on Mount Sumeru, ten billion suns and moons, ten billion gods of the six realms of desire, and ten billion Brahmā worlds.",
        "source": "T33n1702_003:0196c05_4"
    },
    {
        "source_sentence": "其中唯有一佛，此方而現也。",
        "translation": "There is only one buddha among them, which appears in this direction.",
        "source": "T33n1702_003:0196c07_5"
    },
    {
        "source_sentence": "三、德希有。",
        "translation": "3. rare in virtue...",
        "source": "T33n1702_003:0196c08_6"
    },
    {
        "source_sentence": "福慧超絕勝無上故。",
        "translation": "It's because merit and wisdom are transcendent and superior to the unsurpassed.",
        "source": "T33n1702_003:0196c08_7"
    },
    {
        "source_sentence": "故《法華》云：「我所得智慧，微妙最第一。」",
        "translation": "That's why the Lotus Sutra says, The wisdom I've attained is subtle and the best.",
        "source": "T33n1702_003:0196c09_0"
    },
    {
        "source_sentence": "又云：「如其所得法，定慧力莊嚴。",
        "translation": "It's also said, As they attain the Dharma, they're adorned by the power of concentration and wisdom.",
        "source": "T33n1702_003:0196c09_1"
    },
    {
        "source_sentence": "以此度眾生，自證無上道。」",
        "translation": "Because of this, they save sentient beings and realize the unsurpassed path for themselves.",
        "source": "T33n1702_003:0196c10_2"
    },
    {
        "source_sentence": "然佛功德不可稱說盡其邊際，故《華嚴》云：「剎塵心念可數知，大海中水可飲盡，",
        "translation": "However, the Buddha's virtues cannot be described as exhaustive, so the Flower Ornament says, The duration of a buddha's mind can be counted, and the water in the ocean can be drunk up.",
        "source": "T33n1702_003:0196c11_3"
    },
    {
        "source_sentence": "虛空可量風可繫，無能說盡佛功德。」",
        "translation": "Space can be measured and winded, and there's no one who can explain the Buddha's merits.",
        "source": "T33n1702_003:0196c12_4"
    },
    {
        "source_sentence": "四、事希有。",
        "translation": "4. rare in terms of phenomena...",
        "source": "T33n1702_003:0196c13_5"
    },
    {
        "source_sentence": "用大慈悲極巧方便，現多種身相，演無量法門，隨眾生根皆利益故。",
        "translation": "Using great compassion and extremely skillful means, he manifests various bodily forms and explains measureless teachings that benefit all sentient beings according to their faculties.",
        "source": "T33n1702_003:0196c13_6"
    },
    {
        "source_sentence": "今所歎者，意則雖通，義當歎事。",
        "translation": "What's praised now is that although the meaning is shared, the meaning should be praised.",
        "source": "T33n1702_003:0196c15_7"
    },
    {
        "source_sentence": "以下標云善護念等。",
        "translation": "The following is labeled as well-protecting mindfulness and so forth.",
        "source": "T33n1702_003:0196c16_8"
    },
    {
        "source_sentence": "如來者，真化不同。",
        "translation": "The Tathāgata is not the same as true transformation.",
        "source": "T33n1702_003:0196c16_9"
    },
    {
        "source_sentence": "真佛名如來者，迷時背覺合塵名如去，悟了背塵合覺名如來，如即真如，",
        "translation": "The true Buddha is called the “tathāgata” because when deluded, he turns his back on enlightenment and combines it with dust (i.e., thusness) as if he were going away. Enlightenment understands that turning his back on this combination of dust and enlightenment is called the “tathāgata.” Thusness is the true suchness",
        "source": "T33n1702_003:0196c17_10"
    },
    {
        "source_sentence": "來去即隨緣也。",
        "translation": "The coming and going are the following conditions.",
        "source": "T33n1702_003:0196c18_11"
    },
    {
        "source_sentence": "化佛名如來者，從真如起，來成正覺而化眾生。",
        "translation": "The transformation buddha is called the Tathāgata because it arises from the true reality and transforms sentient beings who come to become perfectly enlightened.",
        "source": "T33n1702_003:0196c19_12"
    },
    {
        "source_sentence": "今當後者，故云從如而來。",
        "translation": "That's why it's called coming from thusness.",
        "source": "T33n1702_003:0196c20_13"
    },
    {
        "source_sentence": "根熟者。",
        "translation": "The maturation of the faculties is this.",
        "source": "T33n1702_003:0196c20_14"
    },
    {
        "source_sentence": "三賢已上菩薩，信根成熟永無退轉也。",
        "translation": "The bodhisattvas above the three stages of goodness have perfected their faculty of faith and never regressed.",
        "source": "T33n1702_003:0196c20_15"
    },
    {
        "source_sentence": "智慧力，即無分別智成就佛法，即隨其分位令證真如，乃於一法令達百千萬法明門等，",
        "translation": "The power of wisdom, that is, nondiscriminating cognition accomplishes the buddha-dharma. That is, according to their various degrees of enlightenment and causes them to realize true suchness, then in a single decree they will comprehend one hundreds of thousands of myriads of teachings, e.g.",
        "source": "T33n1702_003:0196c21_16"
    },
    {
        "source_sentence": "斯則自利行也。",
        "translation": "This is the practice of self-benefiting.",
        "source": "T33n1702_003:0196c23_17"
    },
    {
        "source_sentence": "教化力，即後得智，攝受眾生即隨其分位，令於百千萬億等世界中教化眾生，",
        "translation": "The power of enlightenment is the subsequently attained knowledge that takes in sentient beings according to their various states and causes them to teach sentient beings in hundreds of thousands of myriads of koṭis of worlds.",
        "source": "T33n1702_003:0196c24_18"
    },
    {
        "source_sentence": "斯則利他行也。",
        "translation": "This is the practice of benefiting others.",
        "source": "T33n1702_003:0196c25_19"
    },
    {
        "source_sentence": "根未熟者。",
        "translation": "Those whose faculties haven't matured yet.",
        "source": "T33n1702_003:0196c26_20"
    },
    {
        "source_sentence": "十信菩薩也。",
        "translation": "Ten are the bodhisattvas of faith.",
        "source": "T33n1702_003:0196c26_21"
    },
    {
        "source_sentence": "以此位人六度亂修、心如輕毛，故云懼其退失。",
        "translation": "Because these people of this status cultivate the six perfections in disorder and their minds are like light hair, they're afraid of retreating.",
        "source": "T33n1702_003:0196c26_22"
    },
    {
        "source_sentence": "以信根未成，遇緣恐退，故須付囑智者令其教化，使不退也。",
        "translation": "Because the faculty of faith hasn't yet developed, they're afraid to retreat when confronted by conditions, so they must entrust their wise person with the task of teaching and transforming them so that they don't regress.",
        "source": "T33n1702_003:0196c27_23"
    },
    {
        "source_sentence": "將小下。",
        "translation": "It's below the lesser level.",
        "source": "T33n1702_003:0196c29_24"
    },
    {
        "source_sentence": "將小菩薩付大菩薩，囑大菩薩化小菩薩也。",
        "translation": "He entrusted the lesser bodhisattva to the greater bodhisattva and instructed the greater bodhisattva to transform the lesser bodhisattva.",
        "source": "T33n1702_003:0196c29_25"
    },
    {
        "source_sentence": "此如父母遺囑子孫云云。",
        "translation": "This is as the parents instruct their children and grandchildren, saying.",
        "source": "T33n1702_003:0197a01_26"
    },
    {
        "source_sentence": "菩提下。",
        "translation": "It's below enlightenment.",
        "source": "T33n1702_003:0197a01_27"
    },
    {
        "source_sentence": "二、別解菩薩。",
        "translation": "2. the bodhisattva who understands distinctively.",
        "source": "T33n1702_003:0197a02_28"
    },
    {
        "source_sentence": "菩薩梵音言猶不足，具云菩提薩埵，此云覺有情。",
        "translation": "The bodhisattva's Sanskrit words are still insufficient, and it's called enlightenment-sattva, which means to awaken sentient beings.",
        "source": "T33n1702_003:0197a02_29"
    },
    {
        "source_sentence": "以時人不貴唐言故存梵語，秦地好略，又削提埵二字但云菩薩。",
        "translation": "Because the people of that time didn't esteem the Tang language, they retained the Sanskrit language and maintained a good abbreviation in the Qin land, and they cut off the two words deva and bodhi simply to say bodhisattva.",
        "source": "T33n1702_003:0197a03_30"
    },
    {
        "source_sentence": "約境所求是覺，所度是有情。",
        "translation": "What's sought in terms of objects is awakening, and the sentient beings that are liberated are sentient beings.",
        "source": "T33n1702_003:0197a05_0"
    },
    {
        "source_sentence": "然約人有四句：謂二乘有求無度，諸佛有度無求，菩薩亦求亦度，凡夫無求無度。",
        "translation": "However, there are four phrases that refer to people: the two vehicles have pursuing and not pursuing, the buddhas have surpassing and not pursuing, the bodhisattvas seek and also surpassing, and ordinary people have neither pursuing nor surpassing.",
        "source": "T33n1702_003:0197a05_1"
    },
    {
        "source_sentence": "約心者亦四句：諸佛有覺無情，凡夫有情無覺，菩薩有情有覺，二乘入無餘依界，",
        "translation": "In relation to awarenesses, there are also four alternatives: buddhas have feelings and no feelings; worldlings have feelings but no feelings; bodhisattvas have feelings but feelings; two vehicles enter the realm without remainder.",
        "source": "T33n1702_003:0197a07_2"
    },
    {
        "source_sentence": "無情無覺。",
        "translation": "There are no sentient beings and no perception.",
        "source": "T33n1702_003:0197a09_3"
    },
    {
        "source_sentence": "約能所者，所求是覺，能求是有情。",
        "translation": "In terms of subject and object, that which is sought is perception, and those who are able to seek are sentient beings.",
        "source": "T33n1702_003:0197a09_4"
    },
    {
        "source_sentence": "三皆下。",
        "translation": "Third, they're all below.",
        "source": "T33n1702_003:0197a10_5"
    },
    {
        "source_sentence": "皆上句是覺，下句是有情。",
        "translation": "The upper phrases are all feelings, and the lower phrases are sentient beings.",
        "source": "T33n1702_003:0197a10_6"
    },
    {
        "source_sentence": "然此三義之中，初約悲智，次約真妄，三約人法。",
        "translation": "Of these three meanings, however, the first refers to compassion and wisdom, the second to truth and delusion, and the third to people and dharmas.",
        "source": "T33n1702_003:0197a11_7"
    },
    {
        "source_sentence": "菩薩之義不踰此三，未必寶冠天衣方是菩薩。",
        "translation": "The meaning of bodhisattva doesn't transcend these three, and it doesn't necessarily mean that the jeweled crown or celestial robe is only bodhisattva.",
        "source": "T33n1702_003:0197a12_8"
    },
    {
        "source_sentence": "二中疏曲分下。",
        "translation": "Second, it's below the section on the twisting of the commentary in the middle.",
        "source": "T33n1702_003:0197a13_9"
    },
    {
        "source_sentence": "二。",
        "translation": "Two.",
        "source": "T33n1702_003:0197a13_10"
    },
    {
        "source_sentence": "初、釋當機。",
        "translation": "First, he explains the appropriate opportunity.",
        "source": "T33n1702_003:0197a13_11"
    },
    {
        "source_sentence": "以發心者方是當機。",
        "translation": "It's only when someone who arouses the mind that it's appropriate to do so.",
        "source": "T33n1702_003:0197a13_12"
    },
    {
        "source_sentence": "《華嚴》下。",
        "translation": "It's below the Flower Ornament.",
        "source": "T33n1702_003:0197a14_13"
    },
    {
        "source_sentence": "引證。",
        "translation": "It's cited as proof.",
        "source": "T33n1702_003:0197a14_14"
    },
    {
        "source_sentence": "此有兩意：初云有人先曾發心後時忘失，尚非其器況全不發心者。",
        "translation": "There are two meanings here: first, it's said that someone who had previously aroused the intention and then forgot it, but it's not true that they didn't aroused the intention at all.",
        "source": "T33n1702_003:0197a14_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T33n1702_003:0197a16_16"
    },
    {
        "source_sentence": "魔所攝持故。",
        "translation": "It's because it's maintained by Māra.",
        "source": "T33n1702_003:0197a16_17"
    },
    {
        "source_sentence": "後意即云：眾生發心後時忘失者，蓋為不解住修降伏耳。",
        "translation": "The latter meaning is, When sentient beings give rise to the mind, they forget it because they don't understand and abide in cultivation and subdue it.",
        "source": "T33n1702_003:0197a16_18"
    },
    {
        "source_sentence": "故今所問，免使遺忘。",
        "translation": "That's why I won't forget what I'm asking now.",
        "source": "T33n1702_003:0197a17_19"
    },
    {
        "source_sentence": "前揀其機，後防其退，有茲兩意故用彼經。",
        "translation": "The first selects the opportunity, and the second prevents its retreat. Because of these two meanings, this sūtra is used.",
        "source": "T33n1702_003:0197a18_20"
    },
    {
        "source_sentence": "所以善財童子，每遇善友皆啟云：「我已先發阿耨多羅三藐三菩提心，",
        "translation": "That's why every time he met a good friend, Sudhana said, I've first aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T33n1702_003:0197a19_21"
    },
    {
        "source_sentence": "而未知云何學菩薩行，修菩薩道？」",
        "translation": "I don't know how to train in the bodhisattva practice and cultivate the bodhisattva path.",
        "source": "T33n1702_003:0197a20_22"
    },
    {
        "source_sentence": "意明發心方是修行之器。",
        "translation": "The idea is to explain that the arousal of mind is the only vessel for cultivation.",
        "source": "T33n1702_003:0197a21_23"
    },
    {
        "source_sentence": "阿耨下。",
        "translation": "It's below the abhidharma.",
        "source": "T33n1702_003:0197a22_24"
    },
    {
        "source_sentence": "先翻名。",
        "translation": "First, he translates the name.",
        "source": "T33n1702_003:0197a22_25"
    },
    {
        "source_sentence": "謂正智。",
        "translation": "It's right knowledge.",
        "source": "T33n1702_003:0197a22_26"
    },
    {
        "source_sentence": "下釋義，上正字，且對遍字以分二智。",
        "translation": "The following explains the meaning of the above correct word, and it's divided into two kinds of cognition with respect to the word pervasive.",
        "source": "T33n1702_003:0197a22_27"
    },
    {
        "source_sentence": "下正字，即明二智所覺不偏不邪。",
        "translation": "The following correct word explains that what's perceived by the two kinds of cognition is neither partial nor wrong.",
        "source": "T33n1702_003:0197a23_28"
    },
    {
        "source_sentence": "即以正智覺真，遍智覺俗，皆不偏邪故云正覺。",
        "translation": "That is, it's called right awakening because correct knowledge perceives the true and pervasive knowledge perceives the conventional, and they aren't biased or wrong.",
        "source": "T33n1702_003:0197a24_29"
    },
    {
        "source_sentence": "以二乘偏覺，凡夫邪覺，今揀此二故不偏邪。",
        "translation": "It's because the two vehicles are partial and ordinary people are mistaken, and now we're selecting these two so they aren't partial.",
        "source": "T33n1702_003:0197a25_30"
    },
    {
        "source_sentence": "謂如理而知，如事而知故也。",
        "translation": "It's because they know it according to principle and know it according to things.",
        "source": "T33n1702_003:0197a26_31"
    },
    {
        "source_sentence": "然此二智亦名如理、如量，根本、後得，真、俗，權、實等。",
        "translation": "However, these two kinds of cognition are also called thusness and thusness-measure. They are fundamental, subsequently acquired, true, secular, provisional, real, etc.",
        "source": "T33n1702_003:0197a27_0"
    },
    {
        "source_sentence": "又準《智度論》說，從因至果有五種菩提。",
        "translation": "Also, according to the Zhidu lun, there are five kinds of enlightenment from cause to effect.",
        "source": "T33n1702_003:0197a28_1"
    },
    {
        "source_sentence": "一、發心菩提，即十信是。",
        "translation": "1. the arousal of mind and enlightenment, which are the ten kinds of faith.",
        "source": "T33n1702_003:0197a28_2"
    },
    {
        "source_sentence": "二、伏心菩提，即三賢是。",
        "translation": "The second is the enlightenment of suppressing mind, which are the three kinds of goodness.",
        "source": "T33n1702_003:0197a29_3"
    },
    {
        "source_sentence": "三、明心菩提，即初地至七地是。",
        "translation": "3. It explains that mind enlightenment, which is the first ground up to the seventh ground.",
        "source": "T33n1702_003:0197b01_0"
    },
    {
        "source_sentence": "四、出到菩提，八九十地是。",
        "translation": "4. The eighty-nine stages of enlightenment are the eighty-nine stages.",
        "source": "T33n1702_003:0197b01_1"
    },
    {
        "source_sentence": "五、無上菩提，即如來地是。",
        "translation": "5. Unexcelled enlightenment, which is the Tathāgata's stage.",
        "source": "T33n1702_003:0197b02_2"
    },
    {
        "source_sentence": "今約能發心即當第一，約所發即第五，能所合論貫通初後也。",
        "translation": "Now, according to the mind that can give rise to it, which will be the first, and according to what's given rise to it, which is the fifth, the combined theory of subject and object goes along with the beginning and end.",
        "source": "T33n1702_003:0197b02_3"
    },
    {
        "source_sentence": "疏二釋正問三初、釋魏本。",
        "translation": "The first part of the commentary explains the text of the Wei edition.",
        "source": "T33n1702_003:0197b04_4"
    },
    {
        "source_sentence": "先引文。",
        "translation": "First, we'll quote the text.",
        "source": "T33n1702_003:0197b04_5"
    },
    {
        "source_sentence": "意云下。",
        "translation": "The meaning is as follows.",
        "source": "T33n1702_003:0197b05_6"
    },
    {
        "source_sentence": "釋意。",
        "translation": "The meaning of the explanation.",
        "source": "T33n1702_003:0197b05_7"
    },
    {
        "source_sentence": "住何境界者，未發心時住六塵境，既發心已誠宜改轍，故云住何境界。",
        "translation": "What sphere does he abide in? “When he has not yet generated mind, he abides in the sphere of six objects”: When he has already generated mind, it is sincerely advisable to change his ways. That is why it is asked what sphere he abide in.",
        "source": "T33n1702_003:0197b05_8"
    },
    {
        "source_sentence": "修何下。",
        "translation": "What's cultivated?",
        "source": "T33n1702_003:0197b06_9"
    },
    {
        "source_sentence": "未發心時十惡為務，既發心已不可依前，故云修何行業。",
        "translation": "The ten evil deeds are the duties of those who have not yet undertaken the intention. Having undertaken the intention, they cannot be relied upon as before. Therefore, it is asked what actions one should cultivate.",
        "source": "T33n1702_003:0197b07_10"
    },
    {
        "source_sentence": "妄心下。",
        "translation": "It's below the deluded mind.",
        "source": "T33n1702_003:0197b08_11"
    },
    {
        "source_sentence": "未發心時妄心起即逐妄，既發心已不可隨之，是故問云：「云何降伏？」",
        "translation": "When he doesn't give rise to the mind, deluded thoughts arise, which are pursuing delusion, and once he gives rise to them, he can't follow them; therefore, he asks, How do you subdue them?",
        "source": "T33n1702_003:0197b08_12"
    },
    {
        "source_sentence": "故佛下。",
        "translation": "Therefore, it's below the Buddha.",
        "source": "T33n1702_003:0197b10_13"
    },
    {
        "source_sentence": "懸示答意。",
        "translation": "It's just to show the meaning of the answer.",
        "source": "T33n1702_003:0197b10_14"
    },
    {
        "source_sentence": "意云：昔住六塵之境，今住四心；",
        "translation": "The meaning is as follows: In the past they abide in the sphere of six objects; now they abide in four awarenesses.",
        "source": "T33n1702_003:0197b10_15"
    },
    {
        "source_sentence": "昔行十惡，今行六度；",
        "translation": "In the past I did ten evil deeds, but now I practice the six perfections.",
        "source": "T33n1702_003:0197b11_16"
    },
    {
        "source_sentence": "昔時著相，今令不著。",
        "translation": "In the past, they were attached to marks, but now they won't be attached.",
        "source": "T33n1702_003:0197b11_17"
    },
    {
        "source_sentence": "如是用心真實修行，發菩提心豈忘失耶？",
        "translation": "Do you really cultivate your mind in this way and give rise to the mind of enlightenment without forgetting it?",
        "source": "T33n1702_003:0197b12_18"
    },
    {
        "source_sentence": "秦譯下。",
        "translation": "It was translated by the Qin translation.",
        "source": "T33n1702_003:0197b13_19"
    },
    {
        "source_sentence": "會當經。",
        "translation": "It's the appropriate sūtra for the assembly.",
        "source": "T33n1702_003:0197b13_20"
    },
    {
        "source_sentence": "初、難起。",
        "translation": "First, it's difficult to arouse.",
        "source": "T33n1702_003:0197b13_21"
    },
    {
        "source_sentence": "意云下。",
        "translation": "The meaning is as follows.",
        "source": "T33n1702_003:0197b13_22"
    },
    {
        "source_sentence": "釋。",
        "translation": "It's explained.",
        "source": "T33n1702_003:0197b13_23"
    },
    {
        "source_sentence": "初二句標。",
        "translation": "The first two phrases are labeled.",
        "source": "T33n1702_003:0197b13_24"
    },
    {
        "source_sentence": "意云：雖無修行之文，含有修行之義。",
        "translation": "The meaning is: Although there's no text for cultivation, it contains the meaning of cultivation.",
        "source": "T33n1702_003:0197b14_25"
    },
    {
        "source_sentence": "如《起信》中說：「六八二識不言第七，雖即不說義亦具足」云云。",
        "translation": "As the Awakening of Faith says, The sixth and eighth consciousnesses don't say the seventh, even though they don't explain their meaning, it's also complete.",
        "source": "T33n1702_003:0197b14_26"
    },
    {
        "source_sentence": "謂四下。",
        "translation": "It's called the next of the four.",
        "source": "T33n1702_003:0197b16_27"
    },
    {
        "source_sentence": "指經釋成。",
        "translation": "It refers to the sūtras that explain their accomplishment.",
        "source": "T33n1702_003:0197b16_28"
    },
    {
        "source_sentence": "意云：四心中亦有住修降義，六度中亦有住修降義。",
        "translation": "It means that the four minds also have the meaning of abiding and cultivating subjugated, and the six perfections also have the meaning of abiding and cultivating subjugated.",
        "source": "T33n1702_003:0197b16_29"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T33n1702_003:0197b17_30"
    },
    {
        "source_sentence": "住謂發心，必須修進；",
        "translation": "Abiding means to give rise to mind. It requires effort.",
        "source": "T33n1702_003:0197b18_31"
    },
    {
        "source_sentence": "降謂制伏，依住修所明；",
        "translation": "Subjugation means to subdue. It is defined by the absorptions of abiding and cultivation.",
        "source": "T33n1702_003:0197b18_32"
    },
    {
        "source_sentence": "由是於此不相捨離。",
        "translation": "Thus, they aren't separated from each other here.",
        "source": "T33n1702_003:0197b19_33"
    },
    {
        "source_sentence": "秦什所略意在於茲，文雖不明義已具矣。",
        "translation": "The abbreviated meaning of what Qin Shi intends is here, and although the text doesn't explain it, its meaning is already complete.",
        "source": "T33n1702_003:0197b19_34"
    },
    {
        "source_sentence": "故無著下。",
        "translation": "Therefore, it's below the level of nonattachment.",
        "source": "T33n1702_003:0197b20_35"
    },
    {
        "source_sentence": "三、引論證。",
        "translation": "3. citing the treatise to prove it.",
        "source": "T33n1702_003:0197b20_36"
    },
    {
        "source_sentence": "住謂欲願者，欲願意起即是發心也。",
        "translation": "Abiding means wishing for, and the arousal of desire is the arousal of mind.",
        "source": "T33n1702_003:0197b20_37"
    },
    {
        "source_sentence": "修行等者。",
        "translation": "Those who cultivate practice and so forth.",
        "source": "T33n1702_003:0197b21_38"
    },
    {
        "source_sentence": "平等持心名為等持，等持即相應，相應即是修行義也。",
        "translation": "The mind that maintains equality is called equipoise, and equipoise is associated with it, which is the meaning of cultivation.",
        "source": "T33n1702_003:0197b22_0"
    },
    {
        "source_sentence": "降伏等者。",
        "translation": "The one who subdues and so forth.",
        "source": "T33n1702_003:0197b23_1"
    },
    {
        "source_sentence": "彼心即上相應心也。",
        "translation": "That mind is the mind associated with the above.",
        "source": "T33n1702_003:0197b23_2"
    },
    {
        "source_sentence": "制令還住，即却使相應也。",
        "translation": "It's associated with the afflictive tendencies that restrain and cause them to return, which are the afflictive tendencies that reject.",
        "source": "T33n1702_003:0197b23_3"
    },
    {
        "source_sentence": "此即依住修說降伏義。",
        "translation": "This is the meaning of subjugating by relying on abiding and cultivating.",
        "source": "T33n1702_003:0197b24_4"
    },
    {
        "source_sentence": "經論相契聖旨頗同，故如上說理實然矣。",
        "translation": "The characteristics of the sūtras and treatises are quite similar in their noble aim, so it's true that they're as explained above.",
        "source": "T33n1702_003:0197b25_5"
    },
    {
        "source_sentence": "又十八等者。",
        "translation": "Also, the eighteen and so forth.",
        "source": "T33n1702_003:0197b26_0"
    },
    {
        "source_sentence": "此是無著論，明豎答三問之意也。",
        "translation": "This is the absence of attachment theory, which explains the meaning of the three questions that are directly answered.",
        "source": "T33n1702_003:0197b26_1"
    },
    {
        "source_sentence": "若準天親解經，則明橫答三問，從「須菩提！",
        "translation": "If we refer to the sūtras that are directly understood by gods, then we'll explain the three questions that are answered horizontally and vertically, from Subhūti!",
        "source": "T33n1702_003:0197b27_2"
    },
    {
        "source_sentence": "但應如所教住」已下，即為別斷疑情。",
        "translation": "But you should abide as you've been taught. The following is to separately end doubtful feelings.",
        "source": "T33n1702_003:0197b28_0"
    },
    {
        "source_sentence": "今明無著故有此說。",
        "translation": "Now, it's clear that this explanation exists because there's no attachment.",
        "source": "T33n1702_003:0197b28_1"
    },
    {
        "source_sentence": "意云：不唯四心、六度之中有住修降伏之義，其如十八住內，皆有此三。",
        "translation": "It means that it's not only in the four minds and six perfections that there's the meaning of abiding and cultivating subjugation, but these three exist within the 18 abodes.",
        "source": "T33n1702_003:0197b29_2"
    },
    {
        "source_sentence": "如初住中，度四生入涅槃是住義，無生可度是修義，無我等相是降伏義。",
        "translation": "In the first stage of absorption, to liberate oneself from the four forms of birth and enter nirvana is the meaning of abiding; to be liberated through nonorigination is the meaning of cultivating; such characteristics as selflessness are the meaning of being subdued.",
        "source": "T33n1702_003:0197c01_3"
    },
    {
        "source_sentence": "初住既爾餘則皆然。",
        "translation": "Since the first abode is like this, the rest are likewise.",
        "source": "T33n1702_003:0197c03_4"
    },
    {
        "source_sentence": "故知下。",
        "translation": "Therefore, it's known below.",
        "source": "T33n1702_003:0197c04_0"
    },
    {
        "source_sentence": "結義。",
        "translation": "It concludes with its meaning.",
        "source": "T33n1702_003:0197c04_1"
    },
    {
        "source_sentence": "三行一者，三義具足方成一行。",
        "translation": "The three practices are one, because only when the three meanings are complete does one practice become a practice.",
        "source": "T33n1702_003:0197c04_2"
    },
    {
        "source_sentence": "謂空發心降伏，不修行亦非行。",
        "translation": "It means that the arousal of mind in emptiness is subdued, and it's neither cultivated nor practiced.",
        "source": "T33n1702_003:0197c05_0"
    },
    {
        "source_sentence": "但發心修行，不降伏亦非行。",
        "translation": "They simply give rise to the intention to cultivate it, but they don't subdue it or practice it.",
        "source": "T33n1702_003:0197c05_1"
    },
    {
        "source_sentence": "空降伏修行，不發心亦非行。",
        "translation": "He cultivates the practice of emptiness and subdues it, but he doesn't give rise to mind or practice.",
        "source": "T33n1702_003:0197c06_2"
    },
    {
        "source_sentence": "如鼎三足如天三光，闕一不可。",
        "translation": "It's like the three legs of a tripod, like the three rays of light from heaven, missing one thing.",
        "source": "T33n1702_003:0197c07_0"
    },
    {
        "source_sentence": "譯經之妙厥在茲焉。",
        "translation": "The marvelousness of the translation of the sūtras is found here.",
        "source": "T33n1702_003:0197c07_1"
    },
    {
        "source_sentence": "印讚所讚者，印讚須菩提之所讚也。",
        "translation": "What's praised by the seal is praised by the seal that praises Suppository.",
        "source": "T33n1702_003:0197c08_2"
    },
    {
        "source_sentence": "即經云「善哉善哉」是讚也。",
        "translation": "That is, the sūtra says, Good, good! This is praise.",
        "source": "T33n1702_003:0197c09_0"
    },
    {
        "source_sentence": "「如汝所說」是印也。",
        "translation": "As you say, this is the sign.",
        "source": "T33n1702_003:0197c09_1"
    },
    {
        "source_sentence": "「如來善護念」等，是所讚也。",
        "translation": "The phrase well guarded mindfulness of the Tathāgata and so forth is praised.",
        "source": "T33n1702_003:0197c10_0"
    },
    {
        "source_sentence": "重言等者，善吉所讚雅契佛心，若不重言安表善極。",
        "translation": "The repeated words and so forth are praised by Sunetra as being elegant and consistent with the Buddha's mind, and if they aren't repeated, they represent the ultimate goodness.",
        "source": "T33n1702_003:0197c10_1"
    },
    {
        "source_sentence": "如顏回死，夫子歎之云：「天喪予！",
        "translation": "Rui Yan died, and Fu Zi praised him, saying, Dear god!",
        "source": "T33n1702_003:0197c11_2"
    },
    {
        "source_sentence": "天喪予！」",
        "translation": "gods will lose you!",
        "source": "T33n1702_003:0197c12_3"
    },
    {
        "source_sentence": "注云：「再言者，痛傷之甚也。」",
        "translation": "The commentary says, That's a great painful thing to say again.",
        "source": "T33n1702_003:0197c12_4"
    },
    {
        "source_sentence": "吉凶雖別殷勤頗同。",
        "translation": "Although good fortune and bad fortune are distinct, their vigor is quite the same.",
        "source": "T33n1702_003:0197c13_5"
    },
    {
        "source_sentence": "護付等者。",
        "translation": "He who protects the transmission and so forth.",
        "source": "T33n1702_003:0197c13_6"
    },
    {
        "source_sentence": "空生發言言當其事，是故調御印讚云云。",
        "translation": "Emptiness arises from speech and speaks appropriately, so the taming mudrā praises it.",
        "source": "T33n1702_003:0197c13_7"
    },
    {
        "source_sentence": "勅聽許說者。",
        "translation": "I'll order those who hear and approve of it to teach it.",
        "source": "T33n1702_003:0197c14_8"
    },
    {
        "source_sentence": "經云：「汝今諦聽」，勅聽也。",
        "translation": "The sūtra says, Listen closely now, and it's an order to listen.",
        "source": "T33n1702_003:0197c15_9"
    },
    {
        "source_sentence": "「當為汝說」，許說也。",
        "translation": "You will explain it for you, and I'll allow you to explain it.",
        "source": "T33n1702_003:0197c15_10"
    },
    {
        "source_sentence": "諦謂審實之義，意令審諦真實用心聽也。",
        "translation": "Truth refers to the meaning of scrutiny, which is to cause scrutiny and genuine attention to be listened to.",
        "source": "T33n1702_003:0197c16_11"
    },
    {
        "source_sentence": "無以生滅等者。",
        "translation": "There's no such thing as arising and ceasing.",
        "source": "T33n1702_003:0197c17_12"
    },
    {
        "source_sentence": "此乃反用《淨名》經文。",
        "translation": "This is the opposite of using the text of the Pure Names sūtra.",
        "source": "T33n1702_003:0197c17_13"
    },
    {
        "source_sentence": "彼云：「無以生滅心行說實相法」，此意云：既不得以生滅心說，豈得以生滅心聽。",
        "translation": "They say, There's no way to explain the true characteristics of the teaching in terms of the mental functioning of arising and ceasing, meaning that since they can't be explained in terms of arising and ceasing, how can they be heard in terms of arising and ceasing?",
        "source": "T33n1702_003:0197c17_14"
    },
    {
        "source_sentence": "既是不生不滅實相之法，云何以生滅心行說之聽之，無以妙饌置於穢器。",
        "translation": "Since they don't give rise to and don't cease the true characteristics, how can they be listened to with arising and ceasing mental actions without putting a wonderful food in a defiled container?",
        "source": "T33n1702_003:0197c19_15"
    },
    {
        "source_sentence": "《智論》下。",
        "translation": "It's below the level of the Zhilun.",
        "source": "T33n1702_003:0197c21_16"
    },
    {
        "source_sentence": "釋相。",
        "translation": "He explains the characteristics.",
        "source": "T33n1702_003:0197c21_17"
    },
    {
        "source_sentence": "端視謂不左顧右眄也。",
        "translation": "Looking at it correctly means not looking left or right.",
        "source": "T33n1702_003:0197c21_18"
    },
    {
        "source_sentence": "目若別顧心則異緣，本欲制心且令端視，此是用心之方便也。",
        "translation": "If the eye looks at the mind separately, it's for different reasons, and if you originally wanted to restrain the mind and make it look correct, this is the method of mindfulness.",
        "source": "T33n1702_003:0197c22_19"
    },
    {
        "source_sentence": "渴飲者，喻也。",
        "translation": "The thirsty drinker is a metaphor.",
        "source": "T33n1702_003:0197c23_20"
    },
    {
        "source_sentence": "如渴飲水，但恐水竭無暇別觀。",
        "translation": "It's like drinking water with thirst, but you're afraid the water will run out and won't have time to look around.",
        "source": "T33n1702_003:0197c23_21"
    },
    {
        "source_sentence": "聽法之者，亦復如是。",
        "translation": "So it is with those who listen to the teaching.",
        "source": "T33n1702_003:0197c24_22"
    },
    {
        "source_sentence": "思冀妙門無心睥睨。",
        "translation": "He thought and hoped for the marvelous approach, but he didn't have the mind to shout it.",
        "source": "T33n1702_003:0197c25_23"
    },
    {
        "source_sentence": "一心入語義者，意中現義方發於言，言中有義義中有意，令聽者以耳識聽其言，",
        "translation": "He who enters the meaning of words with one thought into words, produces words only when there is an expressed meaning in his mind. With words, there is a meaningful meaning within meaning, so that the listener hears those words by means of the consciousness of hearing.",
        "source": "T33n1702_003:0197c25_24"
    },
    {
        "source_sentence": "以意識採其義，尋義而取意，得意而捨義。",
        "translation": "By means of the thinking consciousness, he grasps its meaning, searches for its meaning and apprehends its meaning, and abandons its meaning when he attains it.",
        "source": "T33n1702_003:0197c27_25"
    },
    {
        "source_sentence": "苟能得意在懷，何慮失於言義？",
        "translation": "If you can concentrate your mind on it, why should you worry about losing words and meanings?",
        "source": "T33n1702_003:0197c28_26"
    },
    {
        "source_sentence": "心心若此如瓶注瓶，一覽無遺可為至妙。",
        "translation": "If this mind and thought are like a pot pouring water into a pot, there's nothing left to be seen that can be the most marvelous.",
        "source": "T33n1702_003:0197c28_27"
    },
    {
        "source_sentence": "故云一心入於語義中也。",
        "translation": "That's why it's called entering into the meaning of words with one mind.",
        "source": "T33n1702_003:0197c29_28"
    },
    {
        "source_sentence": "踊躍即歡賀之貌，即欲聞法之時也。",
        "translation": "Dancing is the appearance of rejoicing, which is the time when he wants to hear the Dharma.",
        "source": "T33n1702_003:0198a01_29"
    },
    {
        "source_sentence": "悲喜即聞了之時。",
        "translation": "When he hears it, he's overwhelmed with pity and joy.",
        "source": "T33n1702_003:0198a02_30"
    },
    {
        "source_sentence": "悲謂傷昔日不遇，如下經云：「涕淚悲泣。」",
        "translation": "Compassion means to grieve for the fact that they weren't met in the past, as the sūtra says, Tears and tears of sorrow.",
        "source": "T33n1702_003:0198a02_31"
    },
    {
        "source_sentence": "喜謂慶今日之得聞，如鶖子踊躍歡喜，傷昔慶今故云悲喜。",
        "translation": "Joy means to rejoice in today's attainment of hearing. It's like a young boy who jumps up and dances with joy, grieving for past joy and present sorrow; therefore, it's called pity and joy.",
        "source": "T33n1702_003:0198a03_32"
    },
    {
        "source_sentence": "如是下。",
        "translation": "Thus, it's below this.",
        "source": "T33n1702_003:0198a04_33"
    },
    {
        "source_sentence": "結揀其機也。",
        "translation": "It's a way to conclude by selecting their abilities.",
        "source": "T33n1702_003:0198a05_34"
    },
    {
        "source_sentence": "意云：若不如是用心，則不可為說。",
        "translation": "The meaning is: If someone doesn't do so with such an intention, then they can't explain it for them.",
        "source": "T33n1702_003:0198a05_35"
    },
    {
        "source_sentence": "又真諦記說，諦聽離三過失、得三功德。",
        "translation": "It's also said in the record of the true truth that they listen closely and part with the three faults and attain the three virtues.",
        "source": "T33n1702_003:0198a06_36"
    },
    {
        "source_sentence": "謂離散亂、輕慢、顛倒，如次生聞、思、修三慧也。",
        "translation": "They are free of distraction, despise conceit and delusion, and thus give rise to the three kinds of wisdom in order: hearing, contemplating, and cultivating.",
        "source": "T33n1702_003:0198a07_37"
    },
    {
        "source_sentence": "標勸將陳者。",
        "translation": "He's labeled an exhortation to present it.",
        "source": "T33n1702_003:0198a08_38"
    },
    {
        "source_sentence": "標謂標指，勸謂勸勉，將猶欲也，陳說也。",
        "translation": "An indication refers to an indication, and an exhortation refers to an exhortation. It's still about to be desired, but it's explained.",
        "source": "T33n1702_003:0198a08_39"
    },
    {
        "source_sentence": "即經云「善男子」等，標也。",
        "translation": "That is, the sūtras say, Good sons, and so forth, which are labeled.",
        "source": "T33n1702_003:0198a09_40"
    },
    {
        "source_sentence": "應如是等者，勸也。",
        "translation": "Such is the exhortation.",
        "source": "T33n1702_003:0198a09_41"
    },
    {
        "source_sentence": "標勸之意，意在欲說，故云將陳。",
        "translation": "The intention of the exhortation is to want to explain it, so it's called going to explain it.",
        "source": "T33n1702_003:0198a10_42"
    },
    {
        "source_sentence": "即懸指向下正答之文，是故疏云：「我當為汝等也。」",
        "translation": "That's the text of the correct answer below pointing down, so the commentary says, I will do it for you.",
        "source": "T33n1702_003:0198a10_43"
    },
    {
        "source_sentence": "三中唯者下。",
        "translation": "Third, it's below the only thing in the three.",
        "source": "T33n1702_003:0198a12_0"
    },
    {
        "source_sentence": "如今人稱喏，皆順從之辭也。",
        "translation": "People now call it thus, and they all follow its words.",
        "source": "T33n1702_003:0198a12_1"
    },
    {
        "source_sentence": "老子云：「唯之與阿相去幾何？」",
        "translation": "Laozi said, What's the distance between it and Āśoka alone?",
        "source": "T33n1702_003:0198a12_2"
    },
    {
        "source_sentence": "注文如疏，今則禮對也。",
        "translation": "The order is as described in the commentary, but now we're paying homage to him.",
        "source": "T33n1702_003:0198a13_3"
    },
    {
        "source_sentence": "十地等者，釋願聞之相。",
        "translation": "The ten stages and so forth explain the characteristic of wishing to hear.",
        "source": "T33n1702_003:0198a14_4"
    },
    {
        "source_sentence": "即《華嚴》十地品中，諸菩薩眾請金剛藏說十地法門之偈。",
        "translation": "That is, in the chapter on the ten stages of the Flower Ornament, the bodhisattvas invited the Vajragarbha to recite a verse on the ten stages of the Dharma teaching from the vajra store.",
        "source": "T33n1702_003:0198a14_5"
    },
    {
        "source_sentence": "今借用之。",
        "translation": "Now, let's borrow it.",
        "source": "T33n1702_003:0198a15_6"
    },
    {
        "source_sentence": "然前四句，於中約喻配其三慧。",
        "translation": "However, the first four sentences combine the three kinds of wisdom in terms of metaphors.",
        "source": "T33n1702_003:0198a16_7"
    },
    {
        "source_sentence": "初句聞慧，聞法不思如飲水不味。",
        "translation": "The first phrase is the wisdom of hearing, which hears the teaching and doesn't think about it like drinking water and not tasting it.",
        "source": "T33n1702_003:0198a16_8"
    },
    {
        "source_sentence": "次句思慧，若要尋求食味，應須啖嚼。",
        "translation": "The next phrase is the wisdom of contemplation, which requires chewing if you want to seek food and taste.",
        "source": "T33n1702_003:0198a17_9"
    },
    {
        "source_sentence": "第三修慧，修行惑遣如服藥病除。",
        "translation": "The third is the wisdom of cultivation, which removes the afflictions by cultivating practice like taking medicine and healing illnesses.",
        "source": "T33n1702_003:0198a18_10"
    },
    {
        "source_sentence": "後句即三慧之果。",
        "translation": "The latter phrase refers to the fruit of the three kinds of wisdom.",
        "source": "T33n1702_003:0198a19_11"
    },
    {
        "source_sentence": "蜂採百華以成蜜，人集萬行以證真，蜂成蜜已依蜜而活，人證真已依真而住。",
        "translation": "The bees gather a hundred flowers to make honey, and people gather myriad practices to realize the truth. After making honey, the bees live on honey, and after realizing the truth, people live on it.",
        "source": "T33n1702_003:0198a19_12"
    },
    {
        "source_sentence": "我等下。",
        "translation": "It's below us.",
        "source": "T33n1702_003:0198a21_13"
    },
    {
        "source_sentence": "合喻。",
        "translation": "It's a combined metaphor.",
        "source": "T33n1702_003:0198a21_14"
    },
    {
        "source_sentence": "最後一句，通喻所聞。",
        "translation": "The last phrase is a general metaphor for what's heard.",
        "source": "T33n1702_003:0198a21_15"
    },
    {
        "source_sentence": "金剛經纂要刊定記卷第三",
        "translation": "Jingang jing xiangyao ganding ji, vol. 3",
        "source": "T33n1702_003:0198a23_0"
    }
]