[
    {
        "source_sentence": "法華玄義釋籤卷第十九",
        "translation": "Fahua xuanyi zhi shou, vol. 19",
        "source": "T33n1717_019:0948b12_0"
    },
    {
        "source_sentence": "天台沙門湛然述",
        "translation": "Tiantai shaman Zhanran shu",
        "source": "T33n1717_019:0948b14_0"
    },
    {
        "source_sentence": "五教相中二：先明來意，次開章解釋。",
        "translation": "Of the five characteristics of the teaching, there are two: first, he explains the meaning of the teaching and second, he begins with an explanation.",
        "source": "T33n1717_019:0948b15_0"
    },
    {
        "source_sentence": "初文中又二：初正明來意，次「但聖」下述開章意。",
        "translation": "The first text has two further meanings: first, it correctly explains the meaning of the coming teaching; second, it describes the meaning of the opening chapter under simply noble.",
        "source": "T33n1717_019:0948b15_1"
    },
    {
        "source_sentence": "初文云「若弘法華」至「有闕」者，法華前經，但當文判釋於義未失，",
        "translation": "The first part of the text says, If we spread the Lotus until there's a deficiency, it's because the previous sūtra before the Lotus but the interpretation of its meaning is not lost in the present text.",
        "source": "T33n1717_019:0948b16_2"
    },
    {
        "source_sentence": "當文辨教於理易明；",
        "translation": "The present text identifies the teaching and makes it easy to understand in principle.",
        "source": "T33n1717_019:0948b18_3"
    },
    {
        "source_sentence": "若弘法華，須辨一期五時教相，說佛本意，意在何之？",
        "translation": "If you propagate the Lotus, you must discern the characteristics of the first and fifth periods of the teaching in order to explain the Buddha's original intention, where is that intention?",
        "source": "T33n1717_019:0948b18_4"
    },
    {
        "source_sentence": "諸經有體，體趣何等？",
        "translation": "The scriptures have an essence, but what is their essence?",
        "source": "T33n1717_019:0948b20_5"
    },
    {
        "source_sentence": "明宗明用為何所依？",
        "translation": "What's the basis of the doctrine that explains what it uses?",
        "source": "T33n1717_019:0948b20_6"
    },
    {
        "source_sentence": "是故前釋宗用中云，用是宗用、宗是體宗，名總標三、教相判四，是故法華不明教相，",
        "translation": "Therefore, the previous explanation of doctrine and function states: The doctrine is the doctrine and the doctrine is the essence doctrine. Names are given as a general designation [of doctrine] and the characteristics of doctrine are judged as four. That is why the Lotus does not specify the characteristics of doctrine.",
        "source": "T33n1717_019:0948b21_7"
    },
    {
        "source_sentence": "使前四義冥無所顯，四義不顯妙法難明，故不明教相於理實闕。",
        "translation": "Because the first four meanings are not expressed in obscurity, and because the four meanings do not express the subtle dharmas that are difficult to understand. Therefore, it is unknown that the characteristics of the doctrine are really missing from the reason.",
        "source": "T33n1717_019:0948b23_8"
    },
    {
        "source_sentence": "次文為五：初「但聖意」下述大意意，次「前代」下述異解意，三「雖阡陌」下述明難意，",
        "translation": "The next text is composed of five parts: the first part, simply the meaning of the sage, explains the meaning of the great meaning; the second part, past lives, explains the meaning of divergent interpretations; and the third part, although it's a long path, explains the meaning of difficulty.",
        "source": "T33n1717_019:0948b24_9"
    },
    {
        "source_sentence": "四「然義不」下述去取意，五「南嶽」下述判教意。",
        "translation": "The fourth is the meaning of removing and grasping under Still, and the fifth is the meaning of judgement under Nanyue.",
        "source": "T33n1717_019:0948b26_10"
    },
    {
        "source_sentence": "以聖旨難知，故須先出大意。",
        "translation": "Because the noble teaching is difficult to know, it's necessary to first explain the great meaning.",
        "source": "T33n1717_019:0948b27_11"
    },
    {
        "source_sentence": "以諸師不同，故須逐失略列。",
        "translation": "Because the masters are different, it's necessary to list them briefly in order of error.",
        "source": "T33n1717_019:0948b28_12"
    },
    {
        "source_sentence": "以無一全，是故一一難破。",
        "translation": "Because there's no single whole, it's therefore difficult to break down one by one.",
        "source": "T33n1717_019:0948b28_13"
    },
    {
        "source_sentence": "以不全非，故須明去取，唯證可從，故準南嶽正判。",
        "translation": "Because it's not completely wrong, it must be explained that removal and grasping are the only things to be realized, so it's accurate to judge them according to Nanyue.",
        "source": "T33n1717_019:0948b29_14"
    },
    {
        "source_sentence": "次開章解釋中二：先列章，次解釋中初大意者，大略而言，五時教中前之四時當部被物，",
        "translation": "Next, there are two explanations in the opening chapter: first, listing the chapters; second, explaining the first major idea of the explanation.",
        "source": "T33n1717_019:0948c01_15"
    },
    {
        "source_sentence": "而不須明設教多少、開合增減對帶等意，意在何之？",
        "translation": "It doesn't need to explain the meaning of positing the number of teachings, opening and closing, increasing and decreasing counterpoints, and so forth, but what does it mean?",
        "source": "T33n1717_019:0948c03_16"
    },
    {
        "source_sentence": "於中為三：初明說之根本，次「說餘」下正明大意，三「若能」下結勸。",
        "translation": "There are three of these: the first explains the root of the teaching, the second explains the main idea under Explain the rest, and the third concludes with an exhortation under If you can.",
        "source": "T33n1717_019:0948c05_17"
    },
    {
        "source_sentence": "初文者，約佛自證本不可說，若被此土機緣，須假立聲教。",
        "translation": "The first text refers to the Buddha's own realization that the originally ineffable can't be explained, and if he were to take advantage of the opportunity in this land, he would have to rely on the sound teaching.",
        "source": "T33n1717_019:0948c06_18"
    },
    {
        "source_sentence": "次正大意中四：初明教法優劣，次「其宿植」下明物機不同，三「如是」下明如來能鑒，",
        "translation": "Next, there are four main ideas: first, to explain the superiority and inferiority of the teachings; second, under those planted in the past, to explain the differences in abilities of things; third, under thus, to explain that the Tathāgata can discern.",
        "source": "T33n1717_019:0948c07_19"
    },
    {
        "source_sentence": "四「又已今當」下明校量所說。",
        "translation": "Fourth, under Furthermore, it's now and will be, he explains what he's taught by measuring.",
        "source": "T33n1717_019:0948c09_20"
    },
    {
        "source_sentence": "初又二：初明餘經當機當部，不涉始終；",
        "translation": "The first is further twofold. First, it explains that the other scriptures are appropriate for the occasion and for the sect, without going from beginning to end.",
        "source": "T33n1717_019:0948c10_21"
    },
    {
        "source_sentence": "次「今經」下明今經化緣教旨始末，該攝遠近。",
        "translation": "Next, under present sūtras, he explains the beginning and end of the purpose of the present sūtra's teaching of transformation as a condition, which should include both distant and near.",
        "source": "T33n1717_019:0948c11_22"
    },
    {
        "source_sentence": "初文又三：初總略標示，次「至如」下別明前後諸教，三「凡此」下總結諸教未窮。",
        "translation": "The first text has three parts: the first summarizes and briefly labels them, the second explains the prior and subsequent teachings separately under thusness, and the third concludes that the teachings are not exhausted under worldlings.",
        "source": "T33n1717_019:0948c12_23"
    },
    {
        "source_sentence": "初如文。",
        "translation": "The first is as explained in the text.",
        "source": "T33n1717_019:0948c14_24"
    },
    {
        "source_sentence": "次文自五，即四時并涅槃。",
        "translation": "The next sentence has five parts, which are the four seasons and nirvāṇa.",
        "source": "T33n1717_019:0948c14_25"
    },
    {
        "source_sentence": "初云「至如華嚴」至「住上地上」者，今家為顯部中圓別二位不同，故云地住。",
        "translation": "The first one says, Up to the point where it's like the Flower Ornament and up to the point where it abides in the higher ground means that the present school explains that the two stages of perfection and distinction are different, so it's called the earthly abode.",
        "source": "T33n1717_019:0948c15_0"
    },
    {
        "source_sentence": "新譯經中初會六品，秖明如來現相、普賢三昧、世界藏海，第二會六品，",
        "translation": "In the newly translated scriptures, the first assembly consists of six chapters:",
        "source": "T33n1717_019:0948c16_1"
    },
    {
        "source_sentence": "前之五品但明人法名號、菩薩發問，為入住之端，第三會六品秖說十住，",
        "translation": "The first five chapters simply explain the names of humans and dharmas and the bodhisattvas who ask questions, for the sake of enlightenment. At the end of the third assembly, they discuss the ten abodes in six chapters:",
        "source": "T33n1717_019:0948c18_2"
    },
    {
        "source_sentence": "第四會四品秖說十行，第五會三品秖說十向，第六會一品秖說十地，第七會十一品秖明十地勝進行耳，",
        "translation": "The fourth assembly explains the ten practices in four chapters, the fifth assembly explains the ten dedications in three chapters, the sixth assembly explains the ten stages in one chapter, and the seventh assembly explains the superior practice of the ten stages in eleven chapters.",
        "source": "T33n1717_019:0948c20_3"
    },
    {
        "source_sentence": "第八會明離世間一品，及以最後入法界品，秖是令信善知識教，故知一經三十七品，",
        "translation": "The eighth assembly explains the one chapter, “Seclusion from the world,” and the final chapter, “Entry into the cosmos of reality.” Because this is to cause faith in the doctrine of spiritual benefactors, we know that one scripture has thirty-seven chapters:",
        "source": "T33n1717_019:0948c22_4"
    },
    {
        "source_sentence": "俱明菩薩行位功德。",
        "translation": "They both explain the merit of the bodhisattva's level of practice.",
        "source": "T33n1717_019:0948c24_5"
    },
    {
        "source_sentence": "言「圓別」者，住中多明圓融之相，行後多明歷別之相，而皆不明行位之意，",
        "translation": "The expression distinctive from the perfect refers to the fact that many of the abodes explain the characteristics of the perfect interpenetration, and many of the subsequent practices explain the distinctive characteristics, but they don't understand the meaning of the stages of practice.",
        "source": "T33n1717_019:0948c25_6"
    },
    {
        "source_sentence": "不語初成頓說大旨。",
        "translation": "He doesn't say that the first accomplishment suddenly explains the great idea.",
        "source": "T33n1717_019:0948c26_7"
    },
    {
        "source_sentence": "四含灼然說小而已，而亦不明說小之意，於大化不獲，垂以劣形，說以淺法，",
        "translation": "Fourth, Ānanda, [the Buddha] clearly taught the lesser but did not explain the meaning of the lesser. Nor did he teach the Dharma for the greater without acquiring enlightenment. He taught it on the basis of inferior forms and explained it on the basis of shallow teachings.",
        "source": "T33n1717_019:0948c27_8"
    },
    {
        "source_sentence": "赴小機宜，豈非曲巧？",
        "translation": "Wouldn't it be skillful to go to a lesser opportunity?",
        "source": "T33n1717_019:0948c29_9"
    },
    {
        "source_sentence": "方等折小，如〈弟子品〉，彈偏，如〈菩薩品〉；",
        "translation": "The square and small are as in the Disciples’ Chapter, while the gross and partial are as in the chapter on enlightening beings.",
        "source": "T33n1717_019:0948c29_10"
    },
    {
        "source_sentence": "如〈觀眾生品〉，即是歎大，稱歎文殊及淨名等，即是褒圓。",
        "translation": "As in the chapter on the audience section, this is praising greatness and praising Mañjuśrī and Jīvaka, which is praising perfection.",
        "source": "T33n1717_019:0949a01_11"
    },
    {
        "source_sentence": "又〈弟子品〉，用折不同，有用三教，如訶目連是歎大；",
        "translation": "Also, the Disciples' Chapter uses different refutation and there are three teachings that need to be used, like reprimanding Maudgalyāyana for being a great admirer.",
        "source": "T33n1717_019:0949a03_12"
    },
    {
        "source_sentence": "有用圓訶，如訶身子是褒圓；",
        "translation": "It is useful to reprimand in full, just as the body of a remorseful person is praised in full.",
        "source": "T33n1717_019:0949a04_13"
    },
    {
        "source_sentence": "慈悲行願如〈問疾品〉、〈佛道品〉；",
        "translation": "The practice and vows of kindness and compassion are as in the Chapter on Inquiries into illnesses and the Chapter on the Path of Buddhahood.",
        "source": "T33n1717_019:0949a05_14"
    },
    {
        "source_sentence": "事理殊絕如〈不思議品〉，〈香積品〉等，是事殊絕，〈入不二法門品〉，",
        "translation": "The distinction between principle and phenomena is as shown in the Inconceivable Chapter, the Fragrance Treasury Chapter, and so forth.",
        "source": "T33n1717_019:0949a05_15"
    },
    {
        "source_sentence": "是理殊絕，雖有此勝亦不明大小並席具對眾機等意。",
        "translation": "Although there's this superiority, it doesn't know the meaning of large and small seats facing each other in terms of abilities and so forth.",
        "source": "T33n1717_019:0949a07_16"
    },
    {
        "source_sentence": "般若論通則通於三教，故曰「三人」。",
        "translation": "The Prajñāpāramitā-śāstra explains that it's shared with the three teachings, so it's called three people.",
        "source": "T33n1717_019:0949a08_17"
    },
    {
        "source_sentence": "論別則獨在別圓，故云「獨進」。",
        "translation": "When discussing distinctions, it's only in the distinctive and perfect, so it's called solitary advancement.",
        "source": "T33n1717_019:0949a09_18"
    },
    {
        "source_sentence": "三教同被盡淨虛融，二乘之人無心悕取，鈍根菩薩推功上人，別教地前謂為別俗，",
        "translation": "The three teachings are the same as being completely pure and unadulterated, while adherents of the two vehicles have no mind to grasp it; dull-rooted bodhisattvas esteem superior people for their merit.",
        "source": "T33n1717_019:0949a10_0"
    },
    {
        "source_sentence": "圓眾自謂一切圓融，故使文中始自色心、終乎種智，融通遍入，而亦不說設教所以。",
        "translation": "The perfect congregation itself refers to all perfect interpenetration, so the text begins with its own form and ends with the knowledge of seeds, which are interpenetrated and universally entered, but it doesn't explain the reason for setting up a teaching.",
        "source": "T33n1717_019:0949a11_1"
    },
    {
        "source_sentence": "別是不共，而不明一部有共不共意也。",
        "translation": "They are distinct and not shared, but they don't know that there's a shared and not shared meaning.",
        "source": "T33n1717_019:0949a13_2"
    },
    {
        "source_sentence": "涅槃重施方便，又於經初已開常宗，斥奪三脩十仙小證，中間廣答三十六問，",
        "translation": "At the beginning of the sutra, he had already opened the doctrine of eternalism by rejecting the three cultivations and ten lesser realizations of sages. In between, he answered in detail the thirty-six questions:",
        "source": "T33n1717_019:0949a14_3"
    },
    {
        "source_sentence": "廣辨菩薩五行十功，而亦少明用方便意。",
        "translation": "It's a detailed explanation of the five practices and ten merits of the bodhisattva, but it also briefly explains the meaning of using skillful means.",
        "source": "T33n1717_019:0949a16_4"
    },
    {
        "source_sentence": "結文，可知。",
        "translation": "The conclusion is clear.",
        "source": "T33n1717_019:0949a17_5"
    },
    {
        "source_sentence": "次明今經中二：先敘諸經以為綱目，次「但論」下明今經以為綱格。",
        "translation": "Next, he explains the present sūtra in two ways: first, he summarizes the sūtras as an outline and second, under simply discussing, he explains that the present sūtra is an outline.",
        "source": "T33n1717_019:0949a17_6"
    },
    {
        "source_sentence": "初文言「法門綱目」者，自法華已前諸經所明方便教門，如華嚴中別鹿苑四含，",
        "translation": "The first part of the sentence says, Outline of the Dharma teachings refers to the approaches of skillful means explained in the sutras that precede the Lotus Sutra, such as the four containments of the Deer Preserve's Commentary in the Flower Ornament.",
        "source": "T33n1717_019:0949a19_7"
    },
    {
        "source_sentence": "方等中三，般若中二，並是圓門綱目而已。",
        "translation": "In the equality, there are three, and in the prajñāpāramitā, there are two, which are just the outline of the perfect approach.",
        "source": "T33n1717_019:0949a21_8"
    },
    {
        "source_sentence": "雖諸部中有權有實而並不明權實本迹被物之意，故非大綱。",
        "translation": "Although there are right and real in the various texts, they don't both know the meaning of the right and real originally manifested things, so it's not a general outline.",
        "source": "T33n1717_019:0949a22_9"
    },
    {
        "source_sentence": "故說法華唯存大綱，不事綱目。",
        "translation": "Therefore, the Lotus of Dharma preaching only preserves the outline and doesn't serve the outline.",
        "source": "T33n1717_019:0949a23_10"
    },
    {
        "source_sentence": "次明今經者，欲明今經復先敘始末，方顯今妙。",
        "translation": "Next, we'll explain the present sūtra because we want to explain that the present sūtra first describes the beginning and end before revealing the present marvelousness.",
        "source": "T33n1717_019:0949a24_11"
    },
    {
        "source_sentence": "敘始末者，迹門以大通為元始，本門以本因為元始，今日以初成為元始，",
        "translation": "To describe the beginning and end, the origin of the teaching is founded by means of the Mahatong; the origin of the teaching is founded by means of the source; today it is founded by means of the beginning.",
        "source": "T33n1717_019:0949a25_12"
    },
    {
        "source_sentence": "大通已後本成已來如是中間節節施化，皆以漸頓適物機情，若大若小皆為取物機而與法差別。",
        "translation": "After the Mahāprajñāpāramitā had been originally formed, he thus gave alms in the middle seasonal periods, all gradually and suddenly adapting to the capacities of things, and whether large or small, they are differentiated from the teaching by grasping the capacities of things.",
        "source": "T33n1717_019:0949a27_13"
    },
    {
        "source_sentence": "若今日中間言取與者，華嚴已後法華之前，觀機為取，逗物為與，適者得也，",
        "translation": "If he says taking and giving in the interim today, it's before the Lotus Sutra after the Flower Ornament or before the Lotus Sutra, observing the opportunity is to take, teasing things is to give, and appropriateness is to obtain them.",
        "source": "T33n1717_019:0949a29_14"
    },
    {
        "source_sentence": "謂得時而用；",
        "translation": "It means to use it at the time of its acquisition.",
        "source": "T33n1717_019:0949b02_15"
    },
    {
        "source_sentence": "諸經不爾未為大體。",
        "translation": "The sūtras aren't like that, and they aren't the great essence.",
        "source": "T33n1717_019:0949b02_16"
    },
    {
        "source_sentence": "次「大事」下正明今經，「說教」等者，明今經是一代之綱格，「格」正也。",
        "translation": "Next, under great matters, he correctly explains the present sūtra and explains that the teachings and so forth clarify that the present sūtra is the outline of a generation, and格 is the correct meaning of格.",
        "source": "T33n1717_019:0949b03_17"
    },
    {
        "source_sentence": "「大化」等者，明一化之極，「筌」字應從竹，「蹄」字如《止觀》記。",
        "translation": "The phrase great transformation and so forth explains the ultimate of the single transformation, where the Sanskrit letter un follows from bamboo and the Sanskrit letter hooves are as recorded in Zhiguan.",
        "source": "T33n1717_019:0949b04_18"
    },
    {
        "source_sentence": "次明物機不同中又二：先明四種根性不同，次明今經純一根性教意綱紀。",
        "translation": "Next, there are two further ways to explain the differences in the abilities of things: first, they explain the differences in the four kinds of faculties and natures, and second, they explain the outline of the doctrine that the present sūtra is simply one-sided.",
        "source": "T33n1717_019:0949b06_19"
    },
    {
        "source_sentence": "初文自為四意，從「其宿植」去正出今經，敘於一代用教之意，故前文云「始從華嚴至般若來，",
        "translation": "The first text has four meanings of its own, which are described in the present sūtra from their constellations. Therefore, the preceding sentence says, From Huayan up to Prajñāpāramitā,",
        "source": "T33n1717_019:0949b07_20"
    },
    {
        "source_sentence": "皆不說於設教之意」，故從此下騰今經意，述一代教用與之由，故初說華嚴意在大根，",
        "translation": "They don't explain the meaning of setting up a teaching. Therefore, from here we'll discuss the meaning of the present sūtra, which describes the causes of the teaching and functioning of the teaching in one lifetime.",
        "source": "T33n1717_019:0949b10_21"
    },
    {
        "source_sentence": "言不涉小則三意未周，一不攝小機，二不開權，三不發迹。",
        "translation": "When they say they don't involve the lesser, the three meanings are not complete: one doesn't gather the lesser capacity, two don't open the right, and three don't give rise to the traces.",
        "source": "T33n1717_019:0949b12_22"
    },
    {
        "source_sentence": "從「其不堪者」去，說阿含教，意在於小，亦有三意未周，一不涉大機，",
        "translation": "Going from that which is unworthy, he teaches the teaching of the Āgamas because it's intended for the lesser, and there are three meanings that aren't yet complete, one that don't involve the greater capacity.",
        "source": "T33n1717_019:0949b13_23"
    },
    {
        "source_sentence": "餘二如前。",
        "translation": "The other two are as before.",
        "source": "T33n1717_019:0949b15_24"
    },
    {
        "source_sentence": "從「既得道已」去，說方等教具明大小，總有二意，一逗大逗小，二以大斥小，",
        "translation": "From Once you've attained the path, it's explained that the vaipulya teaching explains both large and small with two general meanings, one is to ridicule the greater and ridicule the lesser, and the second is to reject the lesser because of the greater.",
        "source": "T33n1717_019:0949b15_25"
    },
    {
        "source_sentence": "亦三意未周，一者不明逗緣彈斥之意，餘二同前。",
        "translation": "The first is the meaning of not understanding and refuting, while the other two are the same as the previous one.",
        "source": "T33n1717_019:0949b17_26"
    },
    {
        "source_sentence": "從「若宜兼通」去，說般若教，亦有二意，一通被大小，二洮汰付財，",
        "translation": "From If it's appropriate to be shared with both, the teaching of prajñā also has two meanings, which are explained in two ways: one is shared with both large and small, and two are shared with the Tathāgata's money.",
        "source": "T33n1717_019:0949b18_27"
    },
    {
        "source_sentence": "亦三意未周，一者無通被洮汰之意，餘二同前。",
        "translation": "Also, there are three ideas that haven't been fully explained, the first is without the idea of being subject to a tathāgata, and the other two are the same as the previous one.",
        "source": "T33n1717_019:0949b19_28"
    },
    {
        "source_sentence": "次文二：初明開顯，次結成綱紀。",
        "translation": "The next text is twofold: first, it explains the opening and revealing, and second, it concludes with a summary.",
        "source": "T33n1717_019:0949b21_29"
    },
    {
        "source_sentence": "從「過此難已」去唯至法華說前教意、顯今教意，故云「過此已後」。",
        "translation": "From beyond this difficulty, it goes only to the point where the Lotus teaches the meaning of the previous teaching and reveals the meaning of the present teaching, so it's called after that.",
        "source": "T33n1717_019:0949b21_30"
    },
    {
        "source_sentence": "定之以父子，開權人也。",
        "translation": "It's determined by father and son, which are the authoritative people.",
        "source": "T33n1717_019:0949b23_31"
    },
    {
        "source_sentence": "付之以家業，委權實法也。",
        "translation": "He entrusted it to his family business and entrusted it to the provisional and real teachings.",
        "source": "T33n1717_019:0949b23_32"
    },
    {
        "source_sentence": "此約迹門開權顯實。",
        "translation": "This is to reveal the authoritative and reveal the real in terms of the aspect of traces.",
        "source": "T33n1717_019:0949b24_33"
    },
    {
        "source_sentence": "次拂之以權迹、顯之以實本，此本門開迹顯本也。",
        "translation": "Next, he brushes it away as the authoritative traces and reveals it as the true source, which is the original aspect that opens the traces to reveal the source.",
        "source": "T33n1717_019:0949b25_34"
    },
    {
        "source_sentence": "此即法華之大綱。",
        "translation": "This is the outline of the Lotus.",
        "source": "T33n1717_019:0949b26_35"
    },
    {
        "source_sentence": "今家之撮要不過數行而已，收一代教法，出法華文心，辨諸教所以，請有眼者委悉尋之。",
        "translation": "The compiled essentials of the present collection are only a few lines in length, consisting of all the teachings and doctrines of one dynasty. It is composed of the texts and minds of the Lotus Sutra and explains the reasons for these teachings. All those with eyes are requested to search them thoroughly.",
        "source": "T33n1717_019:0949b26_36"
    },
    {
        "source_sentence": "勿云法華漸圓不及華嚴頓極，當知法華約部則尚破華嚴般若，約教則尚破別教後心，",
        "translation": "Don't say that the gradual completion of the Lotus isn't as great as the sudden arrival of the Flower Ornament. You should know that the Lotus in terms of its order is still refuting the Flower Ornament Prajñāpāramitā, and in terms of its teachings it's still refuting the second thought behind the distinct teachings.",
        "source": "T33n1717_019:0949b28_37"
    },
    {
        "source_sentence": "如此教旨豈同外人因中有果等而為匹類耶？",
        "translation": "Is the doctrine of this teaching the same as that of non-Buddhists who believe that there is a cause, an effect, etc., within a cause?",
        "source": "T33n1717_019:0949c01_38"
    },
    {
        "source_sentence": "一一文中皆先述教意，次引文證。",
        "translation": "Each text first describes the meaning of the teaching and then cites the text to prove it.",
        "source": "T33n1717_019:0949c02_39"
    },
    {
        "source_sentence": "次「當知」下結成今經綱紀，中三：先法，次譬，三引無量義意以合譬。",
        "translation": "Next, under You should know, we'll summarize the outline of the present sūtra, which consists of three: first, the teaching; second, the metaphor; and third, the combined metaphor by citing the meaning of immeasurable.",
        "source": "T33n1717_019:0949c03_40"
    },
    {
        "source_sentence": "若無諸數將何以紀定？",
        "translation": "If there are no numbers, what will be the way to record them?",
        "source": "T33n1717_019:0949c05_41"
    },
    {
        "source_sentence": "若不紀定將何以結歸？",
        "translation": "If you don't record it, what will be the way to bind it back?",
        "source": "T33n1717_019:0949c05_42"
    },
    {
        "source_sentence": "若不結歸則佛意杳漫，若無諸數則化儀不周。",
        "translation": "If they don't form a knot, then the Buddha's mind is vacant, and if there are no numbers, then the rituals of transformation won't be complete.",
        "source": "T33n1717_019:0949c06_43"
    },
    {
        "source_sentence": "故開權顯實即彼所行是菩薩道，開迹顯本本迹雖殊不思議一。",
        "translation": "Therefore, revealing the right to reveal the real is the bodhisattva path that they practice, and revealing the traces shows that although the original and original traces are different, they're inconceivably one.",
        "source": "T33n1717_019:0949c07_44"
    },
    {
        "source_sentence": "三明佛意鑒機中二：先明鑒機來久，次「當知」下明佛意難測。",
        "translation": "Three, there are two ways to explain the Buddha's intention to discern the opportunity: first, he explains how long it's been possible to discern the opportunity, and second, you should know, he explains that the Buddha's intention is difficult to fathom.",
        "source": "T33n1717_019:0949c09_45"
    },
    {
        "source_sentence": "初文又二：初總述，次別指。",
        "translation": "The first text has two parts: the first is a general statement, and the second is a specific reference.",
        "source": "T33n1717_019:0949c10_46"
    },
    {
        "source_sentence": "初文言「法身地」等者，自本地真因初住已來，遠鑒今日乃至未來大小眾機，",
        "translation": "The first text says, Dharma body ground and so forth. It means that since the true cause of self-existence first abided, it's distantly mirrored today and will continue to mirror the capacities of large and small beings in the future.",
        "source": "T33n1717_019:0949c11_47"
    },
    {
        "source_sentence": "故云「本行菩薩道時所成壽命今猶未盡」，豈今日迹中草座木樹方鑒今日大小機耶？",
        "translation": "That's why it says, Now the life span accomplished at the time of the original practice of the bodhisattva path hasn't yet ended, so wouldn't today's traces of grass, seats, trees, and trees be a mirror for today's large and small abilities?",
        "source": "T33n1717_019:0949c13_0"
    },
    {
        "source_sentence": "次「文云」下別明鑒機，以今日之事驗久遠之智，一代始成四十餘年，",
        "translation": "Next, under Wenyun, we'll explain the opportunity to discern it separately, using today's events to examine the long-standing wisdom that for more than forty years have passed since the beginning of one generation.",
        "source": "T33n1717_019:0949c14_1"
    },
    {
        "source_sentence": "豈能令彼世界塵數菩薩萬億諸大聲聞便悟大道，現獲無生色聲之益略難稱紀，",
        "translation": "How could they cause the great disciples, hundreds of thousands of myriads of koṭis of bodhisattvas as numerous as atoms in that world, to awaken to the great path? They now attain the benefit of uncreated form and sound.",
        "source": "T33n1717_019:0949c16_2"
    },
    {
        "source_sentence": "故知今日逗會赴昔成熟之機，況若種若脫非言可盡？",
        "translation": "Therefore, it's known that today's tethering assembly goes to the opportunity of past maturation, so why wouldn't we say that what's planted and liberated can be exhausted?",
        "source": "T33n1717_019:0949c18_3"
    },
    {
        "source_sentence": "於中又二：初略明始終一期佛意，次「信解」下重牒信解領鑒證成。",
        "translation": "There are two more: the first briefly explains the meaning of the first stage of the Buddha's teaching, and the second, Under Faith and Understanding, he again explains that faith and understanding lead to the realization of discernment.",
        "source": "T33n1717_019:0949c19_4"
    },
    {
        "source_sentence": "初文又三：初明佛垂世本意，意雖知小而在大；",
        "translation": "The first is threefold. First, it explains the original purpose of the Buddha’s appearing in the world:",
        "source": "T33n1717_019:0949c21_5"
    },
    {
        "source_sentence": "次文云「殷勤」下明用小化本意，意雖知大而用小；",
        "translation": "Next, the text says, zealous. Under zealous, we'll explain the original idea of converting people with smallness, which is to say that even though they know the large, they use the small.",
        "source": "T33n1717_019:0949c22_6"
    },
    {
        "source_sentence": "三文云「諸佛」下明適機化儀佛意本暢，非始靈鷲其心泰然。",
        "translation": "The third text says, All the buddhas, and the following explains that the Buddha's mind is originally peaceful in terms of adapting to the teachings and rituals of the buddhas, not because his mind isn't calm like the first spiritual eagles.",
        "source": "T33n1717_019:0949c23_7"
    },
    {
        "source_sentence": "次信解文具足五時，初華嚴時大機未起，以佛遠鑒令見而復遙。",
        "translation": "Next, there are five times when the text of the Faithful Understanding is complete, and at the time of the first flower adornment, the great opportunity has yet to arise, so he uses the Buddha's distant mirror to make it visible and further away.",
        "source": "T33n1717_019:0949c25_8"
    },
    {
        "source_sentence": "次於窓牖中下知小機先熟，故遙而不捨，所以密遣將護大機，故體業領付其意在茲。",
        "translation": "Next, in the windows and windows, he knows that the smallest opportunity is first ripe, so he doesn't abandon it from a distance. That's why he secretly sends it to protect the great opportunity, so his essence and karma are entrusted with its meaning here.",
        "source": "T33n1717_019:0949c26_9"
    },
    {
        "source_sentence": "次「當知」下結，中二：先正結，次「文云」下引證。",
        "translation": "Next, under You should know, there are two: the first is a correct conclusion, and the second is to cite the proof under Wenyun.",
        "source": "T33n1717_019:0949c28_10"
    },
    {
        "source_sentence": "四明校量中二：先引〈法師品〉與一代校量，次「將說」下以疑請文與諸經校量。",
        "translation": "The fourth clarifies the method of calibrating in two ways: first, he cites the Dharma teacher's book and the method of calibrating it for one generation, and second, under about to explain, he doubts the text of the request and the method of calibrating the sūtras.",
        "source": "T33n1717_019:0949c29_11"
    },
    {
        "source_sentence": "初文可知。",
        "translation": "The first text can be understood.",
        "source": "T33n1717_019:0950a02_12"
    },
    {
        "source_sentence": "次文中二：先明與諸經一向異，次唯華嚴與法華經廣辨同異。",
        "translation": "The next text has two parts: first, it explains that they're always different from the sūtras, and second, only the Flower Ornament and the Lotus Sutra are extensively discussed as being the same.",
        "source": "T33n1717_019:0950a02_13"
    },
    {
        "source_sentence": "初文中「三止四請」者，〈方便品〉初佛止歎云：止舍利弗！",
        "translation": "In the first text, the phrase three stops and four requests means that the first part of the chapter on skillful means is to praise the Buddha's stopping, saying, Stop, Śāriputra!",
        "source": "T33n1717_019:0950a04_14"
    },
    {
        "source_sentence": "不須復說。",
        "translation": "It doesn't need to be explained again.",
        "source": "T33n1717_019:0950a05_15"
    },
    {
        "source_sentence": "次舍利弗騰眾心請；",
        "translation": "“Then the venerable Śāriputra greeted the bhikṣus and invited them.",
        "source": "T33n1717_019:0950a05_16"
    },
    {
        "source_sentence": "次佛止云：止止不須復說，恐驚疑故。",
        "translation": "Next, the Buddha stops and says, Stopping and stopping doesn't need to be explained again because he's afraid of doubt.",
        "source": "T33n1717_019:0950a06_17"
    },
    {
        "source_sentence": "二舍利弗騰宿根利，是故復請；",
        "translation": "The second was that Śāriputra had sharpened his faculties in the past; therefore he was again invited.",
        "source": "T33n1717_019:0950a07_18"
    },
    {
        "source_sentence": "三佛復止舍利弗護增上慢故。",
        "translation": "The three buddhas also stopped Śāriputra and guarded his overweening conceit.",
        "source": "T33n1717_019:0950a07_19"
    },
    {
        "source_sentence": "三舍利弗復騰宿慧益多，是故更請；",
        "translation": "Again, Śāriputra, the knowledge of past lives has increased greatly. For this reason he is invited again.",
        "source": "T33n1717_019:0950a08_20"
    },
    {
        "source_sentence": "四如來許說，四身子願聞。",
        "translation": "Fourth, the Tathāgata approves of what he teaches, and the four bodhisattvas wish to hear it.",
        "source": "T33n1717_019:0950a09_21"
    },
    {
        "source_sentence": "「亦無疑網」等者，餘經雖亦有請有止，不同此經三乘四眾天龍咸有疑請，",
        "translation": "The phrase also without web of doubt and so forth means that although the other sūtras also have requests and stops, unlike this sūtra, the three vehicles, four groups of gods, and dragons all have doubts and requests.",
        "source": "T33n1717_019:0950a10_0"
    },
    {
        "source_sentence": "致請為往、佛止為復，皆至於三，名為殷勤。",
        "translation": "The reason for inviting them is to go and the Buddha's stopping is to return, and they all reach three, which is called diligence.",
        "source": "T33n1717_019:0950a11_1"
    },
    {
        "source_sentence": "「說諸方等，觀文可知」者，且如說《方等陀羅尼》時，初敘雷音比丘為九十二億魔之所掩蔽，",
        "translation": "The phrase Explaining the directions and so forth, the contemplation text can be known means that when he taught the directions dhāraṇī, the first one described how the monk Thunderbolt was hindered by 9,200,000,000 Māras.",
        "source": "T33n1717_019:0950a12_2"
    },
    {
        "source_sentence": "華聚菩薩請佛救護，佛便許以摩訶袒持調伏彼魔，後說滅罪脩行方法。",
        "translation": "When the Flower Copse Bodhisattva asked the Buddha to rescue him, the Buddha agreed to subdue Māra with Mahāprajāpaṇḍa and then explained the method for extinguishing sins and cultivating practice.",
        "source": "T33n1717_019:0950a15_0"
    },
    {
        "source_sentence": "如說《淨名》，初因命問疾述昔被彈，文殊承旨，廣論因疾調伏慰喻，",
        "translation": "As in the Jingming jing (T.1:161b15–19) says: At first, Mañjuśrī ordered me to ask a question about my illness and told me how I had been beaten in the past.",
        "source": "T33n1717_019:0950a16_1"
    },
    {
        "source_sentence": "此等諸文由問疾生，已下諸文，次第而起，不云再請，何況至三？",
        "translation": "These texts arise from questions about illness, and the following texts are produced in order, not repeating requests, so why wouldn't there be three?",
        "source": "T33n1717_019:0950a18_2"
    },
    {
        "source_sentence": "「說大品時，猶酬梵請」者，如《大品》中，如來自敷師子之座，入王三昧，",
        "translation": "The phrase when he teaches the great teaching, he's just as if he were to repay the invitation of Brahmā refers to the fact that in the great teaching, the Tathāgata spreads out his lion seat and enters kingly concentration.",
        "source": "T33n1717_019:0950a19_3"
    },
    {
        "source_sentence": "身分次第放於六百萬億光明，放光明已，復入師子遊戲三昧，現神變已，",
        "translation": "In succession, six hundred myriads of koṭis of rays of light emanated from his bodies. Having emanated this light, he entered the lion’s play concentration and manifested a magical display.",
        "source": "T33n1717_019:0950a21_4"
    },
    {
        "source_sentence": "令無量人各各謂佛獨為我說，十方世界亦復如是。",
        "translation": "So that innumerable people will each claim that the Buddha alone taught them for me, and so it is with the worlds in the ten directions.",
        "source": "T33n1717_019:0950a23_5"
    },
    {
        "source_sentence": "此中無請，仍用梵王初通請竟，是故此說猶酬梵王。",
        "translation": "There's no invitation here, but it's still after the king of Brahmā uses the first general invitation. That's why this is said to be a reward for the king of Brahmā.",
        "source": "T33n1717_019:0950a24_6"
    },
    {
        "source_sentence": "所言「猶」者，佛初成道，梵王初請，請意既遠，鹿苑方等未稱梵心，",
        "translation": "The expression j ust refers to the fact that when the Buddha first achieved enlightenment, the Brahmā king invited him for the first time. Even though his intention was far-reaching, he didn't call it the Brahmā mind in Deer Park or elsewhere.",
        "source": "T33n1717_019:0950a25_7"
    },
    {
        "source_sentence": "故至般若尚酬初請。",
        "translation": "Therefore, up to the point where prajñā still rewards the first request.",
        "source": "T33n1717_019:0950a27_8"
    },
    {
        "source_sentence": "故知三請，唯獨法華，驗不虛矣。",
        "translation": "Therefore, we know that the three requests are unique to the Lotus Sutra and not false.",
        "source": "T33n1717_019:0950a27_9"
    },
    {
        "source_sentence": "次與《華嚴》對辨者，今一家意，豈欲貶於法界融通、普賢遍入、文殊彌勒妙用無邊耶？",
        "translation": "Next, it's a contrast with the Flower Ornament, which is what the present family thinks, so why wouldn't they want to disparage the interpenetration of the Dharma realm, Samantabhadra's pervasive entry, and Mañjuśrī's marvelous use of Maitreya without limit?",
        "source": "T33n1717_019:0950a28_10"
    },
    {
        "source_sentence": "但據彼部文猶帶行布，序首結集，自云始成，存行布故，仍未開權；",
        "translation": "However, according to the text of that school, it still carries practices and collections in it. The introduction concludes by saying that it is self-established; because it preserves practices and collections, it has not yet been entrusted with authority.",
        "source": "T33n1717_019:0950b01_11"
    },
    {
        "source_sentence": "言始成故，尚未發迹。",
        "translation": "It's because the words are first formed but haven't yet developed their traces.",
        "source": "T33n1717_019:0950b02_12"
    },
    {
        "source_sentence": "此之二義，文意之綱骨、教法之心髓，而彼部不開不拂，焉知化迹無優劣耶？",
        "translation": "These two meanings are the outline bones of text and meaning and the mind marrow of the teaching, but that school doesn't open or brush them, so how could it be known that there's no superiority or inferiority in the traces of transformation?",
        "source": "T33n1717_019:0950b03_13"
    },
    {
        "source_sentence": "圓理無殊，故今許云「可為連類」，斥人師不了，故復論之。",
        "translation": "The perfect principle is not different, so it's now allowed to be called a series. It's because the teacher who rejects people doesn't understand it and therefore discusses it again.",
        "source": "T33n1717_019:0950b05_14"
    },
    {
        "source_sentence": "於中為二：初總明同異，次別比決。",
        "translation": "The first is a general explanation of similarities and differences, and the second is a specification.",
        "source": "T33n1717_019:0950b06_15"
    },
    {
        "source_sentence": "初連類者，如《華嚴》中說十住時，有十慧菩薩，法慧為首；",
        "translation": "The first is of a sequential order: as the Flower Ornament explains the ten abodes, there are enlightening beings with ten kinds of knowledge, led by Dharma and wisdom.",
        "source": "T33n1717_019:0950b07_16"
    },
    {
        "source_sentence": "說十行時，有十林菩薩，功德林為首；",
        "translation": "When the ten practices were taught, there was a bodhisattva named Ten Groves, led by Forest of Virtue.",
        "source": "T33n1717_019:0950b08_17"
    },
    {
        "source_sentence": "說十向時，有十幢菩薩，金剛幢為首，並云承佛力說；",
        "translation": "When the ten dedications were taught, there were ten pennants of enlightening beings, led by Diamond Banner, all saying they had been taught by empowered by Buddha.",
        "source": "T33n1717_019:0950b09_18"
    },
    {
        "source_sentence": "至說十地時，有三十六菩薩，皆以藏為名，金剛藏為首、解脫月居末。",
        "translation": "When the ten stages were spoken of, thirty-six bodhisattvas all took the store as their names, with the Vajragarbha as the first and the moon of liberation as the last.",
        "source": "T33n1717_019:0950b10_19"
    },
    {
        "source_sentence": "是金剛藏入大智慧光明三昧，十方皆爾。",
        "translation": "This is the vajra store that enters the concentration of great wisdom and light, and so it is in all ten directions.",
        "source": "T33n1717_019:0950b12_20"
    },
    {
        "source_sentence": "從三昧起，告諸菩薩言廣大如法界等，次列十地名竟，云三世十方諸佛無有不說此十地者，",
        "translation": "After the names of the ten stages were listed, he said, There are no buddhas in the three times and ten directions who don't explain these ten stages.",
        "source": "T33n1717_019:0950b13_21"
    },
    {
        "source_sentence": "一切菩薩隨順佛說，作是說已默然而住，一切菩薩聞是語已渴仰欲聞，",
        "translation": "All the bodhisattvas listened to the Buddha’s discourse and, having uttered these words, remained silent. Having heard those words, all the bodhisattvas longed to hear them.",
        "source": "T33n1717_019:0950b15_22"
    },
    {
        "source_sentence": "各各念言何故金剛藏菩薩說十地名已默然而住？",
        "translation": "Each thought, Why did the Vajragarbha Bodhisattva explain the names of the ten stages after remaining silent?",
        "source": "T33n1717_019:0950b17_23"
    },
    {
        "source_sentence": "眾中有菩薩名解脫月，知眾心念，說五行偈請金剛藏，金剛藏復說六行偈止云，",
        "translation": "In the assembly, there was an enlightening being named Moon of Deliverance. Knowing the minds of the monks and nuns in the assembly, he prayed to Vajragarbha in five-line verses:",
        "source": "T33n1717_019:0950b18_24"
    },
    {
        "source_sentence": "眾生少信故我默然。",
        "translation": "Because sentient beings have little faith, I'm silent.",
        "source": "T33n1717_019:0950b20_25"
    },
    {
        "source_sentence": "解脫月復請云：大眾直心清淨善脩助道種諸善根(云云)。",
        "translation": "The moon of liberation also asked, The masses are straightforward, the mind is pure, and they skillfully cultivate the good roots that aid in the path (as it's said).",
        "source": "T33n1717_019:0950b21_26"
    },
    {
        "source_sentence": "金剛藏復止云：眾雖清淨不久行者，智慧未明了。",
        "translation": "The Vajragarbha again stopped, saying, Although the multitude is pure and soon to be practiced, their wisdom doesn't understand it.",
        "source": "T33n1717_019:0950b22_27"
    },
    {
        "source_sentence": "解脫月復請云：諸佛皆護念願說十地義，諸菩薩同聲偈請，諸佛放光照，",
        "translation": "The moon of liberation also invited them, saying, All the buddhas guard their thoughts and vows and explain the meaning of the ten stages.",
        "source": "T33n1717_019:0950b23_28"
    },
    {
        "source_sentence": "光中偈讚竟。",
        "translation": "After praising it in the light, he praises it in verse.",
        "source": "T33n1717_019:0950b25_29"
    },
    {
        "source_sentence": "金剛藏復稱歎十地義深妙難思謙退已，次方乃云承佛力說，復誡眾令諦聽恭敬。",
        "translation": "Vajragarbha then praised the profound, subtle, and difficult-to-understand meaning of the ten stages and withdrew, next, he said, Teach by the power of the Buddha, and again instructed the crowd to listen attentively and respectfully.",
        "source": "T33n1717_019:0950b25_30"
    },
    {
        "source_sentence": "又云：我之所說者如大海之一渧，次方廣說十地功德等。",
        "translation": "It's also said that what I teach is like a drop in the ocean, and it's further explained in detail about the merits of the ten stages.",
        "source": "T33n1717_019:0950b27_31"
    },
    {
        "source_sentence": "此乃三請兩止，猶闕《法華》一請一止，故云「連類」。",
        "translation": "These are the three requests and two stops, which are still missing from the Lotus, so it's called sequential.",
        "source": "T33n1717_019:0950b28_32"
    },
    {
        "source_sentence": "況《法華》所請獨顯本迹一實長遠耶？",
        "translation": "How could it be that the requested by the Lotus alone reveals the single reality of the original and derivative as a long distance?",
        "source": "T33n1717_019:0950c01_33"
    },
    {
        "source_sentence": "又連類者，但云止請、不云所說之法，法非連類，不可為儔。",
        "translation": "Furthermore, it's only called stopping requests and not the teachings that are taught, and the teachings aren't sequential, so they can't be disputed.",
        "source": "T33n1717_019:0950c01_34"
    },
    {
        "source_sentence": "而人師偏著，謂加於《法華》者，自古弘經論師不曉佛意，唯見《華嚴》事廣文長菩薩致請，",
        "translation": "Since ancient times, the theoriesers of the Mahayana scriptures and treatises did not understand the Buddha’s meaning. They merely saw only that the Flower Ornament was composed by Vasubandhusvara Bodhisattva in order to express his request.",
        "source": "T33n1717_019:0950c03_35"
    },
    {
        "source_sentence": "而謂《華嚴》加勝《法華》，近代已來讀山門教者，仍有此說。",
        "translation": "It's said that the Flower Ornament is superior to the Lotus, but there's still this explanation for those who read the teachings of the mountain school since the distant past.",
        "source": "T33n1717_019:0950c05_36"
    },
    {
        "source_sentence": "誤哉！",
        "translation": "That's wrong!",
        "source": "T33n1717_019:0950c06_37"
    },
    {
        "source_sentence": "誤哉！",
        "translation": "That's wrong!",
        "source": "T33n1717_019:0950c06_38"
    },
    {
        "source_sentence": "況以人師但以請主勝劣相形，不云法門觀智勝此，而近代匠者更以教體謂勝《法華》，",
        "translation": "It's even more so because the human teacher simply invites the superior and inferior form of the master, not saying that the contemplation of the Dharma teaching is superior to this one, whereas the modern maker calls it superior to the Lotus because of the essence of the teaching.",
        "source": "T33n1717_019:0950c06_39"
    },
    {
        "source_sentence": "豈非誤耶？",
        "translation": "Isn't that a mistake?",
        "source": "T33n1717_019:0950c09_0"
    },
    {
        "source_sentence": "總明同異竟。",
        "translation": "This is the end of the general explanation of similarities and differences.",
        "source": "T33n1717_019:0950c09_1"
    },
    {
        "source_sentence": "次「身子」下別比決，中三：初正此決，次「彼以」下明比決意，三「但此」下結歸本文疑多請倍之意。",
        "translation": "Next, under bodhisattva, there are three specific ways to compare, which are: first, correcting this decision; second, explaining the meaning of comparing it under those who use it; and third, summarizing the meaning of the text's doubt that many requests are doubled under but here.",
        "source": "T33n1717_019:0950c09_2"
    },
    {
        "source_sentence": "初文又二：初斥古師云法華請者唯小，次「又彌勒」下救《法華》不及菩薩疑請。",
        "translation": "The first text is further twofold: first, it rejects the ancient teacher's claim that the request for the Lotus is only small, and second, under Again, Maitreya, he saves the Lotus by saying that it's not as great as the bodhisattva's doubtful request.",
        "source": "T33n1717_019:0950c11_3"
    },
    {
        "source_sentence": "於中又二：先引齊，次「又本門」下明勝意。",
        "translation": "There are two more: first, he cites the same thing, and second, under Also from the original perspective, he explains the superior meaning.",
        "source": "T33n1717_019:0950c13_4"
    },
    {
        "source_sentence": "初云《法華》中彌勒求決於文殊，《華嚴》中解脫月請釋疑於金剛藏，",
        "translation": "First, it's said that Maitreya asked Mañjuśrī to resolve his doubts in the Lotus Sutra, and liberation moon asked him to explain the doubts in the Vajragarbha in the Flower Ornament Sutra.",
        "source": "T33n1717_019:0950c14_5"
    },
    {
        "source_sentence": "若據二處菩薩互為賓主，並是深位是則似齊，故云「若為有異」，二處會主雖即釋迦、舍那不同，",
        "translation": "If it's based on the fact that the bodhisattvas in two places are mutually exclusive, and they're both profound positions, then they seem to be the same. That's why it's called 'if there's a difference.' Although the two places where the host of the assembly is different from Śākyamuni and Śāna,",
        "source": "T33n1717_019:0950c15_6"
    },
    {
        "source_sentence": "但是衣纓少殊內身不別。",
        "translation": "It's just that the robes are slightly different, and the inside bodies aren't distinct.",
        "source": "T33n1717_019:0950c18_0"
    },
    {
        "source_sentence": "次文者，一往雖然，所請之法、所被機緣不無同異，華嚴兼別，法華純圓。",
        "translation": "The next text is that even though it's the same as the one-returner, the Dharma and the opportunity to be invited aren't the same or different, the Huayan is distinct, and the Fahua is purely perfect.",
        "source": "T33n1717_019:0950c18_1"
    },
    {
        "source_sentence": "又十方諸佛皆是舍那分身，而經中不說，亦是以權而覆於實，是故須此比決令勝。",
        "translation": "Also, the buddhas in the ten directions are all part of the Śāna body, but the sūtras don't say it, and they also cover the real with their authority; therefore, they must be judged to be superior by this comparison.",
        "source": "T33n1717_019:0950c20_2"
    },
    {
        "source_sentence": "於中又三：初總明請人說者所說法勝，次「若彼」下別明眷屬勝，三「又彼」下明化主勝。",
        "translation": "There are three more: first, a general explanation of the superiority of the teaching taught by someone who asks them to explain it; second, a specific explanation of the superiority of the followers under If they do so; and third, a further explanation of the superiority of the master of transformation under They.",
        "source": "T33n1717_019:0950c22_3"
    },
    {
        "source_sentence": "初文者，《法華》本門是佛說佛法，與《華嚴》中加於菩薩說菩薩法，",
        "translation": "The first is that the main aspect of the Lotus is the Buddha teaching the buddha-dharma, whereas the Flower Ornament teaches the bodhisattva-dharma in addition to the bodhisattva teachings.",
        "source": "T33n1717_019:0950c24_4"
    },
    {
        "source_sentence": "不無同異，如此優劣，佛旨難思。",
        "translation": "There is no similarity or dissimilarity. Such superiority and inferiority make the Buddha’s teaching inconceivable.",
        "source": "T33n1717_019:0950c25_5"
    },
    {
        "source_sentence": "故大師自云：若較其優劣，恐失佛旨，佛旨但在誘物契真，但能被教門不可一概。",
        "translation": "That's why the great teacher himself said, If we compare their superiority and inferiority, we're afraid to lose the Buddha's teaching, because the Buddha's teaching is only to tempt things to match reality, but it can be taught in a way that can't be summarized.",
        "source": "T33n1717_019:0950c26_6"
    },
    {
        "source_sentence": "所以復云：此法華經開權顯實、開迹顯本，如斯兩意永異餘經；",
        "translation": "That is why it is further stated: This Lotus Sutra discloses the right to reveal the real and the traces to reveal the source. These two meanings are absolutely different from those of other scriptures.",
        "source": "T33n1717_019:0950c28_7"
    },
    {
        "source_sentence": "請倍疑多復異諸教，故迹門三止四請，本門四請三誡。",
        "translation": "The request is double the doubt, and it's often different from the teachings; therefore, the three stopping and four requests in the aspect of the traces and the four requests in the original aspect are the three admonitions.",
        "source": "T33n1717_019:0950c29_8"
    },
    {
        "source_sentence": "次文中言「不無疎密」者，知識疎、發心密，知識可互相成益，發心則師位不移，",
        "translation": "The next phrase, not without pervasiveness means that knowledge is pervasive and the arousal of mind is pervasive, and knowledge can mutually benefit one another; when you arouse mind, the teacher's position doesn't change.",
        "source": "T33n1717_019:0951a02_9"
    },
    {
        "source_sentence": "故知知識之言，覆此發心之事，顯覆不等疎密何疑？",
        "translation": "Therefore, it's known that the words of knowledge cover these things that give rise to mind, so what doubt is there in revealing that they aren't equal and esoteric?",
        "source": "T33n1717_019:0951a03_10"
    },
    {
        "source_sentence": "第三意者，彼十方說法，法同人同被加者同，是則化主、眷屬並以一身無量身互為主伴同而不同，",
        "translation": "The third idea is that the doctrine taught in the ten directions is the same for those who are similar in doctrine, but different for those who are similar [in doctrine]. This means that the apparitional host and the members of his retinue all have one body with an infinite number of bodies as their mutual leaders, while the companions are the same and different.",
        "source": "T33n1717_019:0951a05_11"
    },
    {
        "source_sentence": "一身多身一多自在，而覆其分身之說，但云主伴相關。",
        "translation": "One body has many bodies, and one body is self-contained, but it's said to cover the partial body of that body, but it's only said to be associated with the main companion.",
        "source": "T33n1717_019:0951a07_12"
    },
    {
        "source_sentence": "設彼一身多身，但云法同名同，彼一華臺立一化主，華臺相去其量叵量，",
        "translation": "Suppose a body has many bodies in one body, but it's said that the same thing is called the same name for the same thing. One flower dais establishes one master of transformation, and the flower dais departs from each other, whose measure is immeasurable.",
        "source": "T33n1717_019:0951a08_13"
    },
    {
        "source_sentence": "今以八方土田滿中諸佛，凡集幾許華臺佛耶？",
        "translation": "Now, how many buddhas are there in the fields of the eight directions filled with buddhas?",
        "source": "T33n1717_019:0951a10_14"
    },
    {
        "source_sentence": "舉例而知塵數亦爾。",
        "translation": "By citing examples, he knows that the number of dust is likewise.",
        "source": "T33n1717_019:0951a11_15"
    },
    {
        "source_sentence": "比決意者，彼華嚴佛何殊法華，已如前說，餘並如文。",
        "translation": "What's the point of comparing it to the Huayan Buddha, what's the difference between the Lotus and the Dharma Flower, as explained above, and the rest are as explained in the text.",
        "source": "T33n1717_019:0951a11_16"
    },
    {
        "source_sentence": "及疏文中，廣以十義辨於同異。",
        "translation": "In the text of the commentary, we'll discuss similarities and differences in terms of ten meanings.",
        "source": "T33n1717_019:0951a13_17"
    },
    {
        "source_sentence": "三結歸，如文。",
        "translation": "The third is the conclusion, as explained in the text.",
        "source": "T33n1717_019:0951a13_18"
    },
    {
        "source_sentence": "二結勸。",
        "translation": "The second concludes with an exhortation.",
        "source": "T33n1717_019:0951a14_19"
    },
    {
        "source_sentence": "○次異解中二：先明三意通用，次明諸師不同。",
        "translation": "○ Next, there are two differences in the explanation: first, he explains that the three meanings are shared, and second, he explains that the teachers are different.",
        "source": "T33n1717_019:0951a15_0"
    },
    {
        "source_sentence": "初文者，頓、漸、不定名雖不殊，但明義不了，是故須破。",
        "translation": "The first is to explain that although the names of sudden, gradual, and indeterminate are not different, they don't understand the meaning; therefore, they must be refuted.",
        "source": "T33n1717_019:0951a16_1"
    },
    {
        "source_sentence": "初中言「南三北七」者，南謂南朝，即京江之南，北謂北朝，河北也。",
        "translation": "The first part of the teaching says, three in the south and seven in the north, because the south refers to the southern court, which is south of the capital and the north refers to the northern court, and the north is the northern court.",
        "source": "T33n1717_019:0951a17_2"
    },
    {
        "source_sentence": "自宋朝已來三論相承，其師非一並稟羅什，但年代淹久文疏零落，至齊朝已來玄綱殆絕，",
        "translation": "Since the Song dynasty, three treatises have been handed down from one to the next. Their teachers were not all present in Rāṣṭrapāla; but for a long time the texts and commentaries of these treatises have been lacking, and since the Qi dynasty the profound theories have almost disappeared.",
        "source": "T33n1717_019:0951a18_3"
    },
    {
        "source_sentence": "江南盛弘《成實》，河北偏尚《毘曇》，於時高麗朗公至齊建武來至江南，",
        "translation": "In the southern part of the Jiang River the Satyasiddhi Sastra was widely circulated, while in the northern part of the river the Mahavibhasamgraparinirmocana Sastra was partially preserved. At that time Emperor Lang of the Goryeo dynasty arrived at Jianwu and came to the southern part of the Jiang River.",
        "source": "T33n1717_019:0951a21_0"
    },
    {
        "source_sentence": "難成實師結舌無對，因茲朗公自弘三論。",
        "translation": "It was difficult for the true teacher to form a tongue and have no opponent, so it was because of this that Master Lang promoted the three treatises himself.",
        "source": "T33n1717_019:0951a22_1"
    },
    {
        "source_sentence": "至梁武帝勅十人止觀詮等，令學三論，九人但為兒戲，唯止觀詮習學成就。",
        "translation": "Emperor Wu of the Liang ordered ten men, including Zhiguan and others, to study the three treatises; nine were merely children's playthings but Zhiguan and others studied and mastered them.",
        "source": "T33n1717_019:0951a23_2"
    },
    {
        "source_sentence": "詮有學士四人入室，時人語曰「興皇伏虎朗，栖霞得意布，長干領語辯，",
        "translation": "At that time the people said, “Xinghuang subdued Hu Lang; Qixia concentrated his mind on propagating Buddhism. Chang Gan was in charge of eloquence.",
        "source": "T33n1717_019:0951a25_3"
    },
    {
        "source_sentence": "禪眾文章勇」，故知南宗初弘《成實》，後尚三論。",
        "translation": "That's why we know that the Southern School first promoted the Satyasiddhi-śāstra and still had three treatises after it.",
        "source": "T33n1717_019:0951a27_4"
    },
    {
        "source_sentence": "近代相傳以天台義指為南宗者，非也。",
        "translation": "It's not true that the modern tradition is to refer to the meaning of Tiantai as the southern school.",
        "source": "T33n1717_019:0951a28_5"
    },
    {
        "source_sentence": "自是山門一家相承，是故難則南北俱破，取則南北俱存。",
        "translation": "Since then, the mountain gates have been handed down by one family; therefore, if there is a difficulty, both south and north will be destroyed, and if it is grasped, both south and north will remain.",
        "source": "T33n1717_019:0951a29_6"
    },
    {
        "source_sentence": "今時言北宗者，謂俱舍、唯識，南方近代亦無偏弘，其中諸師所用義意，",
        "translation": "The northern theories are those of the Kuśinagara school and the consciousness-only school, but there is no partial dissemination in the southern countries.",
        "source": "T33n1717_019:0951b01_7"
    },
    {
        "source_sentence": "若憑三論則應判為南宗。",
        "translation": "If we rely on the three treatises, then we should judge it to be the southern school.",
        "source": "T33n1717_019:0951b03_8"
    },
    {
        "source_sentence": "若今師所用《毘曇》、《成實》及三論等大小諸經，隨義引用不偏南北。",
        "translation": "If the present teacher uses the large and small scriptures such as the Vedas, the Satyasiddhi Sastra, and the three treatises, he cites them according to their meaning without discriminating between south and north.",
        "source": "T33n1717_019:0951b03_9"
    },
    {
        "source_sentence": "若法相宗徒多依《大論》，觀門綱格正用《瓔絡》，融通諸法則依《大品》及諸部圓文，",
        "translation": "If the theories of the Dharma-character school mostly rely on the Mahāprajñāpāramitā, they correctly use the Diadem in order to contemplate aspects and outlines, while the teachings that unify are based on the Mahāprajñāpāramitā and the complete texts of other schools.",
        "source": "T33n1717_019:0951b05_10"
    },
    {
        "source_sentence": "故知今家不偏朋黨。",
        "translation": "Therefore, it's known that the present family isn't partial to their friends.",
        "source": "T33n1717_019:0951b07_11"
    },
    {
        "source_sentence": "護身寺自軌法師，大乘是人為立號，以重其所習，故美之稱為大乘。",
        "translation": "The Dharma Master Shuoshi of Body-protecting Monastery was a native of the Great Vehicle (Mahayana). Because he esteemed what he practiced, he praised it and called it the Mahayana.",
        "source": "T33n1717_019:0951b07_12"
    },
    {
        "source_sentence": "○三明難中，先難南三，次難北七。",
        "translation": "○In the three explanations of difficulty, first, there are three difficulties to the south, and then seven difficulties to the north.",
        "source": "T33n1717_019:0951b10_0"
    },
    {
        "source_sentence": "初南三中，先難五時，次「今更」下重難前文用三時義。",
        "translation": "In the first three south, he first objects to the five time periods, and then under Now it's over, he repeats the objection that the previous sentence uses the meaning of the three times.",
        "source": "T33n1717_019:0951b10_1"
    },
    {
        "source_sentence": "初文二，先難五時，次「五時之失」下結難。",
        "translation": "The first text is twofold: first, it's a difficulty about the five time periods, and then it concludes with a difficulty under What's wrong with the five time periods.",
        "source": "T33n1717_019:0951b12_2"
    },
    {
        "source_sentence": "初文正難用《涅槃》五味五時，又三：初難五時，次難共用頓等三教，",
        "translation": "The first text correctly objects that the five flavors of nirvāṇa are used at five times and five times, and there are three more: the first objections at five times; the second objections to the shared use of the three teachings of sudden and so forth.",
        "source": "T33n1717_019:0951b13_0"
    },
    {
        "source_sentence": "三難用涅槃五味。",
        "translation": "Three, it's difficult to use the five flavors of nirvāṇa.",
        "source": "T33n1717_019:0951b14_1"
    },
    {
        "source_sentence": "初文又二：初敘意，次正難。",
        "translation": "The first text has two parts: the first describes the meaning, and the second corrects the difficulty.",
        "source": "T33n1717_019:0951b15_0"
    },
    {
        "source_sentence": "初言「先難五時」者，以初二師立三四時，攝在五時中故。",
        "translation": "The first one says, First, there are five difficult moments because the first two masters establish three or four moments because they're included in the five moments.",
        "source": "T33n1717_019:0951b15_1"
    },
    {
        "source_sentence": "先總標意竟。",
        "translation": "First, we'll summarize the end of the idea.",
        "source": "T33n1717_019:0951b16_2"
    },
    {
        "source_sentence": "次「若言」下次第難其五時，即自為五文，初難十二年前有相教者，先牒其所立，",
        "translation": "Next, under If you say, it's a sequential objection to the five time periods, which are the five words for themselves. The first objection is that those who taught with characteristics twelve years ago first explain what they established,",
        "source": "T33n1717_019:0951b17_3"
    },
    {
        "source_sentence": "次難。",
        "translation": "The next difficulty.",
        "source": "T33n1717_019:0951b19_4"
    },
    {
        "source_sentence": "難中又四：初總難十二年前及以有相，次「又阿含」下單以空難，三「又成道」下難十二年前唯小，",
        "translation": "The first is a general objection about twelve years ago and the existence of characteristics, the second is a specific objection about emptiness under Again in the Āgamas, and the third is a specific objection about twelve years ago but only minor.",
        "source": "T33n1717_019:0951b19_5"
    },
    {
        "source_sentence": "四「復次」下以《成論》破意難。",
        "translation": "Fourth, under Furthermore, he uses the Chenglun to refute the difficulty of the meaning.",
        "source": "T33n1717_019:0951b21_6"
    },
    {
        "source_sentence": "初文中言「成論」等者，論屬十二年前，論文自明空義，論師判之為有相教，",
        "translation": "The first part of the text says accomplishment of the treatise because the treatise belongs twelve years ago, explaining the meaning of emptiness on its own, and the treatise master judges it to be a teaching that has characteristics.",
        "source": "T33n1717_019:0951b21_7"
    },
    {
        "source_sentence": "豈非以有加誣己宗為有相教。",
        "translation": "Isn't it because there's an addition that misrepresents one's own doctrine as a teaching with characteristics?",
        "source": "T33n1717_019:0951b23_8"
    },
    {
        "source_sentence": "次文者，《阿含》即是十二年前，及《大論》所指皆明空義，如何云有？",
        "translation": "The next text means that the Āgamas are twelve years ago, and they all explain the meaning of emptiness as cited in the Mahāprajñāpāramitā, so how can they be said to exist?",
        "source": "T33n1717_019:0951b24_9"
    },
    {
        "source_sentence": "言「是老死」等者，如《止觀》第六記。",
        "translation": "The phrase 'this is old age and death' and so forth refers to the sixth entry in the Zhiguan jing.",
        "source": "T33n1717_019:0951b26_0"
    },
    {
        "source_sentence": "次論所指云「三藏中明法空為大空」者，他云三藏通大小，何為但屬小？",
        "translation": "The next treatise refers to the statement that explains that the emptiness of dharmas in the three collections is great emptiness, but others say that the three collections are both large and small, so why do they only belong to the small?",
        "source": "T33n1717_019:0951b26_1"
    },
    {
        "source_sentence": "今明如《法華》云「貪著小乘三藏學者」。",
        "translation": "Now, it's clear that as the Fahua says, They cling to the three collections of lesser vehicle scholars.",
        "source": "T33n1717_019:0951b28_2"
    },
    {
        "source_sentence": "又《大論》中處處以三藏對衍而辨大小，故準此文以三藏為小。",
        "translation": "Also, the Mahāprajñāpāramitā uses the Tripiṭaka to contrast derivative and discern large and small with the Tripiṭaka, so according to this text, the Tripiṭaka is considered small.",
        "source": "T33n1717_019:0951b29_3"
    },
    {
        "source_sentence": "若論通者，小衍二門俱有三藏，自是通途非別意也。",
        "translation": "If we talk about penetration, the two approaches of lesser and derivative have both the three collections, which are themselves the path of penetration and not distinct meanings.",
        "source": "T33n1717_019:0951c01_4"
    },
    {
        "source_sentence": "若唯通途，如何銷通《法華》、《大論》，具如《四教》本中廣明。",
        "translation": "If it's only the shared path, how can we eliminate the shared Lotus and Mahāprajñāpāramitā? It's explained in detail in the text of the Four Teachings.",
        "source": "T33n1717_019:0951c03_5"
    },
    {
        "source_sentence": "故十二年前約顯露教，秖可通云三藏教耳。",
        "translation": "That's why twelve years ago, it was called the tripiṭaka teaching in terms of revealing the teaching, which can be generally called the tripiṭaka teaching.",
        "source": "T33n1717_019:0951c04_6"
    },
    {
        "source_sentence": "故不可云見有得道，若唯見有，妨於三門，是故文中且破存於計有之見。",
        "translation": "Therefore, it can't be said that someone who sees existence attains the path because if they only see existence, they'll obstruct the three approaches. That's why the text simply refutes the view that there's a conception of existence in order to preserve it.",
        "source": "T33n1717_019:0951c05_7"
    },
    {
        "source_sentence": "又三藏教，準不定教亦非獨在十二年前，如食檀耳是涅槃時，其事亦在四《阿含》內，",
        "translation": "Also, according to the teachings of the Tripiṭaka and the indeterminate teachings, it wasn't just twelve years old. Just as eating sandalwood ears is the time of nirvāṇa, these things are also found in the four Āgamas.",
        "source": "T33n1717_019:0951c07_8"
    },
    {
        "source_sentence": "迦留陀夷亦復如是。",
        "translation": "Kālôdayin is likewise.",
        "source": "T33n1717_019:0951c09_9"
    },
    {
        "source_sentence": "故顯露教十二年前定唯在小。",
        "translation": "Therefore, twelve years before the revealed teaching, it's definitely only in the lesser.",
        "source": "T33n1717_019:0951c09_10"
    },
    {
        "source_sentence": "三難唯小中二：初文引《央掘》仍是大乘明空，亦在十二年前。",
        "translation": "The first text quotes the Yogâcārabhūmi-śāstra, which still explains emptiness in the great vehicle and was twelve years old.",
        "source": "T33n1717_019:0951c10_11"
    },
    {
        "source_sentence": "次又如《大論》得道已後十二年中，亦說般若。",
        "translation": "Furthermore, as in the Mahāprajñāpāramitā, twelve years after he attained enlightenment, he also taught prajñā.",
        "source": "T33n1717_019:0951c11_12"
    },
    {
        "source_sentence": "四《成論》斥意難中三：初直以論師斥意難教成虛設。",
        "translation": "Fourth, there are three difficulties in the Chenglun's refutation of the objection: first, it's simply because the treatise master refutes the objection that the objection teaches to create a false hypothesis by refuting the objection.",
        "source": "T33n1717_019:0951c12_13"
    },
    {
        "source_sentence": "次「又拘隣」下以得道人難得道不無，則教成無相。",
        "translation": "Next, under Again, Kauṇḍinya, because it's difficult for someone who attains the path to attain the path and doesn't lack it, he teaches them to become markless.",
        "source": "T33n1717_019:0951c14_0"
    },
    {
        "source_sentence": "三「又若」下以得道與無相雙折。",
        "translation": "Third, under Furthermore, it's because the attainment of the path and marklessness are mutually contradictory.",
        "source": "T33n1717_019:0951c15_1"
    },
    {
        "source_sentence": "又為三：初難得道不得道教同無相及以邪說；",
        "translation": "Again, it is threefold: first, there is difficulty in attaining the path; second, absence of characteristics and false doctrine with regard to the doctrine that the path is the same as signlessness.",
        "source": "T33n1717_019:0951c15_2"
    },
    {
        "source_sentence": "次難得道仍存有相，道亦成外；",
        "translation": "The next difficult path is that which preserves characteristics, and the path also becomes what is external.",
        "source": "T33n1717_019:0951c17_3"
    },
    {
        "source_sentence": "三結成過相。",
        "translation": "Three, it concludes with the characteristic of forming faults.",
        "source": "T33n1717_019:0951c17_4"
    },
    {
        "source_sentence": "次難十二年後亦二，先牒所立以略非，次「若言」下廣破。",
        "translation": "The next difficulty is that there are also two twelve years later, which first explains what's established in order to briefly refute what's not established, and then it's explained in detail under If you say so.",
        "source": "T33n1717_019:0951c18_5"
    },
    {
        "source_sentence": "彼師以般若教為第二時，故般若無褒貶等。",
        "translation": "That teacher uses the teaching of prajñā as the second time, so prajñā doesn't praise and disparage it.",
        "source": "T33n1717_019:0951c19_6"
    },
    {
        "source_sentence": "所以約此而為難辭。",
        "translation": "That's why it's so difficult to explain in terms of this.",
        "source": "T33n1717_019:0951c20_7"
    },
    {
        "source_sentence": "於中為六：初難無相不成，次「若言」下難不明佛性，三「若言」下以般若無會三難，",
        "translation": "The first is the difficulty that marklessness isn't accomplished, the second is the difficulty that doesn't explain the buddha-nature under If you say anything, and the third is the difficulty that it's because prajñā has no assembly of the three difficulties under If you say anything.",
        "source": "T33n1717_019:0951c21_0"
    },
    {
        "source_sentence": "四「若言」下以般若無彈訶難，五「若言」下以般若是第二時教難，六以般若通十二年前難。",
        "translation": "Fourth, it's the difficulty of prajñā without blame under if he says, and fifth, it's the difficulty of prajñā under if he says this is the second time when he teaches, and sixth, it's the difficulty of prajñā that goes along with the difficulty of twelve years.",
        "source": "T33n1717_019:0951c22_1"
    },
    {
        "source_sentence": "初如文。",
        "translation": "The first is as explained in the text.",
        "source": "T33n1717_019:0951c25_0"
    },
    {
        "source_sentence": "次文又三：初單以正因佛性難，次「故知」下以三佛性難，三「若言無常」下以八十年不說佛性難。",
        "translation": "The next text is further divided into three: first, it's simply because of the difficulty of the buddha-nature of right cause alone; second, it's because of the difficulty of the buddha-nature under Therefore Knowing; and third, it's because of the difficulty of not explaining the buddha-nature for eighty years under If you say impermanent.",
        "source": "T33n1717_019:0951c25_1"
    },
    {
        "source_sentence": "初文又二：初以共不共般若難，次「大經」下以名義同難。",
        "translation": "The first text is twofold: first, it's because of the difficulty of shared and distinctive prajñāpāramitā, and second, under Mahāprajñāpāramitā, it's because of the same difficulty in name and meaning.",
        "source": "T33n1717_019:0951c27_2"
    },
    {
        "source_sentence": "又為四：初引五名中有佛性般若難，次彼師救，三「若爾」下重破，四「又涅槃」下重引文結同。",
        "translation": "There are four more: first, he cites the difficulty of the buddha-nature and prajñāpāramitā in the five names, second, his teacher saves them, third, he refutes it again under If so, and fourth, he concludes by citing the same text again under And nirvāṇa.",
        "source": "T33n1717_019:0951c28_3"
    },
    {
        "source_sentence": "初文云「佛性有五種名」，如《止觀》第三記，意仍少別。",
        "translation": "The first text says, The buddha-nature has five kinds of names, as recorded in the third entry in Zhiguan, but there's still a little distinction in meaning.",
        "source": "T33n1717_019:0952a01_4"
    },
    {
        "source_sentence": "次救云「涅槃自是三德中之般若，非無相」者，此過更甚：一者三德般若，",
        "translation": "The next rescue, saying, Nirvāṇa itself is prajñā among the three virtues, not without marks, is even more serious:",
        "source": "T33n1717_019:0952a02_5"
    },
    {
        "source_sentence": "猶有相過；",
        "translation": "They still have characteristics and faults.",
        "source": "T33n1717_019:0952a04_6"
    },
    {
        "source_sentence": "二者無相般若，非三德過，若非三德，即是無常，若是無常云何無相？",
        "translation": "The second is markless prajñā, which is not a fault of the three virtues. If it weren't for the three virtues, it would be impermanent, and if it were impermanent, how could it be markless?",
        "source": "T33n1717_019:0952a04_7"
    },
    {
        "source_sentence": "縱屬小乘，亦非十二年後般若，無相不成，況重破中還為《涅槃》所指，",
        "translation": "Even if it belongs to the lesser vehicle, it's not that twelve years from now prajñā without characteristics won't become a reality, so why wouldn't it be repeatedly refuted and still be referred to in the Nirvana?",
        "source": "T33n1717_019:0952a06_8"
    },
    {
        "source_sentence": "涅槃何殊般若耶？",
        "translation": "What's the difference between nirvāṇa and prajñā?",
        "source": "T33n1717_019:0952a08_0"
    },
    {
        "source_sentence": "況重立結同中涅槃佛性，與實際般若不殊。",
        "translation": "How could it be that the repeatedly established fetters are the same as the buddha-nature of nirvāṇa in the middle, which is not different from the actual prajñāpāramitā?",
        "source": "T33n1717_019:0952a08_1"
    },
    {
        "source_sentence": "次以三佛性難，中三：初更牒《涅槃》、《般若》所明實相法性為正因，",
        "translation": "The next is the difficulty of the three buddha-natures, of which there are three: first, it further explains that the true nature of dharmas as explained in Nirvāṇa and Prajñāpāramitā is the direct cause,",
        "source": "T33n1717_019:0952a09_2"
    },
    {
        "source_sentence": "對餘二性為三因。",
        "translation": "The other two natures are the three causes.",
        "source": "T33n1717_019:0952a11_0"
    },
    {
        "source_sentence": "次重引《金剛論》，證般若為了因佛性。",
        "translation": "Next, he repeats the Jingang lun, which proves that prajñā is fully the cause of buddha-nature.",
        "source": "T33n1717_019:0952a11_1"
    },
    {
        "source_sentence": "三「但名異」下舉譬結難。",
        "translation": "Third, under simply called dissimilar, he cites an analogy to conclude the difficulty.",
        "source": "T33n1717_019:0952a12_2"
    },
    {
        "source_sentence": "三以八十年佛難，中二：先牒所計，次難。",
        "translation": "The third is the difficulty of the eighty-year Buddha, which consists of two parts: first, an explanation of what's imagined, and second, a difficulty.",
        "source": "T33n1717_019:0952a12_3"
    },
    {
        "source_sentence": "難中又三：初以八十年佛亦說常難，次引《大論》秖是一身而分生法難，",
        "translation": "Of the difficulties, there are three more: first, because the Buddha of Eighty- Years also explains the eternal difficulty; second, he cites the Mahāprajñāpāramitā-sūtra to show that it's a single body but separately produced dharmas.",
        "source": "T33n1717_019:0952a13_4"
    },
    {
        "source_sentence": "三以小況並難。",
        "translation": "Third, it's because the lesser and the greater are at odds with each other.",
        "source": "T33n1717_019:0952a15_5"
    },
    {
        "source_sentence": "初言「云云」者，涅槃八十既說常，般若八十豈不說？",
        "translation": "The first thing he says, so it is, is that since the eighty nirvāṇas are said to be eternal, aren't the eighty prajñāpāramitās said to be?",
        "source": "T33n1717_019:0952a15_6"
    },
    {
        "source_sentence": "般若八十若不說，涅槃八十安得說？",
        "translation": "If the eighty precepts of prajñā aren't explained, how can the eighty nirvāṇas be explained?",
        "source": "T33n1717_019:0952a17_7"
    },
    {
        "source_sentence": "廣並(云云)。",
        "translation": "It's extensive (as it says).",
        "source": "T33n1717_019:0952a17_8"
    },
    {
        "source_sentence": "次引《大論》又二：先分二身，次二身合。",
        "translation": "Next, there are two further quotes from the Mahāprajñāpāramitā: first, he divides the two bodies into two bodies, and second, he combines the two bodies.",
        "source": "T33n1717_019:0952a18_9"
    },
    {
        "source_sentence": "初文者，般若之中既為諸菩薩，當知化主必非生死，若非生死即是常住，",
        "translation": "The first part of the teaching is that since it's for bodhisattvas in prajñā, you should know that the master of transformation mustn't be born and die, and if he isn't born and die, then he's always abiding.",
        "source": "T33n1717_019:0952a19_10"
    },
    {
        "source_sentence": "若是常住明常灼然。",
        "translation": "If it's always abiding, then the light is always shining brightly.",
        "source": "T33n1717_019:0952a20_11"
    },
    {
        "source_sentence": "所言「佛有生法二身」者，如《大品》中華積世界普明菩薩欲來此土，",
        "translation": "The expression buddhas have the two bodies of arising and dharmas refers to the fact that, according to the Mahāprajñāpāramitā-sūtra, the bodhisattva Samantabhadra wanted to come to this land from China.",
        "source": "T33n1717_019:0952a21_12"
    },
    {
        "source_sentence": "彼佛命其問訊釋迦少病少惱等。",
        "translation": "The Buddha ordered him to inquire into the Śākyamuni's lack of illness and lack of affliction.",
        "source": "T33n1717_019:0952a22_13"
    },
    {
        "source_sentence": "論問云：何故諸佛問訊而言病惱？",
        "translation": "The treatise asks, Why do the buddhas say illness and affliction in greetings?",
        "source": "T33n1717_019:0952a23_14"
    },
    {
        "source_sentence": "論答云：佛有生法二身故，生身有寒熱乃至九惱，法身無病，故問生身不問法身。",
        "translation": "The treatise answers, It's because the Buddha has two bodies of arising and dharmas that he produces a body with cold and heat or even nine afflictions, and the Dharma body has no illness; therefore, he asks about the arising body and doesn't ask about the Dharma body.",
        "source": "T33n1717_019:0952a24_15"
    },
    {
        "source_sentence": "次「釋論」下明二身合者，教分二身為機劣故，豈以為劣機故暫現無常，",
        "translation": "Next, under explanation of the treatise, it's explained that the two bodies are combined because the teaching is divided into two bodies because their capacities are weak, so isn't it because they lack capacity that they temporarily become impermanent?",
        "source": "T33n1717_019:0952a26_16"
    },
    {
        "source_sentence": "即以無常加誣法性令無常耶？",
        "translation": "Is is it because of impermanence that they misrepresent the Dharma nature and make it impermanent?",
        "source": "T33n1717_019:0952a28_17"
    },
    {
        "source_sentence": "三舉小為況者，「均提沙彌」緣出《大論》，如《止觀》第四記。",
        "translation": "The third thing that cites the lesser as an example is that Kukkuṭika-śrāmaṇer refers to the Mahāprajñāpāramitā, as recorded in the fourth entry of the Zhiguan jing.",
        "source": "T33n1717_019:0952a29_0"
    },
    {
        "source_sentence": "彼小乘言「不滅」者，以無作之業至未來世名為不滅，非常住不滅，且引不滅破彼無常。",
        "translation": "The lesser vehicle says that it doesn't cease because unconstructed karma will be called not ceasing in future lives, which are neither eternally abiding nor ceasing, and by citing the fact that they don't cease to refute their impermanence.",
        "source": "T33n1717_019:0952b01_1"
    },
    {
        "source_sentence": "三般若無會三難者，其實般若未會其人，今且以會法而為難者，彼亦不曉會法不會人故。",
        "translation": "The three prajñāpāramitās don't have the three difficulties, because in fact, the Prajñāpāramitā hasn't yet met those people, and now let's make it a difficulty by meeting the teaching, because they don't understand the teaching and don't meet people.",
        "source": "T33n1717_019:0952b03_2"
    },
    {
        "source_sentence": "又為二：別汎引天子發心，天子雖非二乘，然發菩提即當會義；",
        "translation": "Also, there are two kinds: the general exhortation of celestial beings. Although celestial beings are not adherents of the two vehicles, they nevertheless give rise to enlightenment, which is the meaning of future assembly.",
        "source": "T33n1717_019:0952b05_3"
    },
    {
        "source_sentence": "次引聲聞發心正明會義。",
        "translation": "The next quote from the śrāvaka's arousal of mind correctly explains the meaning of the assembly.",
        "source": "T33n1717_019:0952b07_4"
    },
    {
        "source_sentence": "又為二：初引經，次「若聲聞」下釋。",
        "translation": "There are two more: the first cites the sūtras, and the second explains it under Suppose a śrāvaka.",
        "source": "T33n1717_019:0952b07_5"
    },
    {
        "source_sentence": "初文中云「與生死作障隔」者，滅智灰身永斷生死，若其發心大悲利物，",
        "translation": "The first sentence says, Being hindered by birth and death means to cease the body of wisdom and ashes and permanently end birth and death. If someone arouses the mind with great compassion for the benefit of things,",
        "source": "T33n1717_019:0952b08_6"
    },
    {
        "source_sentence": "應處生死與物結緣，若種若脫而成熟之，是故二乘已斷生死，永與生死作障隔故，",
        "translation": "It should be the case that birth-and-death is conditioned by the fetters of things, and whether planted or liberated, it matures them. Therefore, the two vehicles have already abandoned birth-and-death, because they are permanently separated from birth-and-death as obstacles.",
        "source": "T33n1717_019:0952b10_7"
    },
    {
        "source_sentence": "不能復入生死益物。",
        "translation": "They can't again enter birth and death to benefit things.",
        "source": "T33n1717_019:0952b12_8"
    },
    {
        "source_sentence": "「若發三菩提心者，我亦隨喜」者，折挫小行令發大心，於權教中雖云敗種，",
        "translation": "If someone gives rise to the three aspirations for enlightenment, I'll also follow them. The phrase refutes minor practices so that they give rise to great aspirations, even though it's called defeating seeds in the right teaching,",
        "source": "T33n1717_019:0952b12_9"
    },
    {
        "source_sentence": "佛以實理而發動之，假使能發菩提心者，我亦隨喜。",
        "translation": "If someone were to give rise to the mind of enlightenment, I would delight in them as well.",
        "source": "T33n1717_019:0952b14_10"
    },
    {
        "source_sentence": "四難無褒貶，中四：初引斥智，次「又十三」下引斥教，三「又云」下以引失教旨難，",
        "translation": "The first is to criticize cognition, the second is to criticize the doctrine under another thirteen, and the third is to criticize the doctrine by citing the difficulty of losing its essence under another teaching.",
        "source": "T33n1717_019:0952b15_11"
    },
    {
        "source_sentence": "四「豈有」下結。",
        "translation": "Fourth, it's concluded under How could there be?",
        "source": "T33n1717_019:0952b17_12"
    },
    {
        "source_sentence": "次文言「不從大家求食」等者，經云「汝是上人應求上法，不應自鄙唯居下位，",
        "translation": "The next text says, Don't seek food from the crowd of people. The sūtra says, You're an upper person who should seek the higher Dharma; you shouldn't despise yourself and only live in a lower place.",
        "source": "T33n1717_019:0952b17_13"
    },
    {
        "source_sentence": "不應如彼攀附枝葉，狗狎作務」等。",
        "translation": "They shouldn't be like those who cling to branches and leaves, or dogs and geese doing their duties.",
        "source": "T33n1717_019:0952b19_14"
    },
    {
        "source_sentence": "三引失教旨中言「見象」等者，立小乘教本期於大，住小亡大斯為不黠。",
        "translation": "The three quotes that say seeing elephants in the essence of the teaching and so forth establishes that the lesser-vehicle teaching is originally intended for the greater, and abiding in the lesser and losing the greater is not clever.",
        "source": "T33n1717_019:0952b20_15"
    },
    {
        "source_sentence": "四結如文。",
        "translation": "The fourth concludes as explained in the text.",
        "source": "T33n1717_019:0952b22_16"
    },
    {
        "source_sentence": "五難是第二時，中二：初引諸經，次「經經」下結難。",
        "translation": "The five difficulties are the second time, of which there are two: first, he cites the sūtras, and then he concludes with a difficulty under sutras and sūtras.",
        "source": "T33n1717_019:0952b22_17"
    },
    {
        "source_sentence": "六難十二年後有無相，如文。",
        "translation": "Sixth, it's difficult to say that twelve years from now there will be marklessness, as explained in the text.",
        "source": "T33n1717_019:0952b23_18"
    },
    {
        "source_sentence": "次難第三時者，彼以方等為第三時教，故須約褒貶等難。",
        "translation": "“The next difficulty is the third moment”: Because directions and so on are taken as the third moment of the doctrine, it is necessary to refer to such difficulties as praise and blame.",
        "source": "T33n1717_019:0952b24_19"
    },
    {
        "source_sentence": "於中為二：初牒所計，次「今問」下正難。",
        "translation": "There are two of these: first, an explanation of what's being posited, and second, a correct objection under Now, he asks.",
        "source": "T33n1717_019:0952b25_20"
    },
    {
        "source_sentence": "初如文。",
        "translation": "The first is as explained in the text.",
        "source": "T33n1717_019:0952b26_21"
    },
    {
        "source_sentence": "次為四：初難方等不應在般若之後，次「又彌勒」下難被彈不應獨在聲聞，",
        "translation": "Next, there are four: the first difficulty is that equanimity shouldn't be after prajñā, and the second difficulty under furthermore Maitreya shouldn't be limited to śrāvakas who aren't alone in being disciplined,",
        "source": "T33n1717_019:0952b26_22"
    },
    {
        "source_sentence": "三「若言」下難不應以七百之壽用判方等，四以三佛性難同涅槃常住。",
        "translation": "Third, it's difficult to say that the three buddha-natures are not the same as nirvāṇa in terms of their longevity and eternal abiding.",
        "source": "T33n1717_019:0952b28_23"
    },
    {
        "source_sentence": "初二如文。",
        "translation": "The first two are as explained in the text.",
        "source": "T33n1717_019:0952c01_24"
    },
    {
        "source_sentence": "第三中又三：初難，次「文辨」下再辨，三「又云」下引證常身。",
        "translation": "In the third, there are three more: the first is a difficulty, the second is to explain it again under文辨, and the third is to cite the realization of the eternal body under又云.",
        "source": "T33n1717_019:0952c01_25"
    },
    {
        "source_sentence": "初文中云「七百阿僧祇」者，《楞嚴》七百及《淨名》、《金剛》二經俱是第三時教，",
        "translation": "The first text says 700 incalculable eons because the Laṅkṣāntivāda-sūtra's 700 and the two scriptures Jñānaprasthāna and Jingang are both the third time teaching.",
        "source": "T33n1717_019:0952c02_26"
    },
    {
        "source_sentence": "何故不取《金剛》為正？",
        "translation": "Why isn't the Diamond Sutra taken as correct?",
        "source": "T33n1717_019:0952c04_27"
    },
    {
        "source_sentence": "而人師苦以七百判為無常，若七百無常，《金剛》豈常？",
        "translation": "But the human teacher's suffering is judged to be impermanent by 700 judgments, and if 700 are impermanent, how could the Diamond Sutra be permanent?",
        "source": "T33n1717_019:0952c05_0"
    },
    {
        "source_sentence": "方等金剛若無常者，涅槃金剛何必是常？",
        "translation": "If the vaipulya adamantine were impermanent, how could the nirvāṇa adamantine be permanent?",
        "source": "T33n1717_019:0952c06_1"
    },
    {
        "source_sentence": "涅槃無常，佛性何在？",
        "translation": "Nirvāṇa is impermanent, so where is the buddha-nature?",
        "source": "T33n1717_019:0952c07_2"
    },
    {
        "source_sentence": "言「何疾何惱」者，《乳光經》中「佛在毘耶離音樂樹下眾會說法，佛少中風當用牛乳，",
        "translation": "The expression what's sick and what's painful refers to the fact that in the Sutra of Milk Light, it says, The Buddha was teaching at the assembly under Vaiśālī's music tree, and when the Buddha had little medium wind, he would use cow milk.",
        "source": "T33n1717_019:0952c07_3"
    },
    {
        "source_sentence": "時城中有梵志，名摩耶利，五百弟子，為國大長者，不信佛法，不知布施，",
        "translation": "At the time, there was a priest named Māyalya in the city with five hundred disciples who were great wealthy householders of the country. They did not believe in the buddha-dharma and did not know how to make donations.",
        "source": "T33n1717_019:0952c09_4"
    },
    {
        "source_sentence": "羅覆宅庭，不令鳥侵，所居之處去佛不遠。",
        "translation": "Rāhula covered the mansion and didn't allow birds to attack it, and his dwelling place wasn't far from the Buddha.",
        "source": "T33n1717_019:0952c11_5"
    },
    {
        "source_sentence": "佛告阿難：汝持我名至梵志所，索乳[豸*童]來。",
        "translation": "The Buddha told Ānanda, Take my name to the priest and bring it to him.",
        "source": "T33n1717_019:0952c12_6"
    },
    {
        "source_sentence": "阿難受教而往，持鉢門下立。",
        "translation": "Ānanda, having received the instruction, departed. He stood at the foot of the bowl-holder’s door.",
        "source": "T33n1717_019:0952c13_7"
    },
    {
        "source_sentence": "時梵志欲入王宮，因見阿難，問曰：何故晨朝持鉢住此？",
        "translation": "When the priest wanted to enter the king's palace, he saw Ānanda and asked, Why are you staying here in the morning with your bowl?",
        "source": "T33n1717_019:0952c13_8"
    },
    {
        "source_sentence": "阿難具以佛意答梵志。",
        "translation": "Ānanda answered the priest in terms of the Buddha's intention.",
        "source": "T33n1717_019:0952c15_9"
    },
    {
        "source_sentence": "梵志默然思惟：若不與乳，諸人咸謂我慳；",
        "translation": "The brahmin remained silent and thought: If you do not give me milk, everyone will accuse me of being stingy.",
        "source": "T33n1717_019:0952c15_10"
    },
    {
        "source_sentence": "若與乳者，諸梵志謂我事瞿曇道。",
        "translation": "If you give milk, the priests say that I serve Gautama.",
        "source": "T33n1717_019:0952c16_11"
    },
    {
        "source_sentence": "復思惟已，即授弊牛，令阿難自[穀-禾+牛]，欲令弊牛觸殺阿難，",
        "translation": "“Then, having thought about this, he gave the cow to Ānanda and told him to let her touch [the cow].",
        "source": "T33n1717_019:0952c17_12"
    },
    {
        "source_sentence": "折辱瞿曇。",
        "translation": "He humiliated Gautama.",
        "source": "T33n1717_019:0952c18_13"
    },
    {
        "source_sentence": "如謀而行。",
        "translation": "He acts according to his plan.",
        "source": "T33n1717_019:0952c19_14"
    },
    {
        "source_sentence": "梵志五百弟子皆笑云：瞿曇常自言能度生老病死，今者自病須乳。」",
        "translation": "The five hundred disciples of the priest laughed, saying, Gautama always says he can save himself from birth, old age, illness, and death, but now he's sick and needs milk for his own sake.",
        "source": "T33n1717_019:0952c19_15"
    },
    {
        "source_sentence": "時維摩詰訶辭問答空聲等，具如《淨名》，仍廣於經。",
        "translation": "Vimalakīrti then asked questions and answered the sounds of emptiness and so forth, as described in the Pure Names, which are found elsewhere in the sūtras.",
        "source": "T33n1717_019:0952c20_16"
    },
    {
        "source_sentence": "「時五百弟子，聞空中聲，即無狐疑，皆悉歡喜，發無上心。",
        "translation": "When the five hundred disciples heard the sound in the air, they had no doubts and all rejoiced, arousing the unsurpassed aspiration.",
        "source": "T33n1717_019:0952c22_17"
    },
    {
        "source_sentence": "時梵志內外眷屬，及聚落中無數千人，皆隨阿難往看[穀-禾+牛]牛。",
        "translation": "The priest's inner and outer retinues, as well as countless thousands of people in the villages, all followed Ānanda to see [grass - grain + cow] the cow.",
        "source": "T33n1717_019:0952c23_18"
    },
    {
        "source_sentence": "阿難至牛傍，自念我師法，不自[穀-禾+牛]乳。",
        "translation": "Ānanda came to the cow’s side and thought of my teacher, who taught him the Dharma. He did not store milk for himself.",
        "source": "T33n1717_019:0952c24_19"
    },
    {
        "source_sentence": "言竟，忉利天座，為之大動，從天下來，化為小梵志，往牛傍。",
        "translation": "When he finished speaking, the Trāyastriṃśa goddess’ seat moved greatly for his sake. She came down from heaven and transformed herself into a minor brahmin, going to the herd beside the ox.",
        "source": "T33n1717_019:0952c25_20"
    },
    {
        "source_sentence": "阿難見之歡喜，請取乳。",
        "translation": "Seeing this, Ānanda was delighted and invited him to fetch the milk.",
        "source": "T33n1717_019:0952c27_21"
    },
    {
        "source_sentence": "即答阿難：我非梵志，是帝釋耳。",
        "translation": "He then answered Ānanda, I'm not a priest; it's Indra.",
        "source": "T33n1717_019:0952c27_22"
    },
    {
        "source_sentence": "聞世尊須乳，故來至此。",
        "translation": "I've heard that the Bhagavān needed milk, so he came here.",
        "source": "T33n1717_019:0952c28_23"
    },
    {
        "source_sentence": "阿難言：何能近此醒穢耶？",
        "translation": "Ānanda said, How can you approach this awakening defilement?",
        "source": "T33n1717_019:0952c29_24"
    },
    {
        "source_sentence": "答言：我之何如佛世尊耶？",
        "translation": "Answer: What's self like the Bhagavān?",
        "source": "T33n1717_019:0952c29_25"
    },
    {
        "source_sentence": "欲為取乳。",
        "translation": "He wanted to take the milk for him.",
        "source": "T33n1717_019:0953a01_26"
    },
    {
        "source_sentence": "唯願知時。",
        "translation": "I only wish to know the time.",
        "source": "T33n1717_019:0953a01_27"
    },
    {
        "source_sentence": "帝釋諾，即持器至牛傍，牛便靜住。",
        "translation": "Śākyamuni then took the container to the cow's side, and the cow stayed quietly.",
        "source": "T33n1717_019:0953a01_28"
    },
    {
        "source_sentence": "觀者驚怪：小梵志有何緣來，為之[穀-禾+牛]乳，儻為弊牛觸死，",
        "translation": "The observers were startled and wondered, “Through what reason did the young brahmin come here to milk [grass-grass+cow]?",
        "source": "T33n1717_019:0953a02_29"
    },
    {
        "source_sentence": "當奈何耶？",
        "translation": "What's the future?",
        "source": "T33n1717_019:0953a04_0"
    },
    {
        "source_sentence": "帝釋說偈言：今佛小中風，與乳作乳種，令佛服之差，得福無有量，佛尊天人師，",
        "translation": "Śakra, lord of the gods, spoke these verses: The Buddha now has a light and medium wind. He mixes milk with milk to make milk seeds that will cause the Buddha to drink differently. Through this he obtains immeasurable merit.",
        "source": "T33n1717_019:0953a04_1"
    },
    {
        "source_sentence": "常慈心憂念，蜎飛蠕動類，皆欲令度脫。",
        "translation": "They are always compassionate and grieved, like birds flying and wriggling, all wanting to be liberated.",
        "source": "T33n1717_019:0953a06_2"
    },
    {
        "source_sentence": "爾時犢母說偈云：此手捫摸我，一切快乃爾，取我兩乳[豸*童]，置於後餘者，",
        "translation": "It was then that the Vātsīputrīya touched me with his hand and said in verse:",
        "source": "T33n1717_019:0953a07_3"
    },
    {
        "source_sentence": "當持遺我子，朝來未得食，雖知有多福，作意當平等。",
        "translation": "You should carry the legacy of my son, who came in the morning and didn't get food, even though he knows there's much merit, and his contemplation will be equal.",
        "source": "T33n1717_019:0953a08_4"
    },
    {
        "source_sentence": "於是犢子為母說偈云：我從無數劫，今得聞佛聲，即言持我分，盡用奉上佛，",
        "translation": "The Vātsīputrīya then spoke these verses to his mother: For innumerable kalpas I have now heard the voice of the Buddha.",
        "source": "T33n1717_019:0953a10_5"
    },
    {
        "source_sentence": "世尊一切師，甚難得再見，我食草飲水，自可足今日。",
        "translation": "Bhagavān, it's very difficult to see all the teachers again; I eat grass and drink water, which is sufficient today.",
        "source": "T33n1717_019:0953a12_6"
    },
    {
        "source_sentence": "更有五偈云云。",
        "translation": "There are five other verses that say.",
        "source": "T33n1717_019:0953a13_7"
    },
    {
        "source_sentence": "於是阿難滿[穀-禾+牛]乳去，梵志及親邑人見此稱歎，信解佛法得法眼淨。",
        "translation": "Ānanda then filled [grass - grain + cow] with milk and departed, and when the priests and their relatives saw this praise, they believed in the Buddha's teaching and attained purity of the Dharma eye.",
        "source": "T33n1717_019:0953a13_8"
    },
    {
        "source_sentence": "阿難至世尊所具述之。",
        "translation": "Ānanda went to the Bhagavān and described it in detail.",
        "source": "T33n1717_019:0953a15_9"
    },
    {
        "source_sentence": "佛言：如是。",
        "translation": "The Buddha said, So it is.",
        "source": "T33n1717_019:0953a15_10"
    },
    {
        "source_sentence": "此牛過去曾為長者，喜出息，償錢畢復抵觸他人，坐此墮畜生。",
        "translation": "In the past, this cow used to be an elderly man who was delighted to exert his influence. After paying the money he returned to someone else and sat down here in the animal kingdom.",
        "source": "T33n1717_019:0953a16_11"
    },
    {
        "source_sentence": "今罪已畢。",
        "translation": "Now that the offense has been done, he'll be punished.",
        "source": "T33n1717_019:0953a17_12"
    },
    {
        "source_sentence": "放口光授記：從此却後命終，七反生兜率天及梵天，復七反生人間豪家。",
        "translation": "He emitted a bright light from his mouth and predicted, From here, he was reborn seven times at the end of his life, seven times in Tuṣita Heaven and Brahmā Heaven, and again seven times in the noble family of humans.",
        "source": "T33n1717_019:0953a17_13"
    },
    {
        "source_sentence": "牛母見彌勒成阿羅漢，犢子上下二十劫竟作佛號乳光。」",
        "translation": "The mother of the cow saw Maitreya become an arhat, and the calf went up and down for 20 eons to become a buddha named Dairy Light.",
        "source": "T33n1717_019:0953a19_14"
    },
    {
        "source_sentence": "當知世尊無疾無惱，為度人故現身有疾，為度眾生現行斯事。",
        "translation": "You should know that the Bhagavān has no illness and no affliction, manifesting his body with illness in order to save people and performing these things in order to save sentient beings.",
        "source": "T33n1717_019:0953a21_0"
    },
    {
        "source_sentence": "故淨名安慰阿難云：但為佛出五濁惡世，為眾生故現行斯法。",
        "translation": "That's why Jīvaka comforted Ānanda, saying, It's only for the sake of the Buddha that he emerges from the five turbid bad worlds and presents this teaching for the sake of sentient beings.",
        "source": "T33n1717_019:0953a22_1"
    },
    {
        "source_sentence": "二三如文。",
        "translation": "The second and third are as explained in the text.",
        "source": "T33n1717_019:0953a24_2"
    },
    {
        "source_sentence": "第四文又三：初引經題總具三脫即三佛性難，次引下文具三脫三佛性難，",
        "translation": "The fourth text is further divided into three: the first quote from the sūtra title summarizes the difficulty of the three liberations, which are the three buddha-natures, and the next quote from the following passage explains the difficulty of the three liberations and three buddha-natures.",
        "source": "T33n1717_019:0953a24_3"
    },
    {
        "source_sentence": "三「三義」下結難。",
        "translation": "Third, under three meanings, he concludes with a difficulty.",
        "source": "T33n1717_019:0953a26_4"
    },
    {
        "source_sentence": "次難第四時為法華同歸教者，又二：初牒文總斥，次「法華」下別難。",
        "translation": "The next difficulty is that the fourth time is for the teaching of the same refuge as the Lotus, which is twofold: first, it explains the general rejection of the text and second, it's a specific difficulty under Lotus.",
        "source": "T33n1717_019:0953a26_5"
    },
    {
        "source_sentence": "別難又為二：初略舉《法華》明常辨性，次「華嚴」下別引並難。",
        "translation": "The specific difficulty is further divided into two: first, he briefly cites the Lotus Sutra to explain the eternal nature of discernment, and second, under Huayan, he separately cites the parallel difficulty.",
        "source": "T33n1717_019:0953a28_6"
    },
    {
        "source_sentence": "初文云「命章」者，「命」字口令也，謂教也；",
        "translation": "The first part of the sentence says chapter on life because the word life is a verbal command, which means to teach.",
        "source": "T33n1717_019:0953a29_7"
    },
    {
        "source_sentence": "即命召也，謂章初也。",
        "translation": "That's the first chapter of the order, which is called.",
        "source": "T33n1717_019:0953b01_8"
    },
    {
        "source_sentence": "次文又三：初引明常文，次引佛性文，三破神通。",
        "translation": "The next sentence has three parts: the first introduces the text that explains the eternal, the second introduces the text on the buddha-nature, and the third refutes the supernormal powers.",
        "source": "T33n1717_019:0953b01_9"
    },
    {
        "source_sentence": "初文又五：初以《華嚴》為並難，彼許《華嚴》亦明常住，故將為並；",
        "translation": "The first is fivefold: first, it is difficult to identify the Flower Ornament with parallels.",
        "source": "T33n1717_019:0953b02_10"
    },
    {
        "source_sentence": "次「又無量義」下以序文驗為難；",
        "translation": "Next, under Further Immeasurable Meaning, he makes the introduction and explanation of the text difficult by examining it.",
        "source": "T33n1717_019:0953b04_11"
    },
    {
        "source_sentence": "三「若言」下以勅語多少為難；",
        "translation": "Third, under If you say something, it's difficult to define the number of words that are commanded.",
        "source": "T33n1717_019:0953b05_12"
    },
    {
        "source_sentence": "四引今文；",
        "translation": "The fourth quotes the present text.",
        "source": "T33n1717_019:0953b05_13"
    },
    {
        "source_sentence": "五「法華論」下引三身為難。",
        "translation": "Five, under Fahua lun, he cites the difficulty of the three bodies.",
        "source": "T33n1717_019:0953b06_14"
    },
    {
        "source_sentence": "初文又二：先以迹門並難，次「又華嚴」下以本門並難。",
        "translation": "The first text is further divided into two: first, it's difficult to combine the approach of traces with objections, and second, under Furthermore, Huayan, it's difficult to combine the original approach with objections.",
        "source": "T33n1717_019:0953b06_15"
    },
    {
        "source_sentence": "初文言「菩薩智慧如爪上土」者，《大經》三十二云：「爾時世尊取大地土置爪甲上，",
        "translation": "The first phrase, bodhisattva's wisdom is like the soil on his nails, is found in the thirty-two parts of the Mahāprajñāpāramitā-sūtra, which say, At the time, the Bhagavān took the earth and placed it on top of his nails and armor.",
        "source": "T33n1717_019:0953b07_16"
    },
    {
        "source_sentence": "問迦葉言，是土多耶？",
        "translation": "He asked Kāśyapa, Is this the land多?",
        "source": "T33n1717_019:0953b09_17"
    },
    {
        "source_sentence": "十方世界地土多耶？",
        "translation": "Are there many lands in the worlds of the ten directions?",
        "source": "T33n1717_019:0953b10_18"
    },
    {
        "source_sentence": "迦葉答言：爪上土者不比十方所有土也。」",
        "translation": "Kāśyapa answered, The soil on my nails isn't like the soil that exists in the ten directions.",
        "source": "T33n1717_019:0953b10_19"
    },
    {
        "source_sentence": "經文本譬捨於人身得人身少，今借以譬菩薩智者如爪土等，華嚴甚深但為今序。",
        "translation": "The sūtras and texts metaphorically rely on the fact that they abandon human bodies and attain little human body, but now we'll use it to metaphorically describe the bodhisattva's wisdom as being like clay or so forth, which is the present introduction of the profound flower adornment.",
        "source": "T33n1717_019:0953b11_20"
    },
    {
        "source_sentence": "第二第三如文。",
        "translation": "The second and third are as explained in the text.",
        "source": "T33n1717_019:0953b13_21"
    },
    {
        "source_sentence": "第四文者，引文三身壽命為難。",
        "translation": "The fourth text refers to the three bodies and life spans as difficulties in the text.",
        "source": "T33n1717_019:0953b14_22"
    },
    {
        "source_sentence": "第五文者，若不明常豈明三佛？",
        "translation": "The fifth text means that if they don't understand permanence, how can they explain the three buddhas?",
        "source": "T33n1717_019:0953b14_23"
    },
    {
        "source_sentence": "次明三佛性又五：初引〈不輕〉文，次引《法華論》文，三引《涅槃》遙指，",
        "translation": "Next, we'll explain the three buddha-natures in five ways: first, by citing the text of Not Despising; second, by citing the text of the Lotus Sutra; and third, by citing the distant points of reference of the Nirvana Sutra.",
        "source": "T33n1717_019:0953b15_24"
    },
    {
        "source_sentence": "四引《涅槃》同明一乘，五汎舉《涅槃》猶劣。",
        "translation": "The fourth quote from the Nirvāṇa-sūtra explains the same thing as the One Vehicle, but the five general statements of nirvāṇa are still inferior.",
        "source": "T33n1717_019:0953b17_25"
    },
    {
        "source_sentence": "初二如文，第三文言「八千聲聞得授記別」者，如《止觀》第七記。",
        "translation": "The first two are as explained in the text, and the third text says 8,000 śrāvakas attain distinctions in their predictions, as recorded in the seventh entry of Zhiguan.",
        "source": "T33n1717_019:0953b18_26"
    },
    {
        "source_sentence": "第四同明一乘中言「畢竟」者，經云：「畢竟有二種，一者莊嚴畢竟，",
        "translation": "The fourth is the same as the one-vehicle teaching that says ultimate because the sūtras say, There are two kinds of ultimate:",
        "source": "T33n1717_019:0953b19_27"
    },
    {
        "source_sentence": "二者畢竟畢竟。",
        "translation": "The second is the ultimate and final.",
        "source": "T33n1717_019:0953b21_28"
    },
    {
        "source_sentence": "又有二種，一者世間，二出世間。",
        "translation": "Again, there are two kinds: first, mundane and second, supramundane.",
        "source": "T33n1717_019:0953b21_29"
    },
    {
        "source_sentence": "莊嚴畢竟謂六波羅蜜，畢竟畢竟謂一切眾生悉是一乘。",
        "translation": "The ultimate adornment refers to the six perfections, and the ultimate means that all sentient beings are all one vehicle.",
        "source": "T33n1717_019:0953b22_30"
    },
    {
        "source_sentence": "一乘者名為佛性，是故我說一切眾生悉有佛性，悉有一乘。」",
        "translation": "The One Vehicle is called buddha-nature; therefore, I say that all sentient beings have buddha-nature, and they all have one vehicle.",
        "source": "T33n1717_019:0953b23_31"
    },
    {
        "source_sentence": "第五如文。",
        "translation": "The fifth is as explained in the text.",
        "source": "T33n1717_019:0953b24_32"
    },
    {
        "source_sentence": "三破神通者又二：初略舉身土不滅，驗非神通，次正破神通義，如第二卷，",
        "translation": "The third refutes supernormal powers in two ways: first, by briefly citing the fact that the body and land do not perish, ascertaining what is not supernormal; second, by correctly refuting the meaning of supernormal powers, as in the second fascicle.",
        "source": "T33n1717_019:0953b25_33"
    },
    {
        "source_sentence": "故著「云云」。",
        "translation": "That's why it says, Yun Yun Yun.",
        "source": "T33n1717_019:0953b26_34"
    },
    {
        "source_sentence": "次破第五時中又二：初牒，次難。",
        "translation": "Next, there are two ways to refute the fifth time: first, it's an explanation, and second is a difficulty.",
        "source": "T33n1717_019:0953b27_35"
    },
    {
        "source_sentence": "又二：初以二諦為難，次「眾生佛性」下例難。",
        "translation": "There are two more: first, the difficulty of using the two truths as objections, and second, the difficulty of example under sentient beings' buddha-nature.",
        "source": "T33n1717_019:0953b27_36"
    },
    {
        "source_sentence": "初言欲破第五，先難成論師二諦判教。",
        "translation": "The first one says that they want to refute the fifth, which first explains the difficulty in accomplishing the treatise master's explanation of the two truths.",
        "source": "T33n1717_019:0953b28_37"
    },
    {
        "source_sentence": "古人雖云二諦，而不分共別含顯之異，故將常住以例諸教，諸教並是十二年後所明二諦，",
        "translation": "Although the ancients said that there are two truths, they do not distinguish separately and distinctly. Therefore, they will always abide in order to exemplify the teachings. The teachings all explain the two truths twelve years from now.",
        "source": "T33n1717_019:0953b29_38"
    },
    {
        "source_sentence": "與十二年前二諦何別？",
        "translation": "What's the difference between them from the twelve years ago and the two truths?",
        "source": "T33n1717_019:0953c03_39"
    },
    {
        "source_sentence": "若言無別，自涅槃已前、法華已來，應俱無常；",
        "translation": "If you claim that there is no distinction, then after nirvana and after the Lotus Sutra should both be impermanent.",
        "source": "T33n1717_019:0953c03_40"
    },
    {
        "source_sentence": "若其別者，那同名二諦？",
        "translation": "If they are distinct, then how can they be called the same as the two truths?",
        "source": "T33n1717_019:0953c04_41"
    },
    {
        "source_sentence": "次例難者，二諦既同，應俱明佛性，並云云。",
        "translation": "The next difficulty is that since the two truths are the same, they should both explain the buddha-nature, and it's also said.",
        "source": "T33n1717_019:0953c05_42"
    },
    {
        "source_sentence": "二諦既同，應俱明闡提作佛，並云云。",
        "translation": "Since the two truths are the same, they should both explain that icchantika becomes a buddha, and so forth.",
        "source": "T33n1717_019:0953c06_43"
    },
    {
        "source_sentence": "已難漸中五時。",
        "translation": "It's already difficult to gradually follow the five time periods in the middle.",
        "source": "T33n1717_019:0953c07_44"
    },
    {
        "source_sentence": "次難頓等三教。",
        "translation": "The next is the three teachings of difficulty and suddenness.",
        "source": "T33n1717_019:0953c07_45"
    },
    {
        "source_sentence": "初難頓者又二：先以同難，次「權雖」下以別難。",
        "translation": "The first difficulty that's sudden is twofold: first, it's because of the same difficulty; second, it's because of the specific difficulty under Although Right.",
        "source": "T33n1717_019:0953c08_46"
    },
    {
        "source_sentence": "華嚴至法華來，無不有頓，何獨華嚴得稱頓耶？",
        "translation": "When the Flower Ornament arrives at the Lotus, there's nothing that doesn't have suddenness, so why would the Flower Ornament alone be called sudden?",
        "source": "T33n1717_019:0953c09_47"
    },
    {
        "source_sentence": "次明別難中以權別故，故有諸部不同者，權是事法，不應從權異邊而分頓與非頓。",
        "translation": "Next, it's explained that there are distinctive difficulties because of the distinction between right and wrong, so there are different divisions. Right is a thing or dharma, which shouldn't be divided into sudden and non- sudden from the perspective of right and wrong.",
        "source": "T33n1717_019:0953c10_48"
    },
    {
        "source_sentence": "次難不定者為三：初總舉諸經，次別引《央掘》列眾明常，三以《淨名》為並。",
        "translation": "The next difficulty that's indeterminate is threefold: the first summarizes the sūtras, the second separately cites the Yogâcārabhūmi-śāstra to list the various explanations of permanence, and the third uses the Jñānaprasthāna as a parallel.",
        "source": "T33n1717_019:0953c12_49"
    },
    {
        "source_sentence": "次文言「央掘列眾」者，彼經初云：「爾時世尊，與無量菩薩摩訶薩，",
        "translation": "The next text says, Aṅgulikāyika, because the first part of the sūtra says, At that point, Bhagavān, together with measureless bodhisattvas and mahāsattvas,",
        "source": "T33n1717_019:0953c14_50"
    },
    {
        "source_sentence": "及四眾天龍八部，毘舍遮、富單那等，日月天子及護世等，皆云無量。」",
        "translation": "It's also called immeasurable when it comes to the four groups of gods, dragons, the eight divisions, Vaiśravaṇa, Pūrṇa, and so forth, the sun, moon, celestial beings, world protectors, and so forth.",
        "source": "T33n1717_019:0953c15_51"
    },
    {
        "source_sentence": "始從鹿苑，方等般若，法華涅槃，經初列眾，皆有聲聞菩薩雜眾，央掘亦爾。",
        "translation": "At the beginning of the sutra, in the Deer Preserve, he recited the Prajñāpāramitā and the Lotus Sutra. The Buddha entered nirvana at that time. At the beginning of the sutra there was a large congregation of śrāvakas and bodhisattvas, all of whom were mixed together likewise with the assembled people of Yangkuṭa.",
        "source": "T33n1717_019:0953c17_52"
    },
    {
        "source_sentence": "仍云無量，故云委悉。",
        "translation": "It's still called immeasurable, so it's called entrusted.",
        "source": "T33n1717_019:0953c19_53"
    },
    {
        "source_sentence": "「彈斥明常」者，如彼《央掘》偈云：「云何名為一？",
        "translation": "The phrase rejecting clarity as eternal refers to the verse in the Yogâcārabhūmi-śāstra, What's called one?",
        "source": "T33n1717_019:0953c19_54"
    },
    {
        "source_sentence": "謂一切眾生，皆以如來藏，畢竟恒安住。",
        "translation": "It means that all sentient beings use the treasury of the Tathāgata to ultimately always abide in peace.",
        "source": "T33n1717_019:0953c20_55"
    },
    {
        "source_sentence": "云何名為二？",
        "translation": "What are they called two?",
        "source": "T33n1717_019:0953c21_56"
    },
    {
        "source_sentence": "所謂名與色，此是聲聞宗，斯非摩訶衍。",
        "translation": "The so-called names and forms are śrāvaka doctrines, not Mahāyāna.",
        "source": "T33n1717_019:0953c21_57"
    },
    {
        "source_sentence": "云何名為四？",
        "translation": "What are these four?",
        "source": "T33n1717_019:0953c22_58"
    },
    {
        "source_sentence": "所謂四聖諦」，是則聲聞宗，斯非摩訶衍。",
        "translation": "The so-called four noble truths are the śrāvaka doctrine, which is not Mahāyāna.",
        "source": "T33n1717_019:0953c23_0"
    },
    {
        "source_sentence": "一切諸如來，第一畢竟常，是則大乘諦，非苦是真諦。",
        "translation": "All tathāgatas are the first and ultimately permanent, which is the great vehicle truth, and what's not painful is the true truth.",
        "source": "T33n1717_019:0953c23_1"
    },
    {
        "source_sentence": "「云何名為五？",
        "translation": "What are the five?",
        "source": "T33n1717_019:0953c25_2"
    },
    {
        "source_sentence": "所謂彼五根，是則聲聞宗，斯非摩訶衍，所謂彼眼根，於諸如來常」等，",
        "translation": "The so-called five faculties are the śrāvaka doctrine, not Mahāyāna, which says that those eye faculties are permanent in the Tathāgatas and so forth.",
        "source": "T33n1717_019:0953c25_3"
    },
    {
        "source_sentence": "具如《止觀》第七卷引，乃至增十亦復如是。",
        "translation": "It's exactly as quoted in the seventh volume of the Cessation and Contemplation, and so is the increase by ten.",
        "source": "T33n1717_019:0953c27_0"
    },
    {
        "source_sentence": "如是等文，彈訶聲聞明於常住，最為顯著，餘如彼經。",
        "translation": "Such texts as these criticize śrāvakas and explain that the eternally abiding is the most prominent, while the rest are like those in the sūtras.",
        "source": "T33n1717_019:0953c27_1"
    },
    {
        "source_sentence": "又如《無垢施女經》「阿闍世王有女名無垢施，於晨朝時著玉屣踞父殿坐。",
        "translation": "It's also like the Sutra of the Immaculate Giving to women, which says, King Ajātaśatru had a woman named Immaculate Giving who sat in his father's palace wearing a jade sandal in the morning.",
        "source": "T33n1717_019:0953c29_2"
    },
    {
        "source_sentence": "爾時舍利弗與八大聲聞、文殊師利等八大菩薩，入城乞食，各先作念。",
        "translation": "It was then that Śāriputra and the eight great śrāvakas, Mañjuśrī and other eight great bodhisattvas entered the city to solicit alms, each first thinking.",
        "source": "T33n1717_019:0954a02_0"
    },
    {
        "source_sentence": "舍利弗念言：我當入如是定已，願舍衛城中一切眾生聞四聖諦法。",
        "translation": "Śāriputra thought, After I enter such a concentration, may all sentient beings in Śrāvastī hear the teaching of the four noble truths.",
        "source": "T33n1717_019:0954a03_1"
    },
    {
        "source_sentence": "目連念言：願令城中一切眾生無有魔事。",
        "translation": "Maudgalyāyana thought, May all the sentient beings in the city have no demonic activity.",
        "source": "T33n1717_019:0954a05_2"
    },
    {
        "source_sentence": "如是十六人各作念已次第到城，入無垢施女門，詣其乞食，皆被此女如其心念種種彈訶。",
        "translation": "After each of these sixteen men had this thought, they each went to the city in order, entered the undefiled maidens' gates, and begged for food. They were all reprimanded according to their thoughts by the woman.",
        "source": "T33n1717_019:0954a06_3"
    },
    {
        "source_sentence": "此十六人還佛所述已。",
        "translation": "These sixteen people returned to what the Buddha had told them.",
        "source": "T33n1717_019:0954a08_4"
    },
    {
        "source_sentence": "佛記是女等(云云)。」",
        "translation": "The Buddha remembers that these are women and so forth (as it says).",
        "source": "T33n1717_019:0954a08_5"
    },
    {
        "source_sentence": "三文者為三：初以同有彈訶為並，次「又淨名」下以訶在昔與《央掘》同為難，",
        "translation": "The three texts are threefold: first, it's a combination of the same thing as being criticized and reprimanded; second, under Again, Jīvaka, it's a difficulty to say that the reprimanding was the same as the Yogâcārabhūmi in the past.",
        "source": "T33n1717_019:0954a09_6"
    },
    {
        "source_sentence": "三「若謂」下以明常被緣為難。",
        "translation": "Third, under If it's said, it's difficult to explain that permanence is contingent on conditions.",
        "source": "T33n1717_019:0954a11_7"
    },
    {
        "source_sentence": "三難用涅槃五味中二：先敘其非，次別明難。",
        "translation": "Of the three difficulties in using the five flavors of nirvāṇa, there are two: first, he describes what's wrong and second, he explains the difficulty separately.",
        "source": "T33n1717_019:0954a11_8"
    },
    {
        "source_sentence": "難中又二：初總斥非，次「何者」下釋。",
        "translation": "There are two more difficulties: the first generally rejects what's not, and the second explains under What is it?",
        "source": "T33n1717_019:0954a12_9"
    },
    {
        "source_sentence": "釋中自五。",
        "translation": "There are five in the explanation.",
        "source": "T33n1717_019:0954a13_10"
    },
    {
        "source_sentence": "初難從牛出乳為十二部，中三：初以非初說及無十二部為難，次「救云」下彼救，",
        "translation": "The first difficulty is that milk comes out of the cow as twelve parts, which are threefold: first, it's not because the first teaching and the absence of twelve parts are difficult; second, it's to rescue them under salvation.",
        "source": "T33n1717_019:0954a14_0"
    },
    {
        "source_sentence": "三「今問」下縱難。",
        "translation": "Third, under Now, he asks a question, he explains the difficulty.",
        "source": "T33n1717_019:0954a15_1"
    },
    {
        "source_sentence": "初如文。",
        "translation": "The first is as explained in the text.",
        "source": "T33n1717_019:0954a16_2"
    },
    {
        "source_sentence": "次文言「彼救云小乘亦有十二部」至「異耳」者，《大經》二十五云：「雪山有草名曰忍辱，",
        "translation": "The next text says, That's why it's said that there are twelve divisions of the lesser vehicle up to different ears, as stated in the twenty-fifth section of the Mahāprajñāpāramitā sūtra, There's a blade of grass on the snowy mountain called forbearance.",
        "source": "T33n1717_019:0954a16_3"
    },
    {
        "source_sentence": "牛若食者即出醍醐。",
        "translation": "If a cow eats it, that's when the ghee comes out.",
        "source": "T33n1717_019:0954a18_4"
    },
    {
        "source_sentence": "更有異草，牛若食者則無醍醐，雖無醍醐，不可說言雪山之中無忍辱草。",
        "translation": "There's another strange kind of grass, and if a cow eats it, there's no ghee, even though there's no ghee, it can't be said that there's no bearable grass in the snowy mountains.",
        "source": "T33n1717_019:0954a18_5"
    },
    {
        "source_sentence": "佛性亦爾。",
        "translation": "So is the buddha-nature.",
        "source": "T33n1717_019:0954a20_6"
    },
    {
        "source_sentence": "山喻如來，忍辱草者喻大涅槃，異草者喻十二部經。",
        "translation": "The mountain is a metaphor for the Tathāgata, the patience grass is a metaphor for the great nirvāṇa, and the strange grass is a metaphor for the twelve kinds of scriptures.",
        "source": "T33n1717_019:0954a20_7"
    },
    {
        "source_sentence": "若有能聽大般涅槃則見佛性，十二部中雖不聞有，不可說言無佛性也。」",
        "translation": "If someone can hear the great parinirvāṇa, then they'll see the buddha-nature, and even though they haven't heard it in twelve divisions, they can't say there's no buddha-nature.",
        "source": "T33n1717_019:0954a22_8"
    },
    {
        "source_sentence": "既云十二部中無有佛性，即是無佛性之十二部也。",
        "translation": "Since it's said that there's no buddha-nature in the twelve divisions, these are the twelve divisions without buddha-nature.",
        "source": "T33n1717_019:0954a23_9"
    },
    {
        "source_sentence": "忍辱草者，既喻佛性，佛性亦不出於十二部。",
        "translation": "The grass of forbearance is a metaphor for the buddha-nature, and the buddha-nature doesn't go beyond the twelve parts.",
        "source": "T33n1717_019:0954a25_10"
    },
    {
        "source_sentence": "彼師依經救云，大小乘俱有十二部也。",
        "translation": "That teacher relies on the sūtras to rescue them, saying that there are twelve divisions in both the greater and lesser vehicles.",
        "source": "T33n1717_019:0954a26_11"
    },
    {
        "source_sentence": "今意從別，且存大乘佛性十二部也；",
        "translation": "The present meaning follows from the distinction, preserving the twelve divisions of the buddha-nature of the Mahayana.",
        "source": "T33n1717_019:0954a27_12"
    },
    {
        "source_sentence": "無佛性者且對九部。",
        "translation": "The absence of buddha-nature refers to the nine divisions.",
        "source": "T33n1717_019:0954a27_13"
    },
    {
        "source_sentence": "三縱難中二：先直縱難何為不用有佛性之十二部，次引第七中判其墮罪。",
        "translation": "The three difficulties are twofold: first, there's the direct difficulty of not using the twelve divisions that have buddha-nature, and then he cites the seventh section to judge their falling into sin.",
        "source": "T33n1717_019:0954a28_14"
    },
    {
        "source_sentence": "次難第二時又四：初牒計，次「脩多羅」下明難，三「解云」下彼救，",
        "translation": "The second time of the second difficulty is further divided into four: first, it's an explanation of calculation; second, it's an explanation of the difficulty under sūtra; third, it's an explanation of the rescue under understanding and so forth.",
        "source": "T33n1717_019:0954b01_15"
    },
    {
        "source_sentence": "四「若言」下重破。",
        "translation": "Fourth, it's repeatedly refuted under If you say so.",
        "source": "T33n1717_019:0954b02_16"
    },
    {
        "source_sentence": "破中又三：初以譬喻等例破，次「般若」下以餘經例般若直說為難，三「若言」下破第二時。",
        "translation": "There are three ways to refute it: first, by using examples like metaphors and so forth, second, under Prajñāpāramitā, we'll use the examples of other sūtras to explain prajñā directly as a difficulty, and third, under If you say anything, we'll refute the second time.",
        "source": "T33n1717_019:0954b02_17"
    },
    {
        "source_sentence": "次破第三時又二：先牒計，次「淨名」下指前文破。",
        "translation": "Next, there are two ways to refute the third time: first, he explains the calculation, and second, under pure names, he refers to the previous section to refute it.",
        "source": "T33n1717_019:0954b05_0"
    },
    {
        "source_sentence": "次破第四時又二：先牒計，次正破。",
        "translation": "Next, there are two ways to refute the fourth time: first, he explains the calculation, and second, he correctly refutes it.",
        "source": "T33n1717_019:0954b06_1"
    },
    {
        "source_sentence": "破又二：先破迴文，次引《涅槃》破其謬立。",
        "translation": "There are two further refutations: first, he refutes the repetition of the text and second, he cites the Nirvana to refute its mistaken establishment.",
        "source": "T33n1717_019:0954b06_2"
    },
    {
        "source_sentence": "次難第五時，亦先牒計，次正破。",
        "translation": "At the fifth time of the next difficulty, he also first explains the calculation and then correctly refutes it.",
        "source": "T33n1717_019:0954b07_3"
    },
    {
        "source_sentence": "譬云「佷[仁-二+戾]」者，兩字本為一義，謂諍競不順，今隨語便，",
        "translation": "The metaphor of anger [仁-二+戾] means that the two words originally meant one thing, which is to say that arguments and disputes aren't compliant, but now following language makes it possible.",
        "source": "T33n1717_019:0954b08_4"
    },
    {
        "source_sentence": "故分字釋。",
        "translation": "That's why it's divided into words and explanations.",
        "source": "T33n1717_019:0954b09_5"
    },
    {
        "source_sentence": "結及更難用四三二時，可見。",
        "translation": "The four, three, and two moments are visible when the fetters and other difficulties are combined.",
        "source": "T33n1717_019:0954b10_6"
    },
    {
        "source_sentence": "次難北地中自為七文。",
        "translation": "The next difficulty is that there are seven texts in the northern land.",
        "source": "T33n1717_019:0954b10_7"
    },
    {
        "source_sentence": "初難五時中但難初時，次餘四同上。",
        "translation": "In the first difficulty, there are five moments: only the first difficulty. The next and the other four are the same as above.",
        "source": "T33n1717_019:0954b11_8"
    },
    {
        "source_sentence": "初時為二：初牒計，次正難。",
        "translation": "The first time is divided into two: the first explains the calculation, and the second corrects the difficulty.",
        "source": "T33n1717_019:0954b12_9"
    },
    {
        "source_sentence": "難中又六：初單約戒善難，次「又彼經」下用彼經體難，三「又云五戒」下以五戒為諸行本難，",
        "translation": "The first is simply the difficulty of focusing on the goodness of the precepts, the second is the difficulty of using the essence of the sūtras under Furthermore, and the third is the difficulty of using the five precepts as the root of the practices under Also called the five precepts.",
        "source": "T33n1717_019:0954b12_10"
    },
    {
        "source_sentence": "四「又提謂」下以經中結得道眾難，五「復次」下以結集法藏次第難，",
        "translation": "Fourth, under Again, he explains the difficulties of the path that are found in the sūtras, and fifth, under Furthermore, he explains the difficulties of the sequential order of the collection of the teachings.",
        "source": "T33n1717_019:0954b15_11"
    },
    {
        "source_sentence": "六「若言」下以在初難一音。",
        "translation": "Sixth, under If you say it, it's because the first difficulty is a single sound.",
        "source": "T33n1717_019:0954b16_12"
    },
    {
        "source_sentence": "初文又二：先直難，次縱難。",
        "translation": "The first text has two parts: first, it's a straightforward difficulty, and second, it's a vertical difficulty.",
        "source": "T33n1717_019:0954b17_13"
    },
    {
        "source_sentence": "次文者，「符謂三乘法」者，所謂行行法也。",
        "translation": "The next text says, Fu refers to the three-vehicle teaching, which is called the practice of practice.",
        "source": "T33n1717_019:0954b17_14"
    },
    {
        "source_sentence": "「印謂泥洹道」者，「道」謂能通，「印」謂實相，有實相印，道則可行。",
        "translation": "The phrase mudrā means the path of nirvāṇa means the path that's capable of penetration, mudrā means the true characteristic, and there's the true characteristic mudrā, which is a path that can be practiced.",
        "source": "T33n1717_019:0954b18_15"
    },
    {
        "source_sentence": "第三文者，「靈」謂情識，有情識故，藉戒為本，「天」謂諸天正報依報，",
        "translation": "The third text means that spirituality refers to the consciousness of sentient beings, and because sentient beings have consciousnesses, they rely on precepts as their foundation.",
        "source": "T33n1717_019:0954b20_16"
    },
    {
        "source_sentence": "「地」謂地神依報正報，四天王持之使四時調順，地神持之萬物成熟。",
        "translation": "Earth means that the earth god relies on retribution and right retribution, which are maintained by the four heavenly kings to cause them to be disciplined in four seasons, and the earth god maintains it for all things to ripen.",
        "source": "T33n1717_019:0954b21_17"
    },
    {
        "source_sentence": "「父母道源」，秖是能生為義。",
        "translation": "The mother and father are the source of the path, which means to say that they are capable of producing.",
        "source": "T33n1717_019:0954b23_18"
    },
    {
        "source_sentence": "第四如文。",
        "translation": "The fourth is as explained in the text.",
        "source": "T33n1717_019:0954b23_19"
    },
    {
        "source_sentence": "第五結集難中二：初難不預五時，次「何者」下釋不預所以。",
        "translation": "In the fifth difficulty of gathering, there are two: the first difficulty doesn't anticipate the five times, and the second one explains why it doesn't anticipate them under What?",
        "source": "T33n1717_019:0954b24_20"
    },
    {
        "source_sentence": "六難一音，可見。",
        "translation": "The six difficulty is that the single sound of one voice can be seen.",
        "source": "T33n1717_019:0954b25_21"
    },
    {
        "source_sentence": "次難菩提流支中二：先牒計略斥，次從「得道」下正斥。",
        "translation": "Next, there are two difficulties in the branch of the stream of enlightenment: first, it's a brief explanation that rejection is conjectured, and second, it's a correct rejection that follows from attaining the path.",
        "source": "T33n1717_019:0954b25_22"
    },
    {
        "source_sentence": "正斥又二：先斥半教，次從「般若」去斥滿教。",
        "translation": "There are two ways to correctly reject it: first, by rejecting the half-teachings, and second, by removing the full teaching from Prajñāpāramitā.",
        "source": "T33n1717_019:0954b27_23"
    },
    {
        "source_sentence": "初又二：初總難，次引諸文，皆是十二年前已有滿教。",
        "translation": "The first has two parts: the first is a general objection, and the second cites texts that all have been completed twelve years ago.",
        "source": "T33n1717_019:0954b28_24"
    },
    {
        "source_sentence": "言「涅槃云，我初成道，恒沙菩薩來問」等者，第三經「迦葉設三十六問竟。",
        "translation": "The phrase nirvāṇa says, When I first became a buddha, the bodhisattva Gangesian came to ask questions, and so forth refers to the third sūtra, After Kāśyapa asked thirty-six questions.",
        "source": "T33n1717_019:0954b29_25"
    },
    {
        "source_sentence": "佛讚言：善哉！",
        "translation": "The Buddha praised him, saying, Good!",
        "source": "T33n1717_019:0954c02_26"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T33n1717_019:0954c02_27"
    },
    {
        "source_sentence": "汝今未得一切種智；",
        "translation": "You have not yet attained omniscience.",
        "source": "T33n1717_019:0954c02_28"
    },
    {
        "source_sentence": "如已得之，如汝所問，如一切智，等無有異。",
        "translation": "As you've already attained it, as you've asked, just like omniscience, there's no difference in equality.",
        "source": "T33n1717_019:0954c03_29"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T33n1717_019:0954c04_30"
    },
    {
        "source_sentence": "我初坐道場，初成正覺。",
        "translation": "When I first sat on the terrace of enlightenment, I became perfectly enlightened.",
        "source": "T33n1717_019:0954c04_31"
    },
    {
        "source_sentence": "爾時無量阿僧祇恒沙等諸佛世界，有諸菩薩，亦曾問我如是深義，然其所問句義功德，",
        "translation": "Countless, incalculable buddha-lands as numerous as the grains of sand in the Ganges River at that time there were also bodhisattvas who asked me about this profound doctrine.",
        "source": "T33n1717_019:0954c04_32"
    },
    {
        "source_sentence": "皆亦如是，等無有異。",
        "translation": "They are all the same, without any difference in their equality.",
        "source": "T33n1717_019:0954c06_33"
    },
    {
        "source_sentence": "如是問者，則能利益無量眾生。」",
        "translation": "If someone asks this question, they'll be able to benefit measureless sentient beings.",
        "source": "T33n1717_019:0954c07_34"
    },
    {
        "source_sentence": "次斥滿中又二：先引論以明法華祕密難，次「又若」下以三味名展轉互難。",
        "translation": "Next, there are two more ways to reject the completion: first, he cites the treatise to explain the esoteric difficulties of the Lotus Sutra and second, under Furthermore, he uses the names of the three flavors to name the mutual difficulties that arise in turn.",
        "source": "T33n1717_019:0954c08_35"
    },
    {
        "source_sentence": "互難又二：初正難，次「能譬」下結難。",
        "translation": "There are two further mutual difficulties: the first is a correct difficulty, and the second is a difficulty under able to metaphor.",
        "source": "T33n1717_019:0954c09_36"
    },
    {
        "source_sentence": "次難四宗中自為四。",
        "translation": "The next difficulty is that the four doctrines in the four schools are self-contained as four.",
        "source": "T33n1717_019:0954c10_37"
    },
    {
        "source_sentence": "初難因緣宗，中二：初以通途因緣為難，次「又因緣」下假名義同不應立異為難。",
        "translation": "The first is the doctrine of the causes and conditions of the difficulty, which are twofold: first, it's difficult to make the causes and conditions of the shared path a difficulty, and second, under further causes and conditions, it's difficult to make false names that are the same in meaning and shouldn't be made different.",
        "source": "T33n1717_019:0954c11_38"
    },
    {
        "source_sentence": "初文言「六因四緣」者，略如《止觀》第八記。",
        "translation": "The first text says six causes and four conditions, which is briefly as recorded in the eighth entry of Zhiguan.",
        "source": "T33n1717_019:0954c13_39"
    },
    {
        "source_sentence": "言「成論三因四緣」者，三因謂生因、習因、依因。",
        "translation": "The phrase accomplishment of the three causes and four conditions means that the three causes are the causes of arising, the causes of accumulation, and the causes of reliance.",
        "source": "T33n1717_019:0954c14_40"
    },
    {
        "source_sentence": "生因者，若法生時能與其因，如業為報因。",
        "translation": "The cause of arising is that when factors arise, they can be the cause for their cause: just as action is the cause for retribution.",
        "source": "T33n1717_019:0954c15_41"
    },
    {
        "source_sentence": "習因者，如習貪欲，貪欲增長。",
        "translation": "The cause of accumulation is as the accumulation of attachment to sensual desire: just as attachment to sensual desire increases.",
        "source": "T33n1717_019:0954c16_42"
    },
    {
        "source_sentence": "依因者，如心心數法，依色香等。",
        "translation": "The supporting cause: just as the mind and the accompanying mental factors®”*! depending on matter, odor, etc.",
        "source": "T33n1717_019:0954c16_43"
    },
    {
        "source_sentence": "四緣者，因緣者具足三因，次第緣者心心數法次第而生，緣緣者如識生眼識，",
        "translation": "“Four are with four conditions”: The condition as cause is supplied with three reasons. Condition as direct antecedent is that awarenesses and accompanying mental factors arise one after the other in succession. Condition as supporting object is just as consciousness gives rise to visual consciousness.",
        "source": "T33n1717_019:0954c17_44"
    },
    {
        "source_sentence": "增上緣者諸餘緣也。",
        "translation": "The superior condition refers to the other conditions.",
        "source": "T33n1717_019:0954c19_45"
    },
    {
        "source_sentence": "若《俱舍》中因緣五因性，《成論》以所作因即是增上，故不別立，但立報因，",
        "translation": "If the five causal natures of causes and conditions are found in the Kukkuṭaśas, the Satyasiddhi-śāstra establishes that the efficient cause is predominant, so it does not establish separately but only as a retributive cause:",
        "source": "T33n1717_019:0954c19_46"
    },
    {
        "source_sentence": "即生因是；",
        "translation": "That is, it is the cause of rebirth.",
        "source": "T33n1717_019:0954c21_47"
    },
    {
        "source_sentence": "自分因，即習因是；",
        "translation": "The homogeneous cause is the conditioned cause.",
        "source": "T33n1717_019:0954c21_48"
    },
    {
        "source_sentence": "共因，即依因是。",
        "translation": "The simultaneous cause is the supporting cause.",
        "source": "T33n1717_019:0954c22_49"
    },
    {
        "source_sentence": "次難假名宗，中二：先據本論得道為難，次引《大論》空門為證，宗應順本論，",
        "translation": "The next difficulty is the doctrine that names are provisional, of which there are two: first, it's difficult to attain the path based on the original treatise; second, it's difficult to cite the approach of emptiness in the Mahāprajñāpāramitā as proof that the doctrine follows the original treatise.",
        "source": "T33n1717_019:0954c22_50"
    },
    {
        "source_sentence": "異不成宗。",
        "translation": "What's different doesn't become the doctrine.",
        "source": "T33n1717_019:0954c24_51"
    },
    {
        "source_sentence": "次難不真宗，中三：先引《大論》彈方廣破，次「若謂」下難不明佛性，",
        "translation": "The next difficulty is about the untrue doctrine, of which there are three: first, citing the Mahāprajñāpāramitā-sūtra's commentary to extensively refute it; second, under If It's claimed, it's a difficulty not understanding the buddha-nature,",
        "source": "T33n1717_019:0954c24_52"
    },
    {
        "source_sentence": "三「何但」下難幻化語通、立宗不成。",
        "translation": "Third, under Why is it so? it's difficult to explain that illusory words and established doctrines don't work.",
        "source": "T33n1717_019:0954c26_53"
    },
    {
        "source_sentence": "初文破不真宗，指《大品》十喻者，如《止觀》第五記。",
        "translation": "The first text refutes the untrue doctrine and refers to the ten metaphors in the Mahāprajñāpāramitā, as recorded in the fifth entry of Zhiguan.",
        "source": "T33n1717_019:0954c26_54"
    },
    {
        "source_sentence": "十喻既是《大品》正文，龍樹彈者但為方廣不曉即空不空等理，但指如幻為不生滅；",
        "translation": "Since the ten metaphors are the main text of the Mahaparinirmita-vaśavartin, the snatcher named Nāgârjuna simply refers to such principles as emptiness and nonemptyness because he does not understand them in detail.",
        "source": "T33n1717_019:0954c28_0"
    },
    {
        "source_sentence": "如幻但是俗諦而已，如何得立為般若宗？",
        "translation": "Just as an illusion is nothing but a conventional truth, how can it be posited as the doctrine of prajñā?",
        "source": "T33n1717_019:0954c29_1"
    },
    {
        "source_sentence": "般若意在空及不空，故云「失般若意」。",
        "translation": "The meaning of prajñā is in emptiness and nonempty, so it's called losing the meaning of prajñā.",
        "source": "T33n1717_019:0955a01_2"
    },
    {
        "source_sentence": "次文可見。",
        "translation": "The next sentence shows this.",
        "source": "T33n1717_019:0955a02_3"
    },
    {
        "source_sentence": "第三文又二：先難，次結。",
        "translation": "The third text has two more: first, the difficulty, and second, the conclusion.",
        "source": "T33n1717_019:0955a03_0"
    },
    {
        "source_sentence": "次難常宗，指涅槃，於中為二：先以八術並難，次「彼云」下重述彼救重破。",
        "translation": "The next difficulty is the eternal doctrine that refers to nirvāṇa, which is divided into two: first, it's a combination of eight techniques and difficulties, and second, it's explained again under those words to rescue and refute them.",
        "source": "T33n1717_019:0955a03_1"
    },
    {
        "source_sentence": "又五：初述計；",
        "translation": "The first is calculation.",
        "source": "T33n1717_019:0955a05_2"
    },
    {
        "source_sentence": "次「宗則」下重破其宗，教真不真等不應別立；",
        "translation": "Next, the doctrine refutes this doctrine by saying: The teachings that are true and not true should not be established separately.",
        "source": "T33n1717_019:0955a05_3"
    },
    {
        "source_sentence": "三「彼引楞伽」下破其謬引失意；",
        "translation": "Third, under They cite Laṅkâvatāra, they refute their mistake by citing the meaning of error.",
        "source": "T33n1717_019:0955a06_4"
    },
    {
        "source_sentence": "四「若爾」下以因緣假名為例；",
        "translation": "The fourth, If so, is an example of using causes and conditions as provisional names.",
        "source": "T33n1717_019:0955a07_5"
    },
    {
        "source_sentence": "五「覆却」下結難。",
        "translation": "The fifth concludes with a difficulty under overwhelming.",
        "source": "T33n1717_019:0955a08_6"
    },
    {
        "source_sentence": "初文言「彼云誑相不真宗」等者，彼云四宗家自判云，不真宗是通教，",
        "translation": "The first text says, They say that debilitating characteristics are not true doctrines, and so forth, because they say that the four schools of Buddhism themselves judge that untruthful doctrines are universal teachings.",
        "source": "T33n1717_019:0955a08_7"
    },
    {
        "source_sentence": "常宗是真宗，彼依《楞伽》作如此判，具如下引。",
        "translation": "The eternalism school is the true doctrine, and they make this judgment based on the Laṅkâvatāra, as quoted below.",
        "source": "T33n1717_019:0955a10_8"
    },
    {
        "source_sentence": "今以真不真及宗教有無却覆並決，令二名齊等，使宗必有教、教必有宗，",
        "translation": "Now, because the real and the unreal are distinct, as well as the existence and nonexistence of doctrine, they are both obscured and determined. Thus, to make the two names equal, so that doctrine necessarily has doctrine and doctrine necessarily has doctrine.",
        "source": "T33n1717_019:0955a11_9"
    },
    {
        "source_sentence": "教是能詮、宗是所詮，必互相有，不可孤然。",
        "translation": "Teachings are what can be interpreted, while doctrines are what is to be interpreted. They must exist one another; they cannot be isolated.",
        "source": "T33n1717_019:0955a12_10"
    },
    {
        "source_sentence": "既無此義，當知汝之所立真及不真亦須互有，既不別立其名便齊，何須別立宗教二耶？",
        "translation": "Since there's no such meaning, you should know that what you establish as true and what's not true also need to exist together. If they don't establish separate names, then they're the same, so why would it be necessary to establish separately the two religious teachings?",
        "source": "T33n1717_019:0955a13_11"
    },
    {
        "source_sentence": "說大意竟。",
        "translation": "After explaining the main idea, he said.",
        "source": "T33n1717_019:0955a16_12"
    },
    {
        "source_sentence": "更重消文，從初至「者」字，有二十二字，先述彼定計二宗，次從「宗則」下重破中，",
        "translation": "There are twenty-two words that go from the first to the word 'that,' and they first describe the two theories of definiteness and then repeatedly refute them under doctrine.",
        "source": "T33n1717_019:0955a16_13"
    },
    {
        "source_sentence": "初至用教二句有十五字，難其不真不合無宗。",
        "translation": "The first up to the second phrase of the teaching of using has fifteen words, which is difficult because it's not true and doesn't fit into the absence of a doctrine.",
        "source": "T33n1717_019:0955a18_14"
    },
    {
        "source_sentence": "從「真宗」去至「立宗」有九字，難其有宗不合無教。",
        "translation": "From true doctrine up to establishing a doctrine, there are nine words that make it difficult to say that there's a doctrine that doesn't fit without a teaching.",
        "source": "T33n1717_019:0955a19_15"
    },
    {
        "source_sentence": "次從「宗若」去至「知真」有八字，重徵其無教之失，宗為所詮，教為能詮，",
        "translation": "Next, there are eight words that go from theories and principles to know the truths, which repeat the error of not having a teaching. The theories are what is explained, and the teachings are what can be explained.",
        "source": "T33n1717_019:0955a20_16"
    },
    {
        "source_sentence": "真宗既無能詮之教，如何得知所詮之真？",
        "translation": "Since the true doctrine has no teaching that can be interpreted, how can we know the true nature of what's interpreted?",
        "source": "T33n1717_019:0955a22_17"
    },
    {
        "source_sentence": "次從「真宗若沒」去至「通教」，有十二字，以真却並不真，若使真宗還例不真無宗有教，",
        "translation": "Next, there are twelve words that go from the true doctrine if it doesn't exist to the shared teachings, which have twelve words that remove what's true and what's not true because it's true, and if the true doctrine is made to resemble what's not true, then there's no doctrine with a doctrine.",
        "source": "T33n1717_019:0955a23_18"
    },
    {
        "source_sentence": "則真與不真同名通教。",
        "translation": "Then what's true and what's not true are both called the shared teaching.",
        "source": "T33n1717_019:0955a25_19"
    },
    {
        "source_sentence": "次從「若俱沒教」去至「通宗」，有十一字，復以不真却並於真，若使不真還例於真無教有宗，",
        "translation": "Next, there are eleven words that go from If they both disappear in the teachings up to the shared doctrine, which again remove what's not true and establishes what's true with what's true, and if it doesn't become true, then it's likewise analogous to the doctrine that there's a doctrine in the absence of truth.",
        "source": "T33n1717_019:0955a25_20"
    },
    {
        "source_sentence": "則真與不真同名通宗。",
        "translation": "Then what's true and what's not true are both called the shared doctrine.",
        "source": "T33n1717_019:0955a27_21"
    },
    {
        "source_sentence": "次從「若俱安」去至「宗教」有一十字，立理難其宗教合俱，若真與不真俱有教有宗，",
        "translation": "Next, there's a cross that goes from If they are both peaceful up to religion, establishes the principle and creates a difficulty by positing that their religions are combined together, and if truth and non-truth are both existent and have doctrine and doctrine,",
        "source": "T33n1717_019:0955a28_22"
    },
    {
        "source_sentence": "則真與不真俱名通宗及教。",
        "translation": "Then, both the true and the untruth are called shared with the doctrine and the teaching.",
        "source": "T33n1717_019:0955b01_23"
    },
    {
        "source_sentence": "次從「若留」去至「宗教」有十六字，以真不真却覆並難宗之與教，宗教既等，",
        "translation": "Next, there are sixteen words that go from if you leave it to religion, which cover what's true and untruthful and make it difficult to distinguish between the doctrine and the teaching. Since religion is equal,",
        "source": "T33n1717_019:0955b02_24"
    },
    {
        "source_sentence": "不應復分真不真別，是則宗教之上俱有真與不真，真與不真既同，宗之與教復等，",
        "translation": "You should no longer distinguish between the real and the unreal. This is because, above religion, there is both the real and the unreal. Since the real and the unreal are the same, the doctrine and the teachings are also the same.",
        "source": "T33n1717_019:0955b03_25"
    },
    {
        "source_sentence": "是則但成一句，謂通不真真宗教。",
        "translation": "This is simply a phrase that accomplishes the task, which is to say that it's shared with unreal and true religion.",
        "source": "T33n1717_019:0955b05_26"
    },
    {
        "source_sentence": "文中似開為兩句者，為開次文，難勢未畢，故云「通不真宗教」、「通真宗教」。",
        "translation": "The text seems to begin with two phrases because it starts with the next sentence, and the difficulty hasn't yet ended; therefore, it's called 'Buddhist teaching that penetrates unreal religion and Buddhist teaching that penetrates true religion.'",
        "source": "T33n1717_019:0955b06_27"
    },
    {
        "source_sentence": "次從「通不真宗」去至「脩也」，有二十一字，以法却覆難其行人，法既一例俱有教宗，",
        "translation": "Next, there are twenty-one words that go from Tong not really the doctrine to suya, which have twenty-one words that obscure practitioners by means of the teaching and make them difficult. Since the teaching is one example, they all have doctrinal doctrines.",
        "source": "T33n1717_019:0955b08_28"
    },
    {
        "source_sentence": "人不合分大小之別。",
        "translation": "People don't fit into the distinction between large and small.",
        "source": "T33n1717_019:0955b10_29"
    },
    {
        "source_sentence": "若言不真通三乘人，真宗亦應通三乘人。",
        "translation": "If it's said that what's not true penetrates the three-vehicle people, then the true teaching should also penetrate the three-vehicle people.",
        "source": "T33n1717_019:0955b10_30"
    },
    {
        "source_sentence": "亦應更覆並云，真既獨教菩薩之人，不真亦應獨教菩薩。",
        "translation": "It should also be further covered up and said, Since the true is taught to bodhisattvas alone, what's not true should also be taught to bodhisattvas alone.",
        "source": "T33n1717_019:0955b11_31"
    },
    {
        "source_sentence": "亦應更並云，三乘通有真與不真，如何輒分宗教等別？",
        "translation": "It should also be stated at the same time that the three vehicles are both true and untruthful, so how can they easily be distinguished as religious or otherwise?",
        "source": "T33n1717_019:0955b13_32"
    },
    {
        "source_sentence": "次「若言」去至「真也」，有十九字，縱難也。",
        "translation": "Next, there are 19 words that go from if it's said to true, even though it's difficult.",
        "source": "T33n1717_019:0955b14_33"
    },
    {
        "source_sentence": "借使真宗是融通之通，亦不應獨無教而立宗也。",
        "translation": "It's because the true doctrine is the gate of interpenetration, and it shouldn't be established as a doctrine alone without a teaching.",
        "source": "T33n1717_019:0955b15_34"
    },
    {
        "source_sentence": "通教亦是通宗之真，豈得無宗而立於教？",
        "translation": "The shared teaching is also the true nature of the shared doctrine, so how could a doctrine be established without a doctrine?",
        "source": "T33n1717_019:0955b16_35"
    },
    {
        "source_sentence": "從「此則」下總結宗教二義既其齊等，真不真名亦皆混同。",
        "translation": "From this principle down, we'll summarize the two meanings of religion as they are the same in terms of their equality, and true and untruthful names are both mixed together.",
        "source": "T33n1717_019:0955b17_36"
    },
    {
        "source_sentence": "三從「彼引」去出其謬引，所憑便成不曉教旨。",
        "translation": "Third, it follows from the phrase that they cite and removes their mistakenly cited, which then becomes the point of not understanding the teaching.",
        "source": "T33n1717_019:0955b18_37"
    },
    {
        "source_sentence": "彼經明於三乘共位，即簡二乘，名為「童蒙」。",
        "translation": "That sūtra explains the common position of the three vehicles, which is to summarize the two vehicles and call them children's endowments.",
        "source": "T33n1717_019:0955b20_38"
    },
    {
        "source_sentence": "說秖是教，以教通故，不隔童蒙，故云「說通兼教童蒙」，雖通童蒙，",
        "translation": "It's because the teaching is shared that it doesn't separate from the children's enlightenment, so it's said to be shared with the child's enlightenment, even though it's shared with the children's enlightenment.",
        "source": "T33n1717_019:0955b21_39"
    },
    {
        "source_sentence": "宗在菩薩，是故宗通本教菩薩。",
        "translation": "The doctrine is based on bodhisattvas, so the doctrine communicates with the bodhisattvas of the original teaching.",
        "source": "T33n1717_019:0955b22_40"
    },
    {
        "source_sentence": "教是能詮，何故立云真宗無教？",
        "translation": "Why is it established that the doctrine of truth has no doctrine?",
        "source": "T33n1717_019:0955b23_41"
    },
    {
        "source_sentence": "兼被於小則童蒙有教，何故立云無宗但教？",
        "translation": "Why is it established that there is no doctrine but only teaching?",
        "source": "T33n1717_019:0955b24_42"
    },
    {
        "source_sentence": "彼人不知三乘之真兼空不空，不空復有教證兩別，他不見此，望聲釋義，",
        "translation": "That person doesn't know that the true nature of the three vehicles is both emptiness and nonempty, and there are two distinctive aspects of teaching and realization in nonemptyness. Others don't see this, looking to sound and interpretation for meaning.",
        "source": "T33n1717_019:0955b25_43"
    },
    {
        "source_sentence": "徒分宗教，失旨逾深。",
        "translation": "They merely divided the teachings into sects and lost more than a great deal of meaning.",
        "source": "T33n1717_019:0955b27_44"
    },
    {
        "source_sentence": "四從「若爾」去例難。",
        "translation": "Fourth, it's a difficulty to remove the example from 'if so.'",
        "source": "T33n1717_019:0955b27_45"
    },
    {
        "source_sentence": "且依彼立，以難因緣假名二宗，同成不真；",
        "translation": "Moreover, it is established on the basis of these two doctrines that by means of difficult causes and conditions conventional names are both accepted as untrue.",
        "source": "T33n1717_019:0955b28_46"
    },
    {
        "source_sentence": "若更並決，亦應準前，故云「不便」。",
        "translation": "If it's further decided together, it should also be the same as the previous one, so it's called inconvenience.",
        "source": "T33n1717_019:0955b29_47"
    },
    {
        "source_sentence": "次破五宗六宗，又二：先破，次總責無憑。",
        "translation": "Next, he refutes the five doctrines and six doctrines, which are twofold: first, he refutes them; second, he generally rejects the absence of a basis.",
        "source": "T33n1717_019:0955b29_48"
    },
    {
        "source_sentence": "初破五宗。",
        "translation": "The first refutes the five doctrines.",
        "source": "T33n1717_019:0955c01_49"
    },
    {
        "source_sentence": "彼立五宗，四不殊前，已如前破；",
        "translation": "They establish five doctrines, four of which are not different from the prior ones. The text has already been refuted as before.",
        "source": "T33n1717_019:0955c02_0"
    },
    {
        "source_sentence": "次「若言」下正破法界宗中二：先難，次結。",
        "translation": "Next, under If it's said, there are two ways to correctly refute the doctrine of the Dharma realm: first, by explaining the difficulty, and second, by concluding.",
        "source": "T33n1717_019:0955c02_1"
    },
    {
        "source_sentence": "初文二，先以《涅槃》難，次以《大品》難。",
        "translation": "The first text is divided into two, first by explaining the difficulty of the Nirvana Sutra and second by explaining the difficulty of the Mahāprajñāpāramitā.",
        "source": "T33n1717_019:0955c03_2"
    },
    {
        "source_sentence": "初文二：先以二部不應優劣難，次「若常」下以二法對並為妨難，二法不別，",
        "translation": "The first text is twofold: first, it's because the two parts shouldn't be difficult to distinguish superior and inferior, and second, if they are constant, it's because the two dharmas are opposed together as obstructions that the two dharmas aren't distinct.",
        "source": "T33n1717_019:0955c04_3"
    },
    {
        "source_sentence": "何得別立以為兩宗？",
        "translation": "How can they be established separately as two doctrines?",
        "source": "T33n1717_019:0955c06_4"
    },
    {
        "source_sentence": "次引《大品》中「一切法趣」，如《止觀》第二記。",
        "translation": "The next quote from the Mahāprajñāpāramitā says, All the destinies of dharmas are as recorded in the second entry in the Cessation and Contemplation.",
        "source": "T33n1717_019:0955c06_5"
    },
    {
        "source_sentence": "結如文。",
        "translation": "The conclusion is as explained in the text.",
        "source": "T33n1717_019:0955c07_6"
    },
    {
        "source_sentence": "◎法華玄義釋籤卷第十九",
        "translation": "Fascicle 19 of the Explanation of the Profound Meaning of the Lotus Sutra",
        "source": "T33n1717_019:0955c08_7"
    }
]