[
    {
        "source_sentence": "法華玄義釋籤卷第七",
        "translation": "Fahua xuanyi zhi shou, vol. 7",
        "source": "T33n1717_007:0861b10_0"
    },
    {
        "source_sentence": "天台沙門湛然述",
        "translation": "Tiantai shaman Zhanran shu",
        "source": "T33n1717_007:0861b12_0"
    },
    {
        "source_sentence": "◎次明智妙為二：先明來意，次正釋。",
        "translation": "Next, he explains that the marvelousness of wisdom is twofold: first, he explains the meaning of the coming teaching, and then he correctly explains it.",
        "source": "T33n1717_007:0861b13_0"
    },
    {
        "source_sentence": "初文可見。",
        "translation": "The first text shows this.",
        "source": "T33n1717_007:0861b13_1"
    },
    {
        "source_sentence": "次正釋中自二：初意者文自為六，先列六章，次依章解釋。",
        "translation": "The next is a correct explanation that has two parts: the first part consists of six meanings, which are listed in six chapters and then explained in terms of those chapters.",
        "source": "T33n1717_007:0861b14_2"
    },
    {
        "source_sentence": "初數中，初六藏，次四通，次三別，次三三佛，次四圓，三佛在果，彼三果無人，",
        "translation": "In the first calculation, there are the first six stores, the next four supernormal knowledges, the next three distinctions, the next three buddhas, the next four perfections, and the third buddha in the fruit. These three fruits have no one in them.",
        "source": "T33n1717_007:0861b15_3"
    },
    {
        "source_sentence": "故別於此列。",
        "translation": "Therefore, it's listed here separately.",
        "source": "T33n1717_007:0861b17_4"
    },
    {
        "source_sentence": "圓果有人，故自居因後，次「類者」例也。",
        "translation": "Because there are people in the perfect fruit, they therefore abide after the causes themselves, following the example of types.",
        "source": "T33n1717_007:0861b17_5"
    },
    {
        "source_sentence": "又二：先列、次結。",
        "translation": "There are two more: first, listing and second, concluding.",
        "source": "T33n1717_007:0861b18_6"
    },
    {
        "source_sentence": "初文者說其數意，何故以五停乃至十地等而各為一數，故立此門。",
        "translation": "The first part of the text explains the meaning of these numbers. Why are the five stations, up to ten stages, etc., each counted as one number? That is why this aspect is established.",
        "source": "T33n1717_007:0861b18_7"
    },
    {
        "source_sentence": "類例同故且各為一數，若一一位別為一數，太成繁雜，故且總云。",
        "translation": "Because the categories and examples are the same, each is counted as a number. If one rank were to be counted separately as a number, it would become too complicated, so we'll just say in a general way.",
        "source": "T33n1717_007:0861b20_8"
    },
    {
        "source_sentence": "三藏菩薩亦應云四門遍學，但為出其當體義異，故且從緣事理強弱為類。",
        "translation": "The Tripiṭaka bodhisattva should also say that the four approaches are pervasively studied, but in order to show that their present essence and meaning are different, they're classified from the weakness of conditioned phenomena and principles as causes.",
        "source": "T33n1717_007:0861b21_9"
    },
    {
        "source_sentence": "三佛應云並是師位，亦為從教辨三相異，故從義各明。",
        "translation": "The three buddhas should say that they are all masters, and in order to discern the differences of the three characteristics from the teachings, they are explained separately according to their meanings.",
        "source": "T33n1717_007:0861b23_10"
    },
    {
        "source_sentence": "三辨相中，若從數類誠為不多，類中多相，從相復更少多分別，故使爾耳。",
        "translation": "In the third discernment of characteristics, if they really aren't numerous in number and type, then there are many characteristics in types, and there are few more distinctive characteristics from characteristics, so that's why it's so.",
        "source": "T33n1717_007:0861b25_11"
    },
    {
        "source_sentence": "初辨世智相中云「天竺」至「非想」者，語智所依乃至初禪，今且從極。",
        "translation": "The first one identifies the characteristics of worldly cognition and says, From India to nonconception, it's called the basis of verbal cognition up to the first dhyāna, which now follows from the ultimate.",
        "source": "T33n1717_007:0861b26_12"
    },
    {
        "source_sentence": "「忠孝」等，略如《止觀》記。",
        "translation": "The words loyalty and filial piety are briefly described in the Zhiguan jing.",
        "source": "T33n1717_007:0861b28_13"
    },
    {
        "source_sentence": "多識於鳥獸草木之名者，莫過於《爾雅》。",
        "translation": "Many people who know the names of birds, animals, grass, and trees are no different than those in the Erya.",
        "source": "T33n1717_007:0861b28_14"
    },
    {
        "source_sentence": "雖安塗割，所依但是世禪。",
        "translation": "Even though it's peaceful, the only basis is worldly meditation.",
        "source": "T33n1717_007:0861b29_15"
    },
    {
        "source_sentence": "「獲根本定」等者，用通必依色定故也，故停河等須依根本。",
        "translation": "They attain fundamental concentration and so forth because their function must rely on form concentration, so they must rely on the fundamentals to stop rivers and so forth.",
        "source": "T33n1717_007:0861c01_16"
    },
    {
        "source_sentence": "「停河在耳」等者，如《大經》三十五「諸外道等來白波斯匿王言：大王！",
        "translation": "The phrase stopping the river in your ears and so forth refers to the thirty-fifth section of the Mahāprajñāpāramitā Sutra, saying, Great king!",
        "source": "T33n1717_007:0861c02_17"
    },
    {
        "source_sentence": "不應輕懱如是大士。",
        "translation": "You shouldn't despise such a great man.",
        "source": "T33n1717_007:0861c04_18"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T33n1717_007:0861c04_19"
    },
    {
        "source_sentence": "是月增減誰之所作？",
        "translation": "To whom does the moon increase and decrease?",
        "source": "T33n1717_007:0861c04_20"
    },
    {
        "source_sentence": "大海鹹味、摩羅延山誰之所作？",
        "translation": "Who did the great salty taste of the ocean and Mount Mallayana make it?",
        "source": "T33n1717_007:0861c05_21"
    },
    {
        "source_sentence": "豈非我等婆羅門耶？",
        "translation": "Isn't that us, the Brāhmaṇas?",
        "source": "T33n1717_007:0861c06_22"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T33n1717_007:0861c06_23"
    },
    {
        "source_sentence": "不聞阿竭多仙十二年中恒河之水停在耳中耶？",
        "translation": "Didn't you hear the water of the Ganges River stopped in your ears for twelve years from the sage Āgata?",
        "source": "T33n1717_007:0861c06_24"
    },
    {
        "source_sentence": "瞿曇仙人作大神變，十二年中變作釋身，并令釋身作羝羊身，作千女根在釋身上。",
        "translation": "The sage Gautama made a great miraculous transformation, transforming himself into the body of Śākyamuni in twelve years and causing him to make the body of Śākyamuni into the body of a cow or sheep with a thousand female faculties on his body.",
        "source": "T33n1717_007:0861c07_25"
    },
    {
        "source_sentence": "耆兔仙人一日之中，飲大海水令大地乾耶？",
        "translation": "In a single day, did the sage Jīvaka drink the great ocean water and make the earth dry?",
        "source": "T33n1717_007:0861c09_26"
    },
    {
        "source_sentence": "婆藪仙人為自在天作三目耶？",
        "translation": "Did the sage Vasubandhu make three eyes for the self-willed gods?",
        "source": "T33n1717_007:0861c10_27"
    },
    {
        "source_sentence": "羅羅仙人變迦毘羅城為鹵土耶？",
        "translation": "Did the sage Rāhula transform the city of Kapilavastu into a marsh land?",
        "source": "T33n1717_007:0861c11_28"
    },
    {
        "source_sentence": "婆羅門中有如是等大力諸仙，現可撿挍，云何輕懱如是大仙？」",
        "translation": "Among the great sages among the Brāhmaṇas, there are such great sages who can now be examined, so why would they despise such great sages?",
        "source": "T33n1717_007:0861c12_29"
    },
    {
        "source_sentence": "亦如此土古人張揩能作霧，欒巴善吐雲，葛洪、陶淵明等皆薄有術數，",
        "translation": "Just as the ancients of this land were able to make mist by opening and wiping away dirt, whereas the people of Lumbinī are good at producing clouds. Ge Hong and Tao Yuanming had few skillful skills but their knowledge was limited.",
        "source": "T33n1717_007:0861c14_0"
    },
    {
        "source_sentence": "蓋小小耳。",
        "translation": "It's because it's small.",
        "source": "T33n1717_007:0861c15_1"
    },
    {
        "source_sentence": "若比西方，天懸地殊。",
        "translation": "If we compare it to the West, the sky and earth will be different.",
        "source": "T33n1717_007:0861c15_2"
    },
    {
        "source_sentence": "「法是世間法」等者，定非無漏，不能斷惑，故云「不動」。",
        "translation": "The phrase dharma is a worldly dharma and so forth means that it's definitely not uncontaminated and can't stop afflictions, so it's called immovable.",
        "source": "T33n1717_007:0861c16_3"
    },
    {
        "source_sentence": "常在三有，故曰「不出」。",
        "translation": "It's always present in the three existences, so it's called not coming out.",
        "source": "T33n1717_007:0861c17_4"
    },
    {
        "source_sentence": "邪慧不能動惑出界故也。",
        "translation": "It's because wrong wisdom can't move afflictions out of the realm.",
        "source": "T33n1717_007:0861c18_5"
    },
    {
        "source_sentence": "次五停四念中，先五停，次四念。",
        "translation": "Among the next five kinds of four forms of mindfulness, the first is with five forms of cessation and the second with four forms of mindfulness.",
        "source": "T33n1717_007:0861c18_6"
    },
    {
        "source_sentence": "初五停中三：先釋名，次「觀能」下明停心功能，三「數息」下正明用治。",
        "translation": "The first five kinds of cessation are threefold: first, an explanation of the name; second, an explanation of the function of observing the mind's ability to cease; and third, a correct explanation of the antidote for its function under number of breaths.",
        "source": "T33n1717_007:0861c19_7"
    },
    {
        "source_sentence": "但列名對病而已，廣如《止觀》第十記。",
        "translation": "It simply lists the names and antidotes to illnesses, as detailed in the tenth entry in Zhiguan.",
        "source": "T33n1717_007:0861c21_8"
    },
    {
        "source_sentence": "次四念中亦略不列名，但舉數對位，至下照中文相稍廣。",
        "translation": "In the next four moments of thought, we'll also briefly list the names, but we'll just give the number of paired states up to the following point where we'll illuminate the slightly broader characteristics of Chinese.",
        "source": "T33n1717_007:0861c21_9"
    },
    {
        "source_sentence": "於中又二：初明功能，次「初翻」下判位。",
        "translation": "There are two more: the first explains the function, and the second is to judge the position under first translation.",
        "source": "T33n1717_007:0861c23_10"
    },
    {
        "source_sentence": "即以功能為其相狀，「煖法已上四善根」者，盡依《婆沙》，文相稍略。",
        "translation": "That is, it takes function as its characteristic and the four good roots above the warmth factor as its characteristic, which are all based on the Vibhāṣā, with a slightly abbreviated meaning.",
        "source": "T33n1717_007:0861c24_11"
    },
    {
        "source_sentence": "今略出論文，於初煖中為五：初正釋煖義，次「尊者」下釋煖在初，三「於正法」下明所緣諦，",
        "translation": "The first is a brief explanation of the meaning of warmth, and the second is an explanation under Venerable that warmth occurs in the beginning.",
        "source": "T33n1717_007:0861c25_12"
    },
    {
        "source_sentence": "四從「所有」下料簡釋疑，五「煖有」下明功能。",
        "translation": "Fourth, it's a brief explanation of doubt from the point of view of what exists under What exists, and fifth, Under warmth exists, we'll explain its function.",
        "source": "T33n1717_007:0861c27_13"
    },
    {
        "source_sentence": "初文者，由智觀故有煖生。",
        "translation": "The first text means that it's because of the contemplation of wisdom that warmth arises.",
        "source": "T33n1717_007:0861c28_14"
    },
    {
        "source_sentence": "次文可見。",
        "translation": "The next sentence shows this.",
        "source": "T33n1717_007:0861c29_15"
    },
    {
        "source_sentence": "第三文中三：先釋，次料簡，三「如佛」下引證，須緣四諦。",
        "translation": "The third text has three parts: first, an explanation; second, a summary; and third, the realization cited under thusness of buddhahood, which takes the four truths as objects.",
        "source": "T33n1717_007:0861c29_16"
    },
    {
        "source_sentence": "四料簡中二：初簡法，次簡品類。",
        "translation": "The first is to summarize the teaching, and the second is to summarize the categories.",
        "source": "T33n1717_007:0862a01_17"
    },
    {
        "source_sentence": "初云「所有布施盡迴解脫」等者，《婆沙》云：「西方人作此論」，今文略依彼問云：煖善根有何意趣？",
        "translation": "The first one says, What's the intention of the wholesome faculty of warmth and what's the meaning of this?",
        "source": "T33n1717_007:0862a02_18"
    },
    {
        "source_sentence": "為何所依？",
        "translation": "What's the basis?",
        "source": "T33n1717_007:0862a04_19"
    },
    {
        "source_sentence": "何因緣？",
        "translation": "What are the causes and conditions?",
        "source": "T33n1717_007:0862a05_0"
    },
    {
        "source_sentence": "何法？",
        "translation": "What is this doctrine?",
        "source": "T33n1717_007:0862a05_1"
    },
    {
        "source_sentence": "何果？",
        "translation": "What is the fruit?",
        "source": "T33n1717_007:0862a05_2"
    },
    {
        "source_sentence": "何報？",
        "translation": "What's the reward?",
        "source": "T33n1717_007:0862a05_3"
    },
    {
        "source_sentence": "何善利？",
        "translation": "What's the good benefit?",
        "source": "T33n1717_007:0862a05_4"
    },
    {
        "source_sentence": "行幾行？",
        "translation": "How many practices are there?",
        "source": "T33n1717_007:0862a05_5"
    },
    {
        "source_sentence": "為緣生？",
        "translation": "for the sake of conditioned arising?",
        "source": "T33n1717_007:0862a05_6"
    },
    {
        "source_sentence": "為緣起？",
        "translation": "For the sake of conditioned arising?",
        "source": "T33n1717_007:0862a06_7"
    },
    {
        "source_sentence": "為聞慧？",
        "translation": "For the sake of hearing and wisdom?",
        "source": "T33n1717_007:0862a06_8"
    },
    {
        "source_sentence": "為思慧？",
        "translation": "For the sake of thinking?",
        "source": "T33n1717_007:0862a06_9"
    },
    {
        "source_sentence": "為脩慧？",
        "translation": "For the sake of cultivating wisdom?",
        "source": "T33n1717_007:0862a06_10"
    },
    {
        "source_sentence": "為欲色無色界？",
        "translation": "For the sake of the desire realm, form and formless realms?",
        "source": "T33n1717_007:0862a06_11"
    },
    {
        "source_sentence": "為有覺有觀乃至無覺無觀？",
        "translation": "Why is there perception and contemplation, or even non-perception and non-contemplation?",
        "source": "T33n1717_007:0862a07_12"
    },
    {
        "source_sentence": "為何根相應？",
        "translation": "To what faculties are they associated?",
        "source": "T33n1717_007:0862a07_13"
    },
    {
        "source_sentence": "為一心為多心？",
        "translation": "Is it one mind or many minds?",
        "source": "T33n1717_007:0862a08_14"
    },
    {
        "source_sentence": "為退為不退？",
        "translation": "Is it retrogression or non-backsliding?",
        "source": "T33n1717_007:0862a08_15"
    },
    {
        "source_sentence": "乃至世第一法亦如是問。",
        "translation": "Even the world's highest dharma is likewise asked.",
        "source": "T33n1717_007:0862a08_16"
    },
    {
        "source_sentence": "今文闕問答字，便出答文。",
        "translation": "The present text lacks the word question and answer, so it gives the text of the answer.",
        "source": "T33n1717_007:0862a09_17"
    },
    {
        "source_sentence": "論答并如今文，乃至忍善根盡迴向解脫是其意趣等，唯闕答何法文。",
        "translation": "The answer in the treatise and the present text, up to the end of the good roots of forbearance and dedication of liberation are their intentions and so forth, but there's only a missing answer that doesn't explain which teaching.",
        "source": "T33n1717_007:0862a10_18"
    },
    {
        "source_sentence": "應云是有漏法，頂是煖家功用果，涅槃決定因是其利，復有說者不斷善根是其利。",
        "translation": "It should be said that they are impure dharmas. The top is the result of the powers and results of the house of warmth. The cause of nirvana ascertainable through certainty is its advantage. Further, some say that not cutting away the roots of merit is its advantage.",
        "source": "T33n1717_007:0862a11_19"
    },
    {
        "source_sentence": "又問煖法有幾種？",
        "translation": "Again, he asked, How many kinds are the factors of warmth?",
        "source": "T33n1717_007:0862a13_20"
    },
    {
        "source_sentence": "答如文。",
        "translation": "The answer is as explained in the text.",
        "source": "T33n1717_007:0862a14_21"
    },
    {
        "source_sentence": "又問有幾人從欲界至無所有處？",
        "translation": "Again, how many people are there who go from the desire realm to the sphere of nothingness?",
        "source": "T33n1717_007:0862a14_22"
    },
    {
        "source_sentence": "答各有九品，并一具縛人，合有七十三人。",
        "translation": "Answer: Each has nine classes and one person who's fully fettered, which are altogether seventy-three people.",
        "source": "T33n1717_007:0862a15_23"
    },
    {
        "source_sentence": "次料簡善根品類者，對下三善根以為料簡。",
        "translation": "The next one summarizes the categories of the good roots, using the following three good roots to summarize them.",
        "source": "T33n1717_007:0862a16_24"
    },
    {
        "source_sentence": "第二師文似四品，意但在三。",
        "translation": "The second teacher's text resembles four chapters, but his intention is to focus on three.",
        "source": "T33n1717_007:0862a17_25"
    },
    {
        "source_sentence": "然越次取者，例前九品亦越次故。",
        "translation": "However, the one who grasps in a transgressing order is an example of the first nine classes because they are also transgressing order.",
        "source": "T33n1717_007:0862a17_26"
    },
    {
        "source_sentence": "言「但在三」者，下下下中秖是下，中上秖是中，上上秖是上耳。",
        "translation": "The expression but in three refers to the fact that the lower, lower, middle, and lower are inferior, the middle and higher are middling, and the upper and lower are superior.",
        "source": "T33n1717_007:0862a18_27"
    },
    {
        "source_sentence": "煖頂於下三品中是下下、下中，雖有二品，但在於下，忍取中三品之上，",
        "translation": "Although there are two classes, they only abide in the lower one. The acquisition of patience is above these three classes:",
        "source": "T33n1717_007:0862a20_28"
    },
    {
        "source_sentence": "世第一取上三品之上。",
        "translation": "The first in the world takes the upper three classes and goes beyond them.",
        "source": "T33n1717_007:0862a21_29"
    },
    {
        "source_sentence": "瞿沙說九品上能兼下，故頂有六，忍有八。",
        "translation": "The Ghoṣa says that the nine classes can be combined with the lower ones. Therefore, there are six [factors] at the top of the head and eight [factors] in patience.",
        "source": "T33n1717_007:0862a22_30"
    },
    {
        "source_sentence": "世第一近真故不可兼多，故唯上上。",
        "translation": "Because it is near the highest worldly meditative state, it cannot be combined with many. Therefore, it is only higher and higher.",
        "source": "T33n1717_007:0862a23_31"
    },
    {
        "source_sentence": "九品既以上兼下，三品亦然。",
        "translation": "Since the nine grades are combined with the higher and lower, so are the three grades.",
        "source": "T33n1717_007:0862a24_32"
    },
    {
        "source_sentence": "故煖有一，乃至忍三，世第一亦唯一種，意亦如前。",
        "translation": "Therefore, there is one kind of warmth and up to three forms of patience. The highest worldly factor is also only one kind:",
        "source": "T33n1717_007:0862a24_33"
    },
    {
        "source_sentence": "五功能中言「二捨」者，言「離界地」謂自下升上，退時謂「失上退下」，",
        "translation": "The words two equanimity in the five functions mean that being free of the boundary refers to rising from the lower and ascending upward, and when regressing, it means losing the higher and retreating from the lower.",
        "source": "T33n1717_007:0862a26_0"
    },
    {
        "source_sentence": "失得禪時故云「失時」。",
        "translation": "When he loses his attainment of meditation, it's therefore called a time of loss.",
        "source": "T33n1717_007:0862a27_1"
    },
    {
        "source_sentence": "次釋頂法為四，初對上下三善根以辨行相不同，次從「復有」下釋名，",
        "translation": "Next, he explains that the top of the Dharma is divided into four, first by contrasting the three good roots above and below to identify the differences in their distinctive characteristics of practice. Next, he explains the names under Furthermore,",
        "source": "T33n1717_007:0862a28_2"
    },
    {
        "source_sentence": "三「云何」下釋頂法觀相，四從「問何故」下釋法名退。",
        "translation": "Third, it's explained under How? to contemplate the characteristics of the Dharma at the top of the head, and fourth, it's explained under Why do you ask why that the Dharma is called retrogression.",
        "source": "T33n1717_007:0862a29_3"
    },
    {
        "source_sentence": "此等諸文全同論文。",
        "translation": "These texts are all the same.",
        "source": "T33n1717_007:0862b01_4"
    },
    {
        "source_sentence": "論云：「有云：欲善根有二，下是煖、上是頂；",
        "translation": "According to another opinion, the roots of good are twofold: lower is warmth and higher is summit.",
        "source": "T33n1717_007:0862b02_5"
    },
    {
        "source_sentence": "色善根有二，下是忍、上是世第一。",
        "translation": "Good roots of form are twofold: the lower one is patience; the higher one is world summit.",
        "source": "T33n1717_007:0862b03_6"
    },
    {
        "source_sentence": "評家云：不應作是說，應云盡是色界法住定地，法聖行法好。」",
        "translation": "Commentators say, You shouldn't say this; you should say that it's all the Dharma abiding in the form realm and the noble practice of the Dharma and the goodness of the Dharma.",
        "source": "T33n1717_007:0862b04_7"
    },
    {
        "source_sentence": "今依評家，故云「色界」。",
        "translation": "Now, according to the commentators, it's therefore called the form realm.",
        "source": "T33n1717_007:0862b05_8"
    },
    {
        "source_sentence": "此等秖是判四善根，以有動等之異對四不同故也。",
        "translation": "These are the discernment of the four good roots, because there are differences in movement and so forth that contrast with dissimilarities in the four.",
        "source": "T33n1717_007:0862b06_9"
    },
    {
        "source_sentence": "動乃至退分二，不動乃至不退分二，雖同在色界，由善根深淺異故，致使差降不同。",
        "translation": "Even though they are the same as in the realm of form, it is due to differences in depth and shallowness of the roots of merit that there is distinction.",
        "source": "T33n1717_007:0862b07_10"
    },
    {
        "source_sentence": "「動」謂猶為外緣所動，「住」謂久住煖頂，「難」謂煖頂有難，「斷」謂斷於善根，",
        "translation": "The word movement means to be moved by external conditions. Abiding means to abide for a long time at the top of warmth. Difficulty means that there is difficulty at the top of warmth, and elimination means to eliminate the roots of goodness.",
        "source": "T33n1717_007:0862b09_11"
    },
    {
        "source_sentence": "「退」謂退為五逆等，「不動」等是後二善根，準此可知。",
        "translation": "Regression refers to the five heinous sins of retrogression, and immovable and so forth are the last two good roots, which can be understood in terms of these.",
        "source": "T33n1717_007:0862b11_0"
    },
    {
        "source_sentence": "次釋名中頂法望煖於動等並得頂名，復有餘師應云下也。",
        "translation": "Next, he explains that the names of the top dharmas in the name are derived from the view that heat and warmth are associated with motion and so forth, and there are other masters who say it's below.",
        "source": "T33n1717_007:0862b12_1"
    },
    {
        "source_sentence": "又前於動等名之為住，復有餘師名不久住及或無難等，若至忍不復名退。",
        "translation": "Further, there are other masters who call it abiding for a short time or sometimes for no difficulty. If one reaches patience and no longer calls it retrogressing.",
        "source": "T33n1717_007:0862b13_2"
    },
    {
        "source_sentence": "三明頂法觀中，又二：先釋，次料簡。",
        "translation": "In the three explanations of the contemplation of the top of the Dharma, there are two more: first, an explanation, and then a summary.",
        "source": "T33n1717_007:0862b15_3"
    },
    {
        "source_sentence": "初文先明能信之觀，次「此信」下明所緣之境。",
        "translation": "The first text first explains the contemplation that can be believed, and the second section, This faith, next explains the perceptual objects that are the perceptual objects.",
        "source": "T33n1717_007:0862b16_4"
    },
    {
        "source_sentence": "次「問」下料簡：先問，次答。",
        "translation": "Next, under questions, he summarizes them: first, he asks a question, and then he answers it.",
        "source": "T33n1717_007:0862b17_5"
    },
    {
        "source_sentence": "答中先標二諦為勝，次「清淨」下所緣行相。",
        "translation": "In the answer, he first labels the two truths as superior, and then under pure, he refers to the characteristics of conditioned actions.",
        "source": "T33n1717_007:0862b17_6"
    },
    {
        "source_sentence": "初句總舉二諦無過，次句略舉滅下二行，具足總合舉其八行。",
        "translation": "The first sentence summarizes the two truths without error, and the second sentence briefly enumerates the next two practices below cessation, which are fully summarized as eight practices.",
        "source": "T33n1717_007:0862b18_7"
    },
    {
        "source_sentence": "「能生」下明生信意。",
        "translation": "Under able to give rise, he explains the intention to give rise to faith.",
        "source": "T33n1717_007:0862b20_8"
    },
    {
        "source_sentence": "「若世尊」下重釋信意，以苦集不可信故，故信道滅。",
        "translation": "If the Bhagavān explains faith again, it means that because suffering and accumulation are unfaithful, the path of faith ceases.",
        "source": "T33n1717_007:0862b20_9"
    },
    {
        "source_sentence": "「此煩惱」下總舉苦集行相不可生信。",
        "translation": "Under these afflictions, we'll summarize the characteristics of suffering, accumulation, and practice that can't give rise to faith.",
        "source": "T33n1717_007:0862b21_10"
    },
    {
        "source_sentence": "「受化者」下重舉道滅是可信故。",
        "translation": "Under those who receive instruction, he repeats that the path and cessation are believable.",
        "source": "T33n1717_007:0862b22_11"
    },
    {
        "source_sentence": "復有說者，應盡信四者由知苦集故能信道滅。",
        "translation": "It is further said: “Four should be abandoned through faith”: Because they know frustration and the origin, they are able to believe in the cessation of the path.",
        "source": "T33n1717_007:0862b23_12"
    },
    {
        "source_sentence": "論問亦信諦何故但說信寶耶者？",
        "translation": "Why does the treatise ask why it's only said to be faith in the treasure of faith?",
        "source": "T33n1717_007:0862b24_13"
    },
    {
        "source_sentence": "由向對三寶以立四諦，是故作此問也。",
        "translation": "Because the four truths are established by facing the three treasures, this is why he asks this question.",
        "source": "T33n1717_007:0862b25_14"
    },
    {
        "source_sentence": "論云：「有說：彼摩納婆非不信苦集諦，但不信三寶，以不信故，佛為彼說。」",
        "translation": "The treatise says, Some say, That Manabha doesn't believe in the noble truth of suffering and accumulation but doesn't believe in the three treasures; it's because he doesn't believe that the Buddha teaches them.",
        "source": "T33n1717_007:0862b26_15"
    },
    {
        "source_sentence": "即初文是。",
        "translation": "That's the first text.",
        "source": "T33n1717_007:0862b28_0"
    },
    {
        "source_sentence": "復有說者，隨行者悅適，即「但隨」已下文是。",
        "translation": "Furthermore, there's a teaching that those who follow it are delighted with what they do, which is the following sentence after simply following.",
        "source": "T33n1717_007:0862b28_1"
    },
    {
        "source_sentence": "四釋法名退中，先問如文。",
        "translation": "In the fourth explanation of the names of the teachings, he first asks questions as explained in the text.",
        "source": "T33n1717_007:0862b29_2"
    },
    {
        "source_sentence": "答文者，以行在頂則身中煩惱數起是念，恐至忍已無復生處，以激行者頂法觀門，",
        "translation": "The text of the answer is that when practice is at the top, this thought arises in the body as a number of afflictions, and it's feared that there's no place to be born again after forbearance. It's because he encourages practitioners to cultivate the approach of contemplation of the Dharma at the top of his head.",
        "source": "T33n1717_007:0862b29_3"
    },
    {
        "source_sentence": "是故文中具有二意：一者為煩惱退故憂惱，二者恐退失故，故復憂惱。",
        "translation": "Therefore, the text has two meanings: first, grief and vexation because of the retrogression of the afflictions; second, further grief and vexation because of the fear of loss.",
        "source": "T33n1717_007:0862c02_4"
    },
    {
        "source_sentence": "「若能」下明不退兩緣：一者外善友等，二者內正觀也。",
        "translation": "If they can, the following explains the two conditions of nonretrogression: first, external good friends and so forth, and second, internal correct contemplation.",
        "source": "T33n1717_007:0862c04_5"
    },
    {
        "source_sentence": "餘文可見。",
        "translation": "The rest of the text shows this.",
        "source": "T33n1717_007:0862c05_6"
    },
    {
        "source_sentence": "次釋忍法者，今文總云「三十二心」者是。",
        "translation": "Next, he explains the teaching of forbearance, which is summarized in the present text as the thirty-two mental states.",
        "source": "T33n1717_007:0862c05_7"
    },
    {
        "source_sentence": "有本云「四十二心」者誤，上下四諦各十六行，故三十二。",
        "translation": "There's an error in the text that says forty-two mental states, because there are sixteen practices in each of the four higher and lower truths, so there are thirty-two.",
        "source": "T33n1717_007:0862c06_8"
    },
    {
        "source_sentence": "今文從略。",
        "translation": "The present text follows the abbreviation.",
        "source": "T33n1717_007:0862c08_9"
    },
    {
        "source_sentence": "但總相從緣一時論減，次減一緣至二行一緣在，皆名中忍；",
        "translation": "However, the general characteristic marks are discussed as decreasing at one time by means of conditions. The next is that they decrease from one condition as supporting object up to twofold and one condition as supporting object. All these are called ‘middle patience’.",
        "source": "T33n1717_007:0862c08_10"
    },
    {
        "source_sentence": "至一行一緣在，方名上忍。",
        "translation": "Only when there's a single condition in one line, it's called superior forbearance.",
        "source": "T33n1717_007:0862c09_11"
    },
    {
        "source_sentence": "言「但作二心觀於一行」者，《婆沙》云：「減至苦法忍後心得正決定，",
        "translation": "The phrase simply observing one practice with two minds means that the Vibhāṣā council says, After tolerating suffering as a result of forbearance, the mind is correctly determined,",
        "source": "T33n1717_007:0862c10_12"
    },
    {
        "source_sentence": "彼四心同一行一緣，所謂增上忍，如似世第一法中苦法忍、苦法智二心同緣。」",
        "translation": "These four mental states are the same in terms of one practice and one condition as the so-called superior forbearance, which resembles the two mental states of tolerance of suffering and cognition of suffering in the world's highest dharma.",
        "source": "T33n1717_007:0862c11_13"
    },
    {
        "source_sentence": "今更依《俱舍》略出之。",
        "translation": "Now, we'll briefly explain it according to the Kusāya.",
        "source": "T33n1717_007:0862c13_14"
    },
    {
        "source_sentence": "論云：「從此生煖法者，謂從總相念住後成就已生煖法名，聖道如火能燒惑薪，",
        "translation": "The name “factor warmth” is that which arises from this”: It is the name of a factor warmth produced after having been accomplished subsequently to being abiding in mindfulness of the general characteristic marks.",
        "source": "T33n1717_007:0862c14_15"
    },
    {
        "source_sentence": "聖火前相故名為煖，已觀四諦脩十六行名煖位也。",
        "translation": "It is called warmth because it is preceded by the characteristics of the holy fire. Having observed the four truths and cultivated the sixteen aspects, it is called the state of warmth.",
        "source": "T33n1717_007:0862c16_16"
    },
    {
        "source_sentence": "此善根分位長故，能具觀四諦及能具脩十六行，觀無常苦空無我，乃至道如行出。",
        "translation": "Because these roots of merit are long in duration, they are able to contemplate the four truths and can cultivate the sixteen aspects. They contemplate impermanence, suffering, emptiness, and non-self, up to ascertainment of the path as a phenomenon.",
        "source": "T33n1717_007:0862c17_17"
    },
    {
        "source_sentence": "次辨頂位者，從此頂善根有下中上，至成滿時有善根名為頂，亦觀四諦脩十六行同前煖位。",
        "translation": "“The next one identifies the state of summit”: From this summit, there are good roots with minor, middle and excessive [factors]. At the moment of becoming perfected, there are these roots of merit called ‘ summit’. Also, when observing the four noble truths, one cultivates sixteen aspects®*°; it is the same as the previous state of warmthTM",
        "source": "T33n1717_007:0862c19_18"
    },
    {
        "source_sentence": "煖頂二善俱名動善，可退動故。",
        "translation": "The two wholesome minds of warmth and summit are both said to be good because they can be displaced.",
        "source": "T33n1717_007:0862c21_19"
    },
    {
        "source_sentence": "動善根中頂為最勝，如人頂故名為頂法。",
        "translation": "The top of the one who moves among the roots of merit is the most superior. Because it is like the top of a human being, it is called ‘factor summit’.",
        "source": "T33n1717_007:0862c22_20"
    },
    {
        "source_sentence": "忍位是進，煖位是退，此頂是進退兩際，猶如山頂，故名為頂。」",
        "translation": "The stage of forbearance is advancement, the stage of warmth is retrogression, and this peak is the two extremes of advancement and retrogression, just like the top of a mountain; therefore, it's called the peak.",
        "source": "T33n1717_007:0862c23_21"
    },
    {
        "source_sentence": "頌云：「如是二善根皆初法後四」者，煖頂二善初安足時皆唯法念，後增進時則通四念。",
        "translation": "The verse says, Thus, these two good roots are all the first and last four of the first dharma. This means that when the second good root of warmth is first at rest, it's only mindful of the Dharma, and when it advances later, it's shared with the four kinds of mindfulness.",
        "source": "T33n1717_007:0862c24_22"
    },
    {
        "source_sentence": "初安足者謂煖，八諦十六行相最初遊踐四聖諦跡名初安足，謂見道中唯法念住，",
        "translation": "The first footing of ease is warmth. At the beginning of the sixteen aspects of the eight truths, when one wanders in the four noble paths, this is called the first footing of ease. That is to say, in the path of vision, there is only the abode of mindfulness on factors:",
        "source": "T33n1717_007:0862c26_23"
    },
    {
        "source_sentence": "以煖頂位順見道故，故初安足唯法念住；",
        "translation": "Because the state of warmth and summit is conformable to the path of vision, the first footstool is the abode of mindfulness on factors only.",
        "source": "T33n1717_007:0862c28_24"
    },
    {
        "source_sentence": "後增進位稍容預故，故得通脩四念住位。",
        "translation": "Because later stages of advancement allow for a slight advancement, they are therefore able to cultivate the four states of abiding mindfulness.",
        "source": "T33n1717_007:0862c29_25"
    },
    {
        "source_sentence": "忍唯法念住者，從頂有善根生，名為法忍。",
        "translation": "“Forbearance is only with the one abiding by application of mindfulness on factors”: Produced from the summit, there are roots of merit called ‘patience on factors’.",
        "source": "T33n1717_007:0863a01_26"
    },
    {
        "source_sentence": "忍可四諦，最殊勝故。",
        "translation": "Patience can be the most distinguished of the four truths.",
        "source": "T33n1717_007:0863a02_27"
    },
    {
        "source_sentence": "又無退故名為忍法。",
        "translation": "Also, because there's no retrogression, it's called the method of forbearance.",
        "source": "T33n1717_007:0863a03_0"
    },
    {
        "source_sentence": "忍初安足及後增進皆法念住，近見道故，是故初後皆法念住。",
        "translation": "The first stage of patience, the one with legs settled and the second stage of advancement - all abide in mindfulness on factors: because they are proximate to the path of vision. That is why the first stage and the subsequent one - all abide in mindfulness on factors.",
        "source": "T33n1717_007:0863a03_1"
    },
    {
        "source_sentence": "頌云：「下中忍同頂」者，此善根有下中上，下中二位同煖頂位，具觀四諦十六行，",
        "translation": "The verse says, For the lower and middle forms of forbearance are the same as the top: because these roots of goodness have inferior, middling, and superior. The inferior, middling, two states are the same as the summit of warmth. They all observe the sixteen aspects of the four truths.",
        "source": "T33n1717_007:0863a04_2"
    },
    {
        "source_sentence": "上忍唯觀欲苦。",
        "translation": "The higher level of forbearance only observes the suffering of desire.",
        "source": "T33n1717_007:0863a06_3"
    },
    {
        "source_sentence": "頌云：「一行一剎那」者，上忍唯苦下一行一剎那名為上忍。",
        "translation": "The verse says, One line of one moment means that the superior forbearance is only painful, and the next line of one moment is called superior forbearance.",
        "source": "T33n1717_007:0863a07_4"
    },
    {
        "source_sentence": "下品具足觀十六諦，中品減緣。",
        "translation": "The lower one is supplied with the contemplation of the sixteen truths; the middle one has decreased supporting object.",
        "source": "T33n1717_007:0863a08_5"
    },
    {
        "source_sentence": "所言緣者，上下八諦名之為緣，是所緣故，各十六行故三十二名之為行，",
        "translation": "The eight higher and lower truths are called ‘causal conditions’ because they are the supporting object. Because each has sixteen aspects, the thirty-two are called ‘practices’.",
        "source": "T33n1717_007:0863a09_6"
    },
    {
        "source_sentence": "能緣行故。",
        "translation": "It's because it can be conditioned by volition.",
        "source": "T33n1717_007:0863a10_7"
    },
    {
        "source_sentence": "應知七周減緣，二十四周減行，謂四行觀欲苦，乃至四行觀欲道，乃至三行觀上界道，",
        "translation": "It should be known that seven forms have as supporting object a decrease in circumference and twenty-four forms are with a decrease in circumference: the fourfold contemplation on frustration of sexual passion up to the fourfold contemplation on the path of sexual passion up to the threefold contemplation on the path of the higher realm.",
        "source": "T33n1717_007:0863a11_8"
    },
    {
        "source_sentence": "名一周減一行。",
        "translation": "It's called a week that's reduced by one line.",
        "source": "T33n1717_007:0863a13_9"
    },
    {
        "source_sentence": "如是一一諦下各有三行，與緣名異，從行為名，故三八二十四周減行。",
        "translation": "Thus, under each of the truths one by one, there are three aspects. The name is different from the name given to it as supporting object: because of the names given to it by reason of its aspect. That is why the three, eight, twenty-four and circumference®*!",
        "source": "T33n1717_007:0863a13_10"
    },
    {
        "source_sentence": "一一諦下各有一行與緣名同，亦與緣同減，從緣為名但名減緣，是則上界四諦，",
        "translation": "These are the four truths of the higher sphere.",
        "source": "T33n1717_007:0863a15_11"
    },
    {
        "source_sentence": "下界留苦，唯減三緣，上四下三名為七周。",
        "translation": "The lower sphere is with unpleasantness: only three reasons for the reduction of unsatisfactoriness. The upper four and the lower three are said to be seven circumferences.",
        "source": "T33n1717_007:0863a17_12"
    },
    {
        "source_sentence": "緣之與行皆從後減，故使欲界最後留苦，都有三十一周減緣減行，後但有一行二剎那心觀於欲苦名中忍滿，",
        "translation": "Conditioned by these and conditioned by volition, they all decrease from the latter. Therefore, it is so that in the last moment of abiding in unsatisfactoriness in the realm of sexual passion, there are thirty-eight periods of decreasing conditioned and diminishing conditioned volitions. Thereafter, only one line or two moments arise:",
        "source": "T33n1717_007:0863a18_13"
    },
    {
        "source_sentence": "唯有一行一剎那心觀於欲苦名上忍成就。",
        "translation": "There's only one line of mind that observes the suffering of desire for a single moment, which is called the accomplishment of superior forbearance.",
        "source": "T33n1717_007:0863a20_14"
    },
    {
        "source_sentence": "此中忍位未減道時，雖減行相，未減道故，故得具觀四種諦也。",
        "translation": "At the moment of the state of patience, there is no decrease in the path. Although one reduces the characteristic marks of conditioned forces, because they are not yet with a decrease in the path, it is possible to observe all four kinds of noble truths.",
        "source": "T33n1717_007:0863a21_15"
    },
    {
        "source_sentence": "頌云：「下中忍同頂」者，約此說也。",
        "translation": "The verse says, The lower level of forbearance is the same as the top, which refers to this explanation.",
        "source": "T33n1717_007:0863a23_16"
    },
    {
        "source_sentence": "若此中忍減道諦時但脩十二行，既減彼道心無欣慕，故彼道下四行亦不起得。",
        "translation": "If these twelve aspects are cultivated only at the moment when patience diminishes the truth of the path, then having diminished this awareness of the path, there is no longing for it. That is why the four aspects below the path also do not produce acquisition.",
        "source": "T33n1717_007:0863a24_17"
    },
    {
        "source_sentence": "由此道理，減滅諦時但脩八行，除滅道下各四行故；",
        "translation": "Consequently, when one cultivates the truth of cessation by reducing it, only eight aspects are cultivated: exception made for the four aspects below cessation and path.",
        "source": "T33n1717_007:0863a26_0"
    },
    {
        "source_sentence": "減集諦時但脩四行，故於中忍具脩十六、十二、八、四行相，於上忍中亦脩四行，",
        "translation": "When one cultivates only four aspects at the moment of decreasing the truth of the origin, therefore patience is supplied with sixteen, twelve, eighth and four aspects. In higher patience, also four aspects are cultivated:",
        "source": "T33n1717_007:0863a27_1"
    },
    {
        "source_sentence": "雖起一行一剎那心以觀苦故起能得，得脩彼苦下四行相故。",
        "translation": "Even though it produces a mind of one row and one ksana that observes suffering, it produces the capability to attain it because it can cultivate the four characteristics of these lower forms of suffering.",
        "source": "T33n1717_007:0863a29_2"
    },
    {
        "source_sentence": "問：於上忍位減彼三行，何故脩彼所減行耶？",
        "translation": "Question: In the state of higher patience, these three aspects are to be reduced. Why do they develop these limited aspects?",
        "source": "T33n1717_007:0863b01_3"
    },
    {
        "source_sentence": "答：雖減彼行，不減諦故、欣慕心故，故得脩彼所減行相。",
        "translation": "Answer: Although these formations are reduced, it is because of not decreasing the truths and because of being with an awareness of attachment that they can develop the characteristic marks of these limited formations.",
        "source": "T33n1717_007:0863b02_4"
    },
    {
        "source_sentence": "於中忍位脩所減行，準望可知。",
        "translation": "The cultivation of the state of forbearance and the practices that are reduced within it can be discerned in this way.",
        "source": "T33n1717_007:0863b04_0"
    },
    {
        "source_sentence": "於三十二中留苦下一行者，擬入見道，故須留也。",
        "translation": "In the thirty-two, the lower line that leaves suffering is intended to enter the path of seeing, so it must be left.",
        "source": "T33n1717_007:0863b04_1"
    },
    {
        "source_sentence": "餘三十一如文次第，漸漸除之。",
        "translation": "The other thirty-one are gradually removed in order as described in the text.",
        "source": "T33n1717_007:0863b06_0"
    },
    {
        "source_sentence": "問：苦下一行為留何行？",
        "translation": "Question: In the one below frustration, what form of proceeding does it abide in?",
        "source": "T33n1717_007:0863b06_1"
    },
    {
        "source_sentence": "答：入見道有二種行者，一者利，是見行。",
        "translation": "Answer: “Entry into the path of vision has two forms of proceeding”: One is for profit.",
        "source": "T33n1717_007:0863b07_2"
    },
    {
        "source_sentence": "見行有二種：若著我者，留無我行；",
        "translation": "Views and formations are of two kinds: those attached to a self, leave the formation without self.",
        "source": "T33n1717_007:0863b08_3"
    },
    {
        "source_sentence": "若著我所，即留空行。",
        "translation": "If someone were to cling to self and what belongs to self, they would remain in the practice of emptiness.",
        "source": "T33n1717_007:0863b09_4"
    },
    {
        "source_sentence": "二者鈍，是愛行，愛行亦二：一者慢多，留無常行；",
        "translation": "The second is the one of dullness, which is conditioned by thirst. Conditioned by thirst there are also two:",
        "source": "T33n1717_007:0863b09_5"
    },
    {
        "source_sentence": "二者懈怠多，留於苦行。",
        "translation": "The second is that they are often lazy and leave behind the practice of austerities.",
        "source": "T33n1717_007:0863b10_6"
    },
    {
        "source_sentence": "頌云：「世第一亦然」者，從上忍無間生第一，唯緣苦下一行一剎那心同前上忍，",
        "translation": "The verse says, So it is with the highest worldly forbearance. This means that the highest forbearance arises immediately after the higher forbearance because only one row of a single moment of thought under suffering is the same as the previous higher forbearance.",
        "source": "T33n1717_007:0863b11_7"
    },
    {
        "source_sentence": "故云「亦然」。",
        "translation": "That's why it's said, So it is.",
        "source": "T33n1717_007:0863b13_8"
    },
    {
        "source_sentence": "此是有漏故名「世間」，於中最勝故云「第一」，有同類因引見道生，",
        "translation": "This is called the world because it's contaminated. It's called the first because it's the most superior, and there are similar causes that lead to the birth of the path of seeing.",
        "source": "T33n1717_007:0863b13_9"
    },
    {
        "source_sentence": "故云「最勝」。",
        "translation": "That's why it's called most excellent.",
        "source": "T33n1717_007:0863b14_10"
    },
    {
        "source_sentence": "皆慧為體，皆五陰性定共戒名為色陰，餘四陰可知。",
        "translation": "They all have wisdom as their essence. All are said to be the aggregate matter by reason of the nature of the five aggregates, samdhi and common moral precepts. The other four aggregates can be discerned.",
        "source": "T33n1717_007:0863b15_11"
    },
    {
        "source_sentence": "言「苦法忍」者，十六剎那從苦諦起一忍一智，如其次第至道諦時初生一忍名十五心，",
        "translation": "The expression patience regarding the law in relation to suffering means that sixteen kṣaṇas give rise to one forbearance and one knowledge from the truth of suffering at sixteen kṣaṇas.",
        "source": "T33n1717_007:0863b16_12"
    },
    {
        "source_sentence": "次生一智名十六心滿，即初果也。",
        "translation": "The next arising of one knowledge is called ‘complete with sixteen awarenesses’: this exactly is the first fruit.",
        "source": "T33n1717_007:0863b18_13"
    },
    {
        "source_sentence": "於中三：先法，次譬，三料簡。",
        "translation": "There are three of these: the first is the teaching, the second is an example, and the third is a summary.",
        "source": "T33n1717_007:0863b19_14"
    },
    {
        "source_sentence": "初文如向。",
        "translation": "The first text follows as we've shown.",
        "source": "T33n1717_007:0863b19_15"
    },
    {
        "source_sentence": "次譬，譬中先譬、次合。",
        "translation": "The next metaphor is a metaphor, in which the first metaphor and the second are combined.",
        "source": "T33n1717_007:0863b20_0"
    },
    {
        "source_sentence": "譬中云「如人欲從己國」等者，三界為己國，涅槃為他國。",
        "translation": "The metaphor says, Suppose someone wants to follow their own country, and so forth, the three realms are their own country and nirvāṇa is another country.",
        "source": "T33n1717_007:0863b20_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T33n1717_007:0863b21_2"
    },
    {
        "source_sentence": "三界久住為己，涅槃方適為他。",
        "translation": "The long abiding of the three realms is self, and nirvāṇa is only appropriate for others.",
        "source": "T33n1717_007:0863b21_3"
    },
    {
        "source_sentence": "十六觀法為「多財產」，一行獨往故云「不能持去」。",
        "translation": "The sixteen contemplations of the Dharma are many possessions, and one line goes alone; therefore, it's called unable to carry them away.",
        "source": "T33n1717_007:0863b22_4"
    },
    {
        "source_sentence": "中忍如錢，上忍如金，世第一法如多價寶，以一行一剎那入真無漏，猶如持去。",
        "translation": "The middle form of forbearance is like money, the higher form of forbearance is like gold, and the world's highest dharma is like a high-priced treasure that enters into the true and uncontaminated with one line at a single moment, just as if it were to be taken away.",
        "source": "T33n1717_007:0863b23_5"
    },
    {
        "source_sentence": "三「問」下料簡，先問、次答。",
        "translation": "Third, under questions, he summarizes the first question and then answers it.",
        "source": "T33n1717_007:0863b25_6"
    },
    {
        "source_sentence": "次「世第一法者」下歎第一義，先立全勝，次「亦分」下分別不同得名處別，",
        "translation": "Next, under The Supreme Worldly Good Dharma, he praises the first meaning and first establishes its complete superiority. Next, under Also divided into parts, he discerns the distinction between different names and places of attainment.",
        "source": "T33n1717_007:0863b26_7"
    },
    {
        "source_sentence": "先立二門、次釋。",
        "translation": "First, he establishes two aspects and then explains them.",
        "source": "T33n1717_007:0863b27_8"
    },
    {
        "source_sentence": "釋中先釋分，次釋都。",
        "translation": "In the explanation, he first explains the parts, and then he explains the whole.",
        "source": "T33n1717_007:0863b28_9"
    },
    {
        "source_sentence": "初文云「見諦不相離」者，第十六心為見諦，餘十五心為眷屬，無間續起故云「不離」，",
        "translation": "The first text says, Not separated from each other in terms of seeing the truths because the sixteenth mental state is seeing the truths and the other fifteen mental states are their followers, which continue to arise without interruption.",
        "source": "T33n1717_007:0863b28_10"
    },
    {
        "source_sentence": "是斷惑位故慧力偏多。",
        "translation": "Because it's the stage of stopping afflictions, the power of wisdom is partial and numerous.",
        "source": "T33n1717_007:0863c01_11"
    },
    {
        "source_sentence": "從見諦後至第三果，熏禪成就生五淨居，此之五天純聖所居，故云「不與凡夫同生一處」。",
        "translation": "From the third realization after seeing the truth up to the third realization, the accomplishment of permeation and meditation gives rise to the five pure abodes, where these five heavens are purely noble abodes, so it's called not being born in the same place as worldlings.",
        "source": "T33n1717_007:0863c02_12"
    },
    {
        "source_sentence": "至第四果得盡智時，永斷界內思惑垢障，如是後果並由見諦之功，故見諦最勝。",
        "translation": "At the moment of the acquisition of the knowledge of destruction at the fourth fruit, one absolutely abandons the impure obstacle of the defilement of the mental disturbances of the realm of sexual passion. In this way, the subsequent fruit is also due to the power vision of the truths:",
        "source": "T33n1717_007:0863c04_13"
    },
    {
        "source_sentence": "次「三三昧」去，舉況釋也。",
        "translation": "Next, the three samādhis are removed, which are explained by citing circumstances.",
        "source": "T33n1717_007:0863c06_14"
    },
    {
        "source_sentence": "如世第一心得三三昧厭離一切，於無漏法心尚不取，故云「惡賤」。",
        "translation": "Suppose the world's first mind is disillusioned with the three samādhis and becomes disillusioned with all, but its mind doesn't grasp the uncontaminated dharmas, so it's called bad and inferior.",
        "source": "T33n1717_007:0863c06_15"
    },
    {
        "source_sentence": "「何況有漏不應都勝」者，結上世第一也。",
        "translation": "How could it be that the contaminants shouldn't all be superior? This concludes with the first of the above-mentioned.",
        "source": "T33n1717_007:0863c08_16"
    },
    {
        "source_sentence": "言「分勝」者，不能都勝見諦之法，但分勝彼煖頂等法，故世第一亦名分勝。",
        "translation": "The expression partial superior refers to the fact that they can't overpower all the teachings of the truth of views, but they are only partially superior to those teachings like warmth and so forth, so the first in the world is also called partial superior.",
        "source": "T33n1717_007:0863c09_17"
    },
    {
        "source_sentence": "「除入」者，勝處也。",
        "translation": "The phrase except for entry refers to the superior place.",
        "source": "T33n1717_007:0863c10_18"
    },
    {
        "source_sentence": "又云都勝者，從功能為名，此世第一非但勝於煖頂等法，亦勝見諦等法。",
        "translation": "Also, it's called superior because of its function as the name. The first in this world isn't only superior to such things as the warmth peak and so forth, but also superior to such things as the seeing truths.",
        "source": "T33n1717_007:0863c11_19"
    },
    {
        "source_sentence": "等者，等取脩道智行等法，乃至羅漢能開之功在世第一，故曰「都勝」。",
        "translation": "Equality refers to equally grasping the path of cultivation, such things as wisdom and practice, up to the point where the arhat who can reveal them is the best in the world, so it's called superior.",
        "source": "T33n1717_007:0863c12_20"
    },
    {
        "source_sentence": "故從「或言」下釋都勝，據功用力強，非所證亦勝。",
        "translation": "Therefore, it's explained that they are all superior according to the power of their exertion, not because what they realize is also superior.",
        "source": "T33n1717_007:0863c14_21"
    },
    {
        "source_sentence": "「問前諸位義有差別耶」者？",
        "translation": "The question is, Are there distinctions in the meanings of the previous stages?",
        "source": "T33n1717_007:0863c15_22"
    },
    {
        "source_sentence": "前已最勝得妙果等名通釋世第一法，今欲分別，故先問起。",
        "translation": "In the past, such names as the most excellent attainment of marvelous results and so forth were generally explained as the first worldly dharma, but now I want to distinguish them, so I'll ask about their arising.",
        "source": "T33n1717_007:0863c16_23"
    },
    {
        "source_sentence": "答如文。",
        "translation": "The answer is as explained in the text.",
        "source": "T33n1717_007:0863c17_24"
    },
    {
        "source_sentence": "此不淨安般等並在世第一前，故世第一於彼為勝為最等，依地亦然。",
        "translation": "Because these impure and such [things] as breathing in and breathing out are both first in the world. Therefore, the first worldly one is superior to them and the highest among them. The same applies to the stage of support.",
        "source": "T33n1717_007:0863c17_25"
    },
    {
        "source_sentence": "次從「又依未至為最」去料簡依地，從未至至四禪為六地，妙音師說或七，",
        "translation": "Next, it's from the stage of depending on what's yet to be reached as the highest and following the stage of depending on what's not yet reached up to the fourth dhyāna as the sixth stage. The master Miaoyin teaches that it's sometimes seven,",
        "source": "T33n1717_007:0863c19_26"
    },
    {
        "source_sentence": "加欲界。",
        "translation": "It's applied to the desire realm.",
        "source": "T33n1717_007:0863c21_27"
    },
    {
        "source_sentence": "依欲界身，天六人三，除北洲，前三善根，三洲死生六天亦續生故。",
        "translation": "Depending on the body of the realm of sexual passion, gods and six persons are threefold: exception made for the northern continent. The first three roots of merit - because in three continents there is rearising at death and with six gods as well.",
        "source": "T33n1717_007:0863c21_28"
    },
    {
        "source_sentence": "第四善根天亦初起，唯女男身非餘扇搋。",
        "translation": "The fourth heaven of the roots of good is also produced for the first time: only the bodies of female and male beings are not endowed with other sexual passions.",
        "source": "T33n1717_007:0863c22_29"
    },
    {
        "source_sentence": "頌云：「聖由失地捨，異生由命終，煖必至涅槃，頂終不斷善，忍不墮惡道，",
        "translation": "The Āryan loses the state of absorption at the end of his life, whereas a Prṛthagjana enters nirvana at the end of his life. At the end of his existence, he does not abandon the good deeds; he endures them and does not fall into evil states.",
        "source": "T33n1717_007:0863c23_30"
    },
    {
        "source_sentence": "第一入離生。」",
        "translation": "The first enters into freedom from birth.",
        "source": "T33n1717_007:0863c25_31"
    },
    {
        "source_sentence": "委釋如論。",
        "translation": "They are explained in detail as discussed in the treatise.",
        "source": "T33n1717_007:0863c25_32"
    },
    {
        "source_sentence": "次明初果，「八忍八智」者，每一諦下各一法忍一法智、一比忍一比智，",
        "translation": "Next, it's explained that the first realization, eight kinds of patience and eight kinds of cognition, is that under each truth, there's one forbearance of a teaching, one knowledge of a teaching, one inference, one forbearance, and one inference.",
        "source": "T33n1717_007:0863c26_0"
    },
    {
        "source_sentence": "故四諦下八忍八智，此是無漏一十六心斷四諦下見盡也。",
        "translation": "Therefore, these are the eight kinds of forbearance and eight kinds of cognition below the four truths, which are the uncontaminated cessation of views below the four truths with one or sixteen mental states.",
        "source": "T33n1717_007:0863c27_1"
    },
    {
        "source_sentence": "次明三果者，「慮」謂思慮，重思惟前所得真諦無漏之理，或四諦中隨思一諦，",
        "translation": "The next clarification of the three fruits is that deliberation refers to deliberation, which repeatedly reflects on the previously attained uncontaminated principle of the true truth or one of the four noble truths as they are contemplated.",
        "source": "T33n1717_007:0863c28_2"
    },
    {
        "source_sentence": "或唯思滅諦，斷三界諸品不同、得後三果，六品九品三界都盡等。",
        "translation": "Or, it is only with the truth of cessation through reasoning that one abandons the three realms. The different grades of annihilation and the acquisition of the last three fruits are acquired:",
        "source": "T33n1717_007:0864a01_3"
    },
    {
        "source_sentence": "九地中一一皆有九品思惑，一一品皆用一無礙一解脫，從一地說，餘地例然，",
        "translation": "In each of the nine stages there are nine classes of defilement through reasoning. Each class uses one form of unobstructed liberation. It is spoken of from one stage:",
        "source": "T33n1717_007:0864a03_4"
    },
    {
        "source_sentence": "故但云九。",
        "translation": "That's why it's only called nine.",
        "source": "T33n1717_007:0864a04_5"
    },
    {
        "source_sentence": "次支佛以苦集為總，十二因緣為別，若逆若順具如《止觀》第二記。",
        "translation": "The next branch buddha takes suffering and accumulation as the general and the twelve causes and conditions as the specific, which are described in the second record of Cessation and Contemplation whether adverse or adverse.",
        "source": "T33n1717_007:0864a05_6"
    },
    {
        "source_sentence": "及前四果，廣如《俱舍．賢聖品》。",
        "translation": "These and the first four fruits are as detailed as in the chapter ‘Kukkuṣa,’ “Good and holy” of the Abhidharma.",
        "source": "T33n1717_007:0864a06_7"
    },
    {
        "source_sentence": "次三祇菩薩，具如《止觀》第三記。",
        "translation": "The next three bodhisattvas are as described in the third entry in the Zhiguan jing.",
        "source": "T33n1717_007:0864a07_8"
    },
    {
        "source_sentence": "次「通教聲聞緣覺於一門總相」等者，總謂但作苦集觀耳。",
        "translation": "The next phrase, Shared Teaching the general characteristics of śrāvakas and pratyekbuddhas in one aspect, etc., generally means simply observing suffering and accumulation.",
        "source": "T33n1717_007:0864a08_9"
    },
    {
        "source_sentence": "別謂觀苦七支、觀集五支，以自行故但依一門，菩薩為他故於四門。",
        "translation": "They are separately said to be the seven members of the contemplation on frustration and the five members of the one on the origin. Because they proceed by themselves, they only depend on one aspect: because bodhisattvas act for others in relation to four aspects.",
        "source": "T33n1717_007:0864a09_10"
    },
    {
        "source_sentence": "然七地前約自行邊亦但一門，入假方便亦須遍習。",
        "translation": "However, before the seventh stage, there is also only one aspect in relation to self-reliance: entering what is conventional and expedient also requires pervasive cultivation.",
        "source": "T33n1717_007:0864a11_11"
    },
    {
        "source_sentence": "三藏佛言「一時用八忍八智」等者，具如《止觀》第三記料簡同異。",
        "translation": "The Sanzang Buddha's statement that the eight tolerances and eight kinds of cognition are used at one time is as explained in the third record of Zhiguan, which summarizes similarities and differences.",
        "source": "T33n1717_007:0864a12_12"
    },
    {
        "source_sentence": "通佛但言「斷習」者，以菩薩時留習潤生故，至菩提樹下但斷殘習。",
        "translation": "The general Buddha only says stopping accumulation because it's because the bodhisattva retains accumulation at the time of cultivation and nourishes sentient beings when he reaches the foot of the bodhi tree but stops residual accumulation.",
        "source": "T33n1717_007:0864a13_13"
    },
    {
        "source_sentence": "別佛又二：先正釋，次「或言」下釋疑。",
        "translation": "The distinctive buddhas are also twofold: first, a correct explanation, and second, an explanation of doubt under Perhaps it's said.",
        "source": "T33n1717_007:0864a15_14"
    },
    {
        "source_sentence": "或有疑云等覺已斷一品。",
        "translation": "Some people may have doubts that it's said that the one class of equanimity has been stopped.",
        "source": "T33n1717_007:0864a16_15"
    },
    {
        "source_sentence": "此義不然，依文釋定始從初地、終至妙覺，皆惑斷入位，故斷一品入初地，",
        "translation": "This interpretation is untenable because, according to the text of the Abhidharma-mahāvibhāga, the absorption begins at the first stage and ends at the marvelous enlightenment. All the defilements are abandoned through the state of Anāgāmisaṃjñānānantyāyatana.",
        "source": "T33n1717_007:0864a16_16"
    },
    {
        "source_sentence": "斷最後品入妙覺。",
        "translation": "He stops the final chapter and enters into marvelous awakening.",
        "source": "T33n1717_007:0864a18_17"
    },
    {
        "source_sentence": "圓位具如《止觀》第七文中及位妙中，並加修五悔等，為入品之前智。",
        "translation": "The perfect stages are found in the seventh text of the Zhixiang jing, as well as in the marvelous stages and stages, and they are combined with the cultivation of the five kinds of repentance for the knowledge prior to entering the class.",
        "source": "T33n1717_007:0864a19_0"
    },
    {
        "source_sentence": "次明智照境者為三：先敘意，次料簡，三正釋。",
        "translation": "Next, it's explained that there are three kinds of people who illuminate objects with knowledge: first, they describe their thoughts, second, summarize them, and third, explain them correctly.",
        "source": "T33n1717_007:0864a20_1"
    },
    {
        "source_sentence": "初文破性計成不思議，又二：先明破計，次明立法。",
        "translation": "The first text refutes the conception of nature as inconceivable, and there are two more: first, it explains the refutation of conceptions, and second, it explains the teaching.",
        "source": "T33n1717_007:0864a21_2"
    },
    {
        "source_sentence": "初文先立性計，次略不出破，但注「云云」。",
        "translation": "The first text first establishes the conceptualization of nature and then briefly doesn't refute it, but simply says, Yun Yun Yun.",
        "source": "T33n1717_007:0864a22_3"
    },
    {
        "source_sentence": "初文「四句墮性」者，如《止觀》第三及《淨名玄》等說。",
        "translation": "The first text, Four sentences that fall into the nature of four phrases, is as explained in the third book of Zhiguan and the Jingming  xuan.",
        "source": "T33n1717_007:0864a23_4"
    },
    {
        "source_sentence": "若離性過皆不可說，故云「如別記」。",
        "translation": "If they're free of the faults of nature, they can't be explained, so it's called as described separately.",
        "source": "T33n1717_007:0864a24_5"
    },
    {
        "source_sentence": "次明為他隨機遍立四悉因緣可作四說，如《止觀》第五記。",
        "translation": "Next, it's explained that four explanations can be given for the four siddhânta causes and conditions that are universally established for others at random, as recorded in the fifth entry of Zhiguan.",
        "source": "T33n1717_007:0864a25_6"
    },
    {
        "source_sentence": "次料簡中先問中「智能照境如常所論，境亦能照智不」者，為顯不可思議，",
        "translation": "Next, in the summary, the first question asked, Can cognition illuminate objects as always discussed by wisdom and can objects also illuminate cognition? to show that it's inconceivable.",
        "source": "T33n1717_007:0864a27_7"
    },
    {
        "source_sentence": "故有此問。",
        "translation": "That's why there's this question.",
        "source": "T33n1717_007:0864a28_8"
    },
    {
        "source_sentence": "次答中三：先正答，次引證，三舉譬。",
        "translation": "Next, there are three answers: the first is a correct answer, the second one cites proof, and the third one gives an example.",
        "source": "T33n1717_007:0864a29_9"
    },
    {
        "source_sentence": "初文者，還依不思議答，故能相照。",
        "translation": "The first text is based on the inconceivable answer, so it can illuminate each other.",
        "source": "T33n1717_007:0864a29_10"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T33n1717_007:0864b01_11"
    },
    {
        "source_sentence": "智既是心，境亦是心，既俱是心、俱是法界，心心相照有何不可？",
        "translation": "Since cognition is mind, and objects are also mind, and both are mind and the Dharma realm, why wouldn't mind and mind illuminate each other?",
        "source": "T33n1717_007:0864b01_12"
    },
    {
        "source_sentence": "故引《仁王》證成相照，智處是境，當知境智俱名般若，故得說境及境照俱名實相。",
        "translation": "That's why it's cited in the Humane Kings to actualize the illumination of characteristics, and the locus of knowledge is the object. You should know that both objects and cognition are called prajñā, so you can say that both objects and objects and objects illuminating are called real characteristics.",
        "source": "T33n1717_007:0864b03_13"
    },
    {
        "source_sentence": "次譬中，鏡面如文，地生芽如境生智，芽生地如智照境，此譬猶分，未是境智體一而展轉相照相發，",
        "translation": "In the next metaphor, the surface of the mirror is as described in the text. The soil produces its sprouts like an object and thus produces knowledge. The sprouts produce the soil like knowledge that illuminates the object. This metaphor is further divided into two:",
        "source": "T33n1717_007:0864b05_14"
    },
    {
        "source_sentence": "故說不可盡，恐妨後義是故且置。",
        "translation": "Therefore, it can't be explained in full, and I'm afraid it will hinder the subsequent meaning.",
        "source": "T33n1717_007:0864b07_15"
    },
    {
        "source_sentence": "次正明智照境中，取向類智照前諸境。",
        "translation": "The next correctly explains that cognition illuminates objects, and the cognition of attachment to types illuminates the previous objects.",
        "source": "T33n1717_007:0864b08_16"
    },
    {
        "source_sentence": "前智類中三藏有七、通教有五、別圓各四。",
        "translation": "In the previous category of wisdom, there were seven in the Tripiṭaka, five in the Shared Teaching, and four in each of the distinctive and perfect.",
        "source": "T33n1717_007:0864b09_17"
    },
    {
        "source_sentence": "文云「七智照二乘十如」者，三藏四：謂一五停四念，二四善根，三四果，",
        "translation": "The text says, Seven kinds of wisdom illuminate the ten thusnesses of the two vehicles. This refers to the three collections of four: one, five, stopping four thoughts, two, four good roots, three, and four fruits.",
        "source": "T33n1717_007:0864b10_18"
    },
    {
        "source_sentence": "四支佛。",
        "translation": "The fourth is the branch buddha.",
        "source": "T33n1717_007:0864b11_19"
    },
    {
        "source_sentence": "通教三：謂聲聞、支佛、入空菩薩。",
        "translation": "The general teachings are threefold: śrāvakas, pratyekabuddhas, and bodhisattvas who enter emptiness.",
        "source": "T33n1717_007:0864b12_20"
    },
    {
        "source_sentence": "藏通菩薩及別教四十心智皆云「兩屬」者，上求未極仍屬菩薩。",
        "translation": "The bodhisattva of the store and the forty mental cognitions of the distinct teachings all say both belong to the bodhisattva, which means that the above request hasn't yet reached its limit.",
        "source": "T33n1717_007:0864b12_21"
    },
    {
        "source_sentence": "十地亦言「兩屬」者，約教證道以分二義，又此二義謂次不次。",
        "translation": "The tenth ground also says two kinds because it's divided into two meanings according to the path of teaching and realization, and these two meanings are sequential and not sequential.",
        "source": "T33n1717_007:0864b14_22"
    },
    {
        "source_sentence": "又此二義復有上求下化二義。",
        "translation": "Furthermore, these two meanings also have the two meanings of seeking above and transforming below.",
        "source": "T33n1717_007:0864b15_23"
    },
    {
        "source_sentence": "「總略如此細捒(云云)」者，「捒」字音數，謂莊捒也。",
        "translation": "The phrase summarizing such subtle and crude (as it says) means that the word crude is a phonetic number, which means to adorn with crude.",
        "source": "T33n1717_007:0864b16_24"
    },
    {
        "source_sentence": "今謂安置，對當如莊捒也。",
        "translation": "Now, it's called placement, which should be like a adornment.",
        "source": "T33n1717_007:0864b17_25"
    },
    {
        "source_sentence": "如五停去大分有七，委細而言如五停自緣五境不同，如治貪欲但緣六道中可愛十如，",
        "translation": "Just as the five forms of cessation and the one that departs from them are generally sevenfold: in detail, they are said to be like the five kinds of cessation which have different specific conditions for the five objects.",
        "source": "T33n1717_007:0864b17_26"
    },
    {
        "source_sentence": "治瞋恚但緣六道中可憎十如，餘三例說。",
        "translation": "The antidote for hatred only has as an object the ten such [things] that are to be abhorred in the six realms of rebirth.",
        "source": "T33n1717_007:0864b20_27"
    },
    {
        "source_sentence": "四念但緣自身心陰六道無常，從煖頂去至世第一或遍上下、或捨上緣下。",
        "translation": "The fourth awareness only takes as supporting object the own-mind aggregate and six destinies of impermanence: from the summit of warmth up to the highest world, sometimes pervading what is higher or lower; sometimes rejecting what is higher for supporting object.",
        "source": "T33n1717_007:0864b21_28"
    },
    {
        "source_sentence": "四果但緣聲聞法界，緣覺但緣支佛法界，亦應分四果所照不同，支佛又分別聞法不聞法等，",
        "translation": "The four fruits are only conditioned by sravakas and pratyekabuddhas. But pratyekabuddhas are only conditioned by the factors of the dharma realm of the dharmas belonging to the members of the sangha. They should also be divided into four fruits that differ in their illumination. The members of the sangha distinguish among those who hear the Dharma and those who",
        "source": "T33n1717_007:0864b22_29"
    },
    {
        "source_sentence": "餘例可知。",
        "translation": "The rest are examples that can be understood.",
        "source": "T33n1717_007:0864b25_30"
    },
    {
        "source_sentence": "如是七智皆求拙度，故云「總略」。",
        "translation": "Thus, these seven kinds of cognition all seek clumsy liberation, so it's called summarized.",
        "source": "T33n1717_007:0864b25_31"
    },
    {
        "source_sentence": "六度細作，例此可知。",
        "translation": "The six perfections are subtly created, which can be understood by analogy here.",
        "source": "T33n1717_007:0864b26_32"
    },
    {
        "source_sentence": "次照因緣四諦中，但以當教智照當教諦文相最顯。",
        "translation": "Next, among the four truths of illuminating causes and conditions, it's only the text and characteristics of the teaching that are illuminated by the knowledge of the future teachings that are most revealed.",
        "source": "T33n1717_007:0864b26_33"
    },
    {
        "source_sentence": "次照七二諦中云「八智照顯中」者，且以別四照別，圓四照圓。",
        "translation": "Next, it's said in the two truths of illuminating the seven noble truths that the eight kinds of wisdom illuminate and reveal. This is because the four illuminations are distinct and the four illuminations are perfected by focusing on each other.",
        "source": "T33n1717_007:0864b27_34"
    },
    {
        "source_sentence": "若論相入，應以通真照通真及圓別兩真，別俗照圓真，若接通教必須聖位，",
        "translation": "If we discuss mutual entry, we should use the penetrating truth to illuminate the penetrating truth and the two distinct truths of emptiness and completion. The distinctive and the mundane to illuminate the perfect truth. If one were to receive the teaching of penetration, they would have to be in a noble state.",
        "source": "T33n1717_007:0864b29_35"
    },
    {
        "source_sentence": "若接別者但接賢位，賢位屬教故云也。",
        "translation": "If someone receives a distinction, they only receive the stage of goodness, and the stage of goodness belongs to the teaching; therefore, it's called that.",
        "source": "T33n1717_007:0864c02_36"
    },
    {
        "source_sentence": "故云「可以意得」。",
        "translation": "That's why it's said, It can be obtained by the mind.",
        "source": "T33n1717_007:0864c03_37"
    },
    {
        "source_sentence": "次照五三諦中，言「前七智照無中之二諦」者，前三藏二諦既無中道不成三諦。",
        "translation": "Next, he illuminates the five three truths, saying, The first seven kinds of cognition illuminate the two truths in the absence of the middle way because the first three collections of the two truths lack the middle way and don't become the three truths.",
        "source": "T33n1717_007:0864c03_38"
    },
    {
        "source_sentence": "今以二十智照於三諦，不可棄七而全不論，故便列之。",
        "translation": "Now, because the twenty kinds of cognition illuminate the three truths, they can't abandon the seven and don't discriminate them at all, so they're listed.",
        "source": "T33n1717_007:0864c05_39"
    },
    {
        "source_sentence": "通雖無中，以含中故則或二或三，亦且從二為第二句，故云「屬真」。",
        "translation": "Although there's no middle in penetration, it's because it contains two or three, and it's the second phrase after two, so it's called belonging to the true.",
        "source": "T33n1717_007:0864c06_40"
    },
    {
        "source_sentence": "次「以八智照顯中」者，通約當教始終言之，故云「假中」。",
        "translation": "The next phrase, illuminating and revealing in terms of the eight kinds of cognition, refers to the beginning and end of the teaching, so it's called 'in the provisional.'",
        "source": "T33n1717_007:0864c08_41"
    },
    {
        "source_sentence": "若論二接，應言通真照別中、通真照圓中、別俗照圓中，各對本智及以本境合成三諦，",
        "translation": "In the discussion of the two connections, it should be said that they are found in the distinctive illumination of penetrating truth, in the perfect illumination of penetrating truth, and in the perfect illumination of differentiating secularity. Each is opposed to the original knowledge and to the three truths which are combined by means of the original object.",
        "source": "T33n1717_007:0864c09_42"
    },
    {
        "source_sentence": "此中便對中論四句結成，故云「即空」等。",
        "translation": "Here, it's because the four phrases in the Treatise on the Middle Way are combined into one, so it's called emptiness and so forth.",
        "source": "T33n1717_007:0864c11_43"
    },
    {
        "source_sentence": "次明「照一實」者，此亦置別從通，非但通於四悉，亦乃通四四諦，故云「生滅」等。",
        "translation": "Next, it's explained that the phrase illuminating one reality refers to the fact that this is also placed separately from the shared, not only the four siddhântas but also the four and four truths, so it's called arising and ceasing and so forth.",
        "source": "T33n1717_007:0864c12_44"
    },
    {
        "source_sentence": "先列四實，次對四教。",
        "translation": "First, we'll list the four realities, and then we'll discuss the four teachings.",
        "source": "T33n1717_007:0864c14_45"
    },
    {
        "source_sentence": "言「前後諸實(云云)」者，文但分別四實不同，應更分判諸實麁妙及開權等。",
        "translation": "The phrase the prior and subsequent realities (as it says) means that the text only discerns the four realities as distinct, and you should further define the subtleties of the realities in terms of their crudeness and opening up the right.",
        "source": "T33n1717_007:0864c14_46"
    },
    {
        "source_sentence": "次明「照無諦」者，先通序意，次正明照境。",
        "translation": "Next, it's explained that illuminating the absence of truth first explains the meaning of the preface and then correctly illuminates the object.",
        "source": "T33n1717_007:0864c16_47"
    },
    {
        "source_sentence": "初文者，亦且置別存通如前說(云云)。",
        "translation": "The first text also refers to the separately stored and shared as explained above (as it's said).",
        "source": "T33n1717_007:0864c17_48"
    },
    {
        "source_sentence": "次「前無諦」下判，次「若就」下開上諸智，通論開者非不須悟，此明無諦故斥通無。",
        "translation": "Next, it's judged under the prior truth of nonexistence and then under if in order to reveal the higher cognitions, which are explained in general terms as neither necessary nor unnecessary to awakening, this explains that there's no truth and therefore rejects shared nonexistence.",
        "source": "T33n1717_007:0864c18_49"
    },
    {
        "source_sentence": "以從別無，別又約證者，防語見故，故須言悟。",
        "translation": "Because it does not arise from the specific ones, and is also different in relation to the actualized ones: because of guarding against verbal views. Therefore, it needs to be called awakening.",
        "source": "T33n1717_007:0864c20_50"
    },
    {
        "source_sentence": "無名近證，故須言之。",
        "translation": "Because there's no name near realization, it must therefore be called that.",
        "source": "T33n1717_007:0864c21_51"
    },
    {
        "source_sentence": "乃至以此一無遍開前來一切諸智，同入此無，共成實智，即是今經之正意也。",
        "translation": "It's the correct meaning of the present sūtra that this single nonexistence universally reveals all the previous cognitions, enters into this nonexistence together, and accomplishes real cognition together.",
        "source": "T33n1717_007:0864c21_52"
    },
    {
        "source_sentence": "當知二十並是空拳，雖復空拳，漸誘方便皆不唐捐，況復開時即權而實。",
        "translation": "You should know that the twenty are all empty fist, and even though they may be empty fist, they gradually entice skillful means without fail, so why wouldn't they do so when they open it, which is right and real?",
        "source": "T33n1717_007:0864c23_53"
    },
    {
        "source_sentence": "今從勝說故曰雙非，故權即是非權非實。",
        "translation": "Now, because it's explained in terms of superiority, it's called neither; therefore, right is right that's right and wrong, and right isn't real.",
        "source": "T33n1717_007:0864c25_54"
    },
    {
        "source_sentence": "五明判者，為二：先判，次結。",
        "translation": "The fifth clarifies the judgement, which is divided into two: first, a judgement; second, a conclusion.",
        "source": "T33n1717_007:0864c26_55"
    },
    {
        "source_sentence": "初又三：初約智以判，次約知見四句以判，三約五眼。",
        "translation": "The first one is further threefold: first, to judge by reference to knowledge; second, to judge by reference to the four sentences of knowing and seeing; and third, to judge by reference to the five eyes.",
        "source": "T33n1717_007:0864c26_56"
    },
    {
        "source_sentence": "初文又二：初一往略判，次解釋。",
        "translation": "The first text has two parts: the first is a brief explanation of what happened, and the second is an explanation.",
        "source": "T33n1717_007:0864c27_57"
    },
    {
        "source_sentence": "釋又二：先明十二為麁，次「別教」下明後八為妙，於中為二：初通明八妙，",
        "translation": "The explanation is further twofold: first, he explains that the twelve are crude, and second, under specific teachings, he explains that the last eight are marvelous. There are two parts: the first explains the eight marvels in detail,",
        "source": "T33n1717_007:0864c28_58"
    },
    {
        "source_sentence": "次「又別」下料簡，初又三：初正明別妙，次「常途」下破古，三「今明」下顯正。",
        "translation": "Next, under further distinctions, he summarizes the first three: the first correctly explains the distinctive subtleties, the second refutes the ancient under constant path, and the third reveals the correct under presently explained.",
        "source": "T33n1717_007:0865a01_59"
    },
    {
        "source_sentence": "言「今明十信」至「八番為妙」者，且約知中勝三藏佛，一往望前八番俱妙，",
        "translation": "The expression now explaining the ten kinds of faith up to the eightfold marvelousness refers to knowing that the middle superior tripiṭaka buddhas and the first eight pairs of them are all marvelous when one goes there.",
        "source": "T33n1717_007:0865a02_60"
    },
    {
        "source_sentence": "猶帶教道故須更簡。",
        "translation": "It's still necessary to be simple because it carries the path of the teaching.",
        "source": "T33n1717_007:0865a04_61"
    },
    {
        "source_sentence": "簡中又二：先對簡，次雙釋。",
        "translation": "In the summary, there are two more: first, he contrasts the summary and second, he explains it in pairs.",
        "source": "T33n1717_007:0865a05_62"
    },
    {
        "source_sentence": "初云別教四番三麁一妙，今依地人以存教道，十地猶麁，何況十信？",
        "translation": "First, it's said that the distinct teaching is fourfold, three times debilitating, and one subtle, but now we rely on people in the land to preserve the path of teaching, so the ten stages are still debilitating, so why wouldn't the ten faithful?",
        "source": "T33n1717_007:0865a05_63"
    },
    {
        "source_sentence": "若且從登地而為證道，故二麁一妙。",
        "translation": "If someone were to realize the path from the stage of ascending, they'd have two crude and one marvelous.",
        "source": "T33n1717_007:0865a07_64"
    },
    {
        "source_sentence": "妙覺果頭本是實人，是故為妙。",
        "translation": "The head of the fruit of Marvelous Enlightenment is originally a real person, so it's marvelous.",
        "source": "T33n1717_007:0865a08_65"
    },
    {
        "source_sentence": "又亦可妙覺是權故為麁，十地是實故為妙，故云中道乃是果頭能顯。",
        "translation": "Also, marvelous awakening can be crude because it's right and marvelous because the ten stages are real. That's why it's said that the middle way is the fruit head that reveals it.",
        "source": "T33n1717_007:0865a08_66"
    },
    {
        "source_sentence": "次釋又二：先釋別，次釋圓。",
        "translation": "Next, there are two explanations: first, he explains the distinctions, and second, he explains the perfection.",
        "source": "T33n1717_007:0865a10_67"
    },
    {
        "source_sentence": "先釋別中又三：初正判別三麁一妙，次「類」下舉藏通以例別圓，三「今別」下顯別例成。",
        "translation": "First, there are three ways to explain the distinctions: first, he correctly judges the distinctive characteristics of the three crude and one subtle; second, under types, he cites the store consciousness as an example to show the distinctive completion; and third, under now distinct, he shows the distinctive examples that are accomplished.",
        "source": "T33n1717_007:0865a11_68"
    },
    {
        "source_sentence": "初文言「初心學者」等者，謂仰信中理，登地見中而證是妙。",
        "translation": "The first text says, Beginning scholars of the mind, etc., because they revere the middle principle and ascend to the middle of the earth to see it and realize that it's marvelous.",
        "source": "T33n1717_007:0865a13_69"
    },
    {
        "source_sentence": "「如藕絲懸山」者，《大經》十六云：「若有人能以藕中絲懸須彌山，",
        "translation": "The phrase like the silk of a lotus root hanging over a mountain refers to the sixteenth part of the Mahāprajñāpāramitā-sūtra, which says, Suppose someone can hang Mount Sumeru up on a silk thread in a lotus root.",
        "source": "T33n1717_007:0865a14_70"
    },
    {
        "source_sentence": "可思議不？",
        "translation": "Is it inconceivable?",
        "source": "T33n1717_007:0865a15_71"
    },
    {
        "source_sentence": "不也世尊！",
        "translation": "No, Bhagavān!",
        "source": "T33n1717_007:0865a16_72"
    },
    {
        "source_sentence": "佛言：菩薩能以一念稱量生死，則不可思議。」",
        "translation": "The Buddha said, If a bodhisattva can measure birth and death with a single thought, it's inconceivable.",
        "source": "T33n1717_007:0865a16_73"
    },
    {
        "source_sentence": "今明圓理難曉，但仰信而已，借彼況喻如人聞說藕絲懸山但信而已。",
        "translation": "Now, it's clear that the perfect principle is difficult to understand but simply relies on faith, and it's like someone who borrows a metaphor from that situation when they hear that lotus root hangs over a mountain and simply believes.",
        "source": "T33n1717_007:0865a17_74"
    },
    {
        "source_sentence": "如聞生死有不思議理，而但仰信不能一心，即如求藏，故非圓意。",
        "translation": "Just as someone who hears that birth and death have inconceivable principles but simply looks up to faith and can't concentrate their mind, it's like looking for a store, so it's not perfect intention.",
        "source": "T33n1717_007:0865a19_75"
    },
    {
        "source_sentence": "餘如文。",
        "translation": "The rest are as explained in the text.",
        "source": "T33n1717_007:0865a20_76"
    },
    {
        "source_sentence": "次約知見判者又二：初列四句，次釋。",
        "translation": "Next, there are two judgements in terms of knowing and seeing: the first lists four sentences, and the second explains them.",
        "source": "T33n1717_007:0865a20_77"
    },
    {
        "source_sentence": "釋中先約四教明知見，次以佛智攝之。",
        "translation": "The explanation first explains knowing and seeing in terms of the four teachings, and then it's collected by the Buddha's wisdom.",
        "source": "T33n1717_007:0865a21_78"
    },
    {
        "source_sentence": "初文又二：先略列三藏及圓，次正釋。",
        "translation": "The first text has two parts: first, it briefly lists the three collections and the perfect, and second, it correctly explains them.",
        "source": "T33n1717_007:0865a22_79"
    },
    {
        "source_sentence": "釋中藏圓如文。",
        "translation": "The explanation of the middle store is complete as explained in the text.",
        "source": "T33n1717_007:0865a23_80"
    },
    {
        "source_sentence": "通教亦以博地凡夫為不知不見，乾慧性地為知而不見，發習者為見而非知，",
        "translation": "Also the general doctrine teaches that worldlings of the wide stages do not know and do not see. The stage of dry wisdom is with knowing but does not see. Those who develop it are seeing but not knowing.",
        "source": "T33n1717_007:0865a23_81"
    },
    {
        "source_sentence": "見地已去亦知亦見。",
        "translation": "After seeing the ground, he knows and sees it.",
        "source": "T33n1717_007:0865a25_82"
    },
    {
        "source_sentence": "別教不知不見同前凡夫，地前知而非見，發習者見而非知，登地已去亦知亦見。",
        "translation": "In the different teachings, it's not known and not seen that's the same as the previous one for worldlings who know but don't see before the stages, those who are cultivating views but don't know, and those who have ascended to the stages and gone away from them also know and see.",
        "source": "T33n1717_007:0865a26_83"
    },
    {
        "source_sentence": "次以佛智攝之者又四：初略舉，次「如經」下引經解釋，三「方便」下歎，",
        "translation": "Next, there are four things that are collected by the Buddha's wisdom: first, a brief explanation; second, an explanation of the sūtras cited under Thus are the sutras; and third, a praise under Skillful Means.",
        "source": "T33n1717_007:0865a28_84"
    },
    {
        "source_sentence": "四「如此」下結歸。",
        "translation": "Fourth, under thus, he concludes by saying.",
        "source": "T33n1717_007:0865a29_85"
    },
    {
        "source_sentence": "初文者，諸境本是如來一體權實，為眾生故隨機且分。",
        "translation": "The first text means that the objects are originally one and the same as the Tathāgata' s single entity. For the sake of sentient beings, they are divided according to their capacities.",
        "source": "T33n1717_007:0865b01_86"
    },
    {
        "source_sentence": "今更從本說，故云「究而言之」。",
        "translation": "Now, it's further explained from the source, so it's called investigating and explaining it.",
        "source": "T33n1717_007:0865b02_87"
    },
    {
        "source_sentence": "次引經釋中，既言「方便」，是故屬權；",
        "translation": "The next quote from the sūtra explains that since it says skillful means, it therefore belongs to the right.",
        "source": "T33n1717_007:0865b03_88"
    },
    {
        "source_sentence": "既云「具足」，故非異體；",
        "translation": "Since it is said to be complete, it does not have a different essence.",
        "source": "T33n1717_007:0865b03_89"
    },
    {
        "source_sentence": "既云「深遠」，故屬實也；",
        "translation": "Since it says profound, it belongs to reality.",
        "source": "T33n1717_007:0865b04_90"
    },
    {
        "source_sentence": "復云「廣大」，是即權故。",
        "translation": "It's also called vast because it's the right.",
        "source": "T33n1717_007:0865b04_91"
    },
    {
        "source_sentence": "「方便」下歎意者，又三：初正歎，言「具足」等者，具足之權即實而論權，",
        "translation": "The first is a correct praise, saying that the phrase fulfillment and so forth refers to the right to be fulfilled as real and discusses the right.",
        "source": "T33n1717_007:0865b05_92"
    },
    {
        "source_sentence": "廣大之實即權而論實。",
        "translation": "What's vast and real is the right and discusses what's real.",
        "source": "T33n1717_007:0865b06_93"
    },
    {
        "source_sentence": "次「境淵」下結歎，實境淵深故竪極，權境無邊故橫遍，橫竪之水難量，",
        "translation": "Next, under abyss of objects, he concludes by praising the fact that the real objects are deep and profound because they're vast and extreme, that the rightful objects are boundless and pervasive because their horizontal and vertical water is immeasurable.",
        "source": "T33n1717_007:0865b07_94"
    },
    {
        "source_sentence": "故智不可測也。",
        "translation": "Therefore, cognition is unfathomable.",
        "source": "T33n1717_007:0865b09_0"
    },
    {
        "source_sentence": "三「唯佛」下舉果智以歎。",
        "translation": "Third, under Buddha-only, he praises the cognition of fruition.",
        "source": "T33n1717_007:0865b09_1"
    },
    {
        "source_sentence": "四結歸中二：初結歸眼智，次判。",
        "translation": "In the fourth, there are two: the first concludes with the knowledge of eye cognition and the second with a judgment.",
        "source": "T33n1717_007:0865b09_2"
    },
    {
        "source_sentence": "初文三：初明眼智，次「一切種智」下明眼智所知所見，三「此知」下明相即。",
        "translation": "The first text is threefold: first, it explains the eye cognition; second, under all kinds of cognition, it explains what the eye cognition knows and sees; and third, under this knowledge, it explains the sameness of characteristics.",
        "source": "T33n1717_007:0865b10_3"
    },
    {
        "source_sentence": "三約五眼者，「前明來意」者，前已明智知，次以知見四句分別以顯於眼。",
        "translation": "The third refers to the five eyes, and the phrase previously explained the meaning of coming means that the prior has already been explained with knowledge and knowing, and the next four sentences are discerned in terms of knowing and seeing to show the eye.",
        "source": "T33n1717_007:0865b12_4"
    },
    {
        "source_sentence": "眼秖是見，智秖是知，故云為「未了」者。",
        "translation": "The blindness of the eye is seeing, and the blindness of wisdom is knowing; therefore, it's called not understanding.",
        "source": "T33n1717_007:0865b14_0"
    },
    {
        "source_sentence": "釋中為三：初正明五眼，次約教，三總結。",
        "translation": "The explanation is divided into three: first, a correct explanation of the five eyes; second, a teaching; and third, a conclusion.",
        "source": "T33n1717_007:0865b14_1"
    },
    {
        "source_sentence": "先五眼，具如《止觀》第三記。",
        "translation": "The first five eyes are as described in the third entry in Zhiguan.",
        "source": "T33n1717_007:0865b15_2"
    },
    {
        "source_sentence": "今肉眼中言「開閉」者，不了因緣麁色等為閉，若了為開。",
        "translation": "Now, when we say opening and closing in the eyes of a flesh, we don't understand that debilitating form and so forth are closed by causes and conditions, and if we understand them, they're opened.",
        "source": "T33n1717_007:0865b16_3"
    },
    {
        "source_sentence": "天眼中云「願智力」者，願智謂超越三昧，超越三昧如《止觀》第九記。",
        "translation": "In the divine eye, it's called the power of the knowledge of vows because the knowledge of vows refers to transcending samādhi and transcending samādhi as recorded in the ninth entry of Zhiguan.",
        "source": "T33n1717_007:0865b17_4"
    },
    {
        "source_sentence": "「身子僻教」如《止觀》第五記。",
        "translation": "The body-son's false teaching is as recorded in the fifth entry of Zhiguan.",
        "source": "T33n1717_007:0865b19_5"
    },
    {
        "source_sentence": "「滿願穢器」者，滿願此音，富樓那彼稱，如《淨名》中云：「無以穢食置於寶器，",
        "translation": "Fulfilling the vow for a defiled vessel means fulfilling this sound, which is called Fulunna, as it's said in the Jīvaka, Don't put filthy food in a precious vessel.",
        "source": "T33n1717_007:0865b19_6"
    },
    {
        "source_sentence": "無以日光等彼螢火」等。",
        "translation": "There's no such thing as the sun shining like a firefly or so.",
        "source": "T33n1717_007:0865b21_7"
    },
    {
        "source_sentence": "「破障通無知」者，通謂神通，塵沙無知障於化道，今破此惑，故云「破障通無知」。",
        "translation": "The phrase refuting ignorance through the penetration of the hindrances refers to supernormal abilities, which are not known as dust and sand that hinder the path of transformation, and now it's called refuting this affliction, so it's called refuting ignorance through the penetration of the hindrances.",
        "source": "T33n1717_007:0865b22_8"
    },
    {
        "source_sentence": "二乘等不知，具如〈方便品〉。",
        "translation": "The two vehicles and so forth don't know it, as described in the Skillful Means chapter.",
        "source": "T33n1717_007:0865b24_0"
    },
    {
        "source_sentence": "疏云：「信力謂五品，堅固謂六根」，此即除知以顯不知。",
        "translation": "The commentary says, The power of faith refers to the five classes, and resolute refers to the six faculties. This is to remove knowing in order to show that it doesn't know.",
        "source": "T33n1717_007:0865b24_1"
    },
    {
        "source_sentence": "約教及結，可知。",
        "translation": "They can be understood in terms of the teachings and fetters.",
        "source": "T33n1717_007:0865b25_2"
    },
    {
        "source_sentence": "六明開，中二：先約智開，次約眼開。",
        "translation": "The sixth clarifies the initiation, of which there are two: first, it's based on the initiation of cognition, and second, on the initiation of the eye.",
        "source": "T33n1717_007:0865b26_3"
    },
    {
        "source_sentence": "若知見不異眼智，故不須約之論開，亦為未了者重為開之。",
        "translation": "If knowing and seeing are not different from eye cognition, there's no need to discuss them in terms of their opening, and it's because those who haven't understood them are often opened.",
        "source": "T33n1717_007:0865b27_4"
    },
    {
        "source_sentence": "先約智中又二：先總明所開一十六番須開。",
        "translation": "First, there are two more things about cognition: first, it's a general explanation of the one or sixteen things that must be revealed.",
        "source": "T33n1717_007:0865b28_5"
    },
    {
        "source_sentence": "次「何者」下釋，又二：先釋，次結。",
        "translation": "Next, under Which one, he explains it, and there are two more: first, he explains it, and second, he concludes.",
        "source": "T33n1717_007:0865b29_6"
    },
    {
        "source_sentence": "初又二：初開藏通十二番，次開別教四番。",
        "translation": "The first is twofold: the first reveals the twelve teachings of the store, and the second reveals the four teachings of the distinct teachings.",
        "source": "T33n1717_007:0865c01_7"
    },
    {
        "source_sentence": "初又二：初明開世智，次開十一智。",
        "translation": "The first is twofold: first, it explains the worldly cognition that reveals worldly cognition, and second, it reveals the eleven kinds of cognition.",
        "source": "T33n1717_007:0865c02_8"
    },
    {
        "source_sentence": "初又二：初明世智，次略結位。",
        "translation": "The first is twofold: first, it explains worldly cognition, and second, it briefly concludes the stages.",
        "source": "T33n1717_007:0865c03_9"
    },
    {
        "source_sentence": "次又二：初「若五停」下略開十一，次「須一一將十二番智來」等者，",
        "translation": "Next, there are two more: the first, If five stops, briefly explains the eleven, and the second, Suppose each one brings twelve kinds of cognition, etc.",
        "source": "T33n1717_007:0865c03_10"
    },
    {
        "source_sentence": "略明格位，故此藏七通五隨智高下按位進入，當體即按位，進入即不定。",
        "translation": "Because it briefly indicates the order, this store has seven supernormal powers and five secondary knowledges that enter according to the height of the higher and lower stages in accordance with their level.",
        "source": "T33n1717_007:0865c05_11"
    },
    {
        "source_sentence": "次別教，如文。",
        "translation": "The next is a specific teaching, as explained in the text.",
        "source": "T33n1717_007:0865c06_12"
    },
    {
        "source_sentence": "次總判結名，可知。",
        "translation": "The next is to summarize the names of the fetters, which can be understood.",
        "source": "T33n1717_007:0865c07_13"
    },
    {
        "source_sentence": "次約五眼者，初明開，次料簡。",
        "translation": "The next one is about the five eyes, which are first explained and opened, and then summarized.",
        "source": "T33n1717_007:0865c07_14"
    },
    {
        "source_sentence": "初文二：先總開，次別開。",
        "translation": "The first text is twofold: first, a general introduction; second, a specific introduction.",
        "source": "T33n1717_007:0865c08_15"
    },
    {
        "source_sentence": "別開又二：先開，次結。",
        "translation": "There are two further distinctive openings: the first is opened, and the second is closed.",
        "source": "T33n1717_007:0865c08_16"
    },
    {
        "source_sentence": "初文中初肉眼又三：初正開，次「學大乘」下引證，三「即是」下結。",
        "translation": "In the first text, the first is the physical eye, which consists of three parts: the first correctly opening, the second citing realization under studying the great vehicle, and the third concludes by saying that it's true.",
        "source": "T33n1717_007:0865c09_17"
    },
    {
        "source_sentence": "次天眼中二：先引經明開，次結。",
        "translation": "Next, there are two things in the eyes of the gods: first, they cite sūtras that explain the initiation, and second, they conclude.",
        "source": "T33n1717_007:0865c10_18"
    },
    {
        "source_sentence": "初文奪那律所見非真，即指世尊不二相見為真天眼，那律但得彈斥之益，",
        "translation": "The first text takes away what Na Rūpadhātu sees and doesn't really see, which is to say that the Bhagavān's vision of nondual characteristics is the true divine eye, but Na Rūpadhātu only gets the benefit of refuting it.",
        "source": "T33n1717_007:0865c11_19"
    },
    {
        "source_sentence": "不名為開。",
        "translation": "It's not called opening.",
        "source": "T33n1717_007:0865c13_20"
    },
    {
        "source_sentence": "正令梵王所得天眼，即彼有相為不二相，故名為開。",
        "translation": "It's precisely because the divine eye that King Brahmā obtains, which has characteristics and doesn't have two characteristics, is called opening.",
        "source": "T33n1717_007:0865c13_21"
    },
    {
        "source_sentence": "次決慧眼中，開麁慧眼成妙慧眼，故云「願得如世尊」等也。",
        "translation": "Next, in the eye of resolute wisdom, he opens the eye of debilitating wisdom to form the eye of marvelous wisdom, so he says, May you attain it like the Bhagavān.",
        "source": "T33n1717_007:0865c14_22"
    },
    {
        "source_sentence": "決法眼中云「邊際智滿」者，決別地前法眼，來至等覺，入重玄門不思議眼，",
        "translation": "The expression indeterminate eye of the Dharma says pervaded by knowledge of the limits means that it determines the eye of the Dharma before the distinctive stages, which comes to perfect enlightenment and enters the inconceivable eye of the profound mysterious approach.",
        "source": "T33n1717_007:0865c16_23"
    },
    {
        "source_sentence": "故下第五卷釋圓位中云「觀達無始無明源底，邊際智滿名為等覺」。",
        "translation": "That's why it's said in the fifth volume of the following explanation of the perfect stage, Observing the beginningless basis of the source of ignorance and the fulfillment of the knowledge of the limits is called equally enlightened.",
        "source": "T33n1717_007:0865c17_24"
    },
    {
        "source_sentence": "即成圓門，遍應法界，名入重玄。",
        "translation": "That is, the accomplishment of the perfect approach that pervades the Dharma realm and is called entering the grave mystery.",
        "source": "T33n1717_007:0865c19_25"
    },
    {
        "source_sentence": "不同別教教道重玄，居妙覺邊名邊際智滿，亦可以佛不可思議用為邊際智以為法眼。",
        "translation": "Unlike the profoundness of the path taught in specific teachings, which resides at the extremes of marvelous awakening and is called the completion of limitless wisdom, it's also possible to use the Buddha's inconceivable function of limitless wisdom as the Dharma eye.",
        "source": "T33n1717_007:0865c20_26"
    },
    {
        "source_sentence": "次佛眼中不復別論，但云四眼融入，以釋佛眼相也。",
        "translation": "Next, the Buddha's eye doesn't discuss it separately, but says that the four eyes are integrated, which explains the characteristics of the Buddha's eye.",
        "source": "T33n1717_007:0865c22_27"
    },
    {
        "source_sentence": "「五眼」下結，可知。",
        "translation": "The five eyes are summarized below, which can be understood.",
        "source": "T33n1717_007:0865c23_28"
    },
    {
        "source_sentence": "次料簡中「問佛眼」至「為妙」者，問前開肉眼中引《法華經》六根清淨文也。",
        "translation": "The next step in the summary is to ask about the Buddha's eye up to marvelous, which asks about the pure text of the six faculties of the Lotus Sutra that were cited in the previously opened flesh eye.",
        "source": "T33n1717_007:0865c23_29"
    },
    {
        "source_sentence": "「迦陵頻伽」如《止觀》第一記。",
        "translation": "Kalinda Bimbisāra is as recorded in the first entry of Zhiguan.",
        "source": "T33n1717_007:0865c25_30"
    },
    {
        "source_sentence": "言「若開」者，謂若進入論開或入分證等也。",
        "translation": "The expression if it's enlightened refers to those who enter into the discussion of enlightenment or enter into partial realization.",
        "source": "T33n1717_007:0865c26_31"
    },
    {
        "source_sentence": "次對境明智中自二：先標列，次釋。",
        "translation": "Next, there are two distinctive aspects of the cognition of objects: first, they're labeled and then explained.",
        "source": "T33n1717_007:0865c27_32"
    },
    {
        "source_sentence": "釋初文，先略明十如意，次對六境。",
        "translation": "The first part of the explanation briefly explains the ten such-and-such mental states, followed by addressing the six objects.",
        "source": "T33n1717_007:0865c28_0"
    },
    {
        "source_sentence": "前單明智，若不對境，後人將何為妙觀所託？",
        "translation": "The first one simply explains that cognition, but if it doesn't face objects, what will the latter person be entrusted with marvelous contemplation?",
        "source": "T33n1717_007:0865c28_1"
    },
    {
        "source_sentence": "問：前明智中已云照境，即是對境明智已竟，何煩復立此中一門？",
        "translation": "Question: In the previous one, knowledge of understanding has already been spoken of as illuminating objects. That is to say, after having completed knowledge of understanding regarding an object, why bother further establishing a single aspect here?",
        "source": "T33n1717_007:0865c29_2"
    },
    {
        "source_sentence": "答：前言照者或對或互通總而說，但云生滅智照生滅境，故脩觀者未可措心，",
        "translation": "Answer: The formerly mentioned illumination either is spoken of in relation to or in relation to each other, but it is only said that the knowledge of arising and ceasing illuminates the objects of arising and ceasing. That is why one who develops contemplation cannot make up his mind.",
        "source": "T33n1717_007:0866a02_3"
    },
    {
        "source_sentence": "故今一一明其行相。",
        "translation": "Therefore, we'll explain each one of them in terms of their defining activities.",
        "source": "T33n1717_007:0866a04_4"
    },
    {
        "source_sentence": "初明十如，如文。",
        "translation": "The first explains the ten thusnesses, as explained in the text.",
        "source": "T33n1717_007:0866a04_5"
    },
    {
        "source_sentence": "次因緣智中，先引經，次釋相。",
        "translation": "Next, in the knowledge of causes and conditions, he first cites the sūtras and then explains their characteristics.",
        "source": "T33n1717_007:0866a05_6"
    },
    {
        "source_sentence": "初引經云「下中上上上」者，《大經》二十五云：「觀十二因緣凡有四種，",
        "translation": "The first quote from the sūtra says, inferior, middling, superior, and superior, because the Mahāprajñāpāramitā-sūtra twenty-five says, There are four kinds of contemplation of the twelve causes and conditions:",
        "source": "T33n1717_007:0866a05_7"
    },
    {
        "source_sentence": "謂下、中、上、上上。",
        "translation": "They are inferior, middling, superior, and superior.",
        "source": "T33n1717_007:0866a07_8"
    },
    {
        "source_sentence": "下智觀故不見佛性，以不見故得聲聞菩提。",
        "translation": "Because they don't see the buddha-nature because of their inferior wisdom and contemplation, they attain śrāvaka enlightenment because they don't see it.",
        "source": "T33n1717_007:0866a07_9"
    },
    {
        "source_sentence": "中智觀者不見佛性，以不見故得緣覺菩提。",
        "translation": "Those who observe with midd wisdom don't see the buddha-nature, and because they don't see it, they attain pratyekabuddha enlightenment.",
        "source": "T33n1717_007:0866a08_10"
    },
    {
        "source_sentence": "上智觀者見不了了，不了了故住十住地。",
        "translation": "He who observes with higher knowledge sees what he doesn't understand, and because he doesn't understand it, he abides in the ten abodes.",
        "source": "T33n1717_007:0866a09_11"
    },
    {
        "source_sentence": "上上智觀故見則了了得阿耨菩提。",
        "translation": "Because it's the contemplation of superior cognition and therefore views, he then understands and attains unsurpassed enlightenment.",
        "source": "T33n1717_007:0866a10_12"
    },
    {
        "source_sentence": "以是義故，十二因緣名為佛性。",
        "translation": "Because of this meaning, the twelve causes and conditions are called buddha-nature.",
        "source": "T33n1717_007:0866a11_13"
    },
    {
        "source_sentence": "佛性者第一義空，第一義空名為中道，中道名佛，佛名涅槃。」",
        "translation": "The buddha-nature is emptiness in the first sense, emptiness in the first sense is called the middle way, the middle way is called buddha, and buddha is called nirvāṇa.",
        "source": "T33n1717_007:0866a12_14"
    },
    {
        "source_sentence": "今文銷釋從彼得名，人不見之秖謂因緣為緣覺觀法。",
        "translation": "The present text extinguishes the explanation that it's named after Peter, and people don't see him. It's called the method of observing causes and conditions as pratyekabuddhas.",
        "source": "T33n1717_007:0866a13_15"
    },
    {
        "source_sentence": "又《婆沙》亦云：「無明緣行三種不同。",
        "translation": "Also, the Vibhāṣā also says, The three kinds of nescience are different in terms of conditioned action.",
        "source": "T33n1717_007:0866a15_16"
    },
    {
        "source_sentence": "若上智觀於緣相得佛菩提，若中智觀於緣相得緣覺菩提，若下智觀於緣相得聲聞菩提。」",
        "translation": "If the higher cognition observes conditioned form to attain buddhahood, if the middle cognition observes conditioned form to attain pratyekabuddhahood, and if the lower cognition observes conditioned form to attain śrāvaka enlightenment, then they'll attain śrāvaka enlightenment.",
        "source": "T33n1717_007:0866a15_17"
    },
    {
        "source_sentence": "以緣有體故轉下作中、轉中作上，故知論文雖有三品但成下智。",
        "translation": "Because the supporting object has an essence, it turns downward into middle and turns inward into higher. Therefore, one knows that although there are three classes, it only becomes a knowledge of the lower ones.",
        "source": "T33n1717_007:0866a18_18"
    },
    {
        "source_sentence": "又準《阿含》觀十二因緣有逆有順，從無明至老死名順，從老死至無明為逆，",
        "translation": "Also, according to the Āgamas, twelve causes and conditions are opposed and oppose one another: from ignorance up to old age and death is called “opposed”; from old age and death up to ignorance is opposed.",
        "source": "T33n1717_007:0866a19_19"
    },
    {
        "source_sentence": "生滅皆然，自為藏教中乘觀因緣法。",
        "translation": "Both arising and ceasing are likewise, which is the causal principle of the contemplation of causes and conditions in the store teachings themselves.",
        "source": "T33n1717_007:0866a21_20"
    },
    {
        "source_sentence": "《大經》文通。",
        "translation": "The text of the Mahāprajñāpāramitā is shared.",
        "source": "T33n1717_007:0866a22_21"
    },
    {
        "source_sentence": "又欲順四諦觀故，並初觀受由觸等，以現五果受居初故也。",
        "translation": "Also, because they want to follow the contemplation of the four truths, it's because the first contemplation of feeling is based on contact and so forth, which shows that the five fruits of feeling abide at the beginning.",
        "source": "T33n1717_007:0866a22_22"
    },
    {
        "source_sentence": "次「何者」下釋，又二：先總明今意，次歷教解釋。",
        "translation": "Next, under Which one, he explains it, and there are two more: first, he summarizes the present meaning and second, he explains it in successive teachings.",
        "source": "T33n1717_007:0866a24_23"
    },
    {
        "source_sentence": "初文又二：先敘大意，次得名所以。",
        "translation": "The first text has two parts: first, it describes the main idea, and second, it gets its name.",
        "source": "T33n1717_007:0866a25_24"
    },
    {
        "source_sentence": "若通而言之，教教各有上中下人，具如《婆沙》文意；",
        "translation": "In general, each of the teachings has an upper, middle, and lower classes; all are as explained in the meaning of the Vibhāṣā.",
        "source": "T33n1717_007:0866a26_25"
    },
    {
        "source_sentence": "今從別對，故從下以標下等。",
        "translation": "Now, we're going to contrast it with something else, so we'll label it as inferior from the bottom.",
        "source": "T33n1717_007:0866a27_26"
    },
    {
        "source_sentence": "於中二，先各明，次「以四教」下結歎。",
        "translation": "In these two, we first explain each of the four teachings and then conclude by praising them under Four Teachings.",
        "source": "T33n1717_007:0866a27_27"
    },
    {
        "source_sentence": "初文自為四別。",
        "translation": "The first text is self-contained in four ways.",
        "source": "T33n1717_007:0866a28_28"
    },
    {
        "source_sentence": "次歷教中二：先釋，次明判開。",
        "translation": "Next, there are two parts in the successive teachings: first, an explanation, and second, an explanation that explains the opening of the judgment.",
        "source": "T33n1717_007:0866a29_29"
    },
    {
        "source_sentence": "初文自為四別，如諸觀法皆從受起者，若支佛人自起觀者，應如《阿含》生滅各有逆順觀境，",
        "translation": "The first sentence itself is fourfold: just as all the factors of contemplation arise from feelings. If the members of the Buddha-body were to produce their own contemplation themselves, they would have contradictory and concomitant objects of contemplation in each case, just as did the Āgamas.",
        "source": "T33n1717_007:0866a29_30"
    },
    {
        "source_sentence": "但作此觀，自滅諸惑。",
        "translation": "He simply observes this to cease the afflictions on his own.",
        "source": "T33n1717_007:0866b02_31"
    },
    {
        "source_sentence": "今大小偏圓共為觀法，況因緣四諦名異義同？",
        "translation": "Now, large and small are partial and perfect in common for the contemplation of dharmas, so why would the names of the four noble truths as causes and conditions have the same meaning?",
        "source": "T33n1717_007:0866b03_32"
    },
    {
        "source_sentence": "四諦觀苦為初門，故今觀因緣亦初起苦道，如四四諦苦並居初，故四觀緣咸從受起，",
        "translation": "Because the contemplation on frustration of the four truths is the first aspect, the present contemplation on causes and conditions also gives rise to the path of unsatisfactoriness for the first time. Just as the four forms of suffering of the fourfold doctrine abide at one and the same time:",
        "source": "T33n1717_007:0866b04_33"
    },
    {
        "source_sentence": "知苦斷集次第不殊，用智見異理須分此四也。",
        "translation": "Knowing that the sequence of suffering's cessation and accumulation are not different, these four must be divided into four by using cognition to see what's different in principle.",
        "source": "T33n1717_007:0866b06_34"
    },
    {
        "source_sentence": "初觀生滅中又四：初推受以至無明，次推無明以感現報，三「觀此」下用觀，",
        "translation": "The first contemplation of arising and ceasing is further divided into four: the first infers feeling up to ignorance, the second infers ignorance to bring about present rewards, and the third uses contemplation under observing this to examine it.",
        "source": "T33n1717_007:0866b07_35"
    },
    {
        "source_sentence": "四「則是」下結名。",
        "translation": "The fourth concludes with the name under Yes.",
        "source": "T33n1717_007:0866b09_36"
    },
    {
        "source_sentence": "初二文者，推現苦本為知其苦本，復推苦本至現苦者，為知苦本所造不同，",
        "translation": "The first two texts deduce the present root of suffering in order to know the root of suffering. The second one deduces the root of suffering up to the present cause of suffering in order to know the differences created by the root of suffering.",
        "source": "T33n1717_007:0866b09_37"
    },
    {
        "source_sentence": "輪迴升沈不出三有，故須起觀。",
        "translation": "Because transmigration, arising and sinking do not occur in the three existences. Therefore, contemplation must be produced.",
        "source": "T33n1717_007:0866b11_38"
    },
    {
        "source_sentence": "起觀中二：先觀生，次觀滅。",
        "translation": "There are two ways to give rise to contemplation: first, observing arising and second, observing cessation.",
        "source": "T33n1717_007:0866b12_39"
    },
    {
        "source_sentence": "初觀生中二：先通觀輪迴，次束成因果。",
        "translation": "In the first, there are two kinds of contemplation that arise: first, they penetrate the contemplation of transmigration, and second, they lump causes and effects into cause and effect.",
        "source": "T33n1717_007:0866b13_40"
    },
    {
        "source_sentence": "以知過現因果，故了未現不停。",
        "translation": "Because they know the past and present causes and effects, they understand what's not yet manifested and don't stop.",
        "source": "T33n1717_007:0866b14_41"
    },
    {
        "source_sentence": "次觀滅中二：先明子滅，次「無子」下果滅。",
        "translation": "Next, there are two ways to contemplate cessation: first, explaining the cessation of the child, and second, observing the cessation of the fruit under no child.",
        "source": "T33n1717_007:0866b14_42"
    },
    {
        "source_sentence": "初文三：法、譬、結。",
        "translation": "The first text is threefold: dharmas, metaphors, and fetters.",
        "source": "T33n1717_007:0866b15_43"
    },
    {
        "source_sentence": "言「癡惑本」者，癡惑是生死之本，故名癡本。",
        "translation": "The expression root of delusion means that delusion is the root of birth-and-death, so it's called the root of delusion.",
        "source": "T33n1717_007:0866b16_44"
    },
    {
        "source_sentence": "問：凡觀因緣，推因者為識現因能招來果，但斷現因以息來果，何須復言無明滅則名色滅等耶？",
        "translation": "Question: When one observes causes and conditions as causes, the efficient cause is the present cause of consciousness that brings about the future fruit; but when the present cause is interrupted, there is only the fruit of cessation. Why does it need further to be said that with the cessation of ignorance, name and form are extinguished?",
        "source": "T33n1717_007:0866b17_45"
    },
    {
        "source_sentence": "答：不然。",
        "translation": "Answer: It is not so.",
        "source": "T33n1717_007:0866b19_46"
    },
    {
        "source_sentence": "正由能知往因無常，故往因滅方能了現果無常，故破壞現果，以破壞現果故不造現因，",
        "translation": "It is precisely because they are able to know that past causes are impermanent. Therefore, only when past causes cease can they understand that the present result is impermanent. That is why they destroy the present result. Because they destroy the present result, they do not create the present cause.",
        "source": "T33n1717_007:0866b19_47"
    },
    {
        "source_sentence": "方乃不招未來世果，乃至逆滅尋之可知。",
        "translation": "Only then will they not bring future results, and even if they revert to cessation, it's easy to know.",
        "source": "T33n1717_007:0866b21_48"
    },
    {
        "source_sentence": "譬中「然」如因、「煙」如果。",
        "translation": "In the metaphor, however, it's like a cause and smoke is like a condition.",
        "source": "T33n1717_007:0866b22_49"
    },
    {
        "source_sentence": "結可知。",
        "translation": "The conclusion can be understood.",
        "source": "T33n1717_007:0866b23_50"
    },
    {
        "source_sentence": "次果滅者又二：釋、結。",
        "translation": "Next, there are two kinds of cessation of fruit: explanation and fetters.",
        "source": "T33n1717_007:0866b23_51"
    },
    {
        "source_sentence": "釋者，「智」是習果，「身」是報果，為欲灰身，應須滅智，由果縛在，",
        "translation": "\\",
        "source": "T33n1717_007:0866b24_52"
    },
    {
        "source_sentence": "智亦不滅，是故相從二果俱滅。",
        "translation": "Knowledge also does not perish: that is why the characteristic marks are extinguished together with two fruits.",
        "source": "T33n1717_007:0866b25_53"
    },
    {
        "source_sentence": "起觀如道，二滅如滅，此約小教方便言滅，大乘不然。",
        "translation": "The arousing of contemplation is as path, and the two kinds of cessation are as cessation. This is speaking of cessation in terms of skillful means according to the lesser teaching; this is not the case for the Great Vehicle.",
        "source": "T33n1717_007:0866b26_54"
    },
    {
        "source_sentence": "次中智者為三：初推因果，次起觀，三結。",
        "translation": "The next middle knowledge is threefold: the first infers cause and effect, the second produces contemplation, and the third concludes.",
        "source": "T33n1717_007:0866b27_55"
    },
    {
        "source_sentence": "初文甚略，云觀受由觸乃至無明，餘如三藏中說。",
        "translation": "The first text is abbreviated, saying that it's observing feeling from contact up to ignorance, and the rest are as explained in the Tripiṭaka.",
        "source": "T33n1717_007:0866b28_56"
    },
    {
        "source_sentence": "次起觀中二：先生，次滅。",
        "translation": "Next, there are two kinds of contemplation that arise: sir, and second is cessation.",
        "source": "T33n1717_007:0866b29_57"
    },
    {
        "source_sentence": "初生中三：先觀往因能招現果如幻，次「今達」下觀現因能招來果如幻，",
        "translation": "In the first birth, there are three: first, observing that past causes can summon present results as illusions; second, realizing that present causes can summon future results as illusions under Understood Now, observing that present causes can summon future results as illusions.",
        "source": "T33n1717_007:0866c01_58"
    },
    {
        "source_sentence": "總束前文故云「三世」。",
        "translation": "It's called the three times because it summarizes the previous sentence.",
        "source": "T33n1717_007:0866c02_59"
    },
    {
        "source_sentence": "三「有智」下引人例法，次「無明」下觀滅即子果滅也。",
        "translation": "Third, under having cognition, he cites the example of people and dharmas, and next under nescience, he observes cessation, which is the cessation of childhood and fruition.",
        "source": "T33n1717_007:0866c03_60"
    },
    {
        "source_sentence": "三結，如文。",
        "translation": "The three fetters are as explained in the text.",
        "source": "T33n1717_007:0866c04_61"
    },
    {
        "source_sentence": "上根觀中既云「派出」不云「理」，是故知是別。",
        "translation": "Since it's said in the contemplation of the higher faculties, sending out and not principle, we know that they are distinct.",
        "source": "T33n1717_007:0866c04_62"
    },
    {
        "source_sentence": "於中又二：謂釋、結。",
        "translation": "There are two more: interpretation and fetters.",
        "source": "T33n1717_007:0866c05_63"
    },
    {
        "source_sentence": "釋中又三：初明觀境，次「觀此」下正明用觀，三「知因此」下觀成。",
        "translation": "In the explanation, there are three more: first, he explains the object of contemplation; second, he correctly explains the contemplation of using this under contemplation; and third, he explains the accomplishment of contemplation under knowing it as a result.",
        "source": "T33n1717_007:0866c06_64"
    },
    {
        "source_sentence": "初文又二：初總舉，次「無明」下明派出三道。",
        "translation": "The first text is twofold: first, it summarizes the three paths, and second, nescience, explains the three paths that are appointed under nescience.",
        "source": "T33n1717_007:0866c07_65"
    },
    {
        "source_sentence": "次文又二：先釋，次「諸行」下總結。",
        "translation": "The next sentence is further twofold: first, an explanation; second, a summary under practices.",
        "source": "T33n1717_007:0866c08_66"
    },
    {
        "source_sentence": "第三又二：初明十行觀成，次「如是」下明十地觀成。",
        "translation": "The third is also twofold: first, it explains the accomplishment of the ten practices of contemplation, and second, thus, it follows to explain the accomplishment of the ten stages of contemplation.",
        "source": "T33n1717_007:0866c09_67"
    },
    {
        "source_sentence": "初如文。",
        "translation": "The first is as explained in the text.",
        "source": "T33n1717_007:0866c10_68"
    },
    {
        "source_sentence": "次文又三：先明能障，次「無明」下明障破德成，三「自既」下觀成利他，",
        "translation": "The next sentence is further divided into three parts: first, it explains the hindrances that can be obstructed; second, it explains the accomplishment of the virtue of destroying hindrances under nescience; and third, it's contemplating the accomplishment of benefiting others under self.",
        "source": "T33n1717_007:0866c10_69"
    },
    {
        "source_sentence": "初如文。",
        "translation": "The first is as explained in the text.",
        "source": "T33n1717_007:0866c12_70"
    },
    {
        "source_sentence": "次文又二：即約因緣開為兩番三道也。",
        "translation": "The next text is further divided into two: that is, it's divided into two times and three paths according to causes and conditions.",
        "source": "T33n1717_007:0866c12_71"
    },
    {
        "source_sentence": "次上上智觀中束為三德，故知異別。",
        "translation": "The next higher wisdom observes that the middle is bound to three virtues, so it knows distinctions.",
        "source": "T33n1717_007:0866c13_72"
    },
    {
        "source_sentence": "亦初推因果，次起觀，三結。",
        "translation": "Also, the first is to infer cause and effect. The second is to produce contemplation. There are three fetters:",
        "source": "T33n1717_007:0866c14_73"
    },
    {
        "source_sentence": "初如文，次起觀中體性既即無復生滅，於中又三：標、釋、結成。",
        "translation": "The first is as explained in the text, and the second gives rise to three: labeling, explaining, and concluding because the essence of contemplation is that there's no further arising or ceasing.",
        "source": "T33n1717_007:0866c15_0"
    },
    {
        "source_sentence": "初如文。",
        "translation": "The first is as explained in the text.",
        "source": "T33n1717_007:0866c16_1"
    },
    {
        "source_sentence": "次釋中三德各一法一譬，三譬相狀各約其位。",
        "translation": "Next, in the explanation, each of the three virtues is one metaphor for a dharma, and each of the three metaphors has their own status.",
        "source": "T33n1717_007:0866c16_2"
    },
    {
        "source_sentence": "結成中二：先略結成，次「何者」下結。",
        "translation": "In the conclusion, there are two: first, a brief conclusion, and second, a conclusion under What is it?",
        "source": "T33n1717_007:0866c17_3"
    },
    {
        "source_sentence": "涅槃從果故名果成，真因道場故名為因。",
        "translation": "Because of the fruit, nirvana is called ‘formation of a fruit’. Because it is the true cause at the site of enlightenment, it is called ‘cause’.",
        "source": "T33n1717_007:0866c18_4"
    },
    {
        "source_sentence": "當知四觀皆觀三世十二因緣，能觀智別故使四殊。",
        "translation": "You should know that the four contemplations all observe the twelve causes and conditions of the three times, and because they can observe distinctions in cognition, they cause the four to be different.",
        "source": "T33n1717_007:0866c19_5"
    },
    {
        "source_sentence": "次判開亦應約四教五味，但文略無。",
        "translation": "Next, it's judged that the opening should also refer to the four teachings and five flavors, but the text is briefly absent.",
        "source": "T33n1717_007:0866c20_6"
    },
    {
        "source_sentence": "於中又二：先略述判開，次「又四」下明判所以。",
        "translation": "There are two more: first, we'll briefly explain the reason for discernment, and second, under further four, we'll explain the reason for discernment.",
        "source": "T33n1717_007:0866c21_7"
    },
    {
        "source_sentence": "由境轉故方得名妙，此約悟論妙，所以四人用觀皆從受起，故知四人初觀皆以生滅因緣為境，",
        "translation": "It is called marvelous because it proceeds from the object. This is what we call marvelous in terms of awakening and discussing. That is why the four men use contemplation to arise from sensation. Therefore, they know that the first thought of the four men has arising and ceasing for its object as its object.",
        "source": "T33n1717_007:0866c22_8"
    },
    {
        "source_sentence": "用觀方法則有四別。",
        "translation": "Using the method of contemplation, there are four distinctions.",
        "source": "T33n1717_007:0866c24_9"
    },
    {
        "source_sentence": "此生滅境隨妙智轉方成妙境，境若不轉智亦不轉，故知雖用妙智境仍生滅，",
        "translation": "This state of arising and ceasing follows the development of subtle knowledge, in order to form a subtle state. If this state does not develop, then neither does knowledge develop. Therefore, it is known that although one uses the state of subtle knowledge, still arises and ceases.",
        "source": "T33n1717_007:0866c25_10"
    },
    {
        "source_sentence": "故云「不轉則麁」。",
        "translation": "That's why it's said, If they don't change, then they'll become angry.",
        "source": "T33n1717_007:0866c27_11"
    },
    {
        "source_sentence": "又何但妙悟須轉，前之三教亦須待轉方受教名，如不見三世生滅，亦不成三藏之境，",
        "translation": "Furthermore, why is it that not only does Marvelous Enlightenment need to evolve, but the first three teachings also need to evolve before they can receive the names of their teachings? Just as you don't see the arising and ceasing of the three worlds, and they don't become the objects of the Tripiṭaka.",
        "source": "T33n1717_007:0866c27_12"
    },
    {
        "source_sentence": "餘例可知。",
        "translation": "The rest are examples that can be understood.",
        "source": "T33n1717_007:0866c29_13"
    },
    {
        "source_sentence": "是故深須了此境智。",
        "translation": "Therefore, it's necessary to deeply understand this object of cognition.",
        "source": "T33n1717_007:0866c29_14"
    },
    {
        "source_sentence": "若得此意，下去諸智準此可知。",
        "translation": "If he attains this idea, the following are the cognitions that can be understood according to this.",
        "source": "T33n1717_007:0867a01_15"
    },
    {
        "source_sentence": "「仍是待絕之意」者，若不轉麁成妙故成相待意也，若即麁成妙方成絕待意也。",
        "translation": "The phrase still await the intention to cut off means that if they don't turn crude into subtle and become subtle, then they become mutually dependent, and if crude becomes subtle, then they become cutting off the intention to wait.",
        "source": "T33n1717_007:0867a02_16"
    },
    {
        "source_sentence": "次明四諦者，若了所照名異義同，則能照智準例可見無俟更說，亦為未了故重說耳。",
        "translation": "The next clarification of the four truths is that if the names that are illuminated by understanding are different but the meanings are the same, then they can illuminate cognition and show it in terms of examples without waiting to explain it again because they haven't understood it.",
        "source": "T33n1717_007:0867a04_0"
    },
    {
        "source_sentence": "於中亦先釋，次判開。",
        "translation": "Here, it's also first explained and then judged to be opened.",
        "source": "T33n1717_007:0867a06_1"
    },
    {
        "source_sentence": "初又二：先引文立意，次「又云」下正釋。",
        "translation": "The first is further twofold: first, he cites the text to establish its meaning, and then he correctly explains it under Again.",
        "source": "T33n1717_007:0867a06_2"
    },
    {
        "source_sentence": "初文三：先正引經文，次「若依」下束判經文，三「今若」下明判所以。",
        "translation": "The first text is threefold: first, it correctly cites the text of the sūtra; second, it summarizes the text of the sūtra under if we rely on it; and third, it explains the reason for judgement under if we do now.",
        "source": "T33n1717_007:0867a07_3"
    },
    {
        "source_sentence": "初如文。",
        "translation": "The first is as explained in the text.",
        "source": "T33n1717_007:0867a08_4"
    },
    {
        "source_sentence": "次文者，《涅槃》十二明上智中智，經意但以三藏二乘對別菩薩，今文義立束前兩教為中智，",
        "translation": "The next text means that the twelve aspects of Nirvana explain superior cognition and middling cognition. The meaning of the sūtras is simply to contrast the three collections and two vehicles with distinct bodhisattvas. The present text establishes the bundle of the first two teachings as middling cognition,",
        "source": "T33n1717_007:0867a09_5"
    },
    {
        "source_sentence": "束後兩教為上智，已下所引並是〈聖行品〉文。",
        "translation": "The last two teachings are bundled together as superior cognition, and what's cited below is the text of the Chapter on Noble Actions.",
        "source": "T33n1717_007:0867a11_6"
    },
    {
        "source_sentence": "第三文者為三：先立根對理，次列，三指廣。",
        "translation": "The third text consists of three parts: the first establishes the faculties as opposed to the principle, the second lists them, and the third refers to their breadth.",
        "source": "T33n1717_007:0867a12_7"
    },
    {
        "source_sentence": "次正釋，文自為四：初三藏又三：先重引經文，次釋，三結。",
        "translation": "The next is a correct explanation, which consists of four texts: the first three collections have three parts: first, they repeatedly cite the text of the sūtras; second, they explain and conclude with three conclusions.",
        "source": "T33n1717_007:0867a13_8"
    },
    {
        "source_sentence": "次通亦三：引、釋、結。",
        "translation": "The next one is shared with three: cites, explains, and concludes.",
        "source": "T33n1717_007:0867a14_9"
    },
    {
        "source_sentence": "別教亦三：引、釋、結。",
        "translation": "The specific teachings are also threefold: cite, explain, and conclude.",
        "source": "T33n1717_007:0867a15_10"
    },
    {
        "source_sentence": "釋中又三：先重對前辨，次「分別」下正明今意，三「既稱」下辨異示相。",
        "translation": "In the explanation, there are three more: first, we'll discuss the previous one again, second, we'll explain the present meaning under discrimination, and third, we'll discuss the distinctive characteristics under Since it's called.",
        "source": "T33n1717_007:0867a15_11"
    },
    {
        "source_sentence": "圓教為二：先釋，次例。",
        "translation": "The perfect teaching is divided into two: first, an explanation; second, an example.",
        "source": "T33n1717_007:0867a17_12"
    },
    {
        "source_sentence": "初又四：先引，次「非苦」下釋，三「又云」下引證，四「如此」下結。",
        "translation": "The first is further fourfold: first, it's cited; second, it's explained under Not suffering; third, it's cited under And so forth to confirm; and fourth, it's concluded under Thus.",
        "source": "T33n1717_007:0867a17_13"
    },
    {
        "source_sentence": "初如文，次釋中但釋一非苦，餘三例知。",
        "translation": "The first is as explained in the text, and the second explains that there's only one thing that's not painful, but the other three are examples.",
        "source": "T33n1717_007:0867a18_14"
    },
    {
        "source_sentence": "三引證中，既云「如來非苦」等，故義同也。",
        "translation": "In the third citation, it says, Since the Tathāgata isn't painful, and so forth, the meaning is the same.",
        "source": "T33n1717_007:0867a19_15"
    },
    {
        "source_sentence": "初並從苦立者，由苦故集，由集故道滅，故以苦為本，故云「有苦有苦因」等，",
        "translation": "The first one is that they are established from suffering because of suffering. Because suffering arises because of suffering and the path ceases because of accumulation, it therefore has suffering as its root; therefore, it's called having suffering and having causes of suffering.",
        "source": "T33n1717_007:0867a20_16"
    },
    {
        "source_sentence": "以四諦互指立四諦名。",
        "translation": "It's because the four truths mutually refer to each other and establish the names of the four truths.",
        "source": "T33n1717_007:0867a22_17"
    },
    {
        "source_sentence": "初以三望苦得四諦名，故有苦等四諦之別。",
        "translation": "In the first case, because suffering obtains the names of the four truths in three ways, there are distinctions among the four truths of suffering and so on.",
        "source": "T33n1717_007:0867a22_18"
    },
    {
        "source_sentence": "次例者，既可以苦為本，亦可以三準集望道滅等以為四也。",
        "translation": "The next example is that since suffering can be the root, we can also use the three standards of accumulation and hope for the cessation of the path as four.",
        "source": "T33n1717_007:0867a23_19"
    },
    {
        "source_sentence": "如云由集故苦，由集故道滅等，餘二準知，餘二亦然，如此互指乃成藏通別等三教之義。",
        "translation": "Just as it is said: because of the origin, there is unsatisfactoriness; because of the origin, there is enlightenment; because of the path, there is cessation. The other two are to be known with certainty. The other two are also to be known in this way.",
        "source": "T33n1717_007:0867a25_20"
    },
    {
        "source_sentence": "今以圓望之，故云「如來非此四四十六」，一一教中皆具十六，但隨教相義理不同。",
        "translation": "Now, we're looking at them in terms of their completeness, so it's said, The Tathāgata isn't one of these forty-six. Each teaching contains sixteen, but the meaning and principle differ according to the characteristics of the teachings.",
        "source": "T33n1717_007:0867a27_21"
    },
    {
        "source_sentence": "次判開中，亦名待絕。",
        "translation": "In the next judgment, it's also called waiting to be cut off.",
        "source": "T33n1717_007:0867a29_22"
    },
    {
        "source_sentence": "初文言「皆麁」者，指前三教未會為語耳，即相待妙。",
        "translation": "The first phrase, they're all crude refers to the three previous teachings that haven't been combined into words, which are marvelous in terms of mutual dependence.",
        "source": "T33n1717_007:0867a29_23"
    },
    {
        "source_sentence": "次言「若諦圓智亦隨圓」者，絕待意也。",
        "translation": "The next thing he says, If the knowledge of the truths is perfect, it's also perfect according to the mind that's cut off from craving.",
        "source": "T33n1717_007:0867b02_24"
    },
    {
        "source_sentence": "此與前十二緣文末境智相望轉文同也。",
        "translation": "This is the same as the previous sentence on the mutual dependence of the twelve conditions and the subsequent sentence on the cognition of objects.",
        "source": "T33n1717_007:0867b02_25"
    },
    {
        "source_sentence": "次對七二諦明智者，為二：先例境略列，次正釋。",
        "translation": "The next one explains the cognition of the seven two truths, which are twofold: first, an example that briefly lists objects and then a correct explanation.",
        "source": "T33n1717_007:0867b03_26"
    },
    {
        "source_sentence": "初文又三：初總標意，次「上真俗」下例上開為七，三「內外」下列。",
        "translation": "The first text has three parts: the first summarizes the meaning; the second, true and secular, follows the example above to reveal seven; and the third, internal and external, follows.",
        "source": "T33n1717_007:0867b05_27"
    },
    {
        "source_sentence": "列中三：初略列，次廣列，三列三意。",
        "translation": "There are three in the list: the first is a brief list, the second is a broad list, and the third is a list of three meanings.",
        "source": "T33n1717_007:0867b06_28"
    },
    {
        "source_sentence": "次廣釋中為四：初正釋，次例諸境，三問答料簡，四「夫二諦」下斥舊明今經破立之意。",
        "translation": "Next, there are four extensive explanations: the first is a correct explanation, the second an example of objects, the third a question and answer that summarizes them, and the fourth refutes the meaning of the present sūtra's refutation of the two truths under The Two Truths.",
        "source": "T33n1717_007:0867b07_29"
    },
    {
        "source_sentence": "初釋中文三：釋判開，初文自為七，初對實有明二智者為二：初正釋，",
        "translation": "The first part of the explanation is divided into three parts: interpretation, judgement and initiation. The first part consists of seven parts. The first part is divided into two parts:",
        "source": "T33n1717_007:0867b09_30"
    },
    {
        "source_sentence": "次依教重分別。",
        "translation": "Next, he relies on the teaching to repeatedly discriminate.",
        "source": "T33n1717_007:0867b10_31"
    },
    {
        "source_sentence": "初文又二：初立二智，次「說此下」明三意。",
        "translation": "The first text has two more meanings: first, it establishes the two kinds of cognition, and second, explains the three meanings under Explained here.",
        "source": "T33n1717_007:0867b11_32"
    },
    {
        "source_sentence": "次更分別者，前約智體說，今約智用說，得此一番則識智體得名所從，",
        "translation": "The second is further differentiated. It was spoken of previously in terms of the essence of knowledge, but now it is spoken of in terms of the functioning of knowledge. When one acquires this state, then the essence of consciousness and knowledge are acquired as that from which they are named.",
        "source": "T33n1717_007:0867b12_33"
    },
    {
        "source_sentence": "從於化主及以所化得名不同，而智秖是一。",
        "translation": "The names of the apparitional host and that which is to be transformed are different, but the name of knowledge is the same.",
        "source": "T33n1717_007:0867b13_34"
    },
    {
        "source_sentence": "言「佛印迦葉」者，佛有化他之實，與二乘自行實同，故佛印云「我之與汝俱坐解脫床」，",
        "translation": "The expression Buddha-seat Kāśyapa means that the Buddha has the reality of teaching others, which is the same as the reality of self-existence in the two vehicles, so the Buddha-seat says, I'll sit with you on the liberation bed.",
        "source": "T33n1717_007:0867b14_35"
    },
    {
        "source_sentence": "雖云俱得，然自行與化他不同，化他之權意亦如是。",
        "translation": "Although it's said to be acquired at the same time, self-reliance is different from teaching others, and so is the right to teach others.",
        "source": "T33n1717_007:0867b16_36"
    },
    {
        "source_sentence": "故《大論》云：「我有慈悲四禪三昧，汝亦如是。」",
        "translation": "That's why the Mahāprajñāpāramitā-sūtra says, I have the fourth meditation concentration of compassion, and so are you.",
        "source": "T33n1717_007:0867b18_37"
    },
    {
        "source_sentence": "如此慈悲本是化他之法，故菩薩得之即成自行，故復印言「我亦如是」。",
        "translation": "Such kindness and pity are originally the teachings for transforming others, so when a bodhisattva attains them, he accomplishes self-reliance; therefore, he also says, So am I.",
        "source": "T33n1717_007:0867b19_38"
    },
    {
        "source_sentence": "次明體法二智中，先斥三藏，次正釋。",
        "translation": "Next, it's explained that among the two kinds of cognition of essence and dharmas, first rejecting the three collections, and then explaining them correctly.",
        "source": "T33n1717_007:0867b20_39"
    },
    {
        "source_sentence": "初文中三藏菩薩毒器緣，如《止觀》第二記。",
        "translation": "In the first text, the conditions for the poisonous vessel of the Tripiṭaka Bodhisattva are as recorded in the second entry of Zhiguan.",
        "source": "T33n1717_007:0867b21_40"
    },
    {
        "source_sentence": "次正明中二：先立二智，次明三意。",
        "translation": "Next, there are two ways to correctly explain them: first, establishing the two kinds of cognition, and second, explaining the three meanings.",
        "source": "T33n1717_007:0867b22_41"
    },
    {
        "source_sentence": "初中云「森羅」者，世人共聞其言而不甄簡深淺，皆指欲界人中五塵。",
        "translation": "The first one says, 'forest' because the world hears his words together but doesn't discern their depth and depth, referring to the five dust motes among people in the desire realm.",
        "source": "T33n1717_007:0867b23_42"
    },
    {
        "source_sentence": "今則不爾，既七種中皆指權智所照俗境名為森羅，是則七種森羅不同，",
        "translation": "Since all seven kinds refer to the worldly realm illuminated by expedient knowledge, they are called ‘forests.’ This means that the seven kinds of forests are different.",
        "source": "T33n1717_007:0867b25_43"
    },
    {
        "source_sentence": "細簡(云云)。",
        "translation": "Subtle and simple (as it says).",
        "source": "T33n1717_007:0867b26_44"
    },
    {
        "source_sentence": "下去五重皆先斥、次正立等。",
        "translation": "The next five categories are first refuted, then correctly established, and so forth.",
        "source": "T33n1717_007:0867b26_45"
    },
    {
        "source_sentence": "次判中二：先正判，次歎用判意。",
        "translation": "Next, there are two ways to judge it: first, correctly judge it, and second, praise the meaning of using judgment.",
        "source": "T33n1717_007:0867b27_46"
    },
    {
        "source_sentence": "初又二：初先舉今經明妙，次更比決。",
        "translation": "The first is twofold: first, he first cites the present sūtra to explain its subtlety, and second, he compares it further.",
        "source": "T33n1717_007:0867b28_47"
    },
    {
        "source_sentence": "比決又二：先約教，次約味。",
        "translation": "There are two further inferences: first, we're talking about the teaching, and second, we're talking about the taste.",
        "source": "T33n1717_007:0867b29_48"
    },
    {
        "source_sentence": "初文中四節，初前四番中云「從析法二智至顯中凡十二種智，待前為麁、顯中為妙」者，",
        "translation": "The first four sections of the first text, beginning with the first four, say, From the two kinds of cognition that analyze dharmas up to the twelve kinds of cognition that reveal the middle and wait for the previous one to be crude and the middle to be marvelous.",
        "source": "T33n1717_007:0867b29_49"
    },
    {
        "source_sentence": "顯中雖在十二之數，亦得待前為麁。",
        "translation": "Even though it's among the twelve in the manifest, it can still wait until the prior one to become crude.",
        "source": "T33n1717_007:0867c02_50"
    },
    {
        "source_sentence": "顯中為妙，指圓真也。",
        "translation": "The expressed middle is marvelous, which refers to the perfect and true.",
        "source": "T33n1717_007:0867c03_51"
    },
    {
        "source_sentence": "次後三中，前二麁、後一妙。",
        "translation": "In the next three, the first two are crude, and the last one is subtle.",
        "source": "T33n1717_007:0867c04_52"
    },
    {
        "source_sentence": "第三復合前四，通判云前十八麁、後三妙，後三即第七也。",
        "translation": "The third combines the first four, which are generally judged to be the first 18 crude and the last three subtle, and the last three are the seventh.",
        "source": "T33n1717_007:0867c04_53"
    },
    {
        "source_sentence": "故後三中約三意說則自行為妙，亦約悟說。",
        "translation": "Therefore, in the last three, it's explained in terms of three meanings that self-practice is marvelous and also explained in terms of awakening.",
        "source": "T33n1717_007:0867c06_54"
    },
    {
        "source_sentence": "次約五味如文。",
        "translation": "Next, it's about the five flavors as described in the text.",
        "source": "T33n1717_007:0867c07_55"
    },
    {
        "source_sentence": "次歎用判功能者，若不約四教五味兩重判妙，焉知《法華》居一代之最？",
        "translation": "Next, he praises the function of judgement by using discernment, saying that if he doesn't judge marvelousness in terms of the four teachings and five flavors in two ways, how could he know that the Lotus is the most brilliant of all generations?",
        "source": "T33n1717_007:0867c07_56"
    },
    {
        "source_sentence": "比見讀此教者，尚反指《華嚴》，豈不與夫震地逸敷而不聞不見同耶？",
        "translation": "Compared with those who see and read this teaching, they still point back to the Flower Ornament, isn't it the same as someone who shakes the earth and doesn't hear and don't see?",
        "source": "T33n1717_007:0867c09_57"
    },
    {
        "source_sentence": "哀哉！",
        "translation": "What a pity!",
        "source": "T33n1717_007:0867c10_58"
    },
    {
        "source_sentence": "傷哉！",
        "translation": "What a pity!",
        "source": "T33n1717_007:0867c11_59"
    },
    {
        "source_sentence": "於中為三：先總述，次解釋，三「此中」下結意。",
        "translation": "There are three of these: first, a general statement; second, an explanation; and third, a conclusion under Here.",
        "source": "T33n1717_007:0867c11_60"
    },
    {
        "source_sentence": "初如文。",
        "translation": "The first is as explained in the text.",
        "source": "T33n1717_007:0867c12_61"
    },
    {
        "source_sentence": "次「何者」去釋中引《華嚴》者，一顯華嚴未會，二所顯三教猶麁。",
        "translation": "The next question, What's the reason? is to cite the Flower Ornament in the explanation, which shows that the Flower Ornament has yet to be combined, and the second shows that the three teachings are still crude.",
        "source": "T33n1717_007:0867c12_62"
    },
    {
        "source_sentence": "於中又四：先引《華嚴》，次明謬釋，三「此釋」下難，四「若得」下顯正。",
        "translation": "There are four more: first, he cites the Flower Ornament; second, he explains the mistaken interpretation; third, he presents the difficulty under This explanation; and fourth, he reveals the correct meaning under If you get it.",
        "source": "T33n1717_007:0867c13_63"
    },
    {
        "source_sentence": "初如文。",
        "translation": "The first is as explained in the text.",
        "source": "T33n1717_007:0867c15_64"
    },
    {
        "source_sentence": "次文中「世人釋云」等者，世人意言初住如實智與佛如實智不殊，故俱不知。",
        "translation": "In the next sentence, The explanation of the worldly people in the text says that the worldly people say that the first abode of true knowledge and the Buddha's true knowledge are not different from each other, so they don't know it.",
        "source": "T33n1717_007:0867c15_65"
    },
    {
        "source_sentence": "作此說者非但初濫於後，亦乃顯佛愚癡，故次文斥云「其實不允」。",
        "translation": "Those who say this not only confuse the first and the second, but also show the Buddha's folly, so the next sentence rejects it, saying, It's really unacceptable.",
        "source": "T33n1717_007:0867c17_66"
    },
    {
        "source_sentence": "次難又二：先通難，次歷教中約三教破云藏通二佛自無如實智，故不得云於自如實智，",
        "translation": "The next difficulty is further twofold: first, it's a general difficulty, and second, the successive teachings discuss the three teachings in order to refute the claim that the store communicates with the two buddhas because the Buddha has no such-and-such cognition, so it can't be said that he has such-and-such cognition.",
        "source": "T33n1717_007:0867c18_67"
    },
    {
        "source_sentence": "不知別佛雖得如實智，別初住不得如實智，云何言亦不知初住如實智？",
        "translation": "They don't know that even though the distinct buddhas have attained knowledge as it really is, the distinct first abode doesn't attain knowledge as it really is, so how can they say they also don't know the first abode of knowledge as it really is?",
        "source": "T33n1717_007:0867c20_68"
    },
    {
        "source_sentence": "若其別佛不知別教斷見思位真諦如實智，大成可笑。",
        "translation": "If a specific Buddha doesn't know the true truth of the state of views and thoughts that are cut off by specific teachings, then they'll become laughable.",
        "source": "T33n1717_007:0867c22_69"
    },
    {
        "source_sentence": "今言別教初住不得如實智者，即顯圓教初住得如實智，佛是究竟如實智，",
        "translation": "This is to show that the first abode of the perfect teaching attains knowledge as it really is. The Buddha is ultimately knowledge as it really is.",
        "source": "T33n1717_007:0867c23_70"
    },
    {
        "source_sentence": "此義可爾。",
        "translation": "This meaning can be so.",
        "source": "T33n1717_007:0867c25_71"
    },
    {
        "source_sentence": "若言不知，全是落漠。",
        "translation": "If someone says they don't know, they're completely in a state of indifference.",
        "source": "T33n1717_007:0867c25_72"
    },
    {
        "source_sentence": "故《大論》八十六云：「如實智者有二種：一者具足謂諸佛，二者不具足謂大菩薩。」",
        "translation": "That's why the Mahāprajñāpāramitā-śāstra says in Eighty-six, There are two kinds of cognition that are based on reality: those who are fully endowed refer to buddhas, and those who aren't fully endowed refer to great bodhisattvas.",
        "source": "T33n1717_007:0867c26_73"
    },
    {
        "source_sentence": "上能知下，豈有具足而不知不具足耶？",
        "translation": "How could there be someone who knows what's complete but doesn't know what's not complete?",
        "source": "T33n1717_007:0867c28_74"
    },
    {
        "source_sentence": "四顯正中云「事理二釋俱無滯」者，藏不知圓，於事無滯；",
        "translation": "The fourth is to show that the correct meaning of saying things and principles are both free from obstruction means that the store doesn't know the perfect, and it has no obstruction in things.",
        "source": "T33n1717_007:0867c29_75"
    },
    {
        "source_sentence": "下不知上，於理無滯。",
        "translation": "The inferior doesn't know the superior, and there's no obstruction in principle.",
        "source": "T33n1717_007:0868a01_76"
    },
    {
        "source_sentence": "次開中三：謂法、譬、合。",
        "translation": "In the next section, there are three: namely, dharmas, metaphors, and combinations.",
        "source": "T33n1717_007:0868a02_0"
    },
    {
        "source_sentence": "「如賤人舍王若過者」等者，麁智如舍，妙諦如王，以境妙故，智亦隨妙，",
        "translation": "Just as the king of a humble person's dwelling, if there's a mistake, and so forth means that debilitating cognition is like a dwelling and the marvelous truth is like a king, and because the object is marvelous, the cognition follows the marvelous.",
        "source": "T33n1717_007:0868a02_1"
    },
    {
        "source_sentence": "此約境發智說故也。",
        "translation": "This is because it's explained in terms of the cognition that arises from objects.",
        "source": "T33n1717_007:0868a04_2"
    },
    {
        "source_sentence": "次例餘境以立二智中，先總敘意，次正例。",
        "translation": "Next, it's an example of the other objects that establish the two kinds of cognition, first summarizing the meaning and then a correct example.",
        "source": "T33n1717_007:0868a04_3"
    },
    {
        "source_sentence": "初文云「二智多有所關」等者，非但唯對二諦而已；",
        "translation": "The first sentence, saying that the two kinds of knowledge have many bounds, etc., is not just an expression that only addresses the two truths.",
        "source": "T33n1717_007:0868a05_4"
    },
    {
        "source_sentence": "以二諦境通一切境，故因緣等亦應如是。",
        "translation": "Because the objects of the two truths extend to all objects, so should such [things] as causes and conditions be likewise.",
        "source": "T33n1717_007:0868a06_5"
    },
    {
        "source_sentence": "三料簡如文。",
        "translation": "The third is to summarize it as explained in the text.",
        "source": "T33n1717_007:0868a07_6"
    },
    {
        "source_sentence": "四斥謬立今經意中為八，先舉宗以質非，次「若破」下明宗所憑意，三「方便」下約今法斥彼人法，",
        "translation": "The fourth refutes errors and establishes the meaning of the present sūtra as eight: first, he cites the doctrine because it's qualitatively wrong; second, he explains the doctrine on which the doctrine relies under if it breaks down; third, he refutes that person's teaching by referring to the present teaching under skillful means.",
        "source": "T33n1717_007:0868a08_7"
    },
    {
        "source_sentence": "四「若作」下正顯其破相，五「若但」下明教法功能，六「世人」下結斥，",
        "translation": "The fourth, if it's done, correctly shows its refutation, the fifth, if it's only, explains the function of the teaching and the sixth, if it's worldly, concludes by rejecting it.",
        "source": "T33n1717_007:0868a10_8"
    },
    {
        "source_sentence": "七「今若」下重歎，八「如此」下形論意未周。",
        "translation": "The seventh is to repeatedly praise it under Now, and the eighth is to discuss its meaning under Thus.",
        "source": "T33n1717_007:0868a11_9"
    },
    {
        "source_sentence": "初文中三：先示法相，次質偏，三「既不」下示宗承所用。",
        "translation": "The first text has three parts: first, it shows the characteristics of the teaching; second, its quality is partial; and third, since it doesn't, it shows what the doctrine uses.",
        "source": "T33n1717_007:0868a12_10"
    },
    {
        "source_sentence": "初如文。",
        "translation": "The first is as explained in the text.",
        "source": "T33n1717_007:0868a14_0"
    },
    {
        "source_sentence": "次文中云「頗用世人」等者，今家章疏附理憑教，凡所立義不同他人隨其所弘偏讚己典。",
        "translation": "The next text says, Could it be used by the people of the world? and so forth? because the present commentary to the sūtra appends the principle based on the teaching that whatever doctrine is posited is different from others who follow what they teach and praise their own scriptures partially.",
        "source": "T33n1717_007:0868a14_1"
    },
    {
        "source_sentence": "若弘《法華》，偏讚尚失，況復餘耶？",
        "translation": "If we were to promote the Lotus, we would still fail to praise it partially, so why wouldn't we do so for others?",
        "source": "T33n1717_007:0868a16_2"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T33n1717_007:0868a17_0"
    },
    {
        "source_sentence": "既言開權顯實，豈可一向毀權？",
        "translation": "Since it's said to reveal the right and reveal the real, how can we always disparage the right?",
        "source": "T33n1717_007:0868a17_1"
    },
    {
        "source_sentence": "施本為開，開無異趣。",
        "translation": "Giving is originally enlightenment, and enlightenment has no different destinies.",
        "source": "T33n1717_007:0868a17_2"
    },
    {
        "source_sentence": "世人解經，或添以莊儒，或雜以綺飾，亦不同諸論偏申一門，或復通論直申大小。",
        "translation": "People understand the sūtras, sometimes they adorn them with ornaments and Confucianism or mix them with fancy decorations. They also differ from other treatises in that they partially explain a single doctrine but sometimes they explain both large and small directly in terms of the general theories.",
        "source": "T33n1717_007:0868a18_3"
    },
    {
        "source_sentence": "今採以佛經申《法華》意，遍破遍立，明教指歸，餘意可知。",
        "translation": "Now, we'll use the Buddha sūtras to explain the meaning of the Lotus, universally refuting and establishing it, explaining the teachings and referring them back, and the rest can be understood.",
        "source": "T33n1717_007:0868a20_4"
    },
    {
        "source_sentence": "次明宗所憑教又二：初正指經部，次「若巧」下明宗中所破，並如文。",
        "translation": "Next, it explains the teaching that the doctrine relies on: first, he correctly refers to the sūtra section, and second, skillfully, he explains what's refuted in the doctrine under If there's skillfulness, as explained in the text.",
        "source": "T33n1717_007:0868a21_5"
    },
    {
        "source_sentence": "四破相中先舉七二之相，次舉三意之相。",
        "translation": "In the four refutations of characteristics, seven and two characteristics are first cited, and three characteristics of mind are next cited.",
        "source": "T33n1717_007:0868a23_6"
    },
    {
        "source_sentence": "初如文，次文云「又縱廣引諸經論」等者，世人釋二諦義，但廣引教釋二諦之名，",
        "translation": "The first one is as explained in the text, and the second one says, Furthermore, even though it extensively cites sūtras and treatises, etc.",
        "source": "T33n1717_007:0868a24_7"
    },
    {
        "source_sentence": "不能分別名下之旨，況七種二諦一一復有隨情等三？",
        "translation": "They can't discriminate the meaning beneath names, so why wouldn't there be three following feelings and so forth in each of the seven kinds of the two truths?",
        "source": "T33n1717_007:0868a26_8"
    },
    {
        "source_sentence": "是故世人但各執教，不知教是赴機異說。",
        "translation": "Therefore, the people of the world simply cling to doctrine and do not know that doctrine is a teaching that goes to different interpretations.",
        "source": "T33n1717_007:0868a27_9"
    },
    {
        "source_sentence": "既迷教旨，當知所引但成三藏隨情二諦，能觀之智秖成化他權實二智。",
        "translation": "Since they're deluded about the teaching, you should know that the only thing cited is the two noble truths of the Tripiṭaka and the two noble truths of following feelings, and the knowledge that can contemplate them together form the two kinds of cognition of the right and reality of transforming others.",
        "source": "T33n1717_007:0868a28_10"
    },
    {
        "source_sentence": "既不出於初番隨情，當知尚闕初教隨智及隨情智，況餘六三意耶？",
        "translation": "Since it doesn't come from the first follower, you should know that the first teaching still lacks the subsequent knowledge of following and the subsequent knowledge of feelings, so why wouldn't the other six or three minds?",
        "source": "T33n1717_007:0868b01_11"
    },
    {
        "source_sentence": "五功能中二：初舉初番以況後諸番，次「若尋」下廣舉下六番所破，言「凡破幾外見」等者，",
        "translation": "Of the five functions, there are two: first, he cites the first one to describe the subsequent ones; second, he extensively cites the following six refutations under If you search, and then he says, How many external views does he refute?",
        "source": "T33n1717_007:0868b02_12"
    },
    {
        "source_sentence": "破一切外人諸宗僻計也。",
        "translation": "It's a refutation of all the non-Buddhist theories and mistaken conceptions.",
        "source": "T33n1717_007:0868b04_13"
    },
    {
        "source_sentence": "「凡破幾權經論，立幾權經論」者，今以《法華經》意以為破立故，得遍破遍立，",
        "translation": "Where there's a treatise that refutes the doctrine of how many right sūtras and a treatise that establishes how many right sūtras, now it's because the meaning of the Lotus Sutra is to refute and establish that they can be universally refuted and universally established.",
        "source": "T33n1717_007:0868b05_14"
    },
    {
        "source_sentence": "施權故立，廢權故破，或權實俱立，或權實俱破，若開若會，準例可知。",
        "translation": "It's established because of giving the right, refuted because of discarding the right, or established together with the right and the real, or refuted together with the right and the real, and it can be understood by analogy whether it's opened or closed.",
        "source": "T33n1717_007:0868b07_15"
    },
    {
        "source_sentence": "六七可知。",
        "translation": "The sixth and seventh can be understood.",
        "source": "T33n1717_007:0868b08_16"
    },
    {
        "source_sentence": "第八形論意中云「如此破會莫以中論相比」者，依向所說，豈比《中論》末代通經，",
        "translation": "The eighth commentary on the meaning of the Form Treatise says, Thus, don't compare such a refutation to the middle way with the middle way. This is based on what was said earlier, so how could it be compared to the final and universal sūtras of the Middle Way?",
        "source": "T33n1717_007:0868b08_17"
    },
    {
        "source_sentence": "雖兼別含通，豈能委明二十一種單複開合適時破會逗物之妙結撮始終耶？",
        "translation": "Even though it's combined with the distinctive and inclusive, how can we explain the twenty-one kinds of simply repeatedly opening and closing at the right time to break up the marvelous fetters that tease things and gather the beginning and end?",
        "source": "T33n1717_007:0868b10_18"
    },
    {
        "source_sentence": "問：一家所承本宗龍樹，今此何以反斥本宗？",
        "translation": "Question: The original doctrine inherited by one family is that of the nāga tree. Now, why does this contradict the original doctrine?",
        "source": "T33n1717_007:0868b12_19"
    },
    {
        "source_sentence": "答：本承觀法，不承論所破勢，論意唯以四句觀法破大小執，令末代行者歸心有由，",
        "translation": "Answer: In the past, they inherited the method of contemplation and did not inherit the momentum to be broken by the treatise. The meaning of the treatise is that it only breaks down big and small clinging with four statements of contemplation of doctrine so as to enable later practitioners to return to their minds.",
        "source": "T33n1717_007:0868b13_20"
    },
    {
        "source_sentence": "若部意所立功歸於此。",
        "translation": "If the merit established by the school's intention is to be attributed to this, then...",
        "source": "T33n1717_007:0868b15_21"
    },
    {
        "source_sentence": "若論破會者，未若《法華》，故權實本迹遣偏廢近，久遠聖旨於茲始存，",
        "translation": "If we discuss the refutation of the assembly, we won't see it like the Lotus. Therefore, the authoritative and real original traces are rejected as partial and discarded as near, and the noble teachings have been preserved here for a long time.",
        "source": "T33n1717_007:0868b16_22"
    },
    {
        "source_sentence": "故獲陀羅尼由三昧之力，師資之宗宛如符契。",
        "translation": "That's why the dhāraṇī was obtained because of the power of samādhi, and the teacher's doctrine was as if it were a talisman.",
        "source": "T33n1717_007:0868b17_23"
    },
    {
        "source_sentence": "對三諦中二：先重敘五境，次對境明智。",
        "translation": "Of the three truths, there are two: first, we'll repeatedly describe the five objects, and second, we'll explain cognition in terms of objects.",
        "source": "T33n1717_007:0868b18_24"
    },
    {
        "source_sentence": "初文又三：初總標來意，次略列三境，三相對立五解釋。",
        "translation": "The first text has three parts: the first summarizes the meaning of what's coming, the second briefly lists the three objects, and the third establishes five explanations in relation to each other.",
        "source": "T33n1717_007:0868b19_25"
    },
    {
        "source_sentence": "初如文。",
        "translation": "The first is as explained in the text.",
        "source": "T33n1717_007:0868b21_26"
    },
    {
        "source_sentence": "次二文者，前單作諦名，以真俗等名為便，今欲對境明智，境作漏無漏名便也。",
        "translation": "The next two texts are simply the names of the truths that were previously given, and they're called convenient because they're called true and conventional, but now they want to clarify cognition with respect to objects, and their objects are called contaminated and uncontaminated by the name便.",
        "source": "T33n1717_007:0868b21_27"
    },
    {
        "source_sentence": "前亦照境智，從權實作名與今異者，若照境時從權實為名，若論境體應名漏等，",
        "translation": "When illuminating an object, the name is given to it from the real thing. If one were to discuss the substance of that object, they would have to be called impure and so on.",
        "source": "T33n1717_007:0868b23_28"
    },
    {
        "source_sentence": "漏是俗，無漏是真，雙非是中，以中對二得三境名，是故皆云對漏無漏為三法。",
        "translation": "The impure ones are mundane, the pure ones are real. Neither is the middle nor neither. Because the middle is opposed to two, it receives the name of three objects. That is why they are all said to be oppositional to impure and pure as three dharmas.",
        "source": "T33n1717_007:0868b25_29"
    },
    {
        "source_sentence": "次對境明智者為三：先標五種相，次境智相入明五，三解釋。",
        "translation": "Next, there are three kinds of cognition of objects: the first describes five kinds of characteristics, the second is the understanding of the characteristics of cognition of objects, and the third is an explanation.",
        "source": "T33n1717_007:0868b27_30"
    },
    {
        "source_sentence": "釋中三：先正釋，次判，三開。",
        "translation": "There are three explanations: first, a correct explanation; second, a judgment; and third, an opening.",
        "source": "T33n1717_007:0868b28_31"
    },
    {
        "source_sentence": "初文又二：先教，次觀。",
        "translation": "The first text has two parts: the first teaches, and the second contemplates.",
        "source": "T33n1717_007:0868b29_32"
    },
    {
        "source_sentence": "教中文自五重不同，初番為三：初明三境發三智，次解釋，三「世人」下引同。",
        "translation": "The first is to explain that the three objects give rise to the three kinds of cognition, and the second is to explain that the three are the same as cited under worldly people.",
        "source": "T33n1717_007:0868b29_33"
    },
    {
        "source_sentence": "初如文。",
        "translation": "The first is as explained in the text.",
        "source": "T33n1717_007:0868c02_34"
    },
    {
        "source_sentence": "次文者為二：先釋行相，次「今若」下結示。",
        "translation": "The next text is divided into two: first, he explains the characteristics of practice, and then he concludes by showing them under Now.",
        "source": "T33n1717_007:0868c02_35"
    },
    {
        "source_sentence": "初文者下去相入例此可知。",
        "translation": "The first text follows the example of mutual entry, which can be understood here.",
        "source": "T33n1717_007:0868c03_36"
    },
    {
        "source_sentence": "三引同中「破無明成佛」者，此是通教被接菩薩至八地後破無明惑，成別圓初地初住八相佛也。",
        "translation": "The third quote in the same text, destroying ignorance and becoming a buddha, refers to the general teaching that it's taken by bodhisattvas up to the eighth ground to break through the afflictions of ignorance and become a buddha of the eight phases at the first abode of the first ground of the distinctively perfected first ground.",
        "source": "T33n1717_007:0868c04_37"
    },
    {
        "source_sentence": "而世人唯知採經文，而不知教門深淺。",
        "translation": "People in the world only know the texts of the scriptures but they do not know the depth and shallowness of the doctrine.",
        "source": "T33n1717_007:0868c06_38"
    },
    {
        "source_sentence": "圓入通中又三：先正釋。",
        "translation": "There are three more ways to enter into the penetration of perfection: first, he explains it correctly.",
        "source": "T33n1717_007:0868c07_39"
    },
    {
        "source_sentence": "「藏智」者，不同諸論含藏種子，今以圓教諸法具足含一切法義同於藏。",
        "translation": "The term store wisdom means that it's different from the treatises that contain store seeds, but now we're using the perfect teaching that all dharmas are fully contained in all dharmas with the same meaning as the store.",
        "source": "T33n1717_007:0868c07_40"
    },
    {
        "source_sentence": "今秖觀所入之空，即見藏理，故云「不因別境」。",
        "translation": "Now, the emptiness that's entered by debilitating contemplation is the principle of seeing the store, so it's called not because of separate objects.",
        "source": "T33n1717_007:0868c09_41"
    },
    {
        "source_sentence": "以祕密智力，能令眾生發如此智。",
        "translation": "By the power of mysterious wisdom, I can cause sentient beings to give rise to such wisdom.",
        "source": "T33n1717_007:0868c10_42"
    },
    {
        "source_sentence": "次比決。",
        "translation": "Next, it's a comparative judgment.",
        "source": "T33n1717_007:0868c11_43"
    },
    {
        "source_sentence": "三「大經」下引證。",
        "translation": "Third, under Mahāprajñāpāramitā-sūtra, he cites proof.",
        "source": "T33n1717_007:0868c11_44"
    },
    {
        "source_sentence": "次別三智為二：先釋，次引《地持》。",
        "translation": "The next three kinds of cognition are divided into two: first, an explanation, and second, a quote from the Earth-holder.",
        "source": "T33n1717_007:0868c11_45"
    },
    {
        "source_sentence": "「二障」者，煩惱障及智障，具如《止觀》第六卷達摩欝多羅釋。",
        "translation": "The term two hindrances refers to the afflictive hindrances and cognitive hindrances, as explained in the sixth volume of Cessation and Contemplation by Dharmagupta in the explanation.",
        "source": "T33n1717_007:0868c12_46"
    },
    {
        "source_sentence": "今家依《大品》、《大論》開為三惑，是故智障兼於事理，障事智者，",
        "translation": "The present school relies on the Mahāprajñāpāramitā-sūtra and Mahāprajñāpāramitā to divide it into three passions. Therefore, the obstacle of knowledge is combined with the obstacle of both phenomena and principle.",
        "source": "T33n1717_007:0868c13_47"
    },
    {
        "source_sentence": "是塵沙惑，障理智者，是無明惑。",
        "translation": "These are the defilements of dust and sand. The one who obstructs reasoning and knowledge is the defilement ignorance.",
        "source": "T33n1717_007:0868c15_48"
    },
    {
        "source_sentence": "次圓入別二智中四：初略立，次「兩智」下對前辨體，三引論師意證，",
        "translation": "Next, there are four of the two kinds of cognition of perfect entry that are distinguished: first, a brief explanation; second, two kinds of cognition that contrast the prior by identifying their essence; and third, citing the meaning of the treatise master to confirm it.",
        "source": "T33n1717_007:0868c16_49"
    },
    {
        "source_sentence": "四示今意。",
        "translation": "Fourth, it shows the present meaning.",
        "source": "T33n1717_007:0868c17_50"
    },
    {
        "source_sentence": "前三如文。",
        "translation": "The first three are as explained in the text.",
        "source": "T33n1717_007:0868c17_51"
    },
    {
        "source_sentence": "四今意中云「前兩智是緣脩」者，今家判在緣脩之位屬空假觀，地人但云地前為緣脩不云空假。",
        "translation": "Fourth, the present meaning is that the first two kinds of cognition are conditioned cultivation because the present school judges that the stage of conditioned cultivation belongs to the contemplation of emptiness and hypothesis, but people in the earth simply say that it's conditioned cultivation before the earth and not emptiness and hypothesis.",
        "source": "T33n1717_007:0868c18_52"
    },
    {
        "source_sentence": "次圓三智中二：先釋，次引論證，並如文。",
        "translation": "Next, there are two aspects of the perfect three kinds of cognition: first, an explanation; second, a discussion that cites the treatise to confirm it, as explained in the text.",
        "source": "T33n1717_007:0868c20_53"
    },
    {
        "source_sentence": "次明觀成，於中二：先辨因果，次「上明」下例智相入。",
        "translation": "Next, he explains the accomplishment of contemplation, in which there are two: first, he identifies causes and effects, and then he explains the above as an example of the entry of knowledge.",
        "source": "T33n1717_007:0868c21_54"
    },
    {
        "source_sentence": "初文為二：初總辨因果，次對三觀。",
        "translation": "The first text is divided into two: the first summarizes causes and effects, and the second contrasts them with the three contemplations.",
        "source": "T33n1717_007:0868c22_55"
    },
    {
        "source_sentence": "初文具如《止觀》顯體中初說。",
        "translation": "The first text is as explained in the first section of Zhiguan, which shows the essence.",
        "source": "T33n1717_007:0868c23_56"
    },
    {
        "source_sentence": "次三觀中二：先引《纓珞》，次正對三觀。",
        "translation": "In the next three contemplations, there are two: first, he cites the Śāriputra, and second, he correctly contrasts the three contemplations.",
        "source": "T33n1717_007:0868c24_57"
    },
    {
        "source_sentence": "初文言「纓珞三觀」，具如《止觀》第三記及前後所引。",
        "translation": "The first text says the three contemplations of the garland, as explained in the third entry in the Zhiguan jing and those cited before and after.",
        "source": "T33n1717_007:0868c25_0"
    },
    {
        "source_sentence": "修觀義具如《止觀》破法遍次第不次第破也。",
        "translation": "The meaning of cultivating contemplation is fully explained in the Zhiguan lun, which refutes the pervasive and sequential order of the teachings and doesn't break them down sequentially.",
        "source": "T33n1717_007:0868c26_1"
    },
    {
        "source_sentence": "次「今用」下正約三觀明於觀智。",
        "translation": "Next, under Now used, we'll explain the cognition of contemplation in terms of the three contemplations.",
        "source": "T33n1717_007:0868c27_2"
    },
    {
        "source_sentence": "次判麁妙亦二：先教，次味。",
        "translation": "The next discernment of crude and subtle is also twofold: first, the teaching; second, the taste.",
        "source": "T33n1717_007:0868c27_3"
    },
    {
        "source_sentence": "初中二：先判前兩都不成三諦，故不用。",
        "translation": "In the first, there are two: First, we'll judge that the first two don't make up the three truths, so we won't use them.",
        "source": "T33n1717_007:0868c28_4"
    },
    {
        "source_sentence": "◎法華玄義釋籤卷第七",
        "translation": "Fascicle 7 of the Explanation of the Profound Meaning of the Lotus Sutra",
        "source": "T33n1717_007:0868c29_5"
    }
]