[
    {
        "source_sentence": "法華玄義釋籤卷第十",
        "translation": "Fahua xuanyi zhi shou, vol. 10",
        "source": "T33n1717_010:0883b20_0"
    },
    {
        "source_sentence": "天台沙門湛然述",
        "translation": "Tiantai shaman Zhanran shu",
        "source": "T33n1717_010:0883b22_0"
    },
    {
        "source_sentence": "◎第四位妙為四：初明來意，次「但位」下略敘諸位權實，三「今經」下略述今經，",
        "translation": "The fourth level of subtlety is divided into four: first, it explains the meaning of the coming teaching; second, it briefly describes the authoritative and real stages under mere states; third, it briefly describes the present sūtra under",
        "source": "T33n1717_010:0883b23_0"
    },
    {
        "source_sentence": "四「小草」下依經廣解。",
        "translation": "Fourth, under small grass, he explains it in detail according to the sūtras.",
        "source": "T33n1717_010:0883b24_1"
    },
    {
        "source_sentence": "初文中言「體宗用足」者，境，體也；",
        "translation": "The first part of the sentence says, essence and doctrine are sufficient in terms of function.",
        "source": "T33n1717_010:0883b25_2"
    },
    {
        "source_sentence": "行，宗也；",
        "translation": "Practice is the doctrine.",
        "source": "T33n1717_010:0883b26_0"
    },
    {
        "source_sentence": "智，用也。",
        "translation": "cognition is also function.",
        "source": "T33n1717_010:0883b26_1"
    },
    {
        "source_sentence": "次文中言「地攝等論別敘一途」者，此等多是別教一門，義不兼於大小，",
        "translation": "The next sentence says, Such treatises as the Earth-containing Treatise describe one path separately because these are mostly distinct teachings that don't combine large and small in meaning.",
        "source": "T33n1717_010:0883b26_2"
    },
    {
        "source_sentence": "方等諸經明位委悉不及《瓔珞》，般若諸經明位委悉不及《仁王》，然《瓔珞》偏存別門，",
        "translation": "The Vaiśeṣika sūtras explain the stages in detail that aren't as detailed as the Yingluo, and the Prajñāpāramitā sūtras explain the stages in detail that aren't as detailed as the Renwang, but the",
        "source": "T33n1717_010:0883b28_0"
    },
    {
        "source_sentence": "《仁王》多在圓別及含通意，而並不明辨位之意，尚不辨麁妙，何況論開？",
        "translation": "The Humane Kings often focuses on the meaning of perfect distinctions and contains the meaning of penetration, but they don't understand the meaning of discerning positions, and they don't yet discern crude and subtle, so why wouldn't they discuss",
        "source": "T33n1717_010:0883b29_1"
    },
    {
        "source_sentence": "故知但是當味明義而不辨於始終位意。",
        "translation": "Therefore, it's known that they only taste the meaning of clarity and don't discern the meaning of the beginning and end stages.",
        "source": "T33n1717_010:0883c02_2"
    },
    {
        "source_sentence": "所言「意」者，諸教何故權實不同？",
        "translation": "What's called mind, why are the teachings different in terms of right and wrong?",
        "source": "T33n1717_010:0883c03_3"
    },
    {
        "source_sentence": "諸味何故增減差異？",
        "translation": "Why are the flavors increasing and diminishing differently?",
        "source": "T33n1717_010:0883c04_4"
    },
    {
        "source_sentence": "謂施開廢等即其意也。",
        "translation": "It's the meaning of generosity, initiation, abolition, and so forth.",
        "source": "T33n1717_010:0883c04_5"
    },
    {
        "source_sentence": "三今經者，先略敘意，次略屬對。",
        "translation": "The third is the present sūtra, which first briefly describes the meaning and then briefly confronts it.",
        "source": "T33n1717_010:0883c05_6"
    },
    {
        "source_sentence": "初中今經明位雖即不及彼之二經明位似細，而今經義兼大小及開判等，",
        "translation": "In the first, the present sūtra explains the level. Although it is not as detailed as the two other scriptures that explain the level, the meaning of the present sūtra includes both large and small size and opening distinctions, etc.",
        "source": "T33n1717_010:0883c06_7"
    },
    {
        "source_sentence": "則諸經未明。",
        "translation": "Then, the sūtras don't explain it.",
        "source": "T33n1717_010:0883c07_8"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T33n1717_010:0883c08_9"
    },
    {
        "source_sentence": "如〈序〉天雨四華，〈方便〉開示悟入，〈譬喻〉遊於四方，〈化城〉五百由旬，",
        "translation": "It's like the Preface that rains four flowers from heaven, the Skillful Meaning that reveals awakening and entering, the Parable that travels in all directions, and the Transformation City that's five hundred yojanas long.",
        "source": "T33n1717_010:0883c08_10"
    },
    {
        "source_sentence": "並迹門實位也；",
        "translation": "They are all in the real state of the aspect of traces.",
        "source": "T33n1717_010:0883c09_11"
    },
    {
        "source_sentence": "草菴、化城、三草二木並迹門權位也。",
        "translation": "The grass, the transformation city, the three grasses, and two trees are both in the rightful position of the gate of traces.",
        "source": "T33n1717_010:0883c10_12"
    },
    {
        "source_sentence": "分別功德始從無生即初住也，乃至一生即等覺也，此亦本實位也。",
        "translation": "Discriminating merit begins with nonarising, which is the first abode, and ends with one lifetime, which is virtual enlightenment, which is also the original real stage.",
        "source": "T33n1717_010:0883c11_0"
    },
    {
        "source_sentence": "菴城被廢唯存渚宅，草木並依一地一雨，此是會諸權位，咸歸一實，故云麁判權實。",
        "translation": "When the city of Vaiśravaṇa was abolished, only the castle and residences were preserved, and grass and trees all depended on one land and one rain. This is to gather the rightful positions in order to return them all",
        "source": "T33n1717_010:0883c12_1"
    },
    {
        "source_sentence": "「文不盡度」者，相傳云：西方《法華》布一由旬。",
        "translation": "The phrase inexhaustible text means that it's said by tradition that the Lotus Sutra spreads for a yojana in the west.",
        "source": "T33n1717_010:0883c14_2"
    },
    {
        "source_sentence": "次屬對中二：初引經，次屬對。",
        "translation": "Next, there are two: the first quote from the sūtra, and the second that belongs to the opposite.",
        "source": "T33n1717_010:0883c15_3"
    },
    {
        "source_sentence": "四廣釋者，文中自分三草二木及以一實以為六位。",
        "translation": "The four extensive explanations are that the text uses three distinctive grasses, two trees, and one real thing as six stages.",
        "source": "T33n1717_010:0883c16_4"
    },
    {
        "source_sentence": "初小草中三：初略引經以立，次辨其因果，三「人位」下正釋。",
        "translation": "The first is a brief explanation of the three parts of the lesser weeds: first, citing the sūtras to establish them; second, explaining their causes and effects; and third, correctly explaining them under person status.",
        "source": "T33n1717_010:0883c17_5"
    },
    {
        "source_sentence": "釋中二：謂人、天。",
        "translation": "In the explanation, there are two: humans and gods.",
        "source": "T33n1717_010:0883c18_6"
    },
    {
        "source_sentence": "人中三：初辨其因，次「下品」下略明其果，三「皆是」下重明人主。",
        "translation": "Among humans, there are three: the first identifies their causes, the second briefly explains their results under inferior qualities, and the third further explains the human lord under all.",
        "source": "T33n1717_010:0883c19_7"
    },
    {
        "source_sentence": "初如文。",
        "translation": "The first is as explained in the text.",
        "source": "T33n1717_010:0883c20_8"
    },
    {
        "source_sentence": "次文中人位四輪者，《俱舍》云「金銀銅鐵輪，一二三四洲」，鐵輪王一洲，",
        "translation": "In the next sentence, there are four wheels of humans: the Kuśinagara says, The wheel of gold, silver, copper, and iron is one, two, three, and four continents, and the iron wheel king is one continent.",
        "source": "T33n1717_010:0883c20_9"
    },
    {
        "source_sentence": "乃至金輪王四洲。",
        "translation": "It goes so far as to the four continents of the king of the wheel of gold.",
        "source": "T33n1717_010:0883c22_10"
    },
    {
        "source_sentence": "夫輪王者先行七法：一給施貧乏，二敬民孝養，三四時八節以祭四海，",
        "translation": "The king of the wheel is preceded by seven rules: first, he bestows charity on the poor; second, he pays respect to the people who are filial to them; third, he makes offerings to the four seas at three, four, and eighth",
        "source": "T33n1717_010:0883c22_11"
    },
    {
        "source_sentence": "四時修忍辱，五六七除三毒，然後沐浴受齋發誓等，次神寶自應等。",
        "translation": "Fourth, he cultivates forbearance at the right time, removes the three poisons in five, six, seven, and so forth, then bathes, undertakes purification, makes a vow, and so forth, and then follows",
        "source": "T33n1717_010:0883c24_12"
    },
    {
        "source_sentence": "人主秖是福中之最，為福之最故報為人主。",
        "translation": "The lord of humans is the best of virtues, and because it's the best of virtues, the reward is the lord of humans.",
        "source": "T33n1717_010:0883c26_0"
    },
    {
        "source_sentence": "次明天位，自分三界諸天不同，於中先略敘三界天因，次正釋。",
        "translation": "Next, in the heavenly stage, there are the gods of the three realms that differ from each other. Here, we first briefly describe the causes of the gods of the three realms, and then we'll explain them correctly.",
        "source": "T33n1717_010:0883c27_1"
    },
    {
        "source_sentence": "釋中初四王有四十住處，略依《正法念》明四王住處。",
        "translation": "In the explanation, the first four kings have forty dwelling places, which are briefly explained in the Sutra of Right Dharma Mindfulness as the dwelling places of the four kings.",
        "source": "T33n1717_010:0883c28_2"
    },
    {
        "source_sentence": "「持鬘天」者，《俱舍》云：「堅守及持鬘，恒憍大王眾，如次居四級，",
        "translation": "The name Śakra Devānām-Indra refers to the sūtra, which says, Consisting of strong guards and Śakra Devānām-Indra, the great king of the Ganges lives in four rows one after the other.",
        "source": "T33n1717_010:0883c29_3"
    },
    {
        "source_sentence": "亦住餘七山」，身量壽命具如《俱舍．世品》。",
        "translation": "They also live in the other seven mountains. Their body size and life span are as described in the Kuśinagara:",
        "source": "T33n1717_010:0884a02_4"
    },
    {
        "source_sentence": "「四天王」者，《大論》云：「東方提頭賴吒，秦言持國主，南方毘留離，",
        "translation": "The four heavenly kings refers to the Mahāprajñāpāramitā-śāstra, which says, In the east, Dhṛtarāṣṭra is the lord of the state in the Qin language and in the south, Virūḍ",
        "source": "T33n1717_010:0884a03_0"
    },
    {
        "source_sentence": "秦言增長主，西方毘留波叉，秦言雜主，北方毘沙門，秦言多聞主。」",
        "translation": "The Qin say grower, the Virūḍhaka in the west, the mixed master in the Qin, the Vaiśravaṇa in the north, and the well-versed master in the Qin.",
        "source": "T33n1717_010:0884a04_1"
    },
    {
        "source_sentence": "此四為王主四天下，四級各有十住處，此四十天名皆從因行而立。",
        "translation": "These four heavens are the kings of the four continents, each with ten abodes on each of the four levels. The names of these forty celestial beings are established by reason of their causality.",
        "source": "T33n1717_010:0884a05_2"
    },
    {
        "source_sentence": "「三歸」者，準《希有經》中廣校量三歸功德，云「教四天下及六欲天得四果，",
        "translation": "The expression three refuges refers to the extensive proof of the merit of the three refuges in the rare sūtras, which say, Teaching the four heavenly realms and the six desire heavens to attain the four fruits,",
        "source": "T33n1717_010:0884a07_3"
    },
    {
        "source_sentence": "不如三歸依功德多。」",
        "translation": "It's not as great as the merit of the three refuges.",
        "source": "T33n1717_010:0884a09_4"
    },
    {
        "source_sentence": "又如《增一》中有忉利天子五衰相現當生猪中，愁憂之聲聞於天帝。",
        "translation": "Also, as in the Incremental One, there are five signs of decay in the Trāyastriṃśa gods who appear to be born among pigs, and a grieved śrāvaka is born in Indra.",
        "source": "T33n1717_010:0884a09_5"
    },
    {
        "source_sentence": "天帝聞之喚來告曰：汝可三歸。",
        "translation": "When Emperor Tiandi heard this, he summoned him and told him, You may return three times.",
        "source": "T33n1717_010:0884a11_6"
    },
    {
        "source_sentence": "即時如教便免生猪。",
        "translation": "Immediately, as instructed, he then escaped the pig.",
        "source": "T33n1717_010:0884a11_7"
    },
    {
        "source_sentence": "佛說偈云，諸有歸依佛，不墜三惡趣，盡漏處人天，便當至涅槃。",
        "translation": "The Buddha spoke a verse, saying, All sentient beings who take refuge in the Buddha won't fall into the three bad destinies, and they'll reach nirvāṇa when their contaminants are ended among humans and gods.",
        "source": "T33n1717_010:0884a12_8"
    },
    {
        "source_sentence": "三自歸已生長者家，還得出家成於無學。",
        "translation": "Three, he takes refuge in the home of those who have grown up and returns home to become post-learning after leaving home.",
        "source": "T33n1717_010:0884a14_0"
    },
    {
        "source_sentence": "文云「十拍手」者，恐是先持性戒，加爾所時受三歸依，尋即命終故得此報，",
        "translation": "The text says ten strokes of the hand because it's feared that they previously observed the precepts by nature and received the three refuges at that point in time, so they were able to receive this reward when their lives ended.",
        "source": "T33n1717_010:0884a15_0"
    },
    {
        "source_sentence": "依心不雜故得白名，天勝輪王理數然耳。",
        "translation": "It's because the mind isn't mixed, so it gets the white name, which is true in principle for the wheel-turning king of gods.",
        "source": "T33n1717_010:0884a16_1"
    },
    {
        "source_sentence": "言「十六倍」者，從勝歸故。",
        "translation": "The expression sixteenfold refers to the fact that it returns from superiority.",
        "source": "T33n1717_010:0884a17_2"
    },
    {
        "source_sentence": "「山河流出」者，經中一切皆云流河，乃至亦有酒河等，此四十天並須委悉以其因行而消果名(云云)。",
        "translation": "The phrase mountains and rivers flow out means that everything in the sūtras is called a river of flow, even to the point where there are also rivers of wine and so forth, and these forty gods all have to be entrusted with the name of",
        "source": "T33n1717_010:0884a18_3"
    },
    {
        "source_sentence": "「峻崕」者，河濟難度故。",
        "translation": "The phrase high and steep means that it's difficult to cross the river.",
        "source": "T33n1717_010:0884a20_4"
    },
    {
        "source_sentence": "「果命」者，淨戒如果。",
        "translation": "The phrase resultant life refers to the pure precepts if they are present.",
        "source": "T33n1717_010:0884a21_5"
    },
    {
        "source_sentence": "又種果樹，塔福最多，白為色本，如華見者皆生歡喜，以水滅火行慈悲道，",
        "translation": "He planted fruit-bearing trees, and the stupa was blessed with white as its color. All those who saw this flower rejoiced because he extinguished the fire by water and walked on the path of compassion.",
        "source": "T33n1717_010:0884a21_6"
    },
    {
        "source_sentence": "和瞋諍故愛欲，說法會生善境故，見淨田故動信心意，令他歡喜如樂遊戲，",
        "translation": "Because of reconciling anger and attachment to sensual desires, because the assembly of doctrine produces good objects; because of seeing pure fields, it moves the will for enlightenment, causing others to rejoice as if they",
        "source": "T33n1717_010:0884a23_7"
    },
    {
        "source_sentence": "比因釋名，準此可知。",
        "translation": "The explanation of names by reason of their causes can be understood in the light of this.",
        "source": "T33n1717_010:0884a25_8"
    },
    {
        "source_sentence": "「日行天外道說為日曜」等者，外人又計北方星不沒者，又《立世阿毘曇》有外道計大地恒去不息，",
        "translation": "The non-Buddhist theories that the sun moves in the sky and is said to be the sun, mean that non-Buddhists also believe that the stars of the northern direction don't disappear. Also, according to the Lishi abhidhar",
        "source": "T33n1717_010:0884a25_9"
    },
    {
        "source_sentence": "佛破云擲物向前物應向後。",
        "translation": "The Buddha refutes the teaching that tossed things should go forward and things should go backward.",
        "source": "T33n1717_010:0884a27_10"
    },
    {
        "source_sentence": "又有計云地恒墜下，佛言擲物向上應不至地。",
        "translation": "It's also said that the ground always falls down, and the Buddha says tossing things upward shouldn't reach the ground.",
        "source": "T33n1717_010:0884a28_11"
    },
    {
        "source_sentence": "有計星不移地自動轉，佛言射應不至堋。",
        "translation": "Some people think that the stars automatically change without moving from place to place, but the Buddha says it shouldn't reach space.",
        "source": "T33n1717_010:0884a29_12"
    },
    {
        "source_sentence": "六欲天因應具十善，今云不殺乃至七戒者，具受分持，所持增上故得名耳。",
        "translation": "The six heavens of desire have the ten good qualities as a result of their being endowed with them, and now it's called not killing or even the seven precepts because they are fully received and partially upheld, which is why they're",
        "source": "T33n1717_010:0884b01_13"
    },
    {
        "source_sentence": "「世間戒」者，譏嫌戒也。",
        "translation": "The phrase worldly precepts refers to the remonstrant precepts.",
        "source": "T33n1717_010:0884b03_14"
    },
    {
        "source_sentence": "餘有諸天壽命身量等，具如《俱舍》、《婆沙》，此為略知次位，不事廣論。",
        "translation": "The other gods have life spans, bodies, and so on, as described in the Kuśinagara and Vibhāṣā councils. This is a brief overview of their ranks and does not discuss them extensively.",
        "source": "T33n1717_010:0884b03_15"
    },
    {
        "source_sentence": "中草位中二：先定人以判因果，次正釋。",
        "translation": "In the midst of the grass, there are two: first, a person who determines cause and effect in order to judge cause and effect, and then he explains it correctly.",
        "source": "T33n1717_010:0884b05_16"
    },
    {
        "source_sentence": "釋中三：先破古，次略示二論，三廣釋有門。",
        "translation": "The explanation has three parts: first, it refutes the ancient teachings; second, it briefly shows the two treatises; and third, it explains in detail the existence of the perspective.",
        "source": "T33n1717_010:0884b06_17"
    },
    {
        "source_sentence": "「二十七賢聖」者，《中阿含．三十福田經》「長者問佛：福田有幾？",
        "translation": "Twenty-seven good men and sages refers to the sūtra on the 30 fields of merit in the Middle Length Āgamas, which says, The elder asked the Buddha, How many fields of merit are there?",
        "source": "T33n1717_010:0884b07_18"
    },
    {
        "source_sentence": "佛言：學人有十八，無學有九。",
        "translation": "The Buddha said: There are eighteen for the seeker; nine for the adept.",
        "source": "T33n1717_010:0884b08_19"
    },
    {
        "source_sentence": "學十八者，謂信行、法行、信解、見得、身證、家家、一種子、向初果、得初果、向二果、二果、向三果、三果，",
        "translation": "The eighteen forms of training are the faith-practice, the doctrine-practice, the conviction-faith, the view-attainment, the body-realisation, the personal realization, the homelessness, the one-se",
        "source": "T33n1717_010:0884b09_20"
    },
    {
        "source_sentence": "及五種含，謂中、生、行、不行、上流。",
        "translation": "and five kinds of containment: middle, arising, proceeding, not proceeding and upward in the stream.",
        "source": "T33n1717_010:0884b11_21"
    },
    {
        "source_sentence": "九無學者，思、進、退、不退、不動、住、護、慧、俱。」",
        "translation": "The nine post learners are thought, advancement, retrogression, non-backsliding, immovability, abiding, protection, wisdom, and both.",
        "source": "T33n1717_010:0884b12_22"
    },
    {
        "source_sentence": "《俱舍》文同，應更檢《成論》。",
        "translation": "The text of the Kusāya is the same, so we should reconsider the Chenglun.",
        "source": "T33n1717_010:0884b13_23"
    },
    {
        "source_sentence": "正釋中二：先標，次釋。",
        "translation": "There are two parts of the correct explanation: first, an indication, and then an explanation.",
        "source": "T33n1717_010:0884b13_24"
    },
    {
        "source_sentence": "釋中即二乘也。",
        "translation": "In the explanation, it's the two vehicles.",
        "source": "T33n1717_010:0884b14_25"
    },
    {
        "source_sentence": "初聲聞中先賢、次聖。",
        "translation": "Among the first śrāvakas, the first is good and the second is noble.",
        "source": "T33n1717_010:0884b14_26"
    },
    {
        "source_sentence": "初賢中二：先列，次釋。",
        "translation": "In the first, there are two kinds of goodness: first, listing, and second, explaining.",
        "source": "T33n1717_010:0884b15_27"
    },
    {
        "source_sentence": "釋中三：先釋名，次功能，三正釋。",
        "translation": "In the explanation, there are three: first, an explanation of name; second, an explanation of function; and third, a correct explanation.",
        "source": "T33n1717_010:0884b15_28"
    },
    {
        "source_sentence": "功能中七賢位已於智妙中略辨。",
        "translation": "The seven stages of goodness in the function have been briefly described in the marvelous wisdom.",
        "source": "T33n1717_010:0884b16_29"
    },
    {
        "source_sentence": "今云「愛見四諦」者，秖是愛見二惑所依，雖有愛見皆屬於見，具如八十八使中說。",
        "translation": "Now, it's called the four noble truths of craving and views because anger is the basis for the two afflictions of craving and views. Although there are cravings and views, they all belong to views, as explained in",
        "source": "T33n1717_010:0884b17_30"
    },
    {
        "source_sentence": "正釋中文自為七：初五停治五障，具如《止觀》第七對治中。",
        "translation": "The correct explanation is that the Chinese are self-contained seven: the first five stopping and treating the five hindrances are as described in the seventh antidote of calming and insight.",
        "source": "T33n1717_010:0884b19_31"
    },
    {
        "source_sentence": "言「苦諦為初門」者，後文以支佛集諦為初門，聲聞苦諦在初，復初觀四念處故，",
        "translation": "The phrase the noble truth of suffering as the first aspect means that the latter part uses the noble truth of the accumulation of the Buddha's limbs as the first aspect, and śrāvakas have the noble truth of suffering as the first aspect.",
        "source": "T33n1717_010:0884b20_32"
    },
    {
        "source_sentence": "支佛無明居因緣首，初破愛取有故。",
        "translation": "The branch buddhas of nescience are the first in terms of causes and conditions, because they first refute craving and grasping for existence.",
        "source": "T33n1717_010:0884b22_33"
    },
    {
        "source_sentence": "「境總觀總」者，以四觀通觀四境。",
        "translation": "The phrase contemplation of the totality of objects in general and contemplation of the totality means that the four contemplations are combined to contemplate the four objects.",
        "source": "T33n1717_010:0884b23_34"
    },
    {
        "source_sentence": "「境別觀總」者，於一一境四觀觀之。",
        "translation": "The phrase contemplation of specific objects as general means to contemplate each object in four ways.",
        "source": "T33n1717_010:0884b24_35"
    },
    {
        "source_sentence": "「境總觀別」者，以一一觀總觀四境。",
        "translation": "The expression observing the general and observing the specific with respect to objects means that each observation observes the four objects in a general way.",
        "source": "T33n1717_010:0884b24_36"
    },
    {
        "source_sentence": "三二類知。",
        "translation": "Three are the two kinds of knowing.",
        "source": "T33n1717_010:0884b25_37"
    },
    {
        "source_sentence": "「煖」等諸文智中已辨。",
        "translation": "We've already explained it in the texts and wisdom, such as warmth.",
        "source": "T33n1717_010:0884b26_0"
    },
    {
        "source_sentence": "今明次位略知深淺，仍略於彼，若欲廣知，應尋諸論。",
        "translation": "Now, we'll explain that the depth and shallowness of the order are briefly known, but they're still briefly explained there; if we want to know them in detail, we should look into the treatises.",
        "source": "T33n1717_010:0884b26_1"
    },
    {
        "source_sentence": "七聖者又三：列位，釋名，正釋。",
        "translation": "The seven noble ones are threefold: listing the stages, explaining names, and correctly explaining them.",
        "source": "T33n1717_010:0884b27_2"
    },
    {
        "source_sentence": "廣開具如《婆沙》、《俱舍》，今文極略足判淺深。",
        "translation": "The extensive and detailed explanations are found in the Vibhāṣā and Kuśinagara, but the present text is so brief that it's sufficient to judge shallowness and depth.",
        "source": "T33n1717_010:0884b28_3"
    },
    {
        "source_sentence": "釋名中云「苦忍明發捨凡入聖」者，至苦忍已次第無間必入初果，今從後說通云「聖人」。",
        "translation": "The explanation of the title says, Forbearance of suffering explains the arousal of equanimity for worldlings to enter the noble because it's said that after tolerating suffering, they must enter the first realization in order and without interruption",
        "source": "T33n1717_010:0884b29_4"
    },
    {
        "source_sentence": "三結、八十八使、七生，如《止觀》第六記。",
        "translation": "The three fetters, eighty-eight afflictions, and seven births are as recorded in the sixth entry of Zhiguan.",
        "source": "T33n1717_010:0884c02_5"
    },
    {
        "source_sentence": "中般為三者，謂速、非速、久住，準《俱舍論》總為九種，謂三各分三，",
        "translation": "The middling path is threefold: swift, not swift and abiding for a long time. According to thekośa-śāstra, it is generally ninefold:",
        "source": "T33n1717_010:0884c03_6"
    },
    {
        "source_sentence": "謂中、生、上流也。",
        "translation": "It's the middle, arising, and upward flow.",
        "source": "T33n1717_010:0884c04_7"
    },
    {
        "source_sentence": "有行、無行生色界已方般涅槃，並生般攝。",
        "translation": "Both conditioned and unconditioned arising in the realm of form are only partially liberated after having arisen in the realm of form. All arise together with being included in parinirvana.",
        "source": "T33n1717_010:0884c05_8"
    },
    {
        "source_sentence": "言中三者，謂速非速經久，如迸火星以喻三義，思之可知。",
        "translation": "The three in the explanation are that it's quick and not quick for a long time, like burstting into flames or stars to metaphorize the three meanings, which can be understood by contemplating them.",
        "source": "T33n1717_010:0884c06_9"
    },
    {
        "source_sentence": "並於中陰論速非速等。",
        "translation": "It's also the theory that the intermediate aggregate is quick and not quick, and so forth.",
        "source": "T33n1717_010:0884c07_10"
    },
    {
        "source_sentence": "生有三者，一生約速立，二有行約非速立，三無行約經久立。",
        "translation": "There are three kinds of arising: the first is established in terms of quick [arising], the second in terms of what is conditioned and what is not quickly [arising], and the third in terms of how long it lasts.",
        "source": "T33n1717_010:0884c08_11"
    },
    {
        "source_sentence": "並生色界，已論速等也。",
        "translation": "They are also born in the form realm, which has been discussed as speed and so forth.",
        "source": "T33n1717_010:0884c09_12"
    },
    {
        "source_sentence": "上流三者，一全超約速立，二半超約非速立，三遍沒約經久立。",
        "translation": "The first is established in relation to quickness; the second and a half are established in relation to what is not quick; and the third pervasively disappearing one is established in relation to the duration of time.",
        "source": "T33n1717_010:0884c10_13"
    },
    {
        "source_sentence": "從初色至色末始終有此三人不同，如是三九由業惑根異。",
        "translation": "These three are different from the first form up to the last one. In this way, it is because of differences in action and defilement that these three or nine I secondary passions arise:",
        "source": "T33n1717_010:0884c11_14"
    },
    {
        "source_sentence": "言業異者，造順現業成中般，造順生業成生般，造順後業成上流般。",
        "translation": "When it is said to be different from action, one creates a form of parinirvāṇa that follows the present action and becomes a form of parinirvāṇa in the intermediate existence. One creates a form of parinirvāṇa that follows the",
        "source": "T33n1717_010:0884c13_0"
    },
    {
        "source_sentence": "言惑三者，下品惑成中般，中品惑成生般，上品惑成上流般。",
        "translation": "“The defilements are threefold”: Defilement of the lower class makes a middling trance possible; defilement of the middle class makes a apparitional trance possible; defilement of the higher class makes a transmigratory trance",
        "source": "T33n1717_010:0884c14_1"
    },
    {
        "source_sentence": "言根別者，上根中般，中根生般，下根上流般。",
        "translation": "The difference in faculties means that the higher faculty is with middle trance, the middle faculty produces trance and the lower faculty is with upward flowing trance.",
        "source": "T33n1717_010:0884c16_2"
    },
    {
        "source_sentence": "斷上下分結者，言五上分者，謂掉、慢、無明、色染、無色染。",
        "translation": "“One abandons the higher and lower fetters”: The five higher fetters are agitation, pride, ignorance, defilement by matter and defilement by formlessness.",
        "source": "T33n1717_010:0884c17_3"
    },
    {
        "source_sentence": "言五下分者，謂身見、戒取、疑、貪、瞋，故《俱舍》云「由二不超欲」謂貪、瞋，",
        "translation": "The five lower parts refer to belief in a self, adherence to precepts and vows, doubt, craving, and anger. That's why the Kauśyapa says, It's because of these two that they don't transcend desire",
        "source": "T33n1717_010:0884c18_4"
    },
    {
        "source_sentence": "「由三復還下」謂身見、戒取、疑。",
        "translation": "Because of the three further returns, it's called belief in the body, adherence to precepts, and doubt.",
        "source": "T33n1717_010:0884c20_5"
    },
    {
        "source_sentence": "滅盡定如《止觀》第九記。",
        "translation": "The concentration of cessation is as recorded in the ninth entry in Zhiguan.",
        "source": "T33n1717_010:0884c20_6"
    },
    {
        "source_sentence": "《釋論》二十二釋四雙八輩中攝十七，但云那含有十一種，五種正是阿那含。",
        "translation": "The Śākyamuni's Twenty-two Explanations of the Four pairs and Eight categories contain seventeen, but it says that there are eleven kinds of non-returners, and five kinds are non-returners.",
        "source": "T33n1717_010:0884c21_7"
    },
    {
        "source_sentence": "六種阿羅漢向攝那含五種者，恐是現般一；",
        "translation": "“Six kinds of arhat are directed to taking in five kinds of ndriya-miners”:",
        "source": "T33n1717_010:0884c23_8"
    },
    {
        "source_sentence": "中般三，速、非速、久住；",
        "translation": "The middle path is of three forms:",
        "source": "T33n1717_010:0884c24_9"
    },
    {
        "source_sentence": "生般一。",
        "translation": "The parinirvāṇa of birth is one.",
        "source": "T33n1717_010:0884c24_10"
    },
    {
        "source_sentence": "六種阿羅漢向者，謂有行、無行、全超、半超、遍沒、無色(此私對之)，",
        "translation": "The six kinds of arhat- dedications are conditioned, unconditioned, completely transcendent, half-transcendent, pervasive, and formless (this is a privately addressed question),",
        "source": "T33n1717_010:0884c24_11"
    },
    {
        "source_sentence": "更加初果向、初果、二果向、二果、三果向、三果為十七。",
        "translation": "The addition of the first realization, the first realization, the second realization, the second realization, the second realization, the third realization, and the third realization is 17.",
        "source": "T33n1717_010:0884c26_12"
    },
    {
        "source_sentence": "「毘曇一萬二千九百六十種」者，《雜阿毘曇》云：「阿那含者或五及七八，",
        "translation": "The phrase twelve thousand, nine hundred and sixty kinds of the vedas refers to the Saṃyuktâbhidharma-vibhāga, which says, Some non-returners may be five, seven, eight,",
        "source": "T33n1717_010:0884c27_13"
    },
    {
        "source_sentence": "五謂中、生、有行、無行、上流。",
        "translation": "The fifth refers to the middle, arising, conditioned, unconditioned, and upward flow.",
        "source": "T33n1717_010:0884c28_14"
    },
    {
        "source_sentence": "七謂於中般更分三，如迸火星喻。",
        "translation": "The seventh means that the parinirvāṇa is further divided into three parts, like the metaphor of burning up a fire star.",
        "source": "T33n1717_010:0884c29_15"
    },
    {
        "source_sentence": "八者謂五上加現、無色及不定，且從五種說謂色五種，從根分十五，謂上中下各五故。",
        "translation": "The eighth refers to the five higher ones: manifesting, formless and indeterminate. Moreover, it is said to be fivefold from five kinds. These are spoken of as “five forms” from five kinds”:",
        "source": "T33n1717_010:0885a01_16"
    },
    {
        "source_sentence": "約地成二十，四禪各五。",
        "translation": "According to the stages, twenty are settled: five in each of the four trances.",
        "source": "T33n1717_010:0885a03_17"
    },
    {
        "source_sentence": "故約性有三十，謂退、思、護、住、進、不動，謂種性各五故。",
        "translation": "Therefore, in terms of their natures, there are thirty: the one who regresses, the one who thinks, the one who guards, the one who abides unshakeably, the one who makes effort and the steadfast one. That is to",
        "source": "T33n1717_010:0885a03_18"
    },
    {
        "source_sentence": "處有八十，梵眾至尼吒，十六處各五故。",
        "translation": "There are eighty āyatanas:",
        "source": "T33n1717_010:0885a05_0"
    },
    {
        "source_sentence": "每一種那含有二千五百九十二。",
        "translation": "Each one of them contains 2,500,922 words.",
        "source": "T33n1717_010:0885a05_1"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T33n1717_010:0885a06_2"
    },
    {
        "source_sentence": "約十六處成十六人，約種性六成六倍增之合九十六。",
        "translation": "The sixteen places make sixteen persons; the six by reason of sexual passion make sixteen:",
        "source": "T33n1717_010:0885a06_3"
    },
    {
        "source_sentence": "約根有三，三倍增之成二百八十八，更以九離欲人，九倍增之成二千五百九十二人。",
        "translation": "In relation to the faculties, there are three: by multiplying it threefold, two hundred and eighty-eight persons*!°. Moreover, by taking nine forms of being disjunctioned from what is desired, and by",
        "source": "T33n1717_010:0885a08_4"
    },
    {
        "source_sentence": "一人既爾，五種那含又五倍增之，成一萬二千九百六十種(論文難見故今略出)。」",
        "translation": "Since this is the case for one person, the five kinds of non-returners also increase by fivefold and become 12,000,960 kinds (which are briefly described here because they're difficult to see).",
        "source": "T33n1717_010:0885a10_5"
    },
    {
        "source_sentence": "言九離欲者，謂離欲界九品惑以為九人也。",
        "translation": "He who speaks of the nine forms of nonattachment means that he's free of the nine classes of afflictions in the desire realm and counts them as nine people.",
        "source": "T33n1717_010:0885a11_6"
    },
    {
        "source_sentence": "羅漢有五種者，依《婆沙》略釋云言退法者，謂退思法心生厭故。",
        "translation": "There are five kinds of arhats: according to the brief explanation in the Vibhāṣā council, it's said that those who regress from the teachings are those who regress from contemplating the teachings and become disillusioned with them.",
        "source": "T33n1717_010:0885a12_7"
    },
    {
        "source_sentence": "言思法者，持刀欲自害故。",
        "translation": "Those who say they're contemplating the teaching because they want to harm themselves with a sword.",
        "source": "T33n1717_010:0885a14_8"
    },
    {
        "source_sentence": "言護法者，於己解脫心生愛樂善守護故。",
        "translation": "He who speaks of guarding the Dharma arouses craving and joy in his own mind of liberation because he well guards it.",
        "source": "T33n1717_010:0885a15_0"
    },
    {
        "source_sentence": "言住法者，不退不進故。",
        "translation": "It's called abiding in the Dharma because it doesn't regress and doesn't advance.",
        "source": "T33n1717_010:0885a16_0"
    },
    {
        "source_sentence": "言進法者，能進至不動故。",
        "translation": "He who speaks of advancing the teaching because he's able to advance up to immovability.",
        "source": "T33n1717_010:0885a16_1"
    },
    {
        "source_sentence": "言不動者，住本不動故。",
        "translation": "The expression immovable refers to the fact that abiding is originally immovable.",
        "source": "T33n1717_010:0885a17_2"
    },
    {
        "source_sentence": "問：退法必退耶？",
        "translation": "Question: Is falling back of the doctrine necessarily falling back?",
        "source": "T33n1717_010:0885a17_3"
    },
    {
        "source_sentence": "乃至進法必進耶？",
        "translation": "Does the method of advancement necessarily advance?",
        "source": "T33n1717_010:0885a18_4"
    },
    {
        "source_sentence": "答：或有說者不必退乃至不必進，以是事故羅漢有五種，故作是說退不必退乃至進不必進。",
        "translation": "Answer: Some say that it is not necessary to fall back, up to not necessary to progress. Because of these things, there are five kinds of arhats. That is why they make this statement:",
        "source": "T33n1717_010:0885a18_5"
    },
    {
        "source_sentence": "問：若然何故名退乃至進？",
        "translation": "Question: If this is so, why is it called ‘backsliding’ up to ‘adjustment’?",
        "source": "T33n1717_010:0885a20_6"
    },
    {
        "source_sentence": "答：退者是退性，乃至進者是進性，以有五種性故羅漢有五種，并法行一人名不動，",
        "translation": "\\",
        "source": "T33n1717_010:0885a21_7"
    },
    {
        "source_sentence": "故有六種阿羅漢也。",
        "translation": "Therefore, there are six kinds of arhats.",
        "source": "T33n1717_010:0885a23_8"
    },
    {
        "source_sentence": "若退果者，牽於斯那二果亦失，至初果住，法爾然也。",
        "translation": "In the case of falling back from the fruit, one also loses the two fruits that lead to cessation up to the abode of the first fruit: this is exactly so.",
        "source": "T33n1717_010:0885a23_9"
    },
    {
        "source_sentence": "此生之中必得不疑，猶如勝人平地顛墜，四顧遠望不有他人見我倒不即能自起，",
        "translation": "In this birth, they will surely attain non-doubt, just as a victorious man who falls down on the ground and looks around from afar without anyone else seeing me. They won’t be able to produce their own errors.",
        "source": "T33n1717_010:0885a25_10"
    },
    {
        "source_sentence": "極至臨終亦得無學故也。",
        "translation": "At the end of his life, he'll also attain post-learning.",
        "source": "T33n1717_010:0885a27_11"
    },
    {
        "source_sentence": "得滅定人因中既修性共念處，至果時但名俱解脫人，以未修緣念終非無疑解脫也。",
        "translation": "In the cause of those who attain cessation and concentration, there's cultivation of the shared mindfulness of mind as a common in nature, but when they reach fruition, they're simply called people who are liberated together because they haven't cultivated cognitio",
        "source": "T33n1717_010:0885a27_12"
    },
    {
        "source_sentence": "「盡智」者，謂見苦已斷乃至道亦如是。",
        "translation": "The expression cognition of extinction means that it's likewise with the view that suffering has been stopped... up to the path.",
        "source": "T33n1717_010:0885a29_13"
    },
    {
        "source_sentence": "「無生智」者，不復更斷。",
        "translation": "The expression nonarising cognition means that it's no longer stopped.",
        "source": "T33n1717_010:0885b01_14"
    },
    {
        "source_sentence": "「無學等見」者，得世智亦名等智。",
        "translation": "The phrase views of post-learning and so forth means that attaining worldly cognition is also called equal cognition.",
        "source": "T33n1717_010:0885b02_15"
    },
    {
        "source_sentence": "《婆沙》云「所作已辦名盡智，從無學因生，名無生智。",
        "translation": "The Vibhāṣā says, What's done is called the cognition of exhaustion, and it arises from the causes of post-learning that are called the cognition of nonarising.",
        "source": "T33n1717_010:0885b03_0"
    },
    {
        "source_sentence": "又曾得而得名為盡智，未曾得而得名無生智。」",
        "translation": "Also, what's attained once is called the cognition of exhaustion, and what's not attained once is called the cognition of nonarising.",
        "source": "T33n1717_010:0885b04_1"
    },
    {
        "source_sentence": "又云「解脫道所攝名為盡智，勝進道所攝名為無生智。」",
        "translation": "It's also said, What's included in the path of liberation is called the knowledge of exhaustion, and what's included in the path of superior advancement is called the knowledge of nonarising.",
        "source": "T33n1717_010:0885b05_2"
    },
    {
        "source_sentence": "又云「盡智有五種羅漢，無生智唯一種謂不動。」",
        "translation": "It's also said, There are five kinds of cognition of exhaustion, and the only kind of cognition of nonarising is called immovable.",
        "source": "T33n1717_010:0885b06_3"
    },
    {
        "source_sentence": "此即從根，不論解脫道等。",
        "translation": "This is from the faculties, regardless of the paths of liberation and so forth.",
        "source": "T33n1717_010:0885b07_4"
    },
    {
        "source_sentence": "又「無學等見」者，一切羅漢等有此見，自知我是阿羅漢果等有此見，",
        "translation": "Also, views of post-learning and so forth means that all arhats and so forth have this view, knowing for themselves that they're the fruit of the arhat.",
        "source": "T33n1717_010:0885b08_5"
    },
    {
        "source_sentence": "故名等見。",
        "translation": "That's why they're called such views.",
        "source": "T33n1717_010:0885b09_6"
    },
    {
        "source_sentence": "「重空三昧」者，謂空空三昧，無相無相三昧，無作無作三昧，空是聖法復修於空擊前聖法，",
        "translation": "The heavy emptiness samādhi refers to the emptiness samādhi, the signless and signless samādhi, the unconstructed and unconstructed samādhi, and the noble teaching that emptiness is the noble dha",
        "source": "T33n1717_010:0885b10_7"
    },
    {
        "source_sentence": "故名為「重」。",
        "translation": "That's why it's called heavy.",
        "source": "T33n1717_010:0885b12_8"
    },
    {
        "source_sentence": "「沙門那」者，沙門此云乏，那者此云道。",
        "translation": "The phrase ascetic nun refers to the ascetic, which is called lacking, and nun refers to the path.",
        "source": "T33n1717_010:0885b12_9"
    },
    {
        "source_sentence": "支佛「集諦為初門」者，三乘之人通緣四諦，但有總別之異，以隨義便故初門不同，",
        "translation": "The Zhifo's claim that the truth of accumulation is the first aspect means that people in the three vehicles generally refer to the four noble truths but have distinctions in general and specific, so the first aspect is different because it follows their meaning.",
        "source": "T33n1717_010:0885b13_10"
    },
    {
        "source_sentence": "順四諦義故苦諦為初門，順十二緣義故集諦為初門，順六度義故道諦為初門，",
        "translation": "The truth of suffering is the first aspect because it follows the meaning of the four truths; the truth of the origin is the first aspect because it follows the meaning of the twelvefold supporting object; the truth of the path is the first aspect because it follows",
        "source": "T33n1717_010:0885b15_11"
    },
    {
        "source_sentence": "並三藏義也。",
        "translation": "It's also the meaning of the tripiṭaka.",
        "source": "T33n1717_010:0885b17_12"
    },
    {
        "source_sentence": "通教三乘以界內滅諦為初門，別教菩薩以界外道諦為初門，圓教菩薩以界外滅諦為初門。",
        "translation": "The three vehicles of the shared teaching have the noble truth of cessation within the boundary as the first aspect, the bodhisattvas of the specific teaching have the noble truth of the path outside the boundary as the first aspect, and the bodhi",
        "source": "T33n1717_010:0885b17_13"
    },
    {
        "source_sentence": "三藏六度緣起及衍人斥小，具如《止觀》第三記。",
        "translation": "The three collections of the six perfections, conditioned arising and derivative people who reject the lesser are as described in the third entry in the Cessation and Contemplation.",
        "source": "T33n1717_010:0885b19_14"
    },
    {
        "source_sentence": "於三藏菩薩為二：初立門，次明位為三：初三祇位，次百劫位，三佛果位。",
        "translation": "The bodhisattvas of the Tripiṭaka are divided into two: the first establishes the approach, and the second explains the stages as three: the first three eons, the next one hundred eons, and the third buddhahood stage.",
        "source": "T33n1717_010:0885b20_15"
    },
    {
        "source_sentence": "於中分凡聖位，如文，具如《止觀》記。",
        "translation": "The categories of worldlings and saints are as explained in the text, as recorded in the Zhiguan zhiguan [Ji shenzhou sanbao gantong lu:",
        "source": "T33n1717_010:0885b22_16"
    },
    {
        "source_sentence": "次通教三乘共位為二：初明三乘同異，次正明位文自分二：初共位如前，",
        "translation": "The first clarifies the similarities and differences between the three vehicles. The second correctly clarifies the distinctive characteristics of the state:",
        "source": "T33n1717_010:0885b23_17"
    },
    {
        "source_sentence": "次義者文自為二：初二中二：初明立位意，次「乾慧」下正釋初文，又二：先指文，",
        "translation": "The next meaning is that the text itself is twofold: first, there are two parts in the first two: first, explaining the meaning of positing a position; second, dry wisdom, which correctly explains the first part of the text under dry wisdom; and second",
        "source": "T33n1717_010:0885b25_18"
    },
    {
        "source_sentence": "次立意。",
        "translation": "Next, it establishes the meaning.",
        "source": "T33n1717_010:0885b26_19"
    },
    {
        "source_sentence": "次正釋者，文相稍廣，於《止觀》中若讀彼文須知此意。",
        "translation": "The next correct explanation is that the text is slightly extensive, so if you read the text in Zhiguan jing and examine it, you must know its meaning.",
        "source": "T33n1717_010:0885b27_20"
    },
    {
        "source_sentence": "於中二：先釋，次結判。",
        "translation": "There are two: first, an explanation; second, a judgment.",
        "source": "T33n1717_010:0885b28_21"
    },
    {
        "source_sentence": "釋中自為十：初乾慧地為四：初通立共意，次「而菩薩」下立別意，三釋四弘相，",
        "translation": "The explanation itself consists of ten parts: the first is a general statement of common intent, the second a specific statement under And bodhisattvas, the third an explanation of the four vast characteristics, and the fourth an explanation of emptiness.",
        "source": "T33n1717_010:0885b28_22"
    },
    {
        "source_sentence": "四從「是為」下辨異。",
        "translation": "Fourth, we'll discuss the differences under Yes.",
        "source": "T33n1717_010:0885c01_23"
    },
    {
        "source_sentence": "釋四弘中，初誓廣，次三誓略。",
        "translation": "In the explanation of the four vast vows, the first vow is extensive, and the next three are brief.",
        "source": "T33n1717_010:0885c02_24"
    },
    {
        "source_sentence": "初誓又二：初釋，次引證。",
        "translation": "The first vow has two parts: the first explains it, and the second cites its realization.",
        "source": "T33n1717_010:0885c02_25"
    },
    {
        "source_sentence": "次性地中三：初立共意，次「而菩薩」下釋行相立別意，三「如三藏」下判位辨異。",
        "translation": "Next, there are three in the stage of nature: first, establishing common meanings; second, explaining the distinct meanings established by practice and characteristics under And bodhisattvas; and third, discerning distinctions in status under Just like the Tripiṭ",
        "source": "T33n1717_010:0885c03_26"
    },
    {
        "source_sentence": "次八人見地為三：初立共意，次「而菩薩」下正釋，三「何者」下明立忍所以。",
        "translation": "The next eight stages of people's views are divided into three: the first establishes a common intention, the second correctly explains under And the bodhisattva, and the third explains why it establishes forbearance.",
        "source": "T33n1717_010:0885c05_27"
    },
    {
        "source_sentence": "次「復次」下明薄地為三：初立共意，次「而二乘」下斥二乘，三「菩薩」下正釋。",
        "translation": "Next, under Furthermore, it's explained that the thin ground is divided into three: the first establishes common meaning, the second rejects the two vehicles under And the two vehicles, and the third correctly explains them under bodhisattvas.",
        "source": "T33n1717_010:0885c06_28"
    },
    {
        "source_sentence": "言遊戲神通，具如《止觀》第五記。",
        "translation": "The words play and supernormal abilities are found in the fifth record of Zhiguan.",
        "source": "T33n1717_010:0885c08_29"
    },
    {
        "source_sentence": "次「阿那含」下明離欲地，為四：初立共意，次斥二乘，三「菩薩能」下正釋，",
        "translation": "Next, under non-returner, he explains the stage of freedom from desire, which consists of four parts: first, establishing common meaning; second, rejecting the two vehicles; and third, a correct explanation under bodhisattva abilities.",
        "source": "T33n1717_010:0885c09_30"
    },
    {
        "source_sentence": "四「所以」下明立地所以，辨不同之相。",
        "translation": "Fourth, under Why is it so? he explains the reason for establishing the ground and identifies the distinctive characteristics.",
        "source": "T33n1717_010:0885c10_31"
    },
    {
        "source_sentence": "初三如文。",
        "translation": "The first three are as explained in the text.",
        "source": "T33n1717_010:0885c11_32"
    },
    {
        "source_sentence": "辨不同中二：初明觀諦用智不同，次「故大論」下引論證菩薩立名。",
        "translation": "There are two differences in the explanation: first, it explains that the wisdom of observing the truths and using cognition is different, and second, under Therefore, the great treatise, he cites the names established by the bodhisattva in order to prove",
        "source": "T33n1717_010:0885c11_33"
    },
    {
        "source_sentence": "次「阿羅漢地」去明已辦地，為二：初辨異，次引證。",
        "translation": "Next, the stage of the arhat goes on to explain the stages that have been accomplished, which are twofold: first, identifying differences and second, citing proof.",
        "source": "T33n1717_010:0885c13_34"
    },
    {
        "source_sentence": "次「支佛」下明支佛地，指同羅漢，故云「亦如是」。",
        "translation": "Next, under branch buddha, it's explained that the stage of a branch buddha refers to the same arhat, so it's called likewise.",
        "source": "T33n1717_010:0885c14_35"
    },
    {
        "source_sentence": "次明菩薩地為四：初略立；",
        "translation": "Next, it is explained that the stages of enlightening beings are fourfold:",
        "source": "T33n1717_010:0885c15_36"
    },
    {
        "source_sentence": "次略辨；",
        "translation": "The next is a brief explanation.",
        "source": "T33n1717_010:0885c16_37"
    },
    {
        "source_sentence": "三「是則」下略釋，十地猶受菩薩之名，復名為佛地者，以佛地邊有菩薩地名，",
        "translation": "Third, it's briefly explained under Yes, that the ten stages are still called bodhisattva stages and are also called buddha stages because there's the name bodhisattva stage at the edge of the Buddha stage.",
        "source": "T33n1717_010:0885c16_38"
    },
    {
        "source_sentence": "故知始終皆有菩薩位，故云「別為菩薩」；",
        "translation": "Therefore, it's known that the beginning and end all have bodhisattva stages, so it's called separately being a bodhisattva.",
        "source": "T33n1717_010:0885c18_39"
    },
    {
        "source_sentence": "四「齊此」下辨盡不盡。",
        "translation": "Fourth, under equal to this, he explains that it's exhaustive and inexhaustible.",
        "source": "T33n1717_010:0885c19_40"
    },
    {
        "source_sentence": "次「過菩薩」下釋佛地，為二：初略立，次「五相」下辨異。",
        "translation": "Next, under errors of bodhisattvas, he explains the Buddha-stage in two ways: first, he briefly establishes it; second, he identifies the differences under five characteristics.",
        "source": "T33n1717_010:0885c19_41"
    },
    {
        "source_sentence": "於中三異，涅槃異中言「留舍利」者，若下本門中通佛亦言同入灰斷者，",
        "translation": "Among these three differences, the nirvāṇa difference is called leaving up Śāriputra because if he goes down to the original approach of penetrating the Buddha and also says he's cutting it off by entering into the same ashes, then he'",
        "source": "T33n1717_010:0885c21_0"
    },
    {
        "source_sentence": "當教二義不定故，利鈍菩薩所見不同故。",
        "translation": "Because the two meanings of the teaching are indeterminate, and because the views of sharp and dull bodhisattvas are different.",
        "source": "T33n1717_010:0885c22_1"
    },
    {
        "source_sentence": "次簡名別義通及為菩薩立忍名等，具如《止觀》第六記。",
        "translation": "The next is a summary of the names, specific meanings, supernormal abilities, and the names established for bodhisattvas for patience, as described in the sixth entry in the Cessation and Meditation.",
        "source": "T33n1717_010:0885c23_2"
    },
    {
        "source_sentence": "今文為二：初釋，次料簡。",
        "translation": "The present text is divided into two: the first explains, and the second summarizes.",
        "source": "T33n1717_010:0885c24_3"
    },
    {
        "source_sentence": "初文為四：初來意，次列別位，三對位，四「是則」下結。",
        "translation": "The first text is divided into four: the first one explains the meaning, the second lists the distinctive stages, the third contrasts the stages, and the fourth concludes under Yes.",
        "source": "T33n1717_010:0885c25_4"
    },
    {
        "source_sentence": "初二如文。",
        "translation": "The first two are as explained in the text.",
        "source": "T33n1717_010:0885c26_5"
    },
    {
        "source_sentence": "三對位中前九地如文，至佛地中先指前文，通教十地於別但名菩薩地也。",
        "translation": "In the three contrastive stages, the first nine stages are as explained in the text, up to the Buddha stage that first refers to the previous section, and the ten stages of the shared teaching are simply called bodhisattva stages separately.",
        "source": "T33n1717_010:0885c26_6"
    },
    {
        "source_sentence": "次「此佛」下與三藏辨同異，言「三藏佛一日三時照機」者，諸部《阿含》及《大論》皆有此說，",
        "translation": "Next, under this Buddha, we'll discuss similarities and differences with the tripiṭaka. The phrase three-storey buddhas illuminate the opportunity in one day and three times means that all the texts of the Āgamas and Mahāprajñā",
        "source": "T33n1717_010:0885c28_7"
    },
    {
        "source_sentence": "云佛一日三時入定求可度機，以約教門不能常見故也。",
        "translation": "It's said that the Buddha enters concentration three times a day to seek the opportunity to save, because he can't see it often according to the teaching approach.",
        "source": "T33n1717_010:0886a01_8"
    },
    {
        "source_sentence": "亦如《摩耶經》阿難近在於後，而便問言阿難今者為在何許？",
        "translation": "It's also like when Ānanda approached the latter in the Mahāprajñāpāramitā-sūtra and asked, Where is he now?",
        "source": "T33n1717_010:0886a03_9"
    },
    {
        "source_sentence": "又問祇洹何故多烏？",
        "translation": "Again, he asked why there were so many crows in Jīvaka?",
        "source": "T33n1717_010:0886a04_10"
    },
    {
        "source_sentence": "小近尚自不知，豈能任運常照？",
        "translation": "Even if the small and the near don't know for themselves, how can they be able to tolerate and always illuminate?",
        "source": "T33n1717_010:0886a05_0"
    },
    {
        "source_sentence": "次料簡中初問可解。",
        "translation": "In the next summary, the first question can be understood.",
        "source": "T33n1717_010:0886a05_1"
    },
    {
        "source_sentence": "答中明此通位教相多異，致使人師各據一途。",
        "translation": "In the answer, it's explained that there are many differences in the characteristics of these shared positions and teachings, so people and teachers each rely on one path.",
        "source": "T33n1717_010:0886a06_2"
    },
    {
        "source_sentence": "於中二：先見，次思。",
        "translation": "There are two of these: first, views; second, reasoning.",
        "source": "T33n1717_010:0886a07_3"
    },
    {
        "source_sentence": "初中三：先出同異，次「但通教」下難，三「若斷」下縱。",
        "translation": "In the first, there are three: first, we'll explain similarities and differences, second, we'll discuss the difficulty under simply teaching together, and third, we'll discuss them under if we stop.",
        "source": "T33n1717_010:0886a07_4"
    },
    {
        "source_sentence": "次思惑中二：先出異，次兼前總判。",
        "translation": "Next, there are two mental disturbances of deliberation: first, the differences that arise; second, the combined with the previous general explanation.",
        "source": "T33n1717_010:0886a08_5"
    },
    {
        "source_sentence": "略云「不可定執」者，通義不可定判，教門利他時長機雜故令爾也。",
        "translation": "The abbreviated phrase indeterminate means that the general meaning of indeterminate is indeterminate, and it's because the long duration of the teaching's approach to benefiting others is so mixed as to cause them to do so.",
        "source": "T33n1717_010:0886a09_6"
    },
    {
        "source_sentence": "次問答中三：先略判，次「何者」下釋，三「此乃」下正判。",
        "translation": "The next question and answer is divided into three parts: first, a brief explanation; second, an explanation under Which one?; and third, a correct explanation under Here.",
        "source": "T33n1717_010:0886a11_7"
    },
    {
        "source_sentence": "次問者，「問大論三處明燋炷」等者，謂乾慧地，初地，初住。",
        "translation": "The next question is, 'Inquire about the three places of the great treatise to explain the burning wick' and so forth, which refers to the stage of dry wisdom, the first stage, and the first abode.",
        "source": "T33n1717_010:0886a12_8"
    },
    {
        "source_sentence": "《大論》四十八明四十二字門，即初住已上也。",
        "translation": "The forty-eighth section of the Mahāprajñāpāramitā explains the forty-two word aspect, which is after the first abode.",
        "source": "T33n1717_010:0886a13_9"
    },
    {
        "source_sentence": "第四十九明菩薩初歡喜地乃至法雲地，廣明修治地業，續此文後即云復次地有二種：一者但菩薩地，",
        "translation": "The forty-nineth clarifies the first stage of enlightening beings’ delight, up to the stage of Cloud of Teaching. It extensively explains the cultivation of practice in that stage. Continuing on from this text, it",
        "source": "T33n1717_010:0886a14_10"
    },
    {
        "source_sentence": "二者共菩薩地，所謂乾慧地乃至佛地。",
        "translation": "The second is the common bodhisattva stage, which is called the stage of dry wisdom or even the Buddha stage.",
        "source": "T33n1717_010:0886a17_11"
    },
    {
        "source_sentence": "故知三教明矣。",
        "translation": "Therefore, it's clear that the three teachings are known.",
        "source": "T33n1717_010:0886a18_12"
    },
    {
        "source_sentence": "故知此中問意與《止觀》稍似有殊，此以三教為問，見地燋炷置而不論，",
        "translation": "Therefore, it's known that the meaning of this question is slightly different from that of the Cessation and Contemplation. Here, these three teachings are used as questions to show that the earth-shaped wick is placed without discrimination.",
        "source": "T33n1717_010:0886a18_13"
    },
    {
        "source_sentence": "若得此意則《止觀》文宛然自別。",
        "translation": "If we get this idea, then the text of Zhiguan is completely distinct.",
        "source": "T33n1717_010:0886a20_14"
    },
    {
        "source_sentence": "次問「利人應無十地」者，問意利人既於初地斷見，應二地乃至四地斷思，",
        "translation": "The next question, Shouldn't there be ten stages for those who benefit? asks whether the mind-benefiting person has cut off views in the first stage and should cut off thoughts in two stages up to fourth stage.",
        "source": "T33n1717_010:0886a20_15"
    },
    {
        "source_sentence": "六七地成佛，是則無十地耶？",
        "translation": "If the sixth and seventh stages become buddhas, then there are no ten stages?",
        "source": "T33n1717_010:0886a22_16"
    },
    {
        "source_sentence": "答意者教門具有，於利人不制，秖如超果得阿羅漢，可令餘三果亦無人耶？",
        "translation": "Answer: The intention is to teach that the approach of teaching exists, but there's no restraints for those who benefit others, and it's just like attaining arhatship by transcending the fruit, so can you make the other three fruits also have",
        "source": "T33n1717_010:0886a23_17"
    },
    {
        "source_sentence": "次問意者，別圓若有利人，應在地前住前燋炷耶？",
        "translation": "The next question is, What do you think? If it's distinctively perfect and beneficial to someone, should he place it in front of the ground and stand before a burning wick?",
        "source": "T33n1717_010:0886a25_18"
    },
    {
        "source_sentence": "答意者，雖有利鈍，斷位必定。",
        "translation": "Answer: Although it's sharp and dull, the stage of elimination is certain.",
        "source": "T33n1717_010:0886a26_19"
    },
    {
        "source_sentence": "次別位為大樹者，為三：標章，列門，正釋。",
        "translation": "The next distinctive stages are the great trees, which are divided into three: labeling, listing, and correctly explaining.",
        "source": "T33n1717_010:0886a26_20"
    },
    {
        "source_sentence": "初二如文。",
        "translation": "The first two are as explained in the text.",
        "source": "T33n1717_010:0886a27_21"
    },
    {
        "source_sentence": "釋中有三：初又為六：初得名，次位法所依，三「無量」下通列，四「別教」下判，",
        "translation": "There are three explanations: first, there are six: the first is to get the name, the second is to rely on the stages and dharmas, the third is to list them together under immeasurable, and the fourth is to judge them under",
        "source": "T33n1717_010:0886a28_22"
    },
    {
        "source_sentence": "五「然」下判傍正，六「既有」下結示不同。",
        "translation": "The fifth is to judge the horizontal correctness under Still, and the sixth is to conclude by showing the differences under Since there are.",
        "source": "T33n1717_010:0886a29_23"
    },
    {
        "source_sentence": "前二可知。",
        "translation": "The first two can be understood.",
        "source": "T33n1717_010:0886b01_24"
    },
    {
        "source_sentence": "三通列中三：先舉四數，次「有無量」下列四法，三「云何」下釋四法。",
        "translation": "The third is a general list of three: first, the four numbers are cited, then there are the following four dharmas that are immeasurable, and the third is an explanation of the four dharmas under How are they?",
        "source": "T33n1717_010:0886b01_25"
    },
    {
        "source_sentence": "初二如文。",
        "translation": "The first two are as explained in the text.",
        "source": "T33n1717_010:0886b03_26"
    },
    {
        "source_sentence": "釋意者，所以四教斷伏皆名無量，若斷若伏相狀非一故通名之。",
        "translation": "The meaning of the explanation is that the four teachings are all called immeasurable because their characteristics and forms of elimination and subjugation are not one and the same, so they're generally called that.",
        "source": "T33n1717_010:0886b03_27"
    },
    {
        "source_sentence": "此中皆約菩薩故也。",
        "translation": "This is because they all refer to bodhisattvas.",
        "source": "T33n1717_010:0886b05_28"
    },
    {
        "source_sentence": "初如三藏云伏見思即指菩薩，今明無量多在出假故，且置二乘故；",
        "translation": "First, as the Sanskrit texts say, suppressing views and thinking refers to bodhisattvas. Now we explain that immeasurable beings mostly abide in transcendence of the conventional, leaving only the two vehicles behind.",
        "source": "T33n1717_010:0886b05_29"
    },
    {
        "source_sentence": "通教中亦指出假，助謂助別。",
        "translation": "The general teaching also indicates the provisional, and the auxiliary refers to the auxiliary.",
        "source": "T33n1717_010:0886b07_30"
    },
    {
        "source_sentence": "別教中云「內外四諦」者，當知別人具四四諦。",
        "translation": "The expression four internal and four external truths in the specific teaching says, You should know that others have the four four noble truths.",
        "source": "T33n1717_010:0886b08_31"
    },
    {
        "source_sentence": "言「乃有斷無明義」者，若據始終雖登地斷，既證道同圓當知教道有斷義耳。",
        "translation": "The expression that says, there's the meaning of stopping ignorance means that if we look at the beginning and end it even though we ascend to the ground, then we'll know that the path of teaching has the meaning of stopping after realizing that the path is",
        "source": "T33n1717_010:0886b09_32"
    },
    {
        "source_sentence": "故今從事且判地前屬於別教，則迴向中伏望於圓理，故得事名。",
        "translation": "Therefore, it's called a thing because the present practice and the prior stages are judged to be distinct teachings, and the dedication of merit is subdued in the perfect principle.",
        "source": "T33n1717_010:0886b10_33"
    },
    {
        "source_sentence": "圓人破無明位長，故指初住去以為無量四判。",
        "translation": "Because the perfect person breaks through the stage of nescience, he refers to the first abode and removes it as an immeasurable set of four judgments.",
        "source": "T33n1717_010:0886b12_34"
    },
    {
        "source_sentence": "五傍正者，約別教始終以判，可知。",
        "translation": "The five peripheral correctnesses are judged in terms of the beginning and end of the distinct teachings, which can be understood.",
        "source": "T33n1717_010:0886b13_35"
    },
    {
        "source_sentence": "六結示同異，中二：初略示，次「若華嚴」下示教不同，於中為三：先列教，",
        "translation": "The sixth concludes by showing similarities and differences, of which there are two: first, a brief explanation; second, under If the Flower Ornament shows dissimilarities in doctrine, there are three: first, a list of teachings; third",
        "source": "T33n1717_010:0886b14_36"
    },
    {
        "source_sentence": "次「又斷」下明教相不同，三「所以然者」下明不同意。",
        "translation": "Next, under further elimination, it's explained that the characteristics of the teaching are different, and three, Why is it so?, it's explained that they don't agree.",
        "source": "T33n1717_010:0886b16_37"
    },
    {
        "source_sentence": "初又二：先經，次論。",
        "translation": "The first is twofold: first, the sūtra; second, the treatise.",
        "source": "T33n1717_010:0886b17_38"
    },
    {
        "source_sentence": "《十地論》唯釋《華嚴．十地品》，《攝大乘》第七釋第四因果勝相中，",
        "translation": "The Ten Stages Treatise only explains the Flower Ornament. Chapter on the Ten Stages, while the seventh section of the Compendium of the Great Vehicle explains the fourth distinguishing characteristic of cause and effect in order to show that they are",
        "source": "T33n1717_010:0886b17_39"
    },
    {
        "source_sentence": "亦但明歡喜等十地而已，《地持》中明種性等六位，如《止觀》第五所引論文，",
        "translation": "It also only explains the ten stages of joy and so forth. The Earth-holding Treatise explains the six stages of seed nature and so forth, as quoted in the fifth section of Silent Meditation:",
        "source": "T33n1717_010:0886b19_40"
    },
    {
        "source_sentence": "《十住婆沙》，初文但明十地而已。",
        "translation": "The first part of the Ten Abodes Vibhāṣā simply explains the ten stages.",
        "source": "T33n1717_010:0886b20_41"
    },
    {
        "source_sentence": "次釋地相亦無諸位，《大論》略出通別，文但引例，故知諸論明位麁略。",
        "translation": "Next, he explains that the characteristics of the earth also have no stages, and the Mahāprajñāpāramitā briefly describes the general and specific, but the text simply cites examples; therefore, he knows that the treatises explain the",
        "source": "T33n1717_010:0886b21_42"
    },
    {
        "source_sentence": "次明教相斷伏不同，如文。",
        "translation": "Next, it explains that the characteristics of the teaching are different in terms of ending and subjugating, as explained in the text.",
        "source": "T33n1717_010:0886b23_43"
    },
    {
        "source_sentence": "三明意中二：先明聖教大意，次「今若」下明今家用聖教意。",
        "translation": "Three, there are two ways to explain the meaning: first, he explains the great meaning of the noble teachings, and second, under Now, he explains the meaning of the noble teachings used in the present life.",
        "source": "T33n1717_010:0886b23_44"
    },
    {
        "source_sentence": "又四：初總列大意，意在為成初心行人入道正意，若無位次，將何以為聞賢思齊？",
        "translation": "Also, four: The first is a general list of the main ideas, which are intended to accomplish the correct idea of entering the path for those who form the first mind and practice it, but if there's no order, why would they be considered equal to what good men",
        "source": "T33n1717_010:0886b25_45"
    },
    {
        "source_sentence": "將何以越增上慢罪？",
        "translation": "What will be the reason for transgressing the sin of overweening arrogance?",
        "source": "T33n1717_010:0886b27_46"
    },
    {
        "source_sentence": "若赴機異轍任彼所忻，故使如上參差不等。",
        "translation": "If someone goes to a different path of opportunity and leaves it up to them, they'll be invited to do so, so they won't be equal in the above-mentioned ways.",
        "source": "T33n1717_010:0886b27_47"
    },
    {
        "source_sentence": "若為成初心教觀，故且用三經。",
        "translation": "In order to accomplish the contemplation of the first state of mind, we will use three scriptures.",
        "source": "T33n1717_010:0886b28_48"
    },
    {
        "source_sentence": "次「諸聖」下誡勸修行。",
        "translation": "Next, under All the sages, he admonishes and encourages cultivation.",
        "source": "T33n1717_010:0886b29_49"
    },
    {
        "source_sentence": "三「今判」下正示用三經意。",
        "translation": "Third, under Now judged, we'll correctly show the meaning of the three sūtras in terms of using them.",
        "source": "T33n1717_010:0886b29_50"
    },
    {
        "source_sentence": "是故今家不同世人解釋經論，但依法相列位而已。",
        "translation": "That's why the present family doesn't differ from the explanations of the sūtras and treatises in the world, simply listing the stages according to their characteristics.",
        "source": "T33n1717_010:0886c01_51"
    },
    {
        "source_sentence": "今一家別位若不依《纓珞》則位無始終，若不依《大品》則諸位全無斷惑高下用觀分齊，",
        "translation": "If we don't rely on the Mahāprajñāpāramitā, then the stages have no beginning and end; if we don't rely on the Mahāprajñāpāramitā, then all stages are completely free of eliminating mental",
        "source": "T33n1717_010:0886c02_52"
    },
    {
        "source_sentence": "若不依《涅槃》則菩薩願行淺深相狀遠近莫知，三經相成佛旨無失。",
        "translation": "If someone doesn't rely on the Nirvāṇa, then the bodhisattva's vows and practices are so shallow and profound that they can't be known from distant or near, and there's nothing wrong with the three sūtras",
        "source": "T33n1717_010:0886c04_53"
    },
    {
        "source_sentence": "四釋三文，自為三：初依《纓珞》、《仁王》中言「前四時般若」者，",
        "translation": "The fourth explains the three texts, which are threefold: first, according to the statement in the Garland and Humane Kings that the first four times are prajñāpāramitā,",
        "source": "T33n1717_010:0886c06_54"
    },
    {
        "source_sentence": "古判般若總有五時：一《摩訶》，二《金剛》，三《天王》，四《光讚》，",
        "translation": "The ancient judgement of prajñā has five general periods: 1. the Mahāprajñāpāramitā, 2. the Vajrapāṇi, 3. the Heavenly King, and 4. the Prabhāsvara.",
        "source": "T33n1717_010:0886c07_55"
    },
    {
        "source_sentence": "五《仁王》。",
        "translation": "The fifth is the Humane Kings.",
        "source": "T33n1717_010:0886c09_56"
    },
    {
        "source_sentence": "此亦未可全用，雖然，《摩訶》定在《仁王》之前。",
        "translation": "This is also not a complete use, even though the Mahāyāna certainly comes before the Renwang.",
        "source": "T33n1717_010:0886c09_57"
    },
    {
        "source_sentence": "何以知然？",
        "translation": "How do we know this is so?",
        "source": "T33n1717_010:0886c10_58"
    },
    {
        "source_sentence": "《仁王》云：「如來成道二十九年，先已為我說《摩訶般若》」，故知《仁王》在後明矣。",
        "translation": "The Renwang says, Twenty-nine years after the Tathāgata's attainment of enlightenment, he had previously explained the Mahāprajñāpāramitā for me, so it's clear that the Renwang was later.",
        "source": "T33n1717_010:0886c10_59"
    },
    {
        "source_sentence": "若《光讚經》準諸經目錄，弘始五年四月二十三日譯《大品》竟，二十七卷成者是也。",
        "translation": "If the Guangzan jing refers to the list of scriptures, this is the twenty-seventh complete translation of the Mahāprajñāpāramitā on the twenty-third day of the fourth month in the fifth year of Hongs",
        "source": "T33n1717_010:0886c12_60"
    },
    {
        "source_sentence": "後竺法護晉太康元年譯上帙為《光讚》，又朱仕衡譯為二十卷，名《放光般若》，",
        "translation": "Later, Zhu Fahou translated the Mahaprajnaparanirmita-vaśavartin into Guangzan in the first year of the Taikang period under the reign of Emperor Wu and translated it into twenty fascicles called Prajnapara",
        "source": "T33n1717_010:0886c13_61"
    },
    {
        "source_sentence": "羅什又重譯為十卷，名「小品」，支讖又譯為十卷，名「道行」。",
        "translation": "Rāṣṭrapāla again translated it into ten fascicles, which were called the lesser section, and Zhiqian also translated it into ten fascicles, which were called the practice of the path.",
        "source": "T33n1717_010:0886c15_62"
    },
    {
        "source_sentence": "又有人譯為五卷，名「大明度」。",
        "translation": "Some people also translated it into five fascicles, which were called the Mahāprajñāpāramitā.",
        "source": "T33n1717_010:0886c17_0"
    },
    {
        "source_sentence": "又有人譯略《光讚》，名「大明度」。",
        "translation": "Some people also translated the abbreviated version of the Guangzan, called Damingdao.",
        "source": "T33n1717_010:0886c17_1"
    },
    {
        "source_sentence": "又有人譯略《光讚》，名「大智無極」。",
        "translation": "Some people also translated the abbreviated version of the Guangzan, which is called Great Wisdom without Limit.",
        "source": "T33n1717_010:0886c18_2"
    },
    {
        "source_sentence": "又有人譯，名「大品」，當知《光讚》秖是《大品》上帙，在後譯之，",
        "translation": "Also, some people translate it as Mahāprajñāpāramitā. You should know that Guṇaprabha is the first title of Mahāprajñāpāramitā and will be translated later.",
        "source": "T33n1717_010:0886c19_3"
    },
    {
        "source_sentence": "故不可以為別時義也。",
        "translation": "Therefore, it can't be interpreted as a separate time.",
        "source": "T33n1717_010:0886c20_4"
    },
    {
        "source_sentence": "為是義故，與《仁王》、《天王》而為次第者，未可全用。",
        "translation": "For this reason, it's not possible to use them all in order with the Humane Kings and King of Gods.",
        "source": "T33n1717_010:0886c21_0"
    },
    {
        "source_sentence": "《法華》意雖該攝且名位不彰，故但用二經。",
        "translation": "Although the meaning of the Lotus is included, its name and position aren't expressed, so it uses only two sūtras.",
        "source": "T33n1717_010:0886c22_1"
    },
    {
        "source_sentence": "言「地持九種戒定慧」者，論文既云六度皆九，今但云三者或以三攝六，",
        "translation": "The expression nine kinds of morality, concentration, and wisdom that are ground-holding refers to the fact that the six perfections are all nine, but now it's only three.",
        "source": "T33n1717_010:0886c23_2"
    },
    {
        "source_sentence": "或略舉三要，然諸位功用、願行法相、斷惑品類、被物廣狹、依土淨穢、示迹多少、真應優劣、對當法門等，",
        "translation": "Or they may briefly enumerate three essentials, but the stages are effort, vows and practices, characteristics of phenomena, types of abandoning afflictions, breadth and narrowness of objects, purity and defilement of",
        "source": "T33n1717_010:0886c24_3"
    },
    {
        "source_sentence": "非可具列，是故今文但明一轍，所以不暇廣明法相，今順文體亦不委曲，",
        "translation": "Therefore, the present text only explains one aspect. That is why we do not have time to explain the characteristics of the doctrine in detail. We now follow the essence of the syllables and do not compose a distortion.",
        "source": "T33n1717_010:0886c27_4"
    },
    {
        "source_sentence": "廣尋經論恐添雜本文，故知依此文相足辨權實也。",
        "translation": "Looking into the sūtras and treatises extensively, we're afraid to add a mixed text, so we know that we can discern the authoritative and real based on the characteristics of this text.",
        "source": "T33n1717_010:0886c28_5"
    },
    {
        "source_sentence": "次總明位中亦約三經，先標，次釋。",
        "translation": "Next, it's a general explanation of the three sūtras that also refer to the stages, which are first labeled and then explained.",
        "source": "T33n1717_010:0887a01_6"
    },
    {
        "source_sentence": "釋中二：初約《纓珞》者列釋，次依《大品》明三觀者。",
        "translation": "There are two explanations: the first is an explanation of the three contemplations in terms of the Śākyamuni, and the second is an explanation based on the Mahāprajñāpāramitā that explains the three contemplations.",
        "source": "T33n1717_010:0887a02_0"
    },
    {
        "source_sentence": "問：今此文中，將此四義以對三觀，與大論中釋因中總別果上總別等，",
        "translation": "Question: In this text, these four meanings are contrasted with the three contemplations in order to be compared with the general distinctions among causes and results as explained in the Mahāprajñāpāramitā.",
        "source": "T33n1717_010:0887a03_1"
    },
    {
        "source_sentence": "有何差別？",
        "translation": "What's the difference?",
        "source": "T33n1717_010:0887a04_2"
    },
    {
        "source_sentence": "答：言異義同。",
        "translation": "Answer: The meaning of ‘different’ is the same.",
        "source": "T33n1717_010:0887a05_0"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T33n1717_010:0887a05_1"
    },
    {
        "source_sentence": "空假為因，中道為果，從假入空為因中總相，從空入假為因中別相，別人修中初但總相為果上總，",
        "translation": "Emptiness and the conventional are the cause, while the middle path is the result. The general characteristic marks of emptiness as cause and the specific characteristic marks of the conventional as cause in the case of entering emptiness from the conventional",
        "source": "T33n1717_010:0887a05_2"
    },
    {
        "source_sentence": "若入初地雙照二諦為果上別，當知四義與三不殊。",
        "translation": "If someone enters the first ground and both illuminates the two truths as fruits, they should know that the four meanings are not different from the three.",
        "source": "T33n1717_010:0887a07_3"
    },
    {
        "source_sentence": "別解七位者，如《纓珞》中明六種性，兼於住前信位為七。",
        "translation": "The explanation of the seven stages separately is as explained in the Kharoṣṭhāra-śāstra, which explains the six kinds of natures and the seven stages of faith before abiding.",
        "source": "T33n1717_010:0887a08_4"
    },
    {
        "source_sentence": "「纓珞六位」者，謂十住習種性，十行性種性，十向道種性，十地聖種性，",
        "translation": "The six stages of the garuḍa refers to the seed nature of the ten abodes, the seed nature of the ten practices, the seed nature of the ten practices, the seed nature of the path of the ten dedications, and",
        "source": "T33n1717_010:0887a10_5"
    },
    {
        "source_sentence": "等覺性，妙覺性，應往四教本中尋。",
        "translation": "The nature of virtual enlightenment, the nature of marvelous enlightenment, should be sought in the texts of the four teachings.",
        "source": "T33n1717_010:0887a11_6"
    },
    {
        "source_sentence": "◎◎三草二木位竟。",
        "translation": "The three grass and two pieces of wood are complete.",
        "source": "T33n1717_010:0887a12_7"
    },
    {
        "source_sentence": "次明最實位，即一地所生之次位也。",
        "translation": "The next explains the most real stage, which is the stage that arises in a single ground.",
        "source": "T33n1717_010:0887a13_8"
    },
    {
        "source_sentence": "故前立三教及以人天，今唯在圓，若不至《法華》開顯，安知一地所生？",
        "translation": "That's why the three teachings and humans and gods were previously established, but now they're only in perfect. If they don't reach the revealing of the Lotus, how can they be born in a single ground?",
        "source": "T33n1717_010:0887a14_9"
    },
    {
        "source_sentence": "于一佛乘，分別說三，此之謂也。",
        "translation": "In the single buddha vehicle, they're divided into three, which are called these.",
        "source": "T33n1717_010:0887a15_10"
    },
    {
        "source_sentence": "故知三草二木各謂自立，蒙一味雨方知一地所生；",
        "translation": "Therefore, it is known that the three grasses and two trees are each said to be self-standing. It is only when receiving a rain of one particular color that they are known to have grown in one place.",
        "source": "T33n1717_010:0887a16_11"
    },
    {
        "source_sentence": "如彼窮子至臨終時乃識其父，是故須明一實位也。",
        "translation": "It's like that impoverished child who knows his father when he reaches his final death, so it's necessary to explain the single true state.",
        "source": "T33n1717_010:0887a17_12"
    },
    {
        "source_sentence": "為令識父，是故須明前諸權位。",
        "translation": "In order to make them know their father, it's therefore necessary to explain the prior rightful positions.",
        "source": "T33n1717_010:0887a19_13"
    },
    {
        "source_sentence": "於中先標、次釋。",
        "translation": "Here, they're first labeled and then explained.",
        "source": "T33n1717_010:0887a19_14"
    },
    {
        "source_sentence": "釋中文自開為十意。",
        "translation": "The explanation of the Chinese teachings themselves is divided into ten meanings.",
        "source": "T33n1717_010:0887a20_15"
    },
    {
        "source_sentence": "初列十意者，雖同釋圓門不無小異，初之四意及第十意正釋圓位，餘之五意因此便明。",
        "translation": "The first one lists the ten meanings, even though they are the same as the explanation of the perfect approach and don't have minor differences, the first four meanings and the tenth meaning correctly explain the level of perfectness, and the other five meanings",
        "source": "T33n1717_010:0887a20_16"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T33n1717_010:0887a22_17"
    },
    {
        "source_sentence": "此既唯明一實之位，不合即明麁妙等文，故此等文應合在妙行文後、位妙章初列之。",
        "translation": "Since this only explains the single real state, it doesn't combine with the explanation of crude and subtle texts, so these texts should be combined at the end of the text on subtle practices and listed in the first part of the marvelous",
        "source": "T33n1717_010:0887a23_18"
    },
    {
        "source_sentence": "應云一明諸位，次明麁妙及以興廢開顯等也。",
        "translation": "It should be said that the first clarifies the stages, and the second clarifies the crude and subtle as well as the initiation and manifestation of what's produced and abolished.",
        "source": "T33n1717_010:0887a25_19"
    },
    {
        "source_sentence": "今來此者，欲更重與權位比決及開顯彼麁位故也。",
        "translation": "The reason we're here now is because we want to further compare it with the rightful position and reveal its debilitating position.",
        "source": "T33n1717_010:0887a26_20"
    },
    {
        "source_sentence": "故先釋竟，重判麁妙及開顯等。",
        "translation": "That's why the first part of the explanation concludes with a redefinition of crude, subtle, revealing, and so forth.",
        "source": "T33n1717_010:0887a27_21"
    },
    {
        "source_sentence": "問：今此初約通別圓三，三句料簡，至下結文既云與藏通同，初料簡中何故不對三藏簡耶？",
        "translation": "Q: Now, the first of these three is summarized in terms of the general and distinctive perfections, and the next three are summarized in terms of the three phrases, so why isn't the first summarized in terms of the three collections",
        "source": "T33n1717_010:0887a28_22"
    },
    {
        "source_sentence": "答：一者通是大乘初門，堪入後故；",
        "translation": "Answer: “One is general”: This is the first aspect of the Great Vehicle: because it can enter later.",
        "source": "T33n1717_010:0887a30_23"
    },
    {
        "source_sentence": "二者二處羅漢名同，故初對通而後兼藏。",
        "translation": "Second, because the names of the arhats in the two places are the same, the first is to confront and penetrate, and the second is to store together.",
        "source": "T33n1717_010:0887b01_24"
    },
    {
        "source_sentence": "此十章次第者，理雖無名，理藉名顯，名下有義，方顯所詮，義上有名，",
        "translation": "The order of these ten chapters is as follows: Although the reasoning has no names, the reasoning is expressed by means of names. There are meanings beneath names only to show that which is expressed, and there are meanings above meanings.",
        "source": "T33n1717_010:0887b02_25"
    },
    {
        "source_sentence": "方知詮異，故名義一章最居於首。",
        "translation": "Only then can we know that the explanation is different, so the title and meaning of the one chapter are the most prominent.",
        "source": "T33n1717_010:0887b03_26"
    },
    {
        "source_sentence": "既知圓門名義，次辨所詮位數，乃識圓位開合不同。",
        "translation": "Since we know the names and meanings of the perfect approach, we'll next explain the number of stages that are explained, then we'll see that the level of perfection is different in terms of opening and closing.",
        "source": "T33n1717_010:0887b04_27"
    },
    {
        "source_sentence": "雖知位數，位數本為分別斷伏，若不識者徒設何為？",
        "translation": "Even though he knows the number of stages, the number of stages is originally discriminated and eliminated, but if he doesn't know them, what will he do?",
        "source": "T33n1717_010:0887b05_28"
    },
    {
        "source_sentence": "故次明斷伏。",
        "translation": "Therefore, it's next explained that they are stopped and subdued.",
        "source": "T33n1717_010:0887b07_29"
    },
    {
        "source_sentence": "既知斷伏，應明斷伏功用不同，既知圓門斷伏功用，若不望前諸位皆麁，",
        "translation": "Since we know that they are to be abandoned, we should explain that the power of abandoning is not the same as that of suppressing. Since we know the power of the perfect approach in terms of abandoning and suppressing, if we do not rely on",
        "source": "T33n1717_010:0887b07_30"
    },
    {
        "source_sentence": "焉知此位諸位中最？",
        "translation": "How can we know that this stage is the highest of all stages?",
        "source": "T33n1717_010:0887b09_31"
    },
    {
        "source_sentence": "既知麁妙，何不純說一實之位，何用前來諸麁位耶？",
        "translation": "Since we know that it's crude and subtle, why don't we simply explain the single true level? Why is there a need for the previous crude levels?",
        "source": "T33n1717_010:0887b09_32"
    },
    {
        "source_sentence": "應知麁妙皆為緣興，緣既迭興，事須迭廢，《法華》前教迭興迭廢，約人雖廢，",
        "translation": "You should know that grossness and subtlety are all produced by conditions. As conditions arise one after the other, things must be abandoned one after another. The former teachings of the Lotus teach that they arise one after another, but even though they are abandoned",
        "source": "T33n1717_010:0887b10_33"
    },
    {
        "source_sentence": "其法仍存，況大小並興受益不等？",
        "translation": "That teaching still exists, so why wouldn't large and small alike benefit from each other?",
        "source": "T33n1717_010:0887b12_34"
    },
    {
        "source_sentence": "若顯若密當座殊源，若橫若竪法味差降，時熟化畢咸會《法華》，根緣既同應無異迹，",
        "translation": "Whether manifest or esoteric, the seat is different from the source, and whether horizontal or vertical, the flavor of the teaching varies. When ripened and transformed, they all assemble to recite the Lotus Sutra. Since their faculties are the",
        "source": "T33n1717_010:0887b13_35"
    },
    {
        "source_sentence": "諸麁至此妙理斯均，是故須有開顯相也。",
        "translation": "The disputes up to this marvelous principle are evenly balanced, so there must be an opening and revealing aspect.",
        "source": "T33n1717_010:0887b15_36"
    },
    {
        "source_sentence": "雖始立名義終至開權，權實諸位理須憑據，雖不孟浪有始有卒，其唯聖人。",
        "translation": "Even though the first establishment of names and meanings ultimately leads to the opening up of rights, the right and real positions must be relied upon. Although it is not that there are beginnings and ends in Menglang, they are only sages.",
        "source": "T33n1717_010:0887b16_37"
    },
    {
        "source_sentence": "既是佛之本意，不得不委辨其大體，故以十門括於一化，方了《法華》妙位之意。",
        "translation": "Since this is the original intention of the Buddha, it's necessary to define his great essence, so by focusing on one teaching with ten aspects, we can understand the meaning of the Lotus's marvelous position.",
        "source": "T33n1717_010:0887b18_38"
    },
    {
        "source_sentence": "於中先釋名義，中二：先指下文，次辨今意又二：先標列三意，次釋。",
        "translation": "Here, we first explain the names and meanings, which are twofold: first, we'll point out the next sentence, and then we'll discuss the present meaning. There are two more: first, we'll list three meanings, and then we'll",
        "source": "T33n1717_010:0887b20_39"
    },
    {
        "source_sentence": "釋中自三，今釋初意中二：先述，次釋。",
        "translation": "There are three parts in the explanation, but now we'll explain the first part of the meaning: first, we'll describe it, and then we'll explain it.",
        "source": "T33n1717_010:0887b21_40"
    },
    {
        "source_sentence": "述中先述二名與小教同，次結。",
        "translation": "In the explanation, first, he explains that the two names are the same as the lesser teaching and then concludes.",
        "source": "T33n1717_010:0887b22_41"
    },
    {
        "source_sentence": "次「何者」下釋，釋中先釋初名中經，但述應供之名，今具以羅漢果上三義釋之，",
        "translation": "Next, he explains under What's? In the explanation, he first explains the first name of the sūtra in the middle name but describes the names of the offerings, and now he explains them in terms of the three meanings above the fruit of the",
        "source": "T33n1717_010:0887b23_42"
    },
    {
        "source_sentence": "一一文中皆以偏顯圓。",
        "translation": "In each text, they are all partially expressed as perfect.",
        "source": "T33n1717_010:0887b25_43"
    },
    {
        "source_sentence": "言「三種意陰」者，二乘在彼三中之一，今通言之，故云「三種」，非謂二乘盡具三也。",
        "translation": "The expression three kinds of mental aggregate refers to the fact that the two vehicles are one of the three, and now we're talking about them in general, so it's called three kinds, which doesn't mean that the two vehicles have all three",
        "source": "T33n1717_010:0887b25_44"
    },
    {
        "source_sentence": "言「意陰」者，由意生陰名為意陰，又作意生陰名為意陰，又意即是陰名為意陰。",
        "translation": "The expression mental aggregate refers to the aggregate of thought because the aggregate that arises from thought is called the mental aggregate, and the aggregate that arises from contemplation is called the mental aggregate, and the aggregate",
        "source": "T33n1717_010:0887b27_45"
    },
    {
        "source_sentence": "前之兩釋從因得名，後之一釋從果得名。",
        "translation": "The first two explain that names come from causes, and the last one explains that names come from results.",
        "source": "T33n1717_010:0887b29_46"
    },
    {
        "source_sentence": "又雖名意陰，亦可具五。",
        "translation": "Also, even though they are called manas, they can be five in number.",
        "source": "T33n1717_010:0887b30_47"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T33n1717_010:0887c01_0"
    },
    {
        "source_sentence": "佛尚具足常色等五，況復因人？",
        "translation": "The Buddha is still endowed with such five things as eternal form, so why wouldn't he be able to cause people?",
        "source": "T33n1717_010:0887c01_1"
    },
    {
        "source_sentence": "但小教中不云界外更有生處。",
        "translation": "But the lesser teaching doesn't say that there's another place of birth outside the realm.",
        "source": "T33n1717_010:0887c01_2"
    },
    {
        "source_sentence": "然不了教尚云滅心，何況於色？",
        "translation": "However, it doesn't understand that the teaching is still called cessation of mind, so why wouldn't it be about form?",
        "source": "T33n1717_010:0887c02_3"
    },
    {
        "source_sentence": "「淨名曰其供汝」者，此借《淨名》折挫之言。",
        "translation": "The phrase pure names are called their offerings to you refers to the words that refute it in the Pure Names.",
        "source": "T33n1717_010:0887c03_4"
    },
    {
        "source_sentence": "彼經挫其同於悲境，當知聲聞應供義偏。",
        "translation": "That sūtra refutes the idea that it's the same as compassion, so you should know that śrāvakas should make offerings with partiality.",
        "source": "T33n1717_010:0887c04_5"
    },
    {
        "source_sentence": "次釋後名，可知。",
        "translation": "The following is an explanation of the latter name, which can be understood.",
        "source": "T33n1717_010:0887c05_6"
    },
    {
        "source_sentence": "次釋名別義圓，五十二名不異於別，從初至後觀圓證圓，《止觀》第六卷末云「借下成高」，",
        "translation": "Next, he explains that the names are distinct and their meanings are complete, and the fifty-two names aren't different from each other. From the beginning to the end of the sixth volume of the Zhiguan jing, he says, Borrow",
        "source": "T33n1717_010:0887c05_7"
    },
    {
        "source_sentence": "此之謂也。",
        "translation": "This is called that.",
        "source": "T33n1717_010:0887c07_8"
    },
    {
        "source_sentence": "次名義俱圓者，從始至終無非佛眼佛智。",
        "translation": "The next is called both perfect in name and meaning because from the beginning to the end, there's no buddha-eye or buddha-wisdom that aren't buddhas.",
        "source": "T33n1717_010:0887c08_9"
    },
    {
        "source_sentence": "言「入室」等者，皆云「如來」，故知名圓。",
        "translation": "The words entering the room and so forth all say the Tathāgata, which is why they're called perfect.",
        "source": "T33n1717_010:0887c09_10"
    },
    {
        "source_sentence": "既云諸法空座，大慈悲室如來莊嚴，故知義圓。",
        "translation": "Since it's called the empty seat of all dharmas and the great compassionate abode of the Tathāgata's adornment, we know that its meaning is complete.",
        "source": "T33n1717_010:0887c09_11"
    },
    {
        "source_sentence": "次明位數，如名義俱圓中雖並以佛知見之言謂之為俱，然諸教大量須曉位數方能引於行者心期。",
        "translation": "Next, we'll explain the number of stages, just as in the name and meaning are both complete, even though they're all called together because the words of Buddha's knowing and seeing are called co-existent, but there are so many teachings that only when",
        "source": "T33n1717_010:0887c11_0"
    },
    {
        "source_sentence": "於中二：標列，次釋。",
        "translation": "Here, there are two: labeling and listing, followed by an explanation.",
        "source": "T33n1717_010:0887c13_1"
    },
    {
        "source_sentence": "釋自三：先釋數中四，先列古師，次「今謂」下斥舊，三「又有」下重述破，",
        "translation": "The explanation consists of three parts: first, he explains the number of ancient masters in four parts. First, he lists the ancient masters; second, he refutes the old one under Now that it's called, and third, he repeats",
        "source": "T33n1717_010:0887c13_2"
    },
    {
        "source_sentence": "四「論諸」下正明今意。",
        "translation": "Fourth, under discussing the present meaning, he correctly explains the present meaning.",
        "source": "T33n1717_010:0887c15_3"
    },
    {
        "source_sentence": "初師意者，並列無位之文，或生臆見未當大途，或引經文不曉聖者意別，",
        "translation": "The first teacher's idea is to list all the texts without status, or to give rise to a false view that they won't follow the great path, or to quote sūtras and texts that don't understand the noble person's distinct meaning.",
        "source": "T33n1717_010:0887c16_0"
    },
    {
        "source_sentence": "是故須破。",
        "translation": "Therefore, it must be refuted.",
        "source": "T33n1717_010:0887c17_1"
    },
    {
        "source_sentence": "「頓悟初心即究竟」者，然《華嚴》中位兼圓別，人不通曉兩教位意，",
        "translation": "The phrase sudden awakening of the first mind is the ultimate means, however, that in the Flower Ornament, the stages are both complete and distinct, and people don't understand the meaning of the two teachings.",
        "source": "T33n1717_010:0887c18_0"
    },
    {
        "source_sentence": "又復不達圓位始終，直指初心以為妙覺，唯尚頓門成佛速疾，乃成圓教後位徒施，",
        "translation": "Furthermore, they don't understand the beginning and end of the perfect stages, pointing straight to the first mind as the marvelous awakening, but only at the sudden approach of becoming a buddha quickly, then they accomplish the perfect teaching and give",
        "source": "T33n1717_010:0887c19_1"
    },
    {
        "source_sentence": "兼成出佛煩重之過，故依舊判誠為未可。",
        "translation": "It's also a way to remove the Buddha's serious faults of affliction, so we still judge sincerity as unacceptable.",
        "source": "T33n1717_010:0887c21_2"
    },
    {
        "source_sentence": "次斥中三：初總斥中云「悉是偏」者，約理則證法無名，約事則不無諸位，",
        "translation": "The next refutation is threefold: first, the general refutation says, They are all partial because they realize that things lack names in terms of principle and don't lack states in terms of things.",
        "source": "T33n1717_010:0887c22_3"
    },
    {
        "source_sentence": "故知諸師偏從理說。",
        "translation": "Therefore, it's known that the masters speak partially from the principle.",
        "source": "T33n1717_010:0887c24_4"
    },
    {
        "source_sentence": "次「然」下別述難意。",
        "translation": "Next, under Still, he explains the meaning of the difficulty separately.",
        "source": "T33n1717_010:0887c24_5"
    },
    {
        "source_sentence": "前之三師並云頓悟，故總以一頓悟斥之，引經失旨其理自虧，故知悟即初住，",
        "translation": "The previous three masters all said that it is called sudden awakening. Therefore, they generally reject it with one sudden awakening. citing scriptural errors in which the doctrine is inherently deficient, we know that awakening is",
        "source": "T33n1717_010:0887c25_6"
    },
    {
        "source_sentence": "未悟即住前。",
        "translation": "Those who haven't yet awakened are those who abide in front.",
        "source": "T33n1717_010:0887c26_7"
    },
    {
        "source_sentence": "既許有悟與不悟，何妨兩位俱有淺深，乃成五十二位耶？",
        "translation": "Since it's accepted that there's enlightenment and non-enlightenment, why wouldn't both have shallowness and depth, which make up the fifty-two stages?",
        "source": "T33n1717_010:0887c27_8"
    },
    {
        "source_sentence": "三「究竟」下引經部所明皆有兩意，如何獨以無位為語？",
        "translation": "Third, under ultimate, he cites the sūtras and explains that they all have two meanings, so how can we use the absence of status alone as language?",
        "source": "T33n1717_010:0887c28_9"
    },
    {
        "source_sentence": "次重述中二：先述、次難。",
        "translation": "Next, there are two repeated explanations: first, it's explained and second, it's difficult.",
        "source": "T33n1717_010:0887c29_10"
    },
    {
        "source_sentence": "初文者，此師意者，兼斥前之三師，故立定言。",
        "translation": "The first text means that this teacher's idea is to reject the previous three teachers, so he establishes a definite saying.",
        "source": "T33n1717_010:0887c30_11"
    },
    {
        "source_sentence": "次「今例」下以見證為難，又三：先正舉權實兩證，次引《大論》譬，",
        "translation": "Next, under present examples, we'll use witnessing as a difficulty, and there are three more: first, we'll correctly cite the two realizations of right and reality, and then we'll cite the Mahāprajñāpāramitā meta",
        "source": "T33n1717_010:0888a01_12"
    },
    {
        "source_sentence": "三引《普賢觀》證。",
        "translation": "Third, he cites the realization of the Samantabhadra Avalokitêśvara.",
        "source": "T33n1717_010:0888a03_0"
    },
    {
        "source_sentence": "初如文。",
        "translation": "The first is as explained in the text.",
        "source": "T33n1717_010:0888a03_1"
    },
    {
        "source_sentence": "引《大論》中二：先引論，次例論意，謂江海淺深。",
        "translation": "There are two quotes from the Mahāprajñāpāramitā: first, we'll cite a treatise, and then an example of the meaning of the treatise, which is to say that the rivers and seas are shallow and deep.",
        "source": "T33n1717_010:0888a03_2"
    },
    {
        "source_sentence": "引《普賢觀》云：「大乘因有」等者，雖俱實相因果灼然，若有因果即有深淺，",
        "translation": "The quote from the Samantabhadra Avalokitêśvara says, The great vehicle has causes and effects, etc. Although both true characteristics of cause and effect are enlightened, if there are causes and effects, then there's depth and shallow",
        "source": "T33n1717_010:0888a04_3"
    },
    {
        "source_sentence": "如《止觀》中及此下文圓漸漸圓四句料簡，則圓家之漸，冷然可知。",
        "translation": "As described in the Zhiguan jing and here below, these four sentences are summarized in terms of gradual completion and gradual completion, then the gradualness of the perfect family is cold and can be understood.",
        "source": "T33n1717_010:0888a06_4"
    },
    {
        "source_sentence": "次正明今意為三：初總述用位意，次「還約」下列位數，三「今於」下釋。",
        "translation": "Next, we'll explain the present meaning in three ways: first, we'll summarize the meaning of the level of use; second, we'll return to the following level by referring to the number of levels; and third, we'll explain it under",
        "source": "T33n1717_010:0888a07_5"
    },
    {
        "source_sentence": "初文言「隨順契經」等者，是佛所說契教根理，乃如符契，故名為「契」。",
        "translation": "The first phrase, following the sūtras and so forth refers to the principle of the faculties and principles of the teachings taught by the Buddha, which are thus called dharmas because they fit together.",
        "source": "T33n1717_010:0888a09_6"
    },
    {
        "source_sentence": "佛尚赴機以說諸位，末代弘教應順聖言；",
        "translation": "The Buddha still visited the opportunity to explain the various states of enlightenment. His extensive teachings in later ages ought to follow the holy sayings.",
        "source": "T33n1717_010:0888a10_7"
    },
    {
        "source_sentence": "若不爾者，如來何故為此凡下遍說諸位？",
        "translation": "If that's not the case, then why did the Tathāgata explain all the stages for these worldlings?",
        "source": "T33n1717_010:0888a11_8"
    },
    {
        "source_sentence": "故知皆為令物聞位，歡喜生善破惡發真，即是明位利益意也。",
        "translation": "Therefore, it's known that they all aim to cause things to hear the stage and rejoice in the goodness that arises, breaks down badness, and gives rise to the truth, which is the intention to explain the benefits of the stage.",
        "source": "T33n1717_010:0888a12_9"
    },
    {
        "source_sentence": "故今依諸教如下所引是也。",
        "translation": "Therefore, we're relying on the teachings as cited below.",
        "source": "T33n1717_010:0888a14_10"
    },
    {
        "source_sentence": "次列，可見。",
        "translation": "The next one lists them in order, as shown.",
        "source": "T33n1717_010:0888a15_11"
    },
    {
        "source_sentence": "三釋中二：先述今文所立，次廣釋諸位。",
        "translation": "In the three explanations, there are two: first, we'll explain what's established in the present text, and then we'll explain the stages in detail.",
        "source": "T33n1717_010:0888a15_12"
    },
    {
        "source_sentence": "初文者，先述、次釋。",
        "translation": "The first is a text that first describes and then explains.",
        "source": "T33n1717_010:0888a16_13"
    },
    {
        "source_sentence": "釋中先大師，次私釋。",
        "translation": "In the explanation, the first is a teacher, and the second is a private explanation.",
        "source": "T33n1717_010:0888a16_14"
    },
    {
        "source_sentence": "前文為三：先正釋，次「如此」下結歎，三「若欲」下決位。",
        "translation": "The preceding sentence is divided into three: first, a correct explanation; second, a verse under thus concludes by praising it; and third, a decision on the level under if you want to.",
        "source": "T33n1717_010:0888a17_15"
    },
    {
        "source_sentence": "初自為五，初品文者，又二：先述境，即圓聞而起信也。",
        "translation": "The first is self-five, and the first part of the text is twofold: first, it describes the object, which is to say that perfect hearing gives rise to faith.",
        "source": "T33n1717_010:0888a18_16"
    },
    {
        "source_sentence": "一塵中有大千經卷，如《止觀》第三記。",
        "translation": "In a single particle of dust, there's a great chiliocosm of sūtras and fascicles, as recorded in the third entry in Zhiguan.",
        "source": "T33n1717_010:0888a19_17"
    },
    {
        "source_sentence": "次「欲開」下依信起行，又二：先正明十乘行法，次「舉」下結束示位。",
        "translation": "Next, under wanting to initiate, he relies on faith to initiate practice, and there are two more: first, he correctly explains the practice of the ten vehicles, and then he concludes by showing their stages under raising.",
        "source": "T33n1717_010:0888a20_18"
    },
    {
        "source_sentence": "初文者又三：初總明行意，次「圓行者」下總示行相，三「略言」下別示行相。",
        "translation": "The first text has three parts: first, it summarizes the meaning of practice; second, it summarizes the characteristics of practice under Perfect Practice; and third, it shows the characteristics of practice separately under Abbreviated Meaning.",
        "source": "T33n1717_010:0888a21_19"
    },
    {
        "source_sentence": "先舉數，次列圓行為十者，即十法成乘，廣論具如《止觀》第五初至第七末。",
        "translation": "The first gives the number, and the second lists the ten perfect practices, which are the ten ways to accomplish the vehicle of the ten dharmas, as explained in detail in the fifth, fifth, and seventh parts of Zhiguan.",
        "source": "T33n1717_010:0888a23_20"
    },
    {
        "source_sentence": "今此正意論於教門，是故觀法文相稍略，故但略列與前三教以為比決，",
        "translation": "This is the correct meaning of the present treatise, which deals with the aspect of doctrine. That is why we observe that the syllables and characteristics of the doctrine are slightly abbreviated. Therefore, we simply list them briefly to",
        "source": "T33n1717_010:0888a25_21"
    },
    {
        "source_sentence": "顯經圓意。",
        "translation": "It shows the perfect meaning of the sūtras.",
        "source": "T33n1717_010:0888a26_22"
    },
    {
        "source_sentence": "次「行者」下明第二品，於中為四：初正明第二品相，次「內外」下明第二品中十觀，",
        "translation": "Next, under practitioner, he explains the second chapter, which consists of four parts: first, he correctly explains the second chapter's characteristics; second, under inside and outside, he explains the ten contemplations in the second chapter; third",
        "source": "T33n1717_010:0888a27_23"
    },
    {
        "source_sentence": "三「金剛」下引證，四「聞有」下結位。",
        "translation": "The third is cited under Vajra, and the fourth concludes with the stages under hearing that there are.",
        "source": "T33n1717_010:0888a29_0"
    },
    {
        "source_sentence": "初二如文。",
        "translation": "The first two are as explained in the text.",
        "source": "T33n1717_010:0888a29_1"
    },
    {
        "source_sentence": "引證文三：初引《金剛》以證能資，次舉次品資於前品，三引彌勒論以證能資力大。",
        "translation": "The first cites the Diamond Sutra to prove that it's capable of providing support, the second cites the next chapter to provide support for the previous one, and the third cites the Maitreya Treatise to prove that it's capable of providing great strength",
        "source": "T33n1717_010:0888a30_0"
    },
    {
        "source_sentence": "「論云於實名了因」等者，頌意正明讀誦《般若》資於實相，是故持誦名為了因，",
        "translation": "The phrase the treatise says that it's called the perfect cause in terms of true names and so forth refers to the meaning of the verse, which correctly explains that recitation of Prajñāpāramitā provides real characteristics; therefore, reci",
        "source": "T33n1717_010:0888b01_1"
    },
    {
        "source_sentence": "故云「於實」，降斯已外，但名生因，生因者有漏因也，故云「於餘福不趣菩提二能趣菩提」者，",
        "translation": "That's why it's called the cause of arising, and the cause of arising is a contaminated cause; therefore, it's called the cause of other merits that don't lead to enlightenment and the two that can lead to enlight",
        "source": "T33n1717_010:0888b03_2"
    },
    {
        "source_sentence": "布施七寶如須彌山，福也。",
        "translation": "Giving seven treasures like Mount Sumeru is also a blessing.",
        "source": "T33n1717_010:0888b05_3"
    },
    {
        "source_sentence": "受持及讀誦此二，趣菩提，是故此二名為了因。",
        "translation": "Accepting and reciting these two are the path to enlightenment, so these two are called the perfect cause.",
        "source": "T33n1717_010:0888b06_4"
    },
    {
        "source_sentence": "論文「福不趣菩提」二句在前，「於實名了因」二句在後，今從義便，",
        "translation": "The first two sentence, Merit that doesn't lead to enlightenment, comes before the second sentence, and the second sentence, Understanding Causes in Reality, comes after the second sentence.",
        "source": "T33n1717_010:0888b07_5"
    },
    {
        "source_sentence": "於理不違。",
        "translation": "It's not contradictory to the principle.",
        "source": "T33n1717_010:0888b09_6"
    },
    {
        "source_sentence": "又準五種法師，於論二文各開為兩，更加說法名五法師。",
        "translation": "Also, according to the five kinds of masters, the two texts of the treatise are each divided into two, and the additional teaching is called the five masters of the Dharma.",
        "source": "T33n1717_010:0888b09_7"
    },
    {
        "source_sentence": "今引論文，且存自行，故無說法又不名師。",
        "translation": "Now, it's cited as a self-reliance, so there's no teaching that isn't called teacher.",
        "source": "T33n1717_010:0888b10_8"
    },
    {
        "source_sentence": "安樂行疏廣釋五種法師。",
        "translation": "Anlexing's commentary explains the five kinds of masters of the Dharma in detail.",
        "source": "T33n1717_010:0888b11_9"
    },
    {
        "source_sentence": "次「行者」下明第三品，為三：初明第三品相，次「安樂行」下引證，",
        "translation": "Next, under Practitioner, he explains the third chapter, which is divided into three parts: first, he explains the characteristics of the third chapter; second, he cites the realization under Peaceful Practice.",
        "source": "T33n1717_010:0888b12_10"
    },
    {
        "source_sentence": "三「說法」下結位。",
        "translation": "Third, he concludes by explaining the stages under Teaching the Dharma.",
        "source": "T33n1717_010:0888b13_11"
    },
    {
        "source_sentence": "初如文。",
        "translation": "The first is as explained in the text.",
        "source": "T33n1717_010:0888b14_12"
    },
    {
        "source_sentence": "次引三文者，〈安樂行〉，可見。",
        "translation": "The next quote from the three texts refers to the practice of peace and comfort, which can be seen.",
        "source": "T33n1717_010:0888b14_13"
    },
    {
        "source_sentence": "次《淨名》文云「說法淨」等者，唯說圓常內心無著故名為淨，如引〈安樂行〉云「但以大乘法答」等，",
        "translation": "Next, the text of the Pure Names says, Teaching the Dharma is purified, and so forth, because it only explains that perfect permanence has no internal attachment in mind and therefore is called purity, as quoted in the Anāthapiṇ",
        "source": "T33n1717_010:0888b15_14"
    },
    {
        "source_sentence": "故知以說法力內熏自智，令倍清淨化功歸己，意在於斯。",
        "translation": "Therefore, it is known that by means of the power of expounding the doctrine one perfumes his own knowledge internally, thereby doubling the effort of purifying and transforming [themselves]. This is the meaning of this.",
        "source": "T33n1717_010:0888b17_15"
    },
    {
        "source_sentence": "大小同然，故引毘曇以為類例。",
        "translation": "Both large and small are the same, so we cite the Vedas as examples.",
        "source": "T33n1717_010:0888b18_16"
    },
    {
        "source_sentence": "若言「聽法得解脫」者，在隨喜位初，文意各別相從來耳。",
        "translation": "If someone says, Hearing the teaching and attaining liberation means that at the beginning of the stage of following joy, the words and meanings each come from differently.",
        "source": "T33n1717_010:0888b19_17"
    },
    {
        "source_sentence": "次「上來」下明第四品，為四：初明位相，次「大品」下引證，三「此則」下明位意，",
        "translation": "The next section, coming from above, explains the fourth chapter, which consists of four parts: first, an explanation of status and characteristics; second, a realization under Mahāprajñāpāramitā; third, an explanation of status under Thus",
        "source": "T33n1717_010:0888b20_18"
    },
    {
        "source_sentence": "四「事福」下結位。",
        "translation": "Fourth, under works and merits, he concludes with the stages.",
        "source": "T33n1717_010:0888b22_19"
    },
    {
        "source_sentence": "次「行人」下明第五品，中二：亦先明位相，次「具足」下結位。",
        "translation": "Next, under practitioners, we'll explain the fifth chapter, which has two parts: first, we'll also explain the stages and characteristics, and then we'll conclude with the stages under complete.",
        "source": "T33n1717_010:0888b22_20"
    },
    {
        "source_sentence": "初文二：先總明，次「若布施」下別示六度之相。",
        "translation": "The first text is twofold: first, it's a general explanation, and second, if you give almsgiving, it shows the distinctive characteristics of the six perfections.",
        "source": "T33n1717_010:0888b24_21"
    },
    {
        "source_sentence": "故知正行六度文中，為欲略明圓境故，云「十界依正俱捨」。",
        "translation": "Therefore, it's known that in the text of the six perfections of right practice, it's because they want to briefly explain the perfect object and say, The ten realms rely on the correct equanimity of both.",
        "source": "T33n1717_010:0888b25_22"
    },
    {
        "source_sentence": "廣明行相，應如隨自意及《止觀》，正助合行、事理不二方名正行。",
        "translation": "The extensive explanation of the characteristics of practice should be like following one's own thoughts and calming and contemplating, which are called right practice when they correctly assist combine practice and when things and principles aren't two.",
        "source": "T33n1717_010:0888b26_23"
    },
    {
        "source_sentence": "若取其意，但用三藏事、六度相，皆以實相融令不二無非法界，即是其相。",
        "translation": "If someone takes their meaning, but uses the three collections and the characteristics of the six perfections to combine them with true characteristics so that they aren't two and don't have an unlawful realm, this is their characteristic.",
        "source": "T33n1717_010:0888b27_24"
    },
    {
        "source_sentence": "「無畏等施」者，論有三施，謂資生、無畏、法。",
        "translation": "The phrase fearlessness and so forth refers to three kinds of giving in the treatise, which are necessities, fearlessness, and dharmas.",
        "source": "T33n1717_010:0888b29_25"
    },
    {
        "source_sentence": "捨於依正名施資生，略不言法故云「等」也。",
        "translation": "It's called equal because it's based on the correct name of giving necessities and doesn't say anything about the Dharma.",
        "source": "T33n1717_010:0888b30_26"
    },
    {
        "source_sentence": "次結歎，可知。",
        "translation": "The next concludes with a verse of praise, which can be understood.",
        "source": "T33n1717_010:0888c01_27"
    },
    {
        "source_sentence": "三決位中「類如三藏念處位」等者，但大小相望俱是外凡，不論內觀及境優劣，",
        "translation": "In the three determined stages, categories such as the stage of the Tripiṭaka's state of mindfulness are simply external worldlings whether large or small in size, regardless of internal contemplation and the superiority or inferiority of objects.",
        "source": "T33n1717_010:0888c01_28"
    },
    {
        "source_sentence": "下去格位一切皆然，一一品中皆應具十更倍增明，文無者略。",
        "translation": "All of the following categories and stages are likewise, each chapter should be accompanied by ten morefold increase in clarity, and the text is abbreviated because it doesn't have words.",
        "source": "T33n1717_010:0888c03_29"
    },
    {
        "source_sentence": "故十信初復重牒云「令五倍深明」也。",
        "translation": "That's why the first of the ten kinds of faith again explains, Causing it to be fivefold more profound.",
        "source": "T33n1717_010:0888c05_30"
    },
    {
        "source_sentence": "私釋中因向決位，故以五品對於五停。",
        "translation": "In the private explanation, it's because they're headed toward the stage of determination that they use five categories to oppose the five kinds of stopping.",
        "source": "T33n1717_010:0888c05_31"
    },
    {
        "source_sentence": "於中為二：初總對，次別對。",
        "translation": "There are two kinds: the first is general opposition, and the second is specific opposition.",
        "source": "T33n1717_010:0888c06_32"
    },
    {
        "source_sentence": "言「文字是法身氣命」者，例如欲界有漏色身，息住命住、息盡命盡。",
        "translation": "The expression words words words are the Dharma body, energy, and life refers to the contaminated form body in the desire realm that stops, abides, lives, and ends when it stops.",
        "source": "T33n1717_010:0888c07_33"
    },
    {
        "source_sentence": "法身亦爾，有能詮教法身則住，大乘教沒法身豈存？",
        "translation": "The Dharma body is also like this. If someone can expound and teach the Dharma body, then they will abide. How could the Dharma body that disappears from the teaching of the Great Vehicle exist?",
        "source": "T33n1717_010:0888c09_34"
    },
    {
        "source_sentence": "故隨喜位內觀法身，無讀誦息持於慧命，則被覺觀破壞法身。",
        "translation": "Therefore, if someone observes the Dharma body internally in the stage of joy and doesn't recite it or maintain the life of wisdom without reciting it, then they'll be subject to perception and contemplation that destroys the Dharma body.",
        "source": "T33n1717_010:0888c10_35"
    },
    {
        "source_sentence": "正行六度中云「即事而理」等者，理即是佛，事妨於道，於事會理使事無妨，",
        "translation": "In the six perfections of correct practice, it's said, 'That is, things and principles.' The principle is the Buddha, and things obstruct the path; things combine with principles so that things are not obstructed.",
        "source": "T33n1717_010:0888c11_36"
    },
    {
        "source_sentence": "妨即是障，即事而理無障可論。",
        "translation": "An obstruction is an obstruction, which is a thing but not an obstruction in principle that can be discussed.",
        "source": "T33n1717_010:0888c13_37"
    },
    {
        "source_sentence": "「十信位」者，又為五：初牒五品為十信因，次正明十法橫竪對十信，",
        "translation": "The ten stages of faith are fivefold: first, they explain that the five classes are the causes of the ten kinds of faith; second, they correctly explain that the ten dharmas are horizontally opposed to the ten kinds of faith.",
        "source": "T33n1717_010:0888c14_38"
    },
    {
        "source_sentence": "三「普賢」下引證，四「入此」下功能，五「此位」下指廣所明。",
        "translation": "Third, it's cited under Samantabhadra, fourth, the function under Entering Here, and fifth, this stage, which refers to what's explained in detail.",
        "source": "T33n1717_010:0888c15_39"
    },
    {
        "source_sentence": "初文者，然此中先重牒前五品之初，聞圓起信能習十法，成於圓行，入隨喜品；",
        "translation": "The first part of the text, however, is a repetition of the beginning of the first five chapters. Hearing and perfecting faith give rise to the ten qualities that enable one to cultivate them:",
        "source": "T33n1717_010:0888c17_40"
    },
    {
        "source_sentence": "品品漸進入十信位，名為圓位。",
        "translation": "Each chapter gradually enters the stage of the ten stages of faith, which is called the perfect stage.",
        "source": "T33n1717_010:0888c18_41"
    },
    {
        "source_sentence": "次「以善」下正明十法，既由十乘入於十信，故今文義理須具對橫竪二意，",
        "translation": "Next, under with goodness, he correctly explains the ten dharmas. Since it's because of the ten vehicles that they enter into the ten kinds of faith, the meaning and principle of the present text must be explained in terms of both horizontal and vertical",
        "source": "T33n1717_010:0888c19_42"
    },
    {
        "source_sentence": "故先竪對，次引《纓珞》十信有百以對橫文，故知十信與十乘義義同名異，",
        "translation": "That's why we first contrasted the ten kinds of faith, and then cited the hundred pairs of the ten kinds of faith in the Lotus to contrast the horizontal text. Therefore, we know that the ten kinds of faith are the same in meaning as the",
        "source": "T33n1717_010:0888c21_43"
    },
    {
        "source_sentence": "須善會通令不失旨。",
        "translation": "They must be well-understood so that they don't lose their meaning.",
        "source": "T33n1717_010:0888c23_44"
    },
    {
        "source_sentence": "今比望豎出其橫相，一一信中言「善修」者，由緣實相行於五悔，策勤精進，",
        "translation": "Now, we're comparing it to the horizontal characteristics that are raised in the hope that each faith will be called well cultivated. This is because of the five kinds of repentance that are conditioned by the true characteristics and practiced with respect to",
        "source": "T33n1717_010:0888c23_45"
    },
    {
        "source_sentence": "至第五品得入十信，名為善修。",
        "translation": "Up to the fifth class, attaining the ten kinds of faith and entering them is called good cultivation.",
        "source": "T33n1717_010:0888c25_46"
    },
    {
        "source_sentence": "由善修故相似解起，是故十法在相似位，轉名信心，乃至願心亦復如是。",
        "translation": "Because they are well cultivated, similar understanding arises. That is why the ten dharmas abide in an approximate state and are translated as faith. The same applies up to the awareness of resolve.",
        "source": "T33n1717_010:0888c26_47"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T33n1717_010:0888c27_48"
    },
    {
        "source_sentence": "不思議境以信為本，慈悲弘誓藉念力持，心安止觀功由精進，破於三惑妙慧方遍，",
        "translation": "The inconceivable state of mind is based on faith; compassion and great vows are sustained by the power of mindfulness; peace of mind and contemplation come from effort. It is pervaded only by subtle wisdom that destroys the three passions.",
        "source": "T33n1717_010:0888c28_49"
    },
    {
        "source_sentence": "於通無塞由決定力，元修道品為求不退，正助無闕迴因向果，不濫次位方能護法，",
        "translation": "Because of the power of certainty regarding penetration and non-obstruction, they are able to preserve the doctrine. The primary factors of enlightenment are sought in order not to regress; they correctly assist one who does not lack the causes",
        "source": "T33n1717_010:0888c30_50"
    },
    {
        "source_sentence": "內外不動由善防非，於法無愛由大願力，故得至此名為信心乃至願心。",
        "translation": "The absence of affection for the Dharma is due to the power of a great vow. Therefore, attaining it is called faith and so on up to the mind of aspiration.",
        "source": "T33n1717_010:0889a02_51"
    },
    {
        "source_sentence": "十法既許初心具修，當知信信皆具十法，是則十信有百明矣。",
        "translation": "Since the ten dharmas allow the first mind to be fully cultivated, you should know that faith and faith are all endowed with the ten dharmas, which means there are a hundred insights in the ten kinds of faith.",
        "source": "T33n1717_010:0889a04_0"
    },
    {
        "source_sentence": "三引二經證，可見。",
        "translation": "Three, it's shown by citing two sūtras to actualize it.",
        "source": "T33n1717_010:0889a05_1"
    },
    {
        "source_sentence": "四功能中二：先正敘功能，次引《仁王》。",
        "translation": "Of the four functions, there are two: first, a correct description of their functions, and second, an introduction to the Humane Kings.",
        "source": "T33n1717_010:0889a05_2"
    },
    {
        "source_sentence": "證云「十善菩薩發大心」者，亦有人云：六根清淨名為頓義，十善菩薩此是漸義。",
        "translation": "Some people also say, The purity of the six faculties is called sudden meaning, and this is the gradual meaning of the ten good bodhisattvas.",
        "source": "T33n1717_010:0889a06_3"
    },
    {
        "source_sentence": "今文所引十善菩薩以證六根，豈應引漸而證於頓？",
        "translation": "The ten good bodhisattvas cited in the present text realize the six faculties, so why would they cite gradualness and realize suddenness?",
        "source": "T33n1717_010:0889a08_4"
    },
    {
        "source_sentence": "故知二文俱頓明矣。",
        "translation": "Therefore, it's clear that the two texts are both suddenly explained.",
        "source": "T33n1717_010:0889a09_5"
    },
    {
        "source_sentence": "但《仁王經》語其初後，《法華經》意論其中間，人不見之徒生異見。",
        "translation": "However, the Renwang jing says that at the beginning and end of it, while the Fahua jing discusses the meaning of the teachings in between, and people who don't see them give rise to different views.",
        "source": "T33n1717_010:0889a10_6"
    },
    {
        "source_sentence": "五指廣教，中二：先總舉，次「華嚴」下引眾多文。",
        "translation": "The five points of the extensive teaching are twofold: first, he summarizes it and second, under Huayan, he cites many texts.",
        "source": "T33n1717_010:0889a11_7"
    },
    {
        "source_sentence": "初云「華嚴法慧」等者，彼經不列十信之名，唯於住前觀十梵行，自古講者判為十信，",
        "translation": "The first thing he says, Huayan fahui and so forth, is that the sūtras don't list the names of the ten kinds of faith, but simply contemplate the ten religious practices before they abide.",
        "source": "T33n1717_010:0889a12_8"
    },
    {
        "source_sentence": "故今引之以為信位。",
        "translation": "That's why it's now cited as the stage of faith.",
        "source": "T33n1717_010:0889a14_9"
    },
    {
        "source_sentence": "十梵行空，具如《止觀》第七記。",
        "translation": "The ten religious practices are empty, as described in the seventh entry in Zhiguan.",
        "source": "T33n1717_010:0889a15_10"
    },
    {
        "source_sentence": "「譬如入海先見平相」者，《大論》六十六云：「聞深般若乃至正憶念，",
        "translation": "The phrase like entering the ocean and first seeing a flat shape refers to the sixty-sixth section of the Mahāprajñāpāramitā, which says, Hearing profound prajñā or even correctly remembering it,",
        "source": "T33n1717_010:0889a16_0"
    },
    {
        "source_sentence": "當知是人不久授記。",
        "translation": "You should know that this person will soon be given a prediction.",
        "source": "T33n1717_010:0889a17_1"
    },
    {
        "source_sentence": "如欲見海，發心欲趣，不見樹相山林等相，當知是人雖不見海，知海不遠。",
        "translation": "Like someone who wants to see the ocean but doesn't see the characteristics of trees, mountains, forests, and other characteristics, you should know that even though they don't see the ocean, they know it's not far away.",
        "source": "T33n1717_010:0889a17_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T33n1717_010:0889a19_3"
    },
    {
        "source_sentence": "大海處平無樹等相故。」",
        "translation": "It's because the great ocean is level and has no marks like trees.",
        "source": "T33n1717_010:0889a20_0"
    },
    {
        "source_sentence": "菩薩受持般若正憶念等，雖未佛前聞劫數記，自知近於菩提不久。",
        "translation": "Even though the bodhisattva hadn't heard the Buddha's prediction for an eon before, he knows that it won't be long before he's near enlightenment.",
        "source": "T33n1717_010:0889a20_1"
    },
    {
        "source_sentence": "樹山等者，生死也。",
        "translation": "The mountain of trees and so forth refers to birth and death.",
        "source": "T33n1717_010:0889a22_2"
    },
    {
        "source_sentence": "又如春樹陳葉若落，當知是時新葉不久；",
        "translation": "It is also like the case of a spring tree that when its leaves fall, you should know that it will not be long before new leaves appear.",
        "source": "T33n1717_010:0889a22_3"
    },
    {
        "source_sentence": "聞深般若，觀行成就亦復如是。",
        "translation": "Hearing profound prajñā, the accomplishment of contemplation and practice is likewise.",
        "source": "T33n1717_010:0889a23_4"
    },
    {
        "source_sentence": "「仁王、普賢觀如前引」者，《仁王》偈云：「十善菩薩發大心，長別三界苦輪海。」",
        "translation": "The phrase Humane Kings and Samantabhadra's contemplation as cited above refers to the verse in the Humane Kings, saying, Ten good bodhisattvas give rise to a great mind that longs to the ocean of the three realms of suffering",
        "source": "T33n1717_010:0889a24_5"
    },
    {
        "source_sentence": "次文即云「習種銅輪二天下」，故知十善是鐵輪位。",
        "translation": "The next text says, Cultivate the copper wheel in two worlds, so you know that the ten good qualities are the stage of the iron wheel.",
        "source": "T33n1717_010:0889a26_6"
    },
    {
        "source_sentence": "《普賢觀》云「十境界」等，又云「三昧力故六根漸淨」，具如經說。",
        "translation": "The Samantabhadra Avalokitêśvara says, Ten objective realms, and so forth, and it's also said that the six faculties are gradually purified because of the power of samādhi, as explained in the sūtras.",
        "source": "T33n1717_010:0889a27_7"
    },
    {
        "source_sentence": "六根淨已，為諸如來摩頭授記，授記即是入初住也。",
        "translation": "After the six faculties are purified, he gives assurance to the tathāgatas that they'll enter the first abode.",
        "source": "T33n1717_010:0889a28_8"
    },
    {
        "source_sentence": "故知六根即是住前十信位也。",
        "translation": "Therefore, it's known that the six faculties are those who abide in the first ten stages of faith.",
        "source": "T33n1717_010:0889a29_9"
    },
    {
        "source_sentence": "引今經意者，既云安樂之行，安樂名涅槃，即指初住已上。",
        "translation": "The meaning of the present sūtra is that since it's called the practice of well-being, well-being is called nirvāṇa, which refers to the first abode upward.",
        "source": "T33n1717_010:0889a30_10"
    },
    {
        "source_sentence": "前通望位，雖以五品為行；",
        "translation": "Although the former one had five classes as its aspect, it was in a state of general expectation.",
        "source": "T33n1717_010:0889b01_11"
    },
    {
        "source_sentence": "今此望證為行，故知明行必在住前。",
        "translation": "Now, we're expecting to realize it as practice, so we know that the practice of insight must be prior to abiding.",
        "source": "T33n1717_010:0889b02_12"
    },
    {
        "source_sentence": "行處則通，通於五品十信，近名有通有別，如疏釋云「約遠而論近，即離十惱亂，",
        "translation": "The proximate name has both penetration and distinction. As the commentary explains, To discuss proximity in terms of distance, that is to say, freedom from the ten kinds of disturbance by saying:",
        "source": "T33n1717_010:0889b03_13"
    },
    {
        "source_sentence": "約近而論近，即指在空間處修攝其心，約非遠非近而論近，即指不動不退等一十八空。」",
        "translation": "He discusses proximity in terms of nearness, which refers to cultivating his mind in the space where it's cultivated, and discusses proximity in terms of what's neither distant nor near, which refers to the 18 kinds of empti",
        "source": "T33n1717_010:0889b05_14"
    },
    {
        "source_sentence": "菩薩應須觀察如是三法，故俱名近。",
        "translation": "Bodhisattvas should observe these three things, so they're both called proximate.",
        "source": "T33n1717_010:0889b07_15"
    },
    {
        "source_sentence": "是則所近之法有親有疎，故云「通別」。",
        "translation": "This is because the dharmas that are approached have both proximate and distant, so it's called shared and distinct.",
        "source": "T33n1717_010:0889b08_16"
    },
    {
        "source_sentence": "通疎、別深故也。",
        "translation": "It's because it's shared, distant, and distinctively profound.",
        "source": "T33n1717_010:0889b09_17"
    },
    {
        "source_sentence": "引《涅槃》意亦與安樂義同。",
        "translation": "The meaning of the quote from Nirvāṇa also has the same meaning as that of peace and happiness.",
        "source": "T33n1717_010:0889b09_18"
    },
    {
        "source_sentence": "《大論》意者，即涅槃為所觀所證，故知行道亦在住前，亦是如來之行。",
        "translation": "The meaning of the Mahāprajñāpāramitā is that nirvāṇa is realized by contemplation, so it's known that the path of practice is also prior to abiding, which is also the Tathāgata's practice.",
        "source": "T33n1717_010:0889b10_19"
    },
    {
        "source_sentence": "次明「十住位」者，為五：初總牒信為入住之因，次「初發」下明三法開發，",
        "translation": "Next, we'll explain the stages of the ten abodes in five ways: first, we'll explain that faith is the cause for abiding in enlightenment; second, we'll explain the development of the three dharmas under first arousal",
        "source": "T33n1717_010:0889b11_20"
    },
    {
        "source_sentence": "三「舉要」下明十法分成，四「仁王」下略引證，五「此位」下指廣教法。",
        "translation": "Third, under Essentials, he explains the division of the ten dharmas into parts, fourth, beneath Humane Kings, he briefly cites their realization, and fifth, This stage, he refers to the extensive teaching.",
        "source": "T33n1717_010:0889b13_21"
    },
    {
        "source_sentence": "初二如文。",
        "translation": "The first two are as explained in the text.",
        "source": "T33n1717_010:0889b14_22"
    },
    {
        "source_sentence": "三從「舉要言之」去十文，即是初住十法，從證受名，故名為「住」。",
        "translation": "The third is to remove the ten phrases from cite and summarize, which are the first abode of the ten dharmas that are called abiding because they receive their names from realization.",
        "source": "T33n1717_010:0889b15_0"
    },
    {
        "source_sentence": "故《仁王》云：「入理般若名為住」，住於三德一切佛法，乃至能生後後諸位，",
        "translation": "That's why the Humane Kings says, Entering into the principle of prajñā is called abiding, which abides in all the buddha-dharmas of the three virtues up to the point where they can give rise to subsequent stages.",
        "source": "T33n1717_010:0889b16_1"
    },
    {
        "source_sentence": "位位無不皆具十法故也。",
        "translation": "It's because there are no stages that don't all contain the ten dharmas.",
        "source": "T33n1717_010:0889b18_2"
    },
    {
        "source_sentence": "故今十法從住為名，後去諸位用此初住十法為因。",
        "translation": "Therefore, the present ten dharmas are named by reason of their duration. These first ten dharmas of duration serve as the cause for the later stages to be abandoned.",
        "source": "T33n1717_010:0889b18_3"
    },
    {
        "source_sentence": "於中為二：初大師釋出初住十法，次私會釋。",
        "translation": "There are two of these: the first is to explain the first abode of the ten dharmas by the great master, and the second is to explain them privately.",
        "source": "T33n1717_010:0889b19_4"
    },
    {
        "source_sentence": "初又二：先正釋，次「華嚴」下稱歎。",
        "translation": "The first is twofold: first, he explains it correctly, and then he praises it under Huayan.",
        "source": "T33n1717_010:0889b21_0"
    },
    {
        "source_sentence": "初文中意言從證者，證不思議名住一切佛法，證三種菩提名住慈悲普覆，",
        "translation": "The first part of the sentence means to realize, by realizing inconceivable names and abiding in all the Buddha's teachings, realizing the three kinds of enlightenment that are called abiding in compassion and universally obstructed by",
        "source": "T33n1717_010:0889b21_1"
    },
    {
        "source_sentence": "證寂照止觀名住成就萬行，證破三惑遍名住一心三智，證於通無塞名住佛眼圓見，",
        "translation": "He realizes the name-abiding accomplishment of myriad practices called abiding in tranquility, illumination, cessation, and contemplation; he realizes the name-abiding refutation of the three delusions everywhere called abiding in one mind and three",
        "source": "T33n1717_010:0889b23_2"
    },
    {
        "source_sentence": "證無作道滅名住法身冥益，證助道萬行名住神通顯益，證圓門實位名住開顯一乘，",
        "translation": "To realize the cessation of the unconstructed path is called abiding in the mysterious benefit of the Dharma body; to realize the myriad practices that aid in the path is called abiding in supernormal powers and revealing benefit; to realize the",
        "source": "T33n1717_010:0889b25_3"
    },
    {
        "source_sentence": "證安忍內外名住嚴淨佛土，證無諸法愛名住諸地功德，此初住證轉似為真故也。",
        "translation": "To realize peaceful tolerance inside and out is called abiding in the adornment and pure Buddha land, and to realize the absence of craving for dharmas is called abiding in the merits of the stages, which is because this first abode",
        "source": "T33n1717_010:0889b27_4"
    },
    {
        "source_sentence": "四引證，可知。",
        "translation": "The fourth is to cite as proof, which can be understood.",
        "source": "T33n1717_010:0889b29_5"
    },
    {
        "source_sentence": "人見淺深之言，多不曉於圓別之意，具如下辨，亦如《止觀》中文。",
        "translation": "People who see shallow and deep words often don't understand the distinctive meaning of perfection, as explained below, just as it's explained in the text of Zhiguan.",
        "source": "T33n1717_010:0889b30_6"
    },
    {
        "source_sentence": "五指廣教者，並是證一分無生，能八相作佛，故云「坐道場」等。",
        "translation": "The five fingers of the extensive teaching are those who realize a part of nonproduction and can become buddhas in eight characteristics, so they're called sitting at the site of enlightenment.",
        "source": "T33n1717_010:0889c01_7"
    },
    {
        "source_sentence": "《大經》云「發心畢竟二不別」等者，此並迦葉歎初住文也。",
        "translation": "The Mahāprajñāpāramitā-sūtra says, The arousal of mind is ultimately two and not distinct, and so forth, which are the words Kāśyapa praising the first abode.",
        "source": "T33n1717_010:0889c03_0"
    },
    {
        "source_sentence": "《華嚴》釋初住中讚文甚廣不能具記，行向地文多是《華嚴》、《纓珞》文意，",
        "translation": "The text of the Flower Ornament explains that in the first abode, there are extensive praises that cannot be recorded in detail. Most of the verses on practice and dedication of merit are taken from the meaning of the texts of the Flower Or",
        "source": "T33n1717_010:0889c04_1"
    },
    {
        "source_sentence": "《纓珞》文雖次第，亦可借用念念進入之言。",
        "translation": "Although the text of the Garland is sequential, it can also be used to enter in with mindfulness and words.",
        "source": "T33n1717_010:0889c05_2"
    },
    {
        "source_sentence": "妙覺位中名大涅槃，十法至此俱名為大，是故文云御車達到猶名為車，",
        "translation": "In the state of marvelous awakening, it's called great nirvāṇa, and the ten dharmas up to this point are all called great. That's why the text says that the arrival of a royal chariot is still called a",
        "source": "T33n1717_010:0889c06_3"
    },
    {
        "source_sentence": "自爾已前雖具諸法，未究竟顯不名為大。",
        "translation": "Even though all the dharmas have been present since then, they haven't been fully revealed and aren't called great.",
        "source": "T33n1717_010:0889c08_4"
    },
    {
        "source_sentence": "雖有慈悲為無明隔，故不名大。",
        "translation": "Even though it has compassion as the obstacle to ignorance, it is not called great.",
        "source": "T33n1717_010:0889c09_5"
    },
    {
        "source_sentence": "雖常寂照所嚴未窮，能嚴非大。",
        "translation": "Even though it's always tranquil and illuminating, what's adorned hasn't been exhausted, and what can be adorned isn't great.",
        "source": "T33n1717_010:0889c10_6"
    },
    {
        "source_sentence": "雖破三惑智未周窮，故智非大。",
        "translation": "Even though the knowledge that destroys the three passions has not yet been exhausted, it is not great because of this.",
        "source": "T33n1717_010:0889c11_7"
    },
    {
        "source_sentence": "雖知通塞，塞仍未盡，故知非大。",
        "translation": "Even though they know the penetrating obstruction, they still haven't exhausted the obstruction; therefore, they know it's not great.",
        "source": "T33n1717_010:0889c11_8"
    },
    {
        "source_sentence": "雖得道品道未至極，故道非大。",
        "translation": "Even though the path of the class of enlightenment is acquired, it does not reach the utmost; therefore the path is not great.",
        "source": "T33n1717_010:0889c12_9"
    },
    {
        "source_sentence": "雖用正助正行未滿，故用非大。",
        "translation": "Even though the function of correctly assisting and correctly practicing is not complete, it is therefore not great.",
        "source": "T33n1717_010:0889c13_10"
    },
    {
        "source_sentence": "雖復開權理未窮終，故開非大。",
        "translation": "Even though it opens up the right and principle, it doesn't end; therefore, it opens up what's not great.",
        "source": "T33n1717_010:0889c14_11"
    },
    {
        "source_sentence": "雖忍二邊猶有餘惑，故益非大。",
        "translation": "Even though there are two extremes of patience, still there are other defilements. Therefore, the benefit is not great.",
        "source": "T33n1717_010:0889c15_0"
    },
    {
        "source_sentence": "雖不著位，位未至極，故位非大。",
        "translation": "Even though it is not attached to a state, the state is not great because it has not reached the ultimate state.",
        "source": "T33n1717_010:0889c15_1"
    },
    {
        "source_sentence": "是故妙覺十皆名大，名究竟乘。",
        "translation": "That's why the ten marvelous awakenings are all called great, and they're called the ultimate vehicle.",
        "source": "T33n1717_010:0889c16_2"
    },
    {
        "source_sentence": "十法成乘對大車喻，如《止觀》第七。",
        "translation": "The parable of the ten dharmas that form the vehicle and confront the great chariot is as described in the seventh section of Zhiguan.",
        "source": "T33n1717_010:0889c17_3"
    },
    {
        "source_sentence": "乃至分別此十法中或七或一等。",
        "translation": "It's even a discernment of whether there are seven or one of these ten dharmas.",
        "source": "T33n1717_010:0889c18_4"
    },
    {
        "source_sentence": "次引證中三：初總標，次廣引，三「如上」下結酬。",
        "translation": "Next, there are three ways to cite the proof: first, a general outline, second an extensive explanation, and third, a conclusion under thus above.",
        "source": "T33n1717_010:0889c18_5"
    },
    {
        "source_sentence": "初如文。",
        "translation": "The first is as explained in the text.",
        "source": "T33n1717_010:0889c19_6"
    },
    {
        "source_sentence": "次文者又二：初引諸經，次引此經。",
        "translation": "The next text is twofold: the first cites the sūtras, and the second cites this sūtra.",
        "source": "T33n1717_010:0889c20_7"
    },
    {
        "source_sentence": "初引諸經中二：先《大經》，次《大品》。",
        "translation": "The first quote from the sutras is twofold: first, the Mahāprajñāpāramitā-sūtra, and second, the Mahāprajñāpāramitā.",
        "source": "T33n1717_010:0889c20_8"
    },
    {
        "source_sentence": "初引《大經》中二：先正引釋，次「問」下釋疑。",
        "translation": "The first quote from the Mahāprajñāpāramitā-sūtra is twofold: first, he correctly cites an explanation, and second, he explains the doubt under Questions.",
        "source": "T33n1717_010:0889c21_9"
    },
    {
        "source_sentence": "初文又二：先引月愛三昧以證位中智斷，次引第二經以證三德。",
        "translation": "The first text is further twofold: first, he cites the samādhi of moon love to realize the cessation of cognition in the midst of stages, and second, he cites the second sūtra to realize the three virtues.",
        "source": "T33n1717_010:0889c22_10"
    },
    {
        "source_sentence": "初文又二：初「大涅槃」下證約智斷論法身，次「大經」下證約法身論智斷，",
        "translation": "The first text is further twofold: first, under Mahāparinirvāṇa, it proves that the Dharma body is discussed in terms of wisdom and elimination; second, under Mahāprajñāpāramitā, it proves that the Dharma body is discuss",
        "source": "T33n1717_010:0889c24_11"
    },
    {
        "source_sentence": "合前智斷等共顯三德。",
        "translation": "It combines the three virtues that are shared with the previous cognition of cessation and so forth to reveal the three virtues.",
        "source": "T33n1717_010:0889c25_12"
    },
    {
        "source_sentence": "二文各有譬、合。",
        "translation": "Each of the two texts has an analogy and a combination.",
        "source": "T33n1717_010:0889c26_13"
    },
    {
        "source_sentence": "月愛三昧，〈梵行品〉文。",
        "translation": "The moon loves samādhi, the text of the Sanskrit Practice Chapter.",
        "source": "T33n1717_010:0889c26_14"
    },
    {
        "source_sentence": "次文者，合前三德秖是祕藏。",
        "translation": "The next text combines the first three virtues with the secret store.",
        "source": "T33n1717_010:0889c27_15"
    },
    {
        "source_sentence": "次釋疑中先問、次答，問意者，經中耆婆為闍王說，總有六喻：初喻善心開敷，",
        "translation": "Next, he explains the meaning of the first question and second answer in terms of doubt. In the sūtras, Jīvaka explained it to King Ajātaśatru. There are six general metaphors:",
        "source": "T33n1717_010:0889c28_0"
    },
    {
        "source_sentence": "次喻行者心喜，三四二喻善根增煩惱減，五喻除貪，六喻愛樂，云何得知此喻智斷？",
        "translation": "The next metaphor is that practitioner's mind is joyful, the third, fourth, and second metaphors are good roots that increase and decrease afflictions, the fifth metaphor removes craving, and the sixth metaphor",
        "source": "T33n1717_010:0889c29_1"
    },
    {
        "source_sentence": "此是通問。",
        "translation": "This is a general question.",
        "source": "T33n1717_010:0890a01_2"
    },
    {
        "source_sentence": "答中以《仁王》、《勝天》兩般若助證《大經》，驗《大經》文義當智斷。",
        "translation": "In the answer, he uses the two prajñāpāramitās of仁王 and勝天 to help realize the Mahāprajñāpāramitā in order to testify that the meaning of the Mahāprajñāpāramitā's text will be",
        "source": "T33n1717_010:0890a02_0"
    },
    {
        "source_sentence": "「仁王十四忍」者，忍是因義，至果名智，今欲通論智斷，故以智名替忍。",
        "translation": "The fourteen tolerances of the humane king means that forbearance is the meaning of cause, and up to the result is called wisdom. Now, we want to discuss the cessation of wisdom in general, so we'll use the name wisdom to replace",
        "source": "T33n1717_010:0890a03_1"
    },
    {
        "source_sentence": "《勝天王》中亦以般若為十四，般若即是智德。",
        "translation": "In the Vaiśeṣika-deva-rāja, prajñā is also considered to be fourteen, and prajñā is the virtue of wisdom.",
        "source": "T33n1717_010:0890a05_0"
    },
    {
        "source_sentence": "彼二經中既有十四智斷，何妨《大經》十四智斷，十四義成十五可例。",
        "translation": "Since there are 14 kinds of cognition to be eliminated in these two scriptures, why would the Mahāprajñāpāramitā-sūtra eliminate fourteen kinds of cognition? Fourteen meanings make fifteen examples.",
        "source": "T33n1717_010:0890a06_1"
    },
    {
        "source_sentence": "次引《大品》者又二：先引經，次「諸學人」下釋疑。",
        "translation": "The next quote from the Mahāprajñāpāramitā is twofold: first, he cites the sūtras, and then he explains the doubt under students.",
        "source": "T33n1717_010:0890a07_2"
    },
    {
        "source_sentence": "初文中云「四十二字門」云「語等」等者，南嶽釋云言「字等」者，謂法慧說十住，",
        "translation": "The first part of the text says forty-two syllable approaches, saying words and so forth, which means that Dharma wisdom teaches the ten abodes.",
        "source": "T33n1717_010:0890a08_3"
    },
    {
        "source_sentence": "十方說十住者皆名法慧，乃至金剛藏亦復如是。",
        "translation": "Those in the ten directions who say the ten abodes are all called Dharma wisdom, and so is the Vajra store.",
        "source": "T33n1717_010:0890a10_4"
    },
    {
        "source_sentence": "言「語等」者，十方諸佛說十住與法慧說等，乃至十地亦復如是。",
        "translation": "When it comes to words and so forth, the buddhas of the ten abodes in the ten directions explain the ten abodes as explained by Dharma wisdom, and so forth, up to the ten stages are likewise.",
        "source": "T33n1717_010:0890a11_5"
    },
    {
        "source_sentence": "又一切字皆是無字，能作一切字，是名「字等」，發言無二，是名「語等」。",
        "translation": "Furthermore, all words are without words and can create all words, which is called words and so forth, and the expressions that give rise to words are not two, which is called words and so forth.",
        "source": "T33n1717_010:0890a13_6"
    },
    {
        "source_sentence": "一切諸法皆互相在，是名諸字入門等也。",
        "translation": "All dharmas are all present in each other, which is called the entryway of words and so forth.",
        "source": "T33n1717_010:0890a14_7"
    },
    {
        "source_sentence": "前是事解，次是理解。",
        "translation": "The first is understanding of phenomena, and the second is understanding.",
        "source": "T33n1717_010:0890a15_8"
    },
    {
        "source_sentence": "次釋疑中二：先出疑，次「但論文」下釋。",
        "translation": "Next, there are two explanations of doubt: first, we'll explain the doubt, and then we'll explain it under simply.",
        "source": "T33n1717_010:0890a16_9"
    },
    {
        "source_sentence": "釋中二：先引論文略釋意，次「今謂」下以字義意釋。",
        "translation": "The explanation has two parts: first, he briefly explains the meaning of the word, and second, under Now, he explains it in terms of its meaning.",
        "source": "T33n1717_010:0890a16_10"
    },
    {
        "source_sentence": "釋中又四：初略引字義；",
        "translation": "The first is a brief explanation of the meaning of the word.",
        "source": "T33n1717_010:0890a18_11"
    },
    {
        "source_sentence": "次引《華嚴》與字義同，同是圓意；",
        "translation": "The next quote from the Flower Ornament is with the same syllable meaning as the word, which is the same as the perfect meaning.",
        "source": "T33n1717_010:0890a18_12"
    },
    {
        "source_sentence": "三「經云」下引經釋四十二字為證；",
        "translation": "Third, the sūtra says that the following quote from the sūtra explains forty-two words as proof.",
        "source": "T33n1717_010:0890a19_13"
    },
    {
        "source_sentence": "四「廣乘」下引經文次第以證字義。",
        "translation": "Fourth, under extensive vehicle, he cites the sūtras and texts in order to prove the meaning of the word.",
        "source": "T33n1717_010:0890a20_14"
    },
    {
        "source_sentence": "初二文可見。",
        "translation": "The first two texts are visible.",
        "source": "T33n1717_010:0890a21_0"
    },
    {
        "source_sentence": "三引經者，經中具釋四十二字功德互足，具如南嶽兩卷中釋，釋兼三教，",
        "translation": "The third quote from the sūtra is that the sūtras explain that the forty-two words are mutually sufficient in terms of merit, as explained in the two volumes of Nanyue, and that they explain the three teachings together.",
        "source": "T33n1717_010:0890a21_1"
    },
    {
        "source_sentence": "今意在圓。",
        "translation": "Now, the idea is to perfect.",
        "source": "T33n1717_010:0890a23_2"
    },
    {
        "source_sentence": "四引經文次第為二：先正引，次結酬。",
        "translation": "The four quotes from the sūtras are divided into two orders: first, they correctly cite and second, they conclude with an explanation.",
        "source": "T33n1717_010:0890a23_3"
    },
    {
        "source_sentence": "初文者，《大品》第五釋廣乘中，彼廣明三十七品乃至十八不共法已，",
        "translation": "The first text is the fifth explanation of the extensive vehicle in the Mahāprajñāpāramitā, which explains in detail the thirty-seven chapters up to the eighteen distinctive qualities.",
        "source": "T33n1717_010:0890a24_4"
    },
    {
        "source_sentence": "廣釋四十二字門，次第六卷。",
        "translation": "Extensive explanation of the forty-two syllable aspect, which follows in the sixth volume.",
        "source": "T33n1717_010:0890a25_5"
    },
    {
        "source_sentence": "〈發趣品〉中明菩薩摩訶薩發趣者，從初歡喜地乃至法雲地，法雲中明修治地業，",
        "translation": "The chapter on the arousal of aspiration explains that the bodhisattva Mahāsattva's arousal of aspiration is from the first ground of joy up to the ground of the Dharma-cloud, and in the Dharma-cloud it explains the",
        "source": "T33n1717_010:0890a26_6"
    },
    {
        "source_sentence": "次〈發趣〉後〈出到品〉中「須菩提問：是乘從何處出？",
        "translation": "Subsequently, in the Chapter on Coming Forth, he asks, Where does this vehicle come from?",
        "source": "T33n1717_010:0890a28_7"
    },
    {
        "source_sentence": "到何處住？",
        "translation": "Where will they live?",
        "source": "T33n1717_010:0890a29_8"
    },
    {
        "source_sentence": "佛言：無人乘而到乾慧等地。」",
        "translation": "The Buddha said, There's no one to ride and reach the stage of dry wisdom.",
        "source": "T33n1717_010:0890a29_9"
    },
    {
        "source_sentence": "是故結云「經文次比」。",
        "translation": "That's why the conclusion is, The text of the sūtras are compared in order.",
        "source": "T33n1717_010:0890a30_10"
    },
    {
        "source_sentence": "次正引此經為二：初引〈分別功德〉、〈法師方便品〉，通證始終圓位；",
        "translation": "The next is a correct citation of this scripture, which is divided into two: the first cites the Discourse on Distinctive Merit and the Teaching Master’s Chapter on Skillful Means to realize the perfect state from beginning to end.",
        "source": "T33n1717_010:0890a30_11"
    },
    {
        "source_sentence": "次引〈譬喻〉及〈序〉，別證四十二因果之位。",
        "translation": "The next quote from the Metaphors and Preface shows the forty-two causal stages of cause and effect separately.",
        "source": "T33n1717_010:0890b02_12"
    },
    {
        "source_sentence": "初文者，初明因位，次「又云」下證果位。",
        "translation": "The first text first explains the causal stage, and then it's explained the stage of realization of fruition under Furthermore.",
        "source": "T33n1717_010:0890b03_13"
    },
    {
        "source_sentence": "初因位中二：先引兩品證內外凡，次引〈方便〉以證聖位。",
        "translation": "In the first causal stage, there are two: first, he cites two chapters to realize internal and external worldlings, and second, he cites the method to realize the noble stage.",
        "source": "T33n1717_010:0890b04_14"
    },
    {
        "source_sentence": "又二：初正引，次引南嶽釋證。",
        "translation": "There are two more: the first is a correct citation, and the second is an explanation of Nanyue's realization.",
        "source": "T33n1717_010:0890b05_15"
    },
    {
        "source_sentence": "證中又二：先以事證謂開等，次引理證同證實故。",
        "translation": "There are two kinds of realization: first, it's because the things that are realized are called enlightenment and so forth, and second, it's because the principles that are realized are cited to realize the same reality.",
        "source": "T33n1717_010:0890b06_16"
    },
    {
        "source_sentence": "次果位，可知。",
        "translation": "The second is the state of result, which can be known.",
        "source": "T33n1717_010:0890b07_17"
    },
    {
        "source_sentence": "次引兩品中初〈譬喻〉意者，寶乘是諸子所乘，乘必從因至果，果必究竟道場，",
        "translation": "The next one quotes the meaning of the first metaphor in both texts: The jeweled vehicle is what children ride, and the vehicle must lead from cause to effect, and the result must end up at the site of enlightenment.",
        "source": "T33n1717_010:0890b07_18"
    },
    {
        "source_sentence": "既先遊四方，非因何謂？",
        "translation": "Since he had previously traveled to the four directions, what's meant by a non-cause?",
        "source": "T33n1717_010:0890b09_19"
    },
    {
        "source_sentence": "諸聲聞等既得記已即入初住，驗知即是真因位也。",
        "translation": "After they have received the assurance, śrāvakas and so forth immediately enter the first abode and realize that this is the true causal stage.",
        "source": "T33n1717_010:0890b10_20"
    },
    {
        "source_sentence": "此因無易，故云「直至」。",
        "translation": "This cause is not easy, so it's called until.",
        "source": "T33n1717_010:0890b11_21"
    },
    {
        "source_sentence": "次〈序品〉意者，凡為序者作正弄引，覩引知正應不徒施，以正宗中譚實相因果故也。",
        "translation": "The next meaning of the Preface section is that whenever there's a preface, he correctly introduces it, and when he correctly introduces it, he knows that he shouldn't simply give it because it's the cause and effect of the true",
        "source": "T33n1717_010:0890b11_22"
    },
    {
        "source_sentence": "用正驗序始末炳然，是故四華從天然理，畢竟因空而雨果佛，使見聞者莫不修一乘因、感一乘果，",
        "translation": "Because the beginning and end of the preface to the correct test are brilliant, therefore the four flowers follow the natural principle that ultimately it's because of emptiness that they rain fruit buddhas, so that those who see and hear them will all cultivate the causes",
        "source": "T33n1717_010:0890b13_23"
    },
    {
        "source_sentence": "故復及諸大眾，故知表因真位明矣。",
        "translation": "That's why it's also the same as the masses, so we know that the true state of manifesting causes is clear.",
        "source": "T33n1717_010:0890b16_24"
    },
    {
        "source_sentence": "言結酬者如文。",
        "translation": "The expression 'binding reward' is as explained in the text.",
        "source": "T33n1717_010:0890b17_0"
    },
    {
        "source_sentence": "「炳」明也。",
        "translation": "Bing is also an explanation.",
        "source": "T33n1717_010:0890b17_1"
    },
    {
        "source_sentence": "故知前以無位難者，不然。",
        "translation": "Therefore, it is known that the previous one was because of the difficulty of being without a state. This is not right.",
        "source": "T33n1717_010:0890b17_2"
    },
    {
        "source_sentence": "三料簡中二：初料簡品位，次以四句料簡開合。",
        "translation": "In the third, there are two ways to summarize: first, they summarize the categories and grades, and second, they summarize the opening and closing with four sentences.",
        "source": "T33n1717_010:0890b18_3"
    },
    {
        "source_sentence": "初文又二：初料簡品位，次「末代」下勸誡。",
        "translation": "The first text has two parts: the first summarizes the categories and stages, and the second exhorts and admonishes under Latter Dynasty.",
        "source": "T33n1717_010:0890b19_4"
    },
    {
        "source_sentence": "初又二：先料簡品，次「此諸」下料簡位。",
        "translation": "The first is twofold: first, we'll discuss the summary chapter, and then we'll discuss the summary stages under these.",
        "source": "T33n1717_010:0890b20_5"
    },
    {
        "source_sentence": "前是《纓珞》，次是料簡《涅槃》、《大品》。",
        "translation": "The first was the Mahayanasamgraha Sastra, and the second was the Prakaraṇasamgraha Sastra and the Mahāprajñāpāramitā.",
        "source": "T33n1717_010:0890b21_6"
    },
    {
        "source_sentence": "品位相成共顯一義，觀心不須料簡。",
        "translation": "The characteristics of the classes are formed in order to express a common meaning, and the contemplation mind doesn't need to be summarized.",
        "source": "T33n1717_010:0890b21_7"
    },
    {
        "source_sentence": "初問如文。",
        "translation": "The first question is as explained in the text.",
        "source": "T33n1717_010:0890b22_8"
    },
    {
        "source_sentence": "答中言「法愛」者，即真道法愛也。",
        "translation": "The answer says craving for the Dharma, which is the true love of the Dharma of the path.",
        "source": "T33n1717_010:0890b23_0"
    },
    {
        "source_sentence": "次文中意者，雖用涅槃不可定執。",
        "translation": "The meaning of the next sentence is that even though he uses nirvāṇa, he can't definitely cling to it.",
        "source": "T33n1717_010:0890b23_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T33n1717_010:0890b24_2"
    },
    {
        "source_sentence": "非證不知。",
        "translation": "They don't realize it and don't know it.",
        "source": "T33n1717_010:0890b24_3"
    },
    {
        "source_sentence": "凡明位者，但是為接凡下等耳。",
        "translation": "Whatever explains the level, it's simply to connect with what's below ordinary and so forth.",
        "source": "T33n1717_010:0890b25_4"
    },
    {
        "source_sentence": "於中二：初恐失佛旨，次「如此」下明諸位非聖莫測。",
        "translation": "There are two: first, fearful of losing the Buddha's teaching; second, thus, it's explained that the stages aren't noble and cannot be fathomed.",
        "source": "T33n1717_010:0890b25_5"
    },
    {
        "source_sentence": "初文中云「若專對當法門」乃至「別解別執」等者，如是圓位，若不以四十二字門譬之，",
        "translation": "The first part of the text says, If we focus on the approach to the future teachings and say separately understand and separately cling, etc., this is the perfect stage, but if we don't use the forty-two-syllable metaphor",
        "source": "T33n1717_010:0890b27_6"
    },
    {
        "source_sentence": "不以一心三觀為行，不以無明重數意消，但專對當《大經》次第五行十德法門，",
        "translation": "They don't practice with the three contemplations of one mind as their practice and don't extinguish them with the heavy number of thoughts of nescience, but focus on the fiveth practice of the ten virtuous dharma-gates in order to confront the",
        "source": "T33n1717_010:0890b29_7"
    },
    {
        "source_sentence": "尋者多生次第別見。",
        "translation": "Those who search often give rise to distinctive views in order.",
        "source": "T33n1717_010:0890b30_8"
    },
    {
        "source_sentence": "次明難測中三：初總明難測，次引《華嚴》證，三「且置」下引例。",
        "translation": "Next, there are three ways to explain the difficulty of being unfathomable: first, a general explanation of the difficulty of being unfathomable; second, an example that's cited in the Huayan Sutra to confirm it; and third, an",
        "source": "T33n1717_010:0890c01_9"
    },
    {
        "source_sentence": "又二：初引大師舉極淺位以明難測，次「又且」下展轉比決。",
        "translation": "Second, there are two: first, the great master cites the extremely shallow level to explain the difficulty of unfathomability, and second, furthermore, we'll discuss it in turn under Again.",
        "source": "T33n1717_010:0890c02_10"
    },
    {
        "source_sentence": "初文二：先敘事，次章安述。",
        "translation": "The first text has two parts: first, it describes the situation, and second, it's described in detail.",
        "source": "T33n1717_010:0890c04_11"
    },
    {
        "source_sentence": "初文中云「一旋陀羅尼」者，此經列三陀羅尼，下文釋云「旋假入空名之為旋，",
        "translation": "The first part of the sūtra says, One turn dhāraṇī because this sūtra lists three dhāraṇīs, and the following part explains that turning into emptiness is called turning.",
        "source": "T33n1717_010:0890c04_12"
    },
    {
        "source_sentence": "旋空入假名百千萬億，中道實相名為法音」，今舉三中之初，以劣況勝，",
        "translation": "Whirling through space and entering the provisional is called a hundred thousand million, and the true characteristics of the middle way are called the Dharma sound. Now, we'll cite the first of the three, which is superior because it's inferior in terms of its",
        "source": "T33n1717_010:0890c06_13"
    },
    {
        "source_sentence": "故云一旋。",
        "translation": "That's why it's called one turn.",
        "source": "T33n1717_010:0890c08_14"
    },
    {
        "source_sentence": "約位竪明雖在六根七信已前，今通明之乃在初心。",
        "translation": "Although it's clear in terms of level, it's before the six faculties and seven kinds of faith, but now it's clear that it's in the first mind.",
        "source": "T33n1717_010:0890c08_15"
    },
    {
        "source_sentence": "次文中言「此語有意」者，如智者大師，初見南嶽，所證之法，即此初陀羅尼也。",
        "translation": "The next sentence says, This is the first dhāraṇī of the teaching realized by the great teacher Zhizhe who first saw Nanyue.",
        "source": "T33n1717_010:0890c09_16"
    },
    {
        "source_sentence": "何由可向下類人說，令他解己所證法耶？",
        "translation": "How can you teach it to people of lower classes so that they will understand the teaching you've realized?",
        "source": "T33n1717_010:0890c11_17"
    },
    {
        "source_sentence": "此即章安述大師己證，可知。",
        "translation": "This is what Zhang'an described as the self-witness of the great master, which can be understood.",
        "source": "T33n1717_010:0890c12_18"
    },
    {
        "source_sentence": "次比決中二：先約內法，次約外事。",
        "translation": "Next, there are two inferences: first, we'll discuss internal dharmas, and second, we'll discuss external things.",
        "source": "T33n1717_010:0890c13_19"
    },
    {
        "source_sentence": "內法又二：無漏方便及以事禪。",
        "translation": "There are two more internal dharmas: uncontaminated skillful means and the meditative absorption that deals with things.",
        "source": "T33n1717_010:0890c14_20"
    },
    {
        "source_sentence": "言「斲輪人」等者，《莊子》云：「知者不言，言者不知。",
        "translation": "The expression 'wheel-turning man' and so forth, the Zhuangzi says, Knower doesn't say it, but speakers don't know it.",
        "source": "T33n1717_010:0890c14_21"
    },
    {
        "source_sentence": "如齊桓公讀書於堂上，輪扁斲輪於堂下，釋搥鑿而上(去聲)問桓公曰：公之所讀者何耶？",
        "translation": "It's like when the emperor of Qi studied in the hall, the wheel flattened and unwheeled wheel was under the hall, and Śākyamuni climbed up (deprecated soundlessly) and asked the emperor,",
        "source": "T33n1717_010:0890c15_22"
    },
    {
        "source_sentence": "公曰：聖人之言。",
        "translation": "The gong said, 'The words of the sage.",
        "source": "T33n1717_010:0890c17_23"
    },
    {
        "source_sentence": "曰：聖人在乎？",
        "translation": "He said, Is it a sage?",
        "source": "T33n1717_010:0890c18_24"
    },
    {
        "source_sentence": "公曰：死矣。",
        "translation": "The gong said, I'm dead!",
        "source": "T33n1717_010:0890c18_25"
    },
    {
        "source_sentence": "然則公之所讀者，古人之糟粕也。",
        "translation": "However, what the gong reads is the rubbish of the ancient people.",
        "source": "T33n1717_010:0890c18_26"
    },
    {
        "source_sentence": "公曰：寡人讀書，輪人何得議乎？",
        "translation": "The gong said, How can a wheel-turning man discuss it if there are few people who study it?",
        "source": "T33n1717_010:0890c19_27"
    },
    {
        "source_sentence": "有說則可，無說則死。",
        "translation": "If someone says something, it's possible, but if they don't say anything, they die.",
        "source": "T33n1717_010:0890c20_28"
    },
    {
        "source_sentence": "輪人曰：以臣之事觀之，斲輪徐則甘而不固，疾則苦而不入，不徐不疾，",
        "translation": "The wheel-turning man said, “Through the deeds of my ministers I observed that when the wheel turns are steadfast they are sweet but not firm; when they are painful I do not enter them; and when they are neither",
        "source": "T33n1717_010:0890c20_29"
    },
    {
        "source_sentence": "得之於手而應於心，口不能言，有教存焉。",
        "translation": "They obtained it in their hands but not in their hearts; they could not utter words, and some of the teachings were preserved.",
        "source": "T33n1717_010:0890c22_30"
    },
    {
        "source_sentence": "於其中間，臣不能喻臣之子，臣之子亦不能受之於臣，是以行年七十而斲輪，",
        "translation": "Among them, the ministers can't compare it to a minister's child, and the children of ministers can't accept it from their ministers. That's why he was seventy years old when he practiced Buddhism.",
        "source": "T33n1717_010:0890c23_31"
    },
    {
        "source_sentence": "古人之意不可傳者死矣。",
        "translation": "The ancient man's intention was not to transmit it, so he died.",
        "source": "T33n1717_010:0890c25_32"
    },
    {
        "source_sentence": "故知公之所讀者古人之糟粕矣。」",
        "translation": "That's why we know that what the gong read is the dregs of the ancient people.",
        "source": "T33n1717_010:0890c26_0"
    },
    {
        "source_sentence": "此則人間之事亦不可說。",
        "translation": "This is a human condition that can't be explained.",
        "source": "T33n1717_010:0890c26_1"
    },
    {
        "source_sentence": "次四句又二：先正明四句，次明開合意。",
        "translation": "The next four sentences are further twofold: first, he correctly explains the four sentences, and second, he explains the meaning of opening and uniting.",
        "source": "T33n1717_010:0890c27_2"
    },
    {
        "source_sentence": "◎法華玄義釋籤卷第十",
        "translation": "Fahua xuanyi shiji shou, vol. 10",
        "source": "T33n1717_010:0890c28_3"
    }
]