[
    {
        "source_sentence": "阿彌陀經通贊疏卷下",
        "translation": "*Amitâgama-sūtra, Tongzan shou, vol. 2",
        "source": "T37n1758_003:0343b10_0"
    },
    {
        "source_sentence": "大慈恩寺沙門窺基撰",
        "translation": "Compiled by the monk Qiuqi of Daciun Temple",
        "source": "T37n1758_003:0343b12_0"
    },
    {
        "source_sentence": "經曰：「舍利弗！",
        "translation": "The sūtra said, Śāriputra!",
        "source": "T37n1758_003:0343b13_0"
    },
    {
        "source_sentence": "若有善男子、善女人聞說阿彌陀佛，執持名號，若一日、若二日、若三日、若四日、若五日、若六日、若七日，",
        "translation": "If there are good men and good women who hear the teaching of Amitâbha Buddha and hold his name, whether it's for one day, two days, three days, four days, five days, six days, or seven days,",
        "source": "T37n1758_003:0343b13_1"
    },
    {
        "source_sentence": "一心不亂」。",
        "translation": "One mind isn't disturbed.",
        "source": "T37n1758_003:0343b15_2"
    },
    {
        "source_sentence": "贊曰：第二說多因也。",
        "translation": "He said, The second is to explain the many causes.",
        "source": "T37n1758_003:0343b15_3"
    },
    {
        "source_sentence": "善男子者，梵云烏波索迦，此云近事男，索者男聲也，堅持五戒堪可親近承事比丘僧故。",
        "translation": "Good sons, the Sanskrit word upāsaka means to approach and serve a man because they adhere to the five precepts and can be intimate with and serve the monks and saṃgha.",
        "source": "T37n1758_003:0343b16_4"
    },
    {
        "source_sentence": "善女人者，烏波斯迦，斯者是女聲也，亦持五戒堪可承事比丘尼故。",
        "translation": "A good woman is Upāsaka, which is the female voice because it's capable of serving monks and nuns who uphold the five precepts.",
        "source": "T37n1758_003:0343b18_5"
    },
    {
        "source_sentence": "西天分男女二聲故。",
        "translation": "The western heavens are divided into male and female because of the two sounds.",
        "source": "T37n1758_003:0343b19_6"
    },
    {
        "source_sentence": "聞說阿彌陀佛者，謂於善友處聞此阿彌陀教中往生之事，或自尋覽。",
        "translation": "Someone who hears and teaches about Amitâbha Buddha means to hear the matter of rebirth in this teaching of Amitâbha at a good friend's place or to search for it on their own.",
        "source": "T37n1758_003:0343b20_7"
    },
    {
        "source_sentence": "執持佛名號一日乃至七日一心者，更無間隔，故名曰一心。",
        "translation": "Those who hold the Buddha's name for a day or even seven days with one mind are called single-minded because they don't have any gaps, so they're called single-minded.",
        "source": "T37n1758_003:0343b21_8"
    },
    {
        "source_sentence": "不亂者，專注無散也。",
        "translation": "Someone who isn't disturbed is concentrated and undistracted.",
        "source": "T37n1758_003:0343b23_9"
    },
    {
        "source_sentence": "問：「《淨土論》云：女人及根缺，二乘種不生。",
        "translation": "Q: The Jingtu lun says, Women and the lack of faculties don't give rise to the two-vehicle seeds.",
        "source": "T37n1758_003:0343b23_10"
    },
    {
        "source_sentence": "云何相違？」",
        "translation": "What's the contradiction?",
        "source": "T37n1758_003:0343b24_11"
    },
    {
        "source_sentence": "答：「只如女子念佛，至意專精，命盡欲生，轉成男子便生淨土，有何不可；",
        "translation": "Answer: Just as when a woman is mindful of the Buddha and concentrates her efforts with sincerity, she will be reborn at the end of her life in the Pure Land only if she becomes a man.",
        "source": "T37n1758_003:0343b24_12"
    },
    {
        "source_sentence": "根缺亦爾。",
        "translation": "So it is with the lack of faculties.",
        "source": "T37n1758_003:0343b26_13"
    },
    {
        "source_sentence": "《文殊般若經》云：若人欲生他方現在淨妙國土者，應當隨彼國土佛名，",
        "translation": "The Mañjuśrī Prajñāpāramitā-sūtra says, If someone wants to be born elsewhere in the present pure and marvelous land, they should follow the names of the buddhas of that land.",
        "source": "T37n1758_003:0343b26_14"
    },
    {
        "source_sentence": "一心誦念，願往生者，必得往生。",
        "translation": "If someone recites it with one mind and wishes to be reborn, they'll surely be reborn.",
        "source": "T37n1758_003:0343b28_15"
    },
    {
        "source_sentence": "《觀佛三昧經》云：此念佛三昧，欲使成就，有五因緣：一、持戒不犯；",
        "translation": "The Guanfo sanmei jing (Contemplation of the Buddha Samādhi Sutra) says: There are five reasons why this concentration on mindfulness of Buddha is desired to be accomplished.",
        "source": "T37n1758_003:0343b28_16"
    },
    {
        "source_sentence": "二、不起邪見；",
        "translation": "The second is that they do not give rise to wrong views.",
        "source": "T37n1758_003:0343c01_17"
    },
    {
        "source_sentence": "三、不生諂慢；",
        "translation": "The third is that they do not give rise to hypocrisy and pride.",
        "source": "T37n1758_003:0343c01_18"
    },
    {
        "source_sentence": "四、不恚不嫉；",
        "translation": "The fourth is neither hatred nor jealousy.",
        "source": "T37n1758_003:0343c01_19"
    },
    {
        "source_sentence": "五、勇健精進。",
        "translation": "5. courageous exertion.",
        "source": "T37n1758_003:0343c02_20"
    },
    {
        "source_sentence": "《鼓音聲經》云：令念彼佛名號，七日七夜六時禮拜。",
        "translation": "According to the Foyin sheng jing, it's said that he causes them to recite the names of those buddhas and venerate them at six o'clock for seven days and nights.",
        "source": "T37n1758_003:0343c02_21"
    },
    {
        "source_sentence": "《賢愚經》云：持戒專念七日，亦得往生。",
        "translation": "The Good and Evil Sutra says, If someone observes precepts and focuses on seven days of mindfulness, they'll also be reborn.",
        "source": "T37n1758_003:0343c03_22"
    },
    {
        "source_sentence": "《平等覺經》及《大阿彌陀經》並說三輩得生，如彼中說。」",
        "translation": "The Equanimous Enlightenment Sutra and the Mahā Amitâbha Sutra both explain that the three groups of people can be born, as explained there.",
        "source": "T37n1758_003:0343c04_23"
    },
    {
        "source_sentence": "經曰：「其人臨命終時，阿彌陀佛與諸聖眾現在其前」。",
        "translation": "The sūtra says, When that person's life ends, Amitâbha Buddha and the sages will be present before them.",
        "source": "T37n1758_003:0343c06_0"
    },
    {
        "source_sentence": "贊曰：第三聖眾來迎也。",
        "translation": "He said, The third sage's congregation came to greet him.",
        "source": "T37n1758_003:0343c07_1"
    },
    {
        "source_sentence": "其人者，既七日念佛行人也。",
        "translation": "That person is a practitioner who recites the Buddha's name for seven days.",
        "source": "T37n1758_003:0343c07_2"
    },
    {
        "source_sentence": "臨命終時者，此一報壽命臨欲終時，即彼佛與諸聖眾，即彼國菩薩聲聞等，",
        "translation": "“At the moment of dying”: This one retribution is at the moment when the duration of life approaches the end of desire. That is, when the Buddha and the holy ones - that is to say, bodhisattvas, śrāvakas, etc.",
        "source": "T37n1758_003:0343c08_3"
    },
    {
        "source_sentence": "現身於念佛修行人前，如梁朝珍禪師見白銀臺或見化佛來迎也。",
        "translation": "He manifested his body in front of the practitioner mindfulness of the Buddha, just as the Liang dynasty Chan master Chaozhen saw a white silver dais or he saw the transformation buddha coming to greet him.",
        "source": "T37n1758_003:0343c10_4"
    },
    {
        "source_sentence": "經云：「是人終時，心不顛倒，即得往生阿彌陀佛極樂國土」。",
        "translation": "The sūtra says, When this person dies, his mind isn't mistaken, and he'll be reborn in the land of Amitâbha Buddha's ultimate bliss.",
        "source": "T37n1758_003:0343c12_0"
    },
    {
        "source_sentence": "贊曰：第四眾生往生。",
        "translation": "He said, The fourth is the rebirth of sentient beings.",
        "source": "T37n1758_003:0343c13_1"
    },
    {
        "source_sentence": "不顛倒者，不移正念也，即得往彼國也，蓮華化生顏貌端正如諸菩薩，",
        "translation": "Those who aren’t mistaken don’t move their right mindfulness, and they can go to another land. The appearance of the enlightening beings born by transformation in the lotus flower is just like that of bodhisattvas.",
        "source": "T37n1758_003:0343c13_2"
    },
    {
        "source_sentence": "心無顛倒意想正修，便別穢方頓生淨土，故云即得往生。",
        "translation": "When the mind is not mistaken, thoughts and perceptions are correctly cultivated, then they're suddenly born in the pure land only when they're separated from defilement, which is why it's called rebirth.",
        "source": "T37n1758_003:0343c15_3"
    },
    {
        "source_sentence": "問：「眾生惡業無量，如何念佛滅除業障便得往生淨土？」",
        "translation": "Q: The bad actions of sentient beings are immeasurable, so how can mindfulness of the Buddha extinguish the karmic hindrances and then attain rebirth in the Pure Land?",
        "source": "T37n1758_003:0343c16_4"
    },
    {
        "source_sentence": "答：「《十疑論》說有三義故能敵惡業：一者在心，為造罪是虛妄心，",
        "translation": "Answer: The Treatise on the Ten Doubts explains that there are three meanings of being able to oppose bad actions:",
        "source": "T37n1758_003:0343c17_5"
    },
    {
        "source_sentence": "念佛是真實心，以實除虛有何不可，如千年之闇不能拒朝日之光；",
        "translation": "Mindfulness of Buddha is a real mind. What can be done to dispel the unreal by means of what is real? It is like the darkness of a thousand years that cannot resist the light of the morning sun.",
        "source": "T37n1758_003:0343c19_6"
    },
    {
        "source_sentence": "二者在境，謂造罪緣於顛倒境界，念佛緣於勝妙功德，以真遣偽有何不可；",
        "translation": "The second is that which lies in objects. That is, the condition for committing transgressions lies in the realm of delusion; mindfulness of Buddha lies in the supreme and marvelous qualities. What is unacceptable to dispel falsehood by means of truth?",
        "source": "T37n1758_003:0343c20_7"
    },
    {
        "source_sentence": "三者在淨，謂造罪是染意，念佛是淨心，淨勝染劣詎可相比，如童子[木*為]刀能斷千丈之索，",
        "translation": "The third is pure, that is to say, the thought of committing sins is a defiled thought; mindfulness of Buddha is a pure thought; purity and superiority in terms of defilement and inferiority in terms of defilement can be compared, just as a youthful boy’s [wooden*for] knife cuts off a thousand-foot rope.",
        "source": "T37n1758_003:0343c22_8"
    },
    {
        "source_sentence": "一星之火能燒萬束之薪。",
        "translation": "A single star's fire can burn ten thousand bundles of firewood.",
        "source": "T37n1758_003:0343c24_9"
    },
    {
        "source_sentence": "又《觀經》云：於念念中滅除八十億劫生死之罪。",
        "translation": "Also, the Avalokitêśvara Sutra says, In each moment of thought, he extinguishes the sins of eight billion eons of birth-and-death.",
        "source": "T37n1758_003:0343c25_10"
    },
    {
        "source_sentence": "罪業既除，得生何惑？",
        "translation": "If sins and actions are removed, what afflictions can arise?",
        "source": "T37n1758_003:0343c26_11"
    },
    {
        "source_sentence": "西域之人臨命終時皆以幡像前引，親友知識助念彌陀令發往生之意，是此教也。",
        "translation": "This is the teaching that when people in the Western Regions die, they are all led to the front of the banner and images, and their friends and relatives help them remember Maitreya so that they will give rise to the intention to be reborn.",
        "source": "T37n1758_003:0343c26_12"
    },
    {
        "source_sentence": "又《華嚴》云：將欲沒者令其憶念想見如來，命終得生淨土。",
        "translation": "Also, the Flower Ornament says, Those who want to disappear will cause them to remember and perceive the Tathāgata, and at the end of their life they'll be born in the Pure Land.",
        "source": "T37n1758_003:0343c28_13"
    },
    {
        "source_sentence": "見有臨命欲終，勸念佛名，又示尊像，令其瞻敬，令生善念即得往生。」",
        "translation": "When he sees someone who's about to die, he encourages them to remember the Buddha's name and show them an image of his veneration so that they'll pay respect to it and give rise to good thoughts that will enable them to be reborn.",
        "source": "T37n1758_003:0343c29_14"
    },
    {
        "source_sentence": "問：「臨終作善便得往生，何假預前修諸勝業？」",
        "translation": "Q: At the end of his life, he'll be reborn if he does good deeds, so why would he need to cultivate superior actions in advance?",
        "source": "T37n1758_003:0344a02_15"
    },
    {
        "source_sentence": "答：「人生壽夭難測短長，或即病因昏迷、或即非時奄逝，既闕生前之善，",
        "translation": "Answer: When a person's life span is short and unfathomable, whether it's because of illness or delusion, or if he dies at an ungodly hour, then they lack the goodness that arises before them.",
        "source": "T37n1758_003:0344a03_16"
    },
    {
        "source_sentence": "難逃後世之殃，預作善緣恐防斯咎。」",
        "translation": "It's difficult to escape the misfortune of later lives, and I'm afraid I'll prevent this blame by making good conditions in advance.",
        "source": "T37n1758_003:0344a04_17"
    },
    {
        "source_sentence": "問：「往生之人有中有身否？」",
        "translation": "Q: Does a person who goes to be born have an intermediate body?",
        "source": "T37n1758_003:0344a05_18"
    },
    {
        "source_sentence": "答：「《群疑論》中有二師義：一師云極善極惡無中有；",
        "translation": "Answer: In the Treatise on Accumulated Doubts, there are two kinds of doctrines. The first is that ultimately good and ultimately evil have no existence.",
        "source": "T37n1758_003:0344a06_19"
    },
    {
        "source_sentence": "二、不揀善惡，但有捨報受生者皆有中有，為傳識故，除現世變身即無中有。",
        "translation": "Second, it does not discriminate between good and evil. All those who give up retribution and are reborn have intermediate existence. For the sake of transmitting consciousness, except for the transformation body in the present life, which is without intermediate existence.",
        "source": "T37n1758_003:0344a07_20"
    },
    {
        "source_sentence": "淨土既是極善，中有定有，有者為正。」",
        "translation": "Since the Pure Land is extremely good, there's a definite presence in it, and that presence is correct.",
        "source": "T37n1758_003:0344a09_21"
    },
    {
        "source_sentence": "經曰：「舍利弗！",
        "translation": "The sūtra said, Śāriputra!",
        "source": "T37n1758_003:0344a11_0"
    },
    {
        "source_sentence": "我見是利故說此言，若有眾生聞是說者，應當發願生彼國土」。",
        "translation": "If there are sentient beings who hear this teaching, they should give rise to the vow to be born in that land.",
        "source": "T37n1758_003:0344a11_1"
    },
    {
        "source_sentence": "贊曰：第五結勸往生。",
        "translation": "He said, The fifth concludes by encouraging rebirth.",
        "source": "T37n1758_003:0344a12_2"
    },
    {
        "source_sentence": "我見是利者，我者世尊稱我也，見是利者見是殊常勝利益，故勸生彼國也。",
        "translation": "Those who see me as beneficial are called self because the Bhagavān calls me myself a self, and those who see me as beneficial are seen as extraordinarily superior benefits, so they're encouraged to be born in that country.",
        "source": "T37n1758_003:0344a13_3"
    },
    {
        "source_sentence": "經曰：「舍利弗！",
        "translation": "The sūtra said, Śāriputra!",
        "source": "T37n1758_003:0344a15_0"
    },
    {
        "source_sentence": "如我今者讚嘆阿彌陀佛不可思議功德」。",
        "translation": "Suppose I now praise the inconceivable merits of Amitâbha Buddha.",
        "source": "T37n1758_003:0344a15_1"
    },
    {
        "source_sentence": "贊曰：第三諸佛證明。",
        "translation": "They said, Third, the buddhas prove it.",
        "source": "T37n1758_003:0344a16_2"
    },
    {
        "source_sentence": "文分為三：初、陳自讚言；",
        "translation": "The text is divided into three parts:",
        "source": "T37n1758_003:0344a16_3"
    },
    {
        "source_sentence": "二、引他佛證；",
        "translation": "The second is to lead others to realize buddhahood.",
        "source": "T37n1758_003:0344a17_4"
    },
    {
        "source_sentence": "三、釋經名字。",
        "translation": "3. Explaining the names of the sūtras.",
        "source": "T37n1758_003:0344a17_5"
    },
    {
        "source_sentence": "此即初也。",
        "translation": "This is the first one.",
        "source": "T37n1758_003:0344a17_6"
    },
    {
        "source_sentence": "如我今者，自指也，彼佛功德不可以心思言議故也。",
        "translation": "As I now point out, that Buddha's virtue can't be discussed in words.",
        "source": "T37n1758_003:0344a18_7"
    },
    {
        "source_sentence": "經曰：「東方亦有阿閦鞞佛、須彌相佛、大須彌佛、須彌光佛、妙音佛」。",
        "translation": "The sūtra says, In the east, there's also Akṣobhya Buddha, Sumeru Buddha, Mahāsūrya Buddha, Sumeru Buddha, Sumeru Buddha of Light, and Sumeru Buddha of Wonderful Sound.",
        "source": "T37n1758_003:0344a20_0"
    },
    {
        "source_sentence": "贊曰：第二引他佛證。",
        "translation": "He said, Second, he cites the realization of other buddhas.",
        "source": "T37n1758_003:0344a21_1"
    },
    {
        "source_sentence": "《稱讚淨土經》云十方諸佛，此略舉六方，便為六段。",
        "translation": "The Praise of the Pure Land Sutra says, All the buddhas of the ten directions, which briefly lists the six directions and then makes them into six sections.",
        "source": "T37n1758_003:0344a21_2"
    },
    {
        "source_sentence": "且舉東方，每一方各有五段：一、指國土；",
        "translation": "To the east, there are five paragraphs in each direction:",
        "source": "T37n1758_003:0344a23_3"
    },
    {
        "source_sentence": "二、舉佛名；",
        "translation": "The second is to name the buddhas.",
        "source": "T37n1758_003:0344a23_4"
    },
    {
        "source_sentence": "三、辨多少；",
        "translation": "The third is the identification of quantity.",
        "source": "T37n1758_003:0344a24_5"
    },
    {
        "source_sentence": "四、明證相；",
        "translation": "The fourth is to explain the characteristics of enlightenment.",
        "source": "T37n1758_003:0344a24_6"
    },
    {
        "source_sentence": "五、引證言，今初兩段合一唱也。",
        "translation": "5. citing the proof, the first two sections now sing in unity.",
        "source": "T37n1758_003:0344a24_7"
    },
    {
        "source_sentence": "東方者指國土，亦有阿閦下舉佛名。",
        "translation": "The eastern refers to a land, which also has the name of the Buddha under Akṣobhya.",
        "source": "T37n1758_003:0344a25_8"
    },
    {
        "source_sentence": "先引東方者，西域以東為上，所以先舉。",
        "translation": "The first quote from the east is because the western regions take the east as the highest, so they're cited first.",
        "source": "T37n1758_003:0344a26_9"
    },
    {
        "source_sentence": "阿閦梵語，此云無動，不被煩惱四魔違順等動故。",
        "translation": "The abhidharma is the Sanskrit word for immovability, because it is free of the four defilements and the four maras that are opposed to it.",
        "source": "T37n1758_003:0344a27_10"
    },
    {
        "source_sentence": "須彌相者，謂金容尊狀若須彌。",
        "translation": "The mark of a mountain refers to the golden-faced, venerable shape of a mountain.",
        "source": "T37n1758_003:0344a28_11"
    },
    {
        "source_sentence": "大須彌者，謂諸相甚大如大山王。",
        "translation": "The great Sumeru means that the characteristics are as great as the great king of mountains.",
        "source": "T37n1758_003:0344a28_12"
    },
    {
        "source_sentence": "須彌光者，大如山王身光故。",
        "translation": "The light of Mount Sumeru is as great as the light of the body of a king of mountains.",
        "source": "T37n1758_003:0344a29_13"
    },
    {
        "source_sentence": "妙音者，其聲微妙清徹遠聞。",
        "translation": "A marvelous sound is a sound that's subtle and clear and heard far and wide.",
        "source": "T37n1758_003:0344b01_14"
    },
    {
        "source_sentence": "經曰：「如是等恒河沙數諸佛，各於其國，出廣長舌相，遍覆三千大千世界」。",
        "translation": "The sūtra says, Such are the buddhas as numerous as the sands of the Ganges River, each in their country producing a broad and long tongue that covers 3,000 great one-thousand worlds.",
        "source": "T37n1758_003:0344b02_0"
    },
    {
        "source_sentence": "贊曰：第三辨多少、四明證相。",
        "translation": "He said, The third identifies how much and the fourth clarifies the characteristics of realization.",
        "source": "T37n1758_003:0344b03_1"
    },
    {
        "source_sentence": "如是等恒河沙數諸佛，是辨多少。",
        "translation": "These are the number of buddhas as numerous as the grains of sand in the Ganges River.",
        "source": "T37n1758_003:0344b04_2"
    },
    {
        "source_sentence": "各於其國，辨明證相也。",
        "translation": "Each one in his own country, he identifies the characteristics of realization.",
        "source": "T37n1758_003:0344b05_3"
    },
    {
        "source_sentence": "如是等佛數比河沙而不具列，故言等也。",
        "translation": "Such buddhas are numerous as the number of rivers and sands but aren't listed in detail, so they're called equal.",
        "source": "T37n1758_003:0344b05_4"
    },
    {
        "source_sentence": "恒河數者，梵云殑伽，訛略云恒河，是河神之名，河從彼稱。",
        "translation": "The number of Ganges Rivers is the Sanskrit word for angga, which is incorrectly translated as the Ganges River. These are the names of the river gods and the rivers are named after them.",
        "source": "T37n1758_003:0344b06_5"
    },
    {
        "source_sentence": "殑音其[(美-(王\\/大)+弔)*令]反去聲也。",
        "translation": "It's also the sound of [(美-(王\\/大)+哀)*令]反去聲.",
        "source": "T37n1758_003:0344b07_6"
    },
    {
        "source_sentence": "經中說河沙為喻。",
        "translation": "The sūtras say that rivers and sands are metaphors.",
        "source": "T37n1758_003:0344b08_7"
    },
    {
        "source_sentence": "無熱惱池出四大河，此河即一也。",
        "translation": "The Anavatapta Lake supplies the four major rivers, which are one in number.",
        "source": "T37n1758_003:0344b08_8"
    },
    {
        "source_sentence": "由具五義：一、由沙多；",
        "translation": "It is endowed with five meanings:",
        "source": "T37n1758_003:0344b09_9"
    },
    {
        "source_sentence": "二、由世人共為福水，入洗罪滅、投死生天；",
        "translation": "The second is that because the worldly beings share the water of blessedness, they enter heaven to wash away sins and fall into death and rebirth.",
        "source": "T37n1758_003:0344b09_10"
    },
    {
        "source_sentence": "三、雖經劫壞名字常在；",
        "translation": "The third is that the names of those who pass through kalpas are always present, even in the midst of destruction.",
        "source": "T37n1758_003:0344b10_11"
    },
    {
        "source_sentence": "四、佛多近此宣說妙法；",
        "translation": "The fourth is that buddhas often come here to expound the sublime Teaching.",
        "source": "T37n1758_003:0344b11_12"
    },
    {
        "source_sentence": "五、眾人共委，故多為喻。",
        "translation": "5. Because many people share the same entrustment, they're often metaphors.",
        "source": "T37n1758_003:0344b11_13"
    },
    {
        "source_sentence": "仍取初出池口方四十里河以為喻，明證相。",
        "translation": "It's still a metaphor for the first river that emerges from the mouth of the pond, which is 40 miles in width at its mouth, and explains its realization.",
        "source": "T37n1758_003:0344b12_14"
    },
    {
        "source_sentence": "諸佛各於其國出廣長舌相者，即各在本國舒舌相也。",
        "translation": "The buddhas each produce a broad and long characteristic of tongue in their own country, which is the characteristic of each one spreading out their tongues in their own country.",
        "source": "T37n1758_003:0344b13_15"
    },
    {
        "source_sentence": "三千大千世界者，准《大論》云：千須彌山、千日月、千四天下，及千梵王是謂小千，",
        "translation": "As the Mahāprajñāpāramitā-sūtra explains, a thousand polar mountains, a thousand suns and moons, a thousand continents in four directions, and a thousand Brahmā kings are small chiliocosms.",
        "source": "T37n1758_003:0344b14_16"
    },
    {
        "source_sentence": "以小千為一數至千名大千，故名三千，非小中故為大千。",
        "translation": "A small chiliocosm is called a great chiliocosm because the small chiliocosm is counted as one to a thousand. That is why it is called the trichiliocosm; not the medium chiliocosm, but rather the great chiliocosm.",
        "source": "T37n1758_003:0344b16_17"
    },
    {
        "source_sentence": "《俱舍論》云：小千至初禪，中千至二禪，大千至三禪，俱同一成壞遍，",
        "translation": "The Kauśyapa-śāstra says: From the small chiliocosm up to the first trance, from the middle chiliocosm up to the second trance, and from the great chiliocosm up to the third trance, they all have the same pervasiveness of becoming and decay.",
        "source": "T37n1758_003:0344b17_18"
    },
    {
        "source_sentence": "此故云遍，故云遍覆三千大千世界也，表無量劫來口離四過感此舌相也。",
        "translation": "That's why it's called pervasive, and that's why it's called pervading the 3,000 great one-thousand worlds, which shows that for measureless eons past speech is free of the four faults that are caused by this characteristic of the tongue.",
        "source": "T37n1758_003:0344b19_19"
    },
    {
        "source_sentence": "證小事即覆面門以至髮際，今證大事故至三千。",
        "translation": "To realize the lesser matter, they cover their faces up to the limit, and now they've realized the greater matter up to 3,000.",
        "source": "T37n1758_003:0344b20_20"
    },
    {
        "source_sentence": "今說因微果勝，恐眾生疑，此乃拋苦惱之要門、證常樂之疾路，事既廣大，",
        "translation": "This is to cast down the essential approach of suffering and distress and realize the swift path of permanence and bliss.",
        "source": "T37n1758_003:0344b22_21"
    },
    {
        "source_sentence": "現瑞非輕，舒舌相而遍覆大千，證西方而真快樂。",
        "translation": "The manifestation of the auspicious sign is not light; it spreads its tongue to cover the great chiliocosm and realizes true bliss in the West.",
        "source": "T37n1758_003:0344b23_22"
    },
    {
        "source_sentence": "經曰：「說誠實言，汝等眾生當信是稱讚不可思議功德，一切諸佛所護念經」。",
        "translation": "The sūtra says, Tell me honestly, you sentient beings should believe this to praise the inconceivable merit of all the buddhas' protected recitation scriptures.",
        "source": "T37n1758_003:0344b25_0"
    },
    {
        "source_sentence": "贊曰：第五引證詞。",
        "translation": "He said, Fifth, he cites the words to prove it.",
        "source": "T37n1758_003:0344b26_1"
    },
    {
        "source_sentence": "經文易見。",
        "translation": "The text of the sūtras is easy to see.",
        "source": "T37n1758_003:0344b27_2"
    },
    {
        "source_sentence": "誠者實也。",
        "translation": "What's sincere is real.",
        "source": "T37n1758_003:0344b27_3"
    },
    {
        "source_sentence": "問：「汝等者！",
        "translation": "He asked, You!",
        "source": "T37n1758_003:0344b27_4"
    },
    {
        "source_sentence": "為是六方諸佛告語自國聽徒，為當釋迦勸試祇園之眾？」",
        "translation": "Is it because the buddhas of the six directions tell their own listeners in their own country and why should the Śākyamuni encourage the Jetavana crowd?",
        "source": "T37n1758_003:0344b27_5"
    },
    {
        "source_sentence": "答：「觀此經勢而有二意：一、他方諸佛告自國聽眾；",
        "translation": "Answer: Observing the momentum of this sūtra has two meanings:",
        "source": "T37n1758_003:0344b29_6"
    },
    {
        "source_sentence": "二、釋迦轉引彼佛意言證彼西方，令一會眾生信敬也。」",
        "translation": "Second, the Śākyamuni turns to cite the Buddha's teaching and says he's realized that the West causes sentient beings in one assembly to believe and venerate him.",
        "source": "T37n1758_003:0344c01_7"
    },
    {
        "source_sentence": "一切諸佛所護念經者，即是此經也，准此具足應名稱讚阿彌陀佛不可思議功德，",
        "translation": "The scripture that all the buddhas preserve is this scripture, which praises the inconceivable virtues of Amitâbha Buddha by means of his name.",
        "source": "T37n1758_003:0344c02_8"
    },
    {
        "source_sentence": "其文略也。",
        "translation": "The text is abbreviated.",
        "source": "T37n1758_003:0344c04_9"
    },
    {
        "source_sentence": "一切諸佛所護念經者，諸佛護持明記憶念也，即眾行雖廣難方念佛之功德福，",
        "translation": "The scriptures guarded by all the buddhas are preserved by the buddhas, and they are clearly remembered by the buddhas. These are the merits and virtues of recitation of the Buddha’s name even though it is difficult to know how many practices there are.",
        "source": "T37n1758_003:0344c04_10"
    },
    {
        "source_sentence": "然多爭並持經之力，故使六方諸佛以神力而護持。",
        "translation": "However, they often strive to maintain the power of the sūtras and therefore cause the buddhas in the six directions to protect them with their miraculous powers.",
        "source": "T37n1758_003:0344c06_11"
    },
    {
        "source_sentence": "沙界聖人乃一念而憶念，故云一切諸佛所護念經。",
        "translation": "The sages of the sand realm then remember it with a single thought, which is why it's called the Sutra of Protecting Mindfulness by All the Buddhas.",
        "source": "T37n1758_003:0344c07_12"
    },
    {
        "source_sentence": "問：「若釋迦談於淨土，可言佛所護念；",
        "translation": "Q: If the Śākyamuni talks about the Pure Land, can one say that it is guarded by the Buddha?",
        "source": "T37n1758_003:0344c08_13"
    },
    {
        "source_sentence": "諸佛不說此經，何說佛所護念？」",
        "translation": "If the buddhas don't teach this sūtra, how can they say that it's guarded by the buddhas?",
        "source": "T37n1758_003:0344c09_14"
    },
    {
        "source_sentence": "答：「王言是勅，佛語成經，既稱讚於淨方，此說便成經也。",
        "translation": "Answer: The king said, This is an order, and the Buddha's words make up a sūtra; after praising the pure land, this teaching makes it into a sūtra.",
        "source": "T37n1758_003:0344c10_15"
    },
    {
        "source_sentence": "或可佛所護念者即指釋迦所說阿彌陀經也。」",
        "translation": "Perhaps someone who's guarded by the Buddha refers to the Amitâbha sūtras taught by Śākyamuni.",
        "source": "T37n1758_003:0344c11_16"
    },
    {
        "source_sentence": "問：「靈山開塔要假召集分身，舍衛啟筵何故不邀諸佛？」",
        "translation": "Q: When Lingshan opened the stūpa, he asked, Why didn't Śāriputra invite the buddhas to his retreat?",
        "source": "T37n1758_003:0344c12_17"
    },
    {
        "source_sentence": "答：「召佛開其寶塔，赴彼佛之願心，證土啟相信誠，顯此尊之悲意，",
        "translation": "Answer: He summoned the Buddha to open his jeweled stūpa, went to that buddha’s wishes, testified to his faith in the land, and revealed this venerable monk’s compassion.",
        "source": "T37n1758_003:0344c13_18"
    },
    {
        "source_sentence": "但各居自國不至此方也。」",
        "translation": "Each of them simply stayed in their own country and didn't come here.",
        "source": "T37n1758_003:0344c15_19"
    },
    {
        "source_sentence": "經曰：「舍利弗！",
        "translation": "The sūtra said, Śāriputra!",
        "source": "T37n1758_003:0344c16_0"
    },
    {
        "source_sentence": "南方世界有日月燈佛、名聞光佛、大焰肩佛、須彌燈佛、無量精進佛」。",
        "translation": "In the southern world, there's the Buddha of the Lamp of the Sun and Moon, the Buddha of Name-Sound Light, the Buddha of Great Burning Shoulder, the Buddha of the Sumeru Lamp, and the Buddha of Immeasurable Energy.",
        "source": "T37n1758_003:0344c16_1"
    },
    {
        "source_sentence": "贊曰：第二南方也。",
        "translation": "He said, It's the second south.",
        "source": "T37n1758_003:0344c17_2"
    },
    {
        "source_sentence": "分五如前，此前二段也(一指國土、二舉佛名)，可知。",
        "translation": "The first two paragraphs are divided into five parts as before (one refers to the land and two give the Buddha's name), which can be understood.",
        "source": "T37n1758_003:0344c18_3"
    },
    {
        "source_sentence": "日月燈佛者，身光智光內外俱照故。",
        "translation": "Sun and Moon Lamp Buddha: Because both the light of the body and the light of wisdom illumine both inside and outside.",
        "source": "T37n1758_003:0344c19_0"
    },
    {
        "source_sentence": "名聞光者，有大名聞光照內外，或聞名見光生覺悟故。",
        "translation": "The name “light of hearing” means that there is a great name: the light of hearing illuminates both inside and outside. Sometimes, because when hearing names and seeing lights make enlightenment arise.",
        "source": "T37n1758_003:0344c19_1"
    },
    {
        "source_sentence": "大焰肩者，身光發焰出於肩故，或肩者齊也，即身光智光皆發焰齊也。",
        "translation": "The shoulder of the great flame is because the light of the body produces a flame that emanates from the shoulder, and sometimes the shoulder is horizontal, meaning that the light of the body and the light of wisdom all produce a flame horizontally.",
        "source": "T37n1758_003:0344c21_2"
    },
    {
        "source_sentence": "須彌燈者，身光如燈焰有破暗故。",
        "translation": "Sumeru's lamp means that the body's light is like a flame of a lamp because it destroys darkness.",
        "source": "T37n1758_003:0344c22_3"
    },
    {
        "source_sentence": "無量精進者，利樂有情也。",
        "translation": "Immeasurable effort is for the benefit and welfare of sentient beings.",
        "source": "T37n1758_003:0344c23_4"
    },
    {
        "source_sentence": "經曰：「如是等恒河沙數諸佛，各於其國，出廣長舌相，遍覆三千大千世界」。",
        "translation": "The sūtra says, Such are the buddhas as numerous as the sands of the Ganges River, each in their country producing a broad and long tongue that covers 3,000 great one-thousand worlds.",
        "source": "T37n1758_003:0344c24_0"
    },
    {
        "source_sentence": "贊曰：第三辨多少、第四明證相，行相如何。",
        "translation": "He said, What's the third discernment of how much and the fourth clarification of the realization aspect, and what's the practice aspect?",
        "source": "T37n1758_003:0344c25_1"
    },
    {
        "source_sentence": "經曰：「說誠實言，汝等眾生當信是稱讚不可思議功德，一切諸佛所護念經」。",
        "translation": "The sūtra says, Tell me honestly, you sentient beings should believe this to praise the inconceivable merit of all the buddhas' protected recitation scriptures.",
        "source": "T37n1758_003:0344c27_0"
    },
    {
        "source_sentence": "贊曰：第五引證詞，亦同前釋。",
        "translation": "He said, The fifth quote proves that the words are the same as the previous explanation.",
        "source": "T37n1758_003:0344c28_1"
    },
    {
        "source_sentence": "經曰：「舍利弗！",
        "translation": "The sūtra said, Śāriputra!",
        "source": "T37n1758_003:0345a01_0"
    },
    {
        "source_sentence": "西方世界有無量壽佛、無量相佛、無量幢佛、大光佛、大明佛、寶相佛、淨光佛」。",
        "translation": "In the western world, there's the Buddha of Immeasurable Life, the Buddha of Immeasurable Form, the Buddha of Immeasurable Banner, the Buddha of Great Light, the Buddha of Great Illumination, the Buddha of Jeweled Form, and the Buddha of Pure Light.",
        "source": "T37n1758_003:0345a01_1"
    },
    {
        "source_sentence": "贊曰：第三西方，同前五段，此二文也。",
        "translation": "He said, The third is the same as the previous five paragraphs in the West, these two texts.",
        "source": "T37n1758_003:0345a02_2"
    },
    {
        "source_sentence": "無量壽者，即西方本尊，依二義得名，如前已解。",
        "translation": "Immeasurable life refers to the original honored one in the West, who gets his name based on two meanings as explained above.",
        "source": "T37n1758_003:0345a03_3"
    },
    {
        "source_sentence": "問：「儒宗尚無自伐其善，何故彌陀自讚難思？」",
        "translation": "Q: Confucianism doesn't yet disparage its own goodness, so why does Maitreya praise himself for being inconceivable?",
        "source": "T37n1758_003:0345a04_4"
    },
    {
        "source_sentence": "答：「據其文勢即是諸佛稱讚。",
        "translation": "Answer: According to its textual momentum, it's praised by the buddhas.",
        "source": "T37n1758_003:0345a05_5"
    },
    {
        "source_sentence": "又設若彌陀自讚，於理何違，引轉眾生令生勝意。」",
        "translation": "Furthermore, if Maitreya praises himself, what's wrong with the principle that leads sentient beings to give rise to superior thoughts?",
        "source": "T37n1758_003:0345a06_6"
    },
    {
        "source_sentence": "無量相者，相好無量故。",
        "translation": "“Innumerable marks”: Because the characteristic marks are immeasurable.",
        "source": "T37n1758_003:0345a07_7"
    },
    {
        "source_sentence": "無量幢者，身量功德高而復峻由如幢也。",
        "translation": "The immeasurable banner means that the body is so great in size and virtue that it's even more lofty because it's like a banner.",
        "source": "T37n1758_003:0345a08_8"
    },
    {
        "source_sentence": "大光者，身智二光無不照故。",
        "translation": "Great light means that there are no two kinds of light from body and wisdom that don't illuminate.",
        "source": "T37n1758_003:0345a09_9"
    },
    {
        "source_sentence": "大明者，得佛三明無不知故，即正遍知也。",
        "translation": "Great clarity means that someone who attains the Buddha's three kinds of clarity and doesn't know them, which is correct pervasive knowing.",
        "source": "T37n1758_003:0345a09_10"
    },
    {
        "source_sentence": "寶相者，內外二相皆可寶重故。",
        "translation": "The characteristic of treasure is that the two characteristics inside and outside are all desirable because they're both valuable.",
        "source": "T37n1758_003:0345a10_11"
    },
    {
        "source_sentence": "淨光者，淨者無漏。",
        "translation": "Pure light means pure, and pure is uncontaminated.",
        "source": "T37n1758_003:0345a11_12"
    },
    {
        "source_sentence": "光者身智二光，故言淨光也。",
        "translation": "Light refers to the two kinds of light of body and wisdom, so it's called pure light.",
        "source": "T37n1758_003:0345a11_13"
    },
    {
        "source_sentence": "經曰：「如是等恒河沙數諸佛，各於其國，出廣長舌相，遍覆三千大千世界。」",
        "translation": "The sūtra says, Such are the buddhas as numerous as the sands of the Ganges River, each in their country producing a broad and long tongue that covers 3,000 great one-thousand worlds.",
        "source": "T37n1758_003:0345a13_0"
    },
    {
        "source_sentence": "贊曰：第三、第四文也。",
        "translation": "They said, 'The third and fourth texts are the same.'",
        "source": "T37n1758_003:0345a14_1"
    },
    {
        "source_sentence": "如上說也。",
        "translation": "It's as explained above.",
        "source": "T37n1758_003:0345a15_2"
    },
    {
        "source_sentence": "經曰：「說誠實言，汝等眾生當信是稱讚不可思議功德，一切諸佛所護念經。」",
        "translation": "The sūtra says, Tell me honestly, you sentient beings should believe this to praise the inconceivable merit of all the buddhas' protected recitation scriptures.",
        "source": "T37n1758_003:0345a16_0"
    },
    {
        "source_sentence": "贊曰：第五文也，引證詞可知。",
        "translation": "He said, The fifth text also cites the words to prove it, which can be understood.",
        "source": "T37n1758_003:0345a17_1"
    },
    {
        "source_sentence": "經曰：「舍利弗！",
        "translation": "The sūtra said, Śāriputra!",
        "source": "T37n1758_003:0345a19_0"
    },
    {
        "source_sentence": "北方世界有焰肩佛、最勝音佛、難阻佛、日生佛、網明佛」。",
        "translation": "In the northern world, there's the Burning Shoulder Buddha, the Supreme Sound Buddha, the Unobstructed Buddha, the Sun-made Buddha, and the Net of Illumination Buddha.",
        "source": "T37n1758_003:0345a19_1"
    },
    {
        "source_sentence": "贊曰：第四北方證也，文五同前。",
        "translation": "He said, The fourth northern realization is the same as the previous one in five ways.",
        "source": "T37n1758_003:0345a20_2"
    },
    {
        "source_sentence": "焰肩佛義同於前。",
        "translation": "The meaning of the Yamântaka Buddha is the same as the previous one.",
        "source": "T37n1758_003:0345a21_3"
    },
    {
        "source_sentence": "最勝音，音聲美妙勝過餘故。",
        "translation": "The most superior sound is because the sound is beautiful and superior to the others.",
        "source": "T37n1758_003:0345a21_4"
    },
    {
        "source_sentence": "難阻佛者，諸魔不能阻礙故。",
        "translation": "It's difficult to obstruct the Buddha because Māra can't obstruct him.",
        "source": "T37n1758_003:0345a22_5"
    },
    {
        "source_sentence": "日生者，依智慧日流聲教故，或依智慧日令眾生生諸善法故。",
        "translation": "Sun-generating refers to the teaching that it's based on the sound of the sun and wisdom, or it may rely on the day of wisdom to cause sentient beings to give rise to good qualities.",
        "source": "T37n1758_003:0345a22_6"
    },
    {
        "source_sentence": "網明者，施此教網令眾生生於明解故。",
        "translation": "A net of insight is to give this teaching a net that causes sentient beings to give rise to insight and understanding.",
        "source": "T37n1758_003:0345a24_7"
    },
    {
        "source_sentence": "經曰：「如是等恒河沙數諸佛，各於其國，出廣長舌相，遍覆三千大千世界」。",
        "translation": "The sūtra says, Such are the buddhas as numerous as the sands of the Ganges River, each in their country producing a broad and long tongue that covers 3,000 great one-thousand worlds.",
        "source": "T37n1758_003:0345a26_0"
    },
    {
        "source_sentence": "贊曰：第三、第四文，如前可知。",
        "translation": "They said, The third and fourth texts are as explained above.",
        "source": "T37n1758_003:0345a27_1"
    },
    {
        "source_sentence": "經曰：「說誠實言，汝等眾生當信是稱讚不可思議功德，一切諸佛所護念經」。",
        "translation": "The sūtra says, Tell me honestly, you sentient beings should believe this to praise the inconceivable merit of all the buddhas' protected recitation scriptures.",
        "source": "T37n1758_003:0345a29_0"
    },
    {
        "source_sentence": "贊曰：第五段文，意可知也。",
        "translation": "They said, The meaning of the fifth paragraph is clear.",
        "source": "T37n1758_003:0345b01_1"
    },
    {
        "source_sentence": "經曰：「舍利弗！",
        "translation": "The sūtra said, Śāriputra!",
        "source": "T37n1758_003:0345b03_0"
    },
    {
        "source_sentence": "下方世界有師子佛、名聞佛、名光佛、達磨佛、法幢佛、持法佛」。",
        "translation": "In the world below, there are lion buddhas, name-hearing buddhas, name-lumining buddhas, Dharma buddhas, Dharma banner buddhas, and Dharma-holding buddhas.",
        "source": "T37n1758_003:0345b03_1"
    },
    {
        "source_sentence": "贊曰：第五下方證也。",
        "translation": "He said, The fifth is the realization below.",
        "source": "T37n1758_003:0345b04_2"
    },
    {
        "source_sentence": "文五同前，此二文也。",
        "translation": "The text and five are the same as the previous one, these two texts.",
        "source": "T37n1758_003:0345b05_3"
    },
    {
        "source_sentence": "師子佛者，如於師子獸中自在，佛於法中自在故得此名。",
        "translation": "The lion buddha is like being free in a lion's beast, which gets its name because the Buddha is free in the Dharma.",
        "source": "T37n1758_003:0345b05_4"
    },
    {
        "source_sentence": "又世師子伏諸猛獸，佛即伏四魔也。",
        "translation": "Also, the lion of the world subdues fierce animals, and the Buddha subdues the four Māras.",
        "source": "T37n1758_003:0345b06_5"
    },
    {
        "source_sentence": "名聞者，名振十方故。",
        "translation": "A name is heard because names revitalize the ten directions.",
        "source": "T37n1758_003:0345b07_6"
    },
    {
        "source_sentence": "名光者，聞名見光生覺悟故。",
        "translation": "It's called light because hearing names and seeing light gives rise to awakening.",
        "source": "T37n1758_003:0345b08_7"
    },
    {
        "source_sentence": "達磨者梵語，此云法也，以法為身，即有為無為諸法所依止故。",
        "translation": "Dharma is the Sanskrit word for dharma, which means dharma because it takes dharma as its body, which is the basis of conditioned and unconditioned dharmas.",
        "source": "T37n1758_003:0345b08_8"
    },
    {
        "source_sentence": "法幢佛者，廣開大法，高峻如幢故也。",
        "translation": "Dharma banner buddha is a buddha who extensively expounds the great teaching, as tall and lofty as a banner.",
        "source": "T37n1758_003:0345b10_9"
    },
    {
        "source_sentence": "持法佛者，持過去佛法付未來故。",
        "translation": "A Dharma-holding buddha is a buddha who maintains the past Buddha's teaching and transmits it to the future.",
        "source": "T37n1758_003:0345b11_10"
    },
    {
        "source_sentence": "經曰：「如是等恒河沙數諸佛，各於其國，出廣長舌相，遍覆三千大千世界」。",
        "translation": "The sūtra says, Such are the buddhas as numerous as the sands of the Ganges River, each in their country producing a broad and long tongue that covers 3,000 great one-thousand worlds.",
        "source": "T37n1758_003:0345b12_0"
    },
    {
        "source_sentence": "贊曰：第三、第四，文相可知。",
        "translation": "They said, The third and fourth are well-known in text and characteristics.",
        "source": "T37n1758_003:0345b13_1"
    },
    {
        "source_sentence": "經曰：「說誠實言，汝等眾生當信是稱讚不可思議功德，一切諸佛所護念經」。",
        "translation": "The sūtra says, Tell me honestly, you sentient beings should believe this to praise the inconceivable merit of all the buddhas' protected recitation scriptures.",
        "source": "T37n1758_003:0345b15_0"
    },
    {
        "source_sentence": "贊曰：第五文也，行相同前。",
        "translation": "They said, The fifth text is the same as the previous one in terms of practice.",
        "source": "T37n1758_003:0345b16_1"
    },
    {
        "source_sentence": "經曰：「舍利弗！",
        "translation": "The sūtra said, Śāriputra!",
        "source": "T37n1758_003:0345b18_0"
    },
    {
        "source_sentence": "上方世界有梵音佛、宿王佛、香上佛、香光佛、大焰肩佛、雜色寶華嚴身佛、娑羅樹王佛、寶華德佛、見一切義佛、如須彌山佛」。",
        "translation": "In the above world, there's Brahma Sound Buddha, Constellation King Buddha, Fragrant Abode Buddha, Fragrant Light Buddha, Great Burning Shoulder Buddha, Adorned Body of Miscellaneous Colored Jewel Flowers Buddha, Sāra Tree King Buddha, Jewel Flower Virtue Buddha, Seeing All Meaning Buddha, and Like Mount Sumeru Buddha.",
        "source": "T37n1758_003:0345b18_1"
    },
    {
        "source_sentence": "贊曰：第六上方佛。",
        "translation": "He said, The sixth is the Buddha above us.",
        "source": "T37n1758_003:0345b20_2"
    },
    {
        "source_sentence": "文五同前，此初二文也。",
        "translation": "The text and five are the same as the previous one, which are the first two texts.",
        "source": "T37n1758_003:0345b21_3"
    },
    {
        "source_sentence": "梵音者，聲相美妙聞者悅心故。",
        "translation": "The Sanskrit sound is because the sounds and characteristics are beautiful and wonderful, and those who hear it delight in their minds.",
        "source": "T37n1758_003:0345b21_4"
    },
    {
        "source_sentence": "宿王佛者，宿者星也，月是星中之王；",
        "translation": "“Constellation king buddha” is a star. The moon is the king among the stars.",
        "source": "T37n1758_003:0345b22_5"
    },
    {
        "source_sentence": "佛者，是十地菩薩二乘凡夫之王也，得自在故。",
        "translation": "A buddha is the king of worldlings in the ten stages who are bodhisattvas and two-vehicle mortals, because they attain mastery.",
        "source": "T37n1758_003:0345b23_6"
    },
    {
        "source_sentence": "香上佛者，戒德馨香更無過上故。",
        "translation": "The Buddha of superior fragrance is because the fragrance of morality and virtue are no greater than the above.",
        "source": "T37n1758_003:0345b24_7"
    },
    {
        "source_sentence": "香光佛者，馨香自遠，光彩教門故。",
        "translation": "The Buddha of fragrance and light means that the fragrance is inherently distant, because it's the luminous and colorful aspect of the teaching.",
        "source": "T37n1758_003:0345b25_8"
    },
    {
        "source_sentence": "大焰肩佛者，身肩發焰故。",
        "translation": "The great flame-shoulder buddha is because his body and shoulders give rise to a flame.",
        "source": "T37n1758_003:0345b26_0"
    },
    {
        "source_sentence": "雜色寶華嚴身佛者，心華發明自嚴飾故，或可雜色眾寶以嚴其身，飾形可以美价故。",
        "translation": "A buddha whose body is adorned with flowers of mixed colors and jewels because the mind-flower arouses self-adornment, or it can be adorned with a body made of mixed colors and jewels because its shape can be beautifully priced.",
        "source": "T37n1758_003:0345b26_1"
    },
    {
        "source_sentence": "娑羅樹王佛者，如大樹王能覆癊故，佛能覆癊諸眾生故。",
        "translation": "The sāla-king buddha is like the great king of trees, because he can cover and oppress sentient beings, and the buddha can cover and oppress sentient beings.",
        "source": "T37n1758_003:0345b28_2"
    },
    {
        "source_sentence": "寶華德佛者，身智功德如寶可重故。",
        "translation": "Jeweled Flower Virtue Buddha is the buddha whose body, wisdom, and merit are like treasure because they can be valued.",
        "source": "T37n1758_003:0345b29_3"
    },
    {
        "source_sentence": "見一切義佛者，義者境也，佛具五眼見一切境故。",
        "translation": "Seeing all buddhas of meaning means that meaning is object because the Buddha has five eyes that see all objects.",
        "source": "T37n1758_003:0345c01_4"
    },
    {
        "source_sentence": "如須彌山佛者，福智如山巍巍高峻故。",
        "translation": "It's like Sumeru the Buddha of Mount Sumeru because his virtue and wisdom are as lofty and lofty as a mountain.",
        "source": "T37n1758_003:0345c02_5"
    },
    {
        "source_sentence": "經曰：「如是等恒河沙數諸佛，各於其國，出廣長舌相，遍覆三千大千世界」。",
        "translation": "The sūtra says, Such are the buddhas as numerous as the sands of the Ganges River, each in their country producing a broad and long tongue that covers 3,000 great one-thousand worlds.",
        "source": "T37n1758_003:0345c04_0"
    },
    {
        "source_sentence": "贊曰：第三、第四，文可知也。",
        "translation": "They said, The third and fourth are well-known in text.",
        "source": "T37n1758_003:0345c05_1"
    },
    {
        "source_sentence": "經云：「說誠實言，汝等眾生當信是稱讚不可思議功德，一切諸佛所護念經」。",
        "translation": "The sūtra says, Tell me honestly, you sentient beings should believe this to praise the inconceivable merit of all the buddhas' protected recitation scriptures.",
        "source": "T37n1758_003:0345c07_0"
    },
    {
        "source_sentence": "贊曰：第五文也，同前可知。",
        "translation": "They said, The fifth text is the same as the previous one, which can be understood.",
        "source": "T37n1758_003:0345c08_1"
    },
    {
        "source_sentence": "經云：「舍利弗！",
        "translation": "The sūtra says, Śāriputra!",
        "source": "T37n1758_003:0345c10_0"
    },
    {
        "source_sentence": "於汝意云何，何故名為一切諸佛所護念經」。",
        "translation": "What do you think, why is it called the Sutra on the Protection of All Buddhas?",
        "source": "T37n1758_003:0345c10_1"
    },
    {
        "source_sentence": "贊曰：第三釋經名字。",
        "translation": "He said, Third, he explains the names of the sūtras.",
        "source": "T37n1758_003:0345c11_2"
    },
    {
        "source_sentence": "文分為三：初徵問、次通釋、後結勸。",
        "translation": "The text is divided into three parts: the first asks a question, the second explains it in detail, and the second concludes with an exhortation.",
        "source": "T37n1758_003:0345c11_3"
    },
    {
        "source_sentence": "此初也。",
        "translation": "This is the first one.",
        "source": "T37n1758_003:0345c12_4"
    },
    {
        "source_sentence": "世尊云：「汝，舍利弗！",
        "translation": "The Bhagavān said, You, Śāriputra!",
        "source": "T37n1758_003:0345c12_5"
    },
    {
        "source_sentence": "還知此經如何得名一切諸佛所護念經否？」",
        "translation": "Do you still know how this sūtra can be called a scripture protected by all the buddhas?",
        "source": "T37n1758_003:0345c13_6"
    },
    {
        "source_sentence": "經曰：「舍利弗！",
        "translation": "The sūtra said, Śāriputra!",
        "source": "T37n1758_003:0345c15_0"
    },
    {
        "source_sentence": "若有善男子、善女人聞是諸佛所說名及經名者，是諸善男子、善女人皆為一切諸佛共所護念，",
        "translation": "If there are any sons and daughters of a virtuous family who hear the names taught by these buddhas and the names of their scriptures, they will be protected by all the buddhas together.",
        "source": "T37n1758_003:0345c15_1"
    },
    {
        "source_sentence": "皆得不退轉於阿耨多羅三藐三菩提」。",
        "translation": "They all attain and don't regress from unsurpassed, correct, and complete enlightenment.",
        "source": "T37n1758_003:0345c17_2"
    },
    {
        "source_sentence": "贊曰：此是第二通釋也。",
        "translation": "He said, This is the second general explanation.",
        "source": "T37n1758_003:0345c18_3"
    },
    {
        "source_sentence": "善男子、善女人等，是所護人也。",
        "translation": "Good men, good women, and so forth are the people they protect.",
        "source": "T37n1758_003:0345c18_4"
    },
    {
        "source_sentence": "聞是阿彌陀佛及聞六方恒沙佛名者，能護念人也。",
        "translation": "Those who hear the name of this Amitâbha Buddha and those who hear the names of the buddhas of the six directions in the Ganges can protect them.",
        "source": "T37n1758_003:0345c19_5"
    },
    {
        "source_sentence": "是諸善男子、善女人皆為一切諸佛所護念者，得正護念也。",
        "translation": "Good men and good women who are guarded by all the buddhas will attain right protection.",
        "source": "T37n1758_003:0345c20_6"
    },
    {
        "source_sentence": "即受持經及佛名男子、女兒，因聞諸佛及釋迦佛說修淨土經，方始得生淨土，",
        "translation": "“Then the enlightening beings who had heard the names of the Buddhas and the buddha-names, as well as the names of their disciples and disciples, were born in the Pure Land.",
        "source": "T37n1758_003:0345c22_0"
    },
    {
        "source_sentence": "即此經是諸佛所匡護明記憶念故。",
        "translation": "This is because this sūtra is protected by the buddhas and clearly remembers it.",
        "source": "T37n1758_003:0345c23_1"
    },
    {
        "source_sentence": "阿耨多羅三藐三菩提者，阿之言無，耨多羅云上，三云正，藐云等，三云正，",
        "translation": "Anuttarasamyak-saṃkṣobhya is the absence of abhidharma. The anuttarasamyak-saṃkṣobhya says:",
        "source": "T37n1758_003:0345c24_2"
    },
    {
        "source_sentence": "菩提云覺，即是無上正等正覺。",
        "translation": "Enlightenment is called awakening, which is the unsurpassed perfect enlightenment.",
        "source": "T37n1758_003:0345c26_3"
    },
    {
        "source_sentence": "問：「為但念阿彌陀佛即得不退，為更有餘方便？」",
        "translation": "Q: Is it because they simply think of Amitâbha Buddha and immediately attain nonretrogression, or is there any other method?",
        "source": "T37n1758_003:0345c26_4"
    },
    {
        "source_sentence": "答：「非但稱念禮敬，又應至心於諸佛前懺悔、勸請、隨喜、迴向、發願，",
        "translation": "Answer: Not only should they praise and venerate them, but they should also wholeheartedly repent, exhort, rejoice, dedicate, and make a vow before the buddhas.",
        "source": "T37n1758_003:0345c28_0"
    },
    {
        "source_sentence": "由懺悔故轉諸定業，如如意珠隨願即得不退轉。",
        "translation": "It's because of repentance that he turns his concentration actions, like the wish-granting pearl that follows his vow and attains nonretrogression.",
        "source": "T37n1758_003:0345c29_1"
    },
    {
        "source_sentence": "為由諸佛護念故，於無上正等覺心得不退也。」",
        "translation": "It's because the buddhas protect their thoughts that they don't regress in their minds from the unsurpassed perfect enlightenment.",
        "source": "T37n1758_003:0346a01_2"
    },
    {
        "source_sentence": "經云：「是故，舍利弗！",
        "translation": "The sūtra says, Therefore, Śāriputra!",
        "source": "T37n1758_003:0346a03_0"
    },
    {
        "source_sentence": "汝等皆當信受我語，及諸佛所說」。",
        "translation": "You must all believe what I say and what the buddhas teach.",
        "source": "T37n1758_003:0346a03_1"
    },
    {
        "source_sentence": "贊曰：此第三結勸也。",
        "translation": "He said, This is the third conclusion of the exhortation.",
        "source": "T37n1758_003:0346a04_2"
    },
    {
        "source_sentence": "是故者，結上之詞。",
        "translation": "That's why it's the words that conclude the above.",
        "source": "T37n1758_003:0346a04_3"
    },
    {
        "source_sentence": "皆當等者，勸勵之語。",
        "translation": "They should all be equal, which is the words of encouragement.",
        "source": "T37n1758_003:0346a05_4"
    },
    {
        "source_sentence": "汝等信我上來所說及六方諸佛之言。",
        "translation": "You must believe what I've taught above and the words of the buddhas of the six directions.",
        "source": "T37n1758_003:0346a05_5"
    },
    {
        "source_sentence": "經云：「舍利弗！",
        "translation": "The sūtra says, Śāriputra!",
        "source": "T37n1758_003:0346a07_0"
    },
    {
        "source_sentence": "若有人已發願、今發願、當發願欲生阿彌陀佛國者」。",
        "translation": "Suppose there's someone who has made a vow, now makes a vow, or will make a vow to be born in the land of Amitâbha.",
        "source": "T37n1758_003:0346a07_1"
    },
    {
        "source_sentence": "贊曰：自下第四三生發願。",
        "translation": "He said, From the fourth and third births below this, he gives rise to the vow.",
        "source": "T37n1758_003:0346a08_2"
    },
    {
        "source_sentence": "文分為四：第一、發心往生；",
        "translation": "The text is divided into four parts:",
        "source": "T37n1758_003:0346a09_3"
    },
    {
        "source_sentence": "第二、彰其勝益；",
        "translation": "The second is to show their superior benefits.",
        "source": "T37n1758_003:0346a09_4"
    },
    {
        "source_sentence": "第三、位居三世；",
        "translation": "The third is that they abide in the states of the three time periods.",
        "source": "T37n1758_003:0346a10_0"
    },
    {
        "source_sentence": "第四、勸生彼國。",
        "translation": "Fourth, they're encouraged to be born in another country.",
        "source": "T37n1758_003:0346a10_1"
    },
    {
        "source_sentence": "此即初也。",
        "translation": "This is the first one.",
        "source": "T37n1758_003:0346a10_2"
    },
    {
        "source_sentence": "已發願者過去，今發願者現在，當發願者是未來。",
        "translation": "Those who have already made a vow are past, those who make a vow now are present, and those who will make a vow in the future are future.",
        "source": "T37n1758_003:0346a10_3"
    },
    {
        "source_sentence": "欲者希望也。",
        "translation": "Desire is hope.",
        "source": "T37n1758_003:0346a12_4"
    },
    {
        "source_sentence": "生者即五蘊假者也。",
        "translation": "'birth' is the five aggregates that are provisional.",
        "source": "T37n1758_003:0346a12_5"
    },
    {
        "source_sentence": "經云：「是諸人等，皆得不退轉於阿耨多羅三藐三菩提」。",
        "translation": "The sūtra says, These people will all attain unsurpassed, correct, and complete enlightenment without regressing.",
        "source": "T37n1758_003:0346a13_0"
    },
    {
        "source_sentence": "贊曰：第二彰其勝益。",
        "translation": "He said, The second is to show their superior benefits.",
        "source": "T37n1758_003:0346a14_1"
    },
    {
        "source_sentence": "念佛發願故，一即彼佛冥加，二即此佛潛衛，遂令求道之心不退、願生之志不轉，",
        "translation": "Because mindfulness of Buddha gives rise to a vow, one is the mysterious empowerment of that Buddha, and two are the latent protective powers of this Buddha, thereby enabling those who seek the path not to retreat and those who wish to be born not to change their resolve.",
        "source": "T37n1758_003:0346a14_2"
    },
    {
        "source_sentence": "故言不退轉。",
        "translation": "That's why it's called nonretrogression.",
        "source": "T37n1758_003:0346a16_3"
    },
    {
        "source_sentence": "若已發願已得不退，今發願者即現在今得不退，當發願者當得不退轉也。",
        "translation": "If someone has already made a vow and has attained nonretrogression, the person who makes the present vow will attain nonretrogression in the present, and someone who will make the present vow will attain nonretrogression.",
        "source": "T37n1758_003:0346a16_4"
    },
    {
        "source_sentence": "經曰：「於彼國土，若已生、若今生、若當生」。",
        "translation": "The sūtra says, In that land, whether it's already born, now born, or in the future to be born.",
        "source": "T37n1758_003:0346a19_0"
    },
    {
        "source_sentence": "贊曰：第三位居三世。",
        "translation": "He said, The third rank resides in the three times.",
        "source": "T37n1758_003:0346a19_1"
    },
    {
        "source_sentence": "已發願者，為過去發願者已生。",
        "translation": "Those who have already made a vow are those who made a vow in the past that have already arisen.",
        "source": "T37n1758_003:0346a20_2"
    },
    {
        "source_sentence": "今發願者，為現在者即生。",
        "translation": "Those who give rise to the present vow will be born in the present.",
        "source": "T37n1758_003:0346a21_3"
    },
    {
        "source_sentence": "未來發願者，為未來未來發願當生。",
        "translation": "Those who give rise to the vow in the future will give rise to the vow in the future.",
        "source": "T37n1758_003:0346a21_4"
    },
    {
        "source_sentence": "經曰：「是故，舍利弗！",
        "translation": "The sūtra said, Therefore, Śāriputra!",
        "source": "T37n1758_003:0346a23_0"
    },
    {
        "source_sentence": "諸善男子、善女人若有信者，應當發願生彼國土」。",
        "translation": "Good men and good women who have faith should give rise to the vow to be born in that land.",
        "source": "T37n1758_003:0346a23_1"
    },
    {
        "source_sentence": "贊曰：第四勸生彼國。",
        "translation": "He said, The fourth exhorts to be born in another country.",
        "source": "T37n1758_003:0346a24_2"
    },
    {
        "source_sentence": "若有信心深重、煩惱輕微，知大覺以誠言，獲良願而當往也。",
        "translation": "If someone has faith that the afflictions are deep and serious and the afflictions are light, they'll know that the great enlightened one will go there with sincere words to obtain good vows.",
        "source": "T37n1758_003:0346a25_0"
    },
    {
        "source_sentence": "經曰：「舍利弗！",
        "translation": "The sūtra said, Śāriputra!",
        "source": "T37n1758_003:0346a27_0"
    },
    {
        "source_sentence": "如我今者稱讚諸佛不可思議功德，彼諸佛等亦稱說我不可思議功德」。",
        "translation": "Just as I now praise the inconceivable merits of the buddhas, those buddhas and so forth also praise my inconceivable merits.",
        "source": "T37n1758_003:0346a27_1"
    },
    {
        "source_sentence": "贊曰：第五彼尊讚歎咸曰希奇。",
        "translation": "They said, Fifth, the venerable one praised them all as rare.",
        "source": "T37n1758_003:0346a28_2"
    },
    {
        "source_sentence": "文有四段：初、讚功德難思；",
        "translation": "The text consists of four paragraphs:",
        "source": "T37n1758_003:0346a29_3"
    },
    {
        "source_sentence": "二、歎化行濁世；",
        "translation": "The second is to praise the world for the turbidity of its practice of edification.",
        "source": "T37n1758_003:0346b01_4"
    },
    {
        "source_sentence": "三、嗟訝成佛；",
        "translation": "The third is to exclaim the attainment of buddhahood.",
        "source": "T37n1758_003:0346b01_5"
    },
    {
        "source_sentence": "四、說法幽玄。",
        "translation": "4. the profound teaching of the Dharma.",
        "source": "T37n1758_003:0346b01_6"
    },
    {
        "source_sentence": "此文是初。",
        "translation": "This text is the first.",
        "source": "T37n1758_003:0346b02_7"
    },
    {
        "source_sentence": "我讚六方諸佛能為眾生作真實語，眾生因此心無疑惑。",
        "translation": "I praise the buddhas of the six directions who can speak truth for sentient beings, and because of this, sentient beings have no doubt in their minds.",
        "source": "T37n1758_003:0346b02_8"
    },
    {
        "source_sentence": "又彌陀如來慈悲接引，我等偏讚彼佛，彼佛復讚於我。",
        "translation": "Also, Amitâbha Tathāgata's compassionate approach leads us to praise those buddhas, and we partially praise them, and they praise me again.",
        "source": "T37n1758_003:0346b03_9"
    },
    {
        "source_sentence": "經曰：「而作是言，釋迦牟尼佛能為甚難希有之事，能於娑婆國土五濁惡世，",
        "translation": "Śākyamuni Buddha is able to accomplish such rare and difficult things that will cause the five turbid and evil destinies of the world in the land of Sāvatthī.",
        "source": "T37n1758_003:0346b05_0"
    },
    {
        "source_sentence": "劫濁、見濁、煩惱濁、眾生濁、命濁中」。",
        "translation": "The eon is turbid, views are turbid, afflictions are turbid, sentient beings are turbid, and life is turbid.",
        "source": "T37n1758_003:0346b06_1"
    },
    {
        "source_sentence": "贊曰：第二歎化行濁世。",
        "translation": "He said, Second, he praises the turbidity of the world's practice of transformation.",
        "source": "T37n1758_003:0346b07_2"
    },
    {
        "source_sentence": "而作是言，結集家敘也。",
        "translation": "He said this, which is a summary of the collection's family narratives.",
        "source": "T37n1758_003:0346b07_3"
    },
    {
        "source_sentence": "釋迦，梵語，此云能仁，牟尼，此云寂默。",
        "translation": "Śākyamuni, the Sanskrit word for being able to be benevolent, and Muni, which is silent.",
        "source": "T37n1758_003:0346b08_4"
    },
    {
        "source_sentence": "得姓之緣如別處說。",
        "translation": "The conditions for attaining surnames are as explained elsewhere.",
        "source": "T37n1758_003:0346b09_5"
    },
    {
        "source_sentence": "言甚難希有之事者，即是忍苦教化眾生之事也。",
        "translation": "The expression extremely difficult and rare refers to the task of tolerating suffering and teaching sentient beings.",
        "source": "T37n1758_003:0346b09_6"
    },
    {
        "source_sentence": "能於娑婆國土者，梵云娑婆，此云堪忍，堪可忍受苦惱之事故也。",
        "translation": "The Sanskrit word for being able to tolerate in the land of sahāsā is sahāsā, which means to be able to endure suffering and distress.",
        "source": "T37n1758_003:0346b10_7"
    },
    {
        "source_sentence": "五濁惡世者，略以五門：一、釋名；",
        "translation": "The five turbid and evil worlds are briefly described in five ways:",
        "source": "T37n1758_003:0346b12_8"
    },
    {
        "source_sentence": "二、出體；",
        "translation": "The second is that which produces the essence.",
        "source": "T37n1758_003:0346b13_9"
    },
    {
        "source_sentence": "三、對治；",
        "translation": "The third is the antidote.",
        "source": "T37n1758_003:0346b13_10"
    },
    {
        "source_sentence": "四、癈立；",
        "translation": "The fourth is the establishment of disputes.",
        "source": "T37n1758_003:0346b13_11"
    },
    {
        "source_sentence": "五、相攝。",
        "translation": "5. included in characteristics...",
        "source": "T37n1758_003:0346b13_12"
    },
    {
        "source_sentence": "初、釋名者，濁是滓穢義，如食滓穢下惡可污，名之為濁。",
        "translation": "First, the explanation of the name means that turbidity is the meaning of defilement, like eating dirty and bad things that can be defiled by being defiled, which is called turbidity.",
        "source": "T37n1758_003:0346b13_13"
    },
    {
        "source_sentence": "此言意說劫增之時，三災漸輕、煩惱轉薄，眾生向好、惡見漸微，命根轉長漸漸向勝。",
        "translation": "This means that when the kalpa increases, the three calamities are gradually lessened and the afflictions become weaker, sentient beings tend toward good and bad views gradually diminish, and the life root grows gradually and gradually leads to victory.",
        "source": "T37n1758_003:0346b15_14"
    },
    {
        "source_sentence": "已上好可忻名之為清，眾生無苦化佛不出世。",
        "translation": "The above-mentioned goodness that can be apprehended is called purity, and sentient beings without suffering are transformed into buddhas who don't appear in the world.",
        "source": "T37n1758_003:0346b16_15"
    },
    {
        "source_sentence": "諸化佛出世必向劫減，小三災漸起煩惱轉厚，眾生向惡染見漸增，命根轉短漸漸向劣，",
        "translation": "When apparitional buddhas appear in the world, they will surely go to a kalpa of decrease. The minor three calamities and gradually developing defilement will be with increasing severity. Sentient beings who are headed toward evil will see increase; those whose vital faculty is weak will become weak gradually.",
        "source": "T37n1758_003:0346b18_0"
    },
    {
        "source_sentence": "下惡可厭故立濁名。",
        "translation": "The lower evil is disgusting, so it's called turbid.",
        "source": "T37n1758_003:0346b20_0"
    },
    {
        "source_sentence": "五者是數，帶數釋也。",
        "translation": "The fifth is the interpretation that it's counted, which carries a number of explanations.",
        "source": "T37n1758_003:0346b20_1"
    },
    {
        "source_sentence": "次望別名，皆持業釋也。",
        "translation": "Next, we'll look at the explanation of the distinct names, which are all interpretations of maintaining karma.",
        "source": "T37n1758_003:0346b20_2"
    },
    {
        "source_sentence": "或以別揀總，亦依主釋。",
        "translation": "Perhaps it's because they discriminate the general with specificity and also rely on the main explanation.",
        "source": "T37n1758_003:0346b21_3"
    },
    {
        "source_sentence": "二、出體者，《地持論》云：謂今世人多皆短壽，極長百歲，是名命濁。",
        "translation": "Second, the essence of what comes forth is that the Discourse on Earthly Maintenance says, 'Many people in the world today have short life spans, and the longest one hundred years are called the turbidity of life.'",
        "source": "T37n1758_003:0346b22_0"
    },
    {
        "source_sentence": "此以本識名言種子，由業所引功能差別命根為體，善業力弱命根漸短，",
        "translation": "The seeds of the root consciousness are named by reason of the distinctive powers and vitality that are projected by action. The force of good action weakens, and the vitality gradually decreases.",
        "source": "T37n1758_003:0346b23_1"
    },
    {
        "source_sentence": "由殺生業之所感故。",
        "translation": "It's because it's the result of the activity of killing sentient beings.",
        "source": "T37n1758_003:0346b25_2"
    },
    {
        "source_sentence": "若諸眾生不識父母、不識沙門及宗族尊長，不修義理、不怖不畏今世後世惡業果報，",
        "translation": "“If sentient beings don’t know their parents, renunciants, and the venerable members of their clans, don’t cultivate doctrine, don’t fear it, and don’t fear the results of bad actions in this world or the next.",
        "source": "T37n1758_003:0346b25_3"
    },
    {
        "source_sentence": "不修惠施不作功德、不修齊法不持禁戒，是名有情濁。",
        "translation": "If someone doesn't cultivate generosity, doesn't perform meritorious acts, doesn't cultivate the same principles, and doesn't observe the precepts, this is called the turbidity of sentient beings.",
        "source": "T37n1758_003:0346b27_4"
    },
    {
        "source_sentence": "雖第八識名為有情，今說由近惡外緣故，五蘊假者作惡無善名有情濁，",
        "translation": "Although the eighth consciousness is referred to as sentient beings, we now say that it is because they are proximate to bad external conditions. The five dharmas which are provisional and do evil but not good are said to be the turbidity of sentient beings.",
        "source": "T37n1758_003:0346b28_5"
    },
    {
        "source_sentence": "合以第八識及五為性。",
        "translation": "Together, the eighth consciousness and the five are their natures.",
        "source": "T37n1758_003:0346c01_6"
    },
    {
        "source_sentence": "若此眾生增非法貪，或惠刀劍或施器仗，諍訟鬪亂諂曲妄語，攝受邪法及餘惡不善法，",
        "translation": "If these sentient beings increase craving for what’s unlawful, they may give gifts of swords, knives, or weapons, engage in disputes, fights, flattery, and false speech, and take in wrong teachings and other bad and unskillful teachings.",
        "source": "T37n1758_003:0346c01_7"
    },
    {
        "source_sentence": "是名煩惱濁。",
        "translation": "This is called the turbidity of affliction.",
        "source": "T37n1758_003:0346c03_8"
    },
    {
        "source_sentence": "除五見外，所餘一切煩惱隨煩惱皆煩惱濁體，此非法貪、惠刀劍等令行殺害，",
        "translation": "With the exception of the five false views, all the other defilements and secondary defilements are the impure substance of defilement. This is unlawful craving, wisdom, swords, etc., that enable one to commit killing.",
        "source": "T37n1758_003:0346c04_9"
    },
    {
        "source_sentence": "或慳好財但捨刀劍，因非法貪諍等竟起，乃至諸餘惡不善法通攝一切煩惱隨煩惱盡，",
        "translation": "Or they may be stingy with good possessions but abandon their swords and swords because of unlawful greed, anger, and so on, up to the other bad and unskillful qualities universally include all the afflictions and derivative afflictions that have ended.",
        "source": "T37n1758_003:0346c05_10"
    },
    {
        "source_sentence": "由性數習逢惡境牽煩惱尤重。",
        "translation": "It's because their nature is repeatedly accustomed to encountering bad objects that the afflictions are especially serious.",
        "source": "T37n1758_003:0346c07_11"
    },
    {
        "source_sentence": "若於今世法壞法沒，像法漸起邪法轉生，是名見濁。",
        "translation": "If in the present life, the Dharma breaks down and the Dharma disappears, and the images gradually give rise to wrong teachings that arise, this is called the turbidity of views.",
        "source": "T37n1758_003:0346c08_12"
    },
    {
        "source_sentence": "此以五見而為體性，多近外道惡見數生。",
        "translation": "These are the essence of these five views, which often arise repeatedly because they resemble bad views of non-Buddhists.",
        "source": "T37n1758_003:0346c09_13"
    },
    {
        "source_sentence": "若飢饉劫起、疾病劫起、刀兵劫起，是名劫濁。",
        "translation": "If an eon of hunger arises, an eon of illness arises, or an eon of swords and armies arises, this is called an eon of turbidity.",
        "source": "T37n1758_003:0346c10_14"
    },
    {
        "source_sentence": "此以色蘊四塵為體，或通五蘊，仍是不相應時為其體，依四五蘊而建立故，",
        "translation": "These are the four atoms of the aggregate of matter as their essence, or they may belong to one of the five aggregates. They continue to be their essence at the moment when they are dissociated, because they are established on the basis of four or five aggregates.",
        "source": "T37n1758_003:0346c11_15"
    },
    {
        "source_sentence": "煩惱增多惡業尤重，便招惡果三災遂生。",
        "translation": "When the afflictions increase and bad karma becomes especially serious, they bring bad consequences that result in three calamities that arise.",
        "source": "T37n1758_003:0346c13_16"
    },
    {
        "source_sentence": "三、對治者，《智度論》中立四悉檀，悉檀宗也：一、世界悉檀；",
        "translation": "The antidote is that in the Treatise on the perfection of knowledge, four kinds of accomplishment are established:",
        "source": "T37n1758_003:0346c14_17"
    },
    {
        "source_sentence": "二、為人悉檀；",
        "translation": "The second is accomplishment of giving for the sake of others.",
        "source": "T37n1758_003:0346c15_18"
    },
    {
        "source_sentence": "三、對治悉檀；",
        "translation": "The third is the attainment of enlightenment as antidote.",
        "source": "T37n1758_003:0346c15_19"
    },
    {
        "source_sentence": "四、第一義諦悉檀。",
        "translation": "4. the accomplishment of the ultimate truth.",
        "source": "T37n1758_003:0346c16_20"
    },
    {
        "source_sentence": "劫濁、眾生濁，世界悉檀治之。",
        "translation": "To counteract the turbidity of the eon and the turbidity of sentient beings, the world is governed by Siddhârtha.",
        "source": "T37n1758_003:0346c16_21"
    },
    {
        "source_sentence": "識器世間、眾生世間悉皆虛幻，厭怖修道即永離故。",
        "translation": "The world of the consciousness vessel and the world of sentient beings are all illusory, because they're disillusioned with fear and cultivate it, which means they're permanently free.",
        "source": "T37n1758_003:0346c17_22"
    },
    {
        "source_sentence": "命濁以各各為人悉檀治之。",
        "translation": "The turbidity of life is healed by each one for the benefit of all people.",
        "source": "T37n1758_003:0346c18_23"
    },
    {
        "source_sentence": "識知人由善業所得，修持淨戒行不殺等，命自長故，或為三乘之人各說自乘涅槃之果，",
        "translation": "Consciousness knows that a person who cultivates pure morality and practices abstention from killing, etc., obtained by virtue of good actions, sometimes explains to the followers of the three vehicles the results of nirvana for their own sake.",
        "source": "T37n1758_003:0346c19_0"
    },
    {
        "source_sentence": "便除生死所有命濁。",
        "translation": "He'll then remove the turbidity of birth-and-death and all the turbidity of life.",
        "source": "T37n1758_003:0346c21_0"
    },
    {
        "source_sentence": "煩惱濁、見濁，對治悉檀治之。",
        "translation": "The turbidity of affliction and the turbidity of views are counteracted by antidote siddhânta.",
        "source": "T37n1758_003:0346c21_1"
    },
    {
        "source_sentence": "修習隨應對治之道令不起故。",
        "translation": "It's because they cultivate the path of antidotes that should be followed so that they won't arise.",
        "source": "T37n1758_003:0346c22_2"
    },
    {
        "source_sentence": "由三悉檀破五濁故，入第一義證會真宗。",
        "translation": "Because the three siddhântas destroy the five turbidities, they enter the ultimate truth and realize the true doctrine.",
        "source": "T37n1758_003:0346c22_3"
    },
    {
        "source_sentence": "四、癈立者，何故唯立五濁不增減耶？",
        "translation": "4. Why are only the five turbidities established and not increased or decreased?",
        "source": "T37n1758_003:0346c23_4"
    },
    {
        "source_sentence": "答：眾生有二：一、惡行，謂在家白衣；",
        "translation": "Answer: There are two kinds of beings:",
        "source": "T37n1758_003:0346c24_5"
    },
    {
        "source_sentence": "二、邪行，謂出家外道，白衣無慧煩惱增時名煩惱濁，外道邪解浪推求時立為見濁；",
        "translation": "The second is wrong path: renunciant non-Buddhist. When the defilements of white clothes and ignorance increase, it is called the turbidity of defilement. Non-Buddhist views are said to be the turbidity of views at the time when wrong understanding and wrong doctrine wander in their investigation.",
        "source": "T37n1758_003:0346c25_6"
    },
    {
        "source_sentence": "又諸鈍惑名煩惱濁，諸餘利惑名為見濁。",
        "translation": "Also, dull passions are called the turbidity of affliction, and other sharp passions are called the turbidity of views.",
        "source": "T37n1758_003:0346c27_7"
    },
    {
        "source_sentence": "由此二因得當果時，離合不同，復分二濁，合二內果名眾生濁，惡眾生故；",
        "translation": "When these two causes attain their respective results, they are separated from one another by different combinations and further divided into two forms of turbidity. The combined internal result is called the turbidity of sentient beings because it is bad for sentient beings.",
        "source": "T37n1758_003:0346c28_8"
    },
    {
        "source_sentence": "合二外果總名劫濁，惡器具故。",
        "translation": "Together these two external fruits are collectively called the kalpa of turbidity, because they are endowed with bad vessels.",
        "source": "T37n1758_003:0347a01_9"
    },
    {
        "source_sentence": "劫謂時分，時無別時，依法辨故。",
        "translation": "The kalpa refers to the period of time. There is no different period of time: because it is calculated according to the law.",
        "source": "T37n1758_003:0347a01_10"
    },
    {
        "source_sentence": "劫濁故，以惡器為體。",
        "translation": "Because the kalpa is turbid, it takes a bad vessel as its body.",
        "source": "T37n1758_003:0347a02_11"
    },
    {
        "source_sentence": "此惡眾生及與外果，雖復總陳，是二濁果未辨。",
        "translation": "Although these bad sentient beings and the external fruits may be summarized, they are the two turbid fruits that have yet to be defined.",
        "source": "T37n1758_003:0347a02_12"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T37n1758_003:0347a04_0"
    },
    {
        "source_sentence": "正惡果體今顯根本故立命濁，或內惡果名為命濁，外惡果者名為劫濁。",
        "translation": "The essence of the right bad fruit now shows the root, so it's called life turbidity. Or internal bad fruit is called life turbidity, and external bad fruit is called kalpa turbidity.",
        "source": "T37n1758_003:0347a04_1"
    },
    {
        "source_sentence": "此惡因果由誰而有？",
        "translation": "Where did these bad causes and effects come from?",
        "source": "T37n1758_003:0347a05_2"
    },
    {
        "source_sentence": "謂惡眾生，故名眾生濁。",
        "translation": "It means bad sentient beings, so it's called the turbidity of sentient beings.",
        "source": "T37n1758_003:0347a06_3"
    },
    {
        "source_sentence": "由此五濁據增行相，欲令生厭故偏說五。",
        "translation": "These five impure influences are said to be five by reason of their predominance with respect to defilement, because they arise in order to engender disgust.",
        "source": "T37n1758_003:0347a06_4"
    },
    {
        "source_sentence": "五相攝者，《薩遮尼乾子經》云立十二濁：一、示現劫濁；",
        "translation": "As for the five characteristics that are included, the Sazhe niqianzi jing says:",
        "source": "T37n1758_003:0347a07_5"
    },
    {
        "source_sentence": "二、示現時濁；",
        "translation": "The second is to show the turbidity of the present.",
        "source": "T37n1758_003:0347a08_6"
    },
    {
        "source_sentence": "三、示現眾生濁；",
        "translation": "The third is to show the turbidity of sentient beings.",
        "source": "T37n1758_003:0347a09_7"
    },
    {
        "source_sentence": "四、示現煩惱濁；",
        "translation": "The fourth is to show the turbidity of afflictions.",
        "source": "T37n1758_003:0347a09_8"
    },
    {
        "source_sentence": "五、示現命濁；",
        "translation": "The fifth is to show the turbidity of life.",
        "source": "T37n1758_003:0347a09_9"
    },
    {
        "source_sentence": "六、示現三乘差別濁；",
        "translation": "The sixth is to show the various defilements of the three vehicles.",
        "source": "T37n1758_003:0347a10_10"
    },
    {
        "source_sentence": "七、示現不淨國土濁；",
        "translation": "The seventh is to show the defilement of impure lands.",
        "source": "T37n1758_003:0347a10_11"
    },
    {
        "source_sentence": "八、示現難化眾生濁；",
        "translation": "The eighth is to show the turbidity of sentient beings who have difficulty teaching.",
        "source": "T37n1758_003:0347a11_12"
    },
    {
        "source_sentence": "九、示現說種種煩惱濁；",
        "translation": "The ninth is to show and explain the various turbidities of afflictions.",
        "source": "T37n1758_003:0347a11_13"
    },
    {
        "source_sentence": "十、示現外道亂濁；",
        "translation": "The tenth is to show the turbidity of heretical doctrines.",
        "source": "T37n1758_003:0347a12_14"
    },
    {
        "source_sentence": "十一、示現魔濁；",
        "translation": "The eleventh is to show the turbidity of demons.",
        "source": "T37n1758_003:0347a12_15"
    },
    {
        "source_sentence": "十二、示現魔業濁。",
        "translation": "12. It shows the turbidity of demonic activity.",
        "source": "T37n1758_003:0347a12_16"
    },
    {
        "source_sentence": "劫濁及時即劫濁，眾生及難化眾生即眾生濁，煩惱及說種種煩惱即煩惱濁，",
        "translation": "When the kalpa is turbid, it's the time of the kalpa. Sentient beings and sentient beings who aren't transformed are the turbidity of sentient beings, and afflictions and explained various afflictions are the turbidity of afflictions.",
        "source": "T37n1758_003:0347a13_17"
    },
    {
        "source_sentence": "命即命濁，外道亂即是見濁，此八即五濁。",
        "translation": "Life is the turbidity of life, non-Buddhist disturbances are the turbidity of views, and these eight are the five turbidities.",
        "source": "T37n1758_003:0347a15_18"
    },
    {
        "source_sentence": "餘之四種謂三乘差別、不淨國土、魔及魔業，非五濁攝。",
        "translation": "The other four kinds are the distinctions of the three vehicles, impure lands, Māra and Māra karma, not the five turbidities that are included.",
        "source": "T37n1758_003:0347a16_0"
    },
    {
        "source_sentence": "五濁據勝，唯實雜染；",
        "translation": "The five defilements are predominant, but only the real defilements.",
        "source": "T37n1758_003:0347a17_1"
    },
    {
        "source_sentence": "十二濁通能化能障，佛示現故。",
        "translation": "The twelve impure dharmas can be transformed or obstructed, because they are manifested by the Buddha.",
        "source": "T37n1758_003:0347a17_2"
    },
    {
        "source_sentence": "問：「何故釋迦百歲時生，彌勒八萬歲出？」",
        "translation": "Q: Why was Śākyamuni born when he was a hundred years old and Maitreya emerged at 80,000 years old?",
        "source": "T37n1758_003:0347a18_3"
    },
    {
        "source_sentence": "答：「各據本願，出時不同故。」",
        "translation": "Answer: Each is based on the original vow, which differs from time to time.",
        "source": "T37n1758_003:0347a19_4"
    },
    {
        "source_sentence": "經曰：「得阿耨多羅三藐三菩提」。",
        "translation": "The sūtra says, They attain supreme perfect enlightenment.",
        "source": "T37n1758_003:0347a20_0"
    },
    {
        "source_sentence": "贊曰：第三嗟訝成佛。",
        "translation": "He said, Third, he marveled at the accomplishment of Buddhahood.",
        "source": "T37n1758_003:0347a20_1"
    },
    {
        "source_sentence": "緣此界境唯穢惡人，不足是非，證菩提如火內生蓮，得解脫似氷中出燭故也。",
        "translation": "Conditioned by this realm, only the defiled and bad people who aren't good enough to realize enlightenment are like lotus flowers growing inside a fire, and they attain liberation like a candle coming out of ice.",
        "source": "T37n1758_003:0347a21_2"
    },
    {
        "source_sentence": "經曰：「為諸眾生說是一切世間難信之法。」",
        "translation": "The sūtra says, Explain this for all sentient beings as a teaching that's difficult to believe in in in the world.",
        "source": "T37n1758_003:0347a24_0"
    },
    {
        "source_sentence": "讚曰：第四說法幽玄。",
        "translation": "He praised it, saying, The fourth teaches the profound truth of the Dharma.",
        "source": "T37n1758_003:0347a24_1"
    },
    {
        "source_sentence": "難信之法者，只如此典一朝誦佛十念精進誠，超五濁之穢方、登初地之淨域，",
        "translation": "The difficult to believe doctrine is that it's just like this scripture, where one morning he recites the Buddha's ten recitations with energy and sincerity, transcending the five turbid defiled directions and ascending to the first ground of purity.",
        "source": "T37n1758_003:0347a25_2"
    },
    {
        "source_sentence": "豈非難信哉？",
        "translation": "Isn't that difficult to believe?",
        "source": "T37n1758_003:0347a27_3"
    },
    {
        "source_sentence": "上來第五彼尊讚嘆咸曰：「希奇訖！」",
        "translation": "The fifth from the above is that the venerable praises and exclaims, saying, How marvelous!",
        "source": "T37n1758_003:0347a27_4"
    },
    {
        "source_sentence": "經曰：「舍利弗！",
        "translation": "The sūtra said, Śāriputra!",
        "source": "T37n1758_003:0347a29_0"
    },
    {
        "source_sentence": "當知我於五濁惡世行此難事」。",
        "translation": "You should know that I've done this difficult thing in the five turbid and bad worlds.",
        "source": "T37n1758_003:0347a29_1"
    },
    {
        "source_sentence": "贊曰：下第六段我佛敘陳獨稱難事。",
        "translation": "He said, In the sixth paragraph below, I, the Buddha, described the difficult task of self-reliance as a solitary claim.",
        "source": "T37n1758_003:0347b01_0"
    },
    {
        "source_sentence": "文分為四：初、敘行難修；",
        "translation": "The text is divided into four parts:",
        "source": "T37n1758_003:0347b01_1"
    },
    {
        "source_sentence": "二、敘果難證；",
        "translation": "The second is to describe the difficulty of realization of results.",
        "source": "T37n1758_003:0347b02_2"
    },
    {
        "source_sentence": "三、敘法難信；",
        "translation": "The third is to describe the difficulties of faith in doctrine.",
        "source": "T37n1758_003:0347b02_3"
    },
    {
        "source_sentence": "四、總結甚難。",
        "translation": "4. It's very difficult to summarize.",
        "source": "T37n1758_003:0347b02_4"
    },
    {
        "source_sentence": "此即初也。",
        "translation": "This is the first one.",
        "source": "T37n1758_003:0347b03_5"
    },
    {
        "source_sentence": "行此難事者，即三僧祇劫萬行備修，捐身命以殉菩提，捨國城而為郡眾，",
        "translation": "Those who do this difficult service are those who practice it for three incalculable eons and prepare ten thousand practices, sacrifice their bodies and lives to fight for enlightenment, abandoning countries and cities and becoming a community of people.",
        "source": "T37n1758_003:0347b03_6"
    },
    {
        "source_sentence": "方成正覺，豈非難事也！",
        "translation": "Only then will they become perfectly enlightened, isn't that a difficult task?",
        "source": "T37n1758_003:0347b05_7"
    },
    {
        "source_sentence": "經曰：「得阿耨多羅三藐三菩提」。",
        "translation": "The sūtra says, They attain supreme perfect enlightenment.",
        "source": "T37n1758_003:0347b06_0"
    },
    {
        "source_sentence": "贊曰：此第二敘果難證。",
        "translation": "He said, This is the second statement that it's difficult to realize fruition.",
        "source": "T37n1758_003:0347b06_1"
    },
    {
        "source_sentence": "如上已解，其文可知。",
        "translation": "As explained above, the text can be understood.",
        "source": "T37n1758_003:0347b07_2"
    },
    {
        "source_sentence": "經曰：「為一切世間說此難信之法」。",
        "translation": "The sūtra says, Explain this difficult teaching for all the world.",
        "source": "T37n1758_003:0347b08_0"
    },
    {
        "source_sentence": "贊曰：此第三敘法難信也。",
        "translation": "He said, This is the third statement of how difficult it is to believe in the teaching.",
        "source": "T37n1758_003:0347b08_1"
    },
    {
        "source_sentence": "經曰：「是為甚難」。",
        "translation": "The sūtra says, This is a great difficulty.",
        "source": "T37n1758_003:0347b10_0"
    },
    {
        "source_sentence": "贊曰：此第四段總結甚難，結上三事。",
        "translation": "He said, This fourth paragraph summarizes the great difficulty and concludes with three things.",
        "source": "T37n1758_003:0347b10_1"
    },
    {
        "source_sentence": "上來已解正宗分訖。",
        "translation": "The above has already explained the correct doctrine in part.",
        "source": "T37n1758_003:0347b11_2"
    },
    {
        "source_sentence": "經曰：「佛說此經已，舍利弗及諸比丘，一切世間天、人、阿修羅等，",
        "translation": "The sūtra says, After the Buddha taught this sūtra, Śāriputra and the monks, all the gods, humans, asuras, and so forth of the world.",
        "source": "T37n1758_003:0347b12_0"
    },
    {
        "source_sentence": "聞佛所說，歡喜信受，作禮而去」。",
        "translation": "When they heard what the Buddha taught, they rejoiced and believed it, paid homage, and departed.",
        "source": "T37n1758_003:0347b13_1"
    },
    {
        "source_sentence": "贊曰：第三流通分文有四段：初、說經事畢；",
        "translation": "The third is the text of the circulation part, consisting of four paragraphs:",
        "source": "T37n1758_003:0347b14_0"
    },
    {
        "source_sentence": "二、聽法緣終；",
        "translation": "The second is the finality of the conditions for listening to the Teaching.",
        "source": "T37n1758_003:0347b15_0"
    },
    {
        "source_sentence": "三、聞法歡忻；",
        "translation": "The third is to be joyful when hearing the Teaching.",
        "source": "T37n1758_003:0347b15_1"
    },
    {
        "source_sentence": "四、退辭佛去，四段合一唱也。",
        "translation": "4. It's a four-line unified chant that withdraws from the Buddha and leaves him.",
        "source": "T37n1758_003:0347b15_2"
    },
    {
        "source_sentence": "佛說此經已者，是第一說經事畢，及諸下文皆結集之語也。",
        "translation": "The Buddha who has explained this sūtra is the first one who explains the completion of the task of teaching the sūtras, and all the following sentences are summarized words.",
        "source": "T37n1758_003:0347b16_3"
    },
    {
        "source_sentence": "舍利弗及諸比丘，一切世間、天、人、阿修羅等聞佛所說者，是第二聽法緣終。",
        "translation": "Śāriputra and the monks, all the worlds, gods, humans, and asuras who hear what the Buddha teaches are the second condition for listening to the teaching.",
        "source": "T37n1758_003:0347b17_4"
    },
    {
        "source_sentence": "言世間者，即有情世間也，可破壞故。",
        "translation": "The word world refers to the world of sentient beings because it can be destroyed.",
        "source": "T37n1758_003:0347b19_5"
    },
    {
        "source_sentence": "天人者，天即欲界六天。",
        "translation": "The gods are the six heavens of the realm of sexual passion.",
        "source": "T37n1758_003:0347b20_6"
    },
    {
        "source_sentence": "天者，即光潔自在名天。",
        "translation": "A god is called a god because it's freely shining and pure.",
        "source": "T37n1758_003:0347b20_7"
    },
    {
        "source_sentence": "人即人趣，謂多忍義名人。",
        "translation": "The realm of humans refers to the realm of humans, that is, a person who possesses patience.",
        "source": "T37n1758_003:0347b21_8"
    },
    {
        "source_sentence": "阿修羅此云非天，如人不仁名曰非人，修羅亦爾。",
        "translation": "An asura is called not a god, just as a human being who isn't benevolent is called not a human being, and so are the asura.",
        "source": "T37n1758_003:0347b21_9"
    },
    {
        "source_sentence": "歡喜信受者，是第三聞法歡忻，顏舒曰歡，神悅曰喜，故云歡喜，即意識相應喜受也。",
        "translation": "Being joyful and believing is the third kind of rejoicing when he hears the teaching, which is called joyful because his countenance is said to be joyful and his spirit is said to be joyful. That's why it's called rejoicing, which is the feeling of joy associated with the mental consciousness.",
        "source": "T37n1758_003:0347b22_10"
    },
    {
        "source_sentence": "此經乃三乘妙旨，眾聖要樞，出生死之鴻源，證真常之疾路，得路得聞圓備，",
        "translation": "This scripture is the marvelous teaching of the three vehicles. It is the pivot of all sages. It is the great source of birth and death. Realizing that reality is eternal, it follows the fast path of attaining enlightenment.",
        "source": "T37n1758_003:0347b24_11"
    },
    {
        "source_sentence": "豈不樂哉！",
        "translation": "Isn't that pleasant?",
        "source": "T37n1758_003:0347b26_12"
    },
    {
        "source_sentence": "故云歡喜。",
        "translation": "That's why it's called joy.",
        "source": "T37n1758_003:0347b26_13"
    },
    {
        "source_sentence": "問：「先標聽徒之處兼明菩薩聲聞，經終作禮歡忻，何故不明菩薩？」",
        "translation": "Q: First, we'll label the place where the listeners are and explain the bodhisattvas and śrāvakas, so why don't they know the bodhisattvas when the sūtras end up paying homage to them?",
        "source": "T37n1758_003:0347b26_14"
    },
    {
        "source_sentence": "答：「迓影略說，不必俱陳。」",
        "translation": "Answer: The shadow of anger is briefly explained, so there's no need to explain it together.",
        "source": "T37n1758_003:0347b28_15"
    },
    {
        "source_sentence": "作禮而去者，是第四退辭佛去。",
        "translation": "This is the fourth person who pays homage and leaves, which is to withdraw from the Buddha's departure.",
        "source": "T37n1758_003:0347b28_16"
    },
    {
        "source_sentence": "五輪俱屈，三業歸誠，咸別世尊，各還本土，故云作禮而去。",
        "translation": "Each of the five wheels bends, and the three karmas are revered with sincerity. They all part with the World-honored One and return to their respective native land; therefore, it is called paying homage and departing.",
        "source": "T37n1758_003:0347b29_17"
    },
    {
        "source_sentence": "佛說阿彌陀經通贊疏卷下(終)",
        "translation": "Foshuo amita jingtongzan shou, vol. 2 (end)",
        "source": "T37n1758_003:0347c02_0"
    },
    {
        "source_sentence": "此慈恩所撰《阿彌陀經通贊》一卷者，祐世僧統於元豐、元祐之間，入于中華求得，",
        "translation": "This compiled by Maitreya is the one-fascicle version of the Abhidharma Sutra, a universal praise of Amitâbha. Among the saṃgha ruled over Yuanfeng and Yuanyou during the Youshi dynasty, who entered China to seek gain.",
        "source": "T37n1758_003:0347c04_0"
    },
    {
        "source_sentence": "將到流通之本也。",
        "translation": "It's about to reach the source of circulation.",
        "source": "T37n1758_003:0347c05_1"
    },
    {
        "source_sentence": "(予)助洪願，付於廣教院，命工重剶，自戊辰十月十九日起首，至十二月十日畢乎矣。",
        "translation": "I) assisted Hongyuan, entrusted it to Guangjiao Monastery and ordered a heavy worker to carve the image. It was completed on the tenth day of the tenth month from the first day of the tenth day in the tenth month on the fifteenth day of the twelfth month at the beginning of the ninth day in the tenth month on",
        "source": "T37n1758_003:0347c06_2"
    },
    {
        "source_sentence": "所有功德自利利他，此世來生福慧圓滿，普與含識同會樂方。",
        "translation": "All their merits are self-benefiting and benefiting others, and they'll be born in this world with the perfection of merit and wisdom, where they'll all share the same assembly and happiness as consciousness.",
        "source": "T37n1758_003:0347c08_3"
    },
    {
        "source_sentence": "時大安五年已已二月晦日記。",
        "translation": "It was the twentieth day of the second month after the fifth year of Da’an.",
        "source": "T37n1758_003:0347c09_4"
    },
    {
        "source_sentence": "海東大慈恩玄化寺住持廣祐僧統釋韶顯題件書等(予)以嘉保二年孟冬下旬，",
        "translation": "In the second half of the winter of the second year of the Jiabao period (557 C.E. ), the abbot of Dacieng Xuanhua Monastery in the sea east of the empire, Guangyou Sengtong, the head monk of the order, Shi Shaoshan, wrote a letter with titles and other writings to express his respect for him.",
        "source": "T37n1758_003:0347c11_0"
    },
    {
        "source_sentence": "西府郎會宋人柳裕傳語高麗王子義天，誂求極樂要書、彌陀行願相應經典章疏等。",
        "translation": "Liu Yu, a member of the court of the Western Regions and Song dynasty, transmitted the message to the Prince Yitian of Goryeo, who asked for the Essentials of the Perfection of Bliss and the scriptures, chapters, commentaries, and other texts associated with the practice vows of Maitreya.",
        "source": "T37n1758_003:0347c14_1"
    },
    {
        "source_sentence": "其後折裕守約，以永長二年(丁丑)三月二十三日(丁丑)送自義天所傳得彌陀極樂書等十三部二十卷。",
        "translation": "On the twenty-third day of the third month (ding ugly) in the second year of Yongzhao's reign (ding ugly), on the twenty-third day of the third month (ding ugly) in the third year of Yongzhao's reign, he sent a thirteen-fascicle book of Amitâbha's ultimate bliss transmit",
        "source": "T37n1758_003:0347c16_2"
    },
    {
        "source_sentence": "則以同五月二十三日家時興福寺淨名院到來，懇誠相臻，清素自[怡-台+皆]，",
        "translation": "On the twenty-third day of the same month, on the thirty-sixth day of the fourth month, a monk came from Jingming Monastery at Xingfu Monastery. They were sincerely approaching each other and their purity and genuineness matched [Yi - Tai + Qi].",
        "source": "T37n1758_003:0347c19_3"
    },
    {
        "source_sentence": "仍以彼本，已重新寫，善種不朽，宿心爰成，欲為自他法界往生極樂之因緣矣！",
        "translation": "It's still because the source has been copied again, the good seeds won't perish, and the past mind is formed by wanting to be the cause and condition for the ultimate bliss of rebirth in the Dharma realm of self and others!",
        "source": "T37n1758_003:0347c20_4"
    },
    {
        "source_sentence": "康和四年(壬午)四月二十二日未剋藥師寺西室大房書寫畢。",
        "translation": "On the twenty-second day of the fourth month in the fourth year of Kanghe's reign (nonwu), he hadn't yet written it down in the large room west of Yaoshi Temple on the twenty-second day of the fourth month.",
        "source": "T37n1758_003:0347c23_0"
    },
    {
        "source_sentence": "願以此書寫善根，先二親消滅罪障，次桓賢終往生極樂矣！",
        "translation": "May this write down the good roots so that the first two relatives will extinguish their sins and hindrances, and the second is the ultimate bliss of rebirth at the end of time in the realm of Samantabhadra!",
        "source": "T37n1758_003:0347c25_0"
    },
    {
        "source_sentence": "(生年)三十一。",
        "translation": "(year of birth) thirty-one.",
        "source": "T37n1758_003:0347c26_1"
    },
    {
        "source_sentence": "但此書者，桓賢沒後，門弟之中常住僧房修學為宗之輩可傳領也。",
        "translation": "But this book is a collection of works that can be transmitted because after the disappearance of Huanxian, his disciples always stayed in the monks' quarters and studied under him as members of the order.",
        "source": "T37n1758_003:0347c26_2"
    },
    {
        "source_sentence": "嘉曆元年(丙寅)六月十七日，依眾議誂有小生分書寫所奉奇符春日社西新談議屋也。",
        "translation": "On the seventeenth day of the sixteenth month in the first year of the Jiaiji era (C.E.), there was a new discussion hall west of the Spring Day Society on the seventeenth day of the sixth month, according to the councilor's instructions, which was written by the lesser-arisen part of the monastery and endorsed by the Wonderful talisman",
        "source": "T37n1758_003:0347c29_0"
    },
    {
        "source_sentence": "　　　　　　　　　　大法師源覺",
        "translation": "great teacher of the Dharma, Genjue",
        "source": "T37n1758_003:0348a03_0"
    }
]