[
    {
        "source_sentence": "涅槃經遊意",
        "translation": "Commentary on the Traveling Meaning of the Nirvana Sutra",
        "source": "T38n1768_001:0230a15_0"
    },
    {
        "source_sentence": "沙門吉藏撰",
        "translation": "Compilation by the ascetic Jizang",
        "source": "T38n1768_001:0230a17_0"
    },
    {
        "source_sentence": "就此經有南北二本，廣略不同，北方舊本，卷或有三十三，或三十者，",
        "translation": "In this scripture there are two copies in the southern and a copy in the northern direction, which are not the same in breadth and width. The old version in the northern direction is sometimes in one volume, sometimes in thirty-three",
        "source": "T38n1768_001:0230a18_0"
    },
    {
        "source_sentence": "品唯有十三。",
        "translation": "There are only 13 chapters.",
        "source": "T38n1768_001:0230a19_1"
    },
    {
        "source_sentence": "南土文，卷有三十六，有二十五品。",
        "translation": "The texts of the southern land are in thirty-six fascicles, consisting of twenty-five chapters.",
        "source": "T38n1768_001:0230a19_2"
    },
    {
        "source_sentence": "其間文義浩博，豈可詳寫。",
        "translation": "The texts and meanings of these treatises are so vast that they cannot be reproduced in detail.",
        "source": "T38n1768_001:0230a20_3"
    },
    {
        "source_sentence": "故經云：「一恒二恒始髣髴見之，三恒四恒乃能知一分之義」。",
        "translation": "That's why the sūtra says, One constant and two constant are first seen together, and three constants and four constants can then know a part of their meaning.",
        "source": "T38n1768_001:0230a21_4"
    },
    {
        "source_sentence": "梁武皇帝云：「涅槃者，義高萬善，事絕百非，空空不能測其真際，玄玄不能究其妙門。",
        "translation": "Emperor Wu of the Liang dynasty said: The meaning of nirvana is lofty and myriad good deeds are cut off from a hundred evil deeds. Emptiness and voidness cannot fathom its true bounds, and",
        "source": "T38n1768_001:0230a22_5"
    },
    {
        "source_sentence": "自非德均平等，心會無生，金壚玉室豈易入哉！」",
        "translation": "If it weren't for the equal equality of virtue, the mind would arise without birth, and wouldn't it be easy to enter the gold room or the jade room?",
        "source": "T38n1768_001:0230a24_6"
    },
    {
        "source_sentence": "余昔經注錄之疏零失，今之憶者，十不存一，因茲講以聊復疏之。",
        "translation": "The commentaries on the old sūtras and commentaries are missing, but the ones I remember from the present do not exist in one of the ten. For this reason I will give a short commentary on them for your sake.",
        "source": "T38n1768_001:0230a25_7"
    },
    {
        "source_sentence": "就攝山大師唯講《三論》及《摩訶般若》，不開《涅槃》、《法華》，",
        "translation": "He taught only the Tripiṭaka and Mahāprajñāpāramitā, not the Nirvana and the Lotus.",
        "source": "T38n1768_001:0230a26_8"
    },
    {
        "source_sentence": "諸學士請講《涅槃經》，大師云：「諸人今解《般若》，那復令再講。」",
        "translation": "The students invited him to lecture on the Nirvana Sutra, and the great teacher said, Now that you understand the Prajñāpāramitā, why would you want me to teach it again?",
        "source": "T38n1768_001:0230a28_9"
    },
    {
        "source_sentence": "復重請，乃為道「本有今無偈」而遂不講文。",
        "translation": "Again, he repeated his request, saying, 'There was a verse in the past but there's no verse now,' and then he didn't teach the text.",
        "source": "T38n1768_001:0230a29_10"
    },
    {
        "source_sentence": "至興皇以來始大弘斯典。",
        "translation": "It's the first time since the reign of the emperor that this scripture has been greatly propagated.",
        "source": "T38n1768_001:0230b01_11"
    },
    {
        "source_sentence": "但開此經，初形勢非一，或明開路義，如國家域有梗礙，偏隅未賓，開疆祐出，",
        "translation": "But to open this scripture, the initial form and momentum are not one and the same. Or it may clarify the meaning of opening the road [to enlightenment], just as when a country has an obstruction in its territory but does not have",
        "source": "T38n1768_001:0230b01_12"
    },
    {
        "source_sentence": "先須斫伐，然後方得行師。",
        "translation": "You must first cut down the roots and then you'll attain a practitioner.",
        "source": "T38n1768_001:0230b03_13"
    },
    {
        "source_sentence": "今亦爾，為從來舊執擁塞正道故，須破洗然，後乃得講經。",
        "translation": "It's likewise now because the originally held right path embraces and obstructs the right path, so they must refute it and wash away it before they can teach the sūtras.",
        "source": "T38n1768_001:0230b04_14"
    },
    {
        "source_sentence": "開路義，別有科目，待餘暇矣。",
        "translation": "There are separate subjects for the purpose of opening the road, but they will have time to do so.",
        "source": "T38n1768_001:0230b05_15"
    },
    {
        "source_sentence": "又或明舍那、釋迦二佛教門差別不同，或辨因果人法十雙相對，並置而不論。",
        "translation": "It might also clarify the differences between the two Buddhist approaches of Śāna and Śākyamuni, or it might identify the ten pairs of causes and effects of humans and dharmas as opposed to each other, and place them together without discriminating.",
        "source": "T38n1768_001:0230b06_16"
    },
    {
        "source_sentence": "今於此經初且為六段：一大意、二宗旨、三釋名、四辨體、五明用、六料簡。",
        "translation": "At the beginning of this sūtra, there are six sections: one major idea, two purposes, three explanations of names, four explanations of essence, five explanations of function, and six summaries.",
        "source": "T38n1768_001:0230b07_17"
    },
    {
        "source_sentence": "第一說經大意者：此經之意復何窮？",
        "translation": "The first explains the general idea of the sūtra: What's the point of this sūtra?",
        "source": "T38n1768_001:0230b10_0"
    },
    {
        "source_sentence": "如：河西五門、波藪七分、興皇八章，迦葉三十解問，如來次第解釋則三十解意。",
        "translation": "Thus, the five approaches to the west of the river, the seven parts of the poṣu, and the eight chapters that give rise to the emperor, Kāśyapa explains 30 questions, and the Tathāgata explains them in order",
        "source": "T38n1768_001:0230b10_1"
    },
    {
        "source_sentence": "今直舉其樞要，陳其綱領，可然。",
        "translation": "Now, we'll simply cite the essentials and present their outlines, which are acceptable.",
        "source": "T38n1768_001:0230b12_2"
    },
    {
        "source_sentence": "正道平等，本自清淨，豈有生死異於涅槃？",
        "translation": "The right path is equal and inherently pure, so how could there be birth-and-death different from nirvāṇa?",
        "source": "T38n1768_001:0230b13_3"
    },
    {
        "source_sentence": "特由眾生虛妄，執文求實，聞名仍不見其真，或云涅槃是有，或意是無，",
        "translation": "It is precisely because sentient beings are unreal, clinging to words in order to seek the real. Yet when they hear their names they still do not see the real. Some say nirvana exists, while others think it does not.",
        "source": "T38n1768_001:0230b14_4"
    },
    {
        "source_sentence": "或言二諦所攝，或意出二諦之外，或意出生死無常，或意涅槃常住，因此謬造種種異計，",
        "translation": "They may claim that they are included in the two truths, or that their minds transcend the two truths, or that birth and death are impermanent, or that nirvāṇa is always abiding. Because of this, they mistakenly create various different theo",
        "source": "T38n1768_001:0230b15_5"
    },
    {
        "source_sentence": "便成繫縛，致有生死。",
        "translation": "They then become bound, and there's birth-and-death.",
        "source": "T38n1768_001:0230b17_6"
    },
    {
        "source_sentence": "前諸佛菩薩為引此妄情假說涅槃，為出處方便空假立名。",
        "translation": "The previous buddhas and bodhisattvas falsely explained nirvāṇa in order to induce these deluded feelings, and they nominally established names for the sake of emptiness as a method of escape.",
        "source": "T38n1768_001:0230b18_7"
    },
    {
        "source_sentence": "名無得物，物無應名。",
        "translation": "Names don't obtain things, and things shouldn't have names.",
        "source": "T38n1768_001:0230b19_8"
    },
    {
        "source_sentence": "名物既爾，萬法安立。",
        "translation": "Since names and things are thus, all things are established by myriad dharmas.",
        "source": "T38n1768_001:0230b20_9"
    },
    {
        "source_sentence": "所以生死涅槃本無二相，但為化此虛妄，如度虛空，實無眾生得滅度者，",
        "translation": "Therefore, birth-and-death and nirvāṇa have no dual characteristics in the first place. It is only to transform this delusion that they are said to be like crossing over into space. There really is no sentient being who can enter nir",
        "source": "T38n1768_001:0230b20_10"
    },
    {
        "source_sentence": "如此了悟名得涅槃，實無涅槃可得。",
        "translation": "Thus, it's called attaining nirvāṇa when you understand that there really isn't nirvāṇa to attain.",
        "source": "T38n1768_001:0230b22_11"
    },
    {
        "source_sentence": "但約此迷悟說凡說聖，假名生死強稱涅槃，令改凡成聖，捨生死得涅槃。",
        "translation": "It's simply because this delusion and awakening teaches that worldlings are said to be noble, which is nominally called birth-and-death and forcibly called nirvāṇa, so that they change from worldlings into sages and abandon",
        "source": "T38n1768_001:0230b23_12"
    },
    {
        "source_sentence": "既悟此本來不二、亦復不一，若於凡聖、生死、涅槃作一異解者，則障正道，",
        "translation": "If someone realizes that these are originally not two and also not one, and if they make one different understanding of worldlings, sages, birth-and-death, and nirvāṇa, then they'll hinder the right path.",
        "source": "T38n1768_001:0230b24_13"
    },
    {
        "source_sentence": "名為「據語」。",
        "translation": "It's called 'according to words.'",
        "source": "T38n1768_001:0230b26_14"
    },
    {
        "source_sentence": "今破此一異等見，名為「開道」。",
        "translation": "Now, to refute this view of one difference and so forth is called opening the path.",
        "source": "T38n1768_001:0230b26_15"
    },
    {
        "source_sentence": "約智開復，有何道可開耶？",
        "translation": "What path is there that can be opened by relying on knowledge?",
        "source": "T38n1768_001:0230b27_16"
    },
    {
        "source_sentence": "從來云如來之身非凡是聖，是聖涅槃之法，是常非無常。",
        "translation": "It's been said since then that the Tathāgata's body is extraordinary and noble, which is the sacred dharma of nirvāṇa, which is permanent and not impermanent.",
        "source": "T38n1768_001:0230b27_17"
    },
    {
        "source_sentence": "今為對此故，明如來之身非凡非聖，凡聖悉是如來善巧，涅槃非常無常，",
        "translation": "For this reason I now explain that the body of the Tathagata is neither extraordinary nor noble. All ordinary people and saints are skillful tathagatas; nirval)a is neither eternal nor impermanent.",
        "source": "T38n1768_001:0230b29_18"
    },
    {
        "source_sentence": "常無常皆涅槃方便。",
        "translation": "Both permanence and impermanence are the method of nirvāṇa.",
        "source": "T38n1768_001:0230c01_19"
    },
    {
        "source_sentence": "何者病耶？",
        "translation": "What's sickness?",
        "source": "T38n1768_001:0230c02_20"
    },
    {
        "source_sentence": "常病重故，設無常之藥。",
        "translation": "Because the disease of permanence is so serious, it's set up as an impermanent medicine.",
        "source": "T38n1768_001:0230c02_21"
    },
    {
        "source_sentence": "眾生執有為涅槃故設無，身心皆盡乃為妙極，物情不了便謂佛身無涅槃斷滅。",
        "translation": "If sentient beings cling to conditioned nirvāṇa and assume it's nonexistent because they don't exist, then their bodies and minds are all exhausted as the marvelous ultimate, and if things and emotions don't understand",
        "source": "T38n1768_001:0230c02_22"
    },
    {
        "source_sentence": "故經云：其復不久，王復得病，須服乳藥。",
        "translation": "That's why the sūtra says, Soon after that, the king will again become ill and must take milk and medicine.",
        "source": "T38n1768_001:0230c04_23"
    },
    {
        "source_sentence": "故今教為對無常故設常住，則左右除病，迭代破執。",
        "translation": "Therefore, the present teaching establishes permanence and abiding in order to oppose impermanence, so that the left and right will be freed from illness and refute attachment in turn.",
        "source": "T38n1768_001:0230c05_24"
    },
    {
        "source_sentence": "執病若盡，在藥皆除。",
        "translation": "If the attachment to illness is exhausted, they'll all be removed in the medicine.",
        "source": "T38n1768_001:0230c06_25"
    },
    {
        "source_sentence": "涅槃之法竟何所有？",
        "translation": "What is the existence of the dharma of nirvana?",
        "source": "T38n1768_001:0230c07_26"
    },
    {
        "source_sentence": "雖無所有而無所不有，雖無所不有而無所有。",
        "translation": "Although it has nothing, there's nothing that doesn't exist, and although there's nothing that doesn't exist, there's nothing that doesn't exist.",
        "source": "T38n1768_001:0230c07_27"
    },
    {
        "source_sentence": "有無既爾，常無常亦然，非常非無常，常無常具足也。",
        "translation": "Since both existence and nonexistence are thus, permanence and impermanence are likewise, neither eternal nor impermanent, and permanence and impermanence are complete.",
        "source": "T38n1768_001:0230c08_28"
    },
    {
        "source_sentence": "大師於此明四雙八隻義：一凡聖，二常無常，三隱顯，四半滿。",
        "translation": "Here, the great teacher explains the meaning of the four pairs and eight vessels: 1. worldlings and sages, 2. impermanent and impermanent, 3. hidden and revealed, and 4. half-complete.",
        "source": "T38n1768_001:0230c10_0"
    },
    {
        "source_sentence": "言凡聖者，涅槃實不開凡聖，但住大涅槃能建大義，或時為凡，或時化聖。",
        "translation": "When it comes to worldlings and sages, nirvāṇa really doesn't reveal worldlings and sages, but abiding in great nirvāṇa can establish great meanings, whether they are worldlings at times or sages of transformation at times.",
        "source": "T38n1768_001:0230c12_0"
    },
    {
        "source_sentence": "故佛初出世間同凡夫事，雖同凡而異解。",
        "translation": "That's why the Buddha first appeared in the world to be the same as ordinary people, and although he's the same as ordinary people, he understands them differently.",
        "source": "T38n1768_001:0230c13_1"
    },
    {
        "source_sentence": "凡初生則行諸方七步，云：「天上天下，唯我為尊」。",
        "translation": "When he was first born, he took seven steps in all directions and said, In heaven and earth, only I am the honored one.",
        "source": "T38n1768_001:0230c14_2"
    },
    {
        "source_sentence": "又云：「我生胎分盡，是最末後身，既自得解脫，復度眾生。」",
        "translation": "It's also said, When the portion of my birth in the womb is exhausted, I'll be the last to die, and after attaining liberation on my own, I'll again save sentient beings.",
        "source": "T38n1768_001:0230c15_3"
    },
    {
        "source_sentence": "此言已障是聖，但說此言已，更為嬰兒；",
        "translation": "Having uttered these words, the obstruction is noble; but having uttered these words, he will be reborn as a newborn.",
        "source": "T38n1768_001:0230c16_4"
    },
    {
        "source_sentence": "乃至槃馬、捔力等，具同凡事，此則以凡覆聖。",
        "translation": "It's the same as ordinary things like parinirvāṇa horses, coarse powers, and so forth, but this is because ordinary people cover sages.",
        "source": "T38n1768_001:0230c17_5"
    },
    {
        "source_sentence": "今日教起明久已，聖人方便便現為此事，則是以聖開凡。",
        "translation": "Today, it's been a long time since the teaching began to give rise to insight, and the noble person skillfully manifested this as a result, which is to use the noble to liberate worldlings.",
        "source": "T38n1768_001:0230c18_6"
    },
    {
        "source_sentence": "開覆之義，具通今昔。",
        "translation": "The meaning of opening and closing is fully applicable to the present and the past.",
        "source": "T38n1768_001:0230c20_7"
    },
    {
        "source_sentence": "昔開凡覆聖，今開聖覆凡。",
        "translation": "In the past, it was revealed that ordinary people covered the noble ones, and now it's revealed that the noble ones cover the ordinary.",
        "source": "T38n1768_001:0230c20_8"
    },
    {
        "source_sentence": "但昔覆名，今開稱。",
        "translation": "However, in the past it was covered with names but now it's called that.",
        "source": "T38n1768_001:0230c21_9"
    },
    {
        "source_sentence": "所以爾者，初為緣未堪，不得說是聖，但得說是凡，則凡覆聖。",
        "translation": "The reason for this is because the first condition is unfit. It cannot be said that they are noble, but if one can say that they are worldlings, then worldlings will overpower the noble ones.",
        "source": "T38n1768_001:0230c21_10"
    },
    {
        "source_sentence": "今始得說道：我本是聖人，以聖開凡。",
        "translation": "Now, I've just begun to explain the path: 'I was originally a noble person who opened up ordinary people with the noble.",
        "source": "T38n1768_001:0230c22_11"
    },
    {
        "source_sentence": "故前覆，今道開也。",
        "translation": "That's why the former one was covered, and the present one is enlightened.",
        "source": "T38n1768_001:0230c23_12"
    },
    {
        "source_sentence": "人聞此開覆，便作二解。",
        "translation": "When people hear this, they open and cover it up, and then they make two interpretations.",
        "source": "T38n1768_001:0230c24_13"
    },
    {
        "source_sentence": "聞昔覆，謂言別有一聖為凡所覆；",
        "translation": "Hearing is an obstacle in the past, meaning that there is said to be a separate noble one who is overwhelmed by worldlings.",
        "source": "T38n1768_001:0230c24_14"
    },
    {
        "source_sentence": "聞今開，則謂却除於凡別有聖出。",
        "translation": "When someone hears that it's now opened, they say there's no sage outside of ordinary people.",
        "source": "T38n1768_001:0230c25_15"
    },
    {
        "source_sentence": "今明不爾，昔本來是聖，為緣未堪不得說為聖，唯得說為凡，隱聖道不得說名之為覆，",
        "translation": "Now, it's clear that this isn't the case. In the past, they were originally noble; for reasons that weren't capable of being said to be noble, they could only be said to be worldlings; and the hidden noble path",
        "source": "T38n1768_001:0230c26_16"
    },
    {
        "source_sentence": "豈別有一聖可覆？",
        "translation": "How could there be a separate noble thing to cover?",
        "source": "T38n1768_001:0230c28_17"
    },
    {
        "source_sentence": "今只道：昔凡則是聖，詺之為開，豈別有凡可除，聖可開耶？",
        "translation": "Now, I'll just say, 'In the past, ordinary people were sages, and debilitating hindrances were enlightenment; isn't there another ordinary person who can be removed and a sage who can be enlightened?",
        "source": "T38n1768_001:0230c28_18"
    },
    {
        "source_sentence": "故經云：「顯發如來方便密教故，昔隱不說為密也，今日顯說為開密也」。",
        "translation": "That's why the sūtra says, It's because it reveals the secret teaching of the Tathāgata's skillful means that what was hidden in the past isn't said to be secret, and what's revealed today is revealed as revealing",
        "source": "T38n1768_001:0230c29_19"
    },
    {
        "source_sentence": "凡聖既然，常無常亦爾。",
        "translation": "Since ordinary people and sages are permanent and impermanent, so are they.",
        "source": "T38n1768_001:0231a03_0"
    },
    {
        "source_sentence": "昔說「無常」隱「常」為「覆」，今日顯說於「常」為「開」。",
        "translation": "In the past, it was said that impermanent is hidden and eternal is covered, but today it's revealed that eternal is opening.",
        "source": "T38n1768_001:0231a03_1"
    },
    {
        "source_sentence": "然昔說「無常」，只說「常」為「無常」，詺「無常」覆「常」；",
        "translation": "However, in the past it was said that impermanence is impermanent. It is simply said that permanence is impermanence and that pervasive impermanence obscures permanence.",
        "source": "T38n1768_001:0231a04_2"
    },
    {
        "source_sentence": "今日只說向「無常」者，「常」名為「開」也。",
        "translation": "Today, we're only saying that it's directed toward impermanence, and permanence is called opening.",
        "source": "T38n1768_001:0231a05_3"
    },
    {
        "source_sentence": "又，且昔日名「覆」，今復名「開」，何者？",
        "translation": "Furthermore, what's the reason it was called covering in the past and now opening again?",
        "source": "T38n1768_001:0231a06_4"
    },
    {
        "source_sentence": "昔說「無常」不為「無常」，昔說「無常」為開。",
        "translation": "In the past, it was said that impermanence wasn't impermanent, and in the past, impermanence was explained as opening.",
        "source": "T38n1768_001:0231a06_5"
    },
    {
        "source_sentence": "今日「常」若無昔「無常」，何能顯今日「常」？",
        "translation": "If today's constancy is absent and the past impermanence is absent, how can it show that today's constancy is permanent?",
        "source": "T38n1768_001:0231a07_6"
    },
    {
        "source_sentence": "是則昔「無常」為今「常」。",
        "translation": "This is why the phrase impermanent in the past became permanent in the present.",
        "source": "T38n1768_001:0231a08_7"
    },
    {
        "source_sentence": "化方便故，昔「無常」今得是「開」也。",
        "translation": "It's because of the skillful means of teaching that in the past impermanence was now enlightenment.",
        "source": "T38n1768_001:0231a09_0"
    },
    {
        "source_sentence": "此是片到明，未是好開。",
        "translation": "This is a patch that's up to the light, but it's not yet well opened.",
        "source": "T38n1768_001:0231a09_1"
    },
    {
        "source_sentence": "至下文明常、無常，為顯非常、非無常，常無常、無常常具足，乃是「開密」也。",
        "translation": "Up to the point where the following civilization of permanence and impermanence is manifested in order to show that it's neither eternal nor non-eternal, and that permanence is impermanent and non-eternal is complete, this is enlight",
        "source": "T38n1768_001:0231a10_2"
    },
    {
        "source_sentence": "如此凡聖常無常開無常常，常無常、無常常，具足乃是「開密」也。",
        "translation": "Thus, when worldlings and sages are eternal, impermanent, open, and impermanent, and neither eternal nor impermanent, the fulfillment is enlightenment.",
        "source": "T38n1768_001:0231a11_3"
    },
    {
        "source_sentence": "如此凡聖常、無常開覆，並是大涅槃方便。",
        "translation": "Thus, worldlings and sages are permanent and impermanent, and it's the method of great nirvāṇa that uncovers them.",
        "source": "T38n1768_001:0231a13_4"
    },
    {
        "source_sentence": "如用若真，明凡覆聖，聖開凡，常、無常開覆未足為奇，亦非妙用，只為畢竟無。",
        "translation": "If its function is true, it shows that the worldling conceals the noble, the noble reveals the worldling, and the eternal and impermanent conceals what's not enough to be marvelous, which isn't a marvelous function",
        "source": "T38n1768_001:0231a14_5"
    },
    {
        "source_sentence": "如此凡聖常無常，而能在中為凡為聖，能常能無常開覆等事，乃是不可思議方便妙用耳。",
        "translation": "Thus, while worldlings and sages are permanent and impermanent, it's the marvelous function of inconceivable skillful means to be able to become worldlings and sages, and things that are permanent and impermanent, such as opening",
        "source": "T38n1768_001:0231a15_6"
    },
    {
        "source_sentence": "然此可有三道開覆：一、以凡覆聖，以聖開凡。",
        "translation": "Here, however, there are three paths that can be defiled: 1. by covering the noble with worldlings and opening up the worldling with the noble.",
        "source": "T38n1768_001:0231a17_7"
    },
    {
        "source_sentence": "二者、凡聖是實，覆涅槃凡聖方便。",
        "translation": "The second is that worldlings and sages are real, which cover nirvāṇa with the skillful means of worldlings and sages.",
        "source": "T38n1768_001:0231a18_8"
    },
    {
        "source_sentence": "今明凡聖有無，並是涅槃妙用，名之為開。",
        "translation": "Now, we'll explain that the existence and nonexistence of worldlings and sages are both the marvelous function of nirvāṇa, which is called enlightenment.",
        "source": "T38n1768_001:0231a19_9"
    },
    {
        "source_sentence": "三者、凡聖覆非凡聖方便，今始得顯涅槃非聖非凡，凡聖具足名之為開。",
        "translation": "3. Ordinary and noble people cover extraordinary and noble skillful means, and now they're just beginning to show that nirvāṇa is neither noble nor extraordinary, and ordinary and noble people are fully enlightened, which is called",
        "source": "T38n1768_001:0231a20_10"
    },
    {
        "source_sentence": "凡聖既爾，常無常亦然也。",
        "translation": "So it is with worldlings and sages, and so it is with permanence and impermanence.",
        "source": "T38n1768_001:0231a22_11"
    },
    {
        "source_sentence": "但凡聖中復有凡始凡終，聖始聖終，凡終聖始，聖始凡終。",
        "translation": "Among worldlings and saints, however, there are also worldlings beginning with worldlings and ending with worldlings, saints beginning with sages and ending with saints, worldlings ending with sages, and saints beginning with sages and ending with worldlings.",
        "source": "T38n1768_001:0231a22_12"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T38n1768_001:0231a24_0"
    },
    {
        "source_sentence": "昔託王宮而生為凡始，道場樹下成道為凡終。",
        "translation": "In the olden days, entrusting birth to the king's palace as the beginning of worldlings and establishing enlightenment under a tree at the site of enlightenment as the end of worldlings.",
        "source": "T38n1768_001:0231a24_1"
    },
    {
        "source_sentence": "成佛為聖始，雙林入滅為聖終。",
        "translation": "Becoming a buddha is the beginning of the noble, and entering and extinguishing both forests is the end of the noble.",
        "source": "T38n1768_001:0231a25_2"
    },
    {
        "source_sentence": "只聖始則凡終，凡終則聖始也。",
        "translation": "Only the beginning of the sage is the beginning of the worldling, and the end of the worldling is the beginning of the sage.",
        "source": "T38n1768_001:0231a25_3"
    },
    {
        "source_sentence": "開凡終為聖始，聖始則凡終者；",
        "translation": "The beginning of worldlings is the beginning of saints, and the beginning of saints is the beginning of worldlings.",
        "source": "T38n1768_001:0231a26_4"
    },
    {
        "source_sentence": "可得聖終為凡始，凡始則聖終不？",
        "translation": "Can you say that the beginning of a sage is the beginning of a worldling and that the beginning of a worldling is the end of a sage?",
        "source": "T38n1768_001:0231a27_5"
    },
    {
        "source_sentence": "解云：若通就實凡實聖則可例。",
        "translation": "Understanding says, If it's shared with real worldlings and real sages, then it can be an example.",
        "source": "T38n1768_001:0231a28_6"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T38n1768_001:0231a28_7"
    },
    {
        "source_sentence": "只起一有得斷常之心，無得正觀便斷，則凡始為聖終。",
        "translation": "When only one awareness of the acquisition of annihilation and eternalism is produced, and when there is no acquisition of meditative absorption or right attentiveness, then worldlings begin to be sages at the end.",
        "source": "T38n1768_001:0231a28_8"
    },
    {
        "source_sentence": "若無得正觀不觀，有得虛妄便起，則聖終為凡始也。",
        "translation": "If there's no attainment of right contemplation and no contemplation, and if there's falsehood that arises from attaining it, then the noble end is the beginning of worldlings.",
        "source": "T38n1768_001:0231b01_9"
    },
    {
        "source_sentence": "但此中如來一期凡聖方便只得凡終為聖始，聖始為凡終；",
        "translation": "In this case, however, the first stage of the Tathāgata’s path is that which leads to worldlings and saints. The cessation of worldlings is the beginning of the practice of the sages; the beginning of the saints is the end of",
        "source": "T38n1768_001:0231b02_10"
    },
    {
        "source_sentence": "不得聖終為凡始，凡始為聖終。",
        "translation": "The beginning of the worldling is the beginning of the saints, and the beginning of the worldling is the beginning of the saints.",
        "source": "T38n1768_001:0231b03_11"
    },
    {
        "source_sentence": "若進論，此間感息，他方現生；",
        "translation": "In the case of a progressive doctrine, it is projected to arise here and be produced in another place.",
        "source": "T38n1768_001:0231b04_12"
    },
    {
        "source_sentence": "則此土聖終，他國凡始也。",
        "translation": "Then the sages of this land will die, and the worldlings of other lands will begin.",
        "source": "T38n1768_001:0231b04_13"
    },
    {
        "source_sentence": "問：凡有始終，聖亦始終者？",
        "translation": "Question: Whatever has a beginning and an end, the noble one also has a beginning.",
        "source": "T38n1768_001:0231b05_14"
    },
    {
        "source_sentence": "無常有始終，常亦有始終不？",
        "translation": "Does impermanence have a beginning and a beginning? Does permanence also have a beginning and a beginning?",
        "source": "T38n1768_001:0231b06_15"
    },
    {
        "source_sentence": "常無常相對，無常有始終，常無始終；",
        "translation": "Conditioned and impermanent are opposed one to the other. Impermanent has a beginning and a beginning, and constancy has no beginning and no end.",
        "source": "T38n1768_001:0231b06_16"
    },
    {
        "source_sentence": "亦應凡聖相對，凡有始終，聖無始終。",
        "translation": "Ordinary dharmas have a beginning and an end, while saints do not have a beginning and an end.",
        "source": "T38n1768_001:0231b07_17"
    },
    {
        "source_sentence": "解云：小乘明凡聖皆是無常，故皆有始終。",
        "translation": "Understanding says, The lesser vehicle explains that both worldlings and sages are impermanent, so they all have beginning and end.",
        "source": "T38n1768_001:0231b08_18"
    },
    {
        "source_sentence": "大乘凡聖有二種：一者方便，則凡聖皆無常。",
        "translation": "There are two kinds of great vehicle worldlings and sages: the first is skillful means, which means that all worldlings and sages are impermanent.",
        "source": "T38n1768_001:0231b09_19"
    },
    {
        "source_sentence": "二者實義則無，此凡聖者，無始終也。",
        "translation": "Second, the real meaning is nonexistent, and this worldling or sage has no beginning or end.",
        "source": "T38n1768_001:0231b10_20"
    },
    {
        "source_sentence": "問者說無常覆常為覆，邪常之覆正常耶？",
        "translation": "Question: It is said that impermanent obstruction and eternal obstruction are always obstructions. Is the obstruction of what is false and eternal obstruction what is right?",
        "source": "T38n1768_001:0231b11_21"
    },
    {
        "source_sentence": "若昔無常但覆邪常，不覆正常者，昔說是凡但覆邪聖，不覆今正聖。",
        "translation": "If impermanence in the past only covered wrong permanence and didn't cover right, then it was said in the past that ordinary people but covered wrong sages and didn't cover right now.",
        "source": "T38n1768_001:0231b12_22"
    },
    {
        "source_sentence": "昔正覆今日聖，亦昔無常正覆今常。",
        "translation": "The past was correctly obstructed by the present sage, and the past impermanent is correctly obstructed by the present eternal.",
        "source": "T38n1768_001:0231b13_23"
    },
    {
        "source_sentence": "又難：若昔無常覆今常，不覆昔常者；",
        "translation": "Again this is a difficulty: If the impermanent of the past were to be covered by the permanence of the present, and it does not cover the permanence of the past.",
        "source": "T38n1768_001:0231b14_24"
    },
    {
        "source_sentence": "昔無常除今常，不除昔常，昔宜禁乳，則昔通除常。",
        "translation": "What was impermanent in the past is removed by what's permanent in the present, and what wasn't permanent in the past is removed. It's appropriate to prohibit milk in the past, so it's possible to remove permanence in the past.",
        "source": "T38n1768_001:0231b15_25"
    },
    {
        "source_sentence": "又，若無常覆今常者，未說今常，云何覆今常？",
        "translation": "Also, if something impermanent is covered by permanence and now permanent, how can it be covered by permanence in the present without saying that it's permanent?",
        "source": "T38n1768_001:0231b16_26"
    },
    {
        "source_sentence": "前說無常時可以今常覆昔無常，昔無常未有今常，何得言昔無常覆今耶？",
        "translation": "When it's said to be impermanent, it can now permanently cover the impermanence of the past. If the past was impermanent and there wasn't a present that's permanent, how could it be said that the past is impermanent and",
        "source": "T38n1768_001:0231b17_27"
    },
    {
        "source_sentence": "解此已如上諸佛本是常，昔隱不得說常，但說無常，故言無常覆常也。",
        "translation": "Understanding this, as above, the buddhas are originally permanent, and in the past they didn't teach permanence in seclusion but simply explained impermanence, so they said impermanent and covered by permanence.",
        "source": "T38n1768_001:0231b18_28"
    },
    {
        "source_sentence": "然此開覆則是如來藏義。",
        "translation": "However, this opening and closing is the meaning of the tathāgatagarbha.",
        "source": "T38n1768_001:0231b21_0"
    },
    {
        "source_sentence": "何故名如來藏？",
        "translation": "Why is it called the tathāgatagarbha?",
        "source": "T38n1768_001:0231b21_1"
    },
    {
        "source_sentence": "為當眾生藏如來，名「如來藏」；",
        "translation": "It is called the treasury of buddhas because it contains all enlightening beings’ teachings.",
        "source": "T38n1768_001:0231b21_2"
    },
    {
        "source_sentence": "為當如來自藏，名「如來藏」耶？",
        "translation": "Why should the tathāgatagarbha be called the tathāgatagarbha?",
        "source": "T38n1768_001:0231b22_3"
    },
    {
        "source_sentence": "然只此間，則是解竟，然具此二義：一者、眾生性顛倒隱覆如來性，故名「如來藏」；",
        "translation": "However, this is the only place where it's complete understanding, but it has these two meanings: 1. The nature of sentient beings is mistaken and conceals the tathāgata-nature; therefore, it's called the tathāgatagarbha.",
        "source": "T38n1768_001:0231b23_4"
    },
    {
        "source_sentence": "二者、眾生不堪聞如來之性，隱而不說，亦名「如來藏」。",
        "translation": "Second, sentient beings can't hear the Tathāgata's nature and hide it without explaining it, which is also called the tathāgatagarbha.",
        "source": "T38n1768_001:0231b24_5"
    },
    {
        "source_sentence": "今教顯一切眾生皆有佛性，佛性是「我」義。",
        "translation": "The present teaching shows that all sentient beings have buddha-nature, and the buddha-nature is the meaning of self.",
        "source": "T38n1768_001:0231b26_6"
    },
    {
        "source_sentence": "眾生依方等大教臨度斷除顛倒，則顯如來藏。",
        "translation": "When sentient beings rely on the vaipulya great teaching to liberate themselves from their mistaken views, then they reveal the tathāgatagarbha.",
        "source": "T38n1768_001:0231b27_7"
    },
    {
        "source_sentence": "藏顯則名法身。",
        "translation": "When the store is manifested, it's called the Dharma body.",
        "source": "T38n1768_001:0231b28_8"
    },
    {
        "source_sentence": "顯眾生有佛性，則顯眾生是佛性根本。",
        "translation": "To show that sentient beings have buddha-nature, then to show that sentient beings are the root of buddha-nature.",
        "source": "T38n1768_001:0231b28_9"
    },
    {
        "source_sentence": "眾生是佛故有佛性，非佛則不得有佛性。",
        "translation": "Sentient beings have buddha-nature because they are buddhas, and if they aren't buddhas, they can't have buddha-nature.",
        "source": "T38n1768_001:0231b29_10"
    },
    {
        "source_sentence": "如人姓張，郎則有張姓，非張則不得有張姓，佛性亦爾。",
        "translation": "Just as when someone's family name is Zhang, a man has Zhang's family name, and if it's not Zhang, they can't have Zhang's family name, so does the buddha-nature.",
        "source": "T38n1768_001:0231c01_11"
    },
    {
        "source_sentence": "故論云：非眾生身內有佛非密，身外有亦非密，四並非密。",
        "translation": "That's why the treatise says, It's not that there are buddhas inside the bodies of sentient beings that aren't esoteric, and what exists outside the body isn't esoteric, and the fourth is not esote",
        "source": "T38n1768_001:0231c02_12"
    },
    {
        "source_sentence": "眾生則是佛為密也。",
        "translation": "The sentient beings are the Buddha, which is the esoteric.",
        "source": "T38n1768_001:0231c04_13"
    },
    {
        "source_sentence": "有時難此義，何故有佛性非密則是佛為密耶？",
        "translation": "There are times when it's difficult to understand this meaning, so why is the buddha-nature not esoteric and the Buddha esoteric?",
        "source": "T38n1768_001:0231c04_14"
    },
    {
        "source_sentence": "有解云：有義則疎，是義則密。",
        "translation": "There's an interpretation that says, If there's meaning, it's distant; this meaning is esoteric.",
        "source": "T38n1768_001:0231c05_15"
    },
    {
        "source_sentence": "釋難眾生則是佛為密，有性不密者，眾生則佛性義深，眾生有佛性不深。",
        "translation": "The explanation explains that it's difficult to say that sentient beings are buddhas as esoteric and those with natures that aren't esoteric, because sentient beings have the meaning of buddha-nature being profound, and sentient being",
        "source": "T38n1768_001:0231c06_16"
    },
    {
        "source_sentence": "經云：眾生有佛性甚深，既有性為深，何意有佛性非密，不見好解(扶解孝奉落：疎密之語不言深不深者，",
        "translation": "The sūtras say, Sentient beings have a profound buddha-nature, and since their nature is profound, what's the point of having a buddha-nature that isn't esoteric and doesn't see well-understood? (",
        "source": "T38n1768_001:0231c08_17"
    },
    {
        "source_sentence": "如人。",
        "translation": "It's like a person.",
        "source": "T38n1768_001:0231c09_18"
    },
    {
        "source_sentence": "二人相近，即言密，不得言深。",
        "translation": "When the two people came close to each other, they said it was esoteric but not profound.",
        "source": "T38n1768_001:0231c09_19"
    },
    {
        "source_sentence": "若向何得言深淺？",
        "translation": "Where can we speak of depth or shallowness if we look at it?",
        "source": "T38n1768_001:0231c10_20"
    },
    {
        "source_sentence": "是亦如此。",
        "translation": "It's likewise.",
        "source": "T38n1768_001:0231c10_21"
    },
    {
        "source_sentence": "眾生即佛性，即相密；",
        "translation": "Sentient beings are buddha-nature, that is to say, their characteristics are esoteric.",
        "source": "T38n1768_001:0231c10_22"
    },
    {
        "source_sentence": "若單論佛性，即深。",
        "translation": "If we simply discuss the buddha-nature, it's profound.",
        "source": "T38n1768_001:0231c10_23"
    },
    {
        "source_sentence": "經云眾生有佛性甚深，是約佛性為言；",
        "translation": "The Sūtra says, Sentient beings have profound buddha-nature. This is a statement that speaks of buddha-nature.",
        "source": "T38n1768_001:0231c10_24"
    },
    {
        "source_sentence": "眾生即佛者，是約眾生為論。",
        "translation": "Those who say that sentient beings are buddhas are discussed in terms of sentient beings.",
        "source": "T38n1768_001:0231c11_25"
    },
    {
        "source_sentence": "所以眾生外，更無佛性。",
        "translation": "That's why there's no buddha-nature outside of sentient beings.",
        "source": "T38n1768_001:0231c11_26"
    },
    {
        "source_sentence": "故即是佛性與眾生不疎為密。",
        "translation": "That's why the buddha-nature and sentient beings aren't separate from each other as esoteric.",
        "source": "T38n1768_001:0231c11_27"
    },
    {
        "source_sentence": "是密義甚深，故有佛性甚深者乎云)。",
        "translation": "It's because the esoteric meaning is profound, so there's a profound buddha-nature that says it's profound.)",
        "source": "T38n1768_001:0231c11_28"
    },
    {
        "source_sentence": "問：地論亦隱顯義，與今何異？",
        "translation": "Question: The doctrine of the so-called ‘stage’ is also with a hidden meaning. How is it different from that of the present?",
        "source": "T38n1768_001:0231c12_29"
    },
    {
        "source_sentence": "解云：語雖同其意大異。",
        "translation": "The explanation says, Although the words are the same, their meanings are quite different.",
        "source": "T38n1768_001:0231c12_30"
    },
    {
        "source_sentence": "彼有如來藏體，為妄所覆名之為隱，復則現出此體名之為顯。",
        "translation": "They have the essence of the tathāgatagarbha, which is called concealment because it's covered by delusion, and this essence that comes out is called manifestation.",
        "source": "T38n1768_001:0231c13_31"
    },
    {
        "source_sentence": "如貧女寶藏，暗室瓶瓫，則用此譬為義。",
        "translation": "It's like the meaning of this metaphor when a poor woman's jeweled storehouse is obscured by a pot in a dark room.",
        "source": "T38n1768_001:0231c14_32"
    },
    {
        "source_sentence": "今則不爾。",
        "translation": "Now, that's not the case.",
        "source": "T38n1768_001:0231c15_33"
    },
    {
        "source_sentence": "此譬為破始有，故言本有，豈可守斯為定耶？",
        "translation": "This metaphor refutes the first existence, so it's said to exist in the past. How can we keep this as a constant?",
        "source": "T38n1768_001:0231c15_34"
    },
    {
        "source_sentence": "今明只迷故名隱名藏，豈尚別有此體可隱？",
        "translation": "Now, we're explaining that it's only because of delusion that it's called the hidden name store, so how could there be another essence that can be hidden?",
        "source": "T38n1768_001:0231c16_35"
    },
    {
        "source_sentence": "只悟故名顯，名法身無體可顯。",
        "translation": "It is only because of enlightenment that names are expressed, and the name dharma body has no essence to be expressed.",
        "source": "T38n1768_001:0231c17_36"
    },
    {
        "source_sentence": "迷故名隱，隱無所隱；",
        "translation": "Because of being deluded, it is called ‘hidden’: hidden and nothing hidden.",
        "source": "T38n1768_001:0231c18_37"
    },
    {
        "source_sentence": "悟故名顯，顯無所顯。",
        "translation": "Because of enlightenment, it is called ‘manifesting’: manifesting what is not manifesting.",
        "source": "T38n1768_001:0231c19_38"
    },
    {
        "source_sentence": "只迷因緣故隱，悟因緣故名顯。",
        "translation": "They are only hidden because of deluded causes and conditions; they are called manifest because of the causes and conditions of enlightenment.",
        "source": "T38n1768_001:0231c19_39"
    },
    {
        "source_sentence": "如箜喉之喻，無乎無棍等因緣則無聲，為隱，無別聲可隱在內；",
        "translation": "It is like the metaphor of a coarse throat, for which there is no sound without such causes and conditions as sticks. Because it is hidden, there is no separate sound to hide within.",
        "source": "T38n1768_001:0231c20_40"
    },
    {
        "source_sentence": "若因緣具足，聲則便出，無別聲可顯。",
        "translation": "If the causes and conditions are complete, then sound will come forth, and there won't be any separate sound to show.",
        "source": "T38n1768_001:0231c21_41"
    },
    {
        "source_sentence": "如來藏隱顯亦爾，不了因緣故隱，顯又如此，隱顯並出於緣。",
        "translation": "So it is with the tathāgatagarbha that it is hidden and revealed, because it does not understand causes and conditions. The same applies to its manifestation:",
        "source": "T38n1768_001:0231c22_42"
    },
    {
        "source_sentence": "緣未堪如此說，故為隱；",
        "translation": "Because the supporting object is unable to be explained in this way, it is therefore hidden.",
        "source": "T38n1768_001:0231c23_43"
    },
    {
        "source_sentence": "今皆聞之，故不隱。",
        "translation": "Now we've all heard it, so we won't hide it.",
        "source": "T38n1768_001:0231c24_44"
    },
    {
        "source_sentence": "乃出於緣，法身更何隱顯也！",
        "translation": "It comes from conditions, so why would the Dharma body be hidden or apparent?",
        "source": "T38n1768_001:0231c24_45"
    },
    {
        "source_sentence": "四、次半滿義。",
        "translation": "4. The next half is the meaning of completion.",
        "source": "T38n1768_001:0231c26_0"
    },
    {
        "source_sentence": "他云：昔無常為「半」，今常為「滿」。",
        "translation": "Others say that impermanence in the past is half, and permanence in the present is full.",
        "source": "T38n1768_001:0231c26_1"
    },
    {
        "source_sentence": "此有種種計不同：或云《般若》已上，《法華》已來是無常「半教」；",
        "translation": "There are various different theories here: some say that what's above the Prajñāpāramitā is impermanent since the Lotus Sutra and has been a half-teaching.",
        "source": "T38n1768_001:0231c26_2"
    },
    {
        "source_sentence": "唯《涅槃》常住，乃為「滿」字。",
        "translation": "The only thing that the Nirvāṇa is always abiding is the word full.",
        "source": "T38n1768_001:0231c28_3"
    },
    {
        "source_sentence": "難(云云)。",
        "translation": "It's difficult (as it says).",
        "source": "T38n1768_001:0231c28_4"
    },
    {
        "source_sentence": "又，彼明常無常云：斷明義，生死「無常」不通「常」；",
        "translation": "Furthermore, they clarify that permanence is impermanent and impermanent, saying: To eliminate means to explain that birth and death are impermanent but not eternal.",
        "source": "T38n1768_001:0231c28_5"
    },
    {
        "source_sentence": "涅槃「常」不通「無常」。",
        "translation": "Nirvāṇa is permanent, but it doesn't go along with impermanence.",
        "source": "T38n1768_001:0231c29_6"
    },
    {
        "source_sentence": "乃至金剛心無常不通「常」，佛果常不通「無常」。",
        "translation": "It goes so far as to say that the adamantine mind is impermanent and doesn't penetrate permanence, while the buddha-fruit is impermanent and doesn't penetrate impermanence.",
        "source": "T38n1768_001:0232a01_7"
    },
    {
        "source_sentence": "如此一握「無常」，一握是「常」。",
        "translation": "Thus, one hand is impermanent, and one hand is permanent.",
        "source": "T38n1768_001:0232a02_8"
    },
    {
        "source_sentence": "無常一握既「半」，常是一握亦「半」。",
        "translation": "Since the impermanent one hand is half, the eternal one hand is also half.",
        "source": "T38n1768_001:0232a02_9"
    },
    {
        "source_sentence": "今一家有時對此牽生死無常至佛果「常」，牽佛果常至生死「無常」，",
        "translation": "Now, there's a school that sometimes refers to the impermanence of birth-and-death as the eternal up to the Buddhahood as permanent and the impermanence of birth-and-death as impermanent.",
        "source": "T38n1768_001:0232a03_10"
    },
    {
        "source_sentence": "令彼兩處互通。",
        "translation": "It causes the two places to be mutually inclusive.",
        "source": "T38n1768_001:0232a05_11"
    },
    {
        "source_sentence": "無常邊亦「滿」，常邊亦「滿」。",
        "translation": "The limit of impermanence is also complete, and the limit of permanence is also complete.",
        "source": "T38n1768_001:0232a05_12"
    },
    {
        "source_sentence": "一家云：半邊滿，滿邊半。",
        "translation": "One family said, Half the sides are full, and half the sides are full.",
        "source": "T38n1768_001:0232a05_13"
    },
    {
        "source_sentence": "此非互語「半三斗，三斗半」，亦如「山在南，在山南」，豈可為一？",
        "translation": "This is not the mutual statement that it's half a three-and-a-half-dollar and three-and-a-half-dollar, which is also like saying that the mountain is south of the mountain and to the south of the mountain,",
        "source": "T38n1768_001:0232a06_14"
    },
    {
        "source_sentence": "今滿半、半滿亦有異義。",
        "translation": "Now, half-complete and half-complete also have different meanings.",
        "source": "T38n1768_001:0232a07_15"
    },
    {
        "source_sentence": "但此「有為」意：一者「滿半」圓偏語，「半滿」積足語。",
        "translation": "However, this is the meaning of conditioned: one, full and half are partial words that are perfect, and half-complete are words that are accumulated.",
        "source": "T38n1768_001:0232a08_16"
    },
    {
        "source_sentence": "「滿半」圓偏語者，明涅槃本來具足，緣未巧具聞圓旨，故說「無常」一邊名為「半」字。",
        "translation": "The half-complete partial statement explains that nirvāṇa is originally complete, and it's because they haven't skillfully heard the perfect teaching; therefore, one part of impermanent is called half.",
        "source": "T38n1768_001:0232a09_17"
    },
    {
        "source_sentence": "故經問：「云何解『滿』字及與『半』字義亦得道？",
        "translation": "That's why the sūtra asks, How does understanding the meaning of the words 'complete' and 'half' also attain enlightenment?",
        "source": "T38n1768_001:0232a11_18"
    },
    {
        "source_sentence": "云何解『半』字及與『滿』字義？",
        "translation": "How do you understand the meaning of the words half and full?",
        "source": "T38n1768_001:0232a12_0"
    },
    {
        "source_sentence": "但今得意，明涅槃具足圓滿。」",
        "translation": "But now that they've attained it, they'll understand that nirvāṇa is complete and perfect.",
        "source": "T38n1768_001:0232a12_1"
    },
    {
        "source_sentence": "為緣說「半」，故言「滿半」也。",
        "translation": "It's called half-complete because it's explained for the sake of conditions, so it's called half-complete.",
        "source": "T38n1768_001:0232a13_2"
    },
    {
        "source_sentence": "「半滿」是積足者，「無常」是「半」，「常」足為「滿」。",
        "translation": "The phrase half full refers to accumulation, the phrase impermanent refers to half, and the phrase permanent is sufficient for completion.",
        "source": "T38n1768_001:0232a13_3"
    },
    {
        "source_sentence": "「常」亦爾，故定知「半滿」大師戲言耳。",
        "translation": "So it is with constancy, so you must definitely know that the great master half-complete is a playful word.",
        "source": "T38n1768_001:0232a14_4"
    },
    {
        "source_sentence": "又，「滿半」是圓偏語，如前「半滿」是對治語。",
        "translation": "Furthermore, completion of half is partial speech that's perfect, and as before, half complete is antidote speech.",
        "source": "T38n1768_001:0232a15_5"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T38n1768_001:0232a16_6"
    },
    {
        "source_sentence": "汝言「常」是「滿」者，此「半邊滿」耳，有時明「常、無常」名「半邊滿」，",
        "translation": "You say that permanence is complete because it's halfway complete, but there are times when you say permanence and impermanence is called halfway complete.",
        "source": "T38n1768_001:0232a16_7"
    },
    {
        "source_sentence": "「常、無常」雙用名「滿邊半」也。",
        "translation": "The words eternal and impermanent are both used as the name half of the full extent.",
        "source": "T38n1768_001:0232a17_8"
    },
    {
        "source_sentence": "但一家釋「半滿」復有展轉明義。",
        "translation": "However, there's another one interpretation that explains the meaning of half-complete in terms of sequential clarity.",
        "source": "T38n1768_001:0232a18_9"
    },
    {
        "source_sentence": "一、無常為「半」常為「半」，無常為「半」常為「滿」；",
        "translation": "The first is that impermanence is “one-half” and permanence is “one-half”; impermanence is “one-half” and permanence is “complete”.",
        "source": "T38n1768_001:0232a18_10"
    },
    {
        "source_sentence": "二、常無常皆「半」，是常無常所，病皆洗除，盡名之為「滿」；",
        "translation": "The second is that both permanence and impermanence are called half. This is the abode of permanence and impermanence, and all illnesses are washed away, and they are all called complete.",
        "source": "T38n1768_001:0232a19_11"
    },
    {
        "source_sentence": "三者、常無常用「半」，非常非無常體「滿」。",
        "translation": "3. The function of permanence and impermanence is half, and the essence of neither permanence nor impermanence is full.",
        "source": "T38n1768_001:0232a20_12"
    },
    {
        "source_sentence": "體用異故，此體用、用體具足始為「滿」。",
        "translation": "Because the essence and function are different, this is the first time when the essence, function, and function are complete in their essence as fulfillment.",
        "source": "T38n1768_001:0232a21_13"
    },
    {
        "source_sentence": "無常為「半」，常為「滿」，別二邊高下。",
        "translation": "The impermanent is half, the eternal is full, and the two sides are distinct, high and low.",
        "source": "T38n1768_001:0232a22_14"
    },
    {
        "source_sentence": "若非常非無常，常無常具足，別二邊雙遊也。",
        "translation": "If it's neither eternal nor impermanent, permanence and impermanence are complete, and they travel separately and together at two sides.",
        "source": "T38n1768_001:0232a23_15"
    },
    {
        "source_sentence": "大師明無常復有四種：一病藥，二開覆，三半滿，四二邊。",
        "translation": "Again, the great teacher explains that there are four kinds of impermanence: 1. illness and medicine, 2. opening and closing, 3. half-complete, and 4. two sides.",
        "source": "T38n1768_001:0232a24_16"
    },
    {
        "source_sentence": "此四句無常云何不別？",
        "translation": "How are these four phrases impermanent and not distinct?",
        "source": "T38n1768_001:0232a25_17"
    },
    {
        "source_sentence": "解云：病藥無常者，以無常治常，常病既去，無常之藥亦除。",
        "translation": "Understanding says, The medicine for illness is impermanent because it's impermanent to treat permanence, and once the disease of permanence has gone away, the medicine for impermanence will also be removed.",
        "source": "T38n1768_001:0232a26_18"
    },
    {
        "source_sentence": "如三修耶，常雖去猶存無常，故成尤疾。",
        "translation": "Just as in the case of the three cultivations, even though permanence is removed, it still remains impermanent and therefore becomes especially swift.",
        "source": "T38n1768_001:0232a27_19"
    },
    {
        "source_sentence": "所以文云王今病重故也。",
        "translation": "That's why the text says that the king is seriously ill now.",
        "source": "T38n1768_001:0232a28_20"
    },
    {
        "source_sentence": "此一向須寫寫矣。",
        "translation": "This is always necessary to write it down.",
        "source": "T38n1768_001:0232a28_21"
    },
    {
        "source_sentence": "開覆無常如前，以無常覆常，復是道無常者，常不除無常也。",
        "translation": "The opening and covering are impermanent as before because they are impermanent and the covering is impermanent, and this is another way to say that the path is impermanent, which means permanence doesn't remove impermanence.",
        "source": "T38n1768_001:0232a29_22"
    },
    {
        "source_sentence": "半滿無常，昔說無常為半，今還明無常為滿。",
        "translation": "The half-complete impermanent is impermanent, and in the past it was said to be impermanent as half; now it's again explained that impermanence is complete.",
        "source": "T38n1768_001:0232b01_23"
    },
    {
        "source_sentence": "又昔說無常不了故為半，今明無常顯了，生死無常、佛果常住，字義具足為滿也。",
        "translation": "Also, in the past, it was said that impermanence wasn't understood as half, but now it's explained that impermanence is manifested, birth-and-death is impermanent, and the Buddha's fruit is always abiding, and",
        "source": "T38n1768_001:0232b02_24"
    },
    {
        "source_sentence": "二邊無常者，此二恒俱，豈得除無常明常？",
        "translation": "The two extremes are impermanent: since these two are simultaneous and eternal, how can one explain permanence by excluding impermanence?",
        "source": "T38n1768_001:0232b04_25"
    },
    {
        "source_sentence": "但二邊有前後，尤有高下，充竝充等義。",
        "translation": "However, the two extremes are preceded by and following one another; in particular, they are high and low. Such is the meaning of being filled with such [things] as emptiness, etc.",
        "source": "T38n1768_001:0232b05_26"
    },
    {
        "source_sentence": "第二明經宗旨。",
        "translation": "The second explains the purpose of the sūtras.",
        "source": "T38n1768_001:0232b07_0"
    },
    {
        "source_sentence": "古來明宗體異，以常住為宗，文言為體。",
        "translation": "The ancient teachings explain that the essence of the doctrine is different, with eternally abiding as the doctrine and words as the essence.",
        "source": "T38n1768_001:0232b07_1"
    },
    {
        "source_sentence": "今一家明只宗是體，豈異體別有宗？",
        "translation": "Now, one school explains that only the doctrine is the essence, so isn't there a separate doctrine apart from the essence?",
        "source": "T38n1768_001:0232b08_2"
    },
    {
        "source_sentence": "大師云：今解釋此，茲國所無。",
        "translation": "The great teacher said, Now, explain that this is not found in this country.",
        "source": "T38n1768_001:0232b09_3"
    },
    {
        "source_sentence": "汝何處得此義耶？",
        "translation": "Where did you get this meaning?",
        "source": "T38n1768_001:0232b09_4"
    },
    {
        "source_sentence": "云稟關河，傳於攝領，攝領得大乘之正意者。",
        "translation": "It's called gathering the correct meaning of the great vehicle that reaches the border and transmitting it to the collector, who collects and receives it.",
        "source": "T38n1768_001:0232b10_5"
    },
    {
        "source_sentence": "若是諸師皆悉推片，不熟看經論，妄引候文，失於圓旨。",
        "translation": "If these masters had all pushed for a piece, they wouldn't have studied the sūtras and treatises well; they would have mistakenly cited the text in order to lose its perfect meaning.",
        "source": "T38n1768_001:0232b11_6"
    },
    {
        "source_sentence": "如聞佛性者名第一義空，便種種解釋，或云從境為名，或云即於真諦。",
        "translation": "If someone hears that the buddha-nature is called emptiness in the first sense, they'll explain it in various ways, either by naming it from its object or by referring to it as the true truth.",
        "source": "T38n1768_001:0232b12_7"
    },
    {
        "source_sentence": "彼云：佛性是智，第一義空是境，但智即境，故云佛性名第一義空。",
        "translation": "They say, The buddha-nature is cognition, and the emptiness of the ultimate truth is the object, but cognition is the object; therefore, they say that the buddha-nature is called the emptiness of the ultimate truth.",
        "source": "T38n1768_001:0232b13_8"
    },
    {
        "source_sentence": "又云：佛性是俗諦，但俗即真故，云佛性名第一義空也。",
        "translation": "It's also said, The buddha-nature is the conventional truth, but the conventional is the true thing, so it's called the ultimate emptiness of the buddha-nature.",
        "source": "T38n1768_001:0232b15_9"
    },
    {
        "source_sentence": "今明此語未足。",
        "translation": "Now, we'll explain that these words aren't enough.",
        "source": "T38n1768_001:0232b16_10"
    },
    {
        "source_sentence": "佛性者名第一義空，智者見空及以不空，此始成一句耳，是故發初與他異。",
        "translation": "The buddha-nature is called emptiness of the ultimate truth, and wisdom sees emptiness and what's not emptiness; this is the first phrase that makes it different from others because it gives rise to the first difference.",
        "source": "T38n1768_001:0232b17_0"
    },
    {
        "source_sentence": "他明此經以常為宗，今初辨常者，乃倒寫之用，未是正意。",
        "translation": "Others explain that this sūtra uses permanence as the doctrine, but the first part of the explanation of permanence is to mistakenly write about its function, which isn't the correct meaning.",
        "source": "T38n1768_001:0232b18_1"
    },
    {
        "source_sentence": "常是藥用，豈會開正宗？",
        "translation": "How can you explain the correct doctrine if you always use it for medicinal purposes?",
        "source": "T38n1768_001:0232b20_0"
    },
    {
        "source_sentence": "前藥治前病，後藥治後病。",
        "translation": "The former medicine treats the former illness, and the latter medicine treats the later illness.",
        "source": "T38n1768_001:0232b20_1"
    },
    {
        "source_sentence": "常是藥用，常為宗者；",
        "translation": "They are always for the use of medicine and always as the doctrine.",
        "source": "T38n1768_001:0232b21_2"
    },
    {
        "source_sentence": "無常是藥，亦應以無常為宗。",
        "translation": "Impermanent is the medicine, and impermanent should also be the doctrine.",
        "source": "T38n1768_001:0232b21_3"
    },
    {
        "source_sentence": "彼云：後藥治後病，後藥為後經宗；",
        "translation": "It is said that the later medicine cures later ailments. The later medicine is the doctrine of the later scriptures.",
        "source": "T38n1768_001:0232b22_4"
    },
    {
        "source_sentence": "前藥治前病，前藥為前經宗。",
        "translation": "The former medicine cures the former illness, and the former medicine is the doctrine of the former sūtra.",
        "source": "T38n1768_001:0232b23_0"
    },
    {
        "source_sentence": "今明前藥為前經宗，前經有無量種，豈得併以無常為經前宗？",
        "translation": "Now, we'll explain that the prior medicine is the doctrine of the prior sūtra, and there are measureless kinds in the prior sūtras, so how can we combine impermanence as the doctrine before the sūtra with impermanence?",
        "source": "T38n1768_001:0232b23_1"
    },
    {
        "source_sentence": "既不可無常為宗，後經寧得以常為宗？",
        "translation": "Since impermanence cannot be the doctrine, how can permanence be the doctrine of later scriptures?",
        "source": "T38n1768_001:0232b25_2"
    },
    {
        "source_sentence": "今對彼故以無得為宗，汝以常為宗，文何所出？",
        "translation": "Now, you take nongrasping as the doctrine because it's opposed to that, and you take permanence as the doctrine, so what does the text say?",
        "source": "T38n1768_001:0232b25_3"
    },
    {
        "source_sentence": "我今依經文自云：「無得者名大涅槃」，故無所得此經宗也。",
        "translation": "Now, I rely on the sūtras and texts to say, The absence of attainment is called great nirvāṇa, so there's no attainment of this doctrine of the sūtra.",
        "source": "T38n1768_001:0232b27_0"
    },
    {
        "source_sentence": "又亦汝言涅槃定常不得無常，斯則常故，常名有所得；",
        "translation": "You also say that nirvana is always fixed, but does not admit of impermanence. Because it is permanent, permanence is called acquired.",
        "source": "T38n1768_001:0232b28_1"
    },
    {
        "source_sentence": "有所得者，乃名生死，何謂涅槃？",
        "translation": "What's meant by nirvāṇa when someone has attained it?",
        "source": "T38n1768_001:0232b29_2"
    },
    {
        "source_sentence": "彼云我亦有得、無得義。",
        "translation": "It's said that self also has the meaning of attaining and not attaining.",
        "source": "T38n1768_001:0232c01_3"
    },
    {
        "source_sentence": "至忘為無得，彌存為有得。",
        "translation": "Until forgetfulness is the absence of attainment, and abiding is the existence of attainment.",
        "source": "T38n1768_001:0232c01_4"
    },
    {
        "source_sentence": "今責汝妄不可為存，存不可為妄。",
        "translation": "Now, I'm blaming you for not being able to preserve what's false and not being able to preserve what's false.",
        "source": "T38n1768_001:0232c02_5"
    },
    {
        "source_sentence": "真絕不可待，俗待不可絕。",
        "translation": "What is true cannot be cut off, and what is conventional cannot be cut off.",
        "source": "T38n1768_001:0232c03_6"
    },
    {
        "source_sentence": "還成有所得。",
        "translation": "It's still accomplished with attainment.",
        "source": "T38n1768_001:0232c03_7"
    },
    {
        "source_sentence": "何謂無得耶？",
        "translation": "What is meant by nonacquisition?",
        "source": "T38n1768_001:0232c04_0"
    },
    {
        "source_sentence": "又，彼義真諦中不得有樂，不得有一乘也；",
        "translation": "Furthermore, they do not obtain happiness in the truth of meaning and do not obtain a single vehicle.",
        "source": "T38n1768_001:0232c04_1"
    },
    {
        "source_sentence": "我、樂、一乘並是世諦；",
        "translation": "The self, bliss and the One Vehicle are all worldly truths.",
        "source": "T38n1768_001:0232c05_2"
    },
    {
        "source_sentence": "又，於汝證言生死無常，涅槃是常，大眾聞之何所悟？",
        "translation": "Furthermore, you've realized that birth and death are impermanent, and nirvāṇa is permanent, so what will the masses hear about it and realize?",
        "source": "T38n1768_001:0232c05_3"
    },
    {
        "source_sentence": "故云涅槃不可定常，不可定無常，非待非不待，不可思議，聞者悟也！",
        "translation": "That's why it's said that nirvāṇa is indeterminate and impermanent, indeterminate and impermanent, neither waiting nor not waiting, inconceivable, and enlightened by the hearers!",
        "source": "T38n1768_001:0232c06_4"
    },
    {
        "source_sentence": "只無所得故不可思議，無所得為經宗也。",
        "translation": "Because there's nothing to be attained, it's inconceivable, and the absence of attainment is the doctrine of the sūtras.",
        "source": "T38n1768_001:0232c08_5"
    },
    {
        "source_sentence": "他難云：汝以無得釋經宗為是者，我亦以常釋經宗亦是。",
        "translation": "It's difficult for others to say, 'Do you regard the doctrine of the ungraspable interpretation of the sūtras as this?' I also regard the doctrine of the eternal interpretation of the sūtras as it is.",
        "source": "T38n1768_001:0232c09_6"
    },
    {
        "source_sentence": "解云：常無常雖經說，而有病故，則無所得義生。",
        "translation": "The explanation says, Even though the sūtras say that permanence and impermanence are permanent and impermanent, if there's illness, then there's no acquired meaning that arises.",
        "source": "T38n1768_001:0232c10_7"
    },
    {
        "source_sentence": "經云：雖不常住非念念滅，此已常無常兩除。",
        "translation": "The sūtra says, Although it's not eternally abiding and neither mindfulness nor cessation, this is already eternal and impermanent except for the two.",
        "source": "T38n1768_001:0232c11_8"
    },
    {
        "source_sentence": "次復明涅槃非常無常，常無常俱洗。",
        "translation": "Next, it's also explained that nirvāṇa is neither permanent nor impermanent, and both permanence and impermanence are washed together.",
        "source": "T38n1768_001:0232c12_9"
    },
    {
        "source_sentence": "如〈德王〉中說：何偏得以常為宗耶？",
        "translation": "As it's said in the Sutra of King of Virtue, what is the partial way to make permanence the doctrine?",
        "source": "T38n1768_001:0232c13_10"
    },
    {
        "source_sentence": "無得之義，始終無行，故以為宗也。",
        "translation": "The meaning of nongrasping is that there's no practice in the beginning and no practice in the end, so it's considered a doctrine.",
        "source": "T38n1768_001:0232c14_11"
    },
    {
        "source_sentence": "問：有得名生死，無得名涅槃，則有得名無常，無得名為常，得無得還是常無常。",
        "translation": "\\",
        "source": "T38n1768_001:0232c15_12"
    },
    {
        "source_sentence": "云何捨常、無常而用得、無得耶？",
        "translation": "How do you abandon permanence and impermanence and use it for attaining and not attaining?",
        "source": "T38n1768_001:0232c16_13"
    },
    {
        "source_sentence": "解云：若定用無得為是還成有得，不名無所得。",
        "translation": "It's explained that if it's determined to use the absence of attainment as what's attained, then it's still attained, and it's not called having no attainment.",
        "source": "T38n1768_001:0232c17_14"
    },
    {
        "source_sentence": "一無所依乃名無得，無得通常無常。",
        "translation": "The absence of anything to rely upon is called the absence of attainment, and the absence of attainment is always impermanent.",
        "source": "T38n1768_001:0232c18_15"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T38n1768_001:0232c19_16"
    },
    {
        "source_sentence": "彼云生死無常、涅槃常，如此常無常並有所得；",
        "translation": "They say that birth and death are impermanent and nirvana are permanent. Thus, both permanence and impermanence have attainments.",
        "source": "T38n1768_001:0232c19_17"
    },
    {
        "source_sentence": "今明常明無常，因緣假名字說，無有無常可有，亦無有常之可得。",
        "translation": "Now, it's explained that impermanence explains impermanence, and the causes and conditions are nominally described as impermanent and impermanent, which can exist, and there's no permanence that can be obtained.",
        "source": "T38n1768_001:0232c20_18"
    },
    {
        "source_sentence": "一無所住故名無所得也。",
        "translation": "One is that there's nothing to abide in, so it's called having no attainment.",
        "source": "T38n1768_001:0232c22_19"
    },
    {
        "source_sentence": "又，他常無常智斷明義，生死無常涅槃常。",
        "translation": "Furthermore, the wisdom that others are permanent and impermanent and stops insight means that birth-and-death is impermanent and nirvāṇa is permanent.",
        "source": "T38n1768_001:0232c22_20"
    },
    {
        "source_sentence": "前心無常後心常，故是有所得。",
        "translation": "Because the former mind is impermanent and the latter mind is permanent, it's acquired.",
        "source": "T38n1768_001:0232c23_21"
    },
    {
        "source_sentence": "今明諸法未曾常、無常，或說常或說無常，諸法實相行常無常也。",
        "translation": "Now, it's clear that all dharmas have never been permanent or impermanent, whether they're said to be permanent or impermanent, and the true characteristics and practices of dharmas are always impermanent.",
        "source": "T38n1768_001:0232c24_22"
    },
    {
        "source_sentence": "然無所得非但是此經宗，通是一切大乘之正意也。",
        "translation": "However, what's ungraspable isn't just the doctrine of this sūtra, but it's the correct meaning of all the great vehicles.",
        "source": "T38n1768_001:0232c25_23"
    },
    {
        "source_sentence": "第三釋名。",
        "translation": "The third explains the name.",
        "source": "T38n1768_001:0232c28_0"
    },
    {
        "source_sentence": "此中復為三：第一明異名，第二翻名，第三絕名。",
        "translation": "Here, there are three more: the first explains dissimilar names, the second translates names, and the third extinguishes names.",
        "source": "T38n1768_001:0232c28_1"
    },
    {
        "source_sentence": "初明異名者：或云泥洹，或云泥曰。",
        "translation": "The first explains the different names: Some say nirvāṇa, or some say nirvāṇa.",
        "source": "T38n1768_001:0232c29_2"
    },
    {
        "source_sentence": "肇師云：「彼國楚夏不同耳」。",
        "translation": "The master Zhao said, That country's Chu Xia is different from that.",
        "source": "T38n1768_001:0233a01_3"
    },
    {
        "source_sentence": "大亮云：「涅槃者異俗之音，音有楚夏，涅槃正中天竺之音也」。",
        "translation": "Mahāprajñāpāramitā said, Nirvāṇa is a distasteful sound that has Chu Xia for its sound, and nirvāṇa is precisely the sound of Central India.",
        "source": "T38n1768_001:0233a01_4"
    },
    {
        "source_sentence": "或云：「此三名目於三本，《泥曰》此是中本，《泥洹》是六卷經，《涅槃》則此大本」。",
        "translation": "Some people say, These three names are found in three texts, the Nirvana is the middle text, the Nirvāṇa is a six-fascicle sūtra, and the Nirvāṇa is the main text.",
        "source": "T38n1768_001:0233a03_0"
    },
    {
        "source_sentence": "今謂未必然也。",
        "translation": "Now, it's called not yet certain.",
        "source": "T38n1768_001:0233a04_1"
    },
    {
        "source_sentence": "大本亦得名大泥洹經也。",
        "translation": "The great text can also be called the Great Nirvana Sutra.",
        "source": "T38n1768_001:0233a04_2"
    },
    {
        "source_sentence": "次翻名。",
        "translation": "The next one is to translate the name.",
        "source": "T38n1768_001:0233a06_0"
    },
    {
        "source_sentence": "且明摩訶義，此是外國音。",
        "translation": "Furthermore, it's clear that this is a foreign sound for mahā.",
        "source": "T38n1768_001:0233a06_1"
    },
    {
        "source_sentence": "此雖有三義，正翻為大。",
        "translation": "Although these have three meanings, they are correctly translated as great.",
        "source": "T38n1768_001:0233a06_2"
    },
    {
        "source_sentence": "《金光明》云：「摩訶提婆此云大天」。",
        "translation": "The Golden Light says, Mahādeva, which is called the great heaven.",
        "source": "T38n1768_001:0233a07_3"
    },
    {
        "source_sentence": "又今既標大意，何須更標？",
        "translation": "Also, since we're labeling the main idea now, why should we label it again?",
        "source": "T38n1768_001:0233a08_0"
    },
    {
        "source_sentence": "但大有多義，依此經凡有六義：一常故大。",
        "translation": "However, there are many meanings of greatness. According to this sūtra, there are six meanings: 1. Because it is permanent, it is great.",
        "source": "T38n1768_001:0233a08_1"
    },
    {
        "source_sentence": "所言大者，名之為常。",
        "translation": "When it's called great, it's called permanent.",
        "source": "T38n1768_001:0233a09_2"
    },
    {
        "source_sentence": "然無常二得名大，而終不及常。",
        "translation": "However, the two attainments of impermanence and impermanence are called great but ultimately inferior to permanence.",
        "source": "T38n1768_001:0233a10_3"
    },
    {
        "source_sentence": "大薪大火。",
        "translation": "It's a great fire of wood and fire.",
        "source": "T38n1768_001:0233a10_4"
    },
    {
        "source_sentence": "大薪不及火，常無常亦爾也。",
        "translation": "The great firewood doesn't match the fire, and so is permanence and impermanence.",
        "source": "T38n1768_001:0233a11_0"
    },
    {
        "source_sentence": "二者廣故大。",
        "translation": "Second, it's large because it's vast.",
        "source": "T38n1768_001:0233a11_1"
    },
    {
        "source_sentence": "所以然者，經云：所言大者，其性廣博，廣博故大也。",
        "translation": "The reason for this is that the sūtras say, What's called great because its nature is vast and extensive, and because it's vast and extensive, it's great.",
        "source": "T38n1768_001:0233a11_2"
    },
    {
        "source_sentence": "三者高故名大。",
        "translation": "Three, it's called great because it's high.",
        "source": "T38n1768_001:0233a13_3"
    },
    {
        "source_sentence": "經云：譬如大山，一切世人所不能上，故名大山；",
        "translation": "The Sūtra says: Just as a great mountain cannot be climbed by anyone in the world, so it is called a great mountain.",
        "source": "T38n1768_001:0233a13_4"
    },
    {
        "source_sentence": "涅槃亦爾，聲聞緣覺及諸菩薩所不能上，是故名大。",
        "translation": "So it is with nirvāṇa, which śrāvakas, pratyekbuddhas, and bodhisattvas can't go up; therefore, it's called great.",
        "source": "T38n1768_001:0233a14_5"
    },
    {
        "source_sentence": "四、深故大。",
        "translation": "4. because it's profound, it's great.",
        "source": "T38n1768_001:0233a15_6"
    },
    {
        "source_sentence": "經云：大名不可思議，一切世人所不能測，是故名大也。",
        "translation": "The sūtras say, Great name is inconceivable and cannot be fathomed by anyone in the world; therefore, it's called great.",
        "source": "T38n1768_001:0233a15_7"
    },
    {
        "source_sentence": "五者多故名大。",
        "translation": "Five, it's called great because it's numerous.",
        "source": "T38n1768_001:0233a17_8"
    },
    {
        "source_sentence": "經云：譬如大城，多諸珍寶故名大城；",
        "translation": "The Sūtra says: Just as a great city is called a great city because it contains many treasures.",
        "source": "T38n1768_001:0233a17_9"
    },
    {
        "source_sentence": "涅槃亦爾，多諸法寶故名為大。",
        "translation": "So it is with nirvāṇa, which is called great because it contains many treasures of the Dharma.",
        "source": "T38n1768_001:0233a18_10"
    },
    {
        "source_sentence": "六者勝故名大。",
        "translation": "Sixth, it's called great because it's superior.",
        "source": "T38n1768_001:0233a19_0"
    },
    {
        "source_sentence": "譬如有人，於人中勝故名大；",
        "translation": "Good man, this is analogous to the case of a person who is called great because he prevails among men.",
        "source": "T38n1768_001:0233a19_1"
    },
    {
        "source_sentence": "涅槃亦爾，勝於一切，故名為大也。",
        "translation": "So it is with nirvāṇa, which is called great because it's superior to all.",
        "source": "T38n1768_001:0233a20_0"
    },
    {
        "source_sentence": "雖有六大名不出二種：一體大，二用大。",
        "translation": "Although there are six great names, they aren't two kinds: one is great in essence and two are great in function.",
        "source": "T38n1768_001:0233a20_1"
    },
    {
        "source_sentence": "體大者則是法性也，涅槃者則諸佛之法性也。",
        "translation": "The greatness of essence is the Dharma nature, and nirvāṇa is the Dharma nature of the buddhas.",
        "source": "T38n1768_001:0233a21_2"
    },
    {
        "source_sentence": "用大者八自在我故名用大也。",
        "translation": "The greatness of function is the eight kinds of self-dependence, so it's called greatness of function.",
        "source": "T38n1768_001:0233a22_3"
    },
    {
        "source_sentence": "又有二大：一待大、二絕大，然此無二，只待則絕因緣則空故也。",
        "translation": "Again, there are two kinds of greatness: one that depends on the greatness and two that cut off the greatness, but these are not two, because it's only dependent that cuts off the causes and conditions that make it empty.",
        "source": "T38n1768_001:0233a23_4"
    },
    {
        "source_sentence": "次明涅槃義。",
        "translation": "Next, he explains the meaning of nirvāṇa.",
        "source": "T38n1768_001:0233a25_0"
    },
    {
        "source_sentence": "前摩訶題既標大更無異釋，翻涅槃則眾解不同，或言無翻、言有翻。",
        "translation": "Since the previous title of Mahāprajñāpāramitā labels the great, there's no different explanation, and when translating nirvāṇa, the many interpretations are different, or they may say there's no translation or there is a translation.",
        "source": "T38n1768_001:0233a25_1"
    },
    {
        "source_sentence": "今略出無翻四師，有翻六師。",
        "translation": "Now, we'll briefly present the four masters who don't translate, and there are six masters who translate.",
        "source": "T38n1768_001:0233a26_2"
    },
    {
        "source_sentence": "無翻四師者：第一、大亮師明涅槃無翻。",
        "translation": "The four untranslated masters are: first, the great luminous master explains that nirvāṇa is untranslated.",
        "source": "T38n1768_001:0233a27_3"
    },
    {
        "source_sentence": "彼云：涅槃是如來神通之極號，常樂八味之都名。",
        "translation": "They say, Nirvāṇa is the ultimate name of the Tathāgata's supernormal powers, and it's the common name for the eight flavors of permanence and bliss.",
        "source": "T38n1768_001:0233a28_4"
    },
    {
        "source_sentence": "涅槃是異俗之名，名有楚夏，前後互出乃有三名。",
        "translation": "Nirvāṇa is a name that's different from the secular, and it's called Chu Xia; there are three names that appear before and after each other.",
        "source": "T38n1768_001:0233a29_5"
    },
    {
        "source_sentence": "涅槃正是中天竺之音名含眾義，此方無一名以譯之，存其胡本焉。",
        "translation": "Nirvāṇa is precisely the sound of the name in Central India that contains many meanings, and there's no one here who translates it to preserve the Hu text.",
        "source": "T38n1768_001:0233b01_6"
    },
    {
        "source_sentence": "此遠述河西乃至大濟，皆同此說也。",
        "translation": "This is a distant account of the same explanation as that given here, from the west of the river up to Daji.",
        "source": "T38n1768_001:0233b03_7"
    },
    {
        "source_sentence": "第二、瑤師亦云無翻。",
        "translation": "Second, the teacher Yao also says it's untranslated.",
        "source": "T38n1768_001:0233b03_8"
    },
    {
        "source_sentence": "彼師序云：稱包眾理，名冠眾義，一名之中有無量名，楚音無以譯其稱，",
        "translation": "That teacher prefaced it by saying, Names embrace all principles, and names are the crown of all meanings. In one name there are innumerable names; Chu sounds have no way to translate their names.",
        "source": "T38n1768_001:0233b04_9"
    },
    {
        "source_sentence": "晉言無以代其號者，故不可翻。",
        "translation": "The Jin dynasty says that there's no way to replace its name, so it can't be translated.",
        "source": "T38n1768_001:0233b05_10"
    },
    {
        "source_sentence": "第三、寶亮師亦云不可翻。",
        "translation": "Third, the master Bao Liang also said it couldn't be translated.",
        "source": "T38n1768_001:0233b06_11"
    },
    {
        "source_sentence": "彼序云：涅槃是出世法總名，貫眾法之通號。",
        "translation": "The preface says, Nirvāṇa is the general name for supramundane dharmas and the common name for all dharmas.",
        "source": "T38n1768_001:0233b07_12"
    },
    {
        "source_sentence": "然此之語乃方土之音，聖既出彼國，此亦無名以正翻，但文詶況指，義釋而已。",
        "translation": "However, these words are the sounds of their native land, and since the sages have emerged from that country, there's no name here to correctly translate them, but the text only refers to them in terms of meaning and interpretation.",
        "source": "T38n1768_001:0233b08_13"
    },
    {
        "source_sentence": "第四、知秀師亦云不可翻。",
        "translation": "Fourth, Zhixiong also said that it's untranslable.",
        "source": "T38n1768_001:0233b10_0"
    },
    {
        "source_sentence": "彼師序云：涅槃是圓極至住之總名也，然因迹見名，見名知本。",
        "translation": "That teacher prefaced it by saying, Nirvāṇa is the general name for the perfect ultimate abode of abiding, but because of its traces, he sees names and names as knowing the source.",
        "source": "T38n1768_001:0233b10_1"
    },
    {
        "source_sentence": "名迹之興肇自天竺，我大梁亦應有稱。",
        "translation": "The rise of name and traces began in India, but our Great Liang should also have a name.",
        "source": "T38n1768_001:0233b11_2"
    },
    {
        "source_sentence": "但弘道之近，既發軫西域於未測，此方以「伊」譯翻，是以前賢後哲，",
        "translation": "But as the great path of enlightenment was so near, it had already arisen in the Western Regions, which were unfathomable, and this region translated it with the letter i. This is a translation of the old sages and philosophers",
        "source": "T38n1768_001:0233b12_3"
    },
    {
        "source_sentence": "皆順舊本述而不作，故題之經道。",
        "translation": "They all follow the old explanation and aren't made, so they're titled the sūtras and paths.",
        "source": "T38n1768_001:0233b14_4"
    },
    {
        "source_sentence": "此四師並云涅槃不可翻。",
        "translation": "These four masters all say that nirvāṇa can't be translated.",
        "source": "T38n1768_001:0233b15_5"
    },
    {
        "source_sentence": "彼明不可翻有文有義：義者，涅槃是圓德，圓德立圓名，故不可一名翻；",
        "translation": "The meaning is that nirvana is a perfect quality. Because perfect qualities establish perfect names, they cannot be translated in one name.",
        "source": "T38n1768_001:0233b15_6"
    },
    {
        "source_sentence": "二者有文者，三點成涅槃，故不可一名翻也。",
        "translation": "The second is that there's a text, because the three dots form nirvāṇa, so it can't be translated in one name.",
        "source": "T38n1768_001:0233b17_7"
    },
    {
        "source_sentence": "今作五難難云：一、作大悲不等難。",
        "translation": "Now, he creates five difficulties and difficulties, saying, 1. He creates an unequal difficulty of great compassion.",
        "source": "T38n1768_001:0233b18_8"
    },
    {
        "source_sentence": "彼國有總名，此間無圓稱。",
        "translation": "That country has a general name, but there's no perfect name here.",
        "source": "T38n1768_001:0233b19_0"
    },
    {
        "source_sentence": "如來但念彼土眾生不受此方，今殘彼有圓名解義，此無圓名則不解圓義，",
        "translation": "The Tathāgata only thinks of the sentient beings in that land as not accepting this direction, but now he leaves out the meaning of perfect names and understandings. If there are no perfect names here, then they don't understand the perfect meaning.",
        "source": "T38n1768_001:0233b19_1"
    },
    {
        "source_sentence": "故悲不爾，涅槃來於此土便成無益也。",
        "translation": "Therefore, if that's not the case with compassion, then nirvāṇa comes to this land and becomes useless.",
        "source": "T38n1768_001:0233b21_2"
    },
    {
        "source_sentence": "第二、就今昔相決難。",
        "translation": "Second, it's a difficulty to resolve the distinction between present and past.",
        "source": "T38n1768_001:0233b22_3"
    },
    {
        "source_sentence": "今昔皆涅槃，應皆可翻。",
        "translation": "The present and the past are all nirvāṇa, and they should all be translatable.",
        "source": "T38n1768_001:0233b22_4"
    },
    {
        "source_sentence": "然今不可翻，可是涅槃；",
        "translation": "But now it cannot be overturned, for it is nirvana.",
        "source": "T38n1768_001:0233b23_5"
    },
    {
        "source_sentence": "昔可翻，昔應非涅槃。",
        "translation": "The past can be translated, but the past shouldn't be nirvāṇa.",
        "source": "T38n1768_001:0233b23_6"
    },
    {
        "source_sentence": "昔不具足涅槃，今具足不可翻；",
        "translation": "In the past it was not endowed with nirvana, but now it is endowed with that which cannot be transgressed.",
        "source": "T38n1768_001:0233b24_7"
    },
    {
        "source_sentence": "昔不具足則可翻者，則難今具足可是涅槃，昔不具足應非涅槃。",
        "translation": "If it weren't complete in the past, then it could have been translated, so it would be difficult to say that what's complete now is nirvāṇa, and what's not complete in the past wouldn't be nirvāṇa.",
        "source": "T38n1768_001:0233b24_8"
    },
    {
        "source_sentence": "第三、約摩訶難涅槃。",
        "translation": "Third, it's about Mahāprajñāpāramitā-parinirvāṇa.",
        "source": "T38n1768_001:0233b26_9"
    },
    {
        "source_sentence": "涅槃是摩訶涅槃，涅槃既不可翻，摩訶是涅槃，摩訶涅槃亦不可翻。",
        "translation": "Nirvāṇa is mahā-nirvāṇa, and since nirvāṇa can't be translated, mahā-nirvāṇa is nirvāṇa, and mahā-nirvāṇa can't be translated either.",
        "source": "T38n1768_001:0233b26_10"
    },
    {
        "source_sentence": "又，摩訶含三義，翻摩訶者涅槃含三德，亦一解說翻涅槃也，若言摩訶非圓名，",
        "translation": "Also, mahā contains three meanings, and translating mahā means nirvāṇa that nirvāṇa contains the three virtues, which are also explained in one interpretation as translating nirvāṇa. If someone says mahā is not a",
        "source": "T38n1768_001:0233b28_11"
    },
    {
        "source_sentence": "涅槃是圓名者，此摩訶非涅槃摩訶，涅槃非摩訶涅槃也。",
        "translation": "Nirvāṇa is the perfect name, which means that this mahā is not nirvāṇa-mahā, and nirvāṇa is not mahā-nirvāṇa.",
        "source": "T38n1768_001:0233c01_12"
    },
    {
        "source_sentence": "涅槃含三德，名既圓；",
        "translation": "Because nirvana contains the three virtues, it is called perfect.",
        "source": "T38n1768_001:0233c02_13"
    },
    {
        "source_sentence": "摩訶含三義，摩訶亦是圓名。",
        "translation": "Mahā contains three meanings, and mahā is also the perfect name.",
        "source": "T38n1768_001:0233c02_14"
    },
    {
        "source_sentence": "皆不可翻也，皆可翻也。",
        "translation": "They can't be translated, and they can be translated.",
        "source": "T38n1768_001:0233c03_15"
    },
    {
        "source_sentence": "第四、難涅槃不可翻，則涅槃一部並壞。",
        "translation": "Fourth, it's difficult for nirvāṇa to be overturned, and then one part of nirvāṇa will be destroyed at the same time.",
        "source": "T38n1768_001:0233c04_16"
    },
    {
        "source_sentence": "涅槃發初，晨朝唱告般涅槃，一切大眾皆悉悲惱。",
        "translation": "At the beginning of his nirvāṇa, he called out in the morning to announce parinirvāṇa, and all the masses were grieved.",
        "source": "T38n1768_001:0233c04_17"
    },
    {
        "source_sentence": "純陀云：「雖知如來方便涅槃，而我等不能不懷悲惱」。",
        "translation": "Cunda said, Even though we know the Tathāgata's skillful means of nirvāṇa, we can't help but harbor compassion.",
        "source": "T38n1768_001:0233c06_18"
    },
    {
        "source_sentence": "既是眾德，大眾及純陀何事悲苦？",
        "translation": "Since these are all virtues, what's the matter of compassion and suffering for the masses and Cunda?",
        "source": "T38n1768_001:0233c07_19"
    },
    {
        "source_sentence": "又《現病品》云：「倚臥鶴樹間，下愚凡夫見尚言必涅槃」。",
        "translation": "Furthermore, the chapter on the present illness says, lying in a crane's nest under a tree, foolish mortals who see it still say they'll surely enter nirvāṇa.",
        "source": "T38n1768_001:0233c08_0"
    },
    {
        "source_sentence": "若是眾德，下愚豈能得見？",
        "translation": "If this is a multitude of virtues, how can the inferior foolish see them?",
        "source": "T38n1768_001:0233c09_1"
    },
    {
        "source_sentence": "若見眾德，乃是上智，何故名下愚？",
        "translation": "If someone sees that all virtues are superior wisdom, why is it called inferior folly?",
        "source": "T38n1768_001:0233c09_2"
    },
    {
        "source_sentence": "故不可。",
        "translation": "Therefore, it's not allowed.",
        "source": "T38n1768_001:0233c10_3"
    },
    {
        "source_sentence": "第五、總別難。",
        "translation": "The fifth is the difficulty of general and specific.",
        "source": "T38n1768_001:0233c10_4"
    },
    {
        "source_sentence": "彼有圓偏名，彼有總別；",
        "translation": "They have partial names such as perfect, while those have general and specific names.",
        "source": "T38n1768_001:0233c11_0"
    },
    {
        "source_sentence": "此但偏名無圓名，此但有別無總。",
        "translation": "This is only a partial name and not a perfect name, but here there are only distinct names and no general names.",
        "source": "T38n1768_001:0233c11_1"
    },
    {
        "source_sentence": "此彼皆有總別名，彼此皆有圓偏名也。",
        "translation": "These all have general and specific names, and each has a partial name for both.",
        "source": "T38n1768_001:0233c12_2"
    },
    {
        "source_sentence": "次出有翻六師，翻者無量，略明六師。",
        "translation": "Next, there are six masters who have translated it, and the translators are immeasurable, briefly explaining the six masters.",
        "source": "T38n1768_001:0233c14_0"
    },
    {
        "source_sentence": "第一、道生法師翻為滅，其義訓乃自多方，正名為滅，經論皆爾也。",
        "translation": "The first, translated as cessation by the teacher Daosheng Fashi, is a teaching that explains its meaning in many ways, which is precisely called cessation, and so are the sūtras and treatises.",
        "source": "T38n1768_001:0233c14_1"
    },
    {
        "source_sentence": "第二、肇師翻之以「滅度」，秦言「無為」，亦言「滅度」。",
        "translation": "Second, the teacher Zhaoshi translates it as cessation. The Qin word for cessation is nonexistence, and it's also called cessation.",
        "source": "T38n1768_001:0233c16_2"
    },
    {
        "source_sentence": "以虛無寂漠，妙絕有為，名曰無為；",
        "translation": "Because of the absence of emptiness in space, it is called nonproductivity because it transcends conditioned things.",
        "source": "T38n1768_001:0233c17_3"
    },
    {
        "source_sentence": "以其大患永滅，超度四流，故云滅度。",
        "translation": "Because their great afflictions are permanently extinguished and they transcend the four streams, it's called extinction.",
        "source": "T38n1768_001:0233c18_4"
    },
    {
        "source_sentence": "他家不同，滅則語法，度則目人。",
        "translation": "It's different from other schools, which say that cessation is the teaching and liberation is the eye.",
        "source": "T38n1768_001:0233c18_5"
    },
    {
        "source_sentence": "法本有今無，人從此到彼。",
        "translation": "The Dharma existed in the past but does not exist now. People travel from one place to another.",
        "source": "T38n1768_001:0233c19_6"
    },
    {
        "source_sentence": "又云：實人實法皆滅，假名人法悉度也。",
        "translation": "It's also said that real people and real dharmas all cease, and it's assumed that names and dharmas are completely liberated.",
        "source": "T38n1768_001:0233c20_7"
    },
    {
        "source_sentence": "又，滅者凡聖皆滅，度則簡異凡夫，凡夫滅已後生不得稱度，大聖一滅永不復生，",
        "translation": "Furthermore, cessation means that all worldlings and sages are extinguished. The way to be liberated is simply different from ordinary people. After the nirvana of worldlings, beings who have arisen can no longer be called liberated",
        "source": "T38n1768_001:0233c21_8"
    },
    {
        "source_sentence": "故稱之曰度。",
        "translation": "That's why it's called salvation.",
        "source": "T38n1768_001:0233c22_9"
    },
    {
        "source_sentence": "第三、太原宗師翻解脫。",
        "translation": "Third, Taiyuanzong's teacher translated the title of liberation.",
        "source": "T38n1768_001:0233c23_10"
    },
    {
        "source_sentence": "彼云：涅槃者，累盡之通名，萬善之號。",
        "translation": "They say, 'Nirvāṇa is the general name for the exhaustion of accumulation and the name for all goodness.'",
        "source": "T38n1768_001:0233c23_11"
    },
    {
        "source_sentence": "涅槃是天竺之音，此正言解脫，如經說也。",
        "translation": "Nirvāṇa is the sound of India, which correctly means liberation as explained in the sutra.",
        "source": "T38n1768_001:0233c24_12"
    },
    {
        "source_sentence": "乃至開善等，翻為無累也。",
        "translation": "It's even the same as opening up goodness and so forth, which is translated as having no burden.",
        "source": "T38n1768_001:0233c25_13"
    },
    {
        "source_sentence": "第四、宣武竉師翻為大寂定。",
        "translation": "Fourth, Xuan Wu's master translated it as the great quiescent concentration.",
        "source": "T38n1768_001:0233c26_14"
    },
    {
        "source_sentence": "經云：涅槃名大寂定也。",
        "translation": "The sūtras say, Nirvāṇa is called the great quiescent concentration.",
        "source": "T38n1768_001:0233c26_15"
    },
    {
        "source_sentence": "第五、仙師翻不生。",
        "translation": "Fifth, the sage teacher explains that it doesn't arise.",
        "source": "T38n1768_001:0233c27_16"
    },
    {
        "source_sentence": "梁武用對煩惱不名涅槃，煩惱不生乃名涅槃也。",
        "translation": "Liang Wu uses the name nirvāṇa to address afflictions that aren't called nirvāṇa, and when afflictions don't arise, it's called nirvāṇa.",
        "source": "T38n1768_001:0233c27_17"
    },
    {
        "source_sentence": "第六、影師翻安樂。",
        "translation": "Sixth, the teacher of the shadow translates it as peaceful.",
        "source": "T38n1768_001:0233c28_18"
    },
    {
        "source_sentence": "不安則名生死，安樂則是涅槃。",
        "translation": "An unsettled mind is called birth and death, and a peaceful mind is nirvāṇa.",
        "source": "T38n1768_001:0233c29_19"
    },
    {
        "source_sentence": "北人云：般涅槃那翻入息。",
        "translation": "The northerners say, parinirvāṇa is translated by entering and exhaling.",
        "source": "T38n1768_001:0233c29_20"
    },
    {
        "source_sentence": "入有三種：一實論，謂息妄歸真，從因趣果，故名入；",
        "translation": "There are three kinds of sense operation:",
        "source": "T38n1768_001:0234a01_21"
    },
    {
        "source_sentence": "二者真應相對，息化歸真名入；",
        "translation": "The second is that which accords with reality and corresponds to it. Entry is called ‘entry’ when the cessation of apparitional beings returns to reality.",
        "source": "T38n1768_001:0234a02_22"
    },
    {
        "source_sentence": "三但就應為言，謂捨有為入無為，名入也。",
        "translation": "The third is only in relation to what should be done, that is, when one abandons conditioned and enters the unconditioned.",
        "source": "T38n1768_001:0234a03_23"
    },
    {
        "source_sentence": "涅槃正翻為滅，若隨義翻不生解脫等。",
        "translation": "Nirvāṇa is correctly translated as cessation. If one translates it according to its meaning, liberation and so on do not arise.",
        "source": "T38n1768_001:0234a04_24"
    },
    {
        "source_sentence": "問：若正翻滅，何故下文云滅諸結火名滅度，離覺觀故名涅槃？",
        "translation": "Question: Why is it stated in the text that extinguishing fetters and fires is called ‘cessation’? Because of being free from initial thought and sustained thought*”°, it is called ‘parinirvana’.",
        "source": "T38n1768_001:0234a06_0"
    },
    {
        "source_sentence": "外國滅名不同，諸結火滅名「彌留陀」；",
        "translation": "The names of extinction in the foreign countries are different, and the extinction of the bonds and fires is called Miliṇḍa.",
        "source": "T38n1768_001:0234a07_1"
    },
    {
        "source_sentence": "離覺觀名「涅槃那也」，言息，究竟解脫永蘇息。",
        "translation": "Being free of perception and contemplation is called nirvāṇa, which means to say that the ultimate liberation is permanently calmed.",
        "source": "T38n1768_001:0234a08_2"
    },
    {
        "source_sentence": "息有三：一息因果患。",
        "translation": "There are three kinds of cessation: 1. the affliction of cessation as cause and effect.",
        "source": "T38n1768_001:0234a09_3"
    },
    {
        "source_sentence": "二息諸事業。",
        "translation": "The second is to stop all works.",
        "source": "T38n1768_001:0234a09_4"
    },
    {
        "source_sentence": "諸事業者，文云：「雖得禪定、智慧、解脫，不名畢竟，若能斷除三十七品所行之事，",
        "translation": "The practitioners said, Even though they attain meditation, wisdom, and liberation, they aren't called ultimate. If they can eliminate the thirty-seven works practiced in the thirty-seven chapters,",
        "source": "T38n1768_001:0234a10_0"
    },
    {
        "source_sentence": "乃名畢竟涅槃也」。",
        "translation": "That's called final nirvāṇa.",
        "source": "T38n1768_001:0234a11_1"
    },
    {
        "source_sentence": "前諸師定言不可翻，具如前難。",
        "translation": "The previous masters said with certainty that it cannot be translated, as explained in the previous difficulty.",
        "source": "T38n1768_001:0234a12_2"
    },
    {
        "source_sentence": "今復定言可翻，亦彼研覈叡師《大品序》云：秦言謬者定之以字義，胡音失者正之以天竺，",
        "translation": "Again, the Mahaparinirmita-vaśavartin says in the Mahāprajñāpāramitā-sūtra: The Qin [Chinese] word for error is determined by its syllable meaning, while the Sanskrit for error is",
        "source": "T38n1768_001:0234a12_3"
    },
    {
        "source_sentence": "不可變者則而出，今既出以涅槃則是不可翻，云何言可翻耶？",
        "translation": "What's immutable then comes out, and now that it's emerging because of nirvāṇa, it can't be translated, so how can you say it can be translated?",
        "source": "T38n1768_001:0234a14_4"
    },
    {
        "source_sentence": "今更別難為兩意：來生肇等翻為滅為一難，來宗師等翻解脫無累為一難。",
        "translation": "Now, there are two further specific difficulties: the coming birth of Zhao and so forth is translated as cessation as one difficulty, and the coming doctrine teacher and so forth are translated as liberation without burden as one",
        "source": "T38n1768_001:0234a16_5"
    },
    {
        "source_sentence": "若言涅槃翻為解脫，栖神無累何事憂悲耶？",
        "translation": "If he says nirvāṇa is translated as liberation, what's the matter of grief that pervades his mind without burden?",
        "source": "T38n1768_001:0234a18_0"
    },
    {
        "source_sentence": "又云滅諸結火名為滅度，離覺觀故名為涅槃。",
        "translation": "It's also said that extinguishing the bonds and fires is called cessation, and it's called nirvāṇa because it's free of perception and contemplation.",
        "source": "T38n1768_001:0234a19_0"
    },
    {
        "source_sentence": "既涅槃滅度兩出別，知不以滅度翻涅槃，然生肇等師親承什師並共翻譯，",
        "translation": "Since both nirvana and cessation are distinct, it is known that they do not translate nirvana by means of cessation.",
        "source": "T38n1768_001:0234a20_1"
    },
    {
        "source_sentence": "豈當有謬而釋彈片耶？",
        "translation": "Shouldn't there be a mistake in explaining the commentary?",
        "source": "T38n1768_001:0234a21_2"
    },
    {
        "source_sentence": "今明不破生肇，今古人彈其定翻者耳，若定言翻滅度則過之甚也。",
        "translation": "Now, it's clear that they don't refute the birth of Zhao, and the present and ancient people criticize him for translating it with concentration, but if he were to translate it with concentration and extinguishes it with words,",
        "source": "T38n1768_001:0234a22_3"
    },
    {
        "source_sentence": "問：汝今云何作此問者且反彼？",
        "translation": "Question: How do you now make this inquiry and go against them?",
        "source": "T38n1768_001:0234a23_4"
    },
    {
        "source_sentence": "汝言涅槃為有名為無名而問翻無翻耶，而未知有名無名而更問翻無翻，",
        "translation": "You say that nirvana has names and names but does not have names, yet you ask about translating without translating. Why do you not know that there are names and names but also ask about translating?",
        "source": "T38n1768_001:0234a24_5"
    },
    {
        "source_sentence": "如未知兔頭有角無角而問菟角若為長短耶？",
        "translation": "Suppose someone doesn't know that the horns of a rabbit have horns and no horns, but asks whether the horns of a crow are long or short?",
        "source": "T38n1768_001:0234a26_6"
    },
    {
        "source_sentence": "翻無翻亦爾，無名是本，翻無翻是末也。",
        "translation": "The same applies to translated and untranslated. Namelessness is the root; translated and untranslated are the derivative.",
        "source": "T38n1768_001:0234a27_7"
    },
    {
        "source_sentence": "然此義有齊不齊，定其齊者，涅槃未曾名未曾無名，未曾翻未曾無翻。",
        "translation": "However, this meaning is limited and unequal. To determine whether it is limited or unequal means that nirvana has never been named, never abbreviated, and never translated.",
        "source": "T38n1768_001:0234a28_8"
    },
    {
        "source_sentence": "則非名非無名，非翻非無翻。",
        "translation": "Then it's neither called nor nameless, and neither translated nor non-translated.",
        "source": "T38n1768_001:0234a29_9"
    },
    {
        "source_sentence": "故經云：「大涅槃者不可得聞。",
        "translation": "That's why the sūtra says, Great nirvāṇa can't be heard.",
        "source": "T38n1768_001:0234b01_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T38n1768_001:0234b02_11"
    },
    {
        "source_sentence": "非有為故，非無為故，非音聲故，不可說故」，故知非名；",
        "translation": "Because they are not conditioned, because they are not unconditioned, because they are not sounds, and because they cannot be spoken of. Therefore, they are not names.",
        "source": "T38n1768_001:0234b02_12"
    },
    {
        "source_sentence": "亦可得聞，以聞故，故知非無名。",
        "translation": "It can also be heard, and because it's heard, it's known that it isn't nameless.",
        "source": "T38n1768_001:0234b03_13"
    },
    {
        "source_sentence": "所以涅槃非名，所以涅槃非無名，強立名。",
        "translation": "That is why nirvana is not a name. That is why nirvana is not without a name but forcibly establishes a name.",
        "source": "T38n1768_001:0234b04_14"
    },
    {
        "source_sentence": "非但強立名，亦強言無名。",
        "translation": "Not only does he forcibly establish names, but he also forcibly states that there are no names.",
        "source": "T38n1768_001:0234b05_15"
    },
    {
        "source_sentence": "則非名非無名，施名施無名；",
        "translation": "Then it is neither nameless nor nameless. Giving is called ‘giving’ and giving has no name.",
        "source": "T38n1768_001:0234b05_16"
    },
    {
        "source_sentence": "亦非翻非無翻，強翻強無翻也。",
        "translation": "It's neither translated nor untranslated, and it's strongly translated and strongly untranslated.",
        "source": "T38n1768_001:0234b06_17"
    },
    {
        "source_sentence": "言不齊者，明涅槃非名無名強為涅槃立名，就強名中論翻不翻。",
        "translation": "When it's called not the same, it means that nirvāṇa is neither named nor nameless and forcibly establishes a name for nirvāṇa, which is discussed in terms of whether it's translated or not.",
        "source": "T38n1768_001:0234b07_18"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T38n1768_001:0234b08_19"
    },
    {
        "source_sentence": "涅槃別總故翻而無翻，涅槃總別故無翻而翻。",
        "translation": "Because nirvana is specific and general, it is translated but not translated; because nirvana is general and specific, it is translated but not translated.",
        "source": "T38n1768_001:0234b08_20"
    },
    {
        "source_sentence": "不翻而翻亦名為滅度，亦名無累解脫等；",
        "translation": "What is not overturned but overturned is also called nirvana. It is also called liberation free from the burden and so on.",
        "source": "T38n1768_001:0234b09_21"
    },
    {
        "source_sentence": "翻而不翻，則三德圓滿無所不含。",
        "translation": "When it's translated but not translated, the three virtues are complete and nothing is included.",
        "source": "T38n1768_001:0234b10_22"
    },
    {
        "source_sentence": "豈可以一義翻耶？",
        "translation": "How could it be translated in a single meaning?",
        "source": "T38n1768_001:0234b11_23"
    },
    {
        "source_sentence": "故涅槃具總別義，故具有翻不翻也。",
        "translation": "Therefore, nirvāṇa has a general and a specific meaning, so it has both translations and non-translations.",
        "source": "T38n1768_001:0234b11_24"
    },
    {
        "source_sentence": "又就今昔論總別，有四句義：自有總是別非，合曰三德涅槃也；",
        "translation": "Also, in the discussion of the general characteristics of the present and the past, there are four alternative interpretations: The self exists but always does not exist separately. Altogether, it is nirvana of the three qualities.",
        "source": "T38n1768_001:0234b13_0"
    },
    {
        "source_sentence": "自有別是而總非，如昔日涅槃唯是斷無為涅槃也；",
        "translation": "As in the past, nirvana is only cessation of unconditioned nirvana.",
        "source": "T38n1768_001:0234b14_1"
    },
    {
        "source_sentence": "總別俱是者，昔別是今總是；",
        "translation": "“The general and the specific are both”: Distinct from the past, they are always present in the present.",
        "source": "T38n1768_001:0234b15_2"
    },
    {
        "source_sentence": "俱非者，昔總非今別非也。",
        "translation": "Neither means that the past is neither general nor specific, and the present is neither.",
        "source": "T38n1768_001:0234b16_3"
    },
    {
        "source_sentence": "次明今□涅槃。",
        "translation": "Next, he explains the present □ nirvāṇa.",
        "source": "T38n1768_001:0234b16_4"
    },
    {
        "source_sentence": "目論總別是非四句義，何者為其相？",
        "translation": "What are the general and specific meanings of the four sentences in the Abhidharma-mahāvibhāga?",
        "source": "T38n1768_001:0234b17_5"
    },
    {
        "source_sentence": "一往就因緣為論，明總是別非，是是非也。",
        "translation": "First, it's a treatise on causes and conditions that explains that what's always different from what's right is right.",
        "source": "T38n1768_001:0234b18_0"
    },
    {
        "source_sentence": "言總則得別，道是則得非。",
        "translation": "When stating that it is general, there is acquisition of what is specific; when the path is right, there is acquisition of what is wrong.",
        "source": "T38n1768_001:0234b18_1"
    },
    {
        "source_sentence": "若言總不得別，則別非總。",
        "translation": "If you say that the general can't obtain the specific, then the specific is not the general.",
        "source": "T38n1768_001:0234b19_2"
    },
    {
        "source_sentence": "別道是不得非，此是非非。",
        "translation": "The different paths are the acquisition of what is not acquired and what is right. This is right or wrong.",
        "source": "T38n1768_001:0234b20_3"
    },
    {
        "source_sentence": "今總是別總，總是別，則是即也。",
        "translation": "Now, it's always distinct in general and always distinct in particular, which is the same thing.",
        "source": "T38n1768_001:0234b20_4"
    },
    {
        "source_sentence": "今別是總別，別非總，即非也。",
        "translation": "Now, distinctions are general and specific, and distinctions aren't general, which means they aren't.",
        "source": "T38n1768_001:0234b21_5"
    },
    {
        "source_sentence": "若論以意者，此言已是，而人心有得不能云悟。",
        "translation": "If we talk about the mind, this is a statement that's already been said, but there's attainment in the mind and it can't be called awakening.",
        "source": "T38n1768_001:0234b22_6"
    },
    {
        "source_sentence": "障教之徒好依字，今復須示其文處。",
        "translation": "Those who obstruct the teaching like to rely on words, but now we must show them where they are written.",
        "source": "T38n1768_001:0234b23_7"
    },
    {
        "source_sentence": "總是別非者，如《哀歎品》三德縱橫，皆非三德圓，其乃是也。",
        "translation": "What's always distinct and what's not is like the three virtues of the Compassionate Chapter that are vertical and horizontal, but they aren't all perfected by the three virtues, which is true.",
        "source": "T38n1768_001:0234b23_8"
    },
    {
        "source_sentence": "別是總非者，如下文：佛名覺，涅槃名解脫。",
        "translation": "What's distinct and what's not general is as follows: Buddha is called awakening, and nirvāṇa is called liberation.",
        "source": "T38n1768_001:0234b25_9"
    },
    {
        "source_sentence": "又涅槃名果，果取斷不取智也。",
        "translation": "Also, nirvāṇa is called the result, which is the knowledge of grasping and not grasping as a result.",
        "source": "T38n1768_001:0234b26_10"
    },
    {
        "source_sentence": "次總別無定，一切皆總皆別。",
        "translation": "The next is general and the second is specific. There is no fixed rule: all are general and all are specific.",
        "source": "T38n1768_001:0234b26_11"
    },
    {
        "source_sentence": "若當涅槃總三德別，有時三德總涅槃別，一切皆是般若，皆是解脫，有涅槃成祕藏。",
        "translation": "If nirvāṇa were to be divided into three virtues in general, and sometimes the three virtues would be divided into nirvāṇa in general, everything would be prajñā, and all would be liberation, and there would be nirvā",
        "source": "T38n1768_001:0234b27_12"
    },
    {
        "source_sentence": "如《四相品》說，涅槃為別也。",
        "translation": "As the Chapter on the Four Characteristics explains, nirvāṇa is distinct.",
        "source": "T38n1768_001:0234b29_13"
    },
    {
        "source_sentence": "《大品》云攝一切善法入般若，是般若為總也。",
        "translation": "The Mahāprajñāpāramitā says that all good qualities are collected into prajñā, which is the general of prajñā.",
        "source": "T38n1768_001:0234c01_0"
    },
    {
        "source_sentence": "然今因涅槃總別，則議涅槃別總必具此二義，若偏取一義，則未識涅槃通意也。",
        "translation": "However, now that the cause of nirvāṇa is general and distinct, then it's discussed that nirvāṇa must have both these two meanings in a specific and general way, and if we were to take one meaning partially, we wouldn't know",
        "source": "T38n1768_001:0234c02_0"
    },
    {
        "source_sentence": "第三明絕名。",
        "translation": "The third explains that it's called cutting off names.",
        "source": "T38n1768_001:0234c04_0"
    },
    {
        "source_sentence": "古來明真諦與涅槃絕不絕，凡有三說不同。",
        "translation": "Since ancient times, it's been explained that the true truth and nirvāṇa are neither cut off nor cut off, but there are three different explanations.",
        "source": "T38n1768_001:0234c04_1"
    },
    {
        "source_sentence": "一云、二皆不絕。",
        "translation": "One, it's said that both are not cut off.",
        "source": "T38n1768_001:0234c05_2"
    },
    {
        "source_sentence": "真諦有真如實際之名，涅槃有常樂我淨之稱；",
        "translation": "The true truth has the name of reality as suchness, while nirvana has the name permanence, bliss, self, and purity.",
        "source": "T38n1768_001:0234c05_3"
    },
    {
        "source_sentence": "而言絕者，乃絕生死世俗患累之名，若見美妙之名則不絕。",
        "translation": "To say that it's cut off means to cut off the names of worldly afflictions in birth-and-death, and if one sees beautiful and wonderful names, they won't be cut off.",
        "source": "T38n1768_001:0234c06_4"
    },
    {
        "source_sentence": "第二、明二種皆絕。",
        "translation": "Second, it explains that the two kinds are all cut off.",
        "source": "T38n1768_001:0234c08_5"
    },
    {
        "source_sentence": "真如本自寂絕布微，非名所及，涅槃亦爾，言語道斷心行處滅也。",
        "translation": "True thusness itself is originally extinguished and spreads subtly, but it's beyond the range of names, and so is nirvāṇa, which is the cessation of the path of words and the place of mental functioning.",
        "source": "T38n1768_001:0234c08_6"
    },
    {
        "source_sentence": "第三師云：真諦絕、涅槃不絕。",
        "translation": "The third teacher said, The true truth is cut off and nirvāṇa isn't cut off.",
        "source": "T38n1768_001:0234c09_7"
    },
    {
        "source_sentence": "是俗諦乃有，則真義尚論。",
        "translation": "When the conventional truth exists, then the true meaning is still discussed.",
        "source": "T38n1768_001:0234c10_8"
    },
    {
        "source_sentence": "涅槃終是俗諦，是續待二假。",
        "translation": "Nirvāṇa is ultimately a conventional truth, which continues to await the two hypotheses.",
        "source": "T38n1768_001:0234c11_9"
    },
    {
        "source_sentence": "莊嚴明涅槃二諦攝，開善明是俗諦攝，故不絕。",
        "translation": "The adornment explains that nirvāṇa is included in the two truths, and the initiation of goodness explains that it's included in the conventional truth, so it doesn't stop.",
        "source": "T38n1768_001:0234c11_10"
    },
    {
        "source_sentence": "今次第難之。",
        "translation": "Now, we'll explain it in order.",
        "source": "T38n1768_001:0234c12_11"
    },
    {
        "source_sentence": "難第一家：真諦涅槃皆不絕則違經文。",
        "translation": "It's difficult for the first school: If the true truth and nirvāṇa are not cut off, then it's contrary to the sūtras.",
        "source": "T38n1768_001:0234c13_12"
    },
    {
        "source_sentence": "經云：「涅槃非名，強為之名」。",
        "translation": "The sūtras say, Nirvāṇa is not a name but forcing it to be a name.",
        "source": "T38n1768_001:0234c14_13"
    },
    {
        "source_sentence": "又云：「非名非相，非待非不待」。",
        "translation": "It's also said, What's not called and what's not characterized is neither awaited nor unawaited.",
        "source": "T38n1768_001:0234c14_14"
    },
    {
        "source_sentence": "云何言不絕耶？",
        "translation": "How can it be said not to be cut off?",
        "source": "T38n1768_001:0234c15_15"
    },
    {
        "source_sentence": "若言涅槃無生死之名為絕者，亦應生死無涅槃名，生死亦絕。",
        "translation": "If it's said that nirvāṇa has no names for birth-and-death, then birth-and-death should also have no names for nirvāṇa, and birth-and-death will also cease.",
        "source": "T38n1768_001:0234c15_16"
    },
    {
        "source_sentence": "若互無，為互絕者；",
        "translation": "If they are mutually nonexistent, it is because they are mutually exclusive.",
        "source": "T38n1768_001:0234c17_17"
    },
    {
        "source_sentence": "亦應互無，應互妙。",
        "translation": "They should also be mutually nonexistent, and they should be mutually wonderful.",
        "source": "T38n1768_001:0234c17_18"
    },
    {
        "source_sentence": "不可互妙耶！",
        "translation": "They can't be mutually marvelous!",
        "source": "T38n1768_001:0234c17_19"
    },
    {
        "source_sentence": "互絕耶！",
        "translation": "Are they mutually exclusive?",
        "source": "T38n1768_001:0234c18_20"
    },
    {
        "source_sentence": "又肇師依《涅槃論》明涅槃無名，云何涅槃不絕？",
        "translation": "Also, according to the Nirvāṇa-śāstra, how can nirvāṇa be unceasing if it's explained that nirvāṇa has no name?",
        "source": "T38n1768_001:0234c18_21"
    },
    {
        "source_sentence": "斯則乖關河舊說，復違涅槃正文也。",
        "translation": "This is inconsistent with the old sayings of the Guanghe River and also inconsistent with the correct meaning of nirvana.",
        "source": "T38n1768_001:0234c19_22"
    },
    {
        "source_sentence": "難第二解：明涅槃斷言語、絕心行、無名無相，所以是絕者，亦不然。",
        "translation": "The second explanation of the difficulty is: It explains that nirvāṇa stops speech, stops mental functioning, and has no names or marks, so it's not the case that it's cut off.",
        "source": "T38n1768_001:0234c20_23"
    },
    {
        "source_sentence": "若涅槃絕同真諦絕者，亦應涅槃同真諦頑。",
        "translation": "If nirvāṇa is cut off in the same way as the true truth is cut off, then nirvāṇa should also be stubborn in the same way as the true truth.",
        "source": "T38n1768_001:0234c21_24"
    },
    {
        "source_sentence": "涅槃不可同真諦頑者，則涅槃不可同真諦絕。",
        "translation": "If nirvāṇa can't be the same as the true truth and stubborn, then nirvāṇa can't be the same as the true truth.",
        "source": "T38n1768_001:0234c22_25"
    },
    {
        "source_sentence": "第三師云：真諦絕、涅槃不絕者，亦不然。",
        "translation": "The third teacher says, It's not the case that the true truth is cut off and nirvāṇa isn't cut off.",
        "source": "T38n1768_001:0234c23_26"
    },
    {
        "source_sentence": "若真諦絕涅槃不絕者，真諦妙涅槃不妙，真諦空涅槃不空，二種皆空則二皆絕也。",
        "translation": "If the true truth is cut off and nirvāṇa isn't cut off, then the marvelous nirvāṇa of the true truth isn't marvelous, and the true truth is emptiness and nirvāṇa isn't emptiness",
        "source": "T38n1768_001:0234c24_27"
    },
    {
        "source_sentence": "彼云真諦妙無，涅槃妙有，二種有無，雖異而是妙，既皆妙則應皆絕，",
        "translation": "They say that the true truth is marvelously nonexistent, and that nirvāṇa is marvelously existent. Although there are two kinds of existence and nonexistence, even though different, it is marvelous. Since they are all marvelous, then",
        "source": "T38n1768_001:0234c26_28"
    },
    {
        "source_sentence": "一絕一不絕則一妙一不妙也。",
        "translation": "If one is cut off and one isn't cut off, then one is subtle and one isn't subtle.",
        "source": "T38n1768_001:0234c28_29"
    },
    {
        "source_sentence": "問：今意云何耶？",
        "translation": "Question: What do you think now?",
        "source": "T38n1768_001:0234c29_0"
    },
    {
        "source_sentence": "解云：若更有解還同足載耳！",
        "translation": "Understanding says, If there's another understanding, it's the same as carrying a footstool!",
        "source": "T38n1768_001:0234c29_1"
    },
    {
        "source_sentence": "只除前來諸解注意自現，何煩別說耶！",
        "translation": "What's the trouble of explaining it separately except for the previously explained awarenesses that are self-manifest?",
        "source": "T38n1768_001:0235a01_0"
    },
    {
        "source_sentence": "而今為障學者未能體道，今因指識月，藉教知理，而心無所存。",
        "translation": "But now it is because of the obstacle that scholars who are unable to follow the essential path do not attain enlightenment. Now, by pointing to the moon of consciousness they know the principle through teaching and yet their minds have no",
        "source": "T38n1768_001:0235a01_1"
    },
    {
        "source_sentence": "又云：無離文字說解脫相。",
        "translation": "It's also said, 'There's no way to explain the mark of liberation apart from words.'",
        "source": "T38n1768_001:0235a03_2"
    },
    {
        "source_sentence": "又經云：乃知解脫無言，未知言則解脫。",
        "translation": "Also, the sūtra says, Know that liberation has no words, and if you don't know words, then you're liberated.",
        "source": "T38n1768_001:0235a03_3"
    },
    {
        "source_sentence": "二云乃知涅槃無名，未知名則涅槃也。",
        "translation": "The second says that it's because they know that nirvāṇa has no name, and those who don't have names are then nirvāṇa.",
        "source": "T38n1768_001:0235a04_4"
    },
    {
        "source_sentence": "又此經下文云：「如來涅槃非有為、非無為、非名、不名、非待不待。」",
        "translation": "Furthermore, the following part of this sūtra says, The Tathāgata's nirvāṇa is neither conditioned nor unconditioned, neither named nor nameless, and neither awaited nor unawaited.",
        "source": "T38n1768_001:0235a05_5"
    },
    {
        "source_sentence": "則是非絕非不絕，何得而絕不絕耶？",
        "translation": "Then what's right and wrong are cut off and what's not cut off, so how could they be cut off or not cut off?",
        "source": "T38n1768_001:0235a07_6"
    },
    {
        "source_sentence": "又涅槃之體有是不是，有非不非，是是不能是，非是亦不是，非非不能非，",
        "translation": "Also, the essence of nirvana has what is right and wrong. What is right and wrong have what is right and what is wrong. This is right and that which is not right. What is not right is also not right.",
        "source": "T38n1768_001:0235a07_7"
    },
    {
        "source_sentence": "是非亦不非，故非是非非，能是能非，非絕非不絕，能絕能不絕也。",
        "translation": "What's right and wrong are also not right, so what's right and wrong is neither right nor wrong; what's able is what's capable and what's not capable, what's not cut off and what's not cut off, and what",
        "source": "T38n1768_001:0235a09_8"
    },
    {
        "source_sentence": "有人言：三論所釋但得真諦一支義，我真諦離四句絕百非。",
        "translation": "Some people say, What's explained in the three treatises only obtains one meaning of the true truth, which is to say that the true truth of self is free of four phrases and cut off a hundred negations.",
        "source": "T38n1768_001:0235a11_9"
    },
    {
        "source_sentence": "今明不爾，經既云非物非不物，則非真非不真，非俗非不俗，何關真諦？",
        "translation": "Now, if the sūtras say it's not something and not something, then it's neither true nor untruthful, neither mundane nor non-mundane, so why is it true?",
        "source": "T38n1768_001:0235a12_10"
    },
    {
        "source_sentence": "問：涅槃既非名非不名，是何物而能名能無名耶？",
        "translation": "Q: Since nirvāṇa is neither called nor unnamed, what things can be called and what can be nameless?",
        "source": "T38n1768_001:0235a14_0"
    },
    {
        "source_sentence": "解云：涅槃非物非不物相得，更問道何物耶？",
        "translation": "The explanation says, Nirvāṇa is neither something nor not something that's attained by the characteristics of things, so what is the thing that's asked about the path?",
        "source": "T38n1768_001:0235a15_1"
    },
    {
        "source_sentence": "無物而物而物所謂正道。",
        "translation": "The absence of things and things and things is called the right path.",
        "source": "T38n1768_001:0235a16_2"
    },
    {
        "source_sentence": "故肇師云：「涅槃者，名為道也。",
        "translation": "That's why the master Zhao said, Nirvāṇa is called the path.",
        "source": "T38n1768_001:0235a16_3"
    },
    {
        "source_sentence": "涅槃無名，強為立名，名為涅槃。」",
        "translation": "Nirvāṇa has no name, and it's forced to establish a name for it, which is called nirvāṇa.",
        "source": "T38n1768_001:0235a17_4"
    },
    {
        "source_sentence": "但下文明名有二種：一因緣名，二無因緣名。",
        "translation": "However, there are two kinds of names in the following civilization: one is called by causes and conditions, and the other is called without causes and conditions.",
        "source": "T38n1768_001:0235a18_5"
    },
    {
        "source_sentence": "因緣名如舍利弗也；",
        "translation": "Because of these causes and conditions they are called Śāriputra.",
        "source": "T38n1768_001:0235a19_6"
    },
    {
        "source_sentence": "無因緣者如坻羅婆夷，實不食油強名食油。",
        "translation": "Those who don't have causes and conditions are like the Trāyastriṃśa gods, who really don't eat oil and forcibly call it eating oil.",
        "source": "T38n1768_001:0235a19_7"
    },
    {
        "source_sentence": "涅槃亦爾，無有因緣強名涅槃也。",
        "translation": "So it is with nirvāṇa, which has no causes or conditions and is forcibly called nirvāṇa.",
        "source": "T38n1768_001:0235a20_8"
    },
    {
        "source_sentence": "問：強為涅槃立名為對生死不對生死？",
        "translation": "Question: For the sake of nirvana, they are forcibly established as what is called ‘ opposing birth and death’ and not ‘ opposing birth and death’.",
        "source": "T38n1768_001:0235a21_9"
    },
    {
        "source_sentence": "解云：涅槃豈不對生死？",
        "translation": "The explanation says, Isn't nirvāṇa opposed to birth and death?",
        "source": "T38n1768_001:0235a22_10"
    },
    {
        "source_sentence": "故肇師云：出處異號應物假名也。",
        "translation": "That's why the master Zhao said, It's called a different name that responds to things as nominal names.",
        "source": "T38n1768_001:0235a22_11"
    },
    {
        "source_sentence": "難云：若爾，則是因緣名，何謂無因緣名？",
        "translation": "It is difficult to state: If that is so, then they are called ‘causal conditions’. What does the name ‘without causes and conditions’ mean?",
        "source": "T38n1768_001:0235a23_12"
    },
    {
        "source_sentence": "解云：涅槃未曾名無名，未曾對不對。",
        "translation": "It's explained that nirvāṇa has never been called nameless and has never faced or not faced.",
        "source": "T38n1768_001:0235a24_13"
    },
    {
        "source_sentence": "道因緣亦是強言因緣，一切強立名也。",
        "translation": "The causes and conditions of the path are also forcibly called causes and conditions, and they all forcibly establish names.",
        "source": "T38n1768_001:0235a25_14"
    },
    {
        "source_sentence": "次舉五類一況釋涅槃。",
        "translation": "Next, he cites five categories to explain nirvāṇa in a single instance.",
        "source": "T38n1768_001:0235a27_0"
    },
    {
        "source_sentence": "五類者：一法界、二法性、三法身、四般若、五佛性；",
        "translation": "“Five kinds”: The first is the realm of doctrine; the second is the essence of doctrine; the third is the body of doctrine; the fourth is wisdom; and the fifth is buddha-nature.",
        "source": "T38n1768_001:0235a27_1"
    },
    {
        "source_sentence": "一況即是虛空，虛空具教不絕義及總別義。",
        "translation": "One is that it's space, which fully teaches the meaning of not cutting off and the general and specific meanings of emptiness.",
        "source": "T38n1768_001:0235a28_2"
    },
    {
        "source_sentence": "言法界者，如《華嚴》云：佛子法界者，界非故則不絕，絕名無名義而名法界。",
        "translation": "The Dharma realm refers to the Dharma realm, as the Flower Ornament says, The Dharma realm of the Buddha's son, which is called the Dharma realm because it's not a realm and doesn't stop because it's not a",
        "source": "T38n1768_001:0235a29_3"
    },
    {
        "source_sentence": "則絕不絕義，無名名義。",
        "translation": "Then there's the meaning of being cut off and not cut off, and there's no name or meaning.",
        "source": "T38n1768_001:0235b02_4"
    },
    {
        "source_sentence": "法性者，正法性遠離一切語言道，一切趣非趣，悉寂滅相，則不絕絕義，",
        "translation": "Dharma nature means that the true essence of dharmas is far removed from all paths of speech. All states of being and non-states of being are characterized by tranquility, so it does not cut off its meaning.",
        "source": "T38n1768_001:0235b02_5"
    },
    {
        "source_sentence": "名無名而名為法性，則絕不絕，無名名義也。",
        "translation": "When names have no names but are called the Dharma nature, they are neither cut off nor cut off, and there are no names or meanings of names.",
        "source": "T38n1768_001:0235b04_6"
    },
    {
        "source_sentence": "法身如《金剛身品》。",
        "translation": "The Dharma body is as described in the chapter on the adamantine body.",
        "source": "T38n1768_001:0235b05_7"
    },
    {
        "source_sentence": "般若如「歎般若偈」。",
        "translation": "Prajñāpāramitā is like the verse praising prajñāpāramitā.",
        "source": "T38n1768_001:0235b05_8"
    },
    {
        "source_sentence": "念相觀已除，語言亦滅也。",
        "translation": "After observing the characteristics of mindfulness, they've been removed, and words have ceased as well.",
        "source": "T38n1768_001:0235b06_9"
    },
    {
        "source_sentence": "佛性者，如《師子吼》明佛性第一義空。",
        "translation": "The buddha-nature is like the lion's roar, which explains the emptiness of the buddha-nature as the ultimate truth.",
        "source": "T38n1768_001:0235b06_10"
    },
    {
        "source_sentence": "所言空者，不見空與之不空也。",
        "translation": "What's called emptiness doesn't see emptiness and what's not emptiness.",
        "source": "T38n1768_001:0235b07_11"
    },
    {
        "source_sentence": "舉虛空況者，如《六種品》云，是故知虛空非有亦非無，非相非可相也。",
        "translation": "It's because it's known that space is neither existent nor nonexistent, and it's neither characteristic nor markable.",
        "source": "T38n1768_001:0235b08_12"
    },
    {
        "source_sentence": "次明人法義。",
        "translation": "Next, he explains the meaning of human dharmas.",
        "source": "T38n1768_001:0235b10_0"
    },
    {
        "source_sentence": "問：涅槃是人名，是法稱？",
        "translation": "Question: Nirvana is the name of a person. Is it the name of a doctrine?",
        "source": "T38n1768_001:0235b10_1"
    },
    {
        "source_sentence": "為具足名，為不具名耶？",
        "translation": "Does it have names that are complete or not complete?",
        "source": "T38n1768_001:0235b10_2"
    },
    {
        "source_sentence": "他云涅槃是法名，既稱云涅槃，涅槃是至極之名，窮原盡性之說，所以是具足也。",
        "translation": "Others say that nirvāṇa is the name of the teaching, and since it's called nirvāṇa, nirvāṇa is the ultimate name, which explains the nature of exhaustion in terms of its endlessness, so it's complete",
        "source": "T38n1768_001:0235b11_3"
    },
    {
        "source_sentence": "今明涅槃非有為非無為，則非具足、非不具足、非人、非法，亦具足、亦不具足、亦人名、亦法稱。",
        "translation": "Now, it's clear that nirvāṇa is neither conditioned nor non-conditioned, so it's not complete, neither incomplete nor incomplete, neither human nor unenlightened, and neither complete nor incomplete, both human",
        "source": "T38n1768_001:0235b13_4"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T38n1768_001:0235b14_5"
    },
    {
        "source_sentence": "三點圓伊金剛寶瓶滿足無缺，故是具足；",
        "translation": "Because the vajra-bottle of the three dots is complete, it is supplied without fail.",
        "source": "T38n1768_001:0235b15_6"
    },
    {
        "source_sentence": "而涅槃是果，果斷德故，不具足。",
        "translation": "Nirvāṇa, however, is the result. Because of the virtue of abandoning as a result, it is not endowed with anything.",
        "source": "T38n1768_001:0235b16_0"
    },
    {
        "source_sentence": "涅槃是法，不可解言人者；",
        "translation": "Nirvana is a dharma, and one cannot understand it by saying that it belongs to people.",
        "source": "T38n1768_001:0235b16_1"
    },
    {
        "source_sentence": "四德為涅槃，我則是人也。",
        "translation": "The four virtues are nirvāṇa, and I am a human being.",
        "source": "T38n1768_001:0235b17_2"
    },
    {
        "source_sentence": "又，涅槃非但法，亦得是譬云：「如實、非有非無，王罪亦爾也」(是闍王作逆，",
        "translation": "Furthermore, nirvāṇa isn't just a teaching, but it can also be compared to this metaphor, which says, As it really is, what's neither existent nor nonexistent, so is the king's sin.",
        "source": "T38n1768_001:0235b17_3"
    },
    {
        "source_sentence": "佛慰喻之言是)。",
        "translation": "The Buddha's words of comforting are these.)",
        "source": "T38n1768_001:0235b19_4"
    },
    {
        "source_sentence": "又，《中論》云：「無生亦無滅，寂滅如涅槃」也。",
        "translation": "Furthermore, the Mūlamadhyamaka-śāstra says, There's no arising and no ceasing, and nirvāṇa is like nirvāṇa.",
        "source": "T38n1768_001:0235b19_5"
    },
    {
        "source_sentence": "舊云：「佛方廣華嚴具足人法涅槃」。",
        "translation": "As the old saying goes, The Buddha's extensive flower adornment is replete with the nirvāṇa of humans and dharmas.",
        "source": "T38n1768_001:0235b20_6"
    },
    {
        "source_sentence": "但是法，非人者，明「法長人短」義（明釋迦出穢土，為破我人之病，",
        "translation": "They are only dharmas and not people, which explains the meaning of long dharma and short human beings (which explains that the Śākyamuni emerged from the defiled land to break the sickness of self and person,",
        "source": "T38n1768_001:0235b21_7"
    },
    {
        "source_sentence": "故明「法長人短」；",
        "translation": "That's why it says, The length of the teaching is long and the people are short.",
        "source": "T38n1768_001:0235b22_8"
    },
    {
        "source_sentence": "舍那出於淨土界，「人法俱長」）。",
        "translation": "Śāna emerged from the Pure Land realm, saying, Both humans and dharmas are long.)",
        "source": "T38n1768_001:0235b22_9"
    },
    {
        "source_sentence": "然釋迦人法具有四句：一、法長人短，二、人長法短，三、俱短，四、俱長。",
        "translation": "However, the Śākyamuni's teaching has four phrases: 1. length of dharma and shortness of person, 2. length of person and shortness of dharma, 3. Both are short, and 4. Both are long.",
        "source": "T38n1768_001:0235b23_10"
    },
    {
        "source_sentence": "釋迦為破我人病故，明無人我，而有法，故云無造、無受者，善惡之累不忘也。",
        "translation": "In order to dispel the illness of self and person, the Śākyamuni explains that there's no self but dharmas, so it's called uncreated and un受者, which are the burdens of good and evil that aren't",
        "source": "T38n1768_001:0235b25_11"
    },
    {
        "source_sentence": "又法通生死涅槃故，法長人短者，生死無人，唯涅槃有人，生死無我，",
        "translation": "Also, the Dharma penetrates birth-and-death and nirvāṇa. The longness of the Dharma is that there is neither a human being nor a human being in birth-and-death; only nirvana exists: birth-and-de",
        "source": "T38n1768_001:0235b26_12"
    },
    {
        "source_sentence": "唯涅槃有我也。",
        "translation": "Only nirvāṇa has a self.",
        "source": "T38n1768_001:0235b28_13"
    },
    {
        "source_sentence": "此則具破眾生斷、常二見。",
        "translation": "This then refutes the two views of sentient beings' cessation and permanence.",
        "source": "T38n1768_001:0235b28_14"
    },
    {
        "source_sentence": "生死無人故不常，而有法故不斷。",
        "translation": "Because birth and death are absent, they're impermanent, but because there are dharmas, they don't stop.",
        "source": "T38n1768_001:0235b29_15"
    },
    {
        "source_sentence": "眾生若聞生死中有人，則起常見；",
        "translation": "If sentient beings hear that there is someone in birth and death, they will give rise to the perception of permanence.",
        "source": "T38n1768_001:0235c01_0"
    },
    {
        "source_sentence": "破常見故，明生死一向無人。",
        "translation": "Because it refutes common views, it explains that birth and death are always absent.",
        "source": "T38n1768_001:0235c01_1"
    },
    {
        "source_sentence": "眾生若聞無法，則言無因果、罪福等，則起斷見；",
        "translation": "If sentient beings hear that there is no dharma, then they say there is no cause and effect, blameworthiness or merit. Then they give rise to the view of annihilation.",
        "source": "T38n1768_001:0235c02_2"
    },
    {
        "source_sentence": "為破此見，故云有法。",
        "translation": "In order to refute this view, it's called 'existence of dharmas.'",
        "source": "T38n1768_001:0235c03_3"
    },
    {
        "source_sentence": "雖無有人，善惡之法不失，故明人短法長也。",
        "translation": "Although there are no human beings, good and bad qualities aren't lost, so it explains the shortness of humans and the longness of qualities.",
        "source": "T38n1768_001:0235c03_4"
    },
    {
        "source_sentence": "法短人長者，此少難見，且一往明三我人，同斷結惑，同入灰斷，未辨法有終極。",
        "translation": "This is a rare and difficult thing to see, so let's just explain the three self-natures that are shared by people who have cut bonds and afflictions together, entered into the same cessation of ashes together, and haven't yet explained",
        "source": "T38n1768_001:0235c04_5"
    },
    {
        "source_sentence": "今曰涅槃及前人法，明人壽等同太虛，正法終竟，滅盡故法短也。",
        "translation": "Now, it's called nirvāṇa and the former person's dharma, which explains that human lifespan is the same as space, and the right dharma has ended when it ends, so the Dharma is short because it ceases.",
        "source": "T38n1768_001:0235c06_6"
    },
    {
        "source_sentence": "俱短者，生死既有虛妄，人亦有虛妄。",
        "translation": "Both are short because birth and death have both falsehoods, and humans also have falsehoods.",
        "source": "T38n1768_001:0235c08_7"
    },
    {
        "source_sentence": "人法皆長者，又佛常、法常、比丘僧常，故長。",
        "translation": "Humans and dharmas are all elders, and the Buddha is eternal, the Dharma eternal, and the monks and nuns are eternal, so they grow old.",
        "source": "T38n1768_001:0235c08_8"
    },
    {
        "source_sentence": "如此長短，為顯不長不短也。",
        "translation": "Such longness and shortness is to show that it's neither long nor short.",
        "source": "T38n1768_001:0235c09_9"
    },
    {
        "source_sentence": "第四明涅槃體。",
        "translation": "The fourth clarifies the essence of nirvāṇa.",
        "source": "T38n1768_001:0235c11_0"
    },
    {
        "source_sentence": "前明經宗，通明一經之宗。",
        "translation": "The first explains the doctrine of the sūtras, which generally explains the doctrine of a single sūtra.",
        "source": "T38n1768_001:0235c11_1"
    },
    {
        "source_sentence": "今明體，涅槃一法體也。",
        "translation": "Now, we'll explain the essence, which is that nirvāṇa is the essence of one dharma.",
        "source": "T38n1768_001:0235c11_2"
    },
    {
        "source_sentence": "即為四：初、就一法明體，次、二法明體，三、三法明體，四、就四法明體。",
        "translation": "They are four: first, clarifying the essence of one thing; second, clarifying the essence of two things; third, clarifying the essence of three things; and fourth, clarifying the essence of four things.",
        "source": "T38n1768_001:0235c12_3"
    },
    {
        "source_sentence": "言一法明體者，人法言是有故。",
        "translation": "When it comes to the clarification of the essence of a single dharma, it means that humans and dharmas are said to exist.",
        "source": "T38n1768_001:0235c13_4"
    },
    {
        "source_sentence": "下云：涅槃名為善有，舊云「妙有」也。",
        "translation": "It's said below: Nirvāṇa is called good existence, which was formerly called marvelous existence.",
        "source": "T38n1768_001:0235c14_5"
    },
    {
        "source_sentence": "有復為二義：一者本有，二者始有。",
        "translation": "Existence also has two meanings: first, that which exists in the past and second, that which comes into existence at the beginning.",
        "source": "T38n1768_001:0235c15_6"
    },
    {
        "source_sentence": "義雖本始不同，並是常。",
        "translation": "Although their meanings are originally different, they are all constant.",
        "source": "T38n1768_001:0235c16_7"
    },
    {
        "source_sentence": "本有此常，始有此常也。",
        "translation": "This permanence exists in the past, and this permanence exists at the beginning.",
        "source": "T38n1768_001:0235c16_8"
    },
    {
        "source_sentence": "今難此義，若涅槃有本有始，亦應有曾有今；",
        "translation": "The present objection is that if nirvana had a beginning in the past, there should also be an end in the present.",
        "source": "T38n1768_001:0235c17_9"
    },
    {
        "source_sentence": "若有曾有今，則成三世；",
        "translation": "If there were an existence in the past and a present, they would become three time periods.",
        "source": "T38n1768_001:0235c18_10"
    },
    {
        "source_sentence": "三世無常，常法無曾無今者。",
        "translation": "The three worlds are impermanent, and the eternal dharmas have no past and no present.",
        "source": "T38n1768_001:0235c18_11"
    },
    {
        "source_sentence": "常法無本如，既有本有始，則應有曾今，便成三世無常。",
        "translation": "Since the eternal dharmas are not originally thus, and since they have an origin and a beginning, then there should be an occasional present, which would make the three worlds impermanent.",
        "source": "T38n1768_001:0235c19_12"
    },
    {
        "source_sentence": "次二法明體者，則是二諦義。",
        "translation": "The next two dharmas that clarify the essence are the meaning of the two truths.",
        "source": "T38n1768_001:0235c21_0"
    },
    {
        "source_sentence": "莊嚴云：涅槃出二諦外。",
        "translation": "The adornment says, Nirvāṇa comes from beyond the two truths.",
        "source": "T38n1768_001:0235c21_1"
    },
    {
        "source_sentence": "明惑因所感果是浮虛之故，是世諦；",
        "translation": "It is the conventional truth that it explains that the fruits produced by the causes of defilement are floating, because they are unreal.",
        "source": "T38n1768_001:0235c22_2"
    },
    {
        "source_sentence": "假體則空故，是真諦。",
        "translation": "Because the nominal body is emptiness, it's the true truth.",
        "source": "T38n1768_001:0235c23_0"
    },
    {
        "source_sentence": "今佛果非惑因所感故，非世諦；",
        "translation": "Now the fruit of Buddhahood is not caused by the causes of defilement, so it is not a conventional truth.",
        "source": "T38n1768_001:0235c23_1"
    },
    {
        "source_sentence": "非世諦故不可則空，故非真諦。",
        "translation": "Because they are not worldly truths, they cannot be emptiness; therefore, they are not true truths.",
        "source": "T38n1768_001:0235c24_2"
    },
    {
        "source_sentence": "所以《仁王經》云：「薩雲若覺，超度世諦第一義也。」",
        "translation": "That's why the Renwang jing says, Suppose a buddha realizes that he transcends the ultimate truth of the worldly truth.",
        "source": "T38n1768_001:0235c24_3"
    },
    {
        "source_sentence": "開善解云：果涅槃具足二諦。",
        "translation": "It opens with a good explanation, saying, The fruit of nirvāṇa is replete with both truths.",
        "source": "T38n1768_001:0235c25_4"
    },
    {
        "source_sentence": "涅槃是續待二假，故是世諦。",
        "translation": "Nirvāṇa is the conventional truth because it continues to await the twofold hypothesis.",
        "source": "T38n1768_001:0235c26_5"
    },
    {
        "source_sentence": "非但則真，亦復冥真，故是二諦。",
        "translation": "Because they are not only true, but also mysterious and true: that is why they are the two truths.",
        "source": "T38n1768_001:0235c27_6"
    },
    {
        "source_sentence": "第三冶城師云：佛果非世諦則是真諦。",
        "translation": "The third Yecheng master said, The Buddhahood that's not a conventional truth is the true truth.",
        "source": "T38n1768_001:0235c27_7"
    },
    {
        "source_sentence": "明真諦是諸法之本，但眾生顛倒起惑，構造生死，遂成世諦。",
        "translation": "It's clear that the true truth is the root of all dharmas, but sentient beings mistakenly give rise to mental disturbances and structure birth-and-death so that they become worldly truths.",
        "source": "T38n1768_001:0235c28_8"
    },
    {
        "source_sentence": "今還修道，斷惑生死盡，世諦則滅。",
        "translation": "Now, when he returns to cultivation, he stops the afflictions and ends birth-and-death, and the conventional truth ceases.",
        "source": "T38n1768_001:0236a01_9"
    },
    {
        "source_sentence": "世諦既滅，還歸本真。",
        "translation": "When the conventional truth ceases, it returns to its original truth.",
        "source": "T38n1768_001:0236a01_10"
    },
    {
        "source_sentence": "譬如清水，本性寂靜，假外風漸鼓擊致有波浪，風若息還收本性。",
        "translation": "It's like clear water whose original nature is quiescent, and it's assumed that external wind gradually blows and creates waves, and if the wind stops, it returns to its original nature.",
        "source": "T38n1768_001:0236a02_11"
    },
    {
        "source_sentence": "今皆不同此說。",
        "translation": "Now, they're all different from this explanation.",
        "source": "T38n1768_001:0236a03_12"
    },
    {
        "source_sentence": "具如《二諦義》中廣破。",
        "translation": "It's explained in detail in the Doctrine of the Two Truths.",
        "source": "T38n1768_001:0236a04_13"
    },
    {
        "source_sentence": "今述：但今明佛果，非內非外、非有為非無為、非待非不待、非攝非不攝，",
        "translation": "Now, it's explained that the Buddhahood is neither internal nor external, neither conditioned nor unconditioned, neither waiting nor not waiting, neither collected nor not collected.",
        "source": "T38n1768_001:0236a04_14"
    },
    {
        "source_sentence": "豈可定言攝不攝耶？",
        "translation": "How can it be said with certainty that they are included or not included?",
        "source": "T38n1768_001:0236a06_15"
    },
    {
        "source_sentence": "故肇師云：「涅槃之為道也，寂寥虛廣，不可形名得；",
        "translation": "That is why the founder of Buddhism said, “Nirvana is the path. It is quiescent and vast; it cannot be called acquisition if one does not grasp form.",
        "source": "T38n1768_001:0236a06_16"
    },
    {
        "source_sentence": "微妙無相，不可有心知。",
        "translation": "The subtle has no characteristics and cannot be known by the mind.",
        "source": "T38n1768_001:0236a07_17"
    },
    {
        "source_sentence": "言之者違其真，知之者反其愚。",
        "translation": "Those who say it are at odds with its truth and those who know it are at odds with its folly.",
        "source": "T38n1768_001:0236a08_18"
    },
    {
        "source_sentence": "有之者乖其性，無之者傷其軀。",
        "translation": "Those who have it diverge from its nature, and those who don't have it hurt their bodies.",
        "source": "T38n1768_001:0236a09_19"
    },
    {
        "source_sentence": "斯乃希夷之境，太玄之鄉，而以有無題[肆-聿+旁]，標其方域。",
        "translation": "This was the territory of Xiyi and the country of Taixuan, but it was labeled as a square because it had no title or [place].",
        "source": "T38n1768_001:0236a09_20"
    },
    {
        "source_sentence": "而語神通者，不亦邈哉。」",
        "translation": "Those who speak of the miraculous powers aren't likewise.",
        "source": "T38n1768_001:0236a11_0"
    },
    {
        "source_sentence": "涅槃之體乃其如此，豈可以凡心推度，或言在二諦內，或言在二諦外耶？",
        "translation": "The essence of nirvāṇa is like this, so how can ordinary people be presumed to be either inside the two truths or outside the two truths?",
        "source": "T38n1768_001:0236a11_1"
    },
    {
        "source_sentence": "次明三德者，明三法有三種：一者三聚，二者三性，三者三德也。",
        "translation": "Next, it's explained that the three virtues are three kinds: first, the three aggregates, second, the three natures, and third, the three virtues.",
        "source": "T38n1768_001:0236a14_0"
    },
    {
        "source_sentence": "三聚者色、心、無作，今不釋此名，但佛果為具此三不？",
        "translation": "The three aggregates are form, mind, and non-contrivance. Now, we won't explain these names, but is the Buddhahood endowed with these three?",
        "source": "T38n1768_001:0236a15_1"
    },
    {
        "source_sentence": "成論師解此有三例：若是「心」則定有；",
        "translation": "The Vaiśeṣika explains that there are three examples:",
        "source": "T38n1768_001:0236a16_2"
    },
    {
        "source_sentence": "「無作」定無；",
        "translation": "The unmanifest is definitely nonexistent.",
        "source": "T38n1768_001:0236a17_3"
    },
    {
        "source_sentence": "「色」一種則有多解。",
        "translation": "The first one, form, then has many interpretations.",
        "source": "T38n1768_001:0236a17_4"
    },
    {
        "source_sentence": "一云：佛果乃盡麁色，則有妙色。",
        "translation": "One, it's said that when the Buddhahood ends crude form, there's marvelous form.",
        "source": "T38n1768_001:0236a18_5"
    },
    {
        "source_sentence": "故經云：「捨無常色，獲得常色」。",
        "translation": "That's why the sūtra says, Reject impermanent form and attain permanent form.",
        "source": "T38n1768_001:0236a18_6"
    },
    {
        "source_sentence": "又六卷云：「妙色湛然常安穩」。",
        "translation": "It's also said in another six-fascicle book, Marvelous form is calm and always stable.",
        "source": "T38n1768_001:0236a19_7"
    },
    {
        "source_sentence": "又經云：「解脫有二體，一色、二無色」。",
        "translation": "The sūtras also say, There are two bodies of liberation, one form and two formless.",
        "source": "T38n1768_001:0236a20_8"
    },
    {
        "source_sentence": "無色者，聲聞解脫。",
        "translation": "The formless one is the liberation of sravakas.",
        "source": "T38n1768_001:0236a20_9"
    },
    {
        "source_sentence": "色者，諸佛解脫也。",
        "translation": "Form refers to the liberation of the buddhas.",
        "source": "T38n1768_001:0236a21_10"
    },
    {
        "source_sentence": "第二云：佛果無色。",
        "translation": "The second teaching says, The buddha-fruit is formless.",
        "source": "T38n1768_001:0236a21_11"
    },
    {
        "source_sentence": "色是頑礙之法，不可研磨，增進佛果之時靈智獨存，無有「色」與「無作」也。",
        "translation": "Form is a stubborn and obstructive dharma that can't be cultivated, and when it advances to the Buddhahood, spiritual wisdom exists alone, with no form or non-form.",
        "source": "T38n1768_001:0236a22_12"
    },
    {
        "source_sentence": "——而經中道「妙色」者有二義：一能應為無窮之色，二者妙果顯然故，",
        "translation": "The expression marvelous form in the sūtras has two meanings: first, it can be an infinite form that should be produced; second, it's because the marvelous result is manifested.",
        "source": "T38n1768_001:0236a23_13"
    },
    {
        "source_sentence": "故為色耳。",
        "translation": "That's why it's called form.",
        "source": "T38n1768_001:0236a25_14"
    },
    {
        "source_sentence": "——故《六經》云：「願諸眾生滅一切色，入於無色大般涅槃也」。",
        "translation": "That's why the Six Sutras say, May all sentient beings cease all form and enter formless great parinirvāṇa.",
        "source": "T38n1768_001:0236a25_15"
    },
    {
        "source_sentence": "「地論」明三佛皆有色作身，色可知。",
        "translation": "The Earth Treatise explains that the three buddhas all have form as body, and form can be known.",
        "source": "T38n1768_001:0236a26_16"
    },
    {
        "source_sentence": "釋身色者如經，一一相，海無量，諸相雖有此色，而不可見。",
        "translation": "The explanation of body form is as the sūtra explains, Each characteristic has an ocean that's immeasurable, and although these characteristics have this form, they can't be seen.",
        "source": "T38n1768_001:0236a27_17"
    },
    {
        "source_sentence": "《地經》說佛相好，為實報身也。",
        "translation": "The Earth Sutra teaches that the Buddha's good appearance is the body of real reward.",
        "source": "T38n1768_001:0236a28_18"
    },
    {
        "source_sentence": "法身色者，如來藏中色性法門顯現成佛體。",
        "translation": "Form of the Dharma body refers to the form-nature dharma-gate in the Tathāgatagarbha that reveals the essence of becoming a buddha.",
        "source": "T38n1768_001:0236a29_19"
    },
    {
        "source_sentence": "體雖是色，而無色相。",
        "translation": "Although the essence is form, it has no form or characteristics.",
        "source": "T38n1768_001:0236b01_20"
    },
    {
        "source_sentence": "如比丘無作，雖是色性，而無色相。",
        "translation": "Suppose a monk is unconstructed, and although it's form by nature, it has no form or characteristics.",
        "source": "T38n1768_001:0236b01_21"
    },
    {
        "source_sentence": "又云：法身出生，法則無盡色像。",
        "translation": "It's also said, The Dharma body arises, and the Dharma is an inexhaustible form.",
        "source": "T38n1768_001:0236b02_22"
    },
    {
        "source_sentence": "又云：無礙之色，如無像之形，不同下地因中也。",
        "translation": "It's also said that unobstructed form is like the form of an imageless form, which isn't the same as the lower-ground cause.",
        "source": "T38n1768_001:0236b03_23"
    },
    {
        "source_sentence": "論心者雖捨無常識，獲得常識，涅槃以為體，但心為體。",
        "translation": "Although someone who discusses mind abandons the absence of common sense and attains common sense, nirvāṇa takes it as its essence but mind as its essence.",
        "source": "T38n1768_001:0236b04_24"
    },
    {
        "source_sentence": "（但心有三：一、「六識心」緣外境，二、「七識心」緣內法，此二皆滅，",
        "translation": "(There are only three kinds of mind: 1. the six consciousnesses and mind have external objects as objects, 2. the seven consciousnesses and mind have internal dharmas as objects, and these two all cease.",
        "source": "T38n1768_001:0236b05_25"
    },
    {
        "source_sentence": "唯第三「八識」唯真識覺知也。",
        "translation": "Only the third, Eight Consciousnesses, is the only true consciousness that perceives.",
        "source": "T38n1768_001:0236b06_26"
    },
    {
        "source_sentence": "）論「非色心」者，無生死色、心，亦名非色心也。",
        "translation": ") The treatise says, A mind that's not formless because there's no form or mind in birth-and-death, which is also called a mind that's not form.",
        "source": "T38n1768_001:0236b07_27"
    },
    {
        "source_sentence": "又常釋「色」至處者，成論師凡有四說：一：欲、色兩界有色，無色界無色。",
        "translation": "Furthermore, he always explains that form is the ultimate abode because there are four explanations by the Cheng lun masters: 1. The two realms of desire and form have form, and the formless realm has form.",
        "source": "T38n1768_001:0236b08_28"
    },
    {
        "source_sentence": "第二云：三界並有色，三界外乃無色。",
        "translation": "Second, it's said that the three realms are both colored and formless outside the three realms.",
        "source": "T38n1768_001:0236b09_29"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T38n1768_001:0236b10_30"
    },
    {
        "source_sentence": "六地已還，身土分段有色土，七地已上，出三界外無復色，而是四空無色者，",
        "translation": "When one returns after sixth stage, the soil of the body is a partially material soil. After seventh stage, when one leaves the three realms and goes beyond them, there is no more matter:",
        "source": "T38n1768_001:0236b10_31"
    },
    {
        "source_sentence": "無麁色耳。",
        "translation": "There's no crude color in the ear.",
        "source": "T38n1768_001:0236b12_32"
    },
    {
        "source_sentence": "第三解云：六地穢國土地，二國中間，猶有如影知光色，八地已上則無復色。",
        "translation": "The third explanation says, Sixth, there's the land of a defiled land in the sixth ground, and between two lands, there's still form like a shadow that knows the color of light, but there's no form after the eighth ground.",
        "source": "T38n1768_001:0236b12_33"
    },
    {
        "source_sentence": "第四解：金剛心則有色，唯佛無色。",
        "translation": "Fourth: The diamond mind has form, but only the Buddha has form.",
        "source": "T38n1768_001:0236b14_34"
    },
    {
        "source_sentence": "而言界外意生身者，爾時無復一期壽命，但有念念生滅，名為變易，故云意生身耳，",
        "translation": "It's said that the mind-made body outside the [three] realms has no longer a life span, but it arises and ceases with each thought, which is called change. That's why it's called the mind-made body.",
        "source": "T38n1768_001:0236b15_35"
    },
    {
        "source_sentence": "無作一法窮至金剛也。",
        "translation": "He doesn't do a single thing until he reaches the point where he becomes Vajra.",
        "source": "T38n1768_001:0236b17_36"
    },
    {
        "source_sentence": "今明皆不然。",
        "translation": "Now, it's clear that they aren't.",
        "source": "T38n1768_001:0236b17_37"
    },
    {
        "source_sentence": "若言佛果定有色者，則應長短質像，則有處所；",
        "translation": "When stating that the fruit of buddhahood definitely has form, then it should be long and short in stature. Then there is a place.",
        "source": "T38n1768_001:0236b18_0"
    },
    {
        "source_sentence": "若定無色，亦應無心。",
        "translation": "If the absorption were formless, it would also be without mind.",
        "source": "T38n1768_001:0236b19_1"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T38n1768_001:0236b19_2"
    },
    {
        "source_sentence": "色是心依因，既無有色，心何所依？",
        "translation": "Form is the support of thought. Since there is no form, what is the support of thought?",
        "source": "T38n1768_001:0236b19_3"
    },
    {
        "source_sentence": "若言色是頑礙，故須離者；",
        "translation": "If you say form is a stubborn obstruction, why does it need to be abandoned?",
        "source": "T38n1768_001:0236b20_4"
    },
    {
        "source_sentence": "心是無常，亦應須離。",
        "translation": "If the mind is impermanent, it should also have to be free.",
        "source": "T38n1768_001:0236b21_0"
    },
    {
        "source_sentence": "又心是取相之法，亦應須除。",
        "translation": "Also, mind is the dharma that grasps characteristics, and it should also be removed.",
        "source": "T38n1768_001:0236b21_1"
    },
    {
        "source_sentence": "若轉取相心為無相心者，亦應轉頑礙之色為無礙色。",
        "translation": "If the mind that grasps characteristics is transformed into a markless mind, it should also transform stubborn form that's obstructed into unobstructed form.",
        "source": "T38n1768_001:0236b22_2"
    },
    {
        "source_sentence": "又歎如來無色應為色者，亦無心應為心。",
        "translation": "Also, someone who praises the Tathāgata's formlessness as form should also have no mind as mind.",
        "source": "T38n1768_001:0236b23_3"
    },
    {
        "source_sentence": "解云：心為體，汝何心為體？",
        "translation": "The explanation says, Mind is the essence, and what are you minds that are the essence?",
        "source": "T38n1768_001:0236b24_4"
    },
    {
        "source_sentence": "汝捨麁心，以妙心為體；",
        "translation": "You abandon coarse thoughts and take subtle thoughts as your essence.",
        "source": "T38n1768_001:0236b24_5"
    },
    {
        "source_sentence": "應捨麁色，妙色為體也。",
        "translation": "They should abandon coarse form and subtle form as their essence.",
        "source": "T38n1768_001:0236b25_6"
    },
    {
        "source_sentence": "今明：若言一切皆無，是無不待於有，是故性無。",
        "translation": "Now, it's clear that if you say everything is nonexistent, this is nonexistence and doesn't await existence; therefore, the nature is nonexistent.",
        "source": "T38n1768_001:0236b25_7"
    },
    {
        "source_sentence": "有亦然也。",
        "translation": "So it is with existence.",
        "source": "T38n1768_001:0236b27_8"
    },
    {
        "source_sentence": "故今有不乖無，無不妨有；",
        "translation": "Therefore, the present existence is not contrary to nonexistence; nonexistence cannot exist without nonexistence.",
        "source": "T38n1768_001:0236b27_9"
    },
    {
        "source_sentence": "有無自立，色心無礙也。",
        "translation": "Existence and nonexistence are self-established, and form and mind are unobstructed.",
        "source": "T38n1768_001:0236b27_10"
    },
    {
        "source_sentence": "第二、顯三性明體。",
        "translation": "Second, it shows the three natures and explains their essence.",
        "source": "T38n1768_001:0236b28_11"
    },
    {
        "source_sentence": "三性：善、惡、無記。",
        "translation": "Three natures: good, bad and indeterminate.",
        "source": "T38n1768_001:0236b28_12"
    },
    {
        "source_sentence": "釋此三，亦三例：善，一向定有。",
        "translation": "These three interpretations are also given as three examples: good, absolutely and definitely present.",
        "source": "T38n1768_001:0236b29_13"
    },
    {
        "source_sentence": "惡，一向定無。",
        "translation": "Bad dharmas are always absent in samdhi.",
        "source": "T38n1768_001:0236b29_14"
    },
    {
        "source_sentence": "無記，復有二解：第一、光宅明佛果有二種無記：一、知解無記，二、果報無記。",
        "translation": "There are two more kinds of indeterminate, and there are two other interpretations: first, the Guangzhai explains that there are two kinds of indeterminate buddha-fruits: 1. knowledge and understanding are indeterminate, and 2. fruition",
        "source": "T38n1768_001:0236c01_15"
    },
    {
        "source_sentence": "知解者，如基射馭，闡提亦有故非善，佛地亦有故非惡，故有無記性也。",
        "translation": "Knowing and understanding is like the icchantika, which is neither good because it exists nor bad because it exists, and has indeterminate nature because it exists in the Buddha-stage.",
        "source": "T38n1768_001:0236c02_16"
    },
    {
        "source_sentence": "果報者，如生死中苦無常，釋既非惡，但是無記，涅槃之地，常、樂、我、淨亦非是善，",
        "translation": "The karmic retribution is like the fact that in birth-and-death, suffering is impermanent. Since the explanation is not bad but neutral, neither is permanence, bliss, self, nor purity good in the state of nirvana.",
        "source": "T38n1768_001:0236c04_17"
    },
    {
        "source_sentence": "並是無記也。",
        "translation": "They're all indeterminate.",
        "source": "T38n1768_001:0236c06_18"
    },
    {
        "source_sentence": "第二、開善、莊嚴並云是善非復無記。",
        "translation": "Second, it's said to reveal that goodness and adornment are both good and not again indeterminate.",
        "source": "T38n1768_001:0236c06_19"
    },
    {
        "source_sentence": "次通彼二種無記之善，莊嚴明知解應是善。",
        "translation": "Next, it's shared with those two kinds of indeterminate goodness, and the adornment of knowing and understanding should be good.",
        "source": "T38n1768_001:0236c07_20"
    },
    {
        "source_sentence": "開善通三性，闡提是惡，佛則是善也。",
        "translation": "Enlightenment is good and penetrates the three natures, icchantika is bad, and buddha is good.",
        "source": "T38n1768_001:0236c08_21"
    },
    {
        "source_sentence": "果報者，生死之中多有異具，故果報可是無記；",
        "translation": "The karmic retribution means that there are many different kinds of provisions in birth and death. Therefore, the karmic retribution is neutral.",
        "source": "T38n1768_001:0236c09_0"
    },
    {
        "source_sentence": "佛果唯有習果，無復報法，寧可類此是無記耶？",
        "translation": "The fruit of Buddhahood is only the result of accumulation, and there are no other karmic retributions. How can we say that it is indeterminate?",
        "source": "T38n1768_001:0236c10_1"
    },
    {
        "source_sentence": "今所明涅槃之體，非善非不善，非記非不記，無一定相。",
        "translation": "Now, the essence of nirvāṇa as explained is neither good nor unskillful, neither indeterminate nor indeterminate, and has no fixed characteristics.",
        "source": "T38n1768_001:0236c11_2"
    },
    {
        "source_sentence": "善巧方便，無所不是善不善。",
        "translation": "With skillful means, there's nothing that isn't good or unskillful.",
        "source": "T38n1768_001:0236c12_3"
    },
    {
        "source_sentence": "有時為對不善，如復道是善。",
        "translation": "Sometimes it's for the sake of opposing what's unwholesome, just as they say it's good again.",
        "source": "T38n1768_001:0236c13_0"
    },
    {
        "source_sentence": "故云：諸惡已斷，眾善普會。",
        "translation": "That's why it's said, All bad things have been stopped, and all goodness is universally assembling.",
        "source": "T38n1768_001:0236c13_1"
    },
    {
        "source_sentence": "第三、明三德者，涅槃乃具萬德，而經文略言三德耳。",
        "translation": "The third clarification of the three virtues is that nirvāṇa has all myriad virtues, but the sūtras briefly refer to the three virtues.",
        "source": "T38n1768_001:0236c14_2"
    },
    {
        "source_sentence": "但從來教三德凡有三師：第一、莊嚴云：法身語其體，般若、解脫明其用。",
        "translation": "However, there are three masters who teach the three virtues from the past: first, Zhuangyan says, The Dharma body and speech have their essence, and Prajñāpāramitā and liberation explain their function.",
        "source": "T38n1768_001:0236c15_3"
    },
    {
        "source_sentence": "勝難多不出智、斷。",
        "translation": "Many of the superior difficulties don't arise from cognition and cessation.",
        "source": "T38n1768_001:0236c17_0"
    },
    {
        "source_sentence": "般若智，解脫斷，體具智、斷，故言三也。",
        "translation": "Wisdom of prajñā and knowledge of liberation are eliminated, and the essence is endowed with wisdom and elimination; therefore, it's called three.",
        "source": "T38n1768_001:0236c17_1"
    },
    {
        "source_sentence": "第二、開善云：對付昔日二種涅槃，故言三德。",
        "translation": "Second, it's called the three virtues because it reveals goodness and says, 'Confronted with the two kinds of nirvāṇa in the past, I'll give them to you.'",
        "source": "T38n1768_001:0236c18_2"
    },
    {
        "source_sentence": "昔日有餘身，智雖在，解脫未具；",
        "translation": "In the past there was a remaining body. Although it had wisdom in it, liberation was not yet complete.",
        "source": "T38n1768_001:0236c19_3"
    },
    {
        "source_sentence": "今日身知在時，解脫已具，則是斥彼有餘。",
        "translation": "Today, when bodily cognition is present and liberation is complete, then he's denied that there's anything left.",
        "source": "T38n1768_001:0236c20_0"
    },
    {
        "source_sentence": "昔日無餘，子果累盡，解脫乃具，而無復身智；",
        "translation": "In the past, when there was no residue in the world, all the fruits of birth and maturation were exhausted. The enlightening beings’ liberation was complete, but they had no more body or knowledge.",
        "source": "T38n1768_001:0236c20_1"
    },
    {
        "source_sentence": "今明解脫具時，而有身智，則斥彼無常。",
        "translation": "Now, it's clear that when the body of liberation is present, there's bodily cognition, and then he rejects its impermanence.",
        "source": "T38n1768_001:0236c21_2"
    },
    {
        "source_sentence": "第三、合二解，合用兩義。",
        "translation": "Third, it combines the two interpretations and combines the two meanings of function.",
        "source": "T38n1768_001:0236c22_3"
    },
    {
        "source_sentence": "直論今教，如莊嚴。",
        "translation": "It's straightforward to discuss the present teaching as adorned.",
        "source": "T38n1768_001:0236c23_4"
    },
    {
        "source_sentence": "若對今昔，則如開善也。",
        "translation": "If it's directed toward the present and past, then it's like opening up goodness.",
        "source": "T38n1768_001:0236c23_5"
    },
    {
        "source_sentence": "今明若無所得因緣假說，無法不得。",
        "translation": "Now, it's clear that if the ungraspable causes and conditions are nominally explained, there's nothing to attain.",
        "source": "T38n1768_001:0236c24_6"
    },
    {
        "source_sentence": "但此三釋無文證據，直是義推。",
        "translation": "However, these three explanations lack the text and evidence, which are simply interpretations of meaning.",
        "source": "T38n1768_001:0236c25_7"
    },
    {
        "source_sentence": "今謂此等各有妨難，所以不可具論。",
        "translation": "Now, it's said that each of these has its own obstruction, so we can't discuss them in detail.",
        "source": "T38n1768_001:0236c25_8"
    },
    {
        "source_sentence": "初家凡有兩難：一者、明三德本共為涅槃體，云何但以法身為體？",
        "translation": "The first school has two difficulties: 1. It's clear that the three virtues are originally shared as the essence of nirvāṇa, so why is it only the essence of the Dharma body?",
        "source": "T38n1768_001:0236c26_9"
    },
    {
        "source_sentence": "又且法身亦得為用，豈謂智斷偏為用耶？",
        "translation": "Furthermore, since the Dharma body can also be used as a function, doesn't it mean that cognition and cessation are partially used as a function?",
        "source": "T38n1768_001:0236c28_10"
    },
    {
        "source_sentence": "若云身是體異名，故以法身當體者，下文云「涅槃名解脫」應以解脫當名，",
        "translation": "If it's said that the body is a different name for essence, so the Dharma body should be its essence, the following sentence says, Nirvāṇa is called liberation, which should be called liberation.",
        "source": "T38n1768_001:0236c29_11"
    },
    {
        "source_sentence": "而今不以解脫者，當那忽以法身當解。",
        "translation": "If someone isn't liberated now, then they'll suddenly be liberated with the Dharma body.",
        "source": "T38n1768_001:0237a01_12"
    },
    {
        "source_sentence": "二者、文中自道縱亦不成，別異亦不成，三法曾無縱橫之異。",
        "translation": "2. The text says that even though the self-way is vertical, it's not valid, and distinctive differences aren't valid, and there are no horizontal or vertical differences in the three dharmas.",
        "source": "T38n1768_001:0237a02_13"
    },
    {
        "source_sentence": "豈有體用之殊？",
        "translation": "How could there be distinctions in essence and function?",
        "source": "T38n1768_001:0237a03_14"
    },
    {
        "source_sentence": "若有體用，有本末，若有本末，則有劣勝。",
        "translation": "If there were essence and function, there would be origin and derivative; if there were origin and derivative, there would be inferiority and superiority.",
        "source": "T38n1768_001:0237a04_15"
    },
    {
        "source_sentence": "云、次難復解：若言斥昔涅槃，故言三德者，此名數殊不相組對，如破邪三寶則言正三寶。",
        "translation": "If someone says they rejected nirvāṇa in the past and therefore called them the three virtues, their names are different and don't contrast each other, just as if they were to refute the mistaken Three Treasures and say the correct Three Treasures.",
        "source": "T38n1768_001:0237a05_16"
    },
    {
        "source_sentence": "今破二涅槃明二德，又以法身般若斥無餘者，亦應以解脫常住斥彼有餘，",
        "translation": "Now, it refutes the two kinds of nirvāṇa and explains the two virtues. Also, if someone rejects the absence of remainder with the Dharma body and prajñāpāramitā, they should also reject the existence of",
        "source": "T38n1768_001:0237a07_17"
    },
    {
        "source_sentence": "何者昔日有餘，何但解脫未足，亦非常住？",
        "translation": "Why is there something leftover from the past? Why is liberation not enough, and why does it also abide in an impermanent state?",
        "source": "T38n1768_001:0237a08_18"
    },
    {
        "source_sentence": "今若正言解脫，不言常住者，亦應無餘，正言法身，不言般若。",
        "translation": "Now, if someone were to correctly say liberation and not always abide, they would also have no remainder, correctly speaking of the Dharma body and not prajñā.",
        "source": "T38n1768_001:0237a09_19"
    },
    {
        "source_sentence": "第三既具用兩釋，具招二難也。",
        "translation": "The third is to explain both interpretations in terms of using, and the second is to present two difficulties.",
        "source": "T38n1768_001:0237a11_20"
    },
    {
        "source_sentence": "今明：直是教門不同，故偏具。",
        "translation": "Now, we'll explain that it's because the teachings are directly different from each other and therefore partially present.",
        "source": "T38n1768_001:0237a11_21"
    },
    {
        "source_sentence": "為昔日不堪具說，方便偏說一解脫；",
        "translation": "In order not to be able to give a full explanation of the past, I will skillfully and partially explain one liberation.",
        "source": "T38n1768_001:0237a12_22"
    },
    {
        "source_sentence": "今大心發故，說三德圓伊涅槃。",
        "translation": "Now, because the great mind arises, it's said that the three virtues are perfected by nirvāṇa.",
        "source": "T38n1768_001:0237a13_23"
    },
    {
        "source_sentence": "興皇師云：「無感不應故云法身，無境不照名為般若，無累不盡故云解脫。」",
        "translation": "The Xinghuang master said, It's called the Dharma body because there's no feeling and no response, and it's called prajñā because there's no object and no illumination, and it's called liberation because there's no",
        "source": "T38n1768_001:0237a14_24"
    },
    {
        "source_sentence": "又，明三德為開如來三密，故迦葉問願，佛開微密，廣為眾生說也。",
        "translation": "It also explains that the three virtues are to reveal the three mysteries of the Tathāgata, so Kāśyapa asks and vows that the Buddha reveal the subtle mysteries and explain them in detail for sentient beings.",
        "source": "T38n1768_001:0237a15_25"
    },
    {
        "source_sentence": "如此三密並《四相品》是也。",
        "translation": "These three esoteric texts are the same as the Four Characteristics Chapter.",
        "source": "T38n1768_001:0237a17_26"
    },
    {
        "source_sentence": "亦是對凡夫三業，凡夫三業不密故。",
        "translation": "Also, these are the three actions that oppose worldlings because the three actions of worldlings are not hidden.",
        "source": "T38n1768_001:0237a17_27"
    },
    {
        "source_sentence": "又，為對生死三障明涅槃三德：對報障明法身，對業障明解脫，對煩惱障明般若，",
        "translation": "Again, to counteract the three hindrances of birth and death they explain the three virtues of nirvana: to counteract the hindrance of retribution they explain the Dharma body; to counteract the hindrance of action they explain liberation; and to counteract",
        "source": "T38n1768_001:0237a18_28"
    },
    {
        "source_sentence": "生死只三障，故涅槃唯有三德也。",
        "translation": "Birth and death are only three hindrances, so nirvāṇa has only three virtues.",
        "source": "T38n1768_001:0237a20_29"
    },
    {
        "source_sentence": "次約四法明：亦體即是「四德」。",
        "translation": "Next, it's explained in terms of four dharmas: the same essence is the four virtues.",
        "source": "T38n1768_001:0237a22_0"
    },
    {
        "source_sentence": "此德亦無定，或一圓是「妙有」也；",
        "translation": "This virtue is also indeterminate, and sometimes one perfection is marvelous existence.",
        "source": "T38n1768_001:0237a22_1"
    },
    {
        "source_sentence": "有時明二，即「妙有」及「我」；",
        "translation": "There are times when it is explained as two, that is, marvelous existence and self.",
        "source": "T38n1768_001:0237a23_2"
    },
    {
        "source_sentence": "有時明「三德」隣「三修法」也；",
        "translation": "There are times when it says three virtues, next to three cultivations of the Dharma.",
        "source": "T38n1768_001:0237a23_3"
    },
    {
        "source_sentence": "四、可解「五德」對彼五門；",
        "translation": "The fourth is that one can understand the five kinds of virtues by contrasting them in five ways.",
        "source": "T38n1768_001:0237a24_4"
    },
    {
        "source_sentence": "有時「八德」則八味也。",
        "translation": "There are times when the eight virtues refer to the eight flavors.",
        "source": "T38n1768_001:0237a25_0"
    },
    {
        "source_sentence": "一德有二行，二德有四行，三德有六行，四德有八行，五德有十行，八德有十六行也。",
        "translation": "The first virtue has two aspects; the second virtue has four aspects; the third virtue has six aspects; the fourth virtue has eight aspects; the fifth virtue has ten aspects; and the eighth virtue has sixteen aspects.",
        "source": "T38n1768_001:0237a25_1"
    },
    {
        "source_sentence": "行有三雙：生死涅槃明行解，生死在無常為行解，涅槃樂為行。",
        "translation": "There are three pairs of practice: birth-and-death and nirvāṇa explain the practice and understanding, birth-and-death in impermanence is the practice and understanding, and nirvāṇa and bliss are the practice.",
        "source": "T38n1768_001:0237a27_2"
    },
    {
        "source_sentence": "此八行解乃得涅槃四德也。",
        "translation": "These eight practices of understanding are the four virtues of attaining nirvāṇa.",
        "source": "T38n1768_001:0237a28_3"
    },
    {
        "source_sentence": "二明因果：因在無常，果常樂我。",
        "translation": "The second clarifies cause and effect: the cause is impermanent, and the result is permanent, pleasant, and self.",
        "source": "T38n1768_001:0237a29_4"
    },
    {
        "source_sentence": "三約本迹：迹在無常，本身常、樂、我也。",
        "translation": "Three, it's about the original and traces: the traces are impermanent, which are inherently permanent, blissful, and self.",
        "source": "T38n1768_001:0237b01_5"
    },
    {
        "source_sentence": "八味者，開善四德為八味，謂：一常、二恒、三安、四無垢、五不老、六不死、七快樂、八清涼。",
        "translation": "The eight flavors are the eight flavors that reveal the four virtues of goodness, which are: 1. permanence, 2. constancy, 3. peace, 4. immaculateness, 5. immortality, 6. immortality, 7. bliss, and 8. clarity",
        "source": "T38n1768_001:0237b02_0"
    },
    {
        "source_sentence": "開善為恒，河西云常，「常」、「恒」者名異義一。",
        "translation": "To reveal that goodness is constant, the river west says constant, and the words constant and constant are different in meaning but one.",
        "source": "T38n1768_001:0237b03_1"
    },
    {
        "source_sentence": "不從緣生為「常」，始終真實為「恒」；",
        "translation": "What does not arise from conditions is eternal, and what is real in the beginning and end is eternal.",
        "source": "T38n1768_001:0237b04_2"
    },
    {
        "source_sentence": "開「樂」為「安」，內無惱為「樂」，外不危曰「安」也；",
        "translation": "The word happiness is translated as peace, none of the internal afflictions as happiness, and none of the external dangers as peace.",
        "source": "T38n1768_001:0237b05_3"
    },
    {
        "source_sentence": "不老、不死是「我」（我故不老，我故不死也）；",
        "translation": "Not getting old and not dying is self (because of self I don't get old, and because of self I don't die);",
        "source": "T38n1768_001:0237b06_4"
    },
    {
        "source_sentence": "清涼、無垢並是「淨」義也。",
        "translation": "The meaning of cool and undefiled is also the meaning of pure.",
        "source": "T38n1768_001:0237b07_5"
    },
    {
        "source_sentence": "涅槃復有八相，如文云：好體對五門應明五德，但不淨觀在初，聖人不為，",
        "translation": "Again, nirvana has eight characteristics. As stated in the text: The good essence should be distinguished from the five aspects as follows:",
        "source": "T38n1768_001:0237b07_6"
    },
    {
        "source_sentence": "但有四倒，四德對四倒，故明四行四德也。",
        "translation": "However, there are four errors, and the four virtues oppose the four errors, so they explain the four practices and four virtues.",
        "source": "T38n1768_001:0237b09_7"
    },
    {
        "source_sentence": "又對四人明四因四德。",
        "translation": "Again, he explains to four people the four causes and four virtues of the four causes.",
        "source": "T38n1768_001:0237b10_8"
    },
    {
        "source_sentence": "四人者：則闡提、外道、聲聞、緣覺也，四因者：謂信心、般若、虛空三昧、大悲。",
        "translation": "The four kinds of people are: icchantikas, non-Buddhists, śrāvakas, and pratyekbuddhas. The four causes are faith, prajñā, the samādhi of space, and great compassion.",
        "source": "T38n1768_001:0237b10_9"
    },
    {
        "source_sentence": "破闡提不信明信，信故得淨德也；",
        "translation": "The icchantika did not believe in the doctrine of superstition. Because of their faith they acquired pure and genuine qualities.",
        "source": "T38n1768_001:0237b12_10"
    },
    {
        "source_sentence": "般若對外道，外道著我人一異，般若正慧破一異，我心故明。",
        "translation": "Prajñāpāramitā externally teaches, non-Buddhists cling to the one difference between self and person, and prajñāpāramitā and right wisdom refute the one difference, which is explained because of self and mind.",
        "source": "T38n1768_001:0237b13_11"
    },
    {
        "source_sentence": "般若故得真我德；",
        "translation": "Because of prajñā they attain the virtue of true self.",
        "source": "T38n1768_001:0237b14_12"
    },
    {
        "source_sentence": "虛空三昧破聲聞厭苦無常，在可厭故得三昧，三昧故得樂德也；",
        "translation": "The samādhi of space destroys the sravakas’ disillusionment with unsatisfactoriness as suffering and impermanence. Because it is unsatisfactoriness, they attain samadhi; because of samddhis, they attain blissful",
        "source": "T38n1768_001:0237b15_0"
    },
    {
        "source_sentence": "大悲對緣覺，緣覺著無常果永入滅，無大悲故。",
        "translation": "Great compassion is directed toward the pratyekabuddhas, and the pratyekabuddhas are attached to impermanent fruits that permanently enter into cessation because they lack great compassion.",
        "source": "T38n1768_001:0237b16_1"
    },
    {
        "source_sentence": "大悲破無常得常德也。",
        "translation": "Great compassion destroys impermanence and attains the virtue of permanence.",
        "source": "T38n1768_001:0237b17_2"
    },
    {
        "source_sentence": "為對四人明四因，故釋四德也。",
        "translation": "In order to explain the four causes for the four people, he explains the four virtues.",
        "source": "T38n1768_001:0237b18_3"
    },
    {
        "source_sentence": "但此四德，《大經》辨其名數不同。",
        "translation": "However, these four virtues are different in name from those described in the Mahāprajñāpāramitā-sūtra.",
        "source": "T38n1768_001:0237b18_4"
    },
    {
        "source_sentence": "「常」不見別名數，直明常而恒耳——但無常有二種：一生滅，二流動——對生滅故言常，",
        "translation": "Impermanent doesn't see separate names and numbers, but simply explains that it's permanent and eternal - but there are two kinds of impermanence: first, arising and ceasing in one lifetime, and second, flowing - which are called",
        "source": "T38n1768_001:0237b19_5"
    },
    {
        "source_sentence": "流動故言恒也。",
        "translation": "Because it moves, it's called constant.",
        "source": "T38n1768_001:0237b21_6"
    },
    {
        "source_sentence": "「樂」名數不同，經云有佛二樂：謂覺知樂及寂滅樂。",
        "translation": "The names of bliss are different, as the sūtras say, There are two kinds of bliss of buddhahood: the bliss of awakening and the bliss of extinction.",
        "source": "T38n1768_001:0237b21_7"
    },
    {
        "source_sentence": "實相樂之三樂無愛樂。",
        "translation": "The three real forms of happiness are the three kinds of happiness that lack craving.",
        "source": "T38n1768_001:0237b22_8"
    },
    {
        "source_sentence": "佛性一樂謂菩提樂也。",
        "translation": "The single bliss of the buddha-nature is called the bliss of enlightenment.",
        "source": "T38n1768_001:0237b23_9"
    },
    {
        "source_sentence": "復有四樂：一、斷樂，若不斷樂還成有斷，在復斷樂，故名大樂；",
        "translation": "4.5.29 Again, there is another fourfold doctrine that explains four kinds of happiness:",
        "source": "T38n1768_001:0237b23_10"
    },
    {
        "source_sentence": "二、寂滅樂；",
        "translation": "The second is the bliss of extinction.",
        "source": "T38n1768_001:0237b25_11"
    },
    {
        "source_sentence": "三、一切智樂，若不知則若一切智故樂；",
        "translation": "The third is the bliss of omniscience. If one does not know it, then neither is the bliss because of omniscience.",
        "source": "T38n1768_001:0237b25_12"
    },
    {
        "source_sentence": "四、身不壞故樂。",
        "translation": "4. bliss because the body doesn't break down.",
        "source": "T38n1768_001:0237b26_13"
    },
    {
        "source_sentence": "「我」有八自在，義如經也。",
        "translation": "Self has eight kinds of unimpededness, which are as explained in the sūtras.",
        "source": "T38n1768_001:0237b26_14"
    },
    {
        "source_sentence": "「淨」有四種：一、有淨，離二十五有。",
        "translation": "There are four kinds of purity: 1. there's purity, which is free of the twenty-five existences.",
        "source": "T38n1768_001:0237b27_15"
    },
    {
        "source_sentence": "二、樂淨，凡夫一樂不淨也。",
        "translation": "2. happiness and purity, which are the unpleasant and impure qualities of ordinary people.",
        "source": "T38n1768_001:0237b27_16"
    },
    {
        "source_sentence": "三、身淨，身無常不淨。",
        "translation": "3. The body is pure, and the body is impermanent and impure.",
        "source": "T38n1768_001:0237b28_17"
    },
    {
        "source_sentence": "四、心淨，心有漏則不淨，無漏故淨也。",
        "translation": "4. The mind is pure, and when the mind is contaminated, it's impure; because it's uncontaminated, it's pure.",
        "source": "T38n1768_001:0237b29_0"
    },
    {
        "source_sentence": "次、第五明涅槃用。",
        "translation": "Next, the fifth explains the function of nirvāṇa.",
        "source": "T38n1768_001:0237c01_0"
    },
    {
        "source_sentence": "就此亦有三義：一者、明本有用，二者、明照境用，三者、明發智用。",
        "translation": "There are also three meanings here: 1. clarifying the original usefulness, 2. clarifying the function of illuminating objects, and 3. clarifying the function of arousing cognition.",
        "source": "T38n1768_001:0237c01_1"
    },
    {
        "source_sentence": "今第一明本有用。",
        "translation": "The first one now explains that it's originally useful.",
        "source": "T38n1768_001:0237c02_2"
    },
    {
        "source_sentence": "但前已略明本有義，此義未顯，今更廣明之也。",
        "translation": "However, the meaning of originally existent has been briefly explained earlier, but this meaning hasn't been revealed, so now we'll explain it in detail.",
        "source": "T38n1768_001:0237c02_3"
    },
    {
        "source_sentence": "然古來有三解。",
        "translation": "However, there are three ancient explanations.",
        "source": "T38n1768_001:0237c03_4"
    },
    {
        "source_sentence": "第一靈味寶亮：生死之中已有真神之法，但未顯現，如蔽黃金。",
        "translation": "The first is a spiritual flavor that's precious and bright: there are truly divine dharmas in birth-and-death, but they haven't yet been revealed, like covering gold.",
        "source": "T38n1768_001:0237c04_5"
    },
    {
        "source_sentence": "《如來藏》經云：如人弊帛裹黃金像墮泥中，無人知者，有得天眼者，",
        "translation": "The Tathāgatagarbha Sutra says, Suppose a person wraps a gold image in rags and falls into the mud; no one knows it. Someone who has attained divine vision",
        "source": "T38n1768_001:0237c05_6"
    },
    {
        "source_sentence": "提淨洗則金像宛然，真神亦爾，本來已有常住佛體，萬德宛然，但為煩惱所覆，",
        "translation": "The Buddha’s body, which was originally eternally abiding in buddhahood and endowed with myriad virtues, is covered only by the defilements.",
        "source": "T38n1768_001:0237c07_7"
    },
    {
        "source_sentence": "若斷煩惱佛體則現也。",
        "translation": "If he stops the afflictions, the Buddha's essence will be manifested.",
        "source": "T38n1768_001:0237c08_8"
    },
    {
        "source_sentence": "次有新安瑤師云：眾生有成佛之道理，此理是常，故說此眾生為正因佛性。",
        "translation": "Next, there's the new Anyao teacher who says, 'There's a reason for sentient beings to become buddhas, and this reason is permanent; therefore, it's said that these sentient beings are the direct cause of the buddha-",
        "source": "T38n1768_001:0237c09_9"
    },
    {
        "source_sentence": "此理附於眾生，故說為本有也。",
        "translation": "Because this principle is bound to sentient beings, it's said to exist in the past.",
        "source": "T38n1768_001:0237c11_10"
    },
    {
        "source_sentence": "第三、開善具有二義。",
        "translation": "Third, it reveals that goodness has two meanings.",
        "source": "T38n1768_001:0237c11_11"
    },
    {
        "source_sentence": "一者本有，二者始有。",
        "translation": "One is originally existent, and the other is initially existent.",
        "source": "T38n1768_001:0237c12_12"
    },
    {
        "source_sentence": "更無二體，但將兩義成定之耳。",
        "translation": "There are no two bodies, but it's just the two meanings that make up the concentration.",
        "source": "T38n1768_001:0237c12_13"
    },
    {
        "source_sentence": "欲明不有神明，定若有神明則本來有當果之理。",
        "translation": "They want to explain that there's no divine insight, and if there's a divine insight, then there's originally the principle of future fruition.",
        "source": "T38n1768_001:0237c13_14"
    },
    {
        "source_sentence": "此本有義，但約萬行圓滿，金剛心謝，種覺起時，名為始有。",
        "translation": "The meaning of this text is that it only refers to the completion of myriad practices, with the adamantine mind at the time when seeds and feelings arise, which is called the first existence.",
        "source": "T38n1768_001:0237c14_15"
    },
    {
        "source_sentence": "《大經》具有二文：如貧女寶藏、力士額珠、闇室瓶瓫、井中七寶，本自有此。",
        "translation": "The Mahāprajñāpāramitā-sūtra has two texts: Suppose there's a poor woman with a treasure treasure store, a jewel on the forehead of a strong man, a pot in a dark room, or seven treasures in",
        "source": "T38n1768_001:0237c15_16"
    },
    {
        "source_sentence": "證本有之文，下《師子吼》及《迦葉品》中皆以乳酪為譬，明乳中無酪，",
        "translation": "To confirm the text of the original existence, it's shown that in the Shizi roar and the Kāśyapa Chapters, all use milk and cheese as an example to explain that there's no cream in milk.",
        "source": "T38n1768_001:0237c17_17"
    },
    {
        "source_sentence": "但酪從乳生故言有酪。",
        "translation": "But curds arise from milk, so it's called having curds.",
        "source": "T38n1768_001:0237c19_0"
    },
    {
        "source_sentence": "又云：佛性非三世攝，但眾生未聚莊嚴清淨之身，故說佛性在於未來，",
        "translation": "It also says, The buddha-nature isn't included in the three times, but sentient beings don't assemble to adorn pure bodies; therefore, it's said that the buddha-nature will abide in the future.",
        "source": "T38n1768_001:0237c19_1"
    },
    {
        "source_sentence": "此則證始有之文。",
        "translation": "This is the text that proves that it first existed.",
        "source": "T38n1768_001:0237c21_2"
    },
    {
        "source_sentence": "故知佛性具有兩義：若定木石之流，無成之理，此眾生必應作佛，則本有義；",
        "translation": "Therefore, it is known that buddha-nature has two meanings:",
        "source": "T38n1768_001:0237c21_3"
    },
    {
        "source_sentence": "若於佛則今利是因中，因中未有果，則始有義也。",
        "translation": "If the Buddha then now benefits from this cause, and there's no effect in the cause, then there's a meaning of beginning to be.",
        "source": "T38n1768_001:0237c23_4"
    },
    {
        "source_sentence": "今並不同。",
        "translation": "Now, they're all different.",
        "source": "T38n1768_001:0237c24_5"
    },
    {
        "source_sentence": "且破第一義：若定本有真神則同僧法；",
        "translation": "It also refutes the first doctrine, that if there were a real soul in samdhi, it would be the same as the dharmas of the samgha.",
        "source": "T38n1768_001:0237c24_6"
    },
    {
        "source_sentence": "又若因中已有，則同賣乳索酪價、貨草馬索駒直也；",
        "translation": "Furthermore, if the cause already exists in the middle, then they'll all sell milk for the price of soap and cream or goods, grass, horses, sheep, and horses at the same price.",
        "source": "T38n1768_001:0237c25_7"
    },
    {
        "source_sentence": "又真神力大，何意住煩惱中而不能排煩惱出，而待修道斷惑乃得出耶？",
        "translation": "Also, since the true power of supernormal cognition is so great, what's the intention to abide in afflictions and not be able to expel afflictions that can't be expelled but wait for cultivation to end afflictions before they",
        "source": "T38n1768_001:0237c26_8"
    },
    {
        "source_sentence": "破第二義解：若得佛之理已自是常，則眾生身中已有常住之法，還成常見之執，",
        "translation": "It refutes the second interpretation of meaning: If someone has attained the Buddha's principle that self is permanent, then there are already eternally abiding dharmas in the bodies of sentient beings, and they still cling to common sense.",
        "source": "T38n1768_001:0237c28_9"
    },
    {
        "source_sentence": "非真神之法；",
        "translation": "It is not the Dharma of true spirituality.",
        "source": "T38n1768_001:0238a01_10"
    },
    {
        "source_sentence": "若此理無常，則不成本有之義。",
        "translation": "If this principle is impermanent, then it doesn't cost the meaning of existence.",
        "source": "T38n1768_001:0238a01_11"
    },
    {
        "source_sentence": "次破第三開善解具二義：汝言常住之法常有、始有者，亦應常住之法有曾、有今，",
        "translation": "You say that the eternally abiding dharma always exists and that when it first exists, it should also be that the eternally abiding dharma has a past and a present.",
        "source": "T38n1768_001:0238a02_12"
    },
    {
        "source_sentence": "若有曾有今則墮三世，成無常。",
        "translation": "If there's a past existence, then they'll fall into the three worlds and become impermanent.",
        "source": "T38n1768_001:0238a03_13"
    },
    {
        "source_sentence": "反詰云（又難）：若常住之法復有始有之義者，亦應無常之法，應無本有之義；",
        "translation": "If the eternally abiding dharma also has the meaning of beginning existence, it should also be an impermanent dharma and not have the meaning of originally existing dharma.",
        "source": "T38n1768_001:0238a04_14"
    },
    {
        "source_sentence": "若無常法但有始有，無本有者，則常住法但是本有，無始有也。",
        "translation": "If impermanent dharmas only have beginnings and no beginnings, then the eternally abiding dharmas only have beginnings and beginningless dharmas.",
        "source": "T38n1768_001:0238a06_15"
    },
    {
        "source_sentence": "又，常住之法具二義者，何因所出？",
        "translation": "Furthermore, if the eternally abiding dharma has both meanings, what is the reason it comes forth?",
        "source": "T38n1768_001:0238a07_16"
    },
    {
        "source_sentence": "本有之義須了因而出，始有之義復為何所感？",
        "translation": "The meaning of the originally existent must be comprehended and therefore produced, and what is the meaning of the initially existent that's also induced?",
        "source": "T38n1768_001:0238a08_17"
    },
    {
        "source_sentence": "若無別因，則應無別有；",
        "translation": "If there were no separate causes, there would be no separate existence.",
        "source": "T38n1768_001:0238a09_18"
    },
    {
        "source_sentence": "既有二有，則便兩因，若從生因則無常也。",
        "translation": "Since there are two existences, then there are two causes, and if the cause arises from birth, then it's impermanent.",
        "source": "T38n1768_001:0238a10_19"
    },
    {
        "source_sentence": "今明涅槃未曾本，亦不曾始。",
        "translation": "Now, it's clear that nirvāṇa has never existed before and doesn't have a beginning.",
        "source": "T38n1768_001:0238a11_20"
    },
    {
        "source_sentence": "為破本故始，道始亦為洗，故云本到則顯。",
        "translation": "It's because of the destruction of the original that it starts, and the beginning of the path is also to wash away. That's why it's said that the original arrives then appear.",
        "source": "T38n1768_001:0238a11_21"
    },
    {
        "source_sentence": "道非本始，非本始，並是方便也。",
        "translation": "The path isn't the original beginning, and what's not the original beginning is also the method.",
        "source": "T38n1768_001:0238a12_22"
    },
    {
        "source_sentence": "第二、照境用。",
        "translation": "The second is the function of illuminating objects.",
        "source": "T38n1768_001:0238a13_23"
    },
    {
        "source_sentence": "又二：初照俗境，次明真境。",
        "translation": "There are two more: first, it illuminates the mundane realm, and second, it explains the true realm.",
        "source": "T38n1768_001:0238a13_24"
    },
    {
        "source_sentence": "今先明俗境。",
        "translation": "Now, let's first explain the mundane realm.",
        "source": "T38n1768_001:0238a14_25"
    },
    {
        "source_sentence": "明俗中有流動□法去來，今佛智作，若為照，若逐境，有去來，則佛知無常；",
        "translation": "It means that in the mundane world, there is a flowing dharma of past and future [dharmas]. The Buddha’s knowledge now manifests it; if he acts to illuminate it or follows its objects with past and future [dharmas]",
        "source": "T38n1768_001:0238a14_26"
    },
    {
        "source_sentence": "若不逐境，境去來，則不與境攝。",
        "translation": "If someone doesn't follow objects, and objects come and go, then they won't be included with objects.",
        "source": "T38n1768_001:0238a16_27"
    },
    {
        "source_sentence": "(弟子決解孝云：境有去來，是□誰心？",
        "translation": "(The disciple resolutely understands filial piety and says, 'There's going and coming in the objective realm, so whose mind is it?'",
        "source": "T38n1768_001:0238a16_28"
    },
    {
        "source_sentence": "若約因緣去來，境智亦因緣；",
        "translation": "In the case of going and coming in relation to causes and conditions, knowledge of objects is also a cause and condition.",
        "source": "T38n1768_001:0238a17_29"
    },
    {
        "source_sentence": "去來既因緣，何因果去來與不去來？",
        "translation": "Since going and coming are causes and conditions, what is the cause and effect of going and coming and neither going nor coming?",
        "source": "T38n1768_001:0238a17_30"
    },
    {
        "source_sentence": "去則靜，來則動，因緣則智，智則無相。",
        "translation": "When going is quiescence, it's stillness; when coming comes coming, it's movement; when there are causes and conditions, it's cognition; and when there's cognition, it has no characteristics.",
        "source": "T38n1768_001:0238a17_31"
    },
    {
        "source_sentence": "但覺者去來，是相無常。",
        "translation": "But the perception of going and coming is impermanent in characteristics.",
        "source": "T38n1768_001:0238a18_32"
    },
    {
        "source_sentence": "若知無常，境智亦無常，是來有得為疑，且去來相則顛倒，顛倒之境本來所無，",
        "translation": "If you know that impermanence is not permanent and that the knowledge of objects is also impermanent, then there will be doubt about acquisition in the future. Moreover, if you look at past and future characteristics, you are mistaken. The mistaken",
        "source": "T38n1768_001:0238a18_33"
    },
    {
        "source_sentence": "何智所知？",
        "translation": "What is known by which knowledge?",
        "source": "T38n1768_001:0238a18_34"
    },
    {
        "source_sentence": ")故彭城法師為此難故，明果乃無大期，生滅猶有，念念流動，逐境去來。",
        "translation": ") Because of this difficulty, the teacher Pengcheng explained that there's no great promise for fruition, and there's still birth and cessation, which are constantly present in each other's minds as they go and come according to their objects.",
        "source": "T38n1768_001:0238a18_35"
    },
    {
        "source_sentence": "此解不可。",
        "translation": "This explanation is unacceptable.",
        "source": "T38n1768_001:0238a20_36"
    },
    {
        "source_sentence": "故經云：若言如來無常，舌則墮落。",
        "translation": "That's why the sūtra says, If you say the Tathāgata is impermanent, your tongue will fall down.",
        "source": "T38n1768_001:0238a20_37"
    },
    {
        "source_sentence": "此師現世舌爛口中也，彼師尋改悔，作懸高堂。",
        "translation": "This teacher now has his tongue rotten in his mouth, so he repents and builds a high hall.",
        "source": "T38n1768_001:0238a21_38"
    },
    {
        "source_sentence": "譬如鏡在高堂，萬像現鏡中矣。",
        "translation": "It's like a mirror in a high hall where myriad images are reflected in a mirror.",
        "source": "T38n1768_001:0238a22_39"
    },
    {
        "source_sentence": "像有去來，鏡無生滅，雖作此解，猶在不免難。",
        "translation": "Although the image has a past and future, the mirror has no arising or ceasing, even though it makes this interpretation, it's still in an unfathomable state.",
        "source": "T38n1768_001:0238a23_40"
    },
    {
        "source_sentence": "鏡是無情，知是靈識；",
        "translation": "The mirror is insentient and knows it to be spiritual consciousness.",
        "source": "T38n1768_001:0238a24_41"
    },
    {
        "source_sentence": "又且鏡是無常，云何得譬常住之智？",
        "translation": "Furthermore, since the mirror is impermanent, how can it be compared to the eternally abiding wisdom?",
        "source": "T38n1768_001:0238a24_42"
    },
    {
        "source_sentence": "第二、安師云：知體是常，用則無常，用無常，故逐境去來也。",
        "translation": "Second, An's teacher said, Knowing that the essence is permanent, function is impermanent, and function is impermanent, so it follows objects from one place to another.",
        "source": "T38n1768_001:0238a25_43"
    },
    {
        "source_sentence": "此亦不可。",
        "translation": "This is also unacceptable.",
        "source": "T38n1768_001:0238a26_44"
    },
    {
        "source_sentence": "豈得分如來體是無為，用是有為？",
        "translation": "How can it be that the Tathāgata's essence is unconditioned and its function is conditioned?",
        "source": "T38n1768_001:0238a27_45"
    },
    {
        "source_sentence": "經云：正見者應說如來定是無為故也。",
        "translation": "The sūtras say, A correct view is to say that the Tathāgata's concentration is because it's unconditioned.",
        "source": "T38n1768_001:0238a27_46"
    },
    {
        "source_sentence": "第三、光宅師作例解如今：以無常之智，照常住之法；",
        "translation": "Third, Guangzhai explains the present by analogy: By means of impermanent knowledge he illumines the eternally abiding dharma.",
        "source": "T38n1768_001:0238a28_47"
    },
    {
        "source_sentence": "而不逐境之智是常。",
        "translation": "The cognition that doesn't follow objects is permanent.",
        "source": "T38n1768_001:0238a29_48"
    },
    {
        "source_sentence": "此亦不可！",
        "translation": "This is also not possible!",
        "source": "T38n1768_001:0238a29_49"
    },
    {
        "source_sentence": "智既不同境常者，亦以常住之智，照無常之境，豈應逐境無常耶？",
        "translation": "Since cognition is different from the permanence of objects, how could it follow that objects are impermanent when it's illuminated by the eternally abiding cognition that illuminates impermanent objects?",
        "source": "T38n1768_001:0238a29_50"
    },
    {
        "source_sentence": "第四、復有一解作「九照境」義。",
        "translation": "Fourth, there's another interpretation that makes the meaning of nine illuminating objects.",
        "source": "T38n1768_001:0238b02_51"
    },
    {
        "source_sentence": "此智雖照未來，復有當現在、當過去義。",
        "translation": "Although this knowledge illuminates the future, there is also the meaning of what will be present and what will be in the past.",
        "source": "T38n1768_001:0238b03_0"
    },
    {
        "source_sentence": "我皆照竟，所以不生不滅也。",
        "translation": "I have illuminated them all, so they don't arise and don't cease.",
        "source": "T38n1768_001:0238b03_1"
    },
    {
        "source_sentence": "此解不可。",
        "translation": "This explanation is unacceptable.",
        "source": "T38n1768_001:0238b04_2"
    },
    {
        "source_sentence": "明向在未來時是「當現在」，未正現在；",
        "translation": "It is stated that at the moment of going to be in the future, it is ‘to be present’:",
        "source": "T38n1768_001:0238b04_3"
    },
    {
        "source_sentence": "今遂成正「現在」，則作「正現在」。",
        "translation": "Now, it's thus formed as the correct present, and then it's called the correct present.",
        "source": "T38n1768_001:0238b05_4"
    },
    {
        "source_sentence": "照當知息不息耶？",
        "translation": "Do you know whether it's calming or not calming?",
        "source": "T38n1768_001:0238b06_5"
    },
    {
        "source_sentence": "若息便為生滅，不息何有此理？",
        "translation": "If it were to cease, there would be arising and ceasing; but if it did not cease, how could there be this principle?",
        "source": "T38n1768_001:0238b06_6"
    },
    {
        "source_sentence": "當知不息只有「當知」，無現在知也。",
        "translation": "You should know that there's only'should be known' when it doesn't stop, and there's no present knowing.",
        "source": "T38n1768_001:0238b07_7"
    },
    {
        "source_sentence": "第五、作「逆照」義。",
        "translation": "Fifth, it creates the meaning of adversely illuminating.",
        "source": "T38n1768_001:0238b08_8"
    },
    {
        "source_sentence": "明如來道成正覺時，一念併逆照竟。",
        "translation": "It explains that when the Tathāgata's path becomes perfectly enlightened, a single thought combines with reverse illumination.",
        "source": "T38n1768_001:0238b08_9"
    },
    {
        "source_sentence": "後境自去來，知不新知。",
        "translation": "The subsequent objects are known and not newly known, whether they come or go.",
        "source": "T38n1768_001:0238b09_10"
    },
    {
        "source_sentence": "如天子初登極時，併作制法，後人犯者，隨輕重治之，不復更制，佛智照境亦爾也。",
        "translation": "Just as when the celestial being first ascends to the summit, he makes a combined rule of restraint, and those who violate it later are treated according to their seriousness and severity and no longer restrained, so is Buddha's wisdom illumina",
        "source": "T38n1768_001:0238b09_11"
    },
    {
        "source_sentence": "此義亦不可。",
        "translation": "This meaning is also unacceptable.",
        "source": "T38n1768_001:0238b11_12"
    },
    {
        "source_sentence": "佛智照境，何曾暫息，而言成道時照，後時不照，縱如此，終不與境相拔也。",
        "translation": "When the Buddha's wisdom illuminates objects, how could there ever be a momentary cessation when he says it illuminates at the time of his attainment of enlightenment and doesn't illuminate at the time afterwards? Even so,",
        "source": "T38n1768_001:0238b12_0"
    },
    {
        "source_sentence": "第六、明「橫竪照」義。",
        "translation": "The sixth clarifies the meaning of horizontal illumination.",
        "source": "T38n1768_001:0238b13_1"
    },
    {
        "source_sentence": "明佛在因之月，道初心已能橫照竪照；",
        "translation": "It means that the Buddha is in the causal moon. The first mind of enlightenment can illuminate horizontally and vertically, as well as illuminate vertically.",
        "source": "T38n1768_001:0238b14_2"
    },
    {
        "source_sentence": "次入初地則能一念之中橫照百法，竪照百時；",
        "translation": "In the next stage one can illuminate a hundred dharmas in a single thought and illumine a hundred moments simultaneously.",
        "source": "T38n1768_001:0238b14_3"
    },
    {
        "source_sentence": "乃至二地，于時至佛地，萬法萬時。",
        "translation": "It goes up to the second ground and reaches the Buddha-stage at the right time, where it's myriad dharmas for ten thousand times.",
        "source": "T38n1768_001:0238b16_0"
    },
    {
        "source_sentence": "又作虛空譬，物在空中，物有生滅，空無去來。",
        "translation": "It's also an analogy of space, where things are in the sky and things arise and cease, and emptiness has no going or coming.",
        "source": "T38n1768_001:0238b16_1"
    },
    {
        "source_sentence": "此亦不可。",
        "translation": "This is also unacceptable.",
        "source": "T38n1768_001:0238b17_2"
    },
    {
        "source_sentence": "虛空無智，佛果靈智，豈得喻耶？",
        "translation": "Space has no cognition, so how could it be a metaphor for the Buddha's fruit of spiritual cognition?",
        "source": "T38n1768_001:0238b18_0"
    },
    {
        "source_sentence": "今明如來智慧，寂絕凝遠。",
        "translation": "Now, it's clear that the Tathāgata's wisdom is tranquil and concentrated.",
        "source": "T38n1768_001:0238b18_1"
    },
    {
        "source_sentence": "非常無常，能常無常；",
        "translation": "What is impermanent is impermanent, what can be impermanent is impermanent.",
        "source": "T38n1768_001:0238b19_2"
    },
    {
        "source_sentence": "非生滅非非生滅，能生滅能無生滅。",
        "translation": "Neither arising and ceasing nor non-arising and non-ceasing can arise and cease, and they can neither arise nor cease.",
        "source": "T38n1768_001:0238b19_3"
    },
    {
        "source_sentence": "無照而照，照無所照也。",
        "translation": "It illuminates without illumination, and illuminating has nothing to illuminate.",
        "source": "T38n1768_001:0238b20_4"
    },
    {
        "source_sentence": "次明真義，但古來有二解。",
        "translation": "Next, it explains the true meaning, but there are two interpretations from ancient times.",
        "source": "T38n1768_001:0238b20_5"
    },
    {
        "source_sentence": "第一、開善明知照真，即與冥一，無復境智異。",
        "translation": "The first is that it reveals the goodness of knowing and illuminating the true, which is to say, it's the same as the darkness, and there's no difference between cognition of objects and cognition.",
        "source": "T38n1768_001:0238b21_6"
    },
    {
        "source_sentence": "所以爾者，智體既妙，湛然常寂，與境不殊，但約德而辨自有三句：一凡夫不冥不會，",
        "translation": "Because the essence of knowledge is marvelous, subtle and eternally tranquil, not different from objects. There are only three phrases that describe it in terms of virtue:",
        "source": "T38n1768_001:0238b22_7"
    },
    {
        "source_sentence": "二因中聖人會而不冥，三者佛果亦冥亦會也。",
        "translation": "The second cause is that the sages assemble but aren't united, and the third is that the Buddha-fruit is also united and united.",
        "source": "T38n1768_001:0238b24_8"
    },
    {
        "source_sentence": "第二解不同此說，明佛知是靈智之智，真諦是無智之境，兩體既殊，豈可研此有智之法，",
        "translation": "The second interpretation differs from this explanation, which explains that Buddhahood is the knowledge of spiritual cognition and that the true truth is the sphere of noncognition. Since the two are so different in essence, how can one analyze the doctrine of",
        "source": "T38n1768_001:0238b25_9"
    },
    {
        "source_sentence": "同無知之境？",
        "translation": "They're the same as the sphere of nescience?",
        "source": "T38n1768_001:0238b27_10"
    },
    {
        "source_sentence": "但會之既極，詺為冥耳，豈得有冥異會耶？",
        "translation": "But since the assembly is so great, how could there be a mysterious assembly?",
        "source": "T38n1768_001:0238b27_11"
    },
    {
        "source_sentence": "然經中亦有冥會之言，故《慧印三昧經》云：「冥不冥，寂不寂。」",
        "translation": "However, the sūtras also say that there's a mysterious assembly, so the Wisdom Seal Samādhi Sutra says, Mysterious and not mysterious, quiescent and not quiescent.",
        "source": "T38n1768_001:0238b28_12"
    },
    {
        "source_sentence": "《肇論》亦有用冥體寂之語。",
        "translation": "The Zhao lun also uses the words of mysterious essence and quiescence.",
        "source": "T38n1768_001:0238b29_13"
    },
    {
        "source_sentence": "真體寂滅，言境相定異，豈得言冥言會。",
        "translation": "The true essence is tranquil, but the words and objects are definitely different, so how can we say that it's a combination of mysterious words?",
        "source": "T38n1768_001:0238c01_14"
    },
    {
        "source_sentence": "今明境智未曾一，亦復不異。",
        "translation": "Now, we'll explain that cognition of objects has never been one, and it's no different.",
        "source": "T38n1768_001:0238c02_15"
    },
    {
        "source_sentence": "故影師云：「內外並冥，緣智俱寂也。」",
        "translation": "That's why the master Ying said, Both inside and outside are mysterious, and both cognition and conditions are quiescent.",
        "source": "T38n1768_001:0238c02_16"
    },
    {
        "source_sentence": "次明佛果涅槃發智用。",
        "translation": "Next, it explains the function of the buddha-fruit and nirvāṇa that gives rise to wisdom.",
        "source": "T38n1768_001:0238c04_0"
    },
    {
        "source_sentence": "問：佛果涅槃，為當漸知，為當頓知？",
        "translation": "Question: Should the fruit of Buddhahood and nirvana be known gradually or suddenly?",
        "source": "T38n1768_001:0238c04_1"
    },
    {
        "source_sentence": "古來解不同，舉真諦對明，凡有三說：一云：二種皆頓知，不可漸見。",
        "translation": "The ancient explanations differ, but they cite the true truth to contrast and clarify it. There are three sayings: One says that the two kinds are all suddenly known and can't be seen gradually.",
        "source": "T38n1768_001:0238c05_2"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T38n1768_001:0238c06_3"
    },
    {
        "source_sentence": "理既在萬惑之外，雖除一兩分終不見理，要須除或盡理，方可見也。",
        "translation": "Since the principle is outside of myriad afflictions, even though it doesn't see the principle except for one part or two, it must be removed or exhausted before it can be seen.",
        "source": "T38n1768_001:0238c06_4"
    },
    {
        "source_sentence": "十重紙裹物，除九重終不見，除盡方見。",
        "translation": "The tenfold paper wrapped object is not visible except for the ninefold, and it's seen only when it's completely removed.",
        "source": "T38n1768_001:0238c08_5"
    },
    {
        "source_sentence": "第二解云：二種皆可漸知。",
        "translation": "The second explanation says, Both kinds can be gradually known.",
        "source": "T38n1768_001:0238c09_6"
    },
    {
        "source_sentence": "故《漸備經》明一切智慧，皆漸漸滿足，豈可一朝併悟耶？",
        "translation": "That's why the Gradual Preparation Sutra explains that all wisdom is gradually fulfilled, so how could it be combined with awakening in one day?",
        "source": "T38n1768_001:0238c09_7"
    },
    {
        "source_sentence": "第三解云：佛果可頓得，真諦可得漸知。",
        "translation": "The third explanation says, The Buddhahood can be suddenly attained, and the true truth can be gradually known.",
        "source": "T38n1768_001:0238c11_8"
    },
    {
        "source_sentence": "所以爾者，真諦即俗之空，更非遠物，所以得智慧即可分知；",
        "translation": "The real truth is emptiness of the conventional, not something distant from things. That is why one can know it separately by attaining wisdom.",
        "source": "T38n1768_001:0238c11_9"
    },
    {
        "source_sentence": "佛果智出生死之外，所以不可漸知。",
        "translation": "Because buddha-fruit cognition is beyond birth and death, it can't be gradually known.",
        "source": "T38n1768_001:0238c13_10"
    },
    {
        "source_sentence": "今謂此之解皆不可。",
        "translation": "Now, it's said that this explanation is unacceptable.",
        "source": "T38n1768_001:0238c14_11"
    },
    {
        "source_sentence": "初云皆頓知不可者，汝既都未見理，亦應都未斷惑，若少分斷惑，則應少分見理；",
        "translation": "The first one says, All of them are suddenly known as unacceptable. Since you do not see the reason at all, you should also have not abandoned defilement; and if you had abandoned defilement in part, you would have seen the reason in part",
        "source": "T38n1768_001:0238c14_12"
    },
    {
        "source_sentence": "又且不見理則無智慧，無智慧以何除惑耶？",
        "translation": "If you don't see the principle, then there's no wisdom, and if there's no wisdom, how can you remove mental disturbances?",
        "source": "T38n1768_001:0238c16_13"
    },
    {
        "source_sentence": "次皆漸知不可者，明理。",
        "translation": "The next one who gradually knows that they're all unacceptable explains the principle.",
        "source": "T38n1768_001:0238c17_14"
    },
    {
        "source_sentence": "若有分可得分知，理既通同無分，那可分知；",
        "translation": "If there are parts that can be discerned by division, then since the principle is general and same as nondivision, how could it be discerned by division?",
        "source": "T38n1768_001:0238c18_15"
    },
    {
        "source_sentence": "又責初地見真，為已稱理，為不稱理？",
        "translation": "Also, does the first ground rebuke someone who sees what's true, whether they've called it principle or not?",
        "source": "T38n1768_001:0238c19_16"
    },
    {
        "source_sentence": "若已稱理，與二地何異？",
        "translation": "If you have called it the principle, how is it different from the two stages?",
        "source": "T38n1768_001:0238c19_17"
    },
    {
        "source_sentence": "若未稱理，何謂見理？",
        "translation": "If someone doesn't call it the principle, what's meant by seeing the principle?",
        "source": "T38n1768_001:0238c20_18"
    },
    {
        "source_sentence": "第三家具招二難，又且二語自相反，故不可。",
        "translation": "The third one invites two difficulties, and it's not allowed because the two words are contradictory to each other.",
        "source": "T38n1768_001:0238c20_19"
    },
    {
        "source_sentence": "今明至理尚無頓漸，豈有頓漸之知？",
        "translation": "Now, it's clear that the ultimate principle is still without sudden and gradual, so how could there be sudden and gradual knowing?",
        "source": "T38n1768_001:0238c21_20"
    },
    {
        "source_sentence": "雖無頓漸，亦頓亦漸。",
        "translation": "Even though there's no sudden or gradual, it's both sudden and gradual.",
        "source": "T38n1768_001:0238c22_21"
    },
    {
        "source_sentence": "故經云：發心畢竟，二不別。",
        "translation": "That's why the sūtra says, The arousal of mind is final, and the two aren't distinct.",
        "source": "T38n1768_001:0238c23_22"
    },
    {
        "source_sentence": "《華嚴》云：初心菩薩與三世佛等，而復有漸漸知義，有五十二地不同，",
        "translation": "The Flower Ornament teaches that the first mind is distinct from the bodhisattvas of the past, present, and future buddhas; it also has gradual knowledge. There are fifty-two stages:",
        "source": "T38n1768_001:0238c23_23"
    },
    {
        "source_sentence": "初地百法，二地千法故也。",
        "translation": "The first stage consists of one hundred dharmas and the second stage of one thousand dharmas.",
        "source": "T38n1768_001:0238c25_24"
    },
    {
        "source_sentence": "第六、總問答料簡。",
        "translation": "The sixth is a summary of the general questions and answers.",
        "source": "T38n1768_001:0238c26_0"
    },
    {
        "source_sentence": "此涅槃有三本，雙卷大千本及六卷。",
        "translation": "This nirvana has three texts: a double-fascicle Maha chiliocosm and six fascicles.",
        "source": "T38n1768_001:0238c26_1"
    },
    {
        "source_sentence": "說者不同，有雙卷是小乘經，二是大乘。",
        "translation": "The explanation is different: there are two double-fascicle Mahayana scriptures of the lesser vehicle and two Mahayana scriptures.",
        "source": "T38n1768_001:0238c27_2"
    },
    {
        "source_sentence": "或云：同座異聞故，廣略差別也。",
        "translation": "Or, it might be said, Because the same seat is heard differently, there's a distinction in breadth and depth.",
        "source": "T38n1768_001:0238c28_3"
    },
    {
        "source_sentence": "有云翻有廣略，多應爾。",
        "translation": "Some say that there are extensive and abbreviated versions, but this should be the case for most.",
        "source": "T38n1768_001:0238c28_4"
    },
    {
        "source_sentence": "法顯得大本上帙，翻為六卷故也。",
        "translation": "The Dharma reveals the great text of the above-mentioned book, which is translated into six fascicles.",
        "source": "T38n1768_001:0238c29_5"
    },
    {
        "source_sentence": "涅槃經遊意(終)",
        "translation": "Nirvāṇa-sūtra's Traveling Meaning (end)",
        "source": "T38n1768_001:0239a02_0"
    },
    {
        "source_sentence": "道融先於江南會稽遊學，聞彼大德等云：其吉藏法師《涅槃疏記》等，",
        "translation": "Daorong had previously traveled to Jiangnan and studied in the assembly hall. He heard these virtuous monks and others say that the Master Kisaradharma’s Commentary on the Nirvana Sutra, etc.",
        "source": "T38n1768_001:0239a04_0"
    },
    {
        "source_sentence": "百濟僧並將歸鄉，所以此間無本留行。",
        "translation": "Hundreds of monks and nuns were all returning to their native land, so there was no original place for them to stay.",
        "source": "T38n1768_001:0239a05_1"
    },
    {
        "source_sentence": "道融　《京感亭》曰：年過見百濟，賢者持此吉藏法師《涅槃玄意》，",
        "translation": "Daorong's Jinggangting jing says, When he saw Baiji in the past years, the good man held this sutra of the profound meaning of nirvāṇa by the master Jizang.",
        "source": "T38n1768_001:0239a06_2"
    },
    {
        "source_sentence": "行故鄉寫之二，有疏，而未得讀，乃寫其，賢者在彼訓。",
        "translation": "There were two commentaries written in his native land but he could not read them, so he wrote them. The venerable monk was instructed to do so at that place.",
        "source": "T38n1768_001:0239a08_3"
    }
]