[
    {
        "source_sentence": "關中創立戒壇圖經(并序)",
        "translation": "Guanzhong xiuxing jietai zhuantu jing (and preface)",
        "source": "T45n1892_001:0807a04_0"
    },
    {
        "source_sentence": "大唐京師西明寺沙門釋道宣撰",
        "translation": "Compilation by Shi Daoxuan, a monk of Ximingsi Temple in the Great Tang capital",
        "source": "T45n1892_001:0807a06_0"
    },
    {
        "source_sentence": "余以闇昧，少參學府，優柔教義，諮質賢明，問道絕於儒文，欽德承於道立，",
        "translation": "Because of my darkness and ignorance, I have been studying the theories of Buddhism at the imperial court for a long time. Being an expert in both doctrine and doctrine, I consulted with learned scholars to discuss the theories of",
        "source": "T45n1892_001:0807a08_0"
    },
    {
        "source_sentence": "故居無常師，追千里如咫尺；",
        "translation": "The teacher impermanent of the old residence pursued him for a thousand li, just as if he were traveling within a short distance.",
        "source": "T45n1892_001:0807a09_1"
    },
    {
        "source_sentence": "唯法是務，跨關河如一葦。",
        "translation": "The only thing that matters is the Dharma, which stretches across the customs and rivers like a reed.",
        "source": "T45n1892_001:0807a10_2"
    },
    {
        "source_sentence": "周流晉魏，披閱累於初聞；",
        "translation": "The Zhou and Wei dynasties spread widely throughout the empire. All these books were compiled in the first collection of Buddhist texts.",
        "source": "T45n1892_001:0807a10_3"
    },
    {
        "source_sentence": "顧步江淮，緣搆彰於道聽。",
        "translation": "Looking back at the steps of the rivers and Huai Rivers, it's because they are expressed in the Way to be heard.",
        "source": "T45n1892_001:0807a11_4"
    },
    {
        "source_sentence": "遂以立年方尋鉛墨，律儀博要，行事謀猷，圖傳顯於時心，鈔疏開於有識，",
        "translation": "It was not long before the founding of the monastery that he searched for lead and ink; his disciplinary rules were so extensive as to reveal the minds of the contemporaries. He composed commentaries on the scriptures, beginning",
        "source": "T45n1892_001:0807a12_5"
    },
    {
        "source_sentence": "或注或解，引用寄於前經；",
        "translation": "Some commentaries and some explanations are cited from the scriptures cited above.",
        "source": "T45n1892_001:0807a13_6"
    },
    {
        "source_sentence": "時抑時揚，專門在於成務。",
        "translation": "At the time of suppression and at the time of proclamation, he specialized in accomplishing his duties.",
        "source": "T45n1892_001:0807a14_7"
    },
    {
        "source_sentence": "備通即目，流漸可知，至於戒本壇場，曾未陳廣，雖因事敘，終非錯言。",
        "translation": "Up to the original altar site of the ordination precepts, he had never explained how extensive they were. Although it is a matter of fact and a narrative, it is not a misrepresentation.",
        "source": "T45n1892_001:0807a15_0"
    },
    {
        "source_sentence": "今年出縱心，旦夕蒲柳，一尋此路，若墜諸隍，力疾書之，遺滯非咎，",
        "translation": "This year I am going out of my humble mind to leave the householder’s life. At dawn and at dusk, there are grapes and willow trees growing in all directions on this road. If you fall into the realms of the gods",
        "source": "T45n1892_001:0807a16_1"
    },
    {
        "source_sentence": "乃以乾封二年，於京郊之南，創弘斯法。",
        "translation": "In the second year of the Qianfeng period (557–557 C.E.), he established this teaching south of the capital city.",
        "source": "T45n1892_001:0807a18_2"
    },
    {
        "source_sentence": "原夫戒壇之興，所以立於戒也。",
        "translation": "Originally, when the precepts altar arose, that's why the precepts were established.",
        "source": "T45n1892_001:0807a18_3"
    },
    {
        "source_sentence": "戒為眾聖之行本，又是三法之命根；",
        "translation": "Precepts are the root of all holy deeds, and they are also the life root of the three dharmas.",
        "source": "T45n1892_001:0807a19_4"
    },
    {
        "source_sentence": "皇覺由此以興慈，凡惑假斯而致滅。",
        "translation": "As a result, the imperial enlightenment arouses compassion and extinguishes ordinary confusion about what's false.",
        "source": "T45n1892_001:0807a20_5"
    },
    {
        "source_sentence": "故文云：「如何得知佛法久住？",
        "translation": "The old text says, How do we know the long abiding of the Buddha's teaching?",
        "source": "T45n1892_001:0807a21_6"
    },
    {
        "source_sentence": "若中國十人，邊方五人，如法受戒，是名正法久住。」",
        "translation": "If there are ten people in China and five people in the peripheral direction who receive precepts according to the teaching, this is called a long abiding of the right teaching.",
        "source": "T45n1892_001:0807a21_7"
    },
    {
        "source_sentence": "是知比丘儀體，非戒不存，道必人弘，非戒不立。",
        "translation": "This shows that the essence of a monk's demeanor is not something that doesn't exist without precepts, that the path must be spread by people, and that it's not something that isn't established without precepts.",
        "source": "T45n1892_001:0807a23_8"
    },
    {
        "source_sentence": "戒由作業而克，業必藉處而生，處曰「戒壇」，登降則心因發越；",
        "translation": "The precepts are defeated by action, and action necessarily arises through relying on a place. That place is called the ordination platform; when ascending or descending, it is because of the mind that transgresses.",
        "source": "T45n1892_001:0807a24_9"
    },
    {
        "source_sentence": "地稱勝善，唱結則事用殷勤。",
        "translation": "The earth is praised as superior and good, and when it's called a knot, things are done with diligence.",
        "source": "T45n1892_001:0807a25_10"
    },
    {
        "source_sentence": "豈不以非常之儀，能動非常之致？",
        "translation": "Wouldn't it be because of extraordinary manners that they can move extraordinary causes?",
        "source": "T45n1892_001:0807a26_11"
    },
    {
        "source_sentence": "然則詳其廣也，談論可以處成；",
        "translation": "However, it is detailed and extensive. Discussions can be settled wherever they are held.",
        "source": "T45n1892_001:0807a27_0"
    },
    {
        "source_sentence": "尋其要也，行事難為準的。",
        "translation": "It's difficult to find the essentials, and it's difficult to make them accurate in terms of actions.",
        "source": "T45n1892_001:0807a27_1"
    },
    {
        "source_sentence": "是以諸律文云：「方相莫委於分齊，唱令有昧於前緣，眾集不曉於別同，",
        "translation": "That's why the texts of the Vinaya say, Don't entrust the distinctive characteristics to the partial alignment, and call it so that there be obscurity about the prior condition; the congregation doesn't understand the distinctions.",
        "source": "T45n1892_001:0807a28_2"
    },
    {
        "source_sentence": "通和懵分於成敗。」",
        "translation": "Tongheo's ignorance is divided into formation and defeat.",
        "source": "T45n1892_001:0807a29_3"
    },
    {
        "source_sentence": "並曰：「非界咸乖聖則，雖受不獲，以無界故。」",
        "translation": "They all said, What's not the boundary is completely at odds with the noble rules, and even though it's received or not received, it's because there's no boundary.",
        "source": "T45n1892_001:0807b01_4"
    },
    {
        "source_sentence": "是知：空地架屋，徒費成功，無壇結界，勝心難發。",
        "translation": "From this we may know that the construction of a house in an open space will succeed only at the cost of effort, without any boundary for the altar. It is difficult to undertake with a superior mind.",
        "source": "T45n1892_001:0807b02_5"
    },
    {
        "source_sentence": "今博尋群錄，統括所聞，開法施之初門，仰住法之遺則。",
        "translation": "Now I searched extensively through various records and compiled what I have heard. I opened the first chapter of the Dharma-sacrifice, revering the legacy of the teachings that are preserved in the scriptures.",
        "source": "T45n1892_001:0807b03_6"
    },
    {
        "source_sentence": "若不分衢術，則推步者不識其由，故略位諸門，使曉銳者知非妄立云爾。",
        "translation": "If they don't distinguish the ways of the streets, then those who push steps won't know their causes; therefore, they briefly rank the approaches so that those who are sharp will know that they aren't falsely established as such.",
        "source": "T45n1892_001:0807b04_7"
    },
    {
        "source_sentence": "戒壇元結教興第一(明壇場築基，本唯佛也。",
        "translation": "The precepts altar is originally formed, and the teaching arises first (to explain that the foundation of the altar site is built, which is originally only Buddha-only.",
        "source": "T45n1892_001:0807b08_0"
    },
    {
        "source_sentence": "十方同會，詳述壇場，昔者光明王如來初論建立。",
        "translation": "In all the ten directions they assembled together to give a detailed account of the altar site, which had been built by the Tathāgata King of Illumination in the past at the beginning of his reign.",
        "source": "T45n1892_001:0807b08_1"
    },
    {
        "source_sentence": "故興在大聖，不在人謀，敬重之極也。",
        "translation": "That's why it's so venerated by great sages who aren't involved in human affairs.",
        "source": "T45n1892_001:0807b09_2"
    },
    {
        "source_sentence": ")戒壇立名顯號第二(通檢律論，多云「戒壇」。",
        "translation": ") The second name of the precepts altar is revealed by naming it (commonly referred to as the precepts altar in the Commentary on the Vinaya.",
        "source": "T45n1892_001:0807b09_3"
    },
    {
        "source_sentence": "時俗混之，壇、場莫別，故引群錄，名實兩馳，豈唯常習，守株難革？",
        "translation": "Because the customs of the time and the secular world mixed them together, there was no distinction between the altar and the site. Thus it is cited in various records as a place where both fame and reality flourished. Isnt this just due to",
        "source": "T45n1892_001:0807b10_4"
    },
    {
        "source_sentence": ")戒壇形重相狀第三(既曰「壇」也，出地層基，狀等山王，相同佛座。",
        "translation": ") The third is the shape of the precepts altar (also called an altar, which emerges from a layered base on the ground and looks like a mountain king, the same as the Buddha's throne.",
        "source": "T45n1892_001:0807b11_5"
    },
    {
        "source_sentence": "階除四列，周繞三重，靈骨作鎮，用隆住法。",
        "translation": "It is surrounded by three rows of staircases, with the exception of the four rows of steps. The sacred bones are preserved in a peaceful place to promote the religious life.",
        "source": "T45n1892_001:0807b12_6"
    },
    {
        "source_sentence": ")戒壇高下廣狹第四(高下制量，定約佛肘；",
        "translation": ") The height and width of the ordination altar is fourth (the height and width of the altar are fixed by measuring one yojana.",
        "source": "T45n1892_001:0807b13_7"
    },
    {
        "source_sentence": "為言廣狹，在緣隨機。",
        "translation": "It's because it's said to be wide and narrow, but it's random in terms of conditions.",
        "source": "T45n1892_001:0807b14_8"
    },
    {
        "source_sentence": "大小無局，出於智者商度論通。",
        "translation": "Both large and small are not limited, as explained in the Shangdao lun by Zhizhe.",
        "source": "T45n1892_001:0807b14_9"
    },
    {
        "source_sentence": ")戒壇大界內外第五(統詳諸律，內外在緣。",
        "translation": ") The fifth part of the great boundary of the altar of precepts inside and outside the altar (compiled in detail in the Vinaya, internal and external are within the conditions.",
        "source": "T45n1892_001:0807b15_10"
    },
    {
        "source_sentence": "今以義求，外為別意。",
        "translation": "Now, we're looking for meaning and the external as a separate idea.",
        "source": "T45n1892_001:0807b16_11"
    },
    {
        "source_sentence": ")戒壇結法先後第六(古德行事，大界在先。",
        "translation": ") The precepts are preceded by the rules for forming the altar of morality, followed by the sixth (the ancient virtuous deed is preceded by the great realm.",
        "source": "T45n1892_001:0807b16_12"
    },
    {
        "source_sentence": "今存明檢，壇前界後。",
        "translation": "Now, we'll examine it clearly before the altar and after the boundary.",
        "source": "T45n1892_001:0807b17_13"
    },
    {
        "source_sentence": ")戒壇集僧遠近第七(壇界必初，草創基址，集僧軌度，自有成規。",
        "translation": ") The precepts altar gathered the seventh saṃgha from near and far (the altar realm must begin at the beginning, with a foundation built on grass to gather the saṃgha's guideline, which has its own rules.",
        "source": "T45n1892_001:0807b17_14"
    },
    {
        "source_sentence": "後學師心，多輕本業，必專注教網，依法集人。",
        "translation": "Many of the latter students despise their original occupation and must concentrate on the network of teachings in order to gather people according to the Dharma.",
        "source": "T45n1892_001:0807b18_15"
    },
    {
        "source_sentence": ")戒壇作業成敗第八(「羯磨」西言，唐云「作業」；",
        "translation": ") The Eighth Part: Formation and Destruction of the Precepts Altar (Kāma means karma, which is a western word for action.",
        "source": "T45n1892_001:0807b19_16"
    },
    {
        "source_sentence": "義當分別成敗，曉了時緣。",
        "translation": "The meaning should be discerned as becoming and decaying, understanding the time and conditions.",
        "source": "T45n1892_001:0807b20_17"
    },
    {
        "source_sentence": "言「僧」則六和不乖，述「事」則四界各攝。",
        "translation": "When it says saṃgha, the six harmonies aren't divergent, and when it says things, the four realms are each included.",
        "source": "T45n1892_001:0807b20_18"
    },
    {
        "source_sentence": ")戒壇受時儀軌第九(謂受戒法度，今古相承，若無壇除，登頓失序。",
        "translation": ") The ninth ritual guideline for the time of accepting the precepts at the ordination altar (This refers to the method of taking the precepts, which has been handed down since ancient times. If there's no ordination altar",
        "source": "T45n1892_001:0807b21_19"
    },
    {
        "source_sentence": "故聖立模範，令師資有儀，旋繞跪立，如機候轉也。",
        "translation": "Therefore, the sage establishes an example and causes his teacher to follow proper manners, circumambulate and kneels down as he does in response to the changing of circumstances.",
        "source": "T45n1892_001:0807b22_20"
    },
    {
        "source_sentence": ")戒壇功能遠近第十(一僧結已，經六萬之延年；",
        "translation": ") Tenth: The remoteness and nearness of the functionality of the ordination altar (After one monk has been ordained, it is sixty thousand years in duration.",
        "source": "T45n1892_001:0807b23_21"
    },
    {
        "source_sentence": "三法乃亡，涉千聖而常在，號曰「金剛場地」。",
        "translation": "The three dharmas then died, and the thousand sages were always present, which was called the Vajrapāṇi.",
        "source": "T45n1892_001:0807b24_22"
    },
    {
        "source_sentence": "名義若斯，非聖不曉，凡唯仰止，不可輕焉。",
        "translation": "Such names and meanings are not something that the sages don't understand, but ordinary people simply look up to them and don't despise them.",
        "source": "T45n1892_001:0807b25_23"
    },
    {
        "source_sentence": ")戒壇贊述辨德第十一(戒壇勝德，諸聖共遵，建無上之善根，拔極下之深累，",
        "translation": ") The Eleventh Commentary on the Descriptive Qualities of the Precepts Altar (The superior qualities of the precepts altar are shared by the sages, who establish the unsurpassed good roots and remove the deep afflictions of",
        "source": "T45n1892_001:0807b25_24"
    },
    {
        "source_sentence": "必由此地，方得崇之。",
        "translation": "Only in this land will they be able to revere it.",
        "source": "T45n1892_001:0807b26_25"
    },
    {
        "source_sentence": "豈不頌述神功，贊揚聖德。",
        "translation": "Wouldn't it be a verse that praises the miraculous merits and praises the noble virtues?",
        "source": "T45n1892_001:0807c01_26"
    },
    {
        "source_sentence": ")戒壇元結教興第一檢《別傳》云：「佛在祇樹園中，樓至比丘請佛立壇，",
        "translation": ") The first revised biography of the founder of the precepts altar says, When the Buddha was staying at Jeta's Grove, a monk from Rājagṛha invited the Buddha to set an altar.",
        "source": "T45n1892_001:0807c01_27"
    },
    {
        "source_sentence": "為結戒受戒故。",
        "translation": "It's because they form the precepts and receive the precepts.",
        "source": "T45n1892_001:0807c04_28"
    },
    {
        "source_sentence": "爾時如來依言許已，創置三壇。」",
        "translation": "After the Tathāgata then relied on his words to approve, he created three altars.",
        "source": "T45n1892_001:0807c04_29"
    },
    {
        "source_sentence": "佛院門東名「佛為比丘結戒壇」；",
        "translation": "To the east of the entrance to the Buddha’s monastery it is called Buddhist ordination platform for bhikṣus.",
        "source": "T45n1892_001:0807c05_30"
    },
    {
        "source_sentence": "佛院門西名「佛為比丘尼結戒壇」；",
        "translation": "To the west of the entrance to the Buddha’s monastery is called Buddhist Precepts Forming altars for Monks and nuns.",
        "source": "T45n1892_001:0807c05_31"
    },
    {
        "source_sentence": "外院東門南置「僧為比丘受戒壇」。",
        "translation": "To the southeast of the east gate of the outer hall, he placed the ordination altar for the monks to receive the precepts.",
        "source": "T45n1892_001:0807c06_32"
    },
    {
        "source_sentence": "初置壇日，乃集十方諸佛，于時有八百億，同名釋迦佛；",
        "translation": "On the day when the altar was first set, all the buddhas of the ten directions assembled. At that time there were eighty-eight koṭis of buddhas, all named Śākyamuni Buddhas.",
        "source": "T45n1892_001:0807c07_33"
    },
    {
        "source_sentence": "十方諸佛，同名亦爾。",
        "translation": "So it is with the buddhas of the ten directions.",
        "source": "T45n1892_001:0807c08_34"
    },
    {
        "source_sentence": "時大梵天王造佛院內東戒壇，魔王波旬造佛院內西戒壇。",
        "translation": "At the time, King Mahābrahmā built a precepts altar to the east of the Buddha's monastery and Māra King Pāpīyān built a precepts altar to the west of the Buddha's monastery.",
        "source": "T45n1892_001:0807c09_35"
    },
    {
        "source_sentence": "壇既成已，諸佛登之。",
        "translation": "After the altar was completed, the buddhas ascended to it.",
        "source": "T45n1892_001:0807c10_36"
    },
    {
        "source_sentence": "共議結戒輕重持犯等相，又議度尼滅正法相。",
        "translation": "They discussed the relative seriousness of observing precepts, such as minor and major offenses, and they discussed the characteristics of extinguishing the right teaching for nuns.",
        "source": "T45n1892_001:0807c10_37"
    },
    {
        "source_sentence": "諸佛通議曰：「古有四部，今何獨無？」",
        "translation": "The buddhas discussed it together, saying, There were four ancient teachings, so why isn't there one now?",
        "source": "T45n1892_001:0807c12_0"
    },
    {
        "source_sentence": "初雖正法滅半，能行八敬，還住千年。",
        "translation": "In the first half of the extinction of the true teaching, he was able to perform the eight kinds of veneration and remained there for a thousand years.",
        "source": "T45n1892_001:0807c12_1"
    },
    {
        "source_sentence": "故此二壇唯佛所登，共量佛事。",
        "translation": "Therefore, these two altars are the only ones that the Buddha ascends, and they share the same number of Buddha-works.",
        "source": "T45n1892_001:0807c13_2"
    },
    {
        "source_sentence": "僧受戒壇，佛非僧攝，有時度聖人者，亦臨僧壇，一時行事，非羯磨攝。",
        "translation": "When the saṃgha receives the precepts altar, the Buddha isn't included in the saṃgha, and when he sometimes liberates a sage, he also approaches the saṃgha altar and acts at one time, which is not included",
        "source": "T45n1892_001:0807c14_3"
    },
    {
        "source_sentence": "戒壇立名顯號第二",
        "translation": "Second, the name of the precepts altar is established and its title is revealed.",
        "source": "T45n1892_001:0807c16_0"
    },
    {
        "source_sentence": "律論所顯，「場」、「壇」兩別，西天諸國皆立別儀，此土中原素未行事，",
        "translation": "As shown in the commentary on the Vinaya, there are two distinctions between the site and the altar. The countries of the western heavens all establish different rituals; but this custom is not practised in China.",
        "source": "T45n1892_001:0807c17_0"
    },
    {
        "source_sentence": "不足怪也。",
        "translation": "It's not enough to wonder.",
        "source": "T45n1892_001:0807c18_1"
    },
    {
        "source_sentence": "今定其名實，或有異議。",
        "translation": "Now, we'll determine their names and realities, or there may be disagreement.",
        "source": "T45n1892_001:0807c18_2"
    },
    {
        "source_sentence": "案《僧傳》云：「宋文帝元嘉中，聖僧功德鎧者，遊化建業，於南林寺前園中立戒壇，",
        "translation": "It is said in the Sangha biographies that during the Yuanjia period of Emperor Wen of the Song dynasty, the armor of holy monastic virtue was engaged in religious practice and established a precept altar in the garden in front",
        "source": "T45n1892_001:0807c19_3"
    },
    {
        "source_sentence": "令受戒者登壇於上受也。",
        "translation": "He causes someone who receives the precepts to ascend to the altar and receive them above.",
        "source": "T45n1892_001:0807c20_4"
    },
    {
        "source_sentence": "及其終後，又於壇上而闍維之。」",
        "translation": "After his death, he'll also pay homage to him on the altar.",
        "source": "T45n1892_001:0807c21_5"
    },
    {
        "source_sentence": "餘如下引。",
        "translation": "The rest are cited below.",
        "source": "T45n1892_001:0807c22_6"
    },
    {
        "source_sentence": "又翻《十誦律》主卑摩羅叉，答《五百問》，於慧觀法師亦云：「壇上師僧為他受戒。」",
        "translation": "Also, the translator of the Ten Recitations Vinaya, Pimalakṣa, answered the five hundred questions in response to the Five Hundred Questions, and the Dharma teacher Huiguan also said, The master monk on the altar receives the precepts",
        "source": "T45n1892_001:0807c22_7"
    },
    {
        "source_sentence": "餘文廣有，不復敘之。",
        "translation": "The rest of the text is extensive and does not describe it in detail.",
        "source": "T45n1892_001:0807c24_8"
    },
    {
        "source_sentence": "故知，「壇」名其來久矣。",
        "translation": "Therefore, it's known that the name altar has been around for a long time.",
        "source": "T45n1892_001:0807c24_9"
    },
    {
        "source_sentence": "今人不識，混而雷同，平場、高壇莫分二別。",
        "translation": "The people of the present do not recognize it, and thunder and lightning are the same as each other. There is no distinction between a raised platform and a raised platform.",
        "source": "T45n1892_001:0807c25_10"
    },
    {
        "source_sentence": "誤哉！",
        "translation": "That's wrong!",
        "source": "T45n1892_001:0807c26_11"
    },
    {
        "source_sentence": "案《別傳》云：「佛涅槃後，迦葉結集來戒壇上，使小目連鳴鐘，召百億四天下凡聖僧眾。",
        "translation": "It's said in the Biezhuan, After the Buddha's nirvāṇa, Kāśyapa gathered a group of monks to come to the precepts altar and caused lesser Maudgalyāyana to ring the bell to summon",
        "source": "T45n1892_001:0807c26_12"
    },
    {
        "source_sentence": "普集壇已，白四羯磨，罰賓頭盧及阿難罪竟，令阿難披佛僧伽梨上座，",
        "translation": "After he had assembled the altar, he said to the four karmas, punishing Piṇḍola and Ānanda for their sins, ordering Ānanda to put on the Buddha's monk's robe and ascend the seat of",
        "source": "T45n1892_001:0807c28_13"
    },
    {
        "source_sentence": "先誦《遺教經》，如佛約勅，諸大菩薩及阿羅漢、天龍八部皆大悲泣。",
        "translation": "He had first recited the Sutra of the Bequeathed Teachings, as instructed by the Buddha, and all the great bodhisattvas, arhats, gods, dragons, and eight groups of people wept with great compassion.",
        "source": "T45n1892_001:0808a01_14"
    },
    {
        "source_sentence": "大迦葉從座而起，披麁布僧伽梨，捉尼師壇，至阿難前，敷尼師壇，禮阿難已，",
        "translation": "Mahākāśyapa rose from his seat, covered his upper robe with a monk’s robe and saṃghāṭī robe. He took up the bhikṣuṇī seat in front of Ānanda [and] spread out the bhi",
        "source": "T45n1892_001:0808a03_15"
    },
    {
        "source_sentence": "右繞三匝；",
        "translation": "circumambulate him three times to his right.",
        "source": "T45n1892_001:0808a04_16"
    },
    {
        "source_sentence": "大梵天王執大寶蓋覆阿難上，忉利天主進七寶案置阿難前，魔王波旬將七寶拂授與阿難，",
        "translation": "The great Brahmā held a great jeweled canopy over Ānanda. The lord of Trāyastriṃśa gods placed the seven-jeweled almsbowl in front of Ānanda, and Māra King Pāpī",
        "source": "T45n1892_001:0808a05_17"
    },
    {
        "source_sentence": "魔王、帝釋夾侍兩邊，四天王立侍高座四脚，三十二使者隨迦葉後互跪。",
        "translation": "Māra King and Śakra Devānām-Indra stood beside each other, while the four guardian kings of the four heavenly kings stood to attend them. The thirty-two messengers knelt down behind Kāśyapa on their high",
        "source": "T45n1892_001:0808a07_18"
    },
    {
        "source_sentence": "迦葉禮拜已，至阿難前，問訊起居，如世尊在時不異。",
        "translation": "After paying homage, Kāśyapa went before Ānanda to greet him and rose from his seat. Just as when the World-honored One was staying there, it wasn’t different.",
        "source": "T45n1892_001:0808a08_19"
    },
    {
        "source_sentence": "迦葉爾時作三千八百問諸有疑事，阿難一一答之。」",
        "translation": "Kāśyapa then asked 3,000 or 8,000 questions about the doubts that existed, and Ānanda answered them one by one.",
        "source": "T45n1892_001:0808a10_20"
    },
    {
        "source_sentence": "今略取戒壇一問，餘者闕之。",
        "translation": "Now, we'll briefly take one question about the precepts altar, but the rest are missing.",
        "source": "T45n1892_001:0808a11_21"
    },
    {
        "source_sentence": "大迦葉問曰：「汝隨如來二十年來，戒壇高下、闊狹，依何肘量？",
        "translation": "Mahākāśyapa asked, “Twenty years after the Tathāgata entered nirvana, what was the height and width of your ordination platform?",
        "source": "T45n1892_001:0808a11_22"
    },
    {
        "source_sentence": "戒壇上中安舍利不？",
        "translation": "Does he place Śāriputra on the altar of precepts?",
        "source": "T45n1892_001:0808a13_23"
    },
    {
        "source_sentence": "戒壇四面用何物砌？",
        "translation": "What are the four sides of the ordination altar to be built?",
        "source": "T45n1892_001:0808a13_24"
    },
    {
        "source_sentence": "四面開階、方別多少？",
        "translation": "The four sides open with steps, and the directions are different?",
        "source": "T45n1892_001:0808a14_25"
    },
    {
        "source_sentence": "繞壇四面，作何形像？",
        "translation": "What shape does it take to circumambulate the four sides of the altar?",
        "source": "T45n1892_001:0808a14_26"
    },
    {
        "source_sentence": "無石國中，土沙作不？」",
        "translation": "In the absence of a stone country, is it made of dirt or sand?",
        "source": "T45n1892_001:0808a15_27"
    },
    {
        "source_sentence": "阿難一如此卷中圖相而用答之。",
        "translation": "Ānanda, this is the first such-and-such commentary on the characteristics of the images in the scroll that he uses to answer.",
        "source": "T45n1892_001:0808a15_28"
    },
    {
        "source_sentence": "初祇桓戒壇，北有鐘臺，高四百尺，上有金鐘，重十萬斤，莊嚴希有；",
        "translation": "To the north of the altar of the precepts at the beginning of the reign of King Ajātaśatru is a bell terrace four hundred feet in height with a golden bell on top, weighing one hundred thousand pounds. Such adornments are rare",
        "source": "T45n1892_001:0808a16_29"
    },
    {
        "source_sentence": "下有九龍盤像，龍口吐八功德水。",
        "translation": "Below it is a nine-headed image on a tray, and the dragon spits out water of eight meritorious qualities from its mouth.",
        "source": "T45n1892_001:0808a17_30"
    },
    {
        "source_sentence": "時欲受戒人至場壇所，龍便吐水灌頂，如轉輪王陞壇受位灌頂之相。",
        "translation": "When the person who wanted to receive the precepts arrived at the site of the altar, the dragon then spit out water and consecrated him, just like the wheel-turning king ascended to the altar to receive the consecration.",
        "source": "T45n1892_001:0808a18_31"
    },
    {
        "source_sentence": "故初受戒人，如佛法王受法王位，有摩尼珠光，觸受戒人得清涼樂，又表受人戒珠清淨。",
        "translation": "That's why the first person who receives the precepts is like the Buddha Dharma king who receives the throne of the Dharma king and has a maṇi pearl that shines brightly, touches the person who receives the precepts",
        "source": "T45n1892_001:0808a20_32"
    },
    {
        "source_sentence": "若諸聖人受戒之時，得通菩薩擊鐘，聲震三千世界，有聞證果，惡趣停息。",
        "translation": "When sages receive the precepts, they'll be able to penetrate the bodhisattva's ringing of a bell that shakes 3,000 worlds with its sound, and those who hear it realize its fruit will cease in bad destinies.",
        "source": "T45n1892_001:0808a22_33"
    },
    {
        "source_sentence": "凡夫受時，使摩抵比丘擊之，聲聞小千世界，此比丘有力當十萬人。",
        "translation": "When ordinary people receive it, they'll cause the monk Mahāprajñāpāramitā to strike it, and the śrāvakas in the small thousand worlds will have 100,000 of these monks who are powerful.",
        "source": "T45n1892_001:0808a23_34"
    },
    {
        "source_sentence": "其鐘臺如須彌山形，在大池中，九龍出頭，搆結盤住，諸梁柱等安龍頭上，",
        "translation": "The bell-tower is shaped like the polar mountain. In the middle of the great lake a nine-headed dragon emerges and joins his feet together to make a base, while beams and pillars rest on the dragon’s head.",
        "source": "T45n1892_001:0808a25_35"
    },
    {
        "source_sentence": "並黃金作之。",
        "translation": "They were all made of gold.",
        "source": "T45n1892_001:0808a27_36"
    },
    {
        "source_sentence": "屋瓦用頗梨寶，若有受者登壇，諸龍即轉，口出香雨香雲，覆灑壇上。",
        "translation": "The roof tiles are made of crystal, and if someone receives them, they ascend to the altar; the dragons then turn around, produce fragrant rain and clouds of incense from their mouths, covering and sprinkling it over the altar",
        "source": "T45n1892_001:0808a27_37"
    },
    {
        "source_sentence": "池之四邊砌以白玉，底布銀沙，水色清淨，甘如乳蜜。",
        "translation": "The four sides of the pond are made of white jade and covered with silver sand at the bottom. The water is clear and pure, sweet as milk and honey.",
        "source": "T45n1892_001:0808a28_38"
    },
    {
        "source_sentence": "諸持戒人有疾飲者，無不除差；",
        "translation": "Those who keep the precepts have an ailment to drink, and none of them are free from that ailment.",
        "source": "T45n1892_001:0808b01_39"
    },
    {
        "source_sentence": "破戒若飲，如吞鐵汁。",
        "translation": "If someone breaks the precepts and drinks them, it's like swallowing iron juice.",
        "source": "T45n1892_001:0808b01_40"
    },
    {
        "source_sentence": "佛欲涅槃，水先枯竭，屋瓦飛去；",
        "translation": "When the Buddha wished to enter nirvana, the water dried up first and the roof tiles flew away.",
        "source": "T45n1892_001:0808b02_41"
    },
    {
        "source_sentence": "迦葉結集，阿難答時，屋瓦還來，池還出水，色白如乳，然無乳味，以表滅後正法隨滅，",
        "translation": "When Kāśyapa had assembled the assembly, Ānanda answered. The roof tile came back and water poured out from the pond as white as milk, but there was no taste of milk because it indicated that the true-dharma would",
        "source": "T45n1892_001:0808b03_42"
    },
    {
        "source_sentence": "展轉無味，如《涅槃經》加水乳譬，可以準也。",
        "translation": "It's like the metaphor of adding water and milk in the Nirvana Sutra, which can be used to refer to it.",
        "source": "T45n1892_001:0808b05_0"
    },
    {
        "source_sentence": "結集問事都了，僧向王城，大鐘寶臺飛上兜率，池玉、銀沙龍王收去，",
        "translation": "Having compiled the questions, the monks proceeded to the royal city. The great bell and jeweled terrace flew up to Tuṣita; the dragon kings Jade and silver sand of the pond withdrew.",
        "source": "T45n1892_001:0808b05_1"
    },
    {
        "source_sentence": "水亦枯竭。",
        "translation": "The water also dried up.",
        "source": "T45n1892_001:0808b07_2"
    },
    {
        "source_sentence": "今有其地，相狀都無，迷其初緣，合興壇位，故廣敘之。",
        "translation": "Now there is a place that has no shape or characteristics at all, and it's misconstrued as the first condition, so it combines to produce an altar position, so it's described in detail.",
        "source": "T45n1892_001:0808b07_3"
    },
    {
        "source_sentence": "「壇」之立名在佛世矣！",
        "translation": "The establishment of the name altars is in the Buddha's world!",
        "source": "T45n1892_001:0808b08_4"
    },
    {
        "source_sentence": "此土現有群經律論，咸明王城兩處結集之相，然出沒差互不同，不妨阿難陞座為結法之元匠也！",
        "translation": "In this land, there are numerous sūtras and vinaya treatises that explain the ways in which the two places of the king's city are assembled, but the distinctions between what comes and goes are different, so why wouldn't Ānanda ascend his se",
        "source": "T45n1892_001:0808b09_5"
    },
    {
        "source_sentence": "但存迦葉所問，阿難相同佛形，比丘咸疑是佛也！",
        "translation": "But according to what Kāśyapa asked, Ānanda's form is the same as that of the Buddha, and the monks all suspected it was the Buddha!",
        "source": "T45n1892_001:0808b11_6"
    },
    {
        "source_sentence": "聽說「我聞」便息。",
        "translation": "He listens to the sound, I hear it, and then he stops.",
        "source": "T45n1892_001:0808b12_7"
    },
    {
        "source_sentence": "如今所傳，達通悟者，不見此土，結法相者，尚自不知，況今所出，有不信者，",
        "translation": "Those who have attained supernatural enlightenment in the present do not see this land, nor do they know the characteristics of the Buddha’s teaching. How much less so those who disbelieve in what he teaches now.",
        "source": "T45n1892_001:0808b13_8"
    },
    {
        "source_sentence": "固其常爾。",
        "translation": "It's certainly always the same.",
        "source": "T45n1892_001:0808b14_9"
    },
    {
        "source_sentence": "自佛滅後至於正、像，結集之相，乃有多塗。",
        "translation": "Since the Buddha's nirvāṇa, there have been many patches of paint on the characteristics of the collection up to the correct and the images, which are collected.",
        "source": "T45n1892_001:0808b15_10"
    },
    {
        "source_sentence": "初五百人，次千人，次大眾，次育王，次七百，且列五條，餘非不有，",
        "translation": "The first five hundred were followed by a thousand, the second by the great assembly, the second by King Aśoka, and the third by seven hundred.",
        "source": "T45n1892_001:0808b16_11"
    },
    {
        "source_sentence": "上並小乘。",
        "translation": "The above is combined with the lesser vehicle.",
        "source": "T45n1892_001:0808b17_12"
    },
    {
        "source_sentence": "至於大乘，阿難、迦葉在王城廣結集，文殊師利與大菩薩，在鐵圍山略結集，",
        "translation": "As for the Mahayana scriptures, Ānanda and Kasyapa compiled them extensively in the royal city. Mañjuśrī and the great bodhisattvas compiled them briefly at Mount Cakravāḍa on Mount iron",
        "source": "T45n1892_001:0808b17_13"
    },
    {
        "source_sentence": "並如此土諸經所說。",
        "translation": "They're all explained in the scriptures of this land.",
        "source": "T45n1892_001:0808b19_14"
    },
    {
        "source_sentence": "戒壇形重相狀第三",
        "translation": "The third is the shape of the precepts altar, which is heavily decorated.",
        "source": "T45n1892_001:0808b21_0"
    },
    {
        "source_sentence": "依名顯相，理有異儀。",
        "translation": "In principle, there is a di›erence in the manner in which names and characteristics are expressed.",
        "source": "T45n1892_001:0808b22_0"
    },
    {
        "source_sentence": "「場」乃除地令淨，無諸丘坎，俗中治場令平者是也！",
        "translation": "The site removes the ground so that it's pure, there are no hills or mounds, and the secular middle way is to make the site level!",
        "source": "T45n1892_001:0808b22_1"
    },
    {
        "source_sentence": "戲場、戰場例斯可解。",
        "translation": "These examples of playgrounds and battlefields can be understood.",
        "source": "T45n1892_001:0808b23_2"
    },
    {
        "source_sentence": "至於「壇」相，則出地立基，四郊祠祭諸壇者是也！",
        "translation": "As for the characteristic of the altar, when he emerges from the earth and establishes a foundation, these are the four sacrifices to the altar in the four suburbs!",
        "source": "T45n1892_001:0808b24_3"
    },
    {
        "source_sentence": "余案行諸壇，方基者多。",
        "translation": "The rest of the monastery was mostly built on square foundations, but there were many other styles of worship.",
        "source": "T45n1892_001:0808b25_4"
    },
    {
        "source_sentence": "唯圓丘一壇，分基九派，各施階隥，其緣如別。",
        "translation": "There was only one altar in the circular mound, which was divided into nine groups of bases and each given a staircase. The reasons for this were different.",
        "source": "T45n1892_001:0808b25_5"
    },
    {
        "source_sentence": "今之戒壇初為天造，天工巧妙，理出人謀。",
        "translation": "At the beginning of the present ordination altar, it was made by heavenly artisans with skillful craftsmanship. The principles were inspired by human imagination.",
        "source": "T45n1892_001:0808b26_6"
    },
    {
        "source_sentence": "然佛指揮，又非凡度，故其相狀不同恒俗。",
        "translation": "However, the Buddha's command is not extraordinary; therefore, its characteristics are different from those of the eternal world.",
        "source": "T45n1892_001:0808b27_7"
    },
    {
        "source_sentence": "依《別傳》云：「戒壇從地而起，三重為相，以表三空，為入佛法初門，",
        "translation": "According to a different biography, the precepts altar rises from the earth and has threefold form as its characteristic, which indicates the three kinds of emptiness in order to enter the first aspect of the Buddha's teaching.",
        "source": "T45n1892_001:0808b28_8"
    },
    {
        "source_sentence": "散釋凡惑，非空不遣。",
        "translation": "It's a dispersed explanation of worldly afflictions that aren't empty and aren't abandoned.",
        "source": "T45n1892_001:0808c01_0"
    },
    {
        "source_sentence": "三空是得道者遊處，正戒為眾善之基，故限於三重也！",
        "translation": "The three kinds of emptiness are the excursion for those who attain the path, and right precepts are the foundation of all goodness, so they're limited to three!",
        "source": "T45n1892_001:0808c01_1"
    },
    {
        "source_sentence": "昔光明王佛制，高佛之五肘，表五分法身；",
        "translation": "Formerly the buddha ruled by King of Illumination was five zhou tall, corresponding to five-fifths of the Dharma body.",
        "source": "T45n1892_001:0808c02_2"
    },
    {
        "source_sentence": "釋迦如來減為二肘半；",
        "translation": "The Buddha Śākyamuni is less than two and a half zhou in height.",
        "source": "T45n1892_001:0808c03_3"
    },
    {
        "source_sentence": "上又加二寸，為三層也；",
        "translation": "The upper one adds another two inches to make three tiers.",
        "source": "T45n1892_001:0808c04_4"
    },
    {
        "source_sentence": "其後天帝釋又加覆釜形於壇上，以覆舍利；",
        "translation": "Then Śakra, lord of the gods, covered the cauldron and placed it over the altar to cover the relics.",
        "source": "T45n1892_001:0808c04_5"
    },
    {
        "source_sentence": "大梵王又以無價寶珠，置覆釜形上，供養舍利。",
        "translation": "Again, King Mahābrahmā placed the priceless precious pearl over the shape of the cauldron and offered it as an offering to Śāriputra.",
        "source": "T45n1892_001:0808c05_6"
    },
    {
        "source_sentence": "是則五重，還表五分法身(以初層高一肘，二層高二肘半；",
        "translation": "These then are the fivefold, which also represent the five parts of the Dharma body. (The first story is one elbow in height and the second two and a half elbows in height.",
        "source": "T45n1892_001:0808c06_7"
    },
    {
        "source_sentence": "三層高二寸，則三分也；",
        "translation": "Three stories are three inches high and two inches thick, which make up the other three parts.",
        "source": "T45n1892_001:0808c07_8"
    },
    {
        "source_sentence": "帝釋加覆釜，則四重也；",
        "translation": "When Indra covers the cauldron, it is fourfold.",
        "source": "T45n1892_001:0808c07_9"
    },
    {
        "source_sentence": "梵王加寶珠，則五重。",
        "translation": "When Brahmā adds a precious pearl, it's fivefold.",
        "source": "T45n1892_001:0808c08_10"
    },
    {
        "source_sentence": "五分具也)。",
        "translation": "The five parts are also complete.)",
        "source": "T45n1892_001:0808c08_11"
    },
    {
        "source_sentence": "初佛在世，祇桓園中立戒壇訖，大梵王所施寶珠，大如五升瓶，大福德者見之，",
        "translation": "When the first buddha was in the world, he set up a precepts altar in the Jetavana Garden. The precious pearl given by King Mahābrahmā was as big as five sheng of water and was seen by those of great virtue",
        "source": "T45n1892_001:0808c08_12"
    },
    {
        "source_sentence": "光照八百由旬；",
        "translation": "The light shone for eight hundred yojanas.",
        "source": "T45n1892_001:0808c10_13"
    },
    {
        "source_sentence": "薄福德者見之，如聚墨也。",
        "translation": "Those of little virtue see it like a heap of black ink.",
        "source": "T45n1892_001:0808c10_14"
    },
    {
        "source_sentence": "如來一代，常在戒壇，及佛涅槃，珠亦隨沒。",
        "translation": "For a generation the Tathāgata always remained at the ordination platform, but when the Buddha entered nirvana the gems disappeared as well.",
        "source": "T45n1892_001:0808c11_15"
    },
    {
        "source_sentence": "尊者大迦葉結集之時，珠復還來，阿難滅度，此珠還去。",
        "translation": "When Venerable Mahākāśyapa had assembled the assembly, the pearl returned and Ānanda entered nirvana.",
        "source": "T45n1892_001:0808c12_16"
    },
    {
        "source_sentence": "後大梵王乃以明珠替處，以供養舍利也，珠下以寶蓮華用承之，作九龍以承華足。",
        "translation": "Later, King Mahābrahmā replaced it with a bright pearl to honor Śāriputra's relics. Under the pearl, he used a jeweled lotus flower to carry it and made a ninja to carry the flower",
        "source": "T45n1892_001:0808c13_17"
    },
    {
        "source_sentence": "天帝釋又奉二珠，以供養舍利，用金蓮華承足，下設金柱，柱下安師子；",
        "translation": "Indra, lord of the gods, also offered two pearls as an offering to the relics. He supported the relics with golden lotus flowers and set up a golden pillar at their feet, while placed a lion seat under the pillar.",
        "source": "T45n1892_001:0808c15_18"
    },
    {
        "source_sentence": "此之二珠結集既竟，並各不現。",
        "translation": "After these two pearls had been collected, they each didn't appear.",
        "source": "T45n1892_001:0808c16_19"
    },
    {
        "source_sentence": "帝釋二珠，今在忉利天歡喜園中，供養般若波羅蜜。",
        "translation": "The two pearls of Indra and Śākyamuni are now in the joyful park of the Trāyastriṃśa gods, making offerings to the perfection of prajñāpāramitā.",
        "source": "T45n1892_001:0808c17_20"
    },
    {
        "source_sentence": "今時諸處立壇，既無珠可供養者，隨力作二明燈。",
        "translation": "At the present time, there's an altar in various places, and since there's no pearl to offer as a support, he makes two kinds of illuminating lamps according to his ability.",
        "source": "T45n1892_001:0808c18_21"
    },
    {
        "source_sentence": "若石若木，常在壇前，高於上層，令光明遠照，上下通曉。",
        "translation": "Whether it's made of stone or wood, they'll always be in front of the altar, higher than the upper level, so that their light shines far away and up and down through the dawn.",
        "source": "T45n1892_001:0808c19_22"
    },
    {
        "source_sentence": "其壇上鋪石為地，每有受戒之候，西南角別安高座，使比丘登之；",
        "translation": "On the top of the altar he spread a stone mat on the ground, and whenever there was an occasion for receiving the precepts he set up a high seat at the southwest corner to let the bhikṣus ascend.",
        "source": "T45n1892_001:0808c21_23"
    },
    {
        "source_sentence": "登或艱阻，時大梵王於南面西階道西，化作鐵莖銀龍銀蓮華，開合轉關，",
        "translation": "At that time the great brahma king was on the west side of the road leading to the west from the south, transforming himself into an iron stalk, a silver dragon, and a silver lotus flower.",
        "source": "T45n1892_001:0808c22_24"
    },
    {
        "source_sentence": "華葉相接，對鉤欄上，共高座相當，令使登者而無躓礙。",
        "translation": "The flowers and leaves are connected, facing each other at the hook railing, and they share the same high seat, so that those who climb it don't stumble.",
        "source": "T45n1892_001:0808c24_25"
    },
    {
        "source_sentence": "祇桓既殄，斯蹤亦絕，然今後作者，則而施之。」",
        "translation": "Since the king of Jīvaka was deceased, his traces are also extinguished, but the author will give them to him in the future.",
        "source": "T45n1892_001:0808c25_26"
    },
    {
        "source_sentence": "近以乾封二年九月，中印度大菩提寺沙門釋迦蜜多羅尊者，長年人也，",
        "translation": "Recently in the ninth month of the second year of the Qianfeng dynasty, Venerable Śāriputra, a śramaṇa and brāhmaṇa of the Great Enlightenment Monastery in Central India, was a native of",
        "source": "T45n1892_001:0808c26_27"
    },
    {
        "source_sentence": "九十九夏來向五臺，致敬文殊師利。",
        "translation": "In the ninety-ninethree years he came to Wutai to pay his respects to Mañjuśrī.",
        "source": "T45n1892_001:0809a01_28"
    },
    {
        "source_sentence": "今上禮遇，令使人將送，既還來郊南，見此戒壇，大隨喜云：「天竺諸寺皆有戒壇。」",
        "translation": "When he returned to the suburbs and saw this ordination altar, Mahāprajñāpāramitā said, All the temples in India have an ordination altar.",
        "source": "T45n1892_001:0809a01_29"
    },
    {
        "source_sentence": "又述烏仗那國東石戒壇之事，此則東西雖遠，壇禮相接矣。",
        "translation": "It also describes the affairs of the stone ordination altar at Udyāna to the east. Although this place is far from the east and west, it adheres to the dedication of the altar worship.",
        "source": "T45n1892_001:0809a03_30"
    },
    {
        "source_sentence": "其壇相狀，下之二重以石砌累，如須彌山王形，上下安色道。",
        "translation": "The shape of the altar is like that of Mount Sumeru, with its color variegated paths above and below it.",
        "source": "T45n1892_001:0809a05_31"
    },
    {
        "source_sentence": "四面壇身並列龕窟，窟內安諸神王。",
        "translation": "The altar bodies of the four sides are arranged in a niche, where the deva kings are housed.",
        "source": "T45n1892_001:0809a06_32"
    },
    {
        "source_sentence": "其兩重基上並施石鉤欄，欄之柱下，師子神王間以列之。",
        "translation": "On each of the two-story foundations there was a stone railings with hooks and rails, which were arranged between the pillars beneath the railing and placed by the deity Siṃhala.",
        "source": "T45n1892_001:0809a07_33"
    },
    {
        "source_sentence": "兩層四角立高石柱出於壇上，柱外置四天王像，既在露地，並鐫石為之，",
        "translation": "On each of the two-story, four-cornered stone pillar was raised to the top of the altar. Beside the pillar were images of the four heavenly kings (i.e., the Trāyastriṃśa gods",
        "source": "T45n1892_001:0809a08_34"
    },
    {
        "source_sentence": "使久固也。",
        "translation": "It's made to last for a long time.",
        "source": "T45n1892_001:0809a10_35"
    },
    {
        "source_sentence": "四角欄上，石金翅鳥銜龍於上，表比丘既受戒已，常思惑業而制除也。",
        "translation": "On the four corner railing, there's a stone-gold-winged bird holding a dragon on top, which shows that the monk who has received the precepts always contemplates and suppresses afflictive karma after he receives them.",
        "source": "T45n1892_001:0809a10_36"
    },
    {
        "source_sentence": "戒壇周圍布列神影者，表護持久固之相也。",
        "translation": "The shadow of the deity arrayed around the altar of precepts shows the characteristic of protecting and sustaining it.",
        "source": "T45n1892_001:0809a12_37"
    },
    {
        "source_sentence": "斯並大聖之羽儀，生善之弘道，備舒圖傳，具列儀容，各有名號，義難隱伏，",
        "translation": "These were all the mannerisms of the Great Sage, as well as the heroic ways of the virtuous ones who practiced Buddhism. All these are described in detail in the biographies and descriptions compiled in the scriptures; they each have",
        "source": "T45n1892_001:0809a13_38"
    },
    {
        "source_sentence": "事須標牓其名，顯置其狀，則使見者發心，識幽明之協護矣！",
        "translation": "A thing must be labeled by naming it and show its shape, so that those who see it will arouse their minds and the consciousnesses and mysterious beings will protect it!",
        "source": "T45n1892_001:0809a14_39"
    },
    {
        "source_sentence": "今案：梁高祖勅釋寶唱著《神鬼錄》，凡有三卷。",
        "translation": "At the present time, the Liang Emperor Gaozu ordered Shi Bao to compose the Record of the Spirits and Ghosts, consisting of three fascicles.",
        "source": "T45n1892_001:0809a16_40"
    },
    {
        "source_sentence": "故其序略云：「自如來出世，至教博遠，天龍鬼神莫不迴向，故能奉侍三尊，",
        "translation": "That is why the introduction of the treatise says: Since the Tathāgata appeared in the world, his teachings have been so extensive that none of the devas, nāgas, and ghosts have turned away from them. Therefore they are able to serve",
        "source": "T45n1892_001:0809a17_41"
    },
    {
        "source_sentence": "擁護四部。」",
        "translation": "They embrace the four divisions.",
        "source": "T45n1892_001:0809a18_42"
    },
    {
        "source_sentence": "凡諸鬼神各有依住，故依地之神名曰堅牢，乃至寺塔山林河海風雨，如《長阿含經》，",
        "translation": "Ordinary ghosts and spirits each have their own dwelling places, so the earth-dependent spirits are called firmly restrained, even up to temples, stūpas, mountains, forests, rivers, seas, wind,",
        "source": "T45n1892_001:0809a19_0"
    },
    {
        "source_sentence": "並依止所往而守衛之(今以壇圖一面，三方隱映諸神側背，難可圖形。",
        "translation": "They also guarded it according to where they went (Now, with a side of the altar-map, the three directions are hidden behind the gods, and it's difficult to draw their shape.",
        "source": "T45n1892_001:0809a20_1"
    },
    {
        "source_sentence": "於圖經中，依方列相，或露或覆，時立時坐，後有造者，依經置之)。",
        "translation": "In the drawings of the sūtras, they are listed according to the direction, either exposed or covered, and seated at the right time while standing or sitting; those who create them later are placed according to the sūtras).",
        "source": "T45n1892_001:0809a21_2"
    },
    {
        "source_sentence": "今前列護佛塔神名，多出《華嚴》、《灌頂》、《孔雀王》、《賢愚》、《大集》、《大智論》等，",
        "translation": "The names of the deities who preserve the buddha-tathāgata stupas are listed in front of us. Most prominent are Flower Ornament, Consecration, King of Peacocks, Good and Evil, Mahasamghika, Mahāprajñā",
        "source": "T45n1892_001:0809a22_3"
    },
    {
        "source_sentence": "以繁文故，於此總而敘之。",
        "translation": "Because of the extensive text, we'll summarize it here.",
        "source": "T45n1892_001:0809a24_4"
    },
    {
        "source_sentence": "神名跋闍羅波尼(梁言金剛)。",
        "translation": "The deity's name is Vajrapāṇi (known as Jingang in Liang).",
        "source": "T45n1892_001:0809a24_5"
    },
    {
        "source_sentence": "神名婆里旱(河但反，梁言力士)。",
        "translation": "The deity's name was Vāriputra (Hedatta, which is the Liang word for strong man).",
        "source": "T45n1892_001:0809a25_6"
    },
    {
        "source_sentence": "初堅固光曜神、二日光曜神、三須彌華神、四淨雲音神、五阿脩羅王神(取脩羅為名，",
        "translation": "The first is the god of firm shining light, the second is the god of sun shining light, the third is the god of Sumeru flowers, the fourth is the god of pure cloud sounds, and the fifth is the king of asura spirits (",
        "source": "T45n1892_001:0809a25_7"
    },
    {
        "source_sentence": "非脩羅也)、六勝光明神、七樹音聲神、八師子王神(如上，已解)、九淳厚光藏神、十珠髻華光神。",
        "translation": "They aren't sūtras), the six divinities of superior light, seven divinities of tree sounds, eight divinities of lion kings (as explained above), nine divinities of pure and generous luminous treasury, and ten divinities of jewel",
        "source": "T45n1892_001:0809a27_8"
    },
    {
        "source_sentence": "右十二金剛力士神王，依《雜阿含經》。",
        "translation": "The right twelve adamantine warrior spirit kings are based on the Saṃyuktâgama sūtras.",
        "source": "T45n1892_001:0809b02_9"
    },
    {
        "source_sentence": "金剛神持金剛杵，猛火熾然，經律中亦說：「八金剛神，列侍四面。」",
        "translation": "The vajra spirit holds the vajra and a fierce fire blazes out, and the sūtras and vinaya also say, Eight vajra spirits are lined up on four sides.",
        "source": "T45n1892_001:0809b03_10"
    },
    {
        "source_sentence": "又云：「五百金剛，常侍衛佛」。",
        "translation": "It also said, Five hundred vajras are always guarding the Buddha.",
        "source": "T45n1892_001:0809b04_11"
    },
    {
        "source_sentence": "如《華嚴經》：「諸金剛神與微塵數力士俱，久發誓願，侍衛如來，住持遺法。」",
        "translation": "As the Flower Ornament Sutra explains, The vajra spirits and as many strong men as atoms have long vowed to guard the Tathāgata and uphold the legacy of the teaching.",
        "source": "T45n1892_001:0809b05_12"
    },
    {
        "source_sentence": "今據文求相，不言戒壇，然此戒壇即佛塔也，以安舍利。",
        "translation": "Now, we're looking for the characteristics according to the text and don't talk about the precepts altar, but this precepts altar is the Buddha's stūpa, so we can place Śāriputra there.",
        "source": "T45n1892_001:0809b06_13"
    },
    {
        "source_sentence": "靈骨瘞中，非塔如何？",
        "translation": "What's wrong with a stūpa if it's not a stūpa?",
        "source": "T45n1892_001:0809b08_14"
    },
    {
        "source_sentence": "迷名固執者不足言評。",
        "translation": "Those who are deluded about names and firmly cling to them don't need to praise them.",
        "source": "T45n1892_001:0809b08_15"
    },
    {
        "source_sentence": "重為提示，原夫「塔」字，此方字書乃是物聲，本非西土之號。",
        "translation": "It's important to point out that the word stūpa is originally a Sanskrit phonetic lettering, which is the sound of things and not the name of the Western land.",
        "source": "T45n1892_001:0809b09_16"
    },
    {
        "source_sentence": "若依梵本，瘞佛骨所，名曰「塔婆」。",
        "translation": "If we rely on the Sanskrit text and look at the place where the Buddha's bones are preserved, it's called a stūpa.",
        "source": "T45n1892_001:0809b10_17"
    },
    {
        "source_sentence": "此略下「婆」，單呼上「塔」。",
        "translation": "This is abbreviated as po and simply called the above stūpa.",
        "source": "T45n1892_001:0809b11_18"
    },
    {
        "source_sentence": "所以經中，或名「偷婆」、「窣堵波」等。",
        "translation": "That's why the sūtras sometimes call it a poppa or a stūpa, etc.",
        "source": "T45n1892_001:0809b11_19"
    },
    {
        "source_sentence": "依如唐言「方墳」，塚也！",
        "translation": "It's like the Tang word for square mound, which is a tomb!",
        "source": "T45n1892_001:0809b12_20"
    },
    {
        "source_sentence": "古者墓而不墳，墳謂加土於其上也。",
        "translation": "The ancient saying is that a tomb is not a tomb, and a tomb means to place dirt on top of it.",
        "source": "T45n1892_001:0809b13_0"
    },
    {
        "source_sentence": "如律中：「如來知地下有迦葉佛舍利，以土增之。」",
        "translation": "As the vinaya says, The Tathāgata knows that there's a relic of Kāśyapa Buddha underground and increases it with dirt.",
        "source": "T45n1892_001:0809b13_1"
    },
    {
        "source_sentence": "斯即塔婆之相狀矣！",
        "translation": "This is the shape of a stūpa!",
        "source": "T45n1892_001:0809b15_0"
    },
    {
        "source_sentence": "今戒壇安佛舍利，層基標別，四列神影守護顯號，固其然乎！",
        "translation": "Now the Buddha’s relics are preserved at the ordination altar. The foundation of the stupa is divided into layers and the four rows of images of the deity preserve their distinctive characteristics. Is this indeed so?",
        "source": "T45n1892_001:0809b15_1"
    },
    {
        "source_sentence": "前十二神常守護佛塔。",
        "translation": "The first twelve deities always guard the Buddha's stūpa.",
        "source": "T45n1892_001:0809b16_2"
    },
    {
        "source_sentence": "下層下據地，壇有五階，階列二神，故有十也！",
        "translation": "On the ground at the bottom of the lower level there are five levels of the altar, which are arranged in order by the two deities, so there are ten!",
        "source": "T45n1892_001:0809b17_3"
    },
    {
        "source_sentence": "以下層為戒壇基本，其猶金剛，故以十金剛依階而位列也！",
        "translation": "The lower level is the base of the precepts altar, which is like a vajra, so it's arranged in order based on the ten vajras!",
        "source": "T45n1892_001:0809b18_4"
    },
    {
        "source_sentence": "下層四角大神，所謂金剛力士、金毘羅、散脂，並護佛塔，故峙列四隅，",
        "translation": "The four-cornered deities of the lower storeys, namely the so-called Vajra warrior, the Kimbila, and Saṃdhinirmita, protected the Buddha’s stupa. For this reason they stood piled up in row",
        "source": "T45n1892_001:0809b19_5"
    },
    {
        "source_sentence": "以護持本也；",
        "translation": "It is to preserve the source.",
        "source": "T45n1892_001:0809b21_6"
    },
    {
        "source_sentence": "東南角神名跋闍羅波尼(又領般支分大軍主神)；",
        "translation": "The horn deity in the southeast is called Vajrapāṇi (also known as the great army lord who commands the partition of parinirvāṇa).",
        "source": "T45n1892_001:0809b21_7"
    },
    {
        "source_sentence": "西南角神名婆里旱(又領般遮羅遮馱大軍主神)；",
        "translation": "The southwest corner deity is named Vāriputra (also called Vaiśravaṇa, the great army lord god who commands the pāñcilinda).",
        "source": "T45n1892_001:0809b22_8"
    },
    {
        "source_sentence": "西北角神王名金毘羅(又領婆多祁利大軍主神)；",
        "translation": "The northwest corner deity king is named Kimbila (also known as the great army lord god who commands the state of Bhadrika).",
        "source": "T45n1892_001:0809b23_9"
    },
    {
        "source_sentence": "東北角神將名散脂(又領醯摩跋多大軍主神)。",
        "translation": "The northeastern horn deity general is called Sanzhi (also known as the great army lord deity who governs over Kāmabhadra).",
        "source": "T45n1892_001:0809b24_10"
    },
    {
        "source_sentence": "下層南面二階，東畔階道(東神名堅固光曜，西神名日光曜)；",
        "translation": "The lower storeys are two stories on the south side of the south, facing east; the eastern deity is called Stable Light and the western deity Sunlight.",
        "source": "T45n1892_001:0809b24_11"
    },
    {
        "source_sentence": "西畔階道(東神名須彌華，西神名淨雲音)。",
        "translation": "The west side of the path is a staircase (the eastern deity is called Sumeru Flower, and the western deity is called Pure Cloud Sound).",
        "source": "T45n1892_001:0809b25_12"
    },
    {
        "source_sentence": "東面一階道(南神名阿脩羅王，北神名勝光明)；",
        "translation": "The southern deity is called King Asura; the northern deity is called Supreme Light.",
        "source": "T45n1892_001:0809b26_13"
    },
    {
        "source_sentence": "西面一階道(南神名樹音聲，北神名師子王)。",
        "translation": "On the west side, there's a one-story path (the south deity is called tree and the north deity is called lion king).",
        "source": "T45n1892_001:0809b27_14"
    },
    {
        "source_sentence": "北面一階道(西神名淳厚光藏，東神名珠髻華光)。",
        "translation": "The north side is a one-story path (the west deity is called the Pure and Thick Light Treasury, and the east deity is called the Jewel Topknot Flower Light).",
        "source": "T45n1892_001:0809b27_15"
    },
    {
        "source_sentence": "第二層上四角大神，所謂四天王也，常護佛法及以眾生，豈唯壇塔而在情外，",
        "translation": "On the second story is a great four-cornered deity called the king of the four heavenly kings, who always protects the buddha-dharma and sentient beings. Isn’t it just an altar or stupa that lies beyond",
        "source": "T45n1892_001:0809c01_16"
    },
    {
        "source_sentence": "故須造立儀像，依方隅而列之(依《灌頂經》云：「五羅鬼神、鬼子母神五百兒子、及摩醯首羅、摩尼跋陀、脩利犍陀五神，",
        "translation": "Therefore, it's necessary to create a standing image of the goddess and arrange it in square corners (according to the Consecration Sutra, which says, The five ghostly spirits of the fifty-five sons of the",
        "source": "T45n1892_001:0809c03_17"
    },
    {
        "source_sentence": "於佛滅後常護塚塔，不使邪人所壞。",
        "translation": "After the parinirvāṇa of the Buddha, he always guarded the tomb and didn't allow it to be destroyed by evil people.",
        "source": "T45n1892_001:0809c04_18"
    },
    {
        "source_sentence": "若破壞者，當知正法欲滅，故使然也。」",
        "translation": "If someone breaks it, they should know that the right teaching wants to cease, so they'll do so.",
        "source": "T45n1892_001:0809c05_19"
    },
    {
        "source_sentence": ")。",
        "translation": "(Skt. pārijātaka).",
        "source": "T45n1892_001:0809c05_20"
    },
    {
        "source_sentence": "東北角天王名提頭賴吒，領乾闥婆及毘舍闍眾，住東弗婆提洲。",
        "translation": "The northeast corner celestial king named Dhṛtarāṣṭra rules over the gandharvas and piśācīs, who live on the eastern continent of Pubbavideha.",
        "source": "T45n1892_001:0809c05_21"
    },
    {
        "source_sentence": "《大智論》云：「四天王並壽九百萬歲，各有九十一子，皆護佛法。」",
        "translation": "The Mahāprajñāpāramitā-śāstra says, The four heavenly kings all have a life span of nine million years, and each has ninety-one sons, all protecting the Buddha's teaching.",
        "source": "T45n1892_001:0809c07_0"
    },
    {
        "source_sentence": "其王領四神軍主，出《灌頂經》，下同今配。",
        "translation": "The king ruled over the four deva generals and produced the Consecration Sutra, which is the same as the present scrip­ tion.",
        "source": "T45n1892_001:0809c08_1"
    },
    {
        "source_sentence": "戒壇第二層基，東面兩階各二神；",
        "translation": "On the second-storied foundation of the ordination platform there are two deities on each of the two stories on the east side.",
        "source": "T45n1892_001:0809c09_2"
    },
    {
        "source_sentence": "南階道二神(南神名地珂，北神名脩涅多羅)，北階道二神(南神名分那柯，",
        "translation": "The two spirits of the path in the southern direction (the southern spirit is called Dīpa, the northern spirit is called Śuṇetra), and the two spirits of the path in the northern direction (the southern spirit is called Puṇ",
        "source": "T45n1892_001:0809c10_3"
    },
    {
        "source_sentence": "北神名迦毘羅)。",
        "translation": "The northern deity is called Kapilavastu).",
        "source": "T45n1892_001:0809c11_4"
    },
    {
        "source_sentence": "東南角天王名毘婁勒叉，領鳩槃茶及薜茘多眾，住南閻浮提洲。",
        "translation": "To the southeast is the celestial king角天王名毘婁勒叉, who lives on the southern continent of Jambudvīpa under the name of Virūḍhaka and commands the kumbhāṇḍa and caitya.",
        "source": "T45n1892_001:0809c11_5"
    },
    {
        "source_sentence": "所領四神軍主，配南面二階各二神，東階道二神(東神名僧伽，西神名優波僧伽)，",
        "translation": "The four divine armies led by the four deities were arrayed at each of the two levels on the southern side, with two spirits in each direction and two spirits on the east level (the eastern spirit was called Saṃgha; the western",
        "source": "T45n1892_001:0809c12_6"
    },
    {
        "source_sentence": "西階道二神(東神名償起羅，西神名栴陀那)。",
        "translation": "The two deities of the western path (the eastern deities are called Kauśinagara and the western deities are called Gandhāra).",
        "source": "T45n1892_001:0809c14_7"
    },
    {
        "source_sentence": "西南角天王名毘婁博叉，領諸龍及富多羅眾，住西瞿耶尼洲。",
        "translation": "The southwest corner celestial king named Videha, led by a group of dragons and pratyekabuddhas, lived on the west side of the continent of Aparagodānīya.",
        "source": "T45n1892_001:0809c14_8"
    },
    {
        "source_sentence": "其所領四神軍主，配西面二階各二神，南階道二神(南神名訶利，北神名訶利枳舍)，",
        "translation": "The four divine armies led by the four deities were arrayed with two deities at each of the two levels on the west side and two deities at each of the two levels on the southern path (the name of the deity in the south was H",
        "source": "T45n1892_001:0809c16_9"
    },
    {
        "source_sentence": "北階道二神(南神名波羅赴，北神名冰伽羅)。",
        "translation": "The two deities of the northern path (the southern deity is called Pārāṣṭra, and the northern deity is called Bingkara).",
        "source": "T45n1892_001:0809c17_10"
    },
    {
        "source_sentence": "西北角天王名毘沙門，領夜叉及羅剎眾，住北欝單越洲；",
        "translation": "To the northwest is the celestial king Angle of Delight called Vaiśravaṇa, ruling over all the yakṣas and rāṣas. He lives in Uttarakuru to the north.",
        "source": "T45n1892_001:0809c18_11"
    },
    {
        "source_sentence": "多來閻浮提，其王手中掌擎佛塔，古佛舍利在中。",
        "translation": "Many came from Jambudvfpa. The king held a buddha- stupa in his hand and the relics of the ancient buddhas were preserved there.",
        "source": "T45n1892_001:0809c19_12"
    },
    {
        "source_sentence": "佛在時，令其持行，所在作護，佛法久固。",
        "translation": "When the Buddha is present, he causes them to maintain it and protect it wherever they are, so that the Buddha's teaching will be firm for a long time.",
        "source": "T45n1892_001:0809c20_13"
    },
    {
        "source_sentence": "又令天王威德勢力領四神軍主，配北面一階邊各二神，西邊二神(一名陀羅那、二名阿羅難陀)，",
        "translation": "He also ordered the celestial kings to command the four guardian generals of the gods, two on each side of the northern terrace and two on each side of the western terrace (one named Dhāraṇī and one Ālananda),",
        "source": "T45n1892_001:0809c21_14"
    },
    {
        "source_sentence": "東邊二神(一名欝庾伽波羅、二名別他那)。",
        "translation": "To the east, there are two deities (one named Kauśinagara and two named Biātana).",
        "source": "T45n1892_001:0809c23_15"
    },
    {
        "source_sentence": "依《賢愚經》，此等鬼神皆名夜叉，形色青黑，眼赤如血，鉤牙上出，",
        "translation": "According to the Sutra of Good and Evil, these ghosts are all called yakṣas, blue and black in color, red like blood in their eyes, with hooks and tusks protruding from their mouths.",
        "source": "T45n1892_001:0809c24_16"
    },
    {
        "source_sentence": "頭髮悉豎，火從口出。",
        "translation": "They all stood upright, and the fire came out of their mouths.",
        "source": "T45n1892_001:0809c25_17"
    },
    {
        "source_sentence": "經雖如此，及論顯相，義須別態，不可一像。",
        "translation": "Even so, the meaning of the sūtras and treatises that express characteristics requires a different aspect; they cannot be one and the same image.",
        "source": "T45n1892_001:0809c26_18"
    },
    {
        "source_sentence": "其第二層上，四面七階道頭各有二神，則十六也！",
        "translation": "On the second storey, there are two goddesses on each of the four sides and seven steps at the top of the path, which are sixteen!",
        "source": "T45n1892_001:0810a01_19"
    },
    {
        "source_sentence": "必須其名，可如《灌頂經》。",
        "translation": "They must have names, as shown in the Consecration Sutra.",
        "source": "T45n1892_001:0810a02_20"
    },
    {
        "source_sentence": "四天王所部諸神，隨名便配，且存前數，何由可盡其數量也！",
        "translation": "The gods belonging to the order of the four heavenly kings are listed according to their names, and if you keep the previous number, how could you count them all?",
        "source": "T45n1892_001:0810a02_21"
    },
    {
        "source_sentence": "兩層色道內龕窟中神，經中大多，今依《孔雀王經》，明七星神，依方守護；",
        "translation": "The deities in the two-story, multicolored paths inside the niches are mostly found in the scriptures. According to the Mahāprajñāpāramitā-sūtra we now see seven star deities guarding them according to their directions.",
        "source": "T45n1892_001:0810a04_22"
    },
    {
        "source_sentence": "其上層中安窟既少，可列七星神，配坐窟中；",
        "translation": "On the upper storeys there are few caves to be placed, so seven star deities can be listed and seated in them.",
        "source": "T45n1892_001:0810a06_23"
    },
    {
        "source_sentence": "然二十八星神出沒增減，常行於世，有大光明，深能利益。",
        "translation": "Nevertheless, the twenty-eight lunar stations appear and disappear in increasing and decreasing numbers. They always travel through the sky but they have a great ray of light that is deeply beneficial to all beings.",
        "source": "T45n1892_001:0810a07_24"
    },
    {
        "source_sentence": "東方七星神名：基栗底柯一、虜喜尼二、麋梨伽尸羅三、阿陀羅四、不捺那婆脩五、弗沙六、阿沙離沙七。",
        "translation": "The seven celestial spirits in the eastern direction are named Jyotika I, Kauśinagara II, Mucilinda III, Adara IV, Upanna Vātsīputrīya (5), Puṣkara (6), Asari (7).",
        "source": "T45n1892_001:0810a08_25"
    },
    {
        "source_sentence": "南方七星神名：訶可一、雨頗二、求尼三、訶莎多四、質多羅五、莎底六、毘釋珂七。",
        "translation": "The seven celestial spirits in the southern direction are called Hatthaka I, Ratnapāṭika II, Kauṇḍinya III, Hasvata IV, Citrā (5), Sādhi (6), and Vaiśravaṇa (7).",
        "source": "T45n1892_001:0810a11_0"
    },
    {
        "source_sentence": "西方七星神名：阿[少\\/兔]羅他一、折沙他二、牟藍三、弗婆莎他四、欝多羅莎他五、阿毘止六、沙羅波那七。",
        "translation": "The seven celestial spirits in the western direction are called a[lesser\\/rabbit] rāṭa 1.",
        "source": "T45n1892_001:0810a12_1"
    },
    {
        "source_sentence": "北方七星神名：陀薾他一、捨多毘沙二、弗婆跋陀羅三、欝多羅跋陀羅四、離婆底五、阿雖尼六、婆羅尼七。",
        "translation": "The seven celestial spirits in the northern direction are named Tathågata I, Sadāparibhūta II, Upabhadra III, Uttarabhadra IV, Revata Five, Akaniṣṭha VI, and Vārāṇasī VII.",
        "source": "T45n1892_001:0810a15_2"
    },
    {
        "source_sentence": "右二十八神，方別七龕依名位列。",
        "translation": "The twenty-eight deities on the right are located in seven separate niches, listed according to their names and positions.",
        "source": "T45n1892_001:0810a17_3"
    },
    {
        "source_sentence": "至於下層亦有龕窟，約方開影，其量則多，臨時分像，依《優波斯那呪經》及《灌頂經》。",
        "translation": "On the lower level there is also a niche in which to enshrine the Buddha’s images are preserved. The size of these images varies according to how large they are. According to the Upāsina-sūtra and the Consecration Sutra",
        "source": "T45n1892_001:0810a18_4"
    },
    {
        "source_sentence": "神名極多，亦依方住，至時檢經，隨龕多少，就列名號，為存繁文，故略不出。",
        "translation": "The names of the deities were so numerous that they also lived according to their locations. When the time came, they searched the scriptures and listed the names of the shrines according to the number of niches in order to keep the extensive texts; therefore",
        "source": "T45n1892_001:0810a20_5"
    },
    {
        "source_sentence": "最上第三重，止高二寸，表二諦也；",
        "translation": "The third and highest one, two inches high at the base, indicates the two truths.",
        "source": "T45n1892_001:0810a22_6"
    },
    {
        "source_sentence": "欲明諸佛說法常依二諦，用表受戒出家者，必知二諦為宗歸也！",
        "translation": "Those who want to explain that the teachings of the buddhas always rely on the two truths, and those who leave home because they use expressions to receive precepts will surely know that the two truths are the doctrine's refuge!",
        "source": "T45n1892_001:0810a23_7"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T45n1892_001:0810a24_8"
    },
    {
        "source_sentence": "以身、口二業，動必依相，相為俗有；",
        "translation": "bodily action and vocal action necessarily depend on the characteristic marks as their support. The characteristic marks exist conventionally.",
        "source": "T45n1892_001:0810a24_9"
    },
    {
        "source_sentence": "心行所期，離相為本，本為出道之所依也！",
        "translation": "The mind and its activities are expected to be free of characteristics as the root, and the root is the basis for the path of liberation!",
        "source": "T45n1892_001:0810a25_10"
    },
    {
        "source_sentence": "故二寸為準的量相。",
        "translation": "Therefore, two inches are the measured characteristic of the standard.",
        "source": "T45n1892_001:0810a26_11"
    },
    {
        "source_sentence": "上壇四角各立師子，背上有孔，欲行事時，必施尊儀，上安帳竿於孔中也！",
        "translation": "On each of the four corners of the upper altar, there's a lion standing with a hole at his back, and when he wants to do so, he must give it to the honored one, placing a canopy in the hole!",
        "source": "T45n1892_001:0810a27_12"
    },
    {
        "source_sentence": "帳之莊嚴隨力所辦。",
        "translation": "The adornment of the tent follows what's prepared according to one's ability.",
        "source": "T45n1892_001:0810a28_13"
    },
    {
        "source_sentence": "上壇畟方七尺為量，以表七覺意也！",
        "translation": "The upper altar is seven feet in width, which is the measure of the altar, to show the meaning of the seven awakenings!",
        "source": "T45n1892_001:0810b01_14"
    },
    {
        "source_sentence": "三乘入道不越三十七品，於此品中，七覺意在道思擇，其功最高，故在上而列也！",
        "translation": "In this chapter, the seven awakening intentions of the three vehicles who enter the path don't transcend the thirty-seven factors, and their merit is the highest, so they're listed above!",
        "source": "T45n1892_001:0810b02_15"
    },
    {
        "source_sentence": "壇外四周一丈內，種四時華藥，已外植華樹八行，種種莊嚴。",
        "translation": "Outside the altar, within four zhang in circumference, he planted flowers and medicines for the four seasons of the year. After planting them outside the altar, he planted eight lines of flowering trees with various adornments.",
        "source": "T45n1892_001:0810b04_0"
    },
    {
        "source_sentence": "依《善見論》云：「戒壇極小，容二十一人。」",
        "translation": "According to the Shanjian lun, The precepts altar is so small that it can contain twenty-one people.",
        "source": "T45n1892_001:0810b05_1"
    },
    {
        "source_sentence": "此據出罪之相也。",
        "translation": "This is based on the characteristic of expelling sin.",
        "source": "T45n1892_001:0810b06_2"
    },
    {
        "source_sentence": "然亦不分壇、場之異也！",
        "translation": "However, it doesn't distinguish between the altar and the site!",
        "source": "T45n1892_001:0810b06_3"
    },
    {
        "source_sentence": "戒壇高下廣狹第四(并引圖相)",
        "translation": "Fourth, the height and width of the precepts altar is high and low (and quoted from the drawing)",
        "source": "T45n1892_001:0810b08_0"
    },
    {
        "source_sentence": "檢《別傳》云：「比丘受具戒壇初結之時，釋迦如來召十方諸佛；",
        "translation": "The Biezhuan jing (i.e., Biezhuan) says: When the bhikṣu received the ordination precepts at the beginning of his ordination platform, the Tathāgata Śākyamuni summoned the buddhas of the ten direction",
        "source": "T45n1892_001:0810b09_0"
    },
    {
        "source_sentence": "時須彌燈光明王最居其長，身長五丈，欲立戒壇三重，重高佛五肘，表五分法身。",
        "translation": "At the time, Sumeru the King of Illumination of the Light of the Lamp of the Buddha was the longest; he was fifty feet in height and wanted to erect a precepts altar threefold, five feet in height with the Buddha’s",
        "source": "T45n1892_001:0810b10_1"
    },
    {
        "source_sentence": "釋迦如來云：『娑婆世界眾生少見少聞，若依佛五肘為量，恐生疲怠，",
        "translation": "The Tathāgata Śākyamuni said, 'Some sentient beings in the sahā world have little vision and little hearing. If they rely on the Buddha' s measure of five zhou, they will be afraid to become exhausted.",
        "source": "T45n1892_001:0810b12_2"
    },
    {
        "source_sentence": "無由可成，減同迦葉佛二肘半量，則易成就。』」",
        "translation": "There's no way to accomplish it; it's easy to accomplish it by measuring less than two and a half zhou the size of Kāśyapa Buddha.'",
        "source": "T45n1892_001:0810b13_3"
    },
    {
        "source_sentence": "所以取佛肘量者，以諸佛肘骨並是金剛，闍維之時，肘骨不灰，全堅舍利，",
        "translation": "The reason for taking the measure of the Buddha’s elbow is that the elbow bones of these buddhas are all made of adamantine gold. When they were carved, their elbow bones did not ash but remained as firm as the relics",
        "source": "T45n1892_001:0810b14_4"
    },
    {
        "source_sentence": "所在流化，故壇身量取佛肘以定之；",
        "translation": "Because of the transmigration wherever they are, the dimension of the altar-body is fixed by taking the Buddha’s elbow.",
        "source": "T45n1892_001:0810b16_5"
    },
    {
        "source_sentence": "欲令比丘持戒堅固如金剛而不壞也！",
        "translation": "I want to make the monks' observance of precepts as firm as a vajra that doesn't break down!",
        "source": "T45n1892_001:0810b17_6"
    },
    {
        "source_sentence": "戒壇亦爾，雖經劫壞，而常存故。",
        "translation": "The precepts altar is also like this, because even after an eon of decay it remains eternal.",
        "source": "T45n1892_001:0810b18_7"
    },
    {
        "source_sentence": "檢釋迦如來一肘，則中人二肘，如來在世倍人；",
        "translation": "If one were to examine the Tathāgata Śākyamuni, who was [only] an elbow in circumference, there would be a human being of two elbows among them. The Tathāgata’s presence in the world would make him dou",
        "source": "T45n1892_001:0810b18_8"
    },
    {
        "source_sentence": "人肘長唐尺一尺五寸，則佛肘三尺；",
        "translation": "The human elbow is one foot five inches long, whereas the Buddha’s is three feet in length.",
        "source": "T45n1892_001:0810b19_9"
    },
    {
        "source_sentence": "佛肘既長二肘半，則唐尺七尺五寸也！",
        "translation": "Since the Buddha's elbow is two and a half zhou long, it's seven feet five inches in height!",
        "source": "T45n1892_001:0810b20_10"
    },
    {
        "source_sentence": "又云：「準迦葉佛肘為量者」，則又長於釋迦肘矣！",
        "translation": "It's also said, According to the measurement of Kāśyapa Buddha's elbow, it's even longer than Śākyamuni's elbow!",
        "source": "T45n1892_001:0810b21_11"
    },
    {
        "source_sentence": "依今北天竺東石戒壇，縱廣二百步，高一丈許，此則隨時不定；",
        "translation": "In the northern India to the east of present-day Jambudvīpa there is a stone ordination platform, two hundred paces wide and about one zhang in height.",
        "source": "T45n1892_001:0810b22_12"
    },
    {
        "source_sentence": "今且從釋迦丈六為言，其下層從地起基，高佛一肘，則唐尺高三尺也！",
        "translation": "Now, let's start from the sixteen feet of Śākyamuni and say that the base rises from the ground at the bottom of the lower level, which is one elbow high for the Buddha, which is three feet in height!",
        "source": "T45n1892_001:0810b24_0"
    },
    {
        "source_sentence": "謂在色道下座身為言，餘亦同之。",
        "translation": "It means that it's the same as the rest of the seat body at the lower level of the form realm, which is called speech.",
        "source": "T45n1892_001:0810b25_1"
    },
    {
        "source_sentence": "然此色道上三下四，唯多出為佳，以在露地，色道廣覆，而風雨不至，",
        "translation": "However, there are only three or four of these paths leading up to Rūpadhātu. Most of the trees and shrubs produce good forest products because they are exposed to the wind and rain that do not reach them.",
        "source": "T45n1892_001:0810b26_2"
    },
    {
        "source_sentence": "諸窟神王久而得固也。",
        "translation": "For a long time, the cave deities and kings have been able to make it firm.",
        "source": "T45n1892_001:0810b27_3"
    },
    {
        "source_sentence": "如今浮圖出檐，可不然耶！",
        "translation": "Now that a pagoda has emerged from the eaves, isn't it?",
        "source": "T45n1892_001:0810b28_4"
    },
    {
        "source_sentence": "不得過於一肘者，恐地裂故。",
        "translation": "They won't be allowed to go beyond an elbow because they're afraid the ground will split.",
        "source": "T45n1892_001:0810c01_0"
    },
    {
        "source_sentence": "又表比丘於壇受戒，制心專一而不散亂也！",
        "translation": "It also shows that the monk receives the precepts at the altar and restrains his mind from concentrating on one single thing without being distracted!",
        "source": "T45n1892_001:0810c01_1"
    },
    {
        "source_sentence": "其第二層高佛一肘半，則唐尺四尺五寸也，同轉輪聖王初登壇上受灌頂之時壇度也。",
        "translation": "The second story, one and a half zhou tall, is four or five inches in height from the feet of the Buddha. It is the same as the transfiguration of the altar at the time when the universal ruler first ascended to the altar to receive",
        "source": "T45n1892_001:0810c02_2"
    },
    {
        "source_sentence": "其第三層高二寸者，以佛指二寸為量，則當中人四寸也。",
        "translation": "The third story is two inches high because the Buddha's fingers are measured by two inches, and the person inside it is four inches tall.",
        "source": "T45n1892_001:0810c04_3"
    },
    {
        "source_sentence": "今北印度烏仗那國東千餘里，度鐵索橋至烏仗那舊都，其地平坦，名果皆備，",
        "translation": "More than one thousand li to the east of the country of Udyāna in northern India, he crossed an iron-rope bridge and reached the old capital city of Udyāna. The land there was level and peaceful and well known for its productivit",
        "source": "T45n1892_001:0810c05_4"
    },
    {
        "source_sentence": "即古轉輪王之果園也，有大石戒壇焉。",
        "translation": "This is the fruit grove of the ancient cakravartin king. There is a large stone precepts altar at this place.",
        "source": "T45n1892_001:0810c07_5"
    },
    {
        "source_sentence": "佛滅度後三百年時，有大阿羅漢優樓質那者，威德巨勝，於園北山石崖造大寺，",
        "translation": "Three hundred years after the parinirvāṇa of the Buddha there was a great arhat named Urucinā, of great prestige and mighty virtue, who built a great monastery on a rocky cliff in the mountain north of the park.",
        "source": "T45n1892_001:0810c08_6"
    },
    {
        "source_sentence": "南北周院五十餘里，僧所住處一十五里。",
        "translation": "More than fifty li to the south and north of the monastery, the place where the monks lived was over fifteen li in circuit.",
        "source": "T45n1892_001:0810c10_7"
    },
    {
        "source_sentence": "請彌勒尊者為指揮之，役使工匠，經三百年，以大神力住諸人壽。",
        "translation": "He invited Venerable Maitreya to command it and ordered a skillful craftsman to work on it. Three hundred years passed, and with great supernatural powers the Master stayed among the living beings for three hundred years.",
        "source": "T45n1892_001:0810c11_8"
    },
    {
        "source_sentence": "五重精舍，純石為之。",
        "translation": "The five-storied monasteries are built of pure stone.",
        "source": "T45n1892_001:0810c12_9"
    },
    {
        "source_sentence": "最上重者高三百餘尺，中安栴檀像，相亦如之；",
        "translation": "The heaviest one was over three hundred feet in height and contained a sandalwood image, the shape of which was likewise.",
        "source": "T45n1892_001:0810c13_10"
    },
    {
        "source_sentence": "乃至下重安赤銅像。",
        "translation": "Up to the bottom, he placed a red copper image.",
        "source": "T45n1892_001:0810c14_11"
    },
    {
        "source_sentence": "今上四重皆閉，非凡所幸；",
        "translation": "All four of the above-mentioned categories are now closed, which is an extraordinary thing to be fortunate.",
        "source": "T45n1892_001:0810c14_12"
    },
    {
        "source_sentence": "而石若琉璃，內外映徹，人從邊過，照見藏腑。",
        "translation": "The stone is like a lapis lazuli, shining both inside and out. People pass by it from side to side and see the interior of the cave.",
        "source": "T45n1892_001:0810c15_13"
    },
    {
        "source_sentence": "其下重者，今人受用，四周華果列植充滿。",
        "translation": "The lower level is used by people today, and flowers and fruit are planted in rows all around it to fill it.",
        "source": "T45n1892_001:0810c16_14"
    },
    {
        "source_sentence": "東有石壇，縱廣二百餘步，四周石欄雕飾難言；",
        "translation": "To the east was a stone altar more than two hundred paces in length and breadth, surrounded by stone railings carved with unspeakably many embellishments.",
        "source": "T45n1892_001:0810c17_15"
    },
    {
        "source_sentence": "基上平鏤，奇態轉勢，高可一丈。",
        "translation": "The foundation of the stupa was carved evenly, with an unusual shape and rising to a height of about one zhang.",
        "source": "T45n1892_001:0810c18_16"
    },
    {
        "source_sentence": "上壇中心安佛舍利，覆釜在上，如前所述。",
        "translation": "At the center of the upper altar, there's a Buddha's relic, and the covered pot is placed above it, as described above.",
        "source": "T45n1892_001:0810c19_17"
    },
    {
        "source_sentence": "受戒之日，如上集僧，別施高座，先誦《遺教經》，諸比丘聞皆悉涕泣。",
        "translation": "On the day he received the precepts, as above, he gathered the saṃgha and gave them a separate high seat to him, first reciting the Ancient Teachings Sutra. All the monks who heard it wept in tears.",
        "source": "T45n1892_001:0810c20_18"
    },
    {
        "source_sentence": "及受戒訖，又誦《遺教》，其事見在。",
        "translation": "After he had received the precepts, he also recited the bequeathed teachings, which were found elsewhere.",
        "source": "T45n1892_001:0810c21_19"
    },
    {
        "source_sentence": "往往有僧，從彼而來，玄奘法師《西域傳》中，略述大栴檀像事，而不辨其緣由。",
        "translation": "In the Biographies o f the Western Regions compiled by the Master Xuanzang he briefly described the story of the sandalwood images but did not explain the reason for this.",
        "source": "T45n1892_001:0810c22_20"
    },
    {
        "source_sentence": "至於戒壇，文事蓋闕。",
        "translation": "As for the ordination altar, the text and service were missing.",
        "source": "T45n1892_001:0810c24_21"
    },
    {
        "source_sentence": "豈非行不至彼，隨聞而述，不足怪也！",
        "translation": "Isn't it because the practitioner doesn't go there and follows what he hears and describes it, which isn't enough to wonder?",
        "source": "T45n1892_001:0810c24_22"
    },
    {
        "source_sentence": "今約祇樹園中，總有六十四院，通衢大巷，南有二十六院。",
        "translation": "In the Jetavana Garden there are sixty-four pavilions arranged in all, with twenty-six courts to the south of the main thoroughfares and lanes.",
        "source": "T45n1892_001:0810c25_23"
    },
    {
        "source_sentence": "三門之左右",
        "translation": "to the left and right of the three approaches",
        "source": "T45n1892_001:0810c27_0"
    },
    {
        "source_sentence": "大院：西門之右六院(初、三果學人四諦院，二、學人十二因緣院，三、他方三乘八聖道院，",
        "translation": "The great court: the six courts to the right of the west gate (first, the court for the four truths of the three fruits of Buddhist disciples; second, the court for the twelve causal conditions for students; third, the court for the",
        "source": "T45n1892_001:0811a01_0"
    },
    {
        "source_sentence": "四、四天下我見俗人院，五、外道欲出家院，六、凡夫禪師十一切入院)；",
        "translation": "4. I see the court of laypeople in the four realms under heaven, 5. a court where heretics wish to leave home, and 6. ordinary Chan masters are admitted by all ten.",
        "source": "T45n1892_001:0811a02_1"
    },
    {
        "source_sentence": "東門之左七院(初、大梵天王院，二、維那知事院，三、大龍王院，四、居士清信長者院，",
        "translation": "The seven courts to the left of the east gate (first, the court of Mahābrahmā; second, the court of Vaiśravaṇa; third, the court of the great dragon king; fourth, the court of the wealthy householder",
        "source": "T45n1892_001:0811a03_0"
    },
    {
        "source_sentence": "五、文殊師利院，六、僧庫院，七、僧戒壇)；",
        "translation": "5. the court of Mañjuśrī, 6. the court of the treasury of the Sangha, and 7. the ordination platform for the Sangha;",
        "source": "T45n1892_001:0811a04_0"
    },
    {
        "source_sentence": "中門之右七院(初、緣覺四諦院，二、緣覺十二因緣院，三、菩薩四諦院，",
        "translation": "The seven courts to the right of the middle gate (first, the court of the four truths of pratyekabuddha, second, the court of the twelve causes and conditions of pratyekabuddha, third, the court of the four truths of",
        "source": "T45n1892_001:0811a05_0"
    },
    {
        "source_sentence": "四、菩薩十二因緣院，五、無學人問法院，六、學人問法院，七、佛香庫院)；",
        "translation": "4. the court of the bodhisattva's twelve causes and conditions, 5. the court where post-learning people ask questions, 6. the court where post-learning people ask questions, and 7. the Buddha's treasury of fragrance;",
        "source": "T45n1892_001:0811a05_1"
    },
    {
        "source_sentence": "中門之左六院(初、他方俗人菩薩院，二、他方比丘菩薩院，三、尼請教誡院，",
        "translation": "The six courts to the left of the middle gate (first, the court for laymen and bodhisattvas from other directions; second, the court for bhikṣus and bodhisattvas from other directions; third, the court for nuns",
        "source": "T45n1892_001:0811a07_0"
    },
    {
        "source_sentence": "四、教誠比丘尼院，五、他方諸佛院，六、諸仙院)。",
        "translation": "4. the monastery of the sincere monks and nuns who teach, 5. the monasteries of the buddhas in other directions, and 6. the monasteries of the sages.)",
        "source": "T45n1892_001:0811a07_1"
    },
    {
        "source_sentence": "繞佛院外有十九院(在通衢外，巷北自分五門，二巷周通南出)：中院東門之左七院(初、律師院，",
        "translation": "circumambulating the Buddha’s monastery, there are nineteen other monasteries: (i.e., five gates to the north and two gates to the south of each one;) the seven courts on the left side of the east",
        "source": "T45n1892_001:0811a09_0"
    },
    {
        "source_sentence": "二、戒壇院，三、諸論師院，四、修多羅院，五、佛經行院，六、佛洗衣院，",
        "translation": "2. the monastery of the precepts altar, 3. the monastery of the treatise masters, 4. the monastery of the sutras, 5. the monastery of the Buddha's scriptures and practices, and 6. the monastery",
        "source": "T45n1892_001:0811a10_1"
    },
    {
        "source_sentence": "七、佛衣服院)；",
        "translation": "7. the Buddha’s cloth court;",
        "source": "T45n1892_001:0811a11_2"
    },
    {
        "source_sentence": "中院北有六院(初、四韋陀院，二、天下不同文院，三、天下陰陽書院，",
        "translation": "To the north of the central court there were six courts (the first, the four Vedas courts, the second, the court for different texts under heaven, and the third, the court for the writing of yin and yang under heaven.",
        "source": "T45n1892_001:0811a12_0"
    },
    {
        "source_sentence": "四、天下醫方院，五、僧淨人院，六、天下童子院)；",
        "translation": "4. the Healing and Meditation Temple of the World, 5. the Monastery for the Pure Persons of the Sangha, and 6. the Children’s Temple of the World.",
        "source": "T45n1892_001:0811a12_1"
    },
    {
        "source_sentence": "中院西有六院(初、無常院，二、聖人病院，三、佛示病院，四、四天王獻佛食院，",
        "translation": "To the west of the middle court are six courts (the first, the court of impermanence; the second, the holy man's hospital; the third, the Buddha's hospital; and the fourth, the palace where the four heavenly kings",
        "source": "T45n1892_001:0811a14_0"
    },
    {
        "source_sentence": "五、浴室院，六、流廁院)；",
        "translation": "The fifth is the bathhouse, and the sixth is the toilet.",
        "source": "T45n1892_001:0811a14_1"
    },
    {
        "source_sentence": "正中佛院之內有十九所(初、佛院門東，佛為比丘結戒壇。",
        "translation": "In the middle, there are 19 places inside the Buddha's monastery (first, east of the entrance to the Buddha's monastery, where the Buddha set up a precepts altar for the monks.",
        "source": "T45n1892_001:0811a16_0"
    },
    {
        "source_sentence": "二、門西，佛為比丘尼結戒壇。",
        "translation": "2. To the west of the gate, the Buddha set up a precepts altar for the monks and nuns.",
        "source": "T45n1892_001:0811a16_1"
    },
    {
        "source_sentence": "三、前佛殿，四、殿東三重樓，五、殿西三重樓，六、七重塔，七、塔東鐘臺，",
        "translation": "3. the former Buddha hall, 4. the three towers to the east of the hall, 5. the three towers to the west of the hall, 6. a seven-story stūpa, and 7. a bell platform to the east of the stūpa.",
        "source": "T45n1892_001:0811a17_2"
    },
    {
        "source_sentence": "八、塔西經臺，九、後佛說法大殿，十、殿東五重樓，十一、殿西五重樓，",
        "translation": "8. the sūtra platform to the west of the stūpa, 9. the great hall where the late Buddha taught the Dharma, 10. five storeys east of the hall, and 11. five storeys west of the hall.",
        "source": "T45n1892_001:0811a17_3"
    },
    {
        "source_sentence": "十二、三重樓，十三、九金鑊，十四、方華池，十五、三重閣，十六、閣東五重樓，",
        "translation": "12. Three story towers, 13. Nine golden cauldrons, 14.square lotus ponds, 15. Three story pavilions, and 16. Five story towers east of the pavilion.",
        "source": "T45n1892_001:0811a18_4"
    },
    {
        "source_sentence": "十七、閣西五重樓，十八、東佛庫，十九、西佛庫)。",
        "translation": "17. five storeys west of the pavilion, 18. the Buddha's storey in the east, and 19. the Buddha's storey in the west.)",
        "source": "T45n1892_001:0811a19_5"
    },
    {
        "source_sentence": "余以恒俗所聞，唯存聲說，附事經論，則紛然莫舉，豈非信文誦語，不存行事，",
        "translation": "But, as I have always heard the teachings of the secular world, I retain only my own words and phrases. If I append passages from scriptures and commentaries to it, they will not be cited in a confused way. Isnt",
        "source": "T45n1892_001:0811a21_0"
    },
    {
        "source_sentence": "徒喪生涯，於道何益。",
        "translation": "What good would it be to lose one’s life in vain for the sake of the Way?",
        "source": "T45n1892_001:0811a22_1"
    },
    {
        "source_sentence": "所以每事研覈，文質相師，隨有作業，名實非爽。",
        "translation": "That's why every time there's a study of things, the textual quality and characteristics are studied, and whatever actions are done, they're called really not exhorting.",
        "source": "T45n1892_001:0811a23_2"
    },
    {
        "source_sentence": "雖加砭石，久弊膏肓，空費言時，卒未悛革。",
        "translation": "Even though it was made of brass and stone, which had been neglected for a long time, no leather shoes or leather slippers were offered to the Master.",
        "source": "T45n1892_001:0811b01_3"
    },
    {
        "source_sentence": "故示見圖，開張視聽，更有廣相，如別所存。",
        "translation": "That's why he showed the blueprint and opened it up to see and hear, and there were other extensive features as they existed separately.",
        "source": "T45n1892_001:0811b02_4"
    },
    {
        "source_sentence": "今略顯之，且救恒要，庶或值者，知其致焉！",
        "translation": "I'll show it briefly, just to save the constant essentials, so that anyone who meets it will know its cause!",
        "source": "T45n1892_001:0811b03_5"
    },
    {
        "source_sentence": "原夫戒壇之場，隨依大界僧住，不可恒準方隅，不定東西。",
        "translation": "Originally, the site of the ordination altar was to be built according to the residences of the monks living in the great boundary. It could not always be measured from one side to the other; it did not necessarily have an east or west direction",
        "source": "T45n1892_001:0811b04_6"
    },
    {
        "source_sentence": "多以東方為受戒之場，由創歸於佛法之地也！",
        "translation": "Most of them take the east as a place where they receive precepts, and from their creation they return to the land of the Buddha's teaching!",
        "source": "T45n1892_001:0811b05_7"
    },
    {
        "source_sentence": "西方為無常之院，由終沒於天傾之位也！",
        "translation": "To the west is the court of impermanence, and it's because it ultimately doesn't fall into the heavenly tilt!",
        "source": "T45n1892_001:0811b06_8"
    },
    {
        "source_sentence": "從多為相，餘則隨機。",
        "translation": "The primary elements are characterized by the presence of many, while the remaining are secondary.",
        "source": "T45n1892_001:0811b07_9"
    },
    {
        "source_sentence": "其初壇下層縱廣二丈九尺八寸，中層縱廣二丈三尺，上層畟方七尺。",
        "translation": "The lower level of the first altar is two zhang, nine chi and eight cun in width; the middle level is two zhang, three chi in length and width; and the upper level is seven feet in circumference.",
        "source": "T45n1892_001:0811b07_10"
    },
    {
        "source_sentence": "余所撰《祇桓圖》上下兩卷，修緝所聞，統收經律，討讎諸傳，極有蹤緒。",
        "translation": "I compiled the Two Fascicles of the Jetavana Master, in which are preserved what I have heard and collected all the scriptures and vinaya texts as well as various biographies with extensive records.",
        "source": "T45n1892_001:0812b01_0"
    },
    {
        "source_sentence": "然五大精舍，佛所常遊，祇桓一代，最住經久，故二十五載弘化在茲，",
        "translation": "The five great temples, however, are always visited by the Buddha. For the longest remaining time in the lifetime of King Jīvaka it has been this place for twenty-five years and his edification is manifested here.",
        "source": "T45n1892_001:0812b02_1"
    },
    {
        "source_sentence": "四藏、五部咸稱舍衛。",
        "translation": "The four collections and five divisions all call it Śrāvastī.",
        "source": "T45n1892_001:0812b04_2"
    },
    {
        "source_sentence": "故一佛化相，事迹極多，備在本圖，故此存略。",
        "translation": "Therefore, the apparitional appearances of a single buddha are so numerous as to be found in all the traces that they appear in the original drawings. For this reason these images are abbreviated here.",
        "source": "T45n1892_001:0812b04_3"
    },
    {
        "source_sentence": "致諸教中，樹立祇桓，開化元首，總而會之，大有科要。",
        "translation": "Among all the teachings, the Jīvaka school is the first and foremost in terms of enlightenment and edification. They are collected together into a single collection with extensive syllables and commentaries.",
        "source": "T45n1892_001:0812b05_4"
    },
    {
        "source_sentence": "如《賢愚經》，初搆祇栖，在八十頃地中，布金買地。",
        "translation": "For example, according to the Sutra of Good and Evil, the first monk was born in Jīvaka and spent eighty yojanas on the land, spreading gold to buy the land.",
        "source": "T45n1892_001:0812b06_5"
    },
    {
        "source_sentence": "舍利弗角神通，力伏外道六師，與須達捉繩，經度精舍，或喜或憂，如常聞見。",
        "translation": "Śāriputra’s horn supernatural power overpowered the six teachers of the heretical theories and he joined Sudarśana in holding a rope. The scriptures were delivered to the monastery, either delighted or grieved",
        "source": "T45n1892_001:0812b07_6"
    },
    {
        "source_sentence": "又曰：「汝於毘婆尸佛乃至迦葉，為佛起寺，而蟻生不絕。",
        "translation": "Again, he said, You built temples for the Buddha at Vipaśyin Buddha and up to Kāśyapa, but the ants never died out.",
        "source": "T45n1892_001:0812b09_7"
    },
    {
        "source_sentence": "生死長遠，唯福為要。",
        "translation": "Birth and death are long-lasting, but merit is the only thing essential.",
        "source": "T45n1892_001:0812b10_8"
    },
    {
        "source_sentence": "以栴檀塗佛窟，別房住止千二百處，百二十處別打犍稚。」",
        "translation": "They paint the Buddha's cave with sandalwood, live separately in one thousand two hundred places in a room, and beat the gandharva at one hundred and twenty places separately.",
        "source": "T45n1892_001:0812b11_9"
    },
    {
        "source_sentence": "如是云云，廣文如彼。",
        "translation": "Thus, it's said, the extensive text is as explained there.",
        "source": "T45n1892_001:0812b12_10"
    },
    {
        "source_sentence": "又檢《聖迹記》云：「繞祇桓園有一十八寺，並有僧住。」",
        "translation": "Again, he checked the Record of the Sacred sites and said, There are 18 temples surrounding the Jīvaka Park that all have monks living there.",
        "source": "T45n1892_001:0812b13_11"
    },
    {
        "source_sentence": "又別圖云：「祇桓一寺，十字巷通於外院。」",
        "translation": "A separate drawing also said, There's a temple in Jīvaka that crosses the streets and passes through the outer court.",
        "source": "T45n1892_001:0812b14_12"
    },
    {
        "source_sentence": "又云：「寺有二門，一南一東。」",
        "translation": "It also said, There are two approaches to the temple, one south and one east.",
        "source": "T45n1892_001:0812b15_13"
    },
    {
        "source_sentence": "又云：「寺有五門。」",
        "translation": "It's also said, There are five approaches to the temple.",
        "source": "T45n1892_001:0812b15_14"
    },
    {
        "source_sentence": "又云：「七日所成，大房三百口、六十餘院。」",
        "translation": "Again, he said, The large room was 300 mouths long and more than 60 halls in size when it was completed in seven days.",
        "source": "T45n1892_001:0812b16_15"
    },
    {
        "source_sentence": "案北齊靈裕法師〈寺誥〉述，〈祇桓圖經〉具明諸院，大有準的。",
        "translation": "According to the Northern Qi Lingyu fashi's Commentary on the Temple Gazetteer, the Jetavana Sutra explains all the temples, and there are many standards for them.",
        "source": "T45n1892_001:0812b16_16"
    },
    {
        "source_sentence": "又案《別傳》：「祇桓一寺，頓結三壇，今雖荒毀，不妨初有。」",
        "translation": "It's also found in the Biezhuan, saying, The Jetavana monastery suddenly formed three altars, but now that it's in desolation, it might as well have existed at first.",
        "source": "T45n1892_001:0812b18_17"
    },
    {
        "source_sentence": "自爾至今，千七百載，前後重造，凡二十返，形相不同，不足可怪，且據元始，",
        "translation": "It has been in existence for one thousand seven hundred years, being rebuilt before and after. Twenty world ages have passed since then, but the shapes of these images are not to be wondered at. The origin is as follows:",
        "source": "T45n1892_001:0812b19_18"
    },
    {
        "source_sentence": "如前略存。",
        "translation": "It's as briefly described above.",
        "source": "T45n1892_001:0812b21_19"
    },
    {
        "source_sentence": "今明東夏創立戒壇之源。",
        "translation": "Now, we'll explain the source for setting up the precepts altar in Eastern Xia.",
        "source": "T45n1892_001:0812b21_20"
    },
    {
        "source_sentence": "《梁僧傳》云：「昔宋文帝元嘉七年，有罽賓國沙門求那跋摩者，梁曰功德鎧也。",
        "translation": "The Liang Siṃhala biographies of monks say: In the past, in the seventh year of Emperor Wen of the Song dynasty, there was the śramaṇa Guanavarman of Kaśmīra (known as “armor of",
        "source": "T45n1892_001:0812b21_21"
    },
    {
        "source_sentence": "越自南海，來達楊都，文帝禮異恒倫，號稱三藏，譯出經戒。",
        "translation": "From the Southern Ocean he came to the capital city of Yang, where Emperor Wen paid homage to the different people of the Ganges and called himself a Tripitaka Master who translated scriptures and precepts.",
        "source": "T45n1892_001:0812b23_22"
    },
    {
        "source_sentence": "甞遊南林寺，見竹樹扶疎，便有終焉之志。",
        "translation": "When he traveled to Nanyue Monastery and saw the bamboo tree in Fushou, he had an intention of dying.",
        "source": "T45n1892_001:0812b24_23"
    },
    {
        "source_sentence": "乃於寺前園中立戒壇，令受戒者登壇上而受也。",
        "translation": "He then set up a precepts altar in the garden in front of the monastery, causing those who had received the precepts to ascend onto the altar and receive them.",
        "source": "T45n1892_001:0812b25_24"
    },
    {
        "source_sentence": "人有疑其得道者，密以華布諸僧座下，唯跋摩所坐者，華更鮮榮。",
        "translation": "Some people doubted if he had attained enlightenment and secretly spread flowers under the seats of the assembled monks. The flowers grew even more fragrant when he was seated there.",
        "source": "T45n1892_001:0812b27_0"
    },
    {
        "source_sentence": "預知亡日，端拱而卒，手出遺文，云獲二果。",
        "translation": "Knowing the day of his demise, he died at the end of his life. The legacy written in his hand said that he had obtained two fruits.",
        "source": "T45n1892_001:0812b28_1"
    },
    {
        "source_sentence": "仍於戒壇上焚之，咸見一物，狀若龍蛇，衝煙上天。",
        "translation": "They all saw a single object, shaped like a dragon or snake, rushed up into the smoke and went up to heaven.",
        "source": "T45n1892_001:0812b29_2"
    },
    {
        "source_sentence": "「至元嘉十一年，有僧伽跋摩者，時號三藏法師，與前三藏同至楊都，",
        "translation": "In the eleventh year of the Zhi dynasty, there was a monk named Saṃghâvarman, at that time called the Master of the Tripitaka Master, who arrived in Yangdu together with the former masters of the Tripitaka.",
        "source": "T45n1892_001:0813b01_3"
    },
    {
        "source_sentence": "為諸僧尼等，於南林寺壇重受具戒。",
        "translation": "For the sake of the saṃgha and nuns, he repeatedly received the full set of precepts on the altar at Nanlin Temple.",
        "source": "T45n1892_001:0813b03_4"
    },
    {
        "source_sentence": "于時祇桓寺僧慧照等五十人，影福寺尼慧果等三百二十三人，同從重受。",
        "translation": "At that time there were fifty monks of Jīvain Temple, including Huizhao; three hundred and twenty-three nuns of Xiangfu Monastery, including Huiguo, all received the precepts from him.",
        "source": "T45n1892_001:0813b03_5"
    },
    {
        "source_sentence": "有慧義法師，稟性剛烈，不耐諠黷，謂三藏曰：『大法東流，傳道非一；",
        "translation": "There was the Master Huiyi, a man of noble character who was naturally bold and unforgiving. He said to the Tripitaka Masters, “The Mahadharma flowed eastward but the transmitted doctrine is not one and the",
        "source": "T45n1892_001:0813b05_6"
    },
    {
        "source_sentence": "先賢勝哲，共有常規；",
        "translation": "Former sages and philosophers were all well versed in the eternal discipline.",
        "source": "T45n1892_001:0813b07_7"
    },
    {
        "source_sentence": "豈獨改異，何穆眾望？』",
        "translation": "Isn't it the only thing that changes and dissimilarities, so why should we change the hopes of the crowd?'",
        "source": "T45n1892_001:0813b07_8"
    },
    {
        "source_sentence": "答曰：『五部之異，自此常理，相與棄俗，本為弘法，法必可傳，何忤眾情？』",
        "translation": "He answered, 'The difference between the five schools is that they are always principled and mutually exclusive, abandoning the secular world in order to promote the teachings and allowing the Dharma to be transmitted; why would they disobey the feelings of the people",
        "source": "T45n1892_001:0813b08_0"
    },
    {
        "source_sentence": "又問曰：『夫戒非可見之色也！",
        "translation": "Again, he asked, 'The precepts aren't visible form!'",
        "source": "T45n1892_001:0813b09_1"
    },
    {
        "source_sentence": "頃見重受戒者，或依舊臘次，或從後受為始，進退之間，足致深疑？』",
        "translation": "How often do you see someone who repeatedly receives the precepts, whether it's in the order of their old age or from a later time when they first receive them, and between advancement and retreat, which is enough to cause deep doubt?'",
        "source": "T45n1892_001:0813b10_2"
    },
    {
        "source_sentence": "答曰：『人有二種，故不一類。",
        "translation": "Answer: 'There are two kinds of people, so they aren't one and the same.",
        "source": "T45n1892_001:0813b11_3"
    },
    {
        "source_sentence": "若年歲不滿，胎月未充，則依今受為初。",
        "translation": "If the age is less than one years old and the moon of the embryo is not yet full, then relying on the present feeling is the first.",
        "source": "T45n1892_001:0813b12_4"
    },
    {
        "source_sentence": "若先年已滿，便入得戒之位；",
        "translation": "If the previous year has already passed, they will enter the state of acquisition of moral precepts.",
        "source": "T45n1892_001:0813b13_5"
    },
    {
        "source_sentence": "但疑先受有中下心，理須更求增勝而重受戒，即依本臘而永定也。』",
        "translation": "However, it's doubtful that there are middle and lower minds that were previously received, so the principle is to further seek superiority and repeatedly receive the precepts, which means to rely on the original year and be permanently fixed.'",
        "source": "T45n1892_001:0813b13_6"
    },
    {
        "source_sentence": "又問：『自誓不殺，身口已滿，有何不盡，更重受耶？』",
        "translation": "Again, he asked, 'I've vowed not to kill myself; my body and mouth have been fulfilled, so why isn't it exhausted and taken again?'",
        "source": "T45n1892_001:0813b15_7"
    },
    {
        "source_sentence": "答曰：『戒有九品，下為上因。",
        "translation": "Answer: 'There are nine classes of precepts, and the lower one is the higher cause.",
        "source": "T45n1892_001:0813b16_8"
    },
    {
        "source_sentence": "至於求者，心有優劣；",
        "translation": "As for those who seek, their minds have superiority and inferiority.",
        "source": "T45n1892_001:0813b17_9"
    },
    {
        "source_sentence": "所託緣起，亦自不同。",
        "translation": "The dependent origination that is relied upon is also different from itself.",
        "source": "T45n1892_001:0813b17_10"
    },
    {
        "source_sentence": "別受重發，有何障礙？",
        "translation": "What is the obstacle to the arising of a new mental state that is experienced separately?",
        "source": "T45n1892_001:0813b18_11"
    },
    {
        "source_sentence": "五戒、十戒，生亦各異，乃至道、定律儀，並防身、口；",
        "translation": "The five precepts and the ten precepts are also different from one another in their arising: up to the path, meditative absorption and restraint of restraint - all guarding body and speech.",
        "source": "T45n1892_001:0813b18_12"
    },
    {
        "source_sentence": "不同心業，有一無二也。』",
        "translation": "Unlike mental actions, there's one that's not two.'",
        "source": "T45n1892_001:0813b19_13"
    },
    {
        "source_sentence": "如是云云。",
        "translation": "Thus, it's said.",
        "source": "T45n1892_001:0813b20_14"
    },
    {
        "source_sentence": "又問：『三藏昔存之日，布薩僧事常在寺內；",
        "translation": "Again, he asked: In the past when the Tripitaka Master was alive, the affairs of the upāsaka and the Sangha were always kept within the monastery.",
        "source": "T45n1892_001:0813b20_15"
    },
    {
        "source_sentence": "及論受戒，何為獨出邑外等，咸是善法，何以異耶？』",
        "translation": "Why is it that they're all good qualities and why are they different from those who discuss accepting the precepts?'",
        "source": "T45n1892_001:0813b21_16"
    },
    {
        "source_sentence": "答：『諸部律制，互有通塞，唯受戒法重，不同餘事。",
        "translation": "Answer: The Vinayas and the Vinayas are said to be mutually exclusive. Only the acceptance of moral precepts is important, but it is different from other matters.",
        "source": "T45n1892_001:0813b22_17"
    },
    {
        "source_sentence": "以餘法不成，唯得小罪，罪可懺悔；",
        "translation": "Because the other offenses are not settled, only minor offenses can be confessed.",
        "source": "T45n1892_001:0813b23_18"
    },
    {
        "source_sentence": "夫紹隆佛種，用消信施，以戒為本，若不成就，非出家人。",
        "translation": "In order to preserve the seed of buddhahood, he uses relinquishment of faith and giving with morality as the root. If he has not done so, he is no longer a renunciant.",
        "source": "T45n1892_001:0813b24_19"
    },
    {
        "source_sentence": "障累之源，斷滅大法，故異餘者。』",
        "translation": "The source of the hindrances and accumulations is to eliminate the great teaching, so it's different from the others.'",
        "source": "T45n1892_001:0813b25_20"
    },
    {
        "source_sentence": "於是慧義欣然無言，遂令弟子慧基等渡蔡州岸，於船上受戒(云云)。」",
        "translation": "Huiyi then became delighted and didn't say anything, so he ordered his disciples, Huiqi and others, to cross the shore of Caizhou and receive the precepts on board the boat (as it was said).",
        "source": "T45n1892_001:0813b26_21"
    },
    {
        "source_sentence": "今通檢《別傳》諸記，南國諸方戒壇非一，宋都一壇如上已辨。",
        "translation": "Now, we'll examine the records of the separate biographies to see that the precepts altar in the southern countries and other directions aren't one and the same as the one altar in the Song dynasty, as explained above.",
        "source": "T45n1892_001:0813b27_22"
    },
    {
        "source_sentence": "東晉法汰，道安法師之同學也，生知天授，先於楊都瓦官寺立壇；",
        "translation": "Fatai of the Eastern Jin dynasty was a fellow student of the Master Dao’an. He was born in Zhitianjue and had previously set up an altar at Wauan Monastery in Yangdu.",
        "source": "T45n1892_001:0813b29_0"
    },
    {
        "source_sentence": "晉支道林於石城沷洲各立一壇；",
        "translation": "In the Jin dynasty an altar was erected at Shicheng Monastery in each of the two continents.",
        "source": "T45n1892_001:0814a01_1"
    },
    {
        "source_sentence": "晉支法存於若耶謝敷隱處立壇；",
        "translation": "In the Jin dynasty a Buddhist scripture was preserved and an altar was erected in a secluded place at Luoyang.",
        "source": "T45n1892_001:0814a02_2"
    },
    {
        "source_sentence": "竺道壹於洞庭山立壇；",
        "translation": "Zhu Daoyi erected an altar at Dongting Mountain.",
        "source": "T45n1892_001:0814a03_0"
    },
    {
        "source_sentence": "竺道生於吳中虎丘立壇；",
        "translation": "Zhu Daosheng erected an altar at Huqiu in Wu.",
        "source": "T45n1892_001:0814a03_1"
    },
    {
        "source_sentence": "宋智嚴於上定林寺立壇，宋慧觀於石梁寺立壇；",
        "translation": "Zhiyan of the Song dynasty erected an altar at Shangdinglin Monastery and Huiguan of the Song dynasty erected an altar at Shiliang Monastery.",
        "source": "T45n1892_001:0814a04_2"
    },
    {
        "source_sentence": "齊僧敷於蕪湖立壇；",
        "translation": "The assembled monks prepared an altar at Wuhu and set it up.",
        "source": "T45n1892_001:0814a05_3"
    },
    {
        "source_sentence": "梁法超於南澗立壇；",
        "translation": "Liang Fasheng erected an altar in the southern gorge.",
        "source": "T45n1892_001:0814a05_4"
    },
    {
        "source_sentence": "梁僧祐於上雲居、棲霞、歸善、愛敬四寺立壇；",
        "translation": "The Liang monk Sengyou erected an altar in the four temples of Shang Yunju, Qixia, Guishan, and Aijing.",
        "source": "T45n1892_001:0814a06_5"
    },
    {
        "source_sentence": "今荊州四層、長沙二寺剎基下，大明寺前湖中，並是戒壇。",
        "translation": "At present, under the foundations of the two temples at Changsha and Zhengshou in Jingzhou, there is a precept altar on the lake in front of Daming Monastery.",
        "source": "T45n1892_001:0814a07_6"
    },
    {
        "source_sentence": "以事覈論，自渝州已下，江淮之間，通計戒壇三百餘所；",
        "translation": "From Yuzhou downward and between the Jiang and Huai rivers there were more than three hundred ordination platforms.",
        "source": "T45n1892_001:0814a08_7"
    },
    {
        "source_sentence": "山東、河北、關內、劍南，事絕前聞，經傳不錄；",
        "translation": "In the eastern part of the mountain, in the northern part, in the western part, in the central part, and in the southern part of the empire (i.e., Kanyakubja) there is no record of such events as those mentioned above",
        "source": "T45n1892_001:0814a09_8"
    },
    {
        "source_sentence": "故使江表佛法，經今五六百年，曾不虧殄，由戒壇也！",
        "translation": "That's why the buddha-dharma of the envoy to the riverside has been present for 500 or 600 years now, and there's never been a deficiency, which is due to the altar of precepts!",
        "source": "T45n1892_001:0814a10_9"
    },
    {
        "source_sentence": "以戒為佛法之源，本立而不可傾也！",
        "translation": "Because the precepts are the source of the Buddha's teaching, they were originally established but can't be tilted!",
        "source": "T45n1892_001:0814a11_10"
    },
    {
        "source_sentence": "故使中原河之左右既不行之，由此佛法三被誅除，誠所宜也！",
        "translation": "That's why the two sides of the river in the middle plain won't practice it, so these three buddhas and dharmas will be expelled, which is really appropriate!",
        "source": "T45n1892_001:0814a12_11"
    },
    {
        "source_sentence": "又江漢之間，英靈間出，山川秀麗，見便忘返者，土地之使然也！",
        "translation": "Between the Jiang and Han Rivers, there are also brilliant spirits that emerge from each other. The mountains and rivers are so beautiful that when they see them one forgets to return; this is because of the natural beauty of the land.",
        "source": "T45n1892_001:0814a14_12"
    },
    {
        "source_sentence": "人依外報，故使外報既勝，內智亦奇，致諸賢達之士，通鑒輔臣，詳度佛教，",
        "translation": "Because people rely on external rewards, they make their external rewards superior and their internal knowledge also marvelous. As a result, the wise and learned men who are well versed in both Buddhist teachings and doctrine will be able to thoroughly discern",
        "source": "T45n1892_001:0814a15_13"
    },
    {
        "source_sentence": "深有可歸，必無敗壞之理也！",
        "translation": "There's a deep way to go, but there must be no principle of decay!",
        "source": "T45n1892_001:0814a17_14"
    },
    {
        "source_sentence": "可謂江漢滔滔，南國之紀事雖聞於往代，語迹見於今乎！",
        "translation": "It can be said that the rivers and Han Rivers are rushing, and even though we've heard about the history of the southern countries in past generations, we'll see the traces of their speech now!",
        "source": "T45n1892_001:0814a17_15"
    },
    {
        "source_sentence": "中原兩河晉氏南渡之後，分為一十六國；",
        "translation": "After the Jin dynasty crossed the two rivers of Central and Western plains to the south they were divided into sixteen states.",
        "source": "T45n1892_001:0814a19_16"
    },
    {
        "source_sentence": "以武猛相陵，佛法三除，並是獯鬻之胤；",
        "translation": "Because of the mutual convergence of war and vigorousness, the Buddhist doctrine and the Three Refuges are all the offspring of sexual misconduct.",
        "source": "T45n1892_001:0814a20_17"
    },
    {
        "source_sentence": "本非文國之後，隨心即斷，故其然乎！",
        "translation": "After the originally non-文國, it's stopped according to the mind, so why is it so?",
        "source": "T45n1892_001:0814a20_18"
    },
    {
        "source_sentence": "所以戒壇之舉，即住法之弘相也！",
        "translation": "That's why the raising of the precepts altar is the vast aspect of abiding in the Dharma!",
        "source": "T45n1892_001:0814a21_19"
    },
    {
        "source_sentence": "餘則略之(云云)。",
        "translation": "The rest are abbreviated (as it's said).",
        "source": "T45n1892_001:0814a22_20"
    },
    {
        "source_sentence": "《善見》云：「戒壇上不得立房，縱使王立，有慚比丘剔壞，餘材草送住寺比丘，",
        "translation": "The Shanjian jing (Samantabhadrasamskrta, T.1562:519b25–c10) says: A monk who is ashamed of his sins may not build a dwelling for the sake of the precepts on the al",
        "source": "T45n1892_001:0814a22_21"
    },
    {
        "source_sentence": "唯置佛殿及樹木也！」",
        "translation": "Only the Buddha's hall and the trees!",
        "source": "T45n1892_001:0814a24_22"
    },
    {
        "source_sentence": "據斯以言，明是法住之處，非人所宅(兩位別也)。",
        "translation": "According to this, it's said that this is the place where the Dharma lives and isn't a human dwelling place (the two are distinct).",
        "source": "T45n1892_001:0814a25_23"
    },
    {
        "source_sentence": "戒壇大界內外第五",
        "translation": "The precepts altar is the fifth inside and outside of the great realm.",
        "source": "T45n1892_001:0814a27_0"
    },
    {
        "source_sentence": "依《僧祇律》，戒場初立在大界外，後有過起，方徙於內。",
        "translation": "According to the Sāṃkhya vinaya, the precepts are first established outside the great boundary at the ordination hall and then moved inside when there's a mistake.",
        "source": "T45n1892_001:0814a28_0"
    },
    {
        "source_sentence": "《四分律》中，戒場在內，文云：「眾中四僧事起令眾疲極，佛令結戒場。」",
        "translation": "In the four parts of the Vinaya, the precepts site is inside, and the text says, The four saṃgha-works that arise in the congregation cause the congregation to become exhausted, and the Buddha causes them to form the precepts",
        "source": "T45n1892_001:0814a29_1"
    },
    {
        "source_sentence": "若在界外，本無所妨，何勞於眾？",
        "translation": "If he were outside the boundary, there wouldn't be any obstruction in the first place, so why bother the crowd?",
        "source": "T45n1892_001:0814b01_2"
    },
    {
        "source_sentence": "故知在內為定。",
        "translation": "Therefore, it's known that internal is concentration.",
        "source": "T45n1892_001:0814b02_3"
    },
    {
        "source_sentence": "然須辨了三相，決絕無疑。",
        "translation": "However, it's necessary to discern the three characteristics so that they can be resolved without doubt.",
        "source": "T45n1892_001:0814b02_4"
    },
    {
        "source_sentence": "妄指山石樹林垣牆崖坎，曾非目閱其分齊，隨語漫喚其東西。",
        "translation": "They falsely pointed to mountains, rocks, trees, forests, walls, cliffs, and canyons, but they never saw the distinctive characteristics of these caves.",
        "source": "T45n1892_001:0814b03_5"
    },
    {
        "source_sentence": "自唱尚迷，於他豈識，相從誦語，於事多昏。",
        "translation": "They sing themselves but are still confused, not knowing the others. Reciting from each other’s mouths, they often become confused with regard to matters.",
        "source": "T45n1892_001:0814b04_6"
    },
    {
        "source_sentence": "鈔疏極詳，臨機便用。",
        "translation": "The commentaries are so detailed that they can be used at the appropriate time.",
        "source": "T45n1892_001:0814b05_7"
    },
    {
        "source_sentence": "斯之惡習，並是舊迷，幸願改張，絕其常習；",
        "translation": "These bad habits are all old and misconstrued. It is fortunate that the Master wishes to change them so as to eliminate their regular habits.",
        "source": "T45n1892_001:0814b06_8"
    },
    {
        "source_sentence": "若不革者，今生既爾，後代亦然，何由可出？",
        "translation": "If someone doesn't change, then they'll be born in the present life, and so it will be likewise in future lives, so how can they leave?",
        "source": "T45n1892_001:0814b07_9"
    },
    {
        "source_sentence": "今依法結已，則四處集僧，各御眾法，都不相妨：一、戒場內集，二、場外四周空地集，",
        "translation": "Now, having bound them according to the Dharma, they gathered the saṃgha in four places, each controlling all the teachings without obstructing others: 1. at the ordination hall; 2. outside the ordination hall; 3. on the four sides of",
        "source": "T45n1892_001:0814b08_10"
    },
    {
        "source_sentence": "三、大界內如常僧集，四、大界外集。",
        "translation": "3. within the great realm, they are collected by the saṃgha as usual; 4. outside the great realm, they are collected.",
        "source": "T45n1892_001:0814b09_11"
    },
    {
        "source_sentence": "於四集中，二是作法界，二是自然界。",
        "translation": "In the four concentrations, there are two that create the Dharma realm and two that are natural realms.",
        "source": "T45n1892_001:0814b10_12"
    },
    {
        "source_sentence": "由界限約相，可隨方作業，並得成就。",
        "translation": "The spheres of action can be defined in terms of their characteristics, that is to say, they can arise and perish at the same time.",
        "source": "T45n1892_001:0814b11_13"
    },
    {
        "source_sentence": "以前識四界，限域灼然，故有四集，各不相攝。",
        "translation": "Because the four previously mentioned consciousnesses are concentrated in all four spheres, they do not belong to one or the other.",
        "source": "T45n1892_001:0814b12_14"
    },
    {
        "source_sentence": "言雖繁重，事則唯單，深可誡之。",
        "translation": "Although his words are numerous and difficult to understand, the matter is simple and can be deeply admonished.",
        "source": "T45n1892_001:0814b13_15"
    },
    {
        "source_sentence": "戒壇結法先後第六",
        "translation": "The precepts are preceded by the altar-seat formation, followed by the sixth.",
        "source": "T45n1892_001:0814b15_0"
    },
    {
        "source_sentence": "今見講解諸家，並依古疏，先結大界，却結戒場。",
        "translation": "Now, we see that the ancient commentaries of the expounding and understanding houses all rely on the ancient commentaries, which first concluded the great boundary but then closed the ordination hall.",
        "source": "T45n1892_001:0814b16_0"
    },
    {
        "source_sentence": "便云：「我依律文，先後如此。」",
        "translation": "He then said, I rely on the text of the vinaya, which is like this before and after.",
        "source": "T45n1892_001:0814b17_1"
    },
    {
        "source_sentence": "此不知教之次第也！",
        "translation": "This doesn't know the order of the teaching!",
        "source": "T45n1892_001:0814b17_2"
    },
    {
        "source_sentence": "原究律文，初大眾創集，莫識界之分齊；",
        "translation": "When the texts of the Vinaya were studied in China, they were compiled by the first assembly of Buddhist monks and there was no indication of their distinctive characteristics.",
        "source": "T45n1892_001:0814b18_3"
    },
    {
        "source_sentence": "故初約自然，次約大界；",
        "translation": "Therefore, the first one deals with matter by reason of its spontaneity; the second with matter by reason of its great extent.",
        "source": "T45n1892_001:0814b19_0"
    },
    {
        "source_sentence": "後為眾集法多，數數勞倦，故聽立戒場；",
        "translation": "Later, because the assembly was full of doctrine and they were repeatedly exhausted, they listened to the establishment of the terrace of precepts.",
        "source": "T45n1892_001:0814b19_1"
    },
    {
        "source_sentence": "是知事起先後，不言結法先後也！",
        "translation": "This is to know that things arise before and after, not to say that the fetters are prior and subsequent!",
        "source": "T45n1892_001:0814b20_2"
    },
    {
        "source_sentence": "何為妄執律文，橫生五過，佛有誠教，當隨義分。",
        "translation": "Why is it that the five faults of deluded attachment to the text of the vinaya are produced horizontally and vertically? The Buddha has a sincere teaching, so we should follow its meaning.",
        "source": "T45n1892_001:0814b21_3"
    },
    {
        "source_sentence": "今若先結大界，未分戒場，約何法制，以分兩界？",
        "translation": "Now, if we first form the great boundary and haven't yet divided the site of precepts, what method will we use to divide the two boundaries?",
        "source": "T45n1892_001:0814b22_4"
    },
    {
        "source_sentence": "雖預開空域，終是無法之地。",
        "translation": "Even though it forecloses the realm of emptiness, it's still a place where there's no dharma.",
        "source": "T45n1892_001:0814b23_5"
    },
    {
        "source_sentence": "故佛制戒場，先以法限，後圍空地，外以大界繞之，此則法法相隔，無錯涉之非也！",
        "translation": "That's why the Buddha established a site of precepts, which was first limited by the Dharma, then surrounded by an empty space and surrounded by a large boundary outside, where there's no mistake about being separated by the characteristics",
        "source": "T45n1892_001:0814b24_0"
    },
    {
        "source_sentence": "故《五分律》云：應「先結戒場，後結大界。」",
        "translation": "That's why the Five Part Vinaya says, You should first form the precepts site and then form the great boundary.",
        "source": "T45n1892_001:0814b25_1"
    },
    {
        "source_sentence": "若先結大界者，當捨已更前結之，然後唱相結大界也！",
        "translation": "If someone first forms the great boundary, they'll abandon it and form it beforehand, and then they'll form the great boundary by singing!",
        "source": "T45n1892_001:0814b26_2"
    },
    {
        "source_sentence": "《毘尼母》、《善見》二論，亦同《五分》先後之文。",
        "translation": "The two treatises, Vinaya Master and Good Vision, are the same as the preceding and following texts of the Five Parts.",
        "source": "T45n1892_001:0814b27_3"
    },
    {
        "source_sentence": "今猶有人，先結大界者，此不見諸部明文，直信意言，都不領解。",
        "translation": "Now, it's like someone who previously formed a great boundary and didn't see the explanations in the texts of the teachings here, but they simply believed their meaning and didn't understand them.",
        "source": "T45n1892_001:0814b28_4"
    },
    {
        "source_sentence": "《五百問》云：「先結大界，後結戒場者，如卑摩羅叉律師云：『於中受戒，",
        "translation": "The 500 Questions says, Those who first form the great boundary and then form the site of precepts are like the Vinaya master Pimalakas, saying, 'In this place you'll receive the precepts.",
        "source": "T45n1892_001:0814c01_5"
    },
    {
        "source_sentence": "恐無所獲。』",
        "translation": "I'm afraid there won't be anything to gain.'",
        "source": "T45n1892_001:0814c02_6"
    },
    {
        "source_sentence": "又卑公云：『若先不知，同於未制，賴有此路，則通僥倖。』」",
        "translation": "Again, Pūrṇa said, 'If you didn't know it before, it's the same as if you didn't regulate it, and if you rely on this path, then you'll be lucky.'",
        "source": "T45n1892_001:0814c02_7"
    },
    {
        "source_sentence": "斯言抑揚，成敗難惻，僥倖非分遇福之言，先結戒場，不虛功受，無疑於戒之有無也。",
        "translation": "When these words are suppressed, it's difficult to say whether they're accomplished or defeated, and there's no doubt that good fortune is not shared with those who speak fortunately. They first conclude the precepts before they're received",
        "source": "T45n1892_001:0814c04_8"
    },
    {
        "source_sentence": "覈論作法，備分三相：一、戒場外相，二、大界內相，三、大界外相。",
        "translation": "The disputed doctrine is divided into three aspects: 1. the external aspect of the precepts, 2. the internal aspect of the great realm, and 3. the external aspect of the great realm.",
        "source": "T45n1892_001:0814c05_9"
    },
    {
        "source_sentence": "此之三相並入羯磨立法之分齊也！",
        "translation": "These three characteristics are all part of the same set of rules for entering the karma-dharma!",
        "source": "T45n1892_001:0814c07_10"
    },
    {
        "source_sentence": "皆定其方維，刻其分齊，標、相、體別三位歷然。",
        "translation": "They all fixed their width and size, carved their distinctive parts, and engraved the names, marks, characteristics, and bodies in three ways.",
        "source": "T45n1892_001:0814c08_11"
    },
    {
        "source_sentence": "標則不定其內外，相則隨標而位立；",
        "translation": "The characteristic marks are unfixed within and without; the signs are established according to the marks in accordance with their position.",
        "source": "T45n1892_001:0814c09_12"
    },
    {
        "source_sentence": "及論界體，必在相內。",
        "translation": "The dharmas that are the objects of the Sūtra and the Abhidharma necessarily exist within the characteristic.",
        "source": "T45n1892_001:0814c09_13"
    },
    {
        "source_sentence": "先須考定，具識楷模，然後加結。",
        "translation": "You must first make a judgement and know the pattern, and then you must add it.",
        "source": "T45n1892_001:0814c10_14"
    },
    {
        "source_sentence": "言又繁重，誠舉多迷，《五百問》中：「受戒值天雨，若移戒場屋下者，",
        "translation": "The five hundred questions in the Sutra of the Five Hundred Questions say, Accepting the precepts is a heavenly rain; if you move it under the roof of your house at the ordination hall,",
        "source": "T45n1892_001:0814c11_15"
    },
    {
        "source_sentence": "先解大界，却結戒場，後結大界方得。」",
        "translation": "He first understands the great boundary, then he forms the precepts site, and only after forming the great boundary will he attain it.",
        "source": "T45n1892_001:0814c12_16"
    },
    {
        "source_sentence": "戒壇集僧遠近第七",
        "translation": "The precepts altar is the seventh, gathering the saṃgha from near and far.",
        "source": "T45n1892_001:0814c14_0"
    },
    {
        "source_sentence": "戒場為諸界之本也！",
        "translation": "The site of precepts is the foundation of all realms!",
        "source": "T45n1892_001:0814c15_0"
    },
    {
        "source_sentence": "先於自然集僧，僧有不集，結無成就；",
        "translation": "First, they naturally assemble the samgha. There are those who do not assembly and those who have not accomplished unification.",
        "source": "T45n1892_001:0814c15_1"
    },
    {
        "source_sentence": "故作法者初必審悉，於諸自然界中，子細窮考；",
        "translation": "That is why the practitioner of the doctrine first must thoroughly investigate, examining in detail all the natural worlds.",
        "source": "T45n1892_001:0814c16_2"
    },
    {
        "source_sentence": "有僧普集，不得受欲。",
        "translation": "If there are saṃgha who gather all together, they won't be allowed to experience desire.",
        "source": "T45n1892_001:0814c17_3"
    },
    {
        "source_sentence": "事雖麁現，臨事多迷，遺略不集，僧便別眾。",
        "translation": "Although the monks were present, they were often confused when it came to business. The monastery was neglected and the monks were soon separated from the assembly.",
        "source": "T45n1892_001:0814c17_4"
    },
    {
        "source_sentence": "結既不成，妄稱有界，盡於來際於中受法，徒枉自他虛行一代。",
        "translation": "Since the fetters aren't formed, they falsely claim to have bounds, accepting the teaching at all times in the future, and vainly practicing themselves and others in vain for a generation.",
        "source": "T45n1892_001:0814c18_5"
    },
    {
        "source_sentence": "豈唯此生，來報果集，還遇無界而受具足，可不然耶！",
        "translation": "Wouldn't it be the case that this birth is the only one that comes to retribution and fruition, returns to the sphere of nothingness, and receives its fulfillment? That's not true!",
        "source": "T45n1892_001:0814c20_6"
    },
    {
        "source_sentence": "今欲行事，並約標界。",
        "translation": "Now, I want to do so, but they're all limited to the boundary.",
        "source": "T45n1892_001:0814c21_7"
    },
    {
        "source_sentence": "戒場大小從界者，多由場小於自然，故約自然而集；",
        "translation": "“The size of the precepts-exchange is from one boundary to another”: Mostly, it is because the site is smaller than what is natural. Therefore, it is assemblied in relation to nature.",
        "source": "T45n1892_001:0814c21_8"
    },
    {
        "source_sentence": "三唱外相，白二結之。",
        "translation": "The third is to sing the external characteristics, and the white one concludes with two.",
        "source": "T45n1892_001:0814c23_9"
    },
    {
        "source_sentence": "次結大界時，引五六比丘出場外空地，入大界體中，依界標集僧；",
        "translation": "Next, when the great boundary was formed, five or six bhikṣus were induced to go outward into the open space. They entered the body of the great boundary and collected the sangha according to the [three] bo",
        "source": "T45n1892_001:0814c23_10"
    },
    {
        "source_sentence": "三唱大界內外相，白二結已。",
        "translation": "Third, he calls out the inner and outer characteristics of the great realm, and then he explains the two fetters.",
        "source": "T45n1892_001:0814c25_11"
    },
    {
        "source_sentence": "至明日先解大界，次解戒場，還如前結。",
        "translation": "On the next day, he first untied the great boundary, then untied the precepts site, and returned as before.",
        "source": "T45n1892_001:0814c25_12"
    },
    {
        "source_sentence": "集僧遠近，楷定如前。",
        "translation": "The assembled monks, both near and far, followed the same pattern as before.",
        "source": "T45n1892_001:0814c26_13"
    },
    {
        "source_sentence": "此更須審悉，一定之後，盡於來際未須解。",
        "translation": "This also needs to be examined, for it's certain that there won't be a time when he doesn't need to understand.",
        "source": "T45n1892_001:0814c27_14"
    },
    {
        "source_sentence": "故比人行事不行重解、重結之法；",
        "translation": "That is why they do not practice the doctrine of double understanding and double-barredness in comparison with people.",
        "source": "T45n1892_001:0814c28_0"
    },
    {
        "source_sentence": "西梵現行此事，以初結界已，惡鬼被圍不得出界，極苦惱故，佛令為解，",
        "translation": "When the god Brahmā of the West was practicing this practice, when the first boundary had been crossed, bad spirits were besieged and unable to leave the [three] boundary. Because of their extreme pain and vexation",
        "source": "T45n1892_001:0814c28_1"
    },
    {
        "source_sentence": "使其得出，重更加結。",
        "translation": "It causes them to escape and creates further bonds.",
        "source": "T45n1892_001:0815a01_2"
    },
    {
        "source_sentence": "以如法故，善神方集，故使律中界內有鬼神廟屋。",
        "translation": "Because it's according to the teaching, good spirits are only gathered here, so they cause ghosts and shrines to live inside the boundary of the precepts.",
        "source": "T45n1892_001:0815a01_3"
    },
    {
        "source_sentence": "《五分》云：「結界通取聚落，護諸俗人，不為非人所惱等。」",
        "translation": "The Five Parts of the Vinaya says, The boundary is shared with a village that protects laypeople and doesn't be harmed by non-people.",
        "source": "T45n1892_001:0815a02_4"
    },
    {
        "source_sentence": "其事符同(云云)。",
        "translation": "It's the same thing as that (as it says).",
        "source": "T45n1892_001:0815a04_5"
    },
    {
        "source_sentence": "戒壇作業成敗第八(此篇機要，成敗一時)成敗之相，其用在人，人兼明昧，",
        "translation": "The eighth [factor] is the formation and decay of the ordination altar's work (this chapter on the essentials, which are one time for formation and one time for decay.) The characteristic of formation and decay depends on",
        "source": "T45n1892_001:0815a05_0"
    },
    {
        "source_sentence": "故事涉興毀。",
        "translation": "The story involves rise and fall.",
        "source": "T45n1892_001:0815a06_1"
    },
    {
        "source_sentence": "是以謹慎之士，不自師心。",
        "translation": "That's why a person who's cautious doesn't follow the teacher's mind.",
        "source": "T45n1892_001:0815a07_0"
    },
    {
        "source_sentence": "雖於戒相分明，不妨臨用迷忘，是以律文統約，有陵犯處，並開迷忘。",
        "translation": "Even though the characteristics of the precepts are clearly delineated, it's better to be confused and forgetful when approaching them. That's why the text of the vinaya is so unified that there's a place where violations occur",
        "source": "T45n1892_001:0815a07_1"
    },
    {
        "source_sentence": "至於結界持護，必須是非通顯，若疑、若誤，捨而重加，豈非敬慎之至極也！",
        "translation": "As for the maintenance of the boundary, it must be expressed in terms of right and wrong, and if there's doubt or error, it should be relinquished and reinforced, isn't that the ultimate form of respect and caution?",
        "source": "T45n1892_001:0815a09_2"
    },
    {
        "source_sentence": "今行事者率多輕略，不審界之遠近，莫顯僧之別同，欺罔佛法，妄稱僧傑；",
        "translation": "Now the officials of the assembly are mostly light-minded and lax, not knowing the boundary or the distance between the two. They do not show distinctions among the different sects of the sangha but instead deceive the Buddha’s teaching",
        "source": "T45n1892_001:0815a10_3"
    },
    {
        "source_sentence": "誦文不識綱目，目覩不識是非，飾詐抱迷，輒興搆結。",
        "translation": "They don't know the title of the recitation, don't know the outline, don't know what's right and wrong with their eyes, adorn themselves with fraudulence and delusion, and so they often give rise to bonds.",
        "source": "T45n1892_001:0815a12_4"
    },
    {
        "source_sentence": "今略示數相以顯是非：一、約相集僧，則識僧之真偽，一一人中以五十餘法簡定之；",
        "translation": "Now we will briefly show the characteristics of the saṃgha in order to indicate what is right and wrong. First, when one collects the Sangha according to its characteristics, he discerns the real and false nature of the sangha. In each person",
        "source": "T45n1892_001:0815a13_5"
    },
    {
        "source_sentence": "不入簡者不足稱僧，則非作法之匠也！",
        "translation": "Those who don't enter simplicity aren't enough to call themselves monks, and they aren't the maker of the teaching!",
        "source": "T45n1892_001:0815a15_6"
    },
    {
        "source_sentence": "簡法如律鈔中。",
        "translation": "It's a summary of the teaching as described in the commentary on the Vinaya.",
        "source": "T45n1892_001:0815a16_7"
    },
    {
        "source_sentence": "二、依相三唱，必審標、相分齊，尺寸灼然，入則有足數別眾之儀，出則非二相之攝也。",
        "translation": "Second, the three calls that rely on characteristics must be carefully labeled and distinguished by characteristics, which are distinct in size and clarity, so that entry has a sufficient number of distinctive rituals for the congregation, and exit is not",
        "source": "T45n1892_001:0815a16_8"
    },
    {
        "source_sentence": "今時往往有結二界，不集相外之僧，直將五六人往場相地而結者；",
        "translation": "At the present time, often there are those who have formed the two kinds of fetters. They do not gather monks outside the [three] signs but simply lead five or six members of the sangha to the place where they form the fetters",
        "source": "T45n1892_001:0815a18_9"
    },
    {
        "source_sentence": "或於場內通唱二界三相已，具加二界羯磨者；",
        "translation": "Some of the bhikṣus may recite the two realms and three characteristics within the assembly, together with the addition of the kalpa for the two realms.",
        "source": "T45n1892_001:0815a20_10"
    },
    {
        "source_sentence": "或有場內通唱二界相已，隨界而結者；",
        "translation": "“Some people in the assembly hall sing the characteristics of the two realms together, forming fetters according to the [three] realms.",
        "source": "T45n1892_001:0815a21_11"
    },
    {
        "source_sentence": "或於大界內不入場中，遙唱場相而結者。",
        "translation": "Or, if someone doesn't enter within the great realm, they'll sing the characteristics of the hall from a distance and form a bond.",
        "source": "T45n1892_001:0815a22_12"
    },
    {
        "source_sentence": "如《五分》中：「不唱方相，不成結界。」",
        "translation": "As in the Five Parts, it says, They don't sing directional signs and don't form boundaries.",
        "source": "T45n1892_001:0815a23_13"
    },
    {
        "source_sentence": "今隔界虛唱，全非正法；",
        "translation": "This is not the true doctrine at all.",
        "source": "T45n1892_001:0815a23_14"
    },
    {
        "source_sentence": "唱不明了，不知分齊，咸名不唱，界結不成，如是類知，並是約界分齊之是非也！",
        "translation": "The singing doesn't understand it, doesn't know the distinction, calls it not singing, and doesn't form the boundary, so this kind of knowing is right or wrong according to the distinction in terms of the boundary!",
        "source": "T45n1892_001:0815a24_15"
    },
    {
        "source_sentence": "然大界、戒場並須成就，事不獲已，大界不成，乍可以無界之場得受戒也？",
        "translation": "However, the great realm and the site of precepts must both be accomplished, and if something isn't obtained, then the great realm won't be accomplished, so you can first receive the precepts at the site without a realm?",
        "source": "T45n1892_001:0815a26_16"
    },
    {
        "source_sentence": "戒場不成，大界雖成，終是無法之地，何有得行法事！",
        "translation": "If the precepts site isn't established, then even though the great realm is established, it's ultimately a place where there's no dharma practice, so how could there be acquisition and practice?",
        "source": "T45n1892_001:0815a27_17"
    },
    {
        "source_sentence": "故勤勤作業，戒場為初，必須依法取成，不得依俙作法，朦朧謂是。",
        "translation": "Therefore, the precepts are the first to be practiced with diligence. They must be taken according to the Dharma and accomplished according to the Dharma. They cannot rely on debauchery as a method of action.",
        "source": "T45n1892_001:0815a28_18"
    },
    {
        "source_sentence": "僧曰知法之人，可不思之！",
        "translation": "The saṃgha said, Those who know the Dharma shouldn't think about it!",
        "source": "T45n1892_001:0815b01_19"
    },
    {
        "source_sentence": "取名棄實，言又繁矣，臨事多惑，老叟重言，固其宜也！",
        "translation": "It's certainly appropriate for an old man to take the name and discard the real, but his words are so numerous that he's often confused when confronted with questions.",
        "source": "T45n1892_001:0815b02_0"
    },
    {
        "source_sentence": "三、明事義，即結界也。",
        "translation": "3. It explains the meaning of phenomena, which are the boundary.",
        "source": "T45n1892_001:0815b03_1"
    },
    {
        "source_sentence": "界有大小之差，地分內外之別，先須曉了，後方就法。",
        "translation": "The boundary has differences in size, and the land is distinguished internally and externally. One must first understand it clearly before one can do so.",
        "source": "T45n1892_001:0815b03_2"
    },
    {
        "source_sentence": "四、謂作業，即羯磨也。",
        "translation": "4. It's called karma, which is the karma.",
        "source": "T45n1892_001:0815b04_3"
    },
    {
        "source_sentence": "不但一僧獨誦，並須通眾具解，有不解者，非足非別；",
        "translation": "Not only does one a sect of the sangha recite it alone, but also all those who do not understand it need to be fully liberated. Those who are not liberated are neither sufficient nor distinct.",
        "source": "T45n1892_001:0815b05_4"
    },
    {
        "source_sentence": "以闇昧者，莫知和忍之緣，孰識同別之相，故非二攝，不集非咎。",
        "translation": "It's because it's so dark that they don't know the conditions for harmony and forbearance, and who knows the distinctive characteristics of sameness and distinction, so they aren't included in two, and non-gather",
        "source": "T45n1892_001:0815b06_5"
    },
    {
        "source_sentence": "作業成敗，必約四緣，謂僧界事法，如上備列。",
        "translation": "The formation and decay of the action necessarily have four conditions:",
        "source": "T45n1892_001:0815b07_6"
    },
    {
        "source_sentence": "持律之士，務學在斯，闇此四緣，不足登壇位也！",
        "translation": "Those who uphold the precepts are there to study, but if they don't understand these four conditions, it's not enough to ascend the altar!",
        "source": "T45n1892_001:0815b08_7"
    },
    {
        "source_sentence": "故《十誦》云：「作羯磨者應分別云：是白、是第一羯磨、第二羯磨、第三羯磨；",
        "translation": "That is why the Ten Recitations says: Those who perform the ordination should make a distinction, saying: This is confession; this is the first ordination; this is the second ordination; this is the third ordination.",
        "source": "T45n1892_001:0815b09_8"
    },
    {
        "source_sentence": "如是分別。",
        "translation": "They are thus discriminated.",
        "source": "T45n1892_001:0815b11_9"
    },
    {
        "source_sentence": "其聽作者，莫餘覺、餘思惟，應心心相憶，念此白、此羯磨；",
        "translation": "The author of the discourse should neither perceive nor think about anything else. He should remember this explanation and this ordination with his mind, thinking to himself:",
        "source": "T45n1892_001:0815b11_10"
    },
    {
        "source_sentence": "如是分明。」",
        "translation": "Thus, it's clearly explained.",
        "source": "T45n1892_001:0815b13_0"
    },
    {
        "source_sentence": "故佛世執法，猶行五非，豈是不學無知人耶？",
        "translation": "That's why the Buddha world clings to the teaching and still practices the five negative qualities, isn't it because he's a learned person who doesn't know?",
        "source": "T45n1892_001:0815b13_1"
    },
    {
        "source_sentence": "臨機心境迷忘故也！",
        "translation": "It's because they're facing the mind and objects of opportunity and are deluded!",
        "source": "T45n1892_001:0815b14_2"
    },
    {
        "source_sentence": "戒壇受時儀軌第九",
        "translation": "Ritual Procedure for the Acceptance of the Precepts at the Altar of Morality, Part 9",
        "source": "T45n1892_001:0815b15_0"
    },
    {
        "source_sentence": "夫立非常之相，以顯非常之法，法即戒也。",
        "translation": "It establishes the characteristic of impermanence in order to show impermanent dharmas, which are the precepts.",
        "source": "T45n1892_001:0815b16_0"
    },
    {
        "source_sentence": "戒為出道之基，定非入俗之致。",
        "translation": "The precepts are the foundation for leaving the path, and concentration isn't the cause for entering the secular.",
        "source": "T45n1892_001:0815b16_1"
    },
    {
        "source_sentence": "律云：「所以立戒學者，為除三毒令盡故。」",
        "translation": "The Vinaya says, That's why they establish the precepts for scholars in order to remove the three poisons and make them end.",
        "source": "T45n1892_001:0815b17_2"
    },
    {
        "source_sentence": "所以立非常壇相，以動恒俗之情也！",
        "translation": "That's why the characteristic of the eternal altar is established, because it moves the constant and mundane feelings!",
        "source": "T45n1892_001:0815b18_3"
    },
    {
        "source_sentence": "今不行壇事，隨緣而受，則心志蒼茫，如顯如晦，何能發法界之律儀？",
        "translation": "Now, if you don't practice the altar service and receive it according to conditions, then your mind is so open-minded that it's as apparent as obscure, how can you give rise to the restraints of the Dharma realm?",
        "source": "T45n1892_001:0815b19_4"
    },
    {
        "source_sentence": "定獲無記之虛福也！",
        "translation": "They'll surely attain indeterminate false merit!",
        "source": "T45n1892_001:0815b20_5"
    },
    {
        "source_sentence": "故論云：「欲受戒者，先於有智人所，令於萬境上起慈護心而發戒也！」",
        "translation": "That's why the treatise says, Those who want to receive the precepts should first give rise to the precepts in the presence of a wise person and cause them to become compassionate and protective with respect to all things!",
        "source": "T45n1892_001:0815b21_6"
    },
    {
        "source_sentence": "今不存此，臨集僧訖，正行事時，但云：「汝發上品心得上品戒。」",
        "translation": "Now, I won't keep this, but when I'm about to assemble the saṃgha and correctly perform my duties, I simply say, You must give rise to the higher-quality mind that understands the higher-quality precepts.",
        "source": "T45n1892_001:0815b22_7"
    },
    {
        "source_sentence": "沙彌素無識性，教授曾未討論，空雷發於上天，絕雨流於下地。",
        "translation": "The śrāmaṇer always lacked consciousness, and his teachings had never discussed it.",
        "source": "T45n1892_001:0815b24_8"
    },
    {
        "source_sentence": "故博考眾說，立斯軌儀，非出師心，並從聖授。",
        "translation": "That's why they studied extensively the teachings of the assembly, establishing these rules and regulations that don't transcend the teacher's mind and are all given by the noble ones.",
        "source": "T45n1892_001:0815b25_9"
    },
    {
        "source_sentence": "今末學者經傳罕聞，鏗執生常，驚怪斯作，復何可怪？",
        "translation": "At the present time it has not been heard of in the scriptures and biographies of Buddhist scholars, who hold to the view that life is eternal. They are surprised at this phenomenon but why should they wonder about it?",
        "source": "T45n1892_001:0815b26_10"
    },
    {
        "source_sentence": "並由耳目之所不該，足趾之所不蹈；",
        "translation": "It is because they do not belong to the organs of hearing, sight, and touch. They do not belong to the feet or the legs.",
        "source": "T45n1892_001:0815b27_11"
    },
    {
        "source_sentence": "若曾該蹈，復是生常之恒法，統而括之，可以論廣也！",
        "translation": "If someone has ever done so, they're also the eternal dharmas of birth and permanence, which are unified and included, so we can discuss them in detail!",
        "source": "T45n1892_001:0815b28_12"
    },
    {
        "source_sentence": "登壇授受十師行事相(比來行事，無法自居，隨人立用，無可師範。",
        "translation": "He ascends to the altar and receives the ten rules of conduct from the ten masters (There are no rules of conduct that can be practiced by a monk who doesn't live on his own, but he establishes them according to people; there's",
        "source": "T45n1892_001:0815b29_13"
    },
    {
        "source_sentence": "今採摭幽顯及以所傳，登降壇場，興發景仰，如俗行禮，每事問之，可不慎與！",
        "translation": "Now, we're collecting the secrets and what's transmitted, ascending and descending to the altar site, producing a view of veneration that's like layman's conduct and rituals, and we shouldn't give it",
        "source": "T45n1892_001:0815c01_14"
    },
    {
        "source_sentence": ")余見行事，叢雜交謬，和上二師纔有相狀，自餘尊證都無異倫。",
        "translation": ") I've seen that the two masters of Vaiśravaṇa and Vātsīputrīya only have characteristics, and the other honored ones realize that there's no difference between them.",
        "source": "T45n1892_001:0815c02_15"
    },
    {
        "source_sentence": "原夫證師證戒功用，則三師一同。",
        "translation": "Originally, when the realization teacher realizes the function of realizing the precepts, the three teachers are one and the same.",
        "source": "T45n1892_001:0815c04_0"
    },
    {
        "source_sentence": "三師各有行事，證成由十師得，遂有初戒。",
        "translation": "Each of the three masters has its own practice, which is realized by the ten masters who attain it, and so there's the first precept.",
        "source": "T45n1892_001:0815c04_1"
    },
    {
        "source_sentence": "列坐昏若海遊，高視而望眾儀，遠聽而詳羯磨，乃有一乞、三乞、唱乞。",
        "translation": "The rows of monks sat in the darkness and wandered about like an ocean, looking up high at the congregation to see what they should do. They listened from a distance and performed detailed rituals; there was one request, three requests,",
        "source": "T45n1892_001:0815c05_2"
    },
    {
        "source_sentence": "三一不分、一白三說錯脫，曾無指斥，俛首送默，是非俱顯，默然端坐表和，",
        "translation": "The three and one are not separated, the one white, and the three explanations of error and liberation have never been refuted. [The Buddha] greeted them with a bow and remained silent. Whatever he said was right or wrong, they all",
        "source": "T45n1892_001:0815c07_3"
    },
    {
        "source_sentence": "同別咸言和合。",
        "translation": "They're all said to be united in terms of sameness and difference.",
        "source": "T45n1892_001:0815c08_4"
    },
    {
        "source_sentence": "若斯御眾，誠在三師，有見非違，即須彈舉，無宜妄稱大物，是非不撓其心乎！",
        "translation": "If the king's people really believe in the three masters, and there are views that aren't contradictory, they must snap it up; it's not advisable to falsely claim great things, so why wouldn't their minds be disturbed",
        "source": "T45n1892_001:0815c09_5"
    },
    {
        "source_sentence": "確須七證卓明，何勞更繁隨喜，故中土受戒，止須十人登壇，諸餘隨助，",
        "translation": "I am certain that seven kinds of proof are necessary to make the blameworthiness clear. Why would there be any need for further exaggeration or rejoicing? Therefore, when one receives the precepts in the Middle Kingdom, only ten",
        "source": "T45n1892_001:0815c10_6"
    },
    {
        "source_sentence": "浪僧臨時，下層亦有，故於儀首，重而列之(不妨新受戒者，神爽明白，",
        "translation": "The waves of the monks and nuns are temporary, but there are also those at the lower level. Therefore, the rules of etiquette are arranged in an orderly fashion (it may be better to row them one after another for newly ordained",
        "source": "T45n1892_001:0815c12_7"
    },
    {
        "source_sentence": "作業有功，七證心昏，情思魯塞，故約此二不得頓除故也)。",
        "translation": "Because actions have merit, the seven realizations of mind are obscured by feelings and thoughts, so according to these two, they can't be removed suddenly.)",
        "source": "T45n1892_001:0815c13_8"
    },
    {
        "source_sentence": "初十師登壇相，其教授阿闍梨當執香爐前引，從南面下層東階道，接足而上至層上，",
        "translation": "When the first group of ten masters ascended to the altar, the instructional preceptor took the censer in front of him and led them from the lower level east staircase on the south side with his feet joining it up to the higher level.",
        "source": "T45n1892_001:0815c14_9"
    },
    {
        "source_sentence": "東出北迴，繞壇一匝；",
        "translation": "He emerged from the east and circled to the north, circumambulating the altar once.",
        "source": "T45n1892_001:0815c16_10"
    },
    {
        "source_sentence": "上座在西頭，當佛前禮三拜；",
        "translation": "The supreme seat was at the western end. He greeted the Buddha three times in front of him.",
        "source": "T45n1892_001:0815c16_11"
    },
    {
        "source_sentence": "十師卓立，具修威儀，廣運心想，請十方現在諸佛、諸大菩薩、聲聞僧眾，",
        "translation": "The ten masters stood upright and, having perfected their deportment, they extensively carried out the thought of enlightenment. They invited the buddhas, great bodhisattvas, and śrāvakas present in the ten directions to",
        "source": "T45n1892_001:0815c17_12"
    },
    {
        "source_sentence": "普會戒壇；",
        "translation": "They assembled at the ordination platform.",
        "source": "T45n1892_001:0815c18_13"
    },
    {
        "source_sentence": "天龍八部遍滿虛空。",
        "translation": "The gods, dragons, and the eightfold assembly filled space.",
        "source": "T45n1892_001:0815c19_14"
    },
    {
        "source_sentence": "以佛在時，多行受戒，咸陞壇上，雖非羯磨僧數而行，善來戒法亦同具戒。",
        "translation": "It's because when the Buddha was present, he often practiced and received the precepts, and they were all raised to the altar, even though they weren't practiced by the number of karma monks, and the well-coming precepts",
        "source": "T45n1892_001:0815c19_15"
    },
    {
        "source_sentence": "佛滅度後，行事聖僧羅列佛像，擬佛在時故也！",
        "translation": "After the parinirvāṇa of the Buddha, he performed a ritual for the holy saṃgha to line up an image of the Buddha, which was intended to be done at the right time!",
        "source": "T45n1892_001:0815c21_16"
    },
    {
        "source_sentence": "亦使僧法有依，非佛不可，故置靈儀，不徒設也！",
        "translation": "Also, because the saṃgha's teaching has support, it's not possible for a buddha to do so, so he sets his spiritual rituals, not just setting them up!",
        "source": "T45n1892_001:0815c22_17"
    },
    {
        "source_sentence": "第二重壇上西行，南頭置一高座，次設三虛座：一擬豆田邪菩薩比丘，",
        "translation": "On the second story of the altar, proceeding westward on the southern end, he placed a high seat at the southern end and next set up three false seats:",
        "source": "T45n1892_001:0815c23_18"
    },
    {
        "source_sentence": "二擬樓至菩薩比丘，三擬馬闌邪菩薩比丘；",
        "translation": "The second was a bhikṣu of the bodhisattva community who wished to build a pavilion, and the third was a bhikṣu of the bodhisattva community who wished to build a horse chariot.",
        "source": "T45n1892_001:0815c25_19"
    },
    {
        "source_sentence": "以三菩薩比丘請佛立受戒結戒戒壇之首，於戒有功，故列三虛座以處之。",
        "translation": "Because the three bodhisattvas and monks invited the Buddha to establish the head of the precepts altar for the observance of the precepts, the three empty seats were listed to place them because they had merit in the precepts.",
        "source": "T45n1892_001:0815c26_20"
    },
    {
        "source_sentence": "十師運想已，教授師執爐，引眾面西却行，取上層西階道，接足上壇頂；",
        "translation": "When the ten masters had completed their thoughts, the instructional master took the censer and led the assembly to the west. He took the path leading up to the western terrace on the top of the altar with his feet touching it.",
        "source": "T45n1892_001:0815c27_21"
    },
    {
        "source_sentence": "東轉北迴，繞佛一匝已，至三空座前，一一禮已，依次而坐。",
        "translation": "After circumambulating the Buddha one turn to the east and one turn to the north, he reached the front of the three hollow seats. Having venerated them one by one, he took his seat in order.",
        "source": "T45n1892_001:0815c29_22"
    },
    {
        "source_sentence": "其高座者，先差一僧令陞座已，誦《遺教經》；",
        "translation": "The high seat had previously sent a monk to the throne and, having been ordered to ascend it, recited the Ancient Teachings Sutra.",
        "source": "T45n1892_001:0816a01_23"
    },
    {
        "source_sentence": "此時應打犍稚，多燒名香，讚唄功德；",
        "translation": "At that time you should beat the gandhi and burn a great deal of famous incense, praising the virtues of your songs.",
        "source": "T45n1892_001:0816a02_24"
    },
    {
        "source_sentence": "所集之僧，無問大小戒，普至以聽《遺教》。",
        "translation": "The assembled monks, regardless of their size and precepts, went everywhere to listen to the Bequeathed Teachings.",
        "source": "T45n1892_001:0816a03_25"
    },
    {
        "source_sentence": "於上下二層依位坐已，令維那引欲受戒者，至南面東階道下，面西而立；",
        "translation": "After he sat in the upper and lower levels of the monastery according to his seat, they caused Vairocana, leading those who wished to receive the precepts, to stand at the foot of the east-east staircase on the southern",
        "source": "T45n1892_001:0816a04_26"
    },
    {
        "source_sentence": "威儀教授師從南面東階却下，引向西階道上，至下層上便東迴北轉西出；",
        "translation": "From the east staircase on the south side, the teacher Weiyi withdrew to the west staircase and went up the path leading to the west staircase. When he came to the bottom of the storey, he cycled eastwards and northwards",
        "source": "T45n1892_001:0816a06_0"
    },
    {
        "source_sentence": "又東面北作行，禮佛三拜已，互跪聽經訖；",
        "translation": "Again, facing east and facing north, they made obeisance to the Buddha. After venerating him three times, they knelt on their faces and listened to each other’s recitation of the scripture.",
        "source": "T45n1892_001:0816a07_1"
    },
    {
        "source_sentence": "維那又引至南面東階，却行而下，出界外行立。",
        "translation": "Vairocana again led the way to the east staircase on the southern side of the boundary, where he withdrew and went down.",
        "source": "T45n1892_001:0816a08_2"
    },
    {
        "source_sentence": "若未解威儀折旋俯仰者，令知法維那一一指授，庠序弘緩，引而行之。",
        "translation": "If someone doesn't understand the restraints of deportment, he causes them to know that Favina teaches them one by one, and they go about it in an orderly and slow way.",
        "source": "T45n1892_001:0816a09_3"
    },
    {
        "source_sentence": "及問難之時，維那一一引至戒場內，當東階南設席，擬問遮難。",
        "translation": "When he asked about the difficulty, Vairocana led them one by one to the ordination hall and set up a seat southeast of the east staircase to ask about the difficulty.",
        "source": "T45n1892_001:0816a11_4"
    },
    {
        "source_sentence": "其受具者至於席側，執衣鉢當東階面北而立；",
        "translation": "When the receiver of the requisites arrived at the side of the seat, he stood facing north on the east staircase with his robe and bowl in hand.",
        "source": "T45n1892_001:0816a12_5"
    },
    {
        "source_sentence": "教授師從南面東階却下，具修威儀，令眾可觀。",
        "translation": "The teacher of the philosophers descended from the east staircase to the south and cultivated proper manners so that the monks might be able to see.",
        "source": "T45n1892_001:0816a13_6"
    },
    {
        "source_sentence": "故律中執持威儀，不失法度，如頞鞞比丘以威儀而伏邪道，故知威儀肅物，",
        "translation": "Therefore, in the Vinaya, they adhere to deportment and don't lose the perfection of the Dharma. It's like a coarse monk who uses deportment to subdue wrong paths, so he knows that deportment is",
        "source": "T45n1892_001:0816a14_7"
    },
    {
        "source_sentence": "來自久矣！",
        "translation": "It's been a long time since then!",
        "source": "T45n1892_001:0816a16_8"
    },
    {
        "source_sentence": "彼至問席所敷座坐已，仍取受人衣鉢訖，令其脫屣上席；",
        "translation": "When he arrived, he asked where the seat was arranged. Having sat there, he took his robes and almsbowl and ordered them to be taken up onto the upper seat.",
        "source": "T45n1892_001:0816a16_9"
    },
    {
        "source_sentence": "先取尼師壇，為受持已，令在上坐；",
        "translation": "He first took the nun’s altar and, having preserved it, caused her to be seated there.",
        "source": "T45n1892_001:0816a18_10"
    },
    {
        "source_sentence": "又取安多會，為受持已，令在身著；",
        "translation": "He also took the anutta assembly and, having accepted and preserved it, caused it to be placed in his body.",
        "source": "T45n1892_001:0816a18_11"
    },
    {
        "source_sentence": "次取欝多羅僧，為受持已，令於上披；",
        "translation": "Next, he takes the sandalwood and, having accepted and preserved it, causes it to be draped over him.",
        "source": "T45n1892_001:0816a19_12"
    },
    {
        "source_sentence": "又取僧伽梨，為受持已，如前幞之。",
        "translation": "He also takes the saṃghāṭi and accepts it as before to preserve it.",
        "source": "T45n1892_001:0816a20_13"
    },
    {
        "source_sentence": "教彼人云：「此三衣名，唯佛法有，九十六種外道所無，何得不敬？",
        "translation": "He instructed them, saying, These three garments are named only the names of the Buddha's teachings, which are absent in ninety-six kinds of non-Buddhist dharmas, so how could they not be respected?",
        "source": "T45n1892_001:0816a21_14"
    },
    {
        "source_sentence": "故坐具尼師壇，如塔之有基也；",
        "translation": "The old nun’s seat and altar are like the foundation of a stūpa.",
        "source": "T45n1892_001:0816a22_15"
    },
    {
        "source_sentence": "汝今受戒即五分法身之基也，良以五分由戒而成；",
        "translation": "You now receive the precepts, which are the foundation of the five-part dharma body. It is good that the five parts are formed from the precepts.",
        "source": "T45n1892_001:0816a23_16"
    },
    {
        "source_sentence": "若無坐具而坐汝身，則五分定慧無所從生，故坐具如塔之基也！",
        "translation": "If you sit on your body without a seat, then the five parts of concentration and wisdom don't arise from anything, so the seat is like the foundation of a stūpa!",
        "source": "T45n1892_001:0816a24_17"
    },
    {
        "source_sentence": "三衣斷三毒也：五條下衣斷貪身也、七條中衣斷瞋口也、大衣上衣斷癡心也！」",
        "translation": "The three kinds of clothing cut off the three poisons: five pieces of undergarment cut off the body of craving, seven pieces of undergarment cut off anger, and large robes and upper garments cut off deluded thoughts!",
        "source": "T45n1892_001:0816a26_18"
    },
    {
        "source_sentence": "如是廣之，隨時說導。",
        "translation": "Thus, it's explained in detail and guided at any time.",
        "source": "T45n1892_001:0816a27_19"
    },
    {
        "source_sentence": "問難遮訖。",
        "translation": "The question is about the difficulty of refuting it.",
        "source": "T45n1892_001:0816a28_20"
    },
    {
        "source_sentence": "此受持衣，諸部並在問難前，今時在受戒後，無文可出，不足行用。",
        "translation": "These are the robes for accepting the precepts, which are worn by all the different sects before the difficult question is asked, but there's no text that can be removed after accepting the precepts now, so it's not enough to",
        "source": "T45n1892_001:0816a28_21"
    },
    {
        "source_sentence": "彼教授師如常威儀，從下層東階上，至層上西迴；",
        "translation": "The teacher of the instruction followed the usual manner, going from the lower storeys to the eastern storeys and up to the upper storeys in a circular motion westward.",
        "source": "T45n1892_001:0816b01_22"
    },
    {
        "source_sentence": "至第二層南面西階上，向東迴；",
        "translation": "At the second storey, on the southern and western staircases facing southeast, he turned eastward.",
        "source": "T45n1892_001:0816b02_23"
    },
    {
        "source_sentence": "當佛前禮三拜已；",
        "translation": "You should pay homage to the Buddha in front of him three times.",
        "source": "T45n1892_001:0816b02_24"
    },
    {
        "source_sentence": "東轉北迴，至羯磨師前，相去舒手及處立。",
        "translation": "Turning east and turning north, he went to the front of the karma master, left him, spread his hands together, and stood there.",
        "source": "T45n1892_001:0816b03_25"
    },
    {
        "source_sentence": "作白召已，至南面西階上召之。",
        "translation": "After making the announcement, he went up to the west staircase on the south side and summoned him.",
        "source": "T45n1892_001:0816b04_26"
    },
    {
        "source_sentence": "依師召而上，便引欲受戒者，向三上座坐處禮已，次又一一禮十師竟，",
        "translation": "Relying on the teacher's summons, he went up and led those who wanted to receive the precepts to the seat of the three superior monks. After venerating them there, he bowed one after the other to each of the ten masters.",
        "source": "T45n1892_001:0816b05_0"
    },
    {
        "source_sentence": "威儀師令於羯磨師前互跪教乞戒。",
        "translation": "The master of deportment ordered them to kneel down in front of the master of karma and teach each other the begging precepts.",
        "source": "T45n1892_001:0816b06_1"
    },
    {
        "source_sentence": "彼復座已，羯磨師依法單白，問難已，和僧羯磨與受戒竟，令於十師下互跪，",
        "translation": "After he returned to his seat, the karma master gave a plain explanation in accordance with the Dharma. After having asked the bhikṣus about their difficulties, the reconciled monks and those who had undertaken the precepts were ordered to kneel",
        "source": "T45n1892_001:0816b07_2"
    },
    {
        "source_sentence": "諸受具人總了，一時就佛前面北，互跪更聽《遺教》而立住；",
        "translation": "The people who had received the ordination were all settled, and at once they went to the north in front of the Buddha. Kneeling down on their knees one after the other, they listened to the Exposition o flegacy scripture and stood there",
        "source": "T45n1892_001:0816b09_3"
    },
    {
        "source_sentence": "其教授師執香爐起，至西面北階頭立，引十師下階，循下層上面南出東迴面北，",
        "translation": "The teacher of the philosophers rose from his seat, holding a censer in his hand, and stood at the top of the north staircase on the west side. He led the ten masters up the staircase to the bottom of the staircase, proceeding south",
        "source": "T45n1892_001:0816b10_4"
    },
    {
        "source_sentence": "當佛像前禮三拜立住；",
        "translation": "He should bow in front of the Buddha’s image and remain standing there three times.",
        "source": "T45n1892_001:0816b12_5"
    },
    {
        "source_sentence": "維那又引新受戒人從東面南階却下至地，北出繞壇迴至南面下層西階下，",
        "translation": "Vairocana again led the newly ordained monk down the south staircase from the east face to the ground. He came out of the north, circumambulated the altar, and returned to the bottom of the south-facing storey at the bottom of",
        "source": "T45n1892_001:0816b12_6"
    },
    {
        "source_sentence": "東迴面北禮佛竟立住。",
        "translation": "He turned east, faced north, bowed to the Buddha, and remained standing.",
        "source": "T45n1892_001:0816b14_7"
    },
    {
        "source_sentence": "師僧見新受戒者來，便從下層東階下南出，雁行相待於華林間；",
        "translation": "Seeing the newly ordained bhikṣus coming, the teachers and monks emerged south from the east staircase at the bottom of the lower storey. The geese were walking among themselves in the middle of the lotus grove.",
        "source": "T45n1892_001:0816b15_8"
    },
    {
        "source_sentence": "新受戒者從後而行，至場地林間，方令受戒者在前。",
        "translation": "Those who had newly received the precepts traveled from one place after the other and arrived at the forest, where they were told to be in front of them.",
        "source": "T45n1892_001:0816b16_9"
    },
    {
        "source_sentence": "教授師引十師出場門入大界，如常所止。",
        "translation": "The teacher of the philosophers led the ten masters to enter the great realm through the entrance, just as they always did.",
        "source": "T45n1892_001:0816b17_10"
    },
    {
        "source_sentence": "此之威儀，聖所行法，法隱既久，執生常者，謂是新儀，幸詳之也！",
        "translation": "This is a new etiquette, and it's fortunate that it's the method practiced by the noble ones. Since the Dharma has been hidden for a long time, those who cling to permanence say it's a new etiquette!",
        "source": "T45n1892_001:0816b18_11"
    },
    {
        "source_sentence": "余以乾封二年二月八日及以夏初，既立戒壇，仍依法載受具戒。",
        "translation": "I established the ordination platform on the eighth day of the second month in the second year of my reign and at the beginning of the summer, but still carried the full set of precepts according to the law.",
        "source": "T45n1892_001:0816b20_12"
    },
    {
        "source_sentence": "于時前後預受者二十七人，並多是諸方，謂雍州、洛州、虢州、蒲州、晉州、貝州、丹州、坊州、隴州、澧州、荊州、台州、并州，",
        "translation": "At that time there were twenty-seven attendants, all from various regions: Yongzhou, Luozhou, Shanzhou, Puzhou, Jinzhou, Baizhou, Danzhou, Fangzhou, Longzhou, Lizhou, Jingzhou, Taizhou, and",
        "source": "T45n1892_001:0816b21_13"
    },
    {
        "source_sentence": "如是等州，依壇受具；",
        "translation": "Such states as these receive the ordination requisites by relying on their altars.",
        "source": "T45n1892_001:0816b24_14"
    },
    {
        "source_sentence": "故引大略，知非謬緣。",
        "translation": "That's why it's cited as a summary, knowing that it's not a mistaken condition.",
        "source": "T45n1892_001:0816b24_15"
    },
    {
        "source_sentence": "諸有同法之儔、遊方之士，聞余創建，興心嚮赴者，略列名位，取信於後。",
        "translation": "If there are people who share the same doctrine and those who travel in different directions who hear my teaching and give rise to aspirations for enlightenment, I will list their names and ranks briefly so that they may gain faith later.",
        "source": "T45n1892_001:0816b25_0"
    },
    {
        "source_sentence": "終南山雲居寺大德僧伽禪師",
        "translation": "Seon Master Saṃgha, a great virtuous monk of Yunjuji Temple on Mount Zhenan",
        "source": "T45n1892_001:0816b27_0"
    },
    {
        "source_sentence": "京師西明寺大德真懿律師",
        "translation": "Jingshi ximing si dade zhenyi lushi",
        "source": "T45n1892_001:0816b28_0"
    },
    {
        "source_sentence": "京師弘法寺大德恒善律師",
        "translation": "Jingshi Hongfa si dade hengshan lushi",
        "source": "T45n1892_001:0816b29_0"
    },
    {
        "source_sentence": "終南山雲際寺大德悟玄律師",
        "translation": "Lawyer Wu Xuan, a great virtuous monk of Yunji Temple in Zhenanangnan",
        "source": "T45n1892_001:0816c01_0"
    },
    {
        "source_sentence": "京師西明寺大德薄塵法師",
        "translation": "Jōshi Ximingji Daide Bojin fashi",
        "source": "T45n1892_001:0816c02_0"
    },
    {
        "source_sentence": "京師大慈恩寺大德弘度律師",
        "translation": "Layman Hongdao, a great virtuous monk of Daciun Temple in the capital",
        "source": "T45n1892_001:0816c03_0"
    },
    {
        "source_sentence": "昭陵瑤臺寺大德道誠律師",
        "translation": "solicitor Daozheng, a great virtuous monk of Yaotai Temple in Zhaoling",
        "source": "T45n1892_001:0816c04_0"
    },
    {
        "source_sentence": "終南山龍池寺智善律師",
        "translation": "Zhixian Lushi of Longji Temple in Shan, Jōnan",
        "source": "T45n1892_001:0816c05_0"
    },
    {
        "source_sentence": "京師光明寺新羅國智仁律師",
        "translation": "Jingshi guangmingming si xinluo guo zhixin lushi",
        "source": "T45n1892_001:0816c06_0"
    },
    {
        "source_sentence": "華州西嶽沙門法藏禪師",
        "translation": "Seon Master Fazang, a monk named Xieyue of Huazhou",
        "source": "T45n1892_001:0816c07_0"
    },
    {
        "source_sentence": "終南山寶德寺道光律師",
        "translation": "Lawyer Dao Guang of the Jeweled Temple on Mount Zhongnan",
        "source": "T45n1892_001:0816c08_0"
    },
    {
        "source_sentence": "荊州長沙寺智藏律師",
        "translation": "Zhizang Lushi of Changsha Temple in Jingzhou",
        "source": "T45n1892_001:0816c09_0"
    },
    {
        "source_sentence": "荊州景元山無行禪師",
        "translation": "Wuxing Chan Master of Jingyuan Shan in Jingzhou",
        "source": "T45n1892_001:0816c10_0"
    },
    {
        "source_sentence": "荊州覆船山玉泉寺弘景律師",
        "translation": "Hongjing Lushi of Yuquan Temple on Mount Xuefeng in Jingzhou",
        "source": "T45n1892_001:0816c11_0"
    },
    {
        "source_sentence": "并州六通寺智琮禪師",
        "translation": "Zen Master Zhixi Cong of the Six通ji Temple in Bingzhou",
        "source": "T45n1892_001:0816c12_0"
    },
    {
        "source_sentence": "潤州明慶寺玄寂律師",
        "translation": "Vinaya Master Xuanji of Mingqing Temple in Runzhou",
        "source": "T45n1892_001:0816c13_0"
    },
    {
        "source_sentence": "衡州南嶽雲峰寺義本律師",
        "translation": "Yuben Lushi of Yunfeng Temple in Nanyue, Hengzhou",
        "source": "T45n1892_001:0816c14_0"
    },
    {
        "source_sentence": "洋州儻城寺道寂律師",
        "translation": "Daoji, Vinaya Master of Yongzhou's Zhixiang Temple",
        "source": "T45n1892_001:0816c15_0"
    },
    {
        "source_sentence": "荊州天王寺道譽法師",
        "translation": "Daoye Fashi of Tianwangsi Temple in Jingzhou",
        "source": "T45n1892_001:0816c16_0"
    },
    {
        "source_sentence": "荊州四層寺智璿禪師",
        "translation": "Chan Master Zhixi of the Four-Storey Temple in Jingzhou",
        "source": "T45n1892_001:0816c17_0"
    },
    {
        "source_sentence": "京師西明寺大慈律師",
        "translation": "Great Compassionate Lawyer of Ximingsi Temple in the capital",
        "source": "T45n1892_001:0816c18_0"
    },
    {
        "source_sentence": "京師西明寺四依律師",
        "translation": "Shiyi Lushi of Ximingsi Temple in the capital",
        "source": "T45n1892_001:0816c19_0"
    },
    {
        "source_sentence": "齊州東嶽沙門明藏禪師",
        "translation": "Seon Master Mingzang, the monk of Donggye in Qizhou",
        "source": "T45n1892_001:0816c20_0"
    },
    {
        "source_sentence": "荊州安寶寺慧忍禪師",
        "translation": "Chan Master Hui忍 of Anbao Temple in Jingzhou",
        "source": "T45n1892_001:0816c21_0"
    },
    {
        "source_sentence": "荊州善集寺道恪禪師",
        "translation": "Seon Master Dao Ke of Shanji Temple in Jingzhou",
        "source": "T45n1892_001:0816c22_0"
    },
    {
        "source_sentence": "台州天台山白巖寺慧莊禪師",
        "translation": "Chan Master Huizhuang of Baiyan Temple on Mount Tiantai in Taizhou",
        "source": "T45n1892_001:0816c23_0"
    },
    {
        "source_sentence": "襄州峴山報善寺慧璿律師",
        "translation": "Xiangzhou's Vinaya Master Huixuan of Xiaoshan's Buddhist Temple in Xiangzhou",
        "source": "T45n1892_001:0816c24_0"
    },
    {
        "source_sentence": "荊州昇覺寺慧璉禪師",
        "translation": "Chan Master Huili of Shangjue Temple in Jingzhou",
        "source": "T45n1892_001:0816c25_0"
    },
    {
        "source_sentence": "荊州開聖寺慧儼禪師",
        "translation": "Chan Master Huijian of Kaisheng Temple in Jingzhou",
        "source": "T45n1892_001:0816c26_0"
    },
    {
        "source_sentence": "荊州陟屺寺慧獎法師",
        "translation": "Dharma Master Huishou of Chekhyun Temple in Jingzhou",
        "source": "T45n1892_001:0816c27_0"
    },
    {
        "source_sentence": "荊州無量寺玄賾法師",
        "translation": "Xuan Yuan Fashi of Wuwei Temple in Jingzhou",
        "source": "T45n1892_001:0816c28_0"
    },
    {
        "source_sentence": "洛州天宮寺守節法師",
        "translation": "Dharma Master Shoushi of Tiangongsi Temple in Luozhou",
        "source": "T45n1892_001:0816c29_0"
    },
    {
        "source_sentence": "晉州沙門曇獎法師",
        "translation": "Dharma Master Tanshou, the ascetic of Jinzhou",
        "source": "T45n1892_001:0817a01_0"
    },
    {
        "source_sentence": "東嶽沙門名恪律師",
        "translation": "Dongyue ascetic Ming Ke Lushi",
        "source": "T45n1892_001:0817a02_0"
    },
    {
        "source_sentence": "京師空觀寺行滔禪師",
        "translation": "Seon Master Xingzhao of Konguan Temple in the capital",
        "source": "T45n1892_001:0817a03_0"
    },
    {
        "source_sentence": "秦州麥積崖沙門法度禪師",
        "translation": "Meditation Master Dharmadatta, a monk of the Qinzhou prefecture named Meghiyaiishi",
        "source": "T45n1892_001:0817a04_0"
    },
    {
        "source_sentence": "虢州大興國寺義方律師",
        "translation": "Jifang Lushi of Daxing國寺 in Shanzhou",
        "source": "T45n1892_001:0817a05_0"
    },
    {
        "source_sentence": "荊州長沙寺德行律師",
        "translation": "Vinaya Master Dexing of Changsha Temple in Jingzhou",
        "source": "T45n1892_001:0817a06_0"
    },
    {
        "source_sentence": "京師弘濟寺懷素律師",
        "translation": "Jingshi Hongji si Huaisu lushi",
        "source": "T45n1892_001:0817a07_0"
    },
    {
        "source_sentence": "自外不備列名。",
        "translation": "They aren't listed by name from the outside.",
        "source": "T45n1892_001:0817a08_0"
    },
    {
        "source_sentence": "至如終南山大翠微寺等諸沙門，及巖隱野居追朋問道之賓，翕習容裔，",
        "translation": "As for the other śramaṇas and brāhmaṇas of the Great Cuiwei Monastery on Mount Zhongnan, as well as those who lived in seclusion in the wilderness to pursue their friends and ask questions about the Way, they all",
        "source": "T45n1892_001:0817a08_1"
    },
    {
        "source_sentence": "整帶而赴，高壇觀行，禮度折旋，而鑒其敬仰者，或在空外界中，送心隨喜，",
        "translation": "He walked up and down the high altar to pay his respects, bowing in reverence. Some of them were evenly arrayed in the sky or on the moonlightlessness of space, sending their spirits off with joy.",
        "source": "T45n1892_001:0817a10_0"
    },
    {
        "source_sentence": "佇立合掌，而欣其威儀者，將有百計。",
        "translation": "There were about a hundred people standing with joined palms who admired his manner.",
        "source": "T45n1892_001:0817a11_1"
    },
    {
        "source_sentence": "行事既了，維那引至僧住堂中，列坐飯之。",
        "translation": "After they had finished their business, Vairocana led them to the hall where the monks were living and fed them with food in rows.",
        "source": "T45n1892_001:0817a12_2"
    },
    {
        "source_sentence": "諸有清信士女，崇扈之鄉，來者滿院，皆合掌隨喜，立而稱善，亦一塗之造化也，",
        "translation": "All the laymen and women of pure faith, who revered their homeland, came to the monastery. They joined their palms together in joy, stood upright, praised themselves as good, and were likewise adorned with a single coat of",
        "source": "T45n1892_001:0817a13_3"
    },
    {
        "source_sentence": "追萬古之清塵焉！",
        "translation": "He's pursuing the pure dust of myriad ages!",
        "source": "T45n1892_001:0817a15_4"
    },
    {
        "source_sentence": "戒壇功能遠近第十",
        "translation": "Tenth, the function of the precepts altar is distant and near.",
        "source": "T45n1892_001:0817a16_0"
    },
    {
        "source_sentence": "案結界之地也，隨其限域，下至金剛之輪，雖經劫壞，終焉莫毀。",
        "translation": "It is also the place where the boundary of the empire was demarcated, so as to follow the limits of its territory and go down to the diamond wheel. Even if it were to pass through a kalpa of calamity they would not destroy",
        "source": "T45n1892_001:0817a17_0"
    },
    {
        "source_sentence": "如諸論說，佛法將滅，結界法失；",
        "translation": "As the treatises say, “When the Buddha-dharma is about to perish, there will be a failure of the dharmas that form the boundary.",
        "source": "T45n1892_001:0817a18_1"
    },
    {
        "source_sentence": "有論者言，先結不失，後結不成，斯為定義。",
        "translation": "Some commentators say that the first fetter is not lost, and the second fetter is not settled. This is their definition.",
        "source": "T45n1892_001:0817a19_2"
    },
    {
        "source_sentence": "今案諸傳說，天竺印度咸有聖蹤，並經多劫，於今見在。",
        "translation": "According to various traditions, there are holy traces in India and India; they have been preserved here for many kalpas.",
        "source": "T45n1892_001:0817a20_3"
    },
    {
        "source_sentence": "至如八字捨身之事，子女流血之徵，破骨出髓之苦相，布髮掩泥之遺緒，",
        "translation": "It's like the eight-syllable act of abandoning one's body, the sign of a child bleeding blood, the painful appearance of breaking bones and discharging marrow, and the legacy of covering mud.",
        "source": "T45n1892_001:0817a21_4"
    },
    {
        "source_sentence": "端然布設，開迹如初；",
        "translation": "The traces of the monastery’s rebirth are as they were at the beginning.",
        "source": "T45n1892_001:0817a23_0"
    },
    {
        "source_sentence": "以此往徵，界結非沒。",
        "translation": "Because of these past signs, the boundaries and fetters aren't disappeared.",
        "source": "T45n1892_001:0817a23_1"
    },
    {
        "source_sentence": "印度諸師，相從二釋。",
        "translation": "The Indian scholars follow two interpretations.",
        "source": "T45n1892_001:0817a23_2"
    },
    {
        "source_sentence": "初言結界聖相並是神功，災劫焚漂斯為俗有，俗非壞道之法，故道法恒存，",
        "translation": "The first is that the sacred characteristics of the boundary and the holy characteristics are combined as supernatural powers. Disasters, calamities, kalpas, fires, and floods constitute worldly existences. Being",
        "source": "T45n1892_001:0817a24_3"
    },
    {
        "source_sentence": "致使前相於今不絕。",
        "translation": "As a result, the former marks won't be cut off in the present.",
        "source": "T45n1892_001:0817a26_4"
    },
    {
        "source_sentence": "有論師言：「斯是佛之化迹，所在弘利終期不灰。」",
        "translation": "Some commentators said, This is the trace of the Buddha's transformation, and where he was staying, Hongli didn't die.",
        "source": "T45n1892_001:0817a26_5"
    },
    {
        "source_sentence": "所以三災起時，淪亡從於大地，為空、為水，蹤緒罕尋；",
        "translation": "For this reason, when the three calamities occur, they are born and perish from the earth. Their origins are neither in space nor water but rarely found anywhere.",
        "source": "T45n1892_001:0817a27_6"
    },
    {
        "source_sentence": "世界後成，所有故處還依舊立，故此聖迹儼然如初，不足怪也！",
        "translation": "After the world has been formed, the old places where it used to be are still standing; so this holy site remains as it was at the beginning, no wonder!",
        "source": "T45n1892_001:0817a28_7"
    },
    {
        "source_sentence": "如彼色、欲二界，咸化為空，後成立時，如前置立。",
        "translation": "Just as the two realms of form and of sexual passion are all converted into emptiness. When they are subsequently established, they are as before:",
        "source": "T45n1892_001:0817b01_8"
    },
    {
        "source_sentence": "眾生業力一不思議，佛之流化二不思議，豈以凡謀奪于聖慮，故結界堅住，",
        "translation": "The karmic power of sentient beings is one inconceivable, and the Buddha’s apparitional forces are two inconceivable. Isnt it because ordinary people plot to steal holy thought that they form a boundary and a",
        "source": "T45n1892_001:0817b02_9"
    },
    {
        "source_sentence": "必無所損。",
        "translation": "There must be nothing to lose.",
        "source": "T45n1892_001:0817b04_10"
    },
    {
        "source_sentence": "問曰：「若如所述，賢劫四佛，咸有舊蹤，立寺結界，僧之常法，今時立相，",
        "translation": "Q: As you said, the four past buddhas of the good eon all had ancient traces of their existence. They established temples and boundaries for the monastic community as a regularity; but now they have different characteristics.",
        "source": "T45n1892_001:0817b04_11"
    },
    {
        "source_sentence": "豈不與舊界相重？",
        "translation": "Isn't it the same as the characteristic of the old realm?",
        "source": "T45n1892_001:0817b05_12"
    },
    {
        "source_sentence": "重結不成，作法敗矣！",
        "translation": "The heavy fetters won't be formed, and the created dharma will be destroyed!",
        "source": "T45n1892_001:0817b06_13"
    },
    {
        "source_sentence": "如何釋之？」",
        "translation": "How can we explain it?",
        "source": "T45n1892_001:0817b06_14"
    },
    {
        "source_sentence": "答曰：「隨一佛化，一佛之僧，何有能仁之子，與飲光為資乎！",
        "translation": "He replied, If there's a single Buddha who teaches, how could there be a son of the saṃgha of a single Buddha who can be benevolent and provide for him with drinking light?",
        "source": "T45n1892_001:0817b06_15"
    },
    {
        "source_sentence": "各師所師，故非別眾。",
        "translation": "Each teacher teaches what he teaches, so it's not a separate group.",
        "source": "T45n1892_001:0817b08_16"
    },
    {
        "source_sentence": "即如釋尊一代，僧具六和，一見不和，兩不足數，各結各部，類例見聞，",
        "translation": "That is to say, just as in the case of the venerable Śākya[muni]. In one dynasty there were six harmonious councils within the Sangha but one view was not harmonious with the other and two did not add up to the number of members",
        "source": "T45n1892_001:0817b08_17"
    },
    {
        "source_sentence": "故知前佛之僧界，不妨後佛之行事也！」",
        "translation": "Therefore, it's better to know the saṃgha realm of the former Buddha than the actions of the latter Buddha!",
        "source": "T45n1892_001:0817b10_18"
    },
    {
        "source_sentence": "故律鈔中，五種互結，各不相妨也！",
        "translation": "That's why the five kinds of mutual binding in the commentary on the Vinaya are not mutually exclusive!",
        "source": "T45n1892_001:0817b11_19"
    },
    {
        "source_sentence": "然前佛之遺基，後佛皆就而興起也，如舍衛祇桓之地，九十一劫常為佛遊，",
        "translation": "In the land of Śrāvastī, for ninety-one world ages he always stayed at Sāvatthī.",
        "source": "T45n1892_001:0817b11_20"
    },
    {
        "source_sentence": "身子覩蟻窟而興悲，事可知也！",
        "translation": "The body of the lion's son lies in the ant-cave and becomes compassionate, which is understandable!",
        "source": "T45n1892_001:0817b13_21"
    },
    {
        "source_sentence": "自餘更有，辭繁且略。",
        "translation": "The rest are different, but the explanations are extensive and brief.",
        "source": "T45n1892_001:0817b14_22"
    },
    {
        "source_sentence": "戒壇贊述辨德第十一",
        "translation": "The Eleventh Chapter of the Commentary on the Precepts-Altar Explanation of the Destinies",
        "source": "T45n1892_001:0817b15_0"
    },
    {
        "source_sentence": "開壤創築戒場之壇文",
        "translation": "An altar text that opens the soil and creates a place of precepts.",
        "source": "T45n1892_001:0817b16_0"
    },
    {
        "source_sentence": "維唐乾封二年仲春八日，京師西明寺沙門釋道宣，乃與宇內嶽瀆諸州沙門，",
        "translation": "On the eighth day in the second month in the second year of the Qianfeng period (557 C.E. ) of the Wei dynasty, the monk Shi Daoxuan of Ximingsi Monastery at the capital and the other monks of the",
        "source": "T45n1892_001:0817b17_0"
    },
    {
        "source_sentence": "商較律儀，討擊機務，敢於京南遠郊澧福二水之陰，鄉曰清官，里稱遵善，",
        "translation": "In the southern outskirts of the capital city, at the foothills of the two rivers Lifu and Lifu in the distant suburbs, the village was called Qinguan (Qinguan) and the people there respected it as a good place to",
        "source": "T45n1892_001:0817b18_1"
    },
    {
        "source_sentence": "持律眾所建立戒壇。",
        "translation": "The precepts altar is established by the observant of the precepts.",
        "source": "T45n1892_001:0817b20_2"
    },
    {
        "source_sentence": "原夫戒定慧法，眾聖之良筌；",
        "translation": "The Dharma of morality, meditation, and wisdom is a good example for the saints.",
        "source": "T45n1892_001:0817b20_3"
    },
    {
        "source_sentence": "攝律善生，三佛之津導。",
        "translation": "Good sentient beings who collect the precepts are the guides of the three buddhas.",
        "source": "T45n1892_001:0817b21_4"
    },
    {
        "source_sentence": "是知戒為入聖之本，為出俗之基；",
        "translation": "They know that morality is the root of entry into the holy, and that it is the foundation for leaving the world.",
        "source": "T45n1892_001:0817b22_5"
    },
    {
        "source_sentence": "皇覺寄此而開權，正法由茲而久住。",
        "translation": "Empress Enlightenment sent it here to enlighten, and the right Dharma abided there for a long time.",
        "source": "T45n1892_001:0817b22_6"
    },
    {
        "source_sentence": "所以四依御宇，必祖戒而啟蒙泉；",
        "translation": "That is why the fourth relies upon the imperial palace and must rely on the precepts of the ancestors in order to inspire enlightenment.",
        "source": "T45n1892_001:0817b23_7"
    },
    {
        "source_sentence": "五乘方駕，亦因戒而張化首。",
        "translation": "The five vehicles are driven only by the precepts, and they also open their transformation heads because of the precepts.",
        "source": "T45n1892_001:0817b24_8"
    },
    {
        "source_sentence": "自法流東漸，居七百年，戒場之壇，名實乖爽，律、論所顯，場、壇兩馳，",
        "translation": "In the course of going eastward from the stream of the doctrine, he stayed there for seven hundred years. The name of the altar at the terrace of precepts is really different from that of the ordination altar. It is indicated in",
        "source": "T45n1892_001:0817b25_9"
    },
    {
        "source_sentence": "各備機緣，隨事便舉。",
        "translation": "Each is provided with an opportunity, and they are cited according to the situation.",
        "source": "T45n1892_001:0817b26_10"
    },
    {
        "source_sentence": "有晉揚輦南林戒壇，德鎧聖士厥初基搆，中原正偽，蔑爾無聞，有以大界為戒場，",
        "translation": "In the Jin dynasty there was a monastic altar of precepts in the southern forest of Yan Monastery, built by virtuous sages and saints. The original foundation of this altar was laid at the place where the holy man",
        "source": "T45n1892_001:0817b27_11"
    },
    {
        "source_sentence": "有以平場為壇上。",
        "translation": "There are those who make a level place for the altar.",
        "source": "T45n1892_001:0817b28_12"
    },
    {
        "source_sentence": "斯由法被三廢，後興在於覊縻；",
        "translation": "As a result, the doctrine has been abandoned in three ways and is enshrined later in debate.",
        "source": "T45n1892_001:0817b29_13"
    },
    {
        "source_sentence": "或由師心獨斷，討論絕於經教。",
        "translation": "Perhaps it's because the teacher's mind is cut off by itself, and discussions are cut off from the sūtras and teachings.",
        "source": "T45n1892_001:0817c01_0"
    },
    {
        "source_sentence": "若夫創置戒壇，專弘戒本，良由律儀所攝，用統有、空；",
        "translation": "If one sets up an altar of precepts and focuses on the propagation of the book of precepts, it is because they are included in the Vinaya disciplines that they govern existence and emptiness.",
        "source": "T45n1892_001:0817c01_1"
    },
    {
        "source_sentence": "約情充仞於大千，論法該通於六位；",
        "translation": "In terms of feelings, they fill a great chiliocosm and discuss doctrine that extends to the six states.",
        "source": "T45n1892_001:0817c02_2"
    },
    {
        "source_sentence": "陰、入、界、處，莫匪戒緣；",
        "translation": "The aggregates, the sense-fields, the sense-fields and the sense-fields do not have precepts as objects.",
        "source": "T45n1892_001:0817c03_3"
    },
    {
        "source_sentence": "上聖下凡，咸資戒護。",
        "translation": "The highest sages and the lowest worldlings all contribute to protecting the precepts.",
        "source": "T45n1892_001:0817c04_4"
    },
    {
        "source_sentence": "遂使小戒、大戒，開行業之始終；",
        "translation": "Thus, it is so that the minor precepts and the major precepts reveal the beginning and end of action.",
        "source": "T45n1892_001:0817c04_5"
    },
    {
        "source_sentence": "有願、無願，顯因心之漸頓。",
        "translation": "When there's a vow and no vow, it shows the gradual and suddenness of the mind as cause.",
        "source": "T45n1892_001:0817c05_6"
    },
    {
        "source_sentence": "經敘菩薩戒聚，非白四而不生；",
        "translation": "The sūtra describes the cluster of precepts for enlightening beings, which are not white or black and do not arise.",
        "source": "T45n1892_001:0817c05_7"
    },
    {
        "source_sentence": "律明聲聞正禁，因十僧而克果；",
        "translation": "The Vinaya explains that śrāvakas are correctly forbidden, and because of these ten monks they defeat the fruit.",
        "source": "T45n1892_001:0817c06_8"
    },
    {
        "source_sentence": "若欲行斯羯磨，要假壇、場，故以戒法為名，全是淨行之本。",
        "translation": "If someone wants to perform this ritual, they must make a provisional altar or site for it; therefore, the precepts are given as their names, and they're all the basis of pure practice.",
        "source": "T45n1892_001:0817c07_9"
    },
    {
        "source_sentence": "大界初興，僧法兩設，至論作業，戒場則多，此則僧住、法住，各有其致。",
        "translation": "When the Great Element was first produced, the saṃgha and the dharma were established in two ways. Up to the discussion of doctrine and reasoning, there were many monks at the precepts assembly hall. This has its own cause:",
        "source": "T45n1892_001:0817c08_10"
    },
    {
        "source_sentence": "今立戒壇之場，備依教旨，豎三標而分兩界，圍空地而絕錯疑。",
        "translation": "The altar site for the precepts is now erected in accordance with the teaching, with three distinctive signposts raised and divided into two realms, enclosed by an empty space to eliminate confusion and doubt.",
        "source": "T45n1892_001:0817c10_11"
    },
    {
        "source_sentence": "先結小界為場壇之本，依自然而集僧，曉同別之殊致。",
        "translation": "The first is to form a small boundary as the base of the altar, which naturally gathers the saṃgha and explains the distinctions in similarities and differences.",
        "source": "T45n1892_001:0817c11_12"
    },
    {
        "source_sentence": "三述戒場之外相，白二約而結之，故使三階肅而峙列，委登降之接足；",
        "translation": "The third is to describe the characteristics outside the ordination hall, while the second is to conclude by saying that the three stages are arranged in two rows. Thus enabling the venerable monks of the three orders to stand upright and",
        "source": "T45n1892_001:0817c12_13"
    },
    {
        "source_sentence": "四維晏而在隅，識辰晷之斜正。",
        "translation": "The four-cornered star Yan was in the corner, and he knew the obliqueness and correctness of the emperor's sundial.",
        "source": "T45n1892_001:0817c14_14"
    },
    {
        "source_sentence": "後結大界，僧出戒場，隨相各集，別唱別結，因使四處僧事無乖別之蹤，",
        "translation": "When the great boundary was later formed, the monks came out of the ordination hall. They were assembled in accordance with their appearances and separately preached assemblies to make sure there would be no discrepancies in the affairs",
        "source": "T45n1892_001:0817c15_15"
    },
    {
        "source_sentence": "六和顯德有乘權之務。",
        "translation": "Sixth, it's the task of revealing the virtue of harmony that has the right to ride.",
        "source": "T45n1892_001:0817c16_16"
    },
    {
        "source_sentence": "作業成遂，七萬之歲不亡；",
        "translation": "He accomplished his work and remained alive for seventy thousand years.",
        "source": "T45n1892_001:0817c17_17"
    },
    {
        "source_sentence": "德僧自在，三災之變無沒。",
        "translation": "The virtuous monks are free, and the changes of the three calamities don't disappear.",
        "source": "T45n1892_001:0817c17_18"
    },
    {
        "source_sentence": "由斯以言，戒場之舉不徒設也！",
        "translation": "Because of this, it's said that the exposition of the precepts site isn't in vain!",
        "source": "T45n1892_001:0817c18_19"
    },
    {
        "source_sentence": "成，則佛法常住；",
        "translation": "When it is settled, the Buddha-dharma will always abide.",
        "source": "T45n1892_001:0817c19_20"
    },
    {
        "source_sentence": "壞，則正教淪亡。",
        "translation": "When it breaks down, the right teaching will fall into disunity.",
        "source": "T45n1892_001:0817c19_21"
    },
    {
        "source_sentence": "此言匪妄，又彌慎也！",
        "translation": "This is not a false statement, and it's also more cautious!",
        "source": "T45n1892_001:0817c19_22"
    },
    {
        "source_sentence": "是知受隨二戒，寄斯地而克隆；",
        "translation": "Thus it is known that they receive and follow the two kinds of precepts, which are entrusted to this stage for their development.",
        "source": "T45n1892_001:0817c20_23"
    },
    {
        "source_sentence": "持犯兩儀，亦因茲而還淨。",
        "translation": "The two ways of maintaining and violating the precepts are also returned to purity because of this.",
        "source": "T45n1892_001:0817c21_24"
    },
    {
        "source_sentence": "故經云：「若無此戒，諸善不生。」",
        "translation": "That's why the sūtra says, If there aren't these precepts, goodness won't arise.",
        "source": "T45n1892_001:0817c21_25"
    },
    {
        "source_sentence": "諒是定慧之本基，誠即業惑之良藥也！",
        "translation": "Understanding is the foundation of concentration and wisdom, which really is the good medicine for karma and affliction!",
        "source": "T45n1892_001:0817c22_26"
    },
    {
        "source_sentence": "比人行事，輕斯者多，不築壇基，隨宜授受。",
        "translation": "They did not build the base of the altar but gave it to them as they wished.",
        "source": "T45n1892_001:0817c23_27"
    },
    {
        "source_sentence": "或妄結小界，曾非難緣；",
        "translation": "Or they may falsely posit a lesser realm, never with anything difficult as an object.",
        "source": "T45n1892_001:0817c24_28"
    },
    {
        "source_sentence": "或輒居佛殿，僧皆背像；",
        "translation": "Or they may live in the Buddha hall, with the images on their backs of all the monks.",
        "source": "T45n1892_001:0817c24_29"
    },
    {
        "source_sentence": "或在空迴，或在村坊，迷昏別眾，誦文徒結。",
        "translation": "They may be in an empty circle or in a village, with separate congregations in the darkness of delusion, reciting texts and forming groups of disciples.",
        "source": "T45n1892_001:0817c25_30"
    },
    {
        "source_sentence": "斯塗紛糅，無足敘之！",
        "translation": "This is a mixture of coatings, and there's no way to describe it!",
        "source": "T45n1892_001:0817c26_31"
    },
    {
        "source_sentence": "故《僧傳》云：中國僧來欲受戒者，揚都行事，並在江舟，別結而受。",
        "translation": "That's why it's said in the Saṃgha Biographies that Chinese monks who want to receive the precepts come from Yangdu and do so at Jiangzhou, which is separately bound and accepted.",
        "source": "T45n1892_001:0817c26_32"
    },
    {
        "source_sentence": "有問其故，答曰：結界法本，同別難知，故於舟中，相絕非難，說戒等法不成乍可。",
        "translation": "Someone asked why, and he answered, The basis of the fetters is the same as the dharma that's difficult to know by distinction, so it's not difficult to say that such things as precepts are unacceptable when they're taught in",
        "source": "T45n1892_001:0817c28_0"
    },
    {
        "source_sentence": "夫欲住持正法，弘護聖儀，斷絕煩惱，非戒不得脫，非界地戒業無依。",
        "translation": "Those who want to abide in upholding the right teaching, propagating noble rituals, and cutting off afflictions don't attain liberation without precepts, and they don't rely on precepts or actions that are not based",
        "source": "T45n1892_001:0817c29_1"
    },
    {
        "source_sentence": "虛承剃染，心無聖法，徒喪一生，終淪萬劫，豈不累於自他，虛為釋尊之種也！",
        "translation": "They falsely inherit shaving and dyeing, their minds lacking the noble dharma, and they simply lose one lifetime and end up in a thousand eons of sinking, so why wouldn't they be burdened by themselves and others",
        "source": "T45n1892_001:0818a02_2"
    },
    {
        "source_sentence": "故彼梵僧勤勤若此，此生死人平平若此，彌天所誡，可不思哉！",
        "translation": "That's why the Brahmā monks and nuns are so diligent, and this person in birth-and-death is so peaceful as to be admonished by Maitreya, so it can't be thought of!",
        "source": "T45n1892_001:0818a04_0"
    },
    {
        "source_sentence": "有人聞結，驚而私誚。",
        "translation": "Some people who heard about the fetters were frightened and secretly awoke.",
        "source": "T45n1892_001:0818a05_1"
    },
    {
        "source_sentence": "余告之曰：「非敢立異，斯乃一同，經教具周，人不行爾。」",
        "translation": "I told him, Not daring to establish a difference, they're all the same as each other, and the sūtras and teachings are complete, so people won't follow them.",
        "source": "T45n1892_001:0818a05_2"
    },
    {
        "source_sentence": "竊以淨教所詮，依法為本，文明四說之印，遺誥三藏之功；",
        "translation": "I humbly believe that the teachings of the Pure Teaching are based on the Dharma as the foundation, and that the four scriptures of civilisation and Buddhism are the definitive marks for the legacy of the Tripitaka Master’s work.",
        "source": "T45n1892_001:0818a07_3"
    },
    {
        "source_sentence": "順則揚三寶之初秋，違則滅四僧之後轍。",
        "translation": "In the first autumn of the Sanbao period (326–334 C.E. ) the monks who complied with these orders were excommunicated, while those who disobeyed them were expelled from the four quarters of the sangha",
        "source": "T45n1892_001:0818a08_4"
    },
    {
        "source_sentence": "文云：「戒場極小容二十一人」，明壇上之廣量也；",
        "translation": "The text says, The smallest altar of the precepts can contain twenty-one persons. This shows the width of the altar.",
        "source": "T45n1892_001:0818a09_5"
    },
    {
        "source_sentence": "「應至舒手及處」，明壇非覆障之內也；",
        "translation": "You should go to spread out your hands and place, explaining that the altar isn't inside the obstruction.",
        "source": "T45n1892_001:0818a10_6"
    },
    {
        "source_sentence": "「應留中間」，明二界非相接也；",
        "translation": "You should keep it in between. This shows that the two realms are not connected by each other.",
        "source": "T45n1892_001:0818a11_7"
    },
    {
        "source_sentence": "「先結場已，大界繞之」，明初後之軌儀也；",
        "translation": "“After first setting up the assembly site, the great circle will circumambulate it”: This shows the manner of proceeding before and after.",
        "source": "T45n1892_001:0818a11_8"
    },
    {
        "source_sentence": "「但置佛殿」，明僧寶之所依也；",
        "translation": "They simply set up a buddha hall to show where the treasures of the sangha will rest.",
        "source": "T45n1892_001:0818a12_9"
    },
    {
        "source_sentence": "「若有僧住，有慚剔除」，明有羞僧弘崇戒護易成就也。",
        "translation": "If there's a monk who abides in the saṃgha and has shame to remove it, this shows that he's ashamed of the saṃgha's exalting precepts and guarding them so easily.",
        "source": "T45n1892_001:0818a13_10"
    },
    {
        "source_sentence": "文有臨壇師，壇上僧則非場地之恒度也，此壇唯存戒住；",
        "translation": "In the text, there is a master who approaches the altar. The saṃgha on the altar is not an eternally liberated monk but only keeps the precepts in mind at this altar.",
        "source": "T45n1892_001:0818a14_11"
    },
    {
        "source_sentence": "今則多有僧住，固可詳諸誠教。",
        "translation": "Nowadays there are many monks living in the monasteries, so we should pay close attention to their sincere teachings.",
        "source": "T45n1892_001:0818a15_12"
    },
    {
        "source_sentence": "若斯義難隱忍，所以狀白敘搆，業業兢兢，晨夕讎校，仰遵遺寄，輒備通引，",
        "translation": "If this matter is difficult to tolerate in seclusion, the reason I am submitting this letter is that my deeds have been done with trembling trepidation. Every morning and evening I studied it diligently so as to make sure what I had left",
        "source": "T45n1892_001:0818a16_13"
    },
    {
        "source_sentence": "永垂無昧云爾。",
        "translation": "It's said to be like this in the eternally abiding absence of obscurity.",
        "source": "T45n1892_001:0818a18_14"
    },
    {
        "source_sentence": "大唐雍州長安縣清官鄉淨業寺戒壇之銘原夫戒壇之興，其來久矣！",
        "translation": "It's been a long time since the inscription for the precepts altar at Jinguan Temple in Chang'an County in Yongzhou, the capital of the Great Tang Dynasty, and the rise of the precepts altar!",
        "source": "T45n1892_001:0818a19_0"
    },
    {
        "source_sentence": "肇於祇樹之始，流漸淮海之陰；",
        "translation": "It was founded at the beginning of the Jetavana River and gradually flowed into the sea.",
        "source": "T45n1892_001:0818a20_1"
    },
    {
        "source_sentence": "開佛化之羽儀，扇仁風於寰宇。",
        "translation": "He opened the feathers of the Buddha’s edification and fanned the wind of benevolence in all worlds.",
        "source": "T45n1892_001:0818a21_2"
    },
    {
        "source_sentence": "遂得定慧攸託，非戒無以成基；",
        "translation": "As a result, they attain concentration and wisdom. There is no foundation for the absence of precepts or morality.",
        "source": "T45n1892_001:0818a22_0"
    },
    {
        "source_sentence": "業行是依，必律儀方能堪濟。",
        "translation": "Karmic forces are the support. It is only through restraint that they can be relied upon.",
        "source": "T45n1892_001:0818a22_1"
    },
    {
        "source_sentence": "其德既廣，非恒地之所任持；",
        "translation": "Since their virtue is so vast, they cannot be sustained by the gods of the eternal realm.",
        "source": "T45n1892_001:0818a23_2"
    },
    {
        "source_sentence": "其績既高，豈常務而能搆克！",
        "translation": "Since his achievements are so high, how could he always strive to be able to defeat them?",
        "source": "T45n1892_001:0818a24_0"
    },
    {
        "source_sentence": "故使於僧院內別置戒場，又於場中增基列陛；",
        "translation": "For this reason, the monastery was ordered to set up a separate ordination hall in the inner sanctum of the monastery. There also were additional buildings and rows of staircases arranged in the hall.",
        "source": "T45n1892_001:0818a24_1"
    },
    {
        "source_sentence": "階除四布，壇塔高嚴，幽明之所監護，凡聖於焉景仰。",
        "translation": "The stairways are not four stories high and the altars and stupas are lofty and beautifully adorned. They are guarded by the mysterious and luminous monks, while the common people and saints look up to them with reverence.",
        "source": "T45n1892_001:0818a25_2"
    },
    {
        "source_sentence": "集僧作業，經三災而莫虧；",
        "translation": "The work of collecting monks is not deficient in any of the three calamities.",
        "source": "T45n1892_001:0818a26_3"
    },
    {
        "source_sentence": "登降受行，歷萬古而長騖。",
        "translation": "He ascended and descended, accepted and practiced it, and passed away for myriad eons.",
        "source": "T45n1892_001:0818a27_4"
    },
    {
        "source_sentence": "是則慈化弘遠，誠資戒德之功；",
        "translation": "Thus his compassionate edification extended far and wide, sincerely endowed with the virtue of morality.",
        "source": "T45n1892_001:0818a28_5"
    },
    {
        "source_sentence": "煩惑廓消，咸假場壇之力；",
        "translation": "The afflictions and confusions were all extinguished through the power of the altar.",
        "source": "T45n1892_001:0818a28_6"
    },
    {
        "source_sentence": "統其績也，豈不盛哉！",
        "translation": "Wouldn't it be a great success to unify its achievements?",
        "source": "T45n1892_001:0818a29_7"
    },
    {
        "source_sentence": "若不式樹旌銘，將何啟其津徑？",
        "translation": "If you don't decorate the tree with a commemorative inscription, how will you reveal its path?",
        "source": "T45n1892_001:0818a29_8"
    },
    {
        "source_sentence": "略述所緣，其辭曰：幽關未啟，妙茲弘導，匪藉能仁，誰其覆燾？",
        "translation": "He briefly described the reason for this, saying, The mysterious barrier has not yet been opened, and the marvelous place is so vast that it cannot be guided by humaneness; who will cover it?",
        "source": "T45n1892_001:0818b01_9"
    },
    {
        "source_sentence": "覆燾伊何，諒惟戒力，三聖位隆，四生仰極。",
        "translation": "What's the power of the precepts, the three noble positions grow and the four sentient beings revere them.",
        "source": "T45n1892_001:0818b02_10"
    },
    {
        "source_sentence": "昏谷作梗，煩勞莫息，緜茲長往，於何取則？",
        "translation": "The dark valleys are an obstruction, and the troubles cannot be extinguished. If you go on such a long journey, where will you get the rules?",
        "source": "T45n1892_001:0818b03_11"
    },
    {
        "source_sentence": "在昔給園，皇覺顧命，創築場壇，開敷嘉令。",
        "translation": "Formerly the monastery was endowed with a garden, and the Emperor respectfully ordered that an altar should be built for it.",
        "source": "T45n1892_001:0818b04_12"
    },
    {
        "source_sentence": "金河既竭，玉門高映，道流淮海，南林一盛。",
        "translation": "When the River of Gold had dried up, the Gate of Jade was high and prominent. The Way flowed in the sea of the Huai River with a dense forest to the south.",
        "source": "T45n1892_001:0818b05_13"
    },
    {
        "source_sentence": "周發靈臺，漢徹明堂，事遵往帝，締搆餘皇。",
        "translation": "The emperor of the Zhou dynasty built the sacred terrace and the hall of penetrating insight in the Han dynasty served Emperor Zun, while the other emperors were entrusted to him.",
        "source": "T45n1892_001:0818b06_14"
    },
    {
        "source_sentence": "戒壇式緒，時惟法王，用隆化本，永永無疆。",
        "translation": "The altar of the precepts was originally intended for the king of the Dharma, who used it to promote the root cause of enlightenment without any limit forever and ever.",
        "source": "T45n1892_001:0818b07_15"
    },
    {
        "source_sentence": "爰有英達，厥稱僧傑，德懋時雄，智包髦烈。",
        "translation": "He was a man of noble intellect known as a monk, heroic in virtue at the time and endowed with great intelligence and brilliance.",
        "source": "T45n1892_001:0818b08_16"
    },
    {
        "source_sentence": "齊梁作範，緇素垂節，廣樹法場，橫張像設。",
        "translation": "The Qi and Liang dynasties were modeled after the image, which was made of silk and draped with knuckles. Extensive trees planted in the abstinence hall spread horizontally over the statue chamber.",
        "source": "T45n1892_001:0818b09_17"
    },
    {
        "source_sentence": "是號文國，山夷海截，有惑斯宗，人坑法滅。",
        "translation": "This is called the country of Wen, where mountains and barbarians are cut off from the sea. Those who doubt this doctrine will be driven to believe in Buddhism but the Buddhist Dharma will disappear when the people sink into it.",
        "source": "T45n1892_001:0818b10_18"
    },
    {
        "source_sentence": "中原失緒，三犯凶咽，仁祠奄室，法侶興悲。",
        "translation": "The people of the Central Plains lost their oars and three offenses were committed in a fierce manner, while the benevolent deities died in their chambers. The Buddhist monks became saddened at this.",
        "source": "T45n1892_001:0818b11_19"
    },
    {
        "source_sentence": "考定斯咎，明壇靡基，敢遵往則，式表離辭。",
        "translation": "When the blameworthiness of this error was determined, it became clear that the altar lacked a foundation and he dared to follow the rules for going back and forth.",
        "source": "T45n1892_001:0818b12_20"
    },
    {
        "source_sentence": "永鎮終古，茲文在茲。",
        "translation": "At the end of the Yongzhen period, this text is found here.",
        "source": "T45n1892_001:0818b13_21"
    },
    {
        "source_sentence": "終南山北澧福之陰清官鄉淨業寺戒壇佛舍利之銘維大唐乾封二年歲在丁卯孟夏朔日，",
        "translation": "On the first day of the seventh month in the summer of the second year of the reign of Emperor Wu, on the thirty-seventh day of the fourth month in the third year of the Zhenguan period (557 C.E.",
        "source": "T45n1892_001:0818b15_0"
    },
    {
        "source_sentence": "京師西明寺沙門釋道宣，與諸嶽瀆沙門，會于前鄉之道場，平章法律，",
        "translation": "The monk Daoxuan of Ximing Monastery in the capital, together with the other renunciants who were not Buddhists but followers of the Way, assembled at the terrace of the Way in his native land to discuss the doctrine and regulations",
        "source": "T45n1892_001:0818b17_1"
    },
    {
        "source_sentence": "仰惟三聖垂教以戒為先，四生歸德遵塗莫絕。",
        "translation": "I respectfully believe that the three sages bestow their teachings on precepts as the first, and that the four kinds of sentient beings return to virtue and follow them without fail.",
        "source": "T45n1892_001:0818b19_2"
    },
    {
        "source_sentence": "遂使住法六萬之壽，作化在於律儀；",
        "translation": "As a result, the enlightening beings were caused to abide in the Teaching for sixty thousand years; their instruction and edification were found in the disciplinary rules.",
        "source": "T45n1892_001:0818b20_3"
    },
    {
        "source_sentence": "時經三變之秋，啟務資於定、慧。",
        "translation": "In the autumn of the three transformations, he devoted his efforts to concentration and wisdom.",
        "source": "T45n1892_001:0818b21_4"
    },
    {
        "source_sentence": "所以敢承餘烈，克搆場壇，陳瘞靈軀，鎮茲福地。",
        "translation": "That is why I ventured to follow the example of other saints and build an altar in this monastery. The sage’s body was preserved at the place where it was enshrined so as to make up a blessed spot for veneration",
        "source": "T45n1892_001:0818b22_5"
    },
    {
        "source_sentence": "冀願皇覺慈照，景業統宇宙而無疆；",
        "translation": "I pray that the enlightening being Universally Enlightened will be compassionate and illumined, so as to unify all worlds without any boundaries.",
        "source": "T45n1892_001:0818b23_6"
    },
    {
        "source_sentence": "垂裕含光，神功諒堪濟而逾遠。",
        "translation": "He was generous and endowed with brightness, and his miraculous powers were so great that he could save more than a thousand people from afar.",
        "source": "T45n1892_001:0818b23_7"
    },
    {
        "source_sentence": "序之不足，略為短銘。",
        "translation": "The introduction is insufficient, and the abbreviated version is a short inscription.",
        "source": "T45n1892_001:0818b24_8"
    },
    {
        "source_sentence": "其辭曰：皇矣正覺，作化在三，戒為良導，萬善攸談。",
        "translation": "He said, “Your majesty, correctly enlightened one, you teach the Dharma in the three quarters. The precepts are a good guide and myriad good deeds can be discussed in detail.",
        "source": "T45n1892_001:0818b25_9"
    },
    {
        "source_sentence": "氷涼于水，青更逾藍，非斯組織，餘則誰甘？",
        "translation": "The ice is cooler than the water, and the blue goes beyond the blue. If this is not so, what else would be sweet?",
        "source": "T45n1892_001:0818b26_10"
    },
    {
        "source_sentence": "嶽瀆法儔，乘時蔚峙，板築福壇，猶登岵屺。",
        "translation": "The monastery was built on a plank and the altar of blessedness was erected, just as if he had climbed up into a pit.",
        "source": "T45n1892_001:0818b27_11"
    },
    {
        "source_sentence": "戒護是陞，幽明咸履，悠哉後裔，則為高軌。",
        "translation": "The precepts and protection of the precepts are promoted, and all the mysterious and insightful people walk on them. Those who leave their descendants in peace will become high-handed guides.",
        "source": "T45n1892_001:0818b28_12"
    },
    {
        "source_sentence": "敢述時緣，遍流芳紀。",
        "translation": "I venture to give a narrative of the occasions and conditions that pervade the fragrant records.",
        "source": "T45n1892_001:0818b29_13"
    },
    {
        "source_sentence": "荊州等界寺沙門無行，觀化秦川，遇茲盛集，贊而述之。",
        "translation": "The monk Wuxing of the Temple of the Equanimity in Jingzhou observed and transformed the Qin River, and when he encountered this great assembly he praised it and described it.",
        "source": "T45n1892_001:0818c02_0"
    },
    {
        "source_sentence": "大唐乾封二年四月朔日荊南渚宮沙門釋無行戒壇舍利贊余等登趾荊岑，",
        "translation": "On the first day of the fourth month in the second year of the Great Tang Dynasty, on the first day of the fourth month in the second year of Qianfeng's reign, the ascetic Śākyamuni of Jingnanzhus",
        "source": "T45n1892_001:0818c04_0"
    },
    {
        "source_sentence": "搜玄秦嶺；",
        "translation": "He searched the mountain range of the mysterious Qin.",
        "source": "T45n1892_001:0818c06_1"
    },
    {
        "source_sentence": "承律謨於上德，聞所未聞；",
        "translation": "Inherent in the Vinaya, I have never heard anything like this from anyone of high virtue.",
        "source": "T45n1892_001:0818c06_2"
    },
    {
        "source_sentence": "稟清範於靈壇，日新日損。",
        "translation": "Every day the image was preserved at the sacred altar but lost its luster as it grew old.",
        "source": "T45n1892_001:0818c07_3"
    },
    {
        "source_sentence": "是以皇覺慈訓，弘之在人，祇樹高風，幽心祥感。",
        "translation": "That is why the Emperor, enlightened by the teaching of compassion, propagated it among the people. The high wind that blows from the Jetavana tree brings a mysterious and auspicious feeling to his mind.",
        "source": "T45n1892_001:0818c07_4"
    },
    {
        "source_sentence": "幸逢嘉會，瘞靈骨於福壇；",
        "translation": "He was fortunate to have met with an auspicious assembly and offered up his spiritual bones at the altar of blessedness.",
        "source": "T45n1892_001:0818c08_5"
    },
    {
        "source_sentence": "玄綱載維，想德鎧之非遠。",
        "translation": "The mysterious outline carries its weight, and the armor of ideation and virtue isn't far from it.",
        "source": "T45n1892_001:0818c09_6"
    },
    {
        "source_sentence": "不勝手舞，景仰神光，敢述玄猷，乃為贊曰：覺智圓明，應物唯靈，非滅示滅，",
        "translation": "He dared to expound his profound teachings, and then composed these verses in praise of the perfect clarity of enlightenment and wisdom. All living beings are spiritual only; they do not cease but show their cessation.",
        "source": "T45n1892_001:0818c10_7"
    },
    {
        "source_sentence": "無生現生。",
        "translation": "There's no arising in the present life.",
        "source": "T45n1892_001:0818c11_8"
    },
    {
        "source_sentence": "為人演法，三學開津，場壇肅穆，戒德氤氳。",
        "translation": "He preached the Dharma for the sake of the people, and the three learnings opened up the river. The altar was solemn and the virtue of morality pervaded it with a roaring noise.",
        "source": "T45n1892_001:0818c11_9"
    },
    {
        "source_sentence": "金河晦影，鶴樹澄神，能仁散體，多寶全身。",
        "translation": "The golden river has a dark shadow, and the cranes and trees are pure in spirit. They can benevolently disperse their bodies and store up large quantities of jewels all over their bodies.",
        "source": "T45n1892_001:0818c12_10"
    },
    {
        "source_sentence": "奇光昭晣，嘉瑞攸陳，二端尚在，八斛猶均。",
        "translation": "The extraordinary light shone brightly and the auspicious signs were prominent, while the good fortune was still present at both ends. Eight hu [Chinese units] remained evenly balanced.",
        "source": "T45n1892_001:0818c13_11"
    },
    {
        "source_sentence": "厥後無憂，爰初啟信，近護分光，靈墳是鎮。",
        "translation": "The emperor had no sorrowful feelings of grief and believed in Buddhism for the first time. Because he was close to preserving the distinctive characteristics of Buddhism, his spirit burial mound served as a town.",
        "source": "T45n1892_001:0818c14_12"
    },
    {
        "source_sentence": "靈墳現奇，震嶺標基，扶風散彩，淮海騰輝。",
        "translation": "The tomb of the sacred figure is marvelous; it shakes the mountain range and marks the foundation. When the wind blows its colors are dispersed, and the beauty of the Huai River rises high over the sea.",
        "source": "T45n1892_001:0818c15_13"
    },
    {
        "source_sentence": "粵自荊岫，尋真太一，希世之風，載揚茲日。",
        "translation": "Since the founding of the monastery in Jingzhou (in present-day Shanxi province) there is a rare and unique style of Buddhism that carries it up to this day.",
        "source": "T45n1892_001:0818c16_14"
    },
    {
        "source_sentence": "壇模山像，登頓有秩，鎮以遺身，幽誠云畢。",
        "translation": "An altar-shaped image of the mountain is enshrined in the monastery, with an orderly rising and a standing posture to venerate it. The remains are preserved in this stupa as if they had been buried alive",
        "source": "T45n1892_001:0818c17_15"
    },
    {
        "source_sentence": "願言遐曠，克念崇尚，識鏡澄明，心河靜浪。",
        "translation": "Their vows are vast and far-reaching, their thoughts are sublime and lofty, their consciousnesses are clear and bright, and their minds are rivers of tranquility and waves.",
        "source": "T45n1892_001:0818c18_16"
    },
    {
        "source_sentence": "庶劫石之方消，覿神珠於妙相。",
        "translation": "It was not until the age of the stone that the divine pearl disappeared, and the deva-pearl appeared in its marvelous appearance.",
        "source": "T45n1892_001:0818c19_17"
    },
    {
        "source_sentence": "大唐中原關輔戒壇儀",
        "translation": "ordination altar ceremony for the precepts of the great Tang monk Guanfu of the Central Plains",
        "source": "T45n1892_001:0818c21_0"
    },
    {
        "source_sentence": "余以乾封二年二月八日，創築戒壇，四方嶽瀆沙門尋聲遠集者二十餘人。",
        "translation": "On the eighth day of the second month in the second year of the Qianfeng era, I built a precepts altar on the eighth day of the second month. More than twenty śramaṇas from various quarters gathered here to worship the",
        "source": "T45n1892_001:0818c22_0"
    },
    {
        "source_sentence": "至於夏初，眾侶更集，載受具戒，多是遠人，京寺同學，咸來觀化。",
        "translation": "At the beginning of the summer many monks gathered together again to receive the ordination precepts. Most of them were people from distant lands, and all the students at the capital city Monastery came to see the Master’s edification.",
        "source": "T45n1892_001:0818c23_1"
    },
    {
        "source_sentence": "余以法利希行，恐有乖忤；",
        "translation": "I wish to practice for the benefit of the Dharma, lest there be any disobedience.",
        "source": "T45n1892_001:0818c25_2"
    },
    {
        "source_sentence": "和悅上下，務成為先。",
        "translation": "Up and down in Vaiśravaṇa's mind, he wanted to become the first.",
        "source": "T45n1892_001:0818c25_3"
    },
    {
        "source_sentence": "有京師西明寺真懿律師，今之律匠也，彭享勇銳，最所忌情，恐東迴左繞，",
        "translation": "In the capital city there was Vinaya Master Zen'i of Ximing si Monastery, a contemporary master of the Vinaya. His most fearsome emotion was that he might turn east and circumambulate to his left.",
        "source": "T45n1892_001:0818c26_4"
    },
    {
        "source_sentence": "傷俗之行事也。",
        "translation": "It's an act that hurts the secular world.",
        "source": "T45n1892_001:0818c27_5"
    },
    {
        "source_sentence": "余諭之曰：「律師勿見東迴左繞以為非法耶！",
        "translation": "I admonished him, saying, Don't see the Vinaya master turning east and circling left as unlawful!",
        "source": "T45n1892_001:0818c28_6"
    },
    {
        "source_sentence": "此天常之大理也。",
        "translation": "This is the great principle of eternalism in heaven.",
        "source": "T45n1892_001:0818c29_7"
    },
    {
        "source_sentence": "人惑左右，習俗罕分，深願體之，勿慮非咎。」",
        "translation": "People are confused by their left and right, rarely distinguished by customs and secularity, and they deeply wish to embody them, so don't worry about what's not blameworthy.",
        "source": "T45n1892_001:0818c29_8"
    },
    {
        "source_sentence": "便答余云：「此不敢怪也。",
        "translation": "He then answered the rest, I wouldn't dare to wonder about this.",
        "source": "T45n1892_001:0819a01_9"
    },
    {
        "source_sentence": "吾昔見大莊嚴寺大德恭禪師若行道時，必東迴北轉，此為右繞。」",
        "translation": "In the past, I saw the great virtuous Chan master of Dazhuangyan Temple who would surely turn east and north when he walks on the path, and this is his right circumambulation.",
        "source": "T45n1892_001:0819a02_10"
    },
    {
        "source_sentence": "彼告吾云：「子不見俗中城門耶，東入西出，咸言左出右入也。」",
        "translation": "He told me, Don't you see the city gates in the secular world? They enter from the east and leave from the west, and they all say left to exit and right to enter.",
        "source": "T45n1892_001:0819a03_11"
    },
    {
        "source_sentence": "如是云云。",
        "translation": "Thus, it's said.",
        "source": "T45n1892_001:0819a04_12"
    },
    {
        "source_sentence": "行事之家，觀時制度，餘方不為清淨，則不行之。",
        "translation": "A house that conducts itself according to the rules and observes the regulations at the right time doesn't become pure in other places, so it won't be practiced.",
        "source": "T45n1892_001:0819a05_13"
    },
    {
        "source_sentence": "余七十暮年，脚疾摧朽，顧求法者，不遠關山。",
        "translation": "At the end of my seventy years old age my feet were sick and disfigured, and in order to seek the Dharma I was not far from the barrier mountains.",
        "source": "T45n1892_001:0819a06_14"
    },
    {
        "source_sentence": "今秋氣已清，客心飛舉，將事終天之別，必爽載面之期，力疾集之，用為送終之贈也。",
        "translation": "Now that the autumn breeze is clear and the guest spirits are flying high. At the end of the emperor’s reign, he will surely die before the time for carrying his pores has passed. He must have gathered them",
        "source": "T45n1892_001:0819a07_15"
    },
    {
        "source_sentence": "言此飲淚，窮獨可悲。",
        "translation": "He said, “This is a place where we shed tears of sorrow.",
        "source": "T45n1892_001:0819a09_16"
    },
    {
        "source_sentence": "乾封二年二月十四日，於清官結大界淨地，并出淨厨誥。",
        "translation": "On the fourteenth day of the second month in the second year of Qianfeng, he formed a large boundary and purified the land at Qinguan and issued a decree to purify the kitchen.",
        "source": "T45n1892_001:0819a09_17"
    },
    {
        "source_sentence": "關中創立戒壇圖經",
        "translation": "Guanzhong xiuxing jietai zhuantu jing",
        "source": "T45n1892_001:0819a11_0"
    },
    {
        "source_sentence": "吾祖之道，猶羲和昇於隅夷，則何物不明矣！",
        "translation": "My ancestor's path is like the way Xihe ascended to Kuśinagara, so nothing is unknown!",
        "source": "T45n1892_001:0819a12_0"
    },
    {
        "source_sentence": "幸於早年尋師問津，探賾其奧旨，時為節度僧道，而傳演之道難矣。",
        "translation": "It is fortunate that in the early years he sought out the Master and asked him questions to investigate his profound theories. At that time it was difficult for a monk to teach the path of Buddhism as an ordinary monk, even if he taught",
        "source": "T45n1892_001:0819a13_0"
    },
    {
        "source_sentence": "遂守愚於開元昭慶，會證悟依止，重築戒壇，忝預校量制度。",
        "translation": "He then guarded the folly at Kaiyuan Zhaoqing, where he relied on the assembly to realize enlightenment and rebuilt the precepts altar in order to define the system.",
        "source": "T45n1892_001:0819a14_1"
    },
    {
        "source_sentence": "壇將成，因思吾祖戒壇圖經，真悟記主雖曾鏤板，緣兵火煨燼，深慮湮沒其道，",
        "translation": "When the altar was about to be completed, he thought of the scripture on the altar image of the precepts of our ancestor. Although the recorder True Enlightenment had carved a slab of wood for the altar, it burned up",
        "source": "T45n1892_001:0819a15_2"
    },
    {
        "source_sentence": "遂遍募同袍，仍將舊本校刻流通，永彰不朽，使末代知壇制之殊勝耳。",
        "translation": "He then collected all the robes and kept them preserved in the old monastery for circulation, so as to make sure they would never perish. This will enable the people of later ages to know the superiority of the altar rules.",
        "source": "T45n1892_001:0819a17_3"
    },
    {
        "source_sentence": "旹紹興二十二年十二月朔",
        "translation": "It was the twelfth month of the twenty-second year of Shaoxing's reign.",
        "source": "T45n1892_001:0819a20_0"
    },
    {
        "source_sentence": "臥龍景德院住持比丘(惟定)題",
        "translation": "title of the monk who lives in the Jingde court of the sleeping dragon (Weiding)",
        "source": "T45n1892_001:0819a21_0"
    }
]