[
    {
        "source_sentence": "西方合論卷之十",
        "translation": "combined Treatise on the Western Regions, Volume 10",
        "source": "T47n1976_010:0417a17_0"
    },
    {
        "source_sentence": "第十釋異門",
        "translation": "Tenth Explanation of the Differences",
        "source": "T47n1976_010:0417a19_0"
    },
    {
        "source_sentence": "夫西方大旨，經中自明；",
        "translation": "The general idea of the West is explained in the scriptures themselves.",
        "source": "T47n1976_010:0417a20_0"
    },
    {
        "source_sentence": "淨土要門，諸論具釋。",
        "translation": "The essential aspects of the Pure Land are explained in all the treatises.",
        "source": "T47n1976_010:0417a20_1"
    },
    {
        "source_sentence": "如天親、智者、海東、越溪等，皆抉發幽微，舉揚宗趣；",
        "translation": "They are like the gods’ relatives, wise men, the sea-eastern and transworldly rivers. All of them revealed their mysterious subtleties and proclaimed the doctrines they taught.",
        "source": "T47n1976_010:0417a21_2"
    },
    {
        "source_sentence": "近則雲棲和尚，所著小本疏鈔，條分類析，精宏淵博，真照夜途之長炬，",
        "translation": "Recently the monk Yunqi wrote a small collection of commentaries and commentaries, divided into categories and analyzed in chapters. The essence of his work was extensive and vast; it truly shone as the long torch of the night’s journey.",
        "source": "T47n1976_010:0417a22_3"
    },
    {
        "source_sentence": "截苦海之輕舟。",
        "translation": "They cut off the light boat of the ocean of suffering.",
        "source": "T47n1976_010:0417a23_4"
    },
    {
        "source_sentence": "諸師所發，已無餘蘊。",
        "translation": "The Sūtra teaches that there are no other āyatanas.",
        "source": "T47n1976_010:0417a24_5"
    },
    {
        "source_sentence": "但諸經中，隨時立教，逗根說義，時有差別，致生學者疑畏。",
        "translation": "But the Sūtras establish doctrine at different moments, tormenting the sense faculties and expounding their meanings. There are distinctions in the timing of these teachings, which give rise to doubt and fear among scholars.",
        "source": "T47n1976_010:0417a24_6"
    },
    {
        "source_sentence": "今略為拈出，博採諸論，附以管見，會歸一處，以便參攻。",
        "translation": "I will now summarize it for your sake and collect the treatises extensively. Attached to this collection of views as an appendix, I shall return to one place so that you may visit and study it.",
        "source": "T47n1976_010:0417a26_0"
    },
    {
        "source_sentence": "一、剎土遠近釋。",
        "translation": "1. An explanation of the distant and proximate aspects of the buddha-lands.",
        "source": "T47n1976_010:0417a28_0"
    },
    {
        "source_sentence": "　二、身城大小釋。",
        "translation": "2. An explanation of the size of the city of the body.",
        "source": "T47n1976_010:0417a28_1"
    },
    {
        "source_sentence": "三、壽量多少釋。",
        "translation": "3. an explanation of the amount of life span.",
        "source": "T47n1976_010:0417a29_0"
    },
    {
        "source_sentence": "　四、花輪大小釋。",
        "translation": "4. The explanation of the size of the flower wheel.",
        "source": "T47n1976_010:0417a29_1"
    },
    {
        "source_sentence": "五、日月有無釋。",
        "translation": "5. There's an explanation of the existence and nonexistence of the sun and moon.",
        "source": "T47n1976_010:0417b01_0"
    },
    {
        "source_sentence": "　六、二乘有無釋。",
        "translation": "6. The two vehicles have an explanation of existence and nonexistence.",
        "source": "T47n1976_010:0417b01_1"
    },
    {
        "source_sentence": "七、婦女有無釋。",
        "translation": "7. There's an explanation that women have and don't have.",
        "source": "T47n1976_010:0417b02_0"
    },
    {
        "source_sentence": "　八、發心大小釋。",
        "translation": "8. An explanation of the size of the arousal of the intention.",
        "source": "T47n1976_010:0417b02_1"
    },
    {
        "source_sentence": "九、疑城胎生釋。",
        "translation": "9. The explanation of doubting the city's birth in the womb.",
        "source": "T47n1976_010:0417b03_0"
    },
    {
        "source_sentence": "　十、五逆往生釋。",
        "translation": "10. The explanation of the five heinous rebirths.",
        "source": "T47n1976_010:0417b03_1"
    },
    {
        "source_sentence": "一、剎土遠近者，問：「大小本經，皆云西方去此十萬億剎，《觀經》獨云：『阿彌陀佛，",
        "translation": "1. Regarding the distant and near buddha-lands, he asked, The major and minor scriptures all say that there are 100,000,000,000 buddhas in the west from here, but the contemplation sūtras only say, 'Amitâbha Buddha,",
        "source": "T47n1976_010:0417b04_0"
    },
    {
        "source_sentence": "去此不遠。』",
        "translation": "Not far from here, he said.'",
        "source": "T47n1976_010:0417b05_1"
    },
    {
        "source_sentence": "二說誰正？」",
        "translation": "The second is to explain who is correct?",
        "source": "T47n1976_010:0417b05_2"
    },
    {
        "source_sentence": "釋：「以遠近無定故，故言亦遠亦近。",
        "translation": "It's because there's no fixed distance or nearness, so it's called both distant and near.",
        "source": "T47n1976_010:0417b06_3"
    },
    {
        "source_sentence": "何故？",
        "translation": "Why is it so?",
        "source": "T47n1976_010:0417b06_4"
    },
    {
        "source_sentence": "凡言某方者，某方至某方，至某方幾城幾剎者，是從色身建立；",
        "translation": "When stating: “Some direction,” it means that a certain direction goes to a certain direction. How many cities and how many buddha-lands are there when going to a certain direction?”*°? is established from the material body.",
        "source": "T47n1976_010:0417b07_5"
    },
    {
        "source_sentence": "身相虛故，是故所計方向道里，亦皆不實，不得言誰近誰遠。",
        "translation": "Because the characteristics of the body are unreal, it cannot be said who approaches and who is far away.",
        "source": "T47n1976_010:0417b08_6"
    },
    {
        "source_sentence": "如滇人言燕地遠，是從滇計故，燕實無遠；",
        "translation": "Just as the people of Jambudvīpa say that the swamp is far away from the land. This is due to their calculation in terms of Jambudvīpa, whereas the real swamp is not far away.",
        "source": "T47n1976_010:0417b09_7"
    },
    {
        "source_sentence": "齊人言燕地近，是從齊計故，燕實無近。",
        "translation": "The Qi people say that the land of Yan is near because it's calculated from the Qi, but the real Yan isn't near.",
        "source": "T47n1976_010:0417b10_8"
    },
    {
        "source_sentence": "又如十步之地，蟻子即遠，大象即近，不應言遠是實。",
        "translation": "It's also like when the ants are ten paces away from the ground, and the great elephants are nearby, so they shouldn't say that far is real.",
        "source": "T47n1976_010:0417b11_9"
    },
    {
        "source_sentence": "何故？",
        "translation": "Why is it so?",
        "source": "T47n1976_010:0417b13_10"
    },
    {
        "source_sentence": "是地不當從蟻計故。",
        "translation": "This ground shouldn't be calculated from the ants.",
        "source": "T47n1976_010:0417b13_11"
    },
    {
        "source_sentence": "亦不應言近是實。",
        "translation": "Nor should it be said that the proximate is real.",
        "source": "T47n1976_010:0417b13_12"
    },
    {
        "source_sentence": "何故？",
        "translation": "Why is it so?",
        "source": "T47n1976_010:0417b14_13"
    },
    {
        "source_sentence": "是地不當從象計故。",
        "translation": "It's because this ground shouldn't be calculated from the elephant.",
        "source": "T47n1976_010:0417b14_14"
    },
    {
        "source_sentence": "又則計十步者，亦非是寔，何故？",
        "translation": "Also, the calculation of ten steps isn't crude, why is it?",
        "source": "T47n1976_010:0417b14_15"
    },
    {
        "source_sentence": "是地既不從蟻不從象，亦不當從人計故。",
        "translation": "Since this land doesn't follow the ants and elephants, it shouldn't follow people's imagination.",
        "source": "T47n1976_010:0417b15_16"
    },
    {
        "source_sentence": "《智度論》曰：『隨世俗所傳，故說有方，方實不可得。』",
        "translation": "The Zhidu lun says, 'Following what's transmitted by the conventional, it's therefore said that there are directions that are really unobtainable.'",
        "source": "T47n1976_010:0417b16_17"
    },
    {
        "source_sentence": "問曰：『何以言無方是方，亦有亦常？",
        "translation": "Q: Why do you say that directionlessness is direction and existence is also permanence?",
        "source": "T47n1976_010:0417b17_18"
    },
    {
        "source_sentence": "如經中說日出處是東方，日沒處是西方，日行處是南方，日不行處是北方。",
        "translation": "As the sūtras say, the place where the sun comes out is in the east, the place where the sun goes down is in the west, the place where the sun moves is in the south, and the place where the sun doesn't go is in the north.",
        "source": "T47n1976_010:0417b18_19"
    },
    {
        "source_sentence": "日有三分合，若前合，若今合，若後合，隨方日分，初合是東方，南方西方亦如是，",
        "translation": "The sun is divided into three parts; the first part is in the east; the second part is in the south; and so on to the west.",
        "source": "T47n1976_010:0417b19_20"
    },
    {
        "source_sentence": "日不行處是無分。』",
        "translation": "Where the sun doesn't go, there's no part.'",
        "source": "T47n1976_010:0417b21_21"
    },
    {
        "source_sentence": "答曰：『不然。",
        "translation": "He replied, 'No.",
        "source": "T47n1976_010:0417b22_22"
    },
    {
        "source_sentence": "須彌山在四域之中，日繞須彌照四天下。",
        "translation": "Mount Sumeru is in the middle of the four continents, and the sun circles around Sumeru to illuminate the four continents.",
        "source": "T47n1976_010:0417b22_23"
    },
    {
        "source_sentence": "欝怛羅越日中，是弗婆提日出，於弗婆提人是東方；",
        "translation": "On the middle of the month it is the day when the sun comes out in Pūrvavideha. The people living in Pūrvavideha live in the east.",
        "source": "T47n1976_010:0417b23_24"
    },
    {
        "source_sentence": "弗婆提日中，是閻浮提日出，於閻浮提人是東方，是實無初。",
        "translation": "On the middle of the day in Pūrvavideha, it's the first day of the month when the sun rises in Jambudvīpa, and the people in Jambudvīpa are from the east, which is really no beginning.",
        "source": "T47n1976_010:0417b24_25"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T47n1976_010:0417b25_26"
    },
    {
        "source_sentence": "一切方皆東方，皆南方，皆西方，皆北方。",
        "translation": "All directions are in the east, all in the south, all in the west, and all in the north.",
        "source": "T47n1976_010:0417b26_27"
    },
    {
        "source_sentence": "汝言日出處是東方，日行處是南方，日沒處是西方，日不行處是北方，",
        "translation": "You say that the place where the sun comes out is in the east, the place where the sun moves is in the south, the place where the sun goes down is in the west, and the place where the sun does not go down is in the north.",
        "source": "T47n1976_010:0417b27_0"
    },
    {
        "source_sentence": "是事不然。』",
        "translation": "That's not the case.'",
        "source": "T47n1976_010:0417b28_1"
    },
    {
        "source_sentence": "問曰：『我說一國中方相，汝以四國為難。",
        "translation": "He asked, 'I'll explain the directions of one country, and you'll make four countries a difficulty.",
        "source": "T47n1976_010:0417b28_2"
    },
    {
        "source_sentence": "以是故東方非無初。』",
        "translation": "That's why the east isn't without beginning.'",
        "source": "T47n1976_010:0417b29_3"
    },
    {
        "source_sentence": "答曰：『若一國中日與東方合，是為有邊，有邊故無常，無常故是不遍，",
        "translation": "Vimalakīrti: When the sun of one country unites with the east, it is finite. Because finite, it is impermanent; because impermanent, it is not universal.",
        "source": "T47n1976_010:0417c01_4"
    },
    {
        "source_sentence": "以是故但有方名而無實。",
        "translation": "Because of this, there's only a directional name but no real one.",
        "source": "T47n1976_010:0417c02_5"
    },
    {
        "source_sentence": "是則方所尚不可得，豈有程途？",
        "translation": "If this is the case, then what's found in that direction is still unobtainable, so how could there be a path?",
        "source": "T47n1976_010:0417c03_6"
    },
    {
        "source_sentence": "然亦不廢方所及程途故，何故？",
        "translation": "However, it also does not abandon the paths of travel that are accessible. Why?",
        "source": "T47n1976_010:0417c04_7"
    },
    {
        "source_sentence": "以不當從閻浮提計，亦可即閻浮提計故。",
        "translation": "It's because it shouldn't be calculated from Jambudvīpa, and it can also be calculated from Jambudvīpa.",
        "source": "T47n1976_010:0417c04_8"
    },
    {
        "source_sentence": "如日雖非東西出沒，亦可言東出西沒故。』」",
        "translation": "It's like saying that even though the sun doesn't emerge and disappear from east to west, it can still emerge and disappear from east to west.'",
        "source": "T47n1976_010:0417c05_9"
    },
    {
        "source_sentence": "二、身城大小者，問：「《聲王經》曰：『阿彌陀佛與聲聞俱，其國號曰清泰。",
        "translation": "Second, the large and small size of the body city asked, The Sound King Sutra says, 'The Amitâbha Buddha is accompanied by śrāvakas, and his country is called Qintai.",
        "source": "T47n1976_010:0417c07_0"
    },
    {
        "source_sentence": "聖王所住，其城縱廣十千由旬。』",
        "translation": "The city where the noble king lives is 10,000 yojanas long and wide.'",
        "source": "T47n1976_010:0417c08_1"
    },
    {
        "source_sentence": "《觀經》曰：『佛身高六十萬億那由他恒河沙由旬，眉間白毫右旋宛轉如五須彌山，",
        "translation": "The Avalokitêśvara Sutra says: The Buddha is sixty-thousand myriads of koṭis of nayutas tall like the five polar mountains, with his white hair curled to the right between his eyebrows.",
        "source": "T47n1976_010:0417c09_2"
    },
    {
        "source_sentence": "佛眼如四大海水。』",
        "translation": "The Buddha's eye is like the four great oceans of water.'",
        "source": "T47n1976_010:0417c11_3"
    },
    {
        "source_sentence": "今計一海八萬四千由旬，四海合三十三萬六千由旬。",
        "translation": "At present one ocean is eighty-four thousand yojanas in length; the four seas are altogether three hundred and thirty-six thousand yojanas in length.",
        "source": "T47n1976_010:0417c11_4"
    },
    {
        "source_sentence": "身過其眼五百六十萬由旬，計所住城，尚少于眼三十二萬六千由旬，何況其身，",
        "translation": "His body was five hundred and sixty million yojanas beyond his eyes. The city where he lived was calculated to be still less than [that of] thirty-two million sixty thousand yojanas from his eyes, let alone his own body.",
        "source": "T47n1976_010:0417c12_5"
    },
    {
        "source_sentence": "不應身城懸絕如是。」",
        "translation": "You shouldn't hang your body in the city like this.",
        "source": "T47n1976_010:0417c14_6"
    },
    {
        "source_sentence": "釋：「海東《疏》中，亦有此問。",
        "translation": "Explanation: This question is also asked in the commentary on the Haidong jing.",
        "source": "T47n1976_010:0417c15_7"
    },
    {
        "source_sentence": "《疏》曰：『彼佛有眾多城，隨眾大小城亦大小。",
        "translation": "The commentary says, 'That Buddha has many cities, and the large and small cities are equally large according to the number of cities.",
        "source": "T47n1976_010:0417c15_8"
    },
    {
        "source_sentence": "大城之中，示以大身，小城之中，現以小身。",
        "translation": "In a large city, he shows his large body; in a small city, he shows his small body.",
        "source": "T47n1976_010:0417c16_9"
    },
    {
        "source_sentence": "《聲王經》言「十千由旬」者，是與聲聞俱住之城，當知佛身相當而住。",
        "translation": "The sound king sūtra says 10,000 yojanas because it's the city where śrāvakas live together, and you should know that the Buddha's body is exactly the same as its abode.",
        "source": "T47n1976_010:0417c17_10"
    },
    {
        "source_sentence": "《觀經》所說身高大者，當知其城亦隨廣大，與諸大眾俱住處。』",
        "translation": "The tallness of the height described in the Avalokitêśvara Sutra, you should know that the city is also as large as it is and where the masses live together.'",
        "source": "T47n1976_010:0417c19_0"
    },
    {
        "source_sentence": "故先德云：『《法華》中淨光莊嚴土，唯演頓故；",
        "translation": "That is why the Bhadanta Vasanti said: In the Lotus Sutra there is a land of pure light adorned with embellishments, because it only manifests suddenly.",
        "source": "T47n1976_010:0417c20_1"
    },
    {
        "source_sentence": "《淨名》中眾香佛土，純菩薩故，所以彼佛但現高大之身。",
        "translation": "In the Jīvaka, there are many fragrant buddha lands in the Pure Land because they're purely bodhisattvas, so that Buddha only presents a high and large body.",
        "source": "T47n1976_010:0417c21_2"
    },
    {
        "source_sentence": "若安養土，頓漸俱談，聲聞菩薩共為僧故，故使佛示生身法身二種之相，",
        "translation": "In the land of peace and rebirth, they talk together gradually and suddenly. Because śrāvakas and bodhisattvas are all for the sake of the sangha, it is so that Buddha may show them the characteristics of the two kinds of birth-body, dharma-body and body.",
        "source": "T47n1976_010:0417c22_3"
    },
    {
        "source_sentence": "三十二相，通于生法，大小共見；",
        "translation": "The thirty-two characteristics extend to all factors arising. They are seen by both large and small classes.",
        "source": "T47n1976_010:0417c24_4"
    },
    {
        "source_sentence": "若八萬相，局在法身，大乘賢聖，方得見也。』",
        "translation": "If the 80,000 marks are confined to the Dharma body, then only the great vehicle sages and saints will be able to see them.'",
        "source": "T47n1976_010:0417c24_5"
    },
    {
        "source_sentence": "是故應以藏塵尊特之相得四益者，佛為稱機現藏塵尊特身；",
        "translation": "Therefore, the four benefits should be acquired by means of the special characteristics of the store consciousness. The Buddha manifested the special body of the store consciousness as an opportunity in order to praise it.",
        "source": "T47n1976_010:0417c25_6"
    },
    {
        "source_sentence": "應以八萬尊特之相得四益者，佛為稱機現八萬尊特身；",
        "translation": "To those who should receive the four benefits of enlightenment by means of the eighty-thousand special characteristics, the Buddha manifested eighty-thousand special bodies for their instruction.",
        "source": "T47n1976_010:0417c27_7"
    },
    {
        "source_sentence": "應以三十二尊特之相得四益者，佛為稱機現三十二尊特身。",
        "translation": "Those who should attain the four benefits by means of the thirty-two honored characteristics, the Buddha uses the thirty-two honored bodies as an opportunity to show them.",
        "source": "T47n1976_010:0417c28_8"
    },
    {
        "source_sentence": "如毘盧遮那，聲聞視聽，隔于對顏，不妨菩薩，更見大身。",
        "translation": "It's like Vairocana, a śrāvaka who sees and hears what's heard but doesn't look away from his opposite face, so why wouldn't he see the bodhisattva's large body?",
        "source": "T47n1976_010:0418a01_0"
    },
    {
        "source_sentence": "何故？",
        "translation": "Why is it so?",
        "source": "T47n1976_010:0418a02_1"
    },
    {
        "source_sentence": "佛身隨所被機，大小如日，光隨隙分大分小，而是日光無大小故。」",
        "translation": "The Buddha's body follows the opportunity to be exposed, which is as large and small as the sun, and the light follows the gaps in size, but the sun's light has no size.",
        "source": "T47n1976_010:0418a02_2"
    },
    {
        "source_sentence": "三、壽量多少者，經云：「彼佛壽命無量無邊阿僧祇劫。」",
        "translation": "3. The length of the Buddha's life span, the sūtra says, That Buddha's life span is immeasurable and limitless in an incalculable eon.",
        "source": "T47n1976_010:0418a04_0"
    },
    {
        "source_sentence": "又云：「彼佛至般泥洹時，觀世音菩薩乃當作佛。」",
        "translation": "It's also said, When that Buddha arrives at parinirvāṇa, the Bodhisattva Avalokiteśvara becomes a buddha.",
        "source": "T47n1976_010:0418a05_1"
    },
    {
        "source_sentence": "既當入滅，即是有量。",
        "translation": "Since it will enter into cessation, it's immeasurable.",
        "source": "T47n1976_010:0418a06_2"
    },
    {
        "source_sentence": "釋：「先德云：『藏通補處彰佛有量；",
        "translation": "A Forest of Pearls from the Dharma Garden, Volume II Explanation: The ancient virtuous one said:",
        "source": "T47n1976_010:0418a06_3"
    },
    {
        "source_sentence": "別圓補處顯佛無量。",
        "translation": "The distinctive and perfect patchwork shows that the Buddha is immeasurable.",
        "source": "T47n1976_010:0418a07_4"
    },
    {
        "source_sentence": "以十方三世一切如來，更無彼此，迭相見故；",
        "translation": "Because all the Buddhas of the ten directions and three times are not mutually exclusive, because they appear one after the other.",
        "source": "T47n1976_010:0418a07_5"
    },
    {
        "source_sentence": "同一法身，一智慧故。",
        "translation": "They are the same Dharma body: because of one wisdom.",
        "source": "T47n1976_010:0418a08_6"
    },
    {
        "source_sentence": "菩薩機忘，如來應息，名補佛處，實異藏通，前佛定滅，後佛定生。",
        "translation": "When a bodhisattva forgets the opportunity, the Tathāgata should cease, which is called the place where he replenishes the Buddha's position and really has the ability to store what's different. The former Buddha will surely cease, and the latter Buddha will surely arise after him.",
        "source": "T47n1976_010:0418a09_7"
    },
    {
        "source_sentence": "故《金光明》四佛降室，《疏》乃釋云：「若見四佛同尊特身，一身一智慧，",
        "translation": "That's why the commentary explains, Suppose you see that the four buddhas of the Golden Light are the same as the venerable body, with one body and one wisdom,",
        "source": "T47n1976_010:0418a10_8"
    },
    {
        "source_sentence": "即是常身，弟子眾一故；",
        "translation": "That is to say, it is an eternal body because the disciples are one in number.",
        "source": "T47n1976_010:0418a12_9"
    },
    {
        "source_sentence": "若見四佛佛身不同，即是應化，弟子眾多故。」』",
        "translation": "If you see that the bodies of the four buddhas and buddhas are different, it's because there are so many disciples who should be transformed.'",
        "source": "T47n1976_010:0418a12_10"
    },
    {
        "source_sentence": "故知全法界身，非生非滅，豈得竪分當現，橫論彼此；",
        "translation": "Therefore, it is known that the whole body of the cosmos of dharmas neither arises nor perishes. How can we know that gross parts are to be manifested and that they are to be discussed horizontally among themselves?",
        "source": "T47n1976_010:0418a13_11"
    },
    {
        "source_sentence": "既非生滅，無量義成。",
        "translation": "Since it is not arising or ceasing, the meaning of immeasurable is established.",
        "source": "T47n1976_010:0418a15_12"
    },
    {
        "source_sentence": "且淨佛剎中，摩剎水樹，皆是佛身故。",
        "translation": "In the pure buddha-stage, there's a water tree that moistens the buddha-stage because it's the Buddha's body.",
        "source": "T47n1976_010:0418a15_13"
    },
    {
        "source_sentence": "經中云：『是諸眾鳥，皆是阿彌陀佛變化所作。』",
        "translation": "The sūtras say, 'These are all the birds that are created by Amitâbha Buddha's transformation.'",
        "source": "T47n1976_010:0418a16_14"
    },
    {
        "source_sentence": "《智度論》曰：『眾生甚多，若佛處處現身，眾生不信謂為幻化，心不敬重；",
        "translation": "The Zhidu lun says: Many sentient beings see buddhas everywhere manifesting their bodies. Sentient beings do not believe them to be magical emanations, and they do not revere them.",
        "source": "T47n1976_010:0418a17_15"
    },
    {
        "source_sentence": "有眾生從人聞法，心不開悟，若從畜生聞法，則便信受。",
        "translation": "If there are sentient beings who hear the Dharma from someone, their minds aren't enlightened, and if they hear the Dharma from an animal, then they'll believe it.",
        "source": "T47n1976_010:0418a18_16"
    },
    {
        "source_sentence": "如《本生經》說：菩薩受畜生身為人說法，人以說法希有故，無不信受。",
        "translation": "As the Original Birth Sutra explains, a bodhisattva receives the teaching of the Dharma in the form of an animal as a human being, and people rarely believe it because they teach it.",
        "source": "T47n1976_010:0418a20_17"
    },
    {
        "source_sentence": "有人謂畜生是有情之物，以樹木無心而有音聲，則皆信受。』",
        "translation": "Some people say that animals are the property of sentient beings, but because trees and trees lack mind and have sounds, they all believe them.'",
        "source": "T47n1976_010:0418a21_18"
    },
    {
        "source_sentence": "以是故水樹禽鳥，皆是佛身變現故。",
        "translation": "That's why the water, trees, birds, and birds are all manifestations of the Buddha's body.",
        "source": "T47n1976_010:0418a23_0"
    },
    {
        "source_sentence": "若佛壽量有盡者，道場國土及諸水鳥音聲，亦應有盡。",
        "translation": "If the Buddha's life span were finite, there would be an infinity of the sounds of the land of enlightenment and the sounds of water birds.",
        "source": "T47n1976_010:0418a23_1"
    },
    {
        "source_sentence": "若有盡者，不應有補；",
        "translation": "If it were inexhaustible, there would be no replenishment.",
        "source": "T47n1976_010:0418a25_2"
    },
    {
        "source_sentence": "若無盡者，不應言滅。",
        "translation": "If it is inexhaustible, one should not say that it perishes.",
        "source": "T47n1976_010:0418a25_3"
    },
    {
        "source_sentence": "如虛空分齊，非有分齊，非無分齊，以不思議智照之可得。」",
        "translation": "It's like the partial limitation of space, which is neither partial nor non-partial, and it can be obtained by illuminating it with inconceivable wisdom.",
        "source": "T47n1976_010:0418a26_4"
    },
    {
        "source_sentence": "四、花輪大小者，小本曰：「池中蓮華，大如車輪。」",
        "translation": "4. Regarding the size of the flower wheel, the lesser version says, The lotus flowers in the pond are as large as a chariot wheel.",
        "source": "T47n1976_010:0418a28_0"
    },
    {
        "source_sentence": "《觀經》云：「一一池中有六十億七寶蓮華，團圓正等，十二由旬。」",
        "translation": "The Avalokitêśvara Sutra says, In each pond there are sixty billion seven-jeweled lotus flowers, which are twelve yojanas in circumference.",
        "source": "T47n1976_010:0418a29_0"
    },
    {
        "source_sentence": "大本云：「池中蓮華，或一由旬，乃至百由旬千由旬。」",
        "translation": "The Mahāprajñāpāramitā says, A lotus flower in a pond may be one yojana long... up to a hundred yojanas and a thousand yojanas long.",
        "source": "T47n1976_010:0418b01_1"
    },
    {
        "source_sentence": "夫人世車輪，大不逾丈，縱復輪王千輻金輪，縱廣不過一由旬，何得大小相懸乃爾？",
        "translation": "The wheel of the World-honored One’s chariot is not more than one zhang in size. Even if it were to go on like a thousand-spoked golden wheel, no more than one yojana long and wide, how could it be so big and small?",
        "source": "T47n1976_010:0418b02_2"
    },
    {
        "source_sentence": "釋：「花輪大小亦如身城，以眾生機有大小故，身城水樹現有大小，蓮華亦然。",
        "translation": "Explanation: The size of the flower wheel is also like the size of the body castle, because sentient beings have different sizes for their abilities, and the body castle, water, tree, and lotus are both large and small.",
        "source": "T47n1976_010:0418b04_3"
    },
    {
        "source_sentence": "如初地化百佛剎，見佛百葉花；",
        "translation": "For example, in the first stage of enlightening beings at one hundred buddha-lands they see the Buddha’s flower with a hundred petals.",
        "source": "T47n1976_010:0418b06_4"
    },
    {
        "source_sentence": "二地化千佛剎，即見千葉；",
        "translation": "In the second stage he manifested a thousand buddha-lands, that is to say, he saw a thousand leaves.",
        "source": "T47n1976_010:0418b06_5"
    },
    {
        "source_sentence": "三地萬葉；",
        "translation": "The third is the myriad leaves of the earth.",
        "source": "T47n1976_010:0418b07_6"
    },
    {
        "source_sentence": "四地億葉；",
        "translation": "The fourth is the earth of billions of leaves.",
        "source": "T47n1976_010:0418b07_7"
    },
    {
        "source_sentence": "五地千億；",
        "translation": "In the fifth stage there are a thousand koṭis.",
        "source": "T47n1976_010:0418b07_8"
    },
    {
        "source_sentence": "六地百千億；",
        "translation": "a hundred trillion in the sixth stage;",
        "source": "T47n1976_010:0418b08_9"
    },
    {
        "source_sentence": "七地百千億那由他；",
        "translation": "In the seventh stage it is a hundred thousand koṭis of nayutas.",
        "source": "T47n1976_010:0418b08_10"
    },
    {
        "source_sentence": "八地百千萬三千大千世界微塵數；",
        "translation": "In the eighth stage there were as many as atoms in one hundred million, three thousand great chiliocosms.",
        "source": "T47n1976_010:0418b08_11"
    },
    {
        "source_sentence": "九地百千萬億阿僧祇國土微塵數；",
        "translation": "In the ninth stage there were as many as atoms in a hundred thousand myriads of koṭis of incalculable lands.",
        "source": "T47n1976_010:0418b09_12"
    },
    {
        "source_sentence": "十地十不可說百千億那由他佛微塵數。",
        "translation": "In the tenth ground, there are ten ineffable hundreds of thousands of koṭis of nayutas of buddha-tiny dust motes.",
        "source": "T47n1976_010:0418b10_13"
    },
    {
        "source_sentence": "以自受用身有大小故，見花亦爾，非是花有大小故。",
        "translation": "It is because the body of self-enjoyment has a large and small size. The same applies to the vision of a flower: not because the flower has a large and small size.",
        "source": "T47n1976_010:0418b11_14"
    },
    {
        "source_sentence": "甞聞僧言：『海邊有阿育王舍利塔，眾生見者光明各異，有見無光者，",
        "translation": "The monks said, “At the seashore there is a stupa containing the relics of King Aśoka’s relic bones. All sentient beings who see it have different light but those who do not see it differ in their brightness.",
        "source": "T47n1976_010:0418b12_15"
    },
    {
        "source_sentence": "有見光如細豆許者，有見如棗炬者，有見如指頂大者，有見大如斗者，",
        "translation": "Some see it shining like fine beans, some see it as a jujube torch, some see it as large as the top of their fingers, and some see it as big as a dipper.",
        "source": "T47n1976_010:0418b14_16"
    },
    {
        "source_sentence": "如斗者千不一見。』",
        "translation": "Like a dipper, it's not the same as a thousand views.'",
        "source": "T47n1976_010:0418b15_17"
    },
    {
        "source_sentence": "眾生同一肉眼所見尚異，何況菩薩聲聞乃至人天等，功用懸絕，所感花輪，",
        "translation": "Sentient beings see with the same physical eye but different, so why wouldn't bodhisattvas, śrāvakas, humans, gods, and so forth? Why wouldn't they see with the flower wheels that are sensed when their effort is cut off?",
        "source": "T47n1976_010:0418b16_18"
    },
    {
        "source_sentence": "焉得不殊。",
        "translation": "How could it not be different?",
        "source": "T47n1976_010:0418b18_0"
    },
    {
        "source_sentence": "如此土中剎利貴種，飛樓傑閣遍滿城邑；",
        "translation": "In such a land the kṣatriyas were of noble caste, flying high towers filled the cities.",
        "source": "T47n1976_010:0418b18_1"
    },
    {
        "source_sentence": "寒微煢子，敝茅土窟乃至不得，不應難言大小懸殊。",
        "translation": "It's not difficult to say that there's a difference between the small and large size of the cold, even if it doesn't go so far as to dip into a cedar-grasss Cave.",
        "source": "T47n1976_010:0418b19_2"
    },
    {
        "source_sentence": "何故？",
        "translation": "Why is it so?",
        "source": "T47n1976_010:0418b20_3"
    },
    {
        "source_sentence": "是自福德所招故。",
        "translation": "It's because it's brought about by one's own merit.",
        "source": "T47n1976_010:0418b20_4"
    },
    {
        "source_sentence": "寶池花相，應亦如是。」",
        "translation": "The flower shape of the jeweled pond should be likewise.",
        "source": "T47n1976_010:0418b20_5"
    },
    {
        "source_sentence": "五、日月有無者，諸本或言日月虛空；",
        "translation": "5. “The sun and moon are both present and absent”: The scriptures sometimes speak of the sun and moon as space.",
        "source": "T47n1976_010:0418b22_0"
    },
    {
        "source_sentence": "或言處空而不運轉；",
        "translation": "Some say the sphere is empty but does not evolve.",
        "source": "T47n1976_010:0418b22_1"
    },
    {
        "source_sentence": "或不言有無；",
        "translation": "They may or may not speak of existence or nonexistence.",
        "source": "T47n1976_010:0418b23_2"
    },
    {
        "source_sentence": "或直言無有。",
        "translation": "Or they may simply say there's nothing.",
        "source": "T47n1976_010:0418b23_3"
    },
    {
        "source_sentence": "又經曰：「彼佛光明普照佛剎，無量無數不可思議，映蔽日月。",
        "translation": "The sūtra also says, That Buddha's ray of light universally illuminates the Buddha's buddha-stage, which is immeasurable, countless, and inconceivable, and it eclipses the sun and moon.",
        "source": "T47n1976_010:0418b23_4"
    },
    {
        "source_sentence": "諸聲聞眾皆有身光，能照一尋；",
        "translation": "The assembly of śrāvakas all had bodily light that illuminated the entire area.",
        "source": "T47n1976_010:0418b25_5"
    },
    {
        "source_sentence": "菩薩光照極百千尋；",
        "translation": "The enlightening being’s light illumines a hundred thousand worlds.",
        "source": "T47n1976_010:0418b26_0"
    },
    {
        "source_sentence": "二菩薩光明，常照三千大千世界。」",
        "translation": "The second is the bodhisattva's light, which always shines brightly throughout the 3,000 great one-thousand worlds.",
        "source": "T47n1976_010:0418b26_1"
    },
    {
        "source_sentence": "如是雖有日月，如爝火之處太陽，豈有光照？",
        "translation": "Thus, even though the sun and moon exist, just like the sun at the place where a fire is burned, how could there be light illumination?",
        "source": "T47n1976_010:0418b27_2"
    },
    {
        "source_sentence": "若日月不能照者，應無晝夜。",
        "translation": "If the sun and moon can't illuminate, there should be no day or night.",
        "source": "T47n1976_010:0418b28_3"
    },
    {
        "source_sentence": "何故？",
        "translation": "Why is it so?",
        "source": "T47n1976_010:0418b28_4"
    },
    {
        "source_sentence": "經言晝夜六時，及與清旦食時等事，明知亦是權說，借此晝夜喻彼時分，",
        "translation": "The Sūtra teaches that the days and nights are divided into six seasons, day and night. It also makes clear that such matters as the time of day and night and the time of rising at dawn and in the morning when one eats constitute a provisional explanation.",
        "source": "T47n1976_010:0418b29_0"
    },
    {
        "source_sentence": "非為實事。",
        "translation": "It's not a real thing.",
        "source": "T47n1976_010:0418c01_1"
    },
    {
        "source_sentence": "且晝夜往來者，是眾生心明暗傾奪感有此相，故淨佛國土，不應有此。",
        "translation": "Moreover, the coming and going of day and night means that sentient beings' minds are overwhelmed by ignorance and darkness because they have these characteristics; therefore, the pure Buddha land shouldn't have such a characteristic.",
        "source": "T47n1976_010:0418c01_2"
    },
    {
        "source_sentence": "如忉利而上，尚不假明日月，何況極樂？",
        "translation": "It's like the moon rising above Trāyastriṃśa Heaven, which doesn't even need the next moon, so why wouldn't it need the ultimate bliss?",
        "source": "T47n1976_010:0418c03_3"
    },
    {
        "source_sentence": "縱令有者，亦是彼化國眾生，色空見未盡，現有如是日月相故，而實佛土，",
        "translation": "Even if it were to exist, it would still be the sentient beings of those buddha-lands. Their views of form and space would not be exhausted because they show such images of the sun and moon that are real buddha-lands.",
        "source": "T47n1976_010:0418c04_4"
    },
    {
        "source_sentence": "無有日月。",
        "translation": "There's no sun or moon.",
        "source": "T47n1976_010:0418c06_5"
    },
    {
        "source_sentence": "如《大論》曰：「釋迦文佛更有淨國土如阿彌陀佛；",
        "translation": "As the Mahāprajñāpāramitā-sūtra explains, “The Buddha Śākyamuni has a pure land like that of Amitâbha.",
        "source": "T47n1976_010:0418c06_6"
    },
    {
        "source_sentence": "阿彌陀佛亦有不嚴淨國如釋迦文佛。」",
        "translation": "Amitâbha Buddha also has an impure land like Śākyamuni Buddha.",
        "source": "T47n1976_010:0418c07_7"
    },
    {
        "source_sentence": "此隨機感說，亦不妨說有故。",
        "translation": "It is also not necessary to say that it exists.",
        "source": "T47n1976_010:0418c08_8"
    },
    {
        "source_sentence": "六、二乘有無者，問：「天親菩薩無量壽偈曰：『大乘善根界，等無譏嫌名。』",
        "translation": "6. If the two vehicles have or don't, he asked, The gods and relatives of the bodhisattvas of immeasurable longevity said in the verse, 'The great vehicle good root realm is equally without the name of blameworthy.'",
        "source": "T47n1976_010:0418c09_0"
    },
    {
        "source_sentence": "乃至『不聞二乘名，何況有實是？』",
        "translation": "It goes so far as to say, 'If you don't hear the names of the two vehicles, how could there be a real one?'",
        "source": "T47n1976_010:0418c10_1"
    },
    {
        "source_sentence": "諸經中皆言：『國土聲聞不可稱量。』",
        "translation": "The sūtras all say, 'The land of śrāvakas in the land can't be measured.'",
        "source": "T47n1976_010:0418c11_2"
    },
    {
        "source_sentence": "何故？」",
        "translation": "Why is that?",
        "source": "T47n1976_010:0418c12_0"
    },
    {
        "source_sentence": "釋：「先德云：『二乘生者，皆是臨終回小向大，以習小功深，聞佛所說及風柯水響，",
        "translation": "Explanation: The ancients said, 'The two-vehicle living beings are all those who return to the lesser at the end of life and turn toward the greater in order to cultivate the depth of merit of the lesser, hearing what the Buddha teaches and the sound of wind and water.",
        "source": "T47n1976_010:0418c12_1"
    },
    {
        "source_sentence": "皆演小故，暫證小果漸次增進，至菩薩位，非是住小。』",
        "translation": "Because they all expound the lesser, they temporarily realize the lesser fruit gradually and gradually increase until they reach the bodhisattva stage, which isn't abiding in the lesser.'",
        "source": "T47n1976_010:0418c13_2"
    },
    {
        "source_sentence": "是故說無二乘者，有二義：一是決定二乘不生，是寔無故；",
        "translation": "Therefore, it is said that there are no two vehicles. The first has two meanings. The first is certain that the two vehicles will not arise:",
        "source": "T47n1976_010:0418c15_3"
    },
    {
        "source_sentence": "二是不住二乘，是畢竟無故。",
        "translation": "The second is that they don't abide in the two vehicles, which are ultimately nonexistent.",
        "source": "T47n1976_010:0418c16_4"
    },
    {
        "source_sentence": "辟如二人同官郎署，一人官止于此，一人將遷。",
        "translation": "It was just as if they were two officials in the same office, with one of them staying here while the other was about to leave.",
        "source": "T47n1976_010:0418c17_5"
    },
    {
        "source_sentence": "止郎署者，可以稱郎，以無後官故；",
        "translation": "Those who stayed at the office of a layman could be called a layman because there were no officials to follow them.",
        "source": "T47n1976_010:0418c18_6"
    },
    {
        "source_sentence": "將遷官者，不定是即，以即畢竟改故。",
        "translation": "The official who's about to move is indeterminate, which is because it's the ultimate change.",
        "source": "T47n1976_010:0418c18_7"
    },
    {
        "source_sentence": "以是故淨土不得言有二乘，以畢竟至菩薩位故。」",
        "translation": "Because of this, the Pure Land can't say there are two vehicles because it ultimately reaches the bodhisattva stage.",
        "source": "T47n1976_010:0418c19_8"
    },
    {
        "source_sentence": "七、婦女有無者，《聲王經》中阿彌陀佛，亦有父母，何得言無女人？",
        "translation": "7. If a woman exists or doesn't exist, how can it be said that there are no women in the sound king sūtras when Amitâbha Buddha has parents?",
        "source": "T47n1976_010:0418c21_0"
    },
    {
        "source_sentence": "釋此亦化作，如化鸚鵡。",
        "translation": "This explains that it's also made by transformation, like a transformed parrot.",
        "source": "T47n1976_010:0418c22_1"
    },
    {
        "source_sentence": "《海東疏》曰：「《聲王經》說安樂世界阿彌陀佛有父母者，是變化女非寔報女；",
        "translation": "The Haeong' s commentary says: The Sound King Sutra teaches that Amitâbha Buddha in the world of bliss has parents.",
        "source": "T47n1976_010:0418c23_0"
    },
    {
        "source_sentence": "又復雖有父母，而非胎生，實是化生，假為父母。",
        "translation": "Furthermore, even though they have parents, they aren't born from the womb, are really born by transformation, and are nominally parents.",
        "source": "T47n1976_010:0418c24_1"
    },
    {
        "source_sentence": "如彼經言：『若四眾能正受佛之名號，以此功德臨命終時，阿彌陀佛即與大眾，",
        "translation": "As the scripture says: When the fourfold assembly is able to receive the Buddha’s name, and when their lives come to an end because of this merit, the holy Amitābha Buddha will give it to the assembly.",
        "source": "T47n1976_010:0418c25_2"
    },
    {
        "source_sentence": "住此人所令其得見；",
        "translation": "They abide in the presence of these people and cause them to be able to see.",
        "source": "T47n1976_010:0418c27_3"
    },
    {
        "source_sentence": "見已慶悅倍增功德，以是因緣所生之處，永離胞胎穢欲之形，純處鮮妙寶蓮花中，",
        "translation": "Having seen it, they rejoiced and doubled in their virtue. Because of these causes and conditions, wherever they were born, forever leaving the defiled form of apparitional beings, they remained purely among the lotus blossoms of exquisitely jeweled lotus flowers.",
        "source": "T47n1976_010:0418c28_4"
    },
    {
        "source_sentence": "自然化生，具大神通光明赫奕。』",
        "translation": "They are naturally transformed and born, endowed with great supernormal powers and brilliant light.'",
        "source": "T47n1976_010:0419a01_0"
    },
    {
        "source_sentence": "當知父母假寄之耳。」",
        "translation": "You should know that your parents are sending it to you nominally.",
        "source": "T47n1976_010:0419a01_1"
    },
    {
        "source_sentence": "或說《聲王經》中說有父母，是顯彼佛所住穢土。",
        "translation": "Some say that the Sound King Sutra says there are parents, which shows that the Buddha lives in a defiled land.",
        "source": "T47n1976_010:0419a02_2"
    },
    {
        "source_sentence": "是義不然。",
        "translation": "This doesn't make sense.",
        "source": "T47n1976_010:0419a03_3"
    },
    {
        "source_sentence": "何故？",
        "translation": "Why is it so?",
        "source": "T47n1976_010:0419a03_4"
    },
    {
        "source_sentence": "彼經既說寶蓮化生，又言二菩薩侍立左右，此等悉是淨土相，不異《觀經》所說故。",
        "translation": "Since that sūtra teaches that the jeweled lotus is born by transformation, and it also says that two bodhisattvas stand at his or her sides with attendants, these are all characteristics of the Pure Land, which aren't different from those taught in the contemplation sūtras.",
        "source": "T47n1976_010:0419a03_5"
    },
    {
        "source_sentence": "當知彼經所說，提婆達多及魔王等，悉于淨土變化所作，不由此等為非淨土，",
        "translation": "You should know that the scripture teaches that Devadatta and Māra king, etc., are all created by magical transformations in the pure land, not because of these things as non-pure lands.",
        "source": "T47n1976_010:0419a05_6"
    },
    {
        "source_sentence": "如化畜生非穢土故。",
        "translation": "It's because it's like transforming animals that aren't defiled lands.",
        "source": "T47n1976_010:0419a07_7"
    },
    {
        "source_sentence": "八、發心大小者，魏譯三輩之中，皆有發菩提心，《觀經》下品，直言十念。",
        "translation": "8. Those who arouse the intention for enlightenment, large and small, are all of the three groups of people in the Wei translation who have arisen the intention for enlightenment, and the lower part of the Avalokitêśvara Sutra simply says ten kinds of mindfulness.",
        "source": "T47n1976_010:0419a08_0"
    },
    {
        "source_sentence": "諸經互異，今欲知會者，諸經皆是發大菩提心以為因故。",
        "translation": "The sūtras differ from each other, but now I want to know that the assembly is because all the sūtras give rise to the great mind of enlightenment as their cause.",
        "source": "T47n1976_010:0419a09_1"
    },
    {
        "source_sentence": "何故？",
        "translation": "Why is it so?",
        "source": "T47n1976_010:0419a10_2"
    },
    {
        "source_sentence": "若是最初無大因者，其人雖復經耳，亦生疑難，何得頓聞頓信？",
        "translation": "If this is the first one who doesn't have a great cause, then even though he has the ear to recite it, he'll also have doubts and difficulties, so how can he suddenly hear it and believe it?",
        "source": "T47n1976_010:0419a10_3"
    },
    {
        "source_sentence": "是故當知下品十念者，亦是宿植大因，後生退墮，故其臨終遇善知識，",
        "translation": "Therefore, you should know that the lower-level ten kinds of mindfulness are also the great causes for planting good roots in the past. Because later beings regress and fall back, they will meet a good teacher at their deathbed.",
        "source": "T47n1976_010:0419a12_4"
    },
    {
        "source_sentence": "如旱苗得雨，萌芽頓發故。",
        "translation": "It's like when a drought seedling gets rain, the sprouting sprouts suddenly arise.",
        "source": "T47n1976_010:0419a13_5"
    },
    {
        "source_sentence": "若無因者，知識尚不得遇，何況信受。",
        "translation": "If there's no cause, then the consciousness still won't be able to meet it, so why wouldn't it be possible to believe it?",
        "source": "T47n1976_010:0419a14_6"
    },
    {
        "source_sentence": "如聰慧貴遊之士，多有愈聞愈不信者，即知一聞頓念，非是小緣，不應以一生作惡，",
        "translation": "Good man, this is analogous to the case of a learned and noble traveler. If there are many people who neither hear [the Dharma] nor believe in it, they will immediately know that what they have heard is not a trivial condition; they should not do evil for one lifetime.",
        "source": "T47n1976_010:0419a15_7"
    },
    {
        "source_sentence": "便謂此人無大因故。",
        "translation": "It's because this person has no great cause.",
        "source": "T47n1976_010:0419a17_8"
    },
    {
        "source_sentence": "經云：「世間人民，得聞阿彌陀名號，若慈心喜悅，毛髮聳然，淚即出者，",
        "translation": "The sūtra says, When the people of the world hear the name Amitâbha, their minds are compassionate and joyous, their hair stands on end in tears.",
        "source": "T47n1976_010:0419a17_9"
    },
    {
        "source_sentence": "皆是累世嘗行佛道，或他方佛所嘗為菩薩。」",
        "translation": "They've all practiced the Buddha Way for generations, or they've been bodhisattvas since the buddhas of other directions.",
        "source": "T47n1976_010:0419a19_10"
    },
    {
        "source_sentence": "是故不論顓愚黠慧，凡至心念佛者，皆是多劫深植善根，發大菩提心故。",
        "translation": "That's why anyone who wholeheartedly recites the Buddha's name regardless of their ignorance, foolishness, and wiseness is someone who has cultivated good roots for many eons and aroused the great mind of enlightenment.",
        "source": "T47n1976_010:0419a20_11"
    },
    {
        "source_sentence": "何故？",
        "translation": "Why is it so?",
        "source": "T47n1976_010:0419a22_12"
    },
    {
        "source_sentence": "所謂善根者，不專言智慧，若復無根，如種焦穀，豈有芽出？",
        "translation": "The so-called good roots aren't exclusively words of wisdom, and if there are no roots, like planting scorched grain, how could there be sprouts that come out?",
        "source": "T47n1976_010:0419a22_13"
    },
    {
        "source_sentence": "如世間弈棋小事，有無知賤流，頓學頓精者；",
        "translation": "Good man, it is like a minor matter in the world of chess and board games. There are those who are ignorant and have lowly tendencies to despise others. They may study and concentrate all at once or at once.",
        "source": "T47n1976_010:0419a23_14"
    },
    {
        "source_sentence": "有智士習之，終身居末品者，即知是因。",
        "translation": "A wise person who cultivates it and abides in the latter part of his body for the rest of his life knows this is the cause.",
        "source": "T47n1976_010:0419a24_15"
    },
    {
        "source_sentence": "小枝無因，尚不得入，何況大法？",
        "translation": "The smallest branch has no cause, so they still can't enter it, so why wouldn't the great teaching?",
        "source": "T47n1976_010:0419a25_16"
    },
    {
        "source_sentence": "是故若有信是希有難信之法者，是人即是大心菩薩故。",
        "translation": "Therefore, if someone believes this rare and difficult teaching, they're a great mind bodhisattva.",
        "source": "T47n1976_010:0419a26_17"
    },
    {
        "source_sentence": "九、疑城胎生者，元魏譯曰：「若有眾生，墮于疑悔，積集善根希求佛智、普遍智、不思議智、無等智、威德智、廣大智，",
        "translation": "If there are sentient beings who fall into doubt and repentance, accumulate good roots and seek buddha-knowledge, universal knowledge, inconceivable knowledge, peerless knowledge, authoritative knowledge, and vast knowledge.",
        "source": "T47n1976_010:0419a28_0"
    },
    {
        "source_sentence": "於自善根不能生信，由聞佛名起信心故，以此因緣於五百歲處花胎中，",
        "translation": "They cannot give rise to faith in their own roots of goodness, because they hear the Buddha’s name and develop faith. Because of these causes and conditions, they remain in the flowery womb for five hundred years:",
        "source": "T47n1976_010:0419b01_1"
    },
    {
        "source_sentence": "猶如苑觀宮殿之想，不見佛，不聞法，是名胎生。」",
        "translation": "It's like the perception of a garden observing a palace that doesn't see the Buddha and doesn't hear the Dharma, which is called womb birth.",
        "source": "T47n1976_010:0419b03_2"
    },
    {
        "source_sentence": "魏譯曰：「不了佛智，然猶信罪福，修習善本，願生其國，是故胎生。」",
        "translation": "The Wei translation said, They don't understand the Buddha's wisdom, but they still believe in sin and merit, cultivate good roots, and wish to be born in their country; this is the old womb birth.",
        "source": "T47n1976_010:0419b04_3"
    },
    {
        "source_sentence": "宋譯曰：「眾生所種善根，不能離相，不求佛慧，妄生分別，深著世樂，",
        "translation": "The Song dynasty translated it as follows: All the roots of goodness cultivated by living beings are not free from signs and do not seek buddha-knowledge. They give rise to false discrimination and deeply cling to worldly pleasures.",
        "source": "T47n1976_010:0419b05_4"
    },
    {
        "source_sentence": "人間福報，是故胎生。」",
        "translation": "The rewards of human merit are therefore born in the womb.",
        "source": "T47n1976_010:0419b07_5"
    },
    {
        "source_sentence": "王氏本曰：「若有眾生，修諸功德，願生彼剎，後復疑悔，不信有彼佛剎，",
        "translation": "The royal family said, If there are sentient beings who cultivate virtues and wish to be born in that buddha-stage, then later they doubt and regret not believing there is another buddha-stage.",
        "source": "T47n1976_010:0419b07_6"
    },
    {
        "source_sentence": "不信作善得福。",
        "translation": "They don't believe in doing good and attaining merit.",
        "source": "T47n1976_010:0419b09_7"
    },
    {
        "source_sentence": "其人雖爾，續有念心，暫信暫不信，臨命終時，佛乃化現其身，令彼目見。",
        "translation": "In spite of this, the man continued to have thoughts and did not believe even for a moment. When he was about to die, the Buddha magically manifested himself so that his eyes would see him.",
        "source": "T47n1976_010:0419b09_8"
    },
    {
        "source_sentence": "以心悔故，其過差少，亦生彼剎，是謂胎生。」",
        "translation": "Because of their repentance, they'll be born in that buddha with few faults, which is called birth from the womb.",
        "source": "T47n1976_010:0419b11_9"
    },
    {
        "source_sentence": "今按前二譯，但不信自性，不了佛智，名胎生故。",
        "translation": "Now, according to the first two translations, they simply don't believe in their own nature and don't understand the Buddha's wisdom, which is called womb birth.",
        "source": "T47n1976_010:0419b12_10"
    },
    {
        "source_sentence": "宋譯則直言修善求生人天者為胎生，極樂國中無胎生故。",
        "translation": "The Song translation simply says that those who cultivate goodness and seek birth among humans and gods are born from the womb, because there's no birth from the womb in the paradise country.",
        "source": "T47n1976_010:0419b13_11"
    },
    {
        "source_sentence": "若王氏則又以不信佛剎，不信罪福，暫信暫不信為胎生，異前譯中聞名起信，",
        "translation": "If the king's family doesn't believe in the buddha bases, doesn't believe in sins and merits, and doesn't believe in birth as a fetus for a while, it's different from the previous translation that they hear names and give rise to faith.",
        "source": "T47n1976_010:0419b14_12"
    },
    {
        "source_sentence": "及修習善本二種往生。",
        "translation": "They cultivate the two kinds of rebirth in the good roots.",
        "source": "T47n1976_010:0419b16_13"
    },
    {
        "source_sentence": "大約淨土中，略言九品，廣言千萬品，亦不能盡。",
        "translation": "It's roughly nine chapters in the Pure Land, and it's a thousand chapters in detail that can't be exhausted.",
        "source": "T47n1976_010:0419b17_14"
    },
    {
        "source_sentence": "如今生人中者，種種福報，種種罪業，各各不同，是故諸譯雖互異，皆為實語。",
        "translation": "Those who are now born among humans have various rewards of merit and various sins, each different from the other. Therefore, even though the translations differ, they all speak true words.",
        "source": "T47n1976_010:0419b18_15"
    },
    {
        "source_sentence": "就中元魏譯，旨趣尤奧，以不信自善根故，依他起信即是疑城。",
        "translation": "The meaning of the Zhongyuan and Wei translations is especially profound, because they don't believe in their own good roots, and to rely on others to give rise to faith is the city of doubt.",
        "source": "T47n1976_010:0419b20_16"
    },
    {
        "source_sentence": "信自善根者，即頓了自心不從他得，以入悟方能脫疑。",
        "translation": "A person who believes in their own good roots suddenly understands that his own mind doesn't obtain them from others, and it's only when he enters enlightenment that he can free himself from doubt.",
        "source": "T47n1976_010:0419b21_17"
    },
    {
        "source_sentence": "是故未悟而修，終隔疑胎。",
        "translation": "Therefore, they cultivate it without awakening and are ultimately freed from the womb of doubt.",
        "source": "T47n1976_010:0419b22_18"
    },
    {
        "source_sentence": "胎以裹蔽為義，未悟之人，諸障未徹，合得是報。",
        "translation": "The womb has the meaning of wrapping and obstruction, but those who haven't yet awakened are hindered by hindrances that haven't penetrated, so they'll attain this result.",
        "source": "T47n1976_010:0419b23_19"
    },
    {
        "source_sentence": "此等當在中下、下上品攝，何故？",
        "translation": "Why are these to be included in the middle, the lower and the lower classes?",
        "source": "T47n1976_010:0419b24_20"
    },
    {
        "source_sentence": "下品後二種，經歷六劫、十二劫方得花開，此但五百歲故。",
        "translation": "The last two kinds in the lower class can be bloomed after six kalpas and twelve kalpas, because these are only five hundred years.",
        "source": "T47n1976_010:0419b25_21"
    },
    {
        "source_sentence": "若如王本，則信佛猛利未若最後二種。",
        "translation": "If it's like the king's text, then faith in the Buddha's fierceness isn't as strong as the last two kinds.",
        "source": "T47n1976_010:0419b26_22"
    },
    {
        "source_sentence": "又所生在其剎邊地，不應五百歲得見佛故。",
        "translation": "It's also because what's produced in the peripheral land of that buddha shouldn't be able to see the Buddha for five hundred years.",
        "source": "T47n1976_010:0419b27_23"
    },
    {
        "source_sentence": "十、五逆往生者，《大經》曰：「唯除造五無間惡業，誹謗正法及諸聖人。」",
        "translation": "10. The five heinous rebirths, the Mahāprajñāpāramitā-sūtra says, They only remove the five kinds of unremitting bad actions that denigrate the right teaching and the sages.",
        "source": "T47n1976_010:0419b29_0"
    },
    {
        "source_sentence": "《觀經》則五逆十惡，臨終十念，皆得往生。",
        "translation": "The Avalokitêśvara Sutra explains that the five heinous crimes and ten evil deeds will all be reborn at the end of their lives in ten moments of thought.",
        "source": "T47n1976_010:0419c01_1"
    },
    {
        "source_sentence": "當知《大經》揀五逆者，以誹謗故。",
        "translation": "You should know that the Mahāprajñāpāramitā-sūtra selects five heinous crimes because it denigrates them.",
        "source": "T47n1976_010:0419c02_2"
    },
    {
        "source_sentence": "何故？",
        "translation": "Why is it so?",
        "source": "T47n1976_010:0419c03_3"
    },
    {
        "source_sentence": "入淨土以信為導師，誹謗是信之賊。",
        "translation": "They enter the Pure Land with faith as their guide and denigrate this thief of faith.",
        "source": "T47n1976_010:0419c03_4"
    },
    {
        "source_sentence": "如水無所不容但不容火，以火自不能容故；",
        "translation": "It is like water that cannot hold water but does not allow fire, because fire itself cannot hold it.",
        "source": "T47n1976_010:0419c04_5"
    },
    {
        "source_sentence": "如風無所不入但不入石，以石自不堪入故。",
        "translation": "It's like a wind that doesn't enter anything but doesn't enter a stone because the stone is unable to enter it on its own.",
        "source": "T47n1976_010:0419c05_6"
    },
    {
        "source_sentence": "誹謗之人，燒正法如猛焰，障佛智如鐵壁，是故法海慧風，無因得受。",
        "translation": "A person who denigrates the right teaching burns it like a fierce flame and hinders Buddha's wisdom like an iron wall; therefore, there's no reason to receive the Dharma ocean of wisdom that wind of wisdom can't be received.",
        "source": "T47n1976_010:0419c06_7"
    },
    {
        "source_sentence": "《觀經》揀誹謗不揀五逆者，義同文異。",
        "translation": "The Avalokitêśvara Sutra selects those who denigrate and don't select the five heinous crimes, which have the same meaning but differ in text.",
        "source": "T47n1976_010:0419c07_8"
    },
    {
        "source_sentence": "以五逆雖至惡，尚無決定不信之見，不應揀故。",
        "translation": "Even though the five heinous crimes are so great as to be bad, there's still no definite view of not believing them, which shouldn't be selected.",
        "source": "T47n1976_010:0419c08_9"
    },
    {
        "source_sentence": "然有大心之人，始或不信，後因啟發，猛省前失。",
        "translation": "Still, there are people with great minds who may not believe in it at first but then give rise to it and vigorously reflect on the errors of the past.",
        "source": "T47n1976_010:0419c09_10"
    },
    {
        "source_sentence": "如韓昌黎始斥佛骨，後歸依大顛；",
        "translation": "It is like the case of Han Changli, who first repudiated the Buddha’s bones and later relied on Mahayana Buddhism.",
        "source": "T47n1976_010:0419c10_11"
    },
    {
        "source_sentence": "張無盡初詆佛書，欲著無佛論，後觀《淨名經》，大有省發，卒為宗門龍象，",
        "translation": "Zhang Wuzhi first criticized the Buddhist scriptures and wished to write a treatise on the non-Buddhist theories. Later he studied the Jingming jing (Samantabhadra Sutra) with great deliberation, but in vain he became a dragon or elephant of the sect.",
        "source": "T47n1976_010:0419c11_12"
    },
    {
        "source_sentence": "尤是法中希有之事。",
        "translation": "It's especially rare in the Dharma.",
        "source": "T47n1976_010:0419c13_13"
    },
    {
        "source_sentence": "是故儒林英特，或有謬聽先入，誤謗佛法，但速圖改悔，即是盛事，不應以謗為障難故。",
        "translation": "That's why Confucianism is so distinguished, and some people who mistakenly hear the first entry and misrepresent the Buddha's teaching but quickly change their minds because it's a great thing that shouldn't be used as an obstruction to denigrate it.",
        "source": "T47n1976_010:0419c13_14"
    },
    {
        "source_sentence": "西方合論卷之十(終)",
        "translation": "combined treatise on the Western Regions, Volume 10 (end)",
        "source": "T47n1976_010:0419c16_0"
    }
]