[
    {
        "source_sentence": "西方合論卷之二",
        "translation": "combined Treatise on the Western Regions, Volume 2",
        "source": "T47n1976_002:0392b02_0"
    },
    {
        "source_sentence": "第二緣起門",
        "translation": "second aspect of dependent arising",
        "source": "T47n1976_002:0392b04_0"
    },
    {
        "source_sentence": "夫樂鮑肆者，不念檀旃；",
        "translation": "Those who enjoy eating at the potionhouse are not mindful of giving almsfood.",
        "source": "T47n1976_002:0392b05_0"
    },
    {
        "source_sentence": "非實不念，以不厭故。",
        "translation": "It's not really non-mindful because they aren't disillusioned.",
        "source": "T47n1976_002:0392b05_1"
    },
    {
        "source_sentence": "乍使引之晤室，熱旃炙沈，不終日而悲其昔之穢，厭離之不早也！",
        "translation": "At first, the envoy led him to his room, where he was tormented by fever and torpor. He did so for a long time but lamented the filthiness of his past deeds; it is not too early to part with them!",
        "source": "T47n1976_002:0392b06_0"
    },
    {
        "source_sentence": "夫生死臭穢，愈於鮑肆，眾生貪嗜，倍彼蠅蚋；",
        "translation": "The foulsmelling odor of birth and death is healed in the pond. Sentient beings are greedy, doubling the number of gnats and flies there.",
        "source": "T47n1976_002:0392b07_1"
    },
    {
        "source_sentence": "諸佛為鬻香長者，見一輩人天，沒溺濁海，能不惻然？",
        "translation": "When the Buddhas see a group of people and gods submerged in the sea of fragrance, can they not be confused?",
        "source": "T47n1976_002:0392b08_2"
    },
    {
        "source_sentence": "是故阿彌導師，廣開香嚴之肆；",
        "translation": "That is why the Guide Amitâbha opened a great pavilion of fragrance and adornment.",
        "source": "T47n1976_002:0392b09_3"
    },
    {
        "source_sentence": "釋迦慈父，確指淨域之門。",
        "translation": "The Śākyamuni's compassionate father clearly pointed to the gate of the Pure Land.",
        "source": "T47n1976_002:0392b10_4"
    },
    {
        "source_sentence": "盡大地無非貧兒，一佛號便為資本。",
        "translation": "The whole land is nothing but a poor child, and one Buddha's name is capital.",
        "source": "T47n1976_002:0392b10_5"
    },
    {
        "source_sentence": "欲驗誠言，莫離十念；",
        "translation": "Those who wish to test their sincerity of words should not leave the ten kinds of thoughts.",
        "source": "T47n1976_002:0392b11_6"
    },
    {
        "source_sentence": "塞鼻膻腥，久當自厭。",
        "translation": "Your nose is stuck in a bad smell and you will soon become disgusted with it.",
        "source": "T47n1976_002:0392b12_7"
    },
    {
        "source_sentence": "今約西方起教，略分十義：一、一大事故。",
        "translation": "Now, we'll briefly divide the teaching that arises in the West into ten meanings: 1. a great matter.",
        "source": "T47n1976_002:0392b12_8"
    },
    {
        "source_sentence": "　二、宿因深故。",
        "translation": "2. because of the depth of past causes.",
        "source": "T47n1976_002:0392b14_9"
    },
    {
        "source_sentence": "三、顯果德故。",
        "translation": "3. because it reveals the virtue of the result.",
        "source": "T47n1976_002:0392b15_0"
    },
    {
        "source_sentence": "　四、依因性故。",
        "translation": "4. because it relies on the causal nature.",
        "source": "T47n1976_002:0392b15_1"
    },
    {
        "source_sentence": "五、順眾生故。",
        "translation": "5. because it follows sentient beings.",
        "source": "T47n1976_002:0392b16_0"
    },
    {
        "source_sentence": "　六、穢相空故。",
        "translation": "6. because the characteristic of defilement is empty...",
        "source": "T47n1976_002:0392b16_1"
    },
    {
        "source_sentence": "七、勝方便故。",
        "translation": "7. because of superior skillful means...",
        "source": "T47n1976_002:0392b17_0"
    },
    {
        "source_sentence": "　八、導二乘故。",
        "translation": "8. because it guides the two vehicles.",
        "source": "T47n1976_002:0392b17_1"
    },
    {
        "source_sentence": "九、堅忍方故。",
        "translation": "9. because it's the only place where firm forbearance exists.",
        "source": "T47n1976_002:0392b18_0"
    },
    {
        "source_sentence": "　十、示真法故。",
        "translation": "10. because it shows the true teaching.",
        "source": "T47n1976_002:0392b18_1"
    },
    {
        "source_sentence": "一、一大事者，眾生處五濁世，如因處獄，但以罪之輕重，受等不等罰。",
        "translation": "1. One great matter is that sentient beings are in the five turbid worlds, such as when they're sentenced to jail because of their sins but receive unequal punishments by reason of their weakness.",
        "source": "T47n1976_002:0392b19_0"
    },
    {
        "source_sentence": "或干小法、或投極網，辜雖不同，至於縲絏之苦、笞杖之罰，未有一人得免者。",
        "translation": "Even though the faults are different, there's not a single person who escapes the punishment of being beaten or caned with a stick.",
        "source": "T47n1976_002:0392b20_1"
    },
    {
        "source_sentence": "何也？",
        "translation": "What is it?",
        "source": "T47n1976_002:0392b22_2"
    },
    {
        "source_sentence": "以入獄者皆罪人；",
        "translation": "Those who enter the hells are all sinners.",
        "source": "T47n1976_002:0392b22_3"
    },
    {
        "source_sentence": "處人天者皆是業報，分段之身故也。",
        "translation": "The place humans and gods are all karmic retribution, because they're segmented bodies.",
        "source": "T47n1976_002:0392b22_4"
    },
    {
        "source_sentence": "然罪人一入獄，未有時刻不求出離者，則以知獄之煎苦難忍難堪，棘牆之外，",
        "translation": "If, however, a condemned person enters one of these hells and does not seek release from them at any moment, then he knows that the torture in hell is too great to endure and too unbearable for him.",
        "source": "T47n1976_002:0392b23_5"
    },
    {
        "source_sentence": "更有許大安樂世界故也。",
        "translation": "It's because there's another way to approve of the great peaceful world.",
        "source": "T47n1976_002:0392b25_6"
    },
    {
        "source_sentence": "今眾生以煩惱為家，以生死為園觀，繫心衣冠之囚長，適情金玉之桁楊，",
        "translation": "Sentient beings now regard defilement as their home and birth and death as their monastery. Their minds are tied up in fetters like a garland of cloth or a crown, which is made of gold and jade according to their feelings.",
        "source": "T47n1976_002:0392b25_7"
    },
    {
        "source_sentence": "豈知大鐵圍山是我棘牆，三界法場之外，各各自有家鄉田地也。",
        "translation": "Don't you know that the great iron mountain is my thorn wall, and beyond the three realms of the Dharma site, each has its own home, land, and fields?",
        "source": "T47n1976_002:0392b27_8"
    },
    {
        "source_sentence": "諸佛憫此，酸心痛骨，是故為分別淨穢，指以脫歸路程。",
        "translation": "The buddhas felt pity for this, and their hearts and bones were pained. For this reason they discerned what was pure and what was impure and pointed to the path of liberation.",
        "source": "T47n1976_002:0392b29_9"
    },
    {
        "source_sentence": "而歲久拋棄之人，了無歸處；",
        "translation": "But those who abandon it over a long period of time will realize that there is no place to turn.",
        "source": "T47n1976_002:0392c01_10"
    },
    {
        "source_sentence": "諸佛又大建宅舍以安之。",
        "translation": "The buddhas also built a large mansion to house them.",
        "source": "T47n1976_002:0392c01_11"
    },
    {
        "source_sentence": "一則往來獄門，為治道途；",
        "translation": "The first is the gate leading to and from hell in order to follow the path of correction.",
        "source": "T47n1976_002:0392c02_12"
    },
    {
        "source_sentence": "一則長伺獄外，修飾旅館。",
        "translation": "The first is to wait outside the hell for a long time and decorate the inn.",
        "source": "T47n1976_002:0392c03_13"
    },
    {
        "source_sentence": "如是之恩，何身可報？",
        "translation": "What body can I repay such kindness?",
        "source": "T47n1976_002:0392c03_14"
    },
    {
        "source_sentence": "嗟夫！",
        "translation": "What a shame!",
        "source": "T47n1976_002:0392c04_15"
    },
    {
        "source_sentence": "燭三界之長夜，揭億生之覆盆，諸佛既不惜垂手，眾生獨何苦戀戀也？",
        "translation": "The long night of the candle in the three realms and the billions of sentient beings covered the pot. Since the buddhas didn't spare their hands, why would sentient beings alone have painful attachments?",
        "source": "T47n1976_002:0392c04_16"
    },
    {
        "source_sentence": "經曰：「如來為一大事，出現於世。」",
        "translation": "The sūtra says, The Tathāgata is one great matter that appears in the world.",
        "source": "T47n1976_002:0392c05_17"
    },
    {
        "source_sentence": "大事者，即此事也。",
        "translation": "The great matter is this thing.",
        "source": "T47n1976_002:0392c06_18"
    },
    {
        "source_sentence": "眾生種種反戀此毛頭許事，以小易大，甘心瘦死，何哉？",
        "translation": "Sentient beings are variously attached to this hair, accepting things as small and changing them into large with a desire for thinness and death. What is the matter?",
        "source": "T47n1976_002:0392c07_0"
    },
    {
        "source_sentence": "二、宿因深者，有三：一者正因；",
        "translation": "“Second: The depth of the causes of former [existences]”: There are three:",
        "source": "T47n1976_002:0392c09_0"
    },
    {
        "source_sentence": "二者正願；",
        "translation": "The second is right vow.",
        "source": "T47n1976_002:0392c09_1"
    },
    {
        "source_sentence": "三者正行。",
        "translation": "The third is right practice.",
        "source": "T47n1976_002:0392c09_2"
    },
    {
        "source_sentence": "一、正因者，即是三世諸佛與諸有情，自清淨體，如萬象依空、山川依地、穀依種子、花果依仁。",
        "translation": "1. The correct cause is that the buddhas of the three times and sentient beings are themselves pure in essence, like myriad elephants relying on space, mountains and rivers relying on earth, grains relying on seeds, and flowers and fruits relying on kindness.",
        "source": "T47n1976_002:0392c10_3"
    },
    {
        "source_sentence": "若無此因，佛果不成。",
        "translation": "If there were no such cause, the Buddhahood would not arise.",
        "source": "T47n1976_002:0392c12_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T47n1976_002:0392c12_5"
    },
    {
        "source_sentence": "一切悲智，純依此因而得建立。",
        "translation": "All compassion and wisdom are established purely on the basis of this.",
        "source": "T47n1976_002:0392c12_6"
    },
    {
        "source_sentence": "故長者《合論》曰：「如來藏身，即法身也，諸福智海，莫不居中，故稱為藏。",
        "translation": "That's why it's called a store because the combined treatise of the elder says, The Tathāgata's store body is the Dharma body, and all the oceans of merit and wisdom don't reside in it; therefore, it's called a store.",
        "source": "T47n1976_002:0392c13_7"
    },
    {
        "source_sentence": "若不見法身，一切福智，大慈大悲，悉皆不辦，總屬生滅。」",
        "translation": "If someone doesn't see the Dharma body, all merits and wisdom, great kindness and compassion, and all of them are not accomplished, they'll always be subject to birth and cessation.",
        "source": "T47n1976_002:0392c15_8"
    },
    {
        "source_sentence": "法身者，即正因是。",
        "translation": "The Dharma body is the direct cause.",
        "source": "T47n1976_002:0392c16_9"
    },
    {
        "source_sentence": "二、正願者，如本經法藏比丘於自在王如來所，發四十八大願，一願不成不取菩提。",
        "translation": "The second is the right vow, as shown in the original sūtra, when a monk from the Dharma store who gives rise to the forty-eight great vows at the Tathāgata's place of sovereignty makes one vow that doesn't lead to enlightenment and doesn't take it.",
        "source": "T47n1976_002:0392c16_10"
    },
    {
        "source_sentence": "此是依自性無量悲智，發如是不可思議願力，非是心外見有眾生，發願欲度，",
        "translation": "Relying on the immeasurable compassion and wisdom of their own nature, they give rise to this inconceivable power of vows. They do not think that there are sentient beings outside their minds who give rise to these vows and want to liberate them.",
        "source": "T47n1976_002:0392c18_11"
    },
    {
        "source_sentence": "以眾生非心外故。",
        "translation": "It's because sentient beings aren't outside the mind.",
        "source": "T47n1976_002:0392c20_12"
    },
    {
        "source_sentence": "三、正行者，如本經言：「發是願已，如是安住種種功德，修習如是菩薩行，",
        "translation": "3. The correct practice is as the original sūtra says, Having made this vow, he thus abides in various merits and cultivates such bodhisattva practices.",
        "source": "T47n1976_002:0392c20_13"
    },
    {
        "source_sentence": "經於無量無數億那由他百千劫」內。",
        "translation": "Within measureless and countless hundreds of millions of billions of nayutas, it's a hundred thousand eons.",
        "source": "T47n1976_002:0392c22_14"
    },
    {
        "source_sentence": "又如《一向出生菩薩經》云：「阿彌陀佛昔為太子，聞此微妙法門奉持精進，",
        "translation": "Further, as it is said in the Sutra of the Bodhisattva Wholly Pure: Formerly, when Amitâbha Buddha was a prince, he heard this subtle doctrine and upheld it vigorously.",
        "source": "T47n1976_002:0392c23_15"
    },
    {
        "source_sentence": "七千歲中脅不至席，不念愛欲財寶，不問他事，常獨處止意不傾動；",
        "translation": "At the age of seven thousand he would not go to his seat. He would not cherish riches or possessions, nor ask questions about other affairs. He would always remain alone in solitary places without moving his thoughts.",
        "source": "T47n1976_002:0392c25_0"
    },
    {
        "source_sentence": "復教化八千億萬那由他人得不退轉。」",
        "translation": "Again, he teaches and transforms 8,000,000,000,000,000,000,000 nayutas of others to attain nonretrogression.",
        "source": "T47n1976_002:0392c26_1"
    },
    {
        "source_sentence": "此是自性行持、自性精進，非是有作、有為功德；",
        "translation": "These are self-natured practices, self-natured sustainedness and self-natured energy. They are not conditioned or conditioned qualities.",
        "source": "T47n1976_002:0392c27_2"
    },
    {
        "source_sentence": "雖歷億劫，不離一念。",
        "translation": "Even though it goes on for billions of eons, it doesn't part from a single thought.",
        "source": "T47n1976_002:0392c28_3"
    },
    {
        "source_sentence": "以微妙法門，離一切行、一切劫故。",
        "translation": "It's because the subtle dharma-gate is free of all practices and all eons.",
        "source": "T47n1976_002:0392c28_4"
    },
    {
        "source_sentence": "是謂正因、正行、正願，如伊三點，缺一不成；",
        "translation": "These are said to be the right cause, the right action and the right vow. Just as in the case of the three dots [on the letter i], there is missing one that is not settled.",
        "source": "T47n1976_002:0392c29_5"
    },
    {
        "source_sentence": "非是作得，非不作得。",
        "translation": "They are not acquired through effort, they are not acquired without effort.",
        "source": "T47n1976_002:0393a01_6"
    },
    {
        "source_sentence": "故先德云：「根深果茂，源遠流長。",
        "translation": "That's why the former virtuous monk said, The roots are deep and the fruits flourish, and the source is distant and the flow is long.",
        "source": "T47n1976_002:0393a02_7"
    },
    {
        "source_sentence": "宿因既深，教起亦大。」",
        "translation": "Since the causes of past lives are so deep, the teachings that arise are also great.",
        "source": "T47n1976_002:0393a02_8"
    },
    {
        "source_sentence": "誠然乎哉！",
        "translation": "It's really true!",
        "source": "T47n1976_002:0393a03_9"
    },
    {
        "source_sentence": "三、顯果德者，如《華嚴經．普賢行願品》云：「諸佛如來，因於眾生，",
        "translation": "3. To show the virtue of realization, as the Flower Ornament Sutra and the Chapter on the Vows of Samantabhadra says, The buddha-tathāgatas cause all sentient beings to attain enlightenment.",
        "source": "T47n1976_002:0393a04_0"
    },
    {
        "source_sentence": "而起大悲；",
        "translation": "Instead they give rise to great compassion.",
        "source": "T47n1976_002:0393a05_1"
    },
    {
        "source_sentence": "因於大悲，生菩提心；",
        "translation": "Because of great compassion they give rise to the aspiration for enlightenment.",
        "source": "T47n1976_002:0393a05_2"
    },
    {
        "source_sentence": "因菩提心，成等正覺。",
        "translation": "Because of the mind of enlightenment, they become perfectly enlightened.",
        "source": "T47n1976_002:0393a06_3"
    },
    {
        "source_sentence": "譬如曠野沙磧之中，有大樹王，若根得水，枝葉華果，悉皆繁茂；",
        "translation": "It is as if there were a great king of trees in the wilderness, surrounded by sand and desert. Their roots obtained water but their branches, leaves, flowers, and fruit all grew luxuriantly.",
        "source": "T47n1976_002:0393a06_4"
    },
    {
        "source_sentence": "生死曠野，菩提樹王亦復如是。",
        "translation": "So it is with the king of the bodhi tree in the wilderness of birth and death.",
        "source": "T47n1976_002:0393a07_5"
    },
    {
        "source_sentence": "一切眾生，而為樹根；",
        "translation": "All sentient beings are the roots of a tree.",
        "source": "T47n1976_002:0393a08_6"
    },
    {
        "source_sentence": "諸佛菩薩，而為華果。",
        "translation": "The buddhas and bodhisattvas are flowers and fruits.",
        "source": "T47n1976_002:0393a09_7"
    },
    {
        "source_sentence": "以大悲水，饒益眾生，則能成就諸佛菩薩智慧華果。」",
        "translation": "By benefiting sentient beings with the water of great compassion, they'll be able to accomplish the flowers and fruits of wisdom of buddhas and bodhisattvas.",
        "source": "T47n1976_002:0393a09_8"
    },
    {
        "source_sentence": "是故當知，一切諸佛取佛果者，依於眾生；",
        "translation": "Because of this, you should know that all buddhas who attain buddhahood rely on sentient beings.",
        "source": "T47n1976_002:0393a10_9"
    },
    {
        "source_sentence": "若無眾生，佛果不成。",
        "translation": "If there were no sentient beings, the Buddhahood wouldn't be realized.",
        "source": "T47n1976_002:0393a11_10"
    },
    {
        "source_sentence": "譬如漢王以救民故，而有百戰；",
        "translation": "It is as if the king of Han had a hundred battles in order to save his people.",
        "source": "T47n1976_002:0393a12_11"
    },
    {
        "source_sentence": "以百戰故，登大寶位；",
        "translation": "Because of the one hundred battles, he ascended to the great jeweled throne.",
        "source": "T47n1976_002:0393a12_12"
    },
    {
        "source_sentence": "登寶位故，百姓樂業。",
        "translation": "Because he ascended to the jeweled throne, the people enjoyed doing good deeds.",
        "source": "T47n1976_002:0393a13_13"
    },
    {
        "source_sentence": "若無百姓，即無如上等事。",
        "translation": "If there are no people, then there are no such things as the above.",
        "source": "T47n1976_002:0393a13_14"
    },
    {
        "source_sentence": "究而論之，凡行一德、一事、一利、一名者，若無眾生，皆悉不成。",
        "translation": "Anyone who practices one virtue, one thing, one benefit, or one name won't be accomplished if there are no sentient beings.",
        "source": "T47n1976_002:0393a14_15"
    },
    {
        "source_sentence": "是故我無眾生，即不成我；",
        "translation": "Consequently, the self has no sentient beings; that is to say, it does not become a self.",
        "source": "T47n1976_002:0393a15_16"
    },
    {
        "source_sentence": "眾生是依，我即是正；",
        "translation": "Sentient beings are the support, while self is the directive.",
        "source": "T47n1976_002:0393a16_17"
    },
    {
        "source_sentence": "眾生是正，我即是依。",
        "translation": "Sentient beings are correct, and self is the basis.",
        "source": "T47n1976_002:0393a16_18"
    },
    {
        "source_sentence": "人我平等，依正無礙，是法爾故。",
        "translation": "The equality of person and self is based upon the absence of obstruction with respect to righteousness, because it is so.",
        "source": "T47n1976_002:0393a17_19"
    },
    {
        "source_sentence": "法爾者，即自然果德故。",
        "translation": "The dharma refers to the natural fruit of virtue.",
        "source": "T47n1976_002:0393a18_20"
    },
    {
        "source_sentence": "若向外建立，即不成果義。",
        "translation": "If they are established from the outside, that's the meaning of not producing fruit.",
        "source": "T47n1976_002:0393a18_21"
    },
    {
        "source_sentence": "四、依因性者，一切眾生，皆有如是淨性。",
        "translation": "4. Dependent causality: All sentient beings have such a pure nature.",
        "source": "T47n1976_002:0393a20_0"
    },
    {
        "source_sentence": "譬一精金，冶為釵釧及溺器等。",
        "translation": "It's like a single piece of semen gold that's smelt to make hairpins and drowning vessels.",
        "source": "T47n1976_002:0393a20_1"
    },
    {
        "source_sentence": "金性是一，溺器者是器，具穢非金穢故；",
        "translation": "The nature of gold is one and the one who drowns a container is a container: because it is full of impurity but not with no impurity of gold.",
        "source": "T47n1976_002:0393a21_2"
    },
    {
        "source_sentence": "若加銷治，為種種玩好等物，金亦不易。",
        "translation": "If he adds the antidote, it's not easy to treat various kinds of things like play and so forth with gold.",
        "source": "T47n1976_002:0393a22_3"
    },
    {
        "source_sentence": "生佛亦然，同一淨性，但以釵釧溺器，而有差別，非是性異。",
        "translation": "So it is with the arising Buddha, who has the same pure nature but uses hairpins and jewelry to drown his vessel, yet there's a distinction, not a difference in nature.",
        "source": "T47n1976_002:0393a23_4"
    },
    {
        "source_sentence": "是故博地凡夫，十念即生者，以本淨故。",
        "translation": "That's why the ten kinds of mindfulness that are produced by worldlings in the vast land because they're originally pure.",
        "source": "T47n1976_002:0393a24_5"
    },
    {
        "source_sentence": "阿彌陀佛，欲攝受是眾生，即攝受者，以眾生本淨故。",
        "translation": "Amitâbha Buddha wants to take in sentient beings, and he takes in because sentient beings are inherently pure.",
        "source": "T47n1976_002:0393a25_6"
    },
    {
        "source_sentence": "如鏡中之光，不從磨得；",
        "translation": "It is like the light in a mirror, which does not come from grinding.",
        "source": "T47n1976_002:0393a26_7"
    },
    {
        "source_sentence": "生淨土者，非是行願及與念力所能成就。",
        "translation": "Being born in the Pure Land is not something that can be accomplished by practice, vows, or the power of mindfulness.",
        "source": "T47n1976_002:0393a27_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T47n1976_002:0393a28_9"
    },
    {
        "source_sentence": "念行如鑪錘等，但能銷金，無別有金生故。",
        "translation": "Mindfulness and volition are like a hammer, etc., which can only eliminate gold, because there is no separate arising of gold.",
        "source": "T47n1976_002:0393a28_10"
    },
    {
        "source_sentence": "五、順眾生者，謂樂兒童者，當以餅果；",
        "translation": "The fifth is for those who are obedient to sentient beings. That is, if they delight in children, they should offer cakes and fruits [to them].",
        "source": "T47n1976_002:0393b01_0"
    },
    {
        "source_sentence": "樂婦女者，必用綺羅；",
        "translation": "Those who delight in women must use fancy clothes.",
        "source": "T47n1976_002:0393b01_1"
    },
    {
        "source_sentence": "一切眾生所重，惟寶玉衣食，是故有自然七寶，及與樓閣妙麗衣服飲食等事。",
        "translation": "Because all sentient beings value only treasure and jade clothing and food, there are the natural seven treasures and the wonderfully beautiful clothes, food, and so forth of the tower.",
        "source": "T47n1976_002:0393b02_2"
    },
    {
        "source_sentence": "譬諸火宅諸兒，非羊鹿等車，決不肯出，出已純與大車。",
        "translation": "It's like the children in a burning house who aren't chariots like sheep and deer but are determined not to leave, and after leaving, they simply give it to the large chariot.",
        "source": "T47n1976_002:0393b04_3"
    },
    {
        "source_sentence": "今釋迦如來順眾生情見，說阿彌陀七寶淨土，秖為眾生見境如是，合如是說。",
        "translation": "Now, the Śākyamuni Tathāgata follows the views of sentient beings and explains the seven-jeweled Pure Land of Amitâbha, which is combined with this explanation for the sake of sentient beings who see it as such.",
        "source": "T47n1976_002:0393b05_4"
    },
    {
        "source_sentence": "眾生生已，各各自見細妙淨相，無可比喻，方知琉璃[王*車]璖瑪瑙，",
        "translation": "When sentient beings are born, each sees subtle and beautiful forms of purity that cannot be compared to any other. Only then do they know the agate lapis lazuli [royal*che] moon- emerald;",
        "source": "T47n1976_002:0393b07_5"
    },
    {
        "source_sentence": "猶如瓦礫。",
        "translation": "It's like rubble.",
        "source": "T47n1976_002:0393b08_6"
    },
    {
        "source_sentence": "如達官貴人，向田舍兒說王宮精嚴，姑就彼人所極珍異者為比，向非情量所及。",
        "translation": "Suppose a well-versed official and noble person explains the king's palace's finery to Vaiśravaṇa, and he compares it to that person's most rare and extraordinary treasure by comparing it to someone who doesn't have the ability to measure it.",
        "source": "T47n1976_002:0393b09_7"
    },
    {
        "source_sentence": "如對生盲說色，亦無所用，其方比矣！",
        "translation": "It's like telling form to a blind man who's born blind, and there's no use for it, which is comparable!",
        "source": "T47n1976_002:0393b10_8"
    },
    {
        "source_sentence": "六、穢相空者，如《智論》曰：「譬如人有一子，喜在不淨中戲，聚土為穀，",
        "translation": "6. The emptiness of defiled characteristics: As the Zhilun says, Suppose there's a man with a child who likes to play in an impure place and gathers dirt into grain.",
        "source": "T47n1976_002:0393b12_0"
    },
    {
        "source_sentence": "以草木為鳥獸，而生愛著。",
        "translation": "Because grass and trees are birds and animals, they become attached to them.",
        "source": "T47n1976_002:0393b13_1"
    },
    {
        "source_sentence": "人有奪者，瞋恚啼哭。",
        "translation": "If someone steals it, they'll be angry and weep.",
        "source": "T47n1976_002:0393b14_2"
    },
    {
        "source_sentence": "其父知已，思惟此子今雖愛著，此事易離，小大自休。",
        "translation": "Knowing this, the father thought to himself, “Even though my son is addicted now, it will be easy for him to leave me.",
        "source": "T47n1976_002:0393b14_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T47n1976_002:0393b15_4"
    },
    {
        "source_sentence": "此物非真故。",
        "translation": "It's because these things aren't real.",
        "source": "T47n1976_002:0393b16_5"
    },
    {
        "source_sentence": "菩薩亦如是，觀眾生愛著不淨臭身，及種種五欲；",
        "translation": "Similarly, enlightening beings observe sentient beings’ attachment to unclean, foul-smelling bodies and various desires.",
        "source": "T47n1976_002:0393b16_6"
    },
    {
        "source_sentence": "若信等五根成就時，即能捨離。",
        "translation": "When the five faculties faith, and so on, are accomplished, one is able to abandon them.",
        "source": "T47n1976_002:0393b17_7"
    },
    {
        "source_sentence": "若小兒所著實是真物，雖復年至百歲，著之轉深；",
        "translation": "If the attachment of a small child is really real, then even if he grows up to a hundred years old, his attachment becomes deeper and deeper.",
        "source": "T47n1976_002:0393b18_8"
    },
    {
        "source_sentence": "若眾生所著物實有者，雖得五根，亦不能捨；",
        "translation": "If the things that sentient beings cling to really exist, even though they may attain the five faculties, still they cannot let go of them.",
        "source": "T47n1976_002:0393b19_9"
    },
    {
        "source_sentence": "以諸法皆空，誑不實故，故得捨離。」",
        "translation": "It's because all dharmas are empty and crude and unreal, so they can be abandoned.",
        "source": "T47n1976_002:0393b20_10"
    },
    {
        "source_sentence": "如來為眾生說淨土亦爾，以眾生所著非實，即易為訓化故。",
        "translation": "The Tathāgata explains the Pure Land for sentient beings in much the same way because what sentient beings cling to is not real, that is, because it's easy to teach.",
        "source": "T47n1976_002:0393b21_11"
    },
    {
        "source_sentence": "如人少時悅色、壯歲營官、老年嗜利，若是實可好著，不應年變月易。",
        "translation": "Suppose a person is delighted with form when they're young, grows old at the age of officialhood, and becomes elderly and addicted to profit. If this were really desirable, it wouldn't be subject to change in years and months.",
        "source": "T47n1976_002:0393b22_12"
    },
    {
        "source_sentence": "以變易故，說淨土時，亦悅、亦營、亦嗜，如夢中人，喚之即醒；",
        "translation": "Because of these transformations, when he preached the Teaching on the Pure Land, he also delighted in it, cherished it, and indulged in it. Just as a man in a dream wakes up at the sound of his call.",
        "source": "T47n1976_002:0393b24_13"
    },
    {
        "source_sentence": "若夢實者，雖喚無益。",
        "translation": "If the dream is real, even though it's called useless.",
        "source": "T47n1976_002:0393b25_14"
    },
    {
        "source_sentence": "以俱非實，是故諸佛為一切眾生說如是法門。",
        "translation": "Because they are neither real nor real, the buddhas therefore explain such a teaching for all sentient beings.",
        "source": "T47n1976_002:0393b26_0"
    },
    {
        "source_sentence": "七、勝方便者，為此方便，非是自力，亦非他力。",
        "translation": "7. The superior skillful means is a skillful means that's not self-powerful or other-powerful.",
        "source": "T47n1976_002:0393b28_0"
    },
    {
        "source_sentence": "緣自性海中，具有如是自在功德，一切現成。",
        "translation": "Conditioned by the ocean of self-nature, he possesses such unimpeded qualities that they are all manifested.",
        "source": "T47n1976_002:0393b29_1"
    },
    {
        "source_sentence": "是故一句聖號，無復煩詞；",
        "translation": "Because of this, the phrase “holy name” is uttered without further troublesome words.",
        "source": "T47n1976_002:0393c01_2"
    },
    {
        "source_sentence": "十念功成，頓超多劫。",
        "translation": "The merit of the ten kinds of mindfulness is accomplished, and it suddenly transcends many eons.",
        "source": "T47n1976_002:0393c01_3"
    },
    {
        "source_sentence": "如萬竅怒號，力在扶搖，因竅顯故；",
        "translation": "It is as if the myriad orifices were wailing in anger, their power being to shake. This is due to the appearance of the orifices.",
        "source": "T47n1976_002:0393c02_4"
    },
    {
        "source_sentence": "如幽谷洞明，功在晨曦，因谷見故；",
        "translation": "It is like a deep, dark valley that glows in the morning because of the vision of the valleys.",
        "source": "T47n1976_002:0393c02_5"
    },
    {
        "source_sentence": "如一綫之蟻孔，能穿連山之堤，是水之力，非蟻力故；",
        "translation": "It is like the power of water, not the power of ants, to penetrate the embankment of a mountain.",
        "source": "T47n1976_002:0393c03_6"
    },
    {
        "source_sentence": "又如一葉之葦席，能運萬斛之舟，是風之力，非葦力故。",
        "translation": "It's also like a single leaf of the reeds that can carry a boat of ten thousand gallons, which is the power of wind and not the power of the reeds.",
        "source": "T47n1976_002:0393c04_7"
    },
    {
        "source_sentence": "總之皆是法界性海，無作無為不思議力所現，非自非他，一切具足，故有如是殊勝方便，",
        "translation": "In sum, they are all oceans of the essence of the cosmos of reality, unmanifested and unconditioned, manifested by inconceivable power. They are neither self-existent nor possessed by others. That is why there is such an extraordinary technique.",
        "source": "T47n1976_002:0393c06_8"
    },
    {
        "source_sentence": "是謂捷中之捷、徑中之徑。",
        "translation": "This is called the quickest of the quick and the path of the path.",
        "source": "T47n1976_002:0393c08_9"
    },
    {
        "source_sentence": "舍此不修，是真愚癡！",
        "translation": "If someone doesn't cultivate this, they're really foolish!",
        "source": "T47n1976_002:0393c08_10"
    },
    {
        "source_sentence": "八、導二乘者，二乘避境趨寂，證假涅槃，不得如來法身，受業惑苦：一者，",
        "translation": "8. Guiding the Two Vehicles: The two vehicles avoid objects and tend to quiescence, realize provisional nirvāṇa, don't attain the Tathāgata's Dharma body, and experience the suffering of karma and affliction:",
        "source": "T47n1976_002:0393c10_0"
    },
    {
        "source_sentence": "無明住地，不得至見煩惱垢濁、習氣臭穢究竟滅盡，淨波羅蜜果。",
        "translation": "In the entrenchment of nescience, they can't see the final cessation of the stains and smells of affliction and the results of habituated tendencies that are the fruit of the perfection of purity.",
        "source": "T47n1976_002:0393c11_1"
    },
    {
        "source_sentence": "二者，因無明住地有虛妄行未除滅故，不得至見無作、無行，我波羅蜜果。",
        "translation": "Second, it's because there are false actions in the entrenchment of nescience that haven't been removed and ceased, they can't see the fruit of the self-pāramitā as unconstructed and unmanifest.",
        "source": "T47n1976_002:0393c13_2"
    },
    {
        "source_sentence": "三者，因微細虛妄，起無漏業，意生諸陰未除盡故，不得至見極滅、遠離，",
        "translation": "3. Because of subtle falsehood, uncontaminated karma arises: because the aggregates that are mentally generated have not yet been eliminated, they cannot attain cessation and separation from views.",
        "source": "T47n1976_002:0393c14_3"
    },
    {
        "source_sentence": "樂波羅蜜果。",
        "translation": "It's the fruit of blissful perfection.",
        "source": "T47n1976_002:0393c16_4"
    },
    {
        "source_sentence": "四者，變易生死，斷續流滅，不得至見極無變易，常波羅蜜果。",
        "translation": "Fourth, it's the fruit of transmigration in birth-and-death, cutting off continuity and extinction, not attaining the ultimate view that there's no change, which is always the fruit of the perfection of permanence.",
        "source": "T47n1976_002:0393c16_5"
    },
    {
        "source_sentence": "以是四種業惑，未證真理。",
        "translation": "It's because these four kinds of karmic afflictions haven't yet realized the truth.",
        "source": "T47n1976_002:0393c18_0"
    },
    {
        "source_sentence": "如來憫之，教令回斷滅心，修淨土行。",
        "translation": "The Tathāgata took pity on him and ordered him to return, cut off his thoughts of extinction, and cultivate the practice of the Pure Land.",
        "source": "T47n1976_002:0393c18_1"
    },
    {
        "source_sentence": "令知即空不斷，即有不常，乘大乘智，入涅槃海。",
        "translation": "He causes them to know that emptiness doesn't stop, that is, existence is impermanent, and rides the great vehicle wisdom to enter the ocean of nirvāṇa.",
        "source": "T47n1976_002:0393c19_2"
    },
    {
        "source_sentence": "九、堅忍力者，龍樹菩薩曰：「童子過四歲以上，未滿二十，名為鳩摩羅伽地。",
        "translation": "The bodhisattva Nāgârjuna said, A boy more than four years old and less than 20 years old is called the Kumārajīva ground.",
        "source": "T47n1976_002:0393c21_0"
    },
    {
        "source_sentence": "若菩薩初生菩薩家者如嬰兒；",
        "translation": "“When enlightening beings are first born in the house of enlightening beings, they are like children.",
        "source": "T47n1976_002:0393c22_1"
    },
    {
        "source_sentence": "得無生法忍，乃至十住地，離諸惡事，名為鳩摩羅伽地。",
        "translation": "Attaining the forbearance of the nonarising of dharmas up to the tenth abode and being free of bad things is called the Kumārajīva stage.",
        "source": "T47n1976_002:0393c23_2"
    },
    {
        "source_sentence": "欲得如是地，當學般若波羅蜜，常欲不離諸佛。",
        "translation": "Those who want to attain such a stage should train in the perfection of wisdom, always wanting to be without separation from the buddhas.",
        "source": "T47n1976_002:0393c24_3"
    },
    {
        "source_sentence": "問曰：『菩薩當化眾生，何故常欲不離諸佛？』",
        "translation": "He asked, 'Why does a bodhisattva always want to transform sentient beings and not part with the buddhas?'",
        "source": "T47n1976_002:0393c25_4"
    },
    {
        "source_sentence": "答曰：『有菩薩，未入菩薩位，未得阿鞞跋致受記莂故，若遠離諸佛，",
        "translation": "He replied, 'There are bodhisattvas who have yet to enter the bodhisattvahood and haven't yet attained abhidharma because they've received assurance of enlightenment. If they part with the buddhas,",
        "source": "T47n1976_002:0393c26_5"
    },
    {
        "source_sentence": "便壞諸善根沒在煩惱，自不能度安能度人？",
        "translation": "They will then destroy the good roots and disappear into afflictions, and they won't be able to save themselves or save others?",
        "source": "T47n1976_002:0393c28_6"
    },
    {
        "source_sentence": "如人乘船，中流壞敗，欲度他人，反自沒水；",
        "translation": "It is like when a person boards a boat and the midstream breaks down. Wishing to cross over to another’s bow, they instead sink into the water themselves.",
        "source": "T47n1976_002:0393c29_7"
    },
    {
        "source_sentence": "又如小湯投大氷池，雖消少處，反更成氷。",
        "translation": "It's also like when a small amount of hot water is thrown into a large ice pond, and even though it disappears in a small place, it turns into ice again.",
        "source": "T47n1976_002:0394a01_8"
    },
    {
        "source_sentence": "菩薩未入法位，若遠離諸佛，以少功德無方便力，欲化眾生，雖少利益，",
        "translation": "Enlightening beings who have not yet entered the state of truth, if they are far removed from all buddhas, use little virtue and lack the power of skillful means to teach sentient beings, even though it brings little benefit.",
        "source": "T47n1976_002:0394a02_0"
    },
    {
        "source_sentence": "反更墜落。",
        "translation": "Instead, it fell back down again.",
        "source": "T47n1976_002:0394a03_1"
    },
    {
        "source_sentence": "以是故新學菩薩，不應遠離諸佛。』",
        "translation": "Therefore, newly trained bodhisattvas shouldn't be far removed from the buddhas.'",
        "source": "T47n1976_002:0394a03_2"
    },
    {
        "source_sentence": "問曰：『若爾者，何以不說不離聲聞、辟支佛？",
        "translation": "He asked, 'If that's the case, why isn't it said that they aren't separate from śrāvakas and pratyekbuddhas?",
        "source": "T47n1976_002:0394a04_3"
    },
    {
        "source_sentence": "聲聞、辟支佛，亦能利益菩薩。』",
        "translation": "śrāvakas and pratyekbuddhas can also benefit bodhisattvas.'",
        "source": "T47n1976_002:0394a05_4"
    },
    {
        "source_sentence": "答曰：『菩薩大心，聲聞、辟支佛雖有涅槃利益，無一切智故，不能教道菩薩。",
        "translation": "Answer: 'The bodhisattva's great intention is that even though śrāvakas and pratyekbuddhas have the benefit of nirvāṇa, they can't teach the bodhisattva the path because they lack omniscience.",
        "source": "T47n1976_002:0394a06_5"
    },
    {
        "source_sentence": "諸佛一切種智故，能教導菩薩。",
        "translation": "Because of the omniscience of all kinds of buddhas, they can teach bodhisattvas.",
        "source": "T47n1976_002:0394a07_6"
    },
    {
        "source_sentence": "如象沒泥，非象不能出，菩薩亦如是。",
        "translation": "Just as an elephant sinks into mud but no elephant can't get out, so too does a bodhisattva.",
        "source": "T47n1976_002:0394a08_7"
    },
    {
        "source_sentence": "若入非道中，唯佛能救，同大道故。",
        "translation": "If someone enters the wrong path, only the Buddha can save them, because they're the same as the great path.",
        "source": "T47n1976_002:0394a09_8"
    },
    {
        "source_sentence": "故說菩薩，常欲不離諸佛。』",
        "translation": "That's why it's said that bodhisattvas always want to not part with the buddhas.'",
        "source": "T47n1976_002:0394a10_9"
    },
    {
        "source_sentence": "復次菩薩作是念：『我未得佛眼故，如盲無異；",
        "translation": "“Furthermore, enlightening beings think, ‘Because I have not yet attained the eye of buddhahood, I am no different from a blind man.",
        "source": "T47n1976_002:0394a10_10"
    },
    {
        "source_sentence": "若不為佛所引導，則無所趣，錯入餘道。",
        "translation": "If someone isn't led by the Buddha, they won't have any destination, and they'll mistakenly enter other paths.",
        "source": "T47n1976_002:0394a11_11"
    },
    {
        "source_sentence": "設聞佛法，異處行者，未知教化時節，行法多少。",
        "translation": "Suppose someone hears the Buddha's teaching and travels to a different place, but they don't know the time and season for teaching or the amount of practice.",
        "source": "T47n1976_002:0394a12_12"
    },
    {
        "source_sentence": "復次菩薩見佛，得種種利益，或眼見心清淨；",
        "translation": "“Furthermore, when enlightening beings see buddhas they attain various benefits; sometimes their eyes and minds are purified by seeing them.",
        "source": "T47n1976_002:0394a13_13"
    },
    {
        "source_sentence": "若聞所說，心則樂法，得大智慧，隨法修行，而得解脫。』",
        "translation": "If someone hears what they teach, their mind delights in the Dharma, attains great wisdom, cultivates practice according to the teaching, and attains liberation.'",
        "source": "T47n1976_002:0394a14_14"
    },
    {
        "source_sentence": "如是等值佛無量益利，豈不一心常欲見佛。",
        "translation": "Such people attain the Buddha's immeasurable benefits, so isn't it because they singlemindedly always want to see the Buddha with one mind?",
        "source": "T47n1976_002:0394a16_15"
    },
    {
        "source_sentence": "譬如嬰兒不應離母；",
        "translation": "It is as if a newborn child should not leave its mother.",
        "source": "T47n1976_002:0394a17_16"
    },
    {
        "source_sentence": "又如行道，不離糧食；",
        "translation": "It is also like the practice of walking on the path without leaving food and drink.",
        "source": "T47n1976_002:0394a17_17"
    },
    {
        "source_sentence": "如大熱時，不離涼風冷水；",
        "translation": "It is like the case of a great heat that does not leave cool wind and cool water.",
        "source": "T47n1976_002:0394a18_18"
    },
    {
        "source_sentence": "如大寒時，不欲離火；",
        "translation": "It is like not wanting to leave the fire when there is a great cold.",
        "source": "T47n1976_002:0394a18_19"
    },
    {
        "source_sentence": "如度深水，不應離船；",
        "translation": "It is like crossing a deep river that one should not leave the boat.",
        "source": "T47n1976_002:0394a19_20"
    },
    {
        "source_sentence": "譬如病人，不離良醫；",
        "translation": "It is like the case of a sick man who does not leave his good doctor.",
        "source": "T47n1976_002:0394a19_21"
    },
    {
        "source_sentence": "菩薩不離諸佛，過於上事。",
        "translation": "A bodhisattva who doesn't part with the buddhas goes beyond the above.",
        "source": "T47n1976_002:0394a20_22"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T47n1976_002:0394a20_23"
    },
    {
        "source_sentence": "父母、親屬、知識、人天王等，皆不能如佛益利。",
        "translation": "Parents, relatives, friends, humans, gods, kings, and so forth can't benefit like the Buddha.",
        "source": "T47n1976_002:0394a20_24"
    },
    {
        "source_sentence": "佛益利諸菩薩，離諸苦處，住世尊之地。",
        "translation": "The Buddha benefits the bodhisattvas, parts with the places of suffering, and abides in the Bhagavān's land.",
        "source": "T47n1976_002:0394a21_25"
    },
    {
        "source_sentence": "以是因緣，故菩薩常不離佛。",
        "translation": "Because of these causes and conditions, the bodhisattva always doesn't part from the Buddha.",
        "source": "T47n1976_002:0394a22_26"
    },
    {
        "source_sentence": "問曰：『有為之法，欺誑不真，皆不可信。",
        "translation": "He asked, 'Constructed dharmas are deceptive and unreal, and they can't be believed.",
        "source": "T47n1976_002:0394a23_27"
    },
    {
        "source_sentence": "云何得如願不離諸佛？』",
        "translation": "How can they attain the wish that they won't part from the buddhas?'",
        "source": "T47n1976_002:0394a24_28"
    },
    {
        "source_sentence": "答曰：『福德智慧具足故，乃應得佛，何況不離諸佛。",
        "translation": "He answered, 'It's because their merit and wisdom are complete that they should attain Buddhahood, so why wouldn't they be separated from the buddhas?",
        "source": "T47n1976_002:0394a24_29"
    },
    {
        "source_sentence": "眾生有無量劫罪因緣故，不得如願。",
        "translation": "Because sentient beings have measureless eons of sinful causes and conditions, they can't fulfill their wish.",
        "source": "T47n1976_002:0394a25_30"
    },
    {
        "source_sentence": "雖行福德，而智慧薄少；",
        "translation": "Though they practice virtue, their wisdom is weak.",
        "source": "T47n1976_002:0394a26_31"
    },
    {
        "source_sentence": "雖行智慧，而福德薄少，故所願不成。",
        "translation": "Even though he practices wisdom, his virtue is weak, so his vow won't be fulfilled.",
        "source": "T47n1976_002:0394a27_32"
    },
    {
        "source_sentence": "菩薩求佛道故，要行二忍：生忍、法忍。",
        "translation": "Because bodhisattvas seek the Buddha's path, they must practice two kinds of forbearance: patience that gives rise to forbearance and Dharma forbearance.",
        "source": "T47n1976_002:0394a28_33"
    },
    {
        "source_sentence": "行生忍故，一切眾生中，發慈悲心，滅無量劫罪，得無量福德。",
        "translation": "Because of their practice and forbearance, they give rise to the mind of compassion among all sentient beings, extinguish measureless eons of sins, and attain measureless merit.",
        "source": "T47n1976_002:0394a28_34"
    },
    {
        "source_sentence": "行法忍故，破諸法無明，得無量智慧。",
        "translation": "Because of the forbearance of practice, he destroys ignorance of dharmas and attains immeasurable wisdom.",
        "source": "T47n1976_002:0394b01_35"
    },
    {
        "source_sentence": "二行合和故，何願不得？",
        "translation": "Because the two practices are combined, what wish can't be obtained?",
        "source": "T47n1976_002:0394b02_36"
    },
    {
        "source_sentence": "以是故菩薩世世常不離諸佛。",
        "translation": "Because of this, the bodhisattva always doesn't part from the buddhas throughout the world.",
        "source": "T47n1976_002:0394b02_37"
    },
    {
        "source_sentence": "復次菩薩，常愛樂念佛，故捨身受身，恒得值佛。",
        "translation": "Furthermore, because bodhisattvas always delight in mindfulness of the Buddha, they abandon their bodies and receive bodies, and they're always able to meet the Buddha.",
        "source": "T47n1976_002:0394b03_38"
    },
    {
        "source_sentence": "譬如眾生習欲心重，受婬鳥身，所謂孔雀、鴛鴦等；",
        "translation": "Good man, it is analogous to sentient beings whose minds are heavy with the desire for sensual pleasure and who receive the bodies of garuḍas (monkeys), so-called peacocks,  mandarin ducks, etc.",
        "source": "T47n1976_002:0394b04_39"
    },
    {
        "source_sentence": "習瞋恚偏多，生毒蟲中，所謂惡龍、羅剎、蜈蚣、毒蛇等。",
        "translation": "Their habit of anger is partial and numerous, and they're born among poisonous insects, which are called bad dragons, rājas, centipedes, poisonous snakes, and so forth.",
        "source": "T47n1976_002:0394b05_40"
    },
    {
        "source_sentence": "是菩薩心，不貴轉輪聖王、人天福樂，但念諸佛，是故隨心所重，而受身形。",
        "translation": "Because the mind of this bodhisattva doesn't value the merits and happiness of wheel-turning sage kings or humans and gods, he simply thinks of the buddhas; therefore, he receives body form according to the weight of his mind.",
        "source": "T47n1976_002:0394b06_41"
    },
    {
        "source_sentence": "復次菩薩，常善修念佛三昧因緣故，所生常值諸佛。』」",
        "translation": "Furthermore, because bodhisattvas always skillfully cultivate the causes and conditions of mindfulness of the Buddha's samādhi, they are born and always meet the buddhas.'",
        "source": "T47n1976_002:0394b08_42"
    },
    {
        "source_sentence": "天如《或問》曰：「禪宗悟達之士，既曰見性成佛，焉肯復求淨土？」",
        "translation": "The gods said in the Or ask, Since the Chan school's enlightened man says that he sees the nature to become a buddha, how could he still want to pursue the Pure Land?",
        "source": "T47n1976_002:0394b09_43"
    },
    {
        "source_sentence": "答曰：「悟達之士，政願求生。",
        "translation": "He answered, A man of enlightenment wishes to be born.",
        "source": "T47n1976_002:0394b11_0"
    },
    {
        "source_sentence": "汝但未悟，使汝既悟，淨土之趨，萬牛莫挽。」",
        "translation": "But you haven't yet awakened, so when you awaken, the pure land doesn't pull ten thousand cows.",
        "source": "T47n1976_002:0394b11_1"
    },
    {
        "source_sentence": "問曰：「學者但患大事不明。",
        "translation": "He asked, A scholar simply doesn't understand the great deal of trouble.",
        "source": "T47n1976_002:0394b12_2"
    },
    {
        "source_sentence": "大事既明，當行佛教，隨類化身，入泥入水，不避生死，廣度生靈。",
        "translation": "Once the great matter has been clarified, he should practice Buddhism, transform his body according to its type, enter mud and water, not avoid birth and death, and extensively liberate the spirit of birth.",
        "source": "T47n1976_002:0394b13_3"
    },
    {
        "source_sentence": "何故求生淨土，厭苦趨樂？」",
        "translation": "Why do you seek to be born in the Pure Land and become disillusioned with suffering and declining into happiness?",
        "source": "T47n1976_002:0394b14_4"
    },
    {
        "source_sentence": "答曰：「汝將謂一悟之後，習漏永除，便得不退轉耶？",
        "translation": "He answered, Would you say that after one awakening, the contaminants of accumulation will be permanently removed, and you'll attain nonretrogression?",
        "source": "T47n1976_002:0394b15_5"
    },
    {
        "source_sentence": "將謂一悟之後，更無遍學佛法、修行證果等事耶？",
        "translation": "Would you say that after one awakening, there's no such thing as pervasively studying the Buddha's teachings and cultivating the fruit of realization?",
        "source": "T47n1976_002:0394b16_6"
    },
    {
        "source_sentence": "將謂一悟之後，便可上齊諸佛，入生死不受障緣之所撓耶？",
        "translation": "Will it be said that after one awakening, they'll be able to align themselves with the buddhas and enter birth-and-death without being tormented by obstructed by hindrances?",
        "source": "T47n1976_002:0394b17_7"
    },
    {
        "source_sentence": "審如是，則諸大菩薩，修六度萬行，動經恒河沙數劫者，是皆愧汝！",
        "translation": "If you judge it like this, then the great bodhisattvas who cultivate the six perfections and myriad practices for as many eons as there are grains of sand in the Ganges River will all be ashamed of you!",
        "source": "T47n1976_002:0394b18_8"
    },
    {
        "source_sentence": "古教有云：『聲聞尚有出胎之昧，菩薩亦有隔陰之昏。』",
        "translation": "An ancient teaching says, 'There's still the obscurity of śrāvakas leaving the womb, and there's also the obscurity of bodhisattvas who are separated from the aggregates.'",
        "source": "T47n1976_002:0394b20_9"
    },
    {
        "source_sentence": "況近時薄解淺悟，自救不了者。",
        "translation": "It's even more so when someone who has little understanding and little awakening in recent times and doesn't save themselves.",
        "source": "T47n1976_002:0394b21_10"
    },
    {
        "source_sentence": "縱有悟處深遠，見地高明，行解相應，志在度人者，奈何未登不退，力用未充；",
        "translation": "Even if someone has a profound and far-reaching sphere of enlightenment, sees the earth as lofty and bright, is associated with practice and understanding, and wishes to save others, how could they not ascend or retreat, nor can their powers be fulfilled.",
        "source": "T47n1976_002:0394b22_11"
    },
    {
        "source_sentence": "居此濁惡，化此剛強，此亦先聖之所未許。",
        "translation": "This is also something that the ancient sages did not approve of.",
        "source": "T47n1976_002:0394b23_12"
    },
    {
        "source_sentence": "如以未完不固之舟，濟多人於惡海，自他俱溺，其理必然。",
        "translation": "It is as if someone were to rescue many people from the sea of evil with an unworthy boat that has not yet been completed, and they would drown both themselves and others. This principle is certain.",
        "source": "T47n1976_002:0394b24_13"
    },
    {
        "source_sentence": "故《往生論》云：『欲遊戲地獄門者，必生彼土，得無生忍，已還入生死，",
        "translation": "That's why the Treatise on Rebirth says, 'Those who want to play through the gate of hell will surely be born in that land, attain the tolerance of nonproduction, and return back into birth-and-death after entering it.",
        "source": "T47n1976_002:0394b26_14"
    },
    {
        "source_sentence": "救苦眾生，以此因緣，求生淨土。』",
        "translation": "To save suffering sentient beings, he seeks to be born in the Pure Land for this reason.'",
        "source": "T47n1976_002:0394b27_15"
    },
    {
        "source_sentence": "又先聖有云：『未得不退轉位，不可混俗度生，未得無生法忍，要須常不離佛。",
        "translation": "Also, a former sage said, 'If you haven't attained the stage of nonretrogression, you can't mix with the conventional and save sentient beings; if you haven't attained the tolerance of the principle of nonproduction, you must always be constant and not part with the Buddha.",
        "source": "T47n1976_002:0394b28_16"
    },
    {
        "source_sentence": "譬如嬰兒，常不離母；",
        "translation": "It is like an infant who does not leave his mother.",
        "source": "T47n1976_002:0394c01_17"
    },
    {
        "source_sentence": "又如弱羽，只可傅枝。』",
        "translation": "It's also like weak feathers that can only be cultivated.'",
        "source": "T47n1976_002:0394c01_18"
    },
    {
        "source_sentence": "今此國中，釋迦已滅，彌勒未生；",
        "translation": "In this country the Buddha has entered nirvana but Maitreya has not yet arisen.",
        "source": "T47n1976_002:0394c02_19"
    },
    {
        "source_sentence": "四惡趣苦，因果牽纏；",
        "translation": "The fourth is the suffering of the evil destinies, tethered by causes and effects.",
        "source": "T47n1976_002:0394c02_20"
    },
    {
        "source_sentence": "外道邪魔，是非扇亂；",
        "translation": "Non-Buddhist disturbances are right and wrong agitations.",
        "source": "T47n1976_002:0394c03_21"
    },
    {
        "source_sentence": "美色淫聲之相惑，惡緣穢觸之交侵。",
        "translation": "They are defiled by the characteristics of beautiful form and lustful sounds, and they're attacked by bad conditions and defiled by contact.",
        "source": "T47n1976_002:0394c03_22"
    },
    {
        "source_sentence": "既無現佛可依，又被境緣所撓，初心悟達之人，尠有不遭其退敗者。",
        "translation": "Since there's no Buddha to rely on in the present, and they're also tormented by objects and conditions, those who first awaken their minds and understand them will often have no opportunity to retreat.",
        "source": "T47n1976_002:0394c04_23"
    },
    {
        "source_sentence": "所以世尊殷勤指歸極樂，良有以也。",
        "translation": "That's why the Bhagavān so diligently points to the ultimate bliss, and there's a good reason for it.",
        "source": "T47n1976_002:0394c06_24"
    },
    {
        "source_sentence": "蓋彼彌陀現在說法，樂土境緣種種清淨，倘依彼佛，忍力易成，高證佛階，",
        "translation": "It is because Amitâbha teaches the Dharma now. The land of bliss has all kinds of objects and various purity as its condition. If we rely on this buddha, it will be easy for us to attain enlightenment through the power of patience.",
        "source": "T47n1976_002:0394c07_25"
    },
    {
        "source_sentence": "親蒙授記；",
        "translation": "They were personally entrusted with the prediction.",
        "source": "T47n1976_002:0394c08_26"
    },
    {
        "source_sentence": "然後出化眾生，去來無礙。",
        "translation": "Then he emanates and transforms sentient beings, going and coming unobstructed.",
        "source": "T47n1976_002:0394c09_27"
    },
    {
        "source_sentence": "多見今之禪者，不究如來之了義，不知達磨之玄機，空腹高心，習為狂妄。",
        "translation": "Those who often see the Tathāgata's teachings in this meditation don't investigate the Tathāgata's fully explained meaning, don't know the profound abilities of Bodhidharma, have empty stomachs and high minds, and are accustomed to being crazy.",
        "source": "T47n1976_002:0394c09_28"
    },
    {
        "source_sentence": "見修淨土，則笑之曰：『彼學愚夫愚婦之所為。』",
        "translation": "Seeing the cultivation of the Pure Land, they laughed at him and said, 'That foolish man or woman who's training is a fool.'",
        "source": "T47n1976_002:0394c11_29"
    },
    {
        "source_sentence": "余嘗論其非鄙愚夫愚婦，乃鄙文殊、普賢、龍樹、馬鳴等也。",
        "translation": "I've often discussed that they aren't despicable foolish men and foolish women, but they are despicable to Mañjuśrī, Samantabhadra, Nāgârjuna, Ma Roaring, and so forth.",
        "source": "T47n1976_002:0394c12_30"
    },
    {
        "source_sentence": "非特自迷正道，自失善根，自喪慧身，自亡佛種；",
        "translation": "It is not that they themselves have lost their roots of goodness, the body of wisdom, and the lineage of buddhahood.",
        "source": "T47n1976_002:0394c13_31"
    },
    {
        "source_sentence": "且成謗法之業，又招鄙聖之殃，佛祖視為可哀憐者。",
        "translation": "Furthermore, they commit the sin of denigrating the Dharma and inflict the misfortune of despicable sages, and the Buddha and his ancestors regard them as pitiable.",
        "source": "T47n1976_002:0394c14_32"
    },
    {
        "source_sentence": "於是永明和尚深憐痛哀，剖出心肝，主張淨土，既以自修又以化世。",
        "translation": "The monk Yongming then had deep compassion and pity, cut out his heart and liver, and insisted on the Pure Land, cultivating it for himself and transforming the world.",
        "source": "T47n1976_002:0394c16_33"
    },
    {
        "source_sentence": "故其臨終有種種殊勝相現，舍利鱗砌，徑生極樂上品；",
        "translation": "At the end of his life, however, he manifested various extraordinary signs. His relic bones were carved with scales and enshrouded in a skeleton that gave rise to the highest quality of bliss.",
        "source": "T47n1976_002:0394c17_34"
    },
    {
        "source_sentence": "乃至閻羅以為希有，圖像禮敬。",
        "translation": "Even the Yama considers it rare and pays homage to it with images and veneration.",
        "source": "T47n1976_002:0394c18_35"
    },
    {
        "source_sentence": "夫永明既悟達磨直指之禪，又能致身於極樂上品，以此解禪者之執情，",
        "translation": "Yongming, having awakened to the meditation of Bodhidharma's straightforward instruction, can also cause his body to reach the highest level of ultimate bliss. Because of this he understands the attached feelings of those who practice meditation:",
        "source": "T47n1976_002:0394c19_36"
    },
    {
        "source_sentence": "以此為末法之勸信，是真大有功於宗教者。",
        "translation": "Because this is the final teaching that encourages faith, it's really great and meritorious for religious people.",
        "source": "T47n1976_002:0394c21_37"
    },
    {
        "source_sentence": "豈特永明為然，如死心新禪師，作勸修淨土之文，又如真歇了禪師，作《淨土說》有云：『洞下一宗，",
        "translation": "It's not especially so when it's permanently clarified, like the new meditation master with a dead-hearted mind who creates an exhortation to cultivate the Pure Land and also like the true cessation meditation master who creates a teaching on the Pure Land that says, 'The doctrine of enlightenment is based on emptiness.",
        "source": "T47n1976_002:0394c22_38"
    },
    {
        "source_sentence": "皆務密修，其故何哉？",
        "translation": "What is the reason they all strive so diligently?",
        "source": "T47n1976_002:0394c24_39"
    },
    {
        "source_sentence": "良以念佛法門，徑路修行，正按大藏，接上上根器，傍引中下之機。』",
        "translation": "It's because of the method of mindfulness of the Buddha's teaching that they cultivate practice on the path, precisely following the great store and connecting with the higher faculties and vessels, citing the capacities of the middle and lower.'",
        "source": "T47n1976_002:0394c24_40"
    },
    {
        "source_sentence": "又云：『宗門大匠，已悟不空有法，秉志孜孜於淨業者，以淨業見佛簡易于宗門故。』",
        "translation": "It's also said, 'The great master of the school has realized that there's no emptiness and dharmas, maintaining his intention to diligently cultivate pure actions because he sees the Buddha as a simple entity in the school by purifying actions.'",
        "source": "T47n1976_002:0394c26_41"
    },
    {
        "source_sentence": "又云：『乃佛乃祖，在教在禪，皆修淨業，同歸一源。",
        "translation": "It's also said, 'That's because the Buddha is the ancestor, who cultivates pure activities in teaching and meditation, all of which return to the same source.",
        "source": "T47n1976_002:0394c28_42"
    },
    {
        "source_sentence": "入得此門，無量法門，悉皆能入。』",
        "translation": "He enters this approach and attains measureless teachings, and he's able to enter them all.'",
        "source": "T47n1976_002:0394c29_43"
    },
    {
        "source_sentence": "至如天衣懷禪師、圓照本禪師、慈受深禪師、南嶽思禪師、法照禪師、淨靄禪師、淨慈大通禪師、天台懷玉禪師、梁道珍禪師、唐道綽禪師、毘陵法真禪師、姑蘇守納禪師、北磵簡禪師、天目禮禪師等諸大老，",
        "translation": "The great elders, such as the Chan master Tianyi Huai, the Chan master Yuanzhao ben, the Chan master Cishou shen, the Chan master Nanyueqian, the Chan master Fazhao, the Chan master Jingzhi Datong, the Chan master Tiantai Huaiu, the Chan master Daozhen, the Chan master Daozhen, the Chan master Dao",
        "source": "T47n1976_002:0395a01_44"
    },
    {
        "source_sentence": "皆是禪門宗匠，究其密修顯化，發揚淨土之旨，則不約而同。",
        "translation": "They were all masters of the Chan school, who investigated their esoteric cultivation and revealed the meaning of the Pure Land without being limited or identical with it.",
        "source": "T47n1976_002:0395a05_45"
    },
    {
        "source_sentence": "廣如彼文，不能盡錄。",
        "translation": "The text is as extensive as the above, but it cannot be reproduced here in full.",
        "source": "T47n1976_002:0395a07_46"
    },
    {
        "source_sentence": "是故當知，禪宗密修，不離淨土；",
        "translation": "Therefore, it should be known that the doctrine of trance is secretly practised and does not leave the pure land.",
        "source": "T47n1976_002:0395a07_47"
    },
    {
        "source_sentence": "初心頓悟，未出童真，入此門者，方為堅固不退之門。」",
        "translation": "The first mind is suddenly enlightened, and those who enter this gate before emerging from the boy's true state are only the gate of firmness and nonretrogression.",
        "source": "T47n1976_002:0395a08_48"
    },
    {
        "source_sentence": "十、示真法者，一切修行法門，言空即斷，言有即常，未為究竟。",
        "translation": "10. He who shows the true teaching is the Dharma aspect of all cultivation, which says emptiness is cessation and existence is permanence, but it's not the ultimate.",
        "source": "T47n1976_002:0395a10_0"
    },
    {
        "source_sentence": "唯此念佛三昧，即念而淨，淨非是無；",
        "translation": "This buddha-samādhi of mindfulness is the only one that becomes pure in a moment of thought, and what is pure is not nonexistent.",
        "source": "T47n1976_002:0395a11_1"
    },
    {
        "source_sentence": "即淨而念，念非是有。",
        "translation": "That is, it's pure but mindful, and mindfulness isn't existent.",
        "source": "T47n1976_002:0395a12_2"
    },
    {
        "source_sentence": "達淨無依，即是念體；",
        "translation": "To understand that purity has no support is the essence of mindfulness.",
        "source": "T47n1976_002:0395a12_3"
    },
    {
        "source_sentence": "了念本離，即是淨用。",
        "translation": "Being mindful of what's originally free, that's pure function.",
        "source": "T47n1976_002:0395a13_4"
    },
    {
        "source_sentence": "是故非淨外有念，能念于淨；",
        "translation": "Therefore, it is not that there is mindfulness outside of purity that can be thought of the pure.",
        "source": "T47n1976_002:0395a13_5"
    },
    {
        "source_sentence": "若淨外有念，念即有所，所非淨故。",
        "translation": "If there's mindfulness outside of purity, then mindfulness is something that's not pure.",
        "source": "T47n1976_002:0395a14_6"
    },
    {
        "source_sentence": "非念外有淨，能入諸念；",
        "translation": "It is not that there is purity outside of thought, enabling one to enter all states of thought.",
        "source": "T47n1976_002:0395a15_7"
    },
    {
        "source_sentence": "若念外有淨，淨即有二，二非淨故。",
        "translation": "If there's purity outside of mindfulness, then there are two kinds of purity: because the two aren't pure.",
        "source": "T47n1976_002:0395a15_8"
    },
    {
        "source_sentence": "當知諸佛順寂滅心而嚴淨土，是故念淨土者，當入一切寂滅門。",
        "translation": "You should know that the buddhas follow the mind of cessation and adorn the pure land; therefore, someone who's mindful of the pure land will enter the gate of all kinds of cessation.",
        "source": "T47n1976_002:0395a16_9"
    },
    {
        "source_sentence": "諸佛順常樂我淨心而嚴淨土，是故念淨土者，當入一切常樂我淨門。",
        "translation": "The buddhas follow the mind of permanence, bliss, self, and purity in order to adorn the Pure Land; therefore, those who are mindful of the Pure Land will enter all the gates of permanence, bliss, self, and purity.",
        "source": "T47n1976_002:0395a18_10"
    },
    {
        "source_sentence": "諸佛順平等眾生心而嚴淨土，是故念淨土者，當入一切平等眾生門。",
        "translation": "The buddhas follow the minds of equal sentient beings and adorn the Pure Land, so those who are mindful of the Pure Land will enter the gate of all equal sentient beings.",
        "source": "T47n1976_002:0395a19_11"
    },
    {
        "source_sentence": "諸佛順大悲智業而嚴淨土，是故念淨土者，當入一切大悲智業門。",
        "translation": "The buddhas adorn the Pure Land in accordance with the knowledge and actions of great compassion, so those who are mindful of the Pure Land will enter all the gates of the knowledge and actions of great compassion.",
        "source": "T47n1976_002:0395a21_12"
    },
    {
        "source_sentence": "諸佛順無作無為不可思議業而嚴淨土，是故念淨土者，當入一切無作無為不可思議門。",
        "translation": "The buddhas adorn the pure land by following unconstructed, unconditioned, and inconceivable actions, so those who are mindful of the pure land will enter the inconceivable gate of all unconstructed, unconditioned, and inconceivable activities.",
        "source": "T47n1976_002:0395a22_13"
    },
    {
        "source_sentence": "諸佛順塵勞煩惱性而嚴淨土，是故念淨土者，當入一切塵勞煩惱門。",
        "translation": "The buddhas adorn the Pure Land in accordance with the nature of the afflictions of worldly suffering, so those who are mindful of the Pure Land will enter the gate of all the afflictions of worldly sufferings.",
        "source": "T47n1976_002:0395a24_14"
    },
    {
        "source_sentence": "諸佛順微塵芥子相而嚴淨土，是故念淨土者，當入一切微塵芥子門。",
        "translation": "The buddhas adorn the pure land by following the characteristics of tiny grains of mustard seed, so those who are mindful of the pure land should enter the gate of all tiny grains of mustard seed.",
        "source": "T47n1976_002:0395a26_15"
    },
    {
        "source_sentence": "以上諸大法門，但一聲阿彌陀佛，皆悉證入，亦無能證、所證之相。",
        "translation": "All of the above great teachings, except for the single-voice Amitâbha Buddha, are fully realized and entered, and there are no characteristics that can be realized or realized.",
        "source": "T47n1976_002:0395a28_16"
    },
    {
        "source_sentence": "若不爾者，則是有餘之淨；",
        "translation": "If it were otherwise, it would be pure with remainder.",
        "source": "T47n1976_002:0395a29_17"
    },
    {
        "source_sentence": "念佛三昧即不如是。",
        "translation": "The samādhi of mindfulness of the Buddha is not like this.",
        "source": "T47n1976_002:0395b01_18"
    },
    {
        "source_sentence": "西方合論卷之二(終)",
        "translation": "combined Treatise on the Western Regions, Volume II (Final)",
        "source": "T47n1976_002:0395b02_0"
    }
]