[
    {
        "source_sentence": "大唐大慈恩寺三藏法師傳卷",
        "translation": "Tang Dynasty Biographies of the Tripiṭaka Master Dacien Temple",
        "source": "T50n2053_007:0257a21_0"
    },
    {
        "source_sentence": "第七",
        "translation": "the seventh",
        "source": "T50n2053_007:0257a22_0"
    },
    {
        "source_sentence": "沙門慧立本　釋彥悰箋",
        "translation": "Śramaṇa Huili's Commentary on the Establishment of Buddhism",
        "source": "T50n2053_007:0257a24_0"
    },
    {
        "source_sentence": "起二十二年六月　天皇製《述聖",
        "translation": "In the sixth month of the twenty-second year, the emperor produced the Shusheng",
        "source": "T50n2053_007:0257a25_0"
    },
    {
        "source_sentence": "記》終永徽五年春二月法師答書",
        "translation": "In the second month, in the spring of the fifth year of Zhenying's reign, the Master answered with a letter.",
        "source": "T50n2053_007:0257a26_0"
    },
    {
        "source_sentence": "二十二年夏六月，　天皇大帝居春宮，奉覩　聖文，又製《述聖記》，",
        "translation": "In the sixth month in the summer of the twenty-second year, the emperor and the great ruler resided at the spring palace. He honored the holy texts and composed another Record of the Death of the Sage.",
        "source": "T50n2053_007:0257a27_0"
    },
    {
        "source_sentence": "其詞曰：「夫顯揚正教，非智無以廣其文；",
        "translation": "He said, “If we express the true Teaching, there is no wisdom that can extend its meaning.",
        "source": "T50n2053_007:0257a28_1"
    },
    {
        "source_sentence": "崇闡微言，非賢莫能定其旨。",
        "translation": "The sublime and subtle teachings are so lofty that no wise person can determine their meaning.",
        "source": "T50n2053_007:0257a29_2"
    },
    {
        "source_sentence": "蓋真如聖教者，諸法之玄宗，眾經之軌躅也。",
        "translation": "It's because the true and holy teaching is the profound doctrine of all dharmas and the guideline for all scriptures.",
        "source": "T50n2053_007:0257b01_3"
    },
    {
        "source_sentence": "綜括宏遠，奧旨遐深，極空有之精微，體生滅之機要。",
        "translation": "It encompasses the vast and far-reaching, its mysterious meaning is profound, its essence is subtle as space and existence, and its essence is the opportunity for arising and ceasing.",
        "source": "T50n2053_007:0257b02_4"
    },
    {
        "source_sentence": "詞茂道曠，尋之者不究其源，文顯義幽，履之者莫測其際。",
        "translation": "The words spoken are rich and the roads are wide, but those who search for them do not investigate their origins. The style of writing expresses its meaning in a mysterious way; those who follow it cannot fathom its limits.",
        "source": "T50n2053_007:0257b03_5"
    },
    {
        "source_sentence": "故知聖慈所被，業無善而不臻，妙化所敷，緣無惡而不剪。",
        "translation": "Therefore, it's known that there's no good karma that doesn't reach them when covered by noble kindness, and what's spread by marvelous transformation has no bad conditions that don't cut them off.",
        "source": "T50n2053_007:0257b05_6"
    },
    {
        "source_sentence": "開法網之綱紀，弘六度之正教，拯群有之塗炭，啟三藏之祕扃。",
        "translation": "It opens the outline of the network of the Dharma, promotes the right teaching of the six perfections, saves all living beings from their miseries, and reveals the esoteric theories of the Tripitaka Master.",
        "source": "T50n2053_007:0257b06_7"
    },
    {
        "source_sentence": "是以名無翼而長飛，道無根而永固。",
        "translation": "That's why it's called flying long without wings, and the path is permanently resolute without faculties.",
        "source": "T50n2053_007:0257b08_0"
    },
    {
        "source_sentence": "道名流慶，歷遂古而鎮常；",
        "translation": "The name of the Way is renowned and celebrated everywhere. Since ancient times it has been peaceful and constant.",
        "source": "T50n2053_007:0257b08_1"
    },
    {
        "source_sentence": "赴感應身，經塵劫而不朽。",
        "translation": "He went to the body of sense perception and remained there for an eon without decaying.",
        "source": "T50n2053_007:0257b09_2"
    },
    {
        "source_sentence": "晨鍾夕梵，交二音於鷲峰，慧日法流，轉雙輪於鹿苑。",
        "translation": "The two sounds of morning bell and evening brahma are interspersed at Vulture Peak, while the Dharma stream of wisdom and sun is turned in pairs at Deer Preserve.",
        "source": "T50n2053_007:0257b10_3"
    },
    {
        "source_sentence": "排空寶蓋，接翔雲而共飛，莊野春林，與天花而合彩。",
        "translation": "The jeweled canopy that stretched out in the sky flew together with the flying clouds, and the wild spring trees and forests were of the same color as the heavenly flowers.",
        "source": "T50n2053_007:0257b11_4"
    },
    {
        "source_sentence": "伏惟皇帝陛下，上玄資福，垂拱而治八荒；",
        "translation": "I humbly wish that Your Majesty, the Emperor, who bestowed profound blessedness upon me, will rule over the eight quarters of the empire by hanging down his bow.",
        "source": "T50n2053_007:0257b12_5"
    },
    {
        "source_sentence": "德被黔黎，斂衽而朝萬國。",
        "translation": "His virtue was enshrined in the empire of Qiali and he ruled over myriad kingdoms.",
        "source": "T50n2053_007:0257b13_6"
    },
    {
        "source_sentence": "恩加朽骨，石室歸貝葉之文；",
        "translation": "I am grateful to you for the addition of decaying bones, which are preserved in stone chambers and enshrined on shellfish leaves.",
        "source": "T50n2053_007:0257b14_7"
    },
    {
        "source_sentence": "澤及昆蟲，金匱流梵說之偈。",
        "translation": "The marsh and insects lack the gold, and the Sanskrit word for it is praised in verse.",
        "source": "T50n2053_007:0257b15_8"
    },
    {
        "source_sentence": "遂使阿耨達水通神甸之八川，耆闍崛山接嵩、華之翠嶺。",
        "translation": "As a result, the water of Anavatapta connected with the eight rivers of the divine land and Mount Gṛdhrakūṭa connected with the emerald mountains of Song and Hua.",
        "source": "T50n2053_007:0257b15_9"
    },
    {
        "source_sentence": "竊以法性凝寂，靡歸心而不通；",
        "translation": "I humbly believe that the essence of the Dharma is so concentrated and quiescent that it cannot be penetrated through my mind.",
        "source": "T50n2053_007:0257b17_10"
    },
    {
        "source_sentence": "智地玄奧，感懇誠而遂顯。",
        "translation": "The sphere of knowledge is profound and mysterious, manifested through sincerity.",
        "source": "T50n2053_007:0257b17_11"
    },
    {
        "source_sentence": "豈謂重昏之夜，燭慧炬之光，火宅之朝，降法雨之澤。",
        "translation": "This is not to say that on a deeply dark night the light of the torch of wisdom can be seen. On the morning at the burning house the rain from the dharma-rain falls down in the swampy soil.",
        "source": "T50n2053_007:0257b18_12"
    },
    {
        "source_sentence": "於是百川異流，同會於海，萬區分義，總成乎實。",
        "translation": "Thus, a hundred rivers flowed in different directions and they assembled together at sea. The meaning of the myriad distinctions were all settled as reality.",
        "source": "T50n2053_007:0257b19_13"
    },
    {
        "source_sentence": "豈與湯、武校其優劣，堯、舜比其聖德者哉！",
        "translation": "How could they compare their superiority and inferiority with Tang and Wu, or compare Yao and Shun to their noble virtue?",
        "source": "T50n2053_007:0257b20_14"
    },
    {
        "source_sentence": "玄奘法師者，夙懷聰令，立志夷簡，神清齠齓之年，體拔浮華之世，凝情定室，",
        "translation": "The Master Xuanzang always cherished the spirit of intelligence and laid down his aspiration for enlightenment. In the spiritually pure age, he uprooted the world in essence like a floating flower and concentrated his mind in meditation.",
        "source": "T50n2053_007:0257b21_15"
    },
    {
        "source_sentence": "匿迹幽巖，拪息三禪，巡遊十地，超六塵之境，獨步迦維，會一乘之旨，",
        "translation": "He lived in seclusion in a deep cave at the rocky cliffs and meditated in the third meditation state of absorption. He traveled to the ten directions, transcending the realm of the six dust motes; he was alone in",
        "source": "T50n2053_007:0257b23_16"
    },
    {
        "source_sentence": "隨機化物。",
        "translation": "He follows the opportunity to transform things.",
        "source": "T50n2053_007:0257b25_17"
    },
    {
        "source_sentence": "以中華之無質，尋印度之真文，遠涉恒河，終期滿字。",
        "translation": "Because of the qualitylessness of Chinese, he searched for the true texts of India and travelled far to the Ganges River. At the end of his life he wrote in full syllables.",
        "source": "T50n2053_007:0257b25_18"
    },
    {
        "source_sentence": "頻登雪嶺，更獲半珠。",
        "translation": "He frequently climbed up the snowy mountains and found half a j ewel.",
        "source": "T50n2053_007:0257b26_19"
    },
    {
        "source_sentence": "問道往還，十有七載，備通釋典，利物為心。",
        "translation": "In the course of ten or seven years he asked about the Way and traveled back and forth. He was well versed in all the Buddhist scriptures and his aim was to benefit all living beings.",
        "source": "T50n2053_007:0257b27_20"
    },
    {
        "source_sentence": "以貞觀十九年二月六日，奉　勅於弘福寺翻譯聖教要文，凡六百五十七部。",
        "translation": "On the sixth day of the second month in the nineteenth year of Zongguan, an imperial decree was issued to translate the essential texts o f the holy teachings into Chinese on the six hundred and fifty-seventh",
        "source": "T50n2053_007:0257b28_21"
    },
    {
        "source_sentence": "引大海之法流，洗塵勞而不竭，傳智燈之長焰，皎幽闇而恒明，自非久植勝緣，",
        "translation": "They draw the flow of the Teaching from the ocean of truth, wash away all defilements without running out; they transmit the long flame of the lamp of knowledge, shining brilliantly in the darkness but always bright. It has not been a long time since",
        "source": "T50n2053_007:0257c01_22"
    },
    {
        "source_sentence": "何以顯揚斯旨。",
        "translation": "How can we express this meaning?",
        "source": "T50n2053_007:0257c03_23"
    },
    {
        "source_sentence": "所謂法性常住，齊三光之明，　我皇福臻，同二儀之固。",
        "translation": "The so-called Dharma nature always abides, which is the same as the insight of the three lights, and our emperor's fortune shines, which is the same as the firmness of the two rituals.",
        "source": "T50n2053_007:0257c03_24"
    },
    {
        "source_sentence": "伏見　御製眾經論序，照古騰今，理含金石之聲，文抱風雲之潤。",
        "translation": "I humbly see that Your Majesty has composed the preface to all the scriptures and treatises, illuminating the ancient and rising present. The principle contains the sounds of gold and stone; the style of writing embraces the moisture of",
        "source": "T50n2053_007:0257c04_25"
    },
    {
        "source_sentence": "治輒以輕塵足岳，墜露添流，略舉大綱，以為斯記。」",
        "translation": "I'll simply take the dust and footprints of the mountain, fall into the dew and add to the flow, and briefly summarize the outline for this record.",
        "source": "T50n2053_007:0257c06_26"
    },
    {
        "source_sentence": "法師進啟謝曰：「玄奘聞七耀摛光，憑高天而散景；",
        "translation": "The Master wrote a letter of thanks to the Emperor, saying: I have heard that the brilliant light of the seven rays of the sun is reflected in the sky above me.",
        "source": "T50n2053_007:0257c07_27"
    },
    {
        "source_sentence": "九河灑潤，因厚地而通流。",
        "translation": "Nine rivers are sprinkled and moistened, flowing through the thick soil.",
        "source": "T50n2053_007:0257c08_28"
    },
    {
        "source_sentence": "是知相資之美，處物既然，演法依人，理在無惑。",
        "translation": "This is to know that the beauty of mutually reinforcing is that since it's a place where things are present, the explanation of the teaching depends on people, and there's no confusion in principle.",
        "source": "T50n2053_007:0257c09_29"
    },
    {
        "source_sentence": "伏惟皇太子殿下發揮　睿藻，再述天文，讚美大乘，莊嚴實相。",
        "translation": "I respectfully request that Your Majesty, the crown prince, who is endowed with wisdom and wise eloquence, recount this account of astronomy and praise the Great Vehicle (Mahayana), which adorns its true aspect.",
        "source": "T50n2053_007:0257c10_30"
    },
    {
        "source_sentence": "珠迴玉轉，霞爛錦舒，將日月而聯華，與咸韶而合韻。",
        "translation": "The jewels turn and the jade turn; the glow of the sun and moon are combined with the colors of the flowers, harmonizing with the sound of Xianshao.",
        "source": "T50n2053_007:0257c12_31"
    },
    {
        "source_sentence": "玄奘輕生多幸，沐浴殊私，不任銘佩，奉啟陳謝。」",
        "translation": "I, Xuanzang, beg begrudgingly and with much good fortune, bathe in my private quarters and don't allow the inscription to be engraved; I respectfully express my thanks.",
        "source": "T50n2053_007:0257c13_32"
    },
    {
        "source_sentence": "時降令書曰：「治素無才學，性不聰敏。",
        "translation": "At that time the emperor wrote a decree, saying: I am naturally lacking in talent and learning but not intelligent by nature.",
        "source": "T50n2053_007:0257c15_33"
    },
    {
        "source_sentence": "內典諸文殊未觀覽，所作序記鄙拙尤繁。",
        "translation": "The preface composed by Mañjuśrī of the Buddhist texts is coarse and clumsy, especially numerous.",
        "source": "T50n2053_007:0257c16_34"
    },
    {
        "source_sentence": "忽得來書，褒揚讚述，撫躬自省，慚悚交并。",
        "translation": "Suddenly he received a letter from the Emperor, praising him and extolling his words of praise. He patted his palms in respect and thought to himself with shame and trepidation.",
        "source": "T50n2053_007:0257c17_35"
    },
    {
        "source_sentence": "勞師等遠臻，深以為愧。」",
        "translation": "It's a great shame that the teacher and others had to go so far to reach it.",
        "source": "T50n2053_007:0257c18_36"
    },
    {
        "source_sentence": "釋彥悰箋述曰：「自二　聖《序文》出後，王公、百辟、法、俗、黎庶手舞足蹈，",
        "translation": "Shi Yanqian wrote a letter to the emperor, saying: Since the introduction of the Sacred Preface in the late nineteenth and early twentieth A Forest of Pearls from the Dharma Garden, princes, hundreds of pratyekabud",
        "source": "T50n2053_007:0257c20_0"
    },
    {
        "source_sentence": "歡詠德音，內外揄揚，未浹辰而周六合，慈雲再蔭，慧日重明，歸依之徒波迴霧委。",
        "translation": "He sang with joy and praised his virtuous voices both inside and outside the monastery, chanting hymns of praise that extended to the six quarters at the end of the day. The cloud of compassion reappeared to provide shade",
        "source": "T50n2053_007:0257c21_1"
    },
    {
        "source_sentence": "所謂上之化下，猶風靡草，其斯之謂乎！",
        "translation": "The so-called transformation of the higher and lower is like the wind blowing down a blade of grass, which is called that!",
        "source": "T50n2053_007:0257c23_2"
    },
    {
        "source_sentence": "如來所以法付國王，良為此也。」",
        "translation": "The reason the Tathāgata entrusted the Dharma to the king is precisely because of this.",
        "source": "T50n2053_007:0257c24_3"
    },
    {
        "source_sentence": "時弘福寺寺主圓定及京城僧等，請鐫二《序文》於金石，藏之寺宇。",
        "translation": "At the time, the head of Hongfu Monastery, Yuanding and other monks from the capital city asked that two Preface texts be engraved in gold and stone to store them in the temple building.",
        "source": "T50n2053_007:0257c25_4"
    },
    {
        "source_sentence": "　帝可之。",
        "translation": "The emperor approved of it.",
        "source": "T50n2053_007:0257c26_5"
    },
    {
        "source_sentence": "後寺僧懷仁等乃鳩集晉右軍將軍王羲之書，勒於碑石焉。",
        "translation": "The monks of the latter monastery, such as Huai Ren and others, collected the writings of Wang Xi, General of the Right Armed Forces of the Jin dynasty inscribed them on a stone tablet.",
        "source": "T50n2053_007:0257c27_0"
    },
    {
        "source_sentence": "庚辰，皇太子以文德聖皇后早棄萬方，思報昊天，追崇福業，使中大夫守右庶子臣高季輔宣令曰：「寡人不造，",
        "translation": "On the first day of the seventh month, when the crown prince had abandoned the imperial empress by reason of her virtue as a sage queen and wishing to repay the kindness of heavenly rewards, he pursued meritorious deeds",
        "source": "T50n2053_007:0257c28_1"
    },
    {
        "source_sentence": "咎譴所鍾，年在未識，慈顏棄背，終身之憂，貫心滋甚，風樹之切，刻骨冥深。",
        "translation": "He was condemned to be unknown when he was still alive. His compassionate countenance withdrew, and his sorrow filled his mind for the rest of his life. The wind and trees were cutting down the bones in a deep",
        "source": "T50n2053_007:0258a02_2"
    },
    {
        "source_sentence": "每以龍忌在辰，歲時興感，空懷陟屺之望，益疚寒泉之心。",
        "translation": "Every year the dragon was deprived of his birthday, and when he came back to life he cherished the hope of enlightenment in vain, increasingly blaming the cold spring for his sins.",
        "source": "T50n2053_007:0258a04_3"
    },
    {
        "source_sentence": "既而笙歌遂遠，瞻奉無逮，徒思昊天之報，罔寄烏鳥之情。",
        "translation": "As soon as the music and singing were heard, they traveled far away to pay their respects to Wuqiao. They thought only of the rewards of rebirth in heaven but did not give rise to feelings of affection for him like those of",
        "source": "T50n2053_007:0258a05_4"
    },
    {
        "source_sentence": "竊以覺道洪慈，寔資冥福，冀申孺慕，是用歸依。",
        "translation": "I humbly believe that the Way of enlightenment is so generous and compassionate as to provide for mysterious blessedness, and in order to express my affection for my childhood I take refuge in it.",
        "source": "T50n2053_007:0258a07_5"
    },
    {
        "source_sentence": "宜令所司於京城內舊廢寺妙選一所，奉為文德聖皇后即營僧寺。",
        "translation": "It should be ordered that the director of the monastery select one of the oldly decrepit temples in the capital city and dedicate it to the holy Empress Mañjuśrī, who then constructed a monk's monastery.",
        "source": "T50n2053_007:0258a08_6"
    },
    {
        "source_sentence": "寺成之日，當別度僧。",
        "translation": "On the day when the monastery was completed, the monks were to be ordained separately.",
        "source": "T50n2053_007:0258a09_7"
    },
    {
        "source_sentence": "仍令挾帶林泉，務盡形勝。",
        "translation": "He ordered them to carry the image in a carriage through the forests and fountains so as to show its superiority.",
        "source": "T50n2053_007:0258a10_8"
    },
    {
        "source_sentence": "仰規忉利之果，副此罔極之懷。」",
        "translation": "I'm revering the fruit of the rules and disciplines of the Trāyastriṃśa gods, which are accompanied by this mind that doesn't reach the limit.",
        "source": "T50n2053_007:0258a10_9"
    },
    {
        "source_sentence": "於是有司詳擇勝地，遂於宮城南晉昌里，面曲池，依淨覺故伽藍而營建焉。",
        "translation": "Thereupon, a minister carefully selected the superior site and built a pond facing south of the palace at Changli in the Jin dynasty to the south of the city. It was built on the basis of the old monastery of Jīvaka Buddha’s",
        "source": "T50n2053_007:0258a11_10"
    },
    {
        "source_sentence": "瞻星揆地，像天闕，倣給園，窮班、倕巧藝，盡衡、霍良木，文石梓桂櫲樟栟櫚充其材，",
        "translation": "The statues are missing from the monastery, but they have been entrusted to the pleasure grove. All the exquisite arts and crafts such as silkworm feasting and climbing are preserved in trees made of all kinds of clo",
        "source": "T50n2053_007:0258a13_11"
    },
    {
        "source_sentence": "珠玉丹青赭堊金翠備其飾。",
        "translation": "It's decorated with jewels, jade,丹青, gray, white, and gold.",
        "source": "T50n2053_007:0258a15_12"
    },
    {
        "source_sentence": "而重樓複殿，雲閣洞房，凡十餘院，總一千八百九十七間，床褥器物，",
        "translation": "It consists of one thousand eight hundred and ninety-seven storeys in all, with beds, bedding, utensils, and other things.",
        "source": "T50n2053_007:0258a16_13"
    },
    {
        "source_sentence": "備皆盈滿。",
        "translation": "They're all complete.",
        "source": "T50n2053_007:0258a17_14"
    },
    {
        "source_sentence": "　文武聖皇帝又讀法師所進《菩薩藏經》，美之，因勅春宮作其經後序。",
        "translation": "Emperor Wenwu also read the Bodhisattvapitaka Sutra submitted by the Master and praised it, so he ordered the spring palace to compose a preface after the sutra.",
        "source": "T50n2053_007:0258a17_15"
    },
    {
        "source_sentence": "其詞曰：「蓋聞羲皇至賾，精粹止於龜文；",
        "translation": "He said, “We have heard that Emperor Fuxi is the supreme enlightened one and that his essence resides in the text of the tortoise shell.",
        "source": "T50n2053_007:0258a20_16"
    },
    {
        "source_sentence": "軒后通幽，雅奧窮於鳥篆。",
        "translation": "The empress Dowager of the monastery is endowed with a mysterious and elegant style that can be found only in the Sanskrit script.",
        "source": "T50n2053_007:0258a21_17"
    },
    {
        "source_sentence": "考丹書而索隱，殊昧實際之源；",
        "translation": "He studied the scriptures of the Dan dynasty and sought seclusion, obscuring the source of reality.",
        "source": "T50n2053_007:0258a22_18"
    },
    {
        "source_sentence": "徵綠錯以研幾，蓋非常樂之道。",
        "translation": "It's because it's the path of extraordinary bliss to collect green errors and study them.",
        "source": "T50n2053_007:0258a23_19"
    },
    {
        "source_sentence": "猶且事光圖史，振薰風于八埏；",
        "translation": "It is just as if he were to work on the history of Guangming and spread the wind of enlightenment in the eight quarters.",
        "source": "T50n2053_007:0258a23_20"
    },
    {
        "source_sentence": "德洽生靈，激波瀾於萬代。",
        "translation": "His virtue prospered, and his spirit of enlightenment stirred waves for myriad generations.",
        "source": "T50n2053_007:0258a24_21"
    },
    {
        "source_sentence": "伏惟皇帝陛下轉輪垂拱而化漸鷄園，勝殿凝旒而神交鷲嶺，總調御於徽號，",
        "translation": "I humbly wish that Your Majesty, the Emperor may turn his wheels and bow down in reverence at the rotation of the crow-child’s park. The superior hall is coated with silhouetted windows facing the Vulture",
        "source": "T50n2053_007:0258a25_22"
    },
    {
        "source_sentence": "匪文思之所窺；",
        "translation": "They are not perceived by words or thoughts.",
        "source": "T50n2053_007:0258a27_23"
    },
    {
        "source_sentence": "綜波若於綸言，豈繫象之能擬。",
        "translation": "How could the assemblage of Prajñāpāramitā be projected by an elephant?",
        "source": "T50n2053_007:0258a27_24"
    },
    {
        "source_sentence": "由是教覃溟表，咸傳八解之音，訓浹寰中，皆踐四禪之軌。",
        "translation": "As a result, the teachings were so vast and profound that they all transmitted the sounds of the eight kinds of liberation. They instruct people throughout the world to follow the ways of the four forms of meditation.",
        "source": "T50n2053_007:0258a28_25"
    },
    {
        "source_sentence": "遂使三千法界，盡懷生而可封；",
        "translation": "As a consequence, all the sentient beings in the three thousand realms of the cosmos were able to enshrine it.",
        "source": "T50n2053_007:0258a29_26"
    },
    {
        "source_sentence": "百億須彌，入堤封而作鎮。",
        "translation": "Ten koṭis of Sumeru entered the embankment and made a town.",
        "source": "T50n2053_007:0258b01_27"
    },
    {
        "source_sentence": "尼連德水邇帝里之滄池，舍衛菴園接上林之茂苑。",
        "translation": "Nairañjāna’s water of virtue is situated in the open air pond near the imperial residence, and Śrāvastī’s park adjoins the luxuriant garden of Sāvatṛataka’s forest with that of the",
        "source": "T50n2053_007:0258b02_28"
    },
    {
        "source_sentence": "雖復法性空寂，隨感必通，真乘深妙，無幽不闡。",
        "translation": "Even though the nature of dharmas is empty and void, they will surely be penetrated according to their feelings, and the true vehicle is profound and marvelous, with no mystery that can't be revealed.",
        "source": "T50n2053_007:0258b03_29"
    },
    {
        "source_sentence": "所謂大權御極，導法流而靡窮；",
        "translation": "It is called the great sovereignty and supreme power, guiding the flow of the Teaching without limit.",
        "source": "T50n2053_007:0258b04_30"
    },
    {
        "source_sentence": "能仁撫運，拂劫石而無盡，體均具相，不可思議，校美前王，焉可同年而語矣。",
        "translation": "He was benevolent and affectionate; he brushed away the sand of the kalpa without extinguishing it. His bodily features were all endowed with characteristics that were inconceivable, and he praised the former king for his",
        "source": "T50n2053_007:0258b05_31"
    },
    {
        "source_sentence": "爰自開闢，地限流沙，震旦未融，靈文尚隱。",
        "translation": "Since the founding of the monastery the earth has been limited to a footstool, but the earth and the sea have not yet melted together. The spiritual texts are still hidden in obscurity.",
        "source": "T50n2053_007:0258b07_0"
    },
    {
        "source_sentence": "漢王精感，託夢想於玄霄；",
        "translation": "The Emperor of the Han dynasty had a spirit of entrustment and dreamed of it in the mysterious sky.",
        "source": "T50n2053_007:0258b08_1"
    },
    {
        "source_sentence": "晉后翹誠，降修多於白馬。",
        "translation": "The Empress Dowager of the Jin dynasty was sincere and she subjugated Xiduo at Baima Monastery.",
        "source": "T50n2053_007:0258b08_2"
    },
    {
        "source_sentence": "有同蠡酌，豈達四海之涯；",
        "translation": "How can one reach the bounds of the four seas if one were to drink from the same Li?",
        "source": "T50n2053_007:0258b09_3"
    },
    {
        "source_sentence": "取譬管窺，寧窮七曜之隩。",
        "translation": "It's better to take the analogy of a tube and peer, rather than the seven-syllable sky.",
        "source": "T50n2053_007:0258b10_0"
    },
    {
        "source_sentence": "洎乎皇靈遐暢，威加鐵圍之表；",
        "translation": "Because the imperial spirit is so far-reaching and mighty, it appears on the surface of an iron enclosure.",
        "source": "T50n2053_007:0258b10_1"
    },
    {
        "source_sentence": "至聖發明，德被金剛之際。",
        "translation": "The supremely noble invention of virtue is at the level of the adamantine.",
        "source": "T50n2053_007:0258b11_2"
    },
    {
        "source_sentence": "恒沙國土，普襲衣冠，開解脫門，踐真實路，龍宮梵說之偈必萃清臺，",
        "translation": "In the lands as numerous as the grains of sand in the Ganges River, all wearing robes and crowns, they open the door of liberation and tread the true path. The words spoken by the god Brahmā at the palace of the drago",
        "source": "T50n2053_007:0258b12_0"
    },
    {
        "source_sentence": "猊吼貝葉之文咸歸冊府。",
        "translation": "The texts of the shell roar and shell leaves all return to the book office.",
        "source": "T50n2053_007:0258b13_1"
    },
    {
        "source_sentence": "灑茲甘露，普潤芽莖，垂此慧雲，遍霑翾走，豈非歸依之勝業，聖政之靈感者乎！",
        "translation": "This sweet dew of immortality is sprinkled on all the sprouts and stems, and these clouds of wisdom are draped over them. Isn't that the superior action of relying on it, which is the inspiration for the noble government?",
        "source": "T50n2053_007:0258b14_2"
    },
    {
        "source_sentence": "夫《菩薩藏經》者，大覺義宗之要旨也。",
        "translation": "The Bodhisattva Store Sutra is the essential essence of the great doctrine of enlightenment.",
        "source": "T50n2053_007:0258b16_3"
    },
    {
        "source_sentence": "佛修此道，以證無生；",
        "translation": "The Buddha cultivates this path in order to realize nonorigination.",
        "source": "T50n2053_007:0258b16_4"
    },
    {
        "source_sentence": "菩薩受持，咸登不退。",
        "translation": "The bodhisattvas receive and uphold it, and they all ascend without retreating.",
        "source": "T50n2053_007:0258b17_5"
    },
    {
        "source_sentence": "六波羅蜜關鍵所資，四無量心根力斯備。",
        "translation": "The six perfections are the key to endowment, and the four immeasurable mental faculties are fully endowed.",
        "source": "T50n2053_007:0258b17_6"
    },
    {
        "source_sentence": "蓋彼岸之津涉，正覺之梯航者焉。",
        "translation": "It's because it's the crossing of the river at the other shore and the ladder sailor of right awakening.",
        "source": "T50n2053_007:0258b18_7"
    },
    {
        "source_sentence": "貞觀中年，身毒歸化，越熱坂而頒朔，跨懸度以輸賝。",
        "translation": "In the middle of the Zhenguan period (627 C.E.",
        "source": "T50n2053_007:0258b19_8"
    },
    {
        "source_sentence": "文軌既同，道路無擁。",
        "translation": "Since the text and the tracks are the same, there is no ease of travel on the road.",
        "source": "T50n2053_007:0258b20_9"
    },
    {
        "source_sentence": "沙門玄奘振錫尋真，出自玉關，長驅奈苑，至于天竺力士生處，訪獲此經，",
        "translation": "The śramaṇa Xuanzang sought out the true teachings with zeal. He came forth from the Jade Pass and stayed at the pleasure park in Changquana Monastery until he reached the place where the warrior heroes of India were born",
        "source": "T50n2053_007:0258b21_10"
    },
    {
        "source_sentence": "歸而奏上，降詔翻譯，於是畢功。",
        "translation": "He returned home and presented a letter to the Emperor, instructing him to translate it. Soon after he completed his work.",
        "source": "T50n2053_007:0258b23_11"
    },
    {
        "source_sentence": "余以問安之暇，澄心妙法之寶，奉述天旨，微表讚揚，式命有司綴于終卷。」",
        "translation": "As a leisurely moment of inquiry, I purified my mind with the treasure of the marvelous Dharma and recited the divine teachings, praised them subtly, and ordered officials to compile them into the final volume.",
        "source": "T50n2053_007:0258b24_12"
    },
    {
        "source_sentence": "自是帝既情信日隆，平章法義，福田功德無輟於口，與法師無暫相離，",
        "translation": "Since then the Emperor had strong feelings of faith and believed in Buddhism, peacefully discussed the doctrine and its meaning. His field of blessedness and virtue never ceased to speak; he did not leave the Master for a moment.",
        "source": "T50n2053_007:0258b26_13"
    },
    {
        "source_sentence": "勅加供給，及時服臥具數令換易。",
        "translation": "I ordered them to make additional offerings and change the bedding for several times at the appointed time.",
        "source": "T50n2053_007:0258b29_0"
    },
    {
        "source_sentence": "秋七月景申，夏罷，又施法師納袈裟一領，價直百金。",
        "translation": "In the autumn and in the seventh month, at the end of the summer, he again presented to the Master one hundred pieces of monastic robe worth one lakh of gold for the purpose of carrying his robe.",
        "source": "T50n2053_007:0258b29_1"
    },
    {
        "source_sentence": "觀其作製，都不知鍼線出入所從。",
        "translation": "Observing what he made, they didn't know where the needle thread came from and went.",
        "source": "T50n2053_007:0258c02_0"
    },
    {
        "source_sentence": "　帝庫內多有前代諸納，咸無好者，故自教後宮造此，將為稱意，營之數歲方成，",
        "translation": "In the imperial treasury there were many images of former dynasties but none of them had any good appearance. Thus the king himself instructed the ladies in the rear quarters to build this pavilion for his enjoyment, and it was completed after",
        "source": "T50n2053_007:0258c02_1"
    },
    {
        "source_sentence": "乘輿四巡，恒將隨逐。",
        "translation": "The Master traveled on four excursions in a carriage and always followed them.",
        "source": "T50n2053_007:0258c04_2"
    },
    {
        "source_sentence": "二十二年，　駕幸洛陽宮，時蘇州道恭法師、常州慧宣法師並有高行，",
        "translation": "In the twenty-second year he visited the palace of Luoyang. At that time the Master Daogong of Suzhou and the Master Huixuan of Changzhou both had lofty practices.",
        "source": "T50n2053_007:0258c05_3"
    },
    {
        "source_sentence": "學該內外，為朝野所稱。",
        "translation": "He studied both Buddhist and non-Buddhist teachings and was praised by the court and the common people.",
        "source": "T50n2053_007:0258c06_4"
    },
    {
        "source_sentence": "　帝召之。",
        "translation": "The emperor summoned him.",
        "source": "T50n2053_007:0258c07_5"
    },
    {
        "source_sentence": "既至，引入坐言訖。",
        "translation": "When he arrived, he was ushered into his seat and told him to finish speaking.",
        "source": "T50n2053_007:0258c07_6"
    },
    {
        "source_sentence": "時二僧各披一納，是梁武帝施其先師，相承共寶。",
        "translation": "The two monks then each wore one robe, which was given to their late teacher by Emperor Wu of the Liang dynasty and shared the same treasure.",
        "source": "T50n2053_007:0258c08_7"
    },
    {
        "source_sentence": "既來謁　龍顏，故取披服。",
        "translation": "Having come to see the dragon’s countenance, he took his undergarments and clothed himself.",
        "source": "T50n2053_007:0258c09_8"
    },
    {
        "source_sentence": "　帝哂其不妙，取納令示，仍遣賦詩以詠。",
        "translation": "The emperor sighed at his inefficiency and ordered him to show it, but he still sent a letter of commendation to compose the poem.",
        "source": "T50n2053_007:0258c10_0"
    },
    {
        "source_sentence": "恭公詩曰：「福田資像德，聖種理幽薰。",
        "translation": "Gonggong composed a poem in which he said, “The field of blessedness provides for the virtues of an image. The seeds of holiness and doctrine are mysterious and fragrant.",
        "source": "T50n2053_007:0258c11_1"
    },
    {
        "source_sentence": "不持金作縷，還用綵成文。",
        "translation": "They don't carry gold thread made into thread, but instead use silk to form the text.",
        "source": "T50n2053_007:0258c11_2"
    },
    {
        "source_sentence": "朱青自掩映，翠綺相氛氳，獨有離離葉，恒向稻畦分。」",
        "translation": "The vermilion and blue themselves are self-illuminating, the emerald and resplendent characteristics are fragrant, and there's a separate leaf alone that always faces the rice bed.",
        "source": "T50n2053_007:0258c12_3"
    },
    {
        "source_sentence": "宣公詩末云：「如蒙一披服，方堪稱福田。」",
        "translation": "At the end of the poem, Xuan Gong said, If you were to receive a single robe, you'd be able to call yourself a field of merit.",
        "source": "T50n2053_007:0258c13_4"
    },
    {
        "source_sentence": "意欲之。",
        "translation": "They want it.",
        "source": "T50n2053_007:0258c14_5"
    },
    {
        "source_sentence": "　帝並不與，各施絹五十匹，即此納也。",
        "translation": "The emperor didn't give it to him, and each gave fifty pieces of silk, which were collected here.",
        "source": "T50n2053_007:0258c15_6"
    },
    {
        "source_sentence": "傳其麗絕，豈常人所宜服用，唯法師盛德當之矣。",
        "translation": "It is said to be so beautiful that it would not be proper for ordinary people to wear it. Only the Master, who was endowed with great virtue, should wear it.",
        "source": "T50n2053_007:0258c16_7"
    },
    {
        "source_sentence": "時并賜法師剃刀一口，法師表謝曰：「沙門玄奘伏奉勅賜納袈裟一領、剃刀一口。",
        "translation": "At that time the Master was also given a bowl to shave his sword. The Master wrote a letter of thanks in which he said: O śramaṇa Xuanzang, I humbly beg Your Majesty to grant me one roll of the monk’s robe and",
        "source": "T50n2053_007:0258c17_8"
    },
    {
        "source_sentence": "殊命荐臻，寵靈隆赫，恭對惶悸，如履春氷。",
        "translation": "He was honored and praised by the Emperor as one whose spiritual influences were so great that he trembled in fear like a springtime ice.",
        "source": "T50n2053_007:0258c19_9"
    },
    {
        "source_sentence": "玄奘幸遭邕穆之化，早預息心之侶，三業無紀，四恩靡答，謬迴天睠，",
        "translation": "It is fortunate that I have been influenced by Yongmu, who predicted my future enlightenment early to those who wished to restrain their minds. The three deeds are unreliable and the four kinds of benevolence are in",
        "source": "T50n2053_007:0258c20_10"
    },
    {
        "source_sentence": "濫叨雲澤。",
        "translation": "It's a mixture of clouds and marsh.",
        "source": "T50n2053_007:0258c21_11"
    },
    {
        "source_sentence": "忍辱之服彩合流霞，智慧之刀銛逾切玉。",
        "translation": "The color of the robe of forbearance combines with the colors of the sun and moon, and the sword of wisdom is sharper than cutting jade.",
        "source": "T50n2053_007:0258c22_12"
    },
    {
        "source_sentence": "謹當衣以降煩惱之魔，佩以斷塵勞之網。",
        "translation": "I'm afraid of the demon of affliction that follows my robe, and I wear it to cut off the web of worldly suffering.",
        "source": "T50n2053_007:0258c23_13"
    },
    {
        "source_sentence": "起餘譏於彼己，懼空疎於冐榮。",
        "translation": "They give rise to other criticisms of themselves, fearing that emptiness will leave their prosperity behind.",
        "source": "T50n2053_007:0258c24_14"
    },
    {
        "source_sentence": "慚恧屏營，趍承俯僂，鞠心跼蹐，精爽飛越。",
        "translation": "I am ashamed of my humble deeds in the seclusion, feeling shame and embarrassed. I bend down to take pity on you and bow at your shoulders. My heart is offended by the thought that you have been",
        "source": "T50n2053_007:0258c24_15"
    },
    {
        "source_sentence": "不任悚荷之至。",
        "translation": "They can't tolerate the arrival of fearfulness.",
        "source": "T50n2053_007:0258c25_16"
    },
    {
        "source_sentence": "謹奉表謝以聞。",
        "translation": "I respectfully submit this letter to express my thanks for your hearing.",
        "source": "T50n2053_007:0258c26_17"
    },
    {
        "source_sentence": "塵黷聖鑒，伏深戰慄。」",
        "translation": "The holy mirror of the dust and dirt is so deep and terrifying to subdue.",
        "source": "T50n2053_007:0258c26_18"
    },
    {
        "source_sentence": "　帝少勞兵事，纂曆之後又心存兆庶，及遼東征罰，櫛沐風霜，旋旆已來，",
        "translation": "The emperor had little involvement with military affairs, and after the compilation of the calendar he cherished the thoughts of the common people. He travelled to the regions in the eastern part of the empire to seek punishment. His com",
        "source": "T50n2053_007:0258c27_19"
    },
    {
        "source_sentence": "氣力頗不如平昔，有憂生之慮。",
        "translation": "Their vitality is not as strong as what it was in the past and they have sorrowful thoughts.",
        "source": "T50n2053_007:0258c28_20"
    },
    {
        "source_sentence": "既遇法師，遂留心八正，牆塹五乘，遂將息平復。",
        "translation": "When he met the Master, he fixed his mind on the Eightfold Noble Path and guarded the walls and moats of the five vehicles so as to keep calm and restore peace.",
        "source": "T50n2053_007:0258c29_21"
    },
    {
        "source_sentence": "因問：「欲樹功德，何最饒益？」",
        "translation": "He asked, What's the most beneficial for the merit of wanting a tree?",
        "source": "T50n2053_007:0259a01_22"
    },
    {
        "source_sentence": "法師對曰：「眾生寢惑，非慧莫啟。",
        "translation": "The Master said in reply, “Sentient beings are tormented by sleep. What is not enlightened by wisdom cannot be enlightened.",
        "source": "T50n2053_007:0259a02_23"
    },
    {
        "source_sentence": "慧芽抽殖，法為其資。",
        "translation": "The sprouts of wisdom are planted, and the Dharma is their support.",
        "source": "T50n2053_007:0259a03_24"
    },
    {
        "source_sentence": "弘法由人，即度僧為最。」",
        "translation": "A person who promotes the Dharma is the best at liberating the saṃgha.",
        "source": "T50n2053_007:0259a03_25"
    },
    {
        "source_sentence": "　帝甚歡。",
        "translation": "The emperor was overjoyed.",
        "source": "T50n2053_007:0259a04_26"
    },
    {
        "source_sentence": "秋九月己卯，詔曰：「昔隋季失御，天下分崩，四海塗原，八埏鼎沸。",
        "translation": "On the first day of the ninth month in the autumn, an imperial edict was issued saying: Formerly the ruler of the Sui dynasty lost his power and the empire fell apart. The four seas covered the plains and the eight",
        "source": "T50n2053_007:0259a04_27"
    },
    {
        "source_sentence": "朕屬當戡亂，躬履兵鋒，丞犯風霜，宿於馬上。",
        "translation": "We will fight against the enemy, and our troops will march in person at their vanguard. Toward the end of the month we are confronted by wind and frost and spend the night on horseback.",
        "source": "T50n2053_007:0259a05_28"
    },
    {
        "source_sentence": "比加藥餌猶未痊除，近日已來方就平復，豈非福善所感而致此休徵耶？",
        "translation": "He's still not cured by the addition of medicine and food, and he's only recently recovered. Isn't it the result of merit and goodness that causes this to cease?",
        "source": "T50n2053_007:0259a06_29"
    },
    {
        "source_sentence": "京城及天下諸州寺宜各度五人，弘福寺宜度五十人。」",
        "translation": "It's appropriate to save five people in the capital and fifty people in each of the states under heaven, and it's appropriate to save fifty people in Hongfu Monastery.",
        "source": "T50n2053_007:0259a08_30"
    },
    {
        "source_sentence": "計海內寺三千七百一十六所，計度僧尼一萬八千五百餘人。",
        "translation": "There are three thousand seven hundred and sixteen monasteries in the empire, with a total number of more than eighteen thousand five hundred monks and nuns.",
        "source": "T50n2053_007:0259a09_31"
    },
    {
        "source_sentence": "未此已前，天下寺廟遭隋季凋殘，緇侶將絕，蒙茲一度，並成徒眾。",
        "translation": "Before then the monasteries and shrines of the empire suffered decay during the Sui dynasty, and Buddhist monks were about to be exterminated. After one rebirth they all became a community of Buddhist followers.",
        "source": "T50n2053_007:0259a11_32"
    },
    {
        "source_sentence": "美哉！",
        "translation": "How wonderful!",
        "source": "T50n2053_007:0259a12_33"
    },
    {
        "source_sentence": "君子所以重正言也。",
        "translation": "That's why it's so important, gentlemen, to say correctly.",
        "source": "T50n2053_007:0259a12_34"
    },
    {
        "source_sentence": "　帝又問：「《金剛般若經》一切諸佛之所從生，聞而不謗，功逾身命之施，",
        "translation": "The emperor also asked, “The Diamond Sutra is the source of all the buddhas’ teachings; it has not been slandered by anyone who hears it and its merit exceeds that of giving his life.",
        "source": "T50n2053_007:0259a13_35"
    },
    {
        "source_sentence": "非恒沙珍寶所及。",
        "translation": "It's beyond the reach of the treasures of the sands of the Ganges.",
        "source": "T50n2053_007:0259a15_36"
    },
    {
        "source_sentence": "加以理微言約，故賢達君子多愛受持，未知先代所翻，文義具不？」",
        "translation": "Furthermore, since the principle is subtle and the words are limited, why would gentlemen like to retain it so much if they don't know the texts translated by previous generations?",
        "source": "T50n2053_007:0259a15_37"
    },
    {
        "source_sentence": "法師對曰：「此經功德實如聖旨。",
        "translation": "The Master said in reply, “The merit of this sutra is really as the holy teaching.",
        "source": "T50n2053_007:0259a17_38"
    },
    {
        "source_sentence": "西方之人咸同愛敬。",
        "translation": "People in the West all love and respect him.",
        "source": "T50n2053_007:0259a17_39"
    },
    {
        "source_sentence": "今觀舊經，亦微有遺漏。",
        "translation": "Now we observe that the old scriptures have slight residual errors.",
        "source": "T50n2053_007:0259a18_40"
    },
    {
        "source_sentence": "據梵本具云『能斷金剛般若』，舊經直云『金剛般若』。",
        "translation": "According to the Sanskrit text, it's called'vajra-prajñāpāramitā that can be cut off,' and the old sūtras simply say'vajra-prajñāpāramitā.'",
        "source": "T50n2053_007:0259a18_41"
    },
    {
        "source_sentence": "欲明菩薩以分別為煩惱，而分別之惑，堅類金剛，唯此經所詮無分別慧，",
        "translation": "They want to show that the bodhisattvas have discrimination as their defilement, but the passions of discrimination are hard and adamantine. Only this sūtra teaches that there is no discriminating wisdom.",
        "source": "T50n2053_007:0259a20_42"
    },
    {
        "source_sentence": "乃能除斷，故曰『能斷金剛般若』，故知舊經失上二字。",
        "translation": "He's able to remove it and therefore says, 'He can cut off the adamantine prajñāpāramitā,' so he knows that the old sūtras lost the above two words.",
        "source": "T50n2053_007:0259a21_43"
    },
    {
        "source_sentence": "又如下文，三問闕一，二頌闕一，九喻闕三，如是等。",
        "translation": "Also, as explained below, the three questions are missing one, the two verses are missing one, and the nine metaphors are missing three, etc.",
        "source": "T50n2053_007:0259a23_44"
    },
    {
        "source_sentence": "什法師所翻舍衛國也，留支所翻婆伽婆者，少可。」",
        "translation": "It's a translation of Śrāvastī by the teacher Kumārajīva, and it's rare to see a translation of Bhagavān by Ruci.",
        "source": "T50n2053_007:0259a24_45"
    },
    {
        "source_sentence": "　帝曰：「師既有梵本，可更委翻，使眾生聞之具足。",
        "translation": "The emperor said, “Since the teacher has a Sanskrit text, we should entrust him with translating it so that sentient beings will be able to hear it.",
        "source": "T50n2053_007:0259a25_46"
    },
    {
        "source_sentence": "然經本貴理，不必須飾文而乖義也。」",
        "translation": "However, the sūtras are originally valuable in principle, so they don't need to adorn their texts and diverge from their meaning.",
        "source": "T50n2053_007:0259a26_47"
    },
    {
        "source_sentence": "故今新翻《能斷金剛般若》，委依梵本。",
        "translation": "That's why the newly translated Vajrapāṇi Prajñāpāramitā that cuts off the diamond is entrusted to the Sanskrit text.",
        "source": "T50n2053_007:0259a27_48"
    },
    {
        "source_sentence": "奏之，　帝甚悅。",
        "translation": "The emperor was delighted to hear this announcement.",
        "source": "T50n2053_007:0259a28_49"
    },
    {
        "source_sentence": "冬十月，車駕還京，法師亦從還。",
        "translation": "In the tenth month in the winter, he returned by carriage to the capital, and the Master also returned with it.",
        "source": "T50n2053_007:0259a28_50"
    },
    {
        "source_sentence": "先是　勅所司於北闕紫微殿西別營一所，號弘法院。",
        "translation": "Formerly I ordered the authorities to build a separate building west of the purple palace in the northern part of the monastery, called Hongfa Monastery.",
        "source": "T50n2053_007:0259a29_51"
    },
    {
        "source_sentence": "既到，居之。",
        "translation": "When he arrived, he stayed there.",
        "source": "T50n2053_007:0259b01_52"
    },
    {
        "source_sentence": "晝則帝留談說，夜乃還院翻經。",
        "translation": "On the day, the emperor stayed to discuss the matter and at night he returned to the court to translate the scriptures.",
        "source": "T50n2053_007:0259b02_53"
    },
    {
        "source_sentence": "更譯無性菩薩所釋《攝大乘論》十卷，世親論十卷，《緣起聖道經》一卷，",
        "translation": "He translated ten fascicles of the Compendium of the Great Vehicle, which was expounded by the Bodhisattva Wuxiang withoutessence and ten fascicles of Vasubandhu’s treatise.",
        "source": "T50n2053_007:0259b02_54"
    },
    {
        "source_sentence": "《百法明門論》一卷。",
        "translation": "One volume of the Treatise on the Luminous Gate of the One Hundred Teachings, one volume.",
        "source": "T50n2053_007:0259b04_55"
    },
    {
        "source_sentence": "戊申，皇大子又宣令曰：「營慈恩寺漸向畢功，輪奐將成，僧徒尚闕，",
        "translation": "On the fifteenth day, the crown prince again issued an imperial decree, saying: The construction of Ci’un Monastery is about to be completed and the monks are still absent.",
        "source": "T50n2053_007:0259b04_56"
    },
    {
        "source_sentence": "伏奉勅旨度三百僧，別請五十大德，同奉神居降臨行道。",
        "translation": "I humbly submit to the imperial edict order to ordinate three hundred monks, who are separately invited by the fifty great virtuous ones to live together with the deities and follow the Way.",
        "source": "T50n2053_007:0259b06_57"
    },
    {
        "source_sentence": "其新營道場宜名大慈恩寺，別造翻經院，虹梁藻井，丹青雲氣，瓊礎銅沓，",
        "translation": "It is fitting that the newly built site of enlightenment should be called Great Ci’un Monastery. A separate exposition hall for translating scriptures should also be built, with rainbow beams and diamond-surfaced wells,",
        "source": "T50n2053_007:0259b07_58"
    },
    {
        "source_sentence": "金環華鋪，並加殊麗，令法師移就翻譯，仍綱維寺任。」",
        "translation": "The golden-ringed lotus spreader and the flower spreader were all decorated with a distinctive beauty, so the Master was moved to translate them and remained in charge of the temple.",
        "source": "T50n2053_007:0259b09_59"
    },
    {
        "source_sentence": "法師既奉令旨，令充上座，進啟讓曰：「沙門玄奘啟。",
        "translation": "Having honored the decree, the Master was made a superior monk and instructed to entrust him with the throne. He wrote a letter to the Emperor in which he said:",
        "source": "T50n2053_007:0259b10_60"
    },
    {
        "source_sentence": "伏奉令旨以玄奘為慈恩寺上座，恭聞嘉命，心靈靡措，屏營累息，深增戰悚。",
        "translation": "I humbly obeyed the imperial decree and made myself the abbot of Ci’un Monastery. Having respectfully heard the auspicious instruction, my mind was not disturbed by it. My mental torpor ceased in silence, and my fear",
        "source": "T50n2053_007:0259b12_0"
    },
    {
        "source_sentence": "玄奘學藝無紀，行業空疎，敢誓捐罄，方期光贊。",
        "translation": "Xuanzang studied arts and crafts but had no record of learning, and his occupations were inactive. I ventured to make a vow to donate all my teachings so as to enable him to gloriously praise them.",
        "source": "T50n2053_007:0259b13_1"
    },
    {
        "source_sentence": "憑恃皇靈，窮遐訪道，所獲經論，奉勅翻譯，情冀法流漸潤，克滋鼎祚，",
        "translation": "Relying on the spiritual power of the Emperor, he travelled far to seek the Way and obtained scriptures and commentaries translated by imperial edicts. He cherished the aspiration that the flow of the Dharma gradually moisten",
        "source": "T50n2053_007:0259b15_2"
    },
    {
        "source_sentence": "聖教紹宣，光華史冊。",
        "translation": "Shao Xuan of the holy teachings, Guanghua Shiji.",
        "source": "T50n2053_007:0259b16_3"
    },
    {
        "source_sentence": "玄奘昔冒危途，久嬰痾疹，駑蹇力弊，恐不卒業，孤負國恩，有罰無赦。",
        "translation": "Formerly I was on a dangerous journey and suffered from chronic abscess rashness for a long time. Fearing that I might not be able to leave the householder’s life, I was orphaned by the helplessness of my country and suffered",
        "source": "T50n2053_007:0259b17_4"
    },
    {
        "source_sentence": "命知僧務，更貽重譴，魚鳥易性，飛沈失途。",
        "translation": "Knowing about the affairs of the monastic community, the king ordered them to be punished again and again. Fish and birds lost their way in a seaable condition and flew off on their way.",
        "source": "T50n2053_007:0259b19_5"
    },
    {
        "source_sentence": "伏惟皇大子殿下仁孝天縱，愛敬因心，感風樹之悲，結寒泉之痛，式建伽藍，",
        "translation": "I humbly wish that Your Majesty, the Great Prince, a benevolent and filial ruler who is naturally affectionate toward all living beings with affection and respect, may be moved by the compassion of the wind and the sorrow of the trees",
        "source": "T50n2053_007:0259b20_6"
    },
    {
        "source_sentence": "將弘景福，匡理法眾，任在能人，用非其器，必有蹎仆。",
        "translation": "He will spread great blessedness and promote the principle of Buddhism in order to protect the Dharma community. It is up to those who are capable to do so, but if they don't use it as a vessel, there must be an unworthy servant",
        "source": "T50n2053_007:0259b21_7"
    },
    {
        "source_sentence": "伏願叡情遠鑑，照弘法之福因，慈造曲垂，察愚鄙之忠欵，則法僧無悔吝之咎，",
        "translation": "I humbly wish that Your Majesty’s wise mind may be like a distant mirror, illuminating the causes of virtue of the propagation of the doctrine. With compassion and benevolence you should create benevolent ways to punish the ignorant and",
        "source": "T50n2053_007:0259b23_8"
    },
    {
        "source_sentence": "魚鳥得飛沈之趣。",
        "translation": "Fish and birds attain the destinies of flying and sinking.",
        "source": "T50n2053_007:0259b25_9"
    },
    {
        "source_sentence": "不任瀝懇之至，謹奉啟陳情，伏用悚悸。」",
        "translation": "I can't tolerate the arrival of this kindness, so I respectfully express my feelings and submit with fear.",
        "source": "T50n2053_007:0259b25_10"
    },
    {
        "source_sentence": "十二月戊辰，又勅太常卿江夏王道宗將九部樂，萬年令宋行質、長安令裴方彥各率縣內音聲，",
        "translation": "On the fifteenth day of the twelfth month, an imperial decree was also issued:",
        "source": "T50n2053_007:0259b26_11"
    },
    {
        "source_sentence": "及諸寺幢帳，並使豫極莊嚴。",
        "translation": "It was also decorated with the banners and drapes of all the monasteries.",
        "source": "T50n2053_007:0259b29_0"
    },
    {
        "source_sentence": "己巳，旦集安福門街，迎像送僧入大慈恩寺。",
        "translation": "On the morning of the twenty-third day they assembled at the street corner of Anfu Gate to greet the image and send the monks to the Great Ci’en Monas­ tery.",
        "source": "T50n2053_007:0259b29_1"
    },
    {
        "source_sentence": "至是陳列於通衢，其錦綵軒轞，魚龍幢戲，凡千五百餘乘，帳蓋三百餘事。",
        "translation": "At that point they were arrayed in the thoroughfares, decorated with brocaded silk curtains and draped with fish and dragon banners. There were more than one thousand five hundred mounted carriages, covered with canopies covering",
        "source": "T50n2053_007:0259c01_2"
    },
    {
        "source_sentence": "先是內出繡畫等像二百餘軀，金銀像兩軀，金縷綾羅幡五百口，宿於弘福寺，",
        "translation": "He had previously produced more than two hundred embroidered and painted images inside the stupa. Two sets of golden and silver images, with five hundred mouthfuls of golden thread and lapis lazuli banners, were preserved in Hongfu Monaster",
        "source": "T50n2053_007:0259c03_3"
    },
    {
        "source_sentence": "并法師西國所將經、像、舍利等，爰自弘福引出，安置於帳座及諸車上，",
        "translation": "And the scriptures, images, relics, and other objects brought by the Master from the Western Regions were placed on a canopy seat or on top of the chariots that he had brought out for his blessedness.",
        "source": "T50n2053_007:0259c05_4"
    },
    {
        "source_sentence": "處中而進。",
        "translation": "He advances in his place.",
        "source": "T50n2053_007:0259c06_5"
    },
    {
        "source_sentence": "又於像前兩邊各嚴大車，車上竪長竿懸幡，幡後即有師子神王等為前引儀。",
        "translation": "On both sides in front of the statue there was a large chariot decorated with long poles and hanging banners. Behind the banners were lion spirits, kings, etc., who led the procession before them.",
        "source": "T50n2053_007:0259c07_6"
    },
    {
        "source_sentence": "又莊寶車五十乘坐諸大德，次京城僧眾執持香花，唄讚隨後，次文武百官各將侍衛部列陪從，",
        "translation": "There were also fifty carts decorated with jewels and ridden by various virtuous monks. Next, the assembled monks of the capital city, holding incense and flowers and singing hymns of praise, followed one after the other",
        "source": "T50n2053_007:0259c09_7"
    },
    {
        "source_sentence": "大常九部樂挾兩邊，二縣音聲繼其後，而幢幡鐘鼓訇磕繽紛，眩日浮空，",
        "translation": "The great and constant music of the nine kinds of music played on both sides, with the sounds of the two prefectures following behind them. Banners, pennants, bells, drums, chimes, and jingles played in unison, da",
        "source": "T50n2053_007:0259c11_8"
    },
    {
        "source_sentence": "震曜都邑，望之極目不知其前後。",
        "translation": "The capital city of Zhenyao was so greatly visible that no one could tell which direction it was going.",
        "source": "T50n2053_007:0259c13_9"
    },
    {
        "source_sentence": "皇太子遣率尉遲紹宗、副率王文訓領東宮兵千餘人充手力，　勅遣御史大夫李乾祐為大使，",
        "translation": "The crown prince sent his captain, late Shaozong, and the deputy captain, Wang Wenjun, commanding more than one thousand troops of soldiers from the eastern palace to serve as their ambassadors, ordered Li Qianyou",
        "source": "T50n2053_007:0259c13_10"
    },
    {
        "source_sentence": "與武侯相知撿挍。",
        "translation": "He and the marquis of Wu knew each other's secrets and asked questions.",
        "source": "T50n2053_007:0259c16_11"
    },
    {
        "source_sentence": "　帝將皇太子、後宮等於安福門樓手執香爐目而送之，甚悅。",
        "translation": "The emperor, together with the princes of the imperial family and the ladies in the rear palace, held the eyes of the censer in their hands at the tower of Anfu Gate and sent it off. They were delighted.",
        "source": "T50n2053_007:0259c16_12"
    },
    {
        "source_sentence": "衢路觀者數億萬人。",
        "translation": "There were hundreds of millions of people on the street corners observing it.",
        "source": "T50n2053_007:0259c18_13"
    },
    {
        "source_sentence": "經像至寺門，勅趙公、英公、中書褚令執香爐引入，安置殿內，奏九部樂、破陣舞及諸戲於庭，",
        "translation": "When the scriptures and images arrived at the door of the monastery, an imperial decree was issued to summon the Licchavi ministers Zhao Gong, Ying Gong, and Chu Choi, who were in charge of the central office",
        "source": "T50n2053_007:0259c18_14"
    },
    {
        "source_sentence": "訖而還。",
        "translation": "After he finished, he returned.",
        "source": "T50n2053_007:0259c20_15"
    },
    {
        "source_sentence": "壬申，將欲度僧。",
        "translation": "In the autumn, he was about to save the monks.",
        "source": "T50n2053_007:0259c21_16"
    },
    {
        "source_sentence": "辛未，　皇太子與仗衛出宿故宅。",
        "translation": "In the late autumn, the prince and his army guards left their old residence to spend the night together.",
        "source": "T50n2053_007:0259c21_17"
    },
    {
        "source_sentence": "後日旦，從寺南列羽儀而來，至門，下乘步入，百寮陪從。",
        "translation": "On the following day morning, he came from the south of the monastery in a lined manner and approached the gate. He entered on foot or by carriage, accompanied by one hundred monks who lived with him.",
        "source": "T50n2053_007:0259c22_18"
    },
    {
        "source_sentence": "禮佛已，引五十大德相見，陳造寺所為意，發言嗚噎，酸感。",
        "translation": "After paying homage to the Buddha, he invited fifty great virtuous monks to see him. The purpose of the monastery built by Prince Chen was to express his sorrowful feelings and uttered these words: “Alas!",
        "source": "T50n2053_007:0259c23_19"
    },
    {
        "source_sentence": "傍人、侍臣及僧無不哽泣，觀蒸蒸之情，亦今之舜也。",
        "translation": "None of the attendants, servants, or monks wept in tears and observed that the feeling of steaming was also the present-day Shun.",
        "source": "T50n2053_007:0259c24_20"
    },
    {
        "source_sentence": "言訖，昇殿東閣，令少詹事張行成宣恩宥降京畿見禁囚徒，然後剃髮觀齋，",
        "translation": "At the end of his speech, he ascended to the eastern pavilion of the palace and ordered the young Licchavi minister Zhang Xing, who had been instructed by imperial grace, to pardon the imprisoned prisoners in the capital",
        "source": "T50n2053_007:0259c26_21"
    },
    {
        "source_sentence": "及賜王公已下束帛訖。",
        "translation": "After he had given it to the king and gong, he wrapped a bundle of silk under him.",
        "source": "T50n2053_007:0259c28_0"
    },
    {
        "source_sentence": "屏人下閣禮佛，與妃等巡歷廊宇。",
        "translation": "The people in the secluded pavilion worshipped the Buddha and traveled through the corridors with the queen and others.",
        "source": "T50n2053_007:0259c28_1"
    },
    {
        "source_sentence": "至法師房，製五言詩帖於戶曰：「停軒觀福殿，遊目眺皇畿。",
        "translation": "When he arrived at the Master’s quarters, he composed a five-syllable poem to be placed in the door of the room, saying: I am staying at the hall of blessedness and traveling through the imperial capital.",
        "source": "T50n2053_007:0259c29_2"
    },
    {
        "source_sentence": "法輪含日轉，花蓋接雲飛。",
        "translation": "The wheel of the Dharma contains the turning of the sun, and the flowered canopy touches the clouds and flies.",
        "source": "T50n2053_007:0260a01_3"
    },
    {
        "source_sentence": "翠烟香綺閣，丹霞光寶衣。",
        "translation": "It is surrounded by a beautiful pavilion with an odorless fragrance and shining jeweled robes like the glory of the sunset.",
        "source": "T50n2053_007:0260a02_4"
    },
    {
        "source_sentence": "幡虹遙合彩，空外逈分暉。",
        "translation": "The colors of the banners and rainbows are combined from a distance, and the silhouettering patterns outside the sky shine distinctly.",
        "source": "T50n2053_007:0260a03_5"
    },
    {
        "source_sentence": "蕭然登十地，自得會三歸。」",
        "translation": "Śāriputra ascended to the tenth ground and attained the three refuges on his own.",
        "source": "T50n2053_007:0260a03_6"
    },
    {
        "source_sentence": "觀訖還宮。",
        "translation": "After observing it, he returned to the palace.",
        "source": "T50n2053_007:0260a04_7"
    },
    {
        "source_sentence": "是時緇素歡欣，更相慶慰，莫不歌玄風重盛，遺法再隆，近古以來未曾有也。",
        "translation": "At that time the monks and nuns were both delighted and greeted each other with great joy. All of them sang hymns of praise to the emperor, singing his mysterious verses in high volume. The transmitted teachings",
        "source": "T50n2053_007:0260a04_8"
    },
    {
        "source_sentence": "其日，勅追法師還北闕。",
        "translation": "On that day an imperial edict was issued chasing the Master back to the northern palace.",
        "source": "T50n2053_007:0260a06_9"
    },
    {
        "source_sentence": "二十三年夏四月，駕幸翠微宮，　皇太子及法師並陪從。",
        "translation": "In the fourth month in the summer of the twenty-third year, he visited the palace of Cuiwei and accompanied it with the crown prince and the Master.",
        "source": "T50n2053_007:0260a07_10"
    },
    {
        "source_sentence": "既至，處分之外，唯談玄論道，問因果報應，及西域先聖遺芳故迹，皆引經詶對。",
        "translation": "On arriving there, the Master went out of his own quarters to discuss the profound theories and theory of the Way. He inquired into the law of causality and karmic retribution as well as the old traces left by the ancient sages",
        "source": "T50n2053_007:0260a08_11"
    },
    {
        "source_sentence": "　帝深信納，數攘袂嘆曰：「朕共師相逢晚，不得廣興佛事。」",
        "translation": "The emperor was deeply convinced, and he repeatedly shook his sleeves and exclaimed, When we met with the teacher at night, we couldn't perform the Buddha's service.",
        "source": "T50n2053_007:0260a10_12"
    },
    {
        "source_sentence": "　帝發京時雖少違和，而神威睿慮無減平昔。",
        "translation": "Although the emperor's departure from the capital was at odds with the peace, his supernatural power and wisdom never diminished in the past.",
        "source": "T50n2053_007:0260a12_0"
    },
    {
        "source_sentence": "至五月己巳，微加頭痛，留法師宿宮中。",
        "translation": "On the fifth day of the fifth month, he had a slight headache and stayed overnight in the palace with the Master.",
        "source": "T50n2053_007:0260a13_1"
    },
    {
        "source_sentence": "庚午，帝崩於含風殿。",
        "translation": "On the first day of the seventh month, the emperor died in the hall containing the wind.",
        "source": "T50n2053_007:0260a14_2"
    },
    {
        "source_sentence": "時祕不言，還京發喪，殯太極殿。",
        "translation": "Without saying a secret, he returned to the capital and died, buried in the Taichi Hall.",
        "source": "T50n2053_007:0260a14_3"
    },
    {
        "source_sentence": "其日　皇太子即皇帝位於梓宮之側，踰年改元曰永徽，萬方號慟，如喪考妣。",
        "translation": "On that day the crown prince, the emperor, was at the side of the imperial palace. For a year he changed his name to Yonghui (i.e., Yonghui). All the people in all directions wailed in grief just as",
        "source": "T50n2053_007:0260a15_4"
    },
    {
        "source_sentence": "法師還慈恩寺。",
        "translation": "The Master returned to Ci’un Monastery.",
        "source": "T50n2053_007:0260a17_5"
    },
    {
        "source_sentence": "自此之後，專務翻譯，無棄寸陰。",
        "translation": "Since then he devoted himself exclusively to translating the scriptures without abandoning the one-inch scriptures.",
        "source": "T50n2053_007:0260a17_6"
    },
    {
        "source_sentence": "每日自立程課，若晝日有事不充，必兼夜以續之。",
        "translation": "Every day he sets up his own daily commu­ tation; if there are any business to be done during the day that is not fulfilled, he must keep it up at night.",
        "source": "T50n2053_007:0260a18_7"
    },
    {
        "source_sentence": "過乙之後方乃停筆，攝經已復禮佛行道，至三更暫眠，五更復起，讀誦梵本，",
        "translation": "After a few moments he stopped writing. Having collected the scriptures, he returned to pay homage to the Buddha and walked on the path. At three o’clock he slept for a short time and rose again at five o’clock to recite the San",
        "source": "T50n2053_007:0260a19_8"
    },
    {
        "source_sentence": "朱點次第，擬明旦所翻。",
        "translation": "The order of the vermilion dots was intended to be translated by tomorrow morning.",
        "source": "T50n2053_007:0260a21_9"
    },
    {
        "source_sentence": "每日齋訖，黃昏二時講新經論，及諸州聽學僧等恒來決疑請義。",
        "translation": "Every day when the fast was over, he taught new scriptures and treatises at two o'clock in the evening, and listened to scholars and monks from various states who always came to settle doubts about the meaning of the invitation.",
        "source": "T50n2053_007:0260a22_10"
    },
    {
        "source_sentence": "既知上座之任，僧事復來諮稟。",
        "translation": "Knowing that the abbot had been appointed, the monks and officials came again to inquire about the matter.",
        "source": "T50n2053_007:0260a23_11"
    },
    {
        "source_sentence": "復有內使遣營功德，前後造一切經十部，夾紵寶裝像二百餘軀，亦令取法師進止。",
        "translation": "There was also an envoy from the inner empire who sent men of merit to work on all the scriptures, producing ten fascicles of scriptures and more than two hundred images in jeweled caskets. He also ordered the Master to go and stay there",
        "source": "T50n2053_007:0260a24_12"
    },
    {
        "source_sentence": "日夕已去，寺內弟子百餘人咸請教誡，盈廊溢廡，皆詶答處分無遺漏者。",
        "translation": "After the day and night had passed, more than a hundred disciples in the monastery all requested admonition, filling the corridors and overflowing with crowds of monks, all responding to each other without leaving any omission.",
        "source": "T50n2053_007:0260a26_13"
    },
    {
        "source_sentence": "雖眾務輻湊，而神氣綽然，無所擁滯。",
        "translation": "Although the monks and nuns were all engaged in religious duties, their vitality was so great that there was nothing to hold them back.",
        "source": "T50n2053_007:0260a28_14"
    },
    {
        "source_sentence": "猶與諸德說西方聖賢立義，諸部異端，及少年在此周遊講肆之事，高論劇談，",
        "translation": "It is just as if you were talking to the virtuous ones about the doctrine established by the saints and wise men of the West. The heretics who belonged to different sects and youthful people traveled all over this place to attend lectures at",
        "source": "T50n2053_007:0260a29_0"
    },
    {
        "source_sentence": "竟無疲怠，其精敏強力，過人若斯。",
        "translation": "They are not exhausted, and their intelligence is as strong as that of a human being.",
        "source": "T50n2053_007:0260b01_1"
    },
    {
        "source_sentence": "復數有諸王卿相來過禮懺，逢迎誘導，並皆發心，莫不捨其驕華，肅敬稱嘆。",
        "translation": "Several other kings and ministers came to the monastery to pay their respects, greeted them, and induced them to do so. All of them decided to undertake enlightenment, but none of them abandoned their arrogance and",
        "source": "T50n2053_007:0260b02_2"
    },
    {
        "source_sentence": "二年春正月壬寅，瀛州刺史賈敦賾、蒲州刺史李道裕、穀州刺史杜正倫、恒州刺史蕭銳因朝集在京，",
        "translation": "On the first day of the first month in the spring of the second year, Jia Dunhuang, Regional Inspector of Yingzhou, Li Daoyu, Regional Inspector of Puzhou, Du Zhenglun, Regional Inspector of Kusuma",
        "source": "T50n2053_007:0260b04_3"
    },
    {
        "source_sentence": "公事之暇，相命參法師請受菩薩戒。",
        "translation": "During the emperor's official duties, they ordered each other to visit the Master and ask him to accept the bodhisattva precepts.",
        "source": "T50n2053_007:0260b06_4"
    },
    {
        "source_sentence": "法師即授之，并為廣說菩薩行法，勸其事君盡忠，臨下慈愛。",
        "translation": "The Master then taught him the Dharma and extensively explained the bodhisattva's practice of enlightening beings, exhorting his servants to be all- loyal and compassionate benefactors.",
        "source": "T50n2053_007:0260b07_5"
    },
    {
        "source_sentence": "群公歡喜，辭去。",
        "translation": "The assembled monks were delighted and departed.",
        "source": "T50n2053_007:0260b08_6"
    },
    {
        "source_sentence": "癸卯各捨淨財，共修書遣使參法師，謝聞戒法。",
        "translation": "Each of the deities renounced their pure possessions and sent an envoy to visit the Master in order to express their thanks for listening to the Vinaya.",
        "source": "T50n2053_007:0260b09_7"
    },
    {
        "source_sentence": "其書曰：「竊聞身非欲食，如來受純陀之供，法無所求，淨名遂善德之請，",
        "translation": "The inscription said, “I have heard that the Tathāgata did not wish to eat my body. He accepted the offerings offered by Cunda and sought nothing from the Dharma. Jīvaka answered Sudarśana’s request.",
        "source": "T50n2053_007:0260b10_8"
    },
    {
        "source_sentence": "皆為顯至理之常恒，示凡聖之無二。",
        "translation": "They all want to show that the ultimate principle is eternal and shows that worldlings and sages are not two.",
        "source": "T50n2053_007:0260b12_9"
    },
    {
        "source_sentence": "又是因機以接物，假相而弘道，為之者表重法之誠，受之者為行檀之福，",
        "translation": "Those who practice it show sincerity in respecting the teaching, and those who receive it are blessed by practicing charity.",
        "source": "T50n2053_007:0260b13_0"
    },
    {
        "source_sentence": "豈曰心緣於彼此，情染於名利者哉！",
        "translation": "Doesn't it mean that the mind is conditioned by both, and feelings are stained by fame and profit?",
        "source": "T50n2053_007:0260b14_1"
    },
    {
        "source_sentence": "仰惟宿殖德本，非於三四五佛，深達法相，善識一十二部，獨悟真宗，",
        "translation": "I respectfully believe that the root of virtue which has been planted in the past is not found in the three, four, or five buddhas. I deeply understand the characteristics of the Dharma and am well versed in the twelve kinds of scriptures",
        "source": "T50n2053_007:0260b15_2"
    },
    {
        "source_sentence": "遠尋聖迹，遊崛山之淨土，浴恒水之清流，入深法界，求善知識，收至文於百代之後，",
        "translation": "From a great distance he searched for holy sites and traveled to the pure land of the mountains. He bathed in the clear stream of the Ganges River and entered deep into the realm of the Dharma. Seeking spiritual benefactors, he collected",
        "source": "T50n2053_007:0260b17_3"
    },
    {
        "source_sentence": "探玄旨於千載之前。",
        "translation": "It was a thousand years before he explored the profound meaning of the teaching.",
        "source": "T50n2053_007:0260b19_4"
    },
    {
        "source_sentence": "津梁庶品，不噭不昧，等施一切，無先無後。",
        "translation": "The common people of all grades and classes, neither angry nor dull-witted, give equally to all without prior or subsequent.",
        "source": "T50n2053_007:0260b19_5"
    },
    {
        "source_sentence": "賾等識蔽二空，業淪三界，猶蠶絲之自纏，如井輪之不息。",
        "translation": "Consciousnesses like space and so forth obscure the two kinds of emptiness, and karma is submerged in the three realms, just as silkworms themselves are tethered by silk thread, like a well that doesn't stop",
        "source": "T50n2053_007:0260b20_6"
    },
    {
        "source_sentence": "雖復順教生信，隨緣悟解，頂禮歸依，受持四句，隱身而為宴坐，厭苦而求常樂，",
        "translation": "Even though they follow the teaching and give rise to faith, they are enlightened according to conditions, venerate and rely on them, accept and uphold the four phrases, sit quietly in seclusion, become disillusioned with suffering, and se",
        "source": "T50n2053_007:0260b22_7"
    },
    {
        "source_sentence": "而遠滯無明，近昏至理，未能悟佛性之在身，知境界之唯識，心非無取，",
        "translation": "They are far removed from ignorance and do not know that the buddha-nature resides in the body; they know that the objective realm is consciousness only, but mind is not without grasping.",
        "source": "T50n2053_007:0260b24_8"
    },
    {
        "source_sentence": "義涉有無，不能即八邪而入八正，行非道而通佛道。",
        "translation": "The meaning involves existence and nonexistence, which can't be the eight evils that enter the eightfold correct path and practice what's not the path that penetrates the Buddha Way.",
        "source": "T50n2053_007:0260b25_9"
    },
    {
        "source_sentence": "譬涉海而無津，猶面牆而靡見。",
        "translation": "It's like crossing the ocean without a river or facing a wall that doesn't see it.",
        "source": "T50n2053_007:0260b27_10"
    },
    {
        "source_sentence": "昨因事隙，遂得參奉，曲蒙接引，授菩薩戒。",
        "translation": "Yesterday, on account of my absence of duties, I was able to pay a visit and receive the Bodhisattva Precepts from Your Majesty.",
        "source": "T50n2053_007:0260b27_11"
    },
    {
        "source_sentence": "施以未曾有法，發其無上道心，一念破於無邊，四心盡於來際，菩提之種起自塵勞，",
        "translation": "Giving is an unprecedented dharma that gives rise to the mind of the unsurpassed path. In a single thought it destroys infinity, and its four states of mind are exhausted in the future. The seeds of enlightenment",
        "source": "T50n2053_007:0260b28_12"
    },
    {
        "source_sentence": "火中生蓮曷足為喻。",
        "translation": "It's a metaphor for producing lotus feet in the fire.",
        "source": "T50n2053_007:0260c01_13"
    },
    {
        "source_sentence": "始知如來之性即是世間，涅槃之際不殊生死，行於波若便是不行，得彼菩提翻為無得。",
        "translation": "Knowing that the Tathāgata's nature is worldly, the time of nirvāṇa doesn't differ from birth-and-death, and practicing prajñā isn't practiced, and attaining their enlightenment is trans",
        "source": "T50n2053_007:0260c02_14"
    },
    {
        "source_sentence": "忽以小機預聞大教，頂受尋思，無量歡喜。",
        "translation": "Suddenly, because of his small capacity, he foresaw the great teaching and accepted it at the top of his head with inconceivable joy.",
        "source": "T50n2053_007:0260c04_15"
    },
    {
        "source_sentence": "然夫檀義攝六，法施為優；",
        "translation": "However, the meaning of giving consists of six [factors] and giving according to doctrine is predominant.",
        "source": "T50n2053_007:0260c05_16"
    },
    {
        "source_sentence": "尊位有三，師居其一。",
        "translation": "There are three ranks of honored ones, and the teacher occupies one of them.",
        "source": "T50n2053_007:0260c06_17"
    },
    {
        "source_sentence": "弘慈利物，雖類日月之無心；",
        "translation": "They have great compassion and benefit all living beings, even though they are like the moon or the sun with no mind.",
        "source": "T50n2053_007:0260c06_18"
    },
    {
        "source_sentence": "仰照懷恩，竊同葵藿之知感。",
        "translation": "I respectfully pray that you will harbor kindness in my mind and secretly share the same feelings of affection as those of the lotus blossom.",
        "source": "T50n2053_007:0260c07_19"
    },
    {
        "source_sentence": "大士聞法捐軀，非所企及，童子見佛奉土，輒敢庶幾。",
        "translation": "The great man heard the Dharma and donated his body, but it was not what he intended to do. When the boy saw the Buddha presenting the land to him, he dared even a small amount of it.",
        "source": "T50n2053_007:0260c08_20"
    },
    {
        "source_sentence": "謹送片物表心，具如別疏。",
        "translation": "I am sending this letter to express my feelings, as described in the separate commentary.",
        "source": "T50n2053_007:0260c09_21"
    },
    {
        "source_sentence": "所願照其誠懇，生其福田，受茲微施，隨意所與，使夫墜露添海，將渤澥而俱深；",
        "translation": "Their wishes illumined their sincerity, producing fields of blessings for them. Accepting this humble gift, they gave it as they wished, so that the sea might be added to the dew and become deeper together with the vast expanse",
        "source": "T50n2053_007:0260c10_22"
    },
    {
        "source_sentence": "飛塵集岳，與須彌而永固，可久可大，幸甚幸甚。",
        "translation": "The flying dust accumulates in the mountain and becomes permanently firm like Mount Sumeru, which will be long-lasting and greatly fortunate.",
        "source": "T50n2053_007:0260c12_0"
    },
    {
        "source_sentence": "春寒尚重，願動止休宜。",
        "translation": "The cold in spring is still intense and it is advisable to move and rest.",
        "source": "T50n2053_007:0260c13_1"
    },
    {
        "source_sentence": "謹遣白書，諸無所具。",
        "translation": "I beg to send you a letter of thanks, but there is nothing more to be done.",
        "source": "T50n2053_007:0260c13_2"
    },
    {
        "source_sentence": "賈敦賾等和南。」",
        "translation": "Jia Dunhuo and other monks of the Way.",
        "source": "T50n2053_007:0260c14_3"
    },
    {
        "source_sentence": "其為朝賢所慕如是。",
        "translation": "He was thus admired by the courtiers.",
        "source": "T50n2053_007:0260c14_4"
    },
    {
        "source_sentence": "三年春三月，法師欲於寺端門之陽造石浮圖，安置西域所將經像，其意恐人代不常，",
        "translation": "In the third month in the spring of the third year, the Master wished to build a stone pagoda at the southern side of the main entrance of the monastery to house the scriptures and images brought from the Western Regions. He feared that the",
        "source": "T50n2053_007:0260c15_5"
    },
    {
        "source_sentence": "經本散失，兼防火難。",
        "translation": "The sūtras are scattered and lost in the text, which also prevents them from being damaged.",
        "source": "T50n2053_007:0260c17_6"
    },
    {
        "source_sentence": "浮圖量高三十丈，擬顯大國之崇基，為釋迦之故迹。",
        "translation": "The pagoda was thirty zhang in height and intended to show the lofty foundations of the great state, which were the old sites of the Śākyas.",
        "source": "T50n2053_007:0260c17_7"
    },
    {
        "source_sentence": "將欲營築，附表聞奏。",
        "translation": "I am about to build a monastery, and I am submitting this letter to your Presence.",
        "source": "T50n2053_007:0260c18_8"
    },
    {
        "source_sentence": "勅使中書舍人李義府報法師云：「師所營塔功大，恐難卒成，宜用甎造。",
        "translation": "I ordered the envoy, Li Yifu, a native of Zhongshou, to report to the Master: The stupas you have prepared are so great in merit that we fear they might not be completed at once.",
        "source": "T50n2053_007:0260c20_0"
    },
    {
        "source_sentence": "亦不願師辛苦，今已勅大內東宮、掖庭等七宮亡人衣物助師，足得成辦。」",
        "translation": "I don't wish for the teacher to suffer hardship, but now I've instructed the seven palaces of the great inner east palace, the storehouse hall, and so forth to assist the teacher with the lost clothing and be able to accomplish it.",
        "source": "T50n2053_007:0260c21_1"
    },
    {
        "source_sentence": "於是用甎，仍改就西院。",
        "translation": "So they abandoned the monastery and instead moved to the west court.",
        "source": "T50n2053_007:0260c23_2"
    },
    {
        "source_sentence": "其塔基面各一百四十尺，倣西域制度，不循此舊式也。",
        "translation": "Each of the foundations and faces of the stupas were 140 feet in height, following the customs of the Western Regions but not following the old style.",
        "source": "T50n2053_007:0260c24_0"
    },
    {
        "source_sentence": "塔有五級，并相輪、露槃，凡高一百八十尺。",
        "translation": "The stupas are five stories high, one hundred and eighty feet in height, with symmetrical wheels and dew-shaped niches.",
        "source": "T50n2053_007:0260c25_1"
    },
    {
        "source_sentence": "層層中心皆有舍利，或一千、二千，凡一萬餘粒。",
        "translation": "At the center of each storey there are a thousand or two thousand relics, totaling more than ten thousand grains.",
        "source": "T50n2053_007:0260c26_2"
    },
    {
        "source_sentence": "上層以石為室。",
        "translation": "The upper storeys are made of stone as the chamber.",
        "source": "T50n2053_007:0260c27_3"
    },
    {
        "source_sentence": "南面有兩碑，載二聖〈三藏聖教序〉、〈記〉，其書即尚書右僕射河南公褚遂良之筆也。",
        "translation": "On the southern side of the stupa there are two inscriptions inscribed by the two saints, The Preface to the Holy Teachings of the Tripitaka Master and the Record. These were written by Chu Suiliang, the governor of Henan",
        "source": "T50n2053_007:0260c27_4"
    },
    {
        "source_sentence": "初基塔之日，三藏自述誠願，略曰：「玄奘自惟薄祐，生不遇佛，復乘微善，",
        "translation": "On the day when the foundation of the stupa was laid, the Tripitaka Master expressed his sincere wishes and said in brief, “My humble self-recollection is that I am blessed to have never encountered a buddha in my life",
        "source": "T50n2053_007:0260c29_5"
    },
    {
        "source_sentence": "預聞像教，儻生末法，何所歸依。",
        "translation": "If you had heard the teaching of the Buddha’s images before, how could you have relied on such a scripture?",
        "source": "T50n2053_007:0261a02_6"
    },
    {
        "source_sentence": "又慶少得出家，目覩靈相，幼而慕法，耳屬遺筌。",
        "translation": "He renounced the householder’s life at an early age. His eyes were blinded by spiritual signs and when he was a child he cherished the Dharma; his ears belonged to the legacy of Buddhism.",
        "source": "T50n2053_007:0261a03_7"
    },
    {
        "source_sentence": "聞說菩薩所修行，思齊如不及；",
        "translation": "Those who heard this exhortation of the practice of enlightening beings thought they did not think well of it.",
        "source": "T50n2053_007:0261a04_8"
    },
    {
        "source_sentence": "聞說如來所證法，仰止於身心。",
        "translation": "They hear the teaching of the Dharma realized by the Tathāgata, and they revere it in body and mind.",
        "source": "T50n2053_007:0261a05_9"
    },
    {
        "source_sentence": "所以歷尊師授，博問先達。",
        "translation": "That's why he traveled to the venerable teacher and taught it, asking extensive questions of his predecessors.",
        "source": "T50n2053_007:0261a05_10"
    },
    {
        "source_sentence": "信夫漢夢西感，正教東傳，道阻且長，未能委悉，故有專門競執，多滯二常之宗。",
        "translation": "I believe that the Eastern tradition of the Right Teaching is transmitted to the West in the case of the Han dynasty, but the Way is obstructed by the long and unable to convey it. For this reason there are special schools that compete with one another",
        "source": "T50n2053_007:0261a06_11"
    },
    {
        "source_sentence": "黨同嫉異，致乖一味之旨，遂令後學相顧，靡識所歸。",
        "translation": "All the members of the sangha shared the same envy and were at odds with each other in their aim of unity, so that later generations looked to one another for help. They did not know where to return.",
        "source": "T50n2053_007:0261a08_12"
    },
    {
        "source_sentence": "是以面鷲山以增哀，慕常啼而假寐，潛祈靈祐，顯恃國威，決志出一生之域，",
        "translation": "That is why the Vulture Peak on his face, overcome with sorrow, always cries and sleeps. He prays earnestly for spiritual blessedness to show his sovereignty and decides to leave this kingdom for one lifetime.",
        "source": "T50n2053_007:0261a09_13"
    },
    {
        "source_sentence": "投身入萬死之地。",
        "translation": "He threw himself into the land of myriad deaths.",
        "source": "T50n2053_007:0261a11_14"
    },
    {
        "source_sentence": "絓是聖迹之處，備謁遺靈，但有弘法之人，遍尋正說。",
        "translation": "This was the place where the holy relics were preserved and all the spirits of the ancient teachings were preserved. Only those who propagated Buddhism preached the Dharma extensively sought everywhere to teach the correct doctrine.",
        "source": "T50n2053_007:0261a11_15"
    },
    {
        "source_sentence": "經一所，悲所見於未見；",
        "translation": "A scripture is seen by compassion in what has not been seen.",
        "source": "T50n2053_007:0261a13_16"
    },
    {
        "source_sentence": "遇一字，慶所聞於未聞，故以身命餘資，繕寫遺闕。",
        "translation": "When he encountered a single word, he was happy to hear it but not when he hadn't heard it, so he spent the rest of his body and life on copying the legacy.",
        "source": "T50n2053_007:0261a13_17"
    },
    {
        "source_sentence": "既遂誠願，言歸本朝，幸屬休明，詔許翻譯。",
        "translation": "Having fulfilled his sincere vow, the Master returned to his own court and was fortunately reassigned to the monastery in order to allow him to translate it.",
        "source": "T50n2053_007:0261a15_18"
    },
    {
        "source_sentence": "　先皇道跨金輪，聲振玉鼓，紹隆象季，允膺付屬，又降發　神衷，親裁三藏之《序》，",
        "translation": "Formerly the Way of the late Emperor passed beyond the golden wheel and his reputation resounded like a jade drum. He succeeded to the throne in the last year of the Shaolong reign of the elephant season, entrusting it",
        "source": "T50n2053_007:0261a16_19"
    },
    {
        "source_sentence": "今上春宮講道，復為述聖之《記》，可謂重光合璧，振彩聯華，渙汗垂七耀之文，",
        "translation": "In the spring of this year he preached the Way at the imperial palace and also composed the Record of the Teaching for the sake of the saints. It should be regarded as a combination of shining light and jewels, vividly colored with",
        "source": "T50n2053_007:0261a18_20"
    },
    {
        "source_sentence": "鏗鋐韻九成之奏。",
        "translation": "It's a performance of the nine accomplishments of producing and playing music.",
        "source": "T50n2053_007:0261a19_21"
    },
    {
        "source_sentence": "自東都白馬，西明草堂，傳譯之盛，詎可同日而言者也。",
        "translation": "From the eastern capital, White Horse Monastery in the east and the grass hall in the western part of Ming Monastery in the west, translated scriptures are so abundant that we can discuss them all on the same day.",
        "source": "T50n2053_007:0261a20_22"
    },
    {
        "source_sentence": "但以生靈薄運，共失所天，唯恐三藏梵本，零落忽諸，二聖天文，寂寥無紀，",
        "translation": "But, due to the weakness of his spiritual power, he was unable to manifest himself and lost his divine existence. He feared that the Sanskrit texts of the Tripitaka Master might fall into disuse and disappear; and that the two ho",
        "source": "T50n2053_007:0261a21_23"
    },
    {
        "source_sentence": "所以敬崇此塔，擬安梵本，又樹豐碑，鐫斯《序》、《記》，庶使巍峨永劫，",
        "translation": "Therefore, in order to revere this stupa he wished to place the Sanskrit text on it. He also built a richly decorated stone tablet engraved with the introduction and footnotes of these scriptures so as to make them mighty and",
        "source": "T50n2053_007:0261a23_24"
    },
    {
        "source_sentence": "願千佛同觀，氛氳聖迹，與二儀齊固。」",
        "translation": "May a thousand buddhas be observed together, and the fragrance of the holy sites be as strong as the two rituals.",
        "source": "T50n2053_007:0261a24_25"
    },
    {
        "source_sentence": "時三藏親負簣畚，擔運甎石，首尾二周，功業斯畢。",
        "translation": "At that time the Tripitaka Master was carrying a load of brass and stone in his carriage, which traveled two rounds at the beginning and end to complete its work.",
        "source": "T50n2053_007:0261a25_26"
    },
    {
        "source_sentence": "夏五月乙卯，中印度國摩訶菩提寺大德智光、慧天等致書於法師。",
        "translation": "On the twenty-first day of the fifth month in the summer, the great virtuous monks Zhiguan and Huitian of Mahāprajāpatī Monastery in Central India wrote a letter to the Master.",
        "source": "T50n2053_007:0261a26_27"
    },
    {
        "source_sentence": "智光於大、小乘及彼外書、四韋陀、五明論等莫不洞達，即戒賢法師門人之上首，",
        "translation": "Zhi Guṇaprabha had thorough knowledge of all Mahayana and Hinayana teachings as well as other non-Buddhist scriptures, the four Vedas, the theories of the five branches of learning, etc. He was the foremost among the",
        "source": "T50n2053_007:0261a28_28"
    },
    {
        "source_sentence": "五印度學者咸共宗焉。",
        "translation": "scholars of the five parts of India all shared the same doctrine.",
        "source": "T50n2053_007:0261b01_29"
    },
    {
        "source_sentence": "慧天於小乘十八部該綜明練，匠誘之德亦彼所推重，法師遊西域日常共切磋。",
        "translation": "Huitian was well versed in the teachings of the eighteen schools of the lesser vehicle and esteemed the virtues of his teacher's enticement. The Master traveled to the Western Regions on a regular basis to exchange views with him.",
        "source": "T50n2053_007:0261b01_30"
    },
    {
        "source_sentence": "彼雖半教有功，然未措心於《方等》，為其執守偏見，法師恒詆訶。",
        "translation": "Although these half-teachings are meritorious, they don't concentrate their minds on the vaipulya, and because they cling to partial views, the Master always reprimanded them.",
        "source": "T50n2053_007:0261b03_31"
    },
    {
        "source_sentence": "曲女城法集之時，又深折挫，彼亦媿伏。",
        "translation": "At the time of the compilation of the Dharma in the city of Kanyakubja, it was again deeply broken and crushed, and they were also subdued.",
        "source": "T50n2053_007:0261b05_32"
    },
    {
        "source_sentence": "自別之後，欽佇弗忘，乃使同寺沙門法長將書，并齎讚頌及[疊*毛]兩端，",
        "translation": "After his departure, he stood respectfully and didn’t forget it. So he asked the renunciant of the same monastery, Dharmadirgha, who was in charge of the writing, to send a letter with hymns of praise and two pieces of",
        "source": "T50n2053_007:0261b06_33"
    },
    {
        "source_sentence": "揄揚之心甚厚。",
        "translation": "The mind of exclamation is very generous.",
        "source": "T50n2053_007:0261b07_34"
    },
    {
        "source_sentence": "其書曰：「微妙吉祥世尊金剛座所摩訶菩提寺諸多聞眾所共圍繞上座慧天，",
        "translation": "The book said, “Sublime auspicious, the World-honored One’s adamantine throne is surrounded by learned monks of the Great Enlightenment Monastery.",
        "source": "T50n2053_007:0261b08_35"
    },
    {
        "source_sentence": "致書摩訶支那國於無量經律論妙盡精微木叉阿遮利耶：敬問無量，少病少惱。",
        "translation": "He wrote a letter to the king of Mahāqina in which he asked immeasurable questions, with few illnesses and few afflictions, about the marvelous extensive collection of scriptures and vinaya treatises from the country of Mahāqina",
        "source": "T50n2053_007:0261b09_36"
    },
    {
        "source_sentence": "我慧天苾芻今造佛大神變讚頌及諸經論比量智等，今附苾芻法長將往，",
        "translation": "I, the monk Śakra Devānām-Indra, have now composed a great hymn of praise for the Buddha's miraculous transformation and other scriptures that praise his inferential wisdom. Now, I attach this to the monk",
        "source": "T50n2053_007:0261b11_37"
    },
    {
        "source_sentence": "此無量多聞老大德阿遮利耶智光亦同前致問，鄔波索迦日授稽首和南。",
        "translation": "This immeasurable well-versed old man, the great virtuous Acala's wisdom and light, also asked the same questions as the previous one, and Upāsaka paid homage to him on the day of his ordination.",
        "source": "T50n2053_007:0261b13_38"
    },
    {
        "source_sentence": "今共寄白[疊*毛]一雙，示不空心，路遠莫怪其少，願領。",
        "translation": "Together we present a pair of white cotton cloth to show our minds that they are not in vain. No one from afar wonders at the small quantity and wishes to receive it.",
        "source": "T50n2053_007:0261b15_39"
    },
    {
        "source_sentence": "彼須經論，錄名附來，當為抄送木叉阿遮利耶，願知。」",
        "translation": "They need sūtras and treatises, and the names of the records will be appended to them, so please know that they'll be copied and sent to mokṣa-ācalya for their sake.",
        "source": "T50n2053_007:0261b16_40"
    },
    {
        "source_sentence": "其為遠賢所慕如此。",
        "translation": "He's thus admired by the distant sages.",
        "source": "T50n2053_007:0261b17_41"
    },
    {
        "source_sentence": "五年春二月，法長辭還，又索報書。",
        "translation": "In the second month in the spring of the fifth year (629), Fachang took his leave and returned home.",
        "source": "T50n2053_007:0261b18_42"
    },
    {
        "source_sentence": "法師答，并信物。",
        "translation": "The teacher of the Dharma answered, and he also believed in things.",
        "source": "T50n2053_007:0261b18_43"
    },
    {
        "source_sentence": "其書同文錄奏，然後將付使人。",
        "translation": "The book was recorded in the same text and presented to the messenger, who then handed it over to him.",
        "source": "T50n2053_007:0261b19_44"
    },
    {
        "source_sentence": "其詞曰：「大唐國苾芻玄奘謹修書中印度摩揭陀國三藏智光法師座前。",
        "translation": "His words said, Great Tang monk Xuanzang respectfully cultivates the book in front of the throne of the Tripiṭaka Master Zhiguan of Magadha in the country of Central India.",
        "source": "T50n2053_007:0261b20_0"
    },
    {
        "source_sentence": "目一辭違，俄十餘載。",
        "translation": "It had been more than ten years since the Master’s departure.",
        "source": "T50n2053_007:0261b22_1"
    },
    {
        "source_sentence": "境域遐遠，音徽莫聞。",
        "translation": "The territory of the empire is distant and unknown in terms of fame.",
        "source": "T50n2053_007:0261b23_0"
    },
    {
        "source_sentence": "思戀之情，每增延結。",
        "translation": "The feeling of thought and affection always increases the bond of prolongation.",
        "source": "T50n2053_007:0261b23_1"
    },
    {
        "source_sentence": "彼苾芻法長至，蒙問，并承起居康勝，豁然目朗，若覩尊顏。",
        "translation": "When the monk Dharmadirgha arrived, he asked questions and inherited a peaceful retreat, which looked as if he saw the venerable's face.",
        "source": "T50n2053_007:0261b24_0"
    },
    {
        "source_sentence": "踊躍之懷，筆墨難述。",
        "translation": "With a spirit of enthusiasm, it is difficult to describe with words or ink.",
        "source": "T50n2053_007:0261b25_1"
    },
    {
        "source_sentence": "節候漸暖，不審信後何如？",
        "translation": "The climate is gradually warmer and we do not know what will happen to our faith.",
        "source": "T50n2053_007:0261b25_2"
    },
    {
        "source_sentence": "又往年使還，承正法藏大法師無常，奉問摧割，不能已已。",
        "translation": "Also, when the envoy returned in olden times, he heard that the great Master Chengzheng Fazang was impermanent and asked to destroy it, but he could not do so.",
        "source": "T50n2053_007:0261b26_3"
    },
    {
        "source_sentence": "嗚呼！",
        "translation": "Aah!",
        "source": "T50n2053_007:0261b27_4"
    },
    {
        "source_sentence": "可謂苦海舟沈，天人眼滅，遷奪之痛，何期速歟！",
        "translation": "It can be said that the boat of suffering in the sea of suffering has sunk and the eyes of gods and humans have disappeared, and the pain of being displaced is so great that it cannot be sustained even for an instant.",
        "source": "T50n2053_007:0261b27_5"
    },
    {
        "source_sentence": "惟正法藏植慶曩晨，樹功長劫，故得挺沖和之茂質，標懿傑之宏才，嗣德聖天，",
        "translation": "But the true treasury of the Teaching is planted in the morning, and its fruition lasts for an eon long. Thus it produces a luxuriant quality that rises high above the ocean and harmony; it praises the great talent",
        "source": "T50n2053_007:0261b29_0"
    },
    {
        "source_sentence": "繼輝龍猛，重然智炬，再立法幢。",
        "translation": "He continued to shine brightly like a fierce dragon and the torch of wisdom burned heavily, while the flag of enlightenment was raised again.",
        "source": "T50n2053_007:0261c01_1"
    },
    {
        "source_sentence": "撲炎火於邪山，塞洪流於倒海，策疲徒於寶所，示迷眾於大方，蕩蕩焉，",
        "translation": "He suppressed the blazing fire on the mountain of error and blocked the high current in the sea of distortion. The exhausted were driven to the treasure spot, pointing out the great directions where the deluded were scattered.",
        "source": "T50n2053_007:0261c02_2"
    },
    {
        "source_sentence": "巍巍焉，實法門之棟幹也。",
        "translation": "He was a majestic and lofty man, the true pillar of the Dharma teaching.",
        "source": "T50n2053_007:0261c04_3"
    },
    {
        "source_sentence": "又如三乘半滿之教，異道斷常之書，莫不韞綜胸懷，貫練心府。",
        "translation": "It's also like the half-complete teachings of the three vehicles and the books of the heretics who cut off permanence, which are all compressed in their minds and collected in their chests and training their minds.",
        "source": "T50n2053_007:0261c04_4"
    },
    {
        "source_sentence": "文槃節而克暢，理隱昧而必彰，故使內外歸依，為印度之宗袖。",
        "translation": "Because the style of Buddhism differed from that of the Vaibhāṣika school and the theories were hidden and obscure but clearly expressed, it caused people to take refuge in both Buddhist and heretical doctrines and became the official language of India.",
        "source": "T50n2053_007:0261c06_5"
    },
    {
        "source_sentence": "加以恂恂善誘，曉夜不疲，衢罇自盈，酌而不竭。",
        "translation": "He was also good at beating and enticed, never getting tired in the morning or at night. The inns were self-contained and he did not run out of water to drink.",
        "source": "T50n2053_007:0261c07_6"
    },
    {
        "source_sentence": "玄奘昔因問道，得預參承，并荷指誨，雖曰庸愚，頗亦蓬依麻直。",
        "translation": "Formerly I, Xuanzang, asked about the Way and gained an opportunity to receive instruction from him. Although I am said to be a mediocre and ignorant man, I may well rely on the straightforwardness of my sesame roots.",
        "source": "T50n2053_007:0261c09_0"
    },
    {
        "source_sentence": "及辭還本邑，囑累尤深，慇懃之言，今猶在耳。",
        "translation": "When he took his leave and returned to his native place the instructions were especially profound. The words of sympathy are still ringing in my ears now.",
        "source": "T50n2053_007:0261c10_1"
    },
    {
        "source_sentence": "方冀保安眉壽，式贊玄風，豈謂一朝奄歸萬古，追惟永往，彌不可任。",
        "translation": "I only wish to praise the mysterious wind of safety and longevity in order to express my admiration for it. Isn’t that one day he returns to his hometown after a thousand eons, so as to keep track of what he has done",
        "source": "T50n2053_007:0261c11_2"
    },
    {
        "source_sentence": "伏惟法師夙承雅訓，早昇堂室，攀戀之情當難可處，奈何奈何。",
        "translation": "I humbly believe that the Master, who had always followed the correct teachings, ascended early into the hall and stayed there. It must be difficult to find a place for his attachment, so why should he do so?",
        "source": "T50n2053_007:0261c13_3"
    },
    {
        "source_sentence": "有為法爾，當可奈何，願自裁抑。",
        "translation": "Conditioned things are dharmas, so what can we rely on? We entreat you to judge for us.",
        "source": "T50n2053_007:0261c14_4"
    },
    {
        "source_sentence": "昔大覺潛暉，迦葉紹宣洪業；",
        "translation": "Formerly the Great Enlightened One was latent and brilliant, while Kāśyapa Shao proclaimed his great work.",
        "source": "T50n2053_007:0261c15_5"
    },
    {
        "source_sentence": "商那遷化，毱多闡其嘉猷。",
        "translation": "Shanna was transformed into a monk, and many of his disciples taught him the fine arts.",
        "source": "T50n2053_007:0261c16_6"
    },
    {
        "source_sentence": "今法將歸真，法師次任其事，唯願清詞妙辯，共四海而恒流，福智莊嚴，",
        "translation": "Now that the Teaching is about to return to truth, the Master will be in charge of its affairs one by one. All we ask is that Your Reverence be endowed with clear words and subtle eloquence, which together with the four seas",
        "source": "T50n2053_007:0261c16_7"
    },
    {
        "source_sentence": "與五山而永久。",
        "translation": "It's permanent with the five mountains.",
        "source": "T50n2053_007:0261c18_8"
    },
    {
        "source_sentence": "玄奘所將經論，已翻《瑜伽師地論》等大小三十餘部，其《俱舍》、《順正理》，",
        "translation": "Xuanzang had already translated more than thirty major and minor texts, such as the Yogacarabhumi Sastra and other treatises of the Yogic Master. His Commentaries on the Abhidharma were composed in accordance with Buddhist teachings",
        "source": "T50n2053_007:0261c18_9"
    },
    {
        "source_sentence": "見譯未周，今年必了。",
        "translation": "Seeing that the translation had not yet been completed, he was bound to finish it this year.",
        "source": "T50n2053_007:0261c20_10"
    },
    {
        "source_sentence": "即日大唐天子聖躬萬福，率土安寧，以輪王之慈，敷法王之化，所出經論，",
        "translation": "On that day the Great Tang Emperor, the prince of gods, who had performed myriad meritorious deeds and led the land into peacefulness, prepared the edification of the king of the Dharma by means of the compassion of the universal ruler",
        "source": "T50n2053_007:0261c20_11"
    },
    {
        "source_sentence": "並蒙神筆製序，令所司抄寫，國內流行，爰至隣邦亦俱遵習。",
        "translation": "They were also entrusted with the preface composed by divine hand and ordered the authorities to transcribe it. The work was widely circulated in the country but all the people of neighboring countries followed it as well.",
        "source": "T50n2053_007:0261c22_12"
    },
    {
        "source_sentence": "雖居像運之末，而法教光華，邕邕穆穆，亦不異室羅筏誓多林之化也，",
        "translation": "Even though he lived at the end of the period of the image dynasty, his doctrine flourished and his edification did not differ from that of the Śrāvastī’s monastery.",
        "source": "T50n2053_007:0261c24_13"
    },
    {
        "source_sentence": "伏願照知。",
        "translation": "May it be illuminated and known.",
        "source": "T50n2053_007:0261c25_14"
    },
    {
        "source_sentence": "又前渡信渡河失經一馱，今錄名如後，有信請為附來。",
        "translation": "Also, there was a lost scripture in the first stage of crossing the Indus by ferrying over the Indus River. The present recorded titles are as shown later. Someone with faith asked me to entrust it to you.",
        "source": "T50n2053_007:0261c26_0"
    },
    {
        "source_sentence": "并有片物供養，願垂納受。",
        "translation": "There are also a few things to offer as offerings, so please accept them.",
        "source": "T50n2053_007:0261c27_1"
    },
    {
        "source_sentence": "路遠不得多，莫嫌鮮薄。",
        "translation": "The roads are too long to travel and they can’t get many people, so they don’t dislike the subtle.",
        "source": "T50n2053_007:0261c27_2"
    },
    {
        "source_sentence": "玄奘和南。」",
        "translation": "Xuanzang and Vārāṇasī.",
        "source": "T50n2053_007:0261c28_3"
    },
    {
        "source_sentence": "又答慧天法師書曰：「大唐國苾芻玄奘謹致書摩訶菩提寺三藏慧天法師足下。",
        "translation": "He also replied in reply to the letter written by the Master Huitian, saying, Great Tang monk Xuanzang sends this letter under the feet of the Tripiṭaka Master Huitian of Mahāprajāpatī Temple.",
        "source": "T50n2053_007:0261c28_4"
    },
    {
        "source_sentence": "乖別稍久，企仰唯深。",
        "translation": "The disagreement has been a little long-standing, but the aspiration is only profound.",
        "source": "T50n2053_007:0262a02_5"
    },
    {
        "source_sentence": "音寄不通，莫慰傾渴。",
        "translation": "The sound was unfathomable, and no one comforted him in his thirst.",
        "source": "T50n2053_007:0262a02_6"
    },
    {
        "source_sentence": "彼苾芻法長至，辱書敬承休豫，用增欣悅。",
        "translation": "That monk, a long-standing practitioner of the Dharma, disrespectfully wrote and respectfully accepted Huiyu's invitation, and he became even more delighted.",
        "source": "T50n2053_007:0262a03_7"
    },
    {
        "source_sentence": "又領白[疊*毛]兩端、讚頌一夾，來意既厚，寡德愧以無當，悚息悚息。",
        "translation": "He also accepted a bundle of white cotton cloth on both ends and praised it, which was so thick in meaning that the few virtuous monks felt shameful because they did not deserve it. They were frightened and terrified.",
        "source": "T50n2053_007:0262a04_8"
    },
    {
        "source_sentence": "節氣漸和，不知信後體何如也？",
        "translation": "The energy of the bones gradually harmonizes, but I do not know what will be the essence after my faith.",
        "source": "T50n2053_007:0262a05_9"
    },
    {
        "source_sentence": "想融心百家之論，拪慮九部之經，建正法幢，引歸宗之客，擊克勝鼓，",
        "translation": "He thought of the theories of a hundred schools and discussed the nine kinds of scriptures. He erected the banner of the true-dharma to lead those who had returned to Buddhism to beat the drum of enlightenment.",
        "source": "T50n2053_007:0262a06_10"
    },
    {
        "source_sentence": "挫鍱腹之賓，頡頏王侯之前，抑揚英俊之上，故多歡適也。",
        "translation": "The guest who suppressed the hungry ghosts and beasts was formerly known as Jīvaka before the king and his princes, suppressing their brilliant appearance above them. Because of this they were often delighted with joy.",
        "source": "T50n2053_007:0262a08_11"
    },
    {
        "source_sentence": "玄奘庸弊，氣力已衰，又加念德欽仁，唯豐勞積。",
        "translation": "As I am humble and unworthy, my energy weakened. Moreover, due to my affection for virtue and kindness, only a great deal of exertion is accumulated.",
        "source": "T50n2053_007:0262a09_12"
    },
    {
        "source_sentence": "昔因遊方在彼，遇矚光儀。",
        "translation": "Formerly, when I was traveling to that place, I happened to meet Guangming Yi.",
        "source": "T50n2053_007:0262a10_13"
    },
    {
        "source_sentence": "曲女城會，又親交論。",
        "translation": "At the assembly held in the city of Kanyakubja, they had many discussions among themselves.",
        "source": "T50n2053_007:0262a11_14"
    },
    {
        "source_sentence": "當對諸王及百千徒眾，定其深淺。",
        "translation": "He'll face the kings and hundreds of thousands of his disciples to determine their depth.",
        "source": "T50n2053_007:0262a11_15"
    },
    {
        "source_sentence": "此立大乘之旨，彼竪半教之宗，往復之間，詞氣不無高下。",
        "translation": "This establishes the teachings of the Great Vehicle, which deals with the half-teaching doctrine and goes back and forth between them, speaking in a way that doesn't differ from high and low.",
        "source": "T50n2053_007:0262a12_16"
    },
    {
        "source_sentence": "務存正理，靡護人情，以此遞生淩觸。",
        "translation": "They strive to preserve the correct principle and protect human emotions, and because of this they give rise to feelings of grief.",
        "source": "T50n2053_007:0262a14_0"
    },
    {
        "source_sentence": "罷席之後，尋已豁然。",
        "translation": "After he had left his seat, the image suddenly disappeared.",
        "source": "T50n2053_007:0262a14_1"
    },
    {
        "source_sentence": "今來使猶傳法師寄申謝悔，何懷固之甚也。",
        "translation": "The envoy who has now come is still sending a letter of thanks to the Master, so why should he harbor such strong feelings of regret?",
        "source": "T50n2053_007:0262a15_2"
    },
    {
        "source_sentence": "法師學富詞清，志堅操遠，阿耨達水無以比其波瀾，淨末尼珠不足方其曒潔，",
        "translation": "The Master’s learning was rich and his words eloquent, and his aspirations were firm and far-reaching. There is nothing comparable to the beauty of the water of Anavatapta Monastery with its turquoise waves or to the cleanliness",
        "source": "T50n2053_007:0262a16_3"
    },
    {
        "source_sentence": "後進儀表，屬在高人，願勗良規，闡揚正法。",
        "translation": "The latter belonged to the noble people and was endowed with good etiquette. He wished to follow the proper disciplinary rules in order to expound the true-dharma.",
        "source": "T50n2053_007:0262a18_4"
    },
    {
        "source_sentence": "至如理周言極，無越大乘，意恨法師未為深信，所謂耽翫羊鹿，棄彼白牛，",
        "translation": "He spoke the ultimate truth in accordance with reason and did not transgress Mahayana teachings. His mind resented the Master but he did not believe deeply in Buddhism, saying, “I am addicted to eating sheep and deer and abandoning",
        "source": "T50n2053_007:0262a19_5"
    },
    {
        "source_sentence": "賞愛水精，捨頗胝寶，明明大德，何此惑之滯歟？",
        "translation": "Why is it that you're so addicted to water spirits, abandoning the crystal treasure and clearly showing great virtue, why are you stuck in this mental disturbance?",
        "source": "T50n2053_007:0262a21_6"
    },
    {
        "source_sentence": "又坯器之身，浮促難守，宜早發大心，莊嚴正見。",
        "translation": "Also, the body of the pot is floating and difficult to guard. It is advisable for you to give rise to a great mind at an early date so as to adorn your right view.",
        "source": "T50n2053_007:0262a22_7"
    },
    {
        "source_sentence": "勿使臨終，方致嗟悔。",
        "translation": "Don't let it be the time of repentance when you die.",
        "source": "T50n2053_007:0262a23_8"
    },
    {
        "source_sentence": "今使還國，謹此代誠，并附片物，蓋欲示酬來意，未是盡其深心也。",
        "translation": "Now the envoy is returning home. With a feeling of affection for my country and sincerity, I am sending this letter with some small things to express my gratitude to those who have come here. It is not enough to satisfy their deep desires.",
        "source": "T50n2053_007:0262a23_9"
    },
    {
        "source_sentence": "願知。",
        "translation": "May it be known.",
        "source": "T50n2053_007:0262a25_10"
    },
    {
        "source_sentence": "前還日渡信渡河，失經一馱，今錄名如別，請為附來。",
        "translation": "Formerly on my return journey I crossed the Indus and lost one copy of the scripture, which is now listed in a separate record. Please send it as an attachment.",
        "source": "T50n2053_007:0262a25_11"
    },
    {
        "source_sentence": "餘不能委述。",
        "translation": "The rest can't be described in detail.",
        "source": "T50n2053_007:0262a26_12"
    },
    {
        "source_sentence": "苾芻玄奘謹呈。」",
        "translation": "I'm submitting it to you, monk Xuanzang.",
        "source": "T50n2053_007:0262a27_13"
    },
    {
        "source_sentence": "大唐大慈恩寺三藏法師傳卷第七",
        "translation": "Tang Dynasty Biographies of the Tripiṭaka Master Dacien Temple, Volume 7",
        "source": "T50n2053_007:0262a28_0"
    }
]