[
    {
        "source_sentence": "大唐西域記卷第三(八國)",
        "translation": "Great Tang Dynasty Record of the Western Regions, Volume 3 (Eight Countries)",
        "source": "T51n2087_003:0882b02_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T51n2087_003:0882b04_0"
    },
    {
        "source_sentence": "大總持寺沙門辯機撰",
        "translation": "Compiled by the ascetic Bimbisāra of Dazōchijiji",
        "source": "T51n2087_003:0882b05_0"
    },
    {
        "source_sentence": "烏仗那國鉢露羅國",
        "translation": "Udyāna and the country of Balūra",
        "source": "T51n2087_003:0882b06_0"
    },
    {
        "source_sentence": "呾叉始羅國僧訶捕羅國",
        "translation": "Takṣaśilā and Saṃkhârāpura",
        "source": "T51n2087_003:0882b07_0"
    },
    {
        "source_sentence": "烏剌尸國迦濕彌羅國",
        "translation": "Urāśī and Kaśmīra",
        "source": "T51n2087_003:0882b08_0"
    },
    {
        "source_sentence": "半笯(奴故反)嗟國遏羅闍補羅國",
        "translation": "Pūrṇa (Skt. pusa) is the kingdom of Sāgara and Rājapura.",
        "source": "T51n2087_003:0882b09_0"
    },
    {
        "source_sentence": "烏仗那國，周五千餘里，山谷相屬，川澤連原。",
        "translation": "The country of Udyāna is more than five thousand li in circuit. Mountains and valleys adjoin one another, and the plains are connected by rivers and streams.",
        "source": "T51n2087_003:0882b10_0"
    },
    {
        "source_sentence": "穀稼雖播，地利不滋。",
        "translation": "Although crops are planted, the soil yields are not abundant.",
        "source": "T51n2087_003:0882b11_1"
    },
    {
        "source_sentence": "多蒲萄，少甘蔗，土產金、鐵，宜欝金香，林樹蓊欝，花果茂盛。",
        "translation": "There are plenty of grapes but there are few sweet sugarcane. The soil produces gold and iron; it is good for growing roots with a golden fragrance. Trees grow luxuriantly in the forests and shrubs provide abundant flowers and fruit.",
        "source": "T51n2087_003:0882b11_2"
    },
    {
        "source_sentence": "寒暑和暢，風雨順序。",
        "translation": "The cold and hot seasons are mild and the wind and rain are in order.",
        "source": "T51n2087_003:0882b12_3"
    },
    {
        "source_sentence": "人性怯懦，俗情譎詭。",
        "translation": "The people are cowardly by custom and deceitful by nature.",
        "source": "T51n2087_003:0882b13_4"
    },
    {
        "source_sentence": "好學而不功，禁呪為藝業。",
        "translation": "They are fond of learning but do not excel in it; forbidden spells are their arts and crafts.",
        "source": "T51n2087_003:0882b13_5"
    },
    {
        "source_sentence": "多衣白[疊*毛]，少有餘服。",
        "translation": "Most of the people wear white cotton cloth but there are a few other clothes.",
        "source": "T51n2087_003:0882b14_6"
    },
    {
        "source_sentence": "語言雖異，大同印度。",
        "translation": "Although their language is different, they are generally the same as those of India.",
        "source": "T51n2087_003:0882b15_7"
    },
    {
        "source_sentence": "文字禮儀，頗相參預。",
        "translation": "Their written and etiquette are quite different.",
        "source": "T51n2087_003:0882b15_8"
    },
    {
        "source_sentence": "崇重佛法，敬信大乘。",
        "translation": "They revere the buddha-dharma and respectfully believe in the Mahayana.",
        "source": "T51n2087_003:0882b16_9"
    },
    {
        "source_sentence": "夾蘇婆伐窣堵河，舊有一千四百伽藍，多已荒蕪。",
        "translation": "On both banks of the Subhavarga River there were formerly one thousand four hundred monasteries, most of which are now in desolate ruins.",
        "source": "T51n2087_003:0882b16_10"
    },
    {
        "source_sentence": "昔僧徒一萬八千，今漸減少。",
        "translation": "Formerly there were eighteen thousand monks but the number has gradually decreased.",
        "source": "T51n2087_003:0882b17_11"
    },
    {
        "source_sentence": "並學大乘，寂定為業，善誦其文，未究深義，戒行清潔，特閑禁呪。",
        "translation": "They also studied Mahayana scriptures and practiced quiet meditation as their occupations. They were fond of reciting the texts but did not investigate deeper meanings. Their morality was pure and clean, and they lived in seclusion to keep themselves free from spells.",
        "source": "T51n2087_003:0882b18_12"
    },
    {
        "source_sentence": "律儀傳訓，有五部焉：一法密部，二化地部，三飲光部，四說一切有部，",
        "translation": "The code of Vinaya is divided into five texts: the Abhidharmakośa school, the Mahāprajñāpāramitā school, the Nirmāṇarati school, the Mahāprajñāpāramitā school, the Sangha school, and the Sarvastivada school.",
        "source": "T51n2087_003:0882b20_13"
    },
    {
        "source_sentence": "五大眾部。",
        "translation": "Five, the Mahāprajñāpāramitā school.",
        "source": "T51n2087_003:0882b21_14"
    },
    {
        "source_sentence": "天祠十有餘所，異道雜居。",
        "translation": "There are more than ten deva temples with various heretics living together.",
        "source": "T51n2087_003:0882b21_15"
    },
    {
        "source_sentence": "堅城四五，其王多治瞢揭釐城。",
        "translation": "There were four or five strong castles, most of which ruled over the city of Sangali.",
        "source": "T51n2087_003:0882b22_16"
    },
    {
        "source_sentence": "城周十六七里，居人殷盛。",
        "translation": "The city is sixteen or seventeen li in circuit and the inhabitants are prosperous.",
        "source": "T51n2087_003:0882b23_17"
    },
    {
        "source_sentence": "瞢揭釐城東四五里有窣堵波，極多靈瑞，是佛在昔作忍辱仙，於此為羯利王(唐言鬪諍。",
        "translation": "About four or five li to the east of the city of Gangali is a stupa that shows many spiritual signs. Formerly the Buddha was a kṣatriya in the past and at this place he became the khattiya king (known as Qiu, “ quarreling,” in Chinese).",
        "source": "T51n2087_003:0882b24_0"
    },
    {
        "source_sentence": "舊云哥利，訛也)割截支體。",
        "translation": "(The old Sanskrit word for it is kalala, which is a mistake.) Cut off the body of the limbs.",
        "source": "T51n2087_003:0882b26_0"
    },
    {
        "source_sentence": "瞢揭釐城東北行二百五六十里，入大山，至阿波邏羅龍泉，即蘇婆伐窣堵河之源也。",
        "translation": "Going to the northeast for two hundred fifty or sixty li from the city of Ganga, he entered a great mountain and reached the Anavatapta-nāga Monastery, which was the source of the stupa at Upavatī River.",
        "source": "T51n2087_003:0882b27_0"
    },
    {
        "source_sentence": "派流西南，春夏含凍，昏夕飛雪，雪霏五彩，光流四照。",
        "translation": "To the southwest it flows in spring and summer, with snow falling in the dusk and moonlight. Snowflakes of various colors float in the air and their light extends to illuminate all directions.",
        "source": "T51n2087_003:0882b29_1"
    },
    {
        "source_sentence": "此龍者，迦葉波佛時生在人趣，名曰殑祇，深閑呪術，禁禦惡龍，不令暴雨，",
        "translation": "This dragon was born in the human realm at the time of Kāśyapa Buddha. His name was Nirgrantha and he practiced a profound spell to restrain evil dragons so that they would not cause heavy rain.",
        "source": "T51n2087_003:0882c01_2"
    },
    {
        "source_sentence": "國人賴之，以稸餘糧。",
        "translation": "The people of the country relied on it for food and provisions.",
        "source": "T51n2087_003:0882c03_3"
    },
    {
        "source_sentence": "居人眾庶感恩懷德，家稅斗穀以饋遺焉。",
        "translation": "The inhabitants and commoners of the monastery were grateful and cherished virtue, and their families contributed a bowlful of grain as gifts.",
        "source": "T51n2087_003:0882c03_4"
    },
    {
        "source_sentence": "既積歲時，或有逋課。",
        "translation": "At the time of accumulating years, there might be a disputed school.",
        "source": "T51n2087_003:0882c04_5"
    },
    {
        "source_sentence": "殑祇含怒，願為毒龍，暴行風雨，損傷苗稼。",
        "translation": "I wish to become a poisonous dragon, and the wind and rain that blow violently will damage my crops.",
        "source": "T51n2087_003:0882c05_6"
    },
    {
        "source_sentence": "命終之後，為此池龍。",
        "translation": "At the end of his life, he becomes a dragon in this lake.",
        "source": "T51n2087_003:0882c06_7"
    },
    {
        "source_sentence": "泉流白水，損傷地利。",
        "translation": "White water flowing from the fountain inflicts damage and injury to the earth.",
        "source": "T51n2087_003:0882c06_8"
    },
    {
        "source_sentence": "釋迦如來大悲御世，愍此國人獨遭斯難，降神至此，欲化暴龍。",
        "translation": "The Tathāgata Śākyamuni, the great compassionate ruler of the world, pitying the people of this country for their unique disadvantages, descended to this place with his spirit in order to convert the violent dragon.",
        "source": "T51n2087_003:0882c07_9"
    },
    {
        "source_sentence": "執金剛神杵擊山崖，龍王震懼，乃出歸依，聞佛說法，心淨信悟，如來遂制勿損農稼。",
        "translation": "Fearful, the dragon king came out to take refuge in the Buddha. Hearing the Buddha’s exhortation, his mind was pure and he believed in enlightenment. The Tathāgata then ordered him not to harm any crops or livestock.",
        "source": "T51n2087_003:0882c08_10"
    },
    {
        "source_sentence": "龍曰：「凡有所食，賴收人田，今蒙聖教，恐難濟給，願十二歲一收糧儲。」",
        "translation": "The dragon said, Whenever there's food to be eaten, we rely on the land collected by people; now that we've received the noble teaching, we're afraid it won't be easy to help us. May we collect grain and store it for twelve years?",
        "source": "T51n2087_003:0882c10_11"
    },
    {
        "source_sentence": "如來含覆，愍而許焉。",
        "translation": "The Tathāgata covered it up and accepted it with anger.",
        "source": "T51n2087_003:0882c12_12"
    },
    {
        "source_sentence": "故今十二年一遭白水之災。",
        "translation": "That's why the white water disaster occurs once every twelve years now.",
        "source": "T51n2087_003:0882c13_0"
    },
    {
        "source_sentence": "阿波邏羅龍泉西南三十餘里，水北岸大磐石上，有如來足所履迹，隨人福力，",
        "translation": "More than thirty li to the southwest of the Anavatapta-nāga fountain, on the northern bank of the river is a large rock where the Tathāgata walked at his feet.",
        "source": "T51n2087_003:0882c14_0"
    },
    {
        "source_sentence": "量有短長，是如來伏此龍已，留迹而去。",
        "translation": "The sizes of the dragons are long and short. This is how the Tathāgata, having subdued this dragon, left his traces behind and departed.",
        "source": "T51n2087_003:0882c15_1"
    },
    {
        "source_sentence": "後人於上積石為室，遐邇相趨，花香供養。",
        "translation": "People of later times built a stone chamber at the top of the mountain and worshiped it from distant places with flowers and incense offered as an offering.",
        "source": "T51n2087_003:0882c16_2"
    },
    {
        "source_sentence": "順流而下三十餘里，至如來濯衣石，袈裟之文煥焉如鏤。",
        "translation": "Going downstream for more than thirty li, he reached the place where the Tathāgata washed his robes and stones. The color of his reddish-brown robes looked as if they were carvings.",
        "source": "T51n2087_003:0882c17_3"
    },
    {
        "source_sentence": "瞢揭釐城南四百餘里，至醯羅山，谷水西派，逆流東上，雜華異果，被澗緣崖，",
        "translation": "More than four hundred li to the south of the city of Ganga, one reaches the hill of Kālā. The valley flows westward and goes upstream to the east; it produces variegated flowers and strange fruits that are mixed together in a stream on the rocky precipice at the foot of the mountain.",
        "source": "T51n2087_003:0882c20_0"
    },
    {
        "source_sentence": "峯巖危險，谿谷盤紆，或聞諠語之聲，或聞音樂之響。",
        "translation": "The peaks and cliffs are dangerous, and the valleys wind in a circular motion. Some may hear the sounds of coarse words or they may hear the sounds of music.",
        "source": "T51n2087_003:0882c21_1"
    },
    {
        "source_sentence": "方石如塔，宛若工成，連延相屬，接布崖谷。",
        "translation": "The square rock is shaped like a stūpa, just as if it had been carved by the artisans. It adjoins one another in chains and connecteds with the valley that forms part of the embankment.",
        "source": "T51n2087_003:0882c22_2"
    },
    {
        "source_sentence": "是如來在昔為聞半頌(舊曰伽，梵文略也。",
        "translation": "This is the half-single verse that the Tathāgata heard in the past (formerly transcribed as ga, a Sanskrit abbreviation).",
        "source": "T51n2087_003:0882c23_3"
    },
    {
        "source_sentence": "或曰偈他，梵音訛也。",
        "translation": "Some say it's a verse, which is a Sanskrit word for error.",
        "source": "T51n2087_003:0882c24_4"
    },
    {
        "source_sentence": "今從正音，宜云伽他。",
        "translation": "Now, following the correct sound, it's appropriate to call it a verse.",
        "source": "T51n2087_003:0882c24_5"
    },
    {
        "source_sentence": "伽他者，唐言頌，頌三十二言也)之法，於此捨身命焉。",
        "translation": "(Gatha is the Tang word for verse, a verse of thirty-two syllables.) The teaching was to abandon his body and life here.",
        "source": "T51n2087_003:0883a01_6"
    },
    {
        "source_sentence": "瞢揭釐城南二百餘里，大山側，至摩訶伐那(唐言大林)伽藍。",
        "translation": "More than two hundred li to the south of the city of Ganga, on the side of a great mountain, one reaches Mahāvana (known as Great Forest in Chinese) Monastery.",
        "source": "T51n2087_003:0883a01_7"
    },
    {
        "source_sentence": "是如來昔修菩薩行，號薩縛達之王(唐言一切施)，避敵棄國，潛行至此，",
        "translation": "Formerly when the Tathāgata was practicing the deeds of enlightening beings, he was called King Sarvadatta (known as “giving to all living beings” in Chinese).",
        "source": "T51n2087_003:0883a03_8"
    },
    {
        "source_sentence": "遇貧婆羅門，方來乞匃。",
        "translation": "He met a poor brahman who came to beg for alms.",
        "source": "T51n2087_003:0883a04_9"
    },
    {
        "source_sentence": "既失國位，無以為施，遂令羈縛，擒往敵王，冀以賞財，迴為惠施。",
        "translation": "Having lost his sovereignty, he did not think of it as a gift. So he was captured and taken to the enemy king with the intention of rewarding his wealth and turning it back into charity.",
        "source": "T51n2087_003:0883a05_10"
    },
    {
        "source_sentence": "摩訶伐那伽藍西北，下山三四十里，至摩愉(摩言豆)伽藍。",
        "translation": "To the northwest of Mahāvanā Monastery, going down a mountain for thirty or forty li, he reached Mathu Monastery.",
        "source": "T51n2087_003:0883a07_0"
    },
    {
        "source_sentence": "有窣堵波，高百餘尺。",
        "translation": "There is a stupa more than one hundred feet in height.",
        "source": "T51n2087_003:0883a08_1"
    },
    {
        "source_sentence": "其側大方石上，有如來足蹈之迹，是佛昔蹈此石，放拘胝光明，照摩訶伐那伽藍，",
        "translation": "On a large square rock beside the stupa there is a footprint of the Tathāgata. Formerly when the Buddha walked on this rock, he emitted a ray of light from his corpuscles that shone upon Mahāvanā Monastery.",
        "source": "T51n2087_003:0883a08_2"
    },
    {
        "source_sentence": "為諸人、天說本生事。",
        "translation": "He explains the events of his original birth for humans and gods.",
        "source": "T51n2087_003:0883a10_3"
    },
    {
        "source_sentence": "其窣堵波基下有石，色帶黃白，常有津膩。",
        "translation": "Below the foundation of the stupa there is a stone, yellowish-white in color and always covered with dirt.",
        "source": "T51n2087_003:0883a11_4"
    },
    {
        "source_sentence": "是如來在昔修菩薩行，為聞正法，於此析骨書寫經典。",
        "translation": "Formerly when the Tathāgata was practicing the bodhisattva path, in order to hear the true-dharma he cut up his bones and wrote down scriptures at this place.",
        "source": "T51n2087_003:0883a12_5"
    },
    {
        "source_sentence": "摩愉伽藍西六七十里，至窣堵波，無憂王之所建也。",
        "translation": "Sixty or seventy li to the west of Magadha’s monastery is a stupa built by King Aśoka.",
        "source": "T51n2087_003:0883a14_0"
    },
    {
        "source_sentence": "是如來昔修菩薩行，號毘迦王(唐言與。",
        "translation": "This is the Tathāgata who cultivated bodhisattva practices in the past and was called King Viśeṣa (known as 'giving' in Chinese).",
        "source": "T51n2087_003:0883a15_1"
    },
    {
        "source_sentence": "舊曰尸毘王，訛)，為求佛果，於此割身，從鷹代鴿。",
        "translation": "In order to seek the buddha-fruit, he cut his body at this place and replaced a pigeon with an eagle.",
        "source": "T51n2087_003:0883a16_2"
    },
    {
        "source_sentence": "代鴿西北二百餘里，入珊尼羅闍川，至薩裒殺地(唐言蛇藥)僧伽藍。",
        "translation": "More than two hundred li to the northwest of Dajiao, he entered the Saniroji River and arrived at Sthavira Monastery (known as “Snake Medicine” in Chinese).",
        "source": "T51n2087_003:0883a18_0"
    },
    {
        "source_sentence": "有窣堵波，高八十餘尺。",
        "translation": "There is a stupa more than eighty feet in height.",
        "source": "T51n2087_003:0883a19_1"
    },
    {
        "source_sentence": "是如來昔為帝釋，時遭饑歲，疾疫流行，醫療無功道，死相屬。",
        "translation": "Formerly, when the Tathāgata was a emperor, he suffered from hunger and an epidemic of pestilence prevailed. He did not undergo treatment but died at the end of his life.",
        "source": "T51n2087_003:0883a19_2"
    },
    {
        "source_sentence": "帝釋悲愍，思所救濟，乃變其形為大蟒身，僵屍川谷，空中遍告；",
        "translation": "The lord of the gods, pitying Indra and wishing to rescue him, transformed his form into that of a great python.",
        "source": "T51n2087_003:0883a21_3"
    },
    {
        "source_sentence": "聞者感慶，相率奔赴，隨割隨生，療飢療疾。",
        "translation": "Those who heard it were overjoyed and rushed to the monastery, cutting and dying as often as they could to treat their hunger and illness.",
        "source": "T51n2087_003:0883a22_4"
    },
    {
        "source_sentence": "其側不遠，有蘇摩大窣堵波。",
        "translation": "Not far from it is a great stupa called Soma.",
        "source": "T51n2087_003:0883a23_5"
    },
    {
        "source_sentence": "是如來昔為帝釋，時世疾疫，愍諸含識，自變其身為蘇摩蛇，凡有噉食，",
        "translation": "Formerly the Tathāgata was Śakra, ruler of the gods. At that time there was an epidemic of pestilence in the world and all the conscious beings who suffered from it transformed their bodies into white snakes. All living beings ate this food by themselves.",
        "source": "T51n2087_003:0883a24_6"
    },
    {
        "source_sentence": "莫不康豫。",
        "translation": "None of them were unhurried.",
        "source": "T51n2087_003:0883a26_7"
    },
    {
        "source_sentence": "珊尼羅闍川北石崖邊，有窣堵波。",
        "translation": "On the side of a rocky cliff north of the Sanirāja River is a stupa.",
        "source": "T51n2087_003:0883a27_0"
    },
    {
        "source_sentence": "病者至求，多蒙除差。",
        "translation": "When a sick person arrives to seek it, they'll often be cured.",
        "source": "T51n2087_003:0883a27_1"
    },
    {
        "source_sentence": "如來在昔為孔雀王，與其群而至此，熱渴所逼，求水不獲，孔雀王以[此\\/束]啄崖，",
        "translation": "Formerly when the Tathāgata was a king of peacocks, he came here accompanied by his retinue. pressured by thirst and unable to obtain water, the king of peacocks pecked at the cliff with its beak.",
        "source": "T51n2087_003:0883a28_2"
    },
    {
        "source_sentence": "涌泉流注。",
        "translation": "A spring wells up and flows down.",
        "source": "T51n2087_003:0883b01_3"
    },
    {
        "source_sentence": "今遂為池，飲沐愈疾。",
        "translation": "Now the pond has been turned into a pool to bathe and he is cured of his illness.",
        "source": "T51n2087_003:0883b01_4"
    },
    {
        "source_sentence": "石上猶有孔雀蹤迹。",
        "translation": "On the stone there are still traces of a peacock.",
        "source": "T51n2087_003:0883b01_5"
    },
    {
        "source_sentence": "瞢揭釐城西南行六七十里，大河東有窣堵波，高六十餘尺，上軍王之所建也。",
        "translation": "Going southwest for sixty or seventy li from the city of Ganga, to the east of a big river is a stupa more than sixty feet in height built by King Sangha.",
        "source": "T51n2087_003:0883b03_0"
    },
    {
        "source_sentence": "昔如來之將寂滅，告諸大眾：「我涅槃後，烏仗那國上軍王宜與舍利之分。」",
        "translation": "Formerly, when the Tathāgata was about to enter nirvāṇa, he told the masses, After my nirvāṇa, it's advisable for the king of Udyāna to give me a portion of the relics.",
        "source": "T51n2087_003:0883b04_1"
    },
    {
        "source_sentence": "及諸王將欲均量，上軍王後來，遂有輕鄙之議。",
        "translation": "When the kings and their armies were about to make a balanced calculation, the king of the army came after them and there was an argument of despise and contempt.",
        "source": "T51n2087_003:0883b06_2"
    },
    {
        "source_sentence": "是時天人大眾重宣如來顧命之言，乃預同分，持歸本國，式遵崇建。",
        "translation": "The gods and humans then repeated the words of the Tathāgata's command, so they foresaw the same part, took it back to their own country, and honored it with a ceremony.",
        "source": "T51n2087_003:0883b07_3"
    },
    {
        "source_sentence": "窣堵波側大河濱，有大石，狀如象。",
        "translation": "Beside the stupa there is a large stone, shaped like an elephant, at the edge of a big river.",
        "source": "T51n2087_003:0883b09_4"
    },
    {
        "source_sentence": "昔上軍王以大白象負舍利歸，至於此地，象忽蹎仆，因而自斃，遂變為石，",
        "translation": "Formerly when the king of the army returned to this place with a large white elephant carrying the relics, the elephant suddenly tumbled down and died on its own, turning into a stone.",
        "source": "T51n2087_003:0883b10_0"
    },
    {
        "source_sentence": "即於其側起窣堵波。",
        "translation": "He then built a stupa beside it.",
        "source": "T51n2087_003:0883b11_1"
    },
    {
        "source_sentence": "瞢揭釐城西五十餘里，渡大河，至盧醯呾迦(唐言赤)窣堵波，高五十餘尺，",
        "translation": "More than fifty li to the west of the city of Ganges, he crossed a big river and reached the stupa of Lokeṭika (known as “red” in Chinese) more than fifty feet in height.",
        "source": "T51n2087_003:0883b12_2"
    },
    {
        "source_sentence": "無憂王之所建也。",
        "translation": "It was built by King Aśoka.",
        "source": "T51n2087_003:0883b13_3"
    },
    {
        "source_sentence": "昔如來修菩薩行，為大國王，號曰慈力，於此刺身血以飼五藥叉(舊曰夜叉，",
        "translation": "Formerly when the Tathāgata was practicing the deeds of bodhisattvahood, he became a great king named Maitrībala and drew blood from his body to feed the five yakṣas (formerly transcribed as yecha in Chinese).",
        "source": "T51n2087_003:0883b14_4"
    },
    {
        "source_sentence": "訛也)。",
        "translation": "It's also a mistake.)",
        "source": "T51n2087_003:0883b16_5"
    },
    {
        "source_sentence": "瞢揭釐城東北三十餘里，至遏部多(唐言奇特)石窣堵波，高四十餘尺。",
        "translation": "More than thirty li to the northeast of the city of angali, one reaches the stone stupa of curvata (known as “extraordinary”) more than forty feet in height.",
        "source": "T51n2087_003:0883b17_0"
    },
    {
        "source_sentence": "在昔如來為諸人、天說法開導，如來去後，從地踊出，黎庶崇敬，香華不替。",
        "translation": "Formerly the Tathāgata preached the Dharma to all living beings and gods in order to enlighten them. After the departure of the Tathāgata, he emerged from the earth and was revered by the common people. Fragrance and flowers never disappeared.",
        "source": "T51n2087_003:0883b18_1"
    },
    {
        "source_sentence": "石窣堵波西渡大河三四十里，至一精舍，中有阿縛盧枳低濕伐羅菩薩像(唐言觀自在。",
        "translation": "Three or forty li to the west of the stone stupa, crossing a big river three or four times, one reaches a temple in which is enshrined an image of Avalokitêśvara Bodhisattva (known as Guanzizai in Chinese).",
        "source": "T51n2087_003:0883b21_0"
    },
    {
        "source_sentence": "合字連聲，梵語如上；",
        "translation": "The phonemes combine to form a continuous sound, and the Sanskrit phonemes are as above.",
        "source": "T51n2087_003:0883b22_1"
    },
    {
        "source_sentence": "分文散音，即阿縛盧枳多譯曰觀，伊濕伐羅譯曰自在。",
        "translation": "The Sanskrit part is 散音, which means Avalokitêśvara translated as contemplation and Iśvara translated as self-dependence.",
        "source": "T51n2087_003:0883b23_2"
    },
    {
        "source_sentence": "舊譯為光世音，或云觀世音，或觀世自在，皆訛謬也)。",
        "translation": "The old translation is Guangshiyin, or Guanshiyin, or Guanshi zizai, which are all mistaken).",
        "source": "T51n2087_003:0883b23_3"
    },
    {
        "source_sentence": "威靈潛被，神迹昭明，法俗相趨，供養無替。",
        "translation": "The traces of the deities are clearly visible, and both monks and laypeople come together to make offerings without cease.",
        "source": "T51n2087_003:0883b24_4"
    },
    {
        "source_sentence": "觀自在菩薩像西北百五十里，至藍勃盧山。",
        "translation": "One hundred fifty li to the northwest of the statue of Avalokiteśvara Bodhisattva, he reached the mountain of Lampoluo.",
        "source": "T51n2087_003:0883b25_5"
    },
    {
        "source_sentence": "山嶺有龍池，周三十餘里，淥波浩汗，清流皎鏡。",
        "translation": "At the top of the mountain there is a dragon lake more than thirty li in circuit, with its foul and sweaty waves running clear and shining like mirrors.",
        "source": "T51n2087_003:0883b26_6"
    },
    {
        "source_sentence": "昔毘盧釋迦王前伐諸釋，四人拒軍者，宗親擯逐，各事分飛。",
        "translation": "Formerly King Vairocana of the Śākya clan had previously conquered all the Sakyans. The four men who resisted the army were driven away by their clansmen and relatives, each flying separately according to his affairs.",
        "source": "T51n2087_003:0883b27_7"
    },
    {
        "source_sentence": "其一釋種，既出國都，跋涉疲弊，中路而止。",
        "translation": "One of the Śākya clansmen left the capital city and, exhausted from their journey, they stopped on the way.",
        "source": "T51n2087_003:0883b28_8"
    },
    {
        "source_sentence": "時有一雁，飛趣其前，既以馴狎，因即乘焉。",
        "translation": "A wild goose then flew in front of him and, being tamed by the bird, rode on it.",
        "source": "T51n2087_003:0883b29_9"
    },
    {
        "source_sentence": "其雁飛翔，下此池側。",
        "translation": "The geese flew down to the side of this pond.",
        "source": "T51n2087_003:0883c01_10"
    },
    {
        "source_sentence": "釋種虛遊，遠適異國，迷不知路，假寐樹陰。",
        "translation": "The Śākya clan traveled in vain and came from a great distance to different countries. They lost their way and did not know the right path, so they slept in the shade of a tree.",
        "source": "T51n2087_003:0883c02_11"
    },
    {
        "source_sentence": "池龍少女，遊覽水濱，忽見釋種，恐不得當也，變為人形，即而摩拊。",
        "translation": "The young daughter of the dragon in the pond was enjoying a pleasure at the riverside. Suddenly she saw the Śākya clanspeople and, out of fear that she would not be able to do so, transformed herself into a human being and stroked them.",
        "source": "T51n2087_003:0883c03_12"
    },
    {
        "source_sentence": "釋種驚寤，因即謝曰：「羈旅羸人，何見親拊？」",
        "translation": "The Śākyamunis were startled and apologized, saying, How can weak travelers see their relatives?",
        "source": "T51n2087_003:0883c04_13"
    },
    {
        "source_sentence": "遂欵殷勤，凌逼野合。",
        "translation": "As a result, the king was so diligent that he suppressed and oppressed them in the wilderness.",
        "source": "T51n2087_003:0883c05_14"
    },
    {
        "source_sentence": "女曰：「父母有訓，祗奉無違。",
        "translation": "The daughter said, “Our parents taught us the Dharma and we honored them without disobedience.",
        "source": "T51n2087_003:0883c06_15"
    },
    {
        "source_sentence": "雖蒙惠顧，未承高命。」",
        "translation": "Even though they've been given favors, they haven't received the high life.",
        "source": "T51n2087_003:0883c06_16"
    },
    {
        "source_sentence": "釋種曰：「山谷杳冥，爾家安在？」",
        "translation": "The Śākyamuni said, The mountain valleys are deep and dark, so where's your family?",
        "source": "T51n2087_003:0883c07_17"
    },
    {
        "source_sentence": "曰：「我此池之龍女也。",
        "translation": "He said, I'm the dragon-maiden of this pond.",
        "source": "T51n2087_003:0883c08_18"
    },
    {
        "source_sentence": "敬聞聖族流離逃難，幸因遊覽，敢慰勞弊。",
        "translation": "I am honored to have heard that the holy clans are fleeing and in distress. It is fortunate that by taking pleasure in excursions they dared to comfort those who are suffering from hardships.",
        "source": "T51n2087_003:0883c08_19"
    },
    {
        "source_sentence": "命有讌私，未聞來旨。",
        "translation": "His orders were secret and he had no idea of the purpose for his arrival.",
        "source": "T51n2087_003:0883c09_20"
    },
    {
        "source_sentence": "況乎積禍，受此龍身，人畜殊途，非所聞也。」",
        "translation": "It's even more so when they accumulate misfortune and receive the body of this dragon, which is not what they've heard from people or animals on different paths.",
        "source": "T51n2087_003:0883c10_21"
    },
    {
        "source_sentence": "釋種曰：「一言見允，宿心斯畢。」",
        "translation": "The Śākyamuni said, I'll see it with a single word, and my past intentions will be fulfilled.",
        "source": "T51n2087_003:0883c11_22"
    },
    {
        "source_sentence": "龍女曰：「敬聞命矣，唯所去就。」",
        "translation": "The dragon-maiden said, I respectfully hear that you've ordered me to go.",
        "source": "T51n2087_003:0883c11_23"
    },
    {
        "source_sentence": "釋種乃誓心曰：「凡我所有福德之力，令此龍女舉體成人。」",
        "translation": "The Śākyamuni then made a vow, All of my blessedness and virtue will cause this dragon-maiden to lift herself up into adulthood.",
        "source": "T51n2087_003:0883c12_24"
    },
    {
        "source_sentence": "福力所感，龍遂改形，既得人身，深自慶悅。",
        "translation": "As a result of the power of his good fortune, the dragon changed his form and attained human form, which was profoundly delighted.",
        "source": "T51n2087_003:0883c14_0"
    },
    {
        "source_sentence": "乃謝釋種曰：「我積殃運，流轉惡趣。",
        "translation": "He then apologized to the Śākya clanspeople, saying, “I accumulated evil karma and have been reborn in a bad realm of existence.",
        "source": "T51n2087_003:0883c15_0"
    },
    {
        "source_sentence": "幸蒙垂顧，福力所加，曠劫弊身，一旦改變。",
        "translation": "I am fortunate to have been looked after by Your Majesty. Through the power of your blessedness and merit you caused me to leave behind my evil body for many kalpas before it changed into a human being.",
        "source": "T51n2087_003:0883c15_1"
    },
    {
        "source_sentence": "欲報此德，糜軀未謝。",
        "translation": "Wishing to repay this virtue, he cooked his body but didn't eat it yet.",
        "source": "T51n2087_003:0883c16_2"
    },
    {
        "source_sentence": "心願陪遊，事拘物議。",
        "translation": "They wished to accompany the Master on his excursions, but they were confined in private discussions about matters.",
        "source": "T51n2087_003:0883c17_3"
    },
    {
        "source_sentence": "願白父母，然後備禮。」",
        "translation": "May you tell your parents and then pay homage to them.",
        "source": "T51n2087_003:0883c17_4"
    },
    {
        "source_sentence": "龍女還池，白父母曰：「今者遊覽，忽逢釋種，福力所感，變我為人，",
        "translation": "The dragon-maiden returned to the pond and said to her parents, “I am now enjoying leisurely excursions. Suddenly I happened to meet the people of the Śākya clan who transformed me into a human being through the power of their good fortune.",
        "source": "T51n2087_003:0883c18_5"
    },
    {
        "source_sentence": "情存好合，敢陳事實。」",
        "translation": "My feelings are well combined, so I dare to present the truth.",
        "source": "T51n2087_003:0883c19_6"
    },
    {
        "source_sentence": "龍王心欣人趣，情重聖族，遂從女請。",
        "translation": "The dragon king was delighted with human destinies and had affection for the holy clans, so he invited her to his palace.",
        "source": "T51n2087_003:0883c20_7"
    },
    {
        "source_sentence": "乃出池而謝釋種曰：「不遺非類，降尊就卑，願臨我室，敢供灑掃。」",
        "translation": "He came out of the pond and apologized to the Śākyamuni, saying, I won't leave behind any non-Buddhist or non-Buddhist types, so please come to my room and dare to offer a sweep.",
        "source": "T51n2087_003:0883c21_8"
    },
    {
        "source_sentence": "釋種受龍王之請，遂即其居。",
        "translation": "The Śākya clan accepted the invitation of the dragon king and went to live there.",
        "source": "T51n2087_003:0883c22_9"
    },
    {
        "source_sentence": "於是龍宮之中，親迎備禮，燕爾樂會，肆極歡娛。",
        "translation": "So they came to the palace of the dragon and greeted him with proper courteousness. They sat together in pleasure and assembly, enjoying great joy and delight.",
        "source": "T51n2087_003:0883c23_10"
    },
    {
        "source_sentence": "釋種覩龍之形，心常畏惡，乃欲辭出。",
        "translation": "The Śākyamuni was born in the form of a dragon and always feared evil in his mind, so he wanted to leave.",
        "source": "T51n2087_003:0883c24_11"
    },
    {
        "source_sentence": "龍王止曰：「幸無遠舍，隣此宅居，當令據疆土，稱大號，總有臣庶，",
        "translation": "The dragon king stayed and said, “I am fortunate that there is no distant residence but a house nearby.",
        "source": "T51n2087_003:0883c25_12"
    },
    {
        "source_sentence": "祚延長世。」",
        "translation": "The throne extends the world.",
        "source": "T51n2087_003:0883c27_13"
    },
    {
        "source_sentence": "釋種謝曰：「此言非冀。」",
        "translation": "Śākyamuni thanked him, saying, This is not a hope.",
        "source": "T51n2087_003:0883c27_14"
    },
    {
        "source_sentence": "龍王以寶劍置篋中，妙好白[疊*毛]，而覆其上。",
        "translation": "The dragon king put his jeweled sword in the bowl and covered it with a beautiful white cotton cloth.",
        "source": "T51n2087_003:0883c27_15"
    },
    {
        "source_sentence": "謂釋種曰：「幸持此[疊*毛]以獻國王，王必親受遠人之貢，可於此時害其王也。",
        "translation": "He said to the Śākya clanspeople, “May I take this piece of cloth and present it to the king! The king will surely be personally subject to the tribute offered by people from a distant land.",
        "source": "T51n2087_003:0883c28_16"
    },
    {
        "source_sentence": "因據其國，不亦善乎？」",
        "translation": "Wouldn't it be good if you were to base yourself on that country?",
        "source": "T51n2087_003:0884a01_17"
    },
    {
        "source_sentence": "釋種受龍指誨，便往行獻；",
        "translation": "The Śākya clanspeople, having been instructed by the dragon, went there to make offerings.",
        "source": "T51n2087_003:0884a02_18"
    },
    {
        "source_sentence": "烏仗那王躬舉其[疊*毛]，釋種執其袂而刺之。",
        "translation": "King Udyāna personally lifted his [tuft of *hair], and the Śākyas took his sleeves and stabbed him.",
        "source": "T51n2087_003:0884a03_0"
    },
    {
        "source_sentence": "侍臣、衛兵諠亂階陛，釋種麾劍告曰：「我所杖劍，神龍見授，以誅後伏，",
        "translation": "The attendant ministers and guards clashed with each other in disorder, and the Śākya clansmen commanded their swords to say, “The sword of my sword is entrusted to me by a divine dragon.",
        "source": "T51n2087_003:0884a04_0"
    },
    {
        "source_sentence": "以斬不臣。」",
        "translation": "It's because they aren't subject to being cut off.",
        "source": "T51n2087_003:0884a05_1"
    },
    {
        "source_sentence": "咸懼神武，推尊大位。",
        "translation": "They all feared divine warfare and esteemed the Buddha as a great ruler.",
        "source": "T51n2087_003:0884a05_2"
    },
    {
        "source_sentence": "於是沿弊立政，表賢恤患。",
        "translation": "He then established a government along with the disadvantages and expressed his compassion for the sufferings of the wise.",
        "source": "T51n2087_003:0884a06_3"
    },
    {
        "source_sentence": "已而動大眾，備法駕，即龍宮而報命，迎龍女以還都。",
        "translation": "He then summoned the assembly and prepared the chariot of the Dharma. At once he returned to the palace of the nāga king in order to report his death, whereupon he met the nāga queen and returned to the capital.",
        "source": "T51n2087_003:0884a07_4"
    },
    {
        "source_sentence": "龍女宿業未盡，餘報猶在、每至讌私，首出九龍之頭。",
        "translation": "The dragon-maiden had not yet exhausted her past karma, but the remaining rewards were still present. Every time she went to her private quarters, a nine-headed lion came out of her hair.",
        "source": "T51n2087_003:0884a08_5"
    },
    {
        "source_sentence": "釋種畏惡，莫知圖計，伺其寐也，利刃斷之。",
        "translation": "The Śākya clan feared evil and did not know what to do. They waited for the king to lie asleep, cutting him off with a sharp sword.",
        "source": "T51n2087_003:0884a09_6"
    },
    {
        "source_sentence": "龍女驚寐曰：「斯非後嗣之利，非徒我命有少損傷，而汝子孫當苦頭痛。」",
        "translation": "The dragon-maiden was startled and awoke, saying, This isn't for the benefit of future heirs; it's not just that my life will be slightly injured, but your children and grandchildren will suffer from headaches.",
        "source": "T51n2087_003:0884a10_7"
    },
    {
        "source_sentence": "故此國族常有斯患，雖不連綿，時一發動。",
        "translation": "That is why the people of this country always suffer from these kinds of distress. Although they are not continuous, they sometimes move at one and the same time.",
        "source": "T51n2087_003:0884a12_8"
    },
    {
        "source_sentence": "釋種既沒，其子嗣位，是嗢呾羅犀那王(唐言上軍)。",
        "translation": "When the Śākya clan had disappeared, his son succeeded to the throne and was the king of Rājagṛha (known as Shangjun in Chinese).",
        "source": "T51n2087_003:0884a13_9"
    },
    {
        "source_sentence": "上軍王嗣位之後，其母喪明。",
        "translation": "When King Shangjun assumed the throne, his mother lost her eyesight.",
        "source": "T51n2087_003:0884a15_0"
    },
    {
        "source_sentence": "如來伏阿波邏羅龍還也，從空下其宮中。",
        "translation": "The Tathāgata subdued the apalāla dragon and returned, descending from the sky into his palace.",
        "source": "T51n2087_003:0884a15_1"
    },
    {
        "source_sentence": "上軍王適從遊獵，如來因為其母略說法要。",
        "translation": "When the king of the army arrived and went out hunting, the Tathāgata briefly explained the essentials of the Dharma to his mother.",
        "source": "T51n2087_003:0884a16_2"
    },
    {
        "source_sentence": "遇聖聞法，遂得復明。",
        "translation": "When he met a sage and heard the Dharma, he then regained his insight.",
        "source": "T51n2087_003:0884a17_3"
    },
    {
        "source_sentence": "如來問曰：「汝子，我之族也，今何所在？」",
        "translation": "The Tathāgata asked, You son, we're our clan; where are you now?",
        "source": "T51n2087_003:0884a18_4"
    },
    {
        "source_sentence": "母曰：「旦出畋遊，今將返駕。」",
        "translation": "His mother said, I'm going back to my carriage at sunrise.",
        "source": "T51n2087_003:0884a19_5"
    },
    {
        "source_sentence": "如來與諸大眾尋欲發引。",
        "translation": "The Tathāgata and the masses wanted to initiate it.",
        "source": "T51n2087_003:0884a19_6"
    },
    {
        "source_sentence": "王母曰：「我惟福遇，生育聖族，如來悲愍，又親降臨，我子方還，願少留待。」",
        "translation": "The king's mother said, It's fortunate for me to be born into a noble family, and the Tathāgata is so compassionate that he descended in person. My son will return soon; may I stay here for a little while?",
        "source": "T51n2087_003:0884a20_7"
    },
    {
        "source_sentence": "世尊曰：「斯人者，我之族也。",
        "translation": "The World-honored One said, “These people belong to our clan.",
        "source": "T51n2087_003:0884a22_8"
    },
    {
        "source_sentence": "可聞教而信悟，非親誨以發心。",
        "translation": "They can hear the teaching and believe in it, but they don't give it as a personal instruction to arouse their mind.",
        "source": "T51n2087_003:0884a22_9"
    },
    {
        "source_sentence": "我其行矣。",
        "translation": "I'll do it.",
        "source": "T51n2087_003:0884a23_10"
    },
    {
        "source_sentence": "還，語之曰：『如來從此往拘尸城娑羅樹間入涅槃，宜取舍利，自為供養。』」",
        "translation": "When he returned, he said to him, 'The Tathāgata will enter nirvāṇa between the sal trees in Kuśinagara's city from here and Kauśinagara, so it's better to take the relics and make offerings for yourself.'",
        "source": "T51n2087_003:0884a23_11"
    },
    {
        "source_sentence": "如來與諸大眾凌虛而去。",
        "translation": "The Tathāgata and the assembled crowd flew away through space.",
        "source": "T51n2087_003:0884a25_12"
    },
    {
        "source_sentence": "上軍王方遊獵，遠見宮中光明赫奕，疑有火災，罷獵而返。",
        "translation": "The king of the army was on his hunting excursion and saw from a distance that the palace was shining brilliantly. suspecting that a fire had broken out, he dismounted from hunting and returned home.",
        "source": "T51n2087_003:0884a26_0"
    },
    {
        "source_sentence": "乃見其母復明，慶而問曰：「我去幾何，有斯祥感，能令慈母復明如昔？」",
        "translation": "When he saw that his mother regained consciousness, he was delighted and asked, How long have I been gone? Is there such an auspicious feeling that you can make your compassionate mother regain consciousness as before?",
        "source": "T51n2087_003:0884a27_1"
    },
    {
        "source_sentence": "母曰：「汝出之後，如來至此，聞佛說法，遂得復明。",
        "translation": "The mother said, “After you leave home, the Tathāgata will come here. Having heard the Buddha’s discourse he regained his eyesight.",
        "source": "T51n2087_003:0884a28_2"
    },
    {
        "source_sentence": "如來從此至拘尸城娑羅樹間，當取涅槃，召汝速來分取舍利。」",
        "translation": "The Tathāgata will take nirvāṇa from here to the sal trees in Kuśinagara's city and summon you to quickly come and share it with me to obtain the relics.",
        "source": "T51n2087_003:0884b01_3"
    },
    {
        "source_sentence": "時王聞已，悲號頓躄，久而醒悟，命駕馳赴。",
        "translation": "When the king heard this, he cried in distress and suddenly woke up. After a long while he regained consciousness and ordered his chariot to drive away.",
        "source": "T51n2087_003:0884b02_4"
    },
    {
        "source_sentence": "至雙樹間，佛已涅槃。",
        "translation": "He went to the place between the twin [śāla] trees, where the Buddha had entered nirvana.",
        "source": "T51n2087_003:0884b03_5"
    },
    {
        "source_sentence": "時諸國王輕其邊鄙，寶重舍利，不欲分與。",
        "translation": "The kings of the various countries despised him as a vulgar man and did not want to share his precious relics with him.",
        "source": "T51n2087_003:0884b04_6"
    },
    {
        "source_sentence": "是時天、人大眾重宣佛意，諸王聞已，遂先均授。",
        "translation": "The gods and humans then repeatedly proclaimed the Buddha's teaching, and when the kings heard it, they all gave it to him first.",
        "source": "T51n2087_003:0884b05_7"
    },
    {
        "source_sentence": "瞢揭釐城東北踰山越谷，逆上信度河，途路危險，山谷杳冥，或履縆索，",
        "translation": "To the northeast of the city of Ganga they pass through mountains and valleys, going upward to cross the Indus River. The paths are dangerous and the mountains and valleys are deep and dark; some may walk on footpaths or on bridges.",
        "source": "T51n2087_003:0884b06_8"
    },
    {
        "source_sentence": "或牽鐵鎖，棧道虛臨，飛梁危構，椽杙躡蹬，行千餘里，至達麗羅川，",
        "translation": "Some had an iron chain drawn, and the road leading up the valley was paved in the air. The flying beams of the bridges were built in a dangerously shaped conditioned posture. After going for more than one thousand li, they reached the Dalila River.",
        "source": "T51n2087_003:0884b07_9"
    },
    {
        "source_sentence": "即烏仗那國舊都也。",
        "translation": "It is the old capital of the country of Udyāna.",
        "source": "T51n2087_003:0884b09_10"
    },
    {
        "source_sentence": "多出黃金及欝金香。",
        "translation": "It mostly produces the fragrance of gold and brass.",
        "source": "T51n2087_003:0884b09_11"
    },
    {
        "source_sentence": "達麗川中大伽藍側，有刻木慈氏菩薩像，金色晃昱，靈鑒潛通，高百餘尺，",
        "translation": "Beside the great monastery in the valley of Darya is a statue of Maitreya Bodhisattva, carved in wood and endowed with brilliant golden color. It has latent spiritual powers and is over one hundred feet in height.",
        "source": "T51n2087_003:0884b10_12"
    },
    {
        "source_sentence": "末田底迦(舊曰末田地，訛略也)阿羅漢之所造也。",
        "translation": "Madhyāntika (formerly abbreviated as Madhyāntika) was created by the arhats.",
        "source": "T51n2087_003:0884b12_13"
    },
    {
        "source_sentence": "羅漢以神通力，携引匠人升覩史多天(舊曰兜率他也，又曰兜術他，訛也)親觀妙相，",
        "translation": "Through his supernatural powers, the arhat led the craftsman up to the Tuṣita Heaven (formerly transcribed as Tuṣita Heaven in error) and observed the marvelous features there.",
        "source": "T51n2087_003:0884b13_0"
    },
    {
        "source_sentence": "三返之後，功乃畢焉。",
        "translation": "After three rebirths, the emperor finished his work.",
        "source": "T51n2087_003:0884b14_1"
    },
    {
        "source_sentence": "自有此像，法流東派。",
        "translation": "He himself had this image and the teachings were transmitted to the east.",
        "source": "T51n2087_003:0884b15_2"
    },
    {
        "source_sentence": "從此東行，踰嶺越谷，逆上信度河，飛梁棧道，履危涉險，經五百餘里，",
        "translation": "From here the Master traveled eastward for more than five hundred li, crossing mountain ranges and valleys to go upstream on the Indus River. He climbed a flying beaver’s path that was more than five hundred li in all dangers.",
        "source": "T51n2087_003:0884b15_3"
    },
    {
        "source_sentence": "至鉢露羅國(北印度境)。",
        "translation": "He arrived in the country of Balūra (in the domain of northern India).",
        "source": "T51n2087_003:0884b17_4"
    },
    {
        "source_sentence": "鉢露羅國，周四千餘里，在大雪山間，東西長，南北狹。",
        "translation": "The country of Balūra is more than four thousand li in circuit. Forming part of the Great Snowy Mountains, it is long from east to west and narrow from south to north.",
        "source": "T51n2087_003:0884b18_0"
    },
    {
        "source_sentence": "多麥、豆，出金、銀，資金之利，國用富饒。",
        "translation": "The country produces much wheat and pulse, as well as gold and silver. Because of the richness of its treasuries it has a wealthy national treasury.",
        "source": "T51n2087_003:0884b19_1"
    },
    {
        "source_sentence": "時唯寒烈，人性獷暴，薄於仁義，無聞禮節。",
        "translation": "The climate is bitterly cold and the people are rustic by custom and lacking in kindness and righteousness. They have not heard of etiquette.",
        "source": "T51n2087_003:0884b20_2"
    },
    {
        "source_sentence": "形貌麁弊，衣服毛褐。",
        "translation": "The people are rough and ugly in appearance, wearing fur and woolen clothes.",
        "source": "T51n2087_003:0884b21_3"
    },
    {
        "source_sentence": "文字大同印度。",
        "translation": "Their written language is much the same as that of India.",
        "source": "T51n2087_003:0884b21_4"
    },
    {
        "source_sentence": "言語異於諸國，伽藍數百所，僧徒數千人，學無專習，戒行多濫。",
        "translation": "Their language is different from that of other countries. There are several hundred monasteries with several thousand monks, who study but not practice exclusively; and the observance of the disciplinary rules is often confused.",
        "source": "T51n2087_003:0884b21_5"
    },
    {
        "source_sentence": "從此復還烏鐸迦漢荼城，南渡信度河，河廣三四里，南流，澄清皎鏡，",
        "translation": "From here the Master returned to the city of Udrakahanda and crossed the Sindhu River at the south. The river was three or four li in width, flowing toward the south; it was clear and bright as a mirror.",
        "source": "T51n2087_003:0884b23_6"
    },
    {
        "source_sentence": "汩淴漂流。",
        "translation": "It's a river that flows like a stream.",
        "source": "T51n2087_003:0884b25_7"
    },
    {
        "source_sentence": "毒龍、惡獸窟穴其中，若持貴寶、奇花果種及佛舍利渡者，船多飄沒。",
        "translation": "In the caves there are poisonous dragons and evil animals, and if they carry precious treasures, rare flowers, fruit seeds, and Buddha's relics on board, their boats will often drift away.",
        "source": "T51n2087_003:0884b25_8"
    },
    {
        "source_sentence": "渡河至呾叉始羅國(北印度境)。",
        "translation": "He crossed the river to the country of Taksasila (in the domain of northern India).",
        "source": "T51n2087_003:0884b26_9"
    },
    {
        "source_sentence": "呾叉始羅國，周二千餘里。",
        "translation": "The country of Taksasila is more than two thousand li in circuit.",
        "source": "T51n2087_003:0884b28_0"
    },
    {
        "source_sentence": "國大都城周十餘里。",
        "translation": "The capital city of the kingdom is more than ten li in circuit.",
        "source": "T51n2087_003:0884b28_1"
    },
    {
        "source_sentence": "酋豪力競，王族絕嗣，往者役屬迦畢試國，近又附庸迦濕彌羅國。",
        "translation": "The chieftains and powerful tribesmen competed with each other in power, and the royal clans were exterminated. Those who came before them belonged to the country of Kapisaiṣṭa but they all depended on the country of Kaśmīra.",
        "source": "T51n2087_003:0884b29_2"
    },
    {
        "source_sentence": "地稱沃壤，稼穡殷盛，泉流多，花草茂。",
        "translation": "The soil is called fertile and the crops are abundant. There are many springs and flowing streams and plenty of flowers and grass.",
        "source": "T51n2087_003:0884c01_3"
    },
    {
        "source_sentence": "氣序和暢，風俗輕勇，崇敬三寶。",
        "translation": "The climate is mild and the people are light and bold by custom and venerate the Triple Gem.",
        "source": "T51n2087_003:0884c02_4"
    },
    {
        "source_sentence": "伽藍雖多，荒蕪已甚，僧徒寡少，並學大乘。",
        "translation": "Although there are many monasteries, most of them are in ruins. There are few monks, all of whom study Mahayana teachings.",
        "source": "T51n2087_003:0884c03_5"
    },
    {
        "source_sentence": "大城西北七十餘里有醫羅鉢呾羅龍王池，周百餘步。",
        "translation": "More than seventy li to the northwest of the great city is the pond of the dragon king Healing Rāpattra, more than one hundred paces in circuit.",
        "source": "T51n2087_003:0884c04_6"
    },
    {
        "source_sentence": "其水澄清，雜色蓮華同榮異彩。",
        "translation": "The water is clear and the variegated lotus flowers of different colors flourish with the same color.",
        "source": "T51n2087_003:0884c05_7"
    },
    {
        "source_sentence": "此龍者，即昔迦葉波佛時壞醫羅鉢羅樹苾芻者也。",
        "translation": "This dragon was a monk named Rāpattra, who destroyed his doctor in the past at the time of Kāśyapa Buddha.",
        "source": "T51n2087_003:0884c06_8"
    },
    {
        "source_sentence": "故今彼土請雨祈晴，必與沙門共至池所，彈指慰問隨願必果。",
        "translation": "That's why the king of that land invited rain and prayed for a clear day, and he must go with the ascetic to the pond together with him, snapping his fingers to greet them. Their wishes will surely be fulfilled.",
        "source": "T51n2087_003:0884c07_9"
    },
    {
        "source_sentence": "龍池東南行三十餘里，入兩山間，有窣堵波，無憂王之所建也，高百餘尺。",
        "translation": "Going southeast for more than thirty li from the dragon’s lake, one enters two mountains. There is a stupa over one hundred feet high built by King Aśoka at the place where he was born.",
        "source": "T51n2087_003:0884c08_10"
    },
    {
        "source_sentence": "是釋迦如來懸記，當來慈氏世尊出興之時，自然有四大寶藏，即斯勝地，",
        "translation": "The Tathāgata Śākyamuni predicted, “When the World-honored One Maitreya comes forth in the future, there will naturally be stores of the four great treasures. This is the sphere of superiority.",
        "source": "T51n2087_003:0884c10_11"
    },
    {
        "source_sentence": "當其一所。",
        "translation": "It should be one of those things.",
        "source": "T51n2087_003:0884c12_12"
    },
    {
        "source_sentence": "聞諸先志曰：或時地震，諸山皆動，周藏百步，無所傾搖。",
        "translation": "I heard some old people say that sometimes there is an earthquake and all the mountains are shaken. It lies about a hundred paces in circumference without moving at all.",
        "source": "T51n2087_003:0884c12_13"
    },
    {
        "source_sentence": "諸有愚夫，妄加發掘，地為震動，人皆蹎仆。",
        "translation": "Foolish people began digging in vain. The earth quaked and all the people fell to the ground.",
        "source": "T51n2087_003:0884c13_14"
    },
    {
        "source_sentence": "傍有伽藍，圮損已甚，久絕僧徒。",
        "translation": "Beside it is a monastery that has been in great distress and the monks have been starved for a long time.",
        "source": "T51n2087_003:0884c14_15"
    },
    {
        "source_sentence": "城北十二三里有窣堵波，無憂王之建也。",
        "translation": "Twelve or thirteen li to the north of the city is a stupa built by King Aśoka.",
        "source": "T51n2087_003:0884c15_16"
    },
    {
        "source_sentence": "或至齋日，時放光明，神花天樂，頗有見聞。",
        "translation": "On fast days it sometimes emits a ray of light that is accompanied by divine flowers and celestial music. Quite often people see and hear this kind of music.",
        "source": "T51n2087_003:0884c16_17"
    },
    {
        "source_sentence": "聞諸先志曰：近有婦人，身嬰惡癩，竊至窣堵波，責躬禮懺，見其庭宇有諸糞穢，",
        "translation": "I heard some old people say that there was a woman who had recently become ill with malignant scabies and secretly came to the stupa to confess her sins. She saw all the filthy dirt in the courtyard of the house.",
        "source": "T51n2087_003:0884c17_18"
    },
    {
        "source_sentence": "掬除灑掃，塗香散華，採青蓮。",
        "translation": "They scooped up and swept away the garbage, smeared it with fragrant ointments and scattered flowers, and collected blue lotuses.",
        "source": "T51n2087_003:0884c19_19"
    },
    {
        "source_sentence": "重布其地。",
        "translation": "It's repeatedly spread on the ground.",
        "source": "T51n2087_003:0884c20_20"
    },
    {
        "source_sentence": "惡疾除愈，形貌增妍，身出名香，青蓮同馥。",
        "translation": "He was cured of an ailment and became beautiful in appearance. His body emitted a renowned fragrance as fragrant as blue lotus.",
        "source": "T51n2087_003:0884c20_21"
    },
    {
        "source_sentence": "斯勝地也，是如來在昔修菩薩行，為大國王，號戰達羅鉢剌婆(唐言月光)，",
        "translation": "Formerly when the Tathāgata was practicing the deeds of enlightening beings, he was a great king named Candraprabha (known as Yuezhao in Chinese).",
        "source": "T51n2087_003:0884c21_22"
    },
    {
        "source_sentence": "志求菩提，斷頭惠施。",
        "translation": "Wishing to seek enlightenment, he cut off his head and gave generously.",
        "source": "T51n2087_003:0884c22_23"
    },
    {
        "source_sentence": "若此之捨，凡歷千生。",
        "translation": "If he abandons this, he'll go through a thousand lifetimes.",
        "source": "T51n2087_003:0884c23_24"
    },
    {
        "source_sentence": "捨頭窣堵波側有僧伽藍，庭宇荒涼，僧徒減少。",
        "translation": "Beside the stupa of the abandoned head is a monastery with a desolate courtyard and buildings, with a small number of monks.",
        "source": "T51n2087_003:0884c24_0"
    },
    {
        "source_sentence": "昔經部拘摩羅邏多(唐言童受)論師於此製述諸論。",
        "translation": "Formerly the śāstra master Kumārata (known as Tongshou in Chinese) of the Sautrāntika school composed treatises at this monastery.",
        "source": "T51n2087_003:0885a01_1"
    },
    {
        "source_sentence": "城外東南，南山之陰有窣堵波，高百餘尺，是無憂王太子拘浪拏為繼母所誣抉目之處，",
        "translation": "To the southeast of the city is a stupa over one hundred feet high built at the corner of the southern mountain. This was the place where Prince Upariṭṭṭha, prince of King Aśoka, had his eyes shaved by his stepmother.",
        "source": "T51n2087_003:0885a02_2"
    },
    {
        "source_sentence": "無憂王所建也。",
        "translation": "It was built by King Aśoka.",
        "source": "T51n2087_003:0885a04_3"
    },
    {
        "source_sentence": "盲人祈請，多有復明。",
        "translation": "Many blind people prayed, and many regained their eyesight.",
        "source": "T51n2087_003:0885a04_4"
    },
    {
        "source_sentence": "此太子正后生也，儀貌妍雅，慈仁夙著。",
        "translation": "The prince was born in the queen’s court. His manner was graceful and elegant, and he always cherished kindness and compassion.",
        "source": "T51n2087_003:0885a05_5"
    },
    {
        "source_sentence": "正后終沒，繼室憍婬，縱其惛愚，私逼太子。",
        "translation": "The Empress Dowager died and the prince was succeeded to the throne. Even though he was ignorant and stupid, he privately oppressed the prince.",
        "source": "T51n2087_003:0885a06_0"
    },
    {
        "source_sentence": "太子瀝泣引責，退身謝罪。",
        "translation": "The prince wept and blamed him, withdrew, and apologized.",
        "source": "T51n2087_003:0885a07_0"
    },
    {
        "source_sentence": "繼母見違，彌增忿怒，候王閑隙，從容言曰：「夫呾叉始羅，國之要領，",
        "translation": "Seeing this, the king’s stepmother became even more angry. As she was waiting for the king to leave her seat in a quiet place, she said calmly to him, “O Kauṣṭhila, the leader of the state, I am afraid that you will not be able to rule over me.",
        "source": "T51n2087_003:0885a07_1"
    },
    {
        "source_sentence": "非親子弟，其可寄乎？",
        "translation": "Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is",
        "source": "T51n2087_003:0885a09_2"
    },
    {
        "source_sentence": "今者，太子仁孝著聞，親賢之故，物議斯在。」",
        "translation": "Now, the prince's kindness and filial piety are so attached to what he hears that it's because he's intimate with good people.",
        "source": "T51n2087_003:0885a09_3"
    },
    {
        "source_sentence": "王或聞說，雅悅姦謀，即命太子，而誡之曰：「吾承餘緒，垂統繼業，",
        "translation": "Some of the king’s men heard this story and, delighted by their adultery, ordered the crown prince to admonish them, saying, “I inherited some other legacy.",
        "source": "T51n2087_003:0885a10_4"
    },
    {
        "source_sentence": "唯恐失墜，忝負先王。",
        "translation": "I'm afraid of losing it, and I'll be defeated by the former king.",
        "source": "T51n2087_003:0885a12_5"
    },
    {
        "source_sentence": "呾叉始羅國之襟帶，吾今命爾作鎮彼國。",
        "translation": "I'll now order you to pacify that country, which is the belt of the Takṣaśilā country.",
        "source": "T51n2087_003:0885a12_6"
    },
    {
        "source_sentence": "國事殷重，人情詭雜，無妄去就，有虧基緒。",
        "translation": "The national affairs are important and the people have mixed feelings of debauchery. They do not travel in an unmanifest manner to get rid of it but there is a lack of foundation for its existence.",
        "source": "T51n2087_003:0885a13_7"
    },
    {
        "source_sentence": "凡有召命，驗吾齒印。",
        "translation": "Whenever there's an summon, I'll examine the seal of my teeth.",
        "source": "T51n2087_003:0885a14_8"
    },
    {
        "source_sentence": "印在吾口，其有謬乎？」",
        "translation": "Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is?",
        "source": "T51n2087_003:0885a15_9"
    },
    {
        "source_sentence": "於是太子銜命來鎮。",
        "translation": "The prince then ordered him to come to town.",
        "source": "T51n2087_003:0885a15_10"
    },
    {
        "source_sentence": "歲月雖淹，繼室彌怒，詐發制書，紫泥封記，候王眠睡，竊齒為印，馳使而往，",
        "translation": "Even as the water poured in for many years, his successors became angry. They fraudulently wrote down the disciplinary rules and wrote a letter of entrustment in purple clay; while the king was sleeping or waking, they secretly stamped their teeth with seals to send messengers back and forth.",
        "source": "T51n2087_003:0885a16_11"
    },
    {
        "source_sentence": "賜以責書。",
        "translation": "He was given a book of rebuke.",
        "source": "T51n2087_003:0885a17_12"
    },
    {
        "source_sentence": "輔臣跪讀，相顧失圖。",
        "translation": "The assistant ministers knelt and read it, losing sight of each other.",
        "source": "T51n2087_003:0885a18_13"
    },
    {
        "source_sentence": "太子問曰：「何所悲乎？」",
        "translation": "The prince asked, What's the pity?",
        "source": "T51n2087_003:0885a18_14"
    },
    {
        "source_sentence": "曰：「大王有命，書責太子，抉去兩目，逐棄山谷，任其夫妻，隨時生死。",
        "translation": "He said, “The great king has ordered me to write a letter of reprimand against the prince. I will cut off my two eyes and drive out the mountains and valleys so that they can be separated by their husbands and wives at any time during the rainy season.",
        "source": "T51n2087_003:0885a19_15"
    },
    {
        "source_sentence": "雖有此命，尚未可依。",
        "translation": "Even though they have this life, they can't yet rely on it.",
        "source": "T51n2087_003:0885a20_16"
    },
    {
        "source_sentence": "今宜重請，面縛待罪。」",
        "translation": "Now, it's appropriate to repeat the invitation, and I'll face bondage and wait for punishment.",
        "source": "T51n2087_003:0885a21_17"
    },
    {
        "source_sentence": "太子曰：「父而賜死，其可辭乎？",
        "translation": "The prince said, “My father died while I was still alive.",
        "source": "T51n2087_003:0885a21_18"
    },
    {
        "source_sentence": "齒印為封，誠無謬矣。」",
        "translation": "The teeth seal is the seal, and there's really no mistake.",
        "source": "T51n2087_003:0885a22_19"
    },
    {
        "source_sentence": "命旃荼羅抉去其眼。",
        "translation": "He ordered the caṇḍāla to remove his eyes.",
        "source": "T51n2087_003:0885a23_0"
    },
    {
        "source_sentence": "眼既失明，乞貸自濟，流離展轉，至父都城。",
        "translation": "Having lost his eyesight, he begged to rescue himself and fled one after the other until he reached his father’s capital city.",
        "source": "T51n2087_003:0885a23_1"
    },
    {
        "source_sentence": "其妻告曰：「此是王城。",
        "translation": "His wife told him, “This is the king’s city.",
        "source": "T51n2087_003:0885a24_2"
    },
    {
        "source_sentence": "嗟乎，飢寒良苦！",
        "translation": "What a shame, how painful it is to suffer from hunger and cold!",
        "source": "T51n2087_003:0885a25_3"
    },
    {
        "source_sentence": "昔為王子，今作乞人！",
        "translation": "Formerly you were a prince, but now you're a beggar!",
        "source": "T51n2087_003:0885a25_4"
    },
    {
        "source_sentence": "願得聞知，重申先責。」",
        "translation": "May I hear it and know it, and repeat my previous rebuke?",
        "source": "T51n2087_003:0885a25_5"
    },
    {
        "source_sentence": "於是謀計，入王內廐，於夜後分，泣對清風，長嘯悲吟，箜篌鼓和。",
        "translation": "So he made up his plan and entered the king’s palace. On the latter watch of the night, weeping to the sound of a gentle breeze, he cried out in sorrow and wailed loudly, clapping his hands together in harmony.",
        "source": "T51n2087_003:0885a26_6"
    },
    {
        "source_sentence": "王在高樓，聞其雅唱，辭甚怨悲，怪而問曰：「箜篌歌聲，似是吾子，",
        "translation": "When the king was staying in a high tower, he heard his elegant singing. Being greatly enraged and saddened, he wondered and asked, “Sounds like my children’s songs.",
        "source": "T51n2087_003:0885a28_0"
    },
    {
        "source_sentence": "今以何故而來此乎？」",
        "translation": "Why have you come here now?",
        "source": "T51n2087_003:0885a29_1"
    },
    {
        "source_sentence": "即問內廐：「誰為歌嘯？」",
        "translation": "He asked the inner monk, Who's singing and shouting?",
        "source": "T51n2087_003:0885b01_0"
    },
    {
        "source_sentence": "遂將盲人，而來對旨。",
        "translation": "He then took the blind man and came to confront him.",
        "source": "T51n2087_003:0885b01_1"
    },
    {
        "source_sentence": "王見太子，銜悲問曰：「誰害汝身，遭此禍釁？",
        "translation": "When the king saw the prince, he grieved and asked, Who killed you to be harmed by this disaster?",
        "source": "T51n2087_003:0885b02_2"
    },
    {
        "source_sentence": "愛子喪明，猶自不覺，凡百黎元，如何究察？",
        "translation": "My beloved son has lost his eyesight, but I am not aware of it myself. How can I search out the origin of all this?",
        "source": "T51n2087_003:0885b03_3"
    },
    {
        "source_sentence": "天乎，天乎，何德之衰！」",
        "translation": "Gods, gods, what's the decline of virtue!",
        "source": "T51n2087_003:0885b04_4"
    },
    {
        "source_sentence": "太子悲泣，謝而對曰：「誠以不孝，負責於天，某年日月，忽奉慈旨，",
        "translation": "The prince, weeping in sorrow, apologized and said to the king, “Because of my unfilial deeds I am indeed entrusted with heavenly responsibilities. For a certain number of days and months I have neglected to follow your compassionate instructions.",
        "source": "T51n2087_003:0885b04_5"
    },
    {
        "source_sentence": "無由致辭，不敢逃責。」",
        "translation": "There's no reason to say words, and I won't dare to run away from them.",
        "source": "T51n2087_003:0885b06_6"
    },
    {
        "source_sentence": "其王心知繼室為不軌也，無所究察，便加刑辟。",
        "translation": "Knowing in his mind that the heirs were not following the proper rules, the king had no way to investigate the matter and imprisoned them.",
        "source": "T51n2087_003:0885b06_7"
    },
    {
        "source_sentence": "時菩提樹伽藍有瞿沙(唐言妙音)大阿羅漢者，四辯無礙，三明具足。",
        "translation": "At the time, there was a great arhat named Ghoṣa (known as Miaoyin in Chinese) at the monastery of the bodhi tree, who had four unhindered eloquence and three insights.",
        "source": "T51n2087_003:0885b07_8"
    },
    {
        "source_sentence": "王將盲子，陳告其事，唯願慈悲，令得復明。",
        "translation": "The king told the blind boy to tell him about his affairs, wishing only for mercy and compassion so that he could regain his sight.",
        "source": "T51n2087_003:0885b09_9"
    },
    {
        "source_sentence": "時彼羅漢受王請已，即於是日宣令國人：「吾於後日，欲說妙理，人持一器，",
        "translation": "On that day, having accepted the king’s invitation, the arhat said to the people of his country, “I wish to explain the fine principles on a later day.",
        "source": "T51n2087_003:0885b10_10"
    },
    {
        "source_sentence": "來此聽法，以盛泣淚也。」",
        "translation": "Come here to hear the teaching, weeping and wailing.",
        "source": "T51n2087_003:0885b12_11"
    },
    {
        "source_sentence": "於是遠近相趨，士女雲集。",
        "translation": "So the people from near and far rushed together, men and women gathered in a great multitude.",
        "source": "T51n2087_003:0885b12_12"
    },
    {
        "source_sentence": "是時阿羅漢說十二因緣，凡厥聞法，莫不悲耿，以所持器，盛其瀝泣。",
        "translation": "The arhat then explained the twelve causes and conditions, and everyone who heard the teaching was overcome with grief; he filled his bowl with tears and wept.",
        "source": "T51n2087_003:0885b13_13"
    },
    {
        "source_sentence": "說法既已，總收眾淚，置之金盤，而自誓曰：「凡吾所說，諸佛至理。",
        "translation": "Having preached the Dharma, he collected all his tears and placed them on a golden tray. He made a vow, saying, “All that I teach is the ultimate truth of the buddhas.",
        "source": "T51n2087_003:0885b15_14"
    },
    {
        "source_sentence": "理若不真，說有紕繆，斯則已矣；",
        "translation": "If the doctrine were not true, it would have been said to be coarse and subtle.",
        "source": "T51n2087_003:0885b16_15"
    },
    {
        "source_sentence": "如其不爾，願以眾淚，洗彼盲眼，眼得復明，明視如昔。」",
        "translation": "If that's not the case, may he wash his blind eye with a multitude of tears so that it regains its eyesight and looks as before.",
        "source": "T51n2087_003:0885b17_16"
    },
    {
        "source_sentence": "發是語訖，持淚洗眼，眼遂復明。",
        "translation": "After he spoke these words, he washed his eyes with tears and their eyes regained clarity.",
        "source": "T51n2087_003:0885b18_17"
    },
    {
        "source_sentence": "王乃責彼輔臣，詰諸僚佐，或黜或放，或遷或死。",
        "translation": "The king reprimanded the ministers and interrogated the officials, either by depos­ terizing or releasing them, or by dismissing or dying them.",
        "source": "T51n2087_003:0885b19_18"
    },
    {
        "source_sentence": "諸豪世俗移居雪山東北沙磧之中。",
        "translation": "The noble and worldly people moved to live in the desert northeast of the snowy mountains.",
        "source": "T51n2087_003:0885b20_19"
    },
    {
        "source_sentence": "從此東南越諸山谷，行七百餘里，至僧訶補羅國(北印度境)。",
        "translation": "From here going southeast for more than seven hundred li through various valleys, I reached the country of Siṃhalapura (in the domain of northern India).",
        "source": "T51n2087_003:0885b21_20"
    },
    {
        "source_sentence": "僧訶補羅國，周三千五六百里，西臨信度河。",
        "translation": "The country of Siṃhalapura is three thousand five hundred li in circuit and borders on the Indus River to the west.",
        "source": "T51n2087_003:0885b23_0"
    },
    {
        "source_sentence": "國大都城周十四五里，依山據嶺，堅峻險固。",
        "translation": "The capital city of the country is fourteen or fifteen li in circuit. It is built on a hill and rests on a range, which is strong and perilous.",
        "source": "T51n2087_003:0885b24_1"
    },
    {
        "source_sentence": "農務少功，地利多獲。",
        "translation": "There is little effort in the cultivation of agriculture and much profit from the land.",
        "source": "T51n2087_003:0885b25_2"
    },
    {
        "source_sentence": "氣序寒，人性猛，俗尚驍勇，又多譎詐。",
        "translation": "The climate is cold and the people are vigorous by nature. They are brave and courageous by custom but they often deceive others.",
        "source": "T51n2087_003:0885b25_3"
    },
    {
        "source_sentence": "國無君長主位，役屬迦濕彌羅國。",
        "translation": "The kingdom has no ruler or lord and is a dependency of Kaśmīra.",
        "source": "T51n2087_003:0885b26_4"
    },
    {
        "source_sentence": "城南不遠有窣堵波，無憂王之所建也。",
        "translation": "Not far to the south of the city is a stupa built by King Aśoka.",
        "source": "T51n2087_003:0885b27_5"
    },
    {
        "source_sentence": "莊飾有虧，靈異相繼。",
        "translation": "The decorations are deficient and the spiritual manifestations continue to differ from one another.",
        "source": "T51n2087_003:0885b28_6"
    },
    {
        "source_sentence": "傍有伽藍，空無僧侶。",
        "translation": "Beside it is a monastery with no monks living in the empty space.",
        "source": "T51n2087_003:0885b28_7"
    },
    {
        "source_sentence": "城東南四五十里至石窣堵波，無憂王建也，高二百餘尺。",
        "translation": "About four or five li to the southeast of the city is a stone stupa built by King Aśoka, more than two hundred feet in height.",
        "source": "T51n2087_003:0885b29_8"
    },
    {
        "source_sentence": "池沼十數，映帶左右，雕石為岸，殊形異類。",
        "translation": "The pond and lake, which were ten in number, reflected the belt to the left and right. Carved rocks formed the shore; they differed in shape and variety of species.",
        "source": "T51n2087_003:0885c01_9"
    },
    {
        "source_sentence": "激水清流，汩淴漂注，龍魚水族，窟穴潛泳，四色蓮華，彌漫清潭。",
        "translation": "The water is pure and the river flows calmly. Dragons, fish, and other aquatic creatures are born in caves to bathe in it. Four-colored lotus blossoms of lotus blossoms cover the clear lake.",
        "source": "T51n2087_003:0885c02_10"
    },
    {
        "source_sentence": "百果具繁，同榮異色，林沼交映，誠可遊玩。",
        "translation": "There are plenty of a hundred kinds of fruit and they all grow together with the same prosperity but different colors. Forests and ponds reflect one another, so befitting for leisurely excursions.",
        "source": "T51n2087_003:0885c04_0"
    },
    {
        "source_sentence": "傍有伽藍，久絕僧侶。",
        "translation": "Beside it is a monastery where the monks have been absent for a long time.",
        "source": "T51n2087_003:0885c04_1"
    },
    {
        "source_sentence": "窣堵波側不遠，有白衣外道本師悟所求理初說法處，今有封記，傍建天祠。",
        "translation": "Not far from the stupa is a place where the founder of the non-Buddhist theories in white robes taught the Dharma for the first time to enlighten those who had realized what they sought. There is now a sealed inscription marking the place and a deva temple built beside it.",
        "source": "T51n2087_003:0885c05_2"
    },
    {
        "source_sentence": "其徒苦行，晝夜精勤，不遑寧息。",
        "translation": "They engaged in ascetic practices day and night, exerting themselves energetically without ceasing.",
        "source": "T51n2087_003:0885c07_3"
    },
    {
        "source_sentence": "本師所說之法，多竊佛經之義，隨類設法，擬則軌儀。",
        "translation": "The doctrine taught by the founder was mostly the meaning of the Buddhist scriptures, and he established different doctrines in accordance with different species and laid down disciplinary rules.",
        "source": "T51n2087_003:0885c08_4"
    },
    {
        "source_sentence": "大者謂苾芻，小者稱沙彌。",
        "translation": "The large one is called a monk, and the small one is called a novice.",
        "source": "T51n2087_003:0885c09_5"
    },
    {
        "source_sentence": "威儀律行，頗同僧法。",
        "translation": "The manner and conduct of the monks are quite similar to those of the Sangha.",
        "source": "T51n2087_003:0885c10_0"
    },
    {
        "source_sentence": "唯留少髮，加之露形，或有所服，白色為異，據斯流別，稍用區分。",
        "translation": "Only a small amount is retained, which is added to reveal its shape and sometimes takes on different colors. Based on these differences in color, they are differentiated and slightly distinguished.",
        "source": "T51n2087_003:0885c10_1"
    },
    {
        "source_sentence": "其天師像，竊類如來，衣服為差，相好無異。",
        "translation": "The image of the deva teacher is similar to that of the Tathāgata in appearance, except for the differences in his clothes and features.",
        "source": "T51n2087_003:0885c12_0"
    },
    {
        "source_sentence": "從此復還呾叉始羅國北界，渡信度河，南東行二百餘里，度大石門，昔摩訶薩埵王子，",
        "translation": "From here the Master returned to the northern boundary of the country of Taksasila and crossed the Indus River. Going southeast for more than two hundred li, he crossed the Great石門, which was formerly the place where Mahāsattva Prabhākaramitra lived.",
        "source": "T51n2087_003:0885c13_0"
    },
    {
        "source_sentence": "於此投身飤餓烏擇(音徒)。",
        "translation": "Here, he throws himself into the body of a hungry crow (pronounced Tuṣita).",
        "source": "T51n2087_003:0885c15_1"
    },
    {
        "source_sentence": "其南百四五十步有石窣堵波，摩訶薩埵愍餓獸之無力也，行至此地，乾竹自刺，",
        "translation": "At a distance of one hundred forty or fifty paces to the south is a stone stupa built at the place where Mahāsattva, being helpless by hungry beasts, came along with dry bamboo and drew his own teeth.",
        "source": "T51n2087_003:0885c15_2"
    },
    {
        "source_sentence": "以血啗之，於是乎獸乃噉焉。",
        "translation": "He killed him with his flesh, and the animal was then cured.",
        "source": "T51n2087_003:0885c17_3"
    },
    {
        "source_sentence": "其中地土，洎諸草木，微帶絳色，猶血染也。",
        "translation": "The soil of the land and trees are coarse, with a slight reddish color like blood staining it.",
        "source": "T51n2087_003:0885c18_4"
    },
    {
        "source_sentence": "人履其地，若負芒刺，無云疑信，莫不悲愴。",
        "translation": "People walked on the ground, carrying their arrows and thorns; no one doubted or believed in them. None of them were saddened by this.",
        "source": "T51n2087_003:0885c19_5"
    },
    {
        "source_sentence": "捨身北有石窣堵波，高二百餘尺，無憂王之所建也。",
        "translation": "To the north of the place where he relinquished his body is a stone stupa more than two hundred feet in height built by King Aśoka.",
        "source": "T51n2087_003:0885c20_6"
    },
    {
        "source_sentence": "雕刻奇製，時燭神光。",
        "translation": "The carvings were exquisitely carved and occasionally emitted a divine light.",
        "source": "T51n2087_003:0885c21_7"
    },
    {
        "source_sentence": "小窣堵波及諸石龕動以百數，周此塋域，其有疾病，旋繞多愈。",
        "translation": "Smaller stupas and stone niches, as many as a hundred in number, surround this brahman’s place. Those who suffer from illness circumambulate it but most of them are cured.",
        "source": "T51n2087_003:0885c22_8"
    },
    {
        "source_sentence": "石窣堵波東有伽藍，僧徒百餘人，並學大乘教。",
        "translation": "To the east of the stone stupa there is a monastery with over one hundred monks, all of whom study Mahayana teachings.",
        "source": "T51n2087_003:0885c24_0"
    },
    {
        "source_sentence": "從此東行五十餘里，至孤山，中有伽藍，僧徒二百餘人，並學大乘法教。",
        "translation": "From here going eastward for more than fifty li, I reached an isolated hill where there was a monastery with over two hundred monks, all of whom studied Mahayana teachings.",
        "source": "T51n2087_003:0885c25_1"
    },
    {
        "source_sentence": "華菓繁茂，泉池澄鏡。",
        "translation": "Flowers and fruit trees are abundant and the springs and ponds are clear and mirrorlike.",
        "source": "T51n2087_003:0885c26_2"
    },
    {
        "source_sentence": "傍有窣堵波，高二百餘尺，是如來在昔於此化惡藥叉，令不食肉。",
        "translation": "Beside it is a stupa more than two hundred feet high, built at the place where the Tathāgata formerly converted evil yakṣas and prevented them from eating meat.",
        "source": "T51n2087_003:0885c27_3"
    },
    {
        "source_sentence": "從此東南行五百餘里，至烏剌尸國(北印度境)。",
        "translation": "From here going southeast for more than five hundred li, I reached the country of Urasi (in the domain of northern India).",
        "source": "T51n2087_003:0885c28_4"
    },
    {
        "source_sentence": "烏剌尸國，周二千餘里，山阜連接，田疇隘狹。",
        "translation": "The country of Uraśi is more than two thousand li in circuit, connected by mountains and mounds; its fields are narrow and small.",
        "source": "T51n2087_003:0886a01_0"
    },
    {
        "source_sentence": "國大都城周七八里，無大君長，役屬迦隰彌羅國。",
        "translation": "The capital city is seven or eight li in circuit and has no sovereign ruler; it is a dependency of Kacchmīra.",
        "source": "T51n2087_003:0886a02_0"
    },
    {
        "source_sentence": "宜稼穡，少華果。",
        "translation": "It produces cereals but few flowers and fruit are grown.",
        "source": "T51n2087_003:0886a03_1"
    },
    {
        "source_sentence": "氣序溫和，微有霜雪。",
        "translation": "The climate is mild and there is little snow or frost.",
        "source": "T51n2087_003:0886a03_2"
    },
    {
        "source_sentence": "俗無禮義，人性剛猛，多行詭詐，不信佛法。",
        "translation": "The people have no sense of etiquette and righteousness in custom. They are greedy by nature and often deceitful, not believing in the buddha-dharma.",
        "source": "T51n2087_003:0886a04_3"
    },
    {
        "source_sentence": "大城西南四五里有窣堵波，高二百餘尺，無憂王所建也。",
        "translation": "About four or five li to the southwest of the great city is a stupa more than two hundred feet in height built by King Aśoka.",
        "source": "T51n2087_003:0886a05_4"
    },
    {
        "source_sentence": "傍有伽藍，僧徒寡少，並皆學大乘法教。",
        "translation": "Beside it is a monastery with a few monks, all of whom study Mahayana teachings.",
        "source": "T51n2087_003:0886a06_5"
    },
    {
        "source_sentence": "從此東南，登山履險，度鐵橋，行千餘里，至迦濕彌羅國(舊曰罽賓，",
        "translation": "From here going southeast for more than one thousand li over a thousand li, crossing an iron bridge on a dangerous path of climbing and treading, I reached the country of Kaśmīra (formerly known as Kaśmīra).",
        "source": "T51n2087_003:0886a07_6"
    },
    {
        "source_sentence": "訛也。",
        "translation": "It's also a mistake.",
        "source": "T51n2087_003:0886a08_7"
    },
    {
        "source_sentence": "北印度境)。",
        "translation": "It's the border of northern India.)",
        "source": "T51n2087_003:0886a08_8"
    },
    {
        "source_sentence": "迦濕彌羅國，周七千餘里。",
        "translation": "The country of Kaśmīra is more than seven thousand li in circuit.",
        "source": "T51n2087_003:0886a09_0"
    },
    {
        "source_sentence": "四境負山，山極陗峻，雖有門徑，而復隘狹，自古隣敵無能攻伐。",
        "translation": "The four quarters of the empire were constrained by mountains, which were so steep and precipitous that even though they had gates and passages to pass through, they were narrow and could not be attacked by enemies from ancient times.",
        "source": "T51n2087_003:0886a09_1"
    },
    {
        "source_sentence": "國大都城西臨大河，南北十二三里，東西四五里。",
        "translation": "The capital city lies west of the great river, twelve or thirteen li from south to north and four or five li from east to west.",
        "source": "T51n2087_003:0886a11_2"
    },
    {
        "source_sentence": "宜稼穡，多花果，出龍種馬及欝金香、火珠、藥草。",
        "translation": "It is good for growing crops and there are plenty of flowers and fruit. The native products are dragon seeds, horse roots, millet, gold odor, fire beads, and medicinal plants.",
        "source": "T51n2087_003:0886a12_3"
    },
    {
        "source_sentence": "氣序寒勁，多雪少風。",
        "translation": "The climate is abnormally cold and there is little wind but much snow and a little wind.",
        "source": "T51n2087_003:0886a13_4"
    },
    {
        "source_sentence": "服毛褐，衣白[疊*毛]。",
        "translation": "They are dressed in woolen or cotton clothes.",
        "source": "T51n2087_003:0886a13_5"
    },
    {
        "source_sentence": "土俗輕僄，人多怯懦。",
        "translation": "The native products are frivolous and the people are mostly cowardly.",
        "source": "T51n2087_003:0886a14_6"
    },
    {
        "source_sentence": "國為龍護，遂雄隣境。",
        "translation": "The kingdom was protected by a dragon and consequently prospered in the neighboring regions.",
        "source": "T51n2087_003:0886a14_7"
    },
    {
        "source_sentence": "容貌妍美，情性詭詐。",
        "translation": "The people are beautiful in appearance and deceitful by nature.",
        "source": "T51n2087_003:0886a15_8"
    },
    {
        "source_sentence": "好學多聞，邪正兼信。",
        "translation": "They are fond of learning and learned; they believe in both heterodox doctrines and orthodox doctrines.",
        "source": "T51n2087_003:0886a15_9"
    },
    {
        "source_sentence": "伽藍百餘所，僧徒五千餘人。",
        "translation": "There were more than a hundred monasteries with over five thousand monks.",
        "source": "T51n2087_003:0886a16_10"
    },
    {
        "source_sentence": "有四窣堵波，並無憂王建也，各有如來舍利升餘。",
        "translation": "There are four other stupas built by King Aśoka, each containing more than one sheng of the Tathāgata’s relic bones.",
        "source": "T51n2087_003:0886a16_11"
    },
    {
        "source_sentence": "《國志》曰：國地本龍池也。",
        "translation": "The national gazetteer said, The land of the country is originally a dragon pond.",
        "source": "T51n2087_003:0886a19_0"
    },
    {
        "source_sentence": "昔佛世尊自烏仗那國降惡神已，欲還中國，乘空當此國上，告阿難曰：「我涅槃之後，",
        "translation": "Formerly the Buddha, the World-honored One, having descended from the country of Udyāna to conquer evil spirits, wished to return to China. He flew up into the air and landed in that country. He said to Ānanda:",
        "source": "T51n2087_003:0886a19_1"
    },
    {
        "source_sentence": "有末田底迦阿羅漢，當於此地建國安人，弘揚佛法。」",
        "translation": "There's an arhat named Madhyāntika who will build a country here to pacify the people and spread the Buddha's teaching.",
        "source": "T51n2087_003:0886a21_2"
    },
    {
        "source_sentence": "如來寂滅之後第五十年，阿難弟子末田底迦羅漢者，得六神通，具八解脫，",
        "translation": "In the fifty-fifth year after the nirvana of the Tathāgata, the disciple of Ānanda, the arhat Sadāntika, attained the six supernatural powers and possessed the eight liberations.",
        "source": "T51n2087_003:0886a22_3"
    },
    {
        "source_sentence": "聞佛懸記，心自慶悅，便來至此，於大山嶺，宴坐林中，現大神變。",
        "translation": "Having heard the Buddha’s prediction of enlightenment, he was delighted and came to this place. On a great mountain peak he sat in meditation in a forest and manifested a great miracle.",
        "source": "T51n2087_003:0886a24_4"
    },
    {
        "source_sentence": "龍見深信，請資所欲。",
        "translation": "Seeing this, the dragon had deep faith and asked for what he wanted.",
        "source": "T51n2087_003:0886a26_5"
    },
    {
        "source_sentence": "阿羅漢曰：「願於池內，惠以容膝。」",
        "translation": "The arhat said, May I take pity on you inside the pond to make room for your knees?",
        "source": "T51n2087_003:0886a26_6"
    },
    {
        "source_sentence": "龍王於是縮水奉施。",
        "translation": "The dragon king then reduced the water and offered it as a gift.",
        "source": "T51n2087_003:0886a27_7"
    },
    {
        "source_sentence": "羅漢神通廣身，龍王縱力縮水，池空水盡，龍飜請地。",
        "translation": "When the arhat's supernormal powers extended to his body, the dragon king naturally reduced the water and the empty water in the pond dried up, and the dragons begged for a place.",
        "source": "T51n2087_003:0886a27_8"
    },
    {
        "source_sentence": "阿羅漢於此西北為留一池，周百餘里；",
        "translation": "To the northwest of here the arhat reserved a lake more than one hundred li in circuit for him.",
        "source": "T51n2087_003:0886a29_9"
    },
    {
        "source_sentence": "自餘枝屬，別居小池。",
        "translation": "The other members of the family live separately in small ponds.",
        "source": "T51n2087_003:0886b01_10"
    },
    {
        "source_sentence": "龍王曰：「池地總施，願恒受供。」",
        "translation": "The dragon king said, This is a general offering for the pond ground, so may you always accept it as an offering.",
        "source": "T51n2087_003:0886b01_11"
    },
    {
        "source_sentence": "末田底迦曰：「我今不久無餘涅槃，雖欲受請，其可得乎？」",
        "translation": "Madhyāntika said, Soon, I'll enter nirvāṇa without remainder, and even though I want to accept the invitation, can I get it?",
        "source": "T51n2087_003:0886b02_12"
    },
    {
        "source_sentence": "龍王重請：「五百羅漢常受我供，乃至法盡，法盡之後，還取此國以為居池。」",
        "translation": "The dragon king repeatedly asked, Five hundred arhats will always accept my offerings until the end of the teaching, and after the end of the teaching, they'll take this country back as their dwelling pond.",
        "source": "T51n2087_003:0886b03_13"
    },
    {
        "source_sentence": "末田底迦從其所請。",
        "translation": "Madhyāntika accepted his invitation.",
        "source": "T51n2087_003:0886b05_14"
    },
    {
        "source_sentence": "時阿羅漢既得其地，運大神通力，立五百伽藍。",
        "translation": "When the arhat had attained that land, he used his great supernormal powers to establish five hundred monasteries.",
        "source": "T51n2087_003:0886b05_15"
    },
    {
        "source_sentence": "於諸異國買鬻賤人，以充役使，以供僧眾。",
        "translation": "In various foreign countries he purchased coarse and lowly people to serve as servants and messengers for the Sangha.",
        "source": "T51n2087_003:0886b07_0"
    },
    {
        "source_sentence": "末田底迦入寂滅後，彼諸賤人自立君長，隣境諸國鄙其賤種，莫與交親，",
        "translation": "After the death of Madhyāntika, those lowly people established sovereignty over themselves. The neighboring countries despised their lowly tribesmen and did not associate with them.",
        "source": "T51n2087_003:0886b08_0"
    },
    {
        "source_sentence": "謂之訖利多(唐言買得)。",
        "translation": "It's called Kṛta (known as bought in the Tang).",
        "source": "T51n2087_003:0886b09_1"
    },
    {
        "source_sentence": "今時泉水已多流濫。",
        "translation": "At the present time, many streams of water from the spring have flown in disorder.",
        "source": "T51n2087_003:0886b10_2"
    },
    {
        "source_sentence": "摩揭陀國無憂王以如來涅槃之後第一百年，命世君臨，威被殊俗。",
        "translation": "In the first hundred years after the nirvana of the Tathāgata, King Aśoka of Magadha ascended the throne and his authority spread to different people.",
        "source": "T51n2087_003:0886b11_0"
    },
    {
        "source_sentence": "深信三寶，愛育四生。",
        "translation": "They deeply believe in the Three Treasures and cherish the four kinds of living beings.",
        "source": "T51n2087_003:0886b12_1"
    },
    {
        "source_sentence": "時有五百羅漢僧、五百凡夫僧，王所敬仰，供養無差。",
        "translation": "At the time, there were five hundred arhat monks and five hundred ordinary monks who were venerated by the king and offered offerings without distinction.",
        "source": "T51n2087_003:0886b13_2"
    },
    {
        "source_sentence": "有凡夫僧摩訶提婆(唐言大天)，闊達多智，幽求名實，潭思作論，理違聖教，",
        "translation": "There was an unenlightened monk named Mahedeva (known as Great God in Chinese), a learned scholar of extensive knowledge who sought fame and reality. He wrote a treatise on the doctrine against the holy teachings by absorbing himself in contemplation.",
        "source": "T51n2087_003:0886b14_3"
    },
    {
        "source_sentence": "凡有聞知，群從異議。",
        "translation": "Anyone who has heard it knows it, and the crowd follows his divergent views.",
        "source": "T51n2087_003:0886b16_0"
    },
    {
        "source_sentence": "無憂王不識凡、聖，同情所好，黨援所親，召集僧徒赴殑伽河，欲沈深流，",
        "translation": "King Aśoka did not know the worldling and the holy ones. They were all sympathetic and fond of him, so he joined his kinsmen and relatives to gather the monks together in the Ganges River with the intention of sinking into a deep river.",
        "source": "T51n2087_003:0886b16_1"
    },
    {
        "source_sentence": "總從誅戮。",
        "translation": "They'll all be executed.",
        "source": "T51n2087_003:0886b18_2"
    },
    {
        "source_sentence": "時諸羅漢既逼命難，咸運神通，凌虛履空，來至此國，山棲谷隱。",
        "translation": "The arhats were constrained by the difficulties of life, and they all used their supernatural powers to flee through space and traveled in the air to come to this country, where they lived in seclusion in the mountains and valleys.",
        "source": "T51n2087_003:0886b18_3"
    },
    {
        "source_sentence": "時無憂王聞而懼，躬來謝過，請還本國。",
        "translation": "Fearful of what he heard, King Aśoka came in person to apologize and asked him to return to his own country.",
        "source": "T51n2087_003:0886b20_4"
    },
    {
        "source_sentence": "彼諸羅漢確不從命。",
        "translation": "Those arhats definitely won't obey orders.",
        "source": "T51n2087_003:0886b21_5"
    },
    {
        "source_sentence": "無憂王為羅漢建五百僧伽藍，總以此國持施眾僧。",
        "translation": "King Aśoka built five hundred monasteries for the arhats and gave them all to the monks in this country.",
        "source": "T51n2087_003:0886b21_6"
    },
    {
        "source_sentence": "健馱邏國迦膩色迦王，以如來涅槃之後第四百年，應期撫運，王風遠被，",
        "translation": "The king Kaniṣka of the country of Gandhāra, forty-four hundred years after the nirvana of the enlightened one, wished to pacify the earth and his royal wind would blow from a distance.",
        "source": "T51n2087_003:0886b22_7"
    },
    {
        "source_sentence": "殊俗內附。",
        "translation": "It's different from what's attached within the secular.",
        "source": "T51n2087_003:0886b24_8"
    },
    {
        "source_sentence": "機務餘暇，每習佛經，日請一僧入宮說法，而諸異議部執不同。",
        "translation": "Every day he studied Buddhist scriptures and invited a monk to the palace to preach the Dharma, but the heretical sects held different views.",
        "source": "T51n2087_003:0886b24_9"
    },
    {
        "source_sentence": "王用深疑，無以去惑。",
        "translation": "The king was deeply doubtful, and there was no way to remove his confusion.",
        "source": "T51n2087_003:0886b26_10"
    },
    {
        "source_sentence": "時脇尊者曰：「如來去世，歲月逾邈，弟子部執，師資異論，各據聞見，",
        "translation": "Venerable脇 then said: When the Tathāgata passed away, more than ten years had passed since his passing away. All the disciples who belonged to the Śākyamuni school held different theories and their teachers taught different theories according to what they had heard and seen.",
        "source": "T51n2087_003:0886b26_11"
    },
    {
        "source_sentence": "共為矛楯。」",
        "translation": "Together, they're the spear and shield.",
        "source": "T51n2087_003:0886b28_12"
    },
    {
        "source_sentence": "時王聞已，甚用感傷，悲歎良久，謂尊者曰：「猥以餘福，聿遵前緒，",
        "translation": "Having heard this, the king was greatly grieved and lamented for a long time. He said to the venerable monk, “With the remaining merits of my previous existence I will follow your example.",
        "source": "T51n2087_003:0886b28_13"
    },
    {
        "source_sentence": "去聖雖遠，猶為有幸，敢忘庸鄙，紹隆法教，隨其部執，具釋三藏。」",
        "translation": "Even though he's far from the sage, it's still fortunate that he dares to forget the vulgar and promote the teaching of the Dharma and explain the Tripiṭaka in detail according to the attachments of his school.",
        "source": "T51n2087_003:0886c01_14"
    },
    {
        "source_sentence": "脇尊者曰：「大王宿殖善本，多資福祐，留情佛法，是所願也。」",
        "translation": "Venerable Vajra said, The great king planted good roots in the past, accumulated much merit and blessedness, and remained attached to the Buddha's teaching; this is what he wished.",
        "source": "T51n2087_003:0886c02_15"
    },
    {
        "source_sentence": "王乃宣令遠近，召集聖哲。",
        "translation": "The king then issued a decree to summon the sages and philosophers from near and far.",
        "source": "T51n2087_003:0886c04_16"
    },
    {
        "source_sentence": "於是四方輻湊，萬里星馳，英賢畢萃，叡聖咸集。",
        "translation": "The wise and saintly monks of the four quarters gathered together in this assembly, as many as ten thousand li in all directions.",
        "source": "T51n2087_003:0886c04_17"
    },
    {
        "source_sentence": "七日之中，四事供養。",
        "translation": "Within seven days, he offered four kinds of offerings.",
        "source": "T51n2087_003:0886c05_18"
    },
    {
        "source_sentence": "既欲法議，恐其諠雜。",
        "translation": "Since he wished to discuss the matter of the Dharma, he feared that it might be confusing.",
        "source": "T51n2087_003:0886c06_19"
    },
    {
        "source_sentence": "王乃具懷白諸僧曰：「證聖果者住，具結縛者還。」",
        "translation": "The king then told the saṃgha in full, Those who realize the noble fruit abide, and those who are fully fettered return.",
        "source": "T51n2087_003:0886c06_20"
    },
    {
        "source_sentence": "如此尚眾。",
        "translation": "Such people are still numerous.",
        "source": "T51n2087_003:0886c07_21"
    },
    {
        "source_sentence": "又重宣令：「無學人住，有學人還。」",
        "translation": "Again, he ordered, There's no student to stay, but there are students who will return.",
        "source": "T51n2087_003:0886c08_22"
    },
    {
        "source_sentence": "猶復繁多。",
        "translation": "It's still numerous.",
        "source": "T51n2087_003:0886c08_23"
    },
    {
        "source_sentence": "又更下令：「具三明、備六通者住，自餘各還。」",
        "translation": "Again, he ordered, Suppose someone who possesses the three insights and has the six supernormal powers abide, and they return with the rest.",
        "source": "T51n2087_003:0886c09_24"
    },
    {
        "source_sentence": "然尚繁多。",
        "translation": "However, there are still many of them.",
        "source": "T51n2087_003:0886c10_25"
    },
    {
        "source_sentence": "又更下令：「其有內窮三藏、外達五明者住，自餘各還。」",
        "translation": "Again, he ordered, Those who have internally exhausted the three collections and those who have externally comprehended the five insights to stay there, and the rest will return home.",
        "source": "T51n2087_003:0886c10_26"
    },
    {
        "source_sentence": "於是得四百九十九人。",
        "translation": "Thereupon, he attained 4,99 people.",
        "source": "T51n2087_003:0886c11_27"
    },
    {
        "source_sentence": "王欲於本國，苦其暑濕，又欲就王舍城大迦葉波結集石室。",
        "translation": "The king wished to stay in his own country but the place was too hot and humid. He also wished to go to the stone chamber at Rājagṛha, where Mahākāśyapa gathered the relics.",
        "source": "T51n2087_003:0886c12_28"
    },
    {
        "source_sentence": "脇尊者等議曰：「不可。",
        "translation": "Bhagavān and others agreed, saying, No.",
        "source": "T51n2087_003:0886c13_29"
    },
    {
        "source_sentence": "彼多外道，異論糺紛，酬對不暇，何功作論？",
        "translation": "Many heretics hold divergent views and disputes, and there is no time to reply. What use is it to make arguments?",
        "source": "T51n2087_003:0886c14_30"
    },
    {
        "source_sentence": "眾會之心，屬意此國。",
        "translation": "The minds of the assembly belong to this country.",
        "source": "T51n2087_003:0886c15_31"
    },
    {
        "source_sentence": "此國四周山固，藥叉守衛，土地膏腴，物產豐盛，賢聖之所集往，靈僊之所遊止。」",
        "translation": "This country is surrounded by mountains in the four directions and guarded by yakṣas. The land is fertile and productive, where saints and sages gather to live and where spiritual beings dwell.",
        "source": "T51n2087_003:0886c15_32"
    },
    {
        "source_sentence": "眾議斯在，僉曰：「允諧。」",
        "translation": "The congregation was present, and the monk said, harmonious.",
        "source": "T51n2087_003:0886c17_33"
    },
    {
        "source_sentence": "其王是時與諸羅漢自彼而至，建立伽藍，結集三藏，欲作《毘婆沙論》。",
        "translation": "The king and the arhats then came from that place, built a monastery, compiled the Tripiṭaka, and intended to compose the Vibhāṣā-śāstra.",
        "source": "T51n2087_003:0886c18_0"
    },
    {
        "source_sentence": "是時尊者世友，戶外納衣。",
        "translation": "Venerable Vasumitra then took his robes outside the door.",
        "source": "T51n2087_003:0886c19_1"
    },
    {
        "source_sentence": "諸阿羅漢謂世友曰：「結使未除，淨議乖謬，爾宜遠迹，勿居此也。」",
        "translation": "The arhats said to Vasumitra, Don't stay here because the bonds haven't been removed and the discussion of purity is contradictory; it's better for you to go far away.",
        "source": "T51n2087_003:0886c20_2"
    },
    {
        "source_sentence": "世友曰：「諸賢於法無疑，代佛施化，方集大義，欲製正論。",
        "translation": "Vasumitra said, “There is no doubt among the wise in regard to the doctrine. Only when you teach and transform others on behalf of the Buddha will you compile a great collection of doctrines with the intention of writing a correct treatise.” Vasumitra said:",
        "source": "T51n2087_003:0886c21_3"
    },
    {
        "source_sentence": "我雖不敏，粗達微言，三藏玄文、五明至理，頗亦沈研，得其趣矣。」",
        "translation": "Although I'm not an expert, I have a rough understanding of subtle words and the profound texts of the Tripiṭaka and the five branches of knowledge of the ultimate principle, so why wouldn't I be able to study them well enough to get their meaning?",
        "source": "T51n2087_003:0886c23_4"
    },
    {
        "source_sentence": "諸羅漢曰：「言不可以若是。",
        "translation": "The arhats said, You can't say that it's like this.",
        "source": "T51n2087_003:0886c24_5"
    },
    {
        "source_sentence": "汝宜屏居，疾證無學，已而會此，時未晚也。」",
        "translation": "It's better for you to stay in seclusion, quickly realize post-learning, and meet here before it's too late.",
        "source": "T51n2087_003:0886c25_6"
    },
    {
        "source_sentence": "世友曰：「我顧無學，其猶涕唾，志求佛果，不趨小徑。",
        "translation": "Vasumitra said, “I am concerned with the unlearned. They are just like weeping and spitting tears. I aspire to attain buddhahood but do not follow the narrow path of learning.",
        "source": "T51n2087_003:0886c26_7"
    },
    {
        "source_sentence": "擲此縷丸，未墜于地，必當證得無學聖果。」",
        "translation": "If you toss this thread ball on the ground before it falls, you'll surely attain the noble fruit of post-learning.",
        "source": "T51n2087_003:0886c27_8"
    },
    {
        "source_sentence": "時諸羅漢重訶之曰：「增上慢人，斯之謂也。",
        "translation": "The arhats then reprimanded him, saying, An arrogant person is called that.",
        "source": "T51n2087_003:0886c28_9"
    },
    {
        "source_sentence": "無學果者，諸佛所讚，宜可速證，以決眾疑。」",
        "translation": "The fruit of post-learning is praised by the buddhas, and it's advisable to quickly realize it so that you can resolve your doubts.",
        "source": "T51n2087_003:0886c29_10"
    },
    {
        "source_sentence": "於是世友即擲縷丸，空中諸天接縷丸而請曰：「方證佛果，次補慈氏，",
        "translation": "Vasumitra then tossed a ball of thread. The gods in the sky touched the ball of thread and begged him, “May you attain buddhahood! Next, let us join the compassionate family!",
        "source": "T51n2087_003:0887a01_11"
    },
    {
        "source_sentence": "三界特尊，四生攸賴，如何於此欲證小果？」",
        "translation": "The three realms are especially honored, and the four sentient beings rely on them; how can they want to realize the lesser fruit here?",
        "source": "T51n2087_003:0887a03_12"
    },
    {
        "source_sentence": "時諸羅漢見是事已，謝咎推德，請為上座，凡有疑議，咸取決焉。",
        "translation": "When the arhats saw this, they apologized for their faults and praised their virtues and invited him to become the superior monk. Anyone who had doubts or controversies would be able to resolve them.",
        "source": "T51n2087_003:0887a04_13"
    },
    {
        "source_sentence": "是五百賢聖，先造十萬頌《鄔波第鑠論》(舊曰《優波提舍論》，訛也)。",
        "translation": "These five hundred sages and saints had previously composed 100,000 verses of the Upāsaka Treatise (formerly transcribed incorrectly as the Upāsaka Treatise).",
        "source": "T51n2087_003:0887a05_14"
    },
    {
        "source_sentence": "釋《素呾纜藏》(舊曰《修多羅藏》，訛也)。",
        "translation": "Śākyamuni sūtra collection (formerly transcribed as sūtra collection, but incorrectly transcribed as sutra collection).",
        "source": "T51n2087_003:0887a06_15"
    },
    {
        "source_sentence": "次造十萬頌《毘柰耶毘婆沙論》，釋《毘奈耶藏》(舊曰《毘那耶藏》，",
        "translation": "Next, he composed the Vinaya-vibhāṣā-śāstra in 100,000 stanzas to explain the Vinaya Pitaka (formerly transcribed as Vinaya Pitaka).",
        "source": "T51n2087_003:0887a07_16"
    },
    {
        "source_sentence": "訛也)。",
        "translation": "It's also a mistake.)",
        "source": "T51n2087_003:0887a08_17"
    },
    {
        "source_sentence": "後造十萬頌《阿毘達磨毘婆沙論》，釋《阿毘達磨藏》(或曰《阿毘曇藏》，",
        "translation": "Later, he composed the Abhidharma-vibhāṣā-śāstra in 100,000 stanzas to explain the Abhidharma piṭaka (also known as the Abhidharma piṭaka).",
        "source": "T51n2087_003:0887a08_18"
    },
    {
        "source_sentence": "略也)。",
        "translation": "It's also brief.)",
        "source": "T51n2087_003:0887a09_19"
    },
    {
        "source_sentence": "凡三十萬頌，九百六十萬言，備釋三藏，懸諸千古，莫不窮其枝葉，究其淺深，",
        "translation": "The collection consists of thirty million stanzas in all, totaling nine million six hundred thousand syllables. It is a complete explanation of the Tripitaka Master’s treasury and extends over thousands of eons; it does not fail to exhaust its branches and leaves so as to fathom their depth.",
        "source": "T51n2087_003:0887a09_20"
    },
    {
        "source_sentence": "大義重明，微言再顯，廣宣流布，後進賴焉。",
        "translation": "The great doctrine was repeatedly clarified, subtly expressed in words, extensively proclaimed and disseminated, and later relied upon.",
        "source": "T51n2087_003:0887a11_21"
    },
    {
        "source_sentence": "迦膩色迦王遂以赤銅為鍱，鏤寫論文，石函緘封，建窣堵波，藏於其中。",
        "translation": "The king Kaniṣka then carved a copy of the image in red copper and enclosed it in a stone casket. A stupa was built to store the relics within.",
        "source": "T51n2087_003:0887a12_22"
    },
    {
        "source_sentence": "命藥叉神周衛其國，不令異學持此論出，欲求習學，就中受業。",
        "translation": "He ordered the yakṣa deities to circumambulate his country and not allow heretics to preserve this treatise. They wished to study it, so that they could take up their studies there.",
        "source": "T51n2087_003:0887a14_23"
    },
    {
        "source_sentence": "於是功既成畢，還軍本都。",
        "translation": "Soon after the work was completed, he returned to his capital with his troops.",
        "source": "T51n2087_003:0887a15_24"
    },
    {
        "source_sentence": "出此國西門之外，東面而跪，復以此國總施僧徒。",
        "translation": "He came out of the west gate of this country, knelt facing eastward, and again gave the whole land to the monks.",
        "source": "T51n2087_003:0887a16_25"
    },
    {
        "source_sentence": "迦膩色迦王既死之後，訖利多種復自稱王，斥逐僧徒，毀壞佛法。",
        "translation": "After the death of King Kaniṣka, Kālāma again called himself king and expelled the monks, disparaging the buddha-dharma.",
        "source": "T51n2087_003:0887a17_26"
    },
    {
        "source_sentence": "覩貨邏國呬摩呾羅王(唐言雪山下)，其先釋種也。",
        "translation": "The king of Tukhāra (known as Xushan, “Below the Snow Mountains” in Chinese) was a native of the Śākya family.",
        "source": "T51n2087_003:0887a19_27"
    },
    {
        "source_sentence": "以如來涅槃之後第六百年，光有疆土，嗣膺王業，樹心佛地，流情法海。",
        "translation": "In the six hundredth year after the nirvana of the Tathagata, Guṇavarman extended his territory and inherited the king’s business. He planted his mind on the Buddha-stage and flowed his sentiments into the ocean of the Dharma.",
        "source": "T51n2087_003:0887a20_28"
    },
    {
        "source_sentence": "聞訖利多毀滅佛法，招集國中敢勇之士，得三千人，詐為商旅，多齎寶貨，",
        "translation": "Hearing that the philosophers of the Kālīyas had destroyed the buddha-dharma, he summoned all the brave and courageous warriors of his country to gather three thousand men. They fraudulently traveled on a caravan of merchants carrying large quantities of valuable goods.",
        "source": "T51n2087_003:0887a22_29"
    },
    {
        "source_sentence": "挾隱軍器，來入此國。",
        "translation": "They brought their weapons hidden away and came to this country.",
        "source": "T51n2087_003:0887a23_30"
    },
    {
        "source_sentence": "此國之君，特加賓禮。",
        "translation": "The ruler of this country pays special hospitality to the monks.",
        "source": "T51n2087_003:0887a24_31"
    },
    {
        "source_sentence": "商旅之中，又更選募，得五百人，猛烈多謀，各袖利刃，俱持重寶，躬齎所奉，",
        "translation": "Among the merchants and caravans, five hundred men were selected to join the assembly. Each of them had a sharp sword in their sleeves; they carried precious treasures on their backs and presented them to the Emperor.",
        "source": "T51n2087_003:0887a24_32"
    },
    {
        "source_sentence": "持以獻上。",
        "translation": "He held it and offered it to him.",
        "source": "T51n2087_003:0887a26_33"
    },
    {
        "source_sentence": "時雪山下王去其帽，即其座，訖利多王驚懾無措，遂斬其首，令群下曰：「我是覩邏國雪山下王也。",
        "translation": "The king of the foothills of the Himalayas then removed his hat and took his seat. Surprised, the king of Kālyāyana was deprived of his posture and had his head beheaded. He ordered his followers to say, “This is the king of the foothills of the Himalayas of the country of Rājagṛha.",
        "source": "T51n2087_003:0887a26_34"
    },
    {
        "source_sentence": "怒此賤種公行虐政，故於今者誅其有罪。",
        "translation": "Being angry with these lowly people, the gong (i.e., officials) engaged in cruel and oppressive governance, so they are now punished for their crimes.",
        "source": "T51n2087_003:0887a29_35"
    },
    {
        "source_sentence": "凡百眾庶，非爾之辜。」",
        "translation": "All the hundreds of people in the assembly are not guilty of such crimes.",
        "source": "T51n2087_003:0887b01_36"
    },
    {
        "source_sentence": "然其國輔宰臣，遷於異域。",
        "translation": "The ministers and chancellors of that country, however, were relocated to foreign countries.",
        "source": "T51n2087_003:0887b01_37"
    },
    {
        "source_sentence": "既平此國，召集僧徒，式建伽藍，安堵如故。",
        "translation": "Having pacified this country, he summoned the monks and built a monastery in the style of the old one. The stupas are as they used to be.",
        "source": "T51n2087_003:0887b02_38"
    },
    {
        "source_sentence": "復於此國西門之外，東面而跪，持施眾僧。",
        "translation": "Again, outside the west gate of this country, he knelt with his face facing east and offered it to the saṃgha.",
        "source": "T51n2087_003:0887b03_39"
    },
    {
        "source_sentence": "其訖利多種屢以僧徒覆宗滅祀，世積其怨，嫉惡佛法。",
        "translation": "Many of the Kṛdriya clanspeople frequently worshiped Buddhist monastics to cover up their sects and suppress religious rites. They accumulated enemies from generation to generation and became jealous of the buddha-dharma.",
        "source": "T51n2087_003:0887b04_40"
    },
    {
        "source_sentence": "歲月既遠，復自稱王。",
        "translation": "After a long time had passed, he again claimed to be the king.",
        "source": "T51n2087_003:0887b05_41"
    },
    {
        "source_sentence": "故今此國不甚崇信，外道天祠，特留意焉。",
        "translation": "This is why the people of this country do not hold great faith in Buddhism and heretical deva temples are especially noteworthy.",
        "source": "T51n2087_003:0887b06_42"
    },
    {
        "source_sentence": "新城東南十餘里，故城北，大山陽，有僧伽藍，僧徒三百餘人。",
        "translation": "More than ten li to the southeast of the newly built city and north of the old one, on a great hill overlooking the mountain, is a monastery with more than three hundred monks.",
        "source": "T51n2087_003:0887b07_43"
    },
    {
        "source_sentence": "其窣堵波中有佛牙，長可寸半，其色黃白，或至齋日時放光明。",
        "translation": "In the stupa there is a Buddha’s tooth relic, about one and a half inches long, yellowish white in color. On fast days it sometimes emits a ray of light.",
        "source": "T51n2087_003:0887b08_44"
    },
    {
        "source_sentence": "昔訖利多種之滅佛法也，僧徒解散，各隨利居。",
        "translation": "Formerly it was the place where many kinds of Kṛṣis abandoned the buddha-dharma. The monks were scattered and each lived according to his wishes.",
        "source": "T51n2087_003:0887b10_45"
    },
    {
        "source_sentence": "有一沙門，遊諸印度，觀禮聖迹，申其至誠。",
        "translation": "There was a śramaṇa who traveled to various parts of India to pay respect to the holy sites and express his sincerity.",
        "source": "T51n2087_003:0887b11_46"
    },
    {
        "source_sentence": "後聞本國平定，即事歸途，遇諸群象，橫行草澤，奔馳震吼。",
        "translation": "Later he heard that his home country was peaceful and at once on his way home he encountered a herd of elephants running through the grass and marshlands, stamping and shouting in fear.",
        "source": "T51n2087_003:0887b12_47"
    },
    {
        "source_sentence": "沙門見已，昇樹以避。",
        "translation": "Seeing this, the śramaṇa climbed up into a tree to avoid it.",
        "source": "T51n2087_003:0887b13_48"
    },
    {
        "source_sentence": "是時群象相趨奔赴，競吸池水，浸漬樹根，互共排掘，樹遂蹎仆。",
        "translation": "The elephants then rushed to the pond to collect water and soaked the roots of the tree. Digging together, the trees fell down in distress.",
        "source": "T51n2087_003:0887b14_49"
    },
    {
        "source_sentence": "既得沙門，負載而行，至大林中，有病象瘡痛而臥，引此僧手，至所苦處，",
        "translation": "Having thus attained śramaṇahood, he carried it on his back and went to the great forest where a sick elephant was lying with sores and pain. He drew the monk’s hand and took him to the place where he was suffering.",
        "source": "T51n2087_003:0887b15_50"
    },
    {
        "source_sentence": "乃枯竹所刺也。",
        "translation": "It's the thorn of a withered bamboo.",
        "source": "T51n2087_003:0887b17_51"
    },
    {
        "source_sentence": "沙門於是拔竹傅藥，裂其裳，裹其足。",
        "translation": "The śramaṇa then pulled out the bamboo and mixed it with medicine, splitting his clothes and wrapping them around his feet.",
        "source": "T51n2087_003:0887b17_52"
    },
    {
        "source_sentence": "別有大象，持金函授與病象，象既得已，轉授沙門，沙門開函，乃佛牙也。",
        "translation": "There was another great elephant holding a golden casket and giving it to the sick elephant. Having obtained it, the elephant turned around and gave it to the śramaṇa. When the śramaṇa opened the casket, he saw that it contained the Buddha’s tooth relic.",
        "source": "T51n2087_003:0887b18_53"
    },
    {
        "source_sentence": "諸象圍繞，僧出無由。",
        "translation": "Surrounded by the elephants, there was no way for the saṃgha to leave.",
        "source": "T51n2087_003:0887b20_54"
    },
    {
        "source_sentence": "明日齋時，各持異果，以為中饌。",
        "translation": "At the time of the tomorrow's fast, each brings a different fruit to serve as a midday delicacy.",
        "source": "T51n2087_003:0887b20_55"
    },
    {
        "source_sentence": "食已，載僧出林，數百里外，方乃下之，各跪拜而去。",
        "translation": "After they had eaten, they carried the saṃgha out of the forest and came down from a distance of several hundred li. They each knelt down to pay their respects and departed.",
        "source": "T51n2087_003:0887b21_56"
    },
    {
        "source_sentence": "沙門至國西界，渡一駛河，濟乎中流，船將覆沒。",
        "translation": "When the śramaṇa arrived at the western boundary of the country, he crossed a river and saved him from the midstream on a boat that was about to capsized and sank.",
        "source": "T51n2087_003:0887b22_57"
    },
    {
        "source_sentence": "同舟之人互相謂曰：「今此船覆，禍是沙門；",
        "translation": "The people on board said among themselves, “This boat is now overwhelmed by the calamity caused by the śramaṇa.",
        "source": "T51n2087_003:0887b23_58"
    },
    {
        "source_sentence": "必有如來舍利，諸龍利之。」",
        "translation": "There must be a relic of the Tathāgata, and the dragons will benefit from it.",
        "source": "T51n2087_003:0887b24_59"
    },
    {
        "source_sentence": "船主檢驗，果得佛牙。",
        "translation": "The captain of the ship examined it and found the Buddha’s tooth relic.",
        "source": "T51n2087_003:0887b25_60"
    },
    {
        "source_sentence": "時沙門舉佛牙俯謂龍曰：「吾今寄汝，不久來取。」",
        "translation": "The ascetic then raised the Buddha's tooth and bowed down to the dragon, saying, Now, I'll send it to you; I won't be long before I take it.",
        "source": "T51n2087_003:0887b25_61"
    },
    {
        "source_sentence": "遂不渡河，迴船而去，顧河歎曰：「吾無禁術，龍畜所欺！」",
        "translation": "So he didn't cross the river, turned his boat around, and departed. Looking over the river, he said in admiration, I have no forbidden technique, which is deceived by dragons and animals!",
        "source": "T51n2087_003:0887b27_62"
    },
    {
        "source_sentence": "重往印度，學禁龍法。",
        "translation": "He returned to India again and studied the Buddhist teachings forbidden to dragons.",
        "source": "T51n2087_003:0887b28_63"
    },
    {
        "source_sentence": "三歲之後，復還本國，至河之濱，方設壇場，其龍於是捧佛牙函以授沙門。",
        "translation": "Three years later he returned to his native land and set up an altar site at the riverside. The dragon then took the casket containing the Buddha’s tooth relic bones and gave them to the śramaṇa.",
        "source": "T51n2087_003:0887b28_64"
    },
    {
        "source_sentence": "沙門持歸，於此伽藍，而修供養。",
        "translation": "The śramaṇa brought the relics to this monastery and made offerings of them.",
        "source": "T51n2087_003:0887c01_65"
    },
    {
        "source_sentence": "伽藍南十四五里，有小伽藍，中有觀自在菩薩立像。",
        "translation": "Fourteen or fifteen li to the south of the monastery is a small monastery, in which there is a standing statue of Avalokiteśvara Bodhisattva.",
        "source": "T51n2087_003:0887c03_0"
    },
    {
        "source_sentence": "其有斷食誓死為期願見菩薩者，即從像中出妙色身。",
        "translation": "If someone stops eating and vows to die in hopes of seeing the bodhisattva, they'll emerge from their image with a marvelous colored body.",
        "source": "T51n2087_003:0887c04_1"
    },
    {
        "source_sentence": "小伽藍東南三十餘里，至大山，有故伽藍，形製宏壯，蕪漫良甚，今唯一隅起小重閣。",
        "translation": "More than thirty li to the southeast of the small monastery one reaches a great mountain, where there is an old monastery more than thirty li in all directions. Formerly it was constructed in a grand and imposing style but now it is very noisy and uninhabited. A small multistoried pavilion is built in one corner only.",
        "source": "T51n2087_003:0887c06_0"
    },
    {
        "source_sentence": "僧徒三十餘人，並學大乘法教。",
        "translation": "There were more than thirty monks, all of whom studied Mahayana teachings.",
        "source": "T51n2087_003:0887c07_1"
    },
    {
        "source_sentence": "昔僧伽跋陀羅(唐言眾賢)論師於此製《順正理論》。",
        "translation": "Formerly the śāstra master Saṃghabhadra (known as Zhixian in Chinese) composed the Shunzheng lun at this temple.",
        "source": "T51n2087_003:0887c08_2"
    },
    {
        "source_sentence": "伽藍左右諸窣堵波，大阿羅漢舍利並在。",
        "translation": "To the left and right of the monastery there are other stupas that contain the relics of great arhats.",
        "source": "T51n2087_003:0887c09_3"
    },
    {
        "source_sentence": "野獸、山猨採華供養，歲時無替，如承指命。",
        "translation": "Wild animals and mountain garuḍas gather flowers to make offerings at the same time without changing from year to year, just as if they were following their instruction.",
        "source": "T51n2087_003:0887c10_4"
    },
    {
        "source_sentence": "然此山中多諸靈迹，或石壁橫分，峯留馬迹。",
        "translation": "However, there are many traces of spirituality on this mountain. Some have rocky walls or horizontally divided cliffs; the peaks leave traces of horses in the footprints.",
        "source": "T51n2087_003:0887c11_5"
    },
    {
        "source_sentence": "凡厥此類，其狀譎詭，皆是羅漢、沙彌，群從遊戲，手指麾畫，乘馬往來。",
        "translation": "All these kinds of people were arhats and śrāmaṇeras, all dressed in deceitful robes with fingers pointing at each other. They came and went riding on horses to and fro like this.",
        "source": "T51n2087_003:0887c12_6"
    },
    {
        "source_sentence": "遺迹若斯，難以詳述。",
        "translation": "It is difficult to describe in detail the traces of this kind of legacy.",
        "source": "T51n2087_003:0887c14_7"
    },
    {
        "source_sentence": "佛牙伽藍東十餘里，北山崖間，有小伽藍，是昔索建地羅大論師於此作《眾事分毘婆沙論》。",
        "translation": "More than ten li to the east of the monastery with the Buddha’s tooth relic bones is a small monastery situated on a cliff in the northern part of the mountain. Formerly the great śāstra master Sokāndra composed the Abhidharma-vibhāṣā-śāstra on all affairs at this place.",
        "source": "T51n2087_003:0887c14_8"
    },
    {
        "source_sentence": "小伽藍中有石窣堵波，高五十餘尺，是阿羅漢遺身舍利也。",
        "translation": "In a small monastery there is a stone stupa more than fifty feet in height, which is the relic bones left by the arhat.",
        "source": "T51n2087_003:0887c18_0"
    },
    {
        "source_sentence": "先有羅漢，形量偉大，凡所飲食，與象同等。",
        "translation": "Formerly there was an arhat of great stature whose food and drink were the same as those of elephants.",
        "source": "T51n2087_003:0887c19_1"
    },
    {
        "source_sentence": "時人譏曰：「徒知飽食，安識是非？」",
        "translation": "The people then criticized him, They simply know what they've eaten and how to discern right from wrong.",
        "source": "T51n2087_003:0887c20_2"
    },
    {
        "source_sentence": "羅漢將入寂滅也，告諸人曰：「吾今不久當取無餘，欲說自身所證妙法。」",
        "translation": "When the arhat was about to enter nirvāṇa, he told the people, Soon, I will take it without remainder and want to explain the marvelous teaching that I've realized for myself.",
        "source": "T51n2087_003:0887c21_3"
    },
    {
        "source_sentence": "眾人聞之，相更譏笑，咸來集會，共觀得失。",
        "translation": "When the people heard this, they laughed at each other. They all came to the assembly and observed both gains and losses together.",
        "source": "T51n2087_003:0887c22_4"
    },
    {
        "source_sentence": "時阿羅漢告諸人曰：「吾今為汝說本因緣。",
        "translation": "The arhat then told the people, Now, I'll explain the original causes and conditions for you.",
        "source": "T51n2087_003:0887c23_5"
    },
    {
        "source_sentence": "此身之前，報受象身，在東印度，居王內廐。",
        "translation": "Before his death he was reborn as an elephant and lived in the kingdom of Uttarakuru in East India.",
        "source": "T51n2087_003:0887c24_6"
    },
    {
        "source_sentence": "是時此國有一沙門，遠遊印度，尋訪聖教諸經典論。",
        "translation": "At the time, there was an ascetic in this country who traveled far from India to search for scriptures and treatises of the holy teachings.",
        "source": "T51n2087_003:0887c25_7"
    },
    {
        "source_sentence": "時王持我，施與沙門，載負佛經，而至於此。",
        "translation": "The king then took me, gave me to the ascetic, carried the Buddha's sūtras, and came here.",
        "source": "T51n2087_003:0887c27_8"
    },
    {
        "source_sentence": "是後不久，尋即命終。",
        "translation": "Soon after that, he died.",
        "source": "T51n2087_003:0887c28_9"
    },
    {
        "source_sentence": "乘其載經福力所致，遂得為人，復鍾餘慶，早服染衣，勤求出離，不遑寧居，",
        "translation": "As a result of the blessed power of his scriptures and merits, he was able to become a human being. He also had some additional good fortune in store. At an early age he dressed in dyed robes and earnestly sought escape; but he did not have time to live in peace.",
        "source": "T51n2087_003:0887c28_10"
    },
    {
        "source_sentence": "得六神通，斷三界欲。",
        "translation": "They attain the six supernormal powers and cut off the desires of the three realms.",
        "source": "T51n2087_003:0888a01_11"
    },
    {
        "source_sentence": "然其所食，餘習尚然，每自節身，三分食一。」",
        "translation": "However, what they eat is still the same as the other habits, and each time they save their own body, they eat one-third of it.",
        "source": "T51n2087_003:0888a02_0"
    },
    {
        "source_sentence": "雖有此說，人猶未信。",
        "translation": "Even though this teaching exists, people still don't believe it.",
        "source": "T51n2087_003:0888a03_0"
    },
    {
        "source_sentence": "即昇虛空，入火光定，身出煙焰，而入寂滅，餘骸墜下，起窣堵波。",
        "translation": "He ascended up into the sky and entered the concentration of firelight. As smoke and flames emerged from his body, he entered nirvana. The remaining skeletons fell to the ground and built a stupa.",
        "source": "T51n2087_003:0888a03_1"
    },
    {
        "source_sentence": "王城西北行二百餘里，至商林伽藍，布剌拏(唐言圓滿)論師於此作《釋毘婆沙論》。",
        "translation": "Going to the northwest from the royal city for more than two hundred li, he reached a monastery in the merchant’s forest. At this place the śāstra master Benares (known as Puṇḍayana in Chinese) composed the Abhidharma-vibhāṣā-śāstra.",
        "source": "T51n2087_003:0888a05_2"
    },
    {
        "source_sentence": "城西行百四五十里，大河北，接山南，至大眾部伽藍，僧徒百餘人。",
        "translation": "Going westward from the city for one hundred and forty or fifty li, he crossed the big river to the south of the mountain and reached the monastery of the Mahasamghika sect with more than a hundred monks.",
        "source": "T51n2087_003:0888a06_3"
    },
    {
        "source_sentence": "昔佛地羅論師於此作大眾部《集真論》。",
        "translation": "Formerly the śāstra master Buddhadeva composed the Satyasiddhi-śāstra of the Mahasamghika school at this monastery.",
        "source": "T51n2087_003:0888a08_4"
    },
    {
        "source_sentence": "從此西南，踰山涉險，行七百餘里，至半笯(奴故反)嗟國(北印度境)。",
        "translation": "From here going southwest for more than seven hundred li over mountains and wading through danger, I reached the country of Parvata (in the domain of northern India).",
        "source": "T51n2087_003:0888a09_5"
    },
    {
        "source_sentence": "半笯嗟國，周二千餘里。",
        "translation": "The country of Bimbisāra is more than two thousand li in circuit.",
        "source": "T51n2087_003:0888a11_0"
    },
    {
        "source_sentence": "山川多，疇壠狹，穀稼時播，花菓繁茂，多甘蔗，無蒲萄，菴沒羅菓、烏淡跋羅、茂遮等菓，",
        "translation": "The mountains and rivers are numerous and the cultivated fields are narrow and small. Crops are sown in season and there are plenty of flowers and fruit. There is plenty of sweet sugarcane but no grapes, such as grapes, grapes grown from undergrowth, grapes grown by planting roots, grapes grown on dry leaves, grapes grown with",
        "source": "T51n2087_003:0888a11_1"
    },
    {
        "source_sentence": "家植成林，珍其味也。",
        "translation": "His family planted trees in the forest and cherished its flavor.",
        "source": "T51n2087_003:0888a13_2"
    },
    {
        "source_sentence": "氣序溫暑，風俗勇烈。",
        "translation": "The climate is mild and hot and the people are bold and brave by custom.",
        "source": "T51n2087_003:0888a14_3"
    },
    {
        "source_sentence": "裳服所製，多衣[疊*毛]布。",
        "translation": "Most of the clothes are made of cotton cloth and woolen cloth.",
        "source": "T51n2087_003:0888a14_4"
    },
    {
        "source_sentence": "人性質直，淳信三寶。",
        "translation": "The people are honest and straightforward by nature and simply believe in the Triple Gem.",
        "source": "T51n2087_003:0888a15_5"
    },
    {
        "source_sentence": "伽藍五所，並多荒圮。",
        "translation": "There are five monasteries, many of which are in ruins.",
        "source": "T51n2087_003:0888a15_6"
    },
    {
        "source_sentence": "無大君長，役屬迦濕彌羅國。",
        "translation": "It has no sovereign ruler and is a dependency of Kaśmīra.",
        "source": "T51n2087_003:0888a16_7"
    },
    {
        "source_sentence": "城北伽藍少有僧徒。",
        "translation": "In the monastery to the north of the city there were a few monks.",
        "source": "T51n2087_003:0888a16_8"
    },
    {
        "source_sentence": "伽藍北有石窣堵波，寔多靈異。",
        "translation": "To the north of the monastery there is a stone stupa in which one can find traces of miraculous signs.",
        "source": "T51n2087_003:0888a17_9"
    },
    {
        "source_sentence": "從此東南行四百餘里，至曷邏闍補羅國(北印度境)。",
        "translation": "From here going southeast for more than four hundred li, I reached the country of Rājapura (in the domain of northern India).",
        "source": "T51n2087_003:0888a18_0"
    },
    {
        "source_sentence": "曷邏闍補羅國，周四千餘里。",
        "translation": "The country of Rājapura is more than four thousand li in circuit.",
        "source": "T51n2087_003:0888a20_0"
    },
    {
        "source_sentence": "國大都城周十餘里。",
        "translation": "The capital city of the kingdom is more than ten li in circuit.",
        "source": "T51n2087_003:0888a20_1"
    },
    {
        "source_sentence": "極險固，多山阜，川原隘狹，地利不豐。",
        "translation": "It is an extremely perilous and strong country with many hills and mounds. The plains are narrow and the soil productivity is not abundant.",
        "source": "T51n2087_003:0888a21_2"
    },
    {
        "source_sentence": "土宜氣序，同半笯嗟國。",
        "translation": "The native products and climate are the same as in the country of Bimbisāra.",
        "source": "T51n2087_003:0888a22_0"
    },
    {
        "source_sentence": "風俗猛烈，人性驍勇。",
        "translation": "The people are fierce and vigorous by custom and brave and valiant by nature.",
        "source": "T51n2087_003:0888a22_1"
    },
    {
        "source_sentence": "國無君長，役屬迦濕彌羅國。",
        "translation": "The kingdom has no ruler and is a dependency of Kaśmīra.",
        "source": "T51n2087_003:0888a23_2"
    },
    {
        "source_sentence": "伽藍十所，僧徒寡少。",
        "translation": "There are ten monasteries with a few monks.",
        "source": "T51n2087_003:0888a23_3"
    },
    {
        "source_sentence": "天祠一所，外道甚多。",
        "translation": "There is one deva temple with a great many heretics.",
        "source": "T51n2087_003:0888a24_4"
    },
    {
        "source_sentence": "自濫波國至於此土，形貌麁弊，情性猥暴，語言庸鄙，禮義輕薄，非印度之正境，",
        "translation": "From the country of Lampā up to this land they are coarse in appearance and violent by nature. Their language is vulgar and vulgar, with little custom or righteousness. They do not belong to the proper territory of India.",
        "source": "T51n2087_003:0888a24_5"
    },
    {
        "source_sentence": "乃邊裔之曲俗。",
        "translation": "It's a distorted custom of marginalized people.",
        "source": "T51n2087_003:0888a26_6"
    },
    {
        "source_sentence": "從此東南，下山，渡水，行七百餘里，至磔迦國(北印度境)。",
        "translation": "From here going southeast for more than seven hundred li, I came down from the mountain and crossed a river to reach the country of Kaṅka (in the domain of northern India).",
        "source": "T51n2087_003:0888a26_7"
    },
    {
        "source_sentence": "大唐西域記卷第三",
        "translation": "Great Tang Dynasty Record of the Western Regions, Volume 3",
        "source": "T51n2087_003:0888a29_0"
    }
]