[
    {
        "source_sentence": "佛說泥犁經",
        "translation": "Niraya Sutra as Spoken by the Buddha",
        "source": "T01n0086_001:0907a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東晉西域沙門竺曇無蘭譯",
        "translation": "Translated by Zhu Tanwulan, a monk from the Western regions of the Eastern Jin dynasty",
        "source": "T01n0086_001:0907a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T01n0086_001:0907a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘言：「凡有人有三事，愚癡不足人所平相。",
        "translation": "The Buddha told the monks, \"Every person has three things, and their foolishness isn't even close to being human.",
        "source": "T01n0086_001:0907a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為三事？",
        "translation": "What are the three things?",
        "source": "T01n0086_001:0907a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "癡人所念惡、所言惡、所行惡，今世即得其殃，用身苦、用念苦、用憂苦。",
        "translation": "When a foolish person thinks evil thoughts, speaks evil words, and acts evil deeds, he'll immediately suffer in this world, with physical suffering, thought suffering, and grief suffering.",
        "source": "T01n0086_001:0907a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為憂苦？",
        "translation": "What's the suffering of grief?",
        "source": "T01n0086_001:0907a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "癡人與智者相隨，智者道說癡人行惡死當入泥犁。",
        "translation": "When a foolish man is accompanied by a wise man, the wise man's teaching says that a foolish man who does evil will die and be put into the mire.",
        "source": "T01n0086_001:0907a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "癡人心念智者所言：『今我行惡，死當入泥犁。』",
        "translation": "The deluded man's mind thinks about what the wise man says, 'Now that I've done evil, I'll die and go into the mire.'",
        "source": "T01n0086_001:0907a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為憂苦。",
        "translation": "This is grief and suffering.",
        "source": "T01n0086_001:0907a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為念苦？",
        "translation": "What's the suffering of mindfulness?",
        "source": "T01n0086_001:0907a19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "癡人見取盜財，酷毒操械縛束、截手截足，竹鞞鞭[革*占]用餧虎，若著[葶-丁+呆]中以火然之，若以鈇質寸寸斬之若，以著地令象蹈之，若著釜上甑中烝之，若取四支生牽磔之。",
        "translation": "A foolish man sees stolen property, binds it with a harsh weapon, amputates its hands and feet, beats it with a bamboo scabbard [Ge*Zhan] to feed a tiger, puts it in a [scabbard-ding+dumb] and burns it, chops it with flaming metal inch by inch, puts it on the ground and makes an elephant run over it, puts it in a cauldron and pours it into a pot, or takes four limbs and pulls them off.",
        "source": "T01n0086_001:0907a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "癡人自念：『惡人所作無狀，至使長吏掠治如是。",
        "translation": "The foolish man thinks to himself, 'What a bad person does has no form, so he causes the governor to plunder and treat him like this.",
        "source": "T01n0086_001:0907a23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設令長吏知我為惡，亦當復取我如是。』",
        "translation": "Suppose the inspector knew I was evil, and he would also take me like this.'",
        "source": "T01n0086_001:0907a24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為念苦。",
        "translation": "This is the suffering of mindfulness.",
        "source": "T01n0086_001:0907a25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為身苦？",
        "translation": "What's physical suffering?",
        "source": "T01n0086_001:0907a25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "癡人晨夜臥起未曾安隱，心常念惡、口常言惡、身常行惡，是惡已後病時，便自見泥犁中火釜中人，見人燒時、見人煮時，所作過惡稍來嬈人，譬如日中後其影稍下。",
        "translation": "When a foolish man rises in the morning and night and has never been at ease, his mind is always mindful of evil, his speech is always evil, and his body is always acting evil, then when he's ill after this evil, he sees himself in a fiery cauldron in a mud plow, and when he sees someone burning or boiling, the evil he does slightly comes to haunt him, like when his shadow falls slightly after sunset.",
        "source": "T01n0086_001:0907a26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人稍入，泥犁中惡人即自念言：『我居世間，憙殺生、憙盜竊、憙犯他家婦女、憙欺人、憙兩舌、憙惡口、憙妄言、憙嫉妬、憙慳貪，不信有佛、不信有經、不信所作因緣有殃福、不信有後世生，令我死當入泥犁。』",
        "translation": "When that person enters for a moment, the evil person in the niraya then thinks to himself, 'I've lived in the world, jealously killing beings, jealously stealing, jealously transgressing the women of others, jealously deceiving people, jealous of duplicity, jealous of harsh words, jealous of false speech, jealous of jealousy, jealous of avarice, not believing in the Buddha, not believing in sūtras, not believing in the causes and conditions of actions that bring misfortune and fortune, and not believing in birth in a later life, which will cause me to die and go into the niraya.'",
        "source": "T01n0086_001:0907a29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為身苦。」",
        "translation": "This is physical suffering.\"",
        "source": "T01n0086_001:0907b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「設令惡人眼如我眼，見惡人所趣殃過考掠之處，惡人即怖，心憔破吐沸血而死。」",
        "translation": "The Buddha said, \"Suppose we were to let a bad person's eyes look like mine and see where a bad person goes to suffer more than robbery, and that person would become frightened, have their heart broken, spit boiling blood, and die.\"",
        "source": "T01n0086_001:0907b05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「欲知勤苦最不可忍者，獨有泥犁。",
        "translation": "The Buddha said, \"The only person who wants to know that the suffering of effort is the most unbearable is the niraya.",
        "source": "T01n0086_001:0907b07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泥犁者，極苦不可具言。」",
        "translation": "A niraya is an unspeakable extreme of suffering.\"",
        "source": "T01n0086_001:0907b08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘長跪言：「願聞泥犁勤苦譬喻。」",
        "translation": "The monks knelt down and said, \"May I hear an example of the pain and suffering of a mud plow.\"",
        "source": "T01n0086_001:0907b09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「譬如長吏捕得逆賊，將詣王前白言：『此人反逆念國家惡。』",
        "translation": "The Buddha said, \"It's like the sheriff who apprehends a rebel and goes to the king and says, 'This person is rebellious and mindful of the country's evils.'",
        "source": "T01n0086_001:0907b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王勅長吏以矛刺百瘡。",
        "translation": "The king orders the inspector to pierce a hundred sores with a spear.",
        "source": "T01n0086_001:0907b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明日問之：『此人何類？』",
        "translation": "On the morrow, he asked, 'What kind of person is this?'",
        "source": "T01n0086_001:0907b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白言：『尚生。』",
        "translation": "He said, 'It's still alive.'",
        "source": "T01n0086_001:0907b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『復刺百瘡。』",
        "translation": "The king said, 'Again, he'll prick a hundred sores.'",
        "source": "T01n0086_001:0907b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明日問之：『此人何類？』",
        "translation": "On the morrow, he asked, 'What kind of person is this?'",
        "source": "T01n0086_001:0907b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白言：『尚生。』",
        "translation": "He said, 'It's still growing.'",
        "source": "T01n0086_001:0907b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『復刺百瘡。』」",
        "translation": "The king said, 'He'll prick them again for a hundred sores.'\"",
        "source": "T01n0086_001:0907b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語諸比丘言：「如此人被三百瘡，寧有完處大如棗葉無？」",
        "translation": "The Buddha said to the monks, \"How could such a person with 300 sores have a place as large as a jujube leaf?\"",
        "source": "T01n0086_001:0907b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘言：「無有完處。」",
        "translation": "The monks said, \"There's no end to it.\"",
        "source": "T01n0086_001:0907b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語諸比丘：「此人被三百瘡，寧毒痛不？」",
        "translation": "The Buddha said to the monks, \"Would this person with 300 sores prefer to be in pain from poison?\"",
        "source": "T01n0086_001:0907b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘言：「人被一瘡，舉身皆痛，何況被三百瘡！」",
        "translation": "The monks said, \"When a person gets one sore, his whole body hurts, so why would he get 300 sores?\"",
        "source": "T01n0086_001:0907b16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛持小石著手中，示諸比丘：「是石大？",
        "translation": "Holding a small stone in his hand, the Buddha showed the monks, \"Is this a large stone?",
        "source": "T01n0086_001:0907b17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太山為大？」",
        "translation": "Is Taishan the Great?\"",
        "source": "T01n0086_001:0907b18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘言：「佛手中石小，奈何持比山？",
        "translation": "The monks said, \"How could a stone in the Buddha's hand be small enough to carry a bishan?",
        "source": "T01n0086_001:0907b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲持比山，億億萬倍尚復不如山大。」",
        "translation": "A mountain is a billion billion times bigger than a mountain when you want to hold it.\"",
        "source": "T01n0086_001:0907b19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「泥犁中痛，與矛瘡痛億億萬倍，尚不如泥犁痛，手中小石如三百矛瘡，山者如泥犁中痛。",
        "translation": "The Buddha said, \"The pain in a mud plow is a billion billion times greater than the pain of a spear wound, but it's still not as painful as a mud plow, and a small stone in your hand is like 300 spear wounds, while a mountain is like the pain in a mud plow.",
        "source": "T01n0086_001:0907b20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "癡人心念惡、口言惡、身行惡，死後墮泥犁中。",
        "translation": "A foolish person's thoughts are evil, his words are evil, and his actions are evil, and he falls into a mud plow after death.",
        "source": "T01n0086_001:0907b22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泥犁中有獸鬼，便牽人前，以鈎鈎其上齗，復以鈎鈎其頷，口皆挓開，以取消銅灌人口中，脣舌腸胃皆燋爛，銅便下過去，毒痛不可忍。",
        "translation": "An animal spirit takes that person, hooks his upper gums, then hooks his jaws, opens his mouth, and pours canceled copper into his mouth, scorching his lips, tongue, intestines, and stomach, and then the copper falls through, causing unbearable pain.",
        "source": "T01n0086_001:0907b23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人平生於世間時求財利、逆用飲食，故以消銅灌之，泥犁勤苦如是。",
        "translation": "That person's ordinary life in the world is spent seeking wealth and profit and eating and drinking against the grain, so they are filled with burnt copper.",
        "source": "T01n0086_001:0907b26_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泥犁中鬼取人，持鈎鈎其上下頷，皆挓開，取燒鐵杵刺人咽中，脣舌腸胃皆燋爛，毒痛不可忍，過惡未解故不死，泥犁勤苦如是。",
        "translation": "A demon in a niraya takes a person, hooks his upper and lower jaws, and opens them both; it takes a burning iron pounder and stabs him in the throat; it cauterizes his lips, tongue, intestines, and stomach; the pain is intolerable; and he doesn't die because his faults haven't been resolved.",
        "source": "T01n0086_001:0907b28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泥犁中鬼復取人上鐵山，以火燒山令正赤，上走下走，毒痛不可忍，過惡未解故不死，泥犁勤苦如是。",
        "translation": "A demon in a niraya then takes another person and puts them on a mountain of iron, burns it with fire, and makes it red; they walk up and down, and the pain is intolerable; they don't die because their faults haven't been resolved; the niraya suffers intensely as it does.",
        "source": "T01n0086_001:0907c02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泥犁中鬼復取人，以燒赤斧斬其手、斬其足、斬其百節，解解斷之，毒痛不可忍，過惡未解故不死，泥犁勤苦如是。",
        "translation": "A demon in a mud plow then takes another person, and it uses a red-hot ax to chop off their hand, cut off their foot, and cut off their hundred joints; it cuts them off with its resolve, causing unbearable pain and not dying because it hasn't yet understood past evils, and it's like this: a diligent pain in a mud plow.",
        "source": "T01n0086_001:0907c04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泥犁中鬼復取人，以鐵斤斲人身，舉身骨肉皆悉盡，毒痛不可忍，過惡未解故不死，泥犁勤苦如是。",
        "translation": "A demon in a mud plow also takes a person and carves them up with an iron weight, which destroys all of their bones and flesh.",
        "source": "T01n0086_001:0907c06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泥犁中有鳥，喙如鐵主，啄人頭噉人腦，毒痛不可忍，過惡未解故不死也，泥犁勤苦如是。",
        "translation": "A bird in a mud plow with a beak like an iron lord pecks a man's head and eats his brain, which causes intolerable pain and is not dead because it hasn't understood past evils, and the mud plow suffers intensely as it does.",
        "source": "T01n0086_001:0907c09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泥犁中復有群駱獸，共取人[列/手]食齘齧，毒痛不可忍，過惡未解故不死，泥犁勤苦如是。",
        "translation": "Also, in the mud and plow, there's a group of camelids that collectively feed on a person's [column/hand] and bite him/her, causing unbearable pain and suffering that's unbearable and prevents death because of past evils that haven't been resolved, and the mud and plow suffer intensely as such.",
        "source": "T01n0086_001:0907c11_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泥犁中鬼復取人，以刀剝之，從兩膀腸上至兩脅，持駕鐵車，持兩脅肉為被，令挽鐵車走行火上，毒痛不可忍，過惡未解故不死，泥犁勤苦如是。",
        "translation": "A demon in a niraya also takes a person, strips him with a knife, takes him from his bladder and intestines up to his two thighs, carries him on an iron cart, takes the flesh of his two thighs as a blanket, and makes him walk on the iron cart over a fire with unbearable pain and pain, and he doesn't die because his faults and evils haven't been resolved; the niraya suffers intensely as it does.",
        "source": "T01n0086_001:0907c13_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泥犁中鬼復取人兩脚，倒擲釜中湯沸踊躍，在底亦熟在上亦熟，沸更上下無有不熟。",
        "translation": "A demon in a niraya then takes a person's feet and throws them into a cauldron where the water boils and rises up, ripening both at the bottom and at the top, and there's nothing above or below the boil that isn't ripe.",
        "source": "T01n0086_001:0907c16_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如煮豆上下皆熟，覆亦熟露亦熟，泥犁中人所在皆熟，無有東西上下；其人平生在世間時，自放恣心恣口恣身所致，泥犁勤苦如是。",
        "translation": "Like boiled beans that are ripe above and below, and covered and exposed beans that are ripe, a person in a mud plow is ripe everywhere, with nothing going up or down; during his ordinary life in the world, that person's wantonness of mind and speech and body caused him to work hard and suffer like a mud plow.",
        "source": "T01n0086_001:0907c18_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泥犁中鬼復取人，臥著赤地五毒治之，以燒釘釘其左掌，復燒釘釘其右掌，復以燒釘釘其右足，復以燒釘釘其左足，復以燒釘釘其心，下徹地，毒痛不可忍，過惡未解故不死，泥犁勤苦如是。",
        "translation": "A demon in a mud plow then takes a person and treats them by lying on the bare ground with five poisons, nailing their left palm with a burning nail, nailing their right palm with another burning nail, nailing their right foot with another burning nail, nailing their left foot with another burning nail, and nailing their heart with another burning nail, which causes unbearable pain and penetration to the ground.",
        "source": "T01n0086_001:0907c21_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「泥犁中鬼牽人臂入泥犁城中，泥犁城正四方，四面有門，城四面皆堅，門皆有守鬼。",
        "translation": "\"A demon in Niraya takes a man by the arm and enters the city of Niraya, which is square and squared, has gates on all sides, is strong on all sides, and has a ghost guarding the gates.",
        "source": "T01n0086_001:0907c25_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其城壁地皆鐵，城用鐵覆蓋之，不得令有過泄，地皆燒正赤，周匝四千里，東壁火焰至西壁，西壁火焰至東壁，南壁火焰至北壁，北壁火焰至南壁，上火焰下至地，地火焰至上。",
        "translation": "Its walls and ground are iron, and the city is covered with iron so that nothing is allowed to escape; the ground is burned red and has a circumference of 4,000 miles, with a flame from the east wall reaching the west wall, a flame from the west wall reaching the east wall, a flame from the south wall reaching the north wall, a flame from the north wall reaching the south wall, a flame from above descending to the ground, and a flame from the ground rising to the top.",
        "source": "T01n0086_001:0907c27_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸惡人有犯此十事者皆墮是中，殺生者、盜竊者、犯他家婦女者、欺人者、兩舌者、惡口者、妄言者、嫉妬者、慳貪者，不信有佛、不信有經、不信所作因有殃福。",
        "translation": "All bad people who violate these ten rules fall into them, including those who kill, steal, commit crimes against the women of others, deceive others, double-talk, speak harshly, speak falsehoods, are jealous, are stingy, and don't believe in the Buddha, don't believe in the sūtras, and don't believe that the causes of their actions are beneficial.",
        "source": "T01n0086_001:0908a02_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是曹人滿泥犁中。",
        "translation": "Thus, one of these people fills a mud plow.",
        "source": "T01n0086_001:0908a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泥犁中毒痛極數千萬歲，乃遙見東方門開，皆走往。",
        "translation": "After tens of millions of years of suffering from the pain of the mud and plows, they see the eastern gate open from a distance, and they all walk toward it.",
        "source": "T01n0086_001:0908a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人足著地者即焦，舉足肉復生如故，當有得脫者便過出去，未當脫者門復閉。",
        "translation": "When a person's feet touch the ground, they're charred, but when they lift their feet, their flesh grows back as before.",
        "source": "T01n0086_001:0908a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人見有得脫出者，如反不得出，便極視躃地。",
        "translation": "When that person sees someone who can get out, if they can't get out, they fall to the ground with their eyes peeled.",
        "source": "T01n0086_001:0908a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "守門鬼言：『咄死惡人，汝來於門下，何等求？』",
        "translation": "The demon guarding the gate says, 'Duh, you're a deadly evil person, what are you seeking under the gate?'",
        "source": "T01n0086_001:0908a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言：『我飢渴。』",
        "translation": "He said, 'I'm hungry and thirsty.'",
        "source": "T01n0086_001:0908a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬼便取鈎，鈎其上下頷，口皆挓開，便以消銅灌人口中，脣舌腸胃皆燋爛，銅便過下去。",
        "translation": "The demon then takes a hook, hooks his upper and lower jaws, opens his mouth, and pours unrefined copper into his mouth, scorching his lips, tongue, intestines, and stomach, and then passes the copper down.",
        "source": "T01n0086_001:0908a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人平生在世間時，求財利不用道理，所犯惡逆故受是殃，泥犁勤苦如是。",
        "translation": "When that person was alive in the world, they sought wealth and profit without using reason, and they were subject to this misfortune because of the bad transgressions they committed, such is the suffering of a mire.",
        "source": "T01n0086_001:0908a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有泥犁，如世間鑪炭正赤，縱廣數千里，人皆走出城，趣入炭火泥犁中，燒炙燋熟不得休息，毒痛不可忍，過惡未解故不死，泥犁中勤苦如是。",
        "translation": "\"Furthermore, there's a mud plow like the world in which the coals are red and thousands of miles wide, and people walk out of the city and enter a burning mud plow that burns, scorches, and cooks without rest, with intolerable pain and pain that's unbearable, and they don't die because their faults haven't been remedied, so they suffer hard in the mud plow.",
        "source": "T01n0086_001:0908a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「次復入寒冰泥犁中，縱廣數千里。",
        "translation": "\"Next, they enter a cold, icy mud plow that stretches thousands of miles across.",
        "source": "T01n0086_001:0908a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人入其中，皆寒凍戰慄、破碎摧裂，毒痛不可忍，過惡未解故不死，泥犁勤苦如是。",
        "translation": "When people enter it, they are frozen and frightened, broken and torn apart, and the pain is intolerable; they don't die because their faults and evils haven't been resolved, and the mud and plows are painful and arduous.",
        "source": "T01n0086_001:0908a19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次入沸屎泥犁中，周匝數千里，屎即熱沸有氣，走趣行之。",
        "translation": "\"Furthermore, they enter a mud plow that boils excrement and extends for thousands of miles, and the excrement boils hot and full of gas, which sends them on a wild goose chase.",
        "source": "T01n0086_001:0908a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人入其中，便於其中自熟，毒痛不可忍，過惡未解故不得死，泥犁勤苦如是。",
        "translation": "When a person enters it, it will ripen on its own, causing intolerable pain and not being able to die because it's full of bad habits that haven't been resolved, and the mire is painful and arduous.",
        "source": "T01n0086_001:0908a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次入膿血泥犁中，周匝數千里，臭惡不可言，膿血皆沸。",
        "translation": "\"Furthermore, they enter a mud plow with pus and blood that circles for thousands of miles, has a terrible stench that defies description, and the pus and blood boil over.",
        "source": "T01n0086_001:0908a24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入墮其中，皆自熟爛形體壞敗，為烏鳥所食，毒痛不可忍，過惡未解故不得死，泥犁勤苦如是。",
        "translation": "Those who enter and fall into it will all rot themselves, their bodies will deteriorate, they'll be eaten by crows and birds, and the pain will be unbearable; they won't be able to die because their faults haven't been resolved, and they'll suffer diligently as a mire.",
        "source": "T01n0086_001:0908a25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「次復入剃頭刀山，周匝數千里，人從膿死泥犁走，欲上山，山上有刀皆割其足；適欲據，割其手；適欲前，割其腹；適欲偃，割其背；適欲踞，割其臗；適欲傾，割其脇；毒痛不可忍，過惡未解故不死，泥犁勤苦如是。",
        "translation": "\"Furthermore, they enter a mountain of razor blades that circles for thousands of miles, and when a person walks along a mud plow of pus and death and wants to go up the mountain, there are swords on the mountain that cut their feet; when they want to stand, they cut their hands; when they want to go, they cut their belly; when they want to lie down, they cut their back; when they want to stand, they cut their hips; when they want to lean over, they cut their backs; the pain is intolerable, and they don't die because their past evils haven't been unresolved, so the mud plow suffers diligently.",
        "source": "T01n0086_001:0908a27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「次復入劒樹，樹枝皆如劒。",
        "translation": "\"Next, I'll enter a tree whose branches all look like gods.",
        "source": "T01n0086_001:0908b03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人入其中，劒刺人胸、刺人脇、刺人背、刺人手、刺人足、刺人身，前後皆徹，毒痛不可忍，過惡未解故不死，泥犁勤苦如是。",
        "translation": "When a person enters it, a kalm will pierce their chest, backside, hands, feet, and person, cutting them both forward and backward, causing intolerable pain and not dying from past evils that haven't been resolved, and suffering the hardships of the mire as it were.",
        "source": "T01n0086_001:0908b03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「次復入鐵竹蘆，縱廣數千里，樹葉皆如利刀。",
        "translation": "\"Next, he enters an iron bamboo reed, which is thousands of miles wide and whose leaves are like sharp knives.",
        "source": "T01n0086_001:0908b06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人入其中者，風至吹竹令震動，葉皆貫人肌、截人骨，形體無完處，苦痛不可忍，過惡未解故不死，泥犁勤苦如是。",
        "translation": "When a person enters it, the wind blows the bamboo and causes it to shake, and the leaves pierce through a person's muscles and cut through their bones; their bodies are incomplete, and the pain is unbearable; they don't die because their faults and evils haven't been resolved; and they suffer pain and hardship like the mud plow.",
        "source": "T01n0086_001:0908b07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「次復有入鹹水泥犁，縱廣數千里水，鹹水如鹽熱沸踊躍，水中有鳥，喙如鐵主，啄人肌、齩人骨，人不能忍是痛、便渡水去。",
        "translation": "\"Furthermore, there's a plow that enters salty water that's thousands of miles wide and boils like salt, and there's a bird in the water with a beak like an iron lord that pecks at a person's muscles and cuts their bones.",
        "source": "T01n0086_001:0908b09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "守泥犁鬼言：『死惡人，汝何等求索？』",
        "translation": "The demon guarding the niraya says, 'Dead evil person, what are you seeking?'",
        "source": "T01n0086_001:0908b12_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人言：『我苦飢渴。』",
        "translation": "The person says, 'I'm suffering from hunger and thirst.'",
        "source": "T01n0086_001:0908b13_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬼即以鈎，鈎其上下齗，口皆挓開，復以消銅灌人口中，脣亦燋、舌亦燋、咽亦燋，腹中五藏皆燋盡，銅便下過去，其人不能復忍，復還入沸鹹水中。",
        "translation": "The demon then hooks his upper and lower gums, opens his mouth, and pours calming copper into his mouth, scorching his lips, scorching his tongue, scorching his throat, and scorching all five stores in his belly.",
        "source": "T01n0086_001:0908b13_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦痛如前不能復忍，復還入鐵竹蘆中，苦痛如前不能復忍，復還入劒樹間，苦痛如前不能復忍，還入剃頭刀山，苦痛如前不能復忍，還入膿血泥犁，苦痛如前不能復忍，復還入沸屎泥犁，苦痛如前不能復忍，復還入炭火泥犁，苦痛如前不能復忍，復還入鐵城泥犁，苦痛不可忍。",
        "translation": "Not being able to tolerate the painful pain as before, he then falls back into a metal bamboo reed, not being able to tolerate the painful pain as before, he then falls back into a tree, not being able to tolerate the painful pain as before, he then falls back into a mountain of shaving heads and swords, not being able to tolerate the painful pain as before, he then falls back into a mire of pus and blood, not being able to tolerate the painful pain as before, he then falls back into a mire of boiling feces, not being able to tolerate the painful pain as before, he then falls back into a mire of charcoal fire, not being able to tolerate the painful pain as before, he then falls back into a mire of iron cities, and the painful pain is unbearable.",
        "source": "T01n0086_001:0908b16_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東門苦亦如是，南門苦亦如是，西門苦亦如是，北門苦亦如是。",
        "translation": "The pain at the east gate is likewise, the pain at the south gate is likewise, the pain at the west gate is likewise, and the pain at the north gate is likewise.",
        "source": "T01n0086_001:0908b23_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泥犁勤苦如是。」",
        "translation": "So is the pain of diligence in the mud and plow.\"",
        "source": "T01n0086_001:0908b24_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「泥犁苦不可勝數，我略麁粗為汝說耳。」",
        "translation": "The Buddha told the monks, \"The pain of the mud and plows is incalculable, so I'll explain it to you in a brief, crude way.\"",
        "source": "T01n0086_001:0908b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「人作惡，在畜生中，以芻草為食，舌撈齒嗺。",
        "translation": "The Buddha said, \"When a person does evil, he feeds on regurgitated grass in an animal life, and his tongue is stained and his teeth are wet.",
        "source": "T01n0086_001:0908b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為舌撈齒嗺者？",
        "translation": "What's a person who has a tongue that picks at their teeth and wets them?",
        "source": "T01n0086_001:0908b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牛馬騾驢、象驝駝之屬，如是眾多。",
        "translation": "They are cattle, horses, mules, asses, elephants, camels, and so on and so forth.",
        "source": "T01n0086_001:0908b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人平生居世間時，心念惡、口言惡、身行惡，死後展轉來作是畜生，勤苦如是。」",
        "translation": "When they lived in the world during their ordinary lives, their thoughts were evil, their words were evil, and their deeds were evil, and after death they reborn as an animal, suffering hard like this.\"",
        "source": "T01n0086_001:0908b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有禽獸，生於冥處、長於冥處、死於冥處。",
        "translation": "The Buddha said, \"There are animals that are born in a dark place, grow up in a dark place, and die in a dark place.",
        "source": "T01n0086_001:0908c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為生於冥處者？",
        "translation": "What's a creature that's born in a dark place?",
        "source": "T01n0086_001:0908c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蛇鼠狸獺虫蟻，如是之屬眾多。",
        "translation": "Snakes, rats, civets, otters, insects, and ants, and so forth are numerous.",
        "source": "T01n0086_001:0908c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人平生居世間時，心念惡、口言惡、身行惡，死後展轉化來，作是禽獸，勤苦如是。」",
        "translation": "When they lived in the world during their ordinary lives, their thoughts were evil, their words were evil, and their deeds were evil, and after death they were reborn as these animals and worked hard like this.\"",
        "source": "T01n0086_001:0908c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有鱗虫，生於水中、長於水中、死於水中。",
        "translation": "The Buddha said, \"There are scaly worms that are born in water, grow up in water, and die in water.",
        "source": "T01n0086_001:0908c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為生於水中者？",
        "translation": "What's a scaly bug that's born in water?",
        "source": "T01n0086_001:0908c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蛟龍魚鼈黿鼉之屬，如是眾多。",
        "translation": "There are such a variety of scorpions, dragons, fish, and turtle shells.",
        "source": "T01n0086_001:0908c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人平生在世間時，心念惡、口言惡、身行惡，死後以展轉化來作是鱗虫，勤苦如是。」",
        "translation": "When they were born in the world, their thoughts were evil, their words were evil, and their deeds were evil, and after death they transformed into these scaly insects and worked hard like this.\"",
        "source": "T01n0086_001:0908c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有虫豸，生於臭中、死於臭中、長於臭中。",
        "translation": "The Buddha said, \"There are insects and worms that are born in a bad odor, die in a bad odor, and grow in a bad odor.",
        "source": "T01n0086_001:0908c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為生於臭中？",
        "translation": "What's born in a bad odor?",
        "source": "T01n0086_001:0908c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濕地虫、溝邊虫、溷中虫，如是之屬眾多。",
        "translation": "Wetland worms, worms by the gutter, worms in the privy, and so forth are numerous.",
        "source": "T01n0086_001:0908c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人平生在世間時，心念惡、口言惡、身行惡，死後以來作是虫豸，勤苦如是。」",
        "translation": "When they were alive in the world, their thoughts were evil, their words were evil, and their deeds were evil, and after death they became these insects and worms and worked hard like this.\"",
        "source": "T01n0086_001:0908c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有虫畜主食不淨，人更衣，遙聞其臭，走行趣之，言我得食。",
        "translation": "The Buddha said, \"Suppose there's an insectivorous animal whose main food is impure and a person changes their clothes, smells its odor from a distance, walks toward it, and says, 'I've gotten to eat it.'",
        "source": "T01n0086_001:0908c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為主食不淨者？",
        "translation": "What's the main thing that feeds on the impure?",
        "source": "T01n0086_001:0908c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "犬猪蠅蜣蜋，臭穢之屬如是眾多。",
        "translation": "Dogs, pigs, flies, dung beetles, and other smelly creatures are just as numerous as these.",
        "source": "T01n0086_001:0908c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人平生於世間時，心念惡、口言惡、身行惡，死後展轉以來作是虫畜，勤苦如是。」",
        "translation": "When they were born in the world, their thoughts were evil, their words were evil, and their deeds were evil, and after death they continued to behave like these insects and dung beasts, suffering like this.\"",
        "source": "T01n0086_001:0908c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「虫畜眾多，我麁粗為汝說耳。」",
        "translation": "The Buddha addressed the monks, \"There are so many animals that are worms, and I'll be crude and crude and explain them for you.\"",
        "source": "T01n0086_001:0908c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「人作惡，在薜荔中者，常食沸屎尿。",
        "translation": "The Buddha said, \"When a person does evil, he'll always eat boiling feces and urine while he's in Ficus.",
        "source": "T01n0086_001:0908c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以常食沸屎尿者何？",
        "translation": "Why is it that they always eat boiling feces and urine?",
        "source": "T01n0086_001:0908c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人平生在世間時，心念惡、口言惡、身行惡，慳貪惜飲食，故在薜荔中。",
        "translation": "During his ordinary life in the world, that person's thoughts were evil, his words were evil, his actions were evil, and he was stingy and greedy with food and drink, so he was among the Ficus.",
        "source": "T01n0086_001:0908c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又薜荔以膿血為食，其人平生在世間時，作惡嗜美故，今食膿血。",
        "translation": "Also, Ficus feeds on pus and blood, and when he was in the world during his ordinary life, he did evil and liked beauty, so now he eats pus and blood.",
        "source": "T01n0086_001:0908c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "薜荔中有黑狗白狗，主食薜荔肌肉。",
        "translation": "In Ficus, there's a black dog and a white dog that feed mainly on Ficus' muscles.",
        "source": "T01n0086_001:0908c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "薜荔中有烏，主食其腦。",
        "translation": "There's a crow in Ficus that feeds mainly on its brain.",
        "source": "T01n0086_001:0908c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有十歲未曾見水者，或時百歲未曾得水者，或遙見流水正清，欲行趣飲食，水空竭；或時有水化作消銅；或鹹水沸如湯；適欲前飲鬼便捶之。",
        "translation": "Sometimes there's a person who hasn't seen water in ten years, or a person who hasn't had access to water in a hundred years, or a person who sees distantly that the water is flowing perfectly clear and wants to go out to eat and drink, but the water is empty; sometimes there's water that turns into burnt copper, or salt water that boils like hot water; a demon pounds them if they want to drink it.",
        "source": "T01n0086_001:0908c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在薜荔中勤苦如是。」",
        "translation": "Such is the suffering and hardship of being in the midst of the Ficus.\"",
        "source": "T01n0086_001:0909a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「薜荔眾多，我粗為汝說耳。」",
        "translation": "The Buddha said, \"There are so many Ficus, I'll roughly explain it for you.\"",
        "source": "T01n0086_001:0909a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「人在三惡道難得脫，譬如周匝八萬四千里水，中有一盲龜，水上有一浮木有一孔，龜從水中百歲一跳出頭，寧能值木孔中不？」",
        "translation": "The Buddha said, \"It's difficult for a person to escape from the three bad destinies. It's like a blind turtle in 84,000 miles of water with a floating log on the water that has a hole in it; once the turtle jumps out of the water a hundred years later, how could it fit through the hole in the log?\"",
        "source": "T01n0086_001:0909a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘言：「百千萬歲尚恐不入也。",
        "translation": "The monks said, \"A hundred million years would still keep them from entering.",
        "source": "T01n0086_001:0909a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T01n0086_001:0909a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有時木在東、龜在西，有時木在西、龜出東，有時木在南、龜出北，有時木在北、龜出南，有時龜適出頭，木為風所吹在陸地。」",
        "translation": "There are times when wood is in the east and a tortoise is in the west, times when wood is in the west and a tortoise is out of the east, times when wood is in the south and a tortoise is out of the north, times when wood is in the north and a tortoise is out of the south, and times when a tortoise is fit to emerge from its head and wood is blown by the wind on dry land.\"",
        "source": "T01n0086_001:0909a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「龜百歲一出頭，尚有入孔中時；人在三惡道處，難得作人，過於是龜。",
        "translation": "\"Once a hundred years old, a tortoise emerges from its head, but there's still a time when it enters a hole; it's harder for a person to be a human being in the place of the three evil destinies than it is for a tortoise.",
        "source": "T01n0086_001:0909a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T01n0086_001:0909a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三惡處人，皆無所知識亦無法令，亦不知善惡，亦不知父母，亦不知布施，更相噉食強行食弱。",
        "translation": "People in the three evil states have no knowledge, no consciousness, no laws, no knowledge of good and evil, no knowledge of parents, and no knowledge of almsgiving, and they devour each other's food and act on the weak.",
        "source": "T01n0086_001:0909a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此曹人，身未曾離於屠剝膿血瘡，從苦入苦、從冥入冥，惡人所更如是。」",
        "translation": "Such a person has never been free from being butchered, stripped of pus, blood, and sores, going from suffering into suffering and from darkness into darkness, and it's even more so in the case of evil people.\"",
        "source": "T01n0086_001:0909a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「譬如人有揜者初亡甚多，至亡妻子田宅，羸跣無所復有，尚復負餘。",
        "translation": "The Buddha said, \"Suppose a person is covered up and initially loses a lot of people, then they lose their wives and homes, become exhausted and bare, and don't have anything left, but they still have a surplus.",
        "source": "T01n0086_001:0909a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "財主大促責，以煙熏之、以火炙之。」",
        "translation": "The owner of the property is greatly rebuked, smoked, and burned by fire.\"",
        "source": "T01n0086_001:0909a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「如是揜者，所亡尚為薄少，初亡甚多至亡妻子田宅，復負揜餘錢，為人所熏炙，如是為一世貧，數之無幾殘歲。",
        "translation": "The Buddha said, \"Such a cover-up is still a small loss, but when it's a large loss in the beginning and it reaches the loss of his wife's home and land, he carries a surplus of money and is smoked and burned by people.",
        "source": "T01n0086_001:0909a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人心念惡、口言惡、身行惡，死後在三惡道中，過於是貧。",
        "translation": "When a person's mind is filled with evil thoughts, their words are evil, and their actions are evil, they'll be poorer than that in the three evil destinies after death.",
        "source": "T01n0086_001:0909a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在三惡道中無央數，正使從三惡道中得解脫，復於人中生，當於工匠，若野處貧乞匃家作子，若以手技自給，不能自飽滿好衣。",
        "translation": "There are countless times when he's in one of the three evil destinies, and just when he's liberated from them, he'll be born among humans again, and he'll be a craftsman or a beggar in a poor wilderness or a son in a poor family, or he'll be unable to fill himself with good clothing if he provides for himself with manual skills.",
        "source": "T01n0086_001:0909a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖在是中作子，或時跛蹇聾盲不屬逮人。",
        "translation": "Even though he may be a son among these people, sometimes he's lame, handicapped, deaf, and blind, and he doesn't belong to anyone who catches him.",
        "source": "T01n0086_001:0909a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若生於屠殺家，或生於賣牛羊屠魚獦雞狗，從惡道出，為是曹家作子，復作惡，死後當復還入惡道中。」",
        "translation": "If someone is born into a butcher's family or into a family that sells cattle, sheep, butchers fish, throws up fowls and dogs, they'll emerge from a bad path, become a son of one of these families, and then do evil, and after death they'll go back into a bad path.\"",
        "source": "T01n0086_001:0909a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T01n0086_001:0909b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛戒諸比丘言：「我以天眼視天下人，生死好醜、尊者卑者，人死得好道、得惡道者。",
        "translation": "The Buddha disciplined the monks, saying, \"With the divine eye, I examine people everywhere, whether they're born and die good or ugly, honored or inferior, and whether they attain a good path or a bad path at death.",
        "source": "T01n0086_001:0909b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人於世間，身所行惡、口所言惡、心所念惡，常好烹殺祠祀鬼神者，死當入泥犁中。",
        "translation": "In the world, a person who does evil deeds, speaks evil words, and thinks evil thoughts, and who always likes to cook and kill shrines and spirits, will go to the mire when he dies.",
        "source": "T01n0086_001:0909b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身常行善、口常言善、心常念善，死即生天上。」",
        "translation": "Someone who always does good deeds with their body, speaks good words with their mouth, and is mindful of goodness with their mind will be born up in heaven when they die.\"",
        "source": "T01n0086_001:0909b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「人如天雨水中泡起，雨從上滴之，一泡壞一泡成。",
        "translation": "The Buddha said, \"A person is like a bubble that rises from the rain in the sky and drops from above, and one bubble breaks and another bubble is formed.",
        "source": "T01n0086_001:0909b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人生世間，生者死者如泡起頃，佛持天眼視一天下人，有天上者、有入泥犁者，貧者富者、尊者卑者，人所為善惡。」",
        "translation": "When people are born in the world, the living and the dead are like bubbles rising up, and the Buddha holds the divine eye to look at people everywhere, whether they're in heaven or in the mire, poor or rich, noble or base, and what people do that's good or bad.\"",
        "source": "T01n0086_001:0909b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「我皆知之。",
        "translation": "The Buddha said, \"I know them all.",
        "source": "T01n0086_001:0909b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬若冥夜，於城門兩邊各然大炬火，人有出者、有入者數千萬人，人從冥中皆見火中出入者。",
        "translation": "It's like when a great torch fire is lit on each side of a city gate on an underworld night, and there are tens of millions of people leaving and entering, and people from the underworld all see those who enter and leave in the fire.",
        "source": "T01n0086_001:0909b11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛持天眼視上天者、入泥犁者，如人從冥中視火中出入者，如人上高樓，樓下有數千萬家，人從上望皆見諸家。」",
        "translation": "The Buddha holds the divine eye to see those who go up to heaven and those who enter the niraya, just as a person in the darkness sees those who enter and leave in the fire, like a person ascending a high building with tens of millions of homes below it, and they all see the homes when they look up.\"",
        "source": "T01n0086_001:0909b13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「我見天下人，死上天者、入泥犁者，如人從高樓上視諸家。」",
        "translation": "The Buddha said, \"I've seen people everywhere who die and go up to heaven or enter the mire, like a person looking up from a high building at their homes.\"",
        "source": "T01n0086_001:0909b16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「如人乘船行清水中，皆見水中魚石所有。",
        "translation": "The Buddha said, \"They're like a person riding in a boat in clear water who sees all the fish and rocks in the water.",
        "source": "T01n0086_001:0909b17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛持天眼視天下人，生天上者、入泥犁者，如人視清水中。",
        "translation": "The Buddha holds the divine eye and looks at people everywhere, those who are born in heaven, and those who enter the mire, just as a person looks into clear water.",
        "source": "T01n0086_001:0909b18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天下有明月珠，持五綵縷貫之，人視珠皆見五綵別，知縷知珠相貫穿。",
        "translation": "There are five strands of thread running through a bright-moon pearl under the heavens, and when a person looks at the pearl, they see five separate strands of thread and know that the pearl runs through them.",
        "source": "T01n0086_001:0909b20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛見天下所從來生死善惡變化，如人見珠。」",
        "translation": "The Buddha sees all the world's past birth-and-death good and bad transformations, just as a person sees a pearl.\"",
        "source": "T01n0086_001:0909b21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「我見天下人不孝父母，不承事沙門婆羅門，不敬長老，不畏事，不畏今世後世，不驚不恐者，如是曹人死即入泥犁。",
        "translation": "The Buddha said, \"When I see people under heaven who aren't dutiful to their parents, don't serve ascetics and priests, don't honor elders, aren't fearful of tasks, aren't fearful of the present or future life, and aren't frightened or terrified, such a person will fall into the mire when he dies.",
        "source": "T01n0086_001:0909b22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與鹽王相見，即去惡就善。",
        "translation": "When he meets the Yama king, he'll abandon evil and cultivate goodness.",
        "source": "T01n0086_001:0909b25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "主泥犁卒名曰旁，旁即將人道至鹽王所，泥犁旁白言：『此人於世間時，為人不孝父母，不承事沙門婆羅門，不敬長老，不喜布施，不畏今世後世，不畏禁戒，願王處是人過罪。』",
        "translation": "The mirekeeper's name was Pun, and Pun then led him away to the Yama King, where Pun said, 'When he was in the world, this man was unfilial to his parents, didn't serve ascetics and priests, didn't honor elders, didn't like giving, wasn't afraid of the present or future generations, and wasn't afraid of the precepts, so may the king punish him for his faults.'",
        "source": "T01n0086_001:0909b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即呼人前，對之言：『若為人時於世間，不念父母養育，若推燥居濕乳哺長大，若何以不孝父母？』",
        "translation": "The king then summoned the person and told him, 'If a person goes through the world without thinking about the upbringing of their parents, or if they push dried-up people to live in a wet house and nurse them, how could they be ungrateful to their parents?'",
        "source": "T01n0086_001:0909b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人即對言：『我實愚癡憍慢。』",
        "translation": "That man then said to him, 'I'm really foolish and arrogant.'",
        "source": "T01n0086_001:0909c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『處若罪過者，非若父母，非天非帝王，非沙門婆羅門過。",
        "translation": "The king said, 'Whatever sins and faults exist, they aren't the faults of a father or mother, a god or godless king, or an ascetic or a brāhmaṇa.",
        "source": "T01n0086_001:0909c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若身所作，當自得之。』",
        "translation": "If you do it yourself, you'll get it.'",
        "source": "T01n0086_001:0909c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為鹽王第一問。",
        "translation": "This was the first question the salt king asked.",
        "source": "T01n0086_001:0909c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『若不見世間人病困劇時，羸劣甚極手足不仁？』",
        "translation": "\"'Don't you see people in the world who are very ill and very weak and whose hands and feet are unkind when they're in severe distress?'",
        "source": "T01n0086_001:0909c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人言：『我實見之。』",
        "translation": "The man said, 'I've really seen it.'",
        "source": "T01n0086_001:0909c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『若何以不自改為善耶？』",
        "translation": "The king said, 'How could it not be that it changed itself into something good?'",
        "source": "T01n0086_001:0909c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人言：『我實愚癡憍慢。』",
        "translation": "The person says, 'I'm really foolish and arrogant.'",
        "source": "T01n0086_001:0909c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『若身所作，當自得之。",
        "translation": "The king says, 'If I do something in my body, I'll get it myself.",
        "source": "T01n0086_001:0909c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是亦非父母，非天非帝王，非沙門婆羅門過。",
        "translation": "This is also not the fault of parents, gods, godless kings, or ascetics and priests.",
        "source": "T01n0086_001:0909c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若身所作，當自得之。』",
        "translation": "If it's something you do, you'll get it yourself.'",
        "source": "T01n0086_001:0909c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為鹽王第二問。",
        "translation": "This was the second question that King Yama asked.",
        "source": "T01n0086_001:0909c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『若不見世間男女老時，眼無所見，耳無所聞，持杖而行，黑髮更白不如少年時？』",
        "translation": "\"'Do you not see men and women in the world who, when they're old, see nothing with their eyes, hear nothing with their ears, walk with a staff, and have black hair that's whiter than when they're young?'",
        "source": "T01n0086_001:0909c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人對曰：『我實見老人持杖而行。』",
        "translation": "The man replied, 'I really saw the old man walking with the staff.'",
        "source": "T01n0086_001:0909c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『當是時若何以不自改為善耶？』",
        "translation": "'At that point, why wouldn't he change it into something good?'",
        "source": "T01n0086_001:0909c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人言：『我實愚癡憍慢。』",
        "translation": "That man said, 'I'm really foolish and arrogant.'",
        "source": "T01n0086_001:0909c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『是亦非若父母，非天非帝王，非沙門婆羅門過。",
        "translation": "The king said, 'Neither is this the fault of my father and mother, nor of gods and godless kings, nor of ascetics and priests.",
        "source": "T01n0086_001:0909c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若身所作，當自得之。』",
        "translation": "If you do it yourself, you'll get it yourself.'",
        "source": "T01n0086_001:0909c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為鹽王第三問。",
        "translation": "This was the third question that King Yama asked.",
        "source": "T01n0086_001:0909c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『若於世間時，不見男子女人死，一日至二日至七日，身體腐爛形體壞敗，為虫蟻所食，為眾人所惡？",
        "translation": "\"'Is there a time in the world when you don't see a man or woman die, and from one day to two days to seven days later their body rots and their form decays, is eaten by insects and ants, and is abhorred by people?'",
        "source": "T01n0086_001:0909c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見是，何以不自改為善耶？』",
        "translation": "If you see this, why wouldn't you change it into something good?'",
        "source": "T01n0086_001:0909c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人言：『我實見之，愚癡憍慢。』",
        "translation": "That person says, 'I really see it, and I'm foolish and arrogant.'",
        "source": "T01n0086_001:0909c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『若施行，何以不端若行、端若口、端若心？",
        "translation": "' If he did, why wouldn't he properly conduct himself, properly speak, and properly control his mind?",
        "source": "T01n0086_001:0909c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是亦非父母，非天非帝王，非沙門婆羅門過。",
        "translation": "'This is also not the fault of a father or mother, a god or godless king, or an ascetic or a brāhmaṇa.",
        "source": "T01n0086_001:0909c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若身所作，當自得之。』",
        "translation": "If it's something he does, he'll get it himself.'",
        "source": "T01n0086_001:0909c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為鹽王第四問。",
        "translation": "This is the fourth question that Yama asked.",
        "source": "T01n0086_001:0909c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『若為人時於世間，寧見長吏捕得劫人殺人賊，即反縛送獄掠治考問，或有將出於道中挌殺，或生牽磔者，若寧見是不？』",
        "translation": "\"'If a person goes out into the world and sees a robber and killer apprehended by a superior officer, then he's bound up and sent to prison, robbed, and questioned, or if there's someone who's about to leave the road and fight and kill them or be dragged off, would you rather see that?'",
        "source": "T01n0086_001:0909c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人言：『我實見之。』",
        "translation": "The man said, 'I really see it.'",
        "source": "T01n0086_001:0909c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『若何以不自改為善？",
        "translation": "'How is it that it doesn't change itself into something good?'",
        "source": "T01n0086_001:0909c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為人時，何以不正若身、正若口、正若心？』",
        "translation": "If you are a human being, how can you impartially control your body, correctly control your speech, and correctly control your mind?'",
        "source": "T01n0086_001:0909c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人言：『我實愚癡憍慢。』",
        "translation": "That person says, 'I'm really foolish and arrogant.'",
        "source": "T01n0086_001:0910a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『若身所作，當自得之。",
        "translation": "'If you do something with your body, you'll get it yourself.",
        "source": "T01n0086_001:0910a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是亦非父母，非天非帝王，非沙門婆羅門過。",
        "translation": "This is also not the fault of a father or mother, a god or godless king, or an ascetic or a brāhmaṇa.",
        "source": "T01n0086_001:0910a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若身所作，當自得之。』",
        "translation": "If it's something you do, you'll get it yourself.'",
        "source": "T01n0086_001:0910a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為鹽王第五問對。",
        "translation": "This is the fifth question and answer from the salt king.",
        "source": "T01n0086_001:0910a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「問對已畢，泥犁旁則牽將持出詣一鐵城，是第一泥犁，名阿鼻摩泥犁。",
        "translation": "\"After he finished his interrogation, he led Nirgrantha out to an iron city called Abhidharma Nirgrantha, which is the first Nirgrantha.",
        "source": "T01n0086_001:0910a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城有四門，周匝四千里，中有大釜縱廣四十里，深亦四十里，泥犁旁以矛刺人，內著釜中煑之。",
        "translation": "Inside the city, which has four gates and is 4,000 miles in circumference, there's a large cauldron that's 40 miles wide and 40 miles deep, and beside the niraya a man is pierced with a spear and placed inside the cauldron to get a firewood supply.",
        "source": "T01n0086_001:0910a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是無數城中皆有火，人遙望見之，皆愁怖戰慄。",
        "translation": "Countless such cities have fire in them, and when people see them from a distance, they're terrified and frightened.",
        "source": "T01n0086_001:0910a08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是入者數千萬人，泥犁旁趁人而內其中，晝夜不得出入，四面走欲求出門，門皆閉不得出。",
        "translation": "Tens of millions of people enter like that, and they take advantage of the people inside beside the mud plow to prevent them from entering or leaving the city day or night, and they walk in every direction trying to get out, but the door is shut, and they can't get out.",
        "source": "T01n0086_001:0910a09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人在其中數千萬歲，火亦不滅、人亦不死。",
        "translation": "Even though a person has been in there for tens of millions of years, the fire doesn't go out and the person doesn't die.",
        "source": "T01n0086_001:0910a11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "久久見東門自開，人皆走欲出，適至門中門復閉，諸欲出人復於門中共鬪諍欲得出。",
        "translation": "After a long time, I saw the east gate open by itself, and people were walking away wanting to get out. When they arrived at the gate, the gate was closed again, and those who wanted to get out were fighting together in the gate trying to get out.",
        "source": "T01n0086_001:0910a12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "久久復遙見南門開，皆走往門復閉，人皆復於門中共鬪諍欲得出。",
        "translation": "After a long time, they also saw the south gate open from a distance, and they all went to the gate and closed it again, and they all fought together in the gate trying to get out.",
        "source": "T01n0086_001:0910a14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "久久復遙見北城門開，人皆走往門復閉，人皆復於門中共鬪諍欲得出。",
        "translation": "After a long time, they saw the northern gate open again from a distance, and they all went to the gate and closed it again, and people again fought within the gate with the desire to escape.",
        "source": "T01n0086_001:0910a15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "久久復遙見西門開，人皆走往門復閉。",
        "translation": "After a long time, they saw the west gate open again from a distance, and they all went to the gate and closed it again.",
        "source": "T01n0086_001:0910a17_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "久久四門復開，人皆走往悉得出，自以為得脫。",
        "translation": "After a long time, the four gates were again opened, and everyone who went to them emerged, thinking they had been freed.",
        "source": "T01n0086_001:0910a18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復入第二鳩延泥犁中，走足著地即焦，舉足肉復生如故。",
        "translation": "\"They then went back into the second Kumbhâṇḍa plow, where their feet touched the ground and they were scorched, but they lifted their feet and their flesh grew back as before.",
        "source": "T01n0086_001:0910a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有東走者、西走者、南走者、北走者，周匝地皆熱焦，數千萬歲乃竟，自以為得脫。",
        "translation": "Those who walk to the east, west, south, or north have their circumference scorched, and it takes tens of millions of years before they finish, but they think they've gained their liberation.",
        "source": "T01n0086_001:0910a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復入第三彌離摩德泥犁中，其中有虫，虫名掘啄，[口*(隹/乃)]如鐵，頭黑。",
        "translation": "\"Again, he enters the third Mīlamadhyamaka mud plow, where there's a bug named Digger Peck, [mouth*(short/nai)] like iron, and its head is black.",
        "source": "T01n0086_001:0910a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是虫見人皆迎而啄人，肉骨髓皆盡，如此數千萬歲乃竟，自以為得脫。",
        "translation": "When that bug sees a person, it greets them and pecks their flesh, bones, and marrow, and then it finishes after tens of millions of years, thinking it's been freed.",
        "source": "T01n0086_001:0910a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復入第四崩羅多泥犁中，其中有石石如利刀，人皆走上其顛，有走下者，皆欲求脫，不知當如去，足皆截剝，地石皆如利刀，如是復數千萬歲乃竟，自以為得脫。",
        "translation": "\"Furthermore, they enter the fourth niraya of Bālāta, where there are rocks and stones like sharp knives that people walk up and down, wanting to escape, but not knowing how to get out, their feet are cut off, and the rocks and stones are like sharp knives.",
        "source": "T01n0086_001:0910a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復入第五阿夷波多洹泥犁中，其中有熱風，風大熱，過於世間爐炭，風來著身焦人身體，皆欲避之者，常與熱風相逢，避之不能得脫。",
        "translation": "\"Furthermore, they enter the fifth Ajitavatapta niraya, where there's a hot wind that's so hot it's like a worldly cauldron, and it comes in contact with their bodies and burns their bodies.",
        "source": "T01n0086_001:0910b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人求死不能得死、求生不能得生，如是數千萬歲竟乃得出，自以為得脫。",
        "translation": "That person's search for death doesn't lead to death, and his search for birth doesn't lead to birth; after tens of millions of years like this, he finally arrives, thinking to himself that he's liberated.",
        "source": "T01n0086_001:0910b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復入第六阿喻慘波犁洹泥犁中，其中多樹木，樹木皆為刺，樹間有鬼。",
        "translation": "\"Again, he enters the sixth metaphorical hellhole, where there are many trees, all of which are thorny, and there are ghosts among the trees.",
        "source": "T01n0086_001:0910b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人入其中，鬼頭上即出火，口中亦出火，合身有十六刺。",
        "translation": "When a person enters it, fire comes out of the ghost's head and fire comes out of its mouth, and it has 16 thorns closing its body.",
        "source": "T01n0086_001:0910b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬼遙見人來入，大怒火，皆出前食人肉，十六刺皆貫人身體，裂而食之。",
        "translation": "When the demons see a person enter from a distance, they become furious and come out to eat their flesh; each of the sixteen thorns penetrates their body, rips it open, and eats it.",
        "source": "T01n0086_001:0910b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人皆欲得出，走者常觸是鬼，如是數千萬歲乃竟，自以為得脫。",
        "translation": "Everyone wants to escape, but those who leave always touch the ghost, and after tens of millions of years of this kind of situation, they think they've gotten rid of it.",
        "source": "T01n0086_001:0910b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復入第七熟徙務泥犁中，其中有蟲名敦，人入其中者，是虫飛來入人口中，食人身體，人皆走極欲求脫，虫食不置，人皆四面走不能得脫，如是數千萬歲乃竟，自以為得脫。",
        "translation": "\"Furthermore, they enter the seventh niraya of ripening, where there's a bug named Dun. When a person enters it, that bug flies into their mouth and eats their body, and they run away desperately wanting to escape, but the bug doesn't stop eating, so they run in all directions and can't escape.",
        "source": "T01n0086_001:0910b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復入第八檀尼愈泥犁中，其中有流水，人皆墮水中，水邊刺棘，是水熱過於世間湯灌，熱沸踊躍人皆熟爛。",
        "translation": "\"Furthermore, they enter the eighth hellhole, where there's running water and people fall into the water, which is surrounded by thorns and thorns, and the water is hotter than the hot water in the world, boiling and jumping up, and they're all rotted.",
        "source": "T01n0086_001:0910b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "走欲上岸，岸邊有鬼持矛手刺人，復內其中令不得出。",
        "translation": "When they walk away and try to reach the shore, a ghost on the shore holds a spear and thrusts its hand at them, and then it enters them so that they can't get out.",
        "source": "T01n0086_001:0910b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人入皆隨水下流，下流復有鬼，鬼復徼而鈎之，問言：『若曹從何所來？",
        "translation": "When the people enter, they all flow underwater, and then there's another ghost downstream that goes downstream, hooks them again, and asks, 'Where did you come from?'",
        "source": "T01n0086_001:0910b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為是間？』",
        "translation": "What if this is the interval?'",
        "source": "T01n0086_001:0910b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人言：『我不知從何所來，亦不知當如去。",
        "translation": "A person says, 'I don't know where I've come from, and I don't know how I'll go.",
        "source": "T01n0086_001:0910b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我但苦飢渴，欲隨逐飯食耳。』",
        "translation": "I'm just hungry and thirsty, and I want to follow someone who's feeding me.'",
        "source": "T01n0086_001:0910b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬼言：『我與汝食。』",
        "translation": "The demon says, 'I'll give you something to eat.'",
        "source": "T01n0086_001:0910b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即取消銅以注人口，復中皆燋，如是求死不得死、求生不得生。",
        "translation": "He then puts copper in his mouth and burns it inside, so that when he seeks death, he can't die, and when he seeks life, he can't be born.",
        "source": "T01n0086_001:0910b25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人於世間為人時作惡，是故求解不得解。",
        "translation": "When that person was a human being in the world, he did evil; therefore, he sought to be liberated but wasn't able to be liberated.",
        "source": "T01n0086_001:0910b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸泥犁人皆復得出，自以為得脫，還反更入第七泥犁中，第七泥犁中鬼迎問：『若去已復還為？』",
        "translation": "\"Those people in the mire all come back out, thinking they've been freed, but they go back into the seventh mire, and the ghost in the seventh mire welcomes them and asks, 'Why did you return after leaving?'",
        "source": "T01n0086_001:0910b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸泥犁中人皆言：『我但苦飢渴。』",
        "translation": "Everyone in that mire says, 'I'm only suffering from hunger and thirst.'",
        "source": "T01n0086_001:0910b29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即復入第六泥犁中，從第六復入第五，從第五復入第四，從第四復入第三，從第三復入第二，從第二復入第一阿鼻摩泥犁求出，遙望見鐵城，皆歡喜大呼，俱稱萬歲。",
        "translation": "They then reentered the sixth mud plow, reentered the fifth from the sixth, reentered the fourth from the fifth, reentered the third from the fourth, reentered the second from the third, and reentered the first avīci mud plow from the second and sought to escape, and looking out at the iron city, they all rejoiced and shouted, saying, 'Long live the king!'",
        "source": "T01n0086_001:0910c01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鹽王聞之，即問泥犁旁：『是何等聲？』",
        "translation": "When the Yama king heard this, he asked Nirgrantha, 'What's that sound?'",
        "source": "T01n0086_001:0910c05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泥犁旁即白言：『是呼聲者，是前所過泥犁中去。』",
        "translation": "Nirgrantha then said, 'That was a cry, 'That's the one who went through the niraya.'",
        "source": "T01n0086_001:0910c06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鹽王言：『是皆不孝父母，不畏天，不畏帝王，不敬先祖，不承事沙門婆羅門，不畏禁戒者。』",
        "translation": "The Yama King said, 'They are all unfilial to their parents, don't fear gods, don't fear emperors, don't honor their ancestors, don't serve ascetics and don't fear those who observe the precepts.'",
        "source": "T01n0086_001:0910c07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鹽王復見之言：『若莫非鹽王也，今若皆解脫去，當復為人作子者當孝順，當善事長老，當畏天，當畏帝王，當承事沙門婆羅門，當端若心、端若口、端若身。",
        "translation": "The Yama King then saw them again and said, 'Suppose none of them are the Yama King, and now if they're all liberated, they will again become sons of men who are dutiful and obedient, who serve the elders well, who fear heaven, who fear the emperor, who serve ascetics and priests, and who are correct in mind, correct in speech, and correct in body.",
        "source": "T01n0086_001:0910c09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人生在世間，罪過小且輕，泥犁罪過大重；若得沙門婆羅門當承事，然後當得度脫諸惡道，勤苦之處皆已閉塞。』",
        "translation": "'Man's faults in the world are minor and light, but the faults of the niraya are great and heavy; if he attains the respect of ascetics and priests, he'll be freed from the evil destinies and the place of suffering and effort will be closed.'",
        "source": "T01n0086_001:0910c12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對已畢，諸泥犁中人皆得出在城外，夜皆死。",
        "translation": "After this conversation, the people of Nirvana all left outside the city and died during the night.",
        "source": "T01n0086_001:0910c15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「死者先世為人時，雖作惡多猶有小善，從泥犁中還者，皆更正如道，從泥犁中出，各正心正行者，不復還入泥犁也；泥犁亦不呼人，從惡行所致，更泥犁中酷毒痛苦，亦可自思念亦可為善。」",
        "translation": "\"When the deceased was a human being in a previous life, even though he did much evil, he still did some small amount of good, and when he returned from the mire, he went back to the right path.",
        "source": "T01n0086_001:0910c16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說教如是，比丘皆歡喜。",
        "translation": "Thus did the Buddha teach, and the monks rejoiced.",
        "source": "T01n0086_001:0910c20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說泥犁經",
        "translation": "The Niraya Sutra Explained by the Buddha",
        "source": "T01n0086_001:0910c22_0",
        "is_bad_quality": false
    }
]