[
    {
        "source_sentence": "佛說長阿含經卷第十九",
        "translation": "Foshuo Chang'ahan jing, vol. 19",
        "source": "T01n0001_019:0121b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後秦弘始年佛陀耶舍共竺佛念譯",
        "translation": "Latter-Qin Emperor Hiroshi's year, Buddhayaśas and Zhufo Nianshi",
        "source": "T01n0001_019:0121b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四分世記經地獄品第四",
        "translation": "Fourth Part of the Sutra on the Record of Worlds, Fourth Chapter of the Gaia Sutra",
        "source": "T01n0001_019:0121b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「此四天下有八千天下圍遶其外，復有大海水周匝圍遶八千天下，復有大金剛山遶大海水。",
        "translation": "The Buddha told the monks, \"Outside of these four heavens, there are 8,000 heavens surrounding them, and there's another great ocean of water surrounding 8,000 heavens, and another great adamantine mountain surrounding the great ocean of water.",
        "source": "T01n0001_019:0121b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金剛山外復有第二大金剛山，二山中間窈窈冥冥，日月神天有大威力，不能以光照及於彼。",
        "translation": "Beyond Mount Vajra there's another large, second, vajra mountain, and between those two mountains is so deep and dark that the sun, moon, gods, and goddesses have such great power that they can't reach it with their light.",
        "source": "T01n0001_019:0121c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有八大地獄，其一地獄有十六小地獄。",
        "translation": "There are eight great hells there, and in one of them there are 16 lesser hells.",
        "source": "T01n0001_019:0121c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一大地獄名想，第二名黑繩，第三名堆壓，第四名叫喚，第五名大叫喚，第六名燒炙，第七名大燒炙，第八名無間。",
        "translation": "The first great hell is called conception, the second is called black-string, the third is called crushing, the fourth is called wailing, the fifth is called great wailing, the sixth is called burning, the seventh is called great burning, and the eighth is called unremitting.",
        "source": "T01n0001_019:0121c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其想地獄有十六小獄，小獄縱廣五百由旬，第一小獄名曰黑沙，二名沸屎，三名五百丁，四名飢，五名渴，六名一銅釜，七名多銅釜，八名石磨，九名膿血，十名量火，十一名灰河，十二名鐵丸，十三名釿斧，十四名犲狼，十五名劍樹，十六名寒氷。",
        "translation": "The hell of perception has 16 small hells, each measuring 500 yojanas in length, and the first is called black sand, the second is called boiling dung, the third is 500 dinos, the fourth is hunger, the fifth is thirst, the sixth is called a copper cauldron, the seventh is many copper cauldrons, the eighth is a stone mill, the ninth is pus and blood, the tenth is measured fire, the eleventh is a river of ash, the twelfth is iron pellets, the thirteenth is a hammer and axe, the fourteenth is a wolf, the fifteenth is a sword tree, and the sixteenth is ice and cold.",
        "source": "T01n0001_019:0121c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何名想地獄？",
        "translation": "\"What's the name of the hell of conceptualization?",
        "source": "T01n0001_019:0121c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中眾生手生鐵爪，其爪長利，迭相瞋忿，懷毒害想，以爪相爴，應手肉墮，想為已死；冷風來吹，皮肉還生，尋活起立。",
        "translation": "One of those sentient beings has a hand with an iron claw that's long and sharp, and he repeatedly becomes angry and harbors thoughts of poisonous harm, striking his hand with his claw and causing it to fall to the ground, thinking that he's dead.",
        "source": "T01n0001_019:0121c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自想言：『我今已活。』",
        "translation": "He thinks to himself, 'Now I'm alive.'",
        "source": "T01n0001_019:0121c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘眾生言：『我想汝活。』",
        "translation": "Other sentient beings say, 'I think you're alive.'",
        "source": "T01n0001_019:0121c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是想故，名想地獄。",
        "translation": "Because of this perception, it's called the hell of perception.",
        "source": "T01n0001_019:0121c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，想地獄其中眾生懷毒害想，共相觸嬈，手執自然刀劍，刀劍鋒利，迭相斫刺，[利-禾+皮]剝臠割，身碎在地，想謂為死；冷風來吹，皮肉更生，尋活起立。",
        "translation": "\"Furthermore, sentient beings in the hell of perception harbor poisonous thoughts, come in contact with each other, hold natural swords in their hands, and wield sharp swords that repeatedly bash and stab each other, [cutting away [sharpness - grain + skin], strip their bodies, and cut them to pieces on the ground, thinking that they're dead; when a cold breeze blows, their skin and flesh regenerate, and they find themselves standing up alive.",
        "source": "T01n0001_019:0121c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼自想言：『我今已活。』",
        "translation": "They think to themselves, 'Now I'm alive.'",
        "source": "T01n0001_019:0121c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘眾生言：『我想汝活。』",
        "translation": "Other sentient beings say, 'I think you're alive.'",
        "source": "T01n0001_019:0121c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此因緣故，名想地獄。",
        "translation": "Because of this cause, it's called the hell of perception.",
        "source": "T01n0001_019:0121c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，想地獄其中眾生懷毒害想，迭相觸嬈，手執刀劍，刀劒鋒利，共相斫刺，[利-禾+皮]剝臠割，想謂為死；冷風來吹，皮肉更生，尋活起立。",
        "translation": "\"Furthermore, suppose there are sentient beings in the hell of perception who harbor harmful thoughts, repeatedly touch each other, hold swords and knives in their hands, and slash and cut each other, thinking that they're dead; then a cold wind blows, and their skin and flesh regenerate, and they find life and rise up.",
        "source": "T01n0001_019:0121c23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自言：『我活。』",
        "translation": "They say to themselves, 'I'm alive.'",
        "source": "T01n0001_019:0121c26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘眾生言：『我想汝活。』",
        "translation": "Other sentient beings say, 'I want you to live.'",
        "source": "T01n0001_019:0121c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此因緣故，名想地獄。",
        "translation": "Because of this cause, it's called the hell of perception.",
        "source": "T01n0001_019:0121c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，想地獄其中眾生懷毒害想，迭相觸嬈，手執油影刀，其刀鋒利，更相斫刺，[利-禾+皮]剝臠割，想謂為死；冷風來吹，皮肉更生，尋活起立。",
        "translation": "\"Furthermore, sentient beings in the hell of perception harbor harmful thoughts, repeatedly touch each other, hold an oil-shaded knife in their hands, and with its sharp blade, they further bash and stab each other, peel off their [skin], and cut them, thinking that they're dead; when a cold wind blows, their skin and flesh regenerate, and they rise up alive.",
        "source": "T01n0001_019:0121c27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自言：『我活。』",
        "translation": "They say to themselves, 'I'm alive.'",
        "source": "T01n0001_019:0122a01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘眾生言：『我想汝活。』",
        "translation": "Other sentient beings say, 'I want you to live.'",
        "source": "T01n0001_019:0122a01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，名為想地獄。",
        "translation": "Because of this cause, it's called the hell of perception.",
        "source": "T01n0001_019:0122a02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，想地獄其中眾生懷毒害想，迭相觸嬈，手執小刀，其刀鋒利，更相斫刺，[利-禾+皮]剝臠割，想謂為死；冷風來吹，皮肉更生，尋活起立。",
        "translation": "\"Furthermore, sentient beings in the hell of perception harbor harmful thoughts, repeatedly touch each other, hold small knives in their hands that are sharp, cut each other, and peel off [sharpness - grain + skin], thinking that they're dead; when a cold wind blows, their skin and flesh regenerate, and they rise up alive.",
        "source": "T01n0001_019:0122a02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自言：『我活。』",
        "translation": "They say to themselves, 'I'm alive.'",
        "source": "T01n0001_019:0122a05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘眾生言：『我想汝活。』",
        "translation": "Other sentient beings say, 'I want you to live.'",
        "source": "T01n0001_019:0122a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣故，名想地獄。",
        "translation": "Because of this cause, it's called the hell of perception.",
        "source": "T01n0001_019:0122a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「其中眾生久受罪已，出想地獄，慞惶馳走，求自救護，宿罪所牽，不覺忽到黑沙地獄。",
        "translation": "\"After suffering for a long time from their sins, these sentient beings leave the hell of perceptions, scurry about in fear, seeking to save themselves, and are tethered by their past sins, and suddenly reach the hell of black sand without realizing it.",
        "source": "T01n0001_019:0122a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有熱風暴起，吹熱黑沙，來著其身，舉體盡黑，猶如黑雲，熱沙燒皮，盡肉徹骨，罪人身中有黑焰起，遶身迴旋，還入身內，受諸苦惱，燒炙燋爛。",
        "translation": "When a hot wind rises up and blows hot black sand onto their bodies, their bodies are completely black like a black cloud, and the hot sand burns their skin and cuts through their flesh and bones.",
        "source": "T01n0001_019:0122a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以罪因緣，受此苦報，其罪未畢，故使不死。",
        "translation": "Because of the causes and conditions of their sins, they experience this painful retribution before their sins are complete, which is why they don't die.",
        "source": "T01n0001_019:0122a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「於此久受苦已，出黑沙地獄，慞惶馳走，求自救護，宿罪所牽，不覺忽到沸屎地獄。",
        "translation": "\"After suffering here for a long time, he emerges from the hell of black sand, rushes around in fear and seeks to save himself, and is tethered by his past sins when he suddenly reaches the hell of boiling concrete without realizing it.",
        "source": "T01n0001_019:0122a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其地獄中有沸屎鐵丸自然滿前，驅迫罪人使抱鐵丸，燒其身手，至其頭面，無不周遍。",
        "translation": "In that hell, there are boiling concrete iron balls that naturally fill the front, and they force the offender to carry the iron balls, burning their bodies and hands and reaching their heads and faces, without fail.",
        "source": "T01n0001_019:0122a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復使探撮，舉著口中，燒其脣舌，從咽至腹，通徹下過，無不燋爛。",
        "translation": "They also make him pick it up, hold it in his mouth, burn his lips and tongue, and pass it down from his throat to his belly; it doesn't fail to scorch.",
        "source": "T01n0001_019:0122a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有鐵[口*(隹/乃)]虫，唼食皮肉，徹骨達髓，苦毒辛酸，憂惱無量。",
        "translation": "An iron [mouth*(short/nai)] worm gobbles up their skin and flesh, penetrating their bones and marrow, which is painful, pungent, and has incalculable grief.",
        "source": "T01n0001_019:0122a19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以罪未畢，猶復不死。",
        "translation": "Because their crimes haven't been completed, they still won't die.",
        "source": "T01n0001_019:0122a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「於沸屎地獄久受苦已，出沸屎地獄，慞惶馳走，求自救護，到鐵釘地獄。",
        "translation": "\"After suffering for a long time in the boiling shit hell, he leaves the boiling shit hell and rushes away in fear and desperation, seeking protection for himself, and goes to the hell of iron nails.",
        "source": "T01n0001_019:0122a20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到已，獄卒撲之令墮，偃熱鐵上，舒展其身，以釘釘手、釘足、釘心，周遍身體，盡五百釘，苦毒辛酸，號咷呻吟。",
        "translation": "When they arrive, the jailer pounds them and makes them fall down, laying them down on a hot iron, stretching their bodies, nailing their hands, feet, and hearts with nails, completely surrounding their bodies with 500 nails, which causes pain and suffering, and screaming and groaning.",
        "source": "T01n0001_019:0122a22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，猶復不死。",
        "translation": "Before the remaining sins are completed, he'll still be immortal.",
        "source": "T01n0001_019:0122a25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「久受苦已，出鐵釘地獄，慞惶馳走，求自救護，到飢餓地獄。",
        "translation": "\"After suffering for a long time, he emerges from the hell of iron nails, rushes around in fear and seeks his own protection, and goes to the hell of hunger.",
        "source": "T01n0001_019:0122a25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獄卒來問：『汝等來此，欲何所求？』",
        "translation": "The jailer comes and asks, 'What do you want to come here?'",
        "source": "T01n0001_019:0122a26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "報言：『我餓。』",
        "translation": "He replied, 'I'm hungry.'",
        "source": "T01n0001_019:0122a27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獄卒即捉撲熱鐵上，舒展其身，以鐵鈎鈎口使開，以熱鐵丸著其口中，燋其脣舌，從咽至腹，通徹下過，無不燋爛，苦毒辛酸，悲號啼哭。",
        "translation": "The jailer then pounds him onto a hot iron, stretches out his body, hooks an iron hook into his mouth, opens it, puts a hot iron ball in his mouth, burns his lips and tongue, and sends it all the way down from his throat to his belly, where it burns and becomes painful and pungent, making him lament and weep.",
        "source": "T01n0001_019:0122a27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未盡，猶復不死。",
        "translation": "Their remaining sins haven't been ended, but they still won't die.",
        "source": "T01n0001_019:0122b02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「久受苦已，出飢地獄，慞惶馳走，求自救護，到渴地獄。",
        "translation": "\"After suffering for a long time, he emerges from the hell of hunger, rushes around in fear and seeks to save himself, and goes to the hell of thirst.",
        "source": "T01n0001_019:0122b02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獄卒問言：『汝等來此，欲何所求？』",
        "translation": "The jailer asked, 'What do you want to come here for?'",
        "source": "T01n0001_019:0122b03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "報言：『我渴。』",
        "translation": "He replied, 'I'm thirsty.'",
        "source": "T01n0001_019:0122b04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獄卒即捉撲熱鐵上，舒展其身，以熱鐵鈎鈎口使開，消銅灌口，燒其脣舌，從咽至腹，通徹下過，無不燋爛，苦毒辛酸，悲號啼哭。",
        "translation": "The jailer then pounds him onto a hot iron, stretches out his body, hooks a hot iron into his mouth, pours copper into his mouth, burns his lips and tongue, and sends it all the way down from his throat to his belly, where it's scorched, painful, bitter, and sour, and he laments and wails.",
        "source": "T01n0001_019:0122b04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未盡，猶復不死。",
        "translation": "Their remaining sins haven't been ended, but they still won't die.",
        "source": "T01n0001_019:0122b07_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「久受苦已，出渴地獄，慞惶馳走，求自救護，宿罪所牽，不覺忽到一銅鍑地獄。",
        "translation": "\"After suffering for a long time, he emerges from the thirsty hell, rushes around in fear, and seeks to save himself, but he's tied up by his past sins, and suddenly reaches a copper-empty hell without realizing it.",
        "source": "T01n0001_019:0122b08_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獄卒怒目捉罪人足，倒投鍑中，隨湯涌沸，上下迴旋，從底至口，從口至底，或在鍑腹，身體爛熟。",
        "translation": "The jailer angrily grabs the condemned man by the feet and throws him upside down into the coffin, where the water boils and swirls up and down, from bottom to mouth and from mouth to bottom, or in the coffin's belly, where his body rots and cooks.",
        "source": "T01n0001_019:0122b10_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如煮豆，隨湯涌沸，上下迴轉，中外爛壞，罪人在鍑，隨湯上下，亦復如是，號咷悲叫，萬毒普至。",
        "translation": "It's like boiling soybeans, which boil up and down as the water rises and revolves, rotting inside and out.",
        "source": "T01n0001_019:0122b12_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未盡，故復不死。",
        "translation": "The remaining sins haven't been ended, so he's still immortal.",
        "source": "T01n0001_019:0122b15_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「久受苦已，出一銅鍑地獄，慞惶馳走，求自救護，宿罪所牽，不覺忽至多銅鍑地獄。",
        "translation": "\"After suffering for a long time, he emerges from the hell of one copper pavilion, rushes around in fear, and seeks to save himself, but he's tied up by his past sins, and suddenly reaches the hell of many copper pavilions without realizing it.",
        "source": "T01n0001_019:0122b15_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "多銅鍑地獄縱廣五百由旬，獄鬼怒目捉罪人足，倒投鍑中，隨湯涌沸，上下迴旋，從底至口，從口至底，或在鍑腹，舉身爛壞。",
        "translation": "The hell of many copper pirates is 500 leagues wide, and the hell demon angrily grabs the sinner by the feet and throws him upside down into the pirates, following the boiling hot water that rises and falls, circling up and down, going from bottom to mouth and from mouth to bottom, or in the belly of the pirates, holding his body up and rotting it.",
        "source": "T01n0001_019:0122b17_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如煑豆，隨湯涌沸，上下迴轉，中外皆爛，罪人在鍑，亦復如是，隨湯上下，從口至底，從底至口，或手足現，或腰腹現，或頭面現，獄卒以鐵鈎鈎取置餘鍑中，號咷悲叫，苦毒辛酸。",
        "translation": "Like when a fire bean gushes up and boils in hot water and revolves up and down, rotting inside and out, the offender is likewise in the jailer's hand and foot, waist and stomach, or head and face, as the water rises and falls, from mouth to bottom and from bottom to mouth.",
        "source": "T01n0001_019:0122b20_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "Because their remaining crimes haven't been completed, they won't die.",
        "source": "T01n0001_019:0122b24_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「久受苦已，出多銅鍑地獄，慞惶馳走，求自救護，宿對所牽，不覺忽至石磨地獄。",
        "translation": "\"After suffering for a long time, he escapes from the hell of many copper pirates, rushes around in fear, and seeks to save himself, but he's pulled by a constellation of opposites and suddenly reaches the hell of stone mills without realizing it.",
        "source": "T01n0001_019:0122b25_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "石磨地獄縱廣五百由旬，獄卒大怒，捉彼罪人撲熱石上，舒展手足，以大熱石壓其身上，迴轉揩磨，骨肉糜碎，膿血流出，苦毒切痛，悲號辛酸。",
        "translation": "The stone-mill hell is 500 leagues wide, and the jailer is furious when he catches that sinner and puts him on a hot rock, stretches out his arms and legs, presses a huge hot rock against him, and turns him around to grind him, crushing his bones and flesh, spilling pus and blood, causing pain and suffering, and lamenting bitterly.",
        "source": "T01n0001_019:0122b27_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未盡，故使不死。",
        "translation": "Their remaining sins haven't been completed, so they won't die.",
        "source": "T01n0001_019:0122c01_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「久受苦已，出石磨地獄，慞惶馳走，求自救護，宿對所牽，不覺忽至膿血地獄。",
        "translation": "\"After suffering for a long time, they emerge from the stone-grinding hell, perplexed and running, seeking to save themselves, and unaware that they've been dragged by past enemies, they suddenly arrive at the hell of pus and blood.",
        "source": "T01n0001_019:0122c02_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "膿血地獄縱廣五百由旬，其地獄中有自然膿血，熱沸涌出，罪人於中東西馳走，膿血沸熱，湯其身體，手足頭面皆悉爛壞；又取膿血而自食之，湯其脣舌，從咽至腹，通徹下過，無不爛壞，苦毒辛酸，眾痛難忍。",
        "translation": "In that hell, there's naturally occurring pus and blood that boils and gushes out, and when the offender runs around in it, the pus and blood boils hot and boils up his body, and his hands, feet, head, and face all rot; he also takes the pus and blood and eats it himself, which boils up his lips and tongue, penetrates from his throat to his belly, and passes through it without fail, rotting, and causing painful, bitter, and pungent pain that's hard to bear.",
        "source": "T01n0001_019:0122c03_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins hadn't been completed, so he didn't die.",
        "source": "T01n0001_019:0122c08_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「久受苦已，乃出膿血地獄，慞惶馳走，求自救護，宿罪所牽，不覺忽至量火地獄。",
        "translation": "\"After suffering for a long time, he then emerges from the hell of pus and blood, perplexed and running, seeking to save himself, and unconsciously suddenly arriving at the hell of measure and fire because of the sins of his past.",
        "source": "T01n0001_019:0122c09_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "量火地獄縱廣五百由旬，其地獄中有大火聚，自然在前。",
        "translation": "That fiery hell is 500 leagues wide, and there's a huge cluster of fires naturally located in front of it.",
        "source": "T01n0001_019:0122c11_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其火焰熾，獄卒瞋怒馳迫罪人，手執鐵斗，使量火聚，彼量火時，燒其手足，遍諸身體，苦毒熱痛，呻吟號哭。",
        "translation": "When that fire is blazing, the jailer angrily chases the offender down, holding an iron bucket in his hand, and causes a measuring fire to gather, which, when measured, burns his hands and feet, riddles his body with pain and burning, and causes him to moan and wail.",
        "source": "T01n0001_019:0122c12_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins haven't been completed, so he's prevented from dying.",
        "source": "T01n0001_019:0122c15_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「久受苦已，乃出量火地獄，慞惶馳走，自求救護，宿對所牽，不覺忽到灰河地獄。",
        "translation": "\"After suffering for a long time, they then leave the hell of measuring fire, perplexed and running, seeking protection for themselves, and unawares they suddenly arrive at the hell of the ash river, having been dragged by a constellation of opposites.",
        "source": "T01n0001_019:0122c15_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "灰河地獄縱廣五百由旬，深五百由旬，灰湯涌沸，惡氣熢[火*孛]，迴波相搏，聲響可畏，從底至上，鐵刺縱廣鋒長八寸，其河岸邊生長刀劍，其邊皆有獄卒狐狼，又其岸上有劍樹林，枝葉花實皆是刀劍，鋒刃八寸。",
        "translation": "The Ash River hell is 500 leagues wide and 500 leagues deep, with ashes boiling up, bad breath bubbling [fire * comet], and resounding waves that wrestle with each other with a terrifying sound, and from the bottom upward, iron spikes with blades eight inches long and wide, swords growing on the river's banks, and jailers, foxes, and wolves at its edges, and a forest of sword trees on its banks with branches, leaves, flowers, and fruit that are all swords with eight-inch blades.",
        "source": "T01n0001_019:0122c17_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "罪人入河，隨波上下，迴覆沈沒，鐵刺刺身，內外通徹，皮肉爛壞，膿血流出，苦痛萬端，悲號酸毒。",
        "translation": "When the offender enters the river, he goes up and down with the waves, submerges in a circle, is pierced by iron spikes, has his flesh rotted inside and out, and has pus and blood flowing out, causing a myriad of pains and sorrows.",
        "source": "T01n0001_019:0122c22_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "Their skin and flesh are thoroughly rotted, and pus and blood flow out, causing agony and pain, and they lament soreness and venom. The remaining sins have yet to be completed, so they're prevented from dying.",
        "source": "T01n0001_019:0122c24_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「久受苦已，乃出灰河地獄至彼岸上，岸上利劍割刺身體，手足傷壞。",
        "translation": "\"After suffering for a long time, he then emerges from the hell of the ash river and goes to the other shore, where a sharp sword cuts and pierces his body and wounds his hands and feet.",
        "source": "T01n0001_019:0122c24_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，獄卒問罪人言：『汝等來此，欲何所求？』",
        "translation": "The jailer then asked the condemned man, 'What do you want to come here for?'",
        "source": "T01n0001_019:0122c26_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "罪人報言：『我等飢餓。』",
        "translation": "The culprit reported, 'We're hungry!'",
        "source": "T01n0001_019:0122c27_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獄卒即捉罪人撲熱鐵上，舒展身體，以鐵鈎擗口，洋銅灌之，燒其脣舌，從咽至腹，通徹下過，無不燋爛。",
        "translation": "The jailer then grabs the offender, puts him headfirst onto a hot iron, stretches out his body, beats his mouth with an iron hook, pours foreign copper over it, burns his lips and tongue, and sends it all the way down from his throat to his belly; it doesn't fail to scorch him.",
        "source": "T01n0001_019:0122c27_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有犲狼，牙齒長利，來嚙罪人，生食其肉。",
        "translation": "Then, there's a wolf with large, sharp teeth that comes to bite the sinner and eat his flesh alive.",
        "source": "T01n0001_019:0123a01_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是，罪人為灰河所煮，利刺所刺，洋銅灌口，犲狼所食已，即便[馬*奔]馳走上劍樹，上劍樹時，劍刃下向，下劍樹時，劍刃上向，手攀手絕，足蹬足絕，劍刃刺身，中外通徹，皮肉墮落，膿血流出，遂有白骨筋脉相連。",
        "translation": "After being boiled by a river of ash, pierced by sharp thorns, and having his mouth filled with foreign copper, the wolf eats him and then [horses*run] up a sword tree, ascending it with the blade pointing downward and descending it with the blade pointing upward, cutting off his hands as he climbs, cutting off his feet as he stomps, piercing his body with the blade, penetrating it from the outside and inside, dropping his skin and flesh, spilling pus and blood, and leaving white bones and sinews attached to it.",
        "source": "T01n0001_019:0123a02_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，劍樹上有鐵[口*(隹/乃)]鳥，啄頭骨壞，唼食其腦，苦毒辛酸，號咷悲叫。",
        "translation": "An iron [mouth*(short-tailed/nai)] bird pecked at his head and bones and gobbled his brain, which was so painful and pungent that it cried out in lamentation.",
        "source": "T01n0001_019:0123a07_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "Because his remaining sins hadn't been completed, he didn't die.",
        "source": "T01n0001_019:0123a08_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "還復來入灰河獄中，隨波上下，廻覆沈沒，鐵刺刺身，內外通徹，皮肉爛壞，膿血流出，唯有白骨浮漂於外，冷風來吹，肌肉還復，尋便起立，慞惶馳走，求自救護，宿對所牽，不覺忽至鐵丸地獄。",
        "translation": "They are pierced by iron spikes that penetrate their bodies inside and out, their skin and flesh rot, and pus and blood flow out, except for white bones floating on the outside.",
        "source": "T01n0001_019:0123a09_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鐵丸地獄縱廣五百由旬，罪人入已，有熱鐵丸自然在前，獄鬼驅捉，手足爛壞，舉身火然，苦痛悲號，萬毒竝至。",
        "translation": "After entering it, a hot iron ball naturally appears in front of the offender, and the hell demon drives him away, rotting his hands and feet, holding his body up in flames, lamenting in pain, and inflicting a myriad of poisons.",
        "source": "T01n0001_019:0123a13_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so he's prevented from dying.",
        "source": "T01n0001_019:0123a16_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「久受苦已，乃至出鐵丸地獄，慞惶馳走，求自救護，宿對所牽，不覺忽至釿斧地獄。",
        "translation": "\"After suffering for a long time, they eventually escape from the iron-ball hell, perplexed and frantic, seeking to save themselves, and unaware that they've been dragged by past oppositions, they suddenly arrive at the hell of the burning axe.",
        "source": "T01n0001_019:0123a16_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釿斧地獄縱廣五百由旬，彼入獄已，獄卒瞋怒捉此罪人撲熱鐵上，以熱鐵釿斧破其手足、耳鼻、身體，苦毒辛酸，悲號叫喚。",
        "translation": "The length of that hell is 500 leagues, and after he enters it, the jailer angrily catches this criminal and puts him up against a hot iron, using a hot iron hammer to break his hands, feet, ears, nose, and body; it's painful and pungent, and he cries out in lamentation.",
        "source": "T01n0001_019:0123a18_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未盡，猶復不死。",
        "translation": "The remaining sins are not yet finished, but he still remains immortal.",
        "source": "T01n0001_019:0123a21_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「久受罪已，出釿斧地獄，慞惶馳走，求自救護，宿罪所牽，不覺忽至犲狼地獄。",
        "translation": "\"After suffering for a long time, he emerges from the hell of the fiery axe, perplexed and frantic, seeking to save himself, and overcome by his past sins, he suddenly reaches the hell of the dire wolf without realizing it.",
        "source": "T01n0001_019:0123a21_59",
        "is_bad_quality": false
    },
    {
        "source_sentence": "犲狼地獄縱廣五百由旬，罪人入已，有群犲狼競來[齒*盧]掣，[齒*齊]嚙拖抴，肉墮傷骨，膿血流出，苦痛萬端，悲號酸毒。",
        "translation": "The hell of the Caucasian wolf is 500 leagues wide, and after he enters it, a pack of Caucasian wolves comes [teeth*lo] and [teeth*chi] to [bite] and drag him, cutting his flesh and bones, bleeding from pus, and causing a million pains and sorrows.",
        "source": "T01n0001_019:0123a23_60",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "Because their remaining sins hadn't been completed, they weren't allowed to die.",
        "source": "T01n0001_019:0123a26_61",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「久受苦已，乃出犲狼地獄，慞惶馳走，求自救護，宿對所牽，不覺忽至劍樹地獄。",
        "translation": "\"After suffering for a long time, he then leaves the hell of the wolf, perplexed and running, seeking to save himself, and unconsciously suddenly reaches the hell of the sword tree when he's being dragged by a constellation of opposites.",
        "source": "T01n0001_019:0123a26_62",
        "is_bad_quality": false
    },
    {
        "source_sentence": "劍樹地獄縱廣五百由旬，罪人入彼劍樹林中，有大暴風起吹，劍樹葉墮其身上，著手手絕，著足足絕，身體頭面無不傷壞。",
        "translation": "The sword-tree hell is 500 leagues wide, and when a great storm rises and blows, the leaves of the sword tree fall on him, cutting off his hands and feet as they touch his body, and his head and face are not without injury.",
        "source": "T01n0001_019:0123a28_63",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有鐵[口*(隹/乃)]鳥立其頭上，啄其兩目，苦痛萬端，悲號酸毒。",
        "translation": "An iron [mouth*(short-tailed/nai)] bird stands on his head and pecks at his eyes, causing him a great deal of pain and sorrow.",
        "source": "T01n0001_019:0123b02_64",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "Because their remaining sins haven't been completed, they won't die.",
        "source": "T01n0001_019:0123b03_65",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「久受苦已，乃出劍樹地獄，慞惶馳走，求自救護，宿罪所牽，不覺忽至寒氷地獄。",
        "translation": "\"After suffering for a long time, he then leaves the hell of the sword tree, rushes around in fear, and seeks to save himself, but he's tied up by his past sins, and suddenly reaches the cold, icy hell without realizing it.",
        "source": "T01n0001_019:0123b04_66",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寒氷地獄縱廣五百由旬，罪人入已，有大寒風來吹其身，舉體凍瘃，皮肉墮落，苦毒辛酸，悲號叫喚，然後命終。」",
        "translation": "That cold hell is 500 leagues wide, and after entering it, a great cold wind blows on his body, freezing his body and chilblains, dropping his skin and flesh, causing pain and suffering, and he cries out in lamentation before his life ends.\"",
        "source": "T01n0001_019:0123b06_67",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「黑繩大地獄有十六小地獄，周匝圍遶，各各縱廣五百由旬，從黑繩地獄至寒氷地獄。",
        "translation": "The Buddha told the monks, \"The great black-rope hell has 16 small hells, each circumscribed by a circumference 500 yojanas in length, from the black-rope hell to the cold-ice hell.",
        "source": "T01n0001_019:0123b08_68",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故名為黑繩地獄？",
        "translation": "Why are they called the black-rope hells?",
        "source": "T01n0001_019:0123b10_69",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其諸獄卒捉彼罪人撲熱鐵上，舒展其身，以熱鐵繩絣之使直，以熱鐵斧逐繩道斫，絣彼罪人，作百千段，猶如工匠以繩絣木，利斧隨斫，作百千段。",
        "translation": "Those jailers catch that criminal and put him on a hot iron, stretch him out, and make him straight with a hot iron cord that's woven into the fabric, and then they chop him up with a hot iron ax one by one along the cord's path, wreathing him into a hundred thousand pieces, just like a craftsman who wraps a cord of woven wood and chops it up with a sharp ax to make a hundred thousand pieces.",
        "source": "T01n0001_019:0123b11_70",
        "is_bad_quality": false
    },
    {
        "source_sentence": "治彼罪人，亦復如是，苦毒辛酸，不可稱計。",
        "translation": "He treats that offender similarly, with pain and suffering that defies calculation.",
        "source": "T01n0001_019:0123b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins haven't been completed, so he's prevented from dying.",
        "source": "T01n0001_019:0123b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名為黑繩地獄。",
        "translation": "This is called the black-rope hell.",
        "source": "T01n0001_019:0123b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，黑繩地獄獄卒捉彼罪人撲熱鐵上，舒展其身，以鐵繩絣，以鋸鋸之，猶如工匠以繩絣木，以鋸鋸之，治彼罪人，亦復如是，苦痛辛酸，不可稱計。",
        "translation": "\"Furthermore, when the jailer of Black Rope Hell catches that criminal and puts him on a hot iron, stretches out his body, Ikatizes it with an iron rope, and saws it with a saw, just like a craftsman Ikatizing wood with a rope and sawing it with a saw, he treats that criminal similarly, with pain and suffering that defies calculation.",
        "source": "T01n0001_019:0123b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so he's prevented from dying.",
        "source": "T01n0001_019:0123b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故名為黑繩地獄。",
        "translation": "Therefore, it's called the black-rope hell.",
        "source": "T01n0001_019:0123b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，黑繩地獄捉彼罪人撲熱鐵上，舒展其身，以熱鐵繩置其身上，燒皮徹肉，燋骨沸髓，苦毒辛酸，痛不可計。",
        "translation": "\"Furthermore, the black-rope hell catches that offender and puts him on a hot iron, stretches him out, and puts a hot iron cord on his body, which burns his skin and penetrates his flesh, scorches his bones and boils his marrow, and causes painful, venomous, and excruciating pain that defies calculation.",
        "source": "T01n0001_019:0123b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so he's prevented from dying.",
        "source": "T01n0001_019:0123b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故名黑繩地獄。",
        "translation": "That's why it's called the black-rope hell.",
        "source": "T01n0001_019:0123b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，黑繩地獄獄卒，懸熱鐵繩交橫無數，驅迫罪人，使行繩間，惡風暴起，吹諸鐵繩，歷落其身，燒皮徹肉，燋骨沸髓，苦毒萬端，不可稱計。",
        "translation": "\"Furthermore, when the jailers of Black Rope Hell hang hot iron ropes in numerous directions and force sinners to walk between them, a fierce wind rises and blows those iron ropes across their bodies, burning their skin and cutting through their flesh, scorching their bones and boiling their marrow, and causing misery and pain that defies calculation.",
        "source": "T01n0001_019:0123b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The rest of the offense is yet to be completed, so they're not killed.",
        "source": "T01n0001_019:0123b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故名黑繩。",
        "translation": "That's why they're called black-rope guards.",
        "source": "T01n0001_019:0123b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，黑繩獄卒以熱鐵繩衣驅罪人被之，燒皮徹肉，燋骨沸髓，苦毒萬端，不可稱計。",
        "translation": "\"Furthermore, the black-rope jailer uses a hot iron rope robe to drive a criminal under it, burning his skin and penetrating his flesh, scorching his bones and boiling his marrow, and inflicting a painful, incalculable amount of poison.",
        "source": "T01n0001_019:0123b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The rest of the crimes haven't been completed, so they're kept from dying.",
        "source": "T01n0001_019:0123c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故名黑繩。",
        "translation": "That's why it's called a black cord.",
        "source": "T01n0001_019:0123c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其彼罪人久受苦已，乃出黑繩地獄，慞惶馳走，求自救護，宿對所牽，不覺忽至黑沙地獄，乃至寒氷地獄，然後命終，亦復如是。」",
        "translation": "After suffering for a long time, that offender then emerges from the black-rope hell, rushes around in fear, seeks to save himself, and is led by past oppositions, and suddenly ends up in the black-sand hell or even the cold-ice hell before his life ends, just like that.\"",
        "source": "T01n0001_019:0123c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「堆壓大地獄有十六小地獄，周匝圍遶，各各縱廣五百由旬。",
        "translation": "The Buddha told the monks, \"The great hell of crushing has 16 small hells that are surrounded by a circumference, each 500 yojanas in length and breadth.",
        "source": "T01n0001_019:0123c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故名為堆壓地獄？",
        "translation": "Why is it called the hell of crushing?",
        "source": "T01n0001_019:0123c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其地獄中有大石山，兩兩相對，罪人入中，山自然合，堆壓其身，骨肉糜碎，山還故處，猶如以木擲木，彈却還離，治彼罪人，亦復如是，苦毒萬端，不可稱計。",
        "translation": "In that hell, there are large stone mountains placed two abreast, and when a criminal enters them, the mountains naturally close in on themselves, crushing their bodies and pulverizing their bones and flesh, and the mountains return to their former location like throwing wood at a log and bouncing it back, and so it is with that criminal, which causes a million miseries that can't be calculated.",
        "source": "T01n0001_019:0123c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so he's prevented from dying.",
        "source": "T01n0001_019:0123c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故名曰堆壓地獄。",
        "translation": "This is why it's called the hell of crushing heaps.",
        "source": "T01n0001_019:0123c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，堆壓地獄有大鐵象，舉身火然，哮呼而來，蹴蹹罪人，宛轉其上，身體糜碎，膿血流出，苦毒辛酸，號咷悲叫。",
        "translation": "\"Furthermore, in the hell of crushing heaps, there's a huge iron elephant that raises its body in flames and roars, cupping and battering the sinner, twisting and turning him upward, pulverizing his body, spilling pus and blood, and causing him to scream and lament with bitterness and pain.",
        "source": "T01n0001_019:0123c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins haven't been completed, so he's kept from dying.",
        "source": "T01n0001_019:0123c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故名堆壓。",
        "translation": "That's why it's called a heap of crushing.",
        "source": "T01n0001_019:0123c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，堆壓地獄其中獄卒。",
        "translation": "\"Furthermore, in the hell of crushing, there are jailers.",
        "source": "T01n0001_019:0123c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捉諸罪人置於磨石中，以磨磨之，骨肉糜碎，膿血流出，苦毒辛酸，不可稱計。",
        "translation": "They catch sinners, put them under a grinding stone, and grind them down so that their bones and flesh are pulverized, pus and blood flow out, and they experience painful, venomous, and bitter sores that defy calculation.",
        "source": "T01n0001_019:0123c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其罪未畢，故使不死。",
        "translation": "Their sins haven't been completed, so they're not killed.",
        "source": "T01n0001_019:0123c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故名堆壓。",
        "translation": "That's why it's called \"pile crushing.",
        "source": "T01n0001_019:0123c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，堆壓獄卒捉彼罪人臥大石上，以大石壓，骨肉糜碎，膿血流出，苦痛辛酸，萬毒竝至。",
        "translation": "\"Furthermore, when the jailer for crushing piles of stones catches that sinner lying on a large stone and crushes him with it, his bones and flesh are pulverized, pus and blood flow out, and there's pain and bitterness and bitterness, and a myriad of poisons.",
        "source": "T01n0001_019:0123c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins haven't been completed, so he's prevented from dying.",
        "source": "T01n0001_019:0123c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故名堆壓。",
        "translation": "That's why it's called pile crushing.",
        "source": "T01n0001_019:0123c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，堆壓獄卒取彼罪人臥鐵臼中，以鐵杵擣從足至頭，皮肉糜碎，膿血流出，苦痛辛酸，萬毒竝至。",
        "translation": "\"Furthermore, when the jailer for crushing takes that sinner and puts him to sleep in an iron mortar with a hammer and pestle, the flesh and bones are pulverized, and pus and blood flow out, causing pain and bitterness, bitterness, and sourness, and a multitude of poisons.",
        "source": "T01n0001_019:0123c22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so he's not killed.",
        "source": "T01n0001_019:0123c24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故名堆壓。",
        "translation": "That's why it's called \"crushing.",
        "source": "T01n0001_019:0123c25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其彼罪人久受苦已，乃出堆壓地獄，慞惶馳走，求自救護，宿罪所牽，不覺忽至黑沙地獄，乃至寒氷地獄，然後命終，亦復如是。」",
        "translation": "After suffering for a long time, that sinner then emerges from the hell of crushing piles, perplexed and running, seeking to save himself, and tethered by past sins, he suddenly ends up in the hell of black sand or the hell of cold and ice without realizing it, and then his life ends, just like that.\"",
        "source": "T01n0001_019:0123c25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「叫喚大地獄有十六小地獄，周匝圍遶，各各縱廣五百由旬。",
        "translation": "The Buddha told the monks, \"The great hell of wailing has 16 small hells that are surrounded by a circumference, each 500 yojanas in length and breadth.",
        "source": "T01n0001_019:0123c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故名為叫喚地獄？",
        "translation": "Why is it called the hell of wailing?",
        "source": "T01n0001_019:0124a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其諸獄卒捉彼罪人擲大鑊中，熱湯涌沸，煮彼罪人，號咷叫喚，苦痛辛酸，萬毒竝至。",
        "translation": "Their jailers catch that offender and throw him into a large cauldron, where hot water boils over and cooks him, causing him to scream and wail, and causing him pain and suffering, as well as a multitude of poisons.",
        "source": "T01n0001_019:0124a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so he's not killed.",
        "source": "T01n0001_019:0124a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故名叫喚地獄。",
        "translation": "That's why it's called the hell of wailing.",
        "source": "T01n0001_019:0124a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，叫喚地獄其諸獄卒，取彼罪人擲大鐵瓮中，熱湯涌沸而煮罪人，號咷叫喚，苦切辛酸。",
        "translation": "\"Furthermore, the jailers of Wailing Hell take that sinner and toss him into a large metal pot, which boils hot water and boils him, screaming and wailing, and it's painful and bitter.",
        "source": "T01n0001_019:0124a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so he's not killed.",
        "source": "T01n0001_019:0124a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故名叫喚。",
        "translation": "That's why it's called wailing.",
        "source": "T01n0001_019:0124a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，叫喚地獄其諸獄卒，取彼罪人置大鐵鍑中，熱湯涌沸，煮彼罪人，號咷叫喚，苦痛辛酸。",
        "translation": "\"Furthermore, they summon the jailers in hell, take that sinner, put him in a large metal pot, boil hot water, and boil him, screaming and wailing, which is painful and bitter.",
        "source": "T01n0001_019:0124a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so he doesn't die.",
        "source": "T01n0001_019:0124a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故名叫喚。",
        "translation": "That's why it's called wailing.",
        "source": "T01n0001_019:0124a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，叫喚地獄其諸獄卒，取彼罪人擲小鍑中，熱湯涌沸，煮彼罪人，號咷叫喚，苦痛辛酸。",
        "translation": "\"Furthermore, they summon the jailers in hell, take that sinner and toss him into a small metal pot, boil hot water, and boil him, causing him to shout and scream with pain and bitterness.",
        "source": "T01n0001_019:0124a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so he doesn't die.",
        "source": "T01n0001_019:0124a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故名叫喚地獄。",
        "translation": "That's why it's called the hell of wailing.",
        "source": "T01n0001_019:0124a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，叫喚地獄其諸獄卒，取彼罪人擲大鏊上，反覆煎熬，號咷叫喚，苦痛辛酸。",
        "translation": "\"Furthermore, the jailers of the wailing hell take that sinner and toss him onto a large griddle, where he's repeatedly boiled and made to wail with pain and suffering.",
        "source": "T01n0001_019:0124a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so he's prevented from dying.",
        "source": "T01n0001_019:0124a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故名叫喚。",
        "translation": "That's why it's called wailing.",
        "source": "T01n0001_019:0124a15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "久受苦已，乃出叫喚地獄，慞惶馳走，求自救護，宿對所牽，不覺忽至黑沙地獄，乃至寒氷地獄，爾乃至終。」",
        "translation": "After suffering for a long time, they then leave the hell of wailing, perplexed and running, seeking to save themselves, and led by past enemies, and suddenly end up in the hell of black sand or the hell of cold and ice without realizing it.\"",
        "source": "T01n0001_019:0124a16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「大叫喚地獄有十六小獄，周匝圍遶。",
        "translation": "The Buddha told the monks, \"The hell of great wailing has 16 smaller hells that surround it.",
        "source": "T01n0001_019:0124a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故名為大叫喚地獄？",
        "translation": "Why is it called the hell of great wailing?",
        "source": "T01n0001_019:0124a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其諸獄卒取彼罪人著大鐵釜中，熱湯涌沸而煮罪人，號咷叫喚、大叫喚，苦痛辛酸，萬毒並至。",
        "translation": "The jailers take that criminal and put him in a large metal cauldron, which boils hot water and cooks him, screaming and shouting, causing pain and suffering, bitterness, and a myriad of poisons.",
        "source": "T01n0001_019:0124a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins haven't been completed, so he's kept from dying.",
        "source": "T01n0001_019:0124a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故名大叫喚地獄。",
        "translation": "That's why it's called the hell of great wailing.",
        "source": "T01n0001_019:0124a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大叫喚地獄其諸獄卒，取彼罪人擲大鐵瓮中，熱湯涌沸而煮罪人，號咷叫喚、大叫喚，苦切辛酸，萬毒並至。",
        "translation": "\"Furthermore, the jailers of the hell of great wailing take a criminal and throw him into a large metal pot, boil hot water, and boil him, screaming and shouting, which is painful, bitter, bitter, and full of poison.",
        "source": "T01n0001_019:0124a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins haven't been completed, so he's prevented from dying.",
        "source": "T01n0001_019:0124a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故名大叫喚地獄。",
        "translation": "That's why it's called the hell of great wailing.",
        "source": "T01n0001_019:0124a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大叫喚獄卒取彼罪人置鐵鑊中，熱湯涌沸，煮彼罪人，號咷叫喚，苦毒辛酸，萬毒並至。",
        "translation": "\"Furthermore, the jailer of great wailing takes that sinner and puts him in an iron wok, boils hot water, boils him, and cooks him, wailing and shouting, which is painful, bitter, bitter, and sour, and which brings a myriad of poisons.",
        "source": "T01n0001_019:0124a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so he's prevented from dying.",
        "source": "T01n0001_019:0124a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故名大叫喚地獄。",
        "translation": "That's why it's called the hell of great wailing.",
        "source": "T01n0001_019:0124a29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大叫喚地獄其諸獄卒，取彼罪人擲小鍑中，熱湯涌沸，煮彼罪人，號咷叫喚、大叫喚，苦痛辛酸，萬毒並至，故名大叫喚。",
        "translation": "\"Furthermore, the jailers of the hell of great wailing take that offender and toss him into a small pot, boiling hot water, boiling him, screaming and shouting, causing pain and suffering, bitterness, and sourness, and a myriad of poisons to reach him, which is why it's called the hell of great wailing.",
        "source": "T01n0001_019:0124b01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大叫喚地獄其諸獄卒，取彼罪人擲大鏊上，反覆煎熬，號咷叫喚、大叫喚，苦痛辛酸，萬毒並至。",
        "translation": "\"Furthermore, the jailers in the hell of great wailing take that sinner and toss him onto a large griddle, where he's repeatedly boiled, screaming and wailing, which causes pain and suffering, bitterness, and sourness, and a myriad of poisons.",
        "source": "T01n0001_019:0124b04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so he's not killed.",
        "source": "T01n0001_019:0124b06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故名大叫喚。",
        "translation": "That's why it's called a great wailing.",
        "source": "T01n0001_019:0124b06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "久受苦已，乃出大叫喚地獄，慞惶馳走，求自救護，宿對所牽，不覺忽至黑沙地獄，乃至寒氷地獄，爾乃命終。」",
        "translation": "After suffering for a long time, they then emerge from the hell of great wailing, perplexed and frantic, seeking to save themselves, and led by their past lives, and suddenly end up in the hell of black sand or even the hell of cold and ice without realizing it.\"",
        "source": "T01n0001_019:0124b07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「燒炙大地獄有十六小獄，周匝圍遶，何故名為燒炙大地獄？",
        "translation": "The Buddha told the monks, \"The great burning hell has 16 small hells that surround it, so why is it called the great burning hell?",
        "source": "T01n0001_019:0124b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，獄卒將諸罪人置鐵城中，其城火然，內外俱赤，燒炙罪人，皮肉燋爛，苦痛辛酸，萬毒並至。",
        "translation": "At the time, the jailer placed the sinners in a city of iron, which was on fire and red inside and out, burning and scorching the sinners, scorching their skin and flesh, and inflicting pain, bitterness, and a myriad of poisons.",
        "source": "T01n0001_019:0124b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins haven't been completed, so they don't die.",
        "source": "T01n0001_019:0124b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故名為燒炙地獄。",
        "translation": "It's therefore called the burning and scorching hell.",
        "source": "T01n0001_019:0124b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，燒炙地獄其諸獄卒，將彼罪人入鐵室內，其室火然，內外俱赤，燒炙罪人，皮肉燋爛，苦痛辛酸，萬毒並至。",
        "translation": "\"Furthermore, when the guards of that burning hell put a criminal inside an iron room, the room is on fire, red inside and out, and it burns him, scorching his skin and flesh, causing pain and suffering and sourness, and inflicting a myriad of poisons.",
        "source": "T01n0001_019:0124b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so he's not killed.",
        "source": "T01n0001_019:0124b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故名為燒炙地獄。",
        "translation": "It's therefore called the burning and scorching hell.",
        "source": "T01n0001_019:0124b17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，燒炙地獄其諸獄卒，取彼罪人著鐵樓上，其樓火然，內外俱赤，燒炙罪人，皮肉燋爛，苦痛辛酸，萬毒並至。",
        "translation": "\"Furthermore, when the guards of that burning hell take a criminal and put him on an iron tower, the tower is on fire, red inside and out, and it burns him, scorching his skin and flesh, causing pain and suffering, bitterness, and sourness, and a myriad of poisons to reach him.",
        "source": "T01n0001_019:0124b18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins haven't been completed, so he doesn't die.",
        "source": "T01n0001_019:0124b20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故名為燒炙地獄。",
        "translation": "It's therefore called the burning and scorching hell.",
        "source": "T01n0001_019:0124b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，燒炙地獄其諸獄卒，取彼罪人擲著大鐵陶中，其陶火燃，內外俱赤，燒炙罪人，皮肉燋爛，苦痛辛酸，萬毒並至。",
        "translation": "\"Furthermore, when the guards of that burning hell take a criminal and toss him into a large metal pottery, the pottery burns hot and red inside and out, scorching his skin and flesh, causing pain and suffering and sourness, and a myriad of poisons to reach him.",
        "source": "T01n0001_019:0124b21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins haven't been completed, so he's not killed.",
        "source": "T01n0001_019:0124b24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故名為燒炙地獄。",
        "translation": "It's therefore called the burning and scorching hell.",
        "source": "T01n0001_019:0124b25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，燒炙地獄其諸獄卒，取彼罪人擲大鏊上，其鏊火然，中外俱赤，燒炙罪人，皮肉燋爛，苦痛辛酸，萬毒並至。",
        "translation": "\"Furthermore, when the guards of the burning hell take a criminal and toss him onto a large griddle, the griddle burns red inside and out, scorching his skin and flesh, causing pain and suffering, bitterness, and sourness, and a myriad of poisons to reach him.",
        "source": "T01n0001_019:0124b25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins haven't been completed, so he's kept from dying.",
        "source": "T01n0001_019:0124b28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "久受苦已，乃出燒炙地獄，慞惶馳走，求自救護，宿罪所牽，不覺忽至黑沙地獄，乃至寒氷地獄，然後命終，亦復如是。」",
        "translation": "After suffering for a long time, they then leave the burning hell, perplexed and frantic, seeking to save themselves, and tethered by their past sins, they suddenly end up in the hell of black sand or even the cold and icy hell without realizing it, and then their life ends, just like that.\"",
        "source": "T01n0001_019:0124b28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「大燒炙地獄有十六小獄，周匝圍遶，各各縱廣五百由旬。",
        "translation": "The Buddha told the monks, \"The great scorching hell has 16 small hells that are surrounded by a circumference, each 500 yojanas in length and breadth.",
        "source": "T01n0001_019:0124c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名大燒炙地獄？",
        "translation": "What's the name of that great burning hell?",
        "source": "T01n0001_019:0124c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其諸獄卒將諸罪人置鐵城中，其城火然，內外俱赤，燒炙罪人，重大燒炙，皮肉燋爛，苦痛辛酸，萬毒並至。",
        "translation": "The jailers put the sinners in a metal city that's on fire, so red inside and out that it burns the sinners and roasts them so much that their skin and flesh are burned and rotted, and they experience pain, bitterness, and a multitude of poisons.",
        "source": "T01n0001_019:0124c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so they don't die.",
        "source": "T01n0001_019:0124c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故名為大燒炙地獄。",
        "translation": "Therefore, it's called the great burning hell.",
        "source": "T01n0001_019:0124c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大燒炙地獄其諸獄卒，將諸罪人入鐵室中，其室火燃，內外俱赤，燒炙罪人，重大燒炙，皮肉燋爛，苦痛辛酸，萬毒並至。",
        "translation": "\"Furthermore, the guards of that great burning hell put sinners into an iron room that's on fire and red inside and out, and they burn them so severely that their skin and flesh are burned and rotted, and they experience pain and bitterness and sourness, which are the result of a myriad of poisons.",
        "source": "T01n0001_019:0124c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so he doesn't die.",
        "source": "T01n0001_019:0124c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故名為大燒炙地獄。",
        "translation": "Therefore, it's called the great burning hell.",
        "source": "T01n0001_019:0124c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大燒炙地獄其諸獄卒，取彼罪人著鐵樓上，其樓火燃，內外俱赤，燒炙罪人，重大燒炙，皮肉燋爛，苦痛辛酸，萬毒並至。",
        "translation": "\"Furthermore, the guards of that great burning hell take that criminal and put him on an iron tower, which is on fire and red inside and out, and burn him so severely that his skin and flesh are burned and rotted, and he suffers from pain and bitterness and sourness and a myriad of poisons.",
        "source": "T01n0001_019:0124c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so he doesn't die.",
        "source": "T01n0001_019:0124c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故名曰大燒炙地獄。",
        "translation": "This is why it's called the great scorching hell.",
        "source": "T01n0001_019:0124c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大燒炙地獄其諸獄卒，取彼罪人著大鐵陶中，其陶火然，內外俱赤，燒炙罪人，重大燒炙，苦痛辛酸，萬毒並至。",
        "translation": "\"Furthermore, the guards of that great burning hell take a criminal and put him in a large metal pottery that's glowing and red inside and out, and they burn him, scorching him severely, causing pain, suffering, bitterness, and a multitude of poisons to reach him.",
        "source": "T01n0001_019:0124c16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so he's not killed.",
        "source": "T01n0001_019:0124c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故名為大燒炙地獄。",
        "translation": "Therefore, it's called the great burning hell.",
        "source": "T01n0001_019:0124c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大燒炙地獄中自然有大火坑，火焰熾盛，其坑兩岸有大火山，其諸獄卒捉彼罪人貫鐵叉上，竪著火中，燒炙其身，重大燒炙，皮肉燋爛，苦痛辛酸，萬毒並至。",
        "translation": "\"Furthermore, in the great scorching hell, there's naturally a large fire pit with a blazing fire, and on either side of that pit there's a large volcano. The jailers grab that sinner, put him on an iron fork, hold him up to the fire, and burn his body, which causes major burns, scorching skin and flesh, painful, bitter, and sour pain, and a myriad of poisons.",
        "source": "T01n0001_019:0124c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins haven't been completed, so he's prevented from dying.",
        "source": "T01n0001_019:0124c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "久受苦已，然後乃出大燒炙地獄，慞惶馳走，求自救護，宿對所牽，不覺忽至黑沙地獄，乃至寒氷地獄，爾乃命終，亦復如是。」",
        "translation": "After suffering for a long time, they then emerge from the great burning hell, perplexed and frantic, seeking to save themselves, and tethered by past enemies, they suddenly end up in the hell of black sand or even the cold and icy hell without realizing it, and then their life ends, just like that.\"",
        "source": "T01n0001_019:0124c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「無間大地獄有十六小獄，周匝圍遶，各各縱廣五百由旬。",
        "translation": "The Buddha told the monks, \"The great hell of no-separation has 16 small hells that are surrounded by a circumference, each 500 yojanas in length and breadth.",
        "source": "T01n0001_019:0124c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名無間地獄？",
        "translation": "What is the name of the great hell of no-separation?",
        "source": "T01n0001_019:0124c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其諸獄卒捉彼罪人剝其皮，從足至頂，即以其皮纏罪人身，著火車輪，疾駕火車，輾熱鐵地，周行往返，身體碎爛，皮肉墮落，苦痛辛酸，萬毒並至。",
        "translation": "The guards take that sinner, strip off his skin, and wrap it around his body from his feet to his head. They put it on a train wheel, drive it quickly over hot iron ground, and move it around and back, causing his body to break apart and his skin to fall off, which is painful, pungent, and full of all kinds of poison.",
        "source": "T01n0001_019:0124c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "Because their remaining sins haven't been completed, they won't die.",
        "source": "T01n0001_019:0125a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故名為無間地獄。",
        "translation": "Therefore, it's called the great unremitting hell.",
        "source": "T01n0001_019:0125a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，無間大地獄有大鐵城，其城四面有大火起，東焰至西，西焰至東，南焰至北，北焰至南，上焰至下，下焰至上，焰熾迴遑，無間空處，罪人在中，東西馳走，燒炙其身，皮肉燋爛，苦痛辛酸，萬毒並至。",
        "translation": "\"Furthermore, in the great hell of unremitting hell, there's a large iron city that's surrounded by a great fire that rises from the east to the west, the west to the east, the south to the north, the north to the south, the top to the bottom, and the bottom to the top, with the flames blazing and circling, and there's no room or space where sinners ride east and west, burning and scorching their bodies, scorching their skin and flesh, causing pain and suffering, and inflicting a myriad of poisons.",
        "source": "T01n0001_019:0125a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so he doesn't die.",
        "source": "T01n0001_019:0125a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故名為無間地獄。",
        "translation": "Therefore, it's called the great unremitting hell.",
        "source": "T01n0001_019:0125a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，無間大地獄中有鐵城，火起洞然，罪人在中，火焰燎身，皮肉燋爛，苦痛辛酸，萬毒並至。",
        "translation": "\"Furthermore, in the great hell of unremitting hell there's an iron city that caves in when a fire rises, and a sinner is caught in it, which burns his body, scorches his skin and flesh, causes pain and bitterness, and inflicts a myriad of poisons.",
        "source": "T01n0001_019:0125a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so he doesn't die.",
        "source": "T01n0001_019:0125a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故名為無間地獄。",
        "translation": "Therefore, it's called the hell of no-separation.",
        "source": "T01n0001_019:0125a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，大無間地獄罪人在中，久乃門開，其諸罪人[馬*奔]走往趣。",
        "translation": "\"Furthermore, when the gates of the great unremitting hell are opened after a long time, those sinners [horse*run] walk away and go to it.",
        "source": "T01n0001_019:0125a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼當走時，身諸肢節，皆火焰出，猶如力士執大草炬逆風而走，其焰熾然。",
        "translation": "As they walk, flames come out of their limbs like a strong man holding a large straw torch and walking against the wind, and its flame is blazing.",
        "source": "T01n0001_019:0125a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "罪人走時，亦復如是。",
        "translation": "When a sinner walks, it's likewise.",
        "source": "T01n0001_019:0125a17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "走欲至門，門自然閉，罪人[跳-兆+匍]蹈，伏熱鐵地，燒炙其身，皮肉燋爛，苦痛辛酸，萬毒並至。",
        "translation": "When he walks and wants to reach the door, the door naturally closes, and the offender [jumps - trillion + prostrates] falls to the ground on hot iron, which burns his body and scorches his skin and flesh, causing pain and suffering and aches, and a myriad of poisons.",
        "source": "T01n0001_019:0125a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘罪未畢，故使不死。",
        "translation": "The remaining sins have yet to be completed, so he's prevented from dying.",
        "source": "T01n0001_019:0125a19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故名為無間地獄。",
        "translation": "Therefore, it's called the unremitting hell.",
        "source": "T01n0001_019:0125a20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，無間地獄其中罪人，舉目所見，但見惡色，耳有所聞，但聞惡聲，鼻有所聞，但聞臭惡，身有所觸，但觸苦痛，意有所念，但念惡法。",
        "translation": "\"Furthermore, in the hell of unremitting hell, a criminal sees only bad colors with his eyes, he hears only bad sounds with his ears, smells only bad odors with his nose, touches only painful sensations with his body, and thinks only bad thoughts with his mind.",
        "source": "T01n0001_019:0125a20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又其罪人彈指之頃，無不苦時，故名無間地獄。",
        "translation": "There's no time when a sinner snaps his fingers that isn't painful, which is why it's called the unremitting hell.",
        "source": "T01n0001_019:0125a23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中眾生久受苦已，從無間出，慞惶馳走，求自救護，宿對所牽，不覺忽到黑沙地獄，乃至寒氷地獄，爾乃命終，亦復如是。」",
        "translation": "After suffering for a long time, sentient beings there emerge from the unremitting hell, perplexed and frantic, seeking to save themselves, and tethered by past lives, they suddenly end up in the hell of black sand or even the cold and icy hell without realizing it, and then their lives end, just like that.\"",
        "source": "T01n0001_019:0125a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊即說頌曰：「身為不善業，　　口意亦不善，　斯墮想地獄，　　怖懼衣毛竪。",
        "translation": "The Bhagavān then spoke a verse, \"Being unwholesome in body and unwholesome in speech and thought, they fall into the hell of perception and their hair stands on end in fear.",
        "source": "T01n0001_019:0125a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　惡意向父母，　　佛及諸聲聞，　則墮黑繩獄，　　苦痛不可稱。",
        "translation": "Their bad intentions, parents, buddhas, and direct disciples then fall into the black-rope hell, where their pain is indescribable.",
        "source": "T01n0001_019:0125b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　但造三惡業，　　不修三善行，　墮堆壓地獄，　　苦痛不可稱。",
        "translation": "Only creating three bad actions and not cultivating three good deeds, they fall into the hell of crushing pressure, where the pain and suffering are indescribable.",
        "source": "T01n0001_019:0125b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　瞋恚懷毒害，　　殺生血污手，　造諸雜惡行，　　墮叫喚地獄。",
        "translation": "They are poisoned by anger, stain their hands with the blood of killing, commit various bad deeds, and fall into the hell of wailing.",
        "source": "T01n0001_019:0125b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常習眾邪見，　　為愛網所覆，　造此卑陋行，　　墮大叫喚獄。",
        "translation": "Accumulated with many mistaken views and covered by the web of desire, he commits these base deeds and falls into the hell of great wailing.",
        "source": "T01n0001_019:0125b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常為燒炙行，　　燒炙諸眾生，　墮燒炙地獄，　　長夜受燒炙。",
        "translation": "He always does deeds that burn, scorching sentient beings and falling into the burning hell, where he'll be burned for a long time.",
        "source": "T01n0001_019:0125b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　捨於善果業，　　善果清淨道，　為眾弊惡行，　　墮大燒炙獄。",
        "translation": "He'll abandon actions that bring good results and the pure path that brings good results, and then he'll fall into the great burning hell for his many bad deeds.",
        "source": "T01n0001_019:0125b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為極重罪行，　　必生惡趣業，　墮無間地獄，　　受罪不可稱。",
        "translation": "For the most serious crimes, they'll surely be born in the karma of bad destinies and fall into the hell of unremitting hell, where they'll suffer unspeakable punishment.",
        "source": "T01n0001_019:0125b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　想及黑繩獄，　　堆壓二叫喚，　燒炙大燒炙，　　無間為第八。",
        "translation": "He imagines the black-rope hell, the two calls of the heap, the great burning scorch, and the eighth hell of unremitting hell.",
        "source": "T01n0001_019:0125b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此八大地獄，　　洞然火光色，　斯由宿惡殃，　　小獄有十六。」",
        "translation": "These eight great hells are engulfed in the color of fire, and because of this past bad karma, there are 16 lesser hells.\"",
        "source": "T01n0001_019:0125b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「彼二大金剛山間有大風起，名為增佉，若使此風來至此四天下及八千天下者，吹此大地及諸名山須彌山王去地十里，或至百里，飛颺空中，皆悉糜碎。",
        "translation": "The Buddha told the monks, \"A great wind called zonkha arises between those two great vajra mountains, and if that wind were to reach these four worlds and 8,000 worlds, it would blow this earth and those famous mountains Sumeru the king of mountains 10 miles or a hundred miles from the ground and send them flying through the air, crushing them all to pieces.",
        "source": "T01n0001_019:0125b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如壯士，手把輕糠散於空中。",
        "translation": "It's like a strong man holding light chaff in his hand and scattering it in the air.",
        "source": "T01n0001_019:0125b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼大風力，若使來者，吹此天下，亦復如是。",
        "translation": "That great wind power, if it were to cause someone to come, would blow the whole world, and so it would be.",
        "source": "T01n0001_019:0125b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由有二大金剛山遮止此風，故使不來。",
        "translation": "Because there are two great vajra mountains that stop that wind, it won't come.",
        "source": "T01n0001_019:0125b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T01n0001_019:0125b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知此金剛山多所饒益，亦是眾生行報所致。",
        "translation": "You should know that this diamond mountain is full of benefits, which are also the result of the actions of sentient beings.",
        "source": "T01n0001_019:0125b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又彼二山間風，焰熾猛熱，若使彼風來至此四天下者，其中眾生、山河、江海、草木、叢林皆當燋枯。",
        "translation": "\"Furthermore, when the wind between those two mountains is fiery and hot, if that wind were to reach these four heavens, sentient beings, mountains, rivers, seas, grass, trees, and forests there would all wither.",
        "source": "T01n0001_019:0125b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如盛夏斷生濡草，置於日中，尋時萎枯。",
        "translation": "It's like cutting off the growth of wet grass in the middle of summer and leaving it in the sun to wither when you look at it.",
        "source": "T01n0001_019:0125c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼風如是，若使來至此世界，熱氣燒炙，亦復如是。",
        "translation": "So it is with that wind, and so it would be if someone were to come to this world and be burned by hot air.",
        "source": "T01n0001_019:0125c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此二金剛山遮止此風，故使不來。",
        "translation": "Because these two vajra mountains stop that wind, it won't come.",
        "source": "T01n0001_019:0125c03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T01n0001_019:0125c04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知此金剛山多所饒益，亦是眾生行報所致。",
        "translation": "You should know that this diamond mountain is full of benefits, and it's the result of the rewards of sentient beings' actions.",
        "source": "T01n0001_019:0125c04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又彼二山間風，臭處不淨，腥穢酷烈，若使來至此天下者，熏此眾生皆當失目。",
        "translation": "\"Furthermore, the winds between those two mountains have such an impure stench and such a foul, violent smell that if someone were to come under this heaven, the perfuming of those sentient beings would cause them to lose their eyes.",
        "source": "T01n0001_019:0125c05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此二大金剛山遮止此風，故使不來。",
        "translation": "Because these two great adamantine mountains stop that wind, they won't allow people to come.",
        "source": "T01n0001_019:0125c07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T01n0001_019:0125c08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知此金剛山多所饒益，亦是眾生行報所致。",
        "translation": "You should know that this diamond mountain is full of benefits, and it's the result of the rewards of sentient beings' actions.",
        "source": "T01n0001_019:0125c08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又彼二山中間復有十地獄：一名厚雲，二名無雲，三名呵呵，四名奈何，五名羊鳴，六名須乾提，七名優鉢羅，八名拘物頭，九名分陀利，十名鉢頭摩。",
        "translation": "\"Also, between those two mountains are ten more hells: one is Houyun, two are Wuyun, three are Hehe, four are Naihe, five are Yamsong, six are Sugandhā, seven are Upalā, eight are Kuśinagara, nine are Potala, and ten are Padma.",
        "source": "T01n0001_019:0125c09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何厚雲地獄？",
        "translation": "What is the cloudy hell?",
        "source": "T01n0001_019:0125c12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其獄罪人自然生身，譬如厚雲，故名厚雲。",
        "translation": "The body of that hell-bent sinner is naturally born like a thick cloud, so it's called a thick cloud.",
        "source": "T01n0001_019:0125c13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名曰無雲？",
        "translation": "How is it called cloudless?",
        "source": "T01n0001_019:0125c14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其彼獄中受罪眾生，自然生身，猶如段肉，故名無雲。",
        "translation": "Those sentient beings who suffer from the sins of hell naturally produce a body that's like a piece of flesh, so they're called cloudless.",
        "source": "T01n0001_019:0125c14_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名呵呵？",
        "translation": "What do they call it?",
        "source": "T01n0001_019:0125c15_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其地獄中受罪眾生，苦痛切身，皆稱呵呵，故名呵呵。",
        "translation": "The suffering and pain of those sentient beings in hell who are subject to misfortune are all called huh, so they're called huh.",
        "source": "T01n0001_019:0125c16_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名奈何？",
        "translation": "What do they call it?",
        "source": "T01n0001_019:0125c17_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其地獄中受罪眾生，苦痛酸切，無所歸依，皆稱奈何，故名奈何。",
        "translation": "Those sentient beings in hell who are subject to pain and suffering and have nowhere to turn all say, \"Naiḥ,\" and so they're called \"Naiḥ.",
        "source": "T01n0001_019:0125c17_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名羊鳴？",
        "translation": "What's the name Goat Whistle?",
        "source": "T01n0001_019:0125c19_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其地獄中受罪眾生，苦痛切身，欲舉聲語，舌不能轉，直如羊鳴，故名羊鳴。",
        "translation": "Those sentient beings in hell who are subject to pain and suffering that cuts through their bodies want to lift their voices and speak, but their tongues can't turn, and they become like sheep that cry, which is why they're called sheep that cry.",
        "source": "T01n0001_019:0125c19_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名須乾提？",
        "translation": "What is the name *Sugandhaka?",
        "source": "T01n0001_019:0125c21_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其地獄中舉獄皆黑，如須乾提華色，故名須乾提。",
        "translation": "All the hells in his hell are black like the color of the saugandhika flower, which is why he's called saugandhika.",
        "source": "T01n0001_019:0125c21_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名優鉢羅？",
        "translation": "What is the name Upāli?",
        "source": "T01n0001_019:0125c22_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其地獄中舉獄皆青，如優鉢羅華，故名優鉢羅。",
        "translation": "All the hells in his hell are blue like the upa-ra flower, which is why it's called upa-ra.",
        "source": "T01n0001_019:0125c23_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名俱物頭？",
        "translation": "What's the name of this place?",
        "source": "T01n0001_019:0125c24_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其地獄中舉獄皆紅，如俱物頭華色，故名俱物頭。",
        "translation": "All the hells in his hell are red like the color of a cluster of flowers, which is why he's called a cluster of clusters.",
        "source": "T01n0001_019:0125c24_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名分陀利？",
        "translation": "What's the name Fandanīya?",
        "source": "T01n0001_019:0125c25_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其地獄中舉獄皆白，如分陀利華色，故名分陀利。",
        "translation": "All the hells in his hell are white like the color of a puṇḍarīka, which is why it's called puṇḍarīka.",
        "source": "T01n0001_019:0125c26_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名鉢頭摩？",
        "translation": "What is the name padma?",
        "source": "T01n0001_019:0125c27_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其地獄中舉獄皆赤，如鉢頭摩華色，故名鉢頭摩。」",
        "translation": "All the hells in that hell are red like the color of a padma flower, which is why it's called padma.\"",
        "source": "T01n0001_019:0125c27_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「喻如有篅受六十四斛，滿中胡麻，有人百歲持一麻去，如是至盡，厚雲地獄受罪未竟，如二十厚雲地獄壽與一無雲地獄壽等，如二十無雲地獄壽與一呵呵地獄壽等，如二十呵呵地獄壽與一奈何地獄壽等，如二十奈何地獄壽與一羊鳴地獄壽等，如二十羊鳴地獄壽與一須乾提地獄壽等，如二十須乾提地獄壽與一優鉢羅地獄壽等，如二十優鉢羅地獄壽與一拘物頭地獄壽等，如二十拘物頭地獄壽與一分陀利地獄壽等，如二十分陀利地獄壽與一鉢頭摩地獄壽等，如二十鉢頭摩地獄壽，名一中劫，如二十中劫，名一大劫。",
        "translation": "佛告比丘：「喻如有篅受六十四斛，滿中胡麻，有人百歲持一麻去，如是至盡，厚雲地獄受罪未竟，如二十厚雲地獄壽與一無雲地獄壽等，如二十無雲地獄壽與一呵呵地獄壽等，如二十呵呵地獄壽與一奈何地獄壽等，如二十奈何地獄壽與一羊鳴地獄壽等，如二十羊鳴地獄壽與一須乾提地獄壽等，如二十須乾提地獄壽與一優鉢羅地獄壽等，如二十優鉢羅地獄壽與一拘物頭地獄壽等，如二十拘物頭地獄壽與一分陀利地獄壽等，如二十分陀利地獄壽與一鉢頭摩地獄壽等，如二十鉢頭摩地獄壽，名一中劫，如二十中劫，名一大劫。",
        "source": "T01n0001_019:0125c29_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鉢頭摩地獄中火焰熱熾盛，罪人去火一百由旬，火已燒炙；去六十由旬，兩耳已聾，無所聞知；去五十由旬，兩目已盲，無所復見。",
        "translation": "When he goes away for 60 leagues, his ears become deaf and he doesn't hear a thing, and when he goes away for 50 leagues, his eyes become blind and he doesn't see anything again.",
        "source": "T01n0001_019:0126a13_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞿波梨比丘已懷惡心，謗舍利弗、目犍連，身壞命終，墮此鉢頭摩地獄中。",
        "translation": "With evil intentions, the monk Gopalli had denigrated Śāriputra and Maudgalyāyana, and he was cast into this hell of Padma when his body broke up and his life ended.",
        "source": "T01n0001_019:0126a16_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，梵王說此偈言：「『夫士之生，　　斧在口中，　　所以斬身，　　由其惡口。",
        "translation": "\"It was then that the king of Brahmā spoke this verse, \"A man is born with the axe in his mouth, and that's why he cuts off his body because of his bad breath.",
        "source": "T01n0001_019:0126a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　應毀者譽，　　應譽者毀，　　口為惡業，　　身受其罪。",
        "translation": "He praises those who should be praised and disparages those who should be praised, and he does bad actions with his mouth, and his body suffers the consequences.",
        "source": "T01n0001_019:0126a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　技術取財，　　其過薄少，　　毀謗賢聖，　　其罪甚重。",
        "translation": "Their skill in acquiring possessions is slight, and their misdeeds of denigrating the good and the noble are grave.",
        "source": "T01n0001_019:0126a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　百千無雲壽，　　四十一雲壽，　　謗聖受斯殃，　　由心口為惡。』」",
        "translation": "For a hundred thousand cloudless lifetimes or forty-one cloudy lifetimes, slandering sages suffers because the mind and mouth do evil things.'\"",
        "source": "T01n0001_019:0126a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「彼梵天說如是偈，為真正言，佛所印可。",
        "translation": "The Buddha told the monks, \"That Brahmā spoke this verse, which is true speech and was approved by the Buddha.",
        "source": "T01n0001_019:0126a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T01n0001_019:0126a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今如來、至真、等正覺亦說此義。",
        "translation": "\"Now, the Tathāgata, the supreme truth, and the perfectly enlightened one also explain this meaning.",
        "source": "T01n0001_019:0126a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「夫士之生，　　斧在口中，　所以斬身，　　由其惡言。",
        "translation": "\"A man is born with the axe in his mouth, which cuts off his body because of his bad words.",
        "source": "T01n0001_019:0126b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應毀者譽，　　應譽者毀，　口為惡業，　　身受其罪。",
        "translation": "He praises those who should be praised and disparages those who should be praised, and his mouth does bad actions, which cause his body to suffer consequences.",
        "source": "T01n0001_019:0126b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　技術取財，　　其過薄少，　毀謗賢聖，　　其罪甚重。",
        "translation": "Their skill in acquiring possessions is slight, and their misdeeds of disparaging good and noble people are serious.",
        "source": "T01n0001_019:0126b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　百千無雲壽，　　四十一雲壽，　謗聖受斯殃，　　由心口為惡。」",
        "translation": "For a hundred thousand cloudless lifetimes or forty-one cloudy lifetimes, slandering a sage suffers because the mind and mouth do evil.\"",
        "source": "T01n0001_019:0126b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「閻浮提南大金剛山內，有閻羅王宮，王所治處縱廣六千由旬，其城七重，七重欄楯、七重羅網、七重行樹，乃至無數眾鳥相和悲鳴，亦復如是。",
        "translation": "The Buddha told the monks, \"South of Jambudvīpa on Mount Vajra there's the palace of King Yama, whose dominion is 6,000 leagues wide and whose city is seven stories long, with seven layers of railing, seven layers of netting, seven layers of rows of trees, and countless birds that sing in harmony and pity, just like that.",
        "source": "T01n0001_019:0126b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然彼閻羅王晝夜三時，有大銅鑊自然在前。",
        "translation": "Still, during the three hours of the day and night, that king Yama has a large copper cauldron naturally located in front of him.",
        "source": "T01n0001_019:0126b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若鑊出宮內，王見畏怖，捨出宮外。",
        "translation": "When the cauldron emerges from inside the palace, the king is terrified and leaves the palace.",
        "source": "T01n0001_019:0126b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若鑊出宮外，王見畏怖，捨入宮內。",
        "translation": "If the cauldron comes out of the palace, the king is terrified and goes back inside the palace.",
        "source": "T01n0001_019:0126b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有大獄卒，捉閻羅王臥熱鐵上，以鐵鈎擗口使開，洋銅灌之，燒其脣舌，從咽至腹，通徹下過，無不燋爛。",
        "translation": "A great jailer catches King Yama lying on a hot iron, opens his mouth with an iron hook, pours foreign copper over it, burns his lips and tongue, and sends it all the way down from his throat to his belly, where it doesn't fail to scorch.",
        "source": "T01n0001_019:0126b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受罪訖已，復與諸婇女共相娛樂。",
        "translation": "After he finished his punishment, he returned to entertain the women together.",
        "source": "T01n0001_019:0126b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸大臣同受福者，亦復如是。」",
        "translation": "Those ministers who received the blessing together were likewise.\"",
        "source": "T01n0001_019:0126b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「有三使者，云何為三？",
        "translation": "The Buddha told the monks, \"What are the three messengers?",
        "source": "T01n0001_019:0126b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者老，二者病，三者死。",
        "translation": "One is old age, two are sick, and three are dead.",
        "source": "T01n0001_019:0126b20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有眾生身行惡，口言惡，心念惡，身壞命終，墮地獄中。",
        "translation": "A sentient being who does evil deeds, speaks evil words, and thinks evil thoughts will be destined to fall into hell when his body breaks up and his life ends.",
        "source": "T01n0001_019:0126b20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獄卒將此罪人詣閻羅王所，到已，白言：『此是天使所召也，唯願大王善問其辭。』",
        "translation": "The jailer sends this criminal to King Yama, and when he arrives, he says, 'This is the angel who summoned him; may the king ask him nicely about his words.'",
        "source": "T01n0001_019:0126b21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王問罪人言：『汝不見初使耶？』",
        "translation": "The king asked the criminal, 'Haven't you seen the first messenger?'",
        "source": "T01n0001_019:0126b23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "罪人報言：『我不見也。』",
        "translation": "The offender replied, 'I haven't seen it.'",
        "source": "T01n0001_019:0126b24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王復告曰：『汝在人中時，頗見老人頭白齒落，目視矇矇，皮緩肌[月*曷]，僂脊柱杖，呻吟而行，身體戰掉，氣力衰微。",
        "translation": "The king again told him, 'When you were among the people, did you see an old man with a white head and missing teeth, whose eyes were dulled, whose skin was loose and muscles [moons*has], whose back was bent over a staff, who was groaning and walking, whose body was torn, and whose energy was weak?",
        "source": "T01n0001_019:0126b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見此人不？』",
        "translation": "Do you see this person?'",
        "source": "T01n0001_019:0126b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "罪人言：『見。』",
        "translation": "The offender said, 'I see.'",
        "source": "T01n0001_019:0126b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王復告曰：『汝何不自念：「我亦如是。」』",
        "translation": "The king again told him, 'Why don't you think to yourself, 'So am I.'",
        "source": "T01n0001_019:0126b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人報言：『我時放逸，不自覺知。』",
        "translation": "That person replied, 'I was careless and didn't realize it.'",
        "source": "T01n0001_019:0126b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王復語言：『汝自放逸，不能修身、口、意，改惡從善，今當令汝知放逸苦。』",
        "translation": "The king then said, 'You yourself were careless and couldn't cultivate your body, speech, or mind to change from bad to good; now I will make you know the suffering of carelessness.'",
        "source": "T01n0001_019:0126b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王又告言：『今汝受罪，非父母過，非兄弟過，亦非天帝，亦非先祖，亦非知識、僮僕、使人，亦非沙門、婆羅門過。",
        "translation": "The king also told them, 'Now, you've committed a sin that wasn't the fault of your father and mother, not your brother's fault, not the gods, not your ancestors, not your teachers, not your servants, not your messengers, and not the fault of ascetics or priests.",
        "source": "T01n0001_019:0126c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝自有惡，汝今自受。』",
        "translation": "You have your own faults, and now you'll accept them.'",
        "source": "T01n0001_019:0126c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，閻羅王以第一天使問罪人已，復以第二天使問罪人言：『云何汝不見第二天使耶？』",
        "translation": "\"After he questioned the offender with the first messenger, King Yama then questioned him with the second messenger, saying, 'Why haven't you seen the second messenger?'",
        "source": "T01n0001_019:0126c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『不見。』",
        "translation": "He said, 'I don't see it.'",
        "source": "T01n0001_019:0126c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王又問言：『汝本為人時，頗見人疾病困篤，臥著牀褥，屎尿臭處，身臥其上，不能起居，飲食須人，百節酸疼，流淚呻吟，不能言語。",
        "translation": "The king also asked, 'When you were a human being, did you often see people who were sick and distressed, lying on beds and mats, smelling of feces and urine, lying on top of them, unable to get up and go to sleep, needing food and drink, having pain in their 100 joints, weeping and groaning, and unable to speak?",
        "source": "T01n0001_019:0126c07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見是不？』",
        "translation": "Do you see that?'",
        "source": "T01n0001_019:0126c10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『見。』",
        "translation": "He replied, 'I see.'",
        "source": "T01n0001_019:0126c10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王又報言：『汝何不自念：「如此病苦，我亦當爾？」』",
        "translation": "The king also replied, 'Why don't you think to yourself, \"Such illness and suffering will be mine, too?\"'",
        "source": "T01n0001_019:0126c10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "罪人報言：『我時放逸，不自覺知。』",
        "translation": "The offender replies, 'I was careless and didn't know it.'",
        "source": "T01n0001_019:0126c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王又語言：『汝自放逸，不能修身、口、意，改惡從善，今當令汝知放逸苦。』",
        "translation": "The king also said, 'You yourself were careless and couldn't cultivate your body, speech, or mind to change from bad to good; now I will make you know the pain of carelessness.'",
        "source": "T01n0001_019:0126c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王又告言：『今汝受罪，非父母過，非兄弟過，亦非天帝過，亦非先祖，亦非知識、僮僕、使人，亦非沙門、婆羅門過。",
        "translation": "The king also told them, 'Now, you've committed a sin that wasn't the fault of your father and mother, brother, god, ancestor, friend, servant, or servant, or ascetic or brāhmaṇa.",
        "source": "T01n0001_019:0126c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝自為惡，汝今自受。』",
        "translation": "You did your own evil, and now you'll accept it.'",
        "source": "T01n0001_019:0126c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，閻羅王以第二天使問罪人已，復以第三天使問罪人言：『云何汝不見第三天使耶？』",
        "translation": "\"After he questioned the offender with the second heavenly messenger, King Yama then questioned him with the third heavenly messenger, saying, 'Why haven't you seen the third heavenly messenger?'",
        "source": "T01n0001_019:0126c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『不見。』",
        "translation": "He replied, 'I don't see it.'",
        "source": "T01n0001_019:0126c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王又問言：『汝本為人時，頗見人死，身壞命終，諸根永滅，身體挺直，猶如枯木，捐棄塚間，鳥獸所食，或衣棺槨，或以火燒。",
        "translation": "The king also asked, 'When you were a human being, did you often see people die, their bodies disintegrate and their lives end, their faculties disappear forever, and their bodies are upright, like withered wood, which is discarded in a tomb, eaten by birds and animals, or clothed in coffins or burned by fire?'",
        "source": "T01n0001_019:0126c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見是不？』",
        "translation": "Do you see that?'",
        "source": "T01n0001_019:0126c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "罪人報曰：『實見。』",
        "translation": "The offender replied, 'I really see it.'",
        "source": "T01n0001_019:0126c22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王又報言：『汝何不自念：「我亦當死，與彼無異。」』",
        "translation": "The king also reported, 'Why don't you think to yourself, 'I'll die, too, no different from that.'",
        "source": "T01n0001_019:0126c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "罪人報言：『我時放逸，不自覺知。』",
        "translation": "The offender replied, 'I was careless and didn't know it myself.'",
        "source": "T01n0001_019:0126c24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王復語言：『汝自放逸，不能修身、口、意，改惡從善，今當令汝知放逸苦。』",
        "translation": "The king then said, 'You yourself were careless and couldn't cultivate your body, speech, or mind to change from bad to good; now I will make you know the pain of carelessness.'",
        "source": "T01n0001_019:0126c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王又告言：『汝今受罪，非父母過，非兄弟過，亦非天帝，亦非先祖，亦非知識、僮僕、使人，亦非沙門、婆羅門過。",
        "translation": "The king also told him, 'The transgression you've suffered now is not the fault of your father and mother, not the fault of your brothers, not the gods, not your ancestors, not your teachers, not your servants, not your messengers, and not the fault of ascetics or priests.",
        "source": "T01n0001_019:0126c26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝自為惡，汝今自受。』",
        "translation": "You did your own evil, and now you'll accept it.'",
        "source": "T01n0001_019:0126c29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，閻羅王以三天使具詰問已，即付獄卒。",
        "translation": "After he had been questioned by the three messengers, King Yama then sent him to the jailer.",
        "source": "T01n0001_019:0126c29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼獄卒即將罪人詣大地獄，其大地獄縱廣百由旬，下深百由旬。」",
        "translation": "The jailer then escorted the criminal to the great hell, which is a hundred leagues wide and a hundred leagues deep down.\"",
        "source": "T01n0001_019:0127a01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊即說偈言：「四方有四門，　　巷陌皆相當，　以鐵為獄牆，　　上覆鐵羅網。",
        "translation": "The Bhagavān then spoke a verse, saying, \"There are four gates in each direction, and the alleys and streets are all similar; the walls of that hell are made of iron, and they're covered with a net of iron.",
        "source": "T01n0001_019:0127a03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以鐵為下地，　　自然火焰出，　縱廣百由旬，　　安住不傾動。",
        "translation": "Using iron as the lower ground, a natural flame rises up that's a hundred leagues wide and remains stable and untouched.",
        "source": "T01n0001_019:0127a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　黑焰熢[火*孛]起，　　赫烈難可覩，　小獄有十六，　　火熾由行惡。」",
        "translation": "A black flame [fire*coal] arises, so fierce it's hard to see. There are 16 small hells, and their fires are blazing because of bad behavior.\"",
        "source": "T01n0001_019:0127a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「時，閻羅王自生念言：『世間眾生迷惑無識，身為惡行，口、意為惡，其後命終，少有不受此苦。",
        "translation": "The Buddha told the monks, \"Then, King Yama himself had this thought, 'Worldly beings are deluded without consciousness, commit bad deeds in body, and have bad words and thoughts, and then when their lives end, few of them won't suffer from this.",
        "source": "T01n0001_019:0127a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間眾生若能改惡，修身、口、意為善行者，命終受樂，如彼天神。",
        "translation": "If sentient beings in the world could reform their evil ways and cultivate good deeds in body, speech, and thought, they'd experience happiness at the end of their lives, just like those gods.",
        "source": "T01n0001_019:0127a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若命終生人中者，若遇如來，當於正法中剃除鬚髮，服三法衣，出家修道，以清淨信修淨梵行，所作已辦，斷除生死，於現法中自身作證，不受後有。』」",
        "translation": "If I were to meet the Tathāgata and be born among humans at the end of my life, I would shave off my hair, put on the three dharma robes, leave home and train, cultivate pure religious practices with pure faith, perform the task, end birth-and-death, and realize for myself in the present life that I won't be subject to a later existence.'\"",
        "source": "T01n0001_019:0127a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈頌曰：「雖見天使者，　　而猶為放逸，　其人常懷憂，　　生於卑賤處。",
        "translation": "The Bhagavān then spoke in verse, \"Even though he sees a messenger from heaven, he still becomes careless, always harboring sadness, and is born in a lowly place.",
        "source": "T01n0001_019:0127a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有智慧人，　　見於天使者，　親近賢聖法，　　而不為放逸。",
        "translation": "Suppose there's a wise person who sees a messenger from heaven and gets close to the noble teaching, but doesn't become careless.",
        "source": "T01n0001_019:0127a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見受生恐畏，　　由生老病死，　無受則解脫，　　生老病死盡。",
        "translation": "Fear arises from seeing sensation, which results from birth, old age, illness, and death, but without sensation, he's liberated, and birth, old age, illness, and death are ended.",
        "source": "T01n0001_019:0127a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼得安隱處，　　現在得無為，　已渡諸憂畏，　　決定般涅槃。」",
        "translation": "Peter's peaceful abode, now attained inaction, has crossed all sorrows and fears, and has decided on parinirvāṇa.\"",
        "source": "T01n0001_019:0127a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說長阿含第四分世記經龍鳥品第五佛告比丘：「有四種龍。",
        "translation": "The Buddha told the monks, \"There are four kinds of dragons.",
        "source": "T01n0001_019:0127a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T01n0001_019:0127a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者卵生，二者胎生，三者濕生，四者化生，是為四種。",
        "translation": "There are four kinds: those born as eggs, those born in the womb, those born in the wet, and those born by transformation.",
        "source": "T01n0001_019:0127a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有四種金翅鳥。",
        "translation": "There are four kinds of garuḍa birds.",
        "source": "T01n0001_019:0127b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T01n0001_019:0127b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者卵生，二者胎生，三者濕生，四者化生，是為四種。",
        "translation": "There are four kinds: those born as eggs, those born in the womb, those born in the wet, and those born by transformation.",
        "source": "T01n0001_019:0127b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大海水底有娑竭龍王宮，縱廣八萬由旬，宮牆七重，七重欄楯、七重羅網、七重行樹，周匝嚴飾，皆七寶成，乃至無數眾鳥相和而鳴，亦復如是。",
        "translation": "At the bottom of the ocean there's the palace of Sāgara-nāga-rāja, 80,000 leagues wide, with seven walls, seven rails, seven nets, and seven rows of trees, all ornamented with seven treasures, and so are the countless numbers of birds that sing in unison.",
        "source": "T01n0001_019:0127b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須彌山王與佉陀羅山二山中間，有難陀、婆難陀二龍王宮，各各縱廣六千由旬，宮牆七重，七重欄楯、七重羅網、七重行樹，周匝校飾，以七寶成，乃至無數眾鳥相和而鳴，亦復如是。",
        "translation": "Between the two mountains of Sumeru and Khadira, there are the palaces of two dragon kings, Nanda and Vānanda, each measuring 6,000 yojanas in length, with seven walls, seven rails, seven nets, and seven rows of trees, all decorated and surrounded by seven treasures, even as the countless birds sing in unison, and so it is.",
        "source": "T01n0001_019:0127b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大海北岸有一大樹，名究羅睒摩羅，龍王、金翅鳥共有此樹。",
        "translation": "\"On the northern shore of the ocean there's a large tree named Śāriputra, which is shared by the dragon king and the garuḍa.",
        "source": "T01n0001_019:0127b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其樹下圍七由旬，高百由旬，枝葉四布五十由旬。",
        "translation": "Its lower part is seven leagues in circumference, its height is a hundred leagues, and its branches spread four ways and fifty leagues.",
        "source": "T01n0001_019:0127b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此大樹東有卵生龍王宮、卵生金翅鳥宮，其宮各各縱廣六千由旬，宮牆七重，七重欄楯、七重羅網、七重行樹，周匝校飾，以七寶成，乃至無數眾鳥相和悲鳴，亦復如是。",
        "translation": "To the east of this great tree there's the palace of the oviparous dragon king and the palace of the oviparous garuḍa, each measuring 6,000 leagues in length and breadth, with seven walls, seven rails, seven nettings, and seven rows of trees, all decorated with seven treasures, up to the countless numbers of birds that sing in unison and lamentation.",
        "source": "T01n0001_019:0127b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其究羅睒摩羅樹南有胎生龍王宮、胎生金翅鳥宮，其宮各各縱廣六千由旬，宮牆七重，七重欄楯、七重羅網、七重行樹，周匝校飾，以七寶成，乃至無數眾鳥相和悲鳴，亦復如是。",
        "translation": "South of the Kālāśmala tree there's the palace of the unborn dragon king and the palace of the unborn garuḍa, each measuring 6,000 leagues in length, with seven walls, seven rails, seven nets, and seven rows of trees that are decorated and surrounded by seven treasures, up to the point where countless birds sing in harmony with each other and lament, and so it is.",
        "source": "T01n0001_019:0127b16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "究羅睒摩羅樹西有濕生龍宮、濕生金翅鳥宮，其宮各各縱廣六千由旬，宮牆七重，七重欄楯、七重羅網、七重行樹，周匝校飾，以七寶成，乃至無數眾鳥相和而鳴，亦復如是。",
        "translation": "To the west of the Kauśāmbīla tree there's the palace of the Śrāvastī dragon and the palace of the Śrāvastī garuḍa bird, each measuring 6,000 yojanas in length and breadth, with seven walls, seven rails, seven nets, and seven rows of trees that are decorated and surrounded by seven treasures, even as the countless multitude of birds that sing in unison are likewise.",
        "source": "T01n0001_019:0127b20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "究羅睒摩羅樹北有化生龍王宮、化生金翅鳥宮，其宮各各縱廣六千由旬，宮牆七重，七重欄楯、七重羅網、七重行樹，周匝校飾，以七寶成，乃至無數眾鳥相和悲鳴，亦復如是。",
        "translation": "To the north of the Kauśāmbī tree there's the palace of the transformation-born dragon king and the palace of the transformation-born garuḍa, each measuring 6,000 leagues in length, with seven walls, seven rails, seven nets, and seven rows of trees that are decorated and surrounded by seven treasures, up to the point where countless birds sing in harmony with each other, and so it is.",
        "source": "T01n0001_019:0127b24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若卵生金翅鳥欲搏食龍時，從究羅睒摩羅樹東枝飛下，以翅搏大海水，海水兩披二百由旬，取卵生龍食之，隨意自在，而不能取胎生、濕生、化生諸龍。",
        "translation": "\"When the egg-born garuḍa wants to feed on a dragon, it flies down from the eastern branch of the Śāriputra tree and beats the ocean water with its wings, which is 2,200 leagues long, and takes an egg-born dragon and feeds on it as it wishes, but it can't take any dragons that are born in the womb, that are born in the wet, or that are born by transformation.",
        "source": "T01n0001_019:0127b28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若胎生金翅鳥欲搏食卵生龍時，從樹東枝飛下，以翅搏大海水，海水兩披二百由旬，取卵生龍食之，自在隨意。",
        "translation": "\"When the garuḍa wants to feed on a dragon born from the womb, it flies down from the eastern branch of a tree and beats the ocean water with its wings, which is 2,200 leagues long, and takes an egg-born dragon and feeds on it, freely and at will.",
        "source": "T01n0001_019:0127c03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若胎生金翅鳥欲食胎生龍時，從樹南枝飛下，以翅搏大海水，海水兩披四百由旬，取胎生龍食之，隨意自在，而不能取濕生、化生諸龍食也。",
        "translation": "When the garuḍa wants to feed on a dragon born from the womb, it flies down from the south branch of the tree and fights the ocean with its wings, which is 2,400 leagues long, and takes a dragon born from the womb and feeds on it as it wishes, but it can't take wet-born or transformation-born dragons and feed on them.",
        "source": "T01n0001_019:0127c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「濕生金翅鳥欲食卵生龍時，從樹東枝飛下，以翅搏大海水，海水兩披二百由旬，取卵生龍食之，自在隨意。",
        "translation": "\"When the wet-born garuḍa wants to feed on an egg-born dragon, it flies down from the eastern branch of a tree, pulses its wings against the ocean water, which is 2,200 leagues long, and takes an egg-born dragon and feeds on it at its own will.",
        "source": "T01n0001_019:0127c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濕生金翅鳥欲食胎生龍時，於樹南枝飛下，以翅搏大海水，海水兩披四百由旬，取胎生龍食之，自在隨意。",
        "translation": "When the wet-growth garuḍa wants to feed on a dragon born from the womb, it flies down from the south branch of the tree, pulses its wings against the ocean water, which is 2,400 leagues long, and takes the womb-born dragon and feeds on it as it pleases.",
        "source": "T01n0001_019:0127c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濕生金翅鳥欲食濕生龍時，於樹西枝飛下，以翅搏大海水，海水兩披八百由旬，取濕生龍食之，自在隨意，而不能取化生龍食。",
        "translation": "When the wet-born garuḍa wants to feed on a wet-born dragon, it flies down from the west branch of the tree and fights the ocean water with its wings, which is two piles long and 800 leagues long, and takes a wet-born dragon and feeds on it as it wishes, but it can't take a transformation-born dragon and feed on it.",
        "source": "T01n0001_019:0127c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「化生金翅鳥欲食卵生龍時，從樹東枝飛下，以翅搏大海水，海水兩披二百由旬，取卵生龍食之，自在隨意。",
        "translation": "\"When the miraculously-born garuḍa wants to feed on an egg-born dragon, it flies down from the eastern branch of the tree and fights the ocean with its wings, which is 2,200 leagues long, and takes the egg-born dragon and feeds on it as it pleases.",
        "source": "T01n0001_019:0127c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化生金翅鳥欲食胎生龍時，從樹南枝飛下，以翅搏大海水，海水兩披四百由旬，取胎生龍食之，隨意自在。",
        "translation": "When the miraculously-born garuḍa wants to feed on a dragon born from the womb, it flies down from the south branch of the tree, pulses its wings against the ocean water, which is 2,400 leagues long, and takes the womb-born dragon and feeds on it as it wishes.",
        "source": "T01n0001_019:0127c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化生金翅鳥欲食濕生龍時，從樹西枝飛下，以翅搏大海水，海水兩披八百由旬，取濕生龍食之。",
        "translation": "When the garuḍa wants to feed on a wet-born dragon, it flies down from the western branch of the tree, pulses its wings against the ocean water, which is 2 puffs and 800 leagues long, and takes the wet-born dragon and feeds on it.",
        "source": "T01n0001_019:0127c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化生金翅鳥欲食化生龍時，從樹北枝飛下，以翅搏大海水，海水兩披千六百由旬，取化生龍食之，隨意自在。",
        "translation": "When the garuḍa wants to feed on a dragon that's born from transformation, it flies down from the northern branch of the tree and fights the ocean with its wings, which is 2,600 leagues long, and takes the dragon that's born from transformation and feeds on it as it wishes.",
        "source": "T01n0001_019:0127c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為金翅鳥所食諸龍。",
        "translation": "These are the dragons that the garuḍa feeds on.",
        "source": "T01n0001_019:0127c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有大龍，金翅鳥所不能得。",
        "translation": "\"Again, there's a great dragon that the garuḍa can't reach.",
        "source": "T01n0001_019:0127c28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者是？",
        "translation": "Which one is it?",
        "source": "T01n0001_019:0127c28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "娑竭龍王、難陀龍王、跋難陀龍王、伊那婆羅龍王、提頭賴吒龍王、善見龍王、阿盧龍王、伽拘羅龍王、伽毗羅龍王、阿波羅龍王、伽[少/兔]龍王、瞿伽[少/兔]龍王、阿耨達龍王、善住龍王、優睒伽波頭龍王、得叉伽龍王，此諸大龍王皆不為金翅鳥之所搏食，其有諸龍在近彼住者，亦不為金翅鳥之所搏食。」",
        "translation": "Sāgara-nāga-rāja, Nanda-nāga-rāja, Bananda-nāga-rāja, Inabhara-nāga-rāja, Dhṛtarāṣṭra-nāga-rāja, Shanjian-nāga-rāja, Alu-nāga-rāja, Kakuda-nāga-rāja, Gokhā-[less/rabbit]-nāga-rāja, Anavatapta-nāga-rāja, Shanjian-nāga-rāja, Uśvagopādin-nāga-rāja, and Takṣaka-nāga-rāja, these great dragon kings are not eaten by garuḍa, nor are they eaten by garuḍa when there are dragons living near them.\"",
        "source": "T01n0001_019:0127c29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「若有眾生奉持龍戒，心意向龍，具龍法者，即生龍中。",
        "translation": "The Buddha told the monks, \"If sentient beings uphold the dragon precepts, orient their minds toward dragons, and possess the dragon dharma, they'll be born among dragons.",
        "source": "T01n0001_019:0128a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生奉持金翅鳥戒，心向金翅鳥，具其法者，便生金翅鳥中。",
        "translation": "If a sentient being upholds the garuḍa precepts, directs his mind toward the garuḍa, and possesses its teachings, then he'll be born among the garuḍas.",
        "source": "T01n0001_019:0128a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有眾生持兔梟戒者，心向兔梟，具其法者，墮兔梟中。",
        "translation": "If a sentient being observes the rabbit-head precept and their mind is directed toward the rabbit-head, and they possess its teachings, they'll fall among rabbit-heads.",
        "source": "T01n0001_019:0128a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生奉持狗戒，或持牛戒，或持鹿戒，或持瘂戒，或持摩尼婆陀戒，或持火戒，或持月戒，或持日戒，或持水戒，或持供養火戒，或持苦行穢汙法，彼作是念：『我持此瘂法、摩尼婆陀法、火法、日月法、水法、供養火法、諸苦行法，我持此功德，欲以生天。』",
        "translation": "If a sentient being observes the dog precept, the cow precept, the deer precept, the dumb precept, the mañibhadra precept, the fire precept, the moon precept, the sun precept, the water precept, the fire offering precept, or the defiling precepts of asceticism, he thinks, 'I've observed these dumb dharmas, mañibhadra dharmas, fire dharmas, sun and moon dharmas, water dharmas, fire offering dharmas, and ascetic dharmas, and I want to be born in heaven because of the merits of observing them.'",
        "source": "T01n0001_019:0128a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是邪見。」",
        "translation": "This is wrong view.\"",
        "source": "T01n0001_019:0128a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「我說此邪見人必趣二處，若生地獄，有墮四生。",
        "translation": "The Buddha said, \"I say this person with wrong views will surely go to two places, if he's born in hell, or if he falls into four births.",
        "source": "T01n0001_019:0128a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有沙門、婆羅門有如是論、如是見：『我、世間有常，此實餘虛；我及世間無常，此實餘虛；我及世間有常無常，此實餘虛；我及世間非有常非無常，此實餘虛。",
        "translation": "Some ascetics or priests hold this theory or view: 'This is really a falsehood: 'I and the world are permanent; I and the world are impermanent; this is really a falsehood; I and the world are permanent and impermanent; I and the world are neither permanent nor impermanent; this is really a falsehood.'",
        "source": "T01n0001_019:0128a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我、世有邊，此實餘虛；我、世無邊，此實餘虛；我、世有邊無邊，此實餘虛；我、世非有邊非無邊，此實餘虛。",
        "translation": "I and the world are finite, which is really a remainder of nothingness; I and the world are finite, which is really a remainder of nothingness; I and the world are finite and finite, which is really a remainder of nothingness; and I and the world are neither finite nor finite, which is really a remainder of nothingness.",
        "source": "T01n0001_019:0128a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是命是身，此實餘虛；是命異身異，此實餘虛；非有命非無命，此實餘虛；無命無身，此實餘虛。』",
        "translation": "Whether it's life or body, this is really a remainder of nothingness; whether it's life that's different from body, this is really a remainder of nothingness; whether it's life or no life, this is really a remainder of nothingness; and whether it's no life or no body, this is really a remainder of nothingness.'",
        "source": "T01n0001_019:0128a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有人言：『有如是他死，此實餘虛。』",
        "translation": "Some people say, 'Such is death in others, and this is truly a remainder of nothingness.'",
        "source": "T01n0001_019:0128a26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有言：『無如是他死，此實餘虛。』",
        "translation": "Some say, 'There's nothing like this other death, and this is truly a remainder of nothingness.'",
        "source": "T01n0001_019:0128a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或言：『有如是無如是他死，此實餘虛。』",
        "translation": "Some say, 'Such is the existence and absence of such-and-such other deaths, and this is truly a remainder of nothingness.'",
        "source": "T01n0001_019:0128a28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又言：『非有非無如是他死，此實餘虛。』",
        "translation": "And they say, 'It's neither existent nor nonexistent such as this other's death, and this is really a remainder of nothingness.'",
        "source": "T01n0001_019:0128a29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼沙門、婆羅門若作如是論、如是見者，言世是常，此實餘虛者，彼於行有我見、命見、身見、世間見，是故彼作是言：『我、世間有常。』",
        "translation": "\"If that ascetic or brāhmaṇa thus discusses or thus views things, and says the world is permanent, this is really a remainder of nothingness, for they have a view of self, life, body, and the world in terms of conditioned activity; therefore, they say, 'I and the world are permanent.'",
        "source": "T01n0001_019:0128a29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼言無常者，於行有我見、命見、身見、世間見，是故彼言：『我、世間無常。』",
        "translation": "He who says [something] is impermanent has views of self, life, body, and the world in terms of conditioned activity; therefore, he says, 'I, the world, am impermanent.'",
        "source": "T01n0001_019:0128b03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼言有常無常者，彼行於有我見、命見、身見、世間見，故言：『世間有常無常。』",
        "translation": "He says 'permanent and impermanent' because he's acting with views of self, life, body, and the world, and therefore he says, 'The world is permanent and impermanent.'",
        "source": "T01n0001_019:0128b05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼言非有常非無常者，於行有我見、命見、身見、世間見，故言：『我、世間非有常非無常。』",
        "translation": "He says 'neither permanent nor impermanent' because he's acting with views of self, life, body, and the world, and therefore he says, 'The self and the world are neither permanent nor impermanent.'",
        "source": "T01n0001_019:0128b07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼言我、世間有邊者，於行有我見、命見、身見、世間見，言：『命有邊，身有邊，世間有邊，從初受胎至於塚間，所有四大身如是展轉，極至七生，身、命行盡，我入清淨聚。』",
        "translation": "\"They say 'I and the world are finite,' because they have views of self, life, body, and the world in their condition, and they say, 'Life is finite, body is finite, and the world is finite; from the first moment of womb-hood until the midst of the tomb, all four major bodies are thus transformed up to the seventh birth, when the condition of body and life is ended and I enter the pure abode.'",
        "source": "T01n0001_019:0128b09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故彼言：『我有邊。』",
        "translation": "Therefore, he says, 'I have limits.'",
        "source": "T01n0001_019:0128b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼言我、世間無邊者，於行有我見、命見、身見、世間見，言：『命無邊，身無邊。",
        "translation": "Someone who says 'I and the world are limitless' means that in terms of conditioned activity, they have views of self, life, body, and the world, saying, 'Life is limitless, and body is limitless.",
        "source": "T01n0001_019:0128b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間無邊，從初受胎至於塚間，所有四大身如是展轉，極至七生，身、命行盡，我入清淨聚。』",
        "translation": "The world is limitless, and from the first moment of birth until the time I'm born in a cemetery, the four major bodies will continue in this way for up to seven lifetimes, when the condition of body and life is ended and I enter the pure abode.'",
        "source": "T01n0001_019:0128b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是言：『我、世間無邊。』",
        "translation": "They say, 'I, the world, have no limit.'",
        "source": "T01n0001_019:0128b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼作是言：『此世間有邊無邊。』",
        "translation": "He says, 'This world is finite and limitless.'",
        "source": "T01n0001_019:0128b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於行有我見、命見、身見、世間見：『命有邊無邊，從初受胎至於塚間，所有四大身如是展轉，極至七生，身、命行盡，我入清淨聚。』",
        "translation": "He has a view of self, life, body, and the world in terms of conditioned activity: 'Life is finite and limitless, and from the first moment of birth until the time I'm born in a tomb, all four major bodies are thus transformed up to seven births, when the deeds of body and life are ended and I enter the pure abode.'",
        "source": "T01n0001_019:0128b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故言：『我有邊無邊。』",
        "translation": "Therefore, they say, 'My existence is limited and limitless.'",
        "source": "T01n0001_019:0128b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼作是言：『我、世間非有邊非無邊。』",
        "translation": "They say, 'I, the world, am neither finite nor infinite.'",
        "source": "T01n0001_019:0128b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於行有我見、命見、身見、世間見：『命身非有邊非無邊，從初受胎至於塚間，所有四大身如是展轉，極至七生，身、命行盡，我入清淨聚。』",
        "translation": "In their conditioned state, they have views of self, life, body, and the world: 'The life body is neither finite nor infinite, and from the first moment of birth until the time I'm born in a tomb, all four major bodies are thus transformed up to the seventh birth, and the practice of body and life is ended, and I enter the pure abode.'",
        "source": "T01n0001_019:0128b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故言：『我非有邊非無邊。』",
        "translation": "Therefore, he says, 'I am neither finite nor infinite.'",
        "source": "T01n0001_019:0128b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼言是命是身者，於此身有命見，於餘身有命見，是故言：『是命是身。』",
        "translation": "\"Someone who says this life is the body has a view of life in this body and a view of life in other bodies; therefore, they say, 'This life is the body.'",
        "source": "T01n0001_019:0128b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言命異身異者，於此身有命見，於餘身無命見，是故言：『命異身異。』",
        "translation": "He who says life is different from body is different because this body has views of life and the other bodies don't have views of life, and therefore he says, 'Life is different from body.'",
        "source": "T01n0001_019:0128b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼言身命非有非無者，於此身無命見，於餘身有命見，是故言：『非有非無。』",
        "translation": "They say the body's life is neither existent nor nonexistent, because this body has views of life and the other bodies have views of life, they say, 'It's neither existent nor nonexistent.'",
        "source": "T01n0001_019:0128b29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼言無身命者，此身無命見，餘身無命見，是故言：『無命無身。』",
        "translation": "They say 'lacking body and life,' because this body has no view of life and the other bodies have no view of life, they say, 'Lacking life, there's no body.'",
        "source": "T01n0001_019:0128c02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼言有如是他死者，其人見今有命，後更有身、命遊行，是故言：『有如是他死。』",
        "translation": "He says there's thus another person who died, and that person sees that there's life now and another body and life later on that procession, and therefore says, 'There's thus another person who died.'",
        "source": "T01n0001_019:0128c03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無如是他死者，彼言今世有命，後世無命，是故言：『無如是他死。』",
        "translation": "'There's no such other dead person who says there's life in the present life and no life in the life afterward, and therefore says, 'There's no such other dead person.'",
        "source": "T01n0001_019:0128c05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有如是他死無如是他死者，彼言今世命斷滅，後世命遊行，是故言：『有如是他命無如是他命。』",
        "translation": "Those who say that there's such-and-such death and no such-and-such death say that life in the present life ends and life in the life afterward marches on; therefore, they say, 'There's such-and-such other life and no such-and-such life.'",
        "source": "T01n0001_019:0128c06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非有非無如是他死者，彼言今身、命斷滅，後身、命斷滅，是故言：『非有非無如是他死。』」",
        "translation": "He says, 'There's neither such-and-such death nor such-and-such death,' because he says that his present body and life cease and his life ceases in the life afterward, he therefore says, 'There's neither such-and-such death.'\"",
        "source": "T01n0001_019:0128c09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告諸比丘言：「乃往過去有王名鏡面，時，集生盲人聚在一處，而告之曰：『汝等生盲，寧識象不？』",
        "translation": "It was then that the Bhagavān addressed the monks, \"Once upon a time in the past, there was a king named Mirrorface who gathered a group of blind people in one place and told them, 'Are you blind people who have been born, or would you rather know an elephant?'",
        "source": "T01n0001_019:0128c11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『大王！",
        "translation": "They said, 'Great king!",
        "source": "T01n0001_019:0128c13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我不識、不知。』",
        "translation": "I don't know or recognize them.'",
        "source": "T01n0001_019:0128c13_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王復告言：『汝等欲知彼形類不？』",
        "translation": "The king again told them, 'Do you want to know their form?'",
        "source": "T01n0001_019:0128c14_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『欲知。』",
        "translation": "He said, 'I want to know.'",
        "source": "T01n0001_019:0128c14_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，王即勅侍者，使將象來，令眾盲子手自捫象。",
        "translation": "The king then ordered his attendants to bring in an elephant and have the blind men examine it with their own hands.",
        "source": "T01n0001_019:0128c15_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中有摸象得鼻者，王言此是象，或有摸象得其牙者，或有摸象得其耳者，或有摸象得其頭者，或有摸象得其背者，或有摸象得其腹者，或有摸象得其髀者，或有摸象得其膊者，或有摸象得其跡者，或有摸象得其尾者，王皆語言：『此是象也。』",
        "translation": "When one of them touched the elephant and got its trunk, the king said, 'This is the elephant; when another touched the elephant and got its tusks; when another touched the elephant's ear; when another touched the elephant's head; when another touched the elephant's back; when another touched the elephant's belly; when another touched the elephant's thigh; when another touched the elephant's shoulder; when another touched the elephant's trail; or when another touched the elephant's tail, the king said, 'This is the elephant.'",
        "source": "T01n0001_019:0128c16_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，鏡面王即却彼象，問盲子言：『象何等類？』",
        "translation": "\"The mirror-faced king then removed the elephant and asked the blind man, 'What kind of elephant is it?'",
        "source": "T01n0001_019:0128c22_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其諸盲子，得象鼻者，言象如曲轅，得象牙者，言象如杵，得象耳者，言象如箕，得象頭者，言象如鼎，得象背者，言象如丘阜，得象腹者，言象如壁，得象髀者，言象如樹，得象膊者，言象如柱，得象跡者，言象如臼，得象尾者，言象如絙。",
        "translation": "Those blind men who have the elephant's trunk say the elephant is like a pole; those who have the elephant's tusks say the elephant is like a pounder; those who have the elephant's ear say the elephant is like a winnowing fan; those who have the elephant's head say the elephant is like a tripod; those who have the elephant's back say the elephant is like a mound; those who have the elephant's belly say the elephant is like a wall; those who have the elephant's thigh say the elephant is like a tree; those who have the elephant's shoulder say the elephant is like a pillar; those who have the elephant's tracks say the elephant is like a mortar; and those who have the elephant's tail say the elephant is like a palm tree.",
        "source": "T01n0001_019:0128c23_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各各共諍，互相是非，此言如是，彼言不爾，云云不已，遂至鬪諍。",
        "translation": "They each fought with each other, arguing against each other, saying this is so and that's not the case, and they kept going on and on, which led to a fight.",
        "source": "T01n0001_019:0128c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，王見此，歡喜大笑。",
        "translation": "When the king saw this, he rejoiced and laughed.",
        "source": "T01n0001_019:0129a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，鏡面王即說頌曰：「『諸盲人群集，　　於此競諍訟，　　象身本一體，　　異相生是非。』」",
        "translation": "\"It was then that the mirror-faced king spoke a verse, \"All these blind people have gathered here to fight, and the elephant body is originally one in essence, but differences in characteristics give rise to right and wrong.\"",
        "source": "T01n0001_019:0129a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「諸外道異學亦復如是，不知苦諦，不知習諦、盡諦、道諦，各生異見，互相是非，謂己為是，便起諍訟。",
        "translation": "The Buddha told the monks, \"So it is with those non-Buddhist heretics who don't know the truth of suffering and don't know the truths of accumulation, cessation, and the path, and who each give rise to different views and argue with each other, claiming that they are this, and then start a dispute.",
        "source": "T01n0001_019:0129a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有沙門、婆羅門能如實知苦聖諦、苦習聖諦、苦滅聖諦、苦出要諦，彼自思惟，相共和合，同一受，同一師，同一水乳，熾然佛法，安樂久住。」",
        "translation": "If there are ascetics or priests who truly know the noble truth of suffering, the noble truth of suffering's accumulation, the noble truth of suffering's cessation, and the essential truth of suffering's escape, they themselves will contemplate that they are united, have the same feelings, have the same teacher, and are the same water and milk, and they will become ardent believers of the Buddha's teaching and abide in comfort and longevity.\"",
        "source": "T01n0001_019:0129a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊而說偈言：「若人不知苦，　　不知苦所起，　亦復不知苦，　　所可滅盡處，　亦復不能知，　　滅於苦集道，　失於心解脫，　　慧解脫亦失，　不能究苦本，　　生老病死源。",
        "translation": "It was then that the Bhagavān spoke in verse, \"Suppose a person doesn't know suffering, doesn't know what causes suffering, doesn't also know suffering, doesn't know where it can be ended, doesn't cease to exist in the path of suffering's accumulation, loses their mental liberation, and loses their wisdom liberation, can't investigate the root of suffering, and doesn't know the source of birth, aging, illness, and death.",
        "source": "T01n0001_019:0129a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若能諦知苦，　　知苦所起因，　亦能知彼苦，　　所可滅盡處，　又能善分別，　　滅苦集聖道，　則得心解脫，　　慧解脫亦然。",
        "translation": "If someone truly knows suffering, knows the causes of suffering, knows where that suffering can be ended, and can skillfully discern and cease the noble path of suffering's accumulation, then they'll attain mental liberation, and so will their wisdom liberation.",
        "source": "T01n0001_019:0129a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　斯人能究竟，　　苦陰之根本，　盡生老病死，　　受有之根原。",
        "translation": "This person can thoroughly understand the root of the painful aggregate, exhaust birth, old age, illness, and death, and the root cause of sensation and existence.",
        "source": "T01n0001_019:0129a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "\"Monks!",
        "source": "T01n0001_019:0129a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝等當勤方便思惟苦聖諦、苦集聖諦、苦滅聖諦、苦出要諦。」",
        "translation": "Therefore, you must diligently and skillfully contemplate the noble truth of suffering, the noble truth of suffering's accumulation, the noble truth of suffering's cessation, and the essential truth of suffering's escape.\"",
        "source": "T01n0001_019:0129a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說長阿含經卷第十九",
        "translation": "Foshuo Chang'ahan jing, vol. 19",
        "source": "T01n0001_019:0129a25_0",
        "is_bad_quality": false
    }
]