[
    {
        "source_sentence": "佛說長阿含經卷第十五",
        "translation": "Foshuo Chang'ahan jing, vol. 15",
        "source": "T01n0001_015:0094a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後秦弘始年佛陀耶舍共竺佛念譯",
        "translation": "Latter-Qin Emperor Hiroshi's year, Buddhayaśas and Zhufo Nianshi",
        "source": "T01n0001_015:0094a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二二）第三分種德經第三",
        "translation": "（The Third Part of the Sutra on the Three Seeds of Virtue",
        "source": "T01n0001_015:0094a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時，佛在鴦伽國，與大比丘眾千二百五十人俱。",
        "translation": "Thus I have heard: One time, the Buddha was in the country of Aṅga with a large assembly of twelve hundred and fifty monks.",
        "source": "T01n0001_015:0094a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遊行人間，止宿瞻婆城伽伽池側。",
        "translation": "They wandered among the people and stayed at the edge of the Lake Gaja in the city of Campa.",
        "source": "T01n0001_015:0094a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有婆羅門，名曰種德，住瞻婆城，其城人民眾多，熾盛豐樂，波斯匿王即封此城與種德婆羅門，以為梵分。",
        "translation": "At the time, there was a Brāhmaṇa named Jñānagupta who lived in the city of Campā, and there were so many people there, so prosperous and abundant, that King Prasenajit gave the city to the Brāhmaṇa of Jñānagupta as a share of the priesthood.",
        "source": "T01n0001_015:0094a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門七世以來父母真正，不為他人之所輕毀，異學三部諷誦通利，種種經書盡能分別，世典幽微靡不綜練，又能善於大人相法、瞻候吉凶、祭祀儀禮，有五百弟子，教授不廢。",
        "translation": "For seven generations, this Brāhmaṇa was a true father and mother, not despised by others, a proficient reciter of the three divisions of non-Buddhist studies, able to discern all the various scriptures, and able to compile all the secrets of the secular scriptures, skilled in the characteristics of great persons, fortune telling, and rituals, and had 500 disciples who taught him without fail.",
        "source": "T01n0001_015:0094a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，瞻婆城內諸婆羅門、長者、居士聞沙門瞿曇釋種子出家成道，從鴦伽國遊行人間，至瞻婆城伽伽池側，有大名稱，流聞天下，如來、至真、等正覺，十號具足，於諸天、世人、魔、若魔、天、沙門、婆羅門中，自身作證，為他說法，上中下言，皆悉真正，義味具足，梵行清淨。",
        "translation": "At the time, the brahmans, elders, and householders in the city of Campā heard that the ascetic Gautama, the son of the Śākyamuni lineage, had left home and become a practitioner, had traveled among the people of Aṅga country, had arrived at the side of the Lake Gajapāla in Campā, had a great reputation that was widely heard throughout the world, and was known as the Tathāgata, the Supreme Truth, and the Completely Awakened One, complete with the ten epithets, who himself testified and taught others among the gods, humans, Māra, Wāma, gods, ascetics, and brahmans, speaking truly in the higher and middle-level languages, with a complete flavor of meaning and a pure religious practice.",
        "source": "T01n0001_015:0094a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如此真人應往覲現，今我寧可往與相見。」",
        "translation": "\"Such a real person would go to see them, but now I'd rather go and see them together.\"",
        "source": "T01n0001_015:0094b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作此言已，即共相率，出瞻婆城，隊隊相隨，欲往詣佛。",
        "translation": "After saying this, they all left the city of Campā in procession, wanting to go to the Buddha.",
        "source": "T01n0001_015:0094b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，種德婆羅門在高臺上，遙見眾人隊隊相隨，故問侍者：「彼諸人等以何因緣隊隊相隨？",
        "translation": "At the time, the Brahmin of Seeds was on a high dais and saw the people following in procession from a distance, so he asked his attendant, \"What are the reasons why those people are following in procession?",
        "source": "T01n0001_015:0094b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲何所至？」",
        "translation": "Where do you want to go?\"",
        "source": "T01n0001_015:0094b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "侍者白言：「我聞沙門瞿曇釋種子出家成道，於鴦伽國遊行人間，至瞻婆城伽伽池側，有大名稱，流聞天下，如來、至真、等正覺，十號具足，於諸天、世人、魔、若魔、天、沙門、婆羅門中自身作證，為他人說，上中下言，皆悉真正，義味具足，梵行清淨；此瞻婆城諸婆羅門、長者、居士眾聚相隨，欲往問訊瞿曇沙門耳。」",
        "translation": "The attendant said, \"I've heard that the ascetic Gautama Śākyamuni had left home and accomplished the Way, traveled among the people of Aṅga country, and came to the city of Campāga by the lake, where he had a great reputation that was widely known throughout the world as the Tathāgata, the Most True, and the Completely Enlightened, complete with the ten epithets, who himself testified among gods, humans, Māra, Jātaka Māra, gods, ascetics, and priests, spoke for others, spoke truly of the superior and inferior, had a complete flavor of meaning, and had a pure religious practice.",
        "source": "T01n0001_015:0094b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，種德婆羅門即勅侍者：「汝速持我聲，往語諸人：『卿等小住，須我往至，當共俱詣彼瞿曇所。』」",
        "translation": "The seedy brāhmaṇa then commanded his attendant, \"Quickly take my voice and go tell them, 'You must let me come if you're staying small; we'll go to the Gautama together.'\"",
        "source": "T01n0001_015:0094b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼侍者即以種德聲，往語諸人言：「諸人且住，須我往到，當共俱詣彼瞿曇所。」",
        "translation": "The attendant then went to the people with the sound of their virtues and said, 'Stand still, all of you, for I must come, and we'll all go to the Gautama.'\"",
        "source": "T01n0001_015:0094b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸人報侍者言：「汝速還白婆羅門言：『今正是時，宜共行也。』」",
        "translation": "The men then reported to the attendant, \"Go back to the Brāhmaṇa quickly and tell him, 'Now is the right time to go together.'\"",
        "source": "T01n0001_015:0094b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "侍者還白：「諸人已住，言：『今正是時，宜共行也。』」",
        "translation": "The attendant returned, \"Those people have stayed, saying, 'Now is the right time to walk together.'\"",
        "source": "T01n0001_015:0094b22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，種德婆羅門即便下臺，至中門立。",
        "translation": "The Brahmin of Virtue then descended from the platform and went to stand at the middle gate.",
        "source": "T01n0001_015:0094b23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有餘婆羅門五百人，以少因緣，先集門下，見種德婆羅門來，皆悉起迎問言：「大婆羅門！",
        "translation": "At the time, five hundred other brāhmaṇas, who had gathered under the gate for a few reasons, all rose to greet the Mañjuśrī Brāhmaṇa when they saw him coming, saying, \"Great brāhmaṇa!",
        "source": "T01n0001_015:0094b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲何所至？」",
        "translation": "Where do you want to go?\"",
        "source": "T01n0001_015:0094b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種德報言：「有沙門瞿曇釋種子出家成道，於鴦伽國遊行人間，至瞻婆城伽伽池側，有大名稱，流聞天下，如來、至真、等正覺，十號具足，於諸天、世人、魔、若魔、天、沙門、婆羅門中，自身作證，為他說法，上中下言，皆悉真正，義味具足，梵行清淨。",
        "translation": "Mañjuśrī reported, \"An ascetic Gautama, a son of the Śākyamuni lineage, left home and became a practitioner, traveled among the people of Aṅga country, and came upon the shores of the Gṛdhrakūṭa River in the city of Campā, where he had a great reputation that was widely heard throughout the world, a tathāgata, a supreme truth, and a perfect awakening, complete with the ten epithets, who himself testified and taught others among gods, humans, Māra, Jātaka Māra, gods, ascetics, and priests, saying that the higher and middle-level words were all true, their meanings were complete, and their religious practices were pure.",
        "source": "T01n0001_015:0094b26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是真人宜往覲現，我今欲往至彼相見。」",
        "translation": "It's appropriate for such a real person to go to see him, and I want to go there now to meet him.\"",
        "source": "T01n0001_015:0094c02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，五百婆羅門即白種德言：「勿往相見，所以者何？",
        "translation": "The five hundred brāhmaṇas then said to Mañjuśrī, \"Don't go to see them, why is that?",
        "source": "T01n0001_015:0094c03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼應詣此，此不應往。",
        "translation": "They should go here, but this one shouldn't go there.",
        "source": "T01n0001_015:0094c05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今大婆羅門七世以來父母真正，不為他人之所輕毀；若成就此法者，彼應詣此，此不應詣彼。",
        "translation": "Now, for seven generations, the great Brāhmaṇa has been a true father and mother, and he won't be despised by others; if he accomplishes this teaching, he should go here, but he shouldn't go there.",
        "source": "T01n0001_015:0094c05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又大婆羅門異學三部諷誦通利，種種經書皆能分別，世典幽微靡不綜練，又能善於大人相法、瞻相吉凶、祭祀儀禮；成就此法者，彼應詣此，此不應詣彼。",
        "translation": "Also, the great Brāhmaṇa is a heretic who's fluent in reciting and chanting the three divisions of scriptures, can discern all kinds of sūtras and texts, and doesn't fail to compile the subtleties of worldly texts, and is skilled in the characteristics of great persons, fortune and misfortune in fortune, and rituals for sacrifice; someone who has accomplished this teaching should go here, and this one shouldn't go there.",
        "source": "T01n0001_015:0094c07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又大婆羅門顏貌端正，得梵色像；成就此法者，彼應詣此，此不應詣彼。",
        "translation": "Also, the great brāhmaṇa has a correct countenance and attains the image of a Brahmā; someone who has accomplished this teaching should go here, but not here.",
        "source": "T01n0001_015:0094c11_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又大婆羅門戒德增上，智慧成就；成就此法者，彼應詣此，此不應詣彼。",
        "translation": "That great brāhmaṇa has increased the virtue of morality and accomplished wisdom; he should go here if he's accomplished this teaching, but he shouldn't go there.",
        "source": "T01n0001_015:0094c13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又大婆羅門所言柔和，辯才具足，義味清淨；成就此法者，彼應詣此，此不應詣彼。",
        "translation": "\"Also, the great brāhmaṇa is gentle in what he says, full of eloquence, and pure in flavor; someone who has accomplished this teaching should go here, and they shouldn't go there.",
        "source": "T01n0001_015:0094c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又大婆羅門為大師，弟子眾多；成就此法者，彼應詣此，此不應詣彼。",
        "translation": "Also, the great Brāhmaṇa is a great teacher with many disciples; someone who has accomplished this teaching should go here, but not here.",
        "source": "T01n0001_015:0094c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又大婆羅門常教授五百婆羅門；成就此法者，彼應詣此，此不應詣彼。",
        "translation": "That great Brāhmaṇa always teaches 500 Brāhmaṇas; someone who has accomplished that teaching should go here, but not here.",
        "source": "T01n0001_015:0094c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又大婆羅門四方學者皆來請受，問諸技術祭祀之法，皆能具答；成就此法者，彼應詣此，此不應詣彼。",
        "translation": "That great brāhmaṇa is a scholar from all directions who comes to accept his questions about technical rituals and is able to answer them completely; someone who has accomplished that teaching should go here, and that shouldn't go there.",
        "source": "T01n0001_015:0094c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又大婆羅門為波斯匿王及瓶沙王恭敬供養；成就此法者，彼應詣此，此不應詣彼。",
        "translation": "That great brāhmaṇa is honored and supported by King Prasenajit and King Vibhāṣā; someone who has accomplished that teaching should go here, but not there.",
        "source": "T01n0001_015:0094c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又大婆羅門富有財寶，庫藏盈溢；成就此法者，彼應詣此，此不應詣彼。",
        "translation": "That great brāhmaṇa is rich in riches and has an overflowing treasury; someone who has accomplished this teaching should go here, but not here.",
        "source": "T01n0001_015:0094c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又大婆羅門智慧明達，所言通利，無有怯弱；成就此法者，彼應詣此，此不應詣彼。」",
        "translation": "That great brāhmaṇa has wisdom and insight, speaks fluently, and has no faltering; someone who has accomplished this teaching should go here, and this shouldn't go there.\"",
        "source": "T01n0001_015:0094c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，種德告諸婆羅門曰：「如是！",
        "translation": "It was then that the Sundarī addressed the brāhmaṇas, \"So it is!",
        "source": "T01n0001_015:0094c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T01n0001_015:0094c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所言，我具有此德，非不有也。",
        "translation": "As you say, I have this virtue, not that I don't have it.",
        "source": "T01n0001_015:0094c29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝當聽我說，沙門瞿曇所有功德，我等應往彼，彼不應來此。",
        "translation": "You will listen to me when I tell you that the ascetic Gautama possesses qualities that we should go to and that shouldn't come to us.",
        "source": "T01n0001_015:0095a01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門瞿曇七世已來父母真正，不為他人之所輕毀；彼成就此法者，我等應往彼，彼不應來此。",
        "translation": "The ascetic Gautama has been a true father and mother for seven generations, and he won't be despised by others; we should go there because he's accomplished this teaching, but he shouldn't come here.",
        "source": "T01n0001_015:0095a02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇顏貌端正，出剎利種；成就此法者，我應詣彼，彼不應來此。",
        "translation": "The ascetic Gautama is a man of noble appearance who emerges from the bhadra family; we should go there because he's accomplished this teaching, but he shouldn't come here.",
        "source": "T01n0001_015:0095a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇生尊貴處，出家為道；成就此法者，我應詣彼，彼不應來此。",
        "translation": "The ascetic Gautama is born in a place of honor and renounces the religious path; I should go there if he's accomplished this teaching, but he shouldn't come here.",
        "source": "T01n0001_015:0095a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇光色具足，種姓真正，出家修道；成就此法者，我應詣彼，彼不應來此。",
        "translation": "The ascetic Gautama is perfectly radiant, has a genuine family, and leaves home to cultivate his religious practice; I should visit him when he has accomplished this teaching, but he shouldn't come here.",
        "source": "T01n0001_015:0095a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇生財富家，有大威力，出家為道；成就此法者，我應詣彼，彼不應來此。",
        "translation": "That ascetic Gautama is wealthy, powerful, and renounces the world as a religious practitioner; I should visit him if he's accomplished this teaching, but he shouldn't come here.",
        "source": "T01n0001_015:0095a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又沙門瞿曇具賢聖戒，智慧成就；成就此法者，我應詣彼，彼不應來此。",
        "translation": "\"Also, the ascetic Gautama possesses noble precepts and accomplished wisdom; someone who has accomplished this teaching should come to me, but he shouldn't come here.",
        "source": "T01n0001_015:0095a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇，善於言語柔軟和雅；成就此法者，我應詣彼，彼不應來此。",
        "translation": "The ascetic Gautama is skilled in the gentle and elegant use of language; someone who has accomplished this teaching should come to me, but he shouldn't come here.",
        "source": "T01n0001_015:0095a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇，為眾導師，弟子眾多；成就此法者，我應詣彼，彼不應來此。",
        "translation": "The ascetic Gautama is a teacher of many people and has many disciples; someone who has accomplished this teaching should come to me, but they shouldn't come here.",
        "source": "T01n0001_015:0095a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇，永滅欲愛，無有卒暴，憂畏已除，衣毛不竪，歡喜和悅，見人稱善，善說行報，不毀餘道；成就此法者，我應詣彼，彼不應來此。",
        "translation": "That ascetic Gautama, who permanently ceases craving, has no lassitude, is freed from sorrow and fear, has his clothes and hair standing straight up, is joyous and joyful, praises people as good, speaks well of the rewards of his actions, and doesn't disparage other paths, should I come to him or her when he has accomplished this teaching and he shouldn't come here.",
        "source": "T01n0001_015:0095a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇，恒為波斯匿王及瓶沙王禮敬供養；成就此法者，我應詣彼，彼不應來此。",
        "translation": "That ascetic Gautama is always honoring and making offerings to King Prasenajit and King Vibhāṣā; someone who has accomplished that teaching should come to me, but they shouldn't come here.",
        "source": "T01n0001_015:0095a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇，為沸伽羅娑羅婆羅門禮敬供養，亦為梵婆羅門、多利遮婆羅門、鋸齒婆羅門、首迦摩納都耶子所見供養；成就此法者，我應詣彼，彼不應來此。",
        "translation": "The ascetic Gautama also venerates and makes offerings to the Brahmā Saṃsāra school, and he makes offerings to the Brahmā Saṃsāra school, the Dolcā Brahmā school, the Sawtooth Brahmā school, and the Shugamānadūya school; someone who has accomplished this should come to me, but he shouldn't come here.",
        "source": "T01n0001_015:0095a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又沙門瞿曇為諸聲聞弟子之所宗奉，禮敬供養，亦為諸天、餘鬼神眾之所恭敬，釋種、俱利、冥寧、跋祇、末羅、酥摩皆悉宗奉；成就此法者，我應詣彼，彼不應來此。",
        "translation": "\"Also, the ascetic Gautama is revered by the disciples of the śrāvakas, who venerate and make offerings to him, as well as by the gods and other spirit beings, and by Śākyamuni, Kulika, Mīlāma, Bhārgī, Malla, and śrama; someone who has accomplished this teaching should come to me, but he shouldn't come here.",
        "source": "T01n0001_015:0095a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇授波斯匿王及瓶沙王受三歸五戒；成就此法者，我應詣彼，彼不應來此。",
        "translation": "The ascetic Gautama also conferred the three refuges and five precepts on King Prasenajit and King Vibhāṣā; someone who has accomplished this teaching should come to me, but they shouldn't come here.",
        "source": "T01n0001_015:0095b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇授沸伽羅娑羅婆羅門等三歸五戒；成就此法者，我應詣彼，彼不應來此。",
        "translation": "The ascetic Gautama also conferred the three refuges and five precepts on Boṅgārasarabhūmi and others; someone who has accomplished this should come to me, but he shouldn't come here.",
        "source": "T01n0001_015:0095b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇弟子受三自歸五戒，諸天、釋種、俱利等，皆受三歸五戒；成就此法者，我應詣彼，彼不應來此。",
        "translation": "Also, the ascetic Gautama's disciples receive the five precepts of the three refuges, and the gods, Śākyamunis, and Kulis receive the five precepts of the three refuges; someone who has accomplished this should come to me, but they shouldn't come here.",
        "source": "T01n0001_015:0095b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又沙門瞿曇遊行之時，為一切人恭敬供養；成就此法者，我應詣彼，彼不應來此。",
        "translation": "\"Also, when the ascetic Gautama travels, he is offered respect and support by all people; someone who has accomplished this teaching should come to me, but he shouldn't come here.",
        "source": "T01n0001_015:0095b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇所至城郭聚落，為人供養；成就此法者，我應詣彼，彼不應來此。",
        "translation": "Where the ascetic Gautama goes to a city or town, he makes offerings to people; someone who has accomplished this teaching should come to me, but he shouldn't come here.",
        "source": "T01n0001_015:0095b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇所至之處，非人、鬼神不敢觸嬈；成就此法者，我應詣彼，彼不應來此。",
        "translation": "Where the ascetic Gautama goes, non-humans and spirits won't dare to touch him; someone who has accomplished that teaching should come to me, but he shouldn't come here.",
        "source": "T01n0001_015:0095b12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇所至之處，其處人民皆見光明，聞天樂音；成就此法者，我應詣彼，彼不應來此。",
        "translation": "Where the ascetic Gautama comes, the people there see light and hear the joyful sounds of the gods; someone who has accomplished that teaching should come to me, but he shouldn't come here.",
        "source": "T01n0001_015:0095b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇所至之處，若欲去時，眾人戀慕，涕泣而送；成就此法者，我應詣彼，彼不應來此。",
        "translation": "Where the ascetic Gautama goes, when he wants to depart, the people adore him and weep as he sees them off; I should go there if I've accomplished this teaching, but he shouldn't come here.",
        "source": "T01n0001_015:0095b16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又沙門瞿曇初出家時，父母涕泣，愛惜戀恨；成就此法者，我應詣彼，彼不應來此。",
        "translation": "\"Also, when the ascetic Gautama first left home, his parents wept and loved and hated him; I should visit them if I've accomplished this teaching, but they shouldn't come here.",
        "source": "T01n0001_015:0095b18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇少壯出家，捨諸飾好、象馬、寶車、五欲、瓔珞；成就此法者，我應詣彼，彼不應來此。",
        "translation": "The ascetic Gautama was young and strong when he left home and left behind his adornments, elephant and horse, jeweled chariot, five desires, and jewelry; I should visit him when he has accomplished this teaching, but he shouldn't come here.",
        "source": "T01n0001_015:0095b20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇捨轉輪王位，出家為道，若其在家，當居四天下，統領民物，我等皆屬；成就此法者，我應詣彼，彼不應來此。",
        "translation": "Also, the ascetic Gautama leaves his position as wheel-turning king and renounces the path; if he were at home, he would live in the four worlds and rule the people's goods, and we would all belong to him; someone who has accomplished this should come to me, but he shouldn't come here.",
        "source": "T01n0001_015:0095b22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又沙門瞿曇明解梵法，能為人說，亦與梵天往返言語；成就此法者，我應詣彼，彼不應來此。",
        "translation": "\"Also, the ascetic Gautama clearly understands the teachings of Brahmā, speaks for people, and goes back and forth with the Brahmā gods; someone who has accomplished that teaching should come to me, but he shouldn't come here.",
        "source": "T01n0001_015:0095b25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇三十二相皆悉具足；成就此法者，我應詣彼，彼不應來此。",
        "translation": "The ascetic Gautama is fully equipped with all 32 characteristics; someone who has accomplished this teaching should come to me, but they shouldn't come here.",
        "source": "T01n0001_015:0095b27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇智慧通達，無有怯弱；成就此法者，我應詣彼，彼不應來此。",
        "translation": "The ascetic Gautama is well-versed in wisdom and has no faltering; someone who has accomplished this teaching should come to me, but he shouldn't come here.",
        "source": "T01n0001_015:0095b29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼瞿曇今來至此瞻婆城伽伽池側，於我為尊，又是貴客，宜往親覲。」",
        "translation": "Now, that Gautama has come to this city of Campā, near the Gṛdhrakūṭa River, where he's a venerable and honored guest, so it's appropriate for him to go and visit.\"",
        "source": "T01n0001_015:0095c02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，五百婆羅門白種德言：「甚奇！",
        "translation": "Five hundred brāhmaṇas then said to Jñānagupta, \"How marvelous!",
        "source": "T01n0001_015:0095c03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚特！",
        "translation": "Jeta!",
        "source": "T01n0001_015:0095c04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼之功德乃如是耶？",
        "translation": "Is this the merit of that?",
        "source": "T01n0001_015:0095c04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若彼於諸德中能成一者尚不應來，況今盡具！",
        "translation": "If they could accomplish one of these virtues, they still wouldn't have come, so why would they now have them all?",
        "source": "T01n0001_015:0095c05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宜盡相率，共往問訊。」",
        "translation": "It's appropriate to go together as a group to inquire about it.\"",
        "source": "T01n0001_015:0095c06_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種德答言：「汝欲行者，宜知是時。」",
        "translation": "Mañjuśrī answered, \"Those of you who want to go there should know it's the right time.\"",
        "source": "T01n0001_015:0095c06_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，種德即嚴駕寶車，與五百婆羅門及瞻婆城諸婆羅門長者、居士，前後圍遶，詣伽伽池。",
        "translation": "Seeds then drove his jeweled chariot in full splendor, surrounded by five hundred brāhmaṇas and other brāhmaṇa elders and householders of Campā, and went to the Gṛdhrakūṭa pond.",
        "source": "T01n0001_015:0095c07_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去池不遠，自思惟言：「我設問瞿曇，或不可彼意，彼沙門瞿曇當呵我言：『應如是問，不應如是問。』",
        "translation": "Not far from the pond, he thought to himself, \"If I were to ask the Gautama about this, or if I don't agree with him, the ascetic Gautama would rebuke me, saying, 'Thus should I ask, and thus should I not ask.'",
        "source": "T01n0001_015:0095c09_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾人聞者，謂我無智，損我名稱。",
        "translation": "When people hear this, they think I'm not intelligent, which hurts my reputation.",
        "source": "T01n0001_015:0095c12_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設沙門瞿曇問我義者，我答或不稱彼意，彼沙門當呵我言：『應如是答，不應如是答。』",
        "translation": "Suppose the ascetic Gautama asks me about my meaning and I answer or don't answer according to his intention, and that ascetic will rebuke me, saying, 'Thus should I answer, and I shouldn't answer in this way.'",
        "source": "T01n0001_015:0095c12_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾人聞者，謂我無智，損我名稱。",
        "translation": "When people hear this, they'll say that I'm not intelligent, which hurts my reputation.",
        "source": "T01n0001_015:0095c14_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設我默然於此還者，眾人當言：『此無所知。』",
        "translation": "If I were to return here in silence, the people would say, 'I don't know anything about this.'",
        "source": "T01n0001_015:0095c15_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "竟不能至沙門瞿曇所，損我名稱。",
        "translation": "Not being able to go to the ascetic Gautama after all will hurt my reputation.",
        "source": "T01n0001_015:0095c16_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若沙門瞿曇問我婆羅門法者，我答瞿曇足合其意耳。」",
        "translation": "If the ascetic Gautama asks me about the teachings of the Brāhmaṇa, my answer to the Gautama will be sufficient to meet his expectations.\"",
        "source": "T01n0001_015:0095c17_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，種德於伽伽池側作是念已，即便前行下車步進，至世尊所，問訊已，一面坐。",
        "translation": "After he thought this, the man of seeds walked forward, alighted, and advanced to the Bhagavān's place, where he was questioned and then sat to one side.",
        "source": "T01n0001_015:0095c18_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，瞻婆城諸婆羅門、長者、居士，或有禮佛而坐者，或有問訊而坐者，或有稱名而坐者，或叉手向佛而坐者，或有默然而坐者。",
        "translation": "At the time, some of the priests, elders, and householders in Campā sat down while paying homage to the Buddha, some sat down while exchanging greetings, some sat down while calling names, some sat down while saluting the Buddha with their palms together, and some sat down while remaining silent.",
        "source": "T01n0001_015:0095c20_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾坐既定，佛知種德婆羅門心中所念，而告之曰：「汝所念者，當隨汝願！」",
        "translation": "After they had all sat down, the Buddha knew what was on the mind of the Brahmin of Seeds and told him, \"Whatever you think, you will have it as you wish!\"",
        "source": "T01n0001_015:0095c23_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛問種德：「汝婆羅門成就幾法？",
        "translation": "The Buddha asked Jñānagupta, \"How many things have you accomplished as a Brāhmaṇa?",
        "source": "T01n0001_015:0095c25_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所言誠實，能不虛妄。」",
        "translation": "What he says is true, and it's not false.\"",
        "source": "T01n0001_015:0095c26_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，種德默自念言：「甚奇！",
        "translation": "At that point, the man of seeds silently thought to himself, \"How marvelous!",
        "source": "T01n0001_015:0095c26_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚特！",
        "translation": "Jeta!",
        "source": "T01n0001_015:0095c27_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門瞿曇有大神力，乃見人心，如我所念而問我義。」",
        "translation": "The ascetic Gautama has great supernormal powers, so he sees people's minds and asks about their meaning as I think about it.\"",
        "source": "T01n0001_015:0095c27_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，種德婆羅門端身正坐，四顧大眾，熙怡而笑，方答佛言：「我婆羅門成就五法，所言至誠，無有虛妄。",
        "translation": "The Brahmin of Seeds then sat correctly with his body upright, looked around at the crowd, and smiled joyfully before answering the Buddha, \"I, the Brahmin, have accomplished five things, and what I say is completely sincere and not false.",
        "source": "T01n0001_015:0095c28_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為五？",
        "translation": "What are the five?",
        "source": "T01n0001_015:0096a01_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者婆羅門七世已來父母真正，不為他人之所輕毀。",
        "translation": "First, a Brāhmaṇa's father and mother have been true for seven generations, and he doesn't let others despise them.",
        "source": "T01n0001_015:0096a02_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者異學三部諷誦通利，種種經書盡能分別，世典幽微靡不綜練，又能善於大人相法、明察吉凶、祭祀儀禮。",
        "translation": "Two, he's a proficient reciter of the three divisions of non-Buddhist studies, can discern all the various sūtras and texts, and doesn't fail to compile all the secular texts and subtleties, and he's skilled at the characteristics of great persons, discerning fortune and misfortune, and performing rituals.",
        "source": "T01n0001_015:0096a03_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者顏貌端正。",
        "translation": "Three, his appearance is correct.",
        "source": "T01n0001_015:0096a05_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者持戒具足。",
        "translation": "Four, he's perfect in upholding precepts.",
        "source": "T01n0001_015:0096a06_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者智慧通達。",
        "translation": "Fifth, his wisdom is well-versed.",
        "source": "T01n0001_015:0096a06_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為五。",
        "translation": "These are the five.",
        "source": "T01n0001_015:0096a06_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞿曇！",
        "translation": "Gautama!",
        "source": "T01n0001_015:0096a07_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門成就此五法，所言誠實，無有虛妄。」",
        "translation": "These five qualities accomplished by a brāhmaṇa are true and nothing is false about what he says.\"",
        "source": "T01n0001_015:0096a07_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉！",
        "translation": "The Buddha said, \"Good!",
        "source": "T01n0001_015:0096a08_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種德！",
        "translation": "Śrīgupta!",
        "source": "T01n0001_015:0096a08_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗有婆羅門於五法中捨一成四，亦所言誠實，無有虛妄，得名婆羅門耶？」",
        "translation": "Could it be that a brāhmaṇa who rejects one of the five qualities and creates four also claims that they are genuine and not false can be called a brāhmaṇa?\"",
        "source": "T01n0001_015:0096a08_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種德白佛言：「有。",
        "translation": "The Āryasiṃha said to the Buddha, \"There is.",
        "source": "T01n0001_015:0096a10_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T01n0001_015:0096a10_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞿曇！",
        "translation": "Gautama!",
        "source": "T01n0001_015:0096a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何用生為？",
        "translation": "Why is there a need to do so?",
        "source": "T01n0001_015:0096a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若婆羅門異學三部諷誦通利，種種經書盡能分別，世典幽微靡不綜練，又能善於大人相法、明察吉凶、祭祀儀禮，顏貌端正，持戒具足，智慧通達；有此四法，則所言誠實，無有虛妄，名婆羅門。」",
        "translation": "If a Brāhmaṇa who has studied the three divisions of scriptures and recites them fluently, can discern all the various sūtras and texts, can compile all the subtleties of worldly texts, is adept at the characteristics of great persons, discerns good and evil fortune, conducts sacrificial rituals, has an upright countenance, observes precepts adequately, and has penetrating wisdom, then he's called a Brāhmaṇa who speaks honestly and without falsehood.\"",
        "source": "T01n0001_015:0096a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告種德：「善哉！",
        "translation": "The Buddha told Śrīgarbha, \"Good!",
        "source": "T01n0001_015:0096a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T01n0001_015:0096a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於此四法中捨一成三者，亦所言誠實，無有虛妄，名婆羅門耶？」",
        "translation": "If one of these four things is rejected as three, is it also true and not false that it's called a brāhmaṇa?\"",
        "source": "T01n0001_015:0096a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種德報言：「有。",
        "translation": "Various virtues replied, \"Yes.",
        "source": "T01n0001_015:0096a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T01n0001_015:0096a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何用生、誦為？",
        "translation": "What is the use of production and recitation?",
        "source": "T01n0001_015:0096a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若婆羅門顏貌端正，持戒具足，智慧通達；成此三者，所言真誠，無有虛妄，名婆羅門。」",
        "translation": "If a brāhmaṇa has a correct appearance, full observance of precepts, and penetrating wisdom, and has accomplished these three things, and what he says is true and not false, he's called a brāhmaṇa.\"",
        "source": "T01n0001_015:0096a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉！",
        "translation": "The Buddha said, \"Good!",
        "source": "T01n0001_015:0096a20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T01n0001_015:0096a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何？",
        "translation": "How is it?",
        "source": "T01n0001_015:0096a21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於三法中捨一成二，彼亦所言至誠，無有虛妄，名婆羅門耶？」",
        "translation": "If they reject one of these three things and form two, are they also called brāhmaṇas when they say they are perfectly sincere and not false?\"",
        "source": "T01n0001_015:0096a21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「有。",
        "translation": "They replied, \"There is.",
        "source": "T01n0001_015:0096a22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T01n0001_015:0096a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何用生、誦及端正為？」",
        "translation": "What is the use of production, recitation, and correctness?\"",
        "source": "T01n0001_015:0096a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，五百婆羅門各各舉聲，語種德婆羅門言：「何故呵止生、誦及與端正，謂為無用？」",
        "translation": "At that point, each of the five hundred brāhmaṇas raised his voice and said to the Brahmins of the Cūḍas, \"Why is it considered useless to criticize the production, recitation, and correctness of words?\"",
        "source": "T01n0001_015:0096a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告五百婆羅門曰：「若種德婆羅門容貌醜陋，無有種姓，諷誦不利，無有辯才、智慧、善答，不能與我言者，汝等可語；若種德顏貌端正，種姓具足，諷誦通利，智慧辯才，善於問答，足堪與我共論義者，汝等且默，聽此人語。」",
        "translation": "It was then that the Bhagavān addressed five hundred brāhmaṇas, \"If a virtuous brāhmaṇa has an ugly appearance, no family, is unfavorable in recitation, lacks eloquence, wisdom, and good answers, and is unable to speak to me, you may speak; if a virtuous man has a good countenance, is well endowed with family, is fluent in recitation, has wisdom and eloquence, and is good at answering questions, and is capable of discussing the meaning with me, you may be silent and listen to this person.\"",
        "source": "T01n0001_015:0096a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，種德婆羅門白佛言：「唯願瞿曇且小停止！",
        "translation": "It was then that the Brahmin of the Cultivating Virtue said to the Buddha, \"Please, Gautama, let's not stop there!",
        "source": "T01n0001_015:0096b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我自以法往訓此人。」",
        "translation": "I myself will teach this person with the Dharma.\"",
        "source": "T01n0001_015:0096b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，種德尋告五百婆羅門曰：「鴦伽摩納今在此眾中，是我外甥，汝等見不？",
        "translation": "It was then that the man of seeds investigated and told five hundred brāhmaṇas, \"Aṅgāmaṇa is here among you, my nephew, do you see him?",
        "source": "T01n0001_015:0096b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今諸大眾普共集此，唯除瞿曇顏貌端正，其餘無及此摩納者；而此摩納殺生、偷盜、淫逸、無禮、虛妄、欺誑，以火燒人，斷道為惡。",
        "translation": "Now, of all the people gathered here, none but the Gautama has a good countenance, and no one else compares to this mona, who kills, steals, commits lust, is impolite, is false, deceives, burns people with fire, and severs the path as evil.",
        "source": "T01n0001_015:0096b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸婆羅門！",
        "translation": "Brāhmaṇas!",
        "source": "T01n0001_015:0096b08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此鴦伽摩納眾惡悉備，然則諷誦、端正，竟何用為？」",
        "translation": "What good is this Aṅgāra-māṇavikā that recites and corrects chanting when all the evils are present?\"",
        "source": "T01n0001_015:0096b08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，五百婆羅門默然不對。",
        "translation": "The five hundred brāhmaṇas then remained silent and didn't respond.",
        "source": "T01n0001_015:0096b09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種德白佛言：「若持戒具足，智慧通達，則所言至誠，無有虛妄，得名婆羅門也。」",
        "translation": "Mañjuśrī said to the Buddha, \"If you fully observe the precepts and comprehend wisdom, then your words are perfectly sincere and not false, and you can be called a brāhmaṇa.\"",
        "source": "T01n0001_015:0096b10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉！",
        "translation": "The Buddha said, \"Good!",
        "source": "T01n0001_015:0096b12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T01n0001_015:0096b12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何？",
        "translation": "How is it?",
        "source": "T01n0001_015:0096b12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種德！",
        "translation": "Śrīgupta!",
        "source": "T01n0001_015:0096b12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於二法中捨一成一，亦所言誠實，無有虛妄，名婆羅門耶？」",
        "translation": "If one of these two things is rejected as one, is it also true what is said and not false, and is it called a brāhmaṇa?\"",
        "source": "T01n0001_015:0096b12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「不得。",
        "translation": "They replied, \"No!",
        "source": "T01n0001_015:0096b14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T01n0001_015:0096b14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戒即智慧，智慧即戒；有戒有智，然後所言誠實，無有虛妄，我說名婆羅門。」",
        "translation": "Morality is wisdom, and wisdom is morality; when there's morality and wisdom, then what's said is honest and not false, and I call it a brāhmaṇa.\"",
        "source": "T01n0001_015:0096b14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉！",
        "translation": "The Buddha said, \"Good!",
        "source": "T01n0001_015:0096b16_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T01n0001_015:0096b16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說，有戒則有慧，有慧則有戒；戒能淨慧，慧能淨戒。",
        "translation": "As you say, with precepts there's wisdom, and with wisdom there's precepts; precepts purify wisdom, and wisdom purifies precepts.",
        "source": "T01n0001_015:0096b16_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種德！",
        "translation": "Seedy virtue!",
        "source": "T01n0001_015:0096b18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如人洗手，左右相須，左能淨右，右能淨左。",
        "translation": "As a person washing their hands, right and left are necessary, and the left purifies the right, while the right purifies the left.",
        "source": "T01n0001_015:0096b18_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此亦如是，有慧則有戒，有戒則有慧，戒能淨慧，慧能淨戒。",
        "translation": "So too, when there's wisdom, there's morality, and when there's morality, there's wisdom; morality purifies wisdom, and wisdom purifies morality.",
        "source": "T01n0001_015:0096b19_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T01n0001_015:0096b20_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戒、慧具者，我說名比丘。」",
        "translation": "When morality and wisdom are complete, I say that's called a monk.\"",
        "source": "T01n0001_015:0096b20_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，種德婆羅門白佛言：「云何為戒？」",
        "translation": "It was then that the Brahmin of Seeds said to the Buddha, \"What are the precepts?\"",
        "source": "T01n0001_015:0096b21_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「諦聽！",
        "translation": "The Buddha said, \"Listen closely!",
        "source": "T01n0001_015:0096b22_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦聽！",
        "translation": "Listen closely!",
        "source": "T01n0001_015:0096b22_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思念之，吾當為汝一一分別。」",
        "translation": "Consider it well, and I will distinguish one part for you.\"",
        "source": "T01n0001_015:0096b22_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「唯然！",
        "translation": "He said, \"Yes!",
        "source": "T01n0001_015:0096b23_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願樂欲聞。」",
        "translation": "May I wish to hear about it.\"",
        "source": "T01n0001_015:0096b23_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告婆羅門曰：「若如來出現於世，應供、正遍知、明行成、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，於諸天、世人、沙門、婆羅門中，自身作證，為他人說，上中下言，皆悉真正，義味具足，梵行清淨。",
        "translation": "It was then that the Bhagavān addressed the Brāhmaṇa, \"Suppose the Tathāgata appeared in the world as Worthy of Offerings, Perfectly Omniscient, Accomplished in Knowledge and Conduct, Well Gone, Understander of the World, Unsurpassed, Trainer, Teacher of Gods and People, Buddha, or Bhagavān, and he himself testified and spoke for others, saying that the higher, middle, and lower words were all true, full of meaning, and purified of the religious practice.",
        "source": "T01n0001_015:0096b23_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若長者、長者子聞此法者，信心清淨；信心清淨已，作如是觀：『在家為難，譬如桎梏；欲修梵行，不得自在。",
        "translation": "If an elder or an elder's son hears this teaching, his faith is purified; after his faith is purified, he observes, 'Being at home is difficult, like being shackled; I want to cultivate the religious practice, but I can't do it freely.",
        "source": "T01n0001_015:0096b28_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今我寧可剃除鬚髮，服三法衣，出家修道。』",
        "translation": "Now, I'd better shave off my hair, put on the three dharma robes, and leave home to cultivate my religious practice.'",
        "source": "T01n0001_015:0096c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於異時捨家財業，棄捐親族，服三法衣，去諸飾好，諷誦毘尼，具足戒律，捨殺不殺，——乃至心法四禪現得歡樂。",
        "translation": "At another time, they abandoned their family's possessions and property, renounced their relatives, put on the three dharma robes, removed their adornments, recited vinaya, completed the precepts, renounced killing and didn't kill, and became happy with the mind and the four meditation states.",
        "source": "T01n0001_015:0096c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T01n0001_015:0096c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯由精勤，專念不忘，樂獨閑居之所得也。",
        "translation": "This is the result of diligence, concentration, and non-forgetfulness, which are attained by enjoying a solitary existence.",
        "source": "T01n0001_015:0096c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T01n0001_015:0096c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為具戒。」",
        "translation": "This is the full set of precepts.\"",
        "source": "T01n0001_015:0096c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「云何為慧？」",
        "translation": "Again, he asked, \"What is wisdom?\"",
        "source": "T01n0001_015:0096c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若比丘以三昧心清淨無穢，柔軟調伏，住不動處，——乃至得三明，除去無明，生於慧明，滅於闇冥，生大法光，出漏盡智。",
        "translation": "The Buddha said, \"Suppose a monk's mind is purified and undefiled by samādhi, is gentle and composed, and abides in a state of immovability, ... up to the point where he attains three kinds of insight, removes ignorance, produces insight, ceases darkness, gives rise to great Dharma light, and produces knowledge that ends contamination.",
        "source": "T01n0001_015:0096c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T01n0001_015:0096c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯由精勤，專念不忘，樂獨閑居之所得也。",
        "translation": "This is the result of diligence, concentration, and non-forgetfulness, which are attained by enjoying a solitary existence.",
        "source": "T01n0001_015:0096c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T01n0001_015:0096c11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為智慧具足。」",
        "translation": "This is the full accomplishment of wisdom.\"",
        "source": "T01n0001_015:0096c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，種德婆羅門白佛言：「今我歸依佛、法、聖眾，唯願聽我於正法中為優婆塞！",
        "translation": "The Bhaiṣajyaguru then said to the Buddha, \"Now that I've come to rely on the Buddha, the Dharma, and the noble ones, may I please be allowed to be an upāsaka in the right Dharma!",
        "source": "T01n0001_015:0096c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自今已後，盡形壽不殺、不盜、不婬、不欺、不飲酒。」",
        "translation": "From now on, I won't kill, steal, commit sexual misconduct, deceive, or drink alcohol for the rest of my life.\"",
        "source": "T01n0001_015:0096c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，種德婆羅門聞佛所說，歡喜奉行。",
        "translation": "The Bhaiṣajyasamudgata Brahmins then heard what the Buddha taught, rejoiced, and approved.",
        "source": "T01n0001_015:0096c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二三）佛說長阿含第三分究羅檀頭經第四",
        "translation": "(23) The Third Part of the Longer Āgamas: The Fourth Sutra of Śrādanta",
        "source": "T01n0001_015:0096c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時，佛在俱薩羅國，與大比丘眾千二百五十人俱，遊行人間，至俱薩羅佉[少/兔]婆提婆羅門村北，止宿尸舍婆林中。",
        "translation": "Thus I have heard: One time, the Buddha was in the country of Kośala and traveled among the people with a great assembly of 1,250 monks and went to the north of the Brahmin village of Kośala Khar[less/rabbit] Bhadrika and stayed in the forest of Śīśva.",
        "source": "T01n0001_015:0096c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有婆羅門名究羅檀頭，止佉[少/兔]婆提村，其村豐樂，人民熾盛，園觀浴池，樹木清涼，波斯匿王即封此村與究羅檀頭婆羅門，以為梵分。",
        "translation": "At the time, there was a Brāhmaṇa named Charadantī who stopped at the village of Khar[less/rabbit] Bhadrika, and that village was so prosperous and full of people, with its gardens, baths, and cool trees, that King Prasenajit granted that village and the Brāhmaṇa of Charadantī a share of the Brahmā.",
        "source": "T01n0001_015:0096c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門七世已來父母真正，不為他人之所輕毀，異學三部諷誦通利，種種經書盡能分別，世典幽微靡不綜練，又能善於大人相法、瞻候吉凶、祭祀儀禮，有五百弟子，教授不廢。",
        "translation": "This Brāhmaṇa had been a true father and mother for seven generations, was not despised by others, was fluent in reciting and reciting the three divisions of Mahīśāsaka, could discern all the various scriptures, and compiled all the secrets and subtleties of worldly scriptures.",
        "source": "T01n0001_015:0096c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門欲設大祀，辦五百特牛、五百牸牛、五百特犢、五百牸犢、五百羖羊、五百羯羊，欲以供祀。",
        "translation": "When the Brāhmaṇas wanted to perform a great sacrifice, they prepared 500 special cattle, 500 female cattle, 500 calves, 500 female calves, 500 ewes, and 500 karmic goats to offer as sacrifices.",
        "source": "T01n0001_015:0096c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，佉[少/兔]婆提村諸婆羅門、長者、居士聞沙門瞿曇釋種子出家成道，從俱薩羅國人間遊行，至佉[少/兔]婆提村北尸舍林止，有大名稱，流聞天下，如來、至真、等正覺，十號具足，於諸天、世人、魔、若魔、天、沙門、婆羅門中，自身作證，為他說法，上中下言，皆悉真正，義味具足，梵行清淨。",
        "translation": "It was then that the brahmans, elders, and householders of Khārsapati village heard that the ascetic Gautama, a son of the Śākyamuni lineage, had left home and become a priest, had marched from the human world in Kośala to the rosewood grove to the north of Khārsapati village, had a great reputation, was widely heard throughout the world, and was known as the Tathāgata, the Supreme Truth, and the Completely Awakened One, complete with the ten epithets, who himself testified and spoke for others among gods, humans, Māra, Wakamuni, gods, ascetics, and brahmans, speaking truly in superior and middle and lower terms, with a full range of meanings and a pure religious practice.",
        "source": "T01n0001_015:0096c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如此真人，應往覲現，今我等寧可往共相見。」",
        "translation": "\"Such a real person would go to see them, but now we'd better go and see them together.\"",
        "source": "T01n0001_015:0097a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作此語已，即便相率，出佉[少/兔]婆提村，隊隊相隨，欲詣佛所。",
        "translation": "After making these remarks, they all left the village of Khar[less/rabbit] in procession, intending to go to the Buddha.",
        "source": "T01n0001_015:0097a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，究羅檀頭婆羅門在高樓上，遙見眾人隊隊相隨，顧問侍者：「彼諸人等，以何因緣隊隊相隨？",
        "translation": "At the time, the brāhmaṇa of Gautama was on a high building and saw the people following in procession from a distance, and he asked an attendant, \"What are the reasons why those people are following in procession?",
        "source": "T01n0001_015:0097a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲何所至？」",
        "translation": "Where do you want to go?\"",
        "source": "T01n0001_015:0097a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "侍者白言：「我聞沙門瞿曇釋種子出家成道，於俱薩羅國遊行人間，詣佉[少/兔]婆提村北尸舍婆林中止，有大名稱，流聞天下，如來、至真、等正覺，十號具足，於諸天、世人、魔、若魔、天、沙門、婆羅門中，自身作證，為他說法，上中下言，皆悉真正，義味具足，梵行清淨。",
        "translation": "The attendant said, \"I've heard that the ascetic Gautama, a son of the Śākyamuni lineage who left home and attained enlightenment, traveled among the people of Kośala and stopped by the Śrāvastī forest to the north of the village of Khar[less/rabbit], had a great reputation that was widely heard around the world, was a tathāgata, a supreme truth, and a perfect enlightenment, was fully equipped with the ten epithets, and was himself a witness among gods, humans, Māra, Wakamuni, gods, ascetics, and priests, teaching others, speaking truly in the superior and inferior languages, with a complete flavor of meaning and a pure religious practice.",
        "source": "T01n0001_015:0097a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此村諸婆羅門、長者、居士眾聚相隨，欲往問訊沙門瞿曇耳。」",
        "translation": "The village was accompanied by a large group of brāhmaṇas, elders, and householders who wanted to go and question the ascetic Gautama.\"",
        "source": "T01n0001_015:0097a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，究羅檀頭婆羅門即勅侍者：「汝速持我聲，往語諸人言：『卿等小住，須待我往，當共俱詣沙門瞿曇。』」",
        "translation": "The scrub-headed brāhmaṇa then commanded his attendant, \"Quickly take my voice and go tell them, 'You must wait for me to come, and we'll all go to the ascetic Gautama.'\"",
        "source": "T01n0001_015:0097a18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼侍者即承教命，往語諸人言：「且住！",
        "translation": "The attendant then complied with the order and went to the men and said, \"Hold it!",
        "source": "T01n0001_015:0097a21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須我往到，當共俱詣沙門瞿曇所。」",
        "translation": "If I'm needed, we'll both go to the ascetic Gautama.\"",
        "source": "T01n0001_015:0097a22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人報使者言：「汝速還白婆羅門：『今正是時，宜共行也。』」",
        "translation": "The men then reported to the messenger, \"Go back to the Brāhmaṇa quickly and tell him, 'Now is the right time to travel together.'\"",
        "source": "T01n0001_015:0097a22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "侍者還白，諸人已住，言：「今正是時，宜共行也。」",
        "translation": "The attendant returned and told them, and they stayed, \"Now is the right time to go together.\"",
        "source": "T01n0001_015:0097a24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門即便下樓，出中門立。",
        "translation": "The brāhmaṇa then went downstairs and stood out the middle gate.",
        "source": "T01n0001_015:0097a25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有餘婆羅門五百人在中門外坐，助究羅檀頭施設大祀，見究羅檀頭，皆悉起迎問言：「大婆羅門！",
        "translation": "At the time, five hundred other Brāhmaṇas were sitting outside the middle gate, helping Mr. Gandharva to perform a great service, and when they saw Mr. Gandharva, they all rose to greet him and said, \"Great Brāhmaṇa!",
        "source": "T01n0001_015:0097a26_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲何所至？」",
        "translation": "Where do you want to go?\"",
        "source": "T01n0001_015:0097a28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "報言：「我聞有沙門瞿曇釋種子出家成道，於俱薩羅國人間遊行，詣佉[少/兔]婆提村北尸舍婆林，有大名稱，流聞天下，如來、至真、等正覺，十號具足，於諸天、世人、沙門、婆羅門中，自身作證，為人說法，上中下言，皆悉真正，義味具足，梵行清淨。",
        "translation": "He reported, \"I've heard that there's an ascetic Gautama, a son of the Śākyamuni lineage, who left home and became a practitioner, traveled among the people of Kośala, went to the Śīśvara grove to the north of the village of Khar[less/rabbit] Bhadrika, had a great reputation, was widely heard throughout the world, was a tathāgata, a supreme truth, and a perfectly enlightened one, and had all ten epithets in full, testified to himself among gods, humans, ascetics, and priests, taught others, spoke truly in the higher and middle-level languages, had a complete flavor of meaning, and had a pure religious practice.",
        "source": "T01n0001_015:0097a28_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此真人，宜往覲現。",
        "translation": "Such a real person would be well-advised to go and visit him.",
        "source": "T01n0001_015:0097b05_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸婆羅門！",
        "translation": "Brāhmaṇas!",
        "source": "T01n0001_015:0097b05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我又聞瞿曇知三種祭祀、十六祀具，今我眾中先學舊識所不能知，我今欲大祭祀，牛羊已備，欲詣瞿曇問三種祭祀、十六祀具，我等得此祭祀法已，功德具足，名稱遠聞。」",
        "translation": "I've also heard that the Gautama knows the three kinds of sacrifices and the 16 ritual implements, but now I want to make a big sacrifice, and now that I have prepared cattle and sheep, I want to go to the Gautama and ask about the three kinds of sacrifices and the 16 ritual implements.",
        "source": "T01n0001_015:0097b05_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，五百婆羅門白究羅檀頭言：「大師勿往，所以者何？",
        "translation": "Five hundred brāhmaṇas then said to Mr. Gautama, \"Great man, don't go there!",
        "source": "T01n0001_015:0097b09_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼應來此，此不應往。",
        "translation": "They should come here, but this one shouldn't go there.",
        "source": "T01n0001_015:0097b11_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大師七世已來父母真正，不為他人之所輕毀，若成此法者，彼應來此，此不應詣彼。」",
        "translation": "The great teacher has been a true father and mother for seven generations, and he won't be despised by others; if he accomplishes this teaching, he should come here, but he shouldn't go there.\"",
        "source": "T01n0001_015:0097b11_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又言：「大師異學三部諷誦通利，種種經書盡能分別，世典幽微無不綜練，又能善於大人相法、瞻相吉凶、祭祀儀禮，成此法者，彼應詣此，此不應詣彼。",
        "translation": "He also said, \"The great teacher is a reciter of the three divisions of the secular teachings, a fluent reciter of all the various sūtras, a thorough discerner of all the secular texts, and a proficient compiler of the major figures, fortunate and inauspicious fortunes, and rituals of sacrifice, so he would come here if he had accomplished this teaching, and he wouldn't go there.",
        "source": "T01n0001_015:0097b13_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又大師顏貌端正，得梵色像，成此法者，彼應詣此，此不應詣彼，又大師戒德增上，智慧成就，成就此法者，彼應詣此，此不應詣彼。",
        "translation": "Also, if he has a good appearance and has attained the image of Brahmā, he should go here, but not there, and if he has increased the virtue of morality and accomplished wisdom and has achieved this teaching, he should go here, but not there.",
        "source": "T01n0001_015:0097b17_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又大師所言柔和，辯才具足，義味清淨，成此法者，彼應詣此，此不應詣彼。」",
        "translation": "Also, if you are a great teacher whose words are gentle, whose eloquence is complete, and whose flavor of meaning is pure, he would come here, and he wouldn't come there.\"",
        "source": "T01n0001_015:0097b20_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又大師為眾導首，弟子眾多，成此法者，彼應詣此，此不應詣彼。",
        "translation": "\"Also, the great teacher is the leader of many people and has many disciples who have accomplished this teaching, so they should go here, and they shouldn't go there.",
        "source": "T01n0001_015:0097b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又大師常教授五百婆羅門，成此法者，彼應詣此，此不應詣彼。",
        "translation": "Also, the great teacher always teaches 500 brāhmaṇas who have accomplished this teaching, so they should come here, and they shouldn't come there.",
        "source": "T01n0001_015:0097b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又大師四方學者皆來請受，問諸技術祭祀之法，皆能具答，成此法者，彼應詣此，此不應詣彼。",
        "translation": "Also, the great teacher invited scholars from all directions to come to him and asked about the technical rituals, and he was able to answer all of them; someone who has accomplished this teaching should come here, and this one shouldn't come there.",
        "source": "T01n0001_015:0097b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又大師為波斯匿王及瓶沙王恭敬供養，成此法者，彼應詣此，此不應詣彼。",
        "translation": "That great teacher was offered respect and offerings by King Prasenajit and King Vibhāṣā, and he would have accomplished that teaching; he would have gone here, but he wouldn't have gone there.",
        "source": "T01n0001_015:0097b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又大師富有財寶，庫藏盈溢，成此法者，彼應詣此，此不應詣彼。",
        "translation": "That great teacher is wealthy and has an overflowing treasury, and he has accomplished this teaching; he should come here, but not here.",
        "source": "T01n0001_015:0097b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又大師智慧明達，所言通利，無有怯弱，成此法者，彼應詣此，此不應詣彼。",
        "translation": "Also, if the great teacher's wisdom is well-understood, his speech is fluent, and he has no faltering, he would have accomplished this teaching; he would have gone here, and he wouldn't have gone there.",
        "source": "T01n0001_015:0097c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大師若具足此十一法，彼應詣此，此不應詣彼。」",
        "translation": "If the great teacher were perfect in these 11 things, he would come here, and he wouldn't come there.\"",
        "source": "T01n0001_015:0097c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，究羅檀頭言：「如是，如是，如汝等言。",
        "translation": "Mr. Kulādanta then said, \"So it is, so it is, just as you say.",
        "source": "T01n0001_015:0097c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我實有此德，非不有也，汝當復聽我說，沙門瞿曇所成功德，我等應詣彼，彼不應來此。",
        "translation": "I really have this virtue, not that I don't have it, and you should listen to me again when I tell you that the ascetic Gautama has accomplished this virtue, and we should come to him, but he shouldn't come here.",
        "source": "T01n0001_015:0097c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門瞿曇七世已來父母真正，不為他人之所輕毀，彼成此法者，我等應詣彼，彼不應來。",
        "translation": "The ascetic Gautama has seven generations of true parents who aren't despised by others, and he has accomplished this teaching; we should go to him, but he shouldn't come.",
        "source": "T01n0001_015:0097c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇顏貌端正，出剎利種，成此法者，我應詣彼，彼不應來。",
        "translation": "The ascetic Gautama is a man of noble appearance who emerges from the bhadra family and has accomplished this teaching, so we should visit him, but he shouldn't come.",
        "source": "T01n0001_015:0097c09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇生尊貴家，出家為道，成此法者，我應詣彼，彼不應來此。",
        "translation": "If the ascetic Gautama was born into a noble family, left home, and became a practitioner, then I should visit him; he shouldn't come here.",
        "source": "T01n0001_015:0097c11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇光明具足，種姓真正，出家修道，成此法者，我應詣彼，彼不應來。",
        "translation": "If another ascetic, the Gautama, has perfect light, is of a genuine lineage, leaves home, cultivates, and accomplishes this teaching, I should visit him, but he shouldn't come.",
        "source": "T01n0001_015:0097c12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇生財富家，有大威力，出家修道，成此法者，我應詣彼，彼不應來。」",
        "translation": "If the ascetic Gautama is wealthy and powerful, leaves home, cultivates his religious life, and accomplishes this teaching, I should visit him, but he shouldn't come.\"",
        "source": "T01n0001_015:0097c14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又沙門瞿曇具賢聖戒，智慧成就，成此法者，我應詣彼，彼不應來。",
        "translation": "\"Also, if the ascetic Gautama possesses good and noble morals and accomplishes wisdom, and he has accomplished this teaching, I should visit him, but he shouldn't come.",
        "source": "T01n0001_015:0097c16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇善於言語，柔軟和雅，成此法者，我應詣彼，彼不應來。",
        "translation": "The ascetic Gautama is skilled in speech and is gentle and refined, and he has accomplished this teaching; I should visit him, but he shouldn't come.",
        "source": "T01n0001_015:0097c18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇為眾導師，弟子眾多，成此法者，我應詣彼，彼不應來。",
        "translation": "The ascetic Gautama is a teacher of many people and has many disciples who have accomplished this teaching, so I should visit him, but he shouldn't come.",
        "source": "T01n0001_015:0097c19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇永滅欲愛，無有卒暴，憂畏已除，衣毛不竪，歡喜和悅，見人稱善，善說行報，不毀餘道，成此法者，我應詣彼，彼不應來。",
        "translation": "The ascetic Gautama permanently ceases craving, has no lassitude, is freed from sorrow and fear, has his clothes and hair standing straight up, is joyous and happy, praises people as good, speaks well of the rewards of his actions, and doesn't disparage other paths; someone who has accomplished this teaching should come to me, but he shouldn't come.",
        "source": "T01n0001_015:0097c21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇常為波斯匿王及瓶沙王禮敬供養，成此法者，我應詣彼，彼不應來。",
        "translation": "The ascetic Gautama always venerates and makes offerings to King Prasenajit and King Vibhāṣā, so I should visit them if they've accomplished this teaching, but they shouldn't come.",
        "source": "T01n0001_015:0097c24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇為沸伽羅娑羅婆羅門禮敬供養，亦為梵婆羅門、多利遮婆羅門、種德婆羅門、首伽摩納兜耶子恭敬供養，成此法者，我應詣彼，彼不應來。」",
        "translation": "The ascetic Gautama also venerates and makes offerings to the Brahmacārṣa Brāhmaṇas, the Bodhisattva Brāhmaṇas, the Prajñāpāramitā Brāhmaṇas, and the Śubharmadhātuṅga, and he makes offerings respectfully to them; if I've accomplished this, I should go there, but they shouldn't come.\"",
        "source": "T01n0001_015:0097c26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又沙門瞿曇為諸聲聞弟子之所宗奉禮敬供養，亦為諸天及諸鬼神之所恭敬，釋種、俱梨、冥寧、跋祇、末羅、蘇摩皆悉宗奉，成此法者，我應詣彼，彼不應來。",
        "translation": "\"Also, the ascetic Gautama is revered and venerated by disciples of the śrāvakas, honored and supported by gods and spirits, and is revered by Śākyamuni, Kuli, Mīlāma, Bhārgī, Mālāma, and Sumeru, to whom I should go and who shouldn't come if I've accomplished this teaching.",
        "source": "T01n0001_015:0097c29_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇波斯匿王及瓶沙王受三歸五戒，成此法者，我應詣彼，彼不應來。",
        "translation": "Also, the ascetic Gautama King Prasenajit and King Vibhāṣā have accepted the three refuges and five precepts, and they have accomplished this, so I should visit them, but they shouldn't come.",
        "source": "T01n0001_015:0098a04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇沸伽羅娑羅婆羅門等受三歸五戒，成此法者，我應詣彼，彼不應來。",
        "translation": "If another ascetic, the Gautama, Boṅgala, Rāṣṭrapāla, or any of the others had received the five precepts of the three refuges and had accomplished this teaching, I would have visited them, but they wouldn't have come.",
        "source": "T01n0001_015:0098a06_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇弟子受三歸五戒，諸天、釋種、俱梨等，受三歸五戒，成此法者，我應詣彼，彼不應來。」",
        "translation": "Also, if there are disciples of the ascetic Gautama who have received the five precepts of the three refuges and gods, Śākyamunis, and Kulis who have received the five precepts of the three refuges and have accomplished this teaching, I should go to them, but they shouldn't come.\"",
        "source": "T01n0001_015:0098a08_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又沙門瞿曇所遊行處，為一切人恭敬供養，成此法者，我應詣彼，彼不應來。",
        "translation": "\"Where the ascetic Gautama travels and makes offerings of respect to all people who have accomplished this teaching, I should visit them, but they shouldn't come.",
        "source": "T01n0001_015:0098a10_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇所至城郭村邑，無不傾動恭敬供養，成此法者，我應詣彼，彼不應來。",
        "translation": "Where the ascetic Gautama goes to cities, towns, and villages, everyone is moved to respect and offer support, and this accomplishes the teaching; I should visit them, but they shouldn't come.",
        "source": "T01n0001_015:0098a12_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇所至之處，非人、鬼神不敢觸嬈，成此法者，我應詣彼，彼不應來。",
        "translation": "Where the ascetic Gautama goes, non-humans and spirits won't dare to touch him, so I should visit him if he's accomplished this, but he shouldn't come.",
        "source": "T01n0001_015:0098a14_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇所至之處，其處人民皆見光明，聞天樂音，成此法者，我應詣彼，彼不應來。",
        "translation": "Where the ascetic Gautama comes, the people there see light and hear the music of the gods, and I should visit them because they wouldn't come if I had accomplished this teaching.",
        "source": "T01n0001_015:0098a16_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇所至之處，若欲去時，眾人戀慕，涕泣而送，成此法者，我應詣彼，彼不應來。」",
        "translation": "Where the ascetic Gautama goes, if the people adore him and weep as he leaves, and this teaching is accomplished, I should go there but he shouldn't come.\"",
        "source": "T01n0001_015:0098a18_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又沙門瞿曇初出家時，父母宗親涕泣戀恨，成此法者，我應詣彼，彼不應來。",
        "translation": "\"Also, when the ascetic Gautama first left home, his parents and relatives wept and yearned for him, which made them realize this teaching, so I should visit him, but he shouldn't come.",
        "source": "T01n0001_015:0098a20_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇少壯出家，捨諸飾好、象馬、寶車、五欲、瓔珞，成此法者，我應詣彼，彼不應來。",
        "translation": "If the ascetic Gautama left home as a young man or young man and abandoned his adornments, elephant and horse, precious chariot, and five desires and jewelry to achieve this Dharma, I should visit him, but he shouldn't come.",
        "source": "T01n0001_015:0098a21_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇捨轉輪王位，出家修道，若其在家，王四天下，統領民物，我等皆屬，成此法者，我應詣彼，彼不應來。」",
        "translation": "If the ascetic Gautama left his position as wheel-turning king and left home to train, or if he were at home and became king of the four worlds and ruled the people's goods, we would all belong to him and achieve this teaching, but he wouldn't come.\"",
        "source": "T01n0001_015:0098a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又沙門瞿曇明解梵法，能為人說，亦與梵天往返語言，成此法者，我應詣彼，彼不應來。",
        "translation": "\"Also, the ascetic Gautama clearly understands the teachings of Brahmā, speaks for people, and goes back and forth with the Brahmā gods, so I should visit them if I've accomplished this teaching, but they shouldn't come.",
        "source": "T01n0001_015:0098a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇明解三種祭祀、十六祀具，我等宿舊所不能知，成此法者，我應詣彼，彼不應來。",
        "translation": "The ascetic Gautama also knows the three kinds of sacrifices and 16 articles of worship that we couldn't know in the past.",
        "source": "T01n0001_015:0098a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇三十二相具足，成此法者，我應詣彼，彼不應來。",
        "translation": "The ascetic Gautama is fully equipped with the thirty-two marks, and I should visit him or her if he or she has accomplished this teaching; he or she shouldn't come.",
        "source": "T01n0001_015:0098b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門瞿曇智慧通達，無有怯弱，成此法者，我應詣彼，彼不應來。",
        "translation": "That ascetic Gautama has well-rounded wisdom and lacks faltering, and he has accomplished this teaching; I should visit him, but he shouldn't come.",
        "source": "T01n0001_015:0098b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼瞿曇來至此佉[少/兔]婆提村，於我為尊，又是貴客，宜往覲現。」",
        "translation": "That Gautama has come to this village of Khar[less/rabbit], is a venerable and honored guest of mine, and it would be appropriate to go to him.\"",
        "source": "T01n0001_015:0098b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，五百婆羅門白究羅檀頭言：「甚奇！",
        "translation": "Five hundred brāhmaṇas then said to Mr. Cūḷadantī, \"How marvelous!",
        "source": "T01n0001_015:0098b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚特！",
        "translation": "Jeta!",
        "source": "T01n0001_015:0098b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼之功德乃如是耶？",
        "translation": "Is this the merit of that?",
        "source": "T01n0001_015:0098b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若使瞿曇於諸德中成就一者，尚不應來，況今盡具？",
        "translation": "If the Gautama had attained one of these virtues, he wouldn't have come, so why would he have attained them all now?",
        "source": "T01n0001_015:0098b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宜盡相率，共往問訊。」",
        "translation": "It's appropriate to go together as a group to inquire about it.\"",
        "source": "T01n0001_015:0098b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "究羅檀頭言：「欲行者，宜知是時。」",
        "translation": "Kulādanta said, \"Those who want to go there should know this is the right time.\"",
        "source": "T01n0001_015:0098b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門即嚴駕寶車，與五百婆羅門及佉[少/兔]婆提諸婆羅門長者、居士，前後圍遶，詣尸舍婆林，到已下車，步進至世尊所，問訊已，一面坐。",
        "translation": "The Brāhmaṇa then drove his jeweled chariot in full splendor, surrounded by 500 Brāhmaṇas and the elders and householders of Khar[lesser/rabbit] Bhadrapāla, went to the Śrāvastī forest, alighted when he arrived, marched over to the Bhagavān, and after inquiring about him, sat down to one side.",
        "source": "T01n0001_015:0098b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸婆羅門、長者，居士，或有禮佛而坐者，或問訊而坐者，或有稱名而坐者，或有叉手向佛而坐者，或有默然而坐者。",
        "translation": "Some of those brāhmaṇas, elders, and householders then paid homage to the Buddha and sat down, some exchanged greetings and sat down, some called names and sat down, some saluted the Buddha with their palms together, and some sat down silently.",
        "source": "T01n0001_015:0098b13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾坐已定，究羅檀頭白佛言：「欲有所問，若有閑暇得見聽者，乃敢請問。」",
        "translation": "After the crowd had settled in their seats, Mr. Kulādanta said to the Buddha, \"I would like to ask a question, but if there's a moment to see and hear it, then I dare to ask it.\"",
        "source": "T01n0001_015:0098b16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「隨意所問。」",
        "translation": "The Buddha said, \"Ask as many questions as you like.\"",
        "source": "T01n0001_015:0098b18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門白佛言：「我聞瞿曇明解三種祭祀及十六種祭具，我等先宿耆舊所不能知，我等今者欲為大祭祀，已辦五百特牛、五百牸牛、五百特犢、五百牸犢、五百羖羊、五百羯羊，欲以祭祀，今日顧來，問三祭法及十六祭具，若得成此祀者，得大果報，名稱遠聞，天人所敬。」",
        "translation": "The Brāhmaṇa then said to the Buddha, \"I've heard that Gautama clearly understands the three kinds of sacrifices and the 16 kinds of ritual implements that our predecessors and elders couldn't understand, and now we want to offer a great sacrifice.",
        "source": "T01n0001_015:0098b18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告究羅檀頭婆羅門曰：「汝今諦聽，諦聽，善思念之，當為汝說。」",
        "translation": "It was then that the Bhagavān addressed the scrub-head Brāhmaṇa, \"Now, listen closely, listen closely, and consider it well; I will explain it for you.\"",
        "source": "T01n0001_015:0098b24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門言：「唯然。",
        "translation": "The Brāhmaṇa said, \"Yes, I will.",
        "source": "T01n0001_015:0098b26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞿曇！",
        "translation": "Gautama!",
        "source": "T01n0001_015:0098b26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願樂欲聞。」",
        "translation": "May I wish to hear about it.\"",
        "source": "T01n0001_015:0098b26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告究羅檀頭曰：「乃往過去久遠世時，有剎利王，水澆頭種，欲設大祀，集婆羅門大臣而告之曰：『我今大有財寶具足，五欲自恣，年已朽邁，士眾強盛，無有怯弱，庫藏盈溢。",
        "translation": "It was then that the Buddha addressed Mr. Cūḷadantī, \"Once upon a time in a distant past, there was a king of the bharis, a water-pourer, who wanted to set up a great festival and gathered Brahman ministers and told them, 'Now, I have great wealth and possessions, the five desires are freely given, I'm old and decrepit, my people are strong and have no weakness, and my treasury is overflowing.",
        "source": "T01n0001_015:0098b27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今欲設大祀，汝等說祀法斯何所須？』",
        "translation": "Now that I want to set up a great sacrifice, what do you need to teach the ritual?'",
        "source": "T01n0001_015:0098c02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼大臣即白王言：『如是。",
        "translation": "The minister then said to the king, 'So it is.",
        "source": "T01n0001_015:0098c03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T01n0001_015:0098c03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如王所言，國富兵強，庫藏盈溢。",
        "translation": "As the king says, his country is rich and its army is strong, and its treasury is overflowing.",
        "source": "T01n0001_015:0098c03_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但諸民物多懷惡心，習諸非法，若於此時而為祀者，不成祀法，如遣盜逐盜，則不成使。",
        "translation": "But many of its people and property harbor evil intentions and are accustomed to unlawful behavior, so if they were to perform sacrifices at this time, they wouldn't be able to perform them, just as sending pirates away to chase away thieves wouldn't be an envoy.",
        "source": "T01n0001_015:0098c04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T01n0001_015:0098c06_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿作是念言，此是我民，能伐能殺，能呵能止。",
        "translation": "\"Don't think, 'This is my people, who are able to cut down and kill, and who are able to chastise and stop.'",
        "source": "T01n0001_015:0098c06_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸近王者當給其所須，諸治生者當給其財寶，諸修田業者當給其牛犢、種子，使彼各各自營。",
        "translation": "Those who are near the king will give them what they need, those who govern life will give them treasure, and those who cultivate the fields will give them calves and seeds, so that each will work separately.",
        "source": "T01n0001_015:0098c07_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王不逼迫於民，則民人安隱，養育子孫，共相娛樂。』」",
        "translation": "When the king doesn't constrain the people, then they'll be peaceful, raise their children and grandchildren, and enjoy each other.'\"",
        "source": "T01n0001_015:0098c10_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告究羅檀頭：「時，王聞諸臣語已，諸親近者給其衣食，諸有商賈給其財寶，修農田者給牛、種子。",
        "translation": "The Buddha told Śrādanta, \"After the king heard what his ministers said, those who were close to him gave them food and clothing, those who were merchants gave them treasure, and those who cultivated the fields gave them oxen and seeds.",
        "source": "T01n0001_015:0098c11_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時人民各各自營，不相侵惱，養育子孫，共相娛樂。」",
        "translation": "The people then each worked individually, refrained from harassing each other, raised their children, and enjoyed each other's company.\"",
        "source": "T01n0001_015:0098c13_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「時，王復召諸臣語言：『我國富兵強，庫藏盈溢，給諸人民，使無所乏，養育子孫，共相娛樂。",
        "translation": "The Buddha said, \"The king then summoned his ministers and said, 'My country is rich and its army is strong, its treasury is overflowing, and I give to the people so that they have nothing to lack, nourish their children, and entertain each other.",
        "source": "T01n0001_015:0098c14_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今欲設大祀，汝說祀法悉何所須？』",
        "translation": "Now, I want to establish a great festival; what do you need to teach about the rituals?'",
        "source": "T01n0001_015:0098c17_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸臣白王：『如是，如是，如王所說。",
        "translation": "The ministers said to the king, 'So it is, so it is, as the king has said.",
        "source": "T01n0001_015:0098c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國富兵強，庫藏盈溢，給諸人民，使其無乏，養育子孫，共相娛樂。",
        "translation": "The king's army is rich and strong, his treasury is overflowing, and he provides for his people so that they have no need and raise their children and grandchildren for their mutual enjoyment.",
        "source": "T01n0001_015:0098c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王欲祀者，可語宮內使知。』",
        "translation": "If the king wants to offer sacrifice, he can tell the palace envoy to know about it.'",
        "source": "T01n0001_015:0098c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，王即如臣言，入語宮內：『我國富兵強，庫藏盈溢，多有財寶，欲設大祀。』",
        "translation": "The king then did as the minister said and went inside the palace and told him, 'My country is rich and has a strong army, its treasury is overflowing, and there are many treasures that I want to offer as a great sacrifice.'",
        "source": "T01n0001_015:0098c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸夫人尋白王言：『如是，如是，如大王言。",
        "translation": "The ladies then sought out the king and said, 'So it is, just as the great king said.",
        "source": "T01n0001_015:0098c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國富兵強，庫藏盈溢，多有珍寶，欲設大祀，今正是時。』",
        "translation": "The country is rich, its army is strong, its treasury is overflowing, and there are many treasures that make it desirable to establish a great sacrifice. Now is the right time.'",
        "source": "T01n0001_015:0098c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王出報諸臣言：『我國富兵強，庫藏盈溢，給諸人民，使其無乏，養育子孫，共相娛樂。",
        "translation": "The king went out to his ministers and said, 'My country is rich and its army is strong, its treasury is overflowing, and it gives to its people so that they have nothing to lose and nurtures their children and grandchildren for their mutual enjoyment.",
        "source": "T01n0001_015:0098c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今欲大祀，已語宮內，汝盡語我，斯須何物？』」",
        "translation": "Now, I want to offer a great sacrifice, and I've spoken to you inside the palace; tell me everything you can, what do I need?'\"",
        "source": "T01n0001_015:0098c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，諸大臣即白王言：『如是，如是，如王所說。",
        "translation": "\"The ministers then said to the king, 'So it is, so it is, just as the king has said.",
        "source": "T01n0001_015:0098c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲設大祀，已語宮內，而未語太子、皇子、大臣、將士，王當語之。』",
        "translation": "The king has spoken to the palace about the great sacrifice he wants to set up, but he hasn't spoken to the crown prince, the prince, the ministers, or the generals, so the king will speak to them.'",
        "source": "T01n0001_015:0098c28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，王聞諸臣語已，即語太子、皇子、群臣、將士言：『我國富兵強，庫藏盈溢，欲設大祀。』",
        "translation": "After hearing what the ministers said, the king then spoke to the crown prince, the prince's son, the ministers, and the generals, saying, 'My country is rich and has a strong army, and its treasury is overflowing; I want to establish a great sacrifice.'",
        "source": "T01n0001_015:0099a01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，太子、皇子及諸群臣、將士即白王言：『如是，如是，大王！",
        "translation": "The prince, the prince, the ministers, and the generals then said to the king, 'So it is, great king!",
        "source": "T01n0001_015:0099a03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今國富兵強，庫藏盈溢，欲設祀者，今正是時。』",
        "translation": "Now is the time when the country's army is rich and strong, and its treasury is overflowing with people who want to set up a festival.'",
        "source": "T01n0001_015:0099a04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，王復告大臣曰：『我國富兵強，多有財寶，欲設大祀。",
        "translation": "The king then again told his ministers, 'My country is rich and has a strong army and lots of treasure, and I want to set up a great sacrifice.",
        "source": "T01n0001_015:0099a05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已語宮內、太子、皇子，乃至將士，今欲大祀，斯何所須？』",
        "translation": "I've already told the palace, the crown prince, the prince's son, and even the generals that I want to make a great sacrifice, so what do I need?'",
        "source": "T01n0001_015:0099a06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸臣白王：『如大王言，欲設祀者，今正是時。』",
        "translation": "The ministers said to the king, 'As the king said, now is the right time to set up a festival.'",
        "source": "T01n0001_015:0099a07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞語已，即於城東起新堂舍，王入新舍，被鹿皮衣，以香酥油塗摩其身，又以鹿角戴之頭上，牛屎塗地，坐臥其上，及第一夫人、婆羅門、大臣，選一黃牸牛，一乳王食，一乳夫人食，一乳大臣食，一乳供養大眾，餘與犢子。",
        "translation": "After the king heard what they said, he built a new hall on the east side of the city. The king entered the new hall, put on deerskin clothing, rubbed ghee over his body, put deer horns on his head, smeared cow dung on the ground, sat down on them, and chose a yellow cow, the first lady, a brāhmaṇa, and a minister to feed the king, one to feed the lady, one to feed the minister, one to feed the people, and the rest to give to the calves.",
        "source": "T01n0001_015:0099a08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，王成就八法，大臣成就四法。」",
        "translation": "The king then fulfilled eight qualities, and the minister fulfilled four qualities.\"",
        "source": "T01n0001_015:0099a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何王成就八法？",
        "translation": "\"What were the eight things the king accomplished?",
        "source": "T01n0001_015:0099a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼剎利王七世以來父母真正，不為他人所見輕毀，是為成就初法。",
        "translation": "That warrior king's parents have been true for seven generations, and he doesn't let others see and disparage them is the accomplishment of the first dharma.",
        "source": "T01n0001_015:0099a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼王顏貌端正，剎利種族，是為二法。",
        "translation": "That king's appearance is correct, and he's of the Śāriputra lineage, which is the second thing.",
        "source": "T01n0001_015:0099a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼王戒德增盛，智慧具足，是為三法。",
        "translation": "The king's virtue of morality and his wisdom are complete, which are the third thing.",
        "source": "T01n0001_015:0099a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼王習種種技術，乘象、馬車、刀牟、弓矢、戰鬪之法，無不具知，是為四法。",
        "translation": "The king has cultivated various skills, riding elephants, chariots, swords, bows, arrows, and the rules of combat, which he knows well, and these are the fourth dharma.",
        "source": "T01n0001_015:0099a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼王有大威力，攝諸小王，無不靡伏，是為五法。",
        "translation": "That king has great authority that subdues lesser kings without fail, which are five things.",
        "source": "T01n0001_015:0099a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼王善於言語，所說柔軟，義味具足，是為六法。",
        "translation": "That king is skilled in speech, and what he teaches is gentle and full of meaning, which are the six qualities.",
        "source": "T01n0001_015:0099a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼王多有財寶，庫藏盈溢，是為七法。",
        "translation": "That king has a lot of wealth and treasure, and his treasury is overflowing, which are seven things.",
        "source": "T01n0001_015:0099a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼王智謀勇果，無復怯弱，是為八法。",
        "translation": "That king's wisdom, strategy, and courage are fruitful, and he's no longer fainthearted, which are eight things.",
        "source": "T01n0001_015:0099a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼剎利種王，成此八法。」",
        "translation": "These are the eight qualities accomplished by that king of the Śāriputra lineage.\"",
        "source": "T01n0001_015:0099a24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何大臣成就四法？",
        "translation": "\"How has the minister accomplished four things?",
        "source": "T01n0001_015:0099a24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼婆羅門大臣七世以來父母真正，不為他人所見輕毀，是為初法。",
        "translation": "That minister of a Brāhmaṇa's family has been genuine for seven generations, and he doesn't let others see or disparage them, which is the first teaching.",
        "source": "T01n0001_015:0099a25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，彼大臣異學三部諷誦通利，種種經書皆能分別，世典幽微靡不綜練，又能善於大人相法、瞻察吉凶、祭祀儀禮，是為二法。",
        "translation": "Furthermore, that minister is a novice who's fluent in reciting and reciting the three divisions of the secular world, able to discern all the various sūtras and texts, and who's skilled in the characteristics of great persons, examining fortune and fortune, and conducting sacrificial rituals is two things.",
        "source": "T01n0001_015:0099a26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，大臣善於言語，所說柔和，義味具足，是為三法。",
        "translation": "Furthermore, a minister who is skilled in speech, whose discourse is gentle and full of meaning, these are three things.",
        "source": "T01n0001_015:0099a29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，大臣智謀勇果，無有怯弱，凡祭祀法無不解知，是為四法。",
        "translation": "Furthermore, the minister's wisdom, strategy, courage, and fruitfulness have no faltering, and he doesn't fail to understand all the rituals and laws that are offered, which are four things.",
        "source": "T01n0001_015:0099b01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼王成就八法，婆羅門大臣成就四法，彼王有四援助、三祭祀法、十六祀具。」",
        "translation": "At the time, that king accomplished eight things, and the minister of the brāhmaṇa accomplished four things; the king had four supports, three sacrificial rituals, and 16 ritual implements.\"",
        "source": "T01n0001_015:0099b03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，婆羅門大臣於彼新舍，以十六事開解王意，除王疑想。",
        "translation": "\"At the time, the minister of the brāhmaṇa explained 16 things to the king in his new abode, ridding him of any doubt.",
        "source": "T01n0001_015:0099b05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何十六？",
        "translation": "What are the sixteen?",
        "source": "T01n0001_015:0099b06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大臣白王，或有人言：『今剎利王欲為大祀，而七世以來父母不正，常為他人所見輕毀。』",
        "translation": "The ministers told the king that some people might say, 'Now, King Śāriputra wants to perform a great sacrifice, but for seven generations his father and mother haven't been right, and they've always been despised by others in their eyes.'",
        "source": "T01n0001_015:0099b06_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有此言，不能污王。",
        "translation": "Even if someone said that, it wouldn't defile the king.",
        "source": "T01n0001_015:0099b08_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T01n0001_015:0099b09_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王七世以來父母真正，不為他人之所輕毀。",
        "translation": "For seven generations, the king's parents were true, and he didn't let others despise them.",
        "source": "T01n0001_015:0099b09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有人言：『今剎利王欲為大祀，而顏貌醜陋，非剎利種。』",
        "translation": "Some people may say, 'Now, the king of Śāriputra wants to perform a great sacrifice, but his appearance is ugly, so he's not from the Śāriputra lineage.'",
        "source": "T01n0001_015:0099b10_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有此言，不能污王，所以者何？",
        "translation": "Even if someone said that, it wouldn't defile the king, so why is that?",
        "source": "T01n0001_015:0099b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王顏貌端正，剎利種族。",
        "translation": "The king's features are correct, and he's from the Śāriputra clan.",
        "source": "T01n0001_015:0099b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有人言：『今剎利王欲為大祀，而無增上戒，智慧不具。』",
        "translation": "Some people say, 'Now, the king of the Śāriyas wants to offer a great sacrifice, but he lacks superior morality and doesn't have the wisdom to do so.'",
        "source": "T01n0001_015:0099b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有此言，不能污王，所以者何？",
        "translation": "Even if someone said that, it wouldn't defile the king, so why is that?",
        "source": "T01n0001_015:0099b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王戒德增上，智慧具足。",
        "translation": "The king's virtue for morality is increased, and his wisdom is complete.",
        "source": "T01n0001_015:0099b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有人言：『今剎利王欲為大祀，而不善諸術，乘象、馬車、種種兵法不能解知。』",
        "translation": "Some people say, 'Now, King Śāriputra wants to perform a great sacrifice, but he's not good at the arts and doesn't understand elephant rides, horse chariots, or various military techniques.'",
        "source": "T01n0001_015:0099b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有此言，不能污王，所以者何？",
        "translation": "Even if someone said that, it wouldn't defile the king, so why is that?",
        "source": "T01n0001_015:0099b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王善諸技術，戰陣兵法，無不解知。",
        "translation": "The king is skilled at all techniques and doesn't lack knowledge of the arts of warfare and armaments.",
        "source": "T01n0001_015:0099b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有人言：『王欲為大祀，而無大威力攝諸小王。』",
        "translation": "Some people say, 'The king wants to offer a great sacrifice, but he lacks the authority to subdue lesser kings.'",
        "source": "T01n0001_015:0099b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有是言，不能污王，所以者何？",
        "translation": "Suppose someone says that, but it doesn't defile the king, why is that?",
        "source": "T01n0001_015:0099b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王有大威力，攝諸小王。」",
        "translation": "The king has great authority, and he subdues lesser kings.\"",
        "source": "T01n0001_015:0099b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「或有人言：『王欲大祀，而不善於言語，所說麤獷，義味不具。』",
        "translation": "\"Perhaps someone says, 'The king wants to make a great sacrifice, but he's not good at words, and what he says is coarse and lacks meaning.'",
        "source": "T01n0001_015:0099b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有此言，不能污王，所以者何？",
        "translation": "Even if such words exist, they can't defile the king, so why is that?",
        "source": "T01n0001_015:0099b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王善於言語，所說柔軟，義味具足。",
        "translation": "The king is skilled in speech, and what he teaches is gentle and full of meaning.",
        "source": "T01n0001_015:0099b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有人言：『王欲大祀，而無多財寶。』",
        "translation": "Some people say, 'The king wants to make a great sacrifice, but he doesn't have a lot of wealth and treasure.'",
        "source": "T01n0001_015:0099b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有是言，不能污王，所以者何？",
        "translation": "Suppose someone says that, but it doesn't defile the king, why is that?",
        "source": "T01n0001_015:0099b25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王庫藏盈溢，多有財寶。",
        "translation": "The king's treasury is overflowing with wealth and treasure.",
        "source": "T01n0001_015:0099b26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有人言：『王欲大祀，而無智謀，志意怯弱。』",
        "translation": "Some people say, 'The king wants to make a great sacrifice, but he lacks wisdom and strategy, and his intentions are weak.'",
        "source": "T01n0001_015:0099b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有是言，不能污王，所以者何？",
        "translation": "Suppose someone says that, but it doesn't defile the king, why is that?",
        "source": "T01n0001_015:0099b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王智謀勇果，無有怯弱。",
        "translation": "The king is wise, bold, and resolute, with no faltering.",
        "source": "T01n0001_015:0099b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有人言：『王欲大祀，不語宮內。』",
        "translation": "Perhaps someone says, 'The king wants to perform a great sacrifice, but he won't speak inside the palace.'",
        "source": "T01n0001_015:0099b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有是語，不能污王，所以者何？",
        "translation": "Even if such words exist, they can't defile the king, so why is that?",
        "source": "T01n0001_015:0099c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王欲祭祀，先語宮內。",
        "translation": "When the king wants to offer a sacrifice, he first tells the palace.",
        "source": "T01n0001_015:0099c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有人言：『王欲大祀，而不語太子、皇子。』",
        "translation": "Some people may say, 'The king wants to offer a great sacrifice, but he doesn't tell the crown prince or the prince.'",
        "source": "T01n0001_015:0099c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有此言，不能污王，所以者何？",
        "translation": "Even if such words exist, they can't defile the king; why is that?",
        "source": "T01n0001_015:0099c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王欲祭祀，先語太子、皇子。",
        "translation": "When the king wants to offer sacrifice, he first speaks to the crown prince and the prince's son.",
        "source": "T01n0001_015:0099c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有人言：『王欲大祀，不語群臣。』",
        "translation": "Some people may say, 'The king wants to offer a great sacrifice, but he won't tell the ministers.'",
        "source": "T01n0001_015:0099c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有此言，不能污王，所以者何？",
        "translation": "Even if such words exist, they can't defile the king.",
        "source": "T01n0001_015:0099c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王欲大祀，先語群臣。",
        "translation": "When the king wants to offer a great sacrifice, he first speaks to the ministers.",
        "source": "T01n0001_015:0099c06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有人言：『王欲大祀，不語將士。』",
        "translation": "Some people say, 'When the king wants to offer a great sacrifice, he doesn't talk to the generals.'",
        "source": "T01n0001_015:0099c06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有此言不能污王，所以者何？",
        "translation": "Suppose this kind of talk doesn't defile the king, why is that?",
        "source": "T01n0001_015:0099c07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王欲祭祀，先語將士。」",
        "translation": "When the king wants to make a sacrifice, he first tells the general.\"",
        "source": "T01n0001_015:0099c08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「或有人言：『王欲大祀，而婆羅門大臣七世以來父母不正，常為他人之所輕毀。』",
        "translation": "\"Perhaps someone says, 'The king wants to make a big sacrifice, but the minister of the Brāhmaṇa has had incorrect parents for seven generations and has always been despised by others.'",
        "source": "T01n0001_015:0099c08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有是語，不能污王，所以者何？",
        "translation": "If such words exist, they can't defile the king; why is that?",
        "source": "T01n0001_015:0099c10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我七世以來父母真正，不為他人所見輕毀。",
        "translation": "For seven generations, my parents have been true, and I won't let others see and despise them.",
        "source": "T01n0001_015:0099c11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有人言：『王欲大祀，而大臣於異學三部諷誦不利，種種經書不能分別，世典幽微亦不綜練，不能善於大人相法、瞻察吉凶、祭祀儀禮。』",
        "translation": "Perhaps someone says, 'The king wants to perform a great sacrifice, but his minister is not proficient at reciting the three divisions of non-Buddhist teachings, can't discern the various scriptures, and doesn't compile the subtleties of worldly scriptures, so he's not skilled in the characteristics of adults, examining fortune and fortune, or performing sacrificial rituals.'",
        "source": "T01n0001_015:0099c12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有此言，不能污王，所以者何？",
        "translation": "If he said this, it wouldn't defile the king, so why is that?",
        "source": "T01n0001_015:0099c15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於三部異典諷誦通利，種種經書皆能分別，世典幽微靡不綜練，又能善於大人相法、瞻察吉凶、祭祀儀禮。",
        "translation": "I'm fluent in reciting the three different scriptures, I can discern all the various sūtras and texts, and I'm able to compile the subtleties of worldly texts, and I'm skilled at the characteristics of adults, examining fortune and misfortune, and conducting sacrificial rituals.",
        "source": "T01n0001_015:0099c16_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有人言：『王欲大祀，而大臣不善言語，所說麤獷，義味不具。』",
        "translation": "Some people may say, 'The king wants to offer a great sacrifice, but his ministers aren't good with words, and what they say is coarse and lacks meaning and flavor.'",
        "source": "T01n0001_015:0099c19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有此言，不能污王，所以者何？",
        "translation": "Even if such words exist, they can't defile the king, so why is that?",
        "source": "T01n0001_015:0099c20_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我善言語，所說柔和，義味具足。",
        "translation": "I'm a good speaker, and what I say is gentle and full of meaning.",
        "source": "T01n0001_015:0099c21_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有人言：『王欲大祀，而大臣智謀不具，志意怯弱，不解祀法。』",
        "translation": "Some people say, 'The king wants a great sacrifice, but his ministers are not wise or resourceful, and their intentions are weak; they don't understand the ritual.'",
        "source": "T01n0001_015:0099c22_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有是言，不能污王，所以者何？",
        "translation": "Suppose someone says that, but it doesn't defile the king, why is that?",
        "source": "T01n0001_015:0099c23_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我智謀勇果，無有怯弱，凡祭祀法，無不解知。」",
        "translation": "I have the fruit of wisdom, courage, and no faltering, and I don't understand all the rituals and laws that are offered.\"",
        "source": "T01n0001_015:0099c24_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告究羅檀頭：「彼王於十六處有疑，而彼大臣以十六事開解王意。」",
        "translation": "The Buddha told Mr. Gautama, \"The king had doubts about 16 places, and that minister explained 16 things to the king.\"",
        "source": "T01n0001_015:0099c25_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「時，大臣於彼新舍，以十事行示教利喜於王。",
        "translation": "The Buddha said, \"At the time, the minister at his new abode showed the king ten things to do that would benefit and delight him.",
        "source": "T01n0001_015:0099c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為十？",
        "translation": "What are the ten?",
        "source": "T01n0001_015:0099c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大臣言：『王祭祀時，諸有殺生、不殺生來集會者，平等施與，若有殺生而來者，亦施與，彼自當知，不殺而來者，亦施與，為是故施，如是心施。",
        "translation": "The minister said, 'The king gives equally to those who come to the assembly during the festival, whether they kill living beings or not, and if they kill living beings and come, they also give, and they should know it for themselves; if they don't kill and come, they also give; for this reason, they give, and so they give.",
        "source": "T01n0001_015:0099c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有偷盜、邪婬、兩舌、惡口、妄言、綺語、貪取、嫉妬、邪見來在會者，亦施與，彼自當知，若有不盜，乃至正見來者，亦施與，為是故施，如是心施。』」",
        "translation": "If another person comes to the meeting stealing, committing sexual misconduct, duplicity, harsh words, false speech, fancy speech, craving, jealousy, or wrong views, also give, and they should know it for themselves; if another person comes who doesn't steal or even has right views, also give, for this reason give, and thus give with these thoughts.'\"",
        "source": "T01n0001_015:0100a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「彼大臣以此十行示教利喜。」",
        "translation": "The Buddha told the Brāhmaṇa, \"That minister showed this ten practices to teach benefit and joy.\"",
        "source": "T01n0001_015:0100a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告婆羅門：「時，彼剎利王於彼新舍生三悔心，大臣滅之。",
        "translation": "Again, he told the Brāhmaṇa, \"At the time, that king of the bhadraites had three repentances at his new abode, which the minister ended.",
        "source": "T01n0001_015:0100a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為三？",
        "translation": "What are the three?",
        "source": "T01n0001_015:0100a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王生悔言：『我今大祀，已為大祀、當為大祀、今為大祀，多損財寶，起此三心，而懷悔恨。』",
        "translation": "The king repented, saying, 'Now, I've made a great sacrifice, have made a great sacrifice, will make a great sacrifice, and am making a great sacrifice now, and I've damaged much treasure, so I've given rise to these three thoughts and have regretted them.'",
        "source": "T01n0001_015:0100a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大臣語言：『王已為大祀，已施、當施、今施，於此福祀不宜生悔。』",
        "translation": "The ministers said, 'The king has made a great sacrifice and has given, will give, and will give now, so it's not appropriate for him to become regretful about this meritorious sacrifice.'",
        "source": "T01n0001_015:0100a10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為王入新舍生三悔心，大臣滅之。」",
        "translation": "This is the reason the king entered the new abode and gave rise to these three thoughts of remorse, which the minister extinguished.\"",
        "source": "T01n0001_015:0100a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「爾時，剎利王水澆頭種，以十五日月滿時出彼新舍，於舍前露地然大火[卄/積]，手執油瓶注於火上，唱言：『與，與。』",
        "translation": "The Buddha told the Brāhmaṇa, \"At the time, the king of Śāriputra poured water on his seeds, and when the moon was full for fifteen days, he left his new abode, built a huge fire [20/gallons] on the bare ground in front of it, put a flask of oil in his hand, and poured it on the fire, saying, 'Give, give!'",
        "source": "T01n0001_015:0100a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼王夫人聞王以十五日月滿時出新舍，於舍前然大火[卄/積]，手執油瓶注於火上，唱言：『與，與。』",
        "translation": "When the king's wife heard that the king had built a new dwelling on the fifteenth day when the moon was full, she built a huge fire [twenty/gallons] in front of it, put a flask of oil in her hand, and poured it on the fire, and called out, 'Give, give!'",
        "source": "T01n0001_015:0100a15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼夫人、婇女多持財寶，來詣王所，而白王言：『此諸雜寶，助王為祀。』",
        "translation": "That lady and her daughter brought much treasure to the king and said to him, 'These are various treasures that will help him make offerings.'",
        "source": "T01n0001_015:0100a17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T01n0001_015:0100a19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼王尋告夫人、婇女言：『止！",
        "translation": "The king then addressed his wife and daughters, saying, 'Stop!",
        "source": "T01n0001_015:0100a19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止！",
        "translation": "Stop!",
        "source": "T01n0001_015:0100a20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝便為供養已，我自大有財寶，足以祭祀。』",
        "translation": "After you make this offering, I will have a great treasure of my own, enough for a sacrifice.'",
        "source": "T01n0001_015:0100a20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸夫人、婇女自生念言：『我等不宜將此寶物還於宮中，若王於東方設大祀時，當用佐助。』",
        "translation": "The ladies and concubine then had the thought, 'It wouldn't be appropriate for us to return this treasure to the palace, but if the king were to perform a great ritual in the east, we would use it as an aid.'",
        "source": "T01n0001_015:0100a21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T01n0001_015:0100a23_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其後王於東方設大祀時，夫人、婇女即以此寶物助設大祀。」",
        "translation": "When the king then set up a great sacrifice in the east, the ladies and daughters helped set up the great sacrifice with this treasure.\"",
        "source": "T01n0001_015:0100a23_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，太子、皇子聞王十五日月滿時出新舍，於舍前然大火[卄/積]，手執油瓶注於火上，唱言：『與，與。』",
        "translation": "\"When the crown prince and his sons heard that the king had reopened his abode on the fifteenth day after the moon was full, they built a huge fire in front of the abode [20/gallons], put a flask of oil in their hands, and put it on the fire, saying, 'Give, give!'",
        "source": "T01n0001_015:0100a25_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼太子、皇子多持財寶，來詣王所，白王言：『以此寶物，助王大祀。』",
        "translation": "The prince and the prince's son brought much treasure and came to the king and said, 'This treasure will help the king make a great sacrifice.'",
        "source": "T01n0001_015:0100a27_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『止！",
        "translation": "The king said, 'Stop!'",
        "source": "T01n0001_015:0100a28_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止！",
        "translation": "Stop!",
        "source": "T01n0001_015:0100a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝便為供養已，我自大有財寶，足已祭祀。』",
        "translation": "After you make this offering, I will have a great treasure of my own that will be sufficient for sacrifice.'",
        "source": "T01n0001_015:0100a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸太子、皇子自生念言：『我等不宜持此寶物還也，王若於南方設大祀者，當以佐助。』",
        "translation": "The princes and princes themselves had the thought, 'It wouldn't be appropriate for us to return with these treasures, but if the king sets up a great sacrifice in the south, we'll help him.'",
        "source": "T01n0001_015:0100b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是大臣持寶物來：『願已助王祭祀西方。』",
        "translation": "The ministers then brought their treasures and said, 'May I help the king perform the ritual in the west.'",
        "source": "T01n0001_015:0100b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將士持寶物來：『願已助王祭祀北方。』」",
        "translation": "The generals brought their treasures and said, 'May I help the king make offerings to the north.'\"",
        "source": "T01n0001_015:0100b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「彼王大祭祀時，不殺牛、羊及諸眾生，唯用酥、乳、麻油、蜜、黑蜜、石蜜，以為祭祀。」",
        "translation": "The Buddha told the Brāhmaṇa, \"When he makes a great sacrifice, the king doesn't kill cattle, sheep, or other sentient beings but uses butter, milk, sesame oil, honey, black honey, and rock honey to make the sacrifice.\"",
        "source": "T01n0001_015:0100b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「彼剎利王為大祀時，初喜、中喜，後亦喜，此為成辦祭祀之法。」",
        "translation": "The Buddha told the Brāhmaṇa, \"When he makes a great sacrifice, that king of the bhadra rejoices in the beginning, middle, and end, and this is the method by which he accomplishes the sacrifice.\"",
        "source": "T01n0001_015:0100b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「彼剎利王為大祀已，剃除鬚髮，服三法衣，出家為道，修四無量心，身壞命終，生梵天上。",
        "translation": "The Buddha told the Brāhmaṇa, \"After he made the great sacrifice, that king Śāriputra shaved off his hair, put on the three dharma robes, left home, became a practitioner, cultivated the four immeasurable states of mind, and was born in the Brahma Heaven when his body broke up and his life ended.",
        "source": "T01n0001_015:0100b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，王夫人為大施已，亦復除髮，服三法衣，出家修道，行四梵行，身壞命終，生梵天上。",
        "translation": "After making a great offering, the king's wife also shaved off her hair, put on the three dharma robes, left home, cultivated the path, and practiced the four pure practices; when her body broke up and her life ended, she was born up in the Brahma Heaven.",
        "source": "T01n0001_015:0100b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門大臣教王四方祭祀已，亦為大施，然後剃除鬚髮，服三法衣，出家修道，行四梵行，身壞命終，生梵天上。」",
        "translation": "After the minister Brāhmaṇa taught the king to go around making offerings, he also made a great offering, shaved off his hair, put on the three dharma robes, left home, cultivated his religious life, performed the four brahma practices, and was born up in the Brahma Heaven when his body broke up and his life ended.\"",
        "source": "T01n0001_015:0100b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「時，王為三祭祀法、十六祀具，而成大祀，於汝意云何？」",
        "translation": "The Buddha told the Brāhmaṇa, \"What do you think about the three sacrificial rituals and sixteen ritual implements that the king made into a great sacrifice?\"",
        "source": "T01n0001_015:0100b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，究羅檀頭聞佛言已，默然不對。",
        "translation": "After hearing what the Buddha had said, Mr. Gautama remained silent and didn't respond.",
        "source": "T01n0001_015:0100b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，五百婆羅門語究羅檀頭言：「沙門瞿曇所言微妙，大師何故默然不答？」",
        "translation": "Five hundred brāhmaṇas then said to Mr. Shraddharma, \"Why did the ascetic Gautama remain silent and not answer what he said, which is so subtle?\"",
        "source": "T01n0001_015:0100b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "究羅檀頭答言：「沙門瞿曇所說微妙，我非不然可，所以默然者。",
        "translation": "\"Kulādanta replied, 'I didn't reject the ascetic Gautama's explanation of its subtleties, so I remained silent.",
        "source": "T01n0001_015:0100b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自思惟耳，沙門瞿曇說此事，不言從他聞，我默思惟：『沙門瞿曇將無是彼剎利王耶？",
        "translation": "I myself thought, 'Did the ascetic Gautama say this and not say he heard it from someone else, and I silently thought, 'Will the ascetic Gautama ever be that king of the bhadras?'",
        "source": "T01n0001_015:0100b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或是彼婆羅門大臣耶？』」",
        "translation": "Or is he a minister of a brāhmaṇa?'\"",
        "source": "T01n0001_015:0100b23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告究羅檀頭曰：「善哉！",
        "translation": "It was then that the Bhagavān addressed Mr. Kulādanta, \"Good!",
        "source": "T01n0001_015:0100b23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T01n0001_015:0100b24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝觀如來，正得其宜。",
        "translation": "\"You've observed the Tathāgata, and it's exactly right for you.",
        "source": "T01n0001_015:0100b24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，剎利王為大祀者，豈異人乎？",
        "translation": "Was King Śāriputra a different person who made a great sacrifice at that time?",
        "source": "T01n0001_015:0100b25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿造斯觀，即吾身是也，我於爾時極大施慧。」",
        "translation": "Don't create this contemplation, for this is me, and at the time I gave great generosity and wisdom.\"",
        "source": "T01n0001_015:0100b25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "究羅檀頭白佛言：「齊此三祭祀及十六祀具得大果報，復有勝者耶？」",
        "translation": "Kulādanta said to the Buddha, \"Is there another great reward for making these three sacrifices and these 16 sacrifices?\"",
        "source": "T01n0001_015:0100b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有。」",
        "translation": "The Buddha said, \"There is.\"",
        "source": "T01n0001_015:0100b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「何者是？」",
        "translation": "He asked, \"Which one is it?\"",
        "source": "T01n0001_015:0100b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「於此三祭祀及十六祀具，若能常供養眾僧，使不斷者，功德勝彼。」",
        "translation": "The Buddha said, \"If you can always make offerings to the saṃgha and keep them going, these three sacrifices and 16 articles of worship will have greater merit than that.\"",
        "source": "T01n0001_015:0100b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「於三祭祀及十六祀具，若能常供養眾僧使不斷者，為此功德最勝，復有勝者耶？」",
        "translation": "He also asked, \"If you can always make offerings to the saṃgha and keep them going, is that the most meritorious, or is there another superior?\"",
        "source": "T01n0001_015:0100c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有。」",
        "translation": "The Buddha said, \"There is.\"",
        "source": "T01n0001_015:0100c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「何者是？」",
        "translation": "And he asked, \"Which one is it?\"",
        "source": "T01n0001_015:0100c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若以三祭祀及十六祀具并供養眾僧使不斷者，不如為招提僧起僧房堂閣，此施最勝。」",
        "translation": "The Buddha said, \"If you were to offer three sacrifices and 16 articles of worship to the saṃgha so that they wouldn't stop, it wouldn't be better than building a residence for the soliciting saṃgha, which is the most meritorious gift.\"",
        "source": "T01n0001_015:0100c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「為三祭祀及十六祀具，并供養眾僧使不斷絕，及為招提僧起僧房堂閣，為此福最勝，復有勝者耶？」",
        "translation": "He also asked, \"Would it be better to offer three sacrifices and 16 articles of worship to the saṃgha and make offerings to them so that they don't stop, or to build a residence for the soliciting saṃgha, which would be the most meritorious?\"",
        "source": "T01n0001_015:0100c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有。」",
        "translation": "The Buddha said, \"There is.\"",
        "source": "T01n0001_015:0100c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「何者是？」",
        "translation": "And he asked, \"Which one is it?\"",
        "source": "T01n0001_015:0100c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若為三種祭祀、十六祀具，供養眾僧使不斷絕，及為招提僧起僧房堂閣，不如起歡喜心，口自發言：『我歸依佛，歸依法，歸依僧。』",
        "translation": "The Buddha said, \"If you make offerings to the three kinds of sacrifices and 16 articles of worship, make offerings to the saṃgha that never end, or build a residence for the solicitation of the saṃgha, why don't you rejoice and say, 'I take refuge in the Buddha, in the Dharma, and in the saṃgha.'",
        "source": "T01n0001_015:0100c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此福最勝。」",
        "translation": "This merit is most excellent.\"",
        "source": "T01n0001_015:0100c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「齊此三歸，得大果報耶？",
        "translation": "Again, he asked, \"By aligning these three refuges, will he attain their great rewards?",
        "source": "T01n0001_015:0100c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有勝者？」",
        "translation": "Is there another victor?\"",
        "source": "T01n0001_015:0100c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有。」",
        "translation": "The Buddha said, \"There is.\"",
        "source": "T01n0001_015:0100c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「何者是？」",
        "translation": "And he asked, \"Which one is it?\"",
        "source": "T01n0001_015:0100c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若以歡喜心受、行五戒，盡形壽不殺、不盜、不婬、不欺、不飲酒，此福最勝。」",
        "translation": "The Buddha said, \"If someone accepts and practices the five precepts with a joyful mind and spends their whole life not killing, not stealing, not committing sexual misconduct, not deceiving, and not drinking alcohol, this is the most meritorious.\"",
        "source": "T01n0001_015:0100c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「齊此三祀，至於五戒，得大果報耶？",
        "translation": "He also asked, \"What's the great reward of aligning these three sacrifices with the five precepts?",
        "source": "T01n0001_015:0100c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有勝者？」",
        "translation": "Is there another victor?\"",
        "source": "T01n0001_015:0100c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有。」",
        "translation": "The Buddha said, \"There is.\"",
        "source": "T01n0001_015:0100c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「何者是？」",
        "translation": "And he asked, \"Which one is it?\"",
        "source": "T01n0001_015:0100c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若能以慈心念一切眾生，如搆牛乳頃，其福最勝。」",
        "translation": "The Buddha said, \"If you can be mindful of all sentient beings with kindness, it's like tilting the calf's milk in an instant, and it will bring the most merit.\"",
        "source": "T01n0001_015:0100c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「齊此三祀，至於慈心，得大果報耶？",
        "translation": "He also asked, \"By making these three offerings equal, will this reach the mind of kindness and attain a great result?",
        "source": "T01n0001_015:0100c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有勝者？」",
        "translation": "Is there another victor?\"",
        "source": "T01n0001_015:0100c20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有。」",
        "translation": "The Buddha said, \"There is.\"",
        "source": "T01n0001_015:0100c20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「何者是？」",
        "translation": "And he asked, \"Which one is it?\"",
        "source": "T01n0001_015:0100c20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若如來、至真、等正覺出現於世，有人於佛法中出家修道，眾德悉備，乃至具足三明，滅諸癡冥，具足慧明，所以者何？",
        "translation": "The Buddha said, \"If the Tathāgata, the supremely true, and the perfectly enlightened appeared in the world and someone left home and cultivated in the Buddha's teachings, they would be fully endowed with all the virtues up to the perfection of the three insights, the cessation of delusion, and the perfection of the insight, why is that?",
        "source": "T01n0001_015:0100c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不放逸、樂閑靜故，此福最勝。」",
        "translation": "This is the most meritorious because they aren't careless and enjoy calmness.\"",
        "source": "T01n0001_015:0100c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "究羅檀頭又白佛言：「瞿曇！",
        "translation": "Again, Kauṇḍinya said to the Buddha, \"Gautama!",
        "source": "T01n0001_015:0100c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我為祭祀，具諸牛羊各五百頭，今盡放捨，任其自遊隨逐水草。",
        "translation": "I had 500 head of each of those oxen and sheep for the festival, but now I've let them all go and left them to wander freely, following the water and grass.",
        "source": "T01n0001_015:0100c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今歸依佛，歸依法，歸依僧，聽我於正法中為優婆塞，自今以後，盡形壽不殺、不盜、不婬、不欺、不飲酒，唯願世尊及諸大眾時受我請。」",
        "translation": "Now, I take refuge in the Buddha, the Dharma, and the saṃgha, and I'd like to be allowed to be an upāsaka in the right Dharma; from now on, I won't kill, steal, commit sexual misconduct, deceive, or drink alcohol for the rest of my life; may the Bhagavān and the great people accept my invitation at this time.\"",
        "source": "T01n0001_015:0100c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊默然受之。",
        "translation": "At that point, the Bhagavān quietly accepted it.",
        "source": "T01n0001_015:0100c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門見佛默然受請已，即起禮佛，繞三匝而去，還家供辦種種餚饍。",
        "translation": "Seeing that the Buddha had quietly accepted the invitation, the Brāhmaṇa then rose, paid homage to the Buddha, circled him three times, and departed, returning home to serve various foods.",
        "source": "T01n0001_015:0101a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明日時到，爾時，世尊著衣持鉢，與大比丘眾千二百五十人俱，詣婆羅門舍，就座而坐。",
        "translation": "When the time arrived tomorrow, the Bhagavān put on his robe and took his bowl with him, went to the Brāhmaṇa's residence with a large assembly of 1,250 monks, and took his seat.",
        "source": "T01n0001_015:0101a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門手自斟酌，供佛及僧，食訖去鉢，行澡水畢，佛為婆羅門而作頌曰：「祭祀火為上，　　諷誦詩為上，　人中王為上，　　眾流海為上，　星中月為上，　　光明日為上，　上下及四方，　　諸有所生物，　天及世間人，　　唯佛為最上，　欲求大福者，　　當供養三寶。」",
        "translation": "When he finished eating, he removed his bowl and drank water. The Buddha then composed a verse for the Brāhmaṇa, saying, \"Fire is the greatest sacrifice, recitation of poetry is the greatest, the king among men is the greatest, the ocean of many currents is the greatest, the moon among the stars is the greatest, the sun of light is the greatest, the highest, the lowest, the four directions, all living things, gods, and people of the world, but the Buddha is the greatest.",
        "source": "T01n0001_015:0101a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，究羅檀頭婆羅門即取一小座於佛前坐。",
        "translation": "At that point, the scrub-headed Brāhmaṇa took a small seat and sat down in front of the Buddha.",
        "source": "T01n0001_015:0101a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊漸為說法，示教利喜，施論、戒論、生天之論，欲為大患，上漏為礙，出要為上，分布顯示諸清淨行。",
        "translation": "The Bhagavān then gradually explained the teaching, showing how to bring benefit and joy, discussing generosity, morality, and birth in heaven, making desire a great danger, the contaminants an obstruction, and the essentials an advantage, and distributing and displaying all pure practices.",
        "source": "T01n0001_015:0101a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊觀彼婆羅門志意柔軟，陰蓋輕微，易可調伏，如諸佛常法，為說苦諦，分別顯示，說集聖諦、集滅聖諦、出要聖諦。",
        "translation": "Observing that this Brāhmaṇa's intentions were gentle and his hindrances mild and easy to subdue, the Bhagavān then explained the truth of suffering as the constant teaching of the buddhas, discerning and revealing it, and explained the noble truth of accumulation, the noble truth of accumulation and cessation, and the noble truth of renunciation.",
        "source": "T01n0001_015:0101a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，究羅檀頭婆羅門即於座上遠塵離垢，得法眼淨。",
        "translation": "From his seat, the investigating Brahmins then became dustless and spotless and attained purification of the Dharma eye.",
        "source": "T01n0001_015:0101a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如淨潔白疊，易為受染，檀頭婆羅門亦復如是，見法得法，獲果定住，不由他信，得無所畏，而白佛言：「我今重再三歸依佛、法、聖眾，願佛聽我於正法中為優婆塞，自今已後，盡形壽不殺、不盜、不婬、不欺、不飲酒。」",
        "translation": "Like a pure white pile that's easily defiled, the daṇḍa-headed brāhmaṇa likewise sees the teaching and attains its fruitful abiding, attains fearlessness without faith from others, and says to the Buddha, \"Now, I once again and again rely on the Buddha, the teaching, and the noble ones, and may the Buddha hear me become an upāsaka in the right teaching and, from now on, spend my whole life not killing, not stealing, not committing sexual misconduct, not deceiving, and not drinking alcohol.\"",
        "source": "T01n0001_015:0101a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "重白佛言：「唯願世尊更受我七日請。」",
        "translation": "He repeatedly said to the Buddha, \"Please, Bhagavān, accept my invitation for another seven days.\"",
        "source": "T01n0001_015:0101a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊默然受之。",
        "translation": "The Bhagavān then quietly accepted it.",
        "source": "T01n0001_015:0101a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門即於七日中，手自斟酌，供佛及僧，過七日已，世尊遊行人間。",
        "translation": "For seven days, the Brāhmaṇa then poured out his own offerings to the Buddha and the saṃgha, and after seven days had passed, the Bhagavān wandered among the people.",
        "source": "T01n0001_015:0101a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛去未久，時，究羅檀頭婆羅門得病命終。",
        "translation": "Not long after the Buddha's departure, the Brāhmaṇa of Cūḷadantī became ill and died.",
        "source": "T01n0001_015:0101a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，眾多比丘聞究羅檀頭供養佛七日，佛去未久，得病命終，即自念言：「彼人命終，當何所趣？」",
        "translation": "When a large group of monks heard that Cūḷadantī had made offerings to the Buddha for seven days and that he had died of illness not long after the Buddha had left, they thought to themselves, \"Where will that person go when his life ends?\"",
        "source": "T01n0001_015:0101b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸比丘詣世尊所，頭面禮足，於一面坐。",
        "translation": "The monks then went to the Bhagavān, bowed their heads and feet, and sat to one side.",
        "source": "T01n0001_015:0101b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼究羅檀頭今者命終，當生何所？」",
        "translation": "\"Where will he be born when his life ends?\"",
        "source": "T01n0001_015:0101b04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「彼人淨修梵行，法法成就，亦不於法有所觸嬈，以斷五下分結，於彼現般涅槃，不來此世。」",
        "translation": "The Buddha addressed the monks, \"That person's pure cultivation of the religious practice, accomplishes everything, doesn't get into trouble with the Dharma, and has ended the five lower bonds by manifesting into nirvāṇa and not coming to this world.\"",
        "source": "T01n0001_015:0101b05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At the time, the monks who heard what the Buddha taught rejoiced and handed it down.",
        "source": "T01n0001_015:0101b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說長阿含經卷第十五",
        "translation": "Foshuo Chang'ahan jing, vol. 15",
        "source": "T01n0001_015:0101b09_0",
        "is_bad_quality": false
    }
]