[
    {
        "source_sentence": "佛說漏分布經(出《中阿含》令劫意)後漢三藏安世高譯聞如是：一時，佛在拘留國行治處名為法。",
        "translation": "The Sutra on the Distribution of Contaminants (from the Commentary on the Middle Length Āgamas) was translated and heard by An Shigao, the Tripiṭaka of the Latter Han Dynasty, as follows: \"One time, the Buddha was in detention at a place called Dharma that he administered.",
        "source": "T01n0057_001:0851b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，拘留國人會在。",
        "translation": "At the time, the people of Detention were present.",
        "source": "T01n0057_001:0851c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，佛告：「諸比丘！」",
        "translation": "The Buddha then told them, \"Monks!\"",
        "source": "T01n0057_001:0851c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘應：「唯然。」",
        "translation": "The monks responded, \"Yes, I did.\"",
        "source": "T01n0057_001:0851c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘從佛聞。",
        "translation": "The monk heard it from the Buddha.",
        "source": "T01n0057_001:0851c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛便告如是：「比丘聽。",
        "translation": "The Buddha then told him thus, \"Monks, listen!",
        "source": "T01n0057_001:0851c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當為說法，上起亦利、中起亦利、遍竟亦利，有利有方便，具足現意行。",
        "translation": "This teaching will be beneficial when it's given above, beneficial when it's given in the middle, and beneficial when it's given everywhere, beneficial with method, and complete with present-minded action.",
        "source": "T01n0057_001:0851c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當為聽真，諦受為念聽說。」",
        "translation": "You must listen to the truth, accept it with care, and hear it explained.\"",
        "source": "T01n0057_001:0851c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘應：「唯如是。」",
        "translation": "The monk responded, \"Only thus.\"",
        "source": "T01n0057_001:0851c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘便從佛聞。",
        "translation": "The monk then heard it from the Buddha.",
        "source": "T01n0057_001:0851c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便說是：「比丘！",
        "translation": "He then said, \"Monks!",
        "source": "T01n0057_001:0851c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知漏，亦當知漏從本有，亦當知從漏受殃，亦當知漏分布，亦當知漏盡，亦當知受何行令漏畢。",
        "translation": "You should know the contaminants, know that the contaminants originally exist, know that you'll be condemned by the contaminants, know that the contaminants are distributed, know that the contaminants are exhausted, and know what actions you'll accept that will cause the contaminants to end.",
        "source": "T01n0057_001:0851c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘！",
        "translation": "\"Monks!",
        "source": "T01n0057_001:0851c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知痛，亦當知痛從本有，亦當知從痛受殃，亦當知痛分布，亦當知痛盡，亦當知受何行令痛畢。",
        "translation": "You should know pain, and you should know that pain comes from the past, and you should know that you'll be afflicted by pain, and you should know that pain will be distributed, that pain will be ended, and what actions you'll take to bring pain to an end.",
        "source": "T01n0057_001:0851c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘！",
        "translation": "\"Monks!",
        "source": "T01n0057_001:0851c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知思想，亦當知思想從本有，亦當知從思想受殃，亦當知思想分布，亦當知思想盡，亦當知受何行令思想畢。",
        "translation": "You should know thought, and you should know that thought exists from the beginning, and you should know that you'll receive blame from thought, and you should know that thought is distributed, and you should know that thought is exhausted, and you should know what actions you'll accept that will cause thought to end.",
        "source": "T01n0057_001:0851c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘！",
        "translation": "\"Monks!",
        "source": "T01n0057_001:0851c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知愛欲，亦當知愛欲從本有，亦當知從愛欲受殃，亦當知愛欲分布，亦當知愛欲盡，亦當知受何行令愛欲畢。",
        "translation": "You should know about craving, and you should know that craving exists from the beginning, and you should know that you're subject to misfortune from craving, and you should know that craving is distributed, and you should know that it's ended, and you should know what actions cause craving to end.",
        "source": "T01n0057_001:0851c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘！",
        "translation": "\"Monks!",
        "source": "T01n0057_001:0851c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知行，亦當知行從本有，亦當知從行受殃，亦當知行分布，亦當知行盡，亦當知受何行令行畢。",
        "translation": "You should know actions, and you should know that actions exist from the beginning, that you'll receive blame for actions, that they'll be distributed, that they'll be exhausted, and that you'll know what actions you'll accept so that they'll be completed.",
        "source": "T01n0057_001:0851c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘！",
        "translation": "\"Monks!",
        "source": "T01n0057_001:0851c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知苦，亦當知苦從本有，亦當知從苦受殃，亦當知苦分布，亦當知苦盡，亦當知受何行令苦畢。",
        "translation": "They should know suffering, and they should know that suffering exists from the beginning, that they'll be afflicted by suffering, that they'll distribute suffering, that they'll end suffering, and that they'll know what actions they'll take that will bring suffering to an end.",
        "source": "T01n0057_001:0851c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘！",
        "translation": "\"Monks!",
        "source": "T01n0057_001:0851c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知漏，亦當知漏從本有，亦當知從漏受殃，亦當知漏分布，亦當知漏盡，亦當知受何行令漏畢。",
        "translation": "You should know the contaminants, know that the contaminants originally exist, know that you'll receive blame from the contaminants, know the distribution of the contaminants, know the end of the contaminants, and know what actions you'll take that will cause the contaminants to end.",
        "source": "T01n0057_001:0851c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知漏？",
        "translation": "\"What's the proper knowledge of the contaminants?",
        "source": "T01n0057_001:0851c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂有三漏：一為欲漏，二為有漏，三為癡漏；如是為知漏。",
        "translation": "There are three contaminants: first, the contaminants of desire, second, the contaminants of existence, and third, the contaminants of delusion; such are the contaminants of knowing.",
        "source": "T01n0057_001:0851c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知漏從本有？",
        "translation": "\"What are the contaminants of knowing when they originally existed?",
        "source": "T01n0057_001:0852a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂癡為漏本，從是本有；如是為知漏從本有。",
        "translation": "It means that delusion is the root of the contaminants and exists from this source; this is how to know that the contaminants exist from this source.",
        "source": "T01n0057_001:0852a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知從漏受殃？",
        "translation": "\"How is it to know that you're condemned by the contaminants?",
        "source": "T01n0057_001:0852a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂從癡行漏，所行如從，殃亦如行受，或墮好處或墮惡處；如是為知從漏受殃。",
        "translation": "It means that someone who acts based on delusion and conducts contaminants conducts himself in this way, and the misfortune is received in this way, either falling into good places or into bad places; this is called knowing that he'll receive misfortune based on contaminants.",
        "source": "T01n0057_001:0852a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知漏分布？",
        "translation": "\"What's the distribution of contaminants that should be known?",
        "source": "T01n0057_001:0852a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂墮地獄是為行異，或墮畜生是為行異，或墮餓鬼是為行異，或墮天上是為行異，或墮人中是為行異；如是為知漏分布。",
        "translation": "It means falling to hell is a change in behavior, falling to animals is a change in behavior, falling to hungry ghosts is a change in behavior, falling to heaven is a change in behavior, or falling among humans is a change in behavior; such is the knowledge of the distribution of contaminants.",
        "source": "T01n0057_001:0852a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知漏盡？",
        "translation": "\"What's the proper way to know the end of the contaminants?",
        "source": "T01n0057_001:0852a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂癡已盡，漏便盡、如便盡；如是為知漏盡。",
        "translation": "Once delusion has ended, the contaminants will end, and so they will end; this is called knowing that the contaminants have ended.",
        "source": "T01n0057_001:0852a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知受行令漏畢？",
        "translation": "\"What is the contaminants that will end when you know you've received the practice?",
        "source": "T01n0057_001:0852a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂是八種道行：一為直見，二為直更，三為直語，四為直行，五為直業，六為直方便，七為直念，八為直定；如是為知受行令漏畢。",
        "translation": "These are the eight practices of the path: first, direct vision, second, direct change, third, direct speech, fourth, direct action, fifth, direct conduct, sixth, direct skillful means, seven, direct mindfulness, and eighth, direct concentration; thus are the contaminants brought to an end by knowing and accepting the practice.",
        "source": "T01n0057_001:0852a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸比丘！",
        "translation": "If you monks!",
        "source": "T01n0057_001:0852a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘已知漏如是，知漏從本有如是，知從漏受殃如是，知漏分布如是，知漏盡如是，知受行令漏畢如是，是名為比丘悔厭世間，行清淨，得道令漏盡畢。",
        "translation": "A monk who knows the contaminants as they are, knows that the contaminants exist from the beginning as they do, knows that he'll suffer misfortune from the contaminants as he does, knows that the contaminants will be distributed as they are, knows that the contaminants will end as they do, and knows that he'll accept actions that will cause the contaminants to end as they do is called a monk who repents of disillusionment with the world, practices purity, and attains the path that will bring about the end of the contaminants.",
        "source": "T01n0057_001:0852a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘！",
        "translation": "\"Monks!",
        "source": "T01n0057_001:0852a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知痛，亦當知痛從本有，亦當知從痛受殃，亦當知痛分布，亦當知痛盡，亦當知受何行令痛畢。",
        "translation": "They should know pain, and they should know that pain exists from the beginning, that they'll be afflicted by pain, that they'll distribute pain, that they'll know the end of pain, and that they'll know what actions to accept that will cause pain to end.",
        "source": "T01n0057_001:0852a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知痛？",
        "translation": "\"What's the appropriate knowledge of pain?",
        "source": "T01n0057_001:0852a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂有三痛：一為樂痛，二為苦痛，三為亦不樂亦不苦痛；如是為知痛。",
        "translation": "There are three kinds of pain: first, pleasant pain, second, painful pain, and third, pain that's neither pleasant nor painful; such is the knowledge of pain.",
        "source": "T01n0057_001:0852a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知痛從本有？",
        "translation": "\"How is pain known to exist from the beginning?",
        "source": "T01n0057_001:0852a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂本思望；如是為知痛從本有。",
        "translation": "This is called originally conceived; thus is known as pain that comes from being present in the past.",
        "source": "T01n0057_001:0852a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知從痛受殃？",
        "translation": "\"How is it to know that you're suffering from pain?",
        "source": "T01n0057_001:0852a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂有所思，更是為苦；如是為知從痛受殃。",
        "translation": "It's called having deliberation, which is painful, and thus knowing that you'll be afflicted by pain.",
        "source": "T01n0057_001:0852a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知痛分布？",
        "translation": "\"What's the distribution of pain that should be known?",
        "source": "T01n0057_001:0852a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在比丘！",
        "translation": "At the bhikṣu!",
        "source": "T01n0057_001:0852a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘樂痛更，樂痛更知；苦痛更，苦痛更知；不樂不苦痛更，不樂不苦痛更知；樂痛身更，樂痛身更知；苦痛身更，苦痛身更知；不樂不苦痛身更，不樂不苦痛身更知；樂痛念更，樂痛念更知；苦痛念更，苦痛念更知；不樂不苦痛念更，不樂不苦痛念更知；樂痛望得，樂痛望得知；苦痛望得，苦痛望得知；不樂不苦痛望得，不樂不苦痛望得知；樂痛不望得，樂痛不望得知；苦痛不望得，苦痛不望得知；不樂不苦痛不望得，不樂不苦痛不望得知。",
        "translation": "比丘樂痛更，樂痛更知；苦痛更，苦痛更知；不樂不苦痛更，不樂不苦痛更知；樂痛身更，樂痛身更知；苦痛身更，苦痛身更知；不樂不苦痛身更，不樂不苦痛身更知；樂痛念更，樂痛念更知；苦痛念更，苦痛念更知；不樂不苦痛念更，不樂不苦痛念更知；樂痛望得，樂痛望得知；苦痛望得，苦痛望得知；不樂不苦痛望得，不樂不苦痛望得知；樂痛不望得，樂痛不望得知；苦痛不望得，苦痛不望得知；不樂不苦痛不望得，不樂不苦痛不望得知。",
        "source": "T01n0057_001:0852a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂痛家中居，樂痛家中居知；苦痛家中居，苦痛家中居知；不樂不苦痛家中居，不樂不苦痛家中居知；樂痛離家中居，樂痛離家中居知；苦痛離家中居，苦痛離家中居知；不樂不苦痛離家中居，不樂不苦痛離家中居知；如是為知痛分布。",
        "translation": "They know that they'll live in a pleasant and painful home, know that they'll live in a painful home, know that they'll live in a painful home, know that they'll live in a home that's neither pleasant nor painful, know that they'll live in a home that's neither pleasant nor painful, know that they'll live in a home that's free of pleasant pain, know that they'll live in a home that's free of pleasant pain, know that they'll live in a home that's free of pain, know that they'll live in a home that's free of pain, and know that they'll live in a home that's free of pain that's neither pleasant nor painful; such is the knowledge of the distribution of pain.",
        "source": "T01n0057_001:0852b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知痛盡？",
        "translation": "\"What's the knowledge of the end of pain?",
        "source": "T01n0057_001:0852b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂念思却，痛便盡；如是為知痛盡。",
        "translation": "It's called knowing that the pain will end when the thought is abandoned; this is called knowing that the pain has ended.",
        "source": "T01n0057_001:0852b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知受行令痛畢？",
        "translation": "\"What is the pain that results from knowing and doing what's right?",
        "source": "T01n0057_001:0852b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂是八種道行：一為直見，二為直更，三為直語，四為直行，五為直業，六為直方便，七為直念，八為直定；如是為知受行令痛畢。",
        "translation": "These are the eight kinds of path practices: first, direct vision, second, direct change, third, direct speech, fourth, direct action, fifth, direct action, sixth, direct skillful means, seven, direct mindfulness, and eighth, direct concentration; such are the painful completion of knowing, feeling, and doing.",
        "source": "T01n0057_001:0852b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘！",
        "translation": "If monks!",
        "source": "T01n0057_001:0852b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘已知痛如是，知痛從本有如是，知從痛受殃如是，知痛分布如是，知痛盡如是，知受行令痛畢如是，名為比丘悔厭世間，行清淨，得道令痛盡畢。",
        "translation": "A monk who has known pain as it is, knows that pain comes from the past as it is, knows that he's suffering from pain as it is, knows that pain is distributed as it is, knows that pain has ended as it is, and knows that he's received actions that bring pain to an end as it is is called a monk who repents of disillusionment with the world, practices purity, and attains the path that brings pain to an end.",
        "source": "T01n0057_001:0852b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘！",
        "translation": "\"Monks!",
        "source": "T01n0057_001:0852b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知思想，亦當知思想從本有，亦當知從思想受殃，亦當知思想分布，亦當知思想盡，亦當知受何行令思想畢。",
        "translation": "You should know thought, and you should know that thought exists from the beginning, that you'll receive blame from thought, that you'll distribute thought, that you'll end thought, and that you'll know what actions to accept to bring thought to completion.",
        "source": "T01n0057_001:0852b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知思想？",
        "translation": "\"What's the proper knowledge of thought?",
        "source": "T01n0057_001:0852b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂有四思想：一為少思想，二為多思想，三為無有量思想，四為無所有不用思想；如是為知思想。",
        "translation": "There are four kinds of thought: first, little thought, second, much thought, third, immeasurable thought, and fourth, unneeded thought; such is the knowledge of thought.",
        "source": "T01n0057_001:0852b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知思想從本有？",
        "translation": "\"How does knowing thought come from the beginning?",
        "source": "T01n0057_001:0852c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂本為思想；如是為知思想從本有。",
        "translation": "This is called thinking in the past; thus is known as thinking that comes from the past.",
        "source": "T01n0057_001:0852c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知從思想受殃？",
        "translation": "\"How is it to know that [it's] from thoughts that one is subject to misfortune?",
        "source": "T01n0057_001:0852c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂如思想為，如思想行，是名為行；如是為知從思想受殃。",
        "translation": "This is called doing as one thinks and doing as one thinks; thus is the knowledge of the calamity received from thinking.",
        "source": "T01n0057_001:0852c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知思想分布？",
        "translation": "\"What's the distribution of thought that should be known?",
        "source": "T01n0057_001:0852c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂色思想為異，聲思想亦異，香思想亦異，味思想亦異，身更麤細思想亦異；如是為知思想分布。",
        "translation": "It means that thoughts of form are different, thoughts of sound are different, thoughts of fragrance are different, thoughts of taste are different, and thoughts of the body are different in terms of their coarseness and subtlety; this is called knowing the distribution of thoughts.",
        "source": "T01n0057_001:0852c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知思想盡？",
        "translation": "\"What is the exhaustion of thought that should be known?",
        "source": "T01n0057_001:0852c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂思想已盡，思想便盡；如是為知思想盡。",
        "translation": "It means that once thought has ended, thought will end; this is called knowing that thought has ended.",
        "source": "T01n0057_001:0852c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知受行令思想畢？",
        "translation": "\"What's the end of knowing and accepting practice so that thought is exhausted?",
        "source": "T01n0057_001:0852c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂是八種道行：一為直見，二為直更，三為直語，四為直行，五為直業，六為直方便，七為直念，八為直定；如是為知受行令思想畢。",
        "translation": "These are the eight practices of the path: first, direct views, second, direct changes, third, direct speech, fourth, direct actions, fifth, direct deeds, sixth, direct skillful means, seven, direct mindfulness, and eighth, direct concentration; such is the knowledge, acceptance, and practice that lead to the completion of thought.",
        "source": "T01n0057_001:0852c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸比丘！",
        "translation": "If you monks!",
        "source": "T01n0057_001:0852c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘已知思想如是，知思想從本有如是，知從思想受殃如是，知思想分布如是，知思想盡如是，知受行令思想畢如是，是名為比丘悔厭世間，行清淨，得道令思想盡畢。",
        "translation": "A monk who has known thought as such, knows that thought comes from the past as such, knows that he's under pain from thought as such, knows that thought is distributed as such, knows that thought has ended as such, and knows that he's received actions that cause thought to end as such is called a monk who repents of disillusionment with the world, practices purity, and attains the path that causes thought to end.",
        "source": "T01n0057_001:0852c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘！",
        "translation": "\"Monks!",
        "source": "T01n0057_001:0852c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知愛欲，亦當知愛欲從本有，亦當知從愛欲受殃，亦當知愛欲分布，亦當知愛欲盡，亦當知受何行令愛欲畢。",
        "translation": "You should know about craving, and you should know that craving exists from the beginning, that you're subject to misfortune from craving, that you're distributing craving, that you're ending craving, and what actions you're accepting that bring craving to an end.",
        "source": "T01n0057_001:0852c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知愛欲？",
        "translation": "\"What's the proper knowledge of desire?",
        "source": "T01n0057_001:0852c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂愛欲為五種欲，得欲、最在心欲、愛色隨意可貪相近。",
        "translation": "There are five kinds of desire, which are the desire to attain, the desire to be most present in the mind, and the desire for form as one wishes.",
        "source": "T01n0057_001:0852c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T01n0057_001:0852c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一為眼可色欲，得欲、最在心欲、愛色隨意可貪相近；二為耳可聲欲，得欲、最在心欲、愛色隨意可貪相近；三為鼻可香欲，得欲、最在心欲、愛色隨意可貪相近；四為口得味欲，得欲、最在心欲、愛色隨意可貪相近；五為身得麤細更知欲，得欲、最在心欲、愛色隨意可貪相近；如是為知愛欲。",
        "translation": "First, the eyes may desire form, attaining desires, most present in the mind, and the likeness of desirable forms as they wish; second, the ears may desire sound, attaining desires, most present in the mind, and the likeness of desirable forms as they wish; third, the nose may desire fragrance, attaining desires, most present in the mind, and the likeness of desirable forms as they wish; fourth, the mouth may desire taste, attaining desires, most present in the mind, and the likeness of desirable forms as they wish; fifth, the body may desire coarse and fine sense desires, attaining desires, most present in the mind, and the likeness of desirable forms as they wish; such are the desires of knowing.",
        "source": "T01n0057_001:0852c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知愛欲從本有？",
        "translation": "\"What is the knowledge that desires exist from the beginning?",
        "source": "T01n0057_001:0853a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂本為思；如是為知愛欲從本有。",
        "translation": "It's originally conceived; thus is the knowledge that craving exists from the beginning.",
        "source": "T01n0057_001:0853a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知從愛欲受殃？",
        "translation": "\"How is it to know that you're condemned by craving?",
        "source": "T01n0057_001:0853a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為所愛欲已，生欲望諍待向待，便如殃思待，便從是致殃隨，或好處或惡處；如是為知從愛欲受殃。",
        "translation": "If, after longing for something, they develop a desire to get into a quarrel and look for it, then they will think of it as a disaster, and this will cause disasters, whether good or bad, to follow; this is how you know that you'll be affected by disasters from longing for it.",
        "source": "T01n0057_001:0853a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知愛欲分布？",
        "translation": "\"What is the distribution of desires that should be known?",
        "source": "T01n0057_001:0853a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂色愛欲為異，聲愛欲亦異，香愛欲亦異，味愛欲亦異，身更麤細愛欲亦異；如是為知愛欲分布。",
        "translation": "These are known as the desire for form being different, the desire for sound being different, the desire for fragrance being different, the desire for taste being different, and the desire for the body being more or less coarse; this is known as the distribution of desire.",
        "source": "T01n0057_001:0853a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知愛欲盡？",
        "translation": "\"What is the end of desire that should be known?",
        "source": "T01n0057_001:0853a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂思已盡，愛便盡；如是為知愛欲盡。",
        "translation": "It means that after thinking has ended, craving will end; this is called knowing that craving has ended.",
        "source": "T01n0057_001:0853a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知受行令愛欲畢？",
        "translation": "\"What is the end of craving that should be known as the result of feeling and doing?",
        "source": "T01n0057_001:0853a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂是八種道行：一為直見，二為直更，三為直語，四為直行，五為直業，六為直方便，七為直念，八為直定；如是為知受行令愛欲畢。",
        "translation": "These are the eight kinds of path practices: first, direct views, second, direct changes, third, direct speech, fourth, direct action, fifth, direct conduct, sixth, direct skillful means, seven, direct mindfulness, and eighth, direct concentration; such are the knowledges and practices that bring about the completion of craving.",
        "source": "T01n0057_001:0853a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸比丘！",
        "translation": "If you monks!",
        "source": "T01n0057_001:0853a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已知愛欲如是，知愛欲從本有如是，知從愛欲受殃如是，知愛欲分布如是，知愛欲盡如是，知受行令愛欲畢如是，是名為比丘悔厭世間，行清淨，得道令愛欲盡畢。",
        "translation": "Having known that craving is thus, having known that craving exists from the beginning is thus, having known that suffering from craving is thus, having known that craving is thus distributed, having known that craving is thus ended, and having known that accepting actions brings about the end of craving is thus, a monk who repents of disliking the world, practices purity, and attains the path that brings about the end of craving is called a monk who repents of disliking the world, practices purity, and brings about the end of craving.",
        "source": "T01n0057_001:0853a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘！",
        "translation": "\"Monks!",
        "source": "T01n0057_001:0853a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知行，亦當知行從本有，亦當知從行受殃福，亦當知行分布，亦當知行盡，亦當知受何行令行畢。",
        "translation": "They should know actions, and they should know that actions exist from the beginning, that they're subject to misfortune and fortune, that they're distributed, that they're exhausted, and that they're subject to what actions cause actions to be completed.",
        "source": "T01n0057_001:0853a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知行？",
        "translation": "\"What's the proper knowledge of actions?",
        "source": "T01n0057_001:0853a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂所思念向、不離，是為行；如是為知行。",
        "translation": "This is called practice when that which is contemplated is directed toward and doesn't depart from; thus is the practice of knowing.",
        "source": "T01n0057_001:0853a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知行從本有？",
        "translation": "\"What is the knowing that conduct comes from the past?",
        "source": "T01n0057_001:0853a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂從愛欲有為，從愛行有本；如是為知行從本有。",
        "translation": "It means that there are behaviors based on craving and actions based on craving; thus, you know that actions exist from the beginning.",
        "source": "T01n0057_001:0853a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知從行受殃福？",
        "translation": "\"How is it that you should know that you're subject to misfortune and merit based on actions?",
        "source": "T01n0057_001:0853a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂有黑行為黑殃，令致墮下；有清白行，令清白福，行得上上；是為知從行受殃福。",
        "translation": "When there's a black act that's a black misfortune and causes someone to fall, and when there's a clean act that's a clean merit, the act becomes superior; this is called knowing that the act is followed by misfortune and fortune.",
        "source": "T01n0057_001:0853a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知行分布？",
        "translation": "\"What's the distribution of actions that should be known?",
        "source": "T01n0057_001:0853b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂有黑行，從黑受殃；有清白行，從清白受清白福；有黑白行，令致黑白殃福；有亦非黑亦非清白行，令從是受福；行行盡畢，如是為知行分布。",
        "translation": "It means there's a black practice that causes black people to receive bad fortune, a white practice that causes white people to receive good fortune, a black-and-white practice that causes black-and-white people to receive bad fortune, and a practice that's neither black nor white that causes them to receive good fortune; after these practices are completed, this is called knowing the distribution of practices.",
        "source": "T01n0057_001:0853b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知行盡？",
        "translation": "\"What is the knowledge of the completion of actions?",
        "source": "T01n0057_001:0853b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂愛已盡，行便盡；如是為知行盡。",
        "translation": "Once craving has ended, practice will end; this is called knowing that practice has ended.",
        "source": "T01n0057_001:0853b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知受行令行畢？",
        "translation": "\"How should you know that you've received the action and caused the action to end?",
        "source": "T01n0057_001:0853b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂是八種道行：一為直見，二為直更，三為直語，四為直行，五為直業，六為直方便，七為直念，八為直定；如是為知受行令行畢。",
        "translation": "These are the eight kinds of path practices: first, direct vision, second, direct change, third, direct speech, fourth, direct action, fifth, direct conduct, sixth, direct skillful means, seven, direct mindfulness, and eighth, direct concentration; such is the knowledge, acceptance, and accomplishment of actions.",
        "source": "T01n0057_001:0853b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸比丘！",
        "translation": "If you monks!",
        "source": "T01n0057_001:0853b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘已知行如是，知行從本有如是，知從行受殃如是，知行分布如是，知行盡如是，知受行令行畢如是，是名為比丘悔厭世間，行清淨，得道令行盡畢。",
        "translation": "A monk who has known conduct as such, knows that conduct comes from the past as such, knows that it's blamed for conduct as such, knows that it's distributed as such, knows that it's ended as such, and knows that he's received conduct so that it's ended is called a monk who repents of disillusionment with the world, conducts himself in a pure manner, and attains the path so that his conduct is ended.",
        "source": "T01n0057_001:0853b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘！",
        "translation": "\"Monks!",
        "source": "T01n0057_001:0853b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知苦，亦當知苦從本有，亦當知從苦受殃，亦當知苦分布，亦當知苦盡，亦當知受何行令苦畢。",
        "translation": "They should know suffering, know that suffering exists from the beginning, know that they're subject to suffering, know that suffering is distributed, know that suffering is ended, and know what actions they'll take that will bring suffering to an end.",
        "source": "T01n0057_001:0853b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知苦？",
        "translation": "\"What's the proper knowledge of suffering?",
        "source": "T01n0057_001:0853b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂當知生為苦，當知老為苦，當知病為苦，當知死為苦，當知近不相於為苦，當知愛別離為苦，當知所求不得為苦，當知卒五陰為苦；如是為知苦。",
        "translation": "It means you should know that birth is painful, that old age is painful, that illness is painful, that death is painful, that being near each other is painful, that loving separation is painful, that not getting what you seek is painful, and that ending the five aggregates is painful; this is knowing pain.",
        "source": "T01n0057_001:0853b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知苦從本有？",
        "translation": "\"How does knowing suffering from the beginning exist?",
        "source": "T01n0057_001:0853b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂本為癡，癡為苦本；如是為知苦從本有。",
        "translation": "This is called the root of delusion, and delusion is the root of suffering; thus is the knowledge that suffering comes from the root.",
        "source": "T01n0057_001:0853b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知從苦受殃？",
        "translation": "\"How is it to know that suffering is received as a result of suffering?",
        "source": "T01n0057_001:0853b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂癡、未聞經、世間人，已身中更苦痛劇，劇苦最痛所不可意，應當從是念斷。",
        "translation": "This refers to delusion, unheard scriptures, and worldly people who are already experiencing more pain and suffering in their bodies, which is the most painful and undesirable, and should be stopped by this mindfulness.",
        "source": "T01n0057_001:0853b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為從外求念外有為，依外從求，為有沙門婆羅門，一言二言三言四言五言百言，持呪祠，令從是能得解身苦，如是求苦殃或苦殃；如是為知從苦受殃。",
        "translation": "In order to seek mindfulness of external existences from the outside, and to seek it from the outside, an ascetic or brāhmaṇa may maintain a mantra, saying one, two, three, four, five, or a hundred words, so that he can thereby attain relief from physical suffering, thus seeking painful retribution or painful retribution, and thus knowing that he'll receive retribution from suffering.",
        "source": "T01n0057_001:0853b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知苦分布？",
        "translation": "\"What's the distribution of pain that should be known?",
        "source": "T01n0057_001:0853c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂有苦少受殃久，或有苦少受殃疾解，或有苦多受殃久，或有苦多受殃疾解；如是為知苦分布。",
        "translation": "It means knowing the distribution of suffering when there's little suffering that suffers for a long time, or when there's little suffering that suffers for a quick relief, or when there's much suffering that suffers for a long time, or when there's much suffering that suffers for a quick relief.",
        "source": "T01n0057_001:0853c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知苦盡？",
        "translation": "\"What is the knowledge of the end of suffering?",
        "source": "T01n0057_001:0853c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂癡已盡，苦便盡；如是為知苦盡。",
        "translation": "Once delusion has ended, suffering will end; this is called knowing that suffering has ended.",
        "source": "T01n0057_001:0853c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為當知受行令苦畢？",
        "translation": "\"What is the end of suffering that results from knowing what's experienced and what's done?",
        "source": "T01n0057_001:0853c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂是八種道行：一為直見，二為直更，三為直語，四為直行，五為直業，六為直方便，七為直念，八為直定；如是為知受行令苦畢。",
        "translation": "These are the eight practices of the path: first, direct vision, second, direct change, third, direct speech, fourth, direct action, fifth, direct action, sixth, direct skillful means, seven, direct mindfulness, and eighth, direct concentration; such is the knowledge of sensation and action that brings suffering to an end.",
        "source": "T01n0057_001:0853c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸比丘！",
        "translation": "If you monks!",
        "source": "T01n0057_001:0853c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘已知苦如是，知苦從本有如是，知從苦受殃如是，知苦分布如是，知苦盡如是，知受行令苦畢如是，是名為比丘悔厭世間，行清淨，得道令苦盡畢。」",
        "translation": "A monk who has known suffering as it is, knows that suffering comes from the past as it is, knows that he'll suffer misfortune from suffering as it is, knows that suffering will be distributed as it is, knows that suffering will end as it is, and knows that he'll receive actions that will bring suffering to an end is called a monk who repents of disillusionment with the world, practices purity, and attains the path that brings suffering to an end.\"",
        "source": "T01n0057_001:0853c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "Thus did the Buddha speak.",
        "source": "T01n0057_001:0853c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘受著意，佛所說樂行，從行致清淨無為。",
        "translation": "That monk's mind is attached to what the Buddha teaches about pleasant practices, and from those practices comes pure nonbeing.",
        "source": "T01n0057_001:0853c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說漏分布經",
        "translation": "The Buddha teaches the distribution of contaminants sūtra.",
        "source": "T01n0057_001:0853c16_0",
        "is_bad_quality": false
    }
]