[
    {
        "source_sentence": "法海經",
        "translation": "Dharmasaṃgīti-sūtra",
        "source": "T01n0034_001:0818a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西晉沙門法炬譯",
        "translation": "Western Jin Dynasty Translation of the Lotus Sutra",
        "source": "T01n0034_001:0818a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時，佛遊瞻波國，漢呿利池上，與大比丘眾俱。",
        "translation": "Thus I have heard: One time, the Buddha traveled to the country of Campā and was on the lake of Hanāyāna, accompanied by a large assembly of monks.",
        "source": "T01n0034_001:0818a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "月十五日，時應說戒。",
        "translation": "On the fifteenth day of the moon, the time came when the precepts should have been taught.",
        "source": "T01n0034_001:0818a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛坐，集已久，而如來默然，不說戒。",
        "translation": "The Buddha was sitting there, and after a long time had passed since the assembly, the Tathāgata remained silent and didn't preach the precepts.",
        "source": "T01n0034_001:0818a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "侍者阿難，更整衣服，跪而白佛：「初夜向竟，中夜將至，大眾集久，世尊將無疲倦，願以時說戒。」",
        "translation": "Ānanda, an attendant, adjusted his clothes, knelt down, and said to the Buddha, \"After the first night, the middle of the night is approaching, the crowd has been assembled for a long time, and the Bhagavān will not be tired; may it be the time to preach the precepts?\"",
        "source": "T01n0034_001:0818a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛猶默然。",
        "translation": "The Buddha remained silent.",
        "source": "T01n0034_001:0818a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾坐既久，時有比丘，名曰阿若都盧，更整衣服，長跪白佛：「初夜中夜已過，雞將向鳴，世尊得無疲倦，眾僧集久，願佛說戒。」",
        "translation": "After the crowd had sat there for a long time, a monk named Ajñātaśatru adjusted his robes, knelt down long enough, and said to the Buddha, \"After the first midnight hour, the chickens will be crowing, the Bhagavān will not be weary, and the crowd of monks will have gathered for a long time, so may the Buddha expound the precepts.\"",
        "source": "T01n0034_001:0818a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊復默然。",
        "translation": "The Bhagavān was again silent.",
        "source": "T01n0034_001:0818a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復白言：「明星已出，時將過矣。」",
        "translation": "He also said, \"The stars have risen, and the time is about to pass.\"",
        "source": "T01n0034_001:0818a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「比丘！",
        "translation": "The Buddha said, \"Monks!",
        "source": "T01n0034_001:0818a19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且聽，眾僧之中有不淨者，故吾不得說戒耳。」",
        "translation": "Listen, there are impure people among the saṃgha, so I won't allow them to preach the precepts.\"",
        "source": "T01n0034_001:0818a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢者大目揵連心念：「吾當定意觀之，誰不淨者？」",
        "translation": "The good man Mahāmaudgalyāyana thought, \"I'll look at it intently, 'Who's impure?'\"",
        "source": "T01n0034_001:0818a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連白佛：「我欲定意觀誰不淨者，不淨者命令出眾。」",
        "translation": "Maudgalyāyana said to the Buddha, \"I want to concentrate my thoughts on observing someone who's impure and causing that impure person to appear in the congregation.\"",
        "source": "T01n0034_001:0818a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告曰：「卿欲定意觀不淨者令其出眾，此言大善，便可觀之。」",
        "translation": "The Bhagavān told him, \"If you want to contemplate an impure person and order him to leave the congregation, that's a very good thing to say; you can then contemplate it.\"",
        "source": "T01n0034_001:0818a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連即定意觀之，見其弟子犯于重戒。",
        "translation": "Moulian then concentrated his attention and looked at them, and he saw that his disciple had violated a grave precept.",
        "source": "T01n0034_001:0818a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連從定意起，至犯戒比丘前，而數之曰：「汝為沙門，奉戒為本，戒猶人之頭首；沙門戒行，宜令清白，如水如玉。",
        "translation": "Moulian got up from his concentration and went over to the violating monk and told him, \"As an ascetic, you should respect precepts as the foundation, and precepts are like the head of a person; it's appropriate for an ascetic's moral conduct to be pure, like water and jade.",
        "source": "T01n0034_001:0818a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此如來之座，賢聖之會，度世者之聚，清淨道德者之所集處，此座猶如栴檀之林，卿以伊蘭臭穢，亂于真正。」",
        "translation": "This seat of the Tathāgata, the assembly of the noble ones, the gathering place of those who have saved the world, and the gathering place of the pure and moral ones, is like a forest of sandalwood; don't let the stench of ylang-ylang disturb the truth.\"",
        "source": "T01n0034_001:0818a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連手自引其弟子出。",
        "translation": "Moulian led his disciple out with his own hand.",
        "source": "T01n0034_001:0818b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「卿是棄捐之人，不得預如來大眾之清淨集也。",
        "translation": "\"You're an outcast who can't interfere with the pure gathering of the Tathāgata's great congregation.",
        "source": "T01n0034_001:0818b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無以穢濁廁預大僧大集，大海不受穢屍，卿自思之，無穢賢眾。」",
        "translation": "You didn't use a filthy toilet to precede the great gathering of monks, and the ocean didn't accept a filthy corpse.",
        "source": "T01n0034_001:0818b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "穢人既出，目連白曰：「穢濁之人，即以棄遠，眾已清淨，唯願世尊，以時說戒。」",
        "translation": "After the defiled man emerged, Maudgalyāyana said, \"That defiled man has just been cast aside, and the multitude has been purified; may the Bhagavān please explain the precepts in a timely way.\"",
        "source": "T01n0034_001:0818b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊猶復默然。",
        "translation": "The Bhagavān remained silent.",
        "source": "T01n0034_001:0818b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連怪之，四向觀察，見座上，向比丘已復在座，目連重勅之曰：「卿為棄人，何為不自引罪穢，重坐此座為？」",
        "translation": "Being puzzled, Maudgalyāyana looked around and saw that the monk who was facing him was still seated. Maudgalyāyana then repeatedly commanded him, \"Why didn't you bring your own sins and defilements and sit in this seat again, since you're an outcast?\"",
        "source": "T01n0034_001:0818b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連重遣之，乃出座去。",
        "translation": "Moulian reprimanded him and left his seat.",
        "source": "T01n0034_001:0818b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連復白：「世尊！",
        "translation": "Mālādhārī then replied, \"Bhagavān!",
        "source": "T01n0034_001:0818b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "穢人已出，大眾已淨，無復穢惡，唯願世尊，以時說戒，令眾僧得修淨業。」",
        "translation": "Once the defiled people are out and the public is purified, there's no more defilement, so let's hope that the Bhagavān will preach the precepts at the right time so that the saṃgha can cultivate pure behavior.\"",
        "source": "T01n0034_001:0818b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告目連：「吾自今後，不復說戒，汝等可自共說戒，若我說戒。",
        "translation": "The Buddha told Maudgalyāyana, \"From now on, I won't preach the precepts again; you may preach the precepts together with yourselves, or I may preach them.",
        "source": "T01n0034_001:0818b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人於眾中犯戒，默然不自引罪，而預如來座者，此為默然妄語。",
        "translation": "A person who violates the precepts in a congregation and quietly avoids bringing a sin upon himself and prepares to sit at the Tathāgata's seat is someone who speaks tacitly and falsely.",
        "source": "T01n0034_001:0818b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "默然妄語，頭破七分。",
        "translation": "When someone speaks foolishly and silently, their head is cut off seven times.",
        "source": "T01n0034_001:0818b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來於大眾說戒，甚為不易，自今以後，汝自說戒。」",
        "translation": "It's not easy for the Tathāgata to preach the precepts to the public, so from now on, preach the precepts yourself.\"",
        "source": "T01n0034_001:0818b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連白佛：「弟子聞道，如來先化之，為非弟子自悟而成道也。",
        "translation": "Maudgalyāyana said to the Buddha, \"The Tathāgata first taught this disciple the path after he heard about it, so it's not because the disciple realized it on his own that he became a practitioner.",
        "source": "T01n0034_001:0818b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來聖德，厚重天地，言真而要，弟子誦習，得成道果。",
        "translation": "The Tathāgata's noble qualities are abundant in heaven and earth, and his words are true and essential; the disciple recites them and attains the fruit of the path.",
        "source": "T01n0034_001:0818b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來猶天雨，百穀草木，無不仰榮；弟子德淺道小，人不服信。",
        "translation": "The Tathāgata is like the rain from heaven that makes all the grains and grasses look up to him, but the disciple's virtue is shallow and his path is small, and people aren't convinced.",
        "source": "T01n0034_001:0818b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊哀愍聾俗，使一切獲安，得信得正，以濟其志。」",
        "translation": "The Bhagavān has compassion for the deaf and commonplace, so that all may be made comfortable and attain faith and correctness to aid their aspirations.\"",
        "source": "T01n0034_001:0818b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連慇懃苦請至三四五。",
        "translation": "Maudgalyāyana earnestly entreated him to come up to three, four, or five.",
        "source": "T01n0034_001:0818b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告目連曰：「汝為一切，請求如來，慇懃乃至四五，吾今當為汝等說之。",
        "translation": "The Bhagavān told Maudgalyāyana, \"You've asked the Tathāgata for everything, and you've been so kind and diligent up to the fourth or fifth, and now I will explain it for you.",
        "source": "T01n0034_001:0818b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾僧法，猶如大海，有八德，汝等聽之。",
        "translation": "Our saṃgha's teaching is like a great ocean with eight virtues, so listen to them.",
        "source": "T01n0034_001:0818b23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大海之水，無滿不滿；吾法如之，無滿不滿，此第一之德。",
        "translation": "The water of the ocean is never full or dissatisfied, and our teaching is like that, never full or dissatisfied, which is the greatest virtue.",
        "source": "T01n0034_001:0818b24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大海潮水，尋以時而來，不失常處；吾四部眾，受吾戒者，不犯禁戒違失常法，此第二之德。",
        "translation": "The tide of the ocean comes in fits and starts, but it doesn't lose its usual place; our four groups of precepts accepters don't violate the precepts or lose their usual place, which is the second virtue.",
        "source": "T01n0034_001:0818b25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大海之水，唯有一味，無若干味，無不以鹹為味；吾法如是，禪定之味，志求寂定，致神通故，四諦之味，志求四道，解結縛故，大乘之味，志求大願，度人民故，此第三之德。",
        "translation": "The water of the ocean has only one taste, and there are no flavors that aren't salty; thus is our teaching, the taste of meditation, which aspires to quiescent concentration and attainment of supernormal powers, the taste of the four truths, which aspires to the four paths and the release of fetters, and the taste of the great vehicle, which aspires to the great vow and the salvation of the people, which is the third virtue.",
        "source": "T01n0034_001:0818b27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大海既深而廣，無能限者；僧法如是，無不深妙，八方之大，莫大於僧法，僧法最為弘大，此第四之德。",
        "translation": "As deep and wide as the ocean is, there's no limit to it; the saṃgha dharma is thus, nothing less profound and marvelous, and there's nothing greater in eight directions than the saṃgha dharma, which is the most vast, which is the fourth virtue.",
        "source": "T01n0034_001:0818c02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大海之中，金銀琉璃、水精珊瑚、車璩馬瑙、摩尼之妙，無不備有；吾僧法之中，三十七品道寶之妙，神足住壽，飛騰十方，靡所不適，瞬息之間，周旋無量佛界，到殊勝之剎，能以其道，化導群生，淨己佛土，此第五之德。",
        "translation": "In the ocean, there's nothing that doesn't include gold, silver, lapis lazuli, water essence, coral, chariot, horse agate, and the marvels of the maṇi; in our saṃgha dharma, there are thirty-seven grades of the marvels of the jewels of the way, which are perfectly endowed with longevity, soar in ten directions, and are not out of place, and in a moment's notice, circulate around measureless buddha realms and reach extraordinary buddhas, where they can use their path to guide sentient beings and purify their own buddha-lands, which is the fifth virtue.",
        "source": "T01n0034_001:0818c04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大海之中，神龍所居，沙竭龍王，阿耨達、難頭、和羅摩那、私伊羅末，如此諸龍，妙德難量，能造天宮，品物之類，無不仰之；吾僧法亦復如是，四雙八輩之士，十二賢者，菩薩大士，教化之功，彌茂彌美，此第六之德。",
        "translation": "In the middle of the ocean, where the divine dragons live, the Śāgana-nāga-rāja, Anavatapta, Nanda, Hrāmaṇa, and Sīlamati, these dragons have marvelous qualities that are difficult to fathom, and they can create celestial palaces that are invariably looked up to by all kinds of beings; likewise, our saṃgha teachings are made by four pairs and eight groups of men, twelve good men, and great bodhisattvas, whose merits of teaching and transforming are abundant and beautiful, which is the sixth virtue.",
        "source": "T01n0034_001:0818c09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大海吞受百川萬流，江恒之水，無不受之，終日終夜，無盈溢滅盡之名；吾僧法之中亦如是，梵釋之種，來入僧法，四姓族望，或釋或梵，王者之種，捨世豪尊，來入正化，或工師小姓，亦入正化，種族雖殊，至於服習大道，同為一味，無非釋子，此第七之德。",
        "translation": "The ocean swallows a hundred rivers and ten thousand streams, and there's no river of constant water that doesn't accept it, and day and night it's not called overflowing or ceasing; so it is in our saṃgha teachings, where the Brahmā and Śākyamuni lineages come to enter the saṃgha teachings, and the four lineages and clans are either Śākyamuni or Brahmā, where the king's lineage leaves the world's greatest honored ones and comes to be rightly taught, or the worker's lesser lineage also enters to be rightly taught, even though their races are different, but their service to the great way is the same in flavor, and they are not other than Śākyamuni's children, which is the seventh virtue.",
        "source": "T01n0034_001:0818c14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大海清淨，不受死屍，無諸穢濁，唯海之類而受之耳；吾僧法清淨，亦如大海，不受穢惡，犯戒違禁，非清淨梵行者，一不得受，棄之遠之，猶海不受死屍，此第八之德。」",
        "translation": "The ocean is pure, doesn't accept dead bodies, and is devoid of defilement, except for those of the type of ocean that accepts it; our saṃgha's teaching is pure, just like the ocean, and it doesn't accept defilement, and anyone who violates the precepts and prohibitions or doesn't engage in pure religious practice can't accept it and discard it far away, just like the ocean that doesn't accept dead bodies, which is the eighth virtue.\"",
        "source": "T01n0034_001:0818c19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告目連：「如來大眾唯清淨，為禁戒業不純非釋種子，故吾不說戒耳。",
        "translation": "The Buddha told Maudgalyāyana, \"The Tathāgata mass is only pure, and because the prohibitions against moral behavior are impure and not the seeds of Buddhahood, I don't preach the precepts.",
        "source": "T01n0034_001:0818c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卿等善相勅戒，無令正法有毀。」",
        "translation": "You must well observe the precepts, so that the right teaching won't be disparaged.\"",
        "source": "T01n0034_001:0818c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說如是，諸比丘歡喜奉行。",
        "translation": "Thus did the Buddha speak, and the monks rejoiced and handed it down.",
        "source": "T01n0034_001:0818c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法海經",
        "translation": "Dharmasaṃgha-sūtra",
        "source": "T01n0034_001:0818c27_0",
        "is_bad_quality": false
    }
]