[
    {
        "source_sentence": "優陂夷墮舍迦經",
        "translation": "Upīsikā-dāsaka-sūtra",
        "source": "T01n0088_001:0912a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "失譯人名今附宋錄",
        "translation": "Lost Translator's Name Presently Attached to the Song Record",
        "source": "T01n0088_001:0912a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時，佛在舍衛國止。",
        "translation": "Thus I have heard: One time, the Buddha was staying in the country of Śrāvastī.",
        "source": "T01n0088_001:0912a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城東出，有女人子字蕪耶樓，人呼為蕪耶樓母，佛在蕪耶樓母家殿上坐。",
        "translation": "On the east side of the city, there was a woman named Wu-yer-lou, who was called Wu-yer-lou's mother, and the Buddha was sitting in the palace of her house.",
        "source": "T01n0088_001:0912a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一女人奉持教戒，字墮舍迦，以月十五日朝起沐浴，有七子婦皆使沐浴著好衣，日未中因飯，飯已澡手，將七子婦至佛所，前為佛作禮。",
        "translation": "On the fifteenth day of the month, a woman who upheld the precepts and whose name was Ṛṣaka rose in the morning to bathe, had seven sons and daughters who were all bathed and dressed in nice clothes, ate before sunrise, washed their hands after eating, and brought their seven sons and daughters to the Buddha to pay homage to him.",
        "source": "T01n0088_001:0912a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「就座。」",
        "translation": "The Buddha said, \"Take your seat.\"",
        "source": "T01n0088_001:0912a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆却就座。",
        "translation": "They all withdrew and took their seats.",
        "source": "T01n0088_001:0912a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛問優陂夷墮舍迦：「今日何等沐浴著好衣，與子婦俱至佛所？」",
        "translation": "The Buddha asked Upīsikā, \"Today, why did you wash and dress yourself in nice clothes and bring your children and wives to the Buddha's place?\"",
        "source": "T01n0088_001:0912a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "墮舍迦言：「今日十五日我齋戒，我聞一月當六齋，我與子婦俱共齋，不敢懈慢。」",
        "translation": "Rāṣṭrapāla said, \"Today, the fifteenth day, I observe the precepts. I've heard that a month should consist of six days of fasting, and I dare not be lazy when I observe the precepts with my children.\"",
        "source": "T01n0088_001:0912a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告墮舍迦：「佛正齋法有八戒，使人得度世道，不復墮三惡處，所生常有福祐，亦從八戒本因緣致成佛。",
        "translation": "The Buddha told Dāsaka, \"The Buddha's right purification consists of eight precepts that enable people to cross over to the worldly path, stop falling into the three bad places, and have constant fortune in their births, and from the causes and conditions of these eight precepts they become buddhas.",
        "source": "T01n0088_001:0912a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為佛正齋法？",
        "translation": "\"What's the Buddha's proper ritual for abstinence?",
        "source": "T01n0088_001:0912b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是間有賢善人持戒，一月六日齋，月八日一齋，十四日一齋，十五日一齋，二十三日一齋，二十九日一齋，三十日一齋。",
        "translation": "Sometimes there are good people who observe the precepts and fast six days in January, once on the eighth day of the month, once on the fourteenth day, once on the fifteenth day, once on the twenty-third day, once on the twenty-ninth day, and once on the thirtieth day.",
        "source": "T01n0088_001:0912b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "齋日朝起，告家中言：『今日我身齋，家中今一日，且莫飲酒、莫鬪諍、莫道說錢財，家中事意所念、口所說，當如阿羅漢。』",
        "translation": "When he rises in the morning on the day of the fast, he tells his family, 'Today I'm observing the fast, so for one day at home, don't drink alcohol, don't fight, and don't talk about money and property; whatever you think or say at home, you must act like an arhat.'",
        "source": "T01n0088_001:0912b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿羅漢無殺意，齋日持戒亦當如阿羅漢，無殺意、無捶擊意，念畜生及虫蛾，使常生，如阿羅漢意，是為一戒。",
        "translation": "An arhat has no intention of killing, so on the day of purification, you must observe the precepts like an arhat, with no intention of killing or beating, mindful of animals and insects and moths, and always producing them, just like an arhat's intention.",
        "source": "T01n0088_001:0912b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今日與夜持殺意使不得殺，持意如是，為佛一戒。」",
        "translation": "Today and at night, maintaining the intention to kill so that no one can be killed and maintaining that intention thus is the single Buddha precept.\"",
        "source": "T01n0088_001:0912b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「齋日持意當如阿羅漢無貪心，無所貪慕於世間，無貪毛菜之意。",
        "translation": "The Buddha said, \"On the day of purification, maintain the intention as an arhat who has no craving, no desire for the world, and no desire for food or vegetables.",
        "source": "T01n0088_001:0912b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "齋日如是持意如阿羅漢，富有者，當念作布施，貧無有者，常當念施，是為二戒。」",
        "translation": "Thus observing the intention to observe the day of fasting like an arhat who's rich and always mindful of generosity for the poor and have nothing to give is the two precepts.\"",
        "source": "T01n0088_001:0912b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「齋日持意當如阿羅漢，阿羅漢不畜婦亦不念婦，亦不貪女人亦無婬意。",
        "translation": "The Buddha said, \"Maintain the intention to observe the day of purification like an arhat, who doesn't lay hold of women, doesn't think about women, doesn't crave women, and has no desire for lust.",
        "source": "T01n0088_001:0912b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "齋日如是持意如阿羅漢，是為三戒。」",
        "translation": "Thus maintaining the intention to act like an arhat on the day of purification is the third precept.\"",
        "source": "T01n0088_001:0912b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「齋日持意當如阿羅漢，不妄語、不傷人意，語即說佛經，不語者但念諸善。",
        "translation": "The Buddha said, \"On the day of purification, you must thus maintain your mind like an arhat who doesn't speak false words or hurt people's feelings, speaks, or explains the Buddha's sūtras, and doesn't speak but is mindful of the good.",
        "source": "T01n0088_001:0912b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "齋日如是持意如阿羅漢，是為四戒。」",
        "translation": "Thus maintaining your mind as an arhat on the day of purification is the fourth precept.\"",
        "source": "T01n0088_001:0912b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「齋日持意當如阿羅漢，阿羅漢不飲酒，不念酒、不思酒，用酒為惡。",
        "translation": "The Buddha said, \"On the day of purification, you should thus maintain your mind like an arhat who doesn't drink alcohol, doesn't think about alcohol, and doesn't consider alcohol a bad thing to use.",
        "source": "T01n0088_001:0912b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "齋日如是持意如阿羅漢，是為五戒。」",
        "translation": "Thus maintaining mindfulness as an arhat on the day of fasting is the fifth precept.\"",
        "source": "T01n0088_001:0912b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「齋日持意當如阿羅漢，阿羅漢意不在歌舞，聞亦不喜音樂聲，亦不在香華氣。",
        "translation": "The Buddha said, \"On the day of purification, you must thus maintain your intention as an arhat, whose intention isn't to sing or dance, hear or enjoy the sound of music, or smell the scent of flowers.",
        "source": "T01n0088_001:0912b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "齋日如是持意如阿羅漢，是為六戒。」",
        "translation": "Thus maintaining the intention to act like an arhat on the day of purification is the sixth precept.\"",
        "source": "T01n0088_001:0912b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「齋日持意當如阿羅漢，阿羅漢不於高好床臥，意亦不念高好床上臥。",
        "translation": "The Buddha said, \"On days of fasting, you should thus maintain your mind like an arhat, who doesn't lie on a high, fine bed and whose mind isn't mindful of lying on a high, fine bed.",
        "source": "T01n0088_001:0912b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "齋日如是持意如阿羅漢，是為七戒。」",
        "translation": "Thus maintaining the mind like an arhat on the day of purification is the seventh precept.\"",
        "source": "T01n0088_001:0912b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「齋日持意當如阿羅漢，阿羅漢日中及食，日中已後至明不得復食，得飲蜜漿。",
        "translation": "The Buddha said, \"On the day of fasting, you must thus maintain your mind like an arhat, an arhat who eats during the middle of the day and doesn't eat again after midday or until morning and gets to drink honeyed milk.",
        "source": "T01n0088_001:0912c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "齋日如是持意如阿羅漢，是為八戒。」",
        "translation": "Thus maintaining the intention to act like an arhat on the day of purification is the eighth precept.\"",
        "source": "T01n0088_001:0912c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告優陂夷墮舍迦：「是間有人，頭髮有垢自沐其頭，沐已其人便喜言：『我頭垢已去。』",
        "translation": "The Buddha again told Upīsikā: \"Suppose there's a person whose hair is soiled and they wash their head, and then they rejoice and say, 'The dirt on my head is gone.'",
        "source": "T01n0088_001:0912c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人持八戒一日一夜者，明日即喜，喜者便念：『佛經戒廼如是。』",
        "translation": "A person who observes the eight precepts for a day and a night rejoices the next day, and that person then thinks, 'The Buddha's sūtras reject the precepts as such.'",
        "source": "T01n0088_001:0912c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有人，心中有惡意即去，善意即還。」",
        "translation": "That person's mind then departs with ill will and returns with good intentions.\"",
        "source": "T01n0088_001:0912c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有人身體饒垢入水中治，身垢皆去。",
        "translation": "The Buddha says, \"Suppose someone's body is soiled that they plunge into water to heal it, and all the dirt on their body goes away.",
        "source": "T01n0088_001:0912c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出水即喜言：『我垢去身輕。』",
        "translation": "They rejoice when they emerge from the water and say, 'My body is lighter with the dirt gone.'",
        "source": "T01n0088_001:0912c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有人齋戒一日一夜，明日即喜念佛正語，自念：『當何時得道，使我心不復動、不復走，使我心一，志無為之道。』」",
        "translation": "That person observes the precepts for a day and a night, and then the next day they rejoice when they remember the Buddha's correct words and think to themselves, 'When will I attain the Way, so that my mind won't move again and I won't walk again, and so that my mind will be unified and I'll pursue the path of nonproductivity?'\"",
        "source": "T01n0088_001:0912c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有人衣多垢，以得灰浣之垢去，其人即喜。",
        "translation": "The Buddha said, \"Suppose someone has a lot of dirt on their clothes and they get ashes to wash away the dirt, and they rejoice.",
        "source": "T01n0088_001:0912c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有人齋戒一日一夜，明日即喜，便念比丘僧，言：『比丘僧中，有須陀洹、斯陀含、阿那含、阿羅漢。』",
        "translation": "That person observes the precepts for a day and a night, and then rejoices the next day and remembers the monks, saying, 'Among the monks and nuns are streamers, sakṛdhas, non-returners, and arhats.'",
        "source": "T01n0088_001:0912c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念比丘僧如是。」",
        "translation": "So it is with mindfulness of the monks and nuns.\"",
        "source": "T01n0088_001:0912c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「如人有鏡，鏡有垢，磨去其垢鏡即明。",
        "translation": "The Buddha said, \"Suppose a person has a mirror and it's soiled, but they grind away the dirt and the mirror becomes clear.",
        "source": "T01n0088_001:0912c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有人齋戒一日一夜，有慈心於天下，心開如明如鏡者，不當有瞋怒意。",
        "translation": "Suppose someone observes the precepts for a day and a night, has a compassionate mind under the heavens, and their mind is opened like a clear mirror, then they won't become angry.",
        "source": "T01n0088_001:0912c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有人一日一夜齋戒，閱哀天下，淨心自思自端其意，自思念身中惡露如是，如是者不當復瞋怒。」",
        "translation": "If someone observes the precepts for a day and a night, reads the whole world with pity, purifies their mind and corrects their intentions, and considers for themselves that the bad things in their body are like this, they shouldn't become angry again.\"",
        "source": "T01n0088_001:0912c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告優陂夷墮舍迦：「持八戒齋一日一夜不失者，勝持金銀珠璣施與比丘僧也。",
        "translation": "The Buddha told Upīsikā Dāsaka, \"Someone who observes the eight precepts for one day and one night without losing them is better than someone who gives gold, silver, jewelry, and fibre to the monks and nuns.",
        "source": "T01n0088_001:0912c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天下有十六大國，一者名鴦迦，二者名摩竭，三者名迦夷，四者名拘薛羅，五者名鳩溜，六者名般闍荼，七者名阿波耶？",
        "translation": "There are 16 great countries under heaven, one named Aṅga, two named Maghā, three named Kāśyapa, four named Kośala, five named Kauṇḍinya, six named Prajāta, and seven named Abhaya.",
        "source": "T01n0088_001:0912c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八者名阿洹提渝，九者名脂提渝，十者名越祇渝，十一者名速摩，十二者名速賴吒，十三者名越蹉，十四者名末羅，十五者名渝匿，十六者名劍善提。",
        "translation": "The eighth is called Avantiu, the ninth is called Pṛthivī, the tenth is called Vṛjiu, the eleventh is called Sumeru, the twelfth is called Sūryaṭṭa, the thirteenth is called Vatsa, the fourteenth is called Mala, the fifteenth is called Yunan, and the sixteenth is called Kashanti.",
        "source": "T01n0088_001:0912c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是十六大國中珍寶物施與比丘僧，不如齋戒一日一夜也。",
        "translation": "These are 16 great countries where giving valuable things to monks and nuns isn't as good as observing the precepts for a day or a night.",
        "source": "T01n0088_001:0912c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "齋戒使人得度世道，以財寶施與，不能使人得道。",
        "translation": "Observing the precepts enables a person to cross over to the worldly path, but giving alms of wealth and treasure doesn't enable a person to attain the path.",
        "source": "T01n0088_001:0913a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今我得佛道，本從是八戒起。」",
        "translation": "Now, it was from these eight precepts that I first attained the Buddha Way.\"",
        "source": "T01n0088_001:0913a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告墮舍迦：「天下人多憂家事，我用是故，使一月六齋持八戒。",
        "translation": "The Buddha told Dāsaka, \"People everywhere often worry about family matters, so I use that to make them observe the eight precepts for six months of fasting.",
        "source": "T01n0088_001:0913a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有賢善人，欲急得阿羅漢道者，若欲疾得佛道者，若欲生天上者，能自端其心、一其意者，一月十五日齋亦善，二十日齋亦善；人多憂家事，故與一月六齋。",
        "translation": "If there are good people who want to hasten to the path of the arhat, who want to quickly attain the Buddha's path, or who want to be born in the heavens and can define their minds and unify their thoughts, a 15-day fast in a month is good, and a 20-day fast is good; people often worry about family matters, so they observe six fasts in a month.",
        "source": "T01n0088_001:0913a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六日齋者，譬如海水不可斛量，其有齋戒一日一夜者，其福不可計。」",
        "translation": "A six-day fast is like an ocean of water that can't be measured, and the merit of someone who observes the precepts for one day and one night cannot be calculated.\"",
        "source": "T01n0088_001:0913a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告墮舍迦：「且將子婦歸，誦念是正齋法八戒也。」",
        "translation": "The Buddha told Dāsaka, \"Now, return your children and wife to the house and recite the eight precepts that are the proper rules for fasting.\"",
        "source": "T01n0088_001:0913a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優陂夷墮舍迦，前為佛作禮而去。",
        "translation": "Upīsikā Dāsaka went forward, paid homage to the Buddha, and departed.",
        "source": "T01n0088_001:0913a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優陂夷墮舍迦經",
        "translation": "Sutra of Upīsikā Deshākara",
        "source": "T01n0088_001:0913a13_0",
        "is_bad_quality": false
    }
]