[
    {
        "source_sentence": "舍利弗摩訶目連遊四衢經",
        "translation": "Sutra of the Travels of Śāriputra and Mahāmaudgalyāyana through the Four Quarters",
        "source": "T02n0137_001:0860a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後漢外國三藏康孟詳譯",
        "translation": "Latter Han Translation of the Foreign Tripiṭaka by Kang Meng",
        "source": "T02n0137_001:0860a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時，釋氏舍夷阿摩勒藥樹園。",
        "translation": "Thus I heard: One time, the Śākyamuni family went to the Yakṣa Tree Park in Amalā.",
        "source": "T02n0137_001:0860a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，賢者舍利弗、摩訶目乾連比丘，遊行諸國經歷一年，與大比丘眾俱，比丘五百，還至藥樹，欲見世尊。",
        "translation": "It was then that the good monks Śāriputra and Mahāmaudgalyāyana traveled through the lands for a year, and they returned to the Yakṣa Tree with a large assembly of 500 monks who wanted to see the Bhagavān.",
        "source": "T02n0137_001:0860a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是等來還，比丘眾多各共語言，各各著衣持鉢，其聲高大音響暢逸。",
        "translation": "When they returned, the large group of monks each spoke together, each put on his robe and bowl, and their voices were loud and clear.",
        "source": "T02n0137_001:0860a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以預知，問賢者阿難：「此何比丘？",
        "translation": "With foreknowledge, the Buddha asked Ānanda, the good man, \"Which monk is this?",
        "source": "T02n0137_001:0860a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "揚大音聲其響洋逸，如捕魚師揚聲驗逸？」",
        "translation": "Does he make a great noise whose sound is vast and escapes, like a fisherman who makes a noise and tries to escape?\"",
        "source": "T02n0137_001:0860a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛：「唯然世尊！",
        "translation": "Ānanda said to the Buddha, \"Yes, Bhagavān!",
        "source": "T02n0137_001:0860a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗、目乾連，遊止諸國經歷一載，大比丘眾五百人俱至於藥樹，見諸比丘各各談語，著衣持鉢，語言聲高音響暢溢。」",
        "translation": "After traveling to and from various countries for a year, Śāriputra and Maudgalyāyana, a large group of 500 monks arrived at the medicinal tree and saw the monks each talking, wearing robes and carrying bowls, and making loud, resonant noises.\"",
        "source": "T02n0137_001:0860a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語阿難：「勿令比丘來至吾許。」",
        "translation": "The Buddha said to Ānanda, \"Don't let the monks come to my permission.\"",
        "source": "T02n0137_001:0860b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛：「唯然。」",
        "translation": "Ānanda said to the Buddha, \"Yes, I did.\"",
        "source": "T02n0137_001:0860b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奉命從座起，稽首佛足繞佛三匝而退，往詣舍利弗、目連比丘所，言語敘閙却住一面，謂賢者舍利弗、目連：「令餘比丘勿詣佛所，世尊有教。」",
        "translation": "He was instructed to get up from his seat, bow his head at the Buddha's feet, circumambulate him three times, and withdraw. He went to visit the monks Śāriputra and Maudgalyāyana, spoke in a boisterous manner, and withdrew to one side, telling the good Śāriputra and Maudgalyāyana, \"Tell the other monks not to come to the Buddha because the Bhagavān has a teaching for them.\"",
        "source": "T02n0137_001:0860b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗、目連聞阿難言，即從坐起往詣佛所，稽首足下繞佛三匝，速去衣鉢，出詣藥樹與比丘眾俱。",
        "translation": "Upon hearing Ānanda's words, Śāriputra and Maudgalyāyana rose from their seats and went to the Buddha, bowed their heads at their feet, circled him three times, quickly removed their robes and bowls, and went out to the medicinal tree to join the monks.",
        "source": "T02n0137_001:0860b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，釋種諸優婆塞，悉聚會有所講一義，遙見舍利弗、大目連，比丘眾俱，著衣持鉢，晝日平旦詣於藥樹下，「五百比丘眾俱，吾等寧可往問起居。」",
        "translation": "It was then that the Upāsaka of the Śāriputra lineage, who had all gathered to discuss a single doctrine, saw Śāriputra and Mahāmaudgalyāyana, accompanied by a multitude of monks, dressed in robes and carrying bowls, going under the medicinal tree at dawn, \"Five hundred monks are with us, so we'd better go and ask about our upbringinging.\"",
        "source": "T02n0137_001:0860b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸釋種優婆塞眾，即起速往詣舍利弗目連所，前稽首足下却住一面。",
        "translation": "The community of Upāsaka of the Śāriputra lineage then rose and quickly went to visit Śāriputra and Maudgalyāyana, bowed their heads at their feet, and withdrew to one side.",
        "source": "T02n0137_001:0860b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸清信士問舍利弗、目連：「何故著衣持鉢，晝日而往於藥樹間？」",
        "translation": "The faithful then asked Śāriputra and Maudgalyāyana, \"Why do you go to the medicinal tree by daylight, clothed and armed with a bowl?\"",
        "source": "T02n0137_001:0860b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗、目連答釋種清信士：「吾等遊諸國來還詣比丘眾，皆以疲倦今此露住。」",
        "translation": "Śāriputra and Maudgalyāyana answered the religious monks of the Śākyas, \"We've traveled to various countries and returned to the monks' assembly, and we're all tired and staying here in the open.\"",
        "source": "T02n0137_001:0860b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸清信士答曰：「唯諸賢者！",
        "translation": "The pure faithful replied, \"Only you, good men!",
        "source": "T02n0137_001:0860b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾等於斯具足施坐然燈為明，唯願屈神及比丘眾，若謂佛者乃可捨退。」",
        "translation": "We have fully offered to sit here with a bright light from a burning lamp, and we only wish that the gods and the monks would retire if we said, 'Buddha!'\"",
        "source": "T02n0137_001:0860b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢者舍利弗、大目乾連，嘿然可之，尋往所施坐其床榻，則入其室與眾僧俱坐。",
        "translation": "The good men Śāriputra and Mahāmaudgalyāyana accepted it with approval, went to sit on the bed or sofa that they had offered, and then went into their room to sit with the monks.",
        "source": "T02n0137_001:0860b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，釋種諸清信士，往詣佛所稽首足下叉手白佛：「我等請求世尊求哀安住，唯然大聖！",
        "translation": "At the time, the noble men of the Śākyas went to the Buddha, bowed their heads at their feet, saluted him with their palms together, and said, \"We beg the Bhagavān for pity and peace, O Bhagavān!",
        "source": "T02n0137_001:0860b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信比丘眾。",
        "translation": "\"Believing monks, people.",
        "source": "T02n0137_001:0860b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T02n0137_001:0860b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼比丘諸漏盡者，已得羅漢所作已辦，吾不懷疑。",
        "translation": "\"I don't doubt that those monks have ended their contaminants and have accomplished what the arhat has done.",
        "source": "T02n0137_001:0860b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此等比丘亦不猶豫，其有比丘幼小新學初出家者，入是法律未久，其心移易或能變異，譬如世間暴水卒來無所遮隔。",
        "translation": "Nor do these monks hesitate to ask whether there are monks who are young and newly trained, who have just left home, who haven't long entered this path, and whose minds are altered or can change, like the world's stormy waters that come without obstruction.",
        "source": "T02n0137_001:0860b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是世尊！",
        "translation": "Thus, Bhagavān!",
        "source": "T02n0137_001:0860b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新學比丘初出家者，入是法律未久，其心移易或能變異，不覲大聖恐改志行。」",
        "translation": "Newly trained monks who have just left home haven't entered this path for a long time, and their minds may change, so they might change their intentions and practices if they don't go to the great sage.\"",
        "source": "T02n0137_001:0860b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時梵天忽然來下，即住佛前叉手白言：「我等請求世尊，求哀安住，唯然大聖！",
        "translation": "The brahma gods then suddenly descended and stayed before the Buddha with their palms together, saying, \"We beg the Bhagavān for pity and peace, Your Holiness!",
        "source": "T02n0137_001:0860c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信比丘眾。",
        "translation": "\"Believing monks, people.",
        "source": "T02n0137_001:0860c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T02n0137_001:0860c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於眾比丘諸漏盡者，已得羅漢所作已辦，吾不疑。",
        "translation": "I don't doubt that there are monks whose contaminants have ended and whose arhatship has been accomplished.",
        "source": "T02n0137_001:0860c04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此等比丘亦不猶豫，其有比丘幼小新學初出家者，入是法律未久，其心移易或能變異。」",
        "translation": "Such monks also don't hesitate to ask monks who are young and newly trained, or who have just left home and haven't long entered this path, whether their minds are altered or changed.\"",
        "source": "T02n0137_001:0860c05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即然可梵天王。",
        "translation": "The Buddha then granted permission to King Brahmā.",
        "source": "T02n0137_001:0860c07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢者摩訶目乾連，天眼徹視遙見佛心可之，請求覩大聖德。",
        "translation": "That good man Mahāmaudgalyāyana, with his divine eye penetrating, sees from afar that the Buddha's mind is agreeable to him and asks to see great noble qualities.",
        "source": "T02n0137_001:0860c08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如大枰閣若大講堂，淨潔塗治開諸軒窓，日東初出入于軒窓光照西壁，賢者目連天眼徹視，遙見世尊相好巍巍，時目乾連尋語比丘眾：「諸賢者！",
        "translation": "Suppose there's a large chess hall or a large lecture hall that's been cleaned and painted, and the windows of the porticoes are opened, and at the beginning of the day when the sun rises and falls in the east, the light from the window of the porticoes shines on the west wall, and that good man Mahāmaudgalyāyana, with his divine eye penetrating, sees the Bhagavān's features in all their splendor from a distance.",
        "source": "T02n0137_001:0860c09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當起著衣持鉢，梵天請求諸幼小各詣。」",
        "translation": "You will then get up, put on your robe, and take your bowl, and the Brahmans will ask the youngsters to come.\"",
        "source": "T02n0137_001:0860c12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘曰：「唯當受教。」",
        "translation": "The monks said, \"Only accept the teaching.\"",
        "source": "T02n0137_001:0860c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "速正衣服，隨舍利弗、大目連等往詣佛所，稽首足下退坐一面。",
        "translation": "He quickly put on his robes, followed Śāriputra and Mahāmaudgalyāyana to the Buddha's residence, bowed his head at his feet, and withdrew to sit at one side.",
        "source": "T02n0137_001:0860c14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時，世尊告舍利弗：「吾亦前世供比丘眾，於心云何？」",
        "translation": "The Bhagavān then addressed Śāriputra, \"I, too, have made offerings to a multitude of monks in previous lifetimes, but what was my intention?\"",
        "source": "T02n0137_001:0860c15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗，心自念言：「世尊宿世供比丘眾，於此大聖，比丘質朴，於求望知節行安常志精進，佛天中天則為法王，調諸不調然當受教，諸比丘眾舉動輕飄，今日大聖慈愍眾僧。」",
        "translation": "Śāriputra thought to himself, \"The Bhagavān offered a multitude of monks in prior lifetimes; here, the great sage, the monks are simple, they seek hope, know moderation, conduct themselves with calmness, always strive, become the Dharma king among the Buddhas and gods, tame the disorderly, and accept the teaching; the monks move effortlessly; today the great sage has compassion for the monks.\"",
        "source": "T02n0137_001:0860c16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, \"Good, good!",
        "source": "T02n0137_001:0860c20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T02n0137_001:0860c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正當念此蠲除惡念。",
        "translation": "You should precisely remember this and remove bad thoughts.",
        "source": "T02n0137_001:0860c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T02n0137_001:0860c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰為比丘眾去諸重擔？",
        "translation": "Who removes the heavy burdens for the monks?",
        "source": "T02n0137_001:0860c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯如來耳無所不住，及舍利弗、摩訶目乾連。」",
        "translation": "Only the Tathāgata's ear doesn't stop, and there are Śāriputra and Mahāmaudgalyāyana.\"",
        "source": "T02n0137_001:0860c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，佛告大目連曰：「於心云何？",
        "translation": "The Buddha then addressed Mahāmaudgalyāyana, \"What's going on in the mind?",
        "source": "T02n0137_001:0860c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰敬比丘眾？",
        "translation": "Who respects the community of monks?",
        "source": "T02n0137_001:0860c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰制比丘眾？」",
        "translation": "Who controls the assembly of monks?\"",
        "source": "T02n0137_001:0860c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我心念言：「今佛世尊敬制比丘眾，唯然大聖！",
        "translation": "I thought to myself, \"Now, the Buddha honors the community of monks, only a great sage!",
        "source": "T02n0137_001:0860c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此比丘眾或有質朴少求知足，或不能者，自謂行安精進無懈，如來法王自應當然，吾亦如是。」",
        "translation": "Some of these monks are simple, seeking little contentment, or they aren't able to say that their practice is peaceful and their effort is relentless, as the Tathāgata King of Dharma should certainly be, and so am I.\"",
        "source": "T02n0137_001:0860c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「且止，勿有斯念！",
        "translation": "The Buddha said, \"Stop, don't think like that!",
        "source": "T02n0137_001:0860c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當更異念。",
        "translation": "\"You should also think differently.",
        "source": "T02n0137_001:0860c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T02n0137_001:0860c29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是目連，誰能堪任去諸重擔？",
        "translation": "Who, then, Mucilinda, is capable of removing these heavy burdens?",
        "source": "T02n0137_001:0860c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯如來耳，及舍利弗、大目乾連。",
        "translation": "Only the Tathāgata is heard, along with Śāriputra and the Mahāmaudgalyāyana.",
        "source": "T02n0137_001:0861a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「以信渡流氾，　　無放逸為船，　聖諦濟苦患，　　智慧究竟渡。」",
        "translation": "\"With faith, they tide over floodwaters, make nonfrivolity their boat, rescue suffering and distress with the noble truths, and completely tide over with wisdom.\"",
        "source": "T02n0137_001:0861a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛分別是語時，六十比丘漏盡意解，無數比丘遠塵離垢，諸法眼生。",
        "translation": "When the Buddha discerned these words, 60 monks' contaminants ended and their minds were liberated, and countless monks became dustless and spotless, and the eyes of the Dharma arose.",
        "source": "T02n0137_001:0861a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說如是，諸比丘、清信士、天、龍、鬼神，莫不歡喜。",
        "translation": "When the Buddha spoke thus, none of the monks, pure believers, gods, dragons, or ghosts rejoiced.",
        "source": "T02n0137_001:0861a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗摩訶目連遊四衢經",
        "translation": "Sutra of Śāriputra and Mahāmaudgalyāyana's Journey Through the Four Quarters",
        "source": "T02n0137_001:0861a07_0",
        "is_bad_quality": false
    }
]