[
    {
        "source_sentence": "佛說給孤長者女得度因緣經",
        "translation": "Sutra on the Causes and Conditions of the Attainment of Salvation for the Orphaned Elder Woman",
        "source": "T02n0130_003:0850b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卷下",
        "translation": "second part of the volume",
        "source": "T02n0130_003:0850b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天譯經三藏朝奉大夫試光祿卿",
        "translation": "Minister of Light for the Tripiṭaka Translation of the Sutra of the Western Paradise, the Grand Master of the Chaofeng",
        "source": "T02n0130_003:0850b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "傳法大師賜紫臣施護奉　詔譯",
        "translation": "Master Chuanfa Zhichen Shihuofeng Translation of the Imperial Edict",
        "source": "T02n0130_003:0850b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，尊者聞二百億化種種色華果樹林細密滿空，而此尊者林中現身，起是神通從空而來三繞彼城，次從空下入長者舍。",
        "translation": "Furthermore, the Venerable heard 20 billion transformations of a grove of various colored flowering fruit trees that fills the sky, and this venerable man appeared in the grove, gave rise to this superknowledge, came up from the sky, circled the city three times, and then descended from the sky into the elder's dwelling.",
        "source": "T02n0130_003:0850b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長者見是相已，問善無毒女言：「今此所來有種種色華果樹林，林中現身起如是相，入此舍者是汝師邪？」",
        "translation": "After he saw this, the elder asked the good, nonpoisonous woman, \"Now, is this your teacher who came from this forest of variegated, flowering fruit trees and appeared in the forest with this kind of body and form and entered this house?\"",
        "source": "T02n0130_003:0850b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女即答言：「此非我師，是佛弟子名聞二百億。",
        "translation": "The woman then replied, \"This isn't my teacher; this is a disciple of the Buddha who's heard of 20 billion people.",
        "source": "T02n0130_003:0850c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此人生已足不履地去地四指，足下有金色毛表其異相，若足履地時，地即六種震動。",
        "translation": "When this person is born, their feet don't touch the ground; they have golden hairs under their feet that indicate their different characteristics, and when their feet touch the ground, the ground shakes in six ways.",
        "source": "T02n0130_003:0850c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛曾謂諸苾芻言：『汝等當知，此聞二百億童子，於九十一劫中皆同此名，隨所生處足不履地，此人由起重法精進心故福報無盡。』",
        "translation": "The Buddha once told the monks, 'You should know that this person has heard of 20 billion children who share this name throughout 91 eons and whose feet don't touch the ground wherever they're born, and whose merit is endless because of their diligence in lifting the Dharma.'",
        "source": "T02n0130_003:0850c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此人精進第一。",
        "translation": "The Buddha said that this person's effort was the highest.",
        "source": "T02n0130_003:0850c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是此尊者次第而來。」",
        "translation": "This is the venerable one who comes in order.\"",
        "source": "T02n0130_003:0850c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，尊者畢陵伽婆蹉化大鵝車，現是神通從空而來三繞彼城，次從空下入長者舍。",
        "translation": "Furthermore, the Venerable Pilinda-vatsa transformed into a large goose chariot, showed this superknowledge, came up from the sky, circled the city three times, and then descended from the sky into the elder's residence.",
        "source": "T02n0130_003:0850c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長者見是相已，問善無毒女言：「今此所來乘大鵝車現如是相，入此舍者是汝師邪？」",
        "translation": "Seeing this appearance, the elder asked the good, nonpoisonous woman, \"Now that you've come in this great goose chariot with this appearance, is that your teacher who's entered this house?\"",
        "source": "T02n0130_003:0850c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女即答言：「此非我師，是佛弟子名畢陵伽婆蹉。",
        "translation": "The woman then replied, \"This isn't my teacher; this is a disciple of the Buddha named Pilinda-vatsa.",
        "source": "T02n0130_003:0850c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常修悲行，佛說此人悲行第一。",
        "translation": "He always cultivates compassionate behavior, and the Buddha says that this person's compassionate behavior is the best.",
        "source": "T02n0130_003:0850c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是此尊者次第而來。」",
        "translation": "This is the venerable one who comes in order.\"",
        "source": "T02n0130_003:0850c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，尊者烏陀夷化大馬車四寶莊嚴，現是神通從空而來三繞彼城，次從空下入長者舍。",
        "translation": "Furthermore, Venerable Udāyin transformed into a large carriage adorned with four treasures, showed this superknowledge, came up from the sky, circled the city three times, and then descended from the sky into the elder's residence.",
        "source": "T02n0130_003:0850c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長者見是相已，問善無毒女言：「今此所來乘大馬車四寶莊嚴，現如是相入此舍者是汝師邪？」",
        "translation": "After he saw this, the elder asked the good, non-poisonous woman, \"Is that your teacher who came in this large carriage adorned with four treasures and showed this kind of appearance entering this house?\"",
        "source": "T02n0130_003:0850c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女即答言：「此非我師，是佛弟子名烏陀夷。",
        "translation": "The woman then replied, \"This is not my teacher; this is a disciple of the Buddha named Udāyin.",
        "source": "T02n0130_003:0850c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此人是釋種眷屬，釋種之中，有淨飯王、白飯王、斛飯王、甘露飯王，并邪輸陀羅、娛閉迦沒哩誐惹等，六萬宮嬪婇女眷屬，是諸眷屬廣大熾盛富樂自在，此人棄捨出家修道而獲果證。",
        "translation": "This man is a member of the Śākyamuni clan, and among the Śākyamuni clan, there's the King of Pure Rice, the King of White Rice, the King of Tuberous Rice, the King of Nectarous Rice, the retinue of Śaśūdra and Ekaku Kaburi Gaṅga, and 60,000 ladies and ladies of the palace, and these members of his clan are vast and abundant, rich and comfortable, and this man has renounced leaving home and cultivating and has attained fruition.",
        "source": "T02n0130_003:0850c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此人於釋種中端嚴第一。",
        "translation": "The Buddha said that this person was the most dignified among the Śākyas.",
        "source": "T02n0130_003:0850c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是此尊者次第而來。」",
        "translation": "This is the venerable one who comes in order.\"",
        "source": "T02n0130_003:0850c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，尊者摩訶劫賓那化室尾迦四寶莊嚴，而此尊者乘彼室尾迦，現是神通從空而來三繞彼城，次從空下入長者舍。",
        "translation": "Furthermore, while Venerable Mahākauṣṭhila was adorned with four treasures, this venerable man rode that Śrīvaka, showed this superknowledge, came up from the sky, circled the city three times, and then descended from the sky into the elder's residence.",
        "source": "T02n0130_003:0850c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長者見是相已，問善無毒女言：「今此所來乘室尾迦四寶莊嚴，現如是相入此舍者是汝師邪？」",
        "translation": "After he saw this, the elder asked the good, nonpoisonous woman, \"Is that your teacher who rode that śrīvaka, adorned with the four treasures, into this house with this appearance?\"",
        "source": "T02n0130_003:0850c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女即答言：「此非我師，是佛弟子名摩訶劫賓那。",
        "translation": "The woman then replied, \"This isn't my teacher; this is a disciple of the Buddha named Mahākāśyapa.",
        "source": "T02n0130_003:0851a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此人棄捨家族出家修道而獲果證，常出軟語眾所愛樂，佛說此人軟語第一。",
        "translation": "This man renounced his family, left home, cultivated, and attained realization, always spoke softly and was loved by everyone, and the Buddha said that this man was the most soft-spoken.",
        "source": "T02n0130_003:0851a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是此尊者次第而來。」",
        "translation": "This is the venerable one who comes in order.\"",
        "source": "T02n0130_003:0851a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，尊者難陀化大園林華果茂盛，復有鵝鴈鸚鵡、孔雀舍利、囉俱枳羅命命等種種異鳥遊集其內，而此尊者在彼園中，現如是相從空而來三繞彼城，次從空下入長者舍。",
        "translation": "Furthermore, Venerable Nandanavana created a great garden filled with flowers and fruits, and there were geese, parrots, peacocks, Śāriputra, Rājagṛha, and other exotic birds roaming around it, and this venerable man in that garden showed this appearance as he came up from the sky, circled the city three times, and then descended from the sky into the elder's residence.",
        "source": "T02n0130_003:0851a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長者見是相已，問善無毒女言：「今此所來處大園林，華果茂盛異鳥遊集，現如是相入此舍者是汝師邪？」",
        "translation": "Seeing this appearance, the elder asked the good, non-poisonous woman, \"Now, is this your teacher who came from this place in the great garden, where flowers and fruits abound and where strange birds gather, and who entered this house with this appearance?\"",
        "source": "T02n0130_003:0851a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女即答言：「此非我師，是佛弟子名曰難陀，淨飯王之子，是佛親弟，比佛身量而短四指，三十二相莊嚴具足。",
        "translation": "The woman then replied, \"This is not my teacher; this is a disciple of the Buddha named Nandha, son of King Śuddhodana, a close disciple of the Buddha who is four fingers shorter than the Buddha in stature and fully adorned with the thirty-two marks.",
        "source": "T02n0130_003:0851a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此人往昔以清淨心，曾於迦葉如來、應供、正等正覺塔中，施一傘蓋眾寶莊嚴最上殊妙，以是因緣感勝福報，經一千五百生作轉輪王，受彼勝福而不出家，乃至于今出家修道而獲果證，此人於威儀中密護諸根。",
        "translation": "In the past, this man with a pure heart once placed an umbrella adorned with the highest and most marvelous treasures in a stūpa of the Tathāgata Kāśyapa, Worthy of Offerings, and Completely Awakened One.",
        "source": "T02n0130_003:0851a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此人密護諸根第一。",
        "translation": "The Buddha said that this person is the best at guarding his faculties intimately.",
        "source": "T02n0130_003:0851a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是此尊者次第而來。」",
        "translation": "This is the venerable one who comes in order.\"",
        "source": "T02n0130_003:0851a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，尊者羅睺羅化作轉輪王，福德威容勝妙殊特，眷屬侍衛七寶具足，有八十四俱胝勇健步兵烏布沙陀等，八萬四千最上象兵嚩羅賀迦等，八萬四千調善馬兵難儞瞿沙等，八萬四千妙寶車兵，復有無數百千侍衛人眾周匝圍繞，動百千種微妙音樂，寶嚴幢幡前後導從，大白傘蓋覆輪王頂，現是神通從空而來三繞彼城，未入其舍住虛空中。",
        "translation": "Furthermore, Venerable Rāhula was transformed into a wheel-turning king whose fortune and dignity were outstanding, whose retinue of guards was supplied with seven treasures, whose 84-cubic brave and sturdy foot soldiers were Upuṣadha and so forth, 84,000 most excellent elephant soldiers were Varuhāka and so forth, 84,000 well-adjusted horse soldiers were Nanni Ghoṣa and so forth, 84,000 wonderfully jeweled charioteers, and countless hundreds of thousands of attendants surrounded by a multitude of people moving a hundred thousand kinds of exquisite music, guided by banners and banners of precious adornment, and covered with a great white canopy that covered the wheel-turning king's head, who manifested this superknowledge and came from the sky to circumambulate the city three times before entering its abode and staying in the sky.",
        "source": "T02n0130_003:0851a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長者見是相已，問善無毒女言：「今此所來轉輪聖王，福德威容勝妙殊特，象馬車步四兵具足，現此勝相住空中者是汝師邪？」",
        "translation": "After he saw this, the elder asked the good, nonpoisonous woman, \"Is this the wheel-turning sage king from here, with his excellent features and dignified appearance, his elephant, horse, chariot, and four armies, and is he your teacher who's displaying this excellent appearance while standing in the air?\"",
        "source": "T02n0130_003:0851a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女即答言：「此非我師，是佛弟子名羅睺羅。",
        "translation": "The woman then replied, \"This is not my teacher; this is a disciple of the Buddha named Rāhula.",
        "source": "T02n0130_003:0851b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此人是佛之子，出家學戒而獲果證，佛說此人學戒第一。",
        "translation": "This person is a son of the Buddha who left home to train in the precepts and attained their realization, and the Buddha said that this person is the best at training in the precepts.",
        "source": "T02n0130_003:0851b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是此尊者現輪王身次第而來。」",
        "translation": "This is the venerable one who comes in order in the body of a wheel-turning king.\"",
        "source": "T02n0130_003:0851b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，羅睺羅即以所現轉輪王身住彼空中，說伽陀曰：「今我所現輪王身，　　以神通力故如是，　如龍有力我亦然，　　七寶四兵皆具足。",
        "translation": "Rāhula then stood up in the sky with the wheel-turning king's body in his possession and said to Gadha, \"Now, my manifestation of the wheel-turning king's body is like this because of my supernormal powers, just as I am because a dragon is powerful, so am I. I have seven treasures and four armies in abundance.",
        "source": "T02n0130_003:0851b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此所現身而非實，　　神通方便故隨宜，　長者應當如實知，　　我是佛子羅睺羅。",
        "translation": "This body that I'm presenting is not real, but it's appropriate because of my supernormal powers, so the elder should really know that I'm Rāhula, the son of the Buddha.",
        "source": "T02n0130_003:0851b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　已獲果證神通具，　　人天供養悉歸依，　我依佛勅故今來，　　牟尼大師後當至。」",
        "translation": "I have fully realized my supernormal powers, and I take refuge in the offerings of humans and gods. I've come because of the Buddha's order, and I'll be followed by the great teacher Muni.\"",
        "source": "T02n0130_003:0851b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是伽陀已即從空下入長者舍。",
        "translation": "After speaking thus, Gautama descended from the sky into the elders' residence.",
        "source": "T02n0130_003:0851b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等諸有神通大苾芻眾，咸依佛勅各現神通，次第來入長者舍中，俟佛當至。",
        "translation": "Thus, these large groups of monks with supernormal powers each manifested their supernormal powers in response to the Buddha's command, and they each entered the elders' residence in turn, waiting for the Buddha to arrive.",
        "source": "T02n0130_003:0851b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊知時已至，即入三摩地普遍觀察，於是三摩地出已，舉身出現青黃赤白種種妙色清淨光明，如是色光廣大照耀遍舍衛國，乃至福增城中所有一切人眾蒙光照者，以佛神力皆見佛身，內外映徹一切無礙。",
        "translation": "Knowing that the time had arrived, the Bhagavān then entered samādhi and universally observed it. After emerging from this samādhi, he raised his body and beamed a wonderful, pure light of various colors, blue, yellow, red, and white, and such a colorful light shone broadly throughout the country of Śrāvastī, even to the point where all the people in the fortunate city who were blinded by the light saw the Buddha's body by the Buddha's supernormal power, and it reflected inside and out without obstruction.",
        "source": "T02n0130_003:0851b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛放光時大地震動。",
        "translation": "A great earthquake shook the place when the Buddha emitted that light.",
        "source": "T02n0130_003:0851b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊著僧伽梨衣，與彼一切所應隨佛，崑努鉢陀那等苾芻大眾前後圍繞，出舍衛國往詣福增城。",
        "translation": "The Bhagavān then put on his saṃghârī robes, accompanied by all the buddhas who should follow him, surrounded by a large crowd of monks such as Cūḷapanthaka, and left Śrāvastī and went to the city of Fuzeng.",
        "source": "T02n0130_003:0851b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時娑婆界主大梵天王知是事已，即與色界諸天子眾，來佛右邊侍衛而行；帝釋天主知是事已，即與欲界諸天子眾，來佛左邊侍衛而行。",
        "translation": "Knowing this, the ruler of the Śrāvastī realm, King Brahmā, came with a multitude of gods and sons of the form realm to the right of the Buddha to guard him, and the ruler of the Indra heavens knew this and came with a multitude of gods and sons of the desire realm to the left of the Buddha to guard him.",
        "source": "T02n0130_003:0851b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有善愛音等五百乾闥婆王，奏百千種微妙音樂引導佛前；又有無數百千天龍鬼神人非人等隨從佛後；又有無數天女在虛空中，各持優鉢羅華、鉢訥摩華、俱母那華、奔拏利迦華、天曼陀羅華、摩訶曼陀羅華等，及雨栴檀香、末香、儞誐嚕香、多誐嚕香、多摩羅香等種種妙香供養於佛，又復奏彼天妙音樂，有如是等天人大眾圍繞而行。",
        "translation": "There were also five hundred gandharvas playing a hundred thousand kinds of exquisite music to guide the Buddha, and there were measureless hundreds of thousands of gods, dragons, ghosts, humans, and nonhumans following the Buddha, and there were numberless goddesses in the sky carrying utpala flowers, panama flowers, kumuda flowers, puṇḍarīka flowers, celestial maṇḍala flowers, mahāmandala flowers, and other wonderful fragrances such as sandalwood, mahāsa, nyagrodha, turuṣka, and tamālaka fragrances to offer to the Buddha, as well as playing the wonderful music of those gods, and there were a great multitude of such gods walking around them.",
        "source": "T02n0130_003:0851b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時路次大曠野中，有七千仙人先止於彼，見佛世尊三十二相、八十種好皆悉具足，圓光照耀如千日輪，廣大巍巍如寶山現，吉祥勝相無有等比，復有微妙金色光明周遍熾盛；如是見已俱近佛前，頭面禮足合掌恭敬退住一面。",
        "translation": "At the time, there were 7,000 sages in the great wilderness on the other side of the road who first stopped there and saw the Bhagavān in all of his thirty-two forms and eighty attributes, his circular light shining like a thousand suns, his vast and lofty presence like a jeweled mountain, his auspicious features unsurpassed, and his subtle golden light blazing all around.",
        "source": "T02n0130_003:0851c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸仙人皆以宿種善根力故，而能最先見佛世尊。",
        "translation": "All of these sages were the first to see the Bhagavān because of the power of their long-ago good roots.",
        "source": "T02n0130_003:0851c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊普遍觀察如是七千仙人善根成熟，即於曠野中，乃為如應略說四諦法門。",
        "translation": "After generally observing the maturation of the good roots of these 7,000 sages, the Bhagavān then went out into the wilderness and explained the teaching of the four truths in brief for them as they should be.",
        "source": "T02n0130_003:0851c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸仙人聞是法已，智慧堅固心開意解各各歡喜，即時踊身虛空高二十山峯，俱證須陀洹果，從空下已圍繞世尊即同隨從。",
        "translation": "After hearing this teaching, the sages' wisdom was so resolute that their minds were enlightened and their thoughts were liberated, and they each rejoiced as they immediately rushed into the sky and rose twenty mountain peaks high, all realizing the fruit of stream entry, and descended from the sky to surround the Bhagavān and follow him.",
        "source": "T02n0130_003:0851c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊度是七千仙人已，漸次前行將至福增城門，即作是念：「此福增城有十八門，我今若從西門而入，餘門所有一切人眾不能見我，我今宜應於彼諸門各現佛身，隨諸門入，令一切人皆見佛身，我即實從西門而入。」",
        "translation": "After he had delivered these 7,000 sages, the Bhagavān then gradually moved forward and approached the gate of the city of merit, thinking, \"There are 18 gates in this city of merit, and if I were to enter through the west gate now, all the people at the other gates wouldn't be able to see me; perhaps I should now reveal the Buddha's body at each of those gates and enter through them, so that all of them will see the Buddha's body, and I'll actually enter through the west gate.\"",
        "source": "T02n0130_003:0851c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊作是念已，即現其身隨諸門入，一一皆有天人大眾周匝圍繞。",
        "translation": "After that thought, the Bhagavān then revealed his body and entered through each of those gates, surrounded by a multitude of gods and goddesses.",
        "source": "T02n0130_003:0851c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當佛入城門時以神通力，自然除去荊棘砂礫，一切不淨悉令清淨，內外香潔地平如掌無高下相。",
        "translation": "When the Buddha entered the city gates, he used his supernormal powers to naturally remove thorns, thorns, sand, and debris, making all impurities pure and clean, and the ground was clean and level inside and out like a palm without any sign of height.",
        "source": "T02n0130_003:0851c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛所行處彼彼諸門，有低小者自然高大，有迮狹處自然寬廣，城中所有一切象馬等類，其性[怡-台+龍]悷不調伏者自然調伏。",
        "translation": "At each of those gates where the Buddha walks, whatever is low and small naturally becomes taller, whatever is narrow naturally becomes wider, and all the elephants, horses, and other creatures in the city whose natures are [yi-tai+nāga] sorrowful and ungovernable are naturally tamed.",
        "source": "T02n0130_003:0851c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復城中一切人民，各各歡喜瞻仰世尊，又復以佛神通力故，其中所有盲者能視，聾者能聞，瘂者能言，乃至諸根不完具者，悉得完具，迷惑醉亂顛狂心者，皆得醒悟正定不亂，為毒所中者悉離諸毒，互起恚恨者慈心相向，諸懷妊者胎藏安隱生福德子，諸貧匱者自然財寶悉得豐足。",
        "translation": "Furthermore, because of the Buddha's supernormal powers, all the people in the city rejoiced and venerated the Bhagavān, and because of his supernormal powers, all of them could see when blind, hear when deaf, and speak when dumb, even those whose faculties weren't perfectly endowed could all be perfectly endowed, those who were deluded, drunk, and confused could all awaken and correctly concentrate without being disturbed, those who were poisoned by poison were all freed from poison, those who were angry with each other were kind and directed toward each other, those who were pregnant had a secure womb and produced blessed children, and those who were poor naturally had an abundance of possessions.",
        "source": "T02n0130_003:0852a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛入城時有如是等希有之事，一切人民皆獲利益，佛乃實從西門而入。",
        "translation": "Such rare things as these happened when the Buddha entered the city and all the people were benefited, so the Buddha actually entered through the western gate.",
        "source": "T02n0130_003:0852a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊既入城已，攝諸化身唯一實身，至謨尸羅長者舍。",
        "translation": "After he entered the city, the Bhagavān gathered all the transformation bodies into his only real body and went to the elder's residence in Maśīla.",
        "source": "T02n0130_003:0852a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時善無毒女即謂長者言：「此所來者是我大師，號釋迦牟尼如來、應供、正等正覺。」",
        "translation": "The good, nonpoisonous woman then told the elder, \"This is my great teacher, who's called Śākyamuni the Tathāgata, Worthy of Offerings, and Perfectly Enlightened.\"",
        "source": "T02n0130_003:0852a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時長者并諸眷屬，見佛如是神通威德種種相好，心生敬信即各頭面禮佛雙足。",
        "translation": "The elder and his retinue then saw the Buddha's various appearances with such superb powers and virtue, and they each bowed their heads and feet to the Buddha in reverence.",
        "source": "T02n0130_003:0852a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時善無毒女見佛世尊，踊躍歡喜頭面禮足合掌向佛說伽陀曰：「我佛常說最上語，　　而能調伏他語言，　聞者能生清淨心，　　我不見佛深苦惱。",
        "translation": "When the good, nonpoisonous woman saw the Bhagavān, she rejoiced, bowed her head to his feet, put her palms together, and said to the Buddha, \"My Buddha always speaks the most excellent words, which tame other tongues and give rise to a pure mind when you hear them, but I haven't seen the Buddha's deep suffering.",
        "source": "T02n0130_003:0852a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛悲愍故來此中，　　我等今日得大利，　我以清淨至誠心，　　頂禮如來吉祥足。」",
        "translation": "Because the Buddha has compassionately come here, we've attained great rewards today, and with a pure and sincere heart, I bow my head at the Tathāgata's auspicious feet.\"",
        "source": "T02n0130_003:0852a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，善無毒女說伽陀已，即取牛頭栴檀香水奉佛洗足，佛洗足已處于最上莊嚴寶座，諸苾芻眾亦各洗足次第而坐。",
        "translation": "After she spoke about the Gṛdhrakūṭa, the good, non-poisonous woman then took fragrant water from the oxhead sandalwood and offered it to the Buddha to wash his feet.",
        "source": "T02n0130_003:0852a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，善無毒女即持清淨上味飲食，自手奉上供佛世尊及苾芻眾，長者并眷屬亦各持食奉上於佛及苾芻眾，如是次第行食已遍，佛及苾芻隨應而食。",
        "translation": "At the time, the good, pure, and excellent woman then took this pure and delicious food and drink and offered it to the Bhagavān and the monks, and the elders and their retinues each took their own food and offered it to the Bhagavān and the monks, and after thus eating in sequence, the Bhagavān and the monks ate accordingly.",
        "source": "T02n0130_003:0852a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時福增城中一切婆羅門長者居士，外道尼乾陀等，無數百千人眾悉詣長者舍欲觀世尊。",
        "translation": "At the time, an incalculable number of hundreds of thousands of people from all the Brāhmaṇas, elders, householders, and non-Buddhists like Nirgrantha in the city of Bokhara rushed to the elders' residence to look at the Bhagavān.",
        "source": "T02n0130_003:0852a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等意謂：「長者住舍而甚迫迮不能容受爾許人眾。」",
        "translation": "Their intention was, \"That house of the elder is too constrained to accommodate such a large crowd.\"",
        "source": "T02n0130_003:0852b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "咸起礙想。",
        "translation": "They all got the impression that they were being obstructed.",
        "source": "T02n0130_003:0852b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊知其意已，即變長者舍作水精舍，內外瑩徹廣博嚴淨，令諸人眾各得觀佛無所妨礙。",
        "translation": "Knowing their intentions, the Bhagavān then transformed the elders' residence into a water-precision dwelling, which was clear and thorough inside and out, vast and clean, so that each of the people could look at the Buddha without any obstruction.",
        "source": "T02n0130_003:0852b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸人眾各見佛已，心大歡喜異口同音，說伽陀曰：「今此長者舍，　　而水精所成，　摩尼及真金，　　諸寶皆映現。",
        "translation": "After they each saw the Buddha, their hearts rejoiced greatly, and they spoke with one voice, saying, \"Now, this house of the elders is made of water essence, and its jewels, such as mohair and genuine gold, are all reflected in it.",
        "source": "T02n0130_003:0852b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　清淨復廣博，　　如天帝釋宮，　各得見世尊，　　斯為甚希有。",
        "translation": "It's pure and vast, like the palace of Indra, and it's rare that each person gets to see the Bhagavān.",
        "source": "T02n0130_003:0852b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等一切眾，　　瞻仰住佛前，　咸生清淨心，　　恭敬合掌禮。",
        "translation": "All of us who look up and stand before the Buddha give rise to a pure mind, bowing our palms together in respect.",
        "source": "T02n0130_003:0852b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　牟尼處眾會，　　如星中現月，　功德所莊嚴，　　是故我歸命。」",
        "translation": "The image of the Muni in this congregation is like the moon appearing among the stars, adorned by merit; therefore, I give my respectful vows.\"",
        "source": "T02n0130_003:0852b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊飯食已訖，諸苾芻眾亦各食訖，於是世尊不起于座，與無數百千天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，并餘婆羅門、長者、居士、外道、尼乾陀，乃至善無毒女及謨尸羅長者，妻子眷屬如是等眾，周匝圍繞聽佛說法。",
        "translation": "After the Bhagavān had finished eating and the congregation of monks had finished eating, the Bhagavān then rose from his seat and gathered with measureless hundreds of thousands of gods, dragons, yakṣas, gandharvas, asuras, kaluras, kiṃnaras, mahoragas, humans and nonhumans, other priests, elders, householders, heretics, nyagandhas, even good, nonpoisonous women and elders of Māsikara, their wives and retinues, and so forth, and surrounded them to hear the Buddha preach.",
        "source": "T02n0130_003:0852b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊普為大眾，如應演說苦集滅道四諦法門。",
        "translation": "At the time, the Bhagavān explained the Dharma teaching of the four truths of suffering, arising, ceasing, and the path as it should be explained to the entire assembly.",
        "source": "T02n0130_003:0852b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說是法門時，諸外道中有善根成熟者，聞法歡喜生淨信心歸依世尊，隨其所應而獲利益。",
        "translation": "When the Buddha taught this dharma-gate, some laypeople with ripe good roots who heard the teaching rejoiced and developed a pure faith, relying on the Bhagavān and obtaining benefits as they saw fit.",
        "source": "T02n0130_003:0852b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復眾中有得住煖位者，有得住頂位者，有得住忍位者，有得須陀洹果者，有得斯陀含果者，有得阿那含果者，有得阿羅漢果者。",
        "translation": "Again, there were those among them who had attained the stage of abiding in Nun, those who had attained the stage of abiding at the top, those who had attained the stage of abiding in patience, those who had attained the fruit of stream entry, those who had attained the fruit of once-returning, those who had attained the fruit of non-returning, and those who had attained the fruit of arhatship.",
        "source": "T02n0130_003:0852b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謨尸羅長者聞佛說法發清淨心，如其所應亦得利益，善無毒女以宿善根力，及聞說法得須陀洹果。",
        "translation": "That elder Maśīla who heard the Buddha teach the Dharma and aroused a pure mind as he should have done also received the benefit of that good, nonpoisonous woman who, because of the strength of her long-standing good roots, had heard the teaching and attained the fruit of stream entry.",
        "source": "T02n0130_003:0852b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，諸苾芻俱白佛言：「世尊！",
        "translation": "At the time, the monks all said to the Buddha, \"Bhagavān!",
        "source": "T02n0130_003:0852c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉希有！",
        "translation": "Bravo, Sīvali!",
        "source": "T02n0130_003:0852c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此善無毒女，真是善知識，因此女故多人獲益，而能如是施作佛事。」",
        "translation": "This good, nonpoisonous woman is really a good teacher, and it's because of her that many people are benefited and can thus give to Buddha-works.\"",
        "source": "T02n0130_003:0852c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「諸苾芻！",
        "translation": "The Buddha said, \"Precepts, monks!",
        "source": "T02n0130_003:0852c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等當知此善無毒女，非唯今日於我法中為善知識能作佛事，此人已於過去佛法中，為善知識開導他人施作佛事，汝等善聽我今略說。」",
        "translation": "You should know that this good, nonpoisonous woman is not the only one who can perform Buddha-works for good teachers in my teaching today; this person has already performed Buddha-works for good teachers and guided others in the Buddha's teaching in the past, so listen well as I explain it briefly.\"",
        "source": "T02n0130_003:0852c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸苾芻受教而聽。",
        "translation": "The monks then accepted the teaching and listened.",
        "source": "T02n0130_003:0852c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「諸苾芻！",
        "translation": "The Buddha said, \"Preach, monks!",
        "source": "T02n0130_003:0852c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去世中人壽二萬歲時，有佛出世名曰迦葉如來、應供、正等正覺、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "Once upon a time in a past life of 20,000 years, a Buddha appeared in the world named Kāśyapa Tathāgata, Worthy of Offerings, Completely Awakened, Perfectly Practiced, Well Gone, Understander of the World, Unsurpassed Person, Trainer, Teacher of Gods and People, Buddha, and World Honored One.",
        "source": "T02n0130_003:0852c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛一時，在波羅奈國仙人墮處鹿野園中，與苾芻眾俱、彼國有王名為哀愍，其王具大福德，正法治世。",
        "translation": "One time, the Buddha was in the Deer Preserve of Vārāṇasī with a group of monks and nuns, and there was a king named Miliṇḍa in that country who was blessed with great virtue and who correctly ruled the world.",
        "source": "T02n0130_003:0852c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王有一女，生已自然頂有金鬘，乃為彼女立名金鬘，王所愛念，即勅后妃宮嬪眷屬，養育侍衛後至成長。",
        "translation": "The king had a daughter who was born with a gold garland on her head, so he named her Golden Garland. The king was fond of her, and he ordered his queen, ladies, and attendants to nurture and guard her until she grew up.",
        "source": "T02n0130_003:0852c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼女以其宿善根力，於佛法中深生愛樂，聞佛在彼鹿野園中，即與五百宮嬪眷屬圍繞，往詣鹿野園中瞻禮世尊，到已至誠頭面禮足，佛即如應為說法要，彼聞法已心生淨信，而白佛言：『我自今日乃至盡壽，常以飲食衣服臥具醫藥奉上世尊。』",
        "translation": "When he heard that the Buddha was there in Deer Park, he sent her with 500 members of his retinue to pay homage to the Bhagavān and when she arrived, they bowed their heads and feet in sincerity.",
        "source": "T02n0130_003:0852c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是白已即如其言，常以四事供給世尊。",
        "translation": "After making this statement, he did as he said and always made offerings to the Bhagavān in four ways.",
        "source": "T02n0130_003:0852c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼哀愍王，忽於一夜得十種夢：一者夢見有一大象從窓牖出，身雖得出尾為窓礙。",
        "translation": "Then, that compassionate king suddenly had ten kinds of dreams one night: First, he dreamt that he saw a large elephant emerging from a window, but although its body was exiting, its tail was obstructed by a window.",
        "source": "T02n0130_003:0852c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者夢見有一渴人井隨其後，是人寧忍於渴終不取飲。",
        "translation": "Second, he dreamt that there was a thirsty man following him down a well, but that man tolerated his thirst and never took a drink.",
        "source": "T02n0130_003:0852c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者夢見有人以其真珠貿易於麨。",
        "translation": "Third, he dreamt that someone traded their real pearls for sandwiches.",
        "source": "T02n0130_003:0852c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者夢見有人以其栴檀香木貿易常木。",
        "translation": "Fourth, he dreamt that someone traded his sandalwood for everlasting wood.",
        "source": "T02n0130_003:0852c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者夢見有一大園華果茂盛，忽為猛風吹落散壞。",
        "translation": "Fifth, he dreamt that he saw a large garden full of flowers and fruit that was suddenly blown down by a fierce wind and scattered.",
        "source": "T02n0130_003:0852c27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六者夢見有諸小象，驅大香象奔走而出。",
        "translation": "Sixth, he dreamt that he saw small elephants that drove a large fragrant elephant out of the way.",
        "source": "T02n0130_003:0852c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七者夢見有一獼猴身有糞穢，四向馳走污諸獼猴，眾皆迴避。",
        "translation": "Seventh, he dreamt that he saw a monkey with excrement on its body that ran in all directions and defiled the monkeys, causing them to avoid him.",
        "source": "T02n0130_003:0852c29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八者夢見有一獼猴於一處坐，有眾獼猴為作灌頂。",
        "translation": "Eight: In a dream, I saw a monkey sitting in one place, and there were many monkeys who gave consecration to him.",
        "source": "T02n0130_003:0853a01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九者夢見一張白[疊*毛]，有十八人各各執奪少分而[疊*毛]不破。",
        "translation": "Nine, he dreamt that he saw a sheet of white [pile*hair] and eighteen people each grabbing a small amount of it without breaking the [pile*hair].",
        "source": "T02n0130_003:0853a02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十者夢見有多人眾聚集一處，互相鬪諍論競是非。",
        "translation": "Ten, he dreamt that he saw a large crowd of people gathered in one place, fighting with each other about right and wrong.",
        "source": "T02n0130_003:0853a04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此等是為所得十夢。",
        "translation": "These are the ten dreams that he has.",
        "source": "T02n0130_003:0853a05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王睡覺已作是思惟：『我得此夢是不吉祥，豈非於我壞壽命邪？』",
        "translation": "After he fell asleep, the king thought, 'This dream I had was inauspicious, didn't it ruin my life?'",
        "source": "T02n0130_003:0853a05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已至明旦時，即集群臣共議斯夢。",
        "translation": "After he had thought this, he gathered a group of ministers together at sunrise to discuss the dream.",
        "source": "T02n0130_003:0853a07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時諸臣皆悉不能定其善惡，王復召一婆羅門具說十夢，令其伺察善惡之相。",
        "translation": "When the ministers were all unable to determine whether it was good or bad, the king summoned another brāhmaṇa to explain the ten dreams in detail and asked him to examine their signs of good and bad.",
        "source": "T02n0130_003:0853a08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門言：『大王當知，此夢不祥，願王作法破不祥事。』",
        "translation": "The brāhmaṇa said, 'Great king, you should know that this dream is inauspicious, and may the king create a way to dispel the inauspicious events.'",
        "source": "T02n0130_003:0853a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『汝法云何？』",
        "translation": "The king said, 'What's your teaching?'",
        "source": "T02n0130_003:0853a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門言：『王所愛念彼金鬘女，一切人民亦悉愛重，願王今時以此愛女，破身出血流為江河，剖腹取腸聯作城邑，若作是法，即能破彼不祥之事，若不如是，於王壽命有所損失。』",
        "translation": "The Brāhmaṇa said, 'The king loves that golden-hued woman and all the people love her, so may the king now wish that this beloved woman would break his body and spill blood into a river, cut open his stomach and intestines, and make a city out of her; if he does this, he'll be able to destroy that inauspicious thing; if he doesn't, the king's life will be lost.'",
        "source": "T02n0130_003:0853a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，王言：『我於今時寧自失命，而終不害彼金鬘女。』",
        "translation": "At that point, the king said, 'Now, I'd rather lose my own life than harm that gold garland woman.'",
        "source": "T02n0130_003:0853a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是言已王入後宮，搘頤不悅默然而坐。",
        "translation": "After saying this, the king went into the back palace, gathered his health and displeasure, and sat silently.",
        "source": "T02n0130_003:0853a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時金鬘女見王默坐，有愁憂相，來詣王前即白王言：『我父何故有愁憂相？",
        "translation": "Seeing the king sitting silently, the golden-hued woman looked sad and troubled and came to the king and said, 'Why does my father look sad and troubled?'",
        "source": "T02n0130_003:0853a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟何事，願王今說。』",
        "translation": "'What do you think, may the king now explain?'",
        "source": "T02n0130_003:0853a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彼王具以十夢及婆羅門言，為金鬘女說。",
        "translation": "The king then explained all ten dreams and the words of the Brāhmaṇa for the golden garland girl.",
        "source": "T02n0130_003:0853a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼女聞已復白王言：『去此不遠鹿野園中，迦葉如來、應供、正等正覺，與苾芻眾而現集會。",
        "translation": "After she heard them, she again said to the king, 'Not far from here, in Deer Preserve, the Tathāgata Kāśyapa, Worthy of Offerings, and Perfectly Enlightened One is gathered here with a congregation of monks.",
        "source": "T02n0130_003:0853a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今與王同詣於彼，以夢問佛，佛是一切智者，必能為王說善惡相。』",
        "translation": "Now, I went there with the king and asked the Buddha in a dream about how the Buddha, who is omniscient, would be able to explain the characteristics of good and evil to the king.'",
        "source": "T02n0130_003:0853a22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時哀愍王即如其言，與金鬘女及諸臣從，詣鹿野園佛世尊所，到已頭面禮世尊足退坐一面，彼金鬘女及諸臣從，亦各禮佛一面而住。",
        "translation": "According to his words, the compassionate king then went with the golden-hued maiden and her retinue to the Bhagavān in Deer Park, where they bowed their heads at the Bhagavān's feet and withdrew to sit at one side, while the golden-hued maiden and her retinue each bowed to one side of the Buddha and stayed there.",
        "source": "T02n0130_003:0853a24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時復有諸婆羅門長者居士亦在佛會，爾時，彼佛即為哀愍王及諸會眾，如應說法示教利喜已，佛即默然。",
        "translation": "At the time, there were also Brahman priests and laymen present in the Buddha's assembly, and the Buddha then answered in silence after he had explained the teaching as it should be for the benefit of King Miliṇḍa and the assembly.",
        "source": "T02n0130_003:0853a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼哀愍王從座而起住立佛前，具以十夢次第而說，說已復言：『我以此緣，恐於壽命有所損失，願佛悲愍為我開決。』",
        "translation": "The compassionate king got up from his seat and stood before the Buddha, reciting the ten dreams in order, and after speaking them, he also said, 'For this reason, I'm afraid I'll lose my life; may the Buddha have compassion and resolve this for me.'",
        "source": "T02n0130_003:0853a29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：『大王！",
        "translation": "The Buddha said, 'Great king!",
        "source": "T02n0130_003:0853b03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿怖勿怖！",
        "translation": "Don't be afraid, don't be afraid!",
        "source": "T02n0130_003:0853b03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如所得夢皆非汝事，亦非今時善惡之相，於汝壽命亦無損失。",
        "translation": "Such dreams as you have had aren't your business, nor are they signs of good and evil at this time, and there's no loss of life for you.",
        "source": "T02n0130_003:0853b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王當知，是未來世中人壽百歲時，有佛出世名釋迦牟尼十號具足，彼佛住世演說諸法教化眾生，如其所應作佛事已而入涅槃，入涅槃後於遺法中苾芻弟子諸所作事，王今此夢是彼前相，我今為王次第而說。",
        "translation": "You should know, Your Majesty, that in a future life of 100 years, a Buddha will appear in the world named Śākyamuni, complete with the ten epithets, who will abide in the world, expound the teachings and transform sentient beings, perform Buddha-works as he should, and then enter nirvāṇa, and after entering nirvāṇa, he'll leave behind all the deeds of his disciples.",
        "source": "T02n0130_003:0853b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如王所夢有一大象從窓牖出，身雖得出尾為窓礙者，是彼佛入涅槃後，於遺法中有婆羅門長者居士若男若女，棄捨眷屬出家學道，雖出家已，心猶貪著名利俗事不能解脫。",
        "translation": "That dream of the king about a large elephant emerging from a window, even though its body exits and its tail is obstructed by a window, was about a Brahman, an elder householder, a man, or a woman who abandoned his or her dependents and left home to train on the path after the Buddha entered nirvāṇa and, even though he had left home, his mind still craved worldly things that were attractive and could not be liberated.",
        "source": "T02n0130_003:0853b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如王所夢有一渴人井隨其後，是人寧忍於渴終不取飲者，是彼遺法中有諸苾芻，為婆羅門長者居士說佛經典，彼婆羅門等心生厭捨不樂聽受。",
        "translation": "Like the king's dream about a thirsty man with a well following him who tolerates his thirst but never takes a drink, there are some monks in that legacy who teach the Buddha's sūtras to that householder, but those brāhmaṇas become disillusioned with them and don't enjoy listening to them.",
        "source": "T02n0130_003:0853b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如王所夢有人以其真珠貿易於麨者，是彼遺法中有諸苾芻弟子，不能依佛正典修習根力覺道禪定出世間法，而復愛樂修習世間經書呪術歌詠言頌。",
        "translation": "If the king's dream was that someone traded their real beads for sandwiches, then there are some rudimentary disciples of that legacy who can't rely on the Buddha's right scriptures to cultivate the awakening faculties, awaken to the path, meditate, and meditate on supramundane dharmas but instead enjoy cultivating worldly scriptures, dhāraṇīs, songs, and verses.",
        "source": "T02n0130_003:0853b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如王所夢有人以其栴檀香木貿易常木者，是彼遺法中有諸苾芻，以佛經典，貿易世間經書外道典籍。",
        "translation": "If the king's dream was that someone was trading their sandalwood for ordinary wood, then those rudimentary monks are trading the scriptures of the Buddha for the scriptures of non-Buddhists.",
        "source": "T02n0130_003:0853b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如王所夢有諸小象驅大香象奔走而出者，是彼遺法中有諸破戒無德苾芻，見彼持戒有德苾芻眾共嫌惡，巧設方便擯令遠去。",
        "translation": "\"Suppose the king dreams that there are small elephants that chase away large fragrant elephants, because there are legacy monks who break the precepts and lack virtue, and when they see those virtuous monks upholding the precepts and the many dislikes, they deftly try to get them to leave.",
        "source": "T02n0130_003:0853b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如王所夢有一大園華果茂盛，忽為猛風吹落散壞者，是彼遺法中有諸清淨持戒具德多聞苾芻，安止僧伽藍摩，為彼所有不修身不修心不修慧麁惡苾芻眾共毀壞彼僧伽藍摩；如是壞已，復令清淨苾芻最勝事業亦悉破壞。",
        "translation": "\"Suppose the king dreams about a large garden full of flowers and fruit that's suddenly blown down by a fierce wind and scattered, because there are well-established, well-versed monks who uphold precepts and are settled in the monastery, and they work together to destroy the monastery for a group of uncultivated monks who don't cultivate body, mind, or wisdom; after such destruction, the most excellent works of the pure monks are also destroyed.",
        "source": "T02n0130_003:0853b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如王所夢有一獼猴身有糞穢，四向馳走污諸獼猴，眾皆迴避者，是彼遺法中有諸破戒苾芻，自破淨戒不具慚愧，而復返於清淨信心王臣之前，毀謗持戒有德苾芻。",
        "translation": "\"Suppose the king dreams about a monkey with a body full of excrement that runs in all directions and defiles the monkeys, and the whole crowd avoids it; these are legacy monks who break the precepts, don't have conscience, and return to the pure faith of the king's ministers to disparage virtuous monks who uphold the precepts.",
        "source": "T02n0130_003:0853c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如王所夢有一獼猴於一處坐，有眾獼猴為作灌頂者，是彼遺法中不修勝行無德苾芻，眾共成立為僧中上首，統攝有德修勝行者。",
        "translation": "As the king dreamed, there was a monkey sitting in one place and a group of monkeys who did the consecration for him, and this was one of those legacy monks who didn't cultivate excellent behavior and were immoral, and they were all established together as the head of the saṃgha and collected those who were virtuous and cultivated excellent behavior.",
        "source": "T02n0130_003:0853c06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如王所夢一張白[疊*毛]有十八人，各各執奪少分而[疊*毛]不破者，是彼遺法中有諸弟子異見興執，以佛教法分十八部，雖復如是而佛教法亦不破壞。",
        "translation": "Suppose the king dreams that there are 18 people on a sheet of white [tufted*hair], each seizing a small portion, but the [tufted*hair] isn't broken; this is because there are disciples in that legacy who hold to a different view and divide the Buddhist teaching into 18 groups, but even though it's like this, the Buddhist teaching isn't destroyed.",
        "source": "T02n0130_003:0853c09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如王所夢有多人眾聚集一處，互相鬪諍論競是非者，是彼遺法中有諸苾芻，聚集議論世間名聞利養等事，由此因緣互相鬪諍不能寂靜，漸使世尊清淨法滅。",
        "translation": "Such as the king's dream about a multitude of people gathering in one place and fighting with each other about right and wrong, this is a legacy of those monks who gather to discuss worldly fame and profit, and so forth, and who, as a result, fight with each other and aren't able to calm down, which gradually causes the Bhagavān's pure teaching to cease.",
        "source": "T02n0130_003:0853c12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T02n0130_003:0853c16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是十夢皆非汝事，是彼之相汝不應怖，壽命無失宜自安意。』",
        "translation": "These ten dreams are not your business; you shouldn't be afraid of their appearance; it's better to be at ease with your own thoughts that your life won't be lost.'",
        "source": "T02n0130_003:0853c16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，哀愍王聞佛為說所夢事已，心大歡喜，禮彼佛足還復王宮。",
        "translation": "After hearing the Buddha's explanation of what had happened in that dream, the compassionate king rejoiced greatly, saluted the Buddha's feet, and returned to the palace.",
        "source": "T02n0130_003:0853c17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻！",
        "translation": "'Precious monks!",
        "source": "T02n0130_003:0853c19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼迦葉如來，為哀愍王說所夢已，復為眾會說四諦法，時彼會中有八萬四千人，皆悉見諦而獲利益。",
        "translation": "After he had explained what King Miliṇḍa had dreamed, the Tathāgata Kāśyapa also explained the teaching of the four truths to the assembly, and 84,000 people in that assembly all saw the truths and received benefit.",
        "source": "T02n0130_003:0853c19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻！",
        "translation": "Monks!",
        "source": "T02n0130_003:0853c21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T02n0130_003:0853c21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼金鬘女，於彼佛法中為哀愍王作善知識建立佛事者，豈異人乎？",
        "translation": "Isn't that woman, the golden garland, someone else who's a good teacher of the Buddha's teachings for the compassionate king and who establishes the Buddha's works?",
        "source": "T02n0130_003:0853c22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即今善無毒女是。",
        "translation": "\"Now, this is the good, nonpoisonous woman.",
        "source": "T02n0130_003:0853c23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻！",
        "translation": "Bhikṣus!",
        "source": "T02n0130_003:0853c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故當知此善無毒女，已於過去佛法中為善知識，今於我法中亦與多人為善知識，使令多人皆獲利益。」",
        "translation": "Therefore, you should know that this good, nonpoisonous woman who was a good teacher in the Buddha's teachings in the past will now also be a good teacher to many people in my teachings, so that many people will be benefited.\"",
        "source": "T02n0130_003:0853c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，諸苾芻復白佛言：「世尊！",
        "translation": "It was then that the monks again said to the Buddha, \"Bhagavān!",
        "source": "T02n0130_003:0853c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼迦葉佛時金鬘女者，以何因緣生已自然頂有金鬘？",
        "translation": "\"At the time of that Kāśyapa Buddha, what were the causes and conditions for the woman with the gold garland naturally appearing on top of her body after she was born?",
        "source": "T02n0130_003:0853c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復何緣得生王家受大富樂？」",
        "translation": "For what other reason should I be born into a king's family and receive great riches?\"",
        "source": "T02n0130_003:0853c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「諸苾芻！",
        "translation": "The Buddha said, \"Precious monks!",
        "source": "T02n0130_003:0853c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼金鬘女過去世時，於波羅奈國為一貧女，周行求乞諸莊嚴具及以塗香。",
        "translation": "When she passed away, that gold garland woman was a poor woman in the country of Polonai who traveled around begging for adornments and scented incense.",
        "source": "T02n0130_003:0853c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一緣覺塔中，莊嚴塗飾起清淨心，發是願言：『願我以此善根，世世所生頂有金鬘，生大富家富貴自在，施作佛事。』",
        "translation": "At a stūpa for pratyekabuddhas, she was adorned and decorated with a pure heart and made this vow, saying, 'May this good root give rise to a golden garland on top of my head that will be born in the world, and I'll be born in a wealthy family that's rich and comfortable and will give alms for the Buddha's service.'",
        "source": "T02n0130_003:0854a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻！",
        "translation": "Bhikṣus!",
        "source": "T02n0130_003:0854a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時貧女者，即彼迦葉佛法中金鬘女是，以其善根及大願力，於五百生中在在處處生已，自然頂有金鬘。",
        "translation": "That poor woman, that's the gold garland woman from Kāśyapa's teaching, who, because of her good roots and the power of her great vow, was born everywhere in 500 lifetimes and naturally wore a gold garland on her head.",
        "source": "T02n0130_003:0854a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻！",
        "translation": "Bhikṣus!",
        "source": "T02n0130_003:0854a07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故今時此善無毒女，以其過去善根及大願力，今得生此給孤獨長者大富之家，而善開導施作佛事。",
        "translation": "Because of her past good roots and her great vow, this good, nonpoisonous woman was now born into this orphaned elder's wealthy family and was well-directed to give alms to the Buddha's work.",
        "source": "T02n0130_003:0854a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故當知，決定善業決定善報，於一切時一切處無能散失。",
        "translation": "Therefore, you should know that the determined good actions that bring about a determined good result can't be lost in all places at all times.",
        "source": "T02n0130_003:0854a09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼彼業因彼彼果報，如外地界彼堅實性，而非水火風界流潤等性，如是蘊處界等彼彼差別，所有一切眾生作善惡業，亦復如是。",
        "translation": "Whether it's the cause or the result of that action, just as it's the solid nature of the external world or the fluid nature of the water, fire, and wind worlds, such are the differences between the aggregates, fields, and so forth, and so are all sentient beings who do good and bad actions.",
        "source": "T02n0130_003:0854a11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼彼業因差別有異，彼彼果報所得非一，假使經於百劫之中，而因果法決定無失。」",
        "translation": "There are differences in the causes of those actions, and the results are not uniform, even if they pass through a hundred eons, but the law of cause and effect is certainly not lost.\"",
        "source": "T02n0130_003:0854a14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「諸苾芻！",
        "translation": "The Buddha said, \"Precepts, monks!",
        "source": "T02n0130_003:0854a16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故善男子善女人，應當於佛法僧深生淨信尊重恭敬，於此經典諦信受持，宣通流布如理修行。",
        "translation": "Therefore, good sons and good women should deeply cultivate pure faith in the Buddha, Dharma, and Saṃgha, respect and venerate them, truly believe and uphold these sūtras, and proclaim and disseminate them in ways that accord with reality.",
        "source": "T02n0130_003:0854a16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等諸苾芻！",
        "translation": "You monks!",
        "source": "T02n0130_003:0854a18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦如是修學。」",
        "translation": "Train in this way, too.\"",
        "source": "T02n0130_003:0854a18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊為諸苾芻說善無毒女往昔因緣已，如先已為善無毒女及謨尸羅長者眷屬，乃至福增城中婆羅門長者居士等，并餘一切天人大眾，隨其所應宣說正法各獲利益。",
        "translation": "After the Bhagavān had explained the causes and conditions of Śubhavyūha's past for the monks, he taught the right teaching to Śubhavyūha, Elder Maśīla's retinue, the elders and householders of Brāhmaṇa in the city of Fuzeng, and all the other gods and humans as they saw fit.",
        "source": "T02n0130_003:0854a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時世尊及苾芻眾，即於會中隱身不現，至舍衛國祇樹給孤獨園還復現身。",
        "translation": "The Bhagavān and the crowd of monks then withdrew from the assembly and reappeared at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0130_003:0854a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此經已，善無毒女等長者諸眷屬，諸苾芻等，一切大眾聞佛所說，皆大歡喜，信受奉行。",
        "translation": "After the Buddha taught this sūtra, the elders, the good, non-poisonous women, their retinues, the monks, and the other people who heard what he taught rejoiced greatly, believed, and approved.",
        "source": "T02n0130_003:0854a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說給孤長者女得度因緣經卷下",
        "translation": "Second Foshuo gongdeok gyeongdeok gyeongdeok soenggwan soenggwan soenggwan",
        "source": "T02n0130_003:0854a28_0",
        "is_bad_quality": false
    }
]