[
    {
        "source_sentence": "雜阿含經卷第四",
        "translation": "Zaohan jing, vol. 4",
        "source": "T02n0099_004:0022b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宋天竺三藏求那跋陀羅譯",
        "translation": "Song Dynasty Tripiṭaka Translated by *Guṇabhadra",
        "source": "T02n0099_004:0022b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（八八）如是我聞：一時，佛住舍衛國祇樹給孤獨園。",
        "translation": "(888) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0099_004:0022b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有年少婆羅門名欝多羅，來詣佛所，與世尊面相問訊慰勞已，退坐一面，白佛言：「世尊！",
        "translation": "A young Brāhmaṇa named Uttarakuru came to the Buddha, exchanged greetings and commiserations with the Bhagavān, withdrew to sit at one side, and said to the Buddha, \"Bhagavān!",
        "source": "T02n0099_004:0022b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我常如法行乞，持用供養父母，令得樂離苦。",
        "translation": "I always beg according to the Dharma and maintain offerings to my parents, so that I can happily escape suffering.",
        "source": "T02n0099_004:0022b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T02n0099_004:0022b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我作如是，為多福不？」",
        "translation": "Do I do this for much merit?\"",
        "source": "T02n0099_004:0022b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告欝多羅：「實有多福。",
        "translation": "The Buddha told Uttara, \"There really is much merit.",
        "source": "T02n0099_004:0022b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T02n0099_004:0022b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有如法乞求，供養父母，令其安樂，除苦惱者，實有大福。」",
        "translation": "If someone thus seeks to support their parents and make offerings to them, making them happy and removing their suffering and distress, they'll really be greatly blessed.\"",
        "source": "T02n0099_004:0022b25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊即說偈言：「如汝於父母，　　恭敬修供養，　現世名稱流，　　命終生天上。」",
        "translation": "It was then that the Bhagavān spoke this verse, \"Just as you have respected and cultivated offerings to your parents, you'll be called a streamer in this world and be born up in heaven at the end of your life.\"",
        "source": "T02n0099_004:0022b27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此經已，年少欝多羅歡喜隨喜，作禮而去。",
        "translation": "After the Buddha spoke this sūtra, the young Uttara rejoiced and followed him, paid homage, and departed.",
        "source": "T02n0099_004:0022c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（八九）如是我聞：一時，佛住舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0099_004:0022c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有年少婆羅門名優波迦，來詣佛所，與世尊面相問訊慰勞已，退坐一面，白佛言：「瞿曇！",
        "translation": "A young Brāhmaṇa named Upāya came to the Buddha, exchanged greetings and commiserations with the Bhagavān, withdrew to sit at one side, and said to the Buddha, \"Gautama!",
        "source": "T02n0099_004:0022c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸婆羅門常稱歎邪盛大會，沙門瞿曇亦復稱歎邪盛大會不？」",
        "translation": "Do the ascetic Gautama also praise the great wrongful assembly that brāhmaṇas always praise?\"",
        "source": "T02n0099_004:0022c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告優波迦：「我不一向稱歎，或有邪盛大會可稱歎，或有邪盛大會不可稱歎。」",
        "translation": "The Buddha told Upāya, \"I don't always praise [them]; sometimes there's an evil grand assembly that's praiseworthy, and sometimes there's an evil grand assembly that's not praiseworthy.\"",
        "source": "T02n0099_004:0022c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波迦白佛：「何等邪盛大會可稱歎？",
        "translation": "(Upāya said to the Buddha, \"What kind of grand assembly of evil is praiseworthy?",
        "source": "T02n0099_004:0022c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等邪盛大會不可稱歎？」",
        "translation": "What kind of great wrongdoing assembly is unsurpassed?\"",
        "source": "T02n0099_004:0022c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告優波迦：「若邪盛大會繫群少特牛、水特、水牸，及諸羊犢、小小眾生悉皆傷殺，逼迫苦切，僕使作人，鞭笞恐怛，悲泣號呼，不喜不樂，眾苦作役。",
        "translation": "The Buddha told Upāya, \"Suppose there's an improper grand assembly that binds together a herd of lesser special cattle, water moccasins, water mules, sheep and calves, and tiny sentient beings, and they are all killed, persecuted, made to suffer, made to serve as men, whipped, frightened, lamented, and cried out for joy and happiness, and made to work with much suffering.",
        "source": "T02n0099_004:0022c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等邪盛大會，我不稱歎，以造大難故。",
        "translation": "I don't praise such a great, wrongful assembly because it causes great hardship.",
        "source": "T02n0099_004:0022c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復大會不繫縛群牛，乃至不令眾生辛苦作役者。",
        "translation": "Suppose there's another great assembly that doesn't bind herd of cattle or make sentient beings work hard.",
        "source": "T02n0099_004:0022c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是邪盛大會，我所稱歎，以不造大難故。",
        "translation": "Such a great, wrong kind of meeting is something I praise because it doesn't cause great hardship.",
        "source": "T02n0099_004:0022c16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊即說偈言：「馬祀等大會，　　造諸大難事，　如是等邪盛，　　大仙不稱歎。",
        "translation": "The Bhagavān then spoke in verse, \"A great assembly like that for horse sacrifice creates great difficulties, and such a great sage doesn't praise it for being so wrong and prosperous.",
        "source": "T02n0099_004:0022c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　繫縛諸眾生，　　殺害微細蟲，　是非為正會，　　大仙不隨順。",
        "translation": "Binding sentient beings and killing tiny worms is not the right assembly, and the great sage doesn't follow it.",
        "source": "T02n0099_004:0022c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若不害眾生，　　造作眾難者，　是等名正會，　　大仙隨稱歎。",
        "translation": "If someone doesn't harm sentient beings and causes many difficulties, this is called a right assembly, and the great sage follows and praises it.",
        "source": "T02n0099_004:0022c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　惠施修供養，　　為應法邪盛，　施者清淨心，　　梵行良福田。",
        "translation": "They give generously, cultivate offerings, respond to the mistaken prosperity of the Dharma, and purify the mind of the donor, which is a good and blessed field for the religious practice.",
        "source": "T02n0099_004:0022c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是大會者，　　是則羅漢會，　是會得大果，　　諸天皆歡喜。",
        "translation": "Such a great assembly is a gathering of arhats, an assembly that achieves great rewards and rejoices the gods.",
        "source": "T02n0099_004:0022c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自行恭敬請，　　自手而施與，　彼我悉清淨，　　是施得大果。",
        "translation": "He respectfully invites them himself, giving with his own hands, and they and I are all purified; this gift obtains great fruit.",
        "source": "T02n0099_004:0022c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　慧者如是施，　　信心應解脫，　無罪樂世間，　　智者往生彼。」",
        "translation": "Thus does the wise man give, his faith is liberated, he is blameless and enjoys the world, and the wise man is born there.\"",
        "source": "T02n0099_004:0023a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此經已，優波迦婆羅門聞佛所說，歡喜隨喜，作禮而去。",
        "translation": "After the Buddha spoke this sūtra, the Upagupta Brahman who heard what he taught rejoiced and followed him, paid homage, and departed.",
        "source": "T02n0099_004:0023a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九〇）如是我聞：一時，佛住舍衛國祇樹給孤獨園……廣說如上。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī ... and explained it in detail as above.",
        "source": "T02n0099_004:0023a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "差別者，謂隨說異偈言：「無為無諸難，　　邪盛時清淨，　如法隨順行，　　攝護諸梵行。",
        "translation": "The difference is that he spoke a different verse that said, \"Inexistent and effortless, pure when wickedness flourishes, compliant with the teachings, and disciplined by the religious practices.",
        "source": "T02n0099_004:0023a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　馨香歸世界，　　超過諸凡鄙，　佛於邪盛善，　　稱歎此邪盛。",
        "translation": "The fragrant odor that returns to the world surpasses ordinary people, and the Buddha praises the goodness of this mistaken prosperity.",
        "source": "T02n0099_004:0023a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　惠施修供養，　　邪盛隨所應，　淨信平等施，　　梵行良福田。",
        "translation": "He makes generous offerings, cultivates offerings as he sees fit, and gives equally to pure faith, which is a good field of merit for the religious practice.",
        "source": "T02n0099_004:0023a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼作如是施，　　是施羅漢田，　如是廣大施，　　諸天所稱歎。",
        "translation": "Such generosity is the field of the arhat who gives, and such vast generosity is praised by the gods.",
        "source": "T02n0099_004:0023a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自行恭敬請，　　自手而供養，　等攝自他故，　　邪盛得大果。",
        "translation": "He respectfully invites them on his own, making offerings with his own hands, and because he equally includes himself and others, he attains great fruit from the flourishing of evil.",
        "source": "T02n0099_004:0023a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　慧者如是施，　　淨信心解脫，　於無罪世界，　　智者往生彼。」",
        "translation": "Thus giving, the wise man's faith is purified and liberated, and in the sinless world, the wise man is reborn there.\"",
        "source": "T02n0099_004:0023a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此經已，優波迦婆羅門聞佛所說，歡喜作禮而去。",
        "translation": "After the Buddha spoke this sūtra, the Upāyaka Brāhmaṇa who heard what he taught rejoiced, paid homage, and departed.",
        "source": "T02n0099_004:0023a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九一）如是我聞：一時，佛住舍衛國祇樹給孤獨園。",
        "translation": "(91) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0099_004:0023a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有年少婆羅門名欝闍迦，來詣佛所，稽首佛足，退坐一面，白佛言：「世尊！",
        "translation": "A young Brāhmaṇa named Ujjayinī came to the Buddha, bowed his head at his feet, withdrew to sit at one side, and said to the Buddha, \"Bhagavān!",
        "source": "T02n0099_004:0023a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "俗人在家當行幾法，得現法安及現法樂？」",
        "translation": "How many things will laypeople at home practice to attain the present peace and happiness of the present life?\"",
        "source": "T02n0099_004:0023a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「有四法，俗人在家得現法安、現法樂。",
        "translation": "The Buddha told the Brāhmaṇa, \"There are four things that give laypeople at home peace and happiness in the present life.",
        "source": "T02n0099_004:0023a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T02n0099_004:0023a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂方便具足、守護具足、善知識具足、正命具足。",
        "translation": "It's the perfection of skillful means, the perfection of guarding, the perfection of good friends, and the perfection of right livelihood.",
        "source": "T02n0099_004:0023a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為方便具足？",
        "translation": "\"What's the sufficiency of skillful means?",
        "source": "T02n0099_004:0023a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂善男子種種工巧業處以自營生，謂種田、商賈，或以王事，或以書疏算畫。",
        "translation": "Good sons are employed in various occupations for their own livelihood, which are farming, merchandising, royal service, or writing, spelling, and drawing.",
        "source": "T02n0099_004:0023a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼彼工巧業處精勤修行，是名方便具足。",
        "translation": "To diligently cultivate those places of work and skillful activity is called having the skillful means to do so.",
        "source": "T02n0099_004:0023b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為守護具足？",
        "translation": "\"What's replete in guarding?",
        "source": "T02n0099_004:0023b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂善男子所有錢穀，方便所得，自手執作，如法而得，能極守護，不令王、賊、水、火劫奪漂沒令失，不善守護者亡失，不愛念者輒取，及諸災患所壞，是名善男子善守護。",
        "translation": "This is called a good man who skillfully obtains money and grain, wields it with his own hands, obtains it according to the teaching, and guards it well so that it won't be lost to kings, thieves, water, or fire, lost to plunder, lost to those who don't guard it well, taken lightly by those who don't care for it, or damaged by disasters.",
        "source": "T02n0099_004:0023b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為善知識具足？",
        "translation": "\"What's the fulfillment of a good teacher?",
        "source": "T02n0099_004:0023b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有善男子不落度、不放逸、不虛妄、不凶險，如是知識能善安慰，未生憂苦能令不生，已生憂苦能令開覺，未生喜樂能令速生，已生喜樂護令不失，是名善男子善知識具足。",
        "translation": "If there are good sons who aren't despondent, aren't careless, aren't false, and aren't dangerous, and who are thus well able to comfort others, cause sorrow and pain that have yet to arise to stop arising, cause sorrow and pain that have already arisen to awaken, cause joy and happiness that have yet to arise to arise quickly, and guard joy and happiness that have already arisen from being lost, this is called a good man who has a good knowledge of the fulfillment of right livelihood.",
        "source": "T02n0099_004:0023b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何為正命具足？",
        "translation": "\"What is the fulfillment of right livelihood?",
        "source": "T02n0099_004:0023b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂善男子所有錢財出內稱量，周圓掌護，不令多入少出也、多出少入也。",
        "translation": "\"Good sons weigh all their money and property internally and guard it circumferentially, so that more comes in and less goes out, and more comes out and less goes in.",
        "source": "T02n0099_004:0023b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如執秤者，少則增之，多則減之，知平而捨。",
        "translation": "Like a person who holds a scale, he increases it when there's less, decreases it when there's more, and knows how to balance it.",
        "source": "T02n0099_004:0023b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，善男子稱量財物，等入等出，莫令入多出少、出多入少，若善男子無有錢財而廣散用，以此生活，人皆名為優曇鉢果，無有種子，愚癡貪欲，不顧其後。",
        "translation": "Thus, good sons weigh their goods, equally inflowing and equally exiting them, and don't allow more to come in and less to come out, or more to come in and less to come out. If good sons have no money or property but spread it around, this way of living is called the fruit of the udumbara, which has no seeds and is foolishly coveted without regard for its aftermath.",
        "source": "T02n0099_004:0023b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有善男子財物豐多，不能食用，傍人皆言是愚癡人如餓死狗。",
        "translation": "If a good man has so much wealth and possessions that he can't eat them, people say that he's a foolish man like a dog starving to death.",
        "source": "T02n0099_004:0023b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，善男子所有錢財能自稱量，等入等出，是名正命具足。",
        "translation": "Therefore, a good man who can measure his own money and possessions and equally enter and leave them is called a man with a full and proper life.",
        "source": "T02n0099_004:0023b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，婆羅門！",
        "translation": "Thus, Brāhmaṇa!",
        "source": "T02n0099_004:0023b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四法成就，現法安、現法樂。」",
        "translation": "They will achieve the four dharmas, present peace, and present happiness.\"",
        "source": "T02n0099_004:0023b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門白佛言：「世尊！",
        "translation": "The Brāhmaṇa said to the Buddha, \"Bhagavān!",
        "source": "T02n0099_004:0023b22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在家之人有幾法，能令後世安、後世樂？」",
        "translation": "How many things does a lay person have that will make the afterlife secure and the afterlife happy?\"",
        "source": "T02n0099_004:0023b23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「在家之人有四法，能令後世安、後世樂。",
        "translation": "The Buddha told the Brāhmaṇa, \"There are four things that a lay person can do to make the afterlife peaceful and the afterlife enjoyable.",
        "source": "T02n0099_004:0023b24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T02n0099_004:0023b25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂信具足、戒具足、施具足、慧具足。",
        "translation": "It means perfect faith, perfect precepts, perfect generosity, and perfect wisdom.",
        "source": "T02n0099_004:0023b25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為信具足？",
        "translation": "\"What's perfected faith?",
        "source": "T02n0099_004:0023b26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂善男子於如來所，得信敬心，建立信本，非諸天、魔、梵及餘世人同法所壞，是名善男子信具足。",
        "translation": "A good man who attains faith and respect for the Tathāgata and establishes the basis of that faith, which is not corrupted by the teachings of gods, Māra, Brahmā, or other humans, is called a good man with perfect faith.",
        "source": "T02n0099_004:0023b26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等戒具足？",
        "translation": "\"What are the perfections of morality?",
        "source": "T02n0099_004:0023b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂善男子不殺生、不偷盜、不邪婬、不妄語、不飲酒，是名戒具足。",
        "translation": "A good man who doesn't kill, steal, commit sexual misconduct, engage in false speech, or drink alcohol is said to have perfect precepts.",
        "source": "T02n0099_004:0023b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何施具足？",
        "translation": "\"What's the fulfillment of generosity?",
        "source": "T02n0099_004:0023c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂善男子離慳垢心，在於居家，行解脫施，常自手與，樂修行捨，等心行施，是名善男子施具足。",
        "translation": "A good man who is free of the mind of stinginess, goes to his home, practices liberating generosity, always gives with his own hands, enjoys cultivating equanimity, and practices generosity with equal mind is called a good man whose generosity is complete.",
        "source": "T02n0099_004:0023c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何為慧具足？",
        "translation": "\"What's the fulfillment of wisdom?",
        "source": "T02n0099_004:0023c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂善男子苦聖諦如實知，習、滅、道聖諦如實知，是名善男子慧具足。",
        "translation": "A good man who accurately knows the noble truth of suffering and accurately knows the noble truths of accumulation, cessation, and the path is called a good man with complete wisdom.",
        "source": "T02n0099_004:0023c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子在家行此四法者，能得後世安、後世樂。」",
        "translation": "If good sons at home practice these four things, they can attain security in the latter life and happiness in the latter life.\"",
        "source": "T02n0099_004:0023c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊復說偈言：「方便建諸業，　　積集能守護，　知識善男子，　　正命以自活。",
        "translation": "It was then that the Bhagavān spoke another verse, \"Skillfully constructing all actions and accumulating them to guard them, a good man who knows them has the right livelihood to live on his own.",
        "source": "T02n0099_004:0023c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　淨信戒具足，　　惠施離慳垢，　淨除於速道，　　得後世安樂。",
        "translation": "With perfect faith and discipline, they bestow generosity and free themselves from the stain of parsimony, purify themselves and rid themselves of the rapid path, and attain security in the afterlife.",
        "source": "T02n0099_004:0023c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若處於居家，　　成就於八法，　審諦尊所說，　　等正覺所知。",
        "translation": "If he were at home, he'd achieve the eight dharmas, which are taught by the Bhagavān and known by the perfectly enlightened.",
        "source": "T02n0099_004:0023c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　現法得安隱，　　現法喜樂住，　後世喜樂住。」",
        "translation": "They attain peace in the present life, abide happily in the present life, and abide happily in the hereafter.\"",
        "source": "T02n0099_004:0023c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此經已，欝闍迦聞佛所說，歡喜隨喜，作禮而去。",
        "translation": "After the Buddha spoke this sūtra, Ujjayanta heard what he taught, rejoiced and followed him, paid homage, and departed.",
        "source": "T02n0099_004:0023c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九二）如是我聞：一時，佛在拘薩羅人間遊行，至舍衛國祇樹給孤獨園。",
        "translation": "(92) Thus I have heard: One time, the Buddha was traveling among the people of Kośala and arrived at Anāthapiṇḍada Park in Śrāvastī.",
        "source": "T02n0099_004:0023c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，舍衛國有憍慢婆羅門止住，父母種姓俱淨，無瑕點能說者，七世相承悉皆清淨；為婆羅門師，言論通達，諸論記典悉了萬名，解法優劣，分明諸，句句記說，容貌端正。",
        "translation": "At the time, there was a conceited brāhmaṇa living in Śrāvastī whose parents and family were both pure, who had no blemishes and could speak, and whose seven generations of continuity were all pure; he was a brāhmaṇa teacher who spoke well, comprehended all the treatises and scriptures, understood the superiority and inferiority of things, clearly distinguished them, recorded each one, and had a dignified appearance.",
        "source": "T02n0099_004:0023c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或生志高、族姓志高、容色志高、聰明志高、財富志高，不敬父母、諸尊、師長。",
        "translation": "They may have high aspirations for birth, clan, appearance, intelligence, or wealth, but they don't honor their parents, venerables, or teachers.",
        "source": "T02n0099_004:0023c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞沙門瞿曇在拘薩羅國人間遊行，至舍衛國祇樹給孤獨園。",
        "translation": "I heard that the ascetic Gautama had marched among the people of Kośala to Anāthapiṇḍada's Park in Jeta's Grove in Śrāvastī.",
        "source": "T02n0099_004:0023c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞已，作是念：「我當往彼沙門瞿曇所，若有所說，我當共論；無所說者，默然而還。」",
        "translation": "After hearing that, he thought, \"I'll go to that ascetic Gautama and discuss with him if there's anything he wants to say; if there's nothing to say, I'll return in silence.\"",
        "source": "T02n0099_004:0023c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，憍慢婆羅門乘白馬車，諸年少婆羅門前後導從，持金柄傘蓋，手執金瓶，往見世尊。",
        "translation": "The arrogant brāhmaṇas then rode in a white horse-drawn chariot, were led by young brāhmaṇas carrying gold canopies and golden vases in their hands, and went to see the Bhagavān.",
        "source": "T02n0099_004:0023c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至於園門，下車步進。",
        "translation": "When they arrived at the garden gate, they alighted and walked in.",
        "source": "T02n0099_004:0024a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊與諸大眾圍遶說法，不時顧念憍慢婆羅門。",
        "translation": "At the time, the Bhagavān and the crowd gathered around him to preach the Dharma, constantly mindful of the arrogant brāhmaṇas.",
        "source": "T02n0099_004:0024a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，憍慢婆羅門作是念：「沙門瞿曇不顧念我，且當還去。」",
        "translation": "The arrogant Brāhmaṇa then thought, \"The ascetic Gautama doesn't think about me, so he should go back.\"",
        "source": "T02n0099_004:0024a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊知憍慢婆羅門心念，而說偈言：「憍慢既來此，　　不善更增慢，　向以義故來，　　應轉增其義。」",
        "translation": "Knowing what the mind of the arrogant Brāhmaṇa was thinking, the Bhagavān then spoke a verse, saying, \"Now that arrogance has come here, unwholesomeness has increased arrogance, and it was because of its meaning that it came here that it should further increase its meaning.\"",
        "source": "T02n0099_004:0024a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，憍慢婆羅門作是念：「沙門瞿曇已知我心。」",
        "translation": "The arrogant brāhmaṇa then thought, \"The ascetic Gautama has known my thoughts.\"",
        "source": "T02n0099_004:0024a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲修敬禮。",
        "translation": "He wanted to cultivate reverence.",
        "source": "T02n0099_004:0024a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告憍慢婆羅門：「止！",
        "translation": "It was then that the Bhagavān addressed the arrogant Brāhmaṇa, \"Stop!",
        "source": "T02n0099_004:0024a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止！",
        "translation": "Stop!",
        "source": "T02n0099_004:0024a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不須作禮，心淨已足。」",
        "translation": "There's no need to make obeisance; your mind is purified.\"",
        "source": "T02n0099_004:0024a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸大眾咸各高聲唱言：「奇哉！",
        "translation": "The crowd then each raised their voices and chanted, \"Amazing!",
        "source": "T02n0099_004:0024a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T02n0099_004:0024a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德大力。",
        "translation": "\"Great is the virtuous power!",
        "source": "T02n0099_004:0024a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此憍慢婆羅門恃生憍慢、族姓憍慢、容色憍慢、聰明憍慢、財富憍慢，不敬父母、諸尊、師長，今於沙門瞿曇所謙卑下下，欲接足禮。」",
        "translation": "Now, this arrogant brāhmaṇa, conceited of his birth, clan, appearance, intelligence, and wealth, doesn't respect his father and mother, venerables, or teachers, and now he wants to bow at his feet while humbling himself at the ascetic Gautama's place.\"",
        "source": "T02n0099_004:0024a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，憍慢婆羅門於大眾前唱令靜默，而說偈言：「云何不起慢？",
        "translation": "The arrogant brāhmaṇa then commanded silence before the crowd and spoke in verse, saying, \"Why doesn't arrogance arise?",
        "source": "T02n0099_004:0024a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何起恭敬？",
        "translation": "How do we give rise to veneration?",
        "source": "T02n0099_004:0024a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何善慰諭？",
        "translation": "What is a good consolation?",
        "source": "T02n0099_004:0024a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何善供養？」",
        "translation": "What are the good offerings?\"",
        "source": "T02n0099_004:0024a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說偈答言：「父母及長兄，　　和尚諸師長，　及諸尊重者，　　所不應生慢。",
        "translation": "The Bhagavān then spoke a verse in reply, \"Parents, elders, monks, teachers, and venerable people should not become arrogant.",
        "source": "T02n0099_004:0024a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應當善恭敬，　　謙下而問訊，　盡心而奉事，　　兼設諸供養。",
        "translation": "You must be well-respected, humbly greet, wholeheartedly serve, and make offerings.",
        "source": "T02n0099_004:0024a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　離貪恚癡心，　　漏盡阿羅漢，　正智善解脫，　　伏諸憍慢心。",
        "translation": "Freed from craving, ill-will, and delusion, he'll be an arhat whose contaminants have ended, well liberated by right knowledge, and able to subdue conceit.",
        "source": "T02n0099_004:0024a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於此賢聖等，　　合掌稽首禮。」",
        "translation": "Here, the good and noble ones bow with their palms together.\"",
        "source": "T02n0099_004:0024a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊為憍慢婆羅門種種說法，示、教、照、喜。",
        "translation": "At the time, the Bhagavān was teaching various things to arrogant Brahmins, showing, teaching, illuminating, and rejoicing in them.",
        "source": "T02n0099_004:0024a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛世尊次第說法，說布施、持戒、生天功德，愛欲味患煩惱，清淨、出要、遠離，諸清淨分……如是廣說，如白淨衣無諸黑惡，速受染色。",
        "translation": "As the Bhagavān explained them in order, he described the merits of generosity, observing precepts, being born in heaven, the tastes and desires of craving, the afflictions, purity, renunciation, and the factors of purity... As he thus explained in detail, he was like a pure white robe that has no black evils and is quickly dyed.",
        "source": "T02n0099_004:0024a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍慢婆羅門即於座上解四聖諦——苦、習、滅、道，得無間等。",
        "translation": "The arrogant Brāhmaṇa then went to his seat and explained the four noble truths - suffering, accumulation, cessation, and the path - and attained instantaneousness.",
        "source": "T02n0099_004:0024b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，憍慢婆羅門見法、得法、知法、入法，度諸疑惑，不由他度，於正法中得無所畏。",
        "translation": "The arrogant Brāhmaṇa then sees the teaching, attains the teaching, knows the teaching, enters the teaching, frees himself from uncertainty and doesn't let others save him, and attains fearlessness in the right teaching.",
        "source": "T02n0099_004:0024b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即從座起，整衣服，為佛作禮，合掌白佛：「我今可得於正法中出家、受具足不？」",
        "translation": "He got up from his seat, adjusted his robes, paid homage to the Buddha, put his palms together, and said to him, \"May I now leave home and be fully ordained in the right teaching?\"",
        "source": "T02n0099_004:0024b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告憍慢婆羅門：「汝今可得於正法中出家、受具足。」",
        "translation": "The Buddha told the arrogant Brāhmaṇa, \"Now you can leave home and be fully ordained in the right Dharma.\"",
        "source": "T02n0099_004:0024b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼即出家，獨正思惟：「所以善男子剃除鬚髮，著袈裟衣，正信非家，出家學道……。」",
        "translation": "He then renounces the world and thinks alone, \"That's why good sons shave off their hair, put on the reddish-brown robes, have correct faith that they're not home, and leave home to train on the path....",
        "source": "T02n0099_004:0024b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得阿羅漢，心善解脫。",
        "translation": "Attaining arhatship, their mind is well-liberated.",
        "source": "T02n0099_004:0024b11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九三）如是我聞：一時，佛在拘薩羅人間遊行，至舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was traveling among the people of Kośala and arrived at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0099_004:0024b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有長身婆羅門，作如是邪盛大會——以七百特牛行列繫柱，特、牸、水牛及諸羊犢、種種小蟲悉皆繫縛，辦諸飲食、廣行布施，種種外道從諸國國皆悉來集邪盛會所。",
        "translation": "At the time, there was a long-bodied brāhmaṇa who made this kind of great, wrongful assembly - tying up pillars with rows of 700 special oxen, tying up special, female, and buffalo calves, sheep and various small insects, preparing meals, and making extensive alms, and various non-Buddhists from various countries all came to gather at the great, wrongful assembly.",
        "source": "T02n0099_004:0024b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，長身婆羅門聞沙門瞿曇從拘薩羅人間遊行，至舍衛國祇樹給孤獨園。",
        "translation": "When the long-bodied Brāhmaṇa heard that the ascetic Gautama had marched from Kośala among the people to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī, he thought, \"Now, I'll prepare a meal for you.",
        "source": "T02n0099_004:0024b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念：「我今辦邪盛大會，所以七百特牛行列繫柱，乃至小小諸虫皆悉繫縛。",
        "translation": "He had this thought, \"Now, I'm hosting a great wrongful gathering, so 700 special oxen are roped up in rows and tied to pillars, and even the smallest insects are all tied up.",
        "source": "T02n0099_004:0024b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為邪盛大會故，種種異道從諸國國來至會所。",
        "translation": "For that reason, various different paths have come from various countries to the assembly.",
        "source": "T02n0099_004:0024b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今當往沙門瞿曇所問邪盛法，莫令我作邪盛大會，分數中有所短少。」",
        "translation": "Now, I will go to the ascetic Gautama and ask him about the teaching of wrong prosperity, so that I won't be shortchanged in terms of the number of parts of the wrong grand assembly that I've created.\"",
        "source": "T02n0099_004:0024b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，乘白馬車，諸年少婆羅門前後導從，持金柄傘蓋，執金澡瓶，出舍衛城，詣世尊所，恭敬承事。",
        "translation": "After he had this thought, he rode out of Śrāvastī in a white horse-drawn chariot, was guided by young priests, carried a gold canopy, and carried a gold bath vase, and left the city to visit the Bhagavān and venerate and serve him.",
        "source": "T02n0099_004:0024b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至精舍門，下車步進，至於佛前，面相問訊慰勞已，退坐一面，白佛言：「瞿曇！",
        "translation": "When they arrived at the entrance of the monastery, they alighted and walked in front of the Buddha, exchanged greetings and commiserations with him, withdrew to sit to one side, and said to him, \"Gautama!",
        "source": "T02n0099_004:0024b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今欲作邪盛大會，以七百特牛行列繫柱，乃至小小諸蟲皆悉繫縛。",
        "translation": "Now, I want to create a great wrongful assembly, tying up a column with a line of 700 special oxen, and binding even the smallest of bugs.",
        "source": "T02n0099_004:0024b29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為邪盛大會故，種種異道從諸國國皆悉來至邪盛會所。",
        "translation": "For the sake of that great wrongful assembly, various other paths from different countries will come to the place of the great wrongful assembly.",
        "source": "T02n0099_004:0024c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又聞瞿曇從拘薩羅人間遊行，至舍衛國祇樹給孤獨園。",
        "translation": "I also heard that the Gautama had marched from among the people of Kośala to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0099_004:0024c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今故來請問瞿曇邪盛大會法諸物分數，莫令我所作邪盛大會諸分數之中有所短少。」",
        "translation": "Now, I've come to ask Gautama about the number of things in his great wrongful assembly, so that I won't be shortchanged in the number of things in his great wrongful assembly.\"",
        "source": "T02n0099_004:0024c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「或有一邪盛大會主行施作福而生於罪，為三刀劍之所刻削，得不善果報。",
        "translation": "The Buddha told the Brāhmaṇa, \"Perhaps there's an owner of an evil grand assembly who gives generosity and creates merits that give rise to sins, which are then cut by three swords and bring unwholesome results.",
        "source": "T02n0099_004:0024c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等三？",
        "translation": "What are the three?",
        "source": "T02n0099_004:0024c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂身刀劍、口刀劍、意刀劍。",
        "translation": "They are the sword of the body, the sword of the mouth, and the sword of the mind.",
        "source": "T02n0099_004:0024c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為意刀劍生諸苦報？",
        "translation": "\"What are the rewards of suffering that result from the sword of thought?",
        "source": "T02n0099_004:0024c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如一會主造作大會，作是思惟：『我作邪盛大會，當殺爾所少壯特牛，爾所水特、水牸，爾所羊犢及種種諸蟲。』",
        "translation": "Suppose a master of an assembly creates a great assembly and thinks, 'I'll create a great, wrongful assembly, and I'll kill all the young and strong special cattle, all the water specials and water mare, all the sheep and calves, and all the bugs.'",
        "source": "T02n0099_004:0024c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名意刀劍生諸苦報。",
        "translation": "This is called the painful consequences of intending to kill with a sword.",
        "source": "T02n0099_004:0024c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是施主雖念作種種布施、種種供養，實生於罪！",
        "translation": "Thus, even though a donor is mindful of making various gifts and making various offerings, it really produces sins!",
        "source": "T02n0099_004:0024c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何為口刀劍生諸苦報？",
        "translation": "\"What are the rewards of suffering produced by the sword of the mouth?",
        "source": "T02n0099_004:0024c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一會主造作大會，作如是教：『我今作邪盛大會，汝等當殺爾所少壯特牛，乃至殺害爾所微細蟲。』",
        "translation": "There was a certain assembly leader who created a great assembly and taught thus, 'Now, when I create this great, wrongful assembly, you will kill the small and strongest of those special cattle, and even kill the smallest of those worms.'",
        "source": "T02n0099_004:0024c15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名口刀劍生諸苦報，大會主雖作是布施、供養，實生於罪！",
        "translation": "This is called the painful retribution of a sword through the mouth, and even though the assembly leader makes these alms and offerings, they really produce sins!",
        "source": "T02n0099_004:0024c18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何為身刀劍生諸苦報？",
        "translation": "\"What are the rewards of suffering produced by the body's sword?",
        "source": "T02n0099_004:0024c19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂有一大會主造作大會，自手傷殺爾所特牛，乃至殺害種種細蟲，是名身刀劍生諸苦報。",
        "translation": "Suppose there's a great assembly leader who creates a great meeting and wounds and kills that particular cow with his own hand, or even kills various tiny insects, which is called the painful consequences of a body with a sword.",
        "source": "T02n0099_004:0024c20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼大會主雖作是念種種布施、種種供養，實生於罪！",
        "translation": "Even though that great assembly leader thinks this way about making various alms and making various offerings, it really produces sins!",
        "source": "T02n0099_004:0024c22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「然婆羅門當勤供養三火，隨時恭敬，禮拜奉事，施其安樂。",
        "translation": "\"Still, a Brāhmaṇa should make diligent offerings to the three fires, venerate them at all times, worship and serve them, and give them comfort.",
        "source": "T02n0099_004:0024c23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are the three?",
        "source": "T02n0099_004:0024c25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者根本，二者居家，三者福田。",
        "translation": "One is the root, two are the home, and three are fields of merit.",
        "source": "T02n0099_004:0024c25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何者為根本火？",
        "translation": "\"What's the fundamental fire?",
        "source": "T02n0099_004:0024c26_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨時恭敬，奉事供養，施其安樂？",
        "translation": "Do you always revere, serve, and make offerings to those who are comfortable with you?",
        "source": "T02n0099_004:0024c26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂善男子方便得財，手足勤苦，如法所得，供養父母，令得安樂，是名根本火。",
        "translation": "A good man who skillfully obtains wealth, works hard with his hands and feet, obtains it according to the teaching, and makes offerings to his parents to bring them well-being is called a fundamental fire.",
        "source": "T02n0099_004:0024c27_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故名為根本？",
        "translation": "Why is it called the root?",
        "source": "T02n0099_004:0024c29_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子從彼而生，所謂父母，故名根本。",
        "translation": "If good sons are born from that, they're called parents, which is why they're called the root.",
        "source": "T02n0099_004:0024c29_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子以崇本故，隨時恭敬，奉事供養，施以安樂。",
        "translation": "Because they revere the source, good sons should always respect, serve, and make offerings to them, and give them comfort.",
        "source": "T02n0099_004:0025a01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等為居家火？",
        "translation": "\"What's a household fire?",
        "source": "T02n0099_004:0025a02_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子隨時育養，施以安樂？",
        "translation": "Do good sons nurture each other at all times and give comfort?",
        "source": "T02n0099_004:0025a03_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂善男子方便得財，手足勤苦，如法所得，供給妻子、宗親、眷屬、僕使、傭客，隨時給與，恭敬施安，是名家火。",
        "translation": "A good man who skillfully obtains possessions, works hard with his hands and feet, and acquires them according to the teaching, making offerings to his wife, clan members, retinue, servants, and visitors, giving them at any time, and respectfully bestowing peace is called a householder's fire.",
        "source": "T02n0099_004:0025a03_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故名家？",
        "translation": "Why is it called a family?",
        "source": "T02n0099_004:0025a06_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其善男子處於居家，樂則同樂，苦則同苦，在所為作皆相順從，故名為家。",
        "translation": "When good sons live at home, they are equally happy when they are happy and equally miserable when they are miserable, and they conform to whatever they do, which is why they're called home.",
        "source": "T02n0099_004:0025a06_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故善男子隨時供給，施與安樂。",
        "translation": "Good sons therefore make offerings at all times, giving comfort and happiness.",
        "source": "T02n0099_004:0025a08_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何等名田火？",
        "translation": "\"What's called a field fire?",
        "source": "T02n0099_004:0025a09_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子隨時恭敬，尊重供養，施其安樂？",
        "translation": "Good sons, are you ready to revere, honor, and support them, giving them comfort?",
        "source": "T02n0099_004:0025a09_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂善男子方便得財，手足勤勞，如法所得，奉事供養諸沙門、婆羅門，善能調伏貪、恚、癡者，如是等沙門、婆羅門，建立福田，崇向增進，樂分樂報，未來生天，是名田火。",
        "translation": "It means good sons who skillfully obtain wealth, work hard with their hands and feet, obtain it according to the teaching, serve and support ascetics and priests, and are good at controlling greed, anger, and delusion, such ascetics and priests build up a field of merit, work conscientiously toward advancement, enjoy the fruits of pleasure, and are born in the heavens in the future, which is called a field of fire.",
        "source": "T02n0099_004:0025a10_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故名田？",
        "translation": "What is it called, a field?",
        "source": "T02n0099_004:0025a14_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為世福田，謂為應供，是故名田。",
        "translation": "It's a field of worldly merit that's worthy of offerings, which is why it's called a field.",
        "source": "T02n0099_004:0025a14_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子隨時恭敬，奉事供養，施其安樂。」",
        "translation": "These good sons are ready to respect, serve, and make offerings to give them comfort.\"",
        "source": "T02n0099_004:0025a15_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊復說偈言：「根本及居家，　　應供福田火，　是火增供養，　　充足安隱樂。",
        "translation": "It was then that the Bhagavān spoke another verse, saying, \"At home and at home, this is the fire of a field of merit that should be offered, which increases offerings and fills them with well-being and comfort.",
        "source": "T02n0099_004:0025a16_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無罪樂世間，　　慧者往生彼，　如法財復會，　　供養所應養。",
        "translation": "Without fault, they'll enjoy the world, and those of wisdom will be born there, making offerings that are worthy of support, just as the Dharma treasure will again meet.",
        "source": "T02n0099_004:0025a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　供養應養故，　　生天得名稱。",
        "translation": "Because they are worthy of support, they'll be born in a heaven and attain fame.",
        "source": "T02n0099_004:0025a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「然，婆羅門！",
        "translation": "\"So it is, Brāhmaṇa!",
        "source": "T02n0099_004:0025a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今善男子先所供養三火應斷令滅。",
        "translation": "\"Now, good sons, the three fires of previous offerings should be stopped and made to go out.",
        "source": "T02n0099_004:0025a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are the three?",
        "source": "T02n0099_004:0025a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂貪欲火、瞋恚火、愚癡火。",
        "translation": "They are the fires of desire, anger, and ignorance.",
        "source": "T02n0099_004:0025a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T02n0099_004:0025a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若貪火不斷不滅者，自害害他，自他俱害，現法得罪，後世得罪，現法後世得罪，緣彼而生心法憂苦，恚火、癡火亦復如是。",
        "translation": "If the fire of desire doesn't stop and doesn't go out, it harms oneself and harms others, harms both oneself and others, causes offenses in the present life, offenses in later lives, and offenses in later lives in the present life, and because of that, grief and suffering arises in the mind and things, and the fires of anger and delusion are likewise.",
        "source": "T02n0099_004:0025a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T02n0099_004:0025a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子事積薪火，隨時辛苦，隨時然，隨時滅火因緣受苦。」",
        "translation": "If good sons work to build a fire, they'll toil at any time, and at any time they'll experience suffering as a result of extinguishing the fire.\"",
        "source": "T02n0099_004:0025a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長身婆羅門默然而住。",
        "translation": "The long-bodied Brāhmaṇa then waited silently.",
        "source": "T02n0099_004:0025a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有婆羅門子名欝多羅，於會中坐。",
        "translation": "At the time, a son of the Brāhmaṇa named Uttarakuru was sitting in the assembly.",
        "source": "T02n0099_004:0025b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長身婆羅門須臾默然，思惟已，告欝多羅：「汝能往至邪盛會所，放彼繫柱特牛及諸眾生受繫縛者，悉皆放不？",
        "translation": "After a moment of silence and reflection, the long-bodied Brāhmaṇa addressed Uttara, \"Could you go to that meeting place where evil flourishes and release all of those bollards and cattle and all of the other sentient beings who are fettered?",
        "source": "T02n0099_004:0025b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而告之言：『長身婆羅門語汝：「隨意自在，山澤曠野，食不斷草，飲淨流水，四方風中受諸快樂。」』」",
        "translation": "He told them, 'The long-bodied Brāhmaṇa says, 'Do as you like, in the hills and fields, eating unfailing grass, drinking pure running water, and enjoying the pleasures of the four winds.'\"",
        "source": "T02n0099_004:0025b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欝多羅白言：「隨大師教！」",
        "translation": "Uttara said, \"Follow the great teacher's teaching!\"",
        "source": "T02n0099_004:0025b07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即往彼邪盛會所放諸眾生，而告之言：「長身婆羅門語汝：『隨其所樂，山澤曠野，飲水食草，四風自適。』」",
        "translation": "He went to the meeting place where the evil flourished and released the sentient beings, telling them, \"The long-bodied Brāhmaṇa says to you, 'Follow your heart's desire, go to the mountains, swamps, and fields, drink water and eat grass, and adapt to the four winds.'\"",
        "source": "T02n0099_004:0025b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊知欝多羅。",
        "translation": "At that point, the Bhagavān knew Uttarakuru.",
        "source": "T02n0099_004:0025b10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知已，為長身婆羅門種種說法，示、教、照、喜。",
        "translation": "After he knew, he spoke variously for the long-bodied Brāhmaṇa, showing, teaching, illuminating, and rejoicing.",
        "source": "T02n0099_004:0025b10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如律，世尊說法先後，說戒、說施及生天功德，愛欲味患，出要、清淨、煩惱清淨，開示現顯。",
        "translation": "According to the Vinaya, after he taught, the Bhagavān explained the precepts, explained the merits of generosity and birth in heaven, the taste and taste of cravings, and the essentials of escape, purity, and the purification of afflictions, which were revealed and made manifest.",
        "source": "T02n0099_004:0025b11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如鮮淨白[疊*毛]易受染色，長身婆羅門亦復如是。",
        "translation": "Like a pure white [tuft of *hair] that's easily stained, so too is a long-bodied brāhmaṇa.",
        "source": "T02n0099_004:0025b13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即於座上見四真諦，得無間等。",
        "translation": "He then sees the four true truths from his seat and attains their uninterrupted equality.",
        "source": "T02n0099_004:0025b15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，長身婆羅門見法、得法、知法、入法，度諸疑惑，不由他度，於正法中得無所畏。",
        "translation": "Seeing the teaching, apprehending the teaching, knowing the teaching, and entering the teaching, the long-bodied Brāhmaṇa then overcomes his doubts and confusions, doesn't let others save him, and attains fearlessness in the right teaching.",
        "source": "T02n0099_004:0025b15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即從座起，整衣服，偏袒右肩，合掌白佛：「已度，世尊！",
        "translation": "He rose from his seat, adjusted his robes, bared his right shoulder, put his palms together, and said to the Buddha, \"I've been saved, Bhagavān!",
        "source": "T02n0099_004:0025b17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從今日盡其壽命，歸佛、歸法、歸比丘僧，為優婆塞，證知我。",
        "translation": "From now on, I'll end my life and return to the Buddha, Dharma, and monks as an upāsaka who understands me.",
        "source": "T02n0099_004:0025b19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊與諸大眾受我飯食。",
        "translation": "Please let the Bhagavān and the great assembly accept my food.",
        "source": "T02n0099_004:0025b20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊默然而許。」",
        "translation": "At that point, the Bhagavān was silent and gave his permission.\"",
        "source": "T02n0099_004:0025b21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，長身婆羅門知佛受請已，為佛作禮，右繞三匝而去。",
        "translation": "Knowing that the Buddha had accepted his invitation, the long-bodied brāhmaṇa paid homage to him, circled him three times to his right, and departed.",
        "source": "T02n0099_004:0025b21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長身婆羅門還邪盛處，所諸供辦淨美好者，布置床座，遣使請佛，白言：「時到，惟聖知時。」",
        "translation": "The long-bodied brāhmaṇa returned to the place where evil flourished, made offerings to people who were pure and beautiful, arranged seats, and sent an envoy to invite the Buddha, saying, \"The time has come, but the sage knows the time.\"",
        "source": "T02n0099_004:0025b23_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊著衣持鉢，大眾圍繞，往到長身婆羅門會所，大眾前坐。",
        "translation": "The Bhagavān then put on his robe and bowl, surrounded by the crowd, and went to the meeting place of the long-bodied Brāhmaṇa and sat down in front of the crowd.",
        "source": "T02n0099_004:0025b25_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，長身婆羅門知世尊坐定已，手自供養種種飲食。",
        "translation": "The long-bodied brāhmaṇa then knew that the Bhagavān had sat down and concentrated, and he offered himself a variety of foods.",
        "source": "T02n0099_004:0025b27_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "食已，澡漱洗鉢畢，別敷卑床，於大眾前端坐聽法。",
        "translation": "After he finished eating, he washed his bowl, prepared a separate lowly bed, and sat correctly in front of the crowd to listen to the teaching.",
        "source": "T02n0099_004:0025b28_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊為長身婆羅門說種種法，示、教、照、喜已，從座起而去。",
        "translation": "At that point, the Bhagavān explained various teachings to the long-bodied Brāhmaṇa, and after showing, teaching, illuminating, and rejoicing in them, he rose from his seat and departed.",
        "source": "T02n0099_004:0025b29_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九四）如是我聞：一時，佛住舍衛國祇樹給孤獨園。",
        "translation": "(94) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0099_004:0025c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有年少婆羅門名僧迦羅，來詣佛所，與世尊面相問訊慰勞已，退坐一面，白佛言：「瞿曇！",
        "translation": "A young brāhmaṇa named Saṃkara came to the Buddha, exchanged greetings and commiserations with the Bhagavān, withdrew to sit at one side, and said to the Buddha, \"Gautama!",
        "source": "T02n0099_004:0025c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不善男子云何可知？」",
        "translation": "How can unskillful sons be known?\"",
        "source": "T02n0099_004:0025c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「譬猶如月。」",
        "translation": "The Buddha told the Brāhmaṇa, \"An analogy is like the moon.\"",
        "source": "T02n0099_004:0025c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門復問：「善男子云何可知？」",
        "translation": "The Brāhmaṇa again asked, \"Good sons, how can this be known?\"",
        "source": "T02n0099_004:0025c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「譬猶如月。」",
        "translation": "The Buddha told the Brāhmaṇa, \"An example is like the moon.\"",
        "source": "T02n0099_004:0025c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門白佛：「云何不善男子如月？」",
        "translation": "The Brāhmaṇa said to the Buddha, \"Why isn't a good man like the moon?\"",
        "source": "T02n0099_004:0025c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「如月黑分，光明亦失，色亦失，所係亦失，日夜消滅，乃至不現。",
        "translation": "The Buddha told the Brāhmaṇa, \"Suppose the moon is partly black, its light is lost, its form is lost, and its tethers are lost, and it disappears day and night until it doesn't appear.",
        "source": "T02n0099_004:0025c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，有人於如來所，得信家心，受持淨戒，善學多聞，損己布施，正見真實。",
        "translation": "Thus, in the Tathāgata's abode, a person attains a family mind of faith, observes pure precepts, trains well and is well-versed, undermines their own generosity, and correctly sees the truth.",
        "source": "T02n0099_004:0025c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於如來所淨信、持戒、惠施、多聞、正見真直已，然後退失，於戒、聞、施、正見悉皆忘失，日夜消滅，乃至須臾，一切忘失。",
        "translation": "After his pure faith, observance of precepts, generosity, learning, and right view are true and straightforward at the Tathāgata's place, he then regresses and forgets all about precepts, learning, generosity, and right view, which all disappear day and night and are forgotten even for a short while.",
        "source": "T02n0099_004:0025c12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，婆羅門！",
        "translation": "\"Furthermore, Brāhmaṇa!",
        "source": "T02n0099_004:0025c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子不習近善知識，不數聞法，不正思惟，身行惡行，口行惡行，意行惡行。",
        "translation": "\"If good sons don't train with good teachers, don't often hear the teaching, and don't correctly contemplate it, they engage in bad physical actions, bad verbal actions, and bad mental actions.",
        "source": "T02n0099_004:0025c15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行惡因緣故，身壞命終，墮惡趣泥梨中。",
        "translation": "As a result of these bad deeds, their body breaks up and their life ends, and they fall into the nirvāṇa of a bad destiny.",
        "source": "T02n0099_004:0025c17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，婆羅門！",
        "translation": "Thus, Brāhmaṇa!",
        "source": "T02n0099_004:0025c18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不善男子其譬如月。」",
        "translation": "An unskillful man is like the moon.\"",
        "source": "T02n0099_004:0025c18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門白佛：「云何善男子其譬如月？」",
        "translation": "The Brāhmaṇa said to the Buddha, \"What's a good man like the moon?\"",
        "source": "T02n0099_004:0025c18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「譬如明月淨分光明，色澤日夜增明，乃至月滿，一切圓淨。",
        "translation": "The Buddha told the Brāhmaṇa, \"It's like a bright moon with a pure part of its radiance, whose color increases day and night until the moon is full and everything is perfectly pure.",
        "source": "T02n0099_004:0025c19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，善男子於如來法、律得淨信心，乃至正見真淨增明，戒增、施增、聞增、慧增，日夜增長；復於餘時親近善知識，聞說正法，內正思惟，行身善行，行口善行，行意善行故，以是因緣，身壞命終，化生天上。",
        "translation": "Thus, good sons attain pure faith in the Tathāgata's teachings and precepts, up to the point where right view is truly pure and bright, and morality, generosity, learning, and wisdom increase day and night; they also become close to good teachers at other times, hear and teach the right teaching, correctly contemplate internally, and perform good physical actions, good verbal actions, and good mental actions.",
        "source": "T02n0099_004:0025c21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T02n0099_004:0025c26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故善男子譬如月。」",
        "translation": "Good sons, therefore, are like the moon.\"",
        "source": "T02n0099_004:0025c26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊而說偈言：「譬如月無垢，　　周行於虛空，　一切小星中，　　其光最盛明。",
        "translation": "It was then that the Bhagavān spoke in verse, saying, \"It's like the moon, which is spotless and travels around in space, and among all the small stars, its light is the brightest.",
        "source": "T02n0099_004:0025c27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　淨信亦如是，　　戒聞離慳施，　於諸慳世間，　　其施特明顯。」",
        "translation": "So is pure faith, morality, learning, and freedom from stinginess, and in the world of stinginess, its generosity is especially marked.\"",
        "source": "T02n0099_004:0026a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此經已，僧迦羅婆羅門聞佛所說，歡喜隨喜，從座起而去。",
        "translation": "After the Buddha spoke this sūtra, the Saṃghârāmaṇeras who heard what he taught rejoiced and followed him, got up from their seats, and departed.",
        "source": "T02n0099_004:0026a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九五）如是我聞：一時，佛住舍衛國祇樹給孤獨園。",
        "translation": "(95) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0099_004:0026a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有生聞婆羅門來詣佛所，與世尊面相問訊慰勞已，退坐一面，白佛言：「瞿曇！",
        "translation": "Then, a Brahmin from Sengxuan came to the Buddha, exchanged greetings and commiserations with the Bhagavān, withdrew to sit at one side, and said to the Buddha, \"Gautama!",
        "source": "T02n0099_004:0026a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞瞿曇說言：『唯應施我，不應施餘人；施我得大果，非施餘人而得大果。",
        "translation": "I heard the Gautama say, 'Only give to me, not to others; give to me and you'll attain great rewards, not to others.",
        "source": "T02n0099_004:0026a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應施我弟子，不應施餘弟子；施我弟子得大果報，非施餘弟子得大果報。』",
        "translation": "Give to my disciples, not to others, and give to my disciples to attain great rewards, not to others to attain great rewards.'",
        "source": "T02n0099_004:0026a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何？",
        "translation": "How is that?",
        "source": "T02n0099_004:0026a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞿曇！",
        "translation": "Gautama!",
        "source": "T02n0099_004:0026a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語者，為實說耶？",
        "translation": "Is he who says this a true statement?",
        "source": "T02n0099_004:0026a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非為謗毀瞿曇乎？",
        "translation": "Is it not to denigrate the Gautama?",
        "source": "T02n0099_004:0026a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為如說說、如法說耶？",
        "translation": "Is it explained as it is and explained according to the teaching?",
        "source": "T02n0099_004:0026a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法次法說，不為餘人以同法來訶責耶？」",
        "translation": "Do you teach the Dharma in order and not rebuke others with the same teaching?\"",
        "source": "T02n0099_004:0026a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「彼如是說者，謗毀我耳！",
        "translation": "The Buddha told the Brāhmaṇa, \"He who thus speaks denigrates me!",
        "source": "T02n0099_004:0026a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非如說說、如法說、法次法說，不致他人來以同法呵責。",
        "translation": "If someone doesn't explain it as it is, tell it as it is, and teach it in order, they won't cause others to come along and rebuke them with the same teaching.",
        "source": "T02n0099_004:0026a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T02n0099_004:0026a16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我不如是說：『應施於我，不應施餘；施我得大果報，非施餘人得大果報。",
        "translation": "I don't say it like this, 'Give to me, not to others; give to me and you'll get great rewards, not to others.",
        "source": "T02n0099_004:0026a16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應施我弟子，施我弟子得大果報，非施餘弟子得大果報。』",
        "translation": "Give to my disciples, and give to my disciples to attain great rewards, not to others to attain great rewards.'",
        "source": "T02n0099_004:0026a18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然，婆羅門！",
        "translation": "Still, Brāhmaṇa!",
        "source": "T02n0099_004:0026a20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我作如是說者，作二種障：障施者施、障受者利。",
        "translation": "When I say this, I create two kinds of obstacles: obstacles that prevent the donor from giving and obstacles that prevent the recipient from getting benefit.",
        "source": "T02n0099_004:0026a20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門乃至士夫，以洗器餘食著於淨地，令彼處眾生即得利樂。",
        "translation": "A brāhmaṇa or even a man who puts surplus food from a dishwasher on a pure spot causes sentient beings there to immediately attain benefit and happiness.",
        "source": "T02n0099_004:0026a21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我說斯等亦入福門，況復施人？",
        "translation": "I say this also enters the gate of merit, so how could it be possible for someone to give?",
        "source": "T02n0099_004:0026a23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇa!",
        "source": "T02n0099_004:0026a23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然我復說，施持戒者得果報，不同犯戒。」",
        "translation": "Yet I also say that giving and observing precepts has its rewards, which are not the same as violating them.\"",
        "source": "T02n0099_004:0026a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生聞婆羅門白佛言：「如是，瞿曇！",
        "translation": "The Brahmins who had heard of the Buddha said, \"So it is, Gautama!",
        "source": "T02n0099_004:0026a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦如是說，施持戒者得大果報，非施犯戒。」",
        "translation": "Thus do I say that giving and observing precepts will have great rewards, and not giving violates the precepts.\"",
        "source": "T02n0099_004:0026a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊復說偈言：「若黑若有白，　　若赤若有色，　犁雜及金色，　　純黃及鴿色，　如是等牸牛，　　生犢姝好者，　丁壯力具足，　　調善行捷疾，　但使堪運重，　　不問本生色，　人亦復如是，　　各隨彼彼生，　剎利婆羅門，　　毘舍首陀羅，　旃陀羅下賤，　　所生悉不同，　但使持淨戒，　　離重擔煩惱，　純一修梵行，　　漏盡阿羅漢，　於世間善逝，　　施彼得大果，　愚者無智慧，　　未甞聞正法，　施彼無大果，　　不近善友故，　若習善知識，　　如來及聲聞，　清淨信善逝，　　根生堅固力，　所住之善趣，　　及生大姓家，　究竟般涅盤，　　大仙如是說。」",
        "translation": "It was then that the Bhagavān spoke again in verse, \"Whether black, white, red, or colored, plow-brick or gold, pure yellow or pigeon colored, such as these, are the calves that give birth to calves that are beautiful and good, strong and vigorous, quick to train well, capable of carrying a load, regardless of their original birth, so are people, each born one after the other, bhadrâlis, piśāstra, candra, and the lower classes, all born differently, but they maintain pure precepts, are free of heavy burdens and afflictions, purely cultivate the religious practice, end the contaminants, become arhats, pass away well in the world, and bestow great fruits on Peter, foolish people lack wisdom, haven't heard the right teaching, bestow no great fruits, don't approach good friends, and so on.",
        "source": "T02n0099_004:0026a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此經已，生聞婆羅門聞佛所說，歡喜隨喜，作禮而去。",
        "translation": "After the Buddha spoke this sūtra, the Brahmins who had heard what he taught rejoiced and followed him, paid homage, and departed.",
        "source": "T02n0099_004:0026b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九六）如是我聞：一時，佛住舍衛國祇樹給孤獨園。",
        "translation": "(96) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0099_004:0026b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊晨朝著衣持鉢，入舍衛城乞食。",
        "translation": "At the time, the Bhagavān put on his robe and took his bowl into Śrāvastī in the morning and went into the city to solicit alms.",
        "source": "T02n0099_004:0026b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有異婆羅門，年耆根熟，執杖持鉢，家家乞食。",
        "translation": "At the time, there was a certain Brāhmaṇa, quite elderly and well-established, who took his staff and bowl and went from house to house begging for food.",
        "source": "T02n0099_004:0026b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告婆羅門：「汝今云何年耆根熟，柱杖持鉢，家家乞食？」",
        "translation": "The Bhagavān then addressed the Brāhmaṇa, \"Now, how are you old and mature, carrying a staff and bowl, and going from house to house to solicit alms?\"",
        "source": "T02n0099_004:0026b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門白佛：「瞿曇！",
        "translation": "The Brāhmaṇa said to the Buddha, \"Gautama!",
        "source": "T02n0099_004:0026b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我家中所有財物悉付其子，為子娶妻，然後捨家，是故柱杖持鉢，家家乞食。」",
        "translation": "I gave all of my family's possessions to my son, married him, and then left home; therefore, I carried a bowl with a staff and begged for food from home.\"",
        "source": "T02n0099_004:0026b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「汝能於我所受誦一偈，還歸於眾中，為兒說耶？」",
        "translation": "The Buddha told the Brāhmaṇa, \"Could you recite a verse to me and return it to the congregation and speak it for your son?\"",
        "source": "T02n0099_004:0026b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門白佛：「能受。",
        "translation": "The Brāhmaṇa said to the Buddha, \"I can accept it.",
        "source": "T02n0099_004:0026b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞿曇！」",
        "translation": "Gautama!\"",
        "source": "T02n0099_004:0026b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊即說偈言：「生子心歡喜，　　為子聚財物，　亦為娉其妻，　　而自捨出家。",
        "translation": "It was then that the Bhagavān spoke this verse, \"Delighted at the birth of a son, he gathered property for his son and renounced the world in order to honor his wife.",
        "source": "T02n0099_004:0026b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　邊鄙田舍兒，　　違負於其父，　人形羅剎心，　　棄捨於尊老，　老馬無復用，　　則奪其䵃麥，　兒少而父老，　　家家行乞食，　曲杖為最勝，　　非子為恩愛，　為我防惡牛，　　免險地得安，　能却兇暴狗，　　扶我闇處行，　避深坑空井，　　草木棘刺林，　憑杖威力故，　　峙立不墮落。」",
        "translation": "A son from a humble farmhouse disobeys his father, takes on the mind of a humanoid Rāṣṭrapāla, abandons his father, discards his Ṛṣipatana, and takes away his Ṛṣipatana when his old horse has no more use. A young child and an elderly father go from family to family begging for food.",
        "source": "T02n0099_004:0026c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門從世尊受斯偈已，還歸婆羅門大眾中為子而說。",
        "translation": "After accepting this verse from the Bhagavān, the Brāhmaṇa returned to the Brāhmaṇa's community and spoke it for his son.",
        "source": "T02n0099_004:0026c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先白大眾：「聽我所說。」",
        "translation": "First, he said to the crowd, \"Listen to what I've said.\"",
        "source": "T02n0099_004:0026c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然後誦偈……如上廣說。",
        "translation": "Then he recited the verse ... as explained in detail above.",
        "source": "T02n0099_004:0026c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其子愧怖，即抱其父，還將入家，摩身洗浴，覆以青衣被，立為家主。",
        "translation": "Embarrassed and frightened, the son took his father in his arms, returned home, washed himself, covered himself with a blanket of blue clothing, and made himself head of the household.",
        "source": "T02n0099_004:0026c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門作是念：「我今得勝族姓，是沙門瞿曇恩。",
        "translation": "The brāhmaṇa then thought, \"Now, I've attained a superior lineage because of the ascetic Gautama's kindness.",
        "source": "T02n0099_004:0026c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我經所說：『為師者如師供養，為和尚者如和尚供養。』",
        "translation": "My sūtras say, 'A teacher serves as a teacher, and a monk serves as a monk.'",
        "source": "T02n0099_004:0026c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今所得，皆沙門瞿曇力，即是我師，我今當以上妙好衣以奉瞿曇。」",
        "translation": "What I've gained now is the power of the ascetic Gautama, who is my teacher, and I will now present the Gautama with the finest robes.\"",
        "source": "T02n0099_004:0026c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門持上妙衣，至世尊所，面前問訊慰勞已，退坐一面，白佛言：「瞿曇！",
        "translation": "The brāhmaṇa then took the superior fine garments, went to the Bhagavān, exchanged greetings and commiserations with him, withdrew to sit to one side, and said to the Buddha, \"Gautama!",
        "source": "T02n0099_004:0026c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今居家成就，是瞿曇力。",
        "translation": "This is the power of the Gautama that I've achieved in my home now.",
        "source": "T02n0099_004:0026c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我經記說：『為師者以師供養，為和尚者以和尚供養。』",
        "translation": "My sūtras say, 'A teacher makes offerings to a teacher, and a monk makes offerings to a monk.'",
        "source": "T02n0099_004:0026c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今日瞿曇即為我師，願受此衣，哀愍故！」",
        "translation": "Today, the Gautama is my teacher, so I wish to accept this robe out of pity!\"",
        "source": "T02n0099_004:0026c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊即受，為哀愍故。",
        "translation": "The Bhagavān then accepted it out of pity.",
        "source": "T02n0099_004:0026c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊為婆羅門說種種法，示、教、照、喜。",
        "translation": "At the time, the Bhagavān explained various things to the Brāhmaṇa, showing, teaching, illuminating, and rejoicing in them.",
        "source": "T02n0099_004:0026c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門聞佛所說，歡喜隨喜，作禮而去。",
        "translation": "When the Brāhmaṇa heard what the Buddha taught, he rejoiced and followed his joy, paid homage, and departed.",
        "source": "T02n0099_004:0026c24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九七）如是我聞：一時，佛住舍衛國祇樹給孤獨園。",
        "translation": "(97) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0099_004:0026c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊晨朝著衣持鉢，入舍衛城乞食。",
        "translation": "At the time, the Bhagavān put on his robe and took his bowl into Śrāvastī in the morning and went into the city to solicit alms.",
        "source": "T02n0099_004:0026c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有異婆羅門年耆根熟，攝杖持鉢，家家乞食。",
        "translation": "At the time, there was a certain Brāhmaṇa who was quite old and had matured roots, so he gathered his staff and bowl and went from house to house to solicit alms.",
        "source": "T02n0099_004:0026c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼婆羅門遙見世尊而作是念：「沙門瞿曇攝杖持鉢，家家乞食，我亦攝杖持鉢，家家乞食，我與瞿曇俱是比丘。」",
        "translation": "That brāhmaṇa saw the Bhagavān from a distance and thought, \"The ascetic Gautama takes his staff and bowl and goes from house to house begging for food; I also take my staff and bowl and go from house to house begging for food; we're both monks, Gautama and I.\"",
        "source": "T02n0099_004:0026c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說偈答曰：「所謂比丘者，　　非但以乞食，　受持在家法，　　是何名比丘。",
        "translation": "The Bhagavān then spoke a verse in reply, \"What's the name of a monk who doesn't just beg for food and retains the teachings at home?",
        "source": "T02n0099_004:0027a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於功德過惡，　　俱離修正行，　其心無所畏，　　是則名比丘。」",
        "translation": "Being free of both virtues and faults, corrective actions, and fearless in mind, this is called a monk.\"",
        "source": "T02n0099_004:0027a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說是經已，彼婆羅門聞佛所說，歡喜隨喜，作禮而去。",
        "translation": "After the Buddha spoke this sūtra, the Brāhmaṇa who heard what he taught rejoiced and followed him, paid homage, and departed.",
        "source": "T02n0099_004:0027a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九八）如是我聞：一時，佛在拘薩羅人間遊行，至一那羅聚落，住一那羅林中。",
        "translation": "（Thus I have heard: One time, the Buddha was traveling among the people of Kośala and arrived at a village in Nādika and stayed in a forest there.",
        "source": "T02n0099_004:0027a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊著衣持鉢，入一陀羅聚落乞食，而作是念：「今日大早，今且可過耕田婆羅豆婆遮婆羅門作飲食處。」",
        "translation": "The Bhagavān then put on his robe and took his bowl into the village of Nādāra to solicit alms and thought, \"It's early in the morning, so now I can pass through the gate of Nāgârjuna Bodhisattva for a meal.\"",
        "source": "T02n0099_004:0027a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，耕田婆羅豆婆遮婆羅門五百具犁耕田，為作飲食。",
        "translation": "At the time, the five hundred plowed fields of Bodhidharma were plowed by the five hundred plowed-field Bhadrapāla men for food and drink.",
        "source": "T02n0099_004:0027a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，耕田婆羅豆婆遮婆羅門遙見世尊，白言：「瞿曇！",
        "translation": "Seeing the Bhagavān from a distance, the plowing Brahmadhvaja Brāhmaṇa said, \"Gautama!",
        "source": "T02n0099_004:0027a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今耕田下種，以供飲食，沙門瞿曇亦應耕田下種，以供飲食。」",
        "translation": "Now, as I plow my field and plant seeds for food and drink, the ascetic Gautama should also plow his field and plant seeds for food and drink.\"",
        "source": "T02n0099_004:0027a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「我亦耕田下種，以供飲食。」",
        "translation": "The Buddha told the Brāhmaṇa, \"I've also plowed the fields and planted the seeds for food and drink.\"",
        "source": "T02n0099_004:0027a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門白佛：「我都不見沙門瞿曇若犁、若軛、若鞅、若縻、若鑱、若鞭，而今瞿曇說言：『我亦耕田下種，以供飲食。』」",
        "translation": "The Brāhmaṇa said to the Buddha, \"I haven't seen the ascetic Gautama plow, yoke, harness, tie, hook, or whip, but now the Gautama says, 'I too plow the fields and plant seeds for food and drink.'\"",
        "source": "T02n0099_004:0027a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，耕田婆羅豆婆遮婆羅門即說偈言：「自說耕田者，　　而不見其耕，　為我說耕田，　　令我知耕法。」",
        "translation": "It was then that the Brahmā Bhadrapāla gate who plowed the fields said in a verse, \"He teaches himself to plow the fields but doesn't see him plowing them, so teach me to plow the fields and make me know the way to plow them.\"",
        "source": "T02n0099_004:0027a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說偈答言：「信心為種子，　　苦行為時雨，　智慧為時軛，　　慚愧心為轅，　正念自守護，　　是則善御者。",
        "translation": "The Bhagavān then spoke a verse in reply, \"Faith is the seed, ascetic practices are the timely rain, wisdom is the timely yoke, modesty is the pole of my heart, and right mindfulness is my guard; this is a good protector.",
        "source": "T02n0099_004:0027a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　包藏身口業，　　知食處內藏，　真實為真乘，　　樂住為懈息，　精進為廢荒，　　安隱而速進。",
        "translation": "He conceals his physical and verbal activity, knows the inner store of food, makes it the true vehicle, abides comfortably as laziness, makes effort as waste, and advances calmly and quickly.",
        "source": "T02n0099_004:0027a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　直往不轉還，　　得到無憂處。",
        "translation": "He goes straight ahead without turning back, and he attains a place of no sorrow.",
        "source": "T02n0099_004:0027b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是耕田者，　　逮得甘露果；　如是耕田者，　　不還受諸有。」",
        "translation": "Thus plowing the fields, he acquires the fruit of ambrosia, and thus plowing the fields, he doesn't revert to the enjoyment of existence.\"",
        "source": "T02n0099_004:0027b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，耕田婆羅豆婆遮婆羅門白佛言：「善耕田！",
        "translation": "The Cultivation Vātsīputrīya Brahman then said to the Buddha, \"Good Cultivation!",
        "source": "T02n0099_004:0027b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞿曇！",
        "translation": "Gautama!",
        "source": "T02n0099_004:0027b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極善耕田！",
        "translation": "extremely good at plowing fields!",
        "source": "T02n0099_004:0027b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞿曇！」",
        "translation": "Gautama!\"",
        "source": "T02n0099_004:0027b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是耕田婆羅豆婆遮婆羅門聞世尊說偈，心轉增信，以滿鉢香美飲食以奉世尊。",
        "translation": "After hearing the Bhagavān speak that verse, the Cultivated Field Brāhmaṇa Dignāga Brahman's faith grew in his heart and offered the Bhagavān a bowl full of delicious food and drink.",
        "source": "T02n0099_004:0027b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊不受，以因說偈得故。",
        "translation": "The Bhagavān didn't accept it because it was obtained by speaking the verse.",
        "source": "T02n0099_004:0027b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「不因說法故，　　受彼食而食。」",
        "translation": "He then spoke the verse, saying, \"It wasn't because he explained the teaching that he accepted that food and ate it.\"",
        "source": "T02n0099_004:0027b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是廣說，如前為火與婆羅門廣說。",
        "translation": "He explained it in detail as he did before for the fire and the brāhmaṇas.",
        "source": "T02n0099_004:0027b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，耕田婆羅豆婆遮婆羅門白佛言：「瞿曇！",
        "translation": "The Pāṭaliputra-dhvaja Brāhmaṇa then said to the Buddha, \"Gautama!",
        "source": "T02n0099_004:0027b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今以此食安著何處？」",
        "translation": "Where will I put this food?\"",
        "source": "T02n0099_004:0027b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「我不見諸天、魔、梵、沙門、婆羅門、天神、世人堪食此食而得安身。",
        "translation": "The Buddha told the Brāhmaṇa, \"I don't see any gods, Māra, Brahmā, ascetics, brāhmaṇas, gods, or humans who could eat this food and attain peace.",
        "source": "T02n0099_004:0027b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "Brāhmaṇas!",
        "source": "T02n0099_004:0027b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝持此食著無虫水中，及少生草地。」",
        "translation": "Hold this food in insect-free water, and it will produce a little grass.\"",
        "source": "T02n0099_004:0027b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門即持此食著無虫水中，水即煙起涌沸，啾啾作聲。",
        "translation": "The Brāhmaṇa then took this food and put it in bug-free water, and the water smoked up and boiled, making a chirping noise.",
        "source": "T02n0099_004:0027b17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如熱丸投於冷水，啾啾作聲。",
        "translation": "Like a hot ball thrown into cold water, it chirps and sounds.",
        "source": "T02n0099_004:0027b18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是彼食投著無虫水中，煙起涌沸，啾啾作聲。",
        "translation": "Thus, when he throws this food into insect-free water, smoke rises and boils, and it chirps and sounds.",
        "source": "T02n0099_004:0027b19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門作是念：「沙門瞿曇實為奇特！",
        "translation": "The brāhmaṇa then thought, \"The ascetic Gautama is really quite extraordinary!",
        "source": "T02n0099_004:0027b20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德大力，乃令飲食神變如是。」",
        "translation": "The great virtuous power of the Buddha has caused this kind of miraculous transformation in the diet.\"",
        "source": "T02n0099_004:0027b21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼婆羅門見食瑞應，信心轉增，白佛言：「瞿曇！",
        "translation": "Seeing the miraculous response to the meal, the Brāhmaṇa's faith grew and he said to the Buddha, \"Gautama!",
        "source": "T02n0099_004:0027b22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今可得於正法中出家、受具足不？」",
        "translation": "May I now leave home and become a fully ordained monk in the right Dharma?\"",
        "source": "T02n0099_004:0027b23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「汝今可得於正法中出家、受具足，得比丘分。」",
        "translation": "The Buddha told the Brāhmaṇa, \"Now you can leave home in the right Dharma, be fully ordained, and attain the monk's rank.\"",
        "source": "T02n0099_004:0027b24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼即出家已，獨靜思惟：「所以族姓子剃除鬚髮，著袈裟衣，正信非家，出家學道……。」",
        "translation": "After leaving home, he thought quietly and alone, \"That's why a clansman shaves off his hair, puts on the reddish-brown robes, has correct faith that he's not a homeowner, and leaves home to train on the path....",
        "source": "T02n0099_004:0027b25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至得阿羅漢，心善解脫。",
        "translation": "Up to the point where they become an arhat, their mind is well-liberated.",
        "source": "T02n0099_004:0027b27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九九）如是我聞：一時，佛住王舍城。",
        "translation": "（Thus I have heard: One time, the Buddha was staying in the city of Rājagṛha.",
        "source": "T02n0099_004:0027b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有尊者名曰淨天，在鞞提訶國人間遊行，至彌絺羅城菴羅園中。",
        "translation": "At the time, a certain Venerable Jingtian was traveling among the people of Videha and came to Āmravana in the city of Mekhalā.",
        "source": "T02n0099_004:0027b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，尊者淨天晨朝著衣持鉢，入彌絺羅城乞食。",
        "translation": "In the early morning, Venerable Jingtian put on his robe and took his bowl into the city of Mahīśāsaka to solicit alms.",
        "source": "T02n0099_004:0027c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次第乞食，到自本家。",
        "translation": "He begged for food one by one and went to his own home.",
        "source": "T02n0099_004:0027c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，淨天母年老，在中堂持食祀火，求生梵天，不覺尊者淨天在門外立。",
        "translation": "At the time, Venerable Jing Tian's mother was elderly and was in the middle hall, holding a meal for the fire and seeking birth in the Brahma Heaven, when she didn't realize that Venerable Jing Tian was standing outside the door.",
        "source": "T02n0099_004:0027c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，毘沙門天王於尊者淨天所極生敬信。",
        "translation": "Vaiśravaṇa then became extremely venerable to Venerable Jing Tian.",
        "source": "T02n0099_004:0027c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，毘沙門天王，諸夜叉導從，乘虛而行，見尊者淨天在門外立。",
        "translation": "The Vaiśravaṇa king of gods, guided by the yakṣas, rode out in the sky and saw Venerable Jing Tian standing outside the gate.",
        "source": "T02n0099_004:0027c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又見其母手擎飲食，在中堂上供養祀火，不見其子在外門立。",
        "translation": "He also saw his mother, who was carrying food and drink in her hand, offering a fire sacrifice in the center hall, and didn't see her son standing at the outer gate.",
        "source": "T02n0099_004:0027c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見已，從空中下，至淨天母前，而說偈言：「此婆羅門尼，　　梵天極遼遠，　為求彼生故，　　於此祠祀火。",
        "translation": "After he saw this, he descended from the sky and went down to Venerable Jingtian's mother and spoke a verse, saying, \"This is a Brahman nun, a Brahman who is so far away that he's sacrificing to fire at this shrine for the sake of his birth.",
        "source": "T02n0099_004:0027c09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此非梵天道，　　何為徒祀此？",
        "translation": "Why is this not the path of the Brahma gods, and why is it worshiped here in vain?",
        "source": "T02n0099_004:0027c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝婆羅門尼，　　淨天住門外，　垢穢永無餘，　　是則天中天，　蕭然無所有，　　獨一不兼資，　為乞食入舍，　　所應供養者，　淨天善修身，　　人天良福田。",
        "translation": "\"You Brāhmaṇas, you pure gods abide outside the gate, leaving defilements forever undefiled, for then there's a god of gods, completely destitute of possessions, alone, with no assets, begging for food and entering the monastery, and those to whom offerings should be made, pure gods who cultivate their bodies well, good fields of merit for humans and gods.",
        "source": "T02n0099_004:0027c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　遠離一切惡，　　不為染所染，　德同於梵天，　　形在人間住，　不著一切法，　　如彼淳熟龍，　比丘正念住，　　其心善解脫，　應奉以初佛，　　是則上福田。",
        "translation": "Far removed from all evil, not stained by defilements, their virtues are the same as those of the Brahma gods, they live among humans in form, not attached to any dharmas, like that well-ripened dragon, a monk standing correctly mindful, his mind well liberated, and dedicated to the first Buddha, which is a field of superior merit.",
        "source": "T02n0099_004:0027c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應以正信心，　　及時速施與，　當預建立洲，　　令未來安樂。",
        "translation": "With right faith, he should give quickly and on time, anticipating the creation of a continent for future happiness.",
        "source": "T02n0099_004:0027c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝觀此牟尼，　　已渡苦海流，　是故當信心，　　及時速施與，　當預建立洲，　　令未來安樂，　毘沙門天王，　　開發彼令捨。」",
        "translation": "You see this Muni, who has crossed the current of the ocean of suffering, so you should have faith and quickly give in time to build a continent in anticipation of future happiness, and Vaiśravaṇa, the king of the gods, will develop it and cause it to be abandoned.\"",
        "source": "T02n0099_004:0027c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，尊者淨天即為其母種種說法，示、教、照、喜已，復道而去。",
        "translation": "Venerable Jing Tian then spoke variously for his mother, and after showing, teaching, illuminating, and rejoicing, he resumed his path and departed.",
        "source": "T02n0099_004:0028a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（一〇〇）如是我聞：一時，佛住舍衛國祇樹給孤獨園。",
        "translation": "(100) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0099_004:0028a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有異婆羅門來詣佛所，面前問訊，相慰勞已，退坐一面，白佛言：「瞿曇！",
        "translation": "An ordinary Brāhmaṇa came to the Buddha, exchanged greetings with him, reassured him, withdrew to sit at one side, and said to him, \"Gautama!",
        "source": "T02n0099_004:0028a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂佛者，云何為佛？",
        "translation": "What is meant by a Buddha, and what is a Buddha?",
        "source": "T02n0099_004:0028a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是父母制名？",
        "translation": "Why are these names created by the parents?",
        "source": "T02n0099_004:0028a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是婆羅門制名？」",
        "translation": "Why is this the name of a Brahmanical system?\"",
        "source": "T02n0099_004:0028a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門即說偈言：「佛者是世間，　　超渡之勝名，　為是父母制，　　名之為佛耶？」",
        "translation": "The Brāhmaṇa then spoke in verse, saying, \"Is the Buddha a worldly, transcendent name for something made by a father and mother and called a Buddha?\"",
        "source": "T02n0099_004:0028a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說偈答言：「佛見過去世，　　如是見未來，　亦見現在世，　　一切行起滅。",
        "translation": "At that point, the Bhagavān spoke a verse in reply, \"The Buddha has seen the past, thus sees the future, and also sees the present world, where all conditioned things arise and cease.",
        "source": "T02n0099_004:0028a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　明智所了知，　　所應修已修，　應斷悉已斷，　　是故名為佛。",
        "translation": "Known with clear wisdom, he has cultivated what should be cultivated, and he has ended all that should be ended; therefore, he's called a Buddha.",
        "source": "T02n0099_004:0028a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　歷劫求選擇，　　純苦無暫樂，　生者悉磨滅，　　遠離息塵垢，　拔諸使刺本，　　等覺故名佛。」",
        "translation": "Throughout the eons they seek selection, pure suffering has no momentary pleasure, all that is born is ground away, they are free from the defilement of defilements, they uproot the thorns of tendencies, and they are therefore called buddhas because they are equally enlightened.\"",
        "source": "T02n0099_004:0028a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說偈已，彼婆羅門聞佛所說，歡喜隨喜，從座起去。",
        "translation": "After the Buddha spoke the verse, the Brāhmaṇa who heard what he taught rejoiced and followed him, rising from his seat and departing.",
        "source": "T02n0099_004:0028a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（一〇一）如是我聞：一時，佛在拘薩羅人間遊行，有從迦帝聚落、墮鳩羅聚落二村中間，一樹下坐，入晝正受。",
        "translation": "(101) Thus I have heard: One time, while the Buddha was traveling among the people of Kośala, there was a man from the village of Kārtti and the village of Dacula sitting under a tree, entering into the pārijāta proper.",
        "source": "T02n0099_004:0028a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有豆磨種姓婆羅門隨彼道行，尋佛後來，見佛脚跡千輻輪相，印文顯現，齊輻圓輞，眾好滿足。",
        "translation": "At the time, a Brahmin from the Douma family followed him on his path and looked behind him to see the thousand-spoked wheel shape in the Buddha's footprints, the seal appearing, the spokes aligned, and the mouth rounded, and the many attractive features fulfilled.",
        "source": "T02n0099_004:0028a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見已，作是念：「我未曾見人間有如是足跡，今當隨跡以求其人。」",
        "translation": "After seeing that, he thought, \"I've never seen such footprints on people, so now I'll follow them and find someone like that.\"",
        "source": "T02n0099_004:0028a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即尋脚跡至於佛所，來見世尊坐一樹下，入晝正受，嚴容絕世，諸根澄靜，其心寂定，第一調伏，正觀成就，光相巍巍，猶若金山。",
        "translation": "He then followed his footprints to the Buddha's place and came to see the Bhagavān sitting under a tree, entering the pārijāta and experiencing it correctly, his appearance absolutely transcending the world, his faculties calm, his mind tranquil, his first composure, and the accomplishment of correct contemplation, with a radiant appearance as lofty as a gold mountain.",
        "source": "T02n0099_004:0028a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見已，白言：「為是天耶？」",
        "translation": "After he saw this, he said, \"Is this the gods?\"",
        "source": "T02n0099_004:0028a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「我非天也。」",
        "translation": "The Buddha told the Brāhmaṇa, \"I'm not a god.\"",
        "source": "T02n0099_004:0028b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「為龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人、非人等？」",
        "translation": "\"Are they dragons, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans, nonhumans, and so forth?\"",
        "source": "T02n0099_004:0028b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「我非龍乃至人、非人也。」",
        "translation": "The Buddha told the Brāhmaṇa, \"I am not a dragon, nor am I a human being or not a human being.\"",
        "source": "T02n0099_004:0028b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門白佛：「若言非天、非龍，乃至非人、非非人，為是何等？」",
        "translation": "The Brāhmaṇa said to the Buddha, \"If you say you're not a god or not a dragon, and you're not a human being or not a human being, what is it?\"",
        "source": "T02n0099_004:0028b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說偈答言：「天龍乾闥婆，　　緊那羅夜叉，　無善阿修羅，　　諸摩睺羅伽，　人與非人等，　　悉由煩惱生，　如是煩惱漏，　　一切我已捨，　已破已磨滅，　　如芬陀利生，　雖生於水中，　　而未曾著水，　我雖生世間，　　不為世間著，　歷劫常選擇，　　純苦無暫樂，　一切有為行，　　悉皆生滅故，　離垢不傾動，　　已拔諸劍刺，　究竟生死除，　　故名為佛陀。」",
        "translation": "It was then that the Bhagavān spoke a verse in reply, \"The gods, dragons, gandharvas, yakṣas, unwholesome asuras, mahoragas, humans and nonhumans alike all arise from affliction; thus are all the contaminants of affliction that I have abandoned, broken down and worn away, like the birth of Pūrṇa Maitrāyaniputra; although I was born in water, I never clung to water; although I was born in the world, I didn't cling to the world; through the eons I was always chosen; pure suffering and no momentary pleasure; all the conditioned things that exist are produced and ceased; I'm spotless and untouched; I've pulled out the thorns of swords; I've completely removed birth and death; therefore I'm called a buddha.\"",
        "source": "T02n0099_004:0028b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此經已，豆摩種婆羅門聞佛所說，歡喜隨喜，從路而去。",
        "translation": "After the Buddha spoke this sūtra, the Doumacandra Brāhmaṇa who heard what he taught rejoiced and followed his heart, departing down the road.",
        "source": "T02n0099_004:0028b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（一〇二）如是我聞：一時，佛住王舍城迦蘭陀竹園。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Kalandaka's Bamboo Park in Rājagṛha.",
        "source": "T02n0099_004:0028b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊晨朝著衣持鉢，入王舍城乞食。",
        "translation": "At the time, the Bhagavān gathered his robe and bowl in the morning and went into Rājagṛha to solicit alms.",
        "source": "T02n0099_004:0028b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次第乞食，至婆羅豆婆遮婆羅門舍。",
        "translation": "He went begging for food one by one and arrived at the house of the Brāhmaṇa Brahman.",
        "source": "T02n0099_004:0028b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門手執木杓，盛諸飲食，供養火具，住於門邊，遙見佛來。",
        "translation": "Carrying a wooden ladle in his hand, he filled it with food and drink, made offerings on the fire, and stood near the entrance, where he saw the Buddha coming from afar.",
        "source": "T02n0099_004:0028b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見已，白佛作是言：「住！",
        "translation": "When he saw him, he said to the Buddha, \"Stay!",
        "source": "T02n0099_004:0028b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住！",
        "translation": "Stay!",
        "source": "T02n0099_004:0028b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "領群特！",
        "translation": "Linkunter!",
        "source": "T02n0099_004:0028b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慎勿近我門！」",
        "translation": "Do not approach my gate!\"",
        "source": "T02n0099_004:0028b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「汝知領群特、領群特法耶？」",
        "translation": "The Buddha addressed the Brāhmaṇa, \"Do you know the rules of leading the herd and the rules of leading the herd?\"",
        "source": "T02n0099_004:0028b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門言：「我不知領群特，亦不知領群特法，沙門瞿曇知領群特及領群特法不？」",
        "translation": "The brāhmaṇa said, \"I don't know the leaders and I don't know the principles of the leaders, does the ascetic Gautama know the leaders and the principles of the leaders?\"",
        "source": "T02n0099_004:0028b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「我善知是領群特及領群特法。」",
        "translation": "The Buddha said, \"I well know this to be the leader of the herd and the leader of the herd's teachings.\"",
        "source": "T02n0099_004:0028b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，婆羅門即放事火具，疾敷床座，請佛令坐，白言：「瞿曇！",
        "translation": "The Brāhmaṇa then put out a fire altar, quickly made a seat, asked the Buddha to allow him to sit, and said, \"Gautama!",
        "source": "T02n0099_004:0028b28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為我說領群特及領群特法。」",
        "translation": "Explain for me the way to lead a group of people and the way to lead a group of people.\"",
        "source": "T02n0099_004:0028b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即就座為說偈言：「瞋恚心懷恨，　　隱覆諸過惡，　犯戒起惡見，　　虛偽不真實，　如是等士夫，　　當知領群特。",
        "translation": "The Buddha then took his seat and spoke a verse for him, saying, \"An angry mind harboring hatred and concealing faults, violating precepts and giving rise to bad views, and being false and unreal, such a person should be known as a leader of the herd.",
        "source": "T02n0099_004:0028c01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　憋暴貪悋惜，　　惡欲慳諂偽，　無慚無愧心，　　當知領群特。",
        "translation": "Holding back violent craving and cherishing, harsh desires and flattery, and lacking conscience and modesty, they're known to be exceptional.",
        "source": "T02n0099_004:0028c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一生二生者，　　一切皆殺害，　無有慈愍心，　　是為領群特。",
        "translation": "Those who are born in one life or two lives and who kill everything and lack compassion are known as the leaders of the herd.",
        "source": "T02n0099_004:0028c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若殺縛椎打，　　聚落及城邑，　無道以切責，　　當知領群特。",
        "translation": "If they kill, bind, beat, and assault people in villages and towns, and if they lack the path to cut off blame, they'll be known as the leader of the herd.",
        "source": "T02n0099_004:0028c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　住止及行路，　　為眾之導首，　苦切諸群下，　　恐怛相迫愶，　取利以供己，　　當知領群特。",
        "translation": "　住止及行路，　　為眾之導首，　苦切諸群下，　　恐怛相迫愶，　取利以供己，　　當知領群特。",
        "source": "T02n0099_004:0028c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聚落及空地，　　有主無主物，　掠護為己有，　　當知領群特。",
        "translation": "He should be known as the leader of the herd when he steals and protects the property of the herd, whether it's owner or not, and takes it for himself.",
        "source": "T02n0099_004:0028c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自棄薄其妻，　　又不入婬舍，　侵陵他所愛，　　當知領群特。",
        "translation": "He abandons his wife and despises her, doesn't enter a house of prostitution, and violates the desires of others, so he's known to lead a group of people.",
        "source": "T02n0099_004:0028c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　內外諸親屬，　　同心善知識，　侵掠彼所受，　　當知領群特。",
        "translation": "He's known to lead a group of people who have internal and external family members who are of the same mind and good friends and who plunder what they receive.",
        "source": "T02n0099_004:0028c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　妄語欺誑人，　　詐取無證財，　他索而不還，　　當知領群特。",
        "translation": "They lie and deceive others, taking unrecognized property that others claim but don't return, which should be known as leading the pack.",
        "source": "T02n0099_004:0028c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為己亦為他，　　舉責及財與，　或復順他語，　　妄語為他證，　如是妄語者，　　當知領群特。",
        "translation": "He gives blame and property for himself and for others, or he conforms to the words of others and speaks falsely for the realization of others, and thus speaks falsely, you should know that he leads the pack.",
        "source": "T02n0099_004:0028c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　作惡不善業，　　無有人知者，　隱諱覆藏惡，　　當知領群特。",
        "translation": "Someone who does bad and unskillful actions that no one knows and who conceals and hides badness should be known as the leader of the pack.",
        "source": "T02n0099_004:0028c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人問其義，　　而答以非義，　顛倒欺誑人，　　當知領群特。",
        "translation": "If someone asks about its meaning and answers with something that's not its meaning, and they mistakenly deceive others, they should be known to lead the pack.",
        "source": "T02n0099_004:0028c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　實空無所有，　　而輕毀智者，　愚癡為利故，　　當知領群特。",
        "translation": "They are truly empty and lacking in existence, but they despise those who know, foolishly acting for profit, which should be known as leading the pack.",
        "source": "T02n0099_004:0028c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　高慢自稱舉，　　毀壞於他人，　是極卑鄙慢，　　當知領群特。",
        "translation": "To hold oneself up as arrogant and despise others is extremely despicable and conceited, and you should know that you're leading the pack.",
        "source": "T02n0099_004:0029a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自造諸過惡，　　移過誣他人，　妄語謗清白，　　當知領群特。",
        "translation": "He creates his own faults, misrepresents others, and speaks falsely about their innocence, which should be known as leading the pack.",
        "source": "T02n0099_004:0029a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　前受他利養，　　他人來詣己，　無有敬報心，　　當知領群特。",
        "translation": "He received benefits from others, and when others come to him, he lacks respect and reward, which should be known as leading the pack.",
        "source": "T02n0099_004:0029a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　沙門婆羅門，　　如法來乞求，　呵責而不與，　　當知領群特。",
        "translation": "When a brāhmaṇa or a brāhmaṇa comes to ask for something according to the teaching and rebukes him but doesn't give it, you should know that you're leading the pack.",
        "source": "T02n0099_004:0029a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若父母年老，　　少壯氣已謝，　不勤加奉養，　　當知領群特。",
        "translation": "If a parent is elderly and their youthful vigor has faded, and they don't diligently provide for them, you should know that they're leading the pack.",
        "source": "T02n0099_004:0029a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　父母諸尊長，　　兄弟親眷屬，　實非阿羅漢，　　自顯羅漢德，　世間之大賊，　　當知領群特。",
        "translation": "If parents, elders, brothers, and relatives who really aren't arhats reveal their own arhatship and are great thieves in the world, you should know that you're leading the pack.",
        "source": "T02n0099_004:0029a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　初上種姓生，　　習婆羅門典，　而於其中間，　　習行諸惡業，　不以勝生故，　　障呵責惡道，　現法受呵責，　　後世墮惡道，　生旃陀羅家，　　世稱須陀夷，　名聞遍天下，　　旃陀羅所無，　婆羅門剎利，　　大姓所供養，　乘於淨天道，　　平等正直住，　不以生處障，　　令不生梵天，　現法善名譽，　　後世生善趣，　二生汝當知，　　如我所顯示，　不以所生故，　　名為領群特。",
        "translation": "Born from the first and highest castes, he practices the Brahman code, but in the interim, he's accustomed to performing bad actions, not because of superior birth, hindering rebuke in the bad path, being rebuked in the present life, falling into a bad path in the latter life, being born into the family of Candra, known in the world as Sudāsi, known throughout the world, not found in Candra, a Brahman-jali, supported by a great family, riding on the pure heavenly path, standing equally and upright, not hindered by birthplace, kept from being born in Brahmā, having good reputation in the present life, born in a good destiny in the latter life, you should know about the two lives, as I've shown, and not because of what's produced is called leading the pack.",
        "source": "T02n0099_004:0029a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不以所生故，　　名為婆羅門，　業為領群特，　　業為婆羅門。」",
        "translation": "Not by virtue of what is produced, it's called a brāhmaṇa, and karma is called leading the pack, and karma is called a brāhmaṇa.\"",
        "source": "T02n0099_004:0029a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門白佛言：「如是大精進，　　如是大牟尼，　不以所生故，　　名為領群特。",
        "translation": "The Brāhmaṇa said to the Buddha, \"Thus great is the effort, thus great is the muni, which is called 'leading the pack' because it's not produced.",
        "source": "T02n0099_004:0029a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不以所生故，　　名為婆羅門，　業故領群特，　　業故婆羅門。」",
        "translation": "It's not because of what's produced that it's called a brāhmaṇa, and it's because of karma that it leads the herd and because of karma that it's a brāhmaṇa.\"",
        "source": "T02n0099_004:0029b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，事火婆羅豆婆遮婆羅門轉得信心，以滿鉢好食奉上世尊。",
        "translation": "The fire-worshipping Bodhisattva Vātsīputrīya Brahman then had faith and presented the Bhagavān with a bowl full of good food.",
        "source": "T02n0099_004:0029b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊不受，以說偈得故，偈如上說。",
        "translation": "The Bhagavān didn't accept it because he had obtained it by speaking a verse, which was as explained above.",
        "source": "T02n0099_004:0029b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，事火婆羅豆婆遮婆羅門見食瑞應已，增其信心，白佛言：「世尊！",
        "translation": "After he saw the food's auspicious response, the fire-wielding Dīpaṃkara Brāhmaṇa increased his faith and said to the Buddha, \"Bhagavān!",
        "source": "T02n0099_004:0029b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今可得為正法、律出家、受具足不？」",
        "translation": "May I now renounce the world and become a fully ordained monk according to the correct dharma and vinaya?\"",
        "source": "T02n0099_004:0029b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「汝今可得於正法、律出家、受具足戒。」",
        "translation": "The Buddha told the Brāhmaṇa, \"Now you can leave home and receive the full set of precepts in accordance with the right teaching and the vinaya.\"",
        "source": "T02n0099_004:0029b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即得出家，獨靜思惟，如前說，乃至得阿羅漢，心善解脫。",
        "translation": "He then left home, reflected quietly and alone as before, and went on to become an arhat, whose mind was well liberated.",
        "source": "T02n0099_004:0029b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅豆婆遮婆羅門得阿羅漢，心善解脫，自覺喜樂，即說偈言：「非道求清淨，　　供養祠祀火，　不識清淨道，　　猶如生盲者。",
        "translation": "At the time, the Brahmadhvaja Brāhmaṇa became an arhat, had a mind well liberated, and felt joyous and happy himself, saying, \"Seeking purity on a path that's not the path, making offerings to a shrine fire, and not knowing the pure path are like being born blind.",
        "source": "T02n0099_004:0029b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今已得安樂，　　出家受具足，　逮得於三明，　　佛所教已作。",
        "translation": "Now, having attained well-being, I've left home and been fully ordained, and I've attained the three insights that the Buddha taught me.",
        "source": "T02n0099_004:0029b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　先婆羅門難，　　今為婆羅門，　沐浴離塵垢，　　度諸天彼岸。」",
        "translation": "Having previously been a Brāhmaṇa, he's now a Brāhmaṇa, cleansed himself of the defilements, and has crossed to the other shore of the heavens.\"",
        "source": "T02n0099_004:0029b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雜阿含經卷第四",
        "translation": "*Saṃyuktâgama-sūtra, Vol. 4",
        "source": "T02n0099_004:0029b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此經此卷，國、宋二本文義全同，皆有十九經，總二十五紙。",
        "translation": "This volume of the sūtra has the same meaning in both the Chinese and Song texts, and both have nineteen sūtras, making a total of twenty-five sheets of paper.",
        "source": "T02n0099_004:0029b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "丹本有十五經，若依宋藏式寫之，可成二十七紙。",
        "translation": "The Dan text has fifteen sūtras, but if it were written according to the Song Canon style, it would make twenty-seven pages.",
        "source": "T02n0099_004:0029b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又其文義與國、宋二本全別，未知去取。",
        "translation": "Moreover, its text and its meaning are completely different from those of the two texts, so I don't know which one to take.",
        "source": "T02n0099_004:0029b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今撿國、宋本經，則下流函中，此經第四十二卷耳。",
        "translation": "When we examine the national and Song texts, we find that this is the forty-second volume of the sūtra in the lower register.",
        "source": "T02n0099_004:0029b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宋藏錯將彼卷重刊于此，為初四卷，國亦仍之者，錯也！",
        "translation": "The Song Canon mistakenly republished that volume here as the first four volumes, and the State also continued it.",
        "source": "T02n0099_004:0029b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故令去彼，取此丹本經焉。",
        "translation": "Therefore, it was ordered to remove them and take this elixir from the original sūtra.",
        "source": "T02n0099_004:0029b28_5",
        "is_bad_quality": false
    }
]