[
    {
        "source_sentence": "別譯雜阿含經卷第十四(丹本第十卷初准)失譯人名今附秦錄（二六九）如是我聞：一時，佛在王舍城耆尼山中。",
        "translation": "Bieyi za ahan jing, vol. 14 (Danben x, vol. 10, choujian), the name of the missing translator is now appended to the Qin records (269) Thus I have heard: One time, the Buddha was in the city of Rājagṛha on Mount Jīni.",
        "source": "T02n0100_014:0468b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一天女，名求迦尼娑，本是波純提女，光色倍常，於其夜中，來詣佛所，威光暉曜，普照此山，悉皆大明，頂禮佛足，在一面坐，即說偈言：「口意宜修善，　　不應作諸惡，　身不以小惡，　　加害於世間。",
        "translation": "A goddess named Kukkaniṣṭha, originally a woman of prasenajit, whose radiance was twice as great as her usual radiance, came to the Buddha in the middle of the night and shone with a radiant light that shone brightly on this mountain and made it all shine brightly. She bowed her head at the Buddha's feet, sat down at one side, and spoke a verse, saying, \"It's better to cultivate goodness in speech and thought than to do evil, and you mustn't do harm to the world with minor evil.",
        "source": "T02n0100_014:0468b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　觀欲空無實，　　修於念覺意，　設自不樂苦，　　莫作損減業。」",
        "translation": "Observing that desires are empty and insubstantial, cultivate mindfulness and awareness; suppose you don't enjoy suffering and don't do anything to diminish it.\"",
        "source": "T02n0100_014:0468c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊讚天曰：「善哉！",
        "translation": "At that point, the Bhagavān praised the gods, \"Good!",
        "source": "T02n0100_014:0468c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T02n0100_014:0468c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說：「『口意宜修善，　　不應作眾惡，　　身不以小惡，　　加害於世間。",
        "translation": "As you said, 'It's better to cultivate goodness in speech and thought than to do numerous evils, and you mustn't do harm to the world with minor evils in body.",
        "source": "T02n0100_014:0468c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　觀欲空無實，　　修於念覺意，　　若自不樂苦，　　莫作損減業。』」",
        "translation": "Contemplate that desires are empty and insubstantial, cultivate mindfulness and awareness, and if you yourself are unhappy and suffering, don't do anything to diminish them.'\"",
        "source": "T02n0100_014:0468c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時波純提女聞佛所說，歡喜頂禮，即於坐沒，還于天宮。",
        "translation": "Upon hearing what the Buddha taught, Pārśantī rejoiced and bowed her head in homage, and then she sank back into her seat and returned to the palace.",
        "source": "T02n0100_014:0468c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二七〇）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was present at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0100_014:0468c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，阿難告諸比丘：「我今欲演四句之法，咸當善受，至心諦聽，憶持莫忘。",
        "translation": "It was then that Ānanda addressed the monks, \"Now, I want to explain four phrases of the teaching, so all of you must accept them well, listen with utmost attention, remember, and don't forget them.",
        "source": "T02n0100_014:0468c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名為演四句法？",
        "translation": "What's called expounding the four phrases of the teaching?",
        "source": "T02n0100_014:0468c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「口意宜修善，　　不應作諸惡，　身不以小惡，　　加害於世間。",
        "translation": "\"It's better to cultivate goodness in speech and thought than to do evil, and not to inflict harm on the world with minor evil in body.",
        "source": "T02n0100_014:0468c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　觀欲空無實，　　修於念覺意，　若自不樂苦，　　莫作損減業。」",
        "translation": "Observing that desires are empty and insubstantial, cultivate mindfulness and awareness; if you yourself are unhappy and suffering, don't do anything to diminish them.\"",
        "source": "T02n0100_014:0468c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一婆羅門，去阿難不遠，聞說斯偈，即便思惟：「如此偈義，義味深遠，非是人作，必是非人之所宣說，當往問佛。」",
        "translation": "Then, a Brāhmaṇa, not far from Ānanda, heard this verse spoken and even thought, \"This verse's meaning is so profound that it wasn't written by a human being; it must have been taught by a non-human being; I should go ask the Buddha about it.\"",
        "source": "T02n0100_014:0468c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，時，婆羅門即詣佛所，問訊已訖，在一面坐，白佛言：「瞿曇！",
        "translation": "After this thought, the Brāhmaṇa went to the Buddha, finished his inquiry, sat down at one side, and said to the Buddha, \"Gautama!",
        "source": "T02n0100_014:0468c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從阿難聞說此偈，如我思惟，此偈句義，非人所作。」",
        "translation": "I heard this verse from Ānanda, and as I considered it, the meaning of this verse is not made by human hands.\"",
        "source": "T02n0100_014:0468c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告婆羅門：「實爾！",
        "translation": "The Buddha told the Brāhmaṇa, \"Indeed!",
        "source": "T02n0100_014:0468c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實爾！",
        "translation": "true!",
        "source": "T02n0100_014:0468c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實是非人之所宣說，非人所造。",
        "translation": "\"It's really something that's not explained by humans and not created by humans.",
        "source": "T02n0100_014:0468c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於往時，在王舍城耆尼山中，求迦尼娑天女來詣我所，頂禮我已，在一面坐，即說斯偈。",
        "translation": "Once upon a time, I was in the city of Rājagṛha on Mount Jīvaka when the goddess Kakkaniṣka came to me, paid homage to me, sat down at one side, and spoke this verse.",
        "source": "T02n0100_014:0468c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而斯偈者，實非人說。」",
        "translation": "That verse was really not spoken by a human being.\"",
        "source": "T02n0100_014:0469a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門聞佛所說，歡喜而去。",
        "translation": "The Brāhmaṇa then heard what the Buddha taught, rejoiced, and departed.",
        "source": "T02n0100_014:0469a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二七一）如是我聞：一時，佛在王舍城耆尼山中。",
        "translation": "(271) Thus I have heard: One time, the Buddha was in the city of Rājagṛha on Mount Jīni.",
        "source": "T02n0100_014:0469a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時求迦尼娑天，本是波純提女，身光晃曜，猶如電光。",
        "translation": "He was seeking the Kaniṣka goddess, who was originally a prasenajit woman with a body that shone like a flash of lightning.",
        "source": "T02n0100_014:0469a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淳誠至信，歸依三寶，來詣佛所，在一面坐，以此光明，普照此山，悉皆洞然。",
        "translation": "She was sincere and faithful, revered the Three Treasures, came to the Buddha, sat down on one side, and shone this light universally on this mountain, making it clear to everyone.",
        "source": "T02n0100_014:0469a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "求迦尼娑天女即說偈言：「我今以種種，　　讚詠佛法僧，　今但略宣說，　　隨意所樂足。",
        "translation": "The goddess Sukaniṣṭha then spoke a verse, saying, \"Now, I've praised the Buddha, Dharma, and Saṃgha in various ways, but I'll just explain it briefly, so I can fulfill it as I like.",
        "source": "T02n0100_014:0469a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　口意宜修善，　　不應造眾惡，　身不以小過，　　加害於世間。",
        "translation": "It's better to cultivate goodness in speech and thought than to do evil, and I won't inflict harm on the world with minor faults.",
        "source": "T02n0100_014:0469a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　觀欲性相空，　　修於念覺意，　若自不樂苦，　　莫作損減業。」",
        "translation": "He observes the emptiness of the nature and marks of desire, cultivates mindfulness, and cultivates the awareness that if he doesn't enjoy suffering, he mustn't do anything to diminish it.\"",
        "source": "T02n0100_014:0469a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告天女言：「如是！",
        "translation": "It was then that the Bhagavān addressed the goddess, \"So it is!",
        "source": "T02n0100_014:0469a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T02n0100_014:0469a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。」",
        "translation": "As you've said.\"",
        "source": "T02n0100_014:0469a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "求迦尼天女聞佛說已，歡喜頂禮，於此處沒，還於天宮。",
        "translation": "After hearing what the Buddha taught, the Sukhāṇi goddess rejoiced and bowed her head in prostration, surrendered here, and returned to her palace in heaven.",
        "source": "T02n0100_014:0469a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二七二）如是我聞：一時，佛在毘舍離北獼猴彼岸精舍之中。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at the monkey's quarters on the other side of Vaiśālī.",
        "source": "T02n0100_014:0469a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時波純提天女、拙羅天女，光色倍常，往詣佛所，頂禮佛足，在一面坐。",
        "translation": "The goddess Prasenajit and the goddess Jambudvīpa, whose radiance was twice as brilliant as usual, went to the Buddha, bowed their heads at his feet, and sat down at one side.",
        "source": "T02n0100_014:0469a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時此二天女放大光明，遍照獼猴及毘舍離，悉皆大明。",
        "translation": "These two goddesses then magnified their light and shone brightly throughout the monkeys and Vaiśālī, making them all very bright.",
        "source": "T02n0100_014:0469a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時拙羅天女即說偈言：「世尊婆伽婆，　　無上等正覺，　在於毘舍離，　　住於大林中。",
        "translation": "The goddess Qiqieluo then spoke a verse, saying, \"The Bhagavān, the unsurpassed, perfectly enlightened one, is here in Vaiśālī, living in a great forest.",
        "source": "T02n0100_014:0469a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　求迦尼娑天，　　并及於拙羅，　波純提女等，　　稽首尊足下。",
        "translation": "The god Kaniṣka, the goddess Kauṇḍinya, the goddess Prasenajit, and others bow at the feet of the honored one.",
        "source": "T02n0100_014:0469a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我往昔曾聞，　　能善稱說法，　牟尼世尊者，　　今現在演說。",
        "translation": "I've heard in the past that he's a teacher of the Dharma who's well known, the World Honored Muni, and now he's speaking.",
        "source": "T02n0100_014:0469a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸有生譏毀，　　如斯深法者，　是則名愚癡，　　後必墮惡趣。",
        "translation": "All sentient beings who denigrate such a profound teaching are called foolish, and they'll surely fall into a bad destiny later.",
        "source": "T02n0100_014:0469a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有能讚聖法，　　成就具於念，　是名有智者，　　後必生善處。」",
        "translation": "Someone who praises the noble teaching and accomplishes it with mindfulness is called someone with wisdom who will surely be born in a good place later.\"",
        "source": "T02n0100_014:0469b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時求迦尼娑天女復說偈言：「口意宜修善，　　不應造眾惡，　身不以小惡，　　加害於世間。",
        "translation": "The goddess Kauṇḍinya then spoke another verse, \"It's better to cultivate goodness in speech and thought than to do numerous evils, and you mustn't do harm to the world with minor evils in body.",
        "source": "T02n0100_014:0469b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　觀欲性相空，　　修於念覺意，　若自不樂苦，　　莫作損減業。」",
        "translation": "He observes the emptiness of the nature and marks of desire, cultivates mindfulness and awareness, and doesn't do anything to diminish or impair his own discomfort or suffering.\"",
        "source": "T02n0100_014:0469b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告天女言：「如是！",
        "translation": "It was then that the Bhagavān addressed the goddess, \"So it is!",
        "source": "T02n0100_014:0469b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T02n0100_014:0469b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。」",
        "translation": "As you've said.\"",
        "source": "T02n0100_014:0469b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時天女等聞佛說已，歡喜而去。",
        "translation": "After hearing what the Buddha taught, the goddesses rejoiced and departed.",
        "source": "T02n0100_014:0469b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二七三）如是我聞：一時佛在舍衛國祇樹給孤獨園。",
        "translation": "(273) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0100_014:0469b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，於其夜中，來詣佛所，威光大明，遍照祇洹，頂禮既已，退坐一面，而說偈言：「不觸者勿觸，　　觸者必還報，　以如是事故，　　不應妄有觸。",
        "translation": "One day, in the middle of the night, he came to the Buddha, and his majestic light shone brightly all over Jīvain. After prostrating himself, he withdrew to sit at one side and spoke a verse, saying, \"Don't touch what you don't want to touch, for it will surely be returned, and because of such an event, you shouldn't touch it falsely.",
        "source": "T02n0100_014:0469b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若非津濟處，　　不應作渡意。」",
        "translation": "If it's not a place of relief, you shouldn't intend to cross over.\"",
        "source": "T02n0100_014:0469b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「可瞋而不瞋，　　清淨無結使，　若欲惡加彼，　　惡便及己身。",
        "translation": "The Bhagavān then replied with a verse, \"Do not get angry even though it's possible to get angry, for it's pure and free of bondage. If you want to inflict evil on them, that evil will then reach you.",
        "source": "T02n0100_014:0469b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如逆風揚土，　　塵來自坌身，　欲以瞋加彼，　　彼受必還報。",
        "translation": "Like when a contrary wind lifts up dirt, dust comes from its own body, and when you want to inflict anger on another, that person will surely receive its own retribution.",
        "source": "T02n0100_014:0469b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是二竝名惡，　　兩俱不脫患，　若瞋不加報，　　能伏於大怨。」",
        "translation": "These are both called evils, and neither is free from trouble; if anger isn't meted out as retribution, it can subdue a great enemy.\"",
        "source": "T02n0100_014:0469b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，天復以偈讚言：「往昔已曾見，　　婆羅門涅槃，　久棄捨嫌怖，　　能度世間愛。」",
        "translation": "The god then also praised him in a verse, saying, \"I've seen it before, the Brahman's nirvāṇa, abandoning hostility long ago and capable of overcoming worldly cravings.\"",
        "source": "T02n0100_014:0469b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜而去。",
        "translation": "After speaking this verse, the god then rejoiced and departed.",
        "source": "T02n0100_014:0469b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二七四）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada's Park in Jeta's Grove in Śrāvastī.",
        "source": "T02n0100_014:0469b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，光顏熾盛，容色殊常，來詣佛所，頂禮佛足，在一面坐，而說偈言：「孾愚少智者，　　造於諸惡業，　為已自作怨，　　後受大苦報。」",
        "translation": "One day, his radiant face blazing with extraordinary appearance, he came to the Buddha, bowed his head at his feet, sat down at one side, and spoke a verse, saying, \"Unhappy foolish people with little wisdom create bad actions, create enemies for themselves, and then receive great painful consequences.\"",
        "source": "T02n0100_014:0469b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「所作業不善，　　作已自燒煮，　愚癡造眾惡，　　受報悲啼哭。」",
        "translation": "The Bhagavān then replied with a verse, \"Their actions are unwholesome, they burn themselves after doing them, and their foolishness creates many evils that bring the results of lamentation.\"",
        "source": "T02n0100_014:0469c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚言：「往昔已曾見，　　婆羅門涅槃，　久棄捨嫌怖，　　能度世間愛。」",
        "translation": "Again, the gods praised him in a verse, saying, \"I've seen it before, the Brahman's nirvāṇa, abandoning long ago dislikes and fears, and I was able to end worldly cravings.\"",
        "source": "T02n0100_014:0469c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜頂禮，還于天宮。",
        "translation": "After speaking this verse, the god saluted him with joy and returned to the celestial palace.",
        "source": "T02n0100_014:0469c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二七五）如是我聞：一時佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0100_014:0469c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，威容光赫，顏色殊常，來詣佛所，既頂禮已，退坐一面，而說偈言：「不以言說故，　　得名為沙門，　此實趣向道，　　成就堅履跡。",
        "translation": "One day, a man of brilliant appearance and unusual color, came to the Buddha, paid homage, withdrew to sit at one side, and spoke a verse, saying, \"It's not because of what they say that they've attained the title of ascetic, but they're really headed for the path and have accomplished the surefootedness of their steps.",
        "source": "T02n0100_014:0469c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有勇健者，　　能深修禪定，　獲得於解脫，　　壞於魔結縛。",
        "translation": "If there's a courageous person who deeply cultivates meditation, they attain liberation and break the bonds of Māra.",
        "source": "T02n0100_014:0469c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　作及不作業，　　二俱稱實說，　詐偽無誠信，　　智者所棄捐。",
        "translation": "Both those who do and don't do activities are described as genuine, and those who are deceptive and lack sincerity are discarded by wise men.",
        "source": "T02n0100_014:0469c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　己身實無得，　　虛讚以自憍，　詐偽虛誑說，　　世間之大賊。」",
        "translation": "He really hasn't attained anything in himself, falsely praises himself as arrogant, and fraudulently and falsely explains himself as the world's great thief.\"",
        "source": "T02n0100_014:0469c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「不顯己功德，　　不知他心行，　知已復涅槃，　　能度世間愛。」",
        "translation": "The Bhagavān then replied with a verse, \"Not revealing their own merits and not knowing the actions of others' minds, they know that they're once again in nirvāṇa and can save the world's love.\"",
        "source": "T02n0100_014:0469c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天聞佛偈已，而白佛言：「我於今者，實有罪過，唯願聽我誠心懺悔。」",
        "translation": "After this god heard the Buddha's verse, he said to the Buddha, \"Now, I've really committed a sin, so please listen to my sincere repentance.\"",
        "source": "T02n0100_014:0469c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時佛默然。",
        "translation": "The Buddha then remained silent.",
        "source": "T02n0100_014:0469c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復說偈言：「我今說罪悔，　　汝不受我悔，　懷惡心不善，　　不捨於怨嫌。」",
        "translation": "The god then again spoke a verse, saying, \"Now, I've told you about repenting your sins, but you won't accept my repentance; you harbor evil thoughts and are unwholesome; you won't abandon enmity.\"",
        "source": "T02n0100_014:0469c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊以偈復答天曰：「說罪言懺悔，　　內心實不滅，　云何除嫌隟？",
        "translation": "The Bhagavān answered the gods again in verse, \"How can you remove enmity when you say you repent of sins but your inner mind really doesn't cease?",
        "source": "T02n0100_014:0469c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何而得善？」",
        "translation": "How can it be good?\"",
        "source": "T02n0100_014:0470a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天又說偈重問曰：「人誰無愆過？",
        "translation": "Again, the gods spoke a verse and repeated the question, \"Who among us is without fault?",
        "source": "T02n0100_014:0470a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　人誰無誤失？",
        "translation": "Who among men is without error?",
        "source": "T02n0100_014:0470a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　何誰離愚癡？",
        "translation": "\"Who is free of folly?",
        "source": "T02n0100_014:0470a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　何誰常具念？」",
        "translation": "Who is always fully mindful?\"",
        "source": "T02n0100_014:0470a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「如來婆伽婆，　　正智得解脫，　彼無諸愆過，　　亦復無得失，　彼已離愚癡，　　能具於正念。」",
        "translation": "The Bhagavān then answered in a verse, \"Thus has the Bhagavān attained liberation by correct knowledge, has no faults, and has no losses or gains, is free of folly, and is able to be correctly mindful.\"",
        "source": "T02n0100_014:0470a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚言：「我昔已曾見，　　婆羅門涅槃，　久棄捨嫌怖，　　能度世間愛。」",
        "translation": "Again, the gods praised them in a verse, saying, \"I've seen it before, Brahman Nirvāṇa, long ago, abandoning resentment and fear, able to end worldly cravings.\"",
        "source": "T02n0100_014:0470a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜而去。",
        "translation": "After speaking this verse, the god departed, rejoicing.",
        "source": "T02n0100_014:0470a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二七六）如是我聞：一時，佛在王舍城迦蘭陀竹林。",
        "translation": "（Thus I have heard: One time, the Buddha was present in the Kalandaka Bamboo Grove of Rājagṛha.",
        "source": "T02n0100_014:0470a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，提婆達多友瞿迦梨，往詣佛所，在一面立。",
        "translation": "At the time, Gokulika, a friend of Devadatta, went to the Buddha and stood to one side.",
        "source": "T02n0100_014:0470a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告瞿迦梨：「汝於舍利弗有緣，莫生嫌想。",
        "translation": "The Buddha told Kokālika, \"Don't become suspicious of Śāriputra for having a relationship with him.",
        "source": "T02n0100_014:0470a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗、目連淨修梵行，心意柔軟，汝莫生嫌恨，長夜受諸苦惱。」",
        "translation": "Śāriputra and Maudgalyāyana are pure in their religious practices and gentle in their minds, so don't become hostile and suffer long nights of suffering and distress.\"",
        "source": "T02n0100_014:0470a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞿迦梨言：「我信佛語，我隨於佛，然舍利弗、目連實有惡欲，惡欲於彼，實得自在，彼隨惡欲。」",
        "translation": "Kokālika said, \"I believe the Buddha's words and I follow him, but Śāriputra and Maudgalyāyana really have bad desires, and those bad desires really do get their way, and they follow them.\"",
        "source": "T02n0100_014:0470a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告瞿迦梨：「汝今勿於彼二人所，生嫌恨心。」",
        "translation": "The Buddha again told Kokālika, \"Now, don't become hostile toward those two people.\"",
        "source": "T02n0100_014:0470a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是至三。",
        "translation": "So it was up to three times.",
        "source": "T02n0100_014:0470a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而瞿迦梨雖聞佛言，惡心不改，捨佛而去。",
        "translation": "Although Kokālika heard the Buddha's words, his evil thoughts didn't change, and he abandoned the Buddha and departed.",
        "source": "T02n0100_014:0470a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去佛不遠，身生惡瘡，初如芥子，須臾之頃，猶如豆許，復漸長大，如毘梨果，身體爛潰，膿血流出，身壞命終，墮大蓮華地獄。",
        "translation": "Not long after he left the Buddha, a bad sore arose on his body that was at first like a mustard seed but in a moment was like a pea or so and gradually grew larger like a pearly fruit, rotted his body, spilled pus and blood, and broke down when his life ended and he fell into the great lotus hell.",
        "source": "T02n0100_014:0470a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有三天，光色倍常，於其夜中，來至佛所，頂禮佛足，在一面立。",
        "translation": "Three days later, his radiance was twice as brilliant as usual, and in the middle of the night, he came to the Buddha, bowed his head at his feet, and stood to one side.",
        "source": "T02n0100_014:0470a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一天白佛言：「世尊！",
        "translation": "The first day, he said to the Buddha, \"Bhagavān!",
        "source": "T02n0100_014:0470a26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞿迦梨是夜命終。」",
        "translation": "Gokulika's life ended that night.\"",
        "source": "T02n0100_014:0470a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二天言：「墮大蓮華地獄。」",
        "translation": "The second heavenly being said, \"I'll fall into the great lotus hell.\"",
        "source": "T02n0100_014:0470a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三天即說偈言：「夫人生世，　　斧在口中，　　由其惡言，　自斬其身。",
        "translation": "The third celestial then spoke a verse, saying, \"A woman is born into this world with an ax in her mouth, and because of her harsh words, she cuts herself off.",
        "source": "T02n0100_014:0470a28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　應讚而毀，　　應毀而讚，　口出綺語，　　後受苦殃。",
        "translation": "She praises what should be praised and disparages what should be praised, and she speaks fancy words that bring pain and suffering later.",
        "source": "T02n0100_014:0470b01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　綺語奪財，　是故小過，　　謗佛聖賢，　　是名大患。",
        "translation": "Plundering possessions with fancy speech is a minor misdeed, but praising the Buddha and noble people is a major misfortune.",
        "source": "T02n0100_014:0470b02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　受苦長遠，　　具滿百千，　　入尼羅浮，　及三十六，　　入阿浮陀，　　乃至墮彼，　五阿浮陀。",
        "translation": "They'll experience pain for a long time, reaching a hundred thousand, entering the hell of the nirvāṇas and thirty-six, entering arbuda, and even falling into the five arbuda there.",
        "source": "T02n0100_014:0470b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　誹謗賢聖，　　口意造惡，　入斯地獄。」",
        "translation": "They denigrate the good and the noble, and they create evil with their words and thoughts, which brings them to this hell.\"",
        "source": "T02n0100_014:0470b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼三天禮佛足已，還於天宮。",
        "translation": "Three of those monks then bowed their heads at the Buddha's feet and returned to the palace in heaven.",
        "source": "T02n0100_014:0470b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告諸比丘：「汝等欲聞彼阿浮陀地獄壽命長短以不？」",
        "translation": "It was then that the Buddha addressed the monks, \"Do you want to hear about the length of life in that avatar's hell?\"",
        "source": "T02n0100_014:0470b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘白言：「願為我說，我等聞已，信受憶持。」",
        "translation": "The monks said, \"Please explain this for me, and after we hear it, we'll believe it and memorize it.\"",
        "source": "T02n0100_014:0470b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「二十佉利胡麻得波羅捺，滿溢一車，有長壽人，足滿百年取其一粒，如是胡麻一切都盡，此阿浮陀地獄所得壽命，猶故未盡。",
        "translation": "It was then that the Bhagavān addressed the monks, \"Twenty khāriyas of sesame can overflow a chariot, and there's a man with a long life who takes a grain of it for a full hundred years, so while all of this sesame is exhausted, the life span gained in this avatar's hell is still not exhausted.",
        "source": "T02n0100_014:0470b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此二十阿浮陀觝，成一尼羅浮陀。",
        "translation": "These twenty arbuda sticks make up one nīlotpada.",
        "source": "T02n0100_014:0470b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十尼羅浮陀觝，一呵吒吒。",
        "translation": "From these twenty nirarbuda sticks, there's one haṭṭa.",
        "source": "T02n0100_014:0470b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十呵吒吒觝，一睺睺。",
        "translation": "From these twenty arbuda resistances, there's one hohoru.",
        "source": "T02n0100_014:0470b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十睺睺觝，一蓮華地獄。",
        "translation": "From these twenty arbuda resistances, there's one lotus hell.",
        "source": "T02n0100_014:0470b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十蓮華地獄觝，一大蓮華地獄。",
        "translation": "Twenty lotus hells resist, and one large lotus hell resists.",
        "source": "T02n0100_014:0470b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞿迦梨比丘以謗舍利弗、目連故，墮是大蓮華地獄中。」",
        "translation": "That monk Gokulika fell into this great lotus-flower hell because he denigrated Śāriputra and Maudgalyāyana.\"",
        "source": "T02n0100_014:0470b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「被燒燋柱，尚不應謗，況情識類。」",
        "translation": "The Buddha told the monks, \"You shouldn't denigrate a burning pillar, so why wouldn't you denigrate a category of sentient beings?\"",
        "source": "T02n0100_014:0470b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說是已，諸比丘聞佛所說，歡喜奉行。",
        "translation": "After the Buddha said this, the monks who heard what he taught rejoiced and handed it down.",
        "source": "T02n0100_014:0470b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二七七）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0100_014:0470b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，光色倍常，威顏晃曜，遍照祇洹，來詣頂禮，退坐一面，而說偈言：「云何輕賤他，　　及不輕賤他？",
        "translation": "One day, his radiance was twice as brilliant as usual, and his dignified countenance shone brightly as he illuminated Jeta. He paid homage to him, withdrew to sit at one side, and spoke in verse, saying, \"How do you despise others and not despise others?",
        "source": "T02n0100_014:0470b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為他所輕賤，　　以何為首目？",
        "translation": "What should be the first title of someone who despises you?",
        "source": "T02n0100_014:0470b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今問如來，　　大仙為我說。」",
        "translation": "Now, I've asked the Tathāgata about this, and the great sage has explained it for me.\"",
        "source": "T02n0100_014:0470b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「善知不輕賤，　　不知名輕賤。",
        "translation": "The Bhagavān then answered in a verse, \"Well know that you're not despised, and you don't know that you're despised.",
        "source": "T02n0100_014:0470b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　樂法名恭敬，　　慢法名不恭。",
        "translation": "Being pleased with the teaching is called respectful, and being proud of the teaching is called disrespectful.",
        "source": "T02n0100_014:0470b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不近善知識，　　是名不敬首。",
        "translation": "Not approaching a good teacher is called being the head of disrespect.",
        "source": "T02n0100_014:0470c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　樂行於非法，　　親友生怨嫉。",
        "translation": "They are comfortable practicing what's not the Dharma and become hostile to their friends and relatives.",
        "source": "T02n0100_014:0470c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　與怨為親友，　　是為不敬首。",
        "translation": "To be friends with someone who hates you is considered the chief of disrespect.",
        "source": "T02n0100_014:0470c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如有婦女人，　　履行不貞良，　好與姦婬通，　　作於無理行，　男子違禮度，　　其義亦復然，　如是等名為，　　輕賤之元首。",
        "translation": "Suppose there's a woman who's unchaste in her ways, who likes to commit adultery and sexual intercourse, who does unreasonable acts, and a man who disobeys the rules of propriety, and so on, such are called despicable leaders.",
        "source": "T02n0100_014:0470c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　斗秤欺誑人，　　巧偽不均平，　苟且懷貪利，　　是名輕賤首。",
        "translation": "They deceive people with their scales, are clever and counterfeit, aren't evenly matched, and lust for profit, which is called the head of despicable people.",
        "source": "T02n0100_014:0470c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　博弈相侵欺，　　損喪錢財盡，　如是等名為，　　輕賤之首目。",
        "translation": "To play at each other's expense and deceive each other, to lose money and property is exhausted, and such is called the head of a despicable class.",
        "source": "T02n0100_014:0470c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　嗜睡著美味，　　早眠而晚起，　懈怠於事務，　　而復憙瞋恚，　如斯之等人，　　亦名輕賤首。",
        "translation": "Someone who lusts after delicious foods, sleeps early and rises late, becomes lazy in their work, and becomes angry, such a person is also called a despicable leader.",
        "source": "T02n0100_014:0470c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　耳璫及鐶釧，　　擎蓋錦屣履，　貧窮自嚴飾，　　是名輕賤首。",
        "translation": "A man with earrings and a ring-ring, a brocade hood and footwear, and a poor man who adorns himself is called a humble head.",
        "source": "T02n0100_014:0470c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　財物既尠少，　　愛著情愈濃，　雖生剎利種，　　冀求得王位，　如是愚癡人，　　是名輕賤首。",
        "translation": "Even though his possessions are few, his attachment grows stronger, and even though he's born from the bhadra seed, he hopes to attain the position of king. Such a foolish man is called a despicable leader.",
        "source": "T02n0100_014:0470c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　財寶其業大，　　多眷屬親友，　自食於美味，　　不分施與他，　受他好飲食，　　及得財寶利，　彼來至己家，　　都無報答心，　乃至不與食，　　是名輕賤首。",
        "translation": "Their wealth and property are great, and they have many dependents and friends who feed themselves on delicious foods and don't share them with others. Accepting the good food of others and reaping the benefits of their wealth and property, they come to their house with no intention of repaying them, and they don't even give them food, which is called the lowest of the low.",
        "source": "T02n0100_014:0470c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　父母年朽邁，　　衰老既至已，　自食於甘美，　　終不知供養，　如斯之等人，　　是名輕賤首。",
        "translation": "When their parents are elderly and have grown senile, they feed themselves on the good things they enjoy and never know how to provide for them, and such a person is called a lowly leader.",
        "source": "T02n0100_014:0470c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　父母及兄弟，　　親屬并姊妹，　打罵出惡言，　　是名輕賤首。",
        "translation": "When parents, brothers, relatives, and sisters scold and speak harshly, this is called a despicable head.",
        "source": "T02n0100_014:0470c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　沙門婆羅門，　　中時來至家，　不請不施食，　　是名輕賤首。",
        "translation": "A brāhmaṇa or a brāhmaṇa who comes to his home at midday and doesn't ask for or give food is called a despicable leader.",
        "source": "T02n0100_014:0471a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　沙門婆羅門，　　及貧窮乞匃，　罵辱不施食，　　是名輕賤首。",
        "translation": "That ascetic, brāhmaṇa, or poor beggar who insults and doesn't give food is called a lowly leader.",
        "source": "T02n0100_014:0471a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　謗佛及聲聞，　　出家在家人，　為此非法事，　　是名輕賤首。",
        "translation": "To denigrate buddhas and śrāvakas, renunciant practitioners, and laypeople for doing such unlawful things is called a lowly leader.",
        "source": "T02n0100_014:0471a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　實非是羅漢，　　自稱是羅漢，　天人婆羅門，　　沙門中大賊，　若為如是者，　　是名輕賤首。",
        "translation": "If they really aren't arhats but claim to be arhats, gods, humans, brāhmaṇas, or great thieves among ascetics, if they do such things, this is called a despicable leader.",
        "source": "T02n0100_014:0471a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如斯之等類，　　為他所輕賤，　世間可輕賤，　　我悉知見之，　宜應遠捨離，　　如怖畏嶮道。」",
        "translation": "Such a person would be despised by others, despised by the world, and I know and see them all; they should be avoided like the fearful, dangerous path.\"",
        "source": "T02n0100_014:0471a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚言：「我昔已曾見，　　婆羅門涅槃，　久棄捨嫌怖，　　能度世間愛。」",
        "translation": "The god then praised them in a verse, saying, \"I've seen it before, the Brahman's nirvāṇa, long abandoned and free from dislike and fear, and I was able to end worldly cravings.\"",
        "source": "T02n0100_014:0471a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜而去。",
        "translation": "After speaking this verse, the god rejoiced and departed.",
        "source": "T02n0100_014:0471a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二七八）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0100_014:0471a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，顏容暉赫，光色甚明，遍于祇洹，來詣佛所，頂禮足已，退坐一面，而說偈言：「誰名為敬順？",
        "translation": "One day, a radiant-looking, brilliantly shining god who had spread out over Jeta came to the Buddha, bowed his head at his feet, withdrew to sit at one side, and spoke in verse, saying, \"Who's called venerable and obedient?",
        "source": "T02n0100_014:0471a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　誰名為陵邈？",
        "translation": "Who is called Lengmiao?",
        "source": "T02n0100_014:0471a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　誰為孾愚戲，　　如小兒弄土？」",
        "translation": "Who is it that foolishly plays with the coffin like a child playing with dirt?\"",
        "source": "T02n0100_014:0471a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「男子若敬順，　　女人必陵邈。",
        "translation": "The Bhagavān then answered in a verse, \"If a man is respectful and obedient, a woman will be humbled.",
        "source": "T02n0100_014:0471a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　男子若陵邈，　　女人必敬順。",
        "translation": "If a man is humbled, a woman will respect and obey him.",
        "source": "T02n0100_014:0471a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　女人孾愚戲，　　如小兒弄土。」",
        "translation": "A woman's foolish play is like a small child messing with dirt.\"",
        "source": "T02n0100_014:0471a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚言：「我昔已曾見，　　婆羅門涅槃，　久棄捨嫌怖，　　能度世間愛。」",
        "translation": "The god also praised him in a verse, saying, \"I've seen it before, Brahman's nirvāṇa, long ago, abandoning hostility and fear, and I was able to end worldly cravings.\"",
        "source": "T02n0100_014:0471a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜還宮。",
        "translation": "After speaking this verse, the god then rejoiced and returned to the palace.",
        "source": "T02n0100_014:0471a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二七九）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(279) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0100_014:0471b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，身光晃曜，猶如電光，遍照祇洹，赫然甚明，來詣佛所，頂禮足已，退坐一面，而說偈言：「覺觀意欲來，　　遮止應遮止，　一切盡遮止，　　不造生死塵。」",
        "translation": "One day, a shining light like a flash of lightning shone brightly all over Jeta, and he came to the Buddha, bowed his head at his feet, withdrew to sit at one side, and spoke a verse, saying, \"He perceives his intention to come, calms it down, calms it down completely, and doesn't create the dust of birth-and-death.\"",
        "source": "T02n0100_014:0471b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「覺觀意欲來，　　遮止應遮止，　不應一切遮，　　但遮惡覺觀。",
        "translation": "The Bhagavān then replied with a verse, \"Perception and contemplation are intended to come, and they should be checked and stopped, not all of them, but only bad perception and contemplation.",
        "source": "T02n0100_014:0471b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　惡惡應遮止，　　遮止能遮止，　若能如是者，　　不為生死遮。」",
        "translation": "Evil should be checked, and check and suppress should be possible; if someone can thus check and suppress, they won't be checked by birth-and-death.\"",
        "source": "T02n0100_014:0471b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚言：「我昔已曾見，　　婆羅門涅槃，　久棄捨嫌怖，　　能度世間愛。」",
        "translation": "Again, the god praised him in a verse, saying, \"I've seen it before, Brahman's nirvāṇa, abandoning long ago dislikes and fears, and I was able to end worldly cravings.\"",
        "source": "T02n0100_014:0471b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜還宮。",
        "translation": "After speaking this verse, the god then rejoiced and returned to the palace.",
        "source": "T02n0100_014:0471b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二八〇）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0100_014:0471b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，身光晃曜，遍照祇洹，來詣佛所，禮佛足已，退坐一面，而說偈言：「云何得名稱？",
        "translation": "One day, a shining body shone brightly all over Jeta, and he came to the Buddha, bowed his feet, withdrew to sit at one side, and spoke in verse, saying, \"How did he get his name?",
        "source": "T02n0100_014:0471b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何得財業？",
        "translation": "How do we get wealthy karma?",
        "source": "T02n0100_014:0471b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何得稱譽？",
        "translation": "How can it be praised?",
        "source": "T02n0100_014:0471b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何得親友？」",
        "translation": "How can I become a close friend?\"",
        "source": "T02n0100_014:0471b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「持戒得名稱，　　布施得財寶，　實語得稱譽，　　普施眾皆親。」",
        "translation": "The Bhagavān then answered with a verse, \"Observing precepts obtains fame, generosity obtains treasure, true speech obtains renown, and universal giving is dear to all.\"",
        "source": "T02n0100_014:0471b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚言：「我昔已曾見，　　婆羅門涅槃，　久棄捨嫌怖，　　能度世間愛。」",
        "translation": "Again, the gods praised him in a verse, saying, \"I've seen it before, the Brahman's nirvāṇa, abandoning long ago dislikes and fears, and I was able to end worldly cravings.\"",
        "source": "T02n0100_014:0471b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜還宮。",
        "translation": "After speaking this verse, the god then rejoiced and returned to the palace.",
        "source": "T02n0100_014:0471b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二八一）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(281) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0100_014:0471b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，光顏晃曜，赫然甚明，遍于祇洹，來詣佛所，頂禮佛足，退坐一面，而說偈言：「云何生為人，　　如見極明了，　集諸財寶利，　　多少義云何？」",
        "translation": "One day, a shining, brilliant, and brilliantly shining god appeared all over Jeta, approached the Buddha, bowed his head at his feet, withdrew to sit at one side, and spoke a verse, saying, \"How are you born a human being who sees with the utmost clarity and gathers wealth and benefits, and how much do they mean?\"",
        "source": "T02n0100_014:0471b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「先學眾技能，　　次集諸財寶，　集財為四分，　　一分供衣食，　二分營作事，　　一分俟匱乏。",
        "translation": "The Bhagavān then answered in a verse, \"First, they train in the skills of many people, then they gather treasure. They gather treasure in four parts, one part for clothing and food, two parts for work, and one part for want.",
        "source": "T02n0100_014:0471c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　種田是初業，　　商估是為次，　蕃息養牛群，　　羔羊并六畜。",
        "translation": "This is the first activity of planting seeds, followed by commerce and valuation, raising herds of cattle for prosperity, and lambs and six animals.",
        "source": "T02n0100_014:0471c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復有諸子息，　　各為求妻婦，　出女并姊妹，　　及六畜家法，　調和得利樂，　　不和得苦惱。",
        "translation": "\"Furthermore, suppose there are sons and daughters who seek wives, produce daughters and sisters, and the laws of their homes with six animals, so that harmony brings benefit and joy, and disharmony brings suffering and distress.",
        "source": "T02n0100_014:0471c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　作事令終訖，　　終不中休廢，　智者善思惟，　　深知於得失。",
        "translation": "Making tasks end, never resting in the middle, a wise man well considers them and deeply understands gain and loss.",
        "source": "T02n0100_014:0471c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善解作不作，　　財寶來趣己，　如河歸大海，　　勤修於事業。",
        "translation": "He well understands doing and not doing, and his wealth and treasure come to him like a river returning to the ocean, diligently cultivating his work.",
        "source": "T02n0100_014:0471c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如蜂採眾華，　　日日常增長，　晝夜聚財業，　　如彼蜂增長。",
        "translation": "Like a bee picking flowers, it grows daily, gathering wealth and activity by day and night, just like that bee grows.",
        "source": "T02n0100_014:0471c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　財不寄老朽，　　不與邊遠人，　惡人作鄙業，　　勢力勝己者，　終不以財寶，　　與如是等人。",
        "translation": "He doesn't trust his wealth to old age, doesn't do despicable deeds with remote people or bad people, and has more power than himself, but he never gives his wealth to such a person.",
        "source": "T02n0100_014:0471c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　與財為親厚，　　債索時忿諍，　怪哉財義利，　　失財失親友。",
        "translation": "Being intimate with wealth, he becomes angry when he asks for it, wondering about the merits of wealth, and losing it to friends and family.",
        "source": "T02n0100_014:0471c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　但如法聚財，　　不應作非法，　丈夫如法作，　　端嚴極熾盛。",
        "translation": "A man who correctly gathers wealth according to the Dharma and doesn't do anything unlawful does so according to the Dharma, and his dignity is greatly exalted.",
        "source": "T02n0100_014:0471c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　既能自衣食，　　又復惠施人，　調適不失度，　　命終得生天。」",
        "translation": "Being able to feed himself and give generosity to others, he adjusts himself without losing control and is born in heaven at the end of his life.\"",
        "source": "T02n0100_014:0471c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚曰：「我昔已曾見，　　婆羅門涅槃，　久棄捨嫌怖，　　以度世間愛。」",
        "translation": "The gods then praised him in a verse, \"I've seen it before, Brahman's nirvāṇa, abandoning long ago dislikes and fears in order to end worldly cravings.\"",
        "source": "T02n0100_014:0471c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜還宮。",
        "translation": "After speaking this verse, the god then rejoiced and returned to the palace.",
        "source": "T02n0100_014:0472a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二八二）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0100_014:0472a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告諸比丘：「乃往古昔，俱薩羅國有一善彈琴人，名俱[少/兔]羅，涉路而行。",
        "translation": "It was then that the Buddha addressed the monks, \"Once upon a time, there was a lute-player named Ku[lesser/rabbit]la in Kośala who waded through the roads.",
        "source": "T02n0100_014:0472a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有六天女各乘宮殿，陵虛而行。",
        "translation": "At the time, there were six goddesses each riding in a palace, and they were walking through the hills.",
        "source": "T02n0100_014:0472a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天等出宮，語此人言：『舅可為我彈奏清琴，我當歌舞。』",
        "translation": "When the gods emerged from their palaces, they said to this man, 'Uncle, play the lute for me, and I will sing and dance.'",
        "source": "T02n0100_014:0472a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彈琴人覩其容貌，光明異常，生希有想。",
        "translation": "The lute-player then saw her features, which were unusually radiant, and had rare thoughts.",
        "source": "T02n0100_014:0472a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問言：『姊妹！",
        "translation": "He asked, 'Sister!",
        "source": "T02n0100_014:0472a08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作何功德，得生斯處？",
        "translation": "What merit did it achieve to be born here?",
        "source": "T02n0100_014:0472a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾先為我說其先因，我當為爾彈奏清琴。』",
        "translation": "If you first explain the causes of your past for me, I will play the clear lute for you.'",
        "source": "T02n0100_014:0472a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天女答曰：『汝今但當為我彈琴，我於歌中，自說往緣。』",
        "translation": "The goddess answered, 'Now, you can play the lute for me, and in my song, I'll explain the causes of the past.'",
        "source": "T02n0100_014:0472a10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時俱[少/兔]羅於六天前即鼓琴，時，第一天女而說偈言：「『諸能以上衣，　　用施於他人，　　人中生尊勝，　　處天如我今。",
        "translation": "When Kauṣṭhila was playing the lute before the six celestials, the first goddess spoke in verse, saying, 'All those who can put on the above robes and give them to others will be honored among humans and will live in the heavens as I do now.",
        "source": "T02n0100_014:0472a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　身如真金聚，　　光色甚凞怡，　　天女有數百，　　我為最尊勝。",
        "translation": "Their bodies are like a mass of genuine gold, and their radiance is so brilliant that there are hundreds of goddesses, and I'm the most honored.",
        "source": "T02n0100_014:0472a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　施於所愛物，　　其福勝如是。』",
        "translation": "Giving to the things I love makes their merit superior like this.'",
        "source": "T02n0100_014:0472a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第二天女復說偈言：「『若以諸上味，　　餚饍飲食施，　　生人為男女，　　男女中最勝。",
        "translation": "\"The next day, the goddess again spoke a verse, saying, 'Suppose I were to give food and drink of the highest flavors, giving birth to a man or a woman, the most superior of men and women.",
        "source": "T02n0100_014:0472a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若生於天上，　　猶如我今日，　　以捨所愛故，　　隨意受快樂。",
        "translation": "If I were born up in heaven, I'd be like me today, for I abandoned what I loved and enjoyed pleasure as I pleased.",
        "source": "T02n0100_014:0472a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝觀我宮殿，　　乘空自在行，　　身如真金聚，　　光顏甚殊妙。",
        "translation": "You see my palace, where I ride freely through space, with a body like a heap of real gold and a radiant face that's quite marvelous.",
        "source": "T02n0100_014:0472a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　天女有數百，　　我為最尊勝，　　施上味飲食，　　獲勝報如是。』",
        "translation": "Among the hundreds of celestial maidens, I'm the most honored, bestowing delicious food and drink and receiving excellent rewards like this.'",
        "source": "T02n0100_014:0472a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第三天女復說偈言：「『若以勝妙香，　　布施而修福，　　生人得尊勝，　　處天如我身，　　以捨所愛故，　　隨意受快樂。",
        "translation": "\"The third goddess then spoke another verse, saying, 'If I cultivate virtue by bestowing gifts with a wonderful fragrance, I'll be honored as a human being and live in a heavenly body like mine, for which I abandon what I love and receive pleasure as I please.'",
        "source": "T02n0100_014:0472a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝觀我宮殿，　　乘空自在行，　　身如真金聚，　　光顏甚殊妙。",
        "translation": "You see my palace, where I ride freely through space, with a body like a cluster of real gold and a shining face that's quite marvelous.",
        "source": "T02n0100_014:0472b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　天女有數百，　　我為最尊勝，　　以施勝香故，　　獲報得如是。』",
        "translation": "There are hundreds of celestial maidens, but I'm the most honored, and it's because of giving excellent incense that I get rewards like this.'",
        "source": "T02n0100_014:0472b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第四天女復說偈言：「『我本人中時，　　孝事難舅姑，　　罵詈麁惡言，　　我悉能忍受。",
        "translation": "\"The fourth goddess then spoke another verse, saying, 'When I was in this world, I was kind to my difficult aunt and uncle, and I could tolerate harsh words that ridiculed them.",
        "source": "T02n0100_014:0472b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　是故於今者，　　獲得此天身，　　以能孝順故，　　隨意受快樂。",
        "translation": "Now, therefore, I've attained this heavenly body, and because I'm able to be dutiful and obedient, I enjoy happiness as I wish.",
        "source": "T02n0100_014:0472b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝觀我宮殿，　　乘空自在行，　　身如真金聚，　　光顏甚殊妙。",
        "translation": "You see my palace, where I ride freely through space, with a body like a heap of real gold and a radiant face that's quite marvelous.",
        "source": "T02n0100_014:0472b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　天女有百數，　　我為最尊勝，　　以能孝事故，　　獲勝報如是。』",
        "translation": "Among the hundreds of goddesses, I'm the most honored, and because I'm filial, I've attained such a superior reward.'",
        "source": "T02n0100_014:0472b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第五天女復說偈言：「『我於先身時，　　屬人為婢使，　　奉侍於大家，　　隨順不瞋戾，　　精勤不懈怠，　　早起而晚臥。",
        "translation": "\"The fifth goddess then spoke another verse, saying, 'In my previous life, I was a servant to someone, serving everyone, obeying and not being hostile, diligent and not lazy, rising early and lying down late.",
        "source": "T02n0100_014:0472b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若於大家所，　　得少飲食時，　　分施於沙門，　　及與婆羅門，　　是故得天身，　　隨意受快樂。",
        "translation": "When I had a little food and drink from the company of others, I gave it to ascetics and priests, and so I attained the body of a god and enjoyed pleasure as I pleased.",
        "source": "T02n0100_014:0472b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝觀我宮殿，　　乘空自在行，　　身如真金聚，　　光顏甚殊妙。",
        "translation": "You see my palace, where I ride freely through space, with a body like a heap of real gold and a shining face that's quite marvelous.",
        "source": "T02n0100_014:0472b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　天女數百中，　　我最為尊勝，　　處賤修福田，　　獲勝報如是。』",
        "translation": "Among the hundreds of goddesses, I'm the most honored, cultivating a field of merit in a low place and obtaining such a superior reward.'",
        "source": "T02n0100_014:0472b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「第六天女復說偈言：「『我於先身時，　　得見於比丘，　　及以比丘尼，　　生大歡喜心。",
        "translation": "\"The sixth celestial woman then spoke another verse, saying, 'In my previous life, I was able to see a monk and a monk and nun who made me greatly rejoice.",
        "source": "T02n0100_014:0472b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　彼教我精勤，　　得聞彼說法，　　一日受齋法，　　是故今生天。",
        "translation": "They taught me to be diligent, I was able to hear their teachings, and I accepted the rules of purification one day; therefore, I was born in the heavens.",
        "source": "T02n0100_014:0472b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　隨意受快樂，　　汝觀我宮殿，　　乘空自在行，　　身如真金色，　　光顏甚殊妙。",
        "translation": "Enjoying pleasure as you like, you'll see my palace, where I ride freely through space, my body is like true gold, and my appearance is quite marvelous.",
        "source": "T02n0100_014:0472c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　天女數百中，　　我為最尊勝。",
        "translation": "Among the hundreds of goddesses, I'm the most venerable.",
        "source": "T02n0100_014:0472c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝今且觀我，　　以用善教故，　　獲勝報如是。』",
        "translation": "Now, look at me, for this is the surpassing reward for using a good teaching.'",
        "source": "T02n0100_014:0472c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時彈琴者復說偈言：「『我今極善行，　　可樂薩羅林，　　我今見天女，　　晃曜如電光，　　見聞如斯事，　　還歸造功德。』」",
        "translation": "\"The lute-player then again spoke a verse, saying, \"Now, I've done extremely good deeds, and I'm delighted to be in the Salar Grove. Now, I've seen a goddess that shines like a flash of lightning, and I've returned to create merit after seeing and hearing such a thing.\"",
        "source": "T02n0100_014:0472c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，比丘聞佛所說，歡喜奉行。",
        "translation": "At the time, the monks who heard what the Buddha taught rejoiced and handed it down.",
        "source": "T02n0100_014:0472c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二八三）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(283) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0100_014:0472c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，光色倍常，來至佛所，頂禮佛足，在一面坐。",
        "translation": "One day, his radiance was twice as brilliant as usual, and he came to the Buddha, bowed his head at his feet, and sat down at one side.",
        "source": "T02n0100_014:0472c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是天威德，光明熾盛，普照祇洹，悉皆大明。",
        "translation": "That celestial's majestic attributes and blazing brightness shone universally at Jeta Grove, and it was all very bright.",
        "source": "T02n0100_014:0472c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天爾時即說偈言：「云何起必壞？",
        "translation": "That god then spoke a verse, saying, \"How will this arise and surely break down?",
        "source": "T02n0100_014:0472c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何遮不生？",
        "translation": "How is it that the obscurations are not produced?",
        "source": "T02n0100_014:0472c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何捨所畏？",
        "translation": "\"What is the fear of equanimity?",
        "source": "T02n0100_014:0472c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何成法樂？」",
        "translation": "How do we attain the bliss of the Dharma?\"",
        "source": "T02n0100_014:0472c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「瞋恚起時滅，　　貪欲生必遮，　棄無明無畏，　　證滅最為樂。",
        "translation": "The Bhagavān then answered in a verse, \"When anger arises, it ceases, craving arises and must be stopped, ignorance and fearlessness are abandoned, and cessation is realized as the greatest joy.",
        "source": "T02n0100_014:0472c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　棄恚捨貪欲，　　出於諸結使，　不著於色名，　　觀諸法空林。",
        "translation": "Renouncing anger and abandoning desire, they escape the bonds and tendencies, don't cling to form and fame, and contemplate the forest of emptiness of all dharmas.",
        "source": "T02n0100_014:0472c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　欲為生死根，　　欲能生諸苦，　斷欲得解脫，　　諸苦亦復然。",
        "translation": "Desire is the root of birth-and-death, and desire produces suffering; when desire is ended, liberation is attained, and so is suffering.",
        "source": "T02n0100_014:0472c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苦得解脫故，　　苦本亦解脫，　孾愚無智者，　　放逸不觀苦。",
        "translation": "Because suffering is liberated, the root of suffering is also liberated, and a foolish and unwise person is careless and doesn't contemplate suffering.",
        "source": "T02n0100_014:0472c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故沒苦海，　　纏縛無窮已，　智者撿亂心，　　不宜著諸欲。",
        "translation": "Therefore, once he's submerged in the ocean of suffering and bound up in endless fetters, a wise person identifies with a disturbed mind and doesn't appropriately attach to desires.",
        "source": "T02n0100_014:0472c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　夫為放逸行，　　能壞禪定樂，　是故應攝想，　　勿得著欲染。",
        "translation": "A man's careless behavior can destroy the joy of meditation, so he should control his thoughts and not become defiled by attachments to desires.",
        "source": "T02n0100_014:0472c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如巨富者，　　守護其珍寶。」",
        "translation": "It's like a wealthy man who guards his treasures.\"",
        "source": "T02n0100_014:0473a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，天復以偈讚言：「往昔已曾見，　　婆羅門涅槃，　嫌怖已棄捨，　　能度世間愛。」",
        "translation": "The god then also praised him in a verse, saying, \"I've seen it before, the Brahman's nirvāṇa, and I've discarded my fears and been able to end worldly cravings.\"",
        "source": "T02n0100_014:0473a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜而去。",
        "translation": "After speaking this verse, the god then rejoiced and departed.",
        "source": "T02n0100_014:0473a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二八四）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0100_014:0473a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，有天，光色倍常，來至佛所，頂禮佛足，在一面坐。",
        "translation": "At the time, a god with a radiant countenance that was twice as brilliant as usual came to the Buddha, bowed his head at his feet, and sat down at one side.",
        "source": "T02n0100_014:0473a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是天威德，光明熾盛，普照祇洹，悉皆大明。",
        "translation": "That god's majestic attributes and blazing brilliance shone brightly throughout Jeta Grove, and all were greatly illuminated.",
        "source": "T02n0100_014:0473a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼天爾時即說偈言：「雖到於五塵，　　不名為貪欲。",
        "translation": "That god then spoke a verse, saying, \"Even though it reaches the five dust motes, it's not called desire.",
        "source": "T02n0100_014:0473a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　思想生染著，　　乃名為貪欲。",
        "translation": "When thoughts give rise to defiled attachment, it's called desire.",
        "source": "T02n0100_014:0473a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　欲能縛世間，　　健者得解脫。」",
        "translation": "Desire can bind the world, but those who are strong are liberated.\"",
        "source": "T02n0100_014:0473a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「欲性本無常，　　斷滅則悟道，　著欲生繫縛，　　永不得解脫。",
        "translation": "The Bhagavān then replied with a verse, \"The nature of desire is inherently impermanent, and when it's stopped, the path to enlightenment is realized.",
        "source": "T02n0100_014:0473a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若以信為伴，　　不信莫由起，　名稱轉增長，　　壽終得生天。",
        "translation": "If faith is their companion, disbelief won't arise, their names will grow, and they'll be born in heaven at the end of their lives.",
        "source": "T02n0100_014:0473a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若復斷除欲，　　不數數受有，　不還來生死，　　永入於涅槃。",
        "translation": "If they also stop desire, they won't experience existence repeatedly, won't return to birth-and-death, and will enter nirvāṇa forever.",
        "source": "T02n0100_014:0473a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　知身空無我，　　觀名色不堅，　不著於名色，　　從是而解脫。",
        "translation": "Knowing that the body is empty and without self, they observe that name and form are not firm, don't cling to name and form, and are liberated from that.",
        "source": "T02n0100_014:0473a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　亦不見解脫，　　及以非解脫，　哀愍利群生，　　廣饒益一切。」",
        "translation": "Not seeing liberation or what's not liberation, they compassionately benefit all sentient beings and broadly enrich them all.\"",
        "source": "T02n0100_014:0473a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚言：「往昔已曾見，　　婆羅門涅槃，　嫌怖久捨離，　　能度世間愛。」",
        "translation": "Again, the gods praised them in a verse, saying, \"I've seen it before, Brahman's nirvāṇa, long since abandoned my fears, and able to end worldly cravings.\"",
        "source": "T02n0100_014:0473a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜而去。",
        "translation": "After speaking this verse, the god then rejoiced and departed.",
        "source": "T02n0100_014:0473a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二八五）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0100_014:0473a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，有天光明倍常，來至佛所，頭面禮佛，在一面坐，而說偈言：「應共誰止住？",
        "translation": "At the time, a god whose radiance was twice as constant came to the Buddha, paid homage to him with his head and face, sat down at one side, and spoke a verse, saying, \"Who should we stop with?",
        "source": "T02n0100_014:0473b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　復應親近誰？",
        "translation": "To whom should one again draw near?",
        "source": "T02n0100_014:0473b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　從誰所受法，　　得利不生惡？」",
        "translation": "From whom will the Dharma be received that will bring benefit and not give rise to evil?\"",
        "source": "T02n0100_014:0473b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「應共善人住，　　親近於善者，　從彼人受法，　　得利不生惡。",
        "translation": "The Bhagavān then answered in a verse, \"Should you live with a good person, become close to a good person, and accept the teaching from that person, you'll attain benefit and not become evil.",
        "source": "T02n0100_014:0473b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應共善人住，　　親近於善者，　從彼人受法，　　智者得利樂。",
        "translation": "Should you live with a good person, become close to a good person, and accept the teaching from that person, the wise will attain benefit and happiness.",
        "source": "T02n0100_014:0473b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應共善人住，　　親近於善者，　從彼人受法，　　智者得名譽。",
        "translation": "They should dwell with a good person, become close to a good person, and accept the teaching from that person, and the wise man will attain renown.",
        "source": "T02n0100_014:0473b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　親近於善者，　　從彼人受法，　智者得解慧，　　是故應共住。",
        "translation": "Being close to a good person and accepting the teaching from that person, the wise man attains understanding and wisdom; therefore, they should abide together.",
        "source": "T02n0100_014:0473b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　親近於善者，　　從彼人受法，　親族中尊勝，　　能離於憂愁，　於一切苦中，　　而能得解脫。",
        "translation": "Being close to a good person and receiving the Dharma from that person, they're honored among their relatives, free of sorrow, and able to attain liberation from all suffering.",
        "source": "T02n0100_014:0473b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　遠離諸惡趣，　　能斷一切縛，　純受上妙樂，　　得近於涅槃。」",
        "translation": "Far removed from the bad destinies, they can sever all fetters, experience pure, sublime happiness, and attain nearness to nirvāṇa.\"",
        "source": "T02n0100_014:0473b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚言：「往昔已曾見，　　婆羅門涅槃，　嫌怖久棄捨，　　能度世間愛。」",
        "translation": "Again, the gods praised them in a verse, saying, \"I've seen it before, Brahman's nirvāṇa, discarding long-standing fears and resentments, and I was able to end worldly cravings.\"",
        "source": "T02n0100_014:0473b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜而去。",
        "translation": "After speaking this verse, the god then rejoiced and departed.",
        "source": "T02n0100_014:0473b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二八六）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was present at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0100_014:0473b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，有天光明倍常，普照祇洹，悉皆大明，來詣佛所，頂禮佛足，却坐一面，而說偈言：「貪悋貧窮苦，　　皆由不惠施，　若欲求福德，　　智者應施與。」",
        "translation": "At the time, a god whose light was twice as great as normal and who shone with great radiance throughout Jeta came to the Buddha, bowed his head at his feet, withdrew to sit at one side, and spoke a verse, saying, \"Being stingy and poor and suffering is caused by unmerited generosity.",
        "source": "T02n0100_014:0473b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「可怖莫過貪，　　貧乏恒飢渴，　恐貧不布施，　　不施畏甚大。",
        "translation": "The Bhagavān then answered with a verse, \"Nothing more frightening than greed, and while poverty persists as hunger and thirst, I'm afraid to be poor and not give generously, for the fear of not giving is very great.",
        "source": "T02n0100_014:0473b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今世若後世，　　飢窮苦難計，　若得少能施，　　得多亦能施。",
        "translation": "In this world and the next, hunger and poverty are incalculable, but if we can give a little, we can also give a lot.",
        "source": "T02n0100_014:0473c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　生時得快樂，　　壽終得生天，　難施而能施，　　是名難作業。",
        "translation": "To be happy when you're born and to be born in heaven at the end of your life, to be able to give even though it's difficult to give is called difficult work.",
        "source": "T02n0100_014:0473c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　孾愚不知解，　　諸佛賢聖法，　愚智俱命終，　　生處各別異。",
        "translation": "A fool doesn't know the understanding of the good and noble qualities of the buddhas, but both foolishness and wisdom reach their end of life, and their places of birth are different.",
        "source": "T02n0100_014:0473c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚者墮地獄，　　受於種種苦，　智者生人天，　　乃可得解脫。",
        "translation": "A foolish man falls into hell and experiences various kinds of suffering, but a wise man is born in heaven and then attains liberation.",
        "source": "T02n0100_014:0473c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　貧窮捃拾活，　　以用養妻子，　淨心割少施，　　其福無有量。",
        "translation": "The poor gather a living, use it to support their wives, and purify their minds by cutting small gifts, whose merit is incalculable.",
        "source": "T02n0100_014:0473c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　設百千大祀，　　供養於一切，　不及貧布施，　　十六分中一。",
        "translation": "He sets up a hundred thousand great sacrifices to support all of them, which are not as good as the poor's almsgiving, which is one in sixteen.",
        "source": "T02n0100_014:0473c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大祀有鞭打，　　侵掠他財寶，　種種苦惱人，　　以成大祀業。",
        "translation": "For that great sacrifice, there's whipping, plundering of another's treasure, and various kinds of suffering that cause great sacrificial activity.",
        "source": "T02n0100_014:0473c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以惡取財寶，　　眾皆不歡悅，　如是不淨施，　　及以小淨施，　受報有好醜，　　不可以相比。",
        "translation": "Taking wealth and possessions in a bad way that's displeasing to everyone, such impure giving and lesser pure giving will have good and ugly rewards that can't be compared.",
        "source": "T02n0100_014:0473c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如法聚財物，　　終不非法求，　得財捨用施，　　正直而施與。",
        "translation": "He gathers property according to the Dharma, never pursues it unlawfully, gives freely when he has it, and gives it correctly.",
        "source": "T02n0100_014:0473c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　具戒修禪定，　　正直者受取，　福聚布四方，　　猶如大海水。」",
        "translation": "Possessing precepts and cultivating meditation, the upright accept them, and the merits are spread in all directions like the waters of a great ocean.\"",
        "source": "T02n0100_014:0473c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚言：「往昔已曾見，　　婆羅門涅槃，　嫌怖久捨離，　　能度世間愛。」",
        "translation": "Again, the gods praised them in a verse, saying, \"I've seen it before, Brahman's nirvāṇa, long abandoned my fears, and been able to end worldly cravings.\"",
        "source": "T02n0100_014:0473c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜而去。",
        "translation": "After speaking this verse, the god then rejoiced and departed.",
        "source": "T02n0100_014:0473c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二八七）如是我聞：一時，佛在王舍城毘婆山側七葉窟中。",
        "translation": "（Thus I have heard: One time, the Buddha was in the Cave of Seven Leaves on the side of Mount Vipa in Rājagṛha.",
        "source": "T02n0100_014:0473c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時佛為佉陀羅刺脚，極為苦痛，如來默受，雖復苦痛，無所請求。",
        "translation": "The Buddha's leg was pricked by Khadira, and the pain was so great that the Tathāgata accepted it silently and didn't ask for anything despite the pain.",
        "source": "T02n0100_014:0473c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，有八天子顏容端正，來詣佛所。",
        "translation": "At the time, eight celestials with upright countenances came to the Buddha.",
        "source": "T02n0100_014:0473c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中有一天言：「沙門瞿曇實是丈夫人中師子，雖受苦痛，不捨念覺，心無惱異，若復有人於瞿曇大師子所生誹謗者，當知是人甚大愚癡。」",
        "translation": "One of them said, \"The ascetic Gautama is really a lion among men who, despite suffering and pain, doesn't abandon mindfulness and awareness and whose mind isn't disturbed, and if another person denigrates the great lion Gautama, you should know that person is quite foolish.\"",
        "source": "T02n0100_014:0474a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二天亦作是說：「瞿曇沙門丈夫龍象，雖受苦痛，不捨念覺，心無惱異，若復有人於瞿曇龍象所生誹謗者，當知是人甚大愚癡。」",
        "translation": "The second heaven also said, \"The Gautama ascetic Nāgârjuna, although he experiences pain and suffering, doesn't let go of mindfulness and awareness, and his mind isn't disturbed, so if another person denigrates the Gautama Nāgârjuna, that person would be known to be quite foolish.\"",
        "source": "T02n0100_014:0474a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三天復作是言：「沙門瞿曇如善乘牛。」",
        "translation": "The third heavenly being also said, \"The ascetic Gautama is like a good ox that rides the bull.\"",
        "source": "T02n0100_014:0474a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四天復作是言：「沙門瞿曇如善乘馬。」",
        "translation": "The fourth heavenly being again says, \"The ascetic Gautama is like a good rider on a horse.\"",
        "source": "T02n0100_014:0474a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第五天復作是言：「沙門瞿曇猶如牛王。」",
        "translation": "On the fifth heaven, he again says, \"The ascetic Gautama is like a king of oxen.\"",
        "source": "T02n0100_014:0474a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第六天復作是言：「沙門瞿曇無上丈夫。」",
        "translation": "On the sixth heaven, he again says, \"The ascetic Gautama is a peerless man.\"",
        "source": "T02n0100_014:0474a10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第七天復作是言：「沙門瞿曇人中蓮花。」",
        "translation": "On the seventh heaven, he again says, \"The ascetic Gautama is like a lotus among men.\"",
        "source": "T02n0100_014:0474a10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第八天復作是言：「沙門瞿曇猶如分陀利，觀彼禪寂，極為善定，終不矜高，亦不卑下。",
        "translation": "Again, the eighth heavenly being said, \"The ascetic Gautama is like Pūrṇa-puṇḍarīka, who observes the tranquility of his meditation and is extremely well concentrated, never being arrogant or inferior.",
        "source": "T02n0100_014:0474a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止故解脫，解脫故止。」",
        "translation": "Because he's stopped, he's liberated, and because he's liberated, he's stopped.\"",
        "source": "T02n0100_014:0474a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時第八天即說偈言：「非彼清淨心，　　假使滿百千，　通達五比施，　　為於戒取縛，　沒溺愛欲海，　　不能度彼岸。」",
        "translation": "The eighth heaven then spoke a verse, saying, \"Were it not for that pure mind, even if it were filled with a hundred thousand, and were it to comprehend the five generosities, for the sake of attaching to precepts, they'd be submerged in the ocean of craving and wouldn't be able to reach the other shore.\"",
        "source": "T02n0100_014:0474a14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，八天說此偈已，頂禮佛足，還其所止。",
        "translation": "After speaking this verse, the eight celestials bowed their heads at the Buddha's feet and returned to their lodging.",
        "source": "T02n0100_014:0474a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　垂下及遮止　　名稱及技能",
        "translation": "Hanging Down and Stopping the Shadows Name and Skill",
        "source": "T02n0100_014:0474a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彈琴并棄捨　　種別、善丈夫　慳貪不惠施　　八天為第十（二八八）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "Playing the lute and relinquishing it A man of distinction and goodness who is stingy, greedy, and not generous is the tenth of the eight heavens (2:88) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0100_014:0474a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，顏色殊常，來詣佛所，赫然大明，頂禮佛足，在一面坐，而說偈言：(丹本澄函第十一卷初准)「譬如彼大地，　　廣大無有邊，　又亦如巨海，　　甚深無崖際。",
        "translation": "One day, a man of extraordinary appearance came to the Buddha, stood out in great splendor, bowed his head at his feet, sat down at one side, and spoke in verse, saying, \"It's like that great earth, so vast it has no limit, and it's also like a huge ocean, so deep it has no limit on the cliffs.",
        "source": "T02n0100_014:0474a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　須彌極高峻，　　無以能喻及，　誰如那羅延？",
        "translation": "Sumeru is so high and lofty that there's no way to compare it to who is like Nārāyaṇa?",
        "source": "T02n0100_014:0474a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　男子中無比。」",
        "translation": "There's nothing like it among men.\"",
        "source": "T02n0100_014:0474a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「無物廣於愛，　　深大不過腹，　憍慢高須彌。",
        "translation": "The Bhagavān then answered in a verse, \"Nothing is as vast as desire, nothing is as deep as a belly, and conceit is as high as Sumeru.",
        "source": "T02n0100_014:0474a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　唯有佛世尊，　於諸男子中，　　最勝無倫匹。」",
        "translation": "Only the Bhagavān is the most excellent among men, without peer.\"",
        "source": "T02n0100_014:0474b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚言：「往昔已曾見，　　婆羅門涅槃，　嫌怖久捨離，　　能度世間愛。」",
        "translation": "Again, the gods praised him in a verse, saying, \"I've seen it before, the Brahman's nirvāṇa, long since abandoned my fears, and able to end worldly cravings.\"",
        "source": "T02n0100_014:0474b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜還宮。",
        "translation": "After speaking this verse, the god then rejoiced and returned to the palace.",
        "source": "T02n0100_014:0474b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二八九）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada's Park in Jeta's Grove in Śrāvastī.",
        "source": "T02n0100_014:0474b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，於其中夜，來詣佛所，威光照曜，赫然甚明，頂禮佛足，在一面坐，而說偈言：「何物火不燒，　　旋嵐不能壞？",
        "translation": "One day, during the middle of the night, a man came to the Buddha, his majestic light shining brilliantly and clearly, saluted the Buddha's feet, sat down at one side, and spoke a verse, saying, \"What doesn't burn when there's fire, and what can't be destroyed by a revolving wind?",
        "source": "T02n0100_014:0474b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　劫盡大洪水，　　一切浸爛壞，　何物於彼所，　　而得不爛潰？",
        "translation": "After the great flood at the end of the age, everything is soaked and rotted, but what can be found there that doesn't rot?",
        "source": "T02n0100_014:0474b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　男子若女人，　　所有諸財寶，　以何方便故，　　王賊不能侵？",
        "translation": "\"What is the method by which a man or a woman who possesses possessions and treasures cannot be invaded by the king or thieves?",
        "source": "T02n0100_014:0474b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是何堅牢藏，　　無能毀壞者？」",
        "translation": "What is this hard and secure place that cannot be destroyed?\"",
        "source": "T02n0100_014:0474b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「福聚火不燒，　　旋嵐不吹壞，　劫盡洪水浸，　　不能令腐朽。",
        "translation": "The Bhagavān then answered in a verse, \"A stock of merit that doesn't burn in a fire, doesn't blow away in a whirlwind, and can't be allowed to decay when floods submerge it after an eon.",
        "source": "T02n0100_014:0474b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　男女有福聚，　　王賊不能侵，　福是堅牢藏，　　無能侵毀者。」",
        "translation": "A man and woman with a stock of good fortune can't be attacked by kings and thieves, and that fortune is a strong, secure deposit that can't be destroyed.\"",
        "source": "T02n0100_014:0474b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚言：「往昔已曾見，　　婆羅門涅槃，　嫌怖久捨離，　　能度世間愛。」",
        "translation": "Again, the gods praised them in a verse, saying, \"I've seen it before, Brahman's nirvāṇa, long abandoned to dislikes and fears, and able to end worldly cravings.\"",
        "source": "T02n0100_014:0474b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜還宮。",
        "translation": "After speaking this verse, the god then rejoiced and returned to the palace.",
        "source": "T02n0100_014:0474b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二九〇）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada's Park in Jeta's Grove in Śrāvastī.",
        "source": "T02n0100_014:0474b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，於其夜中，來詣佛所，威光照曜，赫然大明，頂禮佛足，却坐一面，而說偈言：「誰能具曠路，　　涉道之資糧？",
        "translation": "One day, in the middle of the night, he came to the Buddha, his majestic light shining brightly and with great splendor, saluted his feet, withdrew to sit at one side, and spoke in verse, saying, \"Who has the wherewithal to forge the way and wade through the path?",
        "source": "T02n0100_014:0474b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以何因緣故，　　賊所不能劫？",
        "translation": "What are the causes and conditions that make it impossible for a thief to take over?",
        "source": "T02n0100_014:0474c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　設復逢奸惡，　　云何得守護？",
        "translation": "Even if there were evil, how could it be guarded?",
        "source": "T02n0100_014:0474c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何被劫奪，　　而生大歡喜？",
        "translation": "How does one become overjoyed at being robbed?",
        "source": "T02n0100_014:0474c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何常親近，　　智者生欣悅？」",
        "translation": "How do you always draw near to a wise person and become pleased with him?\"",
        "source": "T02n0100_014:0474c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「信為遠資糧，　　福聚非賊劫，　賊劫戒遮殺，　　沙門劫生喜，　數親近沙門，　　智者生欣悅。」",
        "translation": "The Bhagavān then answered in a verse, \"Faith is a distant accumulation, a stock of merit that's not a thief's eon, an eon of thieves when the precepts prevent killing, an eon of ascetics when there's joy, repeated closeness to ascetics, and delight in the wise.\"",
        "source": "T02n0100_014:0474c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚言：「往昔已曾見，　　婆羅門涅槃，　嫌怖久捨離，　　能度世間愛。」",
        "translation": "Again, the gods praised them in a verse, saying, \"I've seen it before, Brahman's nirvāṇa, long since abandoned my doubts and fears, and I've been able to end worldly cravings.\"",
        "source": "T02n0100_014:0474c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜還宮。",
        "translation": "After speaking this verse, the god then rejoiced and returned to the palace.",
        "source": "T02n0100_014:0474c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二九一）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada's Park in Jeta's Grove in Śrāvastī.",
        "source": "T02n0100_014:0474c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，光色倍常，於其中夜，來詣佛所，威光赫然，悉皆大明，頂禮佛足，却坐一面，而說偈言：「樂者所思念，　　稱意盡獲得，　一切諸樂中，　　欲樂最為勝。」",
        "translation": "One day, his radiance was twice as brilliant as usual, and during the middle of the night, he came to the Buddha, his majestic light shining brightly and all of them shining greatly, saluted the Buddha's feet, withdrew to sit to one side, and spoke a verse, saying, \"That which is contemplated by those who delight in it is asserted to be completely attained, and of all the pleasures, the pleasure of desire is the greatest.\"",
        "source": "T02n0100_014:0474c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「樂者無思念，　　苦者有願求，　若人捨思願，　　是為最為勝。」",
        "translation": "At that point, the Bhagavān answered with a verse, \"Those who are delighted have no thoughts, while those who are pained have aspirations.",
        "source": "T02n0100_014:0474c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚言：「往昔已曾見，　　婆羅門涅槃，　嫌怖久捨離，　　能度世間愛。」",
        "translation": "Again, the gods praised him in a verse, saying, \"I've seen it before, Brahman's nirvāṇa, abandoning long-standing fears and resentments, and I was able to end worldly cravings.\"",
        "source": "T02n0100_014:0474c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜還宮。",
        "translation": "After speaking this verse, the god then rejoiced and returned to the palace.",
        "source": "T02n0100_014:0474c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二九二）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0100_014:0474c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，光顏殊特，赫然大明，來詣佛所，頂禮佛足，退坐一面，而說偈言：「佛為天人師，　　於諸物中勝，　能知一切法，　　利益諸世間。",
        "translation": "One day, a man of extraordinary appearance and great radiance came to the Buddha, bowed his head at his feet, withdrew to sit at one side, and spoke a verse, saying, \"The Buddha is a teacher of gods and humans, the best of all things, able to know all things, and beneficial to the world.",
        "source": "T02n0100_014:0474c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸難中，　　何物最為難？",
        "translation": "Among all the difficulties, which is the most difficult?",
        "source": "T02n0100_014:0475a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　唯願大仙尊，　　為我分別說。」",
        "translation": "Please let the great sage venerable discern this for me.\"",
        "source": "T02n0100_014:0475a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「於他得自在，　　忍彼觸惱難。",
        "translation": "At that point, the Bhagavān answered with a verse, \"Attaining mastery over others, it's difficult to tolerate their contact and affliction.",
        "source": "T02n0100_014:0475a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　貧窮能布施，　　危厄持戒難。",
        "translation": "It's difficult to be poor and able to give generously, and it's difficult to observe precepts in times of danger and trouble.",
        "source": "T02n0100_014:0475a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　盛年處榮貴，　　捨欲出家難。」",
        "translation": "It's difficult to abandon desire and leave home when you're in the prime of life and in a position of prosperity.\"",
        "source": "T02n0100_014:0475a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚言：「往昔已曾見，　　婆羅門涅槃，　嫌怖久捨離，　　能度世間愛。」",
        "translation": "Again, the gods praised him in a verse, saying, \"I've seen it before, the Brahman's nirvāṇa, long abandoned my fears, and able to end worldly cravings.\"",
        "source": "T02n0100_014:0475a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜還宮。",
        "translation": "After speaking this verse, the god then rejoiced and returned to the palace.",
        "source": "T02n0100_014:0475a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二九三）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada's Park in Jeta's Grove in Śrāvastī.",
        "source": "T02n0100_014:0475a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，來詣佛所，威光晃曜，赫然大明，頂禮佛足，退坐一面，而說偈言：「車為云何生？",
        "translation": "One day, a man came to the Buddha, his radiance shining brilliantly, his eminence shining brightly, saluted the Buddha's feet, withdrew to sit at one side, and spoke in verse, saying, \"Why did the chariot come into being?",
        "source": "T02n0100_014:0475a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　誰將車所至？",
        "translation": "Who will bring the chariot there?",
        "source": "T02n0100_014:0475a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　車去為遠近，　　車云何損滅？」",
        "translation": "Is the chariot going near or far, and how does it decrease or disappear?\"",
        "source": "T02n0100_014:0475a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「從業出生車，　　心將轉運去，　去至因盡處，　　因盡則滅壞。」",
        "translation": "The Bhagavān then answered in a verse, \"A chariot is born from this vehicle, and the mind is about to change course and depart, reaching the end of its causes, which then cease and disintegrate.\"",
        "source": "T02n0100_014:0475a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚言：「往昔已曾見，　　婆羅門涅槃，　嫌怖久捨離，　　能度世間愛。」",
        "translation": "Again, the gods praised him in a verse, saying, \"I've seen it before, Brahman's nirvāṇa, long since abandoned my fears, and able to end worldly cravings.\"",
        "source": "T02n0100_014:0475a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜還宮。",
        "translation": "After speaking this verse, the god then rejoiced and returned to the palace.",
        "source": "T02n0100_014:0475a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二九四）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada's Park in Jeta's Grove in Śrāvastī.",
        "source": "T02n0100_014:0475a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，光色倍常，來詣佛所，身光晃曜，遍照祇洹，悉皆大明。",
        "translation": "One day, his radiance was twice as brilliant as usual, and he came to the Buddha with a shining body that shone brightly all over Jīvaka, making it all very clear.",
        "source": "T02n0100_014:0475a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時此天子却坐一面，而白佛言：「世尊！",
        "translation": "This celestial then withdrew to sit to one side and said to the Buddha, \"Bhagavān!",
        "source": "T02n0100_014:0475a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須多蜜奢鋸陀女生子。」",
        "translation": "*Sudhimīśāsana-sons of the goddess.\"",
        "source": "T02n0100_014:0475a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「斯是不善，非是善也。」",
        "translation": "The Buddha said, \"This is not good, and it's not good.\"",
        "source": "T02n0100_014:0475a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天即說偈言：「子生世言樂，　　生子極欣慶，　父母漸老朽，　　何故說不善？」",
        "translation": "The god then spoke in verse, saying, \"A son is born into the world and is said to be happy, and the birth of a son is a source of great joy, while his parents grow old and decay, so why do you say that it's not good?\"",
        "source": "T02n0100_014:0475a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「我知生子者，　　必有愛別離，　陰聚和合苦，　　此都非是子。",
        "translation": "The Bhagavān then answered in a verse, \"I know that someone who gives birth to a child must have craving and separation, and that the aggregates of the aggregates are painful when combined, but these are not children.",
        "source": "T02n0100_014:0475b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是名與諸苦，　　孾愚謂為樂，　是故我說言，　　生子為不善。",
        "translation": "It's called suffering and what's considered pleasant by ignorant people, so I say that giving birth to a child is unwholesome.",
        "source": "T02n0100_014:0475b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不善作善想，　　不愛作愛想，　苦作於樂想，　　放逸所極熟。」",
        "translation": "They cultivate thoughts of goodness that are not good, thoughts of craving that are not craved, and thoughts of happiness that are painful and whose indulgence is extremely ripe.\"",
        "source": "T02n0100_014:0475b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚言：「往昔已曾見，　　婆羅門涅槃，　嫌怖久捨離，　　能度世間愛。」",
        "translation": "Again, the gods praised them in a verse, saying, \"I've seen it before, Brahman's nirvāṇa, abandoning long ago dislikes and fears, and I was able to end worldly cravings.\"",
        "source": "T02n0100_014:0475b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜還宮。",
        "translation": "After speaking this verse, the god then rejoiced and returned to the palace.",
        "source": "T02n0100_014:0475b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二九五）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0100_014:0475b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，光顏暉曜，威色倍常，赫然大明，來詣祇洹，頂禮佛足，在一面坐，而說偈言：「云何自思算，　　不為煩惱覆？",
        "translation": "One day, his radiant face shone brightly, his appearance was twice as brilliant, and he came to Jipan, bowed his head at the Buddha's feet, sat down at one side, and spoke in verse, saying, \"How do you calculate for yourself and not let afflictions cover you?",
        "source": "T02n0100_014:0475b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何復名為，　　永離於眾數？」",
        "translation": "How can it be called, 'Forever free from the multitude?'\"",
        "source": "T02n0100_014:0475b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「若善算計者，　　二漏不流轉，　名色永已滅，　　彼名離眾處。",
        "translation": "At that point, the Bhagavān answered in a verse, \"If someone is a good calculator, the two contaminants won't flow, name and form have permanently ceased, and their name is free of all places.",
        "source": "T02n0100_014:0475b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　總數不覆藏，　　已去於總數。」",
        "translation": "They are not concealed in totality and have departed from the total number of things.\"",
        "source": "T02n0100_014:0475b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚言：「往昔已曾見，　　婆羅門涅槃，　嫌怖久捨離，　　能度世間愛。」",
        "translation": "Again, the gods praised him in a verse, saying, \"I've seen it before, Brahman's nirvāṇa, long since abandoned my fears, and able to end worldly cravings.\"",
        "source": "T02n0100_014:0475b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜還宮。",
        "translation": "After speaking this verse, the god then rejoiced and returned to the palace.",
        "source": "T02n0100_014:0475b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二九六）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada's Park in Jeta's Grove in Śrāvastī.",
        "source": "T02n0100_014:0475b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，光色暉曜，赫然大明，來詣祇洹，頂禮佛足，退坐一面，而說偈言：「何物重於地？",
        "translation": "One day, a radiant and brilliant god came to Jipan, bowed his head at the Buddha's feet, withdrew to sit at one side, and spoke a verse, saying, \"What's heavier than the ground?",
        "source": "T02n0100_014:0475b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　何物高於空？",
        "translation": "What is higher than emptiness?",
        "source": "T02n0100_014:0475c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　何物疾於風？",
        "translation": "What is faster than the wind?",
        "source": "T02n0100_014:0475c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　何物多草木？」",
        "translation": "What is it that is abundant in grass and trees?\"",
        "source": "T02n0100_014:0475c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「持戒重於地，　　憍慢高於空，　心念疾於風，　　亂想多草木。」",
        "translation": "The Bhagavān then answered in a verse, \"Observance of precepts is heavier than the ground, conceit is higher than air, mindfulness is swift as the wind, and distracting thoughts are abundant in grass and trees.\"",
        "source": "T02n0100_014:0475c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚言：「往昔已曾見，　　婆羅門涅槃，　嫌怖久捨離，　　能度世間愛。」",
        "translation": "Again, the gods praised him in a verse, saying, \"I've seen it before, Brahman's nirvāṇa, long since abandoned my doubts and fears, and I was able to end worldly cravings.\"",
        "source": "T02n0100_014:0475c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜還宮。",
        "translation": "After speaking this verse, the god then rejoiced and returned to the palace.",
        "source": "T02n0100_014:0475c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二九七）如是我聞：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0100_014:0475c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，威顏晃曜，光色殊常，來詣祇洹，赫然大明，頂禮佛足，退坐一面，而說偈言：「修行何戒行？",
        "translation": "One day, a shining, brilliant man with an extraordinary appearance, came to Qipan, shone brightly, bowed his head at the Buddha's feet, withdrew to sit at one side, and spoke a verse, saying, \"What precepts does he practice?",
        "source": "T02n0100_014:0475c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　復作何威儀？",
        "translation": "What further does it do in terms of deportment?",
        "source": "T02n0100_014:0475c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有何功德力？",
        "translation": "What is the power of merit?",
        "source": "T02n0100_014:0475c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　造作何業行？",
        "translation": "What kind of karmic activity does it create?",
        "source": "T02n0100_014:0475c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　具足何等法，　　得生於天上？",
        "translation": "\"What dharmas are present that allow birth in the heavens?",
        "source": "T02n0100_014:0475c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　願世尊悲愍，　　為我開顯說。」",
        "translation": "May the Bhagavān have compassion on you and reveal it for me.\"",
        "source": "T02n0100_014:0475c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：「我今為汝說，　　汝當至心聽。",
        "translation": "At that point, the Bhagavān answered with a verse, \"Now, I'll explain this for you, and you must listen with utmost attention.",
        "source": "T02n0100_014:0475c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸欲生天者，　　先當斷殺生。",
        "translation": "Those who want to be born in the heavens must first stop killing.",
        "source": "T02n0100_014:0475c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善修於禁戒，　　守攝於諸根，　不害有生類，　　便得生天上。",
        "translation": "By well cultivating the precepts and disciplining the faculties, they won't harm living things and will then be born in the heavens.",
        "source": "T02n0100_014:0475c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不盜他財物，　　彼與樂受取，　斷於奸盜心，　　便得生天上。",
        "translation": "Not stealing another's property that they enjoy taking, and stopping the mind of stealing, they'll be born up in heaven.",
        "source": "T02n0100_014:0475c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不奸他婦女，　　度邪婬彼岸，　自足己妻色，　　便得生天上。",
        "translation": "They don't commit adultery with another woman, cross over to the other side of sexual misconduct, and satisfy themselves with the form of their own wives, and then they'll be born in the heavens.",
        "source": "T02n0100_014:0475c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為利自己身，　　亦欲利于彼，　并為財利故，　　遠離諸放逸。",
        "translation": "Because he wants to benefit himself, he also wants to benefit others, and for the sake of material gain, he'll be free of carelessness.",
        "source": "T02n0100_014:0475c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　實語不虛妄，　　便得生天上。",
        "translation": "When he speaks truly and isn't false, he'll be born up in heaven.",
        "source": "T02n0100_014:0475c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　除去於兩舌，　　不鬪亂彼此，　樂出和合語，　　以此因緣故，　便得生天上。",
        "translation": "He rids himself of duplicity, doesn't fight with one another, and enjoys speaking in harmony, and because of this cause he'll be born in the heavens.",
        "source": "T02n0100_014:0475c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　斷於麁惡言，　讒刺觸惱故，　　吐辭皆柔軟，　聞者生欣悅，　　以是業緣故，　得生于天上。",
        "translation": "He stops harsh speech, which is provocative and provokes, and he speaks softly, making those who hear it happy, and because of these causes, he'll be born up in the heavens.",
        "source": "T02n0100_014:0476a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　除斷於綺語，　不談無益事，　　知時而說法，　便得生天上。",
        "translation": "He stops fancy speech, doesn't talk about useless things, and teaches the Dharma knowing the right time, and then he'll be born up in the heavens.",
        "source": "T02n0100_014:0476a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若聚落曠野，　不生貪利想，　　於他財物所，　不起愚癡心，　　便得生天上。",
        "translation": "If they live in a village or in the wilderness, don't become greedy for profit, and don't become foolish with regard to the possessions of others, they'll be born up in the heavens.",
        "source": "T02n0100_014:0476a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　慈心不害物，　　不挾怨憎心，　向於群生類，　　心無怒害想，　便得生天上。",
        "translation": "Being kind and not harmful to things, not harboring resentment, they'll be born up in the heavens if they're directed toward all living things and don't harbor thoughts of anger and harmfulness in their minds.",
        "source": "T02n0100_014:0476a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　信業及果報，　能修信施者，　　二事俱生信，　具足得正見，　　便得生天上。",
        "translation": "With the actions and rewards of faith, he cultivates faith and generosity, generates faith in both, and fully attains right view, then he'll be born in the heavens.",
        "source": "T02n0100_014:0476a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如斯眾善法，　　白淨十業道，　悉能修行者，　　必得生天上。」",
        "translation": "Such are the many good qualities and the tenfold path of white and pure activities, all of which can be cultivated, and they'll surely be born in the heavens.\"",
        "source": "T02n0100_014:0476a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天復以偈讚言：「往昔已曾見，　　婆羅門涅槃，　久捨於嫌怖，　　能度世間愛。」",
        "translation": "Again, the gods praised them in a verse, saying, \"I've seen it before, Brahman's nirvāṇa, long since abandoned dislike and fear, and I was able to end worldly cravings.\"",
        "source": "T02n0100_014:0476a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此天說此偈已，歡喜還宮。",
        "translation": "After speaking this verse, the god then rejoiced and returned to the palace.",
        "source": "T02n0100_014:0476a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大地、火不燒　　誰齎糧、所願　甚能及車乘　　鋸陀女、算數　何重并十善別譯雜阿含經卷第十四",
        "translation": "Who carries the provisions and wishes? How can he match the chariot carriage? What is the number of the Śārdāna women who count? What is the weight and ten virtues of the Sutra of the Distinct Translation of the Āgamas, Volume 14?",
        "source": "T02n0100_014:0476a21_0",
        "is_bad_quality": false
    }
]