[
    {
        "source_sentence": "佛說三摩竭經",
        "translation": "Samāgatha-sūtra",
        "source": "T02n0129_001:0843a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吳天竺沙門竺律炎譯",
        "translation": "Translated by Zhu Luyan, a monk from Tianzhu, Wu",
        "source": "T02n0129_001:0843a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時，佛在舍衛國祇樹給孤獨園，與千二百五十比丘、五百菩薩俱，帝王人民及諸天龍鬼神無復央數。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī with 1,250 monks and 500 bodhisattvas, the emperor, his people, gods, dragons, and spirits, who were incalculable.",
        "source": "T02n0129_001:0843a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，有難國王名分陂檀，不信佛法但好外道，日於宮中飯諸尼揵萬餘人。",
        "translation": "At the time, there was a king of a difficult country named Pūrva-videha who didn't believe in the Buddha's teachings but preferred non-Buddhists and who fed more than 10,000 nuns in his palace every day.",
        "source": "T02n0129_001:0843b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "難國王常喜貢高，自謂智慧無雙，以鐵鍱其腹，常恐智慧從腹橫出。",
        "translation": "The king of that difficult country was always fond of pride and claimed to have unsurpassed wisdom, and he used iron to flatten his belly, always fearing that wisdom would come out of it.",
        "source": "T02n0129_001:0843b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王欲為其太子娶婦，即問左右群臣：「天下寧有智慧如我者不？",
        "translation": "When he wanted to marry his crown prince, the king asked a group of ministers, \"Would there be someone as wise as I am in the world?",
        "source": "T02n0129_001:0843b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有者，我欲為子娶其女。」",
        "translation": "If there is, I want to marry his daughter for my son.\"",
        "source": "T02n0129_001:0843b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大臣便受王教，即遍至國中求索，了無有如王，亦自知國中無有，即更遣使者行到他國，求索智士女。",
        "translation": "The minister then accepted the king's teaching and went searching throughout the country, realizing that there was nothing like the king, and knowing on his own that there was nothing in his country, he sent another envoy to another country to search for a woman of wisdom.",
        "source": "T02n0129_001:0843b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，使者即受王教，便至舍衛國，使者便問國中人民：「是國中寧有好道賢者不乎？」",
        "translation": "The messenger then, having been instructed by the king, went to Śrāvastī, where he asked the people, \"Is there a good and virtuous man in that country?\"",
        "source": "T02n0129_001:0843b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人答言：「有。」",
        "translation": "The man replied, \"Yes.\"",
        "source": "T02n0129_001:0843b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使者言：「姓字何等？」",
        "translation": "The messenger said, \"What's the family name and forename?\"",
        "source": "T02n0129_001:0843b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人報言：「字為佛。」",
        "translation": "The person replied, \"The word is Buddha.\"",
        "source": "T02n0129_001:0843b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使者言：「佛寧有女無？」",
        "translation": "The messenger said, \"Would the Buddha prefer to have a woman?\"",
        "source": "T02n0129_001:0843b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人言：「佛者道人也，無有女。」",
        "translation": "The people said, \"That Buddha is a man of the Way, and there's no woman.\"",
        "source": "T02n0129_001:0843b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使者言：「次復有誰人？」",
        "translation": "The messenger said, \"Who else is there?\"",
        "source": "T02n0129_001:0843b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「復有人字阿難邠坻，大賢善好道，有好女，國中第一。」",
        "translation": "He replied, \"Again, there's a man named Ānanda Bhadrapāla, a great man of goodness and good morals who has a good daughter and is the best in the country.\"",
        "source": "T02n0129_001:0843b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使者言：「何用為第一？」",
        "translation": "The envoy said, \"What's the use of being first?\"",
        "source": "T02n0129_001:0843b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國中人言：「曾與太子祇共請買園田八十頃持上佛，復以象負運黃金數千萬億持雇園田，不貪重寶但念為善耳。」",
        "translation": "The man in the kingdom said, \"I once asked the prince Jigye to buy 80 hectares of farmland for the Buddha, and I also hired an elephant to carry a thousand trillion pieces of gold to hire the farmland. I didn't crave valuable treasures but was mindful of what's good.\"",
        "source": "T02n0129_001:0843b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使者聞國中人言，大歡喜，自知以得消息，即還本國白王言：「迺舍衛國中有賢善者大好道，字阿難邠坻。」",
        "translation": "When the messenger heard what the people of that country said, he rejoiced greatly, knowing that he had received news, and returned to his own country to tell the king, \"There's a good man in Śrāvastī who's a great virtuous man, named Ānanda.\"",
        "source": "T02n0129_001:0843b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "難國王聞使者言，便作書即遣太子與群臣百官，嚴駕載珍寶，俱相隨到舍衛國，止頓太子著城外，使人便入城至阿難邠坻舍。",
        "translation": "When the king of Naina heard what the messenger said, he wrote a letter and sent the crown prince and his ministers and officials, carrying their treasures in an elegant carriage, to the country of Śrāvastī.",
        "source": "T02n0129_001:0843b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時守門者，便入白阿難邠坻：「外有使者來。」",
        "translation": "The gatekeeper then went in and told Ānanda Bhadrapāla, \"There's a messenger from outside.\"",
        "source": "T02n0129_001:0843b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難邠坻即自出應門，見使者黑醜如鬼，阿難邠坻大驚言：「汝何等人乎？」",
        "translation": "Ānanda then went out to answer the door himself and saw the messenger, who was as black and ugly as a ghost. Ānanda was greatly alarmed, saying, \"What kind of person are you?\"",
        "source": "T02n0129_001:0843b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即答言：「我是難國王使者。」",
        "translation": "He replied, \"I'm an envoy of King Nandanavana.\"",
        "source": "T02n0129_001:0843b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難邠坻言：「卿來欲何等求？」",
        "translation": "Ānanda said to him, \"What do you want from me?\"",
        "source": "T02n0129_001:0843b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使者言：「我來宣傳教命，難國王雖不相見，遙相愛敬，人每往來歌歎卿功德無有量，聞君賢善大好道，有女，故來欲為太子求君女，王亦自有書相聞。」",
        "translation": "The messenger said, \"Although I've come to publicize the order, the king of Nangang loves and respects him even though he doesn't see him. Every time people come and go, they sing praises of your merits, which are incalculable. I've heard that you're a good man who's great in virtue and has a daughter, so I've come to ask for your daughter for the prince, and the king has written to hear about it.\"",
        "source": "T02n0129_001:0843b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難邠坻即欲罵之，便自忍而不言，便呼前共坐，相問訊談語，使者便以書視之。",
        "translation": "Anantaputra was about to scold him, but he held himself back and didn't say anything. He then summoned him to sit with him, exchanged greetings, and talked with him, and the messenger then examined him with a book.",
        "source": "T02n0129_001:0843c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難邠坻即讀書訖竟，答使者言：「我有大人當往報之，若聽我者，我當還語卿消息。」",
        "translation": "When he finished reading, Ānanda replied to the messenger, \"I have an elder who will go to him and report to him; if he listens to me, I'll return your message.\"",
        "source": "T02n0129_001:0843c03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便留坐使者，阿難邠坻便到佛所，即前為佛作禮，却長跪叉手白佛言：「今難國王遣使者來到我家，其人狀類黑如鬼，辭言，欲為王太子求我女三摩竭，今當云何？」",
        "translation": "Remaining seated with the messenger, Ānanda then went to the Buddha, paid homage to him, knelt down long with his palms together, and said to the Buddha, \"Now, the king of Nangang sent an envoy to my house, a man with the appearance of a black ghost who said he wanted to ask the king's prince for my daughter Samādhi.",
        "source": "T02n0129_001:0843c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「與之。」",
        "translation": "The Buddha said, \"Give it to him.\"",
        "source": "T02n0129_001:0843c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難邠坻言：「使者黑如鬼，其王太子當何類？",
        "translation": "Ānanda said to him, \"What kind of messenger is black like a ghost, and what kind is the king's prince?",
        "source": "T02n0129_001:0843c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我復曾從佛聞，難國王但事諸尼揵，裸形無有衣被，狀類醜黑，驚怖我女耶？」",
        "translation": "Again, I've heard from the Buddha, \"Did the king of Nanyang serve only nuns, who are naked without clothing and have an ugly, black appearance, and are afraid of my daughter?\"",
        "source": "T02n0129_001:0843c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不也，與之，當知是因緣，三摩竭應當於裸形國度脫八萬人。」",
        "translation": "The Buddha said, \"No, give it to him. You should know that this is the cause and condition by which Samākya will liberate 80,000 people in the land of nakedness.\"",
        "source": "T02n0129_001:0843c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難邠坻不敢復問佛，心懷恨意，即還歸謂使者言：「卿奉王教命，故從遠來求索我女，大善，當相與。」",
        "translation": "Anan Pūrṇa didn't dare to ask the Buddha again, but he harbored resentment and returned to the messenger, saying, \"You've been instructed by the king to come from afar to ask for my daughter; it's very good; you will give her to him.\"",
        "source": "T02n0129_001:0843c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使者聞阿難邠坻言，即還到城外至太子所，便與太子相隨來，到阿難邠坻舍。",
        "translation": "When the messenger heard what Ānanda said, he went back outside the city to the prince's residence and followed him there with the prince to Ānanda's residence.",
        "source": "T02n0129_001:0843c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即從車上下，金銀及禮娉與阿難邠坻，便共請人客，飲食相娛樂七日訖竟，阿難邠坻遣送三摩竭，奴婢衣服及與珍寶無復央數，太子便載三摩竭去還歸本國。",
        "translation": "He then got out of the chariot, gave him gold, silver, and gifts, invited guests, ate and dined them, and finished seven days.",
        "source": "T02n0129_001:0843c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，難國王見子婦來歸即大歡喜，便請其師尼揵若陀弗及萬二千弟子，悉入宮飯之，難國王夫人及太子悉下飯具。",
        "translation": "Seeing his son and wife return, the king of the country of Nang rejoiced and invited his teacher Nirgrantha and 12,000 of his disciples to enter the palace to dine with him, and the wife of the king of Nang and the prince dished out the meal.",
        "source": "T02n0129_001:0843c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，呼三摩竭來出，欲令下飯分共禮諸師。",
        "translation": "They then summoned Samākara to come out and told him to get down to the meal and pay homage to the teachers.",
        "source": "T02n0129_001:0843c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三摩竭適至第三門中，遙見諸尼揵悉羅坐裸形無有衣被，三摩竭即大驚，是為狗畜生無有異，便兩手覆面遙唾之，即還入室不肯復出。",
        "translation": "When he arrived at the third gate, he saw all the nuns sitting naked without any clothing, and he was terrified that they were like dogs and animals with no difference.",
        "source": "T02n0129_001:0843c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸尼揵皆瞋恚三摩竭所，即告王言：「從何得此熒惑不吉利之人在王宮？",
        "translation": "The nikās all became angry with Samākara and told the king, \"How did you get this deceptive, unlucky man to be in the king's palace?",
        "source": "T02n0129_001:0843c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "促遣令去，若不遣去者，當壞敗王國中。」",
        "translation": "Urging them to leave, he said, \"If they don't send them away, they'll be destroyed in the kingdom.\"",
        "source": "T02n0129_001:0843c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸尼揵不肯復飯食，即欲起去，王便辭謝諸師：「我當為大師遣去，明日不復令現於宮中。」",
        "translation": "The nuns refused to eat again and wanted to leave, so the king thanked the teachers, \"I will send the great teacher away, and tomorrow I won't allow him to appear in the palace again.\"",
        "source": "T02n0129_001:0844a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸尼揵及飯食訖便去。",
        "translation": "The nuns and their meal were finished, and they departed.",
        "source": "T02n0129_001:0844a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即日太子自往至三摩竭所，三摩竭時大瞋恚，教婢令閉門，如是四五日，太子不敢復往。",
        "translation": "That same day, the prince went to Samākara himself, but Samākara became furious and told his maidservant to shut the door.",
        "source": "T02n0129_001:0844a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫人即問太子：「何故不往？」",
        "translation": "The lady then asked the prince, \"Why won't you go?\"",
        "source": "T02n0129_001:0844a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子默聲不言，夫人以知之，即自往到三摩竭所。",
        "translation": "The prince kept silent and didn't say anything, but the lady knew it and went to the samādhi herself.",
        "source": "T02n0129_001:0844a06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「我為子娶若，今當承事我子，何故折辱我子？」",
        "translation": "\"I married Jāo for my son, and now I will serve my son; why are you insulting him?\"",
        "source": "T02n0129_001:0844a07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三摩竭答言：「夫人子所事師及國中人民，皆如狗畜生無有異。」",
        "translation": "Samarkand answered, \"The teachers your sons serve and the people of your country are no different than dogs and animals.\"",
        "source": "T02n0129_001:0844a08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫人聞之大慚愧，即還白王言：「大王！",
        "translation": "Hearing this, the lady was greatly ashamed and returned to the king, saying, \"Great king!",
        "source": "T02n0129_001:0844a10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自用道智無雙，國中無有可王意者，王迺勞群臣八千里求婦。",
        "translation": "Because of his own unsurpassed knowledge of the Way, there's no one in the country who meets the king's expectations, so the king relies on a group of ministers to look for a woman 8,000 miles away.",
        "source": "T02n0129_001:0844a10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今婦無所畏難，折辱我子，復面罵我，言比狗畜生。」",
        "translation": "Now, she has no fear, humiliates my son, and insults me with her face, saying, 'I'm like a dog or an animal.'",
        "source": "T02n0129_001:0844a12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞夫人言，即自往到三摩竭所。",
        "translation": "When the king heard what the woman said, he went to Samarkand on his own.",
        "source": "T02n0129_001:0844a13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，三摩竭大憍慢，不肯出為王作禮。",
        "translation": "At the time, Samagara was greatly arrogant and wouldn't come out to pay homage to the king.",
        "source": "T02n0129_001:0844a14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即遙問三摩竭：「我行八千里娶若，以賢善故。",
        "translation": "The king then asked Samākara from a distance, \"I traveled 8,000 miles to marry Rājñā because I'm good.",
        "source": "T02n0129_001:0844a15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若間者既辱我師，今復面罵夫人及太子，豈有不可乎？」",
        "translation": "Would it be wrong for someone to insult my teacher and now scold the wife and the prince in person?\"",
        "source": "T02n0129_001:0844a16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三摩竭報言：「然。",
        "translation": "The samāgata replied, \"Yes.",
        "source": "T02n0129_001:0844a17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王師及夫人太子并其國中人民，皆如狗畜生無異。」",
        "translation": "The king's mentor, his wife, the prince, and the people of his kingdom are no different than dogs and animals.\"",
        "source": "T02n0129_001:0844a17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即驚言：「是小女子！",
        "translation": "The king then was startled and said, \"That's a little girl!",
        "source": "T02n0129_001:0844a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今折辱我如是，我恐智從腹中橫出以鐵鍱我腹，我日飯諸道士萬餘人，誰能及我者？",
        "translation": "Now, if you insult me like this, I'm afraid that wisdom will come out of my belly and flatten my belly with iron.",
        "source": "T02n0129_001:0844a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今汝交面相罵？」",
        "translation": "Now, you're going to cross swords with me?\"",
        "source": "T02n0129_001:0844a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三摩竭言：「王國中人民所事師，常無有衣裳裸形相視，當有何等道？",
        "translation": "The samāgata said, \"What kind of path would there be for a teacher serving the people of a kingdom who is always without robes and looks at them naked?",
        "source": "T02n0129_001:0844a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設使有道，尚不足以貴，何況無道？",
        "translation": "Even if there is the Way, it is not enough to be valuable, so why should there not be the Way?",
        "source": "T02n0129_001:0844a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T02n0129_001:0844a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖日飯是輩萬餘人者，皆是我所不恭敬輩，常唾賤者。」",
        "translation": "Even though there are tens of thousands of people among this group who eat meals every day, they are all disrespectful to me and always despise me.\"",
        "source": "T02n0129_001:0844a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，難國王大窮，即自思惟：「當共誰議是事？」",
        "translation": "At the time, the king of the country of Nāland was greatly destitute, and he thought to himself, \"With whom will we discuss this matter?\"",
        "source": "T02n0129_001:0844a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即自往到尼揵若陀弗所，前為師作禮白言：「我娶婦以於舍衛國得婦，間者無狀，既折辱大師，今復憍慢面罵我及夫人太子，比狗畜生。",
        "translation": "He went to Nirgrantha and paid homage to his teacher, saying, \"I married a woman and obtained a wife in Śrāvastī; some of them had no form, and they insulted the teacher and now they're arrogantly insulting me and my wife and prince, who are like dogs and animals.",
        "source": "T02n0129_001:0844a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖是婦，不以婦禮事我，今當云何？」",
        "translation": "Even though she's a woman, she doesn't serve me with the respect of a woman, so what will happen now?\"",
        "source": "T02n0129_001:0844a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師告王：「復往問之，言：『汝國中人民所事，何如我國中人民所事？』",
        "translation": "The teacher told the king, \"Again, he went back to them and asked, 'What are the people of your country doing that's like what the people of my country are doing?'",
        "source": "T02n0129_001:0844b01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如何等言。",
        "translation": "What did he say?",
        "source": "T02n0129_001:0844b02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王往，慎勿得瞋怒，徐問之，自當有語。」",
        "translation": "The king must go, be careful not to become angry, and ask nicely about it; you will have something to say.\"",
        "source": "T02n0129_001:0844b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即受教，如師所言，便至三摩竭所問言：「汝國中人民所事，何用勝我國中人民所事？」",
        "translation": "The king then accepted the teaching, did as his teacher had told him, and went to Samarkand and asked, \"What is the purpose of doing what the people in your country do that's better than doing what the people in my country do?\"",
        "source": "T02n0129_001:0844b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三摩竭言：「我國中人民所事最尊，男女皆有衣裳，尊卑異路，身體不相見。",
        "translation": "The samāgata said, \"In my country, the people are held in the highest regard, men and women are clothed, and there are different paths for noble and base people, so their bodies don't see each other.",
        "source": "T02n0129_001:0844b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現有大小名佛，教授數千億萬人，皆令得度世泥洹道，入火不燒、入水不溺。",
        "translation": "There are well-known buddhas, large and small, who teach hundreds of billions of people, causing them to attain the path to world-transcending nirvāṇa, where they enter fire and aren't burned and enter water and don't drown.",
        "source": "T02n0129_001:0844b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能典攬三千大千日月、萬二千億天地，變化入無間出無孔，知當來過去今現在事，身有三十二相、八十種好，道德通達，諸天帝王人民雜會稽首來謁。」",
        "translation": "They can comprehend 3,000,000 suns and moons, 1,200,000,000,000 heavens and earth, change into and out of nothing, know past and present events in the future, have thirty-two bodily characteristics and eighty kinds of beauty, and have moral comprehension, and the gods, gods, emperors, and people assemble to pay homage to them.\"",
        "source": "T02n0129_001:0844b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞三摩竭語，即大踊躍歡喜。",
        "translation": "When the king heard what Samākara said, he rejoiced with great joy.",
        "source": "T02n0129_001:0844b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，難國王告三摩竭言：「汝所事佛，寧可得見不？」",
        "translation": "It was then that the king of the country of Nang told Samākara, \"Would it be possible to see the Buddha you're working for?\"",
        "source": "T02n0129_001:0844b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三摩竭言：「我能為大王遙請之，即可致。」",
        "translation": "Samākara said, \"I can invite it for the king from afar, and it will come.\"",
        "source": "T02n0129_001:0844b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「大善！",
        "translation": "The king said, \"Very good!",
        "source": "T02n0129_001:0844b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迺相去八千里，請佛當云何？」",
        "translation": "What would the Buddha do if we were separated by 8,000 miles?\"",
        "source": "T02n0129_001:0844b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三摩竭言：「不須大王遣人請，但當至意遙燒香請也。",
        "translation": "The samādhi said, \"The king doesn't need to send someone to invite him, but rather you must burn incense with the greatest intention.",
        "source": "T02n0129_001:0844b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛神通照知人心中所念，王夫人及太子皆當隨我後。」",
        "translation": "The Buddha's supernormal ability to know what's in a person's mind will allow the king, his wife, and the crown prince to follow me.\"",
        "source": "T02n0129_001:0844b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三摩竭即自上高臺上，政服便向舍衛國長跪燒香，持頭面著地作禮言：「今難國王，不知天下有佛，當用一切人民故，哀悲諸懃苦，願佛明旦與諸比丘僧，勞屈尊神來到難國王所飯。」",
        "translation": "Samākara then got himself up on a high dais, knelt down in his robes, burned incense in front of Śrāvastī, held his head to the ground, and paid homage, saying, \"Now, the king of the country of Nāland doesn't know that there's a Buddha under the heavens, so he will use all his people to sympathize with their suffering.",
        "source": "T02n0129_001:0844b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言適竟，香煙便達佛所，遶佛三匝於佛上化作香蓋。",
        "translation": "When he finished speaking, the smoke from the incense reached the Buddha, circled him three times, and turned into a scented canopy over him.",
        "source": "T02n0129_001:0844b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛時適為無數千人說法，爾時，阿難前長跪叉手白佛言：「是何等感應迺爾？",
        "translation": "When the Buddha was about to preach to countless thousands of people, Ānanda knelt down and saluted the Buddha with his palms together, saying, \"What kind of sensation is this?",
        "source": "T02n0129_001:0844b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願佛解說其意。」",
        "translation": "May the Buddha explain what he means.\"",
        "source": "T02n0129_001:0844b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「難國王及三摩竭，明旦當請佛及諸比丘僧。",
        "translation": "The Buddha told Ānanda, \"The king of the country of Nang and Samāgata will invite the Buddha and the monks and nuns tomorrow morning.",
        "source": "T02n0129_001:0844b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三摩竭有至心，欲令難國人民悉捨邪見、令向正道，香來至此請佛。」",
        "translation": "The samāgata has a sincere desire to cause all the people of the difficult country to abandon wrong views and turn to the right path, so he'll come here and invite the Buddha.\"",
        "source": "T02n0129_001:0844b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，即告摩訶目揵連勅諸比丘僧，明旦當到難國三摩竭所食。",
        "translation": "Mahāmaudgalyāyana then told the monks and nuns that he would tell them to come to Samākara in Nangok tomorrow morning to eat there.",
        "source": "T02n0129_001:0844b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩訶目連受佛教，即宣語諸比丘：「明日當就請，勿得他餘行。」",
        "translation": "Accepting the Buddha's teaching, Mahāmaudgalyāyana then announced to the monks, \"Tomorrow, you'll invite them there; don't do anything else.\"",
        "source": "T02n0129_001:0844c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是三摩竭，皆令王、夫人、太子及諸婇女，齋戒燒香布坐席，設飯食具悉辦。",
        "translation": "The Samāgata then caused the king, his wife, the crown prince, and their daughters to observe precepts, burn incense, spread out seats, and prepare a meal.",
        "source": "T02n0129_001:0844c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三摩竭知佛當來，與王、夫人、太子、婇女及諸尼揵共住中庭。",
        "translation": "Knowing that the Buddha was coming, Samākya stayed in the courtyard with the king, his wife, the crown prince, the women and the nuns.",
        "source": "T02n0129_001:0844c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三摩竭告王、夫人、太子：「皆隨我後，今諸羅漢當先來至，佛最在後。",
        "translation": "Samākara told the king, his wife, and the prince, \"They'll all follow me, and now the arhats will come first, with the Buddha at the very back.",
        "source": "T02n0129_001:0844c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卿曹慎莫驚怖，隨我所為。」",
        "translation": "Please don't be frightened, and do as I do.\"",
        "source": "T02n0129_001:0844c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三摩竭於是復長跪燒香言：「飯具已辦，願佛用時。」",
        "translation": "Samākara then knelt down again and burned incense, saying, \"The meal is ready, may the Buddha use it when he wants it.\"",
        "source": "T02n0129_001:0844c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知三摩竭心所念，即告諸比丘：「今日當到難國食，爾曹各以道變化自在所為。」",
        "translation": "Knowing what Samādhi was thinking, the Buddha addressed the monks, \"Today, we will go to the country of Nāland to eat, so each of you will do as you please with your own transformation of the path.\"",
        "source": "T02n0129_001:0844c09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘即受教，中有化作龍虎鳳凰、孔雀牛鳩鴿、百鳥梟獸交露帳者，諸眾僧悉在其中坐，各各皆不同。",
        "translation": "The monks then accepted the teaching, and some of them were transformed into dragons, tigers, phoenixes, peacocks, cattle, doves, and a hundred birds and lions, all of whom were seated in the open canopy, each with a different person.",
        "source": "T02n0129_001:0844c11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛自坐師子交露帳中，即與千二百五十比丘、五百菩薩、諸天鬼神龍俱，從虛空中神足飛行。",
        "translation": "Sitting by himself in the lion's dwelling, the Buddha flew out of the sky with his spiritual legs, accompanied by 1,250 monks, 500 bodhisattvas, gods, spirits, and dragons.",
        "source": "T02n0129_001:0844c13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "適至難國，佛便放光明，天地大震動，諸羅漢菩薩各悉作變化先來下，難國人民見此變化皆大驚怖。",
        "translation": "When he arrived at the country of Nang, the Buddha then radiated his radiance, causing the heavens and earth to shake greatly, and the arhats and bodhisattvas each made a transformation before coming down, and the people of Nang were terrified when they saw that transformation.",
        "source": "T02n0129_001:0844c16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王問三摩竭言：「是佛不也？」",
        "translation": "The king asked Samākara, \"Is that the Buddha?\"",
        "source": "T02n0129_001:0844c18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「非佛。」",
        "translation": "He replied, \"Not the Buddha.\"",
        "source": "T02n0129_001:0844c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三摩竭告王：「勿恐，是諸弟子也。",
        "translation": "The samāgata told the king, \"Don't be afraid, for these are his disciples.",
        "source": "T02n0129_001:0844c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛最在後，身中有三十二相、八十種好。」",
        "translation": "The Buddha is most certainly at the back, and in his body there are thirty-two marks and eighty kinds of beauty.\"",
        "source": "T02n0129_001:0844c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須臾之間佛俱從上來下，釋梵四天王在前導，諸天鼓琴作其倡伎而樂佛。",
        "translation": "In a moment's time, the Buddha descended from above with the four Śakra celestial kings in front of him, and the gods played their lutes and music to the Buddha.",
        "source": "T02n0129_001:0844c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三摩竭與王、夫人、太子，即持華香迎佛，前為佛作禮，便相將入宮即就座。",
        "translation": "The samāgatas, the king, the lady, and the prince greeted the Buddha with flowers and incense, paid homage to him, and then they all entered the palace and took their seats.",
        "source": "T02n0129_001:0844c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩、阿羅漢皆前坐，大小相次，三摩竭即令王、夫人、太子前行澡水，便下飯食具，國中人民來觀者甚眾多，王令大臣閉宮門。",
        "translation": "The bodhisattvas and arhats all sat down in front of him, taking their places in order of size. Samākya then caused the king, his wife, and the crown prince to wash their heads in water and then put down a table with food.",
        "source": "T02n0129_001:0844c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人民見王閉宮門，大瞋恚王所，各持斧欲破宮門。",
        "translation": "When the people saw that the king had closed the palace gates, they became very angry with the king and each of them wanted to break down the palace gate with an ax.",
        "source": "T02n0129_001:0844c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛遙知之，言：「我所行化，皆欲令作善，今難國人民皆來觀，而王閉宮門也。」",
        "translation": "The Buddha knew this from a distance and said, \"My mission is to make people do good deeds, and now the people of the country of Nangang come to watch while the king closes the palace gates.\"",
        "source": "T02n0129_001:0844c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛爾時，欲令一切人等見佛，即使宮門牆壁悉化作水精色，內外相見，難國人民見佛及諸菩薩、羅漢，皆大歡喜。",
        "translation": "At the time, the Buddha wanted to make all the people see the Buddha, so even though the palace gates and walls were transformed into the color of water essence, the inside and outside were visible, and the people of the country of Nang were overjoyed to see the Buddha and the bodhisattvas and arhats.",
        "source": "T02n0129_001:0844c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛有一羅漢名賓頭盧，時坐山上忽忘至難國，賓頭盧坐來久，適欲以針縫縷衣，以鍼刺地，縷與衣相連。",
        "translation": "At the time, the Buddha had a arhat named Piṇḍola who was sitting on a mountain and suddenly forgot to come to the country of Nang, and Piṇḍola had been sitting there for a long time when he wanted to sew a threaded robe with a needle.",
        "source": "T02n0129_001:0845a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時佛已應難國王宮中坐已，賓頭盧即以神足飛行至難國，山便隨賓頭盧後。",
        "translation": "After the Buddha had responded to his request to sit in the palace of the king of the country of Nang, Piṇḍola then flew with his spiritual legs to the country of Nang, and the mountain followed Piṇḍola.",
        "source": "T02n0129_001:0845a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，國中有一女人懷軀，見山來政黑恐墮其上，便大惶怖即墮軀。",
        "translation": "At the time, there was a woman in the country who was pregnant and saw the mountain coming, and she was afraid that she might fall on it.",
        "source": "T02n0129_001:0845a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以遙知之，即令摩訶目連以神足飛行迎問：「賓頭盧！",
        "translation": "Knowing this from a distance, the Buddha caused Mahāmaudgalyāyana to fly with supernormal powers to greet her, \"Piṇḍola!",
        "source": "T02n0129_001:0845a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝後何等？」",
        "translation": "What's after you?\"",
        "source": "T02n0129_001:0845a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賓頭盧即還顧見山，以手攬山擲故處八千里。",
        "translation": "Bindūra then looked back at the mountain and tossed it 8,000 miles from his former spot with his hand.",
        "source": "T02n0129_001:0845a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，賓頭盧即到前，為佛作禮却坐。",
        "translation": "At that point, Piṇḍola went up to the Buddha, paid homage to him, and withdrew to sit down.",
        "source": "T02n0129_001:0845a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告賓頭盧：「我教天下人欲令悉度世，今汝既失期，復殺一人。",
        "translation": "The Buddha told Piṇḍola, \"I taught the whole world to want everyone to be saved, but now you've missed the deadline and killed another person.",
        "source": "T02n0129_001:0845a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人命至重，是我道所不喜。",
        "translation": "Human life is extremely important, and it's not pleasing to my Way.",
        "source": "T02n0129_001:0845a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝從今已後，不得復隨我食及與眾會。",
        "translation": "From now on, you mustn't follow me to eat or to gather with the people again.",
        "source": "T02n0129_001:0845a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若當留住，後須彌勒佛出，迺般泥洹去耳。」",
        "translation": "If you stay, you'll need Maitreya Buddha to emerge later, then you'll be able to leave Parinirvāṇa.\"",
        "source": "T02n0129_001:0845a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賓頭盧聞佛說如是，即默然憂愁復自悔責，食訖便起前為作禮，及諸菩薩、阿羅漢共辭，便入山中。",
        "translation": "Hearing that the Buddha had spoken thus, Piṇḍola was silent and sad, and he repented himself.",
        "source": "T02n0129_001:0845a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，難國王師尼揵若陀弗白佛言：「寧可共捔道不？",
        "translation": "Nirgrantha Buddha, the king of Nandanavana's teacher, then said to the Buddha, \"Would it be possible to share a common path?",
        "source": "T02n0129_001:0845a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不如者當投著井中。」",
        "translation": "If you don't, you'll throw yourself into a well.\"",
        "source": "T02n0129_001:0845a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「大善！",
        "translation": "The Buddha said, \"Very good!",
        "source": "T02n0129_001:0845a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不須多言，三問不如者，當投著井中。」",
        "translation": "Without further ado, anyone who doesn't answer these three questions will be thrown into a well.\"",
        "source": "T02n0129_001:0845a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尼揵若陀弗言：「大善！」",
        "translation": "Nirgrantha-devatā said, \"Very good!\"",
        "source": "T02n0129_001:0845a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即問：「若誦經時云何？」",
        "translation": "The Buddha then asked, \"What happens when you recite the sūtras?\"",
        "source": "T02n0129_001:0845a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尼揵若陀弗言：「我誦經時匍匐而行。」",
        "translation": "Nirgrantha-devatā said, \"I prostrate myself when I recite the sūtras.\"",
        "source": "T02n0129_001:0845a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「匍匐而行是為狗，狗迺匍匐而行。」",
        "translation": "\"A dog that prostrates itself and walks is a dog, and a dog can prostrate itself.\"",
        "source": "T02n0129_001:0845a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尼揵若陀弗便不如佛，諸弟子皆瞋，餘語為賜那正說是事也，悉還恚其師所，取師欲投著井中，師即大惶怖，以兩手拒地不肯入井中。",
        "translation": "Nirgrantha then didn't like the Buddha, and the disciples were all angry.",
        "source": "T02n0129_001:0845a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「置之。」",
        "translation": "The Buddha said, \"Put it away.\"",
        "source": "T02n0129_001:0845a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，中庭自然有大火出，其焰上詣第七梵天，其火中自然有千葉蓮華，華上有五百梵天，皆叉手長跪問佛：「飯何等人得福多者？",
        "translation": "A great fire then naturally broke out in the atrium, and its flames rose to the seventh Brahma heaven, where there was naturally a thousand-leaf lotus flower in the midst of the fire, and on top of the flower were five hundred Brahmā gods, all kneeling with their palms together and asking the Buddha, \"Who among us has attained much merit?",
        "source": "T02n0129_001:0845a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "飯何等人得福少者？」",
        "translation": "What kind of person receives little merit in this life?\"",
        "source": "T02n0129_001:0845b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛答梵天言：「譬如以五種穀散著火中，為生不？」",
        "translation": "The Buddha answered the Brahmā, \"Suppose you were to put five kinds of grain scattered in a fire, would they grow?\"",
        "source": "T02n0129_001:0845b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天言：「不生。」",
        "translation": "The Brahmadeva said, \"It won't arise.\"",
        "source": "T02n0129_001:0845b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「難國王前後所飯諸尼揵，譬如五穀著火中，終不復生；今日飯佛及諸菩薩、羅漢，得福多無有量。",
        "translation": "The Buddha said, \"The nuns the king of Nangok had fed before and after him were like five grains caught in a fire that never grow back, but today they've fed the Buddha and the bodhisattvas and arhats, and the merit they've attained is incalculable.",
        "source": "T02n0129_001:0845b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如人有好地有好種，天復時雨，何憂不生？",
        "translation": "It's like a person who has good ground and good seeds, and it rains again from time to time, why would they worry that they won't grow?",
        "source": "T02n0129_001:0845b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今佛是一切人福田，隨人所種必得其願。",
        "translation": "\"Now, the Buddha is a field of merit for all people, and whatever a person sows will obtain their wish.",
        "source": "T02n0129_001:0845b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愚癡人喜教他為外道，是人命盡皆當墮太山地獄中甚懃苦，悔無所復及，前人坐之未出，後人復教作之，世間人愚癡，但更相欺調，是故不知真道。",
        "translation": "Foolish people who delight in teaching others to be non-Buddhists will all fall into the Taishan hell when their lives are up, suffer greatly, and regret that there's nothing more to be done, and those who sat there before them haven't gotten out, and those who come after them will teach them to do it again.",
        "source": "T02n0129_001:0845b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有黠人當學正道，其道不生不老不病不死，是為泥洹大道。",
        "translation": "If there are astute people who will train on the right path, that path of no birth, no aging, no illness, and no death is the great path of nirvāṇa.",
        "source": "T02n0129_001:0845b12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間凡有九十六種道，皆不及佛道。」",
        "translation": "There are 96 kinds of paths in the world, but none of them is like the Buddha's path.\"",
        "source": "T02n0129_001:0845b13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「以一天下樹枝及與鳥毛，作筆書佛經，樹枝鳥毛悉皆可盡，佛智不可盡；大如須彌山墨磨研，四海水沾筆，須彌山墨、四海水皆可盡，佛智終不可盡。」",
        "translation": "The Buddha said, \"If you were to use a branch of a tree or bird feathers under the sky to write a sutra on the Buddha, the branches and bird feathers would all be exhaustible, but the Buddha's wisdom wouldn't be exhaustible; it would be as big as grinding and polishing Sumeru's ink and dipping the brush into the four rivers of water, and Sumeru's ink and the four rivers of water would be exhaustible, but the Buddha's wisdom would never be exhaustible.\"",
        "source": "T02n0129_001:0845b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五百梵天聞佛語，應時舉聲言：「善哉！",
        "translation": "When the five hundred brahma heavens heard what the Buddha said, they raised their voices in response and said, \"Good!",
        "source": "T02n0129_001:0845b18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "審如佛所言。」",
        "translation": "\"Examine it as the Buddha has said.\"",
        "source": "T02n0129_001:0845b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是五百梵天忽然不見。",
        "translation": "Then, the five hundred brahma gods suddenly disappeared.",
        "source": "T02n0129_001:0845b19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，難國王眷屬三百人，千二百婇女，五百大臣，見佛變化，皆踊躍歡喜，悉發阿耨多羅三藐三菩提心。",
        "translation": "At the time, 300 members of the king of Nangok's retinue, 1,200 Ṛṣipatana women, and 500 ministers rejoiced when they saw the Buddha's transformation, and they all aroused the mind of unsurpassed, correct enlightenment.",
        "source": "T02n0129_001:0845b19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二千婆羅門即除鬚髮皆作比丘，應時悉得羅漢道。",
        "translation": "Those 2,000 brāhmaṇas then removed their hair and became monks, and at that time they all attained the path of the arhat.",
        "source": "T02n0129_001:0845b22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "萬二千尼揵應時悉解脫，中有得須陀洹道者，有得斯陀含道者，有得阿那含道者。",
        "translation": "At that time, 12,000 nuns were liberated, some of whom had attained the path of stream entry, some had attained the path of once-returner, and some had attained the path of non-returner.",
        "source": "T02n0129_001:0845b23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國中細民復有六萬四千人，皆信向佛法。",
        "translation": "Still, 64,000 of the country's small people believed and turned to the Buddha's teachings.",
        "source": "T02n0129_001:0845b25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即受五戒悉為優婆塞。",
        "translation": "They then received the five precepts and became laymen.",
        "source": "T02n0129_001:0845b26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說經已，即與諸菩薩、阿羅漢俱現神足飛去。",
        "translation": "After the Buddha taught the sūtra, he flew away with the bodhisattvas and arhats on their spiritual legs.",
        "source": "T02n0129_001:0845b26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，難國王及夫人、太子、群臣、人民，皆大歡喜，悉持頭著地，遙為佛作禮。",
        "translation": "At the time, the king of the country of Nang, his wife, the crown prince, the ministers, and the people were all overjoyed, held their heads to the ground, and paid homage to the Buddha from a distance.",
        "source": "T02n0129_001:0845b27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說三摩竭經",
        "translation": "Samāgatha-sūtra",
        "source": "T02n0129_001:0845c01_0",
        "is_bad_quality": false
    }
]