[
    {
        "source_sentence": "佛說戒德香經",
        "translation": "Foshuo jiede xiang jing",
        "source": "T02n0116_001:0507b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東晉天竺三藏竺曇無蘭譯",
        "translation": "Translated by Zhu Tanwulan, the Tripiṭaka of the Eastern Jin dynasty",
        "source": "T02n0116_001:0507b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時，佛遊舍衛國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha traveled to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0116_001:0507b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，賢者阿難閑居獨思：「世有三香，一曰根香，二曰枝香，三曰華香，是三品香唯隨風香不能逆風，寧有雅香隨風逆風者乎？」",
        "translation": "Then, the good man Ānanda was living alone, thinking, \"There are three kinds of fragrance in the world: first, the fragrance of roots, second, the fragrance of branches, and third, the fragrance of flowers.",
        "source": "T02n0116_001:0507b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢者阿難獨處思惟此義所歸，不知所趣，即從坐起往詣佛所，稽首佛足下，長跪叉手而白佛言：「我獨處思惟，世有三香，一曰根香，二曰枝香，三曰華香，此三品香唯能隨風不能逆風，寧有雅香隨風逆風者乎？」",
        "translation": "Being alone, the good man Ānanda considered what this meant and didn't know what to expect. He got up from his seat, went to the Buddha, bowed his head at his feet, knelt down with his palms together, and said to the Buddha, \"When I was alone, I considered, 'There are three kinds of fragrance in the world: first, the fragrance of roots, second, the fragrance of branches, and third, the fragrance of flowers.",
        "source": "T02n0116_001:0507b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「善哉！",
        "translation": "The Buddha told Ānanda, \"Good!",
        "source": "T02n0116_001:0507b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T02n0116_001:0507b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誠如汝問，有香真正隨風逆風。」",
        "translation": "Just as you asked, there's a real fragrance that follows the wind and goes against it.\"",
        "source": "T02n0116_001:0507b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛：「願聞其香。」",
        "translation": "Ānanda said to the Buddha, \"I wish to hear its fragrance.\"",
        "source": "T02n0116_001:0507b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若於郡國縣邑村落，有善男子善女人，修行十善，身不殺、盜、淫，口不妄言、兩舌、惡口、綺語，意不嫉妬、恚、癡，孝順父母，奉事三尊，仁慈道德威儀禮節，東方無數沙門梵志歌頌其德，南西北方四維上下沙門梵志咸歌其德：『某郡國土縣邑村落，有善男子善女人，奉行十善敬事三寶，孝順仁慈道德恩義不失禮節。』",
        "translation": "The Buddha said, \"If there are good men and good women in a county, town, or village who cultivate the ten good qualities, don't kill, steal, or commit sexual misconduct physically, don't engage in false speech, duplicity, harsh words, or fancy speech, don't be jealous, resentful, or deluded mentally, are filial to their parents, serve the Three Treasures, and are kind, moral, dignified, and respectful, then countless ascetics and priests in the east will sing their praises, and ascetics and priests up and down the four counterpoints in the south, west, and north will sing their praises, 'There are good men and good women in a county, town, town, or village who cultivate the ten good qualities, serve the Three Treasures, are filial, kind, moral, and gracious, and don't lose their decorum.'",
        "source": "T02n0116_001:0507b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是香名曰隨風逆風靡不周照，十方宣德一切蒙賴。」",
        "translation": "This is called a fragrance that follows the wind and illuminates everything against the wind, proclaiming virtue in all directions and making them all rely on it.\"",
        "source": "T02n0116_001:0507c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛時頌曰：「雖有美香花，　　不能逆風熏，　不息名栴檀，　　眾雨一切香。",
        "translation": "The Buddha then spoke in verse, \"Although there's a beautiful fragrant flower that doesn't perfume against the wind, it doesn't rest and is called sandalwood, and all the rain is fragrant.",
        "source": "T02n0116_001:0507c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　志性能和雅，　　爾乃逆風香，　正士名丈夫，　　普熏于十方。",
        "translation": "Its aspiration is gentle and elegant, so it's a fragrance that goes against the wind, and the right person is called a husband, which thoroughly perfumes the ten directions.",
        "source": "T02n0116_001:0507c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　木蜜及栴檀，　　青蓮諸雨香，　一切此眾香，　　戒香最無上。",
        "translation": "The fragrance of wood, honey, sandalwood, and the scent of the blue lotus rain are all numerous, but the fragrance of precepts is most unsurpassed.",
        "source": "T02n0116_001:0507c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是等清淨者，　　所行無放逸，　不知魔徑路，　　不見所歸趣。",
        "translation": "Such a pure person practices without dissipation, doesn't know the path of Māra, and doesn't see the destination to which they're returning.",
        "source": "T02n0116_001:0507c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此道至永安，　　此道最無上，　所獲斷穢源，　　降伏絕魔網。",
        "translation": "This path leads to eternal peace, and it's the most unsurpassed path, which ends the sources of defilement and subdues the web of devils.",
        "source": "T02n0116_001:0507c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　用上佛道堂，　　昇無窮之慧，　以此宣經義，　　除去一切弊。」",
        "translation": "They use it to ascend to the Buddha's hall of enlightenment, ascend to infinite wisdom, and use it to proclaim the sūtras' teachings and remove all ills.\"",
        "source": "T02n0116_001:0507c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「是香所布，不礙須彌山川天地，不礙四種地水火風，通達八極上下亦然，無窮之界咸歌其德。",
        "translation": "The Buddha told Ānanda, \"This is the kind of fragrance that spreads, which doesn't obstruct Sumeru's mountains and rivers, heaven and earth, the four kinds of earth, water, fire, and wind, and the eight extremities up and down, so the limitless realms all sing of its virtues.",
        "source": "T02n0116_001:0507c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一身不殺生，世世長壽，其命無橫。",
        "translation": "When a person doesn't kill, their life is long and unobstructed.",
        "source": "T02n0116_001:0507c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不盜竊者，世世富饒又不妄遺財寶常存，施為道根。",
        "translation": "Someone who doesn't steal will have worldly prosperity and won't be remiss in leaving their possessions and property in perpetuity, making giving the root of the path.",
        "source": "T02n0116_001:0507c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不婬色者，人不犯妻，所在化生蓮華之中。",
        "translation": "Someone who doesn't commit sexual misconduct doesn't have a wife, and they're born among the lotus flowers in their transformation.",
        "source": "T02n0116_001:0507c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不妄言者，口氣香好言輒信之。",
        "translation": "Someone who doesn't lie will have a pleasant breath and will readily believe what they say.",
        "source": "T02n0116_001:0507c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不兩舌者，家常和合無有別離。",
        "translation": "Someone who isn't duplicitous will have their family always be united, and there'll be no separation.",
        "source": "T02n0116_001:0507c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不惡口者，其舌常好言辭辯通。",
        "translation": "Someone who doesn't speak harshly will always have a tongue that's well-spoken and articulate.",
        "source": "T02n0116_001:0507c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不綺語者，人聞其言莫不諮受宣用為珍。",
        "translation": "Someone who doesn't speak harshly will have their words accepted and proclaimed as precious by everyone who hears them.",
        "source": "T02n0116_001:0507c23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不嫉妬者，世世所生眾人所敬。",
        "translation": "Someone who isn't jealous is born from the world and is respected by many people.",
        "source": "T02n0116_001:0507c24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不瞋恚者，世世端正人見歡喜。",
        "translation": "Not malevolent, he's correct from age to age and is welcomed by people who see him.",
        "source": "T02n0116_001:0507c25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除愚癡者，所生智慧靡不諮請，捨于邪見常住正道，從行所得各自然生，故當棄邪從其真妙。」",
        "translation": "Whoever is free of folly, the wisdom that arises is not consulted, and whoever abides in the right path free of wrong views and follows the practices that lead to their natural production, therefore you must abandon wrong and follow its true wonders.\"",
        "source": "T02n0116_001:0507c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "Thus did the Buddha speak.",
        "source": "T02n0116_001:0507c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸比丘聞之歡喜，作禮而去。",
        "translation": "When the monks heard this, they rejoiced, paid homage, and departed.",
        "source": "T02n0116_001:0507c28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說戒德香經",
        "translation": "Foshuo jiede xiang jing",
        "source": "T02n0116_001:0508a01_0",
        "is_bad_quality": false
    }
]