[
    {
        "source_sentence": "增壹阿含經序",
        "translation": "Preface to the Increased by One Āgama Sutras",
        "source": "T02n0125_001:0549a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "晉沙門釋道安撰",
        "translation": "By Shi Daoyan, a Jin ascetic",
        "source": "T02n0125_001:0549a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四阿含義同，中阿含首以明其旨，不復重序也。",
        "translation": "The four Āgamas have the same meaning, and the Āgamas are the first to clarify their purpose, without reordering them.",
        "source": "T02n0125_001:0549a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "增壹阿含者，比法條貫以數相次也。",
        "translation": "Increasing by one in the Āgamas is a method of comparing and contrasting phenomena in order of number.",
        "source": "T02n0125_001:0549a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "數終十，令加其一，故曰增一也；且數數皆增，以增為義也。",
        "translation": "The number of the end of ten, so that the addition of one, so it is called increase one; and the number of all increase, in order to increase the meaning of it.",
        "source": "T02n0125_001:0549a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其為法也，多錄禁律，繩墨切厲，乃度世檢括也。",
        "translation": "It is also the Dharma, mostly recorded prohibitions and laws, rope, ink, cutting and severe, is to save the world to check.",
        "source": "T02n0125_001:0549a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外國巖岫之士、江海之人，於四阿含多詠味茲焉。",
        "translation": "Foreign scholars from the mountain peaks and people from the rivers and seas often read and taste this in the four Āgamas.",
        "source": "T02n0125_001:0549a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有外國沙門曇摩難提者，兜佉勒國人也，齠齓出家，孰與廣聞，誦二阿含，溫故日新，周行諸國，無土不涉。",
        "translation": "There was a foreign ascetic named Dharmanandi from the country of Dukhālā who had left home early, who was widely learned, recited the two Āgamas, warmed the old and renewed them day by day, traveled around to various countries, and didn't encounter any land.",
        "source": "T02n0125_001:0549a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以秦建元二十年來詣長安，外國鄉人咸皆善之，武威太守趙文業求令出焉。",
        "translation": "When he arrived in Chang'an in the 20th year of the Qin emperor's reign, all the people of his native land were good to him, and Zhao Wenye, the governor of Wuwei, asked him to allow him to leave.",
        "source": "T02n0125_001:0549a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛念譯傳，曇嵩筆受，歲在甲申夏出，至來年春乃訖，為四十一卷，分為上下部。",
        "translation": "The translation of the biography of Fonian was accepted by Tansong at the end of the summer of the year Jiashen, and was completed in the spring of the following year in forty-one fascicles, divided into an upper and lower part.",
        "source": "T02n0125_001:0549a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上部二十六卷全無遺忘，下部十五卷失其錄偈也。",
        "translation": "The upper twenty-six volumes were completely unforgotten, but the lower fifteen volumes were missing their recorded verses.",
        "source": "T02n0125_001:0549a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "余與法和共考正之，僧[(丰*力)/石]、僧茂助校漏失，四十日乃了。",
        "translation": "I corrected them together with Fahe, and the monks [(Feng*force)/stone] and Sengmao helped to correct the omissions, and it took forty days to finish them.",
        "source": "T02n0125_001:0549a17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此年有阿城之役，伐鼓近郊，而正專在斯業之中。",
        "translation": "In that year, there was a battle at Aśō, and the felling of the drums was near the outskirts, but it was right in the middle of that work.",
        "source": "T02n0125_001:0549a18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "全具二阿含一百卷，鞞婆沙、婆和須蜜、僧伽羅剎，傳此五大經。",
        "translation": "The complete set of the two Āgamas consisted of one hundred volumes, and these five major scriptures were transmitted by Vibhāṣā, Bāṣpaśumitra, and Saṃgharāṣa.",
        "source": "T02n0125_001:0549a19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自法東流，出經之優者也。",
        "translation": "From the eastward flow of the Dharma, these are the best sūtras to come forth.",
        "source": "T02n0125_001:0549a21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四阿含四十應真之所集也，十人撰一部，題其起盡，為錄偈焉，懼法留世久，遺逸散落也。",
        "translation": "The forty Āgamas were collected by Yingzhen, and ten people compiled a single one, titled it after its beginning and end, and recorded it in verse, fearing that the Dharma would remain in the world for a long time and be lost and scattered.",
        "source": "T02n0125_001:0549a21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯土前出諸經班班，有其中者，今為二阿含，各為新錄一卷，全其故目，注其得失，使見經尋之差易也。",
        "translation": "Now, for the two Āgamas, we'll make a new record of one volume each, complete with the old entries and notes on their gains and losses, so that we can see the differences between the sūtras and the searches.",
        "source": "T02n0125_001:0549a23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "合上下部，四百七十二經。",
        "translation": "Together, the above and below comprise four hundred and seventy-two sūtras.",
        "source": "T02n0125_001:0549a26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡諸學士撰此二阿含，其中往往有律語，外國不通與沙彌、白衣共視也。",
        "translation": "Whenever scholars compiled these two Āgamas, they often included vinaya words that could not be shared with novices and laymen in foreign countries.",
        "source": "T02n0125_001:0549a26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而今已後，幸共護之，使與律同，此乃茲邦之急者也。",
        "translation": "Now and hereafter, it's important for this country to protect them together so that they're the same as the Vinaya.",
        "source": "T02n0125_001:0549a28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯諄諄之誨，幸勿藐藐聽也。",
        "translation": "Please don't listen with disdain to this earnest instruction.",
        "source": "T02n0125_001:0549a29_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣見而不知護禁，乃是學士通中創也。",
        "translation": "To see it extensively but not know how to guard the precepts is a travesty of the bachelor's ability to understand the middle way.",
        "source": "T02n0125_001:0549b01_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中本起康孟祥出，出大愛道品，乃不知是禁經，比丘尼法甚慊切真，割而去之，此乃是大鄙可痛恨者也。",
        "translation": "This is a great despicable and hateful thing.",
        "source": "T02n0125_001:0549b02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此二經有力道士乃能見，當以著心焉，如其輕忽不以為意者，幸我同志鳴鼓攻之可也。",
        "translation": "These two scriptures are powerful Taoists can see, should be attached to the heart, if they do not take it seriously, fortunately, our comrades can sound the drum to attack it.",
        "source": "T02n0125_001:0549b04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "增壹阿含經卷第一",
        "translation": "Increased by One Āgama Sutras, Vol. 1",
        "source": "T02n0125_001:0549b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東晉罽賓三藏瞿曇僧伽提婆譯",
        "translation": "Gautama Saṃghadeva Translation of the Tripiṭaka of Kāśmīra, Eastern Jin",
        "source": "T02n0125_001:0549b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "序品第一",
        "translation": "preface to the first rank",
        "source": "T02n0125_001:0549b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自歸能仁第七仙，　　演說賢聖無上軌；　永在生死長流河，　　世尊今為度黎庶。",
        "translation": "I take refuge in the seventh sage who's capable of bestowing merit, who teaches the unsurpassed ways of the noble ones, who's always in the river of birth and death, and who's now the Bhagavān's savior for the common people.",
        "source": "T02n0125_001:0549b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　尊長迦葉及眾僧，　　賢哲阿難無量聞；　善逝泥曰供舍利，　　從拘夷國至摩竭。",
        "translation": "Venerable Kāśyapa and the saṃgha, the wise Ānanda, who has heard measurelessly, and Śrī Siṃhandi, who has offered Śāriputra from Kauśāmbī to Magadha.",
        "source": "T02n0125_001:0549b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　迦葉端思行四等，　　此眾生類墜五道；　正覺演道今去世，　　憶尊巧訓懷悲泣。",
        "translation": "Kāśyapa thoroughly contemplates the four levels of practice, as these sentient beings fall into the five destinies; the path of right awakening and enlightenment has now passed away, and I recall the honored one's skillful teaching with sadness and tears.",
        "source": "T02n0125_001:0549b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　迦葉思惟正法本，　　云何流布久在世？",
        "translation": "Kāśyapa considered the source of the right teaching, \"How has it been disseminated in the world for a long time?",
        "source": "T02n0125_001:0549b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　最尊種種吐言教，　　總持懷抱不漏失。",
        "translation": "\"The most honored one spouts out various teachings, maintaining them in his arms without losing sight of them.",
        "source": "T02n0125_001:0549b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　誰有此力集眾法，　　在在處處因緣本？",
        "translation": "Who has this power to gather all dharmas, which have their origins in causes and conditions everywhere?",
        "source": "T02n0125_001:0549b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今此眾中智慧士，　　阿難賢善無量聞。",
        "translation": "\"Now, among these wise men, Ānanda is a good and immeasurable hearer.",
        "source": "T02n0125_001:0549b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　即擊揵椎集四部，　　比丘八萬四千眾，　盡得羅漢心解脫，　　以脫縛著處福田。",
        "translation": "He then struck a gandharva and gathered together four groups of monks, 84,000 of whom were liberated from the arhat's mind and liberated from the field of merit that was the site of their fetters.",
        "source": "T02n0125_001:0549b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　迦葉哀愍於世故，　　加憶尊恩過去報；　世尊授法付阿難，　　願布演法長存世。",
        "translation": "Because of Kāśyapa's pity for the world, he remembered the rewards of his venerable friend's kindness in the past. The Bhagavān gave Ānanda the teaching, wishing to spread and expound the teaching for a long time.",
        "source": "T02n0125_001:0549b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何次第不失緒？",
        "translation": "\"How can we follow the steps without losing our readiness?",
        "source": "T02n0125_001:0549b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　三阿僧祇集法寶，　使後四部得聞法，　　已聞便得離眾苦。",
        "translation": "Three incalculable years of collecting the treasures of the Dharma enable the last four groups to hear the Dharma, and once they've heard it, they'll be freed from all suffering.",
        "source": "T02n0125_001:0549b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　阿難便辭吾不堪，　　諸法甚深若干種，　豈敢分別如來教，　　佛法功德無量智！",
        "translation": "Ānanda then dismisses us as being incapable, saying, \"There are so many different kinds of dharmas, how dare I discern the Tathāgata's teaching, which has immeasurable knowledge of the Buddha's qualities!",
        "source": "T02n0125_001:0549b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今尊迦葉能堪任，　　世雄以法付耆舊；　大迦葉今為眾人，　　如來在世請半坐。",
        "translation": "\"Now, Venerable Kāśyapa is able to entrust the Dharma to the elders, and now Mahākāśyapa is here for all of them, asking the Tathāgata to sit halfway in the world.",
        "source": "T02n0125_001:0549c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　迦葉報言雖有是，　　年衰朽老多忘失，　汝今總持智慧業，　　能使法本恒在世。",
        "translation": "Kāśyapa replied, \"Although there is such a thing as old age and decrepitude and much forgetfulness, now you'll be able to maintain the karma of wisdom that will keep the source of the Dharma alive in the world.",
        "source": "T02n0125_001:0549c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今有三清淨眼，　　亦復能知他心智，　一切眾生種種類，　　無有能勝尊阿難。",
        "translation": "Now, I have the three pure eyes, and I'm also able to know the wisdom of other minds, and there's no one who can surpass Venerable Ānanda in terms of the variety of sentient beings.",
        "source": "T02n0125_001:0549c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　梵天下降及帝釋，　　護世四王及諸天，　彌勒兜術尋來集，　　菩薩數億不可計。",
        "translation": "Brahmā descends, Indra descends, the four guardian kings and gods descend, Maitreya Tuṣita rallies, and there are billions of bodhisattvas who cannot be counted.",
        "source": "T02n0125_001:0549c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彌勒梵釋及四王，　　皆悉叉手而啟白：　一切諸法佛所印，　　阿難是我法之器。",
        "translation": "Maitreya, Brahmā, Śakra, and the four kings all saluted with their palms together and declared, \"All the teachings are sealed by the Buddha, and Ānanda is my vessel for the teachings.",
        "source": "T02n0125_001:0549c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若使不欲法存者，　　便為壞敗如來教；　願存本要為眾生，　　得濟危厄度眾難！",
        "translation": "If someone doesn't want the Dharma to exist, they'll corrupt the Tathāgata's teaching; may they preserve the essentials for the sake of sentient beings and be able to rescue them from dangers and difficulties and free them from all difficulties!",
        "source": "T02n0125_001:0549c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　釋師出世壽極短，　　肉體雖逝法身在；　當令法本不斷絕，　　阿難勿辭時說法！",
        "translation": "\"Even though the Buddha's body has passed away, the Dharma body remains; let the Dharma root not be cut off, Ānanda, do not resist when he preaches!",
        "source": "T02n0125_001:0549c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　迦葉最尊及聖眾，　　彌勒梵釋及四王，　哀請阿難時發言，　　使如來教不滅盡。",
        "translation": "The Most Venerable Kāśyapa and the noble crowd, Maitreya, Brahmā, Śākyamuni, and the four kings spoke when they beseeched Ānanda, so that the Tathāgata's teaching would not perish.",
        "source": "T02n0125_001:0549c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　阿難仁和四等具，　　意轉入微師子吼，　顧眄四部瞻虛空，　　悲泣揮淚不自勝。",
        "translation": "Ānanda benevolently harmonizes with the four authorities, his mind turns to the subtle lion's roar, he looks out over the four divisions of space, and he laments and wails uncontrollably.",
        "source": "T02n0125_001:0549c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　便奮光明和顏色，　　普照眾生如日初；　彌勒覩光及釋梵，　　收捨遲聞無上法。",
        "translation": "He then rouses his brightness and color, universally illuminating sentient beings like the beginning of the sun; Maitreya sees the light and Śākyamuni sees it, and he takes refuge in the unsurpassed Dharma of late learning.",
        "source": "T02n0125_001:0549c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　四部寂靜專一心，　　欲得聞法意不亂；　尊長迦葉及聖眾，　　直視覩顏目不眴。",
        "translation": "The four groups were still and focused, their minds not distracted by the desire to hear the teaching; Venerable Kāśyapa and the noble crowd looked straight up and saw faces with eyes that weren't dazzled.",
        "source": "T02n0125_001:0549c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時阿難說經無量，　　誰能備具為一聚？",
        "translation": "Ānanda then explained the myriad sūtras, \"Who could have gathered them all into a single group?",
        "source": "T02n0125_001:0549c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今當為作三分，　　造立十經為一偈。",
        "translation": "\"Now, I will create three parts of the sutra, making ten sūtras into one verse.",
        "source": "T02n0125_001:0549c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　契經一分律二分，　　阿毘曇經復三分；　過去三佛皆三分：　　契經、律、法為三藏。",
        "translation": "The sutra is divided into one part, the vinaya into two parts, the abhidharma sūtra into three parts, and the three buddhas of the past were all divided into three parts: the sutra, the vinaya, and the Dharma are the three collections.",
        "source": "T02n0125_001:0549c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　契經今當分四段，　　次名增一、二名中，　三名曰長多瓔珞，　　雜經在後為四分。",
        "translation": "Now, the scriptures will be divided into four parts, with the next name increasing by one, the second by two, the third by a long and numerous diadem, and the miscellaneous scriptures coming after that in four parts.",
        "source": "T02n0125_001:0549c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　尊者阿難作是念：　　如來法身不敗壞，　永存於世不斷絕，　　天人得聞成道果。",
        "translation": "Venerable Ānanda had this thought: \"The Tathāgata's Dharma body doesn't deteriorate, remains in the world forever without being cut off, and gods and humans hear about it as the fruit of the path.",
        "source": "T02n0125_001:0550a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或有一法義亦深，　　難持難誦不可憶；　我今當集一法義，　　一一相從不失緒。",
        "translation": "Perhaps there's a teaching whose meaning is also profound, which is difficult to retain and difficult to recite but can't be recalled; now, I will gather the meaning of one teaching, so that each one's aspects are never lost.",
        "source": "T02n0125_001:0550a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　亦有二法還就二，　　三法就三如連珠，　四法就四五亦然，　　五法次六六次七，　八法義廣九次第，　　十法從十至十一；　如是法寶終不忘，　　亦恒處世久存在，　於大眾中集此法，　　即時阿難昇乎座；　彌勒稱善快哉說，　　諸法義合宜配之。",
        "translation": "There are two things that return to two, three things that return to three like a string of pearls, four things that return to four and five likewise, five things that return to six, six that return to seven, eight things that have a wide range of meanings and nine in sequence, and ten things that range from ten to eleven; thus the treasure of the Dharma is never forgotten and remains in the world for a long time.",
        "source": "T02n0125_001:0550a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　更有諸法宜分部，　　世尊所說各各異；　菩薩發意趣大乘，　　如來說此種種別。",
        "translation": "There are also appropriate divisions of dharmas that the Bhagavān teaches are each different; bodhisattvas arouse the intention to pursue the great vehicle, and the Tathāgata teaches that there are various kinds of distinctions.",
        "source": "T02n0125_001:0550a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人尊說六度無極：　　布施、持戒、忍、精進、　禪、智慧力如月初，　　逮度無極覩諸法。",
        "translation": "The Bhagavān teaches that the six perfections are limitless: generosity, observance of precepts, forbearance, effort, meditation, and the power of wisdom are like the early months, and they accomplish the limitless variety of dharmas they see.",
        "source": "T02n0125_001:0550a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸有勇猛施頭目，　　身體血肉無所惜，　妻妾國財及男女，　　此名檀度不應棄。",
        "translation": "Those who courageously give their heads, don't shy away from body and flesh, and don't shy away from wives, concubines, kingdoms, possessions, and men and women, this is called the perfection of giving that shouldn't be discarded.",
        "source": "T02n0125_001:0550a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　戒度無極如金剛，　　不毀不犯無漏失，　持心護戒如坏瓶，　　此名戒度不應棄。",
        "translation": "Their moral discipline is limitless like adamant, not disparaging or transgressing without contaminants, and they guard the precepts with care like a broken vase, which is called a moral discipline that shouldn't be discarded.",
        "source": "T02n0125_001:0550a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或有人來截手足，　　不起瞋恚忍力強，　如海含容無增減，　　此名忍度不應棄。",
        "translation": "When someone comes along and cuts off their hand or foot, their forbearance is strong without anger, like an ocean that contains room without increase or decrease, and this is called a degree of forbearance that shouldn't be discarded.",
        "source": "T02n0125_001:0550a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸有造作善惡行，　　身口意三無厭足，　妨人諸行不至道，　　此名進度不應棄。",
        "translation": "When there's someone who creates good and bad actions and doesn't tire of the three, bodily, verbal, and mental actions, which prevent others from practicing and reaching the path, this is called progress that shouldn't be discarded.",
        "source": "T02n0125_001:0550a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸有坐禪出入息，　　心意堅固無亂念，　正使地動身不傾，　　此名禪度不應棄。",
        "translation": "Whoever sits in meditation and exhales, his mind is resolute and unconfused, and he correctly causes the ground to move without tilting his body, this is called the accomplishment of meditation that shouldn't be discarded.",
        "source": "T02n0125_001:0550a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以智慧力知塵數，　　劫數兆載不可稱，　書疏業聚意不亂，　　此名智度不應棄。",
        "translation": "He knows the number of dust motes by the power of wisdom, and while his eons are incalculable, his mind isn't disturbed by the accumulation of activity in writing, which is called the intellectual attainment that shouldn't be discarded.",
        "source": "T02n0125_001:0550a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸法甚深論空理，　　難明難了不可觀，　將來後進懷狐疑，　　此菩薩德不應棄。",
        "translation": "The principle of emptiness in these profound discussions of the Dharma is difficult to understand and incomprehensible, and there are doubts about future advancement; this bodhisattva virtue shouldn't be discarded.",
        "source": "T02n0125_001:0550a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　阿難自陳有是念：　　菩薩之行愚不信，　除諸羅漢信解脫，　　爾乃有信無猶豫。",
        "translation": "Ānanda explained to himself that he had this thought: \"A bodhisattva's practice is foolish and unbelieving, except for arhats who believe in liberation, and then there's faith and no hesitation.",
        "source": "T02n0125_001:0550a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　四部之眾發道意，　　及諸一切眾生類；　彼有牢信不狐疑，　　集此諸法為一分。",
        "translation": "The four groups of people who give rise to the intention for enlightenment and all sentient beings of that type have firm faith and no misgivings, and they gather these things into one.",
        "source": "T02n0125_001:0550b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彌勒稱善快哉說，　　發趣大乘意甚廣；　或有諸法斷結使，　　或有諸法成道果。",
        "translation": "Maitreya praises him as good and quick to say that his intention to set out for the great vehicle is broad; there are things that sever the bonds and tendencies, and there are things that bring about the fruit of the path.",
        "source": "T02n0125_001:0550b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　阿難說曰此云何？",
        "translation": "Ānanda said, \"What's this?",
        "source": "T02n0125_001:0550b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我見如來演此法，　亦有不從如來聞，　　此法豈非當有疑？",
        "translation": "I've seen the Tathāgata expound this teaching, but there are others who haven't heard it from the Tathāgata, so shouldn't there be doubt about this teaching?",
        "source": "T02n0125_001:0550b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　設我言見此義非，　　於將來眾便有虛；　今稱諸經聞如是，　　佛處所在城國土，　波羅捺國初說法，　　摩竭國降三迦葉；　釋翅、拘薩、迦尸國，　　瞻波、句留、毘舍離。",
        "translation": "\"Suppose I say that I see this meaning but it's not true, then in the future the multitude will be in vain; I've heard of these sūtras as being like this, where the Buddha is located in a city or land, where he first taught in the land of Pārāṇasī, where he subjugated the three Kāśyapa brothers in the land of Maghā; the land of Śākyesu, Kośa, and Kāśyapa, and the land of Campā, Juru, and Vaiśālī.",
        "source": "T02n0125_001:0550b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天宮、龍宮、阿須倫，　　乾沓和等拘尸城；　正使不得說經處，　　當稱原本在舍衛。",
        "translation": "The palaces of gods, dragons, asuras, and the Kuśinagara city of Gandhāra are precisely the places where the sūtras can't be taught, which should be called originally Śrāvastī.",
        "source": "T02n0125_001:0550b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　吾所從聞一時事，　　佛在舍衛及弟子，　祇桓精舍修善業，　　孤獨長者所施園。",
        "translation": "I've heard of a time when the Buddha was in Śrāvastī and his disciples, cultivating good deeds in the Jetavana monastery, and giving alms in the park to an orphaned elder.",
        "source": "T02n0125_001:0550b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時佛在中告比丘：　　當修一法專一心，　思惟一法無放逸。",
        "translation": "The Buddha was there, telling the monks, \"You must cultivate one thing and concentrate your mind, contemplating one thing without dissipation.",
        "source": "T02n0125_001:0550b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何一法？",
        "translation": "What is the one dharma?",
        "source": "T02n0125_001:0550b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂念佛，　法念、僧念及戒念，　　施念去相次天念，　息念、安般及身念，　　死念除亂謂十念。",
        "translation": "They're mindful of the Buddha, mindful of the teaching, mindful of the saṃgha, and mindful of the precepts, mindful of generosity and the depiction of gods, mindful of calming, breathing, and mindfulness of the body, and mindful of death and the removal of disorder are called the ten kinds of mindfulness.",
        "source": "T02n0125_001:0550b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此名十念更有十，　　次後當稱尊弟子；　初化拘隣真佛子，　　最後小者名須拔。",
        "translation": "These are called the ten remembrances, and there are ten more, which will be followed by the name Venerable Disciple; the first one converts the true Buddha-child of Kauṇḍinya, and the last, the lesser one, is called Subāhu.",
        "source": "T02n0125_001:0550b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以此方便了一法，　　二從二法三從三，　四五六七八九十，　　十一之法無不了。",
        "translation": "With this method of understanding one dharma, two from two dharmas, three from three, four, five, six, seven, eight, nine, ten, and eleven dharmas are without limit.",
        "source": "T02n0125_001:0550b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　從一增一至諸法，　　義豐慧廣不可盡；　一一契經義亦深，　　是故名曰增壹含。",
        "translation": "From one plus one to all the dharmas, their meanings are abundant and their wisdom is inexhaustible; each one fits the sūtras' meanings so deeply that they're called plus one inclusion.",
        "source": "T02n0125_001:0550b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今尋一法難明了，　　難持難曉不可明；　比丘自稱功德業，　　今當稱之尊第一。",
        "translation": "Finding one teaching that's difficult to understand, difficult to maintain, difficult to understand, and impossible to illuminate, a monk claims meritorious service, and now he'll honor it as the best.",
        "source": "T02n0125_001:0550b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶如陶家所造器，　　隨意所作無狐疑；　如是阿含增一法，　　三乘教化無差別。",
        "translation": "Like a potter's vessel, made as he wishes without misgivings, thus is Āgama incremental in its teaching of the three vehicles without distinction.",
        "source": "T02n0125_001:0550b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛經微妙極甚深，　　能除結使如流河；　然此增一最在上，　　能淨三眼除三垢。",
        "translation": "The Buddha's sūtras are so subtle and profound that they can remove bonds and tendencies like a river flowing downstream, but this incremental teaching is the highest, purifying the three eyes and removing the three defilements.",
        "source": "T02n0125_001:0550c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其有專心持增一，　　便為總持如來藏；　正使今身不盡結，　　後生便得高才智。",
        "translation": "If someone focuses their mind on Zongyi, it's the general maintenance of the Tathāgatagarbha; it's what makes the bonds in this body inexhaustible and enables later generations to attain superior abilities and wisdom.",
        "source": "T02n0125_001:0550c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有書寫經卷者，　　繒綵花蓋持供養，　此福無量不可計，　　以此法寶難遇故。",
        "translation": "If someone writes a sūtra scroll and presents it with a silken, flower-studded canopy as an offering, that merit is incalculable because this treasure of the Dharma is difficult to encounter.",
        "source": "T02n0125_001:0550c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　說此語時地大動，　　雨天華香至于膝，　諸天在空歎善哉！",
        "translation": "When he says this, the earth greatly stirs, raining down flowers and incense up to his knees, and the gods praise him as good!",
        "source": "T02n0125_001:0550c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　上尊所說盡順宜。",
        "translation": "The teaching of the Bhagavān is entirely appropriate.",
        "source": "T02n0125_001:0550c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　契經一藏律二藏，　　阿毘曇經為三藏；　方等大乘義玄邃，　　及諸契經為雜藏。",
        "translation": "The scriptures are one collection, the vinaya is two collections, the abhidharma scriptures are three collections, the profound meaning of the vaipulya scriptures is profound, and the scriptures are miscellaneous collections.",
        "source": "T02n0125_001:0550c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　安處佛語終不異，　　因緣本末皆隨順；　彌勒諸天皆稱善，　　釋迦文經得久存。",
        "translation": "The Buddha's words are never different, and the causes and conditions are all followed in their origin and derivation; the Maitreya gods all praise it as good, and the Śākyamuni sūtras are preserved for a long time.",
        "source": "T02n0125_001:0550c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彌勒尋起手執華，　　歡喜持用散阿難；　此經真實如來說，　　使阿難尋道果成。",
        "translation": "Maitreya then looked up, grasped a flower in his hand, joyfully held it in his hand, and scattered it to Ānanda; this sūtra was truly as the Tathāgata had taught it, causing Ānanda to realize the fruit of his search for the way.",
        "source": "T02n0125_001:0550c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，尊者阿難及梵天將諸梵迦夷天，皆來會集；化自在天將諸營從，皆來會聚；他化自在天將諸營從，皆悉來會；兜術天王將諸天之眾，皆來會聚；豔天將諸營從，悉來會聚；釋提桓因將諸三十三天眾，悉來集會；提頭賴吒天王將乾沓和等，悉來會聚；毘留勒叉天王將諸厭鬼，悉來會聚；毘留跛叉天王將諸龍眾，悉來會聚；毘沙門天王將閱叉、羅剎眾，悉來會聚。",
        "translation": "It was then that Venerable Ānanda and the Brahmakāyika gods brought together the Brahmakāyika gods; the Mahêśvara gods brought together the camp followers; the Paranirmitavaśavartin gods brought together the camp followers; the Tuṣita gods brought together the host of gods; the Vaiśravaṇa gods brought together the camp followers; the Śakra Devānām-Indra brought together the Trāyastriṃśa gods; the Dhṛtarāṣṭra gods brought together the Gandharvas; the Virūḍhaka gods brought together the disgusting ghosts; the Virūḍhaka gods brought together the dragons; and the Vaiśravaṇa gods brought together the yakṣas and rāṣas.",
        "source": "T02n0125_001:0550c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，彌勒大士告賢劫中諸菩薩等：「卿等勸勵諸族姓子、族姓女，諷誦受持增一尊法，廣演流布，使天、人奉行。」",
        "translation": "Mahākauṣṭhila then addressed the bodhisattvas of the good eon, \"Please encourage your clansmen and clanswomen to recite, retain, and disseminate the Zenith teaching so that gods and humans will approve of it.\"",
        "source": "T02n0125_001:0550c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語時，諸天、世人、乾沓和、阿須倫、伽留羅、摩睺勒、甄陀羅等，各各白言：「我等盡共擁護是善男子、善女人，諷誦受持增一尊法，廣演流布，終不中絕。」",
        "translation": "When they spoke these words, the gods, humans, Gandharvas, asuras, garuḍas, mahoras, and candras each said, \"We will all support this good man and good woman, recite, retain, and disseminate the Dharma that increases the One Honored One, so that it never dies.\"",
        "source": "T02n0125_001:0550c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，尊者阿難告優多羅曰：「我今以此增一阿含囑累於汝，善諷誦讀，莫令漏減，所以者何？",
        "translation": "Venerable Ānanda then addressed Uttara, \"Now, I'm going to entrust this Incremental Āgama to you, so recite it well and read it so that it doesn't slip through the cracks.",
        "source": "T02n0125_001:0550c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有輕慢此尊經者，便為墮落為凡夫行。",
        "translation": "Anyone who despises this venerable sūtra will fall into the ways of worldlings.",
        "source": "T02n0125_001:0551a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T02n0125_001:0551a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此，優多羅，增一阿含，出三十七道品之教，及諸法皆由此生。」",
        "translation": "Here, Uttarakuru, are the teachings of the 37 factors of the path and the dharmas that arise from them.\"",
        "source": "T02n0125_001:0551a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，大迦葉問阿難曰：「云何，阿難！",
        "translation": "Mahākāśyapa then asked Ānanda, \"What is it, Ānanda?",
        "source": "T02n0125_001:0551a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "增一阿含乃能出生三十七道品之教，及諸法皆由此生？」",
        "translation": "Is it possible that the incremental Āgamas give rise to the teaching of the thirty-seven factors of the path, and that all dharmas arise from this?\"",
        "source": "T02n0125_001:0551a06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難報言：「如是，如是，尊者迦葉！",
        "translation": "Ānanda replied, \"So it is, Venerable Kāśyapa!",
        "source": "T02n0125_001:0551a07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "增一阿含出生三十七品，及諸法皆由此生；且置增一阿含，一偈之中，便出生三十七品及諸法。」",
        "translation": "The thirty-seven chapters of the Āgamas and the dharmas that arise from them, and the thirty-seven chapters of the Āgamas and the dharmas that are placed in the Āgamas, are born in a single verse.\"",
        "source": "T02n0125_001:0551a08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉問言：「何等偈中出生三十七品及諸法？」",
        "translation": "Kāśyapa asked, \"What are the thirty-seven chapters and dharmas that are produced in a single verse?\"",
        "source": "T02n0125_001:0551a10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，尊者阿難便說此偈：「諸惡莫作，　　諸善奉行，　　自淨其意，　是諸佛教。",
        "translation": "Venerable Ānanda then spoke this verse, \"Don't do evil, practice good, and purify your own mind; these are the teachings.",
        "source": "T02n0125_001:0551a11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「所以然者，諸惡莫作，是諸法本，便出生一切善法；以生善法，心意清淨。",
        "translation": "\"That's why it's true that refraining from doing evil is the root of all dharmas, which then produces all good qualities, and because they produce good qualities, their minds are purified.",
        "source": "T02n0125_001:0551a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，迦葉！",
        "translation": "Therefore, Kāśyapa!",
        "source": "T02n0125_001:0551a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛世尊身、口、意行，常修清淨。」",
        "translation": "The buddhas always cultivate the purity of their bodies, speech, and mental conduct.\"",
        "source": "T02n0125_001:0551a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉問曰：「云何，阿難！",
        "translation": "Kāśyapa asked, \"Why, Ānanda!",
        "source": "T02n0125_001:0551a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "增壹阿含獨出生三十七品及諸法，餘四阿含亦復出生乎？」",
        "translation": "Are the thirty-seven chapters and dharmas produced in the four Āgamas alone, or are they also produced in the other four?\"",
        "source": "T02n0125_001:0551a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難報言：「且置。",
        "translation": "Ānanda replied, \"Let's leave it there.",
        "source": "T02n0125_001:0551a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T02n0125_001:0551a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四阿含義，一偈之中，盡具足諸佛之教，及辟支佛、聲聞之教。",
        "translation": "The four Āgamas contain in a single verse the complete teachings of the buddhas, pratyekabuddhas, and śrāvakas.",
        "source": "T02n0125_001:0551a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者，諸惡莫作，戒具之禁；清白之行，諸善奉行；心意清淨，自淨其意；除邪顛倒，是諸佛教，去愚惑想。",
        "translation": "It's because it's forbidden to do evil, to observe the precepts, to conduct oneself in a pure manner, to practice goodness, to purify one's mind, and to remove wrong and mistaken beliefs, which are Buddhism and rid oneself of foolish notions.",
        "source": "T02n0125_001:0551a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何，迦葉！",
        "translation": "Why, Kāśyapa?",
        "source": "T02n0125_001:0551a24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戒清淨者，意豈不淨乎？",
        "translation": "When the precepts are pure, isn't the intention pure?",
        "source": "T02n0125_001:0551a24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意清淨者，則不顛倒；以無顛倒，愚惑想滅，諸三十七道品果便得成就。",
        "translation": "When the mind is purified, it's not mistaken; because there's no mistakenness, delusion and perception cease, and the fruits of the thirty-seven factors of the path are then accomplished.",
        "source": "T02n0125_001:0551a24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以成道果，豈非諸法乎？」",
        "translation": "Is it not the case that the fruits of the path are accomplished because of these things?\"",
        "source": "T02n0125_001:0551a26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉問曰：「云何，阿難！",
        "translation": "Kāśyapa asked, \"What is it, Ānanda!",
        "source": "T02n0125_001:0551a27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此增一付授優多羅，不囑累餘比丘一切諸法乎？」",
        "translation": "Wouldn't this incremental payment to Uttara burden the other monks with all the teachings?\"",
        "source": "T02n0125_001:0551a27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難報言：「增一阿含則是諸法，諸法則是增一阿含，一無有二。」",
        "translation": "Ānanda replied, \"The incremental Āgamas are the dharmas, and the dharmas are the incremental Āgamas; there are no two of them.\"",
        "source": "T02n0125_001:0551a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉問曰：「以何等故，以此增一阿含囑累優多羅，不囑累餘比丘乎？」",
        "translation": "Kāśyapa asked, \"What is the reason you entrust this Incremental Āgama to Uttarakuru and don't entrust it to the other monks?\"",
        "source": "T02n0125_001:0551b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難報曰：「迦葉當知，昔者九十一劫，毘婆尸如來、至真、等正覺出現於世。",
        "translation": "Ānanda replied, \"Kāśyapa, you should know that in the past, during the 91st eon, the Tathāgata Vipaśyin, the supremely true, and perfectly enlightened one, appeared in the world.",
        "source": "T02n0125_001:0551b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此優多羅比丘名曰伊俱優多羅，爾時彼佛以增一之法囑累此人，使諷誦讀。",
        "translation": "At the time, this monk Uttarakuru named Īku Uttarakuru was entrusted by that Buddha with the task of reciting the Dharma in greater measure to this person.",
        "source": "T02n0125_001:0551b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自此以後三十一劫，次復有佛名式詰如來、至真、等正覺。",
        "translation": "After that, there were another thirty-one eons, and then another Buddha named Śikhin Tathāgata, Zhizhen, and Equanimous Enlightenment.",
        "source": "T02n0125_001:0551b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此優多羅比丘名目伽優多羅。",
        "translation": "At the time, this monk Uttarakuru was called Maudgalyupta.",
        "source": "T02n0125_001:0551b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "式詰如來復以此法囑累其人，使諷誦讀。",
        "translation": "The Tathāgata Śikhin again entrusted this teaching to his people and made them recite it.",
        "source": "T02n0125_001:0551b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即彼三十一劫中，毘舍婆如來、至真、等正覺，復出於世。",
        "translation": "During those thirty-one eons, the Tathāgata Vaiśravaṇa, the supremely true, and perfectly enlightened one, again appeared in the world.",
        "source": "T02n0125_001:0551b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，此優多羅比丘名龍優多羅，復以此法囑累其人，使諷誦讀。",
        "translation": "At the time, this monk Uttarakuru named Nāgârjuna again instructed his people to recite this teaching.",
        "source": "T02n0125_001:0551b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「迦葉當知，此賢劫中有拘留孫如來、至真、等正覺，出現於世。",
        "translation": "\"Kāśyapa, you should know that in this good eon there was Kauśāmbī Tathāgata, the supremely true and perfectly enlightened one, who appeared in the world.",
        "source": "T02n0125_001:0551b12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優多羅比丘名雷電優多羅，復以此法囑累其人，使諷誦讀。",
        "translation": "At the time, the monk Uttarakuru named Raiden Uttarakuru again instructed those people to recite this teaching.",
        "source": "T02n0125_001:0551b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此賢劫中次復有佛，名拘那含如來、至真、等正覺，出現於世。",
        "translation": "Again, in these good eons, another Buddha named Kanakamuni, the Tathāgata, the Most True, and Completely Enlightened appeared in the world.",
        "source": "T02n0125_001:0551b15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優多羅比丘名天優多羅，復以此法囑累其人，使諷誦讀。",
        "translation": "At the time, the monk Uttarakuru named God Uttarakuru again entrusted people with this teaching, telling them to recite it.",
        "source": "T02n0125_001:0551b17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此賢劫中次復有佛，名迦葉如來、至真、等正覺，出現於世。",
        "translation": "Again, in these good eons, another Buddha named Kāśyapa, the Tathāgata, the Most True, and Completely Enlightened One, appeared in the world.",
        "source": "T02n0125_001:0551b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優多羅比丘名梵優多羅，復以此法囑累其人，使諷誦讀。",
        "translation": "At the time, the monk Uttarakuru named Brahmā Uttarakuru again entrusted his people with this teaching, telling them to recite it.",
        "source": "T02n0125_001:0551b20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「迦葉當知，今釋迦文如來、至真、等正覺，出現於世。",
        "translation": "\"Kāśyapa, you should know that now the Śākyamuni Tathāgata, the supremely true, and perfectly enlightened one, has appeared in the world.",
        "source": "T02n0125_001:0551b21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此比丘名優多羅，釋迦文佛雖般涅槃，比丘阿難猶存於世。",
        "translation": "Although Śākyamuni Buddha may have gone into nirvāṇa, the monk Ānanda still remains in the world.",
        "source": "T02n0125_001:0551b22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊以法盡以囑累我，我今復以此法授與優多羅。",
        "translation": "The Bhagavān entrusted me with the task of exhausting the Dharma, and now I'm going to give this Dharma to Uttarakuru.",
        "source": "T02n0125_001:0551b24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T02n0125_001:0551b25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當觀其器，察知原本，然後授法。",
        "translation": "You should examine their vessels and discern the origin before bestowing the Dharma.",
        "source": "T02n0125_001:0551b25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T02n0125_001:0551b26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去時於此賢劫中，拘留孫如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，號佛、眾祐，出現於世。",
        "translation": "In the past, during this auspicious eon, the Tathāgata Kauśāmbī, the supremely true, perfectly enlightened, accomplished in knowledge and conduct, well gone, worldly savant, unsurpassed man, trainer of the way, and teacher of gods and humans, called the Buddha and the Blessed Ones, appeared in the world.",
        "source": "T02n0125_001:0551b26_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，有王名摩訶提婆，以法治化，未曾阿曲，壽命極長，端正無雙，世之希有，八萬四千歲中於童子身而自遊戲，八萬四千歲中以太子身以法治化，八萬四千歲中復以王法治化天下。",
        "translation": "At the time, there was a king named Mahādeva who disciplined the world by the rule, had never been bent over, had an extremely long life, was correct and peerless, and was rare in the world.",
        "source": "T02n0125_001:0551b29_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「迦葉當知，爾時世尊遊甘梨園中，食後如昔常法中庭經行，我及侍者，爾時世尊便笑，口出五色光。",
        "translation": "\"Kāśyapa, you should know that at the time the Bhagavān traveled to Kālī Park and walked through the middle of the courtyard after eating as in the past, while I and my attendants were laughing and a five-colored light was emanating from my mouth.",
        "source": "T02n0125_001:0551c04_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我見已，前長跪白世尊曰：『佛不妄笑，願聞本末。",
        "translation": "After I saw that, I knelt down and said to the Bhagavān, 'The Buddha doesn't laugh falsely, so I wish to hear about the source and derivative.",
        "source": "T02n0125_001:0551c07_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、至真、等正覺，終不妄笑。』",
        "translation": "The Tathāgata, the Supreme Truth, and the Completely Enlightened One never laughs falsely.'",
        "source": "T02n0125_001:0551c08_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，迦葉！",
        "translation": "At that point, Kāśyapa!",
        "source": "T02n0125_001:0551c08_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告我言：『過去世時於此賢劫中，有如來名拘留孫至真、等正覺，出現於世，復於此處為諸弟子而廣說法。",
        "translation": "The Buddha told me, 'In a past life, during this good eon, there was a Tathāgata named Kauṇḍinya, the Most True and Completely Enlightened One, who appeared in the world and also spoke extensively to his disciples here.",
        "source": "T02n0125_001:0551c09_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，於此賢劫中，復有拘那含如來、至真、等正覺，出現於世，爾時彼佛亦於此處而廣說法。",
        "translation": "Furthermore, during this good eon, there was another Tathāgata Kauṇḍinya, Arhat, and Completely Awakened One, who appeared in the world, and at the time that Buddha also spoke extensively at this place.",
        "source": "T02n0125_001:0551c11_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次復，此賢劫中迦葉如來、至真、等正覺，出現於世，迦葉如來亦於此處而廣說法。』",
        "translation": "Furthermore, during this good eon, the Tathāgata Kāśyapa, the Zhizhen, and the Equanimous Enlightenment appeared in the world, and the Tathāgata Kāśyapa also explained the teaching in detail there.'",
        "source": "T02n0125_001:0551c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，迦葉！",
        "translation": "\"At the time, Kāśyapa!",
        "source": "T02n0125_001:0551c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於佛前長跪白佛言：『願令後釋迦文佛亦於此處，與諸弟子具足說法，此處便為四如來金剛之座，恒不斷絕。』",
        "translation": "I knelt down long before the Buddha and said, 'May the future Śākyamuni Buddha also teach fully with his disciples here, and this place will then become the adamantine throne of the four tathāgatas, which will never be cut off.'",
        "source": "T02n0125_001:0551c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，迦葉！",
        "translation": "\"At that point, Kāśyapa!",
        "source": "T02n0125_001:0551c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋迦文佛於彼坐，便告我言：『阿難！",
        "translation": "Śākyamuni Buddha was sitting there and addressed me, saying, 'Ānanda!",
        "source": "T02n0125_001:0551c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔者此坐，賢劫之中有王出世，名摩訶提婆。",
        "translation": "Once upon a time, during this sitting, a king named Mahādeva appeared in the eon of goodness.",
        "source": "T02n0125_001:0551c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至八萬四千歲以王法教化，訓之以德，經歷年歲，便告劫比言：「若見我首有白髮者，便時告吾。」",
        "translation": "After 84,000 years of teaching the king's teachings and teaching him virtues, he then told Kapphiṇa, \"If you see gray hair on my head, then tell me about it.\"",
        "source": "T02n0125_001:0551c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彼人聞王教令，復經數年，見王首上有白髮生，便前長跪白大王曰：「大王當知，首上已生白髮。」",
        "translation": "After several more years of hearing the king's teaching, that man saw gray hair growing on the king's head and knelt down long enough to tell the king, \"You must know, Your Majesty, that gray hair has grown on your head.\"",
        "source": "T02n0125_001:0551c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王告彼人言：「捉取金鑷，拔吾白髮，著吾手中。」",
        "translation": "The king then told that man, \"Take these gold tweezers, pluck my white hair, and put it in my hand.\"",
        "source": "T02n0125_001:0551c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彼人受王教令，便執金鑷，前拔白髮。",
        "translation": "Then, that man, having been instructed by the king, took the gold tweezers and pulled out the white hair.",
        "source": "T02n0125_001:0551c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『爾時，大王見白髮已，便說此偈：「『「於今我首上，　　已生衰耗毛；　　　天使已來至，　　宜當時出家。",
        "translation": "\"'Then, after he saw the white hair, the king spoke this verse, \"'Now, I've got a head of hair that's worn out, and an angel has come to visit, so I should leave home at that time.'",
        "source": "T02n0125_001:0551c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『「我今已食人中之福，宜當自勉昇天之德，剃除鬚髮，著三法衣，以信堅固，出家學道，離於眾苦。」",
        "translation": "\"Now that I've eaten the good fortune of humans, I should strive for the virtue of ascending to heaven, shave off my hair, put on the three dharma robes, become resolute in my faith, leave home, and train on the path to escape all suffering.\"",
        "source": "T02n0125_001:0552a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『爾時，王摩訶提婆便告第一太子，名曰長壽：「卿今知不？",
        "translation": "\"'It was then that King Mahādeva addressed the first prince, who was called Long Life, \"Do you know this?",
        "source": "T02n0125_001:0552a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾首已生白髮，意欲剃除鬚髮，著三法衣，以信堅固，出家學道，離於眾苦。",
        "translation": "My hair has grown gray, and I want to shave off my hair, put on the three garments of the Dharma, become resolute in my faith, leave home, train on the path, and escape the many hardships.",
        "source": "T02n0125_001:0552a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝紹吾位，以法治化，勿令有失，違吾言教，造凡夫行。",
        "translation": "You must guide my position, teach by the rules, and prevent any failure to act contrary to my words and teachings, creating worldly behavior.",
        "source": "T02n0125_001:0552a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者，若有斯人，違吾言者，便為凡夫之行。",
        "translation": "That's why, if this person disobeys my words, they'll be engaged in worldly behavior.",
        "source": "T02n0125_001:0552a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫者，長處三塗、八難之中。」",
        "translation": "A worldling will always be in the midst of the three destinies and eight difficulties.\"",
        "source": "T02n0125_001:0552a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，王摩訶提婆以王之位授太子已，復以財寶賜與劫比，便於彼處剃除鬚髮，著三法衣，以信堅固，出家學道，離於眾苦。",
        "translation": "After the king Mahādeva had given the crown prince the position of king and then given Kapphiṇa treasure, he shaved off his hair, put on the three dharma robes, became resolute in his faith, left home, and trained on the path, freeing himself from all suffering.",
        "source": "T02n0125_001:0552a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於八萬四千歲善修梵行，行四等心，慈、悲、喜、護，身逝命終，生梵天上。",
        "translation": "After 84,000 years of skillfully cultivating the religious practice and practicing the four gradations of mind, which are kindness, pity, joy, and protection, he was born in the Brahma Heaven when his body died and his life ended.",
        "source": "T02n0125_001:0552a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『時，長壽王憶父王教，未曾暫捨。",
        "translation": "\"'At the time, the long-lived king remembered his father's teaching, and he never temporarily abandoned it.",
        "source": "T02n0125_001:0552a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以法治化，無有阿曲，未經旬日，便復得作轉輪聖王，七寶具足。",
        "translation": "He disciplined them without any quarrels, and within ten days, he was again made a wheel-turning sage king, replete with seven treasures.",
        "source": "T02n0125_001:0552a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂七寶者，輪寶、象寶、馬寶、珠寶、玉女寶、典藏寶、典兵寶，是謂七寶。",
        "translation": "These are known as the seven treasures, which are the wheel treasure, elephant treasure, horse treasure, jewelry, jade lady treasure, scripture treasure, and scripture soldier treasure.",
        "source": "T02n0125_001:0552a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有千子，勇猛智慧，能除眾苦，統領四方。",
        "translation": "He also has a thousand sons who are bold and wise, capable of removing multitudinous suffering, and who rule the four directions.",
        "source": "T02n0125_001:0552a18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『時，長壽王\t_║以前王法，如上作偈：_║「『「敬法奉所尊，　　不忘本恩報；\t_║　　　復能崇三業，　　智者之所貴！」』",
        "translation": "\"'Then, the long-lived king _║ according to the former king's teaching, composed the above verse: _║ \"'Honoring the Dharma and paying respect to it, he doesn't forget the rewards of his past kindnesses; _║ he's also able to honor the three activities, which are valued by wise men!'",
        "source": "T02n0125_001:0552a19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「我觀此義已，以此增一阿含授與優多羅比丘。",
        "translation": "\"After observing this meaning, I gave this incremental āgama to the monks of Uttarakuru.",
        "source": "T02n0125_001:0552a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T02n0125_001:0552a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法皆有所由。」",
        "translation": "All dharmas have a cause.\"",
        "source": "T02n0125_001:0552a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，尊者阿難告優多羅曰：「汝前作轉輪聖王時，不失王教，今復以此法而相囑累，不失正教，莫作凡夫之行。",
        "translation": "Venerable Ānanda then addressed Uttarakuru, \"When you were the wheel-turning sage king, you didn't lose the king's teaching, and now you're being burdened by this teaching, so don't lose the right teaching and don't engage in worldly behavior.",
        "source": "T02n0125_001:0552a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今當知，若有違失如來善教者，便墮凡夫地中。",
        "translation": "Now, you should know that if you disregard the Tathāgata's good teaching, you'll fall into the status of a worldling.",
        "source": "T02n0125_001:0552a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T02n0125_001:0552a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，王摩訶提婆不得至竟解脫之地，未得解脫至安隱處；雖受梵天福報，猶不至究竟；如來善業，乃名究竟安隱之處，快樂無極，天、人所敬，必得涅槃。",
        "translation": "At the time, King Mahādeva hadn't yet reached the stage of final liberation, hadn't yet attained liberation to a peaceful place, and even though he received the rewards of merit from the brahma gods, he still hadn't reached the end; thus, his good actions are called a place of final peace, where his happiness is limitless and he's respected by gods and humans, and he's sure to attain nirvāṇa.",
        "source": "T02n0125_001:0552a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是之故，優多羅！",
        "translation": "For this reason, Uttara!",
        "source": "T02n0125_001:0552b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當奉持此法，諷誦讀念：莫令缺漏。」",
        "translation": "You must consecrate this teaching, recite it, and read it with recitation: don't let it be missed.\"",
        "source": "T02n0125_001:0552b03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，阿難便說偈曰：「於法當念故，　　如來由是生；　法興成正覺，　　辟支羅漢道。",
        "translation": "It was then that Ānanda spoke this verse, \"Because you should be mindful of the Dharma, the Tathāgata thus arises; the Dharma produces correct awakening, and the pratyekabuddha path is established.",
        "source": "T02n0125_001:0552b04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　法能除眾苦，　　亦能成果實；　念法不離心，　　今報後亦受。",
        "translation": "The Dharma removes suffering and brings fruit to reality; mindfulness of the Dharma doesn't part from the mind, and the present rewards are felt later.",
        "source": "T02n0125_001:0552b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若欲成佛者，　　猶如釋迦文；　受持三藏法，　　句逗不錯亂。",
        "translation": "Those who want to become buddhas are like the Buddha's prose; they memorize the Tripiṭaka's teachings, and their sentences and phrases aren't confused.",
        "source": "T02n0125_001:0552b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三藏雖難持，　　義理不可窮；　當誦四阿含，　　便斷天人徑。",
        "translation": "Although the Tripiṭaka is difficult to uphold, its meaning is inexhaustible; you should recite the four Āgamas, and then you'll cut off the path of gods and humans.",
        "source": "T02n0125_001:0552b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　阿含雖難誦，　　經義不可盡；　戒律勿令失，　　此是如來寶。",
        "translation": "Although it's difficult to recite the Āgamas, the sūtras' meanings cannot be exhausted; don't let the precepts and regulations be lost; these are the Tathāgata's treasures.",
        "source": "T02n0125_001:0552b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　禁律亦難持，　　阿含亦復然；　牢持阿毘曇，　　便降外道術。",
        "translation": "Even though the prohibitions and rules are difficult to uphold, it's the same with the Āgamas; firmly maintaining the abhidharma will subdue the techniques of non-Buddhists.",
        "source": "T02n0125_001:0552b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　宣暢阿毘曇，　　其義亦難持；　當誦三阿含，　　不失經句逗。",
        "translation": "The meaning of the abhidharma that's proclaimed is also difficult to maintain; recite the three Āgamas so you don't lose the phrases and sentences of the sutras.",
        "source": "T02n0125_001:0552b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　契經阿毘曇，　　戒律流布世；　天人得奉行，　　便生安隱處。",
        "translation": "The sūtras and abhidharmas spread the precepts throughout the world, and when gods and humans approve of them, they're born in a peaceful place.",
        "source": "T02n0125_001:0552b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　設無契經法，　　亦復無戒律；　如盲投於冥，　　何時當見明？",
        "translation": "If there were no sūtra teaching, there would be no precepts; like a blind man cast into darkness, when will he see the light?",
        "source": "T02n0125_001:0552b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以是囑累汝，　　并及四部眾，　當持勿輕慢，　　於釋迦文尼！」",
        "translation": "Thus I charge you, and the four groups of people, to maintain and not despise Śākyamuni!\"",
        "source": "T02n0125_001:0552b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者阿難說是語時，天地六反震動，諸尊神天在虛空中，手執天華而散尊者阿難上，及散四部之眾。",
        "translation": "When Venerable Ānanda said those words, the six counterpoints of heaven and earth shook, and the gods and goddesses in the sky scattered Venerable Ānanda with celestial flowers in their hands and scattered the four groups of people.",
        "source": "T02n0125_001:0552b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切天、龍、鬼神、乾沓和、阿須倫、加留羅、甄陀羅、摩休勒等，皆懷歡喜而悉歎曰：「善哉！",
        "translation": "All the gods, dragons, demons, Gandharvas, asuras, garuḍas, khandhas, mahoras, and others rejoiced and said, \"Good!",
        "source": "T02n0125_001:0552b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T02n0125_001:0552c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者阿難！",
        "translation": "Venerable Ānanda!",
        "source": "T02n0125_001:0552c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上中下言，悉無不善，於法當恭敬。",
        "translation": "The higher, middle, and lower-level words are all not unwholesome, and they should respect the teaching.",
        "source": "T02n0125_001:0552c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誠如所說，諸天、世人無不從法而得成就。",
        "translation": "As it's truly explained, there's nothing in heaven or humans that isn't accomplished by the teaching.",
        "source": "T02n0125_001:0552c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有行惡，便墮地獄、餓鬼、畜生。」",
        "translation": "If someone does evil, they'll fall into hell, hungry ghosts, and animals.\"",
        "source": "T02n0125_001:0552c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，尊者阿難於四部眾中而師子吼，勸一切人，奉行此法。",
        "translation": "At the time, Venerable Ānanda was among the four groups of people when he proclaimed, \"Shizi!\" and urged all of them to approve of this teaching.",
        "source": "T02n0125_001:0552c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，座上三萬天、人得法眼淨。",
        "translation": "At the time, 30,000 gods and humans on the throne attained purification of the Dharma eye.",
        "source": "T02n0125_001:0552c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，四部之眾、諸天、世人，聞尊者所說，歡喜奉行。",
        "translation": "At the time, the four groups of people, gods, and humans who heard what the venerable spoke rejoiced and approved.",
        "source": "T02n0125_001:0552c06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "增壹阿含經十念品第二",
        "translation": "Increased by One Āgama Sutras, Ten Mindfulnesses, Second Chapter",
        "source": "T02n0125_001:0552c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（一）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(1) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_001:0552c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「當修行一法，當廣布一法；便成神通，去眾亂想，逮沙門果，自致涅槃。",
        "translation": "It was then that the Bhagavān addressed the monks, \"You must cultivate one thing and disseminate one thing; then you'll achieve supernormal powers, leave all confusing perceptions, acquire the fruit of asceticism, and bring about nirvāṇa on your own.",
        "source": "T02n0125_001:0552c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為一法？",
        "translation": "What is the one dharma?",
        "source": "T02n0125_001:0552c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂念佛，當善修行，當廣演布，便成神通，去眾亂想，逮沙門果，自致涅槃。",
        "translation": "This is called mindfulness of the Buddha that's well cultivated and widely disseminated, which then produces supernormal powers, removes many confusing notions, acquires the fruit of asceticism, and brings about nirvāṇa naturally.",
        "source": "T02n0125_001:0552c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_001:0552c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當修行一法，當廣布一法。",
        "translation": "You will practice one thing, and you will disseminate one thing.",
        "source": "T02n0125_001:0552c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "Thus, monks!",
        "source": "T02n0125_001:0552c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "Train yourselves in this way.\"",
        "source": "T02n0125_001:0552c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At the time, the monks who heard what the Buddha taught rejoiced and handed it down.",
        "source": "T02n0125_001:0552c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(2) I heard this: One time, the Buddha was present at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_001:0552c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「當修行一法，當廣布一法；便成神通，去眾亂想，逮沙門果，自致涅槃。",
        "translation": "It was then that the Bhagavān addressed the monks, \"You must cultivate one thing and disseminate one thing, and then you'll achieve supernormal powers, leave all confusing perceptions, acquire the fruit of asceticism, and bring about nirvāṇa on your own.",
        "source": "T02n0125_001:0552c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為一法？",
        "translation": "What is the one dharma?",
        "source": "T02n0125_001:0552c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂念法，當善修行，當廣演布，便成神通，去眾亂想，逮沙門果，自致涅槃。",
        "translation": "This is called mindfulness of the teaching that should be well cultivated and widely disseminated, which will lead to the attainment of supernormal powers, the removal of many confusing notions, and the acquisition of the ascetic fruit that brings about nirvāṇa naturally.",
        "source": "T02n0125_001:0552c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_001:0552c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當修行一法，當廣布一法。",
        "translation": "You will practice one thing, and you will disseminate one thing.",
        "source": "T02n0125_001:0552c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "Thus, monks!",
        "source": "T02n0125_001:0552c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "Train yourselves in this way.\"",
        "source": "T02n0125_001:0552c23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At the time, the monks who heard what the Buddha taught rejoiced and handed it down.",
        "source": "T02n0125_001:0552c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（三）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(3) Thus I have heard: One time, the Buddha was present at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_001:0552c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「當修行一法，當廣布一法；便成神通，去眾亂想，獲沙門果，自致涅槃。",
        "translation": "The Bhagavān then addressed the monks, \"You must cultivate one thing and disseminate one thing, and then you'll achieve supernormal powers, leave the many distracting thoughts, attain the fruit of asceticism, and bring about nirvāṇa on your own.",
        "source": "T02n0125_001:0552c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為一法？",
        "translation": "What is the one dharma?",
        "source": "T02n0125_001:0552c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂念眾。",
        "translation": "\"It's called mindfulness of the crowd.",
        "source": "T02n0125_001:0552c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當善修行，當廣演布，便成神通，除眾亂想，逮沙門果，自致涅槃。",
        "translation": "When they well cultivate it and make it widely known, they'll achieve supernormal powers, rid themselves of many distracting thoughts, acquire the fruit of asceticism, and bring about nirvāṇa on their own.",
        "source": "T02n0125_001:0552c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_001:0553a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當修行一法，當廣演布一法。",
        "translation": "You will practice one thing, and you will explain one thing in detail.",
        "source": "T02n0125_001:0553a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "Thus, monks!",
        "source": "T02n0125_001:0553a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "Train yourselves in this way.\"",
        "source": "T02n0125_001:0553a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At the time, the monks who heard what the Buddha taught rejoiced and handed it down.",
        "source": "T02n0125_001:0553a02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（四）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(4) Thus I have heard: One time, the Buddha was present at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_001:0553a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「當修行一法，當廣布一法；便成神通，除眾亂想，逮沙門果，自致涅槃。",
        "translation": "It was then that the Bhagavān addressed the monks, \"You must cultivate one thing and disseminate one thing, and then you'll achieve supernormal powers, remove many disordered perceptions, acquire the fruit of asceticism, and bring about nirvāṇa on your own.",
        "source": "T02n0125_001:0553a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為一法？",
        "translation": "What is the one dharma?",
        "source": "T02n0125_001:0553a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂念戒。",
        "translation": "\"It's called mindfulness of morality.",
        "source": "T02n0125_001:0553a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當善修行，當廣演布，便成神通，除去眾想，逮沙門果，自致涅槃。",
        "translation": "It should be well cultivated, widely disseminated, and then you'll achieve superknowledge, remove many conceptions, acquire the fruit of asceticism, and bring about nirvāṇa on your own.",
        "source": "T02n0125_001:0553a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_001:0553a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當修行一法，當廣布一法。",
        "translation": "You will practice one thing, and you will disseminate one thing.",
        "source": "T02n0125_001:0553a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "Thus, monks!",
        "source": "T02n0125_001:0553a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "Train yourselves in this way.\"",
        "source": "T02n0125_001:0553a10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "The monks who then heard what the Buddha taught rejoiced and handed it down.",
        "source": "T02n0125_001:0553a10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（五）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(5) Thus I have heard: One time, the Buddha was present at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_001:0553a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「當修行一法，當廣布一法；便成神通，去眾亂想，逮沙門果，自致涅槃。",
        "translation": "The Bhagavān then addressed the monks, \"You must cultivate one thing and disseminate one thing, and then you'll achieve supernormal powers, leave all confusing perceptions, acquire the fruit of asceticism, and bring about nirvāṇa on your own.",
        "source": "T02n0125_001:0553a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為一法？",
        "translation": "What is the one dharma?",
        "source": "T02n0125_001:0553a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂念施。",
        "translation": "\"It's called mindful giving.",
        "source": "T02n0125_001:0553a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當善修行，當廣演布，便成神通，除眾亂想，逮沙門果，自致涅槃。",
        "translation": "It should be well cultivated and widely disseminated, and then it will become a miraculous power that removes many disordered notions, acquires the fruit of asceticism, and brings about nirvāṇa naturally.",
        "source": "T02n0125_001:0553a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "\"Thus, monks!",
        "source": "T02n0125_001:0553a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當修行一法，當廣布一法。",
        "translation": "You will practice one thing, and you will disseminate one thing.",
        "source": "T02n0125_001:0553a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是。",
        "translation": "So it is.",
        "source": "T02n0125_001:0553a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T02n0125_001:0553a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "Train yourselves in this way.\"",
        "source": "T02n0125_001:0553a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At the time, the monks who heard what the Buddha taught rejoiced and handed it down.",
        "source": "T02n0125_001:0553a18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（六）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(6) Thus I have heard: One time, the Buddha was present at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_001:0553a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「當修行一法，當廣布一法；便成神通，除諸亂想，獲沙門果，自致涅槃。",
        "translation": "It was then that the Bhagavān addressed the monks, \"You must cultivate one thing and disseminate one thing, and then you'll achieve supernormal powers, remove distracting thoughts, attain the fruit of asceticism, and bring about nirvāṇa on your own.",
        "source": "T02n0125_001:0553a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為一法？",
        "translation": "What is the one dharma?",
        "source": "T02n0125_001:0553a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂念天。",
        "translation": "\"It's called the mindfulness heaven.",
        "source": "T02n0125_001:0553a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當善修行，當廣演布，便成神通，除去諸想，獲沙門果，自致涅槃。",
        "translation": "When they well cultivate it and make it widely known, they'll achieve supernormal powers, rid themselves of perceptions, attain the fruit of asceticism, and bring about nirvāṇa naturally.",
        "source": "T02n0125_001:0553a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_001:0553a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當修行一法，當廣布一法。",
        "translation": "You will practice one thing, and you will disseminate one thing.",
        "source": "T02n0125_001:0553a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "Thus, monks!",
        "source": "T02n0125_001:0553a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "Train yourselves in this way.\"",
        "source": "T02n0125_001:0553a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At the time, the monks who heard what the Buddha taught rejoiced and handed it down.",
        "source": "T02n0125_001:0553a26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（七）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(7) Thus I have heard: One time, the Buddha was present at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_001:0553a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「當修行一法，當廣布一法；便成神通，除諸亂想，獲沙門果，自致涅槃。",
        "translation": "It was then that the Bhagavān addressed the monks, \"You must cultivate one thing and disseminate one thing, and then you'll achieve supernormal powers, remove distracting thoughts, attain the fruit of asceticism, and bring about nirvāṇa on your own.",
        "source": "T02n0125_001:0553a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為一法？",
        "translation": "What is the one dharma?",
        "source": "T02n0125_001:0553b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂念休息。",
        "translation": "\"It's called mindfulness of rest.",
        "source": "T02n0125_001:0553b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當善修行，當廣演布，便成神通，去諸亂想，獲沙門果，自致涅槃。",
        "translation": "When it's well cultivated and widely disseminated, it will become a supernormal power, depart from various confusing ideas, attain the fruit of asceticism, and bring about nirvāṇa naturally.",
        "source": "T02n0125_001:0553b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_001:0553b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當修行一法，當廣布一法。",
        "translation": "You will practice one thing, and you will disseminate one thing.",
        "source": "T02n0125_001:0553b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "Thus, monks!",
        "source": "T02n0125_001:0553b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "Train yourselves in this way.\"",
        "source": "T02n0125_001:0553b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At the time, the monks who heard what the Buddha taught rejoiced and handed it down.",
        "source": "T02n0125_001:0553b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（八）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(8) Thus I have heard: One time, the Buddha was present at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_001:0553b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「當修行一法，當廣布一法；便成神通，除諸亂想，獲沙門果，自致涅槃。",
        "translation": "It was then that the Bhagavān addressed the monks, \"You must cultivate one thing and disseminate one thing, and then you'll achieve supernormal powers, remove distracting thoughts, attain the fruit of asceticism, and bring about nirvāṇa on your own.",
        "source": "T02n0125_001:0553b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為一法？",
        "translation": "What is the one dharma?",
        "source": "T02n0125_001:0553b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂念安般。",
        "translation": "\"It's called mindfulness of breathing.",
        "source": "T02n0125_001:0553b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當善修行，當廣演布，便成神通，去諸亂想，獲沙門果，自致涅槃。",
        "translation": "When it's well cultivated and widely disseminated, it will become a supernormal power, depart from various confusing ideas, attain the fruit of asceticism, and bring about nirvāṇa naturally.",
        "source": "T02n0125_001:0553b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_001:0553b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當修行一法，當廣布一法。",
        "translation": "You will practice one thing, and you will disseminate one thing.",
        "source": "T02n0125_001:0553b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "Thus, monks!",
        "source": "T02n0125_001:0553b13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "Train yourselves in this way.\"",
        "source": "T02n0125_001:0553b13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At the time, the monks who heard what the Buddha taught rejoiced and handed it down.",
        "source": "T02n0125_001:0553b13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(9) Thus I have heard: One time, the Buddha was present at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_001:0553b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「當修行一法，當廣布一法；便成神通，除諸亂想，逮沙門果，自致涅槃。",
        "translation": "At the time, the Bhagavān addressed the monks, \"You must cultivate one thing and disseminate one thing; then you'll achieve supernormal powers, remove distracting thoughts, acquire the fruit of asceticism, and bring about nirvāṇa on your own.",
        "source": "T02n0125_001:0553b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為一法？",
        "translation": "What is the one dharma?",
        "source": "T02n0125_001:0553b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂念身非常。",
        "translation": "\"It's called mindfulness of body that's extraordinary.",
        "source": "T02n0125_001:0553b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當善修行，當廣演布，便成神通，去眾亂想，得沙門果，自致涅槃。",
        "translation": "When it's well cultivated and widely disseminated, it will become a supernormal power that removes many confusing notions, attains the fruit of asceticism, and brings about nirvāṇa naturally.",
        "source": "T02n0125_001:0553b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_001:0553b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當修行一法，當廣布一法。",
        "translation": "You will practice one thing, and you will disseminate one thing.",
        "source": "T02n0125_001:0553b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "Thus, monks!",
        "source": "T02n0125_001:0553b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "Train yourselves in this way.\"",
        "source": "T02n0125_001:0553b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At the time, the monks who heard what the Buddha taught rejoiced and handed it down.",
        "source": "T02n0125_001:0553b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（一〇）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "（Thus I have heard: One time, the Buddha was present at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_001:0553b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「當修行一法，當廣布一法；便成神通，除諸亂想，獲沙門果，自致涅槃。",
        "translation": "It was then that the Bhagavān addressed the monks, \"You must cultivate one thing and disseminate one thing, and then you'll achieve supernormal powers, remove distracting thoughts, attain the fruit of asceticism, and bring about nirvāṇa on your own.",
        "source": "T02n0125_001:0553b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為一法？",
        "translation": "What is the one dharma?",
        "source": "T02n0125_001:0553b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂念死。",
        "translation": "\"It's called mindfulness of death.",
        "source": "T02n0125_001:0553b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當善修行，當廣演布，便成神通，去眾亂想，得沙門果，自致涅槃。",
        "translation": "When you well cultivate it and make it widely known, you'll achieve supernormal powers, rid yourselves of many confusing notions, attain the fruit of asceticism, and bring about nirvāṇa naturally.",
        "source": "T02n0125_001:0553b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_001:0553b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當修行一法，當廣布一法。",
        "translation": "You will practice one thing, and you will disseminate one thing.",
        "source": "T02n0125_001:0553b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "Thus, monks!",
        "source": "T02n0125_001:0553b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "Train yourselves in this way.\"",
        "source": "T02n0125_001:0553b29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At the time, the monks who heard what the Buddha taught rejoiced and handed it down.",
        "source": "T02n0125_001:0553b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛、法、聖眾念　　戒、施及天念　休息、安般念　　身、死念在後增壹阿含經卷第一「『「於今我首上，　　已生衰耗毛；_║　　　　天使已來至，　　宜當時出家。",
        "translation": "Mindfulness of the Buddha, Dharma, and the noble ones, mindfulness of precepts, mindfulness of generosity, and mindfulness of heaven, mindfulness of rest and repose, and mindfulness of body and death came later in the Sutra of Increasing the Number One Āgama, Volume 1, \"'Now that my hair is worn out on my head, _║ an angel has come, so I should leave home at that time.'",
        "source": "T02n0125_001:0553c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "_║　「『「我今已食人中之福，宜當自勉昇天之德，\t_║　剃除鬚髮，著三法衣，以信堅固，出家學道，\t_║　離於眾苦。」",
        "translation": "_║ \"'Now that I've eaten the good fortune of humans, I should strive to ascend to heavenly virtue, _║ shave off my hair, put on the three dharma robes, become resolute in my faith, leave home, and train on the path, _║ and escape all suffering.'\"",
        "source": "T02n0125_001:0553c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　「『時，長壽王告第一太子善觀曰：\t_║　「卿今知不？",
        "translation": "\"'Then, the long-lived king addressed the first prince, Shan Guan, and said, _║ \"Do you know now?",
        "source": "T02n0125_001:0553c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾已首上生白髮，意欲剃除鬚\t_║　髮，著三法衣，以信堅固，出家學道，離於眾\t_║　苦。",
        "translation": "I have grown gray hair on my head, and I want to shave off my beard _║ hair, put on the three garments of the Dharma, become resolute in my faith, leave home, train on the path, and escape the many _║ sufferings.",
        "source": "T02n0125_001:0553c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝紹吾位，以法治化，勿令有失，違吾言\t_║　教，造凡夫行。",
        "translation": "You must take my place, teach by the rules, and prevent any mistake, disobeying my words _║ and teaching, or creating worldly behavior.",
        "source": "T02n0125_001:0553c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者，若有斯人，違吾言\t_║　者，為凡夫之行。",
        "translation": "That's why, if this person disobeys my words _║ they'll be behaving like a worldling.",
        "source": "T02n0125_001:0553c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫凡夫者，長處三塗、八難\t_║　之中。」",
        "translation": "A man who's a mortal is always in the midst of the three destinies and eight difficulties _║.\"",
        "source": "T02n0125_001:0553c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，王長壽八萬四千歲善修梵行，行\t_║　四等心，慈、悲、喜、護，身逝命終，生梵天上。",
        "translation": "The king then lived 84,000 years, well cultivated the religious practice, and performed _║ four equal qualities of mind, kindness, pity, joy, and protection, and when his life ended, he was born in the Brahma Heaven.",
        "source": "T02n0125_001:0553c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，\t_║　王善觀憶父王教，未曾暫捨，以法治化，無\t_║　有阿曲。』",
        "translation": "At the time, the king well observed his father's teaching, never temporarily abandoned it, and taught it by rule, so there was no _║ a quarrel.'",
        "source": "T02n0125_001:0553c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　「迦葉！",
        "translation": "\"Kāśyapa!",
        "source": "T02n0125_001:0553c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知不？",
        "translation": "Do you know?",
        "source": "T02n0125_001:0553c18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時摩訶提婆，豈異人\t_║　乎？",
        "translation": "At that point, is Mahādeva someone else _║?",
        "source": "T02n0125_001:0553c18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫作是觀，爾時王者，今釋迦文是；時長\t_║　壽王者，今阿難身是；爾時善觀者，今優多\t_║　羅比丘是；恒受王法未曾捨忘，亦不斷絕。",
        "translation": "Don't observe it this way: 'At the time, the king was Śākyamuni, the long-lived king was Ānanda, and the well-observed monk was Uttarakuru.",
        "source": "T02n0125_001:0553c19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "\t_║　時，善觀王復興父王勅，以法治化，不斷王\t_║　教。",
        "translation": "_║ Then, King Shanguan again resurrected his father's command to rule and teach the king without stopping the king's _║ teaching.",
        "source": "T02n0125_001:0553c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者，以父王教，難得違故。」",
        "translation": "That's why it's so difficult to disobey the father's instructions.\"",
        "source": "T02n0125_001:0553c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時，尊\t_║　者阿難便說偈曰：",
        "translation": "Venerable Ānanda then spoke a verse, saying.",
        "source": "T02n0125_001:0553c23_2",
        "is_bad_quality": false
    }
]