[
    {
        "source_sentence": "佛說阿含正行經",
        "translation": "Foshuo ahanzhengxing jing",
        "source": "T02n0151_001:0883b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後漢安息國三藏安世高譯",
        "translation": "An Shigao Translation of the Tripiṭaka of the Later Han Kingdom of Anzhi",
        "source": "T02n0151_001:0883b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was present at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0151_001:0883b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，佛告諸比丘言：「我為汝說經，上語亦善，中語亦善，下語亦善，語深說度世之道，正心為本。",
        "translation": "The Buddha then addressed the monks, saying, \"I've taught you a sūtra that's good for your higher speech, good for your middle speech, and good for your lower speech, which profoundly explains the way to save the world and makes the right mind the foundation.",
        "source": "T02n0151_001:0883b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聽我言，使後世傳行之。」",
        "translation": "Listen to what I say, so that future generations may transmit it.\"",
        "source": "T02n0151_001:0883b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘叉手受教。",
        "translation": "The monks saluted with their palms together and accepted the teaching.",
        "source": "T02n0151_001:0883b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「人身中有五賊，牽人入惡道。",
        "translation": "The Buddha said, \"There are five thieves in the human condition who lead people into a bad path.",
        "source": "T02n0151_001:0883c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等五賊？",
        "translation": "What are the five thieves?",
        "source": "T02n0151_001:0883c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者色，二者痛痒，三者思想，四者生死，五者識，是五者人所常念。」",
        "translation": "One is form, two is pain and itch, three is thought, four is birth and death, and five is consciousness, and these are the five things people are always mindful of.\"",
        "source": "T02n0151_001:0883c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「人常為目所欺，為耳所欺，為鼻所欺，為口所欺，為身所欺。",
        "translation": "The Buddha said, \"People are always deceived by their eyes, deceived by their ears, deceived by their nose, deceived by their mouth, and deceived by their body.",
        "source": "T02n0151_001:0883c03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目但能見不能聞；耳但能聞不能見；鼻但能知香，不能聞；口但能知味，不能知香；身體但能知寒溫，不能知味。",
        "translation": "The eyes can see but can't hear, the ears can hear but can't see, the nose can know fragrance but can't hear, the mouth can know taste but can't know fragrance, and the body can know cold and warm but can't know taste.",
        "source": "T02n0151_001:0883c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是五者，皆屬心，心為本。」",
        "translation": "These five things all belong to the mind, and the mind is the root.\"",
        "source": "T02n0151_001:0883c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「諸比丘！",
        "translation": "The Buddha said, \"Monks!",
        "source": "T02n0151_001:0883c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲求道者，當端汝心，從癡但墮十二因緣，便有生死。",
        "translation": "Those who want to pursue the path should end up focusing your mind, for from delusion you'll only fall into twelve causes and conditions, and then there'll be birth-and-death.",
        "source": "T02n0151_001:0883c08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等十二？",
        "translation": "What are the twelve?",
        "source": "T02n0151_001:0883c09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者本為癡，二者行，三者識，四者字，五者六入，六者栽，七者痛，八者愛，九者受，十者有，十一者生，十二者死。",
        "translation": "The first is original delusion, the second is practice, the third is consciousness, the fourth is words, the fifth is the six sense-fields, the sixth is planting, the seventh is pain, the eighth is craving, the ninth is sensation, the tenth is existence, the eleventh is birth, and the twelfth is death.",
        "source": "T02n0151_001:0883c09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "施行善者，復得為人，施行惡者，死入地獄、餓鬼、畜生中。",
        "translation": "Those who do good deeds will be reborn as humans, and those who do evil will die and be sent to hell, hungry ghosts, or the animals.",
        "source": "T02n0151_001:0883c12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛坐思念：『人癡故有生死，何等為癡？』",
        "translation": "The Buddha sat down and thought, 'Delusion causes birth and death in humans; what is delusion?'",
        "source": "T02n0151_001:0883c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本從癡中來，今生為人，復癡心不解目不開，不知死當所趣向？",
        "translation": "Originally coming from delusion, he was born as a human being, but his deluded mind doesn't understand and his eyes don't open, so he doesn't know where he'll go in the event of death.",
        "source": "T02n0151_001:0883c14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見佛不問，見經不讀，見沙門不承事，不信道德，見父母不敬，不念世間苦，不知泥犁中考治劇，是名為癡故有生死。",
        "translation": "To see a Buddha and not ask questions, see a scripture and not read it, see an ascetic and not serve him, not believe in morality, see your father and mother and not honor them, not be mindful of worldly suffering, and not know the trials and tribulations of the niraya is called delusion that gives rise to birth-and-death.",
        "source": "T02n0151_001:0883c15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不止生死，如呼吸間，脆不過於人命。",
        "translation": "Birth-and-death isn't the only thing that's fragile, like breathing, but human life.",
        "source": "T02n0151_001:0883c18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人身中有三事，身死識去心去意去，是三者，常相追逐。",
        "translation": "There are three things in a person's body, and these three things are always in pursuit of each other when the body dies and the consciousness goes away, and the mind goes away and the thought goes away.",
        "source": "T02n0151_001:0883c19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "施行惡者，死入泥犁、餓鬼、畜生、鬼神中；施行善者，亦有三相追逐，或生天上，或生人中，墮是五道中者，皆坐心不端故。」",
        "translation": "Those who do evil will die and enter the niraya, hungry ghosts, animals, and demons, while those who do good will also have three pursuits, either being born in heaven or among humans, or falling into one of these five destinies, all because they're sitting in a state of mental misconduct.\"",
        "source": "T02n0151_001:0883c20_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「皆端汝心，端汝目，端汝耳，端汝鼻，端汝口，端汝身，端汝意，身體當斷於土，魂神當不復入泥犁、餓鬼、畜生、鬼神中。",
        "translation": "The Buddha told the monks, \"All of you will end your mind, end your eyes, end your ears, end your nose, end your mouth, end your body, and end your mind, and your body will be cut off from the earth, and your soul will no longer enter the mire, hungry ghosts, animals, or ghosts.",
        "source": "T02n0151_001:0883c23_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "視人家有惡子，為吏所取，皆坐心不端故。",
        "translation": "Viewing a person's home as having a bad child and having it taken by an official is because they're sitting there with an improper mind.",
        "source": "T02n0151_001:0883c26_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人身有百字，如車有百字，人多貪好怒，不思惟身中事，死入泥犁中，悔無所復及。」",
        "translation": "A person's body has a hundred words, like a chariot has a hundred words, and a person who's greedy, likes anger, and doesn't think about the things in his body will die and go into the mire and regret that there's nothing to return to.\"",
        "source": "T02n0151_001:0883c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「我身棄國捐，遮迦越王憂斷生死，欲度世間人使得泥洹道。",
        "translation": "The Buddha said, \"I abandoned my country and gave it up, but King Cakravāḍa was so concerned about ending birth and death that he wanted to save people in the world and make them attain the path of nirvāṇa.",
        "source": "T02n0151_001:0883c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一精進者，即得阿羅漢道。",
        "translation": "Those who make the first effort will attain the path of the arhat.",
        "source": "T02n0151_001:0884a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二精進者，自致阿那含道。",
        "translation": "The second one who makes effort will attain the path of non-returner by himself.",
        "source": "T02n0151_001:0884a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三精進者，得斯陀含道。",
        "translation": "The third exertion will be to attain the path of sakṛd-āgāmin.",
        "source": "T02n0151_001:0884a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四精進者，得須陀洹道。",
        "translation": "The fourth one who makes effort will attain the path of stream entry.",
        "source": "T02n0151_001:0884a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖不能大精進者，當持五戒：一不殺，二不盜，三不兩舌，四不婬妷，五不飲酒。」",
        "translation": "Even though he can't make great effort, he should observe the five precepts: one, don't kill, two, don't steal, three, don't double-talk, four, don't engage in sexual misconduct, and five, don't drink alcohol.\"",
        "source": "T02n0151_001:0884a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「人坐起常當思念是四事，何等四？",
        "translation": "The Buddha said, \"These are the four things a person should always think about when he sits up; what are the four?",
        "source": "T02n0151_001:0884a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者自觀身，觀他人身。",
        "translation": "One is to observe one's own body and observe the bodies of others.",
        "source": "T02n0151_001:0884a06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者自觀痛痒，觀他人痛痒。",
        "translation": "Two, he observes his own pain and itching and observes the pain and itching of others.",
        "source": "T02n0151_001:0884a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者自觀意，觀他人意。",
        "translation": "Three, he observes his own thoughts and observes the thoughts of others.",
        "source": "T02n0151_001:0884a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者自觀法，觀他人法。",
        "translation": "Fourth, he observes his own feelings and observes the feelings of others.",
        "source": "T02n0151_001:0884a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內復欲亂者，心小自端視身體，飽亦極，飢亦極，住亦極，坐亦極，行亦極，寒亦極，熱亦極，臥亦極。",
        "translation": "When internal desires are further disturbed, the mind pays little attention to the body, which is fed, starved, housed, seated, walking, cold, hot, and lying down.",
        "source": "T02n0151_001:0884a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臥欲來時，當自驚起坐，坐不端者，當起立，立不端者，當經行，心儻不端者，當自正。",
        "translation": "When he's about to come from lying down, he'll startle himself and get up from his seat; if he's not sitting correctly, he'll get up; if he's not standing correctly, he'll walk through the steps; and if his mind is not quite right, he'll set himself straight.",
        "source": "T02n0151_001:0884a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如國王將兵出鬪，健者在前，既在前鄙復却適欲却著後人；沙門既棄家，去妻子，除鬚髮，作沙門，雖一世苦，後長得解脫。",
        "translation": "It's like a king who marches his troops into a fight and the strong man is in front, but he's despising those in front and desires to avoid those behind him; an ascetic who abandons his family, leaves his wife, removes his hair, and becomes an ascetic, though he's suffered for a lifetime, will then attain liberation for a long time.",
        "source": "T02n0151_001:0884a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已得道者，內獨歡喜，視妻如視姊弟，視子如知識，無貪愛之心，常慈哀十方諸天人民，泥犁、餓鬼、畜生，蜎飛蠕動之類，皆使富貴安隱度脫得泥洹之道，見地蟲當以慈心傷哀之。",
        "translation": "Once they have attained the way, they rejoice alone at home, treat their wives as brothers and sisters, and their sons as their teachers, have no craving, and are always compassionate toward the gods and peoples of the ten directions, the hells, hungry ghosts, animals, and creatures that fly and wriggle, all of whom are made wealthy and secure and are liberated to attain the path of nirvāṇa, and earth worms that they see with a compassionate heart.",
        "source": "T02n0151_001:0884a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知生不復癡，能有是意，常念師事佛，如人念父母，如獄中有死罪囚，有賢者往請囚，囚黠慧常念賢者恩。",
        "translation": "He'll always be mindful of his teacher and serve the Buddha, just as a person is mindful of their parents. Suppose there's a prisoner in jail for a capital offense and a good man goes to invite him, and the prisoner's wise and intelligent person always remembers the good man's kindness.",
        "source": "T02n0151_001:0884a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘以得道，常念佛如是，念經如人念飯食。」",
        "translation": "A monk who has attained the way will always be mindful of the Buddha as such, and he'll always be mindful of the sūtras as a person is mindful of food and drink.\"",
        "source": "T02n0151_001:0884a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「諸比丘！",
        "translation": "The Buddha said, \"Monks!",
        "source": "T02n0151_001:0884a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉相承事，如弟事兄，中有癡者，當問慧者，展轉相教。",
        "translation": "\"They will continue to serve each other, like a younger brother serving a younger brother, and if there's someone who's deluded, they'll ask someone who's wise and will continue to teach each other.",
        "source": "T02n0151_001:0884a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問慧者，如冥中有燈火，無得陰搆作惡，無得諍訟。",
        "translation": "Ask someone who's wise, as if there were a lamp flame in the darkness, so they don't have to confront the aggregates and do evil, and they don't have to argue.",
        "source": "T02n0151_001:0884a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見金銀當如視土，無得妄證人入罪法，無得傳人惡言，轉相鬪語言，無得中傷人意。",
        "translation": "Seeing gold and silver, you'll look at them as dirt, so you won't falsely realize that people have entered into sinful behavior, and you won't transmit bad words from others, engage in fierce speech, or criticize their intentions.",
        "source": "T02n0151_001:0884a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不聞莫言聞，不見莫言見，行道常當低頭視地，蟲無得蹈殺。",
        "translation": "Don't say you hear when you don't hear, don't say you see when you don't see, and always look down at the ground when walking on the path, so worms won't be able to trample and kill.",
        "source": "T02n0151_001:0884a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無得自貪人婦女，無得形相人婦女。",
        "translation": "There's no self-craving for human women, and there's no human woman in form or shape that can be obtained.",
        "source": "T02n0151_001:0884a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "坐自思惟，去貪愛之心，乃得為道耳。」",
        "translation": "Sitting on your own, you should contemplate and abandon your desire for them, and then you'll attain the path.\"",
        "source": "T02n0151_001:0884b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「欲求道者，當於空閑處坐，自呼吸其喘息，知息短長，息不報形體皆極，閉氣不息，形體亦極。",
        "translation": "The Buddha said, \"Those who want to pursue the path should sit in a deserted place, breathe in their own respiration, and know that their respiration is short and long; when they don't take breath, their bodies are polarized; when they shut off their breath and don't take breath, their bodies are also polarized.",
        "source": "T02n0151_001:0884b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分別自思惟：『形體誰作者？』",
        "translation": "He discriminates and thinks to himself, 'Who is the author of the body?'",
        "source": "T02n0151_001:0884b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心當觀外，亦當觀內。",
        "translation": "\"The mind should look outward, and it should also look inward.",
        "source": "T02n0151_001:0884b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自思惟歡然，與人有異心，當是時不用天下珍寶，心稍欲隨正道，意復欲小動者，當攝止即還守，意即為還。",
        "translation": "When he considers himself happy and has a mind different from that of others, then he won't use the world's treasures, and when his mind slightly desires to follow the right path and his mind wants to make small movements, he should collect himself, stop, and then return to his guard, and his mind will be returned.",
        "source": "T02n0151_001:0884b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如人有鏡，不明不見形，磨去其垢，即自見形。",
        "translation": "It's like a person who has a mirror and doesn't see its shape when it's unclear, but they polish it away and then see their own shape.",
        "source": "T02n0151_001:0884b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人已去貪婬瞋恚愚癡，譬如磨鏡。",
        "translation": "Once a person has removed craving, lust, ill-will, and folly, it's like polishing a mirror.",
        "source": "T02n0151_001:0884b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦思惟天下，皆無有堅固，亦無有常。」",
        "translation": "When you truly consider it, nothing under the heavens is resolute, and there's no permanence.\"",
        "source": "T02n0151_001:0884b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「持心當如四方石，石在中庭，雨墮亦不能壞，日炙亦不能消，風吹亦不能起，持心當如石。」",
        "translation": "The Buddha told the monks, \"Maintain your mind like a four-sided stone that sits in your atrium and can't be broken by rain, cooled by the sun, or raised by the wind.",
        "source": "T02n0151_001:0884b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「天下人心如流水，中有草木，各自流去，不相顧望，前者亦不顧後，後者亦不顧前，草木流行，各自如故。",
        "translation": "The Buddha told the monks, \"The human mind under heaven is like a flowing river in which there's grass and trees that each flow away without looking at one another, the former doesn't look back, the latter doesn't look forward, and the grass and trees move about as before.",
        "source": "T02n0151_001:0884b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人心亦如是，一念來一念去，如草木前後不相顧望，於天上天下無所復樂，寄居天地間，棄身不復生。",
        "translation": "The human mind is likewise, with one thought coming and one thought going, like grass and trees that come and go without looking at each other, with nothing further to enjoy up in heaven or on earth, living between heaven and earth, abandoning their bodies and not being reborn.",
        "source": "T02n0151_001:0884b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道成乃知師恩，見師者即承事，不見師即思念其教誡，如人念父母，意定乃能有一心，便有哀天下人民蜎飛蠕動之類。",
        "translation": "Once he has accomplished this, he knows the kindness of his teacher, and when he sees his teacher, he immediately accepts his service; when he doesn't see his teacher, he thinks about his instructions, just as a person thinks about their parents, and when his mind is concentrated, he can have a unified mind that then sympathizes with the people of the world as they fly and wriggle about.",
        "source": "T02n0151_001:0884b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "坐自笑我已脫身於天下及五道，一者天道，二者人道，三者餓鬼道，四者畜生道，五者泥犁道。",
        "translation": "They sit there and laugh to themselves, saying, 'I've escaped from the world and the five destinies: one, the heavenly path; two, the human path; three, the path of hungry ghosts; four, the animal path; and five, the nirvāṇa path.'",
        "source": "T02n0151_001:0884b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得阿羅漢者，欲飛行變化即能，身中出水火即能，出無間入無孔亦能，離世間苦取泥洹道亦能。」",
        "translation": "An arhat who has attained arhatship can fly and change when he wants to, can emit water and fire from his body, can leave without interruption and enter without a hole, and can leave worldly suffering and enter the nirvāṇa path.\"",
        "source": "T02n0151_001:0884b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「道不可不作，經不可不讀。」",
        "translation": "The Buddha told the monks, \"The path can't be undone, and the sūtras can't be underexperienced.\"",
        "source": "T02n0151_001:0884b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說經已，五百沙門皆得阿羅漢。",
        "translation": "After the Buddha spoke the sūtras, five hundred ascetics all attained arhatship.",
        "source": "T02n0151_001:0884b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸沙門皆起前，以頭面著地為佛作禮。",
        "translation": "The ascetics all got up and bowed to the Buddha with their heads on the ground.",
        "source": "T02n0151_001:0884b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說阿含正行經",
        "translation": "Sutra of the Correct Practices of the Āgamas Spoken by the Buddha",
        "source": "T02n0151_001:0884b29_0",
        "is_bad_quality": false
    }
]