[
    {
        "source_sentence": "六度集經卷第三",
        "translation": "Sutra on the Collection of the Six Perfections, Volume 3",
        "source": "T03n0152_003:0011b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吳康居國沙門康僧會譯",
        "translation": "Translated by Kang Senghui, a monk from Kangju, Wu",
        "source": "T03n0152_003:0011b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施度無極經(此有十一章)",
        "translation": "Sutra on the Infinitude of Generosity (This text contains eleven chapters)",
        "source": "T03n0152_003:0011b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（一五）聞如是：一時佛在舍衛國祇樹給孤獨園，佛告諸比丘：「昔者有國王號和默，王行仁平，愛民若子，正法治國，民無怨心。",
        "translation": "(15) Thus I have heard: One time, the Buddha was present at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī, and he addressed the monks, \"Once there was a country whose king was called Harmonium, and the king behaved kindly and evenly, loved his people like sons, and ruled the country correctly, so the people had no complaints.",
        "source": "T03n0152_003:0011b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其國廣大郡縣甚多，境界熾盛，五穀豐熟，國無災毒，壽八萬歲。",
        "translation": "It was a vast country with many prefectures, a region that flourished, and a bountiful harvest that was free of calamity and had a life expectancy of 80,000 years.",
        "source": "T03n0152_003:0011b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "和默聖王明令宮中，皇后貴人百官侍者，執綱維臣，教以正法，各理所部。",
        "translation": "The noble king Vermilion clearly ordered his palace, the empress, her nobles, and the hundred officials in attendance to follow the rules and maintain ministers, teaching them the right Dharma and managing their respective departments.",
        "source": "T03n0152_003:0011b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王常慈心愍念眾生，悲其愚惑狂悖自墜，尋存道原喜無不加，哀護眾生如天帝釋，殺、盜、淫泆、兩舌、惡口、妄言、綺語、嫉妒、恚、癡，如此之凶無餘在心。",
        "translation": "The king always has a compassionate heart for sentient beings, pities their foolish, deluded, and disobedient selves, finds the origin of the path in existence, and is delighted without fail to protect sentient beings like Indra, killing, stealing, debauchery, duplicity, harsh words, false speech, fancy speech, envy, anger, and delusion, and there's nothing left in his mind that's foul like these.",
        "source": "T03n0152_003:0011b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "孝順父母敬愛九親，尋追賢者尊戴聖人，信佛、信法、信沙門言，信善有福為惡有殃，以斯忠政十善明法自身執行。",
        "translation": "They should revere their parents and honor their nine relatives, seek out good men and venerate sages, believe in the Buddha, believe in the Dharma, and believe in the words of ascetics, believe that good brings merit and evil brings disaster, and carry out the ten good principles of loyalty and government themselves.",
        "source": "T03n0152_003:0011b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "重勅后妃下逮賤妾，皆令尊奉相率為善，布告四鎮臣民巨細，皆令帶誦心執修行。",
        "translation": "He reprimanded his queen and concubine, making them all honor and respect each other as good, and he told his subjects in the four towns, both large and small, to recite and mentally attach to their practice.",
        "source": "T03n0152_003:0011b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「國有貧者，不任窮困，失計行盜，財主得之，將以啟聞。",
        "translation": "\"In that country, there was a poor man who didn't allow himself to be destitute and stole without thinking, and the wealthy man got hold of him and wanted to tell about it.",
        "source": "T03n0152_003:0011b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『爾盜乎？』",
        "translation": "The king said, 'Did you steal it?'",
        "source": "T03n0152_003:0011b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "盜者曰：『實盜。』",
        "translation": "The thief said, 'It's true that he stole.'",
        "source": "T03n0152_003:0011b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『爾何緣盜乎？』",
        "translation": "The king said, 'What was the reason you stole?'",
        "source": "T03n0152_003:0011b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "盜者曰：『實貧困無以自活，違聖明法蹈火行盜。』",
        "translation": "The thief said, 'I'm really poor and have no way to survive on my own, so I violated the noble and wise teaching and stole by fire.'",
        "source": "T03n0152_003:0011b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王悵愍之，嘉其至誠，恧然內愧，長歎而云：『民之飢者即吾餓之，民之寒者即吾裸之。』",
        "translation": "The king took pity on him, praised his sincerity, and felt embarrassed at heart. He gave a long sigh and said, 'I'll starve the people when they're hungry, and I'll bare the people when they're cold.'",
        "source": "T03n0152_003:0011b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "重曰：『吾勢能令國無貧者，民之苦樂在我而已。』",
        "translation": "He said, 'I'm determined to make the country free of poverty; the people's suffering and happiness are mine alone.'",
        "source": "T03n0152_003:0011b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即大赦其國，出藏珍寶布施困乏，飢渴之人即飲食之，寒者衣之，病者給藥，田園舍宅、金銀珠璣、車馬牛錢恣意所索，飛鳥走獸都及眾蟲，五穀蒭草亦從所好。",
        "translation": "He then pardoned his kingdom and gave away a treasure trove to the needy, feeding the hungry and thirsty, clothing the cold, giving medicine to the sick, soliciting whatever he liked from fields and homes, gold, silver, jewels, and jewelry, chariots, horses, oxen, and money, flying birds, animals, and worms, and the five grains and hay.",
        "source": "T03n0152_003:0011b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「自王布施之後，國豐民富相率以道，民無殺者，盜人財物、婬人婦女、兩舌、惡口、妄言、綺語、嫉妬、恚、癡，兇愚之心，寂而消滅，皆信佛、信法、信沙門，信為善有福、作惡有殃。",
        "translation": "\"After the king's generosity, the nation's wealth and people's prosperity are matched by the way, and the people are spared from killing, stealing people's property, sexual misconduct with women, duplicity, harsh words, false speech, harsh words, jealousy, anger, delusion, and fierce foolishness cease, and they all believe in the Buddha, the Dharma, and the ascetics, believing that doing good brings merit and doing evil brings disaster.",
        "source": "T03n0152_003:0011c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舉國和樂，鞭杖不行，仇敵稱臣，戰器朽于藏，牢獄無繫囚，人民稱善，我生遇哉。",
        "translation": "The country is brought into harmony and happiness, whips and sticks aren't used, enemies are made subservient, weapons of war rot in storage, there are no prisoners in jail, and the people praise their goodness, which is a great encounter for us in this life.",
        "source": "T03n0152_003:0011c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天龍鬼神無不助喜，祐護其國，毒害消竭，五穀豐熟，家有餘財，王內獨喜，即得五福：一者長壽，二者顏華日更好色，三者德勳八方上下，四者無病氣力日增，五者四境安隱心常歡喜。",
        "translation": "The gods, dragons, and spirits all rejoice and protect their country, poison and harm cease, grains are abundant, families have surplus wealth, and the king rejoices alone in his heart, which means he attains five fortunes: first, long life, second, a more beautiful complexion every day, third, virtue that goes up and down in eight directions, fourth, freedom from disease that increases his strength every day, and fifth, four objects that are peaceful and his mind is always joyous.",
        "source": "T03n0152_003:0011c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王後壽終，如強健人，飽食快臥，忽然上生忉利天上。",
        "translation": "\"When his life expectancy ends, the king is like a strong man who eats, sleeps, and is suddenly born in the Heaven of Tragedy.",
        "source": "T03n0152_003:0011c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其國人民奉王十戒，無入地獄、餓鬼、畜生道中者，壽終魂靈皆得上天。」",
        "translation": "The people of that country abide by the king's ten precepts, so no one goes to hell, hungry ghosts, or the animal rebirth path, and their souls all go up to heaven at the end of their lives.\"",
        "source": "T03n0152_003:0011c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸沙門：「時和默王者，吾身是也。」",
        "translation": "The Buddha told the ascetics, \"That's me, King Vaimo.\"",
        "source": "T03n0152_003:0011c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸沙門聞經皆大歡喜，為佛作禮而去。",
        "translation": "The ascetics who heard the sūtra rejoiced greatly, paid homage to the Buddha, and departed.",
        "source": "T03n0152_003:0011c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（一六）佛說四姓經",
        "translation": "(16) Sutra on the Four Families",
        "source": "T03n0152_003:0011c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T03n0152_003:0011c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時四姓家遭宿命殃，貧窶尤困，草衣草席，菜糜自供；雖為極困，足不蹈無道之宅，手不執無道之惠，志行清淨，眾邪不能染其心。",
        "translation": "Although they were in dire straits, their feet didn't tread on untrained ground, their hands didn't grasp untrained wisdom, and their intentions and conduct were so pure that numerous evils couldn't stain their minds.",
        "source": "T03n0152_003:0011c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "朝稟暮講，經戒不釋於口，世尊所歎，眾智所敬，雖衣食不供於身口，奉養聖眾，隨家所有菜糜草席，不忽一日。",
        "translation": "Although he makes offerings in the morning and lectures in the evening, doesn't explain the sūtras and precepts to his mouth, is praised by the Bhagavān, and is respected by all the wise ones, doesn't make offerings of food and clothing to body and mouth, serves the noble ones, and follows household necessities like coarse vegetables and straw mats without neglecting a single day.",
        "source": "T03n0152_003:0011c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸沙門曰：「四姓貧困，常有飢色，吾等不可受彼常食。",
        "translation": "The ascetics said, \"The four families are poor and always hungry, so we mustn't accept their usual food.",
        "source": "T03n0152_003:0011c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經說沙門一心守真，戒具行高，志如天金，不珍財色唯經是寶，絕滅六飢故誓除饉，何耻分衛而不行乎？」",
        "translation": "The sūtras say that ascetics are single-minded and true, their precepts are complete and their conduct is high, their resolve is like that of heavenly gold, they don't treasure possessions and form but only the sūtras, and they vow to eradicate the six hungers and thus remove them, so why are they ashamed to partly guard them and not do so?\"",
        "source": "T03n0152_003:0011c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "共詣佛所，本末陳之。",
        "translation": "They all went to the Buddha's place and told him the story.",
        "source": "T03n0152_003:0012a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊默然。",
        "translation": "The Bhagavān was silent.",
        "source": "T03n0152_003:0012a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後日四姓身詣精舍，稽首畢一面坐。",
        "translation": "The day after that, the four families went to the monastery in person and sat down at one side after prostrating themselves.",
        "source": "T03n0152_003:0012a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛念諸沙門前所啟事，問四姓曰：「寧日慈施供養比丘不？」",
        "translation": "Mindful of what the ascetics had previously revealed, the Buddha asked the four families, \"Would you rather give generously to support the monks?\"",
        "source": "T03n0152_003:0012a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「唯然。",
        "translation": "They replied, \"Yes, I guess so.",
        "source": "T03n0152_003:0012a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舉門日供，但恨居貧，菜糜草席，枉屈聖賢以為默默。」",
        "translation": "I make offerings every day, but I hate that I live in poverty and have a straw mat made of rotten vegetables, so I bend over in vain to keep the noble ones silent.\"",
        "source": "T03n0152_003:0012a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾祐曰：「布施之行，惟在四意，慈心向彼，悲心追愍，喜彼成度，護濟眾生。",
        "translation": "They said, \"The practice of generosity consists of four intentions: to be kind to others, to have compassion for them, to rejoice in their salvation, and to protect sentient beings.",
        "source": "T03n0152_003:0012a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖施微薄，其後所生天上人中二道為常，所願自然，眼色、耳聽、鼻香、口味，身服上衣，心皆欣懌，不懼乏無也。",
        "translation": "Although generosity is modest, the two destinies in which they're subsequently born up in heaven or among humans are permanent, and what they desire comes naturally to their eyes, ears, ears, noses, tastes, and bodies with fine clothing.",
        "source": "T03n0152_003:0012a08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施葌薄，心又不悅，後得其福，福中之薄。",
        "translation": "If their gifts are meager and their hearts are displeased, the fortune they'll later attain will be the least of their merits.",
        "source": "T03n0152_003:0012a10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "官位七寶，得不足榮；處在薄中，心又慳儉不敢衣食，惴惴恰恰未嘗歡喜，腹飢身寒有似乞人，徒生徒死，無善以自祐也。",
        "translation": "Their official position of seven treasures is not enough to honor them, but when they're in a weak position, their minds are frugal and don't dare to clothe or feed them, and they're anxious and precise before they rejoice. With a hungry stomach and a cold body, they resemble a beggar, living and dying in vain, with no goodness to protect themselves.",
        "source": "T03n0152_003:0012a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若施以好，心不懇誠，憍慠自恃，身不供恪，綺求華名，欲遠揚己。",
        "translation": "If someone gives well, their heart isn't sincere, they're arrogant and self-assured, don't make offerings to themselves, and seek fancy names to promote themselves.",
        "source": "T03n0152_003:0012a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後有少財，世人空稱，以為巨億；內懼劫奪，衣常葌薄，食未甞甘，亦為空生空死。",
        "translation": "Later, when he has a little wealth, the world claims it as a great deal; fearing robbery, his clothing is always scanty, and his food is never sweet, which also means he'll be born empty and die empty.",
        "source": "T03n0152_003:0012a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘未甞履其門，遠離三尊，恒近惡道。",
        "translation": "That monk has never walked through their door, has turned away from the three honored ones, and is always near a bad path.",
        "source": "T03n0152_003:0012a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惠以好物，四等敬奉，手自斟酌，存意三尊，誓令眾生逢佛昇天，苦毒消滅，後世所生願無不得，值佛生天必如志願也。」",
        "translation": "He gives them good things, pays them four levels of respect, deliberates with his own hands, and keeps his mind on the Three Honored Ones, vowing to cause sentient beings to meet the Buddha and ascend to heaven, to cease suffering and poison, to wish for nothing in their afterlife, and to meet the Buddha and be born in heaven as they wish.\"",
        "source": "T03n0152_003:0012a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(此章，別本在《薩和檀王經》後)（一七）昔有梵志，名曰維藍，榮尊位高，為飛行皇帝，財難籌算，體好布施：名女上色，服飾光世，以施與人；金鉢盛銀粟，銀鉢盛金粟，澡甕盥槃四寶交錯；金銀食鼎，中有百味；秦水名牛皆以黃金韜衣，其角一牛者日出四升湩；皆從犢子，織成寶服，明珠綻綴；床榻幃帳，寶絡光目；名象良馬，金銀鞍勒，絡以眾寶；諸車華蓋，虎皮為座，彫文刻鏤無好不有。",
        "translation": "(此章，別本在《薩和檀王經》後)（一七）昔有梵志，名曰維藍，榮尊位高，為飛行皇帝，財難籌算，體好布施：名女上色，服飾光世，以施與人；金鉢盛銀粟，銀鉢盛金粟，澡甕盥槃四寶交錯；金銀食鼎，中有百味；秦水名牛皆以黃金韜衣，其角一牛者日出四升湩；皆從犢子，織成寶服，明珠綻綴；床榻幃帳，寶絡光目；名象良馬，金銀鞍勒，絡以眾寶；諸車華蓋，虎皮為座，彫文刻鏤無好不有。",
        "source": "T03n0152_003:0012a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自名女以下至于寶車，事事各有千八十四枚，以施與人。",
        "translation": "From the famous women down to the jeweled chariots, there are a thousand, eighty-four pieces for each thing, which are given to people.",
        "source": "T03n0152_003:0012b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維藍慈惠，八方上下天龍善神無不助喜。",
        "translation": "Weilan's compassionate kindness was so great that the gods and good spirits up and down in the eight directions didn't fail to give their support.",
        "source": "T03n0152_003:0012b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如維藍惠，以濟凡庶，畢其壽命無日疲懈，不如一日飯一清信具戒之女，其福倍彼不可籌算。",
        "translation": "\"Thus, Vera's kindness will help ordinary people, and their whole life will be without laziness, not like the incalculable merit of feeding a faithful, well-established woman with precepts for one day.",
        "source": "T03n0152_003:0012b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又為前施并清信女百，不如清信具戒男一飯。",
        "translation": "It's not as good as giving a hundred faithful women as before, but it's better than one meal for a faithful man with the precepts.",
        "source": "T03n0152_003:0012b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具戒男百，不如具戒女除饉一飯。",
        "translation": "A hundred well-established men wouldn't be as good as one meal for a well-established woman who has escaped from the precepts.",
        "source": "T03n0152_003:0012b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女除饉百，不如高行沙彌一人飯。",
        "translation": "A hundred women who are free from wanting to eat is not as good as one meal given to a high-professional ascetic.",
        "source": "T03n0152_003:0012b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙彌百，不如沙門一人，具戒行者，心無穢濁內外清潔。",
        "translation": "A hundred ascetics wouldn't be as good as one ascetic with the precepts who's mind is unsullied and clean inside and out.",
        "source": "T03n0152_003:0012b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡人猶瓦石，具戒高行者，若明月珠也；瓦石滿四天下，猶不如真珠一矣。",
        "translation": "Ordinary people are like tiles and stones, but someone with the precepts and high conduct is like a bright moon pearl; a tile or stone that fills the four heavens is still not like one true pearl.",
        "source": "T03n0152_003:0012b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如維藍布施之多，逮于具戒眾多之施，不如飯溝港一。",
        "translation": "\"Also, just as Vera's generosity is numerous, he's not as generous as the many precepts he's given as a rice gutter or a harbor.",
        "source": "T03n0152_003:0012b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "溝港百，不如頻來一。",
        "translation": "A hundred gutters and harbors are not as good as one that comes frequently.",
        "source": "T03n0152_003:0012b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頻來百，不如不還一。",
        "translation": "A hundred frequently come is not as good as one that's not returned.",
        "source": "T03n0152_003:0012b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不還百，不如飯應真一人。",
        "translation": "If he doesn't return a hundred, it's not as good as giving rice to one true person.",
        "source": "T03n0152_003:0012b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又如維藍前施及飯諸賢聖，不如孝事其親。",
        "translation": "\"Also, as Vera gave alms and gave meals to the noble ones, it's better to serve one's relatives with filial piety.",
        "source": "T03n0152_003:0012b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "孝者盡其心無外私。",
        "translation": "Being filial exhausts one's mind and has no external selfishness.",
        "source": "T03n0152_003:0012b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "百世孝親，不如飯一辟支佛。",
        "translation": "A hundred generations of filial piety wouldn't be as good as feeding one pratyekabuddha.",
        "source": "T03n0152_003:0012b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "辟支佛百。",
        "translation": "A hundred pratyekabuddhas are not as good as feeding one Buddha.",
        "source": "T03n0152_003:0012b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不如飯一佛。",
        "translation": "It's not as good as feeding one Buddha.",
        "source": "T03n0152_003:0012b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛百，不如立一剎、守三自歸，歸佛歸法歸比丘僧。",
        "translation": "A hundred buddhas wouldn't be as good as establishing one bhava and observing the three refuges, which are to the Buddha, Dharma, and monks.",
        "source": "T03n0152_003:0012b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "盡仁不殺，守清不盜，執貞不犯他妻，奉信不欺，孝順不醉，持五戒，月六齋，其福巍巍，勝維藍布施萬種名物，及飯賢聖，甚為難算矣。",
        "translation": "Exhausting benevolence and not killing, abiding in purity and not stealing, upholding chastity and not transgressing other wives, consecrating faith and not deceiving, being filial and obedient and not getting drunk, observing the five precepts, and observing the six monthly purifications, their merits are so towering that they're greater than Vilânta's giving tens of thousands of name-dropping items and feeding the noble ones, which are difficult to calculate.",
        "source": "T03n0152_003:0012b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「持戒不如等心慈育眾生，其福無盡也。",
        "translation": "\"Observing the precepts isn't as good as nurturing sentient beings with equal kindness, whose merits are endless.",
        "source": "T03n0152_003:0012b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖為菜糜草席，執三自歸，懷四等心，具持五戒，山海可秤量，斯福難籌算也。」",
        "translation": "Even though it's a straw mat made of coarse vegetables, adhering to the three refuges with four equal intentions and upholding the five precepts, the mountains and seas can be measured, and it's difficult to calculate that merit.\"",
        "source": "T03n0152_003:0012b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告四姓：「欲知維藍者，我身是。」",
        "translation": "The Buddha told the four families, \"He who wants to know Vera, this is me.\"",
        "source": "T03n0152_003:0012b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四姓聞經，心大歡喜，作禮而去。",
        "translation": "When the four families heard the sūtra, their hearts rejoiced greatly, they paid homage, and departed.",
        "source": "T03n0152_003:0012b27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（一八）「昔者菩薩身為鹿王，厥體高大，身毛五色，蹄角奇雅，眾鹿伏從數千為群。",
        "translation": "(108) \"Once, the bodhisattva himself was a deer king with a tall, large body, five-colored hair, and elegant hooves and horns, and he was subjugated by thousands of deer in his herd.",
        "source": "T03n0152_003:0012b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國王出獵，群鹿分散，投巖墮坑，盪樹貫棘，摧破死傷所殺不少。",
        "translation": "When the king went hunting, the herd of deer scattered, threw themselves into rocks and pits, crushed trees and thorns, and killed many of them by destruction and death.",
        "source": "T03n0152_003:0012c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鹿王覩之，哽噎曰：『吾為眾長，宜當明慮擇地而遊，苟為美草而翔於斯，凋殘群小，罪在我也。』",
        "translation": "When he saw them, the deer king choked up and said, 'As the head of the herd, I should have thoughtfully chosen the right place to roam, but if I had flown here for the sake of the beautiful grass and withered the herd, my fault would have been mine.'",
        "source": "T03n0152_003:0012c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "徑自入國，國人覩之，僉曰：『吾王有至仁之德，神鹿來翔。』",
        "translation": "He went straight into the country, and when the people there saw him, they all said, 'My king has the supreme virtue of benevolence; a sacred deer has come to fly.'",
        "source": "T03n0152_003:0012c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以為國瑞，莫敢干之。",
        "translation": "They thought it was a national omen, and no one dared to interfere with it.",
        "source": "T03n0152_003:0012c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃到殿前，跪而云曰：『小畜貪生，寄命國界。",
        "translation": "He went to the front of the palace, knelt down, and said, 'Small animals crave life, and they're relying on the state for their lives.",
        "source": "T03n0152_003:0012c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卒逢獵者，蟲類奔迸，或生相失，或死狼籍。",
        "translation": "When the hunters suddenly come, insects scurry about, sometimes missing each other's lives, and sometimes dying in a mess.",
        "source": "T03n0152_003:0012c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天仁愛物，實為可哀。",
        "translation": "It's really sad that God's kindness loves things.",
        "source": "T03n0152_003:0012c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願自相選，日供太官，乞知其數，不敢欺王。』",
        "translation": "I would like to select myself as a daily servant to the commander, and I beg you to know its number so that I won't dare to deceive the king.'",
        "source": "T03n0152_003:0012c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王甚奇曰：『太官所用日不過一，不知汝等傷死甚多。",
        "translation": "The king was very surprised, saying, 'The Taiguan uses only one day, and I don't know how many of you have died or been injured.",
        "source": "T03n0152_003:0012c11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若實如云，吾誓不獵。』",
        "translation": "If that's true, I swear I won't hunt.'",
        "source": "T03n0152_003:0012c12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「鹿王退還，悉命群鹿，具以斯意示其禍福。",
        "translation": "\"The deer king retreated and ordered all the deer to tell him exactly what they thought would be bad and good.",
        "source": "T03n0152_003:0012c13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "群鹿伏聽，自相差次。",
        "translation": "The deer obeyed and listened, taking their own turns.",
        "source": "T03n0152_003:0012c14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應先行者每當就死，過辭其王，王為泣涕，誨喻之曰：『覩世皆死，孰有免之？",
        "translation": "Whenever one of the deer that should go before them goes to his death, he excuses himself to the king, who weeps and tells him, 'Seeing how everyone dies in the world, who could be spared?'",
        "source": "T03n0152_003:0012c14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尋路念佛，仁教慈心，向彼人王慎無怨矣！』",
        "translation": "Seeking the path and recollecting the Buddha, you will be kind, teach compassion, and address yourself to the king of men, who will be careful not to complain!'",
        "source": "T03n0152_003:0012c16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "日日若茲。",
        "translation": "Day by day, they did the same thing.",
        "source": "T03n0152_003:0012c17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中有應行者而身重胎，曰：『死不敢避，乞須娩娠。』",
        "translation": "Among them was a practitioner who was heavily pregnant and said, 'I dare not avoid death, but I beg you to give birth to a child.'",
        "source": "T03n0152_003:0012c17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更取其次，欲以代之。",
        "translation": "He took the second in line and wanted to replace him.",
        "source": "T03n0152_003:0012c19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其次頓首泣涕而曰：『必當就死。",
        "translation": "The second in line burst into tears and said, 'I'll surely die.'",
        "source": "T03n0152_003:0012c19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尚有一日一夜之生、斯須之命，時至不恨。』",
        "translation": "There's still one more day and one more night of birth and this must be my life, so I won't hate it.'",
        "source": "T03n0152_003:0012c20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「鹿王不忍枉其生命，明日遁眾，身詣太官。",
        "translation": "\"The deer king couldn't bear to waste his life, so he withdrew from the crowd tomorrow and went to the governor.",
        "source": "T03n0152_003:0012c21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廚人識之，即以上聞。",
        "translation": "The cooks recognized him and told him about it.",
        "source": "T03n0152_003:0012c22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王問其故，辭答如上。",
        "translation": "The king asked him about the reason, and he replied as above.",
        "source": "T03n0152_003:0012c23_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王愴然為之流淚曰：『豈有畜獸懷天地之仁殺身濟眾，履古人弘慈之行哉！",
        "translation": "The king was moved to tears, saying, 'Could it be that an animal harbors the kindness of heaven and earth and kills itself to save the people, fulfilling the compassionate actions of the ancients?'",
        "source": "T03n0152_003:0012c23_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾為人君，日殺眾生之命，肥澤己體。",
        "translation": "As a human ruler, I kill the lives of sentient beings every day to fatten my own body.",
        "source": "T03n0152_003:0012c25_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾好兇虐，尚犲狼之行乎？",
        "translation": "I'm fierce and abusive, but what about the behavior of wolves?",
        "source": "T03n0152_003:0012c26_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獸為斯仁，有奉天之德矣。』",
        "translation": "For this kindness, the animal has the virtue of serving the gods.'",
        "source": "T03n0152_003:0012c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王遣鹿去還其本居，勅一國界：『若有犯鹿者與人同罰。』",
        "translation": "The king sent the deer away to return to their original home and commanded that the boundaries of the country be set, 'If someone violates the deer, they'll be punished the same as the people.'",
        "source": "T03n0152_003:0012c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「自斯之後，王及群寮率化，黎民遵仁不殺，潤逮草木，國遂太平。",
        "translation": "\"Since then, the king and his retinue have led the way, the people have complied with kindness and not killed, the grass and trees have been nourished, and the country has become peaceful.",
        "source": "T03n0152_003:0012c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩世世危命濟物，功成德隆，遂為尊雄。」",
        "translation": "The bodhisattvas' lives have been endangered over time to help people, and their merits have grown so great that they've become venerable.\"",
        "source": "T03n0152_003:0013a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「時鹿王者，是吾身也。",
        "translation": "The Buddha told the monks, \"The deer king at the time was me.",
        "source": "T03n0152_003:0013a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國王者，舍利弗是。",
        "translation": "The king of the country is Śāriputra.",
        "source": "T03n0152_003:0013a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩慈惠度無極行布施如是。」",
        "translation": "This is how a bodhisattva compassionately and unexcelledly practices generosity.\"",
        "source": "T03n0152_003:0013a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（一九）「昔者菩薩身為鵠鳥，生子有三。",
        "translation": "(19) \"Once, the bodhisattva was born as a bird and had three sons.",
        "source": "T03n0152_003:0013a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，國大旱，無以食之，裂腋下肉以濟其命。",
        "translation": "When there was a great drought in the country, there was nothing to eat, so he tore the flesh from his armpit to save his life.",
        "source": "T03n0152_003:0013a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三子疑曰：『斯肉氣味與母身氣相似無異，得無吾母以身肉飡吾等乎？』",
        "translation": "The three sons doubted, 'Does this flesh have an odor similar to or similar to their mother's body odor, and could our mother not have fed us with her own flesh?'",
        "source": "T03n0152_003:0013a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三子愴然有悲傷之情。",
        "translation": "The three sons were pained by a sense of sadness.",
        "source": "T03n0152_003:0013a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰：『寧殞吾命，不損母體也。』",
        "translation": "They also said, 'I'd rather give up my life than harm my mother's body.'",
        "source": "T03n0152_003:0013a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是閉口不食。",
        "translation": "He then shut his mouth and didn't eat.",
        "source": "T03n0152_003:0013a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母覩不食而更索焉。",
        "translation": "Seeing that he wasn't eating, his mother asked for more.",
        "source": "T03n0152_003:0013a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天神歎曰：『母慈惠難喻，子孝希有也。』",
        "translation": "The gods praised them, saying, 'A mother's kindness and wisdom are hard to describe, and there's rarely a son who's filial.'",
        "source": "T03n0152_003:0013a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天祐之，願即從心。」",
        "translation": "The gods bless him and grant him the wish to obey his heart.\"",
        "source": "T03n0152_003:0013a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「鵠母者，吾身是也。",
        "translation": "The Buddha told the monks, \"The mother of this Śāriputra is myself.",
        "source": "T03n0152_003:0013a12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三子者，舍利弗、目連、阿難是也。",
        "translation": "The three sons are Śāriputra, Maudgalyāyana, and Ānanda.",
        "source": "T03n0152_003:0013a13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩慈惠度無極行布施如是。」",
        "translation": "This is how the bodhisattvas compassionately save and infinitely practice generosity.\"",
        "source": "T03n0152_003:0013a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(此章，別本在〈維藍章〉後)（二〇）「昔者菩薩為孔雀王，從妻五百，委其舊匹，欲青雀妻。",
        "translation": "(This chapter is separate from the one following the Vilan chapter.) (20) \"Once, the bodhisattva was the peacock king and took 500 wives, giving them old ones and desiring a wife for the blue finch.",
        "source": "T03n0152_003:0013a14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "青雀唯食甘露好菓，孔雀為妻日行取之。",
        "translation": "The blue finch only ate good nectar and fruit, so the peacock took it for his wife every day.",
        "source": "T03n0152_003:0013a16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其國王夫人有疾，夢覩孔雀，云其肉可為藥。",
        "translation": "The king's wife was sick, and in a dream she saw a peacock and heard that its flesh could be used as medicine.",
        "source": "T03n0152_003:0013a17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寤以啟聞，王命獵士疾行索之。",
        "translation": "When she awoke, she was told that the king ordered a hunter to search for it quickly.",
        "source": "T03n0152_003:0013a18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫人曰：『誰能得之，娉以季女，賜金百斤。』",
        "translation": "The lady said, 'Whoever gets it will be given a hundred catties of gold for the honor of having his daughter as his wife.'",
        "source": "T03n0152_003:0013a19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「國之獵士分布行索，覩孔雀王從一青雀在常食處，即以蜜麨每處塗樹，孔雀輙取以供其妻。",
        "translation": "\"When the hunter from that country went out to search for her, he saw the peacock king following a blue finch to his usual feeding place and rubbed honey and flour on a tree every where, and the peacock would often take it and offer it to his wife.",
        "source": "T03n0152_003:0013a20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "射師以麨塗身尸踞，孔雀取麨，人應獲焉。",
        "translation": "The archer smeared the body and corpse with the flour, and the peacock took the flour, so that people might obtain it.",
        "source": "T03n0152_003:0013a22_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "孔雀曰：『子之勤身，必為利也。",
        "translation": "The peacock said, 'You must be working hard for your body's benefit.",
        "source": "T03n0152_003:0013a23_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾示子金山，可為無盡之寶，子原吾命矣。』",
        "translation": "I've shown you the gold mountain, which can be an inexhaustible treasure; you have originally taken my life.'",
        "source": "T03n0152_003:0013a24_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人曰：『大王賜吾金百斤，妻以季女；豈信汝言乎？』",
        "translation": "The man said, 'The great king gave me a hundred catties of gold and a wife with a young woman; do you believe your words?'",
        "source": "T03n0152_003:0013a25_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即以獻王。",
        "translation": "He then presented it to the king.",
        "source": "T03n0152_003:0013a26_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「孔雀曰：『大王懷仁，潤無不周，願納微言，乞得少水，吾以慈呪，服之疾即愈矣；若其無效，受罪不晚。』",
        "translation": "\"The peacock said, 'The king is kind and nourishing, and there's nothing he can't do. Please accept my humble request for a little water, which I can use as a compassionate spell to heal your illness; if it doesn't work, it won't be too late to accept the punishment.'",
        "source": "T03n0152_003:0013a26_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王順其意，夫人服之，眾疾皆愈，華色煒曄，宮人皆然。",
        "translation": "The king complied with his wishes, the lady took it, and all her ailments were healed, and her palace was resplendent with flowers.",
        "source": "T03n0152_003:0013a29_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舉國歎王弘慈，全孔雀之命，獲延一國之壽。",
        "translation": "The king was praised for his great kindness in sparing the life of the peacock and prolonging the life of a nation.",
        "source": "T03n0152_003:0013b01_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雀曰：『願得投身于彼大湖，并呪其水，率土黎民，眾疾可愈。",
        "translation": "The peacock said, 'May I plunge into that great lake and spell its waters so that the people of the land will be healed of their many illnesses.",
        "source": "T03n0152_003:0013b02_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有疑望，願以杖捶吾足。』",
        "translation": "If I have any doubts, I wish to be beaten on the feet with a staff.'",
        "source": "T03n0152_003:0013b04_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『可。』",
        "translation": "The king said, 'Yes.'",
        "source": "T03n0152_003:0013b04_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雀即呪之。",
        "translation": "The bird then had the spell applied to it.",
        "source": "T03n0152_003:0013b05_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國人飲水，聾聽盲視，瘖語[病-丙+區]申，眾疾皆然。",
        "translation": "When the people of the land drank the water, they became deaf and blind, and their speech was [sickness-c + area] incoherent, and all their illnesses were healed.",
        "source": "T03n0152_003:0013b05_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「夫人疾除，國人竝得無病，無有害孔雀之心。",
        "translation": "\"When your wife's illness is gone, the people of the country will be free of illness and no harm will come to the peacock's mind.",
        "source": "T03n0152_003:0013b06_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雀具知之，向王陳曰：『受王生潤之恩，吾報濟一國之命。』",
        "translation": "Knowing this, the peacock told the king, 'I've received the king's kindness of birth and nurturing, so I'll repay him for saving the life of a nation.'",
        "source": "T03n0152_003:0013b07_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "報畢乞退，王曰：『可。』",
        "translation": "After he finished his speech, he begged to retire, and the king said, 'Yes.'",
        "source": "T03n0152_003:0013b08_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雀即翔飛昇樹重曰：『天下有三癡。』",
        "translation": "The sparrow then soared up into a tree and said, 'There are three delusions in the world.'",
        "source": "T03n0152_003:0013b09_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『何謂三？』",
        "translation": "The king said, 'What are the three?'",
        "source": "T03n0152_003:0013b10_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『一者吾癡，二者獵士癡，三者大王癡。』",
        "translation": "'One, I'm deluded, two, the hunter is deluded, and three, the king is deluded.'",
        "source": "T03n0152_003:0013b10_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『願釋之。』",
        "translation": "The king said, 'May it be explained.'",
        "source": "T03n0152_003:0013b11_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雀曰：『諸佛重戒以色為火，燒身危命之由也。",
        "translation": "The bird said, 'The buddhas' grave precept against using form as fire is the reason they burn their bodies and endanger their lives.",
        "source": "T03n0152_003:0013b11_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾捨五百供養之妻，而貪青雀，索食供之有如僕使，為獵網所得，殆危身命。",
        "translation": "I would abandon my wife of 500 offerings and instead crave a blue finch, asking for food to offer him like a servant, and then I'd be caught by a hunting net, which would endanger my body and life.",
        "source": "T03n0152_003:0013b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯吾癡也。",
        "translation": "This is because I'm deluded.",
        "source": "T03n0152_003:0013b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獵士癡者，吾至誠之言，捨一山之金，棄無窮之寶，信夫人邪偽之欺，望季女之妻，覩世狂愚皆斯類矣。",
        "translation": "A hunter's delusion is based on my sincere words, abandoning a mountain of gold and an infinite amount of treasure, believing the mistaken deception of a wife, hoping for the wife of a young woman, and seeing that the world's crazy fools are all of this sort.",
        "source": "T03n0152_003:0013b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捐佛至誠之戒，信鬼魅之欺，酒樂婬亂，或致破門之禍，或死入太山其苦無數，思還為人，猶無羽之鳥欲飛昇天，豈不難哉？",
        "translation": "They abandon the Buddha's perfectly sincere precepts, believe in the deception of ghosts and demons, drink, enjoy alcohol, and engage in debauchery, which may lead to the ruin of their homes or death in the Taishan Mountains, where their suffering is countless.",
        "source": "T03n0152_003:0013b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婬婦之妖喻彼[魅-未+失]魅，亡國危身靡不由之，而愚夫尊之；萬言無一誠也，而射師信之。",
        "translation": "The demon of a prostitute is a metaphor for that [charming-not-yet+lost] demon, which is not used to kill a country and endanger its body, but is honored by foolish men; there's not a single honest word, but archers believe it.",
        "source": "T03n0152_003:0013b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯謂獵者愚矣。",
        "translation": "This is called the hunter's folly.",
        "source": "T03n0152_003:0013b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王得天醫除一國疾，諸毒都滅，顏如盛華，巨細欣賴而王放之。",
        "translation": "The king gets a divine physician to remove a country's illnesses, and all the poisons go away, leaving his face like a full bloom, and the great and small rejoice when the king releases them.",
        "source": "T03n0152_003:0013b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯謂王愚矣。』」",
        "translation": "This is called the king being foolish.'\"",
        "source": "T03n0152_003:0013b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告舍利弗：「孔雀王自是之後，周旋八方輙以神藥，慈心布施，愈眾生病。",
        "translation": "The Buddha told Śāriputra, \"Since then, the peacock king has been going around in eight directions, offering sacred medicines and compassionate charity to heal people who are sick.",
        "source": "T03n0152_003:0013b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "孔雀王者，吾身是。",
        "translation": "The peacock king is myself.",
        "source": "T03n0152_003:0013b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國王者。",
        "translation": "The king of the kingdom is.",
        "source": "T03n0152_003:0013b27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗是。",
        "translation": "It's Śāriputra.",
        "source": "T03n0152_003:0013b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獵士者，調達是。",
        "translation": "The hunter, that's Tadra.",
        "source": "T03n0152_003:0013b27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫人者。",
        "translation": "That's a wife.",
        "source": "T03n0152_003:0013b28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "調達妻是也。",
        "translation": "This is the wife of the tamer.",
        "source": "T03n0152_003:0013b28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩慈惠度無極行布施如是。」",
        "translation": "This is how a bodhisattva's compassionate, limitless acts of charity are like.\"",
        "source": "T03n0152_003:0013b28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二一）「昔者梵志，年百二十，執貞不娶婬泆窈盡，靖處山澤不樂世榮，以茅草為廬、蓬蒿為席，泉水山果趣以支命，志弘行高，天下歎德。",
        "translation": "(21) \"Once, a priest, 120 years old, clung to chastity, didn't marry, and ended sexual misconduct; he quietly stayed in a mountain swamp, didn't enjoy worldly prosperity, made thatch a hut and wormwood a seat, and supported his life by releasing the fruits of spring water from the mountains.",
        "source": "T03n0152_003:0013c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王娉為相，志道不仕，處于山澤數十餘載，仁逮眾生禽獸附恃。",
        "translation": "When Wang Ping became prime minister, his intention was not to pursue his career, but to stay in the mountains and swamps for more than a few dozen years, he was taken in by kindness and entrusted with the lives of sentient beings and animals.",
        "source": "T03n0152_003:0013c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有四獸，狐、獺、猴、兔，斯四獸曰：『供養道士，靖心聽經。』",
        "translation": "At the time, there were four animals, a fox, an otter, a monkey, and a rabbit, and these four animals said, 'Make offerings to the Way, and calm your mind to listen to the sūtras.'",
        "source": "T03n0152_003:0013c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "積年之久，山菓都盡，道士欲徙尋果所盛。",
        "translation": "After years had passed, the fruits of the mountains were all exhausted, and the Daoist monk wanted to migrate to find a place where the fruits would flourish.",
        "source": "T03n0152_003:0013c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四獸憂曰：『雖有一國榮華之士，猶濁水滿海，不如甘露之斗升也。",
        "translation": "The four animals worried, 'Even though there's a man of great splendor in one country, it's still like the ocean filled with turbid water, not like a bucket of sweet dew rising.'",
        "source": "T03n0152_003:0013c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道士去者，不聞聖典，吾為衰乎！",
        "translation": "When the Daoist man leaves, I won't hear of the holy scriptures, so I'll be in decline!",
        "source": "T03n0152_003:0013c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各隨所宜求索飲食，以供道士，請留此山，庶聞大法。』",
        "translation": "Each of you should seek food and drink as appropriate for the monks of the Way, so please stay on this mountain and let's hear about the great teaching.'",
        "source": "T03n0152_003:0013c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僉然曰：『可。』",
        "translation": "They all said, 'Yes.'",
        "source": "T03n0152_003:0013c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獼猴索果，狐化為人，得一囊麨，獺得大魚，各曰：『可供一月之粮。』",
        "translation": "The monkeys asked for fruit, the foxes were transformed into men, and they found a bag of flour and the otters found large fish, and each said, 'That will provide food for a month.'",
        "source": "T03n0152_003:0013c12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兔深自惟：『吾當以何供道士乎？』",
        "translation": "The hare thought to himself, 'What will I give to the monk?'",
        "source": "T03n0152_003:0013c13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『夫生有死，身為朽器，猶當棄捐；食凡夫萬，不如道士一。』",
        "translation": "He said, 'Man, there's birth and death, and his body is a decaying vessel that should still be discarded; eating ten thousand ordinary people is not like eating one Taoist monk.'",
        "source": "T03n0152_003:0013c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即行取樵然之為炭，向道士曰：『吾身雖小，可供一日之粮。』",
        "translation": "He then took a woodcutter's wood and turned it into charcoal, saying to the Daoist, 'Although my body is small, it can provide food for one day.'",
        "source": "T03n0152_003:0013c16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言畢即自投火，火為不然。",
        "translation": "After he said that, he threw himself into the fire, but the fire was not for him.",
        "source": "T03n0152_003:0013c17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道士覩之，感其若斯，諸佛歎德，天神慈育。",
        "translation": "Seeing him, the Daoist man was impressed by his appearance, the Buddhas praised his virtue, and the gods were kind and nurturing.",
        "source": "T03n0152_003:0013c18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道士遂留，日說妙經，四獸稟誨。」",
        "translation": "The Daoist then stayed and taught the wonderful sūtras every day, and the four animals gave him instructions.\"",
        "source": "T03n0152_003:0013c19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸沙門：「梵志者，錠光佛是也。",
        "translation": "The Buddha told the ascetics, \"That's Brahmā, the Dīpaṃkara Buddha.",
        "source": "T03n0152_003:0013c19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兔者，吾身是也。",
        "translation": "The rabbit is myself.",
        "source": "T03n0152_003:0013c20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獼猴者，秋鷺子是也。",
        "translation": "The monkey, that's Akaniṣṭha.",
        "source": "T03n0152_003:0013c21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "狐者，阿難是也。",
        "translation": "The fox, that's Ānanda.",
        "source": "T03n0152_003:0013c21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獺者，目連是也。",
        "translation": "The otter is Maudgalyāyana.",
        "source": "T03n0152_003:0013c22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩慈惠度無極行布施如是。」",
        "translation": "This is how the bodhisattvas compassionately save and infinitely practice generosity.\"",
        "source": "T03n0152_003:0013c22_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二二）「昔者菩薩為大理家，積寶齊國，常好濟貧惠逮眾生，受一切歸猶海含流。",
        "translation": "(2:22) \"Once, the bodhisattva was a great administrator who amassed treasures to make his country whole, always doing good to the poor and helping sentient beings by accepting all the offerings as if they were currents in the ocean.",
        "source": "T03n0152_003:0013c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有友子，以泆蕩之行，家賄消盡。",
        "translation": "At the time, there was a friend whose family's wealth had disappeared because of his licentious behavior.",
        "source": "T03n0152_003:0013c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "理家愍焉，教之曰：『治生以道，福利無盡。』",
        "translation": "The Rich family took pity on him and taught him, 'If you govern life according to the Way, your welfare will be inexhaustible.'",
        "source": "T03n0152_003:0013c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以金千兩給子為本。",
        "translation": "He gave the son a thousand taels of gold as his capital.",
        "source": "T03n0152_003:0013c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『敬諾。",
        "translation": "He replied, 'Respectfully accept it.",
        "source": "T03n0152_003:0013c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不敢違明誨。』",
        "translation": "I won't dare to disobey your instructions.'",
        "source": "T03n0152_003:0013c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即以行賈。",
        "translation": "He then took refuge in a rich man's practice.",
        "source": "T03n0152_003:0013c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "性邪行嬖，好事鬼妖，婬蕩酒樂，財盡復窮。",
        "translation": "Their natures are wrong, their ways are wrong, they do good deeds, they're like ghosts and demons, and they debauch themselves with alcohol and pleasure, so their wealth is exhausted and they run out.",
        "source": "T03n0152_003:0013c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如斯五行[歹*斯]盡其財，窮還守之。",
        "translation": "Thus, these five practices [misdeeds*s] exhaust their wealth, and they are left in poverty to guard it.",
        "source": "T03n0152_003:0014a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，理家門外糞上有死鼠，理家示之曰：『夫聰明之善士者，可以彼死鼠治生成居也。",
        "translation": "When there was a dead mouse on the dung outside the Rishis' house, the Rishis told him, 'A clever man of good character can make a living with that dead mouse.",
        "source": "T03n0152_003:0014a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有金千兩而窮困乎？",
        "translation": "Does he have a thousand taels of gold and yet he's destitute?'",
        "source": "T03n0152_003:0014a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今復以金千兩給汝。』",
        "translation": "Now, I'll give you another thousand taels of gold.'",
        "source": "T03n0152_003:0014a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時有乞兒，遙聞斯誨愴然而感，進猶乞食，還取鼠去，循彼妙教，具乞諸味，調和炙之，賣得兩錢；轉以販菜，致有百餘。",
        "translation": "\"He followed their wonderful teaching, begged for a variety of flavors, blended and roasted them, and sold them for two coins; he then sold vegetables and made a hundred more.",
        "source": "T03n0152_003:0014a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以微致著，遂成富姓。",
        "translation": "He became wealthy because of his attachment to modesty.",
        "source": "T03n0152_003:0014a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閑居憶曰：『吾本乞兒，緣致斯賄乎！』",
        "translation": "He lives quietly and remembers, 'I was a beggar, how could I have gotten such a bribe?'",
        "source": "T03n0152_003:0014a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寤曰：『由賢理家訓彼兒頑，吾致斯寶。",
        "translation": "He awoke and said, 'A good man of principle instructs his son to be stubborn, and I give him this treasure.",
        "source": "T03n0152_003:0014a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受恩不報，謂之背明。』",
        "translation": "To accept a favor and not return it is called betraying wisdom.'",
        "source": "T03n0152_003:0014a10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作一銀案，又為金鼠，以眾名珍滿其腹內，羅著案上。",
        "translation": "He made a silver case and a gold rat, filled its belly with many famous treasures, and placed them on the case.",
        "source": "T03n0152_003:0014a10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又以眾寶瓔珞其邊，具以眾甘，禮彼理家，陳其所以：『今答天潤。』",
        "translation": "He also decorated it with a necklace of many treasures and decorated it with many sweets, paid homage to the philosopher, and said, 'Now, I'll answer the gods for nurturing us.'",
        "source": "T03n0152_003:0014a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "理家曰：『賢哉，丈夫！",
        "translation": "The philosopher said, 'Good, sir!",
        "source": "T03n0152_003:0014a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "可為教訓矣。』",
        "translation": "That's a good lesson to teach.'",
        "source": "T03n0152_003:0014a13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即以女妻之，居處眾諸都以付焉，曰：『汝為吾後，當奉佛三寶，以四等心救濟眾生。』",
        "translation": "He then gave his wife and wife, and entrusted her with the many places he lived, saying, 'You will be my successor, serve the Buddha's three treasures, and save sentient beings with the four equal qualities of mind.'",
        "source": "T03n0152_003:0014a14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『必修佛教矣。』",
        "translation": "He said, 'You must cultivate Buddhism.'",
        "source": "T03n0152_003:0014a16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後為理家之嗣，一國稱孝。」",
        "translation": "Later, he became the heir of the Rishis and was called dutiful in one country.\"",
        "source": "T03n0152_003:0014a16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸沙門：「理家者，吾身是也。",
        "translation": "The Buddha told the ascetics, \"The house of principle is myself.",
        "source": "T03n0152_003:0014a17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼蕩子者，調達是。",
        "translation": "That loafer is the tamer.",
        "source": "T03n0152_003:0014a18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以鼠致富者，槃特比丘是。",
        "translation": "The one who made a fortune with a mouse is the monk Pāṇḍu.",
        "source": "T03n0152_003:0014a18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "調達懷吾六億品經，言順行逆，死入太山地獄。",
        "translation": "Tathāgata harbored six hundred million of our sūtras, spoke well and acted contrary to them, and he died and went to Taishan hell.",
        "source": "T03n0152_003:0014a19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "槃特比丘，懷吾一句，乃致度世。",
        "translation": "The monk Pāṇḍu, he harbored a phrase of mine that would lead to salvation in the world.",
        "source": "T03n0152_003:0014a20_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫有言無行，猶膏以明自賊，斯小人之智也。",
        "translation": "A man who has words but no deeds is like a thief who anoints himself with knowledge, which is the wisdom of a small person.",
        "source": "T03n0152_003:0014a21_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言行相扶，明猶日月，含懷眾生成濟萬物，斯大人之明也。",
        "translation": "When words and actions are mutually supportive, that insight is like the sun and moon, which contain all things and produce them to help all living things, which is the insight of a great man.",
        "source": "T03n0152_003:0014a22_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行者是地，萬物所由生矣。",
        "translation": "This is the ground of practice, and it's the source of creation for all things.",
        "source": "T03n0152_003:0014a23_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩慈惠度無極行布施如是。」",
        "translation": "The bodhisattva's compassionate effort to save without limit is thus generous.\"",
        "source": "T03n0152_003:0014a24_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二三）「昔有獨母為理家賃，守視田園。",
        "translation": "(23) \"Once, there was a mother alone who managed the family's household and looked after the farm.",
        "source": "T03n0152_003:0014a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "主人有徨，餉過食時。",
        "translation": "When the owner had a problem, he gave her more than enough to eat.",
        "source": "T03n0152_003:0014a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時至欲食，沙門從乞。",
        "translation": "When the time came for food, the ascetic complied with the request.",
        "source": "T03n0152_003:0014a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心存斯人，絕欲棄邪厥行清真。",
        "translation": "He kept this person in mind, cutting off desire, abandoning wrongdoing, and practicing innocence.",
        "source": "T03n0152_003:0014a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『濟四海餓人不如少惠淨戒真賢者。』",
        "translation": "'He wouldn't save the hungry of the four seas as well as a truly good man of few wisdoms and pure precepts.'",
        "source": "T03n0152_003:0014a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以所食分盡著鉢中，蓮華一枚著上貢焉！",
        "translation": "Putting all the food he's eaten in his bowl, he pays tribute to one of the lotus flowers!",
        "source": "T03n0152_003:0014a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道人現神足放光明，母喜歎曰：『真所謂神聖者乎！",
        "translation": "The Daoist showed his spiritual feet shining brightly, and his mother rejoiced and exclaimed, 'Truly, this is called a sage!",
        "source": "T03n0152_003:0014b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願我後生百子若茲。』",
        "translation": "May I have a hundred sons like this in my future life.'",
        "source": "T03n0152_003:0014b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母終神遷，應為梵志嗣矣。",
        "translation": "After his mother's death, his spirit moved away, and he was supposed to be Brahmā's heir.",
        "source": "T03n0152_003:0014b03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其靈集梵志小便之處，鹿舐小便即感之生。",
        "translation": "Her spirit gathered at the place where Brahmā's urine was licked by a deer, and he was born.",
        "source": "T03n0152_003:0014b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時滿生女，梵志育焉。",
        "translation": "She then gave birth to a daughter, whom Brahmā raised.",
        "source": "T03n0152_003:0014b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "年有十餘，光儀庠步，守居護火。",
        "translation": "She was about ten years old, had an elegant demeanor, and was guarding the fire.",
        "source": "T03n0152_003:0014b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女與鹿戲，不覺火滅。",
        "translation": "The girl played with a deer and didn't realize the fire was going out.",
        "source": "T03n0152_003:0014b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父還恚之，令行索火。",
        "translation": "Her father was angry with her and ordered her to search for the fire.",
        "source": "T03n0152_003:0014b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女至人聚，一躇步處一蓮華生。",
        "translation": "When she arrived at a gathering of people, a lotus flower appeared at a place where she hadn't taken a step.",
        "source": "T03n0152_003:0014b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "火主曰：『爾遶吾居三匝，以火與爾。』",
        "translation": "The fire lord said, 'Go around my house three times and I'll give you the fire.'",
        "source": "T03n0152_003:0014b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女即順命，華生陸地圍屋三重；行者住足，靡不雅奇。",
        "translation": "The woman then complied, and the lotus grew on land and surrounded her house three times; all the people who walked by it looked at their feet with wonder.",
        "source": "T03n0152_003:0014b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「斯須宣聲聞其國王，王命工相相其貴賤。",
        "translation": "\"The king then ordered the workers to match their worth and lowliness.",
        "source": "T03n0152_003:0014b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師曰：『必有聖嗣，傳祚無窮。』",
        "translation": "The teacher said, 'There will surely be a noble heir, and the lineage will be endless.'",
        "source": "T03n0152_003:0014b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王命賢臣娉迎禮備，容華奕奕，宮人莫如。",
        "translation": "The king ordered his wise ministers to present him with gifts and prostrations, and his appearance was so resplendent that no one in the palace could match it.",
        "source": "T03n0152_003:0014b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "懷妊時滿，生卵百枚。",
        "translation": "When her pregnancy was complete, she gave birth to a hundred eggs.",
        "source": "T03n0152_003:0014b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "后妃逮妾靡不嫉焉，豫刻芭蕉為鬼形像，臨產以髮被覆其面，惡露塗芭蕉，以之示王。",
        "translation": "The queen and concubines were all jealous, so they carved a plantain into the shape of a ghost, covered their faces with a blanket of hair when they were about to give birth, and smeared the plantain with bad dew to show it to the king.",
        "source": "T03n0152_003:0014b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾妖弊明，王惑信矣。",
        "translation": "The demons were so vicious and bright that the king was confused and believed in them.",
        "source": "T03n0152_003:0014b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "群邪以壺盛卵，密覆其口，投江流矣。",
        "translation": "The herd of evildoers filled a pot with eggs, covered their mouths with it, and threw themselves into the river.",
        "source": "T03n0152_003:0014b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「天帝釋下，以印封口，諸天翼衛，順流停止，猶柱植地。",
        "translation": "\"Indra descends, seals it with a seal, and is accompanied by the gods, stopping it in its tracks like a pillar planted on the ground.",
        "source": "T03n0152_003:0014b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下流之國，其王於臺遙覩水中有壺流下，韑輝光耀似有乾靈，取之觀焉。",
        "translation": "In a country downriver, the king of that country sees a pot flowing down from a distant place in the water, and its luster appears to be that of a dry spirit, so he takes it and looks at it.",
        "source": "T03n0152_003:0014b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "覩帝印文，發得百卵，令百婦人懷育溫煖。",
        "translation": "He saw the emperor's seal and obtained a hundred eggs, which he caused a hundred women to nurture and warm.",
        "source": "T03n0152_003:0014b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時滿體成，產為百男。",
        "translation": "When their bodies were full, they gave birth to a hundred boys.",
        "source": "T03n0152_003:0014b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生有上聖之智，不啟而自明，顏景跨世，相好希有，力幹勢援，兼人百倍，言音之響有若師子之吼。",
        "translation": "He was born with the wisdom of a great sage, who understood on his own without being enlightened, had a face and features that transcended the world, had rare features, was a hundred times more powerful and supportive than other people, and had a voice that sounded like the roar of a lion.",
        "source": "T03n0152_003:0014b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即具白象百頭，七寶鞍勒，以供聖嗣，令征隣國；四鄰降伏，咸稱臣妾。",
        "translation": "The king then took a hundred white elephants and a saddle of seven jewels, provided them with a noble heir, and ordered them to conquer the neighboring countries; the four neighbors subjugated them and all called them their vassals.",
        "source": "T03n0152_003:0014b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又伐所生之國，國人巨細靡不悚慄。",
        "translation": "\"He also invaded the country where he was born, and the people of that country, large and small, were terrified.",
        "source": "T03n0152_003:0014b25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『孰有能却斯敵者乎？』",
        "translation": "The king said, 'Is there anyone who can defeat this enemy?'",
        "source": "T03n0152_003:0014b26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫人曰：『大王無懼，視敵所由，攻城何方？",
        "translation": "The lady said, 'The great king has no fear; depending on where the enemy comes from, where will he attack the city?'",
        "source": "T03n0152_003:0014b27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臨之興觀，為王降之。』",
        "translation": "He approached it with an attitude of contemplation, and subdued it for the king.'",
        "source": "T03n0152_003:0014b28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即視敵所由而立觀矣。",
        "translation": "The king then looked at the enemy's cause and set up an observation.",
        "source": "T03n0152_003:0014b29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母登觀，揚聲曰：『夫逆之大，其有三矣。",
        "translation": "When his mother ascended to the observation, she raised her voice and said, 'There are three great heinous crimes.",
        "source": "T03n0152_003:0014b29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不遠群邪招二世咎，斯一也。",
        "translation": "Not being far from the herd brings the blame of the second world, and this is the first.",
        "source": "T03n0152_003:0014c01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生不識親而逆孝行，斯二也。",
        "translation": "To be born without knowing one's relatives and to act contrary to filial piety, this is two.",
        "source": "T03n0152_003:0014c02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恃勢殺親毒向三尊，斯三也。",
        "translation": "To rely on one's power to kill one's relatives and poison the three honored ones, this is the third.",
        "source": "T03n0152_003:0014c03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "懷斯三逆，其惡無蓋。",
        "translation": "Carrying these three heinous crimes in their hearts, their evil knows no bounds.",
        "source": "T03n0152_003:0014c03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾等張口，信現于今。』",
        "translation": "Open your mouths, and faith will appear now.'",
        "source": "T03n0152_003:0014c04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母捉其乳，天令湩射遍百子口。",
        "translation": "When a mother catches her breast, God causes milk to be shot all over her hundred sons' mouths.",
        "source": "T03n0152_003:0014c04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精誠之感，飲乳情哀，僉然俱曰：『斯則吾親。』",
        "translation": "Sincere in their feelings, they all drank the milk with sympathy, saying, 'This is my relative.'",
        "source": "T03n0152_003:0014c05_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泣涕交頸，叉手步進，叩頭悔過。",
        "translation": "Weeping and mourning, they marched forward with folded arms and bowed their heads in repentance.",
        "source": "T03n0152_003:0014c06_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "親嗣始會，靡不哀慟。",
        "translation": "When the relatives and heirs first met, they all mourned.",
        "source": "T03n0152_003:0014c07_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二國和睦，情過伯叔。",
        "translation": "The two countries were brought into harmony, and their feelings were greater than those of an uncle.",
        "source": "T03n0152_003:0014c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "異方欣然靡不稱善。",
        "translation": "They were delighted in other lands, and none of them praised them as good.",
        "source": "T03n0152_003:0014c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸子覩世無常如幻，辭親學道，遠世穢垢。",
        "translation": "\"The sons saw that the world was impermanent and illusory, resigned from their families, trained on the path, and left the defilements of the world behind.",
        "source": "T03n0152_003:0014c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九十九子皆得緣一覺。",
        "translation": "Each of the ninety-nine sons attained the condition of being uniquely enlightened.",
        "source": "T03n0152_003:0014c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一子理國，父王崩，為王。",
        "translation": "One son ruled the country, and his father became king after the king's death.",
        "source": "T03n0152_003:0014c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大赦眾罪，壞牢獄、裂池塞，免奴使，慰孝悌、養孤獨，開帑藏大布施，隨民之願給。",
        "translation": "He granted a great pardon for all sins, broke up prisons and ponds, freed slaves and messengers, comforted filial piety and fraternity, supported orphans, opened public coffers and made great alms, and gave to the people as they wished.",
        "source": "T03n0152_003:0014c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以十善為國法，人人帶誦，家有孝子。",
        "translation": "He made the ten good qualities the law of the land, reciting them for everyone and bringing filial sons into their homes.",
        "source": "T03n0152_003:0014c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "興立塔寺，供養沙門，誦經論道口無四惡，諸毒歇盡，壽命益長。",
        "translation": "They erect stūpas and temples, make offerings to ascetics, recite sūtras and treat the Way with their mouths free of the four evils, end poisons, and prolong their lives.",
        "source": "T03n0152_003:0014c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天帝養護，猶親育子。」",
        "translation": "They are nurtured by Indra, just like a father raising a son.\"",
        "source": "T03n0152_003:0014c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸沙門：「留為王者，吾身是也。",
        "translation": "The Buddha told the ascetics, \"The one who remains king is myself.",
        "source": "T03n0152_003:0014c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父王者，今白淨王是。",
        "translation": "The father king is the present-day King Śubhavyūha.",
        "source": "T03n0152_003:0014c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母者，舍妙是。",
        "translation": "The mother, Śamī, is this.",
        "source": "T03n0152_003:0014c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩慈惠度無極行布施如是。」",
        "translation": "This is how the bodhisattvas compassionately save and infinitely practice generosity.\"",
        "source": "T03n0152_003:0014c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二四）「昔者菩薩，時為梵志，經學明達，國人師焉。",
        "translation": "(24) \"Once upon a time, a bodhisattva was a priest who comprehended the scripture Hok Hoksin, and he was the nation's teacher.",
        "source": "T03n0152_003:0014c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟子五百，皆有儒德，體好布施，猶自護身。",
        "translation": "He had 500 disciples, all of whom had Confucian virtue and were physically adept at generosity, and they still protected themselves.",
        "source": "T03n0152_003:0014c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時世有佛，號啑如來、無所著、正真尊、最正覺，將導三界還神本無。",
        "translation": "Then there was a Buddha, called the Tathāgata, the Arhat, the True Honored One, and the Most True Enlightened One, who would guide the three realms back to their original nonexistence.",
        "source": "T03n0152_003:0014c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩覩佛，欣然自歸，請佛及僧七日留家，以禮供養。",
        "translation": "When the bodhisattva saw the Buddha, he gladly returned, asked the Buddha and the saṃgha to stay at home for seven days, and offered them reverence and support.",
        "source": "T03n0152_003:0014c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵志弟子各諍所主。",
        "translation": "The priest disciples each disputed their leader.",
        "source": "T03n0152_003:0014c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一人年稚師使之行，還請事作。",
        "translation": "One of them was a young master who made him go and asked him to do something.",
        "source": "T03n0152_003:0014c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師曰：『有事無作者，爾攝之焉。』",
        "translation": "The teacher said, 'There's nothing to do, so you should collect them.'",
        "source": "T03n0152_003:0014c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子對曰：『唯燈無主者也。』",
        "translation": "The boy replied, 'Only the lamp has no owner.'",
        "source": "T03n0152_003:0014c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師曰：『善哉。』",
        "translation": "The teacher said, 'Good.'",
        "source": "T03n0152_003:0014c26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟子以[土*瓦]盛麻油膏，淨自洗浴，白[疊*毛]纏頭，自手然之。",
        "translation": "The disciple filled a [earthenware*tile] with hemp-seed oil and grease, washed himself clean, wrapped a white [tuft*hair] around his head, and put it in his hand.",
        "source": "T03n0152_003:0014c27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「天人龍鬼覩其猛力，靡不拊手驚愕，而歎：『世未曾有，斯必為佛矣。』",
        "translation": "\"When the gods, humans, dragons, and ghosts saw his fierce strength, they all clapped their hands in amazement and exclaimed, 'Never has there been anything like this in the world; this must be the Buddha.'",
        "source": "T03n0152_003:0014c28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛嘉之焉，令明徹夜而頭不損，心定在經霍然無想，七日若茲都無懈惓念矣。",
        "translation": "The Buddha commended him for it, making it possible to penetrate the night without losing his head, to concentrate his mind in the sūtras without thought, and to go without lazy thoughts for seven days or so.",
        "source": "T03n0152_003:0015a01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛則授決：『却無數劫汝當為佛，號曰錠光。",
        "translation": "The Buddha then gave him the decision, 'It won't be many eons before you'll become a Buddha, and you'll be called Dīpaṃkara.",
        "source": "T03n0152_003:0015a03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "項中肩上各有光明，教授拯濟，眾生獲度其為無量。』",
        "translation": "There'll be a light on each shoulder in your head that teaches salvation, and there'll be measureless sentient beings saved by it.'",
        "source": "T03n0152_003:0015a04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天人鬼龍，聞當為佛，靡不嘉豫稽首拜賀。",
        "translation": "When the gods, humans, ghosts, and dragons heard that they would become buddhas, they all rejoiced and bowed their heads in congratulations.",
        "source": "T03n0152_003:0015a05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「梵志念曰：『彼其得佛，吾必得也，須當受決。』",
        "translation": "\"The priests thought, 'If they've attained Buddhahood, I surely will attain it, and I must accept the decision.'",
        "source": "T03n0152_003:0015a06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而佛去焉。",
        "translation": "The Buddha then departed.",
        "source": "T03n0152_003:0015a07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前稽首曰：『今設微供誠吾盡心，願授吾決。』",
        "translation": "He bowed his head and said, 'Now, I've made a modest offering to sincere my whole heart, and I wish to be given the decision.'",
        "source": "T03n0152_003:0015a07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告梵志：『童子作佛之時，當授爾決。』",
        "translation": "The Buddha told the priest, 'When the boy becomes a buddha, he'll give you the decision.'",
        "source": "T03n0152_003:0015a08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵志聞當得佛，喜忘有身，自斯之後，遂大布施，飢食寒衣，病給醫藥，蜎飛蚑行蠕動之類，隨其所食以時濟之。",
        "translation": "When the priest heard that he would become a buddha, he was delighted to forget about having a body, and since then he has made great almsgiving, feeding people with cold clothing when they're hungry, giving medicines when they're sick, and helping every creature that flies, crawls, and wriggles according to what they eat.",
        "source": "T03n0152_003:0015a09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八方諸國，稱為仁父也。」",
        "translation": "Those in the eight lands are called \"benevolent fathers.\"",
        "source": "T03n0152_003:0015a12_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告舍利弗：「童子者，錠光佛是。",
        "translation": "The Buddha told Śāriputra, \"The boy is Dīpaṃkara Buddha.",
        "source": "T03n0152_003:0015a13_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵志者，吾身是也。",
        "translation": "The priest is myself.",
        "source": "T03n0152_003:0015a13_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩慈惠度無極行布施如是。」",
        "translation": "This is how bodhisattvas compassionately save and infinitely practice generosity.\"",
        "source": "T03n0152_003:0015a14_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二五）「昔者菩薩，為大理家，積財巨億，常奉三尊，慈向眾生。",
        "translation": "(25) \"Once, a bodhisattva, a great administrator, amassed a fortune of hundreds of millions of dollars, always paid homage to the three honored ones, and showed compassion to sentient beings.",
        "source": "T03n0152_003:0015a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀市覩鼈，心悼之焉，問價貴賤。",
        "translation": "When he saw a turtle in the market, he was sorry to hear about it and asked about its price.",
        "source": "T03n0152_003:0015a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼈主知菩薩有普慈之德、尚濟眾生，財富難數，貴賤無違，答曰：『百萬，能取者善，不者吾當烹之。』",
        "translation": "The owner of the turtle knew that the bodhisattva had the virtue of universal compassion and had yet to help sentient beings, that his wealth was incalculable, and that there was no difference between high and low.",
        "source": "T03n0152_003:0015a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩答曰：『大善！』",
        "translation": "The bodhisattva replied, 'Very good!'",
        "source": "T03n0152_003:0015a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即雇如直，持鼈歸家，澡護其傷，臨水放之。",
        "translation": "He hired Ru Zhi, took the turtle home, bathed it, protected its wounds, and released it near the water.",
        "source": "T03n0152_003:0015a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "覩其遊去，悲喜誓曰：『太山餓鬼眾生之類，世主牢獄早獲免難，身安命全如爾今也。』",
        "translation": "Seeing him wander away, he was overcome with compassion and joy and vowed, 'Those hungry ghosts and sentient beings on Mount Tai who have been imprisoned by the lord of the world will soon be spared suffering and will have their bodies made safe and their lives fully preserved as they are today.'",
        "source": "T03n0152_003:0015a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "稽首十方，叉手願曰：『眾生擾擾，其苦無量，吾當為天為地，為旱作潤，為漂作筏，飢食渴漿，寒衣熱涼，為病作醫，為冥作光；若有濁世顛倒之時，吾當於中作佛度彼眾生矣。』",
        "translation": "He looked up in the ten directions and saluted with his palms together, vowing, 'Since sentient beings are troubled and their suffering is innumerable, I will create gods and lands, make droughts and rafts, feed the hungry and thirsty, make cold clothing hot and cool, heal the sick, and create light in the dark; if there's a time of turbidity and confusion, I will become a buddha in the midst of it and save the sentient beings.'",
        "source": "T03n0152_003:0015a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方諸佛皆善其誓，讚曰：『善哉！",
        "translation": "The buddhas of the ten directions all approved of his vow and praised him, saying, 'Good!",
        "source": "T03n0152_003:0015a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "必獲爾志。』",
        "translation": "I'm sure you'll get your wish.'",
        "source": "T03n0152_003:0015a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「鼈後夜來齕其門，怪門有聲，使出覩鼈，還如事云。",
        "translation": "\"The turtle then came to attack his door at night, making a strange noise at the door, and asked him to come out and see the turtle, but he returned as before.",
        "source": "T03n0152_003:0015a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩視之，鼈人語曰：『吾受重潤，身體獲全，無以答潤。",
        "translation": "When the bodhisattva looked at him, the turtle said, 'I've been heavily moistened, and my body is whole; there's no way to answer the moistening.",
        "source": "T03n0152_003:0015b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蟲水居物知水盈虛，洪水將至必為巨害矣。",
        "translation": "Bugs and creatures that live in water know that the water is full and empty, and a flood is coming that will surely cause great harm.",
        "source": "T03n0152_003:0015b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願速嚴舟，臨時相迎。』",
        "translation": "Please quickly rigidify your boat and meet us there temporarily.'",
        "source": "T03n0152_003:0015b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『大善！』",
        "translation": "He replied, 'Very good!'",
        "source": "T03n0152_003:0015b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明晨詣門，如事啟王。",
        "translation": "In the morning, he went to the gate and instructed the king as he had done.",
        "source": "T03n0152_003:0015b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王以菩薩宿有善名，信用其言：『遷下處高。』",
        "translation": "The king, thinking that the bodhisattva had a long-standing reputation for goodness, credited him with saying, 'Move down to a higher place.'",
        "source": "T03n0152_003:0015b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時至鼈來曰：『洪水至，可速下載，尋吾所之，可獲無患。』",
        "translation": "When he arrived, he was told by a turtle, 'A flood is coming, so you can quickly download it and find it in my place so you won't be in trouble.'",
        "source": "T03n0152_003:0015b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "船尋其後，有蛇趣船，菩薩曰：『取之。』",
        "translation": "When the boat looked behind it, a snake went to the boat, and the bodhisattva said, 'Take it.'",
        "source": "T03n0152_003:0015b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼈云：『大善！』",
        "translation": "The turtle said, 'That's very good!'",
        "source": "T03n0152_003:0015b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又覩漂狐，曰：『取之。』",
        "translation": "He also saw a fox floating in the water and said, 'Take it.'",
        "source": "T03n0152_003:0015b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼈亦云：『善。』",
        "translation": "The turtle also said, 'Good.'",
        "source": "T03n0152_003:0015b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又覩漂人搏頰呼天，哀濟吾命，曰：『取之。』",
        "translation": "He also saw a floating man beating his cheeks and calling out to heaven, lamenting his relief for our lives, and said, 'Take it.'",
        "source": "T03n0152_003:0015b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼈曰：『慎無取也，凡人心偽，尠有終信，背恩追勢，好為兇逆。』",
        "translation": "The turtle said, 'Be careful not to take it; ordinary people are hypocritical in their minds, and there's always faith in them; they turn their backs on kindness and follow influence, and they tend to be fierce and rebellious.'",
        "source": "T03n0152_003:0015b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩曰：『蟲類爾濟，人類吾賤，豈是仁哉？",
        "translation": "The bodhisattva said, 'Is it kind to rescue an insect and to humble us?'",
        "source": "T03n0152_003:0015b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾不忍也。』",
        "translation": "I won't tolerate it.'",
        "source": "T03n0152_003:0015b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是取之。",
        "translation": "So he took it.",
        "source": "T03n0152_003:0015b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼈曰：『悔哉！』",
        "translation": "The turtle said, 'What a pity!'",
        "source": "T03n0152_003:0015b13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂之豐土。",
        "translation": "He then returned to the rich land.",
        "source": "T03n0152_003:0015b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼈辭曰：『恩畢請退。』",
        "translation": "He replied, 'After your grace, please retire.'",
        "source": "T03n0152_003:0015b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『吾獲如來、無所著、至真、正覺者，必當相度。』",
        "translation": "He replied, 'I have attained the Tathāgata, Arhat, and the Most True and Perfectly Enlightened One, and I will surely save him.'",
        "source": "T03n0152_003:0015b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼈曰：『大善！』",
        "translation": "The turtle said, 'Very good!'",
        "source": "T03n0152_003:0015b16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼈退，蛇狐各去。",
        "translation": "The turtle retreated, and the snakes and foxes each left.",
        "source": "T03n0152_003:0015b16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「狐以穴為居，獲古人伏藏紫磨名金百斤，喜曰：『當以報彼恩矣。』",
        "translation": "\"The fox takes refuge in a cave and obtains a hundred catties of the ancient man's purple polish and gold, and he rejoices, saying, 'This will be a reward for their kindness.'",
        "source": "T03n0152_003:0015b16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "馳還曰：『小蟲受潤，獲濟微命。",
        "translation": "He chased them back, saying, 'A small bug that's nourished will be able to save a tiny life.",
        "source": "T03n0152_003:0015b18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蟲穴居之物，求穴以自安，獲金百斤，斯穴非塚非家非劫非盜。",
        "translation": "A thing that lives in a worm's cave seeks a cave for its own safety, and it obtains a hundred catties of gold; this cave is not a tomb, not a home, not a robbery, and not a theft.",
        "source": "T03n0152_003:0015b19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾精誠之所致，願以貢賢。』",
        "translation": "It's the result of my sincerity, and I want to pay tribute to you, sir.'",
        "source": "T03n0152_003:0015b20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩深惟：『不取徒捐，無益於貧民；取以布施，眾生獲濟，不亦善乎！』",
        "translation": "The bodhisattva thinks deeply, 'Wouldn't it be good not to take a donation that doesn't benefit the poor and give it as alms and have sentient beings be saved?'",
        "source": "T03n0152_003:0015b21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尋而取之。",
        "translation": "He looked into it and took it.",
        "source": "T03n0152_003:0015b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漂人覩焉，曰：『分吾半矣。』",
        "translation": "The floating man looked at him and said, 'I've got half of it.'",
        "source": "T03n0152_003:0015b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩即以十斤惠之。",
        "translation": "The bodhisattva then gave him ten pounds.",
        "source": "T03n0152_003:0015b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漂人曰：『爾掘塚劫金，罪福應柰何？",
        "translation": "The adrift man said, 'What's the crime and merit of digging up a tomb and robbing the gold?'",
        "source": "T03n0152_003:0015b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不半分之，吾必告有司。』",
        "translation": "If I don't give them half, I'll tell the authorities.'",
        "source": "T03n0152_003:0015b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『貧民困乏，吾欲等施；爾欲專之，不亦偏乎？』",
        "translation": "He replied, 'I want to give equally to the poor and needy, but you want to devote it to them, don't you also want to be partial?'",
        "source": "T03n0152_003:0015b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漂人遂告有司，菩薩見拘，無所告訴，唯歸命三尊，悔過自責，慈願：『眾生早離八難，莫有怨結如吾今也。』",
        "translation": "The floating man then informed the authorities, and when the bodhisattva saw and took custody of him, he had nothing to tell them but to give his life to the three honored ones, repenting of his faults and vowing compassionately, 'Let's free sentient beings from the eight difficulties early, and let's not have any more grudges like mine today.'",
        "source": "T03n0152_003:0015b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「蛇狐會曰：『奈斯事何？』",
        "translation": "\"The snakes and foxes then said, 'What's the matter with that?'",
        "source": "T03n0152_003:0015b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蛇曰：『吾將濟之。』",
        "translation": "The snake said, 'I will help him.'",
        "source": "T03n0152_003:0015c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂銜良藥開關入獄。",
        "translation": "It then took the good medicine and escaped into prison.",
        "source": "T03n0152_003:0015c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見菩薩狀，顏色有損，愴而心悲，謂菩薩言：『以藥自隨，吾將齚太子，其毒尤甚，莫能濟者。",
        "translation": "Seeing the bodhisattva's appearance and the damage to his color, he was pained and sympathetic, and said to the bodhisattva, 'Follow this with medicine, and I'll rob the prince of his calf, which is even more venomous; there's no one who can help him.",
        "source": "T03n0152_003:0015c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢者以藥自聞，傅則愈矣。』",
        "translation": "Good man, hear for yourself with this medicine, and you'll be healed.'",
        "source": "T03n0152_003:0015c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩默然。",
        "translation": "The bodhisattva was silent.",
        "source": "T03n0152_003:0015c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蛇如所云，太子命將殞，王令曰：『有能濟茲，封之相國，吾與參治。』",
        "translation": "The snake did as he said, and the prince's life was about to die. The king ordered him, 'If you can help him, appoint him to the ministerial position, and I'll help him heal it.'",
        "source": "T03n0152_003:0015c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩上聞，傅之即愈。",
        "translation": "The bodhisattva went up to hear about it, gave it a hand, and he was healed.",
        "source": "T03n0152_003:0015c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王喜問所由，囚人本末自陳。",
        "translation": "The king was pleased when he asked what the cause was, and the prisoner explained the whole story.",
        "source": "T03n0152_003:0015c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王悵然自咎曰：『吾闇甚哉！』",
        "translation": "The king took pity on himself and said, 'I was so dark!'",
        "source": "T03n0152_003:0015c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即誅漂人，大赦其國，封為國相，執手入宮，並坐而曰：『賢者說何書？",
        "translation": "He summarily condemned the adrift man, pardoned his country, made him prime minister, entered the palace with his hand, and sat down saying, 'Good man, what did you write?'",
        "source": "T03n0152_003:0015c08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "懷何道？",
        "translation": "What path does it carry?",
        "source": "T03n0152_003:0015c10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而為二儀之仁，惠逮眾生乎？』",
        "translation": "What about the two kinds of kindness that are bestowed on sentient beings?'",
        "source": "T03n0152_003:0015c10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『說佛經，懷佛道也。』",
        "translation": "He said, 'He teaches the sutras of the Buddha and carries the Buddha's way with him.'",
        "source": "T03n0152_003:0015c11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『佛有要決？』",
        "translation": "The king said, 'Does the Buddha have an essential teaching?'",
        "source": "T03n0152_003:0015c11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『有之。",
        "translation": "He said, 'There are.",
        "source": "T03n0152_003:0015c12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說四非常，在之者，眾禍殄，景祐昌。』",
        "translation": "The Buddha teaches four extraordinary things, and those who are there will have their woes ended and their prosperity greatly enhanced.'",
        "source": "T03n0152_003:0015c12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『善哉！",
        "translation": "The king said, 'Good!",
        "source": "T03n0152_003:0015c13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願獲其實。』",
        "translation": "May it be true.'",
        "source": "T03n0152_003:0015c13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『乾坤終訖之時，七日竝列巨海都索，天地烔然，須彌崩壞，天人鬼龍、眾生身命，霍然燋盡。",
        "translation": "He said, 'When Qian and Kun reach their final end, the seven seasons line up together in a giant ocean, heaven and earth are heated, Sumeru crumbles, and the bodies and lives of gods, humans, ghosts, and dragons, as well as sentient beings, are suddenly scorched to death.",
        "source": "T03n0152_003:0015c14_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前盛今衰，所謂非常矣。",
        "translation": "The former flourishes and the present declines, which is called extraordinary.",
        "source": "T03n0152_003:0015c16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明士守無常之念，曰天地尚然，官爵國土，焉得久存？",
        "translation": "A learned man observes the idea of impermanence, saying, 'Heaven and earth are still here, but how can an official state survive for long?'",
        "source": "T03n0152_003:0015c16_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得斯念者，乃有普慈之志矣。』",
        "translation": "Attaining this mindfulness, you'll have the intention to be universally compassionate.'",
        "source": "T03n0152_003:0015c18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『天地尚然，豈況國土？",
        "translation": "The king said, 'How could a land be like this when heaven and earth are still like this?'",
        "source": "T03n0152_003:0015c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說非常，我心信哉。』",
        "translation": "The Buddha's teaching is extraordinary, and I believe it in my heart.'",
        "source": "T03n0152_003:0015c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「理家又曰：『苦之尤苦者，王宜知之。』",
        "translation": "\"The philosophers also said, 'It's better for the king to know what's especially painful.'",
        "source": "T03n0152_003:0015c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『願聞明誡。』",
        "translation": "The king said, 'May I hear the clear admonition.'",
        "source": "T03n0152_003:0015c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『眾生識靈微妙難知，視之無形，聽之無聲，弘也天下，高也無蓋，汪洋無表，輪轉無際。",
        "translation": "He said, 'The spirit of consciousness in sentient beings is so subtle and difficult to know that it has no shape when viewed, no sound when heard, a vast world, a high one with no lid, an ocean with no surface, and a limitless rotation.",
        "source": "T03n0152_003:0015c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然飢渴于六欲，猶海不足于眾流，以斯數更太山燒煮諸毒眾苦；或為餓鬼，洋銅沃口役作太山；或為畜生，屠割剝裂，死輙更刃，苦痛無量。",
        "translation": "Still, hunger and thirst for the six desires are like the ocean being insufficient for many currents, and they are burned and boiled by these numerous poisons and sufferings; sometimes they become hungry ghosts, and their mouths are filled with copper, which makes them become mountains; sometimes they become animals, which are slaughtered, cut, and torn apart, and they are re-bladed at death, causing incalculable pain.",
        "source": "T03n0152_003:0015c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若獲為人，處胎十月，臨生急笮，猶索絞身，墮地之痛猶高隕下，為風所吹若火燒己，溫湯洗之甚沸銅自沃，手葌摩身猶刃自剝，如斯諸痛甚苦難陳。",
        "translation": "If a person is born in the tenth month of pregnancy and is about to be rushed into labor, they're like being strung up by a rope, the pain of falling to the ground is like being caught high and falling down, being blown by a wind like a fire that burns you, being washed in warm water that boils copper to wet yourself, and being rubbed with your hand or body like a blade that strips itself, so the pains are too great to describe.",
        "source": "T03n0152_003:0015c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "年長之後，諸根竝熟，首白齒隕，內外虛耗，存之心悲，轉成重病，四大欲離，節節皆痛，坐臥須人，醫來加惱。",
        "translation": "When they grow older, their faculties mature together, their heads whiten and their teeth fall out, and they are depleted internally and externally, so their mind becomes seriously ill, the four major desires part, and every section hurts, requiring someone to sit and lay down, and doctors come to inflict pain.",
        "source": "T03n0152_003:0016a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命將欲終，諸風竝興，截筋碎骨，孔竅都塞。",
        "translation": "When his life is about to end, the winds arise, cutting off tendons and bones, and blocking all orifices.",
        "source": "T03n0152_003:0016a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "息絕神逝，尋行所之。",
        "translation": "Their breath stops and their spirit passes away, and they search for a place to practice.",
        "source": "T03n0152_003:0016a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若其昇天，天亦有貧富貴賤，延算之壽，福盡罪來，下入太山、餓鬼、畜生，斯謂之苦。』",
        "translation": "If they ascend to heaven, the gods will also have the rich and poor, the noble and poor, and the life expectancy will be extended.",
        "source": "T03n0152_003:0016a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『善哉！",
        "translation": "The king said, 'Good!",
        "source": "T03n0152_003:0016a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說苦要，我心信哉！』",
        "translation": "I believe in what the Buddha said about the essentials of suffering!'",
        "source": "T03n0152_003:0016a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「理家又曰：『夫有必空，猶若兩木相鑽生火，火還燒木，火木俱盡，二事皆空。",
        "translation": "\"The philosophers also say, 'Existence must be empty, just as when two pieces of wood are drilled together to make fire and the fire returns to burn the wood, and when both the fire and the wood are exhausted, both things are empty.",
        "source": "T03n0152_003:0016a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往古先王宮殿臣民，今者磨滅不覩所之，斯亦空也。』",
        "translation": "In the past, the palace of our predecessors was filled with subjects, but now they've been ground down and don't see them, so they're also empty.'",
        "source": "T03n0152_003:0016a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『善哉！",
        "translation": "The king said, 'Good!",
        "source": "T03n0152_003:0016a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說空要，我心信哉！』",
        "translation": "The Buddha taught the essentials of emptiness, and I believe it!'",
        "source": "T03n0152_003:0016a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「理家又曰：『夫身地水火風矣，強為地，軟為水，熱為火，息為風。",
        "translation": "\"Doctrinaires also say, 'The body is earth, water, fire, and wind, and its strength is earth, its softness is water, its heat is fire, and its calmness is wind.",
        "source": "T03n0152_003:0016a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命盡神去，四大各離，無能保全，故云非身矣。』",
        "translation": "When their lives are exhausted and their spirits departed, the four elements each part, and there's no way to preserve them, so it's called not the body.'",
        "source": "T03n0152_003:0016a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『善哉！",
        "translation": "The king said, 'Good!",
        "source": "T03n0152_003:0016a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說非身，吾心信哉！",
        "translation": "The Buddha says it's not the body, but my heart believes it!",
        "source": "T03n0152_003:0016a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身且不保，豈況國土乎？",
        "translation": "Even if one's body cannot be preserved, how could one expect a country to be?",
        "source": "T03n0152_003:0016a15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "痛夫我先王，不聞無上正真、最正覺非常苦空非身之教矣。』",
        "translation": "I'm sorry that our late king didn't hear that the unsurpassed true and most correct awakening is the teaching that suffering, emptiness, and non-bodies are not real.'",
        "source": "T03n0152_003:0016a16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「理家曰：『天地無常，誰能保國者乎？",
        "translation": "\"Doctrinarians say, 'Who can protect the country when heaven and earth are impermanent?'",
        "source": "T03n0152_003:0016a17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "胡不空藏，布施貧飢之人乎？』",
        "translation": "Why isn't it an empty store, giving to the poor and hungry?'",
        "source": "T03n0152_003:0016a18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『善哉！",
        "translation": "The king said, 'Good!",
        "source": "T03n0152_003:0016a19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明師之教快哉！』",
        "translation": "What a joy it is to have a clear teacher!'",
        "source": "T03n0152_003:0016a19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即空諸藏而布施貧乏，鰥寡孤兒令之為親為子，民服炫煌，貧富齊同，舉國欣欣，含笑且行，仰天歎曰：『菩薩神化乃至於茲乎？』",
        "translation": "He then emptied the stores and gave to the poor, made widows, widowers, orphans, and children into his family, dazzled the people with their clothing, equalized wealth, and made the nation rejoice, smiling and walking, and looked up to heaven and praised, 'Has the bodhisattva's miraculous transformation reached this point?'",
        "source": "T03n0152_003:0016a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四方歎德，遂致太平。」",
        "translation": "The four directions praised their virtue, and peace was brought about.\"",
        "source": "T03n0152_003:0016a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸沙門：「理家者，是吾身也。",
        "translation": "The Buddha told the ascetics, \"This is my body, the house of principle.",
        "source": "T03n0152_003:0016a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國王者，彌勒是。",
        "translation": "The king is Maitreya.",
        "source": "T03n0152_003:0016a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼈者，阿難是。",
        "translation": "The turtle is Ānanda.",
        "source": "T03n0152_003:0016a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "狐者，鶖鷺子是。",
        "translation": "The fox is Śāriputra.",
        "source": "T03n0152_003:0016a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蛇者，目連是。",
        "translation": "The snake, that's Maudgalyāyana.",
        "source": "T03n0152_003:0016a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漂人者，調達是。",
        "translation": "\"The floating man, this is Tathāgata.",
        "source": "T03n0152_003:0016a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩慈惠度無極行布施如是。」",
        "translation": "This is how a bodhisattva compassionately and unexcelledly practices generosity.\"",
        "source": "T03n0152_003:0016a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二六）「昔者菩薩為沙門行，恒處山林，慈心悲愍，眾生長苦輪轉三界，何以濟之？",
        "translation": "(26) \"In the past, the bodhisattvas practiced as ascetics, stayed in the mountains and forests, and had compassionate hearts and pity for the suffering of sentient beings as they transited the three realms.",
        "source": "T03n0152_003:0016a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "靖心思惟，索道弘原，當以拯眾。",
        "translation": "Jing Xin thinks, \"Seeking the great origin of the Way, we should save all people.",
        "source": "T03n0152_003:0016a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而衣有虱，身痒心擾，道志不立，手探尋之即獲虱矣。",
        "translation": "However, his clothes were covered with lice, and his body itched and his mind was disturbed, so his will to achieve the Way was not established.",
        "source": "T03n0152_003:0016b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中心愴然，求以安之。",
        "translation": "He was distressed and sought to lay it to rest.",
        "source": "T03n0152_003:0016b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正有獸骨，徐以置中矣。",
        "translation": "He found an animal bone and put it in his hand.",
        "source": "T03n0152_003:0016b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虱得七日之食，盡乃捨邁。",
        "translation": "The louse gets seven days' worth of food, and then he ends up abandoning it.",
        "source": "T03n0152_003:0016b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "展轉生死，菩薩得佛，經緯教化。」",
        "translation": "They were reborn and died, and the bodhisattva became a buddha, taught by scripture and tradition.\"",
        "source": "T03n0152_003:0016b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天大雪絕行路人，國有理家請佛并數千比丘，供養七日。",
        "translation": "When the sky was snowed out and travelers were cut off, a philosopher in that country invited the Buddha and several thousand monks to make offerings for seven days.",
        "source": "T03n0152_003:0016b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "厥心肅穆，宗室僉然，而雪未晞。",
        "translation": "Their hearts were solemn, and the entire clan was present, but the snow hadn't yet fallen.",
        "source": "T03n0152_003:0016b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「勅諸沙門皆還精舍。」",
        "translation": "The Buddha told Ānanda, \"I'm ordering all the monks to return to the monastery.\"",
        "source": "T03n0152_003:0016b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難言：「主人恭肅，厥心未墮，雪盛未息，分衛無處。」",
        "translation": "Ānanda said, \"The master is respectful, his mind hasn't fallen, the snow is still fresh, and there's no place for a partisan.\"",
        "source": "T03n0152_003:0016b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊曰：「主人意訖，不復供惠也。」",
        "translation": "The Bhagavān said, \"The master's intention has been fulfilled, so he won't offer his blessings again.\"",
        "source": "T03n0152_003:0016b09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即引邁，沙門翼從還于精舍。",
        "translation": "The Buddha then led them away, and the monks and their followers returned to the monastery.",
        "source": "T03n0152_003:0016b10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明日世尊告阿難：「汝從主人分衛。」",
        "translation": "On the next day, the Bhagavān addressed Ānanda, \"Obey your master's order to guard the monastery.\"",
        "source": "T03n0152_003:0016b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難奉教而行，造主人門。",
        "translation": "Ānanda did as he was taught and went to the master's entrance.",
        "source": "T03n0152_003:0016b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "門人覩之，無問其所以也。",
        "translation": "When the disciples saw him, they didn't ask him why.",
        "source": "T03n0152_003:0016b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有頃迴還，稽首長跪，如事啟焉。",
        "translation": "A while later, he returned, bowed his head, and knelt down long enough to reveal the situation as it had been.",
        "source": "T03n0152_003:0016b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又質其原，「彼意無恒，何其疾乎？」",
        "translation": "He also questioned him about the origin, \"Why is he so quick when his mind is not constant?\"",
        "source": "T03n0152_003:0016b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即為具說如上。",
        "translation": "The Buddha then explained it in detail as above.",
        "source": "T03n0152_003:0016b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰：「阿難！",
        "translation": "He also said, \"Ānanda!",
        "source": "T03n0152_003:0016b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾以慈心濟虱微命，惠之朽骨七日之食，今獲供養盡世上獻。",
        "translation": "With kindness, I saved the life of a louse for seven days by giving food to its rotting bones, and now I've been offered offerings to the whole world.",
        "source": "T03n0152_003:0016b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宿命施恩，恩齊七日，故其意止，不復如前也，豈況慈心向佛逮沙門眾？",
        "translation": "Since I had given kindnesses in a previous life, my kindnesses were equal for seven days, so my intention stopped and I'm no longer like the previous ones, so how could I with a compassionate heart arrest a group of ascetics from the Buddha?",
        "source": "T03n0152_003:0016b16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持戒清淨無欲高行，內端己心，表以慈化，恭惠高行比丘一人，踰施凡庶累劫盡情也。",
        "translation": "Maintaining precepts and purifying high conduct without desire, they define their own mind internally, show kindness, and respect and honor one person who is a high-conduct monk, which surpasses giving to ordinary people and extinguishes sentient beings throughout the eons.",
        "source": "T03n0152_003:0016b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is that?",
        "source": "T03n0152_003:0016b20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘擁懷佛經，有戒、有定、有慧、解脫、度知見種，以斯五德慈導眾生，令遠三界萬苦之禍矣。」",
        "translation": "A monk who embraces the Buddha's sūtras and possesses the seeds of morality, concentration, wisdom, liberation, and the knowledge and vision to save sentient beings from the miseries of the three realms with these five virtues will be able to do so.\"",
        "source": "T03n0152_003:0016b20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難曰：「遇哉斯理家！",
        "translation": "Ānanda said, \"How wonderful to encounter this philosopher!",
        "source": "T03n0152_003:0016b23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "面獲慈養如來、無所著、正真道、最正覺、道法御、天人師，并諸沙門，或有溝港、頻來、不還、應真，或有開士，建大弘慈將導眾生者乎！",
        "translation": "\"Have you received from the Tathāgata Maitreya, the Arhat, the True Path, the Most Righteous Enlightenment, the Way, the Dharma, and the Teachers of Gods and Men, or from some monk who has communicated with, come from, returned to, or answered the truth, or from some enlightened man who has established a great compassionate plan to guide sentient beings?",
        "source": "T03n0152_003:0016b23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯福難量，其若海矣；難稱，其猶地也。」",
        "translation": "This merit is difficult to measure; it's like an ocean; it's difficult to name, and it's like the ground.\"",
        "source": "T03n0152_003:0016b26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉！",
        "translation": "The Buddha said, \"Good!",
        "source": "T03n0152_003:0016b27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T03n0152_003:0016b27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如所云。",
        "translation": "It's true as they say.",
        "source": "T03n0152_003:0016b27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛時難遇，經法難聞，比丘僧難得供養，如漚曇華時一有耳。」",
        "translation": "It's difficult to meet the Buddha, difficult to hear the sūtras and teachings, and difficult for monks and nuns to make offerings, just like the once-in-a-lifetime Udraka flower.\"",
        "source": "T03n0152_003:0016b28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說如是，比丘歡喜，稽首承行。",
        "translation": "When the Buddha spoke thus, the monks rejoiced, bowed their heads, and accepted his offerings.",
        "source": "T03n0152_003:0016b29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩慈惠度無極行布施如是。",
        "translation": "The bodhisattva's compassionate effort to save without limit is thus generous.",
        "source": "T03n0152_003:0016c01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六度集經卷第三",
        "translation": "Sutra on the Collection of the Six Perfections, Volume 3",
        "source": "T03n0152_003:0016c03_0",
        "is_bad_quality": false
    }
]