[
    {
        "source_sentence": "佛說頂生王因緣經卷第四",
        "translation": "Foshuo dingshengwang yinnian jing, roll 4",
        "source": "T03n0165_004:0400b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天譯經三藏朝奉大夫試光祿卿傳",
        "translation": "Xitian Translation of the Tripiṭaka, Chaofeng Dafu, Xu Guanluqing's Biography",
        "source": "T03n0165_004:0400b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法大師賜紫沙門臣施護等奉　詔譯",
        "translation": "The Great Master Dharma bestowed upon the purple monks, ministers Shi Hao and others, in accordance with the imperial edict, to translate this scripture.",
        "source": "T03n0165_004:0400b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，麤堅園南二十由旬有麤堅地，縱廣正等二百五十由旬，周匝千由旬，有百一種采繪嚴飾清淨柔軟；其地中間有四寶臺間錯莊嚴，天曼陀羅華散布其地；道路長二十由旬，闊半由旬，清淨嚴飾，華果、樹林、衣服、音樂、莊嚴等樹一一具足；亦有輿輦，隨思即至受諸快樂。",
        "translation": "\"Furthermore, 20 leagues south of Gandhāra Park there's Gandhāra Ground, which measures exactly 250 leagues in width and a thousand leagues in circumference and has a hundred different kinds of decorations that are pure and flexible; in the middle of that ground there are four jeweled platforms interspersed with adornments, and divine maṇḍala flowers scattered about the ground; the pathway is 20 leagues long and half a league wide, which is decorated with pure adornments, and it's supplied with flowers, fruit, trees, clothing, music, adornments, and other trees; there's also a pavilion, so you can reach it at a moment's notice and experience various pleasures.",
        "source": "T03n0165_004:0400b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有天仙修習梵行。",
        "translation": "There are celestials there who are cultivating the religious practice.",
        "source": "T03n0165_004:0400b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善見！",
        "translation": "\"Furthermore, good-looking!",
        "source": "T03n0165_004:0400b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城西二十由旬，有園名雜種，縱廣正等二百五十由旬，周匝千由旬，內外嚴麗殊妙可觀；園有金牆高一由旬；金牆之上有四女牆，金、銀、瑠璃、頗胝迦成；復有重牆通往來道亦四寶作。",
        "translation": "Twenty leagues west of the city, there's a park called Assorted Species, which measures exactly 250 leagues in width and a thousand leagues in circumference, and is beautiful and marvelous to behold inside and out.",
        "source": "T03n0165_004:0400b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其園中地有百一種采繪嚴飾，又復柔軟如兜羅緜及如妙[疊*毛]，下足隨陷舉足隨起。",
        "translation": "The ground in the garden is decorated with a hundred different kinds of paint, and it's as soft as a tulip and as fine as [a tuft of *hair], with its lower feet sinking in and its upper feet rising up.",
        "source": "T03n0165_004:0400c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有天曼陀羅華散布其地深可膝量，香風時來吹去萎華更雨新者。",
        "translation": "There are celestial maṇḍala flowers scattered about the ground that are knee-deep and whose fragrant breezes blow away the withered flowers and rain down new ones.",
        "source": "T03n0165_004:0400c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「雜種園中有大池沼，縱廣正等五十由旬，周匝二百由旬，金、銀、瑠璃、頗胝迦等以布其底；池之四面有四梯陛，金、銀、瑠璃、頗胝迦成；彼池沼中有四寶臺，金、銀、瑠璃、頗胝迦等間錯莊嚴，若金為臺即銀為柱及以梁棟，若銀為臺即金為柱及以梁棟，若瑠璃為臺即頗胝迦為柱及以梁棟，若頗胝迦為臺即瑠璃為柱及以梁棟；清涼甘美水滿池中；優鉢羅華、鉢訥摩華、俱母陀華、奔拏利迦華等，遍覆其內；復有種種水鳥遊戲池中，出妙音聲，謂高遠聲、悅意聲、美妙聲等。",
        "translation": "「雜種園中有大池沼，縱廣正等五十由旬，周匝二百由旬，金、銀、瑠璃、頗胝迦等以布其底；池之四面有四梯陛，金、銀、瑠璃、頗胝迦成；彼池沼中有四寶臺，金、銀、瑠璃、頗胝迦等間錯莊嚴，若金為臺即銀為柱及以梁棟，若銀為臺即金為柱及以梁棟，若瑠璃為臺即頗胝迦為柱及以梁棟，若頗胝迦為臺即瑠璃為柱及以梁棟；清涼甘美水滿池中；優鉢羅華、鉢訥摩華、俱母陀華、奔拏利迦華等，遍覆其內；復有種種水鳥遊戲池中，出妙音聲，謂高遠聲、悅意聲、美妙聲等。",
        "source": "T03n0165_004:0400c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有種種華樹果樹，直生端立圓無缺減；如結鬘師取以妙線，妙巧安布盤結成鬘，華果樹林亦復如是；彼樹復有種種飛鳥游止其上，出妙音聲；觸處皆有青、黃、赤、白四色劫波衣樹，其樹所出四色妙衣；又有種種妙音樂樹，所謂簫、笛、琴、箜篌等；又有種種妙莊嚴樹，彼樹所出手釧足環，及身莊嚴妙好之具；又有四色蘇陀味食，謂青、黃、赤、白。",
        "translation": "\"Again, there are various kinds of flowering and fruiting trees that grow upright and stand perfectly round without loss; like the garland maker who takes a wonderful thread and delicately wraps it in a coil to form a garland, so too is the grove of flowering and fruiting trees; there are various flying birds that roam and stand atop those trees, producing wonderful sounds; everywhere they touch, there are the four-colored kaparda trees of blue, yellow, red, and white, from which come four kinds of wonderful clothing; there are various trees of wonderful music, such as the flute, flutes, lutes, and harps; there are various trees of wonderful adornment, from which come hand and foot rings and the ornamented and wonderful implements of the body; and there are four kinds of sustenance, which are blue, yellow, red, and white.",
        "source": "T03n0165_004:0400c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若彼天男及天女等隨所思者，纔起心時而皆自至。",
        "translation": "If those gods and goddesses follow their thoughts, they'll all arrive when they first arise in mind.",
        "source": "T03n0165_004:0400c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又有四種所飲之漿，謂末度漿、摩達網漿、迦譚末梨漿、播曩漿等。",
        "translation": "There are also four kinds of milk that they drink, which are madhurā, madanet, kāthamālī, and pāṇḍarī.",
        "source": "T03n0165_004:0400c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有種種殊妙莊嚴殿堂樓閣，諸天女等或處其中安隱而坐，或觀視游行，悉有種種輿輦服用莊嚴之具，天女駢隘擊鼓奏歌，爇眾名香豐諸飲食。",
        "translation": "There are also various wonderfully ornamented halls and mansions where goddesses either sit quietly or watch them promenade, and there are various carts, carts, and decorative implements, a procession of goddesses, drums, and songs, and the burning of numerous famous incense sticks and an abundance of food and drink.",
        "source": "T03n0165_004:0400c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼天眾與諸眷屬嬉戲娛樂，隨自福力受斯勝果。",
        "translation": "Those gods and their retinues play and entertain themselves, and they receive this excellent result based on their own merits.",
        "source": "T03n0165_004:0401a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「園中道路長二十由旬，闊半由旬，清淨嚴飾金沙布地；觸處遍灑旃檀香水；金繩交絡垂金鈴鐸；道路左右亦有種種華果樹林，飛鳥游戲出妙音聲；亦有四色劫波衣樹及音樂樹莊嚴樹等；復有四種莊嚴輿輦謂象乘、馬乘、車乘、寶輿；若彼天男及天女等思其乘馭往游戲者，纔起心時隨思即至，乘已游行受諸快樂。",
        "translation": "\"In the park, the pathway is 20 leagues long and half a league wide, and it's covered with a pure, ornamented floor of gold sand; everywhere it touches, perfume of sandalwood is sprinkled; gold cords are twisted together and draped with gold bells; there are groves of various flowers and fruits on the left and right of the pathway, and birds flying about make wonderful sounds; there are also four colorful kaparda trees, music trees, ornament trees, and so forth; and there are four other kinds of ornamented mounts, including elephant mounts, horse mounts, chariot mounts, and jeweled mounts.",
        "source": "T03n0165_004:0401a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「此園何故名為雜種？",
        "translation": "\"Why is this park called a variety?",
        "source": "T03n0165_004:0401a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此園中所有池沼、華果、樹林、衣服、嚴具及天女等種種雜故；又此園中諸天子眾，以雜種類嬉戲娛樂，由是緣故名雜種園。",
        "translation": "This garden is called the Mixed Seed Garden because of the various ways in which it contains ponds, flowers, fruits, trees, clothing, ornaments, and goddesses, and because of the various ways in which the sons of gods in this garden play and entertain themselves.",
        "source": "T03n0165_004:0401a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，雜種園西二十由旬，有雜種地縱廣正等二百五十由旬，周匝千由旬，有百一種采繪嚴飾清淨柔軟；其地中間有四寶臺間錯莊嚴；天曼陀羅華散布其地；道路長二十由旬，闊半由旬，清淨嚴飾；華果、樹林、衣服、音樂、莊嚴等樹一一具足；亦有輿輦隨思即至受諸快樂。",
        "translation": "\"Furthermore, 20 leagues west of the garden of various varieties, there's a field of various varieties measuring exactly 250 leagues in width and a thousand leagues in circumference, with a hundred kinds of decorations that are pure and gentle; in the middle of that field are four jeweled platforms interspersed with adornments; divine maṇḍala flowers are scattered throughout the field; the path is 20 leagues long and half a league wide, and it's decorated with pure adornments; it's supplied with trees of flowers and fruits, groves, clothing, music, adornments, and so forth; and there are mounts that can be approached with ease of thought and experience various pleasures.",
        "source": "T03n0165_004:0401a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有天仙修習梵行。",
        "translation": "There are celestials there who are cultivating the religious practice.",
        "source": "T03n0165_004:0401a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善見城北二十由旬，有園名歡喜，縱廣正等二百五十由旬，周匝千由旬，內外嚴麗殊妙可觀；園有金牆高一由旬；金牆之上有四女牆，金、銀、瑠璃、頗胝迦成；復有重牆通往來道亦四寶作。",
        "translation": "\"Furthermore, 20 leagues north of the city of Sunrise, there's a park called Jubilant, which measures exactly 250 leagues in width and a thousand leagues in circumference and is beautiful and sublime inside and out; it has a gold wall that's a league high, and above that gold wall are four women's walls made of gold, silver, lapis lazuli, and pāṭika; another heavy wall leading down the road is made of four treasures.",
        "source": "T03n0165_004:0401a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其園中地有百一種采繪嚴飾，又復柔軟如兜羅緜及如妙[疊*毛]，下足隨陷舉足隨起；有天曼陀羅華散布其地深可膝量，香風時來吹去萎華更雨新者。",
        "translation": "The ground in the garden is decorated with a hundred different kinds of paint, and it's as soft as a hooded [hair], with feet that sink in and feet that rise up. There are divine maṇḍala flowers scattered about on the ground, knee-deep, and the fragrant breezes that come and go sometimes blow away the withered flowers and rain down new ones.",
        "source": "T03n0165_004:0401a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「歡喜園中有大池沼，縱廣正等五十由旬，周匝二百由旬，金、銀、瑠璃、頗胝迦等以布其底；池之四面有四梯陛，金、銀、瑠璃、頗胝迦成；彼池沼中有四寶臺，金、銀、瑠璃、頗胝迦等間錯莊嚴，若金為臺即銀為柱及以梁棟，若銀為臺即金為柱及以梁棟，若瑠璃為臺即頗胝迦為柱及以梁棟，若頗胝迦為臺即瑠璃為柱及以梁棟；清涼甘美水滿池中；優鉢羅華、鉢訥摩華、俱母陀華、奔拏利迦華等，遍覆其內；復有種種水鳥游戲池中出妙音聲，謂高遠聲、悅意聲、美妙聲等。",
        "translation": "「歡喜園中有大池沼，縱廣正等五十由旬，周匝二百由旬，金、銀、瑠璃、頗胝迦等以布其底；池之四面有四梯陛，金、銀、瑠璃、頗胝迦成；彼池沼中有四寶臺，金、銀、瑠璃、頗胝迦等間錯莊嚴，若金為臺即銀為柱及以梁棟，若銀為臺即金為柱及以梁棟，若瑠璃為臺即頗胝迦為柱及以梁棟，若頗胝迦為臺即瑠璃為柱及以梁棟；清涼甘美水滿池中；優鉢羅華、鉢訥摩華、俱母陀華、奔拏利迦華等，遍覆其內；復有種種水鳥游戲池中出妙音聲，謂高遠聲、悅意聲、美妙聲等。",
        "source": "T03n0165_004:0401a28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有種種華樹果樹，直生端立圓無缺減；如結鬘師取以妙線，妙巧安布盤結成鬘，華果樹林亦復如是。",
        "translation": "\"Again, there are various kinds of flowering and fruiting trees that grow upright and stand upright and are perfectly round without loss, like a garland maker who takes a wonderful thread and skillfully spreads it into a disk to form a garland, and so it is with a grove of flowering and fruiting trees.",
        "source": "T03n0165_004:0401b10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼樹復有種種飛鳥游止其上，出妙音聲；觸處皆有青、黃、赤、白四色劫波衣樹，其樹所出四色妙衣；又有種種妙音樂樹，所謂簫、笛、琴、箜篌等；又有種種妙莊嚴樹，彼樹所出手釧足環，及身莊嚴妙好之具；又有四色蘇陀味食，謂青、黃、赤、白；若彼天男及天女等隨所思者，纔起心時而皆自至。",
        "translation": "There are also various flying birds that roam above that tree and make wonderful sounds; everywhere they touch, there's the blue, yellow, red, and white kaparda tree, which produces four kinds of wonderful clothing; various trees of wonderful music, such as the flute, flutes, lutes, and harps; various trees of wonderful adornment, which produce hand-ring and foot-ring, as well as the body's ornamented and wonderful implements; and four delicious foods of the sudras, which are blue, yellow, red, and white; and whatever gods and goddesses contemplate, they all come to themselves when they first arouse their minds.",
        "source": "T03n0165_004:0401b12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又有四種所飲之漿，謂末度漿、摩達網漿、迦譚末梨漿、播曩漿等。",
        "translation": "There are also four kinds of milk that they drink, which are madhurdha milk, madana milk, kāthamālī milk, and pāna milk.",
        "source": "T03n0165_004:0401b19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有種種殊妙莊嚴殿堂樓閣，諸天女等或處其中安隱而坐，或觀視游行；悉有種種輿輦服用莊嚴之具，天女駢隘擊鼓奏歌，爇眾名香豐諸飲食。",
        "translation": "There are also various wonderfully ornamented halls and mansions where goddesses either sit quietly or watch them promenade, and there are various carts, carts, and decorative implements, a procession of goddesses, drums, songs, and firewood, famous incense, and plenty of food and drink.",
        "source": "T03n0165_004:0401b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼天眾與諸眷屬嬉戲娛樂，隨自福力受斯勝果。",
        "translation": "Those gods and their retinues play and entertain themselves, and they receive this excellent result based on their own merits.",
        "source": "T03n0165_004:0401b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「園中道路長二十由旬，闊半由旬，清淨嚴飾金沙布地；觸處遍灑旃檀香水；金繩交絡垂金鈴鐸；道路左右亦有種種華果樹林，飛鳥游戲出妙音聲；亦有四色劫波衣樹及音樂樹莊嚴樹等；復有四種莊嚴輿輦，謂象乘、馬乘、車乘、寶輿；若彼天男及天女等，思其乘馭往游戲者，纔起心時隨思即至，乘已游行受諸快樂。",
        "translation": "\"In the park, the pathway is 20 leagues long and half a league wide, and it's covered with a pure, ornamented floor of gold sand; everywhere it touches, perfume of sandalwood is sprinkled; gold cords are twisted together and draped with gold bells; on the left and right of the pathways, there are groves of various flowers and fruits, and birds of prey play with the wonderful sounds; there are also four colorful kaparda trees, music trees, ornamented trees, and so forth; and there are four kinds of ornamented carts, which are elephant carts, horse carts, chariot carts, and jeweled carts.",
        "source": "T03n0165_004:0401b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「此園何故名為歡喜？",
        "translation": "\"What is this park called joyful?",
        "source": "T03n0165_004:0401c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此園中所有池沼、華果、樹林、衣服、嚴具及天女等、彼諸天眾隨所受用嬉戲娛樂，隨自福力心生適悅歡喜快樂；以是緣故名歡喜園。",
        "translation": "\"This garden is called the Garden of Joy because of all the ponds, flowers, fruits, trees, clothing, ornaments, goddesses, and other celestials who play and enjoy themselves as they please and rejoice according to their own merits.",
        "source": "T03n0165_004:0401c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，歡喜園北二十由旬有歡喜地，縱廣正等二百五十由旬，周匝千由旬，有百一種采繪嚴飾清淨柔軟；其地中間有四寶臺間錯莊嚴；天曼陀羅華散布其地；道路長二十由旬，闊半由旬，清淨嚴飾；華果、樹林、衣服、音樂、莊嚴等樹一一具足；亦有輿輦隨思即至受諸快樂。",
        "translation": "\"Furthermore, 20 leagues north of the Rejoicing Garden is the Rejoicing Ground, which measures exactly 250 leagues in width and 1,000 leagues in circumference and is decorated with a hundred different kinds of decorations that are pure and gentle; in the middle of that ground are four jeweled platforms interspersed with adornments; divine maṇḍala flowers are scattered throughout the ground; the path is 20 leagues long and half a league wide, and it's decorated with pure adornments; it's supplied with flowers and fruits, groves, clothing, music, adornments, and other trees; and there are mounts that can be approached with ease of thought to experience these pleasures.",
        "source": "T03n0165_004:0401c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有天仙修習梵行。",
        "translation": "There are gods and sages there who practice the religious life.",
        "source": "T03n0165_004:0401c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善見天城東北有樹，名波利質多羅俱毘陀羅。",
        "translation": "\"Furthermore, northeast of the city of Sunnaketu there's a tree named Pārijātṛkupitra.",
        "source": "T03n0165_004:0401c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其樹盤根五十由旬，一一樹枝出五十由旬；彼第一枝東出五十由旬，第二枝南出五十由旬，第三枝西出五十由旬，第四枝北出五十由旬，中枝上出高聳虛空五十由旬；其樹高一百五十由旬，徑五十由旬，周匝三百由旬；妙香順風聞百由旬，逆風五十由旬；色光明照八十由旬；枝葉華果開落依時；所有三十三天眾，若見此樹半努鉢羅輸時心生歡喜，彼諸天眾游行戲樂。",
        "translation": "Its panicle is fifty leagues long, and each branch of the tree branches out for fifty leagues; the first branch branches out for fifty leagues to the east, the second branch branches out for fifty leagues to the south, the third branch branches out for fifty leagues to the west, the fourth branch branches out for fifty leagues to the north, and the middle branch branches out for fifty leagues reaching high into the sky; the tree is 150 leagues high, has a diameter of 50 leagues, and is surrounded by 300 leagues; its wonderful fragrance is heard for a hundred leagues with the wind and 50 leagues against it; its color and light shine for 80 leagues; its branches, leaves, flowers, and fruits fall according to the time; if all the Trāyastriṃśa gods rejoice when they see this tree half full of fruits, the gods processionally rejoice.",
        "source": "T03n0165_004:0401c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「其樹非久，又見尸蘭拏鉢羅輸；彼諸天眾心生歡喜，游行戲樂。",
        "translation": "\"It's not for long, but when they see Śīlānaprabhāsa, the hearts of those gods rejoice and they parade about in joy and happiness.",
        "source": "T03n0165_004:0401c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「其樹非久，又見惹羅迦惹覩；彼諸天眾心生歡喜，游行戲樂。",
        "translation": "\"Not for long did that tree grow, but then he saw Jārakṛta Jātus, and the hearts of those gods rejoiced and they marched in joy and happiness.",
        "source": "T03n0165_004:0401c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「其樹非久，又見叉囉迦惹覩；彼諸天眾心生歡喜，游行戲樂。",
        "translation": "\"Not for long did that tree grow, but then I saw Krakucchanda, and the hearts of those gods rejoiced and they marched in joy and happiness.",
        "source": "T03n0165_004:0401c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「其樹非久，又見骨砧摩羅迦惹覩；彼諸天眾心生歡喜，游行戲樂。",
        "translation": "\"Not for long did that tree grow, but I saw Bhaiṣajyarāja looking at it, and the hearts of those gods rejoiced as they marched in joy and happiness.",
        "source": "T03n0165_004:0402a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「其樹非久，又見迦迦寫葛惹覩；彼諸天眾心生歡喜，游行戲樂。",
        "translation": "\"Not for long did that tree grow, but then I saw the image of Kakuda-kāśyapa, and the hearts of those gods rejoiced and they marched in joy and happiness.",
        "source": "T03n0165_004:0402a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「其樹非久，又見芳盛普遍開敷；彼諸天眾見是波利質多羅俱毘陀羅樹，遍開敷已，心生歡喜；夏四月中於其樹下五欲娛樂，嬉戲自在，隨自福力受斯勝果。」",
        "translation": "\"Not for long did they see that tree in full bloom, and the hearts of those gods rejoiced when they saw that tree in full bloom, and in the fourth month of summer they enjoyed the five pleasures underneath it, playing and enjoying themselves, and reaping its excellent results according to their own merits.\"",
        "source": "T03n0165_004:0402a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「大王！",
        "translation": "The Buddha said, \"Great king!",
        "source": "T03n0165_004:0402a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "福威力故，彼三十三天中波利質多羅俱毘陀羅樹勝異如是。",
        "translation": "Because of the power of merit, the Trāyastriṃśa Heaven's pārijātaka-vipaṭaka tree is superior in this way.",
        "source": "T03n0165_004:0402a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，三十三天波利質多羅俱毘陀羅樹下有雜飾地，縱廣正等五十由旬，周匝二百由旬，殊麗可觀；有百一種采繪嚴飾，清淨柔軟如兜羅緜及如妙[疊*毛]，下足隨陷舉足隨起；天曼陀羅華散布其地，香風時來吹去萎華更雨新者。",
        "translation": "Furthermore, underneath the Trāyastriṃśa Heaven's pārijātaka tree there's a richly decorated ground that measures exactly 50 yojanas in width and 200 yojanas in circumference, and it's beautiful to behold; it's decorated with a hundred different kinds of decorations, pure and soft like a pearl's beard and like fine [tufted*hair], with feet that sink down and feet that rise up; there are celestial maṇḍala flowers scattered all over the ground, and the fragrant breezes blow away the withered flowers when they come and rain new ones.",
        "source": "T03n0165_004:0402a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中布以純金所成最勝賢座，帝釋天主處于座上；彼三十三天諸天子眾，夏四月中游止其間，五欲娛樂，嬉戲自在。",
        "translation": "They are covered with a most excellent seat made of pure gold, on which the lord Indra is seated, and the Trāyastriṃśa gods are filled with sons and daughters of gods who wander about during the fourth month of summer, enjoying the five desires and playing at their leisure.",
        "source": "T03n0165_004:0402a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復雜飾柔軟周匝於地，復有種種華樹果樹，直生端立圓無缺減，如結鬘師取以妙線，妙巧安布盤結成鬘，華果樹林亦復如是；有眾飛鳥游止其上，出妙音聲；又有四色劫波衣樹，其樹所出四色妙衣；又有種種妙音樂樹，所謂簫、笛、琴、箜篌等；又有種種妙莊嚴樹，彼樹所出手釧足環，及身莊嚴妙好之具；又有四色蘇陀味食，謂青、黃、赤、白。",
        "translation": "\"There are also various ornaments and softnesses that surround the ground, and there are various flowering and fruiting trees that grow upright and are perfectly round, like a garland maker who takes a wonderful thread and delicately wraps it in a coil to form a garland, and so it is with a grove of flowering and fruiting trees; there are birds of prey that wander up there and produce wonderful sounds; there are the four-colored kaparda trees, which produce four colors of wonderful clothing; there are various trees of wonderful music, such as the flute, the flute, the lute, and the harp; there are various trees of wonderful adornment, which produce hand and foot rings and ornamental and wonderful implements for the body; and there are four colored susthas of flavored food, which are blue, yellow, red, and white.",
        "source": "T03n0165_004:0402a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若彼天男及天女等，隨所思者而皆自至。",
        "translation": "If there are celestial beings and celestial women, they'll come to them on their own according to their thoughts.",
        "source": "T03n0165_004:0402a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又有四種所飲之漿，謂末度漿、摩達網漿、迦譚末梨漿、播曩漿等。",
        "translation": "There are also four kinds of milk that they drink, which are madhurā, madanet, kāthamālī, and pāṇḍarī.",
        "source": "T03n0165_004:0402a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有種種殊妙莊嚴殿堂樓閣，諸天女等或處其中安隱而坐，或觀視游行，悉有種種輿輦服用莊嚴之具，天女駢隘擊鼓奏歌，爇眾名香豐諸飲食。",
        "translation": "There are also various wonderfully ornamented halls and mansions where goddesses either sit quietly or watch them promenade, equipped with various carts and adornments, with goddesses running about, beating drums and singing, and burning multitudes of famous incense and rich food.",
        "source": "T03n0165_004:0402b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼天眾與諸眷屬，夏四月中，五欲娛樂嬉戲自在，隨自福力受斯勝果。",
        "translation": "Those gods and their retinues enjoy the five pleasures and play freely during the fourth month of summer, and they receive this excellent result based on their own merits.",
        "source": "T03n0165_004:0402b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說頂生王因緣經卷第四",
        "translation": "Foshuo dingshengwang yinnian jing, vol. 4",
        "source": "T03n0165_004:0402b07_0",
        "is_bad_quality": false
    }
]