[
    {
        "source_sentence": "佛本行集經卷第四十七",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Volume 47",
        "source": "T03n0190_047:0869c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隋天竺三藏闍那崛多譯",
        "translation": "Sui Tianzhu Tripiṭaka Jñānagupta Translation",
        "source": "T03n0190_047:0869c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大迦葉因緣品下",
        "translation": "Second Chapter of the Causes and Conditions of Mahākāśyapa",
        "source": "T03n0190_047:0869c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼帝釋王作如是念：『我于今者，亦可下生彼閻浮提人間受生，教化彼等，教誨成就。』",
        "translation": "\"At the time, that King Indra thought, 'Now, I could be born down among the people of Jambudvīpa and accept birth there, teach them, and accomplish their instructions.'",
        "source": "T03n0190_047:0869c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是思惟已，喚四天王言：『善哉仁者！",
        "translation": "After this thought, he called to the four celestial kings and said, 'Good, my lord!",
        "source": "T03n0190_047:0869c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於今者，可就我所聽我教令，我今意欲共汝等輩生於人間，教化人故，教誨彼等。",
        "translation": "Now, you may come to my place and listen to my instructions, for I now want to be born among humans with you people and teach them for the sake of teaching and transforming them.",
        "source": "T03n0190_047:0869c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於彼時，當作師子王身，汝等當作師子而守護之，將多眷屬而圍遶之。",
        "translation": "At the time, I was designated as a lion king, and you were designated as lions to guard him and surround him with a large retinue.",
        "source": "T03n0190_047:0869c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是身已，遊歷村舍城邑聚落。",
        "translation": "After creating this body, I traveled from village to village, town to town, and colony to colony.",
        "source": "T03n0190_047:0869c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遊行處時，時彼人輩若問汝等：「我當應常與汝何物？」",
        "translation": "When I traveled there, did some of those people ask you, \"What should I always give you?\"",
        "source": "T03n0190_047:0869c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等應當報彼人言：「日別與我一百數人。」",
        "translation": "You should tell those people, \"Give me a hundred men each day.\"",
        "source": "T03n0190_047:0869c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若其彼等復問汝等：「須丈夫也？",
        "translation": "Suppose one of those people also asks you, 'Is there a need for a husband?'",
        "source": "T03n0190_047:0869c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須小兒也？",
        "translation": "Should I be a child?",
        "source": "T03n0190_047:0869c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為取婦人？",
        "translation": "To take a woman?",
        "source": "T03n0190_047:0869c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為取男子？」",
        "translation": "To get a man?\"",
        "source": "T03n0190_047:0869c29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等應報作如是言：「若有多殺生者，如是等人，日須一百。",
        "translation": "You should respond by saying, \"If there's someone who kills a lot of people, such a person must be fed a hundred a day.",
        "source": "T03n0190_047:0869c29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "用供給此師子王食；如是偷盜人者，行邪婬者，行妄語者，或兩舌者，或惡口者，或綺語者，或多貪者，或多瞋者，或邪見者，如是之等，諸惡人輩，日須一百，供此師子。",
        "translation": "Feed the lion king with offerings; such evil people as those who steal, those who commit sexual misconduct, those who engage in false speech, those who double-talk, those who speak harshly, those who speak fancy words, those who have much desire, those who have much anger, or those who hold wrong views must be fed by the lion king for a hundred a day.",
        "source": "T03n0190_047:0870a01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若其有諸不殺生者，汝等勿與，如此之人，師子不食；如是不盜者，乃至不邪見者，汝等勿與，如此師子悉皆不食。",
        "translation": "If there are people who don't kill, don't give them to the lion; such people don't steal, and even those who don't hold wrong views, don't give them to the lion; the lion doesn't eat them all.",
        "source": "T03n0190_047:0870a05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復須是教，家別一人決須出家。」』",
        "translation": "Again, this must be the teaching, for each person in the family must definitely leave home.\"",
        "source": "T03n0190_047:0870a08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，帝釋及四天王，善教思惟，作是念已，下來閻浮。",
        "translation": "\"It was then that Śakra and the four celestial kings well instructed and considered, and after they had thought this, they descended into Yama.",
        "source": "T03n0190_047:0870a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，帝釋化作師子，縱廣高下一俱盧舍，猶如師子無有異也。",
        "translation": "At the time, Indra transformed into a lion, even though it was as broad and tall as a kṣipa, just like the lion.",
        "source": "T03n0190_047:0870a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼人眾，在師子後，為師子王索食而行，如彼昔時帝釋所教，無有異也。",
        "translation": "That crowd of people then went behind the lion and asked for food for the lion king, just as Śakra had taught them in the past, without any difference.",
        "source": "T03n0190_047:0870a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼眾以怖師子，悔心殺生，無有偷盜，亦無邪婬，乃至無有邪見之心，悉具足持修十善業。",
        "translation": "\"At the time, those people, fearing the lion, repented of killing beings, didn't steal, didn't engage in sexual misconduct, and didn't have a mind of wrong view, and all fully maintained and cultivated the ten good activities.",
        "source": "T03n0190_047:0870a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "家別一人，出家學道，行四梵行，命終已後，生於梵宮。",
        "translation": "Separate from his family, that person leaves home, trains on the path, performs the four pure practices, and is born in a palace of Brahmā after his life ends.",
        "source": "T03n0190_047:0870a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其眾中，若有人等，唯持十善不出家者，彼等人輩，多生人天，流轉而行。",
        "translation": "If there are people among them who simply maintain the ten good qualities and don't leave home, many of their peers will be born in heaven and will wander about in transmigration.",
        "source": "T03n0190_047:0870a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是摩訶迦葉，於彼時中，如是方便，為眾多人，作大利益，以過去世因緣力故，今亦復爾，為眾人民，作大利益。",
        "translation": "Thus, Mahākāśyapa did this method of doing great good for many people during that time, and because of the power of causes and conditions from the past, he'll do the same thing now for the great benefit of all the people.",
        "source": "T03n0190_047:0870a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T03n0190_047:0870a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是摩訶迦葉比丘，於未來世彌勒世尊法教之中，亦為多人作大利益。」",
        "translation": "This monk Mahākāśyapa will also do great good for many people in the future while teaching the Dharma of the Bhagavān Maitreya.\"",
        "source": "T03n0190_047:0870a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸比丘白佛言：「世尊！",
        "translation": "The monks then said to the Buddha, \"Bhagavān!",
        "source": "T03n0190_047:0870a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是摩訶迦葉，於彼云何當作利益？」",
        "translation": "How will this benefit Mahākāśyapa?\"",
        "source": "T03n0190_047:0870a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘言：「諸比丘！",
        "translation": "The Buddha addressed the monks, saying, \"Monks!",
        "source": "T03n0190_047:0870a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是摩訶迦葉，我涅槃後，攝護我法及諸戒律，令久住世，當作法會，盡其形壽，將命終時，入於山間，以神通力，住持此身，起如此願：『願我此身，勿令散壞，乃至彌勒如來、多陀阿伽度、三藐三佛陀出，見我身也。』",
        "translation": "''Thus, Mahākāśyapa, after I pass away, I will guard my teaching and the precepts so that they will long endure in the world, conduct a Dharma assembly, and when my life is about to end, I'll go into the mountains, maintain this body with my supernormal powers, and make this vow: 'May this body of mine not be scattered until the Tathāgata Maitreya, the Tathāgata Aggata, or the Samyak-saṃbuddha emerges and sees my body.'",
        "source": "T03n0190_047:0870a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是思惟已，遂捨身命，入無餘涅槃。",
        "translation": "After this thought, he then gave up his life and entered nirvāṇa without remainder.",
        "source": "T03n0190_047:0870b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼涅槃後，二山還合，於後彌勒得阿耨多羅三藐三佛陀時，廣顯法教，於彼時間，彌勒世尊憶念是大迦葉舍利，生憶念已，告諸比丘，作如是言：『汝等比丘！",
        "translation": "After his nirvāṇa, the two mountains reunited, and when Maitreya attained unsurpassed, perfect enlightenment, he explained the teaching of the Dharma in detail.",
        "source": "T03n0190_047:0870b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲見釋迦牟尼多陀阿伽度、三藐三佛陀聲聞弟子，少欲知足頭陀第一者，所謂摩訶迦葉已不？』",
        "translation": "Whoever wants to see Śākyamuni, the śrāvaka disciple of the Tathāgata, the Samyak-saṃbuddha, and the first ascetic with few desires and fulfillment, is called Mahākāśyapa no longer?'",
        "source": "T03n0190_047:0870b05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等比丘白言：『唯然世尊！",
        "translation": "Those monks said, 'Yes, Bhagavān!",
        "source": "T03n0190_047:0870b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等樂見。』",
        "translation": "We're delighted to see it.'",
        "source": "T03n0190_047:0870b08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彌勒如來、阿羅漢帝、三藐三佛陀，與無量千眾，左右圍遶，至於彼所。",
        "translation": "\"At the time, the Tathāgata Maitreya, the Arhatdi, and the Samyak-saṃbuddha surrounded by measureless thousands of people came to that place.",
        "source": "T03n0190_047:0870b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至彼處已，時彼兩山，即便兩開。",
        "translation": "When they arrived there, those two mountains were even opened in two.",
        "source": "T03n0190_047:0870b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彌勒多陀伽多、三藐三佛陀，見大迦葉比丘舍利，不散不壞，唯著僧伽梨。",
        "translation": "At the time, Maitreya, Dhṛtarāṣṭra, and Samyak-saṃbuddha saw that Mahākāśyapa's monk's relics were not scattered or broken, but were only attached to the saṃghāṭī.",
        "source": "T03n0190_047:0870b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見已告諸比丘言：『諸比丘！",
        "translation": "After he saw it, he addressed the monks, saying, 'Monks!",
        "source": "T03n0190_047:0870b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是釋迦多陀伽多、三藐三佛陀聲聞弟子，頭陀第一，名大迦葉，即其人也。』",
        "translation": "This is Śakra Tathāgata, the Samyak-saṃbuddha's śrāvaka disciple, the foremost ascetic, named Mahākāśyapa, that's him.'",
        "source": "T03n0190_047:0870b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彌勒多陀伽多、三藐三佛陀，在於彼處，為諸比丘而說其法，作如是言：『諸比丘！",
        "translation": "\"At the time, Maitreya, the Tathāgata, Samyak-saṃbuddha, was there, teaching the Dharma for the monks, and said thus, 'Monks!",
        "source": "T03n0190_047:0870b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉比丘所行如是，我如是教，汝等今者應如迦葉比丘所行。』",
        "translation": "Thus has the monk Kāśyapa practiced, and thus have I taught you, so now you should do as the monk Kāśyapa has done.'",
        "source": "T03n0190_047:0870b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，眾中多千比丘，乘如是法，行如是法，如摩訶迦葉比丘所當行也。",
        "translation": "\"At the time, there were many thousands of monks in the congregation who rode in such a way and practiced such a way, just as the monk Mahākāśyapa should have practiced.",
        "source": "T03n0190_047:0870b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼眾中，無量千數眾等，於彼法中，當得清淨法眼。」",
        "translation": "Among those many, there are measureless thousands of them, and in that teaching, they will attain the pure eye of the Dharma.\"",
        "source": "T03n0190_047:0870b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「如是次第，是大迦葉比丘，為當來時大利益也。",
        "translation": "The Buddha told the monks, \"In this order, this is the great Kāśyapa monk who will be a great benefit in the future.",
        "source": "T03n0190_047:0870b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T03n0190_047:0870b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今誡勸汝等！",
        "translation": "I now admonish you!",
        "source": "T03n0190_047:0870b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "學大迦葉比丘，願汝等行如迦葉比丘也。」",
        "translation": "Train like the great Kāśyapa monk, and may you all practice like the Kāśyapa monk.\"",
        "source": "T03n0190_047:0870b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛本行集經跋陀羅夫婦因緣品第四十八爾時，跋陀羅迦卑梨耶女以不得善師，遂至外道波離婆闍迦所出家學道，精勤修習，成就彼法，尅獲四禪，具足五通。",
        "translation": "It was then that the Bhadrakapilā woman, who didn't have access to a good teacher, left home to train with the outsider Parivrājaka, diligently cultivated that path, attained the four meditation heavens, and fully acquired the five supernormal powers.",
        "source": "T03n0190_047:0870b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼法中，得大名稱，成就威力。",
        "translation": "Among those teachings, she attained a great reputation and accomplished great authority.",
        "source": "T03n0190_047:0870c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊已開女人聽其出家。",
        "translation": "At the time, the Bhagavān had opened his ears to women and asked them to leave home.",
        "source": "T03n0190_047:0870c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時摩訶波闍波提，為五百釋女，皆悉出家，光顯佛法，建立比丘尼眾。",
        "translation": "Mahāprajāpatī then renounced the house for 500 women of the Śākyas, revealed the Buddha's teaching, and established a community of bhikṣus and nuns.",
        "source": "T03n0190_047:0870c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼時間，長老大迦葉作是思惟：「我於往昔，已許跋陀羅迦卑梨耶女，得善教師，要當相示，必令汝得，出家學道。」",
        "translation": "At the time, the eldest Kāśyapa thought, \"In the past, I've given permission to Bhadrakapilā to be a good teacher, and I will show her that I will make you leave home and train on the path.\"",
        "source": "T03n0190_047:0870c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是念：「彼跋陀羅迦卑梨耶女，今在何處？」",
        "translation": "Again, he thought, \"Where is that Bhadrakapilā girl now?\"",
        "source": "T03n0190_047:0870c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便入定，觀察是女，以清淨天眼過於人眼，觀見是女，在彼波離婆闍迦外道之處，出家學道，住在恒河河岸之處，修外道行。",
        "translation": "He then went into meditation and observed this woman, and with the pure divine eye that surpasses the human eye, he saw that she was a laywoman from that place in Parivrājaka, renouncing the religious life and training, living on the bank of the Ganges River, and cultivating her religious practices.",
        "source": "T03n0190_047:0870c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見已便喚一箇得通比丘尼來，而告言曰：「善哉姊妹！",
        "translation": "After he saw her, he summoned one of the well-versed nuns and told her, \"Good, sister!",
        "source": "T03n0190_047:0870c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若知時，其跋陀羅迦卑梨耶女，於波離婆闍迦外道之所，出家學道，今在恒河河岸之所。",
        "translation": "If you knew, that Bhadrakapilā woman left home and trained at the place of the lay practitioners at Parivrājaka and is now at the bank of the Ganges River.",
        "source": "T03n0190_047:0870c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉姊妹！",
        "translation": "Good, sister!",
        "source": "T03n0190_047:0870c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝應詣彼如實告言：『善哉姊妹！",
        "translation": "You should go to him and tell him the truth, 'Good, sister!",
        "source": "T03n0190_047:0870c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝夫迦葉，我共同師，出家學道，汝今亦可往詣彼所，於我師邊，出家學道，修行梵行。』」",
        "translation": "You, Kāśyapa, are my mutual teacher who left home to train on the path, so now you can go there, leave home by my teacher's side, train on the path, and cultivate the religious practice.'\"",
        "source": "T03n0190_047:0870c15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼得通比丘尼，聞長老摩訶迦葉如是語已，譬如壯士屈伸臂頃，彼比丘尼，如風迅疾，從舍衛城而沒其身相，遂至於跋陀羅迦卑梨耶波離婆闍迦外道女前現身，却住在於一面。",
        "translation": "After hearing this from the elder Mahākāśyapa, the monk and nun Peter Tong was like a strong man who flexes his arm and then, like a swift wind, that monk and nun disappeared from Śrāvastī and showed himself to the laywoman Bhadrakapilā and stayed to one side.",
        "source": "T03n0190_047:0870c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼比丘尼即便慰問波離婆闍迦外道之女，慰問已訖，而復告言：「善哉姊妹！",
        "translation": "The monk replied, \"Good, sister!",
        "source": "T03n0190_047:0870c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝應知時，汝夫迦葉，與我同師，出家學道，修行梵行，汝今亦可往詣彼所，於我師邊，出家學道，修行梵行也。」",
        "translation": "You should know that your husband Kāśyapa, who was my teacher, left home, trained on the path, and practiced the religious practice, so now you can also go there, train at my teacher's side, and leave home to train on the path and practice the religious practice.\"",
        "source": "T03n0190_047:0870c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，跋陀羅迦卑梨耶波離婆闍迦外道之女，問彼比丘尼言：「善哉姊妹！",
        "translation": "It was then that the daughter of the layman Bhadrakapiljāpāliwaja asked the monk and nun, \"Good, sister!",
        "source": "T03n0190_047:0870c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等教師，當何所似？」",
        "translation": "You teachers, what will you resemble?\"",
        "source": "T03n0190_047:0870c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，彼比丘尼報跋陀羅外道女言：「善哉姊妹！",
        "translation": "After she said this, the monk replied to the Bhadra laywoman, \"Good, sister!",
        "source": "T03n0190_047:0870c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等教師，以三十二大人之相，莊嚴其身，具足八十種好，十八不共佛法、十力、四無所畏，大慈大悲，無邊戒眾具足，無邊定眾具足，無邊智慧眾具足，無邊解脫眾具足，無邊解脫知見眾具足。",
        "translation": "We teachers adorn our bodies with the thirty-two major characteristics of a great person, replete with the eighty kinds of beauty, the eighteen distinctive characteristics of a buddha, the ten powers, the four fearlessnesses, great kindness, and great compassion, replete with boundless precepts, replete with boundless concentration, replete with boundless wisdom, replete with boundless liberation, and replete with boundless knowledge and vision of liberation.",
        "source": "T03n0190_047:0871a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我彼大師，一切聲聞諸弟子等，亦復如是，戒眾具足，定眾具足，智慧眾具足，解脫眾具足，解脫知見眾具足。」",
        "translation": "Thus, I, the great teacher, and all the śrāvaka disciples are likewise replete with precepts, replete with concentration, replete with wisdom, replete with liberation, and replete with knowledge and vision of liberation.\"",
        "source": "T03n0190_047:0871a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼比丘尼於跋陀羅迦卑梨耶女前，如是如是，歎佛功德及聲聞弟子。",
        "translation": "That monk and nun then praised the merits of the Buddha and the śrāvaka disciples, saying thus and so before the Bhadrakapilā woman.",
        "source": "T03n0190_047:0871a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼跋陀羅迦卑梨耶外道之女聞已，遂於如來及比丘僧所，心得清淨。",
        "translation": "After hearing this, that Bhadrakapilā laywoman attained purity of mind while staying with the Tathāgata and the monks.",
        "source": "T03n0190_047:0871a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得清淨已，告彼比丘尼言：「善哉姊妹！",
        "translation": "After she attained purity, she told the monk and nun, \"Good, sister!",
        "source": "T03n0190_047:0871a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是者，我當隨去。」",
        "translation": "If that's the case, I'll go along with you.\"",
        "source": "T03n0190_047:0871a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼比丘尼，語跋陀羅迦卑梨耶外道女言：「善哉姊妹！",
        "translation": "The monks and nuns then said to the Bhadrakapilā laywoman, \"Good, sister!",
        "source": "T03n0190_047:0871a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乘我神通，相隨而去。」",
        "translation": "Riding on my superknowledge, they went along with me.\"",
        "source": "T03n0190_047:0871a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，跋陀羅報彼比丘尼，作如是言：「善哉姊妹！",
        "translation": "At that point, Bhadra reported to the monks and nuns and said, \"Good, sister!",
        "source": "T03n0190_047:0871a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然我身自有神通也。」",
        "translation": "I, however, have my own superknowledge.\"",
        "source": "T03n0190_047:0871a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彼比丘尼共跋陀羅迦卑梨耶外道女，於彼發引，亦如壯士屈伸臂頃，從恒河所即便沒身，於祇陀林中，忽然出現，往詣佛所。",
        "translation": "At the time, that monk and nun, together with the Bhadrakapilā laywoman, were led, like a strong man with arms bent and extended, from the Ganges River into a body that had suddenly appeared in the Jeta Grove and went to the Buddha.",
        "source": "T03n0190_047:0871a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其跋陀羅迦卑梨耶外道之女，遙見世尊，端嚴殊妙，乃至猶如虛空眾星莊嚴，見已心得清淨，即至佛前，到已頂禮佛足，而白佛言：「善哉！",
        "translation": "That non-Buddhist woman Bhadrakapilā saw the Bhagavān from afar, resplendent in appearance, even like the stars adorning the sky, and when she saw that, her mind was purified, she went to the Buddha, bowed her head at his feet when she arrived, and said to him, \"Good!",
        "source": "T03n0190_047:0871a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0190_047:0871a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聽我出家，授我具戒。」",
        "translation": "He heard me leave home and gave me the full set of precepts.\"",
        "source": "T03n0190_047:0871a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告阿難言：「長老阿難！",
        "translation": "It was then that the Bhagavān addressed Ānanda, \"Ānanda the Elder!",
        "source": "T03n0190_047:0871a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將此跋陀羅迦卑梨耶外道之女，付囑摩訶波闍波提憍曇彌，勅教言曰：『此跋陀羅迦卑梨耶外道之女，教令出家授具足戒，是女當得神通具足威力並備。』」",
        "translation": "He entrusted this non-Buddhist daughter of Bhadrakapilā to Mahāprajāpatī Kauṇḍamitra and instructed him, 'Teach this non-Buddhist daughter of Bhadrakapilā to leave home and confer full ordination, and she will attain the combination of superb powers and outstanding strength.'\"",
        "source": "T03n0190_047:0871a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長老阿難，奉佛勅命，白佛言曰：「如世尊教，不敢違也。」",
        "translation": "At the time, Ānanda, the elder, was commanded by the Buddha to say to him, \"As the Bhagavān has taught, I dare not disobey him.\"",
        "source": "T03n0190_047:0871b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂將彼女，向於摩訶波闍波提憍曇彌比丘尼所，到已具陳如上之事。",
        "translation": "He then took her to the Mahāprajāpatī Kauṇḍinya bhikṣuṇī and explained the above when he arrived.",
        "source": "T03n0190_047:0871b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，摩訶波闍波提憍曇彌比丘尼，度跋陀羅迦卑梨耶外道之女，令得出家授具足戒。",
        "translation": "At the time, the monk Mahāprajāpatī Kauṇḍinya sent the daughter of the Bhadrakapilā laywoman home to receive the full set of precepts.",
        "source": "T03n0190_047:0871b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具戒未久，至空閑處，獨自安靜，遠離諸濁，精勤苦行，心不放逸，思惟而住。",
        "translation": "After having received the full precepts for a while, she went to a quiet place, quieted herself, removed herself from defilements, applied herself to austerities, didn't let her mind wander, and stayed in deliberation.",
        "source": "T03n0190_047:0871b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，跋陀羅迦卑梨耶外道之女，既得出家授具足戒，乃至心不放逸，思惟而住，不久彼眾，諸善男子，善女人等，正信出家，求無上梵行，現得見法，自得神通，所作已辦，得安樂住，口自唱言：「生死已斷，梵行已立，所作已辦，不受後有。」",
        "translation": "It wasn't long after that Bhadrakapilā, a woman from a non-Buddhist sect, had left home and been given the full precepts, so that she didn't become careless in her mind and stayed in contemplation, that there were a multitude of good men and good women who left home with correct faith, sought the unsurpassed religious practice, now saw the Dharma, attained their own supernormal powers, did their work, attained comfortable abiding, and said to themselves, \"Birth and death have been ended, the religious practice has been established, the task has been accomplished, and I won't be subject to a later existence.\"",
        "source": "T03n0190_047:0871b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是長老女，見知是已，遂得阿羅漢果，心得解脫。",
        "translation": "Seeing and knowing this, the elder woman then attained the fruit of the arhat, and her mind was liberated.",
        "source": "T03n0190_047:0871b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊復記，告諸比丘，作如是言：「是比丘尼，於聲聞比丘尼識宿命中，是跋陀羅迦卑梨耶比丘尼，最為第一。」",
        "translation": "The Bhagavān then remembered and addressed the monks, saying, \"Among śrāvaka monks and nuns who know the past lives of their consciousnesses, this is the Bhadrakapilā monk and nun who's the best.\"",
        "source": "T03n0190_047:0871b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘尼凡所諮問，皆能記別。",
        "translation": "Those monks and nuns were able to discern whatever questions they were asked.",
        "source": "T03n0190_047:0871b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彼等諸比丘尼眾，大生希有想，各各嗟歎：「希有希有！",
        "translation": "At that point, those monks and nuns gave rise to a great feeling of hope, each praising, \"How rare and how rare!",
        "source": "T03n0190_047:0871b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是跋陀羅迦卑梨耶比丘尼！",
        "translation": "Yes, Bhadrakapilā bhikṣuṇī!",
        "source": "T03n0190_047:0871b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而大眾中，諸比丘尼，久已出家，修行梵行，未得如是捷疾神通，如跋陀羅迦卑梨耶比丘尼者。」",
        "translation": "There are a great many monks and nuns who have left home and cultivated the religious practice for a long time but haven't yet attained such quick and miraculous abilities as the Bhadrakapilā monks and nuns.\"",
        "source": "T03n0190_047:0871b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彼比丘尼眾有心疑故，往詣如來，能斷疑惑，達解一切實義者之所，到已頂禮佛足，却住一面。",
        "translation": "It was then that a group of monks and nuns who had doubts in their minds went to the Tathāgata, the one who could end doubts and understand all true meanings, bowed their heads at the Buddha's feet when they arrived, and withdrew to stay to one side.",
        "source": "T03n0190_047:0871b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住一面已，彼諸比丘尼眾白佛言：「世尊！",
        "translation": "After staying to one side, that group of monks and nuns said to the Buddha, \"Bhagavān!",
        "source": "T03n0190_047:0871b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此跋陀羅迦卑梨耶比丘尼，往昔之時，作何善根，而於今者，生大富家，資財具足，乃至一切無所乏少。",
        "translation": "\"What good roots did this Bhadrakapilā monk and nun cultivate in the past that led to his birth in a wealthy family now, with an abundance of possessions and even everything that's not lacking?",
        "source": "T03n0190_047:0871b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身相端正，眾人樂見，觀者無厭，世所希有，具足眾相？",
        "translation": "His body is correct in appearance, pleasing to many people, unfailing to those who look at it, rare in the world, and replete with many characteristics?",
        "source": "T03n0190_047:0871b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以何緣而得出家，具諸戒行，疾得神通，世尊授記，於諸聲聞比丘尼眾弟子之中，識宿命者，是跋陀羅迦卑梨耶比丘尼，最為第一？」",
        "translation": "For what other reason did he leave home, fulfill the precepts, quickly attain supernormal powers, and the Bhagavān granted assurance that among the disciples of śrāvaka monks and nuns who knew their past lives, Bhadrakapilā was the best?\"",
        "source": "T03n0190_047:0871b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，佛告諸比丘尼，作如是言：「諸比丘尼！",
        "translation": "After he said this, the Buddha addressed the monks and nuns and said in this way, \"Monks and nuns!",
        "source": "T03n0190_047:0871c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我念往昔，波羅[木*奈]城中，有二女，共為親友。",
        "translation": "I think back in the past, there were two women in the city of Pola [munai] who were close friends.",
        "source": "T03n0190_047:0871c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者大富長者女，二者大姓婆羅門女。",
        "translation": "One was a woman of a wealthy elder, and the other was a woman of a great family of Brāhmaṇas.",
        "source": "T03n0190_047:0871c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彼婆羅門大種姓女，請彼大富長者之女至其舍宅。",
        "translation": "At the time, that woman of a great family of Brāhmaṇas invited that woman of a wealthy elder to come to her house.",
        "source": "T03n0190_047:0871c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，迦葉如來、多陀阿伽度、三藐三佛陀，詣大富長者家。",
        "translation": "The Tathāgata Kāśyapa, the Tathāgata Agastya, and the Samyak-saṃbuddha then went to the house of the wealthy elder.",
        "source": "T03n0190_047:0871c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼大富長者女見迦葉如來詣於己舍，即便出舍迎逆世尊，時彼婆羅門女不肯出迎。",
        "translation": "When that wealthy woman saw the Tathāgata Kāśyapa visiting her house, she left her house to greet the Bhagavān, but the brāhmaṇa refused to go out to meet her.",
        "source": "T03n0190_047:0871c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼大富長者女告大婆羅門女：『善哉姊妹！",
        "translation": "The wealthy elder woman then told the great brāhmaṇa, 'Good, sister!",
        "source": "T03n0190_047:0871c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝以何故，不迎世尊？』",
        "translation": "What was the reason you didn't welcome the Bhagavān?'",
        "source": "T03n0190_047:0871c12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼女報之言：『善哉姊妹！",
        "translation": "The woman replied, 'Good, sister!",
        "source": "T03n0190_047:0871c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我手無物，云何空手，往詣佛所？",
        "translation": "How can I go to the Buddha's place with empty hands when I have nothing in them?",
        "source": "T03n0190_047:0871c13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今向佛邊，以何等事，自恣迎佛？』",
        "translation": "What is the purpose of welcoming the Buddha on my own to the Buddha's side?'",
        "source": "T03n0190_047:0871c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，大富長者之女報彼女言：『善哉姊妹！",
        "translation": "\"At that point, the daughter of a wealthy man told her, 'Good, sister!",
        "source": "T03n0190_047:0871c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝但迎佛，如來必入。』",
        "translation": "'You simply welcome the Buddha, and the Tathāgata will surely enter.'",
        "source": "T03n0190_047:0871c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時彼大婆羅門女遂造一蓋，眾寶莊嚴，以細[疊*毛]衣，彌覆其上，復以種種諸花鬘等，四散垂下。",
        "translation": "It was then that the great brāhmaṇa woman then built a shrine, adorned with many treasures, covered it with a fine [tufted*hair] robe, and spread out various flower garlands and so forth.",
        "source": "T03n0190_047:0871c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，迦葉如來、阿羅訶、三藐三佛陀，於晨朝時，日在東方，愍彼女故，著衣持鉢，詣彼大富長者女家。",
        "translation": "\"At the time, the Tathāgata Kāśyapa, the Āraha, and the Samyak-saṃbuddha, in the morning when the sun was in the east, took pity on that woman and went to her house with her robe and bowl.",
        "source": "T03n0190_047:0871c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，婆羅門大姓女持彼寶蓋，奉獻迦葉如來、阿羅呵、三藐三佛陀，奉獻訖，復以偈誦，而說之曰：「『種種寶蓋金為柄，　　微妙細衣花覆上，　　迎奉丈夫大威德，　　唯願世尊哀納受。』",
        "translation": "\"After presenting it to the Tathāgata Kāśyapa, Ārāha, and Samyak-saṃbuddha, she recited a verse and said, \"These are jeweled lids made of gold, covered by flowers on a fine, delicate robe, and which offer great authority to the husband, may the Bhagavān accept them with pity.\"",
        "source": "T03n0190_047:0871c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，迦葉如來、阿羅呵、三藐三佛陀，愍彼女故，受其寶蓋。",
        "translation": "\"At the time, the Kāśyapa Tathāgata and the Āṭavika Samyak-saṃbuddha took the woman's jeweled lid out of pity for her.",
        "source": "T03n0190_047:0871c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等比丘尼！",
        "translation": "You monks and nuns!",
        "source": "T03n0190_047:0871c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿作心疑，彼時施寶蓋女，豈異人乎？",
        "translation": "Don't doubt in your mind, is that a different person than the woman who gave you the jeweled canopy?",
        "source": "T03n0190_047:0871c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即跋陀羅迦卑梨耶比丘尼是也。",
        "translation": "That's the Bhadrakapilā bhikṣuṇī.",
        "source": "T03n0190_047:0872a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸比丘尼！",
        "translation": "\"Monks and nuns!",
        "source": "T03n0190_047:0872a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更有因緣。",
        "translation": "\"There are further causes and conditions.",
        "source": "T03n0190_047:0872a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我念往昔，還此波羅[木*奈]城，有一大富長者。",
        "translation": "I think back in the past, when I returned to this city of Pola [munai], there was a wealthy elder.",
        "source": "T03n0190_047:0872a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其彼長者，有驅使女。",
        "translation": "That elder had a female messenger.",
        "source": "T03n0190_047:0872a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼時間，有一辟支佛，依波羅[木*奈]大城而住。",
        "translation": "At the time, there was a Pratibhāna Buddha who lived in the large city of Pārāṇasī.",
        "source": "T03n0190_047:0872a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，辟支佛於晨朝時，日在東方，著衣持鉢，詣大長者舍宅乞食。",
        "translation": "\"At the time, in the morning, when the sun was in the east, he gathered his robe and bowl and went to the great elder's residence to solicit alms.",
        "source": "T03n0190_047:0872a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，使女見辟支佛漸進而來，威儀庠序，進止有方。",
        "translation": "At the time, the messenger girl saw Vairocana Buddha gradually advancing, his manner was peaceful, and he conducted himself with dignity.",
        "source": "T03n0190_047:0872a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，使女，心得清淨，得清淨已，速詣家中，向長者婦邊，而白言曰：『善哉聖女！",
        "translation": "At the time, the messenger girl's mind was purified, and when it was purified, she quickly went home to the elder's wife and said, 'Good, noble girl!",
        "source": "T03n0190_047:0872a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一比丘，在門乞食。』",
        "translation": "There was a monk who was begging for food at the gate.'",
        "source": "T03n0190_047:0872a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時長者婦，梳髮而坐，以其左手，舉髮遙看彼辟支佛，是辟支佛，形體醜陋，身不正直。",
        "translation": "\"An elderly woman was sitting there, combing her hair, and she looked at that pratyekabuddha with her left hand, holding up her hair, and saw that pratyekabuddha's ugly form and ugly body.",
        "source": "T03n0190_047:0872a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時長者婦見已即告彼使女言：『我今不喜如是醜陋不正之人，況與食耶？』",
        "translation": "After she saw him, the elderly woman told her messenger girl, 'Now, I don't like such an ugly, upright person, so why wouldn't I give him food?'",
        "source": "T03n0190_047:0872a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時使女，復白彼言：『善哉聖女！",
        "translation": "The messenger then again said to her, 'Good, noble woman!",
        "source": "T03n0190_047:0872a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但與但與此仙人食，如是之人，何必端正？",
        "translation": "But what is the need for such a person to be correct when he is fed by this sage?",
        "source": "T03n0190_047:0872a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但取心賢。』",
        "translation": "They simply take the mind of a good man.'",
        "source": "T03n0190_047:0872a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時長者婦復作是言：『我實不憙如是之人，云何遣我布施食也？』",
        "translation": "The elderly woman then also said, 'I really don't like such people, so why would you send me to give food?'",
        "source": "T03n0190_047:0872a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使女復言：『聖女今者若不憙與仙人食者，但願與我一日食料，我自迴施。』",
        "translation": "The messenger woman again said, 'Noble Maiden, if you don't want to give food to an immortal, just give me food for a day and I'll give it back.'",
        "source": "T03n0190_047:0872a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時長者婦復作是言：『善哉姊妹！",
        "translation": "The elder woman then also said, 'Good, sister!",
        "source": "T03n0190_047:0872a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今既是我家作使，取汝自分隨意所與。』",
        "translation": "Now, since you're an envoy in my household, take your own share and give it as you like.'",
        "source": "T03n0190_047:0872a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，使女於長者婦邊，取自分食，奉獻尊者辟支佛。",
        "translation": "\"At the time, the messenger girl took her share of the food at the elder woman's side and offered it to Venerable Pṛthivī.",
        "source": "T03n0190_047:0872a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸辟支佛有如是法，以神通力教化眾生，不以餘法。",
        "translation": "\"The pratyekabuddhas have this way of teaching sentient beings by their supernormal powers, and they don't teach them by any other way.",
        "source": "T03n0190_047:0872a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時辟支佛，於使女邊生憐愍故，受所奉食，即於彼前，騰空而去。",
        "translation": "Venerable Pārśva Buddha then took the food offered to him because he had compassion on the servant woman's side, and he rose into the air in front of her and departed.",
        "source": "T03n0190_047:0872a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼使女，見辟支佛以神通力飛騰空行，既見此已，歡喜踊躍身心遍滿，不能自勝，合十指掌，遙即頂禮向彼尊者辟支佛陀，遂起是願，口即唱言：『願我將來值是好師，或勝是者，彼所說法，願速領悟，生生世世，不墮惡道，勿令醜陋得不正身如此仙人。",
        "translation": "Seeing Pārśva fly through the air with the power of his supernormal abilities, the messenger woman rejoiced and jumped for joy when she saw him, filled her body and mind to overflowing, and couldn't bring herself to put her palms together and salute Venerable Pārśva with her ten fingers.",
        "source": "T03n0190_047:0872a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0190_047:0872b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以醜陋故，乞食不得，我所生處，一切時中，可憙端正，眾所樂觀。』",
        "translation": "Because of my ugliness, I couldn't ask for food, but where I was born, at all times, I was a worthy and correct person who was well-liked by everyone.'",
        "source": "T03n0190_047:0872b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時彼長者婦，見彼尊者辟支佛，現大神通騰空而去，見已告彼使女言曰：『善哉姊妹！",
        "translation": "It was then that that elderly woman saw Venerable Pārśva appear with great supernormal powers and take off into the sky.",
        "source": "T03n0190_047:0872b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝可與我如此功德，我於今者，倍與汝食。』",
        "translation": "You may give me such merit, and I will give you twice as much food now.'",
        "source": "T03n0190_047:0872b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼使女，白長者婦作如是言：『善哉聖女！",
        "translation": "That messenger then said to the elder woman, 'Good, noble woman!",
        "source": "T03n0190_047:0872b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我不能與。』",
        "translation": "I can't give it to you.'",
        "source": "T03n0190_047:0872b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時長者婦復作是言：『善哉姊妹！",
        "translation": "The elder woman then again said, 'Good, sister!",
        "source": "T03n0190_047:0872b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願汝與我如此功德，我與汝食，兩倍於前。』",
        "translation": "May you give me such merit that I'll give you food twice as much as I gave you before.'",
        "source": "T03n0190_047:0872b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼使女言：『亦不能與。』",
        "translation": "The messenger woman said, 'I can't give it to you either.'",
        "source": "T03n0190_047:0872b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是三分四分五分、十分二十分三十分四十分五十分，悉不肯與。",
        "translation": "She then refused to give her three parts, four parts, five parts, ten parts, twenty parts, thirty parts, forty parts, or fifty parts.",
        "source": "T03n0190_047:0872b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，長者婦復告使女：『善哉姊妹！",
        "translation": "\"Then, the elder woman again told the messenger woman, 'Good, sister!",
        "source": "T03n0190_047:0872b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今與我如此功德，我今與汝一百分食。』",
        "translation": "Now, if you give me this merit, I'll give you a hundred percent of my food.'",
        "source": "T03n0190_047:0872b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使女言曰：『亦不能與。』",
        "translation": "The messenger woman said, 'I can't give it to you either.'",
        "source": "T03n0190_047:0872b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼長者婦即生瞋恨，便告之曰：『汝以何故，故違我勅？』",
        "translation": "\"At that point, the elder woman became angry and told her, 'For what reason did you disobey my order?'",
        "source": "T03n0190_047:0872b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂捉使女苦加打縛，時彼使女遂即高聲作大啼哭。",
        "translation": "He then grabbed the maid and tied her up with a hard hand, and she then cried out loudly and loudly.",
        "source": "T03n0190_047:0872b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彼大長者，從外入來，見彼使女啼哭如是，而問之曰：『賢者何故，如此啼哭？』",
        "translation": "At the time, that great elder came in from the outside and saw the maid crying like that, and asked, 'Good man, why is she crying like that?'",
        "source": "T03n0190_047:0872b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼使女即向長者說前情狀。",
        "translation": "That messenger woman then told the elder about the situation.",
        "source": "T03n0190_047:0872b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長者便生瞋恨，即喚己婦，令解衣服及諸瓔珞，復告言曰：『我既遣汝，撿挍家資，乃有沙門婆羅門者，詣家乞食，而汝不與？』",
        "translation": "The elder then became angry, summoned his wife, made her remove her robes and jewelry, and told her, 'I've sent you to gather your family's provisions, but there's an ascetic or brāhmaṇa who comes to your house to ask for food, and you won't give it to him.'",
        "source": "T03n0190_047:0872b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，驅令出堂，安置小室弊陋之處。",
        "translation": "For this reason, he expelled her from the hall and placed her in a small, ramshackle dwelling.",
        "source": "T03n0190_047:0872b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即召使女，教令洗浴，以婦瓔珞衣服之具，悉授使女，即令彼女，開倉庫門，顯示財寶，而告之曰：『賢者！",
        "translation": "He then summoned the maidservant, taught her to wash and bathe, gave her all the women's jewelry and clothing, and told her to open the treasury door, display the treasures, and tell her, 'Good man!'",
        "source": "T03n0190_047:0872b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是錢財物中，若有沙門婆羅門等，若有乞者，任隨施與，莫為限閡。』",
        "translation": "If there are ascetics, priests, or others who beg for such things in money or property, they can give them as they like without any limit.'",
        "source": "T03n0190_047:0872b28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等比丘！",
        "translation": "\"You monks!",
        "source": "T03n0190_047:0872c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T03n0190_047:0872c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時長者家內使女，豈異人乎？",
        "translation": "Was that a different person, a messenger girl from the elder's household?",
        "source": "T03n0190_047:0872c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿作斯疑，此即跋陀羅迦卑梨耶比丘尼是也。",
        "translation": "Don't doubt it, for this is the Bhadrakapilā bhikṣuṇī.",
        "source": "T03n0190_047:0872c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼使女，以於辟支佛所生清淨心故，隨其終已，生忉利天，可憙端正，眾所樂觀，最勝最妙。",
        "translation": "That messenger girl, because of the pure mind she had attained in the pratyekabuddha's place, was then born in the Heaven of Thirty-three after she ended up there, where she was a worthy and noble figure who was well-liked by many and most excellent and marvelous.",
        "source": "T03n0190_047:0872c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於忉利天宮殿之處，於玉女中無有勝者，而彼天上有四天子，各各諍競，求彼玉女欲以為妻，各各言曰：『是玉女者，當與為婦。』",
        "translation": "In the palace of the Heaven of the Thirty-three, there was no one better than that jade woman, and there were four sons of gods in that heaven who each competed against each other, seeking that jade woman to be their wives, and each said, 'This is a jade woman who will be your wife.'",
        "source": "T03n0190_047:0872c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時天帝釋，見四天子各各諍競，即勅言曰：『仁者汝等！",
        "translation": "\"When the god Indra saw each of the four celestials competing, he commanded them, saying, 'Gentlemen!",
        "source": "T03n0190_047:0872c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各競欲取此女為妻，汝等宜各隨便說偈，偈最勝者即便相與。』",
        "translation": "Each of you desires to take this woman as your wife, so why don't you each speak a verse as you like, and the best verse will be given to you?'",
        "source": "T03n0190_047:0872c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彼四天子，白天帝釋：『善哉天王！",
        "translation": "It was then that those four celestials sent Indra during the day, 'Good, King of the Celestials!",
        "source": "T03n0190_047:0872c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願天王！",
        "translation": "Only the King of Vows!",
        "source": "T03n0190_047:0872c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於前說偈，我等當說。』",
        "translation": "We will explain the verse beforehand.'",
        "source": "T03n0190_047:0872c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼帝釋，即說偈言：「『行坐恒思念，　　寢臥常無樂，　　我著睡眠時，　　爾乃心放捨。』",
        "translation": "Thereupon, that Tīrṣa spoke the verse, saying, 'Constantly thinking while walking and sitting, always lacking pleasure when sleeping, I am absorbed in sleep, and then I mentally abandon myself.'",
        "source": "T03n0190_047:0872c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼四天子之內有一天子復說偈言：「『天王汝快樂，　　睡眠得安隱，　　猶如戰鼓聲，　　常恒攪亂我。』",
        "translation": "\"It was then that one of those four celestials again spoke a verse, saying, 'You're happy, King of the Celestials, and you attain peace in your sleep just like the sound of a war drum that constantly disturbs me.'",
        "source": "T03n0190_047:0872c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「于時，第二天子復說偈言：「『如擊戰鼓聲，　　是聲互有無，　　如近耳搖酪，　　攪亂我不息。』",
        "translation": "\"Then the second celestial son spoke again, saying, 'It's like the sound of a battle drum, which is both present and absent, like a cheese ball shaking in the ear that doesn't stop disturbing me.'",
        "source": "T03n0190_047:0872c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「于時第三天子復說偈言：「『搖酪容有時，　　有急亦有疾，　　我為欲所亂，　　狀如炎日光。』",
        "translation": "\"The third celestial then again spoke a verse, saying, 'There's a time when the shaking of cheese is both urgent and painful, and I'm disturbed by desire, like the hot sun shining.'",
        "source": "T03n0190_047:0872c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「于時第四天子復說偈言：「『汝等皆安樂，　　善巧能說偈，　　我今不自知，　　為活為當死？』",
        "translation": "\"Then the fourth celestial again spoke the verse, 'Are you all happy and skillful at speaking verse, for now I don't know whether I'll live or die?'",
        "source": "T03n0190_047:0872c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，天帝釋見第四天子心躭著慾，即說偈言：「『是人欲捨命，　　不久自當死，　　恐捨天處樂，　　冥速授彼女。』",
        "translation": "\"Then, when Tiṣya saw the fourth celestial son's mind addicted to desire, he spoke a verse, saying, 'That man wants to lay down his life, and soon he will die; he's afraid of abandoning the pleasures of heaven, so he quickly gives her the hand of a woman.'",
        "source": "T03n0190_047:0872c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，彼天眾更共評論，遂授彼女。",
        "translation": "\"The multitude of gods then commented together, and they gave the girl the job.",
        "source": "T03n0190_047:0873a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼使女，從是已來，不墮惡道，周迴往返，於天人處，經無量生，於最後生，生迦毘羅婆羅門家，多饒財寶，資財無量。",
        "translation": "Since then, that messenger woman hasn't fallen into a bad path, has traveled around, gone through measureless lifetimes among gods and humans, and in her final lifetime was born into the family of the Kapilavastu, where she prospered with wealth and possessions that were incalculable.",
        "source": "T03n0190_047:0873a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是跋陀羅迦卑梨耶比丘尼，由於往昔生在彼大婆羅門家為女之時，於迦葉如來、三藐三佛陀所，施雜寶蓋；復以往昔在長者家為使女時，因施彼尊辟支佛食一飡飯故，而發願言：『願我所生，可憙端正，眾所樂見。』",
        "translation": "That Bhadrakapilā bhikṣuṇī had given a mixed-jewel cover to the Kāśyapa Tathāgata and Samyak-saṃbuddha when she was born as a daughter in that great brāhmaṇa's household and had vowed, 'May I be born in a place that's correct and pleasing to everyone,' because I had given a meal to that venerable pratyekabuddha when I was a messenger girl in that elder's household.",
        "source": "T03n0190_047:0873a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以彼業果因緣力故，生生之處，可憙端正，眾人樂觀，最勝最妙，為人所慕。",
        "translation": "Because of the power of the causes and conditions of that person's actions, the place of birth will be Jolly Correct, well-liked by many people, most excellent, and most wonderful, and admired by others.",
        "source": "T03n0190_047:0873a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣於彼時又復願言：『令我將來勿墮惡道。』",
        "translation": "At the time, he also vowed, 'So that I won't fall into a bad path in the future.'",
        "source": "T03n0190_047:0873a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是業報因緣力故，生生之處，不落三塗，於天人處，周旋往返，常受快樂。",
        "translation": "Because of the power of the causes and conditions of these karmic retributions, I'll be born in a place where I won't fall into the three destinies, and I'll go around to gods and humans and always experience happiness.",
        "source": "T03n0190_047:0873a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以於彼時，更乞願言：『令我將來願值如是教師或勝此者，從彼聞法，皆能領悟。』",
        "translation": "At the time, he also begged, 'May I wish to meet such a teacher or someone better than this in the future, and from there I'll hear the teaching and be able to understand it.'",
        "source": "T03n0190_047:0873a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是業報因緣力故，今得值我，復得出家，具足眾戒，亦復能得速疾神通。",
        "translation": "Because of the power of the causes and conditions of such karmic retribution, I've now been granted permission to leave home again, to complete the precepts, and to attain rapid psychic abilities.",
        "source": "T03n0190_047:0873a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我為授記：『於聲聞眾比丘尼中，得宿命通，最第一者，所謂跋陀羅迦卑梨耶比丘尼是也。』",
        "translation": "I'll give you this record: 'Among the śrāvaka monks and nuns, the one who has attained the supreme power of the knowledge of past lives is called the Bhadrakapilā monks and nuns.'",
        "source": "T03n0190_047:0873a17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘尼！",
        "translation": "Monks and nuns!",
        "source": "T03n0190_047:0873a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是跋陀羅迦卑梨耶，昔種善根，以彼善根因緣力故，是故跋陀羅迦卑梨耶比丘尼，今生富貴大婆羅門家，端正可憙，乃至於我聲聞之眾比丘尼中，憶往宿命，最為第一。」",
        "translation": "Bhadrakapilā had planted good roots in the past, and because of the power of the causes and conditions of those good roots, Bhadrakapilā was born into a wealthy, great brāhmaṇa family, which is correct and honorable, and is the best among my śrāvaka fellow monks and nuns in recollection of their past lives.\"",
        "source": "T03n0190_047:0873a20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，諸比丘白佛言：「世尊！",
        "translation": "It was then that the monks said to the Buddha, \"Bhagavān!",
        "source": "T03n0190_047:0873a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "希有婆伽婆！",
        "translation": "Hīnayū Bhagavān!",
        "source": "T03n0190_047:0873a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是跋陀羅迦卑梨耶比丘尼，隨順長老摩訶迦葉，得出家已，善能隨順出家之法。」",
        "translation": "This is the Bhadrakapilā monk and nun who followed the elder Mahākāśyapa and became a householder after leaving home, and he was well able to follow the rules for leaving home.\"",
        "source": "T03n0190_047:0873a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，佛告諸比丘言：「諸比丘！",
        "translation": "After he said this, the Buddha addressed the monks, saying, \"Monks!",
        "source": "T03n0190_047:0873a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是跋陀羅迦卑梨耶比丘尼，非但今世隨順摩訶迦葉出家，過去之世，亦復如是隨順出家。」",
        "translation": "This Bhadrakapilā monk and nun not only renounced the world in deference to Mahākāśyapa in this life, but also renounced the world in deference to past lives.\"",
        "source": "T03n0190_047:0873a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘白佛言：「世尊！",
        "translation": "The monks said to the Buddha, \"Bhagavān!",
        "source": "T03n0190_047:0873a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此事云何？",
        "translation": "What is this matter?",
        "source": "T03n0190_047:0873b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願為解說。」",
        "translation": "Please explain this for us.\"",
        "source": "T03n0190_047:0873b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「我念往昔，有一貧人，修營田業。",
        "translation": "The Buddha addressed the monks, \"I remember a time when there was a poor man who cultivated a farm.",
        "source": "T03n0190_047:0873b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時貧人婦，從家而出，以食餉夫。",
        "translation": "That poor woman left her house to feed her husband.",
        "source": "T03n0190_047:0873b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到一河邊，見一尊者辟支，跏趺樹下，端身正念，身心不動。",
        "translation": "When she got to the edge of a river, she saw a venerable Vaiśravaṇa sitting cross-legged under a tree, correctly mindful, and motionless in body and mind.",
        "source": "T03n0190_047:0873b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼貧婦，見辟支佛，心生清淨，合十指掌，頭頂禮足，敬意在前。",
        "translation": "When that poor woman saw Venerable Pārśva, her mind was purified, and she joined her palms with ten fingers, bowed her head at her feet, and paid homage to him.",
        "source": "T03n0190_047:0873b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其夫在田，遙見其婦，從家而出，入河岸下，不見渡處，即起心念：『誰在彼邊？",
        "translation": "Her husband, who was in the fields, saw her leaving his house and going down to the river bank, but he didn't see the crossing, so he thought, 'Who's over there?'",
        "source": "T03n0190_047:0873b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "共誰而住？",
        "translation": "Who do they dwell with?",
        "source": "T03n0190_047:0873b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於即不來，今我飢渴，甚大疲頓，思欲早至。』",
        "translation": "Now, I'm hungry and thirsty, and I'm very tired, so I want to get there sooner rather than later.'",
        "source": "T03n0190_047:0873b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，彼夫即便生大瞋恚，悵怏不樂，執杖向彼。",
        "translation": "Because of this, that man even became very angry and upset, and he took his staff and headed that way.",
        "source": "T03n0190_047:0873b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至彼處已，見辟支佛安坐禪定，見已即作如是思惟：『我婦今者與彼沙門，共為世事，決無疑也。』",
        "translation": "When he arrived there, he saw Pārśva sitting calmly in meditation, and after he saw him, he thought, 'Now, my wife and that ascetic will definitely not have any doubts about our worldly work together.'",
        "source": "T03n0190_047:0873b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時彼人生大瞋恨，以杖打彼婆私瑟吒尊者辟支佛。",
        "translation": "That man then became very angry and struck that Venerable Pārasīṭa Pratibhāna with a stick.",
        "source": "T03n0190_047:0873b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，辟支佛即從彼岸，以神通力，騰空飛行。",
        "translation": "Venerable Pārśva then came down from the other shore and flew through the air with his supernormal powers.",
        "source": "T03n0190_047:0873b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，彼貧婦即白夫言：『咄哉汝造如是大罪！",
        "translation": "\"The poor woman then said to her husband, 'Oh, you've done such a great crime!'",
        "source": "T03n0190_047:0873b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仙人無咎，以何義故橫生惱亂？",
        "translation": "\"The sage is blameless, but what is the reason for his being so disruptive?",
        "source": "T03n0190_047:0873b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此大仙，戒德具足，行於妙法，有大威德，具大神通。』",
        "translation": "Now, this great man has perfect moral virtue, practices the wonderful Dharma, has great authority, and possesses great supernormal powers.'",
        "source": "T03n0190_047:0873b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，貧人打辟支佛已，尋即生悔，既生悔已，即告婦言：『善哉姊妹！",
        "translation": "After striking the pratyekabuddha, the poor man looked into it and immediately repented, then he told the woman, 'Good, sister!",
        "source": "T03n0190_047:0873b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於今者，可共出家同修梵行。",
        "translation": "Now, you can leave home together and train in the religious practice.",
        "source": "T03n0190_047:0873b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0190_047:0873b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今是罪不可以少因緣除滅。』",
        "translation": "Now, this is a sin of mine that can't be removed by a few causes and conditions.'",
        "source": "T03n0190_047:0873b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婦即報夫作是言曰：『善哉聖子！",
        "translation": "The woman then reported this to her husband, saying, 'Good, noble son!",
        "source": "T03n0190_047:0873b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不敢違教。",
        "translation": "I dare not disobey the teaching.",
        "source": "T03n0190_047:0873b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今我二人，捨家出家。』",
        "translation": "Now, the two of us will leave home and renounce the world.'",
        "source": "T03n0190_047:0873b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼二人，齊心出家。",
        "translation": "Those two people then joined together with the same intention to leave home.",
        "source": "T03n0190_047:0873b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既出家已，二人修行，成就慈心，捨身命終，遂生梵處。",
        "translation": "After leaving home, they both cultivated their practice, accomplished kindness, and abandoned themselves to their lives, and were then born in a place of purity.",
        "source": "T03n0190_047:0873b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等比丘！",
        "translation": "You monks!",
        "source": "T03n0190_047:0873b25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T03n0190_047:0873b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于彼昔時，如是貧人，營田業者，豈異人乎？",
        "translation": "In the past, was this poor man different from those who worked in the fields?",
        "source": "T03n0190_047:0873b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩訶迦葉比丘是也。",
        "translation": "\"This is the monk Mahākāśyapa.",
        "source": "T03n0190_047:0873b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時貧人之婦，供養辟支佛，為夫餉食，乃至成就慈心，捨身命終生梵宮者，豈異人乎？",
        "translation": "Wouldn't that poor woman be different from someone who makes offerings to Pṛthivī, feeds her husband, and achieves kindness so that she gives up her life and is eventually born in the palace of Brahmā?",
        "source": "T03n0190_047:0873b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即跋陀羅迦卑梨耶比丘尼是也。",
        "translation": "That's the Bhadrakapilā bhikṣuṇī.",
        "source": "T03n0190_047:0873b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以於彼時隨夫出家故，於今者亦復隨逐摩訶迦葉出家，不違教也。」",
        "translation": "Because she left home with her husband then, she'll also leave home with Mahākāśyapa now, which is not contrary to the teaching.\"",
        "source": "T03n0190_047:0873b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛本行集經舍利目連因緣品第四十九上爾時，摩伽陀聚落去王舍城不遠，有一村柵，名那羅陀。",
        "translation": "At the time, there was a village in the village of Magadha, not far from Rājagṛha, named Nārada.",
        "source": "T03n0190_047:0873c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼村之中，有一巨富大婆羅門，名曰檀孃耶那(隋言吉至)，住在彼村。",
        "translation": "In the middle of that village, there was a very wealthy great Brāhmaṇa named Dānâkaraṇa (Sui term for Jiji) who lived in that village.",
        "source": "T03n0190_047:0873c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（又有師說：「彼婆羅門，名曰檀那達多(隋言財與)。」",
        "translation": "(Another teacher said, \"That brāhmaṇa is named Dānadatta (Sui word for wealth and possessions).\"",
        "source": "T03n0190_047:0873c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "）彼婆羅門，甚大巨富，多有資財，如毘沙門，一種無異。",
        "translation": ") That brāhmaṇa is very large and wealthy, with lots of possessions like a Vaiśravaṇa, which is not different.",
        "source": "T03n0190_047:0873c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼婆羅門，具有八子，其第一子，名曰優婆低沙；其第二子，名曰大膝；其第三子，名曰純陀；其第四子，名曰姜叉頡唎拔多；其第五子，名曰闡陀；第六名曰閻浮呵迦；第七名曰憍陳尼；第八名曰蘇達離舍那；是名八子。",
        "translation": "That brāhmaṇa has eight sons, the first of whom is named Upālippusā; the second is named Mahêśvara; the third is named Cunda; the fourth is named Kāñcake-Jeremybhadra; the fifth is named Cunda; the sixth is named Yambohākar; the seventh is named Kauṇḍinya; and the eighth is named Sudarśana; these are called the eight sons.",
        "source": "T03n0190_047:0873c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一女，名曰蘇尸彌迦，是女於彼波離婆闍外道法中，出家修道。",
        "translation": "Again, there was a woman named Susimika who left home and trained among the teachings of that non-Buddhist sect of Parivrāja.",
        "source": "T03n0190_047:0873c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（摩訶僧祇師復言：「彼婆羅門有七子，所謂第一名曰達摩，其第二者名曰蘇達摩，第三名曰優波達摩，其第四者名曰坻沙，第五名曰優波坻沙，第六名曰頡唎拔多，第七名曰優波波離拔多，是名七子。」",
        "translation": "(Mahāsāṃghika then replied, \"That Brāhmaṇa has seven sons, the first of whom is named Dharma, the second of whom is named Sudharma, the third is Upadharma, the fourth is named Heṣa, the fifth is Upathesa, the sixth is Jielibadu, and the seventh is Upāpālipatra; these are called the seven sons.\"",
        "source": "T03n0190_047:0873c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "）其優波坻沙摩那婆，於兄弟內最為處大，善能誦習，亦教他人，於四韋陀，莫不曉悟，誦習成就，善能解釋自餘諸論，所謂尼揵陀雞晝婆等，及其名字，一一能釋，明宿世事，巧能分別。",
        "translation": "(Upatissa Manabha was the greatest among his brothers, was able to recite well, taught others, understood none of the four Vedas, accomplished their recitation, and was skilled at explaining the rest of the treatises, which are called the Nirgrantha and Kukkuṭapāda, and their names, and could skillfully discern the events of prior lives.",
        "source": "T03n0190_047:0873c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於五明處，曉了無礙。",
        "translation": "In the five fields of knowledge, he understands them without obstruction.",
        "source": "T03n0190_047:0873c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "授記別論，縷練在心，六十四能具足成就，善能曉達大丈夫相。",
        "translation": "He was able to fully accomplish all 64 of them, and he was well able to comprehend the characteristics of a great person.",
        "source": "T03n0190_047:0873c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時摩那婆，本性柔軟，其心賢直，常懷慈悲，深厭世事，悔昔先罪，已於過去，多值諸佛，種諸善根，成就眾事，巧能熏習，常樂精勤，於食知足，厭背煩惱，向於涅槃，順理無礙，能惡諸有，眾行成就，朽壞結縛，至成熟地，唯一生在，聰明妙巧，細心思惟，明了諸法。",
        "translation": "Manabha, a gentle by nature and a good and upright man by heart, always compassionate, deeply disillusioned with worldly affairs, repenting of past sins, having met many buddhas in the past, planting good roots, accomplishing various tasks, skillfully perfuming, always delighting in diligence, satisfied with food, weary of leaving affliction behind, and headed for nirvāṇa, following principles without obstruction, capable of doing harm to all beings, accomplishing numerous actions, destroying bonds, reaching the stage of maturation, and being uniquely born, is intelligent, marvelous, and able to carefully contemplate and understand all dharmas.",
        "source": "T03n0190_047:0873c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子父母，營事家業，皆悉諮問，爾乃造作。",
        "translation": "The boy's parents consulted him about his family's business, and he then did the deed.",
        "source": "T03n0190_047:0874a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時王舍大城，去城不遠有一聚落，名拘離迦。",
        "translation": "At the time, there was a village not far from the great city of Rājagṛha called Kulika.",
        "source": "T03n0190_047:0874a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼村內，有一種姓大婆羅門居士，是大居士，依彼村住，大富饒財，乃至彼家，猶毘沙門天王宮殿，無有異也。",
        "translation": "In that village, there was a great brāhmaṇa of a certain family who lived in that village, became very wealthy, and had wealth up to his house, which was like the palace of Vaiśravaṇa, the king of gods, without any difference.",
        "source": "T03n0190_047:0874a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼婆羅門，產生一子，名拘離多，容顏端正，眾所樂觀，一切書論，皆悉通曉，復能教他，乃至能了丈夫之相。",
        "translation": "That brāhmaṇa gives birth to a son named Kolita, who has a handsome face that's well-liked by many people, fully comprehends all writings and discussions, and can teach others up to the point of understanding the characteristics of a husband.",
        "source": "T03n0190_047:0874a08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其優波坻沙童子，共為親友。",
        "translation": "That boy Upatiṣya was a close friend.",
        "source": "T03n0190_047:0874a10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼二人，互相愛念，常懷歡喜，和顏悅色，若少時別，大生愁惱。",
        "translation": "They were fond of each other, always rejoiced, and had pleasant countenances, whereas if they were separated for a short time, great sorrow would arise.",
        "source": "T03n0190_047:0874a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等往昔千生之中，愛戀相縛。",
        "translation": "In a thousand lifetimes past, they were bound by their love for each other.",
        "source": "T03n0190_047:0874a12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而有偈言：「宿世因果相熏習，　　二心展轉互相親，　以如是等愛心故，　　猶如蓮花生在水。",
        "translation": "There's a verse that says, \"As a result of the perfuming of causes and effects from prior lives, these two minds continue to be intimate with each other, and because of such loving states of mind, they're like the lotus blossom in water.",
        "source": "T03n0190_047:0874a13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　優波低沙拘離多，　　彼二遞互相愛敬，　若經少時不相見，　　腹中煩惋自懊惱。」",
        "translation": "Upatiṣya Kolita, those two hands love and respect each other, and if they don't see each other for a little while, the afflictions in their bellies will cause them to feel remorse.\"",
        "source": "T03n0190_047:0874a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛本行集經卷第四十七",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Volume 47",
        "source": "T03n0190_047:0874a18_0",
        "is_bad_quality": false
    }
]