[
    {
        "source_sentence": "佛本行集經卷第十一",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Volume 11",
        "source": "T03n0190_011:0701a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隋天竺三藏闍那崛多譯",
        "translation": "Sui Tianzhu Tripiṭaka Jñānagupta Translation",
        "source": "T03n0190_011:0701a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "姨母養育品第十",
        "translation": "Tenth Chapter of the Aunt's Nurture",
        "source": "T03n0190_011:0701a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時太子既以誕生，適滿七日，其太子母摩耶夫人，更不能得諸天威力，復不能得太子在胎所受快樂，以力薄故，其形羸瘦，遂便命終。",
        "translation": "\"After the prince had been born for seven days, his mother, Mrs. Māyā, couldn't obtain the power of the gods or the happiness that the prince had experienced in the womb, and because of her weakness, her body became emaciated, and she was killed.",
        "source": "T03n0190_011:0701a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「（或有師言：『摩耶夫人，壽命算數，唯在七日，是故命終。",
        "translation": "\"(Some masters say, 'Mrs. Māyā's life is counted to be only seven days long; therefore, her life ends.')",
        "source": "T03n0190_011:0701b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖然但往昔來常有是法，其菩薩生滿七日已，而菩薩母皆取命終。",
        "translation": "Although this was always the case in the past, after a bodhisattva was born for seven full days, the mother of the bodhisattva always ended up dead.",
        "source": "T03n0190_011:0701b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T03n0190_011:0701b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸菩薩幼年出家，母見是事，其心碎裂，即便命終。』",
        "translation": "It's because bodhisattvas leave home when they're young, and when their mothers see this, their hearts are broken, and they die.'",
        "source": "T03n0190_011:0701b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "）「（薩婆多師復作是言：『其菩薩母，見所生子，身體洪滿，端正可憙，於世少雙，既覩如是希奇之事未曾有法，歡喜踊躍，遍滿身中，以不勝故，即便命終。』",
        "translation": ") \"'Again, the sarvâstivāda teacher said, 'When that bodhisattva's mother sees that her child has been born with a body that's full and correct, and that's like few others in the world, she rejoices and rises up, filling her body with such marvelous things as have never been seen before, and because they're not surpassed, she's even taken to her death.'",
        "source": "T03n0190_011:0701b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "）「爾時，摩耶國大夫人命終之後，即便往生忉利天上。",
        "translation": ") \"At the time, the great man of the country of Māya was reborn in the Heaven of Trāyastriṃśa after his life ended.",
        "source": "T03n0190_011:0701b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生彼天已，即有勝妙無量無邊諸天婇女，左右圍繞，前後翼從，各各持於無量無邊供養之具、曼陀羅等，詣菩薩所，處處遍散。",
        "translation": "After he was born in that heaven, he was surrounded by a group of beautiful, measureless, and infinite gods and goddesses, surrounded by right and left, preceded and followed by their followers, each carrying measureless and infinite offerings and maṇḍalas, which they scattered everywhere to the bodhisattva.",
        "source": "T03n0190_011:0701b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為欲供養於菩薩故，從虛空下，漸漸而墜到於人間淨飯王宮。",
        "translation": "Because they wanted to make offerings to the bodhisattva, they descended gradually from the sky and reached the human palace of King Jīvaka.",
        "source": "T03n0190_011:0701b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到王宮已，語淨飯王，而作是言：『大王！",
        "translation": "When he arrived at the palace, he spoke to King Jōtoku and said, 'Great king!",
        "source": "T03n0190_011:0701b16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，我得善利，善生人間，我於往昔，胎懷於彼清淨眾生大王童子，滿足十月受於快樂，今我生於三十三天，還受快樂如前不異，彼樂此樂，一種無殊。",
        "translation": "You should know that I've attained good benefits, good people among men, and that in the past, I was conceived in the womb of that pure sentient being, the Great King Boy, and experienced happiness in the tenth month of its fulfillment.",
        "source": "T03n0190_011:0701b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T03n0190_011:0701b20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今已往，願莫為我受大憂苦。",
        "translation": "'From now on, may I not suffer great sorrow or distress for you.",
        "source": "T03n0190_011:0701b20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今已去，我更不生。』",
        "translation": "From now on, I won't be born again.'",
        "source": "T03n0190_011:0701b21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼摩耶，即以天身而說偈言：「『一切怨親平等心，　　精進勇猛無暫息，　　善思真如實諦理，　　念無錯亂有始終。",
        "translation": "Māya then spoke a verse in his celestial body, saying, 'All my enemies are equal in mind, their effort and courage lack respite, and they well consider the principle of true reality as it really is, so their mindfulness isn't misconstrued and has continuity.",
        "source": "T03n0190_011:0701b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　形體炳著真金容，　　諸根寂靜善調御，　　我子巧能說諸法，　　善行頂禮最勝尊。』",
        "translation": "His body is adorned with the true appearance of gold, his faculties are quiescent and well regulated, and my son is skilled in teaching the Dharma and well conducts himself in prostrating to the most honored one.'",
        "source": "T03n0190_011:0701b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時摩耶說此偈已，即便隱身忽然不現，還彼天宮。",
        "translation": "\"After speaking this verse, Māya then withdrew from his body and suddenly didn't appear, returning to his heavenly palace.",
        "source": "T03n0190_011:0701b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，淨飯王見其摩耶國大夫人命終之後，即便喚召諸釋種親年德長者，皆令雲集，而告之言：『汝等眷屬並是國親，今是童子嬰孩失母，乳哺之寄將付囑誰，教令養育使得存活？",
        "translation": "\"When King Jīvaka saw the great man of Māya's kingdom at the end of his life, he summoned a group of elders of great virtue who were relatives of the Śākyas to gather there and told them, 'Your dependents are relatives of the country.",
        "source": "T03n0190_011:0701b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰能依時看視瞻護？",
        "translation": "Who is able to watch and protect [them] at the right time?",
        "source": "T03n0190_011:0701c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰能至心令善增長？",
        "translation": "Who is it that has the heart to make goodness develop?",
        "source": "T03n0190_011:0701c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰能憐愍，愛如己生，携抱捧持？",
        "translation": "Who can have compassion for someone who loves you as you were born and carries you in their arms?",
        "source": "T03n0190_011:0701c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以慈心故，功德心故，歡喜心故。』",
        "translation": "out of kindness, out of merit, and out of joy.'",
        "source": "T03n0190_011:0701c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有五百釋種新婦，彼等新婦各各唱言：『我能養育，我能瞻看。』",
        "translation": "Then there were five hundred brides of the Śākyas, and each of them said, 'I can nurture and I can look after them.'",
        "source": "T03n0190_011:0701c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時釋種族語彼婦言：『汝等一切，年少盛壯，意耽色慾，汝等不能依時養育，亦復不能依法慈憐；唯此摩訶波闍波提，親是童子真正姨母，是故堪能將息養育童子之身，亦復堪能奉事大王。』",
        "translation": "The Śākyas then said to those women, 'All of you are young and vigorous, and you're addicted to sex and desire; you can't nurture them according to the seasons, and you can't have compassion according to the law; only this Mahāprajāpatī, who is the true aunt of the boy, is capable of nurturing the boy's body and serving the great king.'",
        "source": "T03n0190_011:0701c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸釋種一切和合，勸彼摩訶波闍波提，為母養育。",
        "translation": "All of those Śākyamuni seeds combined to encourage that Mahāprajāpatī to nurture his mother.",
        "source": "T03n0190_011:0701c12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，淨飯王即將太子，付囑姨母摩訶波闍波提，以是太子親姨母故，而告之言：『善來夫人！",
        "translation": "\"When he arrived, the king of Jīvaka entrusted his aunt Mahāprajāpatī, who was the prince's dear aunt, with the task of raising the prince, and he told her, 'Well done, madam!",
        "source": "T03n0190_011:0701c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是童子，應當養育，善須護持，應令增長，依時澡浴。』",
        "translation": "Thus, the boy should be nurtured, well guarded, made to grow, and bathed according to time.'",
        "source": "T03n0190_011:0701c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又別簡取三十二女，令助養育，以八女人擬抱太子，以八女人洗浴太子，以八女人令乳太子，以八女人令其戲弄。",
        "translation": "He also separately and simply took thirty-two women to help nurture him, using eight women to prepare to carry the prince, eight women to bathe him, eight women to nurse him, and eight women to play with him.",
        "source": "T03n0190_011:0701c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「其淨飯王，產生二子；一者太子，字悉達多；二名難陀。",
        "translation": "\"That Jīvaka King gave birth to two sons, a prince named Siddhârtha and a second named Nandha.",
        "source": "T03n0190_011:0701c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「其白飯王，亦有二子：第一名難提迦，第二名為婆提唎迦。",
        "translation": "\"The White Rice King also had two sons: the first, Nandika, and the second, Bhadrika.",
        "source": "T03n0190_011:0701c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「其斛飯王，亦有二子：第一名阿難多，第二名為提婆達多。",
        "translation": "\"The king of the dhāraṇīs also had two sons: the first, Ananta, and the second, Devadatta.",
        "source": "T03n0190_011:0701c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「甘露飯王，亦有二子：第一名為阿尼盧豆，第二名為摩訶那摩。",
        "translation": "\"The Amṛta-vana king also had two sons, the first of whom was Aniruddha, and the second was Mahānāma.",
        "source": "T03n0190_011:0701c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「淨飯王妹，名阿彌多質多[口*邏](隋言甘露味)，生於一子，名為底沙。",
        "translation": "\"The younger sister of the king of pure rice, named Amṛtôdastu[kou*lā] (Sui word for the taste of ambrosia), gave birth to a son named Tiṣya.",
        "source": "T03n0190_011:0701c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時摩訶波闍波提，太子姨母，白淨飯王作如是言：『謹依王勅，不敢乖違。』",
        "translation": "\"Mahāprajāpatī, the prince's aunt, then said to the King of Purified Rice, 'I'll obey the king's command; I dare not disobey it.'",
        "source": "T03n0190_011:0702a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時波闍波提依於王命，養育太子。",
        "translation": "Pājāpatī then relied on the king's order to raise the prince.",
        "source": "T03n0190_011:0702a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如日月，從初一日，至十五日，清淨圓滿，養育太子，亦復如是，漸漸增長。",
        "translation": "It's like the sun and moon, which are pure and full from the first day until the fifteenth day, nurturing the prince in a similar way that gradually grows.",
        "source": "T03n0190_011:0702a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復譬如尼拘陀樹，得種好地，而漸增長，後成大樹，太子如是，日日增長。",
        "translation": "It's also like the nyagrodha tree that attains good ground and gradually grows, becoming a large tree afterward, and the prince thus grows day by day.",
        "source": "T03n0190_011:0702a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從其太子出生已來，淨飯王家，日日增長一切財利，金銀珍寶，二足四足，無所乏少，而說偈言：「五穀及財寶，　　金銀諸衣服，　或造或不造，　　自然得充足。",
        "translation": "From the time the prince was born, the family of King Jōtan grew day by day to include all their wealth and possessions, gold and silver, and treasures, both two-legged and four-legged, with nothing lacking, and they spoke this verse, \"Grains and valuables, gold and silver, and other clothing, whether made or unmade, are naturally abundant.",
        "source": "T03n0190_011:0702a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　童子及慈母，　　乳酪酥常豐，　慈母少乳者，　　悉皆得盈溢。",
        "translation": "Milk and butter are always plentiful for children and loving mothers, and those whose mothers lack milk are all filled to overflowing.",
        "source": "T03n0190_011:0702a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，淨飯王所有怨讎，自然皆悉生平等心，平等心已，漸生親厚。",
        "translation": "\"Naturally, all of King Jōtan's enemies and enemies will become even-minded, and after they become even-minded, they'll gradually grow close to each other.",
        "source": "T03n0190_011:0702a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既生親厚，共王同心，即便牢固，一心一意，同願同行，風雨隨時，無諸災雹，亦無擾亂。",
        "translation": "Once that closeness had developed, they were united with the king, even though they were firm and single-minded, and they shared the same vows; at any time during rain or wind, there were no disasters or hailstorms, and they weren't disturbed.",
        "source": "T03n0190_011:0702a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "少種多收，彼諸苗稼，一切藥草，樹木園林，隨色長色，諸香豐足，隨味具味，依限成熟，終不過時，皆是太子威德力故。",
        "translation": "With a little planting and a lot of harvesting, their crops, all their medicinal plants, and the trees and groves that grow in color and shape, have an abundance of fragrance and taste, and ripen according to their limits, never lasting more than a short time, all because of the prince's authoritative power.",
        "source": "T03n0190_011:0702a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切城內，所懷妊者，安隱得生。",
        "translation": "In all the cities, those who are expecting are born in safety.",
        "source": "T03n0190_011:0702a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸人民，無眾疫橫，亦無夭死，以此太子威德力故。",
        "translation": "Also, there are no epidemics among the people, and they don't die young, because of the prince's authoritative power.",
        "source": "T03n0190_011:0702a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "側近所有一切人民，長者居士，各各自守，不相求及，無此求彼，彼當與我，設令因事，所須少多，貸換假借，彼應多與，不生是念，須若干者，即與若干。",
        "translation": "All the people nearby, the elders and householders, each guarding their own, don't seek each other out; if they don't seek this or that, they will give it to me, so that I may exchange a little or a lot for what's needed, and they will give a lot.",
        "source": "T03n0190_011:0702a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城內人民，各各相尊，孝養父母，敬事師長，以是太子威德力故。",
        "translation": "Each of the people in the city respects one another, dutifully supports their parents, and honors their teachers because of the prince's authoritative power.",
        "source": "T03n0190_011:0702a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦如往昔，如法行行，一切諸王，人民士庶，皆依法行，悉持十善，具足而行，國內無怖，五穀豐登，遠離飢儉。",
        "translation": "As in the past, he did according to the conduct of the Dharma, and all the kings and people did according to the Dharma, upholding the ten good qualities and performing them fully, so that there was no fear at home, the five grains were plentiful, and they were free from famine.",
        "source": "T03n0190_011:0702a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如是，淨飯王國，一切境內，無有飢儉，亦無驚怖。",
        "translation": "Thus and thus, in the kingdom of Pure Rice, there's no starvation or fear in any of its realms.",
        "source": "T03n0190_011:0702a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五穀豐饒，一切人民，如法而行，種種布施，作諸功德。",
        "translation": "The five grains are abundant, and all the people conduct themselves according to the Dharma, making all kinds of alms and merits.",
        "source": "T03n0190_011:0702b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "造諸園林，造諸大義井泉池渠，皆悉自現。",
        "translation": "They create parks and forests, and they create wells, springs, ponds, and ditches of great significance, all of which appear on their own.",
        "source": "T03n0190_011:0702b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天舍廟堂，曹局省府，皆亦自然。",
        "translation": "Heavenly mansions and temples, and the offices of the governor's office, all come into being naturally.",
        "source": "T03n0190_011:0702b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人無枉橫，一切人民，皆並歡喜，猶如天上，無有差殊。",
        "translation": "No one is in vain, and all the people rejoice, just as they do in heaven, with no distinctions.",
        "source": "T03n0190_011:0702b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以於太子威德力故，如是諸事，莫不成就。",
        "translation": "Because of the prince's authoritative power, none of these things are accomplished.",
        "source": "T03n0190_011:0702b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如偈所說：「『人民順尊教，　　不慳亦不惜，　　無不如法行，　　慈心不起殺。",
        "translation": "As the verse says, \"The people obey the venerable's teaching, not stingy or stingy, not acting contrary to the Dharma, and compassionately refraining from killing.",
        "source": "T03n0190_011:0702b06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　飢渴既得解，　　飲食皆充足，　　一切悉歡喜，　　並受如天樂。』",
        "translation": "Their hunger and thirst are quenched, their diet is plentiful, and they are all joyous and experience pleasure like the gods.'",
        "source": "T03n0190_011:0702b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，淨飯王過軫宿辰，取角宿日，為大子作眾寶瓔珞，所謂手腕指脛，釧鐶首飾，雜寶勝妙，華鬘頸繫。",
        "translation": "\"When King Jōtan passed the time of the evening assembly and took the day of the evening assembly, he made for his eldest son a multitude of jewelry, called wristlets, fingertips, ringlets, jewelry, and jewelry, and flower garlands around his neck.",
        "source": "T03n0190_011:0702b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種瓔珞，珠璣印文，指環臂璩腰珮，金縷為帶，金鈴寶網，種種摩尼，為莊嚴具，靴履革屣，雜寶莊嚴，其天寶冠，最勝殊妙。",
        "translation": "The various kinds of jewelry, beads, seals, finger rings, armlets, waist bands, gold thread belts, gold bells, and jewelry nets, all kinds of manis, are adorned with boots, shoes, and leather sandals, adorned with various treasures, and their heavenly jeweled crowns are most excellent and marvelous.",
        "source": "T03n0190_011:0702b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有五百釋種諸親，為於太子，各造一具，雜妙瓔珞，如上莊嚴，作已將詣淨飯王所，而白王言：『善哉大王！",
        "translation": "Furthermore, there were five hundred relatives of the Śākyas who had each made a single piece of jewelry for the prince, adorned as above, and were about to go to King Jīvaka after they had made it, saying to the king, 'Good, great king!",
        "source": "T03n0190_011:0702b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等所造，此妙瓔珞，七日七夜，唯願大王！",
        "translation": "We have created this wonderful necklace for seven days and nights, only the vows of the great king!",
        "source": "T03n0190_011:0702b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此瓔珞，莊嚴太子，當令我等不空疲勞。』",
        "translation": "Adorn the prince with this necklace, and it will keep us from being fruitless and weary.'",
        "source": "T03n0190_011:0702b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，淨飯王於其晨朝鬼宿之日，共一國師婆羅門，名優陀耶那，是優陀夷比丘之父，并及五百諸婆羅門，皆唱是言：『甚大吉祥。』",
        "translation": "On the day that King Jīvaka took his morning pilgrimage to the ghosts, he and a national preceptor named Udayana, the father of the monk Udayinī, and 500 other preceptors all said, 'That's very auspicious!'",
        "source": "T03n0190_011:0702b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "共將太子，至彼一園，名曰無垢清淨莊嚴。",
        "translation": "They all led the prince to a park there called the Vimalakīrti Pure Adornment.",
        "source": "T03n0190_011:0702b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往昔已來，貴之如塔。",
        "translation": "Since ancient times, it's been valued like a stūpa.",
        "source": "T03n0190_011:0702b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼園內，復有無量無邊百千一切眾生，男子婦人，童男童女，相喚雲會，集聚彼園，欲觀太子。",
        "translation": "Inside that park, another measureless and limitless hundred thousand sentient beings, men, women, boys, and girls summoned in clouds gathered in that park to look at the prince.",
        "source": "T03n0190_011:0702b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復更別駕一乘大車，載置種種瓔珞金銀飲食衣服，悉令充備，於迦毘羅城內，街術四衢道頭，及諸小巷，諸如是處，設大布施，高聲唱言：『凡所須者，皆悉給與。』",
        "translation": "They then drove a large chariot with a variety of ornaments, gold, silver, food, and clothing, all made ready, and set up a great offering in the city of Kapilavastu, along the four streets, at the head of the roads, in the alleys, and in places like this, shouting and saying, 'Give whatever you need.'",
        "source": "T03n0190_011:0702b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是駕在太子前行。",
        "translation": "Thus, he drove in front of the prince.",
        "source": "T03n0190_011:0702c01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有八千雜種音樂，作種種聲，虛空自雨無量無邊雜妙花雨。",
        "translation": "Again, there are 8,000 varieties of music that make various sounds, and the sky rains down a rain of measureless, limitless, and marvelous flowers.",
        "source": "T03n0190_011:0702c01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量百千諸女，皆以種種諸寶瓔珞，莊飾其身，在於閣上，或在高臺，或在却敵，或在城頭，及女牆邊，或城樓上，或窓牖中，或居堂脊，或立屋頭，手執諸華，觀看太子，以花逆散於太子前。",
        "translation": "Measureless hundreds of thousands of women adorn themselves in jewelry and ornaments, adorn themselves in pavilions, on high platforms, atop rivers, at the head of a city, near a woman's wall, on a castle, in a window, on the ridge of a hall, or at the head of a house, holding flowers in their hands as they look down on the prince and scatter them in reverse order before him.",
        "source": "T03n0190_011:0702c03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有八千諸天寶女，手執掃箒，身體莊嚴，在太子先，耘除道路。",
        "translation": "Then there were 8,000 goddesses with jewels, carrying brooms in their hands and adorned in their bodies, who plowed the path before the prince.",
        "source": "T03n0190_011:0702c07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切釋種眷屬諸親，並悉在於淨飯王側及太子前，次第而行。",
        "translation": "All of the Śākyas' retinues and relatives were present at the side of King Jīvaka and in front of the prince, marching in order.",
        "source": "T03n0190_011:0702c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時摩訶波闍波提，懷抱太子，安置膝上，坐輦乘中。",
        "translation": "\"Mahāprajāpatī then took the prince in his arms, placed him on his knees, and sat down in his carriage.",
        "source": "T03n0190_011:0702c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是種種無量無邊莊嚴備已，將引太子，往詣彼園。",
        "translation": "After these measureless and limitless adornments were prepared, he led the prince to the other park.",
        "source": "T03n0190_011:0702c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，國師優陀夷父，共彼五百諸婆羅門，人人各以無量無邊吉祥之言，稱讚太子。",
        "translation": "At the time, the state minister Udāyin and his father, along with 500 other priests, each praised the prince with measureless and limitless words of good fortune.",
        "source": "T03n0190_011:0702c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持諸瓔珞，繫太子身。",
        "translation": "They carried diadems and tied them around the crown prince's body.",
        "source": "T03n0190_011:0702c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "繫瓔珞已，太子身相，皆悉隱障，彼之瓔珞，並各昏暗，無復精光，猶如聚墨，不能照曜，無復光顯。",
        "translation": "After they were fastened, the prince's body was all obscured in appearance, and his jewelry was each dimmed and lacked radiance, like a mass of ink that doesn't shine and doesn't reveal light anymore.",
        "source": "T03n0190_011:0702c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如無價閻浮檀金，欲於其邊安置丸炭。",
        "translation": "It's like wanting to place a ball of coals beside priceless gold from the river running through the groves of jambu trees.",
        "source": "T03n0190_011:0702c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如是，彼諸瓔珞，繫太子已，猶如晝螢，不能自現，所有瓔珞，至太子身，不顯不現，不照不曜，亦復如是。",
        "translation": "Thus and so, after they are bound to the prince, those diadem jewels are like pārijāta fireflies that can't show themselves, and so are the jewels that reach the prince's body but don't show or shine or shine.",
        "source": "T03n0190_011:0702c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼人眾，見此太子，有如是等希奇之事未曾有法，各各唱言：『嗚呼嗚呼！",
        "translation": "When the crowd saw the prince, they each said, 'Whoo-hoo-hoo!'",
        "source": "T03n0190_011:0702c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "希有希有！』",
        "translation": "rare and rare!'",
        "source": "T03n0190_011:0702c22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各各歡笑，人人拍手，歌舞叫嘯，擲弄衣裳。",
        "translation": "Everyone laughed and clapped their hands, sang, danced, and shouted, and tossed their robes.",
        "source": "T03n0190_011:0702c22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時彼園內，有一天神，名曰離垢，然彼天神，在於虛空，隱身不現，而說偈言：「『假使此大地，　　及城邑聚落，　　山河諸樹木，　　皆成閻浮金。",
        "translation": "\"At the time, there was a celestial god named Licchavi in that garden, but he was up in space, concealed in his body, and spoke in verse, saying, 'Suppose this earth, its towns and villages, and its mountains and rivers and trees were all made of jambu gold.",
        "source": "T03n0190_011:0702c23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　佛一毛孔光，　　具足威德相，　　翳彼如聚墨，　　百福莊嚴滿。",
        "translation": "The Buddha's radiance from a single pore is so dignified that it completely covers them like a mass of ink, filling them with the adornment of a hundred merits.",
        "source": "T03n0190_011:0702c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　瓔珞光相滅，　　若人具諸相，　　第一勝報果，　　不須瓔珞嚴。』",
        "translation": "When the luminous aspect of a necklace ceases, if a person has all these characteristics, the first excellent reward is attained, and there's no need for a necklace to adorn.'",
        "source": "T03n0190_011:0703a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時彼天神，說此偈已，即持種種無量天花，散太子上，還其本宮。",
        "translation": "\"After speaking this verse, that celestial god carried a variety of measureless puffs of flowers, scattered them over the prince, and returned to his home palace.",
        "source": "T03n0190_011:0703a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，釋種諸親族等，即持無價碎末栴檀及細磨者，雜色牙席，雜種諸藥具滿諸器，持與太子，令莊嚴身。",
        "translation": "\"At that point, the Śākya clan and their kinsmen took priceless powdered sandalwood, finely polished sandalwood, seats of various colors, and a variety of medicines to fill their vessels, and gave them to the prince to adorn his body.",
        "source": "T03n0190_011:0703a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復持鹿車，真金為輿，種種船舫，諸雜野獸，乃至馬駒，雜寶所作，具施太子，恣令嬉戲。",
        "translation": "They also took a deer-drawn chariot, a mule made of genuine gold, boats of various kinds, wild animals of various kinds, and even a horse and stallion made of various treasures, and gave them to the prince to play with as he pleased.",
        "source": "T03n0190_011:0703a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具足八年，如是歡樂，娛樂太子，增長養育。",
        "translation": "For eight years, he was thus delighted, entertained the prince, and grew nurturing.",
        "source": "T03n0190_011:0703a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然其不似世之嬰孩流涕不淨，無諸糞穢，亦不呱啼呻吟嚬縮，不飢不渴，諸母養育常生歡喜。",
        "translation": "He wasn't like ordinary babies who are runny and unclean, have no excrement, don't wail and groan and shrink, don't hunger and thirst, and are always rejoicing when their mothers nurture them.",
        "source": "T03n0190_011:0703a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，淨飯王作是思惟：『今我太子，端正少雙，未知其力，竟復何如？",
        "translation": "\"Then, King Jīvaka thought, 'Now, my prince is correct and young, but I wonder what his powers are.",
        "source": "T03n0190_011:0703a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今可試看驗其強弱。』",
        "translation": "Now, you can examine it to test its strength.'",
        "source": "T03n0190_011:0703a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，大王即共無量釋種童子，同坐飲食，持一純金雕鏤之鉢，盛歡喜丸，具足充滿，復以真金作諸環鎖，置諸一切眾童子前，教令爭食。",
        "translation": "The king then sat down with an unlimited number of children of the Śākyas to eat together, took a bowl made of carved pure gold and filled it completely with joy balls, made rings of real gold, and placed them in front of all the children, telling them to compete for food.",
        "source": "T03n0190_011:0703a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復聚於諸小白象，令與童子共相競食，語諸一切眾童子言：『汝等當知！",
        "translation": "Again, he gathered a group of small white elephants and made them compete with the boys for food, saying to all the boys, 'You must know this!",
        "source": "T03n0190_011:0703a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是白象，將奪汝食。』",
        "translation": "Thus, the white elephants will snatch your food.'",
        "source": "T03n0190_011:0703a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸童子斷眾白象爭力不如，遂令象食，然後始語太子令知：『太子！",
        "translation": "After the boys had stopped the white elephants from competing for food, they made them eat, and then they began to tell the prince, 'Prince!",
        "source": "T03n0190_011:0703a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝食今被他奪。』",
        "translation": "Now, he's taken your food away from you.'",
        "source": "T03n0190_011:0703a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時太子，即以兩手執彼金鉢，出少身力而壞彼鏁，令象却頓不如太子。",
        "translation": "The prince then took his golden bowl in both hands and used a little of his physical strength to break its hold, causing the elephant to fall back below the prince.",
        "source": "T03n0190_011:0703a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，淨飯王復為太子，多集羝羊安置宮內，為令太子生歡喜故。",
        "translation": "\"Then, King Jōtan again gathered many billy goats for the prince and placed them in his palace, so that the prince might become delighted.",
        "source": "T03n0190_011:0703a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真金為鞍，雜寶莊飾，種種瓔珞，以嚴其身，金羅網覆。",
        "translation": "They were saddled with genuine gold, adorned with various jewelry, and adorned with various kinds of jewelry to adorn their bodies, and they were covered with a golden net.",
        "source": "T03n0190_011:0703a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時太子，乘彼羊車，至於園林。",
        "translation": "The prince then rode one of those goat carts to the garden.",
        "source": "T03n0190_011:0703a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及其親叔，甘露飯等，自餘諸釋，各為諸子莊諸羝羊，具足如前。",
        "translation": "He and his relatives and uncles, along with Amṛtôdana and the rest of the Śākyas, each decorated rams for his sons, complete with the aforementioned.",
        "source": "T03n0190_011:0703a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸童子，亦乘羊車隨意遊戲。",
        "translation": "Those boys also rode in the goat cart and played as they liked.",
        "source": "T03n0190_011:0703a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛本行集經習學技藝品第十一",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, entitled \"Learning the Arts and Crafts,\" paragraph 11",
        "source": "T03n0190_011:0703b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，淨飯王知其太子年已八歲，即會百官群臣宰相，而告之言：『卿等當知！",
        "translation": "\"Then, when he realized that his crown prince was eight years old, King Jōtan gathered a group of ministers and prime ministers and told them, 'You should know this!",
        "source": "T03n0190_011:0703b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今我化內，誰最有智？",
        "translation": "Who is the most intelligent person in my present incarnation?",
        "source": "T03n0190_011:0703b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰具技能，種種悉通，堪為太子作於師匠，教使學書及餘諸論？』",
        "translation": "Who has the skills and full comprehension of all kinds to serve as a teacher and smith for the prince and teach him to study books and other treatises?'",
        "source": "T03n0190_011:0703b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸臣等，即報王言：『大王！",
        "translation": "The ministers then reported to the king, saying, 'Great king!",
        "source": "T03n0190_011:0703b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，今有毘奢婆蜜多羅，善知諸論，最勝最妙，如是大師，堪教太子種種書論。』",
        "translation": "'You should know that there is now Vaiśravaṇa, who well knows the treatises, the most excellent and sublime, and who, like this, is a great teacher who can teach the prince various treatises.'",
        "source": "T03n0190_011:0703b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，淨飯王即遣使人召彼毘奢婆蜜多羅，而告之言：『尊者大師！",
        "translation": "The king of Jīvaka then sent an envoy to summon that man, Viśvabhūtarā, and told him, 'Venerable great teacher!",
        "source": "T03n0190_011:0703b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝能為我，教此太子一切技藝諸書論不？』",
        "translation": "Will you teach this prince all the arts and crafts and the treatises for me?'",
        "source": "T03n0190_011:0703b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時蜜多羅報言：『大王！",
        "translation": "Maitreya then reported, 'Great king!",
        "source": "T03n0190_011:0703b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謹依王命，我今堪能。』",
        "translation": "'I relied on the king's order, and now I'm capable of doing so.'",
        "source": "T03n0190_011:0703b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時淨飯王心生歡喜，即占好日善宿吉時，共大釋種耆舊有德，令其莊飾一切禮儀，種種所須悉令充備。",
        "translation": "Rejoicing in his heart, King Jōtan then divined a good day and an auspicious time, and together with a great group of elders of the Śākyas, he caused them to adorn themselves with all the rituals and make ready all the various necessities.",
        "source": "T03n0190_011:0703b11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復嚴五百諸釋種童，前後左右周匝圍繞，更復別有無量無邊童男童女，隨從太子，將昇學堂。",
        "translation": "He also decorated 500 Śākyamuni boys and girls, surrounded by them from front to back and from left to right, and there were measureless and limitless boys and girls who accompanied the prince as he ascended to the training hall.",
        "source": "T03n0190_011:0703b13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時彼大師毘奢蜜多，遙見太子威德力大，不能自禁，遂使其身，從座怱起，屈身頂禮於太子足，禮拜起已，四面顧視生大羞慚。",
        "translation": "\"When that great teacher Viśvāmitra saw from afar the prince's authority and strength, he couldn't help himself, so he made himself hurtle up from his seat, bend his body at his feet, bow at his feet to the prince, and after rising from his veneration, he looked around and felt a great sense of shame.",
        "source": "T03n0190_011:0703b15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時蜜多羅，生慙愧已，於虛空中，有一天子，名曰淨妙，從兜率宮，共於無量無邊最大諸天神王，恒常守護是大子者，在彼虛空，隱身不現而說偈言：「『世間諸技藝，　　及餘諸經論，　　此人悉能知，　　亦能教示他。",
        "translation": "When Maitrāyaṇa was overcome with shame, there appeared in space a divine son named Jingmiao, who had come from the palace of Tuṣita and was guarded constantly by measureless and limitless gods and goddesses, and who was hidden in space, saying, \"This person knows all the arts and crafts of the world and the rest of the sūtras and treatises, and he can teach them to others.",
        "source": "T03n0190_011:0703b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　是勝眾生者，　　隨順世間故，　　往昔久習來，　　今示從師學。",
        "translation": "This is a superior person among sentient beings who follows the world, who came from long-standing training in the past, and who now shows and trains with a teacher.",
        "source": "T03n0190_011:0703b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　出世所有智，　　諸諦及諸力，　　因緣所生法，　　生已及滅無。",
        "translation": "He has supramundane cognition of all truths and powers, and the things that arise from causes and conditions are produced and cease to exist.",
        "source": "T03n0190_011:0703b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一念知彼等，　　名色現不現，　　猶尚能證知，　　況復諸文字。』",
        "translation": "With a single thought, he knows them all, whether names and forms appear or not, and he can still realize them, so why wouldn't he know them in words?'",
        "source": "T03n0190_011:0703b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時天子說此偈已，以種種華，散太子上，即還本宮。",
        "translation": "\"After speaking this verse, the prince scattered various flowers on top of the prince and returned to his palace.",
        "source": "T03n0190_011:0703c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，淨飯王即持種種無價珍寶，以用布施諸婆羅門，復持種種百味飲食，施設眾座諸婆羅門，將是太子，付彼大師毘奢蜜多，留諸乳母，令侍太子，即還王宮。",
        "translation": "The king of pure rice then took various priceless treasures and used them to distribute to the brāhmaṇas, took various foods of various flavors, and set up seats for the brāhmaṇas. He entrusted this prince to that great teacher Vaiśāmidra, left his nursemothers to attend the prince, and returned to the palace.",
        "source": "T03n0190_011:0703c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，太子既初就學，將好最妙牛頭栴檀，作於書板，純用七寶莊嚴四緣，以天種種殊特妙香塗其背上，執持至於毘奢蜜多阿闍梨前，而作是言：『尊者闍梨，教我何書(元少一書)？",
        "translation": "\"At the time, the prince, having first entered training, made a writing tablet of the finest ox-head sandalwood, adorned it entirely with the four conditions of the seven jewels, smeared its back with the distinctive and wonderful fragrance of the gods, carried it up to Ajāta Saṃghamitra, and said, 'Venerable Ajāta Saṃghamitra, what book (originally a single book) did you teach me?'",
        "source": "T03n0190_011:0703c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或復梵天所說之書(今婆羅門書正十四音是)、佉盧虱吒書(隋言驢脣)、富沙迦羅仙人說書(隋言蓮花)、阿迦羅書(隋言節分)、瞢伽羅書(隋言吉祥)、耶寐(亡毘反)尼書(隋言大秦國書)、鴦瞿梨書(隋言指書)、耶那尼迦書(隋言駄乘)、娑伽婆書(隋言牸牛)、波羅婆尼書(隋言樹葉)、波流沙書(隋言惡言)、毘多荼書(隋言起屍)、陀毘荼國書(隋云南天竺)、脂羅低書(隋言裸形人)、度其差那婆多書(隋言右旋)、優伽書(隋言嚴熾)、僧佉書(隋言算計)、阿婆勿陀書(隋言覆)、阿[少/兔]盧摩書(隋言順)、毘耶寐奢羅書(隋言雜)、陀羅多書(烏場邊山)、西瞿耶尼書(無隋言)，珂沙書(疏勒)、脂那國書(大隋)、摩那書(斗升)、未荼叉羅書(中字)、毘多悉底書(尺)、富數波書(花)、提婆書(天)、那伽書(龍)、夜叉書(無隋語)、乾闥婆書(天音聲)、阿脩羅書(不飲酒)、迦婁羅書(金翅鳥)、緊那羅書(非人)、摩睺羅伽書(大蛇)，彌伽遮迦書(諸獸音)，迦迦婁多書(烏音)，浮摩提婆書(地居天)、安多梨叉提婆書(虛空天)、欝多羅拘盧書(須彌北)、逋婁婆毘提呵書(須彌東)、烏差波書(舉)、膩差波書(擲)、娑伽羅書(海)、䟦闍羅書(金剛)、梨伽波羅低梨伽書(往復)、毘棄(音牒)多書(食殘)、阿[少/兔]浮多書(未曾有)、奢娑多羅䟦多書(如伏轉)、伽那那䟦多書(算轉)、優差波䟦多書(舉轉)、尼差波䟦多書(擲轉)、波陀梨佉書(足)、毘拘多羅波陀那地書(從二增上句)、耶婆陀輸多羅書(增十句已上)、未荼婆哂尼書(中流)、梨沙耶娑多波恀比多書(諸仙苦行)、陀羅尼卑叉梨書(觀地)、伽伽那卑麗叉尼書(觀虛空)、薩蒱沙地尼山陀書(一切藥果因)、沙羅僧伽何尼書(總覽)、薩婆婁多書(一切種音)。』",
        "translation": "或復梵天所說之書(今婆羅門書正十四音是)、佉盧虱吒書(隋言驢脣)、富沙迦羅仙人說書(隋言蓮花)、阿迦羅書(隋言節分)、瞢伽羅書(隋言吉祥)、耶寐(亡毘反)尼書(隋言大秦國書)、鴦瞿梨書(隋言指書)、耶那尼迦書(隋言駄乘)、娑伽婆書(隋言牸牛)、波羅婆尼書(隋言樹葉)、波流沙書(隋言惡言)、毘多荼書(隋言起屍)、陀毘荼國書(隋云南天竺)、脂羅低書(隋言裸形人)、度其差那婆多書(隋言右旋)、優伽書(隋言嚴熾)、僧佉書(隋言算計)、阿婆勿陀書(隋言覆)、阿[少/兔]盧摩書(隋言順)、毘耶寐奢羅書(隋言雜)、陀羅多書(烏場邊山)、西瞿耶尼書(無隋言)，珂沙書(疏勒)、脂那國書(大隋)、摩那書(斗升)、未荼叉羅書(中字)、毘多悉底書(尺)、富數波書(花)、提婆書(天)、那伽書(龍)、夜叉書(無隋語)、乾闥婆書(天音聲)、阿脩羅書(不飲酒)、迦婁羅書(金翅鳥)、緊那羅書(非人)、摩睺羅伽書(大蛇)，彌伽遮迦書(諸獸音)，迦迦婁多書(烏音)，浮摩提婆書(地居天)、安多梨叉提婆書(虛空天)、欝多羅拘盧書(須彌北)、逋婁婆毘提呵書(須彌東)、烏差波書(舉)、膩差波書(擲)、娑伽羅書(海)、䟦闍羅書(金剛)、梨伽波羅低梨伽書(往復)、毘棄(音牒)多書(食殘)、阿[少/兔]浮多書(未曾有)、奢娑多羅䟦多書(如伏轉)、伽那那䟦多書(算轉)、優差波䟦多書(舉轉)、尼差波䟦多書(擲轉)、波陀梨佉書(足)、毘拘多羅波陀那地書(從二增上句)、耶婆陀輸多羅書(增十句已上)、未荼婆哂尼書(中流)、梨沙耶娑多波恀比多書(諸仙苦行)、陀羅尼卑叉梨書(觀地)、伽伽那卑麗叉尼書(觀虛空)、薩蒱沙地尼山陀書(一切藥果因)、沙羅僧伽何尼書(總覽)、薩婆婁多書(一切種音)。』",
        "source": "T03n0190_011:0703c11_1",
        "is_bad_quality": true
    },
    {
        "source_sentence": "「爾時太子說是書已，復諮蜜多阿闍梨言：『此書凡有六十四種，未審尊欲教我何書？』",
        "translation": "\"After he had spoken about this book, the prince then consulted the Maitreya Ajari, saying, 'There are sixty-four kinds of this book; may I ask what book your Holiness would like to teach me?'",
        "source": "T03n0190_011:0704a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時毘奢婆蜜多羅，聞於太子說是書已，內心歡喜，悅豫熈怡，密懷私慙，折伏貢高我慢之心，向於太子，而說偈言：「『希有清淨智慧人，　　善順於諸世間法，　　自已該通一切論，　　復更來入我學堂。",
        "translation": "After hearing the prince teach this book, Viśvāmitra was delighted and encouraged at heart, confessed his selfishness, subdued his arrogant and conceited mind, and addressed the prince in verse, saying, \"Rarely does a pure and wise man well conform to the teachings of the world, who himself has knowledge of all the treatises, and then comes back to my study hall.",
        "source": "T03n0190_011:0704a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如是書名我未知，　　其今悉皆誦持得，　　是為天人大尊導，　　今復更欲覓於師。』",
        "translation": "I didn't know the names of such books, but now they've all been recited and memorized, and this is the great venerable guide of the gods, who now wants to find a teacher again.'",
        "source": "T03n0190_011:0704a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，復有五百釋種諸臣童子，俱共太子，齊入學堂學書唱字，以是太子威德力故，復有諸天神力加故，諸音響中出種種聲。",
        "translation": "\"At the time, another five hundred ministers of the Śākyas joined the prince in the study hall to learn how to write and sing the scriptures, and because of the prince's authoritative power and the superknowledges of the gods, various sounds emerged from the music.",
        "source": "T03n0190_011:0704a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱阿字時，諸行無常，出如是聲。",
        "translation": "\"When he sings the letter a, these sounds arise from the impermanence of conditioned phenomena.",
        "source": "T03n0190_011:0704a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱伊字時，一切諸根門戶閉塞，出如是聲。",
        "translation": "\"When the word i is called, these sounds arise from the shutting down of the doors of all the faculties.",
        "source": "T03n0190_011:0704a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱優字時，心得寂定，出如是聲。",
        "translation": "\"When the word u is sung, this is the sound that arises from the calmness and concentration of mind.",
        "source": "T03n0190_011:0704a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱㖶字時，諸六入道皆證知故，出如是聲。",
        "translation": "\"When the word 'b' is called, these six paths of entry are all realized, and this sound arises.",
        "source": "T03n0190_011:0704a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱嗚字時，當得渡於大煩惱海，出如是聲。",
        "translation": "\"When the word Ṛ is sung, the great ocean of affliction will be crossed, and such a sound will arise.",
        "source": "T03n0190_011:0704a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱迦字時，當受諸有業報所作，出如是聲。",
        "translation": "\"When the word ka is sung, this is the sound that will result from the results of all the karmic activities that exist.",
        "source": "T03n0190_011:0704a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱佉字時，教拔一切煩惱根本，出如是聲。",
        "translation": "\"When the word kha is called, it teaches that the root of all afflictions will be removed, and such a sound arises.",
        "source": "T03n0190_011:0704a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱伽字時，十二因緣甚深難越，出如是聲。",
        "translation": "\"When the word ga is called, these twelve causes and conditions are too profound to surpass, and such a sound arises.",
        "source": "T03n0190_011:0704a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱[口*恒]字時，諸無明蓋覆翳甚厚，當淨除滅，出如是聲。",
        "translation": "\"When the word [mouth*high] is called, the hindrances of ignorance cover them so deeply that they will be purified and removed, and such a sound arises.",
        "source": "T03n0190_011:0704a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱俄字時，如來當得成佛道已，至餘諸方，恐怖眾生施與無畏，出如是聲。",
        "translation": "\"When the word 'Russia' is called, the Tathāgata will attain the Buddha Way and go to other lands, terrorizing sentient beings and bestowing fearlessness, and such a sound will arise.",
        "source": "T03n0190_011:0704a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱遮字時，應當證知四真聖諦，出如是聲。",
        "translation": "\"When the word chai is called, this is the sound that will arise from the realization of the four true noble truths.",
        "source": "T03n0190_011:0704b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱車字時，今者應當所有諂曲邪惑意迷皆悉除滅，出如是聲。",
        "translation": "\"When the word chariot is called, this person should have all flattery, wrong mental disturbances, and delusions removed, and such a sound should arise.",
        "source": "T03n0190_011:0704b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱闍字時，應當超越出生死海，出如是聲。",
        "translation": "\"When the word 'chariot' is called, this person should transcend the ocean of birth and death, and such a sound should arise.",
        "source": "T03n0190_011:0704b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱社字時，魔煩惱幢當碎破倒，出如是聲。",
        "translation": "\"When the word 'community' is called, the banner of demonic afflictions will be broken down and collapsed, and such a sound will arise.",
        "source": "T03n0190_011:0704b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱若字時，當令四眾皆順教行，出如是聲。",
        "translation": "\"When the word wisdom is called, it will cause the four groups of people to conform to the teachings and conduct themselves, producing a sound like this.",
        "source": "T03n0190_011:0704b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱吒字時，其諸凡夫一切眾生，處處畏敬此言無常，出如是聲。",
        "translation": "\"When the word ṭa is called, this word's impermanence will be feared by all ordinary people and sentient beings everywhere, and such a sound will arise.",
        "source": "T03n0190_011:0704b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱咤字時，應當憶念此之咤字，若根純熟不聞諸法即得證知，出如是聲。",
        "translation": "\"When the word tha is called, this tha character should be recalled, and if the faculties are ripe, the unheard teachings will be realized, and such a sound will arise.",
        "source": "T03n0190_011:0704b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱荼字時，應當得彼四如意足即能飛行，出如是聲。",
        "translation": "\"When you sing the word da, you should attain those four miraculous powers, which enable you to fly, and it produces a sound like this.",
        "source": "T03n0190_011:0704b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱[口*荼]字時，作合歡華如[口*荼]言語，散唱諸行及十二緣生滅之法無常顯現，出如是聲。",
        "translation": "\"When the word [mou*dha] is called, it's a combination of joyful flower [mou*dha] speech and loose chanting about the impermanence of conditioned formations and the twelve arising and ceasing dharmas, which gives rise to such sounds.",
        "source": "T03n0190_011:0704b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱拏字時，其得道人受利養時，無一微塵等諸煩惱而不散滅，堪應他供，出如是聲。",
        "translation": "\"When he sings the word na, when he receives the benefits of the path, there's not a single particle of affliction that doesn't dissipate, and he's capable of making offerings to others, and he produces a sound like this.",
        "source": "T03n0190_011:0704b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱多字時，當向苦行，出如是聲。",
        "translation": "\"When the word many is called, this is the sound that arises when he's headed toward ascetic practices.",
        "source": "T03n0190_011:0704b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱他字時，一切眾生其心若斧，諸塵境界猶如竹木，當作是觀，出如是聲。",
        "translation": "\"When the word others is called, suppose all sentient beings whose minds are like axes and whose objects are like wood and bamboo were contemplated like this, and such a sound would arise.",
        "source": "T03n0190_011:0704b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱陀字時，當行布施行諸苦行即得和合，出如是聲。",
        "translation": "\"When the word da is called, these ascetic practices will be carried out, and then they'll be combined, producing a sound like this.",
        "source": "T03n0190_011:0704b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱咃字時，當有法聲，出如是聲。",
        "translation": "\"When the word thaumaturge is called, there will be the sound of the Dharma, which produces this sound.",
        "source": "T03n0190_011:0704b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱哪字時，當須用彼食飲活命，出如是聲。",
        "translation": "\"When the word 'which' is sung, it's necessary to use that food and drink to live, and it produces a sound like this.",
        "source": "T03n0190_011:0704b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱簸字時，真如實諦，出如是聲。",
        "translation": "\"When the word 'bump' is called, the true reality will arise, and it will sound like this.",
        "source": "T03n0190_011:0704b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱頗字時，當得成道證於妙果，出如是聲。",
        "translation": "\"When the word 'will' is sung, the person will attain the path and realize its marvelous fruit, and it sounds like this.",
        "source": "T03n0190_011:0704b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱婆字時，解一切縛，出如是聲。",
        "translation": "\"When the word va is sung, it frees him from all bonds and sounds like this.",
        "source": "T03n0190_011:0704b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱嘙字時，說世間後更不受有，出如是聲。",
        "translation": "\"When the word śramaṇa is called, it's said that the world will no longer be subject to existence, and such a sound arises.",
        "source": "T03n0190_011:0704b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱摩字時，說諸生死一切恐怖最為可畏，出如是聲。",
        "translation": "\"When the word mo is called, it teaches that all the terrors of birth-and-death are most fearful, and such a sound arises.",
        "source": "T03n0190_011:0704b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱耶字時，開穿一切諸法之門為人演說，出如是聲。",
        "translation": "\"When the word yah is called, it opens the door to all dharmas and explains them to people, and such a sound arises.",
        "source": "T03n0190_011:0704c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱囉字時，當有三寶，出如是聲。",
        "translation": "\"When the word 'rā' is called, these are the sounds that will arise from the future existence of the Three Treasures.",
        "source": "T03n0190_011:0704c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱邏字時，斷諸愛枝，出如是聲。",
        "translation": "\"When the word ārā is sung, it cuts off the bonds of craving and produces a sound like this.",
        "source": "T03n0190_011:0704c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱婆字時，斷一切身根本種子，出如是聲。",
        "translation": "\"When the word va is sung, it cuts off all the fundamental seeds of the body, and such a sound arises.",
        "source": "T03n0190_011:0704c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱[口*奢]字時，得奢摩他、毘婆舍那，出如是聲。",
        "translation": "\"When the word [mouth*she] is sung, this is the sound that arises from attaining calm abiding and vipaśyanā.",
        "source": "T03n0190_011:0704c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱沙字時，當知六界，出如是聲。",
        "translation": "\"When the word śa is sung, you'll know the six elements, and this sound will arise.",
        "source": "T03n0190_011:0704c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱娑字時，當得諸智，出如是聲。",
        "translation": "\"When the word sah is sung, knowledge of the cognitive faculties will be attained, and such sounds will arise.",
        "source": "T03n0190_011:0704c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唱嗬字時，當打一切諸煩惱却，出如是聲。",
        "translation": "\"When the word ho is sung, it will strike down all the afflictions and make such a sound.",
        "source": "T03n0190_011:0704c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼諸五百童子，作如是唱諸字門時，以是太子威德力故，兼復諸天護持所加，出於如是微密祕奧諸法門聲。",
        "translation": "\"When those five hundred boys thus sang the words, the prince's authoritative power and the support of the gods produced such a sound as this subtle, mysterious approach to the teaching.",
        "source": "T03n0190_011:0704c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，淨飯王又復集聚群臣議言：『卿諸臣等！",
        "translation": "\"At the time, King Jōtan also gathered a group of ministers and said, 'Ministers!",
        "source": "T03n0190_011:0704c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切誰知，何處有師，最便武技善巧軍戎兵仗智略，堪教於我悉達大子？』",
        "translation": "Who among you knows where there's a teacher who's most skilled in martial arts, adroit in military arts, and wise in military warfare who can teach us, the great son Siddhârtha?'",
        "source": "T03n0190_011:0704c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸臣等，奉報王言：『大王！",
        "translation": "The ministers then reported to the king, saying, 'Great king!",
        "source": "T03n0190_011:0704c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，此處有釋，名為善覺，其善覺子，羼提提婆(隋言忍天)，堪教太子兵戌法式。",
        "translation": "You should know that there's an explanation here named Sunetra, whose Sunetra son, Kṣāntivādin (Sui word for god of patience), is capable of teaching the prince's troops the ways of the world.",
        "source": "T03n0190_011:0704c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其所解知，一切凡有二十九種，善巧善妙，技術精微，所作輕便，勁捷勦勇。",
        "translation": "He understands that there are 29 kinds of them, which are skillful, subtle, technically refined, easy to perform, and powerfully courageous.",
        "source": "T03n0190_011:0704c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十九者，所謂騰象跨車，跳坎越馬，射妙走疾，志猛性剛，身體輕便，所為諦審，善能調習，捉象搭鈎，巧解安施，擲象羂索，又工將養，飲飼畜生，處分指撝，善總兵馬，諳練曲直，斜正山川，手握拳牢，脚蹋地穩，梳頭結髻，靳固甚牢，能破能開，能劈能斬，射不虛落，挽[革*卬]無雙，遙聞響聲，射即懸著，所放之處，箭入甚深，黠慧聰明，辭清辯捷，謀謨策算，巧解多知，討古論今，方便善詐。",
        "translation": "The twenty-nine are those who mount elephants and straddle chariots, leap over obstacles and horses, shoot well and walk quickly, have a fierce will and a strong nature, are physically adept, scrutinize what they do, are well trained, catch elephants in hooks, skillfully understand security, toss elephants in a noose, work as a general, feed animals, handle Hugh Hugh, skillfully compose armies and horses, know how to bend and straighten, slant mountains and rivers, hold their fists firmly, step on the ground with their feet, comb their heads and tie their topknots, become very strong, are able to break open and slash, shoot in vain, pull [ge*ang] without equal, shoot from a distance and hang, shoot where an arrow enters deeply, are smart and intelligent, are quick with eloquence and eloquence, plot and calculate, skillfully understand and know much, discuss the past and present, and are skillful and deceptive with their abilities.",
        "source": "T03n0190_011:0704c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸如是等，所有兵家祕要神能，悉皆通達，唯應是彼乃可堪教大王太子一切戎技。』",
        "translation": "Such are all the secrets and superknowledges of military skill, and they alone could teach the prince all his military skills.'",
        "source": "T03n0190_011:0704c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，淨飯王聞是語已，心大歡喜，即勅諸臣，令喚忍天。",
        "translation": "\"When he heard those words, King Jōtan was overjoyed and commanded his ministers to summon the Patience God.",
        "source": "T03n0190_011:0705a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其忍天至，王勅之言：『羼提提婆！",
        "translation": "When he arrived, the king commanded them, 'Kṣāntivādin!",
        "source": "T03n0190_011:0705a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝能教我悉達太子戎仗智不？』",
        "translation": "Can you teach me the wisdom of the princely warrior Siddhârtha?'",
        "source": "T03n0190_011:0705a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時忍天，即白王言：『臣甚能教。』",
        "translation": "The god Patience then said to the king, 'I'm quite capable of teaching you.'",
        "source": "T03n0190_011:0705a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王復勅言：『汝若知時，好教我子，令得成就。』",
        "translation": "The king then commanded him, 'If you know the time, teach my son well and make him achieve it.'",
        "source": "T03n0190_011:0705a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，淨飯王為於太子，欲遊戲故，造一園苑，名曰勤劬。",
        "translation": "Then, for the sake of the prince, King Jīvaka wanted to play, so he built a park called 'Añjali.'",
        "source": "T03n0190_011:0705a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時太子，入彼苑內，遊戲歡娛，或令按摩。",
        "translation": "The prince then went into that garden, played and enjoyed himself, or had his body massaged.",
        "source": "T03n0190_011:0705a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼五百諸釋種臣，悉為其兒，各造園苑，擬以戲笑，按摩遨遊。",
        "translation": "Five hundred ministers of the Śākyas then each made a garden for their sons, intending to play, laugh, and massage them.",
        "source": "T03n0190_011:0705a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時忍提婆，將引太子入勤劬園，教戎仗智；彼諸釋種，各各自入其園苑中，遊戲學習。",
        "translation": "Nandika was about to lead the prince into the garden of Aṅgulimāla to teach him the wisdom of warfare, and each of those ascetics went into his own garden to play and learn.",
        "source": "T03n0190_011:0705a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時忍提婆，將其數種兵戎器仗，欲教太子。",
        "translation": "Nandika then gave the prince several kinds of weapons and armaments to teach him.",
        "source": "T03n0190_011:0705a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子見已，悉皆棄捨，即語忍天，作如是言：『汝教其餘諸釋種子，我自解此，不須更學。』",
        "translation": "After he saw them, the prince discarded them all and said to Nandika, 'Teach the other Śākyamuni sons, for I myself understand them and don't need to learn them anymore.'",
        "source": "T03n0190_011:0705a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時忍提婆，即以教於其餘釋種此戎仗智。",
        "translation": "Nandika Deva then taught the other Śākyamuni seeds this wisdom of how to fight.",
        "source": "T03n0190_011:0705a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼學已，不久人人悉得成就二十九種，並皆通達。",
        "translation": "Soon after they had studied it, everyone had accomplished twenty-nine kinds, and they all comprehended them.",
        "source": "T03n0190_011:0705a16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂騰跳白象車馬，乃至挽強，於一切處，皆成就得最第一智，輕便最能，聰明智慧。",
        "translation": "They called them white elephants, chariots, horses, and trolleys, and they all attained the greatest knowledge, the easiest and most powerful, and the wisdom of intelligence in every place.",
        "source": "T03n0190_011:0705a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如是等諸王技中，最善最勝，所謂書算，解諸計數，雕刻印文，宮商律呂，舞歌戲笑，[馬*((乖-北+(人*人))/山)](士洽反)[齒*咸](魚洽反)漫談，或造諸珍，瓌奇異寶，染衣出色，圖畵草葉，種種諸事，和合薰香，或弄手筆，草正諸書，能制文章，又復能於白象背上，能迴能轉，旋鞍騙(芳面反)馬，所有象駝，頭項尾脚，種種諸技，並悉便能。",
        "translation": "Among these kingly skills, the most skillful and superior are those that involve writing and arithmetic, understanding calculations, engraving and sealing, palace music, music, song, dance, laughter, [horse*((not applicable - north + (person*person))/san)] (Shiqia) [teeth*ham] (Yuqia) conversation, creating treasures, exquisite jewels, dyeing robes and excelling, painting grass and leaves, various things, combining and perfuming, using a brush, copying books, and producing writings.",
        "source": "T03n0190_011:0705a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又於車邊，亦善巧弄，出諸異法，刀槊弓箭，身中得悉，意氣容與，相撲拗腕，捔力稱斤，按摩築擠(耻皆反)，拗脛搦臂。",
        "translation": "At the side of the chariot, he's also skilled at manipulating different things, producing swords, lances, bows, and arrows, all of which he can master in his body, allowing his mind and energy to flow together, lashing out at each other's wrists, jostling for strength, weighing pounds, massaging, crushing, and bending his shins and arms.",
        "source": "T03n0190_011:0705a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能擲能走，乃至不空，及聞聲射，入[革*卬]挽強，箭連如雨。",
        "translation": "He can toss and walk, even to the point of not being empty, and when he hears a sound, he shoots, enters [Ge*ang], pulls strong, and rains arrows.",
        "source": "T03n0190_011:0705a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子於此，一切諸技，皆悉棄捨，更不肯學，云：『我自解，何假須教？』",
        "translation": "At this point, the prince abandoned all of his skills and refused to learn them, saying, 'I understand them myself, why do I need to be taught?'",
        "source": "T03n0190_011:0705b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復欲教習諸王要法，所謂天文祭祀占察，懸射前事，謬語巧誦，知諸獸音，達於聲論，造作諸技，因伎報答，呪術雜事，十餘種名，治化古先，一切書典，教於太子，及自他釋亦如是教。",
        "translation": "He also wants to teach the kings the essentials, which are astronomy, sacrifices, divination, forensic surveying, archery, recitation of incorrect speech, knowledge of animal sounds, mastery of sound theory, creation of skills, response to causal techniques, miscellaneous spells, more than ten kinds of names, ancient scriptures for governing and transforming, and all scriptures, to the prince, and to teach his own interpretation and that of others as well.",
        "source": "T03n0190_011:0705b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復世人，積年累月所學問者，或成不成，彼等眾技，一切諸論，太子能於四年之中，及餘釋種，皆悉學得通達無礙，一切自在。",
        "translation": "Furthermore, there are people who learn and question things over the years, whether they accomplish them or not, but within four years, the prince was able to learn all of those skills and all of those treatises, and he was able to understand them all without obstruction and with complete freedom.",
        "source": "T03n0190_011:0705b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時忍天，即為太子，而說偈言：「『汝於年幼時，　　安庠而學問，　　不用多功力，　　須臾而自解。",
        "translation": "Then, the god Patience spoke a verse for the prince, saying, 'When you were a young boy, you studied and learned in comfort, and you understood it yourself in a moment without much effort.",
        "source": "T03n0190_011:0705b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於少日月學，　　勝他多年歲，　　所得諸技藝，　　成就悉過人。』",
        "translation": "In the few days and months of your training, you surpassed the many years of others, and the skills you acquired were surpassed by those of others.'",
        "source": "T03n0190_011:0705b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛本行集經卷第十一",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Volume 11",
        "source": "T03n0190_011:0705b15_0",
        "is_bad_quality": false
    }
]