[
    {
        "source_sentence": "佛本行集經卷第六",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Volume 6",
        "source": "T03n0190_006:0677c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隋天竺三藏闍那崛多譯",
        "translation": "Sui Tianzhu Tripiṭaka Jñānagupta Translation",
        "source": "T03n0190_006:0677c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上託兜率品下",
        "translation": "Gaṇḍuvana, Tuṣita, and Vasubandhu",
        "source": "T03n0190_006:0677c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，兜率天眾之中，有一天子，名曰金團，往昔已來，數曾下到閻浮提地。",
        "translation": "\"At the time, there was a celestial among the Tuṣita gods named Golden Corps who had frequently descended to the land of Jambudvīpa since ancient times.",
        "source": "T03n0190_006:0677c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護明知已，告金團言：『金團天子！",
        "translation": "Knowing this, Guoming addressed the golden mass, saying, 'Golden mass, celestial son!",
        "source": "T03n0190_006:0677c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝數下至閻浮提中，汝應知彼城邑聚落諸王種族。",
        "translation": "'As you descend often into Jambudvīpa, you should know the types of kings in those cities and villages.",
        "source": "T03n0190_006:0677c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一生菩薩，當生何家？』",
        "translation": "What family will a once-returning bodhisattva be born into?'",
        "source": "T03n0190_006:0677c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金團天子報言：『尊者！",
        "translation": "The golden-encrusted prince reported, 'Venerable!",
        "source": "T03n0190_006:0677c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我甚知之，尊者善聽，我今當說。』",
        "translation": "I know it well, honored one, and I will explain it now.'",
        "source": "T03n0190_006:0677c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護明言：『善。』",
        "translation": "The guardian of the luminaries said, 'Good.'",
        "source": "T03n0190_006:0677c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金團說言：『此之三千大千世界，有一菩提道場處所，在彼閻浮摩伽陀國境界之內，是昔諸王成阿耨多羅三藐三菩提處。",
        "translation": "The golden mass said, 'In this world of 3,000 great one-thousand worlds, there's a site of the enlightenment path that's within the borders of that country of Jambudvīpa Magadha, and it's where the kings of yore achieved supreme perfect enlightenment.'",
        "source": "T03n0190_006:0677c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者護明！",
        "translation": "Venerable Hosomin!",
        "source": "T03n0190_006:0677c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼中有河名為恒河，其河南岸，有於一山，是舊仙人所居停處，然其彼處名毘闍羅，亦名般荼婆毘富羅，耆闍崛山，共相圍繞，以為眷屬。",
        "translation": "\"In the midst of that river, there's a river named Ganges, and on the south bank of its river there's a mountain where old sages used to live and rest, but it's called Vijayanta, and it's also called Paṇḍavipūla and Gṛdhrakūṭa, and they're surrounded by each other as their dependents.",
        "source": "T03n0190_006:0677c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼山牢固，其色猶如綠摩尼寶，中有聚落，名曰山饒。",
        "translation": "That mountain is solid and has a color like green maṇi treasure, and there's a village on it called Sanāla.",
        "source": "T03n0190_006:0677c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去山不遠，有一大城，名為王舍。",
        "translation": "Not far from the mountain, there's a large city named Rājagṛha.",
        "source": "T03n0190_006:0677c29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其城往昔有一王仙，名優荼波梨，種姓以來常為王治，妃是善見大王之族，為大夫人，其子為王，名婆奚迦，今現治在摩伽陀國，繼彼優荼王仙之後。",
        "translation": "In the past, there was a king sage named Uḍapālī whose lineage had always been ruled by the king, whose wife was a member of the family of the well-seeing great king, who was a great wife, and whose son was a king named Vāsika, and who now rules in the country of Magadha, succeeding that Uḍapālī sage.",
        "source": "T03n0190_006:0678a01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者護明！",
        "translation": "Venerable Hōshō!",
        "source": "T03n0190_006:0678a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往生閻浮，堪為彼王作於長子。』",
        "translation": "He'll be born in Jambudvīpa and will be the king's eldest son.'",
        "source": "T03n0190_006:0678a04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護明菩薩，報金團言：『雖有此理，但彼王種，父母不淨，其城處邊，地勢堆阜，高下不平，純是溝坑，土沙礫石，荊棘諸草，少有泉池、諸河流水、樹木苑囿、花果園林。",
        "translation": "The luminous-protecting bodhisattva reported to the golden cluster, 'Although that's true, that king's seed has impure parents, and the terrain at the city's edge is mounded, uneven in height and level, consisting purely of ditches and pits, sand and gravel, thorns and grasses, and few springs and pools, rivers and waters, trees and shrines, or flowers and fruit groves.",
        "source": "T03n0190_006:0678a05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝今，可更別觀餘剎利種。』",
        "translation": "Now, therefore, you can look at the other bhadra species separately.'",
        "source": "T03n0190_006:0678a09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「金團天子復作是言：『尊者護明！",
        "translation": "\"The golden-encrusted celestial then said, 'Venerable Hui Ming!",
        "source": "T03n0190_006:0678a10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼迦尸國波羅奈城，善光王仙有子，名為善丈夫王，彼王堪為尊者作父。』",
        "translation": "In that city of Vārāṇasī in Kāśyapa, the Sage King Sunbeam has a son named Good Husband King, who could be a father to the Venerable.'",
        "source": "T03n0190_006:0678a10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護明菩薩報金團言：『此理雖然，但迦尸國善丈夫王，有四種法，染著邪見。",
        "translation": "The luminous-protecting bodhisattva reprimanded the golden cluster, saying, 'Although that's true, there are four kinds of good husband kings in Kāśyapa who are defiled by wrong views.",
        "source": "T03n0190_006:0678a12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝今可更別觀其餘王種，堪我生處。』",
        "translation": "Now, therefore, you can look at the other kings separately and see where I can be born.'",
        "source": "T03n0190_006:0678a14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「金團天子復作是言：『尊者護明！",
        "translation": "\"The golden-balloon celestial then said, 'Venerable Prabhūtaratna!",
        "source": "T03n0190_006:0678a15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍薩羅國舍婆提城，彼城有王，名歧(居移反)羅耶，是憍薩羅大國之主，其身巨力，多有人民，尊者堪為彼王作子。』",
        "translation": "In the city of Śrāvastī in the country of Kauśālā, there's a king named Kauśālā who is the lord of the great country of Kauśālā and whose body is powerful and has many people, and you, Venerable, could be his son.'",
        "source": "T03n0190_006:0678a15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護明菩薩報金團言：『此理雖然，但彼國主憍薩羅王，是摩登伽苗裔種類，父母不淨雜穢而生，兼上世來非是王種，小心下賤，意氣不高；又其家中，資財薄少，雖有七寶，金銀琉璃瑪瑙真珠，不能具足。",
        "translation": "The Protective Mantra Bodhisattva replied to the Golden Corps, 'Although that's true, that country's lord, King Kauśālā, is of the seedling lineage of the Mātaṅga, born from impure and defiled parents, wasn't of the king's lineage in a previous life, is careful and lowly, and has few possessions at home, even though he has seven treasures, including gold, silver, beryl, onyx, and genuine pearls, that he can't fill.",
        "source": "T03n0190_006:0678a18_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝今別更為我觀諸剎利堪我生處。』",
        "translation": "Now, therefore, you must separately examine for me the bharjas that would make them suitable for my birthplace.'",
        "source": "T03n0190_006:0678a22_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「金團天子復作是言：『尊者護明！",
        "translation": "\"The golden-encrusted celestial then said, 'Venerable Hao Ming!",
        "source": "T03n0190_006:0678a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼跋蹉國拘睒彌城，王名千勝，其王有子，名為百勝。",
        "translation": "In the city of Kauśāmbī in Vatsa, the king's name was Thousand Victims, and he had a son named One Hundred Victims.",
        "source": "T03n0190_006:0678a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼王多有象馬七珍、四兵具足。",
        "translation": "That king has many elephants, horses, seven treasures, and four armies in abundance.",
        "source": "T03n0190_006:0678a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者堪為彼王作子。』",
        "translation": "Venerable sir, you could be that king's son.'",
        "source": "T03n0190_006:0678a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護明菩薩報金團言：『此理雖然，但跋蹉王，母不賢良，從他丈夫，生於是子，非正王種；然其彼王，亦長宣說斷見之事。",
        "translation": "The luminous-protecting bodhisattva told the golden cluster, 'Although it's true, King Vatsa had a mother who wasn't good and gave birth to this son from another husband, who wasn't of the right lineage for a king; yet that king also preaches about nihilism for a long time.",
        "source": "T03n0190_006:0678a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝更觀餘剎利，我何處生。』",
        "translation": "Therefore, you should also examine the other śarīas to see where I was born.'",
        "source": "T03n0190_006:0678a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「金團天子復作是言：『此金剛國，有一城邑，名毘耶離，穀米豐饒，無有飢饉，人民安樂，國土莊嚴，譬如天宮，一種無異。",
        "translation": "\"The Vajra Deva then said, 'In this Vajra country, there's a town called Vaiśālī where the grain is plentiful, there's no famine, the people are happy, and the land is adorned like a heavenly palace, which is not different from one another.",
        "source": "T03n0190_006:0678b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼城國王，樹王之子，種姓清淨，無可穢嫌。",
        "translation": "The king of that city, a son of the king of trees, has a pure lineage that's beyond suspicion.",
        "source": "T03n0190_006:0678b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼國王宮庫藏之內，多有金銀珍寶等物，一切具足，無所乏少。",
        "translation": "In the treasury of his king's palace, there's a lot of gold, silver, treasures, and other things, all of which are plentiful and there's nothing lacking.",
        "source": "T03n0190_006:0678b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者堪為彼王作子。』",
        "translation": "Venerable sir, you could be a son of that king.'",
        "source": "T03n0190_006:0678b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護明菩薩報金團言：『此理實然，毘耶離主，上世已來，真是王種；但彼國人，心性剛強，各各自用，稱我是王，憍慢熾盛，放逸自高，不共其餘異類相雜，又無尊卑大小禮節，自言我解，自言我知，雖復有王，不肯承事，云自法是，不從他求。",
        "translation": "The Protective Mantra Bodhisattva replied to the golden mass, 'It's true, Lord Vaiśālī really was a royal lineage since a long time ago, but the people of that country are strong-minded, each has their own strength, claim I'm the king, are arrogant and exalted, don't mix with other people, don't have respect for superiority and inferiority, claim to understand and know for themselves, and refuse to serve the king even though he exists, claiming that their own principles are this and not seeking them from others.",
        "source": "T03n0190_006:0678b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝今更觀餘處剎利王種，我生何家。』",
        "translation": "Now, therefore, you should also examine the rest of the Bālī royal lineage and ask, 'What family was I born into?'",
        "source": "T03n0190_006:0678b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「金團天子復作是言：『尊者護明！",
        "translation": "\"The golden-balloon prince then said, 'Venerable Hui Ming!",
        "source": "T03n0190_006:0678b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼摩波槃提國，有優闍耶那城，明燈王子，名為滿足，居住彼城。",
        "translation": "In that country of Mahāprajāpatī, there's the city of Ujjayinī, where the bright-light prince named Satisfaction lives.",
        "source": "T03n0190_006:0678b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其王身體，大有威力，多諸左右，能破一切敵國怨家。",
        "translation": "The king's body is powerful, full of supporters, and able to defeat all enemies and states.",
        "source": "T03n0190_006:0678b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者堪為彼王作子。』",
        "translation": "Venerable sir, you could be that king's son.'",
        "source": "T03n0190_006:0678b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護明菩薩報金團言：『此理雖然，但彼國王，無有一法可軌之行，嚴酷暴惡，不信因果。",
        "translation": "The luminous-protecting bodhisattva reprimanded the golden mass, saying, 'Although that's true, that king has no single thing he can do, is harsh and violent, and doesn't believe in cause and effect.",
        "source": "T03n0190_006:0678b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝今可更別觀餘王種姓，任我生處。』",
        "translation": "Now, therefore, you can look at the other kings' lineages separately and let them be my birthplace.'",
        "source": "T03n0190_006:0678b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「金團天子復作是言：『尊者護明！",
        "translation": "\"The golden-encrusted celestial then said, 'Venerable Prabhūtaratna, guard your vision!",
        "source": "T03n0190_006:0678b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼閻浮提摩頭羅城，有一大王，名曰善臂，其子稱為自在健將。",
        "translation": "In that city of Jambudvīpa Mathurā, there's a great king named Sunbeam, whose son is called the Śubhajra.",
        "source": "T03n0190_006:0678b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者堪為彼王作子。』",
        "translation": "Venerable sir, you could be that king's son.'",
        "source": "T03n0190_006:0678b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護明菩薩報金團言：『此理雖然，但彼國王邪見家生，以如是故，一生補處菩薩大士，不得生彼邪見之家。",
        "translation": "The luminous-protecting bodhisattva reprimanded the golden group, saying, 'Although that's true, that king's family of wrong views is born, and because of that, a bodhisattva-mahāsattva in a lifetime of mending places can't be born in that family of wrong views.",
        "source": "T03n0190_006:0678b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝今可更別觀餘王種姓，我何處生。』",
        "translation": "Now, therefore, you can examine separately where I was born in another king's family.'",
        "source": "T03n0190_006:0678b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「金團天子復作是言：『尊者護明！",
        "translation": "\"The golden-encrusted celestial then said, 'Venerable Hōshō Imō!",
        "source": "T03n0190_006:0678b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此白象城，般紐王種，勇健威猛，可憙端正，世無有雙，能破強隣一切怨敵。",
        "translation": "'This white elephant city, Prasenajit, is a brave and powerful king, resilient and correct, and has no equal in the world, capable of defeating all enemies in its neighborhood.",
        "source": "T03n0190_006:0678b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者堪為彼王作子。』",
        "translation": "Venerable sir, you could be the king's son.'",
        "source": "T03n0190_006:0678b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護明菩薩報金團言：『此理雖然，但般紐王，種姓清淨，為彼雜類之所擾亂。",
        "translation": "The luminous-protecting bodhisattva replied to the golden cluster, 'Although that's true, King Prasenajit is a pure lineage that's disturbed by that variety.",
        "source": "T03n0190_006:0678b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T03n0190_006:0678c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼王長子，名踰地師絺羅，是於梵天法王之子；第二名為毘摩斯那風神王子，第三名為頞純那者，是帝釋子；復有二子，別母而生，一名那拘羅，二名娑呵提婆，此二子者，是星宿天阿輸那子。",
        "translation": "The king's eldest son, named Yudhisthira, is the son of the Brahma god Dharma King; the second is Vimalasena, the prince of the wind gods; the third is Arjuna, the son of Tissa; and there are two sons born from separate mothers, one named Nakula and the other named Sahadeva, who are the sons of Aśona in the Astral Plane.",
        "source": "T03n0190_006:0678c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝今可更別觀餘王種姓，我何處生。』",
        "translation": "Now, therefore, you may examine separately the other kings' lineages and see where I was born.'",
        "source": "T03n0190_006:0678c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「金團天子復作是言：『尊者護明！",
        "translation": "\"The golden-pearl celestial then said, 'Venerable Hồpanna!",
        "source": "T03n0190_006:0678c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼閻浮提寐洟羅城，寐洟羅種，王名善友，多饒象馬車乘牛羊，一切資生，悉皆具足，無量眾寶，庫藏豐盈，金銀真珠，未甞乏少，彼王有友常樂勤修法行之事。",
        "translation": "'In that city of Jambudvīpa, there's a man of the Mannakāra lineage whose king's name is Good Friend, who often produces elephants, horses, chariots, cattle, and sheep, and has all the necessities of life, an abundant treasury of measureless treasures, and genuine pearls of gold and silver that are never lacking, and that king has friends who always delight in diligently cultivating the practice of the Dharma.",
        "source": "T03n0190_006:0678c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者堪為彼王作子。』",
        "translation": "Venerable sir, you could be that king's son.'",
        "source": "T03n0190_006:0678c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護明菩薩報金團言：『此理實然，其善友王，雖有如是具足之法，但彼國王年老衰邁，更不復能營理國務，又其王今多饒諸子。",
        "translation": "The luminous-protecting bodhisattva reprimanded the golden group, saying, 'It's true that although that good friend of the king has such an accomplished collection of things, the king is too old and decrepit to manage the affairs of his country, and the king now spares many sons.",
        "source": "T03n0190_006:0678c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝今可更別觀餘王種類，我何處生。』",
        "translation": "Now, therefore, you can look at the other kings separately and see where I was born.'",
        "source": "T03n0190_006:0678c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「金團天子復作是言：『此等並是中國之王，復更別有邊地之國邪見諸王。",
        "translation": "\"The golden-balloon prince then said, 'These are the kings of China, and there are other borderlands that have mistaken kings.",
        "source": "T03n0190_006:0678c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毘紐海洲，有一國主，婆羅門種，治化在於毘紐之上，名月支王；父母種姓清淨具足，兼解祭祀諸天之法，四毘陀論，皆悉了知。",
        "translation": "On the island of Viṣṇu, there's a lord of a country of the Brāhmaṇa lineage who rules and educates people above Viṣṇu named King Yuezhi; his parents' lineage is pure and perfect, and he also understands the rituals of the gods and the four Vedas' treatises.",
        "source": "T03n0190_006:0678c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者堪為彼王作子。』",
        "translation": "Venerable sir, you could be a son of that king.'",
        "source": "T03n0190_006:0678c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護明菩薩報金團言：『此理雖然，但我下生，出家成道，要須剎利，不欲生彼婆羅門家。",
        "translation": "The light-protecting bodhisattva reprimanded the golden group, saying, 'Although that's true, I was born next, left home, and became a practitioner, and I need a bodhisattva's profit, so I don't want to be born in a brāhmaṇa's home.",
        "source": "T03n0190_006:0678c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝今唯覓剎利，我生何處。』",
        "translation": "Now, therefore, you're only looking for the bhadra; where will I be born?'",
        "source": "T03n0190_006:0678c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「金團天子復作是言：『我於閻浮一切諸國，處處聚落，處處諸王，處處村舍，處處城邑，處處剎利，各住諸城，而是剎利，造種種業。",
        "translation": "\"The golden-encrusted god then said, 'In all the lands of Jambudvīpa, there are villages, kings, huts, cities, and bases, and each city where I live has bases, but I create various kinds of activity.",
        "source": "T03n0190_006:0678c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我為尊者，經歷已來，生於無量疲極苦惱，心迷意亂，更不復能觀看餘處；設復觀察，口亦不能如是宣說。』",
        "translation": "Since I experienced this, Your Holiness, I've been subjected to measureless weariness and suffering, and my mind has been so confused that I'm no longer able to look at other places; even if I were to look, I wouldn't be able to verbalize it that way.'",
        "source": "T03n0190_006:0678c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護明菩薩報金團言：『實如汝語，然汝要須為我選覓一剎帝利清淨之家，堪我生處。』",
        "translation": "The luminous-protecting bodhisattva replied to the golden mass, 'It's true what you said, but you must choose a pure home in Kārttiāli for me that would be a suitable birthplace for me.'",
        "source": "T03n0190_006:0679a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「金團天子復作是言：『我為尊者，苦惱愁憂，處處觀察，忽然忘失一剎利家。』",
        "translation": "\"The golden-unit celestial then said, 'Venerable, I've been so distressed and worried that I've looked around and suddenly forgotten about a home that's a bhadra.'",
        "source": "T03n0190_006:0679a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護明菩薩問金團言：『其名云何？』",
        "translation": "The luminous-protecting bodhisattva asked the golden mass, 'What's its name?'",
        "source": "T03n0190_006:0679a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金團白言：『有一剎利，元本已來，從於大眾，平量安立，世世轉輪聖王之種，乃至苷蔗苗裔已來，子孫相承，在彼迦毘羅婆蘇都釋種所生，其王名為師子頰王，其子名為輸頭檀王；一切世間天人之中，有大名稱。",
        "translation": "The golden mass said, 'There's a warrior who was originally established in a balanced way from the masses as a seed of the wheel-turning sage king from generation to generation, even from the seedling of the glucosamine, and whose descendants were born from the seed of Kapilavastu, whose king is called the lion-cheeked king and whose son is called the Śuddhodana king, and who has a great reputation among all the world's gods and humans.",
        "source": "T03n0190_006:0679a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者堪為彼王作子。』",
        "translation": "Venerable sir, you could be the son of that king.'",
        "source": "T03n0190_006:0679a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護明菩薩報金團言：『善哉善哉！",
        "translation": "The light-protecting bodhisattva responded to the golden mass, saying, 'Good, good!",
        "source": "T03n0190_006:0679a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金團天子！",
        "translation": "Golden Corps of Devas!",
        "source": "T03n0190_006:0679a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝善觀察諸王種家，我亦念在於此家生，我今深心如汝所說。",
        "translation": "\"You've well observed the various royal families, and I'm mindful that I was born in this family, so I now deeply believe what you've said.",
        "source": "T03n0190_006:0679a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金團當知！",
        "translation": "Golden Corps, you should know!",
        "source": "T03n0190_006:0679a13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我定往生彼家作子。",
        "translation": "I'll surely be reborn in their home as their son.",
        "source": "T03n0190_006:0679a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金團！",
        "translation": "Golden Corps!",
        "source": "T03n0190_006:0679a13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往昔一生補處菩薩，所託家者，有六十種功德具足，滿於彼家。",
        "translation": "In a past lifetime, a bodhisattva in a compensatory position entrusted with a home had 60 qualities that filled that home.",
        "source": "T03n0190_006:0679a13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等六十？",
        "translation": "What are the 60?",
        "source": "T03n0190_006:0679a15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家本來清淨好種(一)。",
        "translation": "\"Their homes are originally pure and good (a).",
        "source": "T03n0190_006:0679a15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸聖恒觀彼家(二)。",
        "translation": "All the sages constantly observe that household(2).",
        "source": "T03n0190_006:0679a16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家不行一切惡事(三)。",
        "translation": "Their household doesn't tolerate all bad qualities(3).",
        "source": "T03n0190_006:0679a16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家所生悉皆清淨(四)。",
        "translation": "All that comes from that family is pure(4).",
        "source": "T03n0190_006:0679a17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家種姓真正無雜(五)。",
        "translation": "Their family's lineage is truly unadulterated(5) .",
        "source": "T03n0190_006:0679a17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家體胤嫡嫡相承，無有斷絕(六)。",
        "translation": "Their lineage is inherited from son to son, with no break in continuity(6) .",
        "source": "T03n0190_006:0679a18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家昔來不斷王種(七)。",
        "translation": "Their lineage has never been stripped of its royal lineage in the past(7) .",
        "source": "T03n0190_006:0679a18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家所生一切諸王，皆是往昔深種善根(八)。",
        "translation": "All the kings born in that family were born from deeply planted good roots in the past.(8)",
        "source": "T03n0190_006:0679a19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生彼家者，常為諸聖之所讚歎(九)。",
        "translation": "Those born into that family are always praised by the sages(9).",
        "source": "T03n0190_006:0679a20_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，具大威德(十)。",
        "translation": "Those born in that family possess great authority(10) .",
        "source": "T03n0190_006:0679a21_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家多有端正婦女(十一)。",
        "translation": "In that family, there are many decent women(11).",
        "source": "T03n0190_006:0679a21_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家多有智慧男兒(十二)。",
        "translation": "Many of their children are wise sons(12).",
        "source": "T03n0190_006:0679a22_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家所生，心性調順(十三)。",
        "translation": "They give birth to men whose minds are well-adjusted(xiii).",
        "source": "T03n0190_006:0679a22_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家所生，無有戲調(十四)。",
        "translation": "They give birth to sons who have no agitation(xiv).",
        "source": "T03n0190_006:0679a23_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，無所可畏(十五)。",
        "translation": "Those born in their household have nothing to fear(xv).",
        "source": "T03n0190_006:0679a23_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，不曾怯弱(十六)。",
        "translation": "Someone from that family is born, and they're not fainthearted(xvi).",
        "source": "T03n0190_006:0679a24_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，聰明多智(十七)。",
        "translation": "They are born in a household that's intelligent and resourceful(xvii).",
        "source": "T03n0190_006:0679a24_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，多解工巧(十八)。",
        "translation": "They are born in a household that's full of understanding and ingenuity(xviii).",
        "source": "T03n0190_006:0679a25_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，皆畏過罪(十九)。",
        "translation": "Those born in that family are all afraid of wrongdoing(xix).",
        "source": "T03n0190_006:0679a25_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家所生，不與世間工巧雜合，亦不貪財以為活命(二十)。",
        "translation": "Those born in their household don't mix with worldly crafts, and they don't crave possessions for their living(xx).",
        "source": "T03n0190_006:0679a26_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家所生，常存朋友(二十一)。",
        "translation": "Those born in that household always have friends(xxi).",
        "source": "T03n0190_006:0679a27_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家所生，不以殺害諸蟲諸獸以自活命(二十二)。",
        "translation": "They are born in a household that doesn't kill bugs and animals to sustain its own life(22).",
        "source": "T03n0190_006:0679a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家種姓恒知恩義(二十三)。",
        "translation": "That family's clan always knows the meaning of kindness(xxiii).",
        "source": "T03n0190_006:0679a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家種族能修苦行(二十四)。",
        "translation": "Their family is of a race that cultivates asceticism(24).",
        "source": "T03n0190_006:0679a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家所生，不隨他轉(二十五)。",
        "translation": "They're born in a family that doesn't change [into] others (25).",
        "source": "T03n0190_006:0679b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家所生，不曾懷恨(二十六)。",
        "translation": "They are born in their family and don't harbor hatred(26).",
        "source": "T03n0190_006:0679b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家所生，不結癡心(二十七)。",
        "translation": "They are born in that family and don't form deluded thoughts (27).",
        "source": "T03n0190_006:0679b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，不以怖畏隨順於他(二十八)。",
        "translation": "Someone born in that household doesn't follow others with fear (28).",
        "source": "T03n0190_006:0679b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，畏殺害他(二十九)。",
        "translation": "Someone born in that household fears killing and harming others (29).",
        "source": "T03n0190_006:0679b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，無有罪患(三十)。",
        "translation": "He was born in that household, and he's free from guilt(30).",
        "source": "T03n0190_006:0679b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，乞食得多(三十一)。",
        "translation": "Someone born in that household will obtain much food by begging (31).",
        "source": "T03n0190_006:0679b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至彼家者，無空發遣(三十二)。",
        "translation": "Going to their house, there's no point in sending them away(32).",
        "source": "T03n0190_006:0679b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家剛強難可降伏(三十三)。",
        "translation": "Theirs is a strong family that's difficult to subdue(xxxiii).",
        "source": "T03n0190_006:0679b05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家法則恒出禮律(三十四)。",
        "translation": "Their code of conduct always departs from the precepts of propriety(xxxiv).",
        "source": "T03n0190_006:0679b06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家常樂布施眾生(三十五)。",
        "translation": "Theirs is a family that always takes delight in bestowing gifts on sentient beings (35).",
        "source": "T03n0190_006:0679b06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家建立因果勤劬(三十六)。",
        "translation": "That family establishes the diligence of cause and effect (36).",
        "source": "T03n0190_006:0679b07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家所生，世間勇健(三十七)。",
        "translation": "Their family produces worldly heroes (37).",
        "source": "T03n0190_006:0679b07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家恒常供養一切諸仙諸聖(三十八)。",
        "translation": "Their family is constantly making offerings to all the sages and saints (38).",
        "source": "T03n0190_006:0679b08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家恒常供養神靈(三十九)。",
        "translation": "His family always makes offerings to the spirits(xxxix).",
        "source": "T03n0190_006:0679b09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家恒常供養諸天(四十)。",
        "translation": "His family always makes offerings to the gods(40).",
        "source": "T03n0190_006:0679b09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家恒常供養大人(四十一)。",
        "translation": "That family always makes offerings to the great (41).",
        "source": "T03n0190_006:0679b10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家歷世無有怨讎(四十二)。",
        "translation": "That family has never had a grudge in ages(42).",
        "source": "T03n0190_006:0679b10_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家名聲威振十方(四十三)。",
        "translation": "Their house's reputation is so authoritative it roars in ten directions(43).",
        "source": "T03n0190_006:0679b11_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家，一切諸家為最(四十四)。",
        "translation": "Theirs is the most distinguished of all families(44).",
        "source": "T03n0190_006:0679b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，上世已來悉是聖種(四十五)。",
        "translation": "Those born in that family were all of noble lineage since a previous life (45).",
        "source": "T03n0190_006:0679b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，於聖種中最為第一(四十六)。",
        "translation": "Those born in that family are the most noble of all the noble seeds (46).",
        "source": "T03n0190_006:0679b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，恒是轉輪聖王之種(四十七)。",
        "translation": "Those born in their family are always the seeds of wheel-turning sage kings (47).",
        "source": "T03n0190_006:0679b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，是大威德人之種姓(四十八)。",
        "translation": "Those born in their household are of the family of the great and mighty (48).",
        "source": "T03n0190_006:0679b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，多有無量眷屬圍繞(四十九)。",
        "translation": "He's born in a household that's often surrounded by measureless retinues (49).",
        "source": "T03n0190_006:0679b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，所有眷屬不可破壞(五十)。",
        "translation": "He's born in a household where all his retinues are indestructible (50).",
        "source": "T03n0190_006:0679b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，所有眷屬勝一切人(五十一)。",
        "translation": "He's born in a household where his retinue is superior to all people(51).",
        "source": "T03n0190_006:0679b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，悉孝養母(五十二)。",
        "translation": "Those born in their household are dutiful to their mothers(52).",
        "source": "T03n0190_006:0679b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，皆孝順父(五十三)。",
        "translation": "Those born in their household are all dutiful to their father(53).",
        "source": "T03n0190_006:0679b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，悉皆供養一切沙門(五十四)。",
        "translation": "All of those born in their household support all ascetics(54).",
        "source": "T03n0190_006:0679b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，悉皆供養諸婆羅門(五十五)。",
        "translation": "All the people born in their household make offerings to the brāhmaṇas (fifty-five).",
        "source": "T03n0190_006:0679b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，豐饒五穀，倉庫盈溢(五十六)。",
        "translation": "Those born in that household have an abundance of grains and storage (56).",
        "source": "T03n0190_006:0679b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，多有金銀車璩瑪瑙，一切資財無所乏少(五十七)。",
        "translation": "They are born in a household that's abundant in gold and silver, carts and agates, and has nothing lacking in all their possessions (57).",
        "source": "T03n0190_006:0679b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，多畜奴婢象馬牛羊，一切具足(五十八)。",
        "translation": "They are born in a household that has many slaves and servants, elephants, horses, cattle, and sheep, and everything in their possessions (58).",
        "source": "T03n0190_006:0679b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，不曾事他(五十九)。",
        "translation": "That person's family produces people who don't work for others (59).",
        "source": "T03n0190_006:0679b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼家生者，如是一切眾事具足，於世間中無所乏少(六十)。",
        "translation": "That native of the household is supplied with all these things, and there's nothing lacking in the world (60).",
        "source": "T03n0190_006:0679b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『金團天子！",
        "translation": "\"'Vairocana!",
        "source": "T03n0190_006:0679b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡是一生補處菩薩，處於母胎，彼母若有三十二種相具足者，乃能堪受菩薩在胎。",
        "translation": "\"Whenever a bodhisattva in the position of aiding for a lifetime is in his mother's womb, that mother will be able to accept the bodhisattva in the womb if she has the thirty-two characteristics that are complete.",
        "source": "T03n0190_006:0679b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為三十二事？",
        "translation": "What are these called the thirty-two things?",
        "source": "T03n0190_006:0679b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一彼母人，正德而生。",
        "translation": "One, his mother is a human being born of right virtue.",
        "source": "T03n0190_006:0679b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二彼母人，支體具足。",
        "translation": "Two, she's a mother who's fully endowed with the limbs and body.",
        "source": "T03n0190_006:0679b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三彼母人，德行無缺。",
        "translation": "3. that mother-person has no defects in her virtuous conduct.",
        "source": "T03n0190_006:0679b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四彼母人，所生得處。",
        "translation": "Four, that mother-person is born in a place where she can obtain birth.",
        "source": "T03n0190_006:0679c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五彼母人，為行庶幾。",
        "translation": "5. that mother-person's conduct is quite varied.",
        "source": "T03n0190_006:0679c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六彼母人，種類清淨。",
        "translation": "6. that mother-person is pure in type.",
        "source": "T03n0190_006:0679c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七彼母人，端正無比。",
        "translation": "7. that mother-person is correct and without parallel.",
        "source": "T03n0190_006:0679c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八彼母人，名字德稱。",
        "translation": "8. that mother person, whose name is praised for virtue ...",
        "source": "T03n0190_006:0679c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九彼母人，身體形容，上下相稱。",
        "translation": "9. that mother-person's body is described, and she's proportionate above and below.",
        "source": "T03n0190_006:0679c03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十彼母人，未曾產生。",
        "translation": "Ten, that mother-person has never been born before.",
        "source": "T03n0190_006:0679c04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十一彼母有大功德。",
        "translation": "11. That mother has great attributes.",
        "source": "T03n0190_006:0679c04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十二彼母恒念樂事。",
        "translation": "12. That mother is always mindful of pleasant things.",
        "source": "T03n0190_006:0679c05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十三彼母心常隨順一切善事。",
        "translation": "XIII. That mother's mind always follows all good works.",
        "source": "T03n0190_006:0679c05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十四彼母無有邪心。",
        "translation": "XIV. That mother has no wrong thoughts.",
        "source": "T03n0190_006:0679c06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十五彼母身口及心自然調伏。",
        "translation": "15. That mother's body, speech, and mind are naturally disciplined.",
        "source": "T03n0190_006:0679c06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十六彼母心無所畏。",
        "translation": "Sixteen... that mother's mind has no fear.",
        "source": "T03n0190_006:0679c07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十七彼母多聞總持。",
        "translation": "17. that mother's well-versed, comprehensive mind.",
        "source": "T03n0190_006:0679c08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十八彼母極女工巧。",
        "translation": "18. That mother is a consummate woman of skillful means.",
        "source": "T03n0190_006:0679c08_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十九彼母心無諂曲。",
        "translation": "19. that mother's mind is free of deceit.",
        "source": "T03n0190_006:0679c09_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十彼母心無誑詐。",
        "translation": "20. That mother's mind is not deceptive.",
        "source": "T03n0190_006:0679c09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十一者彼母人，心無有瞋恚。",
        "translation": "21. That mother's person has no anger in mind.",
        "source": "T03n0190_006:0679c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十二者彼母人，心無有嫉妬。",
        "translation": "22. That mother's persona has a mind free of jealousy.",
        "source": "T03n0190_006:0679c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十三者彼母人，心無有慳悋。",
        "translation": "Twenty-three, that mother's person's mind is free of stinginess.",
        "source": "T03n0190_006:0679c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十四者彼母人，心無有急速。",
        "translation": "24. That mother's person's mind is free of haste.",
        "source": "T03n0190_006:0679c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十五者彼母人，心難可迴轉。",
        "translation": "25. That mother's person's mind is difficult to redirect.",
        "source": "T03n0190_006:0679c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十六者彼母人，體有至德相。",
        "translation": "26. That mother-person's body has the mark of supreme virtue.",
        "source": "T03n0190_006:0679c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十七者彼母人，心能懷忍辱。",
        "translation": "27. That mother person's mind is capable of harboring patience.",
        "source": "T03n0190_006:0679c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十八者彼母人，心有慚有愧。",
        "translation": "28. That mother's person has a mind that's conscience and modesty.",
        "source": "T03n0190_006:0679c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十九者彼母人，行薄婬怒癡。",
        "translation": "29. That mother conducts herself with little lust, anger, and delusion.",
        "source": "T03n0190_006:0679c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十者彼母人，行無女家過。",
        "translation": "30 That mother's conduct is without fault in the woman's family.",
        "source": "T03n0190_006:0679c16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十一者彼母人，行孝順向夫。",
        "translation": "31. That mother conducts herself with filial piety and respect for her husband.",
        "source": "T03n0190_006:0679c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十二者彼母出生一切諸德，一切諸行皆悉具足。",
        "translation": "Thirty-two, that mother produces all virtues and is fully endowed with all practices.",
        "source": "T03n0190_006:0679c17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是母人，乃能堪受一生補處後身菩薩。",
        "translation": "Such a mother is capable of accepting a bodhisattva in the final lifetime as a patchwork buddha.",
        "source": "T03n0190_006:0679c18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩欲入母胎之時，取鬼宿日，然後乃入於母胎中，其受一生補處菩薩胎母已前，其母必須受八關齋，然後菩薩入於彼胎。』",
        "translation": "When a bodhisattva wants to enter his mother's womb, he takes the day of the demon's retreat and then enters her womb. Before he receives the bodhisattva's mother in the womb, she must undertake the eight precepts before the bodhisattva enters her womb.'",
        "source": "T03n0190_006:0679c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「護明菩薩復作是言：『我今受有不為世間一切錢財五欲快樂故，下人間受此一生，唯欲安樂諸眾生故，哀愍苦惱諸眾生故。』",
        "translation": "\"The Bodhisattva Vimalakīrti then said, 'Now, I won't accept existence for the pleasure of all the world's possessions and five desires, but I'll accept a lifetime here among humans because I want to bring comfort to sentient beings and pity for suffering sentient beings.'",
        "source": "T03n0190_006:0679c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，眾中有一天女，告於其餘一天女言：『我等大家護明菩薩，必下人間；我等此宮違離護明菩薩大士！",
        "translation": "\"At the time, one of the women in the crowd told the other women, 'We all, the luminous protector bodhisattva, will surely go down to the human realm; we here at the palace are at odds with the luminous protector bodhisattva!'",
        "source": "T03n0190_006:0679c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何令我心樂此處？』",
        "translation": "How do I make my mind happy here?'",
        "source": "T03n0190_006:0679c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二天女，即報之言：『奈何奈何！",
        "translation": "The second goddess then reported it, saying, 'Oh, no, no!",
        "source": "T03n0190_006:0679c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等今者，共作何事，令於我等得往人間，善觀彼家護明菩薩所生之處？』",
        "translation": "Now, what are we doing together that will allow us to go among humans and well observe the places where the bodhisattvas of their families protect their luminosity and are born?'",
        "source": "T03n0190_006:0679c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三復有一天女言：『願我等今捨此天壽，令我等往彼處受生。",
        "translation": "\"Third, there was another goddess who said, 'May we now give up our lives in this heaven so that we can go there and be born.'",
        "source": "T03n0190_006:0680a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T03n0190_006:0680a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等亦願至於彼處，共我護明菩薩同生。』",
        "translation": "We also hope to reach that place and be born together with the bodhisattva We Wish to Protect Our Luminosity.'",
        "source": "T03n0190_006:0680a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四復有一天女言：『汝等相與莫生悔心。",
        "translation": "Fourth, there was another goddess who said, 'Don't become remorseful when you join together.",
        "source": "T03n0190_006:0680a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T03n0190_006:0680a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等大家護明菩薩，尚捨天壽生於人間，況復我等？』",
        "translation": "We, the bodhisattvas who protect our luminosity, have yet to give up our lives in heaven to be born among humans, so why wouldn't we?'",
        "source": "T03n0190_006:0680a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更復有一天女稱言：『尊者護明！",
        "translation": "Again, there was a goddess who said, 'Venerable Hōshō Shimō!",
        "source": "T03n0190_006:0680a07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今者下生於閻浮提，唯願大士！",
        "translation": "Now that I've been reborn in Jambudvīpa, may it be, Omaha!",
        "source": "T03n0190_006:0680a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫忘我等。』",
        "translation": "Don't forget about us.'",
        "source": "T03n0190_006:0680a08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時護明菩薩告於彼等諸天女言：『汝等莫大生於苦惱，我前已為汝等說於一切有處，皆悉無常，如芭蕉莖，無有堅實；如借物用，必須還他，非我已有；猶如陽焰幻化水泡。",
        "translation": "The Protective Light Bodhisattva then addressed the goddesses, saying, 'Don't be so distressed, for I've already explained to you that all places of existence are impermanent, like the stalk of a plantain that has no substance; like a borrowed object that's used and must be returned to another, it's not mine to possess; it's like a mirage of sunlight turning into a water bubble.",
        "source": "T03n0190_006:0680a08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切有處，皆是誑惑；愚癡之人，謂言常生。』",
        "translation": "All places of existence are deceptive, and foolish people say they're always arisen.'",
        "source": "T03n0190_006:0680a12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，眾中有一天子，悵怏心愁，口復唱言：『觀此菩薩所說生處，無常不真，咄哉我等！",
        "translation": "\"At the time, there was a celestial among the crowd who was sad and troubled, and he kept singing, 'Look at what this bodhisattva says about the place of birth, which is impermanent and untrue.",
        "source": "T03n0190_006:0680a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何假須樂於此生處？",
        "translation": "What is the hypothesis that one must delight in this place of birth?",
        "source": "T03n0190_006:0680a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等今見護明菩薩，如是功德具足之體，生兜率天，此兜率宮，如是福聚，如是端正，如是微妙，如是莊嚴。",
        "translation": "Now, we see that the Prabhūtaratna Bodhisattva, thus replete with merit, is born in the Tuṣita Heaven, and this Tuṣita palace is thus rich in fortune, thus correct, thus sublime, and thus adorned.",
        "source": "T03n0190_006:0680a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護明菩薩捨離下生，咄哉我等！",
        "translation": "The luminous-protecting bodhisattva has abandoned his lower rebirth.",
        "source": "T03n0190_006:0680a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何獨在此無常境？』",
        "translation": "How are you alone in this impermanent state?'",
        "source": "T03n0190_006:0680a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，復有第二天子，答彼第一初天子言：『善哉天子！",
        "translation": "\"Then, there was another second celestial who answered the first celestial, 'Good, celestial!",
        "source": "T03n0190_006:0680a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如是，如汝所說。』",
        "translation": "'So it is, just as you say.'",
        "source": "T03n0190_006:0680a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而作偈言：「『我此護明大菩薩，　　往昔在於諸有中，　　常捨極所愛婦兒，　　奴僕象馬財珍寶，　　或復割截身骨肉，　　頭目髓腦血皮膚，　　如是來索悉不違，　　或百或千皆施與。』",
        "translation": "He then composed a verse, saying, 'I, the great bodhisattva who protects the light, was among the sentient beings in the past, always abandoning much-loved women and children, slaves, elephants, horses, wealth, and treasure, or cutting off flesh and bones, heads, eyes, marrow, brains, blood, and skin, and I didn't disobey any of them when I asked for such things, whether hundreds or thousands of them I gave.'",
        "source": "T03n0190_006:0680a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，眾中復有天子，而說偈言：「『咄哉我等身，　　在此天宮生，　　常恐今當墮，　　人怖死亦然。",
        "translation": "\"At the time, another god among the crowd spoke in verse, saying, \"My goodness, we were born here in this celestial palace, always fearing that we might fall now, and so are people fearing death.",
        "source": "T03n0190_006:0680a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　何有生法中，　　福業不盡者，　　諸是無常界，　　眾生悉命終。』",
        "translation": "What kind of birth is there in the Dharma, whose meritorious actions don't end, which is the realm of impermanence, and whose lives all end?'",
        "source": "T03n0190_006:0680b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「護明菩薩告諸天言：『汝等天人！",
        "translation": "\"The Protective Mantra Bodhisattva addressed the gods, saying, 'You gods!",
        "source": "T03n0190_006:0680b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須知一切世間別離生死為本，汝等為我莫苦憂愁。",
        "translation": "You should know that all the world is based on the principle of separation from birth and death, so don't be so sad and distressed for me.",
        "source": "T03n0190_006:0680b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T03n0190_006:0680b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我往昔來不造凡業，今欲令我久住世間，終不可得。",
        "translation": "I never did ordinary actions in the past, but now I want to be allowed to stay in the world for a long time, but it's impossible.",
        "source": "T03n0190_006:0680b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於過去佛法僧邊，種諸善業，常發道心，乞求大願；今得善報，當成菩提，汝應歡喜，何得苦惱？』",
        "translation": "In the past, I planted good activities near the Buddha, Dharma, and Saṃgha, always had the intention to follow the path, and begged for the great vow; now that I've obtained a good reward and will achieve enlightenment, you should rejoice, why should you be afflicted?'",
        "source": "T03n0190_006:0680b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼諸天聞是語已，各相謂言：『汝等諸天！",
        "translation": "When the gods heard this, they each said to one another, 'You gods!",
        "source": "T03n0190_006:0680b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "熟視護明菩薩大士，而此護明菩薩大士，今者不久下於人間。』",
        "translation": "I've been familiar with the Bodhisattva-mahāsattva Protector of Luminosity, and this Bodhisattva-mahāsattva Protector of Luminosity won't be going down to earth anytime soon.'",
        "source": "T03n0190_006:0680b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "口復唱言：『尊者護明！",
        "translation": "Again, he called out, 'Venerable Prabhūtaratna!",
        "source": "T03n0190_006:0680b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者不久生於人間，此兜率宮，所有威德，及諸天福，尊悉將去。",
        "translation": "'Venerable, you will soon be born among humans, and this palace of Tuṣita, with all its prestige and the blessings of the gods, will all be gone.",
        "source": "T03n0190_006:0680b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊受人間，末後有身，我等諸天，云何奉事？』",
        "translation": "What will we gods do to serve him when he's accepted as a human being and has a body in the future?'",
        "source": "T03n0190_006:0680b12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護明菩薩告彼一切諸天眾言：『我前所生五種衰相，汝等復說無常因緣，如是法門，汝等常須繫念在心，勿令忘失。",
        "translation": "Protecting the luminous bodhisattvas, he addressed the gods, saying, \"You have also explained the causes and conditions of impermanence for the five signs of decay that were produced by me, and you must always keep such a teaching in mind so that you don't forget it.",
        "source": "T03n0190_006:0680b13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今此處下生人間，當得阿耨多羅三藐三菩提，轉於無上最妙法輪。",
        "translation": "Now, I'll descend from this place to the human realm, where I'll attain unsurpassed, perfect enlightenment and turn the unsurpassed, most marvelous wheel of the Dharma.",
        "source": "T03n0190_006:0680b16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等諸天！",
        "translation": "You gods!",
        "source": "T03n0190_006:0680b17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "可各願下人間受身，生彼處已，汝等當得解脫一切諸煩惱苦。』",
        "translation": "You may each vow to be born in a lower human body, and after being born there, you will be freed from all afflictions and suffering.'",
        "source": "T03n0190_006:0680b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，護明菩薩觀生家已，時兜率陀有一天宮，名曰高幢，縱廣正等，六十由旬，菩薩時時上彼宮中，為兜率天，說於法要。",
        "translation": "\"It was then that, after the Bodhisattva Vairocana had observed birth in his family, there was a one-day palace in Tuṣita named Gaochang, which measured 60 yojanas in length and breadth, and the Bodhisattva went up to that palace and taught the essentials of the Dharma for the Tuṣita gods.",
        "source": "T03n0190_006:0680b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時菩薩，上於彼宮，安坐訖已，告於兜率諸天子言：『汝等諸天！",
        "translation": "After he had risen to that palace and finished sitting there, the bodhisattva addressed the gods of Tuṣita, saying, 'You gods!",
        "source": "T03n0190_006:0680b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應來聚集。",
        "translation": "You should come and gather.",
        "source": "T03n0190_006:0680b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我身不久，下於人間，我今欲說一法明門，名入諸法相方便門，留教化汝，最後汝等憶念我故，汝等若聞此法門者，應生歡喜。』",
        "translation": "Now, since I will soon be down here among humans, I want to explain a method of teaching called the method of skillful entry into the characteristics of all dharmas, so that in the end you'll remember me and rejoice if you hear this method.'",
        "source": "T03n0190_006:0680b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，兜率陀諸天大眾，聞於菩薩如此語已，及天玉女一切眷屬，皆來聚集，上於彼宮。",
        "translation": "When the great multitude of gods of Tuṣita heard what the bodhisattva said, they and all of their retinues, the gods and goddesses, gathered together and went up to that palace.",
        "source": "T03n0190_006:0680b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護明菩薩見彼天眾聚會畢已，欲為說法，即時更化作一天宮，在彼高幢本天宮上，高大廣闊，覆四天下，可憙微妙，端正少雙，威德巍巍，眾寶莊飾，一切欲界天宮殿中，無匹喻者。",
        "translation": "After the congregation had gathered, the Prabhūtaratna Bodhisattva wanted to preach for them, so he immediately transformed into a one-day palace that was high and wide, covering the four heavens, with a high banner, subtle, correct, and few pairs, majestic and dignified, and adorned with many treasures that have no equal among the palaces of the gods of the desire realm.",
        "source": "T03n0190_006:0680b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色界諸天見彼化殿，於自宮殿，生如是心，如塜墓想。",
        "translation": "The gods of the form realm see that transformed palace and their own palaces, and they give rise to such thoughts as those of a graveyard.",
        "source": "T03n0190_006:0680c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時護明菩薩，已於過去，行於實行，種諸善根，成就福聚，功德具足，所成莊嚴，師子高座，昇上而坐。",
        "translation": "The lion-protecting bodhisattva, having practiced in the past, planted good roots, accumulated merits, and perfected their virtues, rises up from his high lion seat and sits there adorned.",
        "source": "T03n0190_006:0680c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護明菩薩在彼師子高座之上，無量諸寶莊嚴間錯，無量無邊種種天衣而敷彼座，種種妙香以熏彼座，無量無邊寶鑪燒香，出於種種微妙香花散其地上。",
        "translation": "On top of that high lion seat, the lion-protecting bodhisattva is adorned with measureless treasures that mingle, measureless and limitless celestial robes that cover the seat, measureless and limitless wonderful incense that perfumes the seat, and measureless and limitless precious stūpas that burn incense and produce a variety of subtle fragrant flowers that are scattered on the ground.",
        "source": "T03n0190_006:0680c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "高座周匝，有諸珍寶百千萬億，莊嚴放光顯耀彼宮。",
        "translation": "Surrounding the high throne are a hundred thousand million treasures that adorn and shine brightly from that palace.",
        "source": "T03n0190_006:0680c11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼宮上下寶網羅覆，於彼羅網多懸金鈴。",
        "translation": "Above and below that palace, they're covered with a web of treasures, and there are many gold bells suspended from that web.",
        "source": "T03n0190_006:0680c12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸金鈴出聲微妙。",
        "translation": "Those golden bells emit a subtle sound.",
        "source": "T03n0190_006:0680c13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼大寶宮復出無量種種光明。",
        "translation": "Measureless and varied lights also emanate from that great, jeweled palace.",
        "source": "T03n0190_006:0680c13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼寶宮殿，千萬幡蓋，種種妙色，映覆於上。",
        "translation": "In that jeweled palace, thousands of banners and shrouds of various wonderful colors reflect from above.",
        "source": "T03n0190_006:0680c14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼大宮殿，垂諸旈蘇，無量無邊百千萬億。",
        "translation": "Those great palace halls are draped with tassels that are measureless and limitless, hundreds of thousands of millions of them.",
        "source": "T03n0190_006:0680c15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天玉女，各持種種七寶音聲，作樂讚歎，說於菩薩往昔無量無邊功德。",
        "translation": "The gods and jade maidens each carry a variety of sounds made from the seven jewels, making musical praises, and they explain the immeasurable and limitless merits of the bodhisattva from the past.",
        "source": "T03n0190_006:0680c16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護世四王百千萬億，在於左右守護彼宮；千萬帝釋禮拜彼宮；千萬梵天恭敬彼宮；又諸菩薩百千萬億那由他眾，護持彼宮；十方諸佛，有於萬億那由他數，護念彼宮。",
        "translation": "The four guardian kings of the world, numbering a hundred thousand million, guarded the palace from side to side; ten million Indra worshipped the palace; ten million Brahmā gods venerated the palace; a hundred thousand million nayutas of bodhisattvas guarded the palace; and the buddhas of the ten directions, numbering a hundred thousand million nayutas, guarded and remembered the palace.",
        "source": "T03n0190_006:0680c18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "百千萬億那由他劫，所修行行諸波羅蜜，福報成就，因緣具足，日夜增長，無量功德，悉皆莊嚴，如是如是，難說難說。",
        "translation": "The thousand trillion nayutas of eons spent cultivating the practice of the perfections, the accomplishment of merits, the fulfillment of causes and conditions, and their daily and nightly growth, all adorned with measureless virtues, such and such, which are difficult to explain and inexplicable.",
        "source": "T03n0190_006:0680c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼大微妙師子高座，菩薩坐上，告於一切諸天眾言：『汝等諸天！",
        "translation": "\"On that great, marvelous lion's high seat, the bodhisattva sat up and addressed the gods, saying, 'You gods!",
        "source": "T03n0190_006:0680c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此一百八法明門，一生補處菩薩大士，在兜率宮，欲下託生於人間者，於天眾前，要須宣暢說此一百八法明門，留與諸天，以作憶念，然後下生。",
        "translation": "Now, when this 108 dharma-mahāsattva-mahāsattva in the palace of Tuṣita wants to be reborn here among humans, he must explain these 108 dharma-mahāsattva-mahāsattvas to the gods in order to leave them with the memory of the gods before descending into the heavens.",
        "source": "T03n0190_006:0680c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等諸天！",
        "translation": "You gods!",
        "source": "T03n0190_006:0680c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今可至心諦聽諦受，我今說之。",
        "translation": "Now, you can wholeheartedly listen and accept it, as I've explained it.",
        "source": "T03n0190_006:0680c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一百八法明門者何？",
        "translation": "What is the gate of understanding of the 108 teachings?",
        "source": "T03n0190_006:0681a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『正信，是法明門，不破堅牢心故。",
        "translation": "\"'Correct faith is the method of knowledge, which doesn't refute a resolute mind.'",
        "source": "T03n0190_006:0681a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『淨心，是法明門，無濁穢故。",
        "translation": "\"'A pure mind is the gate of knowledge of the teaching, which is unsullied.'",
        "source": "T03n0190_006:0681a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『歡喜，是法明門，安隱心故。",
        "translation": "\"'Rejoicing, which is the method's insightful gate, calms the mind.",
        "source": "T03n0190_006:0681a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『愛樂，是法明門，令心清淨故。",
        "translation": "\"This is the profound approach of the teaching to delight, which purifies the mind.",
        "source": "T03n0190_006:0681a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『身行淨行，是法明門，三業淨故。",
        "translation": "\"Pure conduct in bodily activities is the Dharma gate of insight, which purifies the three activities.",
        "source": "T03n0190_006:0681a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『口行淨行，是法明門，斷四惡故。",
        "translation": "\"The practice of purifying speech is the method of knowledge that stops the four evils.",
        "source": "T03n0190_006:0681a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『意行淨行，是法明門，斷三毒故。",
        "translation": "\"The practice of purifying the mind is the Dharma gate of insight, which stops the three poisons.",
        "source": "T03n0190_006:0681a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『念佛，是法明門，觀佛清淨故。",
        "translation": "\"\"Mindfulness of the Buddha is the method that serves as a gate of insight, which purifies the contemplation of the Buddha.",
        "source": "T03n0190_006:0681a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『念法，是法明門，觀法清淨故。",
        "translation": "\"'Mindfulness of the Dharma is the Dharma gate of insight, which observes the purity of the Dharma.'",
        "source": "T03n0190_006:0681a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『念僧，是法明門，得道堅牢故。",
        "translation": "\"\"Mindfulness of the saṃgha is the Dharma-illumination gate, which makes the path attainable and resolute.",
        "source": "T03n0190_006:0681a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『念施，是法明門，不望果報故。",
        "translation": "\"\"Mindfulness of generosity is the Dharma's insightful gate, so you don't expect rewards.",
        "source": "T03n0190_006:0681a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『念戒，是法明門，一切願具足故。",
        "translation": "\"\"Mindfulness of precepts is the Dharma gate of insight, so all vows are fulfilled.",
        "source": "T03n0190_006:0681a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『念天，是法明門，發廣大心故。",
        "translation": "\"\"Mindfulness of gods is the Dharma gate of insight, which gives rise to a vast aspiration.",
        "source": "T03n0190_006:0681a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『慈，是法明門，一切生處善根攝勝故。",
        "translation": "\"'Kindness is the Dharma gate of insight, which subsumes the good roots of all birth places.'",
        "source": "T03n0190_006:0681a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『悲，是法明門，不殺害眾生故。",
        "translation": "\"\"Compassion is the Dharma gate of insight, which prevents the killing and injury of sentient beings.",
        "source": "T03n0190_006:0681a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『喜，是法明門，捨一切不喜事故。",
        "translation": "\"\"Joy, this is the teaching's approach of insight, which is to abandon all unpleasant situations.",
        "source": "T03n0190_006:0681a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『捨，是法明門，厭離五欲故。",
        "translation": "\"*'Equanimity, which is the teaching's profound approach, is because one is disillusioned with the five desires.'",
        "source": "T03n0190_006:0681a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『無常觀，是法明門，觀三界欲故。",
        "translation": "\"'Contemplation of impermanence is the method of knowing the teaching, which is to observe the three realms of desire.'",
        "source": "T03n0190_006:0681a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『苦觀，是法明門，斷一切願故。",
        "translation": "\"'Contemplation of suffering is the method of insight that stops all vows.'",
        "source": "T03n0190_006:0681a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『無我觀，是法明門，不染著我故。",
        "translation": "\"'Contemplation of selflessness is the method of knowledge, which is the gate of not being defiled by attachment to self.'",
        "source": "T03n0190_006:0681a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『寂定觀，是法明門，不擾亂心意故。",
        "translation": "\"'Contemplation of quiescence and concentration is the method of insight that doesn't disturb the mind.'",
        "source": "T03n0190_006:0681a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『慚愧，是法明門，內心寂定故。",
        "translation": "\"\"Shamefulness is the Dharma gate of insight, which is the result of a still, concentrated internal mind.",
        "source": "T03n0190_006:0681a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『羞耻，是法明門，外惡滅故。",
        "translation": "\"`Shame is the gate of knowledge of the teaching, which ceases external evil.'",
        "source": "T03n0190_006:0681a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『實，是法明門，不誑天人故。",
        "translation": "\"\"Truth is the gate of insight of the Dharma, which doesn't deceive gods and humans.",
        "source": "T03n0190_006:0681a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『真，是法明門，不誑自身故。",
        "translation": "\"True, it's the method of knowing the teaching, which doesn't deceive oneself.",
        "source": "T03n0190_006:0681a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『法行，是法明門，隨順法行故。",
        "translation": "\"*'Practice of the Dharma, which is the gate of knowledge of the Dharma, is the result of following the practice of the Dharma.'",
        "source": "T03n0190_006:0681a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『三歸，是法明門，淨三惡道故。",
        "translation": "\"\"The three refuges are the Dharma-meditative approach that purifies the three bad destinies.",
        "source": "T03n0190_006:0681a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『知恩，是法明門，不捨善根故。",
        "translation": "\"\"Knowing kindness is the Dharma gate of insight, so you don't abandon your good roots.",
        "source": "T03n0190_006:0681a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『報恩，是法明門，不欺負他故。",
        "translation": "\"'Returning kindness is the Dharma gate of insight, so you don't deceive others.'",
        "source": "T03n0190_006:0681b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『不自欺，是法明門，不自譽故。",
        "translation": "\"'Not deceiving oneself is the Dharma gate of insight, which is why one doesn't praise oneself.",
        "source": "T03n0190_006:0681b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『為眾生，是法明門，不毀呰他故。",
        "translation": "\"'For the sake of sentient beings, this is the method of knowledge, so you don't disparage others.'",
        "source": "T03n0190_006:0681b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『為法，是法明門，如法而行故。",
        "translation": "\"'For the sake of the Dharma, it's the method of knowledge of the Dharma, so you conduct yourself according to the Dharma.'",
        "source": "T03n0190_006:0681b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『知時，是法明門，不輕言說故。",
        "translation": "\"This is the method of knowing when, which is the gate of insight of the Dharma, and not speaking lightly about it.",
        "source": "T03n0190_006:0681b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『攝我慢，是法明門，智慧滿足故。",
        "translation": "\"This is the method of insight that contains self-conceit and fulfills wisdom.",
        "source": "T03n0190_006:0681b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『不生惡心，是法明門，自護護他故。",
        "translation": "\"'Not giving rise to bad thoughts is the method of knowledge of the teaching, which protects oneself and guards others.'",
        "source": "T03n0190_006:0681b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『無障礙，是法明門，心無疑惑故。",
        "translation": "\"'No obstruction,' which is the gate of knowledge of the teaching, because the mind is free of doubt.",
        "source": "T03n0190_006:0681b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『信解，是法明門，決了第一義故。",
        "translation": "\"'Belief and understanding are the gate of knowledge of the teaching, which makes it possible to fully understand the supreme truth.'",
        "source": "T03n0190_006:0681b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『不淨觀，是法明門，捨欲染心故。",
        "translation": "\"'Ungoverned contemplation is the method of knowledge, which is the gate of insight for abandoning desire and defilement in the mind.'",
        "source": "T03n0190_006:0681b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『不諍鬪，是法明門，斷瞋訟故。",
        "translation": "\"This is the teaching of not fighting, which is the gate of knowledge of the teaching, so it stops anger.",
        "source": "T03n0190_006:0681b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『不癡，是法明門，斷殺生故。",
        "translation": "\"This is the teaching of not being deluded, which is the gate of insight for stopping killing.",
        "source": "T03n0190_006:0681b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『樂法義，是法明門，求法義故。",
        "translation": "\"'Enjoying the meaning of the Dharma is the gate of knowledge of the Dharma, which seeks the meaning of the Dharma.'",
        "source": "T03n0190_006:0681b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『愛法明，是法明門，得法明門故。",
        "translation": "\"'Loving the clarity of the teaching is the gate of knowledge of the teaching, which obtains the clarity of the teaching.'",
        "source": "T03n0190_006:0681b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『求多聞，是法明門，正觀法相故。",
        "translation": "\"Seeking to be well-versed is the gate of knowledge of the Dharma, which is the correct way to examine the characteristics of the Dharma.",
        "source": "T03n0190_006:0681b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『正方便，是法明門，具正行故。",
        "translation": "\"'Correct skillful means is the gate of knowledge of the Dharma, which is endowed with correct practices.'",
        "source": "T03n0190_006:0681b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『知名色，是法明門，除諸障礙故。",
        "translation": "\"This is the gate of knowledge of the teaching to know form, which removes obstacles.",
        "source": "T03n0190_006:0681b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『除因見，是法明門，得解脫故。",
        "translation": "\"'Removing causal views is the method of knowledge of the teaching, which leads to liberation.'",
        "source": "T03n0190_006:0681b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『無怨親心，是法明門，於怨親中，生平等故。",
        "translation": "\"This is the method of knowledge of the absence of hostile intimacy, which creates equality among hostile intimates.",
        "source": "T03n0190_006:0681b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『陰方便，是法明門，知諸苦故。",
        "translation": "\"'Skillful means of the aggregates is the teaching that brings insight into knowing suffering.'",
        "source": "T03n0190_006:0681b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸大平等，是法明門，斷於一切和合法故。",
        "translation": "Equality of the elements is the Dharma gate of insight, which ends all harmonization.",
        "source": "T03n0190_006:0681b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『諸入，是法明門，修正道故。",
        "translation": "\"'Entrances are the Dharma gate of insight, which corrects the path.'",
        "source": "T03n0190_006:0681b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『無生忍，是法明門，證滅諦故。",
        "translation": "\"'The acceptance of nonarising is the Dharma gate of insight, which realizes the truth of cessation.'",
        "source": "T03n0190_006:0681b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『身念處，是法明門，諸法寂靜故。",
        "translation": "\"\"The mindfulness of body is the Dharma gate of insight, which brings about the quiescence of all dharmas.",
        "source": "T03n0190_006:0681b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『受念處，是法明門，斷一切諸受故。",
        "translation": "\"\"The mindfulness of feeling is the gate of understanding of the Dharma, which ends all feelings.",
        "source": "T03n0190_006:0681b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『心念處，是法明門，觀心如幻化故。",
        "translation": "\"\"The mindfulness of mind is the gate of knowledge of the Dharma, which observes that the mind is illusory and transformative.",
        "source": "T03n0190_006:0681b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『法念處，是法明門，智慧無翳故。",
        "translation": "\"The 'mindfulness of dharmas is the gate of insight of dharmas, which is the result of unobscured wisdom.'",
        "source": "T03n0190_006:0681b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『四正懃，是法明門，斷一切惡成諸善故。",
        "translation": "\"The 'four correct endeavors are the gate of Dharma insight, which stops all evil and produces goodness.'",
        "source": "T03n0190_006:0681b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『四如意足，是法明門，身心輕故。",
        "translation": "\"The 'four miraculous abilities' are the gate of knowledge of the Dharma, which makes body and mind light.",
        "source": "T03n0190_006:0681b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『信根，是法明門，不隨他語故。",
        "translation": "\"The 'faculty of faith, which is the gate of knowledge of the Dharma, doesn't follow the words of others.'",
        "source": "T03n0190_006:0681c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『精進根，是法明門，善得諸智故。",
        "translation": "\"\"The faculty of effort is the gate of knowledge of the Dharma, which makes good attainers of wisdom.",
        "source": "T03n0190_006:0681c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『念根，是法明門，善作諸業故。",
        "translation": "\"The faculty of mindfulness, which is the method of knowledge, is because it's skillful in creating actions.",
        "source": "T03n0190_006:0681c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『定根，是法明門，心清淨故。",
        "translation": "\"The faculty of concentration, which is the gate of knowledge of the Dharma, purifies the mind.",
        "source": "T03n0190_006:0681c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『慧根，是法明門，現見諸法故。",
        "translation": "\"The faculty of wisdom, which is the gate of knowledge of the Dharma, makes it possible to see things clearly.",
        "source": "T03n0190_006:0681c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『信力，是法明門，過諸魔力故。",
        "translation": "\"\"The power of faith, which is the gate of knowledge of the Dharma, is superior to the power of Māra.",
        "source": "T03n0190_006:0681c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『精進力，是法明門，不退轉故。",
        "translation": "\"\"The power of effort is the gate of knowledge of the Dharma, which prevents regression.",
        "source": "T03n0190_006:0681c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『念力，是法明門，不共他故。",
        "translation": "\"\"The power of mindfulness is the gate of knowledge of the Dharma, which is not shared with others.",
        "source": "T03n0190_006:0681c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『定力，是法明門，斷一切念故。",
        "translation": "\"\"The power of concentration is the dharma-lucid gate, which stops all thoughts.",
        "source": "T03n0190_006:0681c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『慧力，是法明門，離二邊故。",
        "translation": "\"\"The power of wisdom is the gate of knowledge of the Dharma, which frees you from two extremes.",
        "source": "T03n0190_006:0681c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『念覺分，是法明門，如諸法智故。",
        "translation": "\"The awakening factor of mindfulness is the gate of Dharma knowledge, which is like the cognition of all dharmas.",
        "source": "T03n0190_006:0681c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『擇法覺分，是法明門，照明一切諸法故。",
        "translation": "\"The awakening factor of discriminating qualities is the gate of Dharma insight, which illuminates all qualities.",
        "source": "T03n0190_006:0681c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『精進覺分，是法明門，善知覺故。",
        "translation": "\"The awakening factor of effort is the gate of Dharma knowledge, which is the result of well-knowing awakenings.",
        "source": "T03n0190_006:0681c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『喜覺分，是法明門，得諸定故。",
        "translation": "\"The awakening factor of joy is the Dharma gate of insight, which is the result of attaining concentration.",
        "source": "T03n0190_006:0681c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『除覺分，是法明門，所作已辦故。",
        "translation": "\"The awakening factor of removal is the Dharma gate of insight, which is the result of having accomplished what's to be done.",
        "source": "T03n0190_006:0681c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『定覺分，是法明門，知一切法平等故。",
        "translation": "\"The awakening factor of concentration is the method of knowing the equality of all things because it's the aspect of the knowledge of the teaching.",
        "source": "T03n0190_006:0681c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『捨覺分，是法明門，厭離一切生故。",
        "translation": "\"The awakening factor of equanimity is the method of knowing the teaching, which is to become disillusioned with all birth.",
        "source": "T03n0190_006:0681c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『正見，是法明門，得漏盡聖道故。",
        "translation": "\"The awakening factor of right view is the method of knowledge, which is the noble path of attaining the end of contaminants.",
        "source": "T03n0190_006:0681c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『正分別，是法明門，斷一切分別無分別故。",
        "translation": "\"Right discrimination is the gate of knowledge of the Dharma, which ends all discrimination and makes no distinctions.",
        "source": "T03n0190_006:0681c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『正語，是法明門，一切名字音聲語言，知如響故。",
        "translation": "\"'Right speech is the gate of knowledge of the Dharma, which is the knowledge of all names, sounds, and words as sounds.",
        "source": "T03n0190_006:0681c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『正業，是法明門，無業無報故。",
        "translation": "\"Right action is the gate of Dharma insight, because there's no action and no retribution.",
        "source": "T03n0190_006:0681c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『正命，是法明門，除滅一切惡道故。",
        "translation": "\"'Right livelihood is the Dharma gate of insight, which removes all bad destinies.'",
        "source": "T03n0190_006:0681c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『正行，是法明門，至彼岸故。",
        "translation": "\"Right practice is the Dharma gate of insight, which brings you to the other shore.",
        "source": "T03n0190_006:0681c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『正念，是法明門，不思念一切法故。",
        "translation": "\"Right mindfulness is the Dharma gate of insight, which is the result of not thinking about all dharmas.",
        "source": "T03n0190_006:0681c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『正定，是法明門，得無散亂三昧故。",
        "translation": "\"'Right concentration, which is the method of knowledge, attains the concentration of no distraction.'",
        "source": "T03n0190_006:0681c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『菩提心，是法明門，不斷三寶故。",
        "translation": "\"'Bodhi mind, this is the method of knowledge, which is the gate to not stopping at the Three Treasures.'",
        "source": "T03n0190_006:0681c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『依倚，是法明門，不樂小乘故。",
        "translation": "\"'Reliance is the Dharma gate of insight, so you don't delight in lesser vehicles.'",
        "source": "T03n0190_006:0681c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『正信，是法明門，得最勝佛法故。",
        "translation": "\"Correct faith, which is the method of knowledge, attains supreme Buddhahood.",
        "source": "T03n0190_006:0681c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『增進，是法明門，成就一切諸善根法故。",
        "translation": "\"\"Increasing advancement is the Dharma's insightful gate, which accomplishes all the things with good roots.",
        "source": "T03n0190_006:0682a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『檀度，是法明門，念念成就，相好莊嚴佛土教化慳貪諸眾生故。",
        "translation": "\"Dadao, this is the method that clearly shows the way to achieve mindfulness, and it's the way to adorn the Buddha's land with beautiful features and teach stingy and greedy sentient beings.",
        "source": "T03n0190_006:0682a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『戒度，是法明門，遠離惡道諸難教化破戒諸眾生故。",
        "translation": "\"*'Vimala-dhātu, this is the method of knowledge, which secludes us from the difficulties of the bad destinies and teaches sentient beings who have violated the precepts.'",
        "source": "T03n0190_006:0682a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『忍度，是法明門，捨一切瞋恚我慢諂曲調戲，教化如是諸惡眾生故。",
        "translation": "\"*'The perfection of forbearance is the method that shows the way to abandon all anger, self-conceit, and flattery and play, so that sentient beings who are thus unwholesome are taught.'",
        "source": "T03n0190_006:0682a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『精進度，是法明門，悉得一切諸善法，教化懈怠諸眾生故。",
        "translation": "\"'Strenuous effort, which is the method of insight, fully attains all good qualities and teaches lazy sentient beings to be lazy.'",
        "source": "T03n0190_006:0682a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『禪度，是法明門，成就一切禪定及諸神通，教化散亂諸眾生故。",
        "translation": "\"*'Meditation is the method of knowledge that accomplishes all meditations and supernormal powers and teaches and disciplines disordered sentient beings.'",
        "source": "T03n0190_006:0682a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『智度，是法明門，斷無明黑暗及著諸見，教化愚癡諸眾生故。",
        "translation": "\"\"Wisdom is the gate of knowledge of the Dharma that ends the darkness of ignorance and attachment to views and teaches deluded sentient beings.",
        "source": "T03n0190_006:0682a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『方便，是法明門，隨眾生所見威儀，而示現教化，成就一切諸佛法故。",
        "translation": "\"'Skillful means, which is the method of knowledge, shows and teaches sentient beings according to the manner in which they see and conduct themselves, and accomplishes all the Buddha's teachings.'",
        "source": "T03n0190_006:0682a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『四攝法，是法明門，攝受一切眾生，得菩提已，施一切眾生法故。",
        "translation": "\"'The four methods of gathering in sentient beings are the Dharma gate of insight, which gather in all sentient beings, and after attaining enlightenment, give the Dharma to all sentient beings.'",
        "source": "T03n0190_006:0682a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『教化眾生，是法明門，自不受樂，不疲惓故。",
        "translation": "\"'Teaching and transforming sentient beings is the method that clearly shows the way, so they don't experience pleasure and tirelessness.'",
        "source": "T03n0190_006:0682a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『攝受正法，是法明門，斷一切眾生諸煩惱故。",
        "translation": "\"'To gather in the right dharma is the method of knowledge, which ends the afflictions of all sentient beings.'",
        "source": "T03n0190_006:0682a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『福聚，是法明門，利益一切諸眾生故。",
        "translation": "\"\"This is the method of knowledge of the accumulation of merit, which benefits all sentient beings.",
        "source": "T03n0190_006:0682a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『修禪，是法明門，滿足十力故。",
        "translation": "\"This is the method of insight for cultivating meditation, which fulfills the ten powers.",
        "source": "T03n0190_006:0682a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『寂定，是法明門，成就如來三昧具足故。",
        "translation": "\"\"Stillness and concentration are the Dharma gate of insight, which accomplishes the perfection of the Tathāgata's concentration.",
        "source": "T03n0190_006:0682a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『慧見，是法明門，智慧成就滿足故。",
        "translation": "\"*'Wisdom and insight, which is the method of insight, accomplish the fulfillment of wisdom.'",
        "source": "T03n0190_006:0682a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『入無礙辯，是法明門，得法眼成就故。",
        "translation": "\"'Entering unhindered discernment is the method of knowledge, which brings about the accomplishment of the Dharma eye.'",
        "source": "T03n0190_006:0682a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『入一切行，是法明門，得佛眼成就故。",
        "translation": "\"'Entering all practices is the method of knowledge, which brings about the accomplishment of the Buddha's eye.'",
        "source": "T03n0190_006:0682a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『成就陀羅尼，是法明門，聞一切諸佛法，能受持故。",
        "translation": "\"'Accomplishing the dhāraṇī is the method of knowledge, which enables one to hear all the Buddha's teachings and maintain them.'",
        "source": "T03n0190_006:0682a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『得無礙辯，是法明門，令一切眾生皆歡喜故。",
        "translation": "\"'Attaining unhindered eloquence is the method of knowledge, which makes all sentient beings happy.'",
        "source": "T03n0190_006:0682a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『順忍，是法明門，順一切諸佛法故。",
        "translation": "\"'Shunning patience is the method of knowledge, which accords with all the Buddha's teachings.'",
        "source": "T03n0190_006:0682a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『得無生法忍，是法明門，得受記故。",
        "translation": "\"This is the method of knowledge for attaining the forbearance of the nonarising of dharmas, which is the way to receive assurance of assurance.",
        "source": "T03n0190_006:0682b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『不退轉地，是法明門，具足往昔諸佛法故。",
        "translation": "\"'The ground of nonretrogression is the method of knowledge, which is the fulfillment of all the Buddha's teachings from the past.'",
        "source": "T03n0190_006:0682b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『從一地至一地智，是法明門，灌頂成就一切智故。",
        "translation": "\"'From the first ground to the first ground of cognition, this is the method of knowledge, because it's the consecration that accomplishes omniscience.'",
        "source": "T03n0190_006:0682b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『灌頂地，是法明門，從生出家，乃至得成阿耨多羅三藐三菩提故。』",
        "translation": "\"'The stage of consecration is the gate of Dharma knowledge that leads from birth and renunciation to the attainment of unsurpassed, correct enlightenment.'",
        "source": "T03n0190_006:0682b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，護明菩薩說是語已，告彼一切諸天眾言：『諸天當知！",
        "translation": "\"After speaking these words, the luminous-protecting bodhisattva addressed the gods, saying, 'Gods, you must know!'",
        "source": "T03n0190_006:0682b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是一百八法明門，留與諸天。",
        "translation": "These are the one hundred and eight insights on the Dharma that I'm leaving with the gods.",
        "source": "T03n0190_006:0682b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等受持，心常憶念，勿令忘失。』",
        "translation": "Accept them, always remember them in your minds, and don't let them be forgotten.'",
        "source": "T03n0190_006:0682b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛本行集經卷第六",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Volume 6",
        "source": "T03n0190_006:0682b10_0",
        "is_bad_quality": false
    }
]