[
    {
        "source_sentence": "方廣大莊嚴經卷第九",
        "translation": "Fangguang zhuangyan jing, vol. 9",
        "source": "T03n0187_009:0590b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中天竺國沙門地婆訶羅奉　詔譯",
        "translation": "Translated by imperial order from the Central India by the ascetic Divākara",
        "source": "T03n0187_009:0590b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "降魔品第二十一",
        "translation": "Twenty-first Chapter of the Destruction of Māras",
        "source": "T03n0187_009:0590b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告諸比丘言：「比丘當知，菩薩坐菩提座已作是思惟：『我於今者當成正覺，魔王波旬居欲界中最尊最勝，應召來此而降伏之；復有欲界諸天及魔波旬所有眷屬久積善業，當得見我師子遊戲發阿耨多羅三藐三菩提心。』",
        "translation": "It was then that the Buddha addressed the monks, \"Monks, you should know that after sitting on the throne of enlightenment, the bodhisattva had this thought, 'Now, I will become perfectly enlightened, and Māra King Pāpīyān, the most honored and superior of the desire realms, should be summoned here to subdue him; furthermore, the desire realm gods and Māra Pāpīyān's retinue have accumulated good deeds over time, and they will be able to see my lion play and arouse the mind of unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0187_009:0590b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已放眉間白毫相光，其光名為降伏魔怨，遍照三千大千世界傍耀魔宮。",
        "translation": "After he had this thought, he released a white-haired light between his eyebrows that's called the light that subdues Māra's enemies and shines everywhere in the 3,000 great one-thousand worlds and near Māra's palace.",
        "source": "T03n0187_009:0590b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔王波旬於光明中，聞如是偈：「『世有最勝清淨人，　　經歷多時修行滿，　　是彼釋種捨王位，　　今現坐於菩提場。",
        "translation": "In that light, Devil King Pāpīyān heard this verse, \"There's the most excellent and pure person in the world who has cultivated and fulfilled his practice over a long period of time, and that's the Śākyas who have abandoned their position as king and are now sitting in the site of enlightenment.",
        "source": "T03n0187_009:0590b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝身稱有大勇猛，　　當往樹下共相挍，　　其人已達於彼岸，　　既自能度當度他。",
        "translation": "You yourself are said to have great courage, so go under the tree and test each other; that person has reached the other shore, and since they can save themselves, they'll save others.",
        "source": "T03n0187_009:0590b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　應滅三惡悉無餘，　　令彼人天轉充滿，　　若使得證菩提已，　　不久空虛汝境界。",
        "translation": "He should extinguish all three evils without remainder, causing them to become filled with humans and gods, and if he has realized enlightenment, he will soon be void of your realm.",
        "source": "T03n0187_009:0590b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　愚癡黑暗瞋恚伴，　　悉當銷散盡無餘，　　彼定廣開甘露門，　　汝等今者為何計？』」",
        "translation": "The companions of folly, darkness, and anger will all be destroyed without remainder, and he will surely open wide the gate of ambrosia.",
        "source": "T03n0187_009:0590b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「時魔波旬聞是偈已，復於夢中見三十二不祥之相：一者見其宮殿悉皆黑暗。",
        "translation": "The Buddha told the monks, \"After Māra Pāpīyān heard this verse, he again saw thirty-two ominous signs in his dream: First, he saw that his palace was completely dark.",
        "source": "T03n0187_009:0590b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者見其宮中沙礫塵土處處飛揚。",
        "translation": "Second, he saw sand and dust flying everywhere in his palace.",
        "source": "T03n0187_009:0590b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者見其宮殿破壞而生荊棘糞穢盈滿。",
        "translation": "Third, he saw his palace destroyed and filled with thorns, dung, and filth.",
        "source": "T03n0187_009:0590b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者自見驚怖不安東西馳走。",
        "translation": "Four, he sees himself terrified and anxious, rushing from place to place.",
        "source": "T03n0187_009:0590b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者自見寶冠墮落頭髮解散。",
        "translation": "Five, he sees his jeweled crown fall off and his hair fall out.",
        "source": "T03n0187_009:0590b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六者見其園中樹木無有花果。",
        "translation": "Sixth, he sees a tree in his garden that has no flowers or fruit.",
        "source": "T03n0187_009:0590c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七者自見頭破腦流於地。",
        "translation": "Seven, he sees his head split open and his brain flowing to the ground.",
        "source": "T03n0187_009:0590c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八者見其自心熱惱。",
        "translation": "Eight, he sees his own mind burning with anguish.",
        "source": "T03n0187_009:0590c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九者見其園中樹木枝葉枯落。",
        "translation": "Nine, he sees the branches and leaves of the trees in his garden wither.",
        "source": "T03n0187_009:0590c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十者見其池井皆竭。",
        "translation": "Ten, he sees that his pond and well are all dried up.",
        "source": "T03n0187_009:0590c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十一者見其宮中鸚鵡舍利、迦陵頻伽、共命諸鳥羽翮摧殘。",
        "translation": "11. He sees the parrot Śāriputra, kalaviṅka, and the birds of common life in his palace with their feathers broken.",
        "source": "T03n0187_009:0590c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十二者見其宮中鍾鼓琴瑟、簫笛箜篌，種種樂器悉皆斷壞委擲於地。",
        "translation": "Twelve! They see bells, drums, lutes, carols, and harps of all kinds in their palace broken and thrown to the ground.",
        "source": "T03n0187_009:0590c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十三者見其親族憂惱舉手拍頭悵然而立。",
        "translation": "Thirteen sees their relatives standing upright with their hands raised and heads slapped in distress.",
        "source": "T03n0187_009:0590c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十四者自見其身墜墮床下損傷頭面。",
        "translation": "Fourteen sees his body fall to the ground and injure his head and face.",
        "source": "T03n0187_009:0590c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十五者見其諸子有威力者詣菩提場頂禮菩薩。",
        "translation": "15. He sees his sons and daughters who have authority go to the site of enlightenment to pay homage to the Bodhisattva.",
        "source": "T03n0187_009:0590c09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十六者見其諸女悲哭懊惱。",
        "translation": "Sixteen sees his daughters weeping with sorrow and distress.",
        "source": "T03n0187_009:0590c10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十七者自見其身衣服垢膩。",
        "translation": "17. He sees for himself that his clothes are dirty and worn out.",
        "source": "T03n0187_009:0590c11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十八者自見其身羸瘦顦顇頭坌塵土。",
        "translation": "18. He sees himself emaciated and weary, with his head covered in dust.",
        "source": "T03n0187_009:0590c11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十九者見其樓閣窓牖悉皆崩摧。",
        "translation": "19. He sees his mansions and windows all crumbling and falling apart.",
        "source": "T03n0187_009:0590c12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十者見其軍將鬼神夜叉羅剎鳩槃茶等，悉皆刎首狼藉在地。",
        "translation": "20. He sees his generals, ghosts, nightjars, Rāṣṭrapāṇas, and kumbhāṇḍas all cutting their heads and leaving them in a mess on the ground.",
        "source": "T03n0187_009:0590c13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十一者見其珠寶瓔珞為火所燒。",
        "translation": "21. He sees his jewelry and jewelry burned by fire.",
        "source": "T03n0187_009:0590c15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十二者見欲界四天大王、釋提桓因，乃至他化自在諸天向菩薩前住立瞻仰。",
        "translation": "Twenty-two sees the four great kings of the desire realm, Śakra Devānām-Indra, and the paranirmita-vaśavartin gods standing before the bodhisattva and venerating him.",
        "source": "T03n0187_009:0590c15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十三者見其自身對敵鬪戰拔刀不出。",
        "translation": "Twenty-three sees himself fighting against an enemy, drawing his sword and not leaving it.",
        "source": "T03n0187_009:0590c17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十四者見其自身可惡復出惡聲。",
        "translation": "24. Someone who sees that he himself is hateful and makes a bad noise.",
        "source": "T03n0187_009:0590c18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十五者見其左右及己眷屬皆悉背逆捨之而去。",
        "translation": "25. Someone who sees their left and right and their retinue all turn their backs on them and abandon them.",
        "source": "T03n0187_009:0590c19_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十六者見吉祥瓶皆悉破壞。",
        "translation": "26. That person sees an auspicious vase that's all destroyed.",
        "source": "T03n0187_009:0590c20_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十七者見那羅天唱不祥音。",
        "translation": "27. A person sees the Nādika gods singing an ominous tune.",
        "source": "T03n0187_009:0590c21_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十八者見歡喜神稱不歡喜。",
        "translation": "28. He sees the joyful gods calling him unhappy.",
        "source": "T03n0187_009:0590c22_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十九者見虛空中黑暗煙霧處處彌滿。",
        "translation": "29. A person sees darkness and smoke filling the sky everywhere.",
        "source": "T03n0187_009:0590c23_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十者見護宮神舉聲大哭。",
        "translation": "30. He sees the palace guardian god raising his voice and wailing.",
        "source": "T03n0187_009:0590c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十一者見自在之處咸不自在。",
        "translation": "31. A person sees that where he's at ease, everyone isn't at ease.",
        "source": "T03n0187_009:0590c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十二者自見其宮震動不安。」",
        "translation": "Thirty-two see their palace shake and become uneasy.\"",
        "source": "T03n0187_009:0590c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「魔王波旬從夢寤已，遍體戰慄心懷恐懼，召其大臣而語之曰：『我聞空中聲言：「釋種太子，出家學道苦行六年，坐菩提座當成正覺，其道若成必空我境。」",
        "translation": "The Buddha addressed the monks, \"When Māra King Pāpīyān awoke from his dream, he was terrified and frightened, and he summoned his ministers and told them, 'I heard a voice in the air saying, 'Prince Śākyamuni, who left home, trained on the path, and practiced asceticism for six years, will sit on the throne of enlightenment and become perfectly enlightened; if he accomplishes his path, he'll surely become empty of my objective.'\"",
        "source": "T03n0187_009:0590c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等軍眾宜往其所而摧伏之。』",
        "translation": "It would be wise for you armies to go to him and subdue him.'",
        "source": "T03n0187_009:0591a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「『汝當率領大兵眾，　　菩提樹下制沙門，　　諸君如能愛敬我，　　與彼戰鬪速令去。",
        "translation": "He then spoke a verse, saying, \"You must lead a large army to restrain the ascetics under the bodhi tree, and if you gentlemen can love and respect me, you'll quickly send them away in battle.",
        "source": "T03n0187_009:0591a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　彼志方空我境界，　　使為緣覺及聲聞，　　若不滅之令永斷，　　世間成佛無休已。』",
        "translation": "If you can respect me and fight with them, you'll quickly make them leave.' 'They aspire to make the realm of emptiness theirs, making it the realm of pratyekabuddhas and direct disciples, and if they don't cease and make it permanent, the world will never cease to be a buddha.'",
        "source": "T03n0187_009:0591a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時魔王主兵大臣諫於波旬，而說頌曰：「『大王所領四天主，　　及以八部諸龍神，　　欲色諸天隨梵釋，　　皆悉頂禮歸依彼。",
        "translation": "\"It was then that the king of Māra's army remonstrated with Pāpīyān and spoke in verse, \"The four lords of heaven under the king, the eight dragons and gods, and the gods of desire and form, like Brahmā and Śākyamuni, all bow down in reverence and rely on him.",
        "source": "T03n0187_009:0591a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　王之諸子勝智者，　　勇力世間無等倫，　　王軍滿八十由旬，　　夜叉羅剎并諸鬼，　　雖復近王居左右，　　恒常敬彼無過人，　　皆悉合掌生尊重，　　私以香花而奉獻。",
        "translation": "The king's sons are superior and wise, their courage is unequalled in the world, and the king's army fills 80 yojanas, while the yakṣas, rājasas, and demons, even though they are near the king's left and right, always revere him like no one else, always put their hands together and show respect, and they offer flowers and incense to each other.",
        "source": "T03n0187_009:0591a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我覩如斯事相已，　　定知菩薩勝王軍。",
        "translation": "After I saw such an event, I definitely knew that the bodhisattva was superior to the king's army.",
        "source": "T03n0187_009:0591a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　王之兵眾所居處，　　鵂鶹野干為怪響，　　菩提樹下甚清淨，　　善禽瑞獸送和音。",
        "translation": "Where the king's army lives, the owls make strange noises in the wilderness, but it's quite pure under the bodhi tree, where good birds and rare animals send their harmonizing sounds.",
        "source": "T03n0187_009:0591a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如是吉相彼定強，　　我觀菩薩誰能勝？",
        "translation": "Thus is he certainly strong in auspicious signs, and who can I observe the bodhisattva to be superior to?",
        "source": "T03n0187_009:0591a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　又王軍眾所住處，　　常雨沙礫及埃塵，　　菩提樹下聖所居，　　天雨香花悉盈積。",
        "translation": "\"Where the king's army lives, it always rains sand, gravel, and dust, but under the bodhi tree where the sages live, the sky rains fragrant flowers in abundance.",
        "source": "T03n0187_009:0591a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　王軍所處地高下，　　砂礫瓦石皆充滿，　　菩提樹下坦然平，　　復以七寶而嚴飾。",
        "translation": "The ground where the king's army stands is high and low, filled with gravel and debris, but beneath the bodhi tree it's perfectly level and adorned with seven treasures.",
        "source": "T03n0187_009:0591a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若見如斯前相已，　　有智之者定須還，　　如是莊嚴悉周遍，　　菩薩必當成正覺。",
        "translation": "If someone with wisdom would surely return after seeing such a former appearance, they would surely return, and with such adornment all around, the bodhisattva would surely become perfectly enlightened.",
        "source": "T03n0187_009:0591a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　大王若不從臣諫，　　如夢所見終不虛，　　大王不可犯仙人，　　宜且收兵還本處。",
        "translation": "If the king doesn't heed my advice, then what he sees in his dream will never be false; the king mustn't transgress against the sage, so he should withdraw his troops and return to his home base.",
        "source": "T03n0187_009:0591a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　古昔有王觸仙故，　　呪禁一國悉成灰，　　過去有王名淨德，　　違忤羅闍大仙意，　　令彼彌年遭亢旱，　　叢林稼穡咸不登。",
        "translation": "Once upon a time, a king came into contact with an immortal and had a spell that forbade a whole country from turning to dust. In the past, a king named Jingde disobeyed the wishes of the great sage Rājagṛha, causing them to suffer a long year of drought and a failure of the forest to produce crops.",
        "source": "T03n0187_009:0591a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　王豈不聞圍陀論，　　三十二相必成佛，　　眉間光明白毫相，　　普照十方諸佛國，　　況復如王此軍眾，　　彼豈不能降伏之？",
        "translation": "Has the king not heard the Weeduo treatise, which states that the thirty-two marks of a buddha must become buddha, and that the bright, clear tuft of light between his eyebrows universally illuminates the buddha lands in the ten directions, how could he not subdue an army like this one?",
        "source": "T03n0187_009:0591a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　無見頂相過極天，　　諸天畢竟無能覩，　　行當成彼微妙果，　　世間未聞今得聞。",
        "translation": "'The invisible crown surpasses the highest heaven, and after all, there's nothing the gods can see that will achieve that marvelous result of practice that's unheard of in the world and now can be heard.",
        "source": "T03n0187_009:0591b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　須彌及以諸山等，　　皆悉稽首菩提樹，　　施戒忍進禪定慧，　　歷劫以來修習成，　　而能獨坐破王軍，　　皆是熏修善根力。』」",
        "translation": "Sumeru and the other mountains and others all bow down at the bodhi tree, bestow precepts, tolerate, practice meditation, concentration, and wisdom, which have been cultivated over many eons, and are able to sit alone and refute the king's army because of the power of the good roots that have been cultivated.'\"",
        "source": "T03n0187_009:0591b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「是時波旬聞彼大臣如是偈已，其心悶亂，復召千子，其五百子清白之部，在魔王右歸依菩薩，其五百子冥黑之部，在魔王左贊助魔王。",
        "translation": "The Buddha told the monks, \"After Pāpīyān heard this minister's verse, his mind was distracted, and he summoned another thousand sons, five of whom were from the pure and white group, who relied on the bodhisattva to the right of the king of Māra, and five of whom were from the dark and black group, who were on the king of Māra's left side, to sponsor the king of Māra.",
        "source": "T03n0187_009:0591b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是波旬告語諸子：『汝等宜應一心籌量，以何方計能摧伏彼？』",
        "translation": "Pāpīyān then addressed his sons, 'Should you all single-mindedly contemplate how you can subdue him?'",
        "source": "T03n0187_009:0591b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "右面魔子名曰導師，於波旬前，而說偈言：「『睡龍醉象師子王，　　三獸暴猛猶難觸，　　況復有斯禪定力，　　誰能犯彼大牟尼。』",
        "translation": "The right-faced Māra named Tutor approached Pāpīyān and spoke in verse, saying, 'The sleeping dragon, the drunken elephant, and the lion king are still difficult to touch even when the three animals are violent, so how could anyone with this power of meditation violate that great sage?'",
        "source": "T03n0187_009:0591b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「左面魔子名曰惡慧，亦向波旬而說偈言：「『我若視人人必破，　　吾今看樹樹亦摧，　　怒目所向無全者，　　如值伺命終難活。』",
        "translation": "\"The left-faced Māra named Aggrieved Wisdom also addressed Pāpīyān and spoke in verse, saying, 'If I were to look at anyone, they would surely break down; now I'm looking at a tree and it's destroyed; nothing I direct my angry eye at is whole; if I were to wait for someone's life, it would be difficult to live.'",
        "source": "T03n0187_009:0591b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「右面魔子名曰美音，復向波旬而說偈言：「『人是不堅何足破，　　樹稱危脆任能摧，　　縱汝瞋目須彌崩，　　何能舉眼瞻菩薩？",
        "translation": "\"The demon on the right, named Mayon, also addressed Pāpīyān and spoke in verse, saying, 'Is there enough to break a man who's not strong, or a tree that's called fragile and brittle that can be destroyed?",
        "source": "T03n0187_009:0591b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　設使善浮過大海，　　復能一氣吸滄溟，　　如是之事自可為，　　無能懷惡觀菩薩。』",
        "translation": "Suppose he were to float well across the ocean and then suck in the vast ocean with a single breath, for such a thing he could do for himself, and there's no bodhisattva who can harbor evil.'",
        "source": "T03n0187_009:0591b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「左面魔子名曰百臂，復向波旬而說偈言：「『我今一身有百臂，　　一一皆能放百箭，　　大王但去不假憂，　　如此沙門何足害？』",
        "translation": "\"The left-faced Māra named Hundred Arms again addressed Pāpīyān and spoke in verse, saying, 'Now, I have a hundred arms, and each one of them can shoot a hundred arrows; the king simply leaves without any false hope; why would such an ascetic be harmful?'",
        "source": "T03n0187_009:0591b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「右面魔子名曰妙覺，復向波旬而說偈言：「『縱汝一毛成一臂，　　一一皆能放百箭，　　汝自以此為殊勝，　　豈損菩薩之一毛？",
        "translation": "\"The right-faced Māra, named Sumeru, again addressed Pāpīyān and spoke in verse, saying, 'Even if one of your hairs makes an arm, each one of them can shoot a hundred arrows; how could you make this your own excellence and not harm a single hair of a bodhisattva's head?'",
        "source": "T03n0187_009:0591b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　牟尼定力出世慈，　　毒火兵刃無能害，　　執持刀杖圖為惡，　　散在空中盡成花。",
        "translation": "'The power of Muni's concentration produces worldly compassion, and poisonous fire and weapons are harmless. Holding a sword and staff, they attempt to do evil, scattering them in the air and making them all flowers.",
        "source": "T03n0187_009:0591c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　雖復天人阿修羅，　　夜叉羅剎有大力，　　終為忍辱之所制，　　能令威勢成羸劣。』",
        "translation": "Even though gods, humans, asuras, and yakṣas and rājasas have great strength, they are ultimately restrained by the power of patience, which weakens their might.'",
        "source": "T03n0187_009:0591c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「左面魔子名曰嚴威，復向波旬而說偈言：「『我今能入比丘身，　　為火焚燒盡令滅，　　譬如山火焚枯木，　　一切叢林悉無餘。』",
        "translation": "\"The left-faced Māra named Yama's Might again addressed Pāpīyān and spoke in verse, saying, 'Now, I can enter a monk's body and make it burn up completely, like a mountain fire that consumes withered wood, leaving all the jungles without remainder.'",
        "source": "T03n0187_009:0591c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「右面魔子名曰善目，復向波旬而說偈言：「『世界須彌可燒盡，　　金剛之慧實難焚，　　山移海竭大地銷，　　日月從空皆墮落，　　利益眾生坐道樹，　　未證菩提終不移。』",
        "translation": "\"Again, the right-faced Māra named Sunetra addressed Pāpīyān and spoke in verse, saying, 'The Sumeru world can be burned up, but the adamantine wisdom is really hard to consume. Mountains move, oceans dry up, the earth disappears, the sun and moon fall from the sky, sentient beings sit on the tree of the Way, and they never move until they realize enlightenment.'",
        "source": "T03n0187_009:0591c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「左面魔子名曰傲慢，復向波旬而說偈言：「『我今住此以手摩，　　日月宮殿盡令碎，　　又能吸彼四大海，　　於中所有皆空竭，　　當擲沙門於海水，　　大王勿以此為憂。",
        "translation": "\"The left-faced Māra named Pride then addressed Pāpīyān and spoke in verse, saying, 'Now, I've been here, and I've put my hand on it, so the sun and moon will completely break up my palace, and I can suck in those four seas, all of which are empty and dried up, so I'll toss my ascetic into the ocean, but don't be concerned about that, Your Majesty.",
        "source": "T03n0187_009:0591c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　不假兵眾降伏之，　　我獨能令彼銷滅，　　今當摧折菩提樹，　　并取沙門擲十方。』",
        "translation": "Without using a multitude of soldiers to subdue them, I alone can cause them to perish; now I will smash down the bodhi tree and take the ascetic and toss him to the ten directions.'",
        "source": "T03n0187_009:0591c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「右面魔子名曰有信，復向波旬而說偈言：「『假使力碎三千界，　　如是大力滿恒沙，　　不動菩薩之一毛，　　何足能傷智慧者？』",
        "translation": "\"The right-facing Māra named Arhat Shōtoku again addressed Pāpīyān and spoke in verse, saying, 'Suppose this power shatters 3,000 realms and fills an infinite number of sands with such might, but it doesn't move a hair on the Bodhisattva's head; how could it be enough to harm the wise one?'",
        "source": "T03n0187_009:0591c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「左面魔子名曰可怖，復向波旬而說偈言：「『如此沙門不足畏，　　彼無朋黨而獨居，　　今當恐之走十方，　　大王兵強何以怖？』",
        "translation": "\"The left-faced Māra named Terrible again addressed Pāpīyān and spoke in verse, saying, 'Such an ascetic is not to be feared; he lives alone without friends; he would be feared to leave ten directions; why is the king's army so strong?'",
        "source": "T03n0187_009:0591c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「右面魔子名一緣慧，復向波旬而說偈言：「『日月師子寧有兵，　　輪王威勢不假眾，　　一切菩薩無軍旅，　　一身一念破魔軍。』",
        "translation": "\"The right-faced Māra, whose name is Yiyuanhui, again addressed Pāpīyān and spoke in verse, saying, 'The lion of the sun and moon would rather have an army, the wheel-turning king's might is not contingent on crowds, and all bodhisattvas lack an army; one body and one thought defeat the Māra army.'",
        "source": "T03n0187_009:0591c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「左面魔子名曰求惡，復向波旬而說偈言：「『惟願大王莫愁惱，　　我今不持諸器仗，　　以鼻卷取彼沙門，　　於是撲之令碎滅。』",
        "translation": "\"The left-faced Māra named Kauśāmbī also addressed Pāpīyān and spoke in verse, saying, 'May the king not be troubled, for now I won't carry any weapons, so I'll pick up that ascetic with a roll of my nose and smash him to pieces.'",
        "source": "T03n0187_009:0591c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「右面魔子名功德莊嚴，復向波旬而說偈言：「『其人身力甚堅固，　　如那羅延不可壞，　　況持忍辱而為鎧，　　勤行精進以為刃，　　以三解脫為所乘，　　復以智慧為調御，　　菩薩由斯福德力，　　必能摧伏我魔軍。』",
        "translation": "\"The right-faced Māra named Gṛdhrakūṭa also addressed Pāpīyān and spoke in verse, saying, 'His person is so strong that he's like Nārāyaṇa and indestructible, yet he maintains patience and humility as his armor, makes diligence and effort as his sword, makes the three liberations his vehicle, and uses wisdom as his control. With this power of merit, a bodhisattva will surely be able to subdue my Māra army.'",
        "source": "T03n0187_009:0592a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「左面魔子名曰不退，復向波旬而說偈言：「『譬如激矢自不歸，　　山火從風定難止，　　霹靂金剛必無反，　　未摧釋子終不還。』",
        "translation": "\"The left-facing Māra named Nonretrogression again addressed Pāpīyān and spoke in verse, saying, 'It's like a sharp arrow that won't return, a mountain fire that's determined to be stopped by the wind, a thunderbolt that's bound to be irreversible, and the son who never returns until it's destroyed.'",
        "source": "T03n0187_009:0592a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「右面魔子名曰樂法，復向波旬而說偈言：「『激矢中石不復前，　　烈火遇水必銷滅，　　霹靂至地竟何去，　　若見菩薩當自歸。",
        "translation": "\"The right-facing Māra named Rājagṛha again addressed Pāpīyān and spoke in verse, saying, 'A stinging arrow that hits a rock never goes back up, a fiery blaze that meets water surely goes out, and a thunderbolt that reaches the ground never leaves, so if you see a bodhisattva, you'll return on your own.'",
        "source": "T03n0187_009:0592a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　大王乍可盡虛空，　　或使眾生心作一，　　或能將繩繫日月，　　如此之事皆可為，　　唯有菩薩坐菩提，　　大王不可而傾動。』",
        "translation": "At first, the king could exhaust space, or cause the minds of sentient beings to become one, or he could bind a rope to the sun and moon, or any of these things could be done, except for the bodhisattva sitting in bodhi, which the king couldn't tilt.'",
        "source": "T03n0187_009:0592a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「左面魔子名不寂靜，復向波旬而說偈言：「『我眼有毒若使看，　　須彌崩倒渤澥竭，　　當知沙門及道樹，　　纔視之時盡成灰。』",
        "translation": "\"The left-faced Māra named Bhallika again addressed Pāpīyān and spoke in verse, saying, 'If I were to look into the poison of my eyes, Sumeru would crumble and cave in, and I would know that ascetics and the tree of the Way are all reduced to ashes when I first look at them.'",
        "source": "T03n0187_009:0592a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「右面魔子名一切利成，復向波旬而說偈言：「『假使以彼三千界，　　其中盡成於猛毒，　　功德之藏若視之，　　能令眾毒為無毒。",
        "translation": "\"The right-faced Māra, who's called Sarvâstivāda, again addressed Pāpīyān and spoke in verse, saying, 'Suppose there were 3,000 realms in which all of them were filled with a fierce poison, and if you looked into the store of merit, it would cause the poisons to become nonpoisons.",
        "source": "T03n0187_009:0592a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸毒豈復過三毒，　　三毒無累其身心，　　菩薩本自同虛空，　　大王慎勿輕而往。』",
        "translation": "How could these poisons be greater than the three poisons, which don't weigh down body and soul?' The bodhisattva himself is just like space, so the king should be careful not to go there lightly.",
        "source": "T03n0187_009:0592a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「左面魔子名曰喜著，復向波旬而說偈言：「『莊飾萬億諸天女，　　鼓奏百千妙絃歌，　　誘之將入自在宮，　　恣欲令其永貪著，　　大王由是得自在，　　唯願勿以此為憂。』",
        "translation": "\"The left-faced Māra named Pleasure Attraction again addressed Pāpīyān and spoke in verse, saying, 'Adorned are ten thousand million goddesses, playing a hundred thousand wonderful stringed songs, luring them into the palace of Pūrṇa, and lavishing their desires with perpetual desire, so the king attains freedom, may this not be a cause for concern.'",
        "source": "T03n0187_009:0592a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「右面魔子名曰法慧，復向波旬而說偈言：「『彼所樂者非非法，　　唯有解脫及諸禪，　　為眾生故樂行慈，　　於爾五欲無貪著。』",
        "translation": "\"The right-faced Māra named Dharma Wisdom again addressed Pāpīyān and spoke in verse, saying, 'What they delight in is not unlawful; it's only liberation and meditation, and they delight in practicing kindness for the sake of sentient beings, so they don't cling to the five desires.'",
        "source": "T03n0187_009:0592b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「左面魔子名旃陀羅，復向波旬而說偈言：「『大王不聞諸子言，　　其聲哮吼皆摧裂，　　并有勇健迅捷力，　　疾往於彼滅沙門。』",
        "translation": "\"Again, the left-faced Māra named Candra addressed Pāpīyān and spoke in verse, saying, 'The king doesn't hear the words of his sons, but his voice roars and shouts, and he has the strength and swiftness to quickly go there and extinguish the ascetics.'",
        "source": "T03n0187_009:0592b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「右面魔子名師子吼，復向波旬而說偈言：「『野干群鳴大澤中，　　秪為未聞師子吼，　　若使一聞師子吼，　　自當奔馳走十方。",
        "translation": "\"The right-hand Māra named Shizi Roar again addressed Pāpīyān and spoke in verse, saying, 'The wild trunks and swamps roar in the vast swamps because they haven't heard Shizi Roar. If they were to hear Shizi Roar for once, they would run and travel to ten directions.'",
        "source": "T03n0187_009:0592b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如是一切無智魔，　　未聞人中師子吼，　　徒自競辯無休止，　　若使聞已皆銷滅。』",
        "translation": "Thus, all the ignorant Māras who have never heard the lion's roar among humans compete on their own without stopping to argue, but if they were to hear it, it would all go away.'",
        "source": "T03n0187_009:0592b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「左面魔子名曰惡思，復向波旬而說偈言：「『豈可不見吾軍眾，　　我有惡思能速成，　　若非世間無智者，　　何不速起而奔走？』",
        "translation": "\"The left-faced Māra named Xiasi again addressed Pāpīyān and spoke in verse, saying, 'Couldn't you have seen my army, or could I have quickly accomplished something with Xiasi, if it weren't for the world's lack of wisdom, why wouldn't I have quickly gotten up and run away?'",
        "source": "T03n0187_009:0592b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「右面魔子名曰善思，復向波旬而說偈言：「『彼非無知乏勢力，　　汝自凡愚闕勝能，　　汝今未悉彼善權，　　彼當以智降伏汝。",
        "translation": "\"The demon on the right, named Shansi, again addressed Pāpīyān and spoke in verse, saying, 'They aren't ignorant and lacking in power; you yourself are ordinary and foolish, and lacking in ability; you haven't yet learned their skillful authority; they will subdue you with their wisdom.'",
        "source": "T03n0187_009:0592b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我等魔子恒沙眾，　　如是雄勇遍三千，　　不動菩薩之一毛，　　豈獨惡思能致損？",
        "translation": "We Māra sons, of whom there are countless, are so heroic and courageous that we don't disturb a single hair of a bodhisattva's head, so how could it be damaged by Xanthi alone?",
        "source": "T03n0187_009:0592b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　無能於彼生惡念，　　應當尊重起淨心，　　是即三界為法王，　　汝宜退還勿戰鬪。』」",
        "translation": "You can't give rise to bad thoughts there; you must respect and purify your mind; this is the king of the Dharma in the three realms; it's better for you to retreat and not fight.'\"",
        "source": "T03n0187_009:0592b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「魔王爾時又命諸女作如是言：『汝等諸女！",
        "translation": "The Buddha addressed the monks, \"At the time, the Māra King then ordered the women to say this, 'You women!",
        "source": "T03n0187_009:0592b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "可共往彼菩提樹下，誘此釋子壞其淨行。』",
        "translation": "We can go together under that bodhi tree and entice this Śākyamuni to destroy his pure behavior.'",
        "source": "T03n0187_009:0592b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是魔女詣菩提樹，在菩薩前，綺言妖姿三十二種媚惑菩薩：一者揚眉不語。",
        "translation": "The Māra then went to the bodhi tree and got in front of the bodhisattva, saying these thirty-two flattering things to seduce him: First, she raised her eyebrows and didn't say anything.",
        "source": "T03n0187_009:0592b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者褰裳前進。",
        "translation": "Two, she lowered her robe and advanced forward.",
        "source": "T03n0187_009:0592b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者低顏含笑。",
        "translation": "Three, she lowered her face and smiled.",
        "source": "T03n0187_009:0592b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者更相戲弄。",
        "translation": "Four, she flirted with each other.",
        "source": "T03n0187_009:0592b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者如有戀慕。",
        "translation": "Five, if they're in love, they'll adore them.",
        "source": "T03n0187_009:0592b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六者互相瞻視。",
        "translation": "Six, they look at each other.",
        "source": "T03n0187_009:0592b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七者掩斂脣口。",
        "translation": "Seven, they cover their lips and mouth.",
        "source": "T03n0187_009:0592b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八者媚眼斜眄。",
        "translation": "Eight, he looks askance at them.",
        "source": "T03n0187_009:0592b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九者嫈嫇細視。",
        "translation": "Nine, they carefully and delicately examine each other.",
        "source": "T03n0187_009:0592b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十者更相謁拜。",
        "translation": "Ten, they worship each other again.",
        "source": "T03n0187_009:0592b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十一以衣覆頭。",
        "translation": "Eleven cover their heads with their robes.",
        "source": "T03n0187_009:0592b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十二遞相拈搯。",
        "translation": "Twelve pass them around and pick at each other's throats.",
        "source": "T03n0187_009:0592b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十三側耳佯聽。",
        "translation": "Thirteen incline their ears and pretend to listen.",
        "source": "T03n0187_009:0592c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十四迎前躞蹀。",
        "translation": "14. He greets them and walks forward.",
        "source": "T03n0187_009:0592c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十五露現髀膝。",
        "translation": "Fifteen reveal their thighs and knees.",
        "source": "T03n0187_009:0592c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十六或現胸臆。",
        "translation": "Sixteen may reveal his chest and heart.",
        "source": "T03n0187_009:0592c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十七念憶昔時恩愛戲笑眠寢之事而示欲相。",
        "translation": "XVII recollects past loving, teasing, and sleeping events, and then shows his desirous features.",
        "source": "T03n0187_009:0592c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十八或如對鏡自矜姿態。",
        "translation": "18. He might boast of his posture as if facing a mirror.",
        "source": "T03n0187_009:0592c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十九動轉遺光。",
        "translation": "He may move and leave his light behind.",
        "source": "T03n0187_009:0592c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十乍喜乍悲。",
        "translation": "He'll be delighted and pity at first.",
        "source": "T03n0187_009:0592c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十一或起或坐。",
        "translation": "He sometimes rises or sits down.",
        "source": "T03n0187_009:0592c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十二或時作氣似不可干。",
        "translation": "Sometimes he exhales, and it seems like he can't get dry.",
        "source": "T03n0187_009:0592c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十三塗香芬烈。",
        "translation": "Twenty-three is coated with a strong fragrance.",
        "source": "T03n0187_009:0592c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十四手執瓔珞。",
        "translation": "Twenty-four carries a necklace in his hand.",
        "source": "T03n0187_009:0592c06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十五或覆藏項領。",
        "translation": "25 Sometimes he covers his neck and collar.",
        "source": "T03n0187_009:0592c07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十六示如幽閑。",
        "translation": "26 shows him as if he were in a secluded place.",
        "source": "T03n0187_009:0592c07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十七前却而行瞻顧菩薩。",
        "translation": "27Removing forward, he walks around and looks at the bodhisattva.",
        "source": "T03n0187_009:0592c08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十八開目閉目如有所察。",
        "translation": "28Opening and closing his eyes, he looks as if he's observing something.",
        "source": "T03n0187_009:0592c08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十九迴步直往佯如不見。",
        "translation": "29 Turning back, he walks straight ahead, pretending not to see.",
        "source": "T03n0187_009:0592c09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十嗟歎欲事。",
        "translation": "xxx He laments the object of desire.",
        "source": "T03n0187_009:0592c10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十一美目諦視。",
        "translation": "31 He gazes intently with beautiful eyes.",
        "source": "T03n0187_009:0592c10_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十二顧步流眄。",
        "translation": "32 Looking up and down, he gazes around.",
        "source": "T03n0187_009:0592c10_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有如是等媚惑因緣，復以歌詠言詞嬈鼓菩薩，而說頌曰：「『初春和暖好時節，　　眾草林木盡敷榮，　　丈夫為樂宜及時，　　一棄盛年難可再。",
        "translation": "With these causes of flattery and confusion, he then bulls the bodhisattva with songs and words, saying, \"It's a nice, warm time in early spring, when all the grasses and trees are in full bloom, so it's a good time for a man to take pleasure, for once abandoning his prime years is difficult to recapture.",
        "source": "T03n0187_009:0592c11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　仁雖端正美顏色，　　世間五欲亦難求，　　對斯勝境可歡娛，　　何為樂彼菩提法？",
        "translation": "Although you are kind and correct in appearance, the five worldly desires are difficult to pursue, and you can rejoice in this wonderful state, why should you rejoice in the awakening dharma?'",
        "source": "T03n0187_009:0592c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我等諸女受天報，　　其身微妙咸可觀，　　如是天身不可求，　　仁今果報宜應受。",
        "translation": "\"We women receive the rewards of heaven, and their bodies are so exquisite and fine that we can observe them; thus, the body of a god cannot be sought, and the results are suitable for you to receive now.",
        "source": "T03n0187_009:0592c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸仙見我猶生染，　　況復人能無染心？",
        "translation": "Even when the sages see me, they become defiled, so how could anyone be without a defiled mind?",
        "source": "T03n0187_009:0592c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　修彼禪定竟何為？",
        "translation": "After cultivating this meditative concentration, what is it?",
        "source": "T03n0187_009:0592c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　菩提之法甚懸遠。』",
        "translation": "The Dharma of enlightenment is far off.'",
        "source": "T03n0187_009:0592c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩聞彼妖惑之言，心生哀愍，即以妙偈化其魔女：「『我觀五欲多過患，　　由是煩惱失神通，　　譬如火坑及毒匳，　　眾生赴之而不覺，　　我久已離諸煩惱，　　自心覺已方覺他。",
        "translation": "\"Hearing those slanderous words, the bodhisattva felt compassion for them and spoke a wonderful verse to teach the demoness, \"I've observed the many faults of the five desires, and because of these afflictions I've lost my supernormal powers; it's like a fiery pit or a poisonous pool to which sentient beings go but don't realize it.",
        "source": "T03n0187_009:0592c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　世間五欲燒眾生，　　猶如猛火焚乾草，　　亦如焰幻無有實，　　亦如泡沫不久停，　　如彼嬰孩戲糞中，　　如彼愚人觸蛇首，　　一切皆無有實法，　　是身虛妄從業生。",
        "translation": "The five worldly desires burn sentient beings like a fierce fire burning dry grass, like a flame that's illusory but has no substance, like a bubble that doesn't last long, like a baby playing in the dung, or a foolish man touching the head of a snake, all are without real dharmas, and this body is falsely produced from employment.",
        "source": "T03n0187_009:0592c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　四大五蘊假合成，　　筋骨相纏而暫有，　　智者誰應耽著此？",
        "translation": "The four elements and five aggregates are falsely combined, and sinews and bones are entangled and temporarily exist, so who among the wise should be addicted to this?",
        "source": "T03n0187_009:0593a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　凡夫迷故生欲心。",
        "translation": "'Ordinary beings are deluded and therefore give rise to desire.",
        "source": "T03n0187_009:0593a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如是諸幻我已知，　　是故於中不貪著，　　欲求畢竟自在樂，　　今當於此證菩提，　　我已解脫於世間，　　如空中風難可繫。』",
        "translation": "I've known such illusions, so I don't cling to them, want to pursue ultimate freedom and happiness, and will now realize bodhi here. I've been liberated from the world like a wind in the sky that's hard to bind.'",
        "source": "T03n0187_009:0593a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩身如融金，面如滿月，深心寂定如須彌山安處不動，猶如明珠無有瑕疵，如日初出照於天下，猶如蓮花不染淤泥，心無所著亦無增損。",
        "translation": "\"At the time, the bodhisattva's body was like molten gold, his face was like the full moon, and his deep, calm concentration was like Mount Sumeru standing motionless, like a bright pearl without blemish, like the first sunrise shining under the heavens, like a lotus flower that doesn't stain mud, and his mind is neither attached nor impaired.",
        "source": "T03n0187_009:0593a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時魔女復以柔軟言詞白菩薩言：『仁者道德尊重，天人所敬，應有給侍，天遣我來供養仁者，我等年少色如優鉢羅花，願得晨夜興寢親暱左右。』",
        "translation": "Again, the Māra women spoke softly and said to the Bodhisattva, 'Sir, you're a man of high morals and respect who's respected by gods and humans and deserves to be served, and the gods have sent me to offer support to you.",
        "source": "T03n0187_009:0593a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩報言：『汝昔有福今得天身，不念無常造斯幻惑，形體雖好而心不端，譬如畫瓶盛諸穢毒，行當自壞，何足可矜？",
        "translation": "The bodhisattva replied, 'You were blessed in the past and now you've attained the body of a god, but you don't think about impermanence and create this illusion and confusion, and even though your body is beautiful, your mind is dishonest, like a painted vase filled with filthy poison; your actions will destroy themselves, so why should you take pride in them?'",
        "source": "T03n0187_009:0593a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝為不善自忘其本，當墮三惡道中，欲脫甚難。",
        "translation": "You will fall into the three bad destinies because you yourself have forgotten the origin of your unskillfulness, and it will be very difficult to escape.",
        "source": "T03n0187_009:0593a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等故來亂人善事，革囊盛糞非清淨物，而來何為？",
        "translation": "Why have you come here to disrupt the good deeds of others, or why have you come with a leather bag full of dung that's not pure?",
        "source": "T03n0187_009:0593a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去！",
        "translation": "Go!",
        "source": "T03n0187_009:0593a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾不喜。』",
        "translation": "I don't like that.'",
        "source": "T03n0187_009:0593a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其諸魔女媚惑菩薩既不能得，即以建尼迦花及詹波花散菩薩上，右遶三匝作禮而去。",
        "translation": "When the Māra women failed to seduce the Bodhisattva, they scattered the Kaniṣka flowers and Campā flowers on top of him, circled him three times to his right, paid homage, and departed.",
        "source": "T03n0187_009:0593a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "歸魔王所，告魔王言：『大王！",
        "translation": "They returned to the king of Māra and told him, 'Great king!",
        "source": "T03n0187_009:0593a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等昔來未曾見有如是之士，於欲界中覩我姿容而心不動。",
        "translation": "Never before have we seen such a person who looks at my features in the desire realm and isn't moved at heart.",
        "source": "T03n0187_009:0593a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我為媚惑能竭人意，譬如旱苗見日燋枯，亦如春蘇置於日下自然銷融。",
        "translation": "I'm a seductress who can sap people's minds, like a dried seedling that burns up when it sees the sun, or a spring plant that naturally melts when left under the sun.",
        "source": "T03n0187_009:0593a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此丈夫何緣乃爾？",
        "translation": "What are the reasons this husband did that?",
        "source": "T03n0187_009:0593a24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惟願大王！",
        "translation": "May it please the great king!",
        "source": "T03n0187_009:0593a25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫與此人共為嫌隟。』",
        "translation": "Don't share this person's dislikes.'",
        "source": "T03n0187_009:0593a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「『其身猶如蓮花藏，　　其面猶如清淨月，　　其光猶如猛火焰，　　其色猶如紫金山。",
        "translation": "He then spoke the verse, saying, \"His body is like a lotus-flower treasury, his face is like the pure moon, his light is like a raging fire, and his color is like a purple mountain.",
        "source": "T03n0187_009:0593a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　百千生中修正行，　　所有誓願皆成就，　　自度生死能度他，　　救濟眾生無懈倦。",
        "translation": "He cultivates practice during a hundred thousand lifetimes, fulfills all his vows, saves himself from birth and death, saves others, and doesn't tire of rescuing sentient beings.",
        "source": "T03n0187_009:0593a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　善哉願王莫瞋彼，　　天上人間最尊勝，　　眼目清淨如蓮花，　　熙怡微笑無貪著，　　須彌崩壞日月落，　　其人不可而傾動。』」",
        "translation": "Good, may the king not be angry with them; they're most honored among gods and humans, their eyes are pure like lotus flowers, they smile joyfully, have no craving, and the sun and moon fall when Sumeru crumbles; they can't be disturbed.'\"",
        "source": "T03n0187_009:0593b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「是時白部魔子導師啟其父言：『菩薩清淨超過三界，神通道力無有能當，諸天龍神咸共稱讚，必非大王所能摧屈，不煩造惡自招禍患。』",
        "translation": "The Buddha addressed the monks, \"Baekbu Māra then instructed his father, saying, 'The bodhisattva's purity transcends the three realms, his supernormal powers are unsurpassed, and they are praised by gods and dragons alike as being beyond the ability of a great king to overcome; don't trouble yourself by doing evil.'",
        "source": "T03n0187_009:0593b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是波旬告其子言：『咄！",
        "translation": "Pāpīyān then addressed his son, saying, 'Duh!",
        "source": "T03n0187_009:0593b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝愚小智慧淺劣，未曾見我神通道力。』",
        "translation": "You are ignorant and shallow in wisdom; you haven't seen the power of my supernormal abilities.'",
        "source": "T03n0187_009:0593b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "導師復言：『大王！",
        "translation": "The guide then replied, 'Great king!",
        "source": "T03n0187_009:0593b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我實無知智慧淺劣，不願大王與彼釋子共為怨對也。",
        "translation": "I'm really ignorant and have shallow wisdom, so I don't want the king to be at odds with that Śākyamuni.",
        "source": "T03n0187_009:0593b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0187_009:0593b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生以惡心來欲害於彼，不以為恨；復有眾生以善心來供養於彼，不以為欣，處此二間，心生平等。",
        "translation": "If a sentient being comes with a bad intention to harm them, they won't think it's hateful; another sentient being comes with a good intention to support them, they won't think it's gratifying, and they'll be equal in mind when they live in these two places.",
        "source": "T03n0187_009:0593b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T03n0187_009:0593b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使有人能畫虛空作眾色像未足為難，手捧須彌而以遊行亦未為難，假使有人浮渡大海亦未為難，繫四方風亦未為難，欲令一切眾生同作一心亦未為難，欲害菩薩甚為難也。』",
        "translation": "It wouldn't be difficult for someone to paint the sky and make images of many forms, nor would it be difficult for someone to hold Sumeru in their hands and parade it, nor would it be difficult for someone to float across the ocean, nor would it be difficult to bind the four winds, nor would it be difficult to cause all sentient beings to work together as one mind, but it would be very difficult to harm a bodhisattva.'",
        "source": "T03n0187_009:0593b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時魔王波旬不受子諫，詣菩提樹告菩薩言：『汝應速起離於此處，必定當得轉輪聖王，王四天下為大地主。",
        "translation": "\"Not accepting his son's advice, Māra King Pāpīyān went to the bodhi tree and told the bodhisattva, 'You must quickly arise and leave this place, for you will surely become a wheel-turning sage king who will rule the four worlds and be the lord of the great land.",
        "source": "T03n0187_009:0593b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝可不憶往昔諸仙記，汝當作轉輪聖王？",
        "translation": "Don't you remember the records of the sages of the past, when you were made a wheel-turning sage king?'",
        "source": "T03n0187_009:0593b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若起受轉輪王位，作自在主威德無上，如法理國統領一切。",
        "translation": "'If you were to rise to the position of wheel-turning king and become an unimpeded lord of unsurpassed authority, you would rule over all countries according to the principle of the Dharma.",
        "source": "T03n0187_009:0593b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此曠野甚可怖畏，獨無伴侶恐害汝身，速當還宮恣受五欲，菩提難得徒自勞形。』",
        "translation": "Now, this wilderness is very frightening, and being alone without a companion might harm you. Quickly return to the palace and enjoy the five desires freely, for it will be difficult to attain enlightenment and you'll be left to toil yourself.'",
        "source": "T03n0187_009:0593b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已默然而住。",
        "translation": "After making these remarks, he waited silently.",
        "source": "T03n0187_009:0593b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩語波旬言：『汝今不應作如此說。",
        "translation": "\"It was then that the bodhisattva said to Pāpīyān, 'Now, you shouldn't say that.",
        "source": "T03n0187_009:0593b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我意不樂五欲之事，故捨四方及以七寶。",
        "translation": "I don't want to indulge in the five desires, so I abandoned the four directions and the seven treasures.",
        "source": "T03n0187_009:0593b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波旬！",
        "translation": "Pāpīyān!",
        "source": "T03n0187_009:0593b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人既吐食已，豈復更能取而食之？",
        "translation": "\"It's like a person who has vomited food, how could they take it and eat it again?",
        "source": "T03n0187_009:0593b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今已捨如是果報，必定證得無上菩提，盡於生老病死之患。",
        "translation": "Now that I've abandoned such rewards, I'm sure to realize unsurpassed enlightenment and end the suffering of birth, old age, illness, and death.",
        "source": "T03n0187_009:0593c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波旬！",
        "translation": "Pāpīyān!",
        "source": "T03n0187_009:0593c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今已坐金剛之座，當證菩提，汝宜速去。』",
        "translation": "Now that I've sat on the adamantine seat and will realize enlightenment, you should leave quickly.'",
        "source": "T03n0187_009:0593c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是波旬瞋目發憤向菩薩言：『汝今何故獨坐於此？",
        "translation": "Pāpīyān then angrily raged and said to the bodhisattva, 'Why are you sitting here alone?'",
        "source": "T03n0187_009:0593c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈不見我夜叉軍眾？』",
        "translation": "Have you not seen my army of yakṣas?'",
        "source": "T03n0187_009:0593c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即拔利劍來就菩薩，作如是言：『我當以劍斬截於汝，速疾起去勿復安坐。』",
        "translation": "He drew his sharp sword and approached the bodhisattva, saying, 'I will cut you down with my sword; quickly get up and don't sit there again.'",
        "source": "T03n0187_009:0593c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩語波旬言：『假使世間一切眾生盡如汝身，悉持刀杖來害於我，我終不起離於此座。",
        "translation": "\"The bodhisattva then said to Pāpīyān, 'Suppose all the sentient beings in the world were like you and they all came to harm me with swords and staves, I would never get up from this seat.'",
        "source": "T03n0187_009:0593c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波旬！",
        "translation": "Pāpīyān!",
        "source": "T03n0187_009:0593c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寧以四大海水及此大地移於餘處，日月星辰從空隕墜，須彌山王可令傾倒，而我是身終不可移。』",
        "translation": "Rather, the four great waters and this earth should be moved to some other place, and the sun, moon, and stars should fall from the sky, and Mount Sumeru should be allowed to topple, but I will never be able to move this body.'",
        "source": "T03n0187_009:0593c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時魔波旬聞是語已，惡心轉熾發憤瞋吼，其聲如雷，語諸夜叉：『汝等速宜擎諸山石，將諸弓弩、刀劍輪矟、干戈斧鉞、矛[矛*贊]鈎戟種種器仗，喚諸毒龍，擬放黑雲雷電霹靂。』",
        "translation": "\"When Māra Pāpīyān heard those words, his evil mind became inflamed, and he roared with fury, his voice like thunder, and told the yakṣas, 'You should quickly raise those mountains and rocks, put together bows and crossbows, swords and lances, spears [spears*spears], axes and axes, spears and pikes, and weapons of various kinds, and summon poisonous dragons to unleash a thunderbolt of black clouds and lightning.'",
        "source": "T03n0187_009:0593c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時夜叉大將統率自部夜叉、羅剎、毘舍遮鬼、鳩槃茶等，變化其形作種種像，復嚴四兵象馬車步，或似阿修羅、迦婁羅、摩睺羅伽無量百千萬億種類，一身能現多身，或畜頭人身，或人頭畜身，或復無頭有身，或有半面，或有半身，或有二頭一身，或有一身三頭，或復一身多頭，或復無面有頭，或復有面無頭，或復無面而有三頭，或復多頭而無有面，或復多面而無有頭，或復無眼，或唯一眼二眼三眼乃至多眼，或復無耳，或唯一耳二耳三耳乃至多耳，或復無手，或唯一手二手三手乃至多手，或復無足，或唯一足二足三足，乃至多足，或有全身唯現骸骨，或頭現髑髏身肉肥滿，或唯頭有肉身是骸骨，或身體長大羸瘦無肚，或復纖長其腹橫大，或長脚大膝牙爪鋒利，或大面傍出，或頭在胸前，或脣垂至地，或上褰覆面，或身出黑煙，或口吐猛焰，或血肉枯竭皮骨相連，或身出膿血更相飲吮，或自截支節撩亂委擲，或眼目角睞，或口面喎斜，或舌形廣大，或縮如壃石，或持人頭，或執死人手足骨肉肝膽腸胃而噉食之，或執毒蛇而食，或以蛇纏頸，或手擎髑髏，或著髑髏之鬘，或復面色全赤全白全青全黃，或有半黃半青半白半赤，或作煙熏之色，或作死灰之色，或復身毛如針，或毛出火焰，或張目閉目，或口吐白沫。",
        "translation": "是時夜叉大將統率自部夜叉、羅剎、毘舍遮鬼、鳩槃茶等，變化其形作種種像，復嚴四兵象馬車步，或似阿修羅、迦婁羅、摩睺羅伽無量百千萬億種類，一身能現多身，或畜頭人身，或人頭畜身，或復無頭有身，或有半面，或有半身，或有二頭一身，或有一身三頭，或復一身多頭，或復無面有頭，或復有面無頭，或復無面而有三頭，或復多頭而無有面，或復多面而無有頭，或復無眼，或唯一眼二眼三眼乃至多眼，或復無耳，或唯一耳二耳三耳乃至多耳，或復無手，或唯一手二手三手乃至多手，或復無足，或唯一足二足三足，乃至多足，或有全身唯現骸骨，或頭現髑髏身肉肥滿，或唯頭有肉身是骸骨，或身體長大羸瘦無肚，或復纖長其腹橫大，或長脚大膝牙爪鋒利，或大面傍出，或頭在胸前，或脣垂至地，或上褰覆面，或身出黑煙，或口吐猛焰，或血肉枯竭皮骨相連，或身出膿血更相飲吮，或自截支節撩亂委擲，或眼目角睞，或口面喎斜，或舌形廣大，或縮如壃石，或持人頭，或執死人手足骨肉肝膽腸胃而噉食之，或執毒蛇而食，或以蛇纏頸，或手擎髑髏，或著髑髏之鬘，或復面色全赤全白全青全黃，或有半黃半青半白半赤，或作煙熏之色，或作死灰之色，或復身毛如針，或毛出火焰，或張目閉目，或口吐白沫。",
        "source": "T03n0187_009:0593c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或於身上現百千面，一一面狀甚可怖畏。",
        "translation": "Sometimes a hundred thousand faces appear on their bodies, and one has a terrifying appearance.",
        "source": "T03n0187_009:0594a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或從眼耳鼻口出諸黑蛇而噉食之。",
        "translation": "From their eyes, ears, nose, and mouth, black snakes may emerge and feed on them.",
        "source": "T03n0187_009:0594a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或飲融銅，或吞鐵丸，或刖手足肘膝而行，或身出煙焰象頭戴山，或被髮露形，或衣青黃赤白之服，或著師子虎狼蛇豹之皮，或頭上火然瞋目奮怒，交橫衝擊遍滿虛空，及在地上形狀變異，不可勝載。",
        "translation": "They may drink molten copper, swallow iron balls, amputate their arms, legs, elbows, and knees, walk around with smoldering elephants and heads on mountains, wear hair that bares their forms, dress in blue, yellow, red, and white robes, wear the skins of lions, tigers, wolves, snakes, and leopards, or have fiery heads and furious eyes that criss-cross the sky and change shape on the ground in ways that are incalculable.",
        "source": "T03n0187_009:0594a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是諸天鬼，或布黑雲雷電霹靂，或雨沙土瓦石，或擎大山，或放猛火，或吐毒蛇，或有努爪，或有揮劍，或有彎弓，或有舞矟，或有揮鉞，或有搖動脣頷，或有張口欲噬，或哭或笑，或飛或走，或隱或顯，哮吼呌呼惡聲震裂。",
        "translation": "\"Such celestial spirits may spread black clouds, thunderbolts, lightning, thunderbolts, rain sand, dirt, mud, and rocks, raise large mountains, discharge fierce fires, spit venomous snakes, protrude their claws, wield swords, bend bows, dance lances, wield axes, shake their lips and jaws, open their mouths to devour, weep or laugh, fly or walk, are concealed or visible, and shake with their roaring and wailing fierce noises.",
        "source": "T03n0187_009:0594a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是兵眾無量無邊百千萬億，畟塞填咽菩提樹邊，煙焰欝蒸狂風衝怒，震動山岳蕩覆河海，天地掩色星辰無光。",
        "translation": "Such an army of incalculable and limitless hundreds of thousands of millions of soldiers fills the area around the bodhi tree with white-hot smoke and a raging wind that shakes the mountains and overturns the rivers and seas, covering the heavens and earth with color and leaving the stars without light.",
        "source": "T03n0187_009:0594a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔軍集時其夜正半，是時無量淨居天眾作如是言：『菩薩今者證大菩提。』",
        "translation": "It was halfway through the night when the army of Māra had assembled, and at the time, a multitude of celestials in the Pure Land said, 'Now, the bodhisattva has realized great enlightenment.'",
        "source": "T03n0187_009:0594b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有天言：『魔眾熾盛，由此或能損害菩薩。』",
        "translation": "Another god said, 'The army of Māra is so blazing that it might harm the bodhisattva.'",
        "source": "T03n0187_009:0594b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩報彼天言：『我今不久當破魔軍悉令退散，猶如猛風吹微細花。』",
        "translation": "The bodhisattva then reported to that heaven, saying, 'Soon I will defeat the army of Māra and cause them all to retreat, like a fierce wind blowing a tiny flower.'",
        "source": "T03n0187_009:0594b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是端坐正念不動，觀諸魔軍如童子戲。",
        "translation": "He then sat correctly mindful and motionless, observing the armies of Māra as children at play.",
        "source": "T03n0187_009:0594b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔益忿怒轉增戰力。",
        "translation": "The demons' anger intensified, and they became more powerful in battle.",
        "source": "T03n0187_009:0594b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩慈悲令舉石者不能勝舉，其勝舉者又不墮落，揮刀擲劍停在空中，或有墮地悉皆碎折，惡龍吐毒變成香風，沙礫瓦石雨雹亂下，皆悉化為拘物頭華。",
        "translation": "The bodhisattva compassionately causes those who lift rocks to become incapable of lifting them, and those who lift them well don't fall; they halt in the air with a sword thrown, or if they fall to the ground, they all break, the dragon spits out poison and turns it into an incense breeze, and sand, gravel, rocks, and hailstones rain down, all of which are transformed into kumuda.",
        "source": "T03n0187_009:0594b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有彎弓射菩薩者，其箭著絃皆不得發，或有發者停住空中，於其鏃上皆生蓮花，火勢猛熾化為五色拘物頭花。",
        "translation": "Anyone who bends a bow and shoots at the bodhisattva won't be able to launch an arrow caught in its string, or if they do, it stops in the air, and lotus flowers grow on its arrowhead, and the fire burns fiercely, transforming it into the five-colored kuśa flower.",
        "source": "T03n0187_009:0594b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時波旬猶故瞋忿毒心不止，仗劍前趨語菩薩言：『汝釋比丘，若安此坐不速起者，吾自殺汝。』",
        "translation": "\"Still angry and venomous, Pāpīyān approached the bodhisattva with his sword and said, 'You monks of Śākyamuni, if you don't get up quickly while sitting here, I'll kill you myself.'",
        "source": "T03n0187_009:0594b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是東西馳走欲近菩薩不能前進。",
        "translation": "He then ran east and west, wanting to get close to the bodhisattva, but was unable to advance.",
        "source": "T03n0187_009:0594b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時魔王長子前抱其父作如是言：『大王！",
        "translation": "The eldest son of the demon king then embraced his father and said, 'Great king!",
        "source": "T03n0187_009:0594b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今者會自不能殺彼沙門，徒生惡念必招罪咎。』",
        "translation": "Now, if you were to assemble yourself, you wouldn't be able to kill that ascetic; in vain, you'd give rise to bad thoughts that would surely bring blame.'",
        "source": "T03n0187_009:0594b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔不受諫向菩薩走。",
        "translation": "The Māra didn't accept the advice and walked toward the bodhisattva.",
        "source": "T03n0187_009:0594b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時淨居天子在虛空中語波旬言：『汝不自量，欲害菩薩終不能得，猶如猛風不能傾動須彌山王。』",
        "translation": "\"It was then that the Prince of the Pure Land spoke to Pāpīyān in the sky, saying, 'You don't measure yourself, and your desire to harm the bodhisattva will never obtain it, just as a fierce wind can't tilt Mount Sumeru.'",
        "source": "T03n0187_009:0594b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即向波旬，而說偈言：「『地水火風性，　　可違堅濕煖，　　菩薩志牢固，　　終無退轉時。",
        "translation": "He addressed Pāpīyān and spoke in verse, saying, 'The natures of earth, water, fire, and wind are contradictory to that of hardness, moisture, and warmth, but a bodhisattva's resolve is so strong that there's never a time to turn back.",
        "source": "T03n0187_009:0594b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　在昔發弘誓，　　永離諸煩惱，　　於彼生死病，　　當作大醫王。",
        "translation": "Having made a great vow in the past to be forever free of afflictions, he will become a great king of doctors for the illnesses of birth and death.",
        "source": "T03n0187_009:0594b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　人多墮邪路，　　方開正見眼，　　眾生處黑暗，　　將然智慧燈。",
        "translation": "Many people fall into wrong paths, but only then will the eyes of right view be opened, and sentient beings will be left in darkness, yet a lamp of wisdom will appear.",
        "source": "T03n0187_009:0594b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　欲濟生死海，　　能為作船筏，　　此是大聖主，　　方開解脫門。",
        "translation": "Wishing to save the sea of birth and death, he can build a raft, for this is the great sage lord who opens the gate of liberation.",
        "source": "T03n0187_009:0594b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　忍辱為柯幹，　　信進為花葉，　　生諸大法果，　　而汝不應毀。",
        "translation": "Forbearance is the tree trunk, faith and perseverance are the flowering leaves that produce the great fruit of the Dharma, but you mustn't disparage them.",
        "source": "T03n0187_009:0594c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝今有癡縛，　　彼已得解脫，　　當破汝煩惱，　　勿為障礙因，　　莫復於此人，　　而生于惡念。",
        "translation": "Now, you're bound by delusion; they've already been liberated, so break your afflictions and don't be a cause of obstruction; don't give rise to bad thoughts about this person again.",
        "source": "T03n0187_009:0594c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　無量劫習法，　　今者皆圓滿，　　還如昔諸佛，　　於此證菩提。』」",
        "translation": "Now, after countless eons of accumulation, they'll all be perfected, just like the buddhas of yore who realized bodhi here.'\"",
        "source": "T03n0187_009:0594c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「爾時菩提樹神，以十六種言詞毀呰魔王，淨居諸天以無量妙音讚歎菩薩。",
        "translation": "The Buddha told the monks, \"At the time, the Bodhi Tree spirit disparaged Māra King with sixteen kinds of words, and the Pure Land gods praised the bodhisattva with measureless, marvelous sounds.",
        "source": "T03n0187_009:0594c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時魔王瞋猶不解，作如是言：『今此比丘得度彼岸，當教無量無邊眾生遠離我境。』",
        "translation": "The king of Māra was still angry and didn't understand, and he said, 'Now that this monk has crossed to the other shore, he will teach measureless and limitless sentient beings to avoid my situation.'",
        "source": "T03n0187_009:0594c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更勵魔眾駈逼菩薩而不能得。",
        "translation": "He further motivated the Māras to press the bodhisattva harder, but they couldn't get him there.",
        "source": "T03n0187_009:0594c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩語魔王言：『魔王波旬汝當諦聽！",
        "translation": "\"It was then that the bodhisattva said to the demon king, 'Māra King Pāpīyān, listen closely!'",
        "source": "T03n0187_009:0594c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今於此斷汝怨讎，滅汝惡業，除汝嫉妬，成就阿耨多羅三藐三菩提；汝宜廻心生大歡喜。』",
        "translation": "Here, I've ended your enmity, ceased your bad karma, removed your jealousy, and achieved unsurpassed, corrected, and perfected enlightenment; rejoice greatly in your hearts.'",
        "source": "T03n0187_009:0594c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復告波旬：『汝以微善今獲天報，我於往昔無量劫來修習聖行，今者當得阿耨多羅三藐三菩提。』",
        "translation": "Again, he told Pāpīyān, 'Now, you've attained the divine reward for your subtle goodness; I've cultivated noble behavior for countless eons in the past, and now I will attain unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0187_009:0594c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時魔波旬語菩薩言：『我昔修善汝所能知，汝之累德誰信汝者？』",
        "translation": "Māra Pāpīyān then said to the bodhisattva, 'I cultivated goodness in the past that you can know, but who would have believed in you given your accumulated virtues?'",
        "source": "T03n0187_009:0594c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩徐舉右手以指大地，而說偈言：「『諸物依何得生長，　　大地能為平等因，　　此應與我作證明，　　汝今當觀如實說。』",
        "translation": "The bodhisattva then slowly raised his right hand and pointed to the earth as he spoke the verse, saying, \"What is the basis for the growth of all things? The earth can be an equal cause; this should testify to me; you should now observe it as it really is.\"",
        "source": "T03n0187_009:0594c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時地神形體微妙，以種種真珠瓔珞莊嚴其身，於菩薩前從地踊出，曲躬恭敬捧七寶瓶，盛滿香花以用供養，白菩薩言：『我為證明，菩薩往昔於無量劫修習聖道，今得成佛，然我此地金剛之齊，餘方悉轉此地不動。』",
        "translation": "\"At the time, the earth spirit, whose body was exquisitely proportioned and adorned with various genuine pearls and jewelry, rose up from the ground in front of the bodhisattva, bent his head in respect, held a vase full of seven treasures, filled it with flowers and scented offerings, and said to the bodhisattva, 'I testify that the bodhisattva had cultivated the noble path for measureless eons in the past and had now attained Buddhahood, yet I am here, adamantine in my alignment, and the rest of the world has been transformed here without moving.'",
        "source": "T03n0187_009:0594c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語時三千大千世界六種震動，出大音聲有十八相。",
        "translation": "When he said that, the 3,000 great one-thousand worlds shook in six ways, and a great sound with 18 characteristics was emitted.",
        "source": "T03n0187_009:0594c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時魔眾，皆悉退散憒亂失據，顛倒狼藉縱橫而走，先時所變雜類之體不能復形，魔王是時神氣挫恧無復威勢，聞大地聲心生惶怖悶絕頓躃。",
        "translation": "\"At that point, all of the Māras retreat, lose their bearings in confusion, and move about in confusion and disarray, unable to retrieve the bodies of the various species they'd previously transformed, and the demon king's demeanor is battered and he loses his authority, and when he hears the earth's voice, his mind becomes frightened, dazed, and falls down.",
        "source": "T03n0187_009:0595a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有地神，即以冷水灑魔王上而告之言：『汝魔波旬！",
        "translation": "An earth spirit then sprinkled cold water on the demon king and told him, 'You demon Pāpīyān!",
        "source": "T03n0187_009:0595a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "速疾起去，此處當有種種兵杖欲來害汝。』",
        "translation": "Get up quickly and leave, for there will be various weapons here that want to harm you.'",
        "source": "T03n0187_009:0595a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時魔王長子於菩薩前，頭面禮足作如是言：『大聖！",
        "translation": "\"At the time, the eldest son of Māra King bowed his head and feet before the bodhisattva and said, 'Great sage!",
        "source": "T03n0187_009:0595a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願聽我父發露懺悔，凡愚淺劣猶如嬰兒無有智慧，將諸魔眾恐怖大聖，我先諮諫不受我語。",
        "translation": "Please listen to my father as he confesses that he's a fool and shallow like a baby lacking wisdom, and that he terrorizes the Māras, great sages, because I first asked for advice and didn't accept my words.",
        "source": "T03n0187_009:0595a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今乞大聖恕寬我父，惟願大聖速證阿耨多羅三藐三菩提。』",
        "translation": "I beg the great sage to forgive my father, and may the great sage quickly realize supreme perfect enlightenment.\"",
        "source": "T03n0187_009:0595a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時大梵天王、釋提桓因、無數天子畟塞虛空，咸見菩薩破魔軍眾，皆大歡喜作天伎樂，雨天曼陀羅華、摩訶曼陀羅華、曼殊沙花、摩訶曼殊沙華、優鉢羅華、拘物頭華、波頭摩花、芬陀利花，以天栴檀細末之香散菩薩上，各以偈頌稱讚菩薩。",
        "translation": "\"At the time, the king of the Brahmas, Śakrodevas, and countless gods spread out across the sky, and when they saw the bodhisattva refuting the army of Māra, they all rejoiced greatly and created celestial music, raining down celestial maṇḍala flowers, mahāmandala flowers, manjusaras, mahāmajusaras, upādhara flowers, kovidāra flowers, padma flowers, and puṇḍarī flowers, and scattered the bodhisattva with the fine fragrance of celestial sandalwood, each praising the bodhisattva with a verse.",
        "source": "T03n0187_009:0595a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時魔王波旬與其眷屬退散而去，還其自宮。」",
        "translation": "Māra King Pāpīyān and his retinue then retreated and returned to their own palace.\"",
        "source": "T03n0187_009:0595a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成正覺品第二十二",
        "translation": "Chapter Twenty-two of Becoming Perfectly Enlightened",
        "source": "T03n0187_009:0595a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「爾時菩薩降伏魔怨，滅其毒刺建立法幢，初離欲惡有覺有觀，離生喜樂入初禪，內靜一心滅覺觀，定生喜樂入二禪，離喜受聖人說住於捨，有念有想身受樂入第三禪，離憂喜捨苦樂、念清淨入第四禪。",
        "translation": "The Buddha addressed the monks, \"At the time, the bodhisattva subdued Māra's enemy, extinguished its venomous thorns, and established the Dharma banner, first parting with desire and evil, having perception and contemplation, parting with the arising of joy and happiness and entering the first dhyāna, stilling his inner mind and ceasing perception and contemplation, parting with the arising of joy and happiness and entering the second dhyāna, parting with joy and feeling, which sages say is abiding in equanimity, parting with mindfulness and perception of bodily sensations and pleasures, and entering the third dhyāna, parting with sorrow, joy, equanimity, pain, pleasure, and purity of mindfulness and entering the fourth dhyāna.",
        "source": "T03n0187_009:0595a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩住於正定，其心清白光明無染，離隨煩惱，柔軟調和無有搖動，至初夜分得智得明，攝持一心獲天眼通。",
        "translation": "\"At that point, the bodhisattva abides in correct concentration, his mind is clear, bright, and undefiled, free of follow-on afflictions, flexible, and harmonious without agitation, and he attains knowledge and insight during the first part of the night, and he gathers his single mind and acquires the divine vision.",
        "source": "T03n0187_009:0595a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩即以天眼觀察一切眾生，死此生彼好色惡色，勝劣貴賤隨業而往，皆悉了知。",
        "translation": "With the divine eye, the bodhisattva then observes all sentient beings, whether they're born here or there, have good or bad form, or are superior, inferior, noble, or base, and they all go according to their actions.",
        "source": "T03n0187_009:0595a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸眾生緣身語意，造諸惡業誹謗聖人，邪見業故身壞命終便生惡趣。",
        "translation": "Because of their actions, body, speech, and thought, these sentient beings create bad actions that denigrate sages, and because of the actions of wrong views, their bodies are destroyed and they're born in a bad destiny when their lives end.",
        "source": "T03n0187_009:0595b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復觀見諸眾生，緣身語意造諸善業，正見業故身壞命終便生天上。",
        "translation": "The bodhisattva also observes and sees that sentient beings create good actions based on their physical, verbal, and mental actions, and that right view actions cause their bodies to break up and they're born up in the heavens when their lives end.",
        "source": "T03n0187_009:0595b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於中夜分攝持一心，證得憶念過去宿命智，通觀過去自他所受生事，皆悉了知一生二生，乃至十生百生、千生萬生、億生，百億生千億生，乃至照過無量百千那由他拘胝數生，乃至成劫壞劫、無量無邊成劫壞劫，皆悉憶知。",
        "translation": "In the middle of the night division, he collects and maintains a single mind, realizes the knowledge of recollection of past lives, and fully observes the past lives of self and others, fully knowing one life, two lives, up to ten lives, a hundred lives, a thousand lives, ten thousand lives, a hundred million lives, a billion lives, ten billion lives, a thousand billion lives, up to the illumination of measureless hundreds of thousands of nayutas, up to the formation and decay of eons, and measureless and limitless formation and decay of eons.",
        "source": "T03n0187_009:0595b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一住處若名若姓，若色相若飲食若苦樂若受生若死沒，所有色相住處事業，若自若他，皆悉了知。",
        "translation": "They fully know each abode by name or by family name, by form, by food and drink, by suffering and pleasure, by sensation of birth and death, and by all the form, shape, abodes, and works, whether their own or others.",
        "source": "T03n0187_009:0595b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩作是念言：『一切眾生住於生老病死險惡趣中不能覺悟，云何令彼了知生老病死苦蘊邊際？』",
        "translation": "\"The bodhisattva thinks, 'How can I make them know the limits of the painful aggregates of birth, age, illness, and death when all sentient beings abide in the perilous and unpleasant destinies of birth, age, illness, and death and aren't able to awaken to them?'",
        "source": "T03n0187_009:0595b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是思惟：『此老病死從何而有？』",
        "translation": "Think about it this way, 'Where did this old age, illness, and death come from?'",
        "source": "T03n0187_009:0595b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時能知因生故有，以有生故老病死有。",
        "translation": "\"Immediately, they can know that it's because of birth that there's existence, and it's because of birth that old age, illness, and death exist.",
        "source": "T03n0187_009:0595b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是生者復因何有？",
        "translation": "Thus, what further cause does birth exist?",
        "source": "T03n0187_009:0595b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時能知因有故有。",
        "translation": "They immediately know that it exists because it exists.",
        "source": "T03n0187_009:0595b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『如是有者復因何有？』",
        "translation": "'If it thus exists, what is the cause for its existence?'",
        "source": "T03n0187_009:0595b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時能知因取故有。",
        "translation": "He immediately knows that it exists because of grasping.",
        "source": "T03n0187_009:0595b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『如是取者復因何有？』",
        "translation": "'Thus grasped, what further cause does it have?'",
        "source": "T03n0187_009:0595b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時能知因愛故有。",
        "translation": "They immediately know that it exists because of craving.",
        "source": "T03n0187_009:0595b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『如是愛者復因何有？』",
        "translation": "'What is the cause for such a desire to exist again?'",
        "source": "T03n0187_009:0595b20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時能知因受故有。",
        "translation": "He immediately knows that it exists because of sensation.",
        "source": "T03n0187_009:0595b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『如是受者復因何有？』",
        "translation": "'Thus experienced, what further cause does it exist?'",
        "source": "T03n0187_009:0595b21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時能知因觸故有。",
        "translation": "He immediately knows that it exists because of touch.",
        "source": "T03n0187_009:0595b22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『如是觸者復因何有？』",
        "translation": "'Thus, what further cause does contact exist?'",
        "source": "T03n0187_009:0595b22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時能知因六處有。",
        "translation": "They immediately know that the six sense-fields exist as a result.",
        "source": "T03n0187_009:0595b23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『如是六處復因何有？』",
        "translation": "'What are the causes of the existence of these six sense-fields again?'",
        "source": "T03n0187_009:0595b23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時能知因名色有。",
        "translation": "'Immediately, I can know that name-and-form exists because of it.'",
        "source": "T03n0187_009:0595b24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『如是名色復因何有？』",
        "translation": "'What further cause does name-and-form exist in this way?'",
        "source": "T03n0187_009:0595b24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時能知因識故有。",
        "translation": "He immediately knows that consciousness exists because of consciousness.",
        "source": "T03n0187_009:0595b25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『如是識者復因何有？』",
        "translation": "'Thus, what further cause does consciousness exist?'",
        "source": "T03n0187_009:0595b25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時能知因行故有。",
        "translation": "Immediately, they can know that it exists because of conditioned activity.",
        "source": "T03n0187_009:0595b26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『如是行者復因何有？』",
        "translation": "'What further cause does such a practice have?'",
        "source": "T03n0187_009:0595b26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時能知因無明有。",
        "translation": "They immediately know that nescience exists because of ignorance.",
        "source": "T03n0187_009:0595b27_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩既知無明因行，行因識，識因名色，名色因六處，六處因觸，觸因受，受因愛，愛因取，取因有，有因生，生因老死憂悲苦惱，相因而生。",
        "translation": "\"At that point, the bodhisattva knows that nescience causes form, form causes consciousness, consciousness causes name-and-form, name-and-form causes the six sense-fields, the six sense-fields causes contact, contact causes feeling, feeling causes craving, craving causes grasping, grasping causes existence, existence causes birth, birth causes old age and death, and grief, sorrow, pain, and vexation are the causes of each other's birth.",
        "source": "T03n0187_009:0595b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復更思惟：『因何無故老死無？",
        "translation": "Again, he considers, 'What is the cause for the absence of old age and death?'",
        "source": "T03n0187_009:0595c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因何滅故老死滅？』",
        "translation": "By what cessation does old age and death cease?'",
        "source": "T03n0187_009:0595c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時能知，無明滅故即行滅，行滅故即識滅，識滅故即名色滅，名色滅故即六處滅，六處滅故即觸滅，觸滅故即受滅，受滅故即愛滅，愛滅故即取滅，取滅故即有滅，有滅故即生滅，生滅故即老死滅，老死滅故即憂悲苦惱滅。",
        "translation": "He immediately knows that when nescience ceases, form ceases, when form ceases, consciousness ceases, when name and form cease, when name and form cease, the six sense-fields cease, when the six sense-fields cease, sensation ceases, feeling ceases, craving ceases, attachment ceases, grasping ceases, existence ceases, birth ceases, old age and death ceases, and grief, sorrow, pain, and vexation ceases.",
        "source": "T03n0187_009:0595c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復更思惟：『此是無明，此是無明因，此是無明滅，此是滅無明道，更無有餘；此是行，此是行因，此是行滅，此是滅行道；此是識，此是識因，此是識滅，此是滅識道；此是名色，此是名色因，此是名色滅，此是滅名色道；此是六處，此是六處因，此是六處滅，此是滅六處道；此是觸，此是觸因，此是觸滅，此是滅觸道；此是受，此是受因，此是受滅，此是滅受道；此是愛，此是愛因，此是愛滅，此是滅愛道；此是取，此是取因，此是取滅，此是滅取道；此是有，此是有因，此是有滅，此是滅有道；此是生，此是生因，此是生滅，此是滅生道；此是老死，此是老死因，此是老死滅，此是滅老死之道，此是憂悲苦惱。",
        "translation": "復更思惟：『此是無明，此是無明因，此是無明滅，此是滅無明道，更無有餘；此是行，此是行因，此是行滅，此是滅行道；此是識，此是識因，此是識滅，此是滅識道；此是名色，此是名色因，此是名色滅，此是滅名色道；此是六處，此是六處因，此是六處滅，此是滅六處道；此是觸，此是觸因，此是觸滅，此是滅觸道；此是受，此是受因，此是受滅，此是滅受道；此是愛，此是愛因，此是愛滅，此是滅愛道；此是取，此是取因，此是取滅，此是滅取道；此是有，此是有因，此是有滅，此是滅有道；此是生，此是生因，此是生滅，此是滅生道；此是老死，此是老死因，此是老死滅，此是滅老死之道，此是憂悲苦惱。",
        "source": "T03n0187_009:0595c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是大苦蘊生乃至滅，如是應知。",
        "translation": "These are the great aggregates of suffering that arise and cease, which should be understood like this.",
        "source": "T03n0187_009:0595c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是苦，此是集，此是苦集滅，此是滅苦集道，應如是知。』」",
        "translation": "This is suffering, this is accumulation, this is the cessation of suffering accumulation, and this is the path to the cessation of suffering accumulation, which should be known like this.'\"",
        "source": "T03n0187_009:0595c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「菩薩於後夜分明星出時，佛、世尊、調御丈夫聖智，所應知，所應得，所應悟，所應見，所應證，彼一切一念相應慧證阿耨多羅三藐三菩提，成等正覺，具足三明。",
        "translation": "The Buddha told the monks, \"When the bodhisattva's star rises in the latter part of the night, the noble wisdom of the Buddha, the Bhagavān, and the tamer should be known, attained, realized, seen, and realized, and all of that single-minded, associated wisdom realizes unsurpassed, correct awakening, and the perfect triple vision.",
        "source": "T03n0187_009:0595c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T03n0187_009:0595c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時諸天眾中無量天子作如是言：『我等應散香花供養如來。』",
        "translation": "Measureless sons of gods then said, 'We should scatter flowers and offer them to the Tathāgata.'",
        "source": "T03n0187_009:0595c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有天子，曾見先佛成正覺時，即作是言：『汝等未可散花，如來當現瑞相，往昔諸佛成正覺時皆現瑞相。』",
        "translation": "Again, there were sons of gods who had seen the previous Buddha when he became perfectly enlightened and said, 'You mustn't scatter flowers; the Tathāgata will show an auspicious sign; all the buddhas of the past showed an auspicious sign when they became perfectly enlightened.'",
        "source": "T03n0187_009:0596a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T03n0187_009:0596a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來知彼天子思見瑞相，上昇虛空高七多羅樹，如佛所證以偈頌曰：「『煩惱悉已斷，　　諸漏皆空竭，　　更不復受生，　　是名盡苦際。』",
        "translation": "Knowing that the celestials were contemplating the auspicious appearance, the Tathāgata ascended seven tāla trees high in the sky and spoke a verse as the Buddha had realized it, saying, 'The afflictions have all been stopped, the contaminants are all gone, and I won't be subject to birth again; this is called the end of suffering.'",
        "source": "T03n0187_009:0596a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時彼諸天子心生歡喜，以微妙天花遍散佛上，當於是時香花彌布積至于膝。",
        "translation": "\"At the time, those celestials rejoiced and scattered subtle pebbles all over the Buddha, and at that point, the fragrant flowers spread out until they reached their knees.",
        "source": "T03n0187_009:0596a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來遠離無明黑暗及愛見網，竭煩惱河、拔除毒刺、解諸纏縛、摧壞魔幢建立勝幡，能善安處諸眾生界記莂眾生，觀察根性知其病本，施甘露藥為大醫王，令諸眾生皆得度脫，安置涅槃寂靜之樂，住如來藏結解脫繒入智慧城，同諸如來清淨法界。」",
        "translation": "The Tathāgata is free of the darkness of ignorance and the web of longing, dries up the river of affliction, uproots poisonous thorns, frees people from bondage, destroys demon banners, establishes a banner of victory, abides in the realm of sentient beings, records sentient beings, observes their root natures and knows the origin of their illnesses, administers ambrosia as a great king of doctors, causes all sentient beings to be liberated, places them in the tranquil bliss of nirvāṇa, abides in the Tathāgata's treasury, binds the hang of liberation, enters the city of wisdom, and shares the Tathāgata's purified Dharma realm.\"",
        "source": "T03n0187_009:0596a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「一切如來見我成道皆悉讚言：『善哉，善哉！』",
        "translation": "The Buddha addressed the monks, \"All the tathāgatas who saw me attain enlightenment praised me, saying, 'Good, good!'",
        "source": "T03n0187_009:0596a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "咸以寶蓋而覆於我。",
        "translation": "\"They all cover me with a jeweled lid.",
        "source": "T03n0187_009:0596a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其諸寶蓋合成一蓋，遍覆十方三千大千世界，於寶蓋中出妙光明，其光明網遍照無量無邊世界。",
        "translation": "Those jeweled canopies form a single canopy that covers a world of 3,000 great one-thousand worlds in ten directions, and from within the jeweled canopies there emerges a marvelous radiance, a web of light that illuminates an infinite and limitless world.",
        "source": "T03n0187_009:0596a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼世界中，諸菩薩眾讚佛功德而說偈言：「『如彼波頭摩，　　從地而踊出，　　開敷甚清淨，　　不為淤泥染。",
        "translation": "In that world, a multitude of bodhisattvas praised the Buddha's merits and spoke in verse, saying, \"Like that padma, it springs up from the ground, spreads out so purely that it isn't stained by mud.",
        "source": "T03n0187_009:0596a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　起大慈悲心，　　如雲遍充滿，　　當雨大法雨，　　潤洽於眾生。",
        "translation": "He arouses a mind of great compassion like a cloud that fills everywhere, and it rains a great dharma rain that nourishes all sentient beings.",
        "source": "T03n0187_009:0596a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　能令諸善牙，　　一切皆增長，　　堪受教法者，　　成就解脫果。』",
        "translation": "It will cause all the good teeth to grow, and those who are capable of receiving the teaching will achieve the fruit of liberation.'",
        "source": "T03n0187_009:0596a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時諸天，以偈頌曰：「『人中師子降眾魔，　　諸定現前證甘露，　　獲得三明及十力，　　威神震動遍十方。』",
        "translation": "\"At the time, the gods spoke in verse, \"The lion among men subdues Māra, realizes the ambrosia in the presence of concentration, attains the three insights and ten powers, and has a dignified presence that shakes the world in ten directions.\"",
        "source": "T03n0187_009:0596a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　在昔諸來菩薩眾，　　為愛法故供養佛，　　即從坐起禮佛足，　　讚歎如來作是言：　『世尊得無疲勞耶，　　我等親見摧魔眾，　　善哉丈夫三界尊，　　當雨無邊大法雨。』",
        "translation": "In the past, a multitude of bodhisattvas who had come to make offerings to the Buddha because they loved the Dharma rose from their seats and bowed their heads at the Buddha's feet, praising the Tathāgata and saying, 'The Bhagavān has attained the state of being without fatigue, and we've personally seen him destroy the multitude of Māra, good husband, honored one of the three realms, who will rain an infinite great Dharma rain.'",
        "source": "T03n0187_009:0596b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　十方諸佛皆施蓋，　　復出迦陵微妙音：　『如我所得淨菩提，　　仁者所證亦如是。』」",
        "translation": "The buddhas of the ten directions all offered their caps, and then there was the subtle voice of Kālāmas, 'As I have attained pure enlightenment, so have you realized it, sir.'\"",
        "source": "T03n0187_009:0596b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「欲界諸天女等，見於如來坐菩提座，獲一切智大願滿足，降伏魔怨建立勝幢，為大醫王善療眾病。",
        "translation": "The Buddha addressed the monks, \"The goddesses of the desire realm see the Tathāgata sitting on the throne of enlightenment, attaining omniscience and fulfilling the great vow, subduing Māra's enemies and building a banner of victory, and being a great king of doctors who skillfully treats numerous illnesses.",
        "source": "T03n0187_009:0596b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如師子王無諸怖畏，清淨離垢得一切智，具足三明超越四流，持一法蓋覆護三界稱婆羅門，遠離諸垢稱為比丘，除無明藏稱為沙門，離諸不善稱知足者，斷煩惱故稱勇猛者，能壞魔幢稱大力者，猶如寶洲，一切法寶充滿其中。",
        "translation": "Like the lion king who has no fears, is pure and undefiled, has attained omniscience, is fully equipped with the three kinds of knowledge and transcends the four currents, maintains a single Dharma hood that covers the three realms, is called a brāhmaṇa, is freed from all pollution, is called a monk, is freed from the store of ignorance, is called an ascetic, is freed from unskillfulness, is called courageous because he stops afflictions, and is able to destroy the demon's banner, which is called powerful, like a jeweled island filled with all the Dharma treasures.",
        "source": "T03n0187_009:0596b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸天女即說偈言：「『於此菩提樹王下，　　降伏一切大魔軍，　　安住不動如須彌，　　身心堅固無驚畏。",
        "translation": "The goddesses then spoke a verse, saying, \"Here under the king of the bodhi tree, he subdues all the great armies of Māra, remains motionless like Sumeru, and his body and mind are resolute without fear.",
        "source": "T03n0187_009:0596b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　尊於多劫修布施，　　故得一切皆圓滿，　　尊於多劫修戒行，　　暎蔽釋梵諸天眾，　　尊於多劫行忍辱，　　故得身相真金色，　　尊於多劫勤精進，　　故能降伏諸魔怨，　　尊於多劫修禪定，　　故獲如斯勝供養，　　尊於歷劫習多聞，　　速證無上大菩提，　　尊能降伏於蘊魔，　　死魔煩惱及天魔，　　一切諸魔皆斷滅，　　是故今者無憂惱。",
        "translation": "For many eons, His Holiness has cultivated generosity, which has made everything complete; for many eons, His Holiness has cultivated moral discipline, which has kept the gods of Brahmā and Śrāvastī at bay; for many eons, His Holiness has practiced forbearance, which has made his body shape truly golden; for many eons, His Holiness has diligently striven, which has made him able to subdue Māra's enemies; for many eons, His Holiness has cultivated meditation, which has resulted in such excellent offerings; for many eons, His Holiness has cultivated learning, which has quickly realized the unsurpassed great enlightenment; for many eons, His Holiness has been able to subdue the aggregates of Māra, the demons of death, the afflictions, and the demons of heaven, which have all been destroyed; therefore, I have no sorrow now.",
        "source": "T03n0187_009:0596b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　天中之天為最尊，　　三界人天所供養，　　由是有種福田者，　　所得之福無失壞。",
        "translation": "The gods are the most venerable of gods, and they are worshipped by humans and gods in the three realms; thus, those who have planted fields of merit will never lose the merits they've attained.",
        "source": "T03n0187_009:0596b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　眉間毫相極光明，　　普照十方諸國土，　　掩蔽世間諸日月，　　一切眾生蒙饒益。",
        "translation": "The tuft of hair between his eyebrows is perfectly radiant, illuminating lands in the ten directions, obscuring the sun and moon of the world, and benefiting all sentient beings.",
        "source": "T03n0187_009:0596c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如來身色甚端嚴，　　相好顏容極清淨，　　堪為三界應供者，　　普利一切諸群生。",
        "translation": "The Tathāgata's body is so well proportioned and his features so pure that he's an offering to the three realms and thoroughly benefits all sentient beings.",
        "source": "T03n0187_009:0596c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　目淨遍觀於十方，　　普見眾生身業事，　　耳淨遍聞於一切，　　天人言音佛法聲。",
        "translation": "With eyes purified, he observes the ten directions, sees the physical actions of sentient beings, and with ears purified, he hears them all, the speech and sounds of gods and humans, and the sounds of the Buddha's teaching.",
        "source": "T03n0187_009:0596c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　廣長舌相演妙音，　　求解脫者聞甘露，　　魔軍興害不驚懼，　　天人供養無喜慍。",
        "translation": "With a broad, long tongue that produces marvelous sounds, those seeking liberation hear the ambrosia, and the armies of Māra are not frightened and harmed, while gods and humans make offerings without rejoicing.",
        "source": "T03n0187_009:0596c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　摧壞魔怨不加力，　　但以慈心降伏之，　　無染無著無諸過，　　身心安隱不傾動。",
        "translation": "He destroys Māra's enemies without exerting any force but subdues them with kindness, becoming untainted, unattached, and without error, and his body and mind are peaceful and unmoving.",
        "source": "T03n0187_009:0596c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　今有無上天人師，　　一切眾生蒙善利，　　逮聞正法當信受，　　願速如尊成正覺。』」",
        "translation": "Now there are unsurpassed gods and human masters, and all sentient beings are given good benefits; they will hear the right teaching and accept it with faith, wishing to quickly become properly enlightened like the venerable.'\"",
        "source": "T03n0187_009:0596c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「如來於菩提樹下，初成正覺現佛神通，遊戲自在不可勝載，若欲說者窮劫不盡。」",
        "translation": "The Buddha addressed the monks, \"Under the bodhi tree, the Tathāgata first became perfectly enlightened and manifested the Buddha's supernormal powers, which are unsurpassed in their freedom of movement and cannot be exhausted if you want to tell them.\"",
        "source": "T03n0187_009:0596c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，略說偈言：「普變一切地，　　平正猶如掌，　涌出妙蓮花，　　一一皆千葉。",
        "translation": "It was then that the Bhagavān spoke a short verse, saying, \"The earth is universally transformed, level and correct like the palm of your hand, and out springs a wonderful lotus flower, each one with a thousand petals.",
        "source": "T03n0187_009:0596c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無量諸天眾，　　各雨眾妙花，　復於世尊前，　　合掌而瞻仰。",
        "translation": "Countless gods rain down a multitude of marvelous flowers, and they again join their palms together in veneration before the Bhagavān.",
        "source": "T03n0187_009:0596c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世尊初成佛，　　作種種神通，　須彌諸山王，　　草木叢林等，　一切皆稽首，　　頂禮菩提座，　此是佛世尊，　　現神通遊戲。",
        "translation": "When the Bhagavān first became a buddha and developed various supernormal powers, the Sumeru mountain kings and the jungles of trees and grass all bowed their heads and paid homage to the bodhi seat.",
        "source": "T03n0187_009:0596c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　身放百千種，　　光明照十方，　逮三惡眾生，　　息苦獲安樂。",
        "translation": "His body radiates with a hundred thousand kinds of light that shines in ten directions, catching the three unwholesome sentient beings and bringing peace and happiness to them by stopping their suffering.",
        "source": "T03n0187_009:0596c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是時八難處，　　無有一眾生，　懷貪瞋癡等，　　一切諸煩惱。",
        "translation": "At the time, there wasn't a single sentient being in the eight difficult places that harbored all the afflictions of greed, anger, and delusion.",
        "source": "T03n0187_009:0596c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此是師子王，　　大神通遊戲。",
        "translation": "This is the lion king, who plays with great supernormal powers.",
        "source": "T03n0187_009:0596c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　日月摩尼火，　　電等諸光明，　由佛放光明，　　蔽之皆不現。",
        "translation": "The sun, moon, maṇi fire, lightning, and other brightnesses are all obscured by the Buddha's radiance.",
        "source": "T03n0187_009:0596c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天人世間，　　無能見佛頂。",
        "translation": "None of the gods or humans in the world can see the Buddha's head.",
        "source": "T03n0187_009:0597a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　坐於師子座，　　作遊戲神通，　佛以指按地，　　即時六種動。",
        "translation": "Sitting on his lion's seat, he demonstrates his playful powers, and the Buddha presses his finger to the ground, instantly moving in six different ways.",
        "source": "T03n0187_009:0597a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　降伏魔軍眾，　　如制兜羅綿，　魔王懷憂惱，　　以杖而畵地。",
        "translation": "He subdues the army of Māra as he controls the cotton of the palm of Dhuluo, and the king of Māra, overcome with anguish, dots the ground with his staff.",
        "source": "T03n0187_009:0597a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此是佛世尊，　　遊戲大神通。」",
        "translation": "This is the Bhagavān playing with his great superknowledge.\"",
        "source": "T03n0187_009:0597a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "方廣大莊嚴經卷第九",
        "translation": "Fangguang zhuangyan jing, vol. 9",
        "source": "T03n0187_009:0597a08_0",
        "is_bad_quality": false
    }
]