[
    {
        "source_sentence": "六度集經卷第四",
        "translation": "Sutra on the Collection of the Six Perfections, Volume 4",
        "source": "T03n0152_004:0016c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吳康居國沙門康僧會譯",
        "translation": "Translated by Kang Senghui, a monk from Kangju, Wu",
        "source": "T03n0152_004:0016c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戒度無極章第二(此有十五章)",
        "translation": "The Second Chapter of the Sutra on the Inexhaustibility of the Precepts (There are fifteen chapters here)",
        "source": "T03n0152_004:0016c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「戒度無極者，厥則云何？",
        "translation": "\"What does this mean, 'the infinitude of moral discipline'?",
        "source": "T03n0152_004:0016c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "狂愚兇虐好殘生命，貪餘盜竊，婬妷穢濁，兩舌，惡罵，妄言，綺語，嫉、恚、癡心。",
        "translation": "They are crazy, fierce, abusive, and cruel to life, lusting after and stealing from others, lustful and defiled, duplicitous, abusive, false, and fancy speech, and jealousy, ill-will, and delusion.",
        "source": "T03n0152_004:0016c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "危親戮聖，謗佛亂賢，取宗廟物，懷兇逆，毀三尊，如斯元惡，寧就脯割，葅醢市朝，終而不為；信佛三寶，四恩普濟矣。」",
        "translation": "They endanger their relatives and kill the sages, denigrate the Buddha and disparage the good, seize the property of ancestral temples, harbor fierce enemies, disparage the three honored ones, and so forth, prefer to be slaughtered, minced, and scavenged in the marketplace, but never do so; faith in the Buddha's Three Treasures will lead to the universal salvation of the four kinds of kindness.\"",
        "source": "T03n0152_004:0016c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二七）「昔者菩薩為清信士，所處之國其王行真，勸導臣民令知三尊，執戒奉齋者捐賦除役；黎庶巨細見王尚賢，多偽善而潛行邪。",
        "translation": "(27) \"Once, when the bodhisattva was a pure believer, the king of the country where he lived practiced truth, encouraged his subjects to know the Three Honored Ones, and those who observed precepts and observed purification donated their taxes and removed their labor; the common people, large and small, saw that the king was still wise, yet many were hypocritical and practiced evil.",
        "source": "T03n0152_004:0016c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王以佛戒觀察民操，有外善內穢，違佛清化，即權令而勅曰：『敢有奉佛道者罪至棄市。』",
        "translation": "When the king observed the people's conduct in light of the Buddha's precepts, and there were cases of external goodness and internal filth that went against the Buddha's pure teachings, he issued an order authorizing them to do so, saying, 'Anyone who dares to follow the Buddha's path will be punished by abandoning the market.'",
        "source": "T03n0152_004:0016c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "訛善之徒靡不釋真，恣心從其本邪。",
        "translation": "All those who corrupt good people fail to release the truth and abandon their minds to their original error.",
        "source": "T03n0152_004:0016c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩年耆，懷正真弘影之明，聞令驚曰：『釋真從邪獲為帝王，壽齊二儀富貴無外，六樂由心，吾終不為也。",
        "translation": "When he heard the order, the bodhisattva, who was elderly and harbored the vision of the true and vast shadow, was startled and said, 'Śākyamuni has followed error and become an emperor, with his life span equal to the two postures, wealth and riches that have no limit, and six pleasures that come from his mind, but I would never do that.",
        "source": "T03n0152_004:0016c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖一飡之命，得覩三尊至真之化，吾欣奉之。",
        "translation": "Even though it's only a single drop of life, I'm delighted to see the transformation of the three honored ones into the ultimate truth.",
        "source": "T03n0152_004:0016c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "懷俗記籍萬億之卷，身處天宮極天之壽，而闇於三尊，不聞佛經，吾不願也。",
        "translation": "I wouldn't want to be in the dark about the three honored ones and not hear the Buddha's sūtras while I'm carrying a trillion volumes of mundane records and being in a heavenly palace with the longest life span in the heavens.",
        "source": "T03n0152_004:0016c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "稟佛之言，即有戮死之患，吾甘心焉。",
        "translation": "If I were to take the Buddha's advice, I'd be in danger of being killed, but I'd be willing to do so.",
        "source": "T03n0152_004:0016c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「眾生自投三塗，獲人道難，處中國難，六情完具難，生有道國難，與菩薩親難，覩經信之難，貫奧解微難，值高行沙門清心供養難，值佛受決難。」",
        "translation": "The sūtras say, \"Since sentient beings are cast into the three destinies, it's difficult to attain humanity, difficult to live in China, difficult to complete the six senses, difficult to be born in a country with a path, difficult to become intimate with a bodhisattva, difficult to see the sūtras and believe in them, difficult to penetrate the subtleties of mystical understanding, difficult to meet a highly practiced ascetic who makes offerings with a clear heart, and difficult to meet a Buddha who accepts judgment.\"",
        "source": "T03n0152_004:0016c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾宿功著，今覩佛經、獲奉三寶，若值無道葅醯之酷、湯火之戾，終不釋正從彼妖蠱也。』",
        "translation": "My long-standing merits have made it possible for me to see the Buddha's sūtras and venerate the Three Treasures, but if I were to encounter the cruelty of the immoral gods and the violence of fire and water, I would never be freed from correctly following their evil spirits.'",
        "source": "T03n0152_004:0017a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王命有司廉察違命者，戮之市朝，廉人見菩薩志固不轉，奉事三尊至意不虧，即執之以聞。",
        "translation": "\"The king ordered the superintendent to investigate the disobedient and kill them in the marketplace. When the honest man saw that the bodhisattva's resolve was resolute and his dedication to serving the three honored ones uncompromising, he took him and told him about it.",
        "source": "T03n0152_004:0017a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『戮之於市。』",
        "translation": "The king said, 'Kill him in the marketplace.'",
        "source": "T03n0152_004:0017a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "陰使人尋聽察其云。",
        "translation": "He sent someone to search and listen to his clouds.",
        "source": "T03n0152_004:0017a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩就死，誡其子曰：『乾坤始興有人之來，眾生處世，以六情亂行甚於狂醉，尠覩三尊，導清明化也。",
        "translation": "When the bodhisattva was about to die, he instructed his son, 'Since the dawn of time when man first arose in the heavens and kings, sentient beings have been living in a world where their six emotions and disordered behavior are worse than insanity, and they don't often hear of the three honored ones who guide them through the process of clear transformation.",
        "source": "T03n0152_004:0017a07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾幸知法，慎無釋之。",
        "translation": "It's fortunate that you know the teaching, so be careful not to explain it.",
        "source": "T03n0152_004:0017a10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫捨佛法之行，而為鬼妖之偽者，國喪必矣。",
        "translation": "If you abandon the practice of the Buddha-dharma and become a fake ghost or demon, your country will surely be lost.",
        "source": "T03n0152_004:0017a10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾寧捨身，不去真也。",
        "translation": "I'd rather abandon myself than go to the truth.",
        "source": "T03n0152_004:0017a11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王今悖誤，爾無從焉。』",
        "translation": "Now, the king has acted contrary and mistakenly, so there's no way you can follow it.'",
        "source": "T03n0152_004:0017a12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廉者以聞。",
        "translation": "The honest man then heard about it.",
        "source": "T03n0152_004:0017a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王知行真，即欣而請之，執手昇殿曰：『卿真可謂佛弟子者矣。』",
        "translation": "Knowing that his practice was genuine, the king gladly invited him, took his hand, and raised him to the palace, saying, 'You really can be called a disciple of the Buddha.'",
        "source": "T03n0152_004:0017a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "拜為國相，委任治政，捨佛清化之疇者，復其賦役，於是國境莫尚為善。」",
        "translation": "He made him prime minister of the country, appointed him to govern, and restored the duties of those who had abandoned the Buddha's ministry of cleansing.",
        "source": "T03n0152_004:0017a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸沙門：「時國王者，彌勒是也。",
        "translation": "The Buddha told the ascetics, \"The king of the country at the time was Maitreya.",
        "source": "T03n0152_004:0017a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "清信士者。",
        "translation": "That person of pure faith is myself.",
        "source": "T03n0152_004:0017a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾身是也。",
        "translation": "I myself am that person.",
        "source": "T03n0152_004:0017a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩執志度無極行持戒如是。」",
        "translation": "This is how a bodhisattva adheres to the precept of the infinite practice of liberating others.\"",
        "source": "T03n0152_004:0017a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二八）「昔者菩薩，身為象王，其心弘遠，照知有佛、有法、有比丘僧，常三自歸，每以普慈拯濟眾生，誓願得佛當度一切。",
        "translation": "(28) \"Once, a bodhisattva who was the king of elephants had a mind so vast that he perceived that there was a Buddha, Dharma, and monks and nuns, and he always gave himself up three times, always saving sentient beings with universal compassion, vowing to attain Buddhahood and save them all.",
        "source": "T03n0152_004:0017a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從五百象，時有兩妻。",
        "translation": "He went along with five hundred elephants who had two wives at the time.",
        "source": "T03n0152_004:0017a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "象王於水中得一蓮華，厥色甚妙，以惠嫡妻。",
        "translation": "The elephant king got a lotus flower in the water that had a wonderful color and gave it to his first wife.",
        "source": "T03n0152_004:0017a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嫡妻得華，欣懌曰：『氷寒尤甚，何緣有斯華乎？』",
        "translation": "When the first wife got the flower, she gladly exclaimed, 'How could there be such a flower when the ice is so cold?'",
        "source": "T03n0152_004:0017a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "小妻貪嫉，恚而誓曰：『會以重毒鴆殺汝矣。』",
        "translation": "His younger wife was jealous and became angry, vowing, 'I'll kill you with a heavy poisonous dose.'",
        "source": "T03n0152_004:0017a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "結氣而殞。",
        "translation": "She was overcome by anger and died.",
        "source": "T03n0152_004:0017a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「魂靈感化為四姓女，顏華絕人，智意流通，博識古今，仰觀天文，明時盛衰。",
        "translation": "\"Her soul was transformed into a woman of four surnames with a stunningly beautiful face, a penetrating intelligence, a thorough knowledge of ancient and modern times, and an upward observation of astronomy and an understanding of the times of prosperity and decline.",
        "source": "T03n0152_004:0017a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞若茲，娉為夫人。",
        "translation": "The king heard of her and gave her the title of wife.",
        "source": "T03n0152_004:0017a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至即陳治國之政，義合忠臣，王悅而敬之，每言輙從。",
        "translation": "She then explained the government of the country, combining righteousness with loyalty, and the king was pleased and respected by her, always obeying her every word.",
        "source": "T03n0152_004:0017a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫人曰：『吾夢覩六牙之象，心欲其牙以為珮几。",
        "translation": "The lady said, 'I dreamt I saw an elephant with six tusks, and I wanted one of those tusks to be a helmet.",
        "source": "T03n0152_004:0017a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王不致之，吾即死矣。』",
        "translation": "If the king doesn't give them to me, I will die.'",
        "source": "T03n0152_004:0017b01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『無妖言也，人聞笑爾。』",
        "translation": "The king said, 'There's no such thing as a demon, but people hear and laugh about it.'",
        "source": "T03n0152_004:0017b02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫人言：『相屬心生憂結。』",
        "translation": "The lady said, 'Our mutual dependents' hearts are tied in grief.'",
        "source": "T03n0152_004:0017b02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王請議臣四人，自云己夢，曰：『古今有斯象乎？』",
        "translation": "The king invited four ministers to consult him and told them they had a dream, saying, 'Did such an image exist in the past or present?'",
        "source": "T03n0152_004:0017b03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一臣對曰：『無有之也。』",
        "translation": "A minister replied, 'There's nothing like it.'",
        "source": "T03n0152_004:0017b04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一臣曰：『王不夢也。』",
        "translation": "A minister said, 'The king doesn't dream about it.'",
        "source": "T03n0152_004:0017b05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一臣曰：『甞聞有之，所在彌遠。』",
        "translation": "A minister said, 'I've heard that it exists, but it's far away.'",
        "source": "T03n0152_004:0017b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一臣曰：『若能致之，帝釋今翔於茲矣。』",
        "translation": "A minister said, 'If it were possible to reach it, then Tishri would be flying here now.'",
        "source": "T03n0152_004:0017b06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四臣即召四方射師問之。",
        "translation": "Four ministers then summoned the archers of the four directions to ask them about it.",
        "source": "T03n0152_004:0017b07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "南方師曰：『吾亡父常云：「有之。",
        "translation": "The southern minister said, 'My late father always said, 'There is such a thing.",
        "source": "T03n0152_004:0017b07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然遠難致。」』",
        "translation": "It's difficult to reach, though.'\"",
        "source": "T03n0152_004:0017b08_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臣上聞云：『斯人知之。』",
        "translation": "The minister heard it, saying, 'This man knows it.'",
        "source": "T03n0152_004:0017b08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即現之。",
        "translation": "The king then showed it to him.",
        "source": "T03n0152_004:0017b09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫人曰：『汝直南行三千里，得山入山，行二日許，即至象所在也。",
        "translation": "The lady said, 'Go straight south for 3,000 miles, enter the mountain when you reach it, and walk for about two days, and you'll reach the elephant.",
        "source": "T03n0152_004:0017b09_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道邊作坑，除爾鬚髮著沙門服，於坑中射之。",
        "translation": "Make a pit at the edge of the road, remove your hair and put on your monk's robe, and shoot it in the pit.",
        "source": "T03n0152_004:0017b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "截取其牙，將二牙來。』",
        "translation": "He cut off his tusks and brought them both to me.'",
        "source": "T03n0152_004:0017b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「師如命行，之象遊處，先射象，著法服持鉢，於坑中止住。",
        "translation": "\"The teacher did as instructed, and when he arrived at the elephant's place of travel, he shot the elephant first, put on his robe and bowl, and stopped in the pit.",
        "source": "T03n0152_004:0017b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "象王見沙門，即低頭言：『和南道士！",
        "translation": "When the elephant king saw the ascetic, he bowed his head and said, 'Wayward monk Vainan!",
        "source": "T03n0152_004:0017b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將以何事賊吾軀命？』",
        "translation": "What will be the reason for robbing me of my life?'",
        "source": "T03n0152_004:0017b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『欲得汝牙。』",
        "translation": "He said, 'I want to get your tooth.'",
        "source": "T03n0152_004:0017b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "象曰：『吾痛難忍，疾取牙去，無亂吾心令惡念生也。",
        "translation": "The elephant said, 'I have unbearable pain, so I'd better hurry and get rid of my tooth so I won't disturb my mind and cause bad thoughts to arise.",
        "source": "T03n0152_004:0017b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "志念惡者死入太山、餓鬼、畜生道中。",
        "translation": "Those who are mindful of evil will die and enter the destinies of Taishan, hungry ghosts, and animals.",
        "source": "T03n0152_004:0017b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫懷忍行慈，惡來善往，菩薩之上行也，正使俎骨脯肉，終不違斯行也。",
        "translation": "A bodhisattva who harbors patience and practices kindness, and who returns bad deeds well, is the supreme practice of a bodhisattva, which will never cause him to chop bones and breast meat and never disobey such a practice.",
        "source": "T03n0152_004:0017b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修斯行者，死輙上天，疾得滅度矣。』",
        "translation": "Those who practice this kind of behavior will migrate up to heaven at death and be quickly liberated.'",
        "source": "T03n0152_004:0017b19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人即截牙，象曰：『道士當却行，無令群象尋足跡也。』",
        "translation": "The man then cut off the elephant's tusks, and the elephant said, 'The practitioner will leave and not allow the elephants to find their footprints.'",
        "source": "T03n0152_004:0017b20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "象適人去遠，其痛難忍，躃地大呼，奄忽而死，即生天上。",
        "translation": "The elephant was so distant that it couldn't stand the pain, fell to the ground, cried out, and died suddenly, and was then born in heaven.",
        "source": "T03n0152_004:0017b21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "群象四來，咸曰：『何人殺吾王者？』",
        "translation": "The elephants came in groups and said, 'Who killed our king?'",
        "source": "T03n0152_004:0017b23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行索不得，還守王哀號。",
        "translation": "He returned to guard the king's lamentation after failing to conduct a search.",
        "source": "T03n0152_004:0017b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「師以牙還。",
        "translation": "\"The preceptor returned it with the tusks.",
        "source": "T03n0152_004:0017b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王覩象牙心即慟怖，夫人以牙著手中，適欲視之，雷電霹靂椎之吐血，死入地獄。」",
        "translation": "When the king saw the elephant's tusks, his heart went into shock, and the lady put the tusks in her hand.",
        "source": "T03n0152_004:0017b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸沙門：「爾時象王者，我身是也。",
        "translation": "The Buddha told the ascetics, \"At the time, that elephant king was me.",
        "source": "T03n0152_004:0017b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大婦者，求夷是。",
        "translation": "The great woman, Kauṇḍinya, is this.",
        "source": "T03n0152_004:0017b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獵者，調達是。",
        "translation": "The hunter, that's Tadra.",
        "source": "T03n0152_004:0017b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "小夫人者，好首是。",
        "translation": "The young lady, that's the chief of the good.",
        "source": "T03n0152_004:0017b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩執志度無極行持戒如是。」",
        "translation": "This is how a bodhisattva adheres to the precept of the supreme practice of perfection of will.\"",
        "source": "T03n0152_004:0017b28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（二九）「昔者菩薩，為鸚鵡王，常奉佛教，歸命三尊。",
        "translation": "(29) \"Once, a bodhisattva who was a parrot king always deferred to Buddhism and gave his allegiance to the three honored ones.",
        "source": "T03n0152_004:0017c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時當死，死不犯十惡，慈心教化，六度為首。",
        "translation": "When he was about to die, he didn't commit the ten evils in death, and he had a compassionate heart that taught the six perfections as his first priority.",
        "source": "T03n0152_004:0017c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，國王好食鸚鵡，獵士競索，覩鸚鵡群，以網收之，盡獲其眾，貢于太官。",
        "translation": "At the time, the king liked to eat parrots, and when hunters competed for them, they saw a flock of parrots and gathered them in a net.",
        "source": "T03n0152_004:0017c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宰夫收焉，肥即烹之為肴。",
        "translation": "The butcher collected them, fattened them up, and cooked them for the king's feast.",
        "source": "T03n0152_004:0017c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鸚鵡王深惟，眾生擾擾赴獄喪身，迴流三界靡不由食。",
        "translation": "The king of parrots was deeply concerned that sentient beings would be disturbed, go to hell and lose their bodies, and go back to the three realms without any reason to eat them.",
        "source": "T03n0152_004:0017c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "告從者曰：『除貪捐食，體疵小苦，命可冀矣。",
        "translation": "He told his followers, 'If you remove craving and donate food, your body will be deficient in minor pains, and your life can be expected.'",
        "source": "T03n0152_004:0017c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愚者饕餮，心無遠慮，猶若慳子貪刀刃之尠蜜，不知有截舌之患。",
        "translation": "A foolish gourmand's mind lacks foresight, like a stingy man who craves the lubricant and honey of a knife blade and doesn't realize the danger of cutting off his tongue.",
        "source": "T03n0152_004:0017c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾今裁食，爾等則焉。』",
        "translation": "Now, I'll cut back on food, and you will follow suit.'",
        "source": "T03n0152_004:0017c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鸚鵡王日瘦，由其籠目勢踊得出，立籠上曰：『夫貪惡之大，無欲善之，景矣。』",
        "translation": "The king of the parrots, who was thin every day, emerged from his cage with his eyes trained, and stood on top of the cage, saying, 'The greatness of craving and evil is that there's no desire to be good at it, so you can see it.'",
        "source": "T03n0152_004:0017c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "重曰：『諸佛以貪為獄為網、為毒為刃，爾等損食可如余焉。』",
        "translation": "He said, 'The buddhas use greed as hell, as a net, and as poison, as a sword, so you can harm your food like the rest of them.'",
        "source": "T03n0152_004:0017c12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩自斯，若為凡人，麤食供命，弊衣蓋形，以貪戒心，無日不存。",
        "translation": "Since then, if a bodhisattva were a mere mortal, he'd offer his life on coarse food and cover his body with poor clothing, and his mind wouldn't stop day after day because of greed and morality.",
        "source": "T03n0152_004:0017c13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "福為帝王，輙以佛智觀國之累，福高弘多，其為難算矣。",
        "translation": "If they're blessed as an emperor, they might even contemplate the country's burdens with the Buddha's wisdom, and their fortune would be so great and vast that it's difficult to calculate.",
        "source": "T03n0152_004:0017c15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非常無牢，唯苦無樂，夫有輙滅，身為偽幻，難保猶卵，難養若狼。",
        "translation": "They are neither permanent nor secure, only painful and unpleasant, and when they are permanent and cease, their bodies are counterfeit and illusory, difficult to preserve like an egg, and difficult to nurture like a wolf.",
        "source": "T03n0152_004:0017c16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有眼覩焉，靡不寒慄。",
        "translation": "Everyone who has eyes to see them is frightened.",
        "source": "T03n0152_004:0017c18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩世世以戒為行，遂成如來、無所著、正真道、最正覺，為天人師。」",
        "translation": "From generation to generation, bodhisattvas conduct themselves according to precepts, and they become tathāgatas, unattached, truly true, and most awakened, and they serve as teachers to gods and humans.\"",
        "source": "T03n0152_004:0017c18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「時鸚鵡王者，吾身是也。",
        "translation": "The Buddha told the monks, \"The king of parrots at the time was myself.",
        "source": "T03n0152_004:0017c20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人王者，調達是也。",
        "translation": "The human king is the tathāgata.",
        "source": "T03n0152_004:0017c21_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩執志度無極行持戒如是。」",
        "translation": "This is how a bodhisattva adheres to the precepts of the infinite practice of will-transformation.\"",
        "source": "T03n0152_004:0017c21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（三〇）「昔者菩薩，為王太子，名曰法施，內清外淨，常以履邪之禍自戒其心，尊聖孝親，慈濟眾生。",
        "translation": "(30) \"Once, a bodhisattva who was the king's prince and was named Dharmakṣema was internally pure and externally pure, always disciplining himself by fulfilling the wickedness of his mind, honoring sages and filial relatives, and compassionately helping sentient beings.",
        "source": "T03n0152_004:0017c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子朝覲，輙須相國，進退如禮未甞失儀。",
        "translation": "When the prince went on pilgrimages, he always had to assist the king's household, and he never failed to conduct himself according to propriety when advancing and retreating.",
        "source": "T03n0152_004:0017c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王之幸妾，內懷邪淫，出援太子，太子力爭而獲免焉，拍相首曰：『去矣。』",
        "translation": "When the king's concubine, who was pregnant with an evil spirit, came out to aid the prince, the prince argued forcefully and was excused, patting his ministerial head and saying, 'Go away.'",
        "source": "T03n0152_004:0017c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其冠隕地，相首無髮，內妾笑之，恥而懷忿。",
        "translation": "His crown fell to the ground and his head was left hairless. His inner concubine laughed at him and was ashamed and angry.",
        "source": "T03n0152_004:0017c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妾向王泣曰：『妾雖微賤猶是王妻，太子不遜，有欲于妾。』",
        "translation": "She said to the king, weeping, 'Even though I'm a humble woman, I'm still the king's wife; the crown prince doesn't despise me and has a desire for me.'",
        "source": "T03n0152_004:0017c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『太子履操，非佛志不念，非佛教不言，非佛道不行，八方歎德，諸國莫如，其豈有非乎？』",
        "translation": "The king said, 'The prince's conduct is such that he doesn't think unless it's the Buddha's will, doesn't speak unless it's Buddhism, and doesn't practice unless it's the Buddha's way.",
        "source": "T03n0152_004:0018a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "讒言緻數，以惑王心。",
        "translation": "They spoke eloquently and elaborately to confuse the king's mind.",
        "source": "T03n0152_004:0018a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『骨肉相殘謂之亂賊，吾不為也。』",
        "translation": "The king said, 'The killing of flesh and blood is called a traitor, and I won't do it.'",
        "source": "T03n0152_004:0018a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "拜為邊王，去國八千里，曰：『爾鎮境外，則天行仁，無殘民命，無苟貪困黎庶，尊老若親，愛民若子，慎修佛戒守道以死。",
        "translation": "He was worshipped as a border king 8,000 miles from his country and said, 'Suppose you go beyond the borders of your town, so that heaven acts benevolently, don't brutalize the lives of the people, don't lust for the common people, honor the elderly as your relatives, love the people as your sons, and carefully cultivate Buddhist morality and observe the path to death.",
        "source": "T03n0152_004:0018a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世多姧偽，齒印之教，爾乃信矣。』",
        "translation": "The world is full of scoundrels and hypocrites, but you've come to believe in the teaching of Tein.'",
        "source": "T03n0152_004:0018a08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子稽首泣涕曰：『不敢替尊誨。』",
        "translation": "The prince bowed his head and wept, saying, 'I dare not replace your teaching.'",
        "source": "T03n0152_004:0018a08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即就錄土，五戒十德，慈化國民，處位一年，遠民慕潤，歸化雲集，增戶萬餘，以狀上聞，歎王德潤遠照使然。",
        "translation": "He then took refuge in the land, bestowed the five precepts and ten virtues, compassionately transformed the people, and spent a year in his position, and was adored by the people from afar, who gathered in droves to convert more than 10,000 families and heard about it in the form, praising the king for his virtue and fertility and for his far-reaching insight.",
        "source": "T03n0152_004:0018a09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王逮后妃，喜而歎之。",
        "translation": "\"When the king arrested the queen and princess, he was delighted and praised her.",
        "source": "T03n0152_004:0018a12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妾殊懷怨，與相為姧，謀除太子，伺王臥出，以蠟抑印，詐為書：『爾有慢上之罪，不忍面誅，書到疾脫眼童子，付使還國。』",
        "translation": "I harbored a grudge against him, so I plotted with the minister to remove the crown prince, waited for the king to leave his bed, put wax on my seal, and fraudulently wrote, 'You've been guilty of concealing the king, and I can't bear to face killing him; when the writing arrived, I quickly took off the eyes of the boy and sent him back to the country.'",
        "source": "T03n0152_004:0018a12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使往至，群臣僉曰：『斯妖亂之使，非自大王也。』",
        "translation": "When the envoy arrived, the ministers all said, 'This is a disruptive envoy, not from the king.'",
        "source": "T03n0152_004:0018a15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子曰：『大王前齒，今者信現。",
        "translation": "The crown prince said, 'The great king's former teeth are now visible in his faith.",
        "source": "T03n0152_004:0018a16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愛身違親，謂之大逆矣。』",
        "translation": "To love one's body and disregard one's relatives is called a great heinous act.'",
        "source": "T03n0152_004:0018a17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即與群臣相樂三日，遍行國界，賙窮濟乏，以佛影模，慈心訓民。",
        "translation": "He then partnered with his ministers for three days, traveled throughout the country, helping the poor and destitute, using the Buddha's image as a model, and teaching the people with kindness.",
        "source": "T03n0152_004:0018a18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "募能脫眼者，賣芻兒即為出眼，以付使者。",
        "translation": "They recruited a man who could remove his eyes, sold him a son of a regurglar, and gave him to the messenger.",
        "source": "T03n0152_004:0018a19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "函之馳還本土，相國以付嬖妾，嬖妾懸著床前，罵曰：『不從吾欲，鑿眼快乎？』",
        "translation": "When he returned to his homeland, the minister gave his concubine a gift from the minister, who hung her up in front of his bed and scolded him, saying, 'Wouldn't it be faster to cut out my eyes than to obey my desires?'",
        "source": "T03n0152_004:0018a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大王夢虵蜂螫太子目，寤即哽噎，曰：『吾子將有異乎？』",
        "translation": "\"When the king awoke from a dream in which a bee stung the prince's eye, he was choked up and said, 'Will my son be different?'",
        "source": "T03n0152_004:0018a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嬖妾曰：『王存之至，聊有斯夢，必無異也。』",
        "translation": "The concubine said, 'When the king's retreat is near, he'll dream this dream for a while; there must be nothing different.'",
        "source": "T03n0152_004:0018a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子以琴樂索食濟命，展轉諸國至妃父王之國。",
        "translation": "The prince asked for food to help him escape death with music on his lute and traveled from country to country of his concubine's father.",
        "source": "T03n0152_004:0018a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王有妙琴，呼而聽之。",
        "translation": "The king had a wonderful lute, so he summoned it and listened to it.",
        "source": "T03n0152_004:0018a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其音咨嗟已先王之德，未為孤兒無親之哀音。",
        "translation": "Its sound was a sigh of praise for the virtues of the previous king, but it was not the sad voice of an orphan child without relatives.",
        "source": "T03n0152_004:0018a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其妃解音，哽噎曰：『吾君子窮哉！』",
        "translation": "His consort understood the sound and choked up, saying, 'Is my lord in poverty?'",
        "source": "T03n0152_004:0018a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『何謂？』",
        "translation": "The king said, 'What's the meaning of this?'",
        "source": "T03n0152_004:0018a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妃具陳之，辭親曰：『斯自妾命，女二其姓非貞也。』",
        "translation": "The consort explained everything to her and excused herself from her intimate conversation, saying, 'This is my concubine's fate; a woman with two surnames is not chaste.'",
        "source": "T03n0152_004:0018a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "請翼從至孝之君子。",
        "translation": "Please obey the most dutiful of gentlemen.",
        "source": "T03n0152_004:0018b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二親舉哀，妃將太子還其本國。",
        "translation": "The two relatives raised their condolences, and the princess returned the prince to his native land.",
        "source": "T03n0152_004:0018b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王聞有妙琴者，呼而作之。",
        "translation": "\"The king heard of a wonderful lute player and summoned him to play it.",
        "source": "T03n0152_004:0018b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "形容憔悴，唯識其聲。",
        "translation": "His features were emaciated, but he was only aware of its sound.",
        "source": "T03n0152_004:0018b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『汝是吾子法施者乎！』",
        "translation": "The king said, 'Are you my son, the donor of the Dharma?'",
        "source": "T03n0152_004:0018b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子伏地哽噎。",
        "translation": "The crown prince crouched to the ground and choked.",
        "source": "T03n0152_004:0018b04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王后宮人，舉國巨細莫不哀慟。",
        "translation": "The king, queen, palace, and everyone in the country, large and small, were all saddened.",
        "source": "T03n0152_004:0018b04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妃本末陳之。",
        "translation": "The princess explained the whole story.",
        "source": "T03n0152_004:0018b05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『嗚呼女人不仁，猶粳飯之糅毒。",
        "translation": "The king said, 'Aah! A woman is unkind, like the poisonous mixture of millet and rice.",
        "source": "T03n0152_004:0018b05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛教遠之，不亦宜乎！』",
        "translation": "Wouldn't it be better if the Buddhists taught to distance themselves from them?'",
        "source": "T03n0152_004:0018b06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即收相國及嬖妾，以棘笞之，焬膠渧其瘡中，燺即裂之，為坑生埋矣。」",
        "translation": "He then took the minister and his concubine, flogged them with a thorn, dripped the metal glue into their sores, split their heads open, and buried them in a pit.\"",
        "source": "T03n0152_004:0018b07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「太子宿命甞賣白珠，彼妾時為富姓女，乘車行路，相國時為御者。",
        "translation": "The Buddha told the monks, \"In his previous life, the prince used to sell white pearls to his concubine, who was then a rich woman traveling in a chariot, and the minister of the ministerial state was then his protector.",
        "source": "T03n0152_004:0018b08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "呼賣珠童，曰：『視汝珠來。』",
        "translation": "She summoned the boy who was selling the pearls and said, 'Look at your pearls!'",
        "source": "T03n0152_004:0018b10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持珠而不買，婬視言調。",
        "translation": "She held the pearl but didn't buy it, and she looked at it lasciviously and said she was tuned up.",
        "source": "T03n0152_004:0018b11_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子恚曰：『不還吾珠而為婬視，吾鑿汝目。』",
        "translation": "The boy became angry and said, 'If you don't return my pearls and look at them lasciviously, I'll cut your eyes out.'",
        "source": "T03n0152_004:0018b11_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女及御者，俱曰：『棘笞膠渧裂肉生埋汝可乎？』",
        "translation": "The woman and the royalty both said, 'Can you be buried with a thorn, a stick, a drop of glue, and a piece of flesh?'",
        "source": "T03n0152_004:0018b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫善惡已施，禍福自隨，猶影之繫形，惡熟罪成，如響之應聲。",
        "translation": "\"After good and evil are bestowed, misfortune and fortune follow on their own, like a shadow tethering a form, and when bad maturation occurs, it's like a resonant echo.",
        "source": "T03n0152_004:0018b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為惡欲其無殃，猶下種令不生矣。",
        "translation": "Doing evil desires no misfortune, just like planting seeds so they won't arise.",
        "source": "T03n0152_004:0018b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩受佛淨戒，寧脫眼而死，不犯淫生也。",
        "translation": "A bodhisattva who accepts the Buddha's pure precepts would rather lose his eyes and die than commit lustful birth.",
        "source": "T03n0152_004:0018b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，太子法施者，我身是也。",
        "translation": "At the time, the prince's gift of the Dharma was self.",
        "source": "T03n0152_004:0018b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "相國者，調達是。",
        "translation": "\"Xiangguo, this is Tada.",
        "source": "T03n0152_004:0018b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嬖妾者，調達妻是也。",
        "translation": "A concubine is Tadra's wife.",
        "source": "T03n0152_004:0018b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩執志度無極行持戒如是。」",
        "translation": "This is how a bodhisattva adheres to the precept of the infinite practice of will-transformation.\"",
        "source": "T03n0152_004:0018b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（三一）「昔者菩薩，兄弟三人，遭世枯旱，黎民相噉，俱行索食，以濟微命。",
        "translation": "(31) \"Once upon a time, three bodhisattvas were brothers who, when the world was drought-stricken and the people were devouring each other, went out to solicit food to save their meager livelihoods.",
        "source": "T03n0152_004:0018b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經歷山嶮乏食有日，兩兄各云：『以婦濟命可乎！』",
        "translation": "One day they went through a mountain valley and ran out of food, and each of the two brothers said, 'Would it be possible to save my life with a woman?'",
        "source": "T03n0152_004:0018b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大兄先殺其妻，分為五分；小弟仁惻，哀而不食。",
        "translation": "The oldest brother first killed his wife and divided her into five parts; the younger brother was kind and compassionate, and he took pity on her and didn't eat.",
        "source": "T03n0152_004:0018b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中兄復殺，弟殊哽噎。",
        "translation": "When the middle brother killed him again, the younger brother was overcome with grief.",
        "source": "T03n0152_004:0018b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兩兄欲殺弟妻，弟曰：『殺彼全己，非佛仁道，吾不為也。』",
        "translation": "When the two brothers wanted to kill the younger brother's wife, the younger brother said, 'Killing them to save myself is not the kindly way of the Buddha; I won't do it.'",
        "source": "T03n0152_004:0018b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將妻入山採果自供。",
        "translation": "He sent his wife into the mountains to gather fruit for his own offerings.",
        "source": "T03n0152_004:0018b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "處山歷年，山中有一跛人，婦與私通，謀殺其婿。",
        "translation": "After years on the mountain, there was a cripple in the mountain whose wife had an illicit affair with her son-in-law and was plotting to kill him.",
        "source": "T03n0152_004:0018b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "詭曰：『妾義當勞養，而君為之，明日翼從，願俱歷苦。』",
        "translation": "She deceives him by saying, 'I'm obliged to work hard to support him, but since you're doing it, I'll take you up on your offerings tomorrow, and I hope you'll go through the trouble together.'",
        "source": "T03n0152_004:0018b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『山甚險阻，爾無行也。』",
        "translation": "He said, 'The mountains are very dangerous and obstructed, so you won't be able to go through them.'",
        "source": "T03n0152_004:0018b28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三辭不從，遂便俱行。",
        "translation": "They refused to accept my three requests, so they both went with me.",
        "source": "T03n0152_004:0018b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婦覩山高谷深，排壻落之。",
        "translation": "Seeing the height of the mountain and the depth of the valley, the woman lined up her friends and fell in.",
        "source": "T03n0152_004:0018b29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "水邊有神，神接令安。",
        "translation": "There was a god at the water's edge, and he accepted her and made her feel comfortable.",
        "source": "T03n0152_004:0018c01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婦喜得所，還跛共居。",
        "translation": "She was delighted to find a place, and returned to live with her lame husband.",
        "source": "T03n0152_004:0018c02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「婿尋水行，覩商人焉，本末自陳。",
        "translation": "\"As his son-in-law searched the water, he saw a merchant and told him the truth about himself.",
        "source": "T03n0152_004:0018c02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商人愍之，載至豐國。",
        "translation": "The merchant took pity on him and carried him to the country of Feng.",
        "source": "T03n0152_004:0018c03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其國王崩，又無太子，群臣相讓，適無立者。",
        "translation": "The king of that country had died, and there was no crown prince; the ministers gave way to each other, but there was no one to appoint.",
        "source": "T03n0152_004:0018c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令梵志占，『行路之人有應相者，立之為王。』",
        "translation": "He told the priest to divine, 'Let's make him king if there's someone who responds to the traveling public.'",
        "source": "T03n0152_004:0018c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵志覩菩薩，即曰：『善哉！",
        "translation": "When the priest saw the bodhisattva, he said, 'Good!",
        "source": "T03n0152_004:0018c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯有道之君，可為兆民天仁之覆矣！』",
        "translation": "This is a righteous ruler who can subdue the benevolence of God for the millions of people!'",
        "source": "T03n0152_004:0018c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "群僚黎庶，揮淚歎善，莫不稱壽。",
        "translation": "The multitude of bureaucrats and common people wept and praised his goodness, and none of them praised his long life.",
        "source": "T03n0152_004:0018c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奉載入宮，授以帝位，即以四等養民，眾邪之術，都廢之矣；授以五戒，宣布十善，率土持戒。",
        "translation": "They were then carried into the palace, given the imperial position, which meant nurturing the people in four ways, abolishing all the wrong techniques; they were given the five precepts, declared the ten good qualities, and led the land to observe them.",
        "source": "T03n0152_004:0018c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是天帝祐護其國，鬼妖奔迸，毒氣消歇，穀菓豐熟，隣國化正，仇憾更親，襁負雲集。",
        "translation": "As a result, the gods protected their country, ghosts and demons rushed out, poisonous atmospheres abated, grains and fruits were abundant, neighboring countries were made right, enemies and regrets became more intimate, and swaddlers gathered in droves.",
        "source": "T03n0152_004:0018c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「婦嬰其跛壻，入國乞匃，陳昔將婿避世之難。",
        "translation": "\"The woman invited her lame husband into the country to beg for food, saying how difficult it had been for her son-in-law to escape the world.",
        "source": "T03n0152_004:0018c12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今來歸仁。",
        "translation": "Now, he's come to return to his kindness.",
        "source": "T03n0152_004:0018c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國人巨細莫不雅奇，僉曰：『賢婦可書矣。』",
        "translation": "Everyone in the country, large and small, was impressed, and they all said, 'Good woman, you can write about this.'",
        "source": "T03n0152_004:0018c14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫人曰：『可重賜也。』",
        "translation": "The lady said, 'You can give her a second chance.'",
        "source": "T03n0152_004:0018c15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即見婦，問曰：『識天子不？』",
        "translation": "The king then met the woman and asked her, 'Do you know the son of god?'",
        "source": "T03n0152_004:0018c15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婦怖叩頭。",
        "translation": "The woman was afraid and bowed her head.",
        "source": "T03n0152_004:0018c16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王為宮人本末陳之，執正臣曰：『斯可戮矣。』",
        "translation": "The king presented the palace staff with the facts, and the minister in charge said, 'This is ready to be killed.'",
        "source": "T03n0152_004:0018c16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『諸佛以仁為三界上寶，吾寧殞軀命，不去仁道也。』",
        "translation": "The king said, 'The Buddhas regard kindness as the greatest treasure of the three realms, so I'd rather give my life than abandon the path of kindness.'",
        "source": "T03n0152_004:0018c17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫人使人驅之出國，掃其足迹。」",
        "translation": "The lady had them driven out of the country and swept their tracks.\"",
        "source": "T03n0152_004:0018c18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告鶖鷺子：「王者，吾身是。",
        "translation": "The Buddha told Śāriputra, \"The king, this is my body.",
        "source": "T03n0152_004:0018c19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "跛人者，調達是。",
        "translation": "The lame man, that's an adept.",
        "source": "T03n0152_004:0018c20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婦者，好首是也。",
        "translation": "A woman, that's a good leader.",
        "source": "T03n0152_004:0018c20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩執志度無極行持戒如是。」",
        "translation": "This is how a bodhisattva adheres to the precept of the supreme practice of perfection of will.\"",
        "source": "T03n0152_004:0018c21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（三二）「昔者菩薩，時為凡夫，博學佛經，深解罪福，眾道醫術，禽獸鳴啼，靡不具照。",
        "translation": "(32) \"Once, when he was an ordinary man, the bodhisattva studied the Buddhist scriptures extensively, deeply understood sins and merits, practiced medicine in various paths, and didn't completely understand the laughter of animals and birds.",
        "source": "T03n0152_004:0018c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "覩世憒濁，隱而不仕，尊尚佛戒唯正是從。",
        "translation": "Seeing the turbidity of the world, he withdrew from work and venerated the Buddha's precepts, following them only.",
        "source": "T03n0152_004:0018c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "處貧窮困，為商賃擔。",
        "translation": "He lives in poverty and hardship, and he takes on a burden for the merchant.",
        "source": "T03n0152_004:0018c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過水邊飯，群烏眾噪，商人心懼，森然毛竪，菩薩笑之。",
        "translation": "When he passes by the water's edge for a meal, a crowd of crows raises a clamor, and the merchant's hair stands on end in fear.",
        "source": "T03n0152_004:0018c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "飯已即去，還其本土，雇其賃直曰：『烏鳴爾笑，將有以乎！』",
        "translation": "After he finished his meal, he left and returned to his native land, hiring a hired servant who said, 'A crow crows and laughs, how could it be?'",
        "source": "T03n0152_004:0018c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『烏云：「彼有白珠，其價甚重。",
        "translation": "He answered, 'A crow says, \"They have a white pearl that's worth a lot.",
        "source": "T03n0152_004:0018c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝殺取其珠，吾欲食其肉。」",
        "translation": "You must kill him to get the pearl, for I want to eat his flesh.\"",
        "source": "T03n0152_004:0018c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故笑之耳。』",
        "translation": "That's why he laughed.'",
        "source": "T03n0152_004:0018c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『爾不殺為乎？』",
        "translation": "He said, 'Why don't you kill it?'",
        "source": "T03n0152_004:0019a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『夫不覩佛經者，為滔天之惡，而謂之無殃，斯為自欺矣。",
        "translation": "They replied, \"Someone who doesn't see the sūtras of the Buddha considers it a heinous evil and says it's not harmful, and they're self-deceived.",
        "source": "T03n0152_004:0019a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾覩無上正真之典籍，觀菩薩之清仁，蜎飛蚑行蠕動之類，愛而不殺，草芥非己有即不取。",
        "translation": "I've seen the unsurpassed true scriptures and observed the clear benevolence of the bodhisattvas, how they love flying, crawling, and wriggling creatures and don't kill them, and how they don't take grass and mustard seeds that aren't theirs.",
        "source": "T03n0152_004:0019a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫好殺者不仁，好取者不清，吾前世為好取之穢，今獲其殃，處困陋之貧，為子賃客；今又犯之，種無量之罪，非佛弟子矣。",
        "translation": "In a previous life, I was a filthy person who liked to grasp, and now I've been condemned by that, placed in poverty and hardship, and become a guest of my son; now, if I violate it again, I'll commit measureless sins, and I'm not a disciple of the Buddha.",
        "source": "T03n0152_004:0019a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾寧守道貧賤而死，不為無道富貴而生也。』",
        "translation": "I'd rather abide by the path and die poor than live for the pathless rich and powerful.'",
        "source": "T03n0152_004:0019a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貨主曰：『善哉！",
        "translation": "The merchant said, 'Good!",
        "source": "T03n0152_004:0019a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯佛教真。』",
        "translation": "'Only Buddhism is true.'",
        "source": "T03n0152_004:0019a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩執志度無極行持戒如是。」",
        "translation": "A bodhisattva's pursuit of the aimless practice of upholding the precepts is thus.\"",
        "source": "T03n0152_004:0019a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（三三）「昔者菩薩，處世貧困，為商人賃，入海採利。",
        "translation": "(33) \"Once, a bodhisattva in a poor world was hired by a merchant to go to sea to collect a profit.",
        "source": "T03n0152_004:0019a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "船住不行，商人巨細靡不恐懼，請禱神祇，上下賙拯。",
        "translation": "When the boat didn't work, the merchant was terrified of both the large and small, so he prayed to the gods to save him up and down the river.",
        "source": "T03n0152_004:0019a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貧人唯三自歸，守戒不犯，悔過自責，日夜各三。",
        "translation": "The poor man simply took refuge three times, observed the precepts and didn't violate them, and repented of his faults three times each day and night.",
        "source": "T03n0152_004:0019a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈心誓願：『十方眾生莫有恐怖，如吾今日也；吾後得佛，當度斯類矣。』",
        "translation": "He vowed with a compassionate heart, 'Let no sentient being in the ten directions have fear, as I do today; when I attain Buddhahood later, I will save these kinds of people.'",
        "source": "T03n0152_004:0019a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至七日船不移邁，海神訛與貨主夢曰：『汝棄貧人，吾與汝去。』",
        "translation": "When the boat didn't move for seven days, the sea god falsely told the shipper in a dream, 'Abandon the poor man, and I'll leave with you.'",
        "source": "T03n0152_004:0019a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貨主得夢，愴然悼之，私密言議。",
        "translation": "When the owner of the cargo got the dream, he was saddened by it and talked about it in private.",
        "source": "T03n0152_004:0019a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貧人微察，具照所以，曰：『無以吾一人之體，喪眾命也。』",
        "translation": "The poor man examined it carefully and explained the reason why, saying, 'It's not because of my body alone that I've lost the lives of so many.'",
        "source": "T03n0152_004:0019a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貨主作[竺-二+稗]，給其糇粮，下著[竺-二+稗]上，推[竺-二+稗]遠之。",
        "translation": "The merchant made a [gruel], gave him provisions, put his [gruel] on top of it, and pushed the [gruel] far away from him.",
        "source": "T03n0152_004:0019a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大魚覆船盡吞商人，貧人隨風得岸，還其本土，九族欣懌。",
        "translation": "The great fish overturns the boat and swallows up all the merchants, but the poor man follows the wind to shore and returns it to his native land, and the nine clans rejoice.",
        "source": "T03n0152_004:0019a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貧人以三自歸、五戒、十善，奉齋懺悔、慈向眾生，故得是福。",
        "translation": "This is the fortune a poor man attains because he observes the three refuges, the five precepts, and the ten good qualities, observes purification and repentance, and shows compassion for sentient beings.",
        "source": "T03n0152_004:0019a22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貧人者，我身是也。",
        "translation": "A poor person is I myself.",
        "source": "T03n0152_004:0019a23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩執志度無極行持戒如是。」",
        "translation": "This is how a bodhisattva adheres to the precepts with the aim of achieving the infinite practice.\"",
        "source": "T03n0152_004:0019a24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（三四）「昔者菩薩，守戒隱居，不慕時榮，依蔭四姓為其守墓，若有喪葬，輙展力助。",
        "translation": "(34) \"Once, a bodhisattva observed precepts and lived in seclusion, didn't look for the glory of the times, relied on four families to guard their graves, and even helped out at funerals.",
        "source": "T03n0152_004:0019a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喪主感焉，以寶惠之，所獲多少，輙還四姓。",
        "translation": "The funeral director was so impressed that he gave them a gift of treasure, and they often returned as much as they had obtained to the four families.",
        "source": "T03n0152_004:0019a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四姓曰：『子展力致此寶，胡為相還？』",
        "translation": "The four families said, 'Why did you return this treasure with your efforts?'",
        "source": "T03n0152_004:0019a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道士曰：『吾守君野，彼葬君地，大義論之，寶即君有也。』",
        "translation": "The Daoist monk said, 'I'll guard your field, and he'll bury you there; in the grand theory, the treasure is yours.'",
        "source": "T03n0152_004:0019a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四姓歎曰：『善哉！",
        "translation": "The four families praised him, saying, 'Good!",
        "source": "T03n0152_004:0019b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "古之賢者豈能踰子乎？』",
        "translation": "How could a good man of old surpass Zizi?'",
        "source": "T03n0152_004:0019b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即擇青衣中有賢行兼華色者，給之為妻，分家財以成其居。",
        "translation": "He then chose one of the green men with good conduct and flashy features, gave him a wife, and divided the family's wealth to make his home.",
        "source": "T03n0152_004:0019b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道士曰：『進其行，高其德。』",
        "translation": "The Daoist priest said, 'Advance his conduct and elevate his virtue.'",
        "source": "T03n0152_004:0019b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，貧道士者，吾身是也。",
        "translation": "At the time, that poor man of the Way was myself.",
        "source": "T03n0152_004:0019b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妻者，裘夷是。",
        "translation": "His wife is Kauṇḍinya.",
        "source": "T03n0152_004:0019b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩執志度無極行持戒如是。」",
        "translation": "This is how a bodhisattva adheres to the precept of the supreme practice of perfection of will.\"",
        "source": "T03n0152_004:0019b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（三五）「昔者菩薩，身為凡人，歸命三尊，守戒不虧。",
        "translation": "(35) \"Once, a bodhisattva, being a mere mortal, took refuge in the three honored ones and observed the precepts without loss.",
        "source": "T03n0152_004:0019b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與舅俱行，衒賣自濟，之彼異國。",
        "translation": "He traveled with his uncle, selling himself out to a foreign country.",
        "source": "T03n0152_004:0019b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舅先渡水，止獨母家，家有幼女，女啟母曰：『後有澡盤，可從商人易白珠也。』",
        "translation": "When he first crossed the river and stopped at his mother's house alone, she asked her mother, 'There's a bathing dish at the end, so you can buy white pearls from a merchant.'",
        "source": "T03n0152_004:0019b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母順女意以示商人，以刀刮視照其真寶，佯投地曰：『污吾手矣。』",
        "translation": "The mother complied with the daughter's request and showed the merchant a knife to scrape and examine the real treasure, pretending to throw it to the ground and saying, 'It's defiled my hand.'",
        "source": "T03n0152_004:0019b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即出進路，母子耻焉。",
        "translation": "She then went out and entered the road, much to the shame of the mother and child.",
        "source": "T03n0152_004:0019b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子後至，女重請珠，母曰：『前事之恥，可為今戒也。』",
        "translation": "When the boy arrived later, the woman repeatedly asked for the pearl, and the mother said, 'This shame of the past should serve as a precept for the present.'",
        "source": "T03n0152_004:0019b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女曰：『觀此童儒，有仁人之相，非前貪殘矣。』",
        "translation": "The woman said, 'This boy has the appearance of a good person, not someone who was previously greedy and cruel.'",
        "source": "T03n0152_004:0019b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又以示之。",
        "translation": "She also showed him.",
        "source": "T03n0152_004:0019b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童儒曰：『斯紫磨金也，盡吾貨易之可乎？』",
        "translation": "The boy said, 'This is purple polish gold. Would it be possible to trade all my goods for it?'",
        "source": "T03n0152_004:0019b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母曰：『諾。』",
        "translation": "His mother said, 'No.'",
        "source": "T03n0152_004:0019b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子曰：『匂吾金錢二枚，以雇渡耶？』",
        "translation": "The boy said, 'Would you hire two pieces of my money to ferry you across?'",
        "source": "T03n0152_004:0019b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舅尋還曰：『今以少珠惠汝，取屬盤來。』",
        "translation": "My uncle looked for him and returned him, saying, 'Now, I'll give you a small amount of pearls to take a metal tray.'",
        "source": "T03n0152_004:0019b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母曰：『有良童子，盡以名珠雇吾金盤，猶謝其賤矣。",
        "translation": "His mother said, 'A good boy would hire my gold tray with all the famous pearls, but I'm still thankful it's so cheap.",
        "source": "T03n0152_004:0019b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾不急去，且加爾杖。』",
        "translation": "Don't be in a hurry to leave, but I'll give you a stick.'",
        "source": "T03n0152_004:0019b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舅至水邊，蹋地呼曰：『還吾寶來。』",
        "translation": "When he reached the water's edge, he fell to the ground and called out, 'Give me back my treasure!'",
        "source": "T03n0152_004:0019b19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "性急椎胸，吐血而死。",
        "translation": "He was so impatient that he struck his chest, spat out blood, and died.",
        "source": "T03n0152_004:0019b20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甥還其金，已覩殞矣，哽噎曰：『貪乃至於喪身乎！』",
        "translation": "When his nephew returned his gold, he was already looking at his death and choked up, saying, 'I've been so greedy that I've lost my life!'",
        "source": "T03n0152_004:0019b20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩守信以獲寶，調達貪欺以喪身。",
        "translation": "A bodhisattva keeps his faith to obtain treasure, and he tames greed and deceit to lose his body.",
        "source": "T03n0152_004:0019b21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子者，吾身也。",
        "translation": "\"The boy is my body.",
        "source": "T03n0152_004:0019b22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舅者，調達是。",
        "translation": "The uncle is the one who tries to get ahead.",
        "source": "T03n0152_004:0019b23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩執志度無極行持戒如是。」",
        "translation": "This is how a bodhisattva adheres to the precept of the infinite practice of perfection of will.\"",
        "source": "T03n0152_004:0019b23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（三六）「昔者菩薩，無數劫時，兄弟資貨求利養親。",
        "translation": "(36) \"In the past, for countless eons, a bodhisattva was a brother who stocked goods and sought to support his relatives.",
        "source": "T03n0152_004:0019b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "之于異國，令弟以珠現其國王。",
        "translation": "He went to a foreign country and had his younger brother present the king of that country with a pearl.",
        "source": "T03n0152_004:0019b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王覩弟顏華，欣然可之，以女許焉，求珠千萬。",
        "translation": "Seeing his brother's beautiful face, the king was delighted to accept him and gave him his daughter, asking for ten million pearls.",
        "source": "T03n0152_004:0019b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟還告兄，兄追之王所，王又覩兄容貌堂堂，言輙聖典，雅相難齊。",
        "translation": "When the younger brother returned to his brother and he followed him to the king's office, the king also saw his brother's good looks and his words about the noble ways of maneuvering and how his elegance was difficult to match.",
        "source": "T03n0152_004:0019b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王重嘉焉，轉女許之。",
        "translation": "The king was highly impressed and turned to the woman to give her his approval.",
        "source": "T03n0152_004:0019b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女情泆豫，兄心存曰：『壻伯即父，叔妻即子，斯有父子之親，豈有嫁娶之道乎？",
        "translation": "The woman's feelings were indolent, but the brother's mind remained, saying, 'Suppose an uncle is his father and an uncle's wife is his son; then there's the intimacy of father and son, isn't there a way to marry?'",
        "source": "T03n0152_004:0019b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯王處人君之尊，而為禽獸之行。』",
        "translation": "The king then was revered as a human ruler and behaved like an animal.'",
        "source": "T03n0152_004:0019c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即引弟退。",
        "translation": "He then led his younger brother to retreat.",
        "source": "T03n0152_004:0019c03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女登臺望曰：『吾為[(魅-未+舌)-ㄙ]蠱，食兄肝可乎？』",
        "translation": "She climbed onto the platform and looked at him, saying, 'Would it be okay if I were to [devour my brother's liver with a [phantom - not yet + tongue - tongue] tonsure?'",
        "source": "T03n0152_004:0019c03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "展轉生死，兄為獼猴，女與弟俱為鼈。",
        "translation": "After many lifetimes, his brother becomes a monkey, and his daughter and brother both become a turtle.",
        "source": "T03n0152_004:0019c04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼈妻有疾，思食獼猴肝，雄行求焉。",
        "translation": "When his wife had a disease, she wanted to eat the monkey's liver, so she went out to seek it out.",
        "source": "T03n0152_004:0019c05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "覩獼猴下飲，鼈曰：『爾甞覩樂乎？』",
        "translation": "When he sees the monkey drinking from his bottom, the turtle says, 'Did you see what happiness there was?'",
        "source": "T03n0152_004:0019c06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『未也。』",
        "translation": "They replied, 'No.'",
        "source": "T03n0152_004:0019c07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『吾舍有妙樂，爾欲觀乎？』",
        "translation": "He said, 'Do you want to see the marvelous joy in my house?'",
        "source": "T03n0152_004:0019c07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『然。』",
        "translation": "He said, 'Yes.'",
        "source": "T03n0152_004:0019c08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼈曰：『爾昇吾背，將爾觀矣。』",
        "translation": "The turtle said, 'Lift up my back, and I will watch you.'",
        "source": "T03n0152_004:0019c08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昇背隨焉。",
        "translation": "He rose his back and followed him.",
        "source": "T03n0152_004:0019c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "半谿，鼈曰：『吾妻思食爾肝。",
        "translation": "Halfway across the squabble, the turtle said, 'My wife wants to eat your liver.",
        "source": "T03n0152_004:0019c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "水中何樂之有乎？』",
        "translation": "What pleasure is there in the water?'",
        "source": "T03n0152_004:0019c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獼猴心恧然曰：『夫戒守善之常也，權濟難之大矣。』",
        "translation": "The monkey's heart was agitated as he said, 'It's always good to observe precepts, but it's a great right to rescue someone who's having trouble.'",
        "source": "T03n0152_004:0019c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『爾不早云？",
        "translation": "He said, 'Didn't you say so earlier?'",
        "source": "T03n0152_004:0019c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾以肝懸彼樹上。』",
        "translation": "I'll hang my liver from that tree.'",
        "source": "T03n0152_004:0019c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼈信而還。",
        "translation": "The turtle believed it and returned.",
        "source": "T03n0152_004:0019c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獼猴上岸曰：『死鼈蟲，豈有腹中肝而當懸樹者乎？』」",
        "translation": "The monkey then went ashore and said, 'Would a dead turtle or insect have a liver in its belly that could be hanging from a tree?'\"",
        "source": "T03n0152_004:0019c12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「兄者，即吾身是也，常執貞淨，終不犯淫亂，畢宿餘殃墮獼猴中。",
        "translation": "The Buddha told the monks, \"Brother, this is my body, which always remains chaste and never commits sexual misconduct; after finishing my last night, I'll fall into the monkeys for the rest of my life.",
        "source": "T03n0152_004:0019c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟及王女俱受鼈身，雄者調達是，雌者調達妻是。",
        "translation": "My younger brother and the king's daughter are both under the influence of a turtle body, which is the male Tathāgata and the female Tathāgata's wife.",
        "source": "T03n0152_004:0019c15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩執志度無極行持戒如是。」",
        "translation": "This is how a bodhisattva adheres to the precept of the infinite practice of willful liberty.\"",
        "source": "T03n0152_004:0019c16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（三七）「昔者菩薩，乘船渡海，採寶濟乏。",
        "translation": "(37) \"Once, a bodhisattva crossed the ocean in a boat to gather treasure to help with the lack of it.",
        "source": "T03n0152_004:0019c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "海邊有城，苑園備有，華女臨渚要其輩曰：『斯國豐沃，珍寶恣求，可屈入城，觀民有無。』",
        "translation": "There was a city at the edge of the ocean with a park and garden, and the flower girl approached the island and asked the group, 'This country is rich and fertile, and its treasures are freely sought; perhaps you could bend over and enter the city to examine the people's possessions.'",
        "source": "T03n0152_004:0019c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商人信從鬼魅厭惑，遂留與居，積年有五。",
        "translation": "The merchants believed and obeyed the ghosts and were disillusioned, so they stayed and lived there for five years.",
        "source": "T03n0152_004:0019c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩感思二親本土，出城登山四顧遠望，覩一鐵城中有丈夫，首戴天冠儼然恭坐，謂菩薩曰：『爾等惑乎？",
        "translation": "Feeling for the two relatives' homeland, the bodhisattva left the city and climbed up on a hill, looked around, and saw a man in an iron city, wearing a celestial crown on his head and sitting respectfully, and said to the bodhisattva, 'Are you confused?'",
        "source": "T03n0152_004:0019c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以鬼魅為妻，捐爾二親九族之厚，為鬼所吞豈不惑哉？",
        "translation": "Wouldn't it be confusing to take a demon as your wife and sacrifice the strength of your two relatives and nine clans to be devoured by a demon?",
        "source": "T03n0152_004:0019c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾等無寐，察其真贋矣。",
        "translation": "All of you are still awake, so examine their true worth.",
        "source": "T03n0152_004:0019c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "方有神馬翔茲濟眾，可附旋居全爾身命。",
        "translation": "Then, a divine horse will fly here to help the people, and it can be attached to your retreat to save your lives.",
        "source": "T03n0152_004:0019c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若戀蠱妻。",
        "translation": "If you were to fall in love with a tricky wife.",
        "source": "T03n0152_004:0019c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "死入斯城，眾毒普加，悔將無救。』",
        "translation": "If you die and enter this city, numerous poisons will universally affect you, and there will be no help for you in regretting it.'",
        "source": "T03n0152_004:0019c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩承命，訛寐察之，覩真如云，厥心懼焉。",
        "translation": "The bodhisattva accepted the order, examined it in his sleep, saw the cloud of reality, and became frightened.",
        "source": "T03n0152_004:0019c28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明日密相告，等人僉然，各伺覩妻變為狐體，競爭食人。",
        "translation": "On the morrow, they told each other confidentially, and they all agreed to see their wives transformed into foxes and compete to eat people.",
        "source": "T03n0152_004:0019c29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "靡不憮然，曰：『吾等死矣。』",
        "translation": "They all looked at each other and said, 'We're going to die.'",
        "source": "T03n0152_004:0020a01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "相驚備豫懈即喪矣。",
        "translation": "They were all terrified, prepared, and lazy, and then they were killed.",
        "source": "T03n0152_004:0020a02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "馬王臻曰：『孰有離居心懷所親，疾來赴茲，吾將濟爾。』",
        "translation": "King Māra then gave them a reply, 'Whoever leaves home and harbors a relative in their heart comes here quickly, and I will rescue them?'",
        "source": "T03n0152_004:0020a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商人喜曰：『斯必天也。』",
        "translation": "The merchants rejoiced, saying, 'This must be the gods.'",
        "source": "T03n0152_004:0020a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "群馳歸命。",
        "translation": "They all rushed to his aid.",
        "source": "T03n0152_004:0020a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妻即抱子尋跡哀慟，其辭曰：『怨呼皇天，為妻累載，今以為鬼。』",
        "translation": "The wife then embraced her son and searched for him, saying, 'Sir, I'm sorry, Your Majesty, I've been your wife for years, but now I've become a ghost.'",
        "source": "T03n0152_004:0020a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "哀聲傷情。",
        "translation": "Her voice was sad.",
        "source": "T03n0152_004:0020a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "辭詣王所，厥云如上，『今者偟偟，無由自恃，惟願大王哀理妾情。』",
        "translation": "She rushed to the king's office and spoke as above, 'Now I'm agitated and have no way to support myself, so I hope the king will take pity on my concubine.'",
        "source": "T03n0152_004:0020a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王召菩薩問其所由，即以所覩本末陳之。",
        "translation": "The king summoned the bodhisattva and asked him about the reason, and he told him the story of what he'd seen.",
        "source": "T03n0152_004:0020a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王覩色美疾遣婿去，內之後宮為其淫荒，國正紛亂。",
        "translation": "When the king saw the beauty of her form, he quickly sent his son-in-law away, and his inner palace became so desolate that the country was in turmoil.",
        "source": "T03n0152_004:0020a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬼化為狐，日行食人，為害茲甚，王不覺矣。",
        "translation": "The demons transformed into foxes, which eat people every day and do great harm, but the king didn't realize it.",
        "source": "T03n0152_004:0020a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「後各命終，生死輪轉，菩薩積德，遂得為佛。",
        "translation": "\"After their respective lives ended, the cycle of birth-and-death began, and the bodhisattva accumulated virtue and became a buddha.",
        "source": "T03n0152_004:0020a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "狐鬼魂靈，化生梵志家，有絕妙之色。",
        "translation": "The spirits of foxes and ghosts are born in the homes of priests and have wonderful appearances.",
        "source": "T03n0152_004:0020a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛時於作法縣求食，食畢出城坐樹下。",
        "translation": "When the Buddha was seeking food in Zaofa county, he left the city after eating and sat under a tree.",
        "source": "T03n0152_004:0020a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵志覩佛相好，容色紫金，項有日光，若星中月。",
        "translation": "The priest saw the Buddha's features, which were purple and gold in appearance, and the sun shining from his neck like the moon among the stars.",
        "source": "T03n0152_004:0020a14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "覩佛若此，其喜無量，歸白兒母：『吾女獲婿，其為世雄。",
        "translation": "Seeing the Buddha like this, he was overjoyed beyond measure and returned to his children's mother, saying, 'My daughter has found a son-in-law who will be a hero in the world.",
        "source": "T03n0152_004:0020a15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "疾以名服、具世諸好。』",
        "translation": "He quickly gave her a famous robe, complete with worldly comforts.'",
        "source": "T03n0152_004:0020a16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵志家室携女貢之，道覩足跡。",
        "translation": "The priest's family brought their daughter to pay homage to him, and they saw his footprints on the road.",
        "source": "T03n0152_004:0020a17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妻曰：『斯無欲之神雄，豈以淫邪亂其志乎？』",
        "translation": "His wife said, 'Is this a godlike hero without desire who would let lust and vice distract him from his intention?'",
        "source": "T03n0152_004:0020a18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父曰：『吾女國之上華，胡高德而不迴耶？』",
        "translation": "His father said, 'My daughter is the most brilliant country in the world; why doesn't she turn back?'",
        "source": "T03n0152_004:0020a19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妻即頌其義曰：「『婬者曳足行，　　多恚斂指步，　　愚者足築地，　　斯跡天人尊。",
        "translation": "Her wife then spoke a verse about its meaning, saying, \"A promiscuous person walks with trailing feet, a lot of anger constricts their fingers, and a foolish person's feet build the ground, which is a sign of respect from gods and humans.",
        "source": "T03n0152_004:0020a20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『無自辱也。』",
        "translation": "\" 'There's no self-humiliation.'",
        "source": "T03n0152_004:0020a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父曰：『爾薄智也。』",
        "translation": "Her father said, 'You're weak in wisdom.'",
        "source": "T03n0152_004:0020a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戾而行矣，以女獻焉。",
        "translation": "He went against him and offered his daughter up.",
        "source": "T03n0152_004:0020a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告曰：『第六魔天，獻吾三女，變為[穴/老]鬼。",
        "translation": "The Bhagavān told him, 'The sixth Māra god offered up three of my daughters and turned them into [cave/old] ghosts.",
        "source": "T03n0152_004:0020a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今爾屎囊，又來何為？』",
        "translation": "Now, what's in your shitty bag?'",
        "source": "T03n0152_004:0020a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵志恧然，妻重恥之。",
        "translation": "The priest was embarrassed, and his wife was very ashamed of him.",
        "source": "T03n0152_004:0020a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有除饉，進稽首曰：『願以惠余。』",
        "translation": "Then, a man who was free from disease salvation advanced and bowed his head, saying, 'May I help you?'",
        "source": "T03n0152_004:0020a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊戒曰：『爾昔為王，女時為鬼，以色誑爾，吞盡爾民，爾不厭乎？』",
        "translation": "The Bhagavān instructed them, 'When you were a king, a woman became a ghost, and she used her form to deceive you and devour all your people.",
        "source": "T03n0152_004:0020a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除饉恥焉，退禪獲定，得溝港道。」",
        "translation": "He rids himself of shame, retires from meditation, acquires concentration, and attains the guttering and harboring path.\"",
        "source": "T03n0152_004:0020a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告鶖鷺子：「菩薩自受城中人戒已，旋家，歸命三尊自誓辭云：『時當死，死不復犯如來、應儀、正真覺清淨重戒。』",
        "translation": "The Buddha told Śāriputra, \"After accepting the precepts for people in the city, the bodhisattva left home, reverted to the three honored ones, and vowed, 'When I die, I won't again violate the pure and grave precepts of the Tathāgata,應儀, and 正真覺.'",
        "source": "T03n0152_004:0020a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "積戒弘多，佛道遂成。",
        "translation": "Accumulating a great number of precepts, he then accomplished the Buddha Way.",
        "source": "T03n0152_004:0020b02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時長者，吾身是也。",
        "translation": "At the time, the elder was myself.",
        "source": "T03n0152_004:0020b03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王者，今比丘是。",
        "translation": "The king is the present monk.",
        "source": "T03n0152_004:0020b03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬼者，梵志女是。",
        "translation": "The ghost is the priestess.",
        "source": "T03n0152_004:0020b04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城中天人者，鶖鷺子是。",
        "translation": "The gods in the city are the Śāriputra.",
        "source": "T03n0152_004:0020b04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩執志度無極行持戒如是。」",
        "translation": "This is how a bodhisattva adheres to the aim to save lives by performing the infinite number of actions and upholding the precepts.\"",
        "source": "T03n0152_004:0020b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（三八）太子墓魄經",
        "translation": "(38) Sutra on the Crown Prince's Grave",
        "source": "T03n0152_004:0020b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時佛在聞物國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was present at Anāthapiṇḍada Park in Jeta Grove in the Land of Hearing Things.",
        "source": "T03n0152_004:0020b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時佛告諸沙門：「往昔有國名波羅奈，王有太子，名曰墓魄，生有無窮之明，過去現在未來眾事，其智無礙，端正暉光，猶星中月。",
        "translation": "The Buddha then addressed the ascetics, \"Once upon a time, there was a country named Polonai, and the king had a prince named Tombstone who was born with infinite wisdom, whose knowledge of all past and present and future affairs was unimpeded and whose radiance was so correct that he was like the moon among the stars.",
        "source": "T03n0152_004:0020b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王唯有一子，國無不愛，而年十三，閉口不言，有若瘖人。",
        "translation": "The king had only one son, whom the country didn't dislike, but he was 13 years old, shut up, and didn't speak, like a dumb person.",
        "source": "T03n0152_004:0020b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王后憂焉，呼諸梵志，問其所由。",
        "translation": "The queen was concerned, so she summoned a priest and asked him what the cause was.",
        "source": "T03n0152_004:0020b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『斯為不祥也，端正不言，何益大王？",
        "translation": "She replied, 'This is inauspicious; what good will it do the king if he's correct and doesn't speak?'",
        "source": "T03n0152_004:0020b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後宮無嗣，豈非彼害哉？",
        "translation": "Wouldn't it be a disservice to have no heir in the rear court?",
        "source": "T03n0152_004:0020b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法宜生埋之，必有貴嗣。』",
        "translation": "It's advisable to bury him alive, for he will surely have a valuable heir.'",
        "source": "T03n0152_004:0020b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即恧然，入與后議，后逮宮人靡不哀慟，嗟曰：『奈何太子祿薄，生獲斯殃。』",
        "translation": "The king was shocked and went in to discuss the matter with the queen, who arrested all the palace officials and made them mourn, saying, 'Why was the prince so poorly paid that he was born into this misfortune?'",
        "source": "T03n0152_004:0020b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "哀者塞路，猶有大喪。",
        "translation": "The road was blocked by mourners, and there was still a great funeral.",
        "source": "T03n0152_004:0020b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具著寶服，以付喪夫。",
        "translation": "They put on their precious robes and handed them to the mourner.",
        "source": "T03n0152_004:0020b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喪夫奪其名服，覩共為塚。",
        "translation": "The mourners took their names and robes and gathered them together to make a grave.",
        "source": "T03n0152_004:0020b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "墓魄惟曰：『王逮國人，信吾真瘖。』",
        "translation": "The grave spirit simply said, 'The king has caught the people of his country believing that I'm truly mute.'",
        "source": "T03n0152_004:0020b18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即默斂衣入水淨浴，以香塗身，具著寶服，臨壙呼曰：『爾等胡為？』",
        "translation": "He gathered his robe in water, purified his bath, smeared himself with incense, put on his precious robes, and called out to them as they approached the coffin, 'What are you doing?'",
        "source": "T03n0152_004:0020b19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『太子瘖聾為國無嗣，王命生埋，冀生賢嗣。』",
        "translation": "He answered, 'The prince was deaf and had no heir to the king's kingdom, so the king ordered him to be buried, hoping to produce a worthy heir.'",
        "source": "T03n0152_004:0020b21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『吾即墓魄矣。』",
        "translation": "He said, 'I'm going to be buried.'",
        "source": "T03n0152_004:0020b22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喪夫視車霍然空虛，觀其形容，曜曜有光，草野遐邇猶日之明，聖靈巨勢，神動靈祇。",
        "translation": "The mourner looked at the chariot, saw how empty it was, and observed its features, which were brilliant and shone like the brightness of the sun in the wilderness, with the great power of the holy spirit and the spirits of the spirits that moved them.",
        "source": "T03n0152_004:0020b22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喪夫巨細靡不懾驚，兩兩相視，顏貌黃青，言成文章靡不畏焉？",
        "translation": "Wouldn't the mourner be frightened by anything large or small, and wouldn't he be afraid to look at them both, their faces yellow and blue, and their words accomplished?",
        "source": "T03n0152_004:0020b24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仰天而曰：『太子靈德乃之于斯！』",
        "translation": "He looked up to heaven and said, 'So much for the prince's spiritual virtue!'",
        "source": "T03n0152_004:0020b26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即叩頭陳曰：『願旋寧王，令眾不嗟。』",
        "translation": "He bowed his head and said, 'May I turn King Ning around so that the people won't be discontented.'",
        "source": "T03n0152_004:0020b27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子曰：『爾疾啟王，云吾能言。』",
        "translation": "The prince said, 'Rashly inspire the king, saying, 'I can speak.'",
        "source": "T03n0152_004:0020b27_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人即馳聞，王后兆民甚怪所以，心懽稱善，靡不悅豫，車馳人犇，殷填塞路。",
        "translation": "The people then rushed to hear about it, and the king's queen and his people were so surprised that their hearts were filled with joy and praise for their goodness that they charioted up and down the road.",
        "source": "T03n0152_004:0020b28_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "墓魄曰：『吾獲為沙門虛靖之行，不亦善乎？』",
        "translation": "The tomb-keeper said, 'Wouldn't it be good if I were to practice as an ascetic Ākṣobhya?'",
        "source": "T03n0152_004:0020c01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意始如之。",
        "translation": "That's how he began to think.",
        "source": "T03n0152_004:0020c02_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「帝釋即化為苑池樹木，非世所覩，即去眾寶衣化為袈裟。",
        "translation": "\"Tissa then transformed into a garden or pond tree that was not visible to the world, and he removed his many precious robes and transformed them into a reddish-brown robe.",
        "source": "T03n0152_004:0020c02_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王到已，太子五體投地，稽首如禮，王即就坐聞其言聲，光影威靈，二儀為動，王喜喻曰：『吾有爾來，舉國敬愛，當嗣天位，為民父母。』",
        "translation": "When the king arrived, the prince threw himself to the ground with five bodies, paid homage by prostrating himself, and the king sat down and heard his voice, his appearance was dignified, and his two manners moved. The king rejoiced and said, 'I have come to be loved by the whole country, and I will inherit the position of god and be the father and mother of the people.'",
        "source": "T03n0152_004:0020c04_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『惟願大王！",
        "translation": "He said to them, 'May it be, Your Majesty!'",
        "source": "T03n0152_004:0020c07_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "哀採微言。",
        "translation": "\"I take pity on you, Mr. Sumeru, for your humble words.",
        "source": "T03n0152_004:0020c07_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾昔甞為斯國王，名曰須念，處國臨民二十五年，身奉十善育民以慈，鞭杖眾兵都息不行，囹圄無繫囚，路無怨嗟聲，惠施流布，潤無不周。",
        "translation": "In the past, I was the king of that country named Suni. For 25 years, I've served the country and the people, consecrating myself to the ten good qualities and nurturing them with kindness, whipping and whipping the troops into submission, imprisoning no prisoners, making no complaints on the roads, and spreading charity in ways that didn't go unanswered.",
        "source": "T03n0152_004:0020c07_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但以出遊翼從甚眾，導臣馳除，黎庶惶懼；終入太山燒煮割裂，積六萬年，求死不得，呼嗟無救。",
        "translation": "But because he traveled around with so many followers, he led ministers to chase away the fear of the common people; he ended up in Taishan, where he was burned, boiled, and cut up for 60,000 years, begging for death but unable to get it, and crying out for help.",
        "source": "T03n0152_004:0020c11_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當爾之時，內有九親，表有臣民，資財億載，眾樂無極，寧知吾入太山地獄燒煮眾痛無極之苦乎？",
        "translation": "At the time, there were nine relatives on the inside, subjects on the outside, billions of possessions, and boundless happiness, but how could they have known the pain and suffering I experienced when I was burned and boiled in the hell of Mount Tai?",
        "source": "T03n0152_004:0020c13_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生存之榮，妻子臣民，孰能分取諸苦去乎？",
        "translation": "Who can take the prosperity of life, wives, and subjects, and leave them to suffer?",
        "source": "T03n0152_004:0020c15_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惟彼諸毒其為無量，每壹憶之心怛骨楚，身為虛汗，毛為寒竪。",
        "translation": "\"But those poisons are so immeasurable that every time I remember them, my heart aches, my bones ache, and my body breaks into a sweat, and my hair stands on end in a chill.",
        "source": "T03n0152_004:0020c16_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言往禍來，殃追影尋，雖欲發言懼復獲咎，太山之苦難可再更，是以縮舌都欲無言。",
        "translation": "Though I want to speak, I'm afraid I'll be blamed; it's hard to change the suffering of Taishan, so I shrink my tongue and want to remain speechless.",
        "source": "T03n0152_004:0020c18_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "始十三年，而妖導師令王生埋吾。",
        "translation": "For the first thirteen years, the demon guide caused the king to give birth to me.",
        "source": "T03n0152_004:0020c20_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "懼大王獲太山之咎，勢復一言耳。",
        "translation": "Fearing that the king would be blamed for Mount Tai, he was about to say one more thing.",
        "source": "T03n0152_004:0020c21_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今欲為沙門守無欲之行，覩眾禍之門不復為王矣。",
        "translation": "Now, I want to be an ascetic who observes the practice of desirelessness and sees that the gate to many calamities is no longer the king's. May it not be surprising.'",
        "source": "T03n0152_004:0020c22_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願無怪焉。』",
        "translation": "Please don't blame me.'",
        "source": "T03n0152_004:0020c23_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『爾為令君，行高德尊，率民以道，過猶絲髮，非人所憶，以之獲罪，酷裂乃如之耶！",
        "translation": "The king said, 'You're a ruler whose conduct is noble and whose virtue is honored, who leads the people to follow the way and whose faults are like the hairs of a man's hair, which are not what people remember, and for which you've been condemned, how could you be so cruel as to split them?'",
        "source": "T03n0152_004:0020c23_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如吾今為人主，從心所欲，不奉正法，終當何之乎？』",
        "translation": "Now, if I were a lord of men and followed my heart's desire but didn't obey the right teaching, what would I do in the end?'",
        "source": "T03n0152_004:0020c25_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即聽學道。",
        "translation": "He then listened to him as he trained on the path.",
        "source": "T03n0152_004:0020c27_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王還治國以正不邪，遂致豐樂。",
        "translation": "The king returned to rule the country correctly and without error, which led to abundance and happiness.",
        "source": "T03n0152_004:0020c27_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "墓魄即自練情絕欲，志進道真遂至得佛，廣說景模，拯濟眾生以至滅度。」",
        "translation": "The grave spirit then trained himself to cut off emotion and desire, set his mind on the true path, and attained Buddhahood, taught extensively about the Nestorian model, and saved sentient beings until they were liberated.\"",
        "source": "T03n0152_004:0020c28_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「時墓魄者，吾身是也。",
        "translation": "The Buddha told the monks, \"The grave spirit at the time was my body.",
        "source": "T03n0152_004:0021a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父王者，今白淨王是也。",
        "translation": "My father, the king, is the present-day King Baekjeong.",
        "source": "T03n0152_004:0021a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母者，吾母今舍妙是也。",
        "translation": "The mother is my mother, the present Śākyamuni.",
        "source": "T03n0152_004:0021a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫榮色邪樂者，燒身之鑪矣。",
        "translation": "Someone who takes pleasure in form and looks and has wrong intentions will burn the coffin of his body.",
        "source": "T03n0152_004:0021a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "清淨澹泊，無患之家矣。",
        "translation": "Being pure and collected, it's a trouble-free home.",
        "source": "T03n0152_004:0021a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲免難離罪者，無失佛教也。",
        "translation": "If someone wants to avoid hardship and escape sins, they won't lose sight of Buddhism.",
        "source": "T03n0152_004:0021a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為道雖苦，猶勝處夫三塗，為人即遠貧窶，不處八難矣。",
        "translation": "Although the path is painful, it's still better than dealing with the three destinies, which means that a person is free from poverty and the eight difficulties.",
        "source": "T03n0152_004:0021a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "學道之志當如佛行也，欲獲緣一覺、應真、滅度者，取之可得。」",
        "translation": "Students of the path should aspire to follow the Buddha's example, and those who want to attain the conditions of unity of awakening, response to truth, and cessation will be able to attain them.\"",
        "source": "T03n0152_004:0021a06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說經竟，諸沙門莫不歡喜，稽首作禮。",
        "translation": "When the Buddha finished speaking the sūtra, the ascetics rejoiced and bowed their heads in prostration.",
        "source": "T03n0152_004:0021a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（三九）彌蘭經",
        "translation": "(39) Miliṇḍa-sūtra",
        "source": "T03n0152_004:0021a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T03n0152_004:0021a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸沙門閑居深惟：「世人習邪樂欲，自始至終無厭五樂者。",
        "translation": "Those ascetics living in seclusion then profoundly thought, \"People cultivate wrong desires and never tire of the five pleasures from the beginning to the end.",
        "source": "T03n0152_004:0021a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂五樂？",
        "translation": "What are the five pleasures?",
        "source": "T03n0152_004:0021a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼色、耳聲、鼻香、口味、身細滑。",
        "translation": "The eyes have form, the ears have sound, the nose has fragrance, the taste has flavor, and the body is fine and smooth.",
        "source": "T03n0152_004:0021a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫斯五欲，至其命終，豈有厭者乎？」",
        "translation": "Would there be anyone who would tire of these five desires until the end of his life?\"",
        "source": "T03n0152_004:0021a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "日中之後，俱詣佛所，稽首佛足退立白言：「吾等，世尊！",
        "translation": "After midday, they all went to the Buddha, bowed their heads at his feet, withdrew, and said, \"We, Bhagavān!",
        "source": "T03n0152_004:0021a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惟世愚者惑于五欲，至厥命終，豈有厭者不？」",
        "translation": "Only the foolish of the world are so deluded by the five desires that they reach the end of their lives, aren't they tired of them?\"",
        "source": "T03n0152_004:0021a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告之曰：「覩世無足於彼五樂矣。",
        "translation": "The Buddha told them, \"It's just that the world doesn't have enough of those five pleasures.",
        "source": "T03n0152_004:0021a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔有五百商人入海採利，中有智者名曰彌蘭，為眾師御。",
        "translation": "Once, there were five hundred merchants who went into the ocean to gather profit, and there was a wise man named Miliṇḍa who was the mentor of the group.",
        "source": "T03n0152_004:0021a17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "海有神魚，其名摩竭，觸敗其船，眾皆喪身，彌蘭騎板，僅而獲免。",
        "translation": "A miraculous fish named Maghā touched his boat and killed everyone, but Miliṇḍa rode on a board and was spared.",
        "source": "T03n0152_004:0021a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "風漂附岸，地名鼻摩，登岸周旋庶自蘇息，覩一小徑尋之而進。",
        "translation": "The wind drifted off the shore, and the place was called Vimalakīrti. When he reached the shore, he circled around and got himself calmed down, and he saw a shortcut and looked for it.",
        "source": "T03n0152_004:0021a20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遙見銀城，樹木茂盛，間有浴池，周旋四表，甘水遶之。",
        "translation": "From a distance, I saw a silver city with exuberant trees and a bathing pond surrounded by sweet water on all sides.",
        "source": "T03n0152_004:0021a22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有四美人，容齊天女，奉迎之曰：『經涉巨海，厥勞多矣，善賀吉臻。",
        "translation": "There were four beautiful women, all looking like goddesses, who greeted him, saying, 'I've had a lot of trouble wading through this huge ocean, so congratulations are in order.",
        "source": "T03n0152_004:0021a23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今斯銀城，其中眾寶，黃金白銀，水精琉璃，珊瑚虎珀，車璩為殿，妾等四女給仁使役，晚息夙興，惟命所之，願無他遊。』",
        "translation": "Now, there's this silver city with all its treasures, gold and silver, aqua lapis lazuli, coral and tiger beryl, and a chariot-turned-hall.",
        "source": "T03n0152_004:0021a24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌蘭入城昇七寶殿，懽娛從欲，願無不有，處中千餘年。",
        "translation": "Miliṇḍa entered the city and ascended to the hall of seven treasures, entertained herself and followed her desires, wishing for nothing, and stayed there for more than a thousand years.",
        "source": "T03n0152_004:0021a27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌蘭惟曰：『斯諸玉女不令吾邁，其有緣乎？』",
        "translation": "Miliṇḍa said to him, 'Is there a reason why these jade women won't let me go?'",
        "source": "T03n0152_004:0021a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伺四女寢，竊疾亡去。",
        "translation": "He waited for four women to go to bed and secretly ran away because of illness.",
        "source": "T03n0152_004:0021b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「遙覩金城，有八玉女，迎辭如上，玉女華容，又踰四人。",
        "translation": "\"I saw a distant view of the golden city, where there were eight jade maidens who greeted me as above, and their beautiful appearance was greater than the four of them.",
        "source": "T03n0152_004:0021b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城中寶殿，名曰屑末，明月真珠諸寶踰前，壽數千萬歲。",
        "translation": "In the city there's a jeweled hall called Crumb, with bright moons and real pearls that surpass the previous ones and have a life expectancy of tens of millions of years.",
        "source": "T03n0152_004:0021b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又疑：『八女不令吾邁，其有由乎？』",
        "translation": "He also wondered, 'Is there a reason the eight women won't let us go?'",
        "source": "T03n0152_004:0021b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伺其臥出，竊疾亡去。",
        "translation": "He waited for her to emerge from her bed and secretly ran away quickly.",
        "source": "T03n0152_004:0021b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又覩水精城，有十六玉女出迎之矣，其辭如上，要將入城昇七寶殿。",
        "translation": "\"He then saw 16 jade maidens emerge from the city of Varuṇa to greet them, saying just the same thing as above, and was about to enter the city and ascend to the hall of seven treasures.",
        "source": "T03n0152_004:0021b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城殿眾寶，玉女光華踰前，居中歲數，又數千萬。",
        "translation": "In the city's palace were many treasures, jade women whose brilliance surpassed their predecessors, and tens of millions of years in the middle of the palace.",
        "source": "T03n0152_004:0021b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「意不厭足，又伺諸女臥出亡去，復覩琉璃寶城，光曜奕奕，有三十二女出迎跪拜，虔辭如上。",
        "translation": "\"Not wanting to be satisfied, he waited for the women to leave and go home, and then he saw the jeweled city of lapis lazuli, shining brilliantly, with thirty-two women who came out to greet him, prostrated, and worshipped him reverently as above.",
        "source": "T03n0152_004:0021b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "要請入城昇七寶殿，殿名欝單，其中眾寶伎樂甘食女色踰前，處中久長年數如上。",
        "translation": "They were invited to enter the city and ascend to the hall of seven treasures, which is called Uttarakuru, where there are many treasures, music, music, sweet food, and women of greater beauty than before, and where they live for as long as the above.",
        "source": "T03n0152_004:0021b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又伺諸女臥出亡去，遙覩鐵城，莫無迎者。",
        "translation": "\"He also waited for the women to leave and die while lying down, and there was no one to welcome them from a distance in the iron city.",
        "source": "T03n0152_004:0021b12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌蘭惟曰：『銀城四女，金城有八，水精十六，琉璃三十二，玉女光世，修虔相迎，今不迎者，將以貴故乎？』",
        "translation": "Miliṇḍa replied, 'There are four women in the silver city, eight in the gold city, 16 in the water crystal, 32 in the lapis lazuli, and a world of jade women who are religiously cultivated and welcome them.",
        "source": "T03n0152_004:0021b13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "周城一匝有鬼開門，彌蘭入城即見其鬼，鬼名俱引，鐵輪烔然走其頭上，守罪人鬼，取彼頭輪，著彌蘭頭上，腦流身燋。",
        "translation": "A demon opened the gate one turn around the city, and when Miliṇḍa entered the city, he saw the demon, which was called by all the names of the demons, and an iron wheel walked heedlessly over his head.",
        "source": "T03n0152_004:0021b15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌蘭流淚曰：『自四之八，自八之十六，自十六之三十二，處榮屑末殿、欝單殿。",
        "translation": "With tears streaming down his face, Miliṇḍa said, 'From the fourth of eight, from the eighth of sixteen, and from the sixteenth of thirty-two, I've been in the Eishima Hall and the Uttarakuru Hall.",
        "source": "T03n0152_004:0021b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾以無足之行，故獲斯矣。",
        "translation": "I've attained this because of my lack of sufficient behavior.",
        "source": "T03n0152_004:0021b20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何當離斯患乎？』",
        "translation": "How could I escape this kind of trouble?'",
        "source": "T03n0152_004:0021b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "守鬼答曰：『其年之數如子來久，子免斯殃矣。』",
        "translation": "The guardian demon replied, 'The number of his years is as long as the son's been here, and the son has been spared this calamity.'",
        "source": "T03n0152_004:0021b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "火輪處彌蘭頭上六億歲，乃免之矣。」",
        "translation": "After 600 million years on Miliṇḍa's head at the fire wheel, he was spared.\"",
        "source": "T03n0152_004:0021b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語諸沙門：「彌蘭者，吾身是也。",
        "translation": "The Buddha told the ascetics, \"Miliṇḍa is myself.",
        "source": "T03n0152_004:0021b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is that?",
        "source": "T03n0152_004:0021b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未奉三尊時，愚惑信邪，母沐浴著新衣臥，吾蹈母首，故太山以火輪轢其首耳。",
        "translation": "Before I dedicated myself to the three honored ones, I was deluded, believing in evil, and when my mother was bathing and wearing new clothes while lying down, I bumped her head, so Taishan rubbed his head with a fire wheel.",
        "source": "T03n0152_004:0021b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又甞以四月八日，持八關齋，中心歡喜，故獲寶城，壽命巨億，所願從心無求不獲。",
        "translation": "I also used to observe the eight precepts on the eighth day of the fourth month, rejoicing in my heart, so I gained a jeweled city with a life span of billions and followed my heart in what I wished for, seeking nothing but gaining it.",
        "source": "T03n0152_004:0021b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "覩世無足，唯得道乃止耳。」",
        "translation": "Seeing that the world is without limits, the only way to stop is to attain the way.\"",
        "source": "T03n0152_004:0021b28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸沙門：「彌蘭出太山獄，閇心三惡，絕口四刃，檢身三尤。",
        "translation": "The Buddha told the ascetics, \"Miliṇḍa escaped the prison of Taishan, cleaned his heart of the three evils, cut off his mouth of the four swords, and examined his body of the three virtues.",
        "source": "T03n0152_004:0021b28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "孝順父母，親奉三尊，戴戒為冠，服戒為衣，懷戒為糧，味戒為肴，食息坐行，不忘佛戒，躇步之間，以戒德成，自致為佛。",
        "translation": "He respected his parents, paid close respect to the three honored ones, wore precepts as a crown, wore precepts as clothing, carried precepts as provisions, tasted precepts as food, ate, rested, sat, and walked without forgetting the Buddha's precepts, and, with each hesitation and step, achieved virtue with the precepts and attained Buddhahood for himself.",
        "source": "T03n0152_004:0021c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡人之行，不孝於親，不尊奉師，吾覩其後自招重罪，彌蘭其類乎！",
        "translation": "I've seen how ordinary people who act unfilially to their relatives and fail to honor their teachers subsequently incur heavy crimes of their own, like Miliṇḍa!",
        "source": "T03n0152_004:0021c04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫為惡禍追，猶影尋身，絕邪崇真，眾禍自滅矣。」",
        "translation": "When pursued by bad misfortune, they're like a shadow searching for a body; cut off evil and honor the truth, and all misfortune will cease naturally.\"",
        "source": "T03n0152_004:0021c05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說經竟，諸沙門歡喜作禮。",
        "translation": "When the Buddha finished speaking the sūtra, the ascetics rejoiced and paid homage.",
        "source": "T03n0152_004:0021c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（四〇）頂生聖王經",
        "translation": "(40) Tingsheng Shengwang jing",
        "source": "T03n0152_004:0021c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T03n0152_004:0021c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時阿難閑居深惟：「眾生自始至終，厭五欲者尠。」",
        "translation": "Ānanda then stayed in seclusion and thought deeply, \"From the beginning to the end, sentient beings rarely become disillusioned with the five desires.\"",
        "source": "T03n0152_004:0021c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過日中後，至向佛所，稽首畢退白言：「唯世尊！",
        "translation": "After the midday hour, he went to the Buddha, bowed his head, withdrew, and said, \"Yes, Bhagavān!",
        "source": "T03n0152_004:0021c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾閑坐深惟：『眾生知足者尠，不厭五欲者眾。』」",
        "translation": "As I sit here, I think deeply, 'There are few sentient beings who know their own satisfaction, and many who aren't weary of the five desires.'\"",
        "source": "T03n0152_004:0021c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊歎曰：「善哉，善哉！",
        "translation": "The Bhagavān praised him, \"Good, good!",
        "source": "T03n0152_004:0021c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如爾之云。",
        "translation": "As you said, it's like this.",
        "source": "T03n0152_004:0021c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is that?",
        "source": "T03n0152_004:0021c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往古有王，名曰頂生，東西南北靡不臣屬。",
        "translation": "Once upon a time, there was a king named Tiyo, who was subordinated by everyone in the east, west, and north.",
        "source": "T03n0152_004:0021c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王有七寶：飛金輪力，白象，紺色馬，明月珠，玉女妻，聖輔臣，典兵臣。",
        "translation": "The king had seven treasures: flying gold wheel power, a white elephant, a violet horse, a bright-moon pearl, a jade lady wife, a noble aide, and a military attaché.",
        "source": "T03n0152_004:0021c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王斯七寶，覩世希有。",
        "translation": "These seven treasures of the king's are rarely found in the world.",
        "source": "T03n0152_004:0021c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又有千子，端正妍雅，聰明博智，天下稱聖；猛力伏眾，有如師子也。",
        "translation": "He also has a thousand sons who are noble in appearance, elegant, intelligent, and knowledgeable, and who are praised throughout the world as having the strength to subdue multitudes, like a lion.",
        "source": "T03n0152_004:0021c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王既聖且仁，普天樂屬，壽有億數。",
        "translation": "Being both noble and benevolent, the king's universal followers enjoy a life span of hundreds of millions of years.",
        "source": "T03n0152_004:0021c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王意存曰：『吾有拘耶尼一天下，地縱廣三十二萬里，黎庶熾盛，五穀豐沃，比門巨富，世所希有，吾國兼焉。",
        "translation": "The king's mind remained, 'I have a single world of Kauṇḍinya, 320,000 miles wide, teeming with people, fertile with grains, and wealthy in comparison with other countries.",
        "source": "T03n0152_004:0021c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖其然者，願彼皇乾，雨金銀錢，七日七夜，惠吾若茲，不亦善乎？』",
        "translation": "Even so, wouldn't it be nice if the emperor, Qian, would grant us gold and silver coins for seven days and nights?'",
        "source": "T03n0152_004:0021c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天從其願，下二寶錢滿其境界，天寶之明，奕奕曜國。",
        "translation": "The gods complied with his wish and sent down two precious coins to fill his realm, and the brightness of the gods' treasures shone brightly over the country.",
        "source": "T03n0152_004:0021c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王喜無量，天下拜賀。",
        "translation": "The king's joy was immeasurable, and the whole world paid homage and congratulated him.",
        "source": "T03n0152_004:0021c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "日與群臣歡喜相樂，民皆稱善，獲無極樂，數千萬歲。",
        "translation": "Every day, he and his ministers rejoiced and were delighted, and the people praised him as good, attaining limitless happiness for tens of millions of years.",
        "source": "T03n0152_004:0021c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王又念曰：『吾有西土，三十二萬里，七寶之榮，千子光國，天雨寶錢，世未甞有。",
        "translation": "\"The king then thought, 'I have a western land 320,000 miles away, the glory of seven treasures, a thousand sons shining brightly, and precious coins raining from the sky that the world has never seen before.",
        "source": "T03n0152_004:0021c26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖其然者，吾聞南方有閻浮提，地廣長二十八萬里，黎庶眾多，靡求不獲。",
        "translation": "Even so, I've heard that there's Jambudvīpa to the south, a land 280,000 miles long and filled with people who want for nothing.",
        "source": "T03n0152_004:0021c28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾得彼土不亦快乎？』",
        "translation": "Wouldn't it be nice for me to obtain that land?'",
        "source": "T03n0152_004:0022a01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王意始存，金輪南向，七寶四兵，輕舉飛行，俱到其土。",
        "translation": "As the king's intention began to take hold, the golden wheel headed south, and seven treasures and four armies flew with a light touch, all reaching his land.",
        "source": "T03n0152_004:0022a02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼王臣民靡不喜從，其土君民，終日欣欣；王止教化，年數如上。",
        "translation": "All of the king's subjects were delighted and obeyed, and the rulers and people of that land rejoiced day after day; the king stopped teaching and educated them for as many years as before.",
        "source": "T03n0152_004:0022a03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王又念曰：『吾有西土，今獲南土，天人眾寶何求不有？",
        "translation": "\"The king then thought, 'I had the western land, and now I've gained the southern land.",
        "source": "T03n0152_004:0022a04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今聞東方弗于逮，土三十六萬里，其土君民，寶穀諸珍無願不有。",
        "translation": "Now, I've heard that the land of Pūrva-Videha in the east is 360,000 li long, and that its people have nothing but treasures and grains that they wouldn't wish for.",
        "source": "T03n0152_004:0022a06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾獲其土不亦快乎？』",
        "translation": "Wouldn't it be nice for me to acquire that land?'",
        "source": "T03n0152_004:0022a07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "口始云爾，金輪東向，七寶四兵飛行俱至，君臣黎庶靡不樂屬。",
        "translation": "When he first spoke, the golden wheel headed east, the seven treasures and four armies flew in, and the ruler, ministers, and common people were all delighted to be subordinated.",
        "source": "T03n0152_004:0022a08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又以正法仁化君民，年數如上，比門懷德。",
        "translation": "He also uses the right teaching to benevolently transform the rulers and the people, age as above, and compares them to the approach of carrying virtue.",
        "source": "T03n0152_004:0022a09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王又念曰：『吾有西土南土東土，天人眾寶無珍不有，今聞北方欝單曰土，吾獲王之不亦善乎？』",
        "translation": "\"The king also thought, 'I have a western land, a southern land, an eastern land, and a multitude of treasures from gods and humans, but now I hear that the northern Uttarakuru region is called the land, wouldn't it be good for the king to acquire it?'",
        "source": "T03n0152_004:0022a10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "開口言願，金輪北向，七寶四兵俱飛如前。",
        "translation": "Opening his mouth and saying the vow, he faced north with a golden wheel, and the seven treasures and four armies all flew as before.",
        "source": "T03n0152_004:0022a13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "始入其界，遙覩地青如翠羽色。",
        "translation": "When they first entered their realm, they saw a ground as blue as emerald feathers from a distance.",
        "source": "T03n0152_004:0022a14_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『爾等覩青地乎？』",
        "translation": "The king said, 'Do you see a blue ground?'",
        "source": "T03n0152_004:0022a14_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『見之。』",
        "translation": "He said, 'I see it.'",
        "source": "T03n0152_004:0022a15_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『斯欝單曰地。』",
        "translation": "He said, 'Sugata says 'the ground.'",
        "source": "T03n0152_004:0022a15_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又『覩白地？』",
        "translation": "And he said, 'See the white earth?'",
        "source": "T03n0152_004:0022a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『覩之。』",
        "translation": "He said, 'Look at this.'",
        "source": "T03n0152_004:0022a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『斯成擣稻米，爾等食之。』",
        "translation": "He said, 'This has produced a pile of rice, so let's eat it.'",
        "source": "T03n0152_004:0022a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又覩諸寶樹，眾軟妙衣，臂釧指環，瓔珞眾奇，皆懸著樹，曰：『覩之乎？』",
        "translation": "He also saw the jeweled trees, the many soft and wonderful garments, the armlets and finger rings, and the jewelry hanging from the trees, and said, 'Do you see that?'",
        "source": "T03n0152_004:0022a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『唯然！』",
        "translation": "He said, 'Yes!'",
        "source": "T03n0152_004:0022a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『爾等服之。』",
        "translation": "He said, 'Let's accept it.'",
        "source": "T03n0152_004:0022a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王治以仁、化民以恕，居彼年久其數如上。",
        "translation": "The king ruled with kindness and taught the people with forgiveness, and he stayed there for as many years as the above.",
        "source": "T03n0152_004:0022a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又生意曰：『吾有三天下，今獲北方四十萬里，意欲昇忉利天之帝釋所。』",
        "translation": "\"He also said, 'I have three worlds, and now I've gained 400,000 miles to the north with the intention of ascending to Tishri in the Heaven of Truth.'",
        "source": "T03n0152_004:0022a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王意始然，金輪上向，七寶四兵飛行昇天，入帝釋宮。",
        "translation": "When the king's intention began to take hold, he ascended with a golden wheel, flew upward with seven jewels and four armies, and ascended to the heavens and entered the palace of Indra.",
        "source": "T03n0152_004:0022a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋覩王來，欣迎之曰：『數服高名，久欲相見，翔茲快乎！』",
        "translation": "Seeing the king coming, Śākyamuni was delighted to greet him, saying, 'I've served him well, I've long wished to meet him, how pleasant it is to see him fly here!'",
        "source": "T03n0152_004:0022a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "執手共坐，以半座坐之。",
        "translation": "He held hands and sat down together, using half of his seat.",
        "source": "T03n0152_004:0022a24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王左右顧視，覩天宮殿，黃金白銀、水精琉璃、珊瑚虎珀、車璩真珠以為宮殿，覩之心欣。",
        "translation": "The king looked around and saw the palace of the gods, which was made of gold, white silver, lapis lazuli, coral, tiger, and real beads from the Chequers, and was delighted at the sight.",
        "source": "T03n0152_004:0022a25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即又念曰：『吾有四國，寶錢無數，斯榮難云；令天帝殞；吾處其位，不亦上願乎？』",
        "translation": "He then thought, 'Wouldn't it be a great wish if I were in that position, since I have four countries with countless treasures and money that would make the gods die?'",
        "source": "T03n0152_004:0022a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惡念興而神足滅，釋還之故宮，即獲重病。",
        "translation": "After his evil thoughts arose and his spiritual powers ceased, he returned to his former palace and became seriously ill.",
        "source": "T03n0152_004:0022a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "輔臣問曰：『天王疾篤，若在不諱，將有遺命乎？』",
        "translation": "The assistants asked, 'Is the king of gods seriously ill, and will he die if he remains unhidden?'",
        "source": "T03n0152_004:0022b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『如有問：「王何以喪身？」",
        "translation": "The king said, 'Suppose you ask, \"How did the king lose his body?\"'",
        "source": "T03n0152_004:0022b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答如所覩，以貪獲病，遂致喪身。",
        "translation": "He answered as I saw, \"He got sick because of greed, and he lost his life.",
        "source": "T03n0152_004:0022b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫貪殘命之刃，亡國之基也。",
        "translation": "The blade of greed for a cruel life is the foundation of a dead country.",
        "source": "T03n0152_004:0022b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去三尊，處三塗，靡不由之。",
        "translation": "Removing the three honored ones and placing them in the three destinies are not uncommon.",
        "source": "T03n0152_004:0022b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戒後來嗣，以貪癡火燒身之本也，慎無貪矣。",
        "translation": "We should warn future generations that the fire of craving delusion burns the root of their bodies, so they should be careful not to crave.",
        "source": "T03n0152_004:0022b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫榮尊者其禍高矣，寶多者其怨眾矣。』",
        "translation": "The honorable man's misfortune is too great, and the wealthy man's enmity is too great.'",
        "source": "T03n0152_004:0022b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王終，後嗣誦其貪戒，傳世為寶。",
        "translation": "When the king ended, his heirs recited his precept against greed, and it was handed down to the world as a treasure.",
        "source": "T03n0152_004:0022b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四天下民尊其仁化，奉三尊、行十善，以為治法，遂致永福。」",
        "translation": "The people of the four worlds respected his benevolence, honored the three honored ones, and practiced the ten good qualities as their rule, which led to eternal happiness.\"",
        "source": "T03n0152_004:0022b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊曰：「覩世尠能去榮貴、捐五欲者，惟獲溝港、頻來、不還、應儀、緣一覺，無上正真道、最正覺、道法御、天人師，能絕之耳。",
        "translation": "The Bhagavān said, \"Most people in the world can abandon wealth and prosperity and the five desires, except for those who attain port of guttering, frequently come, never return, response etiquette, conditioned single awakening, the unsurpassed true path, the most righteous awakening, the way, the Dharma, and the teacher of gods and humans, which are capable of ending them.",
        "source": "T03n0152_004:0022b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "飛行皇帝，所以存即獲願不違心者，宿命布施、持戒、忍辱、精進、禪定、智慧之所致，不空獲也。",
        "translation": "The flying emperor, so he survives and attains the vow and doesn't disobey it, is the result of past lives of generosity, observance of precepts, patience, effort, meditation, and wisdom, which are not obtained in vain.",
        "source": "T03n0152_004:0022b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頂生王者，吾身是也。」",
        "translation": "The one who rises to the top, the king, is myself.\"",
        "source": "T03n0152_004:0022b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說經竟，阿難歡喜，為佛作禮。",
        "translation": "When the Buddha finished speaking the sūtra, Ānanda rejoiced and paid homage to him.",
        "source": "T03n0152_004:0022b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（四一）普明王經",
        "translation": "(41) Puminous King Sutra",
        "source": "T03n0152_004:0022b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T03n0152_004:0022b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「昔者菩薩為大國王，名曰普明，慈惠光被，十方歌懿，民賴其休，猶慈子之寧親也。",
        "translation": "The Buddha told the monks, \"Once, the bodhisattva was the king of a great country named Pūrṇa Maitrāyaniputra, whose kindness and wisdom shone brightly, were praised in ten directions, and the people relied on him for rest, like a loving son who would rather be close to them.",
        "source": "T03n0152_004:0022b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隣國有王，治法以正，力如師子，走攫飛鳥。",
        "translation": "In a neighboring country, there was a king who governed correctly and had the strength of a lion who walked and seized flying birds.",
        "source": "T03n0152_004:0022b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宰人亡肉，晨犇市索，路覩新屍，取之為肴，味兼畜肉。",
        "translation": "He slaughters the flesh of dead people, goes to the market in the morning, finds a new corpse on the road, and takes it as a delicacy that tastes just like the flesh of an animal.",
        "source": "T03n0152_004:0022b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後日為饌，甘不如焉。",
        "translation": "Later, they would serve it as a delicacy, but it wasn't as sweet as it could have been.",
        "source": "T03n0152_004:0022b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王責太官，宰人歸誠叩頭首之。",
        "translation": "The king rebuked the commander, but the slaughterer returned and bowed his head.",
        "source": "T03n0152_004:0022b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王心恧然曰：『人肉甘乎？』",
        "translation": "The king was distressed and said, 'Is human flesh good?'",
        "source": "T03n0152_004:0022b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "默勅宰人以斯為常。」",
        "translation": "Imazai makes this a constant.\"",
        "source": "T03n0152_004:0022b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊曰：「夫厚於味者即仁道薄，仁道薄者犲狼心興，夫為狼，苟貪肉味而賊物命，故天下讎焉。",
        "translation": "The Bhagavān said, \"When someone is thick on taste, the way of kindness is weakened, and when the way of kindness is weakened, the heart of wolves arises.",
        "source": "T03n0152_004:0022b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宰人承命，默行殺人，以供王欲，臣民嗷嗷。",
        "translation": "The ruler accepts the order to silently carry out the killing of people to serve the king's desires, and his subjects are made to wail.",
        "source": "T03n0152_004:0022b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "表聞尋賊，王曰宜然。",
        "translation": "When the authorities heard that the thief was being sought, the king said it would be appropriate.",
        "source": "T03n0152_004:0022b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "密告宰人曰：『慎之哉！』",
        "translation": "He told the ruler in confidence, 'Be careful!'",
        "source": "T03n0152_004:0022b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有司獲之。",
        "translation": "A superintendent seized him.",
        "source": "T03n0152_004:0022b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賊曰：『王命爾矣。』",
        "translation": "The thief said, 'The king's order is fulfilled.'",
        "source": "T03n0152_004:0022b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "群臣諫曰：『臣聞，王者為德仁法，帝精明即日月濟等，后土潤齊乾坤，含懷眾生即若虛空，爾乃可為天下王耳。",
        "translation": "The ministers remonstrated, saying, 'I've heard that the king is a man of virtue and benevolence, that the emperor's wisdom is equal to that of the sun and moon, that the latter land nourishes both heaven and earth, and that he contains sentient beings like space.",
        "source": "T03n0152_004:0022b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若違仁從殘，即犲狼之類矣。",
        "translation": "If he goes against kindness and follows the brutal, he'll be a type of wolf.",
        "source": "T03n0152_004:0022c03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去明就闇，瞽者之疇矣；替濟自沒，即坏舟之等矣。",
        "translation": "To remove the light and return to darkness is the domain of gozes, and to replace relief with surrender is to destroy boats and so forth.",
        "source": "T03n0152_004:0022c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋潤崇枯，即火旱之喪矣；背空向窒，即石人之心也矣。",
        "translation": "To explain away the moist and the noble is to wither, which is the loss of fire and drought, and to turn one's back on emptiness and face suffocation, which is the mind of a stone-cold man.",
        "source": "T03n0152_004:0022c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫狼殘瞽闇坏沒火燒石人之操，不可為宰人之監，豈可為天下王耶？",
        "translation": "A wolf who is left with goze, dark, bad, and confiscated by fire and the conduct of a stone-burning man can't be the governor of a ruler, so how could he be the king of the world?",
        "source": "T03n0152_004:0022c06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若崇上德即昌，好殘賊則亡。",
        "translation": "If they revere superior virtue, they will prosper; if they like brutal thieves, they will perish.",
        "source": "T03n0152_004:0022c08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二義臧否，惟王何之？』",
        "translation": "What is the king to decide whether these two meanings are compatible?'",
        "source": "T03n0152_004:0022c09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『孩童絕湩其可乎？』",
        "translation": "The king said, 'Is it permissible for a child to cut off milk?'",
        "source": "T03n0152_004:0022c09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『不可。』",
        "translation": "He said, 'No.'",
        "source": "T03n0152_004:0022c10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『余如之矣。』",
        "translation": "The king said, 'I've done so.'",
        "source": "T03n0152_004:0022c10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "群臣僉曰：『犲狼不可育，無道不可君。』",
        "translation": "The ministers all said, 'A wolf in the water cannot be nurtured, and a ruler without the Way cannot be ruled.'",
        "source": "T03n0152_004:0022c10_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臣民齊心同聲逐焉。",
        "translation": "The subjects all joined together in one voice and expelled them.",
        "source": "T03n0152_004:0022c11_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王奔入山，覩見神樹，稽首辭曰：『令余反國，貢神百王。』",
        "translation": "\"The king ran into the mountain, saw the sacred tree, and bowed his head and said, 'Let me go back to my country and pay homage to the gods of the hundred kings.'",
        "source": "T03n0152_004:0022c12_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誓畢即行，伺諸王出突眾取之，猶鷹鷂之撮鷰雀，執九十九王。",
        "translation": "After vowing to do so, he waited for the kings to emerge and seized them from the crowd, like an eagle or a harrier picking up a bird or a bird, and he took control of 99 kings.",
        "source": "T03n0152_004:0022c13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樹神人現顏華非凡，謂阿群曰：『爾為無道以喪王榮，今復為元酷，將欲何望乎？』",
        "translation": "The tree god showed up with an extraordinary face and flowers, and he said to Ah Qun, 'You've been destitute and have lost the king's glory; now that you've become a genin, what do you expect?'",
        "source": "T03n0152_004:0022c15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿群前趣之，忽然不現。",
        "translation": "Ah Qun went to meet him, but he suddenly didn't appear.",
        "source": "T03n0152_004:0022c17_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，普明王，出察民苦樂，道逢梵志，梵志曰：『大王還宮，吾欲有言。』",
        "translation": "\"Then, King Sumeru went out to examine the people's suffering and happiness, and he met a priest on the road who said, 'Your Majesty, I'd like to speak to you about returning to the palace.'",
        "source": "T03n0152_004:0022c17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『昨命當出，信言難違。",
        "translation": "The king said, 'I was ordered to leave yesterday, and it's hard to disobey my words of faith.'",
        "source": "T03n0152_004:0022c19_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道士進坐，吾旋在今。』",
        "translation": "The priest entered and sat down, and I'm now revolving around him.'",
        "source": "T03n0152_004:0022c19_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂出為阿群所獲，投之樹下，王曰：『不懼喪身，恨毀吾信耳。』",
        "translation": "He then went out and was caught by Ah Qun and threw him under a tree. The king said, 'I'm not afraid to lose my body, but I'd like to disparage my faith.'",
        "source": "T03n0152_004:0022c20_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿群曰：『何謂耶？』",
        "translation": "Ah Qun said, 'What do you mean?'",
        "source": "T03n0152_004:0022c21_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王具說道士見己之誓，願一覩之，受其重戒，尠寶貢焉，旋死不恨。",
        "translation": "The king explained in detail his vow to meet the Daoist, wishing to see him once, accept his grave precepts, and pay tribute with lumps of treasure, so that he would not hate him if he were to die.",
        "source": "T03n0152_004:0022c22_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿群放之，還覩道士，躬敷高座，道士昇座，即說偈言：「『劫數終訖，　　乾坤烔然，　　須彌巨海，　　都為灰焬。",
        "translation": "Aqun released him and returned to see the Daoist, spread out his high seat, and the Daoist rose to his seat and spoke in verse, saying, \"When the eons have ended, dry land and Kun are heated, and the great Sumerian ocean is reduced to ashes and ash.",
        "source": "T03n0152_004:0022c23_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　天龍福盡，　　于中凋喪，　　二儀尚殞，　　國有何常？",
        "translation": "The blessings of the gods and dragons are exhausted, and they wither away in the midst of it; what kind of permanence is there in the country while the two instruments are still dying?'",
        "source": "T03n0152_004:0022c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　生老病死，　　輪轉無際，　　事與願違，　　憂悲為害。",
        "translation": "Birth, age, sickness, and death are transmigration without limit, and when things go against their wishes, grief and sorrow are the cause of harm.",
        "source": "T03n0152_004:0023a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　欲深禍高，　　瘡疣無外，　　三界都苦，　　國有何賴？",
        "translation": "Desire is deep and woe is high, sores and warts have no limit, the three realms are all painful, and what refuge does the country have?",
        "source": "T03n0152_004:0023a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　有本自無，　　因緣成諸，　　盛者必衰，　　實者必虛。",
        "translation": "'Existence is inherently nonexistent, and causes and conditions make them so; what's abundant must decline, and what's real must be empty.'",
        "source": "T03n0152_004:0023a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　眾生蠢蠢，　　都緣幻居，　　聲響俱空，　　國土亦如。",
        "translation": "All sentient beings are foolish, conditioned by illusory dwellings, and both sound and echo are empty, so is the land.",
        "source": "T03n0152_004:0023a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　識神無形，　　駕乘四蛇，　　無明寶養，　　以為樂車。",
        "translation": "The consciousness spirit has no form, rides four serpents, and is nurtured by the treasures of nescience as a chariot of pleasure.",
        "source": "T03n0152_004:0023a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　形無常主，　　神無常家，　　三界皆幻，　　豈有國耶？』",
        "translation": "'Form has no permanent owner, the spirit has no permanent home, and the three realms are all illusory, so how could there be a country?'",
        "source": "T03n0152_004:0023a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「受偈畢，即貢金錢萬二千。",
        "translation": "\"After accepting the verse, he offered a donation of twelve thousand pieces of money.",
        "source": "T03n0152_004:0023a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵志重誡之曰：『爾存四非常，其禍必滅矣。』",
        "translation": "The priest repeatedly admonished him, 'If you keep the four unexceptional things, their misfortune will surely cease.'",
        "source": "T03n0152_004:0023a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『敬諾，不敢替明誡。』",
        "translation": "The king said, 'Respectfully, I dare not replace your clear admonition.'",
        "source": "T03n0152_004:0023a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即至樹所，含笑且行。",
        "translation": "He went to the tree, smiling, and walked.",
        "source": "T03n0152_004:0023a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿群曰：『命危在今，何欣且笑？』",
        "translation": "Ah Qun said, 'Now that your life is at stake, why are you happy and smiling?'",
        "source": "T03n0152_004:0023a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『世尊之言，三界希聞。",
        "translation": "They replied, 'The Bhagavān's words are unheard of in the three realms.",
        "source": "T03n0152_004:0023a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾今懷之，何國命之可惜乎？』",
        "translation": "Now that I've taken them into my heart, what's the pity of a country's life?'",
        "source": "T03n0152_004:0023a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿群媚曰：『願聞尊教。』",
        "translation": "Ah Qun Mei said, 'May I hear your teaching, Your Holiness.'",
        "source": "T03n0152_004:0023a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即以四偈授之，驚喜歎曰：『巍巍世尊，陳四非常，夫不聞覩，所謂悖狂。』",
        "translation": "The king then gave him four verses and was astonished and praised, saying, 'The Bhagavān is so majestic that he presents four extraordinary things that people don't hear and see, which is called insane.'",
        "source": "T03n0152_004:0023a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即解百王，各令還國。",
        "translation": "He then released each of the 100 kings and ordered them to return to their countries.",
        "source": "T03n0152_004:0023a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「阿群悔過自新，依樹為居，日存四偈，命終神遷，為王太子，納妻不男。",
        "translation": "\"Aqun repented and reformed himself, living in a tree, saving four verses every day, and at the end of his life, his spirit moved on, becoming the king's prince and taking a wife and not a son.",
        "source": "T03n0152_004:0023a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王重憂之，因募國女化之令男，後遂妷蕩不從真道。",
        "translation": "The king was deeply concerned, so he recruited a woman from his country to teach her to be a male, but she later wandered off and didn't follow the true path.",
        "source": "T03n0152_004:0023a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王恚之焉，磔著四衢，命行人曰：『以指确首，苟辱之矣。』",
        "translation": "The king was angered, so he cut them off and put them in four quadrants, ordering the mendicants to say, 'Let's use our fingers to confirm our heads, for we'll humiliate them.'",
        "source": "T03n0152_004:0023a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "適九十九人，而太子薨。",
        "translation": "After ninety-nine people were born, the prince died.",
        "source": "T03n0152_004:0023a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魂靈變化，輪轉無已，值佛在世，生舍衛國。",
        "translation": "His spirit changed and reincarnated endlessly, and he was born in the country of Śrāvastī while the Buddha was still in the world.",
        "source": "T03n0152_004:0023a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "早喪其父，孤與母居。",
        "translation": "He had lost his father early and was left alone with his mother.",
        "source": "T03n0152_004:0023a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "事梵志道，性篤言信，勇力擘象，師愛友敬，遐邇稱賢，師每周旋輙委以居。",
        "translation": "He served the Brahmā, believed in his words, had the courage to break through elephants, was loved by his teachers, respected by friends, and was known far and wide as a good man who would entrust him with every situation.",
        "source": "T03n0152_004:0023a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師妻懷嬖，援其手婬辭誘之。",
        "translation": "The teacher's wife harbored a crush and invited him to help her with sexual favors.",
        "source": "T03n0152_004:0023a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿群辭曰：『凡世耆友，男吾父之，女吾母焉，豈況師之所敬乎？",
        "translation": "Aqun replied, 'Where there are worldly elders and friends, how could there be a man my father and a woman my mother, let alone one whom the teacher respects?'",
        "source": "T03n0152_004:0023a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "燒身可從，斯亂不敢順矣。』",
        "translation": "Burning myself could be followed, but I dare not go along with this disorder.'",
        "source": "T03n0152_004:0023b01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師妻恧然，退思為變。",
        "translation": "The teacher's wife was shocked, and she withdrew to think about the change.",
        "source": "T03n0152_004:0023b02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婿歸，婦曰：『子歎彼賢，足照子否矣？』",
        "translation": "When her son-in-law returned, the woman said, 'Did you praise him as a good man, or is he good enough to illuminate you?'",
        "source": "T03n0152_004:0023b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具為其過。",
        "translation": "They all make up their faults.",
        "source": "T03n0152_004:0023b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女妖似真，梵志信矣。",
        "translation": "The demoness seemed real, and the priest believed her.",
        "source": "T03n0152_004:0023b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師告阿群：『爾欲仙乎？』",
        "translation": "The teacher told Ah Qun, 'Do you want to be immortal?'",
        "source": "T03n0152_004:0023b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『唯然。』",
        "translation": "He replied, 'Yes.'",
        "source": "T03n0152_004:0023b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『爾殺百人，斬取其指，今獲神仙。』",
        "translation": "He said, 'You killed a hundred people and cut off their fingers; now you've gained a sage.'",
        "source": "T03n0152_004:0023b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奉命携劒，逢人輙殺，獲九十九人指，眾犇國震。",
        "translation": "After being ordered to carry them, he killed as many people as he met and got the fingers of 99 people, and the whole country was shaken.",
        "source": "T03n0152_004:0023b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "覩母欣曰：『母至數足，吾今仙矣。』",
        "translation": "They rejoiced when they saw their mother, saying, 'My mother has reached the number of feet, and now I'm an immortal.'",
        "source": "T03n0152_004:0023b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛念：『邪道惑眾，普天斯疇也。』",
        "translation": "The Buddha thought, 'This is a wrong path that deludes people, and it's the domain of all the gods.'",
        "source": "T03n0152_004:0023b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化為沙門在其前步，曰：『人數足矣。』",
        "translation": "He was transformed into an ascetic who stepped in front of him and said, 'There are enough of them.'",
        "source": "T03n0152_004:0023b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "追後不屬，曰：『沙門可止！』",
        "translation": "He followed him and said, 'The ascetic can stop!'",
        "source": "T03n0152_004:0023b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『吾止久矣，惟爾不焉。』",
        "translation": "He replied, 'I've been stopping for a long time, but you're the only one who hasn't.'",
        "source": "T03n0152_004:0023b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『止義云何？』",
        "translation": "He said, 'What's the meaning of stopping?'",
        "source": "T03n0152_004:0023b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『吾惡都止，爾惡熾矣。』",
        "translation": "He replied, 'My evil is all stopped, and your evil is blazing.'",
        "source": "T03n0152_004:0023b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿群心開，霍如雲除，五體投地，頓首悔過。",
        "translation": "Aqun's mind was opened, and he was like a cloud removed, throwing his five bodies to the ground, he bowed his head in repentance.",
        "source": "T03n0152_004:0023b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "叉手尋從，將還精舍，即為沙門。",
        "translation": "He followed them with folded arms and returned to the monastery, where he became an ascetic.",
        "source": "T03n0152_004:0023b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛為說宿行，現四非常，得溝港道，退于樹下，閉目叉手練去餘垢，進取無著。",
        "translation": "The Buddha explained his former practice, showed him four extraordinary things, and got him to retreat under a tree, close his eyes, fold his palms, train, and remove the rest of the dirt, and advance to unattachedness.",
        "source": "T03n0152_004:0023b13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王召軍師戰士數萬，尋捕妖賊，未知所之。",
        "translation": "\"The king summoned tens of thousands of soldiers and warriors to hunt down the demons and thieves, but they didn't know where they were.",
        "source": "T03n0152_004:0023b15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道過佛所，曰：『王自何來？",
        "translation": "When he passed by the Buddha, he said, 'Where did the king come from?'",
        "source": "T03n0152_004:0023b16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身蒙塵土。』",
        "translation": "His body is covered with dust.'",
        "source": "T03n0152_004:0023b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『國有妖賊殺無過民，今尋捕之。』",
        "translation": "They replied, 'There's a bandit in my country who kills more people than I do, so now I'm looking for him.'",
        "source": "T03n0152_004:0023b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告曰：『夫民先修德而退崇邪，治國之政其法何之？』",
        "translation": "The Bhagavān told them, 'When the people first cultivate virtue and then revere evil, what's the way to govern a country?'",
        "source": "T03n0152_004:0023b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『先貴後賤，正法治之。』",
        "translation": "They replied, 'The first is noble, then inferior, and the right rule governs that.'",
        "source": "T03n0152_004:0023b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『若夫先戴畜心退懷聖德，正法何之？』",
        "translation": "'If someone first wears an animalistic heart and then retreats to carry noble virtue, what's the right rule?'",
        "source": "T03n0152_004:0023b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『先賤後貴正法賞之。』",
        "translation": "He said, 'First he's inferior, then he's noble, and the right teaching rewards him.'",
        "source": "T03n0152_004:0023b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『賊已釋邪崇真，今為沙門矣。』",
        "translation": "He said, 'The thief has freed himself from error and revered the truth; now he's an ascetic.'",
        "source": "T03n0152_004:0023b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王歎曰：『善哉！",
        "translation": "The king praised him, saying, 'Good!",
        "source": "T03n0152_004:0023b22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、無所著、正真道、最正覺、道法御、天人師，神妙上化乃至于茲乎！",
        "translation": "The Tathāgata, the Unattached One, the True Path, the Most Perfectly Enlightened One, the Way's Superintendent, and the Teacher of Gods and Men, how far has the marvelous transformation gone!",
        "source": "T03n0152_004:0023b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "始為犲狼，今為天仁。』",
        "translation": "First, he was a wolf in the water; now, he's a benefactor of Heaven.'",
        "source": "T03n0152_004:0023b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "稽首足下，又重歎曰：『斯化奇矣，願一覩之。』",
        "translation": "He bowed his head at his feet and repeatedly praised him, saying, 'This is a marvelous transformation; I wish I could see it.'",
        "source": "T03n0152_004:0023b24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊曰：『可。』",
        "translation": "The Bhagavān said, 'Yes.'",
        "source": "T03n0152_004:0023b25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王逮官屬，造之而曰：『上德賢者可一開眼相面乎？』",
        "translation": "The king took his officials and made them say, 'Would the most virtuous and wise man open his eyes and look at his face?'",
        "source": "T03n0152_004:0023b26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如斯三矣。",
        "translation": "So it was three times.",
        "source": "T03n0152_004:0023b27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『吾之眼睛，耀射難當。』",
        "translation": "He replied, 'My eyes are shining, and it's hard to match them.'",
        "source": "T03n0152_004:0023b27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王稽首曰：『明日設微饌，願一顧眄。』",
        "translation": "The king bowed his head and said, 'Tomorrow, I'll offer a small meal, and I'd like to take a look at it.'",
        "source": "T03n0152_004:0023b28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『於廁吾往，於殿則不。』",
        "translation": "He replied, 'I'll come to the toilet, but not to the palace.'",
        "source": "T03n0152_004:0023b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『唯命。』",
        "translation": "The king said, 'Yes, I will.'",
        "source": "T03n0152_004:0023b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "還則裂廁，掘其地則新之，樟梓楠材，為之柱梁，香湯沃地，栴檀蘇合欝金諸香，和之為泥，旃罽雜繒，以為座席，彫文刻鏤，眾寶為好。",
        "translation": "When he returned, he tore open the latrine, dug up the floor and made it new, made pillars and beams of camphor and catalpa, watered the floor with scented baths, mixed sandalwood and gold scents into mud, made seats of silken wool, sculpted and carved them, and made them good with various treasures.",
        "source": "T03n0152_004:0023b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "煒煒煌煌，有踰殿堂。",
        "translation": "It was shining brilliantly, surpassing the size of a palace.",
        "source": "T03n0152_004:0023c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明日王身，捧香鑪迎之。",
        "translation": "On the morning, the king himself held a censer to welcome him.",
        "source": "T03n0152_004:0023c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿群就座，王褰衣膝行，供養訖畢，即說經曰：『廁前日之污，豈可於飯乎？』",
        "translation": "When Aqun took his seat, the king lowered his robe and knelt down. After making his offerings, he then spoke the sūtra, saying, 'Is it possible to wash the toilet that was soiled the day before with food?'",
        "source": "T03n0152_004:0023c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『不可。』",
        "translation": "He said, 'No.'",
        "source": "T03n0152_004:0023c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『今可乎？』",
        "translation": "He said, 'Is it OK now?'",
        "source": "T03n0152_004:0023c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：『可矣。』",
        "translation": "He said, 'It's OK.'",
        "source": "T03n0152_004:0023c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿群曰：『吾未覩佛時，事彼妖蠱，心存口言身行諸邪，邪道穢化其為臭污，甚彼溷矣。",
        "translation": "Ah Qun said, 'When I was first introduced to the Buddha, I worked with those demons and tricksters, kept my mind, spoke, and acted wrongly, and their ways were so defiled that they became smelly and polluted, even more so than that.",
        "source": "T03n0152_004:0023c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "屎污可洗，穢染難除，賴蒙宿祚生值佛世，沐浴清化去臭懷香，內外清淨猶天真珠，夫不覩佛、不知四非常者，觀其志趣，猶狂者醉之以酒矣，不親賢眾而依十惡者，其與犲狼共檻乎！』",
        "translation": "When I didn't see the Buddha and didn't know the four unexceptional things, I observed their aspirations and was like a crazy person who gets drunk with alcohol.",
        "source": "T03n0152_004:0023c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『善哉！",
        "translation": "The king said, 'Good!",
        "source": "T03n0152_004:0023c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奇乎佛之至化，乃令廁臭化為栴檀矣。』",
        "translation": "It's amazing how the Buddha's supreme transformation has turned the stench of a toilet into sandalwood.'",
        "source": "T03n0152_004:0023c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「說經竟，即邁歷市，聞有婦人逆產者命在呼吸。",
        "translation": "\"After he finished speaking the sūtra, he went to the market and heard about a woman who was giving birth against her will and whose life was in her last breath.",
        "source": "T03n0152_004:0023c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "還如事啟，佛言：『爾往為其產。』",
        "translation": "Returning to the incident, the Buddha said, 'Go and give birth to her.'",
        "source": "T03n0152_004:0023c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿群恧然。",
        "translation": "Ah Qun was embarrassed.",
        "source": "T03n0152_004:0023c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊曰：『爾望產云：「吾自生來，慈向眾生，潤濟乾坤者。」",
        "translation": "The Bhagavān said, 'Do you look into the childbirth and say, 'Since I was born, I've been kind to sentient beings and have nourished both heaven and earth.'\"",
        "source": "T03n0152_004:0023c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾母子俱全矣。』",
        "translation": "You mother and child are now whole.'",
        "source": "T03n0152_004:0023c18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受教而往，至宣佛恩，母子俱生。",
        "translation": "Accepting the teaching, he went there, declared the Buddha's kindness, and his mother and child were both born.",
        "source": "T03n0152_004:0023c19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "退還尋塗，疑己有殺人之酷，而云普慈，稽首質焉。",
        "translation": "He retreated, looked for dirt, suspected that he had killed someone, and then declared that he was universally compassionate, so he looked up and questioned him.",
        "source": "T03n0152_004:0023c20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿群：『凡人心開受道之日，可謂始生者也。",
        "translation": "The Buddha told Aqun, 'The day when the human mind is opened to the path, it can be called the first birth.",
        "source": "T03n0152_004:0023c21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不覩三尊，未受重戒，猶兒處胎，雖其有目，將亦何覩？",
        "translation": "If they don't see the three honored ones and haven't received the grave precepts, they're like a child in the womb, even though they have eyes, how will they see them?'",
        "source": "T03n0152_004:0023c22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有耳何聞？",
        "translation": "What do I hear if I have ears?",
        "source": "T03n0152_004:0023c23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故曰未生也。』",
        "translation": "Therefore, it's said to be unarisen.'",
        "source": "T03n0152_004:0023c24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿群心開，即得應真道。」",
        "translation": "When Ah Qun's mind is awakened, then he attains the true path.\"",
        "source": "T03n0152_004:0023c24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「昔時普明者，吾身是也。",
        "translation": "The Buddha told the monks, \"That person who was universally bright in the past was me.",
        "source": "T03n0152_004:0023c25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾前世授之四偈，一活百王，今令得道，不受重罪矣。",
        "translation": "In a previous life, I gave him four verses, one of which lived a hundred kings, and now he has attained the way and won't be subject to heavy crimes.",
        "source": "T03n0152_004:0023c25_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿群宿命甞為比丘，負米一斛送著寺中，上作刀一枚，歡喜歎尊，稽首而去。",
        "translation": "In his former life, Aqun was once a monk who carried a heaping load of rice to the monastery, put it on a knife, rejoiced, praised the venerable, and bowed his head as he departed.",
        "source": "T03n0152_004:0023c27_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "負米獲多力，上刀獲多寶，歡喜獲端正，歎尊獲為王，作禮故為國人所拜。",
        "translation": "Carrying the rice gained much strength, putting up the knife gained much treasure, rejoicing in the correctness of it, and praising the venerable as king, he made prostrations and was therefore worshipped by the people of his country.",
        "source": "T03n0152_004:0023c29_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九十九人确其首，遂至喪身，故殺前怨而斬其指。",
        "translation": "Ninety-nine people confirm his head, and it leads to his death, so they kill their enemies and chop off their fingers.",
        "source": "T03n0152_004:0024a01_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後人欲确，見其已喪，又覩沙門，更有慈心。",
        "translation": "When the latter wanted to confirm it, they saw that they had already been killed and saw the ascetic, so they were even more compassionate.",
        "source": "T03n0152_004:0024a03_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後人即其母，始有惡意故，阿群始意亦惡，覩沙門更慈故，見佛即孝。",
        "translation": "That latter person was his mother, and because he first had ill intentions, Aqun's initial thoughts were also evil; seeing the ascetic was even more kind, so he saw the Buddha and became filial.",
        "source": "T03n0152_004:0024a04_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種淳得淳，種雜得雜，善惡已施，禍福尋之，影追響應，皆有所由，非徒自然也。",
        "translation": "When the seeds are simple, the seeds are simple; when the seeds are mixed, the good and evil are bestowed, the misfortune and fortune are found, and the images follow the responses, all have their causes, not just their nature.",
        "source": "T03n0152_004:0024a05_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘願言：『令汝逢佛得道。』",
        "translation": "The monk vowed, 'Let's meet the Buddha and attain the way.'",
        "source": "T03n0152_004:0024a07_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如願獲焉。",
        "translation": "As he wishes, he obtains it.",
        "source": "T03n0152_004:0024a08_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "供養三尊，有若絲髮；沙門以慈呪願施者言，如其言，得，萬無一失。",
        "translation": "Making offerings to the three honored ones is like raising a silken hair; an ascetic who vows to give by means of a kindness spell says, 'According to his words, I'll obtain it, and nothing will be lost.'",
        "source": "T03n0152_004:0024a08_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩執志度無極行持戒如是。」",
        "translation": "This is how a bodhisattva adheres to the precept of the infinite practice of perfection of will.\"",
        "source": "T03n0152_004:0024a10_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六度集經卷第四",
        "translation": "Sutra on the Collection of the Six Perfections, Volume 4",
        "source": "T03n0152_004:0024a12_0",
        "is_bad_quality": false
    }
]