[
    {
        "source_sentence": "佛本行集經卷第三十九",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Volume 39",
        "source": "T03n0190_039:0833b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隋天竺三藏闍那崛多譯",
        "translation": "Sui Tianzhu Tripiṭaka Jñānagupta Translation",
        "source": "T03n0190_039:0833b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "娑毘耶出家品下",
        "translation": "Second Chapter of the Sāvâstivāda Tradition",
        "source": "T03n0190_039:0833b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，娑毘耶波梨婆闍，問富蘭那迦葉等義，如上所說，云何比丘？",
        "translation": "\"At the time, Sadvīpa-rīvaja asked Pūraṇa-kāśyapa and the others what they meant, as explained above, and what monk did they mean?",
        "source": "T03n0190_039:0833b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至云何名為求道？",
        "translation": "\"How is the path called seeking?",
        "source": "T03n0190_039:0833b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時娑毘耶如是諮問迦葉語已，而迦葉等，領受言義，心意錯亂，不能報答。",
        "translation": "After consulting Kāśyapa in this way, he and the others accepted their words, but their minds were so confused that they couldn't respond.",
        "source": "T03n0190_039:0833b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不逮及彼之義意，增復嚬皺，眉頟赧縮，現為三分，心生怨恨，瞋恚憤怒，無事唱呴。",
        "translation": "Because they hadn't grasped their meaning, they wrinkled their brows and blushed, and now they're in three parts, resentful, angry, and shouting about nothing.",
        "source": "T03n0190_039:0833b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時娑毘耶波梨婆闍，作如是念：『此之長老，我所諮問，不解答對微塵等義，又領我意，倒錯參差，不能得解，文句蹇澁，更重慚恧，而生瞋恨，無事大呼。』",
        "translation": "Sadvīpaṇi-vārṣika then had this thought, 'This elder, when I asked him a question, didn't answer it with respect to such minutiae as their meanings, didn't understand my meaning in a way that was incorrect and contradictory, and didn't understand the text in a way that was awkward and contradictory, which further aggravated his sense of shame, made him angry, and shouted without incident.'",
        "source": "T03n0190_039:0833b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，娑毘耶波梨婆闍，於富蘭那迦葉之邊生厭離已，而背捨去，往摩娑迦梨劬奢梨及尼乾邊。",
        "translation": "\"After becoming disillusioned with the side of Pūraṇa-kāśyapa, Sābhijā-pārijāta turned his back and left, going to the side of Mahāsāṃkārikā and Gaṅgā-śāstra.",
        "source": "T03n0190_039:0833b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既到彼已，乃至共於尼乾子，面共相慰喻，美言問訊事情訖了，却住一面。",
        "translation": "Once they arrived there, they shared a conversation with Nirgrantha, spoke nicely, exchanged greetings, and finished their business, then stayed to one side.",
        "source": "T03n0190_039:0833b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其娑毘耶波梨婆闍，問尼乾等，如上所說，於義云何名為比丘，乃至求道。",
        "translation": "He asked Nirgrantha and the others, \"As was explained above, what is the meaning of this monk, even as he seeks the path?",
        "source": "T03n0190_039:0833b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其尼乾子得娑毘耶如是問已，心意錯亂不能報答。",
        "translation": "After he was asked this question by Sapiṇḍa, the Nirgrantha was confused and couldn't answer it.",
        "source": "T03n0190_039:0833b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時娑毘耶作如是念：『此諸長老，遂不能解微塵等義，而我問已心意迷荒，不能領解，復增嗔恚，叫喚如前。』",
        "translation": "He then thought, 'These elders therefore don't understand the meaning of subtle things, and after I asked them, their minds were so confused that they couldn't comprehend it, and they became angry and called out as before.'",
        "source": "T03n0190_039:0833b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時娑毘耶心如是念：『頗復世間更別有人，或復沙門，或婆羅門，而世間稱是一切智真阿羅漢，有如是者，我往彼邊問心所疑，若得領解，我當承事供養頂禮晨夕不離。』",
        "translation": "This is what Sābhī thought, 'Could it be that there's another person in the world, another ascetic or a Brāhmaṇa, who's known in the world as a true arhat of omniscience, and there's such a person, to whom I'd go and ask about my doubts, and if I could understand them, I'd serve, support, bow to, and not leave them day or night?'",
        "source": "T03n0190_039:0833b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，娑毘耶復如是念：『大沙門今在波羅[木*奈]鹿野苑中諸仙居處，世間人言智阿羅漢大有聰慧，我今當至彼沙門邊問所疑義。』",
        "translation": "\"Again, Sthavira thought, 'Now, that great ascetic is living among the sages in the Deer Preserve of Bārā [muni*na], and people in the world say that the arhat of wisdom is very intelligent, so now I will go to that ascetic and ask him about the meaning of my doubts.'",
        "source": "T03n0190_039:0833c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼復更作如是思惟：『此處沙門，或婆羅門，老年宿德，經多時來修行梵行，各各堪作諸國王師，世間各言聰明智慧大阿羅漢，所謂富蘭那迦葉等，及尼乾子。",
        "translation": "Again, he thought, 'Some ascetic or brāhmaṇa here is old and virtuous, has cultivated the religious practice for a long time, and is each capable of serving as a teacher to the kings of various countries, and each is said by the world to be a great arhat of intelligence and wisdom, such as Pūraṇa-kāśyapa and Nirgrantha.",
        "source": "T03n0190_039:0833c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等我問尚自不知，況此沙門年少已來，出家未久，我今所問云何得解？』",
        "translation": "I don't even know what they're asking, so why wouldn't this ascetic, who's been young and hasn't been a monk for a long time, understand what I'm asking now?'",
        "source": "T03n0190_039:0833c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復重思惟：『彼之沙門不可輕忽，不可欺陵。",
        "translation": "\"Again, he thought, 'That ascetic mustn't be taken lightly and mustn't be deceived.",
        "source": "T03n0190_039:0833c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0190_039:0833c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有沙門，雖復年少，而或聰明，有大智慧，不可得知，我今但當至於彼處大沙門邊問心所疑。』",
        "translation": "'Although some ascetics may be young or intelligent and have great wisdom that can't be discerned, I should now go over to that great ascetic and ask about the doubts of his mind.'",
        "source": "T03n0190_039:0833c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，娑毘耶波梨婆闍往詣佛所，遙見世尊，乃至猶如虛空之中眾星莊嚴，在於眾中宣說法要。",
        "translation": "\"When Sapiṇḍapārijā went to the Buddha, he saw the Bhagavān from a distance, up to the point where he was like a star adorned in the sky, in the midst of all the people, explaining the essentials of the Dharma.",
        "source": "T03n0190_039:0833c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見已心生信行之想：『此必是彼如前所聞如來、世尊、多陀阿伽度、阿羅呵、三藐三佛陀，無有異也。』",
        "translation": "After seeing that, he had the mental notion of faith and practice, 'This must be the Tathāgata, the Bhagavān, the Tathāgata Agastya, the Ārāha, and the Samyak-saṃbuddha that we've heard about so far, there's no difference.'",
        "source": "T03n0190_039:0833c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即詣佛所。",
        "translation": "He then went to the Buddha's place.",
        "source": "T03n0190_039:0833c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到佛所已，即共世尊，對面美言，巧語慰喻，種種談說，言訖却坐退一面已。",
        "translation": "After arriving at the Buddha's place, they shared with the Bhagavān a beautiful conversation, spoke skillfully and eloquently, and talked about various things, and then withdrew to one side after speaking.",
        "source": "T03n0190_039:0833c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其娑毘耶波梨婆闍，即便以偈，而白佛言：「『我是娑毘耶道人，　　故從他方遠來至，　　心有疑欲問大智，　　唯願為我分別說。",
        "translation": "Even after they finished speaking, they sat back and withdrew to one side. That man, Sāvāyastriṃśa, then said to the Buddha in verse, \"I'm Sāvāyastriṃśa, a man of the Way who's come from far away, and I have doubts in my mind that want to ask for great wisdom, so please explain them for me.",
        "source": "T03n0190_039:0833c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若能斷我心所疑，　　一一思惟為我說，　　依我義句次第解，　　分分開曉莫參差。』",
        "translation": "If you can remove the doubts in my mind, contemplate them one by one and explain them for me, understanding them in order based on my explanations and phrases, and then clarifying them in part without confusion, then.'",
        "source": "T03n0190_039:0833c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，娑毘耶說此偈已，默然而住。",
        "translation": "\"After speaking this verse, Saṃbhijña waited silently.",
        "source": "T03n0190_039:0833c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但諸佛法，既有三種神通門說，若可化者即便化之。",
        "translation": "'But there are three ways in which the Buddha's teaching is based on supernormal abilities, and if it's possible to teach them, then I'll teach them.",
        "source": "T03n0190_039:0833c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are the three?",
        "source": "T03n0190_039:0833c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一所謂出現神通，第二名為教示神通，第三名為教行神通。",
        "translation": "The first is called the power of appearing, the second is the power of showing, and the third is the power of teaching and doing.",
        "source": "T03n0190_039:0833c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而世尊為彼娑毘耶波梨婆闍心有所疑，知其心已，向娑毘耶，以偈答曰：「『汝娑毘耶遠道來，　　欲問於我心疑惑，　　汝今可說我當解，　　隨汝所問我領之。",
        "translation": "Knowing his doubts, the Bhagavān answered Sābhidharma in verse, \"You, Sābhidharma, have come a long way to ask about my doubts and confusions, so now you can tell me what I'll understand, and I'll take your questions as they come.",
        "source": "T03n0190_039:0833c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一如問意不令差，　　汝娑毘耶宜早說，　　心心欲請莫疑惑，　　一一如問當廣宣。』",
        "translation": "Just as the question was intended, don't let it be mistaken, so it's appropriate for you to tell it early, and don't doubt it when you want to ask it at heart; one by one, just as the question was asked, you'll explain it in detail.'",
        "source": "T03n0190_039:0834a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊說是偈已，其娑毘耶波梨婆闍作如是念：『我於已前諸處所有，或復沙門，或婆羅門，年耆宿德，久來出家，堪作國師，世間謂言大阿羅漢，智慧聰明。",
        "translation": "\"After the Bhagavān spoke this verse, that man Sadvīya-pārijāta had this thought, 'There were ascetics or priests in many places before me, men of years and years of age and virtue, men who had left home long ago and could serve as national teachers, and men who were said to be great arhats of wisdom and intelligence.",
        "source": "T03n0190_039:0834a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我問彼等心所疑義，然其彼等皆悉倒錯，不能報我。",
        "translation": "I've asked them about the doubts they have in their minds, but they're all mistaken and can't answer me.",
        "source": "T03n0190_039:0834a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不能答我所問義，而其彼等心內懷慚，面作三分，嚬眉皺頟生於瞋恨，無事唱呴。』",
        "translation": "Because they couldn't answer the questions I asked them, their hearts were internally conscience, their faces were three-parted, their brows were furrowed, they were angry, and they squealed without incident.'",
        "source": "T03n0190_039:0834a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，娑毘耶心生希有：『此大沙門我之所問，不嗔不忿，增上清淨容貌凞怡，不作異色，更益光顯，我所諮問，許為我宣，我於彼人，諸根寂靜，不見有錯。』",
        "translation": "Then, Sthavira's mind gave rise to this rare feeling, 'This great ascetic I've questioned doesn't get angry or resentful, has an enhanced, pure appearance that's bright and pleasant, doesn't have a different look, and shines brighter; perhaps he'll proclaim my questions for me, for whom my faculties are quiescent and I see no mistake.'",
        "source": "T03n0190_039:0834a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知如此已，其娑毘耶波梨婆闍，心大歡喜，踊躍遍滿，不能自勝。",
        "translation": "Knowing this, his mind was so overjoyed, it was filled with joy, and he couldn't contain himself.",
        "source": "T03n0190_039:0834a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得歡喜已，即以偈頌，問佛義言：「『大聖云何名比丘？",
        "translation": "After rejoicing, he then asked the Buddha about the meaning of the verse, saying, 'Great sage, what do you call a monk?'",
        "source": "T03n0190_039:0834a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸聖伏者何名伏？",
        "translation": "What is the name of the one who subdues the sages?",
        "source": "T03n0190_039:0834a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　知見何事名為覺？",
        "translation": "What is called awakening when you know and see something?",
        "source": "T03n0190_039:0834a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　唯願世尊為我宣。』",
        "translation": "Please let the Bhagavān proclaim it for me.'",
        "source": "T03n0190_039:0834a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊即以偈頌而答於彼波梨婆闍娑毘耶言：「『苦行無礙求菩提，　　渡諸疑向涅槃岸，　　有有無有悉棄捨，　　梵行漏盡名比丘。",
        "translation": "\"It was then that the Bhagavān answered him, saying in a verse, \"Parivāsa-vijayā, 'Austerities unhindered by practice seek enlightenment, wading through doubt to the shore of nirvāṇa, discarding both existence and nonexistence, and ending the contaminants of the religious practice are called monks.",
        "source": "T03n0190_039:0834a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切捨處正念行，　　於不殺害世間內，　　能得清淨無濁體，　　免脫諸縛名為調。",
        "translation": "He conducts himself with correct mindfulness in all states of equanimity, doesn't kill or harm anyone in the world, attains a pure and unsullied body, and is freed from all fetters, which is called control.",
        "source": "T03n0190_039:0834a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若能內外攝諸根，　　如此降伏是名直，　　厭離此世及後世，　　待時涅槃名善行。",
        "translation": "If he can subdue his internal and external sense faculties in this way, this is called straightforwardness, disillusionment with this world and the next, and waiting for nirvāṇa to come is called good conduct.",
        "source": "T03n0190_039:0834a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於諸劫中勤苦修，　　生死二邊隨業受，　　世間無垢離諸縛，　　是名為覺生死窮。』",
        "translation": "To diligently cultivate throughout the eons, to follow the karmic consequences of the two extremes of birth and death, and to be spotless in the world and free of fetters is called awakening to the end of birth and death.'",
        "source": "T03n0190_039:0834a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，娑毘耶波梨婆闍聞說歡喜，復更以偈而問佛言：「『何等名為修梵行？",
        "translation": "\"Rejoicing at what he heard, Śāviyapālī Vajra again asked the Buddha in a verse, \"What's called cultivating the religious practice?",
        "source": "T03n0190_039:0834b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　沙門清淨復云何？",
        "translation": "What about the purity of the ascetic?",
        "source": "T03n0190_039:0834b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　佛說大智云何調？",
        "translation": "What does the Buddha teach about the regulation of great cognition?",
        "source": "T03n0190_039:0834b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　今問世尊為我解。』",
        "translation": "'Now, I'd like the Bhagavān to explain this for me.'",
        "source": "T03n0190_039:0834b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊還以偈頌而答於彼波梨婆闍娑毘耶言：「『以捨諸罪無垢纏，　　善得禪定正住地，　　獨能超越煩惱海，　　是名為聖梵行人。",
        "translation": "\"At that point, the Bhagavān answered him, saying in verse, \"By freeing himself of the tethers of sins and defilements, he has well attained the correct abode of meditation, and he alone is able to transcend the ocean of affliction, which is called a noble religious practitioner.",
        "source": "T03n0190_039:0834b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　福德積聚捨諸非，　　此世彼世知無惱，　　一切生死除滅故，　　得此證者名沙門。",
        "translation": "He accumulates merit and forgets what's wrong, knows there's no anguish in this or that world, and because all birth and death are removed, he's called an ascetic when he attains this realization.",
        "source": "T03n0190_039:0834b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸有業報悉滅除，　　一切世間諸內外，　　一切天人不能穢，　　如是即名清淨形。",
        "translation": "The effects of all existent karma are all extinguished, all worldly affairs, both internal and external, and all gods and humans can't be defiled, and this is called a pure form.",
        "source": "T03n0190_039:0834b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸縛皆盡無所拘，　　一切世間內外處，　　貪癡瞋恚悉免脫，　　佛說是名大智人。』",
        "translation": "All bonds are ended, there's no restriction, all worldly places inside and out, and all craving, delusion, and ill-will are freed, which the Buddha says is called a person of great wisdom.'",
        "source": "T03n0190_039:0834b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，娑毘耶波梨婆闍既聞說已，復更以偈重問佛言：「『諸佛以何為福田？",
        "translation": "\"After listening to what he had to say, Sapiṇḍapārijā then repeatedly asked the Buddha in verse, \"What do the buddhas take as their field of merit?",
        "source": "T03n0190_039:0834b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何巧知善方便？",
        "translation": "How do we skillfully know good skillful means?",
        "source": "T03n0190_039:0834b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何名為大仙聖？",
        "translation": "What is called a great sage?",
        "source": "T03n0190_039:0834b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　唯願世尊為我宣。』",
        "translation": "Please let the Bhagavān proclaim it for me.'",
        "source": "T03n0190_039:0834b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊還以偈頌而答於彼波梨婆闍娑毘耶言：「『諸剎一一分別知，　　諸梵諸天堪受供，　　果報執著解縛脫，　　如是乃名為福田。",
        "translation": "\"At the time, the Bhagavān also answered him in verse, saying, \"Known separately as each of the bhūmis, Brahmā and gods are able to accept offerings that are free of attachment to the results, and this is called a field of merit.",
        "source": "T03n0190_039:0834b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　業根報子所從生，　　諸梵諸天悉分別，　　能以諸忍斷根本，　　如是名為巧智知。",
        "translation": "The karmic roots of retribution from which sons are produced are discriminated by Brahmā and the gods, and they are able to cut off their roots with patience, which is called skillful, intelligent knowing.",
        "source": "T03n0190_039:0834b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　彼此選擇白淨因，　　一切世間內外有，　　無我不攝無處所，　　如是方便名善權。",
        "translation": "They choose white pure causes for each other, all worldly existences inside and out, have no self and no place, and thus are called skillful authorities.",
        "source": "T03n0190_039:0834b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切諸法有無知，　　一切世間無內外，　　此世天人得恭敬，　　無礙獨脫是名仙。』",
        "translation": "Knowing that all things exist and don't exist, that all worlds are neither internal nor external, that gods and humans in this world are honored, and that unhindered independence is called immortality.'",
        "source": "T03n0190_039:0834b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，娑毘耶波梨婆闍既聞說已，復更以偈重問佛言：「『以何得故名為聞？",
        "translation": "\"After listening to what was said, Sapiṇḍapārijā then repeated the question to the Buddha in verse, \"What is the reason it's called listening?",
        "source": "T03n0190_039:0834c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何隨順及精進？",
        "translation": "How do we accord with and exert ourselves?",
        "source": "T03n0190_039:0834c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何名為大龍者？",
        "translation": "\"What is called the great dragon?",
        "source": "T03n0190_039:0834c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　唯願世尊為說之。』",
        "translation": "Please let the Bhagavān explain it for you.'",
        "source": "T03n0190_039:0834c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊還以偈頌而答於彼波梨婆闍娑毘耶言：「『一切諸法悉聞知，　　所有諸罪功德等，　　超越無復疑惑刺，　　一切不著是名聞。",
        "translation": "\"At the time, the Bhagavān also answered him in verse, saying, \"He has heard all the teachings, has heard all the sins and virtues, has transcended the thorn of doubt, and is not attached to anything that's known.",
        "source": "T03n0190_039:0834c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　名色皆是虛妄因，　　內外根塵是患本，　　如是諸處解脫已，　　佛說名為隨順心。",
        "translation": "Names and forms are all false causes, internal and external sense-fields are the basis of affliction, and once these various places are freed, the Buddha teaches it's called a compliant mind.",
        "source": "T03n0190_039:0834c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　捨離一切諸罪縛，　　離地獄苦須勇猛，　　解脫彼等不染著，　　如是名為精進人。",
        "translation": "Freed from the bonds of all sins, he must be courageous to escape the suffering of hell, liberating himself from such attachments and not defiling them, and thus he's called a person of zeal.",
        "source": "T03n0190_039:0834c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　世間有愛皆遠之，　　繫縛解脫皆悉斷，　　諸漏已盡無復刺，　　如是體者名為龍。』",
        "translation": "He avoids all worldly attachments, completely ends all fetters and liberation, ends the contaminants and has no more thorns, and thus is called a dragon.'",
        "source": "T03n0190_039:0834c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，娑毘耶波梨婆闍既聞說已，復更以偈重問佛言：「『以何等故名為受？",
        "translation": "\"After listening to what he said, Sadvīpa-rīvaja then repeatedly asked the Buddha in verse, \"What is called sensation?",
        "source": "T03n0190_039:0834c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何說聖及行行？",
        "translation": "How do we explain the practice of sages and the practice of practice?",
        "source": "T03n0190_039:0834c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　何緣名為求道人？",
        "translation": "What are the conditions for being called a seeker of the Way?",
        "source": "T03n0190_039:0834c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　今問世尊為我說。』",
        "translation": "'Now, I'd like the Bhagavān to explain this for me.'",
        "source": "T03n0190_039:0834c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊還以偈頌而答於彼波梨婆闍娑毘耶言：「『所有韋陀一一選，　　或於沙門婆羅門，　　其邊領解既證知，　　於彼各各皆受取。",
        "translation": "\"At that point, the Bhagavān answered him in verse, saying, \"Suppose there are Vedas who are chosen individually or ascetics or priests who have comprehended their limits and realized them, and each of them is grasped.",
        "source": "T03n0190_039:0834c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　截割邪見羅網斷，　　彼智不復受有胎，　　三種相想埿已除，　　不作分別是名聖。",
        "translation": "After cutting off the net of wrong views, their knowledge is no longer subject to birth, and once the three conceptions of form are removed, this is called noble.",
        "source": "T03n0190_039:0834c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　正得諸神通已盡，　　平等一切諸法知，　　能達善逝諸世間，　　如是解者名行行。",
        "translation": "Once he has ended his correctly attained supernormal powers and has knowledge of all dharmas equally, he can reach the well-gone worlds with such understanding that he's called practicing practice.",
        "source": "T03n0190_039:0834c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸法所有苦報者，　　若上若下若中間，　　名色境界能遍知，　　如是之人名求道。』",
        "translation": "Whether it's above, below, or between, he can completely know the realm of name and form, and such a person is called someone who seeks the path.'",
        "source": "T03n0190_039:0834c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，娑毘耶波梨婆闍所有諮問世尊之義，皆悉稱適於其本心，既歡喜已頂禮佛足，合十指掌瞻仰而歎佛世尊言：『善哉！",
        "translation": "\"After rejoicing, he bowed his head at the Buddha's feet, put his palms together, looked up at him, and praised the Bhagavān, saying, 'Good!'",
        "source": "T03n0190_039:0834c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0190_039:0835a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間所有六十二見，皆無所用，於世間中，此等皆是虛妄之法。",
        "translation": "All of the world's sixty-two views are useless, and in the world they're all false dharmas.",
        "source": "T03n0190_039:0835a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今歸依無上世尊，唯世尊能悉分別知，是大丈夫，唯世尊能善解說法，唯世尊能知一切道，唯世尊能度諸苦海，唯世尊能永盡諸漏，唯世尊有最大威德，唯世尊獨多有智慧，唯世尊能得阿耨多羅三藐三菩提。』",
        "translation": "I now rely on the Bhagavān, the only one who can discern them all, the Bhagavān, the only one who can skillfully explain the teaching, the only one who knows all paths, the only one who can cross the ocean of suffering, the only one who can permanently end the contaminants, the only one who has the greatest authority, the only one who alone has much wisdom, and the only one who can attain supreme, perfect enlightenment.'",
        "source": "T03n0190_039:0835a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而說偈讚：「『我今頂禮大丈夫，　　實行放光明普照，　　能於天人世間內，　　善開甘露鼓之門，　　我前所有疑惑心，　　唯世尊能為我解。",
        "translation": "He then spoke a verse in praise, \"Now, I salute a great man whose true actions shine brightly and universally, who can skillfully open the door of the ambrosial drum within the world of gods and humans, and who alone can resolve my previous doubts and confusions.",
        "source": "T03n0190_039:0835a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　世尊既是大仙覺，　　諸塵垢盡無有餘，　　其後更不受有身，　　一切生因皆散滅，　　世尊已得清涼處，　　知足淨心常實行。",
        "translation": "Since the Bhagavān is a great enlightened man, the defilements are ended without remainder, there's no more body thereafter, all causes of birth are dispersed, the Bhagavān has attained a cool place, and his contented, pure mind is always practiced.",
        "source": "T03n0190_039:0835a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如是世尊猶若龍，　　最大丈夫金口說，　　帝釋一切諸天等，　　諸仙諸聖皆樂聞。",
        "translation": "Thus, the Bhagavān is like a dragon, the greatest of whom speaks with a golden mouth, and all the gods of Indra and Indra, the sages and saints are delighted to hear it.",
        "source": "T03n0190_039:0835a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　世尊既是真覺人，　　世尊善能教導物，　　世尊能降伏魔眾，　　世尊能斷諸使纏。",
        "translation": "Since the Bhagavān is a truly enlightened person, the Bhagavān is well able to teach things, the Bhagavān is able to subdue Māra, and the Bhagavān is able to end the tethers of tendencies.",
        "source": "T03n0190_039:0835a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　自已度脫復度他，　　於罪福中皆平等，　　超越不貪著一切，　　天人世間明了知。",
        "translation": "He liberates himself and liberates others, is equal in sins and merits, transcends and doesn't cling to all, and is clearly understood by gods and humans in the world.",
        "source": "T03n0190_039:0835a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　唯佛至真無上尊，　　已過一切諸邪道，　　諸漏有因皆滅盡，　　猶如十五夜月明，　　諸星圍遶遍滿空，　　如是照耀世間內，　　識及名色壽命等。",
        "translation": "Only the Buddha, the supreme one, has surpassed all wrong paths, ended all contaminants and causes, is like the moon shining brightly on the fifteenth night, surrounded by stars that fill the sky, thus shining in the world, and the lifespan of consciousness and name and form are equal.",
        "source": "T03n0190_039:0835a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　王舍所住諸人民，　　有山名為毘富羅，　　一切最勝最為上。",
        "translation": "Of all the people living in Rājagṛha, there's a mountain named Vipula that's the most excellent and the highest of all.",
        "source": "T03n0190_039:0835a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　又如諸龍雪山最，　　飛行之者空最高，　　諸流海水最為深，　　又諸星中月為最，　　若欲歸命調伏者，　　唯有歸命無上人。",
        "translation": "Like the dragons and snow-capped mountains that are the tallest, the flying ones that are the highest in the sky, the currents and waters that are the deepest, and the moon that is the deepest among the stars, if someone wants to be ordered to be disciplined, they must be ordered to the unsurpassed person.",
        "source": "T03n0190_039:0835a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　歸命世間最勝尊，　　歸命正馭人中勝，　　歸命無上尊善逝，　　歸命無等等至真。",
        "translation": "His life is to be revered as the most honored in the world, the most honored among those who correctly harness, the most honored among the unsurpassed, the well gone, and the most true among the peerless.",
        "source": "T03n0190_039:0835b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　猶如祭祀火最尊，　　意論唯呪術為最，　　人中王為最自在，　　諸河大海最為寬，　　諸星唯月最為光，　　諸明唯日最為盛，　　上下六道善惡趣，　　所謂三界諸世間，　　一切有形天及人，　　唯有世尊最為首，　　是故我今合十指，　　頭面頂禮無上尊。』",
        "translation": "He's like the most venerable fire worshipper, the greatest in mental discourse except for incantations, the most sovereign among humans, the widest of rivers and seas, the brightest of stars except for the moon, the brightest of suns, the six destinies of good and evil above and below, the three realms and worlds, all the formable gods and humans, and only the Bhagavān is the foremost, so now I join my ten fingers and bow with my head to the unsurpassed one.'",
        "source": "T03n0190_039:0835b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，娑毘耶說如是偈讚如來已，復白佛言：『善哉！",
        "translation": "\"After he spoke this verse in praise of the Tathāgata, Sāvāṃpati then said to the Buddha, 'Good!",
        "source": "T03n0190_039:0835b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0190_039:0835b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊！",
        "translation": "Venerable Bhagavān!",
        "source": "T03n0190_039:0835b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈悲憐愍，聽我出家，并乞與我受具足戒。』",
        "translation": "Have compassion and mercy, hear me leave home, and beg me to accept the full set of precepts.'",
        "source": "T03n0190_039:0835b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，佛告娑毘耶言：『善來善來！",
        "translation": "The Buddha then addressed Sapiṇḍa, saying, 'Good, good!",
        "source": "T03n0190_039:0835b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝娑毘耶！",
        "translation": "You, *Sarvâstivāda!",
        "source": "T03n0190_039:0835b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於我自說法行之中，正盡諸苦得解脫故。』",
        "translation": "In the midst of my own practice of teaching the Dharma, I'm correctly ending suffering and attaining liberation.'",
        "source": "T03n0190_039:0835b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，長老娑毘耶身即成比丘，滿具足戒。",
        "translation": "At that point, the elder layman Saṃbhijña himself became a monk and fulfilled the full set of precepts.",
        "source": "T03n0190_039:0835b13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其娑毘耶出家未久，及受具足，行住坐臥，獨無伴侶，不曾染著，謹慎身口，不敢放逸，為求道故，如救頭然。",
        "translation": "Not long after he left home and became fully ordained, he walked, sat, and lay down alone without companions, didn't become defiled, was careful with his body and speech, didn't dare to be careless, and sought the path for its sake like a head monk.",
        "source": "T03n0190_039:0835b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是行持未久之間，其善男子，正信勇猛，捨家出家，欲求無上清淨梵行，現見諸法，自心證知言：『我已盡一切生死，得梵行報，不受後有，所作已辦，自如是知。』",
        "translation": "While he's been practicing this way for a while, that good man of correct faith and courage who leaves home and renounces the world in order to pursue the unsurpassed pure religious practice now sees all things and personally recognizes it, saying, 'I have ended all birth and death, attained the rewards of the religious life, won't be subject to a later existence, and have accomplished what I've done, and I know it this way.'",
        "source": "T03n0190_039:0835b16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其娑毘耶既已證知如是之處，得羅漢果，心善解脫。",
        "translation": "Once he has realized this, his sapiens attain the fruit of the arhat, and his mind is well liberated.",
        "source": "T03n0190_039:0835b20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，世間凡成九十三阿羅漢，第一世尊乃至最後及娑毘耶。",
        "translation": "At the time, there were ninety-three arhats in the world, from the first Bhagavān to the last one, Sābhidharma.",
        "source": "T03n0190_039:0835b21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊成道之後，在波羅[木*奈]鹿野苑內，通及佛身，合八人，六月十六日安居，至九月十五日，合九十三人解夏。",
        "translation": "\"At the time, after the Bhagavān had accomplished his path, he was staying at Ṛṣipatana in the Deer Preserve of Bārā [muni*na] with the Buddha's body, comprising eight people, for sixteen days on June and ninety-three people until the fifteenth day of the ninth month, when they finished their summer retreat.",
        "source": "T03n0190_039:0835b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛本行集經教化兵將品第四十三上",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Chapter 43 on Teaching the Generals",
        "source": "T03n0190_039:0835b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，他方有諸人輩，或從處處諸邑聚落及諸國土，各各相喚，意並願樂欲求出家乞具足戒，來波羅[木*奈]，到於佛邊，白世尊言：『與我出家受具足戒。』",
        "translation": "\"At the time, a group of people from various places, or from various towns, villages, and lands, each summoned with the same intention and desire to leave home and seek full ordination, came to Para[mu*na] and said to the Bhagavān, 'Grant me full ordination as a renunciant.'",
        "source": "T03n0190_039:0835b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，諸舊比丘應接勞乏。",
        "translation": "Because of this, the older monks accepted their trouble.",
        "source": "T03n0190_039:0835c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等諸人求欲出家，聲響喧閙，以此因緣，惱亂世尊，不得閑靜。",
        "translation": "Those people seeking to leave home make a lot of noise, and this is the cause that disturbs the Bhagavān and prevents him from being at peace.",
        "source": "T03n0190_039:0835c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊於一時間，獨坐靜室，如是思惟：『今者諸人從於四遠他方聚落國土而來，至於此處，意如是念，如來與我出家受具。",
        "translation": "\"At the time, the Bhagavān was sitting alone in a quiet room, thinking, \"Now, these people have come from four faraway lands and villages, and they've arrived here with the idea that the Tathāgata will accept me as a renunciant.",
        "source": "T03n0190_039:0835c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，其諸人等，意欲規求遠來疲惓，又復為我作於擾亂。",
        "translation": "Because of this, those people are weary of seeking to come from afar and cause trouble for me.",
        "source": "T03n0190_039:0835c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今可遣諸比丘等，令其處處至於他方聚落城邑教化一切，若有諸人欲求出家受具戒者，如法當與。』",
        "translation": "Now, I can send monks and others to villages and cities in other places to teach them all, and if they want to leave home and receive the full set of precepts, I'll give them to them according to the teaching.'",
        "source": "T03n0190_039:0835c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊作是念已，於晨朝時，從房而出，以此因緣，集聚一切諸比丘眾。",
        "translation": "\"After he had this thought, the Bhagavān left his room in the early morning and gathered all the monks together for this reason.",
        "source": "T03n0190_039:0835c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既聚集已，而告之言：『汝等比丘！",
        "translation": "Once they had gathered them, he addressed them, saying, 'You monks!",
        "source": "T03n0190_039:0835c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今應當知！",
        "translation": "Now you should know!",
        "source": "T03n0190_039:0835c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我在空閑靜寂之室，作是思惟，如上所說，乃至汝等，向於他方，與其出家，與受具足，勿令其來，既自勞苦復妨亂他。』",
        "translation": "I was in a quiet, empty house, and I thought, 'Thus I have explained it, even you, go to another place, renounce your home, and accept the full set of precepts; don't let them come, for they will trouble themselves and disturb others.'",
        "source": "T03n0190_039:0835c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是告已，更重語言：『我今教勅汝諸比丘，至於他方聚落城邑，若有人來欲求出家受具戒者，汝當與其出家受具。』",
        "translation": "After thus telling him, he repeated his words, 'Now, I've instructed you monks to go to a village or town in another place, and if someone comes who wants to leave home and receive the full set of precepts, you must give them to him to leave home and receive the full set.'",
        "source": "T03n0190_039:0835c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復告比丘：『若彼來欲出家之時，汝等應須作如是事，先當為其剃除鬚髮；既剃落已，即教令著袈裟色衣，其著衣時，齊整服飾，偏袒右臂，教在眾前，右膝著地，教令頂禮諸比丘足；禮已還起，在比丘前跪坐，教令合十指掌，作如是語：「我某甲，歸依佛、歸依法、歸依僧。」",
        "translation": "Again, I told the monks, 'When they come and wish to leave home, you must do this. First, shave off their hair; once it's shaved off, instruct them to put on robes of the color of the reddish-brown robe; when they put on their robes, they should be neatly dressed, bare their right arm, instruct them to stand in front of the assembly, kneel on their right knee, and instruct them to bow at the feet of the monks; after paying homage, they should get up, kneel down in front of the monks, instruct them to join their palms together, and say, \"I, a certain person, take refuge in the Buddha, in the Dharma, and in the saṃgha.\"'",
        "source": "T03n0190_039:0835c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等比丘！",
        "translation": "You monks!",
        "source": "T03n0190_039:0835c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今已後，依我勅教，若有人來求欲出家，受戒三歸，即得具足。』",
        "translation": "From now on, according to my instructions, if someone comes seeking to leave home and accepts the three refuges of the precepts, they'll be complete.'",
        "source": "T03n0190_039:0835c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊還在於彼波羅[木*奈]城鹿苑坐夏，告諸比丘作如是言：『汝諸比丘！",
        "translation": "\"At the time, the Bhagavān was still sitting in the summer retreat in the Deer Preserve of Pola [Munai] and addressed the monks, saying, 'You monks!",
        "source": "T03n0190_039:0835c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若當知我已得解脫，應於一切諸天人中汝等行行，為令多人得利益故，為令多人得安樂故，為世間求當來利益及安樂故。",
        "translation": "\"If you knew that I had attained liberation, you would conduct yourself among all the gods and humans for the benefit of many, for the comfort of many, and for the sake of the world in search of future benefit and comfort.",
        "source": "T03n0190_039:0835c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲行至他方聚落，獨自得去不須二人。",
        "translation": "If you want to travel to a village in another place, you can go there alone, not with two people.",
        "source": "T03n0190_039:0836a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復比丘！",
        "translation": "Again, monks!",
        "source": "T03n0190_039:0836a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等若至他方聚落，為於多人生憐愍故，攝受彼故，當為說法初中後善，其義微妙，具足無缺。",
        "translation": "If you go to a village in another place and take in many people out of pity for them, you will preach to them a teaching that's good in the beginning, middle, and end, whose meaning is subtle and complete without fail.",
        "source": "T03n0190_039:0836a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等比丘！",
        "translation": "You monks!",
        "source": "T03n0190_039:0836a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當說梵行，有諸眾生，少諸塵垢，薄於結使，諸根成熟，恐畏不能得聞正法，即不能得知於法相。』",
        "translation": "'When you teach the religious practice, there are sentient beings with few defilements, few bonds, and matured faculties who are afraid that they won't be able to hear the right teaching, which means they won't be able to understand the characteristics of the teaching.'",
        "source": "T03n0190_039:0836a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛告比丘：『我從今日漸當移去行向優婁頻螺聚落，詣兵將村，而為彼等說法教故。』",
        "translation": "\"The Buddha told the monks, 'From today, I will gradually move away and go to the village of Uruvilvā and visit the general's village and explain the teaching to them.'",
        "source": "T03n0190_039:0836a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊即說偈言：「『比丘我今度諸苦，　　已作自利復益他，　　所有多人苦未除，　　今須為其作憐愍。",
        "translation": "At that point, the Bhagavān spoke in verse, saying, 'Monks, now I've crossed over the suffering, and I've done it for my own benefit and for the benefit of others.",
        "source": "T03n0190_039:0836a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　是故汝等比丘輩，　　各各宜應獨自行，　　我今亦復從此移，　　欲向頻螺聚落所。』",
        "translation": "Therefore, it's appropriate for each of you monks to go on your own, and I'll also move from here to the village of Virūḍhaka.'",
        "source": "T03n0190_039:0836a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，魔王波旬密來往詣佛所，到佛所已，即便向佛而說偈言：「『汝為諸縛之所縛，　　亦同諸天人等有，　　既被一切繩所繫，　　沙門汝不脫網羅。』",
        "translation": "\"It was then that Māra King Pāpīyān came to the Buddha, and when he arrived, he spoke to him in verse, saying, \"You're bound by various fetters, just like all gods and humans, and since you're tied by all cords, you ascetic can't escape the net.\"",
        "source": "T03n0190_039:0836a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊聞此偈已，即便如是思惟念言：『此是魔王波旬語也。』",
        "translation": "\"After hearing this verse, the Bhagavān then even reflected on it in this way, saying, 'This is the speech of Māra King Pāpīyān.'",
        "source": "T03n0190_039:0836a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是知已，還以偈報魔波旬言：「『我久已脫一切縛，　　天人所有我悉無，　　我此諸縛既離身，　　降汝波旬更何道？』",
        "translation": "Knowing this, he also reported the verse to Māra Pāpīyān, saying, 'I've long since been freed from all fetters, and I have nothing that belongs to gods or humans. Having parted with these fetters, what path would I take to subjugate you, Pāpīyān?'",
        "source": "T03n0190_039:0836a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊重更以偈毀辱於彼魔王波旬，作如是言：「『一切色聲香味觸，　　此是五欲法染人，　　我今悉已一切除，　　降汝惡魔波旬訖。』",
        "translation": "\"At the time, the Bhagavān further insulted that demon king Pāpīyān with a verse, saying, 'All forms, sounds, smells, tastes, and tactile objects are the five defiled desires of a person, and now I've removed them all and subjugated you to the evil demon Pāpīyān.'",
        "source": "T03n0190_039:0836a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，波旬聞此偈已，作是思惟：『沙門瞿曇已知我心。』",
        "translation": "\"After hearing this verse, Pāpīyān then thought, 'The ascetic Gautama has known my mind.'",
        "source": "T03n0190_039:0836a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生大苦惱，深自悔恨，從彼地方忽然不現。",
        "translation": "Greatly distressed and deeply remorseful, he suddenly disappeared from that place.",
        "source": "T03n0190_039:0836b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，諸比丘同白佛言：『善哉！",
        "translation": "\"The monks then all said to the Buddha, 'Good!",
        "source": "T03n0190_039:0836b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0190_039:0836b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有人來至於我所，問我等言：「尊者比丘！",
        "translation": "If someone comes to us and asks us, \"Venerable monks!",
        "source": "T03n0190_039:0836b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何名沙門及婆羅門？」",
        "translation": "What are called ascetics and brāhmaṇas?\"",
        "source": "T03n0190_039:0836b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等比丘於彼聞已，當作云何報答於彼？』",
        "translation": "After we monks heard about it, how should we repay them?'",
        "source": "T03n0190_039:0836b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，佛告諸比丘言：『若有人問，云何沙門及婆羅門？",
        "translation": "\"It was then that the Buddha addressed the monks, saying, 'Suppose someone asks, 'What are ascetics and priests?'",
        "source": "T03n0190_039:0836b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘出家有如是者，汝等比丘！",
        "translation": "Such is the case with monks who leave home, you monks!",
        "source": "T03n0190_039:0836b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若知是時，應當正知，知已應當正心觀察。』",
        "translation": "If you know this, you should correctly know it, and after knowing it, you should correctly examine it with your mind.'",
        "source": "T03n0190_039:0836b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊因此事緣，因此言次，為諸比丘而說偈言：「『永除諂曲及我慢，　　貪恚欲盡無處貪，　　如是清淨體性常，　　彼者沙門比丘是。",
        "translation": "\"It was then that the Bhagavān addressed the monks for this reason and in turn spoke this verse, saying, \"Such are the ascetic monks who permanently remove flattery and self-conceit, end craving and ill-will, and have no place for craving, and are thus pure and permanent in nature.",
        "source": "T03n0190_039:0836b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸罪漏盡號梵志，　　精進苦行名沙門，　　彼等垢盡出塵勞，　　是真出家破諸惡。』",
        "translation": "He's called a priest when the contaminants of sins are ended, an ascetic when he makes effort and ascetic practices, an ascetic when his pollution is ended and his toil is removed, and he's really leaving home and refuting the evils.'",
        "source": "T03n0190_039:0836b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，諸比丘聞此偈已，復白佛言：『善哉！",
        "translation": "\"After the monks heard this verse, they again said to the Buddha, 'Good!",
        "source": "T03n0190_039:0836b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0190_039:0836b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等比丘乞食之時，須作何言？",
        "translation": "When we monks beg for food, what words must we say?",
        "source": "T03n0190_039:0836b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或復言謂施於我食？",
        "translation": "Or do you say, \"Give me food?",
        "source": "T03n0190_039:0836b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或復直言布施食也？",
        "translation": "Or do they again directly say that they are giving alms for food?",
        "source": "T03n0190_039:0836b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等云何方便乞食？』",
        "translation": "How can we skillfully beg for food?'",
        "source": "T03n0190_039:0836b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，佛告諸比丘言：『汝諸比丘！",
        "translation": "\"It was then that the Buddha addressed the monks, saying, 'You monks!",
        "source": "T03n0190_039:0836b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不應如是依汝所言。",
        "translation": "It shouldn't be like this, according to what you say.",
        "source": "T03n0190_039:0836b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0190_039:0836b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須護物心。』",
        "translation": "'You must guard the minds of your fellow beings.'",
        "source": "T03n0190_039:0836b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，世尊以偈報於諸比丘言：「『智人乞食無有言，　　亦不指點云與食，　　聖者默然側立念，　　是名乞食真比丘。",
        "translation": "The Bhagavān then reported to the monks in verse, saying, \"A wise man who begs for food without saying anything and doesn't point and say 'Give me food,' and a holy man who stands silently to one side and thinks, 'This is called a true monk who begs for food.'",
        "source": "T03n0190_039:0836b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若有智者乞食時，　　但當諦視一邊住，　　彼人若見如此已，　　即知是乞食沙門。』",
        "translation": "If there's a wise man who begs for food, he must simply look to one side and stand there, and if people see him like that, they'll know he's an ascetic begging for food.'",
        "source": "T03n0190_039:0836b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，諸比丘復問佛言：『若復有人，生信心已，乞我等食，恭敬我等，我等比丘更作何言？",
        "translation": "\"The monks then again asked the Buddha, 'Suppose another person gives rise to faith, begs for our food, and honors us, what else would we monks say?'",
        "source": "T03n0190_039:0836b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為當語彼：「汝大吉利？」",
        "translation": "Why don't you say to them, \"Are you very fortunate?\"",
        "source": "T03n0190_039:0836b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為當語彼：「汝大安隱？」",
        "translation": "Why don't you say to them, \"Are you greatly at ease?\"",
        "source": "T03n0190_039:0836b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為當語彼：「汝大功德？」",
        "translation": "Why don't you say to them, \"Your great merit?\"",
        "source": "T03n0190_039:0836b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為當語彼：「我今受已，汝得多福？」",
        "translation": "Why don't you say to them, \"How much more fortunate will you be after I receive it now?\"",
        "source": "T03n0190_039:0836c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為當語言：「汝無有福？」",
        "translation": "Why don't you say, \"Are you without merit?\"",
        "source": "T03n0190_039:0836c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等比丘當云何言？",
        "translation": "What will we monks say?",
        "source": "T03n0190_039:0836c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願教導。』",
        "translation": "Please teach him.'",
        "source": "T03n0190_039:0836c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，佛告諸比丘言：『汝諸比丘！",
        "translation": "\"At that point, the Buddha addressed the monks, saying, 'You monks!",
        "source": "T03n0190_039:0836c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不應如是依汝所說。",
        "translation": "I shouldn't thus rely on what you say.",
        "source": "T03n0190_039:0836c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今方便教示汝等，當作如是。』",
        "translation": "Now, I'll teach you skillfully and instruct you to do likewise.'",
        "source": "T03n0190_039:0836c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以偈說言：「『布施增長大福德，　　忍辱一切怨讎無，　　善人棄捨於諸非，　　離欲自然得解脫。",
        "translation": "He spoke in verse, saying, 'Giving increases great merit, forbearance makes all enemies disappear, and good people abandon what's wrong and naturally attain liberation by abandoning desire.",
        "source": "T03n0190_039:0836c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　修福常得安隱樂，　　所求易辦多種饒，　　現世速得寂定心，　　然後證彼涅槃處。』",
        "translation": "Cultivating virtue always produces peace and happiness, makes what's sought easy to accomplish in many ways, and quickly attains a tranquil, concentrated state of mind in the present life before realizing that nirvāṇa place.'",
        "source": "T03n0190_039:0836c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊略說此偈教諸比丘，如是受食呪願法用。",
        "translation": "\"At the time, the Bhagavān spoke this brief verse to teach the monks the Dharma function of thus accepting food and vows.",
        "source": "T03n0190_039:0836c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼等諸比丘眾，從佛受得如是教誨，從坐而起，頂禮佛足，圍遶三匝，隨意而行。",
        "translation": "\"After they had received such a teaching from the Buddha, they rose from their seats, bowed their heads at the Buddha's feet, circled him three times, and walked as they wished.",
        "source": "T03n0190_039:0836c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，彼等諸比丘眾各隨去後，是時彼處有護林神、護樹之神、護經行神，見林內空、見樹下空、見經行空，私心思慕諸比丘故，往詣佛所而說此偈，諮問佛言：「『我等諸神大戀慕，　　見此林樹悉皆空，　　彼多聞眾比丘僧，　　瞿曇釋子今何去？』",
        "translation": "After they each left, there was a forest protector god, a tree protector god, and a sūtra protector god who saw emptiness in the forest, emptiness under the trees, and emptiness in the sūtra walk, and who, because of their private thoughts about the monks, went to the Buddha and spoke this verse, asking him, \"We gods are greatly enamored, seeing that this forest and trees are all empty, and that well-versed monk, the monk Gautama, where is he going now?\"",
        "source": "T03n0190_039:0836c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊還以偈頌而報於彼守護樹林諸神等言：「『眾等調伏諸根訖，　　遊行教化彼眾生，　　或有往於憍薩羅，　　或向毘耶離城邑，　　或詣阿踰闍國土，　　或趣金剛大地方，　　決斷於他疑惑心，　　隨機逐情為說法。』",
        "translation": "\"At the time, the Bhagavān also reported back to the gods guarding the grove with this verse, saying, 'Suppose we all tame our faculties and train them to travel and teach sentient beings, whether they're headed to Kośala, to the city of Vaiśālī, to the land of Ayodhyā, or to the great place of Vajra, to resolve doubts and confusions in others, or to teach the Dharma according to their abilities.'",
        "source": "T03n0190_039:0836c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時世尊波羅[木*奈]城夏安居竟，隨多少時，然後重告諸比丘等，使更遊方隨緣教化。",
        "translation": "\"After he had finished his summer retreat in the city of Pārāṇasī, the Bhagavān then reprimanded the monks and others, telling them to travel further and teach according to their conditions.",
        "source": "T03n0190_039:0836c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而世尊從波羅捺城，遊行漸至優婁頻螺聚落之所，是昔如來行苦行處。",
        "translation": "From the city of Pārāṇasī, the Bhagavān traveled gradually to the village of Uruvilvā, which used to be a place where the Tathāgata practiced austerities.",
        "source": "T03n0190_039:0836c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其村有一大婆羅門，名曰兵將，達到彼村，從舊往來道路而行，為教化故。",
        "translation": "In that village, a large brāhmaṇa named General Bing reached that village and traveled along the old road for the purpose of teaching and transforming it.",
        "source": "T03n0190_039:0837a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊行舊路時，於其道傍見一園林蓊欝可愛，是時世尊從路下僻深入彼林，從樹至樹，見有一樹端正可憙，即坐其下，一日消息。",
        "translation": "\"As he was traveling along the old road, the Bhagavān saw a fragrant grove near the road that was lovely. Going down the road and into the grove, the Bhagavān went from tree to tree and saw a tree that was upright and attractive.",
        "source": "T03n0190_039:0837a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼林內有諸丈夫，伴侶朋友足三十人，二十九人悉皆有妻，唯獨一人隻身無婦。",
        "translation": "Within that grove were husbands and companions, 30 of whom had friends, and 29 of whom all had wives, except for one who was alone and had no wife.",
        "source": "T03n0190_039:0837a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼朋友二十九人，共為此一無妻之人，求覓於婦，而不能得稱可其意。",
        "translation": "Those twenty-nine friends were all looking for a wife for this womanless man, but they couldn't find one to suit their desires.",
        "source": "T03n0190_039:0837a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "忽然雇得一箇婬女，將來與其共相娛樂，而彼婬女即共彼人，隨意娛樂，行於世事，伺候彼等三十丈夫並皆眠睡，所有好物皆選擇取，即將逃走。",
        "translation": "Suddenly, they hired a woman who was a prostitute to share their pleasures with them, and she joined them in their pleasures, went about their worldly business, waited on 30 of their husbands while they slept, selected and took all their good things, and was about to flee.",
        "source": "T03n0190_039:0837a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼人及諸朋友，相共尋求彼之婬女，遍歷彼林，而不能得。",
        "translation": "\"At the time, those men and their friends sought their promiscuous woman together and went through that forest, but they couldn't find her.",
        "source": "T03n0190_039:0837a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遙見世尊坐一樹下，可憙端正，眾人樂見，調伏諸根，心意寂靜，已得最上最勝之法，猶如象王最善最妙，如彼大池滿於清淨涼冷之水，有一尋光，猶如金挺，身相具足，如娑羅樹遍滿於花，乃至猶如虛空星宿。",
        "translation": "They saw the Bhagavān sitting under a tree, looking attractive and upright, which people liked to see, taming his faculties, calming his mind, attaining the highest and most excellent dharma, like an elephant king who's the best and most beautiful, like a large lake full of pure, cool water, with a discerning light like a gold spear, and a body with features like a sāla tree filled with flowers or like a star in the sky.",
        "source": "T03n0190_039:0837a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼等諸人，見已往詣佛所，到佛所已，而白佛言：『尊者！",
        "translation": "\"After they saw this, they went to the Buddha, and when they arrived, they said to him, 'Venerable!",
        "source": "T03n0190_039:0837a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此處頗見如是婦女已不？』",
        "translation": "Is this place where such a woman is not seen?\"",
        "source": "T03n0190_039:0837a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛報問言：『汝諸人輩！",
        "translation": "In response, the Buddha asked, 'You people!",
        "source": "T03n0190_039:0837a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所問之者，是何婦女？",
        "translation": "What woman is being asked?",
        "source": "T03n0190_039:0837a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婦女者，緣何而來？』",
        "translation": "Where did this woman come from?'",
        "source": "T03n0190_039:0837a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，彼等共答佛言：『大善尊者！",
        "translation": "They then answered the Buddha together, saying, 'Great, honored one!",
        "source": "T03n0190_039:0837a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等朋友合三十人，皆是良善，在於此林居停住止，二十九人並皆有婦，唯獨一人單身無妻。",
        "translation": "We were friends, thirty of us, all of us good people, who were staying and staying in this forest. Twenty-nine of us had wives, but one of us was alone and had no wife.",
        "source": "T03n0190_039:0837a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而我等輩相共雇得一箇婬女，與其作妻，令蹔娛樂，而彼婬女見於我等歡樂之極自恣眠睡，彼婬女選我等好物，即將逃走。",
        "translation": "We all hired a woman as a wife to make her happy, and when she saw how happy we were, she made herself comfortable and slept.",
        "source": "T03n0190_039:0837a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等亦為此朋友故，亦復各為自許物，來此林之內求彼婬女。』",
        "translation": "For the sake of these friends, we also each gave ourselves permission to come to this forest and ask for that woman's hand.'",
        "source": "T03n0190_039:0837b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，佛告彼等人言：『諸男子輩！",
        "translation": "\"At that point, the Buddha addressed them, saying, 'Men!",
        "source": "T03n0190_039:0837b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今問汝，於意云何？",
        "translation": "Now I ask you, \"What do you think?",
        "source": "T03n0190_039:0837b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等今者寧求自身，寧欲求覓彼婬婦女，二事之中何者為勝？』",
        "translation": "Now, which of these two things is better, that you should seek yourself or that you should seek some lecherous woman?'",
        "source": "T03n0190_039:0837b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等男子共報佛言：『善哉！",
        "translation": "Those men together reported to the Buddha, saying, 'Good!",
        "source": "T03n0190_039:0837b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0190_039:0837b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等今者若求自身，此最為勝，寧可莫求彼之婦女。』",
        "translation": "Now, if we were to seek ourselves, this would be the most superior; we should not seek their women.'",
        "source": "T03n0190_039:0837b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊復更告言：『諸善男子！",
        "translation": "\"At that point, the Bhagavān again told them, 'Good sons!",
        "source": "T03n0190_039:0837b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如此者，汝等安坐，我今當為汝等說法。』",
        "translation": "If that's the case, then sit quietly while I explain the teaching to you.'",
        "source": "T03n0190_039:0837b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，彼等三十男子朋友伴侶，同白佛言：『唯然世尊！",
        "translation": "Those thirty men, friends, and companions then said to the Buddha, 'Yes, Bhagavān!",
        "source": "T03n0190_039:0837b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一依聖教，不敢有違。』",
        "translation": "They all relied on the noble teaching and didn't dare to disobey it.'",
        "source": "T03n0190_039:0837b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，彼等三十朋友，頂禮佛足，却坐一面。",
        "translation": "Those thirty friends then bowed their heads at the Buddha's feet and withdrew to sit to one side.",
        "source": "T03n0190_039:0837b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊為其次第如應說法，所謂布施持戒行忍，乃至有法皆是滅相，如實觀察，既證知已，猶如淨衣，無有黑縷，無有垢膩，隨其所染，即受彼色。",
        "translation": "\"At the time, the Bhagavān explained for them in secondary order as it should be explained, teaching that generosity, maintaining precepts, practicing forbearance, and even the cessation of all existent things are truly observed, and once they realize this, they're like pure clothing that has no black thread or dirt, and they accept that color as it's stained.",
        "source": "T03n0190_039:0837b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如是，彼等三十男子朋友，即於彼座，遠塵離垢，即時滅盡一切煩惱，於諸法中得法眼淨，所有垢法悉是滅相，如是觀知。",
        "translation": "Thus and so, those 30 men and friends, while they're sitting there, become dustless and spotless, immediately cease all afflictions, attain purification of the Dharma eye among all things, and observe that all defiled things are in their aspect of cessation.",
        "source": "T03n0190_039:0837b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼等男子如是見諸法相，得是法相，證是法相，入是法相，度是法相，除滅所疑，無復惑著，到無畏地，不隨他行。",
        "translation": "\"At that point, these men thus see the characteristics of dharmas, attain their characteristics, realize their characteristics, enter their characteristics, and liberate their characteristics, remove any doubt, become free of further mental attachment, reach the ground of fearlessness, and don't follow the actions of others.",
        "source": "T03n0190_039:0837b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既知世尊聖教法已，從坐而起，頂禮佛足，而白佛言：『善哉！",
        "translation": "Having known the Bhagavān's noble teaching, he rose from his seat, bowed his head at the Buddha's feet, and said to him, 'Good!",
        "source": "T03n0190_039:0837b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0190_039:0837b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願與我等出家受戒。』",
        "translation": "Would you like to leave home with us and receive the precepts?'",
        "source": "T03n0190_039:0837b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，佛告彼等男子作如是言：『來汝男子！",
        "translation": "\"At that point, the Buddha addressed the men and said, 'Come, you men!",
        "source": "T03n0190_039:0837b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入我所說法教之中，行於梵行，正盡苦集，滅於苦邊。』",
        "translation": "They entered my teaching of the Dharma, practiced the religious practice, correctly ended suffering and its accumulation, and ceased at the limit of suffering.'",
        "source": "T03n0190_039:0837b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，彼等諸長老輩，即成出家，具足戒品。",
        "translation": "Those elders then became renunciant monks and completed the chapter on precepts.",
        "source": "T03n0190_039:0837b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊更為彼等而說法要，慇懃教誨。",
        "translation": "\"The Bhagavān then explained the essentials of the Dharma for them and gave them an attentive teaching.",
        "source": "T03n0190_039:0837b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，彼等以佛更為說於法教誨示之時，不久之間，彼善男子以其正信捨家出家，求於最上梵行已訖，現見自證神通之後，口自唱言：『我今已得梵行之報，所作已辦，更不復受後世之有，如是知時。』",
        "translation": "Not long after the Buddha had instructed them in the teachings, that good man left home and left home because of his right faith, finished pursuing the highest religious practice, and now sees himself realizing supernormal powers and says, 'Now that I've attained the rewards of the religious life and accomplished what I did, I won't be subject to another life's existence,' knowing this.",
        "source": "T03n0190_039:0837b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等長老，皆成羅漢，心善解脫。",
        "translation": "Those elders all became arhats, and their minds were well liberated.",
        "source": "T03n0190_039:0837c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊教彼三十長老朋友，得知證已，遊行履歷，經白[疊*毛]林，到彼林已，深入林中，見有一樹微妙可憙，即坐其下，一日消息。",
        "translation": "\"After realizing this, the Bhagavān taught 30 of his oldest friends to travel through the White [Tuṣita*Mao] Grove, and when they arrived there, they went deep into the grove and saw a tree that was exquisitely attractive.",
        "source": "T03n0190_039:0837c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼處忽有六十雲種姓人，從彼林路道便而過，彼等諸人遙見世尊坐於樹下，端正可憙，眾人樂見，乃至猶如虛空眾星之所莊嚴。",
        "translation": "\"At the time, there were suddenly 60 clouds of people from various castes who passed by on the road through that forest, and they saw the Bhagavān sitting under that tree from a distance, looking attractive and upright, and they were delighted to see him, even as he was adorned by the stars in the sky.",
        "source": "T03n0190_039:0837c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見已心得清淨正信，生大歡喜，以歡喜故，往詣佛所。",
        "translation": "After seeing that, they attain pure faith and become greatly elated, and because of that elation, they go to the Buddha.",
        "source": "T03n0190_039:0837c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到佛所已，頂禮佛足，却坐一面，坐一面已，默然而住。",
        "translation": "When he arrived at the Buddha's place, he bowed his head at his feet, withdrew to sit to one side, and after sitting to one side, waited silently.",
        "source": "T03n0190_039:0837c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，佛為彼等六十雲種姓人，次第說法，所謂教行布施持戒，乃至證知。",
        "translation": "\"At the time, the Buddha taught 60 of those clouds of people from various castes, in order, what he called the practice of generosity, observance of precepts, and up to realization.",
        "source": "T03n0190_039:0837c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等長老一切皆得阿羅漢果，心善解脫。",
        "translation": "All of those elders attained the fruit of the arhat, and their minds were well liberated.",
        "source": "T03n0190_039:0837c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，世尊教化彼等六十長老雲姓比丘，令發心已，即捨而去，更遊餘方。",
        "translation": "The Bhagavān then taught those 60 elders from the cloud family and caused them to have the intention to abandon and leave and travel to other places.",
        "source": "T03n0190_039:0837c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛本行集經卷第三十九",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Volume 39",
        "source": "T03n0190_039:0837c21_0",
        "is_bad_quality": false
    }
]