[
    {
        "source_sentence": "大乘本生心地觀經卷第五",
        "translation": "Dasheng ben sheng xindi guan jing, vol. 5",
        "source": "T03n0159_005:0312c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大唐罽賓國三藏般若奉　詔譯",
        "translation": "A translation by imperial order of the Tripiṭaka of the Great Tang State of Kāśmīra",
        "source": "T03n0159_005:0312c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無垢性品第四",
        "translation": "The Fourth Chapter of the Nature of Immaculate Conception",
        "source": "T03n0159_005:0312c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，智光及諸長者既出家已，齊整法服五輪著地，禮如來足合掌恭敬，白佛言：「世尊！",
        "translation": "At the time, Zhiguang and the elders had left home, adjusted their Dharma robes, put their five wheels on the ground, bowed their palms at the Tathāgata's feet in respect, and said to the Buddha, \"Bhagavān!",
        "source": "T03n0159_005:0312c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等從佛聞所未聞，在家所有種種過失，發菩提心厭離世間，剃除鬚髮而作比丘。",
        "translation": "Having heard nothing from the Buddha about the various faults at home, we aroused the aspiration for enlightenment, became disillusioned with the world, shaved off our hair, and became monks.",
        "source": "T03n0159_005:0312c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願如來、應、正等覺，為我等類及諸眾生，演說出家殊勝功德，令得聞者發清淨心，樂遠離行不斷佛種。",
        "translation": "May the Tathāgata, the Worthy One, and the Perfectly Enlightened One explain the extraordinary virtues of leaving home for us and other sentient beings, so that those who hear them will develop a pure mind and delight in practices that distance themselves from the Buddha's lineage and continue without break.",
        "source": "T03n0159_005:0312c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊大恩無緣慈悲，憐愍眾生如羅睺羅。",
        "translation": "The Bhagavān's great kindness and unconditional compassion are like Rāhula's pity for sentient beings.",
        "source": "T03n0159_005:0312c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出家菩薩應云何住？",
        "translation": "\"What should a renunciant bodhisattva's abode be?",
        "source": "T03n0159_005:0312c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何修習無垢之業？",
        "translation": "How do we cultivate undefiled activity?",
        "source": "T03n0159_005:0312c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何調伏有漏之心？」",
        "translation": "How do we tame contaminated states of mind?\"",
        "source": "T03n0159_005:0312c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊讚歎智光諸比丘等：「善哉，善哉！",
        "translation": "At that point, the Bhagavān praised the monks of Zhiguang, saying, \"Good, good!",
        "source": "T03n0159_005:0312c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是真佛子，能為未來一切眾生，問於如來如是大事。",
        "translation": "\"This is truly the son of the Buddha who can ask the Tathāgata about such great matters for all future sentient beings.",
        "source": "T03n0159_005:0312c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如是，如汝所說，如來世尊憐愍眾生，平等無二猶如一子。",
        "translation": "Thus and thus, as you've said, the Bhagavān has compassion on sentient beings, and he's equal and not two, just like the one child.",
        "source": "T03n0159_005:0312c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今諦聽，善思念之，吾當為汝分別演說，出家菩薩應如是住，如是修行無垢之業，如是調伏有漏之心。」",
        "translation": "Now, listen closely, consider it well, and I will explain for you separately that renunciant bodhisattvas should thus abide, thus cultivate undefiled actions, and thus tame contaminated minds.\"",
        "source": "T03n0159_005:0312c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唯然，世尊！",
        "translation": "\"Yes, Bhagavān!",
        "source": "T03n0159_005:0313a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願樂欲聞。」",
        "translation": "May I wish to hear about it.\"",
        "source": "T03n0159_005:0313a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告智光比丘：「出家菩薩住如是心，常作是觀：我得人身諸根具足，從何處沒來生此間？",
        "translation": "It was then that the Buddha addressed the monk Zhiguang, \"Lay practitioners and bodhisattvas thus abide in this state of mind and always observe this: 'I've attained personal possessions and my faculties are complete, so where did I come from to be born here?'",
        "source": "T03n0159_005:0313a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於三界中當生何界？",
        "translation": "Which of the three realms will I be born in?",
        "source": "T03n0159_005:0313a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於四大洲復生何處？",
        "translation": "Where will I be reborn on the four continents?",
        "source": "T03n0159_005:0313a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六道之中受生何道？",
        "translation": "What path are you born into within the six destinies?",
        "source": "T03n0159_005:0313a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何因緣得離父母妻子眷屬，出家修道免八難身？",
        "translation": "For what reasons did you become free of your parents, wife, and retinue and leave home to avoid the eight difficult bodies?",
        "source": "T03n0159_005:0313a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莊嚴劫中過去千佛皆已涅槃，星宿劫中未來千佛未出於世，賢劫之中現在千佛，幾佛如來出現於世，化緣將盡入般涅槃？",
        "translation": "How many Tathāgatas appeared in the world during the adorned eon when all the thousand buddhas of the past had already passed into nirvāṇa, how many buddhas of the future had not yet appeared in the astral eon when a thousand buddhas of the good eon are now present in the world and will enter parinirvāṇa when their causes for transformation are exhausted?",
        "source": "T03n0159_005:0313a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾佛世尊未出於世？",
        "translation": "How many buddhas did the Bhagavān not yet appear in the world?",
        "source": "T03n0159_005:0313a09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸眾生根緣未熟未聞正法，復於何時當來彌勒，從兜率天下生人間現成佛道？",
        "translation": "\"Are these sentient beings immature in their roots and conditions and have not yet heard the right teaching, and when will the future Maitreya descend from Tuṣita Heaven to become a human being and manifest the Buddha Way?",
        "source": "T03n0159_005:0313a10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於我身中有何善業？",
        "translation": "What kind of good karma do I have in my body?",
        "source": "T03n0159_005:0313a12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戒定慧學當有何德？",
        "translation": "What virtues will the training in morality, meditation, and wisdom have?",
        "source": "T03n0159_005:0313a12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去諸佛皆已不遇，當來世尊得見不邪？",
        "translation": "Having never met any of the buddhas of the past, is it wrong to expect to see a future world-honored one?",
        "source": "T03n0159_005:0313a13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今現在諸凡夫地，三業煩惱何最為重？",
        "translation": "Now that I'm in the land of mortals, what are the three karmic afflictions that are most important?",
        "source": "T03n0159_005:0313a14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一生已來造何罪業？",
        "translation": "What kind of crimes have you committed in your lifetime?",
        "source": "T03n0159_005:0313a15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於何佛所曾種善根？",
        "translation": "In what buddha's place have you planted good roots?",
        "source": "T03n0159_005:0313a15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我此身命能得幾時？",
        "translation": "How long will I be able to live in this body?",
        "source": "T03n0159_005:0313a16_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是日已過命隨減少，猶如牽羊詣彼屠所，漸漸近死無所逃避，身壞命終生於何處？",
        "translation": "After these days pass, his life decreases as he goes, just like leading a sheep to the slaughterhouse, gradually approaching death with no place to escape, where will he be born when his body breaks up and his life ends?",
        "source": "T03n0159_005:0313a16_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三惡道苦如何脫免？",
        "translation": "How can I escape the suffering of the three evil destinies?",
        "source": "T03n0159_005:0313a18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然我此身愛樂長養，念念衰老無時暫停，誰有智者愛樂此身？",
        "translation": "\"Still, I've grown fond of this body, and I've grown old from moment to moment without pausing, so who is there a wise person who loves and enjoys this body?",
        "source": "T03n0159_005:0313a19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智光當知！",
        "translation": "Zhiguang Dangjin!",
        "source": "T03n0159_005:0313a20_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出家菩薩常於晝夜如是觀察，勿貪世間受五欲樂，精勤修習未嘗暫捨，如去頂石、如救頭燃，心常懺悔過去先罪，安住如是四無垢性，一心修行十二頭陀，調伏其心如旃陀羅，如是佛子是名出家。",
        "translation": "A renunciant bodhisattva always observes day and night like this, doesn't crave the five worldly pleasures, diligently cultivates them without ever temporarily relinquishing them, like removing a top stone or putting out a burning head, always repents of past sins in his mind, abides in these four undefiled natures, single-mindedly cultivates the 12 ascetics, and tames his mind like a candra; such a Buddhist son is called a renunciant.",
        "source": "T03n0159_005:0313a20_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「智光比丘！",
        "translation": "\"Monk Zhiguang!",
        "source": "T03n0159_005:0313a25_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何義故，說名真實修沙門行如旃陀羅？",
        "translation": "What does it mean to say that it's called truly cultivating ascetic practices like a candra?",
        "source": "T03n0159_005:0313a25_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其旃陀羅每遊行時，手執錫杖不敢當路，若人逼近振錫令聞。",
        "translation": "Whenever he travels in procession, that candra carries a tin cane in his hand and dares not stand in the way, and if someone approaches, he shakes his tin and makes them listen.",
        "source": "T03n0159_005:0313a26_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於大眾中心行謙下不敢輕慢，被呵責時，心無怨恨未嘗加報，罵辱鞭撻默然受之。",
        "translation": "When he's rebuked, he doesn't harbor resentment in his mind and doesn't take any action in response, and he accepts insults and whippings with equanimity.",
        "source": "T03n0159_005:0313a28_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T03n0159_005:0313b01_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自知下性不階眾流，以是因緣無瞋無報。",
        "translation": "Knowing their own inferior nature and not being part of many streams, they have no anger and no retribution because of this cause.",
        "source": "T03n0159_005:0313b01_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智光當知，出家菩薩亦復如是，剃除鬚髮形同嬰兒，執持應器依佗活命，身著袈裟如被甲冑，杖錫而行如持鉾矟，執智慧劍破煩惱賊，修嬰兒行饒益一切。",
        "translation": "Zhiguang should know that renunciant bodhisattvas are likewise, shaving off their hair and taking on the shape of a baby, holding a suitable container, depending on a living being, wearing a monk's robe like a man in armor, walking with a staff like a spear, wielding a sword of wisdom to defeat the afflictions and thieves, and cultivating the practice of infancy to benefit all people.",
        "source": "T03n0159_005:0313b02_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故一切三毒利箭，不入真實沙門之身。",
        "translation": "Because of this, all the three poisons and sharp arrows won't enter the body of a true ascetic.",
        "source": "T03n0159_005:0313b06_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出家菩薩以三觀門修忍辱行，名真出家。",
        "translation": "A renunciant bodhisattva who cultivates the practice of forbearance through the gate of the three contemplations is called a true renunciant.",
        "source": "T03n0159_005:0313b07_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀諸眾生是佛化身，觀於自身為實愚夫；觀諸有情作尊貴想，觀於自身為僮僕想；又觀眾生作父母想，觀自己身如男女想。",
        "translation": "He observes that sentient beings are the transformation body of the Buddha and observes that he's really a fool; he observes sentient beings as noble and observes himself as a servant; and he observes sentient beings as parents and observes himself as a man and woman.",
        "source": "T03n0159_005:0313b08_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出家菩薩常作是觀，或被打罵終不加報，善巧方便調伏其心。",
        "translation": "That's how renunciant bodhisattvas always observe, so that even when they're rebuked, they never retaliate and skillfully tame their minds.",
        "source": "T03n0159_005:0313b11_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「智光比丘！",
        "translation": "\"Monk Zhiguang!",
        "source": "T03n0159_005:0313b12_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等諦聽！",
        "translation": "All of you, listen closely!",
        "source": "T03n0159_005:0313b13_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名為四無垢性？",
        "translation": "What are the four terms of undefiled nature?",
        "source": "T03n0159_005:0313b13_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "衣服、臥具、飲食、湯藥，如是四事隨有所得，麤細稱心遠離貪求，是無垢性。",
        "translation": "\"Clothing, bedding, food, drink, and medicine are four things that are obtained as they are, and this is the undefiled nature of the coarse and refined praxis mind, which is free of craving.",
        "source": "T03n0159_005:0313b13_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘等！",
        "translation": "Fellow monks!",
        "source": "T03n0159_005:0313b15_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何因緣，如是四行名無垢性？",
        "translation": "By what causes and conditions are these four practices called undefiled?",
        "source": "T03n0159_005:0313b15_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智光當知，諸佛如來三十七品菩提分法，皆從此生，佛法僧寶常不斷絕，是故得名為四無垢性。」",
        "translation": "Zhiguang should know that the thirty-seven factors of enlightenment of buddha-tathāgatas all arise from this, and the treasures of buddha, dharma, and saṃgha are never cut off; therefore, they're called the four undefiled natures.\"",
        "source": "T03n0159_005:0313b16_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊，而說偈言：「智光比丘汝諦聽，　　出家菩薩所應作，　無緣大慈攝眾生，　　猶如一子皆平等。",
        "translation": "It was then that the Bhagavān spoke this verse, \"Listen closely, monks Zhiguang, to what renunciant bodhisattvas should do, which is to gather sentient beings without conditions or great compassion, just as an equal son.",
        "source": "T03n0159_005:0313b18_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　發菩提心求正覺，　　應作三種成佛法：　心常住四無垢性，　　當修十二頭陀行，　下心猶如旃陀羅。",
        "translation": "Stirring up the mind of enlightenment and seeking right awakening, they should create three ways to become a buddha: They should always abide in the four undefiled natures of their minds, cultivate the 12 ascetic practices, and descend in mind like a candra.",
        "source": "T03n0159_005:0313b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　四威儀中作是念：　十方無量諸菩薩，　　剎那剎那趣聖道，　彼既修證我亦爾，　　如何流轉三界中？",
        "translation": "In the midst of the four comportments, he thinks this: \"How can the measureless bodhisattvas in the ten directions, who moment by moment are headed for the noble path, and I too have cultivated their realization, wander through the three realms?",
        "source": "T03n0159_005:0313b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　恒居生死無量苦，　　我今是身住何界？",
        "translation": "\"Constantly abiding in the innumerable sufferings of birth and death, what realm do I now abide in with this body?",
        "source": "T03n0159_005:0313b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　六道輪迴處何道？",
        "translation": "Where is the path of the transmigration through the six destinies?",
        "source": "T03n0159_005:0313b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　胎卵濕化受何生？",
        "translation": "What is the birth of the fetus and egg that are subject to wet transformation?",
        "source": "T03n0159_005:0313b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　身口意業於何修？",
        "translation": "What is the cultivation of bodily, verbal, and mental activity?",
        "source": "T03n0159_005:0313b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　所造罪中何者重？",
        "translation": "Which of the sins created is the most serious?",
        "source": "T03n0159_005:0313b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三性之心何心多？",
        "translation": "What is the abundance of minds in the three natures?",
        "source": "T03n0159_005:0313c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如是微細觀察已，　大慈大悲恒相續，　　大喜大捨為先心，　為有緣者說妙法，　　晝夜修心不暫停。",
        "translation": "After this subtle observation, great kindness and great compassion are constantly ongoing, great joy and great equanimity are the first thoughts, and they explain the wondrous Dharma to those who have need of it, cultivating their minds day and night without pausing.",
        "source": "T03n0159_005:0313c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如去頂石救頭燃，　　念三觀門常不離：　觀諸有情是佛身，　　唯我獨處於凡類；　一切眾生等尊貴，　　我為僮僕居卑賤；　世間眾生同父母，　　我如男女行孝養。",
        "translation": "As he goes to the top of a stone to save his head from burning, he's mindful of the three contemplations and never departs from them: observing that all sentient beings are buddha-bodies, but I alone am among ordinary people; that all sentient beings are equally noble, and I'm a servant living in a humble existence; that sentient beings in the world are like parents, and I'm like a man and a woman performing filial duty to support them.",
        "source": "T03n0159_005:0313c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　被佗打罵不瞋嫌，　　勤修忍辱無怨嫉。",
        "translation": "I'm not angry or resentful when I'm criticized, but I diligently cultivate patience without enmity.",
        "source": "T03n0159_005:0313c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　四事供養心不著，　　是則名為無垢性。",
        "translation": "Making offerings to these four things and not clinging to them at heart is called undefiled nature.",
        "source": "T03n0159_005:0313c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三十七品菩提分，　　及以如來果報身，　如是殊勝無漏法，　　四無垢性為根本。",
        "translation": "Of the thirty-seven factors of enlightenment and the tathāgata's reward body, these are the four undefiled qualities that are the foundation of such extraordinary and uncontaminated qualities.",
        "source": "T03n0159_005:0313c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不放逸行常修習，　　是名出家真佛子，　菩提智種念念增，　　無漏聖道皆成就，　速得超於無量劫，　　端坐華王法界中，　福智二嚴皆圓滿，　　無邊劫海利群生。",
        "translation": "Not engaging in careless conduct and always cultivating it, this is called the renunciant true Buddhist son, who's mindfully increasing the seeds of enlightenment, accomplishing the uncontaminated noble path, quickly transcending measureless eons, sitting upright in the Dharma realm of the flower king, perfecting the two adornments of merit and wisdom, and benefiting sentient beings in an ocean of limitless eons.",
        "source": "T03n0159_005:0313c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由無垢性皆成就，　　證獲如來常住果。",
        "translation": "Because their unsullied natures are all accomplished, they realize the fruit of the Tathāgata's eternal abiding.",
        "source": "T03n0159_005:0313c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，智光比丘！",
        "translation": "\"Furthermore, Monk Zhiguang!",
        "source": "T03n0159_005:0313c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出家菩薩於所著衣不應貪著，若細若麤隨其所得，但於施者為生福田勿嫌麤惡；不得為衣廣說法要，起諸方便與貪相應。",
        "translation": "A renunciant bodhisattva shouldn't cling to the clothes he wears, whether small or coarse, as he gets them; he should only give them to others as a field of merit and not mind coarse or bad things; he shouldn't explain the essentials of the Dharma in detail for the sake of the clothes, nor should he create skillful means to match his craving.",
        "source": "T03n0159_005:0313c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間凡夫為衣服故，非法貪求造不善業，墮於惡道經無量劫，不遇諸佛、不聞正法，受苦畢已復生人間，貧窮困苦，求不得苦晝夜逼迫，衣不蔽形，食不支命。",
        "translation": "Ordinary people in the world create unwholesome activity by illicitly desiring clothing, fall into a bad destiny for measureless eons, don't meet the buddhas or hear the right teaching, return to the human world after suffering, become poor and destitute, and are forced by day and night to suffer when they can't get enough, with clothing that doesn't cover their bodies and food that doesn't support their lives.",
        "source": "T03n0159_005:0313c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾苦，皆由先世為衣服故，多殺生命造種種罪。",
        "translation": "Such kinds of suffering all stem from the fact that in a previous life, they killed many lives and created various kinds of crimes because of clothing.",
        "source": "T03n0159_005:0313c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出家菩薩即不如是，隨其所得不嫌麤惡，但懷慚愧以充法衣，得十勝利：一者能覆其身遠離羞恥，具足慚愧修行善法。",
        "translation": "That's not the case for renunciant bodhisattvas, who follow what they've acquired without disliking coarse or unwholesome things but fill their Dharma robes with conscience and attain ten excellent benefits: first, they can cover their bodies, part with shame, and cultivate the good Dharma with a full sense of conscience.",
        "source": "T03n0159_005:0313c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者遠離寒熱及以蚊虻惡獸毒蟲，安隱修道。",
        "translation": "Second, they'll be free of cold and heat, as well as mosquitoes, stinging insects, and bad animals, and they'll cultivate their religious practice in comfort.",
        "source": "T03n0159_005:0313c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者示現沙門出家相貌，見者歡喜遠離邪心。",
        "translation": "Third, it shows the appearance of a renunciant ascetic, and those who see it rejoice and leave wrong thoughts behind.",
        "source": "T03n0159_005:0313c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者袈裟即是人天寶幢之相，尊重敬禮得生梵天。",
        "translation": "Fourth, the reddish-brown robe is the mark of a jeweled banner for humans and gods, and respecting and venerating it, they'll be born in the Brahma Heaven.",
        "source": "T03n0159_005:0314a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者著袈裟時生寶塔想，能滅眾罪生諸福德。",
        "translation": "Fifth, when wearing the reddish-brown robes, he gives rise to the idea of a jeweled stūpa, which can extinguish sins and produce merit.",
        "source": "T03n0159_005:0314a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六者本制袈裟染令壞色，離五欲想不生貪愛。",
        "translation": "Sixth, when the original monks robe is dyed and tarnished, the five desires are removed and craving doesn't arise.",
        "source": "T03n0159_005:0314a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七者袈裟是佛淨衣，永斷煩惱作良田故。",
        "translation": "Seven, the reddish-brown robes are the Buddha's pure robe, which permanently ends affliction and creates a fertile soil.",
        "source": "T03n0159_005:0314a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八者身著袈裟罪業消除，十善業道念念增長。",
        "translation": "Eight, wearing the reddish-brown robes removes bad karma and increases the ten good actions and paths in each moment.",
        "source": "T03n0159_005:0314a06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九者袈裟猶如良田，能善增長菩薩道故。",
        "translation": "Nine, the reddish-brown robe is like a fertile soil that well-produces the bodhisattva path.",
        "source": "T03n0159_005:0314a07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十者袈裟猶如甲冑，煩惱毒箭不能害故。",
        "translation": "Ten, the reddish-brown robe is like armor, so the poisonous arrows of affliction can't harm it.",
        "source": "T03n0159_005:0314a08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智光當知！",
        "translation": "You should know this, Zhiguang!",
        "source": "T03n0159_005:0314a09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，三世諸佛緣覺聲聞，清淨出家身著袈裟，三聖同坐解脫寶床，執智慧劍破煩惱魔，共入一味諸涅槃界。」",
        "translation": "Because of these causes and conditions, the buddhas, pratyekbuddhas, and direct disciples of the three times wear the reddish-brown robes, and the three sages sit together on the jeweled bed of liberation, hold the sword of wisdom that refutes the demons of affliction, and enter the realm of nirvāṇa with a common taste.\"",
        "source": "T03n0159_005:0314a09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊而說偈言：「智光比丘應善聽，　　大福田衣十勝利。",
        "translation": "It was then that the Bhagavān spoke this verse, \"Monks of Zhiguang should listen well to this great field of merit, which offers ten excellent benefits.",
        "source": "T03n0159_005:0314a12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間衣服增欲染，　　如來法服不如是，　法服能遮世羞恥，　　慚愧圓滿生福田。",
        "translation": "Worldly clothing increases defilement by desire, but the Tathāgata's Dharma robe is not like that; the Dharma robe covers worldly shame, and the field of merit arises from the perfection of modesty.",
        "source": "T03n0159_005:0314a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　遠離寒暑及毒蟲，　　道心堅固得究竟，　示現出家離貪欲，　　斷除五見正修持。",
        "translation": "Far removed from cold, heat, and venomous insects, his mind of enlightenment is resolute and he attains its ultimate realization, demonstrating that he's left home and abandoned desire, and he correctly cultivates the elimination of the five views.",
        "source": "T03n0159_005:0314a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　瞻禮袈裟寶幢想，　　恭敬生於梵王福，　佛子披衣生塔想，　　生福滅罪感人天。",
        "translation": "I venerate the image of the robe's jeweled banner, respectfully cultivating the merit of Brahmā, and the image of the Buddha's son robed in a stūpa, producing merit and extinguishing sins to inspire humans and gods.",
        "source": "T03n0159_005:0314a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　肅容致敬真沙門，　　所為不染諸塵俗，　諸佛稱讚為良田，　　利樂群生此為最。",
        "translation": "With solemn dignity, he pays homage to the true ascetic, whose actions are undefiled by defilements, praised by the buddhas as a good soil, and which brings the greatest benefit to sentient beings.",
        "source": "T03n0159_005:0314a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　袈裟神力不思議，　　能令修植菩提行，　道芽增長如春苗，　　菩提妙果類秋實，　堅固金剛真甲冑，　　煩惱毒箭不能害。",
        "translation": "The surplice's inconceivable power enables him to cultivate the practice of enlightenment, growing buds of the way like springtime seedlings, the marvelous fruit of enlightenment like autumn fruit, and a strong, adamantine true armor that can't be harmed by the poisonous arrows of affliction.",
        "source": "T03n0159_005:0314a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今略讚十勝利，　　歷劫廣說無有邊。",
        "translation": "Now, I'll briefly praise ten excellent qualities that have been explained in detail through the eons and know no bounds.",
        "source": "T03n0159_005:0314a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有龍身披一縷，　　得脫金翅鳥王食；　若人渡海持此衣，　　不怖龍魚諸鬼難。",
        "translation": "If a dragon's body is covered with a single thread, it's freed from feeding on the garb of the garuḍa king; if a person wades across the ocean and carries this robe, they won't fear the difficulties of dragons, fish, and ghosts.",
        "source": "T03n0159_005:0314a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雷電霹靂天之怒，　　披袈裟者無恐畏，　白衣若能親捧持，　　一切惡鬼無能近。",
        "translation": "When thunder and lightning thunder the wrath of heaven, the monk who wears the robe has no fear; if he could hold the white robe in his hand, all evil spirits wouldn't be able to approach it.",
        "source": "T03n0159_005:0314a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若能發心求出家，　　厭離世間修佛道，　十方魔宮皆振動，　　是人速證法王身。",
        "translation": "If someone can arouse the intention to leave home and cultivate the Buddha Way apart from the world, the demon's palace in ten directions will be shaken, and they'll quickly realize the Dharma king's body.",
        "source": "T03n0159_005:0314b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，智光菩薩！",
        "translation": "\"Furthermore, Bodhisattva Zhiguang!",
        "source": "T03n0159_005:0314b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出家佛子常行乞食，應捨身命不斷是心。",
        "translation": "That's the attitude of a renunciant Buddhist who always goes begging for food and should abandon his body and life.",
        "source": "T03n0159_005:0314b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0159_005:0314b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切有情皆依食住，是以乞食利益無窮。",
        "translation": "All sentient beings rely on food for shelter, so the benefits of begging for food know no bounds.",
        "source": "T03n0159_005:0314b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等當知，出家菩薩常行乞食有十勝利。",
        "translation": "You should know that there are ten excellent benefits for renunciant bodhisattvas who always practice begging for food.",
        "source": "T03n0159_005:0314b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為十？",
        "translation": "What are the ten?",
        "source": "T03n0159_005:0314b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者常行乞食以自活命，出入自由不屬佗故。",
        "translation": "One person always begs for food to help them live, so they can go in and out freely without falling back on wool.",
        "source": "T03n0159_005:0314b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者行乞食時，先說妙法令起善心，然後自食。",
        "translation": "Two, when they practice begging for food, they first explain the wonderful teaching to arouse good intentions, and then they feed themselves.",
        "source": "T03n0159_005:0314b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者為不施人發大悲心，為說正法令起捨心而生勝福。",
        "translation": "Third, he arouses great compassion for those who don't give, and he produces superior merit by teaching the right Dharma and generating equanimity.",
        "source": "T03n0159_005:0314b09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者依佛教行增長戒品，福德圓滿智慧無窮。",
        "translation": "Fourth, he cultivates the quality of morality based on Buddhist practice, and his fortune is complete, and his wisdom knows no limit.",
        "source": "T03n0159_005:0314b10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者常行乞食，於七九慢自然消滅，眾所恭敬是良福田。",
        "translation": "Fifth, when he always begs for food, his seven or nine conceits naturally subside, and he's respected by many as a good field of merit.",
        "source": "T03n0159_005:0314b11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六者於乞食時，當得如來無見頂相，應受世間廣大供養。",
        "translation": "Sixth, when he begs for alms, he'll attain the invisible head of the Tathāgata and accept vast worldly offerings.",
        "source": "T03n0159_005:0314b12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七者汝等佛子隨學此法，住持三寶饒益有情。",
        "translation": "Seven, you Buddhist disciples follow this teaching, upholding the Three Treasures for the benefit of sentient beings.",
        "source": "T03n0159_005:0314b14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八者於乞食時，不得為求食故，起希望心讚歎一切男子女人。",
        "translation": "Eight: When you're begging for food, you mustn't get hopes up and praise all men and women for the sake of seeking food.",
        "source": "T03n0159_005:0314b15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九者行乞食時須依次第，不應分別貧富之家。",
        "translation": "Nine, when you practice begging for food, you must follow an orderly sequence that doesn't discriminate between rich and poor families.",
        "source": "T03n0159_005:0314b16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十者常行乞食諸佛歡喜，得一切智最為良緣。",
        "translation": "Ten, when you always go about begging for food, the buddhas are pleased with you, and attaining omniscience is the best possible condition.",
        "source": "T03n0159_005:0314b18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智光菩薩！",
        "translation": "Bodhisattva Zhiguang!",
        "source": "T03n0159_005:0314b19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我為汝等略說如是十種利益，若廣分別無量無邊。",
        "translation": "I'll explain these ten kinds of benefits for you in brief, which, if broadly distinguished, would be measureless and limitless.",
        "source": "T03n0159_005:0314b19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等比丘及未來世，求佛道者應如是學。」",
        "translation": "You monks and those who will seek the Buddha's path in future generations should train yourselves in this way.\"",
        "source": "T03n0159_005:0314b20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊而說偈言：「智光菩薩汝諦聽，　　出家大士應離貪，　當發出世修行心，　　乞食頭陀為根本。",
        "translation": "It was then that the Bhagavān spoke this verse, \"Listen closely, Bodhisattva Zhiguang, renunciant monks should part with craving, and they should give rise to the mind of worldly cultivation, which is rooted in begging for food as a chief donor.",
        "source": "T03n0159_005:0314b21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　凡夫住於有漏食，　　聖者悉依無漏食，　有漏無漏諸聖凡，　　一切無不依食住。",
        "translation": "Ordinary people abide on contaminated food, but noble people all rely on uncontaminated food, and none of the noble and uncontaminated worldlings doesn't abide on food.",
        "source": "T03n0159_005:0314b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我為汝等諸佛子，　　開演出世二利行，　三世如來所稱讚，　　乞食功德有十利。",
        "translation": "For you Buddhist disciples, I've described two worldly practices that are praised by the Tathāgatas of the three times as having ten benefits based on the merit of begging for food.",
        "source": "T03n0159_005:0314b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　偏稱此行最為勝，　　出入自在無繫縛，　先令施主發初心，　　令趣菩提然後食。",
        "translation": "This practice is praised as the most excellent, freely leaving and entering without binding, first causing the donor to arouse the first thoughts, and then leading him to enlightenment and then to food.",
        "source": "T03n0159_005:0314b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為除慳貪說妙法，　　能起大捨無量心，　依大師教行乞食，　　增長無量諸梵行。",
        "translation": "He explains the wonderful teaching to remove stinginess and greed, generates a mind of great equanimity, and follows the great teacher's teaching to practice almsgiving and increase the religious practice of measureless people.",
        "source": "T03n0159_005:0314c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　七九種慢自除滅，　　為諸人天所尊敬，　如來頂相不可見，　　轉妙法輪化十方。",
        "translation": "He rids himself of seventy-nine kinds of conceit, is revered by humans and gods, has the invisible features of the Tathāgata's head, and turns the wonderful wheel of the Dharma to teach ten directions.",
        "source": "T03n0159_005:0314c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　盡未來際傳此法，　　令不斷絕三寶種。",
        "translation": "He transmits this teaching as far back as the future, so that the seed of the Three Treasures won't be cut off.",
        "source": "T03n0159_005:0314c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若為飲食起妄心，　　不應讚歎諸男女，　起大慈悲平等意，　　不生分別貧與富。",
        "translation": "If he were to give rise to a false mind over food and drink, he wouldn't praise men and women, arouse great compassion and an equal mind, and not discriminate between the poor and the rich.",
        "source": "T03n0159_005:0314c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　清淨乞食佛所讚，　　一切種智從此生。",
        "translation": "A pure almsbowl meal is praised by the Buddha, and all kinds of cognition arise from it.",
        "source": "T03n0159_005:0314c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三世如來出于世，　　為諸眾生說四食，　段觸思識為其四，　　皆是有漏世間食。",
        "translation": "When the Tathāgatas of the three times came into the world, they explained four foods for sentient beings, four of which are contaminated worldly foods, namely, paragraphs, touch, thought, and consciousness.",
        "source": "T03n0159_005:0314c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　唯有法喜禪悅食，　　乃是聖賢所食者，　汝等厭離世間味，　　當求出世無漏食。",
        "translation": "Only food that brings joy and pleasure to meditation on the Dharma is eaten by noble men, so you should seek uncontaminated food that transcends the world when you're disillusioned with worldly flavors.",
        "source": "T03n0159_005:0314c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，智光菩薩！",
        "translation": "\"Furthermore, Bodhisattva Zhiguang!",
        "source": "T03n0159_005:0314c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出家佛子於諸醫藥不應貪著，若有病時，佗煎藥已所棄捨藥，訶梨毘梨及阿摩勒，取是等藥即應服之，乃至一生服所棄藥，於諸藥等常生知足，如是名為真實沙門。",
        "translation": "A renunciant Buddhist shouldn't be addicted to medicines, and if he were to discard medicines after decocting them when he's ill, he should take these medicines, even after taking them for a lifetime, and always become satisfied with these medicines, which is called a true ascetic.",
        "source": "T03n0159_005:0314c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出家佛子恒服棄藥，是人獲得十種勝利。",
        "translation": "When a renunciant Buddhist always takes the medicine he's discarding, that person attains ten kinds of surpassing benefits.",
        "source": "T03n0159_005:0314c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為十？",
        "translation": "What are the ten?",
        "source": "T03n0159_005:0314c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者為求藥草不近佗人，永息貪求安住正念。",
        "translation": "One, they don't approach wanderers in search of medicinal herbs and permanently stop craving and abide in right mindfulness.",
        "source": "T03n0159_005:0314c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者不淨觀門易得成就，出世之心能得堅固。",
        "translation": "Two, the approach of meditating on impurity is easy to achieve, and the mind that transcends the world can be resolute.",
        "source": "T03n0159_005:0314c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者於諸珍味恒不貪著，速證正智飧禪悅食。",
        "translation": "Third, he'll always abstain from craving for rare foods and quickly realize right knowledge and the joy of eating meditation.",
        "source": "T03n0159_005:0314c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者於諸世間一切財物，常能知足早得解脫。",
        "translation": "Fourth, he's always satisfied with all worldly possessions and attains early liberation.",
        "source": "T03n0159_005:0314c23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者不近世間一切凡夫，親近出世清淨善友。",
        "translation": "Fifth, he doesn't approach all worldly worldlings but becomes close to pure, good friends who transcend the world.",
        "source": "T03n0159_005:0314c24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六者由不嫌惡諸棄藥等，於麤飲食亦得解脫。",
        "translation": "Sixth, because he doesn't dislike medicines and so forth that he discards, he'll also attain liberation from coarse food.",
        "source": "T03n0159_005:0314c25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七者於所重藥永不希望，一切世間無不尊故。",
        "translation": "Seven, he never wishes for medicines that are valuable, so there's nothing in the world that he doesn't respect.",
        "source": "T03n0159_005:0314c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八者速能調伏諸煩惱病，證得如來常住法身。",
        "translation": "Eight, he quickly subdues the afflictive diseases and realizes the Tathāgata's eternally abiding Dharma body.",
        "source": "T03n0159_005:0314c27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九者永斷三界一切煩惱，能療眾生身心重病。",
        "translation": "Nine: He permanently ends all afflictions in the three realms and treats the serious physical and mental illnesses of sentient beings.",
        "source": "T03n0159_005:0314c28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十者能順佛教修菩薩行，福智圓滿得大菩提。",
        "translation": "Ten, they can cultivate the bodhisattva practice in accord with Buddhism, and the perfection of merit and wisdom will lead to great enlightenment.",
        "source": "T03n0159_005:0314c29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智光當知！",
        "translation": "You should know this, Zhiguang!",
        "source": "T03n0159_005:0315a01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我為汝等略說棄藥十種勝利，如是妙行，去來現在出家菩薩皆共修學，汝等應當為諸眾生演說流布無令斷絕，即為如來廣設供養，世間所有財敬供養所不能及，於菩薩行不復退轉，速證無上正等菩提。」",
        "translation": "I will briefly explain for you the ten excellent benefits of renouncing medicine, such wonderful practices, which are commonly practiced by renunciant bodhisattvas in the past and present, and which you should teach and disseminate for all sentient beings without cutting them off, that is, make extensive offerings to the Tathāgata that are beyond the reach of worldly offerings of wealth and respect, never again retrogress in the bodhisattva path, and quickly realize unsurpassed correct perfect enlightenment.\"",
        "source": "T03n0159_005:0315a02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊重說偈言：「智光比丘汝善聽，　　出家所服無垢藥。",
        "translation": "At that point, the Bhagavān addressed the monk in verse, \"Zhiguang monk, you've listened well to this unsullied medicine taken by renunciant monks.",
        "source": "T03n0159_005:0315a07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩妙行此為先，　　眾生有病如己病，　以大悲恩救眾苦，　　復用慈心施安樂。",
        "translation": "This is the first marvelous practice of a bodhisattva, who treats sentient beings as if they were ill themselves, saves sentient beings from suffering with great compassion, and then bestows comfort with kindness.",
        "source": "T03n0159_005:0315a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　最上妙藥與佗人，　　前人所棄而自服，　菩薩不擇貴賤藥，　　但療眾病令安隱。",
        "translation": "The most excellent medicine is given to Tuojin, who takes it himself after being discarded by others. The bodhisattva doesn't choose expensive or cheap medicines, but treats illnesses and makes them comfortable.",
        "source": "T03n0159_005:0315a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　取佗所棄之餘藥，　　飲服以充治所疾，　取佗棄藥有十利，　　三世如來共稱讚。",
        "translation": "Taking the medicine that Tuo discards, drinking it to treat an illness, and taking the medicine that Tuo discards has ten benefits that are praised by the Tathāgatas of the three times.",
        "source": "T03n0159_005:0315a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖求醫藥不近佗，　　永息追求住正念，　不淨觀門易成熟，　　而能遠作菩提因。",
        "translation": "Even though he seeks medicine and doesn't approach Tārā, he always stops pursuing it and abides in right mindfulness, and the gate of impure contemplation matures easily, making it possible to work far away from the causes of enlightenment.",
        "source": "T03n0159_005:0315a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不著甘味離諸貪，　　當求法喜禪悅食，　於世財寶能知足，　　獲得無漏七聖財。",
        "translation": "Not clinging to sweet flavors and free of craving, he seeks food that brings joy and meditative bliss to the Dharma, and he's satisfied with worldly possessions and attains the untainted seven noble assets.",
        "source": "T03n0159_005:0315a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　捨彼凡愚不共住，　　親近聖賢為良友，　由是不嫌眾棄藥，　　亦於飲食斷貪求。",
        "translation": "Abandoning those worldlings and fools who don't dwell together, they become close to the noble ones as good friends, so they don't dislike the medicines they discard and stop craving for food and drink.",
        "source": "T03n0159_005:0315a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　珍膳妙藥不希望，　　世間所以咸尊重，　能療身心煩惱病，　　悟得真如法性身。",
        "translation": "He doesn't wish for precious foods and wonderful medicines, which are so well-respected in the world and can treat the illnesses of physical and mental afflictions and awaken to the true nature of the Dharma body.",
        "source": "T03n0159_005:0315a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　永斷三界諸習氣，　　證得無上真解脫，　能順佛教趣菩提，　　福智圓成報身果。",
        "translation": "He permanently ends the karmic impressions of the three realms, realizes unsurpassed true liberation, follows Buddhism's path to enlightenment, and perfects the fruit of the reward body with merit and wisdom.",
        "source": "T03n0159_005:0315a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝等佛子皆修學，　　當坐金剛真道場。",
        "translation": "You Buddhist disciples all train and will sit in the true site of the vajra path.",
        "source": "T03n0159_005:0315a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，智光！",
        "translation": "\"Furthermore, Zhiguang!",
        "source": "T03n0159_005:0315a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出家菩薩遠離喧鬧，住阿蘭若修攝其心，無量千歲以求佛道，三世如來離諸喧鬧寂然閑居，萬行增修證菩提果，緣覺、聲聞一切賢聖，證得聖果亦復如是。",
        "translation": "That renunciant bodhisattva parts with the hustle and bustle, abides in a forest, cultivates his mind, and seeks the Buddha Way for measureless thousands of years; the tathāgatas of the three times part with the hustle and bustle and quietly abide, increasing their ten thousand practices and realizing the fruit of enlightenment; and so do all the good and noble pratyekabuddhas and śrāvakas realize the noble fruit.",
        "source": "T03n0159_005:0315a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其阿蘭若有十種德，能令證得三菩提果。",
        "translation": "There are ten virtues in those ascetics that enable them to realize the three fruits of enlightenment.",
        "source": "T03n0159_005:0315b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名為十種勝德？",
        "translation": "What are these ten excellent qualities?",
        "source": "T03n0159_005:0315b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者為得自在住阿蘭若，四威儀中不屬佗故。",
        "translation": "One, he abides in a forest for the sake of attaining independence, which is because he doesn't belong to the four comportments.",
        "source": "T03n0159_005:0315b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者離我我所名阿蘭若，於樹下時無執著故。",
        "translation": "Two, he is free of self and what's called self and what's called araṇya because he doesn't cling to it when he's under a tree.",
        "source": "T03n0159_005:0315b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者於臥具等無所愛著，由斯當臥四無畏床。",
        "translation": "Third, he has no attachment to bedding or other things, so he'll lay on the four fearless beds.",
        "source": "T03n0159_005:0315b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者阿蘭若處三毒微薄，離貪瞋癡所緣境故。",
        "translation": "Fourth, the three poisons in that forest are weak, because it's free of the objects of craving, ill-will, and delusion.",
        "source": "T03n0159_005:0315b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者樂阿蘭若修遠離行，不求人天五欲樂故。",
        "translation": "Five, he enjoys the practice of seclusion in a forest, so he doesn't seek the five human and divine pleasures.",
        "source": "T03n0159_005:0315b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六者能捨喧鬧住閑寂處，修習佛道不惜軀命。",
        "translation": "Sixth, he can abandon the hustle and bustle and dwell in a quiet place, cultivating the Buddha Way without shying away from his body and life.",
        "source": "T03n0159_005:0315b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七者愛樂寂靜離世言詞，弃捨凡愚無散亂故。",
        "translation": "Seventh, he enjoys quiescence and seclusion from worldly talk, so he discards worldly foolishness and doesn't become distracted.",
        "source": "T03n0159_005:0315b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八者世出世間一切事業易得成就，無障礙故。",
        "translation": "Eight, it's because all worldly and transmundane endeavors are easily accomplished and there are no obstacles.",
        "source": "T03n0159_005:0315b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九者阿蘭若處是三昧室，能得百千大三昧故。",
        "translation": "Nine, because the forest is a room of concentration, he can attain a hundred thousand great samādhis.",
        "source": "T03n0159_005:0315b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十者清淨如空以為舍宅，心無障礙得大智故。",
        "translation": "Ten, because it's pure as emptiness and serves as a house, the mind is unobstructed and attains great wisdom.",
        "source": "T03n0159_005:0315b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智光當知，阿蘭若處有如是等無量功德，以是因緣，出家佛子誓捨身命不離山林。",
        "translation": "Zhiguang should know that this forest has measureless virtues, and it's for this reason that renunciant Buddhists vow to abandon their lives and not leave the forest.",
        "source": "T03n0159_005:0315b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為聽法、供養病人師僧父母，出阿蘭若入聚落中，宜速還歸於蘭若處。",
        "translation": "If he leaves that forest and enters a village in order to listen to the teaching and support his patients, teachers, monks, and parents, it's advisable to quickly return to that forest.",
        "source": "T03n0159_005:0315b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有因緣未得歸者，應作是想：『今此聚落猶如山林，所得財物虛假如夢，若有所得不應貪著。』",
        "translation": "If there are reasons that prevent you from returning, you should think, 'Now, this village is like a mountain forest, and the possessions I've obtained are nothing but a dream; if I had something to gain, I wouldn't cling to it.'",
        "source": "T03n0159_005:0315b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是佛子是摩訶薩。」",
        "translation": "Thus, the Buddha's son is a mahāsattva.\"",
        "source": "T03n0159_005:0315b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊重說偈言：「　　智光汝等善諦聽，　　無煩惱人所住處，　遠離喧鬧處寂靜，　　此是神仙所居處。",
        "translation": "At that point, the Bhagavān addressed the audience in a verse, saying, \"Zhiguang, you listen well, for you are untroubled people who dwell in places that are quiet and free from noise, and these are the dwelling places of sages.",
        "source": "T03n0159_005:0315b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三世菩薩求菩提，　　於蘭若中成正覺，　緣覺聲聞諸聖眾，　　亦於此處證菩提。",
        "translation": "The bodhisattvas of the three times who seek enlightenment become perfectly enlightened in this forest, and the sages who are pratyekabuddhas and direct disciples also realize enlightenment here.",
        "source": "T03n0159_005:0315b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　住阿蘭若獲十利，　　能令證得三乘果，　自在遊行如師子，　　四威儀中無繫縛。",
        "translation": "They attain ten benefits from abiding in that forest, which enable them to realize the fruit of the three vehicles, travel freely like a lion, and have no fetters among the four comportments.",
        "source": "T03n0159_005:0315b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　山林樹下聖所樂，　　無我我所名蘭若，　衣服臥具無繫著，　　坐四無畏師子座。",
        "translation": "Under the trees and mountains, it's a noble pleasure to be without self or what belongs to self, called a forest, to be unencumbered by clothing or bedding, and to sit on the four fearless lion seats.",
        "source": "T03n0159_005:0315b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　離諸煩惱名蘭若，　　一切貪愛無所著，　常居物外厭塵勞，　　不樂世間五欲樂。",
        "translation": "He's called 'Lanjor' who's free of affliction, has no attachments to any cravings, lives outside of things, tires of defilement, and doesn't enjoy the five worldly pleasures.",
        "source": "T03n0159_005:0315c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　遠離憒鬧寂靜者，　　棄捨身命求佛道，　能住寂靜無人聲，　　於諸散亂心不起。",
        "translation": "Far removed from the hustle and bustle of tranquility, he abandons his body and life and seeks the Buddha Way, abiding in stillness and without human noise, and his mind is free of distractions.",
        "source": "T03n0159_005:0315c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世出世間諸善業，　　心無障礙皆成就，　由是蘭若為根本，　　能生百千諸三昧。",
        "translation": "His mind is unobstructed by the accomplishment of worldly and transmundane good actions, and because this is the root of wisdom, he can give rise to a hundred thousand samādhis.",
        "source": "T03n0159_005:0315c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以大空寂為虛室，　　行者身心無障礙，　具足如是十勝利，　　是故眾聖常居止。",
        "translation": "With great emptiness and quiescence as his empty chamber, his mind and body are unobstructed as he practices, and he possesses these ten excellent benefits; therefore, the sages always abide at rest.",
        "source": "T03n0159_005:0315c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智光汝等諸佛子，　　若欲速成一切智，　乃至夢中莫捨離，　　阿蘭若處菩提道。",
        "translation": "\"Zhiguang, you Buddhist disciples, if you want to quickly achieve omniscience, don't abandon it even in a dream, for it's the path to enlightenment in the forest.",
        "source": "T03n0159_005:0315c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我滅度後發心者，　　而能住於蘭若處，　不久當坐寶華王，　　證得法身常樂果。」",
        "translation": "Those of you who have arisen the intention after my extinction and are able to abide in the forest, will soon sit as the jeweled-flower king and realize the fruit of the eternal bliss of the Dharma body.\"",
        "source": "T03n0159_005:0315c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊說是法時，無量百千初發心者，於無上道得不退轉。",
        "translation": "At the time the Bhagavān spoke this teaching, measureless hundreds of thousands of people who had first set their minds to it attained irreversibility on the unsurpassed path.",
        "source": "T03n0159_005:0315c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，智光等諸菩薩眾，得陀羅尼具大神通，百萬人天發菩提意悟三解脫。",
        "translation": "At the time, Zhiguang and the other bodhisattvas attained the dhāraṇī and possessed great supernormal powers, and millions of humans and gods aroused the aspiration for enlightenment and awakened to the three liberations.",
        "source": "T03n0159_005:0315c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，如來告諸大眾：「若有淨信善男子、善女人，得聞如是四無垢性甚深法門，受持讀習解說書寫，如是人等所生之處遇善知識，修菩薩行永不退轉，不為一切諸業煩惱之所擾亂，而於現世獲大福智，住持三寶得自在力，紹繼佛種使不斷絕，命終必生知足天宮，奉覲彌勒證不退位，龍華初會得聞正法，授菩提記速成佛道。",
        "translation": "It was then that the Tathāgata addressed the crowd, \"If there are pure faithful good sons and good women who hear these four profound teachings on the nature of immaculateness and accept, read, study, interpret, and write them down, then such people will meet a good teacher wherever they're born, cultivate the bodhisattva practice and never turn back, won't be disturbed by the afflictions of all actions, attain great merit and wisdom in the present life, abide in the Three Treasures and attain unimpeded power, perpetuate the Buddha lineage so that it doesn't end, and will surely be born in the palace of the satisfied gods at the end of their lives, pay homage to Maitreya and realize the nonretrogressing position, hear the right teaching at the first assembly of the dragon-flower, and be granted the mark of enlightenment to quickly achieve the Buddha Way.",
        "source": "T03n0159_005:0315c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲願生十方佛土，隨其所願而得往生，見佛聞法，究竟不退阿耨多羅三藐三菩提。」",
        "translation": "Those who wish to be born in the Buddha lands of the ten directions will be reborn according to their wishes, see the Buddha and hear the Dharma, and finally not regress from supreme perfect enlightenment.\"",
        "source": "T03n0159_005:0315c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘本生心地觀經阿蘭若品第五",
        "translation": "Dasheng ben sheng xindi guan jing aranyak pin 5",
        "source": "T03n0159_005:0315c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，會中有一菩薩摩訶薩，名常精進，承佛威神即從座起，偏袒右肩右膝著地，合掌恭敬，而白佛言：「世尊！",
        "translation": "At the time, a bodhisattva in the assembly named eternally zealous rose from his seat in response to the Buddha's authoritative power, bared his right shoulder, knelt on his right knee, put his palms together in respect, and said to the Buddha, \"Bhagavān!",
        "source": "T03n0159_005:0315c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛所說，阿蘭若處是菩提道場，若有發心求菩提者，不應捨離阿蘭若處。",
        "translation": "As the Buddha has taught, the forest is the site of the path to enlightenment, and if someone sets out to pursue enlightenment, they shouldn't abandon the forest.",
        "source": "T03n0159_005:0316a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是蘭若中有多眾生，虎豹豺貌毒蟲惡獸，乃至飛鳥及與獵師，不識如來、不聞正法、又不敬僧，此諸有情無復善根遠離解脫，何故如來令修學人住阿蘭若速得成佛？",
        "translation": "Since there are so many sentient beings in that forest, such as tigers, jaguars, jackals, venomous insects, vicious animals, birds of prey, and hunters who don't know the Tathāgata, don't hear the right teaching, and don't revere the saṃgha, these sentient beings lack good roots and are free from liberation.",
        "source": "T03n0159_005:0316a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊！",
        "translation": "Venerable Bhagavān!",
        "source": "T03n0159_005:0316a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為諸眾生分別解說決疑令喜，發菩提心使不退轉。」",
        "translation": "He teaches each sentient being separately, resolves doubts, and causes them to rejoice, and he arouses the mind of enlightenment so that they won't turn back.\"",
        "source": "T03n0159_005:0316a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告常精進菩薩：「善哉，善哉！",
        "translation": "It was then that the Buddha addressed the Ever-Effort Bodhisattva, \"Good, good!",
        "source": "T03n0159_005:0316a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0159_005:0316a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝以大慈問於如來清淨解脫，饒益未來諸修行者，功德無量。",
        "translation": "With great kindness, you asked the Tathāgata about pure liberation and the immeasurable merits of benefiting future practitioners.",
        "source": "T03n0159_005:0316a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦聽諦聽，善思念之，吾今為汝分別演說阿蘭若處種種功德。」",
        "translation": "Listen closely, consider it well, and I will now explain for you the various virtues of the abodes of Aranyak-saṃbha.\"",
        "source": "T03n0159_005:0316a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唯然，世尊！",
        "translation": "\"Yes, Bhagavān!",
        "source": "T03n0159_005:0316a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願樂欲聞。」",
        "translation": "May I wish to hear about it.\"",
        "source": "T03n0159_005:0316a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告常精進菩薩：「如汝所說，阿蘭若處得成聖者，山林之中多諸眾生，以何因緣不得成佛？",
        "translation": "It was then that the Buddha addressed the Bodhisattva of Constant Exertion, \"As you said, what are the causes and conditions that prevent many sentient beings in the forest and mountains from becoming buddhas when they attain sainthood in the forest?",
        "source": "T03n0159_005:0316a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是義不然。",
        "translation": "This doesn't mean that.",
        "source": "T03n0159_005:0316a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0159_005:0316a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸眾生不識三寶，不知厭足，不識善惡，於山林中，雖有世間種種珍寶，而不能知伏藏之處，菩薩摩訶薩即不如是。",
        "translation": "Those sentient beings don't know the Three Treasures, aren't satisfied, and don't know good from evil, and although they have all the world's treasures in the mountains and forests, they can't know where they're hidden, and the bodhisattvas, the Mahāsattvas, are not like that.",
        "source": "T03n0159_005:0316a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0159_005:0316a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩能知佛法僧寶是出世寶，七珍伏藏是世間寶，悉能辨其種種色相，知其所在而不貪求，亦不樂見，何況手取？",
        "translation": "A bodhisattva can know that the buddha, Dharma, and Saṃgha treasures are transmundane treasures and that the seven treasures of the ambrosia store are worldly treasures, and he can discern their various forms and characteristics, knowing where they are and not desiring them, and not delighting in their views, so why would he want to take them with his hands?",
        "source": "T03n0159_005:0316a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩出家，發堅固心不惜身命，捨離父母六親眷屬，樂住山林常作是念：『假使三千大千世界劫盡之時，七日並出，火災熾然焚燒萬物，日月星辰妙高山王，及七金山鐵圍山等，時至皆散。",
        "translation": "When a bodhisattva leaves home, he arouses a resolute resolve not to spare his life, parts with his parents and six close family members, and happily abides in the mountains and forests, always thinking, 'Suppose seven suns and moons, stars, the king of marvelous mountains, and seven mountains of gold and iron mountains were to burn everything when the eons of the 3,000 great one-thousand worlds end and seven suns and stars emerge together, and they all disperse at once.",
        "source": "T03n0159_005:0316a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三界之頂非非想天，八萬劫盡，還生下地，轉輪聖王千子圍遶，七寶眷屬四洲咸伏，壽命報盡須臾不停。",
        "translation": "At the top of the three realms and in the non-non-conceptual heaven, they'll end 80,000 eons and be reborn back down in the lower realms, surrounded by a thousand sons of the wheel-turning sage king, with their seven-jeweled retinue subdued on four continents, and their life span will end without stopping for a moment.",
        "source": "T03n0159_005:0316a26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今亦爾，假使壽年滿一百歲，七寶具足受諸快樂，琰魔使至不免無常。』",
        "translation": "Now, too, suppose I were to reach the age of 100 years, am replete with seven treasures, and experience many pleasures, and Diem's demons come along and prevent me from being impermanent.'",
        "source": "T03n0159_005:0316a28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是思惟：『我今不如代其父母及諸眾生修菩薩行，當得金剛不壞之身，還來三界救度父母。』",
        "translation": "He had this thought, 'Now, why don't I take the place of my parents and other sentient beings and cultivate the bodhisattva practice, so that I can attain the indestructible body of the vajra and return to the three realms to save my parents?'",
        "source": "T03n0159_005:0316b01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是願已，住阿蘭若，為諸眾生發弘誓願。",
        "translation": "After making this vow, he stayed at the forest and made a great vow for all sentient beings.",
        "source": "T03n0159_005:0316b03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上根菩薩發是願言：『願我未得成佛已來，常於露地長坐不臥。』",
        "translation": "The bodhisattva with superior faculties made this vow, saying, 'May I always remain in the open ground, sitting and not lying down, since before I became a buddha.'",
        "source": "T03n0159_005:0316b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中根菩薩發是願言：『願我未得成佛已來，於樹葉中常坐不臥。』",
        "translation": "The middle-rooted bodhisattva makes this vow, saying, 'May I always sit and not lie down in the leaves of a tree since I've yet to become a buddha.'",
        "source": "T03n0159_005:0316b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下根菩薩發是願言：『願我未得成佛已來，於石室中常坐不臥。』",
        "translation": "The bodhisattvas with lower faculties make this vow, saying, 'May I always sit and not lie down in a stone dwelling since before I became a buddha.'",
        "source": "T03n0159_005:0316b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是三根出家菩薩，坐三種座，各作是念：『過去菩薩坐於此座，而能證得陀羅尼門功德自在；過現未來諸菩薩等皆於此座，得陀羅尼修證自在；我亦如是今坐此處，必當成就於陀羅尼而得自在。",
        "translation": "Thus, a renunciant bodhisattva with three faculties sits on three kinds of seats and thinks, 'In the past, bodhisattvas who sat on this seat were able to realize the merit and mastery of the dhāraṇī; in the past, present, and future, bodhisattvas and others will attain the mastery of the cultivation of the dhāraṇī while sitting on this seat; I too will sit here now and surely achieve the mastery of the dhāraṇī.",
        "source": "T03n0159_005:0316b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未成就得自在者，終不捨離阿蘭若處。』",
        "translation": "If I haven't yet achieved it and attained mastery, I'll never part with the forest.'",
        "source": "T03n0159_005:0316b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「或有菩薩，未得圓滿四無量心，終不捨離阿蘭若處。",
        "translation": "\"Perhaps there's a bodhisattva who hasn't yet attained the full accomplishment of the four immeasurable states of mind and will never abandon the forest for the trees.",
        "source": "T03n0159_005:0316b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未得圓滿五通神力，終不捨離阿蘭若處。",
        "translation": "Some bodhisattvas who haven't yet attained the full accomplishment of the five supernormal powers will never part with the forest for the arhats.",
        "source": "T03n0159_005:0316b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未得圓滿六波羅蜜，終不捨離阿蘭若處。",
        "translation": "Perhaps there's a bodhisattva who hasn't yet attained the perfection of the six perfections and never parted with the forest for the arhats.",
        "source": "T03n0159_005:0316b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未得圓滿善巧方便，終不捨離阿蘭若處。",
        "translation": "Perhaps there's a bodhisattva who hasn't attained the perfection of skillful means and never leaves the forest for dead.",
        "source": "T03n0159_005:0316b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未能調伏一切有情，終不捨離阿蘭若處。",
        "translation": "Sometimes a bodhisattva doesn't subdue all sentient beings and never abandons the forest for the rest of his life.",
        "source": "T03n0159_005:0316b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未得圓滿四種攝法，終不捨離阿蘭若處。",
        "translation": "Sometimes a bodhisattva doesn't attain the full accomplishment of the four methods of gathering in sentient beings and never abandons the forest for the rest of his life.",
        "source": "T03n0159_005:0316b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未能修習六念之法，終不捨離阿蘭若處。",
        "translation": "Sometimes a bodhisattva fails to cultivate the six methods of mindfulness and never abandons the forest for the rest of his life.",
        "source": "T03n0159_005:0316b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未能成就多聞智慧，終不捨離阿蘭若處。",
        "translation": "Sometimes a bodhisattva fails to achieve well-versed wisdom and never abandons the forest for the night.",
        "source": "T03n0159_005:0316b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未能成就堅固信力，終不捨離阿蘭若處。",
        "translation": "Sometimes a bodhisattva fails to achieve the power of resolute faith and never abandons the forest for the night.",
        "source": "T03n0159_005:0316b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未能斷除六十二見，終不捨離阿蘭若處。",
        "translation": "Sometimes a bodhisattva fails to eliminate the sixty-two views and never abandons the forest for the rest of his life.",
        "source": "T03n0159_005:0316b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未能修習八種正道，終不捨離阿蘭若處。",
        "translation": "Sometimes a bodhisattva fails to cultivate the eightfold correct path and never abandons the forest for the rest of his life.",
        "source": "T03n0159_005:0316b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未能永斷二障習氣，終不捨離阿蘭若處。",
        "translation": "Sometimes a bodhisattva fails to permanently eliminate the two hindering karmic impressions and never abandons the forest for the rest of his life.",
        "source": "T03n0159_005:0316b29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未能圓滿隨病與藥微妙智慧，終不捨離阿蘭若處。",
        "translation": "Sometimes a bodhisattva doesn't perfect the subtle wisdom that administers medicine according to illness, and he never abandons the forest for the rest of his life.",
        "source": "T03n0159_005:0316c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未能圓滿大菩提心，終不捨離阿蘭若處。",
        "translation": "Sometimes a bodhisattva doesn't perfect the mind of great bodhi and never abandons the forest for the rest of his life.",
        "source": "T03n0159_005:0316c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未能圓滿恒沙三昧，終不捨離阿蘭若處。",
        "translation": "Sometimes a bodhisattva fails to perfect the concentration of constellations and never abandons the forest for the rest of his life.",
        "source": "T03n0159_005:0316c04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未能成就無量神通，終不捨離阿蘭若處。",
        "translation": "Sometimes a bodhisattva fails to achieve measureless supernormal powers, but never abandons the forest for the night.",
        "source": "T03n0159_005:0316c05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，以定通力見十八空而心不驚，如是大事若未成就，終不捨離阿蘭若處。",
        "translation": "Perhaps there's a bodhisattva who sees the 18 kinds of emptiness with the power of concentration and isn't startled at heart, and if he hasn't accomplished such a great matter, he never leaves the forest for the trees.",
        "source": "T03n0159_005:0316c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未能圓滿一切智智，終不捨離阿蘭若處。",
        "translation": "Perhaps there's a bodhisattva who hasn't perfected omniscience and wisdom but never abandons the abode of Āraṇyaya.",
        "source": "T03n0159_005:0316c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未得圓滿一切種智，終不捨離阿蘭若處。",
        "translation": "Perhaps there's a bodhisattva who has yet to attain the full accomplishment of omniscience and never abandons the forest for the rest of his life.",
        "source": "T03n0159_005:0316c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未得修習三十七種菩提分法，終不捨離阿蘭若處。",
        "translation": "Perhaps there's a bodhisattva who hasn't yet attained the cultivation of the thirty-seven factors of enlightenment and never leaves the forest for the trees.",
        "source": "T03n0159_005:0316c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未得圓滿十地萬行，終不捨離阿蘭若處。",
        "translation": "Perhaps there's a bodhisattva who hasn't yet perfected the ten thousand practices of the ten stages and never leaves the forest for dead.",
        "source": "T03n0159_005:0316c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，於百劫中未能修行相好之業，終不捨離阿蘭若處。",
        "translation": "Perhaps there's a bodhisattva who hasn't cultivated the activity of good appearance for a hundred eons but never leaves the forest for dead.",
        "source": "T03n0159_005:0316c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未得圓滿如來四智，終不捨離阿蘭若處。",
        "translation": "Sometimes a bodhisattva doesn't attain the full accomplishment of the Tathāgata's four kinds of wisdom, but he never abandons the forest for the arhats.",
        "source": "T03n0159_005:0316c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，未能圓滿證大涅槃，終不捨離阿蘭若處。",
        "translation": "Perhaps there's a bodhisattva who hasn't fully realized the great state of nirvāṇa and never parted with the forest for the rest of his life.",
        "source": "T03n0159_005:0316c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有菩薩，坐金剛座未能證得阿耨多羅三藐三菩提，常坐不起，是名菩薩阿蘭若行。",
        "translation": "Sometimes a bodhisattva sits on the adamantine throne and doesn't realize supreme perfect enlightenment, but he remains seated and doesn't arise, which is called a bodhisattva's araṇya practice.",
        "source": "T03n0159_005:0316c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0159_005:0316c20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出家菩薩發菩提心入於山林，坐三種座鍊磨身心，經三大劫而修萬行，證得無上正等菩提。」",
        "translation": "The renunciant bodhisattva arouses the aspiration for enlightenment, enters a mountain grove, sits on three kinds of seats, refines body and mind, and cultivates myriad practices over three great eons to realize unsurpassed perfect enlightenment.\"",
        "source": "T03n0159_005:0316c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊重說偈言：「昔諸如來因地時，　　住阿蘭若離塵處，　伏斷煩惱所知障，　　超過三界證菩提。",
        "translation": "It was then that the Bhagavān spoke in verse, \"In the past, when the tathāgatas were in the causal stage, they lived in a forest free of dust, subdued the afflictive and cognitive hindrances, and transcended the three realms to realize enlightenment.",
        "source": "T03n0159_005:0316c23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　過去菩薩修行願，　　以阿蘭若為舍宅，　阿僧祇劫修福智，　　十地究竟證三身。",
        "translation": "In the past, bodhisattvas cultivated their practice and vowed to use forest as their abode, cultivated merit and wisdom for incalculably long eons, and fully realized the three-body at the tenth ground.",
        "source": "T03n0159_005:0316c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　未來菩薩求佛果，　　入於深山修妙行，　斷除二障生死因，　　當證三空真解脫。",
        "translation": "In the future, bodhisattvas will seek the Buddhahood, enter deep mountains and cultivate marvelous practices, eliminate the two hindrances as causes of birth and death, and then realize the true liberation of the three kinds of emptiness.",
        "source": "T03n0159_005:0316c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　現在十方諸菩薩，　　修持萬行住空閑，　不惜身命求菩提，　　念念證得無生智。",
        "translation": "Now, bodhisattvas in the ten directions cultivate myriad practices, abide in emptiness, spare no body and life in pursuit of enlightenment, and realize the wisdom of nonarising with each passing thought.",
        "source": "T03n0159_005:0317a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若欲速證深三昧，　　因修妙定起神通，　阿蘭若處心無諍，　　能變大地為七寶。",
        "translation": "If they want to quickly realize deep concentration, they cultivate marvelous concentration and give rise to supernormal powers, work in forest without strife, and transform the earth into seven treasures.",
        "source": "T03n0159_005:0317a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若欲遊戲十方國，　　往來自在運神通，　供養諸佛利群生，　　住阿蘭若無畏處。",
        "translation": "If he wants to play in the lands of the ten directions, freely travel with supernormal powers, make offerings to the buddhas and benefit sentient beings, and abide in the fearless abode of Araṇya.",
        "source": "T03n0159_005:0317a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　欲證有無如幻智，　　了達諸法本來空，　住阿蘭若菩提場，　　令眾亦入真解脫。",
        "translation": "They want to realize the cognition of existence and nonexistence as illusion, comprehend the original emptiness of all things, and abide in the site of araṇya bodhi, causing all people to enter true liberation as well.",
        "source": "T03n0159_005:0317a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若欲速得如如智，　　證會諸法如如性，　盡大劫海利群生，　　當住蘭若空寂處。",
        "translation": "If he wants to quickly attain the knowledge that things are as they are, realize their true nature, and exhaust the great ocean of eons for the benefit of sentient beings, he should abide in the place of the emptiness and quiescence of existence in Araṇya.",
        "source": "T03n0159_005:0317a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人欲得難思智，　　妙高山王納芥子，　山王芥子不壞相，　　入於蘭若神通室。",
        "translation": "If someone wants to attain inconceivable knowledge, the king of the Marvelous Mountains collects a mustard seed, and the mustard seed of the king of mountains has an indestructible shape, entering the room of Lanjiao's supernormal powers.",
        "source": "T03n0159_005:0317a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人欲得無礙智，　　以一妙音演說法，　隨類眾生各得解，　　當住蘭若修妙觀。",
        "translation": "If someone wants to attain unhindered cognition, he speaks Dharma with a single, marvelous voice that's understood by each type of sentient being, and he should abide in Lanna and cultivate subtle contemplation.",
        "source": "T03n0159_005:0317a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若欲無生及無滅，　　應現十方諸國土，　放光說法利群生，　　莫離蘭若空寂室。",
        "translation": "If he wants nonarising and noncessation, he should manifest lands in the ten directions, shining his light and teaching to benefit sentient beings, and nowhere should he leave the empty and quiescent room of Lumbinī.",
        "source": "T03n0159_005:0317a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若以足指按大地，　　令十方界皆振動，　覩相發心除邪見，　　當住蘭若觀自心。",
        "translation": "If he presses his toes against the earth, causing the whole world in ten directions to stir, seeing the features and arousing his mind to rid it of wrong views, he should abide in Lanna and contemplate his own mind.",
        "source": "T03n0159_005:0317a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若欲諸佛出現時，　　最初獻於微妙供，　檀波羅蜜皆圓滿，　　住阿蘭若修妙行。",
        "translation": "If he wants the buddhas to appear, he initially makes a subtle offering, completes the perfection of the perfection of giving, and abides in araṇya cultivating wondrous practices.",
        "source": "T03n0159_005:0317a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人於佛涅槃時，　　最後供養成檀義，　永斷貧窮及八難，　　誓願住於蘭若中。",
        "translation": "If someone makes a final offering of the meaning of donations at the time of the Buddha's nirvāṇa, permanently ends poverty and the eight difficulties, and vows to abide in a forest.",
        "source": "T03n0159_005:0317a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若欲福智皆圓滿，　　未來諸佛臨涅槃，　受佛付囑廣弘宣，　　住阿蘭若修六念。",
        "translation": "If he wants to perfect both merit and wisdom, then in the future, when the buddhas are approaching nirvāṇa, he'll be commissioned by the Buddha to proclaim them and cultivate the six kinds of mindfulness while abiding in araṇya.",
        "source": "T03n0159_005:0317a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於諸佛涅槃後，　　結集遺法度眾生，　助於諸佛讚真乘，　　住阿蘭若空寂舍。",
        "translation": "If he were to gather the remaining teachings to save sentient beings after the buddhas' nirvāṇa and assist the buddhas in praising the true vehicle, he would abide in the abode of emptiness and quiescence in Araṇya.",
        "source": "T03n0159_005:0317a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人天大師薄伽梵，　　難見難遇過優曇，　若欲奉覲修供養，　　當住蘭若弘悲願。",
        "translation": "The great teacher among men and gods, the Bhagavān, is harder to see and harder to encounter than the Udam, so if you want to pay respects and cultivate offerings, you must abide in that forest and make great vows of compassion.",
        "source": "T03n0159_005:0317a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾寶之尊法為最，　　成佛化利皆由此，　如人欲得常聽法，　　住阿蘭若修梵行。",
        "translation": "The most honored of all treasures is the Dharma, and it's here that the buddhas become buddhas and the benefits of transformation are all derived, so if a person wants to attain a constant ear for the Dharma, they must abide in a forest and cultivate the religious practice.",
        "source": "T03n0159_005:0317a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　始從今身至佛身，　　常願發心弘正教，　乃至未得大菩提，　　念念不捨阿蘭若。",
        "translation": "From this body to the Buddha's body, he always wishes to arouse his mind to spread the correct teaching, and even before he attains great enlightenment, he's mindful not to abandon Āraṇḍa.",
        "source": "T03n0159_005:0317b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人欲報父母恩，　　代於父母發誓願，　入阿蘭若菩提場，　　晝夜常修於妙道。",
        "translation": "If someone wants to repay the kindness of their parents, they make a vow on their behalf to enter the site of araṇya's enlightenment and cultivate the wondrous path day and night.",
        "source": "T03n0159_005:0317b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若欲現世增福智，　　當來不墮八難中，　如是有情發善心，　　住阿蘭若修悲願。",
        "translation": "If he wants to enhance merit and knowledge in the present life, so that he won't fall into the eight difficulties in the future, then he gives rise to the good intention of such sentient beings and cultivates the vow of compassion while staying at Araṇḍa.",
        "source": "T03n0159_005:0317b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三世菩薩求真覺，　　得道涅槃蘭若中，　是故名為大道場，　　三乘聖眾皆同處。",
        "translation": "The bodhisattvas of the three times seek true awakening and attain the path to nirvāṇa in a forest, which is therefore called the site of the great way, where all the sages of the three vehicles share the same place.",
        "source": "T03n0159_005:0317b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩厭苦入山林，　　為度群生求聖道，　自未成佛先度佗，　　六道四生皆悲愍。",
        "translation": "The bodhisattva wearies of suffering and enters the mountains to save sentient beings and pursue the noble path, first saving them before becoming a buddha, and then pitiably caring for the four beings in the six destinies.",
        "source": "T03n0159_005:0317b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　上根菩薩居露地，　　中根菩薩居葉中，　下根菩薩居石室，　　未成佛道常不臥。",
        "translation": "A bodhisattva of superior faculties lives in an open forest, a bodhisattva of middling faculties lives in a leafy forest, and a bodhisattva of inferior faculties lives in a stone dwelling, where he never lies down before attaining Buddhahood.",
        "source": "T03n0159_005:0317b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三世菩薩住蘭若，　　得陀羅尼自在力，　今我誓同菩薩心，　　未得總持恒止此。",
        "translation": "The bodhisattvas of the three times abide in Laṅkā, attaining the unimpeded power of the dhāraṇī, and now I vow to share the bodhisattvas' mindset and remain here until I attain the Dharma mastery.",
        "source": "T03n0159_005:0317b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　得大菩提在蘭若，　　入大圓寂由住處，　菩薩起於金剛智，　　斷惑證真成妙覺。",
        "translation": "Attaining great enlightenment in Laṅkāra, entering into great perfect tranquility from his abode, the bodhisattva arises from adamantine wisdom, cutting off mental disturbances and realizing true enlightenment.",
        "source": "T03n0159_005:0317b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　廣化眾生遊聚落，　　為求寂滅樂山林，　萬行因滿果亦圓，　　盡未來時度群品。」",
        "translation": "He widely educates sentient beings and travels to villages, seeks cessation and enjoys the mountains and forests, fulfills the causes of his myriad actions and perfects their fruition, and liberates a multitude of sentient beings for as long as possible in the future.\"",
        "source": "T03n0159_005:0317b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊，演說如是出家菩薩阿蘭那行，無量菩薩證極喜地；恒河沙等無數菩薩，永離相用微細煩惱，證不動地；不可說不可說菩薩摩訶薩，斷一切障入妙覺地；無邊有情發無等等阿耨多羅三藐三菩提心；九萬七千眾生，遠塵離垢得法眼淨。",
        "translation": "It was then that the Bhagavān explained thus the renunciant bodhisattvas' practice of araṇya, measureless bodhisattvas who realized the stage of ultimate bliss, countless bodhisattvas like the Ganges Sands who became permanently free of the subtle afflictions of form and function and realized the stage of immovability, ineffable and inexplicable bodhisattvas and mahāsattvas who cut off all hindrances and entered the stage of marvelous awakening, limitless sentient beings who developed the unsurpassed mind of unsurpassed, correct, and complete enlightenment, and ninety-seven thousand sentient beings who became dustless and spotless and attained purification of the Dharma eye.",
        "source": "T03n0159_005:0317b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本生心地觀經卷第五",
        "translation": "Ben sheng xin di guan jing, vol. 5",
        "source": "T03n0159_005:0317b26_0",
        "is_bad_quality": false
    }
]