[
    {
        "source_sentence": "佛本行集經卷第五十七",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Volume 57",
        "source": "T03n0190_057:0914b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隋天竺三藏闍那崛多譯",
        "translation": "Sui Tianzhu Tripiṭaka Jñānagupta Translation",
        "source": "T03n0190_057:0914c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "難陀因緣品下",
        "translation": "Second Chapter of Nanda's Causes and Conditions",
        "source": "T03n0190_057:0914c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告長老難陀：「如是如是。",
        "translation": "It was then that the Buddha addressed the elder Nandana, \"So it is.",
        "source": "T03n0190_057:0914c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人親近諸惡知識，共為朋友，交往止住，雖經少時共相隨順，後以惡業相染習故，令其惡聲名聞遠至。」",
        "translation": "Suppose a person approaches bad associates, becomes friends with them, and stops interacting with them, and even though they follow them for a little while, later, because of the defiling influence of bad actions, their bad reputation is heard far and wide.\"",
        "source": "T03n0190_057:0914c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊因斯事故，而說偈言：「猶如在於魚鋪上，　　以手執取一把茅，　其人手即同魚臭，　　親近惡友亦如是。」",
        "translation": "It was then that the Bhagavān spoke a verse because of this incident, saying, \"It's like holding a handful of grass in your hand while you're on a fish pile, and your hand smells like fish, so is being close to a bad friend.\"",
        "source": "T03n0190_057:0914c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊又共長老難陀，至於一賣香邸，見彼邸上有諸香裹，見已即告長老難陀作如是言：「難陀！",
        "translation": "At the time, the Bhagavān also went with the elder Nandanavana to an incense vendor's residence and saw the incense wrapped around it.",
        "source": "T03n0190_057:0914c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝來取此邸上諸香裹物。」",
        "translation": "Come, you, take these bundles of incense from this mansion.\"",
        "source": "T03n0190_057:0914c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "難陀爾時即依佛教，於彼邸上取諸香裹。",
        "translation": "Nanda then complied with the Buddha and took the bundles of incense from that mansion.",
        "source": "T03n0190_057:0914c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告難陀：「汝於漏刻一移之頃，捉持香裹然後放地。」",
        "translation": "The Buddha told Nandāna, \"In a moment's time, grab the bundle of incense and put it on the ground.\"",
        "source": "T03n0190_057:0914c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長老難陀聞佛如此語已，手持此香於一刻間，還放地上。",
        "translation": "After hearing what the Buddha said, the elder Nandāna then took this incense and placed it back on the ground within a moment.",
        "source": "T03n0190_057:0914c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告長老難陀：「汝今當自嗅於手看。」",
        "translation": "The Buddha then addressed the elder Nandana, \"Now, you must smell it in your own hand and look at it.\"",
        "source": "T03n0190_057:0914c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，難陀聞佛語已，即嗅自手。",
        "translation": "After hearing what the Buddha said, Nandanavana then sniffed his hand.",
        "source": "T03n0190_057:0914c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語難陀：「汝嗅此手作何等氣？」",
        "translation": "The Buddha said to Nandanavana, \"What kind of breath do you smell on this hand?\"",
        "source": "T03n0190_057:0914c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白言：「世尊！",
        "translation": "They said, \"Bhagavān!",
        "source": "T03n0190_057:0914c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其手香氣，微妙無量。」",
        "translation": "The fragrance of his hands is subtle and immeasurable.\"",
        "source": "T03n0190_057:0914c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告難陀：「如是如是。",
        "translation": "The Buddha told Nandana, \"So it is.",
        "source": "T03n0190_057:0914c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人親近諸善知識，恒常共居，隨順染習，相親近故，必定當得廣大名聞。」",
        "translation": "If a person becomes close to good teachers, lives constantly together, follows defiled habits, and becomes intimate with them, they surely will attain a great reputation.\"",
        "source": "T03n0190_057:0914c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊因此事故，而說偈言：「若有手執沈水香，　　及以藿香麝香等，　須臾執持香自染，　　親附善友亦復然。」",
        "translation": "It was then that the Bhagavān spoke in verse about this incident, saying, \"If someone were to hold in their hand a scent of sunken water or a scent of patchouli and musk, and so forth, and they need to hold that scent for a while, their intimate proximity to a good friend would likewise be defiled.\"",
        "source": "T03n0190_057:0914c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊出迦毘羅婆蘇都城，至本住處，以此因緣，聚集大眾諸比丘已，即告長老難陀言曰：「難陀！",
        "translation": "It was then that the Bhagavān left the capital city of Kapilavastu and went to his original abode. After gathering a large group of monks for this reason, he addressed the elder Nandāna and said, \"Nandāna!",
        "source": "T03n0190_057:0914c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今莫親近彼六群比丘，莫共彼等以為親友。",
        "translation": "Now, don't get close to those six groups of monks, and don't consider them to be your friends.",
        "source": "T03n0190_057:0915a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T03n0190_057:0915a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若其有人親近如是惡知識者，雖復與彼共為朋友，或時與彼互相承事，隨順彼等一切事業，但為惡人，共相親近，即得世間惡名流布。",
        "translation": "If someone approaches such a bad friend, even though they may be friends with him or may sometimes serve each other and follow all his undertakings, they'll become bad people and be close to each other, which will lead to the spread of a bad reputation in the world.",
        "source": "T03n0190_057:0915a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「長老難陀！",
        "translation": "\"Sr. Nanda!",
        "source": "T03n0190_057:0915a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若欲覓親友知識，當近比丘舍利弗，比丘大目連，比丘大迦葉，比丘迦旃延，比丘優樓頻蠡迦葉，那提迦葉，伽耶迦葉，優波斯那，摩訶俱郗那，摩訶孫陀，離波多等，諸比丘輩。",
        "translation": "\"If you want to find friends and acquaintances, you must approach the monks Śāriputra, the monk Mahāmaudgalyāyana, the monk Mahākākāśyapa, the monk Kātyātyāyana, the monk Uruvilvākāśyapa, Nadī-Kāśyapa, Gayā-Kāśyapa, Upāsaka, Mahākauṣṭhila, Mahāsandha, and Revata, among other monks.",
        "source": "T03n0190_057:0915a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勸汝親近隨順承事。",
        "translation": "You're encouraged to become close to, follow, and serve them.",
        "source": "T03n0190_057:0915a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0190_057:0915a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人親近善知識者，承事親善，雖未證得利益之事，交獲世間名聞流布。」",
        "translation": "If someone approaches a good teacher and serves him well, then although they haven't yet realized something beneficial, they'll attain worldly renown and spread it.\"",
        "source": "T03n0190_057:0915a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以此因緣而說偈言：「若人親近惡知識，　　現世不得好名聞，　必以惡友相親近，　　當來亦墮阿鼻獄。",
        "translation": "It was then that the Bhagavān spoke this verse for this reason, saying, \"If someone approaches a bad teacher, they won't attain good reputation in the present life, will surely be approached by bad friends, and will fall into the avīci hell in the future.",
        "source": "T03n0190_057:0915a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人親近善知識，　　隨順彼等所業行，　雖不現證世間利，　　未來當得盡苦因。」",
        "translation": "If someone approaches a good teacher and follows the actions of their karma, even though they won't realize worldly rewards in the present, they'll end the causes of suffering in the future.\"",
        "source": "T03n0190_057:0915a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊雖以善言教示難陀，而彼難陀猶戀王位自在之樂，憶孫陀利五欲之事，於佛法中猶不欣樂，欲捨梵行，欲捨具戒，還從家事。",
        "translation": "Although the Bhagavān then instructed Nandāna in good terms, Nandāna still clung to the pleasure of his position as king and remembered the five desires of Sundarī, but he still wasn't happy in the Buddha's teaching, wanted to abandon the religious practice, wanted to abandon the full set of precepts, and returned to the duties of his family.",
        "source": "T03n0190_057:0915a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊知彼長老難陀心已，作如是念：「然此難陀煩惱熾盛，豈能小教破彼煩惱，我於今者須作方便，喻如世間以火滅火、以毒治毒。」",
        "translation": "Knowing that elder Nandaka's mind, the Bhagavān then had this thought, \"Still, this Nandaka's afflictions are raging, so how could he overcome them with a small teaching?",
        "source": "T03n0190_057:0915a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，執彼長老難陀之手，從尼俱陀樹林而出，以神通力隱沒其身，忽然在於香醉山上，出現而住。",
        "translation": "After he had this thought, he took the elder Nandha's hand, emerged from the forest of the Nigrodha tree, and with supernormal powers, he concealed himself and suddenly appeared and stayed on Mount Sumeru.",
        "source": "T03n0190_057:0915a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彼山以風吹故，兩樹相揩遂即出火，燒然彼山，出大煙炎。",
        "translation": "At the time, a wind blew on that mountain, and a fire sprouted from the two trees that were cut against each other, burning that mountain and producing a great cloud of smoke.",
        "source": "T03n0190_057:0915a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼山內，多有獼猴，其數五百，被火燒毛，皆悉存地，摩滅身火。",
        "translation": "Inside that mountain, there were many monkeys, numbering 500, whose hair was burned by the fire, and they all remained on the ground, mopping up the fire in their bodies.",
        "source": "T03n0190_057:0915a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊見有一箇雌瞎獼猴在彼群內，亦復以手撲滅身火。",
        "translation": "At the time, the Bhagavān saw a female blind monkey in that group, and she also put out the fire with her hand.",
        "source": "T03n0190_057:0915b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告長老難陀：「汝今見此雌瞎獼猴在彼群內，亦復以手滅其身火如此已不？」",
        "translation": "The Buddha then addressed the elder Nandana, \"Have you seen this female blind monkey in that group and put out its body fire with your hands?\"",
        "source": "T03n0190_057:0915b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，難陀白佛言：「世尊！",
        "translation": "It was then that Nandika said to the Buddha, \"Bhagavān!",
        "source": "T03n0190_057:0915b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如是，我今已見。」",
        "translation": "Thus and thus, I've seen it now.\"",
        "source": "T03n0190_057:0915b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊尋復告彼長老難陀，作如是言：「汝意云何？",
        "translation": "At that point, the Bhagavān then looked again and addressed the elder Nandika, saying, \"What do you think?",
        "source": "T03n0190_057:0915b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝孫陀利，可憙端嚴，與此獼猴，是誰為勝？」",
        "translation": "You, Sundarī, are a worthy recipient of the honor of being crowned with pride, and who is superior to this monkey?\"",
        "source": "T03n0190_057:0915b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，難陀遂向世尊，顰眉蹙面，默然不言。",
        "translation": "Nanda then turned to the Bhagavān, knitted his brows and knitted his face, and remained silent.",
        "source": "T03n0190_057:0915b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊執持長老難陀手臂，從香醉山沒身往至三十三天，現於波利質多羅樹。",
        "translation": "The Bhagavān then took the elder Nandha by the arm and sank down into the Trāyastriṃśa Heaven, where he appeared in the Pārijātaka tree.",
        "source": "T03n0190_057:0915b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼樹下有一大石，名曰婆奴唫(逆林反)摩羅(隋言黃褐)，住於彼處。",
        "translation": "Underneath that tree there was a large stone named Banuṭṭhaka (Revata) Māra (Sui term for yellow-brown) that was staying there.",
        "source": "T03n0190_057:0915b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，帝釋天王往入彼園，遊戲其園，名曰伊迦分陀利，將領五百宮人婇女，左右圍遶，作倡伎樂。",
        "translation": "At the time, the Śakra Devānām-Indra went into that park and played in it, and his name was Ikāpandhari, and he led a group of 500 palace guards and women around him, making music and music.",
        "source": "T03n0190_057:0915b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時世尊見帝釋王，在彼伊迦分陀利園將領五百婇女，音聲歡娛受樂。",
        "translation": "The Bhagavān then saw Śakra the Great leading five hundred concubines in that park called Ika Vandalī, whose sounds were joyous and pleasant.",
        "source": "T03n0190_057:0915b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，佛即告長老難陀作如是言：「汝今見此五百婇女作倡伎樂遊戲已不？」",
        "translation": "The Buddha then addressed the elder Nandanavana and said, \"Have you seen these five hundred women playing music and tricks?\"",
        "source": "T03n0190_057:0915b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "難陀白言：「如是世尊！",
        "translation": "Nanda said, \"So it is, Bhagavān!",
        "source": "T03n0190_057:0915b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今已見。」",
        "translation": "I've seen it now.\"",
        "source": "T03n0190_057:0915b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊尋復告彼長老難陀作如是言：「汝意云何？",
        "translation": "The Bhagavān then had another conversation with the elder Nandanavana, saying, \"What do you think?",
        "source": "T03n0190_057:0915b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為當釋女孫陀利好？",
        "translation": "Why will the Śākyamuni woman be so kind?",
        "source": "T03n0190_057:0915b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為當五百婇女端正？」",
        "translation": "Why should five hundred concubines be correct?\"",
        "source": "T03n0190_057:0915b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長老難陀白言：「世尊！",
        "translation": "The elder Nandika said, \"Bhagavān!",
        "source": "T03n0190_057:0915b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如以彼時雌瞎獼猴，與孫陀利共相比挍，百倍不如，乃至千倍，至百千倍，世間算數亦不可及。",
        "translation": "Just as that blind female monkey and Sundarī were compared, they were a hundred times inferior, up to a thousand times greater, and up to a hundred thousand times greater than even the world's calculations could match.",
        "source": "T03n0190_057:0915b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今如是孫陀利女，欲令比此婇女五百，亦復不如百倍千倍，至百千倍世間算數所不能及。",
        "translation": "Now, I, as Sundarī's daughter, would like to compare her to this woman by 500 petals, but I wouldn't be as good as her by a hundredfold or a thousandfold, or even a hundred thousandfold, which is beyond calculation in the world.",
        "source": "T03n0190_057:0915b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今者云何可為比喻？」",
        "translation": "What can I say in this case to compare her to that?\"",
        "source": "T03n0190_057:0915b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告長老難陀：「汝今意欲共此婇女相娛樂不？」",
        "translation": "It was then that the Buddha addressed the elder Nandika, \"Do you want to entertain this woman with her?\"",
        "source": "T03n0190_057:0915c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，難陀歡喜踊躍，白言：「世尊！",
        "translation": "Nandika then rejoiced and leaped for joy, saying, \"Bhagavān!",
        "source": "T03n0190_057:0915c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我意者，實欲與彼五百婇女共相娛樂。」",
        "translation": "If it's what I want, I really want to share the entertainment of those five hundred women.\"",
        "source": "T03n0190_057:0915c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告長老難陀：「汝今不可以此凡身共彼娛樂，若欲然者，必須以汝歡喜之心，於我法中行於梵行，我當報汝：『今者若能隨順此法，行清淨行，命終捨身，於未來世，必得受報生於此處，共此五百諸婇女輩共相娛樂。』」",
        "translation": "It was then that the Buddha addressed the elder Nandana, \"Now, you must not entertain them with this ordinary body; if you want to do so, you must conduct the religious practice in my teaching with a joyous heart, and I will reward you, 'Now, if you can follow this teaching and conduct pure practices, and if you abandon your body at the end of your life, you will surely be rewarded in a future life by being born here and entertaining these 500 women together.'\"",
        "source": "T03n0190_057:0915c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，難陀聞此事已，歡喜踊躍，遍滿其體，不能自勝，而白佛言：「世尊！",
        "translation": "After hearing this, Nandika was overcome with joy and happiness that filled his body, and he said to the Buddha, \"Bhagavān!",
        "source": "T03n0190_057:0915c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從今日於佛法中，歡喜行於清淨梵行。",
        "translation": "From this day forth, I rejoice in the Buddha's teaching and engage in pure religious practice.",
        "source": "T03n0190_057:0915c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0190_057:0915c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今者已許報我，我今實欲當未來世生於此處，共此五百諸婇女等，共相娛樂。」",
        "translation": "Now that I've been promised a reward, I really want to be born here in a future life with these 500 concubines and others to entertain each other.\"",
        "source": "T03n0190_057:0915c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊復執長老難陀臂已，從彼三十三天沒身，還其本處。",
        "translation": "After taking the elder Nandanavana by the arm, the Bhagavān then surrendered himself from the Trāyastriṃśa Heaven and returned to his original place.",
        "source": "T03n0190_057:0915c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，難陀作如是念：「世尊於先已許報我於未來世，當得共彼五百婇女，以相娛樂。」",
        "translation": "Nanda then had this thought, \"The Bhagavān has promised me that in the future I'll be able to entertain 500 of his daughters together.\"",
        "source": "T03n0190_057:0915c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故難陀，以此因緣，盡其身心，正念行於清淨梵行，調伏諸根，節量飲食，初夜後夜，起誦經行，勇猛精進，不共他人言談戲笑；心不躁急，心無狡猾，口不綺言，發精進行，念四威儀，樂於空寂，閉塞諸根，成就最勝微妙正念。",
        "translation": "Therefore, for this reason, Nandha exhausted his body and mind, correctly mindfully practiced the pure religious practice, disciplined his faculties, measured his diet, ate and drank in moderation, recited sūtras early and late at night, exerted himself, didn't engage in laughter or talk with others, wasn't agitated or cunning at heart, didn't speak fancy words, exerted himself, was mindful of the four comportments, enjoyed quiescence, shut off his faculties, and accomplished the most excellent and subtle correct mindfulness.",
        "source": "T03n0190_057:0915c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，難陀若欲意觀東方之時，安定身心，志意充滿，既正念已，然後方始觀於東方。",
        "translation": "At the time, if Nandika wanted to contemplate the east, he settled his body and mind, filled them with intention, and then began to contemplate the east only after he had been correctly mindful.",
        "source": "T03n0190_057:0915c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是觀時，無有愁惱，無有黑闇，於不善法，終無漏失，亦不迷惑。",
        "translation": "When he thus observes it, there's no grief, no darkness, and no loss of unskillful qualities, and he isn't confused.",
        "source": "T03n0190_057:0915c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是欲觀南西北方上方下方，亦定身心，志意充滿。",
        "translation": "Thus, when he wants to look south, west, north, above, and below, he also concentrates his body and mind, and his intentions are filled.",
        "source": "T03n0190_057:0915c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是觀時，亦無愁惱，無有黑闇，於不善法，更不漏失，亦不迷惑。",
        "translation": "When he thus observes it, there's no worry, no darkness, and nothing contaminated or lost in what's unskillful, and he isn't confused.",
        "source": "T03n0190_057:0915c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，難陀或有同行諸比丘輩，而告之言：「長老難陀！",
        "translation": "At the time, Nandha or some of the monks accompanying him told him, \"Elder Nandha!",
        "source": "T03n0190_057:0916a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於先時，不閉諸根，於諸飲食，不知厭足，恒求妙好床褥臥具安隱睡眠，本無厭勌，或時戲笑，心意不定，狡猾[言*奇]語，不曾精勤，恒常懈怠，亦無正念，多諸忘失，威儀漏缺，無禪無定，不能攝心，諸根逸浪，不可具說。",
        "translation": "In the past, you didn't shut off your faculties, didn't know when you had enough to eat and drink, always sought a nice bed and bedding, slept in comfort, never got tired of it, sometimes laughed, had a restless mind, spoke slylyly [linguistic*speak], didn't exert yourself, were always lazy, didn't have right mindfulness, were often forgetful, had deficiencies in manner, lacked meditation and concentration, couldn't control your mind, and had unexplainable wanderings of the faculties.",
        "source": "T03n0190_057:0916a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何今者諸根調伏，飲食知足，初夜後夜不曾睡眠，無復狡戲，攝歛身心，又不[言*奇]語，勇猛精進，正念正勤，已得禪定，心不漏逸，諸根不浪？",
        "translation": "How are his faculties disciplined, his diet is satisfying, he doesn't sleep during the first and second nights, he doesn't engage in playful activities, he keeps his body and mind collected, doesn't [speak*unusual] talk, makes vigorous effort, is correctly mindful and diligent, has attained meditative concentration, his mind isn't contaminated, and his faculties aren't dissipated?",
        "source": "T03n0190_057:0916a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長老今日，何因得爾？」",
        "translation": "Elder, today, what brings you to this point?\"",
        "source": "T03n0190_057:0916a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，難陀告彼同行諸比丘言：「諸長老輩！",
        "translation": "It was then that Nandha addressed the monks accompanying him, \"Elders!",
        "source": "T03n0190_057:0916a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知世尊於未來世，將欲報我五百婇女，歡娛受樂，是故我今於此法中，勤行梵行。」",
        "translation": "You should know that the Bhagavān will want to reward me with five hundred concurrent daughters who will be delighted and entertained in the future, so now I'm diligently engaged in the religious practice of this Dharma.\"",
        "source": "T03n0190_057:0916a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，難陀親友同行諸比丘等，於彼難陀欲有調笑嘲弄譏戲，各相謂言：「長老難陀！",
        "translation": "At the time, a group of monks who were close to Nandha and accompanied by his friends wanted to tease and ridicule him, and they each said, \"Elder Nandha!",
        "source": "T03n0190_057:0916a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於世尊所，客作傭力，求將來報，故於法中勤行梵行。",
        "translation": "At the Bhagavān's place, he sought future rewards by making himself a servant, so he diligently engaged in the religious practice of the Dharma.",
        "source": "T03n0190_057:0916a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長老難陀！",
        "translation": "Elder Nanda!",
        "source": "T03n0190_057:0916a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於佛邊，行梵行者，正為諸天五百玉女行梵行耳？」",
        "translation": "Are you practicing the religious practice at the Buddha's side, precisely for the sake of the five hundred jade maidens of the gods?\"",
        "source": "T03n0190_057:0916a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長老難陀親友諸比丘等，從爾已後，是故常喚為客作者。",
        "translation": "Since then, the elder Nandha's friends and acquaintances, the monks and others, have been constantly called guests.",
        "source": "T03n0190_057:0916a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊見此難陀為諸玉女行於梵行，遂便執臂，從彼尼拘陀林而出，沒身入於大地獄裏。",
        "translation": "When the Bhagavān saw this Nandāna engaged in the religious practice of the jeweled ladies, he took his arm, left the forest of Nirgrantha, and plunged into the great hell without a body.",
        "source": "T03n0190_057:0916a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊於時見一銅釜下然猛火，其釜爀赤與火無異，出大光炎，熾然赩赩。",
        "translation": "The Bhagavān then saw a copper caldron blazing with a fierce fire, and the caldron, which was red like fire, gave off a great blazing light that was blazing and glowing.",
        "source": "T03n0190_057:0916a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊見已，告彼難陀：「汝往問此諸獄卒等，此之銅釜欲為阿誰熾然湧沸？」",
        "translation": "After he saw this, the Bhagavān addressed Nanda, \"Go ask these jailers, who is this copper cauldron intended to be blazing and boiling over?\"",
        "source": "T03n0190_057:0916a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至如是長老難陀，聞佛是語白言：「世尊！",
        "translation": "Thus did the elder Nandika hear this statement from the Buddha and say, \"Bhagavān!",
        "source": "T03n0190_057:0916a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯如佛教。」",
        "translation": "Only as Buddhism does.\"",
        "source": "T03n0190_057:0916a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即往詣彼諸獄卒邊而問之言：「此大銅釜，欲為何人如是湧沸乃至此也？」",
        "translation": "He went over to those jailers and asked, \"For whom does this large copper cauldron want to boil up like this?\"",
        "source": "T03n0190_057:0916a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時獄卒，咸報難陀，作如是言：「佛有姨母所生之弟，名曰難陀，為彼人故，燒然此釜。」",
        "translation": "The jailers then all reported to Nandha and said, \"The Buddha has a brother born to his aunt named Nandha, and he burned this cauldron for that person's sake.\"",
        "source": "T03n0190_057:0916a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "難陀復問：「汝豈不聞？",
        "translation": "Again, Nandha asked, \"Don't you hear about it?",
        "source": "T03n0190_057:0916b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來往日，許報其人，若為五百天樂婇女行於梵行，後得生於三十三天。」",
        "translation": "In days gone by, the Tathāgata promised that person that if he performs the religious practice for the 500 gods and goddesses of pleasure, he'll be born in the Trāyastriṃśa Heaven later.\"",
        "source": "T03n0190_057:0916b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸獄卒言：「如是如是，我等已知。",
        "translation": "The jailers said, \"Such and such, we've known it.",
        "source": "T03n0190_057:0916b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但我等輩，復聞其人於彼三十三天之上墮落已後，來生此處。」",
        "translation": "But we've also heard that person was born here after falling from the Trāyastriṃśa Heaven.\"",
        "source": "T03n0190_057:0916b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，難陀聞此語已，心生恐怖，舉身毛竪，作如是念：「我若次第於此受苦，我今亦欲不用如此婇女果報。」",
        "translation": "After hearing this, Nandika became frightened, lifted his body's hair, and had this thought, \"If I had been subjected to this kind of suffering in turn, I would want to avoid the results of such a concave woman.\"",
        "source": "T03n0190_057:0916b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊即執長老難陀臂已，從地獄內，隱沒其身，還至尼俱陀林而出。",
        "translation": "At that point, the Bhagavān took the elder Nandāna by the arm, sank his body inside hell, returned to the forest of Nigrodha, and emerged.",
        "source": "T03n0190_057:0916b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，難陀為己同行諸親友等，恒常喚作佛客作人，被笑被呵，嘲調戲弄。",
        "translation": "At the time, Nandanavana's friends and relatives who were with him were always calling him a guest of the Buddha, being laughed at and ridiculed, and making fun of him.",
        "source": "T03n0190_057:0916b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復見地獄，慚愧恐怖，即生厭離，自悼自悔，求空閑處，獨行獨坐，更不放逸，精進勇猛。",
        "translation": "Seeing hell again, he was ashamed and terrified, became disillusioned, mourned himself, sought a quiet place, walked and sat alone, didn't become careless, and was vigorous in his effort.",
        "source": "T03n0190_057:0916b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡善男子，其有正信捨家出家，求於無上清淨梵行，行已現得自證神通，得諸漏盡，口自唱言：「生死已盡，梵行已立，所作已辦，不受後有。」",
        "translation": "Suppose there's a good man who has right faith, leaves home and renounces the world, pursues the unsurpassed pure religious practice, and after his practice has manifested, he personally realizes his supernormal powers and attains the end of the contaminants, saying, \"Birth and death have been ended, the religious practice has been established, the task has been accomplished, and I won't be subject to a later existence.\"",
        "source": "T03n0190_057:0916b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "證羅漢果，心得解脫。",
        "translation": "Realizing the fruit of the arhat, he attains liberation.",
        "source": "T03n0190_057:0916b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長老難陀亦復如是，證羅漢果，然後始往至於佛所，頂禮佛足，却坐一面。",
        "translation": "Similarly, the elder Nandāna realized the fruit of the arhat before he went to the Buddha, bowed his head at his feet, and withdrew to sit to one side.",
        "source": "T03n0190_057:0916b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長老難陀白佛作如是言：「今捨世尊往日恩許，我昔欲取如來報者，正為五百諸天婇女，是故如此；而今，世尊！",
        "translation": "It was then that the elder Nandanavigator said to the Buddha, \"Now, I've given up the Bhagavān's acceptance of our past kindnesses, and I wanted to obtain the Tathāgata's rewards for the sake of the five hundred gods and Ṛṣipatas, which is why I did this.",
        "source": "T03n0190_057:0916b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得解脫也。」",
        "translation": "You've also attained liberation.\"",
        "source": "T03n0190_057:0916b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告長老難陀：「非但今日我於汝邊始得脫也，汝初唱言：『梵行已立，所作已辦，不受後有。』",
        "translation": "It was then that the Buddha addressed the elder Nandika, \"Not only have I first attained liberation at your side today, but you first said, 'The religious practice has been established, the task has been accomplished, and I won't accept a later existence.'",
        "source": "T03n0190_057:0916b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於彼時，已得脫也。」",
        "translation": "At that point, I've already been liberated.\"",
        "source": "T03n0190_057:0916b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長老難陀同行諸比丘等，未知難陀得漏盡者，猶如先日未漏盡時，戲弄謿調，唱如是言：「長老難陀於世尊所，客作求報，為彼五百諸天婇女，行於梵行。」",
        "translation": "At the time, the elder Nandanavana was accompanied by monks and others who didn't know that Nandanavana had ended the contaminants, just as he had done in the days before the contaminants ended, when he was playing around and saying, \"The Bhagavān asked the elder Nandanavana to perform the religious practice of 500 gods and women for him as a guest seeking reward.\"",
        "source": "T03n0190_057:0916b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊作如是念：「此等比丘未知難陀諸漏已盡，還依昔日未漏盡時，猶故唱言：『長老難陀為彼諸天五百婇女，行於梵行。』",
        "translation": "The Bhagavān then had this thought, \"These monks don't know that Nandha's contaminants have ended, but they're still relying on the past, when his contaminants hadn't ended, and they're still singing, 'Elder Nandha is performing the religious practice for those 500 gods' Ṛṣipatana women.'",
        "source": "T03n0190_057:0916c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我恐彼等多獲罪過。",
        "translation": "I'm afraid they'll get a lot of blame.",
        "source": "T03n0190_057:0916c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然我今者，可於眾中宣揚顯說長老難陀漏盡事也。」",
        "translation": "Now, however, I can proclaim and explain the end of Elder Nandor's contaminants to the crowd.\"",
        "source": "T03n0190_057:0916c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊以如此等因緣事故，集聚一切諸比丘僧，既聚集已，而告之言：「汝諸比丘！",
        "translation": "It was then that the Bhagavān gathered all the monks and nuns for such a reason, and after they had gathered, he told them, \"You monks!",
        "source": "T03n0190_057:0916c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有人言好男子者，難陀比丘即其人也；若言端正，亦即難陀比丘是也；大壯人者，難陀比丘亦其人也。",
        "translation": "If someone says they're a good man, that's the Bhagavān Nandabhadra; if they say they're correct, that's the Bhagavān Nandabhadra; and a man of great stature is the Bhagavān Nandabhadra.",
        "source": "T03n0190_057:0916c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若言身體細軟弱者，亦復難陀比丘是也。",
        "translation": "\"If someone says their body is small and weak, that's also the monk Nandanavana.",
        "source": "T03n0190_057:0916c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言有人諸根寂靜不散亂者，亦復難陀比丘是也。",
        "translation": "If someone says their faculties are quiescent and not distracted, again, this is the monk Nandha.",
        "source": "T03n0190_057:0916c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若有人言於諸飲食知節量者，亦復難陀比丘是也。",
        "translation": "\"If someone says they know moderation when it comes to eating and drinking, again, this is the monk Nandanavana.",
        "source": "T03n0190_057:0916c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若有人言初夜後夜不睡眠者，今亦難陀比丘是也。",
        "translation": "\"If someone says they don't sleep during the first and last nights, this is also the monk Nandanavana.",
        "source": "T03n0190_057:0916c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若言三族清淨生者，亦即難陀比丘是也。",
        "translation": "\"If someone says the three families are born purely, this is also the monk Nandanavana.",
        "source": "T03n0190_057:0916c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有人言得六通者，此亦難陀比丘是也。",
        "translation": "If someone says they've attained the six supernormal powers, this is also the Bhagavān Nandha monk.",
        "source": "T03n0190_057:0916c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言得八解脫定者，亦復難陀比丘是也。」",
        "translation": "If someone says they've attained the eight concentrations of liberation, this is also the monk Nandanavana.\"",
        "source": "T03n0190_057:0916c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告比丘僧作如是言：「汝諸比丘！",
        "translation": "It was then that the Bhagavān addressed the monks, saying, \"You monks!",
        "source": "T03n0190_057:0916c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於我聲聞弟子之內，調伏諸根，難陀比丘最為第一。」",
        "translation": "Among my śrāvaka disciples, the monk Nandanavana is the best at taming the faculties.\"",
        "source": "T03n0190_057:0916c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸比丘而問佛言：「如是世尊！",
        "translation": "The monks then asked the Buddha, \"So it is, Bhagavān!",
        "source": "T03n0190_057:0916c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其彼長老難陀比丘，往昔之時，有何善根？",
        "translation": "What were the good roots of that elder monk Nandanavana in the past?",
        "source": "T03n0190_057:0916c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因彼善根，生於釋種甚大富貴，豐足資財，其人身體端正可憙。",
        "translation": "Because of those good roots, they are born into the Śākyas' lineage of great wealth and possessions, and their person has a correct and honorable body.",
        "source": "T03n0190_057:0916c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊今日復記云：『我聲聞弟子，調伏諸根，最第一者，難陀比丘即其人也。』」",
        "translation": "The Bhagavān also remembers today, 'The best of my śrāvaka disciples in terms of taming their faculties is that monk Nandha.'\"",
        "source": "T03n0190_057:0916c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，佛告彼等諸比丘言：「汝諸比丘！",
        "translation": "After he said this, the Buddha addressed the monks, saying, \"You monks!",
        "source": "T03n0190_057:0917a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我念往昔九十一劫，時有一佛出現於世，名毘婆尸多他竭多、阿羅呵、三藐三佛陀，如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，於彼世界王所居住。",
        "translation": "I think back in the past, during 91 eons, there was a Buddha who appeared in the world named Vipaśyin, Thāgata, Ārāha, Samyak-saṃbuddha, the Tathāgata, Worthy of Offerings, Perfectly Omniscient, Perfect in Knowledge and Conduct, Well Gone, Understander of the World, Unsurpassed Person, Trainer, Teacher of Gods and People, Buddha, and World Honored One, who lived in the king's quarters of that world.",
        "source": "T03n0190_057:0917a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有一城，名槃徒摩低，於時彼佛依彼城住，有諸比丘六千人，俱皆阿羅漢。",
        "translation": "There was a city there named Pāṇḍu-Mālādhi, and at the time the Buddha was staying there, there were 6,000 monks, all of them arhats.",
        "source": "T03n0190_057:0917a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一王名曰槃頭，供養彼佛及比丘僧，尊重恭敬，所謂衣服臥具飲食，及諸湯藥房舍之具，無所乏少。",
        "translation": "At the time, there was a king named Pāṇḍu who supported that Buddha and the monks, honoring and respecting them with clothing, bedding, food, drink, and provisions for bathing and medicine, of which there was nothing lacking.",
        "source": "T03n0190_057:0917a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，槃頭摩低城內有一種姓婆羅門子，而彼童子營造溫室，請佛及僧洗浴供養。",
        "translation": "\"At the time, there was a Brahmin child of a certain family in the city of Pāṇḍuma, and that boy built a warm room and invited the Buddha and Saṃgha to wash and offer it to him.",
        "source": "T03n0190_057:0917a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其婆羅門種姓童子，見諸比丘從溫室出，身體清淨，甚大香潔無有臭氣，見已心生歡喜，踊躍遍滿其體，不能自勝，心發是願：『願我來世，常得如是清淨無垢不腥臭身，當似如是比丘僧等清淨香潔無臭之身。』",
        "translation": "Seeing the monks emerge from the bathhouse with bodies that were pure and clean, with a great fragrance and no stench, that Brahman boy of that family rejoiced, jumped all over his body, and couldn't bring himself to say, 'May I always attain such a pure, undefiled, and non-odorous body in the next life, which will resemble the pure, fragrant, and non-odorous bodies of such monks and saṃgha.'",
        "source": "T03n0190_057:0917a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又於後時，毘婆尸佛、多他伽多、阿羅呵、三藐三佛陀，入般涅槃，其王槃頭，為彼世尊所有舍利，取四種寶，為造塔廟，所謂金銀琉璃頗梨。",
        "translation": "At the time, Vipaśyin Buddha, Dhṛtarāṣṭra, Ārāha, and Samantabhadra Buddha entered parinirvāṇa, and their king, the head of parinirvāṇa, took four kinds of treasures for the Bhagavān's relics and built a stūpa, which is called a gold, silver, and lapis lazuli pāri.",
        "source": "T03n0190_057:0917a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼種姓婆羅門子，撿挍經營，當造彼塔。",
        "translation": "That family of Brāhmaṇas then gathered and managed to build that stūpa.",
        "source": "T03n0190_057:0917a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既造塔已，心作是願：『願我來世恒常值遇如是世尊，彼所說法，願我領解悉得證知，莫背彼法，生生世世不入惡道。』",
        "translation": "After building the stūpa, he made this mental vow, 'May I always encounter such a Bhagavān in the next life, and may I comprehend and fully realize what he teaches, so that I don't deviate from his teachings and enter no bad destinies in my lifetime.'",
        "source": "T03n0190_057:0917a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼童子命終之後，恒生天上，或生人間，於後一生，生一大富長者之家，父母養育，隨時長大，意智漸漸，皆得成就。",
        "translation": "After his life ends, that boy is always born up in heaven or among humans, and in his next life he's born into a large, wealthy family of elders, nurtured by his parents, growing up at appropriate times, and gradually achieving fulfillment in his mind and knowledge.",
        "source": "T03n0190_057:0917a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，童子其家恒有一辟支佛，為作門師，數數至家。",
        "translation": "\"At the time, there was always a pratyekabuddha in the boy's home who served as his teacher and came to his home often.",
        "source": "T03n0190_057:0917a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼辟支佛，可憙端正，具足三十大丈夫相，而彼童子恒以四事供養供給彼辟支佛，盡其一形，無所乏少。",
        "translation": "That pratyekabuddha is arrogant and correct, fully endowed with the characteristics of thirty great beings, and that boy always makes four offerings to that pratyekabuddha, making no small amount of offerings to his whole body.",
        "source": "T03n0190_057:0917a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其辟支佛盡其住世，然後涅槃。",
        "translation": "That pratyekabuddha lived out his life and then passed into nirvāṇa.",
        "source": "T03n0190_057:0917b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，長者見辟支佛命終涅槃，即取彼身，如法闍毘，收取舍利，起塔供養，以泥塗飾復以石灰，重塗其上。",
        "translation": "\"When the elder saw that Pārśva's life ended in nirvāṇa, he took his body, did as the Bhojpuri had done, collected the relics, raised a stūpa to make offerings, smeared it with clay, decorated it with lime, and reapplied lime to it.",
        "source": "T03n0190_057:0917b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以莊嚴故，懸諸種種寶珠瓔珞，發是願言：『願我未來恒值如是辟支世尊，而彼世尊所說之法，聞已領解，永不忘失，生生世世不墮惡道。",
        "translation": "Decorating it with various jewels and jewelry, he vows, 'May I always meet such a Bhagavān in the future and comprehend the teachings of that Bhagavān once I hear them, never forget them, and never fall into a bad path in my lifetime.",
        "source": "T03n0190_057:0917b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦願我身，端正可憙，見者歡喜，身有三十大丈夫相，具足無減，如此大仙等無有異。』",
        "translation": "May I also wish that my body were correct and attractive, that people who see it would rejoice, and that it would have the characteristics of 30 great men, complete and undiminished, so that there would be no difference between such a great man and others.'",
        "source": "T03n0190_057:0917b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼長者捨身命終，後更不曾生於惡道，恒生人天，久久流轉，於後復生波羅[木*奈]國。",
        "translation": "After he gave up his body and died, that elder was never born in a bad destiny again, but was always born among humans and gods, and he continued to transmigrate for a long time before being born again in the country of [Mokṣala].",
        "source": "T03n0190_057:0917b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時有王名吉利尸(隋言瘦細)，以為彼子。",
        "translation": "At the time, there was a king named Girishī (Sui word for thin), who took that as his son.",
        "source": "T03n0190_057:0917b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於爾之時乃有一佛，出現於世，名曰迦葉多他伽多、阿羅訶、三藐三佛陀。",
        "translation": "At the time, there appeared in the world a Buddha named Kāśyapa Tathāgata, Ārāha, and Samyak-saṃbuddha.",
        "source": "T03n0190_057:0917b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然彼世尊隨其住世，滅度已後，吉利尸王純以七寶，為造塔廟，所謂金銀頗梨琉璃，及赤真珠珊瑚馬瑙。",
        "translation": "After that Bhagavān had lived in the world and passed away, King Kelisheba built a stūpa made entirely of seven treasures, which he called gold, silver, pārijātaka, lapis lazuli, and red real beads, coral, and cornelian.",
        "source": "T03n0190_057:0917b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其寶塔外，更以麤塼重覆其上，其塔高峻至一由旬，東西縱廣各半由旬，為作銘記，名曰達舍婆陵迦(隋云十相)。",
        "translation": "Outside of that jeweled stūpa, he covered it with a layer of coarse bricks as high as a yojana, measuring half a yojana from east to west, and made an inscription for it, calling it Dāsaprajāta (Sui: Ten Phases).",
        "source": "T03n0190_057:0917b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，吉利尸王所生七子僉白王言：『善哉大王！",
        "translation": "\"It was then that seven sons of King Kelisī came together and said to the king, \"Good, great king!",
        "source": "T03n0190_057:0917b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知我等欲於迦葉多他伽多、阿羅訶、三藐三佛陀舍利塔上，各各奉施一大傘蓋以覆其塔。",
        "translation": "You should know that we each want to offer a large umbrella to cover the stūpa of the relics of Kāśyapa, Thārāha, and Samyak-saṃbuddha.",
        "source": "T03n0190_057:0917b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉大王！",
        "translation": "Good, great king!",
        "source": "T03n0190_057:0917b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願垂聽許。』",
        "translation": "Please grant it.'",
        "source": "T03n0190_057:0917b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王告之言：『任隨汝等！",
        "translation": "The king told them, 'Let's do as you like!",
        "source": "T03n0190_057:0917b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今聽造。』",
        "translation": "'Now, I'll listen to what you make.'",
        "source": "T03n0190_057:0917b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼等諸七王子各以一寶，造其一蓋，覆其塔上，或造金蓋，或造銀蓋，乃至或造碼瑙等蓋。",
        "translation": "\"It was then that each of those seven princes took a jewel and made a lid to cover his stūpa, either of gold or silver, or even a lid of onyx or something of that sort.",
        "source": "T03n0190_057:0917b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其七子內，第二王子，造其金蓋，以覆塔上，心發是願：『願我來世恒值如是辟支佛尊，彼所說法，願我領證，永不忘失，生生世世，不墮惡道，所生之處，願得猶如金色之身。』」",
        "translation": "The second of those seven princes made a gold lid to cover the stūpa, and he made this vow: 'May I always meet such a venerable pratyekabuddha in the next life, may I receive and realize his teaching, may I never forget it, may I be born forever and not fall into a bad destiny, and may I attain a body that's like gold wherever I'm born.'",
        "source": "T03n0190_057:0917b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告諸比丘等：「汝諸比丘！",
        "translation": "It was then that the Buddha addressed the monks, \"You monks!",
        "source": "T03n0190_057:0917c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有心疑，於彼槃頭摩城之內，婆羅門子，供養彼佛及比丘僧，溫室洗浴，心發是願：『願我來世，當得似此比丘僧眾清淨無垢香潔之身。』",
        "translation": "\"If there's any doubt in your mind, suppose you were a Brāhmaṇa child in that city of Pāṇḍuma who makes offerings to the Buddha and his monks, washes them in a warm room, and makes this vow: 'May I attain a body like this congregation of monks and nuns that's pure, spotless, and fragrant in the next life.'",
        "source": "T03n0190_057:0917c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於毘婆尸多他伽多、阿羅訶、三藐三佛陀滅度之後，造塔供養之童子者？",
        "translation": "What about the boy who built a stūpa to support the Vipaśyintaṃkāṭa, Ārāha, and Samyak-saṃbuddha after they had died?",
        "source": "T03n0190_057:0917c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等比丘！",
        "translation": "You monks!",
        "source": "T03n0190_057:0917c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫作異見，此即難陀比丘是也。",
        "translation": "Don't take it the other way around, for this is the monk Nandanavana.",
        "source": "T03n0190_057:0917c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝諸比丘！",
        "translation": "\"You monks!",
        "source": "T03n0190_057:0917c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等若有疑彼長者，一形供養彼辟支佛，滅後復以舍利起塔，供養塗治，及以石灰種種莊飾，及諸瓔珞供養彼塔，心作是願：『願我來世如此辟支端正可憙，觀者無厭，身有三十大丈夫相，具足無減，如此仙人。』",
        "translation": "'If you have doubts about that elder, dedicate one form to that pratyekabuddha, then after he dies, erect a stūpa with his relics, make offerings to him, decorate it with lime, and decorate it with jewelry and jewelry, and offer it to his stūpa, and make this vow: 'May I be such a pratyekabuddha in a future life who's upright and respectable, whose appearance is unfailing, and whose body has the characteristics of 30 great men, complete and undiminished, such an immortal.'",
        "source": "T03n0190_057:0917c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蓋是誰也？",
        "translation": "Who is it?",
        "source": "T03n0190_057:0917c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸比丘莫作異見，此亦難陀比丘是也。",
        "translation": "Don't take a different view, you monks, for this is also the monk Nandanavana.",
        "source": "T03n0190_057:0917c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝諸比丘！",
        "translation": "\"You monks!",
        "source": "T03n0190_057:0917c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等若有心疑，於彼波羅[木*奈]城吉利尸王第二之子，為彼迦葉多他伽多阿羅訶三藐三佛陀，造作金蓋以覆塔者，莫作異見，此亦難陀比丘是也。",
        "translation": "If you have any doubts, don't take issue with that second son of King Girishī of Pola [munai] who built a gold lid to cover that Kāśyapa Tathāgata Arhat Samantabhadra Buddha's stūpa, which is also that monk Nandāna.",
        "source": "T03n0190_057:0917c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「然此難陀以於往昔毘婆尸佛及比丘僧，為作溫室，如法洗浴，因發是願：『願我來世，當得如是清淨香潔無垢之身，如此比丘清淨無垢。』",
        "translation": "\"Still, because this Nandha had made a warm room for Vipaśyin Buddha and the monks in the past and bathed them according to the rules, he made this vow: 'May I attain such a pure, fragrant, and spotless body in a future life, and such a monk will be pure and spotless.'",
        "source": "T03n0190_057:0917c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復供養辟支佛尊，尊滅度後起舍利塔，以泥塗治石灰嚴飾，并以瓔珞而莊挍之，心作是願：『願我來世，如是端正，如是可憙，身有三十大丈夫相，具足無減，如此仙人。』",
        "translation": "Again, he made offerings to Venerable Pṛthivī, who erected a reliquary stūpa after his passing, decorated it with mud and lime, and adorned it with jewelry, making this vow in his mind, 'May I be so correct and so honorable in the next life, with a body that has the characteristics of 30 great men, complete and undiminished, like this sage.'",
        "source": "T03n0190_057:0917c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復於迦葉多他伽多、阿羅訶、三藐三佛陀滅度之後，造舍利塔，純金造蓋以覆其上，心發是願：『願我來世所生之處，身恒金色。』",
        "translation": "Again, after Kāśyapa Tathāgata, Ārāha, and Samyak-saṃbuddha had passed away, he built a reliquary stūpa covered with a lid of pure gold and made this vow: 'May I always be golden in body wherever I'm born in the next life.'",
        "source": "T03n0190_057:0917c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藉彼業緣，今成如此可憙端正觀者無厭金色之身，復有三十大丈夫相，皆悉具足，無有缺減。",
        "translation": "By virtue of those karmic conditions, he now has this gold body that's jolly and correct to look at, and he also has 30 great characteristics of a great person, all of which are complete without any loss.",
        "source": "T03n0190_057:0917c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「於彼之時，復起心願：『願我來世，勿生惡道。』",
        "translation": "\"At the time, he again arose with the mental vow, 'May I not be born in a bad world in a future life.'",
        "source": "T03n0190_057:0918a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藉彼業報，不曾生於惡道之內，恒得生於人天道中。",
        "translation": "As a result of that karmic retribution, I'll never be born inside a bad path but will always be born in the paths of humans and gods.",
        "source": "T03n0190_057:0918a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復於彼時，毘婆尸佛、多他伽多、阿羅訶、三藐三佛陀造塔之時，撿挍經紀，於辟支佛復以四事，盡形供養。",
        "translation": "\"Furthermore, when Vipaśyin Buddha, Dhṛtarāṣṭra, Ārāha, and Samantabhadra were building their stūpas, they inspected their brokers and made offerings to Pratibhāna Buddha in four ways.",
        "source": "T03n0190_057:0918a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藉彼業報因緣力故，今得生於釋種之家。",
        "translation": "Because of the power of the causes and conditions of those karmic retribution, I was now born into a family of the Śākyas.",
        "source": "T03n0190_057:0918a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又於爾時，心發是願：『願我來世，常得值遇如是世尊，或勝此者，然彼世尊所有法教，願我聞已，速得證解。』",
        "translation": "At the time, he also mentally aroused this vow: 'May I always meet such a Bhagavān in a future life, or maybe I'll meet someone better than this, and may I quickly realize the Dharma teachings of that Bhagavān after hearing them.'",
        "source": "T03n0190_057:0918a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藉彼業報因緣力故，今得值我，即於我邊，而得出家及具足戒，我復授記，告諸比丘：『若知於我聲聞弟子調伏諸根最第一者，難陀比丘即其人也。』",
        "translation": "Now, because of the power of the causes and conditions of that person's karmic retribution, he has found me, that is, at my side, to attain home and full ordination, and I've given further instructions to the monks, telling them, 'If you know the best śrāvaka disciple who tames his faculties, that's the monk Nandha.'",
        "source": "T03n0190_057:0918a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝諸比丘！",
        "translation": "\"You monks!",
        "source": "T03n0190_057:0918a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等須知，難陀比丘昔日造作如是善根，藉彼善根，今得生於釋種之家，身有金色，具足三十大丈夫相，現得出家，受具足戒，得羅漢果，復得授記作如是言：『若欲知我聲聞弟子調伏諸根最第一者，所謂難陀比丘是也。』」",
        "translation": "You should know that in the past, the monk Nandanavana created such good roots that he was born into a family of the Śākyas, had a golden body, was fully endowed with the characteristics of thirty great beings, became a householder, received the full set of precepts, attained the fruit of the arhat, and was given assurance that he would say, 'If you want to know that I am the śrāvaka disciple who is the best at taming the faculties, this is the monk Nandanavana.'\"",
        "source": "T03n0190_057:0918a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛本行集經婆提唎迦等因緣品第五十八上爾時，提婆達多釋種童子，見諸五百釋童子等捨家出家，心發是念：「我今亦可於世尊所捨家出家。」",
        "translation": "It was then that the Śākyamuni boy Devadatta saw these five hundred Śākyamuni boys renounce their homes and leave home, and he had this thought, \"Now, I could renounce my home and leave home at the Bhagavān's place.\"",
        "source": "T03n0190_057:0918a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，至父母邊，白如是言：「善哉父母！",
        "translation": "After that thought, he went to his parents and said, \"Good, parents!",
        "source": "T03n0190_057:0918a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今發心將欲佛邊捨家出家，願垂許我。」",
        "translation": "Now, I've made up my mind to leave home and renounce the world beside the Buddha, so grant me permission.\"",
        "source": "T03n0190_057:0918a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，父母即告提婆達多釋童子言：「我等今者作是思惟：『我等須依提婆達多，提婆達多復須依我。』",
        "translation": "After saying this, his parents then addressed the child Devadatta and explained, \"Now, we are thinking, 'We must rely on Devadatta, and Devadatta must also rely on me.'",
        "source": "T03n0190_057:0918a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既如此者，隨汝意樂，當作是事。」",
        "translation": "If that's the case, then do as you wish.\"",
        "source": "T03n0190_057:0918a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，提婆達多童子身著上妙無價衣服，乘最勝象，從迦毘羅婆蘇都城欲出城外，於城門頰，為鉤所掛，衣裳破裂。",
        "translation": "At the time, the boy Devadatta, wearing the finest priceless clothing and riding in a most excellent elephant, was leaving the capital city of Kapilavastu and was about to leave the city when he got caught by a hook at the gate and his robe broke.",
        "source": "T03n0190_057:0918b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼之時，有一解相大婆羅門，在邊而見，其彼見已，記此童子，所規之事必當不成。",
        "translation": "At the time, there was a great brāhmaṇa who was at the side of the city and saw it, and after he saw it, he wrote to the boy that the task he had set out to do would surely not be accomplished.",
        "source": "T03n0190_057:0918b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，童子提婆達多即出城已，詣向佛所，頂禮佛足，却住一面，而白佛言：「唯願世尊！",
        "translation": "The boy Devadatta then left the city, went to the Buddha, bowed his head at his feet, withdrew to one side, and said to the Buddha, \"May it please the Bhagavān!",
        "source": "T03n0190_057:0918b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "放我出家。」",
        "translation": "Release me from my home.\"",
        "source": "T03n0190_057:0918b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊正念觀彼提婆達多前後事業，知其心行，觀已即告提婆達多作如是言：「提婆達多！",
        "translation": "At that point, the Bhagavān correctly observed that Devadatta's previous and subsequent undertakings with mindfulness and knew his thoughts and actions, and after observing them, he addressed Devadatta and said in these terms, \"Devadatta!",
        "source": "T03n0190_057:0918b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今慎莫捨家出家，但當還家在家修道，持諸財錢，以用布施，作諸功德，於我法中，不須出家。」",
        "translation": "Now, you mustn't abandon your family and leave home; instead, you must return home and train at home, using the money you have as alms, and making merit; in my teaching, there's no need to leave home.\"",
        "source": "T03n0190_057:0918b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，童子提婆達多被佛訶已，復至長老舍利弗邊，而白之言：「聖者舍利弗！",
        "translation": "After the Buddha had reprimanded him, the boy Devadatta then went to the elder Śāriputra and said, \"Noble Śāriputra!",
        "source": "T03n0190_057:0918b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與我出家。」",
        "translation": "Leave home with me.\"",
        "source": "T03n0190_057:0918b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長老舍利弗問提婆達多作如是言：「提婆達多！",
        "translation": "It was then that the elder Śāriputra asked Devadatta, saying, \"Devadatta!",
        "source": "T03n0190_057:0918b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝曾先至佛邊已不？」",
        "translation": "Have you ever been to the Buddha before?\"",
        "source": "T03n0190_057:0918b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多報言聖者：「我先已曾至佛邊也。」",
        "translation": "Devadatta reported to the sage, \"I've been to the Buddha before.\"",
        "source": "T03n0190_057:0918b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長老舍利弗言：「提婆達多！",
        "translation": "It was then that the elder Śāriputra said, \"Devadatta!",
        "source": "T03n0190_057:0918b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊向汝，作何言說？」",
        "translation": "What did the Bhagavān say to you?\"",
        "source": "T03n0190_057:0918b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多語舍利弗：「如是聖者！",
        "translation": "Devadatta said to Śāriputra, \"Thus it is, sage!",
        "source": "T03n0190_057:0918b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊語我：『汝莫捨家而出家也，但當在家行其布施作諸功德；若其在我法中出家，汝無利益。』」",
        "translation": "The Bhagavān said to me, 'Don't abandon your home and leave it, but perform your almsgiving at home and cultivate virtues; if you leave home while in my Dharma, you won't get any benefit.'\"",
        "source": "T03n0190_057:0918b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長老舍利弗作如是念：「世尊今者既不聽彼於法出家，我今若放彼出家者，是我不善。」",
        "translation": "It was then that the elder Śāriputra had this thought, \"Bhagavān, since you won't listen to him leaving home because of the teaching, it would be unwholesome of me if I were to let him leave home now.\"",
        "source": "T03n0190_057:0918b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是念已，遂即告彼提婆達多作如是言：「提婆達多！",
        "translation": "After this thought, he then addressed Devadatta and said, \"Devadatta!",
        "source": "T03n0190_057:0918b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如世尊教，汝必應當作如是事。」",
        "translation": "As the Bhagavān taught, you must do likewise.\"",
        "source": "T03n0190_057:0918b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，童子提婆達多被舍利弗之所發遣，復詣長老目揵連邊，到已頂禮，却住一面，而白之言：「大目揵連！",
        "translation": "After being sent away by Śāriputra, the boy Devadatta then went to the elder Maudgalyāyana, paid homage when he arrived, withdrew to one side, and said, \"Mahāmaudgalyāyana!",
        "source": "T03n0190_057:0918b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願聖者！",
        "translation": "Venerable!",
        "source": "T03n0190_057:0918c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與我出家。」",
        "translation": "Leave home with me!\"",
        "source": "T03n0190_057:0918c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長老大目揵連，遂復告彼提婆達多作如是言：「提婆達多！",
        "translation": "At that point, the elder Maudgalyāyana then again addressed Devadatta and said, \"Devadatta!",
        "source": "T03n0190_057:0918c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝曾於先至佛邊不？」",
        "translation": "Have you ever been to the Buddha before?\"",
        "source": "T03n0190_057:0918c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多報言聖者：「我已於先至佛邊也。」",
        "translation": "Devadatta reported to the sage, \"I've been to the Buddha before.\"",
        "source": "T03n0190_057:0918c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時長老大目揵連尋復告彼提婆達多，作如是言：「世尊語汝，有何事意？」",
        "translation": "The elder monk Maudgalyāyana then again addressed Devadatta and said, \"Bhagavān, what do you think about what you've said?\"",
        "source": "T03n0190_057:0918c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多復報之言：「世尊語我：『汝莫於此捨家出家，但當如法在家修道，以財布施作諸功德，不須於我法中出家，若出家者於汝無益。』」",
        "translation": "Devadatta again replied, \"The Bhagavān told me, 'Don't abandon your family here and leave home; instead, you must cultivate your family according to the Dharma and cultivate virtue through financial gifts; you don't need to leave home within my Dharma; if you leave home, it won't be beneficial to you.'\"",
        "source": "T03n0190_057:0918c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長老大目揵連亦復報彼提婆達多，作如是言：「如世尊教！",
        "translation": "At the time, the elder Maudgalyāyana also answered that Devadatta and said, \"As the Bhagavān taught!",
        "source": "T03n0190_057:0918c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝必應當作如是事。」",
        "translation": "You must do likewise.\"",
        "source": "T03n0190_057:0918c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，提婆達多既被目連不許出家，復詣長老大迦葉所，乃至略說，悉如前事，次復詣於迦旃延邊。",
        "translation": "After he had been denied permission to leave home by Maudgalyāyana, Devadatta then went to the elder Kāśyapa, explained everything up to a point like the previous one, and then went to Kātyāyana.",
        "source": "T03n0190_057:0918c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次復至於優樓頻螺迦葉之邊，次復至於長老那提迦葉之邊。",
        "translation": "He then went to Uruvilvā-Kāśyapa, and then he went to the elder Nadī-Kāśyapa.",
        "source": "T03n0190_057:0918c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次復至於長老優波斯那之邊，及至摩訶俱郗羅邊，摩訶孫陀離波多邊，悉皆不許。",
        "translation": "He then went to the elder Upāsaka's side, Mahākauṣṭhila's side, and Mahāsandrīputra's side, but they all refused to permit him.",
        "source": "T03n0190_057:0918c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既不許已，方乃詣向長老優波離波多邊，頂禮優波離波多足，却住一面。",
        "translation": "Once they had disallowed them, he then went over to the elder Upāliputra, bowed his head at Upāliputra's feet, and withdrew to stay to one side.",
        "source": "T03n0190_057:0918c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，提婆達多釋種童子，復從優波離波多邊，請乞出家。",
        "translation": "The boy from the Śākyamuni line of Devadatta then again asked Upālippāṭṭha to leave home.",
        "source": "T03n0190_057:0918c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然其長老優波離波多，復問之言：「提婆達多！",
        "translation": "The elder Upāliputra then asked him again, \"Devadatta!",
        "source": "T03n0190_057:0918c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝應於先往到佛所。」",
        "translation": "You should go to the Buddha beforehand.\"",
        "source": "T03n0190_057:0918c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多報言：「聖者！",
        "translation": "Devadatta replied, \"Sage!",
        "source": "T03n0190_057:0918c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於先日，已至佛邊。」",
        "translation": "I've been to the Buddha's side since the day before yesterday.\"",
        "source": "T03n0190_057:0918c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長老優波離波多作如是言：「汝至佛邊，語汝何事？」",
        "translation": "It was then that the elder Upāliputra said this, \"What did you say when you came to the Buddha?\"",
        "source": "T03n0190_057:0918c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多作如是言：「世尊語我：『汝莫於此捨家出家，但當在家如法修道，以財布施，作諸功德，不須於我法中出家，若出家者於汝無益。』」",
        "translation": "Devadatta said, \"The Bhagavān said to me, 'Don't leave home or leave home, but stay home and cultivate according to the teachings, making gifts of goods and merit; you don't have to leave home within my teachings; if you leave home, it won't be helpful to you.'\"",
        "source": "T03n0190_057:0918c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛本行集經卷第五十七",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Volume 57",
        "source": "T03n0190_057:0919a01_0",
        "is_bad_quality": false
    }
]