[
    {
        "source_sentence": "佛本行集經卷第四十八",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Volume 48",
        "source": "T03n0190_048:0874a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隋天竺三藏闍那崛多譯",
        "translation": "Sui Tianzhu Tripiṭaka Jñānagupta Translation",
        "source": "T03n0190_048:0874a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利目連因緣品下",
        "translation": "Second Chapter of the Causes and Conditions of Śāriputra and Maudgalyāyana",
        "source": "T03n0190_048:0874a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，王舍大城去城不遠，有一山，名祇離渠呵。",
        "translation": "At the time, not far from the great city of Rājagṛha, there was a mountain named Giriḍūha.",
        "source": "T03n0190_048:0874a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼山中，常有一時施設大會，其會即名祇離渠呵；復有山，名離師祇離，亦常設會，其會亦名離師祇離；復有一山，名倍呵羅；如是般塗山，如是毘富羅山，各有一會，其會亦名毘富羅等，如是彼山。",
        "translation": "On that mountain, there's always a meeting called Jilipukhā, and there's another mountain named Lissagiri that always hosts a meeting, which is also called Lissagiri; another mountain named Pehala; such as Mount Bantu; and such as Mount Vipula, each has a meeting, which is also called Vipula, and so forth, on that mountain.",
        "source": "T03n0190_048:0874a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "祇離渠呵，隨節設會，於彼會處，聚集大眾。",
        "translation": "Gṛdhrakūṭa set up a meeting according to the occasion, and at that meeting place, he gathered a large crowd.",
        "source": "T03n0190_048:0874b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有無量千數無量百千數，乃至億數人民交集，乘種種乘，所謂象馬車步，從八方來，欲觀彼會。",
        "translation": "At the time, an incalculable number of thousands and an incalculable number of hundreds of thousands, or even billions, of people gathered together in various vehicles called elephants, horses, chariots, and footsteps, and came from eight directions wanting to observe that assembly.",
        "source": "T03n0190_048:0874b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其王舍城一切人民，莫不皆出，於彼時間去王舍城那羅陀村，去拘離迦聚落可半由旬。",
        "translation": "All the people of that city of Rājagṛha went out, and at that time they left for the village of Nārada in Rājagṛha, which was about half a league from the village of Kulika.",
        "source": "T03n0190_048:0874b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時低沙童子，作是思惟：「我於今者，可至祇離渠呵處，詣彼觀看，若至彼者，令我必當尅獲一事，謂心厭離。」",
        "translation": "The boy Upajāta then thought, \"Now, I could go to Gṛdhrakūṭa and look at it, but if I go there, I'll surely attain one thing, which is to say that I'm disillusioned with it.\"",
        "source": "T03n0190_048:0874b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時優波低沙童子乘四象車，從那羅陀聚落而出，至祇離渠呵設會之所，為觀看故。",
        "translation": "Riding in a four-elephant chariot, the boy Upatiṣya then left the village of Nārada and went to the place where he had set up the meeting at Jilīquhā for the purpose of observing it.",
        "source": "T03n0190_048:0874b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其拘離多童子亦作是念：「我於今者，可往詣彼祇離渠呵大會之處，乃至心生厭離。」",
        "translation": "That boy Kolita also thought, \"Now, I could go to that place where the great meeting at Jililguhā is being held and become disillusioned with it.\"",
        "source": "T03n0190_048:0874b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乘其象背，漸進而行，是童子前使諸人戲，或歌或舞，從拘離迦聚落而出，至祇離渠呵設會之處，為觀看故。",
        "translation": "Riding on the back of his elephant and gradually advancing, he caused some people to play, sing, or dance as he left the village of Kulika and went to the meeting place at Jililguhā for the purpose of observing it.",
        "source": "T03n0190_048:0874b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼二人顏容端正，能悅人心，乃至技藝，莫不了達，堪為眾首。",
        "translation": "Those two men had fine countenances, were pleasing to the people, and had no skill that they didn't understand, making them the leaders of the crowd.",
        "source": "T03n0190_048:0874b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼會中，敷諸高座，彼人至已，各昇高座。",
        "translation": "At the time, they had arranged high seats in the assembly, and when they arrived, they each ascended to a high seat.",
        "source": "T03n0190_048:0874b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時優波低沙童子，見彼大眾，以種種伎，作諸音樂，或歌或舞，嬉戲受樂。",
        "translation": "The boy Upatiṣya then saw that crowd using various tricks to make music, sing, dance, and play for fun.",
        "source": "T03n0190_048:0874b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既見此已，即作是念：「此事希奇未曾有也。",
        "translation": "After seeing this, he thought, \"This is a rare and wonderful thing.",
        "source": "T03n0190_048:0874b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今是人民，乃能於此苦惱之中、諸穢濁內、衰老垢處，受樂放逸。",
        "translation": "Now, this is a people who can enjoy pleasure and dissipation in the midst of suffering and distress, in the midst of defilements and the stain of old age.",
        "source": "T03n0190_048:0874b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是病垢，無有安隱，如是死穢，命非久長；如是大眾，而生樂想，放逸自恣，種種歌舞，作眾音樂，受諸戲樂。」",
        "translation": "Such is the defilement of illness, which has no peace, such is the defilement of death, and life isn't long; such is the mass of people who give rise to happy thoughts, carefree abandon, various songs and dances, making music, and enjoying amusements.\"",
        "source": "T03n0190_048:0874b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時優波低沙，觀大眾已，作如是念：「過百年已，如是大眾，無一在者。」",
        "translation": "Upatiṣya then, after observing that crowd, had this thought, \"After a hundred years, there won't be a single one of these people left.\"",
        "source": "T03n0190_048:0874b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念時，即生悔恨，不生欣慕，便從勝座，安徐而起，漸離會處，至空閑林，詣一樹下，悵怏而坐，諸根閉塞，思惟禪定。",
        "translation": "When he had this thought, he became remorseful and discontented, and then he rose quietly from his high seat, gradually left the meeting place, went to a quiet forest, went under a tree, sat down uncomfortably, shut off his faculties, and contemplated meditation.",
        "source": "T03n0190_048:0874b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼會中有一技人，以戲弄故，令大眾喜。",
        "translation": "At the time, there was a skilled man in that assembly who delighted the crowd by playing tricks on them.",
        "source": "T03n0190_048:0874c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時拘離多童子，見彼大眾呵呵大笑，即作是念：「今此大眾，於百年已，頷車頰骨，更可合不？」",
        "translation": "When the boy Kolita saw that crowd laughing, he thought, \"Could this crowd, after a hundred years, have the cheeks and bones of their jaws be joined?\"",
        "source": "T03n0190_048:0874c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，生大憂苦，不生貪樂，便從坐起，覓優波低沙童子，即作念言：「優波低沙童子，今何所在？」",
        "translation": "After this thought, he became very sad and distressed, and instead of craving, he got up from his seat and looked for the boy Upatiṣya, and then he thought, \"Where is the boy Upatiṣya now?\"",
        "source": "T03n0190_048:0874c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四向顧覓，遙見優波低沙童子，在彼林樹，安坐思惟，其心不樂，諸根閉塞，思惟念定。",
        "translation": "Looking around, he saw the boy Upatiṣya sitting stably in meditation in a forest tree, his mind unhappy, his faculties shut down, and his thoughts absorbed in meditation.",
        "source": "T03n0190_048:0874c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "顧瞻見已，即便詣彼，而白言曰：「汝今何故，其心不悅，於此之處，獨坐思惟？",
        "translation": "After he saw them, he went to them and said, \"Why are you unhappy in your mind, sitting here alone, reflecting?",
        "source": "T03n0190_048:0874c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於今者，得無災怪不祥之惱殃苦事耶？」",
        "translation": "Now, will you be free of calamity, strange, unwholesome afflictions, and suffering?\"",
        "source": "T03n0190_048:0874c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「鼓瑟等音聲，　　男女歌詠聲，　應聽是妙音，　　何故不生樂？",
        "translation": "He then spoke the verse, \"Such sounds as the drumming of a cither, the singing of men and women, and so forth, should be heard as marvelous sounds; why wouldn't pleasure arise?",
        "source": "T03n0190_048:0874c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此時應歡喜，　　勿得懷憂惱，　此是受樂時，　　非應作啼哭。",
        "translation": "This is the time to rejoice, not to be sad and troubled; this is the time to experience joy, not to lament.",
        "source": "T03n0190_048:0874c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　但聽是音聲，　　如天玉女作，　此會如天會，　　何故情不欣？」",
        "translation": "Just listen to this sound, like the creation of a heavenly jade woman, and why aren't your feelings elated when this meeting is like a heavenly assembly?\"",
        "source": "T03n0190_048:0874c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優波低沙童子，告拘離多童子：「奇哉親友！",
        "translation": "It was then that the boy Upatiṣya addressed the boy Kolita, \"Amazing, my friend!",
        "source": "T03n0190_048:0874c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見如是大會事不？",
        "translation": "Do you see such a great assembly of things?",
        "source": "T03n0190_048:0874c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以於種種音聲歌詠，受大喜樂，是大會眾，於百年已，無有一在。」",
        "translation": "Because they sing and sing with various sounds and receive great joy, there's not a single one of these large congregations that has been here for a hundred years.\"",
        "source": "T03n0190_048:0874c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「眾人貪愛境，　　是境不能救，　諸物不久固，　　愚癡輩何樂？",
        "translation": "He then spoke a verse, saying, \"Many people crave objects that can't be saved, and these things don't last long; how can the foolish enjoy them?",
        "source": "T03n0190_048:0874c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此諸眾生等，　　染著五慾心，　不久墮地獄，　　命終成灰土。",
        "translation": "\"These sentient beings and others are so defiled by the five desires that they'll soon fall into hell and their lives will end in ashes.",
        "source": "T03n0190_048:0874c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今心內無一欣，　　恐怖愁憂甚增長，　汝等音樂雖有樂，　　如我意見樂法心。",
        "translation": "Now, there's not a single delight in my heart, and my fears and sorrows have grown so great that even though you have music and pleasure, you'll enjoy the Dharma as I see it.",
        "source": "T03n0190_048:0874c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天人修羅緊那羅，　　多時心中受歡樂，　不能厭離便命盡，　　是故我應修法行。」",
        "translation": "Gods and humans, the Cūḍaras and Kiṃnaras often experience joy in their hearts, and their lives will end if they can't get rid of it; therefore, I should cultivate the practice of the Dharma.\"",
        "source": "T03n0190_048:0874c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，拘離多童子復白優波低沙童子言：「優波低沙！",
        "translation": "It was then that the boy Kauṇḍinya again said to the boy Upatiṣya, \"Upatiṣya!",
        "source": "T03n0190_048:0875a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我之心念，亦復如是。」",
        "translation": "My mindfulness is likewise.\"",
        "source": "T03n0190_048:0875a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「苦樂相同者，　　憂喜亦復同，　智者所讚歎，　　今我亦同汝。",
        "translation": "He then spoke a verse, saying, \"They're the same in suffering and pleasure, and they're also the same in sorrow and joy, which are praised by wise men.",
        "source": "T03n0190_048:0875a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝慾心所好，　　我意亦當隨，　寧可共汝死，　　不欲生離汝。」",
        "translation": "You desire what your mind desires, and I will follow suit. I'd rather die with you than be born apart from you.\"",
        "source": "T03n0190_048:0875a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，拘離多童子復問優波低沙童子言：「我等今者欲何所作？」",
        "translation": "It was then that the boy Kauṇḍinya again asked the boy Upatiṣya, \"What do we want to do now?\"",
        "source": "T03n0190_048:0875a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時優波低沙童子報拘離多童子作如是言：「知友若爾，今者我等，應當出家求勝甘露。」",
        "translation": "The Upatiṣya boy then reported to the Kulika boy, saying, \"If you know this, we should leave home and seek the excellent nectar.\"",
        "source": "T03n0190_048:0875a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時拘離多童子便報優波低沙童子作如是言：「如汝意樂，我亦隨喜。",
        "translation": "The boy Kolita then responded to the boy Upatiṣya, saying, \"As you like, I'll also like it.",
        "source": "T03n0190_048:0875a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波低沙！",
        "translation": "Upatiṣya!",
        "source": "T03n0190_048:0875a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等今者，既已捨家，宜從此去求索出家。」",
        "translation": "Now, since we've left home, it's appropriate for us to go from here and seek renunciation.\"",
        "source": "T03n0190_048:0875a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時優波低沙童子告拘離多童子言：「汝拘離多！",
        "translation": "The boy Upatiṣya then addressed the boy Kulitā, \"Kulitā!",
        "source": "T03n0190_048:0875a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應當知時，我等今者，眾人識知，若家不許，誰度我等？",
        "translation": "You should know that when we were here, many people knew, and if our families hadn't approved, who would have saved us?",
        "source": "T03n0190_048:0875a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼恐父母，生留難心。",
        "translation": "They're afraid their parents will have difficult thoughts about it.",
        "source": "T03n0190_048:0875a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等於今，宜諮父母。」",
        "translation": "Now, it's appropriate for us to consult our parents.\"",
        "source": "T03n0190_048:0875a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二童子，遂從眾會，還至家中。",
        "translation": "The two boys then returned home from the assembly.",
        "source": "T03n0190_048:0875a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優波低沙童子，詣父母所，而白言曰：「善哉父母！",
        "translation": "The child Upatiṣya then went to his parents and said, \"Good, parents!",
        "source": "T03n0190_048:0875a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今意者，樂欲出家，唯願聽許。」",
        "translation": "Now, I would like to leave home, but I beg you to grant it.\"",
        "source": "T03n0190_048:0875a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，父母私共評論：「今者家內，誰為繼嗣？",
        "translation": "At the time, their parents commented privately, \"Who will be the heir in our family now?",
        "source": "T03n0190_048:0875a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切資生，以誰為主？",
        "translation": "Who is the lord of all sentient beings?",
        "source": "T03n0190_048:0875a20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是童子！",
        "translation": "Thus is the boy!",
        "source": "T03n0190_048:0875a20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等愛念，將欲捨我，出家求道，我有何心，而能別彼？」",
        "translation": "We long for the thought that we will abandon me and leave home to seek the path, so what mind do I have that can distinguish between them?\"",
        "source": "T03n0190_048:0875a21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時父母共評論已，即告優波低沙童子言：「童子！",
        "translation": "After their parents had spoken together, they told the boy Upatiṣya, \"Boy!",
        "source": "T03n0190_048:0875a22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等今日雖有眾子，於汝偏愛，蹔時不見，生大憂惱，常樂見汝，不欲相離，汝從生來，未曾勤苦，如我等意，乃至絕命，不欲相離，況我現存而當相放？",
        "translation": "Although we have sons and daughters today who are partial to you and who don't see you at an instant and become greatly distressed, we're always happy to see you and don't want to part with you.",
        "source": "T03n0190_048:0875a23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若許出家，終無是事。」",
        "translation": "If I were allowed to leave home, it would never happen.\"",
        "source": "T03n0190_048:0875a27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是二請，乃至三請，亦不聽許。",
        "translation": "Even after these two or three requests, they wouldn't have been granted.",
        "source": "T03n0190_048:0875a27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是三請，不蒙許已。",
        "translation": "After he was denied permission for these three requests, Upatiṣya was denied permission.",
        "source": "T03n0190_048:0875a28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優波低沙童子，既不蒙許，遂於一日，不飲不食，乃至七日。",
        "translation": "Having been denied permission, the boy Upatiṣya then went one day without food or drink for seven days.",
        "source": "T03n0190_048:0875a28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時父母、一切親屬及諸知識，各共集會，白父母言：「善哉聖者！",
        "translation": "At the time, his parents, all his relatives, and his friends gathered together and said to his parents, \"Good, noble one!",
        "source": "T03n0190_048:0875b01_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等應許優波低沙捨家出家，其人若得捨家出家，樂彼求道，容存活路；身命若存，汝等何憂而不見耶？",
        "translation": "Should you permit Upatiṣya to leave home and leave home, and should he be able to leave home and leave home, he'd be happy to pursue the path and allow himself to be kept alive; if his life were to survive, why are you so worried and don't see it?",
        "source": "T03n0190_048:0875b02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不樂彼會自當歸，勿令汝前取命終耳。」",
        "translation": "If you don't like it, you'll return on your own accord; don't let your life end before you.\"",
        "source": "T03n0190_048:0875b05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，童子父母即告言曰：「若必然者，我今聽許。」",
        "translation": "The boy's parents then told him, \"If it's certain, I'll accept it now.\"",
        "source": "T03n0190_048:0875b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，拘離多童子即詣父母而白言曰：「善哉父母！",
        "translation": "At that point, the boy Kauṇḍinya went to his parents and said, \"Good, parents!",
        "source": "T03n0190_048:0875b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今將欲捨家出家，唯願聽許！」",
        "translation": "Now, I'm about to leave home and leave the world, so I beg you to grant permission!\"",
        "source": "T03n0190_048:0875b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是拘離多父母，唯有一息，愛之甚重，不欲蹔捨，若少不見，生大憂愁。",
        "translation": "These parents of Kolita, who have only one breath, love them so much that they don't want to part with them quickly, and if they don't see them for a while, they become very sad.",
        "source": "T03n0190_048:0875b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，拘離多童子父母，昔於家內先有要誓：「汝等家內大小，於拘離多童子邊有所作者，勿得違也。",
        "translation": "At the time, the parents of the boy Kolita had previously vowed, \"All of you, big and small, in your family should not disobey the boy Kolita when he gets something to say.",
        "source": "T03n0190_048:0875b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡所發言，皆悉從命。」",
        "translation": "Whatever you say, you'll obey.\"",
        "source": "T03n0190_048:0875b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時彼等善知時已，告拘離多童子言：「隨汝意樂，任情所作。」",
        "translation": "After they well knew the time, they told the boy Kolita, \"Do as you like, as you wish.\"",
        "source": "T03n0190_048:0875b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，王舍大城有一外道，名波離闍婆刪闍耶，住在彼城，有五百眷屬。",
        "translation": "At the time, there was a layman named Pārijāta Kauṇḍinya who lived in the great city of Rājagṛha and had 500 retinues.",
        "source": "T03n0190_048:0875b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優波低沙童子及俱離多童子未有歸依，不知何去？",
        "translation": "At the time, the boy Upatiṣya and the boy Kulītā didn't know where to go because they hadn't yet returned to them.",
        "source": "T03n0190_048:0875b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二童子，遂剃鬚髮，於刪闍耶(隋云彼勝)外道之所，出家學道。",
        "translation": "Those two boys then shaved their hair and left home to train at the house of a layman named Sañjaya (Sui: Piśrāvastī).",
        "source": "T03n0190_048:0875b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼二人，念行捷利，少欲知足，智慧深遠，其刪闍耶毘羅瑟智(隋云別異杖)之子，遂向二人，說己道術，種種技藝，醫方藥草，非想禪定。",
        "translation": "When they were both mindful of the benefits of practice, had few desires and were satisfied, and had profound wisdom, the son of Sañjaya Virāḍhaka (Sui: Bṛhatphala) then taught them the techniques of his path, various skills, medical prescriptions, herbs, and non-conceptual meditation.",
        "source": "T03n0190_048:0875b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二童子既聞是已，於七日七夜，皆悉通達。",
        "translation": "After hearing this, the two boys fully comprehended it for seven days and nights.",
        "source": "T03n0190_048:0875b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼二人通達是已，於波離婆闍迦外道之所，及五百眷屬，為教授師。",
        "translation": "After they had comprehended it, they went to the layman's residence in Parivrājaka with 500 members of his retinue as their instructors.",
        "source": "T03n0190_048:0875b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼二人，如是次第，主領大眾。",
        "translation": "Those two men then led the crowd in this order.",
        "source": "T03n0190_048:0875b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖復如此，而於內心，未得安靜。",
        "translation": "Even so, they hadn't yet attained quietude in their minds.",
        "source": "T03n0190_048:0875b25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時優波低沙童子，告波離婆闍迦(隋云遠離)拘離多曰：「善哉拘離多！",
        "translation": "The boy Upatiṣya then told Parivrājaka (Sui: Faraway) Kulitā, \"Good, Kulitā!",
        "source": "T03n0190_048:0875b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此刪闍耶波離婆闍迦法，不究竟窮盡苦際。",
        "translation": "This Kanjaya-vārṣika teaching doesn't completely exhaust the limits of suffering.",
        "source": "T03n0190_048:0875b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "拘離多！",
        "translation": "Kulīta!",
        "source": "T03n0190_048:0875b28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝應共我更求善師。」",
        "translation": "You should join me in seeking a better teacher.\"",
        "source": "T03n0190_048:0875b28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時拘離多波離婆闍迦童子，告優波低沙波離婆闍童子言：「如優波低沙所言，我不違也。",
        "translation": "The boy Kauṇḍinya Pāliwajaka then told the boy Upatiṣya Pāliwajaka, \"As Upatiṣya said, I won't disagree with you.",
        "source": "T03n0190_048:0875b29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖然，此師亦復不得全棄捨之更餘別覓。」",
        "translation": "Still, I won't be able to discard this teacher entirely and look for another one.\"",
        "source": "T03n0190_048:0875c02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼二人，同心立誓：「我等二人，若復更得勝是師者、為我等說甘露勝道者，必相啟悟。」",
        "translation": "The two of them then made a unified vow, \"If we two were to find another teacher who's superior to this one and who teaches us the surpassing path of immortality, we'll both surely be enlightened.\"",
        "source": "T03n0190_048:0875c03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊因頻婆娑羅等，教化十二那由他眾生已，住王舍城迦蘭陀竹園之內，與大比丘眾一千人俱，皆悉剃髮，捨家出家。",
        "translation": "After teaching 12 sentient beings named Nayuta, the Bhagavān stayed in the Kalandaka Bamboo Park of Rājagṛha with a large group of 1,000 monks, all of whom had their hair shaved, renounced their homes, and left home.",
        "source": "T03n0190_048:0875c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，有一長老比丘，名優婆斯那，威儀庠序，諸比丘中，最為第一。",
        "translation": "At the time, there was an elderly monk named Upasena whose manner was peaceful and orderly, the most distinguished of the monks.",
        "source": "T03n0190_048:0875c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於晨朝時，著衣持鉢，入王舍城，於其城中，次第乞食。",
        "translation": "In the early morning, he put on his robe and took his bowl into the city of Rājagṛha and went there in order to solicit alms.",
        "source": "T03n0190_048:0875c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（摩訶僧祇師作如是說。",
        "translation": "(Thus did the master Mahāsāṃghika explain.",
        "source": "T03n0190_048:0875c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "）（自餘諸師，又復說言：「時阿輸波踰祇多(隋云馬星)，於晨朝時，日在東方，著衣持鉢，入城乞食，於其城中，次第乞食，威儀庠序，進止有方，著僧伽梨及涅槃僧，嚴持食器，皆悉齊整，巧攝諸根，安心視外思惟諸法，正念直行。」",
        "translation": ") (The other masters also said, \"At the time, Aśvaghoṣa entered the city at dawn when the sun was in the east, dressed in robes and carrying a bowl, and went into the city to solicit alms, begging for food in order, with peaceful manners and order, conducted himself with dignity, dressed as a saṃghârī and a nivāsana, held his food vessel with care and neatness, skillfully collected his faculties, looked outward at ease, contemplated the teaching, and conducted himself with correct mindfulness.\"",
        "source": "T03n0190_048:0875c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "）爾時，王舍大城一切人民，目所見者各共評論，而說偈言：「巧攝諸根識，　　進止恒靜定，　含笑出美言，　　此必釋種子。」",
        "translation": "At the time, all the people of Rājagṛha commented together as they saw it, saying, \"Skillfully tending his faculties and consciousnesses, he remains calm and collected, smilingly speaks beautifully, and surely this is the Śākyamuni seed.\"",
        "source": "T03n0190_048:0875c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優波低沙童子見彼長老阿濕波踰祇多比丘，於王舍城次第乞食，威儀庠序，進止有方，著僧伽梨及涅槃僧，嚴持食器，悉皆齊整，巧攝諸根，安心諦視思惟諸法，正念直行而為諸人，說此偈故。",
        "translation": "It was then that the boy Upatiṣya saw that elder monk Aśvaghoṣa go begging for food in succession in Rājagṛha, behaving himself in an orderly fashion, conducting himself with dignity, wearing his saṃghârī and nirvāṇa saṃgha, strictly maintaining his food vessel, making himself neat and tidy, skillfully taming his faculties, contemplating the qualities with calmness and attention, and speaking this verse for the people with correct mindfulness and straightforwardness.",
        "source": "T03n0190_048:0875c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優波低沙波離婆闍迦即作是念：「世間所有諸阿羅漢，一切聖人及成向道。",
        "translation": "Upādhyāya Parivrājaka then had this thought, \"There are arhats in the world, all sages, and those who have set out for the path.",
        "source": "T03n0190_048:0875c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今是大德，應在一數，我當詣彼問其心疑。」",
        "translation": "Now, this great virtuous man should be one in number; I will go there and ask about his doubts in his mind.\"",
        "source": "T03n0190_048:0875c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優波低沙波離婆闍迦復作是念：「若往問者，今非其時。",
        "translation": "Upālippāli Vajraka then again thought, \"If I were to go there and ask about it, now wouldn't be the right time.",
        "source": "T03n0190_048:0876a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0190_048:0876a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以乞食故。",
        "translation": "That's because they're begging for food.",
        "source": "T03n0190_048:0876a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫求法者，應捨我慢，宜當隨逐詣何方所。」",
        "translation": "Those who seek the Dharma should abandon their pride and should follow it to wherever it leads.\"",
        "source": "T03n0190_048:0876a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，其優波低沙波離婆闍迦，即隨後行，觀覓去所。",
        "translation": "After he thought this, Upatiṣya Upāsaka left Vātsīputra and went on his way, looking for a place to go.",
        "source": "T03n0190_048:0876a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，阿濕波踰祇多比丘，從王舍大城乞食已，持食出城。",
        "translation": "It was then that the monk Aśvayugaja left the great city of Rājagṛha after soliciting alms and carrying food out of the city.",
        "source": "T03n0190_048:0876a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時優波低沙波離婆闍迦，即詣大德阿濕波踰祇多比丘之所，到已共彼長老阿濕波踰祇多比丘，對自慰喻，共談說已，却住一面。",
        "translation": "Upāsaka-prāpta-prabhājaka then went to the place of the great virtuous monk Aśvagupta, and when he arrived, he and the elder monk Aśvagupta spoke to each other about their comfort, and after they had spoken together, they withdrew to one side.",
        "source": "T03n0190_048:0876a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時優波低沙波離婆闍迦白大德阿濕波踰祇多比丘言：「仁者！",
        "translation": "Upālippāli Vātsīputrīya then said to the Bhagavān Aśvāyagīta, \"Sir!",
        "source": "T03n0190_048:0876a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝是正師，為當是他聲聞弟子耶？」",
        "translation": "Are you the right teacher, or should you be another śrāvaka disciple?\"",
        "source": "T03n0190_048:0876a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語已，時長老阿濕波踰祇多，告優波低沙波離婆闍迦言：「別有大師，我是餘尊聲聞弟子。」",
        "translation": "After he spoke these words, the elder Aśvaghoṣa told Upāsaka that there was another great teacher, and that I was a disciple of the other śrāvakas.\"",
        "source": "T03n0190_048:0876a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優波低沙波離婆闍迦，問大德阿濕波踰祇多比丘言：「大德！",
        "translation": "Upāsaka then asked the great monk Aśvaghoṣa, the elder Aśvaghoṣa, \"Great man!",
        "source": "T03n0190_048:0876a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝師是誰？",
        "translation": "Who is your teacher?",
        "source": "T03n0190_048:0876a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依誰出家樂誰法行？」",
        "translation": "Who do I rely on to leave home and enjoy the practice of the Dharma?\"",
        "source": "T03n0190_048:0876a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊初成正覺，時諸人輩皆悉號佛，為大沙門，是摩訶沙門也，作是名號。",
        "translation": "It was then that the Bhagavān first became perfectly enlightened, and all of the people there were calling the Buddha a great ascetic, a mahāsrāmaṇa, and they gave him that name.",
        "source": "T03n0190_048:0876a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，阿濕波踰祇多大德比丘，告優波低沙波離婆闍迦言：「善哉仁者！",
        "translation": "It was then that the great virtuous monk Aśvagupta addressed Upāsaka Rājagṛha, saying, \"Good, sir!",
        "source": "T03n0190_048:0876a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有大沙門！",
        "translation": "There is the great monk!",
        "source": "T03n0190_048:0876a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是釋種子，於釋迦種類，於彼出家。",
        "translation": "This is a seed of Śākyamuni who left home in that Śākyamuni clan.",
        "source": "T03n0190_048:0876a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼是我師，依彼出家，憙樂彼法。」",
        "translation": "He was my teacher, left home based on him, and enjoyed his teaching.\"",
        "source": "T03n0190_048:0876a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優波低沙波離婆闍迦，復白大德阿濕波踰祇多言：「善哉仁者！",
        "translation": "Upālippāṭṭika then again said to the great virtuous Aśvāyugita, \"Good, sir!",
        "source": "T03n0190_048:0876a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼汝大師，顏容端正，於汝勝不？",
        "translation": "Is your great teacher, with his noble countenance, superior to you?",
        "source": "T03n0190_048:0876a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有德術，亦勝汝耶？」",
        "translation": "Are you also superior in terms of virtues and skill?\"",
        "source": "T03n0190_048:0876a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長老阿濕波踰祇多即說偈言：「如芥對須彌，　　牛跡比大海，　蚊虻並金翅，　　我與彼亦然。",
        "translation": "It was then that the elder Aśvaghoṣa spoke in verse, saying, \"Suppose a mustard seed confronts Sumeru, a cow's trail compares to the ocean, a gnat's fly has wings of gold, and so do I and that person.",
        "source": "T03n0190_048:0876a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　假使聲聞度彼岸，　　成就諸地猶弟子，　於彼佛邊不入數，　　與佛世尊威德別。",
        "translation": "Suppose a direct disciple reached the other shore, accomplished the stages like a disciple, and didn't enter the category of buddhas, then we'd be distinguished from the Bhagavān's authoritative qualities.",
        "source": "T03n0190_048:0876b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「然彼我師，於三世法，皆悉明了，得無礙智。",
        "translation": "\"Still, our teacher fully understands all three worldly dharmas, and he attains unhindered knowledge.",
        "source": "T03n0190_048:0876b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仁者！",
        "translation": "Sir!",
        "source": "T03n0190_048:0876b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我師於一切法，事皆成就。」",
        "translation": "My teacher has accomplished everything.\"",
        "source": "T03n0190_048:0876b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優波低沙波離婆闍迦，白大德阿濕波踰祇多言：「仁者！",
        "translation": "Upālippāṭṭika then said to the great virtuous Aśvāyugita, \"Sir!",
        "source": "T03n0190_048:0876b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝師說何等法？",
        "translation": "What kind of teaching does your teacher teach?",
        "source": "T03n0190_048:0876b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "論何等事？」",
        "translation": "What are these things?\"",
        "source": "T03n0190_048:0876b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「我見斯威儀，　　身心甚寂定，　是故我疑網，　　願為說是事。",
        "translation": "He then spoke the verse, \"I've seen this demeanor, and my body and mind are so calm and composed that I've come to doubt the net and wish to explain this matter for you.",
        "source": "T03n0190_048:0876b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝今莫疲倦，　　我心懷疑網，　汝師說何法？",
        "translation": "Now, don't tire, for my mind doubts the net, but what teaching did your teacher explain?",
        "source": "T03n0190_048:0876b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　願為解說之。」",
        "translation": "Please explain this for me.\"",
        "source": "T03n0190_048:0876b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見是婆羅門，　　恭敬起是問，　報言：「我師者，　　甘蔗種大姓，　一切智無勝，　　是我無上師。」",
        "translation": "Seeing this brāhmaṇa, he respectfully raised this question and replied, \"That teacher of mine, a great family of sugarcane seeds, has unsurpassed omniscience, and is my unsurpassed teacher.\"",
        "source": "T03n0190_048:0876b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，大德阿濕波踰祇多告憂波低沙言：「仁者！",
        "translation": "It was then that the great virtuous Aśvayugaṃdhita addressed Suppa-darśana, saying, \"Sir!",
        "source": "T03n0190_048:0876b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我生年幼，學法初淺，少知少聞，豈能廣說？",
        "translation": "I was born young, my training in the Dharma was rudimentary, and I know little and have heard little, so how could I explain it in detail?",
        "source": "T03n0190_048:0876b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今當為汝略言之耳。」",
        "translation": "I will now explain it for you in brief.\"",
        "source": "T03n0190_048:0876b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，憂波低沙白阿濕波踰祇多言：「善哉大德！",
        "translation": "It was then that Upatiṣya said to Aśvaghoṣa, \"Good, Mañjuśrī!",
        "source": "T03n0190_048:0876b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "要略說之，如我今者不好多語。」",
        "translation": "To explain it briefly, as I have done now, I don't like to talk much.\"",
        "source": "T03n0190_048:0876b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而說偈言：「我唯取真理，　　不好名與句，　智者愛實義，　　依義我修行。」",
        "translation": "He spoke a verse, saying, \"I take only the truth, reject names and phrases, love real meaning as a wise person, and rely on meaning as my practice.\"",
        "source": "T03n0190_048:0876b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，大德阿濕波踰祇多，告優波低沙言仁者：「我彼大師，說因緣法，談解脫路，我師偈說如是之法。」",
        "translation": "It was then that the great virtuous Aśvaghoṣa addressed Upatiṣya, saying, \"That great teacher of mine explained the law of causes and conditions and talked about the path to liberation, and my teacher explained this kind of teaching in verse.\"",
        "source": "T03n0190_048:0876b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（摩訶僧祇師作如是說。",
        "translation": "(That's what the Mahāsāṃghika teacher said.",
        "source": "T03n0190_048:0876b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉惟師又復別說。",
        "translation": "Kāśyapa Weishi then explained it separately.",
        "source": "T03n0190_048:0876b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "）「是義云何？」",
        "translation": ") \"What does this mean?\"",
        "source": "T03n0190_048:0876b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「仁者！",
        "translation": "\"Merciful one!",
        "source": "T03n0190_048:0876b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我師說是法句：「『諸法從因生，　　諸法從因滅，　　如是滅與生，　　沙門說如是。』」",
        "translation": "Our teacher explained this statement of the teaching, \"'All things arise from causes, all things cease from causes, and thus they cease and arise,' and the ascetic explained it that way.\"",
        "source": "T03n0190_048:0876b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優波低沙波離婆闍迦，善達文字之法。",
        "translation": "Upāsaka Upāsaprabha was then well-versed in the ways of words.",
        "source": "T03n0190_048:0876b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時大德彼阿濕波踰祇多比丘，能解文義，又能攝彼義及文字，是何多耶？",
        "translation": "What's the great virtuous monk Aśvaghoṣa who understands the meaning of words and can subsume their meaning and words?",
        "source": "T03n0190_048:0876b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸法因生者，　　彼法隨因滅，　因緣滅即道，　　大師說如是。」",
        "translation": "\"When causes of things arise, those things cease according to their causes, and the cessation of causes and conditions is the path, the great teacher says so.\"",
        "source": "T03n0190_048:0876c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，優波低沙波離婆闍迦，觀見如此法行之時，即於是處，遠塵離垢，盡諸煩惱，得法眼淨，諸有為法，皆得滅相，如實觀知。",
        "translation": "When Upāliśālī Bālāditya observed such a practice of things, he became dustless and spotless, ended the afflictions, attained purification of the Dharma eye, and attained true observation of the cessation of all the characteristics of the things that exist.",
        "source": "T03n0190_048:0876c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如淨衣，無有垢染，遠離黑膩，易受染色。",
        "translation": "It's like a pure robe that's unsullied, far removed from black and greasy, and easily stained.",
        "source": "T03n0190_048:0876c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是如是，優波低沙波離婆闍迦，觀此行法，即於是處，遠塵離垢，乃至如實觀知時已。",
        "translation": "Thus and so, Upāsaka Upāsaka-vārāja observes this practice, which is to say that it's a place far removed from dust and dirt up to the time when it's truly observed.",
        "source": "T03n0190_048:0876c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼優波低沙波離婆闍迦，如實觀見彼諸法已，得諸法已，觀諸法已，入諸法已，度諸法已，無復疑網，是非之心，皆悉滅沒，得無畏地，不隨他教，自然能知如來法已。",
        "translation": "After truly observing those things, after attaining them, after observing them, after entering them, after liberating them, after realizing them, without further webs of doubt, and after the minds of right and wrong are all extinguished, he attains the ground of fearlessness, doesn't follow other teachings, and is naturally able to know the Tathāgata's teaching.",
        "source": "T03n0190_048:0876c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「如是之法行，　　如我所得者，　數劫那由他，　　未曾得此法。」",
        "translation": "He then spoke this verse, \"Such a practice of the Dharma is like nothing I've ever attained, not even in eons and eons.\"",
        "source": "T03n0190_048:0876c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優波低沙波離婆闍迦，已見諸法，已得諸法，已得生智，捨三奇木，整理衣服，向大德阿濕波踰祇多，頂禮足下，禮已還起，右遶三匝，從是別去，詣拘離多波離婆闍迦所。",
        "translation": "Upāsaka Rājagṛha, having seen the teachings, having attained the teachings, and having attained knowledge, put away the three strange logs, adjusted his robes, saluted the great virtuous Aśvaghoṣa at his feet, rose after paying homage, circled to his right three times, and departed separately to go to Kolita Rājagṛha.",
        "source": "T03n0190_048:0876c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到已，其拘離多波離婆闍迦，遙見優波低沙波離婆闍迦，面目清淨，儀容光澤，見已白言：「仁者優波低沙波離婆闍迦！",
        "translation": "When he arrived, Kolita Ripāli Vajraka saw Upāsaka from a distance, his face was clear and his appearance was radiant, and when he saw him, he said, \"Sir, Upāsaka Ripāli Vajraka!",
        "source": "T03n0190_048:0876c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於今者，諸根已淨，皮膚光澤，面目清淨。",
        "translation": "Now, you have purified your faculties, your skin is radiant, and your face is clear.",
        "source": "T03n0190_048:0876c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於今者，頗證甘露不？",
        "translation": "Now, won't you realize the nectar?",
        "source": "T03n0190_048:0876c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗得甘露道耶？」",
        "translation": "Will you attain the nectarine path?\"",
        "source": "T03n0190_048:0876c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時優波低沙波離婆闍迦，告拘離多波離婆闍迦言：「仁者！",
        "translation": "Upālippāśāsaka then addressed Kulītapālippājaka, saying, \"Sir!",
        "source": "T03n0190_048:0876c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已值遇甘露勝法，得甘露道。」",
        "translation": "I've encountered the surpassing Dharma of immortality and attained the path of immortality.\"",
        "source": "T03n0190_048:0876c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時拘離多即報彼言：「仁者！",
        "translation": "Kauṇḍinya then answered him, \"Sir!",
        "source": "T03n0190_048:0876c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是甘露誰邊所得？」",
        "translation": "Who will get this kind of nectar?\"",
        "source": "T03n0190_048:0876c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時優波低沙波離婆闍迦報言：「仁者！",
        "translation": "Upādhyāya Parivrājaka then reported, \"Sir!",
        "source": "T03n0190_048:0876c27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於彼大沙門邊所得。」",
        "translation": "I got it from the side of that great ascetic.\"",
        "source": "T03n0190_048:0876c28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "拘離多波離婆闍迦復言：「仁者！",
        "translation": "Kolita Parivrājaka then said, \"Sir!",
        "source": "T03n0190_048:0876c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼大沙門，說何等事？",
        "translation": "What kinds of things does that great ascetic teach?",
        "source": "T03n0190_048:0876c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "論何等法？",
        "translation": "In what kind of dharma?",
        "source": "T03n0190_048:0877a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於今者，云何而得甘露勝道？」",
        "translation": "Now, how did you attain the surpassing path of ambrosia?\"",
        "source": "T03n0190_048:0877a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優波低沙波離婆闍迦，向拘離多波離婆闍迦，而說偈言：「諸法因生者，　　彼法隨因滅，　因緣滅即道，　　大師說如是。」",
        "translation": "Upālippāśālībhajaka then addressed Kauṇḍinya-prabhājaka and spoke in verse, saying, \"When causes arise, those causes cease, and the cessation of causes and conditions is the path, the great teacher explains it this way.\"",
        "source": "T03n0190_048:0877a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，拘離多波離婆闍迦聞是偈已，即於是處，遠塵離垢，盡諸煩惱，得法眼淨，一切行法，皆得滅相，如實能知，如實能解。",
        "translation": "After hearing this verse, Kauṇḍalipāli Vajraka immediately became dustless and spotless, ended his afflictions, attained purification of the Dharma eye, and attained the cessation of all things in his path, knowing and understanding them as they really are.",
        "source": "T03n0190_048:0877a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如淨衣無有垢染，遠離黑膩，易受染色。",
        "translation": "It's like a pure robe that's unsullied, far removed from black and greasy, and easily stained.",
        "source": "T03n0190_048:0877a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至如實能觀知已，而說偈言：「如是之行法，　　如我今所得，　數劫那由他，　　未曾獲此法。」",
        "translation": "After truly observing and knowing them, he says, \"Such a practice is like nothing I've ever attained until now, not even in eons or nayutas.\"",
        "source": "T03n0190_048:0877a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，拘離多復以偈頌告優波低沙波離婆闍迦言：「汝遇甘露故，　　面目淨光澤，　汝讚說是法，　　聞已得淨眼。」",
        "translation": "Kauṇḍinya then again addressed Upatiṣya Pāliwajaka in a verse, saying, \"Because you met the ambrosia, your face and eyes are pure and radiant; praise this teaching, and you'll attain pure eyes after hearing it.\"",
        "source": "T03n0190_048:0877a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，拘離多告優波低沙波離婆闍迦言：「善哉仁者！",
        "translation": "It was then that Kauṇḍinya addressed Upāsaka Upavāsa-prabhāsa, saying, \"Good, sir!",
        "source": "T03n0190_048:0877a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "速往速往，宜從此到大沙門所，當行梵行。",
        "translation": "Going quickly, it's appropriate to go from here to the place of a great ascetic who will conduct a religious practice.",
        "source": "T03n0190_048:0877a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛世尊，是我教師。」",
        "translation": "That Buddha, the Bhagavān, is my teacher.\"",
        "source": "T03n0190_048:0877a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優波低沙波離婆闍迦，告拘離多言：「仁者！",
        "translation": "Upāsaka Rīpajaka then addressed Kolita, saying, \"Sir!",
        "source": "T03n0190_048:0877a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等今日不得失恩，應詣本師刪闍耶所。",
        "translation": "Today, we mustn't lose our friendship; we should go to our teacher Kanjaya.",
        "source": "T03n0190_048:0877a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T03n0190_048:0877a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於我等，多作利益，先於我邊，有大重恩，救度我等，令得出家，應詣彼別。",
        "translation": "They've done a lot of good for us, and they've shown us great kindness in saving us and enabling us to leave home, so we should go there and tell them.",
        "source": "T03n0190_048:0877a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復五百眷屬徒黨，依附我等，修學行法。",
        "translation": "Furthermore, there are 500 followers and disciples who rely on us to cultivate our practice.",
        "source": "T03n0190_048:0877a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須告彼知，若彼印可，我亦共行。」",
        "translation": "We must tell them to know that if they approve, we'll also practice together.\"",
        "source": "T03n0190_048:0877a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優波低沙波離婆闍迦，共拘離多波離婆闍迦，往詣彼師刪闍耶波離婆闍迦邊，到已白言：「善哉仁者！",
        "translation": "Upālippāśāsaka and Kauṇḍinya-pālippājaka then went to their teacher, Sañjayī-pālippājaka, and when they arrived, they said, \"Good, sir!",
        "source": "T03n0190_048:0877a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等今欲至大沙門佛世尊所行於梵行。」",
        "translation": "Now, we want to go to the Bhagavān, the great brāhmaṇa, to practice the religious life.\"",
        "source": "T03n0190_048:0877a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時刪闍耶波離婆闍迦，告優波低沙波離婆闍迦等言：「仁者！",
        "translation": "Sañjayaprabhājaka then addressed Upatiṣya Upājayaprabhājaka and the others, saying, \"Sir!",
        "source": "T03n0190_048:0877a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼所莫往，我共汝等，教習此眾。」",
        "translation": "Don't go there; together with you, I'll teach this crowd.\"",
        "source": "T03n0190_048:0877b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是第二，優波低沙波離婆闍迦，復告刪闍耶波離婆闍迦言：「善哉仁者！",
        "translation": "Thus, second, Upatiṣya-prabhāsôttaka again told Sañjayī-prabhāttaka, \"Good, sir!",
        "source": "T03n0190_048:0877b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等欲去至大沙門佛世尊所行於梵行。」",
        "translation": "We want to go to the Bhagavān, the great ascetic, to practice the religious life.\"",
        "source": "T03n0190_048:0877b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時刪闍耶波離婆闍迦，再語優波低沙波離婆闍迦等言：「仁者！",
        "translation": "Sañjayaprabhājaka then spoke again to Upatiṣya Upājayaprabhājaka and the others, saying, \"Sir!",
        "source": "T03n0190_048:0877b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫至彼所，是諸弟子，付囑於汝，我於今者，獨到一邊，縱情無預。」",
        "translation": "Don't go there; these are the disciples who have entrusted you with my mission; I'll go to one side alone now, even though I have no intention of doing so.\"",
        "source": "T03n0190_048:0877b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是第三，時優波低沙波離婆闍迦，共拘離多波離婆闍迦等，語刪闍耶波離婆闍迦言：「我等不欲是諸弟子，但我唯願速詣彼師大沙門邊，行於梵行。",
        "translation": "Thus, third, Upatiṣya and Prabhākaramitra, together with Kulīta and Prabhākaramitra, said to Sañjayī Prabhākaramitra, \"We don't want to be disciples, but I just want to quickly go to that great ascetic and practice the religious life.",
        "source": "T03n0190_048:0877b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼大沙門，是我世尊，是我教師。」",
        "translation": "That great ascetic is my world-honored father and my teacher.\"",
        "source": "T03n0190_048:0877b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語已，即於此處，背刪闍耶而去不還。",
        "translation": "After he said those words, he left here, turned his back on the ācārya, and didn't return.",
        "source": "T03n0190_048:0877b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彼五百波離婆闍迦外道之眾，即作是念：「此優波低沙、拘離多是二人等，多解多知，聰明細意，我等多年，疲勞勵意，讀誦技藝呪術等事。",
        "translation": "At the time, that group of five hundred laypeople from Parivrājaka thought, \"These two people, Upatiṣya and Kolita, are well-versed, intelligent, and attentive, and we've been tired and motivated for years to recite techniques and spells.",
        "source": "T03n0190_048:0877b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然是二人，於七日七夜，一切通達。",
        "translation": "Yet these two people were able to comprehend everything for seven days and nights.",
        "source": "T03n0190_048:0877b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此非凡庶，此等應曉能求勝處。",
        "translation": "These are not ordinary people, and they should know the superior place to seek.",
        "source": "T03n0190_048:0877b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若彼求處，我亦隨求，其所行法，我亦當行，所修梵行，我亦隨修。」",
        "translation": "If they seek that place, I'll seek it along with them, I'll practice the things they practice, and I'll practice the religious practices I cultivate along with them.\"",
        "source": "T03n0190_048:0877b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是思惟已，便即隨行。",
        "translation": "After thinking this, he then did as he was told.",
        "source": "T03n0190_048:0877b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時刪闍耶波離婆闍迦，復告於彼大眾言曰：「汝等人輩！",
        "translation": "After that thought, he then went along with it.\" Again, he told the crowd, \"You people!",
        "source": "T03n0190_048:0877b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫去莫去。」",
        "translation": "Don't go, don't go.\"",
        "source": "T03n0190_048:0877b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖復如是言說遮斷，不能留礙，遂爾而去。",
        "translation": "Despite this explanation and refutation, they couldn't be obstructed, so they departed.",
        "source": "T03n0190_048:0877b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時刪闍耶波離婆闍迦，即作是念：「今此大眾，必定捨我。」",
        "translation": "Sañjayapālīvājaka then thought, \"Now, this great crowd will surely abandon me.\"",
        "source": "T03n0190_048:0877b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此大眾捨離因緣故大愁惱，即從口中吐大熱血，而取命終。",
        "translation": "Because of this mass abandonment, they were greatly distressed and spit out a great deal of hot blood from their mouths, and they ended up dead.",
        "source": "T03n0190_048:0877b23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優波低沙波離婆闍迦，與拘離多波離婆闍迦，將五百眷屬，詣迦蘭陀竹林之處。",
        "translation": "Upālippāśālī and Kauṇḍinya then brought 500 members of their retinue to the Kalandaka Bamboo Grove.",
        "source": "T03n0190_048:0877b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告諸比丘言：「汝諸比丘！",
        "translation": "It was then that the Buddha addressed the monks, \"You monks!",
        "source": "T03n0190_048:0877b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應善知時，於此院內，須敷淨座。」",
        "translation": "You should know well when to place a pure seat in this courtyard.\"",
        "source": "T03n0190_048:0877b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸比丘白佛言：「世尊！",
        "translation": "The monks said to the Buddha, \"Bhagavān!",
        "source": "T03n0190_048:0877b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯然受教。」",
        "translation": "I'll accept your teaching.\"",
        "source": "T03n0190_048:0877b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘即為世尊，於其院內，敷設淨座，世尊於是坐彼座。",
        "translation": "The monks then prepared a pure seat for the Bhagavān in his courtyard, and the Bhagavān sat down at that seat.",
        "source": "T03n0190_048:0877b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，長老憍陳如，遙望見彼優波低沙及拘離多二人，與彼外道徒眾左右圍遶，欲來至已，即白佛言：「世尊！",
        "translation": "Looking out, the elder Kauṇḍinya saw Upatiṣya and Kauṇḍinya surrounded by a group of heretics who were about to arrive, and he said to the Buddha, \"Bhagavān!",
        "source": "T03n0190_048:0877c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此二人優波低沙波離婆闍迦、拘離多波離婆闍迦等，有大技藝，多聞多知，於諸道術，無復疑網，名聞流布，遍至四方。",
        "translation": "These two people, Upatiṣya and Kolita, have great skill, are well-versed, know much, have no more webs of doubt about the techniques of the path, and have spread their reputation far and wide.",
        "source": "T03n0190_048:0877c03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今若來至世尊前者，如我意見量此二人，決欲共佛論議來也。」",
        "translation": "If they were to come to the Bhagavān now, then I would say that these two people definitely want to discuss the Buddha's teachings with him.\"",
        "source": "T03n0190_048:0877c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，佛告長老憍陳如言：「汝憍陳如！",
        "translation": "After he said this, the Buddha addressed Elder Kauṇḍinya, saying, \"Kauṇḍinya!",
        "source": "T03n0190_048:0877c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今知彼二人之心，求勝故來，不以論議。」",
        "translation": "Now, I know that their minds are motivated by a desire to excel, and I don't discuss them.\"",
        "source": "T03n0190_048:0877c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊遙見彼等優波低沙波離婆闍迦、拘離多波離婆闍迦等二人因緣，而說偈言：「見諸聖為樂，　　共居亦復樂，　不見群癡輩，　　是則名常樂。」",
        "translation": "At the time, the Bhagavān saw the causes and conditions of those two people, Upālippāśālī and Kauṇḍinya, from a distance, and spoke in verse, saying, \"Seeing the sages as happy, living together as happy, and not seeing the deluded group, this is called constant happiness.\"",
        "source": "T03n0190_048:0877c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告諸比丘，作如是言：「汝諸比丘！",
        "translation": "It was then that the Bhagavān addressed the monks and said, \"You monks!",
        "source": "T03n0190_048:0877c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見此二人波離婆闍迦，一名優波低沙、二名拘離多不？」",
        "translation": "Do you see these two men, Pāliwajaka, one Upatiṣya and the other Kulīta?\"",
        "source": "T03n0190_048:0877c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘而白佛言「見也。",
        "translation": "The monks then said to the Buddha, \"We see it.",
        "source": "T03n0190_048:0877c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T03n0190_048:0877c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告彼諸比丘言：「汝諸比丘！",
        "translation": "Again, the Buddha addressed the monks, saying, \"You monks!",
        "source": "T03n0190_048:0877c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此二人，是我聲聞弟子之中，各有第一：一者智慧第一，二者神通第一。」",
        "translation": "These two people are the best of my śrāvaka disciples, one the best in wisdom and the other the best in superknowledge.\"",
        "source": "T03n0190_048:0877c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而說是偈言：「彼等遙見二人來，　　弟子圍遶及眷屬，　雲雷尊音告比丘：　　『如此二人外道生，　今來詣我大眾處。",
        "translation": "He spoke this verse, saying, \"As they saw these two people coming from afar, surrounded by their disciples and their retinues, Venerable Maitreya addressed the monks, 'Such are the two non-Buddhist beings who have come to visit us here in the great assembly.'",
        "source": "T03n0190_048:0877c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝等比丘應當知，　一者智慧最為勝，　　二者神通復第一。』」",
        "translation": "You monks should know that one is the most brilliant in terms of wisdom and the other is the most powerful in terms of superknowledge.'\"",
        "source": "T03n0190_048:0877c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，佛復告諸比丘言：「汝諸比丘！",
        "translation": "The Buddha then again addressed the monks, saying, \"You monks!",
        "source": "T03n0190_048:0877c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切過去，所有諸佛多陀阿伽度、三藐三佛陀，於此聲聞大眾之中，更無勝也；今此二人，當亦如是。",
        "translation": "Of all the buddhas, Tathāgatas, and Samyak-saṃbuddhas of the past, there's none greater than this śrāvaka assembly; this duo will be likewise.",
        "source": "T03n0190_048:0877c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T03n0190_048:0877c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未來世諸佛如來、三藐三佛陀，更無勝我，今此一雙聲聞弟子。",
        "translation": "\"If there were Tathāgatas, Samyak-saṃbuddhas, and no one else in the future, there wouldn't be a greater self than this pair of śrāvaka disciples.",
        "source": "T03n0190_048:0877c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等比丘！",
        "translation": "You monks!",
        "source": "T03n0190_048:0877c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦可敷設，宜令彼坐。」",
        "translation": "It's also appropriate to set up a place for them to sit.\"",
        "source": "T03n0190_048:0877c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而有偈說：「二人牛王得深智，　　已捨一切諸邪道，　雖未至此大林中，　　世尊遙授彼人記。」",
        "translation": "Then there was a verse that said, \"Two cow-king men have attained profound knowledge and have abandoned all wrong paths, even though they haven't yet reached this great forest, and the Bhagavān has given them a distant assurance of their future.\"",
        "source": "T03n0190_048:0877c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時二人漸進而來，欲到彼林，遙見長老阿濕波踰祇多，在一樹下，視地經行，即詣彼所，到已頂禮，却住一面。",
        "translation": "They then gradually advanced and were about to reach that forest when they saw the elder Aśvaghoṣa sitting under a tree, gazing at the ground and walking, and went there, paid homage when they arrived, and withdrew to one side.",
        "source": "T03n0190_048:0878a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時憍陳如而白佛言：「希有世尊！",
        "translation": "Kauṇḍinya then said to the Buddha, \"It's rare, Bhagavān!",
        "source": "T03n0190_048:0878a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何今此優波低沙、波離婆闍迦等，捨彼勝生放蕩之處及多聞處，發最上心，於長老阿濕波踰祇多所，起最下心。」",
        "translation": "How did Upatiṣya and Parivrājaka abandon their places of superior birth and debauchery and their places of extensive learning to give rise to the highest intentions and give rise to the lowest intentions at Elder Aśvaghoṣa's place?\"",
        "source": "T03n0190_048:0878a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，佛告長老慧命憍陳如：「夫有智者，隨得智處，常起報恩，繫念不忘，若少得恩，常憶無失，況多得也？",
        "translation": "After he said this, the Buddha addressed Elder Wisdom Life Kauṇḍinya, \"A person with knowledge always generates repayment of kindnesses wherever they attain knowledge, and he's mindful of it and doesn't forget it.",
        "source": "T03n0190_048:0878a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍陳如！",
        "translation": "Kauṇḍinya!",
        "source": "T03n0190_048:0878a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是優波低沙、波離婆闍迦等，於阿濕波踰祇多所，得法眼淨。」",
        "translation": "Upatiṣya, Parivrājaka, and the others attained purification of the Dharma eye at Aśvaghoṣa.\"",
        "source": "T03n0190_048:0878a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，說此法句：「諸佛所說法，　　誰邊聽解知，　是處起恭敬，　　如梵志事火。」",
        "translation": "For this reason, they said these words of the teaching, \"Who else would hear and understand the teachings of the buddhas and rise to respect them like a priest serving fire?\"",
        "source": "T03n0190_048:0878a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，優波低沙波離婆闍迦等，與諸波離婆闍迦等，詣向佛所，頂禮佛足，長跪白言：「善哉！",
        "translation": "Upālippāṭṭika and the others then, went to the Buddha, bowed their heads at his feet, knelt down long, and said, \"Good!",
        "source": "T03n0190_048:0878a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0190_048:0878a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等今者，欲世尊前出家修道。",
        "translation": "Now, we want to leave home and train before the Bhagavān.",
        "source": "T03n0190_048:0878a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊！",
        "translation": "May it be so, Bhagavān!",
        "source": "T03n0190_048:0878a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聽我出家，受具足戒。」",
        "translation": "Listen to me as I leave home and receive the full set of precepts.\"",
        "source": "T03n0190_048:0878a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告彼言：「善來比丘！",
        "translation": "The Buddha told them, \"Well come, monks!",
        "source": "T03n0190_048:0878a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今來入我自證法中，行於梵行，盡諸苦故。」",
        "translation": "Now, I've come to realize the Dharma for myself, to practice the religious life, and to end suffering.\"",
        "source": "T03n0190_048:0878a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，彼諸比丘，自然即得三衣著身，各執瓦鉢，鬚髮自落，狀如童兒初剃其髮始經七日。",
        "translation": "After saying this, those monks naturally and immediately attained the three garments they were wearing, each held a tile bowl, and their hair fell out on their own, resembling a boy whose hair had been shaved for the first seven days.",
        "source": "T03n0190_048:0878a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸長老，即成出家，具足眾戒。",
        "translation": "The elders then became renunciant monks and fulfilled the various precepts.",
        "source": "T03n0190_048:0878a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長老優波低沙在佛右邊，長老拘離多在佛左邊，各坐一面。",
        "translation": "At the time, Elder Upatiṣya was on the right side of the Buddha, and Elder Kolita was on the left side of the Buddha, each sitting at one side.",
        "source": "T03n0190_048:0878a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而是長老優波低沙，從出家後，始經半月，盡諸結漏，現神通力，及得神通智波羅蜜，證羅漢果。",
        "translation": "It was half a month after he left home that Elder Upatiṣya ended the tethers, manifested supernormal powers, attained the perfection of supernormal knowledge, and realized the fruit of the arhat.",
        "source": "T03n0190_048:0878a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時拘離多，止經七日，即盡結漏，現神通力，及得神通智波羅蜜，證羅漢果。",
        "translation": "It was then that Kolita, after seven days, ended the contaminants, manifested supernormal powers, attained the perfection of supernormal knowledge, and realized the fruit of the arhat.",
        "source": "T03n0190_048:0878a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，彼長老優波低沙及拘離多等，如是因緣漸次而有五百眷屬，悉得出家，成具足戒。",
        "translation": "As a result of these causes and conditions, the elder Upatiṣya and Kulitā gradually had 500 retinues who all left home and became fully ordained.",
        "source": "T03n0190_048:0878b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，長老優波低沙母名舍利(隋言鸜鵒)，以是因緣，世間號曰舍利弗多(弗多者隋言子)，其彼長老目揵連延，是彼種姓，以是義故，世間號曰目揵連延。",
        "translation": "At the time, the elder Upatiṣya's mother's name was Śāriputra (Suiyandi), and because of this, she was known in the world as Śāriputra (Suiyandi), and that elder Maudgalyāyana was from that family, and because of this, she was known in the world as Maudgalyāyana.",
        "source": "T03n0190_048:0878b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復，世尊而記之言：「汝諸比丘！",
        "translation": "Again, the Bhagavān recorded it, saying, \"You monks!",
        "source": "T03n0190_048:0878b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於我聲聞弟子之中，大智慧者，舍利弗多最為第一。",
        "translation": "Among my śrāvaka disciples, Śāriputra is the most intelligent, and he's the most eminent.",
        "source": "T03n0190_048:0878b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "神通之內，目陀揵連最為第一。」",
        "translation": "Among the clairvoyants, Maudgalyāyana is the most eminent.\"",
        "source": "T03n0190_048:0878b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，諸比丘白佛言：「世尊！",
        "translation": "It was then that the monks said to the Buddha, \"Bhagavān!",
        "source": "T03n0190_048:0878b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其長老舍利弗、目揵連等，彼於往昔，種何善根？",
        "translation": "elders Śāriputra and Maudgalyāyana, what good roots did they plant in the past?",
        "source": "T03n0190_048:0878b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乘是因緣，今得出家，具足眾戒，證羅漢果？",
        "translation": "By taking advantage of these causes and conditions, will you now leave home, complete the precepts, and realize the fruit of the arhat?",
        "source": "T03n0190_048:0878b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊復記：『於大智慧聲聞之中舍利弗勝，神通之中目連為最。』」",
        "translation": "The Bhagavān further recorded, 'Among the śrāvakas of great wisdom, Śāriputra is superior, and among the supernormal powers, Maudgalyāyana is the greatest.'\"",
        "source": "T03n0190_048:0878b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，佛告比丘作如是言：「諸比丘！",
        "translation": "After he said this, the Buddha addressed the monks and said, \"Monks!",
        "source": "T03n0190_048:0878b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我憶往昔，於波羅[木*奈]城，時有二人，一者是兄，二者是妹，其兄名曰蘇畢利耶(隋言善愛)，其妹亦名蘇畢利耶。",
        "translation": "I remember a time in the past when there were two people in the city of Pola [munai], one a brother and the other a sister, whose brother's name was Subhriya (Sui term for well-love) and whose sister's name was also Subhriya.",
        "source": "T03n0190_048:0878b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時兄善愛，捨家出家，既出家已，即得成其辟支佛道。",
        "translation": "The older brother, Shanai, left home and renounced the world, and after renouncing the world, he attained the path of the pratyekabuddhas.",
        "source": "T03n0190_048:0878b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其妹善愛，於波離婆闍迦外道之中，出家學道。",
        "translation": "His sister, Shan'ai, left home among the laypeople of Parivrājaka and trained on the path.",
        "source": "T03n0190_048:0878b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其兄善愛辟支佛尊，於一時間，往詣外道妹善愛所，既到彼已，敷座而坐。",
        "translation": "His brother, the well-liked Vairocana, went to his sister, the well-liked layman, at one point, and after arriving there, he prepared a seat and sat down.",
        "source": "T03n0190_048:0878b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其妹善愛，備辦百味飲食之具，手自供設，令食飽滿飯食已訖，復持一刀及以一針，奉施其兄辟支佛尊。",
        "translation": "His sister, Shanai, prepared a hundred kinds of delicious foods and provisions, made her own offerings, and filled them to the brim with food.",
        "source": "T03n0190_048:0878b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其辟支佛飯食已訖，將妹善愛所施之物刀子及針，於彼妹前，飛騰而去。",
        "translation": "After he finished his meal, that Vaiśravaṇa took the knife and needle that his sister Shan'ai had given him and sent them flying away in front of his sister.",
        "source": "T03n0190_048:0878b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其妹善愛，眼自見彼尊者辟支佛騰空而去，歡喜踊躍，遍滿身心，不能自勝，合十指掌。",
        "translation": "When his sister, Shanai, saw Venerable Pṛthivī in the sky and departed, she was overcome with joy and happiness that filled her body and mind, and she joined her palms with her ten fingers.",
        "source": "T03n0190_048:0878b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遙敬禮彼辟支佛尊，尋作是願：『願我將來值是教師及勝此者，彼所說法，速得解悟，不生惡道，如施利刀無不割者，以此斷割因緣業故，令我來世一切煩惱，莫不斷壞。",
        "translation": "She paid a distant homage to that Venerable Pārśva and made this vow, 'May I meet this teacher and one who's better than this and who teaches me to quickly attain understanding and not be born in a bad path, just like giving a sharp sword that doesn't fail to cut, so that by cutting this karma from causes and conditions, all my afflictions in the future won't be destroyed.'",
        "source": "T03n0190_048:0878b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如此針，遍能貫穿，令我來世一切煩惱，具足穿徹。』",
        "translation": "This needle also penetrates everywhere, so that all my future-life afflictions will be fully penetrated.'",
        "source": "T03n0190_048:0878b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等比丘！",
        "translation": "You monks!",
        "source": "T03n0190_048:0878c02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼時中，善愛外道波離婆闍迦施辟支佛刀子及針，豈異人乎？",
        "translation": "At the time, the well-liked layman Parivrājaka gave Pārśva a sword and a needle, isn't that different from someone else?",
        "source": "T03n0190_048:0878c02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即舍利弗比丘是也。",
        "translation": "That's the monk Śāriputra.",
        "source": "T03n0190_048:0878c03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，諸比丘！",
        "translation": "\"Furthermore, monks!",
        "source": "T03n0190_048:0878c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我念往昔，波羅[木*奈]城，有一商人，恒於大海，捕螺而賣。",
        "translation": "I think about a time in the past when there was a merchant in the city of Pola [munai] who used to go out to sea and catch conch and sell it.",
        "source": "T03n0190_048:0878c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時商人作如是念：『我今所作求財自活，是大苦業，今日應造將來世因功德之事。』",
        "translation": "The merchant then thought, 'What I'm doing now to earn my own living is a great act of suffering, and today I should create a future worldly cause for merit.'",
        "source": "T03n0190_048:0878c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時波羅[木*奈]，有辟支佛依城而住。",
        "translation": "At the time, there was a pratyekabuddha living near [Mokṣala] in Pola [Munai].",
        "source": "T03n0190_048:0878c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時辟支佛，日在東方，於晨朝時，著衣持鉢，便往入於波羅[木*奈]城，於其城內，次第乞食。",
        "translation": "At the time, when the sun was in the east, he put on his robe and took his bowl in the early morning and went into the city of Pārā [muna], where he went in order to solicit alms.",
        "source": "T03n0190_048:0878c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賣螺商人，遙見尊者辟支佛來，威儀庠序，進止安審，舒顏平視，既見此已，心得清淨，即為作禮，請辟支佛，往詣其家，尊重供養，施諸餚饍，供給所須。",
        "translation": "A merchant selling conch saw Venerable Pṛthivī coming from afar, his manner peaceful and orderly, his demeanor calm and peaceful, and his countenance even, and having purified his mind, he paid homage to Pṛthivī, invited him to his home, honored and supported him, and gave him food and drink to supply what he needed.",
        "source": "T03n0190_048:0878c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時辟支佛，受彼所施飯食已訖，而辟支佛，理無說法，唯以神通，而用化物，不以餘法。",
        "translation": "After he had received the food and drink that he had been given, the Padmaji Buddha in principle didn't explain the teaching but used his supernormal powers to apply chemical substances and no other teaching.",
        "source": "T03n0190_048:0878c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時辟支佛，受彼商人供給所須飯食訖已，憐愍彼故，即從是處，飛騰虛空。",
        "translation": "After he had finished providing the merchant with the necessary food, the Vairocana Buddha took pity on him and soared through the sky from that place.",
        "source": "T03n0190_048:0878c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼商人親自遙見辟支佛尊騰空飛已，歡喜踊躍，遍滿身心，不能自勝，合十指掌，遙向頂禮彼辟支佛，遂發是願：『願我將來，值是教師或復勝者，彼所說法，速得領悟，生生之處，勿墮惡道，如彼所得，願我亦得，同是聖者，騰空飛行，令我將來，亦復如是。』",
        "translation": "After he personally saw the Venerable Pṛthivī flying through the sky from a distance, that merchant rejoiced and jumped up and down, filling his body and mind with joy, and he couldn't contain himself. He put his palms together, saluted the Venerable Pṛthivī from a distance, and made this vow: 'May I meet this teacher or another excellent person in the future who will quickly teach me and make me understand what they're teaching, so that where I'm born I won't fall into a bad path, and as they have attained it, may I also attain it, the same as that noble person who flies through the sky, so that I will do the same in the future.'",
        "source": "T03n0190_048:0878c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等比丘！",
        "translation": "You monks!",
        "source": "T03n0190_048:0878c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T03n0190_048:0878c24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時人捕螺而賣以自存活，後時供養辟支佛者，豈異人乎？",
        "translation": "Is that person different from someone who catches conch and sells it for their own survival and then makes offerings to Pṛthivī?",
        "source": "T03n0190_048:0878c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即目揵連比丘是也。",
        "translation": "That's the monk Maudgalyāyana.",
        "source": "T03n0190_048:0878c25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "\"Monks!",
        "source": "T03n0190_048:0878c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此舍利弗、目揵連延，往昔種彼諸善根故，今得出家，證羅漢果，我復授記：於我聲聞諸弟子中，智慧勝者，舍利弗是；神通勝者，目揵連是。」",
        "translation": "Śāriputra and Maudgalyāyana, having planted those good roots in the past, have now left home and realized the fruit of the arhat, and I have given them the following prediction: Among my śrāvaka disciples, the one who excels in wisdom is Śāriputra, and the one who excels in supernormal powers is Maudgalyāyana.\"",
        "source": "T03n0190_048:0878c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛本行集經卷第四十八",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Volume 48",
        "source": "T03n0190_048:0879a02_0",
        "is_bad_quality": false
    }
]