[
    {
        "source_sentence": "佛本行集經卷第十二",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Volume XII",
        "source": "T03n0190_012:0705b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隋天竺三藏闍那崛多譯",
        "translation": "Sui Tianzhu Tripiṭaka Jñānagupta Translation",
        "source": "T03n0190_012:0705b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遊戲觀矚品第十二",
        "translation": "The Twelfth Chapter of the Avalokitêśvara Sutra",
        "source": "T03n0190_012:0705b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，太子生長王宮，孩童之時，遊戲未學，年滿八歲，出閤詣師，入於學堂。",
        "translation": "\"At the time, the prince was growing up in the royal palace, and when he was a child, he played games before learning. When he reached the age of eight, he left the palace to go to his teacher and enter the training hall.",
        "source": "T03n0190_012:0705b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從毘奢蜜及忍天所，二大尊邊，受讀諸書，并一切論，兵戎雜術，經歷四年，至十二時，種種技能，遍皆涉獵。",
        "translation": "He studied books, all the treatises, and military arts from the perspective of the two great honored ones, Vaiśālmī and Nandana, going through four years and reaching the twelfth hour, and he had thoroughly acquired all kinds of skills.",
        "source": "T03n0190_012:0705b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既通達已，隨順世間，悅目適心，縱情放蕩，馳逐聲色。",
        "translation": "Once he had mastered them, he conformed to the world, pleased his eyes and mind, indulged in debauchery, and ran after sounds and colors.",
        "source": "T03n0190_012:0705b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曾於一時，在勤劬園，遨遊射戲，自餘五百諸釋種童，亦各在其自己園內，優遊嬉戲。",
        "translation": "At one point, he was roaming and shooting in the park of Qigong, and the other 500 boys of the Śākyas were each roaming and playing in their own park.",
        "source": "T03n0190_012:0705b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有群鴈，行飛虛空，是時童子提婆達多，彎弓而射，即著一鴈。",
        "translation": "When a flock of wild animals was flying through the sky, the boy Devadatta bent his bow and shot them, and he caught one of them.",
        "source": "T03n0190_012:0705b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其鴈被射，帶箭遂墮悉達園中。",
        "translation": "The animal was shot, and the arrow it was carrying fell into Siddhârtha's garden.",
        "source": "T03n0190_012:0705c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時太子見彼鴈帶箭被傷墮地，見已兩手安徐捧取，取已加趺，安鴈膝上，以妙滑澤柔潤水波，萬字輪文，福德之手，細軟猶如芭蕉嫩葉，左手擎持，右手拔箭，即以酥蜜，封於其瘡。",
        "translation": "When he saw the arrow fall to the ground, the prince picked it up with both hands, put his foot on his knee after picking it up, and placed it on his lap with a wonderfully smooth, moist, and watery embroidery, the letters of a million syllables, and a hand of merit that was as fine and soft as a young plantain leaf, held it in his left hand, pulled out the arrow with his right hand, and sealed its sores with ghee.",
        "source": "T03n0190_012:0705c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時提婆達多童子，遣使人來語太子言：『我射一鴈，墮汝園中，宜速付來，不得留彼。』",
        "translation": "The boy Devadatta then sent an envoy to the prince, saying, 'I shot a wild arrow that fell into your garden; it's better to bring it back quickly than to leave it there.'",
        "source": "T03n0190_012:0705c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時太子，報使人言：『鴈若命終，即當還汝；若不死者，終不可得。』",
        "translation": "The prince then told the messenger, 'If the animal dies, it will be returned to you; if it doesn't die, it will never be obtained.'",
        "source": "T03n0190_012:0705c08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多，復更重遣使人語言：『若死若活，決須相還，我手於先，善巧射得，遇墮落彼，云何忽留？』",
        "translation": "Devadatta then repeatedly sent the messenger, saying, 'If it's dead or alive, it must be returned to me; if my hand had skillfully shot it earlier and it fell, why wouldn't I suddenly keep it?'",
        "source": "T03n0190_012:0705c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子報言：『我已於先攝受此鴈。",
        "translation": "The prince replied, 'I've already taken this [wild] animal into my possession.",
        "source": "T03n0190_012:0705c11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者，自我發於菩提心來，我皆攝受一切眾生，況復此鴈而不屬我。』",
        "translation": "That's why, since I aroused the mind of enlightenment, I've taken in all sentient beings, so why wouldn't I take in this wild goose that doesn't belong to me?'",
        "source": "T03n0190_012:0705c12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，即便相競，集聚諸釋宿老智人，判決此事。",
        "translation": "For this reason, they even competed and gathered together the wise men of Śākyamuni and the elders to judge this matter.",
        "source": "T03n0190_012:0705c14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時有一淨居諸天，變身化作老宿長者，入釋會所，而作是言：『誰養育者？",
        "translation": "It was then that a god of the Pure Land transformed himself into an elderly elder and entered the Śākyamuni temple, saying, 'Who nurtures that?'",
        "source": "T03n0190_012:0705c15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即是攝受。",
        "translation": "That's taking in [something].",
        "source": "T03n0190_012:0705c17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "射著之者，即是放捨。』",
        "translation": "To shoot at it is to abandon it.'",
        "source": "T03n0190_012:0705c17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼諸釋宿老諸人，一時印可，高聲唱云：『如是如是，如仁者言。』",
        "translation": "The Śākyas and elders then all approved, shouting, 'Thus and thus, as you say, sir.'",
        "source": "T03n0190_012:0705c17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是提婆達多童子，共於太子，最初搆結怨讎因緣。",
        "translation": "This is how the boy Devadatta and the prince first came to be linked by a grudge.",
        "source": "T03n0190_012:0705c19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有一時，其淨飯王，共多釋種諸童子輩，并將太子，出外野遊，觀看田種。",
        "translation": "\"There was another time when the Vimalakīrti king and his group of children from the Tuṣita school took the prince out into the wilderness to look at the fields.",
        "source": "T03n0190_012:0705c20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼地內所有作人，赤體辛勤而事耕墾，以牛縻繫，彼犁[輻-田+冏]端，牛若行遲時時搖掣，日長天熱，喘嚇汗流，人牛並皆困乏飢渴。",
        "translation": "All the laborers in that field were naked and hard at work plowing, tied up with oxen, and their plows [spokes - field + Jon] were tied up at the end of their plows, and if the oxen were slow in their movements, they shook every now and then; the sun was long and the sky was hot, and they were frightened and sweaty, and both men and oxen were weary and hungry.",
        "source": "T03n0190_012:0705c22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復身體羸瘦連骸，而彼犁傷土墢之下，皆有虫出。",
        "translation": "Their bodies are also weak and lean, and insects emerge from beneath the soil and fields that have been damaged by that plow.",
        "source": "T03n0190_012:0705c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人犁過後，時諸鳥雀，競飛下來，食此虫豸。",
        "translation": "After they plow, birds and men fly down to feed on these insects and worms.",
        "source": "T03n0190_012:0705c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子覩茲犁牛疲頓，兼被鞭撻，犁[輻-田+冏]研領，鞅繩勒咽，血出下流，傷破皮肉。",
        "translation": "The prince saw this plowboy tired and exhausted, whipped, with his plow [spoke-field+jon] collar and harness strangling his throat, bleeding down, and cutting his flesh.",
        "source": "T03n0190_012:0705c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復見犁人，被日炙背，裸露赤體，塵土坌身，烏鳥飛來，爭拾蟲食。",
        "translation": "He also saw a plowman whose back was scorched by the sun, his naked body was exposed, and he was covered with dust, while crows and birds flew in and scrambled to gather food for worms.",
        "source": "T03n0190_012:0705c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子見已，起大憂愁。",
        "translation": "After he saw that, the prince became greatly distressed.",
        "source": "T03n0190_012:0706a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人見家親族被繫縛時，生大憂愁，太子憐愍彼諸眾等，亦復如是。",
        "translation": "Like a person who sees their family and clan tied up in bondage and becomes greatly distressed, the prince takes pity on those people and does the same for them.",
        "source": "T03n0190_012:0706a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見是事已，起大慈悲，即從馬王揵陟上下，下已安庠經行，思念諸眾生等，有如是事，即復唱言：『嗚呼嗚呼！",
        "translation": "Seeing this, he arouses great compassion and goes up and down from the horse king's gandharva, and after descending, he walks calmly through the scriptures, thinking about the sentient beings and so forth that have done this, and then he again sings, 'Whoa, whoa, whoa!",
        "source": "T03n0190_012:0706a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間眾生，極受諸苦，所謂生老及以病死，兼復受於種種苦惱，展轉其中，不能得離。",
        "translation": "Worldly sentient beings experience the extreme suffering of birth, old age, illness, and death, as well as the various kinds of suffering and distress that come and go, and from which they can't escape.",
        "source": "T03n0190_012:0706a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不求捨是諸苦？",
        "translation": "Why don't they seek to abandon these kinds of suffering?",
        "source": "T03n0190_012:0706a07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不求厭苦寂智？",
        "translation": "Why isn't the cognition of suffering and tranquility sought?",
        "source": "T03n0190_012:0706a08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不念免脫生老病死苦因？",
        "translation": "Why isn't he mindful of the need to avoid the causes of suffering of birth, old age, illness, and death?",
        "source": "T03n0190_012:0706a08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今於何得空閑處，思惟如是諸苦惱事？』",
        "translation": "Where have I found a place of solitude to contemplate such painful and distressing things?'",
        "source": "T03n0190_012:0706a09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時淨飯王觀田作已，共諸童子還入一園。",
        "translation": "\"After observing the work in the fields, King Jōtan and his children returned to a park.",
        "source": "T03n0190_012:0706a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時太子，安庠矚眄，處處經行，欲求寂靜。",
        "translation": "The prince was looking out and gazing about, walking around, and desiring calmness.",
        "source": "T03n0190_012:0706a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "忽見一處有閻浮樹，條幹滑澤，端正可憐，欝蓊扶疎，人所樂見。",
        "translation": "He suddenly saw a place where there was a jambu tree with a smooth trunk that was noble and lovely, luxuriant and remote, and which people liked to see.",
        "source": "T03n0190_012:0706a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見已即語諸左右言：『汝等諸人！",
        "translation": "After he saw it, he told his attendants, 'All of you!",
        "source": "T03n0190_012:0706a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各遠離我，我欲私行。』",
        "translation": "Each one of you is far away from me, and I want to go on my own.'",
        "source": "T03n0190_012:0706a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時太子，發遣左右，悉令散已，漸至樹下。",
        "translation": "The prince then sent out his attendants and had them all scattered, and he gradually went to sit under a tree.",
        "source": "T03n0190_012:0706a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到樹下已，即於草上，加趺而坐，諦心思惟眾生有於生老病死種種諸苦，發起慈悲，即得心定。",
        "translation": "Once he got under the tree, he sat down cross-legged on the grass and truly contemplated the various ways in which sentient beings suffer from birth, old age, illness, and death, aroused compassion, and then attained mental equipoise.",
        "source": "T03n0190_012:0706a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時即便離於諸慾，棄捨一切諸不善法。",
        "translation": "Even then, they part with their desires and discard all unskillful qualities.",
        "source": "T03n0190_012:0706a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟境界，分別境界，慾界漏盡，即得初禪。",
        "translation": "He contemplates the objective realm, discerns the objective realm, and ends the contaminants of the desire realm, and then he attains the first dhyāna.",
        "source": "T03n0190_012:0706a19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『我身亦自有如是法，未免此法，未度此輪。』",
        "translation": "'I myself also have such a thing, which has yet to escape this thing and has yet to cross this wheel.'",
        "source": "T03n0190_012:0706a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當思惟時，有五神仙，飛騰虛空，自在而行，有大威德、有大勢力，具足巧通毘陀之論，善解諸術，從南向北，經彼園林閻浮樹上，而欲飛過，即不能去。",
        "translation": "When they were contemplating this, five sages who soared through the sky, traveled freely, had great authority and power, were fully conversant with the Treatise on Vedas, and understood the arts well traveled from south to north, passed through that grove of jambu trees, and tried to fly past them, but they couldn't get away.",
        "source": "T03n0190_012:0706a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各相謂言：『我等往昔，去來自恣穿過須彌，出諸神通，種種示現，乃至到於毘沙門宮大天王所，或至阿羅迦槃多城，亦能穿過彼城，多有種種夜叉諸惡神等，我亦曾經彼上飛過。",
        "translation": "Each of them said, 'In the past, we've freely passed through Sumeru, produced miraculous powers, and shown ourselves in various ways, even to the extent that we went to the palace of Vaiśravaṇa, the great heavenly king, or to the city of Alakavatī, and were able to pass through that city, where there were many kinds of nightjars, bad spirits, and so forth, and I've flown over that.",
        "source": "T03n0190_012:0706a24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而此樹端，我亦曾經無量過度，不曾有礙，不失神通。",
        "translation": "I've also passed through measureless passages at the end of this tree without ever being obstructed or losing my supernormal powers.",
        "source": "T03n0190_012:0706a28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今日以誰威德力故，令於我等退失神通，不能得過？』",
        "translation": "Today, by whose mighty power have we lost our supernormal powers and been unable to surpass them?\"",
        "source": "T03n0190_012:0706b01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等仙人，即觀其樹，遂見太子，在樹陰下，加趺而坐，威光巍巍，顯爀難觀。",
        "translation": "Those sages then looked at the tree and saw the prince sitting cross-legged under its shade, his majestic appearance so lofty that it was difficult to contemplate.",
        "source": "T03n0190_012:0706b02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等見已，作是思惟：『此坐是誰？",
        "translation": "After they saw that, they thought, 'Who's sitting here?'",
        "source": "T03n0190_012:0706b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將非是彼大梵天王世間之主，或復是彼吃沙那天慾界之主，或天帝釋，或毘沙門大庫藏主，或月天子，或日天子，或復是於轉輪聖王，或此坐者，得非是佛出現世乎？",
        "translation": "Could it be that the king of Brahmā is the lord of the world, or that he is the lord of the desire realm who eats sand, or that he is Indra, or that he is the lord of the Vaiśravaṇa treasury, or that he is the son of the moon god, or that he is the son of the sun god, or that he is the wheel-turning sage king, or that he is sitting here, and isn't the Buddha appearing in the world?",
        "source": "T03n0190_012:0706b04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然今此人，威德甚大。』",
        "translation": "Still, this man's authority is very great.'",
        "source": "T03n0190_012:0706b08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼林守護之神，告諸仙言：『諸仙人輩，此非大梵世間天主，非吃沙那欲界之主，亦非天帝及毘沙門庫藏之主，亦復非是日月天子；此之太子，名悉達多，是淨飯王，釋種童子。",
        "translation": "\"At the time, the god guarding that forest addressed the sages, saying, 'Fellow sages, this is not the lord of the Brahmā worldly gods, nor the lord of the desire realm of Ṛṣana, nor the lord of Indra or Vaiśravaṇa's treasury, nor the son of the sun and moon gods; this prince, named Siddhârtha, is the Śuddhâvāsa boy, the king of pure rice.",
        "source": "T03n0190_012:0706b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸仙當知！",
        "translation": "Siddhârtha, you must know, sages!",
        "source": "T03n0190_012:0706b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大梵天王，所有威德，其吃沙那天主、帝釋、毘沙門王庫藏之主，月天日天、轉輪聖王，諸威德等，比悉達多太子所有一毫威德，彼諸威德，十六分中不及其一。",
        "translation": "'The majestic qualities of the king of the Brahmas, the majestic qualities of that god Śākya, Indra, the lord of the Vaiśravaṇa treasury, the moon gods, the sun gods, and the wheel-turning sage king are not one in 16 compared to the majestic qualities of Prince Siddhârtha.",
        "source": "T03n0190_012:0706b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝等，至此樹林，欲上飛過，神通有限，不能得度。』",
        "translation": "Therefore, all of you who come to this forest and want to fly through it have limited superknowledge and won't be able to cross over.'",
        "source": "T03n0190_012:0706b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼諸仙，聞護林神如是語已，從虛空下，住太子前，各各說偈，讚歎太子。",
        "translation": "After hearing the forest protector god say this, the sages descended from the sky and stayed in front of the prince, each speaking a verse in praise of him.",
        "source": "T03n0190_012:0706b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時一仙人，而說偈言：「『世間煩惱火熾然，　　此能出生法池水，　　既得如是微妙法，　　滅彼煩惱火燼無。』",
        "translation": "One of the sages then spoke a verse, saying, 'The world's afflictive fires are blazing, but this produces the water of the Dharma pool. Since I've attained such a subtle teaching, I've extinguished the fires of those afflictions and burned them up.'",
        "source": "T03n0190_012:0706b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有一仙而說偈言：「『世間愚癡甚黑暗，　　此能出生智慧光，　　既得如是微妙法，　　照彼昏盲一切世。』",
        "translation": "\"Another sage spoke in verse, saying, 'The world's folly is so dark, this produces the light of wisdom, and since I've attained such a subtle teaching, I've illuminated the world's delusions.'",
        "source": "T03n0190_012:0706b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有一仙而說偈言：「『憂惱曠野大澤中，　　此大馱乘能勝致，　　既得如是微妙法，　　能度三有諸眾生。』",
        "translation": "\"Again, another sage spoke a verse, saying, 'In the vast swamp of the wilderness of sorrow, this great dhāraṇī vehicle is surpassing, having attained such a subtle teaching, it's able to save all the sentient beings in the three realms.'",
        "source": "T03n0190_012:0706b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有一仙而說偈言：「『一切世間煩惱纏，　　此能方便令解脫，　　既得如是微妙法，　　能脫一切諸結羈。』",
        "translation": "\"Again, another sage spoke a verse, saying, 'This is the one who skillfully liberates all the world's tethers of affliction, and since he has attained such a subtle teaching, he's able to free himself from all the bonds that bind him.'",
        "source": "T03n0190_012:0706c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有一仙而說偈言：「『世間所有生死痾，　　此大醫師能救療，　　既得如是微妙法，　　能治一切生死疣。』",
        "translation": "\"Again, another sage spoke a verse, saying, 'This great physician can treat all the world's birth-and-death maladies, and since he has attained such a subtle teaching, he can cure all the warts of birth-and-death.'",
        "source": "T03n0190_012:0706c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時諸仙人，各各說偈歎太子已，接足頂禮，右繞三匝，飛騰虛空，相隨而去。",
        "translation": "\"After each of the sages spoke a verse praising the prince, they bowed their heads at his feet, circled him three times to his right, soared into the sky, and departed after him.",
        "source": "T03n0190_012:0706c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，淨飯王須臾之間，不見太子，心內即生不喜不樂，而問人言：『我之太子，今在何處(此上兩句梵本重稱)？",
        "translation": "When King Jōtan didn't see the prince for a moment, his heart became neither happy nor joyous, and he asked, 'Where is my prince now?'",
        "source": "T03n0190_012:0706c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "忽然不見。』",
        "translation": "Suddenly, he disappeared.'",
        "source": "T03n0190_012:0706c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時諸臣，東西南北，交橫馳走，尋覓太子，莫知所在。",
        "translation": "The ministers then rushed east and west, north and south, crisscrossing the country in search of the prince, but they didn't know where he was.",
        "source": "T03n0190_012:0706c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時一大臣，遙見太子，在彼閻浮樹陰之下，思惟坐禪，復見一切樹影悉移，唯閻浮陰獨覆太子。",
        "translation": "Then, a minister saw the prince from a distance, sitting under the shadow of a jambu tree, contemplating and meditating, and saw that the shadows of all the trees had moved away, except for the jambu shadow, which was covering the prince alone.",
        "source": "T03n0190_012:0706c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼大臣，見於太子有是希奇難思議事，即大歡喜，踊躍充遍，不能自勝。",
        "translation": "When that minister saw such a rare and unfathomable thing happen to the prince, he rejoiced greatly and leaped about, unable to control himself.",
        "source": "T03n0190_012:0706c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "急疾奔馳，走詣王所，至已長跪，依所見事，即說偈言：「『大王太子今在於，　　閻浮樹陰下端坐，　　加趺思惟入三昧，　　光明照曜如日山。",
        "translation": "He rushed quickly, went to the king's residence, knelt down, and, based on what he had seen, spoke in verse, saying, \"Now, the great king, the prince is sitting upright under the shadow of the jambu tree, sitting cross-legged in thought and entering concentration, and his light shines like a mountain sun.",
        "source": "T03n0190_012:0706c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　此實真是大丈夫，　　樹影卓然不移動，　　唯願大王自觀察，　　太子相貌坐云何？",
        "translation": "Is this really a great man whose shadow stands out and doesn't move? May the king examine for himself what the prince's appearance is like as he sits there?",
        "source": "T03n0190_012:0706c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　譬猶大梵諸天王，　　亦如忉利天帝釋，　　威神巍巍光顯爀，　　遍照於彼諸樹林。』",
        "translation": "He's like the god kings of Brahmā or the goddess Indra of the Thirty-three Celestials, whose majestic and dignified presence shines brightly and brightly, illuminating everywhere in those trees.'",
        "source": "T03n0190_012:0706c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時淨飯王聞已，即詣閻浮樹所，遙見太子在彼樹間結加趺坐，譬如黑夜視山頂頭，大聚火光出猛明炎，盛德顯著炳照巍巍，如重雲間忽出明月，亦如暗室然大淨燈。",
        "translation": "\"After hearing this, King Jodan went to the Jambudvīpa tree and saw the prince sitting cross-legged among the trees like a great cluster of fires shining brightly and brilliantly, like a bright moon suddenly appearing between heavy clouds, or a great pure lamp in a dark room.",
        "source": "T03n0190_012:0706c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王見已，生大希有奇特之心，遍體戰惶，身毛悉竪，即頭頂禮於太子足，歡喜踊躍，而作是言：『善哉善哉！",
        "translation": "When the king saw this, he had a rare and rare feeling, was terrified, and his hair shaved, saluted the prince at his feet, rejoiced, and jumped up and down, saying, 'Good, good!",
        "source": "T03n0190_012:0706c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我此太子大有威德。』",
        "translation": "'This prince of mine is greatly dignified.'",
        "source": "T03n0190_012:0707a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說偈讚曰：「『如夜大火聚山頂，　　似秋明月敞雲間，　　今見太子坐思惟，　　不覺毛張身戰慄。』",
        "translation": "He spoke a verse in praise, saying, 'It's like a great nighttime fire gathering on the top of a mountain, like the bright autumn moon opening up between the clouds. Now, when I see the prince sitting in meditation, I don't feel my hair stand on end and tremble.'",
        "source": "T03n0190_012:0707a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時淨飯王說偈讚已，更復頂禮於太子足，重說偈言：「『我今再度屈此身，　　頂禮千輻勝妙足，　　從生已來至今日，　　忽復得見坐思惟。』",
        "translation": "\"After he spoke the verse's praise, King Jōtan again bowed his head at the feet of the prince and repeated the verse, saying, 'Now, I've bent this body over again, bowed my head at the thousand-spoked feet of excellence, and since birth until today, I've suddenly been able to see him sitting and contemplating.'",
        "source": "T03n0190_012:0707a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時有擎挾筌蹄小兒，隨從大王，啾唧戲笑。",
        "translation": "\"Then there was a little boy with a pincer's foot who followed the king, chirping and laughing.",
        "source": "T03n0190_012:0707a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一大臣咄彼小兒，作如是言：『汝小兒輩！",
        "translation": "A minister confronted that boy and said, 'You little ones!",
        "source": "T03n0190_012:0707a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幸勿唱叫。』",
        "translation": "Please don't shout!'",
        "source": "T03n0190_012:0707a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸小兒報彼臣言：『何故不聽我等喧適？』",
        "translation": "The children then reported to the minister, saying, 'Why didn't you listen to our noise?'",
        "source": "T03n0190_012:0707a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，大臣即以偈頌答彼一切諸小兒言：「『日光雖極熱猛盛，　　不能迴彼樹陰涼，　　復有最妙一尋光，　　盛德世間無有匹。",
        "translation": "At that point, the minister answered all those children with a verse, saying, \"Even though the sunlight is extremely hot and intense, it can't return the coolness of the shade of that tree; there's another, most marvelous ray that has unsurpassed qualities in the world.",
        "source": "T03n0190_012:0707a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　思惟端坐於樹下，　　不動不搖如須彌，　　悉達太子內深心，　　樂此樹陰當不捨。』",
        "translation": "He sits calmly under a tree, unmoving and unshaken like Sumeru, and he understands the prince's profound inner mind; he enjoys the shade of this tree and won't abandon it.'",
        "source": "T03n0190_012:0707a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛本行集經捔術爭婚品第十三上",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Jiujian jiujiang wangjin pin di xiii.",
        "source": "T03n0190_012:0707a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時太子漸向長成，至年十九，時淨飯王為於太子，造三時殿：一者暖殿，以擬隆冬；第二殿涼，擬於夏暑；其第三殿，用擬春秋二時寢息。",
        "translation": "\"When the prince was gradually growing up and reached the age of 19, the king of Jīvaka built three seasonal halls for the prince: a warm hall for the long winter, a cool hall for the summer heat, and a third hall for the two sleeping seasons of spring and autumn.",
        "source": "T03n0190_012:0707a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "擬冬坐者殿一向煖，擬夏坐者殿一向涼，擬於春秋二時坐者，其殿調適，溫和處平，不寒不熱。",
        "translation": "The hall intended for winter sitting was always warm, the hall intended for summer sitting was always cool, and the hall intended for the two seasons of spring and autumn was well-adjusted, mild, and peaceful, not cold, and not hot.",
        "source": "T03n0190_012:0707a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復於宮內後園之中，堰水流渠，造作池沼，栽蒔種種眾雜名花，所謂優鉢羅花、波頭摩花、拘物頭華、分陀利華，為於太子，作喜樂故。",
        "translation": "Furthermore, in the back garden of the palace, he creates a weir and a stream, creates a pond, and plants various kinds of flowers of various names, such as the upa-ra flower, the padma flower, the kuṇḍu flower, and the puṇḍarīka flower, for the prince's joy and pleasure.",
        "source": "T03n0190_012:0707a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量無邊諸人，各自職司侍衛太子，或復有人，按摩太子；或復有人，柔軟太子；或復有人，以諸香油，塗荼太子；或復有人，洗浴之時，揩拭太子；或復有人，澡浴之時，供香湯者；或有染髮梳頭髻者；或復有人，執鏡照者；或執塗香，或執眼藥，或復有執熏衣香者；或執牛黃，或執華鬘，或復有執種種雜色微妙衣服，立太子前，常擬供奉。",
        "translation": "There are also measureless and limitless people each tasked with guarding the prince, including someone who massages the prince, someone who softens the prince, someone who rubs the prince with scented oils, someone who wipes the prince down when he's bathing, someone who serves scented baths when he's bathing, someone who dyes their hair and wears it in a topknot, someone who holds a mirror to look at, someone who holds perfumed incense, someone who holds eye medication, someone who holds perfumed clothing, someone who holds cowries, someone who holds flower garlands, or someone who holds a variety of exquisite clothing of various colors, who stands in front of the prince and always prepares to make offerings.",
        "source": "T03n0190_012:0707a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子著者，其衣悉是迦尸迦衣，執已曲躬，須者即進。",
        "translation": "When the prince puts them on, his robes are all Kāśyapa robes, and after he puts them on, he bends his head, and those who need them enter.",
        "source": "T03n0190_012:0707b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其太子父輸頭檀王所著衣裏若迦尸迦，外表則用其餘諸物，太子不然，所服之衣，內外悉用迦尸迦。",
        "translation": "His father, King Śuddhodana, wears robes that look like kāṣīkas on the inside and other things on the outside, but the crown prince doesn't wear robes that are made of kāṣīkas on the inside and outside.",
        "source": "T03n0190_012:0707b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作太子左右及執作人、僮僕男女、諸後從等，皆悉餧以粳粮之飯，雜肉韲醬，或臛或羹。",
        "translation": "The prince's attendants, captains, servants, men, women, and followers were all fed rice with coarse grains, meat and butter, and meat broth or soup.",
        "source": "T03n0190_012:0707b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子一身，別置妙好香美粳粮，精細揀擇，羹臛雜奠，百味蘭餚，種種珍羞，及諸餅果。",
        "translation": "The prince then placed in his body a separate supply of the wonderful, fragrant millet, carefully selected meat and fish, meat and fish broth, a hundred flavors and vegetables, various treasures, and fruits and biscuits.",
        "source": "T03n0190_012:0707b11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是無量，日別恒常，晝夜修營，各皆新造，以擬太子。",
        "translation": "These are countless, separate and constant from day to day, and they are cultivated day and night, each newly created to resemble the prince.",
        "source": "T03n0190_012:0707b13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又持白蓋，覆太子上，或畏夜戲零露風霜，或復晝遊塵埃日照。",
        "translation": "He also carried a white lid to cover the prince, so that he might fear the dew and wind and frost that play at night or the dust and sun that shine during the day.",
        "source": "T03n0190_012:0707b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時淨飯王既見太子年漸向大，心中復憶阿私陀仙授記之語，集諸耆舊釋種大臣，而作是言：『汝等親族！",
        "translation": "\"When he saw the prince growing older, King Jōtan again recalled in his mind the words of the sage Ashita's prediction, and he gathered together some old Śākyamuni ministers and said, 'You folks!",
        "source": "T03n0190_012:0707b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曾聞知不？",
        "translation": "Ever heard of it?",
        "source": "T03n0190_012:0707b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我此太子，初生之時，召諸解相及婆羅門阿私陀等，皆記之言：「其若在家，定當得作轉輪聖王，若捨出家，必得成就於無上道。」",
        "translation": "When this prince was first born, I summoned all the interpreters and Brāhmaṇasena Ashita and others to say, 'If he were at home, he would surely become a wheel-turning sage king; if he were to leave home, he would surely achieve the unsurpassed path.'",
        "source": "T03n0190_012:0707b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而我等今作何方便，令此童子得不出家？』",
        "translation": "What method will we use now to keep this boy from leaving home?\"",
        "source": "T03n0190_012:0707b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸釋親族即報王言：『大王！",
        "translation": "The Śākya clansmen then reported to the king, saying, 'Great king!",
        "source": "T03n0190_012:0707b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今當速為太子別造宮室，令諸婇女娛樂嬉戲，是則太子不捨出家。』",
        "translation": "Now, you will quickly build a separate palace for the prince, so that his daughters can enjoy themselves and play, and then the prince won't abandon leaving home.'",
        "source": "T03n0190_012:0707b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而有偈說：「『阿私陀所記，　　決定無移動，　　諸釋勸立殿，　　望使不出家。",
        "translation": "And there's a verse that says, \"Ashendra remembers, he's determined not to move, and the Śākyas urge him to build a palace, hoping that he won't leave home.",
        "source": "T03n0190_012:0707b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『如是方便，我等釋種，可得興盛，能令一切恭敬尊重，不為粟散諸王所欺。』",
        "translation": "\"Thus, we, the Śākya lineage, can prosper, cause all to respect and venerate, and not be deceived by the scattered kings.'",
        "source": "T03n0190_012:0707b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時淨飯王復語釋種諸親族言：『汝等當觀，誰釋女堪與我太子悉達為妃？』",
        "translation": "Then King Jīvaka again spoke to the Śākya clan, saying, 'You must examine this: 'Which Śākya woman could be my prince Siddhârtha's consort?'",
        "source": "T03n0190_012:0707b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，五百諸釋種族，各各唱言：『我女堪為太子作妃(上兩句梵本悉再稱，今略)。』",
        "translation": "It was then that each of the five hundred Śākyas called out, 'My daughter could be the prince's consort.'",
        "source": "T03n0190_012:0707c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時淨飯王復自思惟：『若我今日，不共太子如是籌量，忽取他女與其作妃，脫不稱可則成違負；若我今共太子語論，太子意深，終不肯道。",
        "translation": "\"King Jīvaka then thought to himself, 'If I didn't work out this proposal with the prince today and suddenly took another woman to be his consort, it would be a mistake if I didn't approve of it; if I talked to the prince about it now, the prince's intentions would be so profound that he wouldn't accept it.",
        "source": "T03n0190_012:0707c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今狐疑，作何方便？』",
        "translation": "Now, I'm doubtful. What method should I use?'",
        "source": "T03n0190_012:0707c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復更思惟：『我今可以種種雜寶，作無憂器，持與太子，令太子用施諸女人，密遣使覘觀察其意，看於大子眼目瞻矚在於誰邊，我即娉取，與其作妃。』",
        "translation": "Again, he thought, 'Now, I could make a vessel of various treasures that's free of sorrow and give it to the prince to use for giving to women, and I'd secretly send an envoy to examine their minds and see which side of the great son's eyes and gaze I'd like to take and make her my consort.'",
        "source": "T03n0190_012:0707c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時淨飯王即遣造作雜寶玩弄無憂之器，所謂金銀種種雜飾，造已即於迦毘羅城，振鐸唱言：『從今已去，至七日來，我太子欲見於釋種一切諸女，見已欲施一切雜寶種種玩弄無憂之器，城內所有一切諸女，悉可來集於我宮門。』",
        "translation": "\"The king of Jīvaka then sent his envoy to make a variety of jewelry, such as gold and silver, and playthings, and after making them, he went to the city of Kapila and raised his voice, saying, 'From now until seven days from now, the crown prince wants to meet all the women of the Śākyas, and after he meets them, he wants to give them a variety of jewelry and playthings, so all the women in the city can come gather at my palace gate.'",
        "source": "T03n0190_012:0707c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，太子六日已過，至第七日，於先出在王宮門前，據筌蹄坐。",
        "translation": "\"After six days had passed, the prince went out on the seventh day and sat down at the palace gate with a bamboo hoof.",
        "source": "T03n0190_012:0707c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時城內一切諸女，皆以種種雜寶瓔珞，各嚴其身，來集宮門，欲見太子，復欲受取種種諸寶無憂之器。",
        "translation": "All the women in the city then gathered at the palace gate with various jewelry and jewelry adorning their bodies, wanting to see the prince, and wanting to accept various treasures and worry-free wares.",
        "source": "T03n0190_012:0707c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時太子見諸女來，即持種種寶器，施與彼等諸女，從四方來見太子者。",
        "translation": "When the prince saw those women coming, he took various jewelry and gave it to them, and they came from all directions to see the prince.",
        "source": "T03n0190_012:0707c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是太子威德大故，諸女不能正看太子，但取寶器，各各低頭速疾而過。",
        "translation": "Because of the prince's great authority, the women couldn't look at the prince directly but took the precious vessels, each bowed their heads, and quickly passed by.",
        "source": "T03n0190_012:0707c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶器盡已，最後有一婆私吒族釋種大臣摩訶那摩，其女名為耶輸陀羅，前後侍從眾多婢媵，圍遶而來。",
        "translation": "When the jeweled vessels were gone, there was finally Mahānāma, a minister of the Śākyas from the Vātsīputra clan whose daughter was named Yaśodharā and who was surrounded by a large retinue of maidservants.",
        "source": "T03n0190_012:0707c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遙見太子，峨峨注睛，舉目雅步，瞻觀直眄，目不斜[門@視]，漸進前趍，來近太子。",
        "translation": "She saw the prince from a distance, gazing up at him with lofty eyes, lifting her gaze and elegantly striding forward, gazing straight ahead without slanting her eyes [gate@vision], and gradually moving forward to approach the prince.",
        "source": "T03n0190_012:0707c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如舊相識，曾無愧顏，即白太子，作如是言：『太子！",
        "translation": "Knowing him as before, he had never looked ashamed before, so he said to the prince, 'Crown prince!'",
        "source": "T03n0190_012:0707c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今可與我雜寶無憂器來。』",
        "translation": "Now, you can bring me a mixed-jewel, sorrowless container.'",
        "source": "T03n0190_012:0707c29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子報言：『汝來既遲，皆悉施盡。』",
        "translation": "The prince then replied, 'Since you're late, you've given them all away.'",
        "source": "T03n0190_012:0707c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼女復更白太子言：『我有何過？",
        "translation": "The woman then again said to the prince, 'What's wrong with me?'",
        "source": "T03n0190_012:0708a01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今欺我不與寶器。』",
        "translation": "Now, you deceived me and didn't give me the precious vessel.'",
        "source": "T03n0190_012:0708a02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子答言：『我不欺汝，但汝後來，自不及耳。』",
        "translation": "The prince answered, 'I don't deceive you, but you won't get it yourself in the future.'",
        "source": "T03n0190_012:0708a02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時太子指邊有一所著印環，價直百千，從指脫與耶輸陀羅。",
        "translation": "There was then a seal ring attached to the side of the prince's finger, costing a hundred thousand, which he took off his finger and gave to Yaśodharā.",
        "source": "T03n0190_012:0708a03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耶輸陀羅白太子言：『我於汝邊可止直於爾許物耶？』",
        "translation": "Yajñadatta said to the prince, 'May I stop at such a thing as that?'",
        "source": "T03n0190_012:0708a05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子報言：『我之所著，自餘瓔珞，任意所取。』",
        "translation": "The prince then reported, 'I'll take whatever jewelry I've put on.'",
        "source": "T03n0190_012:0708a06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼女白言：『我今豈可剝脫太子？",
        "translation": "The woman said, 'How could I have stripped the prince now?'",
        "source": "T03n0190_012:0708a07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "只可莊嚴於太子身。』",
        "translation": "He could only adorn the prince's body.'",
        "source": "T03n0190_012:0708a07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "語於太子，作是言已，心不喜歡，即迴還去。」",
        "translation": "After he said this to the prince, his heart didn't like it, and he turned back.\"",
        "source": "T03n0190_012:0708a08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊成道已後，尊者優陀夷而白佛言：「世尊！",
        "translation": "After the Bhagavān had achieved enlightenment, Venerable Udāyin said to the Buddha, \"Bhagavān!",
        "source": "T03n0190_012:0708a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何如來在王宮時，將身一切無價瓔珞，脫持施與耶輸陀羅，不能令彼心生歡喜？」",
        "translation": "How did the Tathāgata, when he was in the king's palace, dispose of all his priceless jewelry and give it to Yaśodharā, but couldn't he make his heart rejoice?\"",
        "source": "T03n0190_012:0708a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告尊者優陀夷言：「汝優陀夷！",
        "translation": "The Buddha addressed Venerable Udāyin, saying, \"You Udāyin!",
        "source": "T03n0190_012:0708a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至心諦聽！",
        "translation": "listen with utmost attention!",
        "source": "T03n0190_012:0708a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當說之。",
        "translation": "I will explain it.",
        "source": "T03n0190_012:0708a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耶輸陀羅非但今世與其瓔珞令不歡喜，其往昔來，曾因少緣生瞋恨故，雖復多種珍寶布施，猶不歡喜。」",
        "translation": "Not only did Yaśodharā give him a necklace in this world that made him unhappy, but in the past, because of a few reasons he had become angry, he still wasn't happy even though he gave many kinds of treasures.\"",
        "source": "T03n0190_012:0708a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優陀夷言：「甚奇世尊！",
        "translation": "Udraka said, \"How marvelous, Bhagavān!",
        "source": "T03n0190_012:0708a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此事云何？",
        "translation": "What is this matter?",
        "source": "T03n0190_012:0708a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願為我說。」",
        "translation": "Please explain this for me.\"",
        "source": "T03n0190_012:0708a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告優陀夷言：「我念往昔無量世時，迦尸國內波羅[木*奈]城，時有一王，信邪倒見而行治化。",
        "translation": "It was then that the Buddha addressed Udayinī, \"I remember a time in the countless past when there was a king in the city of [Muktagna] within Kashmir who believed in mistaken views and practiced discipline.",
        "source": "T03n0190_012:0708a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼王有子造少罪愆，父王駈擯令出國界，漸漸行至一天寺中，共婦相隨居停而住。",
        "translation": "When that king had a son who had committed a minor misdeed, his father sent him away from the country's borders, and he gradually went to a one-day temple, where he stayed with a wife and stayed there.",
        "source": "T03n0190_012:0708a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼王子所將食粮，皆悉罄盡，王子遊獵，殺捕諸虫以用活命。",
        "translation": "When his food was all gone, the prince went on a hunting expedition to kill insects and catch them to keep alive.",
        "source": "T03n0190_012:0708a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所獵之處，見一鼉虫，趁而殺之，即剝其皮，內水中煮，其欲向熟，汁便竭盡。",
        "translation": "Where he was hunting, he saw a bug, killed it while it was still alive, skinned it, and boiled it in water; when it wanted to ripen, the juice dried up.",
        "source": "T03n0190_012:0708a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時王子語其婦言：『肉未好熟，卿更取水。』",
        "translation": "The prince then said to his wife, 'The meat isn't quite ripe, so you might want to fetch some water.'",
        "source": "T03n0190_012:0708a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼王子婦即便取水。",
        "translation": "The prince and his wife then took the water.",
        "source": "T03n0190_012:0708a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婦去已後，王子飢急，不能忍耐，即食鼉肉，一切悉盡，不留片殘。",
        "translation": "After the woman left, the prince was so hungry that he couldn't stand it, so he ate the flesh of the fish and left nothing left over.",
        "source": "T03n0190_012:0708a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王子婦取水迴還，問其夫言：『此中鼉肉，今在何處？』",
        "translation": "The prince's wife then returned from taking the water and asked her husband, 'Where is the meat of this calabash now?'",
        "source": "T03n0190_012:0708a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王子報言：『鼉忽然活，今已走去。』",
        "translation": "The prince reported, 'The seamstress suddenly came to life, but now it's gone.'",
        "source": "T03n0190_012:0708a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其婦不信：『何忽如是？",
        "translation": "The woman didn't believe him, 'How could it suddenly be like that?'",
        "source": "T03n0190_012:0708a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼉煮已熟，云何能走？』",
        "translation": "How can a man leave after his stone is cooked?'",
        "source": "T03n0190_012:0708b01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婦心不信，而意思念：『必是我夫，飢急食盡，誑我言走。』",
        "translation": "A woman's mind doesn't believe her, but her thoughts are, 'My husband must have run out of food because he's hungry and desperate, and he's deceived me into saying that he's gone.'",
        "source": "T03n0190_012:0708b01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "情懷瞋恨，心常不歡。",
        "translation": "She felt anger and was always unhappy at heart.",
        "source": "T03n0190_012:0708b03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於後數年，其父命終，時諸大臣即迎王子，灌頂為主。",
        "translation": "A few years later, when his father's life ended, the ministers welcomed the prince and consecrated him as their lord.",
        "source": "T03n0190_012:0708b03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既作王訖，所得眾寶，及諸奇珍，種種衣裳，無價之物，皆悉與妃。",
        "translation": "After he became king, he gave his wife all the treasures, exquisite items, and various kinds of clothing and priceless goods that he had acquired.",
        "source": "T03n0190_012:0708b04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其妃雖納，而面顏色，不悅如前。",
        "translation": "Although she accepted them, her countenance was unpleasant as before.",
        "source": "T03n0190_012:0708b06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彼王語其妃言：『我一切寶，無價之物，以持賜妃，何故顏色，而不歡悅，如前不異？』",
        "translation": "At the time, the king said to his consort, 'Why isn't the color of my face as pleasant as before when I've given my consort all the treasures and priceless things?'",
        "source": "T03n0190_012:0708b07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時其夫人即說偈頌，以報王言：「『最勝大王聽，　　往昔遊獵時，　　執箭或持刀，　　射殺野鼉死，　　剝皮煮欲熟，　　遣我取水添，　　食肉不留殘，　　而誑我言走。』」",
        "translation": "The wife then spoke a verse in response to the king, saying, \"Listen, Most Excellent King, in the past when we went hunting, we wielded arrows or swords, shot dead wild animals, skinned them and cooked them, sent me to fetch water to refill them, ate the meat without leaving any residue, and led me away, saying, 'Listen!'\"",
        "source": "T03n0190_012:0708b08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "告優陀夷：「此汝當知！",
        "translation": "Udāyin was told, \"You should know this!",
        "source": "T03n0190_012:0708b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時王者，我身是也；其王后者，今日耶輸陀羅是也。",
        "translation": "\"At the time, the king was myself, and the latter was Yehudra today.",
        "source": "T03n0190_012:0708b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於爾時，少許犯觸，續於後時，多以財寶，與望和適，而其懷恨，猶不喜歡。",
        "translation": "At the time, I transgressed a little, and then I continued to offer much wealth and treasure to make things agreeable, but he harbored resentment and still didn't like it.",
        "source": "T03n0190_012:0708b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今日亦然，雖將無量諸種錢帛，亦不能令其心歡喜。",
        "translation": "Today, too, even though I gave him measureless amounts of money and treasure, I couldn't make his heart rejoice.",
        "source": "T03n0190_012:0708b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時淨飯王所遣密使察太子者，一心覩於太子眼目其所瞻矚，共於諸女相當語對，而彼密使委悉皆知。",
        "translation": "\"At the time, the king of Jīvaka's confidential envoy who was inspecting the prince was focused on seeing the prince's eyes and gazing at him, and he was conversing with the women, and the envoy knew all about it.",
        "source": "T03n0190_012:0708b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知已即時往詣王所，而白王言：『大王！",
        "translation": "After he knew this, he immediately went to the king and said to him, 'Great king!",
        "source": "T03n0190_012:0708b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，有釋大臣摩訶那摩，其女後來太子共語，數番往復，兼且微笑，停住少時，調戲言語。",
        "translation": "'You should know that there was the Śākyamuni minister Mahānāma, whose daughter came to the prince and talked with him several times, smiled, and stopped for a short time to talk playfully.",
        "source": "T03n0190_012:0708b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子彼女二顏俱悅，彼此答對，四目相當。』",
        "translation": "The prince and his daughter both had pleasant countenances, replied to each other, and exchanged glances.'",
        "source": "T03n0190_012:0708b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時淨飯王聞彼密觀如是語已，心內思惟：『太子意欲得彼女耶？』",
        "translation": "After hearing this kind of talk from that man of mysterious contemplation, the king of Jīvaka thought to himself, 'Does the prince want to have that woman?'",
        "source": "T03n0190_012:0708b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時淨飯王看好吉宿良善之日，即喚國師婆羅門來，使向釋種摩訶那摩大臣之家，而作是言：『知卿有女，今可與我太子作妃。』",
        "translation": "\"It was then that the king of Jīvaka called the national teacher Brāhmaṇa to the house of the minister Śākyamuni and said, 'I understand that you have a daughter who could now be my prince's consort.'",
        "source": "T03n0190_012:0708b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時國師聞王語已，即詣釋種摩訶那摩大臣之家，作如是言：『摩訶那摩王勅如是。』",
        "translation": "After hearing the king's words, the national tutor went to the house of the minister of Śākyamuni and said, 'Thus has King Mahānāma commanded him to do.'",
        "source": "T03n0190_012:0708b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時釋大臣報國師言：『我釋迦法，相承如是，若有技能勝一切者，於彼人邊即嫁女與；若無技能，不得與女。",
        "translation": "The Śākyamuni minister then reported to the state minister, saying, 'My Śākyamuni teaching is thus inherited that if someone has skills that are superior to all others, they'll give their daughter in marriage to one of their number; if they don't have skills, they won't be given a daughter.",
        "source": "T03n0190_012:0708c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王太子生長深宮，耽媔嬉戲，未曾學習，無有技能，弓射天文，兵書戎仗，一切戰鬪，捔力拳搥，悉未工閑，我何故今無藝人邊而嫁女與？』",
        "translation": "The prince grew up in a deep palace, spending his time playing, never learning, having no skills, shooting bows and astronomy, writing weapons, fighting, jostling, punching, and beating, all of which he has never done, so why wouldn't I give a woman in marriage to someone who has no skills?'",
        "source": "T03n0190_012:0708c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時國師聞是語已，還至王所，將如是語，具白於王。",
        "translation": "\"After hearing this, the national teacher went back to the king and explained everything he had said to him.",
        "source": "T03n0190_012:0708c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時淨飯王聞此語已，心懷愁惱，如是思惟：『摩訶那摩此語如法，向我實論無一虛妄。』",
        "translation": "After hearing these words, the king of Jīvaka became distressed and thought, 'This talk of Mahānāma's is accurate, and it's really been discussed with me as being not false.'",
        "source": "T03n0190_012:0708c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖作是念，而王內心，悵怏默然迷悶而住，其狀如似坐禪思惟。",
        "translation": "Although he thought this, the king's mind was distressed and silent, and he was confused and stayed in a state like sitting in meditation and contemplation.",
        "source": "T03n0190_012:0708c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子是時，見父王面，失於容色，悵怏不歡，猶如坐禪思惟一種，見是事已，漸至王所，而問王言：『未審父王！",
        "translation": "The prince then saw his father's face, which was discolored and unhappy, just as if he were sitting in meditation and contemplating one thing, and when he saw this, he gradually went to the king and asked him, 'I've never heard of you, Father!'",
        "source": "T03n0190_012:0708c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何緣故，如是愁惱，獨坐思惟？』",
        "translation": "For what reason is it that you are so distressed and sit alone with your thoughts?'",
        "source": "T03n0190_012:0708c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，時淨飯王答太子言：『子不須問我如此事。』",
        "translation": "After he said this, King Jīvaka answered the prince, 'My son doesn't need to ask me about such things.'",
        "source": "T03n0190_012:0708c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子再問，父王重止。",
        "translation": "The prince asked again, and his father stopped again.",
        "source": "T03n0190_012:0708c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子如是三問：『父王大王！",
        "translation": "The prince thus asked him three times, 'Father, great king!",
        "source": "T03n0190_012:0708c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "要須報我所以，解我心疑。』",
        "translation": "You must answer my questions and resolve my doubts.'",
        "source": "T03n0190_012:0708c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時淨飯王三見太子問如是事，即向太子如前所說。",
        "translation": "When he saw the prince three times, King Jīvaka asked him about these things and told him as before.",
        "source": "T03n0190_012:0708c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子知已，問父王言：『父王頗知，父王城內，有人能出與我共試技藝已不？』",
        "translation": "After he knew this, the prince asked his father, 'Does he know whether there's someone in his father's city who could come out and try out his skills with me?'",
        "source": "T03n0190_012:0708c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時淨飯王聞此語已，即大歡喜，踊躍遍身，不能自勝，即更重審問於太子，作如是言：『善哉太子！",
        "translation": "Upon hearing these words, King Jīvaka rejoiced greatly, leaped all over himself, and was unable to control himself.",
        "source": "T03n0190_012:0708c22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝實能捔諸技藝不？』",
        "translation": "Are you really able to juggle the skills?'",
        "source": "T03n0190_012:0708c24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子答言：『大王善聽！",
        "translation": "The prince replied, 'Good, Great King, listen!",
        "source": "T03n0190_012:0708c24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今實能。",
        "translation": "I really can now.",
        "source": "T03n0190_012:0708c25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T03n0190_012:0708c25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但當速集諸釋一切童子，共我捔試諸有技藝。』",
        "translation": "Only quickly will you gather all the children of the Buddha to test their skills with me.'",
        "source": "T03n0190_012:0708c25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時淨飯王勅迦毘羅城內，街巷四衢道頭，悉教振鐸大聲唱令：『從今以去，計至七日，我之儲宮悉達太子，今欲出其所有諸技，若有解者，悉令聚集，共捔試看。』",
        "translation": "\"It was then that King Jīvaka commanded the city of Kapilavastu to have everyone in the streets and the four thoroughfares at the head of the road who was instructed to ring a bell and shout out a command, 'From now on, for a period of seven days, Prince Siddhârtha of my palace will now present all his skills, and if there's anyone who understands them, he will cause them to gather together to test them.'",
        "source": "T03n0190_012:0708c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時六日過，至第七日，五百釋種諸童子等，悉達為首，並皆聚集。",
        "translation": "After six days had passed, on the seventh day, five hundred children of the Śākya clan, with Siddhârtha at the head, gathered together.",
        "source": "T03n0190_012:0709a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聚集訖已，相共出城，至一寬地，是諸童子，出技能處。",
        "translation": "When they had finished gathering, they all left the city and went to a wide area where these boys were skillfully present.",
        "source": "T03n0190_012:0709a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時釋大臣即好莊嚴耶輸陀羅，為上勝垛，作如是言：『誰能善通一切技藝，最勝上者，即以此女與其作妻。』",
        "translation": "The minister of Śākyamuni then adorned Yaśodharā as the superior pallet and said, 'Whoever is skilled in all the arts and crafts and is the most excellent, I will give this woman as my wife.'",
        "source": "T03n0190_012:0709a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時淨飯王共諸釋種耆舊長德，於先而至，復有無量無邊雜姓男子女人童男童女，皆悉聚集，詣彼試場寬地之所，欲觀太子，及諸釋種一切童子，捔試技能，誰最為勝？",
        "translation": "When King Jīvaka and his fellow elders of the Śākyas arrived, a myriad and limitless number of men, women, boys, and girls of various castes gathered there on the broad ground of the testing site to see the prince and all the children of the Śākyas compete in a trial of their skills, who would be the most superior?",
        "source": "T03n0190_012:0709a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時有諸釋種童子文學快者，先共太子試於手筆，時有釋種，相共謂言：『今者宜令毘奢蜜多為作試師。』",
        "translation": "\"It was then that some Śākyamuni boys who were fast learners of literature first tested their writing together with the prince, and some Śākyamuni boys said to each other, 'Now, it would be helpful to have Viśvāmitra be the test master.'",
        "source": "T03n0190_012:0709a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即語之言：『汝可觀察諸童子內手筆誰勝，或復快書疾書善書、解多種書。』",
        "translation": "They then said to him, 'Observe which of these boys has the superior handwriting, or whether he's a quick writer, a fast writer, a good writer, or a person who understands multiple scripts.'",
        "source": "T03n0190_012:0709a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，毘奢蜜多大師先知太子於諸書中最勝最上，熙怡微笑而說偈言：「『一切人間及天上，　　乾闥脩羅迦樓羅，　　所有文字諸書典，　　太子遍歷皆通達。",
        "translation": "At the time, the great teacher Vaiśāmitra foresaw that the prince was the best and brightest among writers, smiled broadly, and spoke in verse, saying, 'The prince has thoroughly experienced all the writings and scriptures of humans and gods, including Gandhāra Karolā.",
        "source": "T03n0190_012:0709a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我身及以汝等輩，　　不知如此書籍名，　　人間悉解我試來，　　定知其勝汝不如。』",
        "translation": "I myself and you people don't know the names of such books, but I've tried to understand them all here among people, and I definitely know that they're superior to you.'",
        "source": "T03n0190_012:0709a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時彼等釋種徒眾，詳共齊白淨飯王言：『我今已知，大王太子於書典中，最為勝上。",
        "translation": "\"It was then that those disciples of the Śākyas all said to King Jaladhara, 'Now, I know that the prince is the best among writings and scriptures.",
        "source": "T03n0190_012:0709a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "算計須試，得知誰明？』",
        "translation": "We must test our calculations to see who understands them.'",
        "source": "T03n0190_012:0709a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時眾中有一最大算計之師，名頞誰那，一切算計最為第一。",
        "translation": "There was then a teacher of the greatest calculation in the congregation named Andhra who was the greatest in all calculations.",
        "source": "T03n0190_012:0709a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時釋眾喚頞誰那來，將往試驗，語言：『尊者！",
        "translation": "The multitude of Śākyamunis then summoned Andhra to come and test him, saying, 'Venerable!'",
        "source": "T03n0190_012:0709a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝好觀看諸童子中，是誰算計為最第一？』",
        "translation": "Would you look at the children and see which one is the most skilled in calculation?\"",
        "source": "T03n0190_012:0709a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時太子算，令一釋種明了童子對下算籌，而不能供；更二童子下，猶不供；三童子下，亦不能供；乃至一十童子俱下，而亦不供；二十三十、四十五十、一百共下，而亦不供；二百三百、四百五百，一時盡下，猶尚不供。",
        "translation": "When the prince did the calculation, he caused a boy of lucid understanding of the Śākyas to go down and calculate the chips, but he couldn't offer them; two more boys went down, but they still didn't offer them; three boys went down, but they also couldn't offer them; even ten boys went down together, but they didn't offer them; twenty, thirty, forty-five, ten, and one hundred went down together, but they also didn't offer them; two hundred, three hundred, and four hundred and five hundred all went down at once, but they still didn't offer them.",
        "source": "T03n0190_012:0709a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時太子，作如是言：『汝等今算，我當為下。』",
        "translation": "The prince then said, 'Count them now, and I will make offerings for you.'",
        "source": "T03n0190_012:0709b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時一釋種童子唱算，太子為下，不能算得。",
        "translation": "A boy from the Śākya clan then called out the calculation, and the prince was the next in line, but he couldn't get it.",
        "source": "T03n0190_012:0709b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子復言：『二人雙計。』",
        "translation": "The prince then said, 'Two of you will do the math.'",
        "source": "T03n0190_012:0709b03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復不能及。",
        "translation": "Again, they couldn't reach them.'",
        "source": "T03n0190_012:0709b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子復言：『乃至一百，一時共計。』",
        "translation": "The prince then said, 'Even a hundred of them will be counted together at one time.'",
        "source": "T03n0190_012:0709b04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶不能及。",
        "translation": "Still, they couldn't do it.",
        "source": "T03n0190_012:0709b04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子復言：『汝等何假如是相競，但此等輩，一切一時各自計唱，我當為下。』",
        "translation": "The prince then said, 'Why don't you compete with each other, except for this group, which will each count and sing at one time, and I'll be the next.'",
        "source": "T03n0190_012:0709b05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸釋種五百童子，一時俱唱，太子為其一時齊下，如上所數，從於一起，乃至盡數，太子不錯，亦復不亂，安庠審諦，次第而下。",
        "translation": "When the five hundred children of the Śākyas all sang together at once, the prince counted them all together at once as above, and from the beginning to the end, the prince was still unconfused, calm and collected, and descended in order.",
        "source": "T03n0190_012:0709b06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等一切諸釋童子，盡力共算，不能及逮悉達太子萬分之一。",
        "translation": "All those Śākyamuni boys did their best to count together, but they were unable to match one ten-thousandth of what Prince Siddhârtha had done.",
        "source": "T03n0190_012:0709b09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時頞誰那國大算師，心密驚怪，極生歡喜，而說偈言：「『善哉捷利深憶持，　　分明唱下無有錯，　　五百釋童稱解算，　　一時共對不能當。",
        "translation": "The great mathematician of the country of Andhra was deeply surprised and overjoyed, and he spoke in verse, saying, \"Good, Jetavana, how deeply he recalls and retains that there's nothing wrong with clearly declaring and declaring, and the five hundred Śākyamunis who say they understand the calculation together at once can't match it.",
        "source": "T03n0190_012:0709b11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如是智慧正念心，　　算計疾速甚深奧，　　是等算師計天下，　　巨海渧數悉應知。",
        "translation": "Thus is the mind of correct wisdom and mindfulness, and the calculation is so rapid and profound that such a calculator should know every single drop in the ocean when he calculates the whole world.",
        "source": "T03n0190_012:0709b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝等默然且禁聲，　　不須與彼相捔競，　　其既解知如是術，　　應得共我相校量。』",
        "translation": "You should be silent and keep your voices quiet, not compete with them, and once you understand this kind of skill, you should be able to share my assessment.'",
        "source": "T03n0190_012:0709b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時彼釋眾一切皆生希有之心，從坐而起，合十指掌，頂禮太子，謂悉達多：『太子大勝，真實大勝。』",
        "translation": "\"At the time, all of that crowd of Śākyamunis had a rare feeling, got up from their seats, put their palms together, saluted the prince, and said to Siddhârtha, 'The prince is great and truly great!'",
        "source": "T03n0190_012:0709b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "同聲復白淨飯王言：『善哉大王！",
        "translation": "With one voice, they also said to King Jīvaka, 'Good, Great King!",
        "source": "T03n0190_012:0709b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大得善利！",
        "translation": "Greatly benefited!",
        "source": "T03n0190_012:0709b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善生人間。",
        "translation": "'Good people live here.",
        "source": "T03n0190_012:0709b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王今生如是聰叡大福德子、智慧之子。』",
        "translation": "The king is thus born in this life as a wise, intelligent, and greatly meritorious son of wisdom.'",
        "source": "T03n0190_012:0709b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舌根如是，輕便囀滑，成就口業。",
        "translation": "With his tongue thus rooted, it's easy and smooth, and it accomplishes verbal action.",
        "source": "T03n0190_012:0709b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時淨飯王熈怡微笑，語太子言：『善哉太子！",
        "translation": "Then, King Jīvaka smiled broadly and said to the prince, 'Good, Prince!'",
        "source": "T03n0190_012:0709b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今能共此頞誰那大算之師，計算世間方便智能，得相入不？』",
        "translation": "Now, can you work with this great calculating master, who is an expert in the calculation of worldly skillful means, to get access to it?'",
        "source": "T03n0190_012:0709b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時太子答父王言：『大王我能。』",
        "translation": "The prince then answered his father, saying, 'Great king, I can.'",
        "source": "T03n0190_012:0709b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時淨飯王語太子言：『汝若能者，當自知時。』",
        "translation": "The king of Jīvaka then said to the prince, 'If you can, you'll know when you can.'",
        "source": "T03n0190_012:0709b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時頞誰那大計算師語太子言：『仁者太子！",
        "translation": "The great calculator Andhāna then said to the prince, 'You're a good prince!",
        "source": "T03n0190_012:0709b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝知億上算數已不？』",
        "translation": "Do you know that the number of koṭīs has been calculated?'",
        "source": "T03n0190_012:0709b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子答言：『我甚知之。』",
        "translation": "The prince answered, 'I know it well.'",
        "source": "T03n0190_012:0709b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時頞誰那算師復言：『汝知云何？",
        "translation": "Then the Abhidharma master replied, 'What do you know about it?'",
        "source": "T03n0190_012:0709b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為我說之。』",
        "translation": "Explain this for me.'",
        "source": "T03n0190_012:0709c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子答言：『凡入億中算計數者，汝等諦聽！",
        "translation": "The prince answered, 'All of you who have entered into the hundreds of millions and counted them, listen closely!'",
        "source": "T03n0190_012:0709c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今說之。",
        "translation": "\"Now, I'll explain it.",
        "source": "T03n0190_012:0709c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一百百千，是名拘致(隋數千萬)，其百拘致名阿由多(隋數十億)，百阿由多名那由他(隋數千億)，百那由他名波羅由他(隋數十萬億)，百波羅由他名[口*恒]迦羅(隋數千萬億)，百[口*恒]迦羅名頻婆羅(隋數十兆)，百頻婆羅名阿芻婆(隋數千兆)，百阿芻婆名毘婆娑(隋數十萬兆)，百毘婆娑名欝曾伽(隋數千萬兆)，百欝曾伽名婆訶那(隋數十京)，百婆訶那名那伽婆羅(隋數千京)，百那伽婆羅名帝致婆羅(隋數十萬京)，百帝致婆羅名卑婆娑他那波若帝(隋數千萬京)，百卑婆娑他那波若帝名醯兜奚羅(隋數十姟)，百醯兜奚羅名迦羅逋多(隋數千姟)，百迦羅逋多名醯都因陀羅陀(隋數十萬姟)，百醯都因陀羅陀名三蔓多羅婆(隋數千萬姟)，百三蔓多羅婆名伽那那伽尼多(隋數十秭)，百伽那那伽尼多名尼摩羅闍(隋數千秭)，百尼摩羅闍名目陀婆羅(隋數十萬秭)，百目陀婆羅名阿伽目陀(隋數千萬秭)，百阿伽目陀名薩婆婆羅(隋數十壤)，百薩婆婆羅名毘薩闍波帝(隋數千壤)，百毘薩闍波帝名薩婆薩若(隋數十萬壤)，百薩婆薩若名毘浮登伽摩(隋數千萬壤)，百毘浮登伽摩名婆羅極叉(隋數十溝)，入於如是算計之數，其須彌山若欲算知斤兩銖分，悉可得知。",
        "translation": "一百百千，是名拘致(隋數千萬)，其百拘致名阿由多(隋數十億)，百阿由多名那由他(隋數千億)，百那由他名波羅由他(隋數十萬億)，百波羅由他名[口*恒]迦羅(隋數千萬億)，百[口*恒]迦羅名頻婆羅(隋數十兆)，百頻婆羅名阿芻婆(隋數千兆)，百阿芻婆名毘婆娑(隋數十萬兆)，百毘婆娑名欝曾伽(隋數千萬兆)，百欝曾伽名婆訶那(隋數十京)，百婆訶那名那伽婆羅(隋數千京)，百那伽婆羅名帝致婆羅(隋數十萬京)，百帝致婆羅名卑婆娑他那波若帝(隋數千萬京)，百卑婆娑他那波若帝名醯兜奚羅(隋數十姟)，百醯兜奚羅名迦羅逋多(隋數千姟)，百迦羅逋多名醯都因陀羅陀(隋數十萬姟)，百醯都因陀羅陀名三蔓多羅婆(隋數千萬姟)，百三蔓多羅婆名伽那那伽尼多(隋數十秭)，百伽那那伽尼多名尼摩羅闍(隋數千秭)，百尼摩羅闍名目陀婆羅(隋數十萬秭)，百目陀婆羅名阿伽目陀(隋數千萬秭)，百阿伽目陀名薩婆婆羅(隋數十壤)，百薩婆婆羅名毘薩闍波帝(隋數千壤)，百毘薩闍波帝名薩婆薩若(隋數十萬壤)，百薩婆薩若名毘浮登伽摩(隋數千萬壤)，百毘浮登伽摩名婆羅極叉(隋數十溝)，入於如是算計之數，其須彌山若欲算知斤兩銖分，悉可得知。",
        "source": "T03n0190_012:0709c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自此已上，復有一算，名陀婆闍伽尼民那，此之已上，復有算計，名奢槃尼，此尼已上，復有算名波羅那陀，此上復有算名伊吒，此上復有算名迦樓沙吒啤多，此上復有算名薩婆尼差波。",
        "translation": "From here on, there's another calculation named Dhavajaganniminya; from here on, there's another calculation named Śapanīya; from here on, there's another calculation named Bronata; from here on, there's another calculation named Iṭa; from here on, there's another calculation named Garuṣaprāpta; and from here on, there's another calculation named Sadvāṇichava.",
        "source": "T03n0190_012:0709c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至於此計恒河沙等，一切算數，總覽盡收。",
        "translation": "This is a summary of all the calculations, such as the calculation of the sands of the Ganges.",
        "source": "T03n0190_012:0709c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此上復有算計數，名阿伽娑婆，此數數於一恒河沙億百千萬恒河沙數，計取悉皆總入於此。",
        "translation": "Above that, there's another calculation called agasthāna, which sums up the number of hundreds of millions of sands of the Ganges and includes them all in its calculation.",
        "source": "T03n0190_012:0709c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而於此上，復更有計，名波羅摩[少/兔]毘婆奢。』",
        "translation": "On top of that, there's another calculation called a parama [less/rabbit] vipaśyanā.'",
        "source": "T03n0190_012:0710a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時頞誰那大計算師語太子言：『如是已知；其入微塵數算之計，更復云何？",
        "translation": "\"The great Abhyudgata master then said to the prince, 'Thus have we known it; how much more does it calculate as entering a tiny particle?'",
        "source": "T03n0190_012:0710a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今亦須知。』",
        "translation": "Now you must also know.'",
        "source": "T03n0190_012:0710a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子答言：『汝等諦聽！",
        "translation": "The prince answered, 'All of you, listen closely!",
        "source": "T03n0190_012:0710a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今說之。",
        "translation": "\"Now, I'll explain it.",
        "source": "T03n0190_012:0710a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡七微塵成一窓塵，合七窓塵成一兔塵，合七兔塵成一羊塵，合七羊塵成一牛塵，合七牛塵成於一蟣，合於七蟣成於一虱，合於七虱成一芥子，合七芥子成一大麥，合七大麥成一指節，累七指節成於半尺，合兩半尺成於一尺，二尺一肘，四肘一弓，五弓一杖，其二十杖名為一息，其八十息名拘盧奢，八拘盧奢名一由旬。",
        "translation": "Where seven tiny dusts form a window-dust, seven dusts of window-dust form a rabbit dust, seven dusts of rabbit dust form a sheep dust, seven dusts of sheep dust form a cow dust, seven dusts of cow dust form a typhus, seven typhus dust form a louse, seven lice form a mustard seed, seven mustard seeds form a barley, seven barley form a knuckle, seven knuckles accumulate to form half a foot, two and a half feet form a foot, two feet form an elbow, four elbows form a bow, five bows form a staff, twenty of those staffs are called a breath, eighty of those breaths are called a krośa, and eight krośas are called a yojana.",
        "source": "T03n0190_012:0710a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此眾中有誰能知，幾許微塵成一由旬(依隋數計得三百八十四里一百三千步)？』",
        "translation": "Who among these people can know how many tiny particles make a yojana (which, according to Sui's calculation, is 384 miles and 1,300 steps)?'",
        "source": "T03n0190_012:0710a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時頞誰那大算計師報太子言：『大德仁者！",
        "translation": "The great mathematician Andhra replied to the prince, 'Sir, you're a great sage!",
        "source": "T03n0190_012:0710a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我尚不知如是之數，我今聞說，猶生迷悶，況復自餘少智少聞愚癡之人？",
        "translation": "I still don't know this kind of number, and I'm still confused when I hear it explained, so why should I be confused by the rest of you who have little knowledge and are ignorant?",
        "source": "T03n0190_012:0710a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖然，唯願太子為我等說，幾許微塵成一由旬？』",
        "translation": "Although, may the prince explain for us, 'How many tiny particles make a yojana?'",
        "source": "T03n0190_012:0710a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛本行集經卷第十二",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Volume XII",
        "source": "T03n0190_012:0710a18_0",
        "is_bad_quality": false
    }
]