[
    {
        "source_sentence": "佛說眾許摩訶帝經卷第十一",
        "translation": "Foshuo zhongshimahatei jing, vol. 11",
        "source": "T03n0191_011:0964a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫試鴻臚少",
        "translation": "Tripiṭaka of the Western Translation of the Sutra of the Buddha, the court administrator who tries to enumerate the minors",
        "source": "T03n0191_011:0964a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卿明教大師臣法賢奉　詔譯",
        "translation": "Translated by imperial order from the Mingjiao dashi ministers, Faxian",
        "source": "T03n0191_011:0964a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊復謂民彌娑囉王曰：「汝觀色是常非常耶？」",
        "translation": "It was then that the Bhagavān again addressed King Mimisara, \"Do you observe that form is permanent and impermanent?\"",
        "source": "T03n0191_011:0964a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：「非常。」",
        "translation": "The king said, \"It's not.\"",
        "source": "T03n0191_011:0964a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「是苦非苦耶？」",
        "translation": "The Buddha said, \"Is it painful and not painful?\"",
        "source": "T03n0191_011:0964a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「是苦。」",
        "translation": "He said, \"It's painful.\"",
        "source": "T03n0191_011:0964a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊又言：「受、想、行、識是常非常耶？」",
        "translation": "The Bhagavān then said, \"Are feeling, perception, volition, and consciousness permanent and impermanent?\"",
        "source": "T03n0191_011:0964a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「非常。」",
        "translation": "They said, \"It's not.\"",
        "source": "T03n0191_011:0964a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰：「是苦非苦耶？」",
        "translation": "Again, he said, \"Is it painful and not painful?\"",
        "source": "T03n0191_011:0964a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「是苦。」",
        "translation": "He said, \"It's painful.\"",
        "source": "T03n0191_011:0964a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「色、受、想、行、識悉是非常，是苦，是顛倒法，一切無我。」",
        "translation": "The Buddha said, \"Form, feeling, perception, volition, and consciousness are all impermanent, painful, mistaken, and all lack self.\"",
        "source": "T03n0191_011:0964a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛又告言：「大王！",
        "translation": "The Buddha also told them, \"Great king!",
        "source": "T03n0191_011:0964b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當以正智正慧觀其真實，彼色、受、想、行、識有過去、現在、未來耶？",
        "translation": "\"Should you observe with right knowledge and right wisdom what is true, whether form, feeling, perception, volition, or consciousness existed in the past, present, or future?",
        "source": "T03n0191_011:0964b01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有內外、麁細、貴賤、遠近耶？」",
        "translation": "Are there internal and external, crude and fine, noble and base, and near and far?\"",
        "source": "T03n0191_011:0964b02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「色、受、想、行、識非過去、現在、未來。",
        "translation": "They say, \"Form, feeling, perception, volition, and consciousness are not past, present, or future.",
        "source": "T03n0191_011:0964b03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦非內外、麁細、貴賤、遠近等。」",
        "translation": "Nor are they internal or external, crude or subtle, noble or base, or distant or near.\"",
        "source": "T03n0191_011:0964b04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉，大王！",
        "translation": "The Buddha said, \"Good, Great King!",
        "source": "T03n0191_011:0964b04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能於此五蘊如實了知，是非常、苦、空、無我之法，復以正智觀其真實，知非過去、現在及以未來，乃至內外、麁細、貴賤、遠近等，又能不著不捨者，斯真解脫。",
        "translation": "If someone can truly know these five aggregates as impermanent, painful, empty, and without self, and then observe their reality with right knowledge, knowing that they aren't past, present, or future, and that they are internal and external, crude and fine, noble and base, and distant and near, and they can neither attach nor disregard them, then they are truly liberated.",
        "source": "T03n0191_011:0964b05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T03n0191_011:0964b08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得斯解脫者，是智解脫，梵行已立，所作已辦，我生已盡，永不復趣輪迴之道。」",
        "translation": "Attaining this liberation is the liberation of knowledge, having established the religious practice, having accomplished what was to be done, and having ended my births, I'll never again enter the path of transmigration.\"",
        "source": "T03n0191_011:0964b08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊說是法時，民彌娑囉王及八萬天人，遠離塵垢得法眼淨，及有婆羅門、長者、士庶等百千人眾，亦離塵垢得法眼淨。",
        "translation": "When the Bhagavān explained this teaching, King Mimisara and 80,000 gods and humans became free of the pollution and attained purification of the Dharma eye, and so did a hundred thousand other people, including brāhmaṇas, elders, and commoners, who became free of the pollution and attained purification of the Dharma eye.",
        "source": "T03n0191_011:0964b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是民彌娑囉王得法知見已，於法堅固斷其貪愛，除去疑惑正信不退，即從座起偏袒右肩，合掌向佛白言：「世尊！",
        "translation": "After he attained knowledge and vision of the Dharma, King Pūrṇa Maitrāyaniputra resolutely stopped his craving for the Dharma, removed his doubts and delusions, and rightly believed and didn't retreat.",
        "source": "T03n0191_011:0964b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我心柔順，歸依佛、法及以僧伽，持近事戒永不殺生。",
        "translation": "I'm gentle and docile, I rely on the Buddha, Dharma, and Saṃgha, and I observe the precepts of proximity to service and never kill anyone.",
        "source": "T03n0191_011:0964b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今請世尊常住我國，願盡形壽奉上衣服、飲食、臥具、湯藥常無乏少，乃至聖眾盡生供養。」",
        "translation": "Now, I'd like to ask the Bhagavān to stay in my country for as long as I live and vow to present me with clothing, food, bedding, and medicine that will never be lacking and that the noble ones will always make offerings.\"",
        "source": "T03n0191_011:0964b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即默然。",
        "translation": "The Buddha then remained silent.",
        "source": "T03n0191_011:0964b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王見佛默然受請，歡喜踊躍不能自勝，即以頭面禮佛雙足，旋繞畢已辭別而退。",
        "translation": "When the king saw that the Buddha had quietly accepted the invitation, he rejoiced and jumped up and down, unable to contain himself.",
        "source": "T03n0191_011:0964b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸苾芻眾，見民彌娑囉王蒙佛世尊為說妙法，不起於座，遠塵離垢得法眼淨，心皆生疑：「此王云何遇佛世尊，便得聞法，證法眼淨除去塵垢？」",
        "translation": "It was then that the crowd of monks and nuns who saw that King Pimmisara had been taught the wonderful Dharma by the Bhagavān, had gotten up from his seat, had become dustless and spotless, and had attained purification of the Dharma eye, all of them wondered, \"How did this king meet the Bhagavān and then hear the Dharma and realize that the Dharma eye was purified and cleansed of dust?\"",
        "source": "T03n0191_011:0964b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，佛即玄知，告而言曰：「諸苾芻！",
        "translation": "After this thought, the Buddha knew it well and told them, \"Bhikṣu!",
        "source": "T03n0191_011:0964b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此民彌娑囉王乃於過去作大善業，所作決定果報無差，今為人王具大福德，乃宿世因感果如是。",
        "translation": "This King Mimisara did great good deeds in the past, and the results of those deeds were determined without distinction.",
        "source": "T03n0191_011:0964b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻！",
        "translation": "Bhikṣus!",
        "source": "T03n0191_011:0964b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地、水、火、風外界熟時，蘊、界、六根一切好醜，隨其所作善惡之業，悉皆獲得果報不虛。」",
        "translation": "When the external forces of earth, water, fire, and wind ripen, the aggregates, elements, and the six faculties are all good and ugly, and the results of the good and bad actions they perform are all obtained without fail.\"",
        "source": "T03n0191_011:0964b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，即說偈言：「眾生之所作，　　善惡經百劫；　因業不可壞，　　果報終自得。",
        "translation": "It was then that the Bhagavān spoke this verse, \"The actions of sentient beings, good and bad, last a hundred eons; their causes and actions are indestructible, and the results are eventually obtained on their own.",
        "source": "T03n0191_011:0964c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸苾芻！",
        "translation": "\"Bhikṣus!",
        "source": "T03n0191_011:0964c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去世時有佛出世，名阿囉曩毘，十號具足為人天師。",
        "translation": "Once upon a time in the distant past, a Buddha appeared in the world named Ārāḍa-nābhijña, complete with the ten epithets, and he became a teacher of humans and gods.",
        "source": "T03n0191_011:0964c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時佛世尊為諸眾生說種種法，化利畢已即入涅盤。",
        "translation": "The Bhagavān explained various teachings to sentient beings, and after reaping the benefits of those teachings, he then entered nirvāṇa.",
        "source": "T03n0191_011:0964c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸弟子收其舍利，擇清淨地建立妙塔，復以種種香花而恒供養。",
        "translation": "His disciples collected the relics, chose a pure place to build a marvelous stūpa, and made constant offerings with various kinds of flowers and incense.",
        "source": "T03n0191_011:0964c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過是已後久歷年歲，有轉輪王出於世間，名羯里計，時有兵眾十八俱胝，常領是眾飛空巡幸，復有七寶常為先導。",
        "translation": "After a long time had passed, a wheel-turning king named Kārttika emerged from the world with a retinue of eighteen corpses who always led them on a tour of the sky and had seven treasures as their constant guides.",
        "source": "T03n0191_011:0964c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後於一日經過塔上，有虛空神捉其輪寶住空不進。",
        "translation": "One day, he passed by a stūpa and was seized by a god of space who held his wheel-turning jewel in the air and didn't allow it to advance.",
        "source": "T03n0191_011:0964c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時羯里計王思惟是事：『今我方行輪寶自住，恐是福盡感應斯現。』",
        "translation": "King Kārttika then thought about this, 'Now that we're walking around with the wheel-treasure standing on its own, I'm afraid this is the end of our merits and the result of our experience.'",
        "source": "T03n0191_011:0964c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼虛空神乃告之曰：『大王！",
        "translation": "The space deity then told him, 'Great king!",
        "source": "T03n0191_011:0964c13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝非福盡，下有阿羅曩毘佛舍利塔，端指輪寶不得直進。』",
        "translation": "'You are not the end of good fortune; down there is the stūpa of the Buddha's relics, and the fingertip-wheel treasure at the end of it cannot be directly entered.'",
        "source": "T03n0191_011:0964c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時羯里計王與十八俱胝飛空兵眾，同時降下詣於塔所，王及眷屬各以妙衣共拭佛塔，得清淨已，散諸妙花及焚寶香，又作種種音樂而為供養，以頭面禮發其誓願：『以我今日師事於佛所設供養種種功德，果報不虛當來獲得。』",
        "translation": "The king and his retinue each cleaned the stūpa with a nice robe, scattered flowers, burned precious incense, made various kinds of music, made offerings, and saluted him with their heads and faces, vowing, 'Because of the various merits of the offerings I've made to the Buddha today as my teacher, the rewards will not be in vain.'",
        "source": "T03n0191_011:0964c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸苾芻！",
        "translation": "\"You monks!",
        "source": "T03n0191_011:0964c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T03n0191_011:0964c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼羯里計轉輪聖王并諸眷屬者，即民彌娑囉王及眷屬等是。",
        "translation": "\"That's the Kālī-kage wheel-turning sage king and his retinue, namely, King Mimisara and his retinue.",
        "source": "T03n0191_011:0964c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻！",
        "translation": "Bhikṣus!",
        "source": "T03n0191_011:0964c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以彼供養阿囉曩毘正覺之塔種種功德，當感無數百千俱胝劫受天上人間最上快樂，以本願力今值於我復作供養，所獲功德乃與阿囉曩毘正等正覺平等無異。",
        "translation": "Because of the various merits of making offerings to the stūpa of Ārāḍa-nābhijña, they will experience the highest happiness among gods and humans for measureless hundreds of thousands of kalpas, and now that they've met me and made offerings, the merits they'll attain will be the same as those of Ārāḍa-nābhijña and the correct enlightenment.",
        "source": "T03n0191_011:0964c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻！",
        "translation": "\"Gentlemen!",
        "source": "T03n0191_011:0964c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生作黑業者黑業相續，作白業者白業不斷，或作雜業亦復如是。",
        "translation": "It's the same for all sentient beings who do black karma and continue black karma, or who do white karma and don't stop white karma, or who do a variety of karma.",
        "source": "T03n0191_011:0964c26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻！",
        "translation": "Bhikṣus!",
        "source": "T03n0191_011:0964c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所獲果報悉從因業，汝等當知，廣為人說。」",
        "translation": "The rewards you obtain are all based on causal actions, so you should know and explain them widely to others.\"",
        "source": "T03n0191_011:0964c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時會中諸苾芻眾，以民彌娑囉王見佛聞法遠塵離垢，又聞說彼往昔之事，乃於烏嚕尾螺而起疑心：「云何世尊為現神通，種種教化方得迴心，彼曩提誐耶隨言受化，佛大慈悲具一切智，必能斷除我等疑惑。」",
        "translation": "At the time, a group of monks and nuns who had seen the Buddha and heard him teach the Dharma, were far removed from the dust and defilement, and had heard about his past lives, then wondered, \"How did the Bhagavān show his supernormal powers, teach in various ways before he could change his mind, accept the transformation of Nadī-Kāya according to his words, and surely the Buddha, who has great compassion and possesses all wisdom, will be able to remove our doubts and confusions?\"",
        "source": "T03n0191_011:0964c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，將欲發問。",
        "translation": "After this thought, he was about to ask a question.",
        "source": "T03n0191_011:0965a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即告言：「修因感果定不虛爾。",
        "translation": "The Buddha then told them, \"It's certainly not false that cultivating causes brings about results.",
        "source": "T03n0191_011:0965a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻！",
        "translation": "Precious monks!",
        "source": "T03n0191_011:0965a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去劫中人壽二萬歲時，有佛出世，名曰迦葉如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，彼佛亦在波羅奈國鹿野苑中作大佛事，化利畢已即入涅盤。",
        "translation": "In a past eon when his life was 20,000 years old, a Buddha appeared in the world named Kāśyapa Tathāgata, Worthy of Offerings, Perfectly Omniscient, Perfect in Conduct, Well Gone, Understander of the World, Unsurpassed Person, Trainer, Teacher of Gods and People, Buddha, and World Honored One, who also performed great Buddha-work in the Deer Preserve of Vārāṇasī and entered nirvāṇa after reaping the benefits of his transformation.",
        "source": "T03n0191_011:0965a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時世有王名羯里計，常於彼佛恭敬供養。",
        "translation": "At the time, there was a king named Kārttika who always venerated and made offerings to that Buddha.",
        "source": "T03n0191_011:0965a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛既入滅，王以種種香木荼毘世尊，復以乳汁灑滅餘火，即收舍利貯四寶瓶，又選勝地起大寶塔。",
        "translation": "After the Buddha had entered nirvāṇa, the king consecrated the Bhagavān with various kinds of fragrant wood, extinguished the remaining fire with milk, collected the relics, stored them in four precious vases, and chose a site of excellence to build a large jeweled stūpa.",
        "source": "T03n0191_011:0965a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其塔高聳量一由旬，王及人民常作供養。",
        "translation": "The tower was a towering leap of a yojana in height, and the king and his people made offerings to it.",
        "source": "T03n0191_011:0965a13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼國中有一長者，家中巨富等毘沙門天，眷屬眾多自在快樂，先與別族長者而為朋友，常於佛塔廣興供養。",
        "translation": "An elder from that country, whose family was as wealthy as the Vaiśravaṇa gods and who had a large retinue, first became friends with a man from another clan and often made offerings at the stūpa.",
        "source": "T03n0191_011:0965a14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後娶其門以為姻戚，歲月緜久乃生三子。",
        "translation": "He then married a member of his clan and became his in-laws. After a long period of time with a large family, three sons were born to him.",
        "source": "T03n0191_011:0965a17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於後長者年耄有疾，服藥不差漸漸羸困，乃趣無常，三子以禮葬於尸林。",
        "translation": "When the elder became ill in his old age and gradually fell into weakness despite taking medicine, he went into a state of impermanence, and his three sons were buried in the cemetery with respect.",
        "source": "T03n0191_011:0965a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時三子思憶訓誨旦暮啼泣，又念家富共議追福。",
        "translation": "The three sons then remembered the instructions, wept night and day, and remembered their family's wealth as they discussed the merits of the future.",
        "source": "T03n0191_011:0965a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長兄慳恡先未知善，忽聞欲施初即遲疑，以孝存心尋便允可。",
        "translation": "The eldest brother, who was stingy and did not know about goodness, was hesitant at first to give alms when he heard about it, but he looked for permission out of filial piety.",
        "source": "T03n0191_011:0965a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長兄言曰：『布施之外分充受用。』",
        "translation": "The eldest brother said, 'Outside of generosity, I'll share it with you for your own enjoyment.'",
        "source": "T03n0191_011:0965a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二弟應諾，即持金銀種種財物，詣於塔所作最上供養。",
        "translation": "They promised, and they took a variety of gold and silver valuables to the stūpa to make the highest offerings.",
        "source": "T03n0191_011:0965a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是施已同發誓言：『願以善根所生果報，於當來世以今正等正覺迦葉之稱為其姓氏，佛出世間亦得值遇，聞法信解證於菩提。』",
        "translation": "After thus making these offerings, they both vowed, 'May the result of good roots be that in some future life the family name of Kāśyapa, which is now the name of the perfectly enlightened one, will be encountered by buddhas as they appear in the world, and that they will hear the teaching, believe in it, and realize enlightenment.'",
        "source": "T03n0191_011:0965a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發誓願已，禮拜旋繞歡喜而歸。",
        "translation": "After making this vow, they paid homage, circled around, rejoiced, and returned.",
        "source": "T03n0191_011:0965a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故迦葉今得此姓，值遇於我而為沙門，復聞正法證無學果。",
        "translation": "Now, therefore, Kāśyapa has attained this family name, met me, become an ascetic, and heard the right teaching again to realize the fruit of post-learners.",
        "source": "T03n0191_011:0965a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻！",
        "translation": "Bhikṣus!",
        "source": "T03n0191_011:0965a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "烏嚕尾螺初難化者，以彼宿世欲檀施時心有遲疑，是故我現種種神變方得省悟；曩提誐耶而易化者，亦由往昔檀施之時，心本清淨始終無異。",
        "translation": "The first reason it's so difficult to teach Uluvilvā is that in a prior life when he wanted to give alms, his mind was hesitant, and so I showed various miracles before he realized it; the reason it was so easy to teach Nadī-Kāya is that when he gave alms in the past, his mind was originally pure, and there was no difference between beginning and end.",
        "source": "T03n0191_011:0965a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻！",
        "translation": "\"Monks!",
        "source": "T03n0191_011:0965b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故烏嚕尾螺及曩提誐耶，復為兄弟得迦葉姓，又值於我聞法證道，此往昔事汝等諦信。」",
        "translation": "Therefore, Urūḍḍa and Nadīgaya were brothers again who attained the surname Kāśyapa and who heard the teaching and realized the way from me, so you must truly believe these past events.\"",
        "source": "T03n0191_011:0965b03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊說是迦葉往昔事已，離杖林塔，於王舍城不遠就一樹下，與千苾芻眾圍繞而住。",
        "translation": "After recounting these past events of Kāśyapa, the Bhagavān left the staff-wood pagoda and went to live under a tree not far from Rājagṛha with a crowd of a thousand monks surrounding him.",
        "source": "T03n0191_011:0965b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時民彌娑囉王以佛近住，欲立精舍安佛及僧而久住止。",
        "translation": "Because the Buddha was near, King Mimisara wanted to build a monastery where he could house the Buddha and his saṃgha for a long time.",
        "source": "T03n0191_011:0965b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "民彌娑囉王為太子時，常出城外而為遊戲，去城至近有一園苑，林樹蓊欝泉池清淨，雖復四序花竹恒茂；太子愛樂而欲求買，園主長者自恃耆耄兼亦家富，太子逼取終不允從，出言悖慢聞於太子：「我寧離此國，不捨此園。」",
        "translation": "When he was crown prince, King Pūrṇa Mimisara used to go out of the city to play. Nearby was a park with a luxuriant forest, a spring and a clear pond, and flowers and bamboos that grew in four sequences; the crown prince liked it and wanted to buy it, but the man who owned it was elderly and wealthy.",
        "source": "T03n0191_011:0965b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子聞已謂左右曰：「今此耆耄言甚不遜，我若紹位無得忘也。」",
        "translation": "After hearing this, the prince told his entourage, \"Now, this elderly man's words are so disrespectful that I wouldn't be able to forget them if I were to promote my position.\"",
        "source": "T03n0191_011:0965b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於後父王摩賀鉢納摩崩已，即灌頂傳寶號。",
        "translation": "After his father, King Mahāprajñāpāramā, collapsed, he consecrated him and transmitted his precious name.",
        "source": "T03n0191_011:0965b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "民彌娑囉王既紹其位，乃憶前事，下令所司發使奪取。",
        "translation": "After he had assumed his position, King Mimisara remembered the past and ordered his ministers to send messengers to seize it.",
        "source": "T03n0191_011:0965b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼長者速得心病，便趣無常。",
        "translation": "The elder then quickly became mentally ill and went into a state of impermanence.",
        "source": "T03n0191_011:0965b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命終之後，以其憤怨積聚毒惡，乃於園內生蛇趣中，含毒伺隙欲酬前恨。",
        "translation": "After his life ended, his anger and resentment built up such a venomous streak that he was born in a snake's quarters in the garden, and he watched for a chance to pay back his grudge with poison.",
        "source": "T03n0191_011:0965b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後於一日王因春節，將諸嬪婇遊幸彼園，盡極歡娛以肆其意。",
        "translation": "One day later, during the spring festival, the king sent his ladies to visit the park and entertained them as much as he could.",
        "source": "T03n0191_011:0965b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王方疲困寢息園中，時彼毒蛇謂其得便，疾出窟穴欲來蠚王。",
        "translation": "The king was tired and sleeping in the garden when that viper, sensing that it had gotten an advantage, quickly emerged from its cave and wanted to sting the king.",
        "source": "T03n0191_011:0965b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸嬪嬙散行遊冶；王有親近內侍一人，執劍侍衛防其不虞，時有飛禽名迦蘭那迦，飲啄翱翔常在園內，忽見蛇出相呼鳴噪，執劍內侍見蛇出已即斷其命。",
        "translation": "The king then had a servant close to him who wielded a sword and guarded him against misfortune.",
        "source": "T03n0191_011:0965b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "禽眾極噪，王亦驚寤，問執劍者：「緣何喧擾？」",
        "translation": "The crowd of birds was so noisy that the king was startled and awakened, and he asked the man with the sword, \"What's the reason for the commotion?\"",
        "source": "T03n0191_011:0965b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "執劍者曰：「適有毒蛇欲來蠚王，迦蘭那迦相呼驚噪，我既目見，已斷蛇命。」",
        "translation": "The man with the sword said, \"A viper was about to come and sting the king, and the Kālānaka called out to it and shouted, \"I've seen it and cut off its life.\"",
        "source": "T03n0191_011:0965b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞是語心驚毛豎，令詔太子及諸大臣共議斯事：「古剎帝利灌頂大王，或於身命欲致危害，有能忠力濟其難者，當何賞賜？」",
        "translation": "Alarmed at what he heard, the king ordered the crown prince and his ministers to discuss the matter, \"What reward would be given to an ancient king consecrated by Zārtli who wanted to harm his life and could faithfully work to help him in trouble?\"",
        "source": "T03n0191_011:0965b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大臣對曰：「能於身命脫其難者，可分半國以賞其功。」",
        "translation": "The minister said to him, \"If he can escape from this difficulty with his life, he can divide half the kingdom for his merits.\"",
        "source": "T03n0191_011:0965c03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王乃允從，分其半國與迦蘭那迦用賞其功。",
        "translation": "The king then complied and gave half of the country to Kalanaka to reward its merits.",
        "source": "T03n0191_011:0965c04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大臣對曰：「彼迦蘭那迦飛禽之類，與國境土當何所用？」",
        "translation": "The minister answered, \"What use will that flying bird of Kalanaka's species have with the country's territory?\"",
        "source": "T03n0191_011:0965c05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王謂大臣：「此事如何？」",
        "translation": "The king asked the minister, \"What about this?\"",
        "source": "T03n0191_011:0965c06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大臣對曰：「可就窠巢多植竹木使其遂性，勿令傷害。",
        "translation": "The minister said, \"We can plant more bamboo and wood in the nests to help them develop their natures and prevent them from getting hurt.",
        "source": "T03n0191_011:0965c07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如斯可矣，餘不能為。」",
        "translation": "That's enough; the rest can't be done.\"",
        "source": "T03n0191_011:0965c08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞曰：「善！」",
        "translation": "The king heard this and said, \"Good!\"",
        "source": "T03n0191_011:0965c08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂從其奏，乃於園外別擇一處，廣種竹樹安迦蘭那迦，令人守之不得傷害。",
        "translation": "He complied with his request and chose a special place outside the garden where he planted a bamboo tree and placed it in a karanaka so that it could be guarded and not harmed.",
        "source": "T03n0191_011:0965c09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王有親舅，本事仙道，常求淨處進其修習，王以迦蘭那迦竹林無諸雜穢權令安處。",
        "translation": "The king had a brother-in-law who was skilled in the immortal path and always sought a pure place to further his training, so he authorized the Kalanaka bamboo grove to be a peaceful place, free of all defilements.",
        "source": "T03n0191_011:0965c10_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及見世尊將諸苾芻近城樹下露地宴息，思欲捨彼造立精舍。",
        "translation": "When he saw the Bhagavān bringing the monks near the city to rest in the open ground under a tree, he thought about leaving them and building a monastery.",
        "source": "T03n0191_011:0965c12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王乃嚴駕自詣佛所，禮雙足已却住一面。",
        "translation": "The king then drove himself to the Buddha in full regalia, saluted his feet, and withdrew to one side.",
        "source": "T03n0191_011:0965c14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊為王說法，以種種方便化令歡喜，復勸精進，當求最上寂靜快樂。",
        "translation": "The Bhagavān then taught the king the Dharma, using various methods to make him rejoice and to encourage him to work hard to attain the highest tranquility and happiness.",
        "source": "T03n0191_011:0965c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王聞法歡喜頂受，即起於座偏袒右肩，合掌頂禮白言：「世尊！",
        "translation": "The king then rejoiced when he heard the teaching, rose from his seat, bared his right shoulder, put his palms together, saluted, and said, \"Bhagavān!",
        "source": "T03n0191_011:0965c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今請佛及諸聖眾，於我宮內來晨受食，唯願慈悲哀愍聽許。」",
        "translation": "Now, I would like to invite the Buddha and the other sages to come to my palace to receive the morning meal, and I beg you to have the compassion and sympathy to allow it.\"",
        "source": "T03n0191_011:0965c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即默然。",
        "translation": "The Buddha then remained silent.",
        "source": "T03n0191_011:0965c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大王見佛默然，知已受請，歡喜踊躍禮拜而歸。",
        "translation": "Seeing the Buddha's silence, the king knew that he had accepted the invitation, rejoiced, jumped up, paid homage, and returned.",
        "source": "T03n0191_011:0965c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃下所司，即於是夜疾速備辦種種飲食及與香花，皆令倍常美妙清淨，復勅宮城內外乃至四衢道巷之中悉使嚴潔。",
        "translation": "He then ordered his ministers to quickly prepare a variety of foods and flowers that night, making them twice as beautiful and pure as usual, and he also ordered the palace to be kept clean, both inside and outside, as well as in the four lanes and roads.",
        "source": "T03n0191_011:0965c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "纔至明旦，即遣使人白於世尊：「飯食已辦，請佛降臨。」",
        "translation": "Just before sunrise, he sent an envoy to tell the Bhagavān, \"The food and drink have been prepared, and I'd like to invite the Buddha to come.\"",
        "source": "T03n0191_011:0965c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊與千阿羅漢著衣持鉢，前後圍繞行詣王宮。",
        "translation": "The Bhagavān then marched into the king's palace with a thousand arhats wearing robes and carrying bowls, surrounded by them from front to back.",
        "source": "T03n0191_011:0965c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王於門首執爐焚香待世尊至，佛既到已迎入就座，諸聖眾等亦各就坐，王與眷屬瞻禮畢已奉上飲食，焚香散花歡喜供養。",
        "translation": "After the Buddha arrived, he was welcomed into his seat and the sages took their seats. After the king and his retinue paid their respects, they served food and drink, burned incense, scattered flowers, and made joyful offerings.",
        "source": "T03n0191_011:0965c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛與聖眾食畢澡手，王及眷屬樂欲聽法，佛為說法，各各諦聽歡喜信受。",
        "translation": "After the Buddha and the noble congregation had finished eating, they washed their hands. The king and his retinue were eager to hear the teaching, and the Buddha delivered it for them, so each listened intently, rejoiced, and believed it.",
        "source": "T03n0191_011:0966a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王復離座合掌白佛：「我今欲以迦蘭那迦竹林作佛精舍，願佛納受。」",
        "translation": "The king then left his seat and put his palms together and said to the Buddha, \"Now, I'd like to use the Kalanaka Bamboo Grove as a place for the Buddha's quarters, and I hope the Buddha will accept it.\"",
        "source": "T03n0191_011:0966a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊默然。",
        "translation": "The Bhagavān was silent.",
        "source": "T03n0191_011:0966a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王知佛許，即取金瓶灌於佛手。",
        "translation": "Knowing that the Buddha had given his approval, the king took a gold vial and filled it in the Buddha's hand.",
        "source": "T03n0191_011:0966a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奉施畢已，願佛隨意，即為世尊廣作嚴飾，佛與聖眾隨意而住。",
        "translation": "After offering it, he wished that the Buddha would do as he pleased, so he decorated it extensively for the Bhagavān, and the Buddha and the noble people stayed there as they wished.",
        "source": "T03n0191_011:0966a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦蘭那迦竹林精舍因茲所立。",
        "translation": "The Kalanaka Bamboo Grove monastery was thus established.",
        "source": "T03n0191_011:0966a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊後於一時為利樂故，與諸聖眾離迦蘭那迦竹林精舍，往寒林中經行宴坐。",
        "translation": "At some point later, for the benefit of the world, the Bhagavān and the noble people left the Kalanaka Bamboo Grove monastery and went to sit in the cold forest while walking and relaxing.",
        "source": "T03n0191_011:0966a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王舍城有一長者，請佛及眾來晨供養，乃於是夜與諸眷屬及僮僕侍人，共辦飲食香花等事。",
        "translation": "An elderly man in Rājagṛha invited the Buddha and his entourage to make offerings to him in the morning, and that night he gathered his retinue and attendants to serve food, drink, scents, and flowers.",
        "source": "T03n0191_011:0966a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時給孤長者因有事故，到王舍城經過彼家，遇夜止宿，見其長者家中老幼皆不寢寐，辦造飲食珍饌之類。",
        "translation": "An elderly man named Gṛdhrakūṭa had an occasion and was passing by his house in Rājagṛha. When he stopped for the night, he saw the elderly man's family, both young and old, up and about, preparing food and drink, as well as other delicacies.",
        "source": "T03n0191_011:0966a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "怪而問曰：「長者之家老幼不寐辦造飲食，當何所用？",
        "translation": "He was surprised and asked, \"What use is there for making food and drink in an elder's house when the elderly and young aren't sleeping?",
        "source": "T03n0191_011:0966a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為請王耶？",
        "translation": "Is it to invite the king?",
        "source": "T03n0191_011:0966a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為請大臣？",
        "translation": "Why do you invite ministers?",
        "source": "T03n0191_011:0966a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫為姻親而有聚會？」",
        "translation": "Is there a gathering for the sake of in-laws?\"",
        "source": "T03n0191_011:0966a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者報言：「我不請王及大臣等，亦無姻親聚會之事。",
        "translation": "The elder reported, \"I don't invite the king and his ministers, and there's no marriage gathering.",
        "source": "T03n0191_011:0966a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今為有佛出於世間，將一千聖眾遊化此國，王及眷屬大臣士庶，悉皆歸向次第供養。",
        "translation": "Now, when a Buddha comes into the world and brings a thousand holy people to visit this country, the king and his retinue, ministers, and common people all turn to him and make offerings in order.",
        "source": "T03n0191_011:0966a17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我為彼佛及與聖眾來晨設齋，是不寢寐。」",
        "translation": "I've set up a morning service for that Buddha and his noble people, so I won't go to sleep.\"",
        "source": "T03n0191_011:0966a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "給孤長者聞此語已，歎異非常，又復問言：「云何名佛？」",
        "translation": "After hearing this, Gṛdhrakūṭa marveled and asked, \"What do you call a Buddha?\"",
        "source": "T03n0191_011:0966a20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「彼釋族中有王淨飯，生一童子，號悉達多，具輪王相，棄捨出家苦行修習，證得阿耨多羅三藐三菩提，斯即佛也。」",
        "translation": "He said, \"Among the Śākyas was a king who purified his rice and gave birth to a child named Siddhârtha who had the characteristics of a wheel-turning king, abandoned his family, practiced asceticism, and realized unsurpassed, correct, and complete enlightenment, which is the Buddha.\"",
        "source": "T03n0191_011:0966a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復問言：「云何聖眾？」",
        "translation": "Again, he asked, \"What is the noble multitude?\"",
        "source": "T03n0191_011:0966a24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「有剎利族或婆羅門族，乃至毘舍輸陀，如是之族善男子輩投佛出家，剃除鬚髮被袈裟衣，正信修行聞法悟解，悉皆證得阿羅漢道。",
        "translation": "They replied, \"There are the warrior tribe, the brāhmaṇa tribe, and even Vaiśravaṇa, a group of good men who leave home with the Buddha, shave off their hair, are clothed in the reddish-brown robes, correctly believe and cultivate their practice, hear the teaching, and understand it, and all realize the path of the arhat.",
        "source": "T03n0191_011:0966a25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是隨佛一千聖眾，我所供養正為此也。」",
        "translation": "These are the 1,000 holy people who follow the Buddha, and it's for this that I make offerings.\"",
        "source": "T03n0191_011:0966a28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "給孤長者聞是說已，身毛皆豎歡喜踊躍，又復問言：「如我云何得見彼佛及與聖眾？」",
        "translation": "After hearing this, Gṛdhrakūṭa's hair stood on end, rejoiced, and jumped up and down, and then asked, \"How did I get to see that Buddha and his noble congregation?\"",
        "source": "T03n0191_011:0966a29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「明旦咸來我舍受食。」",
        "translation": "He said, \"Tomorrow morning, everyone will come to our house to receive food.\"",
        "source": "T03n0191_011:0966b02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "給孤長者雖聞是語，有若心狂，不待天曉欲往佛所。",
        "translation": "Although he heard those words, Gṛdhrakūṭa went crazy with desire and didn't wait until dawn to go to the Buddha's residence.",
        "source": "T03n0191_011:0966b02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時方半夜值月明朗，即便出門行詣寒林，未至中途月忽雲蔽，又至一門不敢前進，給孤長者以天陰黑，便生怕怖佇立思量：「得無非人之類而來惱我耶？」",
        "translation": "It was midnight when the moon was shining brightly, so he left his house and went into the cold forest. Before he reached the midway point, the moon suddenly covered him with clouds, and he reached another gate and didn't dare to go forward.",
        "source": "T03n0191_011:0966b03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心欲退還足不前進。",
        "translation": "Their minds want to retreat, but they're not moving forward.",
        "source": "T03n0191_011:0966b07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有天人發聲告曰：「長者但去勿得退心，唯有吉祥定無惱亂。",
        "translation": "Then a celestial arouses a voice and tells him, \"Sir, just go away and don't retreat from your mind; only have an auspicious concentration and no disturbances.",
        "source": "T03n0191_011:0966b07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T03n0191_011:0966b09_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如百車百馬種種裝嚴，可令眾生見者愛樂，以斯布施，不如向佛前進一步，十六分之一分功德。」",
        "translation": "Like the hundreds of carts and horses that are decorated in various ways to make sentient beings happy when they see them, such an offering isn't as meritorious as taking one step forward toward the Buddha, which is one-sixteenth of a percent.\"",
        "source": "T03n0191_011:0966b09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復告言：「長者但去勿得退心，唯有吉祥無惱亂事。",
        "translation": "Again, he told them, \"Sir, just go away and don't give up your mind; it's only auspicious and not disruptive.",
        "source": "T03n0191_011:0966b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T03n0191_011:0966b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如一百金象眾寶裝嚴，以斯布施，不如向佛前進一步，十六分之一分功德。",
        "translation": "It's like a hundred gold elephants adorned with many treasures; such an offering isn't as meritorious as taking one step forward toward the Buddha, which is one-sixteenth of a cent.",
        "source": "T03n0191_011:0966b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者！",
        "translation": "Sir!",
        "source": "T03n0191_011:0966b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至百童女以真珠、瓔珞眾寶嚴身，以斯布施，亦復不及向佛一步，十六分之一分功德。」",
        "translation": "Even a hundred maidens adorned with real beads and jewelry would not receive as much merit as the sixteenth part of a step toward the Buddha with such an offering.\"",
        "source": "T03n0191_011:0966b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼天人即發身光照耀途路，自彼門所直至寒林，如月盛明等無有異。",
        "translation": "The celestial then emitted a body light that shone brightly on the road from his gate to the cold forest, like the moon shining brightly and without distinction.",
        "source": "T03n0191_011:0966b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "給孤長者乃問天曰：「是何聖賢能作斯事？」",
        "translation": "Then Gṛdhrakūṭa asked the gods, \"What noble man could have done this?\"",
        "source": "T03n0191_011:0966b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天人告曰：「我昔曾為舍利子母，名捺誐囉也。",
        "translation": "The celestials told him, \"Once, I was the mother of Śāriputra, who was called Nāgara.",
        "source": "T03n0191_011:0966b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命終之後生四天王界，今名摩度娑健馱摩拏嚩迦，見守此門。",
        "translation": "After my life ended, I was born in the realm of the four heavenly kings, and now I'm called Madhusakandhammaravaka, who sees and guards this gate.",
        "source": "T03n0191_011:0966b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願勿疑慮，長者可去必獲吉祥。」",
        "translation": "Please don't doubt it, for you, sir, can leave and you'll surely receive good fortune.\"",
        "source": "T03n0191_011:0966b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "給孤長者聞是語已讚言：「善哉！",
        "translation": "After hearing these words, Gṛdhrakūṭa praised him, saying, \"Good!",
        "source": "T03n0191_011:0966b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "稀有斯事，我今定去見佛無疑。」",
        "translation": "Such a rare thing, I'll surely go see the Buddha now without doubt.\"",
        "source": "T03n0191_011:0966b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "給孤長者又復思惟：「若無正覺出於世間，無由得聞最上妙法。」",
        "translation": "Gṛdhrakūṭa then again considered, \"If there were no right awakening present in the world, there would be no way to hear the most excellent teaching.\"",
        "source": "T03n0191_011:0966b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是長者得其光明無所障礙，直至寒林世尊住處。",
        "translation": "The elder then attained unobstructed radiance and went to the Bhagavān's abode in the Cold Forest.",
        "source": "T03n0191_011:0966b25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊在寒林外經行，時長者見佛威德相好異於常人，即便合掌而發問言：「是世尊否？」",
        "translation": "When the Bhagavān was walking outside the Cold Forest, the elder saw the Buddha's imposing features and appearance that were different from those of ordinary people, so he put his palms together and asked, \"Is this the Bhagavān?\"",
        "source": "T03n0191_011:0966b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛答言：「是。」",
        "translation": "The Buddha answered, \"Yes.\"",
        "source": "T03n0191_011:0966c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者身心歡喜無量。",
        "translation": "The elder's physical and mental joy was immeasurable.",
        "source": "T03n0191_011:0966c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復問言：「世有何人而得安睡？」",
        "translation": "Again, he asked, \"Who is there in the world who gets a peaceful night's sleep?\"",
        "source": "T03n0191_011:0966c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說伽陀而答之曰：「若人心寂靜，　　一切得安睡；　若人繫染欲，　　熱惱心不止。",
        "translation": "The Buddha explained the answer to Kālādagupta, \"If the mind is calm, all can sleep soundly; if someone is tethered to defiled desires, their passions and disturbances don't end.",
        "source": "T03n0191_011:0966c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　染欲熱惱除，　　解脫無所繫；　心意調伏已，　　得息得安睡。」",
        "translation": "When the fever of defiled desire is removed, their liberation is unfettered; once their mind and thoughts are disciplined, they can rest and fall asleep.\"",
        "source": "T03n0191_011:0966c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊說伽陀已，與給孤長者同入林中。",
        "translation": "After the Bhagavān spoke about the Gatha, he and the elder Gokul went into the forest together.",
        "source": "T03n0191_011:0966c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛還本座，長者即前禮佛雙足，於一面坐樂欲聽法，佛乃勸發令心歡喜。",
        "translation": "When the Buddha returned to his seat, the elder saluted his feet and sat to one side, eager to hear the teaching, and the Buddha encouraged him to rejoice.",
        "source": "T03n0191_011:0966c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告長者言：「布施、持戒得生天上，雖五欲自在非為究竟；欲免輪迴當斷煩惱，於善惡法廣為分別。」",
        "translation": "It was then that the Bhagavān addressed the elder, \"Although freely bestowing alms and observing precepts will lead to birth in the heavens, the five desires are not perfect; those who want to avoid the cycle of rebirth must stop afflictions and make a wide variety of distinctions between good and bad qualities.\"",
        "source": "T03n0191_011:0966c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時長者得聞是法，以宿善力深心思惟，蓋障即除心喜無量。",
        "translation": "When the elder heard this teaching, he deeply considered it with the strength of his long-standing goodness, and his hindrances were immediately removed, and his heart rejoiced immeasurably.",
        "source": "T03n0191_011:0966c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知是已，即為廣說苦、集、滅、道四聖諦法。",
        "translation": "Knowing this, the Buddha then explained in detail the teaching of the four noble truths of suffering, arising, cessation, and the path.",
        "source": "T03n0191_011:0966c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時長者不起於座證四諦理，如潔白衣易染其色，隨彼所染皆成上妙。",
        "translation": "Not rising from his seat, the elder then realized the principle of the four noble truths like a clean white robe that's easily dyed, and whatever it defiles becomes marvelous.",
        "source": "T03n0191_011:0966c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者得法知見永斷疑惑，於佛、法、僧深信堅固，即從座起，偏袒右肩合掌頂禮，白言：「世尊！",
        "translation": "Having permanently ended doubt and confusion about the knowledge and vision of the Dharma, the elder's conviction about the Buddha, Dharma, and Saṃgha was so strong that he rose from his seat, bared his right shoulder, saluted with his palms together, and said, \"Bhagavān!",
        "source": "T03n0191_011:0966c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今歸依佛、法及苾芻眾，持近事戒永不殺生。」",
        "translation": "Now, I take refuge in the Buddha, Dharma, and the Bhikṣu, upholding the precepts of proximity to service and never killing.\"",
        "source": "T03n0191_011:0966c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊問長者言：「汝何名字？」",
        "translation": "It was then that the Bhagavān asked the elder, \"What's your name?\"",
        "source": "T03n0191_011:0966c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者對曰：「我於國中少有資產，或是貧匱孤獨之人來丐求者，我施飲食及彼資具，國人名我為給孤獨。」",
        "translation": "The elder replied, \"I have few assets in my country, and when poor and lonely people come begging, I give them food and drink and their necessities, and the people of my country call me 'giving them to the lonely.'\"",
        "source": "T03n0191_011:0966c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝國何名？」",
        "translation": "\"What's the name of your country?\"",
        "source": "T03n0191_011:0966c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「舍衛。",
        "translation": "He replied, \"Śrāvastī.",
        "source": "T03n0191_011:0966c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願佛及眾來降我國，當以衣服、飲食、臥具、湯藥一切受用，畢生奉施。」",
        "translation": "May the Buddha and his entourage come to our country and offer them all the necessities of clothing, food, bedding, and medicine for their whole lives.\"",
        "source": "T03n0191_011:0966c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「長者！",
        "translation": "The Buddha said, \"Elder!",
        "source": "T03n0191_011:0966c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我與苾芻數踰千人，彼無精舍何以安住？」",
        "translation": "How can I and my monks, who number more than a thousand, stay in a monk's dwelling if there's no dwelling?\"",
        "source": "T03n0191_011:0966c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者對曰：「佛若降臨速當建立，唯願大慈不違我請。」",
        "translation": "The elder said to him, \"If the Buddha comes, he'll quickly establish it; please have great compassion and don't disobey my invitation.\"",
        "source": "T03n0191_011:0966c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即默然。",
        "translation": "The Buddha then remained silent.",
        "source": "T03n0191_011:0966c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "給孤長者見佛默然，知已受請，歡喜踊躍，頭面禮足旋遶而退。",
        "translation": "Seeing the Buddha's silence and knowing that he had accepted his invitation, that lonely man rejoiced and jumped for joy, bowed his head and feet, circled around, and withdrew.",
        "source": "T03n0191_011:0966c28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是長者入王舍城，營搆事畢將欲還家，再詣寒林，請佛及眾勿慮精舍，願早垂降。",
        "translation": "The elder then went into Rājagṛha and returned home after finishing his work. He went back to the cold forest and asked the Buddha and the others not to worry about the monastery, hoping that they would descend sooner rather than later.",
        "source": "T03n0191_011:0967a01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言已還家。",
        "translation": "After he said that, he returned home.",
        "source": "T03n0191_011:0967a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自此日後一切皆停，於舍衛城周遍內外，求覓殊勝清淨之地，欲建精舍安佛及僧。",
        "translation": "From then on, he stopped everything and searched all over Śrāvastī, both inside and outside, for a place of outstanding purity where he could build a dwelling for the Buddha and the saṃgha.",
        "source": "T03n0191_011:0967a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「唯有祇陀童子園苑最勝。",
        "translation": "\"The only one that stood out was Jeta's Boyhood Park.",
        "source": "T03n0191_011:0967a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T03n0191_011:0967a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此童子園，其地寬廣無諸穢惡，竹樹蓊欝泉池清淨，寒風暑氣俱不能侵，又無蚊虻含毒之蟲，唯有吉祥飛走之類；又復王城不遠不近，非求法人不能到此，若建精舍斯為最勝。」",
        "translation": "This boy's park is so vast and undefiled, with its luxuriant bamboo trees and pure springs and pools, that neither cold nor heat can attack it, and there are no insects that contain poison, only species that are auspicious and fly about.",
        "source": "T03n0191_011:0967a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思念已竟，即詣園主祇陀童子，而告之曰：「童子勿怪，我有勝事欲以上聞。",
        "translation": "After he finished his thoughts, he went to the boy Jeta, the park's director, and told him, \"Don't blame him, boy, for there's something wonderful I want to hear about.",
        "source": "T03n0191_011:0967a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子可容，方敢陳說。」",
        "translation": "Allow me to tell you, boy, before I dare to tell you.\"",
        "source": "T03n0191_011:0967a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子告言：「有事可說。」",
        "translation": "The boy told him, \"There's something I can tell you.\"",
        "source": "T03n0191_011:0967a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者起立謂童子言：「欲買茲園，當為世尊及千聖眾造立精舍而請安住。",
        "translation": "The elder got up and said to the boy, \"I want to buy this park so that I can build a dwelling for the Bhagavān and a thousand sages and ask them to stay here.",
        "source": "T03n0191_011:0967a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊若容允，價即稟言。」",
        "translation": "If Your Holiness approves, I'll give you the price.\"",
        "source": "T03n0191_011:0967a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "祇陀童子告長者曰：「一切可得，唯園勿言。」",
        "translation": "The boy Gṛdhrakūṭa told the elder, \"Everything is available, but don't tell me about the garden.\"",
        "source": "T03n0191_011:0967a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者又曰：「我聞佛言：『一切無常無有主者，以不堅法宜易堅牢。』」",
        "translation": "The elder also said, \"I've heard the Buddha say, 'Everything is impermanent and has no owner, so it's better to make an insubstantial dharma that's firm and stable.'\"",
        "source": "T03n0191_011:0967a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子報言：「非我所知，勿復更說。」",
        "translation": "The boy replied, \"I don't know about that, so don't say anything more.\"",
        "source": "T03n0191_011:0967a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者又曰：「佛者難值，園即易求，今或遲疑後施無及。」",
        "translation": "The elder also said, \"The Buddha is difficult to attain, and the garden is easy to seek.",
        "source": "T03n0191_011:0967a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "祇陀童子雖聞此說心未能捨，乃以要言阨彼長者：「君能以金布滿其地，我即與汝，任自所為。」",
        "translation": "Although he heard this, the boy Jeta was unable to relinquish it. He then gave the elder the important words, \"If you can fill the ground with gold, I'll give it to you as you wish.\"",
        "source": "T03n0191_011:0967a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者審知恐未誠信，報而言曰：「童子若爾，可聞市官，當使兩情執無反覆。」",
        "translation": "The elder, realizing that he might not be sincere, replied, \"If that's the case, the boy can hear about the market official, who will make sure that there's no repetition in the attachment of the two minds.\"",
        "source": "T03n0191_011:0967a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子俛仰共聞市官。",
        "translation": "The boy exhorted them to listen to the market officials.",
        "source": "T03n0191_011:0967a22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時四天王遙知斯事：「佛今出世，舍衛城中給孤長者，買祇陀園造立精舍，兩人商議取正市官；我今變身與成其事。」",
        "translation": "The four heavenly kings then knew this from afar: \"Now, when the Buddha appeared in the world, he bought an orphaned elder in Śrāvastī to build a monastery in Jeta's Park, and they discussed it, and I was transformed into a body to serve as a market official.\"",
        "source": "T03n0191_011:0967a23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天王變身作市官已，來於市肆，顒望給孤與童子至。",
        "translation": "After he transformed into a city official, the king of gods went to the marketplace and looked for Gokul and the boy to arrive.",
        "source": "T03n0191_011:0967a25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二人至已，給孤先言：「我買彼園欲造精舍，令以黃金布遍其地，若能爾者即可相與，今來取正。",
        "translation": "When they arrived, Gṛdhrakūṭa said, \"I bought that park and wanted to build a dwelling there, so that gold could be spread all over the ground, and if that's possible, I can give it to you.",
        "source": "T03n0191_011:0967a26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此價云何？」",
        "translation": "What's the price?\"",
        "source": "T03n0191_011:0967a28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "市官言曰：「二人之心得可否未？」",
        "translation": "The city officials said, \"Have you gotten any insight from these two?\"",
        "source": "T03n0191_011:0967a29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對言：「已定。」",
        "translation": "He said, \"It's settled.\"",
        "source": "T03n0191_011:0967a29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "市官言曰：「善哉，善哉！",
        "translation": "The city officials said, \"Good, good!",
        "source": "T03n0191_011:0967b01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子收金，長者得園。」",
        "translation": "The boy received the gold, and the elder was given the garden.\"",
        "source": "T03n0191_011:0967b01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子默然更無違悔。",
        "translation": "The boy remained silent and didn't repent.",
        "source": "T03n0191_011:0967b02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者即日，速以車、乘、象、馬之類，乃至僮僕，般運黃金處處布訖，唯前面少許而未周足。",
        "translation": "That same day, the elder quickly took a chariot, a cart, an elephant, a horse, and even a servant, and distributed the gold everywhere except for a little in front of him, which was not enough.",
        "source": "T03n0191_011:0967b02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者籌慮：「取何藏金可遍此地？」",
        "translation": "The elder considered, \"What is the best way to store gold to cover this place?\"",
        "source": "T03n0191_011:0967b04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是之際，童子告言：「汝已迴意便可收金。」",
        "translation": "At that point, the boy told him, \"Once you've turned your mind around, you can collect the gold.\"",
        "source": "T03n0191_011:0967b05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者報言：「我意不迴，思何藏金可遍此地，以斯事故籌慮少時。」",
        "translation": "The elder replied, \"I'm not turning back my mind, but I was thinking about how I could hide gold all over this place, so I've been thinking about this for a while.\"",
        "source": "T03n0191_011:0967b06_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "童子思惟：「奇哉！",
        "translation": "The boy thought, \"That's amazing!",
        "source": "T03n0191_011:0967b07_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者能捨如是大財，為佛及僧造立精舍。」",
        "translation": "That man could give up such a great fortune to build a monastery for the Buddha and Saṃgha.\"",
        "source": "T03n0191_011:0967b07_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復思惟：「我曾聞說：『若非正覺出於世間，一切眾生不聞正法。』",
        "translation": "Again, he thought, \"I've heard it said, 'Unless the right awakening comes into the world, all sentient beings won't hear the right teaching.'",
        "source": "T03n0191_011:0967b08_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯可助施，理必相容。」",
        "translation": "This is an aid to giving, and the principle will be compatible.\"",
        "source": "T03n0191_011:0967b10_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即謂長者：「勿更取金，欲迴此地我施作門，美可共成功亦圓滿。」",
        "translation": "He then told the elder, \"Don't take any more gold; if you want to return to this place and make a gift from me, it'll be both beautiful and complete.\"",
        "source": "T03n0191_011:0967b10_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者報言：「我非無金，童子爾者誠為甚善。」",
        "translation": "The elder replied, \"It's not that I don't have gold, but this, boy, is really very good.\"",
        "source": "T03n0191_011:0967b12_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布金纔畢方欲命工，外道悉知速來惑亂，謂長者曰：「瞿曇沙門今在摩竭陀國王舍城居，此舍衛城地貴名高，非彼所住，勿立精舍、勿得迎請。」",
        "translation": "After he had finished laying out the gold, he was about to order his work when the heretic, who knew he was coming, quickly disturbed him and told the elder, \"The Gautama monk now lives in the city of Rājagṛha in Magadha, and this city of Śrāvastī is a noble and prestigious place.",
        "source": "T03n0191_011:0967b13_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者即怒報外道曰：「此舍衛城非汝所有，何關汝事？」",
        "translation": "The elder then angrily retaliated to the heretic, saying, \"You don't own this city of Śrāvastī, so what business is it of yours?\"",
        "source": "T03n0191_011:0967b16_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外道聞已知不從心，復詣於王，王亦不允，諸外道輩面慚無色心極煩惱。",
        "translation": "When the heretics heard that they didn't follow their hearts, they went back to the king, who wouldn't allow them, and the heretics' faces were ashamed and colorless, and their minds were extremely troubled.",
        "source": "T03n0191_011:0967b17_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復詣長者而告言曰：「我先所說不為園苑，但以彼眾非我同修。",
        "translation": "They then went back to the elder and told him, \"What I said before wasn't for a garden, but it's because they aren't part of my practice.",
        "source": "T03n0191_011:0967b19_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者今日若是堅執，斯有所報請不相違。",
        "translation": "If you had insisted today, I would have asked you not to contradict this reward.",
        "source": "T03n0191_011:0967b20_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞瞿曇有大弟子，先已到此，可與論義即辯勝劣；如彼得勝精舍可為，若其不勝何用迎請。",
        "translation": "I've heard that the Gautama has a great disciple who came here earlier and could discuss the meaning and debate the superior and inferior; if Peter is superior to the monastery, then why would he welcome him if he's not superior?",
        "source": "T03n0191_011:0967b21_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我此所說，君見如何？」",
        "translation": "What do you think of what I've said?\"",
        "source": "T03n0191_011:0967b23_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者告言：「此說甚善。",
        "translation": "The elder told him, \"This is a very good teaching.",
        "source": "T03n0191_011:0967b24_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若定勝劣，足得相依，清濁要分、真偽斯辯。」",
        "translation": "If one determines the superiority and inferiority, it's sufficient to rely on each other, and the essentials of clarity and impurity are distinguished, and the true and false are debated.\"",
        "source": "T03n0191_011:0967b24_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說眾許摩訶帝經卷第十一",
        "translation": "Foshuo zhongshi mahātei jing, vol. 11",
        "source": "T03n0191_011:0967b26_0",
        "is_bad_quality": false
    }
]