[
    {
        "source_sentence": "普曜經卷第三",
        "translation": "Puyao jing, vol. 3",
        "source": "T03n0186_003:0497a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西晉月氏三藏竺法護譯",
        "translation": "Translation of the Tripiṭaka of the Yuezhi Family of the Western Jin Dynasty by Zhu Fahou",
        "source": "T03n0186_003:0497a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入天祠品第六",
        "translation": "The Sixth Chapter of the Entry into the Divine Arsenal",
        "source": "T03n0186_003:0497a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「菩薩適生，當爾之時，君子梵志長者二萬婦生，二親歡悅，皆奉菩薩給使左右。",
        "translation": "The Buddha told the monks, \"When the bodhisattva was about to be born, 20,000 wives of noble priests and elders were born, and their two parents were delighted and served the bodhisattva as his messengers.",
        "source": "T03n0186_003:0497a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時白淨王，供給菩薩二萬婇女走使所當；諸家親族二萬婇女，貢上菩薩，大臣百官復有婇女二萬，奉上菩薩；尊豪諸釋咸共集會，來至王所，前啟白言：『王當知之，宜將太子至於天祠。』",
        "translation": "\"It was then that King Baekjeong offered the bodhisattva 20,000 women to take him away, 20,000 women from his family and clan paid tribute to the bodhisattva, and another 20,000 women from his ministers and 100 officials presented themselves to the bodhisattva; the venerable gentlemen and scholars all gathered together, came to the king, and revealed to him, saying, 'The king should know that it's appropriate to send the crown prince to the celestial shrine.'",
        "source": "T03n0186_003:0497a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王然可之。",
        "translation": "The king approved.",
        "source": "T03n0186_003:0497b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆勅城內掃除衢路，四徼諸道諸曲里巷，莫有不淨不吉之事，瓦石溝坑不淨之地；病疾盲聾勿有惡聲，散華燒香選吉祥音，懸幡繒蓋，莊嚴門戶。",
        "translation": "He ordered the city to clean the streets, spread out flowers and incense, select auspicious sounds, hang banners and silken canopies, and adorn the entrances and exits.",
        "source": "T03n0186_003:0497b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王還入後宮，以告大愛道，擁護太子將詣天祠。",
        "translation": "The king returned to the rear palace, told the great beloved Way, and embraced the prince as he marched to the celestial shrine.",
        "source": "T03n0186_003:0497b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子在座即時微笑，面目喜悅，頒宣此言：『吾身和安，何緣相將欲詣天祠？』",
        "translation": "The crown prince smiled instantly from his seat and beamed with joy as he announced this, 'My body is peaceful, what are the reasons I'm about to go to the celestial shrine?'",
        "source": "T03n0186_003:0497b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子沐浴，重加大笑，即說偈言：「『初生動三千，　　釋梵須倫神；　　日月息天王，　　來稽頭面禮。",
        "translation": "After he had bathed, the prince repeatedly added a smile to his face and spoke a verse, saying, \"When he was first born, he was moved by 3,000 gods, the god Brahmā Saurīya; the sun and moon were like kings of the gods, and he came to pay homage to them.",
        "source": "T03n0186_003:0497b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　何有天過是，　　將吾到其所；　　超天天中天，　　天無比況勝。",
        "translation": "What gods could possibly surpass this and lead me to their place? 'They're greater than the gods of the gods, and there's nothing like them.'",
        "source": "T03n0186_003:0497b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　隨俗來現此，　　現瑞人歡喜；　　若干種奉養，　　過聖天中天。』」",
        "translation": "We come here as laypeople do, and we are greeted with joy and certain kinds of respect, surpassing the noble gods among gods.'\"",
        "source": "T03n0186_003:0497b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「於時嚴飾諸吉祥業長者梵志，諸郡縣邑尊者居士，妻息侍從大臣散王，門吏令吏親族知識，散華燒香，乘象馬車國王侍臣，俱將太子往入天祠。",
        "translation": "The Buddha told the monks, \"At the time, the priests and ministers who had adorned the elders of Auspicious Fortune, the venerable householders of the prefectures and cities, the wives and attendants of the ministers, the doorkeepers and officials, and their relatives and friends spread flowers and burned incense, and the king's attendants rode in an elephant and horse chariot, all took the prince into the celestial shrine.",
        "source": "T03n0186_003:0497b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "適入天祠，因住祠上，諸天形像無有想念，日月諸天、息意天王、釋梵四王，各捨本位尋時來下，五體投地禮菩薩足；諸天人民百千之眾，嘿然歎吒稱揚洪音，歎未曾有，歡喜踊躍；天地大動天雨眾華，百千伎樂不鼓自鳴，諸天形像現其本身，禮菩薩足則在前住，於是頌曰：「『須彌比芥子，　　過天龍王變；　　日月禮螢耶？",
        "translation": "When he arrived at the celestial shrine, the gods' images were not missed as he stayed at the shrine, and the sun and moon gods, the gods of respite, and the four Śākyamuni kings each left their original positions and came down at the appropriate time to bow at the feet of the bodhisattva with five bodies; the hundreds of thousands of gods and people heatedly praised Tcha and praised the loud sounds, admiring what had never been heard before and rejoicing.",
        "source": "T03n0186_003:0497b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　慧德豈禮敬？",
        "translation": "How could the virtue of wisdom be honored?",
        "source": "T03n0186_003:0497b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　三千界自歸，　　芥子比須彌；　　牛跡比大海，　　上尊喻日月。",
        "translation": "'The 3,000 worlds take care of themselves, and the mustard seed is compared to Sumeru; the cow tracks are compared to the ocean, and the most venerable is a metaphor for the sun and moon.",
        "source": "T03n0186_003:0497b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若能禮其尊，　　功德不可計；　　各各得安隱，　　德豐無限量。』",
        "translation": "If someone can venerate that honored one, their merits are incalculable; each attains peace, and their virtue is limitless.'",
        "source": "T03n0186_003:0497c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩入天祠時，三萬二千天子，見顯威德，皆發無上正真道意；以是之故，將菩薩行入於天祠。",
        "translation": "\"When the bodhisattva entered the celestial shrine, 32,000 sons of gods who saw the display of authoritative qualities aroused the intention for the unsurpassed true path; therefore, they admitted the bodhisattva's practice to the celestial shrine.",
        "source": "T03n0186_003:0497c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎時有梵志名曰火炎，於是其父與五百眷屬圍繞，執七寶蓋貢白淨王，口說此言：『以供太子。』",
        "translation": "It was then that a priest named Huoyan, whose father was surrounded by 500 members of his retinue, gathered seven jeweled lids and presented them to King Jing, saying, 'Offer them to the prince.'",
        "source": "T03n0186_003:0497c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即受之，召五百釋子，五百瓔珞手脚頭耳，臂著瓔珞，沸宿即時來詣王所而謂王言：『宜令太子沐浴澡洗，乃著瓔珞而供養之。』",
        "translation": "The king then accepted it, summoned five hundred Śākyamuni's sons, five hundred diademed hands, feet, heads, ears, and arms, and boiled over the night to come to the king right away and tell him, 'It would be good for the prince to bathe and wash himself, put on a diadem, and make offerings to him.'",
        "source": "T03n0186_003:0497c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王報之曰：『我為太子亦作瓔珞。",
        "translation": "The king rewarded him, saying, 'I'll make a necklace for the prince, too.'",
        "source": "T03n0186_003:0497c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子著之，七十七日吾乃應義。』",
        "translation": "The prince will wear it, and I will grant it for 77 days.'",
        "source": "T03n0186_003:0497c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過此夜已，其日月初有一遊觀，名離垢淨，菩薩出觀，其大愛道抱將來出，八萬婇女來迎菩薩，稽首為禮。",
        "translation": "After this night, there was a roaming meditation at the beginning of the sun named 'Pure from Stain,' and when the bodhisattva emerged from that meditation, 80,000 women came to greet the bodhisattva and paid homage by prostrating themselves.",
        "source": "T03n0186_003:0497c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸釋一萬人奉迎菩薩，五千梵志亦復奉迎，其諸釋種作眾瓔珞奉菩薩者，令菩薩著。",
        "translation": "Ten thousand of the Śākyas greeted the bodhisattva, as did 5,000 priests, and those Śākyas made a multitude of jewelry to present to the bodhisattva and cause him to wear it.",
        "source": "T03n0186_003:0497c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "適被在身，即時闇冥，菩薩威光令無有耀，猶如墨聚在紫金邊。",
        "translation": "When they were properly clad, it was immediately dark, and the bodhisattva's majestic radiance shone through without shining, like a mass of ink on the edge of purple gold.",
        "source": "T03n0186_003:0497c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一長者名曰離垢，服上好妙英住菩薩前。",
        "translation": "An elder named Licchavi stayed in front of the bodhisattva, wearing the finest and most marvelous robes.",
        "source": "T03n0186_003:0497c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時白淨王及諸釋種以偈讚曰：「『嚴三千世界，　　遍布清淨寶；　　皆為紫磨金，　　不及此光明。",
        "translation": "Then King Baishen and the Śākyas praised him in verse, saying, \"Adorn the 3,000 worlds, they're filled with pure treasures; they're all purple polished gold, but not as brilliant as this.",
        "source": "T03n0186_003:0497c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　雖有紫磨金，　　不如一毛光；　　明耀消諸光，　　在聖邊如墨。",
        "translation": "Even though there's purple polished gold, it's not as bright as a single hair; it shines brightly and cancels out all the light, and it's like ink at the sage's edge.",
        "source": "T03n0186_003:0497c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　以道德莊嚴，　　瓔珞奄無耀；　　日月明珠光，　　釋梵明不及。",
        "translation": "Adorned by virtue, their jewelry is unsullied, and the brightness of the sun and moon's bright pearl is unmatched by the Brahmā's brightness.",
        "source": "T03n0186_003:0497c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　宿相好嚴身，　　寶英安能勝？",
        "translation": "How could the jeweled heroes surpass the beautiful and adorned body of a former life?",
        "source": "T03n0186_003:0497c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　莊嚴莫如佛，　　蔽嚴不及度。",
        "translation": "Nothing is more adorned than the Buddha, and Veil of Adornment doesn't reach them.",
        "source": "T03n0186_003:0497c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　道嚴淨安明，　　適生嚴種姓；　　演光眾歡喜，　　長蓋其種族。』」",
        "translation": "Vairocana is pure, peaceful, and clear, suitable for birth in an ornate family; it produces a multitude of joyful lights that long cover their race.'\"",
        "source": "T03n0186_003:0497c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普曜經現書品第七",
        "translation": "The Seventh Chapter of the Present Translation of the Lalitavistara Sutra",
        "source": "T03n0186_003:0498a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「爾時太子厥年七歲，興顯無數百千吉祥，一萬童子、一萬女子，一萬車乘載若干種饌、具足眾寶，至迦夷國置四徼里，諸街曲頭作眾伎樂；在諸樹間，莊嚴棚閣軒牕門牖，其諸婇女文飾瓔珞，而處其上散華燒香；八千婇女淨治道路，奉迎菩薩。",
        "translation": "The Buddha told the monks, \"At the time, the prince, who was seven years old, produced an incalculable number of hundreds of thousands of auspicious features, 10,000 children, 10,000 women, and 10,000 chariots and carts carrying various kinds of food and an assortment of treasures, went to the country of Kāśyapa and spread out over four miles, creating a multitude of music in the streets and tunnels, decorating mansions, lofts, windows, doors, and gates among the trees, decorating the decorations and jewelry of his women, scattering flowers and burning incense, and 8,000 women purifying the roads to greet the bodhisattva.",
        "source": "T03n0186_003:0498a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天龍神及揵沓和，在虛空中各各異形，散華燒香垂珠幡綵，一切眾釋前後導從白淨王俱，行迎菩薩。",
        "translation": "The gods, dragons, and gandharvas, each in a different form in the sky, scattered flowers, burned incense, hung pearls, banners, and ribbons, and all the multitudes of siddhântas led the way from front to back to meet the bodhisattva, accompanied by King Beophyte.",
        "source": "T03n0186_003:0498a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩乘羊車將詣書師，適入書堂欲見其師，師名選友，時見威神光曜，不能堪任，即僻墮地。",
        "translation": "Riding in his goat cart, the bodhisattva was about to go to the master of letters when he entered the study hall to meet his teacher, whose name was Chosen Friend.",
        "source": "T03n0186_003:0498a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兜術天上有一天子名曰清淨，即前牽手令從地起，置於座上，在大眾前，說此偈言：「『現世釋中生，　　在俗學伎術；　　計挍及書疏，　　無數劫已了。",
        "translation": "A celestial in Tuṣita Heaven named Jingjing took him by the hand, lifted him off the ground, placed him on his seat, and spoke this verse in front of the crowd, saying, \"In the present life, there's a person from among the Śākyas who trains in secular arts and crafts and has compiled detailed calculations and commentaries for countless eons.",
        "source": "T03n0186_003:0498a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　救眾生故現，　　博學示入師；　　度無數童子，　　惠眾入甘露。",
        "translation": "He saves sentient beings and thus shows them the way, educates countless children, and gives them access to the ambrosia.",
        "source": "T03n0186_003:0498a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　度世解四諦，　　了報應因緣；　　有成必滅盡，　　況今此書堂。",
        "translation": "He passes through the world understanding the four truths, comprehends retribution and responds to causes and conditions, and whatever is accomplished must cease, let alone this study hall.",
        "source": "T03n0186_003:0498a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於三世最明，　　天人第一尊；　　書堂化若干，　　無數劫學斯。",
        "translation": "He's the most knowledgeable of the three worlds, the most honored of gods and humans, and he's trained countless eons in his study hall.",
        "source": "T03n0186_003:0498a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　眾生心多念，　　真聖專知本；　　是色其無念，　　立或化貪形。』",
        "translation": "While the minds of sentient beings are filled with mindfulness, true sages exclusively know the origin; these are forms without mindfulness, and they may establish or transform into desirable forms.'",
        "source": "T03n0186_003:0498a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩與諸釋童俱住，菩薩手執金筆栴檀書隸，眾寶明珠成其書狀，侍者送之。",
        "translation": "\"The bodhisattva was staying with the Śākyamuni boys, and he was holding a gold brush, a sandalwood scroll, and a collection of precious jewels in the shape of writing, which his attendants presented to him.",
        "source": "T03n0186_003:0498a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問師選友：『今師何書而相教乎？』",
        "translation": "He asked the teacher, selecting a friend, 'Now, what writing did the teacher give to teach?'",
        "source": "T03n0186_003:0498a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其師答曰：『以梵佉留而相教耳，無他異書。』",
        "translation": "The teacher replied, 'It's because the Brahmakārī taught each other, and there are no other variant writings.'",
        "source": "T03n0186_003:0498a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩答曰：『其異書者有六十四，今師何書正有二種。』",
        "translation": "The bodhisattva replied, 'There are sixty-four different writings, and now there are precisely two kinds of master's writings.'",
        "source": "T03n0186_003:0498a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師問：『其六十四書皆何所名？』",
        "translation": "The teacher asked, 'What are the names of the sixty-four books?'",
        "source": "T03n0186_003:0498b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子答曰：「『《梵書》(一)　《佉留書》(二)　《佛迦羅書》(三)　《安佉書》(四)　《曼佉書》(五)　《安求書》(六)　《大秦書》(七)　《護眾書》(八)　《取書》(九)　《半書》(十)《久與書》(十一)　《疾堅書》(十二)　《陀比羅書》(十三)　《夷狄塞書》(十四)　《施與書》(十五)　《康居書》(十六)　《最上書》(十七)　《陀羅書》(十八)　《佉沙書》(十九)　《秦書》(二十)　《匈奴書》(二十一)　《中間字書》(二十二)　《維耆多書》(二十三)　《富沙富書》(二十四)　《天書》(二十五)《龍書鬼書》(二十六)　《揵沓和書》(二十七)　《真陀羅書》(二十八)《摩休勒書》(二十九)　《阿須倫書》(三十)　《迦留羅書》(三十一)　《鹿輪書》(三十二)　《言善書》(三十三)　《天腹書》(三十四)　《風書》(三十五)　《降伏書》(三十六)　《北方天下書》(三十七)　《拘那尼天下書》(三十八)　《東方天下書》(三十九)　《舉書》(四十)　《下書》(四十一)　《要書》(四十二)　《堅固書》(四十三)　《陀阿書》(四十四)　《得晝書》(四十五)　《厭舉書》(四十六)　《無與書》(四十七)　《轉數書》(四十八)　《轉眼書》(四十九)　《閉句書》(五十)　《上書》(五十一)　《次近書》(五十二)《乃至書》(五十三)　《度親書》(五十四)　《中御書》(五十五)　《悉滅音書》(五十六)　《電世界書》(五十七)　《馳又書》(五十八)　《善寂地書》(五十九)　《觀空書》(六十)　《一切藥書》(六十一)　《善受書》(六十二)《攝取書》(六十三)　《皆響書》(六十四)』「太子謂師：『是六十四書，欲以何書而相教乎？』",
        "translation": "太子答曰：「『《梵書》(一)　《佉留書》(二)　《佛迦羅書》(三)　《安佉書》(四)　《曼佉書》(五)　《安求書》(六)　《大秦書》(七)　《護眾書》(八)　《取書》(九)　《半書》(十)《久與書》(十一)　《疾堅書》(十二)　《陀比羅書》(十三)　《夷狄塞書》(十四)　《施與書》(十五)　《康居書》(十六)　《最上書》(十七)　《陀羅書》(十八)　《佉沙書》(十九)　《秦書》(二十)　《匈奴書》(二十一)　《中間字書》(二十二)　《維耆多書》(二十三)　《富沙富書》(二十四)　《天書》(二十五)《龍書鬼書》(二十六)　《揵沓和書》(二十七)　《真陀羅書》(二十八)《摩休勒書》(二十九)　《阿須倫書》(三十)　《迦留羅書》(三十一)　《鹿輪書》(三十二)　《言善書》(三十三)　《天腹書》(三十四)　《風書》(三十五)　《降伏書》(三十六)　《北方天下書》(三十七)　《拘那尼天下書》(三十八)　《東方天下書》(三十九)　《舉書》(四十)　《下書》(四十一)　《要書》(四十二)　《堅固書》(四十三)　《陀阿書》(四十四)　《得晝書》(四十五)　《厭舉書》(四十六)　《無與書》(四十七)　《轉數書》(四十八)　《轉眼書》(四十九)　《閉句書》(五十)　《上書》(五十一)　《次近書》(五十二)《乃至書》(五十三)　《度親書》(五十四)　《中御書》(五十五)　《悉滅音書》(五十六)　《電世界書》(五十七)　《馳又書》(五十八)　《善寂地書》(五十九)　《觀空書》(六十)　《一切藥書》(六十一)　《善受書》(六十二)《攝取書》(六十三)　《皆響書》(六十四)』「太子謂師：『是六十四書，欲以何書而相教乎？』",
        "source": "T03n0186_003:0498b02_4",
        "is_bad_quality": true
    },
    {
        "source_sentence": "時師選友歡然悅豫，棄捐自大，說是偈言：「『難及真淨尊，　　在世興悲哀；　　悉學一切典，　　現入書教中。",
        "translation": "Rejoicing in the joy and pleasure of his chosen friend, the teacher renounced his pride and spoke this verse, saying, \"It's difficult and truly pure to honor the venerable, for he's compassionate in this world; he's studied all the scriptures and has now entered the book tradition.",
        "source": "T03n0186_003:0498b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　咸宣諸書名，　　吾不知本末；　　皆達此眾書，　　故復示入學。",
        "translation": "They all proclaim the names of books that I don't know the origin of; they've all mastered these books, so I'll again show them to the students.",
        "source": "T03n0186_003:0498b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　不敢觀其頂，　　惟覩人禮拜；　　云何令大聖，　　宣諸書眾數？",
        "translation": "I dare not look at their heads, but I see people venerating them; how did the great sage come to proclaim the multitude of these books?'",
        "source": "T03n0186_003:0498b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　天中天過天，　　諸天中最上；　　至尊無等倫，　　在世不可喻。",
        "translation": "'Among the gods, he's greater than the gods, the highest of the gods; his supremacy is beyond compare, and he's incomparable in the world.",
        "source": "T03n0186_003:0498c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　以是威神故，　　嚴淨用善權；　　誰能及清明，　　皆度諸世間。』",
        "translation": "Because of this authoritative power, they adorn and purify themselves with skillful authority; who could match their clarity and save the world?'",
        "source": "T03n0186_003:0498c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時一萬童子，與菩薩俱在師所學，見菩薩威德建大聖慧，分別書字而宣之曰：「『其言無者；宣於無常、苦、空、非我之音。』",
        "translation": "\"Then, 10,000 boys who were studying with the bodhisattva at his teacher's office saw the bodhisattva's authority and virtue and developed great noble wisdom, and they wrote and proclaimed these words, \"'He who says 'nothing' proclaims the sounds of impermanence, suffering, emptiness, and not-self.'",
        "source": "T03n0186_003:0498c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言欲者；出淫、怒、癡諸貪求音。』",
        "translation": "\" 'He who speaks of desire gives voice to the cravings of lust, anger, and delusion.'",
        "source": "T03n0186_003:0498c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言究者；出悉本末真淨之音。』",
        "translation": "\"'He who speaks of investigation produces the sound of true purity in terms of knowing the origin and derivative.'",
        "source": "T03n0186_003:0498c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言行者；出無數劫奉修道音。』",
        "translation": "\"'He who says practice gives rise to the sound of uncountable eons of devoted cultivation.'",
        "source": "T03n0186_003:0498c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言不者；出不隨眾離名色之音。』",
        "translation": "\"'He who says no, it gives rise to the sound of not following the crowd and parting with name and form.'",
        "source": "T03n0186_003:0498c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言亂者；出除濁源生死淵音。』",
        "translation": "\"'He who speaks disorderly gives rise to the sound of removing the source of turbidity and the abyss of birth-and-death.'",
        "source": "T03n0186_003:0498c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言施者；出布施、戒、慧明正音。』",
        "translation": "\"'He who speaks generosity gives rise to the clear and correct sounds of generosity, morality, and wisdom.'",
        "source": "T03n0186_003:0498c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言縛者；出解刑獄考治行音。』",
        "translation": "\"'He who speaks of bondage produces the sound of practices that free people from punishment and imprisonment.'",
        "source": "T03n0186_003:0498c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言燒者；出燋燒罪塵勞欲音。』",
        "translation": "\"'He who says 'burn' produces the sound of burning the dust of sin and the desire for labor.'",
        "source": "T03n0186_003:0498c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言信者；出信、精進、定、智慧音。』",
        "translation": "\"'He who speaks faith gives rise to the sounds of faith, effort, concentration, and wisdom.'",
        "source": "T03n0186_003:0498c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言殊者；出超越聖無上道音。』",
        "translation": "\"'He who speaks eloquence produces the sound of the transcendent, noble, and unsurpassed path.'",
        "source": "T03n0186_003:0498c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言如者；出於如來無所壞音。』",
        "translation": "\"'He who says thusness gives rise to the sound of the Tathāgata's indestructibility.'",
        "source": "T03n0186_003:0498c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言寂者；出觀寂然法惔怕音。』",
        "translation": "\"'He who speaks quiescence gives rise to the sound of the cheerful fear of observing the tranquil Dharma.'",
        "source": "T03n0186_003:0498c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言沒者；出消瞋厭諍訟之音。』",
        "translation": "\"'He who says 'extinction' produces the sound of the elimination of anger and disillusionment with disputes.'",
        "source": "T03n0186_003:0498c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言作者；出罪福報從行受音。』",
        "translation": "\"'He who says 'author' gives rise to the sound of the rewards of sin and merit being received through actions.'",
        "source": "T03n0186_003:0498c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言智者；出一切智慧無壞音。』",
        "translation": "\"'He who speaks wisdom gives rise to the sound of all wisdom not being destroyed.'",
        "source": "T03n0186_003:0498c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言魔者；出降魔力及官屬音。』",
        "translation": "\"'He who speaks of Māra gives voice to the power to subdue Māra and his officials.'",
        "source": "T03n0186_003:0498c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言害者；出棄自大邪見之音。』",
        "translation": "\"'He who speaks harms gives rise to the sound of abandoning one's own great mistaken views.'",
        "source": "T03n0186_003:0498c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言逝者；出於正法無憒亂音。』",
        "translation": "\"'He who says 'passing away' gives rise to the sound of the right teaching not being disturbed.'",
        "source": "T03n0186_003:0498c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言止者；出世俗力無畏之音。』",
        "translation": "\"'He who says 'stopping' gives rise to the sound of fearlessness in regard to worldly forces.'",
        "source": "T03n0186_003:0498c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言生者；出度眾苦老病死音。』",
        "translation": "\"'He who speaks birth gives rise to the sound of liberating sentient beings from suffering, old age, illness, and death.'",
        "source": "T03n0186_003:0498c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言意者；出意堅強獨步三界音。』",
        "translation": "\"'He who speaks his mind gives rise to the sound of a strong mind that stands alone in the three realms.'",
        "source": "T03n0186_003:0498c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言法者；以法等御救濟周旋往反之音。』",
        "translation": "\"'He who speaks the Dharma produces the sound of the Dharma being an equal equal in rescue, going back and forth in a roundabout way.'",
        "source": "T03n0186_003:0499a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言歎者；出隨所願開化諸音。』",
        "translation": "\"'He who says praise gives rise to the sounds of those who wish to awaken and transform others according to their desires.'",
        "source": "T03n0186_003:0499a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言難者；出除八難罪殃之音。』",
        "translation": "\"He who says 'difficulty' produces the sound of the removal of the eight difficult crimes and evils.\"",
        "source": "T03n0186_003:0499a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言盡者；出於盡滅無所生音。』",
        "translation": "\"'He says 'end' and it's a sound that comes out of the cessation of nothing that arises.'",
        "source": "T03n0186_003:0499a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言處者；出消處所顛倒之音。』",
        "translation": "\"'He who speaks of a place gives rise to the sound of the elimination of delusion in places.'",
        "source": "T03n0186_003:0499a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言慧者；出智慧聖無罣礙音。』",
        "translation": "\"'He who speaks wisdom gives rise to the sound of the noble unobstructedness of wisdom.'",
        "source": "T03n0186_003:0499a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言是者；出歸善惡殃福之音。』",
        "translation": "\"'He who says yes gives rise to the sound of the return of good and bad fortune.'",
        "source": "T03n0186_003:0499a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言有者；出諸所行三有之音。』",
        "translation": "\"'He who says 'exist' gives rise to the sound of the three existences in which they function.'",
        "source": "T03n0186_003:0499a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言棄者；棄諸所趣吾我諂音。』",
        "translation": "\"'He who says 'abandonment' produces the sound of flattery in abandoning the self that's the goal.'",
        "source": "T03n0186_003:0499a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言己者；出己所起善惡業音。』",
        "translation": "\"'He who says 'self' gives up the sound of good and bad actions that he has initiated.'",
        "source": "T03n0186_003:0499a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言我者；出滅身垢愛欲之音。』",
        "translation": "\"'He who says 'I' gives rise to the sound of ceasing the physical defilement of craving.'",
        "source": "T03n0186_003:0499a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言垢者；出諸嫉妬等善惡友稱平等音。』",
        "translation": "\"'He who says 'defilement' gives rise to the sound of jealousy and other good and bad friends being called equal.'",
        "source": "T03n0186_003:0499a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言數者；出諸所數調無明音。』",
        "translation": "\"'He who says number, it gives rise to the sound of ignorance about the regulation of what's numbered.'",
        "source": "T03n0186_003:0499a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言處者；出處不處有齊限音。』",
        "translation": "\"He who says 'location' produces the sound of a limit to what's possible and what's not.\"",
        "source": "T03n0186_003:0499a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言若者；度若干想眾亂放逸寂希望音。』",
        "translation": "\"'He who says wisdom is the sound of hope that liberates certain conceptual multitudes from dissipation and tranquility.'",
        "source": "T03n0186_003:0499a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言果者；證諸果實無所住音。』",
        "translation": "\"'He who speaks of fruition realizes that the fruits really are unlocalized.'",
        "source": "T03n0186_003:0499a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言除者；出不貪己除五蓋音。』",
        "translation": "\"'He who says 'removal' produces the sound of not craving oneself and removing the five hindrances.'",
        "source": "T03n0186_003:0499a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言邪者；出邪疾患除憂惱音。』",
        "translation": "\"'He who speaks of wrongness gives rise to the sound of wrong illness and disease and removes grief.'",
        "source": "T03n0186_003:0499a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『其言慧者；出布施、戒、博聞之慧無妄想音。』",
        "translation": "\"'He who speaks wisdom produces the sounds of generosity, morality, and well-versed wisdom without deluded thought.'",
        "source": "T03n0186_003:0499a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩為諸童子，一一分別字之本末，演如是像法門諸音，在於書堂漸開化訓誨；三萬二千童子勸發無上正真道意，是故菩薩往詣書堂，示從師受。",
        "translation": "\"It was then that the bodhisattva addressed the children, speaking one by one, distinguishing the origin and derivation of words, and pronouncing the sounds of this kind of Dharma teaching in the study hall, gradually enlightening and instructing them; 32,000 children were encouraged to inspire the unsurpassed true intention of the path, so the bodhisattva went to the study hall and showed them how to accept it from their teacher.",
        "source": "T03n0186_003:0499a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普曜經坐樹下觀犁品第八",
        "translation": "Samantabhadra Sutra: The Eighth Chapter of the Sutra on Contemplating the Plough while Sitting Under a Tree",
        "source": "T03n0186_003:0499a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時太子年遂長大，啟其父王，與群臣俱行至村落；觀耕犁者，見地新墒蟲隨土出，烏鳥尋啄。",
        "translation": "\"It was then that the prince grew old enough to inspire his father the king and go with his ministers to a village where they looked at a plow and saw new moisture in the ground as worms emerged from the soil and crows and birds searched and pecked it.",
        "source": "T03n0186_003:0499a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩知之故復發問，問其犁曰：『此何所設？』",
        "translation": "Knowing this, the bodhisattva again asked a question and asked the plowman, 'What was the setting for this?'",
        "source": "T03n0186_003:0499a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『種穀用稅國王。』",
        "translation": "He answered, 'The king taxes the grain he cultivates.'",
        "source": "T03n0186_003:0499a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩歎嗟，乃以一夫令民憂擾，畏官鞭杖加罰之厄，心懷恐懼怱怱不安，人命甚短憂長無量，日月流邁，出息不報就於後世；天人終始，三惡苦患不可稱載；五趣生死輪轉無際，沈沒不覺毒痛難喻；入山成道，乃度十方三界起滅危厄之患。",
        "translation": "The bodhisattva praised and sighed in admiration, saying, 'Did he cause the people to be troubled as a single man, fear the embarrassment of being whipped and caned by the officials, hurriedly become frightened and uneasy in his mind, have very short human lives and incalculably long worries, let the sun and moon flow by, fail to produce breaths that will be rewarded in the afterlife, suffer the indescribable suffering of the three evils in the end of gods and humans, have endless transmigration through the five destinies of birth and death, and sink without feeling the pain of suffering?' He entered the mountains to achieve the path, then crossed the ten directions and three realms to raise and extinguish the perilous afflictions.",
        "source": "T03n0186_003:0499a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「觀犁者已更入遊觀，時菩薩遊獨行無侶，經行其地，見閻浮樹蔭好茂盛，則在彼樹蔭涼下坐，一心禪思三昧正定，以為第一。",
        "translation": "\"After he had finished contemplating the plow, the bodhisattva wandered off on his own, without any companions, and when he passed through that region, he saw the Jambū trees in their shade and luxuriant growth, so he sat down under the cool shade of one of those trees and concentrated his mind in samādhi, right concentration, which he considered to be the best.",
        "source": "T03n0186_003:0499b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有外學五百神仙，飛行虛空從南至北，欲越藂樹不能得過，定住不前。",
        "translation": "At the time, there were five hundred sages from outside training who flew through the sky from south to north, wanting to cross that grove of trees, but couldn't get past it, so they remained stationary and didn't advance.",
        "source": "T03n0186_003:0499b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遙見菩薩，因共歎詠觀身功勳，其德巍巍，猶如須彌大金剛山，如妙明珠安不可動；像閻羅王鬼揵沓和耶？",
        "translation": "Seeing the bodhisattva from afar, they shared a common admiration for the merit of contemplating his body, whose virtue was so towering that it was like Sumeru's great adamantine mountain, like a marvelous bright pearl that's unshakable; like Yama's king ghost, Gandharva?",
        "source": "T03n0186_003:0499b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今坐樹下，心如虛空將是定坐，為何吉祥？",
        "translation": "Why is it auspicious that I'm sitting under a tree with my mind as empty as space and will be sitting in meditation?",
        "source": "T03n0186_003:0499b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "儻令我等失神足乎？",
        "translation": "How have you caused us to lose our compositional composure?",
        "source": "T03n0186_003:0499b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "察見愍哀甚大光耀，明顯灼灼，心自念言：『為是神祇毘沙門天大財富者，若是天子上天帝釋，日月之明轉輪聖王也。』",
        "translation": "He saw how his compassion shone brightly and clearly burned, and he thought to himself, 'Suppose this god Vaiśravaṇa is a great wealth, the son of Indra, the sun and moon's bright, wheel-turning sage king.'",
        "source": "T03n0186_003:0499b15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時虛空天即說頌曰：「『色勝息天王，　　若是離怨天；　　若無量金剛，　　是尊為丈夫。",
        "translation": "The Ākāśapratiṣṭhas then spoke a verse, \"Suppose he were the god Bhīṣma, the king of the gods whose form is superior to that of the gods, or if he were a god who's free of enemies, or if he were immeasurable adamantine, would he be honored as a great man?",
        "source": "T03n0186_003:0499b18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　殊過諸天神，　　其光如月滿；　　在世為最上，　　是者不可限。",
        "translation": "He's surpassed by other gods, whose light is like the full moon; he's the highest in the world, and there's no limit to who he is.",
        "source": "T03n0186_003:0499b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　此德不可量，　　為天揵沓和；　　功勳明光光，　　增此億載行。",
        "translation": "This virtue is immeasurable, making it a godlike harmony, and its merits shine brightly, increasing its accomplishments by a hundred million years.",
        "source": "T03n0186_003:0499b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　常退還神足，　　將是世千眼；　　四方護天王，　　須倫梵中尊。",
        "translation": "He always retreats to his spiritual feet, which will be the thousand eyes of the world, and he protects the gods in the four directions, the honored among the gods Surun.",
        "source": "T03n0186_003:0499b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　而執眾吉祥，　　此者能堪任；　　能坐如是前，　　觀之無等倫。』",
        "translation": "He holds the auspiciousness of all these people, and he's capable of handling them; he sits in front of them like this, and he observes them as being without equal.'",
        "source": "T03n0186_003:0499b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時五百仙人聞虛空天所可歎詠，即下住地。",
        "translation": "\"Hearing a praiseworthy song from the sky gods, the five hundred sages then descended to stand on the ground.",
        "source": "T03n0186_003:0499b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀見菩薩神思坐定，身不傾動、心不邪念，即大歡喜；察於菩薩功德巍巍不可限量，其德高遠不可為喻，天人之尊未曾見聞，宿命餘福今乃覩耳。",
        "translation": "They were overjoyed to see the bodhisattva's concentration, his body not tilting, and his mind not thinking wrongly. They perceived the bodhisattva's virtue as being so lofty and limitless, his qualities so lofty and ineffable that the gods had never seen or heard of them before, and now they'd seen the rest of the merits of their long lives.",
        "source": "T03n0186_003:0499c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以為欣慶，即說頌曰：「『世興塵勞火，　　得道滅眾患；　　在世如須彌，　　是能成道法。",
        "translation": "Rejoicing, he then spoke a verse, \"The world produces the fires of defilement and trouble, but the path obtains the cessation of all suffering; it's like Sumeru in the world; this is the Dharma that makes the path possible.",
        "source": "T03n0186_003:0499c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　得勝除眾色，　　尊行難如海；　　得道染以慧，　　靡不得蒙度。",
        "translation": "Attaining victory removes all form, the honored practice is as difficult as the ocean; attaining the path is tainted with wisdom, and none of them will be saved.",
        "source": "T03n0186_003:0499c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　解身之繫縛，　　以逮成道法；　　悉當度脫之，　　不見魔境界。』",
        "translation": "They'll be freed from their physical bonds and thus acquire the Dharma of the path; they'll all be liberated, and they won't see the realm of Māra.'",
        "source": "T03n0186_003:0499c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時王群臣及大眾人，各各馳走欲見太子今為所在？",
        "translation": "\"The king's ministers and the general public then rushed off to see where the prince was now.",
        "source": "T03n0186_003:0499c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遙見諸臣逐之隨後，見閻浮樹下禪思定意。",
        "translation": "After a distant vision of ministers chasing after him, he saw Jambudvīpa meditating and concentrating under a tree.",
        "source": "T03n0186_003:0499c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時日照樹曲覆菩薩身，樹木一切曲躬向閻浮樹而稽首禮菩薩不移。",
        "translation": "\"At the time, the sun-illuminating tree bent over the body of the bodhisattva, and the trees all bent their heads toward the Jambū tree and bowed their heads in prostration to the bodhisattva without moving.",
        "source": "T03n0186_003:0499c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "疾往啟王：『其光明相樹不可蔽曀，日照樹傾覆太子身不能蔽相。』",
        "translation": "He quickly went to the king and asked, 'The tree with its brilliant features can't cover the sun, and the sun-illuminating tree that tilts to cover the prince's body can't cover its features.'",
        "source": "T03n0186_003:0499c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王聞之往詣其樹，即見菩薩威神吉祥巍巍無量，時說偈言：「『如火在山頂，　　如月在眾星；　　見身樹下禪，　　威耀無不照。",
        "translation": "When the king heard this, he went to the tree and saw the bodhisattva's majestic and auspicious presence, which was measureless, and he spoke a verse, saying, 'It's like fire on a mountain peak or the moon among the stars; when I see my body meditating beneath a tree, my power shines through.'",
        "source": "T03n0186_003:0499c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　今復再稽首，　　禮導師之足；　　其初生之時，　　身自坐禪思。",
        "translation": "Now, he bows his head again and salutes the feet of his teacher, who, when he was first born, sat himself in meditation and contemplation.",
        "source": "T03n0186_003:0499c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　其身威神光，　　明徹普遍照；　　若見莫不悅，　　因是得濟度。』",
        "translation": "The authoritative and spiritual light of that body shines brightly and universally; no one who sees it is unpleased, and it's thus possible to be saved.'",
        "source": "T03n0186_003:0499c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「於是太子啟王：『我適行來在近遊觀，何以相追？』",
        "translation": "\"The prince then asked the king, 'I was traveling and wandering around, so why are you following me?'",
        "source": "T03n0186_003:0499c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王問：『何故爾行？』",
        "translation": "The king asked, 'Why is it that you're doing this?'",
        "source": "T03n0186_003:0499c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『諸臣欲除眾塵諸妄思想，光明清淨執於相好，坐禪三昧而不動搖，降伏諸魔闇蔽悉除。』",
        "translation": "He answered, 'My ministers want to rid themselves of the dust of false thoughts, shine brightly and clearly, adhere to their appearances, sit in meditation and concentration without wavering, and subdue the demons; their darkness is completely removed.'",
        "source": "T03n0186_003:0499c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『善哉！",
        "translation": "The king said, 'Good!",
        "source": "T03n0186_003:0499c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T03n0186_003:0500a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初生瑞應終不虛妄，今皆現矣，十方蒙度。』」",
        "translation": "The first-born auspicious response was never false; now they've all appeared, and they've been saved in ten directions.'\"",
        "source": "T03n0186_003:0500a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普曜經王為太子求妃品第九",
        "translation": "[The Ninth Chapter of the Sutra of Universal Luminosity, in which the king seeks a concubine for the crown prince]",
        "source": "T03n0186_003:0500a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「時白淨王與其太子及諸釋種，住於彼間。",
        "translation": "The Buddha told the monks, \"The then pure king was staying there with his crown prince and the ascetics.",
        "source": "T03n0186_003:0500a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸力士釋種長者啟白淨王：『王欲知之，是諸梵志未得究竟，假使太子棄國捐王，成為如來乃得究竟；設不出家，為轉輪王治以正法，號曰法王。",
        "translation": "The elders of the Śākyas and Śrīs then revealed to King Bṛhatphala, 'The king wants to know that these priests have not yet reached the ultimate, so suppose the prince were to renounce his country and renounce the king to become a tathāgata and then reach the ultimate; suppose he doesn't leave home and rules the wheel-turning king with the right Dharma, which is called the Dharma king.",
        "source": "T03n0186_003:0500a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然有七寶：一曰、金輪寶，二曰、紺色馬，三曰、白象，四曰、明月珠，五曰、玉女妻，六曰、主藏臣，七曰、主兵臣；則有千子端正姝好，猛勇傑異一人當千，能伏怨敵。",
        "translation": "Still, there are seven treasures: first, a golden wheel treasure, second, a violet horse, third, a white elephant, fourth, a bright-moon pearl, fifth, a jade lady's wife, sixth, a vassal, and seventh, a vassal; then there are a thousand sons who are noble and beautiful, fierce and outstanding, and one who can subdue enemies.",
        "source": "T03n0186_003:0500a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若作佛者，聖王種斷，唯有散王各各稱号。』",
        "translation": "If they were to become buddhas, the lineage of noble kings would be cut off, and only scattered kings would each be called by their own name.'",
        "source": "T03n0186_003:0500a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白淨王曰：『且當觀之，何所玉女宜應太子妃？』",
        "translation": "He said to King Jing, 'You should also examine this: 'Which jade woman would be suitable for the crown prince's consort?'",
        "source": "T03n0186_003:0500a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五百諸釋各自宣言：『我當求之應太子妃。』",
        "translation": "Each of the five hundred Śākyas declared, 'I will ask for her as the prince's consort.'",
        "source": "T03n0186_003:0500a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其白淨王謂諸釋等：『今太子妃甚為難得，不知何女而可其意？』",
        "translation": "Then King Baekjeong addressed the commentators, saying, 'Now, the crown prince's consort is very difficult to obtain; I wonder what woman would meet his desire?'",
        "source": "T03n0186_003:0500a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆共集會思議此事，以語太子：『今當思惟。』",
        "translation": "They all assembled together to consider this matter and said to the prince, 'Now you must consider it.'",
        "source": "T03n0186_003:0500a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "却之七日菩薩心念：『吾不貪欲不宜處家，棄兜術來在此人間心無所慕，寂三昧定以權方便而試當之，勤親道場以無蓋哀而勸助之。』",
        "translation": "For seven days afterward, the bodhisattva thought, 'I don't crave or want to be at home, so I abandoned Tuṣita and came here among humans with no longing in mind, tried to match it with skillful means by being still in samādhi, and encouraged it with unhindered compassion by diligently visiting the site of enlightenment.'",
        "source": "T03n0186_003:0500a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「『王種興致敬，　　火生長蓮華；　　菩薩養有力，　　億載化甘露。",
        "translation": "He then spoke a verse, saying, 'The king's seed gives rise to homage, fire grows lotus flowers, and the bodhisattva nourishes and powers them, turning them into sweet dew for a hundred million years.",
        "source": "T03n0186_003:0500a21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　不捨興導味，　　無畏德真成；　　我心所慕樂，　　志無逸清淨。",
        "translation": "Not abandoning the taste that arouses guidance, the virtue of fearlessness is truly accomplished; my mind yearns for pleasure, and my aspirations are unadulterated and pure.",
        "source": "T03n0186_003:0500a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　菩薩本在欲，　　善化悉見妻；　　不安樂愛欲，　　棄害學功勳。』",
        "translation": "The bodhisattva's original desire is to skillfully teach all of his wives; he doesn't enjoy craving, so he discards harmful training and merit.'",
        "source": "T03n0186_003:0500a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩使上工師，立妙金像以書文字，假使女人德義形體面貌若斯，吾乃可之。",
        "translation": "\"The bodhisattva then had a master worker erect a marvelous gold image and write in script, 'Suppose a woman's virtues and meanings were such that her form and appearance were like this, then I would allow it.",
        "source": "T03n0186_003:0500a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不用凡庶，如吾所說乃應娉耳！",
        "translation": "We wouldn't need ordinary people, but as I've said, we would accept a woman's grace!",
        "source": "T03n0186_003:0500b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其色顏貌如紫磨金，內外相應身口不違，心淨如空安徐光光，不以放逸希言屢中，慈心無害奉敬道義，沙門梵志布施持戒，乃為我求不嫉無厭；志性仁賢不失時節，質直無諂專敬夫主，不懷他意恒無放恣；不在妊身不卒懷子，捐高自大事夫如婢；不嗜酒，不貪味，不慕聲，不愚冥，消無明根，知法住真諦；不輕舉，無有邪術，常懷慚耻；不惡口，不呪咀，常奉行法；身口意淨言行相應，心如下使多修慈愍；不挊頭首不在愚戇，無有恚恨在眾猶安而不迷惑，所作業善，敬於親友視如世尊；念彼如己，流長名稱，眾善普修，常奉恭恪。",
        "translation": "Her appearance is like purple polish gold, her body and speech aren't at odds with each other internally and externally, her mind is as pure as space, and she shines brightly.",
        "source": "T03n0186_003:0500b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是妻者爾乃可耳！",
        "translation": "Such a wife would be acceptable!",
        "source": "T03n0186_003:0500b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時白淨王聞菩薩言，告古梵志：『入迦夷衛遍周諸家，察好玉女誰有是德？",
        "translation": "\"It was then that King Baishen heard what the bodhisattva said and told the ancient priest, 'Who is this virtuous woman who enters Kāśyapīya and travels around to various houses to examine their beauty?'",
        "source": "T03n0186_003:0500b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "君子長者工師細民，有如是比功勳備乎？",
        "translation": "Is there such a thing as a good man who is an elder, a worker, a mentor, or a subordinate citizen, who is more than equal in merit?",
        "source": "T03n0186_003:0500b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若可太子乃可迎耳。",
        "translation": "If the prince is acceptable, then he can welcome him.",
        "source": "T03n0186_003:0500b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0186_003:0500b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子不好種姓唯樂德耳。』",
        "translation": "'The prince isn't good at caste but only enjoys virtue.'",
        "source": "T03n0186_003:0500b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是頌曰：「『君子梵志種，　　工師若細民；　　其有是德者，　　乃可娉取耳！",
        "translation": "He then spoke this verse, \"A gentleman of the noble race of priests and workers is like a small people; only someone with these qualities can be taken with open arms!",
        "source": "T03n0186_003:0500b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　不喜好種姓，　　太子為奇雅；　　有至誠功勳，　　心乃樂如是。』",
        "translation": "'He doesn't like castes, but the prince is rare and elegant; he has the utmost sincerity and honor, and his mind is pleased with this.'",
        "source": "T03n0186_003:0500b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時梵志聞是偈教，周旋遍行迦維羅衛家家占之，適入一家覩一玉女，端政殊好如天玉女，容色第一淨猶蓮華，不長不短不白不黑，不肥不瘦正得女容，類玉女寶。",
        "translation": "\"It was then that the priest heard this verse's teaching and went around from house to house in Kapilavastu, where he entered a house and saw a jeweled woman of exquisite appearance like a divine jeweled woman, with features as pure as a lotus flower, not long or short, not white or black, not fat or thin, and with the features of a perfectly proportioned woman, resembling the jeweled woman.",
        "source": "T03n0186_003:0500b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時其女禮古梵志，而問之曰：『梵志何求？』",
        "translation": "The woman then paid homage to an ancient priest and asked him, 'What does the priest seek?'",
        "source": "T03n0186_003:0500b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵志答曰：『其白淨王生真太子，端政無比相三十二，功德威神，自手書偈，形貌女相天人第一乃娉之耳！』",
        "translation": "The priest replied, 'The White Pure King gave birth to a true prince with thirty-two peerless forms, thirty-two attributes, and a dignified presence who wrote verses with her own hand and whose form and appearance were the best among gods and humans.",
        "source": "T03n0186_003:0500c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時彼女說此頌曰：「『梵志所宣偈，　　顯意所見色；　　梵志欲知之，　　我悉有是德。",
        "translation": "The woman then spoke this verse, \"That verse was pronounced by a priest, revealing the form that he sees; the priest wants to know about it, and I know that I have such qualities.",
        "source": "T03n0186_003:0500c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　宜應為我夫，　　端正最難比；　　白太子此事，　　勿與不肖會。』",
        "translation": "You should be my husband, whose rectitude is most difficult to match, and tell the prince about this, so he won't meet an unworthy person.'",
        "source": "T03n0186_003:0500c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「梵志聞之，還詣王所宣之如是：『天王省之，將無宜也為太子妃。』",
        "translation": "\"When the priest heard this, he returned to the king and announced it like this, 'The king of gods will reflect on this, saying that it would be inappropriate for her to be the prince's consort.'",
        "source": "T03n0186_003:0500c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：『誰女？』",
        "translation": "He asked, 'Who's the daughter?'",
        "source": "T03n0186_003:0500c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵志報曰：『執杖釋種家生。』",
        "translation": "The priest reported, 'Take the staff and explain the family's birth.'",
        "source": "T03n0186_003:0500c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王自念言：『太子形貌與世超異，面色清淨儻不可意，使自擇之。",
        "translation": "The king thought to himself, 'The prince's appearance is so different from the world's, and his face is so pure that it's quite unattractive; let him choose for himself.",
        "source": "T03n0186_003:0500c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "詣無憂堂皆集眾女，使太子身自己察之，菩薩自察悅者眼向。』",
        "translation": "When he visited the hall of no sorrow, he gathered a crowd of women and asked the prince to examine his own body, and the bodhisattvas themselves examined the eyes of those who were pleased with him.'",
        "source": "T03n0186_003:0500c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時白淨王，眾寶奇珍作好講堂，皆召羅衛上好妙女，會彼講堂。」",
        "translation": "\"At the time, King Baekjeong had a discussion hall prepared with all the treasures and wonders, and he summoned Lo Wei's finest and most beautiful women to assemble in the discussion hall.\"",
        "source": "T03n0186_003:0500c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語比丘：「於時菩薩往到講堂，坐仁賢床。",
        "translation": "The Buddha said to the monks, \"The bodhisattva then went to the discussion hall and sat on a bed of benevolence.",
        "source": "T03n0186_003:0500c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王遣使者：『菩薩所視顧妙悅者，即來告我。』",
        "translation": "The king sent an envoy, 'Tell me about this wonderful joy that the bodhisattva is looking after.'",
        "source": "T03n0186_003:0500c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩會諸婇女，時釋家女名曰俱夷，與諸婇女到菩薩所；却住一面諦視菩薩，目未曾眴。",
        "translation": "When the Bodhisattva met the women, the Śākyamuni woman named Kauṇḍinya and the women went to the Bodhisattva and stayed to one side to look at the Bodhisattva, whose eyes had never dazzled.",
        "source": "T03n0186_003:0500c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩普察即時欣笑，執持寶英以遺俱夷。",
        "translation": "The Bodhisattva then universally observed and smiled joyfully, took the jeweled heroine, and gave it to Khuki.",
        "source": "T03n0186_003:0500c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "俱夷報曰：『吾不貪慕眾寶瓔珞，當以功德自莊嚴身。』",
        "translation": "Kublai replied, 'I don't long for many precious jewels and jewelry; I will adorn myself with merit.'",
        "source": "T03n0186_003:0500c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子還室歎未曾有：『今此俱夷解世無常，不貪世榮。』",
        "translation": "The prince returned to his chamber and praised him as unprecedented, 'Now, Kuśinagara understands that the world is impermanent and doesn't crave worldly prosperity.'",
        "source": "T03n0186_003:0500c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王使者，往詣王所啟是本末：『向者太子意趣釋女俱夷。』",
        "translation": "The king's envoy then went to the king and revealed the source, 'The prince's intention was to explain the female Kukkuṭika.'",
        "source": "T03n0186_003:0500c23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞是語，遣梵志往，媒求此女為太子妃。",
        "translation": "When the king heard this, he sent a priest to match this woman with the crown prince's consort.",
        "source": "T03n0186_003:0500c24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時執杖釋種言：『我等本性有藝術者，乃嫁與女；太子有術，明知射御手博書數禮樂六藝備悉，乃與女耳。』",
        "translation": "The Śākya clan then carried the staff and said, 'We are by nature artistic people, so we'll marry her; the prince is skilled, knows archery, archery, hand skills, writing, counting, rituals, and music, and has all six arts, so he'll give her to the princess.'",
        "source": "T03n0186_003:0500c25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵志即還具啟白王。",
        "translation": "The priest then returned and fully revealed this to the king.",
        "source": "T03n0186_003:0500c28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王自念言；王以是法告於菩薩。",
        "translation": "The king thought to himself, 'The king told the bodhisattva this teaching.'",
        "source": "T03n0186_003:0500c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩啟王：『且止用是為求。』",
        "translation": "The bodhisattva then revealed to the king, 'Stop seeking with this.'",
        "source": "T03n0186_003:0500c29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『何以言止？",
        "translation": "The king said, 'Why do you say stop?'",
        "source": "T03n0186_003:0501a01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將無藝術乎？",
        "translation": "Will there be no art?",
        "source": "T03n0186_003:0501a01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "論其正法而言且止。』",
        "translation": "Let's stop there as far as the correct teaching is concerned.'",
        "source": "T03n0186_003:0501a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子報言：『所可應者皆能為耳。』",
        "translation": "The prince replied, 'Whatever is suitable, they'll do it.'",
        "source": "T03n0186_003:0501a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王問菩薩：『藝術云何？』",
        "translation": "The king asked the bodhisattva, 'What's the art?'",
        "source": "T03n0186_003:0501a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩曰：『此間寧有奇異妙術與我等乎？",
        "translation": "The bodhisattva said, 'How could there be such a wonderful, marvelous technique here with us?'",
        "source": "T03n0186_003:0501a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將來覩之。』",
        "translation": "I'll see them in the future.'",
        "source": "T03n0186_003:0501a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即時笑：『能現術乎？』",
        "translation": "The king then laughed, 'Can you show me the trick?'",
        "source": "T03n0186_003:0501a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩曰：『能！",
        "translation": "The bodhisattva said, 'Yes!",
        "source": "T03n0186_003:0501a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "請會一切諸釋親族，當共現術。』",
        "translation": "Please assemble all the Śākyas and their kinsmen, and they will all present their performance.'",
        "source": "T03n0186_003:0501a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王勅侍者：『遍令國中撞鍾擊鼓，却後七日太子現術；諸有藝術皆來集會。』",
        "translation": "The king commanded his attendants, 'Have the kingdom ring a bell and beat a drum, but for the next seven days the prince will present his performance; all the arts will come and assemble.'",
        "source": "T03n0186_003:0501a06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸釋親族七日之中，五百人會——藝術勝者以執杖釋女而娉與之；戲射手博最第一者當得是女——皆出城門。",
        "translation": "For seven days, 500 members of the Śākyas' clan assembled - the best in the arts who gave him a woman with a staff and the best marksman who competed best in archery - and they all left the city gates.",
        "source": "T03n0186_003:0501a08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是調達手執牽象來入城門，見諸釋集欲現其術，即以右手牽象頭，左手持鼻，撲捏殺之。",
        "translation": "Tathāgata then entered the city gate with a draft elephant in his hand, and when he saw the assembly of Śākyamunis who wanted to show their skills, he took the elephant's head with his right hand, held its trunk in his left hand, and punched and killed it.",
        "source": "T03n0186_003:0501a10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「于時難陀與諸等類，共出城門，見於大象當路而死，問：『誰殺乎？』",
        "translation": "\"Nanda and the others then left the city gates together, and when they saw the elephant dying in the road, they asked, 'Who killed it?'",
        "source": "T03n0186_003:0501a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『調達害之。』",
        "translation": "He answered, 'It's harmful to adjust.'",
        "source": "T03n0186_003:0501a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時牽移著于路側。",
        "translation": "He immediately dragged it to the side of the road and put it there.",
        "source": "T03n0186_003:0501a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時菩薩尋出城門，見此死象因往問曰：『誰殺此象？』",
        "translation": "Then the bodhisattva looked out the city gate and saw this dead elephant and went to ask, 'Who killed this elephant?'",
        "source": "T03n0186_003:0501a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "侍者答曰：『調達害之。』",
        "translation": "The attendant replied, 'It's harmed by the adept.'",
        "source": "T03n0186_003:0501a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復問：『誰復移之著于路側？』",
        "translation": "The bodhisattva then asked, 'Who else moved it and put it on the side of the road?'",
        "source": "T03n0186_003:0501a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『仁賢難陀也。』",
        "translation": "He answered, 'Good man, Nanda!'",
        "source": "T03n0186_003:0501a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『大佳，是象身大，如是臭爛普熏城內。』",
        "translation": "He answered, 'Great, that elephant's body is so large that its stench thoroughly penetrates the city.'",
        "source": "T03n0186_003:0501a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即右手接擲置城外，去壍極遠。",
        "translation": "He then picked it up with his right hand and threw it outside the city, far away from the hills.",
        "source": "T03n0186_003:0501a19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸天人無數百千，稱揚洪音皆言：『快哉，快哉！』",
        "translation": "Countless hundreds of thousands of gods and humans then spoke with a loud voice, saying, 'Yes, yes!'",
        "source": "T03n0186_003:0501a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空諸天，而讚頌曰：「『手執大白象，　　已死身至重；　　擲棄於城外，　　離壍極大遠。",
        "translation": "The sky celestials sang their praises, \"They carried a great white elephant in their hands, and it was the heaviest of bodies when it died; it was thrown away outside the city, far removed from the rest of the world.",
        "source": "T03n0186_003:0501a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　此必為至聖，　　平等離俗身；　　逮成一切智，　　以聖力常存。』",
        "translation": "Surely this must be the most noble person, equal in body and free from conventionality, who has attained omniscience and remains eternal by the power of the sages.'",
        "source": "T03n0186_003:0501a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時五百釋種宗族，皆至城門，在於寬處集會，欲現伎術。",
        "translation": "\"It was then that five hundred members of the Śākyas clan arrived at the city gates, assembled in a wide place, and wanted to perform tricks.",
        "source": "T03n0186_003:0501a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時白淨王與諸大力宗族諸釋，至現術處；時無數眾侍從菩薩欲觀其藝——斯釋宗族前見菩薩，在於書堂嗟歎宣說六十四種書，其師選友覩之甚怪謂未曾有，天上世間無有是術，諸鬼神、龍、阿須倫等無能逮，覩其藝術者此真聖人也，以度無極；一一解字，義理本末無一疑滯，其聞見是德過釋梵日月諸天，我等目覩道術如是，誰能過者——諸釋宗族報眾人曰：『菩薩雖入書堂，悉知書疏計校眾術，其見者尠。",
        "translation": "When King Baishen and the other great clans of Śākyamuni and the Śākyas arrived at the place where the techniques were to be shown, the countless multitudes of people who were waiting for the bodhisattva wanted to see his skill - these Śākyamuni clans had seen the bodhisattva in the study hall, admiring and expounding the sixty-four kinds of writings, and their teachers and chosen friends looked at them and wondered how they had never existed before, how there were no such techniques in the heavens or in the world, and how none of the demons, gods, dragons, or asuras could ever have surpassed them.",
        "source": "T03n0186_003:0501a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今會大眾一時來集，此中誠勝能為顯雅，眾人觀知為誰勝乎？』",
        "translation": "Now, when the whole assembly comes together at one time, this is really superior, and it shows elegance; who do you think is superior?\"",
        "source": "T03n0186_003:0501b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普曜經試藝品第十",
        "translation": "Tenth Chapter of the Samādhi-sūtra",
        "source": "T03n0186_003:0501b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時有大臣名曰炎光，釋中大臣也，計校算術最為第一，所度無極，王立此人：『汝且觀之，何所太子為最勝耶？』",
        "translation": "\"It was then that a minister named Yanguang, a minister of the Śākyas, was the best in arithmetic and had no limit to what he could do, and the king asked this man, 'Observe this, what prince is the best?'",
        "source": "T03n0186_003:0501b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時菩薩觀察諸釋及國王子，有數百人，一一擲戲不及菩薩。",
        "translation": "The bodhisattva then observed the hundreds of Śākyamunis and princes of the land, each of whom was tossing a play that fell short of the bodhisattva.",
        "source": "T03n0186_003:0501b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩報曰：『汝等且待，我當擲之。』",
        "translation": "The bodhisattva responded, 'Wait here, for I will toss them.'",
        "source": "T03n0186_003:0501b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時一王子來共擲戲，亦不能及；至五百人皆不能逮。",
        "translation": "Then a prince came along and tossed the game, but he couldn't reach them; up to five hundred of them couldn't reach them.",
        "source": "T03n0186_003:0501b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸會者舉聲歎曰：『若稱一辭至未曾有，況無數藝，所言殊特言辭談論不可究竟。』",
        "translation": "The assembled people then raised their voices and praised him, 'If you could say one thing that's unprecedented, how could you say countless things that are extraordinary and whose words and discourse are inexhaustible?'",
        "source": "T03n0186_003:0501b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "炎光大臣雖能計校，言談算術亦不能及。",
        "translation": "Even though Minister Yanguang could calculate and calibrate, his speech and arithmetic couldn't match it.",
        "source": "T03n0186_003:0501b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其迦維越樹木藥草，眾水渧數一一可知，摴蒲六博天文地理，八方異術天崩地動，一切諸術不比菩薩。",
        "translation": "He could tell about each of the trees and medicinal plants in Kapilavastu, the number of drops of water, astronomy and geography in Kumbhâṇḍa and the eight directions, and the heavens and earth, and all the arts are not comparable to those of a bodhisattva.",
        "source": "T03n0186_003:0501b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前知無窮却覩無極，六通三達誰能載乎？",
        "translation": "Who can contain the six supernormal powers and three comprehensions, knowing that the prior knows infinity but seeing infinity?",
        "source": "T03n0186_003:0501b22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸天人民虛空天神舉聲歎曰：『三界眾生心中所念，諸可思想善惡禍福，道俗眾事發意之頃，悉知本末無一懫礙，歌舞伎樂無事不博；以忍辱慈道力仁和，從百千劫所作輕便，獨遊三世猶如日光周旋四域，菩薩如是心無疑網。』",
        "translation": "\"The sky gods of the gods and people raised their voices and praised, 'The thoughts of the minds of sentient beings in the three realms, the conceptualizations of good and bad fortune and happiness, the awareness of pathological and mundane affairs, the thorough knowledge of their origins and derivatives, and the lack of obstruction in singing, dancing, playing, and music; with patience, kindness, and the strength and benevolence of the path, they've made light work for a hundred thousand eons and traveled alone through the three worlds like sunlight circling four regions, so the bodhisattva's mind has no web of doubt.'",
        "source": "T03n0186_003:0501b23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空之中諸天復歎：『是大丈夫無極至聖，汝等雖見在家所為；且聽我言，發意之頃，往來十方無數億國，皆來供養，亦復奉禮十方導師；雖現往來亦無周旋，汝等意謂神足何爾？",
        "translation": "Again, the gods in the sky praised him, 'Although you see this great man as the supreme sage and you see what you do at home, listen to me when I tell you that in the moment you arouse your intention, you'll go to countless millions of countries in ten directions, making offerings to them and also paying homage to the instructors in ten directions; even though you're going and coming, you're not going around, so what do you think of his miraculous abilities?'",
        "source": "T03n0186_003:0501b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰能覩知是無等倫獨行隻步？",
        "translation": "Who can see and know that this is an unequalled man walking alone?",
        "source": "T03n0186_003:0501c04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是之故，咸皆奉敬菩薩最勝。』",
        "translation": "For this reason, they all revere the bodhisattva as most excellent.'",
        "source": "T03n0186_003:0501c05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸釋報言：『能解是者，色欲皆淨一切本無。』",
        "translation": "The commentators replied, 'If someone understands this, then all forms and desires are purified, and they all originally exist.'",
        "source": "T03n0186_003:0501c05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是菩薩一意悉見覩其本末。",
        "translation": "With one mind, the bodhisattva then fully sees their origin and derivation.",
        "source": "T03n0186_003:0501c06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時諸釋族種姓悉共集會，欲試手搏。",
        "translation": "\"It was then that all the Śākyas and clans assembled together, wanting to test their hands.",
        "source": "T03n0186_003:0501c07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "調達在世常自貢高，自謂為可不肯折伏，常與菩薩共諍威力，一切來者覩之超異，右繞稽首歸禮大聖。",
        "translation": "Tathāgata, who had always held himself in high regard in the world and considered himself to be someone he wouldn't subdue, often fought with the bodhisattva about his authority, and all those who came saw how different they were, circled to their right, bowed their heads, and paid homage to the great sage.",
        "source": "T03n0186_003:0501c08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "調達及難陀故欲手搏，於時菩薩安隱詳序，愍念之故舉調達身，在於空中三反挑旋，菩薩大慈無所傷害，徐著地上使身不痛。",
        "translation": "Tathāgata and Nandanavana therefore wanted to hand-to-hand combat, but the bodhisattva, being calm and well-ordered, held up Tathāgata's body in sympathy and twirled it three times in the air, but the bodhisattva's great kindness didn't harm it and he slowly placed it on the ground so that it wouldn't hurt.",
        "source": "T03n0186_003:0501c10_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『卿等貢高不捨自大，咸皆來集，一時與我共行手搏，諸有伎藝悉來集會。』",
        "translation": "'You arrogant people who don't abandon themselves to greatness all come to gather here, and one by one, you'll perform hand-to-hand combat with me, and all of your skills will come to the assembly.'",
        "source": "T03n0186_003:0501c13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩勢力適以手觸自然墮地，時諸天人無數億千及虛空神，宣揚洪音讚言：『善哉！",
        "translation": "When the bodhisattva's strength was right and he naturally fell to the ground with his hand, gods and humans numbering in the hundreds of millions and gods of space proclaimed a loud voice, praising him, 'Good!",
        "source": "T03n0186_003:0501c15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩超絕無能及者。』",
        "translation": "There's nothing like a bodhisattva who transcends.'",
        "source": "T03n0186_003:0501c17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雨諸天華，異口同音而重讚曰：『假使十方一切眾生皆為力士，一時伏之，何況斯等。",
        "translation": "Raining down flowers from the gods, they spoke with one voice and repeatedly praised him, 'Suppose all the sentient beings in the ten directions were strong men and were subdued at once, how could it be possible for them to be like this?'",
        "source": "T03n0186_003:0501c18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩忍辱如須彌山，過於鐵圍無能動者，若以手持十方諸山，須臾碎之如塵如灰，何況凡夫；今顯此力不足為奇，是為俗力，未為道力最上第一。",
        "translation": "Bodhisattva's tolerance is like Mount Sumeru, which goes beyond an iron ring and can't be moved; if he were to hold mountains in his hand in ten directions, they would be crushed like dust and ashes in a moment, much less ordinary people; this shows that this power is not surprising, but it's mundane power that's not yet the greatest of the powers of the Way.",
        "source": "T03n0186_003:0501c20_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "降伏諸魔及與官屬，必當逮成無上正真之道，為最正覺，顯是功德菩薩最勝。』",
        "translation": "By subduing Māra and his officials, he will surely achieve the unsurpassed true path and become the most truly enlightened, which clearly shows that this is the bodhisattva's greatest merit.'",
        "source": "T03n0186_003:0501c23_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "執杖釋種，見於菩薩大德無量，擲象手搏當世少雙。",
        "translation": "The Śākya lineage holding the staff saw the bodhisattva's great virtue was immeasurable, and he threw an elephant in his hand and fought one of the few pairs in the world.",
        "source": "T03n0186_003:0501c25_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時國王及諸釋種，更欲試射。",
        "translation": "\"The king and the Śākyas then wanted to test the shot.",
        "source": "T03n0186_003:0501c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時調達竪四十里准，難陀准六十里，菩薩百里。",
        "translation": "The ordinand then made a 40-mile target, Nandanavana a 60-mile target, and the bodhisattva a 100-mile target.",
        "source": "T03n0186_003:0501c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時調達射中四十里鼓，不能得過；難陀六十里，亦不得越；執杖釋種亦四十里，皆不能過；於時持弓授於菩薩，菩薩張弓，弓即折破。",
        "translation": "The tamer then hit the drum 40 miles, but couldn't get past it; Nandha 60 miles, but couldn't get past it; and the Śākya seeds holding the staff also had 40 miles, but couldn't get past them; so he gave the bow to the bodhisattva, who opened it and broke it.",
        "source": "T03n0186_003:0501c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩又問：『於是城中寧有異弓任吾用不？』",
        "translation": "The bodhisattva then asked, 'Is there another bow in the city that I could use?'",
        "source": "T03n0186_003:0502a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即言：『有。』",
        "translation": "The king then said, 'There is.'",
        "source": "T03n0186_003:0502a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：『在何所？』",
        "translation": "He asked, 'Where is it?'",
        "source": "T03n0186_003:0502a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『昔吾祖父名曰師子，所執用弓奇異無雙，身沒之後無能用者，著於天祠。』",
        "translation": "The king said, 'My grandfather was named Shizi, and the bow he used was marvelous and peerless. After his body disappeared, there was no one who could use it, and it was placed in the celestial shrine.'",
        "source": "T03n0186_003:0502a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時菩薩言：『便可持來。』",
        "translation": "The bodhisattva then said, 'Then you can bring it to him.'",
        "source": "T03n0186_003:0502a06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持來授之，執杖釋種一切諸釋無能張者；以授菩薩，菩薩在坐以手捺張，抨弓之聲悉聞城內，百千國人虛空天子，舉聲嗟歎而說頌曰：「『不起于座上，　　即時張此弓；　　如是具諸願，　　必逮成天尊。』",
        "translation": "He brought it to him, gave it to the bodhisattva, and when he sat down and opened it with his hand, the sound of the bow being struck was heard throughout the city, and hundreds of thousands of gods in the sky raised their voices in admiration and spoke in verse, saying, 'Stand up from your seat and instantly open this bow; with these vows, you will surely become a celestial honored one.'",
        "source": "T03n0186_003:0502a06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩執弓注箭，即時放撥，中百里鼓而穿壞之；箭沒地中踊泉自出，箭便過去中鐵圍山，三千大千剎土六反震動，一切諸釋怪未曾有。",
        "translation": "\"The bodhisattva then takes the bow and fills it with arrows, immediately releases them, and they hit a drum a hundred miles deep and penetrate it; the arrows plunge into the ground and spring forth spontaneously, and then they pass over and hit a mountain of iron, shaking three thousand great thousand bases and lands six times, and all the explanations are unprecedented.",
        "source": "T03n0186_003:0502a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空諸天咸嗟歎言：『至未曾有，如是妙術清淨至真，諸菩薩中最為殊特。』",
        "translation": "The gods of the sky all praised them, saying, 'It's unprecedented, for such a marvelous technique is pure and true, and it's the most extraordinary of the bodhisattvas.'",
        "source": "T03n0186_003:0502a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於斯執杖釋種以女俱夷送詣白淨王宮，為菩薩妃；隨世習俗現相娛樂，婇女八萬四千，俱夷為尊。",
        "translation": "The Śākyas then carried the staff and sent their daughter Kauṇḍinya to the palace of the White Pure King to be the bodhisattva's consort, who entertained him according to worldly customs and had 84,000 women, with Kauṇḍinya as the honored one.",
        "source": "T03n0186_003:0502a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時妃俱夷無增減心，臥常覺寤初不睡眠，在於燕室寂寞思惟：『將無捨我耶？』",
        "translation": "The princess Kauṇḍinya had no thoughts of increase or decrease, and when she lay down, she was always awake and didn't sleep at first.",
        "source": "T03n0186_003:0502a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婇女侍衛恒圍繞之。」",
        "translation": "They're constantly surrounded by female attendants.\"",
        "source": "T03n0186_003:0502a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是頌曰：「數千人侍身，　　思惟尊在不；　以威德至誠，　　處中猶在火。",
        "translation": "They then spoke, \"Thousands of people attend on their bodies, thinking, 'Is the venerable present?' Because of his authoritative qualities and supreme sincerity, he remains in the midst of fire.",
        "source": "T03n0186_003:0502a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常思護諸根，　　其意不樂餘；　如日震光明，　　不用無數問。",
        "translation": "Always thinking to guard their faculties, their intentions aren't to be displeased with anything else, and like the sun shining brightly, they don't need to ask countless questions.",
        "source": "T03n0186_003:0502a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩在宮婇女之間，開化訓導八萬四千女，發無上正真道意，逮不退轉。",
        "translation": "\"While in the palace among the women, the bodhisattva enlightened and instructed 84,000 women to give rise to the unsurpassed true intention of the path and to acquire irreversibility.",
        "source": "T03n0186_003:0502a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時兜術有天子，名曰應出家，於無上正真道意而不退轉，三萬二千天眷屬圍繞，往詣菩薩所止宮殿，住虛空中，因說偈言：「『人師子見生，　　沒來忍名聞；　　隨俗在中宮，　　在世多教化。",
        "translation": "At the time, a god named Renunciant from Tuṣita, who had the unsurpassed true intention for the path and didn't turn back, was surrounded by 32,000 members of the celestial family, went to the palace where the bodhisattva was staying, and stayed in the sky as he spoke a verse, saying, 'The teacher of men sees birth, forbears fame and renown, follows the commonplace in the middle palace, and teaches much in the world.",
        "source": "T03n0186_003:0502a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　訓無數天人，　　雖在於世俗；　　今日正是時，　　應當出家去。",
        "translation": "Although countless gods and humans are taught to be worldly, today is the right time for them to leave home.",
        "source": "T03n0186_003:0502b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　眾縛未得解，　　不貪人見道；　　當究所應度，　　為盲冥現路。",
        "translation": "Not desiring the path of human views when their bonds have yet to be freed, they should investigate what should be saved and make the path blind and unseen.",
        "source": "T03n0186_003:0502b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　俗慕妻子財，　　榮祿諸所有；　　見尊學習之，　　必當放出家。",
        "translation": "The worldly person looks for the wealth of wives and the possessions of riches, but when they see a venerable person and study them, they'll surely be set free from home.",
        "source": "T03n0186_003:0502b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　棄四域七寶，　　娛樂尊豪位；　　以見出家業，　　遊行師子座。",
        "translation": "They abandon the four realms and seven treasures, entertain the noble position, and wander the lion's seat because they see what it takes to leave home.",
        "source": "T03n0186_003:0502b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　即知行安隱，　　不樂諸愛欲；　　生來以大久，　　得道為天人。",
        "translation": "He then knows that he's practicing tranquility, doesn't delight in desires, and was born long ago to attain the path of a celestial.",
        "source": "T03n0186_003:0502b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　稽首為歸命，　　猶如山河水；　　當出家為佳，　　常興殊勝行。",
        "translation": "He bows his head in homage, just like a mountain river, and preferably leaves home to always carry out outstanding activities.",
        "source": "T03n0186_003:0502b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　金色雖妙好，　　端政最第一；　　興光應捨國，　　宜益諸天人。",
        "translation": "Though gold is marvelous and beautiful, it's the best in terms of proper government, and it's a good way to bring light to countries that should be abandoned and to benefit gods and humans.",
        "source": "T03n0186_003:0502b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　不以樂五欲，　　可致於差特；　　聖慧能充滿，　　度世賢聖業。",
        "translation": "Not by delighting in the five desires can he attain distinction, and holy wisdom can fill him with noble actions that will save the world.",
        "source": "T03n0186_003:0502b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　尊意所慕樂，　　白淨王宮中；　　澍捨如蓮華，　　思惟當棄去。",
        "translation": "Their honorable intentions are to admire their pleasures, and they are to be found in the palace of the white pure king; they are to be abandoned like lotus flowers, which they contemplate should be discarded.",
        "source": "T03n0186_003:0502b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　塵勞當熾盛，　　應離諍於獄；　　仁威為無上，　　速立解脫道。",
        "translation": "Their worldly sufferings will become raging, and they'll be freed from strife in prison; their benevolence is unsurpassed, and they'll quickly establish the path to liberation.",
        "source": "T03n0186_003:0502b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　仁了慧界久，　　覩眾生疾患；　　以法為醫藥，　　建立泥洹安。",
        "translation": "He has long understood the realm of wisdom, sees the illnesses and sufferings of sentient beings, and uses the Dharma as medicine to establish the peace of nirvāṇa.",
        "source": "T03n0186_003:0502b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　為消盲冥路，　　縛癡種邪網；　　疾化諸天人，　　施智慧道目。",
        "translation": "To remove the blind and dark paths and the webs of delusion, he quickly transforms gods and humans and gives them the eye of the path of wisdom.",
        "source": "T03n0186_003:0502b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　顯示無央數，　　天龍須倫神；　　已得成佛道，　　還聞無上法。",
        "translation": "He reveals an incalculable number of gods and dragons, the gods of Surun, who have attained the Buddha Way and have heard the unsurpassed Dharma again.",
        "source": "T03n0186_003:0502c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　以濟禽獸王，　　其光照宮殿；　　降伏往稽首，　　及令四天王。",
        "translation": "He helps the king of birds and beasts, whose light shines in his palace, subdues them, makes them bow down, and causes the four heavenly kings to return.",
        "source": "T03n0186_003:0502c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　普為惟歸伏，　　當欲奉四鉢；　　成佛得所願，　　梵天行寂然。",
        "translation": "They universally subdue them, want to serve them with four bowls, and attain the Buddhahood they desire, while the Brahma gods practice tranquility.",
        "source": "T03n0186_003:0502c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　觀慈大愍哀，　　勸助人中尊；　　喜護於一切，　　轉無上法輪。",
        "translation": "He observes kindness and great pity, encourages and assists the most venerable among men, delights in and protects them all, and turns the unsurpassed Dharma wheel.",
        "source": "T03n0186_003:0502c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　已得至佛道，　　坐於佛樹下；　　觀察極名稱，　　當覩覺成道。",
        "translation": "Having attained the buddha path, he sits under the buddha tree, observes its full name, and sees the awakening to the path.",
        "source": "T03n0186_003:0502c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　及餘諸菩薩，　　宮中見造議；　　為眾普告首，　　為眾最後安。",
        "translation": "The other bodhisattvas who were present in the palace created an argument, which was universally addressed to the crowd and ultimately made peace for them.",
        "source": "T03n0186_003:0502c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　已宣柔軟音，　　念定光受決；　　至誠無虛妄，　　暢最勝音響。』」",
        "translation": "Having proclaimed a gentle voice, his mindfulness is determined by the light of concentration; perfectly sincere and without falsity, he unleashes the most excellent sound.'\"",
        "source": "T03n0186_003:0502c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普曜經四出觀品第十一",
        "translation": "Puyao jing si chugou guan pin diyi",
        "source": "T03n0186_003:0502c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「時諸天人勸發菩薩，父王白淨寐夢覩見菩薩出家，樂於寂然諸天圍繞；又見剃頭身著袈裟。",
        "translation": "The Buddha told the monks, \"It was then that the gods encouraged the bodhisattva, and the father, in a dream, saw the bodhisattva leaving home, happy and calm, surrounded by gods, and saw his head shaved and wearing a reddish-brown robe.",
        "source": "T03n0186_003:0502c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時從夢覺，即遣人問：『太子在宮不？』",
        "translation": "When he awoke from his dream, he sent someone to ask, 'Is the prince in the palace?'",
        "source": "T03n0186_003:0502c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "侍者答曰：『太子在耳。』",
        "translation": "The attendant replied, 'The crown prince is here.'",
        "source": "T03n0186_003:0502c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時白淨王入太子宮，『今觀太子必當出家。",
        "translation": "Then King Baekjeong entered the prince's palace and said, 'Now, I see that the prince will surely leave home.",
        "source": "T03n0186_003:0502c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0186_003:0502c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我於今所見變應。』",
        "translation": "Just like what I've seen now in response to the transformation.'",
        "source": "T03n0186_003:0502c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心自念言：『太子將無欲行遊觀？",
        "translation": "He thinks to himself, 'Will the prince practice meditation without desire?'",
        "source": "T03n0186_003:0502c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當勅四衢嚴治道路，學調伎樂普令清淨，却後七日太子當出，使道平正莫令不淨，勿使見非諸不可意。』",
        "translation": "I command that the roads in the four quadrants be tightly disciplined, that music and dance be trained, and that the prince emerge seven days later, so that the path is level and straight and not impure, and that he doesn't allow anything to be seen that's not agreeable.'",
        "source": "T03n0186_003:0502c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時受教皆當如法，嚴治已竟懸繒幡蓋，兵眾圍繞導從前後。",
        "translation": "Immediately after receiving instruction, he should follow the teaching, decorate the roads with silken banners and flags, and surround himself with soldiers who will guide him from front to back.",
        "source": "T03n0186_003:0502c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩出東城門，菩薩威聖之所建立，於時諸天化作老人，頭白齒落目冥耳聾，短氣呻吟執杖僂步住於中路，菩薩知之故復發問：『此為何人？",
        "translation": "\"When the bodhisattva left the eastern city gate, where the bodhisattva's authority and holiness had been established, the gods transformed into an elderly man with a white head and missing teeth, deafened eyes and ears, short of breath and groaning, holding a staff and walking down the middle, and the bodhisattva knew it and asked, 'Who is this man?'",
        "source": "T03n0186_003:0502c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頭白齒落羸瘦乃爾。』",
        "translation": "'So it is when your head is white and your teeth fall out and you're thin.'",
        "source": "T03n0186_003:0503a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "御者答言：『是名老人，諸貌已盡形變色衰，飲食不化氣力虛微，命在西垂餘壽無幾，故曰老矣。』",
        "translation": "The monk replied, 'This is called an old man whose features have been exhausted, whose appearance has changed and decayed, whose diet hasn't transformed, whose energy is weak, and whose life is dying in the west with few years left, so he's called old.'",
        "source": "T03n0186_003:0503a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩即曰：『是則世法而有此難？",
        "translation": "The bodhisattva then said, 'Is this a problem with the world's laws?'",
        "source": "T03n0186_003:0503a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生皆有斯患？",
        "translation": "Do all sentient beings suffer from this?",
        "source": "T03n0186_003:0503a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人命速駛猶山水流，宿夜逝疾難可再還，老亦然矣，不亦苦哉。』",
        "translation": "A person's life quickly disappears like a mountain current, and it's difficult to return from a night that's gone by quickly; old age is no different, isn't it also painful?'",
        "source": "T03n0186_003:0503a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一心專精思惟正義。",
        "translation": "He focused his mind and concentrated his thoughts on what's right.",
        "source": "T03n0186_003:0503a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "御者答曰：『不獨此人遇苦患也，天下皆爾，俗之常法，聖尊父母親里知識，皆致此老，咸同是業。』",
        "translation": "The monk replied, 'This person isn't the only one who experiences pain and suffering; the whole world is like this, and it's a commonplace practice that the noble ones, parents, relatives, and friends all suffer from old age and share this action.'",
        "source": "T03n0186_003:0503a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩時曰：『不解句義愚人自大，不覺老至自沒塵埃，便可迴還，用是五樂不益於事。』",
        "translation": "The bodhisattva then said, 'A foolish man who doesn't understand the meaning of this sentence is arrogant and doesn't realize that old age will reach its own disappearance and he'll be able to return, and using these five pleasures won't help matters.'",
        "source": "T03n0186_003:0503a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自覩如幻、空中之電，還入宮中思惟經典愍念十方，宜以法藥必療治之。",
        "translation": "He saw himself as an illusion, a flash of lightning in the sky, went back into the palace, considered the sutras, and was mindful of the ten directions that it would be appropriate to treat him with the medicine of the Dharma.",
        "source": "T03n0186_003:0503a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩後日復欲出遊，王勅外吏嚴治道路，去諸不淨。",
        "translation": "\"When the bodhisattva wanted to travel again the day after that, the king ordered the outer officials to tightly control the roads and remove any impurities.",
        "source": "T03n0186_003:0503a13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩駕乘出南城門，復於中路見疾病人，水腹身羸臥于道側，氣息張口命將欲絕。",
        "translation": "As he drove out of the southern city gate, the bodhisattva again saw a sick man in the road, lying beside the road with a watery stomach and a weak body, his breath open and his life about to end.",
        "source": "T03n0186_003:0503a14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩知之故復發問，告御者曰：『此為何人？』",
        "translation": "Knowing this, the bodhisattva again asked a question and told the imperial servant, 'Who is this man?'",
        "source": "T03n0186_003:0503a16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "御者曰：『此名病人，已至死地命在須臾，骨節欲解餘壽如髮。』",
        "translation": "The monk said, 'This is called a sick person who has reached the stage of death and whose life is in a moment's notice and whose bones are about to dissolve and whose remaining life is like a hair.'",
        "source": "T03n0186_003:0503a17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩即曰：『萬物無常有身皆苦，生皆有此何得免之。",
        "translation": "The bodhisattva then said, 'All things are impermanent, and all bodies are painful; how can birth be exempt from this?",
        "source": "T03n0186_003:0503a19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾身不久亦當然矣，不亦痛乎。",
        "translation": "It's certainly true that my body will soon be painful, isn't it?",
        "source": "T03n0186_003:0503a20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有身有苦，無身乃樂。』",
        "translation": "To have a body is painful; to have no body is pleasant.'",
        "source": "T03n0186_003:0503a21_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即還入宮。",
        "translation": "He then returned to the palace.",
        "source": "T03n0186_003:0503a21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復於異日報王遊觀，王勅外吏嚴治道路。",
        "translation": "\"After another excursion to the king's palace, he ordered the outer officials to strictly control the roads.",
        "source": "T03n0186_003:0503a21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子乘駕出西城門，見一死人著于床上，家室圍繞舉之出城，涕淚悲哭椎胸呼嗟，頭面塵垢淚下如雨：『何為棄我獨逝而去？』",
        "translation": "The crown prince drove out of the western city gate and saw a dead man lying on a bed, surrounded by his family as they carried him out of the city, weeping and mourning, lamenting his chest, his head covered in dust, and tears raining down like rain: 'Why did you abandon me and die alone?'",
        "source": "T03n0186_003:0503a22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩知之而復問曰：『此為何人？』",
        "translation": "Knowing this, the bodhisattva again asked, 'Who is this person?'",
        "source": "T03n0186_003:0503a25_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "御者答曰：『此是死人。",
        "translation": "The imperial tutor replied, 'This is a dead person.",
        "source": "T03n0186_003:0503a26_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人生有死猶春有冬，身沒神逝宗家別離，人物一統無生不終。』",
        "translation": "Man has death just like spring and winter, his body disappears, his spirit passes away, his clan is separated, and his person is unified, has no birth, and doesn't end.'",
        "source": "T03n0186_003:0503a27_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩答曰：『夫死痛矣，精神懅矣，生當有此老病死苦，莫不熱中迫而就之，不亦苦乎！",
        "translation": "The bodhisattva replied, 'When death is painful and the spirit is frightened, birth will have the pain of old age, illness, and death, and nothing is more painful than being forced to adapt to it in the heat of it!'",
        "source": "T03n0186_003:0503a28_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾見死者，形壞體化而神不滅，是故聖人以身為患，而愚者寶之至死無厭。",
        "translation": "I've seen the dead, whose bodies are destroyed and transformed but whose spirits don't cease, so the noble man takes trouble with his body, but the foolish treasure it until death.",
        "source": "T03n0186_003:0503b01_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾不能復以死受生，往來五道勞我精神。』",
        "translation": "I can't take birth again because of death; the five destinies have labored my spirit in the past.'",
        "source": "T03n0186_003:0503b03_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便迴車還，思度十方。",
        "translation": "He then turned back in his chariot and contemplated the ten directions.",
        "source": "T03n0186_003:0503b04_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復於異日，報王出遊。",
        "translation": "\"On another day, he reported to the king for a trip.",
        "source": "T03n0186_003:0503b05_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出北城門，見一沙門，寂靜安徐淨修梵行，諸根寂定目不妄視，威儀禮節不失道法，衣服整齊手執法器。",
        "translation": "When he left the northern city gate, he saw an ascetic, calm and collected, cultivating the pure religious practice, with his faculties calm and collected, his eyes not deludedly gazing, his manner and decorum not failing to follow the path, and his hands neatly dressed and holding a Dharma container.",
        "source": "T03n0186_003:0503b05_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩問之：『此為何人？』",
        "translation": "The bodhisattva asked him, 'Who is this person?'",
        "source": "T03n0186_003:0503b08_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "御者答曰：『此名比丘，以棄情欲，心意寂然猶如太山，不可傾動；難污如空，屈伸低仰不失儀則；心如蓮華悉無所著，亦如明珠六通清徹，無一蔽礙，慈愍一切欲度十方。』",
        "translation": "The monk replied, 'This is called a monk who has abandoned passions and desires and whose mind is as still as Mt. Tai, which cannot be tilted; whose mind is as undefiled as space, which bends and stretches and lowers without losing its decorum; whose mind is like a lotus flower that has no attachments whatsoever, and like a bright pearl whose six powers are clear and penetrating, without a single obstruction; and who has compassion for all and desires to cross over to the ten directions.'",
        "source": "T03n0186_003:0503b08_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩即言：『善哉！",
        "translation": "The bodhisattva then said, 'Good!",
        "source": "T03n0186_003:0503b12_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯是為快，是吾所樂，心意寂靜自愍度彼，善業快利成甘露果。』」",
        "translation": "'Only this is pleasant, which I enjoy, and I pity myself in passing over them with quiescence of mind, which quickly produces the fruit of ambrosia from good actions.'\"",
        "source": "T03n0186_003:0503b13_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「父王白淨觀菩薩行，見聞如是，不慕世榮心如虛空，而懷怖懅畏之出家；宿夜將護，高其牆壁深掘諸壍；更立城門，門開閉聲聞四十里；立諸宿衛勇猛之士，被鎧執仗於四城門，皆勅眾兵勿有遺漏，將無太子捨吾出家，於其宮裏亦宿衛之；益眾伎女婇女娛樂，令太子悅不懷憂感。",
        "translation": "The Buddha told the monks, \"When he sees and hears this, the father explains that the bodhisattva's practice is pure, doesn't admire worldly prosperity, and has a mind like space; he leaves home with fear and trepidation; he guards the city night after night, raises its walls and digs deep into the hills; he erects a city gate that's opened and shut, and the sound is heard for 40 miles; he appoints guards of valor, armor and weapons, and commands his soldiers not to leave anything behind; he leaves home without the prince, and he guards his palace; he entertains his ladies and women, so that the prince won't be sad and troubled.",
        "source": "T03n0186_003:0503b14_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又其菩薩宿積智德，在胎中時威神吉祥；夢中所見功勳大祚，十方自然有蓋悉覆三界；還得安隱，開化一切滅諸惡趣；於四衢路有四色鳥，變為一色；見諸不淨，經行其上而不污足；又有大水汎汎盈溢，眾生欲渡而不能越，心懷恐怖即過渡之；見無數人皆被疾病無有醫藥，即為療治無央數疾，使無諸痛；自見其身坐師子床，天人在上叉十稽首；見在戰鬪降伏怨敵，無數諸天在空中侍，真正聖人夢中見此，清淨吉祥行正具足；天人聞之，心懷悅豫，不久成道為天人尊。",
        "translation": "「又其菩薩宿積智德，在胎中時威神吉祥；夢中所見功勳大祚，十方自然有蓋悉覆三界；還得安隱，開化一切滅諸惡趣；於四衢路有四色鳥，變為一色；見諸不淨，經行其上而不污足；又有大水汎汎盈溢，眾生欲渡而不能越，心懷恐怖即過渡之；見無數人皆被疾病無有醫藥，即為療治無央數疾，使無諸痛；自見其身坐師子床，天人在上叉十稽首；見在戰鬪降伏怨敵，無數諸天在空中侍，真正聖人夢中見此，清淨吉祥行正具足；天人聞之，心懷悅豫，不久成道為天人尊。",
        "source": "T03n0186_003:0503b21_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎「於是菩薩即作此念：『假使我身不見辭王而出家者，便為不應。』",
        "translation": "â€œSo the bodhisattva then had this thought, 'Suppose I didnâ€™t see myself resigning from the king and left home, then I wouldnâ€™t have done it.â",
        "source": "T03n0186_003:0503c04_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則時靜夜自出宮室入王宮殿，悉觀殿堂而無所畏，光明悉照遠近。",
        "translation": "Then, during the quiet night, he left his palace and entered the king's palace, observing the hall without fear and shining a bright light that shone both near and far.",
        "source": "T03n0186_003:0503c06_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王覺見光，即時遣人觀四城門，將無出去，何故大光明照遠近？",
        "translation": "When the king realized the light, he immediately sent someone to look around the four gates of the city, for there would be no going out; why does that great light shine far and near?",
        "source": "T03n0186_003:0503c07_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "侍者來白：『天尚未曉日亦未出，自然光明照諸牆壁樹木，飛鳥鳧鴈孔雀鴛鴦相和而鳴，方欲向明；是光第一，柔軟安隱清涼和雅，牆壁樹木永無有影。』",
        "translation": "The attendant came and said, 'Before it's dawn and the sun is out, a natural light shines off the walls and trees, and birds of prey, ducks, peacocks, and mandarin ducks sing in unison as they're about to reach the light; this light is the greatest, so soft, peaceful, cool, and elegant that the walls and trees are permanently without shadow.'",
        "source": "T03n0186_003:0503c09_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至德於是在彼思惟，觀於四方坐見牕牖。",
        "translation": "Caitra then was thinking about it, looking around, sitting, and seeing the windows and doors.",
        "source": "T03n0186_003:0503c12_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時有諸天人，即起欲去不得自在，顧省其父知之覺起，立啟：『父王！",
        "translation": "\"At the time, some celestials rose up, wanted to leave, and couldn't find their own way.",
        "source": "T03n0186_003:0503c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿懷愁慼，勿以遠慮；諸天勸助今應出家，唯忍過罪安己護國。』",
        "translation": "Don't be sad, don't think longingly about it; the gods will encourage you to leave home now, but tolerate transgressions and protect your country.'",
        "source": "T03n0186_003:0503c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父母聞之悲泣垂淚，而問之曰：『何所志願？",
        "translation": "When his parents heard this, they wept and sobbed, and asked him, 'What do you wish?'",
        "source": "T03n0186_003:0503c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何時能還？",
        "translation": "When will it be possible to return it?",
        "source": "T03n0186_003:0503c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與吾要誓普施志願，吾以年朽家國無嗣。』",
        "translation": "'I want to vow to give my family and country a vow, for I've aged and have no heir.'",
        "source": "T03n0186_003:0503c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩即時以柔軟辭而啟王言：『欲得四願，假使聽我還得自在；得是願後不復出家。",
        "translation": "The bodhisattva then spoke softly and revealed to the king, 'I want to attain the four vows, and if you listen to me, I'll be able to return to my freedom; after I attain these vows, I won't leave home again.",
        "source": "T03n0186_003:0503c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為四：一者、欲得不老，二者、至竟無病，三者、不死，四者、不別；神仙五通雖住一劫不離於死，假使父王與此四願，不復出家。』",
        "translation": "What are the four: first, that I might not grow old, second, that I might not become ill after finishing, third, that I might not die, and fourth, that I might not be separated; even though the five supernormal powers of the immortals last an eon and don't lead to death, suppose the king granted these four vows and didn't leave home again.'",
        "source": "T03n0186_003:0503c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞重悲：『此四願者古今無獲，誰能蠲除此四難者？",
        "translation": "The king was gravely compassionate when he heard this, 'These four vows have never been attained in the past or present; who could remove these four difficulties?'",
        "source": "T03n0186_003:0503c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子如師子勸助愍哀，普度眾生具足如意，所願者得。』",
        "translation": "'Son, suppose the lion encourages, assists, and sympathizes with all sentient beings, fully accomplishing what he wishes.'",
        "source": "T03n0186_003:0503c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是菩薩自出宮殿，一心住立無有覩見往來周旋。",
        "translation": "The bodhisattva then left the palace on his own and stayed there with one mind, seeing nothing and going around.",
        "source": "T03n0186_003:0503c27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時父王明旦即起，朝會諸釋以是告之：『太子必出捨國學道，當何施計？』",
        "translation": "\"At the time, the father rose at sunrise, and the courtiers and scholars told him, 'The prince will leave his country to train on the path, so what will he do?'",
        "source": "T03n0186_003:0503c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸釋答曰：『當勤將護。",
        "translation": "The commentators replied, 'You must diligently guard it.'",
        "source": "T03n0186_003:0504a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0186_003:0504a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸釋部黨眾多無極，雖復力強何能獨出。』",
        "translation": "'The members of the Śākyas are numerous and limitless, but even though they are strong, how could they stand out on their own?'",
        "source": "T03n0186_003:0504a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時白淨王，勅五百釋勇多力者，有方便計，使五百兵普學諸術，令大力士住守東城門宿衛菩薩；一一釋者從五百兵，一一車乘五百人從宿衛菩薩，四門俱然；諸四街路里巷諸門亦復俱然；父王己身與五百釋前後圍繞，象馬車乘住己宮門，晝夜不眠。",
        "translation": "King Baekjeong then commanded 500 Śākyamunis who were brave and powerful to have a skillful plan, cause 500 soldiers to learn all the techniques, and have the powerful men guard the bodhisattva at the eastern city gate; each Śākyamuni followed the 500 soldiers, and each chariot carriage carried 500 people to guard the bodhisattva at the four gates, and so did the gates of the four streets, lanes, and alleys; the father himself was surrounded by 500 Śākyamunis in front and behind, and he stayed awake day and night at his palace gate with elephant and horse chariots.",
        "source": "T03n0186_003:0504a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時大愛道自告侍從：『宿夜然燈燒香勿得眠寐。",
        "translation": "\"At the time, the great beloved Way told his attendants, \"Don't sleep when you burn a lamp and incense all night long.",
        "source": "T03n0186_003:0504a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今者離垢不樂在宮，必欲出家，悉共遮護勿得使去，作諸伎樂令心樂之。",
        "translation": "Now, since he's free of impurity and doesn't like being in the palace, he must want to leave home, so he'll guard them all together and prevent them from leaving, and he'll create various plays to make his mind happy.",
        "source": "T03n0186_003:0504a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "堅閉門戶勿令妄開，嚴諸繒幡彫飾牕牖，林樹果實悉令目覩；假使欲去，慕樂此供或能不出。』」",
        "translation": "They should firmly close their doors and keep them shut, decorate their windows with silken banners and carvings, and let their eyes see the fruit of the forest; even if they want to leave, they might still be able to escape if they admire this offering.'\"",
        "source": "T03n0186_003:0504a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「是時二十五鬼神將軍及般闍鬼將軍，鬼子母五百子等，悉共集會各各議言：『今日菩薩棄國捐家，我等咸共侍從供養。』",
        "translation": "The Buddha told the monks, \"At the time, twenty-five generals of demons, five hundred sons of the general of the demon Prajñā, and the mothers of the demons all assembled together and said, 'Today, the Bodhisattva renounced his country and left his family, so we all serve and make offerings.'",
        "source": "T03n0186_003:0504a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又四天王一時普告諸鬼神：『今日菩薩棄國捐王，汝等慇懃侍從供養。』",
        "translation": "The four heavenly kings then addressed the demons universally, 'Today, the bodhisattva has renounced his country and given up his kingdom, and you are all kind enough to serve and make offerings to him.'",
        "source": "T03n0186_003:0504a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其鬼神眾皆從五兵，勢力堅強猶如金剛不可毀壞，精進勇猛將護眾生，其身高大如須彌山，將無惡物犯於至德。",
        "translation": "Those demons, all of whom are from the five armies, are as strong as indestructible adamantine, vigorous, and will protect sentient beings, and their bodies are as tall as Mount Sumeru, which will cause no evil thing to offend the supreme virtues.",
        "source": "T03n0186_003:0504a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋、梵、炎天，兜術天、無慢天、化自在天，各勅官屬，無數百千前後導從，華香伎樂香汁灑地侍從菩薩，釋梵天王侍其左右。",
        "translation": "The Śākya, Brahmā, and Nirmāṇarati gods, the Tuṣita Heaven, the Nirmāṇarati Heaven, and the Nirmāṇarati Heaven each sent their officers and followers with hundreds of thousands of flowers, music, music, and perfume to the ground to attend the bodhisattva, and the Śākya and Brahmā gods were at his right and left.",
        "source": "T03n0186_003:0504a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時有天子名曰寂意：『我當將護迦維越國，一切男女大小勸安和之。』",
        "translation": "\"Then there was a god named Quiescent Mind, 'I will protect the country of Kapilavastu and encourage the peaceful coexistence of all men and women, large and small.'",
        "source": "T03n0186_003:0504a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又有天子名曰光音，即自說言：『我身當化一切象馬車乘男女所暢音聲沒使不聞，令心寂靜而無所念。』",
        "translation": "Then there was a god named Radiant Voice who said to himself, 'I myself will transform all the sounds made by elephants, horses, chariots, and men and women into sounds that won't be heard and that will calm the mind and make it think of nothing.'",
        "source": "T03n0186_003:0504a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有天子名曰清淨：『我在虛空立七較輅，懸垂一切日月明珠照燿光光，設繒幡蓋散花燒香，嚴治塗路侍從菩薩。』",
        "translation": "There's another god named Jingjing, 'I'll set up seven trays in the sky, suspend all the bright pearls of the sun and moon that shine brightly, place silken banners and shrouds, scatter flowers and burn incense, and decorate the roads with graffiti to attend the bodhisattvas.'",
        "source": "T03n0186_003:0504b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伊羅末龍王言：『我當化作三萬八千里交露之車，使諸玉女皆坐其上，作眾伎樂侍從菩薩，而供養之。』",
        "translation": "The king of the Elāma dragons said, 'I will make a chariot of 38,000 miles of interlaced dew, and I will make various jade maidens sit on it and create a multitude of musical performances to attend the bodhisattva and make offerings to him.'",
        "source": "T03n0186_003:0504b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「天帝釋曰：『吾將眷屬菩薩前導。』",
        "translation": "\"The god Indra said, 'I will guide the bodhisattvas in front of my retinue.'",
        "source": "T03n0186_003:0504b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法行菩薩曰：『吾當興起紫磨金雲，雨栴檀香，皆遍天下。』",
        "translation": "The Dharmôdgata Bodhisattva said, 'I will raise clouds of purple polish and gold and rain sandalwood incense all over the world.'",
        "source": "T03n0186_003:0504b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "和隣龍王、摩那斯龍王、散拘龍王、阿耨達龍王、難頭和難龍王，各自說言：『亦當興起紫磨金雲，當雨微妙栴檀名香。』",
        "translation": "Each of the dragon-rulers Nandana, Manasvin, Saṃkusum, Anavatapta, and Nandanavana said, 'A cloud of purple-tinged gold will also arise, and it will rain the fragrance of the subtle, well-known sandalwood.'",
        "source": "T03n0186_003:0504b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是，比丘！",
        "translation": "\"Thus, monks!",
        "source": "T03n0186_003:0504b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天、龍、鬼神、揵沓和等，心常懷願，欲得聽省菩薩正道所思惟法，慕樂安隱入於宮內，思念過去諸佛所行，愍傷眾生，本行道時，不捨四願以至純淑。",
        "translation": "\"When gods, dragons, ghosts, gandharvas, and others always have the wish in their hearts to hear and examine the contemplated teachings of the bodhisattva's right path, they long for comfort and stability and enter the palace, thinking about the actions of past buddhas and pity for sentient beings, and when they first started on the path, they didn't abandon the four vows until they were purely noble.",
        "source": "T03n0186_003:0504b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為四：本學道時設我成正覺，逮一切智被弘誓鎧，眾生困厄救眾惱患，吾當濟脫生老病死三界之縛，猗在世俗周旋眾難，使至寂然，令無恩愛，是第一願。",
        "translation": "What are the four: When I was first training on the path, suppose I became perfectly enlightened, acquired omniscience and was armed with the great vow, saved sentient beings from suffering and distress, helped to free myself from the fetters of the three realms of birth, old age, illness, and death, and smoothed over the difficulties of the worldly world so that I would become tranquil and have no craving; this is the first vow.",
        "source": "T03n0186_003:0504b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生沒在無明窈冥，悉無所知，愚癡闇昧生穢濁樹；當為顯示如清淨眼，內外無限，是第二願。",
        "translation": "That sentient beings are submerged in the darkness of ignorance, have no knowledge at all, and are born from the tree of defilement in the darkness of delusion; this will be the second vow, to reveal them as pure eyes that are unlimited both inside and out.",
        "source": "T03n0186_003:0504b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生在世立自大幢，常計吾我而意貪身，尊己賤彼心存顛倒，處諸邪見無常，不慕聖道，墮於三業；皆當開化令入正真，是第三願。",
        "translation": "It's the third vow that sentient beings in the world establish themselves as great pillars, always imagining themselves as self and intent on body, honoring themselves and being inferior to others with a mistaken mind, dealing with wrong views and impermanence, not aspiring to the noble path, and falling into the three karmas will be enlightened and brought into the true light.",
        "source": "T03n0186_003:0504b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生沒在生死之患，輪轉無際滅智慧根，迷惑五趣不能自濟；當為說法令得度脫，是為四願。",
        "translation": "That sentient beings are caught up in the miseries of birth and death, transmigration is endless, the faculty of wisdom is extinguished, and they're confused and unable to help themselves in the five destinies; these are the four vows that will be explained to them and lead to their deliverance.",
        "source": "T03n0186_003:0504b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾往古時立是四願，今已得之，不可違捨，以故出家，成就正覺度脫十方。",
        "translation": "Since I made these four vows in the distant past and have now attained them, I can't disregard them, so I left home and accomplished right awakening to liberate the ten directions.",
        "source": "T03n0186_003:0504b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時法行天子、淨居天子，來入宮殿自現形像，娛樂之形無常之變，住於虛空，時為菩薩說此偈言：「『天子在空歎，　　覺蓮華寂明；　　云何在五欲，　　大聖當捨家。",
        "translation": "\"It was then that the Dharma practice celestials and the pure abode celestials came into the palace and showed themselves in the form of an amusement form that was impermanent and transformed while standing in space, and they spoke this verse for the bodhisattva, saying, \"The celestial is praising emptiness and realizing the serenity and brightness of the lotus; why are the five desires there, and what great sage should renounce home?",
        "source": "T03n0186_003:0504c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　受我所勸助，　　當觀於後宮；　　覩諸迷惑眾，　　如在死人間。』",
        "translation": "Accepting my encouragement, he should look into the back palace and see all the deluded people as if they were among the dead.'",
        "source": "T03n0186_003:0504c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎普曜經卷第三",
        "translation": "Śṛgālavādasūtra, vol. 3",
        "source": "T03n0186_003:0504c08_0",
        "is_bad_quality": false
    }
]