[
    {
        "source_sentence": "佛說菩薩本行經卷中",
        "translation": "Foshuo pusa bujian jing zhong",
        "source": "T03n0155_002:0113c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "失譯人名今附東晉錄",
        "translation": "Lost Translator's Names Now Attached to the Records of the Eastern Jin Dynasty",
        "source": "T03n0155_002:0113c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔佛在舍衛國祇樹給孤獨園。",
        "translation": "Once upon a time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T03n0155_002:0113c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有賢者名曰須達，居家貧窮無有財產，至信道德。",
        "translation": "At the time, there was a good man named Sudatta who lived in poverty, had no possessions, and was deeply devoted to morality.",
        "source": "T03n0155_002:0113c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往至佛所，頭面作禮稽首佛足，却坐一面聽說經法。",
        "translation": "He went to the Buddha, bowed his head at his feet, and withdrew to sit to one side to listen to the sūtras and teachings.",
        "source": "T03n0155_002:0113c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛問須達：「在家之士當行布施、不布施也？」",
        "translation": "The Buddha asked Sudatta, \"Should a householder practice generosity or not?\"",
        "source": "T03n0155_002:0114a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須達白佛：「當行布施。",
        "translation": "Sudatta said to the Buddha, \"You must practice generosity.",
        "source": "T03n0155_002:0114a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "多布施耶？",
        "translation": "How much should I give?",
        "source": "T03n0155_002:0114a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "小布施也？",
        "translation": "Even a small donation?",
        "source": "T03n0155_002:0114a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當以好意而布施耶？",
        "translation": "Should you give out of good intentions?",
        "source": "T03n0155_002:0114a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不好意而布施乎？」",
        "translation": "Do you give out with bad intentions?\"",
        "source": "T03n0155_002:0114a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告須達：「夫於布施，所施雖多而獲報小；布施雖小而獲報多。",
        "translation": "The Buddha told Sudar, \"When someone gives alms, the reward is small even though the gift is substantial, and the reward is large even though the gift is small.",
        "source": "T03n0155_002:0114a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂施多而獲報小？",
        "translation": "What's the meaning of giving much and getting little in return?",
        "source": "T03n0155_002:0114a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖多布施，而無至心、無恭敬心，不大歡喜、貢高自大；所施之人，信邪倒見、非是正見，不得快士；所施雖多而獲報小。",
        "translation": "Although they give generously, they lack a sense of sincerity and respect, aren't very joyful, and are arrogant in their pride; the person they give to believes in wrong views and doesn't hold right views, so they can't become a happy person; although they give much, they receive little reward.",
        "source": "T03n0155_002:0114a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如耕田薄地之中，下種雖多，收實甚小。",
        "translation": "He's like plowing a thin field, planting much seed but reaping little in truth.",
        "source": "T03n0155_002:0114a09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂施小而獲大福？",
        "translation": "What's the meaning of bestowing a small amount and reaping great merit?",
        "source": "T03n0155_002:0114a10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所施雖小，歡喜與、淨潔心與、恭敬與、不望報與；所施之人，復得快士，佛及辟支佛、沙門四道，應正見者；所施雖小獲報弘大。",
        "translation": "Although the gift is small, he gives it joyfully, gives it with a pure heart, gives it respectfully, and doesn't expect a reward; the person who gives it will then become a fastidious man, a Buddha, a pratyekabuddha, an ascetic of the four paths, and someone who correctly sees; although the gift is small, the reward is great.",
        "source": "T03n0155_002:0114a11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如良田，所種雖小收實甚多。」",
        "translation": "They're like a fertile field that produces a large harvest even though the seeds are small.\"",
        "source": "T03n0155_002:0114a14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告須達：「吾自憶念過去世時，此閻浮提有轉輪王，名波陀颰寧，王有千子，主四天下，此閻浮提有八萬四千國。",
        "translation": "The Buddha told Sudatta, \"I myself remember a time in the distant past when there was a wheel-turning king in Jambudvīpa named Bhadrapāṇin who had a thousand sons who ruled the four worlds and 84,000 countries in Jambudvīpa.",
        "source": "T03n0155_002:0114a14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有一婆羅門名曰比藍，身體金色端正無比，聰明智慧，天地變運醫方鎮壓，上知天文，下察地理，中知人情，一切典籍靡不貫達，為人仁愛慈愍一切。",
        "translation": "At the time, there was a Brahmin named Biren with a golden body that was unsurpassed in its appearance, intelligence and wisdom, knowledge of the changes in heaven and earth, medical prescriptions and suppression, knowledge of astronomy above, geography below, and human emotions in the middle, and a compassionate person who loved and cared for all people.",
        "source": "T03n0155_002:0114a17_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王甚愛敬，八萬四千諸王及國人民，亦皆奉敬以為師主。",
        "translation": "The king greatly loved and respected him, and 84,000 kings and the people of his kingdom also honored him as their teacher and master.",
        "source": "T03n0155_002:0114a20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比藍大師為是大王，非是波陀颰寧。",
        "translation": "That great teacher Pilinda was a great king, not Pāṭaliputra.",
        "source": "T03n0155_002:0114a22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T03n0155_002:0114a23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波陀颰寧王治國正民，一一諮啟比藍大師，爾乃教化，諸王臣民莫不歡喜。",
        "translation": "King Bhadrapāṇi ruled his country and rightly governed his people, consulting one by one with the great teacher Bilaam and then teaching and instructing him, the kings and their subjects were delighted.",
        "source": "T03n0155_002:0114a23_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時，大王而從比藍啟受經典，亦復宣告八萬四千諸小國王、群臣太子、一切人民，皆從比藍諮受經典習學智慧。",
        "translation": "After the great king had received the sūtras from Bilaam, he also proclaimed that 84,000 small kings, ministers, princes, and all the people would receive the sūtras from Bilaam and train in wisdom.",
        "source": "T03n0155_002:0114a25_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸王臣民皆從比藍啟受經典，莫不歡喜，皆言：『此是梵天來化我等，為於好事。",
        "translation": "When the kings and their subjects received the sūtras from Pīrāṇa, they were all delighted and said, 'This is the Brahmā gods who came to teach us for good.",
        "source": "T03n0155_002:0114a27_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非是凡人。』",
        "translation": "They're not ordinary people.'",
        "source": "T03n0155_002:0114a29_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「於時，八萬四千諸王受學智慧，心意開解皆大歡喜。",
        "translation": "\"At the time, 84,000 kings who had received the study of wisdom were greatly elated when their minds were enlightened.",
        "source": "T03n0155_002:0114a29_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八萬四千諸小王人，持一白象金銀絞絡，駿馬一疋亦金銀絞絡，牛一頭亦金銀絞絡，妙女一人亦端正無比，七寶瓔珞服飾姝好，金鉢盛銀粟，銀鉢盛金粟，琉璃鉢盛金粟，頗梨鉢盛金粟，以金為車七寶莊飾，各各皆爾有八萬四千，以用貢上比藍大師。",
        "translation": "Each of the 84,000 junior kings carried a white elephant twisted in gold and silver, a bolt of a steed also twisted in gold and silver, a head of an ox also twisted in gold and silver, a beautiful woman elegantly adorned with seven jewelry, a gold bowl filled with silver corn, a silver bowl filled with gold corn, a lapis lazuli bowl filled with gold corn, a pāri bowl filled with gold corn, and a chariot made of gold and adorned with seven treasures, each of which numbered 84,000, and they paid tribute to the great teacher Pīrāṇa.",
        "source": "T03n0155_002:0114b01_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，大王波陀颰寧，聞諸小王貢遺比藍，大用歡喜：『我亦當復貢上比藍大師財寶。』",
        "translation": "\"At the time, the great king Pāṭaliputra heard that the lesser kings had paid tribute to Tiberias, and he greatly rejoiced, 'I, too, will pay tribute to the treasures of the great teacher Tiberias.'",
        "source": "T03n0155_002:0114b07_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時，莊嚴八萬四千玉女之等，七寶珠璣服飾姝妙瓔珞其身，八萬四千白象純金絞絡飾，八萬四千疋馬亦金銀絞絡，八萬四千頭牛盡金莊校，八萬四千金鉢盛銀粟，八萬四千銀鉢盛金粟，八萬四千琉璃鉢盛金粟，八萬四千頗梨鉢盡盛金粟，八萬四千乘車盡金絞飾，用上比藍。",
        "translation": "Immediately, he adorned 84,000 jade maidens and others with beautiful jewelry made of seven jewels, 84,000 white elephants trimmed in pure gold, 84,000 bolts of horses trimmed in gold and silver, 84,000 head of cattle trimmed in gold, 84,000 gold bowls filled with silver, 84,000 silver bowls filled with gold, 84,000 lapis lazuli bowls filled with gold, 84,000 pāri bowls filled with gold, and 84,000 chariots trimmed in gold with the treasure of the great Pīrāṇa.",
        "source": "T03n0155_002:0114b09_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比藍受已，念此財寶象馬車乘一切所有，皆悉非常而不堅固，白大王言：『財產所有皆悉非常摩滅之法，我不用之，意欲布施濟諸窮乏。』",
        "translation": "After accepting them, he remembered that all the wealth, elephants, horses, chariots, and carts he owned were impermanent and not hard, and said to the king, 'All my possessions are impermanent and do not need the Dharma of extinction; I want to give them away to help the poor.'",
        "source": "T03n0155_002:0114b16_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王聞其言大用歡喜，告勅群臣擊鼓宣令：『閻浮提內，貧窮孤老、婆羅門梵志皆悉來集，比藍即設大檀。』",
        "translation": "\"Hearing his words, the king rejoiced greatly and commanded his ministers to beat the drums and proclaim, 'In Jambudvīpa, the poor, the orphaned, the Brahmans, and the priests are all gathered here, so Bilaam will set up a great offering.'",
        "source": "T03n0155_002:0114b19_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人民聞令雲興而集，強弱相扶皆悉來至。",
        "translation": "When the people heard the order, they rallied in droves, and they all came, supporting each other in their strength and weakness.",
        "source": "T03n0155_002:0114b21_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時，比藍欲澡婆羅門手，傾於軍持而水不出，大用愁憂。",
        "translation": "It was then that Pilinda wanted to wash the hands of the Brāhmaṇas, but the water didn't come out when he poured it into his army, so he was greatly distressed.",
        "source": "T03n0155_002:0114b22_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『今我大祠將有何過？",
        "translation": "'What's wrong with our great altar now?'",
        "source": "T03n0155_002:0114b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意不清淨？",
        "translation": "Is the mind unclear and pure?",
        "source": "T03n0155_002:0114b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所施不好？",
        "translation": "What is given is not good?",
        "source": "T03n0155_002:0114b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何等故而水不出？』",
        "translation": "For what reason does the water not flow?'",
        "source": "T03n0155_002:0114b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時，天人於虛空中語比藍言：『汝今布施大好無比，其心淨潔無能過者，汝之功德天下第一無過上者，但所施人盡是邪偽倒見之徒，非是清高快士之輩，而不堪任受汝澡敬，以是之故水不出耳。』",
        "translation": "Immediately, the celestials said to Pilinda in the sky, 'Your gift now is unsurpassed in its quality and purity of mind, and your virtue is unsurpassed among the world's greatest. However, your benefactors are all false and mistaken, not noble and fastidious people, and they're not fit to accept your bathing, which is why the water won't come out.'",
        "source": "T03n0155_002:0114b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是比藍聞天人語，意便開解即作誓言：『今我所施用成無上正真之道，審如所願者，令我瀉水當墮我手中。』",
        "translation": "Hearing what the celestials said, Pilinda then had his mind enlightened and vowed, 'Now, I will use my alms to achieve the unsurpassed true path, and I will examine those who do as I wish, so that the water I pour will fall into my hands.'",
        "source": "T03n0155_002:0114b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作誓願已訖，便傾澡瓶，水即來出自墮掌中。",
        "translation": "After making that vow, he then pours the water out of the clay pot, and the water comes pouring out of his palm.",
        "source": "T03n0155_002:0114c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天空中讚言：『善哉善哉！",
        "translation": "The gods in the sky praised him, saying, 'Good, good!",
        "source": "T03n0155_002:0114c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所願成佛不久。』",
        "translation": "As you've vowed, you won't soon become a buddha.'",
        "source": "T03n0155_002:0114c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，比藍布施貧乏，衣被飲食一切所須。",
        "translation": "\"At the time, Bilan gave generously to the poor, needing everything for clothing and food.",
        "source": "T03n0155_002:0114c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十二年中，象馬珍寶玉女之等，盡用布施無所藏積。」",
        "translation": "For twelve years, he gave away elephants, horses, treasures, jade women, and so forth, using them all and storing nothing.\"",
        "source": "T03n0155_002:0114c06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告須達：「爾時比藍婆羅門者，今我身是。",
        "translation": "The Buddha told Sudatta, \"At the time, that was Bilambara Brāhmaṇa, and now I am him.",
        "source": "T03n0155_002:0114c07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而我爾時，所施亦好、其心亦好，受者不好，所施雖多獲報甚少。",
        "translation": "At the time, what I gave was good and my mind was good, but the recipient was not good, and although I gave much, I got very little in return.",
        "source": "T03n0155_002:0114c08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而今我法真妙清淨、弟子真正，所施雖少獲報甚多。",
        "translation": "Now, however, my teaching is truly wonderful and pure, and my disciple is genuine, so even though he gives little, he gets much in return.",
        "source": "T03n0155_002:0114c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是比藍十二年中所作布施，及閻浮提一切人民行於布施，計其功德，不如布施一須陀洹人，其福甚多過出其上。",
        "translation": "Evaluating the merits of the almsgiving that Bilāmbhava had made in those twelve years and the almsgiving that all the people of Jambudvīpa had made, that merit was not as great as the merit of giving to one stream entrant, which was much greater than that.",
        "source": "T03n0155_002:0114c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設施百須陀洹并前比藍所施閻浮提人，所得福報，不如施一斯陀含人，其福甚多亦過其上。",
        "translation": "The merit gained from the facilities of the 100 streamers and the people of Jambudvīpa that Pilinda had given to them wasn't as great as that gained from giving to one person from Sthavira, whose merit was abundant and surpassed his.",
        "source": "T03n0155_002:0114c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正使施百斯陀含、百須陀洹、及前比藍施閻浮提人，所得福報、不如施一阿那含人，其福倍多過出其上。",
        "translation": "Even if it's true that giving to 100 streams of sentient beings, 100 streams of streams, and the person given to Jambudvīpa by the former Bilaṅga doesn't bring as much merit as giving to one non-returner, his merit is twice as great as the greatest.",
        "source": "T03n0155_002:0114c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "施百阿那含人、百斯陀含、百須陀洹，并前比藍閻浮提人，所得福報，不如施一阿羅漢，其福甚多過出其上。",
        "translation": "Giving to 100 non-returners, 100 sakṛdhas, 100 streamers, and the former Bilaṅgāra Jambudvīpa doesn't reap as much merit as giving to one arhat, which is more than twice as great.",
        "source": "T03n0155_002:0114c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正使施百羅漢、百阿那含、百斯陀含、百須陀洹，并前比藍閻浮提人，所施功德，不如施一辟支佛，其福甚多過出其上。",
        "translation": "Even if someone were to give to 100 arhats, 100 non-returners, 100 siddhântas, and 100 streamers, and to the person who preceded him in Pilambana, the merit they would receive wouldn't be as great as giving to one pratyekabuddha, whose fortune would be so great that it would surpass his.",
        "source": "T03n0155_002:0114c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正使布施百辟支佛、百阿羅漢、百阿那含、百斯陀含、百須陀洹，及前比藍施閻浮提人，所得功德，不如起塔、僧房精舍，衣被床臥飯食供養，過去當來今現在，四方眾僧沙門道士，給其所須，計其功德，過前所作功德者上。",
        "translation": "Even if he had given alms to 100 pratyekabuddhas, 100 arhats, 100 nonreturners, 100 siddhântas, and 100 streamers, and the former Bilaṅga Jambudvīpa, the merit he would have attained wouldn't have been as great as raising a stūpa, monk's dormitory, clothing, bedding, food, and offerings, or the needs of the saṃgha, saṃgha, and religious practitioners in the four directions in the past, future, and present, which would have surpassed the merit of the previous undertaking.",
        "source": "T03n0155_002:0114c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖起塔僧房精舍，施辟支佛、阿羅漢、阿那含、斯陀含、須陀洹、并前比藍閻浮提人，所作布施福德，不如施佛一人，功德甚多不可復計。",
        "translation": "Even though he built a stūpa, a monastery, and a fine dwelling, and gave alms to a pratyekabuddha, an arhat, an arhat, a sakṛd-āgāmin, a stream-winner, or someone from Yama and Jambudvīpa, the merit of his almsgiving wasn't as great as that given to the Buddha alone, which is too great to be counted.",
        "source": "T03n0155_002:0114c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖供養佛，起塔僧房精舍，及辟支佛、阿羅漢、阿那含、斯陀含、須陀洹，并前比藍閻浮提人，所施功德，不如有人一日之中受三自歸、八關齋，若持五戒，所得功德，踰過於前所施福德，百千萬倍不可為喻。",
        "translation": "Even though the merit of making offerings to the Buddha, building a stūpa, a monk's dormitory, a monk's hut, a pratyekabuddha, arhat, non-returner, sakṛd-āgāmin, or stream-winner, and the former Bṛhatphala Jambudvīpa, that merit is not as great as that obtained by someone who takes the three refugee and eight precepts in a single day and observes the five precepts, it's a hundred million times greater than the merit of the previous offerings, which cannot be imagined.",
        "source": "T03n0155_002:0115a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以持戒之福，并合集前一切施佛功德及辟支佛、四道之等，合前比藍閻浮提人所施福德，不如坐禪慈念眾生經一食之頃，所得功德，踰過於前百千萬倍。",
        "translation": "Furthermore, taking the merit of observing the precepts and combining it with all the merits of the previous offerings to the Buddha, the solitary buddhas, and those of the four paths, the merit bestowed by the previous monks of Bilaamyambudvīpa wouldn't be as great as the merit obtained by sitting in meditation and mindfulness of sentient beings after one meal, which is a hundred thousand million times greater than the previous merit.",
        "source": "T03n0155_002:0115a07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "踰前比藍閻浮提人所作布施，及施四道、辟支佛，起塔僧伽藍，上至施佛，持戒坐禪慈念眾生，合集其德，不如聞法執在心懷，思惟四諦、非常苦空非身之法、泥洹寂滅，比前所作一切功德，最尊第一無有過上。」",
        "translation": "It's not as meritorious as the combined virtues of the almsgiving made by that man in Piram, the gifts given to the four destinies, the solitary buddhas, the raising of stūpas and monasteries, up to the giving of buddhas, observing precepts, sitting in meditation, and being mindful of sentient beings, than hearing the Dharma and holding it in his mind, contemplating the four truths, the principle of suffering, emptiness, non-self, and nirvāṇa and extinction, which are the most honored and greatest of all merits compared to the previous ones.\"",
        "source": "T03n0155_002:0115a10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是須達聞法踊躍無量，身心清淨得阿那含道。",
        "translation": "Sudatta then hears the teaching and rises up measurelessly, purifying body and mind and attaining the path of non-returners.",
        "source": "T03n0155_002:0115a15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯有五金錢，一日持一錢施佛，一錢施法，一錢施僧，一錢自食，一錢作本；日日如是，常有一錢在，終無有盡。",
        "translation": "With only five coins, he gives one coin a day to the Buddha, one coin to the Dharma, one coin to the saṃgha, one coin for his own food, and one coin for his base; day by day, he thus always has one coin in his possession, and it will never end.",
        "source": "T03n0155_002:0115a16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即受五戒，長跪白佛言：「我今日欲心已斷，處在居家當云何也？」",
        "translation": "He then took the five precepts, knelt down long enough, and said to the Buddha, \"Now that my desire has been stopped, what would I do if I were to stay at home?\"",
        "source": "T03n0155_002:0115a19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告須達：「如汝今日心意清淨無復愛欲，汝還歸家問諸婦女：『今我欲心已滅，汝等各從所樂。",
        "translation": "The Buddha told Sudatta, \"Now that your mind is purified and you have no more desires, go back home and ask the women, 'Now that my desire for you has ceased, you each follow your own pleasure.",
        "source": "T03n0155_002:0115a20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須夫婿者恣從所好，若欲在此當給衣食。』」",
        "translation": "Those of you who need a husband or son-in-law, take whatever you like, and if you want to stay here, you'll be given food and clothing.'\"",
        "source": "T03n0155_002:0115a22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須達受教，為佛作禮，便還歸家問諸婦女：「我今愛欲都已永盡無復欲事，汝等若欲須夫婿者各隨所好，欲在此者供給衣食令無乏少。」",
        "translation": "After he had been instructed, Sudatta paid homage to the Buddha and returned home to ask the women, \"Now that my cravings have been permanently ended and there are no more desires, you may each follow your own desires if you want a husband or son-in-law, and you may provide clothing and food for those who want to stay here so that there's nothing lacking.\"",
        "source": "T03n0155_002:0115a23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸婦女等各各從意隨其所樂。",
        "translation": "The women and their wives each did as they wished, following their own inclinations.",
        "source": "T03n0155_002:0115a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有一婦人，炒穀作麨，有牂牴來抴炒麥，不可奈何，捉[打-丁+剔]火杖用打牂牴，杖頭有火著羊毛住，羊得火熱用揩象廐，象廐火然并燒王象，象身爛破便殺獼猴用拍象身。",
        "translation": "When a woman was cooking grain to make flour, a shepherd came along and partially fried the wheat, but she couldn't help it, so she grabbed [a [ding+pick] fire stick and beat the shepherd with it, catching the end of the stick on fire and holding onto the wool.",
        "source": "T03n0155_002:0115a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天於空中而說偈言：「瞋恚鬪諍邊，　　不當於中止，　羯羠共相牴，　　蠅蛾於中死。",
        "translation": "Up in the sky, the gods spoke a verse, saying, \"The end of the anger and quarrel should not be stopped, for the kallions and coasts are fighting each other, and a fly dies in the midst of it.",
        "source": "T03n0155_002:0115b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　婢共牂牴鬪，　　獼猴而坐死，　智者遠嫌疑，　　莫與愚人止。」",
        "translation": "A handmaid shares a fight with a female, and a monkey sits down and dies. A wise man avoids suspicion; don't stop with a foolish man.\"",
        "source": "T03n0155_002:0115b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波斯匿王勅臣作限：「自今以去，夜不得燃火及於燈燭，其有犯者罰金千兩。」",
        "translation": "King Prasenajit ordered his ministers to set a limit, \"From now on, fires and candles must not be burned at night, and anyone who violates that rule is punished with a thousand taels of gold.\"",
        "source": "T03n0155_002:0115b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，須達得道在家晝夜坐禪，初人定時，燃燈坐禪，夜半休息，鷄鳴復燃燈坐禪。",
        "translation": "At the time, Sudatta attained enlightenment and was at home sitting in meditation day and night. When he first got settled, he lit a lamp and sat in meditation; at midnight, when he rested, a rooster crowed and he lit a lamp again and sat in meditation.",
        "source": "T03n0155_002:0115b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伺捕得之，捉燈白王：「當輸罰負。」",
        "translation": "When he caught them, he seized the lamp and said to the king, \"You'll be punished by a loss.\"",
        "source": "T03n0155_002:0115b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須達白王：「今我貧窮無百錢產，當用何等輸王罰負？」",
        "translation": "Sudatta said to the king, \"Now that I'm poor and don't have a hundred pounds to spare, what punishment will I give the king to compensate for my loss?\"",
        "source": "T03n0155_002:0115b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王瞋勅使閉著獄中：「即將須達付獄執守。」",
        "translation": "The king angrily ordered his envoy to close the prison, \"Send Sudatta to the prison to guard it.\"",
        "source": "T03n0155_002:0115b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四天王見須達被閉在獄，初夜四天王來下語須達言：「我與汝錢用輸王罰，可得來出。」",
        "translation": "When the four celestial kings saw Sudatta locked up in prison, they came down first thing in the evening and told Sudatta, \"I'll give you money to pay the king's penalty so that you can come back out.\"",
        "source": "T03n0155_002:0115b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須達答言：「王自當歡喜意解，不須用錢。」",
        "translation": "Sudatta replied, \"The king will himself rejoice in his understanding, and there's no need for money.\"",
        "source": "T03n0155_002:0115b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為四天王而說經竟，天王便去。",
        "translation": "After he finished explaining the sūtras to the four celestial kings, the king departed.",
        "source": "T03n0155_002:0115b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到中夜天帝釋復來下就而見之，須達為說法竟，帝釋便去。",
        "translation": "When he arrived at the middle of the night, Tishri came down to meet him, and after Sudatta finished teaching the Dharma for him, Tishri departed.",
        "source": "T03n0155_002:0115b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次到後夜梵天復下見於須達，便為說法，梵天復去。",
        "translation": "At the end of the night, Brahmā came down to see Sudatta, who then taught the Dharma for him, and Brahmā again departed.",
        "source": "T03n0155_002:0115b19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，王夜於觀上見獄上有火光，時，王明日即便遣人往語須達：「坐火被閉而無慚羞，續復燃火。」",
        "translation": "When the king was looking up at night and saw a firelight above the hells, the king sent someone to Sudatta tomorrow to say, \"Sitting there in the fire, shut up and unashamed, you'll keep the fire burning.\"",
        "source": "T03n0155_002:0115b20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須達答言：「我不燃火，若燃火者當有烟灰表式。」",
        "translation": "Sudatta replied, \"I don't light fires, and if I did, there would be soot on my face.\"",
        "source": "T03n0155_002:0115b23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復語須達：「初夜有四火，中夜有一火倍大前火，後夜復有一火遂倍於前；言不燃火，為是何等？」",
        "translation": "Again, he told Sudatta, \"In the first night there are four fires, in the middle of the night there's one fire that's twice as big as the previous fire, and in the last night there's another fire that's twice as big as the previous one; what is this that they say about not lighting a fire?\"",
        "source": "T03n0155_002:0115b24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須達答言：「此非是火也。",
        "translation": "Sudatta replied, \"This is not fire.",
        "source": "T03n0155_002:0115b26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初夜四天王來下見我，中夜第二天帝來下見我，後夜第七梵天來下見我，是天身上光明之焰，非是火也。」",
        "translation": "On the first night, four celestial kings came down to see me, on the second night, the second emperor came down to see me, and on the last night, the seventh brahma god came down to see me, and this is a bright flame on the body of a god, not a fire.\"",
        "source": "T03n0155_002:0115b27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使聞其語即往白王，王聞如是心驚毛竪。",
        "translation": "When the messenger heard what he said, he went to the king and told him that the king's heart was startled and his hair stood on end when he heard what he said.",
        "source": "T03n0155_002:0115b29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「此人福德殊特乃爾，我今云何而毀辱之？」",
        "translation": "The king said, \"This person's merit is so extraordinary, why would I disparage them now?\"",
        "source": "T03n0155_002:0115c01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即勅吏言：「促放出去，勿使稽遲。」",
        "translation": "He then commanded the officials, \"Hurry up and let them go; don't let them delay.\"",
        "source": "T03n0155_002:0115c02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便放令去。",
        "translation": "He then released them and ordered them to go.",
        "source": "T03n0155_002:0115c03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須達得出往至佛所，頭面作禮却坐聽法。",
        "translation": "Sudatta then went to the Buddha, paid homage with his head and face, and withdrew to sit and listen to the teaching.",
        "source": "T03n0155_002:0115c03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波斯匿王即便嚴駕尋至佛所，人民見王皆悉避坐而起，唯有須達心存法味，見王不起。",
        "translation": "Even as King Prasenajit approached the Buddha in his car, the people all avoided sitting down and got up when they saw the king, except for Sudatta, who had a taste for the Dharma and didn't look at the king.",
        "source": "T03n0155_002:0115c04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王心微恨：「此是我民，懷於輕慢見我不起。」",
        "translation": "The king had a mild sense of hatred, \"These are my people, and they look down on me with contempt.\"",
        "source": "T03n0155_002:0115c06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂懷慍心。",
        "translation": "He then became angry.",
        "source": "T03n0155_002:0115c07_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知其意，止不說法。",
        "translation": "Knowing what he wanted, the Buddha stopped short of teaching the Dharma.",
        "source": "T03n0155_002:0115c07_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王白佛言：「願說經法。」",
        "translation": "The king said to the Buddha, \"I wish to teach the sūtras and the Dharma.\"",
        "source": "T03n0155_002:0115c08_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告王言：「今非是時，為王說法。",
        "translation": "The Buddha told the king, \"This is not the right time to preach for the king.",
        "source": "T03n0155_002:0115c08_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何非時？",
        "translation": "What's not the right time?",
        "source": "T03n0155_002:0115c09_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人起瞋恚忿結不解，若起貪婬耽荒女色，憍貴自大無恭敬心；其心垢濁，聞於妙法而不能解，以是之故，今非是時，為王說法。」",
        "translation": "A person who becomes angry and resentful and doesn't understand the bond of anger, who becomes lustful and desolate with women, who becomes arrogant and proud, and who has no respect for women, and whose mind is so defiled that they hear the wonderful Dharma but aren't able to understand it, therefore it's not the right time to preach to the king.\"",
        "source": "T03n0155_002:0115c09_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞佛語意自念言：「坐此人故，令我今日有二折減，又起瞋恚不得聞法。」",
        "translation": "The king heard the Buddha's words and thought to himself, \"Sitting here with this person has caused me to have two discounts today, and I've become angry and can't hear the Dharma.\"",
        "source": "T03n0155_002:0115c12_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為佛作禮而去，出到於外勅語左右：「此人若出直斫頭取。」",
        "translation": "He paid homage to the Buddha and departed, going outside and telling his attendants, \"If this person leaves, I'll chop off his head and take it.\"",
        "source": "T03n0155_002:0115c14_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，應時，四面虎狼師子毒害之獸，悉來圍繞於王。",
        "translation": "After he said this, the king was then surrounded on all sides by tigers, wolves, lions, and venomous animals.",
        "source": "T03n0155_002:0115c15_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王見如是，即大恐怖還至佛所。",
        "translation": "Seeing this, the king returned to the Buddha in great terror.",
        "source": "T03n0155_002:0115c16_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛問大王：「何以來還？」",
        "translation": "The Buddha asked the king, \"Why did you come back?\"",
        "source": "T03n0155_002:0115c17_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王白佛言：「見其如是恐怖來還。」",
        "translation": "The king said to the Buddha, \"Seeing him like this, he's afraid to come back.\"",
        "source": "T03n0155_002:0115c18_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告王曰：「識此人不？」",
        "translation": "The Buddha told the king, \"Do you know this person?\"",
        "source": "T03n0155_002:0115c18_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：「不識。」",
        "translation": "The king said, \"I don't know.\"",
        "source": "T03n0155_002:0115c19_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「此人以得阿那含道，坐起惡意向此人故，是使爾耳。",
        "translation": "The Buddha said, \"This person has attained the path of non-returner and is sitting here with bad intentions for this person, so that's why.",
        "source": "T03n0155_002:0115c19_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不還者，王必當危不得全濟。」",
        "translation": "If he doesn't return, the king will surely be in danger and won't be able to completely save him.\"",
        "source": "T03n0155_002:0115c21_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞佛語即大恐怖，即向須達懺悔作禮，羊皮四布於須達前。",
        "translation": "When the king heard the Buddha's words, he became terrified and paid homage to Sudatta in repentance, spreading the goatskin four times in front of Sudatta.",
        "source": "T03n0155_002:0115c21_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「此是我民，而向屈辱實為甚難。」",
        "translation": "The king said, \"This is really very difficult for my people to go through this humiliation.\"",
        "source": "T03n0155_002:0115c23_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須達復言：「而我貧窮，行於布施亦復甚難。」",
        "translation": "Sudatta then said, \"Since I'm poor, it would be very difficult for me to practice generosity.\"",
        "source": "T03n0155_002:0115c24_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尸羅師質為國平正，為賊所捉。",
        "translation": "Śīlâditya was caught by a thief while serving as the country's justice.",
        "source": "T03n0155_002:0115c25_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賊語之曰：「言不見我，我當放汝；不者殺汝。」",
        "translation": "The thief told him, \"If you say you won't see me, I'll let you go; if not, I'll kill you.\"",
        "source": "T03n0155_002:0115c25_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尸羅師質意自念言：「今作妄語為非法事，若墮地獄誰當放我？」",
        "translation": "Śīlabhadra thought to himself, \"Now, I've spoken falsely and done something unlawful; who will release me if I fall into hell?\"",
        "source": "T03n0155_002:0115c26_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是思惟便語賊言：「寧斫我頭終不妄語。」",
        "translation": "After thinking about it, he said to the thief, \"I'd rather chop off my head than lie about it.\"",
        "source": "T03n0155_002:0115c28_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賊便放之。",
        "translation": "The thief then let him go.",
        "source": "T03n0155_002:0115c29_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "危害垂至，不犯妄語慎行正法實為甚難。",
        "translation": "The danger is imminent, and it's really very difficult not to violate false speech and carefully practice the right Dharma.",
        "source": "T03n0155_002:0115c29_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有天名曰尸迦梨，復自說：「我受八關齋，於高樓上臥。",
        "translation": "Another god named Śṛgālī again said to himself, \"I've taken the eight precepts and am lying on a high building.",
        "source": "T03n0155_002:0116a01_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有天玉女來至我所，以持禁戒而不受之實為甚難。」",
        "translation": "It's really difficult for a heavenly jeweled maiden to come to me and not accept the precepts while observing them.\"",
        "source": "T03n0155_002:0116a02_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是四人各各自說如是，即於佛前而說頌曰：「貧窮布施難，　　豪貴忍辱難，　危嶮持戒難，　　少壯捨欲難。」",
        "translation": "Each of the four then said this, and they went before the Buddha and spoke in verse, saying, \"It's difficult to be poor and generous, difficult to be noble and tolerant, difficult to observe precepts in dangerous situations, and difficult to be young and vigorous and abandon desire.\"",
        "source": "T03n0155_002:0116a03_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說偈已重說經法，王及臣民皆大歡喜，為佛作禮而去。",
        "translation": "After the Buddha spoke the verse and re-explained the sūtras and teachings, the king and his subjects rejoiced greatly, paid homage to the Buddha, and departed.",
        "source": "T03n0155_002:0116a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時，佛在羅閱祇比留畔迦蘭陀尼波僧伽藍，優連聚落有一泉水，中有毒龍名曰酸陀梨，甚大兇惡，放於雹霜，傷破五穀令不成熟，人民飢餓。",
        "translation": "Thus I have heard: One time, when the Buddha was at Kalandanipa Saṃghârāma in Rājagṛha, there was a spring in the village of Ullin in which there was a venomous dragon named Sundarī, which was very large and fierce and released hail and frost that damaged the grains and made them unripe, and the people starved.",
        "source": "T03n0155_002:0116a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，有婆羅門，呪龍伏之令不雹霜，五穀熟成。",
        "translation": "At the time, there was a Brahmin who had a spell to quell the dragon so that it wouldn't hail or frost, and the grains would ripen.",
        "source": "T03n0155_002:0116a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經有年載，此婆羅門，遂便老耄呪術不行。",
        "translation": "After a number of years, this Brāhmaṇa became elderly and his spell didn't work.",
        "source": "T03n0155_002:0116a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，有壯婆羅門，呪術流利舉聲誦呪，雲便解散令不雹霜，五穀豐熟。",
        "translation": "At the time, there was a stout brāhmaṇa who was fluent in spells and recited the spell with his voice, and the cloud lifted so that it wouldn't hail or frost and the grains would be plentiful.",
        "source": "T03n0155_002:0116a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人民歡喜，語婆羅門：「在此住止，當共供給令不乏少。」",
        "translation": "The people rejoiced and said to the Brāhmaṇa, \"Staying here, they will make offerings together so that they won't lack.\"",
        "source": "T03n0155_002:0116a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門言：「可。」",
        "translation": "The Brāhmaṇa said, \"Yes.\"",
        "source": "T03n0155_002:0116a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便住。",
        "translation": "They then stayed there.",
        "source": "T03n0155_002:0116a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼常共合斂，輸婆羅門不使有乏。",
        "translation": "They always make a joint offering there, and the brāhmaṇa gives it to them so that there won't be a shortage.",
        "source": "T03n0155_002:0116a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自佛來入國廣說經法，人民大小咸受道化得道甚多。",
        "translation": "Ever since the Buddha entered that country and taught the sutras and Dharma in detail, the people, large and small, were all converted by the Way and attained much enlightenment.",
        "source": "T03n0155_002:0116a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸龍鬼神皆悉為善不作惡害，風雨時節五穀豐賤，更不供給婆羅門所須。",
        "translation": "The dragons and ghosts are all good and don't do harm, and when the wind and rain come, the grains are plentiful and cheap, so they don't even offer what the Brāhmaṇa needs.",
        "source": "T03n0155_002:0116a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門往從索之，諸人民輩逆更唾罵而不與之。",
        "translation": "When the Brāhmaṇa went to ask for them, the people reviled them and refused to give them to him.",
        "source": "T03n0155_002:0116a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門心起瞋恚：「蒙我恩力而得飽滿，反更調我。」",
        "translation": "The Brāhmaṇa then became angry in his heart, \"They've been fed by my grace, but they've turned against me.\"",
        "source": "T03n0155_002:0116a22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲得破滅人民國土，便問人言：「求心所願云何得之？」",
        "translation": "Desiring to destroy the people's land, he asked the people, \"How can I get what my heart desires?\"",
        "source": "T03n0155_002:0116a23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人語之言：「飯佛四尊弟子，必得從願如心所欲。」",
        "translation": "People say, \"Supplying rice to the four honored disciples of the Buddha will surely make them obey the vows and do as their hearts desire.\"",
        "source": "T03n0155_002:0116a25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門即設飯食，請大迦葉、舍利弗、目連、阿那律，飯是四尊至心作禮求心所願：「我今持此所作福德，願使我作大力毒龍破滅此國，必當使我得此所願。」",
        "translation": "The Brāhmaṇa then prepared a meal and invited Mahākāśyapa, Śāriputra, Maudgalyāyana, and Aniruddha to dine on these four honored ones, paying homage with their hearts and asking for what they desired: \"Now, with this merit I've created, may I become a powerful poisonous dragon and destroy this country; it will surely be possible for me to obtain this wish.\"",
        "source": "T03n0155_002:0116a26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利弗道眼觀之求何等願？",
        "translation": "What was the vow that Śāriputra then sought as he observed it with his eye of enlightenment?",
        "source": "T03n0155_002:0116a29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知婆羅門心中所念願作毒龍欲滅此國。",
        "translation": "He knew that the desire in the Brāhmaṇa's mind was to become a poisonous dragon in order to destroy the country.",
        "source": "T03n0155_002:0116b01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利弗語婆羅門：「莫作此願，用作龍蛇害惡身為？",
        "translation": "Śāriputra then said to the Brāhmaṇa, \"Don't make this vow to use dragons and snakes to harm your bad body.",
        "source": "T03n0155_002:0116b02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲求作轉輪聖王，若天帝釋、魔王、梵王，盡皆可得；用此惡身不好願為？」",
        "translation": "If you want to become a wheel-turning sage king, could you attain it if you were a goddess, a demon king, or a brahma king; wouldn't it be a bad vow to use this bad body?\"",
        "source": "T03n0155_002:0116b03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門答舍利弗言：「久求此願適欲得此，不用餘願。」",
        "translation": "The Brāhmaṇa then answered Śāriputra, \"I've been asking for this vow for a long time, and I want to get it without any other vows.\"",
        "source": "T03n0155_002:0116b05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門舉手五指水即流出。",
        "translation": "When the Brāhmaṇa raised his five fingers, water flowed out.",
        "source": "T03n0155_002:0116b06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利弗見其意堅，證現如此，默然而止。",
        "translation": "Śāriputra then saw the strength of his resolve and realized it was like this, so he stopped in silence.",
        "source": "T03n0155_002:0116b07_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，婆羅門及婦、二兒俱願作龍，死受龍身，有大神力至為毒惡，便殺酸陀梨龍奪其處住，便放風雨大墮雹霜，傷殺五穀唯有草秸，因名其龍阿波羅利。",
        "translation": "Vārāmaṇa, his wife, and their two sons all vowed to become dragons, and when they died and received the body of a dragon, they had great psychic powers that were so powerful and vicious that they killed the sour draconian dragon, took its dwelling place, released a windstorm that dropped hail and frost, and killed five grains but left only straw.",
        "source": "T03n0155_002:0116b08_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婦名比壽尼，龍有二子，一名璣鄯尼，人民飢餓死者甚多，加復疫病死者無數。",
        "translation": "A woman named Pisuni and the dragon had two sons, one of whom was Keg Sani, and the people died of hunger and numerous epidemics.",
        "source": "T03n0155_002:0116b11_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，阿闍世王往至佛所，頭面作禮長跪白佛：「國界人民為惡龍疫鬼所見傷害，死者無數，唯願世尊大慈大悲憐愍一切，唯見救護禳却災害。」",
        "translation": "The king of Ajātaśatru then went to the Buddha, paid homage with his head and face, and knelt down long enough to tell him, \"The people of this country have been harmed by the sight of bad dragons and epidemics, and they've died incalculably; may the Bhagavān have great kindness and compassion for all of them and see fit to rescue them from this calamity.\"",
        "source": "T03n0155_002:0116b13_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即可之。",
        "translation": "The Buddha granted it.",
        "source": "T03n0155_002:0116b16_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊明日晨朝，著衣持鉢入城乞食，詣於龍泉食訖洗鉢，洗鉢之水澍於泉中。",
        "translation": "At the time, the Bhagavān gathered his robe and bowl in the morning and went into town to solicit alms.",
        "source": "T03n0155_002:0116b17_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "龍大瞋恚即便出水，吐於毒氣吐火向佛，佛身出水滅之；復雨大雹，在於虛空化成天花；復雨大石，化成琦飾；復雨刀劒，化成七寶；化現羅剎，佛復化現毘沙門王，羅剎便滅。",
        "translation": "It rained down another huge hailstorm that turned into smallpox in the sky, another huge rock that turned into ornaments, another rain of swords that turned into seven treasures, and another transformation of a Rājagṛha, which the Buddha then transformed into Vaiśravaṇa, and the Rājagṛha then went out.",
        "source": "T03n0155_002:0116b19_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "龍復化作大象鼻捉利劒，佛即化作大師子王，象便滅去。",
        "translation": "The dragon then transformed into a large elephant with a sharp trunk and a kite, and the Buddha then transformed it into Great Son of a King, and the elephant went out.",
        "source": "T03n0155_002:0116b23_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "適作龍像，佛復化作金翅鳥王，龍便突走。",
        "translation": "He then transformed into a dragon image, and the Buddha then transformed into the garuḍa king, and the dragon suddenly left.",
        "source": "T03n0155_002:0116b24_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "盡其神力不能害佛，突入泉中，密迹力士舉金剛杵打山，山壞半墮泉中。",
        "translation": "Exerting his supernormal powers, he couldn't harm the Buddha and burst into a spring.",
        "source": "T03n0155_002:0116b25_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲走來出，佛化泉水盡成大火。",
        "translation": "When he wanted to leave and come back out, the spring that the Buddha had transformed into became a huge fire.",
        "source": "T03n0155_002:0116b27_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "急欲突走，於是世尊蹈龍頂上，龍不得去。",
        "translation": "Desperate to escape, the Bhagavān then stepped on top of the dragon and it couldn't leave.",
        "source": "T03n0155_002:0116b27_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "龍乃降伏，長跪白佛言：「世尊！",
        "translation": "The dragon then subdued himself, knelt down, and said to the Buddha, \"Bhagavān!",
        "source": "T03n0155_002:0116b28_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今日特見苦酷。」",
        "translation": "Today, I'm especially seeing suffering and cruelty.\"",
        "source": "T03n0155_002:0116b29_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告龍曰：「何以懷惡苦惱眾生？」",
        "translation": "The Buddha told the dragon, \"Why do you harbor unwholesome suffering and afflict sentient beings?\"",
        "source": "T03n0155_002:0116c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "龍便頭面作禮稽首佛足，長跪白佛言：「願見放捨，世尊所勅我當奉受。」",
        "translation": "The dragon then bowed his head to the Buddha's feet, knelt down long enough, and said to him, \"I wish to see the renunciation, and I will accept the Bhagavān's order.\"",
        "source": "T03n0155_002:0116c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告龍曰：「當受五戒為優婆塞。」",
        "translation": "The Buddha told the dragon, \"You must accept the five precepts and become an upāsaka.\"",
        "source": "T03n0155_002:0116c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "龍及妻子盡受五戒為優婆塞，慈心行善不更霜雹，風雨時節五穀豐熟，諸疫鬼輩盡皆走去向毘舍離。",
        "translation": "The dragon and his wife all received the five precepts and became laymen. They were kind-hearted and did good deeds, didn't let frost and hail fall, and when the wind and rain came, the grains were abundant, and all the diseased spirits left and headed for Vaiśālī.",
        "source": "T03n0155_002:0116c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩竭國中人民飽滿，眾病除愈遂便安樂。",
        "translation": "The people of Maghā were filled to overflowing, and their illnesses were healed, and they were then left in comfort.",
        "source": "T03n0155_002:0116c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毘舍離人民疫病死者甚多，聞摩竭國佛在其中降伏惡龍疫病消滅，毘舍離王即遣使者往至佛所。",
        "translation": "When the people of Vaiśālī were sick and dying of epidemics, the king of Vaiśālī sent an envoy to the Buddha when he heard that the Buddha of Maghreb had subdued the evil dragons there and that the epidemics had gone away.",
        "source": "T03n0155_002:0116c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是使者前至佛所，稽首佛足長跪白佛言：「王故遣我來，稽首問訊如來大聖！",
        "translation": "The messenger then went to the Buddha, bowed his head at his feet, knelt down, and said to him, \"The king therefore sent me here to bow down and greet the Tathāgata as a great sage!",
        "source": "T03n0155_002:0116c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我國疫死者甚多，唯願世尊！",
        "translation": "Our country has suffered many deaths from epidemics, so may it please the Bhagavān!",
        "source": "T03n0155_002:0116c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大慈憐愍臨覆我國，勞屈光威望得全濟。」",
        "translation": "Great compassionate kindness comes to cover our country, and I labor under the prestige of Kukkuang to obtain complete relief.\"",
        "source": "T03n0155_002:0116c12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毘舍離國與摩竭國素有怨嫌，阿闍世王聞毘舍離國疫鬼流行，大用歡喜。",
        "translation": "The king of Ajātaśatru had heard that epidemics and ghosts were prevalent in Vaiśālī, and he was greatly delighted.",
        "source": "T03n0155_002:0116c13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊告毘舍離使：「我以先受阿闍世王九十日請，而今未竟，汝自往語阿闍世王。」",
        "translation": "The Bhagavān then addressed the Vaiśālī envoy, \"I accepted the 90-day invitation from King Ajātaśatru, but now I haven't finished, so go ahead and tell King Ajātaśatru.\"",
        "source": "T03n0155_002:0116c14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使白佛言：「二國素有怨嫌，我今往到必當見殺。」",
        "translation": "The envoy said to the Buddha, \"The two countries have long had enmity, and I'm sure I'll see them killed when I go there now.\"",
        "source": "T03n0155_002:0116c16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告使言：「汝但為佛作使，終無有能殺汝者也。」",
        "translation": "The Buddha told the envoy, \"You can only serve as an envoy for the Buddha, but there's no one who can kill you.\"",
        "source": "T03n0155_002:0116c17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛重告使言：「語阿闍世王：『殺父惡逆之罪，用向如來改悔故，在地獄中當受世間五百日罪，便當得脫。』」",
        "translation": "The Buddha again addressed the messenger, \"Tell the king of Ajātaśatru, 'For the heinous crime of killing your father, you will be punished by confessing to the Tathāgata for 500 days in hell, and then you will be freed.'\"",
        "source": "T03n0155_002:0116c18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使即受教往詣王門，王及群臣聞毘舍離使在於門外，咸共瞋恚，皆共議言：「當截其頭、刓其耳鼻，碎其身骨當使如麪。」",
        "translation": "The messenger then was instructed to go to the king's entrance, and when the king and his ministers heard that Vaiśālī's messenger was outside the entrance, they all became angry and agreed, saying, \"You will cut off his head, trim his ears and nose, and break his bones like flour.\"",
        "source": "T03n0155_002:0116c21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使入到殿前大唱聲言：「世尊遣我到大王邊。」",
        "translation": "The envoy went into the hall and shouted, \"The Bhagavān has sent me to the great king.\"",
        "source": "T03n0155_002:0116c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞是佛使，皆各歡喜。",
        "translation": "Everyone rejoiced when they heard that this was the Buddha's envoy.",
        "source": "T03n0155_002:0116c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王問使言：「佛遣汝來，何所告勅？」",
        "translation": "The king asked the envoy, \"What did the Buddha tell you when he sent you here?\"",
        "source": "T03n0155_002:0116c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使便答言：「佛謝大王。",
        "translation": "The envoy then replied, \"The Buddha thanks the king.",
        "source": "T03n0155_002:0116c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所作惡逆殺父之罪，用向如來懺悔之故，在於地獄當受世間五百日罪，便當得出。",
        "translation": "Because I confessed to the Tathāgata for the heinous act of killing my father, I'll be punished in hell for 500 days and then I'll be released.",
        "source": "T03n0155_002:0116c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯當自責改往修來，莫用愁憂。」",
        "translation": "You must only criticize yourself, correct your past, and cultivate it; don't be sad.\"",
        "source": "T03n0155_002:0116c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞是語，歡喜踊躍不能自勝：「我造逆罪，在於地獄為有出期。」",
        "translation": "When the king heard those words, he rejoiced and jumped up and down, unable to contain himself, \"I've committed a heinous sin and I'll never escape from hell.\"",
        "source": "T03n0155_002:0116c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即遙向佛稽首作禮。",
        "translation": "He bowed his head at a distance to the Buddha.",
        "source": "T03n0155_002:0117a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王語使言：「汝能為我致此消息，快不可言。",
        "translation": "The king said to the messenger, \"I can't tell you how pleased I am that you've been able to give me this news.",
        "source": "T03n0155_002:0117a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲求何願，恣當與汝！」",
        "translation": "What do you wish, I will grant it to you!\"",
        "source": "T03n0155_002:0117a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使白王言：「毘舍離國疫病流行，欲得請佛光臨國界望得全濟，唯願大王聽佛使去。」",
        "translation": "The envoy said to the king, \"The epidemic is widespread in Vaiśālī, and I'd like to invite the Buddha to visit the country's borders in the hope of getting complete relief; please, Your Majesty, let the Buddha's envoy go.\"",
        "source": "T03n0155_002:0117a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即可之，便報使言：「語汝大王，我從城門到恒水邊，修治道路以花布地，羅列幢幡到恒水邊，舉國兵眾侍送世尊到恒水邊；汝亦當從毘舍離城平治道路而散花香，羅列幢幡到恒水邊，舉毘舍離臣民兵眾，盡來迎佛到恒水邊。",
        "translation": "When he heard this, the king then reported to the envoy, \"I told you, great king, 'I went from the city gates to the edge of the Gaṅgā River, trained the roads, spread flowers on the ground, arranged banners and streamers to the edge of the Gaṅgā River, and raised the country's soldiers to escort the Bhagavān to the edge of the Gaṅgā River; you should also go from Vaiśālī to train the roads, spread flowers and fragrances, arrange banners and streamers to the edge of the Gaṅgā River, and raise a multitude of Vaiśālī's subjects and soldiers to welcome the Buddha to the Gaṅgā River.'",
        "source": "T03n0155_002:0117a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能爾者聽佛使去，不能爾者不放使去。」",
        "translation": "If he can do so, he'll listen to the Buddha's messengers, and if he can't, he won't let them go.\"",
        "source": "T03n0155_002:0117a10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毘舍離使聞王所使，歡喜踊躍，即便辭還到於佛所，頭面作禮白佛如是。",
        "translation": "When the Vaiśālī envoy heard about the king's mission, he rejoiced and jumped for joy, so he resigned and returned to the Buddha, paid homage to him with his head and face, and told him that he had done so.",
        "source": "T03n0155_002:0117a11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即可之。",
        "translation": "The Buddha then allowed him to do so.",
        "source": "T03n0155_002:0117a13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使便辭佛作禮而去，還毘舍離白王如是。",
        "translation": "The messenger then excused himself from the Buddha, paid homage, and departed, returning to Vaiśālī, he said to the king thus.",
        "source": "T03n0155_002:0117a13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞所言大用歡喜：「我曹國中亦須種福。」",
        "translation": "The king greatly rejoiced at what he heard, \"There must be some kind of merit in my country.\"",
        "source": "T03n0155_002:0117a14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便宣令平治道路，從於城門到恒水邊悉令清淨，布散諸花、燒眾名香、竪諸幢幡，毘舍離王舉國臣民，椎鍾鳴鼓作眾伎樂，到恒水邊迎佛世尊，持五百寶蓋貢上世尊。",
        "translation": "He then ordered the roads to be made smooth, made everything from the city gates to the Gaṅgā River clean, spread flowers, burned many famous incense sticks, and erected banners and streamers, and the king of Vaiśālī gathered his subjects, pealed bells, sounded drums, and made a multitude of music to go to the Gaṅgā River to greet the Bhagavān and carry five hundred jeweled canopies to present to the Bhagavān.",
        "source": "T03n0155_002:0117a15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩竭國王亦復宣令：「修治道路悉令清淨，布散花香、竪諸幢幡到恒水邊。」",
        "translation": "The king of Maghā also ordered, \"Make the roads completely clean, scatter flowers and put up banners and streamers, and go to the edge of the Gaṅgā River.\"",
        "source": "T03n0155_002:0117a19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與諸臣民舉國兵眾，椎鍾鳴鼓作眾伎樂震動天地，持送世尊到恒水邊，以五百寶蓋奉上世尊。",
        "translation": "He and his subjects raised a national army, struck bells, sounded drums, created a multitude of musical instruments that shook heaven and earth, carried the Bhagavān to the edge of the Gaṅgā River, and presented him with five hundred jeweled canopies.",
        "source": "T03n0155_002:0117a21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四天王、忉利天王上至化應聲天王各各皆與無數諸天，各齎天上異妙珍琦、雜種花香、若干伎樂，持五百寶蓋來貢上世尊。",
        "translation": "The four heavenly kings and the king of the Heaven of the Thirty-three gods up to the king of the Sounding Gods each brought an incalculable number of gods with exquisite treasures, various flowers and fragrances, and music from heaven, carrying five hundred jeweled lids to present to the Bhagavān.",
        "source": "T03n0155_002:0117a23_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第七梵天王上至首陀會天，是諸天王各與無數諸天子等，各齎天上雜妙香花若干伎樂，持五百寶蓋貢上世尊。",
        "translation": "The seventh Brahmadeva king went up to the Śuddhâvāsa gods, and each of those gods and countless other gods each brought a variety of wonderful fragrances, flowers, and music from heaven, carrying five hundred jeweled canopies to the Bhagavān.",
        "source": "T03n0155_002:0117a26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毘摩毘羅阿須倫王，與無央數阿須倫民，持於眾寶雜種花香、若干伎樂，五百寶蓋來奉上佛。",
        "translation": "King Vimalabhīra asurêndra and an incalculable number of asurêndra folk brought a multitude of treasures, various flowers, music, and five hundred jeweled canopies to present to the Buddha.",
        "source": "T03n0155_002:0117a29_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "娑竭龍王與無數諸龍眷屬，各齎若干種香、作眾伎樂，五百寶蓋來奉上世尊。",
        "translation": "The Sāgara-nāga-rāja and his countless nāga retinues each brought a variety of fragrances and music, and they presented 500 jeweled canopies to the Bhagavān.",
        "source": "T03n0155_002:0117b02_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "合三千蓋，唯留一蓋，餘蓋受之。",
        "translation": "Of the 3,000 lids that they combined, only one lid remained, and the others were accepted.",
        "source": "T03n0155_002:0117b04_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所留一蓋者，持用覆護後諸弟子，令得供養。",
        "translation": "The one lid that's left will be used to shield the disciples who follow it and make offerings to them.",
        "source": "T03n0155_002:0117b04_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當于爾時，諸天、人民、龍、阿須倫，不可稱計來至佛所，毘舍離王及諸臣民，皆言：「今佛當渡恒水，我曹當共作五百船使佛渡水。」",
        "translation": "At the time, an incalculable number of gods, people, dragons, and asuras came to the Buddha, and King Vaiśālī and his subjects said, \"Now, as the Buddha is about to cross the Gaṅgā River, we will build 500 boats together to carry him across the water.\"",
        "source": "T03n0155_002:0117b05_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩竭國王及諸臣民，亦言：「今日佛當渡水，我曹亦當作五百船令佛渡水。」",
        "translation": "The king of Magadha and his subjects also said, \"Today, as the Buddha is crossing the Gaṅgā River, we will also make 500 boats for the Buddha to cross the water.\"",
        "source": "T03n0155_002:0117b08_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天亦各作五百寶船，諸阿須倫亦復共作五百寶船。",
        "translation": "The gods also each made five hundred jeweled boats, and the asuras also made five hundred jeweled boats together.",
        "source": "T03n0155_002:0117b10_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時，諸龍自共編身作五百橋，欲令世尊蹈上而渡。",
        "translation": "The dragons then made five hundred bridges out of their own bodies, hoping to get the Bhagavān to cross them on foot.",
        "source": "T03n0155_002:0117b11_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊見於諸天、一切人民、龍、阿須倫，各各歡喜有恭敬心，欲使眾生普得其福，即便化身遍諸船上；諸天，人民，龍，阿須倫，皆各自見如來世尊獨在我船不在餘船。",
        "translation": "Seeing the gods, all the people, the dragons, and the asuras, each rejoicing and respectful, and wanting to make their merits widely available to sentient beings, the Bhagavān then transformed himself into a body that spread out over the boats; the gods, the people, the dragons, and the asuras each saw the Bhagavān alone in my boat and in no other boat.",
        "source": "T03n0155_002:0117b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是如來渡水已竟，無數諸天畟塞虛空，散眾名花、燒異妙香、作諸伎樂，人及諸龍并阿須倫，皆亦如是散眾名華、燒眾雜香、作諸伎樂，娛樂世尊歡喜無量。",
        "translation": "After the Tathāgata finished crossing the water, measureless gods spread out in the sky, scattering famous flowers, burning exotic incense, and making music, and so did the dragons and asuras, scattering famous flowers, burning various incense, and making music, entertaining the Bhagavān with incalculable joy.",
        "source": "T03n0155_002:0117b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時，如來觀於三界諸天人民，心懷歡喜踊躍無量供養如來，世尊將欲說於前世本所修行菩薩道時，即便微笑，五色光明從口中出，光有五分，一一光頭出無數明，一一光頭有寶蓮花，一一花上皆有化佛，一分光明上照欲界、色界、無色界。",
        "translation": "When the Tathāgata observed the people of the three realms jumping for joy and making measureless offerings to the Tathāgata, the Bhagavān smiled as he was about to explain the bodhisattva path that he had practiced in previous lifetimes, and a five-colored light emerged from his mouth, a light that had five parts, each with an incalculable number of lights, each with a jeweled lotus flower, each with a transformation Buddha on top, and one part of the light that shone upward into the desire realm, the form realm, and the formless realm.",
        "source": "T03n0155_002:0117b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三界諸天見其光明，又覩化佛皆悉歡喜，各離欲樂、來詣化佛所聽說經法。",
        "translation": "Seeing that light, the gods of the three realms rejoiced when they saw the transformation buddha, each parting with desire and pleasure and going to the transformation buddha to hear the sūtras and teach the Dharma.",
        "source": "T03n0155_002:0117b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量諸天聞說經法歡喜踊躍，皆各得道迹、往來、不還、無著證者，發大道意入不退轉者。",
        "translation": "Measureless gods rejoice and jump for joy when they hear the teachings of the sūtras, and they each attain realization of the path's steps, rebirth, irreversibility, and nonattachment, and they arouse the great intention to enter irreversibility.",
        "source": "T03n0155_002:0117b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一分光明遍照三千大千世界在人道者，光明化佛彌滿世界，一切人民見其光明又覩化佛，瞋恚盛者忿意消滅皆發慈心，婬火盛者欲心消除觀其瑕穢，愚癡盲冥皆悉醒寤解四非常，牢獄繫閉悉皆放解，盲者得視，聾者得聽，啞者能語，拘躄者得手足，癃殘百病皆悉除愈。",
        "translation": "When a part of their light shines throughout the 3,000 great one-thousand worlds, those human beings are filled with brightly illuminated transformation buddhas, and all the people see their light and the transformation buddhas, those with intense anger cease their anger and become compassionate, those with lustful fires remove their desire and observe their defilements, those who are dull and blind are all awakened and liberated from the four immoralities, those who are imprisoned and shut down are all released, those who are blind can see, those who are deaf can hear, those who are dumb can speak, those who are constricted can get their hands and feet, and those who have a hundred illnesses are all healed.",
        "source": "T03n0155_002:0117b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切人民莫不歡喜，各離所樂來詣佛所。",
        "translation": "All the people rejoiced and left their pleasures to go to the Buddha.",
        "source": "T03n0155_002:0117c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸化佛各各說法，心意開解，或得道迹、往來、不還、無著之果，發於無上正真道意，堅住大乘不退轉者，不可稱計。",
        "translation": "The transformation buddhas then each taught the Dharma, enlightened their minds, sometimes attained the results of the path, past and future, irreversibility, and nonattachment, aroused the unsurpassed true intention of the path, and firmly abided in the great vehicle without turning back, which cannot be counted.",
        "source": "T03n0155_002:0117c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一分光明照於一切餓鬼境界，光明化佛悉遍餓鬼境界之處，諸餓鬼等見佛光明，自然飽滿無有飢渴，身心清淨無諸惱熱。",
        "translation": "When a part of his light shines in the realms of all hungry ghosts, the illuminating transformation buddha completely pervades the realms of hungry ghosts, and when they see the Buddha's light, they are naturally satisfied and have no hunger or thirst, and their bodies and minds are purified and free of affliction and fever.",
        "source": "T03n0155_002:0117c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞其說法皆悉歡喜慳垢消滅，壽終之後皆得生天。",
        "translation": "Hearing his teaching, they're all delighted when his stinginess and parsimony disappear, and they're all born in the heavens when their lives end.",
        "source": "T03n0155_002:0117c13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一分光明照於大千畜生境界，一切禽獸見佛光明，皆悉歡喜善心自生。",
        "translation": "When a part of that light shines in a great chiliocosm, all the animals that see the Buddha's light are delighted and have good hearts of their own.",
        "source": "T03n0155_002:0117c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虎狼師子龍蛇毒惡之心皆悉消滅，慈心相向不相傷害，壽終之後皆生天上。",
        "translation": "The venomous hearts of tigers, wolves, lions, dragons, and snakes all perish, and they are kind and directed toward each other, not harming each other, so that they're all born in the heavens after their life spans end.",
        "source": "T03n0155_002:0117c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一分光明遍照大千地獄，鐵圍山間幽冥之處莫不明徹，一切地獄眾生之類見其光明，又覩化佛歡喜踊躍，火滅湯冷，拷治酷毒皆得休息，冰寒獄中自然熅煖。",
        "translation": "When a part of that light shines universally in a great chiliocosm, no place in the darkness between the iron mountains is left unexplored, and all the sentient beings in hell see that light and see the transformation buddha rejoicing and jumping for joy, the fires go out and the hot water goes cold, the tortures and poisons get rest, and the freezing cold prison naturally warms them up.",
        "source": "T03n0155_002:0117c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地獄眾生既得休息歡喜踊躍，諸化佛等各為說法，心開意解，即時壽終盡得生天。",
        "translation": "Once the hell-bound sentient beings are at rest and rejoice, the transformation buddhas each speak to them, opening their minds and liberating their thoughts, and they are then born in heaven at the end of their lives.",
        "source": "T03n0155_002:0117c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當于是時，光明、化佛彌滿三千大千世界，五道眾生皆得度脫。",
        "translation": "At that point, that light and transformation buddha fills 3,000 great thousand worlds, and sentient beings in the five destinies are all liberated.",
        "source": "T03n0155_002:0117c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡於如來光明入處各有所應：欲說地獄事，光從足下入：欲說畜生事，光從足上入：欲說餓鬼事，光從脛踝入：欲說人道事，光從髀入：欲說轉輪聖王事，光從臍入：欲說羅漢事，光從口入：欲說辟支佛事，光從眉間入：欲說菩薩事，光從頂入：欲說過去事，光從後入：欲說當來今現在事，光從前入。",
        "translation": "There was a place where the Tathāgata's light entered: to teach about hell, the light entered from the bottom of the feet; to teach about animals, the light entered from the top of the feet; to teach about hungry ghosts, the light entered from the shins and ankles; to teach about humans, the light entered from the thighs; to teach about wheel-turning sage kings, the light entered from the navel; to teach about arhats, the light entered from the mouth; to teach about pratyekbuddhas, the light entered from between the eyebrows; to teach about bodhisattvas, the light entered from the top of the head; to teach about the past, the light entered from the back; to teach about the future and present, the light entered from the front.",
        "source": "T03n0155_002:0117c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊現大變化，光明普照十方世界，大千境界雨眾天花，無量伎樂不鼓自鳴，諸天人民一切大眾，莫不歡喜倍加踊躍。",
        "translation": "At that point, the Bhagavān appeared in a great transformation, his light shone universally in the worlds of the ten directions, a great chiliocosm rained down multitudes of flowers, measureless music and music played without drumming, and all the gods and people and the masses rejoiced and rejoiced.",
        "source": "T03n0155_002:0118a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊還攝神足，光明便還遶佛三匝，光從後入。",
        "translation": "The Bhagavān then returned to taking in his spiritual feet, and the radiance then circled the Buddha three times and entered from behind.",
        "source": "T03n0155_002:0118a06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量諸天一切大眾，異口同音讚歎：「如來功德巍巍難量，不可思議乃如是乎！」",
        "translation": "With one voice, the whole multitude of gods praised, \"The Tathāgata's virtue is so lofty and immeasurable, it's unfathomable that it could be like this!\"",
        "source": "T03n0155_002:0118a07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是阿難長跪叉手，前白佛言：「佛不妄笑，笑必有因。",
        "translation": "Ānanda then knelt down and saluted the Buddha with his palms together, saying, \"The Buddha doesn't laugh falsely; there must be a reason for his laughing.",
        "source": "T03n0155_002:0118a09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今日世尊欣笑如是，將欲自說先世宿行。」",
        "translation": "Today, the Bhagavān is delighted to laugh like this because he wants to tell us about his past lives.\"",
        "source": "T03n0155_002:0118a10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難及諸大眾：「乃昔過去久遠無量無數世時，此閻浮提有轉輪王，名修陀梨鄯寧，王四天下，此閻浮提八萬四千諸小國王，八萬四千城。",
        "translation": "The Buddha told Ānanda and the crowd, \"Once upon a time, long ago and in an uncountable and incalculable number of lifetimes, there was a wheel-turning king in Jambudvīpa named Śuddhārī Sanin, who ruled four worlds, 84,000 small states and 84,000 cities in Jambudvīpa.",
        "source": "T03n0155_002:0118a11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王有七寶：一金輪寶，輪有千輻，縱廣四十里，周匝百二十里，王欲行時輪在前導，不賓伏者金輪自然在頭上旋，自然降伏不用兵仗。",
        "translation": "The king has seven treasures: a golden-wheeled jewel with a thousand spokes that measures 40 miles in length and 120 miles in circumference. When the king desires to travel, the wheel leads him, and if he doesn't submit to it, the golden wheel naturally spins above his head and naturally subdues him without using weapons.",
        "source": "T03n0155_002:0118a14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二摩尼珠寶，著於幢頭，晝夜常照千六百里。",
        "translation": "Second, there's a jewel of a maṇi gem that's placed at the head of a banner and shines for 1,600 miles day and night.",
        "source": "T03n0155_002:0118a17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三白象寶，其象身體優脩姝好白如雪光，王乘其上自然飛行，一食之頃周四天下。",
        "translation": "Third, the white elephant treasure, whose body is beautiful and refined, as white as snow, naturally causes the king to fly on it, and it takes up the whole world in a single meal.",
        "source": "T03n0155_002:0118a18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四紺馬寶，朱色髦尾，王乘其上一食之頃遍四天下。",
        "translation": "Four violet horse jewels with vermilion-colored, funky tails, on which the king rides for four whole worlds in an instant when he eats.",
        "source": "T03n0155_002:0118a20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五典兵臣，王意欲得百千萬兵，自然而至。",
        "translation": "Five canonical ministers of war, when the king desires to gain a hundred million troops, they naturally arrive.",
        "source": "T03n0155_002:0118a21_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六典藏臣，王意欲須金銀七寶衣被飲食，披其兩手七寶財產一切所須，隨意所欲從手中出而無有盡。",
        "translation": "Six, the treasurer of the store, when the king desires gold and silver, seven-jeweled robes, food, and drink, he drapes his two hands with seven-jeweled possessions and whatever he needs, as he wishes, comes out of his hands without limit.",
        "source": "T03n0155_002:0118a22_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七玉女寶，端正無比猶若天女，無有女人瑕穢之垢，身體香潔如優鉢花，王意欲得清涼之時，身自然冷，欲得溫時，身自然溫，聲如梵聲常能使王歡喜踊躍，名曰玉女寶。",
        "translation": "A jeweled woman of unsurpassed rectitude who's like a goddess, without the stain of a woman's blemishes, with a body as clean and fragrant as a superior flower, who naturally cools when the king desires coolness and warms when he desires warmth, and whose voice is like the voice of Brahmā and always causes the king to rejoice and dance, is called a jeweled woman.",
        "source": "T03n0155_002:0118a25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王有千子勇猛無比。",
        "translation": "The king has a thousand sons who are unsurpassed in courage.",
        "source": "T03n0155_002:0118a29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王欲出時，七寶大蓋常在其頭上，七寶隨從，群臣無數導從前後，百千伎樂其音和雅，巍巍堂堂不可稱計。",
        "translation": "\"When the king desires to leave, a great canopy of seven treasures is always at his head, followed by seven treasures, numerous ministers who guide him, and a hundred thousand musicians whose sounds are soothing and elegant that their lofty presence can't be counted.",
        "source": "T03n0155_002:0118a29_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王千子中其最小者，見王如是，問其母言：『此何國王巍巍如是？』",
        "translation": "The youngest of the king's thousand sons saw the king like this and asked his mother, 'What king of this country is so majestic and lofty?'",
        "source": "T03n0155_002:0118b03_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其母答言：『此是修陀梨鄯寧大轉輪王，主四天下，汝之父也。",
        "translation": "His mother replied, 'This is the great wheel-turning king Shudrasanin, who rules the four worlds and is your father.",
        "source": "T03n0155_002:0118b04_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不識之耶？』",
        "translation": "Don't you know him?'",
        "source": "T03n0155_002:0118b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子報言：『我當何時，應得為王？』",
        "translation": "The prince answered, 'When shall I become king?'",
        "source": "T03n0155_002:0118b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母復答言：『王有千子，汝第一小，不應得王。』",
        "translation": "Again, his mother answered, 'The king has a thousand sons; you're the youngest and shouldn't be king.'",
        "source": "T03n0155_002:0118b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子復言：『若不應得為王者，何用在家作白衣為？』",
        "translation": "The prince again said, 'If you shouldn't be king, why would you be at home as a white-clothed man?'",
        "source": "T03n0155_002:0118b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便長跪白其母言：『願聽出家作沙門，詣山澤中學於仙道。』",
        "translation": "He knelt down long enough and said to his mother, 'May I leave home, become an ascetic, and go to a mountain or a swamp to study in the immortal path?'",
        "source": "T03n0155_002:0118b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母即聽之，其母告言：『若汝思惟所得智慧，必還語我。』",
        "translation": "His mother then listened, and she told him, 'If you contemplate the wisdom you've gained, you'll surely tell me back.'",
        "source": "T03n0155_002:0118b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兒即許之。",
        "translation": "The boy then gave his permission.",
        "source": "T03n0155_002:0118b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「即便剃頭而著袈裟，詣於山澤精進坐禪思惟智慧，內解五陰、外了萬物皆悉非常，一切受身眾苦之器，飛輪王帝豪儁世主三界尊榮，猶若幻化空無吾我，緣會則有緣離則無，皆從癡愛因有諸行，以有諸行受一切身，五道之分便有眾苦。",
        "translation": "\"Even after shaving his head and putting on the reddish-brown robes, he went to sit intensely in meditation in a mountain swamp and contemplated wisdom, understanding that the five aggregates on the inside and all things on the outside are completely impermanent, that all bodies that are subject to suffering, flying wheel-turning kings, the great and powerful lords of the world, and the honored ones in the three realms are like illusory transformations that are empty of self, that are contingent on meeting, then exist, and that are contingent on avoiding, then don't exist, that are all the causes of delusion and craving, that are the causes of conditioned actions, that are subject to all bodies because of conditioned actions, and that are the result of the five destinies of suffering.",
        "source": "T03n0155_002:0118b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無癡愛則無諸行，以無諸行則無五道，以無五道則不受身，以無有身眾苦便滅。",
        "translation": "If there's no craving for delusion, then there are no actions, and because there are no actions, then there are no five paths; because there are no five paths, then I don't receive a body, and because there's no body, the many sufferings cease.",
        "source": "T03n0155_002:0118b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟如是，霍然意解成辟支佛，飛騰變化六通清徹無所罣礙。",
        "translation": "Thinking about it this way, he suddenly resolves his thoughts and becomes a pratyekabuddha, soaring and changing with the six supernormal powers clear and unobstructed.",
        "source": "T03n0155_002:0118b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如其本誓便還見母，現其神足身昇虛空經行坐臥，身上出水、身下出火，身上出火、身下出水，分一身作百作千作萬無數，還合為一。",
        "translation": "As he had originally vowed, he then sees his mother again, manifests his miraculous legs as a body that rises into space, travels, sits, and lies down, produces water from his body, fire from beneath his body, fire from his body, and water from beneath his body, and divides his body into a hundred, one hundred, thousand, and ten thousand incalculable creations, which merge back into one.",
        "source": "T03n0155_002:0118b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其母見之歡喜踊躍頭面作禮。",
        "translation": "When his mother sees this, she leaps for joy, prostrates herself with her head and face.",
        "source": "T03n0155_002:0118b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母復問言：『從何所而得飲食？』",
        "translation": "She then asked, 'Where did he get his food and drink?'",
        "source": "T03n0155_002:0118b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『乞匃自存。』",
        "translation": "She replied, 'I'll beg for food and keep it for myself.'",
        "source": "T03n0155_002:0118b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母復白言：『莫更乞食，當受我請。",
        "translation": "Again, the mother said, 'Don't beg for food anymore; accept my invitation.",
        "source": "T03n0155_002:0118b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今以往在此園中住，願當日日受我飲食，亦當使我得其福德。』",
        "translation": "From now on, if you stay here in the garden, accept my food day after day, and it will help me attain virtue.'",
        "source": "T03n0155_002:0118b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，辟支佛便受母請住於園中，其母日日自往飯之。",
        "translation": "Prajñāpāramitā then accepted his mother's invitation to stay in the garden, and his mother went to the garden to eat every day.",
        "source": "T03n0155_002:0118b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼園中經涉數年，思惟身分瑕穢不淨，身為苦器何用此為？",
        "translation": "After spending several years in that garden, he thought, 'Why would I use this as a vessel for suffering when my identity is so blemished and impure?'",
        "source": "T03n0155_002:0118b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便捨身命入於泥洹而般泥洹。",
        "translation": "He then gave up his life, entered nirvāṇa, and became a nun.",
        "source": "T03n0155_002:0118c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其母即便耶旬起塔花香供養。",
        "translation": "His mother then raised a stūpa and offered flowers and incense to pay homage to him.",
        "source": "T03n0155_002:0118c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王於異時，到此園中，見此塔即問左右：『而此園中素無是塔，誰起此塔？』",
        "translation": "\"When the king arrived at this garden at another time, he saw this stūpa and asked his attendants, 'Who built this stūpa when there was no such stūpa in this garden?'",
        "source": "T03n0155_002:0118c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "辟支佛母即便白言：『是王太子之中第一小者。",
        "translation": "Even though the mother of the pratyekabuddhas said, 'This is the first and least among the king's princes.",
        "source": "T03n0155_002:0118c04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見王出時，而問我言：「是何大王巍巍如是？」",
        "translation": "When he saw the king emerge, he asked me, 'What is this great king who stands out like this?'\"",
        "source": "T03n0155_002:0118c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我即答言：「修陀梨鄯寧轉輪聖王，是卿之父。」",
        "translation": "I then answered, \"Sundarī Sanin, the wheel-turning sage king, is your father.\"",
        "source": "T03n0155_002:0118c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復問我言：「我當何時，應得為王？」",
        "translation": "Again, he asked me, \"When will I become king?\"",
        "source": "T03n0155_002:0118c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我語之曰：「汝於千子第一最小，不應得王。」",
        "translation": "I said to him, \"You're the youngest of a thousand sons, and you shouldn't be king.\"",
        "source": "T03n0155_002:0118c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其子便言：「若使不得應作王者，何用在家作白衣為？」",
        "translation": "His son then said, \"If you couldn't be a king, why would you be at home as a white-clothed man?\"",
        "source": "T03n0155_002:0118c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便辭我出家學道，我便聽之。",
        "translation": "He then asked me to leave home and train on the path, and I listened.",
        "source": "T03n0155_002:0118c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我與共要：「若得道者必還見我。」",
        "translation": "I shared with them the principle, \"If I attain enlightenment, I'll surely return to you.\"",
        "source": "T03n0155_002:0118c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剃除鬚髮著於袈裟，詣山澤中精進坐禪成辟支佛道。",
        "translation": "He shaved off his hair and put on the reddish-brown robes, went to a mountain or swamp, and diligently meditated to achieve the path of the pratyekabuddhas.",
        "source": "T03n0155_002:0118c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如其所誓便還見我。",
        "translation": "According to his vow, he'll then return to see me.",
        "source": "T03n0155_002:0118c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我即請之在此園中，日日供養飲食所須。",
        "translation": "I then invited him to stay here in the garden and provide daily for his food and drink.",
        "source": "T03n0155_002:0118c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經歷數年便般泥洹，在此耶旬起於塔廟。",
        "translation": "After several years, he then became a nun and raised a stūpa here in Jeta.",
        "source": "T03n0155_002:0118c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是其塔也。』",
        "translation": "This is his stūpa, too.'",
        "source": "T03n0155_002:0118c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王聞此語且悲且喜，答夫人言：『何不語我？",
        "translation": "\"Hearing these words, the king was both saddened and delighted, and he answered the lady, 'Why didn't you say something to me?'",
        "source": "T03n0155_002:0118c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我即當以轉輪王位而用與之，我不得聞大有折減。",
        "translation": "I will then use my position as wheel-turning king to give it to him, and I won't hear of any great discount.",
        "source": "T03n0155_002:0118c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而今雖死，我以王位而用與之。』",
        "translation": "Now, even though I'm dead, I'll give it to him in exchange for his position as king.'",
        "source": "T03n0155_002:0118c18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即脫天冠七寶拂飾王者威服，著於塔上，王大七寶蓋用覆塔上頭面作禮，花香供養伎樂娛樂。」",
        "translation": "He then took off the king's regalia, which was adorned with the crown of heaven and a seven-jewel duster, and placed it on the stūpa, covered it with the king's large seven-jewel lid, paid homage with his head and face, and entertained it with flowers, incense, and offerings.\"",
        "source": "T03n0155_002:0118c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「乃昔爾時，修陀梨鄯寧轉輪王者，今我身是。",
        "translation": "The Buddha told Ānanda, \"At the time, Śuddhârṣana was a wheel-turning king, and now I am him.",
        "source": "T03n0155_002:0118c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而我爾時，自我之子成辟支佛供養其塔，而以王位而用施之，大七寶蓋覆於塔上，因是功德無央數劫作轉輪王，主四天下，七寶隨從，常有三千七寶之蓋自然而至。",
        "translation": "At the time, my son became a pratyekabuddha and made offerings to his stūpa, giving him the position of king and covering it with a large seven-jewel lid.",
        "source": "T03n0155_002:0118c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無央數劫，或作天帝、或作梵王，至于今日。",
        "translation": "For measureless eons, he may have been a god or a priest king up to this day.",
        "source": "T03n0155_002:0118c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我不取佛者，三千寶蓋常自然至無有窮盡。",
        "translation": "If I didn't take the Buddha, the 3,000 jeweled canopies would always come naturally, reaching no limit.",
        "source": "T03n0155_002:0118c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "供養一辟支佛塔，受其功德不可窮盡，何況供養如來色身，及滅度後舍利起塔、作佛形像供養之者，計其功德過踰於彼，百千億倍，不可計倍，無以為喻。」",
        "translation": "The merits of making offerings to a single pratyekabuddha stūpa cannot be exhausted, so why wouldn't I make offerings to the Tathāgata's physical body, erect a stūpa from his relics after his cessation, and make an image of the Buddha to make offerings to him, considering their merits to be greater than that, ten billion times greater than that, incalculable, and beyond compare?\"",
        "source": "T03n0155_002:0118c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時，大眾皆大歡喜心悅意解，應時有得須陀洹者，斯陀含者，阿那含者，阿羅漢者，或發無上正真道意者，或住立不退轉者，不可稱計。",
        "translation": "At the time, the whole crowd was greatly elated and their hearts and minds were filled with joy, and there were incalculable numbers of people who had attained stream entry, once-returner, non-returner, arhat, or those who had arisen the intention to follow the unsurpassed true path or who had remained in a position of nonretrogression.",
        "source": "T03n0155_002:0119a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，大眾皆大歡喜，遶佛三匝頭面作禮各還本所。",
        "translation": "At that point, the whole crowd rejoiced greatly as they circled the Buddha three times, paid homage with their heads and faces, and returned to their original homes.",
        "source": "T03n0155_002:0119a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊進至毘舍離城，到門閫上，而說偈言：「在地諸天神，　　虛空住諸天，　諸來在此者，　　皆當發慈心。",
        "translation": "The Bhagavān then entered Vaiśālī and went up to the gate watchtower and spoke a verse, saying, \"The gods on the ground and the gods living in space should all be compassionate when they come here.",
        "source": "T03n0155_002:0119a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　晝夜懷歡喜，　　當隨正法言，　勿得懷害意，　　嬈惱諸人民。」",
        "translation": "Rejoice day and night, and follow the words of the right teaching; don't harbor harmful thoughts that would disturb the people.\"",
        "source": "T03n0155_002:0119a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說菩薩本行經卷中",
        "translation": "Foshuo pusa bujian jing zhong",
        "source": "T03n0155_002:0119a14_0",
        "is_bad_quality": false
    }
]