[
    {
        "source_sentence": "佛本行集經卷第四十三",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Volume 43",
        "source": "T03n0190_043:0852a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隋天竺三藏闍那崛多譯",
        "translation": "Sui Tianzhu Tripiṭaka Jñānagupta Translation",
        "source": "T03n0190_043:0852a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波斯那品下",
        "translation": "inferior to the chapter on Upāsaka",
        "source": "T03n0190_043:0852a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，商主及眾賈人至海洲已，值於種種諸雜珍寶，彼等收拾，滿其船舶，還至岸邊，收歛寶貨，欲向本國。",
        "translation": "\"After they arrived at the ocean island, the merchant and his entourage came upon a variety of various treasures, which they packed up and filled with their ships, returned to the shore, gathered up their treasures, and headed for their home country.",
        "source": "T03n0190_043:0852a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中間路上，遇見一塔，其塔乃是迦葉世尊、多陀阿伽度、阿羅呵、三藐三佛陀舍利之塔，其塔破壞，基陛頹落，處處墮墜。",
        "translation": "On their way there, they came upon a stūpa that was the stūpa of the relics of the Bhagavān Kāśyapa, Dharmagupta, Ālāha, and Samyak-saṃbuddha, which had been destroyed, its foundations decayed, and it had fallen down in various places.",
        "source": "T03n0190_043:0852a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是見已，而彼最長商主告於餘二商主及眾商言：『汝諸人輩！",
        "translation": "After seeing this, the longest merchant addressed the other two merchants and the merchants, saying, 'You people!",
        "source": "T03n0190_043:0852a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若知我等不惜身命，為求財故，入彼大海，而今彼處得利迴還，至於此間，我等今者亦可共作來世利益善業因緣。",
        "translation": "If you knew that we had spared nothing of our lives and entered that ocean in search of riches, and now we've regained profit there and returned here, you and I could work together to create causes and conditions for good actions in the future.",
        "source": "T03n0190_043:0852a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如舊智人所說偈言：「『「福德之力成多利，　　人得利故放逸生，　　　放逸則無持戒心，　　以是因緣墮地獄。」』",
        "translation": "As an old wise man once said in a verse, \"'The power of good fortune produces much prosperity, and when people get profit, carelessness arises, and when they are careless, they don't have the mind to observe precepts; it's the cause and condition for falling into hell.'",
        "source": "T03n0190_043:0852a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，商主說是偈已，復更告言：『汝等當知！",
        "translation": "\"After speaking this verse, the merchant then further addressed the audience, saying, 'You must know this!",
        "source": "T03n0190_043:0852a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，我等今者應當運心，共歛錢財，隨意多少，料理於此迦葉如來舍利之塔。』",
        "translation": "For this reason, we should now collectively gather money and property, as much or as little as we like, to build this stūpa of the Kāśyapa Tathāgata's relics.'",
        "source": "T03n0190_043:0852a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，彼等諸商主輩及眾商人，同共諮白長商主言：『大善商主！",
        "translation": "At that point, those merchant leaders and the merchants consulted the head merchant together, saying, 'Great, good merchant leader!",
        "source": "T03n0190_043:0852a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若歛錢，當自作主，撿挍營造，我等隨心所出多少錢財與之。』",
        "translation": "If you want to accumulate money, you must decide for yourself how much money you want to give to us for the purpose of inspecting and building it.'",
        "source": "T03n0190_043:0852a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，長商主如是辭言：『我不堪為撿挍之主。",
        "translation": "\"The longtime merchant then said, 'I couldn't possibly be the owner of the donations.'",
        "source": "T03n0190_043:0852a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0190_043:0852b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我事緣多，不能修理此之壞塔，我若料理營此塔者，則我家中妨廢生活。』",
        "translation": "I'm too busy to repair this broken stūpa, and if I were to take care of the stūpa, it would be a hindrance to the life of my family.'",
        "source": "T03n0190_043:0852b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等商人及二商主，慇懃多時，相共勸請，遣令撿校。",
        "translation": "Those merchants and the two merchant owners took much time to entreat each other to send it to be inspected.",
        "source": "T03n0190_043:0852b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時彼等諸商人輩，速疾隨出多少錢財，而付與之。",
        "translation": "Those merchants then quickly gave them as much money as they could carry.",
        "source": "T03n0190_043:0852b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，優婁頻螺迦葉，修營彼塔，即自別造第一覆盆，安置其上，其次即是那提迦葉第二覆盆，其次，復是伽耶迦葉第三覆盆。",
        "translation": "\"Ulūkaśvara Kāśyapa then built that stūpa and placed the first covered pot separately on top of it, followed by Nadī-Kāśyapa's second covered pot, and then Gayā-Kāśyapa's third covered pot.",
        "source": "T03n0190_043:0852b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是次第，通彼商人及商主等，詳共料理迦葉如來舍利之塔，破壞崩落，皆使端嚴，還如初造。",
        "translation": "In this order, they shared with the merchants and business owners the task of taking care of the Kāśyapa Tathāgata's relics' stūpa, destroying it and crumbling it down so that it was properly decorated like it had been built in the first place.",
        "source": "T03n0190_043:0852b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "料理訖已，發如是願：『願我等輩！",
        "translation": "After they finished taking care of it, they made this vow: 'May we!",
        "source": "T03n0190_043:0852b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來世中，還共值遇如是世尊，既值遇已，於彼世尊所說法教，復願我等速疾證知，願於來世世世生生，莫墮三惡四趣之中。』」",
        "translation": "In a future life, we'll meet such a Bhagavān again, and after meeting him, may we quickly realize what he teaches and may we not fall into the three bad destinies or the four rebirths in the next life.'\"",
        "source": "T03n0190_043:0852b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘：「汝等當知！",
        "translation": "The Buddha told the monks, \"You should know this!",
        "source": "T03n0190_043:0852b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼三迦葉千商人者，今三長老并及一千比丘是也。",
        "translation": "Those three Kāśyapa monks and the thousand merchants are the three elders and one thousand monks of today.",
        "source": "T03n0190_043:0852b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸比丘！",
        "translation": "And monks!",
        "source": "T03n0190_043:0852b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時優婁頻螺迦葉，昔日以諸商人多時慇懃勸請，始肯撿校。",
        "translation": "\"In the past, Uruvilvā-Kāśyapa was persuaded by merchants to take charge of his school after many hours of entreaty.",
        "source": "T03n0190_043:0852b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以彼業故，今於我前，多時方始受於我化。",
        "translation": "Because of that action, it took a lot of time before he was transformed by me.",
        "source": "T03n0190_043:0852b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當於爾時，那提迦葉、伽耶迦葉二商主等，及諸商人，暫發一言：『隨心多少，速出錢財。』",
        "translation": "At the time, the two merchant masters Nadī-Kāśyapa and Gayā-Kāśyapa and the merchants temporarily said, 'According to your heart's desire, quickly give me money and possessions.'",
        "source": "T03n0190_043:0852b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是業報，今日速疾承受我化。",
        "translation": "As a result of this action, today they'll quickly accept my transformation.",
        "source": "T03n0190_043:0852b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時，優婁頻螺迦葉最長商主，先於迦葉如來世尊舍利塔上第一覆盆，以用供養，因彼業報，今日得於五百人中最為其首，最勝最妙，最為第一。",
        "translation": "The longest merchant Uluvilvā-Kāśyapa had first placed the first covered basin on the Venerable Kāśyapa's Śāriputra with offerings, and as a result of that karmic reward, today he's the foremost among 500 people, the most excellent, the most marvelous, and the best.",
        "source": "T03n0190_043:0852b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "那提迦葉第二覆盆，因彼業報，今為三百梵志作首，而得第一。",
        "translation": "Nadī-Kāśyapa was the second to cover the basin, and because of the results of his actions, today he's the head of 300 priests and has attained the rank of first.",
        "source": "T03n0190_043:0852b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伽耶迦葉第三覆盆，因彼業報，今作二百螺髻梵首，而得第一。",
        "translation": "Gayā-Kāśyapa, the third overwhelming basin, now makes 200 conch-tufted priest heads because of the results of their actions, and they've been given the highest rank.",
        "source": "T03n0190_043:0852b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼等發如是願：『願我未來生生世世，莫墮惡道及以地獄。』",
        "translation": "\"At the time, they made this vow, 'May I never fall into a bad path or into hell in future lifetimes.'",
        "source": "T03n0190_043:0852b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因彼業報，不入惡道乃至地獄，恒生人天，受於快樂。",
        "translation": "As a result of the retribution of their actions, they won't enter a bad destiny or even hell and will always be born among humans and enjoy happiness.",
        "source": "T03n0190_043:0852c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又其彼等共見迦葉佛舍利塔破壞，料理還得如舊，心發是願：『願於我等未來世中，還得值遇如是世尊，既值遇已，彼世尊邊，有所說法，我等聞已速疾證知。』",
        "translation": "Seeing the destruction of Kāśyapa's stupa and its restoration to its original condition, they all made this vow: 'May we meet such a Bhagavān again in a future life, and once we meet him, he'll deliver a teaching to us that we'll quickly realize after hearing it.'",
        "source": "T03n0190_043:0852c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因彼業報，今值遇我，即得出家，受具足戒，得羅漢果。」",
        "translation": "As a result of that karmic retribution, now that we've met me, we'll leave home, receive the full set of precepts, and attain the fruit of the arhat.\"",
        "source": "T03n0190_043:0852c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸比丘復白佛言：「希有世尊！",
        "translation": "The monks then again said to the Buddha, \"It's rare, Bhagavān!",
        "source": "T03n0190_043:0852c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何世尊？",
        "translation": "What is the World Honored One?",
        "source": "T03n0190_043:0852c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見是優婁頻螺迦葉，墮於邪道，世尊方便，出五百種神通教化，然後始得阿羅漢果？」",
        "translation": "Did he see that Uruvilvā-Kāśyapa had fallen into a wrong path and that the Bhagavān had skillfully taught him with 500 kinds of supernormal powers and then attained the fruit of the arhat?\"",
        "source": "T03n0190_043:0852c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，默然而住。",
        "translation": "After saying this, he waited silently.",
        "source": "T03n0190_043:0852c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告諸比丘言：「汝諸比丘！",
        "translation": "At that point, the Buddha addressed the monks, saying, \"You monks!",
        "source": "T03n0190_043:0852c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非但今日，我見優婁頻螺迦葉，墮於邪道，勇猛精進，出五百種神通化得。",
        "translation": "Not only today, but I've seen Ulūka Punarvasu Kāśyapa fall into a wrong path and work energetically to produce 500 kinds of supernormal powers to obtain it.",
        "source": "T03n0190_043:0852c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其過去世，亦墮邪道，我心勤劬化取亦得。」",
        "translation": "In a past life, he also fell into a wrong path, and I diligently strove to obtain it.\"",
        "source": "T03n0190_043:0852c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，諸比丘即白佛言：「善哉！",
        "translation": "The monks then said to the Buddha, \"Good!",
        "source": "T03n0190_043:0852c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0190_043:0852c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此事云何？",
        "translation": "What is this matter?",
        "source": "T03n0190_043:0852c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願為解說。」",
        "translation": "Please explain this for us.\"",
        "source": "T03n0190_043:0852c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告諸比丘言：「汝諸比丘！",
        "translation": "At that point, the Buddha addressed the monks, saying, \"You monks!",
        "source": "T03n0190_043:0852c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至心諦聽！",
        "translation": "listen with utmost attention!",
        "source": "T03n0190_043:0852c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我念往昔，有一國土，名毘提何(隋言非正身)。",
        "translation": "I think about a time in the past when there was a land called Videha (Sui) that wasn't its proper body.",
        "source": "T03n0190_043:0852c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼國內有一剎利王，名鴦伽陀(隋言與身分)，灌頂為王，甚有大力，多饒兵眾，錢財穀米，倉庫盈溢。",
        "translation": "Within that country, there was a warrior king named Aṅgata who was crowned king, was very powerful, made many soldiers, and had an overflowing storehouse of money, wealth, and grain.",
        "source": "T03n0190_043:0852c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時國王心有邪見，曾於一時，十五日夜，月盛圓滿，光明照耀，其王初夜喚諸大臣，悉來集聚。",
        "translation": "\"At the time, the king had a wrong view of mind, and there was a time on the night of the fifteenth day when the moon was full and shining brightly, and he summoned his ministers to gather here the first thing in the evening.",
        "source": "T03n0190_043:0852c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其第一臣，名毘闍耶(隋言難勝)，第二大臣，名蘇摩那(隋言善意)，第三名為阿羅波多(隋言前言)，此三大臣，最為上首。",
        "translation": "The first minister was named Vijayā (Sui), the second minister was named Sumāna (Sui), a good intention, and the third was Alapattra (Sui), the most senior of these three ministers.",
        "source": "T03n0190_043:0852c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼王復更廣命召集無量諸大臣等，而告之言：『汝諸臣等！",
        "translation": "\"At the time, the king furthermore summoned an unlimited number of ministers and told them, \"You ministers!",
        "source": "T03n0190_043:0852c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各各自說心意之中，作何方便，過此一夜，共相娛樂，而令不睡。』",
        "translation": "Each of them explained what skillful means they had in mind to spend the night together entertaining each other and keeping them awake.'",
        "source": "T03n0190_043:0852c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，前言臣即白王言：『大王！",
        "translation": "\"The minister who spoke before then said to the king, 'Great king!",
        "source": "T03n0190_043:0853a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，如臣意見，應須備辦四種兵眾，未降國土，當令降伏，既降伏已，治化而住。』",
        "translation": "You should know that, according to my advice, there are four kinds of troops that should be prepared, which should be subdued before they surrender to the land, and then subdued after they are governed and transformed.'",
        "source": "T03n0190_043:0853a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，善意臣復白王言：『大王！",
        "translation": "\"The well-meaning minister then again said to the king, 'Great king!",
        "source": "T03n0190_043:0853a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，如臣意見，今一切處，所有怨敵皆悉降伏，更無所畏，今宜恣情受於五慾，而自歡樂。』",
        "translation": "You should know that, according to my advice, now that all enemies in all places have been subdued and there's nothing to fear, it's appropriate to enjoy the five desires with abandon and be happy.'",
        "source": "T03n0190_043:0853a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，難勝臣復白王言：『大王！",
        "translation": "\"Nārāyaṇa then again said to the king, 'Great king!",
        "source": "T03n0190_043:0853a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，五慾恒常是可得事，此有何奇有何希有？",
        "translation": "You should know that the constancy of the five desires is something obtainable, so what's so strange and rare about it?",
        "source": "T03n0190_043:0853a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但大王！",
        "translation": "But the great king!",
        "source": "T03n0190_043:0853a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今若有沙門若婆羅門，精進持戒具足多聞廣智慧者，若得是人，彼可供養，彼可承事。",
        "translation": "\"Now, if there's an ascetic or a brāhmaṇa who makes effort to observe precepts and has thorough learning and extensive wisdom, if he attains that person, he can make offerings to them and they can serve him.",
        "source": "T03n0190_043:0853a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T03n0190_043:0853a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "開悟人故。』",
        "translation": "It's because it enlightens people.'",
        "source": "T03n0190_043:0853a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，國王報彼臣言：『卿此一言，甚為大善，此言甚美，是故卿今審諦觀察看，何處邊最好沙門、好婆羅門，精進持戒，多聞智慧，我當至彼承事供養。』",
        "translation": "\"It was then that the king told the minister, 'This is a very good statement from you, and it's very beautiful; therefore, you must carefully examine it and see where there's a superior ascetic or good brāhmaṇa who is diligent in upholding precepts and well-versed in wisdom, and I will go there to serve and make offerings to him.'",
        "source": "T03n0190_043:0853a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，前言臣即白王言：『大王若須如是人者，臣今能知如是人處，在於鹿苑，有一精進多聞之人，名曰躶形姓迦葉氏，能說微妙多種言語，大王今者可事彼人。』",
        "translation": "\"The minister who spoke before then said to the king, 'Your majesty, if you need such a person, I now know of a place where such a person might be found. There's an energetic and well-versed man named Numata and surnamed Kāśyapa in Deer Park who speaks a variety of subtle languages; the king may serve him now.'",
        "source": "T03n0190_043:0853a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼王嚴駕駟馬賢善妙車，坐於其上，身著白衣，擐白瓔珞，左右皆悉著白衣裳，張白傘蓋，脚白革履，手執白拂，以白摩尼，而莊嚴之，以大王威，大王神力，及彼諸臣前後導從，往詣躶形迦葉師邊。",
        "translation": "\"At the time, the king was riding in an armored, good, and marvelous chariot, sitting on it, wearing white robes and white jewelry, with his left and right all clad in white robes, a white canopy, white leather footwear, a white whisk in his hand, and a white mani, and adorned, with the great king's authority and the great king's spiritual power, and with his ministers leading and following him, he went over to the teacher Numata Kāśyapa.",
        "source": "T03n0190_043:0853a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到已恭敬，坐於一面，諮受未聞。",
        "translation": "When they arrived, they paid respect to him, sat to one side, and consulted with him about what they hadn't heard.",
        "source": "T03n0190_043:0853a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，鴦伽陀王慰問迦葉躶形導師，作如是言：『尊者四大安隱已不？",
        "translation": "\"At the time, King Aṅgata greeted the nymphomaniacal guide Kāśyapa and said, 'Venerable, are the four great peacekeepers secure?'",
        "source": "T03n0190_043:0853a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切時節和順已不？",
        "translation": "Have all seasons been harmonious?",
        "source": "T03n0190_043:0853a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "資身之物得具足不？",
        "translation": "Will the necessities of life be fulfilled?",
        "source": "T03n0190_043:0853a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "衣食易得無所乏少，不擾亂耶？』",
        "translation": "Is there nothing lacking in easily obtainable clothing and food that isn't disruptive?'",
        "source": "T03n0190_043:0853a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，躶形迦葉道人，即報於彼鴦伽陀王，作如是言：『大王！",
        "translation": "\"At that point, the nudes, Kāśyapa and the Wayfarer reported to King Aṅgaja and said, 'Great king!",
        "source": "T03n0190_043:0853b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今無所乏少，我身亦得安隱無患。",
        "translation": "Now, there's nothing I lack, and my body is secure and free of danger.",
        "source": "T03n0190_043:0853b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復大王！",
        "translation": "Again, great king!",
        "source": "T03n0190_043:0853b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身體起動安和已不？",
        "translation": "Has the body moved peacefully?",
        "source": "T03n0190_043:0853b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善事利益增長已不？",
        "translation": "Has the growth of the benefits of good deeds been?",
        "source": "T03n0190_043:0853b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國內人民豐樂已不？",
        "translation": "Are the people of the country no longer enjoying themselves?",
        "source": "T03n0190_043:0853b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王之政治端平直不？』",
        "translation": "Is the king's political end even and straight?'",
        "source": "T03n0190_043:0853b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，鴦伽陀王共彼躶形迦葉道人，相慰問已，心有疑處，即諮問言：『尊者！",
        "translation": "\"It was then that King Aṅgaja and that nymph-shaped Kāśyapa monk consoled each other and, having doubts, asked, 'Venerable!",
        "source": "T03n0190_043:0853b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間有諸沙門及婆羅門，各說法行，是中所有至真實者，尊者！",
        "translation": "\"There are ascetics and priests in the world who each teach the practice of the Dharma, and these are the most genuine, Bhagavān!",
        "source": "T03n0190_043:0853b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為我次第解說。』",
        "translation": "Explain it for me in order.'",
        "source": "T03n0190_043:0853b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，是時躶形迦葉道人即報王言：『大王善聽！",
        "translation": "After he said this, the nudes then, the Wayfarer Kāśyapa, reported to the king, saying, 'Great king, listen well!",
        "source": "T03n0190_043:0853b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中所有至真實者，此之真義，我今當說，是中有偈，而鈍根人，不能了知。",
        "translation": "\"This is the true meaning of what's perfectly genuine, which I will now explain as a verse that people with dull faculties can't understand.",
        "source": "T03n0190_043:0853b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『世間幽冥愚癡人，　　或實或虛或妄語，　　以彼無有智慧故，　　觸語不能辯了知。",
        "translation": "\"'The world's dark and foolish people speak either truly or falsely or falsely, and because they lack wisdom, they can't discern or comprehend words that they touch.",
        "source": "T03n0190_043:0853b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸業一切雜種無，　　善惡果報亦不有，　　夜叉等身亦非實，　　況復得有上諸天？",
        "translation": "All the varieties of karma are nonexistent, the results of good and evil don't exist, and the bodies of yakṣas and others aren't real, so how could there be higher gods?'",
        "source": "T03n0190_043:0853b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　又復無有父母親，　　此世彼世悉皆絕，　　沙門及婆羅門等，　　而彼一切皆悉空。",
        "translation": "\"Furthermore, there are no parents, no relatives in this or that world, no ascetics or priests, and all of them are completely empty.",
        "source": "T03n0190_043:0853b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　世間師等亦復無，　　更有誰能被調伏，　　愚癡人輩教他施，　　智人聞已心不隨。",
        "translation": "Nor are there any earthly teachers or so forth, or who else could be disciplined, foolish people who teach others to give, and wise people who hear them and then don't follow them in their hearts.",
        "source": "T03n0190_043:0853b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若有善誑取他財，　　彼實愚癡自言智，　　所應死者其自死，　　行施已後無果收。",
        "translation": "If someone is good and deceives others with their possessions, they're really foolish and claim to be wise; they themselves die when they should, and they receive no fruit after making a gift.",
        "source": "T03n0190_043:0853b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　此身一切常相連，　　欲言斷者無有是，　　所有火風及地水，　　若苦不苦并樂時，　　第七即是壽命根，　　此等無有能殺者。",
        "translation": "These bodies are all permanently connected, and there's no one who wants to say that they've been stopped, that there's fire, wind, earth, and water, that's painful, non-suffering, and pleasant, and that the seventh is the root of life and livelihood, and there's no one who can kill them.",
        "source": "T03n0190_043:0853b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸身及命兩間內，　　器仗從中自運行，　　世間愚癡人不知，　　謂言此被傷害死。",
        "translation": "There are two bodies and lives within them, and the weapons move from them naturally. Foolish people in the world don't know this, saying that they've been injured and killed.",
        "source": "T03n0190_043:0853b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如是怖畏名不智，　　若受是名智慧人。",
        "translation": "Such fear is called unwisdom, and if they accept it, they're called wise people.",
        "source": "T03n0190_043:0853b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一經八萬四千生，　　流轉之時方得脫，　　如是煩惱乃能淨，　　八萬四千生後周。",
        "translation": "After 84,000 lifetimes, he'll only be freed when he's in transition, so he'll be able to purify his afflictions and reach 84,000 lifetimes later.",
        "source": "T03n0190_043:0853b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　流轉無有錯亂期，　　猶如海潮波依限，　　如是之法次第說，　　大王今者應當知。』",
        "translation": "There's no period of error in their transmigration, just like an ocean tide that depends on a limit, and such things are explained in order, which the king should now know.'",
        "source": "T03n0190_043:0853c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，前言大臣聞說偈已，即白躶形迦葉師言：『如是如是，迦葉道人！",
        "translation": "\"After hearing the verse, the minister who spoke before then said to the nudes Kāśyapa, 'Thus and thus, Master Kāśyapa!'",
        "source": "T03n0190_043:0853c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如尊者說。",
        "translation": "\"As the venerable said.",
        "source": "T03n0190_043:0853c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0190_043:0853c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者迦葉！",
        "translation": "Venerable Kāśyapa!",
        "source": "T03n0190_043:0853c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我知宿命，憶念昔在俱睒彌城，曾作屠兒。",
        "translation": "Knowing my past lives, I remembered a time when I was a butcher in Kauśāmbī.",
        "source": "T03n0190_043:0853c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時我殺無量無邊牛羊水牛猪羖羊馬，殺賣取錢，以用活命。",
        "translation": "At the time, I killed measureless and limitless cattle, sheep, buffalo, pigs, ewes, goats, and horses, and sold them for money to live.",
        "source": "T03n0190_043:0853c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我作如是惡業已後，從彼捨命，今來生此大將之家，足有資財。",
        "translation": "After I did such bad actions, I let go of my life and was born here in the house of this great general, fully endowed with wealth.",
        "source": "T03n0190_043:0853c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，我知無有善惡業報。』",
        "translation": "Because of these causes and conditions, I know there's no result of good or bad actions.'",
        "source": "T03n0190_043:0853c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，鴦伽陀王第一大臣名難勝者，在王後立，彼大臣聞如是語已，悲泣下淚，嗚咽不言。",
        "translation": "\"At the time, the first minister of King Aṅgaja, a man named Nansheng, was standing behind the king, and when he heard those words, the minister wept with pity and sobbed, and he didn't speak.",
        "source": "T03n0190_043:0853c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，鴦伽王告彼臣言：『汝今何故悲泣乃爾？』",
        "translation": "The king of Aṅga then addressed the minister, saying, 'Why are you weeping with pity now?'",
        "source": "T03n0190_043:0853c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "難勝報言：『大王！",
        "translation": "Nārāyaṇa replied, 'Great king!",
        "source": "T03n0190_043:0853c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，迦葉道人所說之偈，及前言臣，如是義理，無有違失。",
        "translation": "You should know that the verse spoken by the Wayfarer Kāśyapa and the minister who spoke it before him have no mistaken meaning.",
        "source": "T03n0190_043:0853c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『大王！",
        "translation": "\"'Great king!",
        "source": "T03n0190_043:0853c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，我亦憶念往昔，在於俱睒彌城，曾作長者，能大捨施，作於檀主，所有資財，悉皆共他分張而用。",
        "translation": "\"You should know that I also remember a time in the city of Kauśāmbī when I was an elder who was generous with his alms and served as a donor, sharing all of his possessions with others and using them.",
        "source": "T03n0190_043:0853c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白月黑月，八日、十四及十五日，恒常受持八關齋戒，恒常精進守護身口。",
        "translation": "On the eighth, fourteenth, and fifteenth days of the moon and night, I always observed the eight precepts, and I always guarded my body and speech with energy.",
        "source": "T03n0190_043:0853c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我作如是清淨業已，今墮如是下賤婢胎，生而作奴。",
        "translation": "After I did such pure activities, I fell into the womb of such a lowly servant and was born as a slave.",
        "source": "T03n0190_043:0853c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T03n0190_043:0853c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，以是因緣，我聞躶形迦葉道人及前言臣二人等語，是故悲泣啼哭不勝，亦知世間無有善道。』",
        "translation": "You should know that because of this reason, I heard the words of the Wayfarer Nandita Kāśyapa and the two ministers who spoke before him, and so I lamented and wept uncontrollably and knew that there's no good path in the world.'",
        "source": "T03n0190_043:0853c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，鴦伽王，聞於躶形迦葉道人如是語已，從座而起，還至本宮。",
        "translation": "\"After hearing these words from the Wayfarer Nandimitra Kāśyapa, King Aṅga got up from his seat and returned to his palace.",
        "source": "T03n0190_043:0853c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過彼夜後，聚集百官一切大臣，而告之言：『卿等三人！",
        "translation": "After that night, he gathered a hundred officials and all his ministers and told them, 'Three of you!",
        "source": "T03n0190_043:0853c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今日去，若有私竊善惡等事，慎莫問我，我今遣此難勝善意并及前言三大臣等，此等三人，聰明智慧，代我判事。』",
        "translation": "'From this day forth, if you steal anything good or evil from me, don't ask me about it; now I'll send this man of unsurpassed good will and the three ministers mentioned earlier, three men of intelligence and wisdom who will judge things for me.'",
        "source": "T03n0190_043:0853c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，鴦伽王作是語已，入於一殿，名為妙色，在其中坐，經於七日，受五欲樂，放逸自恣縱情而住，過七日後。",
        "translation": "\"After he said this, King Aṅga went into a hall called Myōshiki and sat down in it for seven days, enjoying the five desires and indulging in indulgence in passions for seven days.",
        "source": "T03n0190_043:0854a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，鴦伽王有於一女，名曰意憙，身著種種雜色之衣，復以種種瓔珞七寶莊嚴身已，向妙色殿，至父王邊。",
        "translation": "\"Then, King Aṅga had a woman named Jogaku, who was dressed in robes of various colors and adorned herself with various jewelry and seven treasures, go to the hall of Myōshiki and approach her father.",
        "source": "T03n0190_043:0854a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到已頂禮父王之足，却坐一面，默然而住。",
        "translation": "When she arrived, she bowed her head at her father's feet, withdrew to sit to one side, and waited silently.",
        "source": "T03n0190_043:0854a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，鴦伽王告其女言：『善意憙女！",
        "translation": "King Aṅga addressed his daughter, saying, 'Good idea, Jelly Girl!",
        "source": "T03n0190_043:0854a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝曾至彼園樹林內遊戲已不？",
        "translation": "Have you ever gone to play in that grove?",
        "source": "T03n0190_043:0854a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中多有種種樹木，其樹木上有諸華果，復有種種飛鳥作聲，汝入彼中意樂已不？",
        "translation": "There are many trees of various kinds, and on top of those trees are flowers and fruits, and there are also various flying birds making sounds.",
        "source": "T03n0190_043:0854a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝貪何等？",
        "translation": "What do you crave?",
        "source": "T03n0190_043:0854a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "向我道之，求願當與。』",
        "translation": "Tell me about it, and I'll grant you your vow.'",
        "source": "T03n0190_043:0854a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，問女所須。",
        "translation": "After he said this, he asked the girl what she needed.",
        "source": "T03n0190_043:0854a11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，意憙女白父王言：『善哉阿耶！",
        "translation": "\"The female Jogakuin then said to her father, 'Good, Hayagrī!",
        "source": "T03n0190_043:0854a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女今身資無所乏少，唯欲啟白阿耶一言，唯願父王！",
        "translation": "Now, having nothing to lose in terms of personal possessions, I only wish to reveal one thing to Aya, vowing, Father!",
        "source": "T03n0190_043:0854a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聽女諮諫。』",
        "translation": "Listen to your daughter's advice.'",
        "source": "T03n0190_043:0854a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而說偈言：「『父王我今欲布施，　　一切沙門婆羅門，　　恒至月生十五時，　　願與我千金錢直。』",
        "translation": "He spoke a verse, saying, 'Father, now I want to give alms, and all ascetics and priests, until the fifteenth day of the moon, will give me a thousand coins.'",
        "source": "T03n0190_043:0854a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，鴦伽陀王聞其女說如是語已，即還以偈報意憘女作如是言：「『善女汝今至心聽，　　我從智人如是聞，　　雖復欲施多種財，　　一切皆空無果報。",
        "translation": "\"After hearing his daughter say such a thing, King Aṅgaja then returned the gāthā with this verse in response to her request, saying, \"Good girl, listen carefully now. I've heard from wise men that even though I want to give many kinds of goods, they are all empty and have no result.",
        "source": "T03n0190_043:0854a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝今何故發此意，　　誑惑世間諸癡人，　　現在未來悉皆無，　　汝復何須過勞苦？",
        "translation": "Why have you given rise to this idea now, which deceives foolish people in the world and will lead them nowhere in the future, so why should you go through the trouble?'",
        "source": "T03n0190_043:0854a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　癡女汝今不聞彼，　　迦葉說法正不差，　　實無造業及作人，　　一切人天善惡果。",
        "translation": "\"Now, you foolish woman, have never heard of them, for Kāśyapa's teaching is accurate and not contradictory, for there really is no action created or person made, and all humans and gods have good and bad consequences.",
        "source": "T03n0190_043:0854a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　夜叉鬼神悉非有，　　父母眷屬亦復無，　　略說八萬四千生，　　如是煩惱乃能淨。",
        "translation": "Even though yakṣas and ghosts don't exist, their parents and retinues are also absent, and there are 84,000 births mentioned briefly, such afflictions can be purified.",
        "source": "T03n0190_043:0854a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若過八萬四千後，　　流轉方無錯亂心，　　猶如海潮依限期，　　間中未至不可預，　　但當任運待時到，　　何用強作世紛紜。",
        "translation": "If 84,000 are passed, then there's no mental disturbance in transmigration, just like an ocean tide depending on a limited time, which is unpredictable before it reaches its final destination, but you should let the time come, so there's no need to force worldly disputes.",
        "source": "T03n0190_043:0854a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　迦葉所說汝當知，　　此事無有虛真實，　　無現及以未來世，　　汝今莫自獨疲勞。』",
        "translation": "You should know what Kāśyapa teaches, for there's nothing false or real in this matter, nothing in the present or future world, so don't tire yourself alone now.'",
        "source": "T03n0190_043:0854b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，意憘女聞父王鴦伽說是語已，心中不樂，即復以偈更白父言：「『阿耶今是國之王，　　應以正法治天下，　　惡臣諂曲既無實，　　復勸王事愚癡師。",
        "translation": "\"After hearing her father, King Aṅga, say those words, the lady Ārya was displeased in her heart and again said to her father in verse, \"Now, Aya, we're the king of the country, and we should rule the world with righteousness.",
        "source": "T03n0190_043:0854b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　迦葉及彼三大臣，　　其等所說非真正，　　父王此是惡知識，　　今者詐現知識形，　　自行邪道復誤人，　　下賤愚癡何所別，　　其今不與王安樂，　　反教王作不善因。",
        "translation": "Kāśyapa and those three ministers say what they say isn't true, and this, my father, is a bad friend who fraudulently shows himself to be a friend, does wrongdoings and misleads people, what distinguishes the inferior from the foolish, and doesn't give the king peace and happiness now but instead teaches the king to create unwholesome causes.",
        "source": "T03n0190_043:0854b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我昔曾聞是事來，　　現在我身親自見，　　愚癡故來生於此，　　後復還得愚癡身，　　幽冥出已入幽冥，　　其後復還受幽冥。",
        "translation": "I've heard of such things in the past, and now I've personally seen them in my own body, come here because of my folly, and then I'll again attain a foolish body, enter the darkness after emerging from the darkness, and then return to the darkness afterward.",
        "source": "T03n0190_043:0854b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　迦葉既是愚癡者，　　稱其愚惑意所宣。",
        "translation": "Since Kāśyapa is a fool, it's called what his deluded mind proclaims.",
        "source": "T03n0190_043:0854b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　王為人主統四方，　　知理達解世間事，　　云何如彼小兒輩，　　入邪小道逕中行？",
        "translation": "The king is the lord of men and rules the four directions, knowing and understanding worldly affairs, but why is he like that small group of children who enter the wrong and lesser paths and walk in it?",
        "source": "T03n0190_043:0854b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　隨逐意受親近人，　　相學即便生染著，　　如箭被血所污已，　　入束展轉更相塗。",
        "translation": "They follow the mind and accept people they're close to, and even when they train together, they become defiled, like an arrow stained by blood that goes into a bundle and is continually smeared with further smears.",
        "source": "T03n0190_043:0854b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　智者交往深自防，　　不狎惡伴諸朋友，　　雖身不作於諸罪，　　而常習近作罪人。",
        "translation": "A wise person deeply guards himself in association with others, doesn't associate with bad companions and friends, and even though he doesn't commit sins himself, he always gets close to people who commit sins.",
        "source": "T03n0190_043:0854b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　久昵習學自相成，　　其後自然得惡響，　　是故猶如彼射垛，　　智者畏著罪亦然。",
        "translation": "After a long time, intimate training is naturally formed by itself, and then it naturally has a bad effect. Therefore, he's like that man who shoots a pallet, and so is the wise man who fears attachment to sins.",
        "source": "T03n0190_043:0854b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　莫與諸惡知識交，　　常親智慧善知識。",
        "translation": "Don't associate with bad teachers, but always be close to a wise and good teacher.",
        "source": "T03n0190_043:0854b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若諸眾生身業淨，　　經於八萬四千生，　　屠兒殺害眾命時，　　又如獦射釣魚者。",
        "translation": "If the physical actions of sentient beings are purified and they pass through 84,000 lifetimes, then when they butcher children and kill many lives, they're like a man who shoots at fish.",
        "source": "T03n0190_043:0854b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　迦葉既似彼等輩，　　彼輩亦如迦葉儔，　　格量彼二一種齊，　　無有差別勝不如。",
        "translation": "As Kāśyapa resembles that group, that group also resembles Kāśyapa's class, and they're both measured as one and the same, with no distinctions between them that are superior or inferior.",
        "source": "T03n0190_043:0854b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如是無體理迦葉，　　愚癡盲冥空出家，　　執此虛妄為淨因，　　八萬四千生分畢，　　顛倒左轉行失度，　　無智愚癡心意迷。",
        "translation": "Thus, Kāśyapa, who lacks substance and principle, is a foolish, blind, and empty renunciant, clinging to this falsehood as the cause of purity, having exhausted the 84,000 parts of his life, erroneously turning left and losing his way, and being ignorant and deluded in mind.",
        "source": "T03n0190_043:0854b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若諸眾生得淨時，　　不應八萬四千受，　　偷賊劫殺於人物，　　能與他作惡怨讎，　　迦葉共彼無有殊，　　彼與迦葉亦無異。",
        "translation": "If sentient beings attain purity when they shouldn't be subject to 84,000, thieves and robbers kill people, and they create bad enemies with others, there's no difference between Kāśyapa and them, nor is there any difference between them and Kāśyapa.",
        "source": "T03n0190_043:0854c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　眾生若得於彼淨，　　云何八萬四千生，　　如是數取善惡時，　　上下及中平等者，　　一切無勝復無劣，　　亦復無有分別生。",
        "translation": "If sentient beings attain purity there, how could 84,000 be born, and when good and evil are counted in this way, the superior, inferior, and middling are equal, neither superior nor inferior, and there's no discrimination that arises?",
        "source": "T03n0190_043:0854c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若諸眾生得淨修，　　經歷八萬四千處，　　彼人愚癡無有智，　　猶彼迦葉空出家。",
        "translation": "If sentient beings attain purity and cultivation and pass through 84,000 places, they're foolish and lack knowledge, like that Kāśyapa who left home empty.",
        "source": "T03n0190_043:0854c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　譬如炎熾大火燃，　　普燒盡諸所祭物，　　如是無智愚癡故，　　自燒一切功德山。",
        "translation": "Like a great blazing fire that burns up all the things that are sacrificed, such a foolish man without wisdom burns up all the mountains of merit himself.",
        "source": "T03n0190_043:0854c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　大臣前言見未來，　　造作眾罪無果報，　　彼於先世修福業，　　故今得受快樂心。",
        "translation": "The minister said before that he sees the future and creates numerous sins without consequences, but he cultivated good actions in a prior life, so now he'll attain a happy mind.",
        "source": "T03n0190_043:0854c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若人造作眾罪時，　　捨福自然受殃禍，　　如船在水中不出，　　以重沈沒故不浮，　　更無有人能出之，　　即沒水中常腐敗。",
        "translation": "When a person commits many sins, abandoning their good fortune naturally brings misfortune, like a boat that doesn't emerge from the water because it's heavily submerged and therefore doesn't float, and there's no one else who can emerge from it, which means it's submerged in water and always rots.",
        "source": "T03n0190_043:0854c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如人數數造諸罪，　　以造不息罪過多，　　如是即沒地獄中，　　王此前言臣即是，　　以其罪患未成熟，　　其罪不久熟即知，　　罪熟即墮彼泥梨。",
        "translation": "As a person who has repeatedly committed various sins and has caused too many sins to go unabated, he'll end up in hell, which is what the king previously said his ministers were, because their sins are troublesome and immature, and they'll know when their sins are ripe and fall into a hell when they are ripe.",
        "source": "T03n0190_043:0854c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　猶如船在水中沒，　　被諸苔衣所覆蔽，　　草重自舉不能勝，　　船久如是益重牢。",
        "translation": "He's like a boat submerged in water, covered by a mossy garment, unable to overcome the weight of the grass that lifts itself up, and the boat becomes more imprisoned as it goes on.",
        "source": "T03n0190_043:0854c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　人造眾罪亦復爾，　　漸漸久沈體轉重。",
        "translation": "Similarly, a person creates numerous sins, and gradually over time their body becomes heavier as they sink.",
        "source": "T03n0190_043:0854c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　猶如人造善業因，　　速疾得向上界生。",
        "translation": "They're like a person who creates the causes of good actions and quickly attains birth in the upper realms.",
        "source": "T03n0190_043:0854c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　往昔造諸一切罪，　　今生如彼地種子，　　罪業盡已後漸生，　　若造諸善業報時，　　即自生於善果處。』",
        "translation": "All the sins they created in the past are now born like seeds in that land, which are gradually produced after the sins are ended. When they create the results of good actions, they'll be born in a place of good results by themselves.'",
        "source": "T03n0190_043:0854c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，意憙女說是偈已，復更重白其父王言：『父王當知！",
        "translation": "\"After speaking this verse, Jñānagupta reiterated it to her father, saying, 'Father, you must know this!",
        "source": "T03n0190_043:0854c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我自思惟，亦識宿命。",
        "translation": "I myself thought, 'I'm also aware of my past lives.'",
        "source": "T03n0190_043:0854c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0190_043:0854c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我憶往昔，七生在於摩伽陀國王舍城內，以惡知識相牽挽故，造多罪業，行於邪慾，侵他婦妾，受樂如天。",
        "translation": "I remember a time in the past when I was born seven times in the city of Rājagṛha in the country of Magadha, and because I was led by bad friends, I created many sins, engaged in wrong desires, and violated the wives and concubines of others, receiving pleasures like heaven.",
        "source": "T03n0190_043:0855a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T03n0190_043:0855a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，我於彼時，所造惡業，覆藏而住，如灰覆火。",
        "translation": "You should know that the bad activity I created at the time was covered and stored up like ashes covering a fire.",
        "source": "T03n0190_043:0855a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『復次大王！",
        "translation": "\"'Furthermore, Great King!",
        "source": "T03n0190_043:0855a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於彼處，捨身已後，又復生於金剛聚落富貴家生。",
        "translation": "After I gave up my body there, I was again born into a wealthy family in a vajra village.",
        "source": "T03n0190_043:0855a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼處生已值善知識，黑月白月，八日、十四及十五日，清淨守護八禁齋法，恒常持戒。",
        "translation": "After being born there, I met a good teacher who observed the eight precepts on the eighth, fourteenth, and fifteenth days of the black and white moons, purely and consistently observed the precepts.",
        "source": "T03n0190_043:0855a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T03n0190_043:0855a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，我於彼處，既造善業，譬如安置種種伏藏，至於水界，牢固封治，即便停住。",
        "translation": "You should know that since I created good actions there, it's like placing various storages, reaching the water element, firmly sealing them, and even stopping them.",
        "source": "T03n0190_043:0855a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『復次大王！",
        "translation": "\"'Furthermore, Great King!",
        "source": "T03n0190_043:0855a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於彼處，亦捨身命，以昔遇緣造惡業故，有餘未盡，即便墮落叫喚地獄。",
        "translation": "There, I also gave up my life because I had met a cause in the past that created bad karma, and there was something left over that hadn't ended, so I fell into the hell of wailing.",
        "source": "T03n0190_043:0855a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在於彼處，經多千年，受極苦厄。",
        "translation": "I've been there for many thousands of years, enduring terrible suffering and distress.",
        "source": "T03n0190_043:0855a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『復次大王！",
        "translation": "\"'Furthermore, Great King!",
        "source": "T03n0190_043:0855a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於彼處，罪業畢盡，捨身即生頻那俱吒國土內，受白羝羊身。",
        "translation": "Once my misdeeds had ended there, I abandoned myself and was born in the land of Vinati Kucha, where I was given the body of a white billy goat.",
        "source": "T03n0190_043:0855a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼處生已，有諸王子，或駕車乘，或被鞍韉，而騎我上。",
        "translation": "After I was born there, there were princes, some riding in chariots and some saddled and harnessed, who rode on top of me.",
        "source": "T03n0190_043:0855a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『復次大王！",
        "translation": "\"'Furthermore, Great King!",
        "source": "T03n0190_043:0855a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於彼處，既捨身已，復生於彼陀毘羅國，亦作羊身。",
        "translation": "After I gave up my body there, I was again born in that country of Darbila, where I also took on the body of a sheep.",
        "source": "T03n0190_043:0855a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼處捨身，復受牛身，捨彼牛身，出山林中，受獼猴身。",
        "translation": "After disposing of my body there, I was again given the body of a cow, and after disposing of the cow's body, I left the mountain forest and was given the body of a monkey.",
        "source": "T03n0190_043:0855a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『復次大王！",
        "translation": "\"'Furthermore, Great King!",
        "source": "T03n0190_043:0855a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於彼處，捨獼猴身，還生於彼金剛國內，復受非男非女等身。",
        "translation": "\"There, I abandoned my monkey body and was reborn inside that vajra country, where I was again given a body that wasn't male or female.",
        "source": "T03n0190_043:0855a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼處業盡，捨身即生忉利天上歡喜園中，與天帝釋以為侍衛。",
        "translation": "When my karma ended there, I abandoned my body and was born in the joyful garden in the Heaven of Thirty-three, where I was accompanied by Indra as his guard.",
        "source": "T03n0190_043:0855a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『復次大王！",
        "translation": "\"'Furthermore, Great King!",
        "source": "T03n0190_043:0855a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於彼處捨身之後，以昔護持月六齋戒得清淨故，今日來生大王之家，資財巨富，無所乏少。",
        "translation": "'After I gave up my body there, I was born into the great king's family today, and my wealth is great and there's nothing lacking because I had kept the six monthly observances of the precepts and attained purity.",
        "source": "T03n0190_043:0855a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而大王今可不自觀此之因緣，從何而得如是功德，可不以昔造善業故，今受此報如是以不？』",
        "translation": "Could you not examine for yourself the causes and conditions that led to such virtue, Your Majesty, and could it not be because of the good actions you did in the past that you've now received this result?'",
        "source": "T03n0190_043:0855a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，鴦伽陀王如是共女意憘對說言論之時，有一天仙，名不那羅陀(隋言不叫喚)，從天上下觀閻浮提，正當於彼鴦伽陀王宮殿之上，從虛空中，漸漸而下。",
        "translation": "\"At the time, while the king of Aṅgata and his wife Yizan were conversing and speaking, a celestial sage named Pūrṇa Rādhi (which is a Sui term for not calling out) came down from heaven to look at Jambudvī and was descending gradually from the sky above the palace of that king Aṅgata.",
        "source": "T03n0190_043:0855a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，王女意憙見彼天仙如是自上而下，即從座起，更置高座，請彼天仙，坐於其上。",
        "translation": "Seeing that celestial descending from above like that, the king's wife Jogaku rose from her seat, placed another high seat, and invited that celestial to sit on it.",
        "source": "T03n0190_043:0855b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，天仙安坐訖已，意憙頂禮天仙之足，合十指掌，向於天仙而諮白言：『尊者天仙！",
        "translation": "After the sage finished sitting there, Jogye saluted the sage's feet, put her palms together, and addressed the sage, saying, 'Venerable sage!",
        "source": "T03n0190_043:0855b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間頗有善惡果報諸業已不？",
        "translation": "Are there any karmic consequences of good and evil in the world that have not already been achieved?",
        "source": "T03n0190_043:0855b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗有夜叉諸天以不？",
        "translation": "Could it be that there are yakṣas and gods?",
        "source": "T03n0190_043:0855b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有父母不？",
        "translation": "Do you have parents?",
        "source": "T03n0190_043:0855b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有此彼世，有於沙門婆羅門不？",
        "translation": "Is there an ascetic or a brāhmaṇa in this or that world?",
        "source": "T03n0190_043:0855b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願天仙！",
        "translation": "Only vowing celestials!",
        "source": "T03n0190_043:0855b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為我解說，我此父王，不信是事。』",
        "translation": "Explain this for me, for I, your father, don't believe this.'",
        "source": "T03n0190_043:0855b09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，大天不那羅陀，即便反問鴦伽陀王，作如是言：『大王云何？",
        "translation": "\"At that point, the great god Punarata even asked King Aṅgaja about it, saying, 'What's the matter, Great King?'",
        "source": "T03n0190_043:0855b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今意中，實不信於此事以不？』",
        "translation": "Do you really not believe in this matter in your mind now?'",
        "source": "T03n0190_043:0855b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即白言：『此事實然。』",
        "translation": "The king then said, 'It's true.'",
        "source": "T03n0190_043:0855b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天仙復言：『大王！",
        "translation": "The celestials then said, 'Great king!",
        "source": "T03n0190_043:0855b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，善惡果報一切皆有，亦有夜叉及以諸天，有父有母，有此彼世，有諸沙門及婆羅門，大王須信，我從天上下來至此。』",
        "translation": "You should know that all the results of good and evil exist, and there are yakṣas and gods, fathers and mothers, this and that world, ascetics and brāhmaṇas, and you should believe, Your Majesty, that I came down from heaven to this place.'",
        "source": "T03n0190_043:0855b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，鴦伽陀王語天仙言：『尊者天仙！",
        "translation": "\"It was then that King Aṅgaja said to the celestials, 'Venerable celestials!",
        "source": "T03n0190_043:0855b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有彼世，今日尊者可與於我五百金錢，我未來世，當償尊者滿足一千。』",
        "translation": "If there's another world, today the venerable could give me five hundred coins, and in a future life I would repay the venerable one thousand.'",
        "source": "T03n0190_043:0855b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，那羅陀天仙向王而說偈言：「『我今與王五百錢，　　須知王身有禁戒，　　若王心中無善行，　　因何未來償一千？",
        "translation": "The god Narada then spoke to the king in verse, saying, 'Now, I've given the king five hundred coins, but you should know that the king is bound by the precepts, so why would you pay him a thousand in the future if he didn't do good deeds in his heart?'",
        "source": "T03n0190_043:0855b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　此世有人諂曲行，　　彼世相求何處得？",
        "translation": "\"Where can someone in this world who flatters and twists things obtain what they seek in another world?",
        "source": "T03n0190_043:0855b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　智人不與彼等債，　　如是人輩債求難。",
        "translation": "\"A wise person doesn't give them a debt like this, for it's difficult for such a group of people to ask for a debt.",
        "source": "T03n0190_043:0855b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　墮於地獄猛火燃，　　或有諸鳥周匝食，　　云何來世能償我？",
        "translation": "If they fall into hell and are burned by a fierce fire, or if there are birds circling around to eat them, how will they be able to repay me in a future life?",
        "source": "T03n0190_043:0855b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　墮於地獄受苦時，　　利刀割截身不完，　　節節割時流膿血，　　苦惱暫時無歇息，　　云何還我一千錢？",
        "translation": "When I fall into hell and experience suffering, my body is never finished when it's cut with a sharp sword, I bleed pus when it's cut by joints, and there's no respite from suffering for a while, so how can I have my thousand coins back?",
        "source": "T03n0190_043:0855b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　舉手把利剝筋時，　　斫剉其身如斬蔗，　　支節無有完全處，　　云何還我一倍錢？",
        "translation": "When he raises his hand and sharpens it to strip away tendons, he chops his body like cutting cane, and there's no place for his limbs to be completely cut, so how can he return twice as much money to me?",
        "source": "T03n0190_043:0855b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　嚴惡黑狗膩荼身，　　處處轉動割截食，　　在於地獄無身肉，　　云何未來與倍錢？",
        "translation": "\"A grievous black dog, Nyandi, moves around cutting off food, and has no bodily flesh in hell, so how can it be given twice as much money in the future?",
        "source": "T03n0190_043:0855c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　彼處有大利鐵叉，　　獄墜數數鑽其上，　　在於地獄手向下，　　云何與我一千錢？",
        "translation": "\"Where there's a great iron fork, and hell has fallen down and drilled into it several times, and it's in hell with its hand down, why did it give me a thousand coins?",
        "source": "T03n0190_043:0855c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　地獄多有劍樹林，　　一一劍頭十六刃，　　貫穿其上不暫住，　　誰能與我一倍錢？",
        "translation": "\"In hell, there are many sword trees, each with sixteen blades that pierce through them and don't stay up, so who can double my money?",
        "source": "T03n0190_043:0855c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　灰河地獄熱沸流，　　速疾如風如箭射，　　入於其中受苦痛，　　云何與我一倍錢？",
        "translation": "The ash river and hell are boiling hot, fast as the wind and shot like an arrow, and I experience pain when I enter them.",
        "source": "T03n0190_043:0855c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　吞熱鐵丸地獄中，　　或復融銷赤銅汁，　　在於如是苦逼內，　　云何與我一倍錢？",
        "translation": "\"Swallowing a hot iron ball and going to hell, or melting down red copper juice, how can I double my money when I'm being forced to suffer like this?",
        "source": "T03n0190_043:0855c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　地獄有手如霔霖，　　各出熱炎嚴熾火，　　割截支節無暫住，　　云何與我一倍錢？",
        "translation": "\"In hell, there are hands like wet rains, each emitting a scorching hot, blazing fire that cuts off limbs without holding them for a moment, so why would they give me twice as much money?",
        "source": "T03n0190_043:0855c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　彼處可畏闇無明，　　日月光影所不照，　　在彼無智愚癡輩，　　云何與我一倍錢？",
        "translation": "\"Where is that fearful darkness and ignorance, where the light of the sun and moon don't shine, and where are those who are ignorant and foolish, how can they double their money with me?",
        "source": "T03n0190_043:0855c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　大王捨此非法行，　　勸王行於如法事，　　王當作於如是習，　　後應不墮地獄中。",
        "translation": "\"Great king, abandoning this unlawful practice, the king is encouraged to do what's according to the teaching, and he should undertake such a practice that he won't fall into hell afterward.",
        "source": "T03n0190_043:0855c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　東西南北所有來，　　沙門婆羅門乞索，　　王當充足與食飲，　　衣服湯藥臥具房。",
        "translation": "From the east, west, north, and south, the ascetics and priests beg for food and drink, clothing, medicine, and bedding, which the king will provide in abundance.",
        "source": "T03n0190_043:0855c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　彼等精進梵行人，　　沙門婆羅門取語，　　彼能救護王苦厄，　　猶如熱雨繖蓋遮。",
        "translation": "Those diligent religious practitioners, or ascetics and priests who take their words, will be able to save the king from suffering and distress like a hot rain covering a canopy.",
        "source": "T03n0190_043:0855c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　王作如是善業時，　　多有朋友相隨順，　　得至善路快樂處，　　神通中最得神通，　　如牛渡水直截流，　　若人把尾隨得濟。",
        "translation": "When the king does such good actions, he's followed by many friends, attains the happy place of a good road, and attains the most supernormal powers of all, like an ox crossing a river and cutting off its current, if someone were to pull their tail and get help.",
        "source": "T03n0190_043:0855c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切世間亦如是，　　逐直得直邪得邪，　　諸有人中行法行，　　凡人學行皆成勝。』",
        "translation": "So it is in all the world, where one pursues the straight and attains the straight and the wrong, and where one practices the Dharma among humans, ordinary people who train in its practice become superior.'",
        "source": "T03n0190_043:0855c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，鴦伽陀王既聞說已，復還以偈白彼天仙那羅陀言：「『大梵天仙哀愍我，　　猶如父母愛嬌兒，　　唯願數為我現來，　　若覩智人見善事。",
        "translation": "\"After hearing what he said, King Aṅgata then returned and spoke in verse to the goddess Nārada, saying, \"The Brahmakāyika gods take pity on me like a father and mother loving their child, and may they often be present for me, if I were to see a wise man who sees good deeds.",
        "source": "T03n0190_043:0855c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　唯願尊者見度脫，　　我沒煩惱海甚深，　　我今無地可住行，　　唯尊作我歸依處。",
        "translation": "May the Bhagavān see liberation, for I'm submerged in an ocean of affliction so deep that there's nowhere I can stand or walk, and only the Bhagavān can be my refuge.",
        "source": "T03n0190_043:0856a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　唯願大梵仙護我，　　我今覆面如蹈坑，　　地獄無量苦眾多，　　我今一一依尊語。』",
        "translation": "May the great Brahmā sage protect me, for now I've covered my face like I've stepped into a pit, and there are measureless and many painful hells, but now I'll rely on your words one by one.'",
        "source": "T03n0190_043:0856a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，大仙那羅陀天還更以偈告鴦伽陀王如是言：「『王今若造罪不息，　　憎嫉沙門婆羅門，　　斷見顛倒既不除，　　我汝各各不相見。",
        "translation": "\"At the time, the great sage Narada also addressed King Aṅgaja in verse, saying, \"Now, if the king doesn't stop committing sins, hates ascetics and priests, and doesn't remove mistaken views, you and I won't see each other.",
        "source": "T03n0190_043:0856a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　王若能行正法行，　　承事沙門婆羅門，　　精進持戒布施禪，　　我汝恒常得相見。』",
        "translation": "If the king practices the right path, serves ascetics and priests, and diligently observes precepts, generosity, and meditation, you and I will always see each other.'",
        "source": "T03n0190_043:0856a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，那羅陀大天仙神為鴦伽陀大王說法，教令正見。",
        "translation": "\"At the time, the great celestial deity Narada spoke to King Aṅgata and taught him the right view.",
        "source": "T03n0190_043:0856a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心既迴已，王意喜歡，頂禮天仙，合十指掌，右遶三匝。",
        "translation": "After his mind was converted, the king liked what he saw, paid homage to the celestial sage, put his palms together, and circled him three times to his right.",
        "source": "T03n0190_043:0856a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，那羅陀即從座起，別鴦伽王，還本來處。」",
        "translation": "Nārāditya then rose from his seat, parted from King Aṅgaja, and returned to his original place.\"",
        "source": "T03n0190_043:0856a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告諸比丘言：「汝諸比丘！",
        "translation": "It was then that the Buddha addressed the monks, saying, \"You monks!",
        "source": "T03n0190_043:0856a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今應當知，爾時天仙那羅陀者，今見我身釋迦文是；爾時彼王鴦伽陀者，見即今日優婁頻螺迦葉身是。」",
        "translation": "Now, you should know that at the time the god Sage Nārada saw my body as Śākyamuni, and at the time that king Aṅgata saw what is today the body of Uruvilvā-Kāśyapa.\"",
        "source": "T03n0190_043:0856a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告諸比丘言：「汝諸比丘！",
        "translation": "At that point, the Buddha addressed the monks, saying, \"You monks!",
        "source": "T03n0190_043:0856a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於往昔，見彼優婁頻螺迦葉，邪見熾盛，墮顛倒道，發精進心，教化令入於正道中。",
        "translation": "In the past, I saw that Uruvilvā-Kāśyapa, whose mistaken views were so blazing that he had fallen into a mistaken path, and I aroused my zeal to teach and guide him into the right path.",
        "source": "T03n0190_043:0856a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今日亦然，見其顛倒入邪道故，我以是發大精進力，為其出現五百種變神通教化，令其安住無上菩提，盡生死際，到無畏處，至涅槃岸。」",
        "translation": "Today, likewise, seeing him mistakenly enter the wrong path, I aroused great zeal and produced for him 500 kinds of miraculous powers to teach him, causing him to abide in unsurpassed enlightenment, end birth and death, reach the fearless place, and reach the shore of nirvāṇa.\"",
        "source": "T03n0190_043:0856a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛本行集經卷第四十三",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Volume 43",
        "source": "T03n0190_043:0856a25_0",
        "is_bad_quality": false
    }
]