[
    {
        "source_sentence": "方廣大莊嚴經卷第三",
        "translation": "Fangguang zhuangyan jing, vol. 3",
        "source": "T03n0187_003:0551b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中天竺國沙門地婆訶羅奉　詔譯",
        "translation": "Translated by imperial order from the Central India by the ascetic Divākara",
        "source": "T03n0187_003:0551b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誕生品第七",
        "translation": "seventh class of birth",
        "source": "T03n0187_003:0551b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告諸比丘：「菩薩處胎滿足十月將欲生時，輸檀王宮先現三十二種瑞相：一者一切大樹含花將發。",
        "translation": "It was then that the Buddha addressed the monks, \"When the bodhisattva is in the tenth month of womb fulfillment and about to give birth, thirty-two auspicious appearances precede him at the palace of King Śuddhodana: First, all the large trees contain flowers that are about to sprout.",
        "source": "T03n0187_003:0551b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者諸池沼中優鉢羅花、拘物頭華、波頭摩華、芬陀利華，皆悉含蘂。",
        "translation": "Second, in the ponds and marshes, the blue lotus, the kumuda flower, the padma flower, and the puṇḍarīka flower are all laden with flowers.",
        "source": "T03n0187_003:0551c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者諸小華叢吐而未舒。",
        "translation": "Third, there are clusters of small flowers that exhale but don't expand.",
        "source": "T03n0187_003:0551c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者自然而有八行寶樹。",
        "translation": "Fourth, there are eight rows of jeweled trees that grow naturally.",
        "source": "T03n0187_003:0551c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者二萬寶藏從地踊出。",
        "translation": "Five, 20,000 treasures spring up from the ground.",
        "source": "T03n0187_003:0551c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六者於王宮內自生寶牙。",
        "translation": "Sixth, a jeweled tooth arises on its own inside the king's palace.",
        "source": "T03n0187_003:0551c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七者地中復出無量寶瓶，滿中香油。",
        "translation": "Seven, measureless precious vials filled with fragrant oil also emerge from the ground.",
        "source": "T03n0187_003:0551c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八者從雪山中無量師子之子來遶迦毘羅城，歡躍震吼各守城門。",
        "translation": "Eight: From the snow-capped mountains, measureless sons of lions come circumambulating Kapilavastu, jumping and roaring with joy as they each guard the city gates.",
        "source": "T03n0187_003:0551c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九者彼諸師子亦不嬈害一切人民。",
        "translation": "Nine: Those lions also don't harm the people.",
        "source": "T03n0187_003:0551c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十者五百白象之子，來自雪山至王殿前。",
        "translation": "Ten, five hundred sons of white elephants come from the snowy mountains to the king's palace.",
        "source": "T03n0187_003:0551c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十一者有無量天諸嬰孩忽然而現，婇女懷抱婉轉遊戲。",
        "translation": "Eleven, there are measureless gods where babies suddenly appear, and women carry them and play with them.",
        "source": "T03n0187_003:0551c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十二者有諸龍女出現半身，手持微妙諸寶瓔珞於空而住。",
        "translation": "Twelve: Dragons and nymphs appear half-built, holding subtle jewels and jewelry in their hands as they stand in the sky.",
        "source": "T03n0187_003:0551c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十三者有十千天女，各持孔雀羽扇現於空中。",
        "translation": "Thirteen, there are ten thousand celestial women each holding a peacock fan in the air.",
        "source": "T03n0187_003:0551c13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十四者有十千寶瓶，盛滿香水泛以眾華，現於虛空旋遶迦毘羅城。",
        "translation": "Fourteen, there are 10,000 precious vials filled with perfume and filled with flowers that appear in the sky and circle the city of Kapilavastu.",
        "source": "T03n0187_003:0551c14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十五者有十千天女，各捧寶瓶現虛空中。",
        "translation": "Fifteen, there are 10,000 celestial maidens each holding a precious vase in the sky.",
        "source": "T03n0187_003:0551c16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十六者有十千天女，各各執持幢幡寶蓋現虛空中。",
        "translation": "Sixteen, there are 10,000 goddesses each carrying a banner, banner, or jeweled canopy in the sky.",
        "source": "T03n0187_003:0551c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十七者無量天諸婇女持天樂器，現虛空中而未擊奏。",
        "translation": "Seventeen, an infinite number of goddesses carrying celestial musical instruments appear in space without striking them.",
        "source": "T03n0187_003:0551c18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十八者一切香風皆未飄拂藹然而住。",
        "translation": "Eighteen. All the fragrant breezes don't blow and stay still.",
        "source": "T03n0187_003:0551c20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十九者江河諸水湛而不流。",
        "translation": "Nineteen rivers and streams of water are stilled and don't flow.",
        "source": "T03n0187_003:0551c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十者日月宮殿及諸星辰皆不運行。",
        "translation": "Twenty, the sun, moon, palace, and stars don't move.",
        "source": "T03n0187_003:0551c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十一者弗沙之星將與月合。",
        "translation": "Twenty-one! The star of Vibhāṣā will merge with the moon.",
        "source": "T03n0187_003:0551c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十二者王宮殿堂自然寶網彌覆其上。",
        "translation": "Twenty-two: The king's palace and halls are naturally covered with a net of treasures.",
        "source": "T03n0187_003:0551c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十三者一切燈炬皆悉無色。",
        "translation": "Twenty-three: All the lamps and torches are colorless.",
        "source": "T03n0187_003:0551c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十四者一切樓閣殿堂臺榭之上，忽然皆有摩尼珠寶嚴飾垂懸。",
        "translation": "24. All the mangoes, jewels, and ornaments suddenly hang from the tops of buildings, halls, and pavilions.",
        "source": "T03n0187_003:0551c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十五者眾寶庫藏忽然自開。",
        "translation": "Twenty-five! The treasury of many treasures is suddenly opened by itself.",
        "source": "T03n0187_003:0551c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十六者惡禽怪獸皆不出聲。",
        "translation": "Twenty-six! All the dangerous birds and monstrous creatures make no sound.",
        "source": "T03n0187_003:0551c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十七者於虛空中，演妙音詞唱言善生善生。",
        "translation": "Twenty-seven! In the sky, he speaks in a wonderful voice, saying, \"Good birth, good birth!",
        "source": "T03n0187_003:0551c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十八者一切人間所作事業皆悉停息。",
        "translation": "28. All human undertakings are brought to a halt.",
        "source": "T03n0187_003:0551c28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十九者高下之地悉皆平正。",
        "translation": "29. All high and low places are made level.",
        "source": "T03n0187_003:0551c29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十者所有街衢巷陌遊從道路，自然柔軟散花嚴飾。",
        "translation": "30. All the streets and lanes and roads that wander by are naturally soft and adorned with scattered flowers.",
        "source": "T03n0187_003:0552a01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十一者一切孕婦產生無難皆獲安隱。",
        "translation": "31. All pregnant women who arise without difficulty are made comfortable.",
        "source": "T03n0187_003:0552a02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十二者娑羅樹神出現半身合掌恭敬。",
        "translation": "32. The god Sālêndra appears half-figured, joins his palms, and venerates him.",
        "source": "T03n0187_003:0552a03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先現如此三十二種瑞相。",
        "translation": "These are the thirty-two auspicious appearances of the first one.",
        "source": "T03n0187_003:0552a04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時摩耶聖后，以菩薩威神力故，即知菩薩將欲誕生。",
        "translation": "\"At the time, the noble queen Maya, because of the bodhisattva's authority and spiritual power, knew that the bodhisattva was about to give birth.",
        "source": "T03n0187_003:0552a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於夜初分詣輸檀王，而說偈言：「『大王聽我今所請，　　久思詣彼龍毘園，　　於我不懷嫌妬心，　　願得速往暫遊觀。",
        "translation": "She went to King Śuddhodana in the early part of the night and spoke a verse, saying, 'Your Majesty, listen to my invitation now, for a long time I've been thinking about visiting that Nāgârjuna's park.",
        "source": "T03n0187_003:0552a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　大王精勤思惟法，　　修諸苦行多疲倦，　　自我懷此清淨人，　　處在宮中亦已久。",
        "translation": "The king diligently contemplates the Dharma, cultivates ascetic practices, and is weary, but I've harbored this pure person in my mind, and I've been in the palace for a long time.",
        "source": "T03n0187_003:0552a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　樹木蓊欝初榮茂，　　今時正可翫園林，　　節物方春甚佳美，　　與諸婇女相娛樂。",
        "translation": "The trees are luxuriant and flourishing at first, but now it's time to explore the grove. It's a beautiful time of year when things are in season, and I'm entertaining the women.",
        "source": "T03n0187_003:0552a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　眾鳥和鳴似歌頌，　　飛花處處皆盈滿，　　惟願大王速垂勅，　　及時遊彼好園苑。』",
        "translation": "The birds sing in harmony like songs, and the flying flowers are everywhere in abundance.",
        "source": "T03n0187_003:0552a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　王聞聖后斯語已，　　欣然即勅諸臣佐：　『速嚴妙好諸輦輿，　　龍毘尼園亦莊嚴。",
        "translation": "After hearing these words from the noble queen, the king readily commanded his ministers, 'Quickly adorn the wonderful and beautiful mounts, and the Lumbinī Gardens will be adorned as well.",
        "source": "T03n0187_003:0552a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　又宜駕被二萬象，　　色類白雪形似山，　　摩尼珠寶耀其體，　　真金線網彌其上。",
        "translation": "It's also appropriate to carry a carriage of 20,000 elephants, whose color is like white snow and shape is like a mountain, whose bodies are shining with maṇi jewels, and whose tops are covered with a net of genuine gold thread.",
        "source": "T03n0187_003:0552a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　象王皆悉六牙備，　　兩邊交垂以珍鐸，　　又取二萬駿捷馬，　　朱驄白質如銀雪。",
        "translation": "The elephant king is fully equipped with six tusks, draped on either side with rare pendants, and he takes 20,000 fast and furious horses, red and white like silver and snow.",
        "source": "T03n0187_003:0552a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　勒以金鞍寶鈴網，　　其馬迅疾如風馳，　　二萬勝兵皆勇健，　　能伏怨敵堪營衛。",
        "translation": "They were fastened with golden saddles and jeweled bell nets, and their horses raced like the wind. 20,000 superior soldiers were brave and sturdy, capable of overcoming enemies and standing guard.",
        "source": "T03n0187_003:0552a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　各擐甲冑及干戈，　　并執鬪輪將羂索，　　聖后所乘諸輦輿，　　摩尼雜寶間莊嚴。",
        "translation": "Each is armored, armed, and armed with a fistfighting wheel and a fetter, and the mounts on which the noble queen rides are adorned with a collection of precious metals.",
        "source": "T03n0187_003:0552a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　又以車載眾珍饌，　　於上覆之微妙帊，　　又部車兵勇健者，　　被甲執持諸器仗。",
        "translation": "Carrying a multitude of delicacies on board, they are covered with subtle (subtle) (Patch), and they have charioteers who are brave and robust, armored, and carrying weapons and battles.",
        "source": "T03n0187_003:0552a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　又駕無量諸車乘，　　載以珍琦眾雜寶，　　又以無邊諸妙寶，　　周匝彫瑩龍毘園。",
        "translation": "They also drive measureless chariots and carts, carrying precious and mixed treasures, and they surround themselves with limitless marvelous treasures that are sculpted and decorated by the Nāgârjuna Park.",
        "source": "T03n0187_003:0552a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　又以珠寶并綺繒，　　校飾園中好林樹，　　處處皆以名華散，　　猶如帝釋歡喜園。",
        "translation": "They decorate the park's fine groves with jewelry and fancy silks, and they scatter flowers everywhere, just like Indra's joyous garden.",
        "source": "T03n0187_003:0552b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝等種種嚴辦訖，　　即宜速疾來報我。』",
        "translation": "After you have completed your various preparations, you should quickly report to me.'",
        "source": "T03n0187_003:0552b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　群臣既承王勅已，　　尋時具物皆營辦。",
        "translation": "After the ministers had received the king's order, they looked for everything to be ready.",
        "source": "T03n0187_003:0552b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　奏言：『福壽最勝王，　　如所教勅皆已集。』",
        "translation": "They reported, 'The king of the most excellent fortune and longevity has gathered them all according to the instructions he's given.'",
        "source": "T03n0187_003:0552b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　王聞是事心歡喜，　　尋便入閤勅內人：　『若能愛樂隨我者，　　汝等應當盡嚴飾，　　香熏繒綵袨衣服，　　柔軟微妙令心喜。",
        "translation": "When the king heard this, his heart rejoiced, and he went into the palace and commanded the inner circle, 'If you could delight in following me, you would all adorn yourselves with fragrant silken robes that are soft and delicate and make your hearts happy.",
        "source": "T03n0187_003:0552b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　珠珮瓔珞自嚴身，　　各持百千眾樂器，　　琴瑟簫笛箜篌等，　　鼓吹當令出妙音。",
        "translation": "You should adorn yourselves with jewelry and ornaments, and each should carry a hundred thousand instruments, such as lutes, music instruments, flutes, and harps, that make beautiful sounds when blown.",
        "source": "T03n0187_003:0552b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　天人男女若聞者，　　皆使愛樂生歡喜，　　聖后所坐寶車輿，　　無令異人得親近。』",
        "translation": "If gods and men of both sexes hear them, they'll be delighted and rejoice, and the noble queen will sit on a jeweled chariot and mule, so no stranger will ever get close to them.'",
        "source": "T03n0187_003:0552b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸婇女等為執御，　　一切惡相皆除屏，　　四兵總集王門首，　　隱隱如聞海浪聲。",
        "translation": "The women in charge of the carriage remove all negative appearances, and the four soldiers assemble at the king's entrance, hidden away as they hear the sound of waves in the ocean.",
        "source": "T03n0187_003:0552b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　聖后初出宮門已，　　咸唱吉祥微妙頌，　　輦輿王宮自彫飾，　　寶鈴寶鐸振和音。",
        "translation": "After the noble queen first emerged from the palace gates, everyone sang auspicious and subtle hymns, sculpted the king's palace with a marching chair, and vibrated with the sound of jeweled bells and pearls.",
        "source": "T03n0187_003:0552b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　然後百千諸天人，　　於上安施師子座，　　車中傍羅四寶樹，　　枝葉花果皆榮茂。",
        "translation": "Then, a hundred thousand gods and goddesses placed their lion seats on top and surrounded the chariot with four jeweled trees, whose branches, leaves, flowers, and fruits all flourished.",
        "source": "T03n0187_003:0552b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　復有瑞鳥聲和雅，　　繽紛翻舞而翔集，　　幢幡蓋網天衣服，　　高聳圍遶遍莊嚴。",
        "translation": "There are also portentous birds with elegant sounds that dance and gather, and banners, flags, and nets of heavenly garments that tower above and surround them in splendor.",
        "source": "T03n0187_003:0552b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸天婇女在虛空，　　以歡喜心而讚歎，　　聖后是時昇寶乘，　　三千世界六種動。",
        "translation": "As the gods and goddesses rise in the sky and praise them with joy, the noble queen ascends to the jeweled vehicle, and six of the 3,000 worlds move.",
        "source": "T03n0187_003:0552b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　帝釋淨除於道路，　　護世四王來御車，　　大梵天王為前導，　　而以屏除諸惡相。",
        "translation": "Indra cleanses the path, the four guardian kings come in their chariots, and the king of the Brahma gods leads the way, ridding it of all negative appearances.",
        "source": "T03n0187_003:0552b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　無量百千諸天眾，　　恭敬頂禮而瞻仰，　　見是天眾來營從，　　父王心生大欣喜。",
        "translation": "Measureless hundreds of thousands of gods bowed in respect and veneration, and when they saw this multitude of gods come to camp and follow them, the father king was greatly elated.",
        "source": "T03n0187_003:0552b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　念言：『聖后所懷妊，　　必定應是天中天，　　既為護世四天王，　　帝釋梵王諸天眾。",
        "translation": "He thought, 'The noble queen is expecting a child, surely she must be a god of gods, since she's one of the four heavenly kings who protect the world, and she's one of the many gods of Indra and Brahmā.",
        "source": "T03n0187_003:0552b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　廣設無邊大供養，　　由此定當得成佛，　　無有三界諸眾生，　　堪受如斯供養者。",
        "translation": "By making these limitless and great offerings, she surely will become a buddha, and there are no sentient beings in the three realms who could accept such offerings.",
        "source": "T03n0187_003:0552c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　設令釋梵及諸龍，　　四護世等受斯供，　　不堪任故當首碎，　　或因斯供便命終。",
        "translation": "Suppose Śakra, Brahmā, the dragons, or the four guardian gods accept such an offering, and they are unable to do so, so they'll be broken at the head, or their lives will end because of such an offering.",
        "source": "T03n0187_003:0552c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　唯有最勝天中天，　　堪受人天妙供養。』」",
        "translation": "Only the most excellent god of gods is capable of accepting such wonderful offerings from humans and gods.'\"",
        "source": "T03n0187_003:0552c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「時有八萬四千象兵馬兵車兵步兵，皆悉端正勇健無敵，被以甲冑種種莊嚴，執持器仗護衛聖后。",
        "translation": "The Buddha told the monks, \"At the time, 84,000 elephant and horse soldiers, charioteers, and foot soldiers were all correct and courageous, wearing armor and various kinds of adornment, and carrying weapons to guard the noble queen.",
        "source": "T03n0187_003:0552c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六萬釋種婇女翊從圍遶，王之眷屬若長若幼恭敬衛護。",
        "translation": "Surrounded by 60,000 Śākyamuni women, the king's retinue, whether elder or younger, respectfully guarded them.",
        "source": "T03n0187_003:0552c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又有六萬王之婇女，作倡伎樂種種歌舞，又有八萬四千諸天童女，八萬四千龍女，八萬四千乾闥婆女，八萬四千緊那羅女，八萬四千阿修羅女，如是等皆以眾寶而自莊嚴，作眾伎樂歌舞讚詠，翊從佛母往龍毘尼園，以好香水遍灑其地，散以天花，園中草木若時非時，枝葉花果悉皆榮熟，莊嚴殊勝猶如帝釋歡喜之園。",
        "translation": "There were 60,000 of the king's Ṛṣipatana women who performed music, sang, and danced, 84,000 celestial maidens, 84,000 nāga maidens, 84,000 gandharvas, 84,000 kiṃnara maidens, and 84,000 asura maidens, all of whom adorned themselves with various treasures, performed music, sang, danced, and praised the Buddha's mother, and assisted her as she went to the Nāgârjuna's Vineyard, sprinkled the ground with good perfume, scattered smallpox, and ripened the leaves, flowers, and fruit of the plants and trees in the vineyard, both timely and untimely, in an ornate and distinguished manner like the joyous garden of Indra.",
        "source": "T03n0187_003:0552c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時聖后既到園已，遊歷詳觀至波叉寶樹，其樹枝葉蓊欝鮮潤，天花人花周匝開敷，微風吹動香氣芬馥，又以雜彩摩尼珠寶而嚴飾之。",
        "translation": "\"After arriving at the garden, the noble queen wandered around and took a detailed look at the Bokhara-jeweled tree, whose branches and leaves were luxuriant and lush, and whose smallpox and human flowers were in full bloom, perfumed by the breeze, and adorned with a variety of colored maṇi jewels.",
        "source": "T03n0187_003:0552c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樹下周遍地平如掌，所出眾草其色青紺如孔雀尾，能生樂觸如迦隣陀衣，過去無量諸佛之母，亦皆來坐此寶樹下。",
        "translation": "The ground beneath the tree is as flat as a palm, and the grass that grows out of it is as blue and violet as a peacock's tail and produces a pleasant sensation like Kālindra's robe; the mothers of measureless buddhas from the past have also come to sit under this jeweled tree.",
        "source": "T03n0187_003:0552c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時百千淨居天子其心寂靜，或垂辮髮，或著寶冠，至此樹下圍遶聖后，歡喜頂禮奏天伎樂而讚歎之，即以菩薩威神，其樹枝幹風靡而下，於是稽首禮聖后足。",
        "translation": "Then, a hundred thousand celestials of the pure abode, some with silenced minds, some with braided hair or wearing jeweled crowns, surrounded the noble queen under this tree, rejoiced, paid homage to her, played celestial music, and praised her, and then, with the authority of the bodhisattvas, the branches of the tree blew down, and they bowed their heads at the feet of the noble queen.",
        "source": "T03n0187_003:0552c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時聖后放身光明，如空中電，仰觀於樹，即以右手攀樹東枝，頻申欠呿，端嚴而立。",
        "translation": "\"At that point, the noble queen radiated her body's radiance like lightning in the sky, looked up at the tree, climbed onto its eastern branch with her right hand, repeatedly made a faux pas, and stood upright.",
        "source": "T03n0187_003:0552c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時欲界六萬百千諸天婇女，至聖后所承事供養。",
        "translation": "At the time, 60,000,000 gods and goddesses from the desire realm went to the noble queen to serve and make offerings to her.",
        "source": "T03n0187_003:0553a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘當知！",
        "translation": "Monks, you should know this!",
        "source": "T03n0187_003:0553a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩住胎成就如上種種功德神通變現，滿足十月，從母右脇安詳而生，正念正知而無染著。」",
        "translation": "The bodhisattva abides in the womb and accomplishes the above-mentioned miraculous manifestations of merit, fulfills the tenth month, and is born peacefully from his mother's right hypochondrium with right mindfulness and right knowledge and without defiled attachment.\"",
        "source": "T03n0187_003:0553a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「是時帝釋及娑婆世界主梵天王，恭敬尊重曲躬而前，一心正念，即以兩手覆憍奢耶衣，承捧菩薩。",
        "translation": "The Buddha told the monks, \"Śakra and Brahmā, the lord of the Śākya world, then bowed down in respect and dignity, and with one mind focused on right concentration, they put their two hands over Kauśāya's robe and took the bodhisattva in their arms.",
        "source": "T03n0187_003:0553a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其事已畢，即將菩薩處胎之時所居寶殿還於梵宮。",
        "translation": "When they had finished, they returned the jeweled palace where the bodhisattva had been staying when he was in the womb to the Brahma palace.",
        "source": "T03n0187_003:0553a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩既誕生已，觀察四方，猶如師子及大丈夫，安詳瞻顧。",
        "translation": "\"After he was born, the bodhisattva looked out in all directions like a lion or a great man, gazing calmly.",
        "source": "T03n0187_003:0553a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘當知！",
        "translation": "Monks, you should know this!",
        "source": "T03n0187_003:0553a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於多生中積集善根，是時即得清淨天眼，觀見一切三千大千世界，國土城邑及諸眾生，所有心行皆悉了知。",
        "translation": "After accumulating good roots over many lifetimes, the bodhisattva then attains the pure divine eye, which observes all the 3,000 great thousand worlds, lands, cities, and sentient beings and fully knows their minds and actions.",
        "source": "T03n0187_003:0553a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是知已，而復觀察是諸眾生，所有戒定智慧及諸善根與我等不？",
        "translation": "After knowing this, does he then observe that these sentient beings possess morality, meditation, wisdom, and the good roots that we do?",
        "source": "T03n0187_003:0553a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃見十方三千大千世界，無一眾生與我等者。",
        "translation": "He then saw that there wasn't a single sentient being in the 3,000 great one-thousand worlds in the ten directions that was equal to me.",
        "source": "T03n0187_003:0553a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩善自思惟稱量正念，不假扶持即便自能東行七步，所下足處皆生蓮華。",
        "translation": "\"At the time, the bodhisattva well-considered, measured, and correctly mindful, he was able to take seven steps eastward without support, and lotus flowers sprouted everywhere he stepped down.",
        "source": "T03n0187_003:0553a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩是時無有怖畏，亦無謇訥，作如是言：『我得一切善法，當為眾生說之。』",
        "translation": "Without fear or embarrassment, the bodhisattva then said, 'I've attained all good qualities, and I will explain them to sentient beings.'",
        "source": "T03n0187_003:0553a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又於南方而行七步，作如是言：『我於天人應受供養。』",
        "translation": "\"Again, he took seven steps to the south and said, 'Here among gods and humans, I should accept offerings.'",
        "source": "T03n0187_003:0553a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又於西方而行七步，作如是言：『我於世間最尊最勝，此即是我最後邊身，盡生老病死。』",
        "translation": "\"Again, he took seven steps to the west and said, 'I'm the most honored and most superior in the world, and this is my final body, which will end birth, old age, illness, and death.'",
        "source": "T03n0187_003:0553a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又於北方而行七步，作如是言：『我當於一切眾生中，為無上上。』",
        "translation": "\"Again, he took seven steps to the north and said, 'Among all sentient beings, I will be the most excellent.'",
        "source": "T03n0187_003:0553a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又於下方而行七步，作如是言：『我當降伏一切魔軍，又滅地獄諸猛火等所有苦具，施大法雲雨大法雨，當令眾生盡受安樂。』",
        "translation": "\"Again, he took seven steps below and said, 'I will subdue all the armies of Māra, extinguish all the instruments of suffering such as the fierce fires of hell, and send great clouds of the Dharma and great showers of the Dharma, which will cause all sentient beings to experience well-being.'",
        "source": "T03n0187_003:0553a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又於上方而行七步，作如是言：『我當為一切眾生之所瞻仰。』",
        "translation": "\"Again, he took seven steps upward and said, 'I will be a source of veneration for all sentient beings.'",
        "source": "T03n0187_003:0553b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩說是語時，其聲普聞一切三千大千世界。",
        "translation": "When the bodhisattva spoke those words, his voice was heard throughout the 3,000 great one-thousand worlds.",
        "source": "T03n0187_003:0553b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘當知！",
        "translation": "Monks, you should know this!",
        "source": "T03n0187_003:0553b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於多生中積集善根，於最後生得阿耨多羅三藐三菩提，法爾如是神通變化。",
        "translation": "After accumulating good roots over many lifetimes, a bodhisattva attains supreme perfect enlightenment in his final lifetime, and this is how his powers change.",
        "source": "T03n0187_003:0553b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘當知！",
        "translation": "\"Monks, you should know!",
        "source": "T03n0187_003:0553b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時一切眾生歡喜踊躍，大地震動，而諸眾生無有恐怖，三千大千世界所有非時藥木，皆悉榮茂。",
        "translation": "At the time, all sentient beings rejoice and jump for joy, a great earthquake rattles them, and there's no fear among sentient beings, for all the medicine and trees of the 3,000 great one-thousand worlds that don't have seasonal roots are all flourishing.",
        "source": "T03n0187_003:0553b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於虛空中出妙音聲，降微細雨，及雨種種天諸花香，真珠瓔珞上妙衣服繽紛徐墜。",
        "translation": "In the sky, wonderful sounds emanate, sending down fine rain and raining down the fragrance of various heavenly flowers and the splendor of real beads and jewelry, and fine clothing falls in a profusion.",
        "source": "T03n0187_003:0553b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又扇和暢微妙香風，能生清淨柔軟樂觸，無雲無霧、無煙無塵及以暗冥，於虛空中而聞清徹和雅梵音，稱歎菩薩諸功德法。",
        "translation": "There's a fan of fine, smooth fragrance that produces a pure, gentle, and pleasant sensation, and there are no clouds, no mist, no smoke, no dust, and no darkness, and the clear, penetrating, and elegant sounds of Brahmā are heard in the sky, praising the bodhisattva's meritorious qualities.",
        "source": "T03n0187_003:0553b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩放大光明，無量百千種種異色，遍滿三千大千世界。",
        "translation": "At that point, the bodhisattva's radiant light, which has measureless hundreds of thousands of different colors, fills 3,000 great thousand worlds.",
        "source": "T03n0187_003:0553b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生遇斯光者，身心安隱快樂無極。",
        "translation": "When all sentient beings encounter this light, their physical and mental well-being is peaceful and joyous.",
        "source": "T03n0187_003:0553b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切日月、諸大梵王、帝釋護世及餘天人，所有光明皆悉不現。",
        "translation": "All the brightness of the sun and moon, the great Brahmā kings, Indra's protectors, and other gods and humans are invisible.",
        "source": "T03n0187_003:0553b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時一切眾生，遠貪恚癡憂悲驚恐，亦離不善諸惡罪障，所有病苦眾生皆得痊除，飢渴眾生皆得飽滿，顛狂醉亂皆得惺悟，諸根缺減皆得圓滿。",
        "translation": "\"At that point, all sentient beings are free of craving, delusion, grief, pity, and fear, and they're freed from unwholesome and harmful hindrances, so all suffering sentient beings are cured, all hungry and thirsty sentient beings are filled, all deluded and drunk sentient beings are awakened, and all deficiencies in the faculties are perfected.",
        "source": "T03n0187_003:0553b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貧者得財，繫者解脫，地獄眾生皆蒙休息，畜生眾生無相害心，餓鬼眾生皆得飽滿。」",
        "translation": "The poor obtain wealth, the fettered are freed, sentient beings in hell are given rest, sentient beings in animals have no harmful thoughts, and sentient beings in hungry ghosts are filled.\"",
        "source": "T03n0187_003:0553b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「菩薩於阿僧祇百千拘胝那由他劫，修諸善行精進力故，初生之時即能十方各行七步，一切諸佛如來威加，此地化為金剛，菩薩遊踐得無陷裂。",
        "translation": "The Buddha told the monks, \"Because of the power of diligence in cultivating good practices during the incalculable hundreds of thousands of koṭīnayutas, when the bodhisattva is first born, he's able to walk seven steps in ten directions, and the authority of all the buddha-tathāgatas transforms this place into adamantine, so the bodhisattva wanders around without getting trapped.",
        "source": "T03n0187_003:0553b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時世界中間幽冥之處，悉皆大明，其中眾生各得相見。",
        "translation": "At the time, the dark places in the middle of the world were all greatly illuminated, and sentient beings therein were able to see each other.",
        "source": "T03n0187_003:0553b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又於此時，諸天音樂出微妙聲，雨眾天花末香熏香，花鬘珍寶諸莊嚴具上妙衣服，如雲而下，一切眾生皆得上妙安隱快樂。",
        "translation": "At the same time, the gods' music and sounds emitted subtle sounds, rained down smells of flowers, fragrances of powdered incense, and flowers, jewelry, and other adornments of the finest clothing like clouds, and all sentient beings attained wonderful peace and happiness.",
        "source": "T03n0187_003:0553c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩出現世間最尊最勝，所有功德入不思議，若欲廣說窮劫不盡。」",
        "translation": "The bodhisattva's appearance in the world is most honored and most excellent, and his abilities are inconceivable; if I wanted to explain them in detail, they wouldn't end for an eternity.\"",
        "source": "T03n0187_003:0553c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿難從座而起，偏袒右肩右膝著地，合掌恭敬而白佛言：「世尊！",
        "translation": "Ānanda then rose from his seat, bared his right shoulder, knelt on his right knee, put his palms together in respect, and said to the Buddha, \"Bhagavān!",
        "source": "T03n0187_003:0553c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來為菩薩時，尚能成就如是勝希有事，何況得成阿耨多羅三藐三菩提？」",
        "translation": "When the Tathāgata was a bodhisattva, he was still able to achieve such extraordinary things, so how could he attain unsurpassed, perfect enlightenment?\"",
        "source": "T03n0187_003:0553c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「未來世中有諸比丘，不能修習身戒心慧，愚癡無智憍慢貢高，掉舉心亂不遵法律，多所貪求不信正法，具沙門垢相似沙門，如是比丘，若聞菩薩清淨入胎，不能信受，乃復共聚撗生誹謗，作如是言：『菩薩處胎居母右脇，雖不為彼膿血所污，何能有此大功德耶？』",
        "translation": "The Buddha told Ānanda, \"In a future age, there will be monks who are unable to cultivate physical morality and mental wisdom, are foolish and unwise, arrogant and conceited, disorderly in their conduct and disobey the law, have numerous desires and don't believe in the true teaching, and resemble ascetics with ascetic defilement.",
        "source": "T03n0187_003:0553c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是愚人，既不能知菩薩積集功德，亦不能知菩薩示現入胎，而有如是殊勝清淨無量功德，哀愍眾生出現於世。",
        "translation": "Such a foolish man can't know that a bodhisattva has accumulated merit or that he's manifested into a womb with such excellent, pure, and immeasurable virtue that he pities sentient beings and appears in the world.",
        "source": "T03n0187_003:0553c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T03n0187_003:0553c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛如來出現於世，不於天上而成正覺轉妙法輪，但於人間示現成佛。",
        "translation": "When the Buddha-tathāgatas appear in the world, they don't become fully awakened in the heavens and turn the marvelous Dharma wheel, but they manifest themselves as buddhas here among humans.",
        "source": "T03n0187_003:0553c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T03n0187_003:0553c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於天上成阿耨多羅三藐三菩提者，人中眾生咸作是念：『我既非天，何能堪任修習佛道？』",
        "translation": "If someone in the heavens achieves supreme perfect enlightenment, then sentient beings among humans will think, 'Since I'm not a god, how could I be capable of cultivating the Buddha Way?'",
        "source": "T03n0187_003:0553c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便生退屈。",
        "translation": "\"They'll then become resigned.",
        "source": "T03n0187_003:0553c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是義故，但於人間成阿耨多羅三藐三菩提。",
        "translation": "Because of this, it's only humanly possible to achieve supreme perfect enlightenment.",
        "source": "T03n0187_003:0553c23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然彼愚癡法賊之輩，而於菩薩不思議事不能了知，撗生誹謗妄為憶度。",
        "translation": "However, those foolish Dharma thieves don't understand the inconceivable qualities of bodhisattvas, and they revile and falsely conceptualize them.",
        "source": "T03n0187_003:0553c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T03n0187_003:0553c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愚癡之人尚不信佛有無量德，何況能信菩薩神通？",
        "translation": "A foolish man still doesn't believe in the Buddha's immeasurable merits, so how could he believe in the bodhisattva's supernormal powers?",
        "source": "T03n0187_003:0553c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是比丘耽著利養及以名聞，沈溺罪垢。」",
        "translation": "Such a monk is addicted to gain and fame, and he's sunken into the stain of sin.\"",
        "source": "T03n0187_003:0553c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛言：「世尊！",
        "translation": "Ānanda said to the Buddha, \"Bhagavān!",
        "source": "T03n0187_003:0553c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當來之世，若有如是愚癡下劣之人，誹謗此經，得幾所罪？",
        "translation": "In a future age, if such a foolish and base person denigrates this sūtra, how much of a crime will it be?",
        "source": "T03n0187_003:0553c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當生何處？」",
        "translation": "Where will it be born?\"",
        "source": "T03n0187_003:0554a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「若未來世有如是等諸惡比丘，誹謗此經，積集眾罪離沙門法。",
        "translation": "The Buddha told Ānanda, \"Suppose there are such bad monks in the future who denigrate this sūtra and accumulate numerous sins and leave the ascetic tradition.",
        "source": "T03n0187_003:0554a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T03n0187_003:0554a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人滅佛菩提，毀呰十方三世諸佛，其所獲罪寧為多不？」",
        "translation": "Suppose someone extinguishes the buddha's enlightenment and disparages the buddhas of the ten directions and three times, how much more would that sin be?\"",
        "source": "T03n0187_003:0554a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難言：「甚多世尊！」",
        "translation": "Ānanda said, \"Very much so, Bhagavān!\"",
        "source": "T03n0187_003:0554a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「若有眾生誹謗如斯大乘經典，其所獲罪與此人等。」",
        "translation": "The Buddha told Ānanda, \"If a sentient being denigrates such a great vehicle sūtra, that person will be as guilty as he is.\"",
        "source": "T03n0187_003:0554a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿難聞是語已，身毛為竪，唱如是言：「南無佛陀！",
        "translation": "After hearing those words, Ānanda's hair stood on end and he said, \"Homage to the Buddha!",
        "source": "T03n0187_003:0554a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "南無佛陀！",
        "translation": "Homage to the Buddha!",
        "source": "T03n0187_003:0554a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞彼人行如是惡，身心迷悶。」",
        "translation": "I've heard that person does such evil deeds that they're physically and mentally confused.\"",
        "source": "T03n0187_003:0554a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「若有眾生滅佛菩提，其人由此惡行因故，當墮阿鼻大地獄中。",
        "translation": "The Buddha told Ānanda, \"If a sentient being annihilates the Buddha's enlightenment, that person will fall into the great hell of Abhidharma as a result of their bad deeds.",
        "source": "T03n0187_003:0554a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T03n0187_003:0554a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於未來世，有比丘、比丘尼、優婆塞、優婆夷，誹謗如斯大乘經典，其人命終定墮阿鼻大地獄中。",
        "translation": "In a future life, if a monk, a monk and nun, an upāsaka, or an upāsik denigrate such a great vehicle scripture, that person will surely fall into the great hell of Abhidharma when their life ends.",
        "source": "T03n0187_003:0554a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T03n0187_003:0554a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於如來功德不應限量。",
        "translation": "Your merit with the Tathāgata shouldn't be limited.",
        "source": "T03n0187_003:0554a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0187_003:0554a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來功德甚深廣大難可測故。",
        "translation": "The Tathāgata's virtues are too profound and vast to fathom.",
        "source": "T03n0187_003:0554a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T03n0187_003:0554a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有人聞此經典，信受愛樂生歡喜心，如是等人即得淨命獲大利益，其人一生為不唐捐，已修善行已得真實，離三惡道當成佛子，已得深信堪受供養，於諸聖賢心生清淨，亦當決除一切魔網，而能出於生死曠野，拔憂惱箭，善知歸依獲勝妙樂。",
        "translation": "If another person hears this sūtra and becomes joyous with faith, such a person will attain purified life and receive great benefit. That person's life will not be in vain; they've cultivated good conduct and attained truth; they'll become a son of the Buddha after leaving the three bad destinies; they've attained deep faith and are worthy of offerings; their mind will be purified by the noble ones; they'll also be able to remove all the webs of Māra and emerge from the wilderness of birth and death, remove the arrows of sorrow and vexation, and know well how to rely on them for surpassing marvelous happiness.",
        "source": "T03n0187_003:0554a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等人甚為希有，堪作世間無上福田。",
        "translation": "Such people are rare and can serve as an unsurpassed field of merit in the world.",
        "source": "T03n0187_003:0554a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T03n0187_003:0554a22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛之法甚深難信而能信故。",
        "translation": "\"The teachings of the buddhas are so profound and difficult to believe that it's possible to believe them.",
        "source": "T03n0187_003:0554a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難當知！",
        "translation": "Ānanda, you should know!",
        "source": "T03n0187_003:0554a23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人非少善根而得成就如是之信。",
        "translation": "This person doesn't have few good roots that would lead them to achieve such faith.",
        "source": "T03n0187_003:0554a23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T03n0187_003:0554a24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛如來曾與彼人，於多生中為善知識。",
        "translation": "The buddha-tathāgatas have been with people who have been good teachers in many lifetimes.",
        "source": "T03n0187_003:0554a24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T03n0187_003:0554a25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生，於佛世尊雖未得見，但聞名字即生信喜；或復有人不聞佛名，得見如來便生信喜；或復有人雖得見聞不生信喜；或復有人若聞若見皆生信喜。",
        "translation": "Suppose there are sentient beings who hear the name of the Bhagavān and become joyful in faith even though they haven't yet seen it; another person who doesn't hear the Buddha's name and then sees the Tathāgata becomes joyful in faith; another person who sees and listens but doesn't become joyful in faith; or another person who hears and sees both become joyful in faith.",
        "source": "T03n0187_003:0554a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T03n0187_003:0554a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除不信喜，當知是人於多生中，皆蒙如來為善知識，其人功德與如來等，即為如來成就度脫而攝受之。",
        "translation": "Except for disbelief and joy, you should know that this person has had the Tathāgata as a good teacher for many lifetimes, and his merits are equal to those of the Tathāgata, which means he's been taken in by the Tathāgata for his accomplishment of liberation.",
        "source": "T03n0187_003:0554b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T03n0187_003:0554b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔修菩薩道時，諸有眾生來至我所，我皆攝受施其無畏。",
        "translation": "In the past, when I was cultivating the bodhisattva path, I took in all the sentient beings who came to me and gave them fearlessness.",
        "source": "T03n0187_003:0554b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等今者，應生淨信精勤修習。",
        "translation": "Now, you should give rise to pure faith and diligently cultivate it.",
        "source": "T03n0187_003:0554b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝所應作悉已開顯，亦為汝等拔憍慢箭。",
        "translation": "What you should do has all been revealed, and I'll remove the arrow of conceit for you.",
        "source": "T03n0187_003:0554b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T03n0187_003:0554b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人久別親友，過百由旬冒遠尋之，得與相見暫解離念尚生歡喜，何況曾得值佛種諸善根，今復覲佛得為親友，而不喜耶？",
        "translation": "It's like a person who has been separated from their friends for a long time and has ventured far and wide for a hundred leagues, but is still happy to see them and be free of mindfulness for a moment, so why wouldn't they be happy to have planted good roots with the Buddha and now visit him as a friend?",
        "source": "T03n0187_003:0554b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難當知！",
        "translation": "Ānanda, you should know!",
        "source": "T03n0187_003:0554b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來諸佛皆作是念：『此諸人等，已得過去如來為善知識，今復值我。",
        "translation": "The buddhas of the future will all think, 'These people have attained the status of good teachers from past tathāgatas, and now they've rejoined me.",
        "source": "T03n0187_003:0554b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我與是人亦為親友，心生歡喜。』",
        "translation": "I've also become close friends with this person, and my heart rejoices.'",
        "source": "T03n0187_003:0554b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人見親友時心生歡喜，見友之友亦生歡喜。",
        "translation": "It's like a person whose heart rejoices when they see a friend, and they rejoice when they see a friend.",
        "source": "T03n0187_003:0554b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T03n0187_003:0554b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生於此經典少分生信，我以是人付未來佛。",
        "translation": "'If sentient beings give rise to a little faith in this sūtra, I'll give this person to a future Buddha.'",
        "source": "T03n0187_003:0554b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛亦當作如是念：『此等眾生是我親友，如其所願當令滿足。』",
        "translation": "That Buddha will also think, 'Such sentient beings are my friends and relatives, so I will grant them their wishes.'",
        "source": "T03n0187_003:0554b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人多諸親友，唯生一子心甚憐念，其人不久病欲命終，喚其所親付是愛子，其友受付念如己子。",
        "translation": "Suppose there's a person who has many close friends but has only one child, and their thoughts are kind, because soon that person will become ill and want to die, they call their relative and tell him or her to entrust that person with a beloved son, and that friend accepts the entrustment and thinks of him or her as their own son.",
        "source": "T03n0187_003:0554b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛亦如是。",
        "translation": "So it is with the buddhas.",
        "source": "T03n0187_003:0554b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來諸佛皆是親友，以是眾生付未來佛。",
        "translation": "All the buddhas of the future will be relatives and friends, and these sentient beings will be entrusted to the buddhas of the future.",
        "source": "T03n0187_003:0554b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T03n0187_003:0554b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今開悟於汝，汝應於此深生淨信，當勤修習。」",
        "translation": "Now that I've enlightened you, you should have deep and pure faith in this and diligently cultivate it.\"",
        "source": "T03n0187_003:0554b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「菩薩生時，無量百千拘胝那由他天諸婇女，以天妙花、塗香末香、花鬘衣服、眾莊嚴具，散聖后上如雲而下。」",
        "translation": "The Buddha addressed the monks, \"When the bodhisattva is born, measureless hundreds of thousands of Kauṇḍinya gods and concubines bring down clouds of wonderful flowers, perfume, flower garments, and various adornments from the gods above the noble queen.\"",
        "source": "T03n0187_003:0554b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊說是偈言：「將生離垢光，　　天女有六萬，　咸出妙歌頌，　　讚歎菩薩母。",
        "translation": "It was then that the Bhagavān spoke this verse, saying, \"There are 60,000 goddesses who are about to be born in the light of freedom from pollution, and they all sing wonderful songs in praise of the bodhisattva's mother.",
        "source": "T03n0187_003:0554b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　皆於聖后前，　　歡喜作是言：『願勿懷憂惱，　　我等堪供養。",
        "translation": "They all rejoiced in the presence of the noble queen and said, 'May we not be troubled, for we can make offerings.",
        "source": "T03n0187_003:0554b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　尊生出三界，　　無上大醫王，　草木花葉敷，　　人天盡恭敬。",
        "translation": "His holiness is born out of the three realms, the unsurpassed great king of doctors, whose grass, trees, flowers, and leaves are grown, and who is respected by humans and gods alike.",
        "source": "T03n0187_003:0554c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大地六種動，　　名聞遍十方，　如是最勝人，　　聖后今生彼。",
        "translation": "Six kinds of earthly movement are heard throughout the ten directions, and such is the most excellent person to be born there after his sainthood.",
        "source": "T03n0187_003:0554c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　虛空諸樂器，　　不鼓而自鳴，　百千淨居天，　　歸命生歡喜。",
        "translation": "Instruments in the sky sound without drumming, and a hundred thousand gods of pure abode rejoice when they take refuge.",
        "source": "T03n0187_003:0554c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今者聖人出，　　為世作津梁，　四王釋梵等，　　及餘諸天眾，　曲躬盡圍遶，　　咸生歡喜心。",
        "translation": "Now, when the sage emerges and serves as a pillar for the world, the four kings, Brahmā, and the rest of the gods bend their heads around him, and they all rejoice.",
        "source": "T03n0187_003:0554c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼人中師子，　　當出母右脇，　光明極清淨，　　暉耀如金山。』",
        "translation": "That lion among men will emerge from his mother's right side with a bright, extremely clear light that shines like a gold mountain.'",
        "source": "T03n0187_003:0554c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　釋梵手承捧，　　震動百千界，　三惡趣眾生，　　離苦皆安樂，　天衣及天花，　　遍滿於虛空。",
        "translation": "The Śākyamuni's hand carries him, shaking a hundred thousand realms, freeing sentient beings in the three bad destinies from suffering and bringing them well-being, and filling the sky with heavenly robes and smallpox.",
        "source": "T03n0187_003:0554c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛精進力，　　此地為金剛，　導師所下足，　　瑞蓮隨步起。",
        "translation": "With the power of the buddhas' zeal, this stage becomes adamantine, and as the guide steps down, the auspicious lotus rises with each stride.",
        "source": "T03n0187_003:0554c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　周行七步時，　　演妙梵音聲：『我為大醫王，　　能除生死病。",
        "translation": "As he takes seven steps around, he produces a marvelous Brahmā sound, 'I'm the great king of doctors, able to remove the illness of birth-and-death.",
        "source": "T03n0187_003:0554c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我於世間中，　　為最尊最勝。』",
        "translation": "Among the worlds, I'm the most honored and most superior.'",
        "source": "T03n0187_003:0554c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　梵釋諸天等，　　在於虛空中，　以手捧香水，　　灌灑於菩薩。",
        "translation": "Brahmā and the Śakra gods were up in the sky, holding perfume in their hands and pouring it on the bodhisattva.",
        "source": "T03n0187_003:0554c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　龍王下二水，　　冷煖極調和；　諸天以香水，　　洗浴於菩薩。",
        "translation": "The dragon-king rained down two waters, both cold and warm, that were perfectly harmonious, and the gods washed the bodhisattva with the perfume.",
        "source": "T03n0187_003:0554c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三千大千界，　　一切皆震動。",
        "translation": "The whole world of the 3,000 great one-thousand worlds shakes.",
        "source": "T03n0187_003:0554c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天持白蓋，　　并執素瓔紼，　遍覆於虛空，　　皆以寶莊嚴，　持種種供具，　　供養人師子。",
        "translation": "The gods hold white canopies and carry plain mantles that cover the sky, adorned with treasures, and carry various offerings to the human lion.",
        "source": "T03n0187_003:0554c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有報輸檀王：　　『王生眾相子，　增長於王族，　　從王種姓生，　當作轉輪王，　　統領四天下。",
        "translation": "There was a reward for King Shodan: 'The king gives birth to a son of many characteristics who will grow up in the king's lineage and be born from the king's family, then he'll become a wheel-turning king and rule the four worlds.'",
        "source": "T03n0187_003:0554c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應知釋種中，　　時生五百子，　一切皆勇健，　　力如那羅延。』",
        "translation": "You should know that among the Śākya lineage, there are 500 sons born at that time, all of whom are brave and strong like Narāyaṇa.'",
        "source": "T03n0187_003:0555a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復有報王言：　　『婢僕各八百，　馬生二萬駒，　　牛生六萬犢。",
        "translation": "Another person reported to the king, saying, 'There are 800 maidservants each, 20,000 colts from horses, and 60,000 calves from cattle.",
        "source": "T03n0187_003:0555a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　象子有二萬。",
        "translation": "There are 20,000 sons of the elephant.",
        "source": "T03n0187_003:0555a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　四方諸國王，　同時皆慶賀，　　其數亦二萬。",
        "translation": "The kings of the four lands all celebrated at the same time, and their numbers were also 20,000.",
        "source": "T03n0187_003:0555a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸王咸欵附，　　[旃-方+示]首而白言：「善哉最勝王，　　我願為僮僕。」",
        "translation": "The kings all took their orders, [Kāśyapa-vara+show] bowed their heads, and said, 'Good, Most Excellent King, I wish to be a servant.'",
        "source": "T03n0187_003:0555a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　象王金網飾，　　歡躍至王宮，　牛有種種色，　　端正甚可愛。",
        "translation": "The elephant king, adorned with a golden web, leaps joyfully to the king's palace, and his oxen are of various colors and are quite lovely in their appearance.",
        "source": "T03n0187_003:0555a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　駿馬如珂雪，　　驄尾皆金色，　增顯大王族，　　王應自往觀。』",
        "translation": "The steeds are like snow, and their tails are golden, which enhances the great king's family; the king should go and see for himself.'",
        "source": "T03n0187_003:0555a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所有眾吉祥，　　皆因菩薩力，　天人見功德，　　咸生歡喜心，　發願求菩提，　　速登無上果。」",
        "translation": "All that is auspicious is due to the power of the bodhisattva, and when gods and humans see their virtue, they all become joyous and vow to seek bodhi and quickly attain the unsurpassed result.\"",
        "source": "T03n0187_003:0555a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「菩薩生已，輸檀王倍復增上而行法行，見來求者一切施與。",
        "translation": "The Buddha told the monks, \"After the bodhisattva's birth, King Śuddhodana doubly intensified his Dharma practice and gave generously to those who came seeking it.",
        "source": "T03n0187_003:0555a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸族姓中同於是時生二萬女。",
        "translation": "At the same time, 20,000 women were born among those of his clan.",
        "source": "T03n0187_003:0555a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸女之中，耶輸陀羅而為上首。",
        "translation": "Among those women, Yaśodharā was the leader.",
        "source": "T03n0187_003:0555a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸僕使及青衣等，所生男女數各八百，於諸男中車匿為最。",
        "translation": "The servants, messengers, and greenhorns each gave birth to 800 boys and girls, and among the boys, Chandaka was the most numerous.",
        "source": "T03n0187_003:0555a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "駿馬生駒其數二萬，於諸馬中乾陟為上。",
        "translation": "A stallion gives birth to a colt, which numbered 20,000, and among the horses, Kanchak was the highest.",
        "source": "T03n0187_003:0555a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生白象子數亦二萬。",
        "translation": "They give birth to 20,000 white elephant sons.",
        "source": "T03n0187_003:0555a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四百拘胝類洲之中，菩提樹牙是時初生名阿說他。",
        "translation": "In the middle of the four hundred continents of Kauśāmbī, the bodhi tree's tusks are first born and named Aśvattha.",
        "source": "T03n0187_003:0555a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於四洲中生栴檀林。",
        "translation": "On those four continents, a forest of sandalwood arises.",
        "source": "T03n0187_003:0555a24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於迦毘羅城四邊，自然出現五百園苑，五千寶藏從地踊出。",
        "translation": "On the four sides of Kapilavastu, five hundred parks and gardens naturally appear, and five thousand treasures spring up from the ground.",
        "source": "T03n0187_003:0555a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如上所說一切事物，所司部錄擬供菩薩。",
        "translation": "All of the things described above are recorded in the ministries intended for the bodhisattva.",
        "source": "T03n0187_003:0555a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時輸檀王與諸眷屬聚會，作是念言：『我子生已，一切事物皆悉增長成就，我當與子名薩婆悉達多。』",
        "translation": "King Śuddhodana then gathered with his retinue and had this thought, 'After my son is born, all things will grow and become accomplished, and I will give my son the name Svasiddhârtha.'",
        "source": "T03n0187_003:0555a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即以種種衣服飲食，慶賀菩薩此名。」",
        "translation": "He then congratulated the bodhisattva on this name with various kinds of clothing and food.\"",
        "source": "T03n0187_003:0555a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「菩薩生已，聖母右脇平復如故。",
        "translation": "The Buddha told the monks, \"After the bodhisattva was born, the right hypochondrium of the holy mother was as flat as before.",
        "source": "T03n0187_003:0555b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一井中出三種泉，浴菩薩母，又於池中出妙香油，聖后塗身。",
        "translation": "From a well, three kinds of springs sprang up to bathe the bodhisattva's mother, and from a pool of water came a wonderful fragrant oil that the noble queen used to rub on her body.",
        "source": "T03n0187_003:0555b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有五百千天諸婇女，各執寶缾持好香油，至聖后所而慰問言：『安隱生子，願無上損。』",
        "translation": "Five hundred thousand gods and goddesses each carried a precious container of good scented oil to the noble queen's residence, saying, 'May there be no harm in giving birth to a son in peace.'",
        "source": "T03n0187_003:0555b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有五百千天諸婇女，各各執持上妙塗香，塗聖后身，而慰問言：『安隱生子，願無上損。』",
        "translation": "Then there were 5,000,000 goddesses who each carried a container of fine perfume, coated the body of the noble queen, and comforted her, saying, 'May there be no harm in giving birth to a son in peace.'",
        "source": "T03n0187_003:0555b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有五百千天女，各各執持上妙天衣，為供養菩薩故，問聖后言：『安隱生子，願無上損。』",
        "translation": "Five hundred thousand goddesses each carried a robe of the finest celestial garments as an offering to the bodhisattva, and they asked the noble queen, 'May there be no harm in having a son born in peace.'",
        "source": "T03n0187_003:0555b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有五百千天諸婇女，各各執持寶莊嚴具，為供養菩薩故，問聖后言：『安隱生子，願無上損。』",
        "translation": "Again, there were 5,000,000 goddesses in Hakuba each carrying a precious ornament as an offering to the bodhisattva, and they asked the noble queen, 'May there be no upward loss when you give birth to a child in peace.'",
        "source": "T03n0187_003:0555b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又有五百千天諸婇女，各各執持上妙音樂鼓吹絃歌，為供養菩薩故，問聖后言：『安隱生子，願無上損。』",
        "translation": "There were another 5,000,000 gods and goddesses, each possessing a musical instrument of the highest quality, playing music, and singing music, who asked the noble queen about this offering to the bodhisattva, saying, 'May there be no harm in having a son born in peace.'",
        "source": "T03n0187_003:0555b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此閻浮提一切外道五通神仙，乘空至於輸檀王所，而白王言：『王生福德之子，吉祥無量種族增盛。』」",
        "translation": "All the five supernormal celestials of Jambudvīpa who were non-Buddhists rode up to King Śuddhodana in the sky and said to him, 'The king has produced a son of merit whose fortune will be immeasurable and whose race will increase.'\"",
        "source": "T03n0187_003:0555b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「菩薩生已，於龍毘尼園七日七夜，人天擊奏種種微妙音樂，而以供養尊重讚歎，復以種種上妙飲食，施設一切。",
        "translation": "The Buddha told the monks, \"After the bodhisattva was born, he spent seven days and nights at Nāgârjuna's Park, where humans and gods played all kinds of marvelous music, offered support, honored, and praised him, and gave him a variety of excellent foods and drinks to serve to everyone.",
        "source": "T03n0187_003:0555b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋種親族，皆悉集會讚言吉祥，悉行惠施作諸功德，供養三萬二千名聞勝智諸婆羅門，隨其所須皆令滿足。",
        "translation": "The Śākya clan gathered together, praised them as being auspicious, gave generosity and merit, made offerings to 32,000 Brahmins of renown and superior wisdom, and fulfilled their needs as they saw fit.",
        "source": "T03n0187_003:0555b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵王帝釋化作端正摩那婆身，於眾會中坐第一座，而演吉祥微妙讚歎。」",
        "translation": "The Brahma King Tissa transformed into the correct body of a manaputra, sat down at the first seat in the assembly, and spoke auspicious and subtle praises.\"",
        "source": "T03n0187_003:0555b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「菩薩生已，摩醯首羅告淨居天子言：『菩薩已於百千阿僧祇拘胝那由他劫，修習布施、持戒、忍辱、精進、禪定、智慧、方便、多聞，成就大慈大悲大喜大捨，心常希求利益一切，已於過去諸佛深種善根，從彼而生，以百福相而自嚴飾，勇猛決定，習諸善行降伏魔怨，已能成就清淨妙願，名大智幢，於三千大千世界中，為大導師，天人供養積集福德，增長意樂，遠離生老病死，能盡邊際，能於甘蔗上族中生，不久得阿耨多羅三藐三菩提覺悟世間。",
        "translation": "佛告諸比丘：「菩薩生已，摩醯首羅告淨居天子言：『菩薩已於百千阿僧祇拘胝那由他劫，修習布施、持戒、忍辱、精進、禪定、智慧、方便、多聞，成就大慈大悲大喜大捨，心常希求利益一切，已於過去諸佛深種善根，從彼而生，以百福相而自嚴飾，勇猛決定，習諸善行降伏魔怨，已能成就清淨妙願，名大智幢，於三千大千世界中，為大導師，天人供養積集福德，增長意樂，遠離生老病死，能盡邊際，能於甘蔗上族中生，不久得阿耨多羅三藐三菩提覺悟世間。",
        "source": "T03n0187_003:0555b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我與汝等可共往彼，供養恭敬尊重讚歎，及為斷除諸餘天子憍慢掉舉故，令彼諸天於長夜中獲利益故，得安樂故，證菩提故。",
        "translation": "We can go there together, make offerings, honor, respect, and praise him, and stop the other gods from being arrogant and discouraged so that the gods will benefit during the long night, attain well-being, and realize bodhi.",
        "source": "T03n0187_003:0555c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又欲見輸檀王，讚歎吉祥慶賀種族，宣說菩薩定當成佛。』",
        "translation": "They also wanted to meet King Khotan, praise him for his auspicious race, and congratulate him by proclaiming that the bodhisattvas would surely become buddhas.'",
        "source": "T03n0187_003:0555c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時摩醯首羅天子，與十二百千天眾圍遶，光明赫奕照迦毘羅城，詣輸檀王宮，頂禮菩薩遶百千匝，恭敬捧持。",
        "translation": "\"It was then that the god Mahêśvara, surrounded by twelve hundred thousand gods and shining brilliantly in the city of Kapilavastu, went to King Śuddhodana's palace, paid homage to the bodhisattva, circled him a hundred thousand times, and held him in respect.",
        "source": "T03n0187_003:0555c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慶賀輸檀王言：『大王應大歡喜。",
        "translation": "He congratulated King Śuddhodana and said, 'Greatly rejoice, Your Majesty!",
        "source": "T03n0187_003:0555c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T03n0187_003:0555c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王之太子相好莊嚴，於一切世間天人之中，色相光明道德名稱悉皆殊勝。",
        "translation": "The king's prince has a beautiful and ornate appearance, and among all the gods and humans of the world, his appearance and brightness and moral character are all outstanding.",
        "source": "T03n0187_003:0555c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T03n0187_003:0555c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩，決定當得阿耨多羅三藐三菩提。』",
        "translation": "Thus, a bodhisattva is certain to attain supreme perfect enlightenment.'",
        "source": "T03n0187_003:0555c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "'So it is, monks!",
        "source": "T03n0187_003:0555c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩醯首羅與淨居天子，設大供養，宣說菩薩定得作佛，還歸本處。」",
        "translation": "Mahêśvara and the Pure Land gods made a great offering, proclaiming that the bodhisattva would surely become a buddha and return to his original place.\"",
        "source": "T03n0187_003:0555c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「菩薩初生滿七日已，摩耶聖后，即便命終，生三十三天。",
        "translation": "The Buddha told the monks, \"After the bodhisattva's first seven days of life, the noble queen Māyā, even after his life ended, was born in the Trāyastriṃśa Heaven.",
        "source": "T03n0187_003:0555c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過七日已，菩薩還迦毘羅城，所有儀式莊嚴殊勝，倍過聖后，往龍毘尼園。",
        "translation": "After seven days had passed, the bodhisattva returned to Kapilavastu with all the rituals adorned and distinguished, surpassing those of the noble queen, and went to Nāgârjuna's Vineyard.",
        "source": "T03n0187_003:0555c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "百千拘胝有五百千天女，皆捧寶缾盛以香水；五百千婇女，持孔雀羽扇次第而行；五百千婇女，香水灑地導前而行；五百千天女，於前執篲掃地而行；五百千婇女，以種種瓔珞莊嚴其身次第而行；五百千天女，執寶花鬘次第而行；五百千婇女，持眾寶具次第而行；五百千婆羅門，執諸寶鈴詠吉祥音次第而行；二萬大象種種莊嚴次第而行，八萬寶車幢幡幰蓋莊嚴微妙翊從而行；四萬步兵悉被甲冑，皆操儀仗陪列而行；又有色界尊勝諸天，執持拘胝百千那由他寶幢幡蓋，於虛空中供養而行；又有欲界諸天，執持拘胝百千那由他寶幢幡蓋，於虛空中供養而行；又有欲界諸天，以種種天諸寶具，莊嚴菩薩之車，又有二萬諸天婇女，為菩薩御。",
        "translation": "百千拘胝有五百千天女，皆捧寶缾盛以香水；五百千婇女，持孔雀羽扇次第而行；五百千婇女，香水灑地導前而行；五百千天女，於前執篲掃地而行；五百千婇女，以種種瓔珞莊嚴其身次第而行；五百千天女，執寶花鬘次第而行；五百千婇女，持眾寶具次第而行；五百千婆羅門，執諸寶鈴詠吉祥音次第而行；二萬大象種種莊嚴次第而行，八萬寶車幢幡幰蓋莊嚴微妙翊從而行；四萬步兵悉被甲冑，皆操儀仗陪列而行；又有色界尊勝諸天，執持拘胝百千那由他寶幢幡蓋，於虛空中供養而行；又有欲界諸天，執持拘胝百千那由他寶幢幡蓋，於虛空中供養而行；又有欲界諸天，以種種天諸寶具，莊嚴菩薩之車，又有二萬諸天婇女，為菩薩御。",
        "source": "T03n0187_003:0555c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時人天婇女羅列而行。",
        "translation": "The gods and goddesses then paraded their maids in procession.",
        "source": "T03n0187_003:0556a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天無所嫌人無所羨，此由菩薩威神力故。」",
        "translation": "The gods had nothing to dislike, and people didn't envy them because of the bodhisattva's authoritative power.\"",
        "source": "T03n0187_003:0556a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「是時迦毘羅城五百釋種，各造宮殿合掌恭敬，稽首請輸檀王言：『善哉善哉！",
        "translation": "The Buddha told the monks, \"At the time, the five hundred Śākyas of Kapilavastu built their palaces, put their palms together in respect, bowed their heads, and invited King Śuddhodana to say, 'Good, good!'",
        "source": "T03n0187_003:0556a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切成利，願天中天幸我宮殿，願最上導師幸我宮殿，願歡喜悅樂者幸我宮殿，願好名稱幸我宮殿，願普遍眼幸我宮殿，願無等等幸我宮殿，願功德光明具相莊嚴者幸我宮殿。』",
        "translation": "When all these things are accomplished, may the god of gods honor my palace, may the most excellent guides honor my palace, may those who rejoice and are delighted honor my palace, may those who are well known honor my palace, may the universal eye honor my palace, may the peerless honor my palace, and may those whose attributes are brilliant and fully adorned honor my palace.'",
        "source": "T03n0187_003:0556a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是讚歎成利因緣故，名菩薩為薩婆悉達多。",
        "translation": "Because of this cause for praising Success, the bodhisattva was called *Sarvâstivāda*.",
        "source": "T03n0187_003:0556a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「於是輸檀王愍諸釋意，即將菩薩入諸釋宮，經於四月，方得周遍，然後乃將菩薩歸於自宮。",
        "translation": "\"Being sympathetic to the wishes of the Śākyas, King Śuddhodana sent the bodhisattva into the palaces of the Śākyas for four months before he could completely circumambulate them, and then he returned the bodhisattva to his own palace.",
        "source": "T03n0187_003:0556a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於自宮中有一大殿，名寶莊嚴。",
        "translation": "In his own palace there was a large hall called Jewel Adornment.",
        "source": "T03n0187_003:0556a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩居彼殿已，時輸檀王召諸親族長德耆年，凡預國姻皆悉來集，而告之言：『我子嬰孩早喪其母，乳哺之寄今當付誰？",
        "translation": "After the bodhisattva had stayed in that hall, King Śuddhodana summoned a group of his relatives, the eldest and most virtuous, and all the expected wives of the kingdom to assemble, and he told them, 'My son, a baby, lost his mother early in life, so who will he entrust with his nursing now?'",
        "source": "T03n0187_003:0556a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰能影護使得存活？",
        "translation": "Who can make the shadow protector survive?",
        "source": "T03n0187_003:0556a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰能慈心為我瞻視？",
        "translation": "Who will look out for me with compassion?",
        "source": "T03n0187_003:0556a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰能養育令漸長大？",
        "translation": "Who can nurture and make grow up?",
        "source": "T03n0187_003:0556a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰能憐撫如愛己子？』",
        "translation": "Who can take pity on a son as one loves him?'",
        "source": "T03n0187_003:0556a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有五百釋氏之婦，前白王言：『我能養育王之太子。』",
        "translation": "Five hundred Śākyamuni women then went before the king and said, 'I can raise the king's crown prince.'",
        "source": "T03n0187_003:0556a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸釋耆舊咸作是言：『汝等年少色盛心舉，不堪依時養育太子。",
        "translation": "The elders of the Śākyas all said, 'You're too young and prosperous to raise the prince when you're young and your hearts are full of energy.",
        "source": "T03n0187_003:0556b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩訶波闍波提，親則姨母有慈有惠，唯此一人堪能養育。』",
        "translation": "Mahāprajāpatī, your relative's aunt is kind and compassionate, and she's the only one who can raise him.'",
        "source": "T03n0187_003:0556b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸釋種皆共和合，請摩訶波闍波提為養育主。",
        "translation": "The Śākyas then all joined together and asked Mahāprajāpatī to be their nurturer.",
        "source": "T03n0187_003:0556b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時輸檀王躬抱菩薩，付於姨母而告之言：『善來夫人！",
        "translation": "King Śuddhodana then personally embraced the bodhisattva, handed him over to his aunt, and told him, 'Well done, madam!",
        "source": "T03n0187_003:0556b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當為其母。』",
        "translation": "He will be his mother.'",
        "source": "T03n0187_003:0556b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩訶波闍波提奉王勅已，命三十二養育之母，八母抱持、八母乳哺、八母洗浴、八母遊戲，養育菩薩。",
        "translation": "After the king commanded him, Mahāprajāpatī ordered thirty-two nurturing mothers, eight to carry, eight to breastfeed, eight to bathe, and eight to play, to nurture the bodhisattva.",
        "source": "T03n0187_003:0556b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如白月從初一日至十五日清淨圓滿，亦如尼拘陀樹植彼膏腴沃壤之地，漸漸增長。」",
        "translation": "It's like the white moon that's pure and full from the first day of the month until the fifteenth day, or the nyagrodha tree that's planted in a fertile soil that gradually grows.\"",
        "source": "T03n0187_003:0556b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「時輸檀王又與釋種共集議論：『我此太子為作轉輪聖王？",
        "translation": "The Buddha told the monks, \"King Śuddhodana then also gathered with the Śākya lineage to discuss, 'Did I make this prince a wheel-turning sage king?'",
        "source": "T03n0187_003:0556b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為當出家成佛道也？』",
        "translation": "Why should I leave home and become a buddha?'",
        "source": "T03n0187_003:0556b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有五通神仙名阿斯陀，與外族那羅童子，居雪山中，見菩薩生時有無量希奇之瑞，又聞虛空諸天讚言：『佛出於世。』",
        "translation": "It was then that a five-powered sage named Asita, who was staying with a boy from a foreign clan named Nārā, saw the birth of the bodhisattva accompanied by measureless wondrous appearances and heard the gods of the sky praise him, saying, 'The Buddha has appeared in the world.'",
        "source": "T03n0187_003:0556b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又見空中雨種種香花種種衣服，人天往來歡喜踊躍，即以天眼周遍觀察，見迦毘羅城輸檀王太子，福德光明照曜世間，成就三十二大人相。",
        "translation": "Seeing all kinds of fragrant flowers and various kinds of clothing raining down in the sky and people and gods coming and going rejoicing, he looked around with his divine eye and saw Prince Shodan, the king of Kapilavastu, whose fortune shone brightly in the world and who had accomplished thirty-two great human characteristics.",
        "source": "T03n0187_003:0556b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見此事已，告那羅童子言：『汝應當知！",
        "translation": "After he saw this, he told the boy Nāland, 'You should know this!",
        "source": "T03n0187_003:0556b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻浮提內迦毘羅城，輸檀王太子福德光明，普照十方世間之中，此為大寶，三十二相莊嚴其身。",
        "translation": "In the city of Kapila in Jambudvīpa, Prince Shodan's light of merit shines universally throughout the world in ten directions, and this is a great treasure that adorns his body with thirty-two marks.",
        "source": "T03n0187_003:0556b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若在家者，當為轉輪聖王王四天下，成就七寶具足千子，統領大地盡海邊際，以法御物，不假刀兵自然降伏；若出家者，當得成佛不由他悟，為天人師，名稱普聞利益一切。",
        "translation": "If someone at home is a renunciant, they will become a wheel-turning sage king who will rule the four worlds, complete with a thousand sons who possess seven treasures, command the earth to the limit of the ocean, and use the Dharma to subdue things naturally without relying on swords or armies; if they leave home, they will become a buddha who doesn't rely on others for awakening, a teacher of gods and humans, and whose name is heard universally to benefit all.",
        "source": "T03n0187_003:0556b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今與汝當往瞻禮。』",
        "translation": "Now, I and you will go there to pay our respects.'",
        "source": "T03n0187_003:0556b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時阿斯陀仙與那羅童子，猶如鴈王翔空而至，攝其神足步入王城，詣輸檀王宮立於門下，告守門者：『汝可入通，有阿斯陀來造於王。』",
        "translation": "\"The sage Asita and the boy Nārāyaṇa then arrived like a king flying through the sky, gathered their spiritual feet, stepped into the king's city, went to King Śuddhodana's palace, stood under the gate, and told the gatekeeper, 'You may enter and pass through, for there's Asita here to make the king.'",
        "source": "T03n0187_003:0556b28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時守門人往到王所，而白王言：『大王！",
        "translation": "The gatekeeper then went to the king and said to him, 'Great king!",
        "source": "T03n0187_003:0556c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "門有仙人名阿斯陀，願得親謁。』",
        "translation": "There's an immortal at the gate named Asita who begs to be taken in person.'",
        "source": "T03n0187_003:0556c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞是已，掃拭宮殿安施妙座，引仙人入。",
        "translation": "After hearing this, the king swept the palace, installed a marvelous seat, and invited the sage to enter.",
        "source": "T03n0187_003:0556c04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仙人既至呪願王言：『吉祥尊貴，願增壽命，以法為王。』",
        "translation": "When the sage arrived, he invoked the king's vow, saying, 'Good and honored, may your life increase, and may the Dharma be your king.'",
        "source": "T03n0187_003:0556c05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王於是時，以種種香花供養仙人，延其就座。",
        "translation": "The king then offered various flowers and incense to the sage and invited him to take his seat.",
        "source": "T03n0187_003:0556c06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仙人坐已，王言：『大仙！",
        "translation": "After the sage had sat down, the king said, 'Great sage!",
        "source": "T03n0187_003:0556c07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恒思頂禮未果所願，不審今者從何而至？』",
        "translation": "I've been thinking about paying homage to him, but I haven't yet fulfilled my vow; I wonder where he came from now?'",
        "source": "T03n0187_003:0556c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仙言：『大王！",
        "translation": "The sage said, 'Great king!",
        "source": "T03n0187_003:0556c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞有聖子，我欲見之，故來此耳。』",
        "translation": "I've heard that there's a noble son whom I want to meet, so I've come here.'",
        "source": "T03n0187_003:0556c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『我子適睡請待須臾。』",
        "translation": "The king said, 'My son is fit to sleep. Please wait a moment.'",
        "source": "T03n0187_003:0556c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仙言：『如是正士自性覺悟本無眠睡。』",
        "translation": "The sage said, 'Thus, the rightful man's own nature is awakened, and there's originally no drowsiness.'",
        "source": "T03n0187_003:0556c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘當知！",
        "translation": "\"You should know, monks!",
        "source": "T03n0187_003:0556c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩是時念仙人故，從睡而寤。",
        "translation": "The bodhisattva then woke up from his sleep because he was mindful of the sage.",
        "source": "T03n0187_003:0556c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王自抱持授與仙人，仙人跪捧周遍觀察，見菩薩身，具足相好超過梵王、釋提桓因、護世四王，光明照曜踰百千日。",
        "translation": "The king took his arms and gave it to the sage, who knelt down and held it up as he looked around and saw the bodhisattva's body, which was fully proportioned and beautiful, surpassing those of Brahmā, Śakra Devānām-Indra, and the four guardian kings, and whose radiance shone brightly beyond a hundred thousand suns.",
        "source": "T03n0187_003:0556c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既見是已，即起合掌恭敬頂禮，種種稱揚歎未曾有：『斯大丈夫出現於世。』",
        "translation": "Seeing this, he then rose, folded his palms, paid homage with respect, and praised him in various ways like never before, 'Such a great man has appeared in the world!'",
        "source": "T03n0187_003:0556c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "右遶三匝捧持菩薩，作是思惟：『今當有佛出興於世，自恨衰老不值如來，常處長夜恒迷正法。』",
        "translation": "Circling the bodhisattva three times to his right, he held him up and thought, 'Now there will be a Buddha who appears in the world, and I hate myself for not having been born to the Tathāgata in my old age, and for always being so long and so far gone that I'm constantly deluded about the right teaching.'",
        "source": "T03n0187_003:0556c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是悲啼懊惱歔欷哽咽。",
        "translation": "He then lamented and choked with sorrow and distress.",
        "source": "T03n0187_003:0556c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時輸檀王見阿斯陀仙如是哀感，不能自勝，王及姨母一切眷屬皆悉啼泣，白仙人言：『我子初生之時已召相師占問善否，皆大歡喜以為奇特。",
        "translation": "When King Śuddhodana saw how deeply saddened Asita was, he couldn't help himself, and the king and his aunt and all of their retinue wept and said to the sage, 'When my son was first born, I summoned a fortune teller to find out whether he was good or not, and they were all overjoyed and thought it was extraordinary.",
        "source": "T03n0187_003:0556c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今者大仙，悲淚如是，我等眷屬非無疑心，吉凶之事願為我說。』",
        "translation": "Now, great sage, with these tears of pity, it's not that our retinue doesn't have doubts; please explain the good and bad fortune for me.'",
        "source": "T03n0187_003:0556c22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿斯陀仙捫淚而言：『惟願大王勿懷憂慮。",
        "translation": "The sage Asita then spoke with tears in his eyes, 'Please, Your Majesty, don't be anxious.",
        "source": "T03n0187_003:0556c24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今哀歎無有異情，自傷年老死時將至，不聞正法不覩佛興。",
        "translation": "Now, I lament that there's no difference in my feelings, for I'm sad that old age and death are approaching and that I won't hear the right teaching or see the Buddha arise.",
        "source": "T03n0187_003:0556c25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王當知，無量眾生被煩惱火之所燒害，佛當能灑甘露法雨為滅除之；無量眾生行於邪見曠野之中，佛當能示涅槃清淨之道；無量眾生繫在煩惱牢獄，佛當能宥使得解脫；無量眾生閉於生死不能自出，佛當能與開方便門；無量眾生為煩惱箭之所中傷，佛當能拔令免斯苦。",
        "translation": "Great king, you should know that there are measureless sentient beings who are burned by the fires of affliction, and the Buddha will be able to sprinkle sweet dharma rain to extinguish them; measureless sentient beings who walk in the wilderness of wrong views, and the Buddha will be able to show them the pure path to nirvāṇa; measureless sentient beings who are bound in the prison of affliction, and the Buddha will be able to forgive and free them; measureless sentient beings who are shut off from birth and death and can't escape on their own, and the Buddha will be able to open the door of skillful means; measureless sentient beings who are wounded by the arrows of affliction, and the Buddha will be able to pull them out and spare them from such suffering.",
        "source": "T03n0187_003:0556c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T03n0187_003:0557a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如優曇花時時一現，諸佛如來出興於世亦復如是。",
        "translation": "Just as the udumbara flower appears once in a while, so too do all the buddha-tathāgatas appear in the world.",
        "source": "T03n0187_003:0557a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今所恨不見此時，自惟失祐是故悲耳。",
        "translation": "What I hate now is that I don't see this time, and I pity myself because I think I've lost my blessing.",
        "source": "T03n0187_003:0557a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T03n0187_003:0557a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人值佛坐菩提座，降伏魔怨轉于法輪，當知是人必獲勝果。",
        "translation": "If a person meets a Buddha sitting on the throne of enlightenment and subdues Māra's enemies while turning the wheel of the Dharma, they should know that person will surely attain a superior result.",
        "source": "T03n0187_003:0557a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T03n0187_003:0557a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃有無量眾生，值佛出世奉持正教，得阿羅漢。",
        "translation": "It's because there are measureless sentient beings who come into the world when the Buddha appears, uphold the correct teaching, and attain arhatship.",
        "source": "T03n0187_003:0557a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我恨彼時不預斯事，是故悲耳。",
        "translation": "I hate that they didn't anticipate this event, which is why I'm so sad.",
        "source": "T03n0187_003:0557a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great King!",
        "source": "T03n0187_003:0557a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如韋陀論中所記，王之太子必定不作轉輪聖王。",
        "translation": "As recorded in the Vedas, a king's crown prince must not become a wheel-turning sage king.",
        "source": "T03n0187_003:0557a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T03n0187_003:0557a11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十二大人相極明了故。』",
        "translation": "The thirty-two marks of a great personage are perfectly clear.'",
        "source": "T03n0187_003:0557a12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王言：『何等名為三十二相？』",
        "translation": "\"The king said, 'What's called the thirty-two marks?'",
        "source": "T03n0187_003:0557a12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仙言：『三十二相者：一者、頂有肉髻。",
        "translation": "The recluse said, 'The thirty-two marks are: 1. A topknot of flesh.",
        "source": "T03n0187_003:0557a13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者、螺髮右旋其色青紺。",
        "translation": "Two, his conch hair is swept to the right and his color is blue and violet.",
        "source": "T03n0187_003:0557a14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者、額廣平正。",
        "translation": "Three, his forehead is broad and flat.",
        "source": "T03n0187_003:0557a14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者、眉間毫相白如珂雪。",
        "translation": "Four, the tuft of hair between his eyebrows is as white as snow.",
        "source": "T03n0187_003:0557a15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者、睫如牛王。",
        "translation": "5. His eyelashes are like the eyebrows of a bull.",
        "source": "T03n0187_003:0557a15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六者、目紺青色。",
        "translation": "6. His eyes are deep blue in color.",
        "source": "T03n0187_003:0557a16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七者、有四十齒齊而光潔。",
        "translation": "Seven, he has forty teeth that are even and polished.",
        "source": "T03n0187_003:0557a16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八者、齒密而不踈。",
        "translation": "Eight, his teeth are close together, but not crowded.",
        "source": "T03n0187_003:0557a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九者、齒白如軍圖花。",
        "translation": "Nine, his teeth are white like an army fig tree.",
        "source": "T03n0187_003:0557a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十者、梵音聲。",
        "translation": "Ten, it's the sound of the Brahman.",
        "source": "T03n0187_003:0557a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十一、味中得上味。",
        "translation": "11. He has a superior taste among flavors.",
        "source": "T03n0187_003:0557a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十二、舌軟薄。",
        "translation": "12. A soft, thin tongue.",
        "source": "T03n0187_003:0557a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十三、頰如師子。",
        "translation": "13. Their cheeks are like a lion's.",
        "source": "T03n0187_003:0557a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十四、兩肩圓滿。",
        "translation": "Fourteen. His shoulders are rounded.",
        "source": "T03n0187_003:0557a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十五、身量七肘。",
        "translation": "Fifteen. His body measures seven elbows.",
        "source": "T03n0187_003:0557a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十六、前分如師子王臆。",
        "translation": "Sixteen: His front part is like the lion king's imagination.",
        "source": "T03n0187_003:0557a19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十七、四牙皎白。",
        "translation": "17. His four teeth are bright and white.",
        "source": "T03n0187_003:0557a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十八、膚體柔軟細滑紫磨金色。",
        "translation": "18. His skin is soft and fine, purple-polish gold in color.",
        "source": "T03n0187_003:0557a20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十九、身體正直。",
        "translation": "19. His body is upright.",
        "source": "T03n0187_003:0557a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十、垂手過膝。",
        "translation": "20. His hands hang down past his knees.",
        "source": "T03n0187_003:0557a21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十一、身分圓滿如尼拘陀樹。",
        "translation": "21. His body is rounded like the nyagrodha tree.",
        "source": "T03n0187_003:0557a22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十二、一一毛孔皆生一毛。",
        "translation": "Twenty-two: Each pore produces a single hair.",
        "source": "T03n0187_003:0557a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十三、身毛右旋上靡。",
        "translation": "Twenty-three: His body hair swirls upward to the right.",
        "source": "T03n0187_003:0557a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十四、陰藏隱密。",
        "translation": "24. His pubic area is hidden.",
        "source": "T03n0187_003:0557a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十五、髀傭長。",
        "translation": "25. His thighs are long and servant-like.",
        "source": "T03n0187_003:0557a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十六、腨如伊尼鹿王。",
        "translation": "26. Their sternums are like those of a deer king.",
        "source": "T03n0187_003:0557a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十七、足跟圓正足指纖長。",
        "translation": "27. His heels are round and square, and his toes are long and slender.",
        "source": "T03n0187_003:0557a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十八、足趺隆起。",
        "translation": "28. His feet are elevated at the level of his feet.",
        "source": "T03n0187_003:0557a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十九、手足柔軟細滑。",
        "translation": "29. His hands and feet are soft and smooth.",
        "source": "T03n0187_003:0557a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十、手足指皆網鞔。",
        "translation": "30. His hands and feet are webbed with nails.",
        "source": "T03n0187_003:0557a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十一、手足掌中各有輪相轂輞圓備，千輻具足光明照耀。",
        "translation": "31. In the palms of their hands and feet, there are wheels, hubs, and rings, and a thousand spokes are perfectly proportioned to shine brightly.",
        "source": "T03n0187_003:0557a27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十二、足下平正周遍案地。",
        "translation": "32. Their feet are level and square, and they are placed squarely on the ground.",
        "source": "T03n0187_003:0557a28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T03n0187_003:0557a29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王之聖子具此三十二大人之相，分明顯著，如是之相唯諸佛有，非輪王有。",
        "translation": "The king's noble son has these thirty-two major marks of a great personage, which are clearly and distinctly attributable to the buddhas alone and not to the wheel-turning king.",
        "source": "T03n0187_003:0557a29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王聖子！",
        "translation": "Great, noble son of the king!",
        "source": "T03n0187_003:0557b02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有八十種好，不合在家作轉輪王，必當出家得成佛道。』",
        "translation": "Again, there are 80 good qualities that prevent a person from being a wheel-turning king at home and allow them to leave home and achieve the Buddha Way.'",
        "source": "T03n0187_003:0557b02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王言：『大仙！",
        "translation": "\"The king said, 'Great sage!",
        "source": "T03n0187_003:0557b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者名為八十種好？』",
        "translation": "What are the eighty kinds of goodness?'",
        "source": "T03n0187_003:0557b04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仙言：『八十種好者：一者、手足指甲皆悉高起。",
        "translation": "The sage says, 'Eighty beautiful features: one, the nails on their hands and feet are all raised.",
        "source": "T03n0187_003:0557b04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者、指甲如赤銅。",
        "translation": "Two, their nails are like red copper.",
        "source": "T03n0187_003:0557b05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者、指甲潤澤。",
        "translation": "Third, their fingernails are moistened.",
        "source": "T03n0187_003:0557b06_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者、手文潤澤。",
        "translation": "Fourth, the writing on his hands is moistened.",
        "source": "T03n0187_003:0557b06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者、手文理深。",
        "translation": "Five, the writing on his hands is deep in principle.",
        "source": "T03n0187_003:0557b07_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六者、手文分明顯著。",
        "translation": "Six, the writing on his hands is distinct and prominent.",
        "source": "T03n0187_003:0557b07_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七者、手文端細。",
        "translation": "Seven, the writing on the hands is finely detailed.",
        "source": "T03n0187_003:0557b07_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八者、手足不曲。",
        "translation": "Eight, the hands and feet aren't bent.",
        "source": "T03n0187_003:0557b08_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九者、手指纖長。",
        "translation": "Nine, his fingers are long and slender.",
        "source": "T03n0187_003:0557b08_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十者、手指圓滿。",
        "translation": "Ten, the fingers are full.",
        "source": "T03n0187_003:0557b08_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十一者、手指端漸細。",
        "translation": "11. The tips of the fingers are gradually slimmed down.",
        "source": "T03n0187_003:0557b09_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十二、手指不曲。",
        "translation": "12. His fingers aren't bent.",
        "source": "T03n0187_003:0557b09_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十三、筋脈不露。",
        "translation": "13. The tendons and veins aren't exposed.",
        "source": "T03n0187_003:0557b10_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十四、踝不現。",
        "translation": "Fourteen: His ankles aren't visible.",
        "source": "T03n0187_003:0557b10_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十五、足下平。",
        "translation": "15. The bottom of the feet are level.",
        "source": "T03n0187_003:0557b10_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十六、足跟圓正。",
        "translation": "16. The heels are perfectly square.",
        "source": "T03n0187_003:0557b11_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十七、脣色赤好如頻婆果。",
        "translation": "17. His lips are red and beautiful like the fruit of the vibhāga.",
        "source": "T03n0187_003:0557b11_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十八、聲不麁獷。",
        "translation": "18. His voice isn't coarse.",
        "source": "T03n0187_003:0557b12_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十九、舌柔軟色如赤銅。",
        "translation": "19. His tongue is flexible and colored like red copper.",
        "source": "T03n0187_003:0557b12_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十、聲如雷音清暢和雅。",
        "translation": "20. His voice is like the sound of thunder, clear, and elegant.",
        "source": "T03n0187_003:0557b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十一、諸根具足。",
        "translation": "21. His faculties are fully developed.",
        "source": "T03n0187_003:0557b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十二、臂纖長。",
        "translation": "22. His arms are long and slender.",
        "source": "T03n0187_003:0557b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十三、身清淨嚴好。",
        "translation": "23. His body is pure and beautiful.",
        "source": "T03n0187_003:0557b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十四、身體柔軟。",
        "translation": "24. His body is supple and flexible.",
        "source": "T03n0187_003:0557b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十五、身體平正。",
        "translation": "25. His body is even and correct.",
        "source": "T03n0187_003:0557b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十六、身無缺減。",
        "translation": "26. There's no deficiency in his body.",
        "source": "T03n0187_003:0557b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十七、身漸纖直。",
        "translation": "27. His body gradually slims and straightens.",
        "source": "T03n0187_003:0557b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十八、身不動搖。",
        "translation": "28. His body doesn't budge.",
        "source": "T03n0187_003:0557b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十九、身分相稱。",
        "translation": "29. Their bodies are proportionate.",
        "source": "T03n0187_003:0557b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十、膝輪圓滿。",
        "translation": "30. His knees are full.",
        "source": "T03n0187_003:0557b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十一、身輕妙。",
        "translation": "31. His body is light and marvelous.",
        "source": "T03n0187_003:0557b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十二、身有光明。",
        "translation": "32. His body has radiance.",
        "source": "T03n0187_003:0557b18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十三、身無斜曲。",
        "translation": "33. His body isn't twisted.",
        "source": "T03n0187_003:0557b18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十四、臍深。",
        "translation": "34. His navel is deep.",
        "source": "T03n0187_003:0557b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十五、臍不偏。",
        "translation": "35. His navel isn't twisted.",
        "source": "T03n0187_003:0557b19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十六、齊稱位。",
        "translation": "36. They're correctly positioned.",
        "source": "T03n0187_003:0557b19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十七、齊清淨。",
        "translation": "37. They're equally pure.",
        "source": "T03n0187_003:0557b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十八、身端嚴。",
        "translation": "38. His body is dignified.",
        "source": "T03n0187_003:0557b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十九、身極淨遍發光明破諸冥瞑。",
        "translation": "39. His body is perfectly pure, and he completely emits light that refutes darkness and confusion.",
        "source": "T03n0187_003:0557b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四十者、行如象王。",
        "translation": "40. He walks like an elephant king.",
        "source": "T03n0187_003:0557b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四十一、遊步如師子王。",
        "translation": "41. He travels like a lion king.",
        "source": "T03n0187_003:0557b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四十二、行如牛王。",
        "translation": "42. He walks like the king of cattle.",
        "source": "T03n0187_003:0557b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四十三、行如鵝王。",
        "translation": "43. walks like a king of geese.",
        "source": "T03n0187_003:0557b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四十四、行順右。",
        "translation": "Forty-four, his movements are like the right side.",
        "source": "T03n0187_003:0557b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四十五、腹圓滿。",
        "translation": "45. His belly is rounded.",
        "source": "T03n0187_003:0557b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四十六、腹妙好。",
        "translation": "Forty-six, his belly is marvelous.",
        "source": "T03n0187_003:0557b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四十七、腹不偏曲。",
        "translation": "47. His belly isn't twisted.",
        "source": "T03n0187_003:0557b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四十八、腹相不現。",
        "translation": "48. The shape of his belly doesn't appear.",
        "source": "T03n0187_003:0557b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四十九、身無黑子。",
        "translation": "49. His body has no black children.",
        "source": "T03n0187_003:0557b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五十者、牙圓正。",
        "translation": "50. His teeth are perfectly proportioned.",
        "source": "T03n0187_003:0557b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五十一、齒白齊密。",
        "translation": "51. His teeth are white and closely spaced.",
        "source": "T03n0187_003:0557b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五十二、四牙均等。",
        "translation": "52. His four teeth are evenly spaced.",
        "source": "T03n0187_003:0557b26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五十三、鼻高修直。",
        "translation": "53. His nose is high and straight.",
        "source": "T03n0187_003:0557b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五十四、兩目明淨。",
        "translation": "54. Both eyes are clear and bright.",
        "source": "T03n0187_003:0557b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五十五、目無垢穢。",
        "translation": "55. Their eyes are unsullied.",
        "source": "T03n0187_003:0557b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五十六、目美妙。",
        "translation": "56. His eyes are beautiful.",
        "source": "T03n0187_003:0557b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五十七、目脩廣。",
        "translation": "57. His eyes are smooth and wide.",
        "source": "T03n0187_003:0557b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五十八、目端正。",
        "translation": "58. Their eyes are straight.",
        "source": "T03n0187_003:0557b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五十九、目如青蓮。",
        "translation": "59. Their eyes are like blue lotuses.",
        "source": "T03n0187_003:0557b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六十者、眉纖而長。",
        "translation": "60. Their eyebrows are slender and long.",
        "source": "T03n0187_003:0557b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六十一、見者皆生喜。",
        "translation": "61. Everyone who sees it is delighted.",
        "source": "T03n0187_003:0557c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六十二、眉色青紺。",
        "translation": "Sixty-two: His eyebrows are blue and violet.",
        "source": "T03n0187_003:0557c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六十三、眉端漸細。",
        "translation": "63. The ends of his eyebrows are gradually slimmed.",
        "source": "T03n0187_003:0557c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六十四、兩眉頭微相接連。",
        "translation": "64. The two eyebrows are slightly connected.",
        "source": "T03n0187_003:0557c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六十五、頰相平滿。",
        "translation": "65. Their cheeks are flat and full.",
        "source": "T03n0187_003:0557c03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六十六、頰無缺減。",
        "translation": "66. There's no deficiency in the cheeks.",
        "source": "T03n0187_003:0557c03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六十七、頰無過惡。",
        "translation": "67. There's nothing wrong with his cheeks.",
        "source": "T03n0187_003:0557c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六十八、身不缺減無所譏嫌。",
        "translation": "68. The body isn't lacking or minus, and there's nothing to criticize.",
        "source": "T03n0187_003:0557c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六十九、諸根寂然。",
        "translation": "69. The faculties are tranquil.",
        "source": "T03n0187_003:0557c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七十者、眉間毫相光白鮮潔。",
        "translation": "Seventy: The tuft of hair between his eyebrows is shiny, white, and pure.",
        "source": "T03n0187_003:0557c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七十一、額廣平正。",
        "translation": "71. His forehead is broad and level.",
        "source": "T03n0187_003:0557c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七十二、頭頂圓滿。",
        "translation": "72. The crown of his head is full.",
        "source": "T03n0187_003:0557c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七十三、髮美黑。",
        "translation": "73. His hair is beautiful and black.",
        "source": "T03n0187_003:0557c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七十四、髮細軟。",
        "translation": "74. His hair is fine and soft.",
        "source": "T03n0187_003:0557c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七十五、髮不亂。",
        "translation": "75. Their hair isn't disheveled.",
        "source": "T03n0187_003:0557c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七十六、髮香潔。",
        "translation": "76. His hair is fragrant and clean.",
        "source": "T03n0187_003:0557c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七十七、髮潤澤。",
        "translation": "His hair is moistened.",
        "source": "T03n0187_003:0557c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七十八、髮有五卍字。",
        "translation": "78. His hair has the five swastikas.",
        "source": "T03n0187_003:0557c08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七十九、髮彩螺旋。",
        "translation": "79. His hair is colored like a spiral.",
        "source": "T03n0187_003:0557c09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八十者、髮有難陀越多吉輪魚相。",
        "translation": "Eighty, his hair has the shape of a fish with the colorful wheel of Nandopāntika.",
        "source": "T03n0187_003:0557c09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T03n0187_003:0557c10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是聖子八十種好，若人成就如是八十種好，不應在家，必當出家得阿耨多羅三藐三菩提。』",
        "translation": "These are the noble son's eighty attributes; if a person has accomplished these eighty attributes, they shouldn't stay home but will leave home and attain supreme perfect enlightenment.'",
        "source": "T03n0187_003:0557c10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時輸檀王聞阿斯陀仙如是語已，身心泰然歡喜踊躍，從座而起頂禮菩薩，而說偈言：「『汝為帝釋諸天人，　　一切恭敬稽首禮，　　及為一切諸神仙，　　皆來恭敬而尊重，　　為諸世間之塔廟，　　故我頂禮自在王。』",
        "translation": "\"After hearing this from Asita, King Śuddhodana was overcome with joy and happiness in body and spirit, rose from his seat, paid homage to the bodhisattva, and spoke in verse, saying, \"You are the gods and humans of Indra who venerate and bow down to him, and all the gods and sages who come to venerate and respect him as a stūpa in the world, so I pay homage to the Ācārya King.\"",
        "source": "T03n0187_003:0557c12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "\"Monks!",
        "source": "T03n0187_003:0557c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "輸檀王為阿斯陀仙及那羅童子，施設種種飲食上妙衣服，右遶頂禮。",
        "translation": "King Śuddhodana gave the sage Ashtā and the boy Nārā various kinds of food and drink, fine clothing, and bowed his head to his right.",
        "source": "T03n0187_003:0557c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿斯陀仙撫那羅童子左肩，乘虛而去。",
        "translation": "Then the sage Asita touched the boy Nārā on his left shoulder and rode away in the sky.",
        "source": "T03n0187_003:0557c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時仙人語童子言：『不久有佛出興於世，汝當往詣求請出家，於長夜中得大利益。』」",
        "translation": "The sage then said to the boy, 'Soon there will be a Buddha appearing in the world, so you should go there and ask him to leave home and obtain great benefit in the long night.'\"",
        "source": "T03n0187_003:0557c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "方廣大莊嚴經卷第三",
        "translation": "Fangguang zhuangyan jing, vol. 3",
        "source": "T03n0187_003:0557c23_0",
        "is_bad_quality": false
    }
]