[
    {
        "source_sentence": "佛本行集經卷第三十七",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Volume 37",
        "source": "T03n0190_037:0824a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隋天竺三藏闍那崛多譯",
        "translation": "Sui Tianzhu Tripiṭaka Jñānagupta Translation",
        "source": "T03n0190_037:0824a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "富樓那出家品第四十",
        "translation": "Pūrṇa's renunciant class XL",
        "source": "T03n0190_037:0824a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時憍薩羅聚落，去迦毘羅婆蘇都城邑其間不遠，有一村陌，彼村有一大婆羅門，為淨飯王作於國師，其家巨富，多饒財寶，乃至屋宅，猶如北方毘沙門天宮殿無異。",
        "translation": "\"At the time, there was a village not far from the town of Kapilavastu in the village of Kauśāla, and there was a great brāhmaṇa who was the state tutor for King Jīvaka and whose family was very wealthy and had a great deal of wealth and treasure, right down to a house that was like the palace of Vaiśravaṇa in the north.",
        "source": "T03n0190_037:0824a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼婆羅門，有於一子，名富樓那彌多羅尼子(隋言滿足慈者)，極大端正，可喜少雙，為諸眾人之所樂覩。",
        "translation": "That brāhmaṇa had a son named Pūrṇa Maitrāyaniputra (Sui term for one who satisfies kindness) who was extremely large and correct, delightful and few in number, and a delightful sight to behold for all people.",
        "source": "T03n0190_037:0824a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "巧智聰慧，細意細心，能誦一切韋陀論徹，既自解已，復能教他。",
        "translation": "He was skilled, intelligent, careful, and attentive, and could recite all the Vedas' treatises thoroughly, and after understanding them himself, he could also teach them to others.",
        "source": "T03n0190_037:0824a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具解三種韋陀舊解尼乾陀論，[口*祁]輈婆論，解破字論，又能宣說往昔諸事五明之論，一句半句，一偈半偈，皆能分別，亦復通解受記之論，於世辯中，悉皆具解六十種事，有大人相。",
        "translation": "He fully understands the three kinds of Vedas, the Nirgrantha-śāstra, the [*mouth*qi]utpala-śāstra, and the Sanskrit-śāstra, and he can expound the five luminous treatises on past events, discerning a sentence and a half sentence or a verse and a half verse, and also fully understands the treatises on taking assurance, comprehending all 60 kinds of worldly discourse and having the characteristics of a great man.",
        "source": "T03n0190_037:0824a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「淨飯大王悉達太子當生之日，其彌多羅尼子亦共同時而生。",
        "translation": "\"On the day that Prince Siddhârtha of Jīvaka was born, his son Maitreyaṇī was born at the same time.",
        "source": "T03n0190_037:0824a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人本性，厭離世間，志求解脫，於煩惱中，恒有驚怖，心常寂定。",
        "translation": "By nature, that person is disillusioned with the world, aspires to be liberated, is constantly frightened by afflictions, and has a mind that's always calm and collected.",
        "source": "T03n0190_037:0824a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往昔已曾見諸佛來，彼諸佛邊，種諸善根，作多福業，薰習其心，志涅槃門，不樂煩惱。",
        "translation": "He has seen buddhas come in the past, planted good roots there, created lots of meritorious actions, cultivated his mind, aspired to the gate of nirvāṇa, and didn't enjoy afflictions.",
        "source": "T03n0190_037:0824a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切有諸生死內，皆悉遠離，已作於行，諸纏壞爛，取因為力，至成熟地，到聖法故。",
        "translation": "They all parted with all existent birth and death, did their practices, destroyed their bonds, took the cause as strength, and reached the stage of maturation, where they arrived at the noble teaching.",
        "source": "T03n0190_037:0824a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時富樓那，獨坐思惟：『我父既為輸頭檀王而作國師，須多經營，備多種技，處王法中，代王斷事。",
        "translation": "Pūrṇa then sat alone and thought, 'Since my father was king Śuddhodana and became the king's mentor, he had to do a lot of work, prepare a lot of skills, and sit in the king's Dharma to end things for him.'",
        "source": "T03n0190_037:0824a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復其兒悉達太子，決定與彼輸頭檀王一種無異，應當必作轉輪聖王。",
        "translation": "Furthermore, his son, Prince Siddhârtha, is certainly not different from that King Śuddhodana in any way, and he will surely become a wheel-turning sage king.",
        "source": "T03n0190_037:0824b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我父若無，我身決定與彼悉達轉輪聖王而作國師。",
        "translation": "If my father didn't have one, then I myself would surely become a national teacher with that Wheel-Turning Sage King Siddhârtha.",
        "source": "T03n0190_037:0824b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我父既為小王國師，今以如是無暫閑時，況復欲作轉輪聖王大國之師，普於國內，辨事有閑，終無是處。",
        "translation": "Since my father was a teacher of a small kingdom, how could he want to be the turn-turning sage king's teacher of a large country when there's no momentary lull in his life like this?",
        "source": "T03n0190_037:0824b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今預前，當作何事？",
        "translation": "Now, what should I do in advance?",
        "source": "T03n0190_037:0824b08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當作何計？",
        "translation": "What should we do?",
        "source": "T03n0190_037:0824b08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今唯有捨家出家。』",
        "translation": "Now, I have no choice but to renounce my home and leave home.'",
        "source": "T03n0190_037:0824b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時富樓那如是念已，當菩薩夜出家之時，夜半默然，不諮父母，共其朋友，足三十人，從家而出，逕往至於波梨婆遮迦法之中，請乞出家，居在雪山，苦行求道。",
        "translation": "\"After Pūrṇa thus thought, when the bodhisattva left home at night, he remained silent at midnight, didn't consult his parents, and went with thirty of his friends, left home, went straight to Parivrājaka, asked to leave home, stayed on a snowy mountain, and ascetically pursued the path.",
        "source": "T03n0190_037:0824b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等諸人，勇猛精進，不暫休息，其三十人，一時成就，獲得四禪并及五通。",
        "translation": "Those thirty people made bold and diligent efforts without taking a moment's rest, and they all attained the four meditation heavens and the five supernormal powers at once.",
        "source": "T03n0190_037:0824b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時富樓那苦行仙人，自思惟言：『我今應可內自觀察悉達太子受聖王位時節至未？』",
        "translation": "\"Then Pūrṇa, an ascetic, thought to himself, 'Now, can I observe for myself whether I've noticed the arrival of Prince Atapa at the rank of sage king?'",
        "source": "T03n0190_037:0824b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而富樓那以天眼觀，覩見世尊在波羅[木*奈]鹿野苑中，證得無上阿耨多羅三藐三菩提，已轉無上微妙法輪，為諸天人分別說法。",
        "translation": "With the divine eye, Pūrṇa saw the Bhagavān in the Deer Preserve of Paranirmita-[muna*na], realizing unsurpassed perfect enlightenment, turning the unsurpassed subtle wheel of the Dharma, and discerning Dharma discourses for gods and humans.",
        "source": "T03n0190_037:0824b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見已即至諸朋友邊而告之言：『汝等今可生歡喜心作大踊躍，今彼悉達大聖太子出家，已證無上菩提，證菩提已，已轉無上清淨法輪。",
        "translation": "Seeing this, he went to his friends and told them, 'Now, you may rejoice and make a great commotion, for that great sage prince Siddhârtha left home, realized unsurpassed bodhi, and having realized bodhi, has turned the unsurpassed pure wheel of the Dharma.",
        "source": "T03n0190_037:0824b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊今日，現在於彼波羅[木*奈]城鹿野苑內，為諸天人說法開示，汝等今可共我相隨至於彼邊行於梵行。』",
        "translation": "Today, the Bhagavān is speaking to the gods and instructing them in the Deer Preserve of Pola [Munai], so you may accompany me to that place and carry out the religious practice.'",
        "source": "T03n0190_037:0824b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，彼等諸朋友輩，歡喜報言：『仁語善也，我等順從。』",
        "translation": "Those friends then rejoiced and reported, 'That's good, sir, and we'll obey you.'",
        "source": "T03n0190_037:0824b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，富樓那苦行仙人，舉身即共三十朋友，從雪山下，飛昇而行猶如鴈王騰於虛空，至波羅[木*奈]鹿野苑下，往詣佛邊。",
        "translation": "\"Then, Pūrṇa, an ascetic sage, lifted himself up and together with 30 of his friends flew down from the snow-capped mountains, ascended and traveled like a king soaring through the sky to the Deer Preserve at Paranirmita-[muna], and went to visit the Buddha.",
        "source": "T03n0190_037:0824b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到佛所已，頂禮佛足，以兩手執世尊之足摩挲頂戴，舉頭以口嗚如來足，起在佛前胡跪，以偈讚歎佛言：「『昔在兜率陀天上，　　正念化作白象形，　　託身欲入摩耶胎，　　來至釋種家作子。",
        "translation": "When they arrived, they bowed their heads at the Buddha's feet, put their hands on the Bhagavān's feet, rubbed their heads together, saluted the Tathāgata's feet with their mouths, got up, knelt down in front of the Buddha, and praised him in verse, saying, 'Once upon a time in Tuṣita Heaven, right mindfulness transformed me into the form of a white elephant, entrusted myself with the desire to enter the Māya womb, and came to be a son in the family of the Śākyas.",
        "source": "T03n0190_037:0824c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如妙蓮花不著水，　　在於母胎不污身，　　彼母受樂無量歡，　　不貪五慾唯樂法。",
        "translation": "Like a wonderful lotus flower that doesn't cling to water, it remains in its mother's womb undefiled, and that mother experiences immeasurable joy and doesn't crave the five desires but only enjoys the Dharma.",
        "source": "T03n0190_037:0824c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　唯行善行捨諸惡，　　觀尊在胎如鑄金，　　歡喜踊躍不知厭，　　看不知足更復覩。",
        "translation": "Doing only good actions and abandoning bad ones, she observes the honored one in the womb like cast gold, rejoices and rises up without tire, and sees again without feeling satisfied.",
        "source": "T03n0190_037:0824c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　尊在胎內常說法，　　諸天人起慈悲心，　　皆悉歡喜飲法膏。",
        "translation": "While in the womb, the Bhagavān always explains the teaching, and the gods and humans become compassionate and rejoice as they drink the ointment of the Dharma.",
        "source": "T03n0190_037:0824c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　世尊初生發妙語，　　我脫眾生生死苦，　　右脇出已七步行，　　無畏猶如師子王，　　我是如來終滅苦。",
        "translation": "The Bhagavān first arises and speaks wonderfully, 'I liberate sentient beings from the suffering of birth and death.' Seven steps after emerging from his right hypochondrium, he's fearless like a lion king, and I'm the Tathāgata who finally ends suffering.",
        "source": "T03n0190_037:0824c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　世尊初生浴池水，　　水不冷煖彌岸平，　　浴訖塗香莊嚴身，　　空中自然蓋拂現，　　世間希有見此事，　　是故我等頂禮尊。』",
        "translation": "The Bhagavān first arises and bathes in the water of a pond, the water isn't cold, the shore is flat, and after bathing, he adorns his body with fragrance, and a natural covering appears in the sky.",
        "source": "T03n0190_037:0824c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「說是偈已，富樓那等若干仙人，舉聲從佛，乞求出家，如是白言：『唯願世尊！",
        "translation": "\"After speaking this verse, Pūrṇa and a number of other sages raised their voices and begged the Buddha to leave home, saying, 'Please, Bhagavān!'",
        "source": "T03n0190_037:0824c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "哀愍我等！",
        "translation": "Have compassion on us!",
        "source": "T03n0190_037:0824c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等心願，欲得出家，慈悲怜故，度脫我等。』",
        "translation": "We have a heartfelt desire to leave home, so have compassion for us and save us.'",
        "source": "T03n0190_037:0824c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，佛告富樓那言：『汝富樓那！",
        "translation": "\"At that point, the Buddha addressed Pūrṇa, saying, 'You, Pūrṇa!",
        "source": "T03n0190_037:0824c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今可速起，當隨汝意，我與汝等，從心所願。』",
        "translation": "Now, you may quickly arise and do as you wish; I will join you in following your heart's desire.'",
        "source": "T03n0190_037:0824c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時富樓那得如來聽其出家已，乞受具足，及其朋友二十九人。",
        "translation": "After the Tathāgata Pūrṇa heard that they had left home, he asked to be fully ordained and asked twenty-nine of his friends to join him.",
        "source": "T03n0190_037:0824c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼長老輩，既得出家受具戒竟，未久之間，各各用心，獨臥獨行，獨坐獨立，勇猛精進，行坐空閑阿蘭若處，各各別行用心謹慎，不曾放逸，恒住空閑，時節不久。",
        "translation": "After they had left home and received the full set of precepts, the elders, for a short time, each paid attention, lay alone, walked alone, sat alone and independent, exerted themselves, walked and sat in a quiet forest, were careful in their individual ways, didn't get careless, and stayed in a quiet forest for a long time.",
        "source": "T03n0190_037:0824c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子，求大利故，正心正信，捨家出家，為欲求於無上梵行，已盡慾邊，見諸法相，欲修諸通，即證彼法，已斷諸生，得梵行報，所作已訖，不受後有。",
        "translation": "If good sons, seeking great rewards, have right hearts and right beliefs, leave home and leave home because they want to pursue the unsurpassed religious practice, have ended the limits of desire, see the characteristics of dharmas, want to cultivate their abilities, realize those dharmas, have ended births, and attained the rewards of the religious practice, having accomplished what they've done, they won't be subject to a later existence.",
        "source": "T03n0190_037:0824c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等一切，諸長老輩，既證知已，悉成羅漢，以心善得一切解脫，皆成大德，一切皆悉能作大事，利益眾生。",
        "translation": "All of them, the elders, having realized it, have become arhats, have well attained all kinds of liberation with their minds, and have become greatly virtuous, all capable of doing great things to benefit sentient beings.",
        "source": "T03n0190_037:0825a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊告諸比丘，作如是言：『汝等當知！",
        "translation": "\"At the time, the Bhagavān addressed the monks and said, \"You should know this!",
        "source": "T03n0190_037:0825a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說法人中最第一者，即此富樓那彌多羅尼子是也。』",
        "translation": "The one who teaches that this is the greatest of legal practitioners is this Pūrṇa Maitrāyaniputra.'",
        "source": "T03n0190_037:0825a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而有偈說：「『世尊在於波羅[木*奈]，　　微妙語告諸眾言，　　此是滿足真比丘，　　說法人中最第一。』",
        "translation": "And there was a verse that said, \"The Bhagavān was in Bālā [muni*na] and spoke subtly to the crowd, saying, 'This is the true monk who fulfills, and he's the best among people who preach.'",
        "source": "T03n0190_037:0825a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世間一切合成九十一阿羅漢，謂佛世尊，并五比丘，長老耶輸陀，及耶輸陀波羅[木*奈]國同時所生有四朋友最勝長者，勝中復勝諸善男子，謂毘摩羅、善臂、滿足并及牛主；又耶輸陀，在家估客，行賈商人，五十朋友；次善男子長老富樓那彌多羅尼子，并及知舊二十九人。",
        "translation": "\"At the time, all the people in the world were united into 91 arhats, namely, the Bhagavān, five monks, the elder Yaśodhar, and four friends born at the same time in Yaśodhar's country of Pola [munai], the most excellent elders and, above all, the good men, namely, Vimala, Good Arm, Satisfaction, and the cowherd; Yaśodhar, a householder, a merchant, and 50 friends; the next best man, the elder Pūrṇa Maitrāyaniputra, and 29 others who knew the past.",
        "source": "T03n0190_037:0825a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛本行集經那羅陀出家品第四十一上「爾時，閻浮南天竺地有一國土，名阿槃提，彼國土中有一聚落，名獼猴食。",
        "translation": "It was then that there was a land called Avanti in the southern India region of Jambudvīpa, and within that land there was a colony called Monkey's Food.",
        "source": "T03n0190_037:0825a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其聚落內，有一巨富婆羅門，姓大迦旃延，其家多有資財珍寶，奴婢六畜，穀麥豆麻，屋宅園林，種種豐足，乃至如彼毘沙門宮，無有殊異。",
        "translation": "Inside that village was a wealthy brāhmaṇa named Kātyāyana whose household was full of provisions and treasures, servants, six animals, grain, beans, and flax, and a house and its grounds were abundant in every way, up to the level of that Vaiśravaṇa's palace, which was no different.",
        "source": "T03n0190_037:0825a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼婆羅門，聰明智慧，讀誦受持三韋陀論，博通諸物，一事十名[口*祁]輈婆等，文句字論，往昔過去，一切諸事，五明之論，知句半句，分別世間諸受記論，及六十種大丈夫相，皆悉具足讀誦通知，與嚴熾王作國大師。",
        "translation": "That brāhmaṇa, intelligent and wise, recites and memorizes the Treatise on the Three Vedas, is well-versed in all things, including the ten [mouth*qi]-named [koṭī]-buddhas, phrases, words, treatises, all past and past events, the five luminous treatises, the knowledgeable phrases and half phrases, the grammar that discerns the world, and the 60 characteristics of great men, all of which he fully recites and communicates to King Yenchak as the country's great teacher.",
        "source": "T03n0190_037:0825a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼國師大婆羅門，第一長子，辭家遊歷他國學問，不知厭足，處處尋師，具解諸論，技成就已，還歸本家。",
        "translation": "That great brāhmaṇa, the eldest son of the national teacher, had left home and traveled to other countries to train, but he wasn't satisfied and sought out teachers everywhere to fully understand the treatises.",
        "source": "T03n0190_037:0825a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既奉見父，即諮白言：『善哉阿爺！",
        "translation": "After he met his father, he consulted him and said, 'Good, Grandfather!",
        "source": "T03n0190_037:0825a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今學問種種通達，為我聚集一切大眾，我欲誦出韋陀論等及諸技能。』",
        "translation": "Now, I've learned and comprehended all kinds of things, so gather all the people for me, and I want to recite the Vedas and other skills.'",
        "source": "T03n0190_037:0825b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父聞歡喜，即為集眾。",
        "translation": "Rejoicing at what he heard, his father gathered the crowd.",
        "source": "T03n0190_037:0825b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兒見人集，即在眾前，所誦一切韋陀論等及諸技能，皆不隱藏，悉並誦出。",
        "translation": "Seeing the gathering, the son went before the crowd and recited all the Vedas and other skills that had been recited, without concealing them, and recited them all together.",
        "source": "T03n0190_037:0825b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼大眾，即便共尊彼國師子，推為上座，其父即將種種珍寶，而供養之。",
        "translation": "That crowd then collectively honored that country's lion as the highest seat, and his father placed various treasures in his honor.",
        "source": "T03n0190_037:0825b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時彼國師大婆羅門，復更別有第二之子，名那羅陀(隋言不叫)，其父告彼第二子言：『汝那羅陀！",
        "translation": "\"Then that great brāhmaṇa, the national teacher, had a second son named Nārāditya (Sui term for not shouting), and his father told the second son, 'Nārāditya!",
        "source": "T03n0190_037:0825b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今可捨家出至他國，受學誦習韋陀諸論，令如汝兄。』",
        "translation": "Now, you can leave home and go to another country to study and recite the Vedas' treatises, so that you'll be like your brother.'",
        "source": "T03n0190_037:0825b09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而那羅陀童子之兄，當誦一切韋陀論時，其那羅陀一聞即便一切受持。",
        "translation": "When the older brother of the boy Nārāditya recited all the Vedas' treatises, the moment he heard them, Nārāditya accepted them all.",
        "source": "T03n0190_037:0825b10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時那羅陀聞此語已，即白父言：『善哉阿爺！",
        "translation": "After hearing this, Nārāditya said to his father, 'Good, Grandpa!",
        "source": "T03n0190_037:0825b12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已通解一切韋陀及呪術等，阿爺今可為我，聚集一切大眾，我於眾前，誦諸韋陀及以技能。』",
        "translation": "'I've learned all the Vedas and spells, so now, Grandfather, gather all the people for me, and I'll recite them and their skills in front of them.'",
        "source": "T03n0190_037:0825b13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其父聞子如是語已，心生希有！",
        "translation": "After his father heard his son say this, his heart grew faint with hope!",
        "source": "T03n0190_037:0825b15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即集大眾，集大眾已，諸種安置。",
        "translation": "He then assembled the crowd, and after assembling the crowd, he placed them in various ways.",
        "source": "T03n0190_037:0825b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時那羅陀在大眾前，誦諸韋陀一切論等。",
        "translation": "In front of the crowd, Nārada recited the Vedas' Complete Discourse and so forth.",
        "source": "T03n0190_037:0825b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大眾，聞已各各心生歡喜，讚歎彼言：『善哉善哉！",
        "translation": "After hearing this, the whole crowd rejoiced in their hearts and praised him, saying, 'Good, good!'",
        "source": "T03n0190_037:0825b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大智童子！",
        "translation": "Boy of great wisdom!",
        "source": "T03n0190_037:0825b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "快能誦習諸韋陀論。』",
        "translation": "He could quickly recite and study the Vedas' treatises.'",
        "source": "T03n0190_037:0825b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其父復將種種財寶，以用供養。",
        "translation": "His father then gave him various treasures to offer as offerings.",
        "source": "T03n0190_037:0825b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，長兄聞弟誦通一切諸論，心生苦惱，作如是念：『我無量年遊歷諸國，學習種種所誦呪論，心慮煩勞，方始誦持諸呪術得。",
        "translation": "\"When the elder brother heard that his younger brother had recited all the treatises, he became distressed and had this thought, 'I've traveled to various countries for measureless years, studying various recitations of the treatises and becoming mentally troubled before I was able to recite and uphold the techniques of the treatises.",
        "source": "T03n0190_037:0825b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其那羅陀，云何聞已，皆少時間，受持淨遍？",
        "translation": "Nārāditya, after hearing them, how could they have spent so little time accepting and upholding them?'",
        "source": "T03n0190_037:0825b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而其少年，尚得如是，若後成長，必定應當作王國師。",
        "translation": "Even as a young boy, he could still do this; if he grows up later, he'll surely be a teacher in the kingdom.",
        "source": "T03n0190_037:0825b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣，我須方便除滅其體，如是則我得成大利；若不然者，終奪我位。』",
        "translation": "For this reason, I must skillfully extinguish his essence; otherwise, I'll attain great rewards; otherwise, I'll be deprived of my position.'",
        "source": "T03n0190_037:0825b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，其父知自長子內心，如是於那羅陀私生惡念，既覺知已，作是思惟：『我此小兒，聰慧可憐，勿令為兄之所奪命。』",
        "translation": "\"At the time, his father knew that his eldest son had secretly given rise to bad thoughts in his mind about Nārāditya, and having realized it, he thought, 'My youngest son is intelligent and pitiful; don't let him be taken from me by his brother's life.'",
        "source": "T03n0190_037:0825b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，『應須方便莫令其知。』",
        "translation": "After that thought, he said, 'It's necessary to make it easier for him not to know about it.'",
        "source": "T03n0190_037:0825c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時南方有一城，名優禪耶尼，去城不遠，有頻陀山，其山中有一老仙人，名阿私陀，在中居住。",
        "translation": "\"At the time, there was a city in the south named Ujjayinī that was not far from the city, and there was Mount Vindhu, in which an old sage named Ashita lived.",
        "source": "T03n0190_037:0825c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼仙洞解一切韋陀并及諸論，以得四禪，具五神通。",
        "translation": "He had an excellent understanding of all the Vedas and the treatises and had attained the four meditation heavens and possessed the five supernormal powers.",
        "source": "T03n0190_037:0825c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是那羅陀童子外舅。",
        "translation": "He was the maternal uncle of the boy Nārāditya.",
        "source": "T03n0190_037:0825c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時國師大婆羅門并及其婦，即將其子那羅陀身往彼山中，對共付囑阿私陀仙，以為弟子。",
        "translation": "The national teacher, the great Brāhmaṇa, and his wife sent their son Nārādapāla to that mountain and entrusted the sage Ashitaka with the task of becoming their disciple.",
        "source": "T03n0190_037:0825c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其阿私陀既受領得那羅陀已，教詔顯示，不久成就，獲得四禪、具五神通。",
        "translation": "After he received Narada, his teaching revealed that he would soon attain the four meditation heavens and possess the five supernormal powers.",
        "source": "T03n0190_037:0825c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，梵志阿私陀仙，將其弟子那羅陀身，即出山向波羅[木*奈]城，即於城外，造立草庵，在中居住。",
        "translation": "\"At the time, the ascetic Ashita, a priest, took his disciple Nārādana and left the mountain for the city of Pārāḍa [munai], where he built a hermitage outside the city and stayed there.",
        "source": "T03n0190_037:0825c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "晝夜六時，作如是教，大聲唱言：『善哉善哉！",
        "translation": "During the six hours of the day and night, he gave this teaching and called out with a loud voice, 'Good, good!",
        "source": "T03n0190_037:0825c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝那羅陀，佛今出世(如是三稱)。",
        "translation": "'You, Narada, now that the Buddha has appeared in the world (thus three terms), you should shave your head and leave home, cultivate the religious practice, and will greatly benefit yourself and greatly attain happiness for a long time to come.",
        "source": "T03n0190_037:0825c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝應彼邊，剃落出家，修行梵行，必當長夜大得利益，大得快樂，自利身已復應利他。』",
        "translation": "You should go there, shave your head, leave home, and cultivate the religious practice; you will surely attain great benefit and happiness in the long run, and after benefiting yourself, you should also benefit others.'",
        "source": "T03n0190_037:0825c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼老阿私陀仙作如是語，教其弟子那羅陀已，不經多時而取命終。",
        "translation": "\"It wasn't long after he taught his disciple Nārāditya to say this, that the old sage Ashitaka took his life and died.",
        "source": "T03n0190_037:0825c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿私陀仙命終之後，時彼梵志私陀仙人所有世間利養名聞，悉是弟子那羅陀得。",
        "translation": "After he had reached the end of his life, that priest Sītā became the disciple of Nārāditya, who had all the worldly benefits and fame that he was renowned for.",
        "source": "T03n0190_037:0825c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時那羅陀以世利養名聞多故，貪戀著心，無有正念，更不作想求覓勝上，不信有佛有法有僧。",
        "translation": "Because he had so much worldly profit and fame, Nārāditya became addicted, had no right mindfulness, and didn't even think about seeking superiority, not believing in the Buddha, Dharma, or Saṃgha.",
        "source": "T03n0190_037:0825c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，海內伊羅鉢龍(隋言藿香葉)王，既受龍身，心生厭離，欲求解脫，不樂於彼穢濁惡想，而作是念：『往昔世尊迦葉如來、多陀阿伽度、阿羅呵、三藐三佛陀，親授我記：「汝大龍王！",
        "translation": "\"At the time, the dragon king of Erapah (Sui word for Huo Xiangye) in the ocean, having accepted the dragon body, became disillusioned with it, wanted to be liberated, didn't enjoy those defiled and bad thoughts, and thought, 'In the past, the Bhagavān Kāśyapa Tathāgata, Tathāgata Agastya, Arhat, and Samyak-saṃbuddha personally gave me this record, 'You great dragon king!'",
        "source": "T03n0190_037:0825c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今已去，過若干年，若干百年，若干千年，若干百千年，若干百千萬億年，當有一佛出現於世，號釋迦牟尼多陀阿伽度、阿羅呵、三藐三佛陀。」",
        "translation": "From now on, after many years, hundreds of years, thousands of years, hundreds of thousands of years, and hundreds of thousands of millions of years, there will appear in the world a Buddha called Śākyamuni, the Tathāgata, the Ālāha, and the Samyak-saṃbuddha.\"",
        "source": "T03n0190_037:0825c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而今已過如是無量無邊億數百千萬年，叵有彼佛釋迦如來出世以不？』",
        "translation": "Now, after all these measureless, limitless, hundreds of millions of years, will there ever be another Buddha, the Śākyamuni Tathāgata, who appears in the world?\"",
        "source": "T03n0190_037:0826a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，復更有一龍王，名曰商佉(隋言螺)，彼龍王宮，常有無量龍眾聚會。",
        "translation": "\"At the time, there was another dragon king named Shōkha (Sui word for conch), and at his palace there were always measureless crowds of dragons assembled.",
        "source": "T03n0190_037:0826a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼會處，多諸龍王百千雲集，伊羅鉢龍亦在彼宮。",
        "translation": "At that meeting place, hundreds of thousands of dragon kings gather, and the dragon Airāvaṇa is also present in his palace.",
        "source": "T03n0190_037:0826a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，有一夜叉之王，名曰金齊，與伊羅鉢龍王善友，亦在彼龍眾會中坐。",
        "translation": "At the time, there was a king of the yakṣas named Kanakazu who was good friends with the dragon king Airāvaṇa and was sitting in that congregation of dragons.",
        "source": "T03n0190_037:0826a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，伊羅鉢龍王即於眾中，告夜叉王作如是言：『仁者！",
        "translation": "\"At the time, the dragon king of Airāvaṇa addressed the king of the yakṣas and said, 'Sir!",
        "source": "T03n0190_037:0826a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今頗知世間釋迦如來、多陀阿伽度、阿羅呵、三藐三佛陀出現世未？』",
        "translation": "Now, do you know whether the Śākyamuni Tathāgata, the Tathāgata Aggata, the Ālāha, or the Samyak-saṃbuddha of the world have appeared in the world?\"",
        "source": "T03n0190_037:0826a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時夜叉報龍王言：『大善龍王！",
        "translation": "The yakṣas then reported to the dragon king, saying, 'Great, good dragon king!",
        "source": "T03n0190_037:0826a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我實不知釋迦如來出現已未？",
        "translation": "I really don't know whether the Tathāgata has appeared yet.",
        "source": "T03n0190_037:0826a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖然，龍王！",
        "translation": "Though, Dragon King!",
        "source": "T03n0190_037:0826a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但我今知，彼曠野中有於一城，其城本是夜叉宮殿，名阿羅迦槃陀(隋言壙野宮殿)，彼城先來有二偈文，而彼偈云：「若無有佛出現世間，終無人能讀此偈者；設復有讀，亦不能解此之偈意。",
        "translation": "But I now know that there's a city in the wilderness that used to be a yakṣa palace called Araka-vandana (which is the Sui term for the palace of Śākyamuni), and there used to be two verses in that city that said, \"If no Buddha were to appear in the world, no one would ever be able to read this verse; even if they did, they wouldn't be able to understand the meaning of this verse.",
        "source": "T03n0190_037:0826a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若當有佛出現世時，即得讀知，無人解義，唯有如來、多陀阿伽度、阿羅呵、三藐三佛陀，能說此義，或有從佛聞而得解。」』",
        "translation": "If there were a Buddha who appeared in the world, it would be possible to read it and know that no one understands its meaning but the Tathāgata, the Tathāgata Aggata, the Ālāha, and the Samyak-saṃbuddha, who can explain its meaning or who can understand it after hearing it from a Buddha.\"",
        "source": "T03n0190_037:0826a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，伊羅鉢龍告彼夜叉王如是言：『仁者！",
        "translation": "\"It was then that Elāpattra addressed the king of the yakṣas, saying, 'Sir!",
        "source": "T03n0190_037:0826a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今可往至彼讀取彼偈得來以不？』",
        "translation": "Now, can you go there and read that verse and get it to come?'",
        "source": "T03n0190_037:0826a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時金齊夜叉之王，從伊羅鉢龍王邊受如是言已，即便往至彼阿羅迦槃陀宮殿，受讀彼偈，得已速疾還向伊羅鉢龍王邊。",
        "translation": "After he had received these words from the side of Dragon King Airāvaṇa, the king of the Golden Teeth went straight to his palace at Arakapāṇḍa, read the verse, and quickly returned to Dragon King Airāvaṇa after he had obtained it.",
        "source": "T03n0190_037:0826a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到已即白伊羅鉢言：『大善龍王！",
        "translation": "When he arrived, he said to Airāvaṇa, 'Great, good dragon king!",
        "source": "T03n0190_037:0826a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今日應當心生歡喜。",
        "translation": "Today, your heart should rejoice.",
        "source": "T03n0190_037:0826a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0190_037:0826a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋迦牟尼多陀阿伽度、阿羅呵、三藐三佛陀大聖如來，今已出世。",
        "translation": "Śākyamuni, the Tathāgata, Ālāha, and Samyak-saṃbuddha, the great sage Tathāgata, has now appeared in the world.",
        "source": "T03n0190_037:0826a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以得知？",
        "translation": "How can I know that?",
        "source": "T03n0190_037:0826a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂能令我得讀彼偈，我已受持彼偈將來，若有人能解此偈意復能宣說，即應當知此是真佛。』",
        "translation": "He then enabled me to read that verse, and once I've accepted it for the future, if someone can understand its meaning and then explain it, they should know that this is the true Buddha.'",
        "source": "T03n0190_037:0826a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，伊羅鉢龍王心大歡喜，踊躍遍身，不能自勝，即從金齊夜叉王邊受取彼偈。",
        "translation": "\"At the time, the dragon king Airāvaṇa was so elated that he leaped all over his body, unable to control himself, and accepted that verse from the side of the king of the golden-hued yakṣas.",
        "source": "T03n0190_037:0826b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，商佉龍王有女，名曰常分，端正可喜，最上花色，眾人所愛，世無有雙。",
        "translation": "It was then that the dragon king Shankara had a daughter named Jōshōshin, a pleasant, upright, and most beautiful flower, which was loved by many and had no equal in the world.",
        "source": "T03n0190_037:0826b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，彼會諸龍王等作如是念：『我今應當至月八日、十四、十五，或二十三及二十九并三十日，將好金器滿盛銀粟，於銀器內滿盛金粟，將此龍女，莊飾其體，以妙種種瓔珞嚴身，從此龍宮出，置於彼恒河岸上，著於露地，說此二偈，以示眾人。",
        "translation": "\"The assembled dragon kings then had this thought, 'Now, on the eighth, fourteenth, fifteenth, twenty-third, twenty-ninth, and thirtieth day of the month, I will fill a good gold vessel with silver corn and a silver vessel with gold corn, adorn the body of this dragon lady, adorn her with a marvelous array of jewelry, and exit this dragon palace, place her on the bank of the Ganges River, put her on bare ground, and recite these two verses to show the people.",
        "source": "T03n0190_037:0826b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『在於何自在，　　染著名為染，　　彼云何清淨？",
        "translation": "\"'In what way is it self-possessed, defiled or not, and how is it purified?'",
        "source": "T03n0190_037:0826b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何得癡名？",
        "translation": "How do we get the name of delusion?",
        "source": "T03n0190_037:0826b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　癡人何故迷？",
        "translation": "Why is a foolish man confused?",
        "source": "T03n0190_037:0826b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何名智人？",
        "translation": "What is the name of a person of wisdom?",
        "source": "T03n0190_037:0826b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　何會別離已，　　名曰盡因緣。』",
        "translation": "'What is called the end of causes and conditions after separation from the assembly?'",
        "source": "T03n0190_037:0826b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，彼龍王說此偈已，遍告一切諸世間言：『若有能解誦此偈者，我等即當以此金銀盛滿粟等，并及龍女，持用布施，即取彼人，作於佛想。",
        "translation": "\"After he spoke this verse, that dragon king addressed the whole world, saying, 'If there's anyone who can recite this verse, we will fill this gold and silver with millet and other things, and we'll give it to them along with their nymphs as a donation.",
        "source": "T03n0190_037:0826b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若當有人傳從他聞來為我說，亦然布施。』",
        "translation": "If someone were to transmit it from someone else who hears it and speaks it for me, they would likewise make an offering.'",
        "source": "T03n0190_037:0826b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時商佉王及伊羅鉢諸龍王等，欲見世尊，渴仰世尊，思遲世尊，恒以白月黑月八日、十四、十五，將好金器滿盛銀粟，於銀器內復盛金粟，及彼龍女種種嚴身，將至恒河岸上，安置住於陸地。",
        "translation": "Desiring to see the Bhagavān, longing for him, and longing to see him, King Shōkha and the dragon-kings of Airāva always filled a good gold vessel with silver millet and another silver vessel with gold millet on the eighth, fourteenth, and fifteenth days of the white and black moons, and they brought their dragon maidens, adorned in various ways, to the bank of the Ganges River and placed them on dry land.",
        "source": "T03n0190_037:0826b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼二龍王相與而說此二偈言：『在於何自在，乃至盡因緣。』",
        "translation": "Those two dragon kings spoke these two verses together, saying, 'In what way is it self-possessed, even up to the end of the causes and conditions?'",
        "source": "T03n0190_037:0826b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是言：『若有人能解此偈義，我等將此二器金銀，并及端正可憙龍女，以用布施。』",
        "translation": "Again, they said, 'If someone can understand the meaning of this verse, we'll give these two vessels of gold and silver and these pretty, jolly dragon-girls as alms.'",
        "source": "T03n0190_037:0826b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼龍王說於此事，聲聞八方，所有山林，或復在水，或在陸地，或婆羅門，或復長者，各相謂言：『白月黑月，恒以六日，彼二龍王從水而出，將於二器，盛金銀粟，及一龍女，瓔珞嚴身，從恒河出，在岸某方陸地住立，說此二偈：「『「在於何自在，乃至盡因緣。」",
        "translation": "When that dragon king told them this, the voices of the people in the eight directions and in all the mountains and forests, whether in water or on land, or of Brahmans or elders, each said, 'For six days at a time, the white moon and the black moon, those two dragon kings emerge from the water and bring two vessels filled with gold and silver, and a dragon girl with a bejeweled body, and they emerge from the Ganges River, stand on the shore somewhere on land, and say these two verses, '\"In what way is it self-possessed, even up to the end of the causes and conditions?\"'",
        "source": "T03n0190_037:0826b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作如是語：「若有人能讀解此偈，我等將此二器及女而布施。」』",
        "translation": "They said, 'If anyone can read and understand this verse, we'll give these two vessels and women as alms.'",
        "source": "T03n0190_037:0826c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時，婆羅門及長者等，從二龍王聞如是語，悉從八方競來集會彼龍王處，各自唱言：『我能讀解此之二偈。』",
        "translation": "Then, when the Brāhmaṇas and elders from the two dragon kings heard these words, they all rallied from eight directions and gathered at the dragon king's place, each saying, 'I can read and understand these two verses.'",
        "source": "T03n0190_037:0826c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及至龍邊，讀偈不得，又不解義。",
        "translation": "When they arrived at the dragons' side, they couldn't read the verses, and they didn't understand their meaning.",
        "source": "T03n0190_037:0826c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或復有人讀此偈已，反還問彼二龍王言：『此偈何也？』",
        "translation": "Another person who reads this verse asks the two dragon kings, 'What's this verse about?'",
        "source": "T03n0190_037:0826c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復問此偈其義云何？",
        "translation": "\"Again, what is the meaning of this verse?",
        "source": "T03n0190_037:0826c09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，那羅陀童子仙人，居止在於摩伽陀國，為諸人民而作導師，彼國男女，尊重供承讚歎歌詠那羅陀仙，各相謂言：『此摩那婆，自既知已，復教他知，自既見已，復教他見。』",
        "translation": "\"When the sage Narada the Younger stayed in the country of Magadha and became a mentor to the people, the men and women of that country respected, offered support, praised, and sang songs to the sage Narada, each saying, 'That Manabha, having known himself, he also taught others to know, and having seen himself, he also taught others to see.'",
        "source": "T03n0190_037:0826c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時，彼國摩伽陀內所有人民，作如是念：『此那羅陀仙聖童子，既自知見，教他知見，我等於彼二龍王邊，聞斯二偈，無人能誦，無人能答，我等今可至那羅陀童子仙邊，到已應說如此之事。』",
        "translation": "Then, all the people of Magadha in that country thought, 'Since this noble boy Narada knows and teaches others to know and see, we here at the border of those two dragon kings heard these two verses, but no one could recite them and no one could answer them; now, we can go to the boy Narada and tell him such a thing when we arrive.'",
        "source": "T03n0190_037:0826c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，摩伽陀國諸婆羅門及長者等，即便往至那羅陀仙童子之所，到已詳共白那羅陀童子仙言：『仁若知時，恒河岸上有二龍王，一名商佉，二名伊羅鉢，常以白月黑月六日，從恒河水出於陸地，將金銀器，盛粟及女，乃至誰能解此偈義，即施與彼說此二偈，偈云：「在於何自在，乃至盡因緣。」』",
        "translation": "After thinking this, the brāhmaṇas and elders of Magadha went to the sage boy Narada and when they arrived, they shared with him in detail, saying, 'If you know that there are two dragon kings on the bank of the Ganges River, one named Shankara and the other named Airāva, who always leave the Ganges River on the sixth day of a white or black moon and emerge from its waters on land with gold and silver vessels full of millet and women, or whoever understands the meaning of this verse, then they will give them this verse, which says, 'In what is it self-possessed, up to the end of its causes and conditions?'",
        "source": "T03n0190_037:0826c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，那羅陀仙人童子作是思惟：『我今既為此摩伽陀國內人民作於尊師，此之人民皆供養我，尊重承事欽仰於我，又復謂我自知見已，轉能教他。",
        "translation": "\"It was then that the sage boy from Narada thought, 'Now, since I've been a venerable teacher for the people of this Magadha country, they all make offerings to me, respect and serve me, and look up to me, and also say that after knowing and seeing for myself, I'll be able to teach others.",
        "source": "T03n0190_037:0826c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今若於是人民前，言我不解此二偈義，此之人民，即毀辱我，一切利養名聞闕少，我皆失之。』",
        "translation": "If I were to tell these people now that I don't understand the meaning of these two verses, these people would disparage me, and I'd lose all the benefits and fame I've heard that are lacking.'",
        "source": "T03n0190_037:0826c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，即便告彼摩伽陀國諸婆羅門大長者等，作如是言：『我共汝等！",
        "translation": "After that thought, he even addressed the great elders of the Brāhmaṇas in Magadha and said, 'I, together with you!",
        "source": "T03n0190_037:0827a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一時往詣二龍王邊，請說二偈，尋取其義。』",
        "translation": "One time, he went to the two dragon kings and asked them to explain two verses to grasp their meaning.'",
        "source": "T03n0190_037:0827a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時童子那羅陀仙，共摩伽陀長者人民婆羅門等，左右圍遶，推那羅陀童子仙人最為上首，向二龍邊。",
        "translation": "\"It was then that the boy sage Narada, together with the eldest Magadha man and the people of Brāhmaṇa, surrounded them from left to right and pushed the boy sage Narada to be the leader as they headed toward the two dragons.",
        "source": "T03n0190_037:0827a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到已告言：『二大龍王！",
        "translation": "When he arrived, he told them, 'Two great dragon kings!",
        "source": "T03n0190_037:0827a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願為我等說於二偈，我得聞已，思惟取義。』",
        "translation": "Please explain these two verses for us, and after I hear them, I'll consider and grasp their meaning.'",
        "source": "T03n0190_037:0827a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，商佉二龍王等，即為彼仙，說二偈云：『在於何自在，乃至盡因緣。』",
        "translation": "At that point, the two dragon kings of Shangha were there, and they spoke two verses for the sage, saying, 'In what is it that I'm at ease, up to the end of my causes and conditions?'",
        "source": "T03n0190_037:0827a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，童子那羅陀仙告彼二龍，作如是言：『我今於汝二龍王邊，受此二偈，從今已去，過七日外，當來汝邊答報偈意。』",
        "translation": "\"The boy Narada then addressed the two dragons and said, 'Now, I've accepted these two verses from you, two dragon kings, and I will come to you seven days from now to answer their questions.'",
        "source": "T03n0190_037:0827a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼二龍白那羅陀童子仙言：『如仁者教，作如是事。』",
        "translation": "The two dragons then said to the boy Narada, the sage, 'As you, sir, have taught, do this.'",
        "source": "T03n0190_037:0827a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，那羅陀從二龍王受得偈已，還向本處。",
        "translation": "\"After he received the verse from the two dragon kings, Nārāditya returned to his original place.",
        "source": "T03n0190_037:0827a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時摩伽陀一切人民，憍薩羅國一切人民，及鳩留國、般遮羅國諸人民等，傳聞童子那羅陀仙，從商佉龍并伊羅鉢二龍王邊，受持二偈，謂言從今去出七日，還來到此說二偈義。",
        "translation": "It was then that all the people of Magadha, all the people of Kauśālaka, and the people of Kuru and Pancala heard that the boy Narādhāra had accepted two verses from the two dragon kings, Siṃkara and Airāvaṇa, saying, 'Now, after seven days' absence, I'll come back here and explain the meaning of those two verses.'",
        "source": "T03n0190_037:0827a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼人民，駕諸雜乘，所謂象車馬車牛車，及步人等，相與雲集。",
        "translation": "Those people then gathered in droves with various vehicles, such as elephant carts, horse chariots, ox carts, and foot soldiers.",
        "source": "T03n0190_037:0827a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，恒河此彼兩岸，有於八萬四千眾類，閦然集聚，皆共欲聽那羅陀仙及二龍王解說偈時。",
        "translation": "\"At the time, 84,000 people from both sides of the Ganges River gathered here and there, all wanting to hear the sage Nārādika and the two dragon kings expound the meaning of the verse.",
        "source": "T03n0190_037:0827a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時波羅[木*奈]居住在城，有諸六師，各自稱言：『我是尊者。』",
        "translation": "At the time, there were six masters of Bālā [munai] living in the city, each of whom said, 'I am the venerable one.'",
        "source": "T03n0190_037:0827a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂富蘭迦葉、摩薩迦梨瞿奢梨迦、阿耆多祁奢迦摩羅、波羅浮多迦遮耶那、刪闍夷毘羅師誰富多羅、尼乾他若祁富多羅等。",
        "translation": "They were Pūraṇa-kāśyapa, Maśākrīghoṣa, Ajita-kṛṣṇa-mālā, Pāṭaliputra-kātyāyanā, Sañjayī-vairaśaila-who-putra, and Nirgrantha-kṛṣṇa-putra.",
        "source": "T03n0190_037:0827a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，那羅陀童子仙人，即便向彼諸六師邊，欲問偈義，到已即問此二偈意。",
        "translation": "\"The boy sage Narada then went over to those six teachers, wanting to ask them about the meaning of the verse, and when he arrived, he asked them about the meaning of these two verses.",
        "source": "T03n0190_037:0827a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼六師，既不能解此偈義意，更復增上，於仙人邊起瞋恚心，還反問於那羅陀仙，作如是言：『此之二偈，有何意也。』",
        "translation": "Since those six teachers couldn't understand the meaning of the verse, they became even more aggressive, became angry with the sage, and asked the sage Narada back, saying, 'What's the meaning of these two verses?'",
        "source": "T03n0190_037:0827b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊初證正覺，居住在彼波羅[木*奈]城鹿野苑內舊仙人林。",
        "translation": "\"At the time, the Bhagavān had first realized perfect enlightenment and was staying at the old sage's grove in the Deer Preserve of Pola [Munai].",
        "source": "T03n0190_037:0827b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時那羅陀童子仙人，自心如是思惟念言：『此沙門在波羅[木*奈]城鹿苑舊仙所居林內，我今可向彼邊借問此二偈意。』",
        "translation": "The young sage Narada then reflected on this in his own mind and thought, 'This ascetic lives in the forest of the old sages in the Deer Preserve of Pola [Munai], so now I can borrow these two verses from that side and ask what they mean.'",
        "source": "T03n0190_037:0827b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復重思惟：『自餘沙門，及婆羅門耆年大德，堪為一切國王作師，久來出家，所謂富蘭迦葉，乃至尼乾陀若祁富多羅等，我至彼邊，問此二偈，猶不能解，況復如此年少沙門，生來未久，出家始爾。",
        "translation": "Again, he thought, 'Some other ascetics or great elder Brahmans who could serve as mentors to the kings of various countries and who have left home for a long time, such as Pūraṇa-kāśyapa or Nirgrantha-jñāniputra, would still not be able to understand these two verses when I went there and asked about them, so why would such a young ascetic, who was born not long ago and has just left home, not be able to understand them?'",
        "source": "T03n0190_037:0827b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我問於此二偈之意，彼詎能答？』",
        "translation": "How could he answer my question about the meaning of these two verses?'",
        "source": "T03n0190_037:0827b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更復思惟：『年少沙門，或婆羅門，不可輙輕。",
        "translation": "\"Again, he thought, 'A young ascetic or brāhmaṇa should not be recklessly disrespected.",
        "source": "T03n0190_037:0827b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0190_037:0827b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或彼年少沙門之人，或婆羅門，亦有聰明快智慧者，我今但可往詣於彼大沙門邊，問此偈義。』",
        "translation": "Perhaps there's a young ascetic or a Brāhmaṇa who's intelligent and quick to wisdom, but now I can simply go to that great ascetic and ask him about the meaning of this verse.'",
        "source": "T03n0190_037:0827b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，童子那羅陀仙即詣佛邊，到佛所已，共佛相瞻，慰喻面款，種種善言，巧語談話訖已，即便却一面坐。",
        "translation": "\"At that point, the boy Narada went to the Buddha, and when he arrived, he looked at the Buddha with him, spoke kindly and lovingly to him, and finished talking with him in a variety of ways before sitting to one side.",
        "source": "T03n0190_037:0827b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其那羅陀摩那婆仙一面坐已，即白佛言：『大德尊者！",
        "translation": "After he had sat down at one side, he said to the Buddha, 'Venerable Ārya!",
        "source": "T03n0190_037:0827b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門瞿曇！",
        "translation": "Śramaṇa Gautama!",
        "source": "T03n0190_037:0827b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我欲諮問尊者一義，未審尊者，許我以不？』",
        "translation": "I would like to ask the venerable about an object, but I have not yet been given permission by the venerable.",
        "source": "T03n0190_037:0827b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時佛告摩那婆言：『汝摩那婆！",
        "translation": "It was then that the Buddha addressed Manabha, saying, 'You Manabha!",
        "source": "T03n0190_037:0827b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨所有問，我當為解。』",
        "translation": "I'll answer all your questions as they arise.'",
        "source": "T03n0190_037:0827b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，那羅陀摩那婆仙得佛許已，即便說偈，而問佛言：「『在何自在王，　　染著名為染，　　彼云何清淨？",
        "translation": "After receiving the Buddha's approval, the sage Narātamānavaka then spoke a verse and asked the Buddha, \"Where is the sovereign king who's defiled and known to be defiled, and how is he pure?",
        "source": "T03n0190_037:0827b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何得癡名？",
        "translation": "How do we get the name of delusion?",
        "source": "T03n0190_037:0827b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　癡人何故迷？",
        "translation": "Why is a foolish man confused?",
        "source": "T03n0190_037:0827b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　云何名智者？",
        "translation": "What is the term \"wise one\"?",
        "source": "T03n0190_037:0827b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　何會別離已，　　名曰盡因緣。』",
        "translation": "'After what is it that's separated, it's called ending the causes and conditions?'",
        "source": "T03n0190_037:0827b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時世尊聞彼說已，即還以偈答那羅陀摩那婆言：「『第六自在故，　　王染名曰染，　　無染而有染，　　是故名為癡。",
        "translation": "\"After hearing what they said, the Bhagavān answered Nārādharma with a verse, \"The sixth reason for his mastery is that the king's defilement is called defilement, and since there's defilement without defilement, it's called delusion.",
        "source": "T03n0190_037:0827c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　以沒大水故，　　故名盡方便，　　一切方便盡，　　故名為智者。』",
        "translation": "It's because of the absence of great waters that it's called the method of ending, and because all methods are ended, it's called the wise one.'",
        "source": "T03n0190_037:0827c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，童子那羅陀仙從佛得聞如是偈已，心意開解，生大歡喜，踊躍遍身，不能自喻。",
        "translation": "\"After hearing this verse from the Buddha, the young man Naradatta became enlightened and overjoyed, leaping all over his body, unable to describe it to himself.",
        "source": "T03n0190_037:0827c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞已即便奔走往詣彼商佉所，及伊羅鉢二龍王邊，到彼二大龍王邊已，即便告彼二龍王言：『汝等龍王！",
        "translation": "After hearing this, he ran off to the two dragon kings Shōkha and Airāva, and when he arrived at the two great dragon kings, he told them, 'You two dragon kings!",
        "source": "T03n0190_037:0827c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說偈問我。』",
        "translation": "'Speak a verse and ask me.'",
        "source": "T03n0190_037:0827c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二龍王，依以二偈，問那羅陀童子仙言：『在何自在王，乃至盡因緣。』",
        "translation": "The two dragon kings then asked the boy sage Nārāditya in two verses, 'What is the sixth king of sovereignty, up to the end of causes and conditions?'",
        "source": "T03n0190_037:0827c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，童子那羅陀仙，還以二偈答龍王言：『第六自在故，乃至名為智。』",
        "translation": "\"The boy Narada then answered the dragon king with these two verses, 'The sixth reason for my sovereignty ... is called wisdom.'",
        "source": "T03n0190_037:0827c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，伊羅鉢龍王聞此偈已，心作如是思惟念言：『我今已得無上世尊，我今已得勝修伽陀，我今已知世尊出現，知修伽陀，大聖世尊，今為我生，為我出世，為我覺悟(如是再稱)。』",
        "translation": "\"After hearing this verse, the dragon king of Airāvaṇa mentally reflected and thought, 'Now, I've attained the unsurpassed Bhagavān, now I've attained Śubhadra, now I've known the Bhagavān to appear, know Śubhadra, the great sage Bhagavān, who was born for me, appeared in the world for me, and awakened for me (thus reprimanded).'",
        "source": "T03n0190_037:0827c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時伊羅鉢二大龍王，如是念已，白那羅陀摩那婆言：『仁摩那婆！",
        "translation": "\"After they had thought this, the two great dragon kings of Airāva said to Narêndra Māṇava, 'Rājñāna Māṇava!",
        "source": "T03n0190_037:0827c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實為我說，此是仙意自辯才力，為從他聞而解此義？",
        "translation": "Do you really mean for me to say that this is the power of the sage's own eloquence, or have you heard it from someone else and understood its meaning?",
        "source": "T03n0190_037:0827c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仙摩那婆！",
        "translation": "Simeonava!",
        "source": "T03n0190_037:0827c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我實不見，今世間中及以天上，若有沙門婆羅門等，或天或人，能自辯才達是二偈，能自說者，無有是處。",
        "translation": "'I really don't see any place in this world or in heaven where there are ascetics, priests, or other gods or humans who can explain these two verses on their own and who can explain them on their own.",
        "source": "T03n0190_037:0827c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯除如來無上世尊，或佛沙門，從彼等邊，聞而方辯。』",
        "translation": "Only the Tathāgata, the unsurpassed world-honored one, or a Buddhist ascetic, from those and others, hears and then speaks them.'",
        "source": "T03n0190_037:0827c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，童子那羅陀仙，即便以偈告伊羅鉢二龍王言：「『如龍王說非我辯，　　大聖世尊已出興，　　諸相具足莊嚴身，　　彼能如是辯才說。』",
        "translation": "\"At the time, the boy Naradatta even addressed the two dragon kings of Airāvaṇa with a verse, saying, \"Thus, the dragon kings say, 'I don't speak eloquently, for the great sage Bhagavān has arisen, and his body is fully adorned with characteristics, so he's able to speak eloquently like this.'",
        "source": "T03n0190_037:0827c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，伊羅鉢龍王即還以偈白仙童子那羅陀言：「『大仙言是佛語者，　　為當睡臥夢裏聞，　　若是分明對面承，　　唯願仁今重讚說。』",
        "translation": "\"It was then that the dragon king Elāpattra returned to the sage boy Nārāditya with a verse, saying, 'Great sage, this is the Buddha's speech, for I've heard it while sleeping and dreaming, and if I clearly understand it and acknowledge it face to face, I hope you'll repeat it today.'",
        "source": "T03n0190_037:0828a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，童子那羅陀仙依所覩見，即更以偈答龍王言：「『天人自在大丈夫，　　今居波羅鹿苑內，　　既轉無上法輪已，　　猶如師子吼勝林。』",
        "translation": "\"Relying on what he had seen, the recluse immortal Nārādity then replied to the dragon king in verse, \"The gods and men are perfectly powerful, and now they're living in the deer park at Bālā, having turned the unsurpassed wheel of the Dharma, they're like lions roaring in a superior forest.\"",
        "source": "T03n0190_037:0828a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，伊羅鉢龍王復更以偈白那羅陀童子仙言：「『仁今所言佛世尊，　　我不聞久今聞說，　　既聞與仁相共詣，　　觀彼希現難思議。",
        "translation": "\"It was then that the dragon king Elāpattra again spoke in verse to the sage Nārādika, saying, \"Now, I haven't heard what you say about the Buddha, Bhagavān, for a long time, but now that I've heard it and have come together with you, I can't imagine observing its rare appearance.",
        "source": "T03n0190_037:0828a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　昔覩今復得重觀，　　正覺如來諸相好，　　今日始更出現世，　　難值猶若優曇花。",
        "translation": "What I saw in the past and what I've seen now can be seen again, the features of the Tathāgata who's correctly awakened are like the udumbara flower, which first appears in the world today and is difficult to apprehend.",
        "source": "T03n0190_037:0828a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　經歷多時乃一興，　　清淨猶彼空中月，　　諸相具足莊嚴體，　　正覺最上勝菩提。",
        "translation": "It takes so many lifetimes for it to appear once, and it's as pure as the moon in the sky, replete with the adorned bodies of its features, and perfectly enlightened, most excellent.",
        "source": "T03n0190_037:0828a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　久遠曠絕不聞聲，　　清亮猶如梵音響，　　若諸眾生得聞者，　　從佛得入解脫門。』",
        "translation": "Its sound is long absent and unheard, but it's as clear as the sound of Brahmā's voice, and if sentient beings hear it, they'll enter the gate of liberation through the Buddha.'",
        "source": "T03n0190_037:0828a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，伊羅鉢龍王說偈讚歎佛世尊已，復更重白那羅陀仙作如是言：『那羅陀仙！",
        "translation": "\"After praising the Bhagavān in verse, the dragon king Elāpattra then repeatedly said to the sage Nārādika, 'Sage Nārādika!",
        "source": "T03n0190_037:0828a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仁言佛也！』",
        "translation": "You say 'Buddha'!",
        "source": "T03n0190_037:0828a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，那羅陀摩那婆仙答龍王言：『我言佛也(梵本再問再答)。』",
        "translation": "Nārādharma-nava replied to the dragon king, 'I said, 'I am the Buddha.'",
        "source": "T03n0190_037:0828a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「龍王復言：『那羅陀仙！",
        "translation": "\"The dragon king then replied, 'Sage Narada!",
        "source": "T03n0190_037:0828a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此鳴吼，出世甚難，所謂彼佛佛世尊也。",
        "translation": "It's very difficult for such a person to shout and appear in the world, which is called the Buddha, the Bhagavān.",
        "source": "T03n0190_037:0828a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "那羅陀仙！",
        "translation": "Sage Nārāyaṇa!",
        "source": "T03n0190_037:0828a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼阿羅呵、三藐三佛陀，今在何方？』",
        "translation": "Where is he now, Ālāha-samyak-saṃbuddha?'",
        "source": "T03n0190_037:0828a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，那羅陀摩那婆仙即整衣服，偏袒右肩，合十指掌，向佛在方，示龍王言：『汝等龍王！",
        "translation": "\"Then, the sage Narātamānavaka adjusted his robes, bared his right shoulder, joined his palms with his ten fingers, and showed the dragon kings where the Buddha was, saying, 'You dragon kings!",
        "source": "T03n0190_037:0828a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲知者彼佛、如來、多陀阿伽度、阿羅呵、三藐三佛陀，今在某方。』",
        "translation": "If you want to know where that Buddha, Tathāgata, Tathāgata, Ārāha, or Samyak-saṃbuddha is now, then you should ask him.'",
        "source": "T03n0190_037:0828a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時，伊羅鉢龍王知佛處已，即整衣服，偏袒右肩，右膝著地，向佛所在，合十指掌，三稱此言：『南無世尊、多陀阿伽度、阿羅呵、三藐三佛陀(如是三說)。』",
        "translation": "\"When he realized where the Buddha was, the dragon king Airāvaṇa adjusted his robes, bared his right shoulder, knelt on his right knee, put his palms together at the Buddha's location, and said three times, 'Namo Bhagavān, Tathāgata, Ārāha, and Samyak-saṃbuddha (spoke in these three ways).'",
        "source": "T03n0190_037:0828b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時伊羅鉢龍王白那羅陀童子仙言：『摩那婆仙！",
        "translation": "\"The dragon king Elāpattra then said to the boy sage Nārādana, 'Sage Manabha!",
        "source": "T03n0190_037:0828b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "相隨共向彼世尊、多陀阿伽度、阿羅呵、三藐三佛陀所，禮拜供養。』",
        "translation": "They all venerated and made offerings to the Bhagavān, the Tathāgata, the Ārāha, and the Samyak-saṃbuddha.'",
        "source": "T03n0190_037:0828b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時那羅陀報龍王言：『善哉龍王！",
        "translation": "Nārāditya then reported to the dragon king, saying, 'Good, Dragon King!",
        "source": "T03n0190_037:0828b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等共去。』",
        "translation": "We'll go together.'",
        "source": "T03n0190_037:0828b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時伊羅鉢并及商佉二大龍王，自餘無量諸龍眷屬，那羅陀仙摩那婆等，八萬四千諸眾生輩，欲向佛所。",
        "translation": "\"It was then that the two great dragon kings Airāvaṇa and Śākha, their countless other dragon retinues, the sages Naradatta and Manabha, and 84,000 other groups of sentient beings wanted to go to the Buddha.",
        "source": "T03n0190_037:0828b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，伊羅鉢龍王作是思惟：『我今若以變化之身見於佛者，此我不善，我今宜以自許報身，往見世尊。』",
        "translation": "\"At the time, the dragon king Airāvaṇa thought, 'Now, if I were to meet the Buddha in a transformation body, I wouldn't be good; now, I should go to see the Bhagavān in my own approved reward body.'",
        "source": "T03n0190_037:0828b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，伊羅鉢龍王至其龍宮，以自報形而欲見佛。",
        "translation": "\"At the time, the dragon king Airāvaṇa went to his dragon palace and wanted to see the Buddha in his self-retribution body.",
        "source": "T03n0190_037:0828b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從北天竺特叉尸羅城，向波羅[木*奈]國，強有三百六十由旬，時彼龍王出欲見佛，其頭已至佛世尊所，而尾猶尚在自本宮。",
        "translation": "It was 360 leagues from the city of Takṣaśīla in northern India toward the country of Bālā[muṇḍinya] when that dragon king emerged from his palace to see the Buddha, and his head reached the Bhagavān while his tail was still in his palace.",
        "source": "T03n0190_037:0828b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼龍頭，其狀猶如獨樹造般，其項猶如象鼻放水，耳目猶如憍薩羅國銅鉢之器，口出光炎，猶如重雲出於閃電，氣息作聲，如雲雷鳴，作伽荼伽荼聲。",
        "translation": "The dragon's head was like a lone tree growing a lump, its trunk was like an elephant's trunk releasing water, its ears and eyes were like the copper bowl vessels of Kauśālala, and its mouth was aglow with lightning like a heavy cloud rising from a flash of lightning, and its breath produced a sound like clouds thundering and a kāṭakāṭa sound.",
        "source": "T03n0190_037:0828b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼八萬四千眾類，一切悉隨伊羅鉢行。",
        "translation": "All 84,000 of those sentient beings follow Iraprabha's lead.",
        "source": "T03n0190_037:0828b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而伊羅鉢遙見如來，極大端正光相非常，心生歡喜，乃至猶如虛空中星莊嚴顯赫，既覩見已，向於佛邊，生清淨心正信之心，踊躍歡喜，進向佛所。",
        "translation": "When he saw the Tathāgata from a distance, his extremely large, correct, and brilliant features were so extraordinary that his heart rejoiced, even as the stars in the sky adorned themselves in splendor, and after he saw them, he turned to the Buddha, gave rise to a pure and righteous mental attitude of faith, and rejoiced as he rushed toward him.",
        "source": "T03n0190_037:0828b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時，世尊既遙覩見伊羅鉢龍漸漸而來，見已告言：『善來善來！",
        "translation": "\"At the time, the Bhagavān saw the Elāpattra dragon coming gradually from a distance, and when he saw it, he said, 'Good, good!",
        "source": "T03n0190_037:0828b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伊羅鉢龍王！",
        "translation": "Elāpattra!",
        "source": "T03n0190_037:0828b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經歷多時不曾相見，王今身體安隱以不？",
        "translation": "It's been a long time since we've seen each other. Is the king now physically at ease?",
        "source": "T03n0190_037:0828b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "少病少惱，及諸親眷，並無疾耶？』",
        "translation": "Are there few illnesses and few afflictions, and are there no illnesses among your relatives?'",
        "source": "T03n0190_037:0828c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛本行集經卷第三十七",
        "translation": "Sutra on the Collection of the Past Activities of the Buddha, Volume 37",
        "source": "T03n0190_037:0828c03_0",
        "is_bad_quality": false
    }
]