[
    {
        "source_sentence": "撰集百緣經卷第十",
        "translation": "Collected Documents: The Sutra of the Hundred Conditions, Volume X",
        "source": "T04n0200_010:0250a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吳月支優婆塞支謙譯",
        "translation": "Wu Yuezhi Upāsaka Zhiqian Translation",
        "source": "T04n0200_010:0250a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸緣品第十",
        "translation": "Tenth Chapter of the Sutra on Conditions",
        "source": "T04n0200_010:0250a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九一）須菩提惡性緣",
        "translation": "(91) Conditions of the Evil Nature of Subhūti",
        "source": "T04n0200_010:0250a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，初始成佛，便欲教化諸龍王故，即便往至須彌山下，現比丘形，端坐思惟。",
        "translation": "After he first became a buddha, the Bhagavān then wanted to teach the dragon kings, so he went down to Mount Sumeru, assumed the form of a monk, and sat calmly in thought.",
        "source": "T04n0200_010:0250a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有金翅鳥王，入大海中捉一小龍，還須彌頂，規欲食噉。",
        "translation": "At the time, a garuḍa king went into the ocean, caught a small dragon, returned it to the summit of Sumeru, and planned to feed on it.",
        "source": "T04n0200_010:0250a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼小龍命故未斷，遙見比丘端坐思惟，至心求哀，尋即命終，生舍衛國婆羅門家，名曰負梨。",
        "translation": "The young dragon, whose life hadn't yet ended, saw the monk sitting calmly and reflecting, begged with all his heart, and then his life ended and he was born in Śrāvastī at the home of a Brāhmaṇa named Śāriputra.",
        "source": "T04n0200_010:0250a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "端政殊妙，世所希有，因為立字，名須菩提。",
        "translation": "Because of his marvelous appearance, which was rare in the world, he created a name, Subhūti.",
        "source": "T04n0200_010:0250a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "年漸長大，智慧聰明，無有及者；唯甚惡性，凡所眼見人及畜生，則便瞋罵，未曾休廢。",
        "translation": "As he grew older, his wisdom and intelligence were unsurpassed; except for his very malevolent nature, whenever he saw someone or an animal, he would become angry and insult them without ever stopping.",
        "source": "T04n0200_010:0250a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父母親屬皆共厭患，無喜見者，遂便捨家入山林中，乃見鳥獸及以草木，風吹動搖，亦生瞋恚，終無喜心。",
        "translation": "His parents and relatives were all disillusioned and had no joy in seeing them. So he left home and went into the mountains and forests, where he saw birds, animals, grass, and trees that were shaken by the wind and became angry and never liked them.",
        "source": "T04n0200_010:0250a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有山神，語須菩提言：「汝今何故，捨家來此山林之中，既不修善則無利益，唐自疲苦？",
        "translation": "A mountain god then said to Subhūti, \"Why did you leave your family and come to this mountain forest, where you don't cultivate goodness and receive no benefit but rather weary yourself?",
        "source": "T04n0200_010:0250a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今有世尊，在祇桓中，有大福德，能教眾生修善斷惡。",
        "translation": "Now there's a Bhagavān who's in Jīvaka and has great merit and virtue, who can teach sentient beings to cultivate goodness and end badness.",
        "source": "T04n0200_010:0250a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今若至彼，必能除汝瞋恚惡毒。」",
        "translation": "If you go there now, you'll be able to remove the bad poison of your anger.\"",
        "source": "T04n0200_010:0250a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時須菩提聞山神語，即生歡喜，尋問之曰：「今者世尊，為在何處？」",
        "translation": "When Subhūti heard what the mountain spirit said, he rejoiced and asked, \"Now, Bhagavān, where is he?\"",
        "source": "T04n0200_010:0250a22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "山神答曰：「汝但眠眼，我自將汝，至世尊所。」",
        "translation": "The mountain spirit answered, \"Just sleep with your eyes open, and I'll take you to the Bhagavān.\"",
        "source": "T04n0200_010:0250a24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時須菩提用山神語，眠目須臾，不覺自然在祇桓中，見佛世尊，三十二相、八十種好，光明普曜，如百千日，心懷歡喜，前禮佛足，却坐一面。",
        "translation": "Using the mountain spirit's words, Subhūti slept for a moment, but he didn't realize that he was naturally in Jīvaka and saw the Bhagavān, with his thirty-two features and eighty kinds of beauty and his light shining like a hundred thousand suns, rejoicing at heart, bowing his head at the Buddha's feet and withdrawing to sit to one side.",
        "source": "T04n0200_010:0250a25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即為說瞋恚過惡，愚癡煩惱，燒滅善根，增長眾惡，後受果報，墮在地獄，備受苦痛，不可稱計。",
        "translation": "The Buddha then explained for them the faults of anger and the afflictions of folly, which burn up good roots and increase numerous evils, and the subsequent consequences of which are falling into hell and suffering incalculable pain.",
        "source": "T04n0200_010:0250a28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設復得脫，或作龍蛇羅剎鬼神，心常含毒，更相殘害。",
        "translation": "Even if they were freed, they might become dragons, snakes, razas, and ghosts, whose minds are always filled with poison, and they'll inflict further harm.",
        "source": "T04n0200_010:0250b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時須菩提，聞佛世尊說是語已，心驚毛竪，尋自悔嘖，即於佛前，懺悔罪咎，豁然獲得須陀洹果，心懷喜悅，求入道次。",
        "translation": "After hearing the Bhagavān's words, Subhūti's hair stood on end in shock, and he looked for himself to repent and confess his sins before the Buddha.",
        "source": "T04n0200_010:0250b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即聽許：「善來比丘！」",
        "translation": "The Buddha then heard and approved, \"Well come, monks!\"",
        "source": "T04n0200_010:0250b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬚髮自落，法服著身，便成沙門。",
        "translation": "With his hair falling off his beard and his Dharma robes on his body, he becomes an ascetic.",
        "source": "T04n0200_010:0250b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精懃修習，得阿羅漢果，三明六通，具八解脫，諸天世人，所見敬仰。",
        "translation": "After diligently cultivating it, he attains the fruit of the arhat, the three kinds of insight, the six powers, and the eight liberations, which are seen and venerated by gods and humans.",
        "source": "T04n0200_010:0250b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘，見是事已，白佛言：「世尊！",
        "translation": "After they saw this, the monks said to the Buddha, \"Bhagavān!",
        "source": "T04n0200_010:0250b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此須菩提比丘，宿造何業，雖得為人，常懷瞋恚未曾休息，值佛世尊，出家得道？」",
        "translation": "What karma did this monk Subhūti create in the past that, although he attained human status, he always harbored anger and never rested, and then he found the Bhagavān and left home and attained the path?\"",
        "source": "T04n0200_010:0250b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告諸比丘：「汝等善聽！",
        "translation": "It was then that the Bhagavān addressed the monks, \"All of you, listen well!",
        "source": "T04n0200_010:0250b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾當為汝分別解說。",
        "translation": "\"I will explain it clearly for you.",
        "source": "T04n0200_010:0250b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此賢劫中，波羅奈國有佛出世，號曰迦葉。",
        "translation": "During this good eon, there was a Buddha named Kāśyapa who appeared in the country of Polonai.",
        "source": "T04n0200_010:0250b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼法中有一比丘，常行勸化，一萬歲中，將諸比丘，處處供養。",
        "translation": "Among his teachings was a monk who always encouraged and educated others, and for 10,000 years he made offerings to monks in various places.",
        "source": "T04n0200_010:0250b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於後時間，僧有少緣，竟不隨從，便出惡罵：『汝等佷戾，狀似毒龍。』",
        "translation": "Some time later, when the saṃgha had a few conditions and didn't follow them, he let out a harsh insult, saying, 'You're all so violent, you look like poisonous dragons.'",
        "source": "T04n0200_010:0250b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，尋即出去。",
        "translation": "After saying this, he looked around and left.",
        "source": "T04n0200_010:0250b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是業緣，五百世中，受毒龍身，心常含毒觸嬈眾生。",
        "translation": "Because of this action, for 500 lifetimes I've been subjected to the body of a poisonous dragon, and my mind has always contained poison that touches and troubles sentient beings.",
        "source": "T04n0200_010:0250b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今雖得人，宿習不除，故復生瞋。」",
        "translation": "Even though I've now become a human being, I haven't gotten rid of my long-standing habits, so I'll become angry again.\"",
        "source": "T04n0200_010:0250b19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「欲知爾時勸化比丘惡口罵者，今須菩提是。",
        "translation": "The Buddha told the monks, \"Suppose you want to know that at the time, this was Suppository Bhagavān who encouraged the monks to badmouth him.",
        "source": "T04n0200_010:0250b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由於爾時供養僧故，今得值我，出家得道。」",
        "translation": "Because of the support he gave to the saṃgha at that time, he has now found me and left home to attain the path.\"",
        "source": "T04n0200_010:0250b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸比丘，聞佛所說，歡喜奉行。",
        "translation": "The monks who then heard what the Buddha taught rejoiced and handed it down.",
        "source": "T04n0200_010:0250b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九二）◎長老比丘在母胎中六十年緣",
        "translation": "（The elder monk had been in his mother's womb for sixty years.",
        "source": "T04n0200_010:0250b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在王舍城迦蘭陀竹林。",
        "translation": "The Buddha was in the Kalandaka's Bamboo Grove of Rājagṛha.",
        "source": "T04n0200_010:0250b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼城中，有一長者，財寶無量，不可稱計，選擇高門，娉以為婦，種種音樂，以娛樂之。",
        "translation": "There was an elderly man in that city who had treasures too great to be counted, chose a high gate, took his wife in marriage, and entertained her with music of various kinds.",
        "source": "T04n0200_010:0250b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "足滿十月，便欲產子，然不肯出，尋重有娠，足滿十月，復產一子，先懷妊者，住在右脇。",
        "translation": "When she had reached the tenth month, she wanted to give birth to a child, but she refused to leave, so she looked for another pregnancy, and when she had reached the tenth month, she gave birth to another child, and the one who was pregnant first stayed at her right hypochondrium.",
        "source": "T04n0200_010:0250b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是次第，懷妊九子，各滿十月而產，唯先一子，故在胎中，不得出外。",
        "translation": "In this order, nine sons are conceived and born when each has reached the tenth month, but only one son is born first, so he remains in the womb and can't leave the house.",
        "source": "T04n0200_010:0250b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其母極患，設諸湯藥，以自療治，病無降損，囑及家中：「我腹中子，故活不死，今若設終，必開我腹，取子養育。」",
        "translation": "The mother was very ill and set up a medicine to treat herself, but her illness didn't subside, and she told her family, \"The child in my belly is alive and won't die; now, if I decide to end it, I'll open my belly and take the child to raise.\"",
        "source": "T04n0200_010:0250c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其母於時，不免所患，即便命終。",
        "translation": "Her mother was not spared from this illness, and she was about to die.",
        "source": "T04n0200_010:0250c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸眷屬，載其尸骸，詣於塜間，請大醫耆婆，破腹看之。",
        "translation": "The members of her entourage then carried her corpse to the graveyard and invited a great physician and her elder to open his belly and look at it.",
        "source": "T04n0200_010:0250c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得一小兒，形狀如故，頭鬢皓白，俯僂而行，四向顧視，語諸親言：「汝等當知！",
        "translation": "They found a small child with the same shape as before, white hair on his head, who was walking stooped and looking in all directions, and he said to his relatives, \"You must know!",
        "source": "T04n0200_010:0250c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我由先身惡口罵辱諸眾僧故，處此生熟藏中，經六十年受是苦惱，難可叵當。」",
        "translation": "Because of my previous bad speech, which insulted the saṃgha, I've been in this ripened storehouse for 60 years and have suffered such hardship, which is difficult and unacceptable.\"",
        "source": "T04n0200_010:0250c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸親屬，聞兒語已，號[口*睪]涕哭，悲不能答。",
        "translation": "When their relatives heard what their son said, they cried [orally*drum roll] and wept, unable to reply with pity.",
        "source": "T04n0200_010:0250c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，遙知此兒善根已熟，將諸大眾，往到尸所，告小兒言：「汝是長老比丘不？」",
        "translation": "Knowing that this child's good roots were ripened, the Bhagavān then gathered the crowd and went to the Śākyamuni's residence, saying to the child, \"Are you the elder monk?\"",
        "source": "T04n0200_010:0250c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「實是。」",
        "translation": "They replied, \"It's true.\"",
        "source": "T04n0200_010:0250c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二第三，亦如是問，故言道是。",
        "translation": "The second and third were likewise asked, and so they said, 'The Way is.'",
        "source": "T04n0200_010:0250c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸大眾，見此小兒與佛答對，各懷疑惑，前白佛言：「今此老兒，宿造何業，處在胎中，頭髮皓白，俯僂而行，復與如來共相答問？」",
        "translation": "When the crowd saw this little boy answering the Buddha's questions, they each had their doubts and said to the Buddha, \"Now, what kind of activity did this old boy do in the past that caused him to be in the womb, have white hair, and walk stooped over, and yet he's still answering questions with the Tathāgata?\"",
        "source": "T04n0200_010:0250c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，告諸大眾：「汝等諦聽！",
        "translation": "It was then that the Bhagavān addressed the crowd, \"All of you, listen closely!",
        "source": "T04n0200_010:0250c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾當為汝分別解說。",
        "translation": "\"I will explain it clearly for you.",
        "source": "T04n0200_010:0250c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此賢劫中，波羅奈國有佛出世，號曰迦葉。",
        "translation": "During this good eon, there was a Buddha named Kāśyapa who appeared in the country of Polonai.",
        "source": "T04n0200_010:0250c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸比丘，夏坐安居，眾僧和合，差一比丘，年在老耄，為僧維那，共立制限。",
        "translation": "There were monks who were sitting in summer retreat, and the saṃgha was united, so they sent a monk who was old and decrepit to set the limits for the saṃgha's maintenance.",
        "source": "T04n0200_010:0250c20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此夏坐，要得道者，聽共自恣；若未得者，不聽自恣。",
        "translation": "During this summer retreat, those who have attained the way will be allowed to practice their own restraints; if they haven't, they won't be allowed to practice their own restraints.",
        "source": "T04n0200_010:0250c22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此維那，獨不得道，僧皆不聽布薩自恣，心懷懊惱，而作是言：『我獨為爾營理僧事，令汝等輩安隱行道，今復返更不聽自恣布薩羯磨。』",
        "translation": "Now, when this venerable alone doesn't attain the path and the saṃgha won't listen to the self-assembly, he feels distressed and says, 'I alone managed the affairs of the saṃgha for you, so that you people would practice the path in peace and quiet, but now I'm going to go back and not listen to the self-assembly of the kalpa.'",
        "source": "T04n0200_010:0251a01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便瞋恚，罵辱眾僧。",
        "translation": "Even then, he became angry and insulted the saṃgha.",
        "source": "T04n0200_010:0251a05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尋即牽捉，閉著室中，作是唱言：『使汝等輩，常處闇冥，不見光明，如我今者處此闇室。』",
        "translation": "He then took them into his arms, shut them up in their room, and called out, 'So you people will always be in darkness and won't see the light, like me in this dark room today.'",
        "source": "T04n0200_010:0251a05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，自戮命終，墮地獄中，受大苦惱，今始得脫，故在胎中，受是苦惱。」",
        "translation": "After saying this, they killed themselves, fell into hell at the end of their lives, and suffered great pain and suffering.",
        "source": "T04n0200_010:0251a07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時眾會，聞佛所說，各各自護身口意業，厭離生死，有得須陀洹者、斯陀含者、阿那含者、阿羅漢者，有發辟支佛心者，有發無上菩提心者。",
        "translation": "Upon hearing what the Buddha taught, the assembly each guarded their physical, verbal, and mental actions, became disillusioned with birth and death, and some became stream entrants, once-returners, non-returners, arhats, those who had arisen the mind of the solitary buddhas, and those who had arisen the mind of unsurpassed enlightenment.",
        "source": "T04n0200_010:0251a09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸親屬，還將老兒，詣家養育。",
        "translation": "Their relatives then returned and sent their old son home to be nurtured.",
        "source": "T04n0200_010:0251a12_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "年漸長大，放令出家，精懃修習，得阿羅漢果。",
        "translation": "As they grew older, they released them into the world of work and diligently cultivated them to attain the fruit of the arhat.",
        "source": "T04n0200_010:0251a13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘，見是事已，白佛言：「世尊！",
        "translation": "After they saw this, the monks said to the Buddha, \"Bhagavān!",
        "source": "T04n0200_010:0251a14_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此老兒比丘，宿殖何福，出家未久，獲羅漢果？」",
        "translation": "What merit did this old monk cultivate in his past that he attained the fruit of the arhat after having left home for a short time?\"",
        "source": "T04n0200_010:0251a15_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「緣於往昔供養眾僧，及作維那營僧事故，今得值我，出家得道。」",
        "translation": "The Buddha told the monks, \"It's because of making offerings to the saṃgha and working as a vinaya monk in the past that I have now made it possible for them to leave home and attain the path.\"",
        "source": "T04n0200_010:0251a16_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸比丘，聞佛所說，歡喜奉行。",
        "translation": "The monks who then heard what the Buddha taught rejoiced and handed it down.",
        "source": "T04n0200_010:0251a18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九三）◎兀手比丘緣",
        "translation": "(93)-The Woodman Monk's Condition",
        "source": "T04n0200_010:0251a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在舍衛國祇樹給孤獨園。",
        "translation": "The Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T04n0200_010:0251a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼城中，有一長者，財寶無量，不可稱計，選擇族望，娉以為婦，作諸伎樂，以娛樂之。",
        "translation": "At the time, there was an elder in that city who had wealth beyond measure, chose a noble family, took his wife as his wife, and created various plays and music to entertain her.",
        "source": "T04n0200_010:0251a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其婦懷妊，足滿十月，產一男兒，兀無有手，產便能語，作是唱言：「今此手者，甚為難得，深生愛惜。」",
        "translation": "When she was pregnant and had reached the tenth month, she gave birth to a boy who had no hands and was able to speak after giving birth, saying, \"Now, this hand is very rare; cherish it!\"",
        "source": "T04n0200_010:0251a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父母怪之，召諸相師，占相此兒。",
        "translation": "The parents wondered about that, so they summoned a fortune teller to read the fortune of this boy.",
        "source": "T04n0200_010:0251a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "相師覩已，問其父母：「此兒產時，有何瑞相？」",
        "translation": "When the fortune teller saw him, he asked his parents, \"What was the auspicious sign of this child at the time of birth?\"",
        "source": "T04n0200_010:0251a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父母答言：「此兒產已，作是唱言：『今此手者，甚為難得。』」",
        "translation": "The parents replied, \"After this child was born, he said, 'Now, this hand is very difficult to obtain.'\"",
        "source": "T04n0200_010:0251a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因為立字，名曰兀手。",
        "translation": "Because he had established his name, he was called Woody.",
        "source": "T04n0200_010:0251a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "年漸長大，稟性調順，聰明黠慧。",
        "translation": "As he grew older, his nature was docile, and he was intelligent and wise.",
        "source": "T04n0200_010:0251a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將諸親友漸行觀看，到祇桓中，見佛世尊，三十二相、八十種好，光明赫奕如百千日，心懷歡喜，前禮佛足，却住一面。",
        "translation": "As he gradually observed his friends and relatives, he went to Jīvaka and saw the Bhagavān, with his thirty-two features and eighty kinds of beauty and his radiance shining like a hundred thousand suns.",
        "source": "T04n0200_010:0251b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即為其種種說法，心開意解，得須陀洹果。",
        "translation": "The Buddha then gave him various lectures, opened his mind and resolve, and he attained the fruit of stream entry.",
        "source": "T04n0200_010:0251b04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "歸辭父母，求索入道。",
        "translation": "He returned to his parents and sought to enter the path.",
        "source": "T04n0200_010:0251b05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父母愛念，不能違逆，將詣佛所，求索出家。",
        "translation": "His parents loved him and couldn't disobey him, so they went to the Buddha and asked him to leave home.",
        "source": "T04n0200_010:0251b06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即告言：「善來比丘！」",
        "translation": "The Buddha then told them, \"Well done, monks!\"",
        "source": "T04n0200_010:0251b07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬚髮自落，法服著身，便成沙門。",
        "translation": "With his hair falling off his beard and his Dharma robes on his body, he becomes an ascetic.",
        "source": "T04n0200_010:0251b07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精懃修習，得阿羅漢果，三明六通具八解脫，諸天世人，所見敬仰。",
        "translation": "After diligently cultivating it, he attains the fruit of the arhat, the three kinds of insight and six powers, and the eight liberations, which are seen and venerated by gods and humans.",
        "source": "T04n0200_010:0251b08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘，見是事已，而白佛言：「今此兀手比丘，宿殖何福，生已能語，然無有手，又值世尊，得獲道跡？」",
        "translation": "After seeing this, the monks said to the Buddha, \"Now, what merit did this monk with the bare hands possess that made him capable of speech after birth, yet he has no hands, and he found the Bhagavān and attained the path?\"",
        "source": "T04n0200_010:0251b09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，告諸比丘：「汝等諦聽！",
        "translation": "It was then that the Bhagavān addressed the monks, \"All of you, listen closely!",
        "source": "T04n0200_010:0251b12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾當為汝分別解說。",
        "translation": "\"I will explain it clearly for you.",
        "source": "T04n0200_010:0251b13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此賢劫中，波羅奈國有佛出世，號曰迦葉。",
        "translation": "During this good eon, there was a Buddha named Kāśyapa who appeared in the country of Polonai.",
        "source": "T04n0200_010:0251b13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有二比丘，一是羅漢，二是凡夫，為說法師。",
        "translation": "There were two monks, one a arhat and the other a worldling, who were Dharma preachers.",
        "source": "T04n0200_010:0251b14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸民眾，競共請喚，常將法師，受檀越請。",
        "translation": "At the time, the people competed for his invitation, and they always invited the Dharma teacher to accept the invitation of the patron.",
        "source": "T04n0200_010:0251b15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "脫於一日，法師不在，將餘者行。",
        "translation": "One day, when the Dharma teacher wasn't there, they summoned the others to do the same.",
        "source": "T04n0200_010:0251b16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞋恚罵言：『我常為汝，洗鉢給水，今更返將餘者共行。",
        "translation": "He angrily rebuked them, saying, 'I've always washed your bowls and given you water, but now I'm going to make the others go along with you.",
        "source": "T04n0200_010:0251b17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自今以往，更為汝使令我無手。』",
        "translation": "From now on, I'll make you make me go without hands again.'",
        "source": "T04n0200_010:0251b18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，各自辭退，止不共行。",
        "translation": "After saying this, they each withdrew and stopped walking with the others.",
        "source": "T04n0200_010:0251b19_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是業緣，五百世中，受是果報，是故唱言：『今此手者，甚為難得。』」",
        "translation": "Because of this action, they'll receive the result in 500 lifetimes; therefore, they said, 'Now, this hand is very difficult to obtain.'\"",
        "source": "T04n0200_010:0251b20_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「欲知彼時法師比丘作呪誓者，今兀手比丘是。",
        "translation": "The Buddha told the monks, \"You want to know about the Dharma teacher monk who made the vow to curse, this is the monk Woodhand.",
        "source": "T04n0200_010:0251b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由於彼時供給聖人故，今得值我，出家得道。」",
        "translation": "It was because he made offerings to the sages that he was now able to meet me and leave home and attain the path.\"",
        "source": "T04n0200_010:0251b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說是兀手緣時，諸比丘等，各各自護身口意業，厭惡生死，有得須陀洹者、斯陀含者、阿那含者、阿羅漢者，有發辟支佛心者，有發無上菩提心者。",
        "translation": "When the Buddha spoke these words, the monks each guarded their physical, verbal, and mental actions, became disillusioned with birth and death, and some became stream entrants, once-returners, non-returners, arhats, those who arouse the mind of the solitary buddhas, and those who arouse the mind of unsurpassed enlightenment.",
        "source": "T04n0200_010:0251b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸比丘，聞佛所說，歡喜奉行。",
        "translation": "Those monks who then heard what the Buddha taught rejoiced and handed it down.",
        "source": "T04n0200_010:0251b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九四）◎梨軍支比丘緣",
        "translation": "(94)-Conditions of the Rijunzi monks",
        "source": "T04n0200_010:0251b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在舍衛國祇樹給孤獨園。",
        "translation": "The Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T04n0200_010:0251c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼城中，有一婆羅門，其婦懷妊足滿十月，產一男兒，容貌弊惡，身體臭穢，飲母乳時，能使乳壞，若雇餘者，亦皆敗壞；唯以酥蜜，塗指令舐得濟軀命，因為立字號梨軍支。",
        "translation": "In that city, there was a Brāhmaṇa whose wife was fully pregnant for ten months and gave birth to a boy with a disgusting appearance and a foul-smelling body who could cause his milk to spoil when he drank it and spoil anything else he hired.",
        "source": "T04n0200_010:0251c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "年漸長大，遂復薄福，求索飲食，未曾得飽。",
        "translation": "As he grew older, he became less fortunate and sought food and drink, but never got enough.",
        "source": "T04n0200_010:0251c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見諸沙門，威儀詳序，執持應器，入城乞食滿鉢而還，見已歡喜，作是念言：「我今當往詣佛世尊，求作沙門，或能得飽。」",
        "translation": "When he saw the ascetics, their manners were neat and orderly, and they were carrying appropriate utensils as they entered the city to solicit food and filled their bowls, he rejoiced and had this thought, \"Now, I will go to the Bhagavān and ask to become an ascetic, for perhaps I'll be able to get enough to eat.\"",
        "source": "T04n0200_010:0251c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，即詣祇桓，求佛出家。",
        "translation": "After he had this thought, he went to Jīvaka and asked the Buddha to leave home.",
        "source": "T04n0200_010:0251c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即告言：「善來比丘！」",
        "translation": "The Buddha then told him, \"Well done, monks!\"",
        "source": "T04n0200_010:0251c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬚髮自落，法服著身，便成沙門。",
        "translation": "With his beard and hair falling out, he put on the Dharma robe and became an ascetic.",
        "source": "T04n0200_010:0251c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精懃修習，得阿羅漢果。",
        "translation": "He diligently cultivates it and attains the fruit of the arhat.",
        "source": "T04n0200_010:0251c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而行乞食亦不獲得，便自悔責，入其塔中，見少坌污，即便掃灑。",
        "translation": "However, when he went begging for food and didn't receive it, he repented himself and went into his stūpa and saw a little dirt, so he cleaned it up.",
        "source": "T04n0200_010:0251c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時到乞食，即便豐足。",
        "translation": "When the time came for him to solicit alms, he even had enough.",
        "source": "T04n0200_010:0251c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心懷歡喜，白眾僧言：「從今以往眾僧塔寺聽我掃灑。",
        "translation": "Rejoicing in his heart, he said to the monks, \"From now on, I'll sweep up all the monks' stūpas and temples.",
        "source": "T04n0200_010:0251c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is that?",
        "source": "T04n0200_010:0251c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由掃灑故，乞食得飽。」",
        "translation": "It's because of the sweeping that begging for food gets fed.\"",
        "source": "T04n0200_010:0251c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧即聽許，常令掃灑。",
        "translation": "The saṃgha then gave his permission and always made him sweep.",
        "source": "T04n0200_010:0251c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又於一日，愚癡所縛，眠不覺曉，未及掃灑。",
        "translation": "One day, bound by delusion, he didn't wake up from sleep and didn't bother to sweep it up.",
        "source": "T04n0200_010:0251c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗，將五百弟子，從他邦來，問訊世尊，見佛塔中有少塵坌，即便掃之。",
        "translation": "Śāriputra then sent five hundred of his disciples from another country to inquire of the Bhagavān and saw a little dust in the stūpa, which he promptly swept up.",
        "source": "T04n0200_010:0251c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時梨軍支便從眠覺，見舍利弗掃灑已竟，心懷悵恨，語舍利弗：「汝掃我地，令我今者飢困一日。」",
        "translation": "Rizhuci then awoke from his sleep and saw Śāriputra finish sweeping it away. He felt sad and said to Śāriputra, \"You swept my floor, and now I've been starving for a day.\"",
        "source": "T04n0200_010:0251c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗聞是語已，而告之言：「我於今者，自當共汝入城受請，可得飽滿，汝勿憂也。」",
        "translation": "After hearing this, Śāriputra told him, \"Now, I will go into the city with you and invite you to be fed, so don't be concerned.\"",
        "source": "T04n0200_010:0252a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時梨軍支聞是語已，心懷泰然。",
        "translation": "After hearing those words, Rīṣṭrapāla's mind was calm.",
        "source": "T04n0200_010:0252a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受請時到，共舍利弗入城受請，正值檀越夫婦鬪諍，竟不得食，飢餓而還。",
        "translation": "When the time came for them to be invited, they went into the city with Śāriputra to accept the invitation, but during a dispute between a couple of dongs, they were unable to eat and returned hungry.",
        "source": "T04n0200_010:0252a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗於第二日，復更語言：「我於今朝，當自將汝受長者請，令汝飽足。」",
        "translation": "On the second day, Śāriputra spoke again, \"This morning, I will invite you to accept the elder's invitation myself, so that you'll have enough to eat.\"",
        "source": "T04n0200_010:0252a07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時到將往，其上中下，皆悉得食，唯此一人獨不得食，高聲唱言：「我不得食。」",
        "translation": "When the time arrived, the upper and lower classes were all fed, except for this one person who wasn't allowed to eat and raised his voice, saying, \"I won't be allowed to eat.\"",
        "source": "T04n0200_010:0252a09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時主人，都無聞者，飢困而還。",
        "translation": "At the time, the hosts, all of whom hadn't heard, returned home hungry and destitute.",
        "source": "T04n0200_010:0252a10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿難，聞是事已，深生憐愍，於第三日，語梨軍支言：「我於今朝，隨佛受請，為汝取食，定使飽滿。」",
        "translation": "After hearing this, Ānanda felt compassion for them and on the third day said to Lizunchi, \"This morning, I will follow the Buddha's invitation to get food for you, and I'm sure it will fill you up.\"",
        "source": "T04n0200_010:0252a11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然彼阿難，受持如來八萬四千諸法藏門，未曾漏脫，今故為此梨軍支比丘，取其飲食，忽然不憶，空鉢而還。",
        "translation": "Nevertheless, that Ānanda, who had memorized 84,000 teachings from the Tathāgata's collection of teachings and had never been deprived of them, suddenly didn't remember taking food and drink for this monk Rizhundshi, and returned with his bowl empty.",
        "source": "T04n0200_010:0252a14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於第四日，阿難復更為其取食，還歸所止，道逢惡狗，所為[齒*齊][口*制]，飲食棄地空鉢而還，復不得食。",
        "translation": "On the fourth day, Ānanda again took food for him and returned to his lodging when he met a dangerous dog that [dent*qi][mou*zhi] had [dined] him, threw his food and drink to the ground, returned with an empty bowl, and couldn't eat again.",
        "source": "T04n0200_010:0252a16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於第五日，大目揵連復為取食，還歸所止，道中復為金翅鳥王，見為搏[口*制]，合鉢持去置大海中，復不得食。",
        "translation": "On the fifth day, Mahāmaudgalyāyana again took food and returned to his lodging, but in the path there was another garuḍa bird king who saw it fighting [mouth*restraint], took his bowl and put it in the ocean, and again he couldn't eat.",
        "source": "T04n0200_010:0252a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於第六日，時舍利弗復為取食，到彼房門，門自然閉，復以神力，入其房內，踊出其前，失鉢墮地，至金剛際。",
        "translation": "On the sixth day, Śāriputra went to the door of his room again to get some food, but when the door naturally closed, he used his supernormal powers to enter his room, rushed out, lost his bowl, fell to the ground, and reached the edge of the vajra.",
        "source": "T04n0200_010:0252a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以神力，申手取鉢，其口復噤，竟不能食；日時已過，口輒自開。",
        "translation": "Again, he used his supernormal powers to retrieve the bowl with his hand, but his mouth was again silenced, and he couldn't eat.",
        "source": "T04n0200_010:0252a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於第七日，竟不得食，極生慚愧，於四眾前，飡沙飲水，即入涅槃。",
        "translation": "On the seventh day, he couldn't eat at all, became extremely ashamed, drank sand and water in front of the four groups, and then entered nirvāṇa.",
        "source": "T04n0200_010:0252a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘，見是事已，怪其所由。",
        "translation": "When the monks saw this, they wondered about the reason.",
        "source": "T04n0200_010:0252a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「梨軍支比丘，宿造何業，產則飢餓，初無豐足，復以何緣，出家得道？」",
        "translation": "\"What karma did that monk from the past create, which caused him to give birth to a hungry family and not to have enough in the first place, and for what reason did he leave home and attain the path?\"",
        "source": "T04n0200_010:0252a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，告諸比丘：「汝等諦聽！",
        "translation": "It was then that the Bhagavān addressed the monks, \"All of you, listen closely!",
        "source": "T04n0200_010:0252b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾當為汝分別解說。",
        "translation": "I will discern and explain it for you.",
        "source": "T04n0200_010:0252b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往過去無量世中，波羅奈國有佛出世，號曰帝幢，將諸比丘，遊行教化。",
        "translation": "It was in a time in the distant past when a Buddha named Tejaprabhā appeared in the country of Polonai and led a procession of monks to teach them.",
        "source": "T04n0200_010:0252b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有長者，名曰瞿彌，見佛及僧，深生信敬，請來供養，日日如是。",
        "translation": "An elderly man named Gomis saw the Buddha and the saṃgha, became deeply devoted, invited them to come and make offerings, and did so day after day.",
        "source": "T04n0200_010:0252b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便經後時，其父崩亡，母故惠施，子極恡惜，遮不聽施，乃至計食與母，母故分減，施佛及僧。",
        "translation": "It was then that, after the death of his father, his mother gave generously to him, but his son was so stingy and stingy that he refused to accept the offerings, even going so far as to give his mother some of the food she had planned to give to the Buddha and Saṅgha.",
        "source": "T04n0200_010:0252b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子聞瞋恚，即便捉母，閉著空屋，鎖戶棄去，至七日頭，母極飢困，從子索食，兒答母曰：『何如飡沙飲水足活？",
        "translation": "When the son heard this, he was angered, so he grabbed his mother, shut her up in an empty house, locked the door, and abandoned her.",
        "source": "T04n0200_010:0252b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今者何為從我索食？』",
        "translation": "Why are you asking for food from me now?'",
        "source": "T04n0200_010:0252b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，捨之而去。",
        "translation": "After he said this, he left her.",
        "source": "T04n0200_010:0252b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "竟不得食，母便去世。",
        "translation": "After not getting any food, his mother then passed away.",
        "source": "T04n0200_010:0252b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其子於後，即便命終，入阿鼻獄，受苦畢已，還生人中，飢困如是。」",
        "translation": "Even after that, his son's life ended and he was sent to the hell of Abhidharma. After suffering, he returned to life, starving and destitute like this.\"",
        "source": "T04n0200_010:0252b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「欲知彼時斷母食者，今梨軍支比丘是。",
        "translation": "The Buddha told the monks, \"You want to know who then cut off his mother's food? This is the monk Lizunzhi.",
        "source": "T04n0200_010:0252b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由於往昔供養佛故，今得值我，出家得道。」",
        "translation": "Because he made offerings to the Buddha in the past, he was now able to meet me and leave home and attain the path.\"",
        "source": "T04n0200_010:0252b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸比丘，聞佛所說，歡喜奉行。",
        "translation": "The monks who then heard what the Buddha taught rejoiced and handed it down.",
        "source": "T04n0200_010:0252b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九五）◎唱言生死極苦緣",
        "translation": "(9:5) â€œThe monks sang that birth and death are extremely painful conditions.â",
        "source": "T04n0200_010:0252b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在舍衛國祇樹給孤獨園。",
        "translation": "The Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T04n0200_010:0252b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼城中，有一長者，財寶無量，不可稱計，選擇良賢，娉以為婦，作倡伎樂，以娛樂之。",
        "translation": "There was an elder in that city who had an incalculable amount of wealth and treasure, chose a good man to be his wife, and created music and plays to entertain her.",
        "source": "T04n0200_010:0252b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其婦懷妊，足滿十月，產一男兒，自憶宿命，產已唱言：「生死極苦。」",
        "translation": "When she was fully pregnant and had reached the tenth month, she gave birth to a boy. She remembered her past life and said after giving birth, \"Birth and death are extremely painful.\"",
        "source": "T04n0200_010:0252b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因為立字，名生死苦。",
        "translation": "Because they had created a character, it's called the suffering of birth-and-death.",
        "source": "T04n0200_010:0252b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "年漸長大，凡見人時，由故唱言生死極苦，然於父母師僧耆舊有德，慈心孝順，言常含笑，終不出於麁惡言語。",
        "translation": "As she grows older, whenever she meets people, she'll say, 'Birth-and-death is extremely painful,' but she's been kind and filial to her parents, teachers, monks, and senior citizens, always smiling when she speaks, and never says anything harsh or unpleasant.",
        "source": "T04n0200_010:0252b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將諸親友出城觀看，漸次遊行到祇桓中，見佛世尊，三十二相、八十種好，光明暉曜，如百千日，心懷歡喜，前禮佛足，却坐一面。",
        "translation": "They took their friends and relatives out of the city to look around, gradually marched into Jīvaka, and saw the Bhagavān, with his thirty-two features and eighty kinds of beauty and his radiance shining like a hundred thousand suns, rejoicing at heart, bowing their heads at the Buddha's feet, and withdrew to sit to one side.",
        "source": "T04n0200_010:0252b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即為其說四諦法，心開意解，得須陀洹果。",
        "translation": "The Buddha then taught him the teaching of the four truths, and he attained the fruit of stream entry with an open mind and a clear mind.",
        "source": "T04n0200_010:0252b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "歸辭父母，求索入道。",
        "translation": "He returned to his parents and sought to enter the path.",
        "source": "T04n0200_010:0252b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父母愛念，不能違逆，將詣佛所，求索出家。",
        "translation": "His parents loved him and couldn't disobey him, so he went to the Buddha and asked to leave home.",
        "source": "T04n0200_010:0252c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即告言：「善來比丘！」",
        "translation": "The Buddha then told them, \"Well done, monks!\"",
        "source": "T04n0200_010:0252c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬚髮自落，法服著身，便成沙門。",
        "translation": "With his hair falling off his beard and his Dharma robes on his body, he becomes an ascetic.",
        "source": "T04n0200_010:0252c02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精懃修習，得阿羅漢果，三明六通，具八解脫，諸天世人，所見敬仰。",
        "translation": "After diligently cultivating it, he attains the fruit of the arhat, the three kinds of insight, the six powers, and the eight liberations, which are seen and venerated by gods and humans.",
        "source": "T04n0200_010:0252c03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘，見是事已，白佛言：「世尊！",
        "translation": "After they saw this, the monks said to the Buddha, \"Bhagavān!",
        "source": "T04n0200_010:0252c05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此生死比丘，宿殖何福，生便能語，自憶宿命，又值如來，出家得道？」",
        "translation": "Now, what merit did this monk of birth and death accumulate in the past that made him able to speak after birth, recall his past life, and meet the Tathāgata to leave home and attain the path?\"",
        "source": "T04n0200_010:0252c06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，告諸比丘：「汝等善聽！",
        "translation": "It was then that the Bhagavān addressed the monks, \"All of you, listen well!",
        "source": "T04n0200_010:0252c07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾當為汝分別解說。",
        "translation": "\"I will explain it clearly for you.",
        "source": "T04n0200_010:0252c08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此賢劫中，人壽二萬歲，波羅奈國有佛出世，號曰迦葉。",
        "translation": "During this eon of good fortune, when his life was 20,000 years old, a Buddha named Kāśyapa appeared in the country of Polonai.",
        "source": "T04n0200_010:0252c09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼法中，有一沙彌，奉事和上。",
        "translation": "Among his teachings, there was a novice monk who served Vaiśravaṇa.",
        "source": "T04n0200_010:0252c10_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼城中，作大節會，爾時沙彌語和上言：『今節會日，宜早乞食，必當多獲。』",
        "translation": "At the time, a great festival was being held in that city, and the ascetic said to the Venerable, 'On this festival day, it's a good idea to beg for food early, for you'll surely get a lot of it.'",
        "source": "T04n0200_010:0252c11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師即答言：『日時故早，且可坐禪。』",
        "translation": "The teacher then replied, 'It's therefore early in the day, so you can sit and meditate.'",
        "source": "T04n0200_010:0252c13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二第三，如是白師，師猶不從。",
        "translation": "Second, and third, he said this to the master, but he still didn't obey him.",
        "source": "T04n0200_010:0252c13_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙彌瞋恚，惡口罵言：『今者何故不舍中死？』",
        "translation": "Angry, the śrāmaṇer rebuked him, saying, 'Why didn't you give up your midlife?'",
        "source": "T04n0200_010:0252c14_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，尋即出去，入城乞食，還歸所止，向師懺悔。",
        "translation": "After saying this, he went out, went into the city to solicit alms, returned to his lodging, and confessed to his teacher.",
        "source": "T04n0200_010:0252c15_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是業緣，五百世中，墮地獄中，受諸苦痛，今始得脫，是故唱言生死極苦。」",
        "translation": "Because of this action, I fell into hell and suffered pain for 500 lifetimes and was only now freed, which is why I say, 'Birth-and-death is extremely painful.'",
        "source": "T04n0200_010:0252c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「欲知彼時罵師沙彌者，今生死比丘是。」",
        "translation": "The Buddha addressed the monks, \"Would you like to know that the monk who then rebuked his teacher was the monk of birth-and-death today?\"",
        "source": "T04n0200_010:0252c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸比丘，聞佛所說，歡喜奉行。",
        "translation": "The monks then heard what the Buddha taught, rejoiced, and approved.",
        "source": "T04n0200_010:0253a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九六）◎長者身體生瘡緣",
        "translation": "(96) Śāriputra's Body Grows Sores",
        "source": "T04n0200_010:0253a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在舍衛國祇樹給孤獨園。",
        "translation": "The Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T04n0200_010:0253a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼城中，有一長者，財寶無量，不可稱計，選擇高門，娉以為婦，種種音樂，以娛樂之。",
        "translation": "There was an elderly man in that city who had treasures too great to be counted, chose a high gate, got married, and entertained himself with music of various kinds.",
        "source": "T04n0200_010:0253a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "足滿十月，產一男兒，身體有瘡，甚患苦痛，呻號叫喚，未曾休息。",
        "translation": "When he had reached the tenth month, he gave birth to a boy who had sores on his body and suffered great pain, moaning and shouting without rest.",
        "source": "T04n0200_010:0253a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "年漸長大，瘡皆潰爛，膿血橫流，常患疼痛，因為立字，名曰呻號。",
        "translation": "As he grew older, his sores all ulcerated, and pus and blood flowed freely, causing constant pain.",
        "source": "T04n0200_010:0253a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父母憐愍，設諸方藥，雖加療治，瘡無除愈。",
        "translation": "His parents took pity on him and prescribed prescriptions and medicines, but despite treatment, the sores never healed.",
        "source": "T04n0200_010:0253a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "年漸長大，聞諸人語：「祇桓精舍，有好良醫，善療眾病，能令除愈。」",
        "translation": "As he grew older, he heard people say, \"At the Jetavana monastery, there's a good doctor who treats many illnesses well and can heal them.\"",
        "source": "T04n0200_010:0253a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尋即往至，詣祇桓中，見佛世尊，三十二相、八十種好，光明暉曜，如百千日，心懷喜悅，前禮佛足，却坐一面。",
        "translation": "He went there, went to Jīvaka, and saw the Bhagavān, with his thirty-two features and eighty kinds of beauty and his radiance shining like a hundred thousand suns.",
        "source": "T04n0200_010:0253a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即為說五盛陰苦，是瘡是癰，如毒箭入心傷害於人，皆是眾病之根本也。",
        "translation": "The Buddha then explained for them the suffering of the five proliferating aggregates, which are sores and abscesses like poisoned arrows that enter the mind and injure people, and which are the root of many illnesses.",
        "source": "T04n0200_010:0253a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時呻號子，聞佛世尊說是語已，深自咎嘖，向佛世尊，懺悔罪咎，瘡尋除差，心懷歡喜，求索出家。",
        "translation": "After hearing the Bhagavān speak these words, the horned son deeply criticized himself, confessed his sins and faults to the Bhagavān, had his sores removed, and rejoiced at heart as he sought to leave home.",
        "source": "T04n0200_010:0253a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即告言：「善來比丘！」",
        "translation": "The Buddha then told him, \"Well done, monks!\"",
        "source": "T04n0200_010:0253a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬚髮自落，法服著身，便成沙門。",
        "translation": "With his hair falling off his beard and his Dharma robes on, he became an ascetic.",
        "source": "T04n0200_010:0253a19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精懃修道，得阿羅漢果。",
        "translation": "Striving for cultivation, he attained the fruit of the arhat.",
        "source": "T04n0200_010:0253a20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘，見是事已，白佛言：「世尊！",
        "translation": "After they saw this, the monks said to the Buddha, \"Bhagavān!",
        "source": "T04n0200_010:0253a21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此呻號比丘，宿造何業，初產之時，身有惡瘡，膿血橫流，甚可惡見？",
        "translation": "\"Now, what kind of activity did this monk with the moaning voice create in the past that caused his body to have bad sores and pus and blood flowing everywhere when he first gave birth, which is a terrible thing to see?",
        "source": "T04n0200_010:0253a22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以何緣，出家得道？」",
        "translation": "For what further reason did I leave home and attain the Way?\"",
        "source": "T04n0200_010:0253a23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，告諸比丘：「汝等諦聽！",
        "translation": "It was then that the Bhagavān addressed the monks, \"All of you, listen closely!",
        "source": "T04n0200_010:0253a24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾當為汝分別解說。",
        "translation": "\"I will explain it clearly for you.",
        "source": "T04n0200_010:0253a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往過去無量世時，波羅奈國，有二長者，各悉巨富，資財無量，因相忿諍。",
        "translation": "It was an eternity ago in the past in the country of Vārāṇasī that there were two elders, each of whom was enormously wealthy and had an incalculable amount of possessions, who were angry with each other.",
        "source": "T04n0200_010:0253a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其一長者，大齎珍寶，貢奉與王。",
        "translation": "One of those elders brought a great deal of treasure to the king and presented it to him.",
        "source": "T04n0200_010:0253a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王納受已，讒彼長者：『彼人惡心，常懷姧謀，規欲害我。",
        "translation": "After accepting it, the king slandered the elder, saying, 'That man has a bad heart and always harbors ulterior motives to harm me.",
        "source": "T04n0200_010:0253a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願大王！",
        "translation": "May it please the king!",
        "source": "T04n0200_010:0253a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聽我任意治彼長者。』",
        "translation": "'Listen to me as I rule that elder at will.'",
        "source": "T04n0200_010:0253a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即然可。",
        "translation": "The king then gave his assent.",
        "source": "T04n0200_010:0253b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尋至其家，執彼長者，繫縛搒笞，楚毒無量，舉身傷破，膿血橫流，痛不可言。",
        "translation": "He went to his house, seized the elder, bound him, beat him with fists and sticks, inflicting pain and suffering, wounding him, and causing him to bleed profusely, which is unspeakably painful.",
        "source": "T04n0200_010:0253b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼長者，既得免已，深自思惟：『有身皆苦，眾惡所集多諸災禍，甚可厭患。",
        "translation": "After he was spared, the elder thought to himself, 'All bodies are painful, and the many evils that collect there are numerous disasters and calamities that are very distressing.",
        "source": "T04n0200_010:0253b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於彼人，無大怨讐，橫見傷毀，乃至如此。』",
        "translation": "I have no great enmity toward that person, and I've been so vilified by what I've seen that it's come to this.'",
        "source": "T04n0200_010:0253b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即自思惟，詣山林中，觀察有為皆是無常，深悟解空，成辟支佛，視諸怨親，心皆平等。",
        "translation": "He then thought to himself, went to the mountains and forests, observed that all existent things are impermanent, deeply realized emptiness, and became a pratyekabuddha, viewing all his enemies and relatives as equal in mind.",
        "source": "T04n0200_010:0253b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念：『彼長者加惡於我，將來之世，墮於地獄，受大苦痛。",
        "translation": "He thought, 'That elder did me wrong and in a future life he'll fall into hell and experience great pain.",
        "source": "T04n0200_010:0253b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今當往為現神變，令彼開悟。』",
        "translation": "Now, I will go there and perform a miraculous transformation to make him awaken.'",
        "source": "T04n0200_010:0253b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，詣長者前，踊身虛空，作十八變。",
        "translation": "After he had this thought, he went to the elder, roused himself into space, and performed 18 transformations.",
        "source": "T04n0200_010:0253b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼長者，見是變已，深懷渴仰，倍生信敬，即請令坐，為設餚饍種種供養，向辟支佛懺悔先罪。」",
        "translation": "After he saw these transformations, the elder deeply desired them, became doubly devoted, invited him to sit down, prepared various offerings of food and drink, and confessed his prior sins to Pratibhāna.\"",
        "source": "T04n0200_010:0253b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「欲知彼時向彼國王讒其長者、考掠搒笞者，今呻號比丘是。」",
        "translation": "The Buddha told the monks, \"You want to know about the monk who slandered that king's elders, plundered them, and flogged them?\"",
        "source": "T04n0200_010:0253b13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸比丘，聞佛所說，歡喜奉行。",
        "translation": "The monks then heard what the Buddha taught, rejoiced, and approved.",
        "source": "T04n0200_010:0253b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎（九七）◎醜陋比丘緣佛在舍衛國祇樹給孤獨園。",
        "translation": "The Ugly Monk was in Anāthapiṇḍada Park in Jeta Grove in Śrāvastī, depending on the Buddha.",
        "source": "T04n0200_010:0253b15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼城中，有一長者，選擇高門，娉以為婦，作倡伎樂，以娛樂之。",
        "translation": "There was an elder in that city who chose a high gate, took his wife as his wife, and created music and plays to entertain her.",
        "source": "T04n0200_010:0253b17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其婦懷妊，足滿十月，產一男兒形貌極醜，狀似惡鬼，有人見者，捨之而去。",
        "translation": "When she was fully pregnant, she gave birth to a boy whose appearance was so ugly that he resembled a bad ghost.",
        "source": "T04n0200_010:0253b19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "年漸長大，父母厭患，駈令遠棄。",
        "translation": "As he grew older, his parents became disillusioned and ordered him to be abandoned.",
        "source": "T04n0200_010:0253b21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至畜生，見此醜陋，尚懷怖懼，何況人類？",
        "translation": "Even animals are afraid when they see such ugliness, so why should humans be afraid?",
        "source": "T04n0200_010:0253b21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又於一時，詣林樹間，採取花果，以自存活。",
        "translation": "At one point, they'll go into a forest among the trees and gather flowers and fruit to keep themselves alive.",
        "source": "T04n0200_010:0253b22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "飛鳥走獸，有見之者，無不怖畏，絕跡此林，無敢住者。",
        "translation": "The birds and beasts that fly and walk around see them are so frightened that they abandon the forest and don't dare to stay there.",
        "source": "T04n0200_010:0253b23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，常以慈悲，晝夜六時，觀察眾生，誰應可度輒往度之。",
        "translation": "At the time, the Bhagavān, always acting with compassion, observed sentient beings six times a day and night, asking who should be saved and then going to save them.",
        "source": "T04n0200_010:0253b25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知彼醜陋善根已熟、化度時到，佛告比丘：「我等今者，皆當往詣彼山林中化彼醜陋。」",
        "translation": "Knowing that that ugly person's good roots had matured and that the time had come to save them, the Buddha told the monks, \"Now, we will all go to that mountain forest and save that ugly person.\"",
        "source": "T04n0200_010:0253b26_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，將諸比丘，到山林中。",
        "translation": "It was then that the Bhagavān summoned the monks to the mountain grove.",
        "source": "T04n0200_010:0253b28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼醜陋，見佛世尊，即欲避走。",
        "translation": "When that ugly man saw the Bhagavān, he wanted to run away.",
        "source": "T04n0200_010:0253b29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以神力，使不得去。",
        "translation": "With miraculous powers, the Buddha prevented them from leaving.",
        "source": "T04n0200_010:0253c01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘，各在樹下，結跏趺坐，繫念在前。",
        "translation": "The monks then each sat cross-legged under a tree, fixing their attention in front of them.",
        "source": "T04n0200_010:0253c01_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，即便化作一醜陋人，執持應器，盛滿中食，漸向醜陋。",
        "translation": "The Bhagavān then even took the form of an ugly man who was carrying a container full of midday food and gradually approached the ugly man.",
        "source": "T04n0200_010:0253c02_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "醜陋見已，形狀類己，心懷喜悅：「今此人者真是我伴。」",
        "translation": "When the ugly man saw this, he looked like himself and was delighted, \"Now, this person really is my companion.\"",
        "source": "T04n0200_010:0253c04_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尋來共語，同器而食。",
        "translation": "He looks for them, speaks with them, and eats from the same vessel.",
        "source": "T04n0200_010:0253c05_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時此飯者，香味甘美，既食之已，時彼化人，忽然端政。",
        "translation": "The rice was delicious and fragrant, and after he ate it, the transformation man suddenly assumed control.",
        "source": "T04n0200_010:0253c06_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "醜陋問言：「汝今何故，忽然端政？」",
        "translation": "The ugly man asked, \"Why did you suddenly become well-adjusted?\"",
        "source": "T04n0200_010:0253c07_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化人答言：「我食此飯，兼以善心，觀彼樹下坐禪比丘，使我端政。」",
        "translation": "The transformation man replied, \"I ate this meal and, with a good heart, observed that monk sitting under the tree meditating, which made me behave properly.\"",
        "source": "T04n0200_010:0253c08_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "醜陋聞已，尋復效之，善心觀彼坐禪比丘，尋得端政。",
        "translation": "After hearing this, the ugly man tried to follow suit and observed that monk sitting under the tree in meditation with a good heart, and he found proper form.",
        "source": "T04n0200_010:0253c09_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心懷喜悅，即向化人，深生信解。",
        "translation": "Rejoicing in his heart, he went over to the transformation man and became deeply convinced.",
        "source": "T04n0200_010:0253c10_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時化人，還復本形。",
        "translation": "The person he had trained then returned to his original form.",
        "source": "T04n0200_010:0253c11_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "醜陋見佛，三十二相、八十種好，光明普曜，如百千日，前禮佛足，却坐一面。",
        "translation": "He was so ugly that he saw the Buddha with his thirty-two features and eighty beauties, and his light radiated everywhere like a hundred thousand suns, saluted the Buddha's feet, and withdrew to sit to one side.",
        "source": "T04n0200_010:0253c12_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即為其種種說法，心開意解，得須陀洹果，即於佛前，求索出家。",
        "translation": "The Buddha then spoke to him in various ways, opening his mind and understanding, and he attained the fruit of stream entry and asked to leave home before the Buddha.",
        "source": "T04n0200_010:0253c14_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即告言：「善來比丘！」",
        "translation": "The Buddha then told him, \"Well come, monk!\"",
        "source": "T04n0200_010:0253c15_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬚髮自落，法服著身，便成沙門。",
        "translation": "With his hair falling off his beard and his Dharma robes on, he became an ascetic.",
        "source": "T04n0200_010:0253c16_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精懃修道，得阿羅漢果。",
        "translation": "Striving for cultivation, he attained the fruit of the arhat.",
        "source": "T04n0200_010:0253c16_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘，見是事已，白佛言：「世尊！",
        "translation": "After they saw this, the monks said to the Buddha, \"Bhagavān!",
        "source": "T04n0200_010:0253c17_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此醜陋比丘，宿造何業，雖受人形，醜陋乃爾，復值世尊出家得道？」",
        "translation": "What kind of activity did this ugly monk create in the past that made him ugly even though he was given human form, and then he found the Bhagavān leaving home and attaining the path?\"",
        "source": "T04n0200_010:0253c18_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，告諸比丘：「汝等善聽！",
        "translation": "It was then that the Bhagavān addressed the monks, \"All of you, listen well!",
        "source": "T04n0200_010:0253c20_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾當為汝分別解說。",
        "translation": "\"I will explain it clearly for you.",
        "source": "T04n0200_010:0253c20_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往過去無量世中，波羅[木*奈]國有佛出世，號曰弗沙，在一樹下，結跏趺坐。",
        "translation": "In an eternity in the past, there was a Buddha named Pūrṇa who appeared in the world in the country of Bālā [munai], sitting cross-legged under a tree.",
        "source": "T04n0200_010:0253c21_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我及彌勒俱為菩薩，到彼佛所，種種供養，而翹一足，於七日中，說偈讚佛：「『天上世間無如佛，　　十方世界亦無有，　　世界所有悉能見，　　無有能及如佛者。』",
        "translation": "Maitreya and I, both bodhisattvas, went to that Buddha, made various offerings, bowed our heads once, and spoke a verse in praise of the Buddha for seven days, saying, 'There's no such Buddha up in heaven or in the world, nor is there one in the world in the ten directions, and all the world's possessors can be seen, but there's none like the Buddha.'",
        "source": "T04n0200_010:0253c23_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩，說是偈已，時彼山中，有一鬼神，作醜陋形，來恐怖我。",
        "translation": "\"After the bodhisattva spoke this verse, a demon in that mountain took on an ugly form and came to terrorize me.",
        "source": "T04n0200_010:0254a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以神力，令彼行處懸岸嶮岨不能得過。",
        "translation": "With my supernormal powers, I made it impossible for him to cross a precipitous mountain peak.",
        "source": "T04n0200_010:0254a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼山神，即作是念：『我以惡心恐怖他故，令我今者行處嶮難不可得過。",
        "translation": "That mountain spirit then thought, 'Because I've terrorized him with my bad thoughts, I've caused him to walk in a precipitous place that's impossible to cross.",
        "source": "T04n0200_010:0254a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今當往彼懺悔先罪。』",
        "translation": "Now, I will go there and repent of my past sins.'",
        "source": "T04n0200_010:0254a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，尋即往詣，懺悔訖已，發願而去。」",
        "translation": "After that thought, he went there, confessed his sins, made his vow, and departed.\"",
        "source": "T04n0200_010:0254a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「欲知彼時山神恐怖我者，今此醜陋人、得羅漢者是。",
        "translation": "The Buddha told the monks, \"You want to know about the mountain gods who were afraid of me, but this is the ugly man who attained arhatship.",
        "source": "T04n0200_010:0254a08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恐怖我故，五百世中，形體醜陋，見者驚走；皆由彼時懺悔辭退，遭值於我，出家得道。」",
        "translation": "Because of that fear of me, for 500 lifetimes he was so ugly that people who saw him were frightened away; it was because of that time that he repented and withdrew, found himself in my presence, and left home and attained the path.\"",
        "source": "T04n0200_010:0254a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸比丘，聞佛所說，歡喜奉行。",
        "translation": "The monks who then heard what the Buddha taught rejoiced and handed it down.",
        "source": "T04n0200_010:0254a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九八）◎恒伽達緣",
        "translation": "(98) -Honqadatta's Conditions",
        "source": "T04n0200_010:0254a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在波羅[木*奈]國鹿野苑中。",
        "translation": "The Buddha was in the Deer Preserve of Pola [Munai].",
        "source": "T04n0200_010:0254a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼國中，有一輔相，其家大富，然無兒息。",
        "translation": "At the time, there was an auxiliary minister in that country whose family was very wealthy but had no children.",
        "source": "T04n0200_010:0254a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時恒伽河邊，有摩尼䟦陀天祠，合土人民，皆共敬奉。",
        "translation": "At the time, there was a shrine to Maniputra by the Ganges River, which was worshipped by the people of the combined land.",
        "source": "T04n0200_010:0254a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時此輔相，往詣祠所，而呪之言：「我無子息，承聞天神有大功德，救護群生，能與其願，今故自歸。",
        "translation": "This auxiliary minister then went to the shrine and incanted, \"I have no children, but I've heard that the gods have great merit, aid sentient beings, and grant their vows, so now I'm returning.",
        "source": "T04n0200_010:0254a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若蒙所願，願賜一子，當以金銀莊校天身，及以名香，塗治神屋；如其無驗，當壞此廟，屎塗汝身。」",
        "translation": "If you are so encouraged and wish to grant me a son, I will adorn the god's body with gold and silver and decorate the god's house with famous incense; if that doesn't work, I will destroy this temple and smeared your body with dung.\"",
        "source": "T04n0200_010:0254a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天神聞已，自思惟言：「此人豪富，力勢強盛，非是凡品得為其子，我力尠少不能與願，願若不果，必見毀辱神廟。」",
        "translation": "After the god heard this, he thought to himself, \"This man is wealthy and powerful; he's not an ordinary person who could be his son; I'm too weak to grant him a cap, and if my vow isn't granted, I'll see the temple disgraced.\"",
        "source": "T04n0200_010:0254a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便復往白摩尼䟦陀。",
        "translation": "He then went back to Māṇiputra and told him.",
        "source": "T04n0200_010:0254a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩尼䟦陀力不能辦，便復往詣毘沙門王，自啟此事。",
        "translation": "Unable to accomplish this, Maniputra went back to King Vaiśravaṇa and asked him to reveal this.",
        "source": "T04n0200_010:0254a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毘沙門王言：「亦非我力能使有子。",
        "translation": "King Vaiśravaṇa said, \"It's not by my power that I could cause a child to exist.",
        "source": "T04n0200_010:0254a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尋詣天帝，從其求願。」",
        "translation": "Please go to Indra and grant his request.\"",
        "source": "T04n0200_010:0254a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毘沙門王即時上天，啟帝釋曰：「我有一臣摩尼䟦陀，近日見語，云波羅奈國有一輔相，從其求子，結立重誓，我願既遂，倍加供養；所願若違，當破我廟，而加毀辱。",
        "translation": "The Vaiśravaṇa king then went up to heaven and revealed to Indra, \"I have a minister, Maniputra, who recently saw and told me that there's an auxiliary minister in the country of Polonai who asked for a son from him and made a grave vow that once my wish is fulfilled, I'll doubly support him; if my wish is not fulfilled, my temple will be destroyed and humiliated.",
        "source": "T04n0200_010:0254a28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人豪兇，必能如是。",
        "translation": "That man is bold and fierce, and he's certainly capable of doing so.",
        "source": "T04n0200_010:0254b03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幸望天王！",
        "translation": "I'm grateful to the king of gods!",
        "source": "T04n0200_010:0254b04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令其有子。」",
        "translation": "Let him have a child.\"",
        "source": "T04n0200_010:0254b04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "帝釋答言：「斯事甚難！",
        "translation": "Tīrṣa replied, \"This is a difficult matter!",
        "source": "T04n0200_010:0254b04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當覓有緣。」",
        "translation": "You should seek out those who have a purpose.\"",
        "source": "T04n0200_010:0254b05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一天，五德離身，臨命欲盡。",
        "translation": "One day, the five virtues left his body, and he was about to reach the end of his life.",
        "source": "T04n0200_010:0254b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "帝釋告言：「卿今垂終，可願生彼輔相之家？」",
        "translation": "Tishra told him, \"Now that you're dying, would you like to be born in one of those auxiliary homes?\"",
        "source": "T04n0200_010:0254b06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天子答言：「意欲出家奉修正行，若生尊榮，離欲則難，欲在中流冀遂所願。」",
        "translation": "The gods replied, \"I want to leave home and train in the correct practices; if I were to be born in a place of honor, it would be difficult to part with my desires, and I want to be in the middle stream hoping to fulfill my vows.\"",
        "source": "T04n0200_010:0254b07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "帝釋復白：「但往生彼；若欲學道，吾當佐汝。」",
        "translation": "Tissadatta then replied, \"Only to be born there; if you want to train on the path, I will assist you.\"",
        "source": "T04n0200_010:0254b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天子命終，降神受胎輔相之家。",
        "translation": "When the gods' sons' lives ended, they descended into the spirit's womb and were reborn in the auxiliary family.",
        "source": "T04n0200_010:0254b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即生出外，形貌端政，即召相師，為兒立字。",
        "translation": "He was born outside, and his appearance was so dignified that he summoned a fortune teller to name his child.",
        "source": "T04n0200_010:0254b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "相師問曰：「本於何處求得此兒？」",
        "translation": "The fortune teller asked, \"Where did I first ask for this child?\"",
        "source": "T04n0200_010:0254b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "輔相答曰：「昔從恒伽天神求之。」",
        "translation": "The auxiliary replied, \"I used to ask the god Gaṅgā for this.\"",
        "source": "T04n0200_010:0254b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因為作字，名恒伽達。",
        "translation": "Because of that, he made up a name and was called Hangata.",
        "source": "T04n0200_010:0254b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "年漸長大，便啟父母求索出家。",
        "translation": "As he grew older, he asked his parents to allow him to leave home.",
        "source": "T04n0200_010:0254b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父母答言：「吾今富貴，生業弘廣，唯汝一子，當嗣門戶。",
        "translation": "His parents replied, \"Now, I'm rich and famous, and I've done extensive work in my lifetime.",
        "source": "T04n0200_010:0254b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾今存在，終不聽汝出家入道。」",
        "translation": "Now that I exist, I'll never allow you to leave home and enter the path.\"",
        "source": "T04n0200_010:0254b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兒不從志，深自惆悵，便欲捨身，更求凡處。",
        "translation": "Being deeply distressed that he didn't follow their wishes, the son wanted to abandon himself and seek another worldly abode.",
        "source": "T04n0200_010:0254b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「於中求出，必可易也。」",
        "translation": "\"Seeking escape from here will surely be easy.\"",
        "source": "T04n0200_010:0254b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是密去，自投山巖，既墮在地，無所傷損。",
        "translation": "He then left secretly, threw himself into a mountain cliff, and fell to the ground unscathed.",
        "source": "T04n0200_010:0254b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復至河邊，投身水中，水尋漂出，亦無所苦。",
        "translation": "He then went to the river's edge and plunged into the water, where the water found him floating out, but he didn't suffer anything either.",
        "source": "T04n0200_010:0254b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復取毒藥，而吞噉之，毒氣不行，無由致死。",
        "translation": "He then took some poison and devoured it, but the poisonous gas didn't work, so there was no way to kill him.",
        "source": "T04n0200_010:0254b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是念：「當犯官法，為王所殺。」",
        "translation": "Again, he thought, \"I'll violate the official's law and be killed by the king.\"",
        "source": "T04n0200_010:0254b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "值王夫人及諸婇女，出宮到園池中滲洗，解脫衣服，置林樹間。",
        "translation": "The king's wife and her daughters left the palace, went to the garden to wash themselves in a pond, took off their clothes, and put them among the trees.",
        "source": "T04n0200_010:0254b22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時恒伽達，密入林中，取其服飾，抱持而去。",
        "translation": "He then went into the forest secretly, took their clothing, carried it, and left.",
        "source": "T04n0200_010:0254b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "門監見之，即便將往，白阿闍世王。",
        "translation": "When the superintendent saw this, he went to tell King Ajātaśatru.",
        "source": "T04n0200_010:0254b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞此事，瞋恚隆盛，便取弓箭，自手射之；而箭還返，正向王身。",
        "translation": "When the king heard about this, his anger grew, so he took a bow and arrow, shot it with his own hand, and returned it right back at the king.",
        "source": "T04n0200_010:0254b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是至三，不能使中。",
        "translation": "He did this up to three times, but he couldn't get it to hit him.",
        "source": "T04n0200_010:0254b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王怖投弓，問彼人言：「卿為是天龍鬼神乎？」",
        "translation": "Afraid, the king threw his bow back and asked the man, \"Are you a god, dragon, or spirit?\"",
        "source": "T04n0200_010:0254b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恒伽達言：「賜我一願，乃敢自陳。」",
        "translation": "He said, \"Grant me one wish before I dare to present it to you.\"",
        "source": "T04n0200_010:0254b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：「當與。」",
        "translation": "The king said, \"I will grant it.\"",
        "source": "T04n0200_010:0254b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恒伽達言：「我非是天，亦非龍鬼，是舍衛國輔相之子。",
        "translation": "Hangada said, \"I'm not a god or a dragon or a ghost, but I'm the son of the auxiliary minister of Śrāvastī.",
        "source": "T04n0200_010:0254b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我欲出家，父母不聽，故欲自殺更生餘處，投巖赴河飲毒不死，故犯王法望得危命。",
        "translation": "I wanted to leave home, but my parents wouldn't listen, so I wanted to kill myself and be reborn somewhere else. I threw myself into a cliff and went to a river to drink poison and didn't die, so I violated the king's law and hoped to get a dangerous life.",
        "source": "T04n0200_010:0254c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王今加害，復不能中。",
        "translation": "Now, the king has tried to harm him, but he's still unable to win.",
        "source": "T04n0200_010:0254c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "事情如是，何酷之甚？",
        "translation": "How could this be so cruel?",
        "source": "T04n0200_010:0254c04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願垂憐愍，聽我為道。」",
        "translation": "Please have mercy on me and allow me to follow the path.\"",
        "source": "T04n0200_010:0254c05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王尋告曰：「聽汝出家。」",
        "translation": "The king looked into it and told him, \"I'll allow you to leave home.\"",
        "source": "T04n0200_010:0254c05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因復將到，詣於佛所，啟白世尊如向之事。",
        "translation": "He was again about to arrive, went to the Buddha, and revealed to the Bhagavān what had happened before.",
        "source": "T04n0200_010:0254c06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時如來，聽為沙門，法服在體，使為比丘。",
        "translation": "The Tathāgata then heard him become an ascetic, put his Dharma robes on his body, and made him a monk.",
        "source": "T04n0200_010:0254c07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛為說法，心開意解，得阿羅漢果，三明六通，具八解脫。",
        "translation": "The Buddha taught the Dharma for them, opened their minds and hearts, and they attained the fruit of the arhat, with the three insights, six supernormal powers, and eight liberations.",
        "source": "T04n0200_010:0254c08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿闍世王，尋白佛言：「世尊！",
        "translation": "King Ajātaśatru then looked for the Buddha and said, \"Bhagavān!",
        "source": "T04n0200_010:0254c09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此恒伽達，先世之時，種何善根，投山不死，墮水不溺，食毒無苦，箭射無傷，加遇世尊，得度生死？」",
        "translation": "What were the good roots planted by this Hanggada in a prior life that prevented him from dying when he threw himself into a mountain, from drowning when he fell into water, from suffering when he ate poison, from being wounded when an arrow shot him, and from meeting the Bhagavān and being saved from birth and death?\"",
        "source": "T04n0200_010:0254c10_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告王曰：「乃往過去無數世，時有一大國，名波羅[木*奈]國，其王名曰梵摩達多，將諸宮人林中遊戲，遣諸婇女輩激聲而歌。",
        "translation": "The Buddha told the king, \"Numerous times in the past, there was a large country named Bora[mu*nai] whose king was named Brahmadatta and who gathered his people in the palace to play in the forest and sent his women to sing with loud voices.",
        "source": "T04n0200_010:0254c12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外有一人，高聲和之。",
        "translation": "Outside, there was a man who raised his voice and sang along with them.",
        "source": "T04n0200_010:0254c15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞其聲，便生瞋妬，遣人捕來，勅使殺之。",
        "translation": "When the king heard his voice, he became angry and sent for someone to arrest him and order him to be killed.",
        "source": "T04n0200_010:0254c16_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有大臣，從外而來，見此一人而被囚執，何緣乃爾？",
        "translation": "A minister then came from the outside and saw this one person being held captive; what was the reason?",
        "source": "T04n0200_010:0254c17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其傍諸人具別事狀。",
        "translation": "The other people were in a different state of affairs.",
        "source": "T04n0200_010:0254c18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臣曰：『且停！",
        "translation": "The minister said, 'Stop!",
        "source": "T04n0200_010:0254c19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "待我見王。』",
        "translation": "Wait until I see the king.'",
        "source": "T04n0200_010:0254c19_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大臣進入，啟白王言：『彼人之罪，不至深重，何以害之？",
        "translation": "The minister entered and revealed to the king, saying, 'That man's crime isn't so serious; why would he do harm to him?'",
        "source": "T04n0200_010:0254c19_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖和其音，而不見形，既不交通姦婬之事，幸願垂怜，原其生命。』",
        "translation": "Although they harmonize with their voices but don't see their forms, they don't engage in sexual misconduct; please have mercy on them and spare their lives.'",
        "source": "T04n0200_010:0254c21_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王不能違，赦不刑戮。",
        "translation": "The king couldn't disobey him, so he pardoned and didn't punish him.",
        "source": "T04n0200_010:0254c22_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人得脫，奉事大臣，懃謹無替。",
        "translation": "That man was freed, and he served his minister with great diligence and without fail.",
        "source": "T04n0200_010:0254c23_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是承事多年，便自思惟：『婬欲傷人，利於刀劍，我之困厄，皆由欲故。』",
        "translation": "After serving him for many years in this way, he then thought to himself, 'Lust hurts people more than a sword, and my troubles and difficulties are all due to my desires.'",
        "source": "T04n0200_010:0255a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即語大臣：『聽我出家遵修道業。』",
        "translation": "He then said to the minister, 'Obey me when I leave home and follow the religious practices of the monastery.'",
        "source": "T04n0200_010:0255a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大臣答曰：『不敢相違，學若成道，還來相見。』",
        "translation": "The minister replied, 'I dare not contradict you; if I accomplish my training, I'll come back to see you again.'",
        "source": "T04n0200_010:0255a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即詣山澤，專思如理，精神開悟，成辟支佛，還來城邑，造大臣家。",
        "translation": "He then went to a mountain valley, concentrated his thoughts on the principle, became spiritually enlightened, became a pratyekabuddha, and returned to the city to visit the minister's home.",
        "source": "T04n0200_010:0255a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大臣見已，心大歡喜，請供養之，甘饍飲食，四事無乏。",
        "translation": "When the minister saw him, his heart rejoiced greatly, and he invited him to make offerings, providing him with delicious food and drink and no lack of the four things he needed.",
        "source": "T04n0200_010:0255a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時辟支佛，於虛空中，現神變化，身出水火，放大光明，大臣見之，欣然無量，便立誓願：『由我恩故，命得全濟，使我世世富貴長壽，殊勝奇特數千萬倍，令我智德相與共等。』」",
        "translation": "Seeing this, the minister was delighted beyond measure and made a vow, 'Because of my kindness, my life will be completely saved, which will give me prosperity and longevity throughout the world, be tens of millions of times more remarkable, and cause me to share the same level of wisdom and virtue.'\"",
        "source": "T04n0200_010:0255a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告王曰：「時彼大臣救活一人令得脫者，今恒伽達是。",
        "translation": "The Buddha told the king, \"That minister saved the life of one person and made him free, and now he's Hanggada.",
        "source": "T04n0200_010:0255a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是因緣，所生之處，命不中夭，今得值我，逮得應真。」",
        "translation": "Because of this cause, he was born in a place where his life wouldn't die in the middle, and now he's found me and has attained the truth.\"",
        "source": "T04n0200_010:0255a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此已，諸在會者，信敬歡喜，頂戴奉行。",
        "translation": "After the Buddha said this, those present at the meeting believed, respected, rejoiced, and bowed their heads in deference.",
        "source": "T04n0200_010:0255a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九九）◎長爪梵志緣",
        "translation": "（Long-clawed Brahmā's Condition",
        "source": "T04n0200_010:0255a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在王舍城迦蘭陀竹林。",
        "translation": "The Buddha was in the Kalandaka Bamboo Grove of Rājagṛha.",
        "source": "T04n0200_010:0255a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼城中，有一梵志，名曰蛭駛。",
        "translation": "In that city, there was a priest named Heejak.",
        "source": "T04n0200_010:0255a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有其二子，男名長爪，女字舍利。",
        "translation": "He had two sons, a boy named Nagarjuna and a girl named Śāriputra.",
        "source": "T04n0200_010:0255a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其男長爪，聰明博達，善能論議，常共其姊舍利，凡所論說，每常勝姊；姊既妊娠，共弟論議，弟又不如。",
        "translation": "The son, Changchao, was wise and learned, and he could well discourse with his sister, Śāriputra, and always outshined her in whatever she taught; when the sister became pregnant, she would discourse with the brother, but the brother was not as good.",
        "source": "T04n0200_010:0255a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時弟長爪，而作是言：「我姉先來，共我論議，常不如我，懷妊以來，論議殊勝，乃是胎子福德之力。",
        "translation": "The younger brother, Changchao, then said, \"My sister used to be inferior to me when she and I used to discuss things together, but since she was pregnant, her discussions have been outstanding because of the power of the fetus's merits.",
        "source": "T04n0200_010:0255a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若子生已，論必勝我。",
        "translation": "If the child is born, the discussions will be superior to mine.",
        "source": "T04n0200_010:0255a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今當宜遊方廣學四韋陀典十八種術，然後還國與[外*男]甥論。」",
        "translation": "Now, I should travel around and study extensively the 18 techniques of the Four Vedas, then return to my country and discuss them with my [male] nephew.\"",
        "source": "T04n0200_010:0255a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，詣南天竺，習學諸論，「若未通利為第一師，誓不剪爪。」",
        "translation": "After thinking this, she went to southern India to study the treatises, saying, \"If I don't become the best teacher by understanding them, I promise not to cut my claws.\"",
        "source": "T04n0200_010:0255a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是其姊，日月滿足，產一男兒，因母立名，字曰舍利弗，端政殊特，聰明黠慧，博達諸論，難可詶對。",
        "translation": "His sister then, fulfilled by the sun and moon, gave birth to a boy named Śāriputra, who was distinguished for his mother's work, intelligent, and wise, and well-versed in the treatises, which were difficult to answer.",
        "source": "T04n0200_010:0255a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王舍城中諸梵志等，擊大金鼓，招集國人十八億眾，會乎論場，敷四高座。",
        "translation": "At the time, the priests in the city of Rājagṛha beat a great golden drum and gathered 1.8 billion people from the country into the discussion site, where they spread out four high seats.",
        "source": "T04n0200_010:0255b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗，年始八歲，會乎論場，問諸人言：「敷四高座，為欲待誰？」",
        "translation": "Śāriputra, who was just eight years old, assembled in the discussion site and asked the people, \"Who are the four high seats meant for?\"",
        "source": "T04n0200_010:0255b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人答言：「一為國王，二為太子，三為大臣，四為論士。」",
        "translation": "The people replied, \"One is a king, two are princes, three are ministers, and four are pundits.\"",
        "source": "T04n0200_010:0255b04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗，聞是語已，輒昇論士高座而坐其上。",
        "translation": "After hearing these words, Śāriputra quickly ascended to the high seat of the advocate and sat down on it.",
        "source": "T04n0200_010:0255b06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸宿德耆舊梵志，一切時眾，無不驚怪，作是念言：「我諸論士，共彼小兒，論議得勝，不足為榮；其若不勝，大可恥愧。」",
        "translation": "The senior priests of long standing and all the people of the time were surprised and thought, \"It's not enough to honor our pundits and their juniors to win an argument, but it would be a great shame if they didn't win.\"",
        "source": "T04n0200_010:0255b07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，即遣下座小婆羅門，共舍利弗論，粗相答問。",
        "translation": "After this thought, he sent the junior brāhmaṇa from the lower seats to discuss with Śāriputra and roughly answer his questions.",
        "source": "T04n0200_010:0255b10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門等，辭窮理屈，漸次相推，遂至上座，其論議不過數返，盡皆不如。",
        "translation": "The brāhmaṇas then exhausted their arguments and gradually pushed each other to the upper seats, where their discussions were no more than a few returns and all of them were unsatisfactory.",
        "source": "T04n0200_010:0255b11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗，論議既勝，名聲遠著於十六大國，智慧博通獨出無侶。",
        "translation": "Śāriputra then, having surpassed them in discourse, became famous far and wide in 16 large countries, and his extensive wisdom was unparalleled.",
        "source": "T04n0200_010:0255b13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後於一時，於王舍城，昇高樓上，四顧視瞻，見城內人節慶聚會，便自思惟：「斯等蠢蠢百年之後，廓然歸無。」",
        "translation": "One time later, he rose from a high building in Rājagṛha and looked around as he saw the festival-goers in the city.",
        "source": "T04n0200_010:0255b14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，即下高樓，外道法中，出家求道。",
        "translation": "After that thought, he descended from that high building, went to live among the teachings of non-Buddhists, and left home to pursue the path.",
        "source": "T04n0200_010:0255b17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，初始成佛，時十六大國，都未聞知，如來大慈欲教化故，遣阿鞞比丘，詣王舍城，分衛乞食。",
        "translation": "At the time the Bhagavān first became buddha, sixteen large countries hadn't heard of him, so the Tathāgata, with great compassion and a desire to teach, sent monks from Abhijit to Rājagṛha to solicit alms.",
        "source": "T04n0200_010:0255b18_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗，見其威儀詳序可觀，作是念言：「斯是何人，福德乃爾？",
        "translation": "Śāriputra then, seeing his manner in fine order and respectable, had this thought, \"Who is this man of such virtue?",
        "source": "T04n0200_010:0255b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我從先來，未見此比丘。」",
        "translation": "I haven't seen this monk since I was here.\"",
        "source": "T04n0200_010:0255b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，即前問曰：「汝事何師，法則乃爾？」",
        "translation": "After he thought this, he went forward and asked, \"Which teacher are you working for, and what's the rule of the Dharma?\"",
        "source": "T04n0200_010:0255b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿鞞比丘，說偈答曰：「吾師天中天，　　三界無極尊，　相好身丈六，　　神通遊虛空。」",
        "translation": "The monk Abhijit then spoke a verse in reply, \"My teacher is a god of gods, the supreme one in the three realms, whose well-proportioned body is six feet long and whose supernormal powers roam through space.\"",
        "source": "T04n0200_010:0255b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿鞞比丘，說是偈已，默然而住。",
        "translation": "After speaking this verse, the monk Ābhidharma quietly waited.",
        "source": "T04n0200_010:0255b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗，語阿鞞言：「汝師容貌神通，我久已聞。",
        "translation": "Śāriputra then said to Ābhidharma, \"I've heard about your teacher's appearance and superknowledge for a long time.",
        "source": "T04n0200_010:0255b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為悟何道，得如是乎？」",
        "translation": "What path did you understand that would lead to this?\"",
        "source": "T04n0200_010:0255b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿鞞比丘，復以偈答：「花熏去五陰，　　拔斷十二根，　不貪天世樂，　　心淨開法門。」",
        "translation": "Again, the monk Abhijit replied in verse, \"The flowers perfume the five aggregates, uproot the twelve faculties, stop craving the pleasures of the gods, and purify the mind to open the Dharma door.\"",
        "source": "T04n0200_010:0255b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗，復問阿鞞比丘言：「汝師所說，為經幾時？",
        "translation": "Śāriputra then again asked the monk Ābhidharma, \"How long did your teacher teach this?",
        "source": "T04n0200_010:0255c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "習學何法？」",
        "translation": "What dharma is being practiced?\"",
        "source": "T04n0200_010:0255c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿鞞比丘，復以偈答：「我年既幼稚，　　學日有初淺，　豈能宣正真，　　如來廣大義？」",
        "translation": "Again, the monk Abhijit replied in verse, \"Since I'm so young and my days of study are so short, how could I have proclaimed the true and vast meaning of the Tathāgata?\"",
        "source": "T04n0200_010:0255c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗，復語阿鞞言：「汝師所說，幸見告示。」",
        "translation": "Śāriputra then again said to Ābhidharma, \"It's good to see a notice of what your teacher has taught.\"",
        "source": "T04n0200_010:0255c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿鞞，復以偈答：「一切諸法中，　　因緣空無主，　息心達本原，　　故號為沙門。」",
        "translation": "Ābhidharma then replied with another verse, \"Among all the dharmas, causes and conditions are empty and have no subject, and stopping the mind to reach the origin is why we're called an ascetic.\"",
        "source": "T04n0200_010:0255c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗，聞此偈已，心即開悟，得須陀洹果。",
        "translation": "After hearing this verse, Śāriputra's mind was immediately enlightened, and he attained the fruit of stream entry.",
        "source": "T04n0200_010:0255c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時目連見舍利弗顏色怡悅，而問之言：「我昔與汝，先有要誓，若有先得甘露法味，要當相語。",
        "translation": "Seeing Śāriputra's pleasant countenance, Maudgalyāyana asked him, \"In the past, I made a vow with you that if you first attained the taste of the ambrosia dharma, I would tell you about it.",
        "source": "T04n0200_010:0255c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今觀汝，以有所得，顏色怡悅。」",
        "translation": "Now, I see you, because you have attained it, your color is pleasant.\"",
        "source": "T04n0200_010:0255c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗，即以上偈，為其目連三遍說之。",
        "translation": "Śāriputra then spoke the above verse three times for Maudgalyāyana.",
        "source": "T04n0200_010:0255c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連聞已，心開意解，得須陀洹果。",
        "translation": "After hearing it, Maudgalyāyana's mind was enlightened and his thoughts were liberated, and he attained the fruit of stream entry.",
        "source": "T04n0200_010:0255c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗、目連，各獲道跡，心懷歡喜，還自徒眾，具以上事，而向說之。",
        "translation": "Śāriputra and Maudgalyāyana then each attained the steps of the path, and rejoicing in their hearts, they returned to their group, explained the above to them, and described it to them.",
        "source": "T04n0200_010:0255c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「我今欲詣求佛出家，汝等云何？」",
        "translation": "\"Now, I want to go to the Buddha to leave home, so what do you say?\"",
        "source": "T04n0200_010:0255c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸弟子，各白師言：「大師今者若當習學瞿曇所說，我弟子等亦當隨從。」",
        "translation": "The disciples then each said to their teacher, \"If you, Great Master, will now study what the Gautama taught, my disciples will also follow suit.\"",
        "source": "T04n0200_010:0255c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗、目連聞是語已，將諸弟子各二百五十人，隨阿鞞比丘，詣於竹林。",
        "translation": "After Śāriputra and Maudgalyāyana heard these words, they gathered 250 of their disciples with Abhijit Bhikṣu and went to the bamboo grove.",
        "source": "T04n0200_010:0256a01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見佛世尊，三十二相、八十種好，光明普曜如百千日，心懷歡喜，前禮佛足，求索出家。",
        "translation": "Seeing the Bhagavān, with his thirty-two features and eighty beauties and his light shining like a hundred thousand suns, they rejoiced, bowed their heads at the Buddha's feet, and asked him to leave home.",
        "source": "T04n0200_010:0256a02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即聽許：「善來比丘！」",
        "translation": "The Buddha then gave his approval, \"Well come, monks!\"",
        "source": "T04n0200_010:0256a04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬚髮自落，法服著身，便成沙門。",
        "translation": "With his hair falling off his beard and his Dharma robes on his body, he becomes an ascetic.",
        "source": "T04n0200_010:0256a05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精懃修習，得阿羅漢果，三明六通，具八解脫，諸天世人之所敬仰。",
        "translation": "He diligently cultivated it and attained the fruit of the arhat, the three kinds of insight, the six powers, and the eight liberations, and was venerated by gods and humans.",
        "source": "T04n0200_010:0256a06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時長爪梵志，聞舍利弗出家入道，瞋恚懊惱，而作是言：「我此[外*男]甥舍利弗，稟性聰慧博通群籍，十六大國宿舊論師咸服其德，如何忽然捨此高名奉事瞿曇？」",
        "translation": "It was then that a priest with long claws heard that Śāriputra had left home and entered the path, and he was angered and upset, saying, \"My [male] nephew Śāriputra is a man of intelligence and wisdom who has a thorough knowledge of many books, and his virtues are well received by the senior scholars of 16 large countries.",
        "source": "T04n0200_010:0256a07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即從南天竺來詣佛所，與佛論議。",
        "translation": "He then came from southern India to the Buddha and had a discussion with him.",
        "source": "T04n0200_010:0256a11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，告梵志曰：「汝今所見，非是究竟涅槃之道。」",
        "translation": "The Bhagavān then addressed the priest, \"What you've seen now is not the path to final nirvāṇa.\"",
        "source": "T04n0200_010:0256a12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼梵志，聞是語已，默然不答。",
        "translation": "After hearing those words, the priest remained silent and didn't answer.",
        "source": "T04n0200_010:0256a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是三問，亦復默然。",
        "translation": "He was also silent when he was asked these three questions.",
        "source": "T04n0200_010:0256a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時金剛密迹於虛空中以金剛杵擬梵志頂：「汝若不答，我以此杵碎破汝身。」",
        "translation": "The vajra master then pointed a vajra pounder at the priest's head in the sky and said, \"If you don't answer, I will smash your body with this pounder.\"",
        "source": "T04n0200_010:0256a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時梵志，心懷惶怖，流污抆垢，無所歸趣，即自引負，寄顏無所，便於佛前，心懷敬伏，求索出家，為佛弟子。",
        "translation": "At that point, the priest, frightened, defiled, and without a place to go, took upon himself the burden of having no place to turn, and then went before the Buddha with respect and dignity in his heart, seeking to leave home and become a disciple of the Buddha.",
        "source": "T04n0200_010:0256a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即聽許：「善來比丘！」",
        "translation": "The Buddha then gave his approval, \"Well done, monks!\"",
        "source": "T04n0200_010:0256a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬚髮自落，法服著身，便成沙門。",
        "translation": "With his hair falling off his beard and his Dharma robes on, he became an ascetic.",
        "source": "T04n0200_010:0256a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精懃修道，得阿羅漢果。",
        "translation": "Striving for cultivation, he attained the fruit of the arhat.",
        "source": "T04n0200_010:0256a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘，見是事已，白佛言：「世尊！",
        "translation": "After they saw this, the monks said to the Buddha, \"Bhagavān!",
        "source": "T04n0200_010:0256a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此梵志比丘，宿殖何福，捨邪就正，值佛世尊，出家得道？」",
        "translation": "What merit did this priestly monk accumulate in the past that led him to abandon wrong and turn to right, to meet the Bhagavān, and to leave home and attain the path?\"",
        "source": "T04n0200_010:0256a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，告諸比丘：「汝等諦聽！",
        "translation": "It was then that the Bhagavān addressed the monks, \"All of you, listen closely!",
        "source": "T04n0200_010:0256a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾當為汝分別解說。",
        "translation": "I will discern and explain it for you.",
        "source": "T04n0200_010:0256a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往過去無量世時，波羅[木*奈]國有辟支佛，在於山林坐禪思惟。",
        "translation": "It was an eternity ago in the past that there was a pratyekabuddha in the country of Pola [munai] who was sitting in a mountain grove, meditating and reflecting.",
        "source": "T04n0200_010:0256a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有五百群賊，劫掠他物，將欲入彼山林樹間。",
        "translation": "At the time, there were five hundred bandits who were about to plunder other goods and enter that mountain forest among the trees.",
        "source": "T04n0200_010:0256a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼賊帥，先遣一人，往看林中無有人不。",
        "translation": "The commander of the bandits first sent one of his men to see if there was anyone in the forest.",
        "source": "T04n0200_010:0256a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見辟支佛在一樹下端坐思惟，即前牽捉，繫縛將來，到賊帥邊，欲共殺之。",
        "translation": "When he saw Pratibhāna sitting under a tree, he sat down to meditate, grabbed him, bound him, and went over to the commander of the thieves, intending to kill him with him.",
        "source": "T04n0200_010:0256a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時辟支佛，作是念言：『我若默然，為彼所殺，增其罪業，墜墮地獄，無由出期。",
        "translation": "That pratyekabuddha then had this thought, 'If I had remained silent, I would have been killed by that person, which would have increased my crimes and caused me to fall into hell, from which there's no way out.",
        "source": "T04n0200_010:0256b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今當為現於神變，令彼信伏。』",
        "translation": "Now, I will perform a miraculous transformation for them and convince them to subdue me.'",
        "source": "T04n0200_010:0256b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，身昇虛空，東踊西沒，南踊北沒，身出水火，或現大身，滿虛空中，而復現小，如是展轉，作十八變。",
        "translation": "After he thinks this, his body rises into the sky, rises in the east and falls in the west, rises in the south and falls in the north, his body emerges from the water and fire, or he appears large, fills the sky, and then appears small again, and thus transforms himself into 18 miracles.",
        "source": "T04n0200_010:0256b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時群賊，見是變已，甚懷惶怖，即便各各五體投地，歸誠懺悔。",
        "translation": "After seeing these transformations, the bandits were terrified and threw themselves to the ground with five bodies, repenting sincerely.",
        "source": "T04n0200_010:0256b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時辟支佛，受其懺已，設諸餚饍，請辟支佛，發願而去。",
        "translation": "After accepting their repentance, the Vairocana Buddha provided food and drink, invited the Vairocana Buddha, and made a vow to leave.",
        "source": "T04n0200_010:0256b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣是功德，無量世中，不墮地獄、畜生、餓鬼，天上人中，受天快樂，乃至今者，遭值於我，出家得道。」",
        "translation": "Because of this merit, for measureless lifetimes they won't fall into hell, animals, or hungry ghosts; up in heaven or among humans, they'll enjoy the pleasures of gods; or even now, they'll meet me and leave home and attain the path.\"",
        "source": "T04n0200_010:0256b09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘：「欲知彼時賊帥人者，今長爪梵志比丘是。」",
        "translation": "The Buddha told the monks, \"If you want to know about that person who was the commander of the thieves, this is the monk Brahmā with the long claws.\"",
        "source": "T04n0200_010:0256b12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸比丘，聞佛所說，歡喜奉行。",
        "translation": "The monks then heard what the Buddha taught, rejoiced, and approved.",
        "source": "T04n0200_010:0256b13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（一〇〇）◎孫陀利端政緣",
        "translation": "(100) - Sundarī Tenzin",
        "source": "T04n0200_010:0256b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在王舍城迦蘭陀竹林。",
        "translation": "The Buddha was in the Kalandaka's Bamboo Grove of Rājagṛha.",
        "source": "T04n0200_010:0256b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時波斯匿王夫人懷妊，足滿十月，產一男兒，容貌端政，世所無比，兩目明淨如拘那羅鳥。",
        "translation": "The wife of King Prasenajit was pregnant for the full ten months when she gave birth to a boy whose appearance was unsurpassed in the world and whose eyes were as clear as the Kunaraketu.",
        "source": "T04n0200_010:0256b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王因名字拘那羅。",
        "translation": "The king then gave his name to Kunala.",
        "source": "T04n0200_010:0256b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "著諸瓔珞上妙衣服，遣人抱行，遍諸聚落，問諸人言：「世間叵有如似我兒端政者不？」",
        "translation": "He put on bejeweled robes of the finest quality, sent people to carry him throughout the villages, and asked them, \"Is there anyone in the world like my son, Kunaraja?\"",
        "source": "T04n0200_010:0256b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時聚落中，有諸商人，白大王言：「願王見恕！",
        "translation": "There were merchants in the village who said to the great king, \"May the king see fit to forgive them!",
        "source": "T04n0200_010:0256b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "施我無畏，乃敢陳說。」",
        "translation": "Giving me fearlessness, I then dared to explain it.\"",
        "source": "T04n0200_010:0256b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即答言：「但道莫畏。」",
        "translation": "The king then replied, \"Just say don't be afraid.\"",
        "source": "T04n0200_010:0256b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是商人白大王言：「我所居止聚落之中，有一小兒，字孫陀利，端政殊妙，容貌似天，勝於王子，百千萬倍，不可為比。",
        "translation": "The merchant then said to the king, \"In the village where I live, there's a little boy named Sundarī with marvelous ways and features that resemble those of a god, a hundred million times better than a prince, and he's incomparable.",
        "source": "T04n0200_010:0256b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又兒產時，舍內自然有一涌泉，香水冷美，有諸珍寶，充滿其中。」",
        "translation": "When that child is born, there's a spring that naturally wells up inside his abode, with cold, beautiful perfume and treasures that fill it.\"",
        "source": "T04n0200_010:0256b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時波斯匿王，聞商人語，尋即遣使勅彼聚落云：「我自當往彼觀孫陀利。」",
        "translation": "When King Prasenajit heard what the merchant said, he immediately sent an envoy to that village, telling it, \"I myself will go there to see Sundarī.\"",
        "source": "T04n0200_010:0256b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時聚落主，聞王欲來看孫陀利，便共議言：「王今來者，用何瞻待？",
        "translation": "When the village leaders heard that the king wanted to come to see Sundarī, they all agreed, saying, \"What do you expect from the king now that he's here?",
        "source": "T04n0200_010:0256b29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不如先送。」",
        "translation": "Why don't you send him first?\"",
        "source": "T04n0200_010:0256c01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是議已，即便莊嚴孫陀利，著諸瓔珞上妙服飾，往送與王。",
        "translation": "After he gave this advice, he adorned Sundarī with a collection of ornaments and fine clothing and sent it to the king.",
        "source": "T04n0200_010:0256c02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王見孫陀利，端政殊妙，世所無比，深生疑怪，歎未曾有。",
        "translation": "When the king saw Sundarī, his finery was marvelous and unsurpassed in the world, he had profound doubts and wondered about it, admiring it as unprecedented.",
        "source": "T04n0200_010:0256c03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即將小兒，往至佛所，欲問所由受如是身？",
        "translation": "He then took his youngest child to the Buddha and wanted to know how he had come to accept such a body.",
        "source": "T04n0200_010:0256c04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "小兒見佛，三十二相、八十種好，光明普曜如百千日，心懷歡喜，前禮佛足，却坐一面。",
        "translation": "When the boy saw the Buddha with his thirty-two features and eighty beauties and his light shining like a hundred thousand suns, he was overcome with joy, saluted the Buddha's feet, and withdrew to sit to one side.",
        "source": "T04n0200_010:0256c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即為其說四諦法，心開意解，得須陀洹果，求索出家。",
        "translation": "The Buddha then taught him the teaching of the four truths, and his mind was enlightened and his thoughts liberated. He attained the fruit of stream entry and asked to leave home.",
        "source": "T04n0200_010:0256c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即告言：「善來比丘！」",
        "translation": "The Buddha then told him, \"Well come, monk!\"",
        "source": "T04n0200_010:0256c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬚髮自落，法服著身，便成沙門。",
        "translation": "With his hair falling out, he put on the Dharma robe and became an ascetic.",
        "source": "T04n0200_010:0256c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精懃修習，未久之間，得阿羅漢果。",
        "translation": "After diligently cultivating it, he attained the fruit of the arhat before long.",
        "source": "T04n0200_010:0256c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時波斯匿王，見是事已，白佛言：「世尊！",
        "translation": "After he saw this, King Prasenajit said to the Buddha, \"Bhagavān!",
        "source": "T04n0200_010:0256c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此孫陀利比丘，宿殖何福，生時自然，有此泉水及諸珍寶，充滿其中，又值世尊，出家得道？」",
        "translation": "What merit did this monk Sundarī possess from long ago that when he was born, he naturally had this spring and its treasures filled with water, and that he found the Bhagavān and left home and attained the path?\"",
        "source": "T04n0200_010:0256c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，告波斯匿王：「汝今諦聽！",
        "translation": "It was then that the Bhagavān addressed King Prasenajit, \"Now listen closely!",
        "source": "T04n0200_010:0256c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾當為汝分別解說。",
        "translation": "I will explain it clearly for you.",
        "source": "T04n0200_010:0256c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此賢劫中，波羅[木*奈]國有佛出世，號曰迦葉，有一萬八千比丘，在山林中，坐禪行道。",
        "translation": "During the eons of goodness, there was a Buddha named Kāśyapa who appeared in the country of Pola [munai], and there were 18,000 monks sitting in the mountains and forests, meditating and practicing.",
        "source": "T04n0200_010:0256c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有長者，偶行值見，心懷歡悅，即還歸家，備辦香水，澡浴眾僧，設諸餚饍供養訖竟，復以珍寶投之瓫水，奉施眾僧，發願而去。",
        "translation": "An elderly man who happened to see them on an occasional visit was so encouraged that he returned home, prepared perfume, bathed the monks, prepared meals and offerings, threw his treasures into a jar of water, gave them to the monks, and vowed to leave.",
        "source": "T04n0200_010:0256c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣是功德，不墮惡趣，天上人中，常有池水珍寶隨其俱生。」",
        "translation": "Based on this merit, they won't fall into a bad destiny and will always have pools of water and treasures growing alongside them in heaven and among humans.\"",
        "source": "T04n0200_010:0256c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告大王：「欲知彼時大長者子，澡浴眾僧設供養故，常得端正者，今孫陀利比丘是。」",
        "translation": "The Buddha told the king, \"Suppose you want to know about that great eldest son who always attains correctness because he washes the saṃgha and makes offerings to them, and that's the monk Sundarī now.\"",
        "source": "T04n0200_010:0256c22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大王聞佛所說，歡喜奉行。",
        "translation": "The king then heard what the Buddha taught, rejoiced, and approved.",
        "source": "T04n0200_010:0256c24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "撰集百緣經卷第十",
        "translation": "Collected Documents: The Sutra of the Hundred Conditions, Volume 10",
        "source": "T04n0200_010:0257a02_0",
        "is_bad_quality": false
    }
]