[
    {
        "source_sentence": "大莊嚴論經卷第三",
        "translation": "Dazhuangyanlun jing, vol. 3",
        "source": "T04n0201_003:0268c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "馬鳴菩薩造後秦三藏鳩摩羅什譯",
        "translation": "Translated by Kumārajīva, the Tripiṭaka of the Latter Qin Dynasty",
        "source": "T04n0201_003:0268c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（一一）復次，若有弟子能堅持戒為人宗仰，一切世人并敬其師。",
        "translation": "(11) Furthermore, if a disciple firmly upholds the precepts and is held in high regard by others, all the world will respect that person as a teacher.",
        "source": "T04n0201_003:0268c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔曾聞，有諸比丘曠野中行，為賊剽掠剝脫衣裳。",
        "translation": "I once heard that there were monks walking in the wilderness who were plundered by thieves and stripped of their robes.",
        "source": "T04n0201_003:0268c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時此群賊懼諸比丘往告聚落，盡欲殺害。",
        "translation": "Fearing the monks, this group of thieves went to the village and tried to kill them.",
        "source": "T04n0201_003:0268c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賊中一人先曾出家，語同伴言：「今者何為盡欲殺害？",
        "translation": "One of the thieves, who had previously left home, said to his companions, \"Why do you want to kill them all now?",
        "source": "T04n0201_003:0268c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘之法不得傷草，今若以草繫諸比丘，彼畏傷故終不能得四向馳告。」",
        "translation": "A monk's dharma doesn't allow him to harm grass, but if he ties grass around monks now, they'll never be able to rush in four directions out of fear of harming him.\"",
        "source": "T04n0201_003:0268c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賊即以草而繫縛之，捨之而去。",
        "translation": "The thief then tied him up with grass, bound him, and left him.",
        "source": "T04n0201_003:0268c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘等既被草縛，恐犯禁戒不得挽絕，身無衣服為日所炙，蚊虻蠅蚤之所唼嬈，從旦被縛至於日中，轉到日沒晦冥大闇，夜行禽狩交橫馳走，野狐群鳴鵄梟雊呼，惡聲啼叫甚可怖畏。",
        "translation": "Once they were tied up in grass, the monks feared violating the precept and couldn't be stopped, so they were left without clothing, scorched by the sun, and gored by mosquitoes, stinging insects, and fleas.",
        "source": "T04n0201_003:0268c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有老比丘語諸年少：「汝等善聽！",
        "translation": "An elderly monk told the youths, \"Listen well, you guys!",
        "source": "T04n0201_003:0268c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人命促短如河駛流，設處天堂不久磨滅，況人間命而可保乎？",
        "translation": "Human life is as short as a river flowing downstream, and if we were in paradise, it wouldn't be long before it was obliterated, so how could human life be preserved?",
        "source": "T04n0201_003:0268c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命既不久，云何為命而毀禁戒？",
        "translation": "Since his life is short, why would he violate the precepts for his life?",
        "source": "T04n0201_003:0268c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人當知！",
        "translation": "All of you should know this!",
        "source": "T04n0201_003:0268c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人身難得，佛法難值，諸根難具，信心難生，此一一事皆難值遇，譬如盲龜值浮木孔。",
        "translation": "The human body is difficult to obtain, the Buddha's teaching is difficult to attain, the faculties are difficult to equip, and faith is difficult to generate, and each of these things is difficult to encounter, like a blind turtle encountering a hole in a floating log.",
        "source": "T04n0201_003:0268c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛之正道不同於彼九十五種邪見倒惑無有果報，修行佛道必獲正果，云何悋惜如此危脆不定之命毀佛聖教？",
        "translation": "The Buddha's right path is different from the 95 mistaken views and delusions that have no consequences, and cultivating the Buddha's path will surely lead to its rightful realization.",
        "source": "T04n0201_003:0268c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若護佛語，現世名聞具足功德，後受快樂。",
        "translation": "If someone protects the Buddha's words, they'll attain the full merit of fame and learning in the present life and will experience happiness in the future.",
        "source": "T04n0201_003:0268c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛說偈：「『若有智慧者，　　能堅持禁戒，　　求人天涅槃，　　稱意而獲得。",
        "translation": "As the Buddha explained in a verse, \"If someone who's wise can uphold the precepts and pursue nirvāṇa among humans and gods, they'll claim it and obtain it.",
        "source": "T04n0201_003:0268c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　名稱普聞知，　　一切咸供養，　　必得人天樂，　　亦獲解脫果。",
        "translation": "Their names are universally heard, and all make offerings; they will surely attain the happiness of humans and gods and also attain the fruit of liberation.",
        "source": "T04n0201_003:0268c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　伊羅鉢龍王，　　以其毀禁戒，　　搯傷樹葉故，　　命終墮龍中，　　諸佛悉不記，　　彼得出龍時。",
        "translation": "Elāpattra, the dragon king, because he violated the precepts and bruised a leaf, he fell into a dragon at the end of his life, and none of the buddhas remembered it, even when Peter emerged from the dragon.",
        "source": "T04n0201_003:0269a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　能堅持禁戒，　　斯事為甚難，　　戒相極眾多，　　分別曉了難。",
        "translation": "It's a difficult thing to uphold the precepts, and there are so many aspects of the precepts that it's difficult to discern and comprehend them.",
        "source": "T04n0201_003:0269a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如劍林棘聚，　　處中多傷毀，　　愚劣不堪任，　　護持如是戒。』」",
        "translation": "It's like a cluster of thorns in a forest of swords, where many are injured and disabled, and foolish people are unable to uphold such precepts.'\"",
        "source": "T04n0201_003:0269a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸比丘為苦所逼，不得屈申及以動轉，恐絕於草傷犯禁戒，自相謂言：「我等修行亦如彼稱，均平處所不令增減，今在怖難恐懼之處，執志不虧始別儜健，以斯賤命當貿貴法、人天之樂及涅槃樂，我等今者更無所趣，唯當護戒至死不犯。」",
        "translation": "Being forced by suffering and unable to yield or budge, those monks, fearing that they might cut off the grass and violate the precepts, said to themselves, \"We've cultivated the same way they say, making even-handed places that don't make us grow or shrink, and now we're in a place of fear and difficulty, where our resolve isn't weakened and we begin to distinguish between weakness and robustness.",
        "source": "T04n0201_003:0269a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「我等往昔來，　　造作眾惡業，　或得生人道，　　竊盜婬他妻，　王法受刑戮，　　計算不能數；　復受地獄苦，　　如是亦難計；　或受畜生身，　　牛羊及鷄犬，　麞鹿禽狩等，　　為他所殺害，　喪身無涯限，　　未曾有少利。",
        "translation": "He then spoke the verse, \"In the past, we created many bad deeds, sometimes gaining entry into the human race, stealing and lusting after another person's wife, being tortured and killed by the king's law in ways that can't be calculated, and then suffering in hell, which is also incalculable, or being subjected to the body of an animal, such as cattle, sheep, dogs, wild deer, birds, and hunting animals, which were killed by others and resulted in death that knows no limit and has never had little benefit.",
        "source": "T04n0201_003:0269a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等於今者，　　為護聖戒故，　分捨是微命，　　必獲大利益。",
        "translation": "Now, for the sake of protecting the noble precepts, we part with this tiny life, and we'll surely receive great benefit.",
        "source": "T04n0201_003:0269a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等今危厄，　　必定捨軀命，　若當命終後，　　生天受快樂。",
        "translation": "In our present distress, we'll surely lay down our lives, and when they end, we'll be born in heaven and experience joy.",
        "source": "T04n0201_003:0269a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若毀犯禁戒，　　現在惡名聞，　為人所輕賤，　　命終墮惡道。",
        "translation": "If we violate the precepts, we'll now have a bad reputation, be despised by people, and fall into a bad path when our lives end.",
        "source": "T04n0201_003:0269a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今當共立要，　　於此至沒命，　假使此日光，　　曝我身命乾，　我要持佛戒，　　終不中毀犯。",
        "translation": "Now, we'll make a common goal, and here we'll reach death; even if this sunlight were to dry my body and life, I must uphold the Buddha's precepts and never violate them.",
        "source": "T04n0201_003:0269a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　假使諸惡狩，　　摑裂我手足，　終不敢毀犯，　　釋師子禁戒。",
        "translation": "Even if some bad kari were to slap my hands and feet, I wouldn't dare to violate the precepts of the lion of the Śākyas.",
        "source": "T04n0201_003:0269b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我寧持戒死，　　不願犯禁生。」",
        "translation": "I'd rather die upholding the precepts than be born violating them.\"",
        "source": "T04n0201_003:0269b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘等聞老比丘說是偈已，各正其身不動不搖，譬如大樹無風之時枝葉不動。",
        "translation": "After they heard the elder monk say this verse, the monks each righted themselves so that they didn't move or sway, like a great tree whose branches and leaves don't budge when there's no wind.",
        "source": "T04n0201_003:0269b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼國王遇出田獵，漸漸遊行至諸比丘所繫之處。",
        "translation": "When the king of that country went out hunting, he gradually wandered over to where the monks were tied up.",
        "source": "T04n0201_003:0269b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王遙見之，心生疑惑作是思惟：「彼裸形者為是尼揵？",
        "translation": "When the king saw them from a distance, he had some doubts and thought, \"Is that naked guy Nirgrantha?",
        "source": "T04n0201_003:0269b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是沙門？」",
        "translation": "Why is it an ascetic?\"",
        "source": "T04n0201_003:0269b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已遣人往看，諸比丘等深生慙愧障蔽其身，使人審知釋子沙門。",
        "translation": "After thinking this, they sent someone to look at them, and the monks and others deeply regretted that they were being hindered by embarrassment, which caused people to examine the ascetic Śākyamuni.",
        "source": "T04n0201_003:0269b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故知之？",
        "translation": "How did they know that?",
        "source": "T04n0201_003:0269b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "右肩黑故。",
        "translation": "That's because his right shoulder was black.",
        "source": "T04n0201_003:0269b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使即還返白言：「大王！",
        "translation": "The messenger then returned and said, \"Great king!",
        "source": "T04n0201_003:0269b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼是沙門非為尼揵。」",
        "translation": "He's an ascetic, not a nun.\"",
        "source": "T04n0201_003:0269b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「王今應當知，　　彼為賊所劫，　慙愧為草繫，　　如鈎制大象。」",
        "translation": "He then spoke the verse, \"Now, the king should know that he's been robbed by thieves, and he's ashamed to be tied up in grass like a hook restraining a large elephant.\"",
        "source": "T04n0201_003:0269b12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時大王聞是事已，深生疑怪默作是念：「我今宜往彼比丘所。」",
        "translation": "After hearing this, the king became deeply suspicious and silently thought, \"Now, I should go to that monk's place.\"",
        "source": "T04n0201_003:0269b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，即說偈言：「青草所繫手，　　猶如鸚鵡翅，　又如祠天羊，　　不動亦不搖。",
        "translation": "After that thought, he spoke a verse, saying, \"A hand tied in grass is like a parrot's wing, and it's like a sacrificial lamb that doesn't budge or sway.",
        "source": "T04n0201_003:0269b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖知處危難，　　默住不傷草，　如林為火焚，　　犛牛為尾死。」",
        "translation": "Even though they know they're in danger, they stand silent and don't harm the grass, like a forest that burns with fire or a yak that dies by its tail.\"",
        "source": "T04n0201_003:0269b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是偈已往至其所，以偈問曰：「身體極丁壯，　　無病似有力，　以何因緣故，　　草繫不動轉？",
        "translation": "After speaking this verse, he went to his place and asked in verse, \"What's the reason he's so strong and healthy and doesn't seem to have any strength when he's not ill, so he's tied up in grass and doesn't budge?",
        "source": "T04n0201_003:0269b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝等豈不知，　　身自有力耶？",
        "translation": "Don't you know that the body itself is powerful?",
        "source": "T04n0201_003:0269b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為呪所迷惑，　　為是苦行耶？",
        "translation": "Is it an austerity practice to be deluded by a dhāraṇī?",
        "source": "T04n0201_003:0269b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為自厭患身？",
        "translation": "For the sake of self-satisfaction?",
        "source": "T04n0201_003:0269b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　願速說其意。」",
        "translation": "Please quickly explain what you mean.\"",
        "source": "T04n0201_003:0269b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是比丘以偈答曰：「此草甚脆弱，　　頓絕亦不難，　但為佛世尊，　　金剛戒所縛，　守諸法禁故，　　不敢挽頓絕。",
        "translation": "The monk then replied in verse, \"This grass is so fragile that it wouldn't be difficult to cut it off suddenly, but because the Bhagavān is bound by the adamantine precepts and observes the prohibitions of the Dharma, he wouldn't dare to cut it off suddenly.",
        "source": "T04n0201_003:0269b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛說諸草木，　　悉是鬼神村，　我等不敢違，　　是以不能絕。",
        "translation": "The Buddha said that all plants and trees are villages of ghosts and spirits, and we dare not disobey them; therefore, they can't be cut off.",
        "source": "T04n0201_003:0269c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如似呪場中，　　為蛇畫境界，　以神呪力故，　　毒蛇不能度，　牟尼尊畫界，　　我等不敢越。",
        "translation": "It's like a spell that paints a realm for a snake, and because of the power of the spell, the venomous snake can't escape, and the venerable Muni paints a realm that we don't dare to cross.",
        "source": "T04n0201_003:0269c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等雖護命，　　會歸於磨滅，　願以持戒死，　　終不犯戒生。",
        "translation": "Even though we protect our lives, we'll return to annihilation, wishing to die while observing the precepts and never be born in violation of them.",
        "source": "T04n0201_003:0269c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有德及無德，　　俱共捨壽命，　有德慧命存，　　并復有名稱；　無德喪慧命，　　亦復失名譽。",
        "translation": "Both the virtuous and the immoral share their lives, and when virtue and wisdom and life exist, they're also renowned; when virtuelessness and wisdom and life are lost, they also lose their reputations.",
        "source": "T04n0201_003:0269c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我等諸沙門，　　以持戒為力，　持戒為良田，　　能生諸功德，　生天之梯隥，　　名稱之種子，　得聖之橋津，　　諸利之首目。",
        "translation": "We ascetics make the observance of precepts our strength, and maintaining precepts is a good field that produces virtues, births ladders to gods, seeds of names, bridges and joints to sages, and the first eyes of benefits.",
        "source": "T04n0201_003:0269c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　誰有智慧者，　　欲壞戒德缾？」",
        "translation": "Who is wise enough to want to destroy the basket of the virtues of the precepts?\"",
        "source": "T04n0201_003:0269c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時國王心甚歡喜，即為比丘解草繫縛，而說偈言：「善哉能堅持，　　釋師子所說，　寧捨己身命，　　護法不毀犯。",
        "translation": "The king then was so encouraged that he untied the monk's fetters and spoke a verse, saying, \"Good, you're able to uphold what the lion of the Śākyas says, preferring to sacrifice your own life to protect the Dharma and not violate it.",
        "source": "T04n0201_003:0269c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今亦歸命，　　如是顯大法，　歸依離熱惱，　　牟尼解脫尊，　堅持禁戒者，　　我今亦歸命。」",
        "translation": "Now, I also vow my life, thus demonstrating the great teaching, taking refuge in the venerable Muni Liberation, who adheres to the precepts.\"",
        "source": "T04n0201_003:0269c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（一二）復次，若人內心賢善，則多安隱利益一切，是故智者應修其心恒令賢善。",
        "translation": "(12) Furthermore, if a person's mind is good at heart, then he'll be more peaceful and beneficial to all people; therefore, a wise person should cultivate a mind that's always good.",
        "source": "T04n0201_003:0269c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔曾聞，有諸比丘與諸估客入海採寶，既至海中船舫破壞。",
        "translation": "I once heard that some monks and valuers went into the sea to gather treasure, and when they arrived, their boats broke down.",
        "source": "T04n0201_003:0269c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時有一年少比丘捉一枚板，上座比丘不得板故將沒水中，于時上座恐怖惶悸，懼為水漂，語年少言：「汝寧不憶佛所制戒，當敬上座？",
        "translation": "At the time, a young monk grabbed a board, and the elder monk was about to be submerged in the water because he couldn't reach the board. The elder monk was terrified and frightened, fearing that he might be adrift in the water, and said to the young man, \"Why don't you remember the precepts established by the Buddha and honor the elder monk?",
        "source": "T04n0201_003:0269c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝所得板應以與我。」",
        "translation": "You should give me the board you've obtained.\"",
        "source": "T04n0201_003:0270a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時年少即便思惟：「如來世尊實有斯語，諸有利樂應先上座。」",
        "translation": "The young man then even thought, \"The Bhagavān really did say this, 'Those who have benefits should precede the ascending throne.'",
        "source": "T04n0201_003:0270a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是念：「我若以板用與上座，必沒水中洄澓波浪，大海之難極為深廣，我於今者命將不全；又我年少初始出家未得道果，以此為憂，我今捨身用濟上座，正是其時。」",
        "translation": "Again, he thought, \"If I were to use that board to give to the ascended seat, I would surely be caught in the rough seas and waves, and the ocean would be so difficult and vast that my life would be incomplete; and since I'm a young man who first left home and hasn't yet attained the fruit of the path, this is a cause for concern.",
        "source": "T04n0201_003:0270a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，而說偈言：「我為自全濟，　　為隨佛語勝，　無量功德聚，　　名稱遍十方。",
        "translation": "After this thought, he spoke a verse, saying, \"I've done this for my own salvation, in order to follow the Buddha's words, and I've gathered measureless merits that have been named throughout the ten directions.",
        "source": "T04n0201_003:0270a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　軀命極鄙賤，　　云何違聖教？",
        "translation": "My life is so despicable, how could I go against the noble teaching?",
        "source": "T04n0201_003:0270a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今受佛戒，　　至死必堅持。",
        "translation": "\"Now, I've accepted the Buddha's precepts, and I'll uphold them until the end of my life.",
        "source": "T04n0201_003:0270a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為順佛語故，　　奉板遺身命，　若不為難事，　　終不獲難果。",
        "translation": "Because I obeyed the Buddha's words, I left my life on this board, for if I didn't do difficult things, I would never attain difficult results.",
        "source": "T04n0201_003:0270a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我若持此板，　　必渡大海難，　若不順聖旨，　　將沒生死海。",
        "translation": "If I carry this board, I'll surely cross the great ocean of trouble, and if I don't obey the noble teaching, I'll drown in the ocean of birth and death.",
        "source": "T04n0201_003:0270a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今沒水死，　　雖死猶名勝，　若捨佛所教，　　失於人天利，　及以大涅槃，　　無上第一樂。」",
        "translation": "Now, I'll plunge into the water and die, but even though I die, I'll be called superior. If I abandon the Buddha's teaching, I'll lose the benefits of humans and gods and attain great nirvāṇa, the unsurpassed paradise.\"",
        "source": "T04n0201_003:0270a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是偈已，即便捨板持與上座。",
        "translation": "After speaking this verse, he even relinquished the board and handed it to the superior seat.",
        "source": "T04n0201_003:0270a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既受板已，于時海神感其精誠，即接年少比丘置於岸上。",
        "translation": "After accepting the board, the sea spirit then recognized his sincerity and picked up the young monk and placed him on the shore.",
        "source": "T04n0201_003:0270a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "海神合掌白比丘言：「我今歸依堅持戒者，汝今遭是危難之事能持佛戒。」",
        "translation": "The sea spirit put his palms together and said to the monk, \"Now, I'm relying on someone who firmly upholds the precepts, and now you're in such a difficult situation that you're able to uphold the Buddha's precepts.\"",
        "source": "T04n0201_003:0270a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "海神說偈，讚比丘曰：「汝真是比丘，　　實是苦行者，　號爾為沙門，　　汝實稱斯名。",
        "translation": "The sea spirit spoke a verse and praised the monk, saying, \"You really are a monk, a true ascetic, and you're called an ascetic, and you really call yourself that.",
        "source": "T04n0201_003:0270a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由汝德力故，　　眾伴及財寶，　得免大艱難，　　一切安隱出。",
        "translation": "Because of your virtue, you've been spared great hardship by your companions and treasures, and all have emerged in safety.",
        "source": "T04n0201_003:0270a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝言誓堅固，　　敬順佛所說，　汝是大勝人，　　能除眾患難。",
        "translation": "You say, \"Stand firm in your vow to obey the Buddha's teaching that you're a great victor who can remove many hardships and difficulties.",
        "source": "T04n0201_003:0270b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今當云何，　　而不加擁護？",
        "translation": "What will I do now that I don't embrace?",
        "source": "T04n0201_003:0270b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見諦能持戒，　　斯事未為難，　凡夫不毀禁，　　此乃名希有。",
        "translation": "To see the truth and be able to uphold the precepts is not difficult, and it's rare for a worldling not to violate the prohibitions.",
        "source": "T04n0201_003:0270b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　比丘處安隱，　　清淨自謹慎，　能不毀禁戒，　　此亦未為難；　未獲於道跡，　　處於大怖畏，　捨己所愛命，　　護持佛教戒，　難為而能為，　　此最為希有。」",
        "translation": "It's also not difficult for a monk who's in a peaceful place and is pure and careful not to violate the precepts; it's most rare when he hasn't yet attained the path's footprints, is in great fear, and lays down his beloved life to uphold the Buddhist precepts, which is difficult but possible.\"",
        "source": "T04n0201_003:0270b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（一三）復次，若不見道跡，雖復多聞，不能得拔生死之苦，是故智者應求見諦。",
        "translation": "(13) Furthermore, if someone hasn't seen the steps of the path, even though they've heard much, they can't escape the suffering of birth-and-death; therefore, a wise person should seek to see the truth.",
        "source": "T04n0201_003:0270b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔曾聞，兄弟二人俱共出家，兄得羅漢，弟誦三藏。",
        "translation": "I once heard of a case where two brothers left home together, and the older brother attained arhatship while the younger recited the Tripiṭaka.",
        "source": "T04n0201_003:0270b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼羅漢語三藏言：「汝可坐禪。」",
        "translation": "That arhat then said to the tripiṭaka, \"You may sit in meditation.\"",
        "source": "T04n0201_003:0270b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏報曰：「我當坐禪。」",
        "translation": "The tripiṭaka replied, \"I will sit in meditation.\"",
        "source": "T04n0201_003:0270b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羅漢比丘復語之言：「汝寧不聞佛之所說，夫行道者如救頭然？」",
        "translation": "The arhat monk then said to him, \"How could you not have heard what the Buddha taught, that someone who practices the way is like a head saver?\"",
        "source": "T04n0201_003:0270b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「今日造此事，　　未必到明旦，　人命不可保，　　宜速修善業，　死大軍來至，　　無可求請處。",
        "translation": "He then spoke the verse, \"This is done today, but it won't necessarily reach tomorrow, and human life is not preserved; it's better to quickly cultivate good actions, for there's no place to turn to when the army of the dead comes.",
        "source": "T04n0201_003:0270b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若其命終時，　　不知從何道？",
        "translation": "When his life ends, I wonder what path he'll follow.",
        "source": "T04n0201_003:0270b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　冥冥隨業緣，　　莫知路遠近。",
        "translation": "\"In the dark, they follow the causes and conditions of their actions, not knowing how far or near the road is.",
        "source": "T04n0201_003:0270b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　命如風中燈，　　不知滅時節，　汝言明當作，　　斯言甚虛妄。",
        "translation": "His life is like a lamp in the wind; he doesn't know when it's going out; his words are quite false when you say he'll follow through.",
        "source": "T04n0201_003:0270b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　死虎極暴急，　　都無有容縱，　一旦卒來到，　　不待至明日。",
        "translation": "The dead tiger is extremely violent, with no room for maneuvering, and once it arrives, it won't wait until tomorrow.",
        "source": "T04n0201_003:0270b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　死王多殘害，　　汝應生怖畏，　當知身危脆，　　命速難可保。",
        "translation": "The king of death is often cruel and harmful, so you should become frightened and know that your body is dangerous and fragile, and your life is difficult to save quickly.",
        "source": "T04n0201_003:0270b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應勤觀內身，　　捨棄多聞業，　求離世解脫，　　超拔生死根。",
        "translation": "You should diligently examine your internal body, abandon well-versed karma, seek liberation from the world, and transcend the root of birth-and-death.",
        "source": "T04n0201_003:0270b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　死若卒至時，　　悔熱無所及，　今若見道跡，　　後無悔熱患。",
        "translation": "When death is imminent, there's nothing to be gained from the burning remorse, but if you see the signs of the path now, you won't suffer from the burning remorse later.",
        "source": "T04n0201_003:0270c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛法中堅實，　　所謂得道跡，　多聞業虛偽，　　應捨莫愛悋。",
        "translation": "The Buddha's teaching is solid, which is called the path's traces, and well-versed karma is false, so abandon it and don't become attached to it.",
        "source": "T04n0201_003:0270c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖多聞博達，　　不獲道跡者，　譬如盲執燈，　　照彼自不覩。",
        "translation": "Even though they're well-versed and learned, someone who hasn't attained the steps of the path is like a blind man holding a lamp, shining it on himself and not seeing it.",
        "source": "T04n0201_003:0270c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若欲求自利，　　必須見道跡，　處眾師子吼，　　言辭善巧妙，　敷演諸法相，　　分別釋疑難。",
        "translation": "If someone wants to pursue their own benefit, they must see the steps of the path, handle the lion's roar of the crowd, speak skillfully, expound the characteristics of the teachings, and explain doubts and difficulties with discernment.",
        "source": "T04n0201_003:0270c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能令聽法眾，　　皆發歡喜心，　又使一切人，　　悉得於調順。",
        "translation": "He causes all who hear the teaching to become joyous, and he causes all people to attain submission.",
        "source": "T04n0201_003:0270c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖有如是事，　　臨終心錯亂，　墮於惡道中，　　智者所嗤笑。",
        "translation": "Even though this happens, their minds are distorted at the end of their lives, and they fall into a bad destiny that's reviled by wise men.",
        "source": "T04n0201_003:0270c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝之所說法，　　言詞字句滿，　次第說因果，　　美味悅心意，　甜如甘蔗漿；　　雖能作斯事，　不能自調順，　　未斷三惡趣，　自求得解脫，　　空用是事為？",
        "translation": "Your teaching, which is full of words and phrases, explains cause and effect in order, is delicious to the mind and sweet like sugarcane syrup; even though you can do this, you can't tame yourself, haven't stopped the three bad destinies, and seek your own liberation, but is this thing useless?",
        "source": "T04n0201_003:0270c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　凡夫不可信，　　宜速求見諦。",
        "translation": "Ordinary people can't believe it, so they should quickly seek to see the truth.",
        "source": "T04n0201_003:0270c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝有大名稱，　　咸云善說法，　雖有空名譽，　　於汝將何益？",
        "translation": "You have a great reputation, and you say you're a good teacher, but even though you have an empty reputation, what good will it do you?",
        "source": "T04n0201_003:0270c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當觀察內身，　　嘿然修禪定。",
        "translation": "He should examine his internal body and cultivate meditation with a cap at ease.",
        "source": "T04n0201_003:0270c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　昔來多聞者，　　其數甚眾多，　無常所遷謝，　　存者極尠少。",
        "translation": "There were many well-versed people in the past, and they were so numerous that they were impermanent, passing away, and very few survived.",
        "source": "T04n0201_003:0270c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　勤苦求名譽，　　雖得復散失，　佛說有為法，　　一切悉無常。",
        "translation": "They diligently sought fame, but even though they attained it, they lost it. The Buddha taught that all things are impermanent when it comes to the laws of existence.",
        "source": "T04n0201_003:0270c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　過去恒沙佛，　　成就三達智，　除滅於三障，　　一念觀三世，　斯等諸世尊，　　名聞滿十方，　今皆般涅槃，　　名字亦隨滅。",
        "translation": "The buddhas of the distant past accomplished the three kinds of penetrating knowledge, removed the three hindrances, and observed the three worlds with a single thought.",
        "source": "T04n0201_003:0270c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故汝今者，　　應勤修精進，　捨離於名稱，　　專求於解脫。」",
        "translation": "Now, therefore, you should diligently cultivate effort, part with names, and focus on liberation.\"",
        "source": "T04n0201_003:0271a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏答言：「正爾當作。」",
        "translation": "The Tripiṭaka replied, \"That's exactly what you should do.\"",
        "source": "T04n0201_003:0271a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未久之間身遇重病，恐命將終深生悔恨，而說偈言：「怪哉我今日，　　於佛聖法中，　戒聞雖具足，　　而不得見諦。",
        "translation": "Not long afterward, he became seriously ill, and fearing that his life would end, he deeply regretted it and spoke in verse, saying, \"It's strange that today, even though I've fulfilled the precepts and heard the noble teaching of the Buddha, I haven't been able to see the truth.",
        "source": "T04n0201_003:0271a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今若死者，　　與狗亦無別，　洄流沒生死，　　如彼陶家輪。",
        "translation": "Now, if I were to die, I'd be no different than a dog, migrating through birth and death like that potter's wheel.",
        "source": "T04n0201_003:0271a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今可哀愍，　　未得證道跡，　師長垂慈矜，　　勸我學禪思。",
        "translation": "Now, pitiably, I've yet to realize the steps of the path, but my teacher has shown compassion and urged me to train in meditation and contemplation.",
        "source": "T04n0201_003:0271a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我不奉法教，　　都不習少分，　是故於今者，　　不得見真諦。",
        "translation": "I didn't follow the teachings, and I didn't study even a little bit, so now I can't see the true truth.",
        "source": "T04n0201_003:0271a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我執釋迦文，　　大明之法燈，　而為無明首，　　不能自照了，　以不能照故，　　永沒生死苦。」",
        "translation": "I cling to the Śākyamuni, the great luminous lamp of the Dharma, but I'm the head of ignorance, unable to illuminate it for myself, and because I can't illuminate it, I'm forever sunken into the suffering of birth-and-death.\"",
        "source": "T04n0201_003:0271a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其諸同學聞其病患咸來瞻視，見其恐懼皆悉驚愕，各作是言：「汝寧不聞佛之所說？",
        "translation": "When their fellow students heard about their illness, they all came to look at them, were startled at their fear, and each said, \"How could you not have heard what the Buddha taught?",
        "source": "T04n0201_003:0271a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "多聞之人有智慧力能知無常，是故汝今不應憂怖。」",
        "translation": "Well-versed people have the power of wisdom to know impermanence; therefore, you shouldn't be sad and frightened now.\"",
        "source": "T04n0201_003:0271a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時病比丘即便說偈答同學言：「我先蒙教誨，　　當習坐禪法，　今日至明日，　　窳惰自欺誑。",
        "translation": "The sick monk then replied to his classmates in verse, \"I was first taught that I should train in the way of sitting meditation, but today and tomorrow, I'm lazy and self-deceptive.",
        "source": "T04n0201_003:0271a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　令此一生中，　　空過無所獲，　是身如聚沫，　　我不深觀察。",
        "translation": "In this lifetime, I've gained nothing by being empty, and I haven't deeply examined this body, which is like foam.",
        "source": "T04n0201_003:0271a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　橫計為堅實，　　不覺死卒至，　專著多聞法，　　生於最勝想，　忽為死蟒吞，　　悔恨無所及。",
        "translation": "Wantonly imagining myself to be resolute, I didn't realize that death would come, so I focused on the well-versed Dharma and gave rise to the most excellent notion, but suddenly I was swallowed by the python of death, and I regretted that there was nothing I could do.",
        "source": "T04n0201_003:0271a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如修多羅言，　　應當習坐禪，　專精莫懈倦，　　滅結之所說。",
        "translation": "As the sūtra says, \"You must train in sitting meditation, concentrate your mind, and don't become lazy, for it will extinguish the bonds that are taught.",
        "source": "T04n0201_003:0271a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛有如是教，　　不能隨順行，　悔熱火所燒，　　令我心燋惱。",
        "translation": "Thus did the Buddha teach, but I couldn't follow it, and I regretted that it was burned by a hot fire that scorched my mind.",
        "source": "T04n0201_003:0271b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今甚闇劣，　　譬如孾愚者，　於彼六道中，　　不知趣何道？",
        "translation": "Now, I'm so dark, like a foolish man who hasn't gone down one of the six paths, that I don't know where to go.",
        "source": "T04n0201_003:0271b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　未知將來世，　　得聞佛語不？",
        "translation": "I wonder if I'll be able to hear the Buddha's words in a future life?",
        "source": "T04n0201_003:0271b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　周迴三有中，　　為遇何等人？",
        "translation": "What kind of person does one encounter in the three circuits of existence?",
        "source": "T04n0201_003:0271b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　亦不知未來，　　為作何事業？",
        "translation": "I don't know what kind of work I'll do in the future.",
        "source": "T04n0201_003:0271b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或能喪本心，　　興起於三毒，　不修諸善事，　　但造於眾惡。",
        "translation": "Sometimes they lose their original mind, give rise to the three poisons, cultivate no good works, and create numerous evils instead.",
        "source": "T04n0201_003:0271b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　嗚呼大苦哉，　　我為自欺誑，　已得離諸難，　　應獲出世道。",
        "translation": "Wailing, great suffering, I deceived myself, and I've been freed from all difficulties and should attain the supramundane path.",
        "source": "T04n0201_003:0271b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何為癡悞，　　放逸而自恣？」",
        "translation": "Why is it that you're so deluded and lazy and self-indulgent?\"",
        "source": "T04n0201_003:0271b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸同學聞說偈已，重安慰言：「汝既多聞又堅持戒，宜應自寬，何為憂怖乃至如是？」",
        "translation": "After the fellow students heard the verse, they repeatedly reassured him, \"Since you are well-versed and firmly uphold the precepts, you should be lenient with yourself; why are you so worried and frightened even so?\"",
        "source": "T04n0201_003:0271b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "病比丘言：「我今病困，諸賢見捨必死無疑。」",
        "translation": "The sick monk said, \"Now that I'm sick and distressed, I'm sure I'll die without question because of the good men who see fit to abandon me.\"",
        "source": "T04n0201_003:0271b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "涕泣流淚而白兄曰：「願少近我，由我愚惑，不奉兄教，今者病篤必就後世。",
        "translation": "Weeping and weeping, he said to his elder brother, \"Please come close to me, for I was foolish and didn't follow your teaching.",
        "source": "T04n0201_003:0271b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願兄垂愍，當見拔濟令離大苦。」",
        "translation": "Please have mercy on me, brother, and I hope you'll see fit to rescue me from great suffering.\"",
        "source": "T04n0201_003:0271b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「同處佛法中，　　汝稱沙門寶，　數數教誡我，　　愚劣不承順。",
        "translation": "He then spoke a verse, saying, \"You're among the Buddhadharma, you're called an ascetic treasure, and you've repeatedly instructed me, but I'm a fool and don't obey you.",
        "source": "T04n0201_003:0271b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我以斯事故，　　倍復生悔熱，　盛夏欝蒸氣，　　猛焰燒燋然。",
        "translation": "Because of this incident, I've become increasingly hot with regret, and the burning summer steam burns me up with its fierce flame.",
        "source": "T04n0201_003:0271b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我之背恩教，　　悔熱復過彼，　我今無所恃，　　唯當歸依汝。",
        "translation": "My deviation from the beneficent teaching was even greater than theirs, and now I have no support but to turn to you.",
        "source": "T04n0201_003:0271b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於後受身時，　　觀察莫忘我，　令後值佛法，　　復還得出家。",
        "translation": "When I receive my body later, I'll examine it and not forget me, so that I'll meet the Buddha's teaching later and leave home again.",
        "source": "T04n0201_003:0271b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不虛著法服，　　願必獲道果，　學問諸餘業，　　捨之不復為，　專精求解脫，　　更無餘志求。",
        "translation": "Not wearing the robe of the Dharma in vain, I hope I'll surely attain the fruit of the path, abandon all the other activities of study and learning and never do them again, and concentrate on seeking liberation with no further intention.",
        "source": "T04n0201_003:0271b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　假使將來世，　　求於見諦者，　皮肉及筋骨，　　髓脈消乾竭，　身命趣自在，　　終不捨解脫。",
        "translation": "Even if in some future life he sought to see the truth, his skin, muscles, bones, and marrow veins would dry up, and his body would lead to freedom of life, he would never abandon liberation.",
        "source": "T04n0201_003:0271c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又願未來身，　　常勤修善法，　晝夜六時中，　　精進初不廢。」",
        "translation": "May he always strive to cultivate good qualities in his future body, making effort during the six hours of the day and night without abandoning it in the first place.\"",
        "source": "T04n0201_003:0271c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時病比丘說是偈已心懷惶悸，其兄見之生大憂愍，而作是言：「善哉善哉！",
        "translation": "After speaking this verse, the sick monk became frightened, and his brother, seeing this, became greatly concerned and said, \"Good, good!",
        "source": "T04n0201_003:0271c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子今乃能深生悔恨發于誓願，但先教汝不用我語，驚悔於後將何所及？」",
        "translation": "Now, my son has been able to deeply repent and make a vow, but you were first taught not to use my words; what will be the point of regretting them later?\"",
        "source": "T04n0201_003:0271c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而說偈言：「疾病以困篤，　　大命不云遠，　支節皆舒緩，　　刀風解其形。",
        "translation": "He spoke a verse, saying, \"Distressed by illness, his great life isn't far away, his limbs are all relieved, and the knife and wind release his form.",
        "source": "T04n0201_003:0271c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　湯藥所不療，　　醫師捨之去，　左右咸稱言，　　怪哉決定死。",
        "translation": "Nothing is cured by hot water or medicine, and the physician leaves it behind, while everyone around him says, 'It's strange that he's determined to die.'",
        "source": "T04n0201_003:0271c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸親婦女等，　　對而悲啼哭，　臨終大恐怖，　　驚畏苦難喻。",
        "translation": "Relatives, women, and others lament and wail over them, lamenting in terror at their deathbeds, terrified, and incomprehensible in their suffering.",
        "source": "T04n0201_003:0271c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　設當平健時，　　知死有斯苦，　誰不發道意，　　克獲解脫果？",
        "translation": "Suppose they knew when they were healthy that death was this painful, who wouldn't arouse the will of the Way and attain the fruit of liberation?",
        "source": "T04n0201_003:0271c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　盛年無患時，　　懈怠不精進，　但營眾事務，　　不修施戒禪。",
        "translation": "When he was in the prime of life and had no trouble, he was lazy and didn't exert himself, but he worked at numerous tasks instead of cultivating generosity, morality, and meditation.",
        "source": "T04n0201_003:0271c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　後遭重病疾，　　諸根如火然，　臨為死所吞，　　方悔求修善。」",
        "translation": "Later, he becomes seriously ill and his faculties are like fire, and when he's about to be swallowed up by death, he repents and seeks to cultivate goodness.\"",
        "source": "T04n0201_003:0271c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼病比丘即便命終，還生人中。",
        "translation": "Even after his life ended, that sick monk returned to life.",
        "source": "T04n0201_003:0271c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿羅漢以天眼觀，知其生處，數到其家。",
        "translation": "An arhat then observed with the divine eye, knew where he'd been born, and frequently went to his home.",
        "source": "T04n0201_003:0271c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此兒漸大乳母抱持，將詣僧坊至羅漢所，捉兒不堅失手撲地，頭打石上兒大瞋恚，捨身命終墮地獄中。",
        "translation": "As he grew older, his nursemaid took him into her arms and sent him to the monastery where the arhat was staying.",
        "source": "T04n0201_003:0271c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿羅漢復以天眼而觀察之，見在地獄生苦難處，即說偈言：「嗚呼大毀敗，　　生處難可救，　佛力尚難拔，　　況我能救濟？",
        "translation": "The arhat then observed him again with the divine eye and saw the place of birth and suffering in hell, and he spoke in verse, saying, \"Aah! Great corruption!",
        "source": "T04n0201_003:0271c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　繫心慧無漏，　　非苦所能修，　地獄中苦惱，　　無有暫樂心，　尚無暫樂心，　　云何得繫念？",
        "translation": "\"When bound-minded wisdom is untainted, it's not something that can be cultivated through suffering; there's no momentary happy mind in the suffering and distress of hell; how can one be bound-minded when there's still no momentary happy mind?",
        "source": "T04n0201_003:0272a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以無繫念故，　　不得慧無漏。",
        "translation": "Because of the absence of mindfulness, they can't attain untainted wisdom.",
        "source": "T04n0201_003:0272a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是之難處，　　云何可救拔？",
        "translation": "How can such a difficult situation be remedied?",
        "source": "T04n0201_003:0272a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　地獄受大苦，　　不可以方喻。",
        "translation": "\"The suffering of hell is so great that it can't be compared to this.",
        "source": "T04n0201_003:0272a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　設復強為譬，　　人中死為苦，　少可得為喻，　　彼苦恒過此。",
        "translation": "Even if it's a strong metaphor, death among humans is painful, and it can rarely be likened to this, that pain is always greater than this.",
        "source": "T04n0201_003:0272a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如火著乾薪，　　無有暫冷時，　地獄苦亦爾，　　無有暫憩息。",
        "translation": "Like a fire tossed on dry wood that never gets cold for a moment, so too does the suffering of hell have no respite.",
        "source": "T04n0201_003:0272a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　地獄中陰身，　　皆如融鐵聚，　熱惱燒然苦，　　不可得稱計。",
        "translation": "The bodies of the intermediate aggregates in hell are like a mass of molten iron, and their suffering is so intense that it can't be measured.",
        "source": "T04n0201_003:0272a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　宜應除懈怠，　　晝夜不休息，　勤修於正道，　　必使盡苦際。",
        "translation": "It's better to stop being lazy, not resting day or night, and diligently cultivating the right path, so that the limit of suffering will be reached.",
        "source": "T04n0201_003:0272a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故先修道，　　克獲解脫果，　然後以多聞，　　而作妙瓔珞。」",
        "translation": "Therefore, first cultivate cultivation, and you'll attain the fruit of liberation; then, with much learning, you'll create a marvelous necklace.\"",
        "source": "T04n0201_003:0272a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（一四）復次，見此事已應生驚悟，尊豪榮位無得常者。",
        "translation": "(14) Furthermore, after seeing this, you should be startled and awakened to the fact that there's no one in a position of honor or distinction who will attain permanence.",
        "source": "T04n0201_003:0272a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔曾聞，栴檀罽尼吒王將欲往詣罽尼吒城，於其中路見五百乞兒，同聲乞匃言：「施如我。」",
        "translation": "I once heard that the king of Caṇḍā-Kaniṣka was about to visit the city of Kaniṣka when he saw five hundred begging boys on the road there, all begging with one voice, saying, \"Give as I give.\"",
        "source": "T04n0201_003:0272a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞是語便生悟解，即作是念：「彼覺寤我，我於往日曾更貧苦，今若不施後亦如彼。」",
        "translation": "Hearing those words, the king then became enlightened and thought, \"They've awakened me, and I was once poorer and more miserable in the past; if I don't give now, I'll be like them in the future.\"",
        "source": "T04n0201_003:0272a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「由其先世時，　　多饒錢財寶，　說言無可施，　　今獲斯貧賤，　設我今言無，　　後亦同於彼。」",
        "translation": "He then spoke a verse, saying, \"In a prior life, they were generous with money and possessions and said there was nothing to give, so now they've become poor and disadvantaged.",
        "source": "T04n0201_003:0272a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有輔相名曰天法，下馬合掌而白王言：「此諸乞兒咸言如我。」",
        "translation": "An auxiliary minister named Dharma of the gods dismounted, put his palms together, and said to the king, \"These beggars all say they're like me.\"",
        "source": "T04n0201_003:0272a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王答臣言：「我聞其語，然我所解與汝有異。",
        "translation": "The king answered the minister, \"I've heard their words, but what I understand differs from yours.",
        "source": "T04n0201_003:0272a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝之所解，謂為乞索錢財雜物。",
        "translation": "Your understanding is that you're begging for money, possessions, and sundries.",
        "source": "T04n0201_003:0272a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我所解者當為汝說，汝今善聽！」",
        "translation": "I will explain what I understand for you, so listen well!\"",
        "source": "T04n0201_003:0272b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「此諸乞兒等，　　故來覺寤我，　以斯貧賤形，　　示我令得見。",
        "translation": "He then spoke the verse, \"These beggars and others have come to awaken me, showing me this poor form so that I can see it.",
        "source": "T04n0201_003:0272b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自言受此身，　　慳不惠施故，　放逸所欺誑，　　受是苦惱形，　愚劣諸乞兒，　　示我如此義。",
        "translation": "They say they've received this body, that it's the result of stinginess and unmerited generosity, that they've been deceived by carelessness, that they've acquired this painful form, and that they're foolish beggars who show me this meaning.",
        "source": "T04n0201_003:0272b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自言曾為王，　　猶如星中月，　寶蓋覆頂上，　　左右眾妓直，　侍從悉莊嚴，　　聞者皆避路。",
        "translation": "He says he was once a king like the moon among the stars, with a jeweled lid covering his head, a multitude of courtesans at his right and left, and his attendants all adorned, and those who hear him avoid the road.",
        "source": "T04n0201_003:0272b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖有如此等，　　種種眾妙事，　由不布施故，　　今受貧賤苦。",
        "translation": "Even though there were such and such a variety of wonderful things, because they didn't give generously, they now suffer from poverty and adversity.",
        "source": "T04n0201_003:0272b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　福樂迷汝心，　　不覺後有苦，　人帝應當知，　　我今甚毒苦，　宜當修布施，　　莫使後如我。」",
        "translation": "Deluded by happiness, you don't realize that there's suffering in the future. You should know, Emperor Ren, that my present life is very painful.",
        "source": "T04n0201_003:0272b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "輔相天法聞是偈已，深生歡喜，合掌白王：「如佛言曰：『見他受苦當自觀察。』",
        "translation": "After hearing this verse, the assistant deity Dharma profoundly rejoiced, put his palms together, and said to the king, \"Just as the Buddha said, 'When you see others suffering, you must examine it for yourself.'",
        "source": "T04n0201_003:0272b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王於今者實合佛意，見彼乞兒則能覺寤。",
        "translation": "Now, the king really agrees with the Buddha's intention that seeing that beggar will awaken him.",
        "source": "T04n0201_003:0272b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉大王！",
        "translation": "Good, great king!",
        "source": "T04n0201_003:0272b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意細乃爾，能覺是事，善解分別佛所說義。",
        "translation": "\"So it is with a subtle mind that he perceives this thing and well understands and discerns the meaning of what the Buddha has taught.",
        "source": "T04n0201_003:0272b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王稱實能持大地，真是地主不虛妄也。",
        "translation": "The king claims that he really can hold the earth, and he's really the lord of the earth and not a false one.",
        "source": "T04n0201_003:0272b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T04n0201_003:0272b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能善分別佛法深義，聰慧明達，是故稱王為大地主。」",
        "translation": "He's able to skillfully discern the profound meaning of the Buddha's teachings and has the intelligence and insight to do so; therefore, he's called the king a great lord of the earth.\"",
        "source": "T04n0201_003:0272b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「地主常應爾，　　此意為無上，　此意難可恒，　　能自利亦難。",
        "translation": "He then spoke a verse, saying, \"It's always appropriate for a lord of the earth, for this intention is unsurpassed, and it's difficult to sustain this intention, and it's also difficult to bring about self-benefit.",
        "source": "T04n0201_003:0272b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人身極難得，　　信心亦難生，　財寶難可足，　　福田復難遇。",
        "translation": "The human body is extremely difficult to obtain, faith is difficult to generate, possessions are difficult to obtain, and fields of merit are difficult to encounter.",
        "source": "T04n0201_003:0272b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是一一事，　　極難得聚會，　譬如大海中，　　盲龜值浮孔。",
        "translation": "Such a thing is extremely difficult to attain as a gathering, like a blind turtle in a floating hole in the ocean.",
        "source": "T04n0201_003:0272b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如斯之難事，　　大王盡具有，　是故於今者，　　不應恣心意。",
        "translation": "Such difficult things are all available to the king, so now he shouldn't let his mind wander.",
        "source": "T04n0201_003:0272b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人身如電光，　　暫發不久停，　雖復得人身，　　危脆不可保。",
        "translation": "A person's body is like a flash of lightning that's momentarily emitted and doesn't soon stop, even though he's reborn as a human being, he's too fragile to be preserved.",
        "source": "T04n0201_003:0272c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　臨終兩肩垂，　　諸節皆舒緩，　雖有四威儀，　　進止不自由。",
        "translation": "When I reach the end of my life, my shoulders slump, and all my joints are relaxed, even though I have the four comportments, I'm not free to move in and out.",
        "source": "T04n0201_003:0272c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眼目已上眄，　　將為死毒中，　親屬在其側，　　覩之咸悲泣。",
        "translation": "With his eyes peered upward, he's about to be poisoned by death, and his relatives are beside him, all of whom weep with sadness.",
        "source": "T04n0201_003:0272c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以手觸其身，　　安慰言勿懼，　既見親慰喻，　　益更增悲感。",
        "translation": "They touch their bodies with their hands, reassure them, and say not to be afraid; seeing their relatives' reassurances only increases their feelings of pity.",
        "source": "T04n0201_003:0272c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　決定知已去，　　涉於死長途，　雖有眾財物，　　不可為資糧。",
        "translation": "They're certain that they know they've left and that they've been involved in the long road to death, even though they have many possessions that can't be used as sustenance.",
        "source": "T04n0201_003:0272c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸脈斷絕時，　　顏色皆變異，　命來催促已，　　如油盡燈滅。",
        "translation": "When the veins are severed, their appearance changes, and they're hastened by their fate like a lamp going out after running out of oil.",
        "source": "T04n0201_003:0272c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當於如斯時，　　誰能修布施，　持戒及忍辱，　　精進禪智等？",
        "translation": "At that point, who can cultivate generosity, observe precepts and forbearance, and apply themselves to meditation and wisdom?",
        "source": "T04n0201_003:0272c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如斯時未至，　　宜應勤用心。」",
        "translation": "Thus, before the time comes, it's appropriate to apply yourself diligently.\"",
        "source": "T04n0201_003:0272c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（一五）復次，若命終時，欲齎財寶至於後世，無有是處，唯除布施作諸功德；若懼後世得貧窮者，應修惠施。",
        "translation": "(115) Furthermore, if at the end of your life you want to carry wealth and treasure to a later life, there's no place for you to go except to make gifts and cultivate merits; if you're afraid of becoming poor in the afterlife, you should cultivate generosity.",
        "source": "T04n0201_003:0272c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔曾聞，有一國王名曰難陀，是時此王聚積珍寶規至後世，嘿自思惟：「我今當集一國珍寶使外無餘。」",
        "translation": "I once heard that there was a king named Nandha who gathered up treasures to take to a later life and thought to himself, \"Now, I will gather the treasures of a country so that there will be no more.\"",
        "source": "T04n0201_003:0272c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪聚財故，以自己女置婬女樓上，勅侍人言：「若有人齎寶來求女者，其人并寶將至我邊。」",
        "translation": "Because of his desire to amass wealth, he put his own daughter up on a building for prostitutes and commanded his attendants, \"If someone brings treasure to me and asks for a woman, that person and their treasure will come to me.\"",
        "source": "T04n0201_003:0272c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是集歛一國錢寶，悉皆蕩盡聚於王庫。",
        "translation": "Thus, they gathered up a nation's money and treasure, and it was all swept away and gathered in the king's treasury.",
        "source": "T04n0201_003:0272c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有寡婦唯有一子心甚敬愛，而其此子見於王女儀容瓖瑋姿貌非凡，心甚耽著，家無財物無以自通，遂至結病，身體羸瘦氣息微惙。",
        "translation": "There was then a widow with only one son whom she loved dearly, and when that son saw the king's daughter with her ornate appearance and extraordinary features, he became so attached that he couldn't help himself without possessions.",
        "source": "T04n0201_003:0272c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母問子言：「何患乃爾？」",
        "translation": "His mother asked him, \"What's wrong with him?\"",
        "source": "T04n0201_003:0272c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子具以狀啟白於母：「我若不得與彼交往，定死不疑。」",
        "translation": "The son explained everything to his mother, \"If I don't get involved with that person, I'll surely die without question.\"",
        "source": "T04n0201_003:0272c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母語子言：「國內所有一切錢寶盡無遺餘，何處得寶？」",
        "translation": "The mother said to the son, \"There's nothing left of all the money and treasure in the country; where can I get treasure?\"",
        "source": "T04n0201_003:0273a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復更思惟：「汝父死時，口中有一金錢，汝若發塜可得彼錢，以用自通。」",
        "translation": "Again, he thought, \"When your father died, there was a coin in his mouth; if you had sent for the graveyard, you could have obtained that coin and used it for your own benefit.\"",
        "source": "T04n0201_003:0273a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即隨母言，往發父塜開口取錢。",
        "translation": "He then did as his mother told him and went to his father's graveyard and opened his mouth to retrieve the money.",
        "source": "T04n0201_003:0273a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既得錢已至王女邊。",
        "translation": "Once he had obtained the money, he went to the king's daughter.",
        "source": "T04n0201_003:0273a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時王女遣送此人并所與錢以示於王，王見之已語此人言：「國內金寶一切蕩盡，除我庫中，汝於何處得是錢來？",
        "translation": "The king's daughter then sent this man and the money he'd given her to show to the king, and when the king saw him, he said to him, \"Where did you get this money, except from my treasury, when all the gold and treasure in the country was gone?",
        "source": "T04n0201_003:0273a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於今者必得伏藏。」",
        "translation": "Now, you will surely be able to suppress your wealth.\"",
        "source": "T04n0201_003:0273a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種拷楚徵得錢處。",
        "translation": "Various torments mark the place where he'll get money.",
        "source": "T04n0201_003:0273a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此人白王：「我實不得地中伏藏。",
        "translation": "This man said to the king, \"It's true that I can't get buried in the earth.",
        "source": "T04n0201_003:0273a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我母示我，亡父死時置錢口中，我發塜取故得是錢。」",
        "translation": "My mother told me that my late father put money in his mouth when he died, and I got this money because I sent a grape ark to retrieve it.\"",
        "source": "T04n0201_003:0273a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王遣人往撿虛實，使人既到果見死父口中錢處，然後方信。",
        "translation": "The king then sent someone to retrieve the truth, but when they arrived, they saw the place where the money had been put in their dead father's mouth, and then they believed it.",
        "source": "T04n0201_003:0273a10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞是已而自思忖：「我先聚集一切寶物，望持此寶至于後世；彼父一錢，尚不能得齎持而去，況復多也？」",
        "translation": "After hearing this, the king considered to himself, \"I first gathered all my treasures, hoping to carry them to the afterlife; how could I carry one penny from that father's mouth, much less many?\"",
        "source": "T04n0201_003:0273a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「我先勤聚集，　　一切眾珍寶，　望齎諸錢物，　　隨己至後世。",
        "translation": "He then spoke the verse, \"I first diligently gathered all these treasures, hoping to carry them in money and carry them with me to the afterlife.",
        "source": "T04n0201_003:0273a14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今觀發塜者，　　還奪金錢取，　一錢尚不隨，　　況復多珍寶？」",
        "translation": "Now, when I look at this person who has given rise to the grains, I've snatched money and taken it, and even a single coin hasn't been followed, so how could there be many treasures?\"",
        "source": "T04n0201_003:0273a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復作是思惟：　　「當設何方便，　得使諸珍寶，　　隨我至後世？",
        "translation": "Again, he thought, \"What method will be devised to cause these treasures to follow me to a later life?",
        "source": "T04n0201_003:0273a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　昔者頂生王，　　將從諸軍眾，　并象馬七寶，　　悉到於天上；　羅摩造草橋，　　得至楞伽城。",
        "translation": "Once, the king of peaks and arbors brought his army, elephants, horses, and seven treasures up to heaven; Rāma built a straw bridge, and it took him to reach the city of Laṅkâvatāra.",
        "source": "T04n0201_003:0273a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　吾今欲昇天，　　無有諸梯隥；　欲詣楞伽城，　　又復無津梁；　我今無方計，　　持寶至後世。」",
        "translation": "Now, when I want to ascend to heaven, there are no steps; when I want to reach the city of Laṅkâvatāra, there are no more beams; I have no plan now to carry my treasures to a later age.\"",
        "source": "T04n0201_003:0273a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有輔相聰慧知機，已知王意而作是言：「王所說者正是其理，若受後身必須財寶，然今珍寶及以象馬，不可齎持至於後世。",
        "translation": "An auxiliary minister who was wise and knew his abilities knew the king's intention and said, \"What the king says is exactly the truth.",
        "source": "T04n0201_003:0273a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T04n0201_003:0273b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王今此身尚自不能至於後世，況復財寶象馬者乎！",
        "translation": "If the king's present body can't reach the afterlife, how could he possibly possess wealth, elephants, and horses?",
        "source": "T04n0201_003:0273b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當設何方令此珍寶得至後身？",
        "translation": "Where will this treasure reach the latter part of your life?",
        "source": "T04n0201_003:0273b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯有施與沙門婆羅門、貧窮乞兒，福報資人必至後世。」",
        "translation": "Only by giving to ascetics, priests, and poor beggars will the rewards of good fortune reach the afterlife.\"",
        "source": "T04n0201_003:0273b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「莊嚴面目者，　　臨水見勝好，　好醜隨其面，　　影悉現水中。",
        "translation": "He then spoke the verse, \"An ornamented face and eyes sees something beautiful when they're near water, and their shadows all appear in the water according to their faces, whether beautiful or ugly.",
        "source": "T04n0201_003:0273b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　莊嚴則影好，　　垢穢則影醜，　今身如面貌，　　後受形如影。",
        "translation": "When they're adorned, their reflection is beautiful, and when they're defiled, their reflection is ugly; their present body is like their face, and their later acquired form is like their reflection.",
        "source": "T04n0201_003:0273b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　莊嚴形戒慧，　　後得可愛果，　若作惡行者，　　後受報甚苦。",
        "translation": "Being adorned with form, morality, and wisdom, they'll later attain desirable results, but if they do bad actions, the rewards they'll experience later will be very painful.",
        "source": "T04n0201_003:0273b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　信心以財物，　　供養父母師，　沙門婆羅門，　　貧窮困厄者，　即是後有水，　　於中見面像，　施戒慧業影，　　亦復彼中現。",
        "translation": "A faithful person who makes offerings of goods to parents, teachers, ascetics, priests, and those in poverty and distress is the one who later has water and whose face is seen in images, and the shadows of actions based on generosity, morality, and wisdom are also present in them.",
        "source": "T04n0201_003:0273b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　王有眾營從，　　宮人諸婇女，　臣佐及吏民，　　音樂等倡妓。",
        "translation": "The king has a retinue of attendants, palace staff, women, ministers, officials, and musicians.",
        "source": "T04n0201_003:0273b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如其命終時，　　悲戀送塜間，　到已便還家，　　無一隨從者。",
        "translation": "When his life ends, he's sent off to the graveyard in pity and affection, and then he returns home after arriving, with no one following him.",
        "source": "T04n0201_003:0273b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　後宮侍直等，　　庫藏眾珍寶，　象馬寶輦輿，　　一切娛樂具，　國邑諸人民，　　苑園遊戲處，　悉捨而獨逝，　　亦無隨去者。",
        "translation": "The inner palace attendants and their followers store up all the treasures, elephants, horses, precious mounts, and all the amusement equipment, and the people of the country and their parks and playgrounds.",
        "source": "T04n0201_003:0273b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　唯有善惡業，　　隨逐終不放。",
        "translation": "Only good and bad actions are followed and never released.",
        "source": "T04n0201_003:0273b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若人臨終喘氣麤出，喉舌乾燋不能下水言語不了，瞻視不端筋脈斷絕，刀風解形支節舒緩，機關止廢不能動轉，舉體酸痛如被針刺。",
        "translation": "\"When a person is dying, his breath comes out coarsely, his throat and tongue are parched, he can't get water down, he can't speak, his vision is distorted, his tendons and veins are severed, the wind from his sword disintegrates his body, his limbs are loosened, his organs are disabled, and he can't move, and his body is as painful as if he were pricked by a needle.",
        "source": "T04n0201_003:0273b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命盡終時，見大黑闇如墜深坑，獨遊曠野無有黨侶，唯有修福為作親伴而擁護之。",
        "translation": "When their life ends, they'll see great darkness like falling into a deep pit, wander alone in the wilderness with no companions, and cultivate only merit as a companion and protect him.",
        "source": "T04n0201_003:0273b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為後世，宜速修福。」",
        "translation": "If it's for the sake of the afterlife, it's better to quickly cultivate good fortune.\"",
        "source": "T04n0201_003:0273b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「若人命終時，　　獨往無伴黨，　畢定當捨離，　　所愛諸親友，　獨遊黑闇中，　　可畏恐怖處，　親愛皆別離，　　孤焭無徒伴，　是故應莊嚴，　　善法之資糧。」",
        "translation": "He then spoke this verse, \"If a person goes alone without a companion when their life ends and they are certain to abandon their beloved friends and relatives, wandering alone in the darkness, a fearful and frightening place, their loved ones all separated, and they're left alone with no companions, they should adorn themselves as an accumulation of good qualities.\"",
        "source": "T04n0201_003:0273b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為滿此義故，婆羅留支以六偈讚王，即說偈言：「雖有諸珍寶，　　積聚如雪山，　象馬眾寶車，　　謀臣及呪術，　專念死時至，　　不可以救免，　宜修諸善業，　　為己得利樂。",
        "translation": "To fulfill this meaning, Bālāruci praised the king in six verses, saying, \"Although he has treasures amassed like snow-capped mountains, elephants, horses, many precious chariots, ministers, and spells, he's mindful that when death comes, it's impossible to save him, so he should cultivate good actions for his own benefit and happiness.",
        "source": "T04n0201_003:0273c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　目如青蓮者，　　應勤行戒施，　死為大恐畏，　　聞者皆恐懼。",
        "translation": "Someone with eyes like a blue lotus should diligently practice moral discipline and generosity, for death is a great fear, and those who hear it are terrified.",
        "source": "T04n0201_003:0273c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切諸世間，　　無不終沒者，　以是故大王，　　宜應觀死苦。",
        "translation": "There's nothing in all the world that doesn't end up dead, so it's appropriate, Great King, to contemplate the suffering of death.",
        "source": "T04n0201_003:0273c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　目如青蓮者，　　應當修善業，　為己得利樂，　　宜勤行戒施。",
        "translation": "Those whose eyes are like the blue lotus should cultivate good actions and diligently practice moral discipline and generosity for their own benefit and happiness.",
        "source": "T04n0201_003:0273c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人命壽終時，　　財寶不隨逐，　壯色及盛年，　　終不還重至。",
        "translation": "When his life ends, his wealth and treasure won't follow him, and his good looks and prime years will never return to him.",
        "source": "T04n0201_003:0273c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　目如青蓮者，　　應當修善業，　為己得利樂，　　宜勤行戒施。",
        "translation": "Someone with eyes like a blue lotus should cultivate good actions, attain profit for themselves, and diligently practice moral discipline and generosity.",
        "source": "T04n0201_003:0273c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彌力那侯沙，　　耶耶帝大王，　及屯豆摩羅，　　娑伽跌利不，　翹離奢勢夫，　　踰越頻世波，　如是人中上，　　眾勝大王等，　軍眾及群官，　　悉皆滅沒去，　欣慼相續生，　　意念次第起。",
        "translation": "Mṛgārajūṣa, Āyatollah, Dharmara, Sāgātariputra, Kālāśyapīya, Yogâcalaniputra, the best of such people, the greatest of great kings, armies, and officers, all perish and depart, and happiness and sadness continue to arise, with thoughts arising in sequence.",
        "source": "T04n0201_003:0273c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　目如青蓮者，　　應當修善業，　使己受快樂，　　宜勤行戒施。",
        "translation": "Those with eyes like a blue lotus should cultivate good actions that will make them happy, and they should diligently practice moral discipline and generosity.",
        "source": "T04n0201_003:0273c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　財寶及榮貴，　　此事難可遇，　福祿非恒有，　　身力有增損。",
        "translation": "Wealth, treasure, and prosperity are hard to come by, and fortune and wealth aren't always available, so their strength increases and decreases.",
        "source": "T04n0201_003:0274a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切無定相，　　地主亦非常，　如此最難事，　　今悉具足得。",
        "translation": "All things have indeterminate characteristics, and the lord of the earth is also extraordinary; these are the most difficult things to attain now.",
        "source": "T04n0201_003:0274a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　目如青蓮者，　　應具修諸善，　使己受快樂，　　宜勤修戒施。",
        "translation": "Someone with eyes like a blue lotus should thoroughly cultivate goodness to make themselves happy, and they should diligently cultivate moral discipline and generosity.",
        "source": "T04n0201_003:0274a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　勁勇有力者，　　能越渡大海，　專念健丈夫，　　能超度諸山。",
        "translation": "He's bold and powerful enough to cross the ocean, and he's mindful of sturdy men who can surpass mountains.",
        "source": "T04n0201_003:0274a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　設作如斯事，　　未足名為難，　能利益後世，　　是事乃為難。」",
        "translation": "Even if doing such a thing isn't enough, it's called difficult, and it's a difficult thing to do when it benefits later generations.\"",
        "source": "T04n0201_003:0274a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（一六）復次，此身不堅，是故智者應當分別供養尊長，是則名為以不堅法易堅固法。",
        "translation": "(16) Furthermore, since this body isn't strong, a wise person should discriminate and make offerings to venerable people, which is called making a strong dharma accessible by a weak dharma.",
        "source": "T04n0201_003:0274a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔曾聞，牟尼種中有王名曰阿育，信樂三寶，若於靜處見佛弟子，不問長幼必為下馬接足而禮。",
        "translation": "I once heard that there was a king named Aśoka among the Muni lineage who believed in and loved the Three Treasures and who, when he saw a disciple of the Buddha in a quiet place, would bow at his feet as he dismounted without asking about his elders or children.",
        "source": "T04n0201_003:0274a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時彼王有一大臣，號名耶賒，邪見不信，見王禮敬諸比丘等，深生謗毀，而白王言：「此諸沙門皆是雜種而得出家，非諸剎利及婆羅門，亦雜毘舍、首陀羅等。",
        "translation": "At the time, that king had a minister named Yazhin who was wrong-headed and disbelieving, and when he saw the king paying homage to the monks and so forth, he deeply disparaged them and said to the king, \"These ascetics are all mixed breeds who have left home, not bhadras or brāhmaṇas, but also mixed Vaiśālīs and śūdras.",
        "source": "T04n0201_003:0274a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸皮作及能織者，巧作塼瓦剃鬚髮師，亦有下賤旃陀羅等，大王何故而為作禮？」",
        "translation": "Why does the king venerate those leatherworkers and weavers, those who make tiles and shave their hair, and those who are beneath him?\"",
        "source": "T04n0201_003:0274a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞是語默然不報。",
        "translation": "The king was silent when he heard those words, and he didn't respond.",
        "source": "T04n0201_003:0274a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "別於後時集諸大臣，勅諸人言：「我於今者須種種頭，不聽殺害，仰汝等輩得自死者。」",
        "translation": "Bie then gathered his ministers together and commanded them, \"Now, I must plant various heads and not listen to killing, so I'm counting on you all to obtain your own deaths.\"",
        "source": "T04n0201_003:0274a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即語諸臣：「汝今某甲仰得是頭，復告某甲仰得彼頭。」",
        "translation": "He then told the ministers, \"Now, suppose someone looks up and obtains this head, and then tell someone to look up and obtain that head.\"",
        "source": "T04n0201_003:0274a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是展轉遍勅諸臣，仰得異頭不聽共同；別告耶賒：「今又仰汝取自死人頭，各各皆使於市中賣。」",
        "translation": "Thus, he repeatedly commanded the ministers to reveal that they had obtained different heads and not to listen to them together; he separately told Yahzin, \"Now, I also want you to take the heads of people who have died on their own and sell them in the marketplace.\"",
        "source": "T04n0201_003:0274a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是頭等，餘頭皆售，唯有人頭，見者惡賤，遠避而去無肯買者。",
        "translation": "Thus, all the other heads were sold, except for the head of a man, which was so disliked and despised that those who saw it avoided it and ran away, refusing to buy it.",
        "source": "T04n0201_003:0274a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾人見之咸皆罵辱而語之言：「汝非旃陀羅、夜叉、羅剎，云何乃捉死人頭行？」",
        "translation": "When people see this, they all insult them and say, \"If you aren't a candra, a yakṣa, or a rāṣa, why are you taking the heads of dead people?\"",
        "source": "T04n0201_003:0274a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "被罵辱已還詣王邊，而白王言：「我賣人頭不能令售，返被呵罵。」",
        "translation": "After being rebuked and insulted, he returned to the king and said, \"I couldn't sell my head for a price, so I was rebuked.\"",
        "source": "T04n0201_003:0274b02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王復語言：「若不得價，但當虛與。」",
        "translation": "The king then said again, \"If you can't get a price for it, you can just give it away in vain.\"",
        "source": "T04n0201_003:0274b03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼耶賒尋奉王教，入市唱告欲虛與人。",
        "translation": "Then, following the king's instruction, that man Jaśakam entered the market and told him he wanted to give it to someone for nothing.",
        "source": "T04n0201_003:0274b04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "市人見已復加罵辱，無肯取者。",
        "translation": "When the people in the market saw this, they insulted him again and refused to take it.",
        "source": "T04n0201_003:0274b05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耶賒慚愧還至王所，向王合掌，而說偈言：「牛驢及象馬，　　猪羊諸畜頭，　一切悉獲價，　　競共諍買取。",
        "translation": "Ashamed, Yahzin went back to the king, put his palms together, and spoke in verse, \"Ox, ass, elephant, horse, pig, and sheep heads, they all get a price, and they compete to buy them.",
        "source": "T04n0201_003:0274b06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸頭盡有用，　　唯人頭穢惡，　無有一可用，　　虛與不肯取，　而返被呵罵，　　況復有買者？」",
        "translation": "All the heads are useful, but the human head is filthy and useless; there's none that's usable, so they don't take them in vain and are rebuked, how could anyone buy them?\"",
        "source": "T04n0201_003:0274b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王問耶賒：「汝賣人頭，何故不售？」",
        "translation": "The king asked Īśāna, \"Why don't you sell the heads of men?\"",
        "source": "T04n0201_003:0274b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耶賒白王：「人所惡賤，無肯買者。」",
        "translation": "Jaiśan said to the king, \"People hate it and despise it; there's no one willing to buy it.\"",
        "source": "T04n0201_003:0274b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王復問言：「唯此一頭為可憎惡？",
        "translation": "The king then asked, \"Is this the only head that's detestable?",
        "source": "T04n0201_003:0274b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切人頭悉可惡乎？」",
        "translation": "Are all human heads repulsive?\"",
        "source": "T04n0201_003:0274b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耶賒答王：「一切人頭悉可惡賤，非獨此一。」",
        "translation": "He answered the king, \"All human heads are despicable, not just this one.\"",
        "source": "T04n0201_003:0274b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王復問言：「如是我頭亦復如是為人惡耶？」",
        "translation": "The king then asked, \"Would it be likewise for my head to be despised by people?\"",
        "source": "T04n0201_003:0274b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耶賒聞已懼不敢對，默然而住。",
        "translation": "After hearing this, Jaiśan became frightened and didn't dare to respond, so he waited silently.",
        "source": "T04n0201_003:0274b17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王復語言：「我於今者施汝無畏，以實而說，我今此頭亦可惡耶？」",
        "translation": "The king then said, \"Now, I've given you fearlessness, and I really say, 'Can this head of mine be evil?'\"",
        "source": "T04n0201_003:0274b18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耶賒對曰：「王頭亦爾。」",
        "translation": "Yazhin replied, \"So did the king's head.\"",
        "source": "T04n0201_003:0274b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王復語言：「為審爾不？」",
        "translation": "The king then replied, \"Is this a judgment?\"",
        "source": "T04n0201_003:0274b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耶賒復言：「審爾。",
        "translation": "Jaiśān again said, \"I guess so.",
        "source": "T04n0201_003:0274b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王！」",
        "translation": "Great king!\"",
        "source": "T04n0201_003:0274b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王告耶賒：「若此人頭貴賤等同皆可惡者，汝今云何自恃豪貴種姓色智以自矜高，而欲遮我禮敬沙門諸釋種子？」",
        "translation": "The king told Yazhin, \"If this is a man whose noble and base forms are equally despicable, why do you now boast of your own noble family's form and knowledge and want to deny me the honor of venerating ascetics and Śākyamuni's seeds?\"",
        "source": "T04n0201_003:0274b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「唯有此人頭，　　見者咸譏呵，　賣之無所直，　　虛與惡不近。",
        "translation": "He then spoke a verse, saying, \"Only this human head is ridiculed by those who see it; it's sold without any straight path, and it's false and evil don't approach it.",
        "source": "T04n0201_003:0274b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　遙見皆生瞋，　　言不祥鄙惡，　此頭膿血污，　　鄙賤甚可惡。",
        "translation": "Those who see it from afar become angry and say it's unlucky and mean, and this head is stained with pus and blood, which is despicable and very bad.",
        "source": "T04n0201_003:0274b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以斯下賤頭，　　貿易功德首，　雖向彼屈申，　　毫釐無損減。」",
        "translation": "This lowly head is the chief of trade merit, and even though I submit to them, I won't lose a bit.\"",
        "source": "T04n0201_003:0274b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　王告耶賒言：　　「汝雖見比丘，　雜種而卑賤，　　不能覩其內，　真實有道德。",
        "translation": "The king told Jaśaṅga, \"Even though you see monks of various varieties and lowly status, you can't see inside them what true morality exists.",
        "source": "T04n0201_003:0274c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝愚癡邪見，　迷惑錯亂心，　　計己婆羅門，　獨有解脫分，　　自餘諸種姓，　無得解脫者。",
        "translation": "Foolish and mistaken in your views and deluded and mistaken in your mind, you imagine that your own brāhmaṇa has the part of liberation alone, and that there's no one among the other castes who has attained liberation.",
        "source": "T04n0201_003:0274c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若欲為婚姻。",
        "translation": "If you want to marry, you must seek a race.",
        "source": "T04n0201_003:0274c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當求於種族；　　若求善法者，　安用種族為？",
        "translation": "You must seek ethnicity; if you seek the good Dharma, why should you use ethnicity?",
        "source": "T04n0201_003:0274c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若其求法者，　不應觀種姓，　　雖生上族中，　造作極惡行，　　眾人皆呵責，　是則名下賤。",
        "translation": "\"If someone seeking the Dharma shouldn't look at a family, even though they're born among the highest of families and do extremely bad things, which are reviled by everyone, then they're called lowly.",
        "source": "T04n0201_003:0274c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　種族雖卑微，　內有實道行，　　為人所尊奉，　是則名尊貴。",
        "translation": "Even though their family is lowly, they have real inner conduct that's honored by people, and they're called noble.",
        "source": "T04n0201_003:0274c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　德行既充滿，　云何不禮敬？",
        "translation": "Since they're full of virtue, why don't they venerate them?",
        "source": "T04n0201_003:0274c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　心惡使形賤，　意善令身貴，　　沙門修諸善，　信戒施聞具，　　是故可尊尚，　宜應深恭敬。",
        "translation": "A bad mind makes form inferior, but a good mind makes body noble, and ascetics cultivate goodness and possess faith, morality, generosity, and learning; therefore, they are honorable and should be deeply respected.",
        "source": "T04n0201_003:0274c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　造作惡行者，　汝今寧不聞，　　釋種具大悲，　牛王正道者，　　所說之法耶？",
        "translation": "Those who engage in bad behavior, how could you not hear the teachings of an explanation of the varieties of great compassion and of the right path of the ox king?",
        "source": "T04n0201_003:0274c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以三危脆法，　　貿易三堅法，　佛無有異語，　　故我不敢違，　若違世尊教，　　不名為親善。",
        "translation": "\"Because there are three dangerous and fragile things, and I trade in three hard things, the Buddha has never spoken differently, so I wouldn't dare to disobey him. If I disobey the Bhagavān's teaching, I wouldn't be called friendly and good.",
        "source": "T04n0201_003:0274c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如壓甘蔗，　　取汁棄其滓，　人身亦如是，　　為死之所壓。",
        "translation": "Like crushing sugarcane, taking the juice and discarding the dregs, so too is the human body crushed by death.",
        "source": "T04n0201_003:0274c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　屍骸委在地，　　不能復進止，　供敬修諸善，　　是故應當知。",
        "translation": "His corpse is plunged to the ground, and he can no longer advance or stop, making offerings and cultivating goodness; therefore, you should know this.",
        "source": "T04n0201_003:0274c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以此敗壞身，　　貿易堅牢法，　猶如火燒舍，　　智者出財物，　如水沒伏藏，　　亦應速出寶，　此身終敗壞，　　宜貿易堅法。",
        "translation": "Because this corruptible body is traded for a strong and stable dharma, it's like a house on fire. A wise man gives up his possessions like water sinking into a quagmire, and he should quickly give up his treasures.",
        "source": "T04n0201_003:0274c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚人不分別，　　堅與不堅法，　死軍卒來至，　　如入摩竭口，　當於如是時，　　驚恐大怖畏。",
        "translation": "A foolish man who doesn't discriminate between what's hard and what's not hard when a soldier of death comes, like entering the mouth of a magician, will be terrified and greatly frightened when he does so.",
        "source": "T04n0201_003:0275a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如酪取生酥，　　及以於醍醐，　取已酪缾破，　　不生大苦惱。",
        "translation": "It's like taking fresh butter and making ghee, and after taking it, the basket of cheese breaks open, and great suffering doesn't arise.",
        "source": "T04n0201_003:0275a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此身亦如是，　　取其堅實善，　於後命盡時，　　終不生悔恨。",
        "translation": "*So it is with this body, which is taken for its solid goodness, so that when its life ends, it never becomes regretful.",
        "source": "T04n0201_003:0275a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不修諸善行，　　憍慢而縱逸，　死法卒來至，　　破身之缾器，　其心極燋熱，　　猶為火所燒。",
        "translation": "Not cultivating good qualities, being conceited and careless, when death comes, that person's jar is broken, and their mind is so scorched that it's like being burned by fire.",
        "source": "T04n0201_003:0275a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　憂結喻如火，　　酪缾喻如身，　汝不應遮我，　　修善取堅法。",
        "translation": "The bond of grief is likened to fire, and the basket of milk is likened to the body; you shouldn't cover me up and cultivate goodness and resolute principles.",
        "source": "T04n0201_003:0275a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚癡黑暗者，　　自言我尊貴。",
        "translation": "A foolish man of darkness claims to be honored by me.",
        "source": "T04n0201_003:0275a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我執十力尊，　　言說之燈炬，　照察己身中，　　貴賤無差別，　皮肉筋骨等，　　三十六種物，　貴賤悉同等，　　有何差別相？",
        "translation": "I hold the honored possessor of the ten powers, a torch of words that illuminates my own body, making no distinctions between noble and base, flesh, tendons, bones, and so forth, and the 36 things that are noble and base are all the same, so what distinctions are there?",
        "source": "T04n0201_003:0275a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　名衣及上服，　　眾具有別異。",
        "translation": "\"Famous clothes and fine clothing are distinguished among their various forms.",
        "source": "T04n0201_003:0275a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智者宜勤身，　　作恭敬禮拜，　伇使行諸善，　　是名取堅法。",
        "translation": "It's appropriate for a wise person to diligently apply themselves, pay respect and veneration, and make him perform various good qualities, which are called grasping firm dharmas.",
        "source": "T04n0201_003:0275a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　何故說斯者？",
        "translation": "Why do you say this?",
        "source": "T04n0201_003:0275a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　此身如電遄，　泡沫及沙聚，　　芭蕉無堅實。",
        "translation": "\"This body is like a lightning bolt, a mass of foam and sand, and a plantain with no substance.",
        "source": "T04n0201_003:0275a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如此危脆身，　　修善百劫住，　堅於須彌山，　　及以於大地。",
        "translation": "Such a fragile body, cultivated for a hundred eons, is sturdy enough to stand on Mount Sumeru and reach the earth.",
        "source": "T04n0201_003:0275a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智者應如是，　　貿易堅實法。」",
        "translation": "Wise ones should thus trade in solid dharmas.\"",
        "source": "T04n0201_003:0275a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大莊嚴論經卷第三",
        "translation": "*Sūtrâlaṃkāra-śāstra, Vol. 3",
        "source": "T04n0201_003:0275a28_0",
        "is_bad_quality": false
    }
]