[
    {
        "source_sentence": "大莊嚴論經卷第十五",
        "translation": "Dazhuangyanlun jing, vol. 15",
        "source": "T04n0201_015:0339b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "馬鳴菩薩造",
        "translation": "created by Aśvaghoṣa Bodhisattva",
        "source": "T04n0201_015:0339b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後秦龜茲三藏鳩摩羅什譯",
        "translation": "Kumārajīva translation of the Tripiṭaka of Kucha in the latter Qín",
        "source": "T04n0201_015:0339b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（七一）復次，善分別者，乃至國土廣大諸事備足，知其苦惱捨離而去。",
        "translation": "(71) Furthermore, those who well discriminate up to the point where a large land is supplied with various things and they know their suffering and distress, abandon it, and depart.",
        "source": "T04n0201_015:0339b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔曾聞，世尊昔為菩薩時作大國王，貧窮乞匃有來索者一切皆與，為苦厄者能作擁護，為欲利益一切眾生，智慧聰猛又處王位。",
        "translation": "I've heard in the past that when the Bhagavān was a bodhisattva, he was the king of a great country, and he gave everything to anyone who asked for it, defended those who were suffering and distressed, wanted to benefit all sentient beings, and was a king in his position because of his wisdom and intelligence.",
        "source": "T04n0201_015:0339b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時隣國王將諸軍眾欲來交戰，時菩薩王作是思惟：「著五欲樂不能調心，六根難滿眾具既多，復須料理而擁護之，為此眾具生於鬪諍，願捨此事不應鬪諍，我應更修集隨身勝法。」",
        "translation": "When the king of the neighboring kingdom brought his army to battle, the king of the bodhisattvas thought, \"I can't tame my mind when I'm attached to the five desires and pleasures, and I need to take care of the many possessions that make it difficult to fulfill the six faculties and defend them.",
        "source": "T04n0201_015:0339b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「於善觀察時，　　智者應分別，　為事不思慮，　　後悔無所及。",
        "translation": "He then spoke this verse, \"When you well observe, a wise person should discern and not think about things, for which there's no cause for regret.",
        "source": "T04n0201_015:0339b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「觀察是非，必知所在。」",
        "translation": "\"He'll surely know where right and wrong are when he investigates them.\"",
        "source": "T04n0201_015:0339b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復說偈言：「欲如執草炬，　　亦如眾肉團，　著欲必傷毀，　　害及於二世。",
        "translation": "Again, he spoke the verse, \"Desire is like holding a straw torch or like a mass of flesh, and attachment to desire will harm and disfigure it, causing harm in two worlds.",
        "source": "T04n0201_015:0339b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智者應速離，　　國土眾具等，　如此眾具等，　　終歸必捨棄，　寧今受眾苦，　　願莫於後世，　受此久長苦。",
        "translation": "Those who are wise should quickly part with the many implements of their land, for they'll surely be discarded in the end, preferring to suffer many hardships now and hoping not to experience this long-lasting pain in later lifetimes.",
        "source": "T04n0201_015:0339b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　計我今勢力，　堪任摧伏彼，　　現在明證果，　聲譽歎美善，　　後受苦傷害。",
        "translation": "Considering my present strength, I'm capable of overcoming them, realizing the fruit of knowledge now, and praising the goodness of my reputation, but I'll be hurt by suffering later.",
        "source": "T04n0201_015:0339b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖知己有能，　　願當護於彼，　若當不護彼，　　後必傷害身。」",
        "translation": "Even though I know I'm capable, I want to protect them, but if I don't protect them, I'll surely be harmed later.\"",
        "source": "T04n0201_015:0339b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已逃避入林，有一老婆羅門迷失道路到彼林間，菩薩問言：「汝以何故來至此林？」",
        "translation": "After thinking this thought, he fled into the forest. When a wife lost her way and went into the forest, the bodhisattva asked, \"Why did you come to this forest?\"",
        "source": "T04n0201_015:0339b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門言：「我欲見王。」",
        "translation": "The brāhmaṇa said, \"I want to see the king.\"",
        "source": "T04n0201_015:0339c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩問言：「何故見王？」",
        "translation": "The bodhisattva asked, \"Why do you want to see the king?\"",
        "source": "T04n0201_015:0339c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門言：「我今貧困又多債負，聞王好施，故來乞索用以償債。",
        "translation": "The brāhmaṇa said, \"Now, I'm poor and burdened with debt, and I've heard that the king is charitable, so I've come to ask for money to pay my debts.",
        "source": "T04n0201_015:0339c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠離貧苦，更無所歸，唯望王恩拯救於我。」",
        "translation": "I'm far from poverty and suffering, and I have nowhere else to turn, except to the king's kindness to save me.\"",
        "source": "T04n0201_015:0339c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩語言：「汝並歸去，此間無王何所歸誠？」",
        "translation": "The bodhisattva said, \"You've returned, but without the king here, what refuge would you have?\"",
        "source": "T04n0201_015:0339c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門聞是語已，迷悶躃地。",
        "translation": "After hearing these words, the Brāhmaṇa fell to the ground in delusion.",
        "source": "T04n0201_015:0339c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩既見之已，深生憐愍，作是念已，即說偈言：「我以護他故，　　難捨盡棄捨，　我今棄捨已，　　當以何物與？",
        "translation": "After he saw this, the bodhisattva felt deep compassion for him, and after he thought this, he spoke a verse, \"It's because I protect others that I discard all that's difficult to discard.",
        "source": "T04n0201_015:0339c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　吾今為斯人，　　當捨己身命。」",
        "translation": "Now, for this person, I will sacrifice my own life.\"",
        "source": "T04n0201_015:0339c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是偈已即時扶接婆羅門起，而告之曰：「汝莫愁怖！",
        "translation": "After speaking this verse, he immediately helped the brāhmaṇa to rise and told him, \"Don't be afraid!",
        "source": "T04n0201_015:0339c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾當令汝得於財利。」",
        "translation": "I will give you access to wealth and profit.\"",
        "source": "T04n0201_015:0339c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門聞是語已心生喜悅，菩薩即時用草作索，作索已訖與婆羅門：「一切施者我身即是。」",
        "translation": "When the Brāhmaṇa heard these words, his heart rejoiced, and the bodhisattva then made a cord of grass, and after making it, he gave it to the Brāhmaṇa, saying, \"I myself will be the donor of all that I give.\"",
        "source": "T04n0201_015:0339c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而說偈言：「彼王未得我，　　心意終不安，　汝應以此繩，　　繫縛於我肘，　將至彼王所，　　令彼王歡喜，　當施汝珍寶，　　金銀諸財物，　汝可得大富，　　彼王復歡喜。",
        "translation": "He then spoke a verse, saying, \"That king has yet to gain possession of me, and his mind is never at ease; so why don't you bind this rope to my elbow?",
        "source": "T04n0201_015:0339c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　生者必有死，　　壽命會當盡，　為救危厄故，　　雖復喪身命，　智者為此死，　　名之為瓔珞。」",
        "translation": "'Birth must lead to death, and my life will end. To save those in danger and distress, even though I lose my life, a wise man gives this death a name, a necklace.'",
        "source": "T04n0201_015:0339c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時婆羅門聞是語已甚大歡喜，即時以索縛此菩薩將詣彼王。",
        "translation": "After hearing those words, the Brāhmaṇa rejoiced greatly and immediately bound this bodhisattva with a rope and sent him to the king.",
        "source": "T04n0201_015:0339c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王既見已向婆羅門，而說偈言：「此為是何人？",
        "translation": "After he saw him, the king addressed the Brāhmaṇa and spoke in verse, saying, \"Who is this person?",
        "source": "T04n0201_015:0339c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　身色如金山，　威光甚赫奕，　　猶日照世間，　面目極端嚴，　　睹者無不悅。",
        "translation": "His body is shaped like a gold mountain, his radiance is brilliant, he's like a sun shining in the world, and his face is so dignified that no one is displeased when they see it.",
        "source": "T04n0201_015:0339c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如斯福德者，　　應作大地主，　今日被拘執，　　苦厄乃如是？",
        "translation": "Such a man of such virtue would be a great lord of the earth, but today he's being held captive, suffering and distress like this?",
        "source": "T04n0201_015:0340a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我坐師子座，　　極為可慚耻，　彼應處王位，　　非我之所宜，　我之不調順，　　不應處此座。」",
        "translation": "I'm sitting in the lion's seat, and it's a great shame that I should be in the king's seat when it's not appropriate for me and when I'm not well-adjusted, I shouldn't be in this seat.\"",
        "source": "T04n0201_015:0340a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門聞是偈已，白大王言：「此是王怨。」",
        "translation": "After hearing this verse, the Brāhmaṇa said to the king, \"This is the king's enemy.\"",
        "source": "T04n0201_015:0340a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王問婆羅門：「誰縛此人？」",
        "translation": "The king asked the Brāhmaṇa, \"Who has bound this man?\"",
        "source": "T04n0201_015:0340a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門言：「此實我縛。」",
        "translation": "The brāhmaṇa said, \"This is really my bondage.\"",
        "source": "T04n0201_015:0340a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「斯人不應為汝所縛，汝為妄語。」",
        "translation": "The king said, \"This person shouldn't be tied by you; you're lying.\"",
        "source": "T04n0201_015:0340a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「彼如大逸象，　　身力甚強壯，　汝今體羸劣，　　又無兵馬力，　云何能縛彼？",
        "translation": "He then spoke a verse, saying, \"He's like a great escaped elephant with great strength, but now you're physically weak, and you don't have the strength of a horse or an army, so how could you bind him?",
        "source": "T04n0201_015:0340a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　此事不可信。",
        "translation": "You can't believe this.",
        "source": "T04n0201_015:0340a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝可真實說，　　勿作虛妄言。」",
        "translation": "You may truly explain it, but don't speak falsely.\"",
        "source": "T04n0201_015:0340a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門具陳上事，而說偈言：「見我失所望，　　彼人便自縛，　彼以悲愍縛，　　欲以救濟我。",
        "translation": "The Brāhmaṇa then explained all of the above and spoke in verse, \"Disappointed by what they see in me, that person then binds themselves, and they are bound by compassion, wanting to rescue me.",
        "source": "T04n0201_015:0340a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是善丈夫，　　名稱遍十方，　猶如燃庭燎，　　普照於一切。",
        "translation": "Such a good man's name pervades the ten directions like a burning garden candle that shines universally.",
        "source": "T04n0201_015:0340a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不善人愚癡，　　滅彼使無餘，　庭燎熾然時，　　能滅令無遺。」",
        "translation": "When an unskillful person's folly is extinguished, there's nothing left to extinguish, and when the garden burns brightly, it extinguishes everything without remainder.\"",
        "source": "T04n0201_015:0340a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大王聞是語已，即便驚起合掌而言：「善哉善哉！",
        "translation": "After hearing those words, the king then roused himself, put his palms together, and said, \"Good, good!",
        "source": "T04n0201_015:0340a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真善丈夫！",
        "translation": "A truly good man!",
        "source": "T04n0201_015:0340a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝為救他作如是事。」",
        "translation": "You did this to save others.\"",
        "source": "T04n0201_015:0340a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「所言大王者，　　號名曰羅闍，　利益於世間，　　是故名羅闍。",
        "translation": "He then spoke the verse, \"The great king who's called Rājagṛha benefits the world, and therefore he's called Rājagṛha.",
        "source": "T04n0201_015:0340a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝今應為王，　　護持於大地，　唯願今聽我，　　懺悔諸罪咎。",
        "translation": "Now, you should be the king, protect the earth, and may I be heard now to repent of my sins and faults.",
        "source": "T04n0201_015:0340a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我實是嬰愚，　　輕躁無智者，　汝可還為王，　　我捨此國去。",
        "translation": "I'm really an infant and a fool, impatient and without wisdom, so return as king, and I'll leave this country behind.",
        "source": "T04n0201_015:0340a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝能令眾生，　　一切得安樂，　餘人設作王，　　逼惱諸世間。」",
        "translation": "You can make all sentient beings happy, while others would pretend to be kings and oppress the world.\"",
        "source": "T04n0201_015:0340b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即立彼王還歸所止。",
        "translation": "He then made that king return to his lodging.",
        "source": "T04n0201_015:0340b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（七二）復次，作淨福業應設供養，是故應當勤修福業。",
        "translation": "（Furthermore, making pure meritorious actions requires making offerings; therefore, you should diligently cultivate meritorious actions.",
        "source": "T04n0201_015:0340b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔曾聞，石室國王名烏越羈，舉國人民共設佛會，有一婦人於窓牖中闚看世尊。",
        "translation": "I once heard that the king of the country of Shisuro named Ujjayanta was hosting a gathering of the people of his kingdom when a woman looked into the window of the Bhagavān.",
        "source": "T04n0201_015:0340b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時彼王見女端正，即解珠瓔遣傍侍臣送與彼婦。",
        "translation": "Seeing the woman's dignity, the king then untied her pearl beads and sent his attendants to give them to the woman.",
        "source": "T04n0201_015:0340b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王左右即白王言：「彼婦女者是國中婦，王若愛念直往喚取，何煩與珠？",
        "translation": "The king's attendants then said to the king, \"That woman is a woman of the kingdom. If the king desires her, why would he bother to give her the pearl?",
        "source": "T04n0201_015:0340b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人脫怪笑。」",
        "translation": "People get rid of strange laughter.\"",
        "source": "T04n0201_015:0340b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞是語以手掩耳，作如是言：「咄哉大惡！",
        "translation": "Hearing this, the king covered his ears with his hands and said, \"Oh, what a terrible thing!",
        "source": "T04n0201_015:0340b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何乃以此言使聞我耳？」",
        "translation": "How did you make me listen to you with those words?\"",
        "source": "T04n0201_015:0340b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「作是呪誓言，　　設我有異心，　使我成大惡，　　我不以染著，　以珠與彼女，　　聽我說意故。",
        "translation": "He then spoke the verse, \"I made this vow, assuming I had a different mind that would cause me to do great evil, and I didn't give that woman the pearl with defiled attachment, listening to my explanation of my intentions.",
        "source": "T04n0201_015:0340b13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　業為自在主，　　最勝業者說，　此無宰主作，　　唯是業所造，　心作於宰主，　　善業佛所歎。",
        "translation": "'Karma is the sovereign lord, and the most excellent karma is explained by those who say there's no lord who does this, but it's created by karma, and the mind works as a lord, which is praised by the Buddha for its good actions.'",
        "source": "T04n0201_015:0340b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是之妙色，　　更無宰主我，　唯是善業作，　　善業我應敬，　惡業我應離。",
        "translation": "Such is the marvelous form, and there's no ruler, only good actions created, good actions that I should respect, and bad actions that I should avoid.",
        "source": "T04n0201_015:0340b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　過去作善業，　果報於今現，　　我以於珠貫，　眾寶雜莊嚴，　　額懸多邏羅，　珠貫白如雪，　　我為宿功德，　不為著色欲，　　若知善惡業，　云何復著色？",
        "translation": "The results of good actions in the past are now present, and I've used a string of beads, a collection of jewels, a pendant, a multitude of adornments, a string of beads as white as snow, the merits of my past lives, and I don't cling to the desire for form, so if I knew good and bad actions, why would I cling to form?",
        "source": "T04n0201_015:0340b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　雖遠尚不視，　況當有染著？",
        "translation": "Even though it's far away, how could there be defiled attachment?",
        "source": "T04n0201_015:0340b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　寧當飢渴死，　不為非法貪，　　寧當入火聚，　不為姦邪事。",
        "translation": "I'd rather die of hunger and thirst than pursue unlawful cravings, and I'd rather go into a fiery mass than engage in adultery.",
        "source": "T04n0201_015:0340b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我如有愛著，　今身若後身，　　受苦極無量。」",
        "translation": "If I were to become attached, whether in this body or the one after, I'd experience immeasurable suffering.\"",
        "source": "T04n0201_015:0340c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（七三）復次，若有善業，自然力故受好業報，雖有國王黨援之力，不如業力所獲善報，是故應當修於善業。",
        "translation": "(73) Furthermore, if there's good action, the natural power of which brings the results of good actions, even though the power of a king's party is not as great as the good results obtained by the power of actions, so you should cultivate good actions.",
        "source": "T04n0201_015:0340c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔甞聞，憂悅伽王於晝睡眠，有二內官，一在頭前，一在脚底，持扇捉拂共作論議：「我等今者為王所念，為以何事？」",
        "translation": "I've heard in the past that when King Aśoka was asleep during the day, two inner officials, one at his head and the other at his feet, held a fan and picked up a whisk, and argued together, \"What are the reasons we're in the king's thoughts now?\"",
        "source": "T04n0201_015:0340c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一則自稱是我業力，一則自稱我因王力，由是之故奉給於王。",
        "translation": "One claimed that it was the power of my actions, and the other claimed that it was the power of the king's cause; therefore, they served the king.",
        "source": "T04n0201_015:0340c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼二人數聞聽法並解議論，即說偈言：「如牛厲渡水，　　導正從亦正，　人王立正法，　　從者亦如是。」",
        "translation": "Those two then repeatedly heard and understood the teaching and discussed it, and they spoke in verse, saying, \"Like an ox vigorously crossing a river, it guides the right and follows the right, and the king establishes the right teaching, so does he follow it.\"",
        "source": "T04n0201_015:0340c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼二人由競理故其聲轉高，一作是言：「我依王活。」",
        "translation": "As a result of their competition for the truth, their voices rose, and one of them said, \"I rely on the king's life.\"",
        "source": "T04n0201_015:0340c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二者言：「我依業力。」",
        "translation": "The second said, \"I rely on the power of karma.\"",
        "source": "T04n0201_015:0340c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞是聲即便睡悟，而問之言：「何故高聲？」",
        "translation": "When the king heard this sound, he drowsily realized it and asked, \"Why is your voice raised?\"",
        "source": "T04n0201_015:0340c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王又聞彼二人諍理，雖復明知未斷我見，援黨己者王心不悅，即便向彼稱業力者說偈問言：「依於我國住，　　自稱是業力，　我今試看汝，　　為是誰力耶？」",
        "translation": "When the king heard those two disputing the principle, even though he clearly knew that they hadn't cut off their view of self, he was displeased with those who supported him and asked in verse, \"Suppose you claim to be the power of karma while living in my country, and now I examine you, \"Whose power is it?\"",
        "source": "T04n0201_015:0340c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是偈已往夫人所，語夫人言：「今當遣人來到汝邊，汝好莊嚴如帝釋幢夫人。」",
        "translation": "After speaking this verse, he went to the lady and said, \"Now, I will send someone to you who will be as adorned as Lady Tissa.\"",
        "source": "T04n0201_015:0340c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「當奉王教！」",
        "translation": "She replied, \"You will follow the king's instructions!\"",
        "source": "T04n0201_015:0340c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王以蒲萄漿與彼依王活者，送與夫人。",
        "translation": "The king then gave that man, who relies on the king's living, some pulp of grapes and sent it to his wife.",
        "source": "T04n0201_015:0340c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既遣之已作是思惟：「稱業力者今應當悔作如是語。」",
        "translation": "After he sent it away, he thought, \"Now, that person with the power of karma should repent and say this.\"",
        "source": "T04n0201_015:0340c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已未久之間，彼業力者著好衣服來至王邊。",
        "translation": "Not long after that thought, that person with the power of karma dressed in good clothes came to the king.",
        "source": "T04n0201_015:0340c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王見之已，甚大生怪，即說偈言：「我為自錯誤，　　與彼殘漿耶？",
        "translation": "When the king saw him, he was very surprised and spoke in verse, \"Did I err on my own with that leftover milk?",
        "source": "T04n0201_015:0340c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為是彼業力，　　強奪此將去？",
        "translation": "Is it because of their karmic power that they are forced to take this away?",
        "source": "T04n0201_015:0340c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或能共親厚，　　與彼使將去？",
        "translation": "Perhaps we can be intimate with them, and they will let us go?",
        "source": "T04n0201_015:0341a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或是夫人瞋，　　奪此與彼乎？",
        "translation": "Or is it that the lady is angry and takes this and that away?",
        "source": "T04n0201_015:0341a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或能我迷誤，　　而與於彼耶？",
        "translation": "Could I have been mistaken and given it to them?",
        "source": "T04n0201_015:0341a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或能彼幻我，　　使我錯亂乎？」",
        "translation": "Perhaps they can illuminate me and cause me to be confused?\"",
        "source": "T04n0201_015:0341a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是偈已問彼人言：「好實語我，汝恃業力我故不遣，汝云何得？」",
        "translation": "After speaking this verse, he asked that person, \"Well, you really said to me, 'You rely on the power of karma, and I won't let you go, so how did you get it?'\"",
        "source": "T04n0201_015:0341a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人白王：「以業力得。」",
        "translation": "That man said to the king, \"I got it by the power of my actions.\"",
        "source": "T04n0201_015:0341a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即以事狀具向王說：「此人奉使既出門已，卒爾鼻衂，即以此漿與我使送，到夫人邊得是衣服。」",
        "translation": "He then explained the whole story to the king, \"After this man left the gate at the request of his messenger, he suddenly got a sore nose, so he gave this liquid to my messenger and went to the lady's side to obtain these clothes.\"",
        "source": "T04n0201_015:0341a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞是已，即說偈言：「業報如影響，　　亦如彼莊嚴，　彼言自業力，　　此語信不虛。",
        "translation": "After hearing this, the king spoke in verse, saying, \"The results of actions are like effects, and they're also like their adornment; they say they have the power of their own actions, but this statement is not false.",
        "source": "T04n0201_015:0341a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以聽法力故，　　言說合於理，　彼稱業力者，　　斯言定有驗。",
        "translation": "Because of the power of listening to the teaching, his words match the reason, and he claims that the power of karma is certainly valid.",
        "source": "T04n0201_015:0341a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我多於己負，　　彼憑業力勝，　佛說業力強，　　此語信真實。",
        "translation": "I'm much weaker than myself, and he relies on the power of karma to prevail. The Buddha teaches that the power of karma is strong, and this statement is believed to be true.",
        "source": "T04n0201_015:0341a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛為善御乘，　　業力為善哉，　能壞王者力。",
        "translation": "The Buddha is a good defender of the vehicle, and karmic power is good, capable of destroying a king's power.",
        "source": "T04n0201_015:0341a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　十方佛世尊，　亦說隨業力。",
        "translation": "The buddha world-honored ones in the ten directions also teach that it's based on the power of karma.",
        "source": "T04n0201_015:0341a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝今倚業力，　用自莊嚴身，　　割絕於我力。」",
        "translation": "Now, rely on the power of karma to adorn yourself with its own body and cut off my power.\"",
        "source": "T04n0201_015:0341a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（七四）復次，雖與智者共為讎郄猶能利益，是故智人雖與為讎，常應親近。",
        "translation": "(74) Furthermore, even though he shares a grudge with a wise man, he's still able to benefit him; therefore, even though he shares a grudge with a wise man, he should always be close to him.",
        "source": "T04n0201_015:0341a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔曾聞，摩突羅國有婆羅門，聰明智慧不信佛法，亦不親近諸比丘等。",
        "translation": "I once heard that there was a Brāhmaṇa in Mathurā who was intelligent and wise, didn't believe in the Buddha's teaching, and didn't get close to the monks and so forth.",
        "source": "T04n0201_015:0341a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "共餘婆羅門先有鬪諍，以瞋恚故詣僧坊中，詐為妄語作如是言：「某婆羅門明日於舍設諸供具，當作大會請諸比丘。」",
        "translation": "After a dispute with another Brāhmaṇa, he went to the monastery out of anger and made a false statement, saying, \"Some Brāhmaṇa will set up offerings in his abode tomorrow and will invite the monks to a large assembly.\"",
        "source": "T04n0201_015:0341a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲令比丘明晨往至其家不得飲食，令彼惡名遍於世界。",
        "translation": "They wanted to cause the monks to go to their houses in the morning and not allow them to eat or drink, so that their bad reputation would spread throughout the world.",
        "source": "T04n0201_015:0341a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘於其晨朝往詣其家，語守門人：「汝家主人請我飲食，汝可往白。」",
        "translation": "The monks then went to their house in the morning and said to the gatekeeper, \"Your master invited me to eat, so you may go and tell him.\"",
        "source": "T04n0201_015:0341a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時守門者入白主人：「今者門外有諸比丘，云大家請故來相造。」",
        "translation": "The gatekeeper then entered and said to the master, \"Now, there are some monks outside the gate who have come to make this happen because they've been invited by the house.\"",
        "source": "T04n0201_015:0341a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "主人聞已作是思惟：「何因緣故有如是事？」",
        "translation": "After hearing this, the master thought, \"What are the causes and conditions for this to happen?\"",
        "source": "T04n0201_015:0341b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是念：「彼婆羅門與我為怨，故為此事。",
        "translation": "\"Again, he thought, 'That Brāhmaṇa and I have a grudge against each other, so he did this.",
        "source": "T04n0201_015:0341b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今雖臨中，城邑極大，遣人市具供諸比丘。」",
        "translation": "Even though we're in the middle of it, the town is so large that I'd like to send someone to market provisions for the monks.\"",
        "source": "T04n0201_015:0341b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，即時遣人喚諸比丘入舍就坐，設種種食而以供養。",
        "translation": "After that thought, he immediately summoned the monks to sit in his dwelling and prepared a variety of foods to serve them.",
        "source": "T04n0201_015:0341b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘食訖語檀越言：「汝今小坐，比丘之法，食訖應為檀越說法，汝雖不信，佛法應爾。」",
        "translation": "When the monks had finished eating, they said to the donor, \"Now, sit down small; after you finish eating, you should explain the teaching to the donor, even though you don't believe it.",
        "source": "T04n0201_015:0341b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼主人即取小床，上座前坐。",
        "translation": "The monk's master then took a small bed and sat down in front of the elder monk's seat.",
        "source": "T04n0201_015:0341b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為說施論戒論生天之論，欲為不淨出世為樂，乃至為說四真諦法。",
        "translation": "He taught the theory of generosity, the theory of precepts, the theory of birth in heaven, the desire to be impure and transcend the world as pleasure, and even the teaching of the four true truths.",
        "source": "T04n0201_015:0341b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門已於過去種諸善根，即於坐上見四真諦得須陀洹，而說偈言：「咄哉愚癡力，　　能害於正見，　愚者不分別，　　寶作非寶想。",
        "translation": "Having planted good roots in the past, this brāhmaṇa then sat down and saw the four true truths and attained stream entry, saying, \"It's amazing how the power of foolishness can harm right views, how foolish people don't discriminate, and how they conceive of treasures as not treasures.",
        "source": "T04n0201_015:0341b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今得勝利，　　分別識三寶，　真實是我寶，　　佛法及聖眾。",
        "translation": "Now, I've attained victory, discerning the three treasures, which are really my treasures, the Buddha, the Dharma, and the noble ones.",
        "source": "T04n0201_015:0341b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我已諦睹了，　　得閉三惡道，　釋梵諸天等，　　所不能獲得，　我今具獲得。",
        "translation": "I've clearly seen them, and I've been able to shut out the three bad destinies, which the gods of Indra and Brahmā couldn't obtain, and now I've obtained them all.",
        "source": "T04n0201_015:0341b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　今此婆羅門，　即名為梵天，　　今當得趣向，　解脫不死方。",
        "translation": "Now, this Brāhmaṇa, which is called the Brahma Heaven, will now be headed to a place of liberation and immortality.",
        "source": "T04n0201_015:0341b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我今始獲得，　婆羅門勝法。",
        "translation": "Now, I've just attained the surpassing Dharma of the Brāhmaṇas.",
        "source": "T04n0201_015:0341b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我本姓輸都，　今日真輸都，　　今日始獲得，　勝妙比陀法。",
        "translation": "My original family name was Śuddhodana, but today I'm really Śuddhodana, and today I've just attained the surpassingly wonderful teaching of Bhītā.",
        "source": "T04n0201_015:0341b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我今得無漏，　出過諸比陀，　　我今真實是，　祠祀大福田。",
        "translation": "Now, I've attained uncontaminatedness, surpassing all the bhikṣus, and now I truly am a great field of merit for worship.",
        "source": "T04n0201_015:0341b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我當勤大祠，　不能善分別，　　可祠不可祠？",
        "translation": "I will diligently conduct a great shrine, but I can't well discern whether it's a shrine or not.",
        "source": "T04n0201_015:0341b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　從今日已往，　　當供天中天，　多陀阿伽陀。",
        "translation": "From this day forward, he'll make offerings to the god of gods, the Tathāgata.",
        "source": "T04n0201_015:0341b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　略說而言之，　今日始得利，　　獲得人身果。",
        "translation": "To recapitulate, today is the first day he'll reap the benefits and attain the fruit of his personhood.",
        "source": "T04n0201_015:0341b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　從今日已往，　　當隨佛所教，　終更不求請，　　其餘諸天神。",
        "translation": "From this day forward, I will follow the Buddha's teachings and never again seek to please the other gods.",
        "source": "T04n0201_015:0341c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今所學法，　　隨順向正道，　法及隨順法，　　我必得其果。",
        "translation": "Now, I've studied the Dharma, followed it toward the right path, and I'll surely attain its fruit as a result of following the Dharma and the teachings.",
        "source": "T04n0201_015:0341c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今歸命禮，　　宿世厭惡根，　曾修法向法，　　今獲其果利。",
        "translation": "I now pay homage to those who, in a past life spent disillusioned with bad roots, cultivated the Dharma and headed for the Dharma, and now I've reaped its benefits.",
        "source": "T04n0201_015:0341c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　親近善知識，　　法利自然成，　我若不親近，　　大悲弟子者，　永當墮邪見，　　輪迴三惡道。",
        "translation": "If I don't become close to a good teacher, the benefits of the Dharma will come naturally; if I don't become close to him, the greatly compassionate disciple will always fall into mistaken views and be reborn into the three bad destinies.",
        "source": "T04n0201_015:0341c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若無婆羅門，　　為我怨讎者，　亦不得親近，　　如此之聖眾。",
        "translation": "If there were no brāhmaṇas who would be my enemies, I wouldn't be able to get close to such a noble assembly.",
        "source": "T04n0201_015:0341c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由彼瞋忿故，　　令我得是法，　外相似惡友，　　實是善知識，　恩過於父母，　　及以諸親戚。",
        "translation": "Because of their anger, I've attained this teaching, which outwardly resembles a bad friend but is really a good teacher, more kind than parents or relatives.",
        "source": "T04n0201_015:0341c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由此婆羅門，　　諸僧至我家，　降注於甘雨，　　善芽悉得生。",
        "translation": "From this Brahmin, the monks who came to my house sent down a sweet rain, and good shoots were all produced.",
        "source": "T04n0201_015:0341c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　法雨甚潤澤，　　灑我心埃塵，　埃塵既不起，　　得見真實法。",
        "translation": "The Dharma rain is so moistened that it sprinkles the dust of my mind, and once that dust rises, I can see the true teaching.",
        "source": "T04n0201_015:0341c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故世間說，　　因怨得財賄。」",
        "translation": "That's why the world says, 'Wealth and bribes are obtained because of enmity.'",
        "source": "T04n0201_015:0341c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自惟得大利，　　即受三歸依。",
        "translation": "Because he himself thinks he's gained great rewards, he immediately accepts the three refuges.",
        "source": "T04n0201_015:0341c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於彼婆羅門，　　大設諸餚饍。",
        "translation": "At that brāhmaṇa's gate, he serves up a great variety of foods.",
        "source": "T04n0201_015:0341c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（七五）復次，若人精誠以財布施，如華獲財業，以知是事應至心施。",
        "translation": "(75) Furthermore, if someone sincerely gives with wealth, it's like a flower obtaining wealthy karma, knowing that this is something to be given with the utmost care.",
        "source": "T04n0201_015:0341c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔曾聞，罽賓國人夫婦共在草敷上臥，於天欲明善思覺生，作是思惟：「此國中人無量百千，皆悉修福供養眾僧，我等貧窮值此寶渚，不持少寶至後世者，我等衰苦則為無窮，我今無福將來苦長。」",
        "translation": "I once heard that a man and wife in the country of Kāśmī were lying together on a bed of grass, and they wished to know that good thoughts had arisen in the heavens, thinking, \"There are measureless hundreds of thousands of people in this country who cultivate goodness and support the saṃgha.",
        "source": "T04n0201_015:0341c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，悲吟嘆息，展轉哀泣淚墮婦上。",
        "translation": "After that thought, he sighed with pity, wept, and fell into tears on the woman.",
        "source": "T04n0201_015:0341c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時其婦尋問夫言：「以何事故不樂乃爾？」",
        "translation": "The woman then asked her husband, \"What's the reason you're so unhappy?\"",
        "source": "T04n0201_015:0342a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「何故極悲慘？",
        "translation": "He then spoke the verse, saying, \"Why is it so miserable?",
        "source": "T04n0201_015:0342a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　數數而嘆息，　雨淚沾我臂，　　猶如以水澆。」",
        "translation": "He repeatedly sighed and sighed, raining tears on my arm like pouring water over it.\"",
        "source": "T04n0201_015:0342a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時其夫說偈答曰：「我無微末善，　　可持至後世，　思惟此事已，　　是故自悲嘆。",
        "translation": "The man then spoke a verse in reply, \"I have no trivial goodness that can be sustained into a later life, and after thinking about this, I lament.",
        "source": "T04n0201_015:0342a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世有良福田，　　我無善種子，　今身若後身，　　飢窮苦難計。",
        "translation": "'There are good fields of merit in the world, but I have no good seeds, and in this body or the next, starvation and suffering are difficult to fathom.'",
        "source": "T04n0201_015:0342a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　先身不種子，　　今世極貧窮，　今若不作者，　　將來亦無果。」",
        "translation": "If I hadn't planted seeds in the past, I'd be extremely poor in this world, and if I don't produce them now, they won't bear fruit in the future.\"",
        "source": "T04n0201_015:0342a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時其婦聞是偈已，語其夫言：「汝莫愁憂。",
        "translation": "After hearing this verse, the woman said to her husband, \"Don't be sad.",
        "source": "T04n0201_015:0342a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我屬於汝，汝於我身有自在力，若賣我身可得錢財滿汝心願。」",
        "translation": "I belong to you, and you have sovereign power over my body; if you sell my body, you can get money and possessions to fulfill your heart's desire.\"",
        "source": "T04n0201_015:0342a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時其夫聞婦此言，心生歡喜顏貌怡悅，語其婦言：「若無汝者我不能活。」",
        "translation": "Then, when the husband heard what she said, his heart rejoiced and his face was pleasant, and he said to her, \"Without you, I wouldn't be able to live.\"",
        "source": "T04n0201_015:0342a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「我身與汝身，　　猶如彼鴛鴦，　可共俱賣身，　　得財用修福。」",
        "translation": "He then spoke a verse, saying, \"My body and yours are like that mandarin duck; we could sell our bodies together to obtain wealth and cultivate virtue.\"",
        "source": "T04n0201_015:0342a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時夫婦二人詣長者家，作如是言：「可貸我金，一月之後若不得者，我等二人當屬於汝，一月之後我必不能得金相償分為奴婢，一月之中可供養諸比丘僧。」",
        "translation": "The couple then went to the elder's house and said, \"You can lend me gold; if I don't get it after one month, we'll both belong to you; after one month, I won't be able to get gold to pay for being divided into slaves and servants, and for one month I'll be able to support the monks and nuns.\"",
        "source": "T04n0201_015:0342a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時長者即便與金，既得金已自相謂言：「我等可於離越寺中供養眾僧。」",
        "translation": "The elder then even gave him the gold, and after he received it, he said to himself, \"We can support the monks at Revata Temple.\"",
        "source": "T04n0201_015:0342a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婦問夫言：「為用何日？」",
        "translation": "The woman asked her husband, \"What day will we use it?\"",
        "source": "T04n0201_015:0342a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「十五日。」",
        "translation": "He answered, \"Fifteen days.\"",
        "source": "T04n0201_015:0342a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「何故十五日？」",
        "translation": "And he asked, \"What's the reason for the fifteenth day?\"",
        "source": "T04n0201_015:0342a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時其夫以偈答曰：「世間十五日，　　拘毘等天王，　案行於世間，　　是佛之所說，　欲使人天知，　　是故十五日。」",
        "translation": "The husband then replied in verse, \"Fifteen days in the world, Kumbhâṇḍa, the king of gods, goes about the world, and this is what the Buddha teaches, wanting people and gods to know about it; therefore it's fifteen days.\"",
        "source": "T04n0201_015:0342a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時夫婦二人竭力營造至十三日，食具悉備送置寺上，白知事人言：「唯願大德！",
        "translation": "The husband and wife then did their best to build a monastery until the thirteenth day, when they brought all the food supplies to the monastery and said to the person in charge, \"Please, Mañjuśrī!",
        "source": "T04n0201_015:0342b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明十五日勿令眾僧有出外者，當受我請。」",
        "translation": "Tomorrow fifteen days, don't let any of the saṃgha go out into the world; you will accept my invitation.\"",
        "source": "T04n0201_015:0342b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼知事人答言：「可爾。」",
        "translation": "The person in charge replied, \"That's fine.\"",
        "source": "T04n0201_015:0342b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於十四日夫婦二人在寺中宿，自相勸喻，而說偈言：「告喻自己身，　　慎勿辭疲勞，　汝今得自在，　　應當盡力作。",
        "translation": "On the 14th, the husband and wife stayed at the temple, encouraged each other, and spoke in verse, saying, \"Tell them not to resign themselves to fatigue; now that you've attained freedom, you must exert yourself to the utmost.",
        "source": "T04n0201_015:0342b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　後為他所策，　　作用不自在，　徒受眾勞苦，　　無有毫釐利。」",
        "translation": "Subsequently, you'll be led by others, you won't be able to function freely, you'll suffer much labor, and you won't get a single bit of benefit.\"",
        "source": "T04n0201_015:0342b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說此偈已夫婦通夜不暫眠息，所設餚饍至明悉辦，夫語婦言：「善哉我曹！",
        "translation": "After speaking this verse, the couple didn't rest for a moment during the night, and the food they had prepared was ready by sunrise.",
        "source": "T04n0201_015:0342b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所作已辦，心願滿足。",
        "translation": "After accomplishing what I did, my heart's desire is fulfilled.",
        "source": "T04n0201_015:0342b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得是好日賣此一身，於百千身常蒙豐足。」",
        "translation": "On such a good day, I'll sell this one body, and I'll always have an abundance of a hundred thousand bodies.\"",
        "source": "T04n0201_015:0342b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有小國主施設飲食，復來至寺，而作是言：「願諸僧等受我供養。」",
        "translation": "A lord of a small country then provided food and drink, and he came back to the temple and said, \"May the saṃgha accept my offerings.\"",
        "source": "T04n0201_015:0342b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知事人言：「我等諸僧先受他請，更覓餘日。」",
        "translation": "The person in charge said, \"We monks first accepted another invitation, and we'll look for another day.\"",
        "source": "T04n0201_015:0342b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼小王慇懃啟白：「我今已眾務所逼，願受我請。」",
        "translation": "The young king then earnestly asked, \"Now that I've been pressed by many obligations, I wish to accept my invitation.\"",
        "source": "T04n0201_015:0342b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸僧默然無對。",
        "translation": "The monks then remained silent and didn't respond.",
        "source": "T04n0201_015:0342b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時國主語彼夫婦言：「我今自打揵椎，汝所造食當酬汝直。」",
        "translation": "The lord then said to the couple, \"Now, I'll strike my own gandharva, and you'll be rewarded for the food you've made.\"",
        "source": "T04n0201_015:0342b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時夫婦已聞此語，向彼國主五體投地，而白之言：「我之夫婦窮無所有，自賣己身以設供具，竟宿造供施設已辦，唯於今日自在供養，若至明日為他策使不得自由，願王垂矜莫奪我日。」",
        "translation": "Having heard those words, the husband and wife threw themselves to the ground and said, \"My husband and wife have nothing left, so they sold their bodies to make offerings, and after making offerings all night, they've made offerings only today.",
        "source": "T04n0201_015:0342b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「夫婦如鴛鴦，　　供設既已辦，　願必見憶念，　　明當屬他去。",
        "translation": "He then spoke the verse, \"A husband and wife are like gods and ducks; once they've made their offerings, I wish I could see and remember that they'll belong to someone else tomorrow.",
        "source": "T04n0201_015:0342b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　夫婦各異策，　　更無修福期，　如是自賣身，　　乃為修善故。」",
        "translation": "Each husband and wife has a different plan, and there's no more time to cultivate goodness; thus, they sell themselves for the cultivation of goodness.\"",
        "source": "T04n0201_015:0342b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼國王具聞斯事，讚言善哉，即說偈言：「汝善解佛教，　　明了識因果，　能用虛偽身，　　易於堅財命。",
        "translation": "Upon hearing this, the king of that country praised him as excellent and spoke a verse, saying, \"You well understand Buddhism and clearly know cause and effect, and you can use a false body to easily secure wealth and life.",
        "source": "T04n0201_015:0342b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝勿懷恐怖，　　恣聽汝所願。",
        "translation": "Don't be afraid; listen freely to your desires.",
        "source": "T04n0201_015:0342c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我為憐愍汝，　　以財償汝價，　汝今自苦身，　　終大獲利樂。」",
        "translation": "For your sake, I'll repay your price with wealth, and now you'll find great benefit and joy in your self-mortified body.\"",
        "source": "T04n0201_015:0342c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時國主說此偈已，聽彼夫婦供養眾僧，即以財物為彼夫婦酬他價直，又給夫婦自營產業，現受此報無所乏少。",
        "translation": "After speaking this verse, the lord of the land heard the couple's offerings to the saṃgha, so he paid them back with their goods and gave them to the couple to build their own business, which will now bring them no less reward.",
        "source": "T04n0201_015:0342c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（七六）復次，至心持戒乃至沒命得現果報。",
        "translation": "(76) Furthermore, their whole-hearted observance of precepts will bring about the present result even if their lives are lost.",
        "source": "T04n0201_015:0342c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔曾聞，難提拔提城有優婆塞，兄弟二人並持五戒。",
        "translation": "I once heard that there were two brothers and an upāsaka in Nandibhadra who observed the five precepts.",
        "source": "T04n0201_015:0342c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其弟爾時卒患脇痛氣將欲絕，時醫診之，食新殺狗肉并使服酒，所患必除。",
        "translation": "The brother then suddenly suffered from a pain in his chest that was about to kill him, and when the doctor examined him, he ate freshly killed dog meat and made him take wine, and the pain would surely go away.",
        "source": "T04n0201_015:0342c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "病者白言：「其狗肉者，為可於市買索食之，飲酒之事，願捨身命終不犯戒而服於酒。」",
        "translation": "The sick man said, \"That dog's meat is something you can buy and buy to eat in the market, and I wish to sacrifice my life so that I won't violate the precepts and take the wine.\"",
        "source": "T04n0201_015:0342c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其兄見弟極為困急，買酒語弟：「捨戒服酒以療其疾。」",
        "translation": "Seeing his brother in great distress, he bought some wine and told him, \"Renounce the precepts and take the wine to treat your illness.\"",
        "source": "T04n0201_015:0342c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟白兄言：「我雖病急，願捨身命，終不犯戒而飲此酒。」",
        "translation": "The younger brother said to him, \"Although I'm desperately ill, I'd like to spare my life and never violate the precepts by drinking this wine.\"",
        "source": "T04n0201_015:0342c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「怪哉臨命終，　　破我戒瓔珞，　以戒莊嚴身，　　不煩殯葬具。",
        "translation": "He then spoke a verse, saying, \"It's strange that at the end of my life I should have destroyed my diadem of precepts and adorned my body with precepts, so I didn't bother with funeral arrangements.",
        "source": "T04n0201_015:0342c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人身既難得，　　遭值戒復難，　願捨百千命，　　不毀破禁戒。",
        "translation": "Since it's difficult to obtain a human body and even more difficult to meet with the precepts, I'd like to lay down a hundred thousand lives so that I won't disparage the forbidden precepts.",
        "source": "T04n0201_015:0342c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無量百千劫，　　時乃值遇戒，　閻浮世界中，　　人身極難得，　雖復得人身，　　值正法倍難。",
        "translation": "For measureless hundreds of thousands of eons, it's only then that I encounter the precepts, and in the Jambudvīpa world, it's extremely difficult to obtain a human body, even though it's twice as difficult to obtain a human body and meet the right Dharma.",
        "source": "T04n0201_015:0342c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時復值法寶，　　愚者不知取，　善能分別者，　　此事亦復難。",
        "translation": "It's also difficult for a foolish person who doesn't know how to grasp the treasures of the Dharma and is able to skillfully discern them.",
        "source": "T04n0201_015:0342c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　戒寶入我手，　　云何復欲奪？",
        "translation": "How could I want to snatch the treasure of the precepts after it's entered my hand?",
        "source": "T04n0201_015:0342c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　乃是怨憎者，　　非我之所親。」",
        "translation": "They're just people who hate each other and aren't dear to me.\"",
        "source": "T04n0201_015:0342c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兄聞偈已答其弟言：「我以親故不為沮壞。」",
        "translation": "After hearing the verse, the older brother answered his younger brother, \"Because I'm close, I won't be discouraged.\"",
        "source": "T04n0201_015:0342c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟白兄言：「非為親愛乃是殘敗。」",
        "translation": "The younger brother said to the older brother, \"It's not affection, but rather cruelty.\"",
        "source": "T04n0201_015:0342c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「我欲向勝處，　　毀戒令墮墜，　損我乃如是，　　云何名親愛？",
        "translation": "He then spoke the verse, \"What do I call affection when I want to go to a superior place, disparage the precepts, and cause them to fall down, thus damaging me?",
        "source": "T04n0201_015:0342c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我勤習戒根，　　乃欲見劫奪，　所持五戒中，　　酒戒最為重。",
        "translation": "I've worked hard to cultivate the root of morality, but I want to see it taken away. Of the five precepts I uphold, the alcohol precept is the most important.",
        "source": "T04n0201_015:0343a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今欲強毀我，　　不得名為親。」",
        "translation": "Now, I want to be forced to disparage myself, so I won't be called a relative.\"",
        "source": "T04n0201_015:0343a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兄問弟言：「云何以酒為戒根本？」",
        "translation": "The older brother asked his younger brother, \"Why is alcohol the root of the precepts?\"",
        "source": "T04n0201_015:0343a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟即說偈以答兄言：「若於禁戒中，　　不盡心護持，　便為違大悲。",
        "translation": "The younger disciple then spoke a verse in reply to his brother, \"If he doesn't guard the precepts with all his heart, he'll be acting contrary to great compassion.",
        "source": "T04n0201_015:0343a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　草頭有酒渧，　尚不敢掁觸，　　以是故我知，　酒是惡道因。",
        "translation": "A drop of alcohol in the grass does not dare to touch it; therefore, I know that alcohol is the cause of a bad destiny.",
        "source": "T04n0201_015:0343a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　在家修多羅，　說酒之惡報，　　唯佛能別知，　誰有能測量？",
        "translation": "A lay practitioner who teaches about the bad consequences of alcohol is known only by the Buddha, and who else can measure it?",
        "source": "T04n0201_015:0343a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　佛說身口意，　三業之惡行，　　唯酒為根本，　復墮惡行中。",
        "translation": "The Buddha taught that of the three bad deeds of body, speech, and thought, alcohol is the only one that's fundamental, and it also leads to bad behavior.",
        "source": "T04n0201_015:0343a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　往昔優婆夷，　以酒因緣故，　　遂毀餘四戒，　是名惡行數，　　復名五大施，　亦是五無畏。",
        "translation": "In the past, Upāsikā had the cause and condition of alcohol, which led to the violation of the other four precepts, which are called the number of bad actions and are also called the five major gifts and the five fearlessnesses.",
        "source": "T04n0201_015:0343a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　酒為放逸根，　不飲閉惡道，　　能獲信樂心，　去慳能捨財。",
        "translation": "Alcohol is the root of dissipation, and not drinking it closes the bad path; it's a way to attain a happy mind, free from stinginess, and able to dispose of possessions.",
        "source": "T04n0201_015:0343a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　首羅聞佛說，　能獲無量益，　　我都無異意，　而欲毀犯者？",
        "translation": "Śūra has heard the Buddha teach that it's possible to obtain measureless benefits, and I don't disagree with any of them; why would he want to violate them?",
        "source": "T04n0201_015:0343a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　略說而言之，　寧捨百千命，　　不毀犯佛教，　寧使身乾枯，　　終不飲此酒。",
        "translation": "To recapitulate, it's better to sacrifice a hundred thousand lives than to violate Buddhism, and it's better to let your body dry up than to drink this wine.",
        "source": "T04n0201_015:0343a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　假設犯毀戒，　　壽命百千年，　不如護禁戒，　　即時身命滅。",
        "translation": "Suppose he violated the precepts and had a lifespan of a hundred thousand years, wouldn't it be better to guard the precepts and immediately perish with his body and life?",
        "source": "T04n0201_015:0343a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　決定能使差，　　我猶故不飲，　況今不定知，　　為差為不差？」",
        "translation": "Even though I was certain it would make a difference, I still wouldn't drink it, so why wouldn't I know for sure now whether it's a difference or not?\"",
        "source": "T04n0201_015:0343a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　作是決定心，　　心生大歡喜，　即獲見真諦，　　所患即消除。",
        "translation": "With this mind of determined concentration, his mind becomes greatly elated, and he sees the true truth, which immediately removes his afflictions.",
        "source": "T04n0201_015:0343a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（七七）復次，若信佛語，於諸外論猶如嬰愚顛狂所說，是故懃學佛法語論。",
        "translation": "(77) Furthermore, if someone believes the Buddha's words, then external discussions are like the delusional teachings of an infant; therefore, they diligently train in the discourse of the Buddha's teaching.",
        "source": "T04n0201_015:0343b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔曾聞，有一國名釋伽羅，其王名盧頭陀摩，彼王數數詣寺聽法。",
        "translation": "I once heard that there was a country named Śākyamuni and its king was named Rudhidharma, and that king visited a temple several times to listen to the teaching.",
        "source": "T04n0201_015:0343b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼法師說酒過失，爾時王難高座法師言：「若施他酒得狂癡者，今飲酒亦多，無狂癡報。」",
        "translation": "When that teacher of the Dharma explained the faults of alcohol, the king then challenged the teacher in his high seat, saying, \"If giving alcohol to others would cause delusion, and I drink a lot of alcohol now, I won't be rewarded for my delusion.\"",
        "source": "T04n0201_015:0343b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時法師指示外道等，其王見已，善哉善哉！",
        "translation": "The teacher then instructed the heretics and others, and the king saw them and said, \"Good, good!",
        "source": "T04n0201_015:0343b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有外道，自相議言：「彼說法者無所知見空指而已，王為法師已又不解，空稱善哉！",
        "translation": "Some non-Buddhists then said to themselves, \"That Dharma preacher doesn't know anything and sees nothing but empty fingers, and after the king became the Dharma teacher, he didn't understand it, so he called it good for being empty!",
        "source": "T04n0201_015:0343b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不能開解而答此問。",
        "translation": "I'm unable to answer this question with understanding.",
        "source": "T04n0201_015:0343b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然此眾中亦有大聰明勝人，何故不答王？」",
        "translation": "Still, there are some very intelligent and brilliant people in this crowd, so why won't they answer the king?\"",
        "source": "T04n0201_015:0343b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「法師有聰辯，　　善能答此義，　憐愍汝等故，　　護惜而不說。」",
        "translation": "He then spoke the verse, \"The Dharma teacher is wise and eloquent, and he's well able to answer this meaning; for your sake, he protects and cherishes it and doesn't explain it.\"",
        "source": "T04n0201_015:0343b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸外道言：「王為此法師，橫為通道理。」",
        "translation": "The non-Buddhists said, \"The king is this teacher of the Dharma, and he has an unobstructed understanding of the principle.\"",
        "source": "T04n0201_015:0343b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「我之所解更有異趣。」",
        "translation": "The king said, \"There's another aspect of my understanding that's different.\"",
        "source": "T04n0201_015:0343b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時王語法師言：「向所解義今可顯說。」",
        "translation": "The king then said to the Dharma teacher, \"Now, I can explain the meaning that I've been explaining.\"",
        "source": "T04n0201_015:0343b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法師答言：「我向所以指外道者，以諸外道各生異見有顛倒心，是故名為癡狂之人。」",
        "translation": "The teacher replied, \"I was referring to non-Buddhists because non-Buddhists each have different views and mistaken minds, which is why they're called deluded people.\"",
        "source": "T04n0201_015:0343b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「不必鬼入身，　　名為顛狂者，　邪見夜叉心，　　是為說顛狂。",
        "translation": "He then spoke a verse, saying, \"It's not necessary for a ghost to enter the body, which is called a deluded person, and this is called a mistaken view of the mind of a yakṣa, which is explained as being deluded.",
        "source": "T04n0201_015:0343b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　狂癡人過失，　　不知解其事，　汝等有狂過，　　一切種智說。",
        "translation": "A deluded person's faults and errors are not understood, and you have faults that are crazy when they're explained by all kinds of wisdom.",
        "source": "T04n0201_015:0343b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝違種智語，　　隨逐於邪見，　現見於神變，　　彼大仙所辱。",
        "translation": "You disregard the words of the various kinds of wisdom, follow wrong views, and see miracles in the present that are insulted by that great man.",
        "source": "T04n0201_015:0343b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　出過其禁限，　　顛狂先已成，　云何使我說，　　百千種狂因。",
        "translation": "Exceeding their limits, your delirium was first accomplished, so why would I explain the hundreds of thousands of causes of delirium?",
        "source": "T04n0201_015:0343b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　何故分別說？",
        "translation": "Why do you explain them differently?",
        "source": "T04n0201_015:0343b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　投淵及赴火，　自墜於高巔，　　捨棄於施戒。",
        "translation": "Plunging into an abyss and going into the fire, they plunge themselves to the top, forsaking the precepts of charity.",
        "source": "T04n0201_015:0343b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　逐迷邪狂倒，　　不修於正行，　狂惑墜巔火，　　賣鹽壞淨行。",
        "translation": "They follow delusion, error, and madness, don't cultivate right behavior, and their delusion leads them into the fire at the peak, selling salt and destroying their pure behavior.",
        "source": "T04n0201_015:0343c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　飲觸恒河水，　　是名立正行，　失淨及得正，　　有何因義趣？",
        "translation": "To drink the Ganges' water is to establish right practice, and what are the causes and objectives of losing purity and attaining right practice?",
        "source": "T04n0201_015:0343c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　賣肉眾惡集，　　三種神足變，　除此三種變，　　更亦有神變。",
        "translation": "\"After these three kinds of transformations, there are also miraculous transformations.",
        "source": "T04n0201_015:0343c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　唯有二六法，　　離此別無我，　現見仙神變，　　更見十三法。",
        "translation": "There are only two or six dharmas, and apart from these, there's no separate self. I now see the miraculous transformations of an immortal, and I also see 13 dharmas.",
        "source": "T04n0201_015:0343c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是顛狂事，　　其數乃有百，　現見投淵火，　　自墜於高巔。",
        "translation": "Such delusions, which number in the hundreds, are now seen as throwing themselves into an abyssal fire and falling to the top of a high mountain.",
        "source": "T04n0201_015:0343c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以此欲生天，　　此但是邪見，　非是生天因；　　戒施善調心，　即是生天因。",
        "translation": "They want to be born in heaven because of this, but this is wrong view, not a cause for birth in heaven; morality and generosity, well-conducted mind, are the causes for birth in heaven.",
        "source": "T04n0201_015:0343c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　賣鹽壞善行，　觸河除諸惡，　　賣鹽有大惡，　觸河有大善，　　如是有何義，　得名為善惡？",
        "translation": "Selling salt destroys good actions, while touching a river removes evils. There's great evil in selling salt, and there's great good in touching a river; what does this mean, to be called good and evil?",
        "source": "T04n0201_015:0343c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　婆羅門賣肉，　即墮於失法，　　捉刀亦失法，　若復賣於肉，　　滿三十六斤，　敗壞婆羅門。",
        "translation": "When a brāhmaṇa sells meat, he falls into the wrong dharma, and when he catches a knife, he also loses the dharma. If he sells meat for 36 pounds or more, that corrupts the brāhmaṇa.",
        "source": "T04n0201_015:0343c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　羅差及食蜜，　皆名為失法，　　見羅差甞蜜，　二俱成過患。",
        "translation": "Both rajas and honey are called misdeeds, and seeing rajas and honey being eaten is a fault.",
        "source": "T04n0201_015:0343c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　以秤欺誑人，　不成名為盜，　　賣肉成殺生。",
        "translation": "Using a scale to deceive people is not called stealing, and selling meat becomes killing.",
        "source": "T04n0201_015:0343c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　羊稻俱有命，　　食稻不成殺，　羊稻俱應食，　　何故食於稻，　而不食於羊？",
        "translation": "Both sheep and rice have lives, and eating rice doesn't kill them; both sheep and rice should be eaten, so why would you eat rice and not sheep?",
        "source": "T04n0201_015:0343c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝諸言自殺，　終不得生天，　　墜巖投淵水，　復言得生天。",
        "translation": "You say you've killed yourself, and you'll never be born in heaven, or you fall off a rock and plunge into an abyss of water and again say you'll be born in heaven.",
        "source": "T04n0201_015:0343c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　殺己言有罪，　餧養己身者，　　何故不得福？",
        "translation": "Why wouldn't someone who says they're guilty of killing themselves and feeds their own body attain good fortune?",
        "source": "T04n0201_015:0343c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　觀察不順理，　　皆是愚癡倒，　以是因緣故，　　名汝等為狂。",
        "translation": "Observing the illogical, they're all deluded, and because of this cause, you're called crazy.",
        "source": "T04n0201_015:0343c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此即是愚癡，　　羅剎之標相，　是故說汝等，　　成就顛狂法。",
        "translation": "This is folly, the hallmark of Rāṣṭrapāla, which is why we say you've achieved a delusional state.",
        "source": "T04n0201_015:0344a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此即是與酒，　　飲酒之因果，　瞋恚是癡因，　　瞋恚而黑濁，　能令顏色變。",
        "translation": "This is the cause and effect of drinking alcohol, which is the cause of delusion, and anger, which is black and turbid and can cause colors to change.",
        "source": "T04n0201_015:0344a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　以是因緣故，　瞋為瘦黑因，　　飲酒顏色濁，　此二俱能瘦。",
        "translation": "Because of these causes and conditions, anger is the cause of thinness and blackness, and drinking alcohol makes one's color turbid; both of these things can make one thin.",
        "source": "T04n0201_015:0344a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　目連見餓鬼，　汝先自飲酒，　　亦教人飲酒，　說言無罪報，　　是故今現在，　已獲餓鬼身，　　花報已如是，　果報方在後。」",
        "translation": "Mucilin saw a hungry ghost, 'You first drank wine yourself and taught others to drink wine, saying that it was the result of no fault; therefore, now, I've been given the body of a hungry ghost, and after this is the result of my flowering, the result will only come later.'\"",
        "source": "T04n0201_015:0344a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸婆羅門聞是語時，多有外道即時出家。",
        "translation": "When the brāhmaṇas heard these words, many laypeople immediately left home.",
        "source": "T04n0201_015:0344a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（七八）復次，善分別敬功德，不期於門族。",
        "translation": "（Furthermore, it's not expected of a disciple to well discriminate the merits of reverence.",
        "source": "T04n0201_015:0344a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔曾聞，花氏城中有二王子，逃走歸投末投羅國。",
        "translation": "I once heard that there were two princes from the city of Blossom who fled and threw themselves into the country of Mathurā.",
        "source": "T04n0201_015:0344a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼國中有一內官字拔羅婆若，為附傭國主，供養眾僧手自行食。",
        "translation": "At the time, there was an internal official there named Bālāvaja who was an attendant to the lord of the country and provided food for the monks themselves.",
        "source": "T04n0201_015:0344a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾僧食已遣人斂草上殘食持詣宮中，向食作禮然後乃食。",
        "translation": "After the monks ate, they sent someone to gather the leftover food from the grass and carry it to the palace, where they paid homage to the food before eating it.",
        "source": "T04n0201_015:0344a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘者分張與所親愛。",
        "translation": "The rest of the food was handed out to someone they loved.",
        "source": "T04n0201_015:0344a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「食彼殘食能破我患。」",
        "translation": "\"Eating that leftover food will help break my troubles.\"",
        "source": "T04n0201_015:0344a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故先取食之，授與二王子。",
        "translation": "He therefore first took the food and gave it to the two princes.",
        "source": "T04n0201_015:0344a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王子食已心惡賤故出外即吐，而作是言：「出家之人種種雜姓，我等今者食其殘食。",
        "translation": "After eating it, the princes' hearts were so miserable that they went out and vomited, saying, \"Now, we've eaten the leftover food of various people from different castes who have left home.",
        "source": "T04n0201_015:0344a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "食已吐棄，然後除過。」",
        "translation": "After we eat, we'll throw it up and then we'll be rid of our faults.\"",
        "source": "T04n0201_015:0344a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時附傭主聞是事已作如是言：「此二嬰愚極為無知。」",
        "translation": "When the servant master heard this, he said, \"These two babies are extremely ignorant.\"",
        "source": "T04n0201_015:0344a24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「得此餘食者，　　智者除過患，　彼生疑譏嫌，　　是名為嬰愚。",
        "translation": "He then spoke a verse, saying, \"A person who has access to this leftover food is a fool who's wise enough to remove the faults and become suspicious and slanderous enough to be called an infant.",
        "source": "T04n0201_015:0344a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛法觀察食，　　外道都悉無，　沙門觀察食，　　能除煩惱障。",
        "translation": "While non-Buddhists observe food, non-Buddhists all lack it, and ascetics observe food, which removes the afflictive hindrances.",
        "source": "T04n0201_015:0344a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　餘食牟尼觸，　　應當頂戴敬，　手捉殘食已，　　水洗已除過。」",
        "translation": "The rest of the food that the monks touch should be held in high esteem, and after grasping the leftover food in your hand, you should wash it in water to remove any mistakes.\"",
        "source": "T04n0201_015:0344b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "附傭主後日更不與殘食。",
        "translation": "The servant-owner then refrained from serving the leftover food on subsequent days.",
        "source": "T04n0201_015:0344b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時左右人問言：「何故不分食與二王子？」",
        "translation": "Those on his side then asked, \"Why didn't you share the food with the two princes?\"",
        "source": "T04n0201_015:0344b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「彼之不知解，　　沙門所食餘，　自恃種族故，　　觸之言不淨，　不生歡喜心，　　是故我不與。",
        "translation": "He then spoke the verse, \"They don't know what they're doing, and the rest of the food that ascetics eat is based on their own race.",
        "source": "T04n0201_015:0344b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不識沙門姓，　　不食於彼食，　不識我種姓，　　不應食我食。",
        "translation": "Not knowing the ascetic's family, they won't eat their food; not knowing my family, they shouldn't eat my food.",
        "source": "T04n0201_015:0344b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　沙門處處生，　　不如我種族，　我不如沙門，　　復不食我食。",
        "translation": "Where ascetics are born, they're not like my race, and I'm not like an ascetic, so I won't eat my food.",
        "source": "T04n0201_015:0344b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為言無種姓，　　亦無有年歲，　如馬無種族，　　內官亦如是。",
        "translation": "They say there's no family, and there's no age, like a horse without a race, so it is with an internal official.",
        "source": "T04n0201_015:0344b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　內官處處來，　　無有定方所，　唯睹我富貴，　　不看我種姓。",
        "translation": "The inner officials come from everywhere, have no set place, and see only my wealth and prosperity, not my family.",
        "source": "T04n0201_015:0344b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　但見富貴故，　　便食我殘食，　不食沙門食，　　是名為嬰愚。",
        "translation": "Seeing only wealth and prosperity, they then eat my leftover food instead of ascetic food, which is called infancy and folly.",
        "source": "T04n0201_015:0344b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　沙門心自在，　　具足七種財，　不食沙門食，　　而食我餘者，　猶如超半井，　　不見有是處。",
        "translation": "An ascetic's mind is free, endowed with seven kinds of possessions, and he doesn't eat ascetic food; instead, he eats the rest of mine, just like going halfway down a well and not seeing any place.",
        "source": "T04n0201_015:0344b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見我有勢力，　　王者之所念，　便食我餘食；　　苷蔗種中生，　輸頭王太子，　　如是種族來，　可不勝我耶？",
        "translation": "Seeing that I have power and influence, the king thinks, \"I'll eat the rest of my food.\" Wouldn't a prince of the Śuddhodana lineage, born from the seeds of the sugarcane, be superior to me?",
        "source": "T04n0201_015:0344b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　彼之勝智者，　無等無倫匹，　　不取其種姓，　唯取其德行。",
        "translation": "Their superior knowledge is unequalled, not equaled, and not based on their lineage but on their virtues and conduct.",
        "source": "T04n0201_015:0344b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　種族作諸惡，　亦名為下賤，　　具戒有智慧，　是名為尊貴。」",
        "translation": "A member of a certain family who does evil is also called inferior, but one who possesses precepts and wisdom is called noble.\"",
        "source": "T04n0201_015:0344b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二王子聞此語已，而作是言：「汝示正道即是我父，自今以往敬承所誨。」",
        "translation": "After hearing these words, the two princes said, \"This is my father, whom you showed the right path, and I've respected and accepted your teaching since then.\"",
        "source": "T04n0201_015:0344b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「汝今說種姓，　　殊為非法語，　因行無有定，　　知解無定方。",
        "translation": "He then spoke a verse, saying, \"What you're saying about castes is simply not true, for there's no set cause or condition for doing so, and there's no set way to know and understand it.",
        "source": "T04n0201_015:0344c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　語議正解了，　　不名為邊語，　如汝之所解，　　即是貴種族。」",
        "translation": "Correct understanding based on verbal discourse isn't called marginal speech; such is your understanding, which is noble in kind.\"",
        "source": "T04n0201_015:0344c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（七九）復次，若欲觀察知佛神變，視諸塔寺供養佛塔。",
        "translation": "(79) Furthermore, if you want to observe and know the Buddha's miracles, look at the stūpas and temples that house his stūpas.",
        "source": "T04n0201_015:0344c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔曾聞，阿梨車毘伽國，於彼城門有佛髮爪塔，近有尼俱陀樹，邊有井水。",
        "translation": "I once heard that in Alyacabhisa there was a stūpa of the Buddha's hair and claws at the city gate, a nyagrodha tree nearby, and a well of water at the edge.",
        "source": "T04n0201_015:0344c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門而白王言：「若遊行時見於彼塔，是沙門塚破王福德，王是大地作一蓋主，宜除此塔。」",
        "translation": "The Brāhmaṇa then said to the king, \"If you see that stūpa while promenading, it's an ascetic's stūpa that destroys the king's virtue; the king is the lord of the earth's one lid; it's better to get rid of this stūpa.\"",
        "source": "T04n0201_015:0344c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王信婆羅門語故，即勅臣下令：「速却此塔，明日我出時勿令復見。」",
        "translation": "Believing the words of the Brāhmaṇa, the king then commanded his ministers, \"Quickly get rid of this stūpa; tomorrow, when I leave, I won't let you see it again.\"",
        "source": "T04n0201_015:0344c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼城神與諸民眾皆悉悲涕。",
        "translation": "The gods of that city and the people there were all sad and tearful.",
        "source": "T04n0201_015:0344c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸優婆夷施設供養，又然燈者，作如是語：「我等今者是最後供養。」",
        "translation": "The upāsikās made offerings, and the one who turned on the lamp said, \"Now, this is the last offering we'll make.\"",
        "source": "T04n0201_015:0344c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有優婆塞抱塔悲泣，即說偈言：「我今最後抱，　　汝之基塔足，　猶如須彌倒，　　今日皆破傷，　十力世尊塔，　　於今遂破滅。",
        "translation": "Embracing the stūpa and weeping, the upāsikā said, \"Now, I'm the last to embrace your stūpa, and its base is like the fall of Sumeru. Today, it's all broken, and the tower of the World Honored One with the ten powers has now been destroyed.",
        "source": "T04n0201_015:0344c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我若有過失，　　聽我使懺悔，　眾生更不見，　　佛之所作業。」",
        "translation": "If I have transgressions, listen to my attempts to repent, for sentient beings won't see them again, nor will they see the work of the Buddha.\"",
        "source": "T04n0201_015:0344c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸優婆塞作如是言：「我等今者可還歸家，不忍能看人壞此塔。」",
        "translation": "The upāsaka then said, \"Now, we can return home because we can't bear to watch someone destroy this stūpa.\"",
        "source": "T04n0201_015:0344c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王後自遣人持鍬欲除，往到其所，塔樹盡無，即說偈言：「嗚呼甚可怪，　　舉城大出聲，　猶如海濤波，　　不見十力塔，　尼拘陀及井，　　莫知其所在？」",
        "translation": "When the queen sent someone with a shovel to remove it, she went to the place and found the stūpa completely gone. She then spoke in verse, saying, \"Whoops! That's strange! That big noise coming from the city! It's like waves in the ocean!",
        "source": "T04n0201_015:0344c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸婆羅門等，　　深心生慚怪。",
        "translation": "The brāhmaṇas and others were deeply conscience and surprised.",
        "source": "T04n0201_015:0344c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼王聞是已，　　生於希有想，　時王作是念：　　「誰持此塔去？」",
        "translation": "When the king heard this, he had this rare thought, and he thought, \"Who will carry this stūpa away?\"",
        "source": "T04n0201_015:0344c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　即自往詣塔，　　莫知其所在。",
        "translation": "They went to the stūpa on their own, but no one knew where it was.",
        "source": "T04n0201_015:0345a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時彼王遣千餘人，乘象馳馬四方推覓。",
        "translation": "The king then sent more than a thousand men on elephants and horses to search for it in all directions.",
        "source": "T04n0201_015:0345a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有老母在於道傍，見彼諸人行來速疾，即問之言：「何為乃爾？」",
        "translation": "An elderly mother was near the road, and when she saw how quickly those people were traveling, she asked, \"Why is that?\"",
        "source": "T04n0201_015:0345a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人答言：「推覓塔樹。」",
        "translation": "The people replied, \"Look for the stūpa tree.\"",
        "source": "T04n0201_015:0345a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼老母言：「我向於道見希有事，有塔飛空并尼俱陀樹，不憶其井。",
        "translation": "The old mother said, \"I've seen something wonderful on the road, a stūpa flying through the sky and a nyagrodha tree, and I don't remember its well.",
        "source": "T04n0201_015:0345a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見諸人等首戴天冠，頭垂花鬘身著諸花，持塔而去。",
        "translation": "I saw all those people wearing crowns of heavenly robes on their heads and flower garlands on their bodies, carrying the stūpa and departing.",
        "source": "T04n0201_015:0345a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我見去時生希有想。」",
        "translation": "When I saw them depart, I had the rare notion that there was something.\"",
        "source": "T04n0201_015:0345a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "指示去處，諸人聞已具以事狀還白於王。",
        "translation": "After they heard the instructions, they returned to the king with a full report of their situation.",
        "source": "T04n0201_015:0345a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞歡喜，即說偈言：「彼塔自飛去，　　為向天上耶？",
        "translation": "Rejoicing at what they heard, the king spoke a verse, \"Did that stūpa fly away on its own, headed for heaven?",
        "source": "T04n0201_015:0345a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今心信敬，　　極生大歡喜，　若我破此塔，　　當墮於地獄。」",
        "translation": "Now, I have faith and respect in my heart, and I rejoice greatly. If I were to break down this stūpa, I would fall into hell.\"",
        "source": "T04n0201_015:0345a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時王即向彼塔處大設供養，此塔即今名曰自移，塔及樹井離毘伽城三十里住。",
        "translation": "The king then made a great offering to that stūpa, which is now called 'Self-Distribution,' and the stūpa and its well of trees were located 30 miles from Vīji.",
        "source": "T04n0201_015:0345a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（八〇）復次，佛塔有大威神，是故宜應供養佛塔。",
        "translation": "(80) Furthermore, since the stūpa has great authority, it's appropriate to make offerings to it.",
        "source": "T04n0201_015:0345a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔曾聞，竺叉尸羅國彼有塔寺，波斯匿王以成火燒之，佛復安一棖，朽壞却之。",
        "translation": "I once heard that there was a stūpa in the country of Zhujiaśīla that the king of Prasenajit burned down with a fire, and then the Buddha installed another stūpa, which decayed and disappeared.",
        "source": "T04n0201_015:0345a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼國王名枸沙陀那，有一比丘求請彼王：「我今為塔作棖，願王聽取，有大樹者王莫護惜。」",
        "translation": "When the king of that country was named Vaiśravaṇa, a monk asked the king, \"Now, I would like the king to listen to me as I build a shrine for the stūpa, and I hope the king will listen to me and not guard any large trees.\"",
        "source": "T04n0201_015:0345a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即語言：「除我宮內所有樹木，餘樹悉取。」",
        "translation": "The king then said, \"Except for all the trees in my palace, take all the other trees.\"",
        "source": "T04n0201_015:0345a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得王教已，諸比丘等處處求覓，於一村邊有大池水，上有大樹，名稱首伽樹，龍所護持，近惡龍故人無敢觸。",
        "translation": "After the king taught them, the monks went from place to place, and there was a large lake at the edge of a village, and on top of it was a large tree named the śūga tree, which is guarded by dragons and which no one dares to touch because they're near a bad dragon.",
        "source": "T04n0201_015:0345a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其樹極大，若復有人取枝葉者，龍能殺之，以是之故人無敢近。",
        "translation": "That tree is so large that if someone were to take its branches and leaves, a dragon could kill them; therefore, no one would dare to approach it.",
        "source": "T04n0201_015:0345a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人語言：「彼有大樹。」",
        "translation": "Some people say, \"There's a huge tree!\"",
        "source": "T04n0201_015:0345a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時比丘即將諸人齎持斧器欲往斫伐。",
        "translation": "The monks then asked the others to bring axes and weapons and try to chop it down.",
        "source": "T04n0201_015:0345a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時復有人語比丘言：「此龍極惡。」",
        "translation": "Another person then said to the monk, \"This dragon is extremely evil!\"",
        "source": "T04n0201_015:0345a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘語言：「我為佛事，不畏惡龍。」",
        "translation": "The monk said, \"I work for the Buddha, and I'm not afraid of bad dragons.\"",
        "source": "T04n0201_015:0345a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有奉事婆羅門語比丘言：「彼龍極惡，若伐此樹多所傷害，莫斫破此樹。」",
        "translation": "A serving brāhmaṇa then said to the monk, \"That dragon is extremely dangerous; if you cut down this tree, it would do much harm; don't chop down the tree.\"",
        "source": "T04n0201_015:0345a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門即說偈言：「汝不聞彼賊，　　慳貪故暫作，　而能於一切。",
        "translation": "The brāhmaṇa then spoke in verse, saying, \"Don't you hear that thief, who acts temporarily out of stinginess and greed, is capable of doing it to everything?",
        "source": "T04n0201_015:0345b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝當憶此事，　常應自擁護，　　莫為此樹故，　即致於傷害。」",
        "translation": "Remember this, and always protect yourself; don't do harm because of this tree.\"",
        "source": "T04n0201_015:0345b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘復說偈言：「汝為毒龍故，　　而自生貢高，　我依人中龍，　　恃彼亦自高，　觀汝力為勝，　　如是我得勢，　令使眾人見。",
        "translation": "The monk then spoke another verse, saying, \"You make yourself proud because you're a poisonous dragon, and I rely on a dragon among men to elevate myself, considering your strength to be superior, and thus I've gained the strength to make myself visible to everyone.",
        "source": "T04n0201_015:0345b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我為敬佛故，　今當捨身命。",
        "translation": "Because I want to honor the Buddha, I will now lay down my life.",
        "source": "T04n0201_015:0345b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸毒龍眾中，　汝為作龍王，　　生大恭敬想，　佛為柔調寂，　　及是眾中王，　我今亦恭敬，　　如來婆伽婆，　誰能降毒龍，　　而為弟子者？」",
        "translation": "Of all the poisonous dragons, who among you would be the dragon king and give rise to the idea of great respect, that the Buddha is pliable and tranquil, and that he's the king of them all, and that I also respect him now, thus Tathāgata Bhagavān, who could subdue a poisonous dragon and become his disciple?\"",
        "source": "T04n0201_015:0345b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時比丘共婆羅門，各競道理遂共鬪諍。",
        "translation": "At the time, the monks and the Brāhmaṇa were each competing for reason, and they then fought each other.",
        "source": "T04n0201_015:0345b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時比丘即伐其樹，亦無雲雷變異之相。",
        "translation": "The monk then felled the tree, but there were no clouds or thunderbolts that changed its appearance.",
        "source": "T04n0201_015:0345b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門睹斯事已，而說偈言：「先若取枝葉，　　雲起雷霹靂，　汝為呪所伏，　　為死至後世。」",
        "translation": "After he saw this, the brāhmaṇa spoke a verse, saying, \"If you had first taken the branches and leaves, the clouds would have arisen, thundering, and the thunderbolt would have struck, and you would have been overpowered by the curse, and you would have died and gone to the afterlife.\"",
        "source": "T04n0201_015:0345b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時婆羅門說是偈已，即便睡眠夢見毒龍，向己說偈：「汝莫起瞋恚，　　此名現供養，　非為輕毀我。",
        "translation": "After speaking this verse, the brāhmaṇa then fell asleep and dreamt that he saw a poisonous dragon that spoke to him in verse, \"Don't get angry; this is called making offerings now, not to disparage me.",
        "source": "T04n0201_015:0345b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　吾身自負塔，　況樹作塔棖，　　而我能護惜？",
        "translation": "I myself am responsible for the stūpa, so why wouldn't a tree make a stūpa that I could protect and cherish?",
        "source": "T04n0201_015:0345b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　十力世尊塔，　　我當云何護？",
        "translation": "\"What will I do to protect the tower of the World Honored One with the ten powers?",
        "source": "T04n0201_015:0345b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此林自生樹，　　而為佛塔故，　如是自生樹，　　云何得戀惜？",
        "translation": "\"This forest is a tree that grows by itself, and it's because of the stūpa. How can you be attached to such a tree that grows by itself?",
        "source": "T04n0201_015:0345b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　更有餘因緣，　　今當說善聽。",
        "translation": "\"There are other causes and conditions, but I will now explain them well and listen well.",
        "source": "T04n0201_015:0345b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我亦無勢力，　　德叉迦龍王，　自來取此樹，　　我云何能護？",
        "translation": "I also lack power, but how could I protect this tree when Takṣaka-nāga-rājā took it from me?",
        "source": "T04n0201_015:0345c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　伊羅鉢龍王，　　及以毘沙門，　躬自來至此，　　我有何勢力，　而能距捍彼，　　威德天龍等？",
        "translation": "\"Elāpattra and Vaiśravaṇa have come here on their own, so what power do I have that would enable me to stand up to them, the mighty celestial dragons and so forth?",
        "source": "T04n0201_015:0345c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來現在世，　　及以滅度後，　造立塔廟者，　　此二等無異。",
        "translation": "\"Tathāgatas in the present life and those who erect stūpas and temples after their extinction are not different.",
        "source": "T04n0201_015:0345c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸有得道者，　　人天及夜叉，　名稱遍十方，　　世界無倫匹。",
        "translation": "Those who attain the way, humans, gods, and yakṣas are named throughout the ten directions, and there's no equal in the world.",
        "source": "T04n0201_015:0345c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如此名聞故，　　塔棖懸寶鈴，　其音甚和雅，　　遠近悉聞知。」",
        "translation": "Because of this fame, a jeweled bell hangs from a stūpa, and its sound is so elegant that it's heard from near and far.\"",
        "source": "T04n0201_015:0345c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門聞是偈故，從睡眠寤即便出家。",
        "translation": "Hearing this verse, the Brāhmaṇa awoke from sleep and left home.",
        "source": "T04n0201_015:0345c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（八一）復次，我昔曾聞，有一老母背負酥瓨，在路中行，見菴摩勒樹即食其菓，食已患渴，尋時赴井乞水欲飲。",
        "translation": "(81) Furthermore, I once heard that there was an elderly woman carrying butter on her back who was walking along a road, saw a mango tree, and ate its fruit.",
        "source": "T04n0201_015:0345c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時汲水者即便與水，以先食菴摩勒菓之勢力故，謂水甜美味如石蜜，語彼人：「我以酥瓨易汝瓨水。」",
        "translation": "The water collector then gave him the water because of the power of the fruit he had eaten earlier, saying that the water was as sweet and delicious as rock honey, and he said to him, \"I'll give you some water to drink with my ghee.\"",
        "source": "T04n0201_015:0345c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時汲水人即隨其言與一瓨水，老母得已負還歸家。",
        "translation": "The water-drawer then gave him a quantity of water, just as he had said, and the old woman returned home with it.",
        "source": "T04n0201_015:0345c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既至其舍，先所食菴羅摩熱力已盡，取而飲之，唯有水味更無異味。",
        "translation": "When she arrived at her house, the heat from the ambrosia she'd eaten earlier had died down, so she took it, drank it, and it tasted like nothing but water and nothing else.",
        "source": "T04n0201_015:0345c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即聚親屬咸令甞之，皆言：「是水有朽敗爛繩汁埿臭穢極為可惡，汝今何故持來至此？」",
        "translation": "They all said, \"This water has a rotten, rotten rope, juice, and a foul-smelling stain, so why did you bring it here?\"",
        "source": "T04n0201_015:0345c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既聞斯語自取飲甞，深生悔恨：「我何以故，乃以好酥貿此臭水？」",
        "translation": "Having heard this, he took it upon himself to drink and eat it, and he deeply regretted it, \"Why did I trade this good butter for this stinking water?\"",
        "source": "T04n0201_015:0345c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生凡夫之人亦復如是，以愚無智故，以未來世功德酥瓨，貿易臭穢四顛倒瓨，謂之為好。",
        "translation": "\"So it is with all sentient beings and ordinary people who, because they're foolish and lack knowledge, trade in the ghee of future lives that's made of merit and water that's foul and four times perverted, and call it good.",
        "source": "T04n0201_015:0345c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於後乃知非是真實，深生悔恨，咄哉何為以功德酥瓨貿易顛倒臭穢之水？",
        "translation": "Only later does he realize that it's not true and deeply regret it, \"Gee, why would he trade confused, smelly, filthy water with ghee of merit?",
        "source": "T04n0201_015:0345c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而說偈言：「咄哉我何為，　　以三業淨行，　貿易著諸有？",
        "translation": "He spoke the verse, saying, \"Why is it that I trade and become attached to existence because of the three activities and pure practices?",
        "source": "T04n0201_015:0345c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如以淨好酥，　貿彼臭惡水。",
        "translation": "Suppose you take good, pure butter and drink its foul-smelling water.",
        "source": "T04n0201_015:0346a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　以食菴摩勒，　舌倒不覺味，　　臭水為甘露。」",
        "translation": "When they eat amalā, their tongues fail to taste it, and the foul-smelling water becomes sweet dew.\"",
        "source": "T04n0201_015:0346a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（八二）復次，我昔曾聞，有一長者婦為姑所瞋，走入林中自欲刑戮，既不能得，尋時上樹以自隱身，樹下有池影現水中。",
        "translation": "(82) Furthermore, I once heard about an elderly woman who was angered by her aunt and went into a forest to kill herself.",
        "source": "T04n0201_015:0346a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有婢使擔瓨取水，見水中影謂為是己有，作如是言：「我今面貌端正如此，何故為他持瓨取水？」",
        "translation": "A servant carrying a servant's load of water then saw the reflection in the water and thought it was her own. She said, \"Now that I'm looking so well, why would I carry and carry water for another person?\"",
        "source": "T04n0201_015:0346a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即打瓨破還至家中，語大家言：「我今面貌端正如是，何故使我擔瓨取水？」",
        "translation": "He then broke the water filter and returned home, saying to the group, \"Now that I'm looking so well, why did you make me carry water?\"",
        "source": "T04n0201_015:0346a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時大家作如是言：「此婢或為鬼魅所著，故作是事。」",
        "translation": "Everyone then said, \"Perhaps this servant girl is possessed by a demon, and that's why she's doing this.\"",
        "source": "T04n0201_015:0346a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更與一瓨詣池取水，猶見其影，復打瓨破。",
        "translation": "They then took one of them to the pond to get some water, but they still saw her reflection, so they beat it again and broke it.",
        "source": "T04n0201_015:0346a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時長者婦在於樹上，見斯事已，即便微笑。",
        "translation": "An elderly woman was up in a tree when she saw this, and she smiled.",
        "source": "T04n0201_015:0346a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婢見影笑，即自覺悟，仰而視之，見有婦女在樹上微笑，端正女人衣服非己，方生慚恥。",
        "translation": "Seeing the shadow smile, the servant realized on her own, looked up, and saw a woman smiling from a tree, whose proper attire wasn't her own, and then felt shame.",
        "source": "T04n0201_015:0346a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何因緣而說此喻？",
        "translation": "What are the reasons for speaking this parable?",
        "source": "T04n0201_015:0346a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為於倒見愚惑之眾，譬如薝蔔油香用塗頂髮，愚惑不解，我頂出是香。",
        "translation": "\"For the sake of deluded people with wrong views, it's like the fragrance of campaka oil applied to the top of the hair, which deluded people don't understand, and I produce this fragrance from the top of my head.",
        "source": "T04n0201_015:0346a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「未香以塗身，　　并熏衣纓珞，　倒惑心亦爾，　　謂從己身出，　如彼醜陋婢，　　見影謂己有。」",
        "translation": "He then speaks a verse, saying, \"Before it smeared my body with incense and perfumed my robe and necklace, so did the deluded mind say it came from my own body, like that ugly maid who sees a shadow and thinks she has it.\"",
        "source": "T04n0201_015:0346a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（八三）復次，猫生兒以小漸大，猫兒問母：「當何所食？」",
        "translation": "(83) Furthermore, when a cat gives birth to a child, it gradually grows larger as it gets smaller, and the cat asks its mother, \"What will it eat?\"",
        "source": "T04n0201_015:0346a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母答兒言：「人自教汝。」",
        "translation": "His mother answered her son, \"They'll teach you.\"",
        "source": "T04n0201_015:0346a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夜至他家隱甕器間，有人見已而相約勅：「酥乳肉等極好覆蓋，雞雛高舉莫使猫食。」",
        "translation": "When he went to his house at night and hid himself in a jar, someone saw him and promised him, \"This is a good covering for butter, milk, and meat; don't let the cat eat it while the chickens and children are up high.\"",
        "source": "T04n0201_015:0346a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猫兒即知，雞酥乳酪皆是我食。",
        "translation": "The cat then knew that the chicken, butter, and cheese were all mine to eat.",
        "source": "T04n0201_015:0346a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何因緣說如此喻？",
        "translation": "What was the reason he spoke this parable?",
        "source": "T04n0201_015:0346a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛成三藐三菩提道，十力具足心願已滿，以大悲心多所拯拔。",
        "translation": "Having accomplished the path of samyak-saṃbodhi, the Buddha has fulfilled the ten powers and fulfilled his heart's vow, and with great compassion he often rescues people.",
        "source": "T04n0201_015:0346a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊作如是念言：「當以何法而化度之？」",
        "translation": "At the time, the Bhagavān had this thought, \"What teaching will I use to deliver them?\"",
        "source": "T04n0201_015:0346a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大悲答言：「一切眾生心行顯現，以他心智觀察煩惱，一切諸行貪欲瞋恚愚癡之等長夜增長，常想樂想我想淨想展轉相承。",
        "translation": "Great Compassion replied, \"All sentient beings' minds and actions are manifested, and with the knowledge of other minds they observe the afflictions, all their actions such as craving, anger, ill-will, and folly grow overnight, and the perceptions of permanence, happiness, and self continue to carry on with each other.",
        "source": "T04n0201_015:0346b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作如是說，不能增長無常苦空無我之法。」",
        "translation": "Such an explanation doesn't lead to the growth of the dharma of impermanence, suffering, emptiness, and no-self.\"",
        "source": "T04n0201_015:0346b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故如來知此事已，為眾生說諸倒對治。",
        "translation": "Therefore, after the Tathāgata knew this, he explained the counteractments of error for sentient beings.",
        "source": "T04n0201_015:0346b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來說法微妙甚深，難解難入，謂道解說。",
        "translation": "The Tathāgata's explanation of the teaching is subtle and profound, difficult to understand and difficult to enter, and it's called the path of explanation.",
        "source": "T04n0201_015:0346b06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何而能為諸眾生說如斯法？",
        "translation": "How is it possible to explain such a teaching to sentient beings?",
        "source": "T04n0201_015:0346b07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸眾生有倒見想，觀察知已隨其所應為說法要。",
        "translation": "\"It's because sentient beings have mistaken views and perceptions, and after observing and knowing them, he explains the essentials of the teaching as he sees fit.",
        "source": "T04n0201_015:0346b08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生自有若干種行，是故知如來說對治法破除顛倒，如為猫兒覆肉酥乳。",
        "translation": "Since sentient beings have certain kinds of behavior, they know that the Tathāgata teaches the antidotes to remove delusion, just as he covers a cat's flesh with butter and milk.",
        "source": "T04n0201_015:0346b09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（八四）復次，我昔曾聞，有一國中施設石柱極為高大，除去梯隥樚櫨繩索，置彼工匠在於柱頭。",
        "translation": "(84) Furthermore, I once heard that there was a country where stone pillars were built so tall that they removed ladders, strung with bunched leather cords, and placed their craftsmen at the head of the pillars.",
        "source": "T04n0201_015:0346b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T04n0201_015:0346b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼若存活，或更餘處造立石柱，使勝於此。",
        "translation": "If they survive, they might erect a stone pillar somewhere else that would be superior to this one.",
        "source": "T04n0201_015:0346b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼石匠親族宗眷，於其夜中集聚柱邊，而語之言：「汝今云何可得下耶？」",
        "translation": "Then, during the night, his clan gathered around the pillar and said, \"Now, how could you get down there?\"",
        "source": "T04n0201_015:0346b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時石匠多諸方便，即擿衣縷垂二縷綫至於柱下。",
        "translation": "With much skill, the mason then picked out the thread of his garment and draped it with two strands of thread up to the bottom of the pillar.",
        "source": "T04n0201_015:0346b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其諸宗眷尋以麤綫繫彼衣縷，匠即挽取既至於上，手捉麤綫語諸親族：「汝等今者更可繫著小麤繩索。」",
        "translation": "When the clansmen sought to tie the thread of their robes with a coarse thread, the smith pulled it up and reached the top, grasped the coarse thread in his hand, and told the clansmen, \"Now, you may also tie a small coarse cord.\"",
        "source": "T04n0201_015:0346b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸親族即隨其語，如是展轉，最後得繫麤大繩索。",
        "translation": "Those clansmen then followed his words and thus transferred them, and eventually they were able to tie a large, coarse cord.",
        "source": "T04n0201_015:0346b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時石匠尋繩來下。",
        "translation": "The stonecutter then looked for the rope and brought it down.",
        "source": "T04n0201_015:0346b22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言石柱者喻於生死，梯隥樚櫨喻過去佛已滅之法，言親族者喻聲聞眾，言衣縷者喻過去佛定之與慧，言擿衣者喻觀欲過去味等法。",
        "translation": "The expression \"pillar of stone\" refers to birth and death, the expression \"steep plank\" refers to the extinction of past Buddhas, the expression \"kinsmen\" refers to the śrāvaka community, the expression \"thread of clothing\" refers to the concentration and wisdom of past Buddhas, and the expression \"picking at clothing\" refers to the contemplation of desires, past flavors, and so forth.",
        "source": "T04n0201_015:0346b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "縷從上下者喻於信心，繫麤縷者喻近善友得於多聞，細繩者多聞縷，復懸持戒縷，持戒縷懸禪定縷，禪定縷懸智慧繩，以是麤繩堅牢。",
        "translation": "The thread running up and down the rope is a metaphor for faith, and the one tied with the coarse thread is a metaphor for getting close to a good friend and becoming well-versed; the fine rope is the well-versed thread, which is also suspended from the thread of observing precepts, the thread of observing precepts is suspended from the thread of meditation, and the thread of meditation is suspended from the rope of wisdom; thus, the coarse rope is strong and resilient.",
        "source": "T04n0201_015:0346b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "繫者喻縛生死，從上下者喻下生死柱。",
        "translation": "It's a metaphor for binding to birth-and-death, and the one that goes up and down is a metaphor for descending the pillar of birth-and-death.",
        "source": "T04n0201_015:0346b29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「以信為縷綫，　　多聞及持戒，　猶如彼麤縷，　　戒定為小繩，　智慧為麤繩，　　生死柱來下。」",
        "translation": "\"With faith as the thread of the thread, well-versed people and adherents of precepts are like that coarse thread, morality and concentration are small ropes, and wisdom is a coarse rope that comes down from the pillar of birth-and-death.\"",
        "source": "T04n0201_015:0346c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（八五）復次，我昔曾聞，有一國中王嗣欲絕，時有王種先入山林學道求仙，即強將來立以為王，從敷臥具人索於衣服及以飲食。",
        "translation": "(85) Furthermore, I once heard that there was a king in a land where the heir was about to die out, and a member of the king's race who had first gone into the mountains to train on the path and seek immortality was forced to come back and establish himself as king and ask the laywer for clothing and food.",
        "source": "T04n0201_015:0346c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時敷臥具人而白王言：「各有所典，王於今者不應事事盡隨我索，我唯知敷臥具事；洗浴衣食，悉更有人，非我所當。」",
        "translation": "The bedding man then said to the king, \"Each has its own code, so the king shouldn't follow me in everything now; I only know about bedding; I'll wash and cleanse myself, and there's someone else who will provide food and clothing that aren't mine.\"",
        "source": "T04n0201_015:0346c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此喻可知一切諸業，如王敷臥具人各有所典，業亦如是，各各不同。",
        "translation": "This metaphor shows how all actions, like the king's bedding and bedclothes, have their own codes, and so do their actions, each one different from the other.",
        "source": "T04n0201_015:0346c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色無病者財物可愛，智等諸業各各別異，有業得無病，有業能得端正色力，如彼仙人從敷臥具人索種種物終不可得。",
        "translation": "Those whose form is disease-free have desirable possessions, while the activities of wisdom and so forth are each distinct, and there are activities that lead to the absence of disease and activities that lead to the power of correct form, like that sage who asks a laying-room attendant for various things that are ultimately unobtainable.",
        "source": "T04n0201_015:0346c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若生上族不必財富，諸業受報各各差別，不以一業得種種報。",
        "translation": "If he's born into a higher family, he doesn't need wealth, and the rewards of his actions are each distinct, so he doesn't obtain various rewards with a single action.",
        "source": "T04n0201_015:0346c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若作端正業，則得端正色力，財富應從餘業索。",
        "translation": "If someone does right actions, then they'll attain the power of right form, and their wealth will be obtained from other actions.",
        "source": "T04n0201_015:0346c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故智者應當修習種種淨業，得種種報。",
        "translation": "Therefore, wise people should cultivate various pure activities to obtain various rewards.",
        "source": "T04n0201_015:0346c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「無病色種族，　　智能各異因，　如彼仙人王，　　索備敷臥者。」",
        "translation": "\"People of the disease-free variety of appearance and intelligence have different causes, just like that sage king who makes provision for laying down.\"",
        "source": "T04n0201_015:0346c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（八六）復次，我昔曾聞，有一國王多養好馬，會有隣王與共鬪戰，知此國王有好馬故即便退散。",
        "translation": "(86) Furthermore, I once heard that there was a king who had many fine horses, and when some neighboring kings fought with him, they knew the king had fine horses and retreated.",
        "source": "T04n0201_015:0346c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時國王作是思惟：「我先養馬規擬敵國，今皆退散養馬何為？",
        "translation": "The king then thought, \"I was raising horses to prepare for an enemy country, but now they've all retreated and raised horses.",
        "source": "T04n0201_015:0346c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當以此馬用給人力，令馬不損於人有益。」",
        "translation": "Use these horses for human labor, so that the horses won't harm people and be beneficial to them.\"",
        "source": "T04n0201_015:0346c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，即勅有司令諸馬群分布與人，常使用磨經歷多年。",
        "translation": "After thinking this, I then ordered my commanding officer to distribute a herd of horses to the people, always using the polish for many years.",
        "source": "T04n0201_015:0346c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其後隣國復來侵境，即勅取馬共彼鬪戰，馬用磨故旋轉而行不肯前進，設加杖捶亦不肯行。",
        "translation": "When another neighboring country invades our country again, I'll order the horses to fight with them, but because they're using the polish, they'll spin around and refuse to advance, and even if they're beaten with a stick, they won't move.",
        "source": "T04n0201_015:0346c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生亦爾，若得解脫，必由於心，謂受五欲，後得解脫。",
        "translation": "Similarly, if sentient beings are to attain liberation, it must come from the mind, which is to say that they experience the five desires and then attain liberation.",
        "source": "T04n0201_015:0347a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "死敵既至，心意戀著五欲之樂，不能直進得解脫果。",
        "translation": "Once death and adversity have arrived, their minds are so attached to the pleasures of the five desires that they can't directly advance to attain the fruit of liberation.",
        "source": "T04n0201_015:0347a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「智慧宜調心，　　勿令著五欲，　本不調心故，　　臨終生愛戀。",
        "translation": "He then spoke this verse, \"Wisdom should temper the mind and keep it free from the five desires, for it's because the mind isn't tempered that longing arises at the end of life.",
        "source": "T04n0201_015:0347a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　心既不調順，　　云何得寂靜？",
        "translation": "Since the mind isn't tamed, how can it attain quiescence?",
        "source": "T04n0201_015:0347a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　心常耽五欲，　　迷荒不能覺，　心既不調順，　　云何得寂靜？",
        "translation": "The mind is always addicted to the five desires, so it's deluded and unable to awaken, and since the mind isn't in tune, how can it attain quiescence?",
        "source": "T04n0201_015:0347a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　心常耽五欲，　　迷荒不能覺，　如馬不習戰，　　對敵而旋行。」",
        "translation": "His mind is always addicted to the five desires, and he's so deluded and desolate that he can't perceive them, like a horse that hasn't practiced war and is moving quickly against the enemy.\"",
        "source": "T04n0201_015:0347a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（八七）復次，曾聞有一國王身遇疾患，國中諸醫都不能治。",
        "translation": "(87) Furthermore, there was once a story about a king who was stricken with an illness that none of the doctors in his country could treat.",
        "source": "T04n0201_015:0347a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有良醫從遠處來治王病差，王大歡喜作是思惟：「我今得醫力，事須厚報。」",
        "translation": "When a good doctor came from a distance to treat the king's ailment, the king rejoiced greatly and thought, \"Now that I've attained the power of a doctor, I'll need a generous reward for my efforts.\"",
        "source": "T04n0201_015:0347a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已微遣侍臣，多齎財物，詣於彼醫所住之處，為造屋宅養生之具，人民田宅象馬牛羊奴婢僕使，一切資產無不備具。",
        "translation": "After that thought, he sent his attendants with a small amount of money to the doctor's residence to build a house for his people, a farm, elephants, horses, cattle, sheep, slaves, servants, and messengers, and everything else he owned.",
        "source": "T04n0201_015:0347a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所造既辦王便遣醫使還其家。",
        "translation": "After completing what he had built, the king then sent the doctor's envoy back to his house.",
        "source": "T04n0201_015:0347a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼遠醫見王目前初無所遣，空手還歸，甚懷恨恨。",
        "translation": "When that faraway doctor saw that the king hadn't sent him anything in the first place, he returned home empty-handed and very much resented him.",
        "source": "T04n0201_015:0347a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既將至家，道逢牛羊象馬都所不識，問是誰許？",
        "translation": "When he arrived home, he met a man who didn't know any of the cattle, sheep, elephants, or horses and asked him who had given permission.",
        "source": "T04n0201_015:0347a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "並皆稱是彼醫名，是彼醫牛馬。",
        "translation": "They all say, \"That's the doctor's name, and that's the doctor's ox and horse.",
        "source": "T04n0201_015:0347a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂到家已，見其屋舍壯麗嚴飾，床帳氍[叟*毛]毾[登*毛]金銀器物，其婦瓔珞種種衣服。",
        "translation": "When he arrived home, he saw his house decorated in splendor, his bedrolls [old man * hair], coarse [deng * hair], gold and silver implements, and his wife's jewelry and various kinds of clothing.",
        "source": "T04n0201_015:0347a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時醫見已甚生驚愕，猶如天宮。",
        "translation": "When the doctor saw this, he was startled and looked at it like it was a celestial palace.",
        "source": "T04n0201_015:0347a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問其婦言：「如此盛事為何所得？」",
        "translation": "He asked the woman, \"How did you get such a splendid house?\"",
        "source": "T04n0201_015:0347a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婦答夫言：「汝何不知？",
        "translation": "The woman answered her husband, \"Why don't you know?",
        "source": "T04n0201_015:0347a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由汝為彼國王治病差故，生報汝恩。」",
        "translation": "Because you did such a good job healing that king's illness, you were born to repay your kindness.\"",
        "source": "T04n0201_015:0347a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫聞是已深生歡喜作是念言：「王極有德，知恩報恩，過我本望。",
        "translation": "After hearing this, the man is deeply delighted and thinks, \"The king is extremely virtuous and knows how to repay kindnesses beyond what I had hoped for.",
        "source": "T04n0201_015:0347a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由我意短，初來之時以無所得情用恨然。」",
        "translation": "Because my intentions were short, when I first came here I hated you for your unattained feelings.\"",
        "source": "T04n0201_015:0347a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此為喻，義體今當說。",
        "translation": "This is an example, the essence of which will now be explained.",
        "source": "T04n0201_015:0347a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "醫喻諸善業，王無所與喻未得現報身無所得，如彼醫者初不見物謂無所得心生恨恨，如彼今身修善見未得報，心生恨恨我無所得。",
        "translation": "The doctor is a metaphor for good actions, and the king's lack of possessions is a metaphor for the unattained present reward of the body, such as when that doctor first doesn't see things and thinks they're unattained and becomes hateful, like when he cultivates goodness in this body and sees the unattained reward, his mind becomes hateful and resents the fact that I've got nothing.",
        "source": "T04n0201_015:0347a29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既得至家者，猶如捨身向於後世。",
        "translation": "Now that they've attained home, it's like abandoning their body and looking toward the afterlife.",
        "source": "T04n0201_015:0347b04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見牛羊象馬群，如至中陰身，見種種好相，方作是念：「由我修善見是好報，必得生天。」",
        "translation": "Seeing a herd of cattle, sheep, elephants, and horses is like reaching the intermediate body and seeing all kinds of good features, and then they think, \"Because I cultivated goodness and saw this good reward, I'll surely be born in heaven.\"",
        "source": "T04n0201_015:0347b05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既至天上，喻到家中見種種盛事，方於王所生敬重心，知是報恩者，檀越施主。",
        "translation": "Once they reach heaven, it's like going home and seeing all kinds of great things, and then they become respectful to the king and know that they're a rewarder of kindness, a donor who transcends charity.",
        "source": "T04n0201_015:0347b07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得生天已，方知施戒受如此報，始知佛語誠實不虛，修少善業獲無量報。",
        "translation": "After he was born in heaven, he realized that this was the reward for bestowing precepts, and then he realized that the Buddha's words were true and not false and that cultivating a little good behavior would lead to measureless rewards.",
        "source": "T04n0201_015:0347b08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「施未見報時，　　心意有疑悔，　以為徒疲勞，　　終竟無所得。",
        "translation": "He then spoke this verse, \"When I gave alms and hadn't yet seen the reward, my mind had doubts and regrets, thinking it was a waste of effort and that I'd never get anything in the end.",
        "source": "T04n0201_015:0347b10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　既得生中陰，　　始見善相貌，　如醫到家已，　　方生大歡喜。」",
        "translation": "Now that I've been born in the intermediate aggregate, I've seen a good appearance, and I'm greatly elated after I've been given a home by a doctor.\"",
        "source": "T04n0201_015:0347b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（八八）復次，曾聞有二女人，俱得菴羅菓，其一女人食不留子，有一女人食菓留子。",
        "translation": "(888) Furthermore, I once heard that there were two women who both attained the fruit of amla, one of whom ate it but didn't leave any children, and another woman who ate the fruit but left children.",
        "source": "T04n0201_015:0347b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其留子者，覺彼菓美，於良好田下種著中，以時溉灌大得好菓。",
        "translation": "The one who keeps the fruit finds it beautiful, plants it under a good field, and irrigates it at the right time to obtain a great deal of good fruit.",
        "source": "T04n0201_015:0347b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如彼世人為善根本，多修善業，後獲果報。",
        "translation": "Just like that person's roots of goodness and their repeated cultivation of good actions eventually bring about their reward.",
        "source": "T04n0201_015:0347b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "合子食者，亦復如人不識善業，竟不修造，無所獲得，方生悔恨。",
        "translation": "The person who combines the fruit with food is likewise a person who doesn't realize the good actions, doesn't cultivate them after all, and doesn't attain them before they become remorseful.",
        "source": "T04n0201_015:0347b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「如似得菓食，　　竟不留種子，　後見他食菓，　　方生於悔恨。",
        "translation": "They then say, \"Suppose someone seemingly obtains fruit to eat but doesn't save the seeds, and later they see another person eating fruit, and then remorse arises.",
        "source": "T04n0201_015:0347b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　亦如彼女人，　　種子種得菓，　復生大歡喜。」",
        "translation": "It's like that woman who planted seeds and obtained fruit, and then became very happy.\"",
        "source": "T04n0201_015:0347b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（八九）復次，曾聞往昔有比丘名須彌羅，善能戲笑，與一國王諠譁歡悅稱適王意。",
        "translation": "(89) Furthermore, it was once heard that there once was a monk named Sumeru who was good at laughing and who partied with a king and made merry to suit the king's desires.",
        "source": "T04n0201_015:0347b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時比丘即從乞地欲立僧坊，王語比丘：「汝可疾走不得休息，盡所極處，爾許之地悉當相與。」",
        "translation": "The monk then went from begging for land to build a monastery, and the king said to the monk, \"You may walk quickly without resting, and you'll be given as much land as you like.\"",
        "source": "T04n0201_015:0347b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時比丘更整衣服，即便疾走，雖復疲乏，以貪地故，猶不止住，後轉疾極不能前進，即便臥地夗轉而行。",
        "translation": "The monk then readjusted his robes and started walking quickly. Although he was tired, he didn't stop because he craved the ground, and when he turned around and was too fast to advance, he lay down on the ground and turned around.",
        "source": "T04n0201_015:0347c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須臾復乏，即以一杖逆擲使去，作如是言：「盡此杖處悉是我地。」",
        "translation": "When he was again weary, he tossed a staff away against his will and said, \"All this staff is my ground.\"",
        "source": "T04n0201_015:0347c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已說譬喻，相應之義我今當說。",
        "translation": "I've already explained the parable, and I will now explain its concomitant meaning.",
        "source": "T04n0201_015:0347c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如須彌羅為取地故雖乏不止，佛亦如是，為欲救濟一切眾生，作是思惟：「云何當令一切眾生得人天樂及以解脫？」",
        "translation": "Just as Sumeru did not stop when he was weary because he wanted to get to the ground, so did the Buddha, wanting to save all sentient beings, think, \"How will this cause all sentient beings to attain the happiness and liberation of humans and gods?\"",
        "source": "T04n0201_015:0347c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如須彌羅走不休息，佛婆伽婆亦復如是，為優樓頻螺迦葉、鴦掘摩羅如是等人悉令調伏，有諸眾生可化度者，如來爾時即往化度。",
        "translation": "\"As Sumeru walks around without resting, so too does the Buddha Bhagavān make sure that Uruvilvā-Kāśyapa and Aṅgulimālīya and others are disciplined, and that the Tathāgata will then go and save those sentient beings who can be saved.",
        "source": "T04n0201_015:0347c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如須彌羅既疲乏已，即便臥地夗轉，佛亦如是，度諸眾生既已疲苦，以此陰身於娑羅雙樹倚息而臥，如迦尸迦樹斬伐其根悉皆墮落，唯在雙樹倚身而臥，猶故不捨精進之心，度拘尸羅諸力士等及須跋陀羅。",
        "translation": "Just as Sumeru became weary and lay down on the ground to turn over when he was tired, so did the Buddha, once he had finished taming sentient beings and become weary, take a resting place in this aggregate body by leaning against two trees at Sālvaśaila, like the Kāśīṅga tree that has had its roots chopped down and all fallen down, except for the two trees where he leans against his body and lies down, yet he still doesn't abandon his effort to tame the Kuśinagara warriors and others like Subhadra.",
        "source": "T04n0201_015:0347c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如須彌羅為得地故擲杖使去，佛亦如是，入涅槃時為濟眾生故，碎身舍利，八斛四斗，利益眾生，所碎舍利雖復微小如芥子等，所至之處人所供養與佛無異，能使眾生得於涅槃。",
        "translation": "Just as Sumeru tossed his staff away to gain ground, so did the Buddha. When he entered nirvāṇa, he broke his body into eight quadrillions of relics for the benefit of sentient beings, and although the broken relics were as small as a mustard seed, wherever they went people offered them up no different than the Buddha, enabling sentient beings to attain nirvāṇa.",
        "source": "T04n0201_015:0347c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說偈言：「如來躬自度，　　優樓頻螺等，　眷屬及徒黨，　　優伽鴦掘魔。",
        "translation": "He then spoke a verse, saying, \"The Tathāgata himself liberates Uruvilvā and others, his followers and disciples, and Ujjayin Māra.",
        "source": "T04n0201_015:0347c21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　精進禪度力，　　最後倚臥時，　猶度諸力士，　　須跋陀羅等。",
        "translation": "When he's finally reclining, he's still liberating warriors like Subhadra and others who have exerted their powers of meditation and deliverance.",
        "source": "T04n0201_015:0347c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　欲為濟拯故，　　布散諸舍利，　乃至遺法滅，　　皆是供養我。",
        "translation": "They want to help save lives by scattering relics, even after the disappearance of the Dharma, that are offered to me.",
        "source": "T04n0201_015:0347c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如彼須彌羅，　　擲杖使遠去。」",
        "translation": "They're like that Sumeru who throws his staff away.\"",
        "source": "T04n0201_015:0347c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（九〇）復次，我昔曾聞，竺叉尸羅國有博羅吁羅村，有一估客名稱伽拔吒，作僧伽藍，如今現在。",
        "translation": "(90) Furthermore, I once heard that in the village of Bolakula in the country of Zhujiaśīla, there was an appraiser named Garbhadhāṭa who worked as a monk's curator and is now present.",
        "source": "T04n0201_015:0347c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "稱伽拔吒先是長者子，居室素富，後因衰耗遂至貧窮，其宗親眷屬盡皆輕慢不以為人，心懷憂惱遂棄家去，共諸伴黨至大秦國，大得財寶還歸本國。",
        "translation": "He was the son of an elder who had lived in a wealthy house and then became poor because of decay. His clan and retinue all despised him and didn't think of him as a person.",
        "source": "T04n0201_015:0348a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸宗親聞是事已，各設飲食香華妓樂於路往迎。",
        "translation": "When the clansmen heard about this, they each provided food, drink, flowers, music, and prostitutes to meet them on the road.",
        "source": "T04n0201_015:0348a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時稱伽拔吒身著微服在伴前行，先以貧賤年歲又少，後得財寶其年轉老，諸親迎者並皆不識，而問之言：「稱伽拔吒為何所在？」",
        "translation": "They didn't recognize him, but they asked him, \"Where is Chenggabatta?\"",
        "source": "T04n0201_015:0348a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尋即語言：「今猶在後。」",
        "translation": "He then said, \"Still today, it's later.\"",
        "source": "T04n0201_015:0348a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至大伴中而復問言：「稱伽拔吒為何所在？」",
        "translation": "He went to the great company and again asked, \"Where is Śākyamuni?\"",
        "source": "T04n0201_015:0348a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸伴語言：「在前去者即是其人。」",
        "translation": "The companions said, \"He who goes before is the one who goes after.\"",
        "source": "T04n0201_015:0348a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時宗親往到其所，而語之言：「汝是稱伽拔吒，云何語我乃云在後？」",
        "translation": "The patriarch then went to him and said, \"Are you called Garbaṭṭa, and why are you saying that I'm behind you?\"",
        "source": "T04n0201_015:0348a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "稱伽拔吒語諸宗親言：「稱伽拔吒非我身是，乃在伴中駝驢駄上。",
        "translation": "\"Chenggabatta told the patriarchs, 'Chenggabatta isn't me, but rather he's on a camel and donkey among his companions.'",
        "source": "T04n0201_015:0348a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is that?",
        "source": "T04n0201_015:0348a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我身頃來，宗親輕賤初不與語，聞有財寶乃復見迎，由是之故在後駄上。」",
        "translation": "For a long time, my clan members despised me and didn't talk to me in the beginning, but when they heard about the treasure they had, they welcomed me back, and that's why I stayed up in Sendagiri.\"",
        "source": "T04n0201_015:0348a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宗親語言：「汝道何事，不解汝語？」",
        "translation": "The patriarch said, \"What do you know that you don't understand what you're saying?\"",
        "source": "T04n0201_015:0348a17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "稱伽拔吒即答之言：「我貧窮時共汝等語不見酬對，見我今者多諸財寶，乃設供具來迎逆我，乃為財來，不為我身。」",
        "translation": "That's how Jeonggabatha answered, \"When I was poor, we didn't see eye to eye with you people, and now we see that I have a lot of wealth and treasure, so we make offerings to welcome me.",
        "source": "T04n0201_015:0348a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發此喻者，喻如世尊，稱伽拔吒為得財物，鄉曲宗眷設供來迎，佛亦如是，既得成佛，人天鬼神諸龍王等悉來供養，非來供養我，乃供養作佛功德。",
        "translation": "This metaphor suggests that it's like the Bhagavān who called Garbhadhātu a treasure and made offerings to his retinue to welcome him, or the Buddha who, after becoming a buddha, was offered offerings by humans, gods, ghosts, dragons, and other beings, not to me but to the merits of the Buddha.",
        "source": "T04n0201_015:0348a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我未得道時、無功德時，諸眾生等不共我語，況復供養？",
        "translation": "When I hadn't yet attained enlightenment or had no merit, sentient beings didn't share my words, so why would they make offerings?",
        "source": "T04n0201_015:0348a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故當知供養功德不供養我，雖復廣得一切諸天人等之所供養亦無增減，以觀察故。",
        "translation": "Therefore, you should know that the merit of making offerings doesn't endow me, and even though I'm widely offered offerings by all gods and humans, there's no increase or decrease because of that observation.",
        "source": "T04n0201_015:0348a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「人天阿修羅，　　夜叉乾闥婆，　如是等諸眾，　　亦廣設供養。",
        "translation": "\"Humans, gods, asuras, yakṣas, and gandharvas, and so forth, also make extensive offerings.",
        "source": "T04n0201_015:0348a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛無歡喜心，　　以善觀察故，　是供諸功德，　　非為供養我。",
        "translation": "The Buddha's lack of joy is based on good observation, which is the merit of making offerings, not on making offerings to me.",
        "source": "T04n0201_015:0348b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如稱伽拔吒，　　指示諸眷屬，　稱己在後者，　　其喻亦如是。」",
        "translation": "Just as he calls himself Gṛdhrakūṭa and instructs his followers to call themselves after him, so is his metaphor.\"",
        "source": "T04n0201_015:0348b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大莊嚴論經卷第十五",
        "translation": "*Sūtrâlaṃkāra-śāstra, Vol. 15",
        "source": "T04n0201_015:0348b05_0",
        "is_bad_quality": false
    }
]