[
    {
        "source_sentence": "出曜經卷第十八",
        "translation": "Sutra of the Appearance of Light, Vol. 18",
        "source": "T04n0212_018:0704a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "姚秦涼州沙門竺佛念譯",
        "translation": "Yaoqin Liangzhou shaman Zhu Fonian Translation",
        "source": "T04n0212_018:0704a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雜品之二",
        "translation": "two of the miscellaneous items",
        "source": "T04n0212_018:0704a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎「自歸大聖雄，　　欲覲尊沙門，　　今欲自悔過，　　久來所作罪。」",
        "translation": "\"I take refuge in the great sage hero, wanting to visit the venerable ascetic, and now I want to repent for the sins I've committed over time.\"",
        "source": "T04n0212_018:0704a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊還現色相威神炳著，手執指鬘詣祇洹精舍告諸比丘：「汝等將此指鬘度為比丘。」",
        "translation": "At the time, the Bhagavān returned to his monastery with a dignified appearance, held a finger garland in his hand, and told the monks, \"You will make this finger garland a monk.\"",
        "source": "T04n0212_018:0704a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即如佛教得為道人，清旦著衣持鉢入舍衛城分越。",
        "translation": "That's when the Buddhist attained the status of a religious practitioner, put on his robe and took his bowl into the city of Śrāvastī at sunrise, and then he crossed over.",
        "source": "T04n0212_018:0704a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時城門裏有一牝象，懷妊欲產不時得產。",
        "translation": "At the time, there was a female elephant inside the city gates that was expecting a baby and could give birth from time to time.",
        "source": "T04n0212_018:0704a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "象主遙見比丘來即起迎逆。",
        "translation": "When the elephant owner saw the monk coming from a distance, he rose to meet him.",
        "source": "T04n0212_018:0704a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「比丘若能使象時產者，可得入城乞；不能使象產者，不得入城分越。」",
        "translation": "\"If a monk can get an elephant to give birth at a time, he can enter the city and beg; if he can't get an elephant to give birth, he won't be allowed to enter the city and partake of its rituals.\"",
        "source": "T04n0212_018:0704a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘答曰：「吾先不誦此呪，且小停住，須吾還至世尊所受誦神呪，還當呪之使得產。」",
        "translation": "The monk replied, \"I didn't recite this dhāraṇī first, so I'll stop here briefly and go back to the Bhagavān to recite the dhāraṇī, then I'll recite the dhāraṇī again and make it give birth.\"",
        "source": "T04n0212_018:0704a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時指鬘比丘即至世尊所，頭面禮足白世尊曰：「向者入城分越，值城門裏有象欲產，責我呪術，象得產者然後得乞。",
        "translation": "The monk then went to the Bhagavān, bowed his head and feet, and said to the Bhagavān, \"When I entered the city and went beyond, I was told that there was an elephant inside the city gates that wanted to give birth, and I was told to recite a spell so that the elephant would give birth and then I could beg for it.",
        "source": "T04n0212_018:0704a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊願受神呪，使象得產使得分越。」",
        "translation": "Please let the Bhagavān wish to accept the spell, so that the elephant can give birth and make it to Banyan.\"",
        "source": "T04n0212_018:0704a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告指鬘：「汝往彼所當以此言呪之：『今至誠呪，自生以來初不殺生。』",
        "translation": "The Buddha told the Śākyamuni, \"Go there and recite this spell, 'Now, I sincerely recite this spell, 'Since I was born, I have never killed anyone.'",
        "source": "T04n0212_018:0704a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持是至誠語使象得產無他。」",
        "translation": "Holding to these words of utmost sincerity will cause the elephant to give birth to none other.\"",
        "source": "T04n0212_018:0704a21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時鴦掘魔從佛受呪術，即往呪象安隱得產。",
        "translation": "Aṅgulimāra then received the spell from the Buddha and went to the place where the elephant was spellbound to give birth.",
        "source": "T04n0212_018:0704a22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸人民皆稱：「善哉！",
        "translation": "The people then all said, \"Good!",
        "source": "T04n0212_018:0704a23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間乃有此奇怪之事。",
        "translation": "How could such a strange thing happen in the world?",
        "source": "T04n0212_018:0704a23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此指鬘前後殺生不可稱計，今方自呪從生以來初不殺生，持是至誠語使象得產無他。」",
        "translation": "It's incalculable that this Finger Garland should have killed people before and after, but now he says, 'Since birth, I've never killed anyone, and by upholding this sincere promise, I'll make sure the elephant produces no others.'",
        "source": "T04n0212_018:0704a24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便得入城，街巷人民見指鬘來，其中或父母兄弟妻息為指鬘所殺者，皆前報怨，或以刀杖瓦石打指鬘極使牢熟，破頭傷體裂壞衣被，鉢盂亦破，即走出城竟不乞食。",
        "translation": "When they then entered the city, the people in the streets who saw the Finger Garland coming, some of whom had been killed by the Finger Garland, including their parents, brothers, wives, and children, went out to avenge their grievances, or they beat the Finger Garland with a knife, stick, tile, or stone to make it completely ripe, breaking his head, injuring his body, tearing his clothes and blankets, and breaking his bowl.",
        "source": "T04n0212_018:0704a26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "還至世尊所，頭面禮足自說緣本，佛知其意指鬘受緣報何其速哉？",
        "translation": "When he returned to the Bhagavān, he bowed his head to his feet and explained the origin of the situation to himself, and the Buddha knew what he meant.",
        "source": "T04n0212_018:0704b01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊漸與說法，即於坐上得須陀洹果乃至羅漢六通清徹。",
        "translation": "The Bhagavān then gradually explained the teaching, and while sitting there, he attained the fruit of stream entry and even the clarification of the arhat's six supernormal powers.",
        "source": "T04n0212_018:0704b02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時波斯匿王，即集四種兵，馬兵象兵車兵步兵，欲往詣彼園與鴦掘魔共鬪。",
        "translation": "It was then that King Prasenajit gathered four kinds of soldiers, horse soldiers, elephant soldiers, chariot soldiers, and foot soldiers, and wanted to go to that park and fight with Aṅgulimāra.",
        "source": "T04n0212_018:0704b04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出舍衛城中，道聞行人說，鴦掘魔大賊受如來教得為比丘，即停兵眾入祇洹精舍，與如來相見。",
        "translation": "When he left Śrāvastī, the travelers who heard about it said that the great bandit Aṅgulimāra had been taught by the Tathāgata to become a monk, so he stopped his army and went into the Jetavana monastery to meet the Tathāgata.",
        "source": "T04n0212_018:0704b06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊知王當來，即以神足隱鴦掘魔形使不顯露。",
        "translation": "Knowing the king was about to come, the Bhagavān then used his miraculous powers to hide Aṅgulimālya's form from view.",
        "source": "T04n0212_018:0704b08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，王波斯匿至世尊所，頭面禮足在一面坐，爾時世尊即知而問曰：「王嚴備戰具集四種兵，為欲何至？」",
        "translation": "When the king Prasenajit went to the Bhagavān, saluted his feet with his head at one side, the Bhagavān knew and asked, \"The king has gathered four kinds of troops in battle gear, why are you here?\"",
        "source": "T04n0212_018:0704b09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王白佛言：「界內有賊，名鴦掘魔，依嶮作賊暴虐無道，故集兵眾欲往攻伐。",
        "translation": "The king said to the Buddha, \"There's a thief in the realm named Aṅgulimāra who acts as a thief based on a peaks, tyrannical, and amoral, so he gathers a large army and wants to attack him.",
        "source": "T04n0212_018:0704b12_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中路聞人說：『鴦掘魔受佛來化得為道次。』",
        "translation": "Someone heard in the middle of the road said, 'Aṅgulimāra has been transformed by the Buddha into a follower of the Way.'",
        "source": "T04n0212_018:0704b13_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不審其人今為所在？」",
        "translation": "Don't you want to know where he is now?\"",
        "source": "T04n0212_018:0704b14_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知王意即攝神足，使王見鴦掘魔。",
        "translation": "Knowing the king's intention, the Buddha gathered his spiritual feet and made the king see Aṅgulimāra.",
        "source": "T04n0212_018:0704b15_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王見恐懼面投於地，諸臣扶起以水灑之。",
        "translation": "The king saw his face fall to the ground in fear, and the ministers helped him up and sprinkled him with water.",
        "source": "T04n0212_018:0704b16_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告王曰：「是王大幸遇此小恐，其人已得阿羅漢果。",
        "translation": "The Buddha told the king, \"The king is greatly fortunate to have met this little fearful man, for he has already attained the fruit of the arhat.",
        "source": "T04n0212_018:0704b17_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設當王詣彼深園見其本形，頭戴指鬘人血塗體，身執利劍顏色隆怒，王當見者心肝摧碎即喪命根。」",
        "translation": "Suppose the king goes to that deep garden and sees his original form, his head covered in fingertips, his body smeared with human blood, and his body holding a sharp sword with a raging color, and the king sees that person's heart and liver are broken, and he loses his life root.\"",
        "source": "T04n0212_018:0704b18_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王白佛言：「如來今日未降者降、未度者度，云何世尊！",
        "translation": "The king said to the Buddha, \"Today, the Tathāgata subdues those who have yet to be subdued and liberates those who have yet to be liberated, so what is it, Bhagavān?",
        "source": "T04n0212_018:0704b20_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人乃殺無央數人，云何得成羅漢果？」",
        "translation": "How did he attain the fruit of the arhat when he killed countless people?\"",
        "source": "T04n0212_018:0704b21_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「無苦，行有前後、有熟不熟、有初有終。」",
        "translation": "The Buddha said, \"There's no suffering; there's preceding and following actions, ripening and unripening, and a beginning and an end.\"",
        "source": "T04n0212_018:0704b22_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊觀宿因緣，便於大眾而說斯頌：「人前為惡，　　以善滅之，　　是照世間，　如月雲消。」",
        "translation": "After observing the causes and conditions of past lives, the Bhagavān then addressed the crowd and spoke this verse, \"When someone does evil in the past and extinguishes it with goodness, it illuminates the world like a cloud disappearing from the moon.\"",
        "source": "T04n0212_018:0704b23_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人前為惡以善滅之者，如彼指鬘，殺害無數千人，以賢聖八品道而滅其惡，諸惡已盡永無根本，究竟清淨得不起法。",
        "translation": "Someone who has done evil in the past and culled it with goodness is like that finger garland that killed countless thousands of people and culled their evil with the eightfold path of the noble ones, which ends all evil and never has roots and is ultimately pure and attains the state of nonarising.",
        "source": "T04n0212_018:0704b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，人前為惡，以善滅之也。",
        "translation": "Therefore, it's said that evil done before by humans is destroyed by goodness.",
        "source": "T04n0212_018:0704b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是照世間，如月雲消者，世間者其義有三：一名眾生世，二名器世，三名陰世。",
        "translation": "He who illuminates the world like a moon with vanishing clouds says that the world has three meanings: one is the world of sentient beings, two are the container world, and three are the aggregate world.",
        "source": "T04n0212_018:0704c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如秋月眾星圍繞，於中獨明光照遠近，弊惡比丘諸惡已盡，修清淨行，便於大眾廣有濟度。",
        "translation": "It's like the autumn moon surrounded by stars, in which alone a bright light shines that illuminates both near and far, and a bad monk who has ended his bad deeds and cultivated pure practices is able to broadly deliver relief to the masses.",
        "source": "T04n0212_018:0704c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，是照世間，如月雲消也。",
        "translation": "Therefore, it's said, \"This illuminates the world like the moon and vanishing clouds.",
        "source": "T04n0212_018:0704c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人前為惡，　　以善滅之，　　世間愛著，　念空其義。",
        "translation": "When people do evil in the past, they extinguish it with goodness, and worldly attachments are empty of meaning in their mind.",
        "source": "T04n0212_018:0704c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人前為惡，以善滅之者，夫作惡皆由愛著，彼梵志妻興惡向無害，皆由愛心。",
        "translation": "A person who does evil in front of others and uses goodness to cease it is motivated by attachment, and that priest's wife produces evil that's harmless because of her attachment.",
        "source": "T04n0212_018:0704c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，人前為惡，以善滅之也。",
        "translation": "Therefore, it's said, \"Do evil in front of people and put an end to it with goodness.",
        "source": "T04n0212_018:0704c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間愛著，念空其義者，愛心深固流轉三界，受四生分迴趣五道，皆由愛著不能捨離，行人分別虛而不真，知皆空寂不可恃怙，是故說，世間愛著，念空其義也。",
        "translation": "The meaning of \"worldly craving and mindfulness of emptiness\" is that the mind deeply fixated on craving goes from the three realms to the four parts of life and returns to the five destinies, all because of craving and attachment that can't be abandoned, and the human discriminator discerns what's false and not real, knowing that they are all empty and unsupportable.",
        "source": "T04n0212_018:0704c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　少壯捨家，　　盛修佛教，　　是照世間，　如月雲消。",
        "translation": "A young man who leaves home and becomes a strong Buddhist cultivator illuminates the world like a cloud disappearing from the moon.",
        "source": "T04n0212_018:0704c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛契經說：「因象師喻，時象師教訓少壯象，樂於曠野不被調御，即於曠野命終，復有中象不被調御，於彼取命終。",
        "translation": "The Buddha's scriptures say, \"According to the parable of the elephant maker, when the elephant maker instructs a young elephant to be sturdy and happy in the wilderness and not be disciplined, that elephant's life ends in the wilderness, and then there's a middle elephant that's not disciplined and takes its life there.",
        "source": "T04n0212_018:0704c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "少壯比丘此亦如是，不被教訓而取命終，長老比丘不被教訓而取命終。」",
        "translation": "So it is with the young monk who takes his life to its end without being taught, and with the elder monk who takes his life to its end without being taught.\"",
        "source": "T04n0212_018:0704c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘當知此亦如是，少壯象調御而取命終，中年象被調御而取命終，少壯比丘被教訓而取命終，長老比丘被教訓得賢聖法而取命終。",
        "translation": "Monks, you should know that this is likewise: a young and strong elephant is disciplined and takes his life to its end, a middle-aged elephant is disciplined and takes his life to its end, a young and strong monk is taught and takes his life to its end, and an elderly monk is taught the noble teaching and takes his life to its end.",
        "source": "T04n0212_018:0704c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "少壯比丘盛修佛教，無所漏失具足佛法。",
        "translation": "The youthful monk who flourishes in Buddhism doesn't miss anything and is complete in the Buddha's teaching.",
        "source": "T04n0212_018:0704c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為具足？",
        "translation": "What's complete?",
        "source": "T04n0212_018:0704c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "越次取證成無上果，是故說，少壯捨家，盛修佛教也。",
        "translation": "After next, he realizes the unsurpassed result, which is why it's said that young people and young adults leave home and thoroughly cultivate Buddhism.",
        "source": "T04n0212_018:0704c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是照世間，如月雲消者，猶如秋月光明遠照也。",
        "translation": "This illuminates the world like the moon when the clouds disappear, just like the autumn moon shines brightly and distantly.",
        "source": "T04n0212_018:0704c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　少壯捨家，　　盛修佛教，　　世間愛著，　念空其義。",
        "translation": "A young man who leaves home and flourishes in Buddhism is mindful of the meaning of emptiness when he's attached to the world.",
        "source": "T04n0212_018:0704c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "少壯捨家者，欲斷愛著，諸天、阿須倫所見敬侍，加留羅、乾沓和等皆悉承事供養，是故說，世間愛著，念空其義也。",
        "translation": "A young man who leaves home in the prime of life wants to end his attachment, and he's seen by gods and asuras, honored, served by garuḍas and khandhas, and so forth, making offerings to them.",
        "source": "T04n0212_018:0704c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　生不施惱，　　死而不慼，　　是見道悍，　應中勿憂。",
        "translation": "Not being troubled by birth and not being sad when they die is a vision of the strength of the path, so don't be sad in response.",
        "source": "T04n0212_018:0705a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生不施惱，死而不慼者，自生以來不殺盜婬妷，不犯諸邪，臨命終時，神識澄靜亦不驚懼，亦復不見地獄畜生餓鬼，不見弊惡鬼，但見吉祥瑞應，是故說，生不施惱，死而不慼也。",
        "translation": "Someone who isn't troubled by birth and doesn't become sad at death means that since birth they haven't killed, stolen, lusted, or committed any wrongdoings, and when their life ends, their consciousness is calm and they aren't frightened, and they don't see hell, animals, hungry ghosts, or bad ghosts but only see auspicious apparitions.",
        "source": "T04n0212_018:0705a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是見道悍，應中勿憂者，彼見諦人已離五難，雖在憂慼之間淡然無為，亦不悲號哭泣生諸眾惱，是故說，是見道悍，應中勿憂也。",
        "translation": "He who sees the strength of the path and doesn't grieve in response doesn't say, 'He sees the strength of the path and doesn't grieve in response,' because he has parted with the five difficulties, though he's calm and inactive between grief and sorrow, and he doesn't lament and cry and give rise to various afflictions.",
        "source": "T04n0212_018:0705a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　生不施惱，　　死而不慼，　　是見道悍，　在親獨明。",
        "translation": "Not being troubled by birth and not being sad when he dies is a formidable view of the path that's understood only by those close to him.",
        "source": "T04n0212_018:0705a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生不施惱，死而不慼者，自生已來，不由父母兄弟宗親五族而行惡法也，是故說，在親而獨明。",
        "translation": "Someone who doesn't inflict pain in birth and doesn't become sad in death has never practiced bad qualities since birth from his parents, brothers, clans, and five families; therefore, it's said, \"It's in the intimates and alone.",
        "source": "T04n0212_018:0705a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　斷濁黑法，　　學惟清白，　　渡淵不反，　棄猗行止，　　不復染樂，　　欲斷無憂。",
        "translation": "He stops the polluted and black dharmas, trains in purity, crosses the abyss without turning back, abandons restraint and conduct, stops defilement and pleasure, and stops desire and lacks sorrow.",
        "source": "T04n0212_018:0705a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斷濁黑法者，云何名為濁黑法？",
        "translation": "What's the name of someone who stops the polluted black dharma?",
        "source": "T04n0212_018:0705a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「一切諸使縛結塵垢，一切諸不善法退墮法、諸染著生死者，當斷已斷永斷。」",
        "translation": "He answered, \"All the bonds of affliction and defilement, all the unskillful things that regress, and all the defiled attachments to birth and death will be permanently ended once they've been ended.\"",
        "source": "T04n0212_018:0705a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，斷濁黑法也。",
        "translation": "Therefore, it's said, 'Stopping the impure black dharmas is also stopping the impure black dharmas.'",
        "source": "T04n0212_018:0705a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "學惟清白者，云何名曰清白法？",
        "translation": "What is the term \"pure and white dharmas\" for those who train in their innocence?",
        "source": "T04n0212_018:0705a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「意止、意斷、神足、根、力、覺意、八正道，三十七品，正使有法離於生死得出要者，亦名清白法。」",
        "translation": "He answered, \"The thirty-seven factors of mental stabilization, mental cessation, spiritual power, faculties, strength, awakened mind, and the eightfold correct path that precisely cause things to part with birth and death and attain their essentials are also called pure and white principles.\"",
        "source": "T04n0212_018:0705a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，學惟清白也。",
        "translation": "Therefore, it's said, 'Train only in innocence.'",
        "source": "T04n0212_018:0705a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "渡淵不反者，何以故名為淵？",
        "translation": "Why is it called an abyss if someone wades across it and doesn't rebel?",
        "source": "T04n0212_018:0705a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂淵者，流在界趣轉增生死，由此淵故流轉生死不可稱記，墮三塗八難，是故世尊說，當滅四淵求無上道。",
        "translation": "This is called an abyss that flows through the elements and destinies, which creates more births and deaths, and as a result of this abyss, they are born into indescribable births and deaths and fall into the three destinies and eight difficulties.",
        "source": "T04n0212_018:0705a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，渡淵不反也。",
        "translation": "Therefore, it's said, \"I won't turn back after crossing the abyss.",
        "source": "T04n0212_018:0705a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "棄猗行止者，云何為猗？",
        "translation": "What is the purpose of someone who abandons restraint and practices restraint?",
        "source": "T04n0212_018:0705a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂猗者，猗欲不善法，是故如來說，棄猗無著乃謂真行。",
        "translation": "\"An associate is an associate who desires unwholesome things; therefore, the Tathāgata says that renouncing associate and no attachment is called true practice.",
        "source": "T04n0212_018:0705a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，棄猗行止也。",
        "translation": "Therefore, it's called abandoning the practice of freedom from attachment and stopping it.",
        "source": "T04n0212_018:0705b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不復染樂者，不染五樂，親近賢聖律終不捨離，是故說，不復樂也。",
        "translation": "Not again defiled by pleasure, someone who isn't defiled by the five pleasures and who becomes close to the good and noble principles never abandons them therefore explains that he's not again delighted.",
        "source": "T04n0212_018:0705b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲斷無憂者，夫人不至於無為，皆由有欲，染著女色興意思想，念彼色貌髮毛爪齒肥白端正；行人執意除去彼念，欲想便息不復熾然。",
        "translation": "Those whose desires are ended and who have no sorrow don't attain nonproductivity because they have desire, become defiled by the female form, and develop thoughts of mindfulness of that form, hair, nails, teeth, and plumpness and whiteness; when a practitioner focuses his mind on removing those thoughts, the desire and thoughts will cease and become less inflammatory.",
        "source": "T04n0212_018:0705b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，欲斷無憂也。",
        "translation": "Therefore, it's said, \"There's no sorrow when desires are stopped.",
        "source": "T04n0212_018:0705b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愛欲意為田，　　婬怒癡為種，　故施度世者，　　得福無有量。",
        "translation": "Desire and attention are fields, and lust, anger, and delusion are seeds; therefore, those who give alms to the world will obtain merit that's incalculable.",
        "source": "T04n0212_018:0705b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愛欲意為田者，猶如荒田穢地不數修治，菅草競生傷害良苗，穀子不滋時不豐熟，人染著愛欲亦如是，是故說，愛欲意為田也。",
        "translation": "When craving and desire are fields, they're like a barren field that's not cultivated, a weed that grows and harms good seedlings, and grain that isn't nourished and doesn't ripen, so too is a person defiled by craving and desire.",
        "source": "T04n0212_018:0705b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婬怒癡為種者，夫行人習行常自觀察，若人種德，為施何處而獲果報？",
        "translation": "When lust, anger, and delusion are seeds, a practitioner always observes for himself the cultivation of those practices, asking, \"If a person cultivates virtue, where will he get the result of that gift?",
        "source": "T04n0212_018:0705b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「施無空入者少，施空入者多。」",
        "translation": "He answered, \"Those who give without the entry of emptiness are few, and those who give with the entry of emptiness are many.\"",
        "source": "T04n0212_018:0705b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何施無空入者少？",
        "translation": "How is it that giving without the entry of emptiness is little?",
        "source": "T04n0212_018:0705b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「諸在外道異學及裸形梵志尼乾子等，愚人好施於中望福，於十六分而不獲一。」",
        "translation": "They replied, \"Outsiders, heretics, naked priests, Nirgrantha, and others are foolish people who like giving and hope for merit in the midst of it, and they don't obtain one of the 16 parts.\"",
        "source": "T04n0212_018:0705b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如穢田傷害善苗，穢行梵志傷害善根，為婬怒癡所覆不生道果。",
        "translation": "They're like a defiled field that harms good seedlings, or a priest who practices defilement harms good roots, and the fruit of the path isn't produced because they're hindered by lust, anger, and delusion.",
        "source": "T04n0212_018:0705b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，婬怒癡為種，故施度世者也。",
        "translation": "That's why it's said that lust, anger, and delusion are seeds, so it's a gift that will save the world.",
        "source": "T04n0212_018:0705b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得福無有量者，嘆說如來聖眾施福之報，於大眾之中有斷欲人，所施雖少獲福無量，所得果報不可稱計，是故說，故施度世者，得福無有量。",
        "translation": "Those who attain immeasurable merit praise the Tathāgata for the meritorious rewards of his noble congregation's generosity, for although there's someone among the masses who stops craving, the merit they receive from their generosity is small and immeasurable, and the rewards they attain are incalculable; therefore, it's said that someone who therefore gives to save the world will attain immeasurable merit.",
        "source": "T04n0212_018:0705b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶如穢惡田，　　瞋恚滋蔓生，　是故當離恚，　　施報無有量。",
        "translation": "He's like a field of filth and evil in which anger grows and spreads, so he should part with anger and the rewards of generosity will be immeasurable.",
        "source": "T04n0212_018:0705b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如穢惡田，瞋恚滋蔓生者，何以故名為穢惡？",
        "translation": "It's like a field of filth and evil, where anger grows and spreads; why is it called filth and evil?",
        "source": "T04n0212_018:0705b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以名穢惡者，亦自毀己復毀他人。",
        "translation": "That's why it's called a filthy evil, because it also disparages itself and disparages others.",
        "source": "T04n0212_018:0705b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以自毀者，瞋恚熾盛顏色變易本性改異，是謂自毀。",
        "translation": "This is called self-mutilation, when anger becomes blazing and colors change and the original nature changes.",
        "source": "T04n0212_018:0705b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復毀他人者，瞋恚熾盛毀損他人，乃至失其命根。",
        "translation": "He also disparages others, because his anger is so intense that it disparages others, even to the point of losing their life force.",
        "source": "T04n0212_018:0705b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，猶如穢惡田，瞋恚滋蔓生也。",
        "translation": "Therefore, it's said, \"It's like a field of filth and evil, where anger grows and spreads.",
        "source": "T04n0212_018:0705c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故當離恚，施報無有量者，人不懷恚後受恚報，人由瞋恚亡國破家，皆由瞋恚，仁施福德施無恚者，獲福無量，是故說，當離恚施，報無量也。",
        "translation": "Therefore, you must part with anger, and the rewards of giving are immeasurable. A person who doesn't harbor anger will later experience the rewards of anger, and it's because of anger that a person's country is lost and their family destroyed.",
        "source": "T04n0212_018:0705c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶如穢惡田，　　愚癡穢惡生，　是故當離愚，　　獲報無有量。",
        "translation": "They're like a field of filth and evil, where foolishness and delusion are born, therefore they must part with foolishness, and the rewards will be immeasurable.",
        "source": "T04n0212_018:0705c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如穢惡田，愚癡穢惡生者，猶彼盲人目不覩高原平地，亦不見善色惡色青黃赤白。",
        "translation": "They're like a field of defilement and badness, and a foolish and defiled creature is like a blind man whose eyes don't see the highlands and level ground, and who doesn't see good and bad forms, blue, yellow, red, and white.",
        "source": "T04n0212_018:0705c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此眾生類亦復如是，以無明闇法而自纏絡，不覩四諦善不善法，覆蔽慧明及三十七道品。",
        "translation": "Similarly, these sentient beings are tethered by the darkness of ignorance, don't see the good and unskillful qualities of the four truths, and obscure the insight of wisdom and the 37 factors of the path.",
        "source": "T04n0212_018:0705c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外道異學及諸梵志，癡所覆蓋不識道真。",
        "translation": "Outsiders, non-Buddhists, and priests are covered by delusion and don't recognize the truth of the path.",
        "source": "T04n0212_018:0705c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來聖眾，永無此患。",
        "translation": "The Tathāgata's noble sentient beings are never in such danger.",
        "source": "T04n0212_018:0705c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，猶如穢惡田，愚癡滋蔓生也。",
        "translation": "Therefore, they say they're like a field of filth and evil, where foolishness grows and spreads.",
        "source": "T04n0212_018:0705c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故當離愚，獲福無有量者，彼修行人欲求無愚者，當從何求？",
        "translation": "Therefore, he must part with folly, and the merits he obtains will be incalculable. What does a practitioner who wants to pursue no folly seek?",
        "source": "T04n0212_018:0705c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「當從如來聖眾求。",
        "translation": "They replied, \"You should seek them from the Tathāgata's noble congregation.",
        "source": "T04n0212_018:0705c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T04n0212_018:0705c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已其聖眾觀察本末，若大若小若好若醜，分別四諦眼明智覺毫釐不失，施彼如來聖眾無有愚癡者，獲報無量也。」",
        "translation": "Once the noble ones examine the beginning and end, whether large, small, beautiful, or ugly, and discern the four truths, their vision, wisdom, and awareness aren't lost in the slightest, giving to the noble ones of the Tathāgata has no foolishness, and the rewards are immeasurable.\"",
        "source": "T04n0212_018:0705c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，當離癡施，報無有量也。",
        "translation": "Therefore, it's said, 'Don't be fooled, for the rewards will be incalculable.'",
        "source": "T04n0212_018:0705c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶如穢惡田，　　憍慢滋蔓生，　是故當離慢，　　獲報無有量。",
        "translation": "It's like a field of filth and evil in which conceit grows and spreads, so you must part with conceit and obtain immeasurable rewards.",
        "source": "T04n0212_018:0705c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如穢惡田，憍慢滋蔓生者，外道異學憍慢最甚，是故如來說偈曰：「婆羅門憍慢滋多，從今世命終，當生六趣中，鷄猪狗狼驢五泥犁六，施彼人者不獲其報。」",
        "translation": "They're like a field of filth and evil where conceit grows and spreads, and arrogance is greatest among non-Buddhists and heretics; therefore, the Tathāgata spoke the verse, \"A Brāhmaṇa's conceit grows abundantly, and from now on, when his life ends, he'll be born in one of the six destinies, where chickens, pigs, dogs, wolves, asses, five nirayas, or six others, and he won't get the reward for giving to that person.\"",
        "source": "T04n0212_018:0705c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，猶如穢惡田，憍慢為滋多也。",
        "translation": "Therefore, it's said, 'It's like a field of filth and evil, in which conceit nourishes much.'",
        "source": "T04n0212_018:0705c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故當離慢，獲報無有量者，於如來大法中除去憍慢，或時著衣持鉢入村乞食，下意自卑如旃陀童女，身被寶衣價直百千，若詣他舍倚門侍立不敢入舍。",
        "translation": "Therefore, those who part with pride and attain immeasurable rewards will rid themselves of pride in the Tathāgata's great teaching, sometimes putting on their robes and carrying their bowls into villages to solicit alms, humbling themselves like the young woman Candra, wearing precious clothing worth a hundred thousand, and waiting at the door if they go to another house and dare not enter it.",
        "source": "T04n0212_018:0705c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "侮慢比丘亦復如是，本出豪族自苦其形修乞士法，御心調意如執利劍，手執鉢盂如世窮人，閻浮利人以髮為飾，我沙門便取剃之，閻浮利人衣裳多貪，白淨沙門染污為色，閻浮利人諸犯罪者逐著深山，沙門山藪為家，無欲之人執行如是，況得向果者心可移乎？",
        "translation": "So it is with the arrogant monk who comes from a wealthy family, pains himself in appearance, cultivates the ways of the beggar, regulates his mind like he's holding a sharp sword, carries a bowl in his hand like a poor man of the world, is adorned by the hair of a rich man like Jambudvīpa, and our ascetic then takes it and shaves it, is greedy for the robes of a rich man like Jambudvīpa, is defiled by the color of a pure ascetic, is driven into the depths of a mountain by offenders like Jambudvīpa, and makes his home in the mountainous region of an ascetic.",
        "source": "T04n0212_018:0705c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，當離憍慢，獲報無有量也。",
        "translation": "Therefore, it's said, \"You must part with pride, and the rewards will be incalculable.",
        "source": "T04n0212_018:0706a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶如穢惡田，　　貪欲為滋蔓，　是故當離貪，　　獲報無有量。",
        "translation": "It's like a dirty, unwholesome field in which desire for greed is a breeding ground; therefore, you must part with greed, and the rewards will be incalculable.",
        "source": "T04n0212_018:0706a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如穢惡田，貪欲為滋蔓者，人懷慳貪至死不改，或由慳貪傷夭命根，是故智者去離慳貪，是故說，猶如穢惡田，貪欲為滋蔓，是故當離貪，獲報無有量也。",
        "translation": "They're like a field of filth and evil where desire for greed is a nuisance, for which a person bears stinginess and greed until death and doesn't change, or because stinginess and greed impair the vitality of life, a wise person goes without stinginess and greed.",
        "source": "T04n0212_018:0706a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　六增上王，　　染為染首，　　無染則離，　染者謂愚。",
        "translation": "Of the six surpassing kings, defilement is the head of defilement, and when there's no defilement, it's abandoned; defilement is called folly.",
        "source": "T04n0212_018:0706a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六增上王者，所謂王者何者是？",
        "translation": "What are the six surpassing kings, so-called kings?",
        "source": "T04n0212_018:0706a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰意也。",
        "translation": "It's called an intention.",
        "source": "T04n0212_018:0706a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以次數者則名六，逆數者亦為六。",
        "translation": "It's called six when it's counted second, and it's also six when it's counted backwards.",
        "source": "T04n0212_018:0706a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "增上者，意動則五隨走作五情，設使諸入盡意所造。",
        "translation": "When the mind moves, the five go along with each other to create the five emotions, even if all the sense-fields are created by the mind.",
        "source": "T04n0212_018:0706a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛契經說，猶如五根各各有境界，不相錯涉亦不相侵。",
        "translation": "As the Buddha's sūtras explain, it's like the five faculties each have their own objects that aren't mutually intertwined or intrusive.",
        "source": "T04n0212_018:0706a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意者至此五處最為原首，侵彼五界，設使五情不得停住，於五事中最勝最妙，是故名為王。",
        "translation": "The mind that reaches these five places is the most fundamental, encroaches on those five realms, and causes the five feelings not to be able to stop, which is the most excellent and sublime of the five things; therefore, it's called the king.",
        "source": "T04n0212_018:0706a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，六為增上王也。",
        "translation": "Therefore, it's said that the six are superior kings.",
        "source": "T04n0212_018:0706a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "染為染首者，云何為染？",
        "translation": "What's defiled about defilement as the leader of defilement?",
        "source": "T04n0212_018:0706a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂染者，染色聲香味細滑法，是故說，染為染首。",
        "translation": "Defilement, it's called, stains sound, smells, tastes, and fine, smooth things; therefore, it's said that defilement is the head of defilement.",
        "source": "T04n0212_018:0706a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無染則離者，云何名無染？",
        "translation": "When there's no defilement, then he'll be free of it; what is called the absence of defilement?",
        "source": "T04n0212_018:0706a24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂無染者阿羅漢是。",
        "translation": "\"The person who's undefiled is an arhat.",
        "source": "T04n0212_018:0706a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖言須陀洹諸塵垢盡得法眼淨，不永得淨；羅漢者永已得淨，是故說，無染則離也。",
        "translation": "Although it's said that the stream-winner has exhausted the defilements and attained purification of the Dharma eye, it's not permanently purified; the arhat has permanently attained purification, so it's said, \"Without defilement, we're free.",
        "source": "T04n0212_018:0706a25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "染者謂愚，愚人所習習，著色香味細滑法，應思惟者然不思惟，不應思惟者反更思惟，是故說，染者謂愚也。",
        "translation": "A defilement is called foolishness, for a foolish person is accustomed to being attached to fine and smooth things like form, odor, and taste, and yet they don't contemplate what should be contemplated and contemplate what shouldn't be contemplated instead; therefore, it's said that a defilement is called foolishness.",
        "source": "T04n0212_018:0706a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　骨幹以為城，　　肉血而塗之，　根門盡開張，　　結賊得縱逸。",
        "translation": "Bones and hips are made into a city, and flesh and blood are smeared over it, opening up the gates of the faculties completely and allowing thieves to get away with it.",
        "source": "T04n0212_018:0706b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "骨幹以為城，肉血而塗之者，所謂城者，以五陰身為牆，骨幹垣壁以血染之，若當以內物現露於外者，便生惡露觀，不染著身，興不可樂想，以其皮膚覆骨莊飾為形，智者觀察無一可貪，是故說，骨幹以為城，肉血而塗之。",
        "translation": "A city made of bones and coated with flesh and blood is called a city because the body of the five aggregates is made of walls, and the walls of the bones are stained with blood.",
        "source": "T04n0212_018:0706b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "根門盡開張，結賊得縱逸者，眼根開張受於外色，曰誰開乎？",
        "translation": "When the sense faculties are fully opened, the thief attains control, and the eye faculties are opened to receive external form, who is it that opens them?",
        "source": "T04n0212_018:0706b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「由不思惟，故使結賊得入劫善根財貨。」",
        "translation": "He answered, \"Because they don't contemplate, it's possible for the thieves to enter and rob the good roots and goods.\"",
        "source": "T04n0212_018:0706b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳鼻口身心亦復如是，意根開張結賊得入，是故說，根門得開張，結賊得縱逸也。",
        "translation": "*So it is with the ears, nose, mouth, body, and mind, when the mind faculty opens up and allows the thief to enter.",
        "source": "T04n0212_018:0706b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有緣則增苦，　　觀彼三因縛，　滅之由賢眾，　　不從外愚除。",
        "translation": "When there are conditions, suffering is intensified, and it's observed that the three causal bonds are ended by a good group of people and not by external foolishness.",
        "source": "T04n0212_018:0706b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有緣則增苦者，前有因緣後生增苦，前無因緣苦何由生？",
        "translation": "When there are conditions that increase suffering, the former has causes and conditions that increase suffering in the future, but without causes and conditions in the past, how can suffering arise?",
        "source": "T04n0212_018:0706b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如泉源出水成江河，此亦如是，因前有緣則有苦際，漸漸增長至四百四患，是故說，有緣則增苦也。",
        "translation": "It's like a spring that produces water that becomes a river, and so it is here, where there's an end of suffering because of previous conditions that gradually increase to 4,400 sufferings; therefore, it's said that there are conditions that increase suffering.",
        "source": "T04n0212_018:0706b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀彼三因縛者，猶如遇事人閉在作坊役使不住，此亦如是，五盛陰身以結使為縛，憂愁苦惱役使心識不得停住，復當經歷四百四病，是故說，觀彼三因縛也。",
        "translation": "He who observes the three causal bonds is like a person in trouble who's shut up in a workshop and can't be tied up, and so is this: the body of the five proliferating aggregates is bound by bonds, and grief and suffering constrain the mind and consciousness from stopping, and they'll experience another 4004 illnesses; therefore, it's said, \"Observe the three causal bonds.",
        "source": "T04n0212_018:0706b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅之由賢眾者，夫欲信施當詣大眾，施少獲福多，猶如勇健丈夫能却外敵摧敗彼眾，乃名勇健，加得賞賜過出眾人。",
        "translation": "Those who want to believe in generosity should go to the masses and receive more merit for giving less, like a sturdy man who can defeat external enemies and destroy them, which is called being sturdy and is rewarded more than the masses.",
        "source": "T04n0212_018:0706b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來賢眾亦復如是，如海納萬川不拒細流，有來供養者不存用喜，不供養者亦不憂慼，是故說，滅之由賢眾也。",
        "translation": "Thus, the Tathāgata's noble people are likewise, like an ocean that accepts ten thousand rivers and doesn't reject small streams, and those who come to offer support don't retain their joy, and those who don't don't offer support don't become sad; therefore, it's said, \"It's up to the noble people to cease.",
        "source": "T04n0212_018:0706b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不從外愚除者，世愚惑人顛倒來久計著吾我，著五陰身計為實身，猶如有人曾不被毒蛇螫而不避之，曾不被結使縛者而造其行，為外塵所染，是故說，不從外愚除也。",
        "translation": "Those who aren't removed from external foolishness are deluded, foolish people of the world who mistakenly come to attach to self and attach to the five aggregates as their true bodies, just as someone who hasn't been stung by a viper and doesn't avoid it or who hasn't been bound by a fetter and yet creates actions that are stained by external defilements, which is why they say they aren't removed from external foolishness.",
        "source": "T04n0212_018:0706b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故名為雜？",
        "translation": "Why is it called mixed?",
        "source": "T04n0212_018:0706c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以言雜者，偈義種種演說不同，餘偈單義不與此同，是故說雜也(雜品第十七竟)。",
        "translation": "The reason it's called mixed is because the various meanings of the verses are explained differently, and the meanings of the other verses alone are not the same as this; therefore, they're said to be mixed (End of the Seventeenth Chapter of the Miscellaneous Text).",
        "source": "T04n0212_018:0706c03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出曜經水品第十八",
        "translation": "Chuoyao jing sui pin di xviii",
        "source": "T04n0212_018:0706c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　心淨得念，　　無所貪樂，　　已度癡淵，　如鴈棄池。",
        "translation": "Attaining mindfulness of purity of mind and desiring nothing, they've crossed the abyss of delusion like an emperor abandoning a pond.",
        "source": "T04n0212_018:0706c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心淨得念，無所貪樂者，係心於淨，恒求巧便欲得出要，觀此生死如幻如化，常懷恐懼心如熾火，是故說，心淨得念，無所貪樂也。",
        "translation": "Being mindful of attaining purity of mind and desiring nothing, a person's mind is purified, always seeks skillful means to attain the essentials, observes that birth and death are illusory and miraculous, and always harbors fears and a mind like a blazing fire.",
        "source": "T04n0212_018:0706c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如鴈棄池者，知彼池水多諸畏懼，又為獵者數來驚怖，鳥即棄池高翔避此眾難，是故說，如鴈棄池也。",
        "translation": "Like a bird abandoning a pond, he knows that the water in that pond is full of fear, and because hunters are often frightened, the bird abandons the pond and flies high to avoid the many difficulties, so he says, \"Like a bird abandoning a pond.",
        "source": "T04n0212_018:0706c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已度癡淵者，癡淵所蔽入骨徹髓，便求方便永滅無餘，是故說，已度癡淵也。",
        "translation": "Someone who has crossed the abyss of delusion knows that the abyss of delusion covers their bones and penetrates their marrow, so they seek skillful means to permanently extinguish it without remainder; therefore, they say, \"I've crossed the abyss of delusion.",
        "source": "T04n0212_018:0706c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如鴈鳥，從空暫下，求出惡道，至無為處。",
        "translation": "It's like a bird in flight that descends momentarily from space, seeking to escape the bad path and reach the point of no-existence.",
        "source": "T04n0212_018:0706c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如鴈鳥者，畏諸眾鳥飛在虛空，避此諸難自求無為，是故說，譬如鴈鳥也。",
        "translation": "He's like a bird that's afraid of all the birds flying in the sky and seeks nothing by avoiding these difficulties; therefore, he's said to be like a bird.",
        "source": "T04n0212_018:0706c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從空暫下者，身能飛行遠近無礙，去危就安，是故說，從空暫下也。",
        "translation": "He who descends momentarily from the sky is able to fly far and near without obstruction, and he avoids danger and arrives at peace; therefore, he's said to descend momentarily from the sky.",
        "source": "T04n0212_018:0706c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "求出惡道，到無為處也。",
        "translation": "He seeks to escape the evil path and arrive at the point of no-action.",
        "source": "T04n0212_018:0706c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢聖弟子如來等正覺，為人除惡求出惡道，修於善業離一切結，是故說，求離惡道，至無為處也。",
        "translation": "Good disciples like the Tathāgata and the Fully Awakened One remove evil for people and seek to escape the evil path by cultivating good actions and freeing themselves from all bonds; therefore, they say they seek to escape the evil path and reach the point of no-action.",
        "source": "T04n0212_018:0706c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦名滅盡泥洹，無生滅著斷，恒不變易亦不磨滅，彼得定修行人，為老病所逼，四百四病恒切己身，厭患四大身，捨五陰形，入無為處。",
        "translation": "Also known as the nirvāṇa of cessation, it's without attachment to birth or cessation, permanent and unchanging, and not subject to decay, so Peter's determined practitioners are forced by old age and illness, are constantly cutting themselves off from the four hundred and four illnesses, become disillusioned with the four major bodies, abandon the five aggregates, and enter the abode of nothingness.",
        "source": "T04n0212_018:0706c22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不修梵行，　　少不積財，　　愚者睡眠，　守故不造。",
        "translation": "He doesn't cultivate the religious practice, seldom accumulates wealth, and is a fool who drowsily guards and therefore doesn't build.",
        "source": "T04n0212_018:0706c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔佛在舍衛國祇樹給孤獨園。",
        "translation": "Once upon a time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T04n0212_018:0706c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊到時著衣持鉢，將侍者阿難，見閻浮界二人耆老，形變色衰僂步而行，見已世尊便笑。",
        "translation": "When the Bhagavān arrived, he put on his robe and took his bowl, and he met his attendant Ānanda, who saw two elderly men from the Jambudvīpa realm, their appearance changed and they were walking around with their heads down, and the Bhagavān smiled when he saw them.",
        "source": "T04n0212_018:0706c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿難更整衣服，右膝著地長跪叉手白佛言：「佛不妄笑，笑必有以，願說其意。」",
        "translation": "Ānanda then adjusted his robes, knelt on his right knee, knelt down with his palms together, and said to the Buddha, \"The Buddha doesn't laugh falsely; there must be a reason for his laughing, so please explain what you mean.\"",
        "source": "T04n0212_018:0707a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告阿難曰：「汝頗見此二耆舊長老不？",
        "translation": "It was then that the Bhagavān addressed Ānanda, \"Have you seen these two elderly elders?",
        "source": "T04n0212_018:0707a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "形變色衰。",
        "translation": "Their appearance changes, and their skin weakens.",
        "source": "T04n0212_018:0707a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若此二人，於此舍衛國從少積財者，於舍衛國第一豪富；若當捨妻子棄捐居業，出家學道，即成阿羅漢。",
        "translation": "If these two people in Śrāvastī never accumulated much wealth, they'd be the richest in Śrāvastī; if they abandoned their wives, gave up their homes, left home, and trained on the path, they'd become arhats.",
        "source": "T04n0212_018:0707a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若小積財至足今日，於此舍衛城里，復在第二家；若出家學道，得阿那含果。",
        "translation": "If they accumulate a small amount of wealth up to the present day, they'll be second in their family in Śrāvastī; if they leave home and train on the path, they'll attain the fruit of non-returnerhood.",
        "source": "T04n0212_018:0707a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此二人若在中年，積財至今日足，在第三家；若出家學道者，得斯陀含果。",
        "translation": "If these two people were in their middle years and had accumulated enough wealth to reach this day, they would be in the third house; if they left home and trained on the path, they would attain the fruit of once-returner.",
        "source": "T04n0212_018:0707a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愍此二人違前所願，捨本隨末，飢寒勤苦萬患并至。」",
        "translation": "I pity these two people who, contrary to their previous vows, abandon the basics and follow the derivatives, which brings them all the hardships of hunger, cold, hard work, and suffering.\"",
        "source": "T04n0212_018:0707a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊觀察此義，為後眾生敷演大明，在於大眾而說斯偈。",
        "translation": "Observing this meaning, the Bhagavān then explained this great insight for the sentient beings who followed him, and he spoke this verse in front of the crowd.",
        "source": "T04n0212_018:0707a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不修梵行，　　少不積財，　　如鶴在池，　守故何益？",
        "translation": "'If someone doesn't cultivate the religious practice and seldom accumulates wealth, they're like a crane in a pond; what good does it do to guard it?'",
        "source": "T04n0212_018:0707a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如老鶴伺立池邊，望魚上岸乃取食之，終日役思不果其願，用意不息自致亡軀。",
        "translation": "It's like an old crane waiting at the edge of a pond, hoping to land a fish before it takes a bite to eat; its whole day's labor of thought doesn't fulfill its desire, and its mind doesn't stop working brings about its own death.",
        "source": "T04n0212_018:0707a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "老有老法壯有壯力，鶴以老法行於壯力終日不果，但念少壯捕魚，不覺耆年已至。",
        "translation": "Old people have old ways, and strong people have strong strength. A crane does what old people do with strong strength, but it doesn't achieve it all day long; it only thinks about catching fish when it's young and strong, and doesn't realize that old age has arrived.",
        "source": "T04n0212_018:0707a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此耆年長老亦復如是，自念力壯，歌舞戲笑博弈戲樂，不慮今日，年邁耆艾抱膝蹲踞。",
        "translation": "Now, this elderly man is likewise. He thinks of himself as strong, sings, dances, laughs, plays games, and enjoys himself, not thinking about today, when he's an elderly man hugging his knees and squatting down.",
        "source": "T04n0212_018:0707a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憶彼所更不行老法，但念少壯欺詐萬端，是故說，如鶴在池，守故何益。",
        "translation": "Remembering what they did, they didn't practice the old age principle, but only thought of the young and the strong as deceptive and deceptive, so they said, \"Like a crane in a pond, what good is it to guard it?",
        "source": "T04n0212_018:0707a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　莫輕小惡，　　以為無殃，　　水渧雖微，　漸盈大器，　　凡罪充滿，　　從小積成。",
        "translation": "Don't despise small evil and think it's harmless; even though a drop of water is small, it gradually fills a large vessel, and whatever sins fill it accumulates from small things.",
        "source": "T04n0212_018:0707a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫輕小惡，以為無殃者，人為惡行雖小不可輕，蚖虵雖小螫嚙人身，毒遍其身以喪命根，毒藥雖微人來得食見毒便死。",
        "translation": "Don't despise small evil as non-bane, for even though a person's evil deeds are small, they can't be taken lightly, like the smallest of a newt's stings that bite a person and poison his body so much that it kills his life root, or the smallest of poisons that a person can eat when they see the poison and die.",
        "source": "T04n0212_018:0707a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此亦如是，為惡雖小妨人正行，不至究竟不慮於後當受其報，日復一日不肯改更，不念遠離惡遂滋長，是故說，莫輕小惡，以為無殃也。",
        "translation": "This is likewise, even though the evil act is small and hinders one's right behavior, it doesn't reach its ultimate realization without considering the consequences it will receive later, refuses to change day after day, and doesn't think about avoiding evil, which then grows, so it's said, \"Don't despise small evil in order to have no misfortune.",
        "source": "T04n0212_018:0707a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "水渧雖微，漸盈大器者，猶如大器仰承水漏，渧渧相尋溢滿其器，是故說，水渧雖微，漸盈大器也。",
        "translation": "Although a drop of water is small, it gradually fills a large vessel, just like when a large vessel looks up and receives a leak of water, and each drop finds its way to overflow the vessel, so it's said, \"Although a drop of water is small, it gradually fills a large vessel.",
        "source": "T04n0212_018:0707b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡罪充滿，從小積成者，愚人習行從小至大，日日翫習不覺殃至，是故說，凡罪充滿，從小積成。",
        "translation": "Whatever sins fill it, they accumulate from the small. A foolish person's habits and actions range from the small to the great, and day by day they cultivate them without realizing that they're harmful; therefore, it's said, \"Whatever sins fill it, they accumulate from the small.",
        "source": "T04n0212_018:0707b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　莫輕小善，　　以為無福，　　水渧雖微，　漸盈大器，　　凡福充滿，　　從纖纖積。",
        "translation": "Don't despise small goodness and think it's without merit, for even though a drop of water is small, it gradually fills a large vessel, and ordinary merit fills up from a small accumulation.",
        "source": "T04n0212_018:0707b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫輕小善，以為無福者，如有善人詣彼塔寺禮拜求福，或上明燃燈燒香掃灑，作倡伎樂懸繒幡蓋，從一錢始，復勸前人使發施心，一摶已上供養聖眾，或以楊枝淨水供給清淨，或脂燈續明。",
        "translation": "Don't despise small merits as lacking virtue, for example, if a good person goes to a stūpa or temple, venerates it, burns a lamp, scatters incense, makes music, hangs silken banners, starts with a penny, encourages the person before them to give, makes offerings to the noble people beyond the first handful, makes offerings of pure water from poplar branches, or keeps a grease lamp lit.",
        "source": "T04n0212_018:0707b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此小小亦不可輕，依彼心識獲報無量，如然一燈除舍闇冥，不知冥之蹤跡，如燒極微妙香，盡除臭穢不知所在，利劍雖小能斷毒樹。",
        "translation": "Even such a small thing shouldn't be taken lightly, for the rewards they receive from their mind and consciousness are immeasurable, like a lamp that removes darkness and doesn't know the tracks of darkness, like a very subtle incense burner that removes a stench and doesn't know where it's located, or a sharp sword that cuts through a poison tree even though it's small.",
        "source": "T04n0212_018:0707b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此亦如是，善行雖微能除重罪，往來人天不更苦惱，從此適彼受福無量現在可知，渧渧不絕遂滿大器，勇者行福漸漸成就。",
        "translation": "Thus, even though a small act of kindness can remove a serious sin, it won't cause further suffering in humans or gods in the future, and from here and there, they'll receive measureless merit. It's now clear that a drop won't stop until it fills a large container, and the merit of a courageous person's actions is gradually accomplished.",
        "source": "T04n0212_018:0707b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，凡福充滿，從纖纖積。",
        "translation": "Therefore, it's said that ordinary merit is filled from the smallest accumulation.",
        "source": "T04n0212_018:0707b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶如人渡河，　　縛筏而牢固，　彼謂渡不渡，　　聰叡乃謂渡。",
        "translation": "It's like a person crossing a river who is bound to a raft and made strong, which they call a crossing and don't cross but which the wise call a crossing.",
        "source": "T04n0212_018:0707b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "縛筏而牢固者，猶彼眾生欲渡深淵，或筏而渡或腰船而渡，或浮瓠或載小船，或草木為筏，皆得至岸而無罣礙。",
        "translation": "Someone who is securely bound to a raft is like a sentient being who wants to cross an abyss, so he might cross it with a raft or cross it with a boat at his waist, or he might cross it with a floating gourd or a small boat, or he might make a raft of grass or wood, but he'll reach the shore without obstruction.",
        "source": "T04n0212_018:0707b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，猶如人渡河，縛筏而牢固也。",
        "translation": "Therefore, it's said, \"They're like a person crossing a river who is bound to a raft and made strong.",
        "source": "T04n0212_018:0707b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼謂渡不渡者，謂愛淵猶如深淵流出成河，彌滿世界流向三界，趣四生遍五道，復流至色聲香味細滑法，是故說，彼謂渡不渡也。",
        "translation": "They call it wading or not wading because the abyss of craving is like an abyss flowing into a river that fills the world and flows to the three realms, goes to the four births and pervades the five destinies, and flows again to form, sound, smells, tastes, and fine, smooth dharmas, so they say it's called wading or not wading.",
        "source": "T04n0212_018:0707b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聰叡乃謂渡者，所謂聰叡者佛辟支佛是，雖渡世淵不足為奇。",
        "translation": "An intelligent person is called a wader, and the so-called intelligent person is a Buddha or a pratyekabuddha, even though it's not surprising that he would wade across the abyss of the world.",
        "source": "T04n0212_018:0707b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T04n0212_018:0707c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世淵無盡，渡愛欲淵者，乃謂為奇。",
        "translation": "The abyss of the world is inexhaustible, but someone who wades across the abyss of craving is said to be amazing.",
        "source": "T04n0212_018:0707c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，聰叡乃謂渡也。",
        "translation": "Therefore, it's called a wise one who has crossed it.",
        "source": "T04n0212_018:0707c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛世尊已渡，梵志渡彼岸，比丘入淵浴，聲聞縛牢筏。",
        "translation": "The Bhagavān has crossed it, the priests have crossed to the other side, the monks have bathed in an abyss, and the śrāvakas have tied themselves to a raft.",
        "source": "T04n0212_018:0707c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔有兩師大梵志，造立波羅利弗多羅大城，功夫已舉莊飾成辦，便請佛及眾僧入城供養。",
        "translation": "Once upon a time, two great priests built the great city of Porāliputra, and after they had finished decorating it, they invited the Buddha and the monks to enter and make offerings to the city.",
        "source": "T04n0212_018:0707c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未與諸門立號，梵志內心作是念：「若沙門瞿曇從所門出，當名為瞿曇門，若復如來渡恒伽水，當名彼渡為瞿曇渡。」",
        "translation": "Before he had established the names of the gates, the priest had this internal thought, \"If the ascetic Gautama emerges from his gate, he will be called Gautama Gate, and if another Tathāgata crosses the Gaṅgā River, he will be called that ferry Gautama Ferry.\"",
        "source": "T04n0212_018:0707c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時梵志復生是念：「不審如來為欲載筏渡，腰船浮瓠小船為載河渡？」",
        "translation": "It was then that the priest again had this thought, \"Don't you suppose the Tathāgata wants to carry a raft across, or does a boat with a floating gourd carry a small boat across a river?\"",
        "source": "T04n0212_018:0707c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊知彼梵志心中所念，即以神力及比丘僧忽然而渡，在彼岸立。",
        "translation": "Knowing what was in that priest's mind, the Bhagavān then suddenly waded across with supernormal powers and the monks and saṃgha, and stood on the other side.",
        "source": "T04n0212_018:0707c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊在大眾中，而說此偈：「佛世尊已渡，　　梵志渡彼岸，　比丘入淵浴，　　聲聞縛牢筏。」",
        "translation": "The Bhagavān then was in the crowd and spoke this verse, \"The Bhagavān has crossed, the priest has crossed to the other shore, the monk has bathed in an abyss, and the śrāvaka has tied himself to a raft.\"",
        "source": "T04n0212_018:0707c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說此偈已各還精舍。",
        "translation": "After speaking this verse, they each returned to their monastery.",
        "source": "T04n0212_018:0707c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵志聞佛所說，歡喜奉行。",
        "translation": "The priests who heard what the Buddha taught rejoiced and handed it down.",
        "source": "T04n0212_018:0707c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是泉何用？",
        "translation": "What's the purpose of this spring?",
        "source": "T04n0212_018:0707c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　水恒停滿，　　拔愛根本，　復欲何望？",
        "translation": "What do we want when the water remains constantly full and the root of our craving is removed?",
        "source": "T04n0212_018:0707c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是泉何用，水恒停滿者，三有者假謂為泉，愛亦名為泉，水恒停滿，一切諸結皆集愛泉，是故說，是泉何用，水恒停滿也。",
        "translation": "\"What's the use of this spring, which is always filled with water? The three existences are nominally called springs, and craving is also called a spring, which is always filled with water; all the bonds are collected in the spring of craving, so it's said, 'What's the use of this spring, which is always filled with water?'",
        "source": "T04n0212_018:0707c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "拔愛根本，復欲何望者，行人以能拔愛根本無復生死，猶如毒樹究盡其根，無復出生亦無枝葉，愛亦如是，無復枝葉拔其根本，復欲何望者？",
        "translation": "Those who uproot craving and then wish for nothing more say that a practitioner who uprooted craving at its root would no longer be subject to birth and death is like a poisonous tree that exhausts its roots and produces no more branches or leaves, so is craving, and what do they wish for when there are no more branches or leaves to uproot at its root?",
        "source": "T04n0212_018:0707c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更不受有更不復生，是故說，復欲何望也。",
        "translation": "\"Nor does it ever again arise when it's not subject to existence; therefore, it's said, 'What do you want again?'",
        "source": "T04n0212_018:0707c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　水人調船，　　弓師調角，　　巧匠調木，　智人調身。",
        "translation": "A waterman regulates boats, a bow master regulates horns, a skilled craftsman regulates wood, and a wise man regulates his body.",
        "source": "T04n0212_018:0707c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "水人調船者，治牢固[牚*支]，治諸孔不使漏水，使眾生類從此岸得至彼岸；弓匠修治筋角調和得所，火炙筋被用不知折。",
        "translation": "A waterman tunes a boat, taming it firmly [ling], taming the holes so that water doesn't leak, and enabling sentient beings to reach the other shore from this shore; a bow maker tames the sinews and horns in a way that's well-adjusted, and he doesn't know when the sinews are heated by fire and used to break them.",
        "source": "T04n0212_018:0707c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，水人調船，弓師調角也。",
        "translation": "Therefore, it's said that a sailor adjusts boats, and a bow maker adjusts horns.",
        "source": "T04n0212_018:0708a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "巧匠調木者，墨縷拼直高下齊平，意欲造立宮室成就，是故說，巧匠調木。",
        "translation": "A skilled craftsman adjusts wood because he wants to build a palace that's perfectly straight and even at the top and bottom, and therefore he says, \"The skilled craftsman adjusts wood.",
        "source": "T04n0212_018:0708a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智者調身者，恒以正教不毀法律，搜求義味，求上人法，是故說，智者調身也。",
        "translation": "Someone who's a wise person tuning their body always uses the right teaching not to disparage the law, searches for meaning and flavor, and seeks the higher person's principles; therefore, they say that the wise person is tuning their body.",
        "source": "T04n0212_018:0708a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶如深泉，　　表裏清徹，　　聞法如是，　智者歡喜。",
        "translation": "He's like a deep spring that's clear on the surface and thorough inside, and when he hears the teaching this way, the wise man is delighted.",
        "source": "T04n0212_018:0708a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如深泉，表裏清徹者，所以說偈，智者以譬喻自解。",
        "translation": "He's like a deep spring that's clear and penetrating on the surface, which is why he says the verse, \"The wise man understands it by metaphor.",
        "source": "T04n0212_018:0708a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有深泉不清恒濁，或復有泉深而且清，於彼自照面像悉現，是故說，猶如深泉，表裏清徹也。",
        "translation": "Sometimes there's a deep spring that isn't clear and remains turbid, or another deep spring that's clear and self-illuminating has its face fully visible, so he says, \"It's like a deep spring that's clear on the surface and penetrating on the inside.",
        "source": "T04n0212_018:0708a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞法如是，智者歡喜者，昔有國王，厭患世典疲倦俗業，往至塔寺欲聽正法。",
        "translation": "He who hears the teaching thus, the wise man rejoices. Once upon a time, a king who was weary of worldly norms and weary of worldly activities went to a stūpa to hear the right teaching.",
        "source": "T04n0212_018:0708a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時象力比丘得阿羅漢道，當次說法。",
        "translation": "The monk Elephant Force had then attained the path of an arhat and was about to preach.",
        "source": "T04n0212_018:0708a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼國王以巾覆頭，脚著履屣入眾聽法。",
        "translation": "The king then put a scarf over his head and put his feet in sandals and entered the congregation to hear the teaching.",
        "source": "T04n0212_018:0708a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羅漢比丘告彼王曰：「昔佛有制，不得為著屣者說法。」",
        "translation": "The arhat monk told the king, \"In the past, the Buddha had a rule that you couldn't preach to someone wearing sandals.\"",
        "source": "T04n0212_018:0708a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王內恚隆盛即脫履屣。",
        "translation": "The king's internal anger became intense, and he took off his sandals.",
        "source": "T04n0212_018:0708a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羅漢比丘復告王曰：「昔佛如來亦說此限，不得與覆頭者說法。」",
        "translation": "The arhat monk then again told the king, \"In the past, the Buddhas and tathāgatas also taught this rule, 'You can't preach to someone who covers their head.'\"",
        "source": "T04n0212_018:0708a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞是語遂興瞋恚，內自思惟：「咄今為此比丘所辱，此比丘故當見我頭白禿，故欲辱我耳；若此比丘說法不入我耳者，當取斫頭。」",
        "translation": "Hearing those words, the king became angry and thought to himself, \"Now, this monk has insulted me; therefore, this monk must have seen that my head is white and bald, and he wants to insult my ears; if this monk's teaching doesn't reach my ears, then he'll chop off my head.\"",
        "source": "T04n0212_018:0708a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時國王即却頭覆，「沙門速為我說法。」",
        "translation": "The king then removed his head and covered it with, \"That monk will quickly explain the teaching for me.\"",
        "source": "T04n0212_018:0708a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘報曰：「如來、至真、等正覺亦說此教，不得為瞋恚者說法。",
        "translation": "The monk replied, \"The Tathāgata, the Supreme Truth, and the Perfectly Enlightened One also teach this, so they can't preach to someone who's angry.",
        "source": "T04n0212_018:0708a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王今瞋恚，何由得說法？",
        "translation": "Now that the king is angry, how can he teach the Dharma?",
        "source": "T04n0212_018:0708a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王當正意聽說譬喻。",
        "translation": "The king will listen to the explanation of the parable with correct intent.",
        "source": "T04n0212_018:0708a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如濁泉涌沸不停，王今如是，心意倒錯何由聞法？」",
        "translation": "It's like a fount of turbidity that doesn't stop boiling, so now, how could the king hear the teaching when his mind is faulty?\"",
        "source": "T04n0212_018:0708a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時國王內自慚愧，即興敬心：「此比丘必是聖人，乃能玄鑒通達人心。」",
        "translation": "The king then felt a sense of shame within himself and immediately felt reverence, \"Surely this monk is a sage who can understand people's minds with profound insight.\"",
        "source": "T04n0212_018:0708a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即從坐起右膝著地頭面禮足，白比丘言：「唯願聖尊與我說法，使此穢形永蒙蔭覆。」",
        "translation": "He rose from his seat, put his right knee on the ground, bowed his head and faced the feet, and said to the monk, \"Please, Your Holiness, give me the teaching so that this defiled form will be permanently covered.\"",
        "source": "T04n0212_018:0708a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即就坐欲得聞法。",
        "translation": "The king then sat down and wanted to hear the teaching.",
        "source": "T04n0212_018:0708a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時比丘便以此偈，向王說曰：「猶如深泉，　　表裏清徹，　　聞法如是，　智者歡喜。」",
        "translation": "The monk then spoke this verse to the king, \"It's like a deep spring, clear and penetrating on the surface, and when you hear the teaching like this, the wise man is delighted.\"",
        "source": "T04n0212_018:0708b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時比丘重與王說法，令彼王心歡喜踊躍，道根信心而不傾動。",
        "translation": "The monk then repeatedly explained the teaching to the king, causing the king's heart to rejoice and jump for joy, and his religious faculties were confident and unshaken.",
        "source": "T04n0212_018:0708b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，聞法如是，智者歡喜也。",
        "translation": "That's why it's said, 'Thus hears the teaching, and the wise man rejoices.'",
        "source": "T04n0212_018:0708b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　忍心如地，　　不動如安明，　澄如清泉，　　智者無亂。",
        "translation": "A tolerant mind is like the ground, immovable as a calm light, and clear as a clear spring, and the wise are not disturbed.",
        "source": "T04n0212_018:0708b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "忍心如地者，猶如此地亦受於淨亦受不淨，地亦不作是念：「我當捨是受是。」",
        "translation": "A tolerant mind like the ground is like this ground that also experiences what's pure and what's impure, and the ground doesn't think, \"I'll let go of this and accept this.\"",
        "source": "T04n0212_018:0708b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智者執行亦復如是，若人嘆譽不以為歡，有毀辱者不懷憂慼，見善不喜聞惡不怒。",
        "translation": "Similarly, a wise person carries out such an action, not rejoicing when people praise them, not becoming sad when they disparage them, and not becoming angry when they see goodness and don't rejoice when they hear evil.",
        "source": "T04n0212_018:0708b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說，忍心如地也。",
        "translation": "Therefore, it's said, 'Forbearance is like the ground.'",
        "source": "T04n0212_018:0708b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不動如安明者，猶如安明獨處眾山，不為暴風所傾動。",
        "translation": "Someone who remains motionless like Anming is like Anming who stands alone on a mountain and isn't tossed by a stormy wind.",
        "source": "T04n0212_018:0708b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢聖之人亦復如是，不為闕四事心有增減，是故說，不動如安明也。",
        "translation": "So too, a good and noble person doesn't let his mind increase or decrease for lack of the four things; therefore, he's said to be as unmoving as a clear and bright mind.",
        "source": "T04n0212_018:0708b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "澄靜如清泉，智者無亂者，猶如澄靜泉表裏清徹，不為小流所嬈濁，智者如是，內既無非外姦不入，心如金剛不可沮壞，是故說，猶如澄泉，智者不亂也(水品第十八竟)。",
        "translation": "He's like a still, pure spring that's clear on the surface and thorough inside, not tainted by small currents; thus, the wise man is like this: his internal lack of wrongdoing and external adultery won't enter, and his mind is like adamant that can't be broken; therefore, he's said to be like a still spring that's not disturbed by wisdom (End of Water Chapter 18).",
        "source": "T04n0212_018:0708b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出曜經卷第十八",
        "translation": "Chuoyao jing, vol. 18",
        "source": "T04n0212_018:0708b21_0",
        "is_bad_quality": false
    }
]