[
    {
        "source_sentence": "賢愚經卷第七",
        "translation": "Sutra of Xiangyu, Volume 7",
        "source": "T04n0202_007:0398a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "元魏涼州沙門慧覺等在高昌郡譯",
        "translation": "Yuan Wei Liangzhou śramaṇa Huijue and others in Gaochang County Translation",
        "source": "T04n0202_007:0398a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（三六）大劫賓寧品第三十一(丹本此品前在第四卷為十八)",
        "translation": "(36) The Thirty-first Chapter of the Great eon of Binding (The Dan edition of this chapter was preceded by the eighteenth in the fourth volume)",
        "source": "T04n0202_007:0398a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T04n0202_007:0398a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時國王名波斯匿，于時南方有國，名為金地，其王字劫賓寧。",
        "translation": "At the time, the king's name was Prasenajit, and there was a country to the south named Goldfields whose king's name was Kapphiṇa.",
        "source": "T04n0202_007:0398a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王有太子，名摩訶劫賓寧，其父崩背，太子嗣位，體性聰明，大力勇健，所統國土，三萬六千，兵眾殷熾，無能敵者，威風遠振，莫不摧伏。",
        "translation": "The king had a crown prince named Mahākauśāmbīnin, whose father died and the crown prince assumed the throne. He was intelligent in nature, powerful and courageous, and ruled a land of 36,000 people with a large army that was invincible and whose authority was so great that no one could defeat it.",
        "source": "T04n0202_007:0398a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然與中國，不相交通。",
        "translation": "However, there was no communication with China.",
        "source": "T04n0202_007:0398a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後有商客，往到金地，以四端細[(畾/且)*毛]，奉上彼王。",
        "translation": "Later, a merchant went to the gold region and presented the king with four small [(dun/and)*hair] tails.",
        "source": "T04n0202_007:0398a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王納受已，問商客言：「此物甚好，為出何處？」",
        "translation": "After accepting it, the king asked the merchant, \"This is a very nice thing; where did it come from?\"",
        "source": "T04n0202_007:0398a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商客答曰：「出於中國。」",
        "translation": "The merchant replied, \"It comes from China.\"",
        "source": "T04n0202_007:0398a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王復問言：「其中國者，名字云何？」",
        "translation": "The king then asked, \"What's the name of that country?\"",
        "source": "T04n0202_007:0398a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商客啟曰：「名羅悅祇，又名舍衛，其數眾多，不能具說。」",
        "translation": "The merchant replied, \"It's called Rājagṛha, or Śrāvastī, and its number is too numerous to mention.\"",
        "source": "T04n0202_007:0398a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王復問言：「中國諸王，以何等故不來獻我？」",
        "translation": "The king then asked, \"What are the reasons the Chinese kings haven't come to present themselves to me?\"",
        "source": "T04n0202_007:0398a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商客啟曰：「各自霸土，威名相齋，以是之故，不來承奉耳。」",
        "translation": "The merchants replied, \"Each has its own dominant land, and their prestige is mutual; therefore, they don't come to pay tribute.\"",
        "source": "T04n0202_007:0398b01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王自思惟：「今我力勢，能總威攝一切天下，何緣諸王不來承貢？",
        "translation": "The king thought to himself, \"Now, my powers and influence can collectively and authoritatively subsume the whole world, so why don't the kings come to pay tribute to me?",
        "source": "T04n0202_007:0398b03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今當加威令彼率伏。」",
        "translation": "Now, I will show them authority and cause them to subdue me.\"",
        "source": "T04n0202_007:0398b04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復問商客：「中國諸王，何者最大？」",
        "translation": "Again, he asked the merchant, \"Which of the Chinese kings is the greatest?\"",
        "source": "T04n0202_007:0398b05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主白言：「舍衛國王，為第一大。」",
        "translation": "The merchant lord said, \"The king of Śrāvastī is the greatest.\"",
        "source": "T04n0202_007:0398b06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時金地王，即便遣使，詣舍衛國，持書示教，其理委備，告語其王波斯匿言：「我之威風，遍閻浮提，卿為所恃，斷絕使命，今故遣使共卿相聞。",
        "translation": "King Kandi then even sent an envoy to Śrāvastī with a written statement showing him the principle and explaining it in detail, and he told his king Prasenajit, \"My authority is so great that it reaches all of Jambudvīpa, and you've been relying on me to cut off your mission, so now I've sent an envoy to speak with you.",
        "source": "T04n0202_007:0398b06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卿若臥時，聞我聲者，尋應起坐；若坐聞者，尋時應立；若食聞聲，應即吐哺；若沐聞聲，應即握髮；若住時聞，應即相趣。",
        "translation": "If you hear my voice while lying down, you should rise and sit; if you sit and hear it, you should stand up when you look for it; if you eat and hear it, you should spit it out; if you wash your hands and hear it, you should hold your hair; and if you hear it while standing, you should go to each other.",
        "source": "T04n0202_007:0398b10_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "却後七日，與我相見，設不如是，吾當興兵破汝國界。」",
        "translation": "If you don't meet me seven days after your retreat, I will raise an army to destroy your country's borders.\"",
        "source": "T04n0202_007:0398b12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波斯匿聞深用驚惶，即往詣佛，具白斯事。",
        "translation": "Deeply alarmed by what he heard, Prasenajit went to the Buddha and explained the whole story.",
        "source": "T04n0202_007:0398b14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告王言：「王還語使云：『我不大，更有大王。』」",
        "translation": "The Buddha told the king, \"The king also said to his envoy, 'I'm not big, but there's another big king.'\"",
        "source": "T04n0202_007:0398b15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王奉佛教，告彼使言：「世有聖王，近在此間。",
        "translation": "In response to the Buddha's teaching, the king told the messenger, \"There's a noble king who's near here.",
        "source": "T04n0202_007:0398b16_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卿可到邊，傳汝王命。」",
        "translation": "You may go to the other side and deliver the king's commands to you.\"",
        "source": "T04n0202_007:0398b17_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使即時往詣於祇桓。",
        "translation": "The envoy then went to Jīvaka.",
        "source": "T04n0202_007:0398b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時世尊自變其身，作轉輪王，令目連作典兵臣，七寶侍從，皆悉備有。",
        "translation": "The Bhagavān then transformed his body into a wheel-turning king and made Maudgalyāyana a military commander with a retinue of seven treasures.",
        "source": "T04n0202_007:0398b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又化祇桓，令作寶城，繞城四邊，有七重壍，其間皆有七寶行樹雜色蓮花，不可稱計，光明晃晃，照然赫發。",
        "translation": "He also transformed [Jīvaka] and made it into a jeweled city that was surrounded by seven rings of hills between which were seven jeweled rows of trees with lotus flowers of incalculable colors that shone brightly and were brilliant.",
        "source": "T04n0202_007:0398b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城中宮殿，亦是眾寶，王在殿上，尊嚴可畏。",
        "translation": "The palace within the city was also filled with treasures, and the king was up in the palace, honored and feared.",
        "source": "T04n0202_007:0398b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是彼使，前入化城，既覩大王，情甚驚悚，自念我君，無狀招禍；然不得已，以書示之。",
        "translation": "That messenger then went into the city of transformation and was terrified when he saw the king. He thought to himself, \"My ruler has no form to invite disaster, but I have no choice but to show him in writing.",
        "source": "T04n0202_007:0398b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化王得書，蹋著脚下，告彼使言：「吾為大王，臨統四域，汝王頑迷，敢見違距。",
        "translation": "When the transformation king got the writing, he put it under his feet and told the envoy, \"I'm the great king who's about to rule the four regions, and you're a stubborn and deluded king who dares to look the other way.",
        "source": "T04n0202_007:0398b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝速還國，致宣吾教。",
        "translation": "Return to your country quickly and tell them about my teaching.",
        "source": "T04n0202_007:0398b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信至之日，馳奔來覲，臥聞當起，坐聞應立，立聞吾令便當涉道。",
        "translation": "On the day your faith arrives, run to visit me, and when you hear that you're lying down, you must get up, hear that you're sitting, and hear my command standing up, then you must set out on the path.",
        "source": "T04n0202_007:0398b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剋期七日，不得稽遲，敢違斯制，罪在不請。」",
        "translation": "Allow seven days for this; don't delay; if you dare to disobey this rule, you'll be guilty of not requesting it.\"",
        "source": "T04n0202_007:0398b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使受教竟，還詣本國，具以聞見，白金地王。",
        "translation": "After he had received the teaching, the envoy returned to his native land and pledged his hearings and views to the king of the land.",
        "source": "T04n0202_007:0398c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王承斯問，深自咎責，合率所領諸小王輩，嚴辦車馬，欲朝大王，然有所疑，未便即路。",
        "translation": "The king was deeply reproached for having received this question, and he gathered a small group of kings under his command to present their chariots and horses to the great king, but he had some doubts about it and was unable to make the journey.",
        "source": "T04n0202_007:0398c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先遣一使白大王言：「臣所總秉，三萬六千，王為當都去，將半去耶？」",
        "translation": "He first sent an envoy to the king, saying, \"My ministers have a total of 36,000, but will the king let them all go, or will he let half of them go?\"",
        "source": "T04n0202_007:0398c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王還報：「聽半留住，但將半來。」",
        "translation": "The king returned the favor, \"Listen, half of you stay here, but half of you come here.\"",
        "source": "T04n0202_007:0398c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時金地王將萬八千小王，同時來到，既見化王，謁拜畢已，心作是念：「大王形貌，雖復勝我，力必不如。」",
        "translation": "The King of the Golden Land then sent 8,000 junior kings to arrive at the same time. When they met the King of Transformation, they paid homage to him and thought, \"Even though the king's appearance is superior to mine, his strength probably isn't.\"",
        "source": "T04n0202_007:0398c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化王于時，勅典兵臣，以弓與之；金地國王，手不能勝。",
        "translation": "The King of Transformation then ordered his military commanders to give him a bow; the king of the golden land was unable to win with his hand.",
        "source": "T04n0202_007:0398c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化王還取，以指張弓，復持與之，勅令引挽；金地國王殊不能挽。",
        "translation": "The king then returned, opened the bow with his fingers, gave it to him again, and commanded him to draw it; the king of the Golden Land was unable to draw it.",
        "source": "T04n0202_007:0398c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化王復取，而彈扣之，三千世界，皆為振動。",
        "translation": "The King of Transformation then took it again, flicked it, and snapped it, and the 3,000 worlds all shook.",
        "source": "T04n0202_007:0398c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次復取箭，彎弓而射，離手之後，化為五發，其諸箭頭，各各皆出無數光明，其光明頭，皆有蓮花，大如車輪，一一花上，各各皆有一轉輪王，七寶具足，奮演光明，普照三千大千世界，五道眾生，莫不蒙賴，諸天境界，見其光明，及聞說法，身心清淨，有得道果第二第三道者，有發無上正真道意，復有得住不退地者。",
        "translation": "After it leaves his hand, it transforms into five arrows, each of which emits an incalculable amount of light. At the head of each of those arrows is a lotus flower as large as a chariot wheel, and on each of those flowers is a wheel-turning king complete with seven treasures that emits a radiant light that thoroughly illuminates the 3,000 great thousand worlds.",
        "source": "T04n0202_007:0398c13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人道眾生，見佛光明，及聞所說，心生踊躍，其中有得一道二道三道之者，出家入要得應真者，有發無上正真道意，得不退地，不可稱計。",
        "translation": "Among those sentient beings in the human path who see the Buddha's radiance and hear what he teaches, their hearts rise in joy, and some of them attain one path, two paths, three paths, leave home, enter the essentials, attain the truth, arouse the unsurpassed true intention for the path, and attain the ground of nonretrogression, which cannot be calculated.",
        "source": "T04n0202_007:0398c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餓鬼中者見佛光明，及聞所說，皆得飽滿，身心清淨，無諸熱惱，皆生慈心，恭敬於佛，即得解脫，生人天中。",
        "translation": "Those among hungry ghosts who see the Buddha's radiance and hear what he teaches are filled, purified in body and spirit, free of fever, and all become compassionate and respectful to the Buddha, which frees them to be born in the heavens.",
        "source": "T04n0202_007:0398c24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "畜生中者，見佛光明，貪欲瞋毒，皆得消除，癡心曚冥，尋得醒悟，皆悉歡喜，信敬於佛，即得解脫，生人天中。",
        "translation": "Those in the animals who see the Buddha's radiance will have their cravings and anger removed, their deluded minds will be awakened, and they'll all rejoice and believe in and revere the Buddha, and they'll be liberated and born in the heavens.",
        "source": "T04n0202_007:0398c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地獄中者，見佛光明，寒則熅煖，熱則清涼，苦痛之處，即得休息，身心踊躍，慈敬於佛，即得解脫，生人天中。",
        "translation": "Those in hell who see the Buddha's radiance are warmed by cold and cooled by heat, attain rest in their painful places, and rejoice in body and spirit as they lovingly honor the Buddha, and they are liberated and are born in the heavens.",
        "source": "T04n0202_007:0398c29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時摩訶劫賓寧王、金地諸王，見斯變已，其心信伏，遠塵離垢得法眼淨，萬八千王，一時皆然。",
        "translation": "After seeing this transformation, Mahākauṣṭhila, King Bindinin, and the kings of the golden regions were convinced, became dustless and spotless, and attained purification of the Dharma eye, as were 8,000 kings at once.",
        "source": "T04n0202_007:0399a02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須臾之頃，佛攝神力，還復本形，諸比丘僧，前後圍繞。",
        "translation": "In a moment's time, the Buddha gathered his spiritual powers and returned to his original form, surrounded by monks and nuns.",
        "source": "T04n0202_007:0399a04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金地王眾，求索出家，佛即聽許，鬚髮自墮，袈裟在體，思惟妙法，盡得阿羅漢果。",
        "translation": "The crowd of golden-ground kings asked to be asked to leave home, and the Buddha gave his permission, dropping his hair on his back and putting his reddish-brown robes on his body, he contemplated the wondrous Dharma and attained the fruit of the arhat in his entirety.",
        "source": "T04n0202_007:0399a06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛：「此金地王，宿種何德，生在豪尊，功德巍巍，遭值佛世，逮成無漏？」",
        "translation": "Ānanda said to the Buddha, \"What qualities did this Vajradhātu king possess from long ago that made him a great venerable and mighty man of virtue who met with the Buddha's world and became untainted?\"",
        "source": "T04n0202_007:0399a08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「眾生由行受其果報。",
        "translation": "The Buddha told Ānanda, \"It's by their actions that sentient beings receive the results.",
        "source": "T04n0202_007:0399a09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往過去，有迦葉佛，般涅槃後，有一長者，為起塔廟，造作堂閣，四供養具。",
        "translation": "Once upon a time, there was an elder who built a stūpa, a hall, and four provisions for Kāśyapa Buddha after his parinirvāṇa.",
        "source": "T04n0202_007:0399a10_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "歲月漸久，而塔崩落，床褥衣食，亦復斷絕。",
        "translation": "As time passed, the stūpa crumbled down, and its beds, mats, and food were cut off.",
        "source": "T04n0202_007:0399a12_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其主長者，有子比丘，便行勸化人民之類，各令減割用治斯塔，又設飲食床臥之具。",
        "translation": "The elder, a son of the monk, then encouraged the people to reduce the number of cuts and use the stūpa, and he provided them with food and drink, beds, and bedding.",
        "source": "T04n0202_007:0399a13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人同心，咸共供承，因發誓願：『當來之世，富貴長壽，值佛出世，聞法獲證，行報無遺，皆令果成。』」",
        "translation": "With one mind, they all made offerings together and vowed, 'In a future life, we'll be rich and long-lived, have the Buddha appear in the world, hear the Dharma and attain its realization, and the rewards of our actions will be endless, and all will be brought to fruition.'\"",
        "source": "T04n0202_007:0399a15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「爾時長者子比丘者，今金地王摩訶劫賓寧是。",
        "translation": "The Buddha told Ānanda, \"At the time, that monk, the eldest son, was Mahākāśyapa, the king of the golden age.",
        "source": "T04n0202_007:0399a17_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其諸人民受道化者，今萬八千諸王是也。」",
        "translation": "Those people who were trained by the Way are now the 18,000 kings.'\"",
        "source": "T04n0202_007:0399a19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說是法，眾會聞者，逮得道證，發心不退，受持至教，歡喜奉行。",
        "translation": "When the Buddha taught this Dharma, the congregation that heard it attained realization of the way, had their resolve not to retreat, accepted the supreme teaching, and joyfully approved of it.",
        "source": "T04n0202_007:0399a20_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎（三七）梨耆彌七子品第三十二(丹本此品在第四卷為第二十)如是我聞：一時佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T04n0202_007:0399a21_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時波斯匿王，有一大臣，名梨耆彌，家居大富，生七男兒，為其娶妻，已至于六，殘第七子，當為求婦。",
        "translation": "At the time, King Prasenajit had a minister named Śrīgupta who lived in a wealthy household and had seven sons whom he married; he had reached the sixth and was expecting his seventh son to be a wife.",
        "source": "T04n0202_007:0399a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自思惟言：「吾年衰邁，唯餘一兒，為之納婦，要令殊勝。」",
        "translation": "He thought to himself, \"I'm old and have only one son left, so I'd like to find a wife for him that would be excellent.\"",
        "source": "T04n0202_007:0399a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時此長者，有一親厚婆羅門，來共相見，因議語曰：「今我欲為小兒求婚，未能知處。",
        "translation": "Then, this elder had a close Brāhmaṇa come to see him, and he discussed the matter with him, saying, \"Now, I'd like to propose marriage for my son, but I don't know where to find him.",
        "source": "T04n0202_007:0399a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卿自昔來，遊行諸國，今欲煩君，為我推覓，若見有女端政賢智，性命相宜，適我子意，乃當求之。」",
        "translation": "Since long ago, you've traveled to many countries, but now I'd like you to search for me. If you see a woman who's respectable, wise, and whose life is suitable for my son's wishes, then you'll ask for her.\"",
        "source": "T04n0202_007:0399a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門，即便然可。",
        "translation": "The Brāhmaṇa then even accepted it.",
        "source": "T04n0202_007:0399b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遍行看覓，到特叉尸利國，見有五百童女，群行遊戲，採取好花，用作拂飾。",
        "translation": "He looked around and went to the country of Takṣaśīlī and saw five hundred young girls playing in a group, taking beautiful flowers and using them as decorations.",
        "source": "T04n0202_007:0399b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此婆羅門，隨逐觀之。",
        "translation": "The Brāhmaṇa followed them around and looked at them.",
        "source": "T04n0202_007:0399b05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉復前行，當度少水，諸女子輩，皆脫革屣，中有一女，而獨不脫，并屣入水。",
        "translation": "As they continued on their journey, they were about to cross a small body of water when all the women took off their leather sandals, but there was one woman who didn't take them off alone and put her sandals into the water.",
        "source": "T04n0202_007:0399b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉復前行，續更有河，眾女褰衣爾乃入水，唯此一女，獨并衣入。",
        "translation": "As they continued on their journey, there was another river, and the women lowered their robes and then entered the water, except for this one woman, who entered with her robes alone.",
        "source": "T04n0202_007:0399b07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前行林間，諸女各各上樹採花，時此一女，自不上樹，從他索之，得花甚多。",
        "translation": "While walking through the forest, the women each went up to a tree to gather flowers, but this one woman didn't go up to the tree herself and asked for flowers from others, and she got a lot of flowers.",
        "source": "T04n0202_007:0399b09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門，問此女言：「我有少疑，欲得相問。」",
        "translation": "The Brāhmaṇa then asked this woman, \"I have a few doubts, and I'd like to ask her about them.\"",
        "source": "T04n0202_007:0399b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其女答曰：「有疑便問。」",
        "translation": "The woman replied, \"If you have any doubts, ask them.\"",
        "source": "T04n0202_007:0399b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門言：「向者諸女，當入水時，盡脫革屣，汝獨不脫，有何意故？」",
        "translation": "The Brāhmaṇa said, \"Those women would have taken off their leather sandals when they entered the water, but you alone haven't taken them off; what do you think?\"",
        "source": "T04n0202_007:0399b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時女答言：「汝癡何甚？",
        "translation": "The woman replied, \"What's your folly?",
        "source": "T04n0202_007:0399b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以作屣，正用護脚，陸地之事，眼有所見，荊棘瓦石，可得避之。",
        "translation": "That's why they wear sandals, which are designed to protect their feet; they can avoid things on land that are visible to the eye and thorns and tiles and rocks.",
        "source": "T04n0202_007:0399b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "水底隱匿，眼所不覩，儻有棘刺及諸毒虫，傷害人脚，是以不脫。」",
        "translation": "Underwater, they're hidden from the eye, and in case there are thorns and poisonous insects that harm one's feet, they won't come off.\"",
        "source": "T04n0202_007:0399b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門，復更問言：「以何事故，并衣入水？」",
        "translation": "The Brāhmaṇa then further asked, \"What was the reason you put your robe in the water?\"",
        "source": "T04n0202_007:0399b17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時女答言：「女人之身，相有好惡，褰衣入水，為人所見，相好則可，不好嗤笑，以是事故，而不褰之。」",
        "translation": "The woman then answered, \"A woman's body has good and bad features, and when she puts her robe down and enters the water, it's OK to have good features but not good enough to be ridiculed; for this reason, she doesn't put it down.\"",
        "source": "T04n0202_007:0399b18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門，復更問言：「以何緣故，獨不上樹？」",
        "translation": "The Brāhmaṇa then further asked, \"What is the reason you don't go up into the trees alone?\"",
        "source": "T04n0202_007:0399b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女便答言：「若當上樹，樹枝儻折，危害人身，以是事故，而不上耳。」",
        "translation": "The woman then replied, \"If I were to climb up that tree, the branches would break against the wall and endanger my person; for that reason, I wouldn't do it.\"",
        "source": "T04n0202_007:0399b22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此女即是波斯匿王弟曇摩訶羨女也。",
        "translation": "This woman is the daughter of King Prasenajit's younger brother, Dharmarakṣa.",
        "source": "T04n0202_007:0399b23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羨昔因罪逃奔彼國，便於其土，安家納娶，而生斯女，字毘舍利。",
        "translation": "She had fled to that country because of a crime and settled down there, got married, and gave birth to this woman named Vaiśālī.",
        "source": "T04n0202_007:0399b24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門，聞女所說，知必賢能，而問女言：「汝父母在不？」",
        "translation": "When the Brāhmaṇa heard what she said, he knew she must be able, and he asked her, \"Are your parents here?\"",
        "source": "T04n0202_007:0399b26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女答曰：「在。」",
        "translation": "The woman answered, \"Yes.\"",
        "source": "T04n0202_007:0399b27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂逐到門，求共相見。",
        "translation": "He then escorted her to the door and asked to see her together.",
        "source": "T04n0202_007:0399b27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女入白父：「外有婆羅門，欲見大人。」",
        "translation": "She went in and told her father, \"There's a Brāhmaṇa outside who wants to see you, sir.\"",
        "source": "T04n0202_007:0399b28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時曇摩訶羨便出見之，問訊已竟，而語之言：「向者女子，是君女不？」",
        "translation": "Dharmarakṣa then went out to meet him, and when he had finished questioning him, he said, \"Is that woman you see there a gentleman's daughter?\"",
        "source": "T04n0202_007:0399b29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「是也。」",
        "translation": "They replied, \"Yes.\"",
        "source": "T04n0202_007:0399c01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「為有主未？」",
        "translation": "\"Does it mean there's a master yet?\"",
        "source": "T04n0202_007:0399c01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「未也。」",
        "translation": "They replied, \"No.\"",
        "source": "T04n0202_007:0399c02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門言：「舍衛國中，有一大臣，字梨耆彌，君識之不？」",
        "translation": "The Brāhmaṇa said, \"Is there a minister in Śrāvastī named Śrīgupta whom you know?\"",
        "source": "T04n0202_007:0399c02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「舊識。」",
        "translation": "He replied, \"I've known him for a long time.\"",
        "source": "T04n0202_007:0399c03_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門言：「是梨耆彌，最下小兒端政聰明，欲求君女共為婚姻，可得爾不？」",
        "translation": "The Brāhmaṇa said, \"Is this the Śrīgupta, the youngest child who's well-balanced and intelligent and wants to ask a gentleman's daughter to be his wife?\"",
        "source": "T04n0202_007:0399c03_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曇摩訶羨言：「彼是豪姓，本與匹偶，苟其欲得，情在無違。」",
        "translation": "Dharmarakṣa said, \"That's a powerful man who was originally married to a spouse, so if he wants to get it, there's nothing wrong with it.\"",
        "source": "T04n0202_007:0399c05_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已蒙許可，便共剋日，爾時有伴，往舍衛國。",
        "translation": "Having received permission, they then shared Kekri and went to Śrāvastī with a companion.",
        "source": "T04n0202_007:0399c06_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門，即作書疏與梨耆彌，陳說事狀。",
        "translation": "The Brāhmaṇa then wrote a written statement to Rājñī, explaining the situation.",
        "source": "T04n0202_007:0399c07_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者聞已，辦具娉物車馬騎乘，往特叉尸利國，漸近欲到，先遣使往。",
        "translation": "After hearing this, the elder prepared a outfit of goodies, chariots, horses, and carriages and departed for Takṣaśīlī, getting close enough to reach it, and first sent an envoy.",
        "source": "T04n0202_007:0399c08_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時曇摩訶羨善加敬待，即設賓會，以女娉之。",
        "translation": "He was then well received by Dharmâkṣa and treated him with respect as he hosted a party and gave him a lady to marry him.",
        "source": "T04n0202_007:0399c10_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸事畢竟，當還舍衛。",
        "translation": "After they had finished their business, they were to return to Śrāvastī.",
        "source": "T04n0202_007:0399c11_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時此女母，於眾人前，囑其女言：「自今已後，常著好衣，恒食美食，日日照鏡，莫令斷絕。」",
        "translation": "The woman's mother then told her daughter, \"From now on, always wear good clothing, eat good food, and look at the mirror every day so that it won't be cut off.\"",
        "source": "T04n0202_007:0399c12_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女即長跪，奉受教勅。",
        "translation": "The woman then knelt down long enough to accept the instruction.",
        "source": "T04n0202_007:0399c14_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梨耆彌聞，陰用為恨。",
        "translation": "When the Śrīgupta heard this, he hated her for her conceit.",
        "source": "T04n0202_007:0399c14_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「人生一世，苦樂無定，好衣美食，如何得常？",
        "translation": "\"In one life, suffering and pleasure are indeterminate, so how can good clothing and good food be permanent?",
        "source": "T04n0202_007:0399c15_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恒照明鏡，斯亦非理。」",
        "translation": "It's also not reasonable to keep lighting the mirror.\"",
        "source": "T04n0202_007:0399c16_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖有此念，難不問之。",
        "translation": "Although he had this thought, it was hard not to ask about it.",
        "source": "T04n0202_007:0399c16_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "客主相辭，於是別去，大小徒侶，進路歸國。",
        "translation": "The guests and hosts excused themselves, so they parted ways, and the disciples, both large and small, went back to their country.",
        "source": "T04n0202_007:0399c17_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於道中間，有一客舍，四面垂軒，極為清涼，其先到者在下休息，兒婦後至，啟白妐言：「此不可住，速出向外。」",
        "translation": "In the middle of the road, there's a guest cottage with a high ceiling on all sides, which is extremely cool. The person who arrived first rests down there, but a child and wife arrive later and say to him, \"You can't stay here; quickly go out into the open.\"",
        "source": "T04n0202_007:0399c18_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妐不違之，出向露處，左右數人，不肯出去。",
        "translation": "Without disobeying him, he went out into the open air, but there were several people around him who refused to go out.",
        "source": "T04n0202_007:0399c21_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有象馬，身體瘙痒以身揩柱，屋即崩壞，填殺下人。",
        "translation": "An elephant or horse then itched and wiped its body against a pillar, and the house collapsed, killing the people underneath.",
        "source": "T04n0202_007:0399c22_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時梨耆彌，作是念言：「我今脫死，由是兒婦。」",
        "translation": "Rājñīputra then had this thought, \"This is the reason I got rid of my son and wife.\"",
        "source": "T04n0202_007:0399c23_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "敬遇之心，倍益隆厚。",
        "translation": "Their respect for him and his friendship grew even more intense.",
        "source": "T04n0202_007:0399c24_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便駕乘，進路而歸。",
        "translation": "He then drove off in his car, entered the road, and returned.",
        "source": "T04n0202_007:0399c24_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到一大澗，草茂水美，眾人息駕，澗側而住。",
        "translation": "They reached a large stream with lush grass and beautiful water, and the people stopped driving and stayed by the side of the stream.",
        "source": "T04n0202_007:0399c25_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兒婦後到，便語之言：「住此不快，速出岸上。」",
        "translation": "When the couple arrived later, they said, \"It's not pleasant to stay here; hurry up and get out on the shore.\"",
        "source": "T04n0202_007:0399c26_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即用其言，遠澗休息。",
        "translation": "They then used their words and rested far from the stream.",
        "source": "T04n0202_007:0399c27_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須臾之間，便有雲起，震雷降雨，滂沛而下，溢澗流來。",
        "translation": "In a short time, clouds arose, and a thunderclap sent down rain that poured down and overflowed the stream.",
        "source": "T04n0202_007:0399c27_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時梨耆彌，復重念曰：「吾等今日，再脫於死，由此兒婦，得全身命。」",
        "translation": "The Śrīgupta then repeated his thought, \"Today, we've been freed from death again, and this will give my children and wife their whole lives.\"",
        "source": "T04n0202_007:0399c29_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復勅嚴駕，涉道進前。",
        "translation": "Again, I commanded him to drive him closely and wade through the roads to reach them.",
        "source": "T04n0202_007:0400a01_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既達本國，中表親里，悉來慶問，長者欣悅，即設供具，共相娛樂，終竟一日，賓客既罷。",
        "translation": "When they reached their own country, they were greeted by their relatives and friends, and the elders were delighted and prepared offerings and entertained each other for a day after the guests had finished.",
        "source": "T04n0202_007:0400a02_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時長者，召諸兒婦，而告之曰：「吾今年高，厭眾事務，家居器物，欲有付託。",
        "translation": "The elder then summoned his children and their wives and told them, \"I'm old and weary of affairs, so I want to entrust my household goods to them.",
        "source": "T04n0202_007:0400a04_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卿等諸人，誰能為我知藏執鑰？」",
        "translation": "Which of you, ladies and gentlemen, can you hold the key to my store for me?\"",
        "source": "T04n0202_007:0400a05_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六大兒婦盡辭不堪，其第七者自言能任。",
        "translation": "The six eldest sons and daughters all refused to accept the offer, but the seventh said she could handle it.",
        "source": "T04n0202_007:0400a06_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時長者，以諸藏鑰，悉以付之。",
        "translation": "The elder then gave them all the keys to his collection.",
        "source": "T04n0202_007:0400a07_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既以受命，勤謹不懈，朝朝早起，灑掃堂舍，炊蒸已竟，先飯妐姑及諸男女，後飯奴婢僮僕，使人各各分處赴趣作業，然後自食，以是為常。",
        "translation": "He was then instructed to be diligent and tireless, rising early every morning, sweeping the hall and finishing the cooking, first feeding the śrāvaka and the boys and girls, then feeding the servants and maids, causing each of them to go to their place of work, and then eating on their own, as was the norm.",
        "source": "T04n0202_007:0400a08_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妐見忠恪不與凡同，怪前母囑而不用之，便問之曰：「汝前來時，被母教勅：『好衣美食，日照明鏡。』",
        "translation": "Seeing that he was different from ordinary people, he wondered why he hadn't used his mother's instructions, and asked him, \"When you came here, your mother taught you, 'Good clothing and food, and light your mirror every day.'",
        "source": "T04n0202_007:0400a11_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其事云何？",
        "translation": "What did she say?",
        "source": "T04n0202_007:0400a13_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卿可說之。」",
        "translation": "You may explain it.\"",
        "source": "T04n0202_007:0400a14_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兒婦長跪，具答事狀：「我母所約，著好衣者，體上大衣，教使愛護，恒令淨潔，時間客會，可得鮮妙；所勅美食，非為甘肥，教使晚飯飢虛得食，麤細盡美；其明鏡者，非銅鐵鏡，教令早起灑掃內外，端整床席，務令淨潔。",
        "translation": "The children and their parents knelt down and gave a detailed answer, \"My mother promised me that those who wear nice clothes, large robes on the body, will be made to love and protect them, keeping them clean so that guests can enjoy them when they visit; those who are commanded to eat well, not sweet or fatty foods, will be taught to eat their evening meals in hunger and deficiency, making them both coarse and fine; and those who have bright mirrors, not copper or iron mirrors, will be taught to get up in the morning, sweep inside and out, make their beds and seats neat and clean.",
        "source": "T04n0202_007:0400a14_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我母所囑，其事如是。」",
        "translation": "My mother instructed him to do likewise.\"",
        "source": "T04n0202_007:0400a19_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時妐聞之，知有妙才，情存待遇，甚倍於前，家中眾物，悉以委之，歡喜泰然，無復憂慮。",
        "translation": "When he heard this, the monk knew he had wonderful abilities, and he was treated with much more affection than before. He entrusted all the household goods to him, rejoiced, and was composed, and had no more anxiety.",
        "source": "T04n0202_007:0400a20_59",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有群鴈，飛入海渚食噉粳米，食之既飽，銜穟翔來當王宮上失墮殿前。",
        "translation": "A flock of them flew into the ocean to eat millet, and when they had eaten, they gathered up grains of rice and flew up to the palace of the king and lost their place in front of the hall.",
        "source": "T04n0202_007:0400a22_60",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人見之，取用奉王。",
        "translation": "When the people see this, they take it and serve it to the king.",
        "source": "T04n0202_007:0400a24_61",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王見奇好，必中作藥，勅使留種莫得棄散，賦與諸臣各令殖之。",
        "translation": "The king saw how attractive it was and how it would surely be used as medicine. He ordered the seeds to be kept so they wouldn't be discarded, and gave them to his ministers to plant.",
        "source": "T04n0202_007:0400a24_62",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時梨耆彌亦得少許持至於家，教令種之。",
        "translation": "The Śrīgupta also obtained a small amount, took it to his home, and instructed him to plant it.",
        "source": "T04n0202_007:0400a26_63",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兒婦奉取，驅率奴僕，調和畦田，於中下種，生長滋茂大獲子實；諸人種者，消息失度悉皆不生。",
        "translation": "The sons and daughters took it, drove their servants out, harmonized the borders, and planted in the middle and lower fields, where it grew and prospered and produced fruit; those who planted it with others lost control of their news and all failed to produce.",
        "source": "T04n0202_007:0400a27_64",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王夫人，欻得篤疾，召問諸醫治病所由。",
        "translation": "The king's wife then, crashing into a serious illness, summoned doctors to find out what was causing it.",
        "source": "T04n0202_007:0400a29_65",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中有醫言：「當須海渚粳米作食，食之爾乃可差。」",
        "translation": "One of the doctors said, \"You must make millet from the sea and eat it, and then you'll be able to get rid of it.\"",
        "source": "T04n0202_007:0400b01_66",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王自憶念：「昔得其種，賦人墾殖，今當推校為有為無？」",
        "translation": "The king thought to himself, \"I got this seed in the past and gave it to someone to cultivate; should I ask whether it exists now or not?\"",
        "source": "T04n0202_007:0400b02_67",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即召諸臣，而問之言：「前勅種稻，為成熟不？",
        "translation": "He summoned the ministers and asked them, \"Did you plant the rice I was told to plant before, or is it ripe?",
        "source": "T04n0202_007:0400b03_68",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今日急須用治困病。」",
        "translation": "Today, it's urgent to use it to treat a difficult illness.\"",
        "source": "T04n0202_007:0400b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸臣各各自說本末，或云不生，或云鼠噉。",
        "translation": "The ministers each told the story, saying that it wasn't growing, or that it was being devoured by rats.",
        "source": "T04n0202_007:0400b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時梨耆彌歸家問曰：「前種稻米，為獲實不？",
        "translation": "When Rājñī returned home, he asked, \"Did you obtain the substance of the rice you planted earlier?",
        "source": "T04n0202_007:0400b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲得與王治夫人病。」",
        "translation": "I'd like to give the king a remedy for your wife's illness.\"",
        "source": "T04n0202_007:0400b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兒婦答言：「家內豐多，若用作藥足周一國，不齊一人也。」",
        "translation": "The couple replied, \"There's so much in my house that if I used it as medicine for a kingdom, it wouldn't equal one person.\"",
        "source": "T04n0202_007:0400b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時梨耆彌，即送與王，尋用作食，以與夫人。",
        "translation": "The Śrīgupta then sent it to the king, found something to eat, and gave it to the lady.",
        "source": "T04n0202_007:0400b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫人食已，病得除愈。",
        "translation": "After she ate, she was cured of her illness.",
        "source": "T04n0202_007:0400b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王甚歡喜，大與賞賜。",
        "translation": "The king was delighted and gave her a great reward.",
        "source": "T04n0202_007:0400b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時特叉尸利舍衛二國，共相嫌隙，常不和順。",
        "translation": "At the time, the two countries of Takṣaśīlī and Śrīvastī were at odds with each other and were often at odds with each other.",
        "source": "T04n0202_007:0400b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時特叉尸利王，欲試舍衛有聖智不？",
        "translation": "Then, King Takṣaśīlī wanted to test whether Śrāvastī had noble wisdom.",
        "source": "T04n0202_007:0400b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遣一使者至舍衛國，送[馬*字]馬二匹，而是母子，形狀毛色，一類無異，能別識者實為大善。",
        "translation": "An envoy was sent to the country of Śrāvastī with two [horse*sword] horses, mother and cub, of the same shape and hair color, which were really quite good if they could discern them.",
        "source": "T04n0202_007:0400b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王及群臣，不能分別。",
        "translation": "The king and his ministers were unable to distinguish between them.",
        "source": "T04n0202_007:0400b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時梨耆彌，從宮歸家，兒婦問言：「有何消息？」",
        "translation": "When Rājimī returned home from the palace, his children asked, \"What news?\"",
        "source": "T04n0202_007:0400b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妐即答言如向所見。",
        "translation": "The monk then replied, \"As I've seen it before.",
        "source": "T04n0202_007:0400b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兒婦白言：「此事易知，何足為憂？",
        "translation": "The couple replied, \"This is easy to know, so why should it be a cause for concern?",
        "source": "T04n0202_007:0400b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但取好草，並頭而與，其是母者，推草與之；其是子者，抴搏食之。」",
        "translation": "He takes good grass and gives it to them both at the head; if it's the mother, he'll push it out and give it to her; if it's the son, he'll wrestle with it and eat it.\"",
        "source": "T04n0202_007:0400b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時梨耆彌尋往白王，王如其語，以草試之，果如其策，母子區別。",
        "translation": "The king did as he said, tested the grass with it, and it turned out to be just as he had planned, with the mother and the foal being distinguished.",
        "source": "T04n0202_007:0400b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即語使者：「斯是馬母，彼是其駒。」",
        "translation": "He then said to the messenger, \"This is the mother of the horse, and that is its colt.\"",
        "source": "T04n0202_007:0400b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時使答言：「審如來語，無有差錯。」",
        "translation": "The messenger then replied, \"Examine the Tathāgata's words, there's nothing wrong with them.\"",
        "source": "T04n0202_007:0400b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王大歡喜，倍加爵賞。",
        "translation": "The king was greatly pleased and gave him a double honor.",
        "source": "T04n0202_007:0400b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼來使，還歸本國，具白諸理。",
        "translation": "The messenger then returned to his native land and explained the reasons.",
        "source": "T04n0202_007:0400b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時特叉尸利王，便更遣使，送於二蛇，麤細長短相似如一，能別雄雌者，斯亦大善。",
        "translation": "King Takṣaśīlī then sent another envoy to deliver two snakes, both coarse and fine, long and short, that resemble each other and can distinguish male from female, which is also very good.",
        "source": "T04n0202_007:0400b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波斯匿王，及諸群臣，無能識者。",
        "translation": "King Prasenajit and his ministers had no one who could recognize them.",
        "source": "T04n0202_007:0400b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時梨耆彌，歸問兒婦：「此復云何？」",
        "translation": "Rājimī then returned to his children and asked, \"What's this?\"",
        "source": "T04n0202_007:0400b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兒婦答言：「以一端細[(畾/且)*毛]，敷置於地，取此二蛇，用著[(畾/且)*毛]上，若是雌者，靜然不動，其是雄者，搔擾不寧。",
        "translation": "The couple replied, \"Take one end of a small [(dun/and)*hair], lay it on the ground, and take these two snakes and put them on the [(dun/and)*hair].",
        "source": "T04n0202_007:0400b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以知之？",
        "translation": "How can we know this?",
        "source": "T04n0202_007:0400c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女之為性，愛著細滑，得軟生染，不欲動搖；男子性剛，轉側不安。",
        "translation": "A woman's nature is to be attached to the delicate and smooth, and she becomes defiled by the softness and doesn't want to be shaken; a man's nature is rigid, and he becomes restless when he turns to the side.",
        "source": "T04n0202_007:0400c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此推之，可足知矣。」",
        "translation": "By inferring this, it's sufficient to know.\"",
        "source": "T04n0202_007:0400c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者聞已，即往白王。",
        "translation": "After hearing this, the elder went to the king and told him.",
        "source": "T04n0202_007:0400c03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王從其計，尋時試之，果如所言，了了識別。",
        "translation": "The king followed his advice, tried it out at some point, and it was just as he had said, completely identifying it.",
        "source": "T04n0202_007:0400c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "告彼使曰：「是雄是雌。」",
        "translation": "He told his envoy, \"Is it a male or a female?\"",
        "source": "T04n0202_007:0400c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使尋報曰：「審爾不虛。」",
        "translation": "The messenger then answered, \"I'm sure you're not lying.\"",
        "source": "T04n0202_007:0400c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王甚慶悅，大賜財寶。",
        "translation": "The king was delighted and gave him a great gift of treasure.",
        "source": "T04n0202_007:0400c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼國王，復送一木，長滿一丈，根杪正等，無有節目刀斧之迹，而語之曰：「若能識別此木上下，亦大快善，甚不可量。」",
        "translation": "The king then sent another log, a full foot long, with its roots and branches perfectly proportioned and without any signs of a knife or axe on display, and told him, \"If you could discern the top and bottom of this log, it would be very pleasant and good, and quite incalculable.\"",
        "source": "T04n0202_007:0400c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王及諸臣，無能識者。",
        "translation": "The king and his ministers had no one who could identify it.",
        "source": "T04n0202_007:0400c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時梨耆彌，復問兒婦，兒婦答曰：「此事易耳，但取其木，用著水中，根自沈沒，頭浮在上。」",
        "translation": "The Śrīgupta again asked his children, who replied, \"It's easy. Just take this wood, put it in water, and its roots will sink, while its head floats up.\"",
        "source": "T04n0202_007:0400c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者聞已，復往白王。",
        "translation": "After the elder heard this, he went back to the king and told him.",
        "source": "T04n0202_007:0400c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王用其語，而便試之，果如其計，沈浮各殊。",
        "translation": "The king used his words and then tried it, and it did as he had planned, with the difference between sinking and floating.",
        "source": "T04n0202_007:0400c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "語彼使言：「浮者是頭，沈處是根。」",
        "translation": "He told his envoy, \"The floating part is the head, and the sunken part is the faculty.\"",
        "source": "T04n0202_007:0400c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時使答言：「信如所論。」",
        "translation": "The messenger then replied, \"I believe it's as discussed.\"",
        "source": "T04n0202_007:0400c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王益歡喜，重與賞賜。",
        "translation": "The king was delighted and gave him a generous reward.",
        "source": "T04n0202_007:0400c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼使還國，具白因緣。",
        "translation": "The envoy returned to his country and explained the reasons for his return.",
        "source": "T04n0202_007:0400c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其王聞之，心用信伏，更遣使命，兼獻珍寶，因復語曰：「大王國中，實有賢達，自今以後，當修義好。」",
        "translation": "On hearing this, the king was convinced and sent another envoy with an order to present him with treasures.",
        "source": "T04n0202_007:0400c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波斯匿王，情倍踊躍，召梨耆彌，而問之曰：「頃來諸事，卿何由知？」",
        "translation": "The king of Prasenajit was doubly excited, summoned Ragtimed, and asked him, \"How do you know about the things that have happened in the past?\"",
        "source": "T04n0202_007:0400c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梨耆彌言：「非臣所達，是臣兒婦之智辯耳。」",
        "translation": "Rājñī said, \"It's not something I've attained; it's the wisdom and eloquence of my son and wife.\"",
        "source": "T04n0202_007:0400c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國王聞已，深加欣敬，拜其兒婦，用為王妹。",
        "translation": "When the king heard this, he was deeply pleased and honored, and he made his son and wife his sisters.",
        "source": "T04n0202_007:0400c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復經少時，兒婦懷妊，日月已滿，生三十二卵，其一卵中，出一男兒，形體顏貌，端嚴挺特。",
        "translation": "A little while later, when the days and months had passed and the woman was pregnant, she gave birth to thirty-two eggs, and from one of those eggs there arose a boy whose form and shape were dignified and outstanding.",
        "source": "T04n0202_007:0400c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "年遂長大，勇健無雙，一人之力，敵於千夫，父母愛念，合國敬畏；後為納娶，各已備畢，純是國中豪賢之女。",
        "translation": "He grew to be very brave and strong, and his strength alone was equal to that of a thousand men. His parents loved him and the whole country respected him.",
        "source": "T04n0202_007:0400c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時毘舍離，信心開解，請佛及僧於舍供養。",
        "translation": "Vaiśālī was then enlightened in faith and invited the Buddha and his saṃgha to make offerings at their residence.",
        "source": "T04n0202_007:0400c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛為說法，合家眷屬，得須陀洹，唯末小兒，未獲道迹。",
        "translation": "The Buddha preached for them, and their entire family became stream-winners, except for their youngest child, who hadn't yet attained the steps of the Way.",
        "source": "T04n0202_007:0400c26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時乘白象，欲出遊戲，門外有壍，既深且廣，於其壍上，有大木橋，時此年少，適到橋宕，爾時復有輔相之子乘車外來，橋中相逢，各恃豪姓，不相開避。",
        "translation": "He was riding a white elephant when he wanted to go out to play. Outside the gate there was a road that was both deep and wide, and on the road there was a large wooden bridge.",
        "source": "T04n0202_007:0400c28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毘舍離兒，便懷瞋恚，就於象上，低身下向，捉輔相子并其車乘，擲置壍中，身體傷破，百節皆痛，啼哭而歸，白其父言：「毘舍離兒，橫見毀辱，傷我身體，苦痛若斯。」",
        "translation": "Vaiśālī then became angry, got up on an elephant, lowered himself down, grabbed the auxiliary's son and his chariot, and threw them into a lake, wounding his body and causing pain in all his joints.",
        "source": "T04n0202_007:0401a02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其父聞之，甚用懊惱，恤其子言：「彼人力壯，又是國親，難與爭勝，當思密計以報此怨。」",
        "translation": "When his father heard this, he was deeply distressed and sympathized with his son, saying, \"That man is strong and close to his country, so it's hard to compete with him; you should think of a secret plan to repay this enmity.\"",
        "source": "T04n0202_007:0401a06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即以七寶，合為馬鞭三十二枚，用好純剛，作刀內中，三十二人，各遺一枚，而語之言：「汝等年少，體性自嬉，故作此鞭，而用相贈，幸可納之，恒捉在手。」",
        "translation": "He then took seven treasures and combined them into thirty-two whips, made them into swords with good, pure hardness, and left one inside each of the thirty-two of them, saying, \"You're young and naturally playful, so you made these whips as a gift.",
        "source": "T04n0202_007:0401a08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人歡慶，便為受之。",
        "translation": "The people rejoiced and accepted it.",
        "source": "T04n0202_007:0401a12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時國法，見王之時，禮不帶刀。",
        "translation": "It was then the state's rule that when you see the king, you must not carry a sword in propriety.",
        "source": "T04n0202_007:0401a12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是輔相，已見納受而常秉執，便向國王，深譖讒之，云：「毘舍離三十二子，年盛力壯，一人敵千，今懷異計，謀欲害王。」",
        "translation": "The auxiliary minister then, having seen the acceptance and always holding onto it, approached the king with a profound message, saying, \"Thirty-two sons of Vaiśālī are young and strong, and one of them is worth a thousand; now, they have a different plan to harm the king.\"",
        "source": "T04n0202_007:0401a13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王雖聞之，情猶未信。",
        "translation": "Although the king heard about it, he still wasn't convinced.",
        "source": "T04n0202_007:0401a16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復更白王：「事審不虛，現有證驗，各作利刀，置馬鞭中，以此推之，事足明矣。」",
        "translation": "Again, he said to the king, \"The facts are certainly not false, and there's already proof that each one was made into a sharp sword and placed in a horse whip.",
        "source": "T04n0202_007:0401a16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即索看，果如所言，王意便信，謂必為然。",
        "translation": "The king then asked to see them, and they were just as they had said. The king then believed it, saying that it must be so.",
        "source": "T04n0202_007:0401a18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "選擇力士，安在宮內，一一召喚，於裏殺之。",
        "translation": "He chose some strong men, placed them in the palace, summoned each one, and killed them inside.",
        "source": "T04n0202_007:0401a19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以三十二頭，盛著一函，繫縛封印，送與其妹。",
        "translation": "He took thirty-two heads, put them in a letter, bound and sealed it, and sent it to his sister.",
        "source": "T04n0202_007:0401a20_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當於是日，其毘舍離，請佛及僧就家供養，見王送函，謂為致供來相助辦，便欲開看。",
        "translation": "On that day, Vaiśālī invited the Buddha and the saṃgha to make offerings to his family, and when he saw the king deliver the letter, he said he had come to help him with the offerings and wanted to open it.",
        "source": "T04n0202_007:0401a21_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告曰：「且住勿解，須待食竟。」",
        "translation": "The Bhagavān told him, \"Stop right there and don't understand it until you've eaten.\"",
        "source": "T04n0202_007:0401a23_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "食飽已訖，便命令坐，為其說法。",
        "translation": "When he had finished eating, he ordered him to sit down and taught him the Dharma.",
        "source": "T04n0202_007:0401a24_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「此身無常苦空無我，生多危懼，不得久立，眾惱纏縛，辛酸難計，恩愛別離互相悲戀，唐困身識，於道無益。",
        "translation": "\"This body is impermanent, painful, empty, and without self; it produces many fears, can't stand for long, is tied up by many afflictions, is painful and difficult to fathom, is torn apart by affection and pity, and traps the body and consciousness, which is useless in the path.",
        "source": "T04n0202_007:0401a25_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯有智者，能解此惡。」",
        "translation": "Only a wise person can understand this evil.\"",
        "source": "T04n0202_007:0401a27_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時毘舍離，霍然情悟，得阿那含道，歡喜合掌，白世尊言：「唯垂矜愍！",
        "translation": "Vaiśālī then, suddenly enlightened, attained the path of non-returners, rejoiced, put his palms together, and said to the Bhagavān, \"Please have mercy on me!",
        "source": "T04n0202_007:0401a28_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見賜四願：一者諸病比丘，給足湯藥隨病飲食。",
        "translation": "Seeing the four vows granted, one, that sick monks be given enough medicine to eat and drink as they get sick.",
        "source": "T04n0202_007:0401a29_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者看病比丘亦給其食。",
        "translation": "Second, that monk who sees a sick person also gives him food.",
        "source": "T04n0202_007:0401b02_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者遠來比丘，先供養之。",
        "translation": "Third, a monk who's traveled from afar will first make offerings to him.",
        "source": "T04n0202_007:0401b02_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者遠行比丘，給辦糧餉。",
        "translation": "Fourth, a monk who's traveled from afar will be given provisions.",
        "source": "T04n0202_007:0401b03_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T04n0202_007:0401b03_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸病比丘，由無湯藥好飲食故，其病難差，或復沒命。",
        "translation": "\"Sick monks, because there's no hot water or good food, their illness is difficult to heal, and their lives may be lost.",
        "source": "T04n0202_007:0401b04_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞻病比丘，由無食故，當捨乞食，早晚無時，病人所須或能差錯，違心恚怒，病則難愈，以是之故，當施其食。",
        "translation": "Because of the lack of food, a monk who's looking after a sick person must abandon begging for food; there's no time in the morning or evening when what's needed by the sick person might not be right, and when he's angry with himself, it's difficult to heal his illness; therefore, he must give food to them.",
        "source": "T04n0202_007:0401b05_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有他方遠來比丘，初到異土，未有知識，若行乞食，或值惡狗，或逢弊人，儻能瞋恚，傷損毀辱，以是之故，當先與食。",
        "translation": "If a monk from another land who has traveled far away and has no friends for the first time goes begging for food, he might encounter a bad dog or a bad person who might be angry and hurt or humiliate him.",
        "source": "T04n0202_007:0401b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠去比丘，當須伴侶，由無糧餉，或不逮伴，道路遐險，多諸毒獸，設當獨涉或致危難。",
        "translation": "A monk who's traveling far away from home will need a companion because he doesn't have enough to eat or doesn't have a companion, and the path is dangerous and full of venomous animals, so he might encounter danger if he wades through it alone.",
        "source": "T04n0202_007:0401b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以是故，當供給之。」",
        "translation": "It's for this reason that I will make offerings to them.\"",
        "source": "T04n0202_007:0401b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊聞毘舍離求此四願，讚言：「善哉善哉！",
        "translation": "It was then that the Bhagavān heard Vaiśālī's request for these four vows and praised him, \"Good, good!",
        "source": "T04n0202_007:0401b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所願，其德弘大，供佛無異。」",
        "translation": "As you wish, its virtue is great, and there's no difference between offering it to the Buddha.\"",
        "source": "T04n0202_007:0401b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即與眾僧，還到祇桓。",
        "translation": "He and the monks then returned to Jiwan.",
        "source": "T04n0202_007:0401b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊去後，開函視之，三十二頭，悉在函中，由愛斷故，不生懊惱，但作是言：「痛哉悲哉！",
        "translation": "After the Bhagavān left, he opened the envelope and examined them. He saw that all thirty-two heads were inside the envelope, and because his craving had been stopped, he didn't become distressed but said, \"Oh, how sad!",
        "source": "T04n0202_007:0401b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人生有死，不得長久，驅馳五道，何苦乃爾？」",
        "translation": "Why is it so painful to drive across the five destinies when there's death in life and it won't last long?\"",
        "source": "T04n0202_007:0401b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十二兒，婦家親族，聞此事理，極懷瞋恚，咸共唱言：「大王無道，抂殺善人，共合兵馬，欲為報仇。」",
        "translation": "When the thirty-two sons and their wives and relatives heard about this principle, they became extremely angry and all chanted, \"The king is immoral and unjustified in killing good people, so let's combine our armies and horses in order to take revenge.\"",
        "source": "T04n0202_007:0401b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "軍眾雲集，圍繞王宮。",
        "translation": "An army gathered around the king's palace.",
        "source": "T04n0202_007:0401b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王恐怖，退向佛所。",
        "translation": "The king was terrified and retreated to the Buddha.",
        "source": "T04n0202_007:0401b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人聞之，即引軍馬，往圍祇桓。",
        "translation": "When they heard about it, they led their armies to surround Jīvaka.",
        "source": "T04n0202_007:0401b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿難，聞波斯匿王，殺毘舍離三十二子，婦家宗黨欲為報仇，長跪合掌，白世尊言：「有何因緣，三十二兒，為王所殺？」",
        "translation": "It was then that Ānanda heard that King Prasenajit had killed thirty-two of Vaiśālī's sons, and that his wife's family wanted to take revenge. He knelt down long and put his palms together and said to the Bhagavān, \"What were the reasons that thirty-two sons were killed by the king?\"",
        "source": "T04n0202_007:0401b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告曰：「毘舍離子三十二人，不但今日為王所殺，三十二人一時頓死。",
        "translation": "The Bhagavān told them, \"Not only were the 32 people of Vaiśravaṇa killed by the king today, but 32 of them died at once.",
        "source": "T04n0202_007:0401b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今善聽！",
        "translation": "Now, listen well!",
        "source": "T04n0202_007:0401b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持之在心，當為汝說。」",
        "translation": "Keep it in your mind, and I will explain it for you.\"",
        "source": "T04n0202_007:0401b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難曰：「諾。」",
        "translation": "Ānanda said, \"Promise.\"",
        "source": "T04n0202_007:0401b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「乃往過去久遠世時，此三十二人，共為親友，相與言議，盜他一牛。",
        "translation": "The Buddha told Ānanda, \"Once upon a time in a distant past, these thirty-two people were close friends who talked to each other and stole a cow from another.",
        "source": "T04n0202_007:0401b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時國中，有一老母，無有子息，單窮困厄。",
        "translation": "At the time, there was an elderly mother in that country who had no children and was destitute and alone.",
        "source": "T04n0202_007:0401c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸偷兒，往詣其舍，欲共殺牛；老母歡喜，為辦薪水煮熟之具。",
        "translation": "Those thieves then went to his house, intending to kill the cow together; the old mother was delighted and prepared a meal for him, which was cooked.",
        "source": "T04n0202_007:0401c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臨下刀時牛跪匃命，諸人意盛，必欲殺之，牛便結誓：『汝今殺我，將來之世，我不置汝，正使得道，猶不相放。』",
        "translation": "When she was about to lay down the knife, the cow knelt down and offered her life.",
        "source": "T04n0202_007:0401c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "立誓已竟，便為所殺。",
        "translation": "After he finished making that vow, he was killed.",
        "source": "T04n0202_007:0401c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人燒煮，競共噉之，老母因次，亦得飽滿，欣悅而言：『由來安客，今日最善。』」",
        "translation": "They all cooked it and shared it with each other, and the old mother, having been filled next, rejoiced and said, 'This is the most pleasant of all the guests we've had in the past.'\"",
        "source": "T04n0202_007:0401c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「爾時牛者，今波斯匿王是。",
        "translation": "The Buddha told Ānanda, \"At the time, that cow was the present-day King Prasenajit.",
        "source": "T04n0202_007:0401c09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時盜牛人者，今毘舍離三十二子是。",
        "translation": "The cow thief was now the thirty-two sons of Vaiśālī.",
        "source": "T04n0202_007:0401c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時老母者，今毘舍離是。",
        "translation": "The old mother at the time was now Vaiśālī.",
        "source": "T04n0202_007:0401c10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此果報，五百世中，常為所殺，乃至於今。",
        "translation": "As a result, she was always killed, even now, for 500 generations.",
        "source": "T04n0202_007:0401c11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時老母，由助喜故，五百世中，常為作母，極懷懊惱，今值我時，始獲道證。」",
        "translation": "That elderly mother, who had always been a mother and had suffered great distress for five hundred generations because of the joy that helped her, now, attains the realization of the path when it's my time.\"",
        "source": "T04n0202_007:0401c12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難合掌，重白佛言：「復修何福，豪富猛健？」",
        "translation": "Ānanda joined his palms and repeatedly said to the Buddha, \"What further merit has he cultivated that makes him so rich and robust?\"",
        "source": "T04n0202_007:0401c14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「乃往過去迦葉佛時，有一老母，信敬三寶，其家大富，合集眾香，以油和之，欲往塗塔。",
        "translation": "The Buddha told Ānanda, \"Once upon a time, when Kāśyapa Buddha was alive, an elderly mother who believed in and respected the Three Treasures and whose family was very wealthy gathered a multitude of incense sticks, mixed it with oil, and wanted to go to paint a stūpa.",
        "source": "T04n0202_007:0401c15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其中路，逢三十二人，因而勸之：『我欲以油塗塔，可相助佐，當得福德，世世所生，端正多力。』",
        "translation": "On her way there, she met 32 people who urged her, 'I want to paint a stūpa with oil, so I can help by obtaining merit and being born in the world with correctness and strength.'",
        "source": "T04n0202_007:0401c17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時三十二人，歡喜共去。",
        "translation": "The thirty-two people then rejoiced and departed together.",
        "source": "T04n0202_007:0401c19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "塗塔已竟，各作是言：『由是老母故，令我等得種福業，願所生處，尊榮富貴，恒為我母，我等為子，常莫相離，見佛聞法，疾得道果。』",
        "translation": "After they finished painting the stūpa, each of them said, 'Because of this old mother, we've been able to cultivate good fortune, and may the place where we're born be honored, prosperous, and wealthy; we will always be our mother and we will be our sons; we must never be separated from each other; we'll see the Buddha and hear the Dharma; and we'll quickly attain the fruit of the path.'",
        "source": "T04n0202_007:0401c20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "老母喜悅，便許可之。",
        "translation": "The old mother was delighted, and she approved.",
        "source": "T04n0202_007:0401c23_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從是已來，五百世中，恒生尊貴。",
        "translation": "From then on, for five hundred generations, she'll always be honored.'",
        "source": "T04n0202_007:0401c24_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時老母，今毘舍離是。",
        "translation": "At the time, this was the old mother, and now this is Vaiśālī.",
        "source": "T04n0202_007:0401c24_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時三十二人，今三十二子是。」",
        "translation": "At the time, the thirty-two people were the present thirty-two sons.\"",
        "source": "T04n0202_007:0401c25_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸軍眾，聞佛所說，恚心便息，而作是言：「大王所刑，非適為之，此人自種，今受其報，由殺一牛，猶尚如是。",
        "translation": "When the army heard what the Buddha said, their anger subsided, and they said, \"The king didn't do this punishment appropriately; this man planted it himself, and now he's being rewarded for killing a cow, even though it was like this.",
        "source": "T04n0202_007:0401c26_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波斯匿王，是我曹主，云何懷惡，而欲危害？」",
        "translation": "King Prasenajit, this is our lord, so why do you harbor evil and want to harm him?\"",
        "source": "T04n0202_007:0401c28_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即除器仗，自投王前，求哀請過；王亦釋然，不問其罪。",
        "translation": "He removed his weapons, threw himself in front of the king, begged for mercy, and was excused by the king, who also agreed and didn't question his crimes.",
        "source": "T04n0202_007:0401c29_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，因為四眾廣說諸法，善業應修，惡行應離，敷演分別四諦妙法。",
        "translation": "At the time, the Bhagavān explained in detail to the four audiences the various teachings, the good actions to cultivate and the bad actions to avoid, and explained the wonderful teaching that discerns the four truths.",
        "source": "T04n0202_007:0402a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾會聞者皆得道證，受持佛教，歡喜奉行。",
        "translation": "Those who heard it all attained realization of the path, accepted Buddhism, and joyfully approved of it.",
        "source": "T04n0202_007:0402a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "（三八）設頭羅健寧品第三十三(丹本為二十一)",
        "translation": "(38) Chapter 33 of the Heroic March (Danben: 21)",
        "source": "T04n0202_007:0402a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞：一時佛在羅閱祇竹園中。",
        "translation": "Thus I have heard: One time, the Buddha was present in the Rājagṛha Bamboo Park.",
        "source": "T04n0202_007:0402a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時賢者阿難，從座而起，整衣服長跪叉手，前白佛言：「阿若憍陳如，伴黨五人，宿有何慶，依何因緣，如來出世，法鼓初震獨先得聞，甘露法味特先得甞？",
        "translation": "It was then that the good man Ānanda rose from his seat, adjusted his robes, knelt down long with his palms together, and said to the Buddha, \"Ājñāta-kauṇḍinya, what fortune have you had in the past and by what causes and conditions did the Tathāgata appear in the world, first shake the Dharma drum and first hear it alone, and especially first taste the flavor of the nectar of the Dharma?",
        "source": "T04n0202_007:0402a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願垂哀！",
        "translation": "I beg your pity!",
        "source": "T04n0202_007:0402a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具為解說。」",
        "translation": "Explain them in detail.\"",
        "source": "T04n0202_007:0402a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時世尊，告阿難言：「此五人者，先世之時，先食我肉，致得安隱，是故今日，先得法食，用致解脫。」",
        "translation": "The Bhagavān then addressed Ānanda, \"These five people first ate my flesh in a previous life and attained peace; therefore, today, they first obtained the Dharma diet, which will lead to their liberation.\"",
        "source": "T04n0202_007:0402a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿難重白佛言：「先世食肉，有何因緣？",
        "translation": "Ānanda then repeatedly said to the Buddha, \"What were the reasons why they ate meat in a previous life?",
        "source": "T04n0202_007:0402a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願具開示。」",
        "translation": "Please explain this in detail.\"",
        "source": "T04n0202_007:0402a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告之曰：「過去久遠，無量無數阿僧祇劫，此閻浮提，有大國王，名曰設頭羅健寧，領閻浮提，八萬四千國，六萬山川，八十億聚落，二萬夫人婇女。",
        "translation": "The Buddha told him, \"Once upon a time, long ago, in an incalculably long incalculable eon, there was a great king of Jambudvīpa named Śītūra Kainin who ruled Jambudvīpa, with 84,000 countries, 60,000 mountains and rivers, 8 billion villages, and 20,000 wives and daughters.",
        "source": "T04n0202_007:0402a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王有慈悲，憐念一切，人民之類，靡不蒙賴。",
        "translation": "The king is compassionate and kind to all people, and none of the people are taken into account.",
        "source": "T04n0202_007:0402a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時國中，有火星現，相師尋見，而白王言：『若火星現，當旱不雨經十二年。",
        "translation": "At the time, a spark appeared in the middle of the country, and the fortune teller looked into it and said to the king, 'If a spark appeared, there would be a drought and no rain for 12 years.",
        "source": "T04n0202_007:0402a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今有此變，當如之何？』",
        "translation": "Now that this has happened, what will it be?'",
        "source": "T04n0202_007:0402a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞是語，甚大憂愁：『若有此災，奈何民物？",
        "translation": "When the king heard these words, he was greatly distressed, 'What will happen to the people's goods if there's such a disaster?'",
        "source": "T04n0202_007:0402a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "民命不濟，無復國土。』",
        "translation": "If the people's lives aren't helped, the country won't be restored.'",
        "source": "T04n0202_007:0402a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即合群臣，而共議之。",
        "translation": "He then gathered his ministers together to discuss the matter.",
        "source": "T04n0202_007:0402a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾臣咸曰：『當下諸國計現民口，復令算數倉篅現穀，知定斛斗，十二年中人得幾許。』",
        "translation": "The ministers all said, 'Suppose you were to count the people's population and order a calculation of the grain present in the warehouses and tell them how many grains they can get in 12 years.'",
        "source": "T04n0202_007:0402a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王從其議，即時宣令，急勅算之。",
        "translation": "The king complied with their suggestion, immediately announced the order, and hastily ordered it to be counted.",
        "source": "T04n0202_007:0402a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "都計算竟，一切人民，日得一升，猶尚不足，從是已後，人民飢餓，死亡者眾。",
        "translation": "When the calculation was finished, the people received one liter a day, but it was still not enough; since then, the people have starved and many have died.",
        "source": "T04n0202_007:0402a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王自念曰：『當設何計濟活人民？』",
        "translation": "The king thought to himself, 'What plan will be devised to save the people's lives?'",
        "source": "T04n0202_007:0402a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因與夫人婇女，出遊園觀，到各休息。",
        "translation": "He and his wife and daughters went out to look around the garden and went to rest.",
        "source": "T04n0202_007:0402a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王伺眾眠寐，即從座起，向四方禮，因立誓言：『今此國人，飢羸無食，我捨此身，願為大魚，以我身肉，充濟一切。』",
        "translation": "As he waited for the crowd to fall asleep, the king got up from his seat, paid homage to the four directions, and made a vow, 'Now that the people of this country are hungry and have nothing to eat, I'll give up this body and vow to become a great fish and use my flesh to feed them all.'",
        "source": "T04n0202_007:0402a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即上樹端，自投於地，即時命終，於大河中，為化生魚，其身長大，五百由旬。",
        "translation": "He went up to the top of a tree, threw himself to the ground, and at the end of his life, he became a miraculously-born fish in a large river, and his body grew to be 500 leagues long.",
        "source": "T04n0202_007:0402b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時國中，有木工五人，各齎斤斧，往至河邊，規斫材木。",
        "translation": "\"At the time, there were five carpenters in the country, each carrying a weight and axe, who went to the river and planned to chop down timber.",
        "source": "T04n0202_007:0402b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼魚見已，即作人語而告之曰：『汝等若飢，欲須食者，來取我肉；若復食飽，可齎持去。",
        "translation": "When the fish saw them, they spoke to them like men, saying, 'If you're hungry and want to eat, come get my flesh; if you've had enough to eat again, you can carry it away.",
        "source": "T04n0202_007:0402b06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今先食我肉，而得充飽，後成佛時，當以法食濟脫汝等。",
        "translation": "Now, if you eat my flesh first and have enough to eat, then when you become buddhas later, I'll give you food from the Dharma to help you escape.",
        "source": "T04n0202_007:0402b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝可并告國人大小，有須食者，悉各來取。』",
        "translation": "You may tell the people of your country, both large and small, to come and get it if they need it.'",
        "source": "T04n0202_007:0402b09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五人歡喜，尋各斫取，食飽齎歸，因以其事具語國人。",
        "translation": "Rejoicing, the five men each chopped and picked up a piece of meat, carried it back when it was finished, and told the people of the country about it.",
        "source": "T04n0202_007:0402b10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是人民，展轉相語，遍閻浮提，悉皆來集，噉食其肉，一脇肉盡，即自轉身，復取一脇，皆復食盡，故處還生，復轉身與之。",
        "translation": "After the people had talked to each other in turn, they all gathered from all over Jambudvīpa to devour their flesh. When the flesh from one hypochondrium was gone, they turned around and took another hypochondrium, and they all ate it up again.",
        "source": "T04n0202_007:0402b12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是翻覆，恒以身肉，給濟一切，經十二年。",
        "translation": "He went on and on like this, always giving his flesh to all of them for twelve years.",
        "source": "T04n0202_007:0402b14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其諸眾生，食其肉者，皆生慈心，命終之後，得生天上。",
        "translation": "All those sentient beings who eat their flesh become compassionate, and when their lives end, they're born up in the heavens.",
        "source": "T04n0202_007:0402b15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「阿難！",
        "translation": "\"Ānanda!",
        "source": "T04n0202_007:0402b17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲知爾時設頭羅健寧王者，則我身是。",
        "translation": "\"Do you want to know who then was King Kainin of Shadraka, or who I am?",
        "source": "T04n0202_007:0402b17_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時五木工，先食我肉者，今憍陳如等五比丘是。",
        "translation": "Those five carpenters who first ate my flesh were the five monks Kauṇḍinya and others today.",
        "source": "T04n0202_007:0402b18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其諸人民後食肉者，今八萬諸天，及諸弟子得度者是。",
        "translation": "Those people who ate my flesh later were the 80,000 gods and their disciples who were saved.",
        "source": "T04n0202_007:0402b19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於爾時，先以身肉，充彼五人，令得濟活，是故今日最初說法，度彼五人，以我法身少分之肉，除彼三毒飢乏之苦。」",
        "translation": "At the time, I first fed those five people with my flesh so that they could live, so today I first taught the Dharma and delivered the Dharma to those five people, using a little bit of my Dharma body to remove the three poisons and the suffering of starvation.\"",
        "source": "T04n0202_007:0402b20_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢者阿難及諸會者，聞佛所說，且悲且喜，頂戴奉行。",
        "translation": "Good man Ānanda and the assembled people who heard what the Buddha taught were both compassionate and joyous, and they bowed their heads in respect and handed it down.",
        "source": "T04n0202_007:0402b23_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎賢愚經卷第七",
        "translation": "Śīlabhadra-sūtra, Vol. 7",
        "source": "T04n0202_007:0402b24_22",
        "is_bad_quality": false
    }
]