[
    {
        "source_sentence": "佛所行讚卷第五(亦云佛本行經)",
        "translation": "Buddhacarita, Vol. 5 (also called Sutra of the Past Activities of the Buddha)",
        "source": "T04n0192_005:0042b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "馬鳴菩薩造",
        "translation": "created by Aśvaghoṣa Bodhisattva",
        "source": "T04n0192_005:0042b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "北涼天竺三藏曇無讖譯",
        "translation": "Translated by the Tripiṭaka of Northern Liang and India, Dharmakṣema",
        "source": "T04n0192_005:0042b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "神力住壽品第二十三",
        "translation": "Chapter XXIII of the Abiding Life of the Spiritual Powers",
        "source": "T04n0192_005:0042b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時鞞舍離，　　諸離車長者，　聞世尊入國，　　住菴摩羅園。",
        "translation": "It was then that Vaiśālī, the elders of Licchavi, heard that the Bhagavān had entered the country and was staying at Āmravana.",
        "source": "T04n0192_005:0042b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有乘素車輿，　　素蓋素衣服，　青赤黃綠色，　　其眾各異儀。",
        "translation": "They were riding in a plain chariot with a plain hood and plain clothing, blue, red, yellow, and green, and their attendants were all different in manner.",
        "source": "T04n0192_005:0042b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　導從翼前後，　　爭塗競路前，　天冠袞花服，　　寶飾以莊嚴，　威容盛明曜，　　增暉彼園林。",
        "translation": "They are guided, flanked, and scattered in front of and behind them, competing for the road, wearing a crown of beads and flowers, adorned with jewelry, and their appearance so radiant that it graces the grove.",
        "source": "T04n0192_005:0042b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　除捨五威儀，　　下車而步進，　息慢而形恭，　　頂禮於佛足，　大眾圍遶佛，　　如日重輪光。",
        "translation": "He dismounted from his chariot and marched forward with the five comportments, calmly and respectfully deferred, paid homage to the Buddha's feet, and was surrounded by a great multitude like the sun with its heavy-wheeled radiance.",
        "source": "T04n0192_005:0042b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　離車名師子，　　為諸離車長，　德貌如師子，　　位居師子臣，　滅除師子慢，　　受誨釋師子。",
        "translation": "He is called \"lion,\" the head of the chariots that leave, has the appearance of a lion, ranks as a minister of the lion, stops lion conceit, and receives instructions from the lion of the Śākyas.",
        "source": "T04n0192_005:0042c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等大威德，　　名族美色容，　能除世憍慢，　　受法以增明，　財色香花飾，　　不如戒莊嚴。",
        "translation": "\"You are of great authority, a noble family with beautiful features that removes worldly conceit and enhances insight by accepting the Dharma, and you're not adorned with wealth, color, scents, or flowers like the precepts.",
        "source": "T04n0192_005:0042c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　國土豐安樂，　　唯以汝等榮，　榮身而安民，　　在於調御心。",
        "translation": "Your land is rich and peaceful, and it's only because of you that it's glorious, and the people are made secure in their minds.",
        "source": "T04n0192_005:0042c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　加以樂法情，　　令德轉崇高，　非薄土群鄙，　　而能集眾賢。",
        "translation": "By delighting in the feelings of the Dharma, your virtue becomes exalted, and you're not just a despicable group of people in a meager land that can gather a multitude of good men.",
        "source": "T04n0192_005:0042c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當日新其德，　　撫養於萬民，　導眾以明正，　　如牛王涉津。",
        "translation": "They will then renew their virtue, nourish all the people, and guide them to righteousness like a king of cattle wading through a river.",
        "source": "T04n0192_005:0042c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人能自念，　　今世及後世，　唯當脩正戒，　　福利二世安。",
        "translation": "If someone can think to themselves, in this world and the next, they must cultivate right morality for the welfare of both worlds.",
        "source": "T04n0192_005:0042c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為眾所敬重，　　名稱普流聞，　仁者樂為友，　　德流永無疆。",
        "translation": "He'll be respected by all, his name will be widely heard, and kind people will enjoy being his friends, so his virtue will never fade.",
        "source": "T04n0192_005:0042c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　山林寶玉石，　　皆依地而生，　戒德亦如地，　　眾善之所由。",
        "translation": "The precious stones of the mountains and forests all grow from the earth, and the virtue of the precepts is like the earth, the source of all goodness.",
        "source": "T04n0192_005:0042c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無翅欲騰虛，　　渡河無良舟，　人而無戒德，　　濟苦為實難。",
        "translation": "Without wings, his desire rises into the sky, and he has no good boat to cross the river; without the virtue of morality, a person's suffering is really difficult to relieve.",
        "source": "T04n0192_005:0042c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如樹美花果，　　針刺難可攀，　多聞美色力，　　破戒者亦然。",
        "translation": "Like a tree with beautiful flowers and fruits that are hard to climb with a needle, well-versed in the power of beautiful forms, a person who breaks the precepts does the same.",
        "source": "T04n0192_005:0042c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　端坐勝堂閣，　　王心自莊嚴，　淨戒功德具，　　隨大仙而征。",
        "translation": "Sitting upright in a lofty hall, the king's mind is self-adorned, and the virtues of the precepts are fully present as the great sage conquers them.",
        "source": "T04n0192_005:0042c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　染服衣毛羽，　　螺髻剃鬚髮，　不脩於戒德，　　方涉眾苦難。",
        "translation": "He dyes his robes and hair, shaves his beard and hair with a conch-tuft, and wades through many hardships unless he cultivates the virtues of morality.",
        "source": "T04n0192_005:0042c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　日夜三沐浴，　　奉火修苦行，　遺身穢野獸，　　赴水火投巖。",
        "translation": "He bathes three times day and night, cultivates asceticism in the service of fire, leaves his body in the filth of wild animals, and goes down into the fire and water.",
        "source": "T04n0192_005:0042c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　食菓餌草根，　　吸風飲恒水，　服氣以絕糧，　　遠離於正戒。",
        "translation": "They eat fruit, bait, and grass roots, inhale wind and drink constant water, cut off food with their breath, and distance themselves from the right precepts.",
        "source": "T04n0192_005:0043a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　習斯禽獸道，　　非為正法器，　毀戒招誹謗，　　仁者所不親。",
        "translation": "Practicing this kind of animal path is not a proper vessel for the Dharma, and disparaging the precepts brings disparagement that's not dear to a good person.",
        "source": "T04n0192_005:0043a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　心常懷恐怖，　　惡名如影隨，　現世無利益，　　後世豈獲安？",
        "translation": "Their minds are always filled with fear, and a bad reputation follows them like a shadow; they receive no benefit in the present life, so how can they find peace in the afterlife?",
        "source": "T04n0192_005:0043a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故智慧士，　　當修於淨戒，　於生死曠野，　　戒為善導師。",
        "translation": "Therefore, men of wisdom should cultivate pure morality, for in the wilderness of birth and death, morality is a good guide.",
        "source": "T04n0192_005:0043a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　持戒由自力，　　此則不為難，　淨戒為梯隥，　　令人上昇天。",
        "translation": "It's not difficult to observe the precepts because of one's own strength, and they serve as a stepping-stone that allows one to ascend to heaven.",
        "source": "T04n0192_005:0043a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　建立淨戒者，　　斯由煩惱微，　諸過壞其心，　　喪失善功德。",
        "translation": "Those who establish pure precepts do so because of the weakness of afflictions, which corrupt their minds and deprive them of good qualities.",
        "source": "T04n0192_005:0043a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　先當離我所，　　我所覆諸善，　猶灰覆火上，　　足蹈而覺燒。",
        "translation": "They must first part with what belongs to self, which covers goodness like ashes on a fire, and their feet feel burned when they step on it.",
        "source": "T04n0192_005:0043a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　憍慢覆其心，　　如日隱重雲，　慢怠滅慚愧，　　憂悲弱強志，　老病壞壯容，　　我慢滅諸善。",
        "translation": "Pride covers his mind like a sun that hides a heavy cloud, laziness destroys conscience, sadness and pity weaken resolve, old age and illness spoil his appearance, and self-conceit extinguishes good qualities.",
        "source": "T04n0192_005:0043a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天阿修羅，　　貪嫉興諍訟，　喪失諸功德，　　悉由我慢懷。",
        "translation": "The gods and asuras, whose craving and jealousy fuel strife, lose their virtues because of my conceit.",
        "source": "T04n0192_005:0043a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我於勝中勝，　　我德勝者同，　我於勝小劣，　　斯則為愚夫，　色族悉無常，　　動搖不暫停，　終為磨滅法，　　何用憍慢為？",
        "translation": "I'm superior in the midst of superiority, I'm equal in virtue to those who are superior, I'm inferior in superiority, and I'm a fool; my form family is all impermanent, unshaken, and not suspended; I'll eventually become extinct; why is there a need for conceit?",
        "source": "T04n0192_005:0043a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　貪欲為巨患，　　詐親而密怨，　猛火從內發，　　貪火亦復然。",
        "translation": "Desire is a great danger, deceiving relatives and harboring enmity; a fierce fire arises from within, so does the fire of greed.",
        "source": "T04n0192_005:0043a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　貪欲之熾燃，　　甚於世界火，　火盛水能滅，　　貪愛難可消。",
        "translation": "Desire is so blazing that it's greater than a world fire, and while fire and water can extinguish it, it's difficult to extinguish craving.",
        "source": "T04n0192_005:0043a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猛火焚曠野，　　草盡還復生，　貪欲火焚心，　　正法生則難。",
        "translation": "A fierce fire burns down the wilderness, but the grass grows back, and when the fire of desire burns the mind, it's difficult to produce the right dharma.",
        "source": "T04n0192_005:0043a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　貪欲求世樂，　　樂增不淨業，　惡業墮惡道，　　怨無過貪欲。",
        "translation": "Covetousness seeks worldly pleasures, pleasure increases impure actions, bad actions lead to a bad destiny, and enmity is no greater than covetousness.",
        "source": "T04n0192_005:0043b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　貪則生於愛，　　愛則習諸欲，　習欲招眾苦，　　元惡無過貪，　貪則為大病，　　智藥愚夫止，　邪覺不正思，　　能令貪欲增。",
        "translation": "Craving then gives rise to craving, craving then cultivates desires, cultivating desires brings about suffering, the primary evil is not greater than craving, craving then becomes a major illness, wisdom teaches fools to stop, and wrong perceptions and incorrect thoughts can increase craving.",
        "source": "T04n0192_005:0043b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無常苦不淨，　　無我無我所，　智慧真實觀，　　能滅彼邪貪。",
        "translation": "Impermanent, painful, and impure, without self or what belongs to self, wisdom and true contemplation can cease that mistaken greed.",
        "source": "T04n0192_005:0043b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故於境界，　　當修真實觀，　真實觀已生，　　貪欲得解脫。",
        "translation": "Therefore, in this realm, you should cultivate true contemplation, and once true contemplation arises, desire for covetousness is liberated.",
        "source": "T04n0192_005:0043b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見德生貪欲，　　見過起瞋恚，　德過二俱忘，　　貪恚得除滅。",
        "translation": "Seeing virtues that give rise to desire, seeing faults that give rise to anger, and forgetting both virtues and faults, greed and anger can be removed.",
        "source": "T04n0192_005:0043b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　瞋恚改素容，　　能壞端正色，　瞋恚翳明目，　　害法義欲聞，　斷絕親愛義，　　為世所輕賤。",
        "translation": "Anger changes one's plain appearance, destroys one's good looks, blinds one's bright eyes with anger, harms the desire to hear the meaning of the teaching, cuts off the meaning of affection, and becomes despised by the world.",
        "source": "T04n0192_005:0043b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故當捨恚，　　勿隨於瞋心，　能制狂恚心，　　是名善御者，　世稱善調駟，　　是為攝繩容。",
        "translation": "Therefore, you must abandon anger, don't follow anger, and be able to restrain a raging mind, which is called a good disciplinarian and is known in the world as a well-controlled arrow, which is a way to control one's ropes.",
        "source": "T04n0192_005:0043b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　縱恚不自禁，　　憂悔火隨燒，　若人起瞋恚，　　先自燒其心，　然後加於彼，　　或燒或不燒。",
        "translation": "Even if anger isn't self-restrained, the fires of regret burn with it. If someone becomes angry, they first burn their own mind, and then they inflict it on others, whether it's burned or not.",
        "source": "T04n0192_005:0043b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　生老病死苦，　　逼迫於眾生，　復加於恚害，　　多怨復增怨。",
        "translation": "The suffering of birth, age, sickness, and death forces sentient beings to suffer, and then they are harmed by anger, which often adds to their enmity.",
        "source": "T04n0192_005:0043b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見世眾苦迫，　　應起慈悲心，　眾生起煩惱，　　增微無量差。」",
        "translation": "Seeing the suffering and oppression of the world, one should become compassionate, for the afflictions that arise in sentient beings increase and decrease immeasurably.\"",
        "source": "T04n0192_005:0043b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來善方便，　　隨病而略說，　譬如世良醫，　　隨病而投藥。",
        "translation": "The Tathāgata's skillful means are to explain the disease in brief as it arises, like a good doctor of the world who administers medicine according to the disease.",
        "source": "T04n0192_005:0043b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時諸離車，　　聞佛所說法，　即起禮佛足，　　歡喜而頂受。",
        "translation": "Hearing what the Buddha taught, the Licchavi then rose and bowed their heads at his feet, rejoicing and accepting it.",
        "source": "T04n0192_005:0043b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　請佛及大眾，　　明日設薄供。",
        "translation": "They asked the Buddha and the community to make a modest offering tomorrow.",
        "source": "T04n0192_005:0043c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛告諸離車：　　「菴摩羅已請。」",
        "translation": "The Buddha told the Licchavi charioteers, \"Āmradārika has asked for it.\"",
        "source": "T04n0192_005:0043c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　離車懷感愧，　　彼何奪我利？",
        "translation": "The Licchavi charioteers felt a sense of shame, 'Why did he take my profit?'",
        "source": "T04n0192_005:0043c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　知佛心平等，　　而起隨喜心。",
        "translation": "Knowing the equality of the Buddha's mind, they give rise to a joyous attitude.",
        "source": "T04n0192_005:0043c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來善隨宜，　　安慰令心悅，　伏化純熟歸，　　如蛇被嚴呪。",
        "translation": "The Tathāgata adapts well, soothes and pleases his mind, and subdues and turns him into a pure refuge like a snake under a dhāraṇī spell.",
        "source": "T04n0192_005:0043c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　夜過明相生，　　佛與大眾俱，　詣菴摩羅舍，　　受彼供養畢，　往詣毘紐村，　　於彼夏安居。",
        "translation": "After the night passed and the dawn appeared, the Buddha and the whole group went to the Āmravana temple, accepted their offerings, went to the village of Viṣṇu, and stayed there for the summer retreat.",
        "source": "T04n0192_005:0043c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三月安居竟，　　復還鞞舍離，　住獼猴池側，　　坐於林樹間。",
        "translation": "After three months of retreat, he returned to Vaiśālī, stayed by the monkey pond, and sat among the trees.",
        "source": "T04n0192_005:0043c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　普放大光明，　　以感魔波旬，　來詣於佛所，　　合掌勸請言：「昔尼連禪側，　　已發真實要，　我所作事畢，　　當入於涅槃。",
        "translation": "He emitted a bright light that caused Māra Pāpīyān to come to the Buddha, clasping his hands in exhortation, saying, \"Once upon a time, Nairañjāna Zenji gave rise to the true teaching that after I finish what I've been doing, I'll enter nirvāṇa.",
        "source": "T04n0192_005:0043c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今所作已作，　　當遂於本心。」",
        "translation": "Now that I've done what I did, I will realize my original mind.\"",
        "source": "T04n0192_005:0043c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時佛告波旬：　　「滅度時不遠，　却後三月滿，　　當入於涅槃。」",
        "translation": "The Buddha then told Pāpīyān, \"The time of extinction isn't far off, and when the three months following its passing are complete, I'll enter nirvāṇa.\"",
        "source": "T04n0192_005:0043c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時魔知如來，　　滅度已有期，　情願既已滿，　　歡喜還天宮。",
        "translation": "Knowing that the Tathāgata's extinction had already been postponed, Māra rejoiced and returned to the heavenly palace after fulfilling his vows.",
        "source": "T04n0192_005:0043c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來坐樹下，　　正受三摩提，　放捨業報壽，　　神力住命存。",
        "translation": "The Tathāgata sits under a tree, is undergoing samādhi, releases his life as the result of karma, and his spiritual powers abide in his life.",
        "source": "T04n0192_005:0043c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以如來捨壽，　　大地普震動，　十方虛空境，　　周遍大火然。",
        "translation": "As the Tathāgata extinguishes his life span, the earth shakes universally, and the realm of space in the ten directions is surrounded by a great conflagration.",
        "source": "T04n0192_005:0043c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　須彌頂崩頹，　　天雨飛礫石，　狂風四激起，　　樹木悉摧折，　天樂發哀聲，　　天人心忘歡。",
        "translation": "The summit of Sumeru crumbles, rocks fly from the sky, a fierce wind arises in all directions, trees are all broken down, celestial music arouses lamentation, and gods' hearts forget their joy.",
        "source": "T04n0192_005:0043c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛從三昧起，　　普告諸眾生：「我今已捨壽，　　三昧力存身，　身如朽敗車，　　無復往來因，　已脫於三有，　　如鳥破卵生。」",
        "translation": "Rising from samādhi, the Buddha addressed the sentient beings, \"Now, I've given up my life, and the power of samādhi survives in my body, which is like a rotten chariot with no more past causes, freed from the three existences, and like a bird that has broken through its eggs and arisen.\"",
        "source": "T04n0192_005:0043c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛所行讚離車辭別品第二十四",
        "translation": "Buddhacarita, Secluded Chapter 24",
        "source": "T04n0192_005:0044a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　尊者阿難陀，　　見地普大動，　心驚身毛竪，　　問佛何因緣？",
        "translation": "Venerable Ānanda, seeing the earth in great commotion, was startled when his body hair stood on end and asked the Buddha what the cause was.",
        "source": "T04n0192_005:0044a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛告阿難陀：　　「我住三月壽，　餘命行悉捨，　　是故地大動。」",
        "translation": "The Buddha told Ānanda, \"I've stayed three months of my life, and I've given up all the rest of my life's activities; that's why the ground is greatly disturbed.\"",
        "source": "T04n0192_005:0044a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　阿難聞佛教，　　悲感淚交流，　猶如大力象，　　搖彼栴檀樹，　擾動理迫迮，　　香汁淚流下。",
        "translation": "When Ānanda heard the Buddha's teaching, he was overcome with sorrow and tears, like a powerful elephant shaking a sandalwood tree, which disturbs and constricts the principle and sap flows down in tears.",
        "source": "T04n0192_005:0044a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「親重大師尊，　　恩深未離欲，　惟此四事故，　　悲苦不自勝。",
        "translation": "\"He's close to a great teacher, deeply endeared, and never free of desire, but these four events cause sorrow and suffering that are not self-exciting.",
        "source": "T04n0192_005:0044a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今我聞世尊，　　涅槃決定教，　舉體悉萎消，　　迷方失常音，　所聞法悉忘，　　荒悸亡天地。",
        "translation": "Now, I've heard the Bhagavān's decisive teaching about nirvāṇa, and my body has all withered away, I've lost my voice in a deluded place, I've forgotten everything I've heard, and I'm desolate and lost to heaven and earth.",
        "source": "T04n0192_005:0044a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　怪哉救世主，　　滅度一何駃，　遭寒水垂死，　　遇火忽復滅。",
        "translation": "Strange, isn't it, that the Savior of the world has extinguished a single one, dying in cold water and suddenly going out again when he meets fire?",
        "source": "T04n0192_005:0044a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於煩惱曠野，　　迷亂失其方，　忽遇善導師，　　未度忽復失。",
        "translation": "In the wilderness of affliction, he's confused and loses his way, and then he suddenly meets a good guide who suddenly loses him again before he's saved.",
        "source": "T04n0192_005:0044a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如人涉長漠，　　熱渴久乏水，　忽遇清涼池，　　奔趣悉枯竭。",
        "translation": "Like a person wading through a long desert, their thirst is prolonged, and they suddenly encounter a cool pond, and their running destiny is all dried up.",
        "source": "T04n0192_005:0044a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　紺睫瞪睛目，　　明鑒於三世，　智慧照幽冥，　　昏冥一何速？",
        "translation": "With violet eyebrows and staring eyes, he sees clearly through the three worlds, and his wisdom illuminates the dark, but how quickly does darkness set in?",
        "source": "T04n0192_005:0044a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶如旱地苗，　　雲興仰希雨，　暴風雲速滅，　　望絕守空田。",
        "translation": "They're like seedlings in a dry land when clouds arise and they long for rain. The storm clouds quickly disappear, and their hopes are cut off as they guard the empty fields.",
        "source": "T04n0192_005:0044a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無智大闇冥，　　群生悉迷方，　如來燃慧燈，　　忽滅莫由出。」",
        "translation": "It's a great darkness without wisdom, and all sentient beings are confused about their direction. The Tathāgata burns the lamp of wisdom, but it suddenly goes out without being heard.\"",
        "source": "T04n0192_005:0044a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛聞阿難說，　　酸訴情悲切，　軟語安慰言，　　為說真實法。",
        "translation": "When the Buddha heard Ānanda's words, he complained with sadness and pity, spoke softly and comfortingly, and explained the true teaching.",
        "source": "T04n0192_005:0044a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若人知自性，　　不應處憂悲，　一切諸有為，　　悉皆磨滅法。",
        "translation": "\"If a person knows their own nature, they shouldn't be sad and compassionate, and all the things that exist are all factors that are subject to cessation.",
        "source": "T04n0192_005:0044b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我已為汝說，　　合會性別離，　恩愛理不常，　　當捨悲戀心。",
        "translation": "I've explained for you that the nature of union is separate, that affection is in principle impermanent, and that you should abandon pity and clinging to mind.",
        "source": "T04n0192_005:0044b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有為流動法，　　生滅不自在，　欲令長存者，　　終無有是處。",
        "translation": "The mobile nature of existent things that arise and cease aren't self-perpetuating, and there's no place for those who want to make it last.",
        "source": "T04n0192_005:0044b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有為若常存，　　無有遷變者，　此則為解脫，　於何而更求？",
        "translation": "If existent things persist and don't change, this is liberation, so why should we seek it any further?",
        "source": "T04n0192_005:0044b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝及餘眾生，　今於我何求？",
        "translation": "What do you and the rest of the world's beings want from me now?",
        "source": "T04n0192_005:0044b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝等所應得，　我以為說竟，　　何用我此身？",
        "translation": "After I explain what you deserve, why would I use this body of mine?",
        "source": "T04n0192_005:0044b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　妙法身長存，　　我住我寂靜，　所要唯在此。",
        "translation": "\"The marvelous Dharma body always remains, and I abide in my quiescence, which is the only thing that matters.",
        "source": "T04n0192_005:0044b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　然我於眾生，　未曾有所惓。",
        "translation": "Still, I've never had any concern for sentient beings.",
        "source": "T04n0192_005:0044b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　當修厭離想，　善住於自洲。",
        "translation": "I'll cultivate the notion of freedom from them, and I'll abide well on my own island.",
        "source": "T04n0192_005:0044b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　當知自洲者，　專精勤方便，　　獨靜脩閑居，　不從於他信。",
        "translation": "You should know that this is his own island, where he focuses his efforts on skillful means, lives alone in quietude and seclusion, and doesn't follow the faith of others.",
        "source": "T04n0192_005:0044b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　當知法洲者，　決定明慧燈，　　能滅除癡闇，　觀察四境界。",
        "translation": "You should know that this is the island of the Dharma, where he determines the lamp of insight, extinguishes delusion and observes the four objective realms.",
        "source": "T04n0192_005:0044b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　逮得於勝法，　離我離我所，　　骨竿皮肉塗，　血澆以筋纏。",
        "translation": "He has attained the surpassing dharma, is free of self and free of objects of self, coats his bones with flesh, and pours blood and ties up tendons.",
        "source": "T04n0192_005:0044b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諦觀悉不淨，　云何樂此身？",
        "translation": "Truly observing them all as impure, how can they enjoy this body?",
        "source": "T04n0192_005:0044b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸受從緣生，　猶如水上泡，　　生滅無常苦，　遠離於樂想。",
        "translation": "*Feelings arise from conditions, like bubbles on water, birth and extinction are impermanent and painful, and they're free from pleasant thoughts.",
        "source": "T04n0192_005:0044b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　心識生住滅，　新新不暫停。",
        "translation": "The mind's consciousness arises, abides, and ceases, and newness isn't suspended.",
        "source": "T04n0192_005:0044b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　思惟於寂滅，　常想永已乖。",
        "translation": "When he contemplates cessation, his perception of permanence is permanently distorted.",
        "source": "T04n0192_005:0044b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　眾行因緣起，　聚散不常俱。",
        "translation": "Conditioned by the causes and conditions of all conditioned phenomena, they gather and disperse impermanently.",
        "source": "T04n0192_005:0044b27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　愚癡生我想，　慧者無我所。",
        "translation": "Foolishly, they give rise to the perception of self, and wise ones have no object of self.",
        "source": "T04n0192_005:0044b28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　於此四境界，　思惟正觀察，　　此則一乘道，　眾苦悉皆滅。",
        "translation": "When these four objects are contemplated and correctly observed, this is the One Vehicle path, and all suffering ceases.",
        "source": "T04n0192_005:0044b29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若能住於此，　真實正觀者，　　佛身之存亡，　此法常無盡。」",
        "translation": "If someone can abide here and truly and correctly observe them, the Buddha's body will exist and perish, and this Dharma will always be inexhaustible.\"",
        "source": "T04n0192_005:0044c02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　佛說此妙法，　安慰阿難時，　　諸離車聞之，　惶怖咸來集。",
        "translation": "When the Buddha spoke this wonderful teaching to comfort Ānanda, the Licchavi heard it and gathered here in fear.",
        "source": "T04n0192_005:0044c04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　悉捨俗威儀，　驅馳至佛所，　　禮畢一面坐，　欲問不能宣。",
        "translation": "They all abandoned their ordinary manners and drove to the Buddha's place, where they sat at one side after paying homage and wanted to ask questions that couldn't be explained.",
        "source": "T04n0192_005:0044c06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　佛已知其心，　逆為方便說：　　「我今觀察汝，　心有異常想，　　放捨俗緣務，　唯念法為情。",
        "translation": "Knowing his mind, the Buddha spoke rebelliously and skillfully, \"Now, I've observed that you have abnormal thoughts in your mind, abandoning worldly causal duties and focusing only on the teaching as sentient beings.",
        "source": "T04n0192_005:0044c08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝今欲從我，　所聞所知者，　　於我存亡際，　慎莫生憂悲。",
        "translation": "Now, if you want to follow me, you mustn't become sad and compassionate while I'm alive and gone, based on what you've heard and know.",
        "source": "T04n0192_005:0044c11_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　無常有為性，　躁動變易法，　　不堅非利益，　無有久住相。",
        "translation": "Their impermanent, artificial nature and agitated, changing things are not resolute or beneficial, and they don't have the mark of lasting abiding.",
        "source": "T04n0192_005:0044c13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　古昔諸仙王，　婆私吒仙等，　　曼陀轉輪王，　其比亦眾多。",
        "translation": "In the distant past, there were many sage kings, such as Vasiṣṭha and the Māndāra wheel-turning kings.",
        "source": "T04n0192_005:0044c15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如是諸先勝，　力如自在天，　　悉已久磨滅，　無一存於今。",
        "translation": "Such were their predecessors, and their powers were like those of the Śubhakṛts, all of whom have long since worn out, and none of whom remain today.",
        "source": "T04n0192_005:0044c17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　日月天帝釋，　其數亦甚眾，　　悉皆歸磨滅，　無有長存者。",
        "translation": "The sun, moon, gods, and Indra, which are also numerous, have all been ground into extinction, and none of them have survived long.",
        "source": "T04n0192_005:0044c19_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　過去世諸佛，　數如恒邊沙，　　智慧照世間，　悉皆如燈滅。",
        "translation": "The buddhas of past lives are as numerous as the sands of the constellation, and their wisdom illuminating the world is like a lamp going out.",
        "source": "T04n0192_005:0044c21_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　未來世諸佛，　將滅亦復然，　　我今豈獨異？",
        "translation": "All the buddhas of future generations will cease in the same way, so how could I be different now?",
        "source": "T04n0192_005:0044c23_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當入於涅槃。",
        "translation": "\"They will enter nirvāṇa.",
        "source": "T04n0192_005:0044c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　彼有應度者，　今宜進前行，　　毘舍離快樂，　汝等且自安。",
        "translation": "Those of you who should be liberated should now undertake the task of Vaiśālī's happiness, and you should make yourselves comfortable.",
        "source": "T04n0192_005:0044c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　世間無依怙，　三界不足歡，　　當止憂悲苦，　而生離欲心。」",
        "translation": "The world has no support, and the three realms are not enough to make them happy; you should stop grieving and pitying, and give rise to a mind free of desire.\"",
        "source": "T04n0192_005:0044c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　決斷長別已，　而遊於北方，　　靡靡涉長路，　如日傍西山。",
        "translation": "Having decided to sever the long separation, he travels north, wading through the long roads like the sun near the western mountains.",
        "source": "T04n0192_005:0044c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時諸離車，　　悲吟逐路隨，　仰天而哀歎：　　「嗚呼何怪哉？",
        "translation": "At that point, the chariots leave, lamenting as they follow the road, and they look up to the heavens and lament, \"Whoops! What's so strange about that?",
        "source": "T04n0192_005:0045a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　形如真金山，　　眾相具莊嚴，　不久將崩壞？",
        "translation": "Is it shaped like a true gold mountain, adorned with all its features, that will soon crumble?",
        "source": "T04n0192_005:0045a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　無常何無慈，　生死久虛渴，　　如來智慧母，　而今頓放捨，　　無救苦奈何？",
        "translation": "What is impermanence, what is lack of kindness, the long-standing thirst for birth and death, the Tathāgata's mother of wisdom, and now the sudden release of abandonment, and what is the alternative to suffering without salvation?",
        "source": "T04n0192_005:0045a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾生久闇冥，　　假明慧以行，　如何智慧日，　　忽然而潛光？",
        "translation": "When sentient beings have been in darkness for a long time and make use of insight, how does the sun of wisdom suddenly shine brightly?",
        "source": "T04n0192_005:0045a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無智為迅流，　　漂浪諸眾生，　如何法橋梁，　　一旦忽然摧。",
        "translation": "\"How could a bridge of the Dharma suddenly break down once it's filled with the swift current of no-wisdom that wafts sentient beings?",
        "source": "T04n0192_005:0045a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　慈悲大醫王，　　無上智良藥，　療治眾生苦，　　如何忽遠逝？",
        "translation": "How does the compassionate great king of doctors, the medicine of unsurpassed wisdom, heal the suffering of sentient beings, and suddenly pass away?",
        "source": "T04n0192_005:0045a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　慈悲妙天幢，　　智慧以莊嚴，　金剛心絞絡，　　世間觀無厭，　祠祀嚴勝幢，　　云何一旦崩？",
        "translation": "\"The marvelous celestial banner of compassion, adorned by wisdom, entwined with the adamantine mind, unweakened by mundane observation, the banner of worship and adornment, how does it once crumble?",
        "source": "T04n0192_005:0045a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾生何薄福？",
        "translation": "What is the weak merit of all beings?",
        "source": "T04n0192_005:0045a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　輪迴生死流，　解脫門忽閉，　　長苦無出期。」",
        "translation": "'The cycle of birth and death suddenly closes the door to liberation, and there's no escape from long suffering.'",
        "source": "T04n0192_005:0045a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來善安慰，　　割情而長辭。",
        "translation": "The Tathāgata is well-comforted, cutting off emotion and saying goodbye.",
        "source": "T04n0192_005:0045a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　制心忍悲戀，　　如萎迦尼花，　徘徊而遲遲，　　悵怏隨路行，　如人喪其親，　　葬畢長訣還。",
        "translation": "He restrains his mind from tolerating pity and longing like a withered kani flower, wandering and hesitating, unhappy and traveling along the road, like a person who's lost a relative and returned after a long funeral.",
        "source": "T04n0192_005:0045a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛所行讚涅槃品第二十五",
        "translation": "Buddhacarita Nirvāṇa Chapter 25",
        "source": "T04n0192_005:0045a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛至涅槃處，　　鞞舍離空虛，　猶如夜雲冥，　　星月失光明。",
        "translation": "When the Buddha reaches nirvāṇa, Vaiśālī leaves space like a cloud in the night, and the stars and moon lose their light.",
        "source": "T04n0192_005:0045a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　國土先安樂，　　而今頓凋悴，　猶如喪慈父，　　孤女常獨悲。",
        "translation": "The land was once peaceful and comfortable, but now it's suddenly withered, like a loving father who's lost, and an orphan girl who's always alone in pity.",
        "source": "T04n0192_005:0045a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如端正無聞，　　聰明而薄德，　心辯而口吃，　　明慧而乏才。",
        "translation": "She's like a perfectly correct person with no learning, intelligent but weak in virtue, eloquent but stammering, and bright and wise but lacking talent.",
        "source": "T04n0192_005:0045a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　神通無威儀，　　慈悲心虛偽，　高勝而無力，　　威儀而無法。",
        "translation": "Their psychic powers are lacking in dignity, their compassionate hearts are false, they're superior but powerless, and their manner is impotent.",
        "source": "T04n0192_005:0045b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　鞞舍離亦然，　　素榮而今悴，　猶如秋田苗，　　失水悉枯萎。",
        "translation": "Vaiśālī is likewise, plainly glorious but now emaciated, like a sapling in an autumn field that withers when it lacks water.",
        "source": "T04n0192_005:0045b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或斷火滅烟，　　或對食忘飡，　悉廢公私業，　　不修諸俗緣。",
        "translation": "Sometimes they cut off fire and put out smoke, or they forget about food, completely abandon public and private activities, and don't cultivate worldly concerns.",
        "source": "T04n0192_005:0045b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　念佛感恩深，　　默默各不言。",
        "translation": "Mindful of the Buddha's profundity and gratefulness, they each remained silent.",
        "source": "T04n0192_005:0045b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時師子離車，　　強忍其憂悲，　垂泣發哀聲，　　以表眷戀心：「破壞諸邪徑，　　顯示於正法，　已降諸外道，　　遂往不復還。",
        "translation": "When the lion leaves his chariot, he forcibly tolerates his grief and sobs and makes a sad noise, expressing his longing for the Buddha, \"Destroy wrong paths, reveal the right teaching, subdue non-Buddhists, and leave without ever returning.",
        "source": "T04n0192_005:0045b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世絕離世道，　　無常為大病，　世尊入大寂，　　無依無有救。",
        "translation": "The world is cut off from the worldly path, impermanence is a great disease, the Bhagavān has entered into great extinction, and there's no support or help.",
        "source": "T04n0192_005:0045b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　方便最勝尊，　　潛光究竟處，　我等失強志，　　如火絕其薪。",
        "translation": "The most honored one in terms of skillful means, his latent light reaches its final destination, and we lose our strong resolve like fire cutting off its fuel.",
        "source": "T04n0192_005:0045b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世尊捨世蔭，　　群生甚可悲，　如人失神力，　　舉世共哀之。",
        "translation": "The Bhagavān has abandoned the shadow of the world, and it's very sad for all sentient beings, like a person who has lost his spiritual powers and is lamented by the world.",
        "source": "T04n0192_005:0045b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　逃暑投涼池，　　遭寒以憑火，　一旦悉廓然，　　群生何所歸？",
        "translation": "Fleeing the heat and throwing themselves into a cool pool, or being caught in the cold and relying on the fire, once they're all gone, where do all the living beings go?",
        "source": "T04n0192_005:0045b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　通達殊勝法，　　為世陶鑄師，　世間失宰正，　　人喪道則亡，　老病死自在，　　道喪非道通。",
        "translation": "They understand the extraordinary Dharma and serve as the world's potter. The world loses its ruler, the person loses the path, and then they die.",
        "source": "T04n0192_005:0045b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　能壞大苦機，　　世間何有雙？",
        "translation": "What's the one thing in the world that destroys the capacity for great suffering?",
        "source": "T04n0192_005:0045b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猛熱極焰盛，　　大雲雨令消，　貪欲火熾然，　　其誰能令滅？",
        "translation": "The fierce heat is so intense that a great cloud of rain causes it to subside, and the fire of desire is so blazing, who is it that can cause it to go out?",
        "source": "T04n0192_005:0045b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　堅固能擔者，　　已捨世重任，　復何智慧力，　　能為不請友。",
        "translation": "\"Suppose someone who's sturdy and capable of bearing the burden of the world's heavy burdens is abandoned, then what power of wisdom can they have that's unrequested as a friend?",
        "source": "T04n0192_005:0045b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如彼臨刑囚，　　為死而醉酒，　眾生迷惑識，　　惟為死受生，　利鋸以解材，　　無常解世間。",
        "translation": "Like a prisoner facing torture who gets drunk with alcohol for the sake of death, sentient beings are deluded in their consciousnesses and only take birth for the sake of death, and they use the sharp saw to unlock material that's impermanent to the world.",
        "source": "T04n0192_005:0045b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　癡闇為深水，　　愛欲為巨浪，　煩惱為浮沫，　　邪見摩竭魚，　唯有智慧船，　　能度斯大海。",
        "translation": "With delusion as deep water, desire as huge waves, affliction as foam, and wrong views as makara fish, only the ship of wisdom can cross this ocean.",
        "source": "T04n0192_005:0045c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾病為樹花，　　衰老為纖條，　死為樹深根，　　有業為其芽，　智慧剛利刀，　　能斷三有樹。",
        "translation": "While illness is a tree's flower, old age is its slender blade, death is a tree's deep root, and karma is its bud, wisdom's rigid and sharp sword can cut through the three trees of existence.",
        "source": "T04n0192_005:0045c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無明為鑽燧，　　貪欲為熾焰，　五欲境界薪，　　滅之以智水，　具足殊勝法，　　已壞於癡冥。",
        "translation": "Nescience is a blazing flame, desire is a blazing flame, the firewood of the five desire realms is extinguished with the water of wisdom, and the surpassing qualities are present, which destroy delusion and ignorance.",
        "source": "T04n0192_005:0045c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見安隱正路，　　究竟諸煩惱，　慈悲化眾生，　　怨親無異相，　一切智通達，　　而今悉棄捨。",
        "translation": "Seeing the peaceful and right path, he terminates the afflictions, compassionately transforms sentient beings, makes enemies and relatives non-different, and comprehends all knowledge, which he now discards.",
        "source": "T04n0192_005:0045c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　軟美清淨音，　　方身纖長臂，　大仙而有邊，　　何人得無窮？",
        "translation": "With a soft, beautiful, and pure voice, a square body with long, slender arms, and a great sage with measure, how could anyone attain infinity?",
        "source": "T04n0192_005:0045c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當覺時遷速，　　應勤求正法，　如嶮道遇水，　　時飲速進路。",
        "translation": "They should realize that time moves quickly, and they should diligently pursue the right teaching, like a dangerous path that meets water, and they quickly advance when they drink.",
        "source": "T04n0192_005:0045c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　非常甚暴逆，　　普壞無貴賤，　正觀存於心，　　雖眠亦常覺。」",
        "translation": "Very unruly and contrary, it completely destroys neither noble nor base, and right contemplation remains in the mind, even though it's always awake when it's asleep.\"",
        "source": "T04n0192_005:0045c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時離車師子，　　常念佛智慧，　厭離於生死，　　歎慕人師子。",
        "translation": "The charioteer always remembers the Buddha's wisdom, becomes disillusioned with birth and death, and admires the teacher of men.",
        "source": "T04n0192_005:0045c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不存世恩愛，　　深崇離欲德，　折伏輕躁意，　　栖心寂靜處。",
        "translation": "He doesn't harbor worldly kindnesses, deeply venerates the virtue of freedom from desire, subdues impetuous thoughts, and abides in the stillness of his mind.",
        "source": "T04n0192_005:0045c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　勤修行惠施，　　遠離於憍慢，　樂獨脩閑居，　　思惟真實法。",
        "translation": "Diligently cultivating generosity, he parts with pride, enjoys quiet living in solitude, and contemplates the true teaching.",
        "source": "T04n0192_005:0045c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時一切智，　　圓身師子顧，　瞻彼鞞舍離，　　而說長辭偈：「是吾之最後，　　遊此鞞舍離，　往力士生地，　　當入於涅槃。」",
        "translation": "At that point, the perfect-bodied lion of omniscience looked up at Vaiśālī and spoke a long verse, \"This is the last of us to wander around here, Vaiśālī, going to the birthplace of Rāṣṭrapāla and then entering nirvāṇa.\"",
        "source": "T04n0192_005:0045c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　漸次第遊行，　　至彼蒲加城，　安住堅固林，　　教誡諸比丘：「吾今以中夜，　　當入於涅槃，　汝等當依法，　　是則尊勝處。",
        "translation": "He gradually marched one by one to that city of Potala, settled in the Jetavana Grove, and instructed the monks, \"Now, in the middle of the night, I will enter nirvāṇa, and you must follow the rules, for this is a place of honor.",
        "source": "T04n0192_005:0046a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不入脩多羅，　　亦不慎律儀，　真實義相違，　　則不應攝受。",
        "translation": "Those who don't enter sūtra and aren't careful about discipline, and those whose true and real meanings are contradicted, shouldn't be admitted.",
        "source": "T04n0192_005:0046a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　非法亦非律，　　又非我所說，　是則為闇說，　　汝等應速捨。",
        "translation": "What's not true is not legal, and what's not explained by me is not explained by me, which is dark, so you should quickly abandon it.",
        "source": "T04n0192_005:0046a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　執受於明說，　　是則非顛倒，　是則我所說，　　如法如律教。",
        "translation": "To hold to what's explained in the light is not mistaken, and it's what I teach, according to the teaching of the Dharma and the Vinaya.",
        "source": "T04n0192_005:0046a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如我法律受，　　是則為可信，　言我法律非，　　是則不可信。",
        "translation": "Accepting my teaching as it is, it's believable; saying my teaching is not true is not believable.",
        "source": "T04n0192_005:0046a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不解微細義，　　謬隨於文字，　是則為愚夫，　　非法而妄說。",
        "translation": "Someone who doesn't understand the subtle meaning and mistakenly follows words is a foolish man who speaks unlawfully and deludedly.",
        "source": "T04n0192_005:0046a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不別其真偽，　　無見而闇受，　猶鍮金共肆，　　誑惑於世間。",
        "translation": "They don't discern their true from their false, and they are blinded by their lack of vision, like gold in common with gold, which deceives the world.",
        "source": "T04n0192_005:0046a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愚夫習淺智，　　不解真實義，　受於相似法，　　而作真法受。",
        "translation": "A foolish man with shallow accumulated knowledge doesn't understand the true meaning, and he experiences similar things and makes them experience the true teaching.",
        "source": "T04n0192_005:0046a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故當審諦，　　觀察真法律，　猶如鍊金師，　　燒打而取真。",
        "translation": "Therefore, they must examine the truth and scrutinize the true teaching like a gold smith who burns and beats it to get the truth.",
        "source": "T04n0192_005:0046a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不知諸經論，　　是則非黠慧，　不應說所應，　　應作不應見。",
        "translation": "Not knowing the sūtras and śāstras, which are not wise, they shouldn't say what should be, and they should make views that shouldn't be made.",
        "source": "T04n0192_005:0046a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當作平等受，　　句義如說行，　執劍無方便，　　則反傷其手。",
        "translation": "He should accept them equally, speaking their meaning as it's practiced, and wielding a sword without skillful means would hurt his hand.",
        "source": "T04n0192_005:0046a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　辭句不巧便，　　其義難了知，　如夜行求室，　　宅曠莫知處。",
        "translation": "The words aren't skillful and convenient, and their meaning is difficult to understand, like walking through a room at night and finding yourself in a house that's too far away to know where to go.",
        "source": "T04n0192_005:0046a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　失義則忘法，　　忘法心馳亂，　是故智慧士，　　不違真實義。」",
        "translation": "When they lose the meaning, they forget the teaching, and when they forget the teaching, their minds are distracted; therefore, a wise person doesn't contradict the true and real meaning.\"",
        "source": "T04n0192_005:0046a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　說斯教誡已，　　至於波婆城，　彼諸力士眾，　　設種種供養。",
        "translation": "After teaching this admonition, he went to the city of Bārāva, where a multitude of warriors made various offerings.",
        "source": "T04n0192_005:0046b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時有長者子，　　其名曰純陀，　請佛至其舍，　　供設最後飯。",
        "translation": "An elder son named Cunda then invited the Buddha to his abode and offered him the last meal.",
        "source": "T04n0192_005:0046b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　飯食說法畢，　　行詣鳩夷城，　度於蕨蕨河，　　及熙連二河。",
        "translation": "After he had finished his meal and explanation of the Dharma, he traveled to the city of Kumbhâṇḍa and crossed the Fern and Hiraṇyavatī rivers.",
        "source": "T04n0192_005:0046b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼有堅固林，　　安隱閑靜處，　入金河洗浴，　　身若真金山。",
        "translation": "There's a solid forest there, a peaceful and quiet place, and he enters the Gold River to bathe, and his body looks like a true gold mountain.",
        "source": "T04n0192_005:0046b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　告勅阿難陀：　　「於彼雙樹間，　掃灑令清淨，　　安置於繩床。",
        "translation": "I told Ānanda, \"Stand between those two trees, sweep them clean, and place them on a rope-bottomed bed.",
        "source": "T04n0192_005:0046b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　吾今中夜時，　　當入於涅槃。」",
        "translation": "Now, at midnight, I will enter nirvāṇa.\"",
        "source": "T04n0192_005:0046b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　阿難聞佛教，　　氣塞而心悲，　行泣而奉教，　　布置訖還白。",
        "translation": "When Ānanda heard the Buddha's teaching, his breath was stuffed and his heart was compassionate, he sobbed and gave his instructions, and he returned to the room after arranging it.",
        "source": "T04n0192_005:0046b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來就繩床，　　北首右脇臥，　枕手累雙足，　　猶如師子王，　畢苦後邊身，　　一臥永不起。",
        "translation": "The Tathāgata took his rope-bottomed bed, lay down on his right side with his head to the north, put his hands on his head and feet on his back, just like a lion king who never rises from his bed after suffering his final body.",
        "source": "T04n0192_005:0046b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　弟子眾圍遶，　　哀歎世眼滅，　風止林流靜，　　鳥獸寂無聲。",
        "translation": "Surrounded by disciples who lament the cessation of the world's eyes, the wind stops blowing and the forest flows quietly, while the birds and animals are still and silent.",
        "source": "T04n0192_005:0046b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　樹木汁淚流，　　華葉非時零，　未離欲人天，　　悉皆大惶怖。",
        "translation": "Tears flow from the sap of the trees, and flowers and leaves are scattered at random, causing great fear in all those who have yet to part with their desires, both humans and gods.",
        "source": "T04n0192_005:0046b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如人遊曠澤，　　道險未至村，　但恐行不至，　　心懼形怱怱。",
        "translation": "Like a person wandering through a vast swamp, whose path is dangerous before reaching the village, they're afraid they won't reach it, and their minds are hurried with fear.",
        "source": "T04n0192_005:0046b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來畢竟臥，　　而告阿難陀：「往告諸力士，　　我涅槃時至。",
        "translation": "After he's finished lying down, the Tathāgata tells Ānanda, \"Go ahead and tell the soldiers, 'It'll be long before I reach nirvāṇa.",
        "source": "T04n0192_005:0046b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼若不見我，　　永恨生大苦。」",
        "translation": "If they don't see me, their eternal hatred will be great suffering.\"",
        "source": "T04n0192_005:0046b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　阿難受佛教，　　悲泣而隨路，　告彼諸力士：　　「世尊已畢竟。」",
        "translation": "Accepting the Buddha's teaching, Ānanda wept and followed the road, telling the warriors, \"The Bhagavān has finished.\"",
        "source": "T04n0192_005:0046b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸力士聞之，　　極生大恐怖，　士女奔馳出，　　號泣至佛所，　弊衣而散髮，　　蒙塵身流汗，　號慟詣彼林，　　猶如天福盡，　垂淚禮佛足，　　憂悲身萎熟。",
        "translation": "When the soldiers heard that, they became extremely frightened, and their women rushed out, wailing and weeping as they reached the Buddha, wearing poor clothing and spreading their hair, covered in dust and sweating, wailing and going to the forest, they were like gods whose fortune had ended, bowing their heads at the Buddha's feet in tears, and withering with grief.",
        "source": "T04n0192_005:0046b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來安慰說：　　「汝等勿憂悴，　今應隨喜時，　　不宜生憂慼。",
        "translation": "The Tathāgata comforts them, saying, \"Don't be sad and weary; now is the time to rejoice; it's not appropriate to be sad.",
        "source": "T04n0192_005:0046c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　長劫之所規，　　我今始獲得，　已度根境界，　　無盡清涼處。",
        "translation": "Now I've just attained what was regulated in long eons, and I've already crossed the realm of the faculties, which is an inexhaustibly cool place.",
        "source": "T04n0192_005:0046c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　離地水火風，　　寂靜不生滅，　永除於憂患，　　云何為我憂？",
        "translation": "Free of earth, water, fire, and wind, they are tranquil and don't arise or cease, and they are forever free of grief; why are they grieving for me?",
        "source": "T04n0192_005:0046c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我昔伽闍山，　　欲捨於此身，　以本因緣故，　　存世至於今。",
        "translation": "On Mount Gajah, I wanted to abandon this body, but because of the original causes and conditions, I've survived in the world until now.",
        "source": "T04n0192_005:0046c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　守斯危脆身，　　如毒蛇同居，　今入於大寂，　　眾苦緣已畢。",
        "translation": "I guarded this fragile body like a viper living with me, and now I've entered into great quiescence, having ended the causes of suffering.",
        "source": "T04n0192_005:0046c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不復更受身，　　未來苦長息，　汝等不復應，　　為我生恐怖。」",
        "translation": "No longer will I be subject to this body, and in the future suffering will continue, so you should no longer become frightened for me.\"",
        "source": "T04n0192_005:0046c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　力士聞佛說，　　入於大寂靜，　心亂而目冥，　　如覩大黑闇。",
        "translation": "When the powerful man heard what the Buddha taught, he entered into great quiescence, his mind was distracted, and his eyes were darkened as if he were looking into great darkness.",
        "source": "T04n0192_005:0046c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　合掌白佛言：　　「佛離生死苦，　永之寂滅樂，　　我等實欣慶。",
        "translation": "He put his palms together and said to the Buddha, \"We're truly delighted that the Buddha is free of the suffering of birth and death and has the joy of permanent cessation.",
        "source": "T04n0192_005:0046c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶如被燒舍，　　親從盛火出，　諸天猶歡喜，　　何況於世人？",
        "translation": "It's like being burnt to death and personally emerging from a raging fire, but the gods rejoice, so why wouldn't the rest of the world?",
        "source": "T04n0192_005:0046c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來既滅後，　　群生無所覩，　永違於救護，　　是故生憂悲。",
        "translation": "After the Tathāgata's disappearance, there's nothing to see in all sentient beings, and they are permanently denied aid; therefore, they become sad and compassionate.",
        "source": "T04n0192_005:0046c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如商人眾，　　遠涉於曠野，　唯有一導師，　　忽然中道亡，　大眾無所怙，　　云何不憂悲？",
        "translation": "Like a multitude of merchants wandering far into the wilderness with only one guide who suddenly dies in the middle of the road, the multitude has no refuge, so why isn't there sadness and compassion?",
        "source": "T04n0192_005:0046c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　現世自證知，　　覩一切知見，　而不獲勝利，　　舉世所應笑。",
        "translation": "In the present life, he personally discerns and sees all knowables, but he doesn't attain any surpassing benefit that would make the world laugh.",
        "source": "T04n0192_005:0046c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如經寶山，　　愚癡守貧苦。」",
        "translation": "It's like going through a mountain of treasures while foolishly abiding in poverty.\"",
        "source": "T04n0192_005:0046c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是諸力士，　　向佛而悲訴，　猶如人一子，　　悲訴於慈父。",
        "translation": "Thus, these strong men complained compassionately to the Buddha, just as a human son complains compassionately to his loving father.",
        "source": "T04n0192_005:0047a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛以善誘辭，　　顯示第一義，　告諸力士眾：　　「誠如汝所言，　求道須精勤；　　非但見我得。",
        "translation": "With well-meant words, the Buddha revealed the ultimate truth and told the crowd of strong men, \"It's true what you say, that seeking the path requires diligence; it's not just seeing me that gets you there.",
        "source": "T04n0192_005:0047a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如我所說行，　　得離眾苦網。",
        "translation": "Doing as I've taught you, you'll be freed from the web of suffering.",
        "source": "T04n0192_005:0047a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　行道存於心，　　不必由見我。",
        "translation": "The path of practice is stored in the mind, not in views of self.",
        "source": "T04n0192_005:0047a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶如疾病人，　　依方服良藥，　眾病自然除，　　不待見醫師。",
        "translation": "They're like a sick person who takes good medicine according to a prescription and is naturally freed from numerous illnesses without waiting to see a physician.",
        "source": "T04n0192_005:0047a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不如我說行，　　空見我無益。",
        "translation": "Not like me who teaches about practice, it's useless to see me in vain.",
        "source": "T04n0192_005:0047a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖與我相遠，　　行法為近我；　同止不隨法，　　當知去我遠。",
        "translation": "Although they're distant from me, they practice the Dharma to draw near to me; if they stop together and don't follow the Dharma, they should know that they're far from me.",
        "source": "T04n0192_005:0047a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　攝心莫放逸，　　精勤修正業。",
        "translation": "Regulating his mind, he mustn't be careless, and he must diligently cultivate his actions.",
        "source": "T04n0192_005:0047a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人生於世間，　　長夜眾苦迫，　擾動不自安，　　猶若風中燈。」",
        "translation": "Here in the world, human beings are subject to long nights of suffering, disturbed and unsettled, just like a lamp in the wind.\"",
        "source": "T04n0192_005:0047a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時諸力士眾，　　聞佛慈悲教，　內感而收淚，　　強自抑止歸。",
        "translation": "The multitude of warriors who heard the Buddha's compassionate teaching were overcome with emotion and tears, and they forcibly restrained themselves and returned.",
        "source": "T04n0192_005:0047a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛所行讚大般涅槃品第二十六",
        "translation": "Buddhacarita, Chapter Twenty-six of the Nirvana Sutra",
        "source": "T04n0192_005:0047a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時有梵志，　　名須跋陀羅，　賢德悉備足，　　淨戒護眾生。",
        "translation": "It was then that a priest named Subhadra, fully endowed with good qualities, upheld sentient beings in his pure morality.",
        "source": "T04n0192_005:0047a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　少稟於邪見，　　修外道出家，　欲來見世尊，　　告語阿難陀：「我聞如來道，　　厥義深難測，　世間無上覺，　　第一調御師。",
        "translation": "A youthful initiation into mistaken views and a renunciant practitioner, he wanted to come to the Bhagavān and told Ānanda, \"I've heard that the Tathāgata's path is profound and unfathomable, that it's the unsurpassed awakening in the world, and that it's the supreme teacher of discipline.",
        "source": "T04n0192_005:0047a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今欲般涅槃，　　難復可再遇，　難見見者難，　　猶如鏡中月。",
        "translation": "Now, I want to attain parinirvāṇa, but it's hard to meet again, and it's hard to see someone who's hard to see, like the moon in a mirror.",
        "source": "T04n0192_005:0047a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今欲奉見，　　無上善導師，　為求免眾苦，　　度生死彼岸。",
        "translation": "Now, I want to meet the unsurpassed, excellent teacher who seeks to escape all suffering and cross the other shore of birth-and-death.",
        "source": "T04n0192_005:0047a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛日欲潛光，　　願令我暫見。」",
        "translation": "The Buddha wants to shine brightly in the sun, so please let me see him for a while.\"",
        "source": "T04n0192_005:0047a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　阿難情悲感，　　兼謂為譏論，　或欣世尊滅，　　不宜令佛見。",
        "translation": "Ānanda's feelings were compassionate, and he also said that he was criticizing the Bhagavān for saying that he was glad the Bhagavān had ceased and that it was inappropriate to allow the Buddha to see him.",
        "source": "T04n0192_005:0047b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛知彼希望，　　堪為正法器，　而告阿難言：　　「聽彼外道前，　我為度人生，　　汝勿作留難。」",
        "translation": "Knowing his wish, the Buddha became a vessel of the true Dharma and told Ānanda, \"Listen to that non-Buddhist, I'm here to save lives, so don't make this difficult for yourself.\"",
        "source": "T04n0192_005:0047b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　須跋陀羅聞，　　心生大歡喜，　樂法情轉深，　　加敬至佛前。",
        "translation": "When Subhadra heard this, his heart became very joyous, his feelings for the Dharma became deep, and he paid respect to the Buddha.",
        "source": "T04n0192_005:0047b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應時隨順言，　　軟語而問訊，　和顏合掌請：　　「今欲有所問。",
        "translation": "He spoke softly and inquired after him, bowing his palms in harmony and inviting him, \"Now, I want to ask a question.",
        "source": "T04n0192_005:0047b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世有知法者，　　如我比甚眾，　唯聞佛所得，　　解脫異要道。",
        "translation": "There are many people in the world who know the teaching like me, and they've only heard what the Buddha has learned, which is the different essentials of liberation.",
        "source": "T04n0192_005:0047b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　願為我略說，　　沾潤虛渴懷，　不為論議故，　　亦無勝負心。」",
        "translation": "Please explain it briefly for me, so that it will wet my vacant thirst, not for the sake of argument, and without superiority or inferiority.\"",
        "source": "T04n0192_005:0047b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛為彼梵志，　　略說八正道，　聞即虛心受，　　猶迷得正路。",
        "translation": "The Buddha briefly explained the eightfold correct path for that priest, and upon hearing it, he accepted it with an open heart, just as if he were deluded and had attained the right path.",
        "source": "T04n0192_005:0047b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　覺知先所學，　　非為究竟道，　即得未曾聞，　　捨離於邪徑。",
        "translation": "Realizing that what they had previously trained was not the ultimate path, they then attained what they had never heard before and abandoned the wrong path.",
        "source": "T04n0192_005:0047b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　兼背癡闇障，　　思惟先所習，　瞋恚癡冥俱，　　長養不善業。",
        "translation": "He also carries the hindrance of delusion, contemplates what was previously practiced, and nurtures unwholesome actions with anger, ill-will, and delusion.",
        "source": "T04n0192_005:0047b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愛恚癡等行，　　能起諸善業，　多聞慧精進，　　亦由有愛生。",
        "translation": "Actions like craving, ill-will, and delusion can produce good actions, and the diligence of well-versed wisdom also arises from having cravings.",
        "source": "T04n0192_005:0047b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　恚癡若斷者，　　則離於諸業，　諸業既已除，　　是名業解脫。",
        "translation": "If anger and delusion are stopped, then they'll be free of actions, and once actions are removed, this is called the liberation of actions.",
        "source": "T04n0192_005:0047b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸業解脫者，　　不與義相應，　世間說一切，　　悉皆有自性。",
        "translation": "Those who are liberated from actions that aren't concomitant with meaning are all described in the world as having an own-nature.",
        "source": "T04n0192_005:0047b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有愛瞋恚癡，　　而有自性者，　此則應常存，　　云何而解脫？",
        "translation": "If there's craving, anger, ill-will, and delusion, but they have an own-nature, then they should always exist, so how are they liberated?",
        "source": "T04n0192_005:0047b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　正使恚癡滅，　　有愛還復生，　如水自性冷，　　緣火故成熱，　熱息歸於冷，　　以自性常故。",
        "translation": "Just when anger and delusion cease, craving arises again, like water that's cold in its own nature and becomes hot because of fire, hot breath returns to cold because its own nature is constant.",
        "source": "T04n0192_005:0047b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當知有愛性，　　聞慧進不增，　不增亦不減，　　云何是解脫？",
        "translation": "You should know that the nature of craving exists, and hearing, advancing, and not increasing, neither increasing nor decreasing, how is it liberation?",
        "source": "T04n0192_005:0047c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　先謂彼生死，　　本從性中生，　今觀於彼義，　　無得解脫者。",
        "translation": "First, it's said that birth and death originally arise from their natures, and now when we look at their meanings, there's no one who attains liberation.",
        "source": "T04n0192_005:0047c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　性者則常住，　　云何有究竟？",
        "translation": "How can there be an ultimate when the nature is eternally abiding?",
        "source": "T04n0192_005:0047c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如燃明燈，　　何能令無光？",
        "translation": "It's like a bright lamp, how can it be without light?",
        "source": "T04n0192_005:0047c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛道真實義，　　緣愛生世間，　愛滅則寂靜，　　因滅故果亡。",
        "translation": "\"The true meaning of the Buddha Way is that conditioned by craving, the world arises, and when craving ceases, tranquility prevails, and the cause ceases, so the effect disappears.",
        "source": "T04n0192_005:0047c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　本謂我異身，　　不見無作者，　今聞佛正教，　　世間無有我。",
        "translation": "Originally, it was thought that I was a different body that wasn't seen as having no author, but now I've heard the Buddha's correct teaching that the world has no self.",
        "source": "T04n0192_005:0047c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸法因緣生，　　無有自在故，　因緣生故苦，　　因緣滅亦然。",
        "translation": "All things that arise from causes and conditions have no freedom; it's because causes and conditions arise that they're painful, and it's because of causes and conditions that they cease that they do so.",
        "source": "T04n0192_005:0047c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　觀世因緣生，　　則滅於斷見，　緣離世間滅，　　則離於常見；　悉捨本所見，　　深見佛正法。",
        "translation": "When they contemplate that worldly causes and conditions arise, they cease to have nihilistic views, and when they part with worldly conditions and cease, they part with common sense; they all abandon their original views and deeply see the Buddha's true teaching.",
        "source": "T04n0192_005:0047c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　宿命種善因，　　聞法能即悟，　已得善寂滅，　　清涼無盡處。",
        "translation": "Having planted good causes in their past lives, they immediately awaken upon hearing the teaching, and having attained good extinction, their coolness knows no limit.",
        "source": "T04n0192_005:0047c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　心開信增廣，　　仰瞻如來臥，　不忍觀如來，　　捨世般涅槃，　及佛未究竟，　　我當先滅度。",
        "translation": "Opening his mind and increasing his faith, he looks up at the Tathāgata reclining, can't bear to watch the Tathāgata abandon the world and [enter] parinirvāṇa, and will first extinguish the Buddha before he reaches the end.",
        "source": "T04n0192_005:0047c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　合掌禮聖顏，　　一面正基坐，　捨壽入涅槃，　　如雨滅小火。",
        "translation": "He joins his palms in saluting the face of the sage, sits correctly on one side, and enters nirvāṇa with his life abandoned like rain putting out a small fire.",
        "source": "T04n0192_005:0047c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛告諸比丘：　　「我最後弟子，　而今已涅槃，　　汝等當供養。」",
        "translation": "The Buddha addressed the monks, \"Now that my last disciple has gone into nirvāṇa, you must make offerings.\"",
        "source": "T04n0192_005:0047c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛以初夜過，　　月明眾星朗，　閑林靜無聲，　　而興大悲心，　遺誡諸弟子：　　「吾般涅槃後，　汝等當恭敬，　　波羅提木叉，　即是汝大師，　　巨夜之明燈，　貧人之大寶。",
        "translation": "After the first night, when the moon was shining and the stars were shining brightly, and the forest was quiet, the Buddha aroused great compassion and instructed his disciples, \"After my nirvāṇa, you must revere that prātimokṣa, your great teacher, a bright lamp in the great night, and a great treasure for the poor.",
        "source": "T04n0192_005:0047c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　當所教誡者，　汝等當隨順，　　如事我無異。",
        "translation": "You must obey whatever is to be instructed, serving me as I do without distinction.",
        "source": "T04n0192_005:0048a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當淨身口行，　　離諸治生業，　田宅畜眾生，　　積財及五穀，　一切當遠離，　　如避大火坑。",
        "translation": "You must purify your physical and verbal conduct, part with the activities that govern birth, farm and house, stock up on property and grains, and avoid them all as you would a great fire pit.",
        "source": "T04n0192_005:0048a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　墾土截草木，　　醫療治諸病，　仰觀於曆數，　　步推吉凶象，　占相於利害，　　此悉不應為。",
        "translation": "They plow up land, cut up grass and trees, treat illnesses medically, look up at calendars, project auspicious and inauspicious signs, and divine fortune and injury, all of which should not be done.",
        "source": "T04n0192_005:0048a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　節身隨時食，　　不受使行術，　不合和湯藥，　　遠離諸諂曲。",
        "translation": "He restrains himself from eating at appropriate times, doesn't accept the practice of messengers, doesn't mix hot water and medicine, and stays away from flattery.",
        "source": "T04n0192_005:0048a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　順法資生具，　　應當知量受，　受則不積聚，　　是則略說戒。",
        "translation": "He should know the necessities of life according to the Dharma and accept them in moderation; when he accepts them, they don't accumulate, and he then briefly explains the precepts.",
        "source": "T04n0192_005:0048a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為眾戒之根，　　亦為解脫本，　依此法能生，　　一切諸正受。",
        "translation": "They are the root of the many precepts and the basis of liberation, and based on this teaching, they can produce all the right feelings.",
        "source": "T04n0192_005:0048a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切真實智，　　緣斯得究竟，　是故當執持，　　勿令其斷壞。",
        "translation": "Because this is the condition for the full attainment of all true knowledge, it should be upheld and not allowed to break down.",
        "source": "T04n0192_005:0048a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　淨戒不斷故，　　則有諸善法，　無則無諸善，　　以戒建立故。",
        "translation": "Because the pure precepts are not maintained, then there are good qualities, whereas without them there are no good qualities because they are established by the precepts.",
        "source": "T04n0192_005:0048a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　已住清淨戒，　　善攝諸情根，　猶如善牧牛，　　不令其縱暴。",
        "translation": "Those who have abided in the pure precepts and well-contained the sense faculties are like well-groomed cattle that aren't allowed to get carried away.",
        "source": "T04n0192_005:0048a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不攝諸根馬，　　縱逸於六境，　現世致殃禍，　　將墜於惡道。",
        "translation": "A horse that doesn't tame its faculties and strays into the six objects will bring misfortune in the present life and fall into a bad destiny.",
        "source": "T04n0192_005:0048a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如不調馬，　　令人墮坑陷，　是故明智者，　　不應縱諸根。",
        "translation": "Like a horse that's not disciplined, it falls into a pit; therefore, a wise person shouldn't let their faculties get carried away.",
        "source": "T04n0192_005:0048a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸根甚凶惡，　　為人之重怨，　眾生愛諸根，　　還為彼傷害。",
        "translation": "Those faculties are so vicious that they become a great enemy to people, and sentient beings who love those faculties return to be harmed by them.",
        "source": "T04n0192_005:0048a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　深怨盛毒蛇，　　暴虎及猛火，　世間之甚惡，　　慧者所不畏。",
        "translation": "Deep enemies abound as vipers, violent tigers, and fierce fires, and the world's worst evils are not feared by a wise person.",
        "source": "T04n0192_005:0048a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　唯畏輕躁心，　　將人入惡道，　以彼樂小恬，　　不觀深險故。",
        "translation": "He fears only a rash mind that leads people into a bad path because they enjoy small pleasures and don't contemplate deep perils.",
        "source": "T04n0192_005:0048b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　狂象失利鈎，　　猨猴得樹林，　輕躁心如是，　　慧者當攝持。",
        "translation": "A wild elephant loses its sharp hook, while a monkey gets hold of a tree, so is the impatient mind, which the wise man should manage.",
        "source": "T04n0192_005:0048b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　放心令自在，　　終不得寂滅，　是故當制心，　　速之安靜處。",
        "translation": "Even if he allows himself to be at ease, he'll never attain cessation; therefore, he should restrain his mind and quickly go to a place of tranquility.",
        "source": "T04n0192_005:0048b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　飯食知節量，　　當如服藥法，　勿因於飯食，　　而生貪恚心。",
        "translation": "He should eat and drink in moderation and follow the rules for taking medicine, so that craving and ill-will don't arise from eating and drinking.",
        "source": "T04n0192_005:0048b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　飲食止飢渴，　　如膏朽敗車，　譬如蜂採花，　　不壞其色香，　比丘行乞食，　　勿傷彼信心。",
        "translation": "A meal that stops hunger and thirst is like ointment on a rotten cart, like a bee picking a flower that doesn't spoil its color and fragrance.",
        "source": "T04n0192_005:0048b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人開心施，　　當推彼所堪，　不籌量牛力，　　重載令其傷。",
        "translation": "If someone is happy to give, he must push what they can handle, not measuring the strength of an ox or causing them to be injured by a heavy load.",
        "source": "T04n0192_005:0048b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　朝中晡三時，　　次第修正業，　初後二夜分，　　亦莫著睡眠，　中夜端心臥，　　係念在明相。",
        "translation": "In the morning, midday, and afternoon, he cultivates his actions in order; at the beginning and end of the night, he doesn't get attached to sleep; at midnight, he lies down with an attitude of mindfulness of the mark of insight.",
        "source": "T04n0192_005:0048b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　勿終夜睡眠，　　令身命空過，　時火常燒身，　　云何長睡眠？",
        "translation": "Don't spend your whole night asleep, so your body's life will be in vain and your body will be burned by the fires of time; how will you stay asleep?",
        "source": "T04n0192_005:0048b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　煩惱眾怨家，　　乘虛而隨害，　心惛於睡寐，　　死至孰能覺？",
        "translation": "The many enemies of affliction take advantage of the void and follow it, and the mind is so confused by drowsiness that who can realize the end of death?",
        "source": "T04n0192_005:0048b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　毒蛇藏於宅，　　善呪能令出，　黑虺居其心，　　明覺善呪除，　無術而長眠，　　是則無慚人。",
        "translation": "A poisonous snake is hidden in his house, but a good spell can cause it to escape; a black viper lives in his mind, but a good spell removes it with insight and long sleep without skill, so he's a person without conscience.",
        "source": "T04n0192_005:0048b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　慚愧為嚴服，　　慚為制象鈎，　慚愧令心定，　　無慚喪善根，　慚愧世稱賢，　　無慚禽獸倫。",
        "translation": "He wears an ornate robe of conscience, controls elephant hooks with conscience, keeps his mind calm with conscience, doesn't lose his good roots with conscience, is known in the world as a good man, and doesn't feel ashamed of the family of animals.",
        "source": "T04n0192_005:0048b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人以利刀，　　節節解其身，　不應懷恚恨，　　口不加惡言，　惡念而惡言，　　自傷不害彼。",
        "translation": "If someone uses a sharp sword to temperately liberate their body, they shouldn't harbor anger or resentment, and their mouth doesn't utter harsh words; harsh thoughts and harsh words hurt themselves and don't harm others.",
        "source": "T04n0192_005:0048b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　節身修苦行，　　無過忍辱勝，　唯有行忍辱，　　難伏堅固力，　是故勿懷恨，　　惡言以加人。",
        "translation": "Moderating one's body and cultivating austerities is no better than tolerating humiliation; only practicing tolerance makes it difficult to subdue resilience; therefore, don't harbor hatred and speak harshly to others.",
        "source": "T04n0192_005:0048c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　瞋恚壞正法，　　亦壞端正色，　喪失美名稱，　　瞋火自燒心，　瞋為功德怨，　　愛德勿懷恨。",
        "translation": "When anger destroys the right Dharma and the right color, it loses its good reputation and sets fire to your own mind.",
        "source": "T04n0192_005:0048c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　在家多諸惱，　　瞋恚故非怪，　出家而懷瞋，　　是則與理乖，　猶如冷水中，　　而有盛火燃。",
        "translation": "When one is at home and is often troubled, anger is not strange; when one leaves home and harbors anger, it's contrary to reason, like a roaring fire burning in cold water.",
        "source": "T04n0192_005:0048c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　憍慢心若生，　　當自手摩頂，　剃髮服染衣，　　手持乞食器，　邊生裁自活，　　何為生憍慢？",
        "translation": "If conceit arises, then you must put your hand on your head, shave your hair, put on dyed clothing, carry a begging bowl in your hand, and cut yourself loose to live, so why does conceit arise?",
        "source": "T04n0192_005:0048c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　俗人衣色族，　　憍慢亦為過，　何況出家人，　　志求解脫道，　而生憍慢心？",
        "translation": "It's wrong for a secular person clothed in form to be proud, so why should a monk who aspires to pursue the path to liberation be proud?",
        "source": "T04n0192_005:0048c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　此則大不可。",
        "translation": "\"This, then, is a great no.",
        "source": "T04n0192_005:0048c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　曲直性相違，　　不俱猶霜炎，　出家脩直道，　　諂曲非所應，　諂偽幻虛詐，　　唯法不欺誑。",
        "translation": "Their twisted and straight natures are at odds, and they're not both like frost and heat; renunciant monks cultivate the straight path; flattery is not desirable; flattery is illusory and deceptive; only the Dharma doesn't deceive.",
        "source": "T04n0192_005:0048c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　多求則為苦，　　少欲則安隱，　為安應少欲，　　況求真解脫？",
        "translation": "Seeking much will lead to suffering, but desiring little will lead to peace, and for peace you should desire little, much less seek true liberation.",
        "source": "T04n0192_005:0048c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　慳悋畏多求，　　恐損其財寶，　好施者亦畏，　　愧財不供足，　是故當小欲，　　施彼無畏心。",
        "translation": "They're afraid of seeking too much for fear of damaging their treasures, and those who are generous are afraid, too, of not having enough to offer.",
        "source": "T04n0192_005:0048c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由此少欲心，　　則得解脫道，　若欲求解脫，　　亦應習知足。",
        "translation": "With this mind of few desires, they'll attain the path to liberation, and if they want to pursue liberation, they should also cultivate contentment.",
        "source": "T04n0192_005:0048c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　知足常歡喜，　　歡喜即是法，　資生具雖陋，　　知足故常安。",
        "translation": "Being contented is always joyful, and joy is the Dharma; even though the necessities for birth are rudimentary, knowing contentment makes them always secure.",
        "source": "T04n0192_005:0048c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不知足之人，　　雖得生天樂，　以不知足故，　　苦火常燒心。",
        "translation": "Even though a person doesn't know enough, they may attain the joy of birth in heaven, but because they don't know enough, their mind is always burned by the fires of suffering.",
        "source": "T04n0192_005:0048c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　富而不知足，　　是亦為貧苦，　雖貧而知足，　　是則第一富。",
        "translation": "Being rich and not knowing enough is poverty and suffering, but even though he's poor and knows he's satisfied, he's the richest.",
        "source": "T04n0192_005:0049a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　其不知足者，　　五欲境彌廣，　猶更求無厭，　　長夜馳騁苦。",
        "translation": "When someone doesn't know their own satisfaction, the five desires are so vast that they still seek endlessly, and long nights are spent chasing after suffering.",
        "source": "T04n0192_005:0049a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汲汲懷憂慮，　　反為知足哀，　不多受眷屬，　　其心常安隱。",
        "translation": "He harbors anxiety, but he's sorry for being satisfied, doesn't have many dependents, and is always at peace with his mind.",
        "source": "T04n0192_005:0049a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　安隱寂靜故，　　人天悉奉事，　是故當捨離，　　親踈二眷屬。",
        "translation": "Because they're peaceful and quiet, they're well-accomplished by humans and gods, so they must abandon both their close and distant family members.",
        "source": "T04n0192_005:0049a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如曠澤孤樹，　　眾鳥多集栖，　多畜眾亦然，　　長夜受眾苦，　多眾多纏累，　　如老象溺泥。",
        "translation": "Like a lonely tree in a vast swamp where many birds gather to roost, so do many animals, which suffer many hardships during long nights and are tied up by many people, like an old elephant drowning in mud.",
        "source": "T04n0192_005:0049a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人勤精進，　　無利而不獲，　是故當晝夜，　　精勤不懈怠。",
        "translation": "If someone diligently undertakes effort, there's no benefit that isn't obtained; therefore, he must work hard day and night and not be lazy.",
        "source": "T04n0192_005:0049a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　山谷微流水，　　常流故決石，　鑽火不精進，　　徒勞而不獲，　是故當精進，　　如壯夫鑽火。",
        "translation": "A slight stream in a valley always flows, thus cutting rocks, and when one doesn't make effort to bore a fire, it's fruitless and unobtainable; therefore, one should make effort, like a strong man bore a fire.",
        "source": "T04n0192_005:0049a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善友雖為良，　　不及於正念，　正念存於心，　　眾惡悉不入。",
        "translation": "Although a good friend is good, it's not as good as right mindfulness, and when right mindfulness exists in the mind, all evil won't enter.",
        "source": "T04n0192_005:0049a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故修行者，　　常當念其身，　於身若失念，　　一切善則忘。",
        "translation": "Therefore, a practitioner should always be mindful of his body, and if he loses mindfulness of his body, all goodness will be forgotten.",
        "source": "T04n0192_005:0049a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　譬如勇猛將，　　被鉀御強敵，　正念為重鎧，　　能制六境賊，　正定撿覺心，　　觀世間生滅，　是故修行者，　　當習三摩提。",
        "translation": "Like a brave general who's protected by potassium against a powerful opponent, right mindfulness is a heavy armor that can restrain thieves in the six objects, and right concentration collects the mind of awakening and contemplates the arising and ceasing of the world; therefore, a practitioner should train in samādhi.",
        "source": "T04n0192_005:0049a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三昧已寂靜，　　能滅一切苦，　智慧能照明，　　遠離於攝受。",
        "translation": "Once samādhi is calmed, it's able to cease all suffering, and wisdom illuminates it, freeing it from taking in sentient beings.",
        "source": "T04n0192_005:0049a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　等觀內思惟，　　隨順趣正法，　在家及出家，　　斯應由此路。",
        "translation": "With equal contemplation and inner reflection, he follows the right path, which should be the path of laypeople and renunciant monks.",
        "source": "T04n0192_005:0049a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　生老死大海，　　智慧為輕舟，　無明大闇冥，　　智慧為明燈，　諸纏結垢病，　　智慧為良藥，　煩惱棘刺林，　　智慧為利斧，　癡愛駃水流，　　智慧為橋梁，　是故當勤習，　　聞思修生慧。",
        "translation": "Wisdom is a light boat on the ocean of birth, age, and death; wisdom is a bright lamp in the great darkness of ignorance; wisdom is a good medicine for the sores and diseases of bondage; wisdom is a sharp axe in the thorny forest of affliction; wisdom is a bridge over the fast-flowing current of delusion and craving; therefore, you should diligently cultivate wisdom that arises from hearing, contemplating, and cultivating.",
        "source": "T04n0192_005:0049a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　成就三種慧，　　雖盲慧眼通，　無慧心虛偽，　　是則非出家。",
        "translation": "When he accomplishes the three kinds of wisdom, even though he's blind and has the wisdom eye, his mind is false without wisdom, and he's not a renunciant.",
        "source": "T04n0192_005:0049b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故當覺知，　　離諸虛偽法，　逮得微妙樂，　　寂靜安隱處。",
        "translation": "Therefore, you should realize that you're free of false dharmas and have attained the subtle joy of a quiet, peaceful place.",
        "source": "T04n0192_005:0049b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　遵崇不放逸，　　放逸為善怨，　若人不放逸，　　得生帝釋處，　縱心放逸者，　　則墮阿修羅。",
        "translation": "They revere non-carelessness, and carelessness is a good enemy. If a person doesn't carelessly conduct themselves, they'll be born in the place of Indra, but if they carelessly indulge their mind, they'll fall into the category of asuras.",
        "source": "T04n0192_005:0049b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　安慰慈悲業，　　所應我已畢，　汝等當精勤，　　善自修其業，　山林空閑處，　　增長寂靜心。",
        "translation": "Now that I've completed the task of comforting compassionate actions that are expected of me, you must diligently cultivate your own actions well, and develop a tranquil mind in the quiet places of the mountains and forests.",
        "source": "T04n0192_005:0049b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當自勤勸勉，　　勿令後悔恨。",
        "translation": "You must exhort yourselves not to regret it later.",
        "source": "T04n0192_005:0049b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶如世良醫，　　應病說方藥，　抱病而不服，　　是非良醫過。",
        "translation": "He's like a good doctor of the world who responds to a sickness by prescribing medicine and doesn't take it, which is not the fault of a good doctor.",
        "source": "T04n0192_005:0049b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我已說真實，　　顯示平等路，　聞而不奉用，　　此非說者咎。",
        "translation": "I've explained the truth and shown the way to equality, but to hear it and not apply it is not the fault of the speaker.",
        "source": "T04n0192_005:0049b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於四真諦義，　　有所不了者，　汝今悉應問，　　勿復隱所懷。」",
        "translation": "Those of you who don't understand the meaning of the four truths should now ask about them all and not hold back what you harbor.\"",
        "source": "T04n0192_005:0049b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世尊哀愍教，　　眾會默然住。",
        "translation": "The Bhagavān compassionately taught this, and the assembly stood in silence.",
        "source": "T04n0192_005:0049b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時阿那律陀，　　觀察諸大眾，　默然無所疑，　　合掌而白佛：「月溫日光冷，　　風靜地性動，　如是四種惑，　　世間悉已無。",
        "translation": "Aniruddha then observed the multitude, remained silent, had no doubts, and put his palms together and said to the Buddha, \"The moon is warm, the sun is cold, the wind is still, the earth is moving, and these four kinds of mental disturbances are all absent in the world.",
        "source": "T04n0192_005:0049b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苦集滅道諦，　　真實未曾違，　如世尊所說，　　眾會悉無疑。",
        "translation": "The truth of the noble truths of suffering, arising, cessation, and the path has never been contradicted, and as the Bhagavān teaches, all assembled here have no doubt.",
        "source": "T04n0192_005:0049b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　唯世尊涅槃，　　一切悉悲感，　不於世尊說，　　起不究竟想。",
        "translation": "Only the Bhagavān's nirvāṇa is fully and compassionately felt, and I don't give rise to any notion of the Bhagavān's teaching as being incomplete.",
        "source": "T04n0192_005:0049c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　正使新出家，　　情未深解者，　聞今慇懃教，　　疑惑悉已除。",
        "translation": "It's precisely because a newly reborn monk with feelings that are not deeply understood has heard this courteous teaching that all doubts and confusions have been removed.",
        "source": "T04n0192_005:0049c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　已度生死海，　　無欲無所求，　今皆生悲戀，　　歎佛滅何速？」",
        "translation": "They've crossed the ocean of birth and death, have no desire, and seek nothing, but now they all give rise to a compassionate longing, lamenting how quickly the Buddha will cease.\"",
        "source": "T04n0192_005:0049c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛以阿那律，　　種種憂悲說，　復以慈愍心，　　安慰而告言：「正使經劫住，　　終歸當別離，　異體而和合，　　理自不常俱。",
        "translation": "Using the Anāthapiṇḍika Vinaya, the Buddha spoke with various kinds of sorrow and compassion, and with kindness and compassion, he reassured and told them, \"It's just that they've been living through eons and will eventually separate, uniting different bodies, and the principle itself is not always the same.",
        "source": "T04n0192_005:0049c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自他利已畢，　　空住何所為？",
        "translation": "After we've finished improving ourselves and others, what's the purpose of abiding in emptiness?",
        "source": "T04n0192_005:0049c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天人應度者，　　悉已得解脫。",
        "translation": "\"All gods and humans who should be saved have been liberated.",
        "source": "T04n0192_005:0049c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝等諸弟子，　　展轉維正法，　知有必磨滅，　　勿復生憂悲，　當自勤方便，　　到不別離處。",
        "translation": "All of you disciples, keep maintaining the right teaching, knowing that existence will surely perish, don't become sad and compassionate, and work on your own to reach a place that's not separate.",
        "source": "T04n0192_005:0049c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我已燃智燈，　　照除世闇冥，　世皆不牢固，　　汝等當隨喜。",
        "translation": "I've lit a lamp of wisdom to remove the darkness of the world, and you will rejoice when the world is unstable.",
        "source": "T04n0192_005:0049c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如親遭重病，　　療治脫苦患，　已捨於苦器，　　逆生死海流，　永離眾苦患，　　是亦應隨喜。",
        "translation": "Like a relative who's gravely ill and is cured of suffering, you should also rejoice when you've abandoned the vessel of suffering and turned against the current of birth-and-death, forever escaping the many afflictions.",
        "source": "T04n0192_005:0049c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝等善自護，　　勿生於放逸，　有者悉歸滅，　　我今入涅槃。」",
        "translation": "Guard yourselves well, don't give rise to carelessness, and all that exist will perish as I now enter nirvāṇa.\"",
        "source": "T04n0192_005:0049c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　言語從是斷，　　此則最後教。",
        "translation": "Cutting off language in this way, this is the final teaching.",
        "source": "T04n0192_005:0049c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　入初禪三昧，　　次第九正受，　逆次第正受，　　還入於初禪，　復從初禪起，　　入於第四禪，　出定心無寄，　　便入於涅槃。",
        "translation": "He enters samādhi in the first dhyāna, followed by the ninth right feeling, goes against the order of right feelings, returns to the first dhyāna, rises again from the first dhyāna, enters the fourth dhyāna, leaves concentration with no lingering thoughts, and then enters nirvāṇa.",
        "source": "T04n0192_005:0049c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以佛涅槃故，　　大地普震動，　空中普雨火，　　無薪而自焰。",
        "translation": "As a result of the Buddha's nirvāṇa, the earth is shaken universally, and fire pours down from the sky, burning itself without fuel.",
        "source": "T04n0192_005:0049c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又復從地起，　　八方俱熾燃，　乃至諸天宮，　　熾燃亦如是。",
        "translation": "Again, from the ground it rises, blazing in all directions, even as the palaces of the gods are blazing in the same way.",
        "source": "T04n0192_005:0050a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雷霆動天地，　　霹靂震山川，　猶天阿修羅，　　擊鼓戰鬪聲。",
        "translation": "Thunderstorms move heaven and earth, and thunderbolts shake mountains and rivers, just like the gods and asuras, beating their drums and fighting sounds.",
        "source": "T04n0192_005:0050a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　狂風四激起，　　山崩雨灰塵，　日月無光暉，　　清流悉沸涌，　堅固林萎悴，　　華葉非時零。",
        "translation": "A fierce wind arises in four directions, mountains crumble and rain dust, the sun and moon lack radiance, clear streams all boil over, sturdy forests wither, and flowering leaves fall apart at random.",
        "source": "T04n0192_005:0050a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　飛龍乘黑雲，　　垂五首淚流，　四王及眷屬，　　含悲興供養。",
        "translation": "Flying dragons ride on black clouds, dropping five heads and shedding tears, the four kings and their retinues make offerings with compassion.",
        "source": "T04n0192_005:0050a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　淨居天來下，　　虛空中列侍，　觀察無常變，　　無憂亦無喜。",
        "translation": "From the pure abode of the gods, they line up in space to attend on him, observing impermanence and change, without sorrow or joy.",
        "source": "T04n0192_005:0050a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　歎世違天師，　　眼滅一何速？",
        "translation": "He praises the world's mistaken teacher, \"How quickly does the eye cease?",
        "source": "T04n0192_005:0050a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　八部諸天神，　　遍滿虛空中，　散華以供養，　　慼慼心不歡；　唯有魔王喜，　　奏樂以自娛。",
        "translation": "The eight celestials fill the sky, scattering flowers in offerings but not rejoicing in sadness, except for the joy of Māra King, who plays music for his own enjoyment.",
        "source": "T04n0192_005:0050a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　閻浮提失榮，　　猶山頺巔崩，　大象素牙折，　　牛王雙角摧。",
        "translation": "Jambudvīpa loses its glory like a mountain whose peak crumbles, an elephant's tusks are broken, and a bull king's horns are destroyed.",
        "source": "T04n0192_005:0050a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　虛空無日月，　　蓮花遭嚴霜，　如來般涅槃，　　世間悴亦然。",
        "translation": "The sky is devoid of sun and moon, the lotus flower is exposed to glorious frost, and the Tathāgata attains parinirvāṇa, so does the world become emaciated.",
        "source": "T04n0192_005:0050a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛所行讚歎涅槃品第二十七",
        "translation": "Buddhacarita: Nirvāṇa Chapter 27",
        "source": "T04n0192_005:0050a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時有一天子，　　乘千白鵠宮，　於上虛空中，　　觀佛般涅槃。",
        "translation": "Then, a celestial riding in a palace of a thousand white squirrels observed the Buddha's parinirvāṇa from the heavens above.",
        "source": "T04n0192_005:0050a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　普為諸天眾，　　廣說無常偈：「一切性無常，　　速生而速滅。",
        "translation": "For all the gods, he spoke a detailed verse about impermanence, \"All things are impermanent in nature, quickly arisen and quickly ceased.",
        "source": "T04n0192_005:0050a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　生則與苦俱，　　唯寂滅為樂。",
        "translation": "Birth then goes along with suffering, and only cessation is pleasant.",
        "source": "T04n0192_005:0050a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　行業薪積聚，　　智慧火熾燃。",
        "translation": "Firewood from industry gathers, and the fires of wisdom blaze.",
        "source": "T04n0192_005:0050a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　名稱烟衝天，　　時雨雨令滅，　猶如劫火起，　　水災之所滅。」",
        "translation": "Its name smokes up against the sky, but the timely rain makes it go out like an eon fire that arises and a flood that goes out.\"",
        "source": "T04n0192_005:0050a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　復有梵仙天，　　猶第一義仙，　處天勝妙樂，　　而不染天報，　歎如來寂滅，　　心定而口言：「觀察三世法，　　始終無不壞。",
        "translation": "There's also the Brahmakāyika heaven, which is like the sage of the highest truth, who abides in the heavenly abodes with superior subtlety and undefiled heavenly rewards, praises the Tathāgata's tranquility, and says with concentrated mind, \"Observe the three worldly dharmas, which never begin or end without decay.",
        "source": "T04n0192_005:0050a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　第一義通達，　　世間無比士，　慧知見之士，　　救護世間者，　悉為無常壞，　　何人得長存？",
        "translation": "Those who understand the supreme truth have no parallel in the world, and those of wisdom and vision who protect the world are all destroyed by impermanence, so who can survive forever?",
        "source": "T04n0192_005:0050b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　哀哉舉世間，　　群生墮邪徑。」",
        "translation": "'Woe betide the world, where so many sentient beings fall into wrong paths.'",
        "source": "T04n0192_005:0050b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時阿那律陀，　　於世不律陀，　已滅不律陀，　　生死尼律陀，　歎如來寂滅，　　群生悉盲冥，　諸行聚無常，　　猶若輕雲浮。",
        "translation": "Aniruddha then, in the world as a whole as aniruddha, having ceased as aniruddha, and having undergone birth-and-death as a niruddha, praised the Tathāgata's tranquility, the blindness of all sentient beings, and the impermanence of all conditioned things, just like light clouds floating by.",
        "source": "T04n0192_005:0050b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　速起而速滅，　　慧者不保持，　無常金剛杵，　　壞牟尼山王。",
        "translation": "Quick to arise and quick to cease, wise ones don't remain, and the impermanent vajra destroys the king of Mt. Muni.",
        "source": "T04n0192_005:0050b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　鄙哉世輕躁，　　破壞不堅固，　無常暴師子，　　害龍象大仙。",
        "translation": "Despicable is the world's impatience, which destroys the unsteady, impermanent, violent lion who harms dragons and elephants as great men.",
        "source": "T04n0192_005:0050b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來金剛幢，　　猶為非常壞，　何況未離欲，　　而不生怖畏？",
        "translation": "The Tathāgata's adamantine banner is still impervious to destruction, so why wouldn't he be frightened if he hadn't yet parted with desire?",
        "source": "T04n0192_005:0050b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　六種子一芽，　　一水之所雨，　四引之深根，　　二觚五種菓，　三際同一體，　　煩惱之大樹，　牟尼大象拔，　　而不免無常。",
        "translation": "\"One sprout of six seeds, one rain of water, four deep roots that lead, two goblets of five kinds of fruit, three realms in one body, a great tree of affliction, and a great Muni elephant that plucks it up, but it's not exempt from impermanence.",
        "source": "T04n0192_005:0050b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶如飾棄鳥，　　樂水吞毒蛇，　忽遇天大旱，　　失水而身亡。",
        "translation": "He's like a decorated bird that enjoys water and swallows a viper, but suddenly there's a great drought, and he loses his water and dies.",
        "source": "T04n0192_005:0050b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　駿馬勇於戰，　　戰畢純熟還，　猶火緣薪熾，　　薪盡則自滅。",
        "translation": "A stallion is brave enough to fight, but it's perfectly ripe to return after the battle, like a fire that's cursed by blazing firewood and then goes out on its own when the firewood runs out.",
        "source": "T04n0192_005:0050b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如來亦如是，　　事畢歸涅槃，　猶如明月光，　　普為世除冥。",
        "translation": "The Tathāgata is likewise and returns to nirvāṇa after finishing his work, just like the bright light of the moon that rids the world of darkness.",
        "source": "T04n0192_005:0050b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾生悉蒙照，　　而復隱須彌，　如來亦如是，　　慧光照幽冥。",
        "translation": "All sentient beings are illuminated, but again, Hidden Sumeru, so too is the Tathāgata, whose wisdom shines brightly into the darkness.",
        "source": "T04n0192_005:0050b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為眾生除冥，　　而隱涅槃山，　名稱勝光明，　　普照於世間。",
        "translation": "He removes the darkness from sentient beings and hides himself on the mountain of nirvāṇa, where he's called a brilliant light that shines universally in the world.",
        "source": "T04n0192_005:0050c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　滅除一切冥，　　不停若迅流，　善御七駿馬，　　軍眾羽從遊。",
        "translation": "He removes all darkness, doesn't stop like a swift current, skillfully guides seven steeds, and subordinates armies of feathers to roam.",
        "source": "T04n0192_005:0050c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　光光日天子，　　猶入於崦嵫，　日月五障翳，　　眾生失光明。",
        "translation": "　光光日天子，　　猶入於崦嵫，　日月五障翳，　　眾生失光明。",
        "source": "T04n0192_005:0050c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　奉火祠天畢，　　唯有燋黑烟，　如來已潛輝，　　世失榮亦然。",
        "translation": "After consecrating the gods with fire, there's only black smoke, and the Tathāgata has latently shone, so has the world lost its glory.",
        "source": "T04n0192_005:0050c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　絕恩愛希望，　　普應眾生望，　眾生望已滿，　　事畢絕希望。",
        "translation": "He stops wishing for kindness and universally accords with the hopes of sentient beings, and once their hopes have been fulfilled, he ends them.",
        "source": "T04n0192_005:0050c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　離煩惱身縛，　　而得真實道，　離群聚憒亂，　　入於寂靜處。",
        "translation": "Freed from the physical bonds of affliction, he attains the true path, ridding himself of the masses and confusion, and enters a place of tranquility.",
        "source": "T04n0192_005:0050c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　神通騰虛遊，　　苦器故棄捨，　癡冥之重闇，　　智慧光照除。",
        "translation": "Their psychic powers soar into the sky, the vessel of suffering is discarded, and the heavy darkness of delusion is removed by the light of wisdom.",
        "source": "T04n0192_005:0050c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　煩惱之埃塵，　　智水洗令淨，　不復數數還，　　永之寂靜處。",
        "translation": "The dust of affliction is cleansed by the water of wisdom, and it doesn't return uncountably, forever ending up in the place of quiescence.",
        "source": "T04n0192_005:0050c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　滅一切生死，　　一切悉宗敬，　令一切樂法，　　以慧充一切。",
        "translation": "He extinguishes all birth and death, pays respect to all, makes all things pleasant, and fills all things with wisdom.",
        "source": "T04n0192_005:0050c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　悉安慰一切，　　一切德普流，　名聞遍一切，　　重照迄於今。",
        "translation": "They all comfort all, all virtues flow universally, and their reputation is heard throughout the world, reborn, and continues to this day.",
        "source": "T04n0192_005:0050c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸有競德者，　　於彼哀愍心，　四利不為欣，　　四衰不以慼。",
        "translation": "Those who strive for virtue are compassionate toward them, not delighting in the four benefits and not grieving in the four failures.",
        "source": "T04n0192_005:0050c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善攝於諸情，　　諸根悉明徹，　澄心平等觀，　　六境不染著。",
        "translation": "Well-contained in sentient beings, their faculties are all clear and penetrating, and they clear their minds and observe equally, so they aren't tainted by the six objects.",
        "source": "T04n0192_005:0050c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所得未曾得，　　得人所不得，　以諸出要水，　　虛渴令飽滿。",
        "translation": "He obtains what's unobtainable, obtains what's unobtainable by others, and fills his thirst with the water that comes out of necessity.",
        "source": "T04n0192_005:0050c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　施人所不施，　　亦不望其報，　寂靜妙相身，　　悉知一切念。",
        "translation": "Giving what others don't give, he doesn't expect any reward, and he's fully aware of all thoughts with his serene, marvelous body.",
        "source": "T04n0192_005:0050c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　好惡不傾動，　　力勝一切怨，　一切病良藥，　　而為無常壞。",
        "translation": "Not easily distracted by good or evil, his strength is superior to all enemies, and he takes good medicine for all illnesses that are impermanent and broken.",
        "source": "T04n0192_005:0050c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切眾生類，　　樂法各異端，　普應其所求，　　悉滿其所願。",
        "translation": "All sentient beings of every kind enjoy different ends of the Dharma, and they all respond to their desires and fulfill their wishes.",
        "source": "T04n0192_005:0051a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聖慧大施主，　　一往不復還，　猶若世猛火，　　薪盡不復燃。",
        "translation": "A great donor of noble wisdom, he never returns once he's gone, just like a raging worldly fire that burns out and doesn't burn again.",
        "source": "T04n0192_005:0051a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　八法所不染，　　降五難調群，　以三而見三，　　離三而成三。",
        "translation": "Unsullied by the eight dharmas, he subdues five difficult groups, sees three with three, and becomes three without three.",
        "source": "T04n0192_005:0051a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　藏一以得一，　　超七而長眠，　究竟寂滅道，　　賢聖之所宗。",
        "translation": "He conceals the one and attains the one, transcends the seven, and goes to sleep for a long time, thoroughly extinguishes the path, and is the teaching of the noble ones.",
        "source": "T04n0192_005:0051a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　已斷煩惱障，　　宗奉者已度，　飢虛渴乏者，　　飲之以甘露。",
        "translation": "Having cut off the afflictive hindrances, they've passed those who worship them and given sweet nectar to those who are hungry and thirsty.",
        "source": "T04n0192_005:0051a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　被忍辱重鎧，　　降伏諸恚怒，　勝法微妙義，　　以悅於眾心。",
        "translation": "They are heavily armoured with patience, subdue anger, and please the minds of all by the subtle meaning of the surpassing Dharma.",
        "source": "T04n0192_005:0051a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　修世界善者，　　植以聖種子，　習正不正者，　　等攝而不捨。",
        "translation": "Those who cultivate the world's goodness plant holy seeds, and those who practice right and wrong are equally included and not abandoned.",
        "source": "T04n0192_005:0051a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　轉無上法輪，　　普世歡喜受，　宿殖樂法因，　　斯皆得解脫。",
        "translation": "They turn the unsurpassed wheel of the Dharma, experience universal joy, and attain liberation from the causes of their long-standing enjoyment of the Dharma.",
        "source": "T04n0192_005:0051a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　遊行於人間，　　度諸未度者，　未見真實者，　　悉令見真實。",
        "translation": "They wander among humans, passing those who haven't yet been passed, and making those who haven't yet seen the truth see it.",
        "source": "T04n0192_005:0051a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸習外道者，　　授之以深法，　說生死無常，　　無主無有樂。",
        "translation": "Those who are accustomed to non-Buddhist practices are taught a profound teaching that birth and death are impermanent and have no owner and no happiness.",
        "source": "T04n0192_005:0051a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　建大名稱幢，　　破壞眾魔軍，　進却無欣慼，　　薄生歎寂滅。",
        "translation": "He builds a great banner of fame, destroying the armies of Māra, advancing without joy or sorrow, and despising the extinction of shallow birth.",
        "source": "T04n0192_005:0051a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　未度者令度，　　未脫者令脫，　未寂者令寂，　　未覺者令覺。",
        "translation": "He causes those who have yet to be saved to be saved, those who have yet to be liberated to be liberated, those who have yet to be stilled to be stilled, and those who have yet to be awakened to be awakened.",
        "source": "T04n0192_005:0051a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　牟尼寂靜道，　　以攝於眾生，　眾生違聖道，　　習諸不正業。",
        "translation": "The Muni's path of quiescence is designed to include sentient beings who are contrary to the noble path and who cultivate improper actions.",
        "source": "T04n0192_005:0051a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶若大劫盡，　　持法者長眠，　密雲震霹靂，　　摧林雨甘澤。",
        "translation": "It's like when a great eon ends and the Dharma holder goes to sleep for a long time, a dense cloud shakes a thunderbolt, and a forest is destroyed and rains sweet water.",
        "source": "T04n0192_005:0051a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　少象摧棘林，　　識養能利人，　雲離象老悴，　　斯皆無所堪。",
        "translation": "A young elephant destroys a thorn forest, knowledge nurtures people, and clouds part as the elephant grows old and weary, but there's nothing to be done about it.",
        "source": "T04n0192_005:0051b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　破見能成見，　　於世度而度，　已壞諸邪論，　　而得自在道。",
        "translation": "He refutes views, establishes views, passes through the world, destroys mistaken theories, and attains the unimpeded path.",
        "source": "T04n0192_005:0051b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今入於大寂，　　世間無救護。",
        "translation": "Now that he's entered into great quiescence, the world has no protection.",
        "source": "T04n0192_005:0051b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　魔王大軍眾，　　奮武震天地，　欲害牟尼尊，　　不能令傾動，　如何忽一朝，　　非常魔所壞？",
        "translation": "The Māra King's great army rages against the heavens and earth, wanting to harm Venerable Muni, but they can't make it budge.",
        "source": "T04n0192_005:0051b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天人普雲集，　　充滿虛空中，　畏無窮生死，　　心生大憂怖。",
        "translation": "A multitude of gods and humans gather, filling the sky with fear of endless birth and death, and their hearts become greatly distressed.",
        "source": "T04n0192_005:0051b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間無遠近，　　天眼悉照見，　業報諦明了，　　如觀鏡中像。",
        "translation": "The world is neither distant nor near, but the divine eye sees them all, and it clearly understands the effects of karma as it observes an image in a mirror.",
        "source": "T04n0192_005:0051b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　天耳勝聰達，　　無遠而不聞，　昇虛教諸天，　　遊步化人境。",
        "translation": "With a divine ear that's so perceptive and intelligent, it doesn't go far without hearing, ascending into the sky to teach the gods and wandering into the realm of human transformation.",
        "source": "T04n0192_005:0051b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　分身而合體，　　涉水而不濡，　憶念過去生，　　彌劫而不忘。",
        "translation": "He parts body and unites body, wades through water without getting wet, and remembers past lives for eons without forgetting them.",
        "source": "T04n0192_005:0051b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸根遊境界，　　彼彼各異念，　知他心通智，　　一切皆悉知，　神通淨妙智，　　平等觀一切，　悉盡一切漏，　　一切事已畢，　智捨有餘界，　　息智而長眠。",
        "translation": "He travels to different realms with different thoughts, knows the minds of others with supernormal cognition, fully knows them all, has pure and marvelous divine wisdom, observes them all equally, completely ends all contaminants, has completed all tasks, discards the remaining realms with wisdom, calms his wisdom, and goes to sleep for a long time.",
        "source": "T04n0192_005:0051b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾生剛強心，　　見則得柔軟，　鈍根諸眾生，　　見則慧明利，　無量惡業過，　　見各得通塗，　一旦忽長眠，　　誰復顯斯德？",
        "translation": "When sentient beings with strong minds see it, they become flexible; sentient beings with dull faculties see it, and their wisdom is clear and sharp; the faults of measureless bad actions are coated by seeing each, and once they suddenly go to sleep, who else will display that virtue?",
        "source": "T04n0192_005:0051b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間無救護，　　望斷氣息絕，　誰以清涼水，　　灑之令蘇息，　所作自事畢，　　大悲已長息。",
        "translation": "\"The world has no help, and when their hope is cut off and their breath is gone, who will sprinkle it with cool, pure water to revive it? After doing their own work, their great compassion will have been long-lasting.",
        "source": "T04n0192_005:0051b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世間愚癡網，　　誰當為壞裂？",
        "translation": "Who will break open the web of foolishness in the world?",
        "source": "T04n0192_005:0051b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　向生死迅流，　　誰當說令反？",
        "translation": "Who will tell you to oppose the swift flow of birth and death?",
        "source": "T04n0192_005:0051c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　群生癡惑心，　　誰說寂靜道？",
        "translation": "\"Who says the path to quiescence when the minds of sentient beings are deluded?",
        "source": "T04n0192_005:0051c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　誰示安隱處？",
        "translation": "Who will show you a place of refuge?",
        "source": "T04n0192_005:0051c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　誰顯真實義？",
        "translation": "Who reveals the true and real meaning?",
        "source": "T04n0192_005:0051c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾生受大苦，　　誰為慈父救？",
        "translation": "\"When sentient beings experience great suffering, who is the compassionate father who saves them?",
        "source": "T04n0192_005:0051c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶多訟志忘，　　馬易土失威，　王者亡失國，　　世無佛亦然。",
        "translation": "Just as many litigators forget their intentions, horses change lands and lose their authority, kings lose their states, and the world lacks the Buddha.",
        "source": "T04n0192_005:0051c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　多聞無辭辯，　　為醫而無慧，　人王失光相，　　佛滅俗失榮。",
        "translation": "Well-versed and inexpressible, doctors lack wisdom, human kings lose their luminous appearances, and buddhas cease to be commonplace and lose their glory.",
        "source": "T04n0192_005:0051c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　良駟失善御，　　乘舟失船師，　三軍失英將，　　商人失其導，　疾病失良醫，　　聖王失七寶，　眾星失明月，　　愛壽而失命，　世間亦如是，　　佛滅失大明。",
        "translation": "A good arrow loses its good control, a boat loses its captain, three armies lose their valiant generals, a merchant loses his guide, a good doctor loses his disease, a noble king loses his seven treasures, the stars lose their bright moon, a man loves life and loses it, and so does the world lose its great clarity when the Buddha ceases.",
        "source": "T04n0192_005:0051c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是阿羅漢，　　所作皆已畢，　諸漏悉已盡，　　知恩報恩故，　纏綿悲戀說，　　歎德陳世苦。",
        "translation": "Thus, an arhat has finished what he started, all of his contaminants have ended, and because he knows and repays kindness, he speaks with endless compassion and fondness, praising the virtues and explaining the suffering of the world.",
        "source": "T04n0192_005:0051c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸未離欲者，　　悲泣不自勝，　其諸漏盡者，　　唯歎生滅苦。",
        "translation": "Those who aren't free of desire lament and weep uncontrollably, and those whose contaminants have ended simply praise the suffering of birth and death.",
        "source": "T04n0192_005:0051c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時諸力士眾，　　聞佛已涅槃，　亂聲慟悲泣，　　如群鵠遇鷹，　悉來詣雙樹，　　覩如來長眠，　無復覺悟容，　　椎胸而呼天，　猶師子搏犢，　　群牛亂呼聲。",
        "translation": "When the multitude of warriors heard that the Buddha had passed away, they made a commotion, sorrowful and lamenting noises, like a flock of partridges that meets a hawk and all come to the two trees.",
        "source": "T04n0192_005:0051c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　中有一力士，　　心已樂正法，　諦觀聖法王，　　已入於大寂。",
        "translation": "In the midst of them was a strong man whose mind had delighted in the right teaching, and he truly observed the noble king of the Dharma as he entered into great quiescence.",
        "source": "T04n0192_005:0051c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　言：「眾生悉眠，　　佛開發令覺，　今入於大寂，　　畢竟而長眠。",
        "translation": "He said, \"All sentient beings are asleep, and the Buddha inspired them to awaken, and now they've entered into great quiescence, passing into a long sleep after all.",
        "source": "T04n0192_005:0051c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為眾建法幢，　　而今一旦崩，　如來智慧日，　　大覺為照明。",
        "translation": "Having built the Dharma banner for all, now that it's collapsed, the Tathāgata's wisdom sun, the great awakening, illuminates it.",
        "source": "T04n0192_005:0051c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　精進為炎熱，　　智慧耀千光，　滅除一切闇，　　如何復長冥？",
        "translation": "How can there be long darkness when effort is the burning heat and wisdom shines in a thousand lights, destroying all darkness?",
        "source": "T04n0192_005:0052a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一慧照三世，　　普為眾生眼，　而今忽然盲，　　舉世莫知路。",
        "translation": "One ray of wisdom illuminates the three worlds and serves as the eye of sentient beings everywhere, but now suddenly it's blind, and no one in the world knows the way.",
        "source": "T04n0192_005:0052a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　生死大河流，　　貪恚癡巨浪，　法橋一旦崩，　　眾生長沒溺。」",
        "translation": "The great river of birth and death, the huge waves of greed, anger, and delusion, once the bridge of the Dharma collapses, all sentient beings are submerged.\"",
        "source": "T04n0192_005:0052a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼諸力士眾，　　或悲泣號咷，　或密感無聲，　　或投身躃地，　或寂默禪思，　　或煩冤長吟。",
        "translation": "Those crowds of strong men may weep and wail, or they may feel dense emotions without sound, or they may plunge to the ground, or they may meditate in silence, or they may wail with anguish.",
        "source": "T04n0192_005:0052a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　辦金銀寶輿，　　香花具莊嚴，　安置如來身，　　寶帳覆其上，　具幢幡華蓋，　　種種諸伎樂，　諸力士男女，　　導從修供養。",
        "translation": "They prepare a body of the Tathāgata adorned with gold, silver, and jewels, scented flowers, a jeweled canopy covering it, banners, streamers, and flower coverings, and various kinds of music, and they lead men and women of great power to cultivate offerings.",
        "source": "T04n0192_005:0052a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸天散香花，　　空中鼓天樂，　人天一悲歎，　　聲合而同哀。",
        "translation": "The gods scatter flowers and incense, the air is filled with celestial music, and humans and gods lament together, their voices united in sorrow.",
        "source": "T04n0192_005:0052a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　入城見士女，　　長幼供養畢，　出於龍象門，　　度凞連河表，　到諸過去佛，　　滅度支提所。",
        "translation": "They enter the city, meet the women, make offerings to the eldest and youngest, exit through the dragon and elephant gates, cross the bright red river, and arrive at the site of the cessation of all the past buddhas and the pratyekabuddhas.",
        "source": "T04n0192_005:0052a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　積牛頭栴檀，　　及諸名香木，　置佛身於上，　　灌以眾香油，　以火燒其下，　　三燒而不燃。",
        "translation": "He gathered oxhead sandalwood and other famous fragrant wood, placed them on top of the Buddha's body, filled them with oil from various scents, and burned their bottoms with fire; three times they burned, but they didn't burn.",
        "source": "T04n0192_005:0052a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時彼大迦葉，　　先住王舍城，　知佛欲涅槃，　　眷屬從彼來。",
        "translation": "That Mahākāśyapa, who was first staying in Rājagṛha, knew that the Buddha was about to enter nirvāṇa and that his retinue had come from there.",
        "source": "T04n0192_005:0052a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　淨心發妙願，　　願見世尊身。",
        "translation": "With a pure heart, he made the marvelous vow to see the Bhagavān's body.",
        "source": "T04n0192_005:0052a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以彼誠願故，　　火滅而不燃。",
        "translation": "Because of that sincere vow, the fire went out and wasn't burned.",
        "source": "T04n0192_005:0052a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　迦葉眷屬至，　　悲歎俱瞻顏，　敬禮於雙足，　　然後火乃燃。",
        "translation": "When Kāśyapa's retinue arrived, they looked with pity and admiration, paid homage at both feet, and the fire was then kindled.",
        "source": "T04n0192_005:0052a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　內絕煩惱火，　　外火不能燒，　雖燒外皮肉，　　金剛真骨存。",
        "translation": "Although the external fire can't burn the internal fire that cuts off affliction, the adamantine bones remain, even though the external skin and flesh are burned.",
        "source": "T04n0192_005:0052a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　香油悉燒盡，　　盛骨以金瓶，　如法界不盡，　　骨不盡亦然。",
        "translation": "The scented oil is all burned up, but the bones are held in a golden vial. Just as the Dharma realm doesn't run out, so do the bones.",
        "source": "T04n0192_005:0052b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　金剛智慧果，　　難動如須彌，　大力金翅鳥，　　所不能傾移，　而處於寶瓶，　　應世而流遷。",
        "translation": "The adamantine fruit of wisdom is as difficult to move as Sumeru, and it can't be tipped by a mighty garuḍa bird while sitting in a jeweled vase, responding to the world's transmigration.",
        "source": "T04n0192_005:0052b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　奇哉世間力，　　能轉寂滅法，　德稱廣流布，　　周滿於十方。",
        "translation": "Amazing is the worldly power that transforms the Dharma of extinction, and its virtues are widely known and spread throughout the ten directions.",
        "source": "T04n0192_005:0052b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　隨世長寂滅，　　唯有餘骨存，　大光耀天下，　　群生悉蒙照。",
        "translation": "As the world grows extinct, only the remaining bones remain, and a great light shines brightly throughout the world, illuminating all living beings.",
        "source": "T04n0192_005:0052b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一旦而潛暉，　　遺骨於瓶中，　金剛利智慧，　　壞煩惱苦山。",
        "translation": "Once it shines brightly, his bones are placed in a vial, and his adamantine wisdom destroys the mountain of affliction and suffering.",
        "source": "T04n0192_005:0052b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾苦集其身，　　金剛志能安，　受大苦眾生，　　悉令得除滅。",
        "translation": "When suffering collects in his body, the adamantine resolve calms it and causes all sentient beings who suffer great pain to be removed.",
        "source": "T04n0192_005:0052b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是金剛體，　　今為火所焚。",
        "translation": "Thus, the adamantine body is now consumed by fire.",
        "source": "T04n0192_005:0052b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼諸力士眾，　　勇健世無雙，　摧伏怨家苦，　　能救苦歸依。",
        "translation": "Their multitude of strong men is unsurpassed in the world for their courage, their ability to subdue the suffering of resentful families, and their ability to save those in need of help from suffering.",
        "source": "T04n0192_005:0052b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　親愛遭苦難，　　志強能無憂，　今見如來滅，　　悉懷憂悲泣。",
        "translation": "Their loved ones are afflicted, and their resolve is strong enough to be without sorrow. Now, when they see the Tathāgata cease, they all weep with sadness.",
        "source": "T04n0192_005:0052b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　壯身氣強盛，　　憍慢虛天步，　憂苦迫其心，　　入城猶曠澤，　持舍利入城，　　巷路普供養，　置於高樓閣，　　天人悉奉事。",
        "translation": "Their stout bodies are strong, their arrogance is so great that they step into the virtual heavens, and their minds are so constrained by grief and suffering that they enter the city just as if it were a vast swamp.",
        "source": "T04n0192_005:0052b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛所行讚分舍利品第二十八",
        "translation": "Buddhacarita Śāriputra Chapter Twenty-eight",
        "source": "T04n0192_005:0052b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼諸力士眾，　　奉事於舍利，　以勝妙香花，　　興無上供養。",
        "translation": "Those bands of strong men honored the relic and made unsurpassed offerings with flowers and incense of marvelous fragrance.",
        "source": "T04n0192_005:0052b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時七國諸王，　　承佛已滅度，　遣使詣力士，　　請求佛舍利。",
        "translation": "When the kings of seven countries acknowledged that the Buddha had died, they sent envoys to the strong men to request the Buddha's relics.",
        "source": "T04n0192_005:0052b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼諸力士眾，　　敬重如來身，　兼恃其勇健，　　而起憍慢心，　寧捨自身命，　　不捨佛舍利。",
        "translation": "Those strong men respected the Tathāgata's body and relied on his strength, but they became arrogant and preferred to sacrifice their own lives rather than the Buddha's relics.",
        "source": "T04n0192_005:0052b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼使悉空還，　　七王大忿恨，　興軍如雲雨，　　來詣鳩夷城。",
        "translation": "When all of their envoys returned empty, the seven kings were so angry that they raised an army like clouds and rained down on the city of Kukkuṭapāda.",
        "source": "T04n0192_005:0052c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人民出城者，　　悉皆驚怖還，　告諸力士眾：　　「諸國軍馬來，　象馬車步眾，　　圍遶鳩夷城。",
        "translation": "The people who left the city were all terrified and returned, and they told the crowd of strong men, \"The city of Kauśāmbī is surrounded by armies of countries and horses, elephants, horses, chariots, and foot soldiers.",
        "source": "T04n0192_005:0052c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　城外諸園林，　　泉池花果樹，　軍眾悉踐蹈，　　榮觀悉摧碎。」",
        "translation": "Outside the city are parks and forests, springs and pools, flowers and fruit trees that the army tramples over and destroys in their glory.\"",
        "source": "T04n0192_005:0052c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　力士登城觀，　　生業悉破壞，　嚴備戰鬪具，　　以擬於外敵，　弓弩挽石車，　　飛炬獨發來。",
        "translation": "Powerful men ascend the city to see how their livelihoods are destroyed, prepare themselves for battle, and prepare for external enemies with bows, crossbows, stone carts, and flying torches.",
        "source": "T04n0192_005:0052c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　七王圍遶城，　　軍眾各精銳，　羽儀盛明顯，　　猶如七耀光，　鍾鼓如雷霆，　　勇氣盛雲霧。",
        "translation": "Surrounded by seven kings, the city's army is elite, its feathers are resplendent and shining like seven shining lights, its bells and drums are like thunder, and its courage is abundant in clouds and mists.",
        "source": "T04n0192_005:0052c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　力士大奮怒，　　開門而命敵，　長宿諸士女，　　心信佛法者，　驚怖發誠願，　　伏彼而不害，　隨親相勸諫，　　不欲令鬪戰。",
        "translation": "The strong men raged, opened the gate, and killed their opponents. The long-staying men and women who believed in the Buddha's teaching were terrified and made a sincere vow to subdue them and not harm them, and they were encouraged by their relatives not to engage in combat.",
        "source": "T04n0192_005:0052c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　勇士被重鉀，　　揮戈舞長劍，　鍾鼓而亂鳴，　　執仗鋒未交。",
        "translation": "A warrior is overcome with a heavy potion, wields his spear and long sword, and his drum beats chaotically as he holds his weapon before it meets.",
        "source": "T04n0192_005:0052c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有一婆羅門，　　名曰獨樓那，　多聞智略勝，　　謙虛眾所宗。",
        "translation": "There was a Brāhmaṇa named Duluth, who was well-versed, had superior wisdom, and was modest enough to be revered by everyone.",
        "source": "T04n0192_005:0052c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　慈心樂正法，　　告彼諸王言：「觀彼城形勢，　　一人亦足當。",
        "translation": "Being compassionate and delighting in the true teaching, he told the kings, \"Looking at the shape and strength of that city, even one person could handle it.",
        "source": "T04n0192_005:0052c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　況復齊心力，　　而不能伏彼？",
        "translation": "How could it be that even with the strength of one's mind, it's impossible to subdue them?'",
        "source": "T04n0192_005:0052c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　正使相摧滅，　　復有何德稱？",
        "translation": "What virtue does it have to claim when the correct cause is destroyed?",
        "source": "T04n0192_005:0052c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　利鋒刃既交，　　勢無有兩全，　困此而害彼，　　二俱有所傷。",
        "translation": "When sharp edges meet, there's no balance of power; trapping one and harming the other will cause injury to both.",
        "source": "T04n0192_005:0052c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　鬪戰多機變，　　形勢難測量，　或有強勝弱，　　或弱而勝強。",
        "translation": "A fight is fraught with uncertainty, the situation is difficult to gauge, and there may be a strong man who outwits a weak man, or a weak man who outwits a strong man.",
        "source": "T04n0192_005:0052c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　健夫輕毒蛇，　　豈不傷其身？",
        "translation": "Wouldn't a strong man despise a viper and injure his body?",
        "source": "T04n0192_005:0053a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有人性柔弱，　　群女子所獎。",
        "translation": "\"Some people are weak and tender, and they're prized by a group of women.",
        "source": "T04n0192_005:0053a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　臨陣成戰士，　　如火得膏油，　鬪莫輕弱敵，　　謂彼無所堪，　身力不足恃，　　不如法力強。",
        "translation": "When they face battle, they become like an oil on fire. Don't despise a weak opponent, saying they're helpless, their physical strength isn't enough to rely on, and they're not as strong as the Dharma.",
        "source": "T04n0192_005:0053a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　古昔有勝王，　　名迦蘭陀摩，　端坐起慈心，　　能伏大怨敵。",
        "translation": "Once upon a time, there was a victorious king named Kālāndāma who sat erect and compassionate and was able to subdue great enemies.",
        "source": "T04n0192_005:0053a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖王四天下，　　名稱財利豐，　終歸亦皆盡，　　如牛飲飽歸。",
        "translation": "Even though he ruled four worlds and had a wealthy reputation, his wealth and profit were all exhausted in the end, like an ox returning from drinking.",
        "source": "T04n0192_005:0053a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應以法以義，　　應以和方便，　戰勝增其怨，　　和勝後無患。",
        "translation": "By using the Dharma as principle and by using the skillful means of reconciliation, a victor in battle will increase his enmity, but a victor in reconciliation will bring no trouble.",
        "source": "T04n0192_005:0053a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今結飲血讐，　　此事甚不可，　為欲供養佛，　　應隨佛忍辱。」",
        "translation": "Now, to be bound to drinking blood and feuding with each other is a terrible thing, and in order to support the Buddha, one should follow his tolerance.\"",
        "source": "T04n0192_005:0053a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是婆羅門，　　決定吐誠實，　方宜義和理，　　而作無畏說。",
        "translation": "Thus, the Brāhmaṇa decided to spit out the truth, which makes it appropriate to explain the principle of harmony and fearlessness.",
        "source": "T04n0192_005:0053a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時彼諸王，　　告婆羅門言：「汝今善應時，　　黠慧義饒益，　親密至誠言，　　順法依強理。",
        "translation": "It was then that those kings addressed the brāhmaṇas, \"Now is the time for you to respond well, to be wise and helpful, to speak intimately and sincerely, and to rely on strong principles to accord with the Dharma.",
        "source": "T04n0192_005:0053a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　且聽我所說，　　為王者之法，　或因五欲諍，　　嫌恨競強力；　或因其嬉戲，　　不急致戰爭；　吾等今為法，　　戰爭復何怪？",
        "translation": "Listen to what I've said, for the Dharma of kings is sometimes based on a dispute over the five desires, resentment, and strength, or because of play, it's not urgent to engage in war; what wonder is it that we're now doing this Dharma, and what's the point of war?",
        "source": "T04n0192_005:0053a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　憍慢而違義，　　世人尚伏從，　況佛離憍慢，　　化人令謙下，　我等而不能，　　亡身而供養？",
        "translation": "How could a person in the world still submit to a conceited person who violates the meaning, much less a Buddha who is free of conceit and makes people humble, but we are unable to abandon ourselves and make offerings?",
        "source": "T04n0192_005:0053a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　昔諸大地主，　　弼瑟阿難陀，　為一端正女，　　戰爭相摧滅；　況今為供養，　　清淨離欲師，　愛身而惜命，　　不以力爭求，　先王驕羅婆，　　與般那婆戰，　展轉更相破，　　正為貪利故；　況為無貪師，　　而復貪其生？",
        "translation": "\"In the past, the great lords of the earth, Prasenajit Ananta, destroyed one another in battle over a proper woman; how could it be that I'm now offering support to a pure master who is free of desire, who loves his body and cherishes his life, who doesn't strive for it with his strength, and whose life was destroyed by the previous king, Ālāhuja, and Panavāsa, precisely because of their desire for gain; how could I be a master without desire and yet desire his life?",
        "source": "T04n0192_005:0053a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　羅摩仙人子，　　瞋恨千臂王，　破國殺人民，　　正為瞋恚故；　況為無恚師，　　而惜於身命？",
        "translation": "\"Sage Rāma's son, he hates the thousand-armed king and destroys his country and kills his people precisely because of his anger; how much more so when he's a teacher without anger and he spares his own life?",
        "source": "T04n0192_005:0053b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　羅摩為私陀，　　殺害諸鬼國；　況無攝受師，　　不為其沒命？",
        "translation": "\"Did the Rāma kill the kingdoms of ghosts for Hiraṇyavatī? How could he not have taken the life of a master who didn't take care of him?",
        "source": "T04n0192_005:0053b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　阿利及婆俱，　　二鬼常結怨，　正為愚癡故，　　廣害於眾生；　況為智慧師，　　而復惜身命？",
        "translation": "\"Alakavatī and Vākṣu, two demons who are always at odds, are doing harm to sentient beings precisely because of their folly; how could they be wise teachers and yet still value their own lives?",
        "source": "T04n0192_005:0053b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是比眾多，　　無義而自喪，　況今天人師，　　普世所恭敬，　計身而惜命，　　不勤求供養？",
        "translation": "How could such a great multitude, meaningless and bereft of themselves, let alone our own teachers, universally respected, who count themselves worthy of life and don't diligently seek offerings?",
        "source": "T04n0192_005:0053b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝若欲止爭，　　為吾等入城，　勸彼令開解，　　使我願得滿。",
        "translation": "If you want to stop the fighting, enter the city for us and encourage them to understand, so that my vow may be fulfilled.",
        "source": "T04n0192_005:0053b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　以汝法言故，　　令我心小息，　猶如盛毒蛇，　　呪力故暫止。」",
        "translation": "Because of your words, you've calmed my mind, which is like a venomous snake in full bloom that's been temporarily stopped by the power of a spell.\"",
        "source": "T04n0192_005:0053b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時婆羅門，　　受彼諸王教，　入城詣力士，　　問訊以告誠：「外諸人中王，　　手執利器仗，　身被於重鉀，　　精銳耀日光，　奮師子勇氣，　　咸欲滅此城。",
        "translation": "It was then that the Brāhmaṇa, having been taught by those kings, went into the city and visited the strong man, questioned him, and told him, \"Out there, there are kings among men who carry sharp weapons and battles in their hands, cover their bodies with heavy potash, shine brightly in the sun, and rouse the courage of lions, all of whom want to annihilate this city.",
        "source": "T04n0192_005:0053b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　然其為法故，　　猶畏非法行，　是故遣我來，　　旨欲有所白。",
        "translation": "Still, they fear unlawful actions for the sake of the Dharma, so they sent me here with the intention of explaining them.",
        "source": "T04n0192_005:0053b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我不為土地，　　亦不求錢財，　不以憍慢心，　　亦無懷恨心，　恭敬大仙故，　　而來至於此；　汝當知我意，　　何為苦相違？",
        "translation": "I don't seek land, I don't seek money, I'm not proud, I don't harbor hatred, and I've come here out of respect for the great sage.",
        "source": "T04n0192_005:0053b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　尊奉彼我同，　　則為法兄弟，　世尊之遺靈，　　一心共供養。",
        "translation": "Venerating them and me together, they're brothers in the Dharma, the relics of the Bhagavān, and they make offerings together with one mind.",
        "source": "T04n0192_005:0053c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　慳惜於錢財，　　此則非大過，　法慳過最甚，　　普世之所薄。",
        "translation": "It's not a great mistake to be stingy with money and property, but stinginess with dharmas is the worst mistake, and it's despised by the whole world.",
        "source": "T04n0192_005:0053c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　決定不通者，　　當修待賓法，　無有剎利法，　　閉門而自防。",
        "translation": "Those who are certain it won't work should cultivate the principle of hospitality, have no beneficial qualities, and close their own doors to defend themselves.",
        "source": "T04n0192_005:0053c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　彼等悉如是，　　告此吉凶法。",
        "translation": "They all do, telling him about this auspicious and unfortunate principle.",
        "source": "T04n0192_005:0053c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我今私所懷，　　亦告其誠實，　莫彼此相違，　　理應共和合。",
        "translation": "Now, I'll tell them what I privately harbor, and I'll tell them the truth; don't contradict each other; they should reasonably be united.",
        "source": "T04n0192_005:0053c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世尊在於世，　　常以忍辱教，　不順於聖教，　　云何名供養？",
        "translation": "When the Bhagavān was alive, he always taught patience, so what's the name of an offering if you don't follow the noble teaching?",
        "source": "T04n0192_005:0053c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世人以五欲，　　財利田宅諍，　若為正法者，　　應隨順聖理，　為法而結怨，　　此則理相違。",
        "translation": "\"People in the world argue about the five desires, wealth, profit, and possessions, but if someone were to follow the noble principle for the right teaching, then they would form enemies over the teaching, which is contrary to reason.",
        "source": "T04n0192_005:0053c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛寂靜慈悲，　　常欲安一切，　供養於大悲，　　而興於大害？",
        "translation": "Does the Buddha, who is quiescent and compassionate, always want to pacify all people, make offerings to great compassion, and then do great harm?",
        "source": "T04n0192_005:0053c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應等分舍利，　　普令得供養，　順法名稱流，　　義通理則宣。",
        "translation": "They should equally divide the relics, universally cause them to be offered, renounce the flow of the teaching in accordance with its name, and proclaim it when its meaning is shared with the principle.",
        "source": "T04n0192_005:0053c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若彼非法行，　　當以法和之，　是則為樂法，　　令法得久住。",
        "translation": "If someone does something that's not the Dharma, they should reconcile it with the Dharma, which is a pleasant Dharma, so that the Dharma can be sustained for a long time.",
        "source": "T04n0192_005:0053c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛說一切施，　　法施為最勝，　人斯行財施，　　行法施者難。」",
        "translation": "Of all the things the Buddha teaches about giving, the Dharma gift is the greatest, and it's difficult for people to give financially while giving Dharma.\"",
        "source": "T04n0192_005:0053c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　力士聞彼說，　　內愧互相視，　報彼梵志言：　　「深感汝來意，　親善順法言，　　和理雅正說，　梵志之所應，　　隨順自功德。",
        "translation": "When the strong man heard what he said, he looked at each other with shame and reported to the priest, saying, \"I deeply appreciate your intention to come, to speak well and in accord with the Dharma, to explain it correctly and in harmony with principle, and to accord with the merits of the priest.",
        "source": "T04n0192_005:0053c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善和於彼此，　　示我以要道，　如制迷塗馬，　　還得於正路。",
        "translation": "Well harmonizing with each other, you showed me the essential way, like a horse caught in a delusion that's been restrained and returned to the right path.",
        "source": "T04n0192_005:0053c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　今當用和理，　　從汝之所說，　誠言而不顧，　　後必生悔恨。」",
        "translation": "Now, I will use the principle of harmony and follow what you say, sincerely disregarding what I say, and then I'll surely become remorseful.\"",
        "source": "T04n0192_005:0054a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　即開佛舍利，　　等分為八分，　自供養一分，　　七分付梵志。",
        "translation": "He then opened the Buddha's relics and divided them equally into eight parts, making an offering of one part to himself and giving seven parts to the priests.",
        "source": "T04n0192_005:0054a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　七王得舍利，　　歡喜而頂受，　持歸還自國，　　起塔加供養。",
        "translation": "The seven kings who received the relic rejoiced and accepted it, returned it to their lands, raised a stūpa, and made offerings to it.",
        "source": "T04n0192_005:0054a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　梵志求力士，　　得分舍利瓶，　又從彼七王，　　求分第八分，　持歸起支提，　　號名金瓶塔。",
        "translation": "Seeking a strong man, the priest obtained a portion of the vial, and then he asked those seven kings for a portion of the eighth, returned it to his country, raised it, and called it the Golden Vase Pagoda.",
        "source": "T04n0192_005:0054a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　俱夷那竭人，　　聚集餘灰炭，　而起一支提，　　名曰灰炭塔。",
        "translation": "The Kauśinagara people gathered the remaining ashes and raised a stūpa, which was called the Ashes and Ashes Stūpa.",
        "source": "T04n0192_005:0054a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　八王起八塔，　　金瓶及灰炭，　如是閻浮提，　　始起於十塔。",
        "translation": "Eight kings raised eight stūpas, gold vases, and ashes, and so Jambudvīpa first arose from ten stūpas.",
        "source": "T04n0192_005:0054a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　舉國諸士女，　　悉持寶花蓋，　隨塔而供養，　　莊嚴若金山，　種種諸伎樂，　　晝夜長讚嘆。",
        "translation": "The country's women and men all carried jeweled flower canopies, followed the stūpas and made offerings, adorned them like gold mountains, and performed various tricks and music, and praised them day and night.",
        "source": "T04n0192_005:0054a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　時五百羅漢，　　永失大師蔭，　恇然無所恃，　　還耆闍崛山。",
        "translation": "Five hundred arhats then, having lost the shadow of the great teacher, returned to Mount Gṛdhrakūṭa, totally desolate and without any support.",
        "source": "T04n0192_005:0054a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　集彼帝釋巖，　　結集諸經藏，　一切皆共推，　　長老阿難陀，　如來前後說，　　巨細汝悉聞，　鞞提醯牟尼，　　當為大眾說。",
        "translation": "They gathered there at Indra's cave, assembled a collection of sūtras, and together they all esteemed the elder Ānanda, the Tathāgata who taught them before and after, and you've heard both the great and the small, Vaidehī Muni, who will explain them to the masses.",
        "source": "T04n0192_005:0054a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　阿難大眾中，　　昇於師子座，　如佛說而說，　　稱如是我聞。",
        "translation": "Ānanda ascended to the lion's seat among the great multitude, spoke as the Buddha had spoken, and declared, \"Thus have I heard.",
        "source": "T04n0192_005:0054a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　合坐悉涕流，　感此我聞聲，　　如法如其時，　如處如其人。",
        "translation": "They all burst into tears as they sat together, feeling that this is the sound I've heard, as the teaching was given at the right time, and as the person was given in the right place.",
        "source": "T04n0192_005:0054a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　隨說而筆受，　究竟成經藏，　　勤方便修學，　悉已得涅槃，　　今得及當得，　涅槃亦復然。",
        "translation": "They write and accept it as it's taught, thoroughly form the sūtra collection, diligently cultivate it with skill, and all have attained nirvāṇa, and so has nirvāṇa been attained now and will be attained in the future.",
        "source": "T04n0192_005:0054a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　無憂王出世，　強者能令憂，　　劣者為除憂，　如無憂花樹。",
        "translation": "The king of no sorrow appears in the world, a strong man who causes sorrow and a weak man who removes sorrow, like the tree of no sorrow.",
        "source": "T04n0192_005:0054b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　王於閻浮提，　心常無所憂，　　深信於正法，　故號無憂王。",
        "translation": "In Jambudvīpa, the king's mind is always without grief, and he has deep faith in the right teaching; therefore, he's called King Without Sorrows.",
        "source": "T04n0192_005:0054b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　孔雀之苗裔，　稟正性而生，　　普濟於天下，　兼起諸塔廟，　　本字強無憂，　今名法無憂。",
        "translation": "A sapling of the peacock, endowed with the right nature and born, he universally assists the world and erects stūpas and temples, whose original name is Keigo Wuzu and which is now called Dharma Wuzu.",
        "source": "T04n0192_005:0054b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　開彼七王塔，　以取於舍利，　　分布一旦起，　八萬四千塔。",
        "translation": "He opened seven of those stūpas to obtain the relics, and once they were distributed, 84,000 stūpas were erected.",
        "source": "T04n0192_005:0054b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　唯有第八塔，　在於摩羅村，　　神龍所守護，　王取不能得。",
        "translation": "Only the eighth stūpa, in the village of Malla, was guarded by a divine dragon, and the king couldn't obtain it.",
        "source": "T04n0192_005:0054b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　雖不得舍利，　知佛有遺骼，　　神龍所供養，　增其信敬心。",
        "translation": "Even though he couldn't obtain the relics, he knew the Buddha had legacy, and the gods and dragons made offerings to it, increasing his faith and respect.",
        "source": "T04n0192_005:0054b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　雖王領國土，　逮得初聖果，　　能令普天下，　供養如來塔，　　去來今現在，　悉皆得解脫。",
        "translation": "Even though the king leads his land and has attained the first noble fruit, he can cause the whole world to make offerings to the Tathāgata's stūpa, and they'll all attain liberation in the past and in the present.",
        "source": "T04n0192_005:0054b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如來現在世，　涅槃及舍利，　　恭敬供養者，　其福等無異。",
        "translation": "The Tathāgata is now in the world, and his nirvāṇa and relics are equally blessed when they're worshipped and offered up.",
        "source": "T04n0192_005:0054b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　明慧增上心，　深察如來德，　　懷道興供養，　其福亦俱勝。",
        "translation": "With insight and superior mind, they deeply perceive the Tathāgata's virtues, harbor the way and make offerings, and their merits are also superior.",
        "source": "T04n0192_005:0054b19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　佛得尊勝法，　應受一切供，　　已到不死處，　信者亦隨安，　　是故諸天人，　悉應常供養。",
        "translation": "The Buddha has attained a distinguished teaching, deserves all offerings, has reached the place of immortality, and follows those who believe in him with peace.",
        "source": "T04n0192_005:0054b21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　第一大慈悲，　　通達第一義，　度一切眾生，　　孰聞而不感。",
        "translation": "The supremely compassionate one who understands the supreme truth and liberates all sentient beings who hear it but don't feel it.",
        "source": "T04n0192_005:0054b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　生老病死苦，　　世間苦無過，　死苦苦之大，　　諸天之所畏。",
        "translation": "The suffering of birth, aging, illness, and death is unsurpassed in the world, and the pain of death is so great that it terrifies the gods.",
        "source": "T04n0192_005:0054b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　永離二種苦，　　云何不供養？",
        "translation": "Being permanently free of both kinds of suffering, why isn't it offered?",
        "source": "T04n0192_005:0054b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不受後有樂，　　世間樂無上，　增生苦之大，　　世間苦無比；　佛得離生苦，　　不受後有樂，　為世廣顯示，　　如何不供養？",
        "translation": "Not subject to pleasure in later existence, worldly pleasures are unsurpassed, and the suffering of increased birth is so great that it has no parallel in the world; the Buddha is freed from the suffering of birth, not subject to pleasure in later existence, and is widely revealed for the world, so how can we not make offerings?",
        "source": "T04n0192_005:0054c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　讚諸牟尼尊，　　始終之所行，　不自顯知見，　　亦不求名利，　隨順佛經說，　　以濟諸世間。",
        "translation": "\"Praise be to the venerable Muni, who from beginning to end conducts himself, doesn't reveal his own knowledge and views, doesn't seek fame and profit, and follows the teachings of the sutras to help the world.",
        "source": "T04n0192_005:0054c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛所行讚卷第五",
        "translation": "Buddhacarita, Volume 5",
        "source": "T04n0192_005:0054c08_0",
        "is_bad_quality": false
    }
]