[
    {
        "source_sentence": "大般若波羅蜜多經卷第九十四",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 94",
        "source": "T05n0220_094:0520c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T05n0220_094:0520c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初分求般若品第二十七之六",
        "translation": "First Part of the Twenty-seventh Chapter of the Search for Prajñāpāramitā",
        "source": "T05n0220_094:0520c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，具壽善現復告天帝釋言：「憍尸迦！",
        "translation": "At that point, Kauśāmbī also addressed Śakra, saying, \"Kauśika!",
        "source": "T05n0220_094:0520c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝先所問菩薩摩訶薩所行般若波羅蜜多當於何求者，憍尸迦！",
        "translation": "\"You asked earlier what the bodhisattva Mahāsattva's practice of prajñāpāramitā should be in pursuit of, Kauśika!",
        "source": "T05n0220_094:0520c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於色求，不應於受、想、行、識求；不應離色求，不應離受、想、行、識求。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, shouldn't seek form, shouldn't seek sensation, perception, volition, and consciousness, and shouldn't seek form apart from form or seek sensation, perception, volition, and consciousness apart from form.",
        "source": "T05n0220_094:0521a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0521a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色，若受、想、行、識，若離色，若離受、想、行、識，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If form, if feeling, perception, volition, and consciousness, if they are free of form, if they are free of feeling, perception, volition, and consciousness, if they are bodhisattvas, if they are prajñāpāramitās, and if they are sought to be like this, they are all neither associated nor unassociated, neither with nor without form, neither with nor without views, and neither with nor without objections, all having the same characteristics, which is called formless.",
        "source": "T05n0220_094:0521a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0521a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0521a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非色，非受、想、行、識；非離色，非離受、想、行、識。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, is not form, not feeling, perception, volition, or consciousness; it's not free of form, and it's not free of feeling, perception, volition, or consciousness.",
        "source": "T05n0220_094:0521a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0521a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "Thus, all of them are lacking in the nature of being and are unobtainable.",
        "source": "T05n0220_094:0521a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非色，非受、想、行、識；非離色，非離受、想、行、識。",
        "translation": "Because [their] nonexistence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, is not form, not feeling, perception, volition, and consciousness; it's not free of form and not free of feeling, perception, volition, and consciousness.",
        "source": "T05n0220_094:0521a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於色求，不應於受、想、行、識求；不應離色求，不應離受、想、行、識求。",
        "translation": "Therefore, the prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, shouldn't seek form, shouldn't seek sensation, perception, volition, and consciousness, and shouldn't seek form apart from form or seek sensation, perception, volition, and consciousness apart from form.",
        "source": "T05n0220_094:0521a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0521a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於眼處求，不應於耳、鼻、舌、身、意處求；不應離眼處求，不應離耳、鼻、舌、身、意處求。",
        "translation": "The prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't be sought in the place of the eye, not in the place of the ear, nose, tongue, body, or mind; it shouldn't be sought apart from the place of the eye, and it shouldn't be sought apart from the place of the ear, nose, tongue, body, or mind.",
        "source": "T05n0220_094:0521a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0521a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼處，若耳、鼻、舌、身、意處，若離眼處，若離耳、鼻、舌、身、意處，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If it's the place of the eye, if it's the ear, nose, tongue, body, or mind, if it's free of the eye, if it's free of the ear, nose, tongue, body, or mind, if it's a bodhisattva, if it's the prajñāpāramitā, or if it's sought to be like this, they are all neither associated nor unassociated, neither colored nor formless, neither seen nor unseen, and neither opposed nor unopposed, all having the same characteristics, which is called formless.",
        "source": "T05n0220_094:0521a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0521a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0521a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非眼處，非耳、鼻、舌、身、意處；非離眼處，非離耳、鼻、舌、身、意處。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas and mahāsattvas is not the locus of the eye, not the locus of the ear, nose, tongue, body, or mind; it's not apart from the locus of the eye, and it's not apart from the locus of the ear, nose, tongue, body, or mind.",
        "source": "T05n0220_094:0521a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0521a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "Thus, all of them are lacking in the nature of being and are unobtainable.",
        "source": "T05n0220_094:0521a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非眼處，非耳、鼻、舌、身、意處；非離眼處，非離耳、鼻、舌、身、意處。",
        "translation": "Because nonexistence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas is not for the eye, not for the ear, nose, tongue, body, or mind, and not apart from the eye or apart from the ear, nose, tongue, body, or mind.",
        "source": "T05n0220_094:0521a27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於眼處求，不應於耳、鼻、舌、身、意處求；不應離眼處求，不應離耳、鼻、舌、身、意處求。",
        "translation": "Therefore, the prajñāpāramitā practiced by the bodhisattvas and mahāsattvas shouldn't be sought in the place of the eye, not in the place of the ear, nose, tongue, body, or mind, and not apart from the place of the eye or apart from the place of the ear, nose, tongue, body, or mind.",
        "source": "T05n0220_094:0521b01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0521b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於色處求，不應於聲、香、味、觸、法處求；不應離色處求，不應離聲、香、味、觸、法處求。",
        "translation": "The prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't be sought in the place of form, or in the place of sound, odor, taste, touch, or dharma; they shouldn't be sought apart from the place of form, and they shouldn't be sought apart from the place of sound, odor, taste, touch, or dharma.",
        "source": "T05n0220_094:0521b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0521b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色處，若聲、香、味、觸、法處，若離色處，若離聲、香、味、觸、法處，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If there's a place of form, if there's a place of sound, odor, taste, touch, and dharma, if there's a place free of form, if there's a place free of sound, odor, taste, touch, and dharma, if it's a bodhisattva, if it's the prajñāpāramitā, and if it's sought to be like this, they are all neither associated nor unassociated, neither with nor without form, neither with nor without views, neither with nor without views, and neither with nor without opposites, all have the same characteristic, which is called no characteristic.",
        "source": "T05n0220_094:0521b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0521b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0521b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非色處，非聲、香、味、觸、法處；非離色處，非離聲、香、味、觸、法處。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas and mahāsattvas is not the locus of form, not the locus of sound, odor, taste, touch, or dharma, and not free of form or the locus of sound, odor, taste, touch, or dharma.",
        "source": "T05n0220_094:0521b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0521b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "Thus, all of them are lacking in the nature of ownership and are unobtainable.",
        "source": "T05n0220_094:0521b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非色處，非聲、香、味、觸、法處；非離色處，非離聲、香、味、觸、法處。",
        "translation": "Because [their] nonexistence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas and mahāsattvas is not in the place of form, not in the place of sound, odor, taste, touch, or dharma, and not apart from the place of form or apart from the place of sound, odor, taste, touch, or dharma.",
        "source": "T05n0220_094:0521b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於色處求，不應於聲、香、味、觸、法處求；不應離色處求，不應離聲、香、味、觸、法處求。",
        "translation": "Therefore, the prajñāpāramitā practiced by the bodhisattvas and mahāsattvas shouldn't be sought in the place of form, not in the place of sound, odor, taste, touch, or dharma, and not apart from the place of form or apart from the place of sound, odor, taste, touch, or dharma.",
        "source": "T05n0220_094:0521b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0521b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於眼界求，不應於色界、眼識界及眼觸、眼觸為緣所生諸受求；不應離眼界求，不應離色界乃至眼觸為緣所生諸受求。",
        "translation": "\"When the bodhisattva Mahāsattva practices the perfection of wisdom, he shouldn't seek it in the eye realm, shouldn't seek it in the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as a condition; he shouldn't seek it apart from the eye realm, and he shouldn't seek it apart from the form realm or even the sensations that arise from eye contact as a condition.",
        "source": "T05n0220_094:0521b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0521b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼界，若色界乃至眼觸為緣所生諸受，若離眼界，若離色界乃至眼觸為緣所生諸受，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If the eye realm, if the form realm, or even the sensations that arise from visual contact as a condition, if it's free of the eye realm, if it's free of the form realm, or even the sensations that arise from visual contact as a condition, if it's a bodhisattva, if it's the prajñāpāramitā, or if it's sought to be like this, they are all neither associated nor unassociated, neither colored nor formless, neither seen nor unseen, and neither opposed nor opposed, all have the same characteristic, which is called no characteristic.",
        "source": "T05n0220_094:0521b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0521c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0521c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非眼界，非色界、眼識界及眼觸、眼觸為緣所生諸受；非離眼界，非離色界乃至眼觸為緣所生諸受。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas and mahāsattvas is not the element of the eye, not the element of form, not the element of visual consciousness, and not sensations that arise from eye contact or eye contact as a condition; it's not sensations that arise apart from the element of the eye, not apart from the element of form, or even from eye contact as a condition.",
        "source": "T05n0220_094:0521c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0521c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "Thus, all of them are inapprehensible in their lack of existence.",
        "source": "T05n0220_094:0521c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非眼界，非色界乃至眼觸為緣所生諸受；非離眼界，非離色界乃至眼觸為緣所生諸受。",
        "translation": "Because nonexistence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas and mahāsattvas isn't the eye realm, isn't the form realm or even the sensations that arise from the condition of eye contact, and isn't free of the eye realm or the form realm or even the sensations that arise from the condition of eye contact.",
        "source": "T05n0220_094:0521c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於眼界求，不應於色界乃至眼觸為緣所生諸受求；不應離眼界求，不應離色界乃至眼觸為緣所生諸受求。",
        "translation": "Therefore, the prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't seek it in the eye realm, shouldn't seek it in the form realm or even the sensations that arise from the condition of eye contact, and shouldn't seek it apart from the eye realm or from the sensations that arise from the form realm or even the condition of eye contact.",
        "source": "T05n0220_094:0521c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0521c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於耳界求，不應於聲界、耳識界及耳觸、耳觸為緣所生諸受求；不應離耳界求，不應離聲界乃至耳觸為緣所生諸受求。",
        "translation": "When the bodhisattva Mahāsattva practices the perfection of wisdom, he shouldn't seek it in the ear realm, shouldn't seek it in the sound realm, the ear-consciousness realm, and the sensations that arise from ear contact and ear contact as perceptual objects; he shouldn't seek it apart from the ear realm, and he shouldn't seek it apart from the sound realm or even the sensations that arise from ear contact as perceptual objects.",
        "source": "T05n0220_094:0521c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0521c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若耳界，若聲界乃至耳觸為緣所生諸受，若離耳界，若離聲界乃至耳觸為緣所生諸受，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If the ear realm, if the sound realm, or even the sensations that arise from ear contact as a condition, if they are free of the ear realm, if they are free of the sound realm or even the sensations that arise from ear contact as a condition, if they are bodhisattvas, if they are prajñāpāramitās, or if they seek to do so, they are all neither associated nor unassociated, neither colored nor formless, neither seen nor unseen, and neither opposed nor opposing, all have the same characteristic, which is called no characteristic.",
        "source": "T05n0220_094:0521c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0521c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0521c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非耳界，非聲界、耳識界及耳觸、耳觸為緣所生諸受；非離耳界，非離聲界乃至耳觸為緣所生諸受。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas and mahāsattvas is not the ear realm, not the sound realm, not the ear-consciousness realm, not the sensations that arise from ear contact and ear contact as a condition, and not sensations that arise apart from the ear realm, not apart from the sound realm, and not even those that arise from ear contact as a condition.",
        "source": "T05n0220_094:0521c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0521c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "Thus, all of them are inapprehensible as non-existent.",
        "source": "T05n0220_094:0521c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非耳界，非聲界乃至耳觸為緣所生諸受；非離耳界，非離聲界乃至耳觸為緣所生諸受。",
        "translation": "Because [their] nonexistence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas and mahāsattvas isn't the ear realm, isn't the sound realm or even the sensations that arise from ear-contact as a condition, and isn't free of the ear realm or the sensations that arise from the sound realm or even the sensations that arise from ear-contact as a condition.",
        "source": "T05n0220_094:0521c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於耳界求，不應於聲界乃至耳觸為緣所生諸受求；不應離耳界求，不應離聲界乃至耳觸為緣所生諸受求。",
        "translation": "Therefore, the prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't seek it in the ear realm, shouldn't seek it in the sound realm or even the sensations that arise from the conditions of ear contact, and shouldn't seek it apart from the ear realm or the sensations that arise from the sound realm or even the conditions of ear contact.",
        "source": "T05n0220_094:0522a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0522a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於鼻界求，不應於香界、鼻識界及鼻觸、鼻觸為緣所生諸受求；不應離鼻界求，不應離香界乃至鼻觸為緣所生諸受求。",
        "translation": "\"When the bodhisattva Mahāsattva practices the perfection of wisdom, he shouldn't seek it in the nasal realm, shouldn't seek it in the sense realm of fragrance, the sense realm of nasal consciousness, and the sensations that arise from nasal contact and nasal contact as perceptual objects; he shouldn't seek it apart from the nasal realm, and he shouldn't seek it apart from the sense realm of fragrance and even the sensations that arise from nasal contact as perceptual objects.",
        "source": "T05n0220_094:0522a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0522a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若鼻界，若香界乃至鼻觸為緣所生諸受，若離鼻界，若離香界乃至鼻觸為緣所生諸受，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If the nasal realm, if the fragrance realm, or even the sensations that arise from nasal contact as a condition, if it's free of the nasal realm, if it's free of the fragrance realm, or even the sensations that arise from nasal contact as a condition, if it's the bodhisattva, if it's the prajñāpāramitā, or if it's sought to be like this, they are all neither associated nor unassociated, neither colored nor formless, neither seen nor unseen, and neither opposed nor opposed, all have the same characteristic, which is called no characteristic.",
        "source": "T05n0220_094:0522a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0522a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0522a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非鼻界，非香界、鼻識界及鼻觸、鼻觸為緣所生諸受；非離鼻界，非離香界乃至鼻觸為緣所生諸受。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas and mahāsattvas is not the nasal realm, not the fragrance realm, not the nasal consciousness realm, and not sensations that arise from nasal contact or nasal contact as a condition; it's not sensations that arise apart from the nasal realm, not apart from the fragrance realm, and not even those that arise from nasal contact as a condition.",
        "source": "T05n0220_094:0522a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0522a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "\"Thus, all of these things are lacking in the nature of being and cannot be obtained.",
        "source": "T05n0220_094:0522a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非鼻界，非香界乃至鼻觸為緣所生諸受；非離鼻界，非離香界乃至鼻觸為緣所生諸受。",
        "translation": "Because [their] nonexistence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, isn't the nasal realm, isn't the fragrance realm, and isn't based on sensations that arise from nasal contact; it's not free of the nasal realm, isn't free of the fragrance realm, and isn't based on sensations that arise from nasal contact.",
        "source": "T05n0220_094:0522a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於鼻界求，不應於香界乃至鼻觸為緣所生諸受求；不應離鼻界求，不應離香界乃至鼻觸為緣所生諸受求。",
        "translation": "Therefore, the prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't seek it in the nasal realm, shouldn't seek it in the fragrant realm or even the sensations that arise from the condition of nasal contact, and shouldn't seek it apart from the nasal realm or from the fragrant realm or the sensations that arise from the condition of nasal contact.",
        "source": "T05n0220_094:0522a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0522a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於舌界求，不應於味界、舌識界及舌觸、舌觸為緣所生諸受求；不應離舌界求，不應離味界乃至舌觸為緣所生諸受求。",
        "translation": "The prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't seek it in the tongue realm, shouldn't seek it in the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact as a condition; they shouldn't seek it apart from the tongue realm, and they shouldn't seek it apart from the taste realm or the sensations that arise from tongue contact as a condition.",
        "source": "T05n0220_094:0522a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0522b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若舌界，若味界乃至舌觸為緣所生諸受，若離舌界，若離味界乃至舌觸為緣所生諸受，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If the tongue realm, if the taste realm, or even the sensations that arise from tongue contact as a condition, if it's free of the tongue realm, if it's free of the taste realm, or even the sensations that arise from tongue contact as a condition, if it's the bodhisattva, if it's the prajñāpāramitā, or if it's sought to be like this, they are all neither associated nor unassociated, neither colored nor formless, neither seen nor unseen, and neither opposed nor opposed, all having the same characteristics, which is called having no characteristics.",
        "source": "T05n0220_094:0522b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0522b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0522b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非舌界，非味界、舌識界及舌觸、舌觸為緣所生諸受；非離舌界，非離味界乃至舌觸為緣所生諸受。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas and mahāsattvas is not the tongue realm, not the taste realm, not the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact as a condition; it's not sensations that arise apart from the tongue realm, not apart from the taste realm, or even from tongue contact as a condition.",
        "source": "T05n0220_094:0522b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0522b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "Thus, all of them are inapprehensible in their lack of existence.",
        "source": "T05n0220_094:0522b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非舌界，非味界乃至舌觸為緣所生諸受；非離舌界，非離味界乃至舌觸為緣所生諸受。",
        "translation": "Because [their] nonexistence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, isn't the tongue realm, isn't the taste realm, or even the sensations that arise from tongue contact as a condition; it's not free of the tongue realm, isn't free of the taste realm, or even the sensations that arise from tongue contact as a condition.",
        "source": "T05n0220_094:0522b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於舌界求，不應於味界乃至舌觸為緣所生諸受求；不應離舌界求，不應離味界乃至舌觸為緣所生諸受求。",
        "translation": "Therefore, the prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't seek it in the tongue realm, shouldn't seek it in the taste realm or even the sensations that arise from the condition of tongue contact, and shouldn't seek it apart from the tongue realm or from the sensations that arise from the taste realm or even the condition of tongue contact.",
        "source": "T05n0220_094:0522b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0522b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於身界求，不應於觸界、身識界及身觸、身觸為緣所生諸受求；不應離身界求，不應離觸界乃至身觸為緣所生諸受求。",
        "translation": "The bodhisattvas, mahāsattvas, and practitioners of the perfection of wisdom shouldn't seek them in the body realm, shouldn't seek them in the sense realm of contact, the sense realm of body consciousness, and the sensations that arise from body contact and body contact as a condition; they shouldn't seek them apart from the body realm, and they shouldn't seek them apart from the sense realm of contact or even the sensations that arise from body contact as a condition.",
        "source": "T05n0220_094:0522b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0522b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若身界，若觸界乃至身觸為緣所生諸受，若離身界，若離觸界乃至身觸為緣所生諸受，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If the body realm, if the touch realm, or even the sensations that arise from the condition of body contact, if the body realm is removed, if the touch realm is removed, or even the sensations that arise from the condition of body contact, or if the bodhisattva, the Mahāsattva, or the prajñāpāramitā is sought, all are neither associated nor unassociated, neither colored nor formless, neither seen nor unseen, and neither opposed nor opposed, and all have the same characteristics, which is called no characteristics.",
        "source": "T05n0220_094:0522b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0522b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0522b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非身界，非觸界、身識界及身觸、身觸為緣所生諸受；非離身界，非離觸界乃至身觸為緣所生諸受。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas and mahāsattvas is not the body realm, not the tactile realm, not the body-consciousness realm, and not sensations that arise from bodily contact or bodily contact as a condition; it's not free of the body realm, not free of the tactile realm, and not sensations that arise from bodily contact as a condition.",
        "source": "T05n0220_094:0522b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0522c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "Thus, all of them are inapprehensible in their lack of existence.",
        "source": "T05n0220_094:0522c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非身界，非觸界乃至身觸為緣所生諸受；非離身界，非離觸界乃至身觸為緣所生諸受。",
        "translation": "Because [their] nonexistence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas and mahāsattvas isn't the body realm, isn't the contact realm or the sensations that arise from the condition of body contact, and isn't free of the body realm or the sensations that arise from the contact realm or the condition of body contact.",
        "source": "T05n0220_094:0522c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於身界求，不應於觸界乃至身觸為緣所生諸受求；不應離身界求，不應離觸界乃至身觸為緣所生諸受求。",
        "translation": "Therefore, the prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't seek it in the body realm, shouldn't seek it in the sense of touch or the sensations that arise from the cognition of body contact, and shouldn't seek it apart from the body realm or apart from the sense of touch or the sensations that arise from the cognition of body contact.",
        "source": "T05n0220_094:0522c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0522c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於意界求，不應於法界、意識界及意觸、意觸為緣所生諸受求；不應離意界求，不應離法界乃至意觸為緣所生諸受求。",
        "translation": "The prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't seek it in the mind realm, shouldn't seek it in the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as a condition; they shouldn't seek it apart from the mind realm, and they shouldn't seek it apart from the Dharma realm or even the sensations that arise from mental contact as a condition.",
        "source": "T05n0220_094:0522c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0522c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若意界，若法界乃至意觸為緣所生諸受，若離意界，若離法界乃至意觸為緣所生諸受，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If the mind realm, if the Dharma realm, or even the sensations that arise from mental contact as a condition, if it's free of the mind realm, if it's free of the Dharma realm or even the sensations that arise from mental contact as a condition, if it's a bodhisattva, if it's the prajñāpāramitā, or if it's sought to be like this, they are all neither associated nor unassociated, neither colored nor formless, neither seen nor unseen, and neither opposed nor opposed, all having the same characteristics, which is called formless.",
        "source": "T05n0220_094:0522c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0522c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0522c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非意界，非法界、意識界及意觸、意觸為緣所生諸受；非離意界，非離法界乃至意觸為緣所生諸受。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas and mahāsattvas is not the mind realm, not the nonmind realm, the consciousness realm, or the sensations that arise from mind contact or mind contact as a condition; it's not free of the mind realm, not free of the Dharma realm, or the sensations that arise from mind contact as a condition.",
        "source": "T05n0220_094:0522c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0522c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "\"Thus, all of these things are inapprehensible as being without existence.",
        "source": "T05n0220_094:0522c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非意界，非法界乃至意觸為緣所生諸受；非離意界，非離法界乃至意觸為緣所生諸受。",
        "translation": "Because [their] nonexistence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas and mahāsattvas isn't the mind realm, isn't the mind realm, or even the sensations that arise from the condition of mental contact; it's not free of the mind realm, or free of the Dharma realm or the sensations that arise from the condition of mental contact.",
        "source": "T05n0220_094:0522c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於意界求，不應於法界乃至意觸為緣所生諸受求；不應離意界求，不應離法界乃至意觸為緣所生諸受求。",
        "translation": "Therefore, the prajñāpāramitā practiced by the bodhisattvas and mahāsattvas shouldn't seek it in the mental realm, shouldn't seek it in the Dharma realm or even the sensations that arise from the condition of mental contact, and shouldn't seek it apart from the mental realm or apart from the sensations that arise from the Dharma realm or even the condition of mental contact.",
        "source": "T05n0220_094:0522c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0523a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於地界求，不應於水、火、風、空、識界求；不應離地界求，不應離水、火、風、空、識界求。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, shouldn't seek it in the earth realm, shouldn't seek it in the water, fire, wind, air, and consciousness realms, and shouldn't seek it apart from the earth realm or away from the water, fire, wind, air, and consciousness realms.",
        "source": "T05n0220_094:0523a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0523a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若地界，若水、火、風、空、識界，若離地界，若離水、火、風、空、識界，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If the earth realm, if the water, fire, wind, air, and consciousness realms, if they are free of the earth realm, if they are free of the water, fire, wind, air, and consciousness realms, if they are bodhisattvas, if they are prajñāpāramitās, and if they seek to do so, they are all neither associated nor unassociated, neither colored nor formless, neither seen nor unseen, and neither opposed nor unopposed, all have the same characteristic, which is called no characteristic.",
        "source": "T05n0220_094:0523a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0523a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0523a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非地界，非水、火、風、空、識界；非離地界，非離水、火、風、空、識界。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas and mahāsattvas is not of the earth realm, not of the water, fire, wind, air, or consciousness realm, and not free of the earth realm or the water, fire, wind, air, or consciousness realm.",
        "source": "T05n0220_094:0523a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0523a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "Thus, all of them are lacking in the nature of ownership and are unobtainable.",
        "source": "T05n0220_094:0523a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非地界，非水、火、風、空、識界；非離地界，非離水、火、風、空、識界。",
        "translation": "Because [their] nonexistence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas Mahāsattvas is not of the earth realm, not of the water, fire, wind, air, space, and consciousness realms, and not free of the earth realm or the water, fire, wind, air, space, or consciousness realms.",
        "source": "T05n0220_094:0523a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於地界求，不應於水、火、風、空、識界求；不應離地界求，不應離水、火、風、空、識界求。",
        "translation": "Therefore, the prajñāpāramitā practiced by the bodhisattvas Mahāsattvas shouldn't be sought in the earth realm, shouldn't be sought in the water, fire, wind, air, and consciousness realms, and shouldn't be sought apart from the earth realm or apart from the water, fire, wind, air, and consciousness realms.",
        "source": "T05n0220_094:0523a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0523a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於苦聖諦求，不應於集、滅、道聖諦求；不應離苦聖諦求，不應離集、滅、道聖諦求。",
        "translation": "The prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't seek it in the noble truth of suffering, shouldn't seek it in the noble truths of arising, ceasing, and the path, and shouldn't seek it apart from the noble truth of suffering or the noble truths of arising, ceasing, and the path.",
        "source": "T05n0220_094:0523a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0523a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若苦聖諦，若集、滅、道聖諦，若離苦聖諦，若離集、滅、道聖諦，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If it's the noble truth of suffering, if it's the noble truth of arising, ceasing, and the path, if it's the noble truth of freedom from suffering, if it's the noble truth of freedom from arising, ceasing, and the path, if it's the bodhisattva, if it's the prajñāpāramitā, and if it's sought to be like this, they are all neither associated nor unassociated, neither colored nor formless, neither seen nor unseen, nor opposed nor unopposed, and they all have the same characteristics, which is called no characteristics.",
        "source": "T05n0220_094:0523a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0523a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0523a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非苦聖諦，非集、滅、道聖諦；非離苦聖諦，非離集、滅、道聖諦。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas and mahāsattvas is not the noble truth of suffering, not the noble truth of accumulation, cessation, and the path, and it's not free of the noble truth of suffering or the noble truth of accumulation, cessation, or the path.",
        "source": "T05n0220_094:0523a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0523b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "Thus, all of them are lacking in the nature of being and are unobtainable.",
        "source": "T05n0220_094:0523b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非苦聖諦，非集、滅、道聖諦；非離苦聖諦，非離集、滅、道聖諦。",
        "translation": "Because [their] lack of existence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas and mahāsattvas is not the noble truth of suffering, not the noble truth of arising, ceasing, and the path, and not free of the noble truth of suffering or the noble truth of arising, ceasing, and the path.",
        "source": "T05n0220_094:0523b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於苦聖諦求，不應於集、滅、道聖諦求；不應離苦聖諦求，不應離集、滅、道聖諦求。",
        "translation": "Therefore, the prajñāpāramitā practiced by the bodhisattvas and mahāsattvas shouldn't seek it in the noble truth of suffering, shouldn't seek it in the noble truth of arising, ceasing, and the path, and shouldn't seek it apart from the noble truth of suffering or apart from the noble truths of arising, ceasing, and the path.",
        "source": "T05n0220_094:0523b04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0523b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於無明求，不應於行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱求；不應離無明求，不應離行乃至老死愁歎苦憂惱求。",
        "translation": "\"When the bodhisattva Mahāsattva practices the perfection of wisdom, he shouldn't seek it in nescience; he shouldn't seek it in form, consciousness, name-and-form, the six sense-fields, contact, feeling, craving, grasping, existence, birth, and the grief and sorrow of old age and death; he shouldn't seek it apart from nescience, and he shouldn't seek it apart from form and even the grief and sorrow of old age and death.",
        "source": "T05n0220_094:0523b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0523b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無明，若行乃至老死愁歎苦憂惱，若離無明，若離行乃至老死愁歎苦憂惱，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If there's nescience, if there's practice ... sorrow and suffering and distress in old age and death, if they're free of nescience, if they're free of practice ... sorrow and suffering and distress in old age and death, if they're bodhisattvas, if they're prajñāpāramitā, and if they seek to do so, they are all neither associated nor unassociated, neither colored nor formless, neither seen nor unseen, nor opposed nor unopposed, and they all have the same characteristics, which is called formlessness.",
        "source": "T05n0220_094:0523b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0523b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0523b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非無明，非行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱；非離無明，非離行乃至老死愁歎苦憂惱。",
        "translation": "\"The prajñāpāramitā practiced by the bodhisattvas and mahāsattvas is not nescience, not form, consciousness, name-and-form, the six sense-fields, touch, feeling, craving, grasping, existence, birth, sorrow and suffering of old age and death, and not free of nescience, not free of form and even sorrow and suffering of old age and death.",
        "source": "T05n0220_094:0523b17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0523b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "\"Thus, all of these things are lacking in their own nature and are unobtainable.",
        "source": "T05n0220_094:0523b20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非無明，非行乃至老死愁歎苦憂惱；非離無明，非離行乃至老死愁歎苦憂惱。",
        "translation": "Because nonexistence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas and mahāsattvas isn't nescience, isn't practice, and isn't followed by sorrow and pain and vexation of old age and death; it's not free of nescience and isn't free of sorrow and pain and vexation of practice and old age and death.",
        "source": "T05n0220_094:0523b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於無明求，不應於行乃至老死愁歎苦憂惱求；不應離無明求，不應離行乃至老死愁歎苦憂惱求。",
        "translation": "Therefore, the prajñāpāramitā practiced by the bodhisattvas and mahāsattvas shouldn't seek it in ignorance, shouldn't seek it in the formative forces or even in the sorrow and suffering and distress of old age and death, and shouldn't seek it apart from ignorance or apart from the sorrow and suffering and distress of formative forces or even old age and death.",
        "source": "T05n0220_094:0523b24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0523b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於內空求，不應於外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空求；不應離內空求，不應離外空乃至無性自性空求。",
        "translation": "The prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't seek internal emptiness, external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, endless emptiness, dispersed emptiness, unchanging emptiness, emptiness of original nature, emptiness of own-identity, emptiness of shared characteristics, emptiness of all things, inaccessible emptiness, emptiness of naturelessness, self-nature, and emptiness of naturelessness; they shouldn't seek emptiness apart from internal emptiness, and they shouldn't seek emptiness apart from external emptiness or even emptiness of naturelessness of self-nature.",
        "source": "T05n0220_094:0523b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0523c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若內空，若外空乃至無性自性空，若離內空，若離外空乃至無性自性空，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If it's internal emptiness, if it's external emptiness or even emptiness of a natureless self-nature, if it's free of internal emptiness, if it's free of external emptiness or even emptiness of a natureless self-nature, if it's the bodhisattva, if it's the prajñāpāramitā, and if it's sought to be like this, they are all neither associated nor unassociated, neither colored nor formless, neither seen nor unseen, nor opposed nor unopposed, and they all have the same characteristics, which is called formlessness.",
        "source": "T05n0220_094:0523c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0523c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0523c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非內空，非外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空；非離內空，非離外空乃至無性自性空。",
        "translation": "The prajñāpāramitā practiced by bodhisattvas and mahāsattvas is not internal emptiness, not external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, existent emptiness, impermanent emptiness, dispersed emptiness, immutable emptiness, originally existent emptiness, emptiness of own-form, emptiness of shared form, emptiness of all things, inaccessible emptiness, emptiness of nature, emptiness of self-nature, emptiness of self-nature, and emptiness of natureless self-nature; it's not devoid of internal emptiness, not devoid of external emptiness, and even emptiness of natureless self-nature.",
        "source": "T05n0220_094:0523c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0523c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "Thus, all of them are lacking in the nature of self-nature and are unobtainable.",
        "source": "T05n0220_094:0523c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非內空，非外空乃至無性自性空；非離內空，非離外空乃至無性自性空。",
        "translation": "Because [their] lack of existence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, is not internal emptiness, not external emptiness, or even emptiness of a natureless nature; it's not free from internal emptiness, not free from external emptiness, or even emptiness of a natureless nature.",
        "source": "T05n0220_094:0523c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於內空求，不應於外空乃至無性自性空求；不應離內空求，不應離外空乃至無性自性空求。",
        "translation": "Therefore, the prajñāpāramitā practiced by the bodhisattvas Mahāsattvas shouldn't be sought in internal emptiness, shouldn't be sought in external emptiness or even the emptiness of a natureless self-nature, and shouldn't be sought apart from internal emptiness or apart from external emptiness or even the emptiness of a natureless self-nature.",
        "source": "T05n0220_094:0523c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0523c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於真如求，不應於法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界求；不應離真如求，不應離法界乃至不思議界求。",
        "translation": "The prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't seek it in the true nature, not in the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from birth, legality, Dharma abiding, reality, the space realm, or the inconceivable realm; they shouldn't seek it apart from the true nature, and they shouldn't seek it apart from the Dharma realm or even the inconceivable realm.",
        "source": "T05n0220_094:0523c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0523c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若真如，若法界乃至不思議界，若離真如，若離法界乃至不思議界，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If it's true, if it's the Dharma realm or even the inconceivable realm, if it's free of true, if it's free of the Dharma realm or even the inconceivable realm, if it's a bodhisattva, if it's the perfection of wisdom, and if it's sought to be like this, they are all neither associated nor unassociated, neither colored nor formless, neither seen nor unseen, and neither opposed nor unopposed, all having the same characteristics, which is called formlessness.",
        "source": "T05n0220_094:0523c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0524a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0524a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非真如，非法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界；非離真如，非離法界乃至不思議界。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, is not true, not the realm of Dharma, the nature of Dharma, not false, unchanging, different, equal, free from birth, legal, Dharma-abiding, real, space, or inconceivable; it's not free from true, not free from the realm of Dharma, or even the inconceivable realm.",
        "source": "T05n0220_094:0524a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0524a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "\"Thus, all of them are lacking in the nature of being and are unobtainable.",
        "source": "T05n0220_094:0524a08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非真如，非法界乃至不思議界；非離真如，非離法界乃至不思議界。",
        "translation": "Because [their] nonexistence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, is not the true thusness, not the unenlightened realm, or even the inconceivable realm; it's not apart from the true thusness, not apart from the dharma realm or even the inconceivable realm.",
        "source": "T05n0220_094:0524a09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於真如求，不應於法界乃至不思議界求；不應離真如求，不應離法界乃至不思議界求。",
        "translation": "Therefore, the prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, shouldn't seek it in the true nature, shouldn't seek it in the Dharma realm or even the inconceivable realm, and shouldn't seek it apart from the true nature or apart from the Dharma realm or even the inconceivable realm.",
        "source": "T05n0220_094:0524a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0524a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於布施波羅蜜多求，不應於淨戒、安忍、精進、靜慮、般若波羅蜜多求；不應離布施波羅蜜多求，不應離淨戒、安忍、精進、靜慮、般若波羅蜜多求。",
        "translation": "The prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't seek the prajñāpāramitā of generosity; they shouldn't seek the prajñāpāramitā of pure morality, patience, effort, meditation, or prajñāpāramitā; they shouldn't seek it apart from the prajñāpāramitā of generosity; and they shouldn't seek it apart from the prajñāpāramitā of pure morality, patience, effort, meditation, or prajñāpāramitā.",
        "source": "T05n0220_094:0524a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0524a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若布施波羅蜜多，若淨戒、安忍、精進、靜慮、般若波羅蜜多，若離布施波羅蜜多，若離淨戒、安忍、精進、靜慮、般若波羅蜜多，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If the perfection of generosity, if pure morality, patience, effort, meditation, and the perfection of wisdom are practiced, if the perfection of generosity is abandoned, if pure morality, patience, effort, meditation, and the perfection of wisdom are abandoned, and if the bodhisattva, Mahāsattva, and the perfection of wisdom are sought, all are neither associated nor unassociated, neither colored nor formless, neither seen nor unseen, and neither opposed nor unopposed, and all have the same characteristics, which is called formlessness.",
        "source": "T05n0220_094:0524a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0524a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0524a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非布施波羅蜜多，非淨戒、安忍、精進、靜慮、般若波羅蜜多；非離布施波羅蜜多，非離淨戒、安忍、精進、靜慮、般若波羅蜜多。",
        "translation": "The prajñāpāramitā practiced by bodhisattvas and mahāsattvas isn't the prajñāpāramitā of generosity, the prajñāpāramitā of pure morality, peaceful tolerance, effort, meditation, and prajñāpāramitā, and it's not free of the prajñāpāramitā of generosity or the prajñāpāramitā of pure morality, peaceful tolerance, effort, meditation, and prajñāpāramitā.",
        "source": "T05n0220_094:0524a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0524a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "\"Thus, all of these things are inapprehensible because they lack existence.",
        "source": "T05n0220_094:0524a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非布施波羅蜜多，非淨戒、安忍、精進、靜慮、般若波羅蜜多；非離布施波羅蜜多，非離淨戒、安忍、精進、靜慮、般若波羅蜜多。",
        "translation": "Because [their] nonexistence is unobtainable, the prajñāpāramitā practiced by the bodhisattvas and mahāsattvas is not the prajñāpāramitā of generosity, nor the prajñāpāramitā of pure morality, patience, effort, meditation, nor prajñāpāramitā; it's not apart from the prajñāpāramitā of generosity, nor apart from the prajñāpāramitā of pure morality, patience, effort, meditation, or prajñāpāramitā.",
        "source": "T05n0220_094:0524b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於布施波羅蜜多求，不應於淨戒、安忍、精進、靜慮、般若波羅蜜多求；不應離布施波羅蜜多求，不應離淨戒、安忍、精進、靜慮、般若波羅蜜多求。",
        "translation": "Therefore, the prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't seek the prajñāpāramitā of generosity, shouldn't seek the prajñāpāramitā of pure morality, patience, effort, meditation, and prajñāpāramitā, and shouldn't seek them apart from the prajñāpāramitā of generosity or the prajñāpāramitā of pure morality, patience, effort, meditation, and prajñāpāramitā.",
        "source": "T05n0220_094:0524b05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0524b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於四靜慮求，不應於四無量、四無色定求；不應離四靜慮求，不應離四無量、四無色定求。",
        "translation": "The prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't seek it in the four meditations, shouldn't seek it in the four immeasurable and four formless concentrations, and shouldn't seek it apart from the four meditations or apart from the four immeasurable and four formless concentrations.",
        "source": "T05n0220_094:0524b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0524b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四靜慮，若四無量、四無色定，若離四靜慮，若離四無量、四無色定，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If the four meditations, if the four immeasurable and four formless concentrations, if they are free of the four meditations, if they are free of the four immeasurable and four formless concentrations, if they are bodhisattvas, if they are prajñāpāramitās, and if they seek to do so, they are all neither associated nor unassociated, neither colored nor formless, neither seen nor unseen, nor opposed nor unopposed, and they all have the same characteristics, which is called formlessness.",
        "source": "T05n0220_094:0524b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0524b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0524b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非四靜慮，非四無量、四無色定；非離四靜慮，非離四無量、四無色定。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas and mahāsattvas isn't the four meditations, isn't the four immeasurable and four formless concentrations, and isn't free of the four meditations or the four immeasurable and four formless concentrations.",
        "source": "T05n0220_094:0524b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0524b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "Thus, all of them are inapprehensible in their lack of existence.",
        "source": "T05n0220_094:0524b20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非四靜慮，非四無量、四無色定；非離四靜慮，非離四無量、四無色定。",
        "translation": "Because [their] non-existence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas and mahāsattvas isn't the four states of meditation, isn't the four immeasurable and four formless concentrations, and isn't free of the four states of meditation or the four immeasurable and four formless concentrations.",
        "source": "T05n0220_094:0524b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於四靜慮求，不應於四無量、四無色定求；不應離四靜慮求，不應離四無量、四無色定求。",
        "translation": "Therefore, the prajñāpāramitā practiced by the bodhisattvas and mahāsattvas shouldn't seek it in the four meditations, shouldn't seek it in the four immeasurable and four formless concentrations, and shouldn't seek it apart from the four meditations or apart from the four immeasurable and four formless concentrations.",
        "source": "T05n0220_094:0524b24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0524b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於八解脫求，不應於八勝處、九次第定、十遍處求；不應離八解脫求，不應離八勝處、九次第定、十遍處求。",
        "translation": "The prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't seek it in the eight liberations, shouldn't seek it in the eight abodes of excellence, nine graduated concentrations, or ten universal abodes, and shouldn't seek it apart from the eight liberations or from the eight abodes of excellence, nine graduated concentrations, or ten universal abodes.",
        "source": "T05n0220_094:0524b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0524c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若八解脫，若八勝處、九次第定、十遍處，若離八解脫，若離八勝處、九次第定、十遍處，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If there are the eight liberations, if there are the eight abodes of excellence, the nine graduated concentrations, and the ten universal abodes, if there are those who are free of the eight liberations, if there are those who are free of the eight abodes of excellence, the nine graduated concentrations, and the ten universal abodes, if there are bodhisattvas, if there are prajñāpāramitās, and if they pursue such things, they are all neither associated nor unassociated, neither colored nor formless, neither seen nor unseen, and neither opposed nor unopposed, all having the same characteristics, which is called having no characteristics.",
        "source": "T05n0220_094:0524c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0524c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0524c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非八解脫，非八勝處、九次第定、十遍處；非離八解脫，非離八勝處、九次第定、十遍處。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas and mahāsattvas isn't the eight liberations, the eight abodes of excellence, the nine graduated concentrations, or the ten universal abodes; it's not free of the eight liberations, the eight abodes of excellence, the nine graduated concentrations, or the ten universal abodes.",
        "source": "T05n0220_094:0524c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0524c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "Thus, all of them are lacking in the nature of being and cannot be obtained.",
        "source": "T05n0220_094:0524c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非八解脫，非八勝處、九次第定、十遍處；非離八解脫，非離八勝處、九次第定、十遍處。",
        "translation": "Because nonexistence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas and mahāsattvas isn't the eight liberation, the eight abodes of excellence, the nine graduated concentrations, or the ten universal abodes; it's not free of the eight liberation, and it's not free of the eight abodes of excellence, the nine graduated concentrations, or the ten universal abodes.",
        "source": "T05n0220_094:0524c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於八解脫求，不應於八勝處、九次第定、十遍處求；不應離八解脫求，不應離八勝處、九次第定、十遍處求。",
        "translation": "Therefore, the prajñāpāramitā practiced by the bodhisattvas and mahāsattvas shouldn't seek it in the eight liberations, shouldn't seek it in the eight superior bases, nine graduated concentrations, and ten universal bases, and shouldn't seek it apart from the eight liberations or apart from the eight superior bases, nine graduated concentrations, and ten universal bases.",
        "source": "T05n0220_094:0524c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0524c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於四念住求，不應於四正斷、四神足、五根、五力、七等覺支、八聖道支求；不應離四念住求，不應離四正斷乃至八聖道支求。",
        "translation": "The prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't seek it in the four abodes of mindfulness, nor should they seek it in the four correct abiding, four miraculous abilities, five faculties, five powers, seven factors of virtual enlightenment, or eight noble factors of the path; they shouldn't seek it apart from the four abodes of mindfulness, nor should they seek it apart from the four correct abiding and even the eight noble factors of the path.",
        "source": "T05n0220_094:0524c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0524c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四念住，若四正斷乃至八聖道支，若離四念住，若離四正斷乃至八聖道支，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If the four abodes of mindfulness, if the four correct eliminations ... the eight noble factors of the path, if they are free of the four abodes of mindfulness, if they are free of the four correct eliminations ... the eight noble factors of the path, if they are bodhisattvas, if they are prajñāpāramitā, and if they pursue such-and-such, they are all neither associated nor unassociated, neither with nor without form, neither with nor without views, and neither with nor without opposition, all have the same characteristics, which is called formlessness.",
        "source": "T05n0220_094:0524c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0524c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0524c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非四念住，非四正斷、四神足、五根、五力、七等覺支、八聖道支；非離四念住，非離四正斷乃至八聖道支。",
        "translation": "The prajñāpāramitā practiced by bodhisattvas and mahāsattvas isn't the four abodes of mindfulness, the four correct eliminations, the four miraculous abilities, the five faculties, the five powers, the seven branches of virtual enlightenment, or the eight noble factors of the path; it's not free of the four abodes of mindfulness or the four correct eliminations or even the eight noble factors of the path.",
        "source": "T05n0220_094:0524c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0525a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "Thus, all of them are lacking in the nature of being and are unobtainable.",
        "source": "T05n0220_094:0525a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非四念住，非四正斷乃至八聖道支；非離四念住，非離四正斷乃至八聖道支。",
        "translation": "Because [their] nonexistence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, is not the four abodes of mindfulness, not the four correct eliminations or even the eight noble factors of the path, and it's not free of the four abodes of mindfulness or the four correct eliminations or even the eight noble factors of the path.",
        "source": "T05n0220_094:0525a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於四念住求，不應於四正斷乃至八聖道支求；不應離四念住求，不應離四正斷乃至八聖道支求。",
        "translation": "Therefore, the prajñāpāramitā practiced by the bodhisattvas and mahāsattvas shouldn't seek it in the four abodes of mindfulness, shouldn't seek it in the four correct eliminations or even the eight noble factors of the path, and shouldn't seek it apart from the four abodes of mindfulness or apart from the four correct eliminations or even the eight noble factors of the path.",
        "source": "T05n0220_094:0525a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0525a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於空解脫門求，不應於無相、無願解脫門求；不應離空解脫門求，不應離無相、無願解脫門求。",
        "translation": "The prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't be pursued through the gate of the liberation of emptiness, shouldn't be pursued through the gate of the liberation of signlessness and wishlessness, and shouldn't be pursued apart from the gate of the liberation of emptiness or the gate of the liberation of signlessness and wishlessness.",
        "source": "T05n0220_094:0525a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0525a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若空解脫門，若無相、無願解脫門，若離空解脫門，若離無相、無願解脫門，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If it's the liberation through the gate of emptiness, the liberation through signlessness and wishlessness, the liberation through seclusion from emptiness, the liberation through seclusion from signlessness and wishlessness, the bodhisattva, the prajñāpāramitā, and those who pursue such things, they are all neither associated nor unassociated, neither colored nor signless, neither seen nor unseen, nor opposed nor unopposed, and all have the same characteristics, which is called signlessness.",
        "source": "T05n0220_094:0525a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0525a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0525a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非空解脫門，非無相、無願解脫門；非離空解脫門，非離無相、無願解脫門。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas and mahāsattvas is not the liberation gate of emptiness, not the liberation gate of signlessness and wishlessness, and not the liberation gate of freedom from emptiness or the liberation gate of freedom from signlessness and wishlessness.",
        "source": "T05n0220_094:0525a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0525a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "Thus, all of them are lacking in the nature of ownership and are unobtainable.",
        "source": "T05n0220_094:0525a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非空解脫門，非無相、無願解脫門；非離空解脫門，非離無相、無願解脫門。",
        "translation": "Because the nature of nothingness is unobtainable, the prajñāpāramitā practiced by the bodhisattvas is not the gate of liberation through emptiness, not the gate of liberation through signlessness and wishlessness, and not the gate of liberation through separation from emptiness or the gate of liberation through signlessness and wishlessness.",
        "source": "T05n0220_094:0525a21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於空解脫門求，不應於無相、無願解脫門求；不應離空解脫門求，不應離無相、無願解脫門求。",
        "translation": "Therefore, the prajñāpāramitā practiced by the bodhisattvas and Mahāsattvas shouldn't seek liberation through the gate of emptiness, shouldn't seek liberation through the gate of signlessness and wishlessness, and shouldn't seek liberation apart from the gate of emptiness and shouldn't seek liberation apart from the gate of signlessness and wishlessness.",
        "source": "T05n0220_094:0525a24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0525a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於五眼求，不應於六神通求；不應離五眼求，不應離六神通求。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, shouldn't seek it in the five eyes, shouldn't seek it in the six supernormal powers, and shouldn't seek it apart from the five eyes or apart from the six supernormal powers.",
        "source": "T05n0220_094:0525a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0525b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若五眼，若六神通，若離五眼，若離六神通，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If there are the five eyes, if there are the six supernormal powers, if they are free of the five eyes, if they are free of the six supernormal powers, if they are bodhisattvas, if they are prajñāpāramitās, and if they are sought to be like this, they are all neither associated nor unassociated, neither colored nor formless, neither seen nor unseen, and neither opposed nor unopposed, all having the same characteristics, which is called formlessness.",
        "source": "T05n0220_094:0525b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0525b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0525b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非五眼，非六神通；非離五眼，非離六神通。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas Mahāsattvas is not the five eyes or the six supernormal powers, and it's not free of the five eyes or the six supernormal powers.",
        "source": "T05n0220_094:0525b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0525b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "Thus, all of them are inapprehensible in their lack of existence.",
        "source": "T05n0220_094:0525b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非五眼，非六神通；非離五眼，非離六神通。",
        "translation": "Because [their] nonexistence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, is not the five eyes and not the six supernormal powers; it's not apart from the five eyes and not apart from the six supernormal powers.",
        "source": "T05n0220_094:0525b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於五眼求，不應於六神通求；不應離五眼求，不應離六神通求。",
        "translation": "Therefore, the prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, shouldn't seek it in the five eyes, shouldn't seek it in the six supernormal powers, and shouldn't seek it apart from the five eyes or apart from the six supernormal powers.",
        "source": "T05n0220_094:0525b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0525b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於佛十力求，不應於四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法求；不應離佛十力求，不應離四無所畏乃至十八佛不共法求。",
        "translation": "The prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't strive for the ten endeavors of the Buddha, shouldn't seek the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and 18 distinctive qualities of the Buddha, and shouldn't seek them apart from the ten endeavors of the Buddha or the four fearlessnesses and 18 distinctive qualities of the Buddha.",
        "source": "T05n0220_094:0525b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0525b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若佛十力，若四無所畏乃至十八佛不共法，若離佛十力，若離四無所畏乃至十八佛不共法，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If the Buddha's ten powers, if the four unsurpassables, or even the 18 Buddha-principles, if they are free of the Buddha's ten powers, if they are free of the four unsurpassables or even the 18 Buddha-principles, if they are bodhisattvas, if they are prajñāpāramitās, or if they pursue such-and-such, they are all neither associated nor unassociated, neither colored nor formless, neither seen nor unseen, and neither opposed nor unopposed, all have the same characteristics, which is called formlessness.",
        "source": "T05n0220_094:0525b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0525b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0525b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非佛十力，非四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法；非離佛十力，非離四無所畏乃至十八佛不共法。",
        "translation": "The prajñāpāramitā practiced by bodhisattvas and mahāsattvas isn't the Buddha's ten powers, the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, or the 18 Buddha-uncommon dharmas; it's not apart from the Buddha's ten powers, and it's not apart from the four fearlessnesses or even the 18 Buddha-uncommon dharmas.",
        "source": "T05n0220_094:0525b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0525b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "Thus, all of them are inexistent in nature and cannot be obtained.",
        "source": "T05n0220_094:0525b27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非佛十力，非四無所畏乃至十八佛不共法；非離佛十力，非離四無所畏乃至十八佛不共法。",
        "translation": "Because [their] nonexistence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas, mahāsattvas, and buddhas is not the Buddha's ten powers, not the four fearlessnesses, or even the 18 Buddha-uncommon dharmas; it's not apart from the Buddha's ten powers, not apart from the four fearlessnesses or even the 18 Buddha-uncommon dharmas.",
        "source": "T05n0220_094:0525b28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於佛十力求，不應於四無所畏乃至十八佛不共法求；不應離佛十力求，不應離四無所畏乃至十八佛不共法求。",
        "translation": "Therefore, the prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't strive for the Buddha's ten powers, shouldn't seek the four fearlessnesses or even the 18 Buddha-uncommon dharmas, and shouldn't part from the Buddha's ten powers or part from the four fearlessnesses or even the 18 Buddha-uncommon dharmas.",
        "source": "T05n0220_094:0525c02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0525c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於無忘失法求，不應於恒住捨性求；不應離無忘失法求，不應離恒住捨性求。",
        "translation": "The prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't seek it in the absence of forgetfulness, shouldn't seek it in the nature of constancy and equanimity, and shouldn't seek it apart from the absence of forgetfulness and shouldn't seek it apart from the nature of constancy and equanimity.",
        "source": "T05n0220_094:0525c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0525c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無忘失法，若恒住捨性，若離無忘失法，若離恒住捨性，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If there's no forgetfulness, if there's constant abiding equanimity, if they're free of no forgetfulness, if they're free of constant abiding equanimity, if they're bodhisattvas, if they're prajñāpāramitā, and if they seek to do so, they are all neither associated nor unassociated, neither colored nor formless, neither seen nor unseen, and neither opposed nor unopposed, all having the same characteristics, which is called formlessness.",
        "source": "T05n0220_094:0525c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0525c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0525c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非無忘失法，非恒住捨性；非離無忘失法，非離恒住捨性。",
        "translation": "\"The prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, is not the Dharma of no forgetfulness, not the nature of constant abiding in equanimity; it's not free of the Dharma of no forgetfulness and not free of the nature of constant abiding in equanimity.",
        "source": "T05n0220_094:0525c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0525c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "\"Thus, all of these things lack the nature of being and are unobtainable.",
        "source": "T05n0220_094:0525c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非無忘失法，非恒住捨性；非離無忘失法，非離恒住捨性。",
        "translation": "Because the nature of nothingness is unobtainable, the prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, is not the Dharma of no forgetfulness, not the nature of constancy and equanimity; it's not free of the Dharma of no forgetfulness and not free of the nature of constancy and equanimity.",
        "source": "T05n0220_094:0525c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於無忘失法求，不應於恒住捨性求；不應離無忘失法求，不應離恒住捨性求。",
        "translation": "Therefore, the prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, shouldn't seek it in terms of the absence of forgetfulness, shouldn't seek it in terms of the permanently abiding nature of equanimity, and shouldn't seek it apart from the absence of forgetfulness or apart from the permanently abiding nature of equanimity.",
        "source": "T05n0220_094:0525c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_094:0525c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，不應於一切智求，不應於道相智、一切相智求；不應離一切智求，不應離道相智、一切相智求。",
        "translation": "The prajñāpāramitā practiced by bodhisattvas and mahāsattvas shouldn't seek it in omniscience, shouldn't seek it in knowledge of the path and knowledge of all characteristics, and shouldn't seek it apart from omniscience and shouldn't seek it apart from knowledge of the path and knowledge of all characteristics.",
        "source": "T05n0220_094:0525c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0525c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切智，若道相智、一切相智，若離一切智，若離道相智、一切相智，若菩薩摩訶薩，若般若波羅蜜多，若求如是，一切皆非相應非不相應、非有色非無色、非有見非無見、非有對非無對，咸同一相，所謂無相。",
        "translation": "If there's omniscience, if there's knowledge of the path and knowledge of all characteristics, if there's knowledge free of omniscience, if there's knowledge free of the path and knowledge of all characteristics, if it's the bodhisattva Mahāsattva, if it's the prajñāpāramitā, and if it's sought to be like this, they are all neither associated nor unassociated, neither colored nor formless, neither seen nor unseen, and neither opposed nor unopposed, all having the same characteristics, which is called having no characteristics.",
        "source": "T05n0220_094:0525c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0526a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_094:0526a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所行般若波羅蜜多，非一切智，非道相智、一切相智；非離一切智，非離道相智、一切相智。",
        "translation": "The prajñāpāramitā practiced by the bodhisattvas and mahāsattvas is not omniscience, not cognition of the path and omniscience, and not free of omniscience or cognition of the path and omniscience.",
        "source": "T05n0220_094:0526a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_094:0526a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切皆無所有性不可得。",
        "translation": "\"Thus, all of these things are lacking in the nature of being and are unobtainable.",
        "source": "T05n0220_094:0526a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無所有不可得故，菩薩摩訶薩所行般若波羅蜜多，非一切智，非道相智、一切相智；非離一切智，非離道相智、一切相智。",
        "translation": "Because [their] nonexistence is inapprehensible, the prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, is not omniscience, not cognition of the path and all characteristics, and not free of omniscience or cognition of the path and all characteristics.",
        "source": "T05n0220_094:0526a06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩所行般若波羅蜜多，不應於一切智求，不應於道相智、一切相智求；不應離一切智求，不應離道相智、一切相智求。",
        "translation": "Therefore, the prajñāpāramitā practiced by the bodhisattvas, Mahāsattvas, shouldn't seek it from omniscience, shouldn't seek it from knowledge of the path and knowledge of all characteristics, and shouldn't seek it apart from omniscience and shouldn't seek it apart from knowledge of the path and knowledge of all characteristics.",
        "source": "T05n0220_094:0526a09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第九十四",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 94",
        "source": "T05n0220_094:0526a13_0",
        "is_bad_quality": false
    }
]