[
    {
        "source_sentence": "大般若波羅蜜多經卷第六十七",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 67",
        "source": "T05n0220_067:0376c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T05n0220_067:0376c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初分無所得品第十八之七",
        "translation": "The First Part of the Chapter on the Unauthorized, Eighteenth and Seventh",
        "source": "T05n0220_067:0376c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0376c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如空解脫門名唯客所攝，於十方三世無所從來、無所至去亦無所住，空解脫門中無名，名中無空解脫門，非合非離但假施設。",
        "translation": "Just as the name of the gate of liberation through emptiness is only included by the visitor, there's nothing that comes from, nothing that goes to, and nothing that stays in the three worlds in the ten directions, there's no name in the gate of liberation through emptiness, and there's no gate of liberation through emptiness in the name, which is neither combined nor separate but only nominally defined.",
        "source": "T05n0220_067:0376c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0376c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以空解脫門與名俱自性空故，自性空中若空解脫門若名俱無所有不可得故。",
        "translation": "It's because the liberation through emptiness and names are both empty of their own nature, and because the liberation through emptiness and names in their own nature are both without existence and unobtainable.",
        "source": "T05n0220_067:0376c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如無相、無願解脫門名唯客所攝，於十方三世無所從來、無所至去亦無所住，無相、無願解脫門中無名，名中無無相、無願解脫門，非合非離但假施設。",
        "translation": "Just as the name of the gate of liberation through marklessness and wishlessness is only included by the visitor, it comes from nowhere, goes to nowhere, and has no abode in the three worlds in the ten directions, there's no name in the gate of liberation through marklessness and wishlessness, and the gate of liberation through marklessness and wishlessness in names is neither combined nor separate but nominally designated.",
        "source": "T05n0220_067:0376c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0376c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無相、無願解脫門與名俱自性空故，自性空中若無相、無願解脫門若名俱無所有不可得故。",
        "translation": "It's because the liberation gate of formlessness and wishlessness and names are both empty of their own nature, and it's because the absence of form, the liberation gate of wishlessness, and names in their own nature are both ungraspable.",
        "source": "T05n0220_067:0376c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩名亦復如是唯客所攝，於十方三世無所從來、無所至去亦無所住，菩薩摩訶薩中無名，名中無菩薩摩訶薩，非合非離但假施設。",
        "translation": "The names of the bodhisattvas, mahāsattvas, and names are likewise nothing but objects, coming from nowhere, going to nowhere, and standing in nowhere in the three worlds in the ten directions, with no names within bodhisattvas, and no bodhisattvas within names, which are neither combined nor separate but only nominally defined.",
        "source": "T05n0220_067:0376c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0376c24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩摩訶薩與名俱自性空故，自性空中若菩薩摩訶薩若名俱無所有不可得故。",
        "translation": "It's because the self-nature of both bodhisattvas, mahāsattvas, and names are both empty, and because the self-nature of both bodhisattvas, mahāsattvas, and names are both without existence and unobtainable.",
        "source": "T05n0220_067:0376c24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_067:0376c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此緣故我作是說：菩薩摩訶薩但有假名。",
        "translation": "For this reason, I say this: The bodhisattva Mahāsattva merely has a provisional name.",
        "source": "T05n0220_067:0376c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0376c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如五眼名唯客所攝，於十方三世無所從來、無所至去亦無所住，五眼中無名，名中無五眼，非合非離但假施設。",
        "translation": "Just as the names of the five eyes are only included by their guests, they come from nowhere, go to nowhere, and have no place to stay in the three worlds in the ten directions, have no names in the five eyes, and have no five eyes in their names, which are neither combined nor separate but are only nominally defined.",
        "source": "T05n0220_067:0376c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0377a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以五眼與名俱自性空故，自性空中若五眼若名俱無所有不可得故。",
        "translation": "It's because the five eyes and names are both empty of their own nature, and it's because the five eyes and names are both without property and unobtainable in the sky of their own nature.",
        "source": "T05n0220_067:0377a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如六通名唯客所攝，於十方三世無所從來、無所至去亦無所住，六通中無名，名中無六通，非合非離但假施設。",
        "translation": "Just as the six powers and names are only included by guests, and there's nothing from which they come, nothing to which they go, and nothing to which they stay in the three worlds in the ten directions, there are no names within the six powers, and there are no six powers within names, which are not combined or separated but are only nominally defined.",
        "source": "T05n0220_067:0377a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0377a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以六通與名俱自性空故，自性空中若六通若名俱無所有不可得故。",
        "translation": "It's because the six powers and names are both empty of their own nature, and it's because the six powers and names are both without existence and unobtainable in the sky of their own nature.",
        "source": "T05n0220_067:0377a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩名亦復如是唯客所攝，於十方三世無所從來、無所至去亦無所住，菩薩摩訶薩中無名，名中無菩薩摩訶薩，非合非離但假施設。",
        "translation": "The names of the bodhisattvas, mahāsattvas, and bodhisattvas are likewise only included by guests, have nothing to come from, nothing to go to, and nothing to stay in during the three periods in the ten directions, have no names within bodhisattvas, and have no bodhisattvas within names, and are neither combined nor separated but are only nominally designated.",
        "source": "T05n0220_067:0377a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0377a12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩摩訶薩與名俱自性空故，自性空中若菩薩摩訶薩若名俱無所有不可得故。",
        "translation": "It's because the self-nature of both bodhisattvas, mahāsattvas, and names are both empty, and because the self-nature of both bodhisattvas, mahāsattvas, and names are both without existence and unobtainable.",
        "source": "T05n0220_067:0377a12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_067:0377a14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此緣故我作是說：菩薩摩訶薩但有假名。",
        "translation": "For this reason, I say this: The bodhisattva Mahāsattva merely has a provisional name.",
        "source": "T05n0220_067:0377a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0377a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛十力名唯客所攝，於十方三世無所從來、無所至去亦無所住，佛十力中無名，名中無佛十力，非合非離但假施設。",
        "translation": "Just as the names of the Buddha's ten powers are only included by visitors, they come from nowhere, go to nowhere, and abide in nowhere in the ten directions and three times, and there are no names within the Buddha's ten powers and no Buddha's ten powers within names, which are neither combined nor separate but are only nominally defined.",
        "source": "T05n0220_067:0377a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0377a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以佛十力與名俱自性空故，自性空中若佛十力若名俱無所有不可得故。",
        "translation": "It's because the ten powers of a Buddha and his name are both empty of their own nature, and it's because the ten powers of a Buddha and his name are both without existence and unobtainable in the sky of their own nature.",
        "source": "T05n0220_067:0377a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法名唯客所攝，於十方三世無所從來、無所至去亦無所住，四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法中無名，名中無四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法，非合非離但假施設。",
        "translation": "Just as the names of the four forms of unsurpassed fear, the four forms of unhindered understanding, great kindness, great compassion, great joy, great equanimity, and the 18 Buddha-uncommon dharmas are only included by the visitor, there's nothing from which they come, nothing to which they go, and nothing in which they abide in the three worlds in the ten directions, and there are no names among the four forms of unsurpassed fear, the four forms of unhindered understanding, great kindness, great compassion, great joy, great equanimity, and the 18 Buddha-uncommon dharmas, which are not combined or separated but are only nominally defined.",
        "source": "T05n0220_067:0377a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0377a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法與名俱自性空故，自性空中若四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法若名俱無所有不可得故。",
        "translation": "It's because the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, 18 Buddha-uncommon dharmas, and names are all empty of their own nature, and it's because the four fearlessnesses, four unhindered understandings, great kindnesses, great compassion, great joy, great equanimity, 18 Buddha-uncommon dharmas, and 18 Buddha-uncommon dharmas are all without possessions in the sky of their own nature and cannot be obtained if they are named.",
        "source": "T05n0220_067:0377a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩名亦復如是唯客所攝，於十方三世無所從來、無所至去亦無所住，菩薩摩訶薩中無名，名中無菩薩摩訶薩，非合非離但假施設。",
        "translation": "The names of the bodhisattvas, mahāsattvas, and bodhisattvas are likewise only included in the objective, have nothing to come from, nothing to go to, and nothing to abide in during the three divisions of the ten directions, have no names within bodhisattvas, and have no bodhisattvas within names that are not combined or separated but are only nominally designated.",
        "source": "T05n0220_067:0377b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0377b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩摩訶薩與名俱自性空故，自性空中若菩薩摩訶薩若名俱無所有不可得故。",
        "translation": "It's because the self-nature of both bodhisattvas, mahāsattvas, and names are both empty, and because the self-nature of both bodhisattvas, mahāsattvas, and names are both without existence and unobtainable.",
        "source": "T05n0220_067:0377b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_067:0377b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此緣故我作是說：菩薩摩訶薩但有假名。",
        "translation": "For this reason, I say this: The bodhisattva Mahāsattva merely has a provisional name.",
        "source": "T05n0220_067:0377b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0377b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如一切智名唯客所攝，於十方三世無所從來、無所至去亦無所住，一切智中無名，名中無一切智，非合非離但假施設。",
        "translation": "Just as the name of omniscience is only included by the object, it comes from nowhere, goes to nowhere, and has no abode in the three worlds in the ten directions, has no name within omniscience, and has no omniscience within names, and is neither combined nor separated but only nominally defined.",
        "source": "T05n0220_067:0377b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0377b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切智與名俱自性空故，自性空中若一切智若名俱無所有不可得故。",
        "translation": "It's because all cognitions and names are empty of their own nature, and it's because both cognitions and names lack existence and are unobtainable in the sky of their own nature.",
        "source": "T05n0220_067:0377b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如道相智、一切相智名唯客所攝，於十方三世無所從來、無所至去亦無所住，道相智、一切相智中無名，名中無道相智、一切相智，非合非離但假施設。",
        "translation": "Just as the names of cognition of the path and cognition of all characteristics are only included by the object, they come from nowhere, go to nowhere, and have no abode in the three worlds in the ten directions, there are no names in cognition of the path and cognition of all characteristics, and there's no cognition of the path and cognition of all characteristics in names that are not combined or separated but are only nominally defined.",
        "source": "T05n0220_067:0377b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0377b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以道相智、一切相智與名俱自性空故，自性空中若道相智、一切相智若名俱無所有不可得故。",
        "translation": "It's because cognition of the path, cognition of all characteristics, and names are all empty of their own nature, and it's because cognition of the path and cognition of all characteristics and names are both without existence and unobtainable in the sky of their own nature.",
        "source": "T05n0220_067:0377b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩名亦復如是唯客所攝，於十方三世無所從來、無所至去亦無所住，菩薩摩訶薩中無名，名中無菩薩摩訶薩，非合非離但假施設。",
        "translation": "The names of the bodhisattvas, mahāsattvas, and names are likewise nothing but objects, coming from nowhere, going to nowhere, and standing in nowhere in the three worlds in the ten directions, with no names within bodhisattvas, and no bodhisattvas within names, which are neither combined nor separate but only nominally defined.",
        "source": "T05n0220_067:0377b22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0377b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩摩訶薩與名俱自性空故，自性空中若菩薩摩訶薩若名俱無所有不可得故。",
        "translation": "It's because the self-nature of both bodhisattvas, mahāsattvas, and names are both empty, and because the self-nature of both bodhisattvas, mahāsattvas, and names are both without existence and unobtainable.",
        "source": "T05n0220_067:0377b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_067:0377b27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此緣故我作是說：菩薩摩訶薩但有假名。",
        "translation": "For this reason, I say this: The bodhisattva Mahāsattva merely has a provisional name.",
        "source": "T05n0220_067:0377b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0377b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如無忘失法名唯客所攝，於十方三世無所從來、無所至去亦無所住，無忘失法中無名，名中無無忘失法，非合非離但假施設。",
        "translation": "If the name of the Dharma of no forgetfulness is only included by the object, it comes from nowhere, goes to nowhere, and has no abode in the three worlds in the ten directions, has no name in the Dharma of no forgetfulness, and has no Dharma of no forgetfulness in the name, which is neither combined nor separate but only nominally defined.",
        "source": "T05n0220_067:0377b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0377c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無忘失法與名俱自性空故，自性空中若無忘失法若名俱無所有不可得故。",
        "translation": "It's because both the absence of forgetfulness and names are empty of their own nature, and it's because both the absence of forgetfulness and names in their own nature lack existence and are unobtainable.",
        "source": "T05n0220_067:0377c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如恒住捨性名唯客所攝，於十方三世無所從來、無所至去亦無所住，恒住捨性中無名，名中無恒住捨性，非合非離但假施設。",
        "translation": "Just as the name of permanently abiding equanimity is only included by an object, it comes from nowhere, goes to nowhere, and has no abode in the three worlds in the ten directions, has no name in its permanently abiding equanimity, and has no permanently abiding equanimity in its name, which is neither combined nor separate but only nominally defined.",
        "source": "T05n0220_067:0377c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0377c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以恒住捨性與名俱自性空故，自性空中若恒住捨性若名俱無所有不可得故。",
        "translation": "It's because both permanently abiding equanimity and names are empty of their own nature, and it's because both permanently abiding equanimity and names in their own nature lack existence and are unobtainable.",
        "source": "T05n0220_067:0377c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩名亦復如是唯客所攝，於十方三世無所從來、無所至去亦無所住，菩薩摩訶薩中無名，名中無菩薩摩訶薩，非合非離但假施設。",
        "translation": "The names of bodhisattvas, mahāsattvas, and bodhisattvas are likewise included only by their visitors, have nothing to come from, nothing to go to, and nothing to abide in during the three divisions of the ten directions, have no names within bodhisattvas, and have no bodhisattvas within names, which are neither combined nor separate but are only nominally defined.",
        "source": "T05n0220_067:0377c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0377c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩摩訶薩與名俱自性空故，自性空中若菩薩摩訶薩若名俱無所有不可得故。",
        "translation": "It's because the self-nature of both bodhisattvas, mahāsattvas, and names are both empty, and because the self-nature of both bodhisattvas, mahāsattvas, and names are both without existence and unobtainable.",
        "source": "T05n0220_067:0377c13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_067:0377c15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此緣故我作是說：菩薩摩訶薩但有假名。",
        "translation": "For this reason, I say this: The bodhisattva Mahāsattva merely has a provisional name.",
        "source": "T05n0220_067:0377c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0377c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如一切陀羅尼門名唯客所攝，於十方三世無所從來、無所至去亦無所住，一切陀羅尼門中無名，名中無一切陀羅尼門，非合非離但假施設。",
        "translation": "Just as the names of all dhāraṇī entries are only included by their guests, there's nothing that comes from, nothing that goes to, and nothing that stays in the three worlds in the ten directions, there are no names within all dhāraṇī entries, and there are no dhāraṇī entries within names that are not combined or separated but are only hypothetically defined.",
        "source": "T05n0220_067:0377c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0377c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切陀羅尼門與名俱自性空故，自性空中若一切陀羅尼門若名俱無所有不可得故。",
        "translation": "It's because all dhāraṇī gates and names are empty of their own nature, and it's because all dhāraṇī gates and names in their own nature are without existence and cannot be obtained.",
        "source": "T05n0220_067:0377c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如一切三摩地門名唯客所攝，於十方三世無所從來、無所至去亦無所住，一切三摩地門中無名，名中無一切三摩地門，非合非離但假施設。",
        "translation": "Just as all the names of samādhis are only included by the visitor, there's nothing that comes from, nothing that goes to, and nothing that stays in the three worlds in the ten directions, there are no names within all the samādhis, and there are no samādhis within names, which are neither combined nor separate but are only nominally defined.",
        "source": "T05n0220_067:0377c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0377c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切三摩地門與名俱自性空故，自性空中若一切三摩地門若名俱無所有不可得故。",
        "translation": "It's because all samādhis and names are empty of their own nature, and it's because all samādhis and names in the sky of their own nature lack existence and are unobtainable.",
        "source": "T05n0220_067:0377c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩名亦復如是唯客所攝，於十方三世無所從來、無所至去亦無所住，菩薩摩訶薩中無名，名中無菩薩摩訶薩，非合非離但假施設。",
        "translation": "The names of bodhisattvas, mahāsattvas, and bodhisattvas are likewise included only by their visitors, have no place to come from, no place to go, and no place to stay in the three worlds in the ten directions, have no names within bodhisattvas, and have no bodhisattvas within names, and are neither combined nor separated but are only nominally designated.",
        "source": "T05n0220_067:0377c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0378a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩摩訶薩與名俱自性空故，自性空中若菩薩摩訶薩若名俱無所有不可得故。",
        "translation": "It's because the self-nature of both bodhisattvas, mahāsattvas, and names are both empty, and because the self-nature of both bodhisattvas, mahāsattvas, and names are both without existence and unobtainable.",
        "source": "T05n0220_067:0378a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_067:0378a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此緣故我作是說：菩薩摩訶薩但有假名。",
        "translation": "For this reason, I say this: The bodhisattva Mahāsattva merely has a provisional name.",
        "source": "T05n0220_067:0378a05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0378a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如內空名唯客所攝，於十方三世無所從來、無所至去亦無所住，內空中無名，名中無內空，非合非離但假施設。",
        "translation": "Just as the name internal emptiness is only included by an object, it comes from nowhere, goes to nowhere, and has no abode in the three worlds in the ten directions, has no name in internal emptiness, and has no internal emptiness in names, which are neither combined nor separate but are only hypothetical designations.",
        "source": "T05n0220_067:0378a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0378a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以內空與名俱自性空故，自性空中若內空若名俱無所有不可得故。",
        "translation": "It's because internal emptiness and names are both empty of their own nature, and because both internal emptiness and names in their own nature are without existence and unknowable.",
        "source": "T05n0220_067:0378a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空名唯客所攝，於十方三世無所從來、無所至去亦無所住，外空乃至無性自性空中無名，名中無外空乃至無無性自性空，非合非離但假施設。",
        "translation": "For example, external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, scattered emptiness, emptiness without change, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all things, inaccessible emptiness, natureless emptiness, self-nature emptiness, and the name of natureless self-nature emptiness are only included by the visitor, have nothing to come from, nothing to go to, and nothing to abide in during the ten directions and three times, have no names in external emptiness or even natureless self-nature emptiness, and have no external emptiness or no natureless self-nature emptiness in names that aren't combined or separated but are only hypothetical designations.",
        "source": "T05n0220_067:0378a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0378a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以外空乃至無性自性空與名俱自性空故，自性空中若外空乃至無性自性空若名俱無所有不可得故。",
        "translation": "It's because external emptiness and even the emptiness of a natureless self-nature are both empty of their own nature and names, and because external emptiness and the emptiness of a natureless self-nature are both without existence and unobtainable in the midst of their own nature.",
        "source": "T05n0220_067:0378a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩名亦復如是唯客所攝，於十方三世無所從來、無所至去亦無所住，菩薩摩訶薩中無名，名中無菩薩摩訶薩，非合非離但假施設。",
        "translation": "The names of bodhisattvas, mahāsattvas, and bodhisattvas are likewise only included by guests, have nothing to come from, nothing to go to, and nothing to stay in during the three divisions of the ten directions, have no names within bodhisattvas, and have no bodhisattvas within names, which are neither combined nor separate but are only hypothetical designations.",
        "source": "T05n0220_067:0378a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0378a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩摩訶薩與名俱自性空故，自性空中若菩薩摩訶薩若名俱無所有不可得故。",
        "translation": "It's because the self-nature of both bodhisattvas, mahāsattvas, and names are both empty, and because the self-nature of both bodhisattvas, mahāsattvas, and names are both without existence and unobtainable.",
        "source": "T05n0220_067:0378a24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_067:0378a26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此緣故我作是說：菩薩摩訶薩但有假名。",
        "translation": "For this reason, I say this: The bodhisattva Mahāsattva merely has a provisional name.",
        "source": "T05n0220_067:0378a26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0378a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如真如名唯客所攝，於十方三世無所從來、無所至去亦無所住，真如中無名，名中無真如，非合非離但假施設。",
        "translation": "Just as the name truly is only included by an object, it comes from nowhere, goes to nowhere, and has no abode in the three worlds in the ten directions, has no name in true thusness, and has no true thusness in names, and is neither combined nor separate but only nominally defined.",
        "source": "T05n0220_067:0378a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0378b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以真如與名俱自性空故，自性空中若真如若名俱無所有不可得故。",
        "translation": "It's because both truly being and names are empty of their own nature, and it's because both truly being and names in their own nature are without existence and cannot be obtained.",
        "source": "T05n0220_067:0378b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如法界、法性、不虛妄性、不變異性、不思議界、虛空界、斷界、離界、滅界、平等性、離生性、法定、法住、無性界、無相界、無作界、無為界、安隱界、寂靜界、本無、實際、究竟涅槃名唯客所攝，於十方三世無所從來、無所至去亦無所住，法界乃至究竟涅槃中無名，名中無法界乃至究竟涅槃，非合非離但假施設。",
        "translation": "For example, the names of the realm of reality, the nature of reality, non-falsity, unchanging diversity, inconceivable realm, space realm, elimination realm, free realm, cessation realm, equality nature, free from arising nature, legal, Dharma-abiding, natureless realm, markless realm, uncreated realm, inactive realm, peaceful realm, quiescent realm, originally nonexistent, actual, and final nirvāṇa are only included by the visitor, have no origin, no destination, and no abode in the three worlds in the ten directions, have no names in the realm of reality ... and final nirvāṇa, and have no names in the realm of reality ... final nirvāṇa that are not combined or separate but are only nominally designated.",
        "source": "T05n0220_067:0378b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0378b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以法界乃至究竟涅槃與名俱自性空故，自性空中若法界乃至究竟涅槃若名俱無所有不可得故。",
        "translation": "It's because the Dharma realm ... ultimate nirvāṇa and names are both empty of their own nature, and it's because neither the Dharma realm nor ultimate nirvāṇa nor names have anything in their own nature and cannot be obtained.",
        "source": "T05n0220_067:0378b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩名亦復如是唯客所攝，於十方三世無所從來、無所至去亦無所住，菩薩摩訶薩中無名，名中無菩薩摩訶薩，非合非離但假施設。",
        "translation": "The names of the bodhisattvas, mahāsattvas, and nirvāṇas are likewise nothing but objects, coming from nowhere, going to nowhere, and standing in nowhere in the three worlds in the ten directions, with no names within bodhisattvas, and no bodhisattvas within names, which are neither combined nor separate but only nominally designated.",
        "source": "T05n0220_067:0378b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0378b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩摩訶薩與名俱自性空故，自性空中若菩薩摩訶薩若名俱無所有不可得故。",
        "translation": "It's because the self-nature of both bodhisattvas, mahāsattvas, and names are both empty, and because the self-nature of both bodhisattvas, mahāsattvas, and names are both without existence and unobtainable.",
        "source": "T05n0220_067:0378b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_067:0378b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此緣故我作是說：菩薩摩訶薩但有假名。",
        "translation": "For this reason, I say this: The bodhisattva Mahāsattva merely has a provisional name.",
        "source": "T05n0220_067:0378b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0378b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如極喜地名唯客所攝，於十方三世無所從來、無所至去亦無所住，極喜地中無名，名中無極喜地，非合非離但假施設。",
        "translation": "If the name ground of ultimate joy is only included by an object, there's nothing that comes from, nothing that goes to, and nothing that stays in the three worlds in the ten directions, there's no name in the ground of ultimate joy, and there's no ground of ultimate joy in the name, which is neither combined nor separate but only nominally defined.",
        "source": "T05n0220_067:0378b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0378b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以極喜地與名俱自性空故，自性空中若極喜地若名俱無所有不可得故。",
        "translation": "It's because the ground of ultimate joy and names are both empty of their own nature, and it's because the ground of ultimate joy and names are both without existence and unobtainable in the sky of their own nature.",
        "source": "T05n0220_067:0378b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地名唯客所攝，於十方三世無所從來、無所至去亦無所住，離垢地乃至法雲地中無名，名中無離垢地乃至法雲地，非合非離但假施設。",
        "translation": "If the names of the ground of separation from defilement, the ground of emission of light, the ground of burning wisdom, the ground of extreme difficulty, the ground of direct appearance, the ground of distant practice, the ground of immovability, the ground of good wisdom, and the ground of the Dharma-cloud are only included by the visitor, there's nothing from which they come, nothing to which they go, and nothing to which they stay in the ten directions and three times, and there are no names in the ground of separation from defilement or even the ground of the Dharma-cloud, and there are no grounds of separation from defilement or even the ground of the Dharma-cloud in names, which are not combined or separated but are only nominally designated.",
        "source": "T05n0220_067:0378b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0378b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以離垢地乃至法雲地與名俱自性空故，自性空中若離垢地乃至法雲地若名俱無所有不可得故。",
        "translation": "It's because the nature of both the ground of separation from defilement and the ground of the Dharma clouds and names are empty, and because the ground of separation from defilement and the ground of the Dharma clouds and names are both devoid of existence and unobtainable in the sky of their nature.",
        "source": "T05n0220_067:0378c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩名亦復如是唯客所攝，於十方三世無所從來、無所至去亦無所住，菩薩摩訶薩中無名，名中無菩薩摩訶薩，非合非離但假施設。",
        "translation": "The names of the bodhisattvas, mahāsattvas, and buddhas are likewise only included by guests, have nothing to come from, nothing to go to, and nothing to stay in during the three divisions of the ten directions, have no names within bodhisattvas, and have no bodhisattvas within names that are not combined or separated but are only nominally designated.",
        "source": "T05n0220_067:0378c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0378c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩摩訶薩與名俱自性空故，自性空中若菩薩摩訶薩若名俱無所有不可得故。",
        "translation": "It's because the self-nature of both bodhisattvas, mahāsattvas, and names are both empty, and because the self-nature of both bodhisattvas, mahāsattvas, and names are both without existence and unobtainable.",
        "source": "T05n0220_067:0378c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_067:0378c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此緣故我作是說：菩薩摩訶薩但有假名。",
        "translation": "For this reason, I say this: The bodhisattva Mahāsattva merely has a provisional name.",
        "source": "T05n0220_067:0378c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0378c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如異生地名唯客所攝，於十方三世無所從來、無所至去亦無所住，異生地中無名，名中無異生地，非合非離但假施設。",
        "translation": "Just as the names of the stages of worldlings are only included by visitors, there's nothing from which they come, nothing to which they go, and nothing to which they stay in the three worlds in the ten directions, there are no names in the stages of worldlings, and there are no stages of worldlings in names that are not combined or separated but are only nominally defined.",
        "source": "T05n0220_067:0378c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0378c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以異生地與名俱自性空故，自性空中若異生地若名俱無所有不可得故。",
        "translation": "It's because both the stage of worldlings and names are empty of their own nature, and it's because both the stage of worldlings and names in their own nature lack existence and are unobtainable.",
        "source": "T05n0220_067:0378c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如種姓地、第八地、具見地、薄地、離欲地、已辦地、獨覺地、菩薩地、如來地名唯客所攝，於十方三世無所從來、無所至去亦無所住，種姓地乃至如來地中無名，名中無種姓地乃至如來地，非合非離但假施設。",
        "translation": "For example, the names of the ground of castes, the eighth ground, the ground of full vision, the thin ground, the ground of freedom from desire, the ground of accomplished, the ground of solitary realizers, the ground of bodhisattvas, and the ground of the Tathāgata are only included by the visitor, have no origin, no destination, and no abode in the three worlds in the ten directions, have no name in the ground of castes or even the ground of the Tathāgata, and have no ground of castes or even the ground of the Tathāgata in their names, and are not combined or separated but are only nominally designated.",
        "source": "T05n0220_067:0378c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0378c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以種姓地乃至如來地與名俱自性空故，自性空中若種姓地乃至如來地若名俱無所有不可得故。",
        "translation": "It's because the seed ground and even the tathāgata ground and names are both empty of their own nature, and it's because the seed ground, even the tathāgata ground and names are both devoid of existence and unobtainable in the sky of their own nature.",
        "source": "T05n0220_067:0378c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩名亦復如是唯客所攝，於十方三世無所從來、無所至去亦無所住，菩薩摩訶薩中無名，名中無菩薩摩訶薩，非合非離但假施設。",
        "translation": "The names of bodhisattvas, mahāsattvas, and buddhas are likewise only included by visitors, have nothing to come from, nothing to go to, and nothing to stay in during the three divisions of the ten directions, have no names within bodhisattvas, and have no bodhisattvas within names, which are neither combined nor separate but are only hypothetical designations.",
        "source": "T05n0220_067:0378c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0378c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩摩訶薩與名俱自性空故，自性空中若菩薩摩訶薩若名俱無所有不可得故。",
        "translation": "It's because the self-nature of both bodhisattvas, mahāsattvas, and names are both empty, and because the self-nature of both bodhisattvas, mahāsattvas, and names are both without existence and unobtainable.",
        "source": "T05n0220_067:0378c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_067:0378c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此緣故我作是說：菩薩摩訶薩但有假名。",
        "translation": "For this reason, I say this: The bodhisattva Mahāsattva merely has a provisional name.",
        "source": "T05n0220_067:0378c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如聲聞乘名唯客所攝，於十方三世無所從來、無所至去亦無所住，聲聞乘中無名，名中無聲聞乘，非合非離但假施設。",
        "translation": "If the names of the śrāvaka vehicles are only included by guests, there's nothing from which they come, nothing to which they go, and nothing in which they stay in the three worlds in the ten directions, there are no names within the śrāvaka vehicles, and there are no śrāvaka vehicles within names, which are neither combined nor separate but are only nominally defined.",
        "source": "T05n0220_067:0379a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0379a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以聲聞乘與名俱自性空故，自性空中若聲聞乘若名俱無所有不可得故。",
        "translation": "It's because the śrāvaka vehicle and names are both empty of their own nature, and because neither the śrāvaka vehicle nor names have anything in their own nature that can be obtained.",
        "source": "T05n0220_067:0379a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如獨覺乘、大乘名唯客所攝，於十方三世無所從來、無所至去亦無所住，獨覺乘、大乘中無名，名中無獨覺乘、大乘，非合非離但假施設。",
        "translation": "Just as the names of the solitary realizer vehicle and the great vehicle are only included by their guests, they come from nowhere, go to nowhere, and have no place to stay in the three worlds in the ten directions, there are no names in the solitary realizer vehicle and the great vehicle, and there are no solitary realizer vehicles or great vehicles in names, which are neither combined nor separate but are only hypothetical designations.",
        "source": "T05n0220_067:0379a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0379a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以獨覺乘、大乘與名俱自性空故，自性空中若獨覺乘、大乘若名俱無所有不可得故。",
        "translation": "It's because the solitary realizer vehicle, the great vehicle, and names are all empty of their own nature, and it's because the solitary realizer vehicle, the great vehicle, and names are both devoid of existence and unobtainable in the sky of their own nature.",
        "source": "T05n0220_067:0379a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩名亦復如是唯客所攝，於十方三世無所從來、無所至去亦無所住，菩薩摩訶薩中無名，名中無菩薩摩訶薩，非合非離但假施設。",
        "translation": "The names of the bodhisattvas, mahāsattvas, and names are likewise nothing but objects, coming from nowhere, going to nowhere, and standing in nowhere in the three worlds in the ten directions, with no names within bodhisattvas, and no bodhisattvas within names, which are neither combined nor separate but only nominally defined.",
        "source": "T05n0220_067:0379a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0379a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩摩訶薩與名俱自性空故，自性空中若菩薩摩訶薩若名俱無所有不可得故。",
        "translation": "It's because the self-nature of both bodhisattvas, mahāsattvas, and names are both empty, and because the self-nature of both bodhisattvas, mahāsattvas, and names are both without existence and unobtainable.",
        "source": "T05n0220_067:0379a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_067:0379a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此緣故我作是說：菩薩摩訶薩但有假名。」",
        "translation": "For this reason, I say this: 'The bodhisattvas, the mahāsattvas, merely have nominal names.'\"",
        "source": "T05n0220_067:0379a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，具壽善現復答舍利子言：「如尊者所云『何緣故說如說我等畢竟不生？』",
        "translation": "At that point, Kauśāmbī replied to Śāriputra, \"Just as the venerable said, 'What are the reasons for saying that we are ultimately unarisen as we've been told?'",
        "source": "T05n0220_067:0379a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者，舍利子！",
        "translation": "He, Śāriputra!",
        "source": "T05n0220_067:0379a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, I have nothing, and since I can't be obtained, how could there be birth?",
        "source": "T05n0220_067:0379a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有情、命者、生者、養者、士夫、補特伽羅、意生、儒童、作者、使作者、起者、使起者、受者、使受者、知者、見者畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, sentient beings, beings of life, beings who are born, beings who are nurtured, men, pudgalas, beings of mind, children, authors, authors of causes, those who arise, those who cause to arise, those who receive, those who cause to receive, those who know, and those who see are all nonexistent, so how could there be birth if it's not possible?",
        "source": "T05n0220_067:0379a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379a25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色畢竟都無所有，既不可得，云何有生？",
        "translation": "If form is ultimately nonexistent, how can there be birth when it's unobtainable?",
        "source": "T05n0220_067:0379a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受、想、行、識畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, sensation, perception, volition, and consciousness are all nonexistent; since they are not obtainable, how could there be birth?",
        "source": "T05n0220_067:0379a26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼處畢竟都無所有，既不可得，云何有生？",
        "translation": "Since the locus of the eye is ultimately nonexistent, how could there be birth if it's unobtainable?",
        "source": "T05n0220_067:0379a28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳、鼻、舌、身、意處畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, the sense-fields of the ear, nose, tongue, body, and mind are nonexistent, and since they're not obtainable, how could there be birth?",
        "source": "T05n0220_067:0379a29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379b01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色處畢竟都無所有，既不可得，云何有生？",
        "translation": "Since the form realm is ultimately nonexistent, how could there be birth if it's unobtainable?",
        "source": "T05n0220_067:0379b01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲、香、味、觸、法處畢竟都無所有，既不可得，云何有生？",
        "translation": "Sound, odor, taste, touch, and the field of dharmas are ultimately nonexistent, and since they are unobtainable, how could there be birth?",
        "source": "T05n0220_067:0379b02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379b03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼界畢竟都無所有，既不可得，云何有生？",
        "translation": "The visual realm is ultimately nonexistent; since it's not obtainable, how could there be birth?",
        "source": "T05n0220_067:0379b03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色界、眼識界及眼觸、眼觸為緣所生諸受畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, the form realm, the visual consciousness realm, and the sensations that arise from eye contact and eye contact as conditions are all nonexistent, so how could there be birth if they're not obtainable?",
        "source": "T05n0220_067:0379b04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379b06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳界畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, the ear realm is completely nonexistent; since it's not obtainable, how could there be birth?",
        "source": "T05n0220_067:0379b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲界、耳識界及耳觸、耳觸為緣所生諸受畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, the sense element of sound, the sense element of auditory consciousness, and the sensations that arise from auditory contact and auditory contact are all nonexistent; since they are nonexistent, how could there be birth?",
        "source": "T05n0220_067:0379b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼻界畢竟都無所有，既不可得，云何有生？",
        "translation": "Since the nasal realm is ultimately devoid of existence, how could there be birth if it's unobtainable?",
        "source": "T05n0220_067:0379b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "香界、鼻識界及鼻觸、鼻觸為緣所生諸受畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, the sense sensations arising from the sense-fields of fragrance and nasal consciousness, as well as from nasal contact and nasal contact as perceptual objects, are all nonexistent, so how could there be birth if they are not obtainable?",
        "source": "T05n0220_067:0379b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舌界畢竟都無所有，既不可得，云何有生？",
        "translation": "Since the tongue realm is ultimately nonexistent, how could there be birth if it's not obtainable?",
        "source": "T05n0220_067:0379b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "味界、舌識界及舌觸、舌觸為緣所生諸受畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact as conditions are all nonexistent, so how could there be birth if they're not obtainable?",
        "source": "T05n0220_067:0379b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身界畢竟都無所有，既不可得，云何有生？",
        "translation": "If the body and its elements are ultimately nonexistent, how can there be birth when they are unobtainable?",
        "source": "T05n0220_067:0379b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觸界、身識界及身觸、身觸為緣所生諸受畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, the contact element, the body-consciousness element, and the sensations that arise from bodily contact and bodily contact as conditions are all nonexistent; since they are nonexistent, how could there be birth?",
        "source": "T05n0220_067:0379b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意界畢竟都無所有，既不可得，云何有生？",
        "translation": "Since the mental factor is ultimately nonexistent, how can there be birth when it's unobtainable?",
        "source": "T05n0220_067:0379b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法界、意識界及意觸、意觸為緣所生諸受畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, the Dharma realm, the realm of consciousness, and the sensations that arise from mental contact and mental contact as objects are all nonexistent; since they are nonexistent, how could there be birth?",
        "source": "T05n0220_067:0379b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, the earth realm is completely nonexistent; since it's unobtainable, how could there be birth?",
        "source": "T05n0220_067:0379b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "水、火、風、空、識界畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, water, fire, wind, air, and the consciousness realm are all nonexistent, and since they are unobtainable, how could there be birth?",
        "source": "T05n0220_067:0379b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, nescience has nothing, and since it's unobtainable, how could there be birth?",
        "source": "T05n0220_067:0379b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱畢竟都無所有，既不可得，云何有生？",
        "translation": "Actions, consciousness, name-and-form, the six sense-fields, touch, feeling, craving, grasping, existence, birth, old age and death, sorrow, pain and vexation are all ultimately nonexistent, and since they are unobtainable, how could there be birth?",
        "source": "T05n0220_067:0379b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空畢竟都無所有，既不可得，云何有生？",
        "translation": "If internal emptiness is ultimately nonexistent, how can there be birth when it's unobtainable?",
        "source": "T05n0220_067:0379b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空畢竟都無所有，既不可得，云何有生？",
        "translation": "External emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, existent emptiness, nonexistent emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, immutable emptiness, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all dharmas, inaccessible emptiness, emptiness without nature, emptiness of own-nature, emptiness of own-nature, and emptiness of own-nature without nature are all nonexistent after all, and since they are not obtainable, how can there be birth?",
        "source": "T05n0220_067:0379b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, the perfection of generosity has nothing, and since it's unobtainable, how could there be birth?",
        "source": "T05n0220_067:0379c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨戒、安忍、精進、靜慮、般若波羅蜜多畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, the pure precepts, patience, effort, meditation, and the perfection of wisdom are all nonexistent, and since they are unobtainable, how could there be birth?",
        "source": "T05n0220_067:0379c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮畢竟都無所有，既不可得，云何有生？",
        "translation": "Since the four meditations are ultimately nonexistent, how could there be birth if they are unobtainable?",
        "source": "T05n0220_067:0379c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無量、四無色定畢竟都無所有，既不可得，云何有生？",
        "translation": "The four immeasurable and four formless concentrations are ultimately nonexistent; since they are not obtainable, how could there be birth?",
        "source": "T05n0220_067:0379c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫畢竟都無所有，既不可得，云何有生？",
        "translation": "If the eight liberations are ultimately nonexistent, how can there be birth when they are unobtainable?",
        "source": "T05n0220_067:0379c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八勝處、九次第定、十遍處畢竟都無所有，既不可得，云何有生？",
        "translation": "The eight abodes of excellence, the nine graduated concentrations, and the ten universal abodes are all ultimately nonexistent; since they are not obtainable, how could there be birth?",
        "source": "T05n0220_067:0379c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念住畢竟都無所有，既不可得，云何有生？",
        "translation": "Since the four bases of mindfulness are ultimately nonexistent, how could there be birth if they are unobtainable?",
        "source": "T05n0220_067:0379c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四正斷、四神足、五根、五力、七等覺支、八聖道支畢竟都無所有，既不可得，云何有生？",
        "translation": "The fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eightfold noble path are all ultimately nonexistent; since they are unobtainable, how could there be birth?",
        "source": "T05n0220_067:0379c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空解脫門畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, the liberation through emptiness has nothing, and since it's unobtainable, how could there be birth?",
        "source": "T05n0220_067:0379c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無相、無願解脫門畢竟都無所有，既不可得，云何有生？",
        "translation": "The aspect of liberation through marklessness and wishlessness is ultimately nonexistent; since it's not obtainable, how could there be birth?",
        "source": "T05n0220_067:0379c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眼畢竟都無所有，既不可得，云何有生？",
        "translation": "Since the five eyes are ultimately nonexistent, how could there be birth if they are unobtainable?",
        "source": "T05n0220_067:0379c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六神通畢竟都無所有，既不可得，云何有生？",
        "translation": "If the six supernormal powers are ultimately nonexistent, how could they come into being if they are unobtainable?",
        "source": "T05n0220_067:0379c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛十力畢竟都無所有，既不可得，云何有生？",
        "translation": "Since the ten powers of the Buddha are ultimately nonexistent, how could there be birth if they are unobtainable?",
        "source": "T05n0220_067:0379c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and the 18 uncommon dharmas of the Buddha are all nonexistent, and since they are unobtainable, how could there be birth?",
        "source": "T05n0220_067:0379c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379c24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智畢竟都無所有，既不可得，云何有生？",
        "translation": "Since all cognition is ultimately nonexistent, how could there be birth if it's unobtainable?",
        "source": "T05n0220_067:0379c24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道相智、一切相智畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, the knowledge of the path and the knowledge of all characteristics lack existence, and since they are unobtainable, how could there be birth?",
        "source": "T05n0220_067:0379c25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379c26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無忘失法畢竟都無所有，既不可得，云何有生？",
        "translation": "Since the state of nonforgetfulness is ultimately nonexistent, how could there be birth if it's not obtainable?",
        "source": "T05n0220_067:0379c26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恒住捨性畢竟都無所有，既不可得，云何有生？",
        "translation": "If the nature of eternally abiding equanimity is ultimately nonexistent, how can there be birth when it's unobtainable?",
        "source": "T05n0220_067:0379c27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0379c29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切陀羅尼門畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, all dhāraṇī teachings are ultimately nonexistent; since they are nonobtainable, how could there be birth?",
        "source": "T05n0220_067:0379c29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切三摩地門畢竟都無所有，既不可得，云何有生？",
        "translation": "All samādhi-gates are ultimately nonexistent, and since they are not obtainable, how could there be birth?",
        "source": "T05n0220_067:0380a01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380a02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極喜地畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, the ground of ultimate bliss has nothing, and since it's unobtainable, how could there be birth?",
        "source": "T05n0220_067:0380a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地畢竟都無所有，既不可得，云何有生？",
        "translation": "After all, the states of freedom from defilement, emission of light, burning wisdom, extremely difficult to overcome, manifestation, distant practice, immovability, good wisdom, and the dharma-cloud state are all nonexistent, and since they are unobtainable, how could there be birth?",
        "source": "T05n0220_067:0380a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "異生地畢竟都無所有，既不可得，云何有生？",
        "translation": "Since the stage of nonproduction is ultimately nonexistent, how could there be production?",
        "source": "T05n0220_067:0380a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種姓地、第八地、具見地、薄地、離欲地、已辦地、獨覺地、菩薩地、如來地畢竟都無所有，既不可得，云何有生？",
        "translation": "The stages of seed, eighth, full view, thin, free from desire, accomplished, solitary realizer, bodhisattva, and tathāgata are all ultimately nonexistent, and since they are unobtainable, how could there be birth?",
        "source": "T05n0220_067:0380a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞乘畢竟都無所有，既不可得，云何有生？",
        "translation": "Since the śrāvaka vehicle is ultimately devoid of existence, how could there be birth if it's unobtainable?",
        "source": "T05n0220_067:0380a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獨覺乘、大乘畢竟都無所有，既不可得，云何有生？",
        "translation": "The pratyekabuddha vehicle and the great vehicle are ultimately nonexistent, and since they cannot be obtained, how could there be birth?",
        "source": "T05n0220_067:0380a11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380a12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此緣故我作是說：如說我等畢竟不生。」",
        "translation": "For this reason, I say this: 'So it's said that we are all ultimately unarisen.'\"",
        "source": "T05n0220_067:0380a12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，具壽善現復答舍利子言：「如尊者所云：何緣故說諸法亦爾都無自性者，舍利子！",
        "translation": "At that point, Kauśāmbī replied to Śāriputra, \"Just as the venerable said, 'What are the reasons for saying that all dharmas are without an own-nature,' Śāriputra?",
        "source": "T05n0220_067:0380a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法都無和合自性。",
        "translation": "\"All dharmas lack the own nature of combination.",
        "source": "T05n0220_067:0380a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0380a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "和合有法自性空故。」",
        "translation": "The self-nature of combining existent dharmas is empty.\"",
        "source": "T05n0220_067:0380a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利子問善現言：「何法都無和合自性？」",
        "translation": "Śāriputra then asked the good manifestation, \"What dharmas all lack the own-nature of conjunction?\"",
        "source": "T05n0220_067:0380a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「舍利子！",
        "translation": "The Śāriputra replied, \"Śāriputra!",
        "source": "T05n0220_067:0380a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色都無和合自性，受、想、行、識都無和合自性。",
        "translation": "There's no combined self-nature of form, and there's no combined self-nature of feeling, perception, volition, and consciousness.",
        "source": "T05n0220_067:0380a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼處都無和合自性，耳、鼻、舌、身、意處都無和合自性。",
        "translation": "There's no combined self-nature in the eye, and there's no combined self-nature in the ear, nose, tongue, body, or mind.",
        "source": "T05n0220_067:0380a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色處都無和合自性，聲、香、味、觸、法處都無和合自性。",
        "translation": "There's no combined self-nature in form, and there's no combined self-nature in sound, odor, taste, touch, or dharma.",
        "source": "T05n0220_067:0380a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼界都無和合自性，色界、眼識界及眼觸、眼觸為緣所生諸受都無和合自性。",
        "translation": "The visual realm has no combined self-nature, and the form realm, the visual consciousness realm, and the sensations that arise from visual contact and visual contact as conditions all have no combined self-nature.",
        "source": "T05n0220_067:0380a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳界都無和合自性，聲界、耳識界及耳觸、耳觸為緣所生諸受都無和合自性。",
        "translation": "The ear realm has no combined self-nature, and the sound realm, the ear-consciousness realm, and the sensations that arise from ear contact and ear contact as causes all have no combined self-nature.",
        "source": "T05n0220_067:0380a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼻界都無和合自性，香界、鼻識界及鼻觸、鼻觸為緣所生諸受都無和合自性。",
        "translation": "\"The nasal realm has no combined self-nature, and the fragrance realm, the nasal consciousness realm, and the sensations that arise from nasal contact and nasal contact as conditions all have no combined self-nature.",
        "source": "T05n0220_067:0380a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舌界都無和合自性，味界、舌識界及舌觸、舌觸為緣所生諸受都無和合自性。",
        "translation": "\"The tongue realm has no combined self-nature, and the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact as conditions all have no combined self-nature.",
        "source": "T05n0220_067:0380a28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380b01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身界都無和合自性，觸界、身識界及身觸、身觸為緣所生諸受都無和合自性。",
        "translation": "\"The body realm has no combined self-nature, and the contact realm, the body-consciousness realm, and the sensations that arise from body contact and body contact as conditions all have no combined self-nature.",
        "source": "T05n0220_067:0380b01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380b03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意界都無和合自性，法界、意識界及意觸、意觸為緣所生諸受都無和合自性。",
        "translation": "The associative self-nature of the mental realm, the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as conditions are all lacking in associative self-nature.",
        "source": "T05n0220_067:0380b03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380b05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界都無和合自性，水、火、風、空、識界都無和合自性。",
        "translation": "The element of earth has no combined self-nature, and the elements of water, fire, wind, air, and consciousness have no combined self-nature.",
        "source": "T05n0220_067:0380b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380b06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明都無和合自性，行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱都無和合自性。",
        "translation": "Nescience has no combined essence, and form, consciousness, name-and-form, the six sense-fields, contact, sensation, craving, appropriation, existence, birth, old age, death, grief, pain, sorrow, and vexation all have no combined essence.",
        "source": "T05n0220_067:0380b07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380b09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空都無和合自性，外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空都無和合自性。",
        "translation": "Inner emptiness has no compatible self-nature, and external emptiness, inner and external emptiness, emptiness, great emptiness, ultimate emptiness, infinite emptiness, dispersed emptiness, immutable emptiness, intrinsic nature emptiness, self-sign emptiness, shared-sign emptiness, emptiness of all things, inaccessible emptiness, natureless emptiness, self-nature emptiness, and natureless self-nature emptiness all have no compatible self-nature.",
        "source": "T05n0220_067:0380b09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多都無和合自性，淨戒、安忍、精進、靜慮、般若波羅蜜多都無和合自性。",
        "translation": "The perfection of generosity has no combined self-nature, and the perfections of pure morality, patience, effort, meditation, and wisdom have no combined self-nature.",
        "source": "T05n0220_067:0380b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮都無和合自性，四無量、四無色定都無和合自性。",
        "translation": "The four meditations have no combined self-nature, and the four immeasurable and four formless concentrations have no combined self-nature.",
        "source": "T05n0220_067:0380b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫都無和合自性，八勝處、九次第定、十遍處都無和合自性。",
        "translation": "The eight liberations have no combined self-nature, and the eight abodes of victory, nine graduated concentrations, and ten universal abodes have no combined self-nature.",
        "source": "T05n0220_067:0380b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念住都無和合自性，四正斷、四神足、五根、五力、七等覺支、八聖道支都無和合自性。",
        "translation": "The four abodes of mindfulness have no combined self-nature, and the four correct eliminations, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eightfold noble path factor all have no combined self-nature.",
        "source": "T05n0220_067:0380b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空解脫門都無和合自性，無相、無願解脫門都無和合自性。",
        "translation": "The liberation through emptiness has no cohesive essence, and the liberation through signlessness and wishlessness has no cohesive essence.",
        "source": "T05n0220_067:0380b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380b23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眼都無和合自性，六神通都無和合自性。",
        "translation": "The five eyes have no combined self-nature, and the six psychic powers have no combined self-nature.",
        "source": "T05n0220_067:0380b23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380b24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛十力都無和合自性，四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法都無和合自性。",
        "translation": "The Buddha's ten powers have no combined self-nature, and the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and 18 Buddha-uncommon dharmas all have no combined self-nature.",
        "source": "T05n0220_067:0380b24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380b26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智都無和合自性，道相智、一切相智都無和合自性。",
        "translation": "\"All cognitions lack the own nature of conjunction, and cognitions of the path and all characteristics lack the own nature of conjunction.",
        "source": "T05n0220_067:0380b26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380b28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無忘失法都無和合自性，恒住捨性都無和合自性。",
        "translation": "\"The absence of forgetfulness has no combined self-nature, and the permanently abiding nature of equanimity has no combined self-nature.",
        "source": "T05n0220_067:0380b28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380b29_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切陀羅尼門都無和合自性，一切三摩地門都無和合自性。",
        "translation": "All dhāraṇī teachings lack the own nature of combination, and all samādhi teachings lack the own nature of combination.",
        "source": "T05n0220_067:0380b29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380c02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極喜地都無和合自性，離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地都無和合自性。",
        "translation": "The ground of ultimate joy has no cohesive essence, and the ground of freedom from defilement, the ground of emission of light, the ground of burning wisdom, the ground of extreme difficulty, the ground of direct presence, the ground of distant practice, the ground of immovability, the ground of good wisdom, and the ground of clouds of reality all have no cohesive essence.",
        "source": "T05n0220_067:0380c02_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380c05_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "異生地都無和合自性，種姓地、第八地、具見地、薄地、離欲地、已辦地、獨覺地、菩薩地、如來地都無和合自性。",
        "translation": "None of the stages of worldlings has the own nature of conjunction, and none of the stages of caste, the eighth stage, the stage of full view, the thin stage, the stage of freedom from desire, the stage of accomplished, the stage of solitary realizers, the stage of bodhisattvas, or the stage of the Tathāgata has the own nature of conjunction.",
        "source": "T05n0220_067:0380c05_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380c07_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞乘都無和合自性，獨覺乘、大乘都無和合自性。",
        "translation": "None of the śrāvaka vehicles have a combined self-nature, and neither the solitary realizer vehicle nor the great vehicle have a combined self-nature.",
        "source": "T05n0220_067:0380c07_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380c09_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此緣故我作是說：諸法亦爾，都無自性。",
        "translation": "For this reason, I say this: \"So it is with all things, for they lack self-nature.",
        "source": "T05n0220_067:0380c09_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_067:0380c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法非常亦無散失。",
        "translation": "\"The dharmas are impermanent and not distracted.",
        "source": "T05n0220_067:0380c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0380c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法非常，無盡性故。」",
        "translation": "If a dharma is impermanent, it's because of its inexhaustible nature.\"",
        "source": "T05n0220_067:0380c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利子問善現言：「何法非常亦無散失？」",
        "translation": "Śāriputra then asked the good sage, \"What's impermanent and not dissipated?\"",
        "source": "T05n0220_067:0380c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「舍利子！",
        "translation": "The Śāriputra replied, \"Śāriputra!",
        "source": "T05n0220_067:0380c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色非常亦無散失，受、想、行、識非常亦無散失。",
        "translation": "Form is impermanent and undistorted, and feeling, perception, volition, and consciousness are impermanent and undistorted.",
        "source": "T05n0220_067:0380c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼處非常亦無散失，耳、鼻、舌、身、意處非常亦無散失。",
        "translation": "The sense-field of the eye is impermanent and undistracted, and the sense-fields of the ear, nose, tongue, body, and mind are impermanent and undistracted.",
        "source": "T05n0220_067:0380c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色處非常亦無散失，聲、香、味、觸、法處非常亦無散失。",
        "translation": "The form realm is impermanent and not distracted, and the sound, smell, taste, touch, and dharma realms are impermanent and not distracted.",
        "source": "T05n0220_067:0380c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼界非常亦無散失，色界、眼識界及眼觸、眼觸為緣所生諸受非常亦無散失。",
        "translation": "The visual realm is neither permanent nor distracted, and the form realm, the visual consciousness realm, and the sensations that arise from visual contact and visual contact as conditions are neither permanent nor distracted.",
        "source": "T05n0220_067:0380c18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳界非常亦無散失，聲界、耳識界及耳觸、耳觸為緣所生諸受非常亦無散失。",
        "translation": "The ear realm is neither permanent nor distracted, and the sound realm, ear-consciousness realm, and the sensations that arise from ear contact and ear contact are neither permanent nor distracted.",
        "source": "T05n0220_067:0380c20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380c21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼻界非常亦無散失，香界、鼻識界及鼻觸、鼻觸為緣所生諸受非常亦無散失。",
        "translation": "The olfactory sense element is neither permanent nor distracted, and the sense elements of fragrance, nasal consciousness, and the sensations that arise from nasal contact and nasal contact are neither permanent nor distracted.",
        "source": "T05n0220_067:0380c22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380c23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舌界非常亦無散失，味界、舌識界及舌觸、舌觸為緣所生諸受非常亦無散失。",
        "translation": "The tongue realm is neither permanent nor distracted, and the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact are neither permanent nor distracted.",
        "source": "T05n0220_067:0380c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身界非常亦無散失，觸界、身識界及身觸、身觸為緣所生諸受非常亦無散失。",
        "translation": "The body realm is impermanent and undistorted, and the contact realm, body-consciousness realm, and the sensations that arise from body contact and body contact as conditions are impermanent and undistorted.",
        "source": "T05n0220_067:0380c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意界非常亦無散失，法界、意識界及意觸、意觸為緣所生諸受非常亦無散失。",
        "translation": "The mental realm is neither permanent nor distracted, and the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as conditions are neither permanent nor distracted.",
        "source": "T05n0220_067:0380c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0380c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界非常亦無散失，水、火、風、空、識界非常亦無散失。",
        "translation": "The element of earth is impermanent and undistorted, and the elements of water, fire, wind, air, and consciousness are impermanent and undistorted.",
        "source": "T05n0220_067:0381a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦聖諦非常亦無散失，集、滅、道聖諦非常亦無散失。",
        "translation": "The noble truth of suffering is neither permanent nor distracted, and the noble truths of accumulation, cessation, and the path are neither permanent nor distracted.",
        "source": "T05n0220_067:0381a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明非常亦無散失，行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱非常亦無散失。",
        "translation": "While nescience is neither permanent nor dissipated, formations, consciousness, name-and-form, the six sense-fields, contact, sensation, craving, appropriation, existence, birth, old age, grief, pain, sorrow, and vexation are neither permanent nor dissipated.",
        "source": "T05n0220_067:0381a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空非常亦無散失，外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空非常亦無散失。",
        "translation": "Inner emptiness is neither permanent nor distracting, and external emptiness, inner and external emptiness, emptiness, great emptiness, ultimate emptiness, infinite emptiness, dispersed emptiness, unchanging emptiness, emptiness of original nature, emptiness of own-nature, emptiness of shared characteristics, emptiness of all things, inaccessible emptiness, emptiness of naturelessness, emptiness of self-nature, and emptiness of naturelessness of self-nature are neither permanent nor distracting.",
        "source": "T05n0220_067:0381a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多非常亦無散失，淨戒、安忍、精進、靜慮、般若波羅蜜多非常亦無散失。",
        "translation": "The perfection of generosity is neither lost nor non-distracted, and the perfections of pure precepts, patience, effort, meditation, and wisdom are neither lost nor non-distracted.",
        "source": "T05n0220_067:0381a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮非常亦無散失，四無量、四無色定非常亦無散失。",
        "translation": "The four meditations are neither permanent nor distracting, and the four immeasurable and four formless concentrations are neither permanent nor distracting.",
        "source": "T05n0220_067:0381a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫非常亦無散失，八勝處、九次第定、十遍處非常亦無散失。",
        "translation": "The eight liberations are neither permanent nor distracting, and the eight abodes of excellence, nine graduated concentrations, and ten universal abodes are neither permanent nor distracting.",
        "source": "T05n0220_067:0381a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念住非常亦無散失，四正斷、四神足、五根、五力、七等覺支、八聖道支非常亦無散失。",
        "translation": "The four abodes of mindfulness are neither permanent nor distracted, and the four correct eliminations, four miraculous abilities, five faculties, five powers, seven factors of virtual enlightenment, and eight noble factors of the path are neither permanent nor distracted.",
        "source": "T05n0220_067:0381a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空解脫門非常亦無散失，無相、無願解脫門非常亦無散失。",
        "translation": "The liberation through emptiness is neither permanent nor distracting, and the liberation through signlessness and wishlessness is neither permanent nor distracting.",
        "source": "T05n0220_067:0381a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眼非常亦無散失，六神通非常亦無散失。",
        "translation": "The five eyes are impermanent and unperturbed, and the six psychic powers are impermanent and unperturbed.",
        "source": "T05n0220_067:0381a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛十力非常亦無散失，四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法非常亦無散失。",
        "translation": "The Buddha's ten powers are neither impermanent nor distracting, and the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and 18 distinctive characteristics of the Buddha are neither impermanent nor distracting.",
        "source": "T05n0220_067:0381a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智非常亦無散失，道相智、一切相智非常亦無散失。",
        "translation": "\"Omniscience is neither impermanent nor dispersed, and knowledge of the path and knowledge of all characteristics are neither impermanent nor dispersed.",
        "source": "T05n0220_067:0381a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無忘失法非常亦無散失，恒住捨性非常亦無散失。",
        "translation": "The Dharma of no forgetfulness is neither permanent nor distracting, and the nature of constantly abiding equanimity is neither permanent nor distracting.",
        "source": "T05n0220_067:0381a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切陀羅尼門非常亦無散失，一切三摩地門非常亦無散失。",
        "translation": "\"All the dhāraṇī teachings are neither permanent nor dispersed, and all the samādhi teachings are neither permanent nor dispersed.",
        "source": "T05n0220_067:0381a26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381a28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極喜地非常亦無散失，離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地非常亦無散失。",
        "translation": "The ground of ultimate joy is neither dissipated nor defiled, and the ground of freedom from pollution, the ground of luminosity, the ground of burning wisdom, the ground of extreme difficulty, the ground of direct presence, the ground of distant practice, the ground of immovability, the ground of good wisdom, and the ground of clouds of reality are neither dissipated nor defiled.",
        "source": "T05n0220_067:0381a28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381b01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "異生地非常亦無散失，種姓地、第八地、具見地、薄地、離欲地、已辦地、獨覺地、菩薩地、如來地非常亦無散失。",
        "translation": "The stage of unborn is neither impermanent nor distracted, and the stages of caste, eighth, fully visible, weak, free from desire, accomplished, solitary realizer, bodhisattva, and tathāgata are neither impermanent nor distracted.",
        "source": "T05n0220_067:0381b02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381b04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞乘非常亦無散失，獨覺乘、大乘非常亦無散失。",
        "translation": "The śrāvaka vehicle is neither impermanent nor distracted, and the solitary realizer vehicle and the great vehicle are neither impermanent nor distracted.",
        "source": "T05n0220_067:0381b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此緣故我作是說：諸法亦爾，都無自性。",
        "translation": "For this reason, I say this: \"So it is with all things, for they lack self-nature.",
        "source": "T05n0220_067:0381b06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_067:0381b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法非樂亦無散失。",
        "translation": "\"The dharmas are not pleasant, and there's no loss.",
        "source": "T05n0220_067:0381b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0381b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法非樂，無盡性故。」",
        "translation": "If something isn't pleasant, it's because of its inexhaustible nature.\"",
        "source": "T05n0220_067:0381b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利子問善現言：「何法非樂亦無散失？」",
        "translation": "Śāriputra then asked the good manifestation, \"What's not pleasant and has no dissipation?\"",
        "source": "T05n0220_067:0381b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「舍利子！",
        "translation": "The Śāriputra replied, \"Śāriputra!",
        "source": "T05n0220_067:0381b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色非樂亦無散失，受、想、行、識非樂亦無散失。",
        "translation": "Form is neither pleasant nor dissipated, and feeling, perception, volition, and consciousness are neither pleasant nor dissipated.",
        "source": "T05n0220_067:0381b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼處非樂亦無散失，耳、鼻、舌、身、意處非樂亦無散失。",
        "translation": "The sense-field of the eye is neither pleasant nor distracting, and the sense-fields of the ear, nose, tongue, body, and mind are neither pleasant nor distracting.",
        "source": "T05n0220_067:0381b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色處非樂亦無散失，聲、香、味、觸、法處非樂亦無散失。",
        "translation": "The sense-field of form is neither pleasant nor distracting, and the sense-fields of sound, odor, taste, touch, and dharma are neither pleasant nor distracting.",
        "source": "T05n0220_067:0381b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼界非樂亦無散失，色界、眼識界及眼觸、眼觸為緣所生諸受非樂亦無散失。",
        "translation": "The visual realm is neither pleasant nor distracting, and the form realm, the visual consciousness realm, and the sensations that arise from visual contact and visual contact as perceptual objects are neither pleasant nor distracting.",
        "source": "T05n0220_067:0381b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳界非樂亦無散失，聲界、耳識界及耳觸、耳觸為緣所生諸受非樂亦無散失。",
        "translation": "The ear realm is neither pleasant nor distracting, and the sound realm, ear-consciousness realm, and the sensations that arise from ear contact and ear contact are neither pleasant nor distracting.",
        "source": "T05n0220_067:0381b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼻界非樂亦無散失，香界、鼻識界及鼻觸、鼻觸為緣所生諸受非樂亦無散失。",
        "translation": "The olfactory sense element is neither pleasant nor distracting, and the sensations that arise from the sense element of fragrance, the sense element of nasal consciousness, and nasal contact and nasal contact as perceptual objects are neither pleasant nor distracting.",
        "source": "T05n0220_067:0381b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舌界非樂亦無散失，味界、舌識界及舌觸、舌觸為緣所生諸受非樂亦無散失。",
        "translation": "The tongue realm is neither pleasant nor distracting, and the taste realm, tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact as perceptual objects are neither pleasant nor distracting.",
        "source": "T05n0220_067:0381b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身界非樂亦無散失，觸界、身識界及身觸、身觸為緣所生諸受非樂亦無散失。",
        "translation": "The body realm is neither pleasant nor distracting, and the contact realm, the body-consciousness realm, and the sensations that arise from body contact and body contact as conditions are neither pleasant nor distracting.",
        "source": "T05n0220_067:0381b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意界非樂亦無散失，法界、意識界及意觸、意觸為緣所生諸受非樂亦無散失。",
        "translation": "The mental realm is not pleasant, and there's no dissipation; the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as objects are not pleasant, and there's no dissipation.",
        "source": "T05n0220_067:0381b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界非樂亦無散失，水、火、風、空、識界非樂亦無散失。",
        "translation": "The element of earth is neither pleasant nor dissipated, and the elements of water, fire, wind, air, and consciousness are neither pleasant nor dissipated.",
        "source": "T05n0220_067:0381b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦聖諦非樂亦無散失，集、滅、道聖諦非樂亦無散失。",
        "translation": "The noble truth of suffering is neither enjoyed nor dissipated, and the noble truths of accumulation, cessation, and the path are neither enjoyed nor dissipated.",
        "source": "T05n0220_067:0381b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明非樂亦無散失，行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱非樂亦無散失。",
        "translation": "Nescience is neither pleasant nor dissipated, and formations, consciousness, name-and-form, the six sense-fields, contact, sensation, craving, appropriation, existence, birth, old age, sorrow, suffering, grief, and vexation are neither pleasant nor dissipated.",
        "source": "T05n0220_067:0381b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空非樂亦無散失，外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空非樂亦無散失。",
        "translation": "Internal emptiness is neither pleasant nor distracting, and external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, infinite emptiness, dispersed emptiness, unchanging emptiness, emptiness of original nature, emptiness of own-nature, emptiness of shared characteristics, emptiness of all things, inaccessible emptiness, emptiness of naturelessness, emptiness of self-nature, and emptiness of naturelessness of self-nature are neither pleasant nor distracting.",
        "source": "T05n0220_067:0381c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多非樂亦無散失，淨戒、安忍、精進、靜慮、般若波羅蜜多非樂亦無散失。",
        "translation": "The perfection of generosity is neither pleasant nor distracting, and the perfections of pure morality, patience, effort, meditation, and wisdom are neither pleasant nor distracting.",
        "source": "T05n0220_067:0381c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮非樂亦無散失，四無量、四無色定非樂亦無散失。",
        "translation": "The four meditations are neither enjoyable nor distracting, and the four immeasurable and four formless concentrations are neither enjoyable nor distracting.",
        "source": "T05n0220_067:0381c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫非樂亦無散失，八勝處、九次第定、十遍處非樂亦無散失。",
        "translation": "The eight liberations are neither pleasant nor distracting, and the eight abodes of excellence, nine graduated concentrations, and ten universal abodes are neither pleasant nor distracting.",
        "source": "T05n0220_067:0381c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念住非樂亦無散失，四正斷、四神足、五根、五力、七等覺支、八聖道支非樂亦無散失。",
        "translation": "The four abodes of mindfulness are neither pleasant nor distracting, and the four correct eliminations, four miraculous abilities, five faculties, five powers, seven factors of virtual enlightenment, and eight noble factors of the path are neither pleasant nor distracting.",
        "source": "T05n0220_067:0381c13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空解脫門非樂亦無散失，無相、無願解脫門非樂亦無散失。",
        "translation": "The liberation through emptiness is neither pleasant nor distracting, and the liberation through signlessness and wishlessness is neither pleasant nor distracting.",
        "source": "T05n0220_067:0381c15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眼非樂亦無散失，六神通非樂亦無散失。",
        "translation": "The five eyes are neither enjoyed nor dissipated, and the six psychic powers are neither enjoyed nor dissipated.",
        "source": "T05n0220_067:0381c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛十力非樂亦無散失，四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法非樂亦無散失。",
        "translation": "The Buddha's ten powers are neither enjoyed nor dissipated, and the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and 18 distinctive characteristics of the Buddha are neither enjoyed nor dissipated.",
        "source": "T05n0220_067:0381c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智非樂亦無散失，道相智、一切相智非樂亦無散失。",
        "translation": "\"Omniscience is neither pleasant nor dissipated, and knowledge of the path and knowledge of all characteristics are neither pleasant nor dissipated.",
        "source": "T05n0220_067:0381c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無忘失法非樂亦無散失，恒住捨性非樂亦無散失。",
        "translation": "The state of no forgetfulness is neither pleasant nor distracting, and the nature of constantly abiding equanimity is neither pleasant nor distracting.",
        "source": "T05n0220_067:0381c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切陀羅尼門非樂亦無散失，一切三摩地門非樂亦無散失。",
        "translation": "\"All dhāraṇī teachings are neither pleasant nor distracting, and all samādhi teachings are neither pleasant nor distracting.",
        "source": "T05n0220_067:0381c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極喜地非樂亦無散失，離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地非樂亦無散失。",
        "translation": "The ground of ultimate joy is neither pleasant nor distracting, and the grounds of freedom from defilement, luminosity, burning wisdom, overwhelming difficulty, direct presence, teleportation, immovability, good wisdom, and the cloud of the Dharma are neither pleasant nor distracting.",
        "source": "T05n0220_067:0381c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0381c28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "異生地非樂亦無散失，種姓地、第八地、具見地、薄地、離欲地、已辦地、獨覺地、菩薩地、如來地非樂亦無散失。",
        "translation": "The stage of unenlightened sentient beings is neither pleasant nor distracting, and the stages of caste, eighth, fully visible, weak, free of desire, accomplished, solitary realizer, bodhisattva, and tathāgata are neither pleasant nor distracting.",
        "source": "T05n0220_067:0381c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0382a02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞乘非樂亦無散失，獨覺乘、大乘非樂亦無散失。",
        "translation": "The direct disciple's vehicle is neither pleasant nor dissipated, and the solitary realizer's vehicle and the great vehicle are neither pleasant nor dissipated.",
        "source": "T05n0220_067:0382a02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0382a03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此緣故我作是說：諸法亦爾，都無自性。",
        "translation": "For this reason, I say this: \"So it is with all things, for they lack self-nature.",
        "source": "T05n0220_067:0382a03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_067:0382a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法非我亦無散失。",
        "translation": "\"The dharmas are not self, and there's no loss.",
        "source": "T05n0220_067:0382a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_067:0382a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法非我，無盡性故。」",
        "translation": "If a dharma isn't self, it's inexhaustible.\"",
        "source": "T05n0220_067:0382a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利子問善現言：「何法非我亦無散失？」",
        "translation": "Śāriputra then asked the good manifestation, \"What's not self and has no loss?\"",
        "source": "T05n0220_067:0382a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「舍利子！",
        "translation": "The Śāriputra replied, \"Śāriputra!",
        "source": "T05n0220_067:0382a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色非我亦無散失，受、想、行、識非我亦無散失。",
        "translation": "Form is not self and isn't distracted, and feeling, perception, volition, and consciousness are not self and aren't distracted.",
        "source": "T05n0220_067:0382a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0382a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼處非我亦無散失，耳、鼻、舌、身、意處非我亦無散失。",
        "translation": "The sense-field of the eye is not self and is not distracted, and the sense-fields of the ear, nose, tongue, body, and mind are not self and are not distracted.",
        "source": "T05n0220_067:0382a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0382a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色處非我亦無散失，聲、香、味、觸、法處非我亦無散失。",
        "translation": "The form realm is not self and isn't distracted, and the sound, smell, taste, touch, and dharma realms are not self and aren't distracted.",
        "source": "T05n0220_067:0382a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0382a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼界非我亦無散失，色界、眼識界及眼觸、眼觸為緣所生諸受非我亦無散失。",
        "translation": "The element of vision is not self and isn't distracted, and the elements of form and visual consciousness and the sensations that arise from visual contact and visual contact as conditions are not self and aren't distracted.",
        "source": "T05n0220_067:0382a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0382a13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳界非我亦無散失，聲界、耳識界及耳觸、耳觸為緣所生諸受非我亦無散失。",
        "translation": "The ear realm is not self and isn't distracted, and the sound realm, ear-consciousness realm, and the sensations that arise from ear contact and ear contact as causes are not self and aren't distracted.",
        "source": "T05n0220_067:0382a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0382a15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼻界非我亦無散失，香界、鼻識界及鼻觸、鼻觸為緣所生諸受非我亦無散失。",
        "translation": "The nasal sense element is not self and isn't distracted, and the sense elements of fragrance, nasal consciousness, and the sensations that arise from nasal contact and nasal contact as perceptual objects are not self and aren't distracted.",
        "source": "T05n0220_067:0382a15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0382a17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舌界非我亦無散失，味界、舌識界及舌觸、舌觸為緣所生諸受非我亦無散失。",
        "translation": "The tongue realm is not self and isn't distracted, and the taste realm, tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact are not self and aren't distracted.",
        "source": "T05n0220_067:0382a17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0382a19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身界非我亦無散失，觸界、身識界及身觸、身觸為緣所生諸受非我亦無散失。",
        "translation": "The body realm is not self and isn't distracted, and the contact realm, body-consciousness realm, and the sensations that arise from body contact and body contact as conditions are not self and aren't distracted.",
        "source": "T05n0220_067:0382a19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0382a21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意界非我亦無散失，法界、意識界及意觸、意觸為緣所生諸受非我亦無散失。",
        "translation": "The mental realm is not self and isn't distracted, and the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as conditions are not self and aren't distracted.",
        "source": "T05n0220_067:0382a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0382a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界非我亦無散失，水、火、風、空、識界非我亦無散失。",
        "translation": "The element of earth is not self and is not distracted, and the elements of water, fire, wind, air, and consciousness are not self and are not distracted.",
        "source": "T05n0220_067:0382a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0382a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦聖諦非我亦無散失，集、滅、道聖諦非我亦無散失。",
        "translation": "The noble truth of suffering is not self and is not distracted, and the noble truths of arising, ceasing, and the path are not self and are not distracted.",
        "source": "T05n0220_067:0382a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0382a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明非我亦無散失，行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱非我亦無散失。",
        "translation": "Nescience is not self and isn't distracted, and formations, consciousness, name-and-form, the six sense-fields, contact, sensation, craving, appropriation, existence, birth, old age, sorrow, suffering, grief, and vexation are not self and aren't distracted.",
        "source": "T05n0220_067:0382a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_067:0382a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空非我亦無散失，外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空非我亦無散失。",
        "translation": "Internal emptiness is not self and has no loss, and external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, infinite emptiness, dispersed emptiness, unchanging emptiness, emptiness of original nature, emptiness of own-nature, emptiness of shared characteristics, emptiness of all things, inaccessible emptiness, emptiness of naturelessness, emptiness of self-nature, and emptiness of naturelessness of self-nature are not self and have no loss.",
        "source": "T05n0220_067:0382a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第六十七",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 67",
        "source": "T05n0220_067:0382b05_0",
        "is_bad_quality": false
    }
]