[
    {
        "source_sentence": "大般若波羅蜜多經卷第二十五",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 25",
        "source": "T05n0220_025:0136c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T05n0220_025:0136c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初分教誡教授品第七之十五",
        "translation": "The Seventh 15 of the Chapter on the Precepts of the First Part of the Teachings",
        "source": "T05n0220_025:0136c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0136c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼界若有為若無為增語非菩薩摩訶薩，即耳、鼻、舌、身、意界若有為若無為增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying that it's not a bodhisattva-mahāsattva to augment speech whether it's with or without effort in the eye realm, and it's not a bodhisattva to augment speech whether it's with or without effort in the ear, nose, tongue, body, or mind realm?\"",
        "source": "T05n0220_025:0136c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0136c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼界有為無為，若耳、鼻、舌、身、意界有為無為，尚畢竟不可得，性非有故，況有眼界有為無為增語及耳、鼻、舌、身、意界有為無為增語！",
        "translation": "If there are existent and inactive states of view, and if there are existent and inactive states of ear, nose, tongue, body, and mind, they are ultimately unobtainable and non-existent in nature, so why should there be existent and inactive augmentative speech in the visual realm and existent and inactive augmentative speech in the ear, nose, tongue, body, and mind?",
        "source": "T05n0220_025:0136c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼界若有為若無為增語是菩薩摩訶薩，即耳、鼻、舌、身、意界若有為若無為增語是菩薩摩訶薩？」",
        "translation": "Since this intensification is not existent, how can it be said that the intensification of speech whether existent or inexistent in the eye realm is bodhisattva-mahāsattva and that the intensification of speech whether existent or inexistent in the ear, nose, tongue, body, or mind realm is bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0136c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0136c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼界若有漏若無漏增語非菩薩摩訶薩，即耳、鼻、舌、身、意界若有漏若無漏增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, whether contaminated or uncontaminated augmentative speech in the eye realm is not bodhisattva, and whether contaminated or uncontaminated augmentative speech in the ear, nose, tongue, body, and mind realms is not bodhisattva-mahāsattva?'\"",
        "source": "T05n0220_025:0136c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0136c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼界有漏無漏，若耳、鼻、舌、身、意界有漏無漏，尚畢竟不可得，性非有故，況有眼界有漏無漏增語及耳、鼻、舌、身、意界有漏無漏增語！",
        "translation": "If the contaminated and uncontaminated eye realm and the contaminated and uncontaminated ear, nose, tongue, body, and mind realms are ultimately unobtainable and non-existent in nature, how much more should there be contaminated and uncontaminated additional speech in the eye realm and contaminated and uncontaminated additional speech in the ear, nose, tongue, body, and mind realms!",
        "source": "T05n0220_025:0136c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼界若有漏若無漏增語是菩薩摩訶薩，即耳、鼻、舌、身、意界若有漏若無漏增語是菩薩摩訶薩？」",
        "translation": "Since this intensifier is not present, how can it be said that the eye realm is a bodhisattva-mahāsattva if it is a contaminated or uncontaminated intensifier, or that the ear, nose, tongue, body, and mind realms are bodhisattvas-mahāsattvas if they are contaminated or uncontaminated intensifiers?\"",
        "source": "T05n0220_025:0136c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0136c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼界若生若滅增語非菩薩摩訶薩，即耳、鼻、舌、身、意界若生若滅增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, whether the eye realm arises or ceases, increased speech is not bodhisattva-mahāsattva, and whether the ear, nose, tongue, body, or mind realm arises or ceases, increased speech is not bodhisattva-mahāsattva?'\"",
        "source": "T05n0220_025:0136c26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0136c28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼界生滅，若耳、鼻、舌、身、意界生滅，尚畢竟不可得，性非有故，況有眼界生滅增語及耳、鼻、舌、身、意界生滅增語！",
        "translation": "If the arising and ceasing of the eye realm and the arising and ceasing of the ear, nose, tongue, body, and mind realms are ultimately unobtainable and non-existent in nature, how could there be additional speech about the arising and ceasing of the eye realm and additional speech about the arising and ceasing of the ear, nose, tongue, body, and mind realms?",
        "source": "T05n0220_025:0136c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼界若生若滅增語是菩薩摩訶薩，即耳、鼻、舌、身、意界若生若滅增語是菩薩摩訶薩？」",
        "translation": "Since this intensification is not present, how can it be said that the eye realm is a bodhisattva-mahāsattva if it arises or ceases to speak intensively, and that the ear, nose, tongue, body, and mind realms are bodhisattvas-mahāsattvas if they arise or cease to speak intensively?\"",
        "source": "T05n0220_025:0137a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0137a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼界若善若非善增語非菩薩摩訶薩，即耳、鼻、舌、身、意界若善若非善增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, if the element of the eye is good or not good, increased speech is not bodhisattva, and if the element of the ear, nose, tongue, body, and mind is good or not good, increased speech is not bodhisattva?'\"",
        "source": "T05n0220_025:0137a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0137a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼界善非善，若耳、鼻、舌、身、意界善非善，尚畢竟不可得，性非有故，況有眼界善非善增語及耳、鼻、舌、身、意界善非善增語！",
        "translation": "If the eye realm is good and not good, and if the ear, nose, tongue, body, and mind realms are good and not good, they are ultimately unobtainable and do not exist in nature, so how could there be good and not-good intensified speech in the eye realm and good and not-good intensified speech in the ear, nose, tongue, body, and mind realms?",
        "source": "T05n0220_025:0137a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼界若善若非善增語是菩薩摩訶薩，即耳、鼻、舌、身、意界若善若非善增語是菩薩摩訶薩？",
        "translation": "Since this intensification is not present, how can it be said that the eye realm is a bodhisattva-mahāsattva if it's a good or not good intensification, and the ear, nose, tongue, body, and mind realms are bodhisattvas-mahāsattvas if it's a good or not good intensification?",
        "source": "T05n0220_025:0137a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0137a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼界若有罪若無罪增語非菩薩摩訶薩，即耳、鼻、舌、身、意界若有罪若無罪增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, if the element of the eye is blameworthy or blameless, increased speech is not bodhisattva-mahāsattva, and if the element of the ear, nose, tongue, body, and mind is blameworthy or blameless, increased speech is not bodhisattva-mahāsattva?'\"",
        "source": "T05n0220_025:0137a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0137a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼界有罪無罪，若耳、鼻、舌、身、意界有罪無罪，尚畢竟不可得，性非有故，況有眼界有罪無罪增語及耳、鼻、舌、身、意界有罪無罪增語！",
        "translation": "If the eye realm is guilty and blameless, and if the ear, nose, tongue, body, and mind realms are guilty and blameless, they are ultimately unobtainable and non-existent in nature, so why should there be additional words about the eye realm being guilty and blameless and additional words about the ear, nose, tongue, body, and mind realms being guilty and blameless?",
        "source": "T05n0220_025:0137a16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼界若有罪若無罪增語是菩薩摩訶薩，即耳、鼻、舌、身、意界若有罪若無罪增語是菩薩摩訶薩？」",
        "translation": "Since these intensifying words are not present, how can it be said that the intensifying words of the eye-realm, whether guilty or not, are bodhisattva-mahāsattvas, and that the intensifying words of the ear, nose, tongue, body, and mind realms, whether guilty or not, are bodhisattvas-mahāsattvas?\"",
        "source": "T05n0220_025:0137a19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0137a21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼界若有煩惱若無煩惱增語非菩薩摩訶薩，即耳、鼻、舌、身、意界若有煩惱若無煩惱增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'It's not bodhisattva-mahāsattva to have afflictions or to speak intensively with no afflictions in the eye realm, and it's not bodhisattva to have afflictions or to speak intensively with no afflictions in the ear, nose, tongue, body, or mind realm?'\"",
        "source": "T05n0220_025:0137a22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0137a24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼界有煩惱無煩惱，若耳、鼻、舌、身、意界有煩惱無煩惱，尚畢竟不可得，性非有故，況有眼界有煩惱無煩惱增語及耳、鼻、舌、身、意界有煩惱無煩惱增語！",
        "translation": "If there are afflictions and non-afflictions in the eye realm, and if there are afflictions and non-afflictions in the ear, nose, tongue, body, and mind realms, they are ultimately unobtainable and non-existent in nature, so why should there be additional words about afflictions and non-afflictions in the eye realm and additional words about afflictions and non-afflictions in the ear, nose, tongue, body, and mind realms?",
        "source": "T05n0220_025:0137a25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼界若有煩惱若無煩惱增語是菩薩摩訶薩，即耳、鼻、舌、身、意界若有煩惱若無煩惱增語是菩薩摩訶薩？」",
        "translation": "Since this intensifier is not present, how can it be said that the eye realm is a bodhisattva-mahāsattva if it has afflictions or if it has no afflictions intensifier, and that the ear, nose, tongue, body, and mind realms are bodhisattvas-mahāsattvas if they have afflictions or if they have no afflictions intensifier?\"",
        "source": "T05n0220_025:0137a28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0137b02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼界若世間若出世間增語非菩薩摩訶薩，即耳、鼻、舌、身、意界若世間若出世間增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That which is augmented by the eye realm, whether mundane or transmundane, is not bodhisattva-mahāsattva, and that which is augmented by the ear, nose, tongue, body, and mind realms, whether mundane or transmundane, is not bodhisattva-mahāsattva?'\"",
        "source": "T05n0220_025:0137b02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0137b05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼界世間出世間，若耳、鼻、舌、身、意界世間出世間，尚畢竟不可得，性非有故，況有眼界世間出世間增語及耳、鼻、舌、身、意界世間出世間增語！",
        "translation": "If the eye realm is mundane and transmundane, and if the ear, nose, tongue, body, and mind realms are mundane and transmundane, they are ultimately unobtainable and non-existent in nature, so why should there be additional speech about the eye realm being mundane and transmundane and additional speech about the ear, nose, tongue, body, and mind realms being mundane and transmundane?",
        "source": "T05n0220_025:0137b05_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼界若世間若出世間增語是菩薩摩訶薩，即耳、鼻、舌、身、意界若世間若出世間增語是菩薩摩訶薩？」",
        "translation": "Since this augmentation is not present, how can it be said that the augmentation of the eye realm that is worldly and transmundane is bodhisattva-mahāsattva and the augmentation of the ear, nose, tongue, body, and mind realms that is worldly and transmundane is bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0137b08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0137b11_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼界若雜染若清淨增語非菩薩摩訶薩，即耳、鼻、舌、身、意界若雜染若清淨增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That which is defiled or purified by the eye realm is not bodhisattva-mahāsattva, and that which is defiled or purified by the ear, nose, tongue, body, and mind realms is not bodhisattva-mahāsattva?'\"",
        "source": "T05n0220_025:0137b11_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0137b14_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼界雜染清淨，若耳、鼻、舌、身、意界雜染清淨，尚畢竟不可得，性非有故，況有眼界雜染清淨增語及耳、鼻、舌、身、意界雜染清淨增語！",
        "translation": "If the eye realm is defiled and pure, and if the ear, nose, tongue, body, and mind realms are defiled and pure, they are ultimately unobtainable and do not exist in nature, so why should there be additional words about the eye realm being defiled and pure and additional words about the ear, nose, tongue, body, and mind realms being defiled and pure?",
        "source": "T05n0220_025:0137b14_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼界若雜染若清淨增語是菩薩摩訶薩，即耳、鼻、舌、身、意界若雜染若清淨增語是菩薩摩訶薩？」",
        "translation": "Since this intensification is not present, how can it be said that the intensification of speech in the eye realm that is defiled or purified is bodhisattva-mahāsattva and that the intensification of speech in the ear, nose, tongue, body, and mind realms that is defiled or purified is bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0137b17_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0137b20_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼界若屬生死若屬涅槃增語非菩薩摩訶薩，即耳、鼻、舌、身、意界若屬生死若屬涅槃增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying that it's not the bodhisattva-mahāsattva who augments speech in the eye realm if it's birth-and-death or nirvāṇa, and that it's not the bodhisattva-mahāsattva who augments speech in the ear, nose, tongue, body, and mind realms if it's birth-and-death or nirvāṇa?\"",
        "source": "T05n0220_025:0137b20_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0137b23_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼界屬生死屬涅槃，若耳、鼻、舌、身、意界屬生死屬涅槃，尚畢竟不可得，性非有故，況有眼界屬生死屬涅槃增語及耳、鼻、舌、身、意界屬生死屬涅槃增語！",
        "translation": "If the eye realm is birth-and-death and nirvāṇa, and if the ear, nose, tongue, body, and mind realms are birth-and-death and nirvāṇa, they are ultimately unobtainable and non-existent in nature, so how could there be additional words about the eye realm being birth-and-death and nirvāṇa and additional words about the ear, nose, tongue, body, and mind realms being birth-and-death and nirvāṇa!",
        "source": "T05n0220_025:0137b23_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼界若屬生死若屬涅槃增語是菩薩摩訶薩，即耳、鼻、舌、身、意界若屬生死若屬涅槃增語是菩薩摩訶薩？」",
        "translation": "Since this augmentation is not present, how can it be said that the augmentation of the eye realm that is birth-and-death or nirvāṇa is bodhisattva-mahāsattva and the augmentation of the ear, nose, tongue, body, and mind realms that are birth-and-death or nirvāṇa is bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0137b27_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0137c01_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼界若在內若在外若在兩間增語非菩薩摩訶薩，即耳、鼻、舌、身、意界若在內若在外若在兩間增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying that it's not bodhisattva-mahāsattva if the element of vision is internal, external, or in two superlatives, and that it's not bodhisattva-mahāsattva if the elements of ear, nose, tongue, body, and mind are internal, external, or in two superlatives?\"",
        "source": "T05n0220_025:0137c01_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0137c04_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼界在內在外在兩間，若耳、鼻、舌、身、意界在內在外在兩間，尚畢竟不可得，性非有故，況有眼界在內在外在兩間增語及耳、鼻、舌、身、意界在內在外在兩間增語！",
        "translation": "If the eye-realm were two internal and two external, and if the ear, nose, tongue, body, and mind realms were two internal and two external, they would be ultimately unobtainable and not existent in nature, so how could there be additional words about the eye-realm being two internal and two external, and additional words about the ear, nose, tongue, body, and mind realms being two internal and two external!",
        "source": "T05n0220_025:0137c04_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼界若在內若在外若在兩間增語是菩薩摩訶薩，即耳、鼻、舌、身、意界若在內若在外若在兩間增語是菩薩摩訶薩？」",
        "translation": "Since this augmentation is not present, how can it be said that the eye realm is a bodhisattva-mahāsattva if it's augmented internally, externally, or in two, or that the ear, nose, tongue, body, and mind realms are bodhisattvas-mahāsattvas if they're augmented internally, externally, or in two?\"",
        "source": "T05n0220_025:0137c08_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0137c11_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼界若可得若不可得增語非菩薩摩訶薩，即耳、鼻、舌、身、意界若可得若不可得增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, the eye realm is not bodhisattva if it's obtainable or unobtainable augmentation speech, and the ear, nose, tongue, body, and mind realms are not bodhisattva if it's obtainable or unobtainable augmentation speech?'\"",
        "source": "T05n0220_025:0137c11_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0137c14_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼界可得不可得，若耳、鼻、舌、身、意界可得不可得，尚畢竟不可得，性非有故，況有眼界可得不可得增語及耳、鼻、舌、身、意界可得不可得增語！",
        "translation": "If the eye realm is knowable and unknowable, and if the ear, nose, tongue, body, and mind realms are knowable and unknowable, then after all they are unknowable and their nature is not possessed, how could there be additional words that are knowable and unknowable in the eye realm and additional words that are knowable and unknowable in the ear, nose, tongue, body, and mind realms?",
        "source": "T05n0220_025:0137c14_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼界若可得若不可得增語是菩薩摩訶薩，即耳、鼻、舌、身、意界若可得若不可得增語是菩薩摩訶薩？」",
        "translation": "Since this augmentation is not present, how can it be said that the eye realm is a bodhisattva-mahāsattva if it is accessible or inaccessible augmentation, and that the ear, nose, tongue, body, and mind realms are bodhisattvas-mahāsattvas if they are accessible or inaccessible augmentation?\"",
        "source": "T05n0220_025:0137c17_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T05n0220_025:0137c20_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝觀何義言：即色界增語非菩薩摩訶薩，即聲、香、味、觸、法界增語非菩薩摩訶薩耶？」",
        "translation": "What do you observe as the meaning of saying that the intensified speech of the form realm is not bodhisattva-mahāsattva, and that the intensified speech of the sound, smell, taste, touch, and dharma realms is not bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0137c20_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現答言：「世尊！",
        "translation": "Gushan present replied, \"Bhagavān!",
        "source": "T05n0220_025:0137c22_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界，若聲、香、味、觸、法界，尚畢竟不可得，性非有故，況有色界增語及聲、香、味、觸、法界增語！",
        "translation": "If the form realm and the sound, odor, taste, touch, and dharma realms are ultimately unobtainable and non-existent in nature, how much more so when there are intensified speech in the form realm and intensified speech in the sound, odor, taste, touch, and dharma realms!",
        "source": "T05n0220_025:0137c22_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界增語是菩薩摩訶薩，即聲、香、味、觸、法界增語是菩薩摩訶薩？」",
        "translation": "Since this augmentation is not present, how can it be said that the form realm augmentation is the bodhisattva-mahāsattva and that the sound, odor, taste, touch, and dharma realms augmentation is the bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0137c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0137c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若常若無常增語非菩薩摩訶薩，即聲、香、味、觸、法界若常若無常增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, if something permanent or impermanent is added to the form realm, it's not the bodhisattva, and if something permanent or impermanent is added to the sound, odor, taste, touch, or dharma realms, it's not the bodhisattva, Mahāsattva?'\"",
        "source": "T05n0220_025:0137c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0137c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界常無常，若聲、香、味、觸、法界常無常，尚畢竟不可得，性非有故，況有色界常無常增語及聲、香、味、觸、法界常無常增語！",
        "translation": "If the form realm is permanent and impermanent, and if the sound, odor, taste, tactile, and dharma realms are permanent and impermanent, they are ultimately unobtainable and non-existent in nature, so why should there be additional words about the form realm being permanent and impermanent and additional words about the sound, odor, taste, tactile, and dharma realms being permanent and impermanent?",
        "source": "T05n0220_025:0137c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若常若無常增語是菩薩摩訶薩，即聲、香、味、觸、法界若常若無常增語是菩薩摩訶薩？",
        "translation": "Since this augmentation is not existent, how can it be said that the form realm is a bodhisattva-mahāsattva if the augmentation is permanent or impermanent, or that the sound, smell, taste, touch, and dharma realms are bodhisattva-mahāsattvas if the augmentation is permanent or impermanent?",
        "source": "T05n0220_025:0138a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0138a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若樂若苦增語非菩薩摩訶薩，即聲、香、味、觸、法界若樂若苦增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That which is pleasant and painful in the form realm is not bodhisattva-mahāsattva, and that which is pleasant and painful in the sound, smell, taste, touch, and dharma realms is not bodhisattva-mahāsattva?'\"",
        "source": "T05n0220_025:0138a06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0138a08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界樂苦，若聲、香、味、觸、法界樂苦，尚畢竟不可得，性非有故，況有色界樂苦增語及聲、香、味、觸、法界樂苦增語！",
        "translation": "If it's pleasant and painful in the form realm and pleasant and painful in the sound, smell, taste, touch, and dharma realms, they are ultimately unobtainable and non-existent in nature, so why should there be additional words that are pleasant and painful in the form realm and additional words that are pleasant and painful in the sound, smell, taste, touch, and dharma realms?",
        "source": "T05n0220_025:0138a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若樂若苦增語是菩薩摩訶薩，即聲、香、味、觸、法界若樂若苦增語是菩薩摩訶薩？」",
        "translation": "Since this intensifier is not present, how can it be said that the form realm is bodhisattva-mahāsattva if it's pleasant or painful to speak intensively, and that the sound, smell, taste, touch, and dharma realms are bodhisattva-mahāsattva if it's pleasant or painful to speak intensively?\"",
        "source": "T05n0220_025:0138a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0138a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若我若無我增語非菩薩摩訶薩，即聲、香、味、觸、法界若我若無我增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, if there is a self or selfless augmentation in the form realm, it's not the bodhisattva-mahāsattva, and if there is a self or selfless augmentation in the sound, smell, taste, touch, and dharma realms, it's not the bodhisattva-mahāsattva?'\"",
        "source": "T05n0220_025:0138a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0138a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界我無我，若聲、香、味、觸、法界我無我，尚畢竟不可得，性非有故，況有色界我無我增語及聲、香、味、觸、法界我無我增語！",
        "translation": "If the self in the form realm is selfless, and if the self in the sound, odor, taste, touch, and dharma realms is selfless, they are ultimately unobtainable and non-existent in nature, so why should there be additional words about the self in the form realm and additional words about the self in the sound, odor, taste, touch, and dharma realms?",
        "source": "T05n0220_025:0138a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若我若無我增語是菩薩摩訶薩，即聲、香、味、觸、法界若我若無我增語是菩薩摩訶薩？",
        "translation": "Since this augmentation is not existent, how can it be said that the form realm is bodhisattva-mahāsattva if the augmentation is self or selfless, and the sound, smell, taste, touch, and dharma realms are bodhisattva-mahāsattva if the augmentation is self or selfless?",
        "source": "T05n0220_025:0138a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0138a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若淨若不淨增語非菩薩摩訶薩，即聲、香、味、觸、法界若淨若不淨增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, whether the form realm is pure or impure, increased speech is not bodhisattva-mahāsattva, and whether the sound, smell, taste, touch, or dharma realms are pure or impure, increased speech is not bodhisattva-mahāsattva?'\"",
        "source": "T05n0220_025:0138a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0138a24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界淨不淨，若聲、香、味、觸、法界淨不淨，尚畢竟不可得，性非有故，況有色界淨不淨增語及聲、香、味、觸、法界淨不淨增語！",
        "translation": "If the form realm is purified or impure, and if the sound, odor, taste, touch, and dharma realms are purified or impure, they are ultimately unobtainable and non-existent in nature, so why should there be additional words about the purification or impurity of the form realm and additional words about the purification or impurity of sound, odor, taste, touch, and dharma realms?",
        "source": "T05n0220_025:0138a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若淨若不淨增語是菩薩摩訶薩，即聲、香、味、觸、法界若淨若不淨增語是菩薩摩訶薩？",
        "translation": "Since this intensifier is not present, how can it be said that the form realm's intensifier, whether pure or impure, is the bodhisattva-mahāsattva, and the sound, smell, taste, touch, and dharma realms' intensifier, whether pure or impure, is the bodhisattva-mahāsattva?",
        "source": "T05n0220_025:0138a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0138b01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若空若不空增語非菩薩摩訶薩，即聲、香、味、觸、法界若空若不空增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, if the form realm is empty or nonempty, increased speech is not bodhisattva-mahāsattva, and if the sound, smell, taste, touch, and dharma realms are empty or nonempty, increased speech is not bodhisattva-mahāsattva?'\"",
        "source": "T05n0220_025:0138b01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0138b04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界空不空，若聲、香、味、觸、法界空不空，尚畢竟不可得，性非有故，況有色界空不空增語及聲、香、味、觸、法界空不空增語！",
        "translation": "If the form realm is empty and nonempty, and if the sound, odor, taste, touch, and dharma realms are empty and nonempty, they are ultimately unobtainable and nonexistent in nature, so why should there be additional words about the emptiness and nonemptyness of the form realm and additional words about the emptiness and nonemptyness of sound, odor, taste, touch, and dharma realms?",
        "source": "T05n0220_025:0138b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若空若不空增語是菩薩摩訶薩，即聲、香、味、觸、法界若空若不空增語是菩薩摩訶薩？",
        "translation": "Since this augmentation is not existent, how can it be said that the form realm is bodhisattva-mahāsattva if it's empty or nonempty, or that the sound, smell, taste, touch, and dharma realms are bodhisattva-mahāsattva if they are empty or nonempty?",
        "source": "T05n0220_025:0138b07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0138b09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若有相若無相增語非菩薩摩訶薩，即聲、香、味、觸、法界若有相若無相增語非菩薩摩訶薩耶？」",
        "translation": "How do you further observe the meaning of this statement, namely, that it's not a bodhisattva-mahāsattva if there are similarities in the form realm and markless augmentations, and that it's not a bodhisattva-mahāsattva if there are similarities in the sound, odor, taste, touch, and dharma realms and markless augmentations?\"",
        "source": "T05n0220_025:0138b09_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0138b12_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界有相無相，若聲、香、味、觸、法界有相無相，尚畢竟不可得，性非有故，況有色界有相無相增語及聲、香、味、觸、法界有相無相增語！",
        "translation": "If there are marks and no marks in the form realm, and if there are marks and no marks in the sound, odor, taste, touch, and dharma realms, they are still ultimately unobtainable and not existent in nature, so why should there be additional words about marks and no marks in the form realm and additional words about marks and no marks in the sound, odor, taste, touch, and dharma realms?",
        "source": "T05n0220_025:0138b12_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若有相若無相增語是菩薩摩訶薩，即聲、香、味、觸、法界若有相若無相增語是菩薩摩訶薩？」",
        "translation": "Since this intensifier is not present, how can it be said that the form realm is bodhisattva-mahāsattva if there is a comparable and markless intensifier, or that the sound, odor, taste, touch, and dharma realms are bodhisattva-mahāsattva if there is a comparable and markless intensifier?\"",
        "source": "T05n0220_025:0138b15_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0138b18_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若有願若無願增語非菩薩摩訶薩，即聲、香、味、觸、法界若有願若無願增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, if there are wishes or wishless augmentations in the form realm, they aren't bodhisattvas, mahāsattvas, and if there are wishes or wishless augmentations in the sound, smell, taste, touch, and dharma realms, they aren't bodhisattvas, mahāsattvas?'\"",
        "source": "T05n0220_025:0138b18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0138b21_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界有願無願，若聲、香、味、觸、法界有願無願，尚畢竟不可得，性非有故，況有色界有願無願增語及聲、香、味、觸、法界有願無願增語！",
        "translation": "If there are wishes and no wishes in the form realm, and if there are wishes and no wishes in the sound, odor, taste, touch, and dharma realms, they are ultimately unobtainable and non-existent in nature, so how could there be additional words with wishes and no wishes in the form realm and additional words with wishes and no wishes in the sound, odor, taste, touch, and dharma realms?",
        "source": "T05n0220_025:0138b21_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若有願若無願增語是菩薩摩訶薩，即聲、香、味、觸、法界若有願若無願增語是菩薩摩訶薩？」",
        "translation": "Since this augmentation is not existent, how can it be said that the form realm is bodhisattva-mahāsattva if there is a wish or wishless augmentation, or that the sound, smell, taste, touch, and dharma realms are bodhisattva-mahāsattva if there is a wish or wishless augmentation?\"",
        "source": "T05n0220_025:0138b24_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0138b27_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若寂靜若不寂靜增語非菩薩摩訶薩，即聲、香、味、觸、法界若寂靜若不寂靜增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, if the form realm is quiescent and unquiescent, increased speech is not bodhisattva-mahāsattva, and if the sound, fragrance, taste, touch, and dharma realms are quiescent and unquiescent, increased speech is not bodhisattva-mahāsattva?'\"",
        "source": "T05n0220_025:0138b27_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0138b29_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界寂靜不寂靜，若聲、香、味、觸、法界寂靜不寂靜，尚畢竟不可得，性非有故，況有色界寂靜不寂靜增語及聲、香、味、觸、法界寂靜不寂靜增語！",
        "translation": "If the form realm is quiescent and not quiescent, and if the sound, odor, taste, touch, and dharma realms are quiescent and not quiescent, they are ultimately unobtainable and their nature is nonexistent, so why should there be additional words about the form realm being quiescent and not quiescent and additional words about the sound, odor, taste, touch, and dharma realms being quiescent and not quiescent?",
        "source": "T05n0220_025:0138c01_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若寂靜若不寂靜增語是菩薩摩訶薩，即聲、香、味、觸、法界若寂靜若不寂靜增語是菩薩摩訶薩？」",
        "translation": "Since this intensifier is not present, how can it be said that the form realm is a bodhisattva-mahāsattva if it is tranquil and not tranquil intensified speech, or that the sound, smell, taste, touch, and dharma realms are bodhisattva-mahāsattvas if they are tranquil and not tranquil intensified speech?\"",
        "source": "T05n0220_025:0138c04_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0138c07_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若遠離若不遠離增語非菩薩摩訶薩，即聲、香、味、觸、法界若遠離若不遠離增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying that it's not a bodhisattva-mahāsattva if it's isolated or not isolated from augmentative speech in the form realm, and it's not a bodhisattva-mahāsattva if it's isolated or not isolated from augmentative speech in the sound, odor, taste, touch, and dharma realms?\"",
        "source": "T05n0220_025:0138c07_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0138c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界遠離不遠離，若聲、香、味、觸、法界遠離不遠離，尚畢竟不可得，性非有故，況有色界遠離不遠離增語及聲、香、味、觸、法界遠離不遠離增語！",
        "translation": "If the form realm is remote and not remote, and if the sound, odor, taste, touch, and dharma realms are remote and not remote, they are ultimately unobtainable, and their nature is not existent, so why should there be additional words that are remote and not remote from the form realm and additional words that are remote and not remote from the sound, odor, taste, touch, and dharma realms?",
        "source": "T05n0220_025:0138c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若遠離若不遠離增語是菩薩摩訶薩，即聲、香、味、觸、法界若遠離若不遠離增語是菩薩摩訶薩？」",
        "translation": "Since this intensifier is not present, how can it be said that the form realm is bodhisattva-mahāsattva if it is free from or not free from intensifiers, and that the sound, smell, taste, touch, and dharma realms are bodhisattva-mahāsattva if they are free from or not free from intensifiers?\"",
        "source": "T05n0220_025:0138c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0138c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若有為若無為增語非菩薩摩訶薩，即聲、香、味、觸、法界若有為若無為增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying that it's not the bodhisattva-mahāsattva if there are existent or impermanent intensifications in the form realm and not the bodhisattva-mahāsattva if there are existent or impermanent intensifications in the sound, odor, taste, touch, and dharma realms?\"",
        "source": "T05n0220_025:0138c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0138c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界有為無為，若聲、香、味、觸、法界有為無為，尚畢竟不可得，性非有故，況有色界有為無為增語及聲、香、味、觸、法界有為無為增語！",
        "translation": "If it's true that there are existent and inactive form realms, and if it's true that there are existent and inactive sound, odor, taste, touch, and dharma realms, they are ultimately unobtainable and not existent in nature, so why should there be additional words about existent and inactive form realms and additional words about existent and inactive sound, odor, taste, touch, and dharma realms?",
        "source": "T05n0220_025:0138c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若有為若無為增語是菩薩摩訶薩，即聲、香、味、觸、法界若有為若無為增語是菩薩摩訶薩？」",
        "translation": "Since this intensifier is not existent, how can it be said that the form realm is bodhisattva-mahāsattva if there is an existent or an inactive intensifier, and that the sound, smell, taste, touch, and dharma realms are bodhisattva-mahāsattva if there is an existent or an inactive intensifier?\"",
        "source": "T05n0220_025:0138c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0138c24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若有漏若無漏增語非菩薩摩訶薩，即聲、香、味、觸、法界若有漏若無漏增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, whether contaminated or uncontaminated augmentative speech in the form realm is not bodhisattva-mahāsattva, and whether contaminated or uncontaminated augmentative speech in the sound, smell, taste, touch, or dharma realms is not bodhisattva-mahāsattva?'\"",
        "source": "T05n0220_025:0138c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0138c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界有漏無漏，若聲、香、味、觸、法界有漏無漏，尚畢竟不可得，性非有故，況有色界有漏無漏增語及聲、香、味、觸、法界有漏無漏增語！",
        "translation": "If there are contaminants and no contaminants in the form realm, and if there are contaminants and no contaminants in the sound, odor, taste, touch, and dharma realms, they are ultimately unobtainable and non-existent in nature, so why should there be contaminants and no contaminants in the form realm and contaminants and no contaminants in the sound, odor, taste, touch, and dharma realms?",
        "source": "T05n0220_025:0138c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若有漏若無漏增語是菩薩摩訶薩，即聲、香、味、觸、法界若有漏若無漏增語是菩薩摩訶薩？」",
        "translation": "Since this intensifier is not existent, how can it be said that the form realm's contaminated or uncontaminated intensifier is the bodhisattva-mahāsattva and that the sound, smell, taste, touch, and dharma realms' contaminated or uncontaminated intensifier is the bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0139a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0139a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若生若滅增語非菩薩摩訶薩，即聲、香、味、觸、法界若生若滅增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That which is produced or ceased in the form realm by intensified speech is not bodhisattva-mahāsattva, and that which is produced or ceased in the sound, smell, taste, touch, and dharma realms by intensified speech is not bodhisattva-mahāsattva?'\"",
        "source": "T05n0220_025:0139a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0139a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界生滅，若聲、香、味、觸、法界生滅，尚畢竟不可得，性非有故，況有色界生滅增語及聲、香、味、觸、法界生滅增語！",
        "translation": "If the arising and ceasing of the form realm and the arising and ceasing of the sound, odor, taste, touch, and dharma realms are ultimately unobtainable and non-existent in nature, how much more so when there are additional words about the arising and ceasing of the form realm and additional words about the arising and ceasing of the sound, odor, taste, touch, and dharma realms!",
        "source": "T05n0220_025:0139a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若生若滅增語是菩薩摩訶薩，即聲、香、味、觸、法界若生若滅增語是菩薩摩訶薩？」",
        "translation": "Since this intensifier is not existent, how can it be said that the form realm is a bodhisattva-mahāsattva if it is produced or ceased, or that the sound, odor, taste, touch, and dharma realms are bodhisattvas-mahāsattvas if they are produced or ceased?\"",
        "source": "T05n0220_025:0139a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0139a12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若善若非善增語非菩薩摩訶薩，即聲、香、味、觸、法界若善若非善增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That which is good and not good in the form realm is not bodhisattva-mahāsattva, and that which is good and not good in the sound, odor, taste, touch, and dharma realms is not bodhisattva-mahāsattva by virtue of increased speech?'\"",
        "source": "T05n0220_025:0139a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0139a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界善非善，若聲、香、味、觸、法界善非善，尚畢竟不可得，性非有故，況有色界善非善增語及聲、香、味、觸、法界善非善增語！",
        "translation": "If it's good and not good in the form realm, and if it's good and not good in the sound, odor, taste, touch, and dharma realms, it's still ultimately unobtainable and not existent in nature, so why should there be good and not good additional speech in the form realm and good and not good additional speech in the sound, odor, taste, touch, and dharma realms?",
        "source": "T05n0220_025:0139a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若善若非善增語是菩薩摩訶薩，即聲、香、味、觸、法界若善若非善增語是菩薩摩訶薩？",
        "translation": "Since this intensification is not existent, how can it be said that the form realm is bodhisattva-mahāsattva if the intensification is good or not good, and the sound, smell, taste, touch, and dharma realms are bodhisattva-mahāsattva if the intensification is good or not good?",
        "source": "T05n0220_025:0139a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0139a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若有罪若無罪增語非菩薩摩訶薩，即聲、香、味、觸、法界若有罪若無罪增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying that it's not a bodhisattva-mahāsattva if there's guilt or innocence in the form realm and not a bodhisattva if there's guilt or innocence in the sound, smell, taste, touch, or dharma realms?\"",
        "source": "T05n0220_025:0139a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0139a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界有罪無罪，若聲、香、味、觸、法界有罪無罪，尚畢竟不可得，性非有故，況有色界有罪無罪增語及聲、香、味、觸、法界有罪無罪增語！",
        "translation": "If the form realm is guilty and blameless, and if the sound, odor, taste, touch, and dharma realms are guilty and blameless, they are ultimately unobtainable and non-existent in nature, so why should there be additional words about the form realm being guilty and blameless and additional words about the sound, odor, taste, touch, and dharma realms being guilty and blameless?",
        "source": "T05n0220_025:0139a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若有罪若無罪增語是菩薩摩訶薩，即聲、香、味、觸、法界若有罪若無罪增語是菩薩摩訶薩？」",
        "translation": "Since this intensifier is not present, how can it be said that the form realm's intensifier, whether guilty or blameless, is the bodhisattva-mahāsattva, and that the sound, smell, taste, touch, and dharma realms' intensifier, whether guilty or blameless, is the bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0139a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0139a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若有煩惱若無煩惱增語非菩薩摩訶薩，即聲、香、味、觸、法界若有煩惱若無煩惱增語非菩薩摩訶薩耶？」",
        "translation": "How do you further observe the meaning of this statement, namely, that it's not a bodhisattva-mahāsattva if there are afflictions or affliction-free augmentative speech in the form realm, and it's not a bodhisattva if there are afflictions or affliction-free augmentative speech in the sound, odor, taste, touch, and dharma realms?\"",
        "source": "T05n0220_025:0139a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0139b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界有煩惱無煩惱，若聲、香、味、觸、法界有煩惱無煩惱，尚畢竟不可得，性非有故，況有色界有煩惱無煩惱增語及聲、香、味、觸、法界有煩惱無煩惱增語！",
        "translation": "If there are afflictions and no afflictions in the form realm, and if there are afflictions and no afflictions in the sound, odor, taste, touch, and dharma realms, they are ultimately unobtainable and non-existent in nature, so why should there be additional words about afflictions and no afflictions in the form realm and additional words about afflictions and no afflictions in the sound, odor, taste, touch, and dharma realms?",
        "source": "T05n0220_025:0139b03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若有煩惱若無煩惱增語是菩薩摩訶薩，即聲、香、味、觸、法界若有煩惱若無煩惱增語是菩薩摩訶薩？」",
        "translation": "Since this intensifier is not present, how can it be said that the form realm is a bodhisattva-mahāsattva if there are afflictions or no afflictions, and that the sound, smell, taste, touch, and dharma realms are bodhisattvas-mahāsattvas if there are afflictions or no afflictions?\"",
        "source": "T05n0220_025:0139b06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0139b09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若世間若出世間增語非菩薩摩訶薩，即聲、香、味、觸、法界若世間若出世間增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That which is expressed in the form realm, whether mundane or transmundane, is not bodhisattva-mahāsattva, and that which is expressed in the sound, fragrance, taste, touch, and dharma realms, whether mundane or transmundane, is not bodhisattva-mahāsattva?'\"",
        "source": "T05n0220_025:0139b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0139b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界世間出世間，若聲、香、味、觸、法界世間出世間，尚畢竟不可得，性非有故，況有色界世間出世間增語及聲、香、味、觸、法界世間出世間增語！",
        "translation": "If the form realm is mundane and transmundane, and if the sound, odor, taste, touch, and dharma realms are mundane and transmundane, they are ultimately unobtainable and non-existent in nature, so why should there be additional words about the form realm being mundane and transmundane and additional words about the sound, odor, taste, touch, and dharma realms being mundane and transmundane?",
        "source": "T05n0220_025:0139b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若世間若出世間增語是菩薩摩訶薩，即聲、香、味、觸、法界若世間若出世間增語是菩薩摩訶薩？」",
        "translation": "Since this intensifier is not existent, how can it be said that the form realm's secular and transmundane intensifiers are bodhisattvas and the sound, smell, taste, touch, and dharma realms' secular and transmundane intensifiers are bodhisattvas and mahāsattvas?\"",
        "source": "T05n0220_025:0139b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0139b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若雜染若清淨增語非菩薩摩訶薩，即聲、香、味、觸、法界若雜染若清淨增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That which is defiled and pure in the form realm is not bodhisattva-mahāsattva, and that which is defiled and pure in the sound, odor, taste, touch, and dharma realms is not bodhisattva-mahāsattva?'\"",
        "source": "T05n0220_025:0139b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0139b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界雜染清淨，若聲、香、味、觸、法界雜染清淨，尚畢竟不可得，性非有故，況有色界雜染清淨增語及聲、香、味、觸、法界雜染清淨增語！",
        "translation": "If the defiled and pure form realm and the defiled and pure sound, odor, taste, touch, and dharma realms are ultimately unobtainable and non-existent in nature, how could there be additional words about the defiled and pure form realm and additional words about the defiled and pure sound, odor, taste, touch, and dharma realms?",
        "source": "T05n0220_025:0139b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若雜染若清淨增語是菩薩摩訶薩，即聲、香、味、觸、法界若雜染若清淨增語是菩薩摩訶薩？」",
        "translation": "Since this intensifier is not present, how can it be said that the form realm's defiled or pure intensifier is the bodhisattva-mahāsattva and that the sound, smell, taste, touch, and dharma realms' defiled or pure intensifier is the bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0139b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0139b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若屬生死若屬涅槃增語非菩薩摩訶薩，即聲、香、味、觸、法界若屬生死若屬涅槃增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying that it's not bodhisattva-mahāsattva to speak intensively about the form realm if it's birth-and-death or nirvāṇa, and it's not bodhisattva-mahāsattva to speak intensively about the sound, smell, taste, touch, and dharma realms if they're birth-and-death or nirvāṇa?\"",
        "source": "T05n0220_025:0139b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0139c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界屬生死屬涅槃，若聲、香、味、觸、法界屬生死屬涅槃，尚畢竟不可得，性非有故，況有色界屬生死屬涅槃增語及聲、香、味、觸、法界屬生死屬涅槃增語！",
        "translation": "If the form realm is birth-and-death and nirvāṇa, and if the sound, odor, taste, touch, and dharma realms are birth-and-death and nirvāṇa, they are ultimately unobtainable and non-existent in nature, so why should there be additional words about the form realm being birth-and-death and nirvāṇa and additional words about the sound, odor, taste, touch, and dharma realms being birth-and-death and nirvāṇa?",
        "source": "T05n0220_025:0139c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若屬生死若屬涅槃增語是菩薩摩訶薩，即聲、香、味、觸、法界若屬生死若屬涅槃增語是菩薩摩訶薩？」",
        "translation": "Since this augmentation is not existent, how can it be said that the augmentation of the form realm that is birth-and-death and nirvāṇa is bodhisattva-mahāsattva and the augmentation of the sound, smell, taste, touch, and dharma realms that are birth-and-death and nirvāṇa is bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0139c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0139c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若在內若在外若在兩間增語非菩薩摩訶薩，即聲、香、味、觸、法界若在內若在外若在兩間增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying that it's not bodhisattva-mahāsattva to speak intensively whether it's in the form realm, or whether it's outside, or whether it's in two, or that it's not bodhisattva-mahāsattva to speak intensively whether it's in the sound, odor, taste, touch, or dharma realms?\"",
        "source": "T05n0220_025:0139c08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0139c11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界在內在外在兩間，若聲、香、味、觸、法界在內在外在兩間，尚畢竟不可得，性非有故，況有色界在內在外在兩間增語及聲、香、味、觸、法界在內在外在兩間增語！",
        "translation": "If the form realm is present in two internal and two external realms, and if the sound, odor, taste, touch, and dharma realms are present in two internal and two external realms, they are still ultimately unobtainable and their nature is not existent, so why should there be any additional speech about the form realm being present in two internal and two external realms and any additional speech about the sound, odor, taste, touch, and dharma realms being present in two internal and two external realms?",
        "source": "T05n0220_025:0139c11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若在內若在外若在兩間增語是菩薩摩訶薩，即聲、香、味、觸、法界若在內若在外若在兩間增語是菩薩摩訶薩？」",
        "translation": "Since this augmentation is not present, how can it be said that the form realm is a bodhisattva-mahāsattva if it's augmented internally, externally, or in two realms, or that the sound, smell, taste, touch, and dharma realms are bodhisattvas-mahāsattvas if they're augmented internally, externally, or in two realms?\"",
        "source": "T05n0220_025:0139c15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0139c18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即色界若可得若不可得增語非菩薩摩訶薩，即聲、香、味、觸、法界若可得若不可得增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying that it's not the bodhisattva-mahāsattva if there are obtainable or unobtainable intensifications in the form realm and not the bodhisattva if there are obtainable or unobtainable intensifications in the sound, odor, taste, touch, and dharma realms?\"",
        "source": "T05n0220_025:0139c18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0139c21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若色界可得不可得，若聲、香、味、觸、法界可得不可得，尚畢竟不可得，性非有故，況有色界可得不可得增語及聲、香、味、觸、法界可得不可得增語！",
        "translation": "If the form realm is knowable and unknowable, and if the sound, odor, taste, touch, and dharma realms are knowable and unknowable, they are still ultimately unknowable and non-existent in nature, so why should there be additional words that are knowable and unknowable in the form realm or additional words that are knowable and unknowable in the sound, odor, taste, touch, and dharma realms?",
        "source": "T05n0220_025:0139c21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即色界若可得若不可得增語是菩薩摩訶薩，即聲、香、味、觸、法界若可得若不可得增語是菩薩摩訶薩？」",
        "translation": "Since this intensifier is not existent, how can it be said that the form realm is bodhisattva-mahāsattva if the intensifier is obtainable or unobtainable, and that the sound, odor, taste, touch, and dharma realms are bodhisattva-mahāsattva if the intensifier is obtainable or unobtainable?\"",
        "source": "T05n0220_025:0139c24_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T05n0220_025:0139c27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝觀何義言：即眼識界增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界增語非菩薩摩訶薩耶？」",
        "translation": "What do you observe as the meaning of saying that the augmentation of speech in the visual consciousness realm is not bodhisattva-mahāsattva, and that the augmentation of speech in the ear, nose, tongue, body, and consciousness realms is not bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0139c27_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現答言：「世尊！",
        "translation": "Gushan present replied, \"Bhagavān!",
        "source": "T05n0220_025:0139c29_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界，若耳、鼻、舌、身、意識界，尚畢竟不可得，性非有故，況有眼識界增語及耳、鼻、舌、身、意識界增語！",
        "translation": "If the element of the visual consciousness and the elements of the ear, nose, tongue, body, and consciousness are ultimately unobtainable and non-existent in nature, how could there be augmentative speech in the element of the visual consciousness and augmentative speech in the elements of the ear, nose, tongue, body, and consciousness?",
        "source": "T05n0220_025:0140a01_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界增語是菩薩摩訶薩？」",
        "translation": "Since this augmentation is not present, how can it be said that the augmentation of the visual consciousness realm is the bodhisattva-mahāsattva and that the augmentation of the ear, nose, tongue, body, and consciousness realms is the bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0140a03_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0140a05_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若常若無常增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若常若無常增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, if the element of the visual consciousness is permanent or impermanent, increased speech is not bodhisattva, and if the element of the ear, nose, tongue, body, and consciousness is permanent or impermanent, increased speech is not bodhisattva?'\"",
        "source": "T05n0220_025:0140a05_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0140a08_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界常無常，若耳、鼻、舌、身、意識界常無常，尚畢竟不可得，性非有故，況有眼識界常無常增語及耳、鼻、舌、身、意識界常無常增語！",
        "translation": "If the element of the visual consciousness is permanent and impermanent, and if the ear, nose, tongue, body, and consciousness elements are permanent and impermanent, they are ultimately unobtainable and do not exist in nature, so why should there be additional words about the element of the visual consciousness being permanent and impermanent and additional words about the ear, nose, tongue, body, and consciousness elements being permanent and impermanent?",
        "source": "T05n0220_025:0140a08_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若常若無常增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若常若無常增語是菩薩摩訶薩？」",
        "translation": "Since this augmentative speech is not existent, how can it be said that the augmentative speech of the element of the visual consciousness, whether permanent or impermanent, is bodhisattva-mahāsattva, and that the augmentative speech of the ear, nose, tongue, body, and consciousness elements, whether permanent or impermanent, is bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0140a11_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0140a14_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若樂若苦增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若樂若苦增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, whether it's pleasant or painful to speak intensively in the element of visual consciousness is not bodhisattva-mahāsattva, and whether it's pleasant or painful to speak intensively in the element of ear, nose, tongue, body, or consciousness is not bodhisattva-mahāsattva?'\"",
        "source": "T05n0220_025:0140a14_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0140a17_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界樂苦，若耳、鼻、舌、身、意識界樂苦，尚畢竟不可得，性非有故，況有眼識界樂苦增語及耳、鼻、舌、身、意識界樂苦增語！",
        "translation": "If the pleasant and painful aspect of the visual consciousness and the pleasant and painful aspect of the ear, nose, tongue, body, and consciousness are ultimately unobtainable and non-existent in nature, how could there be pleasant and painful augmentations of the visual consciousness and pleasant and painful augmentations of the ear, nose, tongue, body, and consciousness?",
        "source": "T05n0220_025:0140a17_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若樂若苦增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若樂若苦增語是菩薩摩訶薩？",
        "translation": "Since this intensifier is not present, how can it be said that the element of the visual consciousness is a bodhisattva-mahāsattva if it's pleasant or painful to speak intensively, and that the element of the ear, nose, tongue, body, and consciousness is a bodhisattva-mahāsattva if it's pleasant or painful to speak intensively?",
        "source": "T05n0220_025:0140a20_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0140a22_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若我若無我增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若我若無我增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, if the element of the visual consciousness is self or selfless, increased speech is not bodhisattva, and if the elements of ear, nose, tongue, body, and consciousness are self or selfless, increased speech is not bodhisattva?'\"",
        "source": "T05n0220_025:0140a22_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0140a25_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界我無我，若耳、鼻、舌、身、意識界我無我，尚畢竟不可得，性非有故，況有眼識界我無我增語及耳、鼻、舌、身、意識界我無我增語！",
        "translation": "If the self of the ocular consciousness were selfless, and if the self of the ear, nose, tongue, body, and consciousness were selfless, they would be ultimately unobtainable and not existent in nature, so how could there be additional words about the self and selflessness of the ocular consciousness and additional words about the self and selflessness of the ear, nose, tongue, body, and consciousness?",
        "source": "T05n0220_025:0140a25_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若我若無我增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若我若無我增語是菩薩摩訶薩？」",
        "translation": "Since this augmentation is not existent, how can it be said that the augmentation of the element of the visual consciousness, whether self or selfless, is bodhisattva-mahāsattva, and that the augmentation of the elements of ear, nose, tongue, body, and consciousness, whether self or selfless, is bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0140a28_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0140b02_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若淨若不淨增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若淨若不淨增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, whether the element of the visual consciousness is purified or impure, increased speech is not bodhisattva, and whether the element of the ear, nose, tongue, body, or consciousness is purified or impure, increased speech is not bodhisattva?'\"",
        "source": "T05n0220_025:0140b02_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0140b05_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界淨不淨，若耳、鼻、舌、身、意識界淨不淨，尚畢竟不可得，性非有故，況有眼識界淨不淨增語及耳、鼻、舌、身、意識界淨不淨增語！",
        "translation": "If the ocular consciousness factor is purified or impure, and if the ear, nose, tongue, body, and consciousness factors are purified or impure, they are ultimately unobtainable and do not exist in nature, so why should there be additional words about the purification or impurity of the ocular consciousness factor and additional words about the purification or impurity of the ear, nose, tongue, body, and consciousness factors?",
        "source": "T05n0220_025:0140b05_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若淨若不淨增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若淨若不淨增語是菩薩摩訶薩？」",
        "translation": "Since this intensification is not present, how can it be said that the intensification of speech whether pure or impure in the element of the visual consciousness is bodhisattva-mahāsattva and that the intensification of speech whether pure or impure in the element of the ear, nose, tongue, body, or consciousness is bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0140b08_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0140b11_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若空若不空增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若空若不空增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, if the element of the visual consciousness is empty or nonempty, it's not bodhisattva-mahāsattva to speak intensively, and if the element of the ear, nose, tongue, body, and consciousness are empty or nonempty, it's not bodhisattva-mahāsattva to speak intensively?'\"",
        "source": "T05n0220_025:0140b11_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0140b13_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界空不空，若耳、鼻、舌、身、意識界空不空，尚畢竟不可得，性非有故，況有眼識界空不空增語及耳、鼻、舌、身、意識界空不空增語！",
        "translation": "If the element of the visual consciousness is empty and nonempty, and if the element of the ear, nose, tongue, body, and consciousness is empty and nonempty, it's ultimately unobtainable and nonexistent in nature, so why should there be additional words about the element of the visual consciousness being empty and nonempty and additional words about the element of the ear, nose, tongue, body, and consciousness being empty and nonempty?",
        "source": "T05n0220_025:0140b13_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若空若不空增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若空若不空增語是菩薩摩訶薩？」",
        "translation": "How can it be said that this augmentative statement is not existent, namely, that the element of the visual consciousness is a bodhisattva-mahāsattva if it is empty or nonempty, and that the element of the ear, nose, tongue, body, and consciousness is a bodhisattva-mahāsattva if it is empty or nonempty?\"",
        "source": "T05n0220_025:0140b16_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0140b19_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若有相若無相增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若有相若無相增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying that it's not a bodhisattva-mahāsattva if the element of the visual consciousness has similarities and markless augmentations and that it's not a bodhisattva-mahāsattva if the element of the ear, nose, tongue, body, and consciousness have similarities and markless augmentations?\"",
        "source": "T05n0220_025:0140b19_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0140b22_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界有相無相，若耳、鼻、舌、身、意識界有相無相，尚畢竟不可得，性非有故，況有眼識界有相無相增語及耳、鼻、舌、身、意識界有相無相增語！",
        "translation": "If the eye-consciousness realm has marks and no marks, and if the ear, nose, tongue, body, and consciousness realms have marks and no marks, they are still ultimately unobtainable and not existent in nature, so why should there be additional words about the eye-consciousness realm having marks and no marks and additional words about the ear, nose, tongue, body, and consciousness realms having marks and no marks!",
        "source": "T05n0220_025:0140b22_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若有相若無相增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若有相若無相增語是菩薩摩訶薩？」",
        "translation": "Since this intensifier is not present, how can it be said that the element of the visual consciousness is a bodhisattva-mahāsattva if there is a comparable and signless intensifier, or that the element of the ear, nose, tongue, body, and consciousness is a bodhisattva-mahāsattva if there is a comparable and signless intensifier?\"",
        "source": "T05n0220_025:0140b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0140b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若有願若無願增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若有願若無願增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying that it's not a bodhisattva-mahāsattva to augment speech with or without a wish in the element of visual consciousness and that it's not a bodhisattva to augment speech with or without a wish in the elements of ear, nose, tongue, body, and consciousness?\"",
        "source": "T05n0220_025:0140b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0140c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界有願無願，若耳、鼻、舌、身、意識界有願無願，尚畢竟不可得，性非有故，況有眼識界有願無願增語及耳、鼻、舌、身、意識界有願無願增語！",
        "translation": "If there are wishes and no wishes in the element of the eye consciousness, and if there are wishes and no wishes in the elements of ear, nose, tongue, body, and consciousness, they are ultimately unobtainable and non-existent in nature, so why should there be additional words with or without wishes in the element of the eye consciousness and additional words with or without wishes in the elements of ear, nose, tongue, body, and consciousness?",
        "source": "T05n0220_025:0140c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若有願若無願增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若有願若無願增語是菩薩摩訶薩？」",
        "translation": "Since this augmentative speech is not existent, how can it be said that the augmentative speech of the visual consciousness realm, whether it is desired or not, is bodhisattva-mahāsattva, and that the augmentative speech of the ear, nose, tongue, body, and consciousness realms, whether desired or not, is bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0140c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0140c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若寂靜若不寂靜增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若寂靜若不寂靜增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, if the element of visual consciousness is quiescent and unquiescent, increased speech is not bodhisattva-mahāsattva, and if the elements of ear, nose, tongue, body, and consciousness are quiescent and unquiescent, increased speech is not bodhisattva-mahāsattva?'\"",
        "source": "T05n0220_025:0140c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0140c12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界寂靜不寂靜，若耳、鼻、舌、身、意識界寂靜不寂靜，尚畢竟不可得，性非有故，況有眼識界寂靜不寂靜增語及耳、鼻、舌、身、意識界寂靜不寂靜增語！",
        "translation": "If the ocular consciousness realm is quiescent and not quiescent, and if the ear, nose, tongue, body, and consciousness realms are quiescent and not quiescent, they are ultimately unobtainable and do not exist in nature, so why should there be additional words about the ocular consciousness realm being quiescent and not quiescent and additional words about the ear, nose, tongue, body, and consciousness realms being quiescent and not quiescent?",
        "source": "T05n0220_025:0140c12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若寂靜若不寂靜增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若寂靜若不寂靜增語是菩薩摩訶薩？」",
        "translation": "Since this intensification is not present, how can it be said that the intensification of speech, whether quiescent or not, in the element of the visual consciousness is bodhisattva-mahāsattva, and that the intensification of speech, whether quiescent or not, in the elements of ear, nose, tongue, body, and consciousness is bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0140c15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0140c18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若遠離若不遠離增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若遠離若不遠離增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying that it's not bodhisattva-mahāsattva if the element of visual consciousness is remote or not remote from augmentative speech, and it's not bodhisattva-mahāsattva if the element of ear, nose, tongue, body, and consciousness is remote or not remote from augmentative speech?\"",
        "source": "T05n0220_025:0140c18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0140c21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界遠離不遠離，若耳、鼻、舌、身、意識界遠離不遠離，尚畢竟不可得，性非有故，況有眼識界遠離不遠離增語及耳、鼻、舌、身、意識界遠離不遠離增語！",
        "translation": "If the element of the visual consciousness is remote and not remote, and if the ear, nose, tongue, body, and consciousness elements are remote and not remote, they are ultimately unobtainable and not existent in nature, so why should there be additional words about the element of the visual consciousness that are remote and not remote and additional words about the elements of the ear, nose, tongue, body, and consciousness that are remote and not remote?",
        "source": "T05n0220_025:0140c21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若遠離若不遠離增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若遠離若不遠離增語是菩薩摩訶薩？」",
        "translation": "Since this augmentation is not present, how can it be said that the element of the visual consciousness is a bodhisattva-mahāsattva if it is free from or not free from augmentations, and that the elements of ear, nose, tongue, body, and consciousness are bodhisattvas-mahāsattvas if they are free from or not free from augmentations?\"",
        "source": "T05n0220_025:0140c25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0140c28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若有為若無為增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若有為若無為增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying that it's not a bodhisattva-mahāsattva to speak intensively whether it's with or without the eye consciousness, and it's not a bodhisattva to speak intensively whether it's with or without the ear, nose, tongue, body, or consciousness?\"",
        "source": "T05n0220_025:0140c28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0141a02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界有為無為，若耳、鼻、舌、身、意識界有為無為，尚畢竟不可得，性非有故，況有眼識界有為無為增語及耳、鼻、舌、身、意識界有為無為增語！",
        "translation": "If the ocular consciousness realm is existent and inactive, and if the ear, nose, tongue, body, and consciousness realms are existent and inactive, they are ultimately unobtainable and non-existent in nature, so why should there be additional speech about the ocular consciousness realm being existent and inactive and additional speech about the ear, nose, tongue, body, and consciousness realms being existent and inactive?",
        "source": "T05n0220_025:0141a02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若有為若無為增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若有為若無為增語是菩薩摩訶薩？」",
        "translation": "Since this intensification is not existent, how can it be said that the intensification of speech whether existent or impermanent in the element of the visual consciousness is bodhisattva-mahāsattva and that the intensification of speech whether existent or impermanent in the element of the ear, nose, tongue, body, or consciousness is bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0141a05_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0141a08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若有漏若無漏增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若有漏若無漏增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, whether contaminated or uncontaminated augmentative speech in the element of visual consciousness is not bodhisattva, and whether contaminated or uncontaminated augmentative speech in the elements of ear, nose, tongue, body, and consciousness is not bodhisattva-mahāsattva?'\"",
        "source": "T05n0220_025:0141a08_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0141a11_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界有漏無漏，若耳、鼻、舌、身、意識界有漏無漏，尚畢竟不可得，性非有故，況有眼識界有漏無漏增語及耳、鼻、舌、身、意識界有漏無漏增語！",
        "translation": "If the ocular consciousness realm is contaminated and uncontaminated, and if the ear, nose, tongue, body, and consciousness realms are contaminated and uncontaminated, they are ultimately unobtainable and non-existent in nature, so why should there be additional words about the ocular consciousness realm that are contaminated and uncontaminated and additional words about the ear, nose, tongue, body, and consciousness realms that are contaminated and uncontaminated?",
        "source": "T05n0220_025:0141a11_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若有漏若無漏增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若有漏若無漏增語是菩薩摩訶薩？」",
        "translation": "Since this augmentative speech is not existent, how can it be said that the ocular consciousness realm is a bodhisattva-mahāsattva if it has contaminated or uncontaminated augmentative speech, or that the ear, nose, tongue, body, and consciousness realms are bodhisattvas-mahāsattvas if they have contaminated or uncontaminated augmentative speech?\"",
        "source": "T05n0220_025:0141a14_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0141a17_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若生若滅增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若生若滅增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, whether the element of the visual consciousness arises or ceases, increased speech is not bodhisattva, and whether the element of the ear, nose, tongue, body, or consciousness arises or ceases, increased speech is not bodhisattva?'\"",
        "source": "T05n0220_025:0141a17_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0141a20_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界生滅，若耳、鼻、舌、身、意識界生滅，尚畢竟不可得，性非有故，況有眼識界生滅增語及耳、鼻、舌、身、意識界生滅增語！",
        "translation": "If the arising and ceasing of the element of the visual consciousness and the arising and ceasing of the elements of the ear, nose, tongue, body, and consciousness are ultimately unobtainable and non-existent in nature, how could there be additional words about the arising and ceasing of the element of the visual consciousness and additional words about the arising and ceasing of the elements of the ear, nose, tongue, body, and consciousness?",
        "source": "T05n0220_025:0141a20_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若生若滅增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若生若滅增語是菩薩摩訶薩？",
        "translation": "Since this intensification is not present, how can it be said that the element of the visual consciousness is a bodhisattva-mahāsattva if it arises or ceases to speak intensively, and that the element of the ear, nose, tongue, body, and consciousness is a bodhisattva-mahāsattva if it arises or ceases to speak intensively?",
        "source": "T05n0220_025:0141a22_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0141a25_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若善若非善增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若善若非善增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, if the element of the visual consciousness is good or not good, increased speech is not bodhisattva, and if the element of the ear, nose, tongue, body, and consciousness is good or not good, increased speech is not bodhisattva?'\"",
        "source": "T05n0220_025:0141a25_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0141a28_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界善非善，若耳、鼻、舌、身、意識界善非善，尚畢竟不可得，性非有故，況有眼識界善非善增語及耳、鼻、舌、身、意識界善非善增語！",
        "translation": "If the ocular consciousness element is good and not good, and if the ear, nose, tongue, body, and consciousness elements are good and not good, they are ultimately unobtainable and do not exist in nature, so how could there be good and not-good intensified speech in the ocular consciousness element and good and not-good intensified speech in the ear, nose, tongue, body, and consciousness elements?",
        "source": "T05n0220_025:0141a28_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若善若非善增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若善若非善增語是菩薩摩訶薩？」",
        "translation": "Since this intensification is not present, how can it be said that the element of the visual consciousness is a bodhisattva-mahāsattva if it's a good or not good intensification, and that the element of the ear, nose, tongue, body, and consciousness is a bodhisattva-mahāsattva if it's a good or not good intensification?\"",
        "source": "T05n0220_025:0141b02_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0141b05_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若有罪若無罪增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若有罪若無罪增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, if the element of the visual consciousness is blameworthy or blameless, increased speech is not bodhisattva-mahāsattva, and if the element of the ear, nose, tongue, body, and consciousness is blameworthy or blameless, increased speech is not bodhisattva-mahāsattva?'\"",
        "source": "T05n0220_025:0141b05_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0141b08_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界有罪無罪，若耳、鼻、舌、身、意識界有罪無罪，尚畢竟不可得，性非有故，況有眼識界有罪無罪增語及耳、鼻、舌、身、意識界有罪無罪增語！",
        "translation": "If the ocular consciousness is guilty and blameless, and if the ear, nose, tongue, body, and consciousness are guilty and blameless, they are ultimately unobtainable and non-existent in nature, so why should there be additional words about the ocular consciousness being guilty and blameless and additional words about the ear, nose, tongue, body, and consciousness being guilty and blameless?",
        "source": "T05n0220_025:0141b08_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若有罪若無罪增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若有罪若無罪增語是菩薩摩訶薩？」",
        "translation": "How can it be said that this superlative is not existent, namely, that the superlative of the visual consciousness is a bodhisattva-mahāsattva if it's guilty or not guilty, and that the superlative of the ear, nose, tongue, body, and consciousness is a bodhisattva-mahāsattva if it's guilty or not guilty?\"",
        "source": "T05n0220_025:0141b11_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0141b14_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若有煩惱若無煩惱增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若有煩惱若無煩惱增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, it's not a bodhisattva-mahāsattva to speak intensively whether there are afflictions or no afflictions in the element of visual consciousness, and it's not a bodhisattva-mahāsattva to speak intensively whether there are afflictions or no afflictions in the elements of ear, nose, tongue, body, and consciousness?'\"",
        "source": "T05n0220_025:0141b14_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0141b17_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界有煩惱無煩惱，若耳、鼻、舌、身、意識界有煩惱無煩惱，尚畢竟不可得，性非有故，況有眼識界有煩惱無煩惱增語及耳、鼻、舌、身、意識界有煩惱無煩惱增語！",
        "translation": "If there are afflictions and non-afflictions in the ocular consciousness realm, and if there are afflictions and non-afflictions in the ear, nose, tongue, body, and consciousness realms, they are ultimately unobtainable and non-existent in nature, so how could there be additional words about afflictions and non-afflictions in the ocular consciousness realm and additional words about afflictions and non-afflictions in the ear, nose, tongue, body, and consciousness realms!",
        "source": "T05n0220_025:0141b17_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若有煩惱若無煩惱增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若有煩惱若無煩惱增語是菩薩摩訶薩？",
        "translation": "Since this augmentation is not present, how can it be said that the augmentation of the element of the visual consciousness that is afflicted or unafflicted is bodhisattva-mahāsattva and that the augmentation of the element of the ear, nose, tongue, body, and consciousness that is afflicted or unafflicted is bodhisattva-mahāsattva?",
        "source": "T05n0220_025:0141b21_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0141b24_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若世間若出世間增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若世間若出世間增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, the element of visual consciousness is not bodhisattva-mahāsattva if it's worldly or transmundane in its incremental speech, and the elements of ear, nose, tongue, body, and consciousness are not bodhisattva-mahāsattva if they're worldly or transmundane in their incremental speech?'\"",
        "source": "T05n0220_025:0141b24_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0141b27_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界世間出世間，若耳、鼻、舌、身、意識界世間出世間，尚畢竟不可得，性非有故，況有眼識界世間出世間增語及耳、鼻、舌、身、意識界世間出世間增語！",
        "translation": "If the ocular consciousness realm is mundane and transmundane, and if the ear, nose, tongue, body, and consciousness realms are mundane and transmundane, they are ultimately unobtainable and non-existent in nature, so how could there be additional speech about the ocular consciousness realm being mundane and transmundane, and additional speech about the ear, nose, tongue, body, and consciousness realms being mundane and transmundane?",
        "source": "T05n0220_025:0141b27_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若世間若出世間增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若世間若出世間增語是菩薩摩訶薩？」",
        "translation": "Since this augmentation is not present, how can it be said that the augmentation of the element of visual consciousness that is worldly and transmundane is bodhisattva-mahāsattva and the augmentation of the element of ear, nose, tongue, body, and consciousness that is worldly and transmundane is bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0141c01_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0141c04_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若雜染若清淨增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若雜染若清淨增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, the element of the visual consciousness that is defiled or purified by increased speech is not bodhisattva, and the elements of ear, nose, tongue, body, and consciousness that are defiled or purified by increased speech is not bodhisattva?'\"",
        "source": "T05n0220_025:0141c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0141c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界雜染清淨，若耳、鼻、舌、身、意識界雜染清淨，尚畢竟不可得，性非有故，況有眼識界雜染清淨增語及耳、鼻、舌、身、意識界雜染清淨增語！",
        "translation": "If the eye consciousness realm is defiled and pure, and if the ear, nose, tongue, body, and consciousness realms are defiled and pure, they are ultimately unobtainable and do not exist in nature, so why should there be additional words about the eye consciousness realm being defiled and pure and additional words about the ear, nose, tongue, body, and consciousness realms being defiled and pure?",
        "source": "T05n0220_025:0141c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若雜染若清淨增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若雜染若清淨增語是菩薩摩訶薩？」",
        "translation": "Since this intensification is not present, how can it be said that the intensification of speech in the visual consciousness realm that is defiled or purified is bodhisattva-mahāsattva and that the intensification of speech in the ear, nose, tongue, body, and consciousness realms that is defiled or purified is bodhisattva-mahāsattva?\"",
        "source": "T05n0220_025:0141c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0141c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若屬生死若屬涅槃增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若屬生死若屬涅槃增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying, 'That is, the element of the visual consciousness that is subject to birth-and-death and nirvāṇa is not bodhisattva-mahāsattva, and the elements of the ear, nose, tongue, body, and consciousness that are subject to birth-and-death and nirvāṇa are not bodhisattva-mahāsattva in terms of increased speech?'\"",
        "source": "T05n0220_025:0141c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0141c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界屬生死屬涅槃，若耳、鼻、舌、身、意識界屬生死屬涅槃，尚畢竟不可得，性非有故，況有眼識界屬生死屬涅槃增語及耳、鼻、舌、身、意識界屬生死屬涅槃增語！",
        "translation": "If the element of the visual consciousness is birth-and-death and nirvāṇa, and if the ear, nose, tongue, body, and consciousness elements are birth-and-death and nirvāṇa, they are ultimately unobtainable and non-existent in nature, so how could there be additional words about the element of the visual consciousness being birth-and-death and nirvāṇa and additional words about the element of the ear, nose, tongue, body, and consciousness being birth-and-death and nirvāṇa!",
        "source": "T05n0220_025:0141c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若屬生死若屬涅槃增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若屬生死若屬涅槃增語是菩薩摩訶薩？",
        "translation": "Since this augmentation is not existent, how can it be said that the augmentation of the element of the visual consciousness that is birth-and-death or nirvāṇa is bodhisattva-mahāsattva and that the augmentation of the element of the ear, nose, tongue, body, and consciousness that is birth-and-death or nirvāṇa is bodhisattva-mahāsattva?",
        "source": "T05n0220_025:0141c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0141c24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若在內若在外若在兩間增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若在內若在外若在兩間增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying that it's not a bodhisattva-mahāsattva if the element of the visual consciousness is internal, external, or in two augmentative statements, and that it's not a bodhisattva-mahāsattva if the element of the ear, nose, tongue, body, or consciousness is internal, external, or in two augmentative statements?\"",
        "source": "T05n0220_025:0141c24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0141c27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界在內在外在兩間，若耳、鼻、舌、身、意識界在內在外在兩間，尚畢竟不可得，性非有故，況有眼識界在內在外在兩間增語及耳、鼻、舌、身、意識界在內在外在兩間增語！",
        "translation": "If the element of the visual consciousness were two internal and two external, and if the element of the ear, nose, tongue, body, and consciousness were two internal and two external, they would be ultimately unobtainable and not existent in nature, so how could there be two superlatives for the element of the visual consciousness that are internal and two superlatives for the element of the ear, nose, tongue, body, and consciousness that are internal and two superlatives for the element of the ear, nose, tongue, body, and two superlatives for the element of the outer world!",
        "source": "T05n0220_025:0141c27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若在內若在外若在兩間增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若在內若在外若在兩間增語是菩薩摩訶薩？」",
        "translation": "Since this augmentation is not present, how can it be said that the element of the visual consciousness is a bodhisattva-mahāsattva if it is augmented internally, externally, or in two, or that the elements of ear, nose, tongue, body, and consciousness are bodhisattvas-mahāsattvas if they are augmented internally, externally, or in two?\"",
        "source": "T05n0220_025:0142a02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T05n0220_025:0142a05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝復觀何義言：即眼識界若可得若不可得增語非菩薩摩訶薩，即耳、鼻、舌、身、意識界若可得若不可得增語非菩薩摩訶薩耶？」",
        "translation": "What do you further observe as the meaning of saying that it's not a bodhisattva-mahāsattva if there are obtainable or unobtainable intensifications in the element of visual consciousness and that it's not a bodhisattva if there are obtainable or unobtainable intensifications in the elements of ear, nose, tongue, body, and consciousness?\"",
        "source": "T05n0220_025:0142a05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_025:0142a08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若眼識界可得不可得，若耳、鼻、舌、身、意識界可得不可得，尚畢竟不可得，性非有故，況有眼識界可得不可得增語及耳、鼻、舌、身、意識界可得不可得增語！",
        "translation": "If the ocular consciousness realm is knowable and unknowable, and if the ear, nose, tongue, body, and consciousness realms are knowable and unknowable, they are ultimately unknowable and non-existent in nature, so why should there be additional words that are knowable and unknowable in the ocular consciousness realm or additional words that are knowable and unknowable in the ear, nose, tongue, body, and consciousness realms?",
        "source": "T05n0220_025:0142a08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此增語既非有，如何可言：即眼識界若可得若不可得增語是菩薩摩訶薩，即耳、鼻、舌、身、意識界若可得若不可得增語是菩薩摩訶薩？」",
        "translation": "Since this augmentation is not present, how can it be said that the ocular consciousness realm is a bodhisattva-mahāsattva if it is accessible or inaccessible augmentation, and that the ear, nose, tongue, body, and consciousness realms are bodhisattvas-mahāsattvas if they are accessible or inaccessible augmentations?\"",
        "source": "T05n0220_025:0142a12_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第二十五",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 25",
        "source": "T05n0220_025:0142a16_0",
        "is_bad_quality": false
    }
]