[
    {
        "source_sentence": "大般若波羅蜜多經卷第一百二",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 102",
        "source": "T05n0220_129:0704a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十九",
        "translation": "nineteen",
        "source": "T05n0220_129:0704a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T05n0220_129:0704a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初分校量功德品第三十之二十七",
        "translation": "Chapter 30-27 of the Chapter on the Merit of Measurements in the First Branch",
        "source": "T05n0220_129:0704a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "\"Furthermore, Bhagavān!",
        "source": "T05n0220_129:0704a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，欲得常見十方無數無邊世界現說妙法一切如來、應、正等覺法身、色身、智慧身等，當於如是甚深般若波羅蜜多，供養恭敬、尊重讚歎，至心聽聞、受持、讀誦、精勤修學、如理思惟，廣為有情宣說流布。",
        "translation": "If good sons and good women want to see all the Tathāgatas, Arhats, and Fully Awakened Ones, the Dharma body, form body, and wisdom body of the marvelous Dharma that's being explained in the numberless and limitless worlds in the ten directions, they should make offerings, honor, respect, and praise such profound prajñāpāramitā, wholeheartedly listen, accept, recite, diligently cultivate, and correctly contemplate it, and widely proclaim and disseminate it for sentient beings.",
        "source": "T05n0220_129:0704a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_129:0704a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，欲得常見此佛土中現在如來、應、正等覺法身、色身、智慧身等，當於如是甚深般若波羅蜜多，供養恭敬、尊重讚歎，至心聽聞、受持、讀誦、精勤修學、如理思惟，廣為有情宣說流布。",
        "translation": "If good sons and good women want to see the Tathāgata, Arhat, and Completely Awakened One in the Dharma body, form body, and wisdom body that are present in this Buddha land, they should make offerings, venerate, respect, and praise such profound prajñāparamitā, wholeheartedly listen, retain, recite, diligently cultivate, and correctly contemplate it, and widely proclaim and disseminate it for sentient beings.",
        "source": "T05n0220_129:0704a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_129:0704b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，欲得常見十方三世一切如來、應、正等覺法身、色身、智慧身等，當於如是甚深般若波羅蜜多，供養恭敬、尊重讚歎，至心聽聞、受持、讀誦、精勤修學、如理思惟，廣為有情宣說流布。",
        "translation": "If good sons and good women want to see the Dharma body, form body, and wisdom body of all tathāgatas, arhats, and correct enlightenment in the ten directions and three times, they should make offerings, honor, respect, and praise such profound prajñāpāramitā, wholeheartedly listen, retain, recite, diligently cultivate, and correctly contemplate it, and widely proclaim and disseminate it for sentient beings.",
        "source": "T05n0220_129:0704b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_129:0704b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等修行般若波羅蜜多，應以法性於諸如來、應、正等覺修隨佛念。",
        "translation": "\"If good men and good women cultivate the perfection of wisdom, they should cultivate mindfulness of the buddhas as tathāgatas, arhats, and completely enlightened ones based on their Dharma nature.",
        "source": "T05n0220_129:0704b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_129:0704b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法性有二：一者、有為，二者、無為。",
        "translation": "There are two kinds of Dharma nature: the first is existent, and the second is nonexistent.",
        "source": "T05n0220_129:0704b11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名為有為法性？",
        "translation": "What is called the nature of existent dharmas?",
        "source": "T05n0220_129:0704b12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂如實知我智、有情智、命者智、生者智、養者智、士夫智、補特伽羅智、意生智、儒童智、作者智、受者智、知者智、見者智，若色智、受智、想智、行智、識智，若眼處智、耳處智、鼻處智、舌處智、身處智、意處智，若色處智、聲處智、香處智、味處智、觸處智、法處智，若眼界智、色界智、眼識界智、眼觸智、眼觸為緣所生諸受智，若耳界智、聲界智、耳識界智、耳觸智、耳觸為緣所生諸受智，若鼻界智、香界智、鼻識界智、鼻觸智、鼻觸為緣所生諸受智，若舌界智、味界智、舌識界智、舌觸智、舌觸為緣所生諸受智，若身界智、觸界智、身識界智、身觸智、身觸為緣所生諸受智，若意界智、法界智、意識界智、意觸智、意觸為緣所生諸受智，若地界智、水界智、火界智、風界智、空界智、識界智，若無明智、行智、識智、名色智、六處智、觸智、受智、愛智、取智、有智、生智、老死愁歎苦憂惱智，若布施波羅蜜多智、淨戒波羅蜜多智、安忍波羅蜜多智、精進波羅蜜多智、靜慮波羅蜜多智、般若波羅蜜多智，若內空智、外空智、內外空智、空空智、大空智、勝義空智、有為空智、無為空智、畢竟空智、無際空智、散空智、無變異空智、本性空智、自相空智、共相空智、一切法空智、不可得空智、無性空智、自性空智、無性自性空智，若真如智、法界智、法性智、不虛妄性智、不變異性智、平等性智、離生性智、法定智、法住智、實際智、虛空界智、不思議界智，若苦聖諦智、集聖諦智、滅聖諦智、道聖諦智，若四靜慮智、四無量智、四無色定智，若八解脫智、八勝處智、九次第定智、十遍處智，若四念住智、四正斷智、四神足智、五根智、五力智、七等覺支智、八聖道支智，若空解脫門智、無相解脫門智、無願解脫門智，若五眼智、六神通智，若佛十力智、四無所畏智、四無礙解智、大慈智、大悲智、大喜智、大捨智、十八佛不共法智，若無忘失法智、恒住捨性智，若一切智智、道相智智、一切相智智，若一切陀羅尼門智、一切三摩地門智，若預流智、一來智、不還智、阿羅漢智，若預流向預流果智、一來向一來果智、不還向不還果智、阿羅漢向阿羅漢果智，若獨覺智、獨覺菩提智，若菩薩摩訶薩智、菩薩摩訶薩行智，若三藐三佛陀智、阿耨多羅三藐三菩提智，若善法智、不善法智、無記法智，若過去法智、未來法智、現在法智，若欲界繫法智、色界繫法智、無色界繫法智，若學法智、無學法智、非學非無學法智，若見所斷法智、修所斷法智、非所斷法智，若有色法智、無色法智，若有見法智、無見法智，若有對法智、無對法智，若有漏法智、無漏法智，若有為法智、無為法智，若有罪法智、無罪法智，若世間法智、出世間法智，若雜染法智、清淨法智，諸如是等無量門智，皆悉名為有為法性。",
        "translation": "謂如實知我智、有情智、命者智、生者智、養者智、士夫智、補特伽羅智、意生智、儒童智、作者智、受者智、知者智、見者智，若色智、受智、想智、行智、識智，若眼處智、耳處智、鼻處智、舌處智、身處智、意處智，若色處智、聲處智、香處智、味處智、觸處智、法處智，若眼界智、色界智、眼識界智、眼觸智、眼觸為緣所生諸受智，若耳界智、聲界智、耳識界智、耳觸智、耳觸為緣所生諸受智，若鼻界智、香界智、鼻識界智、鼻觸智、鼻觸為緣所生諸受智，若舌界智、味界智、舌識界智、舌觸智、舌觸為緣所生諸受智，若身界智、觸界智、身識界智、身觸智、身觸為緣所生諸受智，若意界智、法界智、意識界智、意觸智、意觸為緣所生諸受智，若地界智、水界智、火界智、風界智、空界智、識界智，若無明智、行智、識智、名色智、六處智、觸智、受智、愛智、取智、有智、生智、老死愁歎苦憂惱智，若布施波羅蜜多智、淨戒波羅蜜多智、安忍波羅蜜多智、精進波羅蜜多智、靜慮波羅蜜多智、般若波羅蜜多智，若內空智、外空智、內外空智、空空智、大空智、勝義空智、有為空智、無為空智、畢竟空智、無際空智、散空智、無變異空智、本性空智、自相空智、共相空智、一切法空智、不可得空智、無性空智、自性空智、無性自性空智，若真如智、法界智、法性智、不虛妄性智、不變異性智、平等性智、離生性智、法定智、法住智、實際智、虛空界智、不思議界智，若苦聖諦智、集聖諦智、滅聖諦智、道聖諦智，若四靜慮智、四無量智、四無色定智，若八解脫智、八勝處智、九次第定智、十遍處智，若四念住智、四正斷智、四神足智、五根智、五力智、七等覺支智、八聖道支智，若空解脫門智、無相解脫門智、無願解脫門智，若五眼智、六神通智，若佛十力智、四無所畏智、四無礙解智、大慈智、大悲智、大喜智、大捨智、十八佛不共法智，若無忘失法智、恒住捨性智，若一切智智、道相智智、一切相智智，若一切陀羅尼門智、一切三摩地門智，若預流智、一來智、不還智、阿羅漢智，若預流向預流果智、一來向一來果智、不還向不還果智、阿羅漢向阿羅漢果智，若獨覺智、獨覺菩提智，若菩薩摩訶薩智、菩薩摩訶薩行智，若三藐三佛陀智、阿耨多羅三藐三菩提智，若善法智、不善法智、無記法智，若過去法智、未來法智、現在法智，若欲界繫法智、色界繫法智、無色界繫法智，若學法智、無學法智、非學非無學法智，若見所斷法智、修所斷法智、非所斷法智，若有色法智、無色法智，若有見法智、無見法智，若有對法智、無對法智，若有漏法智、無漏法智，若有為法智、無為法智，若有罪法智、無罪法智，若世間法智、出世間法智，若雜染法智、清淨法智，諸如是等無量門智，皆悉名為有為法性。",
        "source": "T05n0220_129:0704b12_11",
        "is_bad_quality": true
    },
    {
        "source_sentence": "「云何名為無為法性？",
        "translation": "\"What is called the dharma-nature of nonbeing?",
        "source": "T05n0220_129:0705a05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂一切法無生無滅、無住無異、無染無淨、無增無減、無相無為無性自性。",
        "translation": "It means that all things lack birth and cessation, lack abiding and dissimilarity, lack defilement and purity, lack increase and decrease, and lack the nature and inherent nature of marklessness and nonproductivity.",
        "source": "T05n0220_129:0705a06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名為無性自性？",
        "translation": "What is called the natureless own-nature?",
        "source": "T05n0220_129:0705a07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂無我性，無有情性，無命者性，無生者性，無養育者性，無士夫性，無補特伽羅性，無意生性，無儒童性，無作者性，無受者性，無知者性，無見者性；若無色性，無受、想、行、識性；若無眼處性，無耳、鼻、舌、身、意處性；若無色處性，無聲、香、味、觸、法處性；若無眼界性，無色界、眼識界及眼觸、眼觸為緣所生諸受性；若無耳界性，無聲界、耳識界及耳觸、耳觸為緣所生諸受性；若無鼻界性，無香界、鼻識界及鼻觸、鼻觸為緣所生諸受性；若無舌界性，無味界、舌識界及舌觸、舌觸為緣所生諸受性；若無身界性，無觸界、身識界及身觸、身觸為緣所生諸受性；若無意界性，無法界、意識界及意觸、意觸為緣所生諸受性；若無地界性，無水、火、風、空、識界性；若無無明性，無行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱性；若無布施波羅蜜多性，無淨戒、安忍、精進、靜慮、般若波羅蜜多性；若無內空性，無外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空性；若無真如性，無法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界性；若無苦聖諦性，無集、滅、道聖諦性；若無四靜慮性，無四無量、四無色定性；若無八解脫性，無八勝處、九次第定、十遍處性；若無四念住性，無四正斷、四神足、五根、五力、七等覺支、八聖道支性；若無空解脫門性，無無相解脫門、無願解脫門性；若無五眼性，無六神通性；若無佛十力性，無四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法性；若無無忘失法性，無恒住捨性性；若無一切智性，無道相智、一切相智性；若無一切陀羅尼門性，無一切三摩地門性；若無預流性，無一來、不還、阿羅漢性；若無預流向預流果性，無一來向一來果、不還向不還果、阿羅漢向阿羅漢果性；若無獨覺性，無獨覺菩提性；若無菩薩摩訶薩性，無菩薩摩訶薩行性；若無三藐三佛陀性，無阿耨多羅三藐三菩提性；若無善法性，無不善、無記法性；若無過去法性，無未來、現在法性；若無欲界繫法性，無色界繫法性，無無色界繫法性；若無學法性，無無學、非學非無學法性；若無見所斷法性，無修所斷、非所斷法性；若無有色法性，無無色法性；若無有見法性，無無見法性；若無有對法性，無無對法性；若無有漏法性，無無漏法性；若無有為法性，無無為法性；若無有罪法性，無無罪法性；若無世間法性，無出世間法性；若無雜染法性，無清淨法性，無如是等無量門性，空、無所有、無相、無狀、無言、無說、無覺、無知，如是名為無性自性。",
        "translation": "謂無我性，無有情性，無命者性，無生者性，無養育者性，無士夫性，無補特伽羅性，無意生性，無儒童性，無作者性，無受者性，無知者性，無見者性；若無色性，無受、想、行、識性；若無眼處性，無耳、鼻、舌、身、意處性；若無色處性，無聲、香、味、觸、法處性；若無眼界性，無色界、眼識界及眼觸、眼觸為緣所生諸受性；若無耳界性，無聲界、耳識界及耳觸、耳觸為緣所生諸受性；若無鼻界性，無香界、鼻識界及鼻觸、鼻觸為緣所生諸受性；若無舌界性，無味界、舌識界及舌觸、舌觸為緣所生諸受性；若無身界性，無觸界、身識界及身觸、身觸為緣所生諸受性；若無意界性，無法界、意識界及意觸、意觸為緣所生諸受性；若無地界性，無水、火、風、空、識界性；若無無明性，無行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱性；若無布施波羅蜜多性，無淨戒、安忍、精進、靜慮、般若波羅蜜多性；若無內空性，無外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空性；若無真如性，無法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界性；若無苦聖諦性，無集、滅、道聖諦性；若無四靜慮性，無四無量、四無色定性；若無八解脫性，無八勝處、九次第定、十遍處性；若無四念住性，無四正斷、四神足、五根、五力、七等覺支、八聖道支性；若無空解脫門性，無無相解脫門、無願解脫門性；若無五眼性，無六神通性；若無佛十力性，無四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法性；若無無忘失法性，無恒住捨性性；若無一切智性，無道相智、一切相智性；若無一切陀羅尼門性，無一切三摩地門性；若無預流性，無一來、不還、阿羅漢性；若無預流向預流果性，無一來向一來果、不還向不還果、阿羅漢向阿羅漢果性；若無獨覺性，無獨覺菩提性；若無菩薩摩訶薩性，無菩薩摩訶薩行性；若無三藐三佛陀性，無阿耨多羅三藐三菩提性；若無善法性，無不善、無記法性；若無過去法性，無未來、現在法性；若無欲界繫法性，無色界繫法性，無無色界繫法性；若無學法性，無無學、非學非無學法性；若無見所斷法性，無修所斷、非所斷法性；若無有色法性，無無色法性；若無有見法性，無無見法性；若無有對法性，無無對法性；若無有漏法性，無無漏法性；若無有為法性，無無為法性；若無有罪法性，無無罪法性；若無世間法性，無出世間法性；若無雜染法性，無清淨法性，無如是等無量門性，空、無所有、無相、無狀、無言、無說、無覺、無知，如是名為無性自性。",
        "source": "T05n0220_129:0705a08_15",
        "is_bad_quality": true
    },
    {
        "source_sentence": "如是諸法無性自性，皆悉名為無為法性。」",
        "translation": "Thus, the absence of the nature and self-nature of all dharmas is called the nature of the Dharma of nothingness.\"",
        "source": "T05n0220_129:0705b29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, \"So it is!",
        "source": "T05n0220_129:0705c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T05n0220_129:0705c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "Just as you said.",
        "source": "T05n0220_129:0705c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_129:0705c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去如來、應、正等覺，皆因如是甚深般若波羅蜜多，已證無上正等菩提；未來如來、應、正等覺，皆因如是甚深般若波羅蜜多，當證無上正等菩提；現在十方無量無數無邊世界一切如來、應、正等覺，皆因如是甚深般若波羅蜜多，現證無上正等菩提。",
        "translation": "Tathāgatas, Arhats, and Fully Awakened Ones of the past all realized unsurpassed correct enlightenment because of such profound prajñā-pāramitā; Tathāgatas, Arhats, and Fully Awakened Ones of the future will realize unsurpassed correct enlightenment because of such profound prajñ-pāramitā; and all Tathāgatas, Arhats, and Fully Awakened Ones of the countless, numerous, and limitless worlds in the ten directions now realize unsurpassed correct enlightenment because of such profound prajñ-pāramitā.",
        "source": "T05n0220_129:0705c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_129:0705c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去如來、應、正等覺聲聞弟子，亦因如是甚深般若波羅蜜多，已得預流果，已得一來、不還、阿羅漢果；未來如來、應、正等覺聲聞弟子，亦因如是甚深般若波羅蜜多，當得預流果，當得一來、不還、阿羅漢果；現在十方無量無數無邊世界，一切如來、應、正等覺聲聞弟子，亦因如是甚深般若波羅蜜多，現得預流果，現得一來、不還、阿羅漢果。",
        "translation": "Tathāgatas, Arhats, and Fully Awakened Ones of the past also attained the fruit of stream-winner and the fruit of once-returning, irreversible arhat because of such profound prajñāpāramitā; Tathāgatas, Arhats, and Fully Awakened Ones of the future also will attain the fruit of stream-winner and the fruit of once-returning, irreversible arhat because of such profound prajñpāramitā; and all Tathāgatas, Arhats, and Fully Awakened Ones of the world in the ten directions now attain the fruit of stream-winner and the fruit of once-returning, irreversible arhat because of such profound prajñpāramitā.",
        "source": "T05n0220_129:0705c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_129:0705c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去獨覺，亦因如是甚深般若波羅蜜多，已證獨覺菩提；未來獨覺，亦因如是甚深般若波羅蜜多，當證獨覺菩提；現在獨覺，亦因如是甚深般若波羅蜜多，現證獨覺菩提。",
        "translation": "It was because of such profound prajñāpāramitā that past pratyekbuddhas realized the enlightenment of pratyekabuddhas; it will be because of such profound prajñpāramitā that future pratyekbuddhas will realize the enlightenment of pratyekabuddhas; and it's because of such profound prajñpāramitā that present pratyekabuddhas will realize the enlightenment of pratyekabuddhas.",
        "source": "T05n0220_129:0705c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_129:0705c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_129:0705c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是般若波羅蜜多祕密藏中，廣說三乘相應法故。",
        "translation": "\"Thus, in the secret store of the perfection of wisdom, the teachings associated with the three vehicles are explained in detail.",
        "source": "T05n0220_129:0705c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然此所說以無所得為方便故，無性無相為方便故，無生無滅為方便故，無染無淨為方便故，無造無作為方便故，無入無出為方便故，無增無減為方便故，無取無捨為方便故，如是所說由世俗故，非勝義故。",
        "translation": "However, this teaching is based on the skill of obtaining nothing, the skill of having no nature and no characteristics, the skill of having no arising and no cessation, the skill of having no defilement and no purity, the skill of having no creation and no action, the skill of having no entry and no exit, the skill of having no increase and no decrease, and the skill of having no acquisition and no disagreement, and it's because what's explained here is worldly and not the ultimate truth.",
        "source": "T05n0220_129:0705c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_129:0705c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是般若波羅蜜多非般若波羅蜜多、非非般若波羅蜜多，非此岸、非彼岸、非中流，非陸、非水，非高、非下，非平等、非不平等，非有相、非無相，非世間、非出世間，非有漏、非無漏，非有為、非無為，非有罪、非無罪，非有色、非無色，非有見、非無見，非有對、非無對，非善、非不善，非有記、非無記，非過去、非未來、非現在，非欲界繫、非色界繫、非無色界繫，非學、非無學、非非學非無學，非見所斷、非修所斷、非非所斷，非有、非空，非境、非智。",
        "translation": "Thus, the perfection of wisdom is neither perfection of wisdom nor non-perfection of wisdom, neither here nor there, neither midstream, neither land nor water, neither high nor low, neither equal nor unequal, neither with nor without marks, neither mundane nor transmundane, neither contaminated nor uncontaminated, neither with nor without effort, neither guilty nor blameless, neither colored nor formless, neither seen nor unseen, neither opposed nor unopposed, neither good nor unskillful, neither marked nor undetermined, neither bound to the desire realm nor bound to the form realm nor bound to the form realm, neither training nor no-training nor neither training nor no-training nor no-training, neither ended by views nor ended by cultivation nor ended by nothing, neither existent nor empty, neither objective nor cognitive.",
        "source": "T05n0220_129:0705c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_129:0706a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是般若波羅蜜多，不與諸佛法，不與菩薩法，不與獨覺法，不與預流法，不與一來法，不與不還法，不與阿羅漢法，不捨異生法。」",
        "translation": "Thus, the perfection of wisdom is not given to the teachings of buddhas, not to the teachings of bodhisattvas, not to the teachings of solitary realizers, not to the teachings of stream-winners, not to the teachings of the once-returners, not to the teachings of nonreturners, not to the teachings of arhats, and not to the teachings of unenlightened sentient beings.\"",
        "source": "T05n0220_129:0706a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天帝釋復白佛言：「世尊！",
        "translation": "Śāriputra then again said to the Buddha, \"Bhagavān!",
        "source": "T05n0220_129:0706a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是般若波羅蜜多，是大波羅蜜多，是無上波羅蜜多，是無等等波羅蜜多。",
        "translation": "Thus, the perfection of wisdom is great perfection, unsurpassed perfection, and peerless perfection.",
        "source": "T05n0220_129:0706a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_129:0706a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩修行如是甚深般若波羅蜜多，雖知一切有情心行境界差別，而不得我，不得有情、命者、生者、養者、士夫、數取趣者、意生、儒童、作者、受者、知者、見者。",
        "translation": "Although the bodhisattva Mahāsattva cultivates such profound prajñāpāramitā, he knows the distinctions in the minds and actions of all sentient beings and their objects, but he doesn't obtain a self, nor does he obtain sentient beings, beings of life, beings of birth, nurturers, men, those who repeatedly pursue destinies, mind-made beings, youths, authors, recipients, knowers, or viewers.",
        "source": "T05n0220_129:0706a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得色，不得受、想、行、識。",
        "translation": "\"Thus, the bodhisattva Mahāsattva also doesn't obtain form, and he doesn't obtain sensation, perception, volition, or consciousness.",
        "source": "T05n0220_129:0706a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得眼處，不得耳、鼻、舌、身、意處。",
        "translation": "\"This is a bodhisattva-mahāsattva who also doesn't obtain the sense-field of the eye and doesn't obtain the sense-fields of the ear, nose, tongue, body, and mind.",
        "source": "T05n0220_129:0706a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得色處，不得聲、香、味、觸、法處。",
        "translation": "\"This is the place where the bodhisattva Mahāsattva also doesn't obtain form and doesn't obtain sound, smell, taste, touch, or dharma.",
        "source": "T05n0220_129:0706a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得眼界，不得色界、眼識界及眼觸、眼觸為緣所生諸受。",
        "translation": "\"The bodhisattva Mahāsattva also doesn't obtain the sense-field of the eye, nor does he obtain the sense-fields of form and visual consciousness or the sensations that arise from eye contact and visual contact as perceptual objects.",
        "source": "T05n0220_129:0706a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得耳界，不得聲界、耳識界及耳觸、耳觸為緣所生諸受。",
        "translation": "\"The bodhisattva Mahāsattva also doesn't obtain the ear realm, the sound realm, the ear-consciousness realm, and the sensations that arise from ear contact and ear contact as perceptual objects.",
        "source": "T05n0220_129:0706a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得鼻界，不得香界、鼻識界及鼻觸、鼻觸為緣所生諸受。",
        "translation": "\"The bodhisattva Mahāsattva also doesn't allow the nasal realm, the sense realm of fragrance, the sense realm of nasal consciousness, and the sensations that arise from nasal contact and nasal contact as perceptual objects.",
        "source": "T05n0220_129:0706a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得舌界，不得味界、舌識界及舌觸、舌觸為緣所生諸受。",
        "translation": "\"The bodhisattva Mahāsattva also doesn't allow the tongue realm, the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact as perceptual objects.",
        "source": "T05n0220_129:0706a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得身界，不得觸界、身識界及身觸、身觸為緣所生諸受。",
        "translation": "\"The bodhisattva Mahāsattva also doesn't allow the body realm, the tactile realm, the body-consciousness realm, and the sensations that arise from bodily contact and bodily contact as perceptual objects.",
        "source": "T05n0220_129:0706a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得意界，不得法界、意識界及意觸、意觸為緣所生諸受。",
        "translation": "\"Thus, the bodhisattva Mahāsattva also doesn't attain the mind element, and he doesn't attain the element of dharmas, the element of consciousness, or the sensations that arise from mental contact and contact of the mind as a condition.",
        "source": "T05n0220_129:0706a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得地界，不得水、火、風、空、識界。",
        "translation": "\"Thus, the bodhisattva Mahāsattva also doesn't attain the element of earth and doesn't attain the elements of water, fire, wind, air, and consciousness.",
        "source": "T05n0220_129:0706a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得無明，不得行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱。",
        "translation": "\"This bodhisattva Mahāsattva also doesn't attain nescience, and doesn't attain form, consciousness, name-and-form, the six sense-fields, touch, feeling, craving, grasping, existence, birth, old age, sorrow, pain, lamentation, and vexation.",
        "source": "T05n0220_129:0706b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得布施波羅蜜多，不得淨戒、安忍、精進、靜慮、般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva also doesn't attain the perfection of generosity and doesn't attain the perfection of pure morality, patience, effort, meditation, and wisdom.",
        "source": "T05n0220_129:0706b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得內空，不得外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空。",
        "translation": "\"Nor does the bodhisattva-mahāsattva attain internal emptiness, external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-marks, emptiness of shared marks, emptiness of all things, inaccessible emptiness, emptiness without nature, emptiness of self-nature, emptiness of self-nature, and emptiness of naturelessness.",
        "source": "T05n0220_129:0706b05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得真如，不得法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界。",
        "translation": "\"Thus, the bodhisattva Mahāsattva also doesn't attain true reality, the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from birth, legality, Dharma abiding, reality, the space realm, and the inconceivable realm.",
        "source": "T05n0220_129:0706b09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得苦聖諦，不得集、滅、道聖諦。",
        "translation": "\"Thus, the bodhisattva-mahāsattva also doesn't attain the noble truth of suffering and doesn't attain the noble truths of arising, ceasing, and the path.",
        "source": "T05n0220_129:0706b11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得四靜慮，不得四無量、四無色定。",
        "translation": "\"Nor does the bodhisattva-mahāsattva obtain the four meditations, nor the four immeasurable and four formless concentrations.",
        "source": "T05n0220_129:0706b12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得八解脫，不得八勝處、九次第定、十遍處。",
        "translation": "\"Nor does the bodhisattva-mahāsattva attain the eight liberations, nor the eight abodes of excellence, nine graduated concentrations, or ten universal abodes.",
        "source": "T05n0220_129:0706b14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得四念住，不得四正斷、四神足、五根、五力、七等覺支、八聖道支。",
        "translation": "\"This bodhisattva-mahāsattva also doesn't attain the four abodes of mindfulness or the four correct eliminations, four miraculous powers, five faculties, five powers, seven factors of virtual enlightenment, and eight factors of the noble path.",
        "source": "T05n0220_129:0706b15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得空解脫門，不得無相、無願解脫門。",
        "translation": "\"This bodhisattva-mahāsattva also doesn't obtain the liberation gate of emptiness and the liberation gate of signlessness and wishlessness.",
        "source": "T05n0220_129:0706b17_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得五眼，不得六神通。",
        "translation": "\"Nor does the bodhisattva Mahāsattva attain the five eyes and the six supernormal powers.",
        "source": "T05n0220_129:0706b18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得佛十力，不得四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法。",
        "translation": "\"This bodhisattva-mahāsattva also doesn't attain the Buddha's ten powers, the four forms of fearlessness, the four forms of unhindered understanding, great kindness, great compassion, great joy, great equanimity, and the 18 uncommon dharmas of the Buddha.",
        "source": "T05n0220_129:0706b19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得無忘失法，不得恒住捨性。",
        "translation": "\"This bodhisattva, Mahāsattva, also doesn't attain the Dharma of no forgetfulness and doesn't attain the nature of constant abiding equanimity.",
        "source": "T05n0220_129:0706b21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得一切智，不得道相智、一切相智。",
        "translation": "\"This bodhisattva-mahāsattva also doesn't attain omniscience, nor does he attain knowledge of the path and omniscience.",
        "source": "T05n0220_129:0706b22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得一切陀羅尼門，不得一切三摩地門。",
        "translation": "\"This bodhisattva-mahāsattva also doesn't attain the entrance to all dhāraṇīs and doesn't attain the entrance to all samādhis.",
        "source": "T05n0220_129:0706b24_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得預流，不得一來、不還、阿羅漢。",
        "translation": "\"Nor does the bodhisattva-mahāsattva obtain the precepts, nor does he obtain the once-returner, the nonreturner, or the arhat.",
        "source": "T05n0220_129:0706b25_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得預流向預流果，不得一來向一來果、不還向不還果、阿羅漢向阿羅漢果。",
        "translation": "\"Nor may a bodhisattva-mahāsattva go from preflow to the fruit of preflow, from once-returner to the fruit of once-returner, from nonreturner to the fruit of nonreturner, or from arhat to arhat.",
        "source": "T05n0220_129:0706b26_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得獨覺，不得獨覺菩提。",
        "translation": "\"Nor must the bodhisattva-mahāsattva attain pratyekabuddha or pratyekabuddha enlightenment.",
        "source": "T05n0220_129:0706b28_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得菩薩摩訶薩，不得菩薩摩訶薩法。",
        "translation": "\"Suppose a bodhisattva-mahāsattva also doesn't attain bodhisattva-mahāsattva and doesn't attain bodhisattva-mahāsattva-dharma.",
        "source": "T05n0220_129:0706b29_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩亦不得三藐三佛陀，不得三藐三佛陀法。",
        "translation": "\"Such a bodhisattva-mahāsattva also doesn't attain samyak-saṃbuddha and doesn't attain samyak-saṃbuddha-dharma.",
        "source": "T05n0220_129:0706c02_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何以故？",
        "translation": "\"Why is that?",
        "source": "T05n0220_129:0706c03_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非此般若波羅蜜多因有所得而現前故。",
        "translation": "\"It's not because this perfection of wisdom has been attained that it's manifested.",
        "source": "T05n0220_129:0706c03_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_129:0706c04_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多都無自性亦不可得，能得、所得及二依處性相皆空不可得故。」",
        "translation": "The profound perfection of wisdom has no own-nature and is unobtainable, so the nature and characteristics of the two bases that can be attained and attained are empty and unobtainable.\"",
        "source": "T05n0220_129:0706c04_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, \"So it is!",
        "source": "T05n0220_129:0706c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T05n0220_129:0706c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "Just as you said.",
        "source": "T05n0220_129:0706c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_129:0706c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_129:0706c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩以無所得為方便，長夜修行甚深般若波羅蜜多，尚不得菩提及薩埵，況得菩薩摩訶薩！",
        "translation": "How could a bodhisattva-mahāsattva attain bodhi and sattva when he has cultivated the profound perfection of wisdom for a long time using the method of obtaining nothing, but still hasn't attained bodhi and sattva?",
        "source": "T05n0220_129:0706c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此菩薩摩訶薩既不可得，豈得菩薩摩訶薩法！",
        "translation": "Since this bodhisattva-mahāsattva is unobtainable, how could the bodhisattva-mahāsattva dharma be obtained?",
        "source": "T05n0220_129:0706c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩與法尚不可得，況得諸佛及諸佛法！」",
        "translation": "Bodhisattvas and dharmas are still unobtainable, so how could you attain buddhas and buddha-teachings!\"",
        "source": "T05n0220_129:0706c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天帝釋復白佛言：「世尊！",
        "translation": "Then, Śakra again said to the Buddha, \"Bhagavān!",
        "source": "T05n0220_129:0706c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩為但行般若波羅蜜多，亦行餘五波羅蜜多耶？」",
        "translation": "Does the bodhisattva Mahāsattva simply practice the perfection of wisdom and also practice the other five perfections?\"",
        "source": "T05n0220_129:0706c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「憍尸迦！",
        "translation": "The Buddha said, \"Kauśika!",
        "source": "T05n0220_129:0706c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩以無所得為方便，具行六種波羅蜜多。",
        "translation": "The bodhisattva-mahāsattva performs six perfections with the method of obtaining nothing.",
        "source": "T05n0220_129:0706c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行布施時，不得施者，不得受者，不得施及施物；行淨戒時，不得淨戒，不得惡戒，不得持淨戒者；行安忍時，不得安忍，不得忿恚，不得行安忍者；行精進時，不得精進，不得懈怠，不得行精進者；行靜慮時，不得靜慮，不得散亂，不得行靜慮者；行般若時，不得般若，不得惡慧，不得行般若者。",
        "translation": "When they practice generosity, they mustn't give, mustn't accept, and mustn't give or give things; when they practice pure morality, they mustn't observe pure morality, mustn't observe bad morality, and mustn't observe pure morality; when they practice patience, they mustn't tolerate it, mustn't be angry, and mustn't practice patience; when they practice effort, they mustn't make effort, mustn't be lazy, and mustn't practice effort; when they practice meditation, they mustn't meditate, mustn't be distracted, and mustn't practice meditation; and when they practice prajñā, they mustn't practice prajñā, mustn't have bad wisdom, and mustn't practice prajñā.",
        "source": "T05n0220_129:0706c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_129:0706c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩甚深般若波羅蜜多為尊為導，修習一切波羅蜜多，令速圓滿。",
        "translation": "The bodhisattva Mahāsattva's profound perfection of wisdom is honored as a guide, and he cultivates all the perfections, causing them to be quickly fulfilled.",
        "source": "T05n0220_129:0706c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩行布施時，甚深般若波羅蜜多為尊為導，所修布施波羅蜜多無所執著速得圓滿。",
        "translation": "\"When the bodhisattva Mahāsattva practices generosity, the very profound prajñāpāramitā is the venerable guide, and the prajñāpāramitā cultivated without attachment quickly brings about its consummation.",
        "source": "T05n0220_129:0706c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩行淨戒時，甚深般若波羅蜜多為尊為導，所修淨戒波羅蜜多無所執著速得圓滿。",
        "translation": "\"When the bodhisattva Mahāsattva practices pure morality, the profound perfection of wisdom is the venerable guide, and the perfection of cultivating pure morality has no attachment and is quickly consummated.",
        "source": "T05n0220_129:0706c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩行安忍時，甚深般若波羅蜜多為尊為導，所修安忍波羅蜜多無所執著速得圓滿。",
        "translation": "\"When the bodhisattva Mahāsattva practices forbearance, the profound perfection of wisdom is the venerable guide, and the perfection of forbearance that he cultivates has no attachment and is quickly consummated.",
        "source": "T05n0220_129:0706c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩行精進時，甚深般若波羅蜜多為尊為導，所修精進波羅蜜多無所執著速得圓滿。",
        "translation": "\"When the bodhisattva Mahāsattva practices effort, the profound perfection of wisdom is the venerable guide, and the perfection of effort that he cultivates has no attachment and is quickly consummated.",
        "source": "T05n0220_129:0707a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩行靜慮時，甚深般若波羅蜜多為尊為導，所修靜慮波羅蜜多無所執著速得圓滿。",
        "translation": "\"When the bodhisattva-mahāsattva practices meditation, the well-versed prajñāpāramitā is the venerable guide, and the prajñāpāramitā cultivated by him for meditation has no attachment and quickly attains its consummation.",
        "source": "T05n0220_129:0707a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩行般若時，甚深般若波羅蜜多為尊為導，所修般若波羅蜜多無所執著速得圓滿。",
        "translation": "\"When bodhisattvas and mahāsattvas practice prajñā, the profound prajñāpāramitā that they cultivate is honored as their guide, and the prajñāpāramitā they cultivate has no attachment and is quickly consummated.",
        "source": "T05n0220_129:0707a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_129:0707a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩於一切法，以無所得為方便，修習般若波羅蜜多故無執著，令所修習速得圓滿。",
        "translation": "\"Regarding all things, the bodhisattva Mahāsattva cultivates the perfection of wisdom with the method of obtaining nothing, so he doesn't cling to it and causes that cultivation to quickly become complete.",
        "source": "T05n0220_129:0707a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於色，以無所得為方便，修習般若波羅蜜多；於受、想、行、識，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of wisdom in regard to form using the method of obtaining nothing, and he cultivates the perfection of wisdom in regard to feeling, perception, volition, and consciousness using the method of obtaining nothing.",
        "source": "T05n0220_129:0707a11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, there's no attachment, which causes that cultivation to quickly become complete.",
        "source": "T05n0220_129:0707a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於眼處，以無所得為方便，修習般若波羅蜜多；於耳、鼻、舌、身、意處，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of prajñā in the place of the eye using the method of obtaining nothing, and he cultivates the perfection of prajñā in the places of the ear, nose, tongue, body, and mind using the method of obtaining nothing.",
        "source": "T05n0220_129:0707a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, there's no attachment, which causes the cultivation to quickly become complete.",
        "source": "T05n0220_129:0707a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於色處，以無所得為方便，修習般若波羅蜜多；於聲、香、味、觸、法處，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of wisdom in the locus of form with the method of obtaining nothing, and he cultivates the perfection of wisdom in the locus of sound, smell, taste, touch, and dharma with the method of obtaining nothing.",
        "source": "T05n0220_129:0707a18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, there's no attachment, which causes the cultivation to quickly become complete.",
        "source": "T05n0220_129:0707a21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於眼界，以無所得為方便，修習般若波羅蜜多；於色界、眼識界及眼觸、眼觸為緣所生諸受，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of wisdom in the eye realm using the method of obtaining nothing, and he cultivates the perfection of wisdom in the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as perceptual objects using the method of obtaining nothing.",
        "source": "T05n0220_129:0707a22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, there's no attachment, which causes that cultivation to quickly become complete.",
        "source": "T05n0220_129:0707a25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於耳界，以無所得為方便，修習般若波羅蜜多；於聲界、耳識界及耳觸、耳觸為緣所生諸受，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of wisdom in the ear realm using the method of obtaining nothing, and he cultivates the perfection of wisdom in the sound realm, the ear-consciousness realm, and the sensations that arise from ear contact and ear contact as causes and conditions using the method of obtaining nothing.",
        "source": "T05n0220_129:0707a26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, there's no attachment, which causes that cultivation to quickly become complete.",
        "source": "T05n0220_129:0707a29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於鼻界，以無所得為方便，修習般若波羅蜜多；於香界、鼻識界及鼻觸、鼻觸為緣所生諸受，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of wisdom in the nasal realm using the method of acquiring nothing, and he cultivates the perfection of wisdom in the sense realm of fragrance, the sense realm of nasal consciousness, and the sensations that arise from nasal contact and nasal contact as perceptual objects using the method of acquiring nothing.",
        "source": "T05n0220_129:0707b01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, there's no attachment, which causes that cultivation to quickly become complete.",
        "source": "T05n0220_129:0707b05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於舌界，以無所得為方便，修習般若波羅蜜多；於味界、舌識界及舌觸、舌觸為緣所生諸受，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of wisdom in the tongue realm using the method of obtaining nothing, and he cultivates the perfection of wisdom in the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact as perceptual objects using the method of obtaining nothing.",
        "source": "T05n0220_129:0707b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, there's no attachment, which causes that cultivation to quickly become complete.",
        "source": "T05n0220_129:0707b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於身界，以無所得為方便，修習般若波羅蜜多；於觸界、身識界及身觸、身觸為緣所生諸受，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of wisdom in the body realm using the method of obtaining nothing, and he cultivates the perfection of wisdom in the sense realm of contact, the sense realm of body consciousness, and the sensations that arise from body contact and body contact as causes and conditions using the method of obtaining nothing.",
        "source": "T05n0220_129:0707b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, there's no attachment, which causes that cultivation to quickly become complete.",
        "source": "T05n0220_129:0707b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於意界，以無所得為方便，修習般若波羅蜜多；於法界、意識界及意觸、意觸為緣所生諸受，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of wisdom in the mind realm using the method of acquiring nothing, and he cultivates the perfection of wisdom in the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as causes and conditions using the method of acquiring nothing.",
        "source": "T05n0220_129:0707b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, there's no attachment, which causes that cultivation to quickly become complete.",
        "source": "T05n0220_129:0707b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於地界，以無所得為方便，修習般若波羅蜜多；於水、火、風、空、識界，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of wisdom in the element of earth by using the method of obtaining nothing, and he cultivates the perfection of wisdom in the elements of water, fire, wind, air, and consciousness by using the method of obtaining nothing.",
        "source": "T05n0220_129:0707b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, there's no attachment, which causes the cultivation to quickly become complete.",
        "source": "T05n0220_129:0707b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於無明，以無所得為方便，修習般若波羅蜜多；於行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of wisdom in regard to nescience using the method of obtaining nothing, and he cultivates the perfection of wisdom in regard to form, consciousness, name-and-form, the six sense-fields, touch, feeling, craving, grasping, existence, birth, grief and sorrow of old age and death using the method of obtaining nothing.",
        "source": "T05n0220_129:0707b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of this cause and condition, there's no attachment, which causes that cultivation to quickly become complete.",
        "source": "T05n0220_129:0707b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於內空，以無所得為方便，修習般若波羅蜜多；於外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of prajñā in terms of the skill of attaining nothing when it comes to internal emptiness, and he cultivates the perfection of prajñā in terms of the skill of attaining nothing when it comes to external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, unchanging emptiness, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all things, inaccessible emptiness, emptiness without nature, emptiness of self-nature, and emptiness of self-nature, using the skill of attaining nothing as the basis for cultivating the perfection of prajñā.",
        "source": "T05n0220_129:0707b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of this cause and condition, there's no attachment, which causes that cultivation to quickly become complete.",
        "source": "T05n0220_129:0707c03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於真如，以無所得為方便，修習般若波羅蜜多；於法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of wisdom in regard to true thusness with the method of acquiring nothing, and he cultivates the perfection of wisdom in regard to the Dharma realm, Dharma nature, non-falsity, unchanging nature, equality, freedom from birth, legality, Dharma abiding, reality, the space realm, and the inconceivable realm with the method of acquiring nothing.",
        "source": "T05n0220_129:0707c04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of this cause and condition, there's no attachment, which causes that cultivation to quickly become complete.",
        "source": "T05n0220_129:0707c08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於苦聖諦，以無所得為方便，修習般若波羅蜜多；於集、滅、道聖諦，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of wisdom in the noble truth of suffering using the method of obtaining nothing, and he cultivates the perfection of wisdom in the noble truths of arising, cessation, and the path using the method of obtaining nothing.",
        "source": "T05n0220_129:0707c09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, they have no attachment, which causes their cultivation to quickly become complete.",
        "source": "T05n0220_129:0707c12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於布施波羅蜜多，以無所得為方便，修習般若波羅蜜多；於淨戒、安忍、精進、靜慮、般若波羅蜜多，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of generosity with the convenience of obtaining nothing, and he cultivates the perfection of pure morality, patience, effort, meditation, and the perfection of wisdom with the convenience of obtaining nothing.",
        "source": "T05n0220_129:0707c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, there's no attachment, which causes that cultivation to quickly become complete.",
        "source": "T05n0220_129:0707c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於四靜慮，以無所得為方便，修習般若波羅蜜多；於四無量、四無色定，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of wisdom in the four meditations with the convenience of obtaining nothing, and he cultivates the perfection of wisdom in the four immeasurable and four formless concentrations with the convenience of obtaining nothing.",
        "source": "T05n0220_129:0707c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, there's no attachment, which causes the cultivation to quickly become complete.",
        "source": "T05n0220_129:0707c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於八解脫，以無所得為方便，修習般若波羅蜜多；於八勝處、九次第定、十遍處，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of wisdom in the eight liberations with the convenience of obtaining nothing, and he cultivates the perfection of wisdom in the eight abodes of excellence, nine graduated concentrations, and ten universal abodes with the convenience of obtaining nothing.",
        "source": "T05n0220_129:0707c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, there's no attachment, which causes the cultivation to quickly become complete.",
        "source": "T05n0220_129:0707c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於四念住，以無所得為方便，修習般若波羅蜜多；於四正斷、四神足、五根、五力、七等覺支、八聖道支，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of wisdom in the four abodes of mindfulness with the convenience of obtaining nothing, and he cultivates the perfection of wisdom in the four correct eliminations, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual awakening, and the eight noble factors of the path with the convenience of obtaining nothing.",
        "source": "T05n0220_129:0707c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of this cause and condition, there's no attachment, which causes that cultivation to quickly become complete.",
        "source": "T05n0220_129:0707c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於空解脫門，以無所得為方便，修習般若波羅蜜多；於無相、無願解脫門，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of prajñā through the method of the liberation of emptiness and the perfection of prajñā through the method of the liberation of signlessness and wishlessness, using the method of gainlessness as the basis.",
        "source": "T05n0220_129:0707c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, they have no attachment, which causes their cultivation to quickly become complete.",
        "source": "T05n0220_129:0708a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於五眼，以無所得為方便，修習般若波羅蜜多；於六神通，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of prajñā by using the five eyes as a method of attaining nothing, and he cultivates the perfection of prajñā by using the six supernormal powers as a method of attaining nothing.",
        "source": "T05n0220_129:0708a04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, they have no attachment, which causes their cultivation to quickly become complete.",
        "source": "T05n0220_129:0708a06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於佛十力，以無所得為方便，修習般若波羅蜜多；於四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of wisdom based on the unobtainable ten powers of the Buddha, and he cultivates the perfection of wisdom based on the unobtainable four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and the 18 uncommon dharmas of the Buddha.",
        "source": "T05n0220_129:0708a07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, there's no attachment, which causes that cultivation to quickly become complete.",
        "source": "T05n0220_129:0708a11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於無忘失法，以無所得為方便，修習般若波羅蜜多；於恒住捨性，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of prajñā in the method of non-forgetfulness and the perfection of wisdom in the method of gainlessness, and he cultivates the perfection of prajñā in the nature of constantly abiding equanimity with the method of gainlessness.",
        "source": "T05n0220_129:0708a12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, there's no attachment, which causes the cultivation to quickly become complete.",
        "source": "T05n0220_129:0708a15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於一切智，以無所得為方便，修習般若波羅蜜多；於道相智、一切相智，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of prajñā by means of the ungraspable cognition of all things, and he cultivates the perfection of prajñā by means of the ungraspable cognition of the path and the cognition of all characteristics.",
        "source": "T05n0220_129:0708a16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, they have no attachment, which causes their cultivation to quickly become complete.",
        "source": "T05n0220_129:0708a18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於一切陀羅尼門，以無所得為方便，修習般若波羅蜜多；於一切三摩地門，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of prajñā in the approach of all dhāraṇīs using the method of obtaining nothing, and he cultivates the perfection of prajñā in the approach of all samādhis using the method of obtaining nothing.",
        "source": "T05n0220_129:0708a19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, there's no attachment, which causes the cultivation to quickly become complete.",
        "source": "T05n0220_129:0708a22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於預流，以無所得為方便，修習般若波羅蜜多；於一來、不還、阿羅漢，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of prajñā by using the method of obtaining nothing, and he cultivates the perfection of prajñā by using the method of obtaining nothing in the first-returner, the nonreturner, and the arhat.",
        "source": "T05n0220_129:0708a23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, they have no attachment, which causes their cultivation to quickly become complete.",
        "source": "T05n0220_129:0708a26_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於預流向預流果，以無所得為方便，修習般若波羅蜜多；於一來向一來果、不還向不還果、阿羅漢向阿羅漢果，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattvas and mahāsattvas cultivate the perfection of prajñā in the form of the method of obtaining nothing when they're headed toward the fruit of stream-warming, and they cultivate the perfection of prajñā in the form of the method of obtaining nothing when they're headed toward the fruit of once-returning, nonreturning, and arhatship.",
        "source": "T05n0220_129:0708a27_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, there's no attachment, which causes that cultivation to quickly become complete.",
        "source": "T05n0220_129:0708b02_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於獨覺，以無所得為方便，修習般若波羅蜜多；於獨覺菩提，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of prajñā using the method of attaining nothing as the method for achieving solitary awakening, and he cultivates the perfection of prajñā using the method of attaining nothing as the method for achieving enlightenment for solitary awakening.",
        "source": "T05n0220_129:0708b03_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, they have no attachment, which causes their cultivation to quickly become complete.",
        "source": "T05n0220_129:0708b05_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於菩薩摩訶薩，以無所得為方便，修習般若波羅蜜多；於菩薩摩訶薩行，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of wisdom with the convenience of obtaining nothing, and the bodhisattva Mahāsattva's practice cultivates the perfection of wisdom with the convenience of obtaining nothing.",
        "source": "T05n0220_129:0708b06_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, they have no attachment, which causes their cultivation to quickly become complete.",
        "source": "T05n0220_129:0708b09_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是菩薩摩訶薩於三藐三佛陀，以無所得為方便，修習般若波羅蜜多；於無上正等菩提，以無所得為方便，修習般若波羅蜜多。",
        "translation": "\"Thus, the bodhisattva Mahāsattva cultivates the perfection of wisdom using the method of obtaining nothing as the samyak-saṃbuddha, and he cultivates the perfection of wisdom using the method of obtaining nothing as the unsurpassed correct enlightenment.",
        "source": "T05n0220_129:0708b10_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣無所執著，令所修習速得圓滿。",
        "translation": "Because of these causes and conditions, they have no attachment, which causes their cultivation to quickly become complete.",
        "source": "T05n0220_129:0708b13_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_129:0708b14_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如贍部洲所有諸樹枝條、莖幹、花葉、果實，雖有種種形色不同，而其陰影都無差別；如是布施、淨戒、安忍、精進、靜慮波羅蜜多雖各有異，而由般若波羅蜜多攝受，迴向一切智智，以無所得為方便故亦無差別。」",
        "translation": "Just as there are branches, stems, flowers, leaves, and fruits of all the trees on Jambudvīpa that have various forms and colors but whose shadows are not different, so too are there differences in the prajñāpāramitās of generosity, pure precepts, patience, effort, and meditation that are collected by the prajñpāramitā and directed toward the knowledge of all things with the method of obtaining nothing.\"",
        "source": "T05n0220_129:0708b14_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，天帝釋白佛言：「世尊！",
        "translation": "It was then that Śakra Devānām-Indra said to the Buddha, \"Bhagavān!",
        "source": "T05n0220_129:0708b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是般若波羅蜜多成就廣大殊勝功德，如是般若波羅蜜多成就一切殊勝功德，如是般若波羅蜜多成就無量殊勝功德，如是般若波羅蜜多成就圓滿殊勝功德，如是般若波羅蜜多成就無邊殊勝功德，如是般若波羅蜜多成就無對殊勝功德，如是般若波羅蜜多成就無盡殊勝功德，如是般若波羅蜜多成就無分限殊勝功德，如是般若波羅蜜多成就無等等殊勝功德，如是般若波羅蜜多成就難思議殊勝功德，如是般若波羅蜜多成就不可說殊勝功德。",
        "translation": "Thus, the perfection of prajñāpāramitā accomplishes vast superior qualities, thus the perfection of prajñāpāramitā accomplishes all superior qualities, thus the perfection of prajñāpāramitā accomplishes measureless superior qualities, thus the perfection of prajñāpāramitā accomplishes complete superior qualities, thus the perfection of prajñāpāramitā accomplishes limitless superior qualities, thus the perfection of prajñāpāramitā accomplishes unsurpassed superior qualities, thus the perfection of prajñāpāramitā accomplishes inexhaustible superior qualities, thus the perfection of prajñāpāramitā accomplishes limitless superior qualities, thus the perfection of prajñāpāramitā accomplishes unfathomable superior qualities, and thus the perfection of prajñāpāramitā accomplishes ineffable superior qualities.",
        "source": "T05n0220_129:0708b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T05n0220_129:0708c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等書寫如是甚深般若波羅蜜多，眾寶嚴飾，以無量種上妙花鬘、塗散等香、衣服、纓絡、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明，盡諸所有供養恭敬、尊重讚歎，依此經說如理思惟。",
        "translation": "\"If good men and good women write such a profound prajñāpāramitā, adorn it with many treasures, adorn it with measureless kinds of wonderful flower garlands, scattered incense, clothing, tapestry, jeweled banners, banners and shrouds, and many wonderful, precious things, music, and lamps, they make all the offerings, venerate, respect, and praise it, and rely on what this sūtra says to consider it according to reality.",
        "source": "T05n0220_129:0708c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有善男子、善女人等，書寫如是甚深般若波羅蜜多施他受持、廣令流布。",
        "translation": "Are there good men and good women who write such profound prajñāpāramitā, give it to others, maintain it, and spread it far and wide?",
        "source": "T05n0220_129:0708c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此二福聚何者為多？」",
        "translation": "Which of these two categories of merit is substantial?\"",
        "source": "T05n0220_129:0708c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「憍尸迦！",
        "translation": "The Buddha said, \"Kauśika!",
        "source": "T05n0220_129:0708c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我還問汝，隨汝意答。",
        "translation": "\"I'll ask you again and answer as you like.",
        "source": "T05n0220_129:0708c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等從他請得佛設利羅，以寶函盛置高勝處，復持無量上妙花鬘、塗散等香、衣服、纓絡、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明，盡諸所有供養恭敬、尊重讚歎。",
        "translation": "\"Suppose there are good sons and women who invite another person to receive the Buddha's śarīra, put it in a high place with a jeweled box, and carry measureless flowers, scattered incense, clothing, tapestry, a jeweled banner, streamers, flags, wonderful things, treasures, music, and lamps, and make all of their offerings, venerate, respect, and praise them.",
        "source": "T05n0220_129:0708c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有善男子、善女人等從他請得佛設利羅，分施與他如芥子許，令彼敬受如法安置，復以無量上妙花鬘、塗散等香、衣服、纓絡、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明，盡諸所有供養恭敬、尊重讚歎。",
        "translation": "Suppose a good man or woman asks another person to accept a Buddha's heliotrope, distributes it to them like a mustard seed, causes them to respect it and place it according to the teaching, and then offers them measureless amounts of the finest flowers, scattered incense, clothing, tapestry, banners, flags, canopies, and numerous wonderful, precious, musical, and illuminating lanterns, all of which are offered, respected, venerated, and praised.",
        "source": "T05n0220_129:0708c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T05n0220_129:0708c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是前後二種福聚何者為多？」",
        "translation": "Which of these two kinds of merit is greater, the first or the second?\"",
        "source": "T05n0220_129:0708c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天帝釋言：「世尊！",
        "translation": "The emperor explained, \"Bhagavān!",
        "source": "T05n0220_129:0708c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我解佛所說法義，若善男子、善女人等從他請得佛設利羅，以寶函盛置高勝處，復持無量上妙花鬘、塗散等香、衣服、纓絡、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明，盡諸所有供養恭敬、尊重讚歎。",
        "translation": "\"As I have explained the Buddha's teaching, suppose a good man or woman were to invite another person to receive the Buddha's śarīra, place it in a high place with a jeweled box, and then carry an immeasurable amount of wonderful flower garlands, scattered incense, clothing, tapestry, a jeweled banner, banners, flags, and numerous wonderful, precious, musical, and lanterns, making all the offerings, venerating, and praising them with respect.",
        "source": "T05n0220_129:0708c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有善男子、善女人等從他請得佛設利羅，分施與他如芥子許，令彼敬受如法安置，復以無量上妙花鬘、塗散等香、衣服、纓絡、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明，盡諸所有供養恭敬、尊重讚歎。",
        "translation": "Suppose a good man or woman asks another person to accept a Buddha's heliotrope, distributes it to them like a mustard seed, causes them to respect it and place it according to the teaching, and then offers them measureless amounts of the finest flower garlands, scattering incense, clothing, tapestry, banners, flags, banners, banners and shrouds, and a multitude of wonderful, precious, musical, and illuminating lamps, all of which are offered, venerated, and praised with respect.",
        "source": "T05n0220_129:0708c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此二福聚後者為多。",
        "translation": "The latter of these two categories of merit is greater.",
        "source": "T05n0220_129:0708c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_129:0708c27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺本以大悲觀有情類，應於諸佛設利羅所歸敬供養而得度者，以金剛喻三摩地力，碎金剛身令如芥子，復以深廣大悲神力加持，如是佛設利羅令於如來般涅槃後，有得一粒如芥子量，種種供養其福無邊，於天人中受諸妙樂，乃至最後得盡苦際，故施他者其福為多。」",
        "translation": "All tathāgatas, arhats, and fully enlightened ones originally observe the categories of sentient beings with great compassion, and those who attain salvation by making offerings to the Buddhas and lila, using the metaphor of vajra as the power of samādhi, crush the vajra body so that it resembles a mustard seed, and then uphold it with the profound and vast spiritual power of great compassion, so that after the Tathāgata's parinirvāṇa, a single grain as large as a mustard seed will attain various offerings whose merits are limitless, and they'll experience marvelous pleasures among gods and humans until the final end of suffering; therefore, those who give to others will have great merit.\"",
        "source": "T05n0220_129:0708c27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第一百二十九",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 129",
        "source": "T05n0220_129:0709a05_0",
        "is_bad_quality": false
    }
]