[
    {
        "source_sentence": "大般若波羅蜜多經卷第一百三",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 133",
        "source": "T05n0220_103:0569b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T05n0220_103:0569b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初分攝受品第二十九之五",
        "translation": "Chapter 29-5 of the First Part of the Sutra on Taking In",
        "source": "T05n0220_103:0569b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0569b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，學此般若波羅蜜多大呪王時，不得布施波羅蜜多，不得淨戒、安忍、精進、靜慮、般若波羅蜜多。",
        "translation": "\"Good men and good women, when they study this great dhāraṇī of prajñāpāramitā, they won't be allowed to give prajñāpāramitā, nor will they be allowed pure morality, patience, effort, meditation, or prajñāpāramitā.",
        "source": "T05n0220_103:0569b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於布施波羅蜜多等無所得故，不為自害，不為害他，不為俱害。",
        "translation": "Because they gain nothing from the perfection of generosity, they don't harm themselves, don't harm others, and don't harm either.",
        "source": "T05n0220_103:0569b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0569b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，學此般若波羅蜜多大呪王時，不得四靜慮，不得四無量、四無色定。",
        "translation": "\"Good men and good women, when they study this great dhāraṇī of prajñāpāramitā, they won't attain the four meditations, the four immeasurable, and the four formless concentrations.",
        "source": "T05n0220_103:0569b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於四靜慮等無所得故，不為自害，不為害他，不為俱害。",
        "translation": "Because they gain nothing from these four meditations, they won't harm themselves, won't harm others, and won't harm either.",
        "source": "T05n0220_103:0569b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0569b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，學此般若波羅蜜多大呪王時，不得八解脫，不得八勝處、九次第定、十遍處。",
        "translation": "\"Good sons and good women, when they study this great king of prajñāpāramitā spells, they won't attain the eight liberations, the eight abodes of excellence, the nine graduated concentrations, and the ten universal abodes.",
        "source": "T05n0220_103:0569b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於八解脫等無所得故，不為自害，不為害他，不為俱害。",
        "translation": "Because they have nothing to gain from these eight liberations, they won't harm themselves, won't harm others, and won't harm either.",
        "source": "T05n0220_103:0569b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0569b19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，學此般若波羅蜜多大呪王時，不得四念住，不得四正斷、四神足、五根、五力、七等覺支、八聖道支。",
        "translation": "\"Good sons and good women, when they study this great dhāraṇī of prajñāpāramitā, they won't be allowed the four abodes of mindfulness, the four correct eliminations, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T05n0220_103:0569b19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於四念住等無所得故，不為自害，不為害他，不為俱害。",
        "translation": "Because these four abodes of mindfulness and so forth are unobtainable, they won't harm themselves, won't harm others, and won't harm either.",
        "source": "T05n0220_103:0569b22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0569b23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，學此般若波羅蜜多大呪王時，不得空解脫門，不得無相、無願解脫門。",
        "translation": "\"When good sons and good women study this great dhāraṇī of prajñāpāramitā, they can't attain the liberation gate of emptiness or the liberation gate of formlessness and wishlessness.",
        "source": "T05n0220_103:0569b23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於空解脫門等無所得故，不為自害，不為害他，不為俱害。",
        "translation": "Because they have nothing to gain from the liberation gate of emptiness and so forth, they won't harm themselves, won't harm others, and won't harm either.",
        "source": "T05n0220_103:0569b25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0569b26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，學此般若波羅蜜多大呪王時，不得五眼，不得六神通。",
        "translation": "\"Good sons and good women, when they study this great dhāraṇī of prajñāpāramitā, they won't attain the five eyes and won't attain the six supernormal powers.",
        "source": "T05n0220_103:0569b27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於五眼等無所得故，不為自害，不為害他，不為俱害。",
        "translation": "Because they have nothing to gain from the five eyes and so forth, they won't harm themselves, won't harm others, and won't harm either.",
        "source": "T05n0220_103:0569b28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0569c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，學此般若波羅蜜多大呪王時，不得佛十力，不得四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法。",
        "translation": "\"Good sons and good women, when they study this great king of prajñāpāramitā spells, they won't attain the Buddha's ten powers, nor will they attain the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, or 18 distinctive qualities of the Buddha.",
        "source": "T05n0220_103:0569c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於佛十力等無所得故，不為自害，不為害他，不為俱害。",
        "translation": "Because they have nothing to gain from the Buddha's ten powers, they won't harm themselves, won't harm others, and won't harm either.",
        "source": "T05n0220_103:0569c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0569c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，學此般若波羅蜜多大呪王時，不得無忘失法，不得恒住捨性。",
        "translation": "\"Good sons and good women, when they study this great dhāraṇī of prajñāpāramitā, they won't attain the Dharma of no forgetfulness or the nature of constant equanimity.",
        "source": "T05n0220_103:0569c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於無忘失法等無所得故，不為自害，不為害他，不為俱害。",
        "translation": "Because they gain nothing such as the Dharma of no forgetfulness, they won't harm themselves, won't harm others, and won't harm either.",
        "source": "T05n0220_103:0569c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0569c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，學此般若波羅蜜多大呪王時，不得一切智，不得道相智、一切相智。",
        "translation": "\"Good sons and good women, when they study this great dhāraṇī of prajñāpāramitā, they won't attain omniscience, knowledge of the path, or knowledge of all characteristics.",
        "source": "T05n0220_103:0569c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切智等無所得故，不為自害，不為害他，不為俱害。",
        "translation": "Because they have no knowledge of all things and so forth, they won't harm themselves, won't harm others, and won't harm either.",
        "source": "T05n0220_103:0569c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0569c12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，學此般若波羅蜜多大呪王時，不得一切陀羅尼門，不得一切三摩地門。",
        "translation": "\"Good sons and good women, when they study this great king of prajñāpāramitā spells, they won't be allowed to read all the dhāraṇīs and won't be allowed to read all the samādhis.",
        "source": "T05n0220_103:0569c12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一切陀羅尼門等無所得故，不為自害，不為害他，不為俱害。",
        "translation": "Because they have nothing to gain from these dhāraṇī entries, they won't harm themselves, won't harm others, and won't harm either.",
        "source": "T05n0220_103:0569c14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0569c15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，學此般若波羅蜜多大呪王時，不得預流，不得一來、不還、阿羅漢。",
        "translation": "\"Good sons and good women, when they study this great dhāraṇī of prajñāpāramitā, they can't be pre-flowers, or they can't be once-returners, nonreturners, or arhats.",
        "source": "T05n0220_103:0569c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於預流等無所得故，不為自害，不為害他，不為俱害。",
        "translation": "Because there's nothing to be gained from such preflow, they won't harm themselves, won't harm others, and won't harm either.",
        "source": "T05n0220_103:0569c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0569c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，學此般若波羅蜜多大呪王時，不得預流向預流果，不得一來向一來果、不還向不還果、阿羅漢向阿羅漢果。",
        "translation": "\"Good sons and good women, when they study this great dhāraṇī of prajñāpāramitā, they mustn't go from preflow to preflow, from once-returner to once-returner, from nonreturner to nonreturner, or from arhat to arhat.",
        "source": "T05n0220_103:0569c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於預流向預流果等無所得故，不為自害，不為害他，不為俱害。",
        "translation": "Because there's nothing to be gained from such fruits as going from preflow to preflow, they won't harm themselves, won't harm others, and won't harm either.",
        "source": "T05n0220_103:0569c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0569c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，學此般若波羅蜜多大呪王時，不得獨覺，不得獨覺向獨覺果。",
        "translation": "\"Good sons and good women, when they study this great dhāraṇī of prajñāpāramitā, they won't attain solitary awakening or the fruit of solitary awakening.",
        "source": "T05n0220_103:0569c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於獨覺等無所得故，不為自害，不為害他，不為俱害。",
        "translation": "Because they attain nothing such as pratyekabuddha, they won't harm themselves, won't harm others, and won't harm either.",
        "source": "T05n0220_103:0569c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0569c26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，學此般若波羅蜜多大呪王時，不得菩薩摩訶薩，不得三藐三佛陀。",
        "translation": "\"Good sons and good women, when they study this great king of prajñāpāramitā spells, they won't attain bodhisattvahood or samyak-saṃbuddha.",
        "source": "T05n0220_103:0569c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於菩薩摩訶薩等無所得故，不為自害，不為害他，不為俱害。",
        "translation": "Because bodhisattvas, mahāsattvas, and so forth have nothing to gain, they don't harm themselves, don't harm others, and don't harm either.",
        "source": "T05n0220_103:0569c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0570a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，學此般若波羅蜜多大呪王時，不得菩薩摩訶薩法，不得無上正等菩提。",
        "translation": "\"Good sons and good women, when they study this great dhāraṇī of prajñāpāramitā, they won't attain the bodhisattva-mahāsattva dharma and won't attain unsurpassed correct perfect enlightenment.",
        "source": "T05n0220_103:0570a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於菩薩摩訶薩法等無所得故，不為自害，不為害他，不為俱害。",
        "translation": "Because they have nothing to gain from the bodhisattva-mahāsattva teachings and so forth, they won't harm themselves, won't harm others, and won't harm either.",
        "source": "T05n0220_103:0570a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0570a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，學此般若波羅蜜多大呪王時，不得聲聞乘，不得獨覺乘、無上乘。",
        "translation": "\"Good sons and good women, when they study this great dhāraṇī of prajñāpāramitā, they mustn't obtain the vehicle of the śrāvakas, the vehicle of the solitary realizers, or the peerless vehicle.",
        "source": "T05n0220_103:0570a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於聲聞乘等無所得故，不為自害，不為害他，不為俱害。",
        "translation": "Because they have nothing to gain from the śrāvaka vehicle and so forth, they won't harm themselves, won't harm others, and won't harm either.",
        "source": "T05n0220_103:0570a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0570a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，學此般若波羅蜜多大呪王時，於我及法雖無所得，而證無上正等菩提，觀諸有情心行差別，隨宜為轉無上法輪，令如說行皆獲饒益。",
        "translation": "\"Good sons and good women, when they study this great dhāraṇī of prajñāpāramitā, although they gain nothing from themselves and their teachings, they realize unsurpassed correct perfect enlightenment, observe the differences in the minds and actions of sentient beings, and appropriately turn the unsurpassed wheel of the Dharma for them, so that their practices as described will all be for the benefit of others.",
        "source": "T05n0220_103:0570a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_103:0570a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去菩薩摩訶薩眾，於此般若波羅蜜多大神呪王精勤修學，已證無上正等菩提，轉妙法輪度無量眾。",
        "translation": "In the past, the bodhisattvas, mahāsattvas, and practitioners of this great divine spell king prajñāpāramitā diligently cultivated it, realized unsurpassed perfect enlightenment, and turned the wonderful wheel of the Dharma to tame an incalculable multitude.",
        "source": "T05n0220_103:0570a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來菩薩摩訶薩眾，於此般若波羅蜜多大神呪王精勤修學，當證無上正等菩提，轉妙法輪度無量眾。",
        "translation": "In the future, the bodhisattva-mahāsattvas will diligently cultivate this great supernatural king of prajñāpāramitā spells, realize unsurpassed perfect enlightenment, and turn the wonderful wheel of the Dharma to reach measureless multitudes.",
        "source": "T05n0220_103:0570a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現在十方無邊世界有諸菩薩摩訶薩眾，於此般若波羅蜜多大神呪王精勤修學，現證無上正等菩提，轉妙法輪度無量眾。",
        "translation": "Now, in the limitless worlds of the ten directions, there are a multitude of bodhisattvas, mahāsattvas, and mahāsattvas who diligently cultivate this great supernatural king of prajñāpāramitā, now realize unsurpassed correct perfect enlightenment, and turn the wonderful wheel of the Dharma to reach measureless multitudes.",
        "source": "T05n0220_103:0570a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_103:0570a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等於此般若波羅蜜多，至心聽聞、受持、讀誦、精勤修學、如理思惟、書寫解說、廣令流布，是善男子、善女人等隨所居止國土、城邑、人及非人，不為一切災橫疾疫之所傷害。",
        "translation": "If good men and good women wholeheartedly hear and retain this perfection of wisdom, memorize it, recite it, diligently cultivate it, correctly contemplate it, write and explain it, and disseminate it, good men and good women will be protected from all calamities and epidemics in the lands, cities, people, and non-people in which they live and stay.",
        "source": "T05n0220_103:0570a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_103:0570a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等隨所住處，為此三千大千世界及餘十方無量無數無邊世界所有四大王眾天、三十三天、夜摩天、覩史多天、樂變化天、他化自在天、梵眾天、梵輔天、梵會天、大梵天、光天、少光天、無量光天、極光淨天、淨天、少淨天、無量淨天、遍淨天、廣天、少廣天、無量廣天、廣果天、無繁天、無熱天、善現天、善見天、色究竟天并諸龍神、阿素洛等常來守護，恭敬供養、尊重讚歎，不令般若波羅蜜多大神呪王有留難故。",
        "translation": "是善男子、善女人等隨所住處，為此三千大千世界及餘十方無量無數無邊世界所有四大王眾天、三十三天、夜摩天、覩史多天、樂變化天、他化自在天、梵眾天、梵輔天、梵會天、大梵天、光天、少光天、無量光天、極光淨天、淨天、少淨天、無量淨天、遍淨天、廣天、少廣天、無量廣天、廣果天、無繁天、無熱天、善現天、善見天、色究竟天并諸龍神、阿素洛等常來守護，恭敬供養、尊重讚歎，不令般若波羅蜜多大神呪王有留難故。",
        "source": "T05n0220_103:0570a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_103:0570b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等書此般若波羅蜜多大神呪王置清淨處，恭敬供養、尊重讚歎，雖不聽聞、受持、讀誦、精勤修學、如理思惟，亦不為他開示分別，而此住處國邑、王都、人非人等，不為一切災橫疾疫之所傷害。",
        "translation": "\"If good sons and good women write this Prajñāpāramitā great spell king and place it in a pure place, respectfully offer it up, honor and praise it, although they don't hear it, retain it, recite it, diligently cultivate it, correctly contemplate it, or discern it for others, then the country, the king's capital, or humans and non-humans in that place won't be harmed by any calamity or epidemic.",
        "source": "T05n0220_103:0570b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_103:0570b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是般若波羅蜜多大神呪王隨所住處，為此三千大千世界及餘十方無量無數無邊世界所有四大王眾天乃至色究竟天并諸龍神、阿素洛等常來守護，恭敬供養、尊重讚歎，不令般若波羅蜜多大神呪王有留難故。",
        "translation": "Thus, the Mahāprajñāpāramitā Dhāraṇī King follows this place of abiding, allowing the four great kings of gods and goddesses of the form realm and the gods of the bottom of the form realm, dragons, gods, and asuras to constantly come to guard, respect, offer support, honor, and praise him, so that the Mahāprajñāpāramitā Dhāraṇī King won't have any trouble staying here.",
        "source": "T05n0220_103:0570b11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0570b16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等但書般若波羅蜜多大神呪王置清淨處，恭敬供養、尊重讚歎，尚獲如是現法利益，況能聽聞、受持、讀誦、精勤修學、如理思惟，及廣為他開示分別！",
        "translation": "If these good men and good women simply write this great incantation king Prajñāpāramitā and place it in a pure place, venerate it, make offerings to it, and praise it with respect, they will still receive the benefits of this present teaching, so why wouldn't they listen, retain, recite, diligently cultivate, correctly contemplate, and extensively explain and discern it for others?",
        "source": "T05n0220_103:0570b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知是輩功德無邊，速證菩提利樂一切。",
        "translation": "You should know that these people's merits are limitless, and they will quickly realize enlightenment for the benefit of all.",
        "source": "T05n0220_103:0570b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_103:0570b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等怖畏怨家、惡獸、災橫、厭禱、疾疫、毒藥、呪等，應書般若波羅蜜多大神呪王，隨多少分香囊盛貯，置寶筩中恒隨逐身恭敬供養，諸怖畏事皆自消除，天龍、鬼神常守衛故。",
        "translation": "If good sons and good women fear enemies, harmful animals, calamity, disillusionment, epidemics, poison, spells, and so forth, they should write a copy of the great mantra king Prajñāpāramitā, store it in a scented bag with as many parts as necessary, place it in a jeweled gourd, and offer it up to their body at all times, respecting and venerating it, so that all their fears will be removed and the gods, dragons, and spirits will always guard it.",
        "source": "T05n0220_103:0570b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0570b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人或傍生類入菩提樹院，或至彼院邊，人非人等不能傷害。",
        "translation": "\"It's like a person or group of other living beings who enters a bodhi tree courtyard or goes to its edge, but humans and non-humans alike can't harm them.",
        "source": "T05n0220_103:0570b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_103:0570b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去未來現在諸佛皆坐此處證得無上正等菩提，得菩提已施諸有情無恐無怖身心安樂，安立無量無數有情，令住人天尊貴妙行；安立無量無數有情，令住三乘安樂妙行；安立無量無數有情，令現證得或預流果、或一來果、或不還果、或阿羅漢果；安立無量無數有情，令當證得獨覺菩提或證無上正等菩提。",
        "translation": "All the buddhas of the past, future, and present sit here and realize unsurpassed correct enlightenment, and after attaining enlightenment, they give sentient beings fearlessness and fearlessness and physical and mental well-being, establish measureless and countless sentient beings to abide in the noble and marvelous practice of humans and gods, establish measureless and countless sentient beings to abide in the comfortable and marvelous practice of the three vehicles, establish measureless and countless sentient beings to realize either the fruit of pre-flow, the fruit of the first coming, the fruit of no-return, or the fruit of the arhat in the present, and establish measureless and countless sentient beings who will realize the enlightenment of the pratyekabuddhas or realize unsurpassed correct enlightenment.",
        "source": "T05n0220_103:0570b28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是勝事皆由般若波羅蜜多威神之力，是故此處一切天、龍、阿素洛等皆同守護，供養恭敬、尊重讚歎。",
        "translation": "Such remarkable things are all due to the authoritative power of the perfection of wisdom, so all the gods, dragons, asuras, and so forth in this place are all on guard together, offering their support, respect, and admiration.",
        "source": "T05n0220_103:0570c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知般若波羅蜜多隨所住處亦復如是，一切天、龍、阿素洛等常來守護，供養恭敬、尊重讚歎，不令般若波羅蜜多有留難故。",
        "translation": "You should know that this is likewise the place where the Perfection of Wisdom lives, where all the gods, dragons, asuras, and so forth always come to guard, offer support, venerate, and praise the Perfection of Wisdom, so that the Perfection of Wisdom doesn't have trouble staying.",
        "source": "T05n0220_103:0570c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知是處即真制多，一切有情皆應敬禮，當以種種上妙花鬘、塗散等香、衣服、纓絡、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明而為供養。」",
        "translation": "You should know that this place is truly the abode of the perfection of discipline, and all sentient beings should venerate it and make offerings with various kinds of superb flower garlands, scattering incense, clothing, tapestry, jeweled banners, banners, numerous marvels, treasures, music, and lamps.\"",
        "source": "T05n0220_103:0570c11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初分校量功德品第三十之一",
        "translation": "Chapter 30-1 of the First Chapter on the Merit of Measurements",
        "source": "T05n0220_103:0570c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，天帝釋白佛言：「世尊！",
        "translation": "It was then that Śakra Devānām-Indra said to the Buddha, \"Bhagavān!",
        "source": "T05n0220_103:0570c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等書此般若波羅蜜多甚深經典，種種莊嚴供養恭敬、尊重讚歎，復以種種上妙花鬘、塗散等香、衣服、纓絡、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明而為供養。",
        "translation": "Suppose good sons and good women write this profound scripture of the perfection of wisdom, adorn it in various ways, offer it up in respect and admiration, and make offerings with various kinds of fine flower garlands, scattered incense, clothing, tapestry, banners, streamers, and numerous wonderful, precious, musical, and lighting items.",
        "source": "T05n0220_103:0570c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或善男子、善女人等佛涅槃後，起窣堵波七寶嚴飾，寶函盛貯佛設利羅，安置其中，供養恭敬、尊重讚歎，復以種種上妙花鬘、塗散等香、衣服、纓絡、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明而為供養。",
        "translation": "Perhaps good sons and good women erect a stūpa adorned with seven treasures after the Buddha's nirvāṇa, store a treasure box full of the Buddha's śarīra, place it there, make offerings, honor, respect, and praise it, and then make offerings with various kinds of the finest flowers, scattered incense, clothing, tapestry, a banner, banners, flags, and shrouds, as well as many wonderful, rare, musical, and lighting items.",
        "source": "T05n0220_103:0570c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是二福聚，何者為多？」",
        "translation": "Which of these two categories of merit is substantial?\"",
        "source": "T05n0220_103:0570c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「憍尸迦！",
        "translation": "The Buddha said, \"Kauśika!",
        "source": "T05n0220_103:0570c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我還問汝，當隨意答。",
        "translation": "\"I'll ask you again, and you'll answer as you like.",
        "source": "T05n0220_103:0570c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T05n0220_103:0570c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來所得一切智智及相好身，於何等法修學而得？」",
        "translation": "What kinds of things does the Tathāgata attain by cultivating the omniscience and the body of finery?\"",
        "source": "T05n0220_103:0570c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天帝釋言：「世尊！",
        "translation": "The emperor explained, \"Bhagavān!",
        "source": "T05n0220_103:0570c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來所得一切智智及相好身，於此般若波羅蜜多修學而得。」",
        "translation": "The Tathāgata attains omniscience and the body of fineness of features by cultivating this prajñāpāramitā.\"",
        "source": "T05n0220_103:0570c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告憍尸迦：「如是！",
        "translation": "The Buddha told Kauśika, \"So it is!",
        "source": "T05n0220_103:0570c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T05n0220_103:0570c29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "\"As you said.",
        "source": "T05n0220_103:0570c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於般若波羅蜜多修學故，得一切智智及相好身。",
        "translation": "'Because I've cultivated the perfection of wisdom, I've attained the knowledge of all cognitions and the body of beautiful features.'",
        "source": "T05n0220_103:0570c29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_103:0571a02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_103:0571a02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不學般若波羅蜜多證得無上正等菩提，無有是處故。",
        "translation": "Unless someone trains in the perfection of wisdom and realizes unsurpassed perfect enlightenment, there's no place for them.",
        "source": "T05n0220_103:0571a02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_103:0571a03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不以獲得相好身故說名如來、應、正等覺，但以證得一切智智說名如來、應、正等覺。",
        "translation": "They don't call it the Tathāgata, Arhat, and Completely Enlightened One because they've attained the body of characteristics, but they call it the Tathāgata, Arhat, and Completely Enlightened One because they've realized the knowledge of all knowables.",
        "source": "T05n0220_103:0571a03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_103:0571a05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來所得一切智智，甚深般若波羅蜜多為因故起，佛相好身但為依處，若不依止佛相好身，一切智智無由而轉。",
        "translation": "The tathāgata's attained omniscience arises because of the profound prajñāpāramitā, and the Buddha's comportment body is just a support; if it doesn't rely on the Buddha's comportment body, there's no way omniscience can develop.",
        "source": "T05n0220_103:0571a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故般若波羅蜜多正為因生一切智智，為令此智現前相續故，復修集佛相好身。",
        "translation": "Therefore, prajñā-pāramitā is precisely the cause for the arising of omniscience cognition, and in order to cause this cognition to manifest itself continuously, it further cultivates the Buddha's characteristic body.",
        "source": "T05n0220_103:0571a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此相好身若非遍智所依處者，一切天、龍、阿素洛等不應竭誠供養恭敬、尊重讚歎，以相好身與佛遍智為所依止故，諸天、龍、阿素洛等恭敬供養。",
        "translation": "If this characteristic body wasn't the basis of omniscience, all gods, dragons, asuras, and so forth wouldn't make every effort to offer their respects and veneration, honoring and praising it, because the characteristic body and the Buddha's omniscience are the bases for their respect and offerings from gods, dragons, asuras, and so forth.",
        "source": "T05n0220_103:0571a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此緣故，我涅槃後，諸天、龍神、人非人等恭敬供養我設利羅。",
        "translation": "For this reason, after I die, gods, dragons, humans, and nonhumans will respect and make offerings to me, Śāriputra.",
        "source": "T05n0220_103:0571a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等但於般若波羅蜜多供養恭敬、尊重讚歎，是善男子、善女人等則為供養一切智智，及所依止佛相好身，并涅槃後佛設利羅。",
        "translation": "\"If good men and good women simply make many offerings to Prajñāparamit, respect, and praise it, then these good men and good women are making offerings to omniscience, the Buddha's beautiful body that they rely on, and the Buddha's śarīra after nirvāṇa.",
        "source": "T05n0220_103:0571a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_103:0571a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_103:0571a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智智及相好身并設利羅，皆以般若波羅蜜多為根本故。",
        "translation": "\"Omniscient knowledge, the body with its beautiful features, and the śarīra all have prajñāpāramitā as their root.",
        "source": "T05n0220_103:0571a19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_103:0571a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等但於佛身及設利羅供養恭敬、尊重讚歎，是善男子、善女人等非為供養一切智智及此般若波羅蜜多。",
        "translation": "\"If good men and good women simply make offerings to and respect the Buddha's body and śarīra, honoring and praising them, these good men and good women aren't making offerings to omniscience and this prajñāparamitra.",
        "source": "T05n0220_103:0571a20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_103:0571a23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_103:0571a23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛身遺體非此般若波羅蜜多一切智智之根本故。",
        "translation": "\"The remains of the Buddha's body are not the root of this prajñāpāramitā of omniscience and knowledge.",
        "source": "T05n0220_103:0571a23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_103:0571a25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此緣故，諸善男子、善女人等欲供養佛，若心若身，先當聽聞、受持、讀誦、精勤修學、如理思惟、書寫、解說甚深般若波羅蜜多，復以種種上妙花鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明而為供養。",
        "translation": "It's for this reason that good men and good women who want to make offerings to the Buddha, whether in mind or body, should first hear, retain, recite, diligently cultivate, correctly contemplate, write, and explain the profound perfections of prajñāpāramitā, and then make offerings with various kinds of superb flower garlands, scattering incense, clothing, jewelry, banners, banners, and numerous wonderful, precious things, music, and lamps.",
        "source": "T05n0220_103:0571a25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「以是故，憍尸迦！",
        "translation": "\"Therefore, Kauśika!",
        "source": "T05n0220_103:0571b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等書此般若波羅蜜多甚深經典，種種莊嚴供養恭敬、尊重讚歎，復以種種上妙花鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明而為供養。",
        "translation": "Suppose good sons and good women write this profound scripture of the perfection of wisdom, adorn it in various ways, offer it up in respect and admiration, and venerate and praise it, and then make offerings with various kinds of fine flower garlands, scattered incense, clothing, jewelry, banners, banners, and numerous wonderful, precious things, music, and lamps.",
        "source": "T05n0220_103:0571b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或善男子、善女人等佛涅槃後，起窣堵波七寶嚴飾，寶函盛貯佛設利羅安置其中，供養恭敬、尊重讚歎，復以種種上妙花鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明而為供養。",
        "translation": "Perhaps good sons and good women erect a stūpa adorned with seven treasures after the Buddha's nirvāṇa, store a treasure box full of the Buddha's śarīra, place it there, make offerings, honor, respect, and praise it, and then make offerings with a variety of the finest flowers, scattered incense, clothing, jewelry, banners, flags, and shrouds, as well as with many wonderful, rare, musical, and lighting items.",
        "source": "T05n0220_103:0571b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是二福聚，前者為多。",
        "translation": "Of these two kinds of merit, the former is greater.",
        "source": "T05n0220_103:0571b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_103:0571b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "Generosity, pure precepts, patience, effort, meditation, and the perfection of wisdom all arise from such profound perfections of wisdom.",
        "source": "T05n0220_103:0571b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，皆從如是甚深般若波羅蜜多而出現故。",
        "translation": "Inner emptiness, outer emptiness, inner and outer emptiness, emptiness, great emptiness, ultimate emptiness, endless emptiness, dispersed emptiness, unchanging emptiness, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all things, inaccessible emptiness, natureless emptiness, self-nature emptiness, and emptiness of natureless self-nature all emerge from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0571b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，皆從如是甚深般若波羅蜜多而出現故。",
        "translation": "True nature, the Dharma realm, the Dharma nature, non-falsity, unchanging diversity, equality, freedom from birth, legal status, Dharma abiding, reality, the space realm, and the inconceivable realm all emerge from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0571b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦聖諦、集聖諦、滅聖諦、道聖諦，皆從如是甚深般若波羅蜜多而出現故。",
        "translation": "The noble truths of suffering, arising, cessation, and the path all arise from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0571b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮、四無量、四無色定，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "The four meditations, the four immeasurable, and the four formless concentrations all arise from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0571b21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571b23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫、八勝處、九次第定、十遍處，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "The eight liberations, eight abodes of excellence, nine graduated concentrations, and ten universal abodes all arise from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0571b23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571b25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "The four abodes of mindfulness, four correct eliminations, four miraculous powers, five faculties, five powers, seven factors of virtual enlightenment, and eight noble factors of the path all arise from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0571b25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571b27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空解脫門、無相解脫門、無願解脫門，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "The gate of liberation through emptiness, the gate of liberation through signlessness, and the gate of liberation through wishlessness all arise from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0571b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眼、六神通，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "The five eyes and six supernormal powers are born from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0571b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛十力、四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "The Buddha's ten powers, four forms of fearlessness, four kinds of unhindered understanding, great kindness, great compassion, great joy, great equanimity, and 18 uncommon dharmas of the Buddha all arise from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0571c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無忘失法、恒住捨性，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "The qualities of no forgetfulness and constant equanimity all arise from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0571c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智、道相智、一切相智，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "It's because omniscience, knowledge of the path, and knowledge of all characteristics all arise from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0571c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切陀羅尼門、一切三摩地門，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "All dhāraṇī teachings and all samādhi teachings are born from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0571c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571c09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所有成熟有情、嚴淨佛土，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "All the things that the bodhisattvas, mahāsattvas do to ripen sentient beings and adorn and purify the Buddha-lands arise from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0571c10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571c11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩所有族姓圓滿、色力圓滿、財寶圓滿、眷屬圓滿，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "The bodhisattva Mahāsattva's clans are perfectly complete, his form is perfectly powerful, his possessions are perfectly complete, and his retinue is perfectly complete, all of which arise from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0571c12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571c14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間所有十善業道，供養沙門、父母、師長，施、戒、修等無量善法，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "All of the world's ten good activities, support for ascetics, parents, teachers, and countless other good qualities like generosity, discipline, and cultivation all arise from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0571c14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間所有剎帝利大族、婆羅門大族、長者大族、居士大族，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "All the great families of kṣatriyas, great families of brāhmaṇas, great families of elders, and great families of householders in the world are born from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0571c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間所有四大王眾天、三十三天、夜摩天、覩史多天、樂變化天、他化自在天，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "All of the four great king gods, the Trāyastriṃśa gods, the Yama gods, the Tuṣita gods, the happily transformed gods, and the paranirmita-vaśavartin gods of the world are born from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0571c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間所有梵眾天、梵輔天、梵會天、大梵天、光天、少光天、無量光天、極光淨天、淨天、少淨天、無量淨天、遍淨天、廣天、少廣天、無量廣天、廣果天、無繁天、無熱天、善現天、善見天、色究竟天，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "\"All the brahma heavens, brahma-helping heavens, brahma-assembly heavens, brahma heavens, gods of light, gods of little light, gods of measureless light, gods of ultimate purity, gods of purity, gods of little purity, gods of measureless purity, gods of vast breadth, gods of little breadth, gods of measureless breadth, gods of vast fruition, gods of no complexity, gods of no heat, gods of good appearance, gods of good views, and gods of the ultimate in form all derive their birth from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0571c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0571c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間所有空無邊處天、識無邊處天、無所有處天、非想非非想處天，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "\"All the worldly gods of the infinity of emptiness, the infinity of consciousness, the infinity of nothing, and the abode of neither perception nor non-perception are born from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0571c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0572a01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切預流預流果、一來一來果、不還不還果、阿羅漢阿羅漢果，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "All the fruits of pre-flow and pre-flow, the fruits of once-returning and once-returning, and the fruits of arhatship and arhatship all arise from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0572a01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0572a03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切獨覺獨覺菩提，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "It's because all pratyekbuddhas and pratyekabuddhas derive their enlightenment from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0572a04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0572a05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切菩薩摩訶薩、菩薩摩訶薩法，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "All bodhisattvas, mahāsattvas, and bodhisattva teachings are born from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0572a05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0572a07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切如來、應、正等覺，皆從如是甚深般若波羅蜜多而出生故。",
        "translation": "All tathāgatas, arhats, and right ascendants are born from such profound prajñāpāramitā.",
        "source": "T05n0220_103:0572a07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0572a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不可思量、不可宣說、無上、無上上、無等、無等等一切智智，皆從如是甚深般若波羅蜜多而出生故。」",
        "translation": "Incomprehensible, inexpressible, unsurpassed, unsurpassed, peerless, and peerless omniscience all derive from such profound prajñāpāramitā.\"",
        "source": "T05n0220_103:0572a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，天帝釋白佛言：「世尊！",
        "translation": "It was then that Śakra Devānām-Indra said to the Buddha, \"Bhagavān!",
        "source": "T05n0220_103:0572a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贍部洲人於甚深般若波羅蜜多不供養恭敬、尊重讚歎者，彼豈不知供養恭敬、尊重讚歎甚深般若波羅蜜多，獲得如是大功德利？」",
        "translation": "If someone from Jambudvīpa doesn't offer support, honor, and praise the profound perfection of wisdom, wouldn't they know that such great merit is gained by offering support, honoring, and praising the profound perfection of wisdom?\"",
        "source": "T05n0220_103:0572a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「憍尸迦！",
        "translation": "The Buddha said, \"Kauśika!",
        "source": "T05n0220_103:0572a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今問汝，隨汝意答。",
        "translation": "Now, I'll ask you, and you can answer as you like.",
        "source": "T05n0220_103:0572a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T05n0220_103:0572a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贍部洲內有幾所人成就佛證淨、成就法證淨、成就僧證淨？",
        "translation": "How many people in Jambudvīpa have realized the purification of buddhas, realized the purification of dharmas, and realized the purification of monks?",
        "source": "T05n0220_103:0572a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有幾所人於佛無疑、於法無疑、於僧無疑？",
        "translation": "How many people have no doubts about the Buddha, no doubts about the Dharma, and no doubts about the saṃgha?",
        "source": "T05n0220_103:0572a17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有幾所人於佛究竟、於法究竟、於僧究竟？」",
        "translation": "How many people are there who have fully attained the Buddha's, the Dharma's, and the saṃgha's level?\"",
        "source": "T05n0220_103:0572a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天帝釋言：「世尊！",
        "translation": "The emperor explained, \"Bhagavān!",
        "source": "T05n0220_103:0572a19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贍部洲內有少分人成就佛證淨、成就法證淨、成就僧證淨，有少分人於佛無疑、於法無疑、於僧無疑，有少分人於佛究竟、於法究竟、於僧究竟。」",
        "translation": "On Jambudvīpa, there are a few people who have realized the purity of the Buddha, realized the purity of the Dharma, and realized the purity of the saṃgha, a few people who have no doubts about the Buddha, no doubts about the Dharma, and no doubts about the saṃgha, and a few people who have perfected the Buddha, perfected the Dharma, and perfected the saṃgha.\"",
        "source": "T05n0220_103:0572a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「憍尸迦！",
        "translation": "The Buddha said, \"Kauśika!",
        "source": "T05n0220_103:0572a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我復問汝，隨汝意答。",
        "translation": "\"Again, I'll ask you, and I'll answer as you like.",
        "source": "T05n0220_103:0572a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_103:0572a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T05n0220_103:0572a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贍部洲內有幾所人得三十七菩提分法？",
        "translation": "How many people in Jambudvīpa have attained the thirty-seven factors of enlightenment?",
        "source": "T05n0220_103:0572a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有幾所人得三解脫門？",
        "translation": "How many people have attained the three gates of liberation?",
        "source": "T05n0220_103:0572a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有幾所人得八解脫？",
        "translation": "How many people have attained the eight kinds of liberation?",
        "source": "T05n0220_103:0572a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有幾所人得九次第定？",
        "translation": "How many people have attained the nine graduated concentrations?",
        "source": "T05n0220_103:0572a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有幾所人得四無礙解？",
        "translation": "How many people have attained the four kinds of unhindered understanding?",
        "source": "T05n0220_103:0572a27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有幾所人得六神通？",
        "translation": "How many people have attained the six supernormal powers?",
        "source": "T05n0220_103:0572a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有幾所人永斷三結得預流果？",
        "translation": "How many people have permanently cut the three bonds and attained the fruit of stream-winner?",
        "source": "T05n0220_103:0572a28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有幾所人薄貪、瞋、癡得一來果？",
        "translation": "How many people who have lost their greed, anger, and delusion have attained the fruit of the once-returner?",
        "source": "T05n0220_103:0572a28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有幾所人斷五順下分結得不還果？",
        "translation": "How many people have cut off the five lower bonds of conformity and attained the fruit of nonreturners?",
        "source": "T05n0220_103:0572a29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有幾所人斷五順上分結得阿羅漢果？",
        "translation": "How many people have cut the five higher bonds of conformity and attained the fruit of the arhat?",
        "source": "T05n0220_103:0572b01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有幾所人發心定趣獨覺菩提？",
        "translation": "How many people have the intention to set out for the enlightenment of the pratyekabuddhas?",
        "source": "T05n0220_103:0572b02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有幾所人發心定趣阿耨多羅三藐三菩提？」",
        "translation": "How many people have the intention to proceed to unsurpassed, correct enlightenment?\"",
        "source": "T05n0220_103:0572b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天帝釋言：「世尊！",
        "translation": "The emperor explained, \"Bhagavān!",
        "source": "T05n0220_103:0572b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贍部洲內有少分人得三十七菩提分法，有少分人得三解脫門，有少分人得八解脫，有少分人得九次第定，有少分人得四無礙解，有少分人得六神通，有少分人永斷三結得預流果，有少分人薄貪、瞋、癡得一來果，有少分人斷五順下分結得不還果，有少分人斷五順上分結得阿羅漢果，有少分人發心定趣獨覺菩提，有少分人發心定趣阿耨多羅三藐三菩提。」",
        "translation": "There are a few people in Jambudvīpa who attain the thirty-seven factors of enlightenment, a few people who attain the gate of the three liberations, a few people who attain the eight liberations, a few people who attain the nine sequential concentrations, a few people who attain the four unhindered liberations, a few people who attain the six supernormal powers, a few people who permanently cut the three bonds and attain the fruit of stream-winner, a few people who thin greed, anger, and delusion and attain the fruit of once-returner, a few people who cut the five lower bonds and attain the fruit of nonreturner, a few people who cut the five upper bonds and attain the fruit of arhat, a few people whose minds are set on the enlightenment of pratyekabuddha, and a few people whose minds are set on the enlightenment of unsurpassed, correct, and complete enlightenment.\"",
        "source": "T05n0220_103:0572b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, \"So it is!",
        "source": "T05n0220_103:0572b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T05n0220_103:0572b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "Just as you said.",
        "source": "T05n0220_103:0572b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_103:0572b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贍部洲內極少分人成就佛證淨、成就法證淨、成就僧證淨，轉少分人於佛無疑、於法無疑、於僧無疑，轉少分人於佛究竟、於法究竟、於僧究竟，轉少分人得三十七菩提分法，轉少分人得三解脫門，轉少分人得八解脫，轉少分人得九次第定，轉少分人得四無礙解，轉少分人得六神通。",
        "translation": "A very few people on Jambudvīpa achieve the realization of the Buddha, the realization of the Dharma, and the realization of the saṃgha, a very few people become free of doubt about the Buddha, free of doubt about the Dharma, and free of doubt about the saṃgha, a very few people become the ultimate Buddha, the ultimate Dharma, and the ultimate saṃgha, a very few people attain the thirty-seven factors of enlightenment, a very few people attain the three gates of liberation, a very few people attain the eight liberations, a very few people attain the nine graduated concentrations, a very few people attain the four unhindered understandings, and a very few people attain the six supernormal powers.",
        "source": "T05n0220_103:0572b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_103:0572b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贍部洲內極少分人永斷三結得預流果，轉少分人薄貪、瞋、癡得一來果，轉少分人斷五順下分結得不還果，轉少分人斷五順上分結得阿羅漢果，轉少分人發心定趣獨覺菩提，轉少分人發心定趣阿耨多羅三藐三菩提，轉少分人既發心已精勤修習趣菩提行。",
        "translation": "Very few people on the Jambudvīpa continent permanently cut the three bonds and attain the fruit of stream-winner, very few people change their minds to thin greed, anger, and delusion and attain the fruit of once-returner, very few people change their minds to cut the five lower bonds and attain the fruit of nonreturner, very few people change their minds to cut the five upper bonds and attain the fruit of arhat, very few people change their minds to concentrate their thoughts and head for solitary realizer bodhi, very few people change their minds to concentrate their thoughts and head for unsurpassed, corrected, and dignified bodhi, and very few people change their minds to diligently cultivate the practice of bodhi.",
        "source": "T05n0220_103:0572b20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_103:0572b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0572b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有情類流轉生死，無量世來多不見佛，不聞正法，不親近僧；不行布施，不護淨戒，不修安忍，不起精進，不習靜慮，不學般若；不聞布施波羅蜜多，不修布施波羅蜜多，不聞淨戒波羅蜜多，不修淨戒波羅蜜多，不聞安忍波羅蜜多，不修安忍波羅蜜多，不聞精進波羅蜜多，不修精進波羅蜜多，不聞靜慮波羅蜜多，不修靜慮波羅蜜多，不聞般若波羅蜜多，不修般若波羅蜜多；不聞內空，不修內空，不聞外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，不修外空乃至無性自性空；不聞真如，不修真如，不聞法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，不修法界乃至不思議界；不聞苦聖諦，不修苦聖諦，不聞集、滅、道聖諦，不修集、滅、道聖諦；不聞四靜慮，不修四靜慮，不聞四無量、四無色定，不修四無量、四無色定；不聞八解脫，不修八解脫，不聞八勝處、九次第定、十遍處，不修八勝處、九次第定、十遍處；不聞四念住，不修四念住，不聞四正斷、四神足、五根、五力、七等覺支、八聖道支，不修四正斷乃至八聖道支；不聞空解脫門，不修空解脫門，不聞無相、無願解脫門，不修無相、無願解脫門；不聞五眼，不修五眼，不聞六神通，不修六神通；不聞佛十力，不修佛十力，不聞四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法，不修四無所畏乃至十八佛不共法；不聞無忘失法，不修無忘失法，不聞恒住捨性，不修恒住捨性；不聞一切陀羅尼門，不修一切陀羅尼門，不聞一切三摩地門，不修一切三摩地門；不聞一切智，不修一切智，不聞道相智、一切相智，不修道相智、一切相智。",
        "translation": "諸有情類流轉生死，無量世來多不見佛，不聞正法，不親近僧；不行布施，不護淨戒，不修安忍，不起精進，不習靜慮，不學般若；不聞布施波羅蜜多，不修布施波羅蜜多，不聞淨戒波羅蜜多，不修淨戒波羅蜜多，不聞安忍波羅蜜多，不修安忍波羅蜜多，不聞精進波羅蜜多，不修精進波羅蜜多，不聞靜慮波羅蜜多，不修靜慮波羅蜜多，不聞般若波羅蜜多，不修般若波羅蜜多；不聞內空，不修內空，不聞外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，不修外空乃至無性自性空；不聞真如，不修真如，不聞法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，不修法界乃至不思議界；不聞苦聖諦，不修苦聖諦，不聞集、滅、道聖諦，不修集、滅、道聖諦；不聞四靜慮，不修四靜慮，不聞四無量、四無色定，不修四無量、四無色定；不聞八解脫，不修八解脫，不聞八勝處、九次第定、十遍處，不修八勝處、九次第定、十遍處；不聞四念住，不修四念住，不聞四正斷、四神足、五根、五力、七等覺支、八聖道支，不修四正斷乃至八聖道支；不聞空解脫門，不修空解脫門，不聞無相、無願解脫門，不修無相、無願解脫門；不聞五眼，不修五眼，不聞六神通，不修六神通；不聞佛十力，不修佛十力，不聞四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法，不修四無所畏乃至十八佛不共法；不聞無忘失法，不修無忘失法，不聞恒住捨性，不修恒住捨性；不聞一切陀羅尼門，不修一切陀羅尼門，不聞一切三摩地門，不修一切三摩地門；不聞一切智，不修一切智，不聞道相智、一切相智，不修道相智、一切相智。",
        "source": "T05n0220_103:0572b26_11",
        "is_bad_quality": true
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0573a03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是緣故，當知於此贍部洲內極少分人成就佛證淨、成就法證淨、成就僧證淨，轉少分人於佛無疑、於法無疑、於僧無疑，轉少分人於佛究竟、於法究竟、於僧究竟，轉少分人得三十七菩提分法，轉少分人得三解脫門，轉少分人得八解脫，轉少分人得九次第定，轉少分人得四無礙解，轉少分人得六神通。",
        "translation": "For these reasons, it should be known that a very small percentage of people on this Jambudvīpa continent achieve the realization of the purity of the Buddha, the realization of the Dharma, and the realization of the saṃgha, a small percentage of people change to have no doubt about the Buddha, no doubt about the Dharma, and no doubt about the saṃgha, a small percentage of people change to completely end the Buddha, completely end the Dharma, and completely end the saṃgha, a small percentage of people change to attain the thirty-seven factors of enlightenment, a small percentage of people change to attain the three gates of liberation, a small percentage of people change to attain the eight liberations, a small percentage of people change to attain the nine graduated concentrations, a small percentage of people change to attain the four unhindered understandings, and a small percentage of people change to attain the six supernormal powers.",
        "source": "T05n0220_103:0573a03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_103:0573a10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知於此贍部洲中極少分人永斷三結得預流果，轉少分人薄貪、瞋、癡得一來果，轉少分人斷五順下分結得不還果，轉少分人斷五順上分結得阿羅漢果，轉少分人發心定趣獨覺菩提，轉少分人發心定趣阿耨多羅三藐三菩提，轉少分人既發心已精勤修習趣菩提行。」",
        "translation": "You should know that here on the Jambudvīpa continent, a very small percentage of people permanently cut the three bonds and attain the fruit of stream-winner, a transient minority of people thin out greed, anger, and delusion and attain the fruit of once-returner, a transient minority of people cut the five lower bonds and attain the fruit of nonreturner, a transient minority of people cut the five upper bonds and attain the fruit of arhat, a transient minority of people develop their minds and are headed for the enlightenment of the solitary realizer, a transient minority of people develop their minds and are headed for the enlightenment of the unsurpassed three contemplatives, and a transient minority of people who have developed their minds diligently cultivate them and head for the practice of enlightenment.\"",
        "source": "T05n0220_103:0573a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛語天帝釋言：「我今問汝，隨汝意答。",
        "translation": "It was then that the Buddha said to Śakra Devānām-Indra, \"Now, I'm going to ask you this question, and I'll answer it as you wish.",
        "source": "T05n0220_103:0573a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_103:0573a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T05n0220_103:0573a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "置贍部洲所有人類。",
        "translation": "\"Suppose he were to tell all the people on that continent.",
        "source": "T05n0220_103:0573a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此三千大千世界，幾所眾生供養恭敬父母、師長？",
        "translation": "In this world of 3,000 great one-thousand worlds, how many sentient beings support and honor their parents and teachers?",
        "source": "T05n0220_103:0573a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生供養恭敬沙門、婆羅門？",
        "translation": "How many sentient beings make offerings to and revere ascetics and priests?",
        "source": "T05n0220_103:0573a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生行施、受齋、持戒？",
        "translation": "How many sentient beings practice generosity, receive purification, and observe precepts?",
        "source": "T05n0220_103:0573a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生修十善業道？",
        "translation": "How many sentient beings cultivate the tenfold path of good actions?",
        "source": "T05n0220_103:0573a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生於諸欲中住厭患想、無常想、苦想、無我想、不淨想、厭食想、一切世間不可樂想？",
        "translation": "How many sentient beings abide in the perceptions of disillusionment, impermanence, suffering, selflessness, impurity, food aversion, and the unpleasantness of all the world in their desires?",
        "source": "T05n0220_103:0573a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生修四靜慮？",
        "translation": "How many sentient beings cultivate the four meditations?",
        "source": "T05n0220_103:0573a25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生修四無量？",
        "translation": "How many sentient beings cultivate the four immeasurables?",
        "source": "T05n0220_103:0573a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生修四無色定？",
        "translation": "How many sentient beings cultivate the four formless concentrations?",
        "source": "T05n0220_103:0573a26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生信佛、信法、信僧？",
        "translation": "How many sentient beings believe in the Buddha, the Dharma, and the saṃgha?",
        "source": "T05n0220_103:0573a26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生於佛無疑、於法無疑、於僧無疑？",
        "translation": "How many sentient beings have no doubts about the Buddha, no doubts about the Dharma, and no doubts about the saṃgha?",
        "source": "T05n0220_103:0573a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生於佛究竟、於法究竟、於僧究竟？",
        "translation": "How many sentient beings will attain the ultimate Buddha, the ultimate Dharma, and the ultimate saṃgha?",
        "source": "T05n0220_103:0573a28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生修三十七菩提分法？",
        "translation": "How many sentient beings cultivate the thirty-seven factors of enlightenment?",
        "source": "T05n0220_103:0573a29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生修三解脫門？",
        "translation": "How many sentient beings cultivate the three gates of liberation?",
        "source": "T05n0220_103:0573a29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生修八解脫？",
        "translation": "How many sentient beings cultivate the eight kinds of liberation?",
        "source": "T05n0220_103:0573b01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生修九次第定？",
        "translation": "How many sentient beings cultivate the nine graduated concentrations?",
        "source": "T05n0220_103:0573b01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生修四無礙解？",
        "translation": "How many sentient beings cultivate the four kinds of unhindered understanding?",
        "source": "T05n0220_103:0573b02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生修六神通？",
        "translation": "How many sentient beings cultivate the six supernormal powers?",
        "source": "T05n0220_103:0573b02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生永斷三結得預流果？",
        "translation": "How many sentient beings permanently sever the three bonds and attain the fruit of stream-winner?",
        "source": "T05n0220_103:0573b03_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生薄貪、瞋、癡得一來果？",
        "translation": "How many sentient beings who are weak in greed, anger, and delusion will attain the fruit of the once-returner?",
        "source": "T05n0220_103:0573b04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生斷五順下分結得不還果？",
        "translation": "How many sentient beings have ended the five lower bonds of conformity and attained the fruit of nonreturn?",
        "source": "T05n0220_103:0573b04_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生斷五順上分結得阿羅漢果？",
        "translation": "How many sentient beings end the five higher bonds of conformity and attain the fruit of the arhat?",
        "source": "T05n0220_103:0573b05_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生發心定趣獨覺菩提？",
        "translation": "How many sentient beings have arisen with the intention of definitely heading for the enlightenment of the pratyekabuddhas?",
        "source": "T05n0220_103:0573b06_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生發心定趣阿耨多羅三藐三菩提？",
        "translation": "How many sentient beings have the intention to proceed definitely to unsurpassed, correct enlightenment?",
        "source": "T05n0220_103:0573b07_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生既發心已精勤修習趣菩提行？",
        "translation": "How many sentient beings have arisen the intention to diligently cultivate the practice of going to bodhi?",
        "source": "T05n0220_103:0573b08_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生鍊磨長養趣菩提心？",
        "translation": "\"How many sentient beings are trained, polished, and nurtured to pursue the mind of enlightenment?",
        "source": "T05n0220_103:0573b09_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生方便善巧修行般若波羅蜜多？",
        "translation": "How many sentient beings skillfully and conveniently cultivate the perfection of wisdom?",
        "source": "T05n0220_103:0573b09_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生得住菩薩不退轉地？",
        "translation": "How many sentient beings attain the stage of the nonretrogression of the bodhisattvas?",
        "source": "T05n0220_103:0573b10_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾所眾生速證無上正等菩提？」",
        "translation": "How many sentient beings will quickly realize unsurpassed perfect enlightenment?\"",
        "source": "T05n0220_103:0573b11_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天帝釋言：「世尊！",
        "translation": "The emperor explained, \"Bhagavān!",
        "source": "T05n0220_103:0573b12_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此三千大千世界，有少眾生供養恭敬父母、師長，有少眾生供養恭敬沙門、婆羅門，有少眾生行施、受齋、持戒，有少眾生修十善業道，有少眾生於諸欲中住厭患想、無常想、苦想、無我想、不淨想、厭食想、一切世間不可樂想，有少眾生修四靜慮，有少眾生修四無量，有少眾生修四無色定，有少眾生信佛、信法、信僧，有少眾生於佛無疑、於法無疑、於僧無疑，有少眾生於佛究竟、於法究竟、於僧究竟，有少眾生修三十七菩提分法，有少眾生修三解脫門，有少眾生修八解脫，有少眾生修九次第定，有少眾生修四無礙解，有少眾生修六神通，有少眾生永斷三結得預流果，有少眾生薄貪、瞋、癡得一來果，有少眾生斷五順下分結得不還果，有少眾生斷五順上分結得阿羅漢果，有少眾生發心定趣獨覺菩提，有少眾生發心定趣阿耨多羅三藐三菩提，有少眾生既發心已精勤修習趣菩提行，有少眾生練磨長養趣菩提心，有少眾生方便善巧修行般若波羅蜜多，有少眾生得住菩薩不退轉地，有少眾生速證無上正等菩提。」",
        "translation": "於此三千大千世界，有少眾生供養恭敬父母、師長，有少眾生供養恭敬沙門、婆羅門，有少眾生行施、受齋、持戒，有少眾生修十善業道，有少眾生於諸欲中住厭患想、無常想、苦想、無我想、不淨想、厭食想、一切世間不可樂想，有少眾生修四靜慮，有少眾生修四無量，有少眾生修四無色定，有少眾生信佛、信法、信僧，有少眾生於佛無疑、於法無疑、於僧無疑，有少眾生於佛究竟、於法究竟、於僧究竟，有少眾生修三十七菩提分法，有少眾生修三解脫門，有少眾生修八解脫，有少眾生修九次第定，有少眾生修四無礙解，有少眾生修六神通，有少眾生永斷三結得預流果，有少眾生薄貪、瞋、癡得一來果，有少眾生斷五順下分結得不還果，有少眾生斷五順上分結得阿羅漢果，有少眾生發心定趣獨覺菩提，有少眾生發心定趣阿耨多羅三藐三菩提，有少眾生既發心已精勤修習趣菩提行，有少眾生練磨長養趣菩提心，有少眾生方便善巧修行般若波羅蜜多，有少眾生得住菩薩不退轉地，有少眾生速證無上正等菩提。」",
        "source": "T05n0220_103:0573b12_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, \"So it is!",
        "source": "T05n0220_103:0573c04_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T05n0220_103:0573c05_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "Just as you said.",
        "source": "T05n0220_103:0573c05_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_103:0573c05_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此三千大千世界，極少眾生供養恭敬父母、師長，轉少眾生供養恭敬沙門、婆羅門，轉少眾生行施、受齋、持戒，轉少眾生修十善業道，轉少眾生於諸欲中住厭患想、無常想、苦想、無我想、不淨想、厭食想、一切世間不可樂想，轉少眾生修四靜慮，轉少眾生修四無量，轉少眾生修四無色定，轉少眾生信佛、信法、信僧，轉少眾生於佛無疑、於法無疑、於僧無疑，轉少眾生於佛究竟、於法究竟、於僧究竟，轉少眾生修三十七菩提分法，轉少眾生修三解脫門，轉少眾生修八解脫，轉少眾生修九次第定，轉少眾生修四無礙解，轉少眾生修六神通。",
        "translation": "於此三千大千世界，極少眾生供養恭敬父母、師長，轉少眾生供養恭敬沙門、婆羅門，轉少眾生行施、受齋、持戒，轉少眾生修十善業道，轉少眾生於諸欲中住厭患想、無常想、苦想、無我想、不淨想、厭食想、一切世間不可樂想，轉少眾生修四靜慮，轉少眾生修四無量，轉少眾生修四無色定，轉少眾生信佛、信法、信僧，轉少眾生於佛無疑、於法無疑、於僧無疑，轉少眾生於佛究竟、於法究竟、於僧究竟，轉少眾生修三十七菩提分法，轉少眾生修三解脫門，轉少眾生修八解脫，轉少眾生修九次第定，轉少眾生修四無礙解，轉少眾生修六神通。",
        "source": "T05n0220_103:0573c05_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_103:0573c17_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此三千大千世界，極少眾生永斷三結得預流果，轉少眾生薄貪、瞋、癡得一來果，轉少眾生斷五順下分結得不還果，轉少眾生斷五順上分結得阿羅漢果，轉少眾生發心定趣獨覺菩提，轉少眾生發心定趣阿耨多羅三藐三菩提，轉少眾生既發心已精勤修習趣菩提行，轉少眾生練磨長養趣菩提心，轉少眾生方便善巧修行般若波羅蜜多，轉少眾生得住菩薩不退轉地，轉少眾生速證無上正等菩提。",
        "translation": "於此三千大千世界，極少眾生永斷三結得預流果，轉少眾生薄貪、瞋、癡得一來果，轉少眾生斷五順下分結得不還果，轉少眾生斷五順上分結得阿羅漢果，轉少眾生發心定趣獨覺菩提，轉少眾生發心定趣阿耨多羅三藐三菩提，轉少眾生既發心已精勤修習趣菩提行，轉少眾生練磨長養趣菩提心，轉少眾生方便善巧修行般若波羅蜜多，轉少眾生得住菩薩不退轉地，轉少眾生速證無上正等菩提。",
        "source": "T05n0220_103:0573c18_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_103:0573c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以清淨無障佛眼，觀察十方各如殑伽沙等世界，雖有無量、無數、無邊有情發心定趣阿耨多羅三藐三菩提，精勤修習趣菩提行，而由遠離甚深般若波羅蜜多方便善巧，若一、若二、若三有情得住菩薩不退轉地，多分退墮聲聞、獨覺下劣地中。",
        "translation": "With the pure, unobstructed Buddha's eye, I've observed that in each of the sands of the worlds in the ten directions, although there are measureless, countless, and limitless sentient beings who arouse the intention to definitely attain unsurpassed, correct, and complete enlightenment and diligently cultivate the practice of attaining enlightenment, if one, two, or three sentient beings who are removed from the profound prajñāpāramitā techniques and skillful means attain the stage of the nonretrogressing bodhisattva, many of them fall back into the inferior stages of śrāvakas and solitary realizers.",
        "source": "T05n0220_103:0573c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_103:0574a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_103:0574a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿耨多羅三藐三菩提甚難可得，惡慧懈怠、下劣精進、下劣勝解、下劣有情不能證故。",
        "translation": "Anuttarasamyak-saṃbodhi is so difficult to attain that it can't be realized by poor wisdom and laziness, poor effort, poor resolve, or poor sentient beings.",
        "source": "T05n0220_103:0574a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_103:0574a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是因緣，若善男子、善女人等發心定趣阿耨多羅三藐三菩提，精勤修習趣菩提行，欲住菩薩不退轉地，速證無上正等菩提無留難者，應於如是甚深般若波羅蜜多，數數聽聞、受持、讀誦、精勤修習、如理思惟、好請問師、樂為他說。",
        "translation": "For this reason, if good sons and good women arouse the intention to definitely attain unsurpassed, correct, and complete enlightenment, diligently cultivate the practice of going to enlightenment, want to abide in the bodhisattva's stage of nonretrogression, and quickly realize unsurpassed correct enlightenment without any remaining difficulty, they should repeatedly hear and retain the profound prajñāpāramitā like this, recite it, diligently cultivate it, correctly contemplate it, ask good questions of their teachers, and happily explain it for others.",
        "source": "T05n0220_103:0574a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作此事已復應書寫，種種寶物而用莊嚴，供養恭敬、尊重讚歎，復以種種上妙花鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明而為供養。",
        "translation": "After doing so, they should also write them down, adorn them with various treasures, offer them up in respect, honor, and praise them, and make offerings with various kinds of superb flower garlands, scattering incense, clothing, jewelry, banners, banners, and flags, as well as with many wonderful, precious things, music, and lamps.",
        "source": "T05n0220_103:0574a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_103:0574a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，於餘攝入甚深般若波羅蜜多諸勝善法，亦應聽聞、受持、讀誦、精勤修習、如理思惟、好請問師、樂為他說。",
        "translation": "\"Good men and good women, among the other excellent good qualities that have been collected into the profound perfection of wisdom, you should also hear, retain, recite, diligently cultivate, correctly contemplate, ask good questions of your teacher, and happily explain them to others.",
        "source": "T05n0220_103:0574a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「何謂攝入甚深般若波羅蜜多餘勝善法？",
        "translation": "\"What's meant by the other excellent and good qualities that are included in the profound prajñāpāramitā?",
        "source": "T05n0220_103:0574a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂布施波羅蜜多，淨戒、安忍、精進、靜慮波羅蜜多；若內空，若外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空；若真如，若法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界；若苦聖諦，若集、滅、道聖諦；若四靜慮，若四無量、四無色定；若八解脫，若八勝處、九次第定、十遍處；若四念住，若四正斷、四神足、五根、五力、七等覺支、八聖道支；若空解脫門，若無相、無願解脫門；若五眼，若六神通；若佛十力，若四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法；若無忘失法，若恒住捨性；若一切陀羅尼門，若一切三摩地門；若一切智，若道相智、一切相智；若餘無量無邊佛法，是謂攝入甚深般若波羅蜜多餘勝善法。",
        "translation": "所謂布施波羅蜜多，淨戒、安忍、精進、靜慮波羅蜜多；若內空，若外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空；若真如，若法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界；若苦聖諦，若集、滅、道聖諦；若四靜慮，若四無量、四無色定；若八解脫，若八勝處、九次第定、十遍處；若四念住，若四正斷、四神足、五根、五力、七等覺支、八聖道支；若空解脫門，若無相、無願解脫門；若五眼，若六神通；若佛十力，若四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法；若無忘失法，若恒住捨性；若一切陀羅尼門，若一切三摩地門；若一切智，若道相智、一切相智；若餘無量無邊佛法，是謂攝入甚深般若波羅蜜多餘勝善法。",
        "source": "T05n0220_103:0574a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_103:0574b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等，於餘隨順甚深般若波羅蜜多蘊、處、界等無量法門，亦應聽聞、受持、讀誦、如理思惟，不應非毀令於無上正等菩提而作留難。",
        "translation": "\"Good sons and good women, whatever else you follow, you should listen to, retain, recite, and correctly contemplate the numberless teachings of the profound teachings of the aggregates, fields, and elements of prajñāpāramitā, and you shouldn't make it difficult to achieve unsurpassed perfect enlightenment without disparagement.",
        "source": "T05n0220_103:0574b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第一百三",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 133",
        "source": "T05n0220_103:0574b12_0",
        "is_bad_quality": false
    }
]