[
    {
        "source_sentence": "大般若波羅蜜多經卷第四十八",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 48",
        "source": "T05n0220_048:0268b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T05n0220_048:0268b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初分摩訶薩品第十三之二",
        "translation": "Thirteenth and Second of the First Part of the Mahāsattva Chapter",
        "source": "T05n0220_048:0268b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0268b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行布施波羅蜜多時，以應一切智智心，而修布施波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，於身命等都無所悋。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of generosity, they cultivate the perfection of generosity with the mind that responds to omniscience, using the method of obtaining nothing as the goal, and they jointly dedicate themselves to unsurpassed, perfect enlightenment with all sentient beings, lacking anything in terms of body and life.",
        "source": "T05n0220_048:0268b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0268b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行布施波羅蜜多時，擐布施波羅蜜多大功德鎧。",
        "translation": "Such is called the great meritorious armor of the bodhisattvas and mahāsattvas who cultivate the perfection of generosity when they enter the home of the perfection of generosity.",
        "source": "T05n0220_048:0268b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0268b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行布施波羅蜜多時，以應一切智智心，而修布施波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，於布施行不起聲聞、獨覺作意。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of giving, they cultivate the perfection of giving with the mind that responds to omniscience, use the method of ungraspable knowledge, and jointly dedicate themselves to unsurpassed, correct, and complete enlightenment with all sentient beings, without engaging in the contemplation of direct disciples or solitary realizers in the practice of giving.",
        "source": "T05n0220_048:0268b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Venerable Śāriputra!",
        "source": "T05n0220_048:0268c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行布施波羅蜜多時，擐淨戒波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas, mahāsattvas, who cultivate the perfection of generosity and home the great merit armor of the perfection of pure precepts.",
        "source": "T05n0220_048:0268c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0268c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行布施波羅蜜多時，以應一切智智心，而修布施波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，於布施法信忍欲樂。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of generosity, they cultivate the perfection of generosity with the mind that responds to omniscience, using unobtainable as the method, and together with all sentient beings they dedicate themselves to unsurpassed, perfect enlightenment, and are confident, tolerant, and desirous of happiness in the practice of generosity.",
        "source": "T05n0220_048:0268c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0268c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行布施波羅蜜多時，擐安忍波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas, mahāsattvas, who cultivate the perfection of generosity and home the great merit armor of the perfection of patience.",
        "source": "T05n0220_048:0268c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0268c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行布施波羅蜜多時，以應一切智智心，而修布施波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，於布施行勤修不息。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of giving, they cultivate the perfection of giving with the mind that responds to omniscience, make it a method to attain nothing, and return together with all sentient beings to unsurpassed, correct, and uninterrupted practice of giving.",
        "source": "T05n0220_048:0268c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0268c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行布施波羅蜜多時，擐精進波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas, mahāsattvas, who cultivate the great merit armor of the perfection of effort when they practice the perfection of generosity.",
        "source": "T05n0220_048:0268c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0268c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行布施波羅蜜多時，以應一切智智心，而修布施波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，於布施行一心迴向一切智智，不雜聲聞、獨覺作意。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of giving, they cultivate the perfection of giving with the mind that responds to the knowledge of all knowables, use the method of obtaining nothing as a method, and together with all sentient beings, they dedicate their mind to the unsurpassed, correct, and complete enlightenment, devoid of the contemplations of direct disciples and solitary realizers.",
        "source": "T05n0220_048:0268c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Venerable Śāriputra!",
        "source": "T05n0220_048:0268c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行布施波羅蜜多時，擐靜慮波羅蜜多大功德鎧。",
        "translation": "Such is called the great meritorious armor of the bodhisattvas and mahāsattvas who cultivate the perfection of generosity and go home with the perfection of meditation.",
        "source": "T05n0220_048:0268c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0268c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行布施波羅蜜多時，以應一切智智心，而修布施波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，於布施法住如幻、如夢、如像、如響、如光影、如空花、如尋香城、如變化事想，不見施者、受者、施物。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of generosity, they cultivate the perfection of generosity with the mind that responds to omniscience, using the method of ungraspable knowledge to work together with all sentient beings to return to unsurpassed, correct enlightenment, and abide in the practice of generosity as illusion, dream, image, sound, light and shadow, empty flower, fragrant city, and miraculous object-conceptions, without seeing the donor, recipient, or donation.",
        "source": "T05n0220_048:0268c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_048:0269a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行布施波羅蜜多時，擐般若波羅蜜多大功德鎧。",
        "translation": "Such is called the great meritorious armor of the bodhisattvas and mahāsattvas who cultivate the perfection of generosity and home the perfection of wisdom.",
        "source": "T05n0220_048:0269a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_048:0269a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩修行布施波羅蜜多時，具擐六種波羅蜜多大功德鎧。",
        "translation": "When this is the bodhisattva Mahāsattva who cultivates the perfection of generosity, he possesses the great merit armor of the six perfections.",
        "source": "T05n0220_048:0269a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0269a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩以應一切智智心，修行布施波羅蜜多時，於六波羅蜜多相不取不著，當知是菩薩摩訶薩擐大功德鎧。",
        "translation": "If a bodhisattva-mahāsattva cultivates the perfection of generosity with the mind of omniscience, then he doesn't grasp or attach to the six perfections, you should know that this is the bodhisattva-mahāsattva's armor of great merit.",
        "source": "T05n0220_048:0269a06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0269a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩為欲利樂一切有情擐大功德鎧。",
        "translation": "Such is called the bodhisattva Mahāsattva's armor of great merit that he carries for the benefit of all sentient beings.",
        "source": "T05n0220_048:0269a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0269a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行淨戒波羅蜜多時，以應一切智智心，而修淨戒波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，為護淨戒於諸所有都不戀著。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of pure precepts, they cultivate the perfection of pure precepts with the mind that responds to omniscience, make it a method to attain nothing, and together with all sentient beings, they dedicate themselves to unsurpassed, perfect enlightenment, and protect the pure precepts without clinging to any of them.",
        "source": "T05n0220_048:0269a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0269a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行淨戒波羅蜜多時，擐布施波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas, mahāsattvas, who cultivate the perfection of pure precepts and home the great meritorious armor of the perfection of generosity.",
        "source": "T05n0220_048:0269a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0269a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行淨戒波羅蜜多時，以應一切智智心，而修淨戒波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，於淨戒行尚不趣求聲聞、獨覺，況異生地！",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of pure morality, they cultivate the perfection of pure morality with the mind of omniscience, using unobtainable knowledge as a method to convey all sentient beings together to unsurpassed, correct, and complete enlightenment, not yet aiming for śrāvaka or pratyekabuddha in the practice of pure morality, let alone the realm of unenlightened sentient beings!",
        "source": "T05n0220_048:0269a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_048:0269a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行淨戒波羅蜜多時，擐淨戒波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas, mahāsattvas, and bodhisattvas who cultivate the perfection of pure morality and home in on the great merit armor of the perfection of pure morality.",
        "source": "T05n0220_048:0269a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0269a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行淨戒波羅蜜多時，以應一切智智心，而修淨戒波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，於淨戒法信忍欲樂。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of pure morality, they cultivate the perfection of pure morality with the mind of omniscience, using unobtainable as the method, and together with all sentient beings they dedicate themselves to unsurpassed, perfect enlightenment, and faith, tolerance, desire, and happiness in the Dharma of pure morality.",
        "source": "T05n0220_048:0269a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0269a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行淨戒波羅蜜多時，擐安忍波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas, mahāsattvas, and bodhisattvas who cultivate the perfection of pure morality and home the great meritorious armor of the perfection of patience.",
        "source": "T05n0220_048:0269a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0269a29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行淨戒波羅蜜多時，以應一切智智心，而修淨戒波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，於淨戒行勤修不息。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of pure precepts, they cultivate the perfection of pure precepts with the mind that responds to all cognitions, make it a skillful method to attain nothing, and return together with all sentient beings to unsurpassed, perfect enlightenment, and diligently cultivate the practice of pure precepts without stopping.",
        "source": "T05n0220_048:0269a29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0269b04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行淨戒波羅蜜多時，擐精進波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas, mahāsattvas, and bodhisattvas who cultivate the perfection of pure precepts while wearing the great meritorious armor of the perfection of effort.",
        "source": "T05n0220_048:0269b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0269b06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行淨戒波羅蜜多時，以應一切智智心，而修淨戒波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，於淨戒行專以大悲而為上首，尚不間雜二乘作意，況異生心！",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of pure morality, they cultivate the perfection of pure morality with the mind of omniscience, using ungraspable wisdom as a method, and together with all sentient beings they dedicate themselves to the unsurpassed, correct enlightenment, and the practice of pure morality with great compassion as the foremost focus, not yet mixed with the intentions of the two vehicles, so why not the minds of unenlightened people?",
        "source": "T05n0220_048:0269b06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_048:0269b11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行淨戒波羅蜜多時，擐靜慮波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas, mahāsattvas, and bodhisattvas who cultivate the perfection of pure morality while wearing the great meritorious armor of the perfection of meditation.",
        "source": "T05n0220_048:0269b11_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0269b13_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行淨戒波羅蜜多時，以應一切智智心，而修淨戒波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，於淨戒法住如幻、如夢、如像、如響、如光影、如空花、如尋香城、如變化事想，於清淨戒不恃不著，於破戒惡不厭不取，由持與犯本性空故。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of pure morality, they cultivate the perfection of pure morality with the mind of omniscience, using the method of ungraspable knowledge to work together with all sentient beings to return to unsurpassed, correct, and complete enlightenment, abiding in the Dharma of pure morality like an illusion, like a dream, like an image, like a sound, like a ray of light and a shadow, like an empty flower, like a city of discursive fragrance, and like the perception of changing things, they don't rely on or cling to pure morality, and they don't tire of or grasp to evils that violate the precepts, because the nature of observance and violation is empty.",
        "source": "T05n0220_048:0269b13_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_048:0269b20_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行淨戒波羅蜜多時，擐般若波羅蜜多大功德鎧。",
        "translation": "Such is called the great meritorious armor of the bodhisattvas, the mahāsattvas, when they cultivate the perfection of pure morality and enter the great merit of prajñāpāramitā.",
        "source": "T05n0220_048:0269b20_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_048:0269b22_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩修行淨戒波羅蜜多時，具擐六種波羅蜜多大功德鎧。",
        "translation": "When this is the bodhisattva Mahāsattva who cultivates the perfection of pure precepts, he possesses the great merit armor of the six perfections.",
        "source": "T05n0220_048:0269b22_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0269b23_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩以應一切智智心，修行淨戒波羅蜜多時，於六波羅蜜多相不取不著，當知是菩薩摩訶薩擐大功德鎧。",
        "translation": "If a bodhisattva-mahāsattva cultivates the perfection of pure morality with the mind that responds to omniscience, then he doesn't grasp or cling to the six perfections for many lifetimes, you should know that this is the bodhisattva-mahāsattva's armor of great merit.",
        "source": "T05n0220_048:0269b24_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0269b26_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩為欲利樂一切有情擐大功德鎧。",
        "translation": "Such is called the bodhisattva Mahāsattva's armor of great merit that he carries for the benefit of all sentient beings.",
        "source": "T05n0220_048:0269b26_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0269b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行安忍波羅蜜多時，以應一切智智心，而修安忍波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，為成安忍於身命等無所戀著。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of patience, they cultivate the perfection of patience with the mind that responds to omniscience, use the method of ungraspable knowledge, and together with all sentient beings, they dedicate themselves to unsurpassed, correct enlightenment, and so forth, without attachment to body and life.",
        "source": "T05n0220_048:0269b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0269c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行安忍波羅蜜多時，擐布施波羅蜜多大功德鎧。",
        "translation": "Such is called the great meritorious armor of the bodhisattvas, the mahāsattvas, when they cultivate the perfection of patience and home giving.",
        "source": "T05n0220_048:0269c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0269c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行安忍波羅蜜多時，以應一切智智心，而修安忍波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，於安忍行不雜聲聞、獨覺、異生下劣作意。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of forbearance, they cultivate the perfection of forbearance with the mind that responds to omniscience, make it a method to attain nothing, and return to unsurpassed, correct, and complete enlightenment together with all sentient beings, not blurring the inferior attitudes of direct disciples, solitary realizers, and unenlightened people in their practice of forbearance.",
        "source": "T05n0220_048:0269c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0269c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行安忍波羅蜜多時，擐淨戒波羅蜜多大功德鎧。",
        "translation": "Such is called the great meritorious armor of bodhisattvas, mahāsattvas, and those who cultivate the perfection of patience while they house the perfection of pure precepts.",
        "source": "T05n0220_048:0269c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0269c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行安忍波羅蜜多時，以應一切智智心，而修安忍波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，於安忍法信忍欲樂。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of patience, they cultivate the perfection of patience in response to the mind of omniscience, use the method of ungraspable knowledge, and together with all sentient beings, they dedicate themselves to unsurpassed, correct, and forbearant desire and happiness in the teaching of patience.",
        "source": "T05n0220_048:0269c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0269c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行安忍波羅蜜多時，擐安忍波羅蜜多大功德鎧。",
        "translation": "Such is called the great meritorious armor of the bodhisattvas and mahāsattvas who cultivate the perfection of patience when they enter the home of the perfection of patience.",
        "source": "T05n0220_048:0269c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0269c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行安忍波羅蜜多時，以應一切智智心，而修安忍波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，於安忍行勤修不息。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of patience, they cultivate the perfection of patience with the mind that responds to omniscience, make it a method to attain nothing, and return to unsurpassed, correct, and complete enlightenment together with all sentient beings, diligently cultivating the practice of patience.",
        "source": "T05n0220_048:0269c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0269c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行安忍波羅蜜多時，擐精進波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas and mahāsattvas who cultivate the perfection of patience and the great meritorious armor of the perfection of effort.",
        "source": "T05n0220_048:0269c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0269c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行安忍波羅蜜多時，以應一切智智心，而修安忍波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，攝心一緣修安忍行，雖遇苦事而不異緣。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of patience, they cultivate the perfection of patience with the mind that responds to omniscience, make it a method to attain nothing, dedicate themselves to the unsurpassed, corrected, and co-discriminating enlightenment of all sentient beings, and cultivate the practice of patience with a single objective in their minds, even though they encounter painful situations and don't have different objectives.",
        "source": "T05n0220_048:0269c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0269c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行安忍波羅蜜多時，擐靜慮波羅蜜多大功德鎧。",
        "translation": "Such is called the great meritorious armor of the bodhisattvas and mahāsattvas who cultivate the perfection of patience while they home in on the perfection of meditation.",
        "source": "T05n0220_048:0269c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0270a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行安忍波羅蜜多時，以應一切智智心，而修安忍波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，於安忍法住如幻、如夢、如像、如響、如光影、如空花、如尋香城、如變化事想，為欲修集一切佛法，為欲成熟一切有情，觀諸法空不執怨害。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of patience, they cultivate the perfection of patience with the mind that responds to omniscience, make it a method to attain nothing, and together with all sentient beings they dedicate themselves to unsurpassed, correct, and complete enlightenment, abiding in the Dharma of patience as illusion, as dream, as image, as sound, as light and shadow, as empty flower, as fragrant city, and as perception of changing things, in order to cultivate all buddhas, in order to ripen all sentient beings, and observing the emptiness of all things without holding grudges.",
        "source": "T05n0220_048:0270a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_048:0270a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行安忍波羅蜜多時，擐般若波羅蜜多大功德鎧。",
        "translation": "Such is called the great meritorious armor of the bodhisattvas and mahāsattvas who cultivate the perfection of patience when they enter the home of Prajñāpāramitā.",
        "source": "T05n0220_048:0270a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_048:0270a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩修行安忍波羅蜜多時，具擐六種波羅蜜多大功德鎧。",
        "translation": "When this bodhisattva Mahāsattva cultivates the perfection of patience, he possesses the great merit armor of the six perfections.",
        "source": "T05n0220_048:0270a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0270a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩以應一切智智心，修行安忍波羅蜜多時，於六波羅蜜多相不取不著，當知是菩薩摩訶薩擐大功德鎧。",
        "translation": "If a bodhisattva-mahāsattva cultivates the perfection of patience with the mind of omniscience, then he doesn't grasp or cling to the six perfections for many lifetimes, you should know that this is the bodhisattva-mahāsattva's armor of great merit.",
        "source": "T05n0220_048:0270a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0270a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩為欲利樂一切有情擐大功德鎧。",
        "translation": "Such is called the bodhisattva Mahāsattva's armor of great merit that he carries for the benefit of all sentient beings.",
        "source": "T05n0220_048:0270a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0270a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行精進波羅蜜多時，以應一切智智心，而修精進波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，勤修種種難行施行。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of effort, they cultivate the perfection of effort with the mind that responds to omniscience, make it a method to attain nothing, and strive to perform various difficult tasks while simultaneously dedicating themselves to unsurpassed, correct enlightenment with all sentient beings.",
        "source": "T05n0220_048:0270a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0270a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行精進波羅蜜多時，擐布施波羅蜜多大功德鎧。",
        "translation": "Such is called the great meritorious armor of the bodhisattvas, the mahāsattvas, when they're cultivating the perfection of effort, and the perfection of generosity in their homes.",
        "source": "T05n0220_048:0270a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0270a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行精進波羅蜜多時，以應一切智智心，而修精進波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，精勤護持清淨禁戒。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of effort, they cultivate the perfection of effort with the mind that responds to omniscience, make it a skillful method to attain nothing, dedicate themselves to the unsurpassed, correct, and complete enlightenment together with all sentient beings, and diligently guard the pure precepts.",
        "source": "T05n0220_048:0270a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0270a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行精進波羅蜜多時，擐淨戒波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas, mahāsattvas, who cultivate the perfection of effort and home the great meritorious armor of the perfection of pure morality.",
        "source": "T05n0220_048:0270a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0270b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行精進波羅蜜多時，以應一切智智心，而修精進波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，勤修種種難行忍行。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of effort, they cultivate the perfection of effort with the mind that responds to omniscience, make it a method to attain nothing, return together with all sentient beings to unsurpassed, samyak-saṃbodhi, and diligently cultivate various difficult practices of forbearance.",
        "source": "T05n0220_048:0270b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0270b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行精進波羅蜜多時，擐安忍波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas, mahāsattvas, and bodhisattvas who cultivate the perfection of effort and home the great meritorious armor of the perfection of patience.",
        "source": "T05n0220_048:0270b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0270b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行精進波羅蜜多時，以應一切智智心，而修精進波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，熾然勤修有利苦行。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of effort, they cultivate the perfection of effort with the mind that responds to omniscience, make it a skillful method to attain nothing, and diligently cultivate beneficial ascetic practices while simultaneously dedicating themselves to unsurpassed, correct enlightenment with all sentient beings.",
        "source": "T05n0220_048:0270b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0270b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行精進波羅蜜多時，擐精進波羅蜜多大功德鎧。",
        "translation": "Such is called the great meritorious armor of the bodhisattvas and mahāsattvas who cultivate the perfection of effort when they enter the home.",
        "source": "T05n0220_048:0270b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0270b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行精進波羅蜜多時，以應一切智智心，而修精進波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，勤修種種靜慮等至。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of effort, they cultivate the perfection of effort with the mind that responds to omniscience, make it a method to attain nothing, return together with all sentient beings to unsurpassed, samyak-saṃbodhi, and diligently cultivate various kinds of meditations and equipoises.",
        "source": "T05n0220_048:0270b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0270b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行精進波羅蜜多時，擐靜慮波羅蜜多大功德鎧。",
        "translation": "Such is called the great meritorious armor of the bodhisattvas and mahāsattvas who cultivate the perfection of effort while they're at home in the perfection of meditation.",
        "source": "T05n0220_048:0270b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0270b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行精進波羅蜜多時，以應一切智智心，而修精進波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，精進修行無取著慧。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of effort, they cultivate the perfection of effort with the mind that responds to omniscience, make it a method to attain nothing, and together with all sentient beings, they dedicate themselves to unsurpassed, correct, and unattached wisdom.",
        "source": "T05n0220_048:0270b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0270b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行精進波羅蜜多時，擐般若波羅蜜多大功德鎧。",
        "translation": "Such is called the great meritorious armor of the bodhisattvas, the mahāsattvas, when they cultivate the perfection of effort and home the perfection of wisdom.",
        "source": "T05n0220_048:0270b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_048:0270b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩修行精進波羅蜜多時，具擐六種波羅蜜多大功德鎧。",
        "translation": "When this is the bodhisattva Mahāsattva who cultivates the perfection of effort, he possesses the great merit armor of the six perfections.",
        "source": "T05n0220_048:0270b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0270b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩以應一切智智心，修行精進波羅蜜多時，於六波羅蜜多相不取不著，當知是菩薩摩訶薩擐大功德鎧。",
        "translation": "If a bodhisattva-mahāsattva cultivates the perfection of effort with the mind of omniscience, then he doesn't grasp or attach to the six perfections, you should know that this is the bodhisattva-mahāsattva's armor of great merit.",
        "source": "T05n0220_048:0270b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0270b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩為欲利樂一切有情擐大功德鎧。",
        "translation": "Such is called the bodhisattva Mahāsattva's armor of great merit that he carries for the benefit of all sentient beings.",
        "source": "T05n0220_048:0270b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0270c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行靜慮波羅蜜多時，以應一切智智心，而修靜慮波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，住安靜心而行布施，令慳悋垢不復現前。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of concentration, they cultivate the perfection of concentration with the mind that responds to omniscience, make it a skillful method to attain nothing, return to unsurpassed, perfect enlightenment together with all sentient beings, and abide in a peaceful state of mind while making donations, so that the stain of stinginess and parsimony no longer appears.",
        "source": "T05n0220_048:0270c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0270c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行靜慮波羅蜜多時，擐布施波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas, mahāsattvas, who cultivate the perfection of meditation and home the great meritorious armor of the perfection of generosity.",
        "source": "T05n0220_048:0270c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0270c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行靜慮波羅蜜多時，以應一切智智心，而修靜慮波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，由淨定力護持禁戒，令犯戒垢不復現前。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of concentration, they cultivate the perfection of concentration with the mind that responds to omniscience, use unobtainable knowledge as a method, and together with all sentient beings, they dedicate themselves to unsurpassed, corrected, and perfected enlightenment, and maintain the precepts by the power of pure concentration, so that the stain of violating the precepts will no longer appear.",
        "source": "T05n0220_048:0270c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0270c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行靜慮波羅蜜多時，擐淨戒波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas, mahāsattvas, who cultivate the perfection of meditation and home in on the great merit armor of the perfection of pure precepts.",
        "source": "T05n0220_048:0270c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0270c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行靜慮波羅蜜多時，以應一切智智心，而修靜慮波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，住慈悲定而修安忍，令忿恚等不復現前。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of concentration, they cultivate the perfection of concentration with the mind that responds to omniscience, make it a method to attain nothing, return together with all sentient beings to unsurpassed, samyak-saṃbodhi, abide in the concentration of compassion, and cultivate patience so that anger and so forth don't reappear.",
        "source": "T05n0220_048:0270c16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0270c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行靜慮波羅蜜多時，擐安忍波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas, mahāsattvas, who cultivate the perfection of meditation and home the great meritorious armor of the perfection of patience.",
        "source": "T05n0220_048:0270c20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0270c22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行靜慮波羅蜜多時，以應一切智智心，而修靜慮波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，安住靜定勤修功德，令諸懈怠不復現前。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of concentration, they cultivate the perfection of concentration with the mind that responds to omniscience, make it a method to attain nothing, dedicate themselves to the unsurpassed, correct, and complete enlightenment together with all sentient beings, and abide in quiet concentration and diligently cultivate merits so that laziness doesn't reappear.",
        "source": "T05n0220_048:0270c22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0270c26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行靜慮波羅蜜多時，擐精進波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas and mahāsattvas who cultivate the perfection of meditation and the great meritorious armor of the perfection of effort.",
        "source": "T05n0220_048:0270c27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0270c28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行靜慮波羅蜜多時，以應一切智智心，而修靜慮波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，依靜慮等引發勝定，令味亂障不復現前。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of concentration, they cultivate the perfection of concentration in response to the mind of omniscience, use unobtainable knowledge as a method, and together with all sentient beings, they dedicate themselves to unsurpassed, corrected concentration based on meditation, etc., so that the tastes and disturbances hindrances no longer appear.",
        "source": "T05n0220_048:0270c29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0271a04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行靜慮波羅蜜多時，擐靜慮波羅蜜多大功德鎧。",
        "translation": "Such is called the great meritorious armor of the bodhisattvas and mahāsattvas who cultivate the perfection of meditation while they're wearing the perfection of meditation.",
        "source": "T05n0220_048:0271a04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0271a06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行靜慮波羅蜜多時，以應一切智智心，而修靜慮波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，依靜慮等引發勝慧，觀一切法皆如幻等，令諸惡慧不復現前。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of concentration, they cultivate the perfection of concentration with the mind that responds to omniscience, use unobtainable knowledge as a method, and together with all sentient beings, they dedicate themselves to unsurpassed, corrected, and perfected wisdom based on concentration and so forth, observing that all things are illusory and so forth, so that bad wisdom doesn't reappear.",
        "source": "T05n0220_048:0271a06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0271a11_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行靜慮波羅蜜多時，擐般若波羅蜜多大功德鎧。",
        "translation": "Such is called the great meritorious armor of the bodhisattvas and mahāsattvas who cultivate the perfection of meditation while they're at home in the perfection of wisdom.",
        "source": "T05n0220_048:0271a11_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_048:0271a13_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩修行靜慮波羅蜜多時，具擐六種波羅蜜多大功德鎧。",
        "translation": "When this is the bodhisattva Mahāsattva who cultivates the perfection of meditation, he possesses the great merit armor of the six perfections.",
        "source": "T05n0220_048:0271a13_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0271a14_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩以應一切智智心，修行靜慮波羅蜜多時，於六波羅蜜多相不取不著，當知是菩薩摩訶薩擐大功德鎧。",
        "translation": "If a bodhisattva-mahāsattva cultivates the perfection of meditation with the mind of omniscience, he doesn't grasp or attach to the six perfections, you should know that this is the bodhisattva-mahāsattva's armor of great merit.",
        "source": "T05n0220_048:0271a15_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0271a17_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩為欲利樂一切有情擐大功德鎧。",
        "translation": "Such is called the bodhisattva Mahāsattva's armor of great merit that he carries for the benefit of all sentient beings.",
        "source": "T05n0220_048:0271a17_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0271a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多時，以應一切智智心，而修般若波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，不見施者、受者、施物，三輪清淨而行布施。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of wisdom, they cultivate the perfection of wisdom in response to the mind of omniscience, make it a method to attain nothing, and return to unsurpassed, correct, and complete enlightenment together with all sentient beings, without seeing the donor, the recipient, or the donation, and they perform generosity with the three wheels purified.",
        "source": "T05n0220_048:0271a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Venerable Śāriputra!",
        "source": "T05n0220_048:0271a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行般若波羅蜜多時，擐布施波羅蜜多大功德鎧。",
        "translation": "Such is called the great meritorious armor of the bodhisattvas, the mahāsattvas, when they practice the perfection of wisdom and the great virtue of the perfection of generosity.",
        "source": "T05n0220_048:0271a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0271a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多時，以應一切智智心，而修般若波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，不見持戒及破戒等，以無著心而修淨戒。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of wisdom, they cultivate the perfection of wisdom in response to the mind of omniscience, make it a skillful method to attain nothing, and return to unsurpassed, correct, and complete enlightenment together with all sentient beings, not seeing the observance of precepts or the breaking of precepts, and cultivating pure precepts with a mind free of attachment.",
        "source": "T05n0220_048:0271a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0271b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行般若波羅蜜多時，擐淨戒波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas, mahāsattvas, and bodhisattvas who cultivate the perfection of wisdom when they home in on the great merit armor of the perfection of pure precepts.",
        "source": "T05n0220_048:0271b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0271b03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多時，以應一切智智心，而修般若波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，不見能忍所忍等事，以勝空慧而修安忍。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of wisdom, they cultivate the perfection of wisdom in response to the mind of omniscience, use ungraspable knowledge as a method, and together with all sentient beings, they dedicate themselves to unsurpassed, correct, and forbearant things by using superior wisdom of emptiness.",
        "source": "T05n0220_048:0271b04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0271b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行般若波羅蜜多時，擐安忍波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas, mahāsattvas, and bodhisattvas who cultivate the perfection of wisdom when they enter the great meritorious armor of the perfection of patience.",
        "source": "T05n0220_048:0271b08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0271b10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多時，以應一切智智心，而修般若波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，觀一切法皆畢竟空，以大悲心而行精進。",
        "translation": "When they practice the perfection of wisdom, bodhisattvas and mahāsattvas cultivate the perfection of wisdom in response to the mind of omniscience, make it a method to attain nothing, dedicate themselves to unsurpassed, perfect enlightenment together with all sentient beings, observe that all things are ultimately empty, and conduct themselves with great compassion.",
        "source": "T05n0220_048:0271b10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0271b14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行般若波羅蜜多時，擐精進波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas, mahāsattvas, and bodhisattvas who cultivate the perfection of wisdom when they enter the great merit armor of the perfection of effort.",
        "source": "T05n0220_048:0271b15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0271b16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多時，以應一切智智心，而修般若波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，觀入、住、出定及定境皆畢竟空而修等至。",
        "translation": "When they practice the perfection of wisdom, bodhisattvas and mahāsattvas cultivate the perfection of wisdom in response to the mind of omniscience, use the method of obtaining nothing as the method, dedicate themselves to unsurpassed, perfect enlightenment together with all sentient beings, observe that entry, abiding, exit concentration, and the objects of concentration are all ultimately empty, and then cultivate equipoise.",
        "source": "T05n0220_048:0271b17_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0271b21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行般若波羅蜜多時，擐靜慮波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas, mahāsattvas, and bodhisattvas who cultivate the perfection of wisdom when they enter the great merit armor of the perfection of meditation.",
        "source": "T05n0220_048:0271b21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0271b23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多時，以應一切智智心，而修般若波羅蜜多，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提，於一切法、一切有情、一切波羅蜜多，住如幻、如夢、如像、如響、如光影、如空花、如尋香城、如變化事想，而修種種無取著慧。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of wisdom, they cultivate the perfection of wisdom in response to the mind of omniscience, make it a method to attain nothing, dedicate themselves to the unsurpassed, correct, and complete enlightenment together with all sentient beings, and abide in all things, all beings, and all perfections as illusion, dream, image, sound, light and shadow, empty flower, fragrant city, and perception of changing things, and cultivate various kinds of wisdom without attachment.",
        "source": "T05n0220_048:0271b23_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_048:0271b29_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為諸菩薩摩訶薩修行般若波羅蜜多時，擐般若波羅蜜多大功德鎧。",
        "translation": "Thus are these bodhisattvas, mahāsattvas, and bodhisattvas who cultivate the great merit armor of prajñāpāramitā.",
        "source": "T05n0220_048:0271b29_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_048:0271c02_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多時，具擐六種波羅蜜多大功德鎧。",
        "translation": "When this is the bodhisattva Mahāsattva who cultivates the perfection of wisdom, he possesses the great merit armor of the six perfections.",
        "source": "T05n0220_048:0271c02_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0271c04_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩以應一切智智心，修行般若波羅蜜多時，於六波羅蜜多相不取不著，當知是菩薩摩訶薩擐大功德鎧。",
        "translation": "If a bodhisattva-mahāsattva cultivates the perfection of wisdom with the mind of omniscience, he doesn't grasp or attach to the six perfections, you should know that this is the bodhisattva-mahāsattva's armor of great merit.",
        "source": "T05n0220_048:0271c04_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0271c07_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩為欲利樂一切有情擐大功德鎧。",
        "translation": "Such is called the bodhisattva Mahāsattva's armor of great merit that he carries for the benefit of all sentient beings.",
        "source": "T05n0220_048:0271c07_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_048:0271c08_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩如是安住一一波羅蜜多，皆修六波羅蜜多令得圓滿，是故名擐大功德鎧。",
        "translation": "All bodhisattvas, mahāsattvas, and bodhisattvas thus abide in each of the six perfections, cultivating them to their fullest, which is why they're called the armor of great merit.",
        "source": "T05n0220_048:0271c08_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0271c10_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩雖入諸靜慮及無量、無色定而不味著，亦不為彼勢力所引，亦不隨彼勢力受生。",
        "translation": "Although bodhisattvas and mahāsattvas enter meditation and limitless, formless concentration without taste or attachment, they aren't led by those forces and don't take birth according to those forces.",
        "source": "T05n0220_048:0271c11_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_048:0271c13_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩修行靜慮波羅蜜多時，擐方便善巧般若波羅蜜多大功德鎧。",
        "translation": "This is the great meritorious armor of the bodhisattva Mahāsattva who cultivates the perfection of meditation and the great virtue of the prajñāpāramitā of skillful means.",
        "source": "T05n0220_048:0271c13_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0271c15_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩雖入諸靜慮及無量、無色定，住遠離見、寂靜見、空無相無願見而不證實際，不入聲聞及獨覺地，勝伏一切聲聞、獨覺。",
        "translation": "Although bodhisattvas and mahāsattvas enter meditation and the concentrations of infinity and formlessness, abide in the views of seclusion, quiescence, and emptiness, signlessness, and wishlessness without actually realizing them, and don't enter the stages of śrāvakas and pratyekbuddhas, they surpass all śrāvakas and pratyekbuddhas.",
        "source": "T05n0220_048:0271c15_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Venerable Śāriputra!",
        "source": "T05n0220_048:0271c18_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩修行靜慮波羅蜜多時，擐方便善巧般若波羅蜜多大功德鎧。",
        "translation": "Thus is called the great meritorious armor of the bodhisattva Mahāsattva who cultivates the perfection of meditation and the great merit of the prajñāpāramitā of skillful means.",
        "source": "T05n0220_048:0271c18_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_048:0271c20_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸菩薩由為利樂一切有情擐如是等大功德鎧，故復名摩訶薩。",
        "translation": "Because bodhisattvas guard such great merit for the benefit and welfare of all sentient beings, they're again called mahāsattvas.",
        "source": "T05n0220_048:0271c20_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_048:0271c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是為欲利樂一切有情擐大功德鎧菩薩摩訶薩，普為十方各如殑伽沙等世界諸佛世尊，於大眾中歡喜讚歎，作如是言：『某方某世界中有某名菩薩摩訶薩，為欲利樂一切有情擐大功德鎧，成熟有情、嚴淨佛土，遊戲神通作所應作。』",
        "translation": "Thus, for the benefit and welfare of all sentient beings, the bodhisattva Mahāsattva in great armor of merit universally praises the buddhas and worlds of the sands of the ten directions with joy and praise among the masses, saying, 'In a certain world in a certain direction, there's a certain bodhisattva Mahāsattva in great armor of merit who wants to benefit and welfare all sentient beings, ripen sentient beings, and purify the Buddha's land, and who plays with his supernormal powers to do what should be done.'",
        "source": "T05n0220_048:0271c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是展轉聲遍十方，天、人等眾聞皆歡喜，咸作是言：『如是菩薩速當作佛，利益安樂一切有情。』」",
        "translation": "Thus, the sound of this action spread throughout the ten directions, and the gods, humans, and others who heard it rejoiced and said, 'Thus, the bodhisattva will quickly become a buddha and will benefit and comfort all sentient beings.'\"",
        "source": "T05n0220_048:0271c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，具壽舍利子問滿慈子言：「云何名為菩薩摩訶薩為欲利樂諸有情故發趣大乘？」",
        "translation": "It was then that Kauśālīputra asked Pūrṇa Maitrāyaniputra, \"What is the name of a bodhisattva who initiates the great vehicle for the purpose of benefiting and delighting all sentient beings?\"",
        "source": "T05n0220_048:0272a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滿慈子言：「舍利子！",
        "translation": "Pūrṇa Maitrāyaniputra said, \"Śāriputra!",
        "source": "T05n0220_048:0272a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩為欲利樂一切有情，擐六波羅蜜多大功德鎧已，復為利樂諸有情故，離欲惡不善法，有尋有伺，離生喜樂，入初靜慮具足住；尋伺寂靜，內等淨，心一趣性，無尋無伺，定生喜樂，入第二靜慮具足住；離喜住捨，具念正知，身受樂，聖說住捨，具念樂住，入第三靜慮具足住；斷樂斷苦，先喜憂沒，不苦不樂，捨念清淨，入第四靜慮具足住。",
        "translation": "菩薩摩訶薩為欲利樂一切有情，擐六波羅蜜多大功德鎧已，復為利樂諸有情故，離欲惡不善法，有尋有伺，離生喜樂，入初靜慮具足住；尋伺寂靜，內等淨，心一趣性，無尋無伺，定生喜樂，入第二靜慮具足住；離喜住捨，具念正知，身受樂，聖說住捨，具念樂住，入第三靜慮具足住；斷樂斷苦，先喜憂沒，不苦不樂，捨念清淨，入第四靜慮具足住。",
        "source": "T05n0220_048:0272a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復依靜慮起慈俱心，行相廣大，無二無量，無怨、無害、無恨、無惱，遍滿善修，勝解周普，充溢十方，盡虛空窮法界，慈心勝解具足而住；悲、喜、捨俱心勝解行相，亦復如是。",
        "translation": "Furthermore, depending on that meditation, he arouses the mind of both kindness and compassion, which is vast in its conduct, without duality or measure, without enmity, without harm, without hatred, and without anger, pervading good cultivation, pervading the ten directions with superior understanding, and exhausting the space and the Dharma realm, fully abiding with superior understanding of kindness, and likewise with the conduct of the mind of both pity, joy, and equanimity with superior understanding.",
        "source": "T05n0220_048:0272a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此加行，復超一切色想，滅有對想，不思惟種種想，入無邊空，空無邊處具足住；超一切空無邊處，入無邊識，識無邊處具足住；超一切識無邊處，入無所有，無所有處具足住；超一切無所有處，入非想非非想處具足住。",
        "translation": "Based on this applied practice, he also transcends all perceptions of form, ceases perceptions of existence and opposition, doesn't contemplate various perceptions, and enters infinite space, fully abiding in the infinite state of space; transcends all the infinite states of space and enters the infinite state of consciousness, fully abiding in the infinite state of consciousness; transcends all the infinite states of consciousness and enters the state of nothingness, fully abiding in the state of nothingness; and transcends all the states of nothingness and enters the state of neither perception nor non-perception, fully abiding in it.",
        "source": "T05n0220_048:0272a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_048:0272a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩以無所得而為方便，持此靜慮、無量、無色，與一切有情同共迴向阿耨多羅三藐三菩提。",
        "translation": "This is the bodhisattva-mahāsattva who, using the method of obtaining nothing, maintains this meditation, immeasurable, and formless, and returns with all sentient beings to unsurpassed, correct, and complete enlightenment.",
        "source": "T05n0220_048:0272a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0272a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故發趣大乘。",
        "translation": "This is the bodhisattva Mahāsattva who sets out for the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_048:0272a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0272a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩為欲利樂諸有情故，先自安住如是靜慮、無量、無色，於入、住、出諸行、相、狀善分別知，得自在已復作是念：『我當以應一切智智心，大悲為上首，為斷一切有情諸煩惱故，說諸靜慮、無量、無色，分別開示令善了知諸定愛味、過患、出離，及入、住、出諸行、相、狀。』",
        "translation": "Because they want to bring benefit and joy to sentient beings, bodhisattvas and mahāsattvas first establish themselves in such meditation, immeasurable form, and formlessness, and then they well discern the actions, characteristics, and states of entering, abiding, and exiting. After attaining freedom, they then think, 'With the mind of omniscience and wisdom, with great compassion as the foremost, I will explain such meditation, immeasurable form, and discern and make good the taste, faults, and escape of concentration, as well as the actions, characteristics, and states of entering, abiding, and exiting, for the sake of ending the afflictions of all sentient beings.'",
        "source": "T05n0220_048:0272a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_048:0272b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩依靜慮波羅蜜多，修布施波羅蜜多，為欲利樂諸有情故發趣大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who relies on the perfection of meditation and the perfection of generosity and sets out for the great vehicle because he wants to bring benefit to sentient beings.",
        "source": "T05n0220_048:0272b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，說諸靜慮、無量、無色時，不為聲聞、獨覺心等之所間雜。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and knowledge, when great compassion is the foremost thing, he explains that meditation, immeasurability, and formlessness are not intermingled with the minds of śrāvakas and pratyekbuddhas.",
        "source": "T05n0220_048:0272b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_048:0272b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩依靜慮波羅蜜多，修淨戒波羅蜜多，為欲利樂諸有情故發趣大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who relies on the perfection of concentration and cultivates the perfection of pure precepts, and who sets out for the great vehicle because he wants to bring benefit to sentient beings.",
        "source": "T05n0220_048:0272b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，說諸靜慮、無量、無色時，於如是法信忍欲樂。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and knowledge, when great compassion is the foremost thing, and when he teaches about meditation, immeasurability, and formlessness, he'll have faith, patience, and desire to enjoy such things.",
        "source": "T05n0220_048:0272b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_048:0272b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩依靜慮波羅蜜多，修安忍波羅蜜多，為欲利樂諸有情故發趣大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who relies on the perfection of meditation and cultivates the perfection of patience and aims for the great vehicle for the sake of the welfare of sentient beings.",
        "source": "T05n0220_048:0272b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，修諸靜慮、無量、無色時，以自善根為有情故，迴求無上正等菩提，於諸善根勤修不息。",
        "translation": "\"If the bodhisattva Mahāsattva cultivates meditation, immeasurability, and formlessness with the mind of omniscience and knowledge and great compassion as the foremost, then he diligently cultivates those good roots without stopping in order to pursue unsurpassed correct perfect enlightenment for the sake of sentient beings.",
        "source": "T05n0220_048:0272b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0272b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩依靜慮波羅蜜多，修精進波羅蜜多，為欲利樂諸有情故發趣大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who relies on the perfection of meditation and cultivates the perfection of effort and aims for the great vehicle for the sake of the welfare of sentient beings.",
        "source": "T05n0220_048:0272b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，依諸靜慮、無量、無色，引發殊勝等至、等持、解脫、勝處、遍處等定，於入、住、出皆得自在，不墮聲聞、獨覺等地。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and knowledge, with great compassion as the foremost thing, and relies on meditations, immeasurable, and formless, which give rise to such concentrations as extraordinary equipoise, equipoise, liberation, a superior place, and a pervasive place, he'll attain freedom of entry, abode, and egress and won't fall into the stages of śrāvaka and pratyekabuddha.",
        "source": "T05n0220_048:0272b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0272b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩依靜慮波羅蜜多，修靜慮波羅蜜多，為欲利樂諸有情故發趣大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who relies on the perfection of concentration, cultivates the perfection of concentration, and sets out for the great vehicle in order to bring benefit to sentient beings.",
        "source": "T05n0220_048:0272b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，修諸靜慮、無量、無色時，於諸靜慮、無量、無色及靜慮支，以無常行相、苦行相、無我行相、空行相、無相行相、無願行相，如實觀察不捨大悲，不墮聲聞及獨覺地。",
        "translation": "\"If the bodhisattva Mahāsattva cultivates meditation, immeasurable form, and formlessness with the mind of omniscience and knowledge and great compassion as the foremost, then when he cultivates meditation, immeasurable form, formlessness, and the branch of meditation, he correctly observes the mark of impermanent action, the mark of suffering, the mark of selfless action, the mark of emptiness, the mark of formless action, and the mark of wishless action and doesn't abandon great compassion, so he doesn't fall into the stages of śrāvakas and pratyekbuddhas.",
        "source": "T05n0220_048:0272b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Venerable Śāriputra!",
        "source": "T05n0220_048:0272b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩依靜慮波羅蜜多，修般若波羅蜜多，為欲利樂諸有情故發趣大乘。",
        "translation": "This is the bodhisattva Mahāsattva who relies on the perfection of meditation and cultivates the perfection of wisdom and sets out for the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_048:0272b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0272c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩以應一切智智心，大悲為上首，入慈定時作如是念：『我當拯濟一切有情令得安樂。』",
        "translation": "If a bodhisattva-mahāsattva responds with the mind of omniscience and wisdom, with great compassion as the foremost, and when he enters the concentration of kindness, he thinks, 'I will rescue all sentient beings so that they may be comfortable.'",
        "source": "T05n0220_048:0272c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入悲定時作如是念：『我當救拔一切有情令得離苦。』",
        "translation": "When he enters the concentration of compassion, he thinks, 'I will rescue all sentient beings so that they can escape suffering.'",
        "source": "T05n0220_048:0272c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入喜定時作如是念：『我當讚勸一切有情令得解脫。』",
        "translation": "When he enters the joyful concentration, he thinks, 'I will praise all sentient beings so that they may be liberated.'",
        "source": "T05n0220_048:0272c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入捨定時作如是念：『我當等益一切有情令斷諸漏。』",
        "translation": "When he enters the concentration of equanimity, he thinks, 'I will equally benefit all sentient beings so that the contaminants are ended.'",
        "source": "T05n0220_048:0272c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_048:0272c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩依無量定修布施波羅蜜多，為欲利樂諸有情故發趣大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who cultivates the perfection of generosity based on measureless concentration and sets out for the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_048:0272c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，於四無量入、住、出時，終不趣向聲聞、獨覺，唯求無上正等菩提。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, with great compassion as the foremost, when he enters, abides, and exits the four immeasurables, he never goes toward direct disciples or solitary realizers but seeks unsurpassed correct perfect enlightenment.",
        "source": "T05n0220_048:0272c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0272c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩依無量定，修淨戒波羅蜜多，為欲利樂諸有情故發趣大乘。",
        "translation": "\"This is the bodhisattva-mahāsattva who cultivates the perfection of pure precepts based on immeasurable concentration and sets out for the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_048:0272c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，於四無量入、住、出時，不雜聲聞、獨覺作意，專心信忍欲樂無上正等菩提。",
        "translation": "\"Suppose a bodhisattva Mahāsattva responds with the mind of omniscience, understanding, and great compassion as the foremost, and when he enters, abides, and exits the four immeasurables, he's unadulterated by the contemplations of direct disciples and solitary realizers and focuses his mind on faith, tolerance, and the desire for unsurpassed perfect enlightenment.",
        "source": "T05n0220_048:0272c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0272c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩依無量定，修安忍波羅蜜多，為欲利樂諸有情故發趣大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who cultivates the perfection of patience based on immeasurable concentration and sets out for the great vehicle because he wants to bring benefit to sentient beings.",
        "source": "T05n0220_048:0272c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，於四無量入、住、出時，勤斷惡法勤修善法，專趣菩提曾無暫捨。",
        "translation": "\"Suppose a bodhisattva Mahāsattva responds with the mind of omniscience, knowledge, and great compassion as the foremost, diligently ends bad qualities and diligently cultivates good qualities when entering, abiding, and departing from the four immeasurables, and never forgets to focus on enlightenment.",
        "source": "T05n0220_048:0272c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_048:0272c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩依無量定，修精進波羅蜜多，為欲利樂諸有情故發趣大乘。",
        "translation": "\"This is the great vehicle to which the bodhisattvas, mahāsattvas, rely on immeasurable concentration and cultivate the perfection of effort, in order to seek the welfare of sentient beings.",
        "source": "T05n0220_048:0272c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，於四無量入、住、出時，引發種種等持、等至，能於其中得大自在，不為彼定之所引奪，亦不隨彼勢用受生。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and knowledge, with great compassion as its leader, and gives rise to various kinds of equipoises and equipoises when entering, abiding, and departing from the four immeasurables, he can attain great freedom in them and not be seduced by their concentration, nor will he be subject to birth according to their potentials.",
        "source": "T05n0220_048:0272c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_048:0272c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩依無量定，修靜慮波羅蜜多，為欲利樂諸有情故發趣大乘。",
        "translation": "\"This is the bodhisattva-mahāsattva who cultivates the perfection of meditation based on immeasurable concentration and sets out for the great vehicle because he wants to bring benefit to sentient beings.",
        "source": "T05n0220_048:0272c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，修四無量，於無量中以無常行相、苦行相、無我行相、空行相、無相行相、無願行相如實觀察，不捨大悲，不墮聲聞及獨覺地。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, takes great compassion as the foremost thing, cultivates the four immeasurables, and correctly observes them in terms of impermanent conditioned characteristics, painful conditioned characteristics, selfless conditioned characteristics, empty conditioned characteristics, formless conditioned characteristics, and wishless conditioned characteristics, and doesn't abandon great compassion, then he won't fall into the stages of śrāvaka and pratyekabuddha.",
        "source": "T05n0220_048:0272c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Venerable Śāriputra!",
        "source": "T05n0220_048:0273a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩依無量定，修般若波羅蜜多，為欲利樂諸有情故發趣大乘。",
        "translation": "This is the bodhisattva Mahāsattva who cultivates the perfection of wisdom based on immeasurable concentration and sets out for the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_048:0273a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_048:0273a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩依如是等方便善巧修習六種波羅蜜多，為欲利樂諸有情故發趣大乘。",
        "translation": "By skillfully cultivating the six perfections based on such methods, bodhisattvas and mahāsattvas aim for the great vehicle because they want to benefit sentient beings.",
        "source": "T05n0220_048:0273a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0273a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩以應一切智智心，大悲為上首，具修一切種四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提。",
        "translation": "\"If a bodhisattva-mahāsattva responds with the mind of omniscience and knowledge, takes great compassion as the foremost, cultivates all the various four abodes of mindfulness, the four correct eliminations, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path, and makes it a skillful practice to attain nothing, then he and all sentient beings will together dedicate themselves to unsurpassed, correct, and complete enlightenment.",
        "source": "T05n0220_048:0273a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0273a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故發趣大乘。",
        "translation": "This is the great vehicle to which the bodhisattva Mahāsattva aspires for the benefit and joy of sentient beings.",
        "source": "T05n0220_048:0273a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，具修一切種空解脫門、無相解脫門、無願解脫門，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提。",
        "translation": "\"Suppose the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, takes great compassion as the foremost, cultivates the liberation gate of emptiness, the liberation gate of signlessness, and the liberation gate of wishlessness in all forms, and makes it a skillful method to work together with all sentient beings to return to unsurpassed, correct, and complete enlightenment.",
        "source": "T05n0220_048:0273a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0273a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故發趣大乘。",
        "translation": "This is the great vehicle to which the bodhisattva Mahāsattva aspires for the benefit and joy of sentient beings.",
        "source": "T05n0220_048:0273a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，具修一切種布施、愛語、利行、同事，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提。",
        "translation": "\"Suppose a bodhisattva Mahāsattva responds with the mind of omniscience, takes great compassion as the foremost, cultivates all kinds of generosity, endearing speech, beneficial actions, and colleagues, and makes unobtainable this method, so that he and all sentient beings can jointly dedicate themselves to unsurpassed, correct, and complete enlightenment.",
        "source": "T05n0220_048:0273a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0273a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故發趣大乘。",
        "translation": "\"This is the great vehicle to which the bodhisattva Mahāsattva aspires for the benefit and joy of sentient beings.",
        "source": "T05n0220_048:0273a22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，具修一切種五眼、六神通，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience, has great compassion as its leader, cultivates all the five eyes and six supernormal powers, and uses unobtainable as a method, then he and all sentient beings will together turn toward unsurpassed, correct, and complete enlightenment.",
        "source": "T05n0220_048:0273a23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0273a26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故發趣大乘。",
        "translation": "\"This is the great vehicle to which the bodhisattvas, the mahāsattvas, aspire for the benefit and joy of sentient beings.",
        "source": "T05n0220_048:0273a26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，具修一切種佛十力、四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, takes great compassion as the foremost, fully cultivates all the ten powers of the buddhas, the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, the 18 uncommon dharmas of the buddhas, omniscience, knowledge of the path, and knowledge of all characteristics, and makes it a skillful method to work together with all sentient beings to jointly dedicate themselves to unsurpassed, correct, and complete enlightenment, then he'll attain it.",
        "source": "T05n0220_048:0273a27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0273b03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故發趣大乘。",
        "translation": "This is the bodhisattva Mahāsattva who sets out for the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_048:0273b03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0273b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩以應一切智智心，大悲為上首，無所得為方便，起內空智、外空智、內外空智、空空智、大空智、勝義空智、有為空智、無為空智、畢竟空智、無際空智、散空智、無變異空智、本性空智、自相空智、共相空智、一切法空智、不可得空智、無性空智、自性空智、無性自性空智，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提。",
        "translation": "若菩薩摩訶薩以應一切智智心，大悲為上首，無所得為方便，起內空智、外空智、內外空智、空空智、大空智、勝義空智、有為空智、無為空智、畢竟空智、無際空智、散空智、無變異空智、本性空智、自相空智、共相空智、一切法空智、不可得空智、無性空智、自性空智、無性自性空智，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提。",
        "source": "T05n0220_048:0273b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0273b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故發趣大乘。",
        "translation": "\"This is the great vehicle to which the bodhisattvas, mahāsattvas, have set out for the desire to bring benefit and joy to all sentient beings.",
        "source": "T05n0220_048:0273b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，無所得為方便，於一切法起非亂非定智，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience, has great compassion as its leader, has unobtainable knowledge as its method, gives rise to the knowledge of all things that are neither confused nor determined, and uses unobtainable knowledge as its method, then he and all sentient beings will together turn toward unsurpassed, correct, and complete enlightenment.",
        "source": "T05n0220_048:0273b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0273b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故發趣大乘。",
        "translation": "\"This is the great vehicle to which the bodhisattvas, mahāsattvas, have set out in order to bring benefit and joy to sentient beings.",
        "source": "T05n0220_048:0273b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，無所得而為方便，於一切法起非常非無常智、非樂非苦智、非我非無我智、非淨非不淨智、非空非不空智、非有相非無相智、非有願非無願智、非寂靜非不寂靜智、非遠離非不遠離智，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience, with great compassion as the foremost, and with the aim of attaining nothing as a method, then he arises the knowledge that all things are neither impermanent nor impermanent, neither pleasant nor painful, neither self nor selfless, neither pure nor impure, neither empty nor nonempty, neither with nor without marks, neither with nor without wishes, neither quiescent nor nonquiescent, and neither isolated nor not isolated, and he uses the attainment of nothing as a method to convey all sentient beings together to unsurpassed, correct, and complete enlightenment.",
        "source": "T05n0220_048:0273b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0273b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故發趣大乘。",
        "translation": "This is the bodhisattva Mahāsattva who sets out for the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_048:0273b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_048:0273b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩以應一切智智心，大悲為上首，無所得為方便，智不知過去，智不知未來，智不知現在，智非不知三世法，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提。",
        "translation": "\"If a bodhisattva-mahāsattva responds with the mind of omniscience, with great compassion as the foremost, with ungraspable as the method, with knowledge that doesn't know the past, knowledge that doesn't know the future, knowledge that doesn't know the present, knowledge that doesn't know the dharmas of the three times, and knowledge that doesn't know the dharmas of the three times, and with ungraspable as the method, he'll be able to convey all sentient beings together to unsurpassed, correct, and complete enlightenment.",
        "source": "T05n0220_048:0273b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0273c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故發趣大乘。",
        "translation": "\"This is the bodhisattva-mahāsattva's initiation into the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_048:0273c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，無所得而為方便，智不知善，智不知不善，智不知無記，非不知三性法；智不知欲界，智不知色界，智不知無色界，非不知三界法；智不知學，智不知無學，智不知非學非無學，非不知學、無學、非學非無學法；智不知見所斷，智不知修所斷，智不知非所斷，非不知見所斷、修所斷、非所斷法。",
        "translation": "「若菩薩摩訶薩以應一切智智心，大悲為上首，無所得而為方便，智不知善，智不知不善，智不知無記，非不知三性法；智不知欲界，智不知色界，智不知無色界，非不知三界法；智不知學，智不知無學，智不知非學非無學，非不知學、無學、非學非無學法；智不知見所斷，智不知修所斷，智不知非所斷，非不知見所斷、修所斷、非所斷法。",
        "source": "T05n0220_048:0273c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提。",
        "translation": "Using unobtainable as a method, he will share with all sentient beings the same dedication to unsurpassed, correct, and complete enlightenment.",
        "source": "T05n0220_048:0273c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_048:0273c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故發趣大乘。",
        "translation": "This is the bodhisattva-mahāsattva's initiation into the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_048:0273c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，無所得而為方便，智不知世間，智不知出世間，非不知世間、出世間法，以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience, has great compassion as its leader, makes unobtainable effort, doesn't know the world with knowledge, doesn't know the transmundane with knowledge, doesn't not know the worldly or transmundane dharmas, and makes unobtainable effort to work together with all sentient beings to return to unsurpassed, correct enlightenment.",
        "source": "T05n0220_048:0273c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0273c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故發趣大乘。",
        "translation": "This is the great vehicle to which the bodhisattvas, the mahāsattvas, aspire for the benefit and joy of sentient beings.",
        "source": "T05n0220_048:0273c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，無所得為方便，智不知色，智不知無色非不知色、無色法；智不知有見，智不知無見，非不知有見、無見法；智不知有對，智不知無對，非不知有對、無對法；智不知有漏，智不知無漏，非不知有漏、無漏法；智不知有為，智不知無為，非不知有為、無為法。",
        "translation": "\"Suppose a bodhisattva Mahāsattva responds with the mind of omniscience, with great compassion as the leader and unobtainable as the method, knowing that he doesn't know form, knowing that he doesn't know formlessness, and not knowing form and formless dharmas; knowing that he doesn't know views, knowing that he doesn't know no views, and not knowing views and no dharmas; knowing that he doesn't know opposites, knowing that he doesn't know no opposites, and not knowing opposites and no dharmas; knowing that he doesn't know contaminants, knowing that he doesn't know the absence of contaminants, and not knowing contaminants and the absence of contaminants; knowing that he doesn't know what's existent, knowing that he doesn't know what's not existent and the absence of existent and the absence of existent dharmas.",
        "source": "T05n0220_048:0273c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無所得而為方便，與一切有情同共迴向阿耨多羅三藐三菩提。",
        "translation": "Using ungraspable as a method, he will work with all sentient beings to jointly dedicate himself to unsurpassed, correct, and complete enlightenment.",
        "source": "T05n0220_048:0273c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_048:0273c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故發趣大乘。",
        "translation": "This is the bodhisattva Mahāsattva who sets out for the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_048:0273c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_048:0274a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸菩薩由如是等方便善巧，為欲利樂一切有情發趣大乘故，復名摩訶薩。",
        "translation": "Because bodhisattvas use such skillful means to aim for the great vehicle for the benefit and welfare of all sentient beings, they're again called mahāsattvas.",
        "source": "T05n0220_048:0274a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_048:0274a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是為欲利樂諸有情故發趣大乘菩薩摩訶薩，普為十方各如殑伽沙等世界諸佛世尊，於大眾中歡喜讚歎，作如是言：『某方某世界中有某名菩薩摩訶薩，為欲利樂諸有情故發趣大乘，成就有情、嚴淨佛土，遊戲神通作所應作。』",
        "translation": "Thus, for the sake of the welfare of sentient beings, the bodhisattva Mahāsattva who has set out for the great vehicle is universally praised by the buddhas and worlds of the sands of the ten directions, and he rejoices and praises them among the masses, saying, 'In a certain world in a certain direction, there's a certain bodhisattva Mahāsattva who has set out for the great vehicle for the sake of the welfare of sentient beings, accomplishes the welfare of sentient beings, purifies the Buddha's land, and plays with supernormal powers to do what should be done.'",
        "source": "T05n0220_048:0274a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是展轉聲遍十方，天、人等眾聞皆歡喜，咸作是言：『如是菩薩速當作佛，利益安樂一切有情。』」",
        "translation": "As this sound spreads throughout the ten directions, the gods, humans, and other people who hear it rejoice and say, 'Thus, the bodhisattva will quickly become a buddha and benefit and comfort all sentient beings.'\"",
        "source": "T05n0220_048:0274a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第四十八",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 48",
        "source": "T05n0220_048:0274a11_0",
        "is_bad_quality": false
    }
]