[
    {
        "source_sentence": "大般若波羅蜜多經卷第一百三",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 133",
        "source": "T05n0220_137:0743b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十七",
        "translation": "seventeen",
        "source": "T05n0220_137:0743b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T05n0220_137:0743b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初分校量功德品第三十之三十五",
        "translation": "Chapter 30-35 of the Chapter on the Merit of Measurements in the First Branch",
        "source": "T05n0220_137:0743b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_137:0743b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說八解脫若常若無常，說八勝處、九次第定、十遍處若常若無常；說八解脫若樂若苦，說八勝處、九次第定、十遍處若樂若苦；說八解脫若我若無我，說八勝處、九次第定、十遍處若我若無我；說八解脫若淨若不淨，說八勝處、九次第定、十遍處若淨若不淨。",
        "translation": "\"If good men and good women develop the unsurpassed mind of enlightenment, they say that the eight liberations are permanent and impermanent, and they say that the eight abodes of victory, the nine graduated concentrations, and the ten universal abodes are permanent and impermanent; that the eight liberations are pleasant and painful, and they say that the eight abodes of victory, the nine graduated concentrations, and the ten universal abodes are pleasant and painful; that the eight liberations are self and selfless, and they say that the eight abodes of victory, the nine graduated concentrations, and the ten universal abodes are self and selfless; and that the eight liberations are pure and impure, and they say that the eight abodes of victory, the nine graduated concentrations, and the ten universal abodes are pure and impure.",
        "source": "T05n0220_137:0743b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能依如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can practice prajñā based on such things, they're practicing the perfection of prajñā.",
        "source": "T05n0220_137:0743b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是說：行般若者，應求八解脫若常若無常，應求八勝處、九次第定、十遍處若常若無常；應求八解脫若樂若苦，應求八勝處、九次第定、十遍處若樂若苦；應求八解脫若我若無我，應求八勝處、九次第定、十遍處若我若無我；應求八解脫若淨若不淨，應求八勝處、九次第定、十遍處若淨若不淨。",
        "translation": "Again, he says, \"Those who practice prajñā should seek whether the eight liberations are permanent or impermanent, and whether the eight abodes of excellence, nine graduated concentrations, and ten universal abodes are permanent or impermanent; whether the eight liberations are pleasant or painful, and whether the eight abodes of excellence, nine graduated concentrations, and ten universal abodes are pleasant or painful; whether the eight liberations are self or selfless, and whether the eight abodes of excellence, nine graduated concentrations, and ten universal abodes are self or selfless; and whether the eight liberations are pure or impure, and whether the eight abodes of excellence, nine graduated concentrations, and ten universal abodes are pure or impure.",
        "source": "T05n0220_137:0743c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能求如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can pursue such things and cultivate prajñā, they're practicing the perfection of prajñā.",
        "source": "T05n0220_137:0743c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_137:0743c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，如是求八解脫若常若無常，求八勝處、九次第定、十遍處若常若無常；求八解脫若樂若苦，求八勝處、九次第定、十遍處若樂若苦；求八解脫若我若無我，求八勝處、九次第定、十遍處若我若無我；求八解脫若淨若不淨，求八勝處、九次第定、十遍處若淨若不淨。",
        "translation": "\"If good men and good women thus seek the eight liberations as permanent or impermanent, the eight superior places, nine graduated concentrations, and ten universal places as permanent or impermanent, the eight liberations as pleasant or painful, the eight superior places, nine graduated concentrations, and ten universal places as pleasant or painful, the eight liberations as self or selfless, the eight superior places, nine graduated concentrations, and ten universal places as self or selfless, and the eight liberations as pure or impure, the eight superior places, nine graduated concentrations, and ten universal places as pure or impure, then they'll practice prajñāpāramitā on the basis of these things.",
        "source": "T05n0220_137:0743c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此等法行般若者，我說名為行有所得相似般若波羅蜜多。",
        "translation": "Such a practitioner of prajñā based on these things is what I'd call practicing the prajñāpāramitā that's similar to attaining.",
        "source": "T05n0220_137:0743c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_137:0743c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似般若波羅蜜多。",
        "translation": "As explained earlier, you should know that they're all teaching the prajñāpāramitā that's similar to that which has been attained.",
        "source": "T05n0220_137:0743c18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_137:0743c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說四念住若常若無常，說四正斷、四神足、五根、五力、七等覺支、八聖道支若常若無常；說四念住若樂若苦，說四正斷、四神足、五根、五力、七等覺支、八聖道支若樂若苦；說四念住若我若無我，說四正斷、四神足、五根、五力、七等覺支、八聖道支若我若無我；說四念住若淨若不淨，說四正斷、四神足、五根、五力、七等覺支、八聖道支若淨若不淨。",
        "translation": "若善男子、善女人等為發無上菩提心者，說四念住若常若無常，說四正斷、四神足、五根、五力、七等覺支、八聖道支若常若無常；說四念住若樂若苦，說四正斷、四神足、五根、五力、七等覺支、八聖道支若樂若苦；說四念住若我若無我，說四正斷、四神足、五根、五力、七等覺支、八聖道支若我若無我；說四念住若淨若不淨，說四正斷、四神足、五根、五力、七等覺支、八聖道支若淨若不淨。",
        "source": "T05n0220_137:0743c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能依如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can practice prajñā based on such things, they're practicing prajñā-pāramitā.",
        "source": "T05n0220_137:0743c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是說：行般若者，應求四念住若常若無常，應求四正斷乃至八聖道支若常若無常；應求四念住若樂若苦，應求四正斷乃至八聖道支若樂若苦；應求四念住若我若無我，應求四正斷乃至八聖道支若我若無我；應求四念住若淨若不淨，應求四正斷乃至八聖道支若淨若不淨。",
        "translation": "Again, he says, \"Those who practice prajñā should seek whether the four abodes of mindfulness are permanent or impermanent, whether the four correct eliminations or even the eight noble factors of the path are permanent or impermanent, whether the four abodes of mindfulness are pleasant or painful, whether the four correct eliminations or even the eight noble factors of the path are pleasant or painful, whether the four abodes of mindfulness are self or selfless, whether the four correct eliminations or even the eight noble factors of the path are self or selfless, and whether the four abodes of mindfulness are pure or impure and whether the four correct eliminations or even the eight noble factors of the path are pure or impure.",
        "source": "T05n0220_137:0744a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能求如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can pursue such things and cultivate prajñā, they're practicing the perfection of prajñā.",
        "source": "T05n0220_137:0744a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_137:0744a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，如是求四念住若常若無常，求四正斷乃至八聖道支若常若無常；求四念住若樂若苦，求四正斷乃至八聖道支若樂若苦；求四念住若我若無我，求四正斷乃至八聖道支若我若無我；求四念住若淨若不淨，求四正斷乃至八聖道支若淨若不淨。",
        "translation": "\"If good men and good women thus seek the four abodes of mindfulness as permanent or impermanent, the four correct eliminations ... the eight noble factors of the path as permanent or impermanent, the four abodes of mindfulness as pleasant or painful, the four correct eliminations ... the eight noble factors of the path as pleasant or painful, the four abodes of mindfulness as self or selfless, the four correct eliminations ... the eight noble factors of the path as self or selfless, and the four abodes of mindfulness as pure or impure and the four correct eliminations ... the eight noble factors of the path as pure or impure, then they'll practice prajñāpāramitā on the basis of these things.",
        "source": "T05n0220_137:0744a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此等法行般若者，我說名為行有所得相似般若波羅蜜多。",
        "translation": "Such a practitioner of prajñā based on these things is what I'd call practicing the prajñāpāramitā that's similar to attaining.",
        "source": "T05n0220_137:0744a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_137:0744a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似般若波羅蜜多。",
        "translation": "As explained earlier, you should know that they're all teaching the prajñāpāramitā that's similar to that which has been attained.",
        "source": "T05n0220_137:0744a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_137:0744a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說空解脫門若常若無常，說無相、無願解脫門若常若無常；說空解脫門若樂若苦，說無相、無願解脫門若樂若苦；說空解脫門若我若無我，說無相、無願解脫門若我若無我；說空解脫門若淨若不淨，說無相、無願解脫門若淨若不淨。",
        "translation": "\"If good men and good women develop the unsurpassed mind of enlightenment, they say that the gate of liberation through emptiness is permanent or impermanent, and they say that the gate of liberation through signlessness and wishlessness is permanent or impermanent; that the gate of liberation through emptiness is pleasant or painful, and they say that the gate of liberation through signlessness and wishlessness is pleasant or painful; that the gate of liberation through emptiness is self or selfless, and they say that the gate of liberation through signlessness and wishlessness is self or selfless; and that the gate of liberation through emptiness is pure or impure, and they say that the gate of liberation through signlessness and wishlessness is pure or impure.",
        "source": "T05n0220_137:0744a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能依如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can practice prajñā based on such things, they're practicing the perfection of prajñā.",
        "source": "T05n0220_137:0744a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是說：行般若者，應求空解脫門若常若無常，應求無相、無願解脫門若常若無常；應求空解脫門若樂若苦，應求無相、無願解脫門若樂若苦；應求空解脫門若我若無我，應求無相、無願解脫門若我若無我；應求空解脫門若淨若不淨，應求無相、無願解脫門若淨若不淨。",
        "translation": "Again, he says, \"Those who practice prajñā should seek the gate of liberation through emptiness if it's permanent or impermanent, the gate of liberation through signlessness and wishlessness if it's permanent or impermanent, the gate of liberation through emptiness if it's pleasant or painful, the gate of liberation through signlessness and wishlessness if it's pleasant or painful, the gate of liberation through emptiness if it's self or selflessness, the gate of liberation through signlessness and wishlessness if it's self or selflessness, and the gate of liberation through emptiness if it's pure or impure and the gate of liberation through signlessness and wishlessness if it's pure or impure.",
        "source": "T05n0220_137:0744a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能求如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can pursue such a path and cultivate prajñā, they're practicing the perfection of prajñā.",
        "source": "T05n0220_137:0744b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_137:0744b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，如是求空解脫門若常若無常，求無相、無願解脫門若常若無常；求空解脫門若樂若苦，求無相、無願解脫門若樂若苦；求空解脫門若我若無我，求無相、無願解脫門若我若無我；求空解脫門若淨若不淨，求無相、無願解脫門若淨若不淨。",
        "translation": "\"If good men and good women thus seek the gate of liberation from emptiness if it's permanent or impermanent, the gate of liberation from signlessness and wishlessness if it's permanent or impermanent, the gate of liberation from emptiness if it's pleasant or painful, the gate of liberation from signlessness and wishlessness if it's pleasant or painful, the gate of liberation from emptiness if it's self or selfless, the gate of liberation from signlessness and wishlessness if it's self or selfless, and the gate of liberation from emptiness if it's pure or impure and the gate of liberation from signlessness and wishlessness if it's pure or impure, then they'll practice prajñāpāramitā on the basis of these things.",
        "source": "T05n0220_137:0744b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此等法行般若者，我說名為行有所得相似般若波羅蜜多。",
        "translation": "Such a practitioner of prajñā based on these things is what I'd call practicing the prajñāpāramitā that's similar to attaining.",
        "source": "T05n0220_137:0744b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_137:0744b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似般若波羅蜜多。",
        "translation": "As explained earlier, you should know that they're all teaching the prajñāpāramitā that's similar to that which has been attained.",
        "source": "T05n0220_137:0744b11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_137:0744b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說五眼若常若無常，說六神通若常若無常；說五眼若樂若苦，說六神通若樂若苦；說五眼若我若無我，說六神通若我若無我；說五眼若淨若不淨，說六神通若淨若不淨。",
        "translation": "\"If good men and good women develop the unsurpassed mind of enlightenment, they say that the five eyes are permanent and impermanent, and they say that the six psychic powers are permanent and impermanent; that the five eyes are pleasant and painful, and they say that the six psychic powers are pleasant and painful; that the five eyes are self and selfless, and they say that the six psychic powers are self and selfless; and that the five eyes are pure and impure, and they say that the six psychic powers are pure and impure.",
        "source": "T05n0220_137:0744b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能依如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can practice prajñā based on such things, they are practicing the perfection of prajñā.",
        "source": "T05n0220_137:0744b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是說：行般若者，應求五眼若常若無常，應求六神通若常若無常；應求五眼若樂若苦，應求六神通若樂若苦；應求五眼若我若無我，應求六神通若我若無我；應求五眼若淨若不淨，應求六神通若淨若不淨。",
        "translation": "Again, he says, \"Those who practice prajñā should seek whether the five eyes are permanent or impermanent, and whether the six supernormal powers are permanent or impermanent; whether the five eyes are pleasant or painful, and whether the six supernormal powers are pleasant or painful; whether the five eyes are self or selfless, and whether the six supernormal powers are self or selfless; and whether the five eyes are pure or impure, and whether the six supernormal powers are pure or impure.",
        "source": "T05n0220_137:0744b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能求如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can pursue such things and cultivate prajñā, they're practicing the perfection of prajñā.",
        "source": "T05n0220_137:0744b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_137:0744b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，如是求五眼若常若無常，求六神通若常若無常；求五眼若樂若苦，求六神通若樂若苦；求五眼若我若無我，求六神通若我若無我；求五眼若淨若不淨，求六神通若淨若不淨。",
        "translation": "\"If good men and good women thus seek the five eyes as permanent or impermanent, the six psychic powers as permanent or impermanent, the five eyes as pleasant or painful, the six psychic powers as pleasant or painful, the five eyes as self or selfless, the six psychic powers as self or selfless, and the five eyes as pure or impure and the six psychic powers as pure or impure, then they'll practice prajñāpāramitā on the basis of these things.",
        "source": "T05n0220_137:0744b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此等法行般若者，我說名為行有所得相似般若波羅蜜多。",
        "translation": "Such a practitioner of prajñā based on these things is what I'd call practicing the prajñāpāramitā that's similar to attaining.",
        "source": "T05n0220_137:0744b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_137:0744c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似般若波羅蜜多。",
        "translation": "As explained earlier, you should know that they're all teaching the prajñāpāramitā that's similar to that which has been attained.",
        "source": "T05n0220_137:0744c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_137:0744c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說佛十力若常若無常，說四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法若常若無常；說佛十力若樂若苦，說四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法若樂若苦；說佛十力若我若無我，說四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法若我若無我；說佛十力若淨若不淨，說四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法若淨若不淨。",
        "translation": "若善男子、善女人等為發無上菩提心者，說佛十力若常若無常，說四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法若常若無常；說佛十力若樂若苦，說四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法若樂若苦；說佛十力若我若無我，說四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法若我若無我；說佛十力若淨若不淨，說四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法若淨若不淨。",
        "source": "T05n0220_137:0744c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能依如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can practice prajñā based on such things, they're practicing prajñā-pāramitā.",
        "source": "T05n0220_137:0744c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是說：行般若者，應求佛十力若常若無常，應求四無所畏乃至十八佛不共法若常若無常；應求佛十力若樂若苦，應求四無所畏乃至十八佛不共法若樂若苦；應求佛十力若我若無我，應求四無所畏乃至十八佛不共法若我若無我；應求佛十力若淨若不淨，應求四無所畏乃至十八佛不共法若淨若不淨。",
        "translation": "Again, he says, \"Those who practice prajñā should seek the Buddha's ten powers if they are permanent or impermanent, the four fearlessnesses and even the 18 Buddha-unequals if they are permanent or impermanent, the Buddha's ten powers if they are pleasant or painful, the four fearlessnesses and even the 18 Buddha-unequals if they are pleasant or painful, the Buddha's ten powers if they are self or selfless, the four fearlessnesses and even the 18 Buddha-unequals if they are self or selfless, and the Buddha's ten powers if they are pure or impure, the four fearlessnesses and even the 18 Buddha-unequals if they are pure or impure.",
        "source": "T05n0220_137:0744c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能求如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can pursue such things and cultivate prajñā, they're practicing the perfection of prajñā.",
        "source": "T05n0220_137:0744c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_137:0744c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，如是求佛十力若常若無常，求四無所畏乃至十八佛不共法若常若無常；求佛十力若樂若苦，求四無所畏乃至十八佛不共法若樂若苦；求佛十力若我若無我，求四無所畏乃至十八佛不共法若我若無我；求佛十力若淨若不淨，求四無所畏乃至十八佛不共法若淨若不淨。",
        "translation": "\"If good men and good women thus seek the Buddha's ten powers as permanent or impermanent, the four unsurpassables and even the 18 Buddha-uncommon dharmas as permanent or impermanent, the Buddha's ten powers as pleasant or painful, the four unsurpassables and even the 18 Buddha-uncommon dharmas as pleasant or painful, the Buddha's ten powers as self or selfless, the four unsurpassables and even the 18 Buddha-uncommon dharmas as self or selfless, and the Buddha's ten powers as pure or impure, the four unsurpassables and even the 18 Buddha-uncommon dharmas as pure or impure, then they'll practice prajñāpāramitā on the basis of these things.",
        "source": "T05n0220_137:0744c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此等法行般若者，我說名為行有所得相似般若波羅蜜多。",
        "translation": "Such a practitioner of prajñā based on these things is what I'd call practicing the prajñāpāramitā that's similar to attaining.",
        "source": "T05n0220_137:0745a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_137:0745a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似般若波羅蜜多。",
        "translation": "As explained earlier, you should know that they're all teaching the prajñāpāramitā that's similar to that which has been attained.",
        "source": "T05n0220_137:0745a02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_137:0745a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說無忘失法若常若無常，說恒住捨性若常若無常；說無忘失法若樂若苦，說恒住捨性若樂若苦；說無忘失法若我若無我，說恒住捨性若我若無我；說無忘失法若淨若不淨，說恒住捨性若淨若不淨。",
        "translation": "\"If good men and good women develop the unsurpassed mind of enlightenment, they say that the absence of forgetfulness is permanent or impermanent, and they say that the nature of eternal equanimity is permanent or impermanent; that the absence of forgetfulness is pleasant or painful, and they say that the nature of eternal equanimity is pleasant or painful; that the absence of forgetfulness is self or selfless, and they say that the nature of eternal equanimity is self or selfless; and that the absence of forgetfulness is pure or impure, and they say that the nature of eternal equanimity is pure or impure.",
        "source": "T05n0220_137:0745a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能依如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can practice prajñā based on such things, they're practicing the perfection of prajñā.",
        "source": "T05n0220_137:0745a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是說：行般若者，應求無忘失法若常若無常，應求恒住捨性若常若無常；應求無忘失法若樂若苦，應求恒住捨性若樂若苦；應求無忘失法若我若無我，應求恒住捨性若我若無我；應求無忘失法若淨若不淨，應求恒住捨性若淨若不淨。",
        "translation": "Again, he says, \"Those who practice prajñā should seek what's without forgetfulness as permanent or impermanent, and what's constantly abiding in equanimity as permanent or impermanent; seek what's without forgetfulness as pleasant or painful, and what's constantly abiding in equanimity as pleasant or painful; seek what's without forgetfulness as self or selfless, and what's constantly abiding in equanimity as self or selfless; and seek what's without forgetfulness as pure or impure, and what's constantly abiding in equanimity as pure or impure.",
        "source": "T05n0220_137:0745a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能求如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can pursue such things and cultivate prajñā, they're practicing the perfection of prajñā.",
        "source": "T05n0220_137:0745a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_137:0745a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，如是求無忘失法若常若無常，求恒住捨性若常若無常；求無忘失法若樂若苦，求恒住捨性若樂若苦；求無忘失法若我若無我，求恒住捨性若我若無我；求無忘失法若淨若不淨，求恒住捨性若淨若不淨。",
        "translation": "\"If good men and good women thus seek the absence of forgetfulness as permanent or impermanent, the nature of permanently abiding equanimity as permanent or impermanent, the absence of forgetfulness as pleasant or painful, and the nature of permanently abiding equanimity as pleasant or painful, the absence of forgetfulness as self or selfless, and the nature of permanently abiding equanimity as self or selfless, and the absence of forgetfulness as pure or impure, and the nature of permanently abiding equanimity as pure or impure, then they'll practice prajñāpāramitā on the basis of these things.",
        "source": "T05n0220_137:0745a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此等法行般若者，我說名為行有所得相似般若波羅蜜多。",
        "translation": "Such a practitioner of prajñā based on these things is what I'd call practicing the prajñāpāramitā that's similar to attaining.",
        "source": "T05n0220_137:0745a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_137:0745a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似般若波羅蜜多。",
        "translation": "As explained earlier, you should know that they're all teaching the prajñāpāramitā that's similar to that which has been attained.",
        "source": "T05n0220_137:0745a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_137:0745a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說一切智若常若無常，說道相智、一切相智若常若無常；說一切智若樂若苦，說道相智、一切相智若樂若苦；說一切智若我若無我，說道相智、一切相智若我若無我；說一切智若淨若不淨，說道相智、一切相智若淨若不淨。",
        "translation": "\"If good men and good women develop the unsurpassed mind of enlightenment, they say that all cognition is permanent and impermanent, and they say that knowledge of the path and knowledge of all characteristics is permanent and impermanent; that all cognition is pleasant and painful, and they say that knowledge of the path and knowledge of all characteristics is pleasant and painful; that all cognition is self and selfless, and they say that knowledge of the path and knowledge of all characteristics is self and selfless; and that all cognition is pure and impure, and they say that knowledge of the path and knowledge of all characteristics is pure and impure.",
        "source": "T05n0220_137:0745a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能依如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can practice prajñā based on such things, they're practicing prajñā-pāramitā.",
        "source": "T05n0220_137:0745b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是說：行般若者，應求一切智若常若無常，應求道相智、一切相智若常若無常；應求一切智若樂若苦，應求道相智、一切相智若樂若苦；應求一切智若我若無我，應求道相智、一切相智若我若無我；應求一切智若淨若不淨，應求道相智、一切相智若淨若不淨。",
        "translation": "Again, he says, \"Those who practice prajñā should seek whether omniscience is permanent or impermanent, whether the knowledge of the path and omniscience is permanent or impermanent, whether omniscience is pleasant or painful, whether the knowledge of the path and omniscience is pleasant or painful, whether omniscience is self or selfless, whether the knowledge of the path and omniscience is self or selfless, and whether omniscience is pure or impure and whether the knowledge of the path and omniscience is pure or impure.",
        "source": "T05n0220_137:0745b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能求如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can pursue such things and cultivate prajñā, they're practicing the perfection of prajñā.",
        "source": "T05n0220_137:0745b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_137:0745b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，如是求一切智若常若無常，求道相智、一切相智若常若無常；求一切智若樂若苦，求道相智、一切相智若樂若苦；求一切智若我若無我，求道相智、一切相智若我若無我；求一切智若淨若不淨，求道相智、一切相智若淨若不淨。",
        "translation": "\"If good men and good women thus seek omniscience as permanent or impermanent, knowledge of the path and knowledge of all characteristics as permanent or impermanent, omniscience as pleasant or painful, knowledge of the path and knowledge of all characteristics as pleasant or painful, omniscience as self or selfless, knowledge of the path and knowledge of all characteristics as self or selfless, and omniscience as pure or impure, knowledge of the path and knowledge of all characteristics as pure or impure, then they'll practice prajñāpāramitā on the basis of these things.",
        "source": "T05n0220_137:0745b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此等法行般若者，我說名為行有所得相似般若波羅蜜多。",
        "translation": "Such a practitioner of prajñā based on these things is what I'd call practicing the prajñāpāramitā that's similar to attaining.",
        "source": "T05n0220_137:0745b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_137:0745b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似般若波羅蜜多。",
        "translation": "As explained earlier, you should know that they're all teaching the prajñāpāramitā that's similar to that which has been attained.",
        "source": "T05n0220_137:0745b19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_137:0745b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說一切陀羅尼門若常若無常，說一切三摩地門若常若無常；說一切陀羅尼門若樂若苦，說一切三摩地門若樂若苦；說一切陀羅尼門若我若無我，說一切三摩地門若我若無我；說一切陀羅尼門若淨若不淨，說一切三摩地門若淨若不淨。",
        "translation": "\"If good men and good women develop the unsurpassed mind of enlightenment, they say that all dhāraṇī teachings are permanent and impermanent, and all samādhi teachings are permanent and impermanent; that all dhāraṇī teachings are pleasant and painful, and all samādhi teachings are pleasant and painful; that all dhāraṇī teachings are self and selfless, and all samādhi teachings are self and selfless; and that all dhāraṇī teachings are pure and impure, and that all samādhi teachings are pure and impure.",
        "source": "T05n0220_137:0745b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能依如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can practice prajñā based on such things, they're practicing prajñā-pāramitā.",
        "source": "T05n0220_137:0745b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是說：行般若者，應求一切陀羅尼門若常若無常，應求一切三摩地門若常若無常；應求一切陀羅尼門若樂若苦，應求一切三摩地門若樂若苦；應求一切陀羅尼門若我若無我，應求一切三摩地門若我若無我；應求一切陀羅尼門若淨若不淨，應求一切三摩地門若淨若不淨。",
        "translation": "Again, he says, \"Those who practice prajñā should seek all dhāraṇī gates whether permanent or impermanent, all concentration gates whether permanent or impermanent, all dhāraṇī gates whether pleasant or painful, and all concentration gates whether pleasant or painful, all dhāraṇī gates whether self or selfless, and all concentration gates whether self or selfless, and all dhāraṇī gates whether pure or impure, and all concentration gates whether pure or impure.",
        "source": "T05n0220_137:0745b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能求如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can pursue such things and cultivate prajñā, they're practicing the perfection of prajñā.",
        "source": "T05n0220_137:0745c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_137:0745c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，如是求一切陀羅尼門若常若無常，求一切三摩地門若常若無常；求一切陀羅尼門若樂若苦，求一切三摩地門若樂若苦；求一切陀羅尼門若我若無我，求一切三摩地門若我若無我；求一切陀羅尼門若淨若不淨，求一切三摩地門若淨若不淨。",
        "translation": "\"If good men and good women thus seek all dhāraṇī gates whether permanent or impermanent, all samādhi gates whether permanent or impermanent, all dhāraṇī gates whether pleasant or painful, all samādhi gates whether pleasant or painful, all dhāraṇī gates whether self or no-self, all samādhi gates whether self or no-self, and all dhāraṇī gates whether pure or impure, all samādhi gates whether pure or impure, then they'll practice prajñāpāramitā on the basis of these things.",
        "source": "T05n0220_137:0745c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此等法行般若者，我說名為行有所得相似般若波羅蜜多。",
        "translation": "Such a practitioner of prajñā based on these things is what I'd call practicing the prajñāpāramitā that's similar to attaining.",
        "source": "T05n0220_137:0745c13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_137:0745c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似般若波羅蜜多。",
        "translation": "As explained earlier, you should know that they're all teaching the prajñāpāramitā that's similar to that which has been attained.",
        "source": "T05n0220_137:0745c15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_137:0745c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說預流向預流果若常若無常，說一來向一來果、不還向不還果、阿羅漢向阿羅漢果若常若無常；說預流向預流果若樂若苦，說一來向一來果、不還向不還果、阿羅漢向阿羅漢果若樂若苦；說預流向預流果若我若無我，說一來向一來果、不還向不還果、阿羅漢向阿羅漢果若我若無我；說預流向預流果若淨若不淨，說一來向一來果、不還向不還果、阿羅漢向阿羅漢果若淨若不淨。",
        "translation": "若善男子、善女人等為發無上菩提心者，說預流向預流果若常若無常，說一來向一來果、不還向不還果、阿羅漢向阿羅漢果若常若無常；說預流向預流果若樂若苦，說一來向一來果、不還向不還果、阿羅漢向阿羅漢果若樂若苦；說預流向預流果若我若無我，說一來向一來果、不還向不還果、阿羅漢向阿羅漢果若我若無我；說預流向預流果若淨若不淨，說一來向一來果、不還向不還果、阿羅漢向阿羅漢果若淨若不淨。",
        "source": "T05n0220_137:0745c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能依如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can practice prajñā based on such things, they are practicing the perfection of prajñā.",
        "source": "T05n0220_137:0745c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是說：行般若者，應求預流向預流果若常若無常，應求一來向乃至阿羅漢果若常若無常；應求預流向預流果若樂若苦，應求一來向乃至阿羅漢果若樂若苦；應求預流向預流果若我若無我，應求一來向乃至阿羅漢果若我若無我；應求預流向預流果若淨若不淨，應求一來向乃至阿羅漢果若淨若不淨。",
        "translation": "Again, he says, \"Those who practice prajñāpāramitā should seek whether the fruit of stream-winner or stream-returner is permanent or impermanent, and whether the fruit of one coming or even the arhat is permanent or impermanent; whether the fruit of stream-winner or stream-returner is pleasant or painful, and whether the fruit of one coming or even the arhat is pleasant or painful; whether the fruit of stream-winner or stream-returner is self or selfless, and whether the fruit of one coming or even the arhat is self or selfless; and whether the fruit of stream-winner or stream-returner is pure or impure, and whether the fruit of one coming or even the arhat is pure or impure.",
        "source": "T05n0220_137:0745c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能求如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can pursue such a path and cultivate prajñā, they're practicing the perfection of prajñā.",
        "source": "T05n0220_137:0746a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_137:0746a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，如是求預流向預流果若常若無常，求一來向乃至阿羅漢果若常若無常；求預流向預流果若樂若苦，求一來向乃至阿羅漢果若樂若苦；求預流向預流果若我若無我，求一來向乃至阿羅漢果若我若無我；求預流向預流果若淨若不淨，求一來向乃至阿羅漢果若淨若不淨。",
        "translation": "\"If good men and good women thus seek the fruit of stream-winner and stream-returner whether permanent or impermanent, seek the fruit of one coming to the arhat whether permanent or impermanent, seek the fruit of stream-winner and stream-returner whether pleasant or painful, seek the fruit of one coming to the arhat whether pleasant or painful, seek the fruit of stream-winner and stream-returner whether self or selfless, seek the fruit of one coming to the arhat whether self or selfless, and seek the fruit of stream-winner and stream-returner whether pure or impure, and seek the fruit of one coming to the arhat whether pure or impure.",
        "source": "T05n0220_137:0746a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此等法行般若者，我說名為行有所得相似般若波羅蜜多。",
        "translation": "Such a practitioner of prajñā based on these things is what I'd call practicing the prajñāpāramitā that's like attaining something.",
        "source": "T05n0220_137:0746a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_137:0746a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似般若波羅蜜多。",
        "translation": "As explained earlier, you should know that they're all teaching the prajñāpāramitā that's similar to that which has been attained.",
        "source": "T05n0220_137:0746a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_137:0746a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說一切獨覺菩提若常若無常，說一切獨覺菩提若樂若苦，說一切獨覺菩提若我若無我，說一切獨覺菩提若淨若不淨。",
        "translation": "\"If good men and good women develop the unsurpassed mind of enlightenment, they say that all the individually enlightened bodhisattvas are permanent or impermanent, that all the individually enlightened bodhisattvas are pleasant or painful, that all the individually enlightened bodhisattvas are self or selfless, and that all the individually enlightened bodhisattvas are pure or impure.",
        "source": "T05n0220_137:0746a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能依如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can practice prajñā based on such things, this is the practice of prajñā-pāramitā.",
        "source": "T05n0220_137:0746a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是說：行般若者，應求一切獨覺菩提若常若無常，應求一切獨覺菩提若樂若苦，應求一切獨覺菩提若我若無我，應求一切獨覺菩提若淨若不淨。",
        "translation": "Again, he says, \"Those who practice prajñā should seek all the individually enlightened bodhisattvas whether permanent or impermanent, all the individually enlightened bodhisattvas whether pleasant or painful, all the individually enlightened bodhisattvas whether self or selfless, and all the individually enlightened bodhisattvas whether pure or impure.",
        "source": "T05n0220_137:0746a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能求如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can pursue such things and cultivate prajñā, they're practicing the perfection of prajñā.",
        "source": "T05n0220_137:0746a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_137:0746a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，如是求一切獨覺菩提若常若無常，求一切獨覺菩提若樂若苦，求一切獨覺菩提若我若無我，求一切獨覺菩提若淨若不淨。",
        "translation": "\"If good men and good women thus seek all the independently enlightened bodhisattvas whether permanent or impermanent, all the independently enlightened bodhisattvas whether pleasant or painful, all the independently enlightened bodhisattvas whether self or selfless, and all the independently enlightened bodhisattvas whether pure or impure, then they'll practice prajñāpāramitā on the basis of these things.",
        "source": "T05n0220_137:0746a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此等法行般若者，我說名為行有所得相似般若波羅蜜多。",
        "translation": "Someone who practices prajñā based on these things is, I say, practicing the prajñā-pāramitā that's similar to attaining.",
        "source": "T05n0220_137:0746b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_137:0746b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似般若波羅蜜多。",
        "translation": "As explained earlier, you should know that they're all teaching the prajñāpāramitā that's similar to that which has been attained.",
        "source": "T05n0220_137:0746b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_137:0746b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說一切菩薩摩訶薩行若常若無常，說一切菩薩摩訶薩行若樂若苦，說一切菩薩摩訶薩行若我若無我，說一切菩薩摩訶薩行若淨若不淨。",
        "translation": "\"If good men and good women develop the unsurpassed mind of enlightenment, they will teach that all bodhisattva-mahāsattva practices are permanent or impermanent, that all bodhisattva-mahāsattva practices are pleasant or painful, that all bodhisattva-mahāsattva practices are self or selfless, and that all bodhisattva-mahāsattva practices are pure or impure.",
        "source": "T05n0220_137:0746b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能依如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can cultivate prajñā based on such things, they are practicing the perfection of prajñā.",
        "source": "T05n0220_137:0746b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是說：行般若者，應求一切菩薩摩訶薩行若常若無常，應求一切菩薩摩訶薩行若樂若苦，應求一切菩薩摩訶薩行若我若無我，應求一切菩薩摩訶薩行若淨若不淨。",
        "translation": "Again, he says, \"Those who practice prajñā should seek whether all bodhisattva-mahāsattva practices are permanent or impermanent, whether all bodhisattva-mahāsattva practices are pleasant or painful, whether all bodhisattva-mahāsattva practices are self or selfless, and whether all bodhisattva-mahāsattva practices are pure or impure.",
        "source": "T05n0220_137:0746b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能求如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can pursue such things and cultivate prajñā, they're practicing the perfection of prajñā.",
        "source": "T05n0220_137:0746b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_137:0746b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，如是求一切菩薩摩訶薩行若常若無常，求一切菩薩摩訶薩行若樂若苦，求一切菩薩摩訶薩行若我若無我，求一切菩薩摩訶薩行若淨若不淨。",
        "translation": "\"If good men and good women thus seek all bodhisattva-mahāsattva practices as permanent or impermanent, all bodhisattva-mahāsattva practices as pleasant or painful, all bodhisattva-mahāsattva practices as self or selfless, and all bodhisattva-mahāsattva practices as pure or impure, then they'll practice prajñāpāramitā on the basis of these things.",
        "source": "T05n0220_137:0746b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此等法行般若者，我說名為行有所得相似般若波羅蜜多。",
        "translation": "Such a practitioner of prajñā based on these things is what I'd call practicing the prajñāpāramitā that's similar to attaining something.",
        "source": "T05n0220_137:0746b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_137:0746b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似般若波羅蜜多。",
        "translation": "As explained earlier, you should know that they're all teaching the prajñāpāramitā that's similar to that which has been attained.",
        "source": "T05n0220_137:0746b22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_137:0746b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說諸佛無上正等菩提若常若無常，說諸佛無上正等菩提若樂若苦，說諸佛無上正等菩提若我若無我，說諸佛無上正等菩提若淨若不淨。",
        "translation": "\"If good men and good women develop the unsurpassed mind of enlightenment, they say that the unsurpassed correct enlightenment of the buddhas is permanent and impermanent, that the unsurpassed correct enlightenment of the buddhas is pleasant and painful, that the unsurpassed correct enlightenment of the buddhas is self and selfless, and that the unsurpassed correct enlightenment of the buddhas is pure and impure.",
        "source": "T05n0220_137:0746b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能依如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can cultivate prajñā based on such things, they are practicing the perfection of prajñā.",
        "source": "T05n0220_137:0746b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是說：行般若者，應求諸佛無上正等菩提若常若無常，應求諸佛無上正等菩提若樂若苦，應求諸佛無上正等菩提若我若無我，應求諸佛無上正等菩提若淨若不淨。",
        "translation": "Again, he says, \"Those who practice prajñā should seek the buddhas' unsurpassed correct enlightenment whether it's permanent or impermanent, seek the buddhas' unsurpassed correct enlightenment whether it's pleasant or painful, seek the buddhas' unsurpassed correct enlightenment whether it's self or selfless, and seek the buddhas' unsurpassed correct enlightenment whether it's pure or impure.",
        "source": "T05n0220_137:0746b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能求如是等法修行般若，是行般若波羅蜜多。",
        "translation": "If someone can pursue such things and cultivate prajñā, they're practicing the perfection of prajñā.",
        "source": "T05n0220_137:0746c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_137:0746c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，如是求諸佛無上正等菩提若常若無常，求諸佛無上正等菩提若樂若苦，求諸佛無上正等菩提若我若無我，求諸佛無上正等菩提若淨若不淨。",
        "translation": "\"If good men and good women thus seek the buddhas' unsurpassed correct enlightenment whether permanent or impermanent, the buddhas' unsurpassed correct enlightenment whether pleasant or painful, the buddhas' unsurpassed correct enlightenment whether self or no-self, and the buddhas' unsurpassed correct enlightenment whether pure or impure, then they'll practice prajñāpāramitā on the basis of these things, which I call the practice of attained-like prajñāpāramitā.",
        "source": "T05n0220_137:0746c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此等法行般若者，我說名為行有所得相似般若波羅蜜多。",
        "translation": "Such a practitioner of prajñā based on these things is what I'd call practicing the prajñāpāramitā that's similar to attaining something.",
        "source": "T05n0220_137:0746c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_137:0746c11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似般若波羅蜜多。」",
        "translation": "As was explained earlier, you should know that these are all explained as having attained similar prajñāpāramitā.\"",
        "source": "T05n0220_137:0746c11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，天帝釋復白佛言：「世尊！",
        "translation": "Then, Śakra again said to the Buddha, \"Bhagavān!",
        "source": "T05n0220_137:0746c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何諸善男子、善女人等說有所得靜慮波羅蜜多名說相似靜慮波羅蜜多？」",
        "translation": "How do good men and good women say there's the perfection of meditation and how do they say it's like the perfection of meditation?\"",
        "source": "T05n0220_137:0746c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「憍尸迦！",
        "translation": "The Buddha said, \"Kauśika!",
        "source": "T05n0220_137:0746c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說色若常若無常，說受、想、行、識若常若無常；說色若樂若苦，說受、想、行、識若樂若苦；說色若我若無我，說受、想、行、識若我若無我；說色若淨若不淨，說受、想、行、識若淨若不淨。",
        "translation": "\"If good men and good women develop the unsurpassed mind of enlightenment, they will say whether form is permanent or impermanent, whether feeling, perception, volition, and consciousness are permanent or impermanent, whether form is pleasant or painful, whether feeling, perception, volition, and consciousness are pleasant or painful, whether form is self or selfless, whether feeling, perception, volition, and consciousness are self or selfless, and whether form is pure or impure and whether feeling, perception, volition, and consciousness are pure or impure.",
        "source": "T05n0220_137:0746c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能依如是等法修行靜慮，是行靜慮波羅蜜多。",
        "translation": "If someone can cultivate meditation based on such things, this is the perfection of practice of meditation.",
        "source": "T05n0220_137:0746c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是說：行靜慮者，應求色若常若無常，應求受、想、行、識若常若無常；應求色若樂若苦，應求受、想、行、識若樂若苦；應求色若我若無我，應求受、想、行、識若我若無我；應求色若淨若不淨，應求受、想、行、識若淨若不淨。",
        "translation": "Again, he says, \"Those who practice meditation should seek form if it's permanent or impermanent, form of feeling, perception, volition, and consciousness if it's permanent or impermanent, form of pleasure or pain, and form of feeling, perception, volition, and consciousness if it's pleasant or painful, form of self or selflessness, and form of feeling, perception, volition, and consciousness if it's self or selflessness, and form of purity or impurity and form of feeling, perception, volition, and consciousness if it's pure or impure.",
        "source": "T05n0220_137:0746c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能求如是等法修行靜慮，是行靜慮波羅蜜多。",
        "translation": "If someone can pursue such things and cultivate meditation, they're practicing the perfection of meditation.",
        "source": "T05n0220_137:0746c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_137:0746c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，如是求色若常若無常，求受、想、行、識若常若無常；求色若樂若苦，求受、想、行、識若樂若苦；求色若我若無我，求受、想、行、識若我若無我；求色若淨若不淨，求受、想、行、識若淨若不淨。",
        "translation": "\"If good men and good women thus seek form if it's permanent or impermanent, seek feeling, perception, volition, and consciousness if it's permanent or impermanent, seek form if it's pleasant or painful, seek feeling, perception, volition, and consciousness if it's pleasant or painful, seek form if it's self or selfless, seek feeling, perception, volition, and consciousness if it's self or selfless, and seek form if it's pure or impure, and seek feeling, perception, volition, and consciousness if it's pure or impure, then they'll be able to practice meditation based on these things.",
        "source": "T05n0220_137:0746c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此等法行靜慮者，我說名為行有所得相似靜慮波羅蜜多。",
        "translation": "Someone who practices meditation based on these things is, I say, practicing the perfection of attained-like meditation.",
        "source": "T05n0220_137:0747a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_137:0747a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似靜慮波羅蜜多。",
        "translation": "As explained earlier, you should know that these are all explained as the perfection of attained similar meditation.",
        "source": "T05n0220_137:0747a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_137:0747a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說眼處若常若無常，說耳、鼻、舌、身、意處若常若無常；說眼處若樂若苦，說耳、鼻、舌、身、意處若樂若苦；說眼處若我若無我，說耳、鼻、舌、身、意處若我若無我；說眼處若淨若不淨，說耳、鼻、舌、身、意處若淨若不淨。",
        "translation": "\"If good men and good women develop the unsurpassed mind of enlightenment, they say that the locus of the eye is permanent and impermanent, and they say that the locus of the ear, nose, tongue, body, and mind is permanent and impermanent; that the locus of the eye is pleasant and painful, and they say that the locus of the ear, nose, tongue, body, and mind is pleasant and painful; that the locus of the eye is self and selfless, and they say that the locus of the ear, nose, tongue, body, and mind is self and selfless; and that the locus of the eye is pure and impure, and they say that the locus of the ear, nose, tongue, body, and mind is pure and impure.",
        "source": "T05n0220_137:0747a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能依如是等法修行靜慮，是行靜慮波羅蜜多。",
        "translation": "If someone can cultivate meditation based on such things, this is the perfection of practicing meditation.",
        "source": "T05n0220_137:0747a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是說：行靜慮者，應求眼處若常若無常，應求耳、鼻、舌、身、意處若常若無常；應求眼處若樂若苦，應求耳、鼻、舌、身、意處若樂若苦；應求眼處若我若無我，應求耳、鼻、舌、身、意處若我若無我；應求眼處若淨若不淨，應求耳、鼻、舌、身、意處若淨若不淨。",
        "translation": "Again, he says, \"When someone practices meditation, they should seek what's permanent or impermanent in the eye, what's permanent or impermanent in the ear, nose, tongue, body, and mind, what's pleasant or painful in the eye, what's pleasant or painful in the ear, nose, tongue, body, and mind, what's self or selfless in the eye, what's self or selfless in the ear, nose, tongue, body, and mind, and what's pure or impure in the eye and what's pure or impure in the ear, nose, tongue, body, and mind.",
        "source": "T05n0220_137:0747a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能求如是等法修行靜慮，是行靜慮波羅蜜多。",
        "translation": "If someone can pursue such a course of cultivating meditation, they're practicing the perfection of meditation.",
        "source": "T05n0220_137:0747a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_137:0747a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，如是求眼處若常若無常，求耳、鼻、舌、身、意處若常若無常；求眼處若樂若苦，求耳、鼻、舌、身、意處若樂若苦；求眼處若我若無我，求耳、鼻、舌、身、意處若我若無我；求眼處若淨若不淨，求耳、鼻、舌、身、意處若淨若不淨。",
        "translation": "\"If good men and good women thus seek the locus of the eye as permanent or impermanent, the locus of the ear, nose, tongue, body, and mind as permanent or impermanent, the locus of the eye as pleasant or painful, the locus of the ear, nose, tongue, body, and mind as pleasant or painful, the locus of the eye as self or selfless, and the locus of the ear, nose, tongue, body, and mind as self or selfless, and the locus of the eye as pure or impure and the locus of the ear, nose, tongue, body, and mind as pure or impure, then they'll practice meditation based on these principles, which I've described as the practice of the attainment of similar meditation.",
        "source": "T05n0220_137:0747a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此等法行靜慮者，我說名為行有所得相似靜慮波羅蜜多。",
        "translation": "Someone who practices meditation based on these things is, I say, practicing the perfection of attained-like meditation.",
        "source": "T05n0220_137:0747a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_137:0747a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似靜慮波羅蜜多。",
        "translation": "As explained earlier, you should know that these are all explained as the perfection of attained similar meditation.",
        "source": "T05n0220_137:0747a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_137:0747a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說色處若常若無常，說聲、香、味、觸、法處若常若無常；說色處若樂若苦，說聲、香、味、觸、法處若樂若苦；說色處若我若無我，說聲、香、味、觸、法處若我若無我；說色處若淨若不淨，說聲、香、味、觸、法處若淨若不淨。",
        "translation": "\"Suppose good men and good women develop the unsurpassed mind of enlightenment by teaching that the sense-field of form is permanent or impermanent, and the sense-field of sound, odor, taste, touch, and dharma is permanent or impermanent; that the sense-field of form is pleasant or painful, and the sense-field of sound, odor, taste, touch, and dharma is pleasant or painful; that the sense-field of form is self or selfless, and the sense-field of sound, odor, taste, touch, and dharma is self or selfless; and that the sense-field of form is pure or impure, and the sense-field of sound, odor, taste, touch, and dharma is pure or impure.",
        "source": "T05n0220_137:0747a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能依如是等法修行靜慮，是行靜慮波羅蜜多。",
        "translation": "If someone can cultivate meditation based on such things, this is the perfection of practicing meditation.",
        "source": "T05n0220_137:0747b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是說：行靜慮者，應求色處若常若無常，應求聲、香、味、觸、法處若常若無常；應求色處若樂若苦，應求聲、香、味、觸、法處若樂若苦；應求色處若我若無我，應求聲、香、味、觸、法處若我若無我；應求色處若淨若不淨，應求聲、香、味、觸、法處若淨若不淨。",
        "translation": "Again, he says, \"When someone practices meditation, they should seek form as permanent or impermanent, and they should seek sound, odor, taste, touch, and the dharma as permanent or impermanent; they should seek form as pleasant or painful, and they should seek sound, odor, taste, touch, and the dharma as pleasant or painful; they should seek form as self or selfless, and they should seek sound, odor, taste, touch, and the dharma as self or selfless; and they should seek form as pure or impure, and they should seek sound, odor, taste, touch, and the dharma as pure or impure.",
        "source": "T05n0220_137:0747b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能求如是等法修行靜慮，是行靜慮波羅蜜多。",
        "translation": "If someone can pursue such things and cultivate meditation, they're practicing the perfection of meditation.",
        "source": "T05n0220_137:0747b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_137:0747b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，如是求色處若常若無常，求聲、香、味、觸、法處若常若無常；求色處若樂若苦，求聲、香、味、觸、法處若樂若苦；求色處若我若無我，求聲、香、味、觸、法處若我若無我；求色處若淨若不淨，求聲、香、味、觸、法處若淨若不淨。",
        "translation": "\"If good men and good women thus seek form as permanent or impermanent, the sense-fields of sound, odor, taste, touch, and dharma as permanent or impermanent, form as pleasant or painful, and the sense-fields of sound, odor, taste, touch, and dharma as pleasant or painful, form as self or selfless, and the sense-fields of sound, odor, taste, touch, and dharma as self or selfless, and form as pure or impure and the sense-fields of sound, odor, taste, touch, and dharma as pure or impure, then they'll practice meditation based on these things.",
        "source": "T05n0220_137:0747b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此等法行靜慮者，我說名為行有所得相似靜慮波羅蜜多。",
        "translation": "Someone who practices meditation based on these things is, I say, practicing the perfection of attained-like meditation.",
        "source": "T05n0220_137:0747b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_137:0747b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似靜慮波羅蜜多。",
        "translation": "As explained earlier, you should know that these are all explained as the perfection of attained similar meditation.",
        "source": "T05n0220_137:0747b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_137:0747b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說眼界若常若無常，說色界、眼識界及眼觸、眼觸為緣所生諸受若常若無常；說眼界若樂若苦，說色界、眼識界及眼觸、眼觸為緣所生諸受若樂若苦；說眼界若我若無我，說色界、眼識界及眼觸、眼觸為緣所生諸受若我若無我；說眼界若淨若不淨，說色界、眼識界及眼觸、眼觸為緣所生諸受若淨若不淨。",
        "translation": "\"Suppose good men and good women develop the unsurpassed mind of enlightenment by teaching whether the eye realm is permanent or impermanent, whether the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as conditions are permanent or impermanent, whether the eye realm is pleasant or painful, whether the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as conditions are pleasant or painful, whether the eye realm is self or selfless, whether the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as conditions are self or selfless, and whether the eye realm is pure or impure, and whether the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as conditions are pure or impure.",
        "source": "T05n0220_137:0747b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能依如是等法修行靜慮，是行靜慮波羅蜜多。",
        "translation": "If someone can cultivate meditation based on such things, this is the perfection of practice of meditation.",
        "source": "T05n0220_137:0747b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是說：行靜慮者，應求眼界若常若無常，應求色界乃至眼觸為緣所生諸受若常若無常；應求眼界若樂若苦，應求色界乃至眼觸為緣所生諸受若樂若苦；應求眼界若我若無我，應求色界乃至眼觸為緣所生諸受若我若無我；應求眼界若淨若不淨，應求色界乃至眼觸為緣所生諸受若淨若不淨。",
        "translation": "Again, he says, \"When someone practices meditation, they should seek whether the eye realm is permanent or impermanent, and whether the form realm and the feelings that arise from the condition of eye contact are permanent or impermanent; whether the eye realm is pleasant or painful, and whether the form realm and the feelings that arise from the condition of eye contact are pleasant or painful; whether the eye realm is self or selfless, and whether the form realm and the feelings that arise from the condition of eye contact are self or selfless; and whether the eye realm is pure or impure, and whether the form realm and the feelings that arise from the condition of eye contact are pure or impure.",
        "source": "T05n0220_137:0747c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能求如是等法修行靜慮，是行靜慮波羅蜜多。",
        "translation": "If someone can pursue such things and cultivate meditation, they're practicing the perfection of meditation.",
        "source": "T05n0220_137:0747c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_137:0747c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，如是求眼界若常若無常，求色界乃至眼觸為緣所生諸受若常若無常；求眼界若樂若苦，求色界乃至眼觸為緣所生諸受若樂若苦；求眼界若我若無我，求色界乃至眼觸為緣所生諸受若我若無我；求眼界若淨若不淨，求色界乃至眼觸為緣所生諸受若淨若不淨。",
        "translation": "\"If good men and good women thus seek whether the eye realm is permanent or impermanent, whether the form realm and even the sensations that arise from the condition of eye contact are permanent or impermanent, whether the eye realm is pleasant or painful, whether the form realm and even the sensations that arise from the condition of eye contact are pleasant or painful, whether the eye realm is self or selfless, whether the form realm and even the sensations that arise from the condition of eye contact are self or selfless, and whether the eye realm is pure or impure and whether the form realm and even the sensations that arise from the condition of eye contact are pure or impure, then they'll practice meditation based on these things.",
        "source": "T05n0220_137:0747c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此等法行靜慮者，我說名為行有所得相似靜慮波羅蜜多。",
        "translation": "When someone practices meditation based on these things, I call it the practice of the perfection of attained-like meditation.",
        "source": "T05n0220_137:0747c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_137:0747c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似靜慮波羅蜜多。",
        "translation": "As explained earlier, you should know that these are all explained as the perfection of attained similar meditation.",
        "source": "T05n0220_137:0747c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_137:0747c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說耳界若常若無常，說聲界、耳識界及耳觸、耳觸為緣所生諸受若常若無常；說耳界若樂若苦，說聲界、耳識界及耳觸、耳觸為緣所生諸受若樂若苦；說耳界若我若無我，說聲界、耳識界及耳觸、耳觸為緣所生諸受若我若無我；說耳界若淨若不淨，說聲界、耳識界及耳觸、耳觸為緣所生諸受若淨若不淨。",
        "translation": "\"If good men and good women develop the unsurpassed mind of enlightenment, they say that the ear realm is permanent or impermanent, and they say that the sense-world of sound, the sense-world of ear consciousness, and the sensations that arise from ear contact and ear contact are permanent or impermanent; they say that the ear realm is pleasant or painful, and they say that the sense-world of sound, the sense-world of ear consciousness, and the sensations that arise from ear contact and ear contact are pleasant or painful; they say that the ear realm is self or selfless, and they say that the sense-world of sound, the sense-world of ear consciousness, and the sensations that arise from ear contact and ear contact are self or selfless; and they say that the ear realm is pure or impure, and they say that the sense-world of sound, the sense-world of ear consciousness, and the sensations that arise from ear contact and ear contact are pure or impure.",
        "source": "T05n0220_137:0747c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能依如是等法修行靜慮，是行靜慮波羅蜜多。",
        "translation": "If someone can cultivate meditation based on such things, this is the perfection of practice of meditation.",
        "source": "T05n0220_137:0747c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是說：行靜慮者，應求耳界若常若無常，應求聲界乃至耳觸為緣所生諸受若常若無常；應求耳界若樂若苦，應求聲界乃至耳觸為緣所生諸受若樂若苦；應求耳界若我若無我，應求聲界乃至耳觸為緣所生諸受若我若無我；應求耳界若淨若不淨，應求聲界乃至耳觸為緣所生諸受若淨若不淨。",
        "translation": "Again, he says, \"When someone practices meditation, they should seek whether the ear realm is permanent or impermanent, whether the sound realm and the feelings that arise from the condition of ear contact are permanent or impermanent, whether the ear realm is pleasant or painful, whether the feelings that arise from the condition of sound and ear contact are pleasant or painful, whether the ear realm is self or selfless, whether the feelings that arise from the condition of sound and ear contact are self or selfless, and whether the ear realm is pure or impure, and whether the feelings that arise from the condition of sound and ear contact are pure or impure.",
        "source": "T05n0220_137:0747c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能求如是等法修行靜慮，是行靜慮波羅蜜多。",
        "translation": "If someone can pursue such a course of cultivating meditation, they're practicing the perfection of meditation.",
        "source": "T05n0220_137:0748a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_137:0748a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，如是求耳界若常若無常，求聲界乃至耳觸為緣所生諸受若常若無常；求耳界若樂若苦，求聲界乃至耳觸為緣所生諸受若樂若苦；求耳界若我若無我，求聲界乃至耳觸為緣所生諸受若我若無我；求耳界若淨若不淨，求聲界乃至耳觸為緣所生諸受若淨若不淨。",
        "translation": "\"If good men and good women thus seek whether the ear realm is permanent or impermanent, whether the sound realm and the sensations that arise from ear contact are permanent or impermanent, whether the ear realm is pleasant or painful, whether the sensations that arise from the sound realm and ear contact are pleasant or painful, whether the ear realm is self or selfless, whether the sensations that arise from the sound realm and ear contact are self or selfless, and whether the ear realm is pure or impure, whether the sensations that arise from the sound realm and ear contact are pure or impure, then they'll practice meditation based on these things.",
        "source": "T05n0220_137:0748a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此等法行靜慮者，我說名為行有所得相似靜慮波羅蜜多。",
        "translation": "When someone practices meditation based on these things, I call it the practice of the perfection of attained-like meditation.",
        "source": "T05n0220_137:0748a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_137:0748a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似靜慮波羅蜜多。",
        "translation": "As explained earlier, you should know that these are all explained as the perfection of attained similar meditation.",
        "source": "T05n0220_137:0748a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_137:0748a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說鼻界若常若無常，說香界、鼻識界及鼻觸、鼻觸為緣所生諸受若常若無常；說鼻界若樂若苦，說香界、鼻識界及鼻觸、鼻觸為緣所生諸受若樂若苦；說鼻界若我若無我，說香界、鼻識界及鼻觸、鼻觸為緣所生諸受若我若無我；說鼻界若淨若不淨，說香界、鼻識界及鼻觸、鼻觸為緣所生諸受若淨若不淨。",
        "translation": "\"If good men and good women develop the unsurpassed mind of enlightenment, they say whether the nasal realm is permanent or impermanent, whether the sensations that arise from the sense realm of fragrance, nasal consciousness, and nasal contact and nasal contact as conditions are permanent or impermanent; whether the nasal realm is pleasant or painful, whether the sensations that arise from the sense realm of fragrance, nasal consciousness, and nasal contact and nasal contact as conditions are pleasant or painful; whether the nasal realm is self or selfless, whether the sensations that arise from the sense realm of fragrance, nasal consciousness, and nasal contact and nasal contact as conditions are self or selfless; and whether the nasal realm is pure or impure, whether the sensations that arise from the sense realm of fragrance, nasal consciousness, and nasal contact and nasal contact as conditions are pure or impure.",
        "source": "T05n0220_137:0748a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能依如是等法修行靜慮，是行靜慮波羅蜜多。",
        "translation": "If someone can cultivate meditation based on such things, this is the perfection of practice of meditation.",
        "source": "T05n0220_137:0748a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是說：行靜慮者，應求鼻界若常若無常，應求香界乃至鼻觸為緣所生諸受若常若無常；應求鼻界若樂若苦，應求香界乃至鼻觸為緣所生諸受若樂若苦；應求鼻界若我若無我，應求香界乃至鼻觸為緣所生諸受若我若無我；應求鼻界若淨若不淨，應求香界乃至鼻觸為緣所生諸受若淨若不淨。",
        "translation": "Again, he says, \"When someone practices meditation, they should seek whether the nasal realm is permanent or impermanent, whether the fragrant realm and the sensations that arise from the condition of nasal contact are permanent or impermanent, whether the nasal realm is pleasant or painful, whether the fragrant realm and the sensations that arise from the condition of nasal contact are pleasant or painful, whether the nasal realm is self or selfless, whether the sensations that arise from the fragrant realm and the condition of nasal contact are self or selfless, and whether the nasal realm is pure or impure, and whether the fragrant realm and the sensations that arise from the condition of nasal contact are pure or impure.",
        "source": "T05n0220_137:0748a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能求如是等法修行靜慮，是行靜慮波羅蜜多。",
        "translation": "If someone can pursue such things and cultivate meditation, they're practicing the perfection of meditation.",
        "source": "T05n0220_137:0748b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_137:0748b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，如是求鼻界若常若無常，求香界乃至鼻觸為緣所生諸受若常若無常；求鼻界若樂若苦，求香界乃至鼻觸為緣所生諸受若樂若苦；求鼻界若我若無我，求香界乃至鼻觸為緣所生諸受若我若無我；求鼻界若淨若不淨，求香界乃至鼻觸為緣所生諸受若淨若不淨。",
        "translation": "\"If good men and good women thus seek whether the nasal realm is permanent or impermanent, whether the fragrant realm and the sensations that arise from nasal contact as a condition are permanent or impermanent; whether the nasal realm is pleasant or painful, whether the fragrant realm and the sensations that arise from nasal contact as a condition are pleasant or painful; whether the nasal realm is self or selfless, whether the fragrant realm and the sensations that arise from nasal contact as a condition are self or selfless; and whether the nasal realm is pure or impure, whether the fragrant realm and the sensations that arise from nasal contact as a condition are pure or impure, then they'll practice meditation based on these things.",
        "source": "T05n0220_137:0748b05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此等法行靜慮者，我說名為行有所得相似靜慮波羅蜜多。",
        "translation": "When someone practices meditation based on these things, I call it the practice of the perfection of attained-like meditation.",
        "source": "T05n0220_137:0748b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_137:0748b13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似靜慮波羅蜜多。",
        "translation": "As explained above, you should know that these are all explained as the perfection of attained resemblance meditation.",
        "source": "T05n0220_137:0748b13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第一百三十七",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 137",
        "source": "T05n0220_137:0748b15_0",
        "is_bad_quality": false
    }
]