[
    {
        "source_sentence": "大般若波羅蜜多經卷第一百四",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 104",
        "source": "T05n0220_147:0793b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十七",
        "translation": "seventeen",
        "source": "T05n0220_147:0793b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T05n0220_147:0793b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初分校量功德品第三十之四十五",
        "translation": "Chapter 30-45 of the Chapter on the Merit of Measurements in the First Branch",
        "source": "T05n0220_147:0793b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_147:0793b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，為發無上菩提心者宣說般若波羅蜜多，作如是言：『汝善男子應修般若波羅蜜多，不應觀意界若常若無常，不應觀法界、意識界及意觸、意觸為緣所生諸受若常若無常。",
        "translation": "\"If good men and good women explain the perfection of wisdom for those who have aroused the unsurpassed mind of enlightenment, they say, 'You good sons should cultivate the perfection of wisdom and shouldn't observe whether the mind realm is permanent or impermanent, and you shouldn't observe whether the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as a condition are permanent or impermanent.'",
        "source": "T05n0220_147:0793b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0793c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意界意界自性空，法界、意識界及意觸、意觸為緣所生諸受法界乃至意觸為緣所生諸受自性空；是意界自性即非自性，是法界乃至意觸為緣所生諸受自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The imaginal realm and imaginal realm are empty of their own nature, and the Dharma realm, the consciousness realm, and the feelings that arise from mental contact and mental contact as a condition are empty of their own nature; this is the imaginal realm's own nature that's not its own nature, and the imaginal realm and the feelings that arise from mental contact as a condition are also not their own nature, which would be the perfection of wisdom if they weren't their own nature.",
        "source": "T05n0220_147:0793c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，意界不可得，彼常無常亦不可得；法界乃至意觸為緣所生諸受皆不可得，彼常無常亦不可得。",
        "translation": "In this perfection of wisdom, the mind realm is unobtainable, and neither is its permanence nor impermanence; neither the Dharma realm nor the sensations that arise from mental contact as a condition is obtainable, nor is its permanence or impermanence obtainable.",
        "source": "T05n0220_147:0793c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0793c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無意界等可得，何況有彼常與無常！",
        "translation": "How could there be such things as permanence and impermanence when there's still no mental factor to be grasped here?",
        "source": "T05n0220_147:0793c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate this kind of wisdom, this is the cultivation of the perfection of wisdom.'",
        "source": "T05n0220_147:0793c12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀意界若樂若苦，不應觀法界、意識界及意觸、意觸為緣所生諸受若樂若苦。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of wisdom, not observing the mind realm as pleasant or painful, and not observing the Dharma realm, the consciousness realm, or the sensations that arise from mental contact or mental contact as a condition as pleasant or painful.",
        "source": "T05n0220_147:0793c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0793c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意界意界自性空，法界、意識界及意觸、意觸為緣所生諸受法界乃至意觸為緣所生諸受自性空；是意界自性即非自性，是法界乃至意觸為緣所生諸受自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The imaginal realm and imaginal realm are empty of their own nature, and the Dharma realm, the consciousness realm, and the feelings that arise from mental contact and mental contact as conditions are empty of their own nature; this is the imaginal realm's own nature that's not its own nature, and the imaginal realm and the feelings that arise from mental contact as conditions are not their own nature, and if they aren't their own nature, then they are the perfection of wisdom.",
        "source": "T05n0220_147:0793c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，意界不可得，彼樂與苦亦不可得；法界乃至意觸為緣所生諸受皆不可得，彼樂與苦亦不可得。",
        "translation": "In this perfection of wisdom, the mind realm is unobtainable, and so are pleasure and pain; neither the Dharma realm nor the sensations that arise from mental contact as a condition is obtainable, and so are pleasure and pain.",
        "source": "T05n0220_147:0793c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0793c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無意界等可得，何況有彼樂之與苦！",
        "translation": "There's no such thing as the mental realm, so how could there be pleasure and suffering?",
        "source": "T05n0220_147:0793c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate this kind of wisdom, this is the cultivation of the perfection of wisdom.'",
        "source": "T05n0220_147:0793c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀意界若我若無我，不應觀法界、意識界及意觸、意觸為緣所生諸受若我若無我。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of wisdom; you shouldn't contemplate the mind realm as self or selfless, and you shouldn't contemplate the Dharma realm, the consciousness realm, or the sensations that arise from mental contact and mental contact as conditions as self or selfless.",
        "source": "T05n0220_147:0793c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0793c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意界意界自性空，法界、意識界及意觸、意觸為緣所生諸受法界乃至意觸為緣所生諸受自性空；是意界自性即非自性，是法界乃至意觸為緣所生諸受自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The mind realm and mind realm are empty of their own nature, and the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as a condition are empty of their own nature; this is the self-nature of the mind realm that's not self-nature, and the self-nature of the Dharma realm and the sensations that arise from mental contact as a condition are not self-nature either, and if they aren't self-nature, then it's the perfection of wisdom.",
        "source": "T05n0220_147:0793c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，意界不可得，彼我無我亦不可得；法界乃至意觸為緣所生諸受皆不可得，彼我無我亦不可得。",
        "translation": "In this perfection of wisdom, the mind realm is unobtainable, and neither self nor selflessness is obtainable; neither the Dharma realm nor the sensations that arise from mental contact as a condition is obtainable, nor is self or selflessness obtainable.",
        "source": "T05n0220_147:0794a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0794a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無意界等可得，何況有彼我與無我！",
        "translation": "How could there be a self or no-self when there's no mental element or the like to be grasped here?",
        "source": "T05n0220_147:0794a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such prajñā, this is the cultivation of the perfection of prajñā.'",
        "source": "T05n0220_147:0794a08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀意界若淨若不淨，不應觀法界、意識界及意觸、意觸為緣所生諸受若淨若不淨。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of wisdom, not observing whether the mind realm is pure or impure, and not observing whether the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as a condition are pure or impure.",
        "source": "T05n0220_147:0794a09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0794a12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意界意界自性空，法界、意識界及意觸、意觸為緣所生諸受法界乃至意觸為緣所生諸受自性空；是意界自性即非自性，是法界乃至意觸為緣所生諸受自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The imaginal realm and imaginal realm are empty of their own nature, and the Dharma realm, the consciousness realm, and the feelings that arise from intentional contact and intentional contact as a condition are empty of their own nature; this is the imaginal realm's own nature that's not its own nature, and the imaginal realm and the feelings that arise from intentional contact as a condition are also not their own nature, which would be the perfection of wisdom if they weren't.",
        "source": "T05n0220_147:0794a12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，意界不可得，彼淨不淨亦不可得；法界乃至意觸為緣所生諸受皆不可得，彼淨不淨亦不可得。",
        "translation": "Regarding this perfection of wisdom, the mind realm is unobtainable, and neither is its purity nor impurity; neither the Dharma realm nor the sensations that arise from mental contact as a condition is obtainable, nor is its purity or impurity obtainable.",
        "source": "T05n0220_147:0794a16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0794a19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無意界等可得，何況有彼淨與不淨！",
        "translation": "How could there be such things as pure and impure when there's no such thing as the mental realm?",
        "source": "T05n0220_147:0794a19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such wisdom, you're cultivating the perfection of wisdom.'",
        "source": "T05n0220_147:0794a20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_147:0794a21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等作此等說，是為宣說真正般若波羅蜜多。",
        "translation": "These are good men and good women who make these statements in order to proclaim the true perfection of wisdom.",
        "source": "T05n0220_147:0794a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_147:0794a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，為發無上菩提心者宣說般若波羅蜜多，作如是言：『汝善男子應修般若波羅蜜多，不應觀地界若常若無常，不應觀水、火、風、空、識界若常若無常。",
        "translation": "If good men and good women explain the perfection of wisdom to someone who has developed the unsurpassed mind of enlightenment, they say, 'You good sons should cultivate the perfection of wisdom; you shouldn't contemplate the earth realm as permanent or impermanent, and you shouldn't contemplate the water, fire, air, space, or consciousness realms as permanent or impermanent.'",
        "source": "T05n0220_147:0794a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0794a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界地界自性空，水、火、風、空、識界水、火、風、空、識界自性空；是地界自性即非自性，是水、火、風、空、識界自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The self-nature of the earth realm is empty, and the self-nature of the water, fire, wind, air, and consciousness realms are empty; this is the self-nature of the earth realm that's not self-nature, and the self-nature of the water, fire, wind, air, and consciousness realms that's not self-nature, which would be the perfection of wisdom if they weren't self-nature.",
        "source": "T05n0220_147:0794a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，地界不可得，彼常無常亦不可得；水、火、風、空識界皆不可得，彼常無常亦不可得。",
        "translation": "Regarding this perfection of wisdom, the earth realm is unobtainable, and neither is its permanence nor impermanence; the water, fire, wind, and air consciousness realms are all unobtainable, and their permanence and impermanence are also unobtainable.",
        "source": "T05n0220_147:0794b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0794b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無地界等可得，何況有彼常與無常！",
        "translation": "How could there be anything permanent or impermanent when there's still no earth or other realm to be found here?",
        "source": "T05n0220_147:0794b05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such prajñā, this is the cultivation of the perfection of wisdom.'",
        "source": "T05n0220_147:0794b06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀地界若樂若苦，不應觀水、火、風、空、識界若樂若苦。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of wisdom, not observing whether the earth realm is pleasant or painful, and not observing whether the water, fire, air, space, or consciousness realms are pleasant or painful.",
        "source": "T05n0220_147:0794b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0794b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界地界自性空，水、火、風、空、識界水、火、風、空、識界自性空；是地界自性即非自性，是水、火、風、空、識界自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The self-nature of the earth realm is empty, and the self-natures of the water, fire, wind, air, and consciousness realms are empty; this is the self-nature of the earth realm that's not self-nature, and the self-natures of the water, fire, wind, air, and consciousness realms are not self-nature either; if they aren't self-nature, then it's the perfection of wisdom.",
        "source": "T05n0220_147:0794b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，地界不可得，彼樂與苦亦不可得；水、火、風、空、識界皆不可得，彼樂與苦亦不可得。",
        "translation": "Regarding this perfection of wisdom, the element of earth is unobtainable, and so are pleasure and pain; the elements of water, fire, wind, air, and consciousness are all unobtainable, and so are pleasure and pain.",
        "source": "T05n0220_147:0794b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0794b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無地界等可得，何況有彼樂之與苦！",
        "translation": "How could there be pleasure and suffering when there's no earth or other realm to be found here?",
        "source": "T05n0220_147:0794b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such prajñā, this is the cultivation of the perfection of prajñā.'",
        "source": "T05n0220_147:0794b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀地界若我若無我，不應觀水、火、風、空、識界若我若無我。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of wisdom, not observing whether the earth realm is self or no-self, and not observing whether the water, fire, air, space, or consciousness realms are self or no-self.",
        "source": "T05n0220_147:0794b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0794b19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界地界自性空，水、火、風、空、識界水、火、風、空、識界自性空；是地界自性即非自性，是水、火、風、空、識界自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The self-nature of the earth realm is empty, and the self-nature of the water, fire, wind, air, and consciousness realms are empty; this is the self-nature of the earth realm that's not self-nature, and the self-nature of the water, fire, wind, air, and consciousness realms that's not self-nature, which would be the perfection of wisdom if they weren't self-nature.",
        "source": "T05n0220_147:0794b19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，地界不可得，彼我無我亦不可得；水、火、風、空、識界皆不可得，彼我無我亦不可得。",
        "translation": "In this perfection of wisdom, the element of earth is unobtainable, and so is their selflessness; the elements of water, fire, wind, space, and consciousness are all unobtainable, and so is their selflessness.",
        "source": "T05n0220_147:0794b23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0794b25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無地界等可得，何況有彼我與無我！",
        "translation": "How could there be a self or no-self when there's no earth or other realm to be found here?",
        "source": "T05n0220_147:0794b25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such prajñā, this is the cultivation of the perfection of prajñā.'",
        "source": "T05n0220_147:0794b26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀地界若淨若不淨，不應觀水、火、風、空、識界若淨若不淨。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of wisdom, not observing whether the earth realm is pure or impure, and not observing whether the water, fire, air, space, and consciousness realms are pure or impure.",
        "source": "T05n0220_147:0794b27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0794c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界地界自性空，水、火、風、空、識界水、火、風、空、識界自性空；是地界自性即非自性，是水、火、風、空、識界自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The self-nature of the earth realm is empty, and the self-nature of the water, fire, wind, air, and consciousness realms are empty; this is the self-nature of the earth realm that's not self-nature, and this is the self-nature of the water, fire, wind, air, and consciousness realms that's not self-nature, which would be the perfection of wisdom if it weren't self-nature.",
        "source": "T05n0220_147:0794c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，地界不可得，彼淨不淨亦不可得；水、火、風、空、識界皆不可得，彼淨不淨亦不可得。",
        "translation": "Regarding this perfection of wisdom, the element of earth is unobtainable, and neither its purity nor impurity is obtainable; the elements of water, fire, wind, air, and consciousness are all unobtainable, and their purity and impurity are also unobtainable.",
        "source": "T05n0220_147:0794c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0794c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無地界等可得，何況有彼淨與不淨！",
        "translation": "How could there be something pure or impure when there's still no earth or other realm to be found here?",
        "source": "T05n0220_147:0794c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such wisdom, you're cultivating the perfection of wisdom.'",
        "source": "T05n0220_147:0794c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_147:0794c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等作此等說，是為宣說真正般若波羅蜜多。",
        "translation": "These are good men and good women who make these statements in order to proclaim the true perfection of wisdom.",
        "source": "T05n0220_147:0794c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_147:0794c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，為發無上菩提心者宣說般若波羅蜜多，作如是言：『汝善男子應修般若波羅蜜多，不應觀無明若常若無常，不應觀行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱若常若無常。",
        "translation": "If good men and good women explain the perfection of wisdom for those who have aroused the unsurpassed mind of enlightenment, they say, 'You good sons should cultivate the perfection of wisdom; you shouldn't observe nescience as permanent or impermanent, and you shouldn't observe formations, consciousness, name-and-form, the six sense-fields, touch, feeling, craving, grasping, existence, birth, old age and death, sorrow, pain and vexation as permanent or impermanent.'",
        "source": "T05n0220_147:0794c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0794c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明無明自性空，行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱行乃至老死愁歎苦憂惱自性空；是無明自性即非自性，是行乃至老死愁歎苦憂惱自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The own-nature of nescience and ignorance is empty, and the own-nature of volition, consciousness, name-and-form, the six sense-fields, contact, sensation, craving, appropriation, existence, birth, sorrow at old age and suffering and grief, volition and even sorrow at old age and suffering and grief are empty; this is the own-nature of nescience that's not its own-nature, and the own-nature of volition and even sorrow at old age and suffering and grief is not its own-nature, and if it's not its own-nature, then it's the perfection of wisdom.",
        "source": "T05n0220_147:0794c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，無明不可得，彼常無常亦不可得；行乃至老死愁歎苦憂惱皆不可得，彼常無常亦不可得。",
        "translation": "In this perfection of wisdom, ignorance is unobtainable, and so is its permanence and impermanence; neither are formations nor even the grief, sorrow, suffering, and vexation of old age and death, and so is its permanence and impermanence.",
        "source": "T05n0220_147:0794c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0794c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無無明等可得，何況有彼常與無常！",
        "translation": "How could there be such things as permanence and impermanence when there's still no such thing as ignorance?",
        "source": "T05n0220_147:0794c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such wisdom, this is the cultivation of the perfection of wisdom.'",
        "source": "T05n0220_147:0794c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀無明若樂若苦，不應觀行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱若樂若苦。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of wisdom, not observing nescience as pleasant or painful, and not observing formations, consciousness, name-and-form, the six sense-fields, touch, feeling, craving, grasping, existence, birth, sorrow and suffering of old age, or grief and distress as pleasant or painful.",
        "source": "T05n0220_147:0794c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0794c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明無明自性空，行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱行乃至老死愁歎苦憂惱自性空；是無明自性即非自性，是行乃至老死愁歎苦憂惱自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "The own-nature of nescience and ignorance is empty, and the own-nature of volition, consciousness, name-and-form, the six sense-fields, contact, sensation, craving, appropriation, existence, birth, lamentation at old age, suffering and grief, volition, and even lamentation at old age, suffering and grief are empty; this is the own-nature of nescience that's not its own-nature, and the own-nature of volition and even lamentation at old age, suffering and grief is not its own-nature, and if it's not its own-nature, then it's the perfection of wisdom.",
        "source": "T05n0220_147:0794c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，無明不可得，彼樂與苦亦不可得；行乃至老死愁歎苦憂惱皆不可得，彼樂與苦亦不可得。",
        "translation": "In this perfection of wisdom, ignorance is unobtainable, and so are pleasure and suffering; neither formations nor even the grief and sorrow of old age and death are obtainable, and so are pleasure and suffering.",
        "source": "T05n0220_147:0795a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0795a06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無無明等可得，何況有彼樂之與苦！",
        "translation": "There's still no such thing as nescience, so how could there be such pleasures and such sufferings?",
        "source": "T05n0220_147:0795a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such wisdom, this is the cultivation of the perfection of wisdom.'",
        "source": "T05n0220_147:0795a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀無明若我若無我，不應觀行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱若我若無我。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of wisdom, not observing nescience as self or no-self, and not observing formations, consciousness, name-and-form, the six sense-fields, touch, feeling, craving, grasping, existence, birth, grief of old age, pain, sorrow, and vexation as self or no-self.",
        "source": "T05n0220_147:0795a08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0795a12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明無明自性空，行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱行乃至老死愁歎苦憂惱自性空；是無明自性即非自性，是行乃至老死愁歎苦憂惱自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "The own-nature of nescience and ignorance is empty, and the own-nature of volition, consciousness, name-and-form, the six sense-fields, contact, sensation, craving, appropriation, existence, birth, sorrow at old age, suffering and grief, volition, and even sorrow at old age, suffering and grief are empty; this is the own-nature of nescience that's not its own-nature, and the own-nature of volition and even sorrow at old age, suffering and grief is not its own-nature, and if it's not its own-nature, then it's the perfection of wisdom.",
        "source": "T05n0220_147:0795a12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，無明不可得，彼我無我亦不可得；行乃至老死愁歎苦憂惱皆不可得，彼我無我亦不可得。",
        "translation": "In this perfection of wisdom, ignorance is unobtainable, and neither self nor self is obtainable; neither are formations nor even the grief, sorrow, suffering, and distress of old age and death obtainable, and neither is self or self obtainable.",
        "source": "T05n0220_147:0795a16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0795a19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無無明等可得，何況有彼我與無我！",
        "translation": "How could there be such a thing as a self or no-self when there's still no such thing as nescience to be had?",
        "source": "T05n0220_147:0795a19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such wisdom, this is the cultivation of the perfection of wisdom.'",
        "source": "T05n0220_147:0795a20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀無明若淨若不淨，不應觀行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱若淨若不淨。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of wisdom, not observing whether ignorance is pure or impure, and not observing whether formations, consciousness, name-and-form, the six sense-fields, touch, feeling, craving, grasping, existence, birth, grief of old age, pain, sorrow, and vexation are pure or impure.",
        "source": "T05n0220_147:0795a21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0795a24_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明無明自性空，行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱行乃至老死愁歎苦憂惱自性空；是無明自性即非自性，是行乃至老死愁歎苦憂惱自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The own-nature of nescience and ignorance is empty, and the own-natures of volition, consciousness, name-and-form, the six sense-fields, contact, sensation, craving, appropriation, existence, birth, sorrowful and painful grief at old age, and volition and even sorrowful and painful grief at old age are empty; this is the own-nature of nescience that's not its own-nature, and the own-nature of volition and even sorrowful and painful grief at old age is not its own-nature, and if it's not its own-nature, then it's the perfection of wisdom.",
        "source": "T05n0220_147:0795a24_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，無明不可得，彼淨不淨亦不可得；行乃至老死愁歎苦憂惱皆不可得，彼淨不淨亦不可得。",
        "translation": "In this perfection of wisdom, ignorance is unobtainable, and its purity and impurity are also unobtainable; neither formations nor even the grief and sorrow of old age and death are obtainable, and their purity and impurity are also unobtainable.",
        "source": "T05n0220_147:0795a29_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0795b02_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無無明等可得，何況有彼淨與不淨！",
        "translation": "There's still no such thing as nescience, so how could there be anything pure or impure about it?",
        "source": "T05n0220_147:0795b03_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such wisdom, you're cultivating the perfection of wisdom.'",
        "source": "T05n0220_147:0795b04_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_147:0795b05_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等作此等說，是為宣說真正般若波羅蜜多。",
        "translation": "These are good men and good women who make these statements in order to proclaim the true perfection of wisdom.",
        "source": "T05n0220_147:0795b05_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_147:0795b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，為發無上菩提心者宣說般若波羅蜜多，作如是言：『汝善男子應修般若波羅蜜多，不應觀布施波羅蜜多若常若無常，不應觀淨戒、安忍、精進、靜慮、般若波羅蜜多若常若無常。",
        "translation": "\"If good men and good women explain the perfection of wisdom to someone who has developed the unsurpassed mind of enlightenment, they say, 'You good sons should cultivate the perfection of wisdom; you shouldn't observe whether the perfection of generosity is permanent or impermanent, and you shouldn't observe whether the perfection of morality, patience, effort, meditation, or wisdom is permanent or impermanent.'",
        "source": "T05n0220_147:0795b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0795b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多布施波羅蜜多自性空，淨戒、安忍、精進、靜慮、般若波羅蜜多淨戒乃至般若波羅蜜多自性空；是布施波羅蜜多自性即非自性，是淨戒乃至般若波羅蜜多自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The self-nature of the perfection of generosity and the perfection of generosity is empty, and the self-nature of the pure precepts, patience, effort, meditation, and prajñāpāramitā are empty; this is the self-nature of the perfection of generosity, which is not self-nature, and the self-nature of the pure precepts and even prajñāpāramitā is not self-nature, or prajñāpāramitā if it's not self-nature.",
        "source": "T05n0220_147:0795b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，布施波羅蜜多不可得，彼常無常亦不可得；淨戒乃至般若波羅蜜多皆不可得，彼常無常亦不可得。",
        "translation": "Regarding this prajñāpāramitā, the perfection of generosity is unobtainable, and so is its permanence and impermanence; neither the pure precepts nor the perfection of prajñāpāramitā are obtainable, and so is its permanence and impermanence.",
        "source": "T05n0220_147:0795b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0795b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無布施波羅蜜多等可得，何況有彼常與無常！",
        "translation": "There's no such thing as the perfection of generosity, so how could there be anything like permanence and impermanence?",
        "source": "T05n0220_147:0795b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such prajñā, this is the cultivation of the perfection of prajñā.'",
        "source": "T05n0220_147:0795b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀布施波羅蜜多若樂若苦，不應觀淨戒、安忍、精進、靜慮、般若波羅蜜多若樂若苦。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of wisdom, not observing the perfection of generosity as pleasant or painful, and not observing the perfection of pure morality, patience, effort, meditation, or wisdom as pleasant or painful.",
        "source": "T05n0220_147:0795b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0795b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多布施波羅蜜多自性空，淨戒、安忍、精進、靜慮、般若波羅蜜多淨戒乃至般若波羅蜜多自性空；是布施波羅蜜多自性即非自性，是淨戒乃至般若波羅蜜多自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The self-nature of the perfection of generosity and the perfection of generosity is empty, and the self-nature of the pure precepts, patience, effort, meditation, and prajñāpāramitā are empty; this is the self-nature of the perfection of generosity that's not self-nature, and the self-nature of the pure precepts and even prajñāpāramitā is not self-nature, and if it's not self-nature, then it's prajñāpāramitā.",
        "source": "T05n0220_147:0795b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，布施波羅蜜多不可得，彼樂與苦亦不可得；淨戒乃至般若波羅蜜多皆不可得，彼樂與苦亦不可得。",
        "translation": "Here in the perfection of prajñā, the perfection of generosity is unobtainable, and so are pleasure and suffering; neither the pure precepts nor the perfection of prajñā are obtainable, and so are pleasure and suffering.",
        "source": "T05n0220_147:0795c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0795c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無布施波羅蜜多等可得，何況有彼樂之與苦！",
        "translation": "There's no such thing as the perfection of generosity, so why should there be such pleasures and sufferings?",
        "source": "T05n0220_147:0795c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such prajñā, this is the cultivation of the perfection of prajñā.'",
        "source": "T05n0220_147:0795c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀布施波羅蜜多若我若無我，不應觀淨戒、安忍、精進、靜慮、般若波羅蜜多若我若無我。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of prajñā, not observing the perfection of generosity as self or no-self, and not observing the perfection of pure precepts, patience, effort, meditation, or prajñā as self or no-self.",
        "source": "T05n0220_147:0795c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0795c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多布施波羅蜜多自性空，淨戒、安忍、精進、靜慮、般若波羅蜜多淨戒乃至般若波羅蜜多自性空；是布施波羅蜜多自性即非自性，是淨戒乃至般若波羅蜜多自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The self-nature of the perfection of generosity and the perfection of generosity is empty, and the self-nature of the pure precepts, patience, effort, meditation, and prajñāpāramitā are empty; this is the self-nature of the perfection of generosity, which is not self-nature, and the self-nature of the pure precepts and even prajñāpāramitā is not self-nature, or prajñāpāramitā if it's not self-nature.",
        "source": "T05n0220_147:0795c09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，布施波羅蜜多不可得，彼我無我亦不可得；淨戒乃至般若波羅蜜多皆不可得，彼我無我亦不可得。",
        "translation": "Regarding this prajñāpāramitā, the perfection of generosity is unobtainable, and neither self nor self is obtainable; neither the pure precepts nor the perfection of prajñāpāramitā are obtainable, and neither self nor self is obtainable.",
        "source": "T05n0220_147:0795c14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0795c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無布施波羅蜜多等可得，何況有彼我與無我！",
        "translation": "There's no such thing as the perfection of generosity, so why should there be a self or no-self?",
        "source": "T05n0220_147:0795c17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such prajñā, this is cultivating the perfection of prajñā.'",
        "source": "T05n0220_147:0795c18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀布施波羅蜜多若淨若不淨，不應觀淨戒、安忍、精進、靜慮、般若波羅蜜多若淨若不淨。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of prajñā, not observing whether the perfection of generosity is pure or impure, and not observing whether the perfection of pure morality, patience, effort, meditation, or prajñā are pure or impure.",
        "source": "T05n0220_147:0795c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0795c22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多布施波羅蜜多自性空，淨戒、安忍、精進、靜慮、般若波羅蜜多淨戒乃至般若波羅蜜多自性空；是布施波羅蜜多自性即非自性，是淨戒乃至般若波羅蜜多自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The self-nature of the perfection of generosity and the perfection of generosity is empty, and the self-nature of the pure precepts, patience, effort, meditation, the perfection of wisdom, the pure precepts, and even the perfection of wisdom is empty; this is the self-nature of the perfection of generosity that's not self-nature, and the self-nature of the pure precepts and even the perfection of wisdom is not self-nature, and if it's not self-nature, then it's the perfection of wisdom.",
        "source": "T05n0220_147:0795c22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，布施波羅蜜多不可得，彼淨不淨亦不可得；淨戒乃至般若波羅蜜多皆不可得，彼淨不淨亦不可得。",
        "translation": "Regarding this prajñāpāramitā, the perfection of generosity is unobtainable, and neither is it pure or impure; neither the pure precepts nor even the perfection of prajñāpāramitā are obtainable, and neither are they pure or impure.",
        "source": "T05n0220_147:0795c27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0796a01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無布施波羅蜜多等可得，何況有彼淨與不淨！",
        "translation": "There's no such thing as the perfection of generosity, so how could there be anything pure or impure about it?",
        "source": "T05n0220_147:0796a01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such wisdom, you're cultivating the perfection of wisdom.'",
        "source": "T05n0220_147:0796a03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_147:0796a04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等作此等說，是為宣說真正般若波羅蜜多。",
        "translation": "These are good men and good women who make these statements in order to proclaim the true perfection of wisdom.",
        "source": "T05n0220_147:0796a04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_147:0796a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，為發無上菩提心者宣說般若波羅蜜多，作如是言：『汝善男子應修般若波羅蜜多，不應觀內空若常若無常，不應觀外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空若常若無常。",
        "translation": "If good men and good women explain the perfection of wisdom for those who have aroused the unsurpassed mind of enlightenment, they say, 'You good sons should cultivate the perfection of wisdom and shouldn't contemplate internal emptiness as permanent or impermanent, or external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, existent emptiness, inactive emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all things, inaccessible emptiness, emptiness without nature, emptiness of self-nature, emptiness of self-nature, and emptiness of natureless self-nature as permanent or impermanent.'",
        "source": "T05n0220_147:0796a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0796a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空內空自性空，外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空外空乃至無性自性空自性空；是內空自性即非自性，是外空乃至無性自性空自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"Internal emptiness, internal emptiness, self-nature emptiness, external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, endless emptiness, dispersed emptiness, immutable emptiness, emptiness of essential nature, emptiness of own-nature, emptiness of shared characteristics, emptiness of all things, inaccessible emptiness, natureless emptiness, self-nature emptiness, natureless self-nature emptiness, external emptiness, and even natureless self-nature emptiness; this is internal emptiness as self-nature that's not self-nature, external emptiness and even natureless self-nature emptiness as self-nature, and if it's not self-nature, it's the perfection of wisdom.",
        "source": "T05n0220_147:0796a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，內空不可得，彼常無常亦不可得；外空乃至無性自性空皆不可得，彼常無常亦不可得。",
        "translation": "In this perfection of wisdom, internal emptiness is unobtainable, and neither is its permanence nor impermanence; external emptiness nor even the emptiness of a natureless self-nature is unobtainable, and neither is its permanence nor impermanence.",
        "source": "T05n0220_147:0796a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0796a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無內空等可得，何況有彼常與無常！",
        "translation": "There's still no internal emptiness or anything like it, so how could there be anything permanent or impermanent?",
        "source": "T05n0220_147:0796a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such prajñā, this is the cultivation of the perfection of prajñā.'",
        "source": "T05n0220_147:0796a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀內空若樂若苦，不應觀外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空若樂若苦。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of wisdom, not observing internal emptiness or happiness or suffering, and not observing external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, existent emptiness, impermanent emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, immutable emptiness, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all things, inaccessible emptiness, emptiness without nature, emptiness of self-nature, emptiness of self-nature, and emptiness of self-nature without nature if it's pleasant or painful.",
        "source": "T05n0220_147:0796a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0796a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空內空自性空，外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空外空乃至無性自性空自性空；是內空自性即非自性，是外空乃至無性自性空自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"Internal emptiness, internal emptiness, self-nature emptiness, external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, endless emptiness, dispersed emptiness, immutable emptiness, emptiness of own-nature, emptiness of shared characteristics, emptiness of all things, unobtainable emptiness, natureless emptiness, self-nature emptiness, natureless self-nature emptiness, external emptiness, and even natureless self-nature emptiness; this self-nature of internal emptiness is not self-nature, and this self-nature of external emptiness and natureless self-nature emptiness is not self-nature either, and if it's not self-nature, it's the perfection of wisdom.",
        "source": "T05n0220_147:0796a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，內空不可得，彼樂與苦亦不可得；外空乃至無性自性空皆不可得，彼樂與苦亦不可得。",
        "translation": "In this perfection of wisdom, internal emptiness is unobtainable, and so are pleasure and suffering; external emptiness and even the emptiness of a natureless self-nature are unobtainable, and so are pleasure and suffering.",
        "source": "T05n0220_147:0796b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0796b09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無內空等可得，何況有彼樂之與苦！",
        "translation": "There's still no internal emptiness or the like to be found here, so how could there be pleasure and suffering?",
        "source": "T05n0220_147:0796b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such prajñā, this is the cultivation of the perfection of prajñā.'",
        "source": "T05n0220_147:0796b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀內空若我若無我，不應觀外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空若我若無我。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of wisdom, not observing internal emptiness as self or no-self, and not observing external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, existent emptiness, impermanent emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-identity, emptiness of shared characteristics, emptiness of all things, inaccessible emptiness, emptiness without nature, emptiness of self-nature, emptiness of self-nature, and emptiness of natureless self-nature as self or no-self.",
        "source": "T05n0220_147:0796b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0796b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空內空自性空，外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空外空乃至無性自性空自性空；是內空自性即非自性，是外空乃至無性自性空自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"Internal emptiness, internal emptiness, self-nature emptiness, external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, endless emptiness, dispersed emptiness, immutable emptiness, emptiness of own-nature, emptiness of shared characteristics, emptiness of all things, unobtainable emptiness, natureless emptiness, self-nature emptiness, natureless self-nature emptiness, external emptiness, and even natureless self-nature emptiness; this is internal emptiness as self-nature that's not self-nature, and external emptiness and even natureless self-nature emptiness as self-nature that's not self-nature, and if it's not self-nature, it's the perfection of wisdom.",
        "source": "T05n0220_147:0796b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，內空不可得，彼我無我亦不可得；外空乃至無性自性空皆不可得，彼我無我亦不可得。",
        "translation": "In this perfection of wisdom, internal emptiness is unobtainable, and neither self nor self is obtainable; external emptiness nor the emptiness of a natureless self-nature is unobtainable, and neither self nor self is obtainable.",
        "source": "T05n0220_147:0796b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0796b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無內空等可得，何況有彼我與無我！",
        "translation": "There's still no internal emptiness or anything like it, so how could there be a self or no-self?",
        "source": "T05n0220_147:0796b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such prajñā, this is the cultivation of the perfection of prajñā.'",
        "source": "T05n0220_147:0796b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀內空若淨若不淨，不應觀外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空若淨若不淨。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of wisdom, not observing internal emptiness as pure or impure, and not observing external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, existent emptiness, impermanent emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all things, inaccessible emptiness, emptiness without nature, emptiness of self-nature, and emptiness of natureless self-nature as pure or impure.",
        "source": "T05n0220_147:0796b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0796c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空內空自性空，外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空外空乃至無性自性空自性空；是內空自性即非自性，是外空乃至無性自性空自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"Internal emptiness, internal emptiness, self-nature emptiness, external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, endless emptiness, dispersed emptiness, immutable emptiness, emptiness of own-nature, emptiness of shared characteristics, emptiness of all things, unobtainable emptiness, natureless emptiness, self-nature emptiness, natureless self-nature emptiness, external emptiness, and even natureless self-nature emptiness; this is the self-nature of internal emptiness that's not self-nature, and this is the self-nature of external emptiness and even natureless self-nature emptiness, which would be the perfection of wisdom if it weren't self-nature.",
        "source": "T05n0220_147:0796c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，內空不可得，彼淨不淨亦不可得；外空乃至無性自性空皆不可得，彼淨不淨亦不可得。",
        "translation": "Regarding this perfection of wisdom, internal emptiness is unobtainable, and neither is its purity nor impurity; external emptiness nor even the self-nature of the natureless self-nature of emptiness is unobtainable, and neither is its purity nor impurity.",
        "source": "T05n0220_147:0796c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0796c14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無內空等可得，何況有彼淨與不淨！",
        "translation": "There's still no internal emptiness or the like to be found here, so how could there be anything pure or impure about them?",
        "source": "T05n0220_147:0796c14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such wisdom, you're cultivating the perfection of wisdom.'",
        "source": "T05n0220_147:0796c15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_147:0796c16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等作此等說，是為宣說真正般若波羅蜜多。",
        "translation": "These are good men and good women who make these statements in order to proclaim the true perfection of wisdom.",
        "source": "T05n0220_147:0796c16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_147:0796c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，為發無上菩提心者宣說般若波羅蜜多，作如是言：『汝善男子應修般若波羅蜜多，不應觀真如若常若無常，不應觀法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界若常若無常。",
        "translation": "If good men and good women explain the perfection of wisdom for those who have aroused the unsurpassed mind of enlightenment, they say, 'You good sons should cultivate the perfection of wisdom and shouldn't contemplate what's true and what's permanent and impermanent, and shouldn't contemplate what's permanent and impermanent in the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from birth, legality, Dharma abiding, reality, the space realm, or the inconceivable realm.'",
        "source": "T05n0220_147:0796c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0796c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如真如自性空，法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界法界乃至不思議界自性空；是真如自性即非自性，是法界乃至不思議界自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"As the true nature of true thusness is empty of its own nature, the Dharma realm, Dharma nature, not-falsely nature, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, the space realm, the inconceivable realm, and the Dharma realm and even the inconceivable realm are empty of their own nature; this is the true nature's own nature that's not its own nature, and this is the Dharma realm and even the inconceivable realm's own nature that's not its own nature, and if it's not its own nature, then it's the perfection of wisdom.",
        "source": "T05n0220_147:0796c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，真如不可得，彼常無常亦不可得；法界乃至不思議界皆不可得，彼常無常亦不可得。",
        "translation": "In this perfection of wisdom, the true thusness is unobtainable, and so is its permanence and impermanence; neither the Dharma realm nor even the inconceivable realm is obtainable, and so is its permanence and impermanence.",
        "source": "T05n0220_147:0796c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0797a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無真如等可得，何況有彼常與無常！",
        "translation": "How could there be such things as permanence and impermanence when there's still no such thing as true reality to be attained?",
        "source": "T05n0220_147:0797a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such prajñā, this is the cultivation of the perfection of prajñā.'",
        "source": "T05n0220_147:0797a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀真如若樂若苦，不應觀法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界若樂若苦。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of wisdom, not observing what's pleasant and painful about true nature, and not observing what's pleasant and painful about the Dharma realm, Dharma nature, non-falsity, unchanging difference, equality, freedom from birth, legality, Dharma abiding, reality, the space realm, or the inconceivable realm.",
        "source": "T05n0220_147:0797a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0797a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如真如自性空，法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界法界乃至不思議界自性空；是真如自性即非自性，是法界乃至不思議界自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"As the true nature of true thusness is empty of its own nature, the Dharma realm, Dharma nature, not-falsely nature, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, the space realm, the inconceivable realm, and the Dharma realm and even the inconceivable realm are empty of their own nature; this is the true nature's own nature that's not its own nature, and this is the Dharma realm and even the inconceivable realm's own nature that's not its own nature, and if it's not its own nature, then it's the perfection of wisdom.",
        "source": "T05n0220_147:0797a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，真如不可得，彼樂與苦亦不可得；法界乃至不思議界皆不可得，彼樂與苦亦不可得。",
        "translation": "Regarding this perfection of wisdom, true thusness is unobtainable, and so are pleasure and suffering; neither the Dharma realm nor the inconceivable realm is obtainable, and so are pleasure and suffering.",
        "source": "T05n0220_147:0797a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0797a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無真如等可得，何況有彼樂之與苦！",
        "translation": "There is no such thing as true reality, so how could there be such pleasures and such sufferings?",
        "source": "T05n0220_147:0797a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such prajñā, this is the cultivation of the perfection of prajñā.'",
        "source": "T05n0220_147:0797a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀真如若我若無我，不應觀法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界若我若無我。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of wisdom, not observing what's truly like, whether self or no-self, and not observing what's the Dharma realm, Dharma nature, non-falsity, unchanging difference, equality, freedom from birth, legality, Dharma abiding, reality, the space realm, or the inconceivable realm, whether self or no-self.",
        "source": "T05n0220_147:0797a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0797a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如真如自性空，法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界法界乃至不思議界自性空；是真如自性即非自性，是法界乃至不思議界自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"As the true nature of true thusness is empty of its own nature, the Dharma realm, Dharma nature, not-falsely nature, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, the space realm, the inconceivable realm, and the Dharma realm and even the inconceivable realm are empty of their own nature; this is the true nature's own nature that's not its own nature, and this is the Dharma realm and even the inconceivable realm's own nature that's not its own nature, and if it's not its own nature, then it's the perfection of wisdom.",
        "source": "T05n0220_147:0797a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，真如不可得，彼我無我亦不可得；法界乃至不思議界皆不可得，彼我無我亦不可得。",
        "translation": "In this perfection of wisdom, the true thusness is unobtainable, and neither self nor self is obtainable; neither the Dharma realm nor even the inconceivable realm is obtainable, and neither self nor self is obtainable.",
        "source": "T05n0220_147:0797a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0797b01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無真如等可得，何況有彼我與無我！",
        "translation": "How could there be a self or no-self when there's still no such thing as a true reality to be attained?",
        "source": "T05n0220_147:0797b01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such prajñā, this is the cultivation of the perfection of prajñā.'",
        "source": "T05n0220_147:0797b02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀真如若淨若不淨，不應觀法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界若淨若不淨。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of wisdom, not observing whether the true thusness is pure or impure, and not observing whether the Dharma realm, Dharma nature, non-falsity, unchanging difference, equality, freedom from birth, legality, Dharma abiding, reality, the space realm, or the inconceivable realm is pure or impure.",
        "source": "T05n0220_147:0797b03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0797b07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如真如自性空，法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界法界乃至不思議界自性空；是真如自性即非自性，是法界乃至不思議界自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"As the true nature of true thusness is empty of its own nature, the Dharma realm, Dharma nature, not-falsely nature, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, the space realm, the inconceivable realm, and the Dharma realm and even the inconceivable realm are empty of their own nature; this is the true nature's own nature that's not its own nature, and this is the Dharma realm and even the inconceivable realm's own nature that's not its own nature, and if it's not its own nature, then it's the perfection of wisdom.",
        "source": "T05n0220_147:0797b07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，真如不可得，彼淨不淨亦不可得；法界乃至不思議界皆不可得，彼淨不淨亦不可得。",
        "translation": "Regarding this perfection of wisdom, the true thusness is unobtainable, and neither is its purity nor impurity; neither the Dharma realm nor even the inconceivable realm is obtainable, and neither is its purity nor impurity obtainable.",
        "source": "T05n0220_147:0797b12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0797b15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無真如等可得，何況有彼淨與不淨！",
        "translation": "There is no such thing as true reality, so how could there be anything pure or impure about it?",
        "source": "T05n0220_147:0797b15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such wisdom, you're cultivating the perfection of wisdom.'",
        "source": "T05n0220_147:0797b16_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_147:0797b17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等作此等說，是為宣說真正般若波羅蜜多。",
        "translation": "These are good men and good women who make these statements in order to proclaim the true perfection of wisdom.",
        "source": "T05n0220_147:0797b17_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_147:0797b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，為發無上菩提心者宣說般若波羅蜜多，作如是言：『汝善男子應修般若波羅蜜多，不應觀苦聖諦若常若無常，不應觀集、滅、道聖諦若常若無常。",
        "translation": "\"If good men and good women explain the perfection of wisdom for those who have aroused the unsurpassed mind of enlightenment, they say, 'You good sons should cultivate the perfection of wisdom and not contemplate the noble truth of suffering as permanent or impermanent, or the noble truths of arising, ceasing, and the path as permanent or impermanent.'",
        "source": "T05n0220_147:0797b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0797b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦聖諦苦聖諦自性空，集、滅、道聖諦集、滅、道聖諦自性空；是苦聖諦自性即非自性，是集、滅、道聖諦自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The noble truth of suffering is empty of the self-nature of the noble truth of suffering, and the noble truths of arising, ceasing, and the path are empty of the self-nature of the noble truths of arising, ceasing, and the path; this is the self-nature of the noble truth of suffering, which is not self-nature, and the self-nature of the noble truths of arising, ceasing, and the path, which is not self-nature; if it's not self-nature, then it's the perfection of wisdom.",
        "source": "T05n0220_147:0797b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，苦聖諦不可得，彼常無常亦不可得；集、滅、道聖諦皆不可得，彼常無常亦不可得。",
        "translation": "In this perfection of wisdom, the noble truth of suffering is unobtainable, and neither is its permanence nor impermanence; the noble truths of arising, ceasing, and the path are unobtainable, and their permanence and impermanence are also unobtainable.",
        "source": "T05n0220_147:0797b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0797b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無苦聖諦等可得，何況有彼常與無常！",
        "translation": "How could there be such things as permanence and impermanence when there's still nothing like the noble truth of suffering to be found here?",
        "source": "T05n0220_147:0797b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such prajñā, this is the cultivation of the perfection of prajñā.'",
        "source": "T05n0220_147:0797c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀苦聖諦若樂若苦，不應觀集、滅、道聖諦若樂若苦。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of wisdom, not observing the noble truth of suffering as pleasant and painful, and not observing the noble truths of arising, ceasing, and the path as pleasant and painful.",
        "source": "T05n0220_147:0797c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0797c04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦聖諦苦聖諦自性空，集、滅、道聖諦集、滅、道聖諦自性空；是苦聖諦自性即非自性，是集、滅、道聖諦自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The noble truth of suffering is empty of the self-nature of the noble truth of suffering, and the noble truths of arising, ceasing, and the path are empty of the self-nature of the noble truths of arising, ceasing, and the path; this is the self-nature of the noble truth of suffering that is not self-nature, and this is the self-nature of the noble truths of arising, ceasing, and the path that is not self-nature; if it's not self-nature, then it's the perfection of wisdom.",
        "source": "T05n0220_147:0797c04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，苦聖諦不可得，彼樂與苦亦不可得；集、滅、道聖諦皆不可得，彼樂與苦亦不可得。",
        "translation": "In this perfection of wisdom, the noble truth of suffering is unobtainable, and so are pleasure and suffering; the noble truths of arising, ceasing, and the path are all unobtainable, and so are pleasure and suffering.",
        "source": "T05n0220_147:0797c07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0797c10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無苦聖諦等可得，何況有彼樂之與苦！",
        "translation": "There is no noble truth of suffering or so forth to be found here, so how could there be pleasure and suffering?",
        "source": "T05n0220_147:0797c10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such prajñā, this is the cultivation of the perfection of prajñā.'",
        "source": "T05n0220_147:0797c11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀苦聖諦若我若無我，不應觀集、滅、道聖諦若我若無我。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of wisdom, not observing whether the noble truth of suffering is self or no-self, and not observing whether the noble truths of accumulation, cessation, and the path are self or no-self.",
        "source": "T05n0220_147:0797c12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0797c14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦聖諦苦聖諦自性空，集、滅、道聖諦集、滅、道聖諦自性空；是苦聖諦自性即非自性，是集、滅、道聖諦自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The noble truth of suffering is empty of the self-nature of the noble truth of suffering, and the noble truths of arising, ceasing, and the path are empty of the self-nature of the noble truths of arising, ceasing, and the path; this is the self-nature of the noble truth of suffering that is not self-nature, and this is the self-nature of the noble truths of arising, ceasing, and the path that is not self-nature, which would be the perfection of wisdom if it weren't self-nature.",
        "source": "T05n0220_147:0797c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，苦聖諦不可得，彼我無我亦不可得；集、滅、道聖諦皆不可得，彼我無我亦不可得。",
        "translation": "In this perfection of wisdom, the noble truth of suffering is unobtainable, and neither is the self-nature of that self; the noble truths of arising, ceasing, and the path are all unobtainable, and neither is the self-nature of that self-nature.",
        "source": "T05n0220_147:0797c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0797c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無苦聖諦等可得，何況有彼我與無我！",
        "translation": "There is no such thing as the noble truth of suffering, so why should there be a self or no-self?",
        "source": "T05n0220_147:0797c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such prajñā, this is the cultivation of the perfection of wisdom.'",
        "source": "T05n0220_147:0797c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀苦聖諦若淨若不淨，不應觀集、滅、道聖諦若淨若不淨。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of wisdom, not observing whether the noble truth of suffering is pure or impure, and not observing whether the noble truths of arising, ceasing, and the path are pure or impure.",
        "source": "T05n0220_147:0797c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0797c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦聖諦苦聖諦自性空，集、滅、道聖諦集、滅、道聖諦自性空；是苦聖諦自性即非自性，是集、滅、道聖諦自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The noble truth of suffering is empty of the self-nature of the noble truth of suffering, and the noble truths of arising, ceasing, and the path are empty of the self-nature of the noble truths of arising, ceasing, and the path; this is the self-nature of the noble truth of suffering that's not self-nature, and this is the self-nature of the noble truths of arising, ceasing, and the path that's not self-nature, which would be the perfection of wisdom if it weren't self-nature.",
        "source": "T05n0220_147:0797c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，苦聖諦不可得，彼淨不淨亦不可得；集、滅、道聖諦皆不可得，彼淨不淨亦不可得。",
        "translation": "In this perfection of wisdom, the noble truth of suffering is unobtainable, and neither is its purity nor impurity; the noble truths of arising, ceasing, and the path are all unobtainable, and their purity and impurity are also unobtainable.",
        "source": "T05n0220_147:0797c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0798a02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無苦聖諦等可得，何況有彼淨與不淨！",
        "translation": "How could there be such things as the noble truth of suffering when there's nothing to be gained from them, let alone their purity and impurity?",
        "source": "T05n0220_147:0798a02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such wisdom, you're cultivating the perfection of wisdom.'",
        "source": "T05n0220_147:0798a03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_147:0798a04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等作此等說，是為宣說真正般若波羅蜜多。",
        "translation": "These are good men and good women who make these statements in order to proclaim the true perfection of wisdom.",
        "source": "T05n0220_147:0798a04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "\"Furthermore, Kauśika!",
        "source": "T05n0220_147:0798a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，為發無上菩提心者宣說般若波羅蜜多，作如是言：『汝善男子應修般若波羅蜜多，不應觀四靜慮若常若無常，不應觀四無量、四無色定若常若無常。",
        "translation": "\"If good men and good women explain the perfection of wisdom to someone who has developed the unsurpassed mind of enlightenment, they say, 'You good sons should cultivate the perfection of wisdom; you shouldn't contemplate the four meditations as permanent or impermanent, and you shouldn't contemplate the four immeasurable and four formless concentrations as permanent or impermanent.'",
        "source": "T05n0220_147:0798a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0798a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮四靜慮自性空，四無量、四無色定四無量、四無色定自性空；是四靜慮自性即非自性，是四無量、四無色定自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The own-nature of the four meditations is empty, and the own-natures of the four immeasurable and four formless concentrations are empty; this is the own-nature of the four meditations, which is not the own-nature, and the own-natures of the four immeasurable and four formless concentrations are not the own-nature either; if they aren't the own-nature, then they're the perfection of wisdom.",
        "source": "T05n0220_147:0798a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，四靜慮不可得，彼常無常亦不可得；四無量、四無色定皆不可得，彼常無常亦不可得。",
        "translation": "Regarding this perfection of wisdom, the four meditations are unobtainable, and neither are their permanence nor impermanence; the four immeasurable and four formless concentrations are unobtainable, and their permanence and impermanence are also unobtainable.",
        "source": "T05n0220_147:0798a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0798a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無四靜慮等可得，何況有彼常與無常！",
        "translation": "There are not yet four meditations and so forth that can be attained here, so how could there be such things as permanence and impermanence?",
        "source": "T05n0220_147:0798a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such prajñā, this is the cultivation of the perfection of prajñā.'",
        "source": "T05n0220_147:0798a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀四靜慮若樂若苦，不應觀四無量、四無色定若樂若苦。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of prajñā, not observing the four meditations as pleasant or painful, and not observing the four immeasurable and four formless concentrations as pleasant or painful.",
        "source": "T05n0220_147:0798a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0798a21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮四靜慮自性空，四無量、四無色定四無量、四無色定自性空；是四靜慮自性即非自性，是四無量、四無色定自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The own-nature of the four meditations is empty, and the own-natures of the four immeasurable and four formless concentrations are empty; this is the own-nature of the four meditations, which is not the own-nature, and the own-natures of the four immeasurable and four formless concentrations are not the own-nature either; if they aren't the own-nature, then they are the perfection of wisdom.",
        "source": "T05n0220_147:0798a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，四靜慮不可得，彼樂與苦亦不可得；四無量、四無色定皆不可得，彼樂與苦亦不可得。",
        "translation": "Regarding this perfection of wisdom, the four meditations are unobtainable, and their pleasure and suffering are also unobtainable; the four immeasurable and four formless concentrations are both unobtainable, and their pleasure and suffering are also unobtainable.",
        "source": "T05n0220_147:0798a25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0798a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無四靜慮等可得，何況有彼樂之與苦！",
        "translation": "There are not yet four meditations and so forth that can be attained here, so how could there be such pleasures and such sufferings?",
        "source": "T05n0220_147:0798a27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such prajñā, this is the cultivation of the perfection of prajñā.'",
        "source": "T05n0220_147:0798a28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀四靜慮若我若無我，不應觀四無量、四無色定若我若無我。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of prajñā, but you shouldn't contemplate the four meditations as self or no-self, and you shouldn't contemplate the four immeasurable and four formless concentrations as self or no-self.",
        "source": "T05n0220_147:0798a29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0798b03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮四靜慮自性空，四無量、四無色定四無量、四無色定自性空；是四靜慮自性即非自性，是四無量、四無色定自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The own-nature of the four meditations is empty, and the own-natures of the four immeasurable and four formless concentrations are empty; this is the own-nature of the four meditations, which is not the own-nature, and the own-natures of the four immeasurable and four formless concentrations are not the own-nature either; if they aren't the own-nature, then they're the perfection of wisdom.",
        "source": "T05n0220_147:0798b03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，四靜慮不可得，彼我無我亦不可得；四無量、四無色定皆不可得，彼我無我亦不可得。",
        "translation": "Regarding this perfection of wisdom, the four meditations are unobtainable, and neither is their self-nature or selflessness; the four immeasurable and four formless concentrations are unobtainable, and neither is their self-nature or selflessness.",
        "source": "T05n0220_147:0798b07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0798b09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無四靜慮等可得，何況有彼我與無我！",
        "translation": "There are not yet four meditations and so forth to be attained here, so how could there be a self or no-self?",
        "source": "T05n0220_147:0798b09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such prajñā, this is the cultivation of the perfection of prajñā.'",
        "source": "T05n0220_147:0798b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復作是言：『汝善男子應修般若波羅蜜多，不應觀四靜慮若淨若不淨，不應觀四無量、四無色定若淨若不淨。",
        "translation": "\"Again, he said, 'You good sons should cultivate the perfection of prajñā, not observing whether the four meditations are pure or impure, and not observing whether the four immeasurable and four formless concentrations are pure or impure.",
        "source": "T05n0220_147:0798b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0798b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮四靜慮自性空，四無量、四無色定四無量、四無色定自性空；是四靜慮自性即非自性，是四無量、四無色定自性亦非自性，若非自性即是般若波羅蜜多。",
        "translation": "\"The own-nature of the four meditations is empty, and the own-natures of the four immeasurable and four formless concentrations are empty; this is the own-nature of the four meditations, which is not the own-nature, and the own-natures of the four immeasurable and four formless concentrations are not the own-nature either; if they aren't the own-nature, then they're the perfection of wisdom.",
        "source": "T05n0220_147:0798b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此般若波羅蜜多，四靜慮不可得，彼淨不淨亦不可得；四無量、四無色定皆不可得，彼淨不淨亦不可得。",
        "translation": "Regarding this perfection of wisdom, the four meditations are unobtainable, and their purity and impurity are also unobtainable; the four immeasurable and four formless concentrations are both unobtainable, and their purity and impurity are also unobtainable.",
        "source": "T05n0220_147:0798b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_147:0798b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中尚無四靜慮等可得，何況有彼淨與不淨！",
        "translation": "There are not yet four meditations and so forth that can be attained here, so how could there be others that are pure and impure?",
        "source": "T05n0220_147:0798b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若能修如是般若，是修般若波羅蜜多。』",
        "translation": "If you can cultivate such wisdom, you're cultivating the perfection of wisdom.'",
        "source": "T05n0220_147:0798b22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T05n0220_147:0798b23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人等作此等說，是為宣說真正般若波羅蜜多。",
        "translation": "These are good men and good women who make these statements for the purpose of teaching the true perfection of wisdom.",
        "source": "T05n0220_147:0798b23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第一百四十七",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 147",
        "source": "T05n0220_147:0798b25_0",
        "is_bad_quality": false
    }
]