[
    {
        "source_sentence": "大般若波羅蜜多經卷第四十九",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 49",
        "source": "T05n0220_049:0274a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T05n0220_049:0274a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初分摩訶薩品第十三之三",
        "translation": "Thirteenth Third of the First Part of the Mahāsattva Chapter",
        "source": "T05n0220_049:0274a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，具壽舍利子問滿慈子言：「云何名為菩薩摩訶薩為欲利樂諸有情故乘於大乘？」",
        "translation": "It was then that Kauśālīputra asked Pūrṇa Maitrāyaniputra, \"What is the name of a bodhisattva who rides the great vehicle because he wants to bring benefit to sentient beings?\"",
        "source": "T05n0220_049:0274a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滿慈子言：「舍利子！",
        "translation": "Pūrṇa Maitrāyaniputra said, \"Śāriputra!",
        "source": "T05n0220_049:0274a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多時，以應一切智智心，大悲為上首，用無所得而為方便，乘布施波羅蜜多，不得布施，不得布施波羅蜜多，不得施者，不得受者，不得所施物，不得所遮法。",
        "translation": "\"If a bodhisattva Mahāsattva cultivates the perfection of wisdom when he cultivates the perfection of wisdom, using the mind of wisdom that responds to all knowables, great compassion as the foremost thing, and using the ungraspable as the method, he mustn't give alms, mustn't give the perfection of wisdom, mustn't give to the donor, mustn't receive from the donor, mustn't give the thing that's given, and mustn't obscure the Dharma that's given.",
        "source": "T05n0220_049:0274a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0274a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩乘布施波羅蜜多。",
        "translation": "This is the perfection of generosity that the bodhisattvas, the mahāsattvas, cultivate.",
        "source": "T05n0220_049:0274a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩修行般若波羅蜜多時，以應一切智智心，大悲為上首，用無所得而為方便，乘淨戒波羅蜜多，不得淨戒，不得淨戒波羅蜜多，不得持戒者，不得犯戒者，不得所遮法。",
        "translation": "\"If the bodhisattva Mahāsattva cultivates the perfection of wisdom when he cultivates the perfection of wisdom, then with the mind of omniscience and wisdom, great compassion as the foremost thing, and using ungraspable effort as a method, he'll ride the perfection of pure precepts, not allowing pure precepts, not allowing the perfection of pure precepts, not allowing those who observe precepts, not allowing those who violate precepts, and not allowing the obstructed dharmas.",
        "source": "T05n0220_049:0274a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0274a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩乘淨戒波羅蜜多。",
        "translation": "\"This is the perfection of pure morality that the bodhisattvas, the mahāsattvas, ride.",
        "source": "T05n0220_049:0274a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩修行般若波羅蜜多時，以應一切智智心，大悲為上首，用無所得而為方便，乘安忍波羅蜜多，不得安忍，不得安忍波羅蜜多，不得能忍者，不得所忍境，不得所遮法。",
        "translation": "\"If a bodhisattva Mahāsattva cultivates the perfection of wisdom while practicing prajñāpāramitā, using the mind of omniscience and knowledge, great compassion as the foremost thing, and using ungraspable effort as a method, he or she will not be able to ride the perfection of patience, nor will he or she be able to tolerate the perfection of patience, nor will he or she be able to tolerate the objects that are tolerated, nor will he or she be able to obscure the Dharma.",
        "source": "T05n0220_049:0274b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_049:0274b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩乘安忍波羅蜜多。",
        "translation": "This is the perfection of forbearance of the bodhisattva-mahāsattva vehicle.",
        "source": "T05n0220_049:0274b05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩修行般若波羅蜜多時，以應一切智智心，大悲為上首，用無所得而為方便，乘精進波羅蜜多，不得精進，不得精進波羅蜜多，不得精進者，不得懈怠者，不得所遮法。",
        "translation": "\"If the bodhisattva Mahāsattva cultivates the perfection of wisdom while practicing prajñāpāramitā with the mind that responds to all knowables, great compassion as the foremost thing, and using ungraspable effort as a method, he'll ride the perfection of effort, which doesn't allow effort, the perfection of effort, those who don't allow effort, those who don't allow laziness, and those who don't allow the obscured dharmas.",
        "source": "T05n0220_049:0274b06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0274b10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩乘精進波羅蜜多。",
        "translation": "\"This is the perfection of effort of the bodhisattva-mahāsattva vehicle.",
        "source": "T05n0220_049:0274b10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩修行般若波羅蜜多時，以應一切智智心，大悲為上首，用無所得而為方便，乘靜慮波羅蜜多，不得靜慮，不得靜慮波羅蜜多，不得修定者，不得散亂者，不得定境界，不得所遮法。",
        "translation": "\"If a bodhisattva Mahāsattva cultivates the perfection of wisdom when he cultivates the perfection of wisdom, then he should use the mind of omniscience, great compassion as the foremost, and the ungraspable as the method to ride the perfection of concentration, not allowing meditation, not allowing the perfection of concentration, not allowing those who cultivate concentration, not allowing those who are distracted, not allowing the objective realm of concentration, and not allowing the obscured dharmas.",
        "source": "T05n0220_049:0274b11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0274b16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩乘靜慮波羅蜜多。",
        "translation": "\"This is the perfection of concentration that the bodhisattvas, the mahāsattvas, ride.",
        "source": "T05n0220_049:0274b16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩修行般若波羅蜜多時，以應一切智智心，大悲為上首，用無所得而為方便，乘般若波羅蜜多，不得般若，不得般若波羅蜜多，不得修慧者，不得愚癡者，不得過去、未來、現在法，不得善、不善、無記法，不得欲界、色界、無色界法，不得學、無學、非學非無學法，不得見所斷、修所斷、非所斷法，不得世間、出世間法，不得色、無色法，不得有見、無見法，不得有對、無對法，不得有漏、無漏法，不得有為、無為法，不得所遮法。",
        "translation": "「若菩薩摩訶薩修行般若波羅蜜多時，以應一切智智心，大悲為上首，用無所得而為方便，乘般若波羅蜜多，不得般若，不得般若波羅蜜多，不得修慧者，不得愚癡者，不得過去、未來、現在法，不得善、不善、無記法，不得欲界、色界、無色界法，不得學、無學、非學非無學法，不得見所斷、修所斷、非所斷法，不得世間、出世間法，不得色、無色法，不得有見、無見法，不得有對、無對法，不得有漏、無漏法，不得有為、無為法，不得所遮法。",
        "source": "T05n0220_049:0274b17_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0274b26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩乘般若波羅蜜多。",
        "translation": "\"This is the perfection of wisdom of the bodhisattva-mahāsattva vehicle.",
        "source": "T05n0220_049:0274b26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子當知！",
        "translation": "You should know this, Śāriputra!",
        "source": "T05n0220_049:0274b27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_049:0274b27_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_049:0274b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，為遣修故修四念住，為遣修故修四正斷、四神足、五根、五力、七等覺支、八聖道支。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, makes great compassion the head, uses ungraspable effort as a method, cultivates the four abodes of mindfulness in order to expel cultivation, and cultivates the four correct eliminations, four miraculous abilities, five faculties, five powers, seven branches of virtual enlightenment, and eight noble factors of the path in order to expel cultivation.",
        "source": "T05n0220_049:0274b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_049:0274c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0274c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，為遣修故修空解脫門，為遣修故修無相、無願解脫門。",
        "translation": "\"Suppose a bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, takes great compassion as the leader, uses ungraspable effort as a method, cultivates the liberation gate of emptiness in order to expel cultivation, and cultivates the liberation gate of signlessness and wishlessness in order to expel cultivation.",
        "source": "T05n0220_049:0274c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_049:0274c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_049:0274c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，為遣修故修四靜慮，為遣修故修四無量、四無色定。",
        "translation": "\"Suppose a bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, takes great compassion as the foremost thing, uses ungraspable effort as a method, cultivates the four meditations in order to expel cultivation, and cultivates the four immeasurable and four formless concentrations in order to expel cultivation.",
        "source": "T05n0220_049:0274c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0274c11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_049:0274c11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，為遣修故修布施波羅蜜多，為遣修故修淨戒、安忍、精進、靜慮、般若波羅蜜多。",
        "translation": "\"Suppose a bodhisattva Mahāsattva responds with the mind of omniscience and knowledge, takes great compassion as the foremost thing, uses ungraspable effort as a method, cultivates the perfection of generosity in order to expel cultivation, and cultivates the perfections of pure morality, patience, effort, meditation, and wisdom in order to expel cultivation.",
        "source": "T05n0220_049:0274c13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_049:0274c16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_049:0274c16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，為遣修故修五眼，為遣修故修六神通。",
        "translation": "\"Suppose a bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, takes great compassion as the leader, uses ungraspable effort as a method, cultivates the five eyes in order to expel cultivation, and cultivates the six supernormal powers in order to expel cultivation.",
        "source": "T05n0220_049:0274c17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0274c20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva-mahāsattva who rides the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_049:0274c20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，為遣修故修佛十力，為遣修故修四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智。",
        "translation": "\"Suppose a bodhisattva Mahāsattva responds with the mind of omniscience, takes great compassion as the leader, uses ungraspable effort as a method, cultivates the ten powers of the Buddha in order to expel cultivation, and cultivates the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, the 18 uncommon dharmas of the Buddha, omniscience, knowledge of the path, and knowledge of all characteristics in order to expel cultivation.",
        "source": "T05n0220_049:0274c21_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_049:0274c25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0274c25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，為遣修故修內空智、外空智、內外空智、空空智、大空智、勝義空智、有為空智、無為空智、畢竟空智、無際空智、散空智、無變異空智、本性空智、自相空智、共相空智、一切法空智、不可得空智、無性空智、自性空智、無性自性空智。",
        "translation": "\"Suppose a bodhisattva Mahāsattva responds with the mind of omniscience, makes great compassion the leader, and uses ungraspable effort as a method to dispel cultivation in order to cultivate the wisdom of internal emptiness, the wisdom of external emptiness, the wisdom of internal and external emptiness, the wisdom of emptiness, the wisdom of emptiness, the wisdom of great emptiness, the wisdom of ultimate emptiness, the wisdom of emptiness without limit, the wisdom of dispersed emptiness, the wisdom of emptiness without change, the wisdom of emptiness in essence, the wisdom of emptiness in own-nature, the wisdom of emptiness in common, the wisdom of emptiness in all things, the wisdom of ungraspable emptiness, the wisdom of emptiness without nature, the wisdom of emptiness in self-nature, and the wisdom of emptiness in self-nature without nature.",
        "source": "T05n0220_049:0274c26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0275a04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_049:0275a04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_049:0275a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察菩薩摩訶薩但有假名施設言說，菩提及薩埵俱不可得故。",
        "translation": "\"If the bodhisattva Mahāsattva responds to the mind of omniscience, has great compassion as its leader, and uses ungraspable as a method, then he truly observes that the bodhisattva Mahāsattva only has nominal designations and speaks, so neither enlightenment nor sattva can be attained.",
        "source": "T05n0220_049:0275a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_049:0275a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_049:0275a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察色但有假名施設言說，色不可得故；受、想、行、識但有假名施設言說，受、想、行、識不可得故。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and knowledge, with great compassion as the foremost, and uses ungraspable as a method, he or she will truly observe that form exists only by designating words nominally, so form is unobtainable, and feeling, perception, volition, and consciousness exist only by designating words nominally, so feeling, perception, volition, and consciousness are unobtainable.",
        "source": "T05n0220_049:0275a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0275a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0275a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察眼處但有假名施設言說，眼處不可得故；耳、鼻、舌、身、意處但有假名施設言說，耳、鼻、舌、身、意處不可得故。",
        "translation": "\"Suppose a bodhisattva Mahāsattva responds with the mind of omniscience and knowledge, takes great compassion as the leader, and uses ungraspable skill as a method to truly examine the place of the eye only by nominally defining it and speaking about it, so the place of the eye is unobtainable; the places of the ear, nose, tongue, body, and mind only by nominally defining it and speaking about it, so the places of the ear, nose, tongue, body, and mind are unobtainable.",
        "source": "T05n0220_049:0275a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0275a19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_049:0275a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察色處但有假名施設言說，色處不可得故；聲、香、味、觸、法處但有假名施設言說，聲、香、味、觸、法處不可得故。",
        "translation": "\"Suppose a bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, takes great compassion as the foremost, and uses ungraspable skill as a method to truly observe that there are only nominally designated places of form that are explained, so the place of form is unobtainable, and there are only nominally designated places of sound, odor, taste, touch, and dharma that are explained, so the places of sound, odor, taste, touch, and dharma are unobtainable.",
        "source": "T05n0220_049:0275a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0275a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0275a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察眼界但有假名施設言說，眼界不可得故；色界、眼識界及眼觸、眼觸為緣所生諸受但有假名施設言說，色界乃至眼觸為緣所生諸受不可得故。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and knowledge, with great compassion as the foremost thing, and uses ungraspable skill as a method, he or she will truly observe that the eye realm only has nominal designations and expressions, so the eye realm is unobtainable; the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as a condition only have nominal designations and expressions, so the form realm and even the sensations that arise from eye contact as a condition are unobtainable.",
        "source": "T05n0220_049:0275a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0275b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0275b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察耳界但有假名施設言說，耳界不可得故；聲界、耳識界及耳觸、耳觸為緣所生諸受但有假名施設言說，聲界乃至耳觸為緣所生諸受不可得故。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, with great compassion as the foremost, and uses ungraspable skill as a method, he or she will truly observe that the ear realm only has nominal designations and expressions, so the ear realm is inaccessible; the sound realm, the ear-consciousness realm, and the sensations that arise from ear contact and ear contact as conditions only have nominal designations and expressions, so the sound realm and even the sensations that arise from ear contact as conditions are inaccessible.",
        "source": "T05n0220_049:0275b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0275b08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0275b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察鼻界但有假名施設言說，鼻界不可得故；香界、鼻識界及鼻觸、鼻觸為緣所生諸受但有假名施設言說，香界乃至鼻觸為緣所生諸受不可得故。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, with great compassion as the foremost, and uses ungraspable skill as a method, he'll truly observe that the nasal realm only has nominal designations and expressions, so the nasal realm is inaccessible; the fragrance realm, the nasal consciousness realm, and the sensations that arise from nasal contact and nasal contact as a condition only have nominal designations and expressions, so the fragrance realm and even the sensations that arise from nasal contact as a condition are inaccessible.",
        "source": "T05n0220_049:0275b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0275b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0275b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察舌界但有假名施設言說，舌界不可得故；味界、舌識界及舌觸、舌觸為緣所生諸受但有假名施設言說，味界乃至舌觸為緣所生諸受不可得故。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and knowledge, with great compassion as the foremost thing, and uses ungraspable skill as a method, he or she will truly observe that the tongue realm exists only by nominally defining words, so the tongue realm is inaccessible; the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact as a condition exist only by nominally defining words, so the taste realm and even the sensations that arise from tongue contact as a condition are inaccessible.",
        "source": "T05n0220_049:0275b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "[T]hey are not obtainable because the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue-contact as a condition are only nominally defined by language, and the taste realm and the sensations that arise from tongue-contact as a condition are not obtainable.",
        "source": "T05n0220_049:0275b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0275b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察身界但有假名施設言說，身界不可得故；觸界、身識界及身觸、身觸為緣所生諸受但有假名施設言說，觸界乃至身觸為緣所生諸受不可得故。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, with great compassion as the foremost thing, and uses ungraspable skill as a method, he or she will truly observe that the body realm only has nominal designations and expressions, so the body realm is inaccessible; the contact realm, the body-consciousness realm, and the sensations that arise from body contact and body contact as a condition only have nominal designations and expressions, so the contact realm and even the sensations that arise from body contact as a condition are inaccessible.",
        "source": "T05n0220_049:0275b22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0275b27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0275b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察意界但有假名施設言說，意界不可得故；法界、意識界及意觸、意觸為緣所生諸受但有假名施設言說，法界乃至意觸為緣所生諸受不可得故。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, with great compassion as the foremost thing, and uses ungraspable skill as a method, he or she will truly observe that the mind realm only has nominal designations and expressions, so the mind realm is inaccessible; the Dharma realm, the realm of consciousness, and the sensations that arise from mental contact and mental contact as conditions only have nominal designations and expressions, so the Dharma realm and even the sensations that arise from mental contact as conditions are inaccessible.",
        "source": "T05n0220_049:0275b29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0275c05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0275c05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察地界但有假名施設言說，地界不可得故；水、火、風、空、識界但有假名施設言說，水、火、風、空、識界不可得故。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, with great compassion as the foremost thing, and uses ungraspable skill as a method, he'll truly observe that the earth realm exists only in terms of nominal designations and expressions, so the earth realm is unobtainable, and the realms of water, fire, wind, air, and consciousness exist only in terms of nominal designations and expressions, so the realms of water, fire, wind, air, and consciousness are unobtainable.",
        "source": "T05n0220_049:0275c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0275c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0275c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察苦聖諦但有假名施設言說，苦聖諦不可得故；集、滅、道聖諦但有假名施設言說，集、滅、道聖諦不可得故。",
        "translation": "\"Suppose the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, takes great compassion as the foremost, and uses ungraspable as a method to truly observe that the noble truth of suffering exists only in terms of nominal designations and expressions, so the noble truth of suffering is unobtainable; the noble truths of accumulation, cessation, and the path exist only in terms of nominal designations and expressions, so the noble truths of accumulation, cessation, and the path are unobtainable.",
        "source": "T05n0220_049:0275c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0275c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva-mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0275c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察無明但有假名施設言說，無明不可得故；行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱但有假名施設言說，行乃至老死愁歎苦憂惱不可得故。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, with great compassion as the foremost, and uses ungraspable as a method, he or she will truly observe that ignorance exists only by nominally defining words, so ignorance is unobtainable; and form, consciousness, name-and-form, the six sense-fields, contact, sensation, craving, appropriation, existence, birth, and the sorrow, pain, and vexation of old age and death exist only by nominally defining words, so form and even the sorrow, pain, and vexation of old age and death are unobtainable.",
        "source": "T05n0220_049:0275c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0275c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0275c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察內空但有假名施設言說，內空不可得故；外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空但有假名施設言說，外空乃至無性自性空不可得故。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, with great compassion as the foremost, and uses ungraspable skill as a method, he or she will truly observe internal emptiness but with nominal designations and expressions, so internal emptiness is unobtainable; external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, infinite emptiness, dispersed emptiness, immutable emptiness, intrinsic emptiness, self-subject emptiness, shared-subject emptiness, emptiness of all things, unobtainable emptiness, natureless emptiness, self-nature emptiness, and natureless self-nature emptiness but with nominal designations and expressions, so external emptiness and even natureless self-nature emptiness are unobtainable.",
        "source": "T05n0220_049:0275c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0276a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0276a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察真如但有假名施設言說，真如不可得故；法界、法性、法定、法住、離生性、平等性、實際但有假名施設言說，法界乃至實際不可得故。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, with great compassion as the foremost, and uses ungraspable skill as a method, he or she will truly observe that there's only a nominal designation and expression for true thusness, and that the true thusness is unobtainable; and that the Dharma realm, Dharma nature, legal law, Dharma abiding, freedom from birth, equality, and reality are only nominal designations and expressions, and the Dharma realm and even the reality are unobtainable.",
        "source": "T05n0220_049:0276a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0276a08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva-mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0276a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察四靜慮但有假名施設言說，四靜慮不可得故；四無量、四無色定但有假名施設言說，四無量、四無色定不可得故。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, with great compassion as the foremost, and uses ungraspable as a method, he or she will truly observe that the four meditations only have nominal designations and expressions, and the four immeasurable and four formless concentrations only have nominal designations and expressions, and the four immeasurable and four formless concentrations are therefore ungraspable.",
        "source": "T05n0220_049:0276a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0276a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva-mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0276a14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察四念住但有假名施設言說，四念住不可得故；四正斷、四神足、五根、五力、七等覺支、八聖道支但有假名施設言說，四正斷乃至八聖道支不可得故。",
        "translation": "\"If the bodhisattva Mahāsattva uses the mind of omniscience, great compassion as the foremost, and ungraspable as the method to truly observe the four abodes of mindfulness only by nominally defining them and speaking of them, it's because the four abodes of mindfulness are unobtainable; the fourfold elimination, the four miraculous abilities, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble path factors are only nominally defining and speaking of them, and the fourfold elimination and even the eight noble path factors are unobtainable.",
        "source": "T05n0220_049:0276a15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0276a20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0276a20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察空解脫門但有假名施設言說，空解脫門不可得故；無相、無願解脫門但有假名施設言說，無相、無願解脫門不可得故。",
        "translation": "\"Suppose the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, makes great compassion the head, and uses ungraspable as a method to truly observe that the liberation gate of emptiness only has nominal designations and expressions, so the liberation gate of emptiness is unobtainable; the liberation gate of signlessness and wishlessness only has nominal designations and expressions, so the liberation gate of signlessness and wishlessness is unobtainable.",
        "source": "T05n0220_049:0276a21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0276a26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0276a26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察布施波羅蜜多但有假名施設言說，布施波羅蜜多不可得故；淨戒、安忍、精進、靜慮、般若波羅蜜多但有假名施設言說，淨戒乃至般若波羅蜜多不可得故。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, takes great compassion as the foremost thing, and uses ungraspable skill as a means to truly observe that the perfection of generosity exists only by nominally defining words, then the perfection of generosity is unobtainable; and the perfections of pure morality, patience, effort, meditation, and prajñā are only nominally defining words, then the perfections of pure morality and even prajñā are unobtainable.",
        "source": "T05n0220_049:0276a27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0276b03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0276b04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察五眼但有假名施設言說，五眼不可得故；六神通但有假名施設言說，六神通不可得故。",
        "translation": "\"Suppose the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, takes great compassion as the foremost, and uses unobtainable as a method to truly observe that the five eyes only have nominal designations and expressions, so the five eyes are unobtainable, and the six supernormal powers only have nominal designations and expressions, so the six supernormal powers are unobtainable.",
        "source": "T05n0220_049:0276b05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0276b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva-mahāsattva's desire to bring benefit and joy to sentient beings while riding in the great vehicle.",
        "source": "T05n0220_049:0276b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察佛十力但有假名施設言說，佛十力不可得故；四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智但有假名施設言說，四無所畏乃至一切相智不可得故。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, with great compassion as the foremost, and uses ungraspable as a method, he or she will truly examine the Buddha's ten powers but will nominally define them and speak of them, so the Buddha's ten powers are unobtainable; the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, the 18 uncommon dharmas of the Buddha, omniscience, knowledge of the path, and knowledge of all characteristics but will nominally define them and speak of them, so the four fearlessnesses and even the knowledge of all characteristics are unobtainable.",
        "source": "T05n0220_049:0276b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0276b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "\"This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to bring benefit and joy to sentient beings.",
        "source": "T05n0220_049:0276b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，如實觀察無上正等菩提但有假名施設言說，無上正等菩提不可得故；無上正等覺者但有假名施設言說，無上正等覺者不可得故。",
        "translation": "\"If the bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, with great compassion as the foremost thing, and uses unobtainable as a method, then he accurately observes that unsurpassed correct enlightenment exists only in nominal terms and defines it, and unsurpassed correct enlightenment is unobtainable because unsurpassed correct enlightenment exists only in nominal terms and defines it.",
        "source": "T05n0220_049:0276b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0276b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_049:0276b22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T05n0220_049:0276b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩，以應一切智智心，大悲為上首，用無所得而為方便，從初發心乃至證得無上菩提，恒修圓滿不退神通，成熟有情、嚴淨佛土，從一佛國至一佛國，供養恭敬、尊重讚嘆諸佛世尊，於諸佛所聽受大乘相應之法，既聽受已，如理思惟，精勤修學。",
        "translation": "\"Suppose a bodhisattva Mahāsattva responds with the mind of omniscience, makes great compassion the foremost thing, uses ungraspable effort as a method, starts from the initial aspiration and goes on to realize unsurpassed enlightenment, constantly cultivates perfect irreversible supernormal abilities, matures sentient beings, purifies the Buddha-lands, goes from one Buddha-land to another, makes offerings to and respects and praises the world-honored buddhas, listens to and accepts the teachings associated with the great vehicle from the buddhas, and after listening and accepting them, reflects on them according to reason and diligently cultivates them.",
        "source": "T05n0220_049:0276b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Venerable Śāriputra!",
        "source": "T05n0220_049:0276c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲利樂諸有情故乘於大乘。",
        "translation": "This is the bodhisattva Mahāsattva who rides the great vehicle because he wants to improve the well-being of sentient beings.",
        "source": "T05n0220_049:0276c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_049:0276c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩摩訶薩雖乘大乘，從一佛國至一佛國，供養恭敬、尊重讚嘆諸佛世尊，於諸佛所聽受正法，成熟有情、嚴淨佛土，而心初無佛國等想。",
        "translation": "Although bodhisattvas and mahāsattvas ride the great vehicle from one Buddha-land to another, make offerings to, honor, and praise the world-honored buddhas, listen to and accept the right teaching in those buddha-places, ripen sentient beings, and purify the Buddha-lands, they don't have any conceptions of Buddha-lands or the like in their minds in the first place.",
        "source": "T05n0220_049:0276c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Venerable Śāriputra!",
        "source": "T05n0220_049:0276c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩摩訶薩住不二地，觀諸有情應以何身得義利者，即便現受令彼獲益。",
        "translation": "Thus, the bodhisattva Mahāsattva abides in the stage of nonduality and observes the bodies of sentient beings that should obtain meaningful benefits, so that he can accept them in the present and cause them to obtain benefits.",
        "source": "T05n0220_049:0276c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_049:0276c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩摩訶薩乃至證得一切智智，隨所生處不離大乘。",
        "translation": "Thus, the bodhisattvas, mahāsattvas, up to the point of realizing omniscience, follow wherever they are born and don't part from the great vehicle.",
        "source": "T05n0220_049:0276c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Vairocana!",
        "source": "T05n0220_049:0276c09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩摩訶薩不久當得一切智智，為人、天等轉正法輪。",
        "translation": "Thus, the bodhisattva Mahāsattva will soon attain the wisdom of omniscience and will turn the right Dharma wheel for humans and gods alike.",
        "source": "T05n0220_049:0276c09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是法輪，一切聲聞、獨覺、沙門、婆羅門、魔王、梵王、天、龍、藥叉、健達縛、阿素洛、揭路荼、緊捺洛、莫呼洛伽、人非人等，一切世間所不能轉。",
        "translation": "Such a turning of the wheel of the Dharma is beyond the ability of all śrāvakas, pratyekbuddhas, ascetics, priests, Māra kings, Brahmā kings, gods, dragons, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoraghas, humans and nonhumans, and other worldly beings.",
        "source": "T05n0220_049:0276c10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T05n0220_049:0276c13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸菩薩由如是等方便善巧，為欲利樂一切有情，乘大乘故復名摩訶薩。",
        "translation": "Because bodhisattvas thus skillfully perform tasks for the benefit and welfare of all sentient beings, they are again called mahāsattvas because they ride the great vehicle.",
        "source": "T05n0220_049:0276c13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T05n0220_049:0276c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是為欲利樂諸有情故乘於大乘菩薩摩訶薩，普為十方各如殑伽沙等世界諸佛世尊，於大眾中歡喜讚嘆，作如是言：『某方某世界中有某名菩薩摩訶薩，為欲利樂諸有情故乘於大乘，不久當得一切智智，為天、人等轉正法輪，其輪世間天、人、魔、梵、聲聞等眾皆不能轉。』",
        "translation": "Thus, for the benefit of sentient beings, the bodhisattva Mahāsattva who rides the great vehicle is universally praised by the buddhas and world-honored ones in the ten directions as being like the sands of the Ganges, who rejoice in the masses and say, 'In a certain world in a certain direction, there's a certain bodhisattva Mahāsattva who rides the great vehicle for the benefit of sentient beings and will soon attain the wisdom of omniscience and turn the right Dharma wheel for gods, humans, Māra, Brahmā, śrāvakas, and others, a wheel that worldly gods, humans, Māra, Brahmā, and śrāvakas can't turn.'",
        "source": "T05n0220_049:0276c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是展轉聲遍十方，天、人等眾聞皆歡喜，咸作是言：『如是菩薩不久當得一切智智，轉正法輪利安含識。』」",
        "translation": "When the sound of such a transfer spreads throughout the ten directions, the gods, humans, and others who hear it rejoice and say, 'Thus, the bodhisattva will soon attain the wisdom of omniscience and turn the right Dharma wheel to benefit the arhat consciousness.'\"",
        "source": "T05n0220_049:0276c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初分大乘鎧品第十四之一",
        "translation": "First Part, Mahāyāna Armor, Chapter 14, Part 1",
        "source": "T05n0220_049:0276c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "At that point, Kauśāmbī said to the Buddha, \"Bhagavān!",
        "source": "T05n0220_049:0276c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如說菩薩摩訶薩擐大乘鎧者，云何名為菩薩摩訶薩擐大乘鎧？」",
        "translation": "If it's said that a bodhisattva-mahāsattva takes the armor of the great vehicle, what is it called when a bodhisattva-mahāsattva takes the armor of the great vehicle?\"",
        "source": "T05n0220_049:0276c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, \"Good performance!",
        "source": "T05n0220_049:0276c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩擐布施波羅蜜多鎧，擐淨戒、安忍、精進、靜慮、般若波羅蜜多鎧，善現！",
        "translation": "If bodhisattvas, mahāsattvas, are armed with the perfection of generosity and the perfection of morality, forbearance, effort, meditation, and wisdom, well done!",
        "source": "T05n0220_049:0276c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩擐大乘鎧。",
        "translation": "Thus, this is called the bodhisattva-mahāsattva taking on the armor of the great vehicle.",
        "source": "T05n0220_049:0277a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩擐四靜慮鎧，擐四無量、四無色定鎧，善現！",
        "translation": "\"If the bodhisattva-mahāsattva takes the armor of the four meditations and the armor of the four immeasurable and four formless concentrations, good man!",
        "source": "T05n0220_049:0277a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩擐大乘鎧。",
        "translation": "Thus, this is called the bodhisattva-mahāsattva's armor of the great vehicle.",
        "source": "T05n0220_049:0277a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩擐四念住鎧，擐四正斷、四神足、五根、五力、七等覺支、八聖道支鎧，善現！",
        "translation": "\"If the bodhisattva-mahāsattva takes the armor of the four abodes of mindfulness and the armor of the four correct eliminations, four miraculous powers, five faculties, five powers, seven factors of virtual enlightenment, and eight noble factors of the path, good performance!",
        "source": "T05n0220_049:0277a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩擐大乘鎧。",
        "translation": "Thus, this is called the bodhisattva-mahāsattva's armor of the great vehicle.",
        "source": "T05n0220_049:0277a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩擐內空鎧，擐外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空鎧，善現！",
        "translation": "\"If the bodhisattva-mahāsattva wears the armor of inner emptiness, outer emptiness, inner and outer emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, unchanging emptiness, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all things, inaccessible emptiness, emptiness without nature, emptiness of self-nature, emptiness of self-nature, and emptiness of self-nature without nature, well-present!",
        "source": "T05n0220_049:0277a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩擐大乘鎧。",
        "translation": "Thus, this is called the bodhisattva-mahāsattva taking the armor of the great vehicle.",
        "source": "T05n0220_049:0277a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩擐五眼鎧，擐六神通鎧，善現！",
        "translation": "\"If the bodhisattvas, mahāsattvas, and guardians of the five eyes and the six supernormal powers were to enter into this armor, well-present!",
        "source": "T05n0220_049:0277a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩擐大乘鎧。",
        "translation": "Thus, this is called the bodhisattva-mahāsattva taking the armor of the great vehicle.",
        "source": "T05n0220_049:0277a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩擐佛十力鎧，擐四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智鎧，善現！",
        "translation": "\"If the bodhisattva-mahāsattva is armed with the Buddha's ten powers, the armor of the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, the 18 uncommon dharmas of the Buddha, omniscience, knowledge of the path, and knowledge of all characteristics, well-present!",
        "source": "T05n0220_049:0277a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩擐大乘鎧。",
        "translation": "Thus, this is called the bodhisattva-mahāsattva wearing the armor of the great vehicle.",
        "source": "T05n0220_049:0277a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩擐佛身相諸功德鎧，善現！",
        "translation": "\"Suppose the bodhisattvas, mahāsattvas, and buddhas armor themselves with all the merits of the Buddha's body, good man!",
        "source": "T05n0220_049:0277a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩擐大乘鎧。",
        "translation": "Thus, this is called the bodhisattva-mahāsattva taking on the great vehicle armor.",
        "source": "T05n0220_049:0277a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T05n0220_049:0277a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩擐如是等諸功德鎧，放大光明遍照三千大千世界，亦令此界六三變動。",
        "translation": "\"If the bodhisattva Mahāsattva were to armor such merits and magnify their light to shine everywhere in the 3,000 great thousand worlds, it would also cause six or three changes in this world.",
        "source": "T05n0220_049:0277a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中地獄，火等苦具及彼有情身心痛惱皆得除滅，菩薩知其既離眾苦，便為稱讚三寶功德，彼得聞已身心安樂，從自趣沒生天人中，即得奉覲諸佛菩薩，親承供養稟正法音。",
        "translation": "Knowing that they've escaped from all suffering, the bodhisattva praises the merits of the Three Treasures, and when Peter hears about it, he's soothed in body and spirit that he's reborn among gods and humans from his own destiny, where he can then go to the buddhas and bodhisattvas, make offerings to them, and uphold the voice of the true Dharma.",
        "source": "T05n0220_049:0277a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中傍生，互相殘害鞭撻驅逼，無量種苦皆得除滅，菩薩知其既離眾苦，亦為稱讚三寶功德，彼得聞已身心安樂，從自趣沒生天人中，即得奉覲諸佛菩薩，親承供養稟正法音。",
        "translation": "Among them are the animals that inflict harm on each other, are whipped and driven away, and experience an end to measureless kinds of suffering. Knowing that they are free of suffering and praising the merits of the Three Treasures, the bodhisattva hears that, and is at peace in body and spirit, Peter goes from his destiny to be born among gods and humans, where he is able to present himself to the buddhas and bodhisattvas, make offerings to them, and present the true voice of the Dharma.",
        "source": "T05n0220_049:0277a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中鬼界，恐怖飢渴身心焦惱，無量種苦皆得除滅，菩薩知其既離眾苦，亦為稱讚三寶功德，彼得聞已身心安樂，從自趣沒生天人中，即得奉覲諸佛菩薩，親承供養稟正法音。",
        "translation": "Among them is the realm of ghosts, where terror, hunger, thirst, physical and mental anguish, and measureless kinds of suffering are all removed. Knowing that they are free of suffering and praising the merits of the Three Treasures, the bodhisattva hears that he's at peace in body and spirit and is reborn among gods and humans from his own destiny, where he's able to present himself to the buddhas and bodhisattvas, make offerings to them, and present the right Dharma voice.",
        "source": "T05n0220_049:0277a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "\"Well done!",
        "source": "T05n0220_049:0277b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩擐大乘鎧。",
        "translation": "Thus, this is called the bodhisattva Mahāsattva donning the armor of the great vehicle.",
        "source": "T05n0220_049:0277b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩擐如是等諸功德鎧，放大光明遍照十方各如殑伽沙等諸佛世界，亦令彼界六三變動。",
        "translation": "\"If the bodhisattva Mahāsattva were to armor himself with such merits, the magnificent light would shine everywhere in the ten directions, such as in the sands of the buddha worlds, and cause those realms to undergo six or three transformations.",
        "source": "T05n0220_049:0277b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中地獄、傍生、鬼界所有眾苦皆得除滅，菩薩知其既離眾苦，亦為稱讚三寶功德，彼得聞已身心安樂，從自趣沒生天人中，即得奉覲諸佛菩薩，親承供養稟正法音。",
        "translation": "Knowing that he's freed from all suffering and praising the merits of the Three Treasures, the bodhisattva praises the Three Treasures, and knowing that he's freed from suffering and praising the merits of the Three Treasures, Peter is so happy in body and spirit after hearing this that he goes from his own destiny to be born among gods and humans, where he can then go to the buddhas and bodhisattvas, make offerings to them, and present the right Dharma voice.",
        "source": "T05n0220_049:0277b07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "\"Well done!",
        "source": "T05n0220_049:0277b11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩擐大乘鎧。",
        "translation": "Thus, this is called the bodhisattva-mahāsattva taking on the great vehicle armor.",
        "source": "T05n0220_049:0277b11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T05n0220_049:0277b12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如巧幻師或彼弟子，於四衢道在大眾前，幻作地獄、傍生、鬼界無量有情各受眾苦，亦復放光變動大地，令彼有情眾苦皆息，復為稱讚佛、法、僧寶，令彼聞已身心安樂，從自趣沒生天人中，承事供養諸佛菩薩，於諸佛所稟正法音。",
        "translation": "Like a clever illusionist or his disciple who conjures up images of measureless sentient beings in hell, unliving beings, and the realm of ghosts each suffering in front of the masses in the four quadrants, he also emits a light that changes the earth, causing all the suffering of those sentient beings to cease, and praises the Buddha, Dharma, and saṃgha treasures, causing them to hear them and experience physical and mental well-being, be reborn among gods and humans from their own destinies, serve and make offerings to the buddhas and bodhisattvas, and present the right Dharma voice to the buddhas.",
        "source": "T05n0220_049:0277b12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Sugata!",
        "source": "T05n0220_049:0277b17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T05n0220_049:0277b17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是幻事為有實不？」",
        "translation": "Are such illusory things real?\"",
        "source": "T05n0220_049:0277b17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「不也！",
        "translation": "The Zenkai replied, \"No!",
        "source": "T05n0220_049:0277b18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T05n0220_049:0277b18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「菩薩摩訶薩擐如是等諸功德鎧，放大光明變動大地，拔濟無量世界有情三惡趣苦，令生天人見佛聞法亦復如是，雖有所為而無一實。",
        "translation": "The Buddha told Śaṅgālī, \"The bodhisattva Mahāsattva possesses this kind of armor, which magnifies light and changes the earth to relieve the suffering of the three bad destinies of sentient beings in measureless worlds and causes born-again gods and humans to see the Buddha and hear the Dharma in the same way, even though there's something to be done but none of it is real.",
        "source": "T05n0220_049:0277b18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_049:0277b22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T05n0220_049:0277b22_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法性空皆如幻故。",
        "translation": "The nature of all things is empty, and they're all illusory.",
        "source": "T05n0220_049:0277b22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T05n0220_049:0277b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩安住布施波羅蜜多，普化三千大千世界如吠琉璃，亦化自身為轉輪王，七寶眷屬導從圍繞，其中有情須食與食，須飲與飲，須衣與衣，須乘與乘，塗香、末香、燒香、花鬘、房舍、臥具、燈燭、醫藥、金銀、真珠、珊瑚、璧玉及餘種種資生之具，隨其所須一切施與。",
        "translation": "If the bodhisattva Mahāsattva abides in the perfection of giving, he'll universally transform 3,000 great thousand worlds like vaiḍūrya, and he'll transform himself into a wheel-turning king surrounded by a retinue of seven treasures, giving whatever sentient beings therein need to eat and drink, clothing and clothing, vehicles and vehicles, perfume, powdered incense, burning incense, flower garlands, dwellings, bedding, lamps and candles, medicines, gold and silver, genuine pearls, coral, jade, and various other necessities, as they need them.",
        "source": "T05n0220_049:0277b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是施已，復為宣說六波羅蜜多相應之法，令彼聞已乃至證得阿耨多羅三藐三菩提，於六波羅蜜多相應之法常不捨離。",
        "translation": "After making this gift, he then explains the principle that the six perfections are associated with many things, so that after listening to them and until they realize supreme perfect enlightenment, they'll never part with the principle that the six perfections are associated with many things.",
        "source": "T05n0220_049:0277b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Sugata!",
        "source": "T05n0220_049:0277c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩擐大乘鎧。",
        "translation": "Thus, this is called the bodhisattva-mahāsattva taking on the great vehicle armor.",
        "source": "T05n0220_049:0277c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T05n0220_049:0277c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如巧幻師或彼弟子，於四衢道在大眾前，幻作種種貧窮、孤露、根支殘缺、疾病有情，隨其所須皆幻施與。",
        "translation": "\"Suppose a clever illusionist or his disciple conjures up various poor, orphaned, root-deficient, or sick sentient beings in front of the public on the four roads, and they conjure them up as they need them and give them alms.",
        "source": "T05n0220_049:0277c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, sir!",
        "source": "T05n0220_049:0277c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T05n0220_049:0277c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是幻事為有實不？」",
        "translation": "Are such illusory things real?\"",
        "source": "T05n0220_049:0277c06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「不也！",
        "translation": "The Zenkai replied, \"No!",
        "source": "T05n0220_049:0277c07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T05n0220_049:0277c07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「菩薩摩訶薩安住布施波羅蜜多，或化世界如吠琉璃，或化自身為輪王等，隨有情類所須施與，及為宣說六波羅蜜多相應之法亦復如是，雖有所為而無一實。",
        "translation": "The Buddha told Śaṅgālī, \"When a bodhisattva Mahāsattva abides in the perfection of generosity, he might transform a world like Vairocana or himself into a wheel-turning king, etc., give to each type of sentient being as needed, and likewise he might explain the six perfections and the associated teaching, even though there's something to do, but none of them is real.",
        "source": "T05n0220_049:0277c07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_049:0277c11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T05n0220_049:0277c11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法性空皆如幻故。",
        "translation": "The nature of all things is empty, and they're all illusory.",
        "source": "T05n0220_049:0277c12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T05n0220_049:0277c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩自住淨戒波羅蜜多，為欲利樂諸有情故，生轉輪王家紹轉輪王位，安立無量百千俱胝那庾多有情於十善業道，或復安立無量百千俱胝那庾多有情於四靜慮，若四無量、四無色定，或復安立無量百千俱胝那庾多有情於四念住，若四正斷、四神足、五根、五力、七等覺支、八聖道支，或復安立無量百千俱胝那庾多有情於空解脫門，若無相、無願解脫門，或復安立無量百千俱胝那庾多有情於布施波羅蜜多，若淨戒、安忍、精進、靜慮、般若波羅蜜多，或復安立無量百千俱胝那庾多有情於五眼，若六神通，或復安立無量百千俱胝那庾多有情於佛十力，若四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智，令安住已乃至證得阿耨多羅三藐三菩提，於如是法常不捨離。",
        "translation": "If a bodhisattva-mahāsattva abides in the perfection of pure morality for himself, then for the sake of the welfare of sentient beings, he's born into a family of wheel-turning kings and prospers in the position of wheel-turning king.",
        "source": "T05n0220_049:0277c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well-present!",
        "source": "T05n0220_049:0277c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩擐大乘鎧。",
        "translation": "Thus, this is called the bodhisattva-mahāsattva taking on the great vehicle armor.",
        "source": "T05n0220_049:0277c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T05n0220_049:0278a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如巧幻師或彼弟子，於四衢道在大眾前，幻作無量有情，令住十善業道，或復令住四靜慮乃至一切相智。",
        "translation": "\"Suppose a clever illusionist or his disciple conjures up measureless sentient beings in front of the great crowd on the four paths, causing them to abide in the ten good actions or to abide in the four meditations and even the cognition of all characteristics.",
        "source": "T05n0220_049:0278a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Sugata!",
        "source": "T05n0220_049:0278a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T05n0220_049:0278a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是幻事為有實不？」",
        "translation": "Are such illusory things real?\"",
        "source": "T05n0220_049:0278a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「不也！",
        "translation": "The Zenkai replied, \"No!",
        "source": "T05n0220_049:0278a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T05n0220_049:0278a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「菩薩摩訶薩為有情故，生轉輪王家紹轉輪王位，安立無量百千俱胝那庾多有情於十善業道，或復安立無量百千俱胝那庾多有情於四靜慮乃至一切相智亦復如是，雖有所為而無一實。",
        "translation": "The Buddha told Śaṅgālī, \"For the sake of sentient beings, the bodhisattva Mahāsattva is born into a family of wheel-turning kings and takes up the position of wheel-turning king, establishing measureless hundreds of thousands of koṭīs of nayutas of sentient beings on the path of the ten good actions, or establishing measureless hundreds of thousands of koṭīs of nayutas of sentient beings on the four meditations and even the wisdom of all characteristics in the same way, even though there are things that are made but none of them are real.",
        "source": "T05n0220_049:0278a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_049:0278a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T05n0220_049:0278a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法性空皆如幻故。",
        "translation": "The nature of all things is empty, and they're all illusory.",
        "source": "T05n0220_049:0278a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T05n0220_049:0278a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩自住安忍波羅蜜多，亦勸無量百千俱胝那庾多有情，令住安忍波羅蜜多。",
        "translation": "If a bodhisattva Mahāsattva personally abides in the perfection of patience, he also encourages measureless hundreds of thousands of koṭīs of sentient beings to abide in the perfection of patience.",
        "source": "T05n0220_049:0278a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Sugata!",
        "source": "T05n0220_049:0278a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩自住安忍波羅蜜多，亦勸無量百千俱胝那庾多有情，令住安忍波羅蜜多？",
        "translation": "How does the bodhisattva Mahāsattva himself abide in the perfection of patience and also encourage measureless hundreds of thousands of koṭīs of sentient beings to abide in the perfection of patience?",
        "source": "T05n0220_049:0278a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T05n0220_049:0278a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩從初發心乃至證得一切智智，擐安忍鎧常自念言：『假使一切有情持刀杖塊等來見加害，我終不起一念忿心，勸諸有情亦如是忍。』",
        "translation": "If a bodhisattva-mahāsattva, from the time he first arouses his aspiration until he realizes the knowledge of all wisdom, always puts up his armor and says, 'Suppose all sentient beings come to see harm with swords, staves, and so forth, I'll never bear a single thought of anger and encourage sentient beings to tolerate it in the same way.'",
        "source": "T05n0220_049:0278a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Sugata!",
        "source": "T05n0220_049:0278a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩如心所念境觸無違，勸諸有情住如是忍，乃至證得阿耨多羅三藐三菩提，於如是忍常不捨離。",
        "translation": "Thus, the bodhisattva Mahāsattva mindfully observes objects without contradicting them, encourages sentient beings to abide in such forbearance, and even realizes unsurpassed, correct enlightenment, and never abandons such forbearance.",
        "source": "T05n0220_049:0278a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Sugata!",
        "source": "T05n0220_049:0278a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩擐大乘鎧。",
        "translation": "Thus, this is called the bodhisattva-mahāsattva taking on the great vehicle armor.",
        "source": "T05n0220_049:0278a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T05n0220_049:0278a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如巧幻師或彼弟子，於四衢道在大眾前，幻作種種諸有情類，各各執持刀杖塊等，加害幻師或彼弟子，時幻師等於幻有情，都不起心欲為怨報，而勸彼住如是安忍。",
        "translation": "\"When an illusionist or his disciple conjures up a variety of sentient beings in front of the public on the four roads, each wielding a sword, stick, or block, and so forth, to harm the illusionist or his disciple, the illusionist and others don't become intent on taking revenge on the illusionary beings but instead encourage them to abide in such peaceful tolerance.",
        "source": "T05n0220_049:0278a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "\"Well done, Sugata!",
        "source": "T05n0220_049:0278a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T05n0220_049:0278a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是幻事為有實不？」",
        "translation": "Are such illusory things real?\"",
        "source": "T05n0220_049:0278a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「不也！",
        "translation": "The Zenkai replied, \"No!",
        "source": "T05n0220_049:0278a27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T05n0220_049:0278a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「菩薩摩訶薩擐安忍鎧，自住安忍波羅蜜多，亦勸無量百千俱胝那庾多有情，令住安忍波羅蜜多，常不捨離亦復如是，雖有所為而無一實。",
        "translation": "The Buddha told Śaṅgālī, \"The bodhisattva Mahāsattva wears the armor of patience and abides in the perfection of patience, and he encourages measureless hundreds of thousands of koṭīs of sentient beings to abide in the perfection of patience and never part with it, just like that, even though he does something, there's no single reality.",
        "source": "T05n0220_049:0278a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_049:0278b02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T05n0220_049:0278b02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法性空皆如幻故。",
        "translation": "The nature of all things is empty, and they're all illusory.",
        "source": "T05n0220_049:0278b02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T05n0220_049:0278b02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩自住精進波羅蜜多，亦勸無量百千俱胝那庾多有情，令住精進波羅蜜多。",
        "translation": "If a bodhisattva-mahāsattva abides in the perfection of effort on his own, he also encourages measureless hundreds of thousands of sentient beings who are calluses toayu to abide in the perfection of effort.",
        "source": "T05n0220_049:0278b03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Sugata!",
        "source": "T05n0220_049:0278b05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩自住精進波羅蜜多，亦勸無量百千俱胝那庾多有情，令住精進波羅蜜多？",
        "translation": "How does the bodhisattva Mahāsattva himself abide in the perfection of effort and also encourage measureless hundreds of thousands of koṭīs of sentient beings to abide in the perfection of effort?",
        "source": "T05n0220_049:0278b05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T05n0220_049:0278b07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩以應一切智智心身心精進，斷諸惡法修諸善法，亦勸無量百千俱胝那庾多有情，修習如是身心精進，乃至證得阿耨多羅三藐三菩提，於如是精進常不捨離。",
        "translation": "If a bodhisattva-mahāsattva makes effort with body and mind that responds to omniscience, stops bad qualities and cultivates good qualities, and encourages measureless hundreds of thousands of koṭīs of sentient beings to cultivate such effort with body and mind up to the point of realizing unsurpassed, correct enlightenment, he'll never abandon such effort.",
        "source": "T05n0220_049:0278b07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, sentient beings!",
        "source": "T05n0220_049:0278b11_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩擐大乘鎧。",
        "translation": "Thus, this is called the bodhisattva-mahāsattva taking on the great vehicle armor.",
        "source": "T05n0220_049:0278b11_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T05n0220_049:0278b12_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如巧幻師或彼弟子，於四衢道在大眾前，幻作種種諸有情類，而彼巧幻自現熾然身心精進，亦勸所幻令修如是熾然精進。",
        "translation": "Just as an illusionist or his disciple conjures up all kinds of sentient beings in front of the public on the four paths, that illusionist shows himself exuberant in physical and mental effort, and he encourages the illusionist to cultivate such exuberant effort.",
        "source": "T05n0220_049:0278b12_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, sir!",
        "source": "T05n0220_049:0278b15_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T05n0220_049:0278b15_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是幻事為有實不？」",
        "translation": "Are such illusory things real?\"",
        "source": "T05n0220_049:0278b15_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「不也！",
        "translation": "The Zenkai replied, \"No!",
        "source": "T05n0220_049:0278b16_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T05n0220_049:0278b16_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「菩薩摩訶薩以應一切智智心身心精進，斷諸惡法修諸善法，亦勸有情修習如是身心精進，常不捨離亦復如是，雖有所為而無一實。",
        "translation": "The Buddha told Śaṅgālī, \"The bodhisattva Mahāsattva makes effort with body and mind that accords with omniscience and wisdom, stops bad qualities and cultivates good qualities, and encourages sentient beings to cultivate such effort with body and mind that's never abandoned and is likewise, even though there are things to do that have no single reality.",
        "source": "T05n0220_049:0278b16_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_049:0278b20_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T05n0220_049:0278b20_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法性空皆如幻故。",
        "translation": "The nature of all things is empty, and they're all illusory.",
        "source": "T05n0220_049:0278b20_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T05n0220_049:0278b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩自住靜慮波羅蜜多，亦勸無量百千俱胝那庾多有情，令住靜慮波羅蜜多。",
        "translation": "If a bodhisattva-mahāsattva abides in the perfection of meditation on his own, he also encourages measureless hundreds of thousands of koṭīs of sentient beings to abide in the perfection of meditation.",
        "source": "T05n0220_049:0278b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Sugata!",
        "source": "T05n0220_049:0278b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩自住靜慮波羅蜜多，亦勸無量百千俱胝那庾多有情，令住靜慮波羅蜜多？",
        "translation": "How does the bodhisattva Mahāsattva himself abide in the perfection of meditation and also encourage measureless hundreds of thousands of koṭīs of sentient beings to abide in the perfection of meditation?",
        "source": "T05n0220_049:0278b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T05n0220_049:0278b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩於一切法住平等定，不見諸法有定有亂，而常修習如是靜慮波羅蜜多，亦勸無量百千俱胝那庾多有情，修習如是平等靜慮，乃至證得阿耨多羅三藐三菩提，於如是定常不捨離。",
        "translation": "If a bodhisattva-mahāsattva abides in the concentration of equality for all things, doesn't see that there's concentration and confusion in those things, and always cultivates the perfection of such meditation, he encourages measureless hundreds of thousands of koṭīs of sentient beings to cultivate such equal meditation until they realize supreme perfect enlightenment, and he always remains in such concentration without abandoning it.",
        "source": "T05n0220_049:0278b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Bhagavān!",
        "source": "T05n0220_049:0278c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩擐大乘鎧。",
        "translation": "Thus, this is called the bodhisattva-mahāsattva taking on the great vehicle armor.",
        "source": "T05n0220_049:0278c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T05n0220_049:0278c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如巧幻師或彼弟子，於四衢道在大眾前，幻作種種諸有情類，而彼巧幻自現於法住平等定，亦勸所幻令修如是平等靜慮。",
        "translation": "Just as an illusionist or his disciple conjures up all kinds of sentient beings in front of the public on the four paths, that illusionist shows himself to be equally concentrated in his Dharma abode and encourages the illusionists to cultivate such equal meditation.",
        "source": "T05n0220_049:0278c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, sir!",
        "source": "T05n0220_049:0278c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T05n0220_049:0278c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是幻事為有實不？」",
        "translation": "Are such illusory things real?\"",
        "source": "T05n0220_049:0278c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「不也！",
        "translation": "The Zenkai replied, \"No!",
        "source": "T05n0220_049:0278c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T05n0220_049:0278c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「菩薩摩訶薩於一切法住平等定，亦勸有情修習如是平等靜慮，常不捨離亦復如是，雖有所為而無一實。",
        "translation": "The Buddha told Śaṇḍinya, \"The bodhisattva Mahāsattva abides in equal concentration with respect to all things, and he encourages sentient beings to cultivate such equal meditation and never abandon it, even though it's something that's created but has no single reality.",
        "source": "T05n0220_049:0278c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_049:0278c08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T05n0220_049:0278c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法性空皆如幻故。",
        "translation": "The nature of all things is empty, and they're all illusory.",
        "source": "T05n0220_049:0278c09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T05n0220_049:0278c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩自住般若波羅蜜多，亦勸無量百千俱胝那庾多有情，令住般若波羅蜜多。",
        "translation": "If a bodhisattva Mahāsattva abides in the perfection of wisdom on his own, he also encourages measureless hundreds of thousands of koṭīs of sentient beings to abide in the perfection of wisdom.",
        "source": "T05n0220_049:0278c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Sugata!",
        "source": "T05n0220_049:0278c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩自住般若波羅蜜多，亦勸無量百千俱胝那庾多有情令住般若波羅蜜多？",
        "translation": "How does a bodhisattva Mahāsattva abide in the perfection of wisdom by himself and encourage measureless hundreds of thousands of koṭīs of sentient beings to abide in the perfection of wisdom?",
        "source": "T05n0220_049:0278c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T05n0220_049:0278c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩自住無戲論般若波羅蜜多，不見諸法有生有滅、有染有淨，及不得此岸彼岸差別，亦勸無量百千俱胝那庾多有情安住如是無戲論慧，乃至證得阿耨多羅三藐三菩提，於如是慧常不捨離。",
        "translation": "If a bodhisattva Mahāsattva abides in the prajñāpāramitā without conceptual elaborations on his own, doesn't see that things are produced, ceased, defiled, and purified, and doesn't allow distinctions between this shore and the other shore, and encourages measureless hundreds of thousands of koṭīnayus of sentient beings to abide in such wisdom without conceptual elaborations, up to the point of realizing unsurpassed, correct, and complete enlightenment, he'll never part with such wisdom.",
        "source": "T05n0220_049:0278c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Sugata!",
        "source": "T05n0220_049:0278c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩擐大乘鎧。",
        "translation": "Thus, this is called the bodhisattva-mahāsattva taking on the great vehicle armor.",
        "source": "T05n0220_049:0278c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T05n0220_049:0278c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如巧幻師或彼弟子，於四衢道在大眾前，幻作種種諸有情類，而彼巧幻自現安住無戲論慧，亦勸所幻令其修習如是般若。",
        "translation": "Just as an illusionist or his disciple conjures up all kinds of sentient beings in front of the public on the four paths, that illusionist shows himself to be comfortable with the wisdom of no conceptual elaborations and encourages the illusions he makes to cultivate such wisdom.",
        "source": "T05n0220_049:0278c20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "\"Well done, Sugata!",
        "source": "T05n0220_049:0278c23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T05n0220_049:0278c23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是幻事為有實不？」",
        "translation": "Are such illusory things real?\"",
        "source": "T05n0220_049:0278c23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「不也！",
        "translation": "The Zenkai replied, \"No!",
        "source": "T05n0220_049:0278c24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T05n0220_049:0278c24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「菩薩摩訶薩自住無戲論般若波羅蜜多，亦勸有情修習如是無戲論慧，常不捨離亦復如是，雖有所為而無一實。",
        "translation": "The Buddha told Śaṅgālī, \"The bodhisattva Mahāsattva abides by the prajñāpāramitā without conceptual elaborations and encourages sentient beings to cultivate such wisdom without conceptual elaborations, always never abandoning and likewise, although they do have something, yet there's no single reality.",
        "source": "T05n0220_049:0278c24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_049:0278c27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T05n0220_049:0278c27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法性空皆如幻故。",
        "translation": "The nature of all things is empty, and they're all illusory.",
        "source": "T05n0220_049:0278c27_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T05n0220_049:0278c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩擐如上說諸功德鎧，普於十方各如殑伽沙等諸佛世界，以神通力自變其身，遍滿如是諸佛世界，隨諸有情所樂示現，自住布施波羅蜜多，勸慳貪者令住布施；自住淨戒波羅蜜多，勸犯戒者令住淨戒；自住安忍波羅蜜多，勸暴惡者令住安忍；自住精進波羅蜜多，勸懈怠者令住精進；自住靜慮波羅蜜多，勸亂心者令住靜慮；自住般若波羅蜜多，勸愚癡者令住妙慧。",
        "translation": "\"If the bodhisattva Mahāsattva thus embodies the armor of the attributes described above, he transforms himself with the power of his supernormal abilities to pervade the sands of the buddha-worlds in the ten directions and shows them according to the desires of sentient beings, abiding in the perfection of generosity and encouraging the stingy and greedy to abide in generosity, abiding in the perfection of pure morality and encouraging those who violate the precepts to abide in pure morality, abiding in the perfection of patience and encouraging the violent to abide in patience, abiding in the perfection of effort and encouraging the lazy to abide in effort, abiding in the perfection of meditation and encouraging the disturbed to abide in meditation, and abiding in the perfection of wisdom and encouraging the foolish to abide in marvelous wisdom, then he'll establish sentient beings in the six perfections according to their various sounds.",
        "source": "T05n0220_049:0278c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩摩訶薩安立有情於六波羅蜜多已，復隨其類音為說六波羅蜜多相應之法，令彼聞已乃至證得阿耨多羅三藐三菩提，於六波羅蜜多相應之法常不捨離。",
        "translation": "After thus establishing the six perfections in sentient beings, the bodhisattva Mahāsattva then follows their voices and teaches them the many concomitant dharmas of the six perfections, causing them to hear them and then realize supreme perfect enlightenment, never abandoning the many concomitant dharmas of the six perfections.",
        "source": "T05n0220_049:0279a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Sugata!",
        "source": "T05n0220_049:0279a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩擐大乘鎧。",
        "translation": "Thus, this is called the bodhisattva-mahāsattva taking on the great vehicle armor.",
        "source": "T05n0220_049:0279a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T05n0220_049:0279a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如巧幻師或彼弟子，於四衢道在大眾前，幻作種種諸有情類，而彼巧幻自現安住六波羅蜜多，亦勸所幻有情令其安住。",
        "translation": "Just as an illusionist or his disciple conjures up all kinds of sentient beings in front of the public in the four paths, that illusionist shows himself to be stable in the six perfections and encourages the illusory beings he conjures up to make them stay there.",
        "source": "T05n0220_049:0279a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "\"Well done, Sugata!",
        "source": "T05n0220_049:0279a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T05n0220_049:0279a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是幻事為有實不？」",
        "translation": "Are such illusory things real?\"",
        "source": "T05n0220_049:0279a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「不也！",
        "translation": "The Zenkai replied, \"No!",
        "source": "T05n0220_049:0279a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T05n0220_049:0279a17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「菩薩摩訶薩普於十方各如殑伽沙等諸佛世界自現其身，隨類安住六波羅蜜多，亦勸有情令其安住，乃至證得無上菩提常不捨離亦復如是，雖有所為而無一實。",
        "translation": "The Buddha told Shancheng, \"The bodhisattva Mahāsattva universally manifests himself in all the buddha-worlds of the sands of the Ganges in the ten directions, abiding in the six perfections according to their type and encouraging sentient beings to make them stay there, even when he realizes unsurpassed bodhi and never abandons it, so too is it, even though there's something to do but none of it is real.",
        "source": "T05n0220_049:0279a17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_049:0279a21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T05n0220_049:0279a22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法性空皆如幻故。",
        "translation": "The nature of all things is empty, and they're all illusory.",
        "source": "T05n0220_049:0279a22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T05n0220_049:0279a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩擐如上說諸功德鎧，以應一切智智心，大悲為上首，用無所得而為方便，利益安樂一切有情，不雜聲聞、獨覺作意。",
        "translation": "\"Suppose a bodhisattva Mahāsattva armors himself with the merits described above, responds with the mind of omniscience, has great compassion as his foremost, and uses unattained skillful means to benefit and comfort all sentient beings without contemplating it together with direct disciples or solitary realizers.",
        "source": "T05n0220_049:0279a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「謂不作是念：『我當安立爾所有情於布施波羅蜜多，爾所有情不當安立。』",
        "translation": "\"It's not to think, 'I will establish the perfection of generosity for all sentient beings, but I will improperly establish it for all sentient beings.'",
        "source": "T05n0220_049:0279a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但作是念：『我當安立無量、無數、無邊有情於布施波羅蜜多。』",
        "translation": "He only thinks, 'I will establish the perfection of generosity for measureless, innumerable, and limitless sentient beings.'",
        "source": "T05n0220_049:0279a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不作是念：『我當安立爾所有情於淨戒、安忍、精進、靜慮、般若波羅蜜多，爾所有情不當安立。』",
        "translation": "Don't think, 'I will establish the perfections of pure morality, patience, effort, meditation, and wisdom for all sentient beings, but I won't establish them for all sentient beings.'",
        "source": "T05n0220_049:0279a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但作是念：『我當安立無量、無數、無邊有情於淨戒乃至般若波羅蜜多。』",
        "translation": "Only think, 'I will establish measureless, countless, and limitless sentient beings in pure morality and even in the perfection of wisdom.'",
        "source": "T05n0220_049:0279b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「不作是念：『我當安立爾所有情於內空，爾所有情不當安立。』",
        "translation": "\"Don't think, 'I will establish all these beings in internal emptiness, and all these beings will be improperly established.'",
        "source": "T05n0220_049:0279b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但作是念：『我當安立無量、無數、無邊有情於內空。』",
        "translation": "Instead, he thinks, 'I will establish in internal emptiness measureless, countless, and limitless sentient beings.'",
        "source": "T05n0220_049:0279b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不作是念：『我當安立爾所有情於外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，爾所有情不當安立。』",
        "translation": "Not to think, 'I will posit the external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all things, inaccessible emptiness, emptiness without nature, emptiness of self-nature, emptiness of self-nature, and emptiness of self-nature without nature, and then all beings will be improperly posited.'",
        "source": "T05n0220_049:0279b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但作是念：『我當安立無量、無數、無邊有情於外空乃至無性自性空。』",
        "translation": "Only think, 'I will posit the emptiness of external existence and even the emptiness of the natureless nature of self for measureless, innumerable, and limitless sentient beings.'",
        "source": "T05n0220_049:0279b11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「不作是念：『我當安立爾所有情於四靜慮，爾所有情不當安立。』",
        "translation": "\"Don't think, 'I will establish these four meditations for all sentient beings, but I will improperly establish them for all sentient beings here.'",
        "source": "T05n0220_049:0279b12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但作是念：『我當安立無量、無數、無邊有情於四靜慮。』",
        "translation": "Only think, 'I will establish in the four meditations measureless, innumerable, and limitless sentient beings.'",
        "source": "T05n0220_049:0279b14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不作是念：『我當安立爾所有情於四無量、四無色定，爾所有情不當安立。』",
        "translation": "Don't think, 'I will establish these four immeasurable and four formless concentrations for all sentient beings, but I will improperly establish them for all sentient beings here.'",
        "source": "T05n0220_049:0279b15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但作是念：『我當安立無量、無數、無邊有情於四無量、四無色定。』",
        "translation": "Only think, 'I will establish measureless, countless, and limitless sentient beings in the four immeasurable and four formless concentrations.'",
        "source": "T05n0220_049:0279b16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「不作是念：『我當安立爾所有情於四念住，爾所有情不當安立。』",
        "translation": "\"Don't think, 'I will establish these four abodes of mindfulness for all sentient beings, but I will improperly establish them for all sentient beings.'",
        "source": "T05n0220_049:0279b18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但作是念：『我當安立無量、無數、無邊有情於四念住。』",
        "translation": "Instead, they think, 'I will establish measureless, countless, and limitless sentient beings in the four abodes of mindfulness.'",
        "source": "T05n0220_049:0279b19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不作是念：『我當安立爾所有情於四正斷、四神足、五根、五力、七等覺支、八聖道支，爾所有情不當安立。』",
        "translation": "Not to think, 'I will establish all these beings in the four correct eliminations, four miraculous powers, five faculties, five powers, seven factors of virtual enlightenment, and eight noble factors of the path, but all these beings will be improperly established.'",
        "source": "T05n0220_049:0279b20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但作是念：『我當安立無量、無數、無邊有情於四正斷乃至八聖道支。』",
        "translation": "Only think, 'I will establish measureless, countless, and limitless sentient beings in the fourfold correct elimination and even the eight noble factors of the path.'",
        "source": "T05n0220_049:0279b23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「不作是念：『我當安立爾所有情於空解脫門，爾所有情不當安立。』",
        "translation": "\"Don't think, 'I will establish all these sentient beings in the gate of the liberation of emptiness, but all these sentient beings will be improperly established.'",
        "source": "T05n0220_049:0279b24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但作是念：『我當安立無量、無數、無邊有情於空解脫門。』",
        "translation": "Only think, 'I will establish measureless, countless, and limitless sentient beings in the gate of the liberation of emptiness.'",
        "source": "T05n0220_049:0279b26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不作是念：『我當安立爾所有情於無相、無願解脫門，爾所有情不當安立。』",
        "translation": "Don't think, 'I will establish all these beings in the gate of liberation through marklessness and wishlessness, but I will improperly establish all these beings.'",
        "source": "T05n0220_049:0279b27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但作是念：『我當安立無量、無數、無邊有情於無相、無願解脫門。』",
        "translation": "Only think, 'I will establish measureless, countless, and limitless sentient beings in the gate of liberation through marklessness and wishlessness.'",
        "source": "T05n0220_049:0279b29_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「不作是念：『我當安立爾所有情於五眼，爾所有情不當安立。』",
        "translation": "\"Don't think, 'I will establish all these beings in the five eyes, and all these beings will be improperly established.'",
        "source": "T05n0220_049:0279c01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但作是念：『我當安立無量、無數、無邊有情於五眼。』",
        "translation": "Only think, 'I will establish the five eyes in measureless, countless, and limitless sentient beings.'",
        "source": "T05n0220_049:0279c02_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不作是念：『我當安立爾所有情於六神通，爾所有情不當安立。』",
        "translation": "Not to think, 'I will establish those six supernormal powers in all sentient beings, but I will improperly establish them in all sentient beings here.'",
        "source": "T05n0220_049:0279c03_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但作是念：『我當安立無量、無數、無邊有情於六神通。』",
        "translation": "Only think, 'I will establish the six supernormal powers in measureless, innumerable, and limitless sentient beings.'",
        "source": "T05n0220_049:0279c05_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「不作是念：『我當安立爾所有情於佛十力，爾所有情不當安立。』",
        "translation": "\"Don't think, 'I will establish all those sentient beings in the Buddha's ten powers, but all those sentient beings will be improperly established.'",
        "source": "T05n0220_049:0279c06_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但作是念：『我當安立無量、無數、無邊有情於佛十力。』",
        "translation": "Only think, 'I will establish the Buddha's ten powers in measureless, innumerable, and limitless sentient beings.'",
        "source": "T05n0220_049:0279c07_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不作是念：『我當安立爾所有情於四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智，爾所有情不當安立。』",
        "translation": "Don't think, 'I will establish for all sentient beings the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, the 18 Buddha-unequals, omniscience, knowledge of the path, and knowledge of all characteristics, but for all sentient beings I won't establish them.'",
        "source": "T05n0220_049:0279c09_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但作是念：『我當安立無量、無數、無邊有情於四無所畏乃至一切相智。』",
        "translation": "Only think, 'I will establish for measureless, countless, and limitless sentient beings the four fearlessnesses and even the cognition of all characteristics.'",
        "source": "T05n0220_049:0279c12_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「不作是念：『我當安立爾所有情於預流果，爾所有情不當安立。』",
        "translation": "\"Don't think, 'I will establish all these beings in the fruit of stream-winner, and all these beings will be improperly established.'",
        "source": "T05n0220_049:0279c13_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但作是念：『我當安立無量、無數、無邊有情於預流果。』",
        "translation": "Instead, he thinks, 'I will establish measureless, countless, and limitless sentient beings in the fruit of stream-winner.'",
        "source": "T05n0220_049:0279c15_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不作是念：『我當安立爾所有情於一來、不還、阿羅漢果、獨覺菩提，爾所有情不當安立。』",
        "translation": "Don't think, 'I will establish all those sentient beings in the once-returner, nonreturner, arhatship, and solitary realizer bodhi, and all those sentient beings will not be established.'",
        "source": "T05n0220_049:0279c16_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但作是念：『我當安立無量、無數、無邊有情於一來、不還、阿羅漢果、獨覺菩提。』",
        "translation": "Only think, 'I will establish measureless, countless, and limitless sentient beings in the one-returner, the nonreturner, the fruit of the arhat, and the enlightenment of the pratyekabuddha.'",
        "source": "T05n0220_049:0279c18_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不作是念：『我當安立爾所有情於菩薩道無上菩提，爾所有情不當安立。』",
        "translation": "Don't think, 'I will establish for all sentient beings the unsurpassed bodhi of the bodhisattva path, and I won't establish it for all sentient beings here.'",
        "source": "T05n0220_049:0279c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但作是念：『我當安立無量、無數、無邊有情於菩薩道無上菩提。』",
        "translation": "Instead, they think, 'I will establish the unsurpassed enlightenment of the bodhisattva path for measureless, innumerable, and limitless sentient beings.'",
        "source": "T05n0220_049:0279c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Sugata!",
        "source": "T05n0220_049:0279c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩擐大乘鎧。",
        "translation": "Thus, this is called the bodhisattva-mahāsattva taking on the great vehicle armor.",
        "source": "T05n0220_049:0279c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T05n0220_049:0279c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如巧幻師或彼弟子，於四衢道在大眾前，幻作無量、無數、無邊有情，安立於六波羅蜜多，乃至安立於無上菩提。",
        "translation": "\"Suppose a clever illusionist or his disciple creates an illusion of measureless, countless, and limitless sentient beings in front of the great crowd on the four paths, establishing them in the six perfections ... and even establishing them in unsurpassed bodhi.",
        "source": "T05n0220_049:0279c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Sugata!",
        "source": "T05n0220_049:0279c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T05n0220_049:0279c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是幻事為有實不？」",
        "translation": "Are such illusory things real?\"",
        "source": "T05n0220_049:0279c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現答言：「不也！",
        "translation": "The Zenkai replied, \"No!",
        "source": "T05n0220_049:0279c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T05n0220_049:0279c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「菩薩摩訶薩以應一切智智心，大悲為上首，用無所得而為方便，安立無量、無數、無邊有情於六波羅蜜多，乃至安立無量、無數、無邊有情於無上菩提亦復如是，雖有所為而無一實。",
        "translation": "The Buddha told Śaṅgālī, \"The bodhisattva Mahāsattva responds with the mind of omniscience and wisdom, with great compassion as the foremost, and uses unobtainable as the method to posit measureless, countless, and limitless sentient beings in the six perfections, and likewise to posit measureless, countless, and limitless sentient beings in unsurpassed bodhi, even though there are things to do but none of them are real.",
        "source": "T05n0220_049:0279c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T05n0220_049:0280a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T05n0220_049:0280a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法性空皆如幻故。」",
        "translation": "The nature of all dharmas is empty, and they are all illusory.\"",
        "source": "T05n0220_049:0280a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第四十九",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 49",
        "source": "T05n0220_049:0280a05_0",
        "is_bad_quality": false
    }
]