[
    {
        "source_sentence": "大般若波羅蜜多經卷第三百四",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 314",
        "source": "T06n0220_348:0786c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十八",
        "translation": "eighteen",
        "source": "T06n0220_348:0786c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T06n0220_348:0786c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初分無盡品第五十九之二",
        "translation": "the first part of the inexhaustible chapter, number 59bis",
        "source": "T06n0220_348:0786c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this well!",
        "source": "T06n0220_348:0786c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多虛空無盡故，菩薩摩訶薩應引般若波羅蜜多；淨戒、安忍、精進、靜慮、般若波羅蜜多虛空無盡故，菩薩摩訶薩應引般若波羅蜜多。",
        "translation": "Because the wave of generosity is inexhaustible in space, the bodhisattva Mahāsattva should invoke the wave of prajñāpāramitā; because the wave of pure precepts, patience, effort, meditation, and prajñāpāramitā is inexhaustible in space, the bodhisattva Mahāsattva should invoke the wave of prajñāpāramitā.",
        "source": "T06n0220_348:0786c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good present, you should know!",
        "source": "T06n0220_348:0786c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空虛空無盡故，菩薩摩訶薩應引般若波羅蜜多；外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空虛空無盡故，菩薩摩訶薩應引般若波羅蜜多。",
        "translation": "Because internal emptiness and space are inexhaustible, the bodhisattva Mahāsattva should invoke the perfection of wisdom; because external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, infinite emptiness, dispersed emptiness, unchanging emptiness, intrinsic emptiness, emptiness in own-nature, emptiness in common, emptiness in all things, inaccessible emptiness, emptiness without nature, emptiness in self-nature, and emptiness in self-nature without nature are inexhaustible, the bodhisattva Mahāsattva should invoke the perfection of wisdom.",
        "source": "T06n0220_348:0786c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T06n0220_348:0786c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如虛空無盡故，菩薩摩訶薩應引般若波羅蜜多；法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界虛空無盡故，菩薩摩訶薩應引般若波羅蜜多。",
        "translation": "\"Because the true nature of space is inexhaustible, the bodhisattva Mahāsattva should invoke the perfection of wisdom; because the reality realm, the nature of reality, the nature that's not false, the nature that's not different without changing, the nature that's equal, the nature that's free from birth, the law, the abiding of reality, the actuality, the space realm, and the inconceivable realm of space are inexhaustible, the bodhisattva Mahāsattva should invoke the perfection of wisdom.",
        "source": "T06n0220_348:0786c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T06n0220_348:0786c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦聖諦虛空無盡故，菩薩摩訶薩應引般若波羅蜜多；集、滅、道聖諦虛空無盡故，菩薩摩訶薩應引般若波羅蜜多。",
        "translation": "Because the space of the noble truth of suffering is inexhaustible, the bodhisattva Mahāsattva should invoke the perfection of wisdom; because the space of the noble truths of arising, ceasing, and the path is inexhaustible, the bodhisattva Mahāsattva should invoke the perfection of wisdom.",
        "source": "T06n0220_348:0786c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good present, you should know!",
        "source": "T06n0220_348:0786c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮虛空無盡故，菩薩摩訶薩應引般若波羅蜜多；四無量、四無色定虛空無盡故，菩薩摩訶薩應引般若波羅蜜多。",
        "translation": "Because the space of the four meditations is inexhaustible, the bodhisattva Mahāsattva should invoke the perfection of wisdom; because the space of the four immeasurable and four formless concentrations is inexhaustible, the bodhisattva Mahāsattva should invoke the perfection of wisdom.",
        "source": "T06n0220_348:0786c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good present, you should know!",
        "source": "T06n0220_348:0786c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫虛空無盡故，菩薩摩訶薩應引般若波羅蜜多；八勝處、九次第定、十遍處虛空無盡故，菩薩摩訶薩應引般若波羅蜜多。",
        "translation": "Because the space of the eight liberations is inexhaustible, the bodhisattva Mahāsattva should invoke the perfection of wisdom; because the space of the eight abodes, nine graduated concentrations, and ten universal abodes is inexhaustible, the bodhisattva Mahāsattva should invoke the perfection of wisdom.",
        "source": "T06n0220_348:0786c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good present, you should know!",
        "source": "T06n0220_348:0786c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念住虛空無盡故，菩薩摩訶薩應引般若波羅蜜多；四正斷、四神足、五根、五力、七等覺支、八聖道支虛空無盡故，菩薩摩訶薩應引般若波羅蜜多。",
        "translation": "Because the four abodes of mindfulness are inexhaustible in space, the bodhisattva Mahāsattva should invoke the perfection of wisdom; because the four correct eliminations, four miraculous abilities, five faculties, five powers, seven factors of virtual enlightenment, and eight noble factors of the path are inexhaustible in space, the bodhisattva Mahāsattva should invoke the perfection of wisdom.",
        "source": "T06n0220_348:0786c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T06n0220_348:0787a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空解脫門虛空無盡故，菩薩摩訶薩應引般若波羅蜜多；無相、無願解脫門虛空無盡故，菩薩摩訶薩應引般若波羅蜜多。",
        "translation": "Because space is inexhaustible in the liberation gate of emptiness, the bodhisattvas, mahāsattvas, and wishlessness are inexhaustible in the liberation gate of marklessness, the bodhisattvas, mahāsattvas, and wishlessness should invoke the perfection of wisdom.",
        "source": "T06n0220_348:0787a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good present, you should know!",
        "source": "T06n0220_348:0787a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眼虛空無盡故，菩薩摩訶薩應引般若波羅蜜多；六神通虛空無盡故，菩薩摩訶薩應引般若波羅蜜多。",
        "translation": "Because the space of the five eyes is inexhaustible, the bodhisattvas, mahāsattvas, and bodhisattvas should invoke the perfection of wisdom, and because the space of the six supernormal powers is inexhaustible, the bodhisattvas, mahāsattvas, and bodhisattvas should invoke the perfection of wisdom.",
        "source": "T06n0220_348:0787a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good present, you should know!",
        "source": "T06n0220_348:0787a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛十力虛空無盡故，菩薩摩訶薩應引般若波羅蜜多；四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法虛空無盡故，菩薩摩訶薩應引般若波羅蜜多。",
        "translation": "Because the Buddha's ten powers are inexhaustible in space, the bodhisattvas, mahāsattvas, and buddhas should invoke the perfection of wisdom; because the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and the 18 uncommon dharmas of the Buddha are inexhaustible in space, the bodhisattvas, mahāsattvas, and buddhas should invoke the perfection of wisdom.",
        "source": "T06n0220_348:0787a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T06n0220_348:0787a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無忘失法虛空無盡故，菩薩摩訶薩應引般若波羅蜜多；恒住捨性虛空無盡故，菩薩摩訶薩應引般若波羅蜜多。",
        "translation": "Because the space of the Dharma of no forgetfulness is inexhaustible, the bodhisattvas, mahāsattvas, and bodhisattvas should invoke the perfection of wisdom; because the space of constancy and equanimity is inexhaustible, the bodhisattvas, mahāsattvas, and bodhisattvas should invoke the perfection of wisdom.",
        "source": "T06n0220_348:0787a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good present, you should know!",
        "source": "T06n0220_348:0787a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智虛空無盡故，菩薩摩訶薩應引般若波羅蜜多；道相智、一切相智虛空無盡故，菩薩摩訶薩應引般若波羅蜜多。",
        "translation": "Because the space of omniscience is inexhaustible, the bodhisattva Mahāsattva should invoke the perfection of wisdom, and because the space of knowledge of the path and omniscience is inexhaustible, the bodhisattva Mahāsattva should invoke the perfection of wisdom.",
        "source": "T06n0220_348:0787a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good present, you should know!",
        "source": "T06n0220_348:0787a19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切陀羅尼門虛空無盡故，菩薩摩訶薩應引般若波羅蜜多；一切三摩地門虛空無盡故，菩薩摩訶薩應引般若波羅蜜多。",
        "translation": "Because the space of all dhāraṇī gates is inexhaustible, the bodhisattvas, mahāsattvas, and bodhisattvas should invoke the perfection of wisdom, and because the space of all samādhi gates is inexhaustible, the bodhisattvas, mahāsattvas, and bodhisattvas should invoke the perfection of wisdom.",
        "source": "T06n0220_348:0787a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good present, you should know!",
        "source": "T06n0220_348:0787a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "預流果虛空無盡故，菩薩摩訶薩應引般若波羅蜜多；一來、不還、阿羅漢果虛空無盡故，菩薩摩訶薩應引般若波羅蜜多。",
        "translation": "Because the space of the fruit of stream-winner is inexhaustible, the bodhisattvas, mahāsattvas, and arhats should invoke the perfection of wisdom; because the space of the fruit of once-returner, nonreturner, and arhat is inexhaustible, the bodhisattvas, mahāsattvas, and arhats should invoke the perfection of wisdom.",
        "source": "T06n0220_348:0787a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good present, you should know!",
        "source": "T06n0220_348:0787a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獨覺菩提虛空無盡故，菩薩摩訶薩應引般若波羅蜜多。",
        "translation": "Because the space of the solitary realizer's enlightenment is inexhaustible, the bodhisattvas, mahāsattvas, and bodhisattvas should invoke the perfection of wisdom.",
        "source": "T06n0220_348:0787a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T06n0220_348:0787a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切菩薩摩訶薩行虛空無盡故，菩薩摩訶薩應引般若波羅蜜多。",
        "translation": "Because all bodhisattva-mahāsattva practices are inexhaustible in space, bodhisattvas should invoke the perfection of wisdom.",
        "source": "T06n0220_348:0787a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T06n0220_348:0787a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛無上正等菩提虛空無盡故，菩薩摩訶薩應引般若波羅蜜多。",
        "translation": "Because the buddhas' unsurpassed correct perfect enlightenment is inexhaustible in space, bodhisattvas, mahāsattvas, and bodhisattvas should invoke the perfection of wisdom.",
        "source": "T06n0220_348:0787a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_348:0787b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩觀無明如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀行如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀識如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀名色如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀六處如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀觸如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀受如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀愛如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀取如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀有如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀生如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀老死愁歎苦憂惱如虛空無盡故，應引般若波羅蜜多。",
        "translation": "菩薩摩訶薩觀無明如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀行如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀識如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀名色如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀六處如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀觸如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀受如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀愛如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀取如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀有如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀生如虛空無盡故，應引般若波羅蜜多；菩薩摩訶薩觀老死愁歎苦憂惱如虛空無盡故，應引般若波羅蜜多。",
        "source": "T06n0220_348:0787b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "Thus, good performance!",
        "source": "T06n0220_348:0787b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩應引般若波羅蜜多。",
        "translation": "The bodhisattvas, mahāsattvas, and bodhisattvas should invoke the perfection of wisdom.",
        "source": "T06n0220_348:0787b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good present should know!",
        "source": "T06n0220_348:0787b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩如是觀察十二緣起遠離二邊，是諸菩薩不共妙觀。",
        "translation": "For bodhisattvas and mahāsattvas to thus observe the twelve links of dependent arising and avoid the two extremes is a marvelous observation that's not shared by bodhisattvas.",
        "source": "T06n0220_348:0787b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T06n0220_348:0787b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩處菩提座，如實觀察十二緣起猶如虛空不可盡故，速能證得一切智智。",
        "translation": "\"When bodhisattvas, mahāsattvas, placed in the bodhisattva seat, truly observe that the twelve links of dependent arising are like space and inexhaustible, and they quickly realize the wisdom of omniscience.",
        "source": "T06n0220_348:0787b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T06n0220_348:0787b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩以如虛空無盡行相，行深般若波羅蜜多，如實觀察十二緣起，不墮聲聞及獨覺地，當住無上正等菩提。",
        "translation": "If a bodhisattva-mahāsattva practices the profound perfection of wisdom with inexhaustible form like space and correctly observes the 12 dependent arising stages, he won't fall into the stages of śrāvaka and pratyekabuddha, and will abide in unsurpassed correct perfect enlightenment.",
        "source": "T06n0220_348:0787b22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T06n0220_348:0787b25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有住菩薩乘補特伽羅，若於無上正等菩提有退轉者，皆悉不依引發般若波羅蜜多善巧作意，由彼不了云何菩薩摩訶薩修行般若波羅蜜多，能以如虛空無盡行相，如實觀察十二緣起，引發般若波羅蜜多。",
        "translation": "\"If there's any retrogression from the unsurpassed correct enlightenment for those who abide in the bodhisattva vehicle, they all don't rely on the skillful contemplation that gives rise to the perfection of wisdom, because they don't understand how a bodhisattva Mahāsattva cultivates the perfection of wisdom and can give rise to the perfection of wisdom by accurately observing 12 dependent arising like the inexhaustible form of space.",
        "source": "T06n0220_348:0787b25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現當知！",
        "translation": "You should know this well!",
        "source": "T06n0220_348:0787c01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有安住菩薩乘者，若於無上正等菩提而有退轉，皆由遠離引發般若波羅蜜多善巧方便。",
        "translation": "If there are people who are stable in the bodhisattva vehicle and who nevertheless regress from unsurpassed perfect enlightenment, it's all because they've distanced themselves from the skillful means of initiating prajñāpāramitā.",
        "source": "T06n0220_348:0787c01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T06n0220_348:0787c03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩能於無上正等菩提不退轉者，皆依引發甚深般若波羅蜜多善巧方便。",
        "translation": "\"If a bodhisattva-mahāsattva can achieve unsurpassed perfect enlightenment without turning back, it's all based on the skillful means of generating the profound perfection of prajñāpāramitā.",
        "source": "T06n0220_348:0787c03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩由依如是善巧方便，修行般若波羅蜜多，以如虛空無盡行相，如實觀察十二緣起，引發般若波羅蜜多，是菩薩摩訶薩由依如是善巧方便，修行般若波羅蜜多，以如虛空無盡行相，如實觀察甚深般若波羅蜜多，由此引發甚深般若波羅蜜多。",
        "translation": "It's by relying on such skillful means that the bodhisattva Mahāsattva cultivates prajñāpāramitā, which causes prajñāpāramitā by truly observing the twelve conditions that arise like the inexhaustible activity of space and by truly observing the profound prajñāpāramitā that results from such skillful means.",
        "source": "T06n0220_348:0787c05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_348:0787c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩如是觀察緣起法時，不見有法無因而生，不見有法無因而滅，不見有法常住不滅，不見有法有我、有情、命者、生者、養者、士夫、補特伽羅、意生、儒童、作者、使作者、起者、使起者、受者、使受者、知者、使知者、見者、使見者，不見有法若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "When bodhisattvas, mahāsattvas thus observe dependent arising, they don't see things that arise without cause, don't see things that cease without cause, don't see things that are permanent and don't cease, and don't see things that are self, sentient beings, living beings, living beings, nurturers, men, patrons, mindful beings, children, authors, causes, those who arise, those who cause to arise, those who receive, those who cause to receive, those who know, those who cause to know, those who see, and those who cause to see, whether permanent or impermanent, pleasant or painful, self or selfless, pure or impure, quiescent or not, and isolated or not isolated.",
        "source": "T06n0220_348:0787c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good presently you should know!",
        "source": "T06n0220_348:0787c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩欲行般若波羅蜜多，應當如是觀察緣起而行般若波羅蜜多。",
        "translation": "All bodhisattvas and mahāsattvas who want to practice the perfection of wisdom should thus observe dependent arising and practice the perfection of wisdom.",
        "source": "T06n0220_348:0787c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know this, good present!",
        "source": "T06n0220_348:0787c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見色若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見受、想、行、識若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then the bodhisattva Mahāsattva doesn't see form whether permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, isolated or not isolated, nor does he see feeling, perception, volition, or consciousness whether permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, and isolated or not isolated.",
        "source": "T06n0220_348:0787c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見眼處若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見耳、鼻、舌、身、意處若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then the bodhisattva Mahāsattva doesn't see the locus of the eye as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, and isolated or not isolated, and doesn't see the locus of the ear, nose, tongue, body, or mind as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, and isolated or not isolated.",
        "source": "T06n0220_348:0787c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見色處若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見聲、香、味、觸、法處若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva-mahāsattva practices the profound perfection of wisdom, then the bodhisattva-mahāsattva doesn't see the abode of form as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiet or not quiet, isolated or not isolated, or the abode of sound, smell, taste, touch, or dharmas as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiet or not quiet, and isolated or not isolated.",
        "source": "T06n0220_348:0788a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見眼界若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見耳、鼻、舌、身、意界若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then the bodhisattva Mahāsattva doesn't see the element of vision as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, and isolated or not isolated, nor does he see the elements of ear, nose, tongue, body, and mind as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, and isolated or not isolated.",
        "source": "T06n0220_348:0788a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見色界若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見聲、香、味、觸、法界若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then the bodhisattva Mahāsattva doesn't see the form realm as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, isolated or not isolated, or sound, smell, taste, touch, or the Dharma realm as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, and isolated or not isolated.",
        "source": "T06n0220_348:0788a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見眼識界若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見耳、鼻、舌、身、意識界若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then the bodhisattva Mahāsattva doesn't see the element of the eye consciousness as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not, and isolated or not, and doesn't see the elements of the ear, nose, tongue, body, and consciousness as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not, and isolated or not.",
        "source": "T06n0220_348:0788a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見眼觸若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見耳、鼻、舌、身、意觸若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva Mahāsattva then practices the profound perfection of wisdom, the bodhisattva Mahāsattva then doesn't see eye contact as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, isolated or not isolated, and doesn't see ear, nose, tongue, body, or mind contact as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, and isolated or not isolated.",
        "source": "T06n0220_348:0788a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見眼觸為緣所生諸受若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見耳、鼻、舌、身、意觸為緣所生諸受若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva-mahāsattva practices the profound perfection of wisdom, then the bodhisattva-mahāsattva doesn't see the sensations that arise from visual contact as a condition, whether permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, and remote or not remote, and doesn't see the sensations that arise from sense contact of the ear, nose, tongue, body, or mind as a condition, whether permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, and remote or not remote.",
        "source": "T06n0220_348:0788b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見地界若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見水、火、風、空、識界若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then the bodhisattva Mahāsattva doesn't see the element of earth as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, tranquil or not, and isolated or not, and doesn't see the elements of water, fire, air, space, and consciousness as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, tranquil or not, and isolated or not.",
        "source": "T06n0220_348:0788b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見無明若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva-mahāsattva practices the profound perfection of wisdom, then the bodhisattva-mahāsattva doesn't see nescience as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, isolated or not isolated, nor does he see formations, consciousness, name-and-form, the six sense-fields, touch, feeling, love, appropriation, existence, birth, old age and death, grief and sorrow as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, and isolated or not isolated.",
        "source": "T06n0220_348:0788b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見布施波羅蜜多若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見淨戒、安忍、精進、靜慮、般若波羅蜜多若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If a bodhisattva-mahāsattva practices the profound perfection of wisdom, then the bodhisattva-mahāsattva doesn't see the perfection of generosity whether permanent or impermanent, pleasant or painful, self or no-self, pure or impure, tranquil or not, and isolated or not, and doesn't see the pure precepts, patience, effort, meditation, the perfection of wisdom whether permanent or impermanent, pleasant or painful, self or no-self, pure or impure, tranquil or not, and isolated or not.",
        "source": "T06n0220_348:0788b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見內空若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見內空若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "source": "T06n0220_348:0788b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見真如若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If a bodhisattva-mahāsattva practices the profound perfection of wisdom, then the bodhisattva-mahāsattva doesn't see the true nature as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, remote or not remote, and doesn't see the Dharma realm, Dharma nature, not-falsely-natured, unchanging and different, equal, free from birth, legal, Dharma-abiding, actual, empty, and inconceivable realms as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, and remote or not remote.",
        "source": "T06n0220_348:0788c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見苦聖諦若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見集、滅、道聖諦若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva Mahāsattva then practices the profound perfection of wisdom, the bodhisattva Mahāsattva then doesn't see the noble truth of suffering as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, and isolated or not isolated, nor does he see the noble truths of arising, ceasing, and the path as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, and isolated or not isolated.",
        "source": "T06n0220_348:0788c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見四靜慮若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見四無量、四無色定若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then the bodhisattva Mahāsattva doesn't see the four meditations as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, tranquil or not tranquil, and isolated or not isolated, nor does he see the four immeasurable and four formless concentrations as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, tranquil or not tranquil, and isolated or not isolated.",
        "source": "T06n0220_348:0788c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見八解脫若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見八勝處、九次第定、十遍處若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then the bodhisattva Mahāsattva doesn't see the eight liberations as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, tranquil or not, and isolated or not, and doesn't see the eight abodes of excellence, the nine graduated concentrations, or the ten universal abodes as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, tranquil or not, and isolated or not.",
        "source": "T06n0220_348:0788c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見四念住若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見四正斷、四神足、五根、五力、七等覺支、八聖道支若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then the bodhisattva Mahāsattva doesn't see the four abodes of mindfulness as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, tranquil or not tranquil, and isolated or not isolated, nor does he see the four correct eliminations, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, or the eightfold noble path factor as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, tranquil or not tranquil, and isolated or not isolated.",
        "source": "T06n0220_348:0789a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見空解脫門若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見無相、無願解脫門若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva-mahāsattva practices the profound perfection of wisdom, then the bodhisattva-mahāsattva doesn't see the liberation gate of emptiness as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, and isolated or not isolated, nor does he see the liberation gate of marklessness and wishlessness as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, and isolated or not isolated.",
        "source": "T06n0220_348:0789a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見五眼若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見六神通若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then the bodhisattva Mahāsattva doesn't see the five eyes as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, and isolated or not isolated, nor does he see the six supernormal powers as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, quiescent or not quiescent, and isolated or not isolated.",
        "source": "T06n0220_348:0789a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見佛十力若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If a bodhisattva-mahāsattva practices the profound perfection of wisdom, then the bodhisattva-mahāsattva doesn't see the Buddha's ten powers as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, tranquil or not, and isolated or not, nor does he see the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, the 18 uncommon dharmas of the Buddha as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, tranquil or not, and isolated or not isolated.",
        "source": "T06n0220_348:0789a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見無忘失法若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見恒住捨性若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If a bodhisattva-mahāsattva practices the profound perfection of wisdom, then the bodhisattva-mahāsattva doesn't see the principle of nonforgetfulness as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, tranquil or not, and isolated or not, and doesn't see the nature of permanently abiding equanimity as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, tranquil or not, and isolated or not.",
        "source": "T06n0220_348:0789b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見一切智若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見道相智、一切相智若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva-mahāsattva practices the profound perfection of wisdom, then the bodhisattva-mahāsattva doesn't see omniscience as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, tranquil or not tranquil, and isolated or not isolated, nor does he see knowledge of the path or omniscience as permanent or impermanent, pleasant or painful, self or no-self, pure or impure, tranquil or not tranquil, and isolated or not isolated.",
        "source": "T06n0220_348:0789b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見一切陀羅尼門若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見一切三摩地門若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then the bodhisattva Mahāsattva doesn't see all the dhāraṇī aspects that are permanent or impermanent, pleasant or painful, self or selfless, pure or impure, quiescent or not, tranquil or not, and remote or not remote, and doesn't see all the samādhi aspects that are permanent or impermanent, pleasant or painful, self or not self, pure or impure, tranquil or not tranquil, and remote or not remote.",
        "source": "T06n0220_348:0789b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見預流果若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離，亦不見一來、不還、阿羅漢果若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then the bodhisattva Mahāsattva doesn't see the fruit of stream-winner whether permanent or impermanent, pleasant or painful, self or no-self, pure or impure, tranquil or not, isolated or not, nor does he see the fruit of once-returner or nonreturner arhat whether permanent or impermanent, pleasant or painful, self or no-self, pure or impure, tranquil or not, isolated or not, or not isolated.",
        "source": "T06n0220_348:0789b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見獨覺菩提若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva Mahāsattva then practices the profound perfection of wisdom, the bodhisattva Mahāsattva then doesn't see the solitary realizer as the fruit of enlightenment whether permanent or impermanent, pleasant or painful, self or selfless, pure or impure, quiescent or not, tranquil or not, and remote or not remote.",
        "source": "T06n0220_348:0789b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見一切菩薩摩訶薩行若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva-mahāsattva then practices the profound perfection of wisdom, the bodhisattva-mahāsattva then doesn't see all the bodhisattva-mahāsattva practices as permanent or impermanent, pleasant or painful, self or selfless, pure or impure, tranquil or not tranquil, and isolated or not isolated.",
        "source": "T06n0220_348:0789b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩不見諸佛無上正等菩提若常若無常、若樂若苦、若我若無我、若淨若不淨、若寂靜若不寂靜、若遠離若不遠離。",
        "translation": "\"If the bodhisattva Mahāsattva then practices the profound perfection of wisdom, the bodhisattva Mahāsattva then doesn't see that the buddhas' unsurpassed correct enlightenment is permanent or impermanent, pleasant or painful, self or selfless, pure or impure, tranquil or not tranquil, and isolated or not isolated.",
        "source": "T06n0220_348:0789c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_348:0789c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖行般若波羅蜜多，而不見有所行般若波羅蜜多，亦復不見有法能見所行般若波羅蜜多。",
        "translation": "\"If a bodhisattva-mahāsattva is practicing the profound perfection of prajñā, then even though the bodhisattva-mahāsattva is practicing the perfection of prajñā, he doesn't see any practice of the perfection of prajñā, and he doesn't see any teaching that allows him to see the practice of the perfection of prajñā.",
        "source": "T06n0220_348:0789c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖行靜慮、精進、安忍、淨戒、布施波羅蜜多，而不見有所行靜慮乃至布施波羅蜜多，亦復不見有法能見所行靜慮乃至布施波羅蜜多。",
        "translation": "If it's the case that a bodhisattva Mahāsattva is practicing the perfection of profound prajñā, then even though he's practicing the perfections of concentration, effort, patience, pure precepts, and generosity, he doesn't see any practice of concentration or even the perfection of generosity, and he doesn't see any dharmas that are capable of seeing the practice of concentration or even the perfection of generosity.",
        "source": "T06n0220_348:0789c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖住內空，而不見有所住內空，亦復不見有法能見所住內空。",
        "translation": "\"If a bodhisattva Mahāsattva practices the perfection of profound wisdom, then even though he abides in internal emptiness, the bodhisattva Mahāsattva doesn't see internal emptiness as abiding, and he doesn't see any dharmas that are capable of seeing the internal emptiness that he abides in.",
        "source": "T06n0220_348:0789c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖住外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，而不見有所住外空乃至無性自性空，亦復不見有法能見所住外空乃至無性自性空。",
        "translation": "If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then even though he abides in external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, endless emptiness, dispersed emptiness, unchanging emptiness, emptiness of original nature, emptiness of own-identity, emptiness of shared characteristics, emptiness of all things, inaccessible emptiness, emptiness of naturelessness, emptiness of self-nature, and emptiness of naturelessness, he doesn't see any abiding external emptiness or even emptiness of naturelessness, and he doesn't see any dharmas that are capable of seeing the abiding external emptiness or emptiness of naturelessness as self-nature.",
        "source": "T06n0220_348:0789c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖住真如，而不見有所住真如，亦復不見有法能見所住真如。",
        "translation": "\"If a bodhisattva Mahāsattva practices the profound perfection of wisdom, then even though he abides in true thusness, he doesn't see that there's an abiding true thusness, and he doesn't see that there's a dharma that can see the abiding true thusness.",
        "source": "T06n0220_348:0789c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖住法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，而不見有所住法界乃至不思議界，亦復不見有法能見所住法界乃至不思議界。",
        "translation": "If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then even though the bodhisattva Mahāsattva abides in the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from birth, legal existence, Dharma abiding, reality, space realm, and inconceivable realm, he doesn't see any abiding Dharma realm or inconceivable realm, and he doesn't see any dharmas that are capable of seeing the abiding Dharma realm or inconceivable realm.",
        "source": "T06n0220_348:0789c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖住苦聖諦，而不見有所住苦聖諦，亦復不見有法能見所住苦聖諦。",
        "translation": "\"If the bodhisattva Mahāsattva then practices the profound perfection of wisdom, then even though the bodhisattva Mahāsattva abides in the noble truth of suffering, he doesn't see that there's an abiding noble truth of suffering, and he doesn't see that there's a dharma that can see the noble truth of suffering that's abiding.",
        "source": "T06n0220_348:0790a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖住集、滅、道聖諦，而不見有所住集、滅、道聖諦，亦復不見有法能見所住集、滅、道聖諦。",
        "translation": "If the bodhisattva-mahāsattva practices the profound perfection of wisdom, then even though the bodhisattva-mahāsattva abides in the noble truth of accumulation, cessation, and the path, he doesn't see that there's an abiding noble truth of accumulation, cessation, and the path, and he doesn't see that there's a teaching that can reveal the abiding noble truth of accumulation, cessation, and the path.",
        "source": "T06n0220_348:0790a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修四靜慮，而不見有所修四靜慮，亦復不見有法能見所修四靜慮。",
        "translation": "\"If the bodhisattva Mahāsattva then practices the profound perfection of wisdom, then even though the bodhisattva Mahāsattva cultivates the four meditations, he doesn't see that there are four meditations being cultivated, and he doesn't see that there's a thing that can see the four meditations being cultivated.",
        "source": "T06n0220_348:0790a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修四無量、四無色定，而不見有所修四無量、四無色定，亦復不見有法能見所修四無量、四無色定。",
        "translation": "If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then even though the bodhisattva cultivates the four immeasurable and four formless concentrations, he doesn't see that there are four immeasurable and four formless concentrations being cultivated, and he doesn't see that there's a dharma that can see the four immeasurable and four formless concentrations being cultivated.",
        "source": "T06n0220_348:0790a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修八解脫，而不見有所修八解脫，亦復不見有法能見所修八解脫。",
        "translation": "\"If a bodhisattva-mahāsattva practices the profound perfection of wisdom, then even though he cultivates the eight liberations, he doesn't see that there are eight liberations being cultivated, and he doesn't see that there's a thing that can see the eight liberations being cultivated.",
        "source": "T06n0220_348:0790a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修八勝處、九次第定、十遍處，而不見有所修八勝處、九次第定、十遍處，亦復不見有法能見所修八勝處、九次第定、十遍處。",
        "translation": "If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then even though he cultivates the eight abodes of excellence, nine graduated concentrations, and ten universal abodes, the bodhisattva Mahāsattva doesn't see that he's cultivating the eight abodes of excellence, nine graduated concentrations, and ten universal abodes, and he doesn't see that there's a teaching that can reveal what he's cultivating as the eight abodes of excellence, nine graduated concentrations, and ten universal abodes.",
        "source": "T06n0220_348:0790a18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修四念住，而不見有所修四念住，亦復不見有法能見所修四念住。",
        "translation": "\"If a bodhisattva-mahāsattva practices the profound perfection of wisdom, then even though he cultivates the four abodes of mindfulness, he doesn't see that there are four abodes of mindfulness being cultivated, and he doesn't see that there's a way to see the four abodes of mindfulness being cultivated.",
        "source": "T06n0220_348:0790a22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修四正斷、四神足、五根、五力、七等覺支、八聖道支，而不見有所修四正斷乃至八聖道支，亦復不見有法能見所修四正斷乃至八聖道支。",
        "translation": "If the bodhisattva Mahāsattva practices the profound perfection of prajñā, then even though the bodhisattva Mahāsattva cultivates the four correct eliminations, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path, he doesn't see that there are any cultivations of the four correct eliminations or the eight noble factors of the path, and he doesn't see that there's a teaching that can reveal the cultivations of the four correct eliminations or the eight noble factors of the path.",
        "source": "T06n0220_348:0790a25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修空解脫門，而不見有所修空解脫門，亦復不見有法能見所修空解脫門。",
        "translation": "\"If a bodhisattva Mahāsattva then practices the profound perfection of wisdom, then even though he cultivates the liberation gate of emptiness, he doesn't see that there's a cultivated liberation gate of emptiness, and he doesn't see any dharmas that can see the cultivated liberation gate of emptiness.",
        "source": "T06n0220_348:0790a29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修無相、無願解脫門，而不見有所修無相、無願解脫門，亦復不見有法能見所修無相、無願解脫門。",
        "translation": "If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then even though the bodhisattva cultivates the liberation gate of signlessness and wishlessness, he doesn't see the liberation gate of cultivating signlessness and wishlessness, and he doesn't see any dharmas that are capable of seeing the liberation gate of cultivating signlessness and wishlessness.",
        "source": "T06n0220_348:0790b03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修五眼，而不見有所修五眼，亦復不見有法能見所修五眼。",
        "translation": "\"If a bodhisattva-mahāsattva practices the profound perfection of wisdom, then even though he cultivates the five eyes, he doesn't see that there are five eyes being cultivated, and he doesn't see that there's a way to see the five eyes that are cultivated.",
        "source": "T06n0220_348:0790b07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修六神通，而不見有所修六神通，亦復不見有法能見所修六神通。",
        "translation": "If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then even though the bodhisattva Mahāsattva cultivates the six supernormal powers, he doesn't see that there are six supernormal powers being cultivated, and he doesn't see that there's a way to see the six supernormal powers being cultivated.",
        "source": "T06n0220_348:0790b10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修佛十力，而不見有所修佛十力，亦復不見有法能見所修佛十力。",
        "translation": "\"If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then even though the bodhisattva Mahāsattva cultivates the Buddha's ten powers, he doesn't see that he cultivates the Buddha's ten powers, and he doesn't see that there's a teaching that allows him to see what he cultivates as the Buddha's ten powers.",
        "source": "T06n0220_348:0790b13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法，而不見有所修四無所畏乃至十八佛不共法，亦復不見有法能見所修四無所畏乃至十八佛不共法。",
        "translation": "If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then even though the bodhisattva Mahāsattva cultivates the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and 18 Buddha-uncommon dharmas, he doesn't see any cultivation of the four fearlessnesses or 18 Buddha-uncommon dharmas, and he doesn't see any dharma that can see the cultivated four fearlessnesses or 18 Buddha-uncommon dharmas.",
        "source": "T06n0220_348:0790b15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修無忘失法，而不見有所修無忘失法，亦復不見有法能見所修無忘失法。",
        "translation": "\"If a bodhisattva Mahāsattva practices the profound perfection of wisdom, then even though he cultivates the Dharma of no forgetfulness, he doesn't see that there's a cultivated Dharma of no forgetfulness, and he doesn't see that there's a Dharma that can see the cultivated Dharma of no forgetfulness.",
        "source": "T06n0220_348:0790b20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修恒住捨性，而不見有所修恒住捨性，亦復不見有法能見所修恒住捨性。",
        "translation": "If the bodhisattva Mahāsattva practices the perfection of profound wisdom, then even though the bodhisattva cultivates the nature of constant abiding and equanimity, he doesn't see the nature of constant abiding and equanimity being cultivated, and he doesn't see any thing that can see the nature of constant abiding and equanimity being cultivated.",
        "source": "T06n0220_348:0790b23_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修一切智，而不見有所修一切智，亦復不見有法能見所修一切智。",
        "translation": "\"If the bodhisattva Mahāsattva practices the perfection of profound wisdom, then even though the bodhisattva cultivates omniscience, he doesn't see any cultivated omniscience, and he doesn't see any teaching that allows him to see the cultivated omniscience.",
        "source": "T06n0220_348:0790b26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修道相智、一切相智，而不見有所修道相智、一切相智，亦復不見有法能見所修道相智、一切相智。",
        "translation": "If the bodhisattva Mahāsattva practices the profound prajñāpāramitā, then even though the bodhisattva cultivates cognition of characteristics and cognition of all characteristics, he doesn't see that there's any cultivated cognition of characteristics and cognition of all characteristics, and he doesn't see that there's a teaching that can reveal the cultivated cognition of characteristics and cognition of all characteristics.",
        "source": "T06n0220_348:0790b29_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修一切陀羅尼門，而不見有所修一切陀羅尼門，亦復不見有法能見所修一切陀羅尼門。",
        "translation": "\"If the bodhisattva Mahāsattva then practices the profound prajñāpāramitā, then even though the bodhisattva Mahāsattva cultivates all the dhāraṇī teachings, he doesn't see that there are cultivated dhāraṇī teachings, and he doesn't see that there's a teaching that can reveal the cultivated dhāraṇī teachings.",
        "source": "T06n0220_348:0790c04_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修一切三摩地門，而不見有所修一切三摩地門，亦復不見有法能見所修一切三摩地門。",
        "translation": "If the bodhisattva Mahāsattva practices the profound perfection of wisdom, then even though the bodhisattva Mahāsattva cultivates all the approaches to samādhi, he doesn't see that there are all the approaches to samādhi that are cultivated, and he doesn't see that there's a teaching that can reveal all the approaches to samādhi that are cultivated.",
        "source": "T06n0220_348:0790c07_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修一切菩薩摩訶薩行，而不見有所修一切菩薩摩訶薩行，亦復不見有法能見所修一切菩薩摩訶薩行。",
        "translation": "\"If a bodhisattva-mahāsattva practices the profound perfection of wisdom, then even though the bodhisattva-mahāsattva cultivates all bodhisattva-mahāsattva practices, he doesn't see that there are all bodhisattva-mahāsattva practices being cultivated, and he doesn't see that there's a teaching that can reveal all the bodhisattva-mahāsattva practices that are cultivated.",
        "source": "T06n0220_348:0790c11_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時菩薩摩訶薩行深般若波羅蜜多，是時菩薩摩訶薩雖修諸佛無上正等菩提，而不見有所修無上正等菩提，亦復不見有法能見所修無上正等菩提。",
        "translation": "If a bodhisattva-mahāsattva then practices the profound perfection of wisdom, then even though the bodhisattva-mahāsattva cultivates the unsurpassed correct enlightenment of the buddhas, he doesn't see any cultivated unsurpassed correct enlightenment, and he doesn't see any teaching that can reveal the cultivated unsurpassed correct enlightenment.",
        "source": "T06n0220_348:0790c15_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"Good present, you should know!",
        "source": "T06n0220_348:0790c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩於一切法都無所得而為方便，應行如是甚深般若波羅蜜多。",
        "translation": "It's convenient for bodhisattvas and mahāsattvas to practice the profound perfection of wisdom when all things are unobtainable.",
        "source": "T06n0220_348:0790c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_348:0790c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若時菩薩摩訶薩於一切法以無所得而為方便，修行如是甚深般若波羅蜜多，是時惡魔生大憂惱如中毒箭。",
        "translation": "If a bodhisattva-mahāsattva makes it a point to practice such profound prajñāpāramitā with the aim of obtaining nothing from all things, then a bad demon becomes greatly distressed like being struck by a poisoned arrow.",
        "source": "T06n0220_348:0790c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人新喪父母，深生痛切，惡魔爾時見諸菩薩摩訶薩於一切法以無所得而為方便，修行如是甚深般若波羅蜜多，生大憂惱如中毒箭，亦復如是。」",
        "translation": "Like a person who's newly bereaved of a parent and is deeply distressed, when Māra then sees that the bodhisattvas, mahāsattvas, and their practice of such profound prajñāpāramitā is based on the method of acquiring nothing, he becomes greatly distressed like being hit by a poisoned arrow, and so it is.\"",
        "source": "T06n0220_348:0790c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that the life-size Good Samaritan said to the Buddha, \"Bhagavān!",
        "source": "T06n0220_348:0790c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為一惡魔見諸菩薩摩訶薩於一切法以無所得而為方便行深般若波羅蜜多，生大愁惱如中毒箭？",
        "translation": "Why does an evil demon see bodhisattvas, mahāsattvas, and bodhisattvas skillfully practice the profound perfection of wisdom based on the ungraspable in all things and become greatly distressed like being shot by a poisoned arrow?",
        "source": "T06n0220_348:0790c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為遍三千大千世界一切惡魔，見諸菩薩摩訶薩於一切法以無所得而為方便行深般若波羅蜜多，生大愁惱如中毒箭？」",
        "translation": "Why is it that all the evil demons throughout the 3,000 great one-thousand worlds see bodhisattvas, mahāsattvas, and bodhisattvas skillfully practice the profound perfection of wisdom based on the ungraspable in all things and become greatly distressed like being shot by a poisoned arrow?\"",
        "source": "T06n0220_348:0791a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, \"Good performance!",
        "source": "T06n0220_348:0791a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遍滿三千大千世界一切惡魔，見諸菩薩摩訶薩於一切法以無所得而為方便行深般若波羅蜜多，生大愁惱如中毒箭，各於其座不能自安。",
        "translation": "All the evil demons that pervade the 3,000 great one-thousand worlds see that the bodhisattvas, mahāsattvas, and bodhisattvas are skillfully practicing the profound perfection of wisdom based on the unobtainable in all things, and they become greatly distressed like poisoned arrows, each unable to find peace at their seats.",
        "source": "T06n0220_348:0791a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "\"You should know, good present!",
        "source": "T06n0220_348:0791a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩應常安住甚深般若波羅蜜多最勝行住，若菩薩摩訶薩常能安住甚深般若波羅蜜多最勝行住，世間天、人、阿素洛等伺求其短無能得便，亦復不能令生憂惱。",
        "translation": "\"Should bodhisattvas, mahāsattvas, and asuras always abide in the most excellent practice of the profound prajñāpāramitā, and should bodhisattvas, mahāsattvas, and asuras always abide in the most excellent practice of the profound prajñpāramitā, worldly gods, humans, and asuras who seek their shortcomings won't be able to get an advantage over them, and they won't be able to cause grief.",
        "source": "T06n0220_348:0791a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, good performance!",
        "source": "T06n0220_348:0791a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩欲證無上正等菩提，當勤安住甚深般若波羅蜜多最勝行住。",
        "translation": "If a bodhisattva wishes to realize unsurpassed correct enlightenment, he or she should diligently abide in the most excellent practice of the profound prajñāpāramitā.",
        "source": "T06n0220_348:0791a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_348:0791a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩能正安住甚深般若波羅蜜多最勝行住，則能修滿布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，若菩薩摩訶薩能正修行甚深般若波羅蜜多，便能具足修滿一切波羅蜜多。」",
        "translation": "If a bodhisattva-mahāsattva can correctly abide in the most excellent practice of the profound perfection of wisdom, then he can cultivate the perfection of generosity, pure precepts, patience, effort, meditation, and wisdom, and if a bodhisattva-mahāsattva can correctly cultivate the profound perfection of wisdom, then he can fully cultivate all the perfections.\"",
        "source": "T06n0220_348:0791a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauśāmbī Sunbeam said to the Buddha, \"Bhagavān!",
        "source": "T06n0220_348:0791a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩能正修行甚深般若波羅蜜多，便能具足修滿布施、淨戒、安忍、精進、靜慮、般若波羅蜜多？」",
        "translation": "How can a bodhisattva-mahāsattva correctly cultivate the profound perfection of prajñāpāramitā and then be able to fully cultivate the perfections of generosity, pure morality, patience, effort, meditation, and prajñāpāramitā?\"",
        "source": "T06n0220_348:0791a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善現：「若菩薩摩訶薩無倒修行甚深般若波羅蜜多時，以一切智智心而修布施，復持如是布施功德，與一切有情平等共有迴向無上正等菩提。",
        "translation": "The Buddha told Śaṅgālī, \"When a bodhisattva Mahāsattva cultivates the profound perfection of wisdom without error, he cultivates generosity with the mind of omniscience, and he also maintains the merit of such generosity, which equally shares with all sentient beings the common dedication to unsurpassed correct enlightenment.",
        "source": "T06n0220_348:0791a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Vairocana!",
        "source": "T06n0220_348:0791a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩能正修行甚深般若波羅蜜多，便能具足修滿布施波羅蜜多。",
        "translation": "\"When a bodhisattva-mahāsattva correctly cultivates the profound perfection of prajñāpāramitā, he can then fully cultivate the perfection of generosity.",
        "source": "T06n0220_348:0791a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩無倒修行甚深般若波羅蜜多時，以一切智智心而修淨戒，復持如是淨戒功德與一切有情平等共有迴向無上正等菩提。",
        "translation": "\"If the bodhisattva Mahāsattva cultivates the profound perfection of prajñāpāramitā without error, he cultivates the pure precepts with the mind of omniscience, and he maintains the merits of such pure precepts in common with all sentient beings equally, dedicating them to unsurpassed perfect enlightenment.",
        "source": "T06n0220_348:0791a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_348:0791b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩能正修行甚深般若波羅蜜多，便能具足修滿淨戒波羅蜜多。",
        "translation": "\"Thus, when a bodhisattva-mahāsattva correctly cultivates the perfection of profound prajñāpāramitā, he can fully cultivate the perfection of pure precepts.",
        "source": "T06n0220_348:0791b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩無倒修行甚深般若波羅蜜多時，以一切智智心而修安忍，復持如是安忍功德與一切有情平等共有迴向無上正等菩提。",
        "translation": "\"If the bodhisattva Mahāsattva cultivates the perfection of prajñāpāramitā without error, he cultivates patience with the mind of omniscience and knowledge, and he maintains the merit of such patience in common with all sentient beings equally, dedicating himself to unsurpassed perfect enlightenment.",
        "source": "T06n0220_348:0791b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_348:0791b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩能正修行甚深般若波羅蜜多，便能具足修滿安忍波羅蜜多。",
        "translation": "\"When a bodhisattva-mahāsattva correctly cultivates the profound perfection of prajñāpāramitā, he can fully cultivate the perfection of patience.",
        "source": "T06n0220_348:0791b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩無倒修行甚深般若波羅蜜多時，以一切智智心而修精進，復持如是精進功德與一切有情平等共有迴向無上正等菩提。",
        "translation": "\"If the bodhisattva Mahāsattva correctly cultivates the profound perfection of prajñā without error while cultivating effort with the mind of omniscience, then he will maintain the merit of such effort and equally share it with all sentient beings as they dedicate themselves to unsurpassed perfect enlightenment.",
        "source": "T06n0220_348:0791b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Vairocana!",
        "source": "T06n0220_348:0791b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩能正修行甚深般若波羅蜜多，便能具足修滿精進波羅蜜多。",
        "translation": "\"Thus, when a bodhisattva-mahāsattva correctly cultivates the perfection of effort, he'll be able to fully cultivate the perfection of effort.",
        "source": "T06n0220_348:0791b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩無倒修行甚深般若波羅蜜多時，以一切智智心而修靜慮，復持如是靜慮功德與一切有情平等共有迴向無上正等菩提。",
        "translation": "\"If the bodhisattva Mahāsattva cultivates the profound perfection of wisdom without error while cultivating meditation with the mind of omniscience, and maintains the merits of such meditation, he'll equally share them with all sentient beings and return to unsurpassed perfect enlightenment.",
        "source": "T06n0220_348:0791b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_348:0791b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩能正修行甚深般若波羅蜜多，便能具足修滿靜慮波羅蜜多。",
        "translation": "\"Thus, when a bodhisattva-mahāsattva correctly cultivates the perfection of prajñāpāramitā, he can fully cultivate the perfection of meditation.",
        "source": "T06n0220_348:0791b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩無倒修行甚深般若波羅蜜多時，以一切智智心而修般若，復持如是般若功德與一切有情平等共有迴向無上正等菩提。",
        "translation": "\"When the bodhisattva Mahāsattva cultivates the profound perfection of wisdom without error, he cultivates prajñā with the mind of omniscience, and he also maintains the merit of such prajñā in common with all sentient beings equally, dedicating himself to unsurpassed perfect enlightenment.",
        "source": "T06n0220_348:0791b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_348:0791b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩摩訶薩能正修行甚深般若波羅蜜多，便能具足修滿般若波羅蜜多。",
        "translation": "This is the bodhisattva Mahāsattva who can correctly cultivate the profound perfection of wisdom and can then fully cultivate the perfection of wisdom.",
        "source": "T06n0220_348:0791b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是，善現！",
        "translation": "\"So it is, good present!",
        "source": "T06n0220_348:0791b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩能正修行甚深般若波羅蜜多，便能具足修滿布施、淨戒、安忍、精進、靜慮、般若波羅蜜多。」",
        "translation": "When bodhisattvas and mahāsattvas can correctly practice the profound perfection of prajñāpāramitā, they can fully cultivate generosity, pure morality, patience, effort, meditation, and the perfection of prajñāpāramitā.\"",
        "source": "T06n0220_348:0791b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第三百四十八",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 348",
        "source": "T06n0220_348:0791b26_0",
        "is_bad_quality": false
    }
]