[
    {
        "source_sentence": "大般若波羅蜜多經卷第三百四",
        "translation": "Mahāprajñāpāramitā-sūtra, Vol. 314",
        "source": "T06n0220_304:0547b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T06n0220_304:0547b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初分魔事品第四十之二",
        "translation": "Chapter 40bis of the First Part of the Māra Sutra",
        "source": "T06n0220_304:0547b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0547b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能說法者於六波羅蜜多有方便善巧，能聽法者於六波羅蜜多無方便善巧，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When someone who teaches the Dharma has skillful means for the six perfections and someone who listens to the Dharma doesn't have skillful means for the six perfections, the two aren't combined, and they aren't able to teach, write, memorize, recite, or cultivate the profound prajñāpāramitā, which should be known as a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0547b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0547c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能聽法者於六波羅蜜多有方便善巧，能說法者於六波羅蜜多無方便善巧，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When a person who can listen to the teaching has skillful means for the six perfections and a person who can teach the teaching lacks skillful means for the six perfections, the two aren't combined, and they aren't able to teach, listen, write, memorize, recite, or cultivate the profound prajñāpāramitā, which should be known as a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0547c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0547c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能說法者已得陀羅尼，能聽法者未得陀羅尼，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "If someone who teaches the Dharma has attained the dhāraṇī and someone who listens to the Dharma has yet to attain the dhāraṇī, and they aren't combined, and they aren't able to teach, listen, write, memorize, recite, or cultivate the profound perfection of wisdom, you should know that this is a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0547c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0547c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能聽法者已得陀羅尼，能說法者未得陀羅尼，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "If someone who can listen to the teaching has attained the dhāraṇī and someone who can teach the teaching has yet to attain the dhāraṇī, and they aren't combined, and they aren't able to teach, listen, write, memorize, recite, or cultivate the profound perfection of wisdom, you should know that this is a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0547c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0547c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能說法者欲令恭敬書寫、受持、讀誦、修習甚深般若波羅蜜多，能聽法者不欲恭敬書寫、受持、讀誦、修習甚深般若波羅蜜多，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When someone who teaches the Dharma wants to make them respectfully write, retain, recite, and cultivate the profound perfection of wisdom, and someone who listens to the Dharma doesn't want to respectfully write, retain, recite, and cultivate the profound perfection of wisdom, and they aren't in harmony, they won't be taught or heard, write, retain, recite, and cultivate the profound perfection of wisdom, which should be known as a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0547c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0547c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能聽法者欲得恭敬書寫、受持、讀誦、修習甚深般若波羅蜜多，能說法者不欲恭敬書寫、受持、讀誦、修習甚深般若波羅蜜多，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When someone who listens to the teaching wants to respectfully write, retain, recite, and cultivate the profound perfection of wisdom, and someone who teaches the teaching doesn't want to respectfully write, retain, recite, and cultivate the profound perfection of wisdom, and the two aren't in harmony, they won't be able to teach, listen, write, retain, recite, and cultivate the profound perfection of wisdom, which should be known as a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0547c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0547c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能說法者已離貪欲、瞋恚、惛沈睡眠、掉舉惡作、疑蓋，能聽法者未離貪欲、瞋恚、惛沈睡眠、掉舉惡作、疑蓋，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When someone who teaches the Dharma is free of desire, anger, drowsiness, agitation, and the hindrance of doubt, and someone who listens to the Dharma isn't free of desire, anger, drowsiness, agitation, and the hindrance of doubt, and the two aren't in harmony, they aren't able to teach, listen, write, memorize, recite, or cultivate the profound perfection of wisdom, which should be known as a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0547c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0547c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能聽法者已離貪欲、瞋恚、惛沈睡眠、掉舉惡作、疑蓋，能說法者未離貪欲、瞋恚、惛沈睡眠、掉舉惡作、疑蓋，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When someone who listens to the teaching has parted with desire, anger, drowsiness, agitation, and the hindrance of doubt, and someone who teaches the teaching hasn't parted with desire, anger, drowsiness, agitation, and the hindrance of doubt, the two aren't in harmony, and they aren't able to teach, write, memorize, recite, or cultivate the profound perfection of wisdom, which should be known as a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0547c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0548a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有書寫、受持、讀誦、修習、思惟、演說般若波羅蜜多甚深經時，或有人來說三惡趣種種苦事，因復告言：『汝於是身應勤精進，速盡苦際而般涅槃，何用稽留生死大海，受百千種難忍苦事，求趣無上正等菩提？』",
        "translation": "If someone writes, memorizes, recites, cultivates, contemplates, or expounds the profound sūtras of prajñāpāramitā, or if someone comes along and explains the various ways in which the three evil destinies are painful, then he again says, 'In this body, you should diligently exert yourself to quickly end suffering and attain parinirvāṇa; why should you remain in the ocean of birth-and-death and suffer a hundred thousand intolerable forms of suffering while seeking to attain unsurpassed correct enlightenment?'",
        "source": "T06n0220_304:0548a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼由此言，於所書寫、受持、讀誦、修習、思惟、演說般若波羅蜜多甚深經事不得究竟，當知是為菩薩魔事。",
        "translation": "As a result of those words, their writing, memorizing, reciting, cultivating, contemplating, and expounding the profound doctrine of the perfection of wisdom doesn't reach its completion, which should be known as a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0548a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0548a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有書寫、受持、讀誦、修習、思惟、演說般若波羅蜜多甚深經時，或有人來讚說人趣種種勝事，讚說四大王眾天、三十三天、夜摩天、覩史多天、樂變化天、他化自在天諸勝妙事，讚說梵眾天、梵輔天、梵會天、大梵天諸勝妙事，讚說光天、少光天、無量光天、極光淨天諸勝妙事，讚說淨天、少淨天、無量淨天、遍淨天諸勝妙事，讚說廣天、少廣天、無量廣天、廣果天諸勝妙事，讚說無繁天、無熱天、善現天、善見天、色究竟天諸勝妙事，讚說空無邊處、識無邊處、無所有處、非想非非想處諸勝妙事，因復告言：『雖於欲界受諸欲樂，於色界中受靜慮樂，在無色界受寂定樂，而彼皆是無常、苦、空、無我、不淨、變壞之法，盡法、謝法、離法、滅法，汝於此身何不精進取預流果、若一來果、若不還果、若阿羅漢果、若獨覺菩提而般涅槃畢竟安樂，何用久處生死輪迴，無事為他受諸苦惱，求趣無上正等菩提？』",
        "translation": "若有書寫、受持、讀誦、修習、思惟、演說般若波羅蜜多甚深經時，或有人來讚說人趣種種勝事，讚說四大王眾天、三十三天、夜摩天、覩史多天、樂變化天、他化自在天諸勝妙事，讚說梵眾天、梵輔天、梵會天、大梵天諸勝妙事，讚說光天、少光天、無量光天、極光淨天諸勝妙事，讚說淨天、少淨天、無量淨天、遍淨天諸勝妙事，讚說廣天、少廣天、無量廣天、廣果天諸勝妙事，讚說無繁天、無熱天、善現天、善見天、色究竟天諸勝妙事，讚說空無邊處、識無邊處、無所有處、非想非非想處諸勝妙事，因復告言：『雖於欲界受諸欲樂，於色界中受靜慮樂，在無色界受寂定樂，而彼皆是無常、苦、空、無我、不淨、變壞之法，盡法、謝法、離法、滅法，汝於此身何不精進取預流果、若一來果、若不還果、若阿羅漢果、若獨覺菩提而般涅槃畢竟安樂，何用久處生死輪迴，無事為他受諸苦惱，求趣無上正等菩提？』",
        "source": "T06n0220_304:0548a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼由此言，於所書寫、受持、讀誦、修習、思惟、演說般若波羅蜜多甚深經事不得究竟，當知是為菩薩魔事。",
        "translation": "As a result of those words, their writing, memorizing, reciting, cultivating, contemplating, and expounding the profound doctrine of the perfection of wisdom doesn't reach its completion, which should be known as a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0548b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0548b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能說法者一身無累無礙自在，能聽法者多將人眾纏擾繫縛，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "Those who can teach the Dharma are completely unencumbered, unimpeded, and free, while those who can listen to the Dharma often bind crowds of people, preventing them from combining, and preventing them from speaking and hearing, writing, retaining, reciting, and cultivating the profound prajñāpāramitā, which should be known as a demonic act of a bodhisattva.",
        "source": "T06n0220_304:0548b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0548b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能聽法者一身無累無礙自在，能說法者多將人眾纏擾繫縛，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "Those who can listen to the teaching are completely unencumbered, unimpeded, and free, and those who can teach the teaching often bind crowds of people, preventing them from combining, and preventing them from speaking and hearing, writing, retaining, reciting, and cultivating the profound perfection of wisdom, which should be known as a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0548b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0548b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能說法者不樂眾雜，能聽法者樂處眾雜，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When someone who teaches the Dharma doesn't delight in the many distractions and someone who listens to the Dharma delights in the many distractions, the two aren't in harmony, and they aren't able to teach, listen, write, memorize, recite, or cultivate the profound perfection of wisdom, which should be known as a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0548b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0548b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能聽法者不樂眾雜，能說法者樂處眾雜，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When someone who listens to the teaching doesn't delight in the many distractions, and someone who teaches the teaching delights in the many distractions, and the two aren't combined, and they aren't able to teach, listen, write, memorize, recite, or cultivate the profound perfection of wisdom, you should know that this is a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0548b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0548b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能說法者欲令聽者於我所作悉皆隨助，能聽法者不隨其欲，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When someone who teaches the Dharma wants to make listeners follow everything I do, and someone who listens to the Dharma doesn't follow their desires and the two aren't in harmony, and they aren't allowed to teach, listen, write, memorize, recite, or cultivate the profound perfection of wisdom, you should know that this is a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0548b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0548b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能聽法者欲於說者諸所作事悉皆隨助，能說法者不隨其欲，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When someone who listens to the teaching wants to do things that are helpful to the speaker, and when someone who teaches the teaching doesn't follow their desires and the two aren't in harmony, and they aren't given the chance to teach, write, memorize, recite, or cultivate the profound perfection of wisdom, you should know that this is a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0548b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0548b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能說法者為財利故，欲為他說甚深般若波羅蜜多，復欲令彼書寫、受持、讀誦、修習，能聽法者知其所為不欲從受，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When a Dharma speaker wants to teach others the profound perfection of wisdom for their own financial gain and also wants to get them to write, memorize, recite, and practice it, and the Dharma listener knows what he's doing and doesn't want to accept it, and the two aren't in harmony, so he doesn't get to hear, write, memorize, recite, and practice the profound perfection of wisdom, you should know that this is a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0548b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0548c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能聽法者為財利故，欲請他說甚深般若波羅蜜多，復欲方便書寫、受持、讀誦、修習，能說法者知其所為而不隨請，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When a person who listens to the teaching wants to invite others to teach the profound perfection of wisdom for financial gain and also wants to skillfully write, memorize, recite, and practice it, and the person who teaches the teaching knows what they're doing but doesn't follow that invitation, the two aren't in harmony, and they aren't given the opportunity to listen, write, memorize, recite, or practice the profound perfection of wisdom, you should know that this is a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0548c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0548c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能說法者欲適他方危身命處，能聽法者恐失身命不欲隨往，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When someone who teaches the Dharma wants to go to a place where his life is at risk, and someone who listens to the Dharma doesn't want to go along for fear of losing his life, the two aren't in harmony, and they aren't able to teach, listen, write, memorize, recite, or cultivate the profound perfection of wisdom, which should be known as a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0548c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0548c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能聽法者欲適他方危身命處，能說法者恐失身命不欲共往，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When someone who listens to the teaching wants to go to a place where their life is at risk, and someone who teaches the teaching doesn't want to go with them for fear of losing their life, the two aren't in harmony, and they aren't able to teach, listen, write, memorize, recite, or cultivate the profound perfection of wisdom, which should be known as a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0548c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0548c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能說法者欲適他方儉食水處，能聽法者慮彼艱辛不欲隨往，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When someone who teaches the Dharma wants to go to another place and save up food and water, and someone who listens to the Dharma considers it difficult and doesn't want to go along with them, and they aren't in harmony, they aren't able to teach, listen, write, memorize, recite, or cultivate the profound perfection of wisdom, which should be known as a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0548c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0548c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能聽法者欲適他方儉食水處，能說法者慮彼艱辛而不共往，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When someone who listens to the teaching wants to go to another place to store food and water, and someone who teaches the teaching considers the hardships there and doesn't go with them, and they aren't united, and they aren't allowed to teach, listen, write, memorize, recite, or cultivate the profound perfection of wisdom, you should know that this is a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0548c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0548c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能說法者欲適他方豐樂之所，能聽法者欲隨其去時，說法者方便誡言：『汝雖為利欲隨我往，而汝至彼豈必遂心，宜善審思勿後憂悔。』",
        "translation": "When a Dharma speaker wants to go to a place of plenty in another place, and a Dharma listener wants to follow him, the Dharma speaker skillfully admonishes, 'Even though you want to follow me there for my own benefit, how could you possibly attain your goal if you went there?'",
        "source": "T06n0220_304:0548c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，聽法者聞已念言：『是彼不欲令我去相，設固隨往豈必聞法？』",
        "translation": "After hearing this, the person who hears the teaching thinks, 'Is it because they don't want me to go, or would it be possible to hear the teaching even if you did go along with them?'",
        "source": "T06n0220_304:0548c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣不隨其去，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "Not following these causes and conditions, and not combining them, and not being able to speak or write, memorize or recite them, or cultivate the profound perfection of wisdom, should be known as a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0548c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0549a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能說法者欲往他方，所經道路曠野險難，多有賊怖、旃茶羅怖、獵師、惡獸、毒蛇等怖，能聽法者欲隨其往時，說法者方便誡言：『汝今何故無事隨我欲經如是諸險難處，可善審思勿後致悔。』",
        "translation": "When a person who teaches the Dharma wants to go to another place and travels through a path that's wild and difficult, where there are many fears of thieves, fears of senchalas, fears of hunters, dangerous animals, and fears of vipers, and so forth, the person who teaches the Dharma wants to follow him there, the Dharma speaker skillfully admonishes him, saying, 'Why would you want to follow me through such a dangerous and difficult place for no reason? Consider it well and don't regret it later?'",
        "source": "T06n0220_304:0549a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，聽法者聞已念言：『此應不欲令我隨往，設固隨往何必聞法？』",
        "translation": "After hearing this, the hearer of the Dharma thought, 'Perhaps you don't want me to go along with you, but if you did, why would you need to hear the Dharma?'",
        "source": "T06n0220_304:0549a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因緣不隨其去，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "Not following these causes and conditions, and not combining them, and not being able to speak or write, memorize or recite them, or cultivate the profound perfection of wisdom, should be known as a demonic act for a bodhisattva.",
        "source": "T06n0220_304:0549a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0549a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能說法者多有施主數相追隨，聽法者來請說般若波羅蜜多，緣礙無暇即說，聽者起嫌後說不受，兩不和合，不獲說聽、書寫、受持、讀誦、修習甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When a person who teaches the Dharma is followed by numerous benefactors, and a listener comes to ask him to teach the perfection of wisdom but has no time to teach it because of an obstruction, the listener becomes disgusted and then says no, and the two aren't in harmony, so he doesn't get to hear, write, memorize, recite, read, or cultivate the profound perfection of wisdom, which should be known as a demonic act of a bodhisattva.",
        "source": "T06n0220_304:0549a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0549a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸惡魔作苾芻像，至菩薩所方便破壞，令於般若波羅蜜多甚深經典不得書寫、受持、讀誦、修習、思惟、為他演說。」",
        "translation": "There are all these evil demons that create images of monks and come to the bodhisattvas to skillfully destroy them, preventing them from writing, retaining, reciting, cultivating, contemplating, or explaining the profound sūtras of Prajñāpāramitā for others.\"",
        "source": "T06n0220_304:0549a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，具壽善現白佛言：「世尊！",
        "translation": "Kauśāmbī then said to the Buddha, \"Bhagavān!",
        "source": "T06n0220_304:0549a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何惡魔作苾芻像至菩薩所方便破壞，令於般若波羅蜜多甚深經典不得書寫、受持、讀誦、修習、思惟、為他演說？」",
        "translation": "How does a demon create a bhikṣu image that goes to a bodhisattva's place and skillfully destroys it, preventing him from writing, retaining, reciting, cultivating, contemplating, or explaining the profound sūtras of Prajñāpāramitā for others?\"",
        "source": "T06n0220_304:0549a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, \"Good performance!",
        "source": "T06n0220_304:0549a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸惡魔作苾芻像，至菩薩所方便破壞，令其毀厭甚深般若波羅蜜多，謂作是言：『汝所習誦無相經典非真般若波羅蜜多，我所習誦有相經典是真般若波羅蜜多。』",
        "translation": "Some evil demons portrayed themselves as monks and went to the bodhisattvas to skillfully disrupt them, causing them to dislike the profound perfection of wisdom, saying, 'That scripture you've been chanting without characteristics is not the true perfection of wisdom, but that scripture I've been chanting with characteristics is the true perfection of wisdom.'",
        "source": "T06n0220_304:0549a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語時，有諸菩薩未得受記，便於般若波羅蜜多而生疑惑，由疑惑故便於般若波羅蜜多而生毀厭，由毀厭故遂闕書寫、受持、讀誦、修習、思惟、為他演說甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When they say that, some bodhisattvas who have yet to attain assurance then have doubts about the perfection of wisdom, and because of those doubts, they become disillusioned with the perfection of wisdom, and because of that disillusionment, they stop writing, retaining, reciting, cultivating, contemplating, and explaining the profound perfection of wisdom for others, which should be known as a demonic act for bodhisattvas.",
        "source": "T06n0220_304:0549a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0549b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸惡魔作苾芻像，至菩薩所謂菩薩言：『若諸菩薩行此般若波羅蜜多，唯證實際得預流果、若一來果、若不還果、若阿羅漢果、若獨覺菩提，終不能得無上佛果，何緣於此唐設劬勞？』",
        "translation": "Some evil demons portrayed themselves as monks and came to the bodhisattva and told him, 'If bodhisattvas practice this prajñāpāramitā and only realize the actual attainment of the fruit of abortion, the fruit of the first coming, the fruit of nonreturners, the fruit of arhats, and the enlightenment of the pratyekabuddhas, they will never attain the unsurpassed Buddhahood, so why do they undertake the trouble of setting up here?'",
        "source": "T06n0220_304:0549b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩既聞，便不書寫、受持、讀誦、修習、思惟、為他演說甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "Once a bodhisattva hears about it, he doesn't write, memorize, recite, cultivate, contemplate, or expound the profound prajñāpāramitā for others, which should be known as a demonic act for bodhisattvas.",
        "source": "T06n0220_304:0549b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0549b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多說聽等時，多諸魔事而為留難，菩薩應覺當遠離之。」",
        "translation": "When the profound prajñāpāramitā is taught and heard, many demonic things cause difficulties, which bodhisattvas should recognize and keep away from.\"",
        "source": "T06n0220_304:0549b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，具壽善現白佛言：「世尊！",
        "translation": "Kauśāmbī then said to the Buddha, \"Bhagavān!",
        "source": "T06n0220_304:0549b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為魔事留難，菩薩當覺而遠離之？」",
        "translation": "What is called a demonic objection that a bodhisattva should recognize and avoid?\"",
        "source": "T06n0220_304:0549b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, \"Good performance!",
        "source": "T06n0220_304:0549b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多說聽等時，多有相似般若、靜慮、精進、安忍、淨戒、布施波羅蜜多魔事留難，菩薩應覺而遠離之。",
        "translation": "When the profound prajñāpāramitā is taught and heard, many demonic things like prajñā, meditation, effort, patience, pure precepts, and the prajñāpāramitā of generosity remain difficult, and bodhisattvas should perceive and avoid them.",
        "source": "T06n0220_304:0549b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0549b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多說聽等時，多有相似內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空魔事留難，菩薩應覺當遠離之。",
        "translation": "When the profound prajñāpāramitā is taught and heard, there are many similarities between internal emptiness, external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness with and without effort, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own characteristics, emptiness of shared characteristics, emptiness of all things, inaccessible emptiness, emptiness without nature, emptiness of self-nature, emptiness of self-nature, and emptiness of self-nature without nature that are demonic and difficult, which bodhisattvas should recognize and keep away from.",
        "source": "T06n0220_304:0549b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0549b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多說聽等時，多有相似真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界魔事留難，菩薩應覺當遠離之。",
        "translation": "When the profound prajñāpāramitā is taught and heard, many demonic things resembling true reality, the Dharma realm, the Dharma nature, non-falsity, unchanging difference, equality, freedom from birth, legality, Dharma abiding, reality, the space realm, and the inconceivable realm remain difficult, and bodhisattvas should awaken to them and avoid them.",
        "source": "T06n0220_304:0549b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0549b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多說聽等時，有諸惡魔作苾芻像至菩薩所，宣說二乘相應之法，謂四聖諦、四靜慮、四無量、四無色定、八解脫、八勝處、九次第定、十遍處、四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支、三解脫門、六神通等，說是法已謂菩薩言：『大士當知！",
        "translation": "When the profound prajñāpāramitā was being explained and heard, some evil demons came to the bodhisattva in the image of a bhikṣu and explained the teachings associated with the two vehicles, namely, the four noble truths, the four meditations, the four immeasurables, the four formless concentrations, the eight liberations, the eight abodes of excellence, the nine graduated concentrations, the ten pervasive abodes, the four abodes of mindfulness, the four correct eliminations, the four spiritual abilities, the five faculties, the five powers, the seven factors of virtual enlightenment, the eight noble factors of the path, the three gates of liberation, the six supernormal powers, and so forth, and after explaining these teachings, they said to the bodhisattva, 'You should know, great man!",
        "source": "T06n0220_304:0549b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且依此法精勤修學，取預流果、若一來果、若不還果、若阿羅漢果、若獨覺菩提，遠離一切生老病死，何用無上正等菩提？』",
        "translation": "Furthermore, if you diligently train according to this teaching and attain the fruit of pre-flow, the fruit of the once-returner, the fruit of the nonreturner, the fruit of the arhat, or the enlightenment of the solitary realizer, you'll be freed from all birth, old age, illness, and death, so why should you use unsurpassed perfect enlightenment?'",
        "source": "T06n0220_304:0549c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為般若魔事留難，菩薩應覺當遠離之。",
        "translation": "This is a demonic objection to Prajñā, which bodhisattvas should realize and keep away from.",
        "source": "T06n0220_304:0549c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0549c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸惡魔作苾芻像，威儀庠序形貌端嚴，菩薩見之深生愛著，由斯損減一切智智，不獲聽聞、書寫、受持、讀誦、修習、思惟、演說甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When evil demons create images of bhikṣus with peaceful demeanor and dignified appearance, the bodhisattvas see them and become deeply attached to them, which diminishes their omniscience and knowledge and prevents them from hearing, writing, retaining, reciting, cultivating, contemplating, or expounding the profound perfection of wisdom, which should be known as a demonic act for bodhisattvas.",
        "source": "T06n0220_304:0549c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0549c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸惡魔作佛形像，身純金色，常光一尋，具三十二大丈夫相，八十隨好以自莊嚴，菩薩見之深生愛著，由斯損減一切智智，不獲聽聞、書寫、受持、讀誦、修習、思惟、演說甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When evil demons create an image of a buddha with a pure golden body, an ever-present glow, and thirty-two great characteristics and eighty minor features to adorn themselves, a bodhisattva's vision becomes deeply attached to it, which diminishes their omniscience and knowledge and prevents them from hearing, writing, retaining, reciting, cultivating, contemplating, or expounding the profound prajñāpāramitā, which should be known as a demonic act of a bodhisattva.",
        "source": "T06n0220_304:0549c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0549c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸惡魔化作佛像，苾芻圍遶宣說法要，菩薩見之深生愛著，便作是念：『願我未來亦當如是。』",
        "translation": "When evil demons disguise themselves as images of the Buddha and bhikṣus surround them as they teach the essentials of the Dharma, the bodhisattvas see them and become deeply attached to them, and they think, 'May I do the same in the future.'",
        "source": "T06n0220_304:0549c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由斯損減一切智智，不獲聽聞、書寫、受持、讀誦、修習、思惟、演說甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "Thus, it diminishes omniscience and knowledge and prevents them from hearing, writing, retaining, reciting, cultivating, contemplating, and expounding the profound perfection of wisdom, which should be known as a demonic act of a bodhisattva.",
        "source": "T06n0220_304:0549c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0549c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸惡魔化作菩薩摩訶薩像，若百若千乃至無量，或行布施波羅蜜多，或行淨戒、安忍、精進、靜慮、般若波羅蜜多，菩薩見之深生愛著，由斯損減一切智智，不獲聽聞、書寫、受持、讀誦、修習、思惟、演說甚深般若波羅蜜多，當知是為菩薩魔事。",
        "translation": "When evil demons take on the form of bodhisattva-mahāsattva images, whether hundreds or thousands or countless, that sometimes practice the perfection of generosity or the perfection of pure morality, patience, effort, meditation, or wisdom, and bodhisattvas see them and become deeply attached to them, that diminishes their omniscience and knowledge and prevents them from hearing, writing, retaining, reciting, cultivating, contemplating, or expounding the profound prajñāpāramitā, you should know that this is a demonic act for bodhisattvas.",
        "source": "T06n0220_304:0549c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「所以者何？",
        "translation": "\"Why is that?",
        "source": "T06n0220_304:0549c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Good manifestation!",
        "source": "T06n0220_304:0549c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，色無所有，受、想、行、識無所有。",
        "translation": "\"In the profound perfection of wisdom, form has no existence, and feeling, perception, volition, and consciousness have no existence.",
        "source": "T06n0220_304:0549c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處色無所有，受、想、行、識無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If this is a place where form has no existence and feeling, perception, volition, and consciousness have no existence, then this is a place where buddhas have no existence and bodhisattvas, śrāvakas, and pratyekbuddhas have no existence.",
        "source": "T06n0220_304:0550a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0550a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0550a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0550a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，眼處無所有，耳、鼻、舌、身、意處無所有。",
        "translation": "\"In the profound perfection of wisdom, the locus of the eye has nothing, and the locus of the ear, nose, tongue, body, and mind have nothing.",
        "source": "T06n0220_304:0550a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處眼處無所有，耳、鼻、舌、身、意處無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If the sense-field of the eye has nothing, and the sense-fields of the ear, nose, tongue, body, and mind have nothing, then the buddhas have nothing, and the bodhisattvas, śrāvakas, and solitary realizers have nothing.",
        "source": "T06n0220_304:0550a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0550a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0550a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0550a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，色處無所有，聲、香、味、觸、法處無所有。",
        "translation": "\"In the profound perfection of wisdom, the abode of form has no existence, and the abode of sound, odor, taste, touch, and dharma has no existence.",
        "source": "T06n0220_304:0550a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處色處無所有，聲、香、味、觸、法處無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If this is a place where form has no existence and the places of sound, odor, taste, touch, and dharma have no existence, then this is a place where buddhas have no existence and bodhisattvas, śrāvakas, and pratyekbuddhas have no existence.",
        "source": "T06n0220_304:0550a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0550a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0550a13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0550a13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，眼界無所有，色界、眼識界及眼觸、眼觸為緣所生諸受無所有。",
        "translation": "\"In the profound perfection of wisdom, the eye realm is nonexistent, and the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as perceptual objects are nonexistent.",
        "source": "T06n0220_304:0550a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處眼界無所有，色界乃至眼觸為緣所生諸受無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If this is the place where the element of the eye has no existence, and the element of form and even the sensations that arise from the condition of eye contact have no existence, then this is the place where buddhas have no existence, and bodhisattvas, śrāvakas, and pratyekbuddhas have no existence either.",
        "source": "T06n0220_304:0550a15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0550a18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0550a18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0550a19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，耳界無所有，聲界、耳識界及耳觸、耳觸為緣所生諸受無所有。",
        "translation": "\"In the profound perfection of wisdom, the ear realm is nonexistent, and the sound realm, the ear-consciousness realm, and the sensations that arise from ear contact and ear contact as perceptual objects are nonexistent.",
        "source": "T06n0220_304:0550a19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處耳界無所有，聲界乃至耳觸為緣所生諸受無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If this is a place where the ear realm has no existence and the sound realm and even the sensations that arise from ear-contact as a condition have no existence, then this is a place where buddhas have no existence and bodhisattvas, śrāvakas, and pratyekbuddhas have no existence.",
        "source": "T06n0220_304:0550a21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0550a23_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0550a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0550a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，鼻界無所有，香界、鼻識界及鼻觸、鼻觸為緣所生諸受無所有。",
        "translation": "\"In the profound perfection of wisdom, the nasal realm has no existence, and the element of fragrance, the element of nasal consciousness, and the sensations that arise from nasal contact and nasal contact as a condition have no existence.",
        "source": "T06n0220_304:0550a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處鼻界無所有，香界乃至鼻觸為緣所生諸受無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If this is a place where the nasal realm has no existence and the sense sense-perceptions that arise from the sense-perception and nasal contact have no existence, then this is a place where buddhas have no existence and bodhisattvas, śrāvakas, and pratyekbuddhas have no existence.",
        "source": "T06n0220_304:0550a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0550a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0550a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0550a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，舌界無所有，味界、舌識界及舌觸、舌觸為緣所生諸受無所有。",
        "translation": "\"In the profound perfection of wisdom, the tongue realm is nonexistent, and the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact as perceptual objects are nonexistent.",
        "source": "T06n0220_304:0550a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處舌界無所有，味界乃至舌觸為緣所生諸受無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If this is a place where the tongue realm has nothing, and the taste realm and even the sensations that arise from tongue contact as a condition have nothing, then this is a place where buddhas have nothing, and bodhisattvas, śrāvakas, and pratyekbuddhas have nothing.",
        "source": "T06n0220_304:0550b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0550b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0550b05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0550b06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，身界無所有，觸界、身識界及身觸、身觸為緣所生諸受無所有。",
        "translation": "\"In the profound perfection of wisdom, the body realm is nonexistent, and the contact realm, the body-consciousness realm, and the sensations that arise from bodily contact and bodily contact as an object are nonexistent.",
        "source": "T06n0220_304:0550b06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處身界無所有，觸界乃至身觸為緣所生諸受無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If this is a place where the body realm has no existence, and the contact realm and even the sensations that arise from bodily contact as a condition have no existence, then this is a place where buddhas have no existence, and bodhisattvas, śrāvakas, and pratyekbuddhas have no existence either.",
        "source": "T06n0220_304:0550b08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0550b10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0550b10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0550b11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，意界無所有，法界、意識界及意觸、意觸為緣所生諸受無所有。",
        "translation": "\"In the profound perfection of wisdom, the mind element is nonexistent, and the Dharma element, the consciousness element, and the sensations that arise from mental contact and mental contact as perceptual objects are nonexistent.",
        "source": "T06n0220_304:0550b11_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處意界無所有，法界乃至意觸為緣所生諸受無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If this is a place where the mind realm has no existence, and the Dharma realm and even the sensations that arise from mental contact as a condition have no existence, then this is a place where buddhas have no existence, and bodhisattvas, śrāvakas, and solitary realizers have no existence either.",
        "source": "T06n0220_304:0550b13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0550b16_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0550b16_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0550b16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，地界無所有，水、火、風、空、識界無所有。",
        "translation": "\"In the profound perfection of wisdom, the element of earth has no existence, and the elements of water, fire, wind, air, and consciousness have no existence.",
        "source": "T06n0220_304:0550b16_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處地界無所有，水、火、風、空、識界無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If the element of earth has no existence, and the elements of water, fire, wind, space, and consciousness have no existence, then the buddhas have no existence there, and the bodhisattvas, śrāvakas, and solitary realizers have no existence either.",
        "source": "T06n0220_304:0550b18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0550b20_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0550b20_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0550b21_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，無明無所有，行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱無所有。",
        "translation": "\"In the profound perfection of wisdom, nescience has no existence, and form, consciousness, name-and-form, the six sense-fields, touch, feeling, craving, appropriation, existence, birth, and the grief and sorrow of old age and death have no existence.",
        "source": "T06n0220_304:0550b21_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處無明無所有，行乃至老死愁歎苦憂惱無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If this is a place where nescience has no existence and formations and even old age and death are characterized by sorrow, pain, and vexation, then this is a place where buddhas have no existence and bodhisattvas, śrāvakas, and solitary realizers have no existence.",
        "source": "T06n0220_304:0550b23_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0550b25_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0550b26_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0550b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，布施波羅蜜多無所有，淨戒、安忍、精進、靜慮、般若波羅蜜多無所有。",
        "translation": "\"Among the profound perfections, the perfection of generosity has nothing, and the perfections of pure morality, patience, effort, meditation, and prajñāpāramitā have nothing.",
        "source": "T06n0220_304:0550b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處布施波羅蜜多無所有，淨戒乃至般若波羅蜜多無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If the perfection of generosity had no existence and the perfection of pure morality and even the perfection of wisdom had no existence, then the buddhas would have no existence there, and the bodhisattvas, śrāvakas, and solitary realizers would have no existence.",
        "source": "T06n0220_304:0550b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0550c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0550c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0550c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，內空無所有，外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空無所有。",
        "translation": "In the profound perfection of wisdom, internal emptiness has no existence, and external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, endless emptiness, dispersed emptiness, unchanging emptiness, emptiness of original nature, emptiness of own characteristics, emptiness of shared characteristics, emptiness of all things, inaccessible emptiness, natureless emptiness, self-nature emptiness, and natureless self-nature emptiness have no existence.",
        "source": "T06n0220_304:0550c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處內空無所有，外空乃至無性自性空無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If internal emptiness is nonexistent here, and external emptiness or even the emptiness of a natureless nature is nonexistent, then the buddhas are nonexistent here, and the bodhisattvas, śrāvakas, and solitary realizers are nonexistent as well.",
        "source": "T06n0220_304:0550c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0550c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0550c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0550c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，真如無所有，法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界無所有。",
        "translation": "\"In the profound perfection of wisdom, true thusness has no existence, and the Dharma realm, Dharma nature, non-falsity, unchanging nature, equality, freedom from birth, legal status, Dharma abiding, reality, the space realm, and the inconceivable realm have no existence.",
        "source": "T06n0220_304:0550c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處真如無所有，法界乃至不思議界無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If this is a place where the true thusness has no existence and the Dharma realm and even the inconceivable realm have no existence, then this is a place where buddhas have no existence and bodhisattvas, śrāvakas, and solitary realizers have no existence.",
        "source": "T06n0220_304:0550c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0550c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0550c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0550c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，苦聖諦無所有，集、滅、道聖諦無所有。",
        "translation": "\"In the profound perfection of wisdom, the noble truth of suffering has no existence, and the noble truths of arising, ceasing, and the path have no existence.",
        "source": "T06n0220_304:0550c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處苦聖諦無所有，集、滅、道聖諦無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If these noble truths of suffering have no existence and the noble truths of arising, ceasing, and the path have no existence, then these buddhas have no existence, and bodhisattvas, śrāvakas, and pratyekbuddhas have no existence.",
        "source": "T06n0220_304:0550c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0550c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0550c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0550c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，四靜慮無所有，四無量、四無色定無所有。",
        "translation": "\"In the profound perfection of wisdom, the four meditations lack existence, and the four immeasurable and four formless concentrations lack existence.",
        "source": "T06n0220_304:0550c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處四靜慮無所有，四無量、四無色定無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If these four meditations lack existence, and these four immeasurable and four formless concentrations lack existence, then the buddhas lack existence there, and the bodhisattvas, śrāvakas, and solitary realizers lack existence as well.",
        "source": "T06n0220_304:0550c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0550c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0550c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0550c25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，八解脫無所有，八勝處、九次第定、十遍處無所有。",
        "translation": "\"In the profound perfection of wisdom, the eight liberations lack existence, and the eight abodes of excellence, nine graduated concentrations, and ten universal abodes lack existence.",
        "source": "T06n0220_304:0550c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處八解脫無所有，八勝處、九次第定、十遍處無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If these eight liberations lack existence, and the eight abodes of excellence, nine graduated concentrations, and ten pervasive abodes lack existence, then the buddhas lack existence there, and the bodhisattvas, śrāvakas, and solitary realizers lack existence as well.",
        "source": "T06n0220_304:0550c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0551a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0551a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0551a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，四念住無所有，四正斷、四神足、五根、五力、七等覺支、八聖道支無所有。",
        "translation": "\"In the profound perfection of wisdom, the four abodes of mindfulness lack existence, and the four correct eliminations, four miraculous abilities, five faculties, five powers, seven factors of virtual enlightenment, and eight noble factors of the path lack existence.",
        "source": "T06n0220_304:0551a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處四念住無所有，四正斷乃至八聖道支無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If these four abodes of mindfulness have nothing, and these four correct eliminations and the eight noble factors of the path have nothing, then the buddhas have nothing, and the bodhisattvas, śrāvakas, and solitary realizers have nothing.",
        "source": "T06n0220_304:0551a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0551a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0551a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0551a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，空解脫門無所有，無相、無願解脫門無所有。",
        "translation": "\"In the profound perfection of wisdom, the gate of liberation through emptiness has nothing, and the gate of liberation through signlessness and wishlessness has nothing.",
        "source": "T06n0220_304:0551a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處空解脫門無所有，無相、無願解脫門無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If the liberation gate of emptiness has nothing, and the liberation gate of signlessness and wishlessness has nothing, then the buddhas have nothing, and the bodhisattvas, śrāvakas, and pratyekbuddhas have nothing.",
        "source": "T06n0220_304:0551a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0551a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0551a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0551a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，菩薩十地無所有。",
        "translation": "\"In the profound perfection of wisdom, the bodhisattva's ten stages lack existence.",
        "source": "T06n0220_304:0551a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處菩薩十地無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If the bodhisattvas' ten stages here lack existence, the buddhas here lack existence, and the bodhisattvas, śrāvakas, and pratyekbuddhas also lack existence.",
        "source": "T06n0220_304:0551a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0551a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0551a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0551a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，五眼無所有，六神通無所有。",
        "translation": "\"In the profound perfection of wisdom, the five eyes lack existence and the six supernormal powers lack existence.",
        "source": "T06n0220_304:0551a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處五眼無所有，六神通無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If the five eyes are nonexistent and the six supernormal powers are nonexistent, then the buddhas are nonexistent there, and the bodhisattvas, śrāvakas, and solitary realizers are nonexistent as well.",
        "source": "T06n0220_304:0551a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0551a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0551a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0551a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，佛十力無所有，四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法無所有。",
        "translation": "\"In the profound perfection of wisdom, the Buddha's ten powers lack existence, and the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and 18 distinctive characteristics of the Buddha lack existence.",
        "source": "T06n0220_304:0551a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處佛十力無所有，四無所畏乃至十八佛不共法無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If the Buddha's ten powers are nonexistent here, and the four unsurpassables and even the 18 Buddha-principles are nonexistent, then the Buddha is nonexistent here, and so are the bodhisattvas, śrāvakas, and pratyekbuddhas.",
        "source": "T06n0220_304:0551a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0551a25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0551a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0551a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，無忘失法無所有，恒住捨性無所有。",
        "translation": "\"In the profound perfection of wisdom, the absence of forgetfulness has nothing, and the permanently abiding nature of equanimity has nothing.",
        "source": "T06n0220_304:0551a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處無忘失法無所有，恒住捨性無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If this state of being without forgetfulness has nothing, and the nature of constantly abiding in equanimity has nothing, then the buddhas have nothing, and the bodhisattvas, śrāvakas, and solitary realizers have nothing.",
        "source": "T06n0220_304:0551a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0551a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0551a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0551b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，一切智無所有，道相智、一切相智無所有。",
        "translation": "\"In the profound perfection of wisdom, omniscience has no existence, and cognition of the path and cognition of all characteristics has no existence.",
        "source": "T06n0220_304:0551b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處一切智無所有，道相智、一切相智無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If this is a place where omniscience has no possessions and knowledge of the path and knowledge of all characteristics have no possessions, then this is a place where buddhas have no possessions and bodhisattvas, śrāvakas, and solitary realizers have no possessions.",
        "source": "T06n0220_304:0551b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0551b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0551b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0551b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，一切陀羅尼門無所有，一切三摩地門無所有。",
        "translation": "\"In the profound perfection of wisdom, all the dhāraṇī entries lack existence, and all the samādhi entries lack existence.",
        "source": "T06n0220_304:0551b06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處一切陀羅尼門無所有，一切三摩地門無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If this is a place where all the dhāraṇī aspects lack existence and all the samādhi aspects lack existence, then this is a place where buddhas lack existence and bodhisattvas, śrāvakas, and solitary realizers lack existence.",
        "source": "T06n0220_304:0551b07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0551b10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0551b10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0551b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，預流果無所有，一來、不還、阿羅漢果無所有。",
        "translation": "\"In the profound perfection of wisdom, the fruit of stream-winner has nothing, and the fruit of once-returning, nonreturning, and arhatship has nothing.",
        "source": "T06n0220_304:0551b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處預流果無所有，一來、不還、阿羅漢果無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If this is a place where the fruit of pre-flow has no existence and the fruit of once-returning, irreversibility, and arhatship have no existence, then this is a place where buddhas have no existence and bodhisattvas, direct disciples, and solitary realizers have no existence.",
        "source": "T06n0220_304:0551b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0551b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0551b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0551b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，獨覺菩提無所有。",
        "translation": "\"In the profound perfection of wisdom, the enlightenment of the solitary realizer has no existence.",
        "source": "T06n0220_304:0551b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處獨覺菩提無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If the solitary realizer's enlightenment doesn't exist here, then the buddhas don't exist here, and neither do the bodhisattvas, śrāvakas, or solitary realizers.",
        "source": "T06n0220_304:0551b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0551b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0551b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0551b19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，一切菩薩摩訶薩行無所有。",
        "translation": "\"In the profound perfection of wisdom, all bodhisattva-mahāsattva practices lack existence.",
        "source": "T06n0220_304:0551b19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處一切菩薩摩訶薩行無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If all bodhisattva-mahāsattva practices here have nothing, then the buddhas here have nothing, and the bodhisattvas, śrāvakas, and solitary realizers have nothing.",
        "source": "T06n0220_304:0551b20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0551b22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_304:0551b22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good performance!",
        "source": "T06n0220_304:0551b23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於甚深般若波羅蜜多中，諸佛無上正等菩提無所有。",
        "translation": "\"In the profound perfection of wisdom, the unsurpassed correct enlightenment of the buddhas has no existence.",
        "source": "T06n0220_304:0551b23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於是處諸佛無上正等菩提無所有，則於是處佛無所有，菩薩、聲聞及諸獨覺亦無所有。",
        "translation": "If the unsurpassed correct enlightenment of the buddhas at this place has no existence, then the buddhas at this place have no existence, and neither do bodhisattvas, śrāvakas, nor solitary realizers.",
        "source": "T06n0220_304:0551b24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0551b26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all things is empty.",
        "source": "T06n0220_304:0551b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0551b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住菩薩乘諸善男子、善女人等，聽聞、書寫、受持、讀誦、修習、思惟、為他演說如是般若波羅蜜多甚深經時，多有留難違害事起，令少福者事不成就。",
        "translation": "\"When good men and good women who reside in the bodhisattva vehicle hear, write, memorize, recite, practice, contemplate, and expound such profound scriptures as these prajñāpāramitā for others, many difficult and harmful situations arise that prevent those with little merit from accomplishing their tasks.",
        "source": "T06n0220_304:0551b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如贍部洲有諸珍寶，謂吠瑠璃、螺貝、璧玉、珊瑚、石藏、末尼、真珠、帝青、大青、金、銀等寶，多有盜賊違害留難，諸薄福人求不能得。",
        "translation": "Suppose there are treasures on the Jambudvīpa continent, such as lapis lazuli, conch shells, jade, coral, stone treasures, mani pearl, genuine pearl, Tejaprabhā, Big Blue, gold, silver, and other treasures, but many thieves and thievery make it difficult and impossible for people of little merit to obtain them.",
        "source": "T06n0220_304:0551c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多無價寶珠亦復如是，諸少福者聽聞等時，多諸惡魔為作留難。」",
        "translation": "*Very profound prajñāpāramitā's priceless jewels are likewise, and when less fortunate people hear about them, many evil demons make it difficult for them.\"",
        "source": "T06n0220_304:0551c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善現即白佛言：「如是！",
        "translation": "Guoshou Shanjin then said to the Buddha, \"So it is!",
        "source": "T06n0220_304:0551c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_304:0551c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_304:0551c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善逝！",
        "translation": "Well gone!",
        "source": "T06n0220_304:0551c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚深般若波羅蜜多，如贍部洲吠瑠璃等種種珍寶多有留難，諸薄福人求不能得。",
        "translation": "\"The profound perfection of wisdom is like the jewels of the Jambudvīpa region, such as beryl, which are often difficult to obtain and cannot be obtained by those of little merit who seek them.",
        "source": "T06n0220_304:0551c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住菩薩乘諸善男子、善女人等少福德故，聽聞等時多諸留難，雖有樂欲而不能成。",
        "translation": "Good men and good women who reside in the bodhisattva vehicle have few virtues, so when they hear and listen to it, there are many difficulties, and although they have pleasant desires, they can't attain them.",
        "source": "T06n0220_304:0551c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_304:0551c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有愚癡者為魔所使，住菩薩乘諸善男子、善女人等，聽聞、書寫、受持、讀誦、修習、思惟、為他演說如是般若波羅蜜多甚深經時為作留難。",
        "translation": "When foolish people are led by Māra to abide in the bodhisattva vehicle, good men and good women who hear, write, memorize, recite, cultivate, contemplate, and expound such a profound sutra as the Perfection of Wisdom for others make it difficult for them.",
        "source": "T06n0220_304:0551c12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T06n0220_304:0551c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼愚癡者覺慧薄劣，自不聽聞、書寫、受持、讀誦、修習、思惟、演說甚深般若波羅蜜多，復樂障他聽聞、書寫、受持、讀誦、修習、思惟、為他演說甚深般若波羅蜜多。",
        "translation": "That foolish man's awareness and wisdom are weak, so he doesn't hear, write, retain, recite, cultivate, contemplate, or expound the profound perfections of prajñā, and he's also happy to hinder others from hearing, writing, retaining, reciting, cultivating, contemplating, and expounding the profound perfections of prajñā for them.",
        "source": "T06n0220_304:0551c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_304:0551c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼愚癡者不樂大法，自於般若波羅蜜多甚深經典不樂聽聞、書寫、受持、讀誦、修習、思惟、演說，於他聽聞、書寫、受持、讀誦、修習、思惟、演說如是般若波羅蜜多甚深經時復為障礙。」",
        "translation": "That foolish man doesn't delight in the great teaching, doesn't delight in hearing, writing, retaining, reciting, cultivating, contemplating, and expounding the profound scriptures of the perfection of wisdom on his own, and again becomes an obstruction when others hear, write, retain, recite, cultivate, contemplate, and expound such profound scriptures of the perfection of wisdom.\"",
        "source": "T06n0220_304:0551c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, \"Good performance!",
        "source": "T06n0220_304:0551c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_304:0551c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_304:0551c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有愚癡人為魔所使，未種善根福慧薄劣，未於佛所發弘誓願，未為善友之所攝受，自於般若波羅蜜多甚深經典不能聽聞、書寫、受持、讀誦、修習、思惟、演說，新學大乘諸善男子、善女人等，聽聞、書寫、受持、讀誦、修習、思惟、為他演說如是般若波羅蜜多甚深經時，為作留難。",
        "translation": "\"When a foolish man is actuated by Māra, hasn't cultivated good roots, has poor fortune and wisdom, hasn't made a great vow to the Buddha, and hasn't been taken in by a good friend, he is unable to hear, write, retain, recite, cultivate, contemplate, or expound the profound sūtras of Prajñāpāramitā on his own, and when new students of the great vehicle, such good men and good women hear, write, retain, recite, cultivate, contemplate, and expound such profound sūtras for others, they make it difficult for them.",
        "source": "T06n0220_304:0551c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "\"Good man!",
        "source": "T06n0220_304:0552a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於當來世有善男子、善女人等，覺慧薄劣善根微少，於諸如來廣大功德心不欣樂，自於般若波羅蜜多甚深經典不能聽聞、書寫、受持、讀誦、修習、思惟、廣說，復樂障他聽聞、書寫、受持、讀誦、修習、思惟、為他演說甚深般若波羅蜜多。",
        "translation": "In a future life, there will be good sons and good women with weak awakening and poor good roots who aren't pleased with the vast merits of the Tathāgatas, can't hear, write, retain, recite, cultivate, contemplate, or expound the profound sūtras of the perfection of wisdom, and are happy to hinder others from hearing, writing, retaining, reciting, cultivating, contemplating, and expounding the profound perfection of wisdom for them.",
        "source": "T06n0220_304:0552a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0552a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住菩薩乘諸善男子、善女人等，聽聞、書寫、受持、讀誦、修習、思惟、為他演說如是般若波羅蜜多甚深經時多有魔事。",
        "translation": "When good men and good women who reside in the bodhisattva vehicle hear, write, memorize, recite, practice, contemplate, and expound such a profound sutra as Prajñāpāramitā for others, there are often demonic occurrences.",
        "source": "T06n0220_304:0552a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good man!",
        "source": "T06n0220_304:0552a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等，聽聞、書寫、受持、讀誦、修習、思惟、為他演說如是般若波羅蜜多甚深經時無諸魔事，復能圓滿般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，復能圓滿內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，復能圓滿真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，復能圓滿苦聖諦、集、滅、道聖諦，復能圓滿四靜慮、四無量、四無色定，復能圓滿八解脫、八勝處、九次第定、十遍處，復能圓滿四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支，復能圓滿空解脫門、無相、無願解脫門，復能圓滿菩薩十地，復能圓滿五眼、六神通，復能圓滿佛十力、四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法，復能圓滿無忘失法、恒住捨性，復能圓滿一切智、道相智、一切相智，復能圓滿一切陀羅尼門、一切三摩地門，復能圓滿一切菩薩摩訶薩行，復能圓滿諸佛無上正等菩提。",
        "translation": "若善男子、善女人等，聽聞、書寫、受持、讀誦、修習、思惟、為他演說如是般若波羅蜜多甚深經時無諸魔事，復能圓滿般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，復能圓滿內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，復能圓滿真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，復能圓滿苦聖諦、集、滅、道聖諦，復能圓滿四靜慮、四無量、四無色定，復能圓滿八解脫、八勝處、九次第定、十遍處，復能圓滿四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支，復能圓滿空解脫門、無相、無願解脫門，復能圓滿菩薩十地，復能圓滿五眼、六神通，復能圓滿佛十力、四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法，復能圓滿無忘失法、恒住捨性，復能圓滿一切智、道相智、一切相智，復能圓滿一切陀羅尼門、一切三摩地門，復能圓滿一切菩薩摩訶薩行，復能圓滿諸佛無上正等菩提。",
        "source": "T06n0220_304:0552a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善現！",
        "translation": "\"Good manifestation!",
        "source": "T06n0220_304:0552b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知皆是佛威神力加祐如是諸善男子、善女人等，令其聽聞、書寫、受持、讀誦、修習、思惟、演說如是般若波羅蜜多甚深經時魔事不起，復令圓滿般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，復令圓滿內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，復令圓滿真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，復令圓滿苦聖諦、集、滅、道聖諦，復令圓滿四靜慮、四無量、四無色定，復令圓滿八解脫、八勝處、九次第定、十遍處，復令圓滿四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支，復令圓滿空解脫門、無相、無願解脫門，復令圓滿菩薩十地，復令圓滿五眼、六神通，復令圓滿佛十力、四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法，復令圓滿無忘失法、恒住捨性，復令圓滿一切智、道相智、一切相智，復令圓滿一切陀羅尼門、一切三摩地門，復令圓滿一切菩薩摩訶薩行，復令圓滿諸佛無上正等菩提。",
        "translation": "當知皆是佛威神力加祐如是諸善男子、善女人等，令其聽聞、書寫、受持、讀誦、修習、思惟、演說如是般若波羅蜜多甚深經時魔事不起，復令圓滿般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，復令圓滿內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，復令圓滿真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，復令圓滿苦聖諦、集、滅、道聖諦，復令圓滿四靜慮、四無量、四無色定，復令圓滿八解脫、八勝處、九次第定、十遍處，復令圓滿四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支，復令圓滿空解脫門、無相、無願解脫門，復令圓滿菩薩十地，復令圓滿五眼、六神通，復令圓滿佛十力、四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法，復令圓滿無忘失法、恒住捨性，復令圓滿一切智、道相智、一切相智，復令圓滿一切陀羅尼門、一切三摩地門，復令圓滿一切菩薩摩訶薩行，復令圓滿諸佛無上正等菩提。",
        "source": "T06n0220_304:0552b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "\"Furthermore, good performance!",
        "source": "T06n0220_304:0552b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方世界一切如來、應、正等覺為諸有情現說法者，亦以神力加祐如是諸善男子、善女人等，令其聽聞、書寫、受持、讀誦、修習、思惟、演說如是般若波羅蜜多甚深經時無諸魔事。",
        "translation": "\"All the tathāgatas, arhats, and fully enlightened ones in the world in the ten directions who presently teach the Dharma for sentient beings also bless such good men and women with their spiritual powers, causing them to hear, write, memorize, recite, cultivate, contemplate, and expound such profound sūtras as the Perfection of Wisdom, without any demonic activity.",
        "source": "T06n0220_304:0552b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善現！",
        "translation": "Well done, Sugata!",
        "source": "T06n0220_304:0552b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方世界不退轉位一切菩薩摩訶薩眾，亦以神力加祐如是諸善男子、善女人等，令其聽聞、書寫、受持、讀誦、修習、思惟、演說如是般若波羅蜜多甚深經時無諸魔事。」",
        "translation": "All the bodhisattvas, mahāsattvas, and others in the nonretrogressing stages of the world in the ten directions also protect such good men and women with their spiritual powers, causing them to hear, write, memorize, recite, cultivate, contemplate, and expound such a profound scripture without any demonic activity.\"",
        "source": "T06n0220_304:0552b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎大般若波羅蜜多經卷第三百四",
        "translation": "â€œThe Mahāprajñāpāramitā-sūtra, Volume 3400",
        "source": "T06n0220_304:0552c02_4",
        "is_bad_quality": false
    }
]