[
    {
        "source_sentence": "大般若波羅蜜多經卷第二百九",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 299",
        "source": "T06n0220_298:0514b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十八",
        "translation": "eighteen",
        "source": "T06n0220_298:0514b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T06n0220_298:0514b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初分難聞功德品第三十九之二",
        "translation": "Chapter 39bis of the Gaṇḍavyūhasūtra",
        "source": "T06n0220_298:0514b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T06n0220_298:0514b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若於真如非住非不住、非習非不習，是為住習真如；若於法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界非住非不住、非習非不習，是為住習法界乃至不思議界。",
        "translation": "When bodhisattvas Mahāsattvas practice the perfection of wisdom, if they don't abide or don't abide in the true thusness and don't cultivate or don't cultivate it, this is abiding and cultivating the true thusness; if they don't abide or don't abide in the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from birth, legality, Dharma abiding, reality, the space realm, and the inconceivable realm, this is abiding and cultivating the Dharma realm ... and even the inconceivable realm.",
        "source": "T06n0220_298:0514b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0514b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_298:0514b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩觀真如乃至不思議界前、後、中際不可得故。",
        "translation": "It's because the bodhisattvas, mahāsattvas, contemplate the true thusness ... and don't even contemplate that the prior, subsequent, and middle portions of the realm are inapprehensible.",
        "source": "T06n0220_298:0514b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T06n0220_298:0514b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若於苦聖諦非住非不住、非習非不習，是為住習苦聖諦；若於集、滅、道聖諦非住非不住、非習非不習，是為住習集、滅、道聖諦。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of wisdom, if they neither abide nor refrain from abiding in the noble truth of suffering and neither cultivate nor don't cultivate it, this is the noble truth of abiding and cultivating the noble truth of suffering; if they neither abide nor refrain from abiding in the noble truths of accumulation, cessation, and the path and don't cultivate them, this is the noble truth of accumulation, cessation, and the path.",
        "source": "T06n0220_298:0514b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0514b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_298:0514b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩觀苦聖諦、集、滅、道聖諦前、後、中際不可得故。",
        "translation": "It's because the bodhisattva-mahāsattva's contemplation of the noble truths of suffering, arising, cessation, and the path is unobtainable in the prior, subsequent, and intermediate realms.",
        "source": "T06n0220_298:0514b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T06n0220_298:0514b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若於四靜慮非住非不住、非習非不習，是為住習四靜慮；若於四無量、四無色定非住非不住、非習非不習，是為住習四無量、四無色定。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of wisdom, if they neither abide nor don't abide in the four states of meditation and don't cultivate or don't cultivate them, this is called abiding and cultivating the four states of meditation; if they neither abide nor don't abide in the four immeasurable and four formless concentrations and don't cultivate or don't cultivate them, this is called abiding and cultivating the four immeasurable and four formless concentrations.",
        "source": "T06n0220_298:0514b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0514c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_298:0514c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩觀四靜慮、四無量、四無色定前、後、中際不可得故。",
        "translation": "It's because the bodhisattva Mahāsattva observes that the four meditations, the four immeasurables, and the four formless concentrations are unobtainable before, after, and in the middle.",
        "source": "T06n0220_298:0514c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T06n0220_298:0514c04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若於八解脫非住非不住、非習非不習，是為住習八解脫；若於八勝處、九次第定、十遍處非住非不住、非習非不習，是為住習八勝處、九次第定、十遍處。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of wisdom, if they neither abide nor don't abide in the eight liberations, and if they don't cultivate or don't cultivate them, this is called abiding in the cultivation of the eight liberations; if they neither abide nor don't abide in the eight abodes, nine graduated concentrations, nor ten universal abodes, this is called abiding in the cultivation of the eight abodes, nine graduated concentrations, and ten universal abodes.",
        "source": "T06n0220_298:0514c04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0514c08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_298:0514c08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩觀八解脫乃至十遍處前、後、中際不可得故。",
        "translation": "It's because the bodhisattva-mahāsattva's contemplation of the eight liberations and even the ten universal abodes can't be obtained before, after, or in the middle.",
        "source": "T06n0220_298:0514c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T06n0220_298:0514c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若於四念住非住非不住、非習非不習，是為住習四念住；若於四正斷、四神足、五根、五力、七等覺支、八聖道支非住非不住、非習非不習，是為住習四正斷乃至八聖道支。",
        "translation": "When a bodhisattva Mahāsattva practices the perfection of wisdom, if he doesn't abide or doesn't abide, and doesn't cultivate or doesn't cultivate the four abodes of mindfulness, this is called abiding and cultivating the four abodes of mindfulness; if he doesn't abide or doesn't abide, and doesn't cultivate or doesn't cultivate the five faculties, five powers, seven factors of virtual enlightenment, and eight noble factors of the path, this is called abiding and cultivating the four correct eliminations and even the eight noble factors of the path.",
        "source": "T06n0220_298:0514c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0514c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_298:0514c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩觀四念住乃至八聖道支前、後、中際不可得故。",
        "translation": "It's because the bodhisattva Mahāsattva observes that the four abodes of mindfulness and even the eightfold noble path are inapprehensible before, after, and in the middle.",
        "source": "T06n0220_298:0514c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T06n0220_298:0514c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若於空解脫門非住非不住、非習非不習，是為住習空解脫門；若於無相、無願解脫門非住非不住、非習非不習，是為住習無相、無願解脫門。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of wisdom, if they don't abide or don't abide at the liberation gate of emptiness and don't cultivate or don't cultivate it, this is the abiding cultivation of the liberation gate of emptiness; if they don't abide or don't abide at the liberation gate of signlessness and wishlessness and don't cultivate or don't cultivate it, this is the abiding cultivation of the liberation gate of signlessness and wishlessness.",
        "source": "T06n0220_298:0514c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0514c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_298:0514c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩觀空解脫門、無相、無願解脫門前、後、中際不可得故。",
        "translation": "It's because the bodhisattva Mahāsattva observes that the liberation gate of emptiness and the liberation gate of signlessness and wishlessness are inapprehensible before, after, and in the middle.",
        "source": "T06n0220_298:0514c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T06n0220_298:0514c22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若於菩薩十地非住非不住、非習非不習，是為住習菩薩十地。",
        "translation": "When a bodhisattva Mahāsattva practices the perfection of wisdom, if he doesn't abide or doesn't abide in the ten bodhisattva stages and doesn't cultivate or doesn't cultivate them, this is called abiding and cultivating the ten bodhisattva stages.",
        "source": "T06n0220_298:0514c22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0514c25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_298:0514c25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩觀菩薩十地前、後、中際不可得故。",
        "translation": "It's because the bodhisattvas, mahāsattvas, and bodhisattvas observe that the prior, subsequent, and middle portions of the ten stages are inapprehensible.",
        "source": "T06n0220_298:0514c25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T06n0220_298:0514c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若於五眼非住非不住、非習非不習，是為住習五眼；若於六神通非住非不住、非習非不習，是為住習六神通。",
        "translation": "When a bodhisattva Mahāsattva practices the perfection of wisdom, if he doesn't abide and doesn't abide in the five eyes and doesn't cultivate and doesn't cultivate them, this is called abiding and cultivating the five eyes; if he doesn't abide and doesn't abide in the six supernormal powers and doesn't cultivate and doesn't cultivate them, this is called abiding and cultivating the six supernormal powers.",
        "source": "T06n0220_298:0514c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0515a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_298:0515a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩觀五眼、六神通前、後、中際不可得故。",
        "translation": "It's because the bodhisattva Mahāsattva observes that the five eyes and the six supernormal powers are unobtainable before, after, and in the middle.",
        "source": "T06n0220_298:0515a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T06n0220_298:0515a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若於佛十力非住非不住、非習非不習，是為住習佛十力；若於四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法非住非不住、非習非不習，是為住習四無所畏乃至十八佛不共法。",
        "translation": "When a bodhisattva Mahāsattva practices the perfection of wisdom, if he doesn't abide or doesn't abide in the Buddha's ten powers and doesn't cultivate or doesn't cultivate them, this is called abiding in the cultivation of the Buddha's ten powers; if he doesn't abide or doesn't abide in the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and the 18 Buddha-uncommon dharmas, this is called abiding in the cultivation of the four fearlessnesses and even the 18 Buddha-uncommon dharmas.",
        "source": "T06n0220_298:0515a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0515a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_298:0515a08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩觀佛十力乃至十八佛不共法前、後、中際不可得故。",
        "translation": "It's because the bodhisattva Mahāsattva observes the Buddha's ten powers and even the 18 buddha-uncommon dharmas as being unobtainable before, after, and in the middle.",
        "source": "T06n0220_298:0515a08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T06n0220_298:0515a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若於無忘失法非住非不住、非習非不習，是為住習無忘失法；若於恒住捨性非住非不住、非習非不習，是為住習恒住捨性。",
        "translation": "When a bodhisattva Mahāsattva practices the perfection of wisdom, if he doesn't abide or doesn't abide in the state of nonforgetfulness and doesn't cultivate it or doesn't cultivate it, this is called abiding and cultivating the state of nonforgetfulness; if he doesn't abide or doesn't abide in the nature of equanimity and doesn't cultivate it or doesn't cultivate it, this is called abiding and cultivating the nature of equanimity.",
        "source": "T06n0220_298:0515a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0515a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_298:0515a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩觀無忘失法、恒住捨性前、後、中際不可得故。",
        "translation": "It's because the bodhisattva Mahāsattva observes the principle of no forgetfulness and constantly abides in equanimity before, after, and in the middle, which is inapprehensible.",
        "source": "T06n0220_298:0515a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T06n0220_298:0515a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若於一切智非住非不住、非習非不習，是為住習一切智；若於道相智、一切相智非住非不住、非習非不習，是為住習道相智、一切相智。",
        "translation": "When a bodhisattva Mahāsattva practices the perfection of wisdom, if he doesn't abide or doesn't abide in omniscience and doesn't cultivate or doesn't cultivate it, this is abiding and cultivating omniscience; if he doesn't abide or doesn't abide in knowledge of the way and knowledge of all characteristics and doesn't cultivate or doesn't cultivate them, this is abiding and cultivating knowledge of the way and knowledge of all characteristics.",
        "source": "T06n0220_298:0515a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0515a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_298:0515a19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩觀一切智、道相智、一切相智前、後、中際不可得故。",
        "translation": "This is the bodhisattva-mahāsattva's observation that omniscience, knowledge of the path, and knowledge of all characteristics are unknowable before, after, and in the middle.",
        "source": "T06n0220_298:0515a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T06n0220_298:0515a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若於一切陀羅尼門非住非不住、非習非不習，是為住習一切陀羅尼門；若於一切三摩地門非住非不住、非習非不習，是為住習一切三摩地門。",
        "translation": "When a bodhisattva Mahāsattva practices the perfection of wisdom, if he doesn't abide or doesn't abide at all the dhāraṇī entries and doesn't cultivate or doesn't cultivate them, this is abiding and cultivating all the dhāraṇī entries; if he doesn't abide or doesn't abide at all the concentration approaches and doesn't cultivate or doesn't cultivate them, this is abiding and cultivating all the concentration approaches.",
        "source": "T06n0220_298:0515a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0515a25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_298:0515a25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩觀一切陀羅尼門、一切三摩地門前、後、中際不可得故。",
        "translation": "It's because the bodhisattva Mahāsattva observes that all dhāraṇī gates and all samādhi gates are unobtainable before, after, and in the middle.",
        "source": "T06n0220_298:0515a25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T06n0220_298:0515a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若於預流果非住非不住、非習非不習，是為住習預流果；若於一來、不還、阿羅漢果非住非不住、非習非不習，是為住習一來、不還、阿羅漢果。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of wisdom, if they don't abide and don't abide in the fruit of stream-winner, and don't cultivate and don't cultivate it, this is the abiding and cultivation of the fruit of stream-winner; if they don't abide and don't abide in the fruit of once-returning, nonreturning, or arhatship, and don't cultivate and don't cultivate it, this is the abiding and cultivation of the fruit of once-returning, nonreturning, or arhatship.",
        "source": "T06n0220_298:0515a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0515b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_298:0515b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩觀預流果、一來、不還、阿羅漢果前、後、中際不可得故。",
        "translation": "It's because the bodhisattva Mahāsattva observes that the pre-flow fruit, the first coming, the nonreturner, and the middle reaches of the arhatship are inaccessible before, after, and during the fruit.",
        "source": "T06n0220_298:0515b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T06n0220_298:0515b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若於獨覺菩提非住非不住、非習非不習，是為住習獨覺菩提。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of wisdom, if they neither abide nor don't abide in the solitary realizer bodhi and don't cultivate or don't cultivate it, this is the solitary realizer bodhi that's abided in and cultivated.",
        "source": "T06n0220_298:0515b05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0515b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_298:0515b07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩觀獨覺菩提前、後、中際不可得故。",
        "translation": "It's because the bodhisattva Mahāsattva observes that the prior, final, and intermediate limits of the solitary realizer's enlightenment are unobtainable.",
        "source": "T06n0220_298:0515b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T06n0220_298:0515b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若於一切菩薩摩訶薩行非住非不住、非習非不習，是為住習一切菩薩摩訶薩行。",
        "translation": "When a bodhisattva-mahāsattva practices prajñāpāramitā, if he doesn't abide or doesn't abide in all bodhisattva-mahāsattva practices and doesn't cultivate or doesn't cultivate them, this is abiding and cultivating all bodhisattva-mahāsattva practices.",
        "source": "T06n0220_298:0515b09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0515b11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_298:0515b11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩觀一切菩薩摩訶薩行前、後、中際不可得故。",
        "translation": "It's because the bodhisattva-mahāsattva observes that the prior, subsequent, and middle portions of all bodhisattva-mahāsattva practices are unobtainable.",
        "source": "T06n0220_298:0515b12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "\"Kauśika!",
        "source": "T06n0220_298:0515b13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若於諸佛無上正等菩提非住非不住、非習非不習，是為住習諸佛無上正等菩提。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of wisdom, if they don't abide and don't abide in the unsurpassed correct enlightenment of the buddhas and don't cultivate and don't cultivate it, this is the abiding and cultivation of the unsurpassed correct enlightenment of the buddhas.",
        "source": "T06n0220_298:0515b13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0515b16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_298:0515b16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩觀諸佛無上正等菩提前、後、中際不可得故。」",
        "translation": "This is because the bodhisattvas, mahāsattvas, observe that the first, last, and middle portions of the buddhas' unsurpassed correct enlightenment are unobtainable.\"",
        "source": "T06n0220_298:0515b16_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，舍利子白佛言：「世尊！",
        "translation": "It was then that Śāriputra said to the Buddha, \"Bhagavān!",
        "source": "T06n0220_298:0515b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是般若波羅蜜多最為甚深。」",
        "translation": "Thus, the perfection of wisdom is most profound.\"",
        "source": "T06n0220_298:0515b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, \"So it is!",
        "source": "T06n0220_298:0515b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0515b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色真如甚深故般若波羅蜜多甚深，受、想、行、識真如甚深故般若波羅蜜多甚深。",
        "translation": "The true nature of form is profound, so the prajñāpāramitā is profound, and the true nature of feeling, perception, volition, and consciousness is profound, so the prajñāpāramitā is profound.",
        "source": "T06n0220_298:0515b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0515b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼處真如甚深故般若波羅蜜多甚深，耳、鼻、舌、身、意處真如甚深故般若波羅蜜多甚深。",
        "translation": "The profundity of true thusness in the eye makes the prajñāpāramitā profound, and the profundity of true thusness in the ear, nose, tongue, body, and mind makes the prajñpāramitā profound.",
        "source": "T06n0220_298:0515b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0515b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色處真如甚深故般若波羅蜜多甚深，聲、香、味、觸、法處真如甚深故般若波羅蜜多甚深。",
        "translation": "The truly profound nature of the form realm makes the prajñāpāramitā profound, and the truly profound nature of the sound, smell, taste, touch, and dharma realms make the prajñāpāramitā profound.",
        "source": "T06n0220_298:0515b23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0515b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼界真如甚深故般若波羅蜜多甚深，色界、眼識界及眼觸、眼觸為緣所生諸受真如甚深故般若波羅蜜多甚深。",
        "translation": "The truly profound nature of the visual realm makes the prajñāpāramitā profound, and the truly profound nature of the form realm, the visual consciousness realm, and the sensations that arise from visual contact and visual contact as conditions make the prajñāpāramitā profound.",
        "source": "T06n0220_298:0515b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0515b28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳界真如甚深故般若波羅蜜多甚深，聲界、耳識界及耳觸、耳觸為緣所生諸受真如甚深故般若波羅蜜多甚深。",
        "translation": "The profundity of the ear realm makes the prajñāpāramitā profound, and the profundity of the sound realm, the ear-consciousness realm, and the sensations that arise from ear contact and ear contact are the causes of the profundity of the prajñāpāramitā.",
        "source": "T06n0220_298:0515b28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0515c02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼻界真如甚深故般若波羅蜜多甚深，香界、鼻識界及鼻觸、鼻觸為緣所生諸受真如甚深故般若波羅蜜多甚深。",
        "translation": "The prajñāpāramitā is profound because the nasal realm is truly profound, and the sensations that arise from the sense-fields of fragrance and nasal consciousness and from nasal contact and nasal contact are truly profound because the prajñāpāramitā is profound.",
        "source": "T06n0220_298:0515c02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0515c05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舌界真如甚深故般若波羅蜜多甚深，味界、舌識界及舌觸、舌觸為緣所生諸受真如甚深故般若波羅蜜多甚深。",
        "translation": "The prajñāpāramitā is profound because the true nature of the tongue realm is profound, and the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact are profound because the true nature of the prajñāpāramitā is profound.",
        "source": "T06n0220_298:0515c05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0515c07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身界真如甚深故般若波羅蜜多甚深，觸界、身識界及身觸、身觸為緣所生諸受真如甚深故般若波羅蜜多甚深。",
        "translation": "The body realm is profound because it's truly profound, and the touch realm, the body-consciousness realm, and the sensations that arise from body contact and body contact are profound because they're truly profound.",
        "source": "T06n0220_298:0515c08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0515c10_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意界真如甚深故般若波羅蜜多甚深，法界、意識界及意觸、意觸為緣所生諸受真如甚深故般若波羅蜜多甚深。",
        "translation": "The mind realm is truly profound because the prajñāpāramitā is profound, and the Dharma realm, the consciousness realm, and the sensations that arise from contact and contact of the mind are truly profound because the prajñāpāramitā is profound.",
        "source": "T06n0220_298:0515c10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0515c13_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界真如甚深故般若波羅蜜多甚深，水、火、風、空、識界真如甚深故般若波羅蜜多甚深。",
        "translation": "The true nature of the earth realm is profound, so the prajñāpāramitā is profound, and the true nature of the water, fire, air, space, and consciousness realms is profound, so the prajñāpāramitā is profound.",
        "source": "T06n0220_298:0515c13_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0515c15_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明真如甚深故般若波羅蜜多甚深，行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱真如甚深故般若波羅蜜多甚深。",
        "translation": "The true nature of nescience is profound, so the prajñāpāramitā is profound, and the true nature of formations, consciousness, name-and-form, the six sense-fields, touch, feeling, craving, grasping, existence, birth, old age and death, sorrow, suffering, grief, and vexation is profound, so the prajñāpāramitā is profound.",
        "source": "T06n0220_298:0515c15_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0515c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多真如甚深故般若波羅蜜多甚深，淨戒、安忍、精進、靜慮、般若波羅蜜多真如甚深故般若波羅蜜多甚深。",
        "translation": "The truly profound nature of the perfection of generosity makes the perfection of wisdom profound, and the truly profound nature of pure morality, patience, effort, meditation, and the perfection of wisdom makes the perfection of wisdom profound.",
        "source": "T06n0220_298:0515c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0515c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空真如甚深故般若波羅蜜多甚深，外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空真如甚深故般若波羅蜜多甚深。",
        "translation": "The true profundity of internal emptiness makes the prajñāpāramitā profound, and the true profundity of external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all things, inaccessible emptiness, emptiness without nature, emptiness of self-nature, emptiness of self-nature, and emptiness of natureless self-nature makes the prajñāpāramitā profound.",
        "source": "T06n0220_298:0515c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0515c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如真如甚深故般若波羅蜜多甚深，法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界真如甚深故般若波羅蜜多甚深。",
        "translation": "\"Because true thusness and trueness are profound, the perfection of wisdom is profound, and because the Dharma realm, Dharma nature, non-falsity, unchanging nature, equality, freedom from birth, legal status, Dharma abiding, reality, the space realm, and the inconceivable realm are truly profound, the perfection of wisdom is profound.",
        "source": "T06n0220_298:0515c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦聖諦真如甚深故般若波羅蜜多甚深，集、滅、道聖諦真如甚深故般若波羅蜜多甚深。",
        "translation": "Because the true nature of the noble truth of suffering is profound, the prajñāpāramitā is profound, and because the true nature of the noble truths of arising, ceasing, and the path is profound, the prajñāpāramitā is profound.",
        "source": "T06n0220_298:0516a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮真如甚深故般若波羅蜜多甚深，四無量、四無色定真如甚深故般若波羅蜜多甚深。",
        "translation": "The true nature of the four meditations is profound, so the prajñāpāramitā is profound, and the true nature of the four immeasurable and four formless concentrations is profound, so the prajñāpāramitā is profound.",
        "source": "T06n0220_298:0516a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫真如甚深故般若波羅蜜多甚深，八勝處、九次第定、十遍處真如甚深故般若波羅蜜多甚深。",
        "translation": "The true nature of the eight liberations is profound, so the prajñāpāramitā is profound, and the true nature of the eight abodes, nine graduated concentrations, and ten universal abodes is profound, so the prajñāpāramitā is profound.",
        "source": "T06n0220_298:0516a06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516a08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念住真如甚深故般若波羅蜜多甚深，四正斷、四神足、五根、五力、七等覺支、八聖道支真如甚深故般若波羅蜜多甚深。",
        "translation": "The profundity of the four abodes of mindfulness makes the prajñāpāramitā profound, and the profundity of the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path make the prajñāpāramitā profound.",
        "source": "T06n0220_298:0516a08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516a11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空解脫門真如甚深故般若波羅蜜多甚深，無相、無願解脫門真如甚深故般若波羅蜜多甚深。",
        "translation": "The profundity of the liberation gate of emptiness makes the prajñāpāramitā profound, and the profundity of the liberation gate of signlessness and wishlessness makes the prajñpāramitā profound.",
        "source": "T06n0220_298:0516a11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516a13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩十地真如甚深故般若波羅蜜多甚深。",
        "translation": "Because the bodhisattvas' ten stages of true thusness are so profound, the prajñāpāramitā is profound.",
        "source": "T06n0220_298:0516a13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516a14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眼真如甚深故般若波羅蜜多甚深，六神通真如甚深故般若波羅蜜多甚深。",
        "translation": "The true nature of the five eyes is profound, so the prajñāpāramitā is profound, and the true nature of the six supernormal powers is profound, so the prajñāpāramitā is profound.",
        "source": "T06n0220_298:0516a15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516a16_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛十力真如甚深故般若波羅蜜多甚深，四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法真如甚深故般若波羅蜜多甚深。",
        "translation": "The Buddha's ten powers are truly profound, so the prajñāpāramitā is profound, and the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and the eighteen distinctive characteristics of the Buddha are truly profound, so the prajñāpāramitā is profound.",
        "source": "T06n0220_298:0516a17_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516a19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無忘失法真如甚深故般若波羅蜜多甚深，恒住捨性真如甚深故般若波羅蜜多甚深。",
        "translation": "The true nature of the Dharma of no forgetfulness is profound, so the prajñāpāramitā is profound, and the true nature of constantly abiding equanimity is profound, so the prajñāpāramitā is profound.",
        "source": "T06n0220_298:0516a20_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516a22_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智真如甚深故般若波羅蜜多甚深，道相智、一切相智真如甚深故般若波羅蜜多甚深。",
        "translation": "The truly profound nature of omniscience makes the prajñāpāramitā very profound, and the truly profound nature of knowledge of the path and omniscience makes the prajñpāramitā very profound.",
        "source": "T06n0220_298:0516a22_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516a24_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切陀羅尼門真如甚深故般若波羅蜜多甚深，一切三摩地門真如甚深故般若波羅蜜多甚深。",
        "translation": "The dhāraṇī aspect of all things is truly profound, so the prajñāpāramitā is profound, and the samādhi aspect of all things is truly profound, so the prajñāpāramitā is profound.",
        "source": "T06n0220_298:0516a24_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "預流果真如甚深故般若波羅蜜多甚深，一來、不還、阿羅漢果真如甚深故般若波羅蜜多甚深。",
        "translation": "The fruit of stream-enterer is truly profound, so the perfection of wisdom is profound, and the fruit of once-returner, nonreturner, and arhat is truly profound, so the perfection of wisdom is profound.",
        "source": "T06n0220_298:0516a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獨覺菩提真如甚深故般若波羅蜜多甚深。",
        "translation": "Because the true nature of pratyekabuddha enlightenment is so profound, the perfection of wisdom is so profound.",
        "source": "T06n0220_298:0516a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切菩薩摩訶薩行真如甚深故般若波羅蜜多甚深。",
        "translation": "Because the practice of true thusness by all bodhisattvas and mahāsattvas is so profound, the perfection of wisdom is profound.",
        "source": "T06n0220_298:0516b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛無上正等菩提真如甚深故般若波羅蜜多甚深。」",
        "translation": "The true truth of the buddhas' unsurpassed perfect enlightenment is so profound that the prajñāpāramitā is profound.\"",
        "source": "T06n0220_298:0516b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利子復白佛言：「世尊！",
        "translation": "Śāriputra then again said to the Buddha, \"Bhagavān!",
        "source": "T06n0220_298:0516b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是般若波羅蜜多難可測量。」",
        "translation": "Thus, the perfection of wisdom is difficult to fathom.\"",
        "source": "T06n0220_298:0516b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, \"So it is!",
        "source": "T06n0220_298:0516b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0516b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色真如難測量故般若波羅蜜多難可測量，受、想、行、識真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of form is difficult to measure, the perfection of wisdom is difficult to measure, and because the true nature of feeling, perception, volition, and consciousness are difficult to measure, the perfection of wisdom is difficult to measure.",
        "source": "T06n0220_298:0516b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼處真如難測量故般若波羅蜜多難可測量，耳、鼻、舌、身、意處真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because it's difficult to measure the true nature of the eye, the prajñā-pāramitā is difficult to measure, and because it's difficult to measure the true nature of the ear, nose, tongue, body, and mind, the prajñā-pāramitā is difficult to measure.",
        "source": "T06n0220_298:0516b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516b11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色處真如難測量故般若波羅蜜多難可測量，聲、香、味、觸、法處真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because it's difficult to measure the true nature of the form realm, the perfection of wisdom is difficult to measure, and because it's difficult to measure the true nature of the sense, smell, taste, touch, and dharma realms, the perfection of wisdom is difficult to measure.",
        "source": "T06n0220_298:0516b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼界真如難測量故般若波羅蜜多難可測量，色界、眼識界及眼觸、眼觸為緣所生諸受真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of the visual realm is difficult to measure, the prajñā-pāramitā is difficult to measure, and because the true nature of the form realm, the visual consciousness realm, and the sensations that arise from eye contact and eye contact as a condition are difficult to measure, the prajñā-pāramitā is difficult to measure.",
        "source": "T06n0220_298:0516b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳界真如難測量故般若波羅蜜多難可測量，聲界、耳識界及耳觸、耳觸為緣所生諸受真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of the ear realm is difficult to measure, the prajñāpāramitā is difficult to measure, and because the true nature of the sound realm, the ear-consciousness realm, and the sensations that arise from ear contact and ear contact are difficult to measure, the prajñāpāramitā is difficult to measure.",
        "source": "T06n0220_298:0516b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼻界真如難測量故般若波羅蜜多難可測量，香界、鼻識界及鼻觸、鼻觸為緣所生諸受真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of the nasal realm is difficult to measure, the prajñāpāramitā is difficult to measure, and because the true nature of the sense-perceptions that arise from the sense-perceptions of odor, nasal consciousness, and nasal contact and nasal contact are difficult to measure, the prajñpāramitā is difficult to measure.",
        "source": "T06n0220_298:0516b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舌界真如難測量故般若波羅蜜多難可測量，味界、舌識界及舌觸、舌觸為緣所生諸受真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of the tongue realm is difficult to measure, the prajñāpāramitā is difficult to measure, and because the true nature of the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact are difficult to measure, the prajñāpāramitā is difficult to measure.",
        "source": "T06n0220_298:0516b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身界真如難測量故般若波羅蜜多難可測量，觸界、身識界及身觸、身觸為緣所生諸受真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of the body realm is difficult to measure, the prajñāpāramitā is difficult to measure, and because the true nature of the contact realm, the body-consciousness realm, and the sensations that arise from body contact and body contact as a condition are difficult to measure, the prajñāpāramitā is difficult to measure.",
        "source": "T06n0220_298:0516b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516b29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意界真如難測量故般若波羅蜜多難可測量，法界、意識界及意觸、意觸為緣所生諸受真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of the mental realm is difficult to measure, the prajñāpāramitā is difficult to measure, and because the true nature of the Dharma realm, the consciousness realm, and the sensations that arise from contact and contact of the mind as a condition are difficult to measure, the prajñapāramitā is difficult to measure.",
        "source": "T06n0220_298:0516b29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516c03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界真如難測量故般若波羅蜜多難可測量，水、火、風、空、識界真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of the earth realm is difficult to measure, the perfection of wisdom is difficult to measure, and because the true nature of the water, fire, wind, air, and consciousness realms are difficult to measure, the perfection of wisdom is difficult to measure.",
        "source": "T06n0220_298:0516c03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516c05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明真如難測量故般若波羅蜜多難可測量，行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of nescience is difficult to measure, the perfection of wisdom is difficult to measure, and because the true nature of form, consciousness, name-and-form, the six sense-fields, touch, feeling, love, apprehension, existence, birth, old age, death, sorrow, suffering, and grief is difficult to fathom, the perfection of wisdom is difficult to measure.",
        "source": "T06n0220_298:0516c06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多真如難測量故般若波羅蜜多難可測量，淨戒、安忍、精進、靜慮、般若波羅蜜多真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of the perfection of generosity is difficult to measure, the perfection of wisdom is difficult to measure, and because the true nature of pure morality, patience, effort, meditation, and the perfection of wisdom is difficult to measure, the perfection of wisdom is difficult to measure.",
        "source": "T06n0220_298:0516c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空真如難測量故般若波羅蜜多難可測量，外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because it's difficult to measure the true nature of internal emptiness, the perfection of wisdom is difficult to measure; because it's difficult to measure the true nature of external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-identity, emptiness of shared characteristics, emptiness of all things, inaccessible emptiness, emptiness without nature, emptiness of self-nature, and emptiness of self-nature, the perfection of wisdom is difficult to measure.",
        "source": "T06n0220_298:0516c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如真如難測量故般若波羅蜜多難可測量，法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because it's difficult to measure the true nature of true thusness, the perfection of wisdom is difficult to measure, and because it's difficult to measure the true nature of the Dharma realm, Dharma nature, non-falsity, unchanging difference, equality, freedom from birth, legality, Dharma abiding, reality, the space realm, and the inconceivable realm, the perfection of wisdom is difficult to measure.",
        "source": "T06n0220_298:0516c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦聖諦真如難測量故般若波羅蜜多難可測量，集、滅、道聖諦真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of the noble truth of suffering is difficult to measure, the perfection of wisdom is difficult to measure, and because the true nature of the noble truths of arising, ceasing, and the path is difficult to measure, the perfection of wisdom is difficult to measure.",
        "source": "T06n0220_298:0516c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮真如難測量故般若波羅蜜多難可測量，四無量、四無色定真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of the four meditations is difficult to measure, the perfection of wisdom is difficult to measure, and because the true nature of the four immeasurable and four formless concentrations is difficult to measure, the perfection of wisdom is difficult to measure.",
        "source": "T06n0220_298:0516c24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫真如難測量故般若波羅蜜多難可測量，八勝處、九次第定、十遍處真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of the eight liberations is difficult to measure, the prajñāpāramitā is difficult to measure, and because the true nature of the eight abodes, nine graduated concentrations, and ten universal abodes is difficult to measure, the prajñpāramitā is difficult to measure.",
        "source": "T06n0220_298:0516c26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0516c29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念住真如難測量故般若波羅蜜多難可測量，四正斷、四神足、五根、五力、七等覺支、八聖道支真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of the four bases of mindfulness is difficult to measure, the perfection of wisdom is difficult to measure, and because the true nature of the four correct eliminations, four miraculous powers, five faculties, five powers, seven factors of virtual enlightenment, and eight noble factors of the path are difficult to measure, the perfection of wisdom is difficult to measure.",
        "source": "T06n0220_298:0516c29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517a03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空解脫門真如難測量故般若波羅蜜多難可測量，無相、無願解脫門真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of the liberation gate of emptiness is difficult to measure, the perfection of wisdom is difficult to measure, and because the true nature of the liberation gate of signlessness and wishlessness is difficult to measure, the perfection of wisdom is difficult to measure.",
        "source": "T06n0220_298:0517a03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517a06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩十地真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the bodhisattvas' ten stages of true thusness are difficult to measure, the perfection of wisdom is difficult to measure.",
        "source": "T06n0220_298:0517a06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眼真如難測量故般若波羅蜜多難可測量，六神通真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of the five eyes is difficult to measure, the perfection of wisdom is difficult to measure, and because the true nature of the six supernormal powers is difficult to measure, the perfection of wisdom is difficult to measure.",
        "source": "T06n0220_298:0517a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛十力真如難測量故般若波羅蜜多難可測量，四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the Buddha's ten powers are truly difficult to measure, the perfection of wisdom is difficult to measure, and because the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and the true nature of the 18 Buddha-principles are difficult to measure, the perfection of wisdom is difficult to measure.",
        "source": "T06n0220_298:0517a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無忘失法真如難測量故般若波羅蜜多難可測量，恒住捨性真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of the Dharma of no forgetfulness is difficult to measure, the perfection of wisdom is difficult to measure, and because the true nature of constancy and equanimity is difficult to measure, the perfection of wisdom is difficult to measure.",
        "source": "T06n0220_298:0517a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智真如難測量故般若波羅蜜多難可測量，道相智、一切相智真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of omniscience is difficult to fathom, the perfection of wisdom is difficult to fathom, and because the true nature of knowledge of the path and omniscience is difficult to fathom, the perfection of wisdom is difficult to fathom.",
        "source": "T06n0220_298:0517a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切陀羅尼門真如難測量故般若波羅蜜多難可測量，一切三摩地門真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because it's difficult to measure the true nature of all dhāraṇī gates, the perfection of wisdom is difficult to measure, and because it's difficult to measure the true nature of all samādhi gates, the perfection of wisdom is difficult to measure.",
        "source": "T06n0220_298:0517a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "預流果真如難測量故般若波羅蜜多難可測量，一來、不還、阿羅漢果真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of the fruit of stream-winner is difficult to measure, the perfection of wisdom is difficult to measure, and because the true nature of the fruit of once-returner, nonreturner, and arhat is difficult to measure, the perfection of wisdom is difficult to measure.",
        "source": "T06n0220_298:0517a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獨覺菩提真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of pratyekabuddha enlightenment is difficult to measure, the perfection of wisdom is difficult to measure.",
        "source": "T06n0220_298:0517a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切菩薩摩訶薩行真如難測量故般若波羅蜜多難可測量。",
        "translation": "Because the true nature of all bodhisattva-mahāsattva practices is difficult to measure, the perfection of wisdom is difficult to measure.",
        "source": "T06n0220_298:0517a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛無上正等菩提真如難測量故般若波羅蜜多難可測量。」",
        "translation": "Because the true nature of the buddhas' unsurpassed perfect enlightenment is difficult to measure, the perfection of wisdom is difficult to measure.\"",
        "source": "T06n0220_298:0517a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時，舍利子復白佛言：「世尊！",
        "translation": "Śāriputra then again said to the Buddha, \"Bhagavān!",
        "source": "T06n0220_298:0517b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是般若波羅蜜多最為無量。」",
        "translation": "Thus, the perfection of wisdom is immeasurable.\"",
        "source": "T06n0220_298:0517b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, \"So it is!",
        "source": "T06n0220_298:0517b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0517b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色真如無量故般若波羅蜜多無量，受、想、行、識真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of form is immeasurable, the number of prajñāpāramitās is immeasurable, and because the true nature of feeling, perception, volition, and consciousness is immeasurable, the number of prajñāpāramitās is immeasurable.",
        "source": "T06n0220_298:0517b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼處真如無量故般若波羅蜜多無量，耳、鼻、舌、身、意處真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of the eye is immeasurable, the number of prajñāpāramitās is immeasurable, and because the true nature of the ear, nose, tongue, body, and mind are immeasurable, the number of prajñāpāramitās is immeasurable.",
        "source": "T06n0220_298:0517b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517b06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色處真如無量故般若波羅蜜多無量，聲、香、味、觸、法處真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of the form realm is immeasurable, the number of prajñāpāramitās is immeasurable, and because the true nature of the sound, smell, taste, touch, and dharma realms is immeasurable, the number of prajñāpāramitās is immeasurable.",
        "source": "T06n0220_298:0517b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517b08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼界真如無量故般若波羅蜜多無量，色界、眼識界及眼觸、眼觸為緣所生諸受真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of the visual realm is immeasurable, the prajñāpāramitā is immeasurable, and because the form realm, the visual consciousness realm, and the sensations that arise from eye contact and eye contact are truly immeasurable, the prajñpāramitā is immeasurable.",
        "source": "T06n0220_298:0517b09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517b11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳界真如無量故般若波羅蜜多無量，聲界、耳識界及耳觸、耳觸為緣所生諸受真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of the ear realm is immeasurable, the prajñāpāramitā is immeasurable, and because the true nature of the sound realm, the ear-consciousness realm, and the sensations that arise from ear contact and ear contact are immeasurable, the prajñpāramitā is immeasurable.",
        "source": "T06n0220_298:0517b11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517b14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼻界真如無量故般若波羅蜜多無量，香界、鼻識界及鼻觸、鼻觸為緣所生諸受真如無量故般若波羅蜜多無量。",
        "translation": "Because the nasal realm's true nature is immeasurable, the prajñāpāramitā is immeasurable, and because the fragrance realm, the nasal consciousness realm, and the sensations that arise from nasal contact and nasal contact are truly immeasurable, the prajñāpāramitā is immeasurable.",
        "source": "T06n0220_298:0517b14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517b17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舌界真如無量故般若波羅蜜多無量，味界、舌識界及舌觸、舌觸為緣所生諸受真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of the tongue realm is immeasurable, the prajñāpāramitā is immeasurable, and because the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact are truly immeasurable, the prajñpāramitā is immeasurable.",
        "source": "T06n0220_298:0517b17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517b19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身界真如無量故般若波羅蜜多無量，觸界、身識界及身觸、身觸為緣所生諸受真如無量故般若波羅蜜多無量。",
        "translation": "Because the body realm's true nature is immeasurable, the prajñāpāramitā is immeasurable, and because the tactile and body-consciousness realms and the sensations that arise from bodily contact and body contact are truly immeasurable, the prajñpāramitā is immeasurable.",
        "source": "T06n0220_298:0517b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意界真如無量故般若波羅蜜多無量，法界、意識界及意觸、意觸為緣所生諸受真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of the mental realm is immeasurable, the prajñāpāramitā is immeasurable, and because the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact are truly immeasurable, the prajñapāramitā is immeasurable.",
        "source": "T06n0220_298:0517b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界真如無量故般若波羅蜜多無量，水、火、風、空、識界真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of the earth realm is immeasurable, the prajñāpāramitā is immeasurable, and because the true nature of the water, fire, wind, air, and consciousness realms is immeasurable, the prajñāpāramitā is immeasurable.",
        "source": "T06n0220_298:0517b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明真如無量故般若波羅蜜多無量，行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of nescience is limitless, the number of prajñāpāramitās is limitless, and because the formations, consciousnesses, name-and-form, the six sense-fields, touch, feeling, craving, grasping, existence, birth, old age, death, sorrow, suffering, grief, and vexation are truly limitless, the number of prajñāpāramitās is limitless.",
        "source": "T06n0220_298:0517b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多真如無量故般若波羅蜜多無量，淨戒、安忍、精進、靜慮、般若波羅蜜多真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of the perfection of generosity is immeasurable, the perfection of wisdom is immeasurable, and because the true nature of pure morality, patience, effort, meditation, and the perfection of wisdom is immeasurable, the perfection of wisdom is immeasurable.",
        "source": "T06n0220_298:0517c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空真如無量故般若波羅蜜多無量，外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of internal emptiness is immeasurable, the prajñāpāramitā is immeasurable; because the true nature of external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all things, inaccessible emptiness, emptiness without nature, emptiness of self-nature, and emptiness of self-nature are immeasurable, the prajñapāramitā is immeasurable.",
        "source": "T06n0220_298:0517c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如真如無量故般若波羅蜜多無量，法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界真如無量故般若波羅蜜多無量。",
        "translation": "\"Because true thusness and trueness are limitless, the number of prajñāpāramitās is limitless, and because the Dharma realm, Dharma nature, non-falsity, unchanging nature, equality, freedom from birth, legal status, Dharma abiding, reality, the space realm, and the inconceivable realm are truly limitless, the number of prajñāpāramitās is limitless.",
        "source": "T06n0220_298:0517c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦聖諦真如無量故般若波羅蜜多無量，集、滅、道聖諦真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of the noble truth of suffering is immeasurable, the prajñāpāramitā is immeasurable, and because the true nature of the noble truths of arising, ceasing, and the path is immeasurable, the prajñāpāramitā is immeasurable.",
        "source": "T06n0220_298:0517c13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮真如無量故般若波羅蜜多無量，四無量、四無色定真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of the four meditations is immeasurable, the prajñā-pāramitā is immeasurable, and because the true nature of the four immeasurable and four formless concentrations is immeasurable, the prajñā-pāramitā is immeasurable.",
        "source": "T06n0220_298:0517c15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫真如無量故般若波羅蜜多無量，八勝處、九次第定、十遍處真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of the eight liberations is immeasurable, the number of prajñāpāramitās is immeasurable, and because the true nature of the eight abodes of excellence, nine graduated concentrations, and ten universal abodes is immeasurable, the number of prajñāpāramitās is immeasurable.",
        "source": "T06n0220_298:0517c18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517c20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念住真如無量故般若波羅蜜多無量，四正斷、四神足、五根、五力、七等覺支、八聖道支真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of the four bases of mindfulness is immeasurable, the number of prajñāpāramitās is immeasurable, and because the true nature of the four correct eliminations, four miraculous powers, five faculties, five powers, seven factors of virtual enlightenment, and eight noble factors of the path is immeasurable, the number of prajñpāramitās is immeasurable.",
        "source": "T06n0220_298:0517c20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517c23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空解脫門真如無量故般若波羅蜜多無量，無相、無願解脫門真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of the liberation gate of emptiness is immeasurable, the number of prajñāpāramitās is immeasurable, and because the true nature of the liberation gate of signlessness and wishlessness is immeasurable, the number of prajñapāramitās is immeasurable.",
        "source": "T06n0220_298:0517c23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517c25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩十地真如無量故般若波羅蜜多無量。",
        "translation": "Because the bodhisattvas' ten stages of true thusness are numberless, the number of prajñāpāramitās is numberless.",
        "source": "T06n0220_298:0517c25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眼真如無量故般若波羅蜜多無量，六神通真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of the five eyes is immeasurable, the number of prajñāpāramitās is immeasurable, and because the true nature of the six supernormal powers is immeasurable, the number of prajñāpāramitās is immeasurable.",
        "source": "T06n0220_298:0517c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0517c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛十力真如無量故般若波羅蜜多無量，四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法真如無量故般若波羅蜜多無量。",
        "translation": "Because the Buddha's ten powers are truly immeasurable, the number of prajñāpāramitās is immeasurable, and because the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and the eighteen distinctive characteristics of the Buddha are truly immeasurable, the number of prajñāpāramitās is immeasurable.",
        "source": "T06n0220_298:0517c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0518a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無忘失法真如無量故般若波羅蜜多無量，恒住捨性真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of the Dharma of no forgetfulness is immeasurable, the prajñāpāramitā is immeasurable, and because the true nature of eternally abiding equanimity is immeasurable, the prajñāpāramitā is immeasurable.",
        "source": "T06n0220_298:0518a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0518a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智真如無量故般若波羅蜜多無量，道相智、一切相智真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of omniscience is immeasurable, the number of prajñāpāramitās is immeasurable, and because the true nature of knowledge of the path and omniscience is immeasurable, the number of prajñāpāramitās is immeasurable.",
        "source": "T06n0220_298:0518a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0518a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切陀羅尼門真如無量故般若波羅蜜多無量，一切三摩地門真如無量故般若波羅蜜多無量。",
        "translation": "Because the genuineness of all dhāraṇī entries is immeasurable, the prajñāpāramitā is immeasurable, and because the genuineness of all samādhi entries is immeasurable, the prajñāpāramitā is immeasurable.",
        "source": "T06n0220_298:0518a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0518a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "預流果真如無量故般若波羅蜜多無量，一來、不還、阿羅漢果真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of the fruit of stream-winner is immeasurable, the number of prajñāpāramitās is immeasurable, and because the true nature of the fruit of once-returner, nonreturner, and arhat is immeasurable, the number of prajñapāramitās is immeasurable.",
        "source": "T06n0220_298:0518a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0518a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獨覺菩提真如無量故般若波羅蜜多無量。",
        "translation": "Because the true nature of pratyekabuddha enlightenment is immeasurable, the number of prajñāpāramitās is immeasurable.",
        "source": "T06n0220_298:0518a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0518a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切菩薩摩訶薩行真如無量故般若波羅蜜多無量。",
        "translation": "Because the practice of true thusness by all bodhisattvas and mahāsattvas is immeasurable, the number of prajñāpāramitās is immeasurable.",
        "source": "T06n0220_298:0518a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0518a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛無上正等菩提真如無量故般若波羅蜜多無量。」",
        "translation": "Because the true nature of the buddhas' unsurpassed correct enlightenment is immeasurable, the prajñāpāramitā is immeasurable.\"",
        "source": "T06n0220_298:0518a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，舍利子白佛言：「世尊！",
        "translation": "It was then that Śāriputra said to the Buddha, \"Bhagavān!",
        "source": "T06n0220_298:0518a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩行般若波羅蜜多？」",
        "translation": "How do bodhisattvas and mahāsattvas practice prajñāpāramitā?\"",
        "source": "T06n0220_298:0518a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「舍利子！",
        "translation": "The Buddha said, \"Śāriputra!",
        "source": "T06n0220_298:0518a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行色甚深性是行般若波羅蜜多，不行受、想、行、識甚深性是行般若波羅蜜多。",
        "translation": "\"When bodhisattvas and mahāsattvas practice prajñāpāramitā, not practicing the profundity of form is practicing prajñāpāramitā, and not practicing the profundity of feeling, perception, volition, and consciousness is practicing prajñāpāramitā.",
        "source": "T06n0220_298:0518a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0518a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0518a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色甚深性則非色，受、想、行、識甚深性則非受、想、行、識故。",
        "translation": "The profundity of form is then not form, and the profundity of feeling, perception, volition, and consciousness is then not feeling, perception, volition, or consciousness.",
        "source": "T06n0220_298:0518a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0518a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行眼處甚深性是行般若波羅蜜多，不行耳、鼻、舌、身、意處甚深性是行般若波羅蜜多。",
        "translation": "\"When a bodhisattva Mahāsattva practices prajñāpāramitā, he doesn't practice prajñāpāramitā without the profundity of the eye, and he doesn't practice prajñāpāramitā without the profundity of the ear, nose, tongue, body, and mind.",
        "source": "T06n0220_298:0518a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0518a26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0518a26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼處甚深性則非眼處，耳、鼻、舌、身、意處甚深性則非耳、鼻、舌、身、意處故。",
        "translation": "The profundity of the sense-field of the eye is not the sense-field of the eye, and the profundity of the sense-fields of the ear, nose, tongue, body, and mind is not the sense-fields of the ear, nose, tongue, body, and mind.",
        "source": "T06n0220_298:0518a26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0518a28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行色處甚深性是行般若波羅蜜多，不行聲、香、味、觸、法處甚深性是行般若波羅蜜多。",
        "translation": "\"When bodhisattvas and mahāsattvas practice prajñāpāramitā, not practicing the profundity of form is practicing prajñāpāramitā, and not practicing the profundity of sound, smell, taste, touch, and dharmas is practicing prajñāpāramitā.",
        "source": "T06n0220_298:0518a28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0518b02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0518b02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色處甚深性則非色處，聲、香、味、觸、法處甚深性則非聲、香、味、觸、法處故。",
        "translation": "The profundity of the form realm is not the form realm, and the profundity of the sense, smell, taste, touch, and dharma realms is not the sense, smell, taste, touch, or dharma realms.",
        "source": "T06n0220_298:0518b02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0518b04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行眼界甚深性是行般若波羅蜜多，不行色界、眼識界及眼觸、眼觸為緣所生諸受甚深性是行般若波羅蜜多。",
        "translation": "If a bodhisattva-mahāsattva practices prajñāpāramitā, not practicing the profundity of the eye realm is practicing prajñāpāramitā, and not practicing the profundity of the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as a condition is practicing prajñāpāramitā.",
        "source": "T06n0220_298:0518b04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0518b07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0518b07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼界甚深性則非眼界，色界乃至眼觸為緣所生諸受甚深性則非色界乃至眼觸為緣所生諸受故。",
        "translation": "The profundity of the visual realm is not the visual realm, and the profundity of the form realm and the sensations that arise from visual contact as a condition is not the form realm or the sensations that arise from visual contact as a condition.",
        "source": "T06n0220_298:0518b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0518b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行耳界甚深性是行般若波羅蜜多，不行聲界、耳識界及耳觸、耳觸為緣所生諸受甚深性是行般若波羅蜜多。",
        "translation": "\"When bodhisattvas and mahāsattvas practice prajñāpāramitā, not practicing the profundity of the ear realm is practicing prajñpāramitā, and not practicing the profundity of the sound realm, the ear consciousness realm, and the sensations that arise from ear contact and ear contact as a condition is practicing prajñpāramitā.",
        "source": "T06n0220_298:0518b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0518b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0518b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳界甚深性則非耳界，聲界乃至耳觸為緣所生諸受甚深性則非聲界乃至耳觸為緣所生諸受故。",
        "translation": "The profundity of the ear realm is not the ear realm, and the profundity of the sensations that arise from the sound realm or even from ear contact is not the sensations that arise from the sound realm or even from ear contact as a condition.",
        "source": "T06n0220_298:0518b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0518b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行鼻界甚深性是行般若波羅蜜多，不行香界、鼻識界及鼻觸、鼻觸為緣所生諸受甚深性是行般若波羅蜜多。",
        "translation": "\"When bodhisattvas and mahāsattvas practice prajñāpāramitā, not practicing the profundity of the nasal realm is practicing prajñpāramitā, and not practicing the profundity of the fragrance realm, the nasal consciousness realm, and the sensations that arise from nasal contact and nasal contact as a condition is practicing prajñpāramitā.",
        "source": "T06n0220_298:0518b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0518b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0518b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鼻界甚深性則非鼻界，香界乃至鼻觸為緣所生諸受甚深性則非香界乃至鼻觸為緣所生諸受故。",
        "translation": "The profundity of the nasal realm is not the nasal realm, and the profundity of the sensations that arise from the sense-fields and nasal contact is not the sense-fields and sensations that arise from the sense-fields and nasal contact.",
        "source": "T06n0220_298:0518b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0518b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行舌界甚深性是行般若波羅蜜多，不行味界、舌識界及舌觸、舌觸為緣所生諸受甚深性是行般若波羅蜜多。",
        "translation": "\"When bodhisattvas and mahāsattvas practice prajñāpāramitā, not practicing the profundity of the tongue realm is practicing prajñpāramitā, and not practicing the profundity of the taste realm, the tongue consciousness realm, and the sensations that arise from tongue contact and tongue contact as a condition is practicing prajñpāramitā.",
        "source": "T06n0220_298:0518b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0518b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0518b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舌界甚深性則非舌界，味界乃至舌觸為緣所生諸受甚深性則非味界乃至舌觸為緣所生諸受故。",
        "translation": "The profundity of the tongue realm is not the tongue realm, and the profundity of the taste realm and the sensations that arise from tongue contact is not the taste realm or the sensations that arise from tongue contact as a condition.",
        "source": "T06n0220_298:0518b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0518b28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行身界甚深性是行般若波羅蜜多，不行觸界、身識界及身觸、身觸為緣所生諸受甚深性是行般若波羅蜜多。",
        "translation": "\"When bodhisattvas and mahāsattvas practice prajñāpāramitā, not practicing the profundity of the body realm is practicing prajñpāramitā, and not practicing the profundity of the contact realm, the body-consciousness realm, and the sensations that arise from body contact and body contact as a condition is practicing prajñpāramitā.",
        "source": "T06n0220_298:0518b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0518c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0518c03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身界甚深性則非身界，觸界乃至身觸為緣所生諸受甚深性則非觸界乃至身觸為緣所生諸受故。",
        "translation": "\"The profundity of the body realm is not the body realm, and the profundity of contact realms and feelings that arise from the conditions of body contact are not contact realms or feelings that arise from the conditions of body contact.",
        "source": "T06n0220_298:0518c03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0518c06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行意界甚深性是行般若波羅蜜多，不行法界、意識界及意觸、意觸為緣所生諸受甚深性是行般若波羅蜜多。",
        "translation": "\"When bodhisattvas and mahāsattvas practice prajñāpāramitā, not practicing the profundity of the mind realm is practicing prajñpāramitā, and not practicing the profundity of the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as a condition is practicing prajñpāramitā.",
        "source": "T06n0220_298:0518c06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0518c09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0518c09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意界甚深性則非意界，法界乃至意觸為緣所生諸受甚深性則非法界乃至意觸為緣所生諸受故。",
        "translation": "The profundity of the mental realm is not the mental realm, and the profundity of the feelings that arise from the Dharma realm or even from mental contact as a condition is not the Dharma realm or the feelings that arise from mental contact as a condition.",
        "source": "T06n0220_298:0518c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0518c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行地界甚深性是行般若波羅蜜多，不行水、火、風、空、識界甚深性是行般若波羅蜜多。",
        "translation": "\"When a bodhisattva Mahāsattva practices prajñāpāramitā, not practicing the profundity of the earth realm is practicing prajñāpāramitā, and not practicing the profundity of the water, fire, wind, air, and consciousness realms is practicing prajñāpāramitā.",
        "source": "T06n0220_298:0518c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0518c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0518c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地界甚深性則非地界，水、火、風、空、識界甚深性則非水、火、風、空、識界故。",
        "translation": "The profundity of the earth realm is not the earth realm, and the profundity of the water, fire, air, space, and consciousness realms is not the water, fire, air, space, or consciousness realms.",
        "source": "T06n0220_298:0518c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0518c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行無明甚深性是行般若波羅蜜多，不行行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱甚深性是行般若波羅蜜多。",
        "translation": "If a bodhisattva-mahāsattva practices prajñāpāramitā, not practicing the profundity of ignorance is practicing prajñāpāramitā, and not practicing the profundity of form, consciousness, name and form, the six sense-fields, touch, feeling, craving, grasping, existence, birth, old age, grief, pain, and sorrow is practicing prajñāpāramitā.",
        "source": "T06n0220_298:0518c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0518c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0518c21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明甚深性則非無明，行乃至老死愁歎苦憂惱甚深性則非行乃至老死愁歎苦憂惱故。",
        "translation": "The profundity of nescience is not nescience, and the profundity of formations and even the grief, sorrow, pain, and vexation of old age are not formations and even the grief, sorrow, pain, and vexation of old age.",
        "source": "T06n0220_298:0518c21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0518c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行布施波羅蜜多甚深性是行般若波羅蜜多，不行淨戒、安忍、精進、靜慮、般若波羅蜜多甚深性是行般若波羅蜜多。",
        "translation": "\"When bodhisattvas and mahāsattvas practice prajñāpāramitā, not practicing the profundity of the perfection of generosity is practicing prajñāpāramitā, and not practicing the profundity of pure precepts, patience, effort, meditation, and the perfection of prajñāpāramitā is practicing prajñāpāramitā.",
        "source": "T06n0220_298:0518c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0518c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0518c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施波羅蜜多甚深性則非布施波羅蜜多，淨戒乃至般若波羅蜜多甚深性則非淨戒乃至般若波羅蜜多故。",
        "translation": "The profundity of the perfection of generosity is not the perfection of generosity, and the profundity of the pure precepts and even the perfection of wisdom are not the pure precepts and even the perfection of wisdom.",
        "source": "T06n0220_298:0518c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0519a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行內空甚深性是行般若波羅蜜多，不行外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空甚深性是行般若波羅蜜多。",
        "translation": "If a bodhisattva-mahāsattva practices prajñāpāramitā, not practicing the profundity of internal emptiness is practicing prajñāpāramitā, and not practicing the profundity of external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, existent emptiness, impermanent emptiness, ultimate emptiness, infinite emptiness, dispersed emptiness, unchanging emptiness, emptiness of original nature, emptiness of own characteristics, emptiness of shared characteristics, emptiness of all things, inaccessible emptiness, natureless emptiness, self-nature emptiness, and natureless self-nature emptiness is practicing prajñāpāramitā.",
        "source": "T06n0220_298:0519a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0519a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0519a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空甚深性則非內空，外空乃至無性自性空甚深性則非外空乃至無性自性空故。",
        "translation": "The profundity of internal emptiness is not internal emptiness, and the profundity of external emptiness or even the emptiness of a natureless self-nature is not external emptiness or the emptiness of a natureless self-nature.",
        "source": "T06n0220_298:0519a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0519a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行真如甚深性是行般若波羅蜜多，不行法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界甚深性是行般若波羅蜜多。",
        "translation": "If a bodhisattva-mahāsattva practices prajñāpāramitā, not practicing the profundity of true thusness is practicing prajñāpāramitā, and not practicing the profundity of the Dharma realm, Dharma nature, non-falsity, unchanging difference, equality, freedom from birth, legality, Dharma abiding, reality, the space realm, and the inconceivable realm is practicing prajñāpāramitā.",
        "source": "T06n0220_298:0519a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0519a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0519a14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真如甚深性則非真如，法界乃至不思議界甚深性則非法界乃至不思議界故。",
        "translation": "The profundity of the true thusness is then not true, and the profundity of the Dharma realm and even the inconceivable realm is then not the Dharma realm or even the inconceivable realm.",
        "source": "T06n0220_298:0519a14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0519a16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行苦聖諦甚深性是行般若波羅蜜多，不行集、滅、道聖諦甚深性是行般若波羅蜜多。",
        "translation": "\"When a bodhisattva-mahāsattva practices prajñā-pāramitā, not practicing the profundity of the noble truth of suffering is practicing prajñā-pāramitā, and not practicing the profundity of the noble truths of accumulation, cessation, and the path is practicing prajñā-pāramitā.",
        "source": "T06n0220_298:0519a16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0519a19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0519a19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦聖諦甚深性則非苦聖諦，集、滅、道聖諦甚深性則非集、滅、道聖諦故。",
        "translation": "The profundity of the noble truth of suffering is not the noble truth of suffering, and the profundity of the noble truths of arising, ceasing, and the path is not the noble truth of arising, ceasing, and the path.",
        "source": "T06n0220_298:0519a19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0519a21_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行四靜慮甚深性是行般若波羅蜜多，不行四無量、四無色定甚深性是行般若波羅蜜多。",
        "translation": "If a bodhisattva-mahāsattva practices prajñā-pāramitā, not practicing the profundity of the four meditations is practicing prajñā-pāramitā, and not practicing the profundity of the four immeasurable and four formless concentrations is practicing prajñā-pāramitā.",
        "source": "T06n0220_298:0519a21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0519a24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0519a24_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四靜慮甚深性則非四靜慮，四無量、四無色定甚深性則非四無量、四無色定故。",
        "translation": "The profundity of the four meditations is not the four meditations, and the profundity of the four immeasurable and four formless concentrations is not the four immeasurable and four formless concentrations.",
        "source": "T06n0220_298:0519a24_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0519a26_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行八解脫甚深性是行般若波羅蜜多，不行八勝處、九次第定、十遍處甚深性是行般若波羅蜜多。",
        "translation": "If a bodhisattva-mahāsattva practices prajñā-pāramitā, not practicing the profundity of the eight liberations is practicing prajñā-pāramitā, and not practicing the profundity of the eight abodes of excellence, nine graduated concentrations, and ten universal abodes is practicing prajñā-pāramitā.",
        "source": "T06n0220_298:0519a26_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0519a29_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0519b01_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八解脫甚深性則非八解脫，八勝處、九次第定、十遍處甚深性則非八勝處、九次第定、十遍處故。",
        "translation": "The profundity of the eight liberations is not the eight liberations, and the profundity of the eight abodes of excellence, nine graduated concentrations, and ten universal abodes is not the eight abodes of excellence, nine graduated concentrations, or ten universal abodes.",
        "source": "T06n0220_298:0519b01_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0519b03_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行四念住甚深性是行般若波羅蜜多，不行四正斷、四神足、五根、五力、七等覺支、八聖道支甚深性是行般若波羅蜜多。",
        "translation": "If a bodhisattva-mahāsattva practices prajñā-pāramitā, not practicing the profundity of the four abodes of mindfulness is practicing prajñā-pāramitā, and not practicing the profundity of the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eightfold noble path is practicing prajñā-pāramitā.",
        "source": "T06n0220_298:0519b03_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0519b07_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0519b07_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四念住甚深性則非四念住，四正斷乃至八聖道支甚深性則非四正斷乃至八聖道支故。",
        "translation": "The profundity of the four abodes of mindfulness is not the four abodes of mindfulness, and the profundity of the four correct eliminations and the eight noble factors of the path is not the four correct eliminations and the eight noble factors of the path.",
        "source": "T06n0220_298:0519b07_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0519b09_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行空解脫門甚深性是行般若波羅蜜多，不行無相、無願解脫門甚深性是行般若波羅蜜多。",
        "translation": "If a bodhisattva-mahāsattva practices prajñāpāramitā, not practicing the profundity of the liberation gate of emptiness is practicing prajñāpāramitā, and not practicing the profundity of the liberation gate of signlessness and wishlessness is practicing prajñāpāramitā.",
        "source": "T06n0220_298:0519b09_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0519b12_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0519b12_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空解脫門甚深性則非空解脫門，無相、無願解脫門甚深性則非無相、無願解脫門故。",
        "translation": "The profundity of the gate of liberation through emptiness is not the gate of liberation through emptiness, and the profundity of the gate of liberation through signlessness and wishlessness is not the gate of liberation through signlessness and wishlessness.",
        "source": "T06n0220_298:0519b13_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0519b15_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行菩薩十地甚深性是行般若波羅蜜多。",
        "translation": "If a bodhisattva-mahāsattva practices prajñā-pāramitā, not practicing the profundity of the bodhisattva's ten stages is practicing prajñā-pāramitā.",
        "source": "T06n0220_298:0519b15_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0519b17_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0519b17_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩十地甚深性則非菩薩十地故。",
        "translation": "The profundity of the bodhisattva's ten stages is not the bodhisattva's ten stages.",
        "source": "T06n0220_298:0519b17_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "\"Śāriputra!",
        "source": "T06n0220_298:0519b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜多時，不行五眼甚深性是行般若波羅蜜多，不行六神通甚深性是行般若波羅蜜多。",
        "translation": "\"When a bodhisattva Mahāsattva practices prajñāpāramitā, not practicing the profundity of the five eyes is practicing prajñāpāramitā, and not practicing the profundity of the six psychic powers is practicing prajñāpāramitā.",
        "source": "T06n0220_298:0519b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T06n0220_298:0519b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利子！",
        "translation": "Śāriputra!",
        "source": "T06n0220_298:0519b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眼甚深性則非五眼，六神通甚深性則非六神通故。",
        "translation": "The profundity of the five eyes is not the five eyes, and the profundity of the six psychic powers is not the six psychic powers.",
        "source": "T06n0220_298:0519b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第二百九十八",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 298",
        "source": "T06n0220_298:0519b24_0",
        "is_bad_quality": false
    }
]